{
  "source_file": "aapl-20250628.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2.    Management’s Discussion and Analysis of Financial Condition and Results of Operations\nThis Item and other sections of this Quarterly Report on Form 10-Q (“Form 10-Q”) contain forward-looking statements, within the meaning of the Private Securities Litigation Reform Act of 1995, that involve risks and uncertainties. Forward-looking statements provide current expectations of future events based on certain assumptions and include any statement that does not directly relate to any historical or current fact. For example, statements in this Form 10-Q regarding the potential future impact of macroeconomic conditions and tariffs and other measures on the Company’s business and results of operations are forward-looking statements\n.\n Forward-looking statements can also be identified by words such as “future,” “anticipates,” “believes,” “estimates,” “expects,” “intends,” “plans,” “predicts,” “will,” “would,” “could,” “can,” “may,” and similar terms. Forward-looking statements are not guarantees of future performance and the Company’s actual results may differ significantly from the results discussed in the forward-looking statements. Factors that might cause such differences include, but are not limited to, those discussed in Part I, Item 1A of the 2024 Form 10-K and Part II, Item 1A of this Form 10-Q, in each case under the heading “Risk Factors.” The Company assumes no obligation to revise or update any forward-looking statements for any reason, except as required by law.\nUnless otherwise stated, all information presented herein is based on the Company’s fiscal calendar, and references to particular years, quarters, months or periods refer to the Company’s fiscal years ended in September and the associated quarters, months and periods of those fiscal years.\nThe following discussion should be read in conjunction with the 2024 Form 10-K filed with the U.S. Securities and Exchange Commission (the “SEC”) and the condensed consolidated financial statements and accompanying notes included in Part I, Item 1 of this Form 10-Q.\nAvailable Information\nThe Company periodically provides certain information for investors on its corporate website, www.apple.com, and its investor relations website, investor.apple.com. This includes press releases and other information about financial performance, information on corporate governance, and details related to the Company’s annual meeting of shareholders. The information contained on the websites referenced in this Form 10-Q is not incorporated by reference into this filing. Further, the Company’s references to website URLs are intended to be inactive textual references only.\nBusiness Seasonality and Product Introductions\nThe Company has historically experienced higher net sales in its first quarter compared to other quarters in its fiscal year due in part to seasonal holiday demand. Additionally, new product and service introductions can significantly impact net sales, cost of sales and operating expenses. The timing of product introductions can also impact the Company’s net sales to its indirect distribution channels as these channels are filled with new inventory following a product launch, and channel inventory of an older product often declines as the launch of a newer product approaches. Net sales can also be affected when consumers and distributors anticipate a product introduction.\nDuring the third quarter of 2025, the Company announced iOS 26, macOS\n®\n Tahoe 26, iPadOS\n®\n 26, watchOS\n®\n 26, visionOS\n®\n 26 and tvOS\n®\n 26.\nMacroeconomic Conditions\nMacroeconomic conditions, including inflation, interest rates and currency fluctuations, have directly and indirectly impacted, and could in the future materially impact, the Company’s results of operations and financial condition.\nApple Inc. | Q3 2025 Form 10-Q | 13\nTariffs and Other Measures\nBeginning in the second quarter of 2025, new tariffs were announced on imports to the U.S. (“U.S. Tariffs”), including additional tariffs on imports from China, India, Japan, South Korea, Taiwan, Vietnam and the European Union (“EU”), among others. In response, several countries have imposed, or threatened to impose, reciprocal tariffs on imports from the U.S. and other retaliatory measures. Various modifications to the U.S. Tariffs have been announced and further changes could be made in the future, which may include additional sector-based tariffs or other measures. For example, the U.S. Department of Commerce has initiated an investigation under Section 232 of the Trade Expansion Act of 1962, as amended, into, among other things, imports of semiconductors, semiconductor manufacturing equipment, and their derivative products, including downstream products that contain semiconductors. Tariffs and other measures that are applied to the Company’s products or their components can have a material adverse impact on the Company’s business, results of operations and financial condition, including impacting the Company’s supply chain, the availability of rare earths and other raw materials and components, pricing and gross margin. The ultimate impact remains uncertain and will depend on several factors, including whether additional or incremental U.S. Tariffs or other measures are announced or imposed, to what extent other countries implement tariffs or other retaliatory measures in response, and the overall magnitude and duration of these measures. Trade and other international disputes can have an adverse impact on the overall macroeconomic environment and result in shifts and reductions in consumer spending and negative consumer sentiment for the Company’s products and services, all of which can further adversely affect the Company’s business and results of operations.\nSegment Operating Performance\nThe following table shows net sales by reportable segment for the three- and nine-month periods ended June 28, 2025 and June 29, 2024 (dollars in millions):\nThree Months Ended\nNine Months Ended\nJune 28,\n2025\nJune 29,\n2024\nChange\nJune 28,\n2025\nJune 29,\n2024\nChange\nAmericas\n$\n41,198 \n$\n37,678 \n9 \n%\n$\n134,161 \n$\n125,381 \n7 \n%\nEurope\n24,014 \n21,884 \n10 \n%\n82,329 \n76,404 \n8 \n%\nGreater China\n15,369 \n14,728 \n4 \n%\n49,884 \n51,919 \n(4)\n%\nJapan\n5,782 \n5,097 \n13 \n%\n22,067 \n19,126 \n15 \n%\nRest of Asia Pacific\n7,673 \n6,390 \n20 \n%\n25,254 \n23,275 \n9 \n%\nTotal net sales\n$\n94,036 \n$\n85,777 \n10 \n%\n$\n313,695 \n$\n296,105 \n6 \n%\nAmericas\nAmericas net sales increased during the third quarter and first nine months of 2025 compared to the same periods in 2024 due primarily to higher net sales of iPhone and Services. The weakness in foreign currencies relative to the U.S. dollar had an unfavorable year-over-year impact on Americas net sales during the third quarter and first nine months of 2025.\nEurope\nEurope net sales increased during the third quarter and first nine months of 2025 compared to the same periods in 2024 due primarily to higher net sales of Services and iPhone.\nGreater China\nGreater China net sales increased during the third quarter of 2025 compared to the third quarter of 2024 due primarily to higher net sales of iPhone and Mac. Greater China net sales decreased during the first nine months of 2025 compared to the same period in 2024 due to lower net sales of iPhone, partially offset by higher net sales of Mac.\nJapan\nJapan net sales increased during the third quarter and first nine months of 2025 compared to the same periods in 2024 due primarily to higher net sales of iPhone and Services. The strength in the yen relative to the U.S. dollar had a favorable year-over-year impact on Japan net sales during the third quarter of 2025.\nRest of Asia Pacific\nRest of Asia Pacific net sales increased during the third quarter and first nine months of 2025 compared to the same periods in 2024 due primarily to higher net sales of Services and iPhone.\nApple Inc. | Q3 2025 Form 10-Q | 14\nProducts and Services Performance\nThe following table shows net sales by category for the three- and nine-month periods ended June 28, 2025 and June 29, 2024 (dollars in millions):\nThree Months Ended\nNine Months Ended\nJune 28,\n2025\nJune 29,\n2024\nChange\nJune 28,\n2025\nJune 29,\n2024\nChange\niPhone\n$\n44,582 \n$\n39,296 \n13 \n%\n$\n160,561 \n$\n154,961 \n4 \n%\nMac\n8,046 \n7,009 \n15 \n%\n24,982 \n22,240 \n12 \n%\niPad\n6,581 \n7,162 \n(8)\n%\n21,071 \n19,744 \n7 \n%\nWearables, Home and Accessories\n7,404 \n8,097 \n(9)\n%\n26,673 \n27,963 \n(5)\n%\nServices\n27,423 \n24,213 \n13 \n%\n80,408 \n71,197 \n13 \n%\nTotal net sales\n$\n94,036 \n$\n85,777 \n10 \n%\n$\n313,695 \n$\n296,105 \n6 \n%\niPhone\niPhone net sales increased during the third quarter and first nine months of 2025 compared to the same periods in 2024 due to higher net sales of Pro models.\nMac\nMac net sales increased during the third quarter and first nine months of 2025 compared to the same periods in 2024 due to higher net sales of both laptops and desktops.\niPad\niPad net sales decreased during the third quarter of 2025 compared to the third quarter of 2024 due to lower net sales of iPad Pro\n®\n, partially offset by higher net sales of all other iPad models. iPad net sales increased during the first nine months of 2025 compared to the same period in 2024 due primarily to higher net sales of iPad Air\n®\n.\nWearables, Home and Accessories\nWearables, Home and Accessories net sales decreased during the third quarter and first nine months of 2025 compared to the same periods in 2024 due primarily to lower net sales of Wearables and Accessories.\nServices\nServices net sales increased during the third quarter and first nine months of 2025 compared to the same periods in 2024 due primarily to higher net sales from advertising, the App Store\n®\n and cloud services.\nApple Inc. | Q3 2025 Form 10-Q | 15\nGross Margin\nProducts and Services gross margin and gross margin percentage for the three- and nine-month periods ended June 28, 2025 and June 29, 2024, were as follows (dollars in millions):\nThree Months Ended\nNine Months Ended\nJune 28,\n2025\nJune 29,\n2024\nJune 28,\n2025\nJune 29,\n2024\nGross margin:\nProducts\n$\n22,993 \n$\n21,761 \n$\n86,190 \n$\n84,241 \nServices\n20,725 \n17,917 \n60,670 \n52,563 \nTotal gross margin\n$\n43,718 \n$\n39,678 \n$\n146,860 \n$\n136,804 \nGross margin percentage:\nProducts\n34.5\n%\n35.3\n%\n36.9\n%\n37.5\n%\nServices\n75.6\n%\n74.0\n%\n75.5\n%\n73.8\n%\nTotal gross margin percentage\n46.5\n%\n46.3\n%\n46.8\n%\n46.2\n%\nProducts Gross Margin\nProducts gross margin increased during the third quarter of 2025 compared to the third quarter of 2024 due primarily to a different mix of products and favorable costs, partially offset by tariffs. Products gross margin increased during the first nine months of 2025 compared to the same period in 2024 due primarily to favorable costs and a different mix of products, partially offset by tariffs and the weakness in foreign currencies relative to the U.S. dollar.\nProducts gross margin percentage decreased during the third quarter of 2025 compared to the third quarter of 2024 due primarily to tariffs and a different mix of products, partially offset by favorable costs. Products gross margin percentage decreased during the first nine months of 2025 compared to the same period in 2024 due primarily to a different mix of products and tariffs, partially offset by favorable costs.\nServices Gross Margin\nServices gross margin increased during the third quarter and first nine months of 2025 compared to the same periods in 2024 due primarily to higher Services net sales and a different mix of services.\nServices gross margin percentage increased during the third quarter and first nine months of 2025 compared to the same periods in 2024 due primarily to a different mix of services, partially offset by higher costs.\nThe Company’s future gross margins can be impacted by a variety of factors, as discussed in Part I, Item 1A of the 2024 Form 10-K and Part II, Item 1A of this Form 10-Q, in each case under the heading “Risk Factors.” As a result, the Company believes, in general, gross margins will be subject to volatility and downward pressure.\nApple Inc. | Q3 2025 Form 10-Q | 16\nOperating Expenses\nOperating expenses for the three- and nine-month periods ended June 28, 2025 and June 29, 2024, were as follows (dollars in millions):\nThree Months Ended\nNine Months Ended\nJune 28,\n2025\nJune 29,\n2024\nJune 28,\n2025\nJune 29,\n2024\nResearch and development\n$\n8,866 \n$\n8,006 \n$\n25,684 \n$\n23,605 \nPercentage of total net sales\n9\n%\n9\n%\n8\n%\n8\n%\nSelling, general and administrative\n$\n6,650 \n$\n6,320 \n$\n20,553 \n$\n19,574 \nPercentage of total net sales\n7\n%\n7\n%\n7\n%\n7\n%\nTotal operating expenses\n$\n15,516 \n$\n14,326 \n$\n46,237 \n$\n43,179 \nPercentage of total net sales\n17\n%\n17\n%\n15\n%\n15\n%\nResearch and Development\nThe growth in research and development (“R&D”) expense during the third quarter and first nine months of 2025 compared to the same periods in 2024 was driven primarily by increases in headcount-related expenses and infrastructure-related costs.\nSelling, General and Administrative\nThe growth in selling, general and administrative expense during the third quarter and first nine months of 2025 compared to the same periods in 2024 was driven primarily by increases in headcount-related expenses and variable selling expenses.\nProvision for Income Taxes\nProvision for income taxes, effective tax rate and statutory federal income tax rate for the three- and nine-month periods ended June 28, 2025 and June 29, 2024, were as follows (dollars in millions):\nThree Months Ended\nNine Months Ended\nJune 28,\n2025\nJune 29,\n2024\nJune 28,\n2025\nJune 29,\n2024\nProvision for income taxes\n$\n4,597 \n$\n4,046 \n$\n15,381 \n$\n14,875 \nEffective tax rate\n16.4\n%\n15.9\n%\n15.4\n%\n15.8\n%\nStatutory federal income tax rate\n21\n%\n21\n%\n21\n%\n21\n%\nThe Company’s effective tax rate for the third quarter of 2025 was lower than the statutory federal income tax rate due primarily to a lower effective tax rate on foreign earnings, the impact of the U.S. federal R&D credit, and tax benefits from share-based compensation, partially offset by state income taxes. The Company’s effective tax rate for the first nine months of 2025 was lower than the statutory federal income tax rate due primarily to a lower effective tax rate on foreign earnings, including the impact of changes in unrecognized tax benefits, tax benefits from share-based compensation, and the impact of the U.S. federal R&D credit, partially offset by state income taxes.\nThe Company’s effective tax rate for the third quarter of 2025 was higher compared to the third quarter of 2024 due primarily to the impact from foreign currency revaluations of unrecognized tax benefits. The Company’s effective tax rate for the first nine months of 2025 was lower compared to the same period in 2024 due primarily to the impact of changes in unrecognized tax benefits, partially offset by a higher effective tax rate on foreign earnings.\nApple Inc. | Q3 2025 Form 10-Q | 17\nLiquidity and Capital Resources\nThe Company believes its balances of cash, cash equivalents and marketable securities, along with cash generated by ongoing operations and continued access to debt markets, will be sufficient to satisfy its cash requirements and capital return program over the next 12 months and beyond.\nThe Company’s contractual cash requirements have not changed materially since the 2024 Form 10-K, except for manufacturing purchase obligations and the State Aid Decision tax payable.\nManufacturing Purchase Obligations\nThe Company utilizes several outsourcing partners to manufacture subassemblies for the Company’s products and to perform final assembly and testing of finished products. The Company also obtains individual components for its products from a wide variety of individual suppliers. As of June 28, 2025, the Company had manufacturing purchase obligations of $44.1 billion, with $43.8 billion payable within 12 months.\nState Aid Decision Tax Payable\nDuring the first nine months of 2025, the Company released from escrow €14.2 billion, or $15.4 billion, to Ireland in connection with the State Aid Decision, which fully settled the obligation.\nCapital Return Program\nIn addition to its contractual cash requirements, the Company has authorized share repurchase programs. The programs do not obligate the Company to acquire a minimum amount of shares. As of June 28, 2025, the Company’s quarterly cash dividend was $0.26 per share. The Company intends to increase its dividend on an annual basis, subject to declaration by the Board of Directors.\nDuring the third quarter of 2025, the Company repurchased $21.0 billion of its common stock and paid dividends and dividend equivalents of $3.9 billion.\nRecent Accounting Pronouncements\nDisaggregation of Income Statement Expenses\nIn November 2024, the Financial Accounting Standards Board (the “FASB”) issued Accounting Standards Update (“ASU”) No. 2024-03, \nIncome Statement—Reporting Comprehensive Income—Expense Disaggregation Disclosures (Subtopic 220-40): Disaggregation of Income Statement Expenses \n(“ASU 2024-03”) and in January 2025, the FASB issued ASU No. 2025-01, \nIncome Statement—Reporting Comprehensive Income—Expense Disaggregation Disclosures (Subtopic 220-40): Clarifying the Effective Date\n, which clarified the effective date of ASU 2024-03. ASU 2024-03 will require the Company to disclose the amounts of purchases of inventory, employee compensation, depreciation and intangible asset amortization, as applicable, included in certain expense captions in the Consolidated Statements of Operations, as well as qualitatively describe remaining amounts included in those captions. ASU 2024-03 will also require the Company to disclose both the amount and the Company’s definition of selling expenses. The Company will adopt ASU 2024-03 in its fourth quarter of 2028 using a prospective transition method.\nIncome Taxes\nIn December 2023, the FASB issued ASU No. 2023-09, \nIncome Taxes (Topic 740): Improvements to Income Tax Disclosures \n(“ASU 2023-09”), which will require the Company to disclose specified additional information in its income tax rate reconciliation and provide additional information for reconciling items that meet a quantitative threshold. ASU 2023-09 will also require the Company to disaggregate its income taxes paid disclosure by federal, state and foreign taxes, with further disaggregation required for significant individual jurisdictions. The Company will adopt ASU 2023-09 in its fourth quarter of 2026 using a prospective transition method.\nSegment Reporting\nIn November 2023, the FASB issued ASU No. 2023-07, \nSegment Reporting (Topic 280): Improvements to Reportable Segment Disclosures \n(“ASU 2023-07”), which will require the Company to disclose segment expenses that are significant and regularly provided to the Company’s chief operating decision maker (“CODM”). In addition, ASU 2023-07 will require the Company to disclose the title and position of its CODM and how the CODM uses segment profit or loss information in assessing segment performance and deciding how to allocate resources. The Company will adopt ASU 2023-07 in its fourth quarter of 2025 using a retrospective transition method.\nApple Inc. | Q3 2025 Form 10-Q | 18\nCritical Accounting Estimates\nThe preparation of financial statements and related disclosures in conformity with GAAP and the Company’s discussion and analysis of its financial condition and operating results require the Company’s management to make judgments, assumptions and estimates that affect the amounts reported. Note 1, “Summary of Significant Accounting Policies” of the Notes to Condensed Consolidated Financial Statements in Part I, Item 1 of this Form 10-Q and in the Notes to Consolidated Financial Statements in Part II, Item 8 of the 2024 Form 10-K describe the significant accounting policies and methods used in the preparation of the Company’s condensed consolidated financial statements. There have been no material changes to the Company’s critical accounting estimates since the 2024 Form 10-K."
}