{
  "source_file": "abbv-20241231.htm",
  "form_type": "10-K",
  "item1": "ITEM 1. BUSINESS\nOverview\nAbbVie or \"the company\" refer to AbbVie Inc., or AbbVie Inc. and its consolidated subsidiaries, as the context requires. AbbVie\n \nis a global, diversified research-based biopharmaceutical company positioned for success with a comprehensive product portfolio that has leadership positions across immunology, oncology, aesthetics, neuroscience and eye care. AbbVie uses its expertise, dedicated people and unique approach to innovation to develop and market advanced therapies that address some of the world’s most complex and serious diseases. AbbVie was incorporated in Delaware on April 10, 2012. On January 1, 2013, AbbVie became an independent, publicly-traded company as a result of the distribution by Abbott Laboratories (Abbott) of 100% of the outstanding common stock of AbbVie to Abbott's shareholders.\nSegments\nAbbVie operates as a single global business segment dedicated to the research and development, manufacturing, commercialization and sale of innovative medicines and therapies. This operating structure enables the Chief Executive Officer, as Chief Operating Decision Maker (CODM), to allocate resources and assess business performance on a global basis in order to achieve established long-term strategic goals. Consistent with this structure, a global research and development and supply chain organization is responsible for the discovery, development, manufacturing and supply of products. Commercial efforts that coordinate the marketing, sales and distribution of these products are organized by geographic region or therapeutic area. All of these activities are supported by a global corporate administrative staff. The determination of a single business segment is consistent with the consolidated financial information regularly reviewed by the CODM for purposes of assessing performance, allocating resources and planning and forecasting future periods. See Note 16, \"Segment and Geographic Area Information\" to the Consolidated Financial Statements included under Item 8, \"Financial Statements and Supplementary Data\" and the sales information related to AbbVie's key products and geographies included under Item 7, \"Management's Discussion and Analysis of Financial Condition and Results of Operations.\"\nProducts\nAbbVie's portfolio of products includes a broad line of therapies that address some of the world's most complex and serious diseases.\nImmunology products. \nAbbVie maintains an extensive immunology portfolio across rheumatology, dermatology and gastroenterology. AbbVie's immunology products address unmet needs for patients with autoimmune diseases. These products are:\nHumira.\n    Humira (adalimumab) is a biologic therapy administered as a subcutaneous injection. It is approved to treat the following autoimmune diseases in the United States, Canada and Mexico (collectively, North America) and in the European Union:\nCondition\n \nPrincipal Markets\nRheumatoid arthritis (moderate to severe)\n \nNorth America, European Union\nPsoriatic arthritis\n \nNorth America, European Union\nAnkylosing spondylitis\n \nNorth America, European Union\nCrohn's disease (moderate to severe)\n \nNorth America, European Union\nPlaque psoriasis (moderate to severe chronic)\n \nNorth America, European Union\nJuvenile idiopathic arthritis (moderate to severe polyarticular)\n \nNorth America, European Union\nUlcerative colitis (moderate to severe)\n \nNorth America, European Union\nNon-radiographic axial spondyloarthritis\n \nEuropean Union\nPediatric Crohn's disease (moderate to severe)\n \nNorth America, European Union\nHidradenitis suppurativa (moderate to severe)\n \nNorth America, European Union\nPediatric enthesitis-related arthritis\n \nEuropean Union\nNon-infectious intermediate, posterior and panuveitis\nNorth America, European Union\nPediatric ulcerative colitis (moderate to severe)\nNorth America, European Union\nPediatric uveitis\nNorth America, European Union\n1 \n \n \n|\n  \n2024 Form 10-K\n                                                         \nHumira is also approved in Japan for the treatment of intestinal Behçet's disease, generalized pustular psoriasis, and pyoderma gangrenosum.\nHumira is sold in numerous other markets worldwide, including Japan, China, Brazil and Australia.\nSkyrizi.\n    Skyrizi (risankizumab) is an interleukin-23 (IL-23) inhibitor that selectively blocks IL-23 by binding to its p19 subunit. It is a biologic therapy approved to treat the following autoimmune diseases in North America, the European Union and Japan:\nCondition\nPrincipal Markets\nPlaque psoriasis (moderate to severe)\nNorth America, European Union, Japan\nPsoriatic arthritis\nNorth America, European Union, Japan\nCrohn's disease (moderate to severe)\nNorth America, European Union, Japan\nUlcerative colitis (moderate to severe)\nU.S., Canada, European Union, Japan\nSkyrizi is also approved in Japan for the treatment of erythrodermic psoriasis in patients who have an inadequate response to conventional therapies, for generalized pustular psoriasis, and for palmoplantar pustulosis in patients who have an inadequate response to conventional therapies.\nSkyrizi is approved in multiple countries globally, including the United States, Canada and the European Union, for the treatment of moderate to severe plaque psoriasis in adults who are candidates for systemic therapy or phototherapy. In psoriatic disease (psoriasis or psoriatic arthritis), Skyrizi is administered as a quarterly subcutaneous injection following two induction doses. When administered for Crohn’s disease and ulcerative colitis, Skyrizi is given in three induction doses via IV infusion, followed by subcutaneous injection via an on-body injector every eight weeks.\nRinvoq\n.    Rinvoq (upadacitinib) is an oral, once-daily selective and reversible JAK inhibitor that is approved to treat the following inflammatory diseases in North America, the European Union and Japan:\nCondition\n \nPrincipal Markets\nRheumatoid arthritis (moderate to severe)\n \nNorth America, European Union, Japan\nPsoriatic arthritis\n \nNorth America, European Union, Japan\nAnkylosing spondylitis\n \nNorth America, European Union, Japan\nAtopic dermatitis (moderate to severe)\n \nNorth America, European Union, Japan\nNon-radiographic axial spondyloarthritis\nU.S., Canada, European Union, Japan\nUlcerative colitis (moderate to severe)\nNorth America, European Union, Japan\nCrohn's disease (moderate to severe)\nU.S., Canada, European Union, Japan\nActive polyarticular juvenile idiopathic arthritis\nU.S.\nIn the United States, Rinvoq is indicated for the treatment of moderate to severe active rheumatoid arthritis, for active psoriatic arthritis in adults and children 2 years of age and older, for moderate to severe active ulcerative colitis, for active ankylosing spondylitis and for active non-radiographic axial spondyloarthritis in adult patients who have an inadequate response or intolerance to one or more TNF blockers. It is also indicated for the treatment of Crohn's disease in adult patients who have an inadequate response or intolerance to one or more TNF blockers and for moderate to severe atopic dermatitis in adults and children 12 years of age and older whose disease is not adequately controlled with other systemic drug products, including biologics, or when use of those therapies are inadvisable.\nIn the European Union, Rinvoq is indicated for the treatment of moderate to severe rheumatoid arthritis in adults, for active psoriatic arthritis in adults who have an inadequate response or intolerance to disease-modifying anti-rheumatic medicines (DMARDs), and for active axial spondyloarthritis in adults. It is also indicated for the treatment of Crohn's disease in adult patients who have an inadequate response or intolerance to one or more TNF blockers and for moderate to severe atopic dermatitis in adults and children 12 years of age and older, and for moderately to severely active ulcerative colitis in adults. \nRINVOQ is sold in numerous other markets worldwide, including China, Brazil, and Australia. In the United States, a liquid formulation (RINVOQ LQ) is also approved for use in pediatric patients with psoriatic arthritis and polyarticular juvenile idiopathic arthritis.\n2024 Form 10-K\n   |  \n2\n                                                         \nOncology products. \nAbbVie’s oncology products target some of the most complex and difficult-to-treat cancers. These products are:\nImbruvica.\n \nImbruvica (ibrutinib) is an oral, once-daily therapy that inhibits a protein called Bruton's tyrosine kinase. Imbruvica was one of the first medicines to receive a United States Food and Drug Administration (FDA) approval after being granted a Breakthrough Therapy Designation and is one of the few therapies to receive four separate designations. Imbruvica currently is approved for the treatment of adult patients with blood cancers such as chronic lymphocytic leukemia (CLL), as well as certain forms of non-Hodgkin lymphoma. Imbruvica is approved in adult and pediatric patients one year and older with chronic graft versus host disease after failure of one or more lines of systemic therapy.\nVenclexta/Venclyxto.    \nVenclexta (venetoclax) is a B-cell lymphoma 2 (BCL-2) inhibitor used to treat blood cancers. Venclexta is approved by the FDA for adults with CLL or small lymphocytic lymphoma. In addition, Venclexta is approved in combination with azacitidine, or decitabine, or low-dose cytarabine to treat adults with newly-diagnosed acute myeloid leukemia who are 75 years of age or older or have other medical conditions that prevent the use of standard chemotherapy.\nElahere.    \nElahere (mirvetuximab soravtansine-gynx) is an antibody-drug conjugate (ADC) used to treat certain types of cancer. Elahere is approved in both the United States and the European Union for the treatment of adult patients with FRα positive, platinum-resistant epithelial ovarian, fallopian tube, or primary peritoneal cancer, who have received one to three prior systemic treatment regimens. \nEpkinly\n.    Epkinly (epcoritamab) is a product used to treat adults with certain types of diffuse large B-cell lymphoma (DLBCL) and high-grade B-cell lymphoma that has recurred or that does not respond to previous treatment after receiving two or more treatments. Epkinly is administered as a subcutaneous injection. Epkinly is also approved to treat adults with relapsed or refractory follicular lymphoma.\nAesthetics products.\n AbbVie’s Aesthetics portfolio consists of facial injectables, plastics and regenerative medicine, body contouring and skincare products, which hold market-leading positions in the U.S. and in key markets around the world. These products are:\nBotox Cosmetic.    \nBotox Cosmetic is an acetylcholine release inhibitor and a neuromuscular blocking agent indicated for treatment in four areas: temporary improvement in the appearance of moderate to severe glabellar lines (frown lines between the eyebrows), moderate to severe crow's feet, moderate to severe forehead lines in adults and moderate to severe platysma bands. Botox Cosmetic is approved for use in all major markets around the world and is approved for the treatment of masseter muscle prominence in China.\nThe Juvederm Collection of Fillers.    \nThe Juvederm Collection of Fillers is a portfolio of hyaluronic acid-based dermal fillers with a variety of approved indications in the U.S. and in other major markets around the world to augment or treat volume loss in the temples, undereye, cheeks, chin, lips and lower face.\nOther aesthetics.    \nOther aesthetics products include, but are not limited to, Alloderm regenerative dermal tissue, CoolSculpting body contouring technology, Natrelle breast implants, the SkinMedica skincare line, Latisse eyelash solution and DiamondGlow dermabrasion technology.\nNeuroscience products.\n AbbVie’s neuroscience products address some of the most difficult-to-treat neurologic diseases. These products are:\nBotox Therapeutic.    \nBotox Therapeutic (onabotulinumtoxinA injection) is an acetylcholine release inhibitor and a neuromuscular blocking agent that is injected into muscle tissue. In the United States, it is approved to treat numerous indications, including chronic migraine, overactive bladder in adults who have an inadequate response to an anticholinergic medication, and urinary incontinence due to detrusor overactivity associated with a neurologic condition in adults who have an inadequate response to an anticholinergic medication. In addition, Botox Therapeutic is approved to treat spasticity in patients two years of age and older, cervical dystonia in adults, as well as other conditions. Botox is marketed in other countries around the world and licenses will vary. Botox Therapeutic is marketed by GSK in Japan.\nVraylar.    \nVraylar (cariprazine) is a dopamine D3-preferring D3/D2 receptor partial agonist and a 5-HT1A receptor partial agonist. Vraylar is indicated for acute and maintenance treatment of schizophrenia in adults, acute treatment of manic or mixed episodes associated with bipolar disorder in adults, acute treatment of depressive episodes associated with bipolar I disorder in adults and as an adjunctive treatment in major depressive disorder.\nDuopa and Duodopa\n (carbidopa and levodopa).    AbbVie's levodopa-carbidopa intestinal gel for the treatment of advanced Parkinson's disease is marketed as Duopa in the United States and as Duodopa outside of the United States.\n3 \n \n \n|\n  \n2024 Form 10-K\n                                                         \nUbrelvy.    \nUbrelvy (ubrogepant) is a calcitonin gene-related peptide receptor antagonist indicated for the acute treatment of migraine with or without aura in adults. Ubrelvy is commercialized in the United States, Israel, Saudi Arabia, United Arab Emirates and Canada.\nQulipta.    \nQulipta (atogepant) is a calcitonin gene-related peptide receptor antagonist indicated for the preventive treatment of episodic and chronic migraine in adults. Qulipta is commercialized in the United States and Canada and is approved in the European Union under the brand name Aquipta.\nOther neuroscience.    \nOther neuroscience products include Vyalev/Produodopa, a subcutaneous 24-hour infusion of levodopa-based therapy approved for the treatment of motor fluctuations in adults with advanced Parkinson's disease, as well as other products.\nEye care products.\n AbbVie’s eye care products address unmet needs and new approaches to help preserve and protect patients’ vision. These products are:\nOzurdex\n.    Ozurdex (dexamethasone intravitreal implant) is a corticosteroid implant that slowly releases medication over time. Injected directly into the back of the eye, it dissolves naturally and does not need to be removed. Ozurdex is indicated for the treatment of adult patients with visual impairment due to diabetic macular oedema (DME), adult patients with macular oedema following either Branch Retinal Vein Occlusion (BRVO) or Central Retinal Vein Occlusion (CRVO) and patients with inflammation of the posterior segment of the eye presenting as non-infectious uveitis. Ozurdex® is commercially available in the United States and numerous markets around the world.\nLumigan/Ganfort.    \nLumigan (bimatoprost ophthalmic solution) 0.01% is a once daily, topical prostaglandin analog indicated for the reduction of elevated intraocular pressure (IOP) in patients with open angle glaucoma (OAG) or ocular hypertension (OHT). Ganfort is a once daily topical fixed combination of bimatoprost 0.03% and timolol 0.5% for the reduction of IOP in adult patients with OAG or OHT. Lumigan is sold in the United States and numerous markets around the world, while Ganfort is approved in the European Union and some markets in South America, the Middle East and Asia.\nAlphagan/Combigan.    \nAlphagan (brimonidine tartrate ophthalmic solution) is an alpha-adrenergic receptor agonist indicated for the reduction of elevated IOP in patients with open-angle glaucoma or ocular hypertension. Combigan (brimonidine tartrate/timolol maleate ophthalmic solution) is approved for reducing elevated IOP in patients with glaucoma who require additional or adjunctive IOP-lowering therapy. Both Alphagan and Combigan are available for sale in the United States and numerous markets around the world.\nRestasis.    \nRestasis is a calcineurin inhibitor immunosuppressant indicated to increase tear production in patients whose tear production is presumed to be suppressed due to ocular inflammation associated with keratoconjunctivitis sicca. Restasis is approved in the United States and a number of other markets in South America, the Middle East and Asia.\nOther eye care.    \nOther eye care products include Refresh/Optive, Xen and Durysta.\nOther key products.\n AbbVie’s other key products include, among other things, treatments for patients with hepatitis C virus (HCV), metabolic and hormone products that target a number of conditions, including exocrine pancreatic insufficiency and hypothyroidism, as well as endocrinology products for the palliative treatment of advanced prostate cancer, treatment of endometriosis and central precocious puberty and for the preoperative treatment of patients with anemia caused by uterine fibroids. These products are:\nMavyret/Maviret.    \nMavyret (glecaprevir/pibrentasvir) is approved in the United States and European Union (Maviret) for the treatment of adult and pediatric patients (12 years and older or weighing at least 45 kilograms) with chronic HCV genotype 1-6 infection without cirrhosis and with compensated cirrhosis (Child-Pugh A). It is also indicated for the treatment of adult and pediatric patients (12 years and older or weighing at least 45 kilograms) with HCV genotype 1 infection, who previously have been treated with a regimen containing an HCV NS5A inhibitor or an NS3/4A protease inhibitor, but not both. \nCreon.    \nCreon (pancrelipase) is a pancreatic enzyme therapy for exocrine pancreatic insufficiency, a condition that occurs in patients with cystic fibrosis, chronic pancreatitis and several other conditions. AbbVie has the rights to sell Creon only in the United States.\nLinzess/Constella.    \nLinzess (linaclotide) is a once-daily guanylate cyclase-C agonist used in adults to treat irritable bowel syndrome with constipation (IBS‑C) and chronic idiopathic constipation. The product is marketed as Linzess in the United States and as Constella outside of the United States.\n2024 Form 10-K\n   |  \n4\n                                                         \nMarketing, Sales and Distribution Capabilities\nAbbVie utilizes a combination of dedicated commercial resources, regional commercial resources and distributorships to market, sell and distribute its products worldwide. AbbVie directs its primary marketing efforts toward securing the prescription, or recommendation, of its brand of products by physicians, external experts and other health care providers. Managed care providers (for example, health maintenance organizations and pharmacy benefit managers), hospitals and state and federal government agencies (for example, State Medicaid programs, the United States Department of Veterans Affairs and the United States Department of Defense) are also important customers. AbbVie also markets directly to consumers themselves, although in the United States many of the company's products must be sold pursuant to a prescription. Outside of the United States, AbbVie focuses its promotional and market access efforts on external experts, payers, physicians and health systems. AbbVie also provides patient support programs closely related to its products. \nAbbVie's products are generally sold worldwide directly to wholesalers, distributors, government agencies, health care facilities, specialty pharmacies and independent retailers from AbbVie-owned distribution centers and public warehouses. Certain products (including aesthetic products and devices) are also sold directly to physicians and other licensed healthcare providers. Although AbbVie's business does not have significant seasonality, AbbVie's product revenues may be affected by end customer and retail buying patterns, fluctuations in wholesaler inventory levels and other factors.\nIn the United States, AbbVie distributes pharmaceutical products principally through independent wholesale distributors, with some sales directly to retailers, pharmacies, patients or other customers. In 2024, three wholesale distributors (McKesson Corporation, Cardinal Health, Inc. and Cencora, Inc.) accounted for substantially all of AbbVie's pharmaceutical product sales in the United States. No individual wholesaler accounted for greater than 39% of AbbVie's 2024 gross revenues in the United States. Outside the United States, AbbVie sells products primarily to wholesalers or through distributors, and depending on the market works through largely centralized national payers systems to agree on reimbursement terms.\nCertain products are co-marketed or co-promoted with other companies. AbbVie has no single customer that, if the customer were lost, would have a material adverse effect on the company's business. No material portion of AbbVie's business is subject to renegotiation of profits or termination of contracts at the election of the government. Orders are generally filled on a current basis and order backlog is not material to AbbVie's business.\nCompetition\nThe markets for AbbVie's products are highly competitive. AbbVie competes with other research-based pharmaceuticals and biotechnology companies that discover, manufacture, market and sell proprietary pharmaceutical products, therapies and biologics. For example, AbbVie's immunology products compete with anti-TNF products, JAK inhibitors and other competitive products intended to treat a number of disease states, and AbbVie's oncology products compete with BTK inhibitors and other competitive products intended to treat certain cancers. In addition, in the past few years, a number of other companies have started to develop, have successfully developed and/or are currently marketing products that are being positioned as competitors to Botox. The search for technological innovations in pharmaceutical products is a significant aspect of competition. The introduction of new products by competitors and changes in medical practices and procedures can result in product obsolescence. Price is also a competitive factor. In addition, the substitution of generic and biosimilar pharmaceutical products for branded pharmaceutical products creates competitive pressures on AbbVie's products that do not have patent protection. New products or treatments brought to market by AbbVie’s competitors could cause revenues for AbbVie’s products to decrease due to price reductions and sales volume decreases.\nBiosimilars.\n    Competition for AbbVie’s biologic products is affected by the approval of follow-on biologics, also known as “biosimilars.” Biologics have added major therapeutic options for the treatment of many diseases, including some for which therapies were unavailable or inadequate. The cost of developing and producing biologic therapies is typically dramatically higher than for small molecule medications, and many biologic medications are used for ongoing treatment of chronic diseases, such as rheumatoid arthritis or inflammatory bowel disease, or for the treatment of previously untreatable cancer. Significant investments in biologics infrastructure and manufacturing are necessary to produce biologic products.\nHumira faces direct biosimilar competition globally, and AbbVie will continue to face competitive pressure from these biologics and from orally administered products.\nIn the United States, the FDA regulates biologics under the Federal Food, Drug, and Cosmetic Act (the FFDCA), the Public Health Service Act (PHSA) and the regulations implementing these statutes. The enactment of federal health care reform legislation in March 2010 provided a pathway for approval of biosimilars under the PHSA, but the approval process for, and science behind, biosimilars is complex. Approval by the FDA is dependent upon many factors, including a showing that the biosimilar is \"highly similar\" to the original product and has no clinically meaningful differences from the original product in \n5 \n \n \n|\n  \n2024 Form 10-K\n                                                         \nterms of safety, purity and potency. The types of data that could ordinarily be required in an application to show similarity may include analytical data, bioequivalence studies and studies to demonstrate chemical similarity, animal studies (including toxicity studies) and clinical studies. \nFurthermore, the law provides that only a biosimilar product that is determined to be \"interchangeable\" will be considered by the FDA as substitutable for the original biologic product without the intervention of the health care provider who prescribed the original biologic product. To prove that a biosimilar product is interchangeable, the applicant must demonstrate that the product can be expected to produce the same clinical results as the original biologic product in any given patient, and if the product is administered more than once in a patient, that safety risks and potential for diminished efficacy of alternating or switching between the use of the interchangeable biosimilar biologic product and the original biologic product is no greater than the risk of using the original biologic product without switching. The law continues to be interpreted and implemented by the FDA. As a result, its full ultimate impact, implementation and meaning remains subject to uncertainty.\nIntellectual Property Protection and Regulatory Exclusivity\nGenerally, upon approval, products may be entitled to certain kinds of exclusivity under applicable intellectual property and regulatory regimes. AbbVie’s intellectual property is materially valuable to the company, and AbbVie seeks patent protection, where available, in all significant markets and/or countries for each product in development. In the United States, the expiration date for patents is 20 years after the filing date. Given that patents relating to pharmaceutical products are often obtained early in the development process and given the amount of time needed to complete clinical trials and other development activities required for regulatory approval, the length of time between product launch and patent expiration is significantly less than 20 years. The Drug Price Competition and Patent Term Restoration Act of 1984 (commonly known as the Hatch-Waxman Act) permits a patent holder to seek a patent extension, commonly called a “patent term restoration,” for patents on products (or processes for making the product) regulated by the FFDCA. The length of the patent extension is roughly based on 50 percent of the period of time from the filing of an Investigational New Drug Application (NDA) for a compound to the submission of the NDA for such compound, plus 100 percent of the time period from NDA submission to regulatory approval. The extension, however, cannot exceed five years and the patent term remaining after regulatory approval cannot exceed 14 years. Biological products licensed under the PHSA are similarly eligible for terms of patent restoration.\nPharmaceutical products may be entitled to other forms of legal or regulatory exclusivity upon approval. The scope, length and requirements for each of these exclusivities vary both in the United States and in other jurisdictions. In the United States, if the FDA approves a conventional drug product that contains an active ingredient not previously approved, the product is typically entitled to five years of non-patent regulatory exclusivity. Specific conditions of use approved for individual products may also be entitled to three years of exclusivity if approval was based on the FDA’s reliance on new clinical studies essential to approval submitted by the NDA applicant. If the NDA applicant studies the product for use by children, the FDA may grant pediatric exclusivity, which extends by 180 days all existing exclusivities (patent and regulatory) related to the product. For products that are either used to treat conditions that afflict a relatively small population or for which there is not a reasonable expectation that the research and development costs will be recovered, the FDA may designate the pharmaceutical as an orphan drug and grant it seven years of exclusivity. Other types of regulatory exclusivity may also be available, such as Generating New Antibiotic Incentives Now (GAIN) exclusivity, which can provide new antibiotic or new antifungal drugs an additional five years of exclusivity to be added to certain exclusivities already provided for by law.\nApplicable laws and regulations dictate the scope of any exclusivity to which a product or particular characteristics of a product is entitled upon approval in any particular country. In certain instances, regulatory exclusivity may offer protection where patent protection is no longer available or for a period of time in excess of patent protection. It is not possible to estimate for each product in development the total period and scope of exclusivity to which it may become entitled until regulatory approval is obtained or sometimes even later. However, given the length of time required to complete clinical development of a pharmaceutical product, the periods of exclusivity that might be achieved in any individual case would not generally be expected to exceed a minimum of three years and a maximum of 14 years. These estimates do not consider other factors, such as the difficulty of recreating the manufacturing process for a particular product or other proprietary knowledge that may delay the introduction of a generic or other follow-on product after the expiration of applicable patent and other regulatory exclusivity periods.\nBiologics may be entitled to exclusivity under the Biologics Price Competition and Innovation Act, which was passed on March 23, 2010 as Title VII to the Patient Protection and Affordable Care Act. The law provides a pathway for approval of biosimilars following the expiration of 12 years of regulatory exclusivity for the innovator biologic and a potential additional 180 day-extension term for conducting pediatric studies. Biologics are also eligible for orphan drug exclusivity, as discussed above. The law also includes an extensive process for the innovator biologic and biosimilar manufacturer to litigate patent \n2024 Form 10-K\n   |  \n6\n                                                         \ninfringement, validity and enforceability. The European Union has also created a pathway for approval of biosimilars and has published guidelines for approval of certain biosimilar products. The more complex nature of biologics and biosimilar products has led to close regulatory scrutiny over follow-on biosimilar products, which can reduce the effect of biosimilars on sales of the innovator biologic as compared to the sales erosion caused by generic versions of small molecule pharmaceutical products.\nAbbVie owns or has licensed rights to a substantial number of patents and patent applications. AbbVie licenses or owns a patent portfolio of thousands of patent families, each of which includes United States patent applications and/or issued patents and may also contain the non-United States counterparts to these patents and applications.\nThese patents and applications, including various patents that expire during the period 2025 to the mid 2040s, in aggregate are believed to be of material importance in the operation of AbbVie’s business. However, AbbVie believes that no single patent, license, trademark (or related group of patents, licenses, or trademarks), are material in relation to the company’s business as a whole. \nIn addition, the following patents, licenses and trademarks are significant: those related to risankizumab (which is sold under the trademark Skyrizi) and those related to upadacitinib (which is sold under the trademark Rinvoq). The United States composition of matter patents covering risankizumab and upadacitinib are expected to expire in 2033.\nAbbVie may rely, in some circumstances, on trade secrets to protect its technology. AbbVie seeks to protect its technology and product candidates, in part, by confidentiality agreements with its employees, consultants, advisors, contractors and collaborators. These agreements may be breached and AbbVie may not have adequate remedies for any breach. In addition, AbbVie’s trade secrets may otherwise become known or be independently discovered by competitors. To the extent that AbbVie’s employees, consultants, advisors, contractors and collaborators use intellectual property owned by others in their work for the company, disputes may arise as to the rights in related or resulting know-how and inventions.\nLicensing, Acquisitions and Other Arrangements\nIn addition to its independent efforts to develop and market products, AbbVie enters into arrangements such as acquisitions, option-to-acquire agreements, licensing arrangements, option-to-license arrangements, strategic alliances, co-promotion arrangements, co-development and co-marketing agreements and joint ventures. The acquisitions and option-to-acquire agreements typically include, among other terms and conditions, non-refundable purchase price payments or option fees, option exercise payments, milestones or earn-outs and other customary terms and obligations. The licensing and other arrangements typically include, among other terms and conditions, non-refundable upfront license fees, option fees and option exercise payments, milestone payments and royalty and/or profit sharing obligations. See Note 5, \"Licensing, Acquisitions and Other Arrangements—Other Licensing & Acquisitions Activity,\" to the Consolidated Financial Statements included under Item 8, \"Financial Statements and Supplementary Data.\"\nThird Party Agreements\nAbbVie has agreements with third parties for process development, product distribution, analytical services and manufacturing of certain products. AbbVie procures certain products and services from a limited number of suppliers and, in some cases, a single supply source. In addition, AbbVie has agreements with third parties for active pharmaceutical ingredient and product manufacturing, formulation and development services, fill, finish and packaging services, transportation and distribution and logistics services for certain products. AbbVie does not believe that these manufacturing-related agreements are material because AbbVie's business is not substantially dependent on any individual agreement. In most cases, AbbVie maintains alternate supply relationships that it can utilize without undue disruption of its manufacturing processes if a third party fails to perform its contractual obligations. AbbVie seeks to maintain sufficient inventory of product to minimize the impact of any supply disruption.\nAbbVie is also party to certain collaborations and other arrangements, as discussed in Note 5, \"Licensing, Acquisitions and Other Arrangements—Other Licensing & Acquisitions Activity,\" to the Consolidated Financial Statements included under Item 8, \"Financial Statements and Supplementary Data.\"\nSources and Availability of Raw Materials\nAbbVie purchases, in the ordinary course of business, raw materials and supplies essential to its operations from numerous suppliers around the world. In addition, certain medical devices and components necessary for the manufacture of AbbVie products are provided by unaffiliated third party suppliers. AbbVie has robust business continuity and supplier monitoring programs. \n7 \n \n \n|\n  \n2024 Form 10-K\n                                                         \nResearch and Development Activities\nAbbVie makes a significant investment in research and development and has numerous compounds (and complementary devices) in clinical development, including potential treatments for complex, life-threatening diseases. AbbVie's ability to discover and develop new compounds is enhanced by the company's use of integrated discovery and development project teams, which include chemists, biologists, physicians and pharmacologists who work on the same compounds as a team. AbbVie also partners with third parties, such as biotechnology companies, other pharmaceutical companies and academic institutions to identify and prioritize promising new treatments that complement and enhance AbbVie’s existing portfolio. AbbVie also supplements its research and development efforts with acquisitions.\nThe research and development process generally begins with discovery research which focuses on the identification of a molecule that has a desired effect against a given disease. If preclinical testing of an identified compound proves successful, the compound moves into clinical development which generally includes the following phases:\n•\nPhase 1— involves the first human tests in a small number of healthy volunteers or patients to assess safety, tolerability and doses for later phases.\n•\nPhase 2— tests different doses of the drug in a disease state in order to assess efficacy.\n•\nPhase 3— tests a drug that demonstrates favorable results in the earlier phases in a significantly larger patient population to further demonstrate efficacy and safety in order to meet requirements to enable global approval.\nPreclinical data and clinical trials from all of the development phases provide the data required to prepare and submit an NDA, a Biological License Application (BLA) or other submission for regulatory approval to the FDA or similar government agencies outside the United States. The specific requirements (e.g., scope of clinical trials) for obtaining regulatory approval vary across different countries and geographic regions.\nThe research and development process from discovery through a new drug launch typically takes 8 to 12 years and can be even longer. The research and development of new pharmaceutical products has a significant amount of inherent uncertainty. There is no guarantee when, or if, a molecule will receive the regulatory approval required to launch a new drug or indication.\nIn addition to the development of new products, delivery devices and new formulations, research and development projects also may include Phase 4 trials, sometimes called post-marketing studies. For such projects, clinical trials are designed and conducted to collect additional data regarding, among other parameters, the benefits and risks of an approved drug.\nRegulation—Discovery and Clinical Development\nUnited States.\n    Securing approval to market a new pharmaceutical product in the United States requires substantial effort and financial resources and takes several years to complete. The applicant must complete preclinical tests and submit protocols to the FDA before commencing clinical trials. Clinical trials are intended to establish the safety and efficacy of the pharmaceutical product and typically are conducted in sequential phases, although the phases may overlap or be combined. If the required clinical testing is successful, the results are submitted to the FDA in the form of an NDA or BLA requesting approval to market the product for one or more indications. The FDA reviews an NDA or BLA to determine whether a product is safe and effective for its intended use and whether its manufacturing is compliant with current Good Manufacturing Practices (cGMP).\nCompliance with regulatory requirements is assured through periodic, announced or unannounced inspections by the FDA and other regulatory authorities, and these inspections associated with clinical development may include the sponsor, investigator sites, laboratories, hospitals and manufacturing facilities of AbbVie's subcontractors or other third-party manufacturers. Failure to comply with applicable regulatory requirements can result in enforcement action by the FDA, including rejection of an NDA or BLA.\nEven if an NDA or a BLA receives approval, the applicant must comply with post-approval requirements. For example, holders of an approval must report adverse reactions, provide updated safety and efficacy information and comply with requirements concerning advertising and promotional materials and activities. Also, quality control and manufacturing procedures must continue to conform to cGMP after approval, and certain changes to the manufacturing procedures and finished product must be submitted and approved by the FDA prior to implementation. The FDA periodically inspects manufacturing facilities to assess compliance with cGMP, which imposes extensive procedural and record keeping requirements. In addition, as a condition of approval, the FDA may require post-marketing testing and surveillance to further assess and monitor the product's safety or efficacy after commercialization, which may require additional clinical trials, patient registries, observational data or additional work on chemistry, manufacturing and controls. Any post-approval \n2024 Form 10-K\n   |  \n8\n                                                         \nregulatory obligations, and the cost of complying with such obligations, could expand in the future. Further, the FDA continues to regulate product labeling, and prohibits the promotion of products for unapproved or “off-label” uses along with other labeling restrictions.\nOutside the United States.\n    AbbVie is subject to similar regulatory requirements outside the United States for approval and marketing of pharmaceutical products. AbbVie must obtain approval of a clinical trial application or product from applicable supervising regulatory authorities before it can commence clinical trials or marketing of the product in target markets. The approval requirements and process for each country can vary, and the time required to obtain approval may be longer or shorter than that required for FDA approval in the United States. For example, AbbVie may submit marketing authorizations in the European Union under either a centralized or decentralized procedure. The centralized procedure is mandatory for the approval of biotechnology products and many pharmaceutical products and provides for a single marketing authorization that is valid for all European Union member states. Under the centralized procedure, a single marketing authorization application is submitted to the European Medicines Agency. After the agency evaluates the application, it makes a recommendation to the European Commission, which then makes the final determination on whether to approve the application. The decentralized procedure provides for mutual recognition of individual national approval decisions and is available for products that are not subject to the centralized procedure.\nIn Japan, applications for approval of a new product are made through the Pharmaceutical and Medical Devices Agency (PMDA). Japan-specific trials and/or bridging studies to demonstrate that the non-Japanese clinical data applies to Japanese patients are usually required. After completing a comprehensive review, the PMDA reports to the Ministry of Health, Labour and Welfare, which then approves or denies the application.\nSimilarly, applications for a new product in China are submitted to the Center for Drug Evaluation of the National Medical Products Administration for technical review and approval of a product for marketing in China. Clinical data in Chinese subjects are usually required to support approval in China, requiring the inclusion of China in global pivotal studies, or a separate China/Asian clinical trial.\nThe regulatory process in many emerging markets continues to evolve. Many emerging markets, including those in Asia, generally require regulatory approval to have been obtained in a large developed market (such as the United States or Europe) before the country will begin or complete its regulatory review process. Similar to the requirements in Japan and China, certain countries (notably South Korea, Taiwan, India and Russia) also generally require that clinical studies that include data from patients in those countries be conducted in order to support local regulatory approval.\nThe requirements governing the conduct of clinical trials and product licensing also vary. In addition, post-approval regulatory obligations such as adverse event reporting and cGMP compliance generally apply and may vary by country. For example, after a marketing authorization has been granted in the European Union, periodic safety reports must be submitted and other pharmacovigilance measures may be required (such as Risk Management Plans).\nRegulation—Commercialization, Distribution and Manufacturing\nThe manufacturing, marketing, sale, promotion and distribution of AbbVie's products are subject to comprehensive government regulation. Government regulation by various national, regional, federal, state and local agencies, both in the United States and other countries, addresses (among other matters) inspection of, and controls over, research and laboratory procedures, clinical investigations, product approvals and manufacturing, labeling, packaging, marketing and promotion, pricing and reimbursement, sampling, distribution, quality control, post-marketing surveillance, record keeping, storage and disposal practices. AbbVie's operations are also affected by trade regulations in many countries that limit the import of raw materials and finished products and by laws and regulations that seek to prevent corruption and bribery in the marketplace (including the United States Foreign Corrupt Practices Act and the United Kingdom Bribery Act, which provide guidance on corporate interactions with government officials) and require safeguards for the protection of personal data. In addition, AbbVie is subject to laws and regulations pertaining to health care fraud and abuse, including state and federal anti-kickback and false claims laws in the United States. Prescription drug manufacturers such as AbbVie are also subject to taxes, as well as application, product, user and other fees.\nCompliance with these laws and regulations is costly and materially affects AbbVie's business. Among other effects, health care regulations substantially increase the time, difficulty and costs incurred in obtaining and maintaining approval to market newly developed and existing products. AbbVie expects compliance with these regulations to continue to require significant technical expertise and capital investment to ensure compliance. Failure to comply can delay the release of a new product or result in regulatory and enforcement actions, the seizure or recall of a product, the suspension or revocation of the authority necessary for a product's production and sale and other civil or criminal sanctions, including fines and penalties.\n9 \n \n \n|\n  \n2024 Form 10-K\n                                                         \nIn addition to regulatory initiatives, AbbVie's business can be affected by ongoing studies of the utilization, safety, efficacy and outcomes of health care products and their components that are regularly conducted by industry participants, government agencies and others. These studies can lead to updates to the data regarding utilization, safety and efficacy of previously marketed products. In some cases, these studies have resulted, and may in the future result, in the discontinuance of, or limitations on, marketing of such products domestically or worldwide, and may give rise to claims for damages from persons who believe they have been injured as a result of their use.\nAccess to human health care products continues to be a subject of oversight, investigation and action by governmental agencies, legislative bodies and private organizations in the United States and other countries. A major focus is cost containment. Efforts to reduce health care costs are also being made in the private sector, notably by health care payers and providers, which have instituted various cost reduction and containment measures. AbbVie expects insurers and providers to continue attempts to reduce the cost of health care products. Outside the United States, many countries control the price of health care products directly or indirectly, through reimbursement, payment, pricing, coverage limitations, or compulsory licensing. Political and budgetary pressures in the United States and in other countries may also heighten the scope and severity of pricing pressures on AbbVie's products for the foreseeable future.\n United States.\n    Specifically, U.S. federal laws require pharmaceutical manufacturers to pay certain statutorily-prescribed rebates to state Medicaid programs on prescription drugs reimbursed under state Medicaid plans, and the efforts by states to seek additional rebates may affect AbbVie's business. Similarly, the Veterans Health Care Act of 1992, as a prerequisite to participation in Medicaid and other federal health care programs, requires that manufacturers extend additional discounts on pharmaceutical products to various federal agencies, including the United States Department of Veterans Affairs, Department of Defense and Public Health Service entities and institutions. In addition, recent legislative changes would require similarly discounted prices to be offered to TRICARE program beneficiaries. The Veterans Health Care Act of 1992 also established the 340B drug discount program, which requires pharmaceutical manufacturers to provide products at reduced prices to various designated health care entities and facilities.\nIn the United States, most states also have generic substitution legislation requiring or permitting a dispensing pharmacist to substitute a different manufacturer's generic version of a pharmaceutical product for the one prescribed. In addition, the federal government follows a diagnosis-related group (DRG) payment system for certain institutional services provided under Medicare or Medicaid and has implemented a prospective payment system (PPS) for services delivered in hospital outpatient, nursing home and home health settings. DRG and PPS entitle a health care facility to a fixed reimbursement based on the diagnosis and/or procedure rather than actual costs incurred in patient treatment, thereby increasing the incentive for the facility to limit or control expenditures for many health care products. Medicare reimburses Part B drugs based on average sales price plus a certain percentage to account for physician administration costs, which have been reduced in the hospital outpatient setting. Medicare enters into contracts with private plans to negotiate prices for most patient-administered medicine delivered under Part D.\nUnder the Patient Protection and Affordable Care Act and the Health Care and Education Reconciliation Act (together, the Affordable Care Act), AbbVie pays a fee related to its pharmaceuticals sales to government programs. In addition, through the end of 2024 AbbVie provided a discount of 70% for branded prescription drugs sold to patients who fell into the Medicare Part D coverage gap, or \"donut hole.\"\nThe Affordable Care Act also includes provisions known as the Physician Payments Sunshine Act, which require manufacturers of drugs and biologics covered under Medicare and Medicaid to record any transfers of value to physicians and teaching hospitals and to report this data to the Centers for Medicare and Medicaid Services for subsequent public disclosure. Similar reporting requirements have also been enacted on the state level in the United States, and an increasing number of countries worldwide either have adopted or are considering similar laws requiring disclosure of interactions with health care professionals. Failure to report appropriate data may result in civil or criminal fines and/or penalties.\nThe Inflation Reduction Act of 2022 (the IRA) requires: (i) the government to set prices for select high expenditure Medicare Part D drugs (prices effective beginning in 2026) and Part B drugs (prices effective beginning in 2028) that are more than nine years (for small-molecule drugs) or 13 years (for biological products) from their FDA approval, (ii) manufacturers to pay a rebate for Medicare Part B and Part D drugs when prices for those drugs increase faster than inflation beginning in 2022 for Part D and 2023 for Part B, and (iii) a Medicare Part D redesign replacing the current coverage gap provisions and establishing a $2,000 cap for out-of-pocket costs for Medicare beneficiaries beginning in 2025, with manufacturers being responsible for 10% of costs up to the $2,000 cap and 20% after that cap is reached. In August 2023, the U.S. Department of Health and Human Services (HHS), through the Centers for Medicare & Medicaid Services (the CMS), selected Imbruvica as one of the first 10 medicines subject to government-set prices beginning in 2026. In August 2024, the CMS published Medicare Part D prices that will be applicable to these medicines, including Imbruvica, beginning January 1, 2026. In January 2025, HHS, through the CMS, selected Vraylar and Linzess as two of the 15 medicines subject to government-set prices \n2024 Form 10-K\n   |  \n10\n                                                         \nbeginning in 2027. It is possible that more of our products, including products that generate substantial revenues, could be selected in future years, which could, among other things, accelerate revenue erosion prior to expiration of intellectual property protections. The effect of reducing prices and reimbursement could significantly impact revenues for certain of our products.\nEuropean Union.\n    The European Union has adopted directives and other legislation governing labeling, advertising, distribution, supply, pharmacovigilance and marketing of pharmaceutical products. Such legislation provides mandatory standards throughout the European Union and permits member states to supplement these standards with additional regulations. European governments also regulate pharmaceutical product prices through their control of national health care systems that fund a large part of the cost of such products to consumers. As a result, patients are unlikely to use a pharmaceutical product that is not reimbursed by the government. In many European countries, the government either regulates the pricing of a new product at launch or subsequent launch through direct price controls or reference pricing. In recent years, many countries have also imposed new or additional cost containment measures on pharmaceutical products. Differences between national pricing regimes create price differentials within the European Union that can lead to significant parallel trade in pharmaceutical products.\nMost governments also promote generic substitution by mandating or permitting a pharmacist to substitute a different manufacturer's generic version of a pharmaceutical product for the one prescribed and by permitting or mandating that health care professionals prescribe generic versions in certain circumstances. Many governments are also following a similar path for biosimilar therapies. In addition, governments use reimbursement lists to limit the pharmaceutical products that are eligible for reimbursement by national health care systems.\n Japan.\n    In Japan, the National Health Insurance system maintains a Drug Price List specifying which pharmaceutical products are eligible for reimbursement, and the Ministry of Health, Labour and Welfare sets the prices of the products on this list. The government generally introduces price cut rounds every other year and also mandates price decreases for specific products. New products judged innovative or useful, that are indicated for pediatric use, or that target orphan or small population diseases, however, may be eligible for a pricing premium. The government has also promoted the use of generics, where available.\n Emerging Markets.\n    Many emerging markets take steps to reduce pharmaceutical product prices, in some cases through direct price controls and in others through the promotion of generic/biosimilar alternatives to branded pharmaceuticals.\nSince AbbVie markets its products worldwide, certain products of a local nature and variations of product lines must also meet other local regulatory requirements. Certain additional risks are inherent in conducting business outside the United States, including price and currency exchange controls, changes in currency exchange rates, limitations on participation in local enterprises, expropriation, nationalization and other governmental action.\nRegulation – Medical Devices\nMedical devices are subject to regulation by the FDA, state agencies and foreign government health authorities. FDA regulations, as well as various U.S. federal and state laws, govern the development, clinical testing, manufacturing, labeling, record keeping and marketing of medical device products agencies in the United States. AbbVie’s medical device product candidates, including AbbVie’s breast implants,\n \nmust undergo rigorous clinical testing and an extensive government regulatory clearance or approval process prior to sale in the United States and other countries. The lengthy process of clinical development and submissions for clearance or approval, and the continuing need for compliance with applicable laws and regulations, require the expenditure of substantial resources. Regulatory clearance or approval, when and if obtained, may be limited in scope, and may significantly limit the indicated uses for which a product may be marketed. Cleared or approved products and their manufacturers are subject to ongoing review, and discovery of previously unknown problems with products may result in restrictions on their manufacture, sale and/or use or require their withdrawal from the market.\nUnited States\n.     AbbVie’s medical device products are subject to extensive regulation by the FDA in the United States. Unless an exemption applies, each medical device AbbVie markets in the United States must have a 510(k) clearance or a Premarket Approval Application (PMA) in accordance with the FFDCA and its implementing regulations. The FDA classifies medical devices into one of three classes, depending on the degree of risk associated with each medical device and the extent of controls that are needed to ensure safety and effectiveness. Devices deemed to pose a lower risk are placed in either Class I or Class II, and devices deemed by the FDA to pose the greatest risk, such as life-sustaining, life-supporting or implantable devices, or a device deemed to be not substantially equivalent to a previously cleared 510(k) device, are placed in Class III. In general, a Class III device cannot be marketed in the United States unless the FDA approves the device after submission of a PMA, and any changes to the device subsequent to initial FDA approval must also be reviewed and approved by the FDA. The majority of AbbVie’s medical device products, including AbbVie’s breast implants, are regulated as Class III medical devices. A \n11 \n \n \n|\n  \n2024 Form 10-K\n                                                         \nClass III device may have significant additional obligations imposed in its conditions of approval, and the time in which it takes to obtain approval can be long. Compliance with regulatory requirements is assured through periodic, unannounced facility inspections by the FDA and other regulatory authorities, and these inspections may include the manufacturing facilities of AbbVie’s subcontractors or other third-party manufacturers. Failure to comply with applicable regulatory requirements can result in enforcement action by the FDA, which may include any of the following sanctions: warning letters or untitled letters; fines, injunctions and civil penalties; recall or seizure of AbbVie’ products; operating restrictions, partial suspension or total shutdown of production; refusing AbbVie’ request for 510(k) clearance or PMA approval of new products; withdrawing 510(k) clearance or PMA approvals that are already granted; and criminal prosecution.\nA clinical trial is almost always required to support a PMA application and is sometimes required for a 510(k) premarket notification. Clinical trials generally require submission of an application for an investigational device exemption (IDE), which must be supported by appropriate data, such as animal and laboratory testing results, showing that it is safe to test the device in humans and that the testing protocol is scientifically sound. A study sponsor must obtain approval for its IDE from the FDA, and it must also obtain approval of its study from the Institutional Review Board overseeing the trial. The results of clinical testing may not be sufficient to obtain approval of the investigational device.\nOnce a device is approved, the manufacture and distribution of the device remains subject to continuing regulation by the FDA, including Quality System Regulation requirements, which involve design, testing, control, documentation and other quality assurance procedures during the manufacturing process. Medical device manufacturers and their subcontractors are required to register their establishments and list their manufactured devices with the FDA and are subject to periodic unannounced inspections by the FDA and certain state agencies for compliance with regulatory requirements. Manufacturers must also report to the FDA if their devices may have caused or contributed to a death or serious injury or malfunctioned in a way that could likely cause or contribute to a death or serious injury, or if the manufacturer conducts a field correction or product recall or removal to reduce a risk to health posed by a device or to remedy a violation of the FFDCA that may present a health risk. Further, the FDA continues to regulate device labeling, and prohibits the promotion of products for unapproved or “off-label” uses along with other labeling restrictions.\nEuropean Union.    \nMedical device products that are marketed in the European Union must comply with the requirements of the Medical Device Regulation (the MDR), which came into effect in May 2021. The MDR provides for regulatory oversight with respect to the design, manufacture, clinical trials, labeling and adverse event reporting for medical devices to ensure that medical devices marketed in the European Union are safe and effective for their intended uses. Medical devices that comply with the MDR are entitled to bear a Conformité Européenne marking evidencing such compliance and may be marketed in the European Union. Failure to comply with these domestic and international regulatory requirements could affect AbbVie’s ability to market and sell AbbVie’s products in these countries.\nEnvironmental Matters\nAbbVie believes that its operations comply in all material respects with applicable laws and regulations concerning environmental protection. Regulations under federal and state environmental laws impose stringent limitations on emissions and discharges to the environment from various manufacturing operations. AbbVie's capital expenditures for pollution control in 2024 were approximately $13 million and operating expenditures were approximately $35 million. In 2025, capital expenditures for pollution control are estimated to be approximately $15 million and operating expenditures are estimated to be approximately $37 million.\nAbbott was identified as one of many potentially responsible parties in investigations and/or remediations at several locations in the United States, including Puerto Rico, under the Comprehensive Environmental Response, Compensation and Liability Act, commonly known as Superfund. Some of these locations were transferred to AbbVie in connection with the separation and distribution, and AbbVie has become a party to these investigations and remediations. Abbott was also engaged in remediation at several other sites, some of which have been transferred to AbbVie in connection with the separation and distribution, in cooperation with the Environmental Protection Agency or similar agencies. While it is not feasible to predict with certainty the final costs related to those investigations and remediation activities, AbbVie believes that such costs, together with other expenditures to maintain compliance with applicable laws and regulations concerning environmental protection, should not have a material adverse effect on the company's financial position, cash flows, or results of operations.\nEmployees\nAbbVie employed approximately 55,000 employees in over 70 countries as of January 31, 2025. Outside the United States, some of AbbVie's employees are represented by unions or works councils. AbbVie believes that it has good relations with its employees.\n2024 Form 10-K\n   |  \n12\n                                                         \nHuman Capital Management\nAttracting, retaining and providing meaningful growth and development opportunities to AbbVie's employees is critical to the company's success in making a remarkable impact on people’s lives around the world. AbbVie leverages numerous resources to identify and enhance strategic and leadership capability, foster employee engagement and create a culture where talent is productive and engaged. AbbVie invests in its employees through competitive compensation, benefits and employee support programs and offers best-in-class development and leadership opportunities. AbbVie has developed a deep talent base through ongoing investment in functional and leadership training and by sourcing world-class external talent, ensuring a sustainable talent pipeline. \nAttracting and Developing Talent.    \nAttracting and developing high-performing talent is essential to AbbVie’s continued success. AbbVie implements detailed talent attraction strategies, with an emphasis on STEM skill sets and other critical skillsets, including drug discovery, clinical development, market access and business development. AbbVie seeks candidates with diverse backgrounds, experiences, and perspectives to enhance innovation and problem-solving. AbbVie also invests in competitive compensation and benefits programs. In addition to offering a comprehensive suite of benefits ranging from medical and dental coverage to retirement, disability and life insurance programs, AbbVie also provides health promotion programs, mental health awareness campaigns and employee assistance programs in several countries, financial wellness support, on-site health screenings and immunizations in several countries and on-site fitness and rehabilitation centers. AbbVie has on-site health care clinics at certain locations, offering convenient and affordable access to quality healthcare, flu shots and vaccines. In addition, the AbbVie Employee Assistance Fund (a part of the AbbVie Foundation) supports two programs for global employees: the AbbVie Possibilities Scholarship for children of employees, which is an annual merit-based scholarship for use at accredited colleges, universities or vocational-technical schools; and the Employee Relief Program, which is financial assistance to support short term needs of employees when faced with large-scale disasters (e.g. a hurricane), individual disasters (e.g. a home fire) or financial hardship (e.g. the death of a spouse). Finally, AbbVie empowers managers and their teams with tools, tips and guidelines on effectively managing workloads and managing teams from a distance.\nNew AbbVie employees are given a tailored onboarding experience for faster integration and to support performance. One of AbbVie's mentorship programs allows employees to self-nominate as mentors or mentees and facilitates meaningful relationships supporting employees’ career and development goals. \nAbbVie also provides structured, broad-based development opportunities, focusing on high-performance skills and leadership training. AbbVie's talent philosophy holds leaders accountable for building a high-performing organization, and the company provides development opportunities for all levels of leadership. AbbVie's Learn, Develop, Perform program offers year-long, self-directed leadership education, supplemented with tools and resources, and leverages leaders as role models and teachers. In addition, a foundational success factor to AbbVie's leadership pipeline is the company's Professional Development Programs, which attract graduates, postgraduates and post-doctoral talent to participate in formal development programs lasting up to three years, with the objective of strengthening functional and leadership capabilities.\nCulture.    \nAbbVie’s shared principles of transforming lives, acting with integrity, driving innovation, embracing diversity and inclusion, and serving the community form the core of the company's culture. AbbVie articulates the behaviors associated with these values in the Ways We Work, a core set of working behaviors that emphasize how the company achieves results is equally as important as achieving them. The Ways We Work are designed to ensure that every AbbVie employee is aware of the company's cultural expectations. AbbVie integrates the Ways We Work into all talent processes, forming the basis for assessing performance, prioritizing development and ultimately rewarding employees. AbbVie believes its culture creates strong engagement, which is measured regularly through a confidential, third-party all-employee survey, and this engagement supports AbbVie’s mission of making a remarkable impact on people’s lives.\nDiversity & Inclusion.    \nA cornerstone of AbbVie’s human capital management approach is to prioritize fostering an inclusive workforce where all employees have equal opportunity to succeed. AbbVie is committed to equal employment opportunity and non-discrimination in all aspects of employment. Further, AbbVie is committed to pay equity and conducts pay equity analyses annually. A critical component of AbbVie's strategy is to instill an inclusive mindset in all AbbVie leaders and employees, so the company continues to realize the full value of its workforce from recruitment through retirement. AbbVie's Employee Resource Groups also help the company nurture an inclusive culture by building community and creating connections. \nInternet Information\nCopies of AbbVie's Annual Reports on Form 10-K, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K and amendments to those reports filed or furnished pursuant to Section 13(a) or 15(d) of the Securities Exchange Act of 1934 are \n13 \n \n \n|\n  \n2024 Form 10-K\n                                                         \navailable free of charge through AbbVie's investor relations website (\ninvestors.abbvie.com\n) as soon as reasonably practicable after AbbVie electronically files the material with, or furnishes it to, the Securities and Exchange Commission (SEC).\nAbbVie's corporate governance guidelines, outline of directorship qualifications, code of business conduct and the charters of AbbVie's audit committee, compensation committee, nominations and governance committee and public policy and sustainability committee are all available on AbbVie's investor relations website (\ninvestors.abbvie.com\n).",
  "item7": "ITEM 7. MANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe following is a discussion and analysis of the financial condition of AbbVie Inc. (AbbVie or the company). This commentary should be read in conjunction with the Consolidated Financial Statements and accompanying notes appearing in Item 8, \"Financial Statements and Supplementary Data.\" This section of Form 10-K generally discusses 2024 and 2023 items and year-to-year comparisons between 2024 and 2023. Discussions of 2022 items and year-to-year comparisons between 2023 and 2022 that are not included in this Form 10-K can be found in “Management's Discussion and Analysis of Financial Condition and Results of Operations” in Part II, Item 7 of the Company’s Annual Report on Form 10-K for the fiscal year ended December 31, 2023.\nEXECUTIVE OVERVIEW\nCompany Overview\nAbbVie is a global, diversified research-based biopharmaceutical company positioned for success with a comprehensive product portfolio that has leadership positions across immunology, oncology, aesthetics, neuroscience and eye care. AbbVie uses its expertise, dedicated people and unique approach to innovation to develop and market advanced therapies that address some of the world’s most complex and serious diseases.\nOn August 1, 2024, AbbVie completed the acquisition of Cerevel Therapeutics Holdings, Inc. (Cerevel Therapeutics). The acquisition complements AbbVie’s neuroscience portfolio, adding a wide range of potentially best-in-class assets that may transform standards of care across psychiatric and neurological disorders where significant unmet needs remain for patients. See Note 5 to the Consolidated Financial Statements for additional information on the acquisition. Subsequent to the acquisition date, AbbVie's consolidated financial statements include the assets, liabilities, operating results and cash flows of Cerevel Therapeutics.\nOn July 1, 2024, Robert A. Michael, AbbVie's then President and Chief Operating Officer, succeeded Richard A. Gonzalez as the company's Chief Executive Officer (CEO). Mr. Gonzalez, who has served as CEO since the company's formation in 2013, retired from the role of CEO and became Executive Chairman of the board of directors, effective July 1, 2024. Additionally, the board has appointed Mr. Michael as a member of the board of directors effective July 1, 2024. On February 13, 2025, the board of directors of AbbVie unanimously elected Mr. Michael to succeed Mr. Gonzalez as Chairman of the board of directors, effective July 1, 2025, at which time Mr. Gonzalez will retire from the board. \nOn February 12, 2024, AbbVie completed the acquisition of ImmunoGen, Inc. (ImmunoGen). The acquisition of ImmunoGen further builds on AbbVie's existing solid tumor pipeline of novel targeted therapies and next-generation immuno-oncology assets, which have the potential to create new treatment possibilities across multiple solid tumors and hematologic malignancies. AbbVie and ImmunoGen's combined capabilities represent an opportunity to deliver potentially transformative antibody-drug conjugate (ADC) therapies to patients. See Note 5 to the Consolidated Financial Statements for additional information on the acquisition. Subsequent to the acquisition date, AbbVie's consolidated financial statements include the assets, liabilities, operating results and cash flows of ImmunoGen.\nAbbVie's products are generally sold worldwide directly to wholesalers, distributors, government agencies, health care facilities, specialty pharmacies and independent retailers from AbbVie-owned distribution centers and public warehouses. Certain products (including aesthetic products and devices) are also sold directly to physicians and other licensed healthcare providers. In the United States, AbbVie distributes pharmaceutical products principally through independent wholesale distributors, with some sales directly to retailers, pharmacies, patients or other customers. Outside the United States, AbbVie sells products primarily to wholesalers or through distributors, and depending on the market works through largely centralized national payers systems to agree on reimbursement terms. Certain products are co-marketed or co-promoted with other companies. AbbVie operates as a single global business segment and has approximately 55,000 employees.\n33 \n \n \n|\n  \n2024 Form 10-K\n                                                         \n2025 Strategic Objectives\nAbbVie's mission is to discover and develop innovative medicines and products that solve serious health issues today and address the medical challenges of tomorrow while achieving top-tier financial performance through outstanding execution. AbbVie intends to execute its strategy and advance its mission in a number of ways, including: (i) maximizing the benefits of a diversified revenue base with multiple long-term growth drivers; (ii) leveraging AbbVie's commercial strength and international infrastructure across therapeutic areas and ensuring strong commercial execution of new product launches; (iii) continuing to invest in and expand its pipeline in support of opportunities in immunology, oncology, aesthetics, neuroscience and eye care as well as continued investment in key on-market products; (iv) generating substantial operating cash flows to support investment in innovative research and development, and return cash to shareholders via a strong and growing dividend while also continuing to repay debt. In addition, AbbVie anticipates several regulatory submissions and data readouts from key clinical trials in the next 12 months.\nAbbVie expects to achieve its strategic objectives through:\n•\nMaximizing revenue growth of our key on-market products, including Skyrizi, Rinvoq, Venclexta, Elahere, Vraylar, Ubrelvy, Qulipta, Vyalev/Produodopa, Botox and Juvederm Collection. \n•\nAdvancing our research and development pipeline by delivering late-stage pipeline milestones, achieving key proof-of-concept objectives across therapeutic areas and continuing to invest in key on-market product indication expansion. \n•\nMaximizing the value of key acquisitions as well as continuing to invest in external innovation. \n•\nContinuing to effectively manage the impact of Humira biosimilar erosion. \n•\nThe favorable impact of pipeline products and indications recently approved or currently under regulatory review where approval is expected in 2025. These products are described in greater detail in the section labeled \"Research and Development\" included as part of this Item 7.\n2024 Financial Results\nAbbVie's strategy has focused on delivering strong financial results, maximizing the benefits of a diversified revenue base, advancing and investing in its pipeline and returning value to shareholders while ensuring a strong, sustainable growth business over the long term. The company's financial performance in 2024 included delivering worldwide net revenues of $56.3 billion, operating earnings of $9.1 billion, diluted earnings per share of $2.39 and cash flows from operations of $18.8 billion. Worldwide net revenues increased by 4% on a reported and 5% on a constant currency basis.\nDiluted earnings per share in 2024 was $2.39 and included the following after-tax costs: (i) $6.5 billion related to the amortization of intangible assets; (ii) $3.7 billion for the change in fair value of contingent consideration liabilities; (iii) $3.5 billion related to intangible asset impairment; (iv) $978 million of acquisition and integration expenses; and (v) $721 million for charges related to litigation matters. These costs were partially offset by an income tax benefit of $1.8 billion primarily related to the settlement of income tax examinations. Additionally, financial results reflected continued funding to support all stages of AbbVie’s pipeline assets and continued investment in AbbVie’s on-market brands.\nRegulation\nThe Inflation Reduction Act of 2022 has and will continue to have a significant impact on how drugs are covered and paid for under the Medicare program, including through the creation of financial penalties for drugs whose price increases outpace inflation, the redesign of Medicare Part D benefits to shift a greater portion of the costs to manufacturers, and through government price-setting for certain Medicare Part B and Part D drugs. In 2023, Imbruvica was selected as one of the first 10 medicines subject to government-set prices beginning in 2026. In 2024, the CMS published Medicare Part D prices that will be applicable to the 10 selected drugs, including Imbruvica, beginning in 2026. In January 2025, HHS, through the CMS, selected Vraylar and Linzess as two of the 15 medicines subject to government-set prices beginning in 2027. It is possible that more of our products, including products that generate substantial revenues, could be selected in future years, which could, among other things, accelerate revenue erosion prior to expiration of intellectual property protections. The effect of reducing prices and reimbursement for certain of our products would significantly impact our results of operations. See Part I, Item 1 “Business – Regulation – Commercialization, Distribution and Manufacturing,” Part I, Item 1A “Risk Factors” and Note 7 to the consolidated financial statements for additional information. \n2024 Form 10-K\n   |  \n34\n                                                         \nResearch and Development \nResearch and innovation are the cornerstones of AbbVie's business as a global biopharmaceutical company. AbbVie's long-term success depends to a great extent on its ability to continue to discover and develop innovative products and acquire or collaborate on compounds currently in development by other biotechnology or pharmaceutical companies.\nAbbVie's pipeline currently includes approximately 90 compounds, devices or indications in development individually or under collaboration or license agreements and is focused on important specialties including immunology, oncology, aesthetics, neuroscience and eye care. Of these programs, approximately 50 are in mid- and late-stage development.\nThe following sections summarize transitions of significant programs from mid-stage development to late-stage development as well as developments in significant late-stage and registrational programs. AbbVie expects multiple mid-stage programs to transition into late-stage programs in the next 12 months.\nSignificant Programs and Developments\nImmunology\nRinvoq\n•\nIn January 2024, AbbVie initiated a Phase 3 clinical trial to evaluate Rinvoq in adults and adolescents with non-segmental vitiligo who are eligible for systemic therapy.\n•\nIn April 2024, AbbVie announced positive top-line results from its Phase 3 SELECT-GCA trial for Rinvoq in combination with a 26-week steroid taper regimen in patients with giant cell arteritis (GCA) achieved its primary endpoint.\n•\nIn April 2024, AbbVie announced positive top-line results from the head-to-head Phase 3b/4 Level-Up trial evaluating Rinvoq compared to dupilumab in adolescent and adult patients with moderate to severe atopic dermatitis. In the study, Rinvoq demonstrated superiority to dupilumab on the primary endpoint and all ranked secondary endpoints.\n•\nIn June 2024, AbbVie announced that the U.S. Food and Drug Administration (FDA) has approved Rinvoq for the treatment of pediatric patients two years of age and older with active polyarticular juvenile idiopathic arthritis (pJIA) as well as psoriatic arthritis (PsA), provided they have had an inadequate response or intolerance to one or more tumor necrosis factor (TNF) blockers. \n•\nIn July 2024, AbbVie announced that it submitted applications for a new indication to the FDA and European Medicines Agency (EMA) for Rinvoq for the treatment of adult patients with GCA.\nSkyrizi\n•\nIn June 2024, AbbVie announced that the FDA approved Skyrizi for adults with moderately to severely active ulcerative colitis (UC).\n•\nIn July 2024, AbbVie announced that the European Commission (EC) approved Skyrizi for the treatment of adult patients with moderately to severely active UC who have had an inadequate response to, lost response to, or were intolerant to conventional therapy or a biologic therapy.\nLutikizumab\n•\nIn January 2024, AbbVie announced Phase 2 results showing adults with moderate to severe hidradenitis suppurativa (HS) who had previously failed anti-TNF therapy who received lutikizumab achieved higher response rates than placebo in the primary endpoint of achieving HS Clinical Response at week 16.\n•\nIn July 2024, AbbVie initiated a Phase 3 clinical trial to evaluate lutikizumab in adult and adolescent patients with moderate to severe HS.\nOncology\nEpkinly\n•\nIn March 2024, AbbVie initiated a Phase 3 clinical trial to evaluate Epkinly in combination with rituximab and lenalidomide in patients with previously untreated follicular lymphoma (FL).\n35 \n \n \n|\n  \n2024 Form 10-K\n                                                         \n•\nIn June 2024, AbbVie announced that the FDA approved Epkinly for the treatment of adults with relapsed or refractory (R/R) FL after two or more lines of prior therapy. This indication is approved under the FDA's Accelerated Approval program based on overall response rate (ORR) and durability of response. Continued approval for this indication may be contingent upon verification and description of clinical benefit in a confirmatory trial.\n•\nIn August 2024, AbbVie announced that the EC granted conditional marketing authorization for Tepkinly as a monotherapy for the treatment of adult patients with R/R FL after two or more lines of prior therapy. \nElahere\n•\nIn March 2024, AbbVie announced that the FDA granted full approval for Elahere for the treatment of adult patients with folate receptor alpha (FRα)-positive, platinum-resistant epithelial ovarian, fallopian tube or primary peritoneal cancer, who have received one to three prior systemic treatment regimens.\n•\nIn June 2024, AbbVie announced positive topline results from the Phase 2 PICCOLO trial evaluating Elahere monotherapy in heavily pre-treated patients with FRα-positive, platinum-sensitive ovarian cancer. The study met its primary endpoint and no new safety concerns were identified. \n•\nIn November 2024, AbbVie announced the EC granted marketing authorization for Elahere for the treatment of adult patients with FRα-positive, platinum-resistant high grade serous epithelial ovarian, fallopian tube or primary peritoneal cancer who have received one to three prior systemic treatment regimens.\nNavitoclax\n•\nIn April 2024, AbbVie announced its decision to discontinue the Phase 3 TRANSFORM-2 study evaluating navitoclax, a BCL-XL/BCL-2 inhibitor, plus ruxolitinib in patients with R/R myelofibrosis following evaluation of the totality of data from the Phase 3 TRANSFORM-1 trial and feedback from regulators.\nABBV-383\n•\nIn June 2024, AbbVie initiated the Phase 3 CERVINO clinical trial to evaluate ABBV-383 monotherapy compared with standard available therapies in adult patients with R/R multiple myeloma who have received at least two lines of prior therapy.\nTeliso-V\n•\nIn September 2024, AbbVie announced submission of a Biologics License Application to the FDA for accelerated approval of Teliso-V in adult patients with previously treated, locally advanced or metastatic epidermal growth factor receptor (EGFR) wild type, nonsquamous non-small cell lung cancer (NSCLC) with c-Met protein overexpression.\nABBV-400\n•\nIn December 2024, AbbVie initiated a Phase 3 trial to evaluate ABBV-400 monotherapy compared to trifluridine, tipiracil and bevacizumab in adult participants with c-Met over-expressed refractory metastatic colorectal cancer (mCRC).\nAesthetics\nJuvederm Collection\n•\nIn March 2024, AbbVie announced the FDA approval of Juvederm Voluma XC for injection in the temple region to improve moderate to severe temple hollowing in adults over the age of 21.\n2024 Form 10-K\n   |  \n36\n                                                         \nBotox Cosmetic\n•\nIn September 2024, AbbVie announced that Botox Cosmetic is now available for the treatment of masseter muscle prominence (MMP) in China. \n•\nIn October 2024, AbbVie announced that the FDA approved Botox Cosmetic for temporary improvement in the appearance of moderate to severe vertical bands connecting the jaw and neck (platysma bands) in adults\n.\nNeuroscience\nVyalev/Produodopa\n•\nIn January 2024, AbbVie announced the launch of Produodopa (ABBV-951) in the European Union for the treatment of advanced Parkinson's disease with severe motor fluctuations and hyperkinesia (excessive movement) or dyskinesia (involuntary movement), and when available combinations of Parkinson's medicinal products have not given satisfactory results.\n•\nIn June 2024, AbbVie announced it received a Complete Response Letter (CRL) from the FDA for the New Drug Application (NDA) for ABBV-951 for the treatment of motor fluctuations in adults with advanced Parkinson's disease. In its letter, the FDA cited observations that were identified during inspection of a third-party manufacturer listed in the NDA. The CRL did not identify any issues related to the safety, efficacy or labeling of ABBV-951, including the device, and did not request that AbbVie conduct additional efficacy or safety trials related to the drug or device-related testing.\n•\nIn October 2024, AbbVie announced that the FDA approved Vyalev (ABBV-951) as the first and only subcutaneous 24-hour infusion of levodopa-based therapy for the treatment of motor fluctuations in adults with advanced Parkinson's disease.\nTavapadon\n•\nIn September 2024, AbbVie announced positive top-line results from its Phase 3 TEMPO-1 trial for tavapadon as a monotherapy in early Parkinson's disease.\n•\nIn December 2024, AbbVie announced positive top-line results from its pivotal Phase 3 TEMPO-2 trial evaluating tavapadon as a flexible-dose monotherapy in early Parkinson's disease. \nEmraclidine\n•\nIn November 2024, AbbVie announced that its two Phase 2 EMPOWER trials investigating emraclidine as a once-daily, oral monotherapy treatment for adults with schizophrenia who are experiencing an acute exacerbation of psychotic symptoms, did not meet their primary endpoint of showing a statistically significant reduction (improvement) in the change from baseline in the Positive and Negative Syndrome Scale total score compared to the placebo group at week 6.\n37 \n \n \n|\n  \n2024 Form 10-K\n                                                         \nRESULTS OF OPERATIONS\nNet Revenues\nThe comparisons presented at constant currency rates reflect comparative local currency net revenues at the prior year's foreign exchange rates. This measure provides information on the change in net revenues assuming that foreign currency exchange rates had not changed between the prior and current periods. AbbVie believes that the non-GAAP measure of change in net revenues at constant currency rates, when used in conjunction with the GAAP measure of change in net revenues at actual currency rates, may provide a more complete understanding of the company's operations and can facilitate analysis of the company's results of operations, particularly in evaluating performance from one period to another.\nPercent change\nAt actual currency rates\nAt constant currency rates\nyears ended (dollars in millions)\n2024\n2023\n2022\n2024\n2023\n2024\n2023\nUnited States\n$\n43,029 \n$\n41,883 \n$\n45,713 \n2.7 \n%\n(8.4)\n%\n2.7 \n%\n(8.4)\n%\nInternational\n13,305 \n12,435 \n12,341 \n7.0 \n%\n0.8 \n%\n11.1 \n%\n3.4 \n%\nNet revenues\n$\n56,334 \n$\n54,318 \n$\n58,054 \n3.7 \n%\n(6.4)\n%\n4.6 \n%\n(5.9)\n%\n2024 Form 10-K\n   |  \n38\n                                                         \nThe following table details AbbVie's worldwide net revenues:\nPercent change\nAt actual currency rates\nAt constant currency rates\nyears ended December 31 (dollars in millions)\n2024\n2023\n2022\n2024\n2023\n2024\n2023\nImmunology\nHumira\nUnited States\n$\n7,142 \n$\n12,160 \n$\n18,619 \n(41.3)\n%\n(34.7)\n%\n(41.3)\n%\n(34.7)\n%\nInternational\n1,851 \n2,244 \n2,618 \n(17.5)\n%\n(14.3)\n%\n(13.2)\n%\n(11.8)\n%\nTotal\n$\n8,993 \n$\n14,404 \n$\n21,237 \n(37.6)\n%\n(32.2)\n%\n(36.9)\n%\n(31.9)\n%\nSkyrizi\nUnited States\n$\n10,086 \n$\n6,753 \n$\n4,484 \n49.3 \n%\n50.6 \n%\n49.3 \n%\n50.6 \n%\nInternational\n1,632 \n1,010 \n681 \n61.6 \n%\n48.3 \n%\n65.4 \n%\n50.3 \n%\nTotal\n$\n11,718 \n$\n7,763 \n$\n5,165 \n50.9 \n%\n50.3 \n%\n51.4 \n%\n50.6 \n%\nRinvoq\nUnited States\n$\n4,259 \n$\n2,824 \n$\n1,794 \n50.8 \n%\n57.4 \n%\n50.8 \n%\n57.4 \n%\nInternational\n1,712 \n1,145 \n728 \n49.6 \n%\n57.3 \n%\n57.0 \n%\n60.7 \n%\nTotal\n$\n5,971 \n$\n3,969 \n$\n2,522 \n50.4 \n%\n57.4 \n%\n52.5 \n%\n58.4 \n%\nOncology\nImbruvica\nUnited States\n$\n2,448 \n$\n2,665 \n$\n3,426 \n(8.1)\n%\n(22.2)\n%\n(8.1)\n%\n(22.2)\n%\nCollaboration revenues\n899 \n931 \n1,142 \n(3.5)\n%\n(18.5)\n%\n(3.5)\n%\n(18.5)\n%\nTotal\n$\n3,347 \n$\n3,596 \n$\n4,568 \n(6.9)\n%\n(21.3)\n%\n(6.9)\n%\n(21.3)\n%\nVenclexta\nUnited States\n$\n1,234 \n$\n1,087 \n$\n1,009 \n13.5 \n%\n7.8 \n%\n13.5 \n%\n7.8 \n%\nInternational\n1,349 \n1,201 \n1,000 \n12.3 \n%\n20.1 \n%\n18.0 \n%\n22.3 \n%\nTotal\n$\n2,583 \n$\n2,288 \n$\n2,009 \n12.9 \n%\n13.9 \n%\n15.9 \n%\n15.0 \n%\nElahere\n(a)\nUnited States\n$\n477 \n$\n— \n$\n— \nn/m\nn/m\nn/m\nn/m\nInternational\n2 \n— \n— \nn/m\nn/m\nn/m\nn/m\nTotal\n$\n479 \n$\n— \n$\n— \nn/m\nn/m\nn/m\nn/m\nEpkinly\nCollaboration revenues\n$\n118 \n$\n28 \n$\n— \n>100.0 %\nn/m\n>100.0 %\nn/m\nInternational\n28 \n3 \n— \n>100.0 %\nn/m\n>100.0 %\nn/m\nTotal\n$\n146 \n$\n31 \n$\n— \n>100.0 %\nn/m\n>100.0 %\nn/m\nAesthetics\nBotox Cosmetic\nUnited States\n$\n1,682 \n$\n1,670 \n$\n1,654 \n0.7 \n%\n1.0 \n%\n0.7 \n%\n1.0 \n%\nInternational\n1,038 \n1,012 \n961 \n2.7 \n%\n5.3 \n%\n6.7 \n%\n9.7 \n%\nTotal\n$\n2,720 \n$\n2,682 \n$\n2,615 \n1.4 \n%\n2.6 \n%\n2.9 \n%\n4.2 \n%\nJuvederm Collection\nUnited States\n$\n469 \n$\n519 \n$\n548 \n(9.6)\n%\n(5.4)\n%\n(9.6)\n%\n(5.4)\n%\nInternational\n708 \n859 \n880 \n(17.6)\n%\n(2.4)\n%\n(13.4)\n%\n1.9 \n%\nTotal\n$\n1,177 \n$\n1,378 \n$\n1,428 \n(14.6)\n%\n(3.6)\n%\n(12.0)\n%\n(0.9)\n%\nOther Aesthetics\nUnited States\n$\n1,118 \n$\n1,060 \n$\n1,122 \n5.5 \n%\n(5.6)\n%\n5.5 \n%\n(5.6)\n%\nInternational\n161 \n174 \n168 \n(7.1)\n%\n3.3 \n%\n(1.0)\n%\n8.1 \n%\nTotal\n$\n1,279 \n$\n1,234 \n$\n1,290 \n3.7 \n%\n(4.4)\n%\n4.6 \n%\n(3.8)\n%\nNeuroscience\nBotox Therapeutic\nUnited States\n$\n2,718 \n$\n2,476 \n$\n2,255 \n9.8 \n%\n9.8 \n%\n9.8 \n%\n9.8 \n%\nInternational\n565 \n515 \n464 \n9.8 \n%\n11.1 \n%\n14.0 \n%\n15.5 \n%\nTotal\n$\n3,283 \n$\n2,991 \n$\n2,719 \n9.8 \n%\n10.0 \n%\n10.5 \n%\n10.8 \n%\nVraylar\nUnited States\n$\n3,260 \n$\n2,755 \n$\n2,037 \n18.4 \n%\n35.2 \n%\n18.4 \n%\n35.2 \n%\nInternational\n7 \n4 \n1 \n57.8 \n%\n>100.0 %\n58.6 \n%\n>100.0 %\nTotal\n$\n3,267 \n$\n2,759 \n$\n2,038 \n18.4 \n%\n35.4 \n%\n18.4 \n%\n35.4 \n%\nDuodopa\nUnited States\n$\n96 \n$\n97 \n$\n95 \n(1.8)\n%\n3.0 \n%\n(1.8)\n%\n3.0 \n%\nInternational\n351 \n371 \n363 \n(5.3)\n%\n2.1 \n%\n(5.4)\n%\n1.8 \n%\nTotal\n$\n447 \n$\n468 \n$\n458 \n(4.6)\n%\n2.3 \n%\n(4.7)\n%\n2.1 \n%\nUbrelvy\nUnited States\n$\n981 \n$\n803 \n$\n680 \n22.1 \n%\n18.2 \n%\n22.1 \n%\n18.2 \n%\nInternational\n25 \n12 \n— \n>100.0 %\n>100.0 %\n>100.0 %\n>100.0 %\nTotal\n$\n1,006 \n$\n815 \n$\n680 \n23.4 \n%\n19.9 \n%\n23.4 \n%\n19.9 \n%\nQulipta\nUnited States\n$\n628 \n$\n405 \n$\n158 \n55.3 \n%\n>100.0 %\n55.3 \n%\n>100.0 %\nInternational\n30 \n3 \n— \n>100.0 %\n>100.0 %\n>100.0 %\n>100.0 %\nTotal\n$\n658 \n$\n408 \n$\n158 \n61.3 \n%\n>100.0 %\n61.3 \n%\n>100.0 %\n39 \n \n \n|\n  \n2024 Form 10-K\n                                                         \nPercent change\nAt actual currency rates\nAt constant currency rates\nyears ended December 31 (dollars in millions)\n2024\n2023\n2022\n2024\n2023\n2024\n2023\nOther Neuroscience\nUnited States\n$\n224 \n$\n254 \n$\n456 \n(11.6)\n%\n(44.4)\n%\n(11.6)\n%\n(44.4)\n%\nInternational\n114 \n22 \n19 \n>100.0 %\n20.2 \n%\n>100.0 %\n24.4 \n%\nTotal\n$\n338 \n$\n276 \n$\n475 \n22.4 \n%\n(41.9)\n%\n22.7 \n%\n(41.7)\n%\nEye Care\nOzurdex\nUnited States\n$\n138 \n$\n143 \n$\n139 \n(4.1)\n%\n2.7 \n%\n(4.1)\n%\n2.7 \n%\nInternational\n356 \n329 \n289 \n8.3 \n%\n14.0 \n%\n10.7 \n%\n15.9 \n%\nTotal\n$\n494 \n$\n472 \n$\n428 \n4.5 \n%\n10.3 \n%\n6.2 \n%\n11.6 \n%\nLumigan/Ganfort\nUnited States\n$\n187 \n$\n173 \n$\n242 \n7.5 \n%\n(28.4)\n%\n7.5 \n%\n(28.4)\n%\nInternational\n242 \n259 \n272 \n(6.4)\n%\n(4.8)\n%\n(3.9)\n%\n(3.6)\n%\nTotal\n$\n429 \n$\n432 \n$\n514 \n(0.9)\n%\n(15.9)\n%\n0.6 \n%\n(15.3)\n%\nAlphagan/Combigan\nUnited States\n$\n95 \n$\n121 \n$\n202 \n(21.8)\n%\n(40.1)\n%\n(21.8)\n%\n(40.1)\n%\nInternational\n153 \n151 \n144 \n1.5 \n%\n4.9 \n%\n7.6 \n%\n10.4 \n%\nTotal\n$\n248 \n$\n272 \n$\n346 \n(8.8)\n%\n(21.4)\n%\n(5.4)\n%\n(19.1)\n%\nRestasis\nUnited States\n$\n172 \n$\n382 \n$\n621 \n(55.2)\n%\n(38.5)\n%\n(55.2)\n%\n(38.5)\n%\nInternational\n52 \n54 \n45 \n(3.0)\n%\n19.3 \n%\n2.1 \n%\n25.3 \n%\nTotal\n$\n224 \n$\n436 \n$\n666 \n(48.7)\n%\n(34.6)\n%\n(48.1)\n%\n(34.2)\n%\nOther Eye Care\nUnited States\n$\n472 \n$\n433 \n$\n399 \n8.9 \n%\n9.0 \n%\n8.9 \n%\n9.0 \n%\nInternational\n375 \n370 \n348 \n1.5 \n%\n6.1 \n%\n6.1 \n%\n8.7 \n%\nTotal\n$\n847 \n$\n803 \n$\n747 \n5.5 \n%\n7.6 \n%\n7.6 \n%\n8.8 \n%\nOther Key Products\nMavyret\nUnited States\n$\n595 \n$\n659 \n$\n755 \n(9.7)\n%\n(12.7)\n%\n(9.7)\n%\n(12.7)\n%\nInternational\n716 \n771 \n786 \n(7.2)\n%\n(1.9)\n%\n(4.5)\n%\n1.0 \n%\nTotal\n$\n1,311 \n$\n1,430 \n$\n1,541 \n(8.3)\n%\n(7.2)\n%\n(6.9)\n%\n(5.7)\n%\nCreon\nUnited States\n$\n1,383 \n$\n1,268 \n$\n1,278 \n9.1 \n%\n(0.8)\n%\n9.1 \n%\n(0.8)\n%\nLinzess/Constella\nUnited States\n$\n916 \n$\n1,073 \n$\n1,003 \n(14.6)\n%\n7.1 \n%\n(14.6)\n%\n7.1 \n%\nInternational\n38 \n35 \n32 \n7.5 \n%\n8.8 \n%\n7.2 \n%\n9.7 \n%\nTotal\n$\n954 \n$\n1,108 \n$\n1,035 \n(13.9)\n%\n7.1 \n%\n(13.9)\n%\n7.1 \n%\nAll other\n$\n3,032 \n$\n3,035 \n$\n4,137 \n— \n%\n(26.7)\n%\n1.4 \n%\n(25.7)\n%\nTotal net revenues\n$\n56,334 \n$\n54,318 \n$\n58,054 \n3.7 \n%\n(6.4)\n%\n4.6 \n%\n(5.9)\n%\nn/m – Not meaningful\n(a)\nNet revenues include ImmunoGen product revenues after the acquisition closing date of February 12, 2024.\nThe following discussion and analysis of AbbVie's net revenues by product is presented on a constant currency basis.\nGlobal Humira sales decreased 37% in 2024. In the United States, Humira sales decreased 41% in 2024 primarily driven by direct biosimilar competition following loss of exclusivity on January 31, 2023. Internationally, Humira revenues decreased 13% in 2024 primarily driven by the continued impact of direct biosimilar competition.\nNet revenues for Skyrizi increased 51% in 2024 primarily driven by continued strong market share uptake as well as market growth across all indications.\nNet revenues for Rinvoq increased 53% in 2024 primarily driven by continued strong market share uptake as well as market growth across all indications.\nNet revenues for Imbruvica represent product revenues in the United States and collaboration revenues outside of the United States related to AbbVie's 50% share of Imbruvica profit. AbbVie's global Imbruvica revenues decreased 7% in 2024 primarily driven by decreased demand and lower market share in the United States as well as decreased collaboration revenues.\nNet revenues for Venclexta increased 16% in 2024 primarily driven by continued market share uptake and market growth across all indications.\nNet revenues for Elahere were $479 million in 2024 for the period subsequent to the completion of the ImmunoGen acquisition.\n2024 Form 10-K\n   |  \n40\n                                                         \nNet revenues for Botox Cosmetic increased 3% in 2024. In the United States, Botox Cosmetic net revenues increased 1% primarily driven by favorable pricing, partially offset by the unfavorable impact of customer inventory destocking and decreased consumer demand. Internationally, Botox Cosmetic net revenues increased 7% primarily driven by favorable pricing and increased consumer demand across key international markets.\nNet revenues for Juvederm Collection decreased 12% in 2024 primarily driven by the unfavorable impact of decreased consumer demand and customer inventory destocking.\nNet revenues for Botox Therapeutic increased 11% in 2024 primarily driven by continued market share uptake as well as market growth.\nNet revenues for Vraylar increased 18% in 2024 primarily driven by continued market share uptake as well as market growth.\nNet revenues for Ubrelvy increased 23% in 2024 primarily driven by continued market share uptake as well as market growth.\nNet revenues for Qulipta increased 61% in 2024 primarily driven by continued strong market share uptake as well as market growth.\nGross Margin\nPercent change\nyears ended December 31 (dollars in millions)\n2024\n2023\n2022\n2024\n2023\nGross margin\n$\n39,430 \n$\n33,903 \n$\n40,640 \n16 \n%\n(17)\n%\nas a percent of net revenues\n70 \n%\n62 \n%\n70 \n%\nGross margin as a percentage of net revenues in 2024 increased compared to 2023. Gross margin percentage for 2024 was favorably impacted by lower intangible asset impairment charges and lower amortization of intangibles. Intangible asset impairment charges were $3.6 billion in 2023.\nSelling, General and Administrative\nPercent change\nyears ended December 31 (dollars in millions)\n2024\n2023\n2022\n2024\n2023\nSelling, general and administrative\n$\n14,752 \n$\n12,872 \n$\n15,260 \n15 \n%\n(16)\n%\nas a percent of net revenues\n26 \n%\n24 \n%\n26 \n%\nSelling, general and administrative (SG&A) expenses as a percentage of net revenues increased in 2024 compared to 2023. SG&A expense was unfavorably impacted by litigation reserve charges of $910 million in 2024 compared to income of $485 million in 2023 and acquisition and integration costs incurred in connection with the ImmunoGen and Cerevel Therapeutics acquisitions including cash-settled, post-closing expense for both ImmunoGen and Cerevel Therapeutics employee incentive awards. The SG&A expense percentage increase in 2024 was partially offset by the favorable impact of leverage from revenue growth. See Note 5 to the Consolidated Financial Statements for additional information. \nResearch and Development\nPercent change\nyears ended December 31 (dollars in millions)\n2024\n2023\n2022\n2024\n2023\nResearch and development\n$\n12,791 \n$\n7,675 \n$\n6,510 \n67 \n%\n18 \n%\nas a percent of net revenues\n23 \n%\n14 \n%\n11 \n%\nResearch and development (R&D) expenses as a percentage of net revenues increased in 2024 compared to 2023. R&D expense percentage for 2024 was unfavorably impacted by the intangible asset impairment charge of $4.5 billion related to emraclidine compared to an intangible asset impairment charge of $630 million in 2023, increased funding to support all stages of the company's pipeline assets and acquisition and integration costs incurred in connection with the ImmunoGen and Cerevel Therapeutics acquisitions including cash-settled, post-closing expense for employee incentive awards. See Note 5 to the Consolidated Financial Statements for additional information. \n41 \n \n \n|\n  \n2024 Form 10-K\n                                                         \nAcquired IPR&D and Milestones\nyears ended December 31 (in millions)\n2024\n2023\n2022\nUpfront charges\n$\n2,627 \n$\n582 \n$\n445 \nDevelopment milestones\n130 \n196 \n252 \nAcquired IPR&D and milestones\n$\n2,757 \n$\n778 \n$\n697 \nAcquired IPR&D and milestones expense in 2024 included charges related to the upfront payments of $1.4 billion to acquire Aliada Therapeutics Holdings, Inc. (Aliada) and $250 million to acquire Celsius Therapeutics. See Note 5 to the Consolidated Financial Statements for additional information.\nOther Operating Expense (Income), Net\nOther operating expense (income), net included a gain of $169 million in 2023 related to a development liability associated with an asset divested as part of the acquisition of Allergan, Inc. (Allergan) in 2020.\nOther Non-Operating Expenses\nyears ended December 31 (in millions)\n2024\n2023\n2022\nInterest expense\n$\n2,808 \n$\n2,224 \n$\n2,230 \nInterest income\n(648)\n(540)\n(186)\nInterest expense, net\n$\n2,160 \n$\n1,684 \n$\n2,044 \nNet foreign exchange loss\n$\n21 \n$\n146 \n$\n148 \nOther expense, net\n3,240 \n4,677 \n2,448 \nInterest expense in 2024 increased compared to 2023 primarily due to the incremental interest associated with financing the ImmunoGen and Cerevel Therapeutics acquisitions. See Note 10 to the Consolidated Financial Statements for additional information related to debt issued to finance the ImmunoGen and Cerevel Therapeutics acquisitions.\nInterest income in 2024 increased compared to 2023 primarily due to a higher average cash and cash equivalents balance and the impact of higher interest rates.\nOther expense, net included charges related to changes in fair value of contingent consideration liabilities of $3.8 billion in 2024 and $5.1 billion in 2023. The fair value of contingent consideration liabilities is impacted by the passage of time and multiple other inputs, including the probability of success of achieving regulatory/commercial milestones, discount rates, the estimated amount of future sales of the acquired products and other market-based factors. In 2024, the change in fair value reflected higher estimated Skyrizi sales and the passage of time, partially offset by higher discount rates. In 2023, the change in fair value reflected higher estimated Skyrizi sales driven by stronger market share uptake, the passage of time and lower discount rates.\nIncome Tax Expense\nThe effective income tax rate was (15%) in 2024, 22% in 2023 and 12% in 2022. The effective income tax rate fluctuates year to year due to the allocation of the company’s taxable earnings among jurisdictions, as well as certain discrete factors and events in each year, including changes in tax law and business development activities. The effective income tax rates in 2024, 2023 and 2022 differed from the statutory tax rate principally due to the impact of foreign operations with lower income tax rates in locations outside the United States, the U.S. global minimum tax, changes in fair value of contingent consideration, tax audits and settlements, tax credits and incentives in the United States, Puerto Rico and other foreign tax jurisdictions, and business development activities. The effective income tax rate in 2024 was lower than prior periods due to the resolutions of various tax positions pertaining to multiple prior tax years, including the closing of U.S. IRS examinations covering three tax years, partially offset by increases in unrecognized tax benefits pertaining to prior years. The lower effective income tax rate in 2024 also reflects an increase due to acquisition costs related to certain business development activities and a decrease related to changes in fair value of contingent consideration. The effective income tax rate in 2023 was higher than prior periods due to increased changes in fair value of contingent consideration, intangible asset impairments and the impacts of the transition from the Puerto Rico excise tax to an income tax.\n In 2022, Puerto Rico enacted Act 52-2002 (the Puerto Rico Act) allowing for a transition from a Puerto Rico excise tax levied on gross inventory purchases to an income-based tax beginning in 2023. The company completed the transition \n2024 Form 10-K\n   |  \n42\n                                                         \nrequirements of the Puerto Rico Act in 2022, resulting in the remeasurement of certain deferred tax assets and liabilities based on income tax rates at which they are expected to reverse in the future. The net tax benefit recognized in 2022 from the remeasurement of deferred taxes related to the Puerto Rico Act was $323 million.\nOur net earnings and cash flows could be affected by future tax policy and law changes in the jurisdictions in which we operate, including changes in tax law related to the projects undertaken by the Organization for Economic Cooperation and Development (OECD). These projects include a global minimum tax rate of 15%, referred to as \"Pillar Two\", and the creation of a new global system to tax income based on the location to which products are sold, referred to as \"Pillar One.\" Numerous countries have agreed to a statement in support of the OECD model rules and European Union member states have agreed to implement Pillar Two. This implementation includes aspects of legislation that were effective starting in 2024. Significant details around the provision are still emerging. These potential changes increase tax uncertainty and may adversely impact income tax expense in future years. We will continue to monitor pending legislation and implementation by individual countries and evaluate the potential impact on our business in future periods.\nFINANCIAL POSITION, LIQUIDITY AND CAPITAL RESOURCES \nyears ended December 31 (in millions)\n2024\n2023\n2022\nCash flows provided by (used in)\nOperating activities\n$\n18,806 \n$\n22,839 \n$\n24,943 \nInvesting activities\n(20,820)\n(2,009)\n(623)\nFinancing activities\n(5,211)\n(17,222)\n(24,803)\nOperating cash flows in 2024 decreased compared to the prior year primarily due to the timing of working capital and higher contingent consideration payments classified as operating cash flows, partially offset by increased results from operations driven by higher net revenues. Operating cash flows also reflected AbbVie’s contributions to its defined benefit plans of $326 million in 2024 and $366 million in 2023.\nInvesting cash flows in 2024 included $18.5 billion cash consideration paid to acquire ImmunoGen and Cerevel Therapeutics offset by cash acquired of $952 million, net sales and maturities of investment securities of $482 million, payments made for other acquisitions and investments of $3.0 billion and capital expenditures of $974 million. Investing cash flows in 2023 included payments made for other acquisitions and investments of $1.2 billion, capital expenditures of $777 million and net purchases of investments securities totaling $22 million.\nFinancing cash flows in 2024 included the issuance of unsecured senior notes totaling $15.0 billion aggregate principal which were used to finance the acquisitions of ImmunoGen and Cerevel Therapeutics. Additionally, financing cash flows included the issuance and repayment of $5.0 billion under the term loan credit agreement and repayments of $3.8 billion aggregate principal amount of 2.60% senior notes, €1.5 billion aggregate principal amount of 1.38% senior euro notes, €700 million aggregate principal amount of 1.25% senior euro notes, $1.0 billion aggregate principal amount of 3.85% senior notes, $99 million of secured term notes assumed from ImmunoGen in conjunction with the acquisition and settlement of $400 million aggregate amount of 2.5% convertible senior notes assumed from Cerevel Therapeutics. During the quarter ended December 31, 2024, the company refinanced its $2.0 billion floating rate three-year term loan. As part of the refinancing, the company repaid the existing $2.0 billion term loan due May 2025 and borrowed $2.0 billion under a new term loan due April 2027. \nFinancing cash flows in 2023 included repayment of $1.0 billion floating rate three-year term loan, $1.0 billion aggregate principal amount of the company's 2.85% senior notes and $350 million aggregate principal amount of the company's 2.80% senior notes. During the quarter ended December 31, 2023 the company also repaid €500 million aggregate principal amount of 1.50% senior euro notes and $1.3 billion aggregate principal amount of 3.75% senior notes at maturity.\nFinancing cash flows also included cash dividend payments of $11.0 billion in 2024 and $10.5 billion in 2023. The increase in cash dividend payments was primarily driven by an increase of the dividend rate.\nThe company's stock repurchase authorization permits purchases of AbbVie shares from time to time in open-market or private transactions at management’s discretion. The program has no time limit and can be discontinued at any time. AbbVie repurchased 7 million shares for $1.3 billion in 2024 and 10 million shares for $1.6 billion in 2023. AbbVie's remaining stock repurchase authorization was $3.5 billion as of December 31, 2024. On February 16, 2023, AbbVie's board of directors authorized a $5.0 billion increase to the existing stock repurchase authorization.\nDuring 2024, the company issued and redeemed $7.7 billion of commercial paper. Subsequent to December 31, 2024, AbbVie issued commercial paper borrowings of which $3.3 billion were outstanding as of date of filing of this Annual Report \n43 \n \n \n|\n  \n2024 Form 10-K\n                                                         \non Form 10-K. There were no commercial paper borrowings outstanding as of December 31, 2024 and December 31, 2023. AbbVie may issue additional commercial paper or retire commercial paper to meet liquidity requirements as needed.\nCredit Risk\nAbbVie monitors economic conditions, the creditworthiness of customers and government regulations and funding, both domestically and abroad. AbbVie regularly communicates with its customers regarding the status of receivable balances, including their payment plans and obtains positive confirmation of the validity of the receivables. AbbVie establishes an allowance for credit losses equal to the estimate of future losses over the contractual life of outstanding accounts receivable. AbbVie may also utilize factoring arrangements to mitigate credit risk, although the receivables included in such arrangements have historically not been a significant amount of total outstanding receivables.\nCredit Facility, Access to Capital and Credit Ratings\nCredit Facility\nIn December 2023, in connection with the acquisitions of ImmunoGen and Cerevel Therapeutics, AbbVie entered into a $9.0 billion 364-day bridge credit agreement and $5.0 billion 364-day term loan credit agreement. In February 2024, AbbVie borrowed and repaid $5.0 billion under the term loan credit agreement. AbbVie also issued $15.0 billion aggregate principal amount of unsecured senior notes in February 2024. Subsequent to the issuance of these senior notes, AbbVie terminated both the bridge and term loan credit agreements in the first quarter of 2024. \nAbbVie currently has an existing $5.0 billion five-year revolving credit facility that matures in March 2028. Subsequent to December 31, 2024, in addition to the existing revolving credit facility, AbbVie entered into a new $3.0 billion five-year revolving credit facility that matures in January 2030. The revolving credit facilities enable the company to borrow funds on an unsecured basis at variable interest rates and contain various covenants. At December 31, 2024, the company was in compliance with all covenants, and commitment fees under the credit facility were insignificant. No amounts were outstanding under the company's credit facilities as of December 31, 2024 and December 31, 2023.\nAccess to Capital\nThe company intends to fund short-term and long-term financial obligations as they mature through cash on hand, future cash flows from operations or has the ability to issue additional debt. The company's ability to generate cash flows from operations, issue debt or enter into financing arrangements on acceptable terms could be adversely affected if there is a material decline in the demand for the company's products or in the solvency of its customers or suppliers, deterioration in the company's key financial ratios or credit ratings, or other material unfavorable changes in business conditions. At the current time, the company believes it has sufficient financial flexibility to issue debt, enter into other financing arrangements and attract long-term capital on acceptable terms to support the company's growth objectives.\nCredit Ratings\nIn August 2024, Moody’s Investors Service (Moody’s) affirmed its A3 senior unsecured long-term rating. At the same time, Moody’s revised its outlook to positive from stable. There were no other changes in the company’s credit ratings during 2024. Unfavorable changes to the ratings may have an adverse impact on future financing arrangements. However, they would not affect the company’s ability to draw on its credit facility and would not result in an acceleration of scheduled maturities of any of the company’s outstanding debt.\nFuture Cash Requirements\nContractual Obligations\nThe following table summarizes AbbVie's estimated material contractual obligations as of December 31, 2024:\n(in millions)\nTotal\nCurrent\nLong-term\nLong-term debt, including current portion\n$\n66,841 \n$\n6,771 \n$\n60,070 \nInterest on long-term debt\n(a)\n36,040 \n2,764 \n33,276 \nContingent consideration liabilities\n(b)\n21,666 \n2,589 \n19,077 \n(a)\nIncludes estimated future interest payments on long-term debt. Interest payments on debt are calculated for future periods using forecasted interest rates in effect at the end of 2024. Projected interest payments include the related effects of interest rate swap agreements. Certain of these projected interest payments may differ in the future based on changes in floating interest rates or other factors or events. The projected interest payments only pertain to \n2024 Form 10-K\n   |  \n44\n                                                         \nobligations and agreements outstanding at December 31, 2024. See Note 10 to the Consolidated Financial Statements for additional information regarding the company's debt instruments and Note 11 for additional information on the interest rate swap agreements outstanding at December 31, 2024.\n(b)\nIncludes contingent consideration liabilities which are recorded at fair value on the consolidated balance sheet. Potential contingent consideration payments that exceed the fair value recorded on the consolidated balance sheet are not included in the table of contractual obligations. See Note 11 to the Consolidated Financial Statements for additional information regarding these liabilities. \nAbbVie enters into certain unconditional purchase obligations and other commitments in the normal course of business. There have been no changes to these commitments that would have a material impact on the company’s ability to meet either short-term or long-term future cash requirements.\nIncome Taxes\nFuture income tax cash requirements include a one-time transition tax liability on a mandatory deemed repatriation of previously untaxed earnings of foreign subsidiaries resulting from U.S. tax reform enacted in 2017. The one-time transition tax liability was $2.2 billion as of December 31, 2024 and is payable in two future annual installments. \nLiabilities for unrecognized tax benefits totaled $5.0 billion as of December 31, 2024. It is not possible to reliably estimate the timing of the future cash outflows related to these liabilities. See Note 14 to the Consolidated Financial Statements for additional information on these unrecognized tax benefits.\nQuarterly Cash Dividend\nOn October 30, 2024, AbbVie announced that its board of directors declared an increase in the company’s quarterly dividend from $1.55 per share to $1.64 per share beginning with the dividend payable on February 14, 2025 to stockholders of record as of January 15, 2025. This reflects an increase of approximately 5.8% over the previous quarterly rate. The timing, declaration, amount of and payment of any dividends by AbbVie in the future is within the discretion of its board of directors and will depend upon many factors, including AbbVie's financial condition, earnings, capital requirements of its operating subsidiaries, covenants associated with certain of AbbVie's debt service obligations, legal requirements, regulatory constraints, industry practice, ability to access capital markets and other factors deemed relevant by its board of directors.\nCollaborations, Licensing and Other Arrangements\nAbbVie enters into collaborative, licensing and other arrangements with third parties that may require future milestone payments to third parties contingent upon the achievement of certain development, regulatory, or commercial milestones. Individually, these arrangements are insignificant in any one annual reporting period. However, if milestones for multiple products covered by these arrangements happen to be reached in the same reporting period, the aggregate charge to expense could be material to the results of operations in that period. From a business perspective, the payments are viewed as positive because they signify that the product is successfully moving through development and is now generating or is more likely to generate future cash flows from product sales. It is not possible to predict with reasonable certainty whether these milestones will be achieved or the timing for achievement. See Note 5 to the Consolidated Financial Statements for additional information on these collaboration arrangements.\nCRITICAL ACCOUNTING POLICIES AND ESTIMATES\nThe preparation of financial statements in accordance with generally accepted accounting principles in the United States requires the use of estimates and assumptions that affect the reported amounts of assets and liabilities and the reported amounts of revenue and expenses. A summary of the company's significant accounting policies is included in Note 2 to the Consolidated Financial Statements. Certain of these policies are considered critical as these most significantly impact the company's financial condition and results of operations and require the most difficult, subjective, or complex judgments, often as a result of the need to make estimates about the effect of matters that are inherently uncertain. Actual results may vary from these estimates.\nRevenue Recognition\nAbbVie recognizes revenue when control of promised goods or services is transferred to the company’s customers, in an amount that reflects the consideration AbbVie expects to be entitled to in exchange for those goods or services. Sales, value add and other taxes collected concurrent with revenue-producing activities are excluded from revenue. AbbVie generates revenue primarily from product sales. For the majority of sales, the company transfers control, invoices the customer and recognizes revenue upon shipment to the customer. \n45 \n \n \n|\n  \n2024 Form 10-K\n                                                         \nRebates \nAbbVie provides rebates to pharmacy benefit managers, state government Medicaid programs, insurance companies that administer Medicare drug plans, wholesalers, group purchasing organizations and other government agencies and private entities.\nRebate and chargeback accruals are accounted for as variable consideration and are recorded as a reduction to revenue in the period the related product is sold. Provisions for rebates and chargebacks totaled $59.3 billion in 2024, $56.8 billion in 2023 and $41.4 billion in 2022. Rebate amounts are typically based upon the volume of purchases using contractual or statutory prices, which may vary by product and by payer. For each type of rebate, the factors used in the calculations of the accrual for that rebate include the identification of the products subject to the rebate, the applicable price terms and the estimated lag time between sale and payment of the rebate, which can be significant.\nIn order to establish its rebate and chargeback accruals, the company uses both internal and external data to estimate the level of inventory in the distribution channel and the rebate claims processing lag time for each type of rebate. To estimate the rebate percentage or net price, the company tracks sales by product and by customer or payer. The company evaluates inventory data reported by wholesalers, available prescription volume information, product pricing, historical experience and other factors in order to determine the adequacy of its reserves. AbbVie regularly monitors its reserves and records adjustments when rebate trends, rebate programs and contract terms, legislative changes, or other significant events indicate that a change in the reserve is appropriate. Historically, adjustments to rebate accruals have not been material to net earnings.\nThe following table is an analysis of the three largest accruals for rebates and chargebacks, which comprise approximately 92% of the total consolidated rebate and chargebacks recorded as reductions to revenues in 2024. \n(in millions)\nMedicaid\n and\n Medicare\n Rebates\nManaged\n Care\n Rebates\nWholesaler\nChargebacks\nBalance as of December 31, 2021\n$\n3,816 \n$\n3,097 \n$\n902 \nProvisions\n11,713 \n14,119 \n13,070 \nPayments\n(10,331)\n(12,974)\n(12,829)\nBalance as of December 31, 2022\n5,198 \n4,242 \n1,143 \nProvisions\n15,153 \n23,978 \n14,191 \nPayments\n(15,054)\n(21,200)\n(14,162)\nBalance as of December 31, 2023\n5,297 \n7,020 \n1,172 \nProvisions\n15,866 \n24,127 \n14,782 \nPayments\n(13,756)\n(25,622)\n(14,797)\nBalance as of December 31, 2024\n$\n7,407 \n$\n5,525 \n$\n1,157 \nOther Allowances\nOther allowances include cash discounts, product returns, sales incentives and other adjustments, which are accounted for as variable consideration and are recorded as a reduction to revenue in the same period the related product is sold. Reserves for cash discounts and sales incentives are readily determinable because the company's experience of payment history is fairly consistent. Product returns can be reliably estimated based on the company's historical return experience. Cash discounts totaled $2.0 billion in 2024, $2.0 billion in 2023 and $1.8 billion in 2022.\nPension and Other Post-Employment Benefits\nAbbVie engages outside actuaries to assist in the determination of the obligations and costs under the pension and other post-employment benefit plans that are direct obligations of AbbVie. The valuation of the funded status and the net periodic benefit cost for these plans are calculated using actuarial assumptions. The significant assumptions, which are reviewed annually, include the discount rate, the expected long-term rate of return on plan assets and the health care cost trend rates and are disclosed in Note 12 to the Consolidated Financial Statements.\nThe discount rate is selected based on current market rates on high-quality, fixed-income investments at December 31 each year. AbbVie employs a yield-curve approach for countries where a robust bond market exists. The yield curve is developed using high-quality bonds. The yield-curve approach reflects the plans' specific cash flows (i.e., duration) in calculating the benefit obligations by applying the corresponding individual spot rates along the yield curve. AbbVie reflects \n2024 Form 10-K\n   |  \n46\n                                                         \nthe plans' specific cash flows and applies them to the corresponding individual spot rates along the yield curve in calculating the service cost and interest cost portions of expense. For certain plans, AbbVie reviews various indices such as corporate bond and government bond benchmarks to estimate the discount rate. \nAbbVie's assumed discount rates have a significant effect on the amounts reported for defined benefit pension and other post-employment plans as of December 31, 2024. A 50 basis point change in the assumed discount rate would have had the following effects on AbbVie's calculation of net periodic benefit costs in 2025 and projected benefit obligations as of December 31, 2024:\n50 basis point\n(in millions) (brackets denote a reduction)\nIncrease\nDecrease\nDefined benefit plans\nNet periodic benefit cost\n$\n(25)\n$\n39 \nProjected benefit obligation\n(596)\n664 \nOther post-employment plans\nNet periodic benefit cost\n$\n(5)\n$\n6 \nProjected benefit obligation\n(46)\n51 \nThe expected long-term rate of return is based on the asset allocation, historical performance and the current view of expected future returns. AbbVie considers these inputs with a long-term focus to avoid short-term market influences. The current long-term rate of return on plan assets for each plan is supported by the historical performance of the trust's actual and target asset allocation. AbbVie's assumed expected long-term rate of return has a significant effect on the amounts reported for defined benefit pension plans as of December 31, 2024 and will be used in the calculation of net periodic benefit cost in 2025. A one percentage point change in assumed expected long-term rate of return on plan assets would increase or decrease the net period benefit cost of these plans in 2025 by $109 million.\nThe health care cost trend rate is selected by reviewing historical trends and current views on projected future health care cost increases. The current health care cost trend rate is supported by the historical trend experience of each plan. Assumed health care cost trend rates have a significant effect on the amounts reported for health care plans as of December 31, 2024 and will be used in the calculation of net periodic benefit cost in 2025. \nIncome Taxes\nAbbVie accounts for income taxes under the asset and liability method. Provisions for federal, state and foreign income taxes are calculated on reported pre-tax earnings based on current tax laws. Deferred taxes are provided using enacted tax rates on the future tax consequences of temporary differences, which are the differences between the financial statement carrying amount of assets and liabilities and their respective tax bases and the tax benefits of carryforwards. A valuation allowance is established or maintained when, based on currently available information, it is more likely than not that all or a portion of a deferred tax asset will not be realized.\nLitigation\nThe company is subject to contingencies, such as various claims, legal proceedings and investigations regarding product liability, intellectual property, commercial, securities and other matters that arise in the normal course of business. See Note 15 to the Consolidated Financial Statements for additional information. Loss contingency provisions are recorded for probable losses at management's best estimate of a loss, or when a best estimate cannot be made, a minimum loss contingency amount within a probable range is recorded. Accordingly, AbbVie is often initially unable to develop a best estimate of loss and therefore, the minimum amount, which could be zero, is recorded. As information becomes known, either the minimum loss amount is increased, resulting in additional loss provisions, or a best estimate can be made, also resulting in additional loss provisions. Occasionally, a best estimate amount is changed to a lower amount when events result in an expectation of a more favorable outcome than previously expected.\nValuation of Goodwill and Intangible Assets\nAbbVie has acquired and may continue to acquire significant intangible assets in connection with business combinations that AbbVie records at fair value. Transactions involving the purchase or sale of intangible assets occur between companies in the pharmaceuticals industry and valuations are usually based on a discounted cash flow analysis incorporating the stage of completion. The discounted cash flow model requires assumptions about the timing and amount of future net cash flows, risk, cost of capital, terminal values and market participants. Each of these factors can significantly affect the value of the intangible asset. In-process research and development (IPR&D) acquired in a business combination is capitalized as an \n47 \n \n \n|\n  \n2024 Form 10-K\n                                                         \nindefinite-lived intangible asset until regulatory approval is obtained, at which time it is accounted for as a definite-lived asset and amortized over its estimated useful life, or discontinuation, at which point the intangible asset will be written off. IPR&D acquired in transactions that are not business combinations is expensed immediately, unless deemed to have an alternative future use. Payments made to third parties subsequent to regulatory approval are capitalized and amortized over the remaining useful life.\nAbbVie reviews the recoverability of definite-lived intangible assets whenever events or changes in circumstances indicate the carrying value of an asset may not be recoverable. Goodwill and indefinite-lived intangible assets are reviewed for impairment annually or when an event occurs that could result in an impairment. See Note 2 to the Consolidated Financial Statements for additional information.\nAnnually, the company tests its goodwill for impairment by first assessing qualitative factors to determine whether it is more likely than not that the fair value is less than its carrying amount. Some of the factors considered in the assessment include general macro-economic conditions, conditions specific to the industry and market, cost factors, the overall financial performance and whether there have been sustained declines in the company's share price. If the company concludes it is more likely than not that the fair value of the reporting unit is less than its carrying amount, a quantitative impairment test is performed. AbbVie tests indefinite-lived intangible assets for impairment by first assessing qualitative factors to determine whether it is more likely than not that the fair value is less than its carrying amount. If the company concludes it is more likely than not that the fair value is less than its carrying amount, a quantitative impairment test is performed. \nFor its quantitative impairment tests, the company uses an estimated future cash flow approach that requires significant judgment with respect to future volume, revenue and expense growth rates, changes in working capital use, the selection of an appropriate discount rate, asset groupings and other assumptions and estimates. The estimates and assumptions used are consistent with the company's business plans and a market participant's views. The use of alternative estimates and assumptions could increase or decrease projected cash flows and the estimated fair value of the related intangible assets. Future changes to these estimates and assumptions could have a material impact on the company's results of operations. Actual results may differ from the company's estimates.\nContingent\n \nConsideration\nThe fair value measurements of contingent consideration liabilities are determined as of the acquisition date based on significant unobservable inputs, including the discount rate, estimated probabilities and timing of achieving specified development, regulatory and commercial milestones and the estimated amount of future sales of the acquired products. Contingent consideration liabilities are revalued to fair value at each subsequent reporting date until the related contingency is resolved. The potential contingent consideration payments are estimated by applying a probability-weighted expected payment model for contingent milestone payments and a Monte Carlo simulation model for contingent royalty payments, which are then discounted to present value. Changes to the fair value of the contingent consideration liabilities can result from changes to one or a number of inputs, including discount rates, the probabilities of achieving the milestones, the time required to achieve the milestones and estimated future sales. Significant judgment is employed in determining the appropriateness of certain of these inputs, which are disclosed in Note 11 to the Consolidated Financial Statements. Changes to the inputs described above could have a material impact on the company's financial position and results of operations in any given period.\n2024 Form 10-K\n   |  \n48",
  "item2": null
}