{
  "source_file": "abbv-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "ITEM 2. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe following is a discussion and analysis of the financial condition of AbbVie Inc. (AbbVie or the company) as of September 30, 2025 and December 31, 2024 and the results of operations for the three and nine months ended September 30, 2025 and 2024. This commentary should be read in conjunction with the Condensed Consolidated Financial Statements and accompanying notes appearing in Item 1, “Financial Statements and Supplementary Data.”\nEXECUTIVE OVERVIEW\nCompany Overview\nAbbVie is a global, diversified research-based biopharmaceutical company positioned for success with a comprehensive product portfolio that has leadership positions across immunology, neuroscience, oncology, aesthetics and eye care. AbbVie uses its expertise, dedicated people and unique approach to innovation to develop and market advanced therapies that address some of the world’s most complex and serious diseases.\nOn February 13, 2025, the board of directors of AbbVie unanimously elected Chief Executive Officer (CEO) Robert A. Michael to succeed Richard A. Gonzalez as Chairman of the board of directors, effective July 1, 2025, at which time Mr. Gonzalez retired from the board.\nAbbVie's products are generally sold worldwide directly to wholesalers, distributors, government agencies, health care facilities, specialty pharmacies and independent retailers from AbbVie-owned distribution centers and public warehouses. Certain products (including aesthetic products and devices) are also sold directly to physicians and other licensed healthcare providers. In the United States (U.S.), AbbVie distributes pharmaceutical products principally through independent wholesale distributors, with some sales directly to retailers, pharmacies, patients or other customers. Outside the United States, AbbVie sells products primarily to wholesalers or through distributors, and depending on the market works through largely centralized national payers system to agree on reimbursement terms. Certain products are co-marketed or co-promoted with other companies. AbbVie operates as a single global business segment and has approximately 55,000 employees.\n2025 Strategic Objectives\nAbbVie's mission is to discover and develop innovative medicines and products that solve serious health issues today and address the medical challenges of tomorrow while achieving top-tier financial performance through outstanding execution. AbbVie intends to execute its strategy and advance its mission in a number of ways, including: (i) maximizing the benefits of a diversified revenue base with multiple long-term growth drivers; (ii) leveraging AbbVie's commercial strength and international infrastructure across therapeutic areas and ensuring strong commercial execution of new product launches; (iii) continuing to invest in and expand its pipeline in support of opportunities in immunology, neuroscience, oncology, aesthetics and eye care as well as continued investment in key on-market products; (iv) generating substantial operating cash flows to support investment in innovative research and development, and return cash to shareholders via a strong and growing dividend while also continuing to repay debt. In addition, AbbVie anticipates several regulatory submissions and data readouts from key clinical trials in the next 12 months.\nFinancial Results\nThe company’s financial performance for the nine months ended September 30, 2025 included delivering worldwide net revenues of $44.5 billion, operating earnings of $10.5 billion, diluted earnings per share of $1.34 and cash flows from operations of $13.8 billion. Worldwide net revenues increased 8% on a reported basis and on a constant currency basis. \nFinancial results for the nine months ended September 30, 2025 also included the following costs: (i) $5.6 billion related to the amortization of intangible assets; (ii) $5.1 billion for the change in fair value of contingent consideration liabilities; (iii) $847 million related to intangible assets impairment expense; and (iv) $273 million of acquisition and integration expenses. Additionally, financial results reflected continued funding to support all stages of AbbVie’s pipeline assets and continued investment in AbbVie’s on-market brands.\n2025 Form 10-Q\n | \n26\nRecent Events\nRegulatory Environment\nAbbVie’s business may be impacted by risks associated with global macroeconomic conditions, including international trade disruptions and disputes as well as trade protection measures. For example, the United States government has recently imposed broad-based tariffs targeting specified countries. While the impact of these tariffs on AbbVie’s business and results of operations to date has not been material, the United States government may in the future pause, reimpose or increase tariffs and foreign governments have and, in the future, may impose retaliatory trade protection measures. Any new or additional tariffs, particularly those targeting the pharmaceuticals industry, may increase uncertainties and associated risks and could adversely impact AbbVie’s business and results of operations.\nAbbVie is also subject to public and legislative pressure with respect to pharmaceutical pricing. In the United States, Executive Order 14297, issued on May 12, 2025, directs the Secretary of Health and Human Services (HHS) to pursue most-favored-nation (MFN) pricing, defined as the lowest price in any Organization for Economic Co-operation and Development country with a gross domestic product per capita of at least 60% of that of the United States. The order directs HHS to implement policies mandating MFN pricing along with other regulatory actions if substantial progress toward voluntary compliance is not achieved. AbbVie continues to evaluate the potential impact of this executive order, and any new or additional legislation, regulations or executive orders related to pharmaceutical pricing may increase uncertainties and associated risks and could adversely impact AbbVie’s business and results of operations. \nOn July 4, 2025, the United States government signed into law the One Big Beautiful Bill Act of 2025 (2025 Act). Included within the 2025 Act are provisions that permanently extend certain expiring provisions of the 2017 Tax Cuts and Jobs Act, modify the international tax framework to reduce the tax rate on certain foreign earned income, restore the tax treatment of expensing for domestic research and development costs and bonus depreciation, and allow for full expensing of qualified production property. In addition, the legislation contains multiple effective dates and transition elections, with certain provisions effective in 2025 and others implemented through 2027. The 2025 Act also includes certain new health care provisions related to the orphan drug exclusion of the Inflation Reduction Act of 2022, and Medicaid, which have various effective dates. The company expects the new legislation to have a favorable impact on cash tax payments in the current year. The company will continue to assess the impact of the 2025 Act as further information is made available.\nU.S. Capital Investment\nIn September 2025, AbbVie announced the start of construction of a new active pharmaceutical ingredient facility in Illinois and an expansion of biologics manufacturing and research and development capacity in Massachusetts. These projects are part of AbbVie's previously announced plan to increase capital investment in the U.S. to broadly support innovation and expand critical manufacturing capabilities and capacity.\nIntellectual Property Protection and Regulatory Exclusivity\nOn September 11, 2025, AbbVie announced the settlement of litigation with all generic manufacturers that filed abbreviated new drug applications with the U.S. Food and Drug Administration for generic versions of upadacitinib tablets, which AbbVie markets as Rinvoq. Given the settlement and license agreements, which are subject to standard acceleration provisions, assuming pediatric exclusivity is granted, no generic entry for any Rinvoq tablets is expected prior to April 2037 in the United States.\nResearch and Development\nResearch and innovation are the cornerstones of AbbVie’s business as a global biopharmaceutical company. AbbVie’s long-term success depends to a great extent on its ability to continue to discover and develop innovative products and acquire or collaborate on compounds currently in development by other biotechnology or pharmaceutical companies.\nAbbVie’s pipeline currently includes approximately 90 compounds, devices or indications in development individually or under collaboration or license agreements. Of these programs, approximately 60 are in mid- and late-stage development. The company’s pipeline is focused on such important specialties as immunology, neuroscience, oncology, aesthetics and eye care. AbbVie’s recently announced partnership with Gubra marks the company’s entrance into the obesity field, a therapeutic area with significant unmet need.\nThe following sections summarize transitions of significant programs from mid-stage development to late-stage development as well as developments in significant late-stage and registration programs. AbbVie expects multiple mid-stage programs to transition into late-stage programs in the next 12 months.\n2025 Form 10-Q\n | \n27\nSignificant Programs and Developments \nImmunology\nRinvoq\n•\nIn April 2025, AbbVie announced that the European Commission (EC) granted marketing authorization to Rinvoq for the treatment of giant cell arteritis (GCA) in adult patients.\n•\nIn April 2025, AbbVie announced that the U.S. Food and Drug Administration (FDA) approved Rinvoq for the treatment of GCA in adult patients.\n•\nIn July 2025, AbbVie announced positive topline results from Study 2 of its Phase 3 UP-AA trial for Rinvoq as a monotherapy in adults and adolescents with severe alopecia areata (AA).\n•\nIn August 2025, AbbVie announced positive topline results from Study 1 of its Phase 3 UP-AA trial for Rinvoq as a monotherapy in adult and adolescent patients with severe AA.\n•\nIn October 2025, AbbVie announced that the U.S. FDA approved a supplemental New Drug Application (sNDA) that updates the indication statement for Rinvoq for the treatment of adults with moderately to severely active ulcerative colitis and moderately to severely active Crohn's disease. The updated indication allows the use of Rinvoq prior to the use of tumor necrosis factor (TNF) blocking agents in patients for whom use of these treatments is clinically inadvisable and who have received at least one approved systemic therapy.\n•\nIn October 2025, AbbVie announced positive topline results from the Phase 3b/4 head-to-head SELECT-SWITCH study evaluating the efficacy and safety of Rinvoq compared to Humira in adult patients with moderate to severe rheumatoid arthritis (RA), who had an inadequate response or intolerance to a single TNF inhibitor other than Humira. In the study, Rinvoq demonstrated superiority versus Humira in achieving low disease activity and remission.\n•\nIn October 2025, AbbVie announced positive topline results from two replicate Phase 3 studies evaluating the efficacy and safety of Rinvoq in adult and adolescent patients with non-segmental vitiligo.\nNeuroscience\nQulipta\n•\nIn February 2025, AbbVie initiated a Phase 3 clinical trial to evaluate Qulipta for the preventive treatment of menstrual migraine.\n•\nIn June 2025, AbbVie announced positive topline results from its Phase 3 TEMPLE head-to-head study evaluating the tolerability, safety and efficacy of Qulipta compared to the highest tolerated dose of topiramate in adult patients with a history of four or more migraine days per month.\nTavapadon\n•\nIn September 2025, AbbVie announced that it submitted a New Drug Application (NDA) to the U.S. FDA for Tavapadon, a novel selective dopamine D1/D5 receptor partial agonist, for the treatment of Parkinson's disease.\nOncology\nEmrelis\n•\nIn May 2025, AbbVie announced that the U.S. FDA granted accelerated approval for Emrelis (telisotuzumab vedotin-tllv) for the treatment of adult patients with locally advanced or metastatic, non-squamous non-small cell lung cancer with high c-Met protein overexpression who have received a prior systemic therapy.\nVenclexta\n•\nIn June 2025, AbbVie announced that the global Phase 3 VERONA trial evaluating Venclexta in combination with azacitidine in the treatment of newly diagnosed higher-risk myelodysplastic syndrome did not meet the primary endpoint of overall survival. No new safety signals were observed.\n2025 Form 10-Q\n | \n28\n•\nIn July 2025, AbbVie announced the submission of a sNDA to the U.S. FDA for the fixed-duration, all oral combination regimen of Venclexta and acalabrutinib in previously untreated patients with chronic lymphocytic leukemia (CLL). The submission is supported by positive results from the Phase 3 AMPLIFY trial which demonstrated that the combination regimen improved progression-free survival compared to standard chemoimmunotherapy in previously untreated patients with CLL. \nEpkinly\n•\nIn May 2025, Genmab A/S (Genmab) announced positive topline results from the Phase 3 trial evaluating Epkinly plus rituximab and lenalidomide versus rituximab and lenalidomide alone in adult patients with relapsed or refractory (R/R) follicular lymphoma. \n•\nIn August 2025, Genmab announced that it submitted a supplemental Biologics License Application (BLA) to the U.S. FDA for approval of Epkinly plus rituximab and lenalidomide for the treatment of adult patients with R/R follicular lymphoma.\nPVEK\n•\nIn September 2025, AbbVie announced the submission of a new BLA to the U.S. FDA for approval of pivekimab sunirine (PVEK), an investigational antibody-drug conjugate (ADC), for treatment of blastic plasmacytoid dendritic cell neoplasm (BPDCN). \nAesthetics\nTrenibotE\n•\nIn April 2025, AbbVie announced that it submitted a BLA to the U.S. FDA for approval of trenibotulinumtoxinE (TrenibotE) for the treatment of moderate to severe glabellar lines. TrenibotE is a first-in-class botulinum neurotoxin serotype E characterized by a rapid onset of action as early as 8 hours after administration and short duration of effect of 2-3 weeks. If approved, TrenibotE will be the first neurotoxin of its kind available to patients.\nJuvederm Collection\n•\nIn June 2025, AbbVie announced that the U.S. FDA accepted for review the supplemental premarket approval application for Skinvive by Juvederm to reduce neck lines for the improvement of neck appearance.\nOther\nEmblaveo\n•\nIn February 2025, AbbVie announced that the U.S. FDA approved Emblaveo (aztreonam and avibactam), as the first fixed-dose, intravenous, monobactam/β-lactamase inhibitor combination antibiotic to treat complicated intra-abdominal infections, including those caused by Gram-negative bacteria. \nMavyret\n•\nIn June 2025, AbbVie announced that the U.S. FDA approved a label expansion for Mavyret, an oral pangenotypic direct acting antiviral therapy. It is now approved for the treatment of adults and pediatric patients three years and older with acute or chronic hepatitis C virus infection immediately at the time of diagnosis.\nFor a more comprehensive discussion of AbbVie’s products and pipeline, see the company’s Annual Report on Form 10-K for the year ended December 31, 2024.\n2025 Form 10-Q\n | \n29\nRESULTS OF OPERATIONS\nNet Revenues\nThe comparisons presented at constant currency rates reflect comparative local currency net revenues at the prior year’s foreign exchange rates. This measure provides information on the change in net revenues assuming that foreign currency exchange rates had not changed between the prior and current periods. AbbVie believes that the non-GAAP measure of change in net revenues at constant currency rates, when used in conjunction with the GAAP measure of change in net revenues at actual currency rates, may provide a more complete understanding of the company’s operations and can facilitate analysis of the company’s results of operations, particularly in evaluating performance from one period to another.\nThree months ended\nSeptember 30,\nPercent change\nNine months ended\nSeptember 30,\nPercent change\nAt actual \ncurrency rates\nAt constant \ncurrency rates\nAt actual \ncurrency rates\nAt constant \ncurrency rates\n(dollars in millions)\n2025\n2024\n2025\n2024\nUnited States\n$\n12,068 \n$\n11,148 \n8.2 \n%\n8.2 \n%\n$\n33,809 \n$\n31,295 \n8.0 \n%\n8.0 \n%\nInternational\n3,708 \n3,312 \n12.0 \n%\n9.0 \n%\n10,733 \n9,937 \n8.0 \n%\n8.6 \n%\nNet revenues\n$\n15,776 \n$\n14,460 \n9.1 \n%\n8.4 \n%\n$\n44,542 \n$\n41,232 \n8.0 \n%\n8.2 \n%\n2025 Form 10-Q\n | \n30\nThe following table details AbbVie’s worldwide net revenues: \nThree months ended\nSeptember 30,\nPercent change\nNine months ended\nSeptember 30,\nPercent change\nAt actual \ncurrency rates\nAt constant \ncurrency rates\nAt actual \ncurrency rates\nAt constant \ncurrency rates\n(dollars in millions)\n2025\n2024\n2025\n2024\nImmunology\nSkyrizi\nUnited States\n$\n4,085 \n$\n2,778 \n47.0 \n%\n47.0 \n%\n$\n10,847 \n$\n6,774 \n60.1 \n%\n60.1 \n%\nInternational\n623 \n427 \n45.9 \n%\n40.2 \n%\n1,709 \n1,166 \n46.5 \n%\n46.1 \n%\nTotal\n$\n4,708 \n$\n3,205 \n46.8 \n%\n46.0 \n%\n$\n12,556 \n$\n7,940 \n58.1 \n%\n58.0 \n%\nRinvoq\nUnited States\n$\n1,559 \n$\n1,170 \n33.3 \n%\n33.3 \n%\n$\n4,231 \n$\n2,912 \n45.3 \n%\n45.3 \n%\nInternational\n625 \n444 \n40.7 \n%\n36.5 \n%\n1,699 \n1,225 \n38.7 \n%\n38.7 \n%\nTotal\n$\n2,184 \n$\n1,614 \n35.3 \n%\n34.1 \n%\n$\n5,930 \n$\n4,137 \n43.3 \n%\n43.3 \n%\nHumira\nUnited States\n$\n619 \n$\n1,765 \n(65.0)\n%\n(65.0)\n%\n$\n2,165 \n$\n5,896 \n(63.3)\n%\n(63.3)\n%\nInternational\n374 \n462 \n(18.9)\n%\n(20.5)\n%\n1,129 \n1,415 \n(20.2)\n%\n(19.1)\n%\nTotal\n$\n993 \n$\n2,227 \n(55.4)\n%\n(55.7)\n%\n$\n3,294 \n$\n7,311 \n(55.0)\n%\n(54.8)\n%\nNeuroscience\nVraylar\nUnited States\n$\n931 \n$\n873 \n6.7 \n%\n6.7 \n%\n$\n2,592 \n$\n2,338 \n10.9 \n%\n10.9 \n%\nInternational\n3 \n2 \n31.5 \n%\n32.3 \n%\n7 \n5 \n38.0 \n%\n41.8 \n%\nTotal\n$\n934 \n$\n875 \n6.7 \n%\n6.7 \n%\n$\n2,599 \n$\n2,343 \n10.9 \n%\n10.9 \n%\nBotox Therapeutic\nUnited States\n$\n825 \n$\n708 \n16.6 \n%\n16.6 \n%\n$\n2,323 \n$\n1,988 \n16.9 \n%\n16.9 \n%\nInternational\n160 \n140 \n13.4 \n%\n11.3 \n%\n456 \n422 \n8.0 \n%\n9.5 \n%\nTotal\n$\n985 \n$\n848 \n16.1 \n%\n15.8 \n%\n$\n2,779 \n$\n2,410 \n15.3 \n%\n15.6 \n%\nUbrelvy\nUnited States\n$\n344 \n$\n261 \n31.4 \n%\n31.4 \n%\n$\n907 \n$\n685 \n32.4 \n%\n32.4 \n%\nInternational\n10 \n8 \n34.1 \n%\n34.2 \n%\n25 \n18 \n41.5 \n%\n44.2 \n%\nTotal\n$\n354 \n$\n269 \n31.5 \n%\n31.5 \n%\n$\n932 \n$\n703 \n32.6 \n%\n32.7 \n%\nQulipta\nUnited States\n$\n252 \n$\n168 \n50.2 \n%\n50.2 \n%\n$\n661 \n$\n442 \n49.8 \n%\n49.8 \n%\nInternational\n36 \n8 \n>100.0 %\n>100.0 %\n87 \n15 \n>100.0 %\n>100.0 %\nTotal\n$\n288 \n$\n176 \n64.1 \n%\n63.1 \n%\n$\n748 \n$\n457 \n63.8 \n%\n63.4 \n%\nVyalev\nUnited States\n$\n53 \n$\n— \nn/m\nn/m\n$\n81 \n$\n— \nn/m\nn/m\nInternational\n85 \n28 \n>100.0 %\n>100.0 %\n218 \n55 \n>100.0 %\n>100.0 %\nTotal\n$\n138 \n$\n28 \n>100.0 %\n>100.0 %\n$\n299 \n$\n55 \n>100.0 %\n>100.0 %\nDuodopa\nUnited States\n$\n16 \n$\n24 \n(29.9)\n%\n(29.9)\n%\n$\n56 \n$\n72 \n(21.1)\n%\n(21.1)\n%\nInternational\n80 \n87 \n(9.0)\n%\n(13.8)\n%\n233 \n267 \n(13.0)\n%\n(14.0)\n%\nTotal\n$\n96 \n$\n111 \n(13.5)\n%\n(17.3)\n%\n$\n289 \n$\n339 \n(14.7)\n%\n(15.5)\n%\nOther Neuroscience\nUnited States\n$\n42 \n$\n54 \n(21.7)\n%\n(21.7)\n%\n$\n148 \n$\n172 \n(13.9)\n%\n(13.9)\n%\nInternational\n4 \n2 \n92.3 \n%\n94.0 \n%\n12 \n11 \n8.1 \n%\n12.2 \n%\nTotal\n$\n46 \n$\n56 \n(17.3)\n%\n(17.2)\n%\n$\n160 \n$\n183 \n(12.6)\n%\n(12.4)\n%\nOncology\nImbruvica\nUnited States\n$\n507 \n$\n618 \n(17.9)\n%\n(17.9)\n%\n$\n1,579 \n$\n1,823 \n(13.4)\n%\n(13.4)\n%\nCollaboration revenues\n199 \n210 \n(5.8)\n%\n(5.8)\n%\n619 \n676 \n(8.5)\n%\n(8.5)\n%\nTotal\n$\n706 \n$\n828 \n(14.8)\n%\n(14.8)\n%\n$\n2,198 \n$\n2,499 \n(12.1)\n%\n(12.1)\n%\nVenclexta\nUnited States\n$\n341 \n$\n340 \n— \n%\n— \n%\n$\n974 \n$\n921 \n5.8 \n%\n5.8 \n%\nInternational\n385 \n337 \n14.3 \n%\n10.0 \n%\n1,108 \n1,007 \n10.0 \n%\n10.9 \n%\nTotal\n$\n726 \n$\n677 \n7.1 \n%\n4.9 \n%\n$\n2,082 \n$\n1,928 \n8.0 \n%\n8.4 \n%\nElahere\nUnited States\n$\n150 \n$\n139 \n8.6 \n%\n8.6 \n%\n$\n453 \n$\n331 \n37.0 \n%\n37.0 \n%\nInternational\n20 \n— \nn/m\nn/m\n55 \n— \nn/m\nn/m\nTotal\n$\n170 \n$\n139 \n23.3 \n%\n22.4 \n%\n$\n508 \n$\n331 \n53.7 \n%\n53.3 \n%\nEpkinly\nCollaboration revenues\n$\n44 \n$\n31 \n42.6 \n%\n42.6 \n%\n$\n129 \n$\n82 \n57.7 \n%\n57.7 \n%\nInternational\n25 \n12 \n>100.0 %\n88.6 \n%\n61 \n24 \n>100.0 %\n>100.0 %\nTotal\n$\n69 \n$\n43 \n59.1 \n%\n55.7 \n%\n$\n190 \n$\n106 \n78.7 \n%\n78.0 \n%\nOther Oncology\nUnited States\n$\n11 \n$\n— \nn/m\nn/m\n$\n13 \n$\n— \nn/m\nn/m\nAesthetics\nBotox Cosmetic\nUnited States\n$\n379 \n$\n414 \n(8.4)\n%\n(8.4)\n%\n$\n1,084 \n$\n1,253 \n(13.4)\n%\n(13.4)\n%\nInternational\n258 \n257 \n0.7 \n%\n(0.6)\n%\n801 \n780 \n2.7 \n%\n3.7 \n%\nTotal\n$\n637 \n$\n671 \n(4.9)\n%\n(5.4)\n%\n$\n1,885 \n$\n2,033 \n(7.2)\n%\n(6.8)\n%\n2025 Form 10-Q\n | \n31\nThree months ended\nSeptember 30,\nPercent change\nNine months ended\nSeptember 30,\nPercent change\nAt actual \ncurrency rates\nAt constant \ncurrency rates\nAt actual \ncurrency rates\nAt constant \ncurrency rates\n(dollars in millions)\n2025\n2024\n2025\n2024\nJuvederm Collection\nUnited States\n$\n98 \n$\n105 \n(7.5)\n%\n(7.5)\n%\n$\n278 \n$\n349 \n(20.4)\n%\n(20.4)\n%\nInternational\n155 \n153 \n1.4 \n%\n(0.2)\n%\n466 \n549 \n(15.1)\n%\n(14.3)\n%\nTotal\n$\n253 \n$\n258 \n(2.2)\n%\n(3.2)\n%\n$\n744 \n$\n898 \n(17.2)\n%\n(16.7)\n%\nOther Aesthetics\nUnited States\n$\n265 \n$\n272 \n(2.3)\n%\n(2.3)\n%\n$\n817 \n$\n828 \n(1.4)\n%\n(1.4)\n%\nInternational\n38 \n38 \n(0.8)\n%\n(2.2)\n%\n128 \n119 \n7.6 \n%\n9.0 \n%\nTotal\n$\n303 \n$\n310 \n(2.1)\n%\n(2.3)\n%\n$\n945 \n$\n947 \n(0.3)\n%\n(0.1)\n%\nEye Care\nOzurdex\nUnited States\n$\n32 \n$\n33 \n(4.9)\n%\n(4.9)\n%\n$\n92 \n$\n102 \n(9.9)\n%\n(9.9)\n%\nInternational\n85 \n86 \n(0.3)\n%\n(3.6)\n%\n273 \n272 \n0.4 \n%\n0.6 \n%\nTotal\n$\n117 \n$\n119 \n(1.6)\n%\n(4.0)\n%\n$\n365 \n$\n374 \n(2.4)\n%\n(2.2)\n%\nLumigan/Ganfort\nUnited States\n$\n42 \n$\n58 \n(26.1)\n%\n(26.1)\n%\n$\n142 \n$\n129 \n10.3 \n%\n10.3 \n%\nInternational\n55 \n58 \n(6.0)\n%\n(8.7)\n%\n164 \n181 \n(9.4)\n%\n(8.0)\n%\nTotal\n$\n97 \n$\n116 \n(15.9)\n%\n(17.3)\n%\n$\n306 \n$\n310 \n(1.2)\n%\n(0.4)\n%\nAlphagan/Combigan\nUnited States\n$\n9 \n$\n26 \n(67.4)\n%\n(67.4)\n%\n$\n35 \n$\n54 \n(34.7)\n%\n(34.7)\n%\nInternational\n38 \n36 \n6.8 \n%\n4.7 \n%\n108 \n116 \n(6.9)\n%\n(4.4)\n%\nTotal\n$\n47 \n$\n62 \n(24.7)\n%\n(25.9)\n%\n$\n143 \n$\n170 \n(15.8)\n%\n(14.1)\n%\nOther Eye Care\nUnited States\n$\n138 \n$\n123 \n12.3 \n%\n12.3 \n%\n$\n399 \n$\n421 \n(5.5)\n%\n(5.5)\n%\nInternational\n110 \n105 \n4.7 \n%\n3.5 \n%\n316 \n321 \n(1.4)\n%\n1.4 \n%\nTotal\n$\n248 \n$\n228 \n8.8 \n%\n8.2 \n%\n$\n715 \n$\n742 \n(3.7)\n%\n(2.5)\n%\nOther Key Products\nMavyret\nUnited States\n$\n146 \n$\n147 \n(0.2)\n%\n(0.2)\n%\n$\n472 \n$\n458 \n3.3 \n%\n3.3 \n%\nInternational\n166 \n155 \n6.9 \n%\n2.1 \n%\n521 \n562 \n(7.4)\n%\n(7.6)\n%\nTotal\n$\n312 \n$\n302 \n3.5 \n%\n1.0 \n%\n$\n993 \n$\n1,020 \n(2.6)\n%\n(2.7)\n%\nCreon\nUnited States\n$\n368 \n$\n338 \n9.1 \n%\n9.1 \n%\n$\n1,127 \n$\n995 \n13.3 \n%\n13.3 \n%\nLinzess/Constella\nUnited States\n$\n315 \n$\n225 \n39.6 \n%\n39.6 \n%\n$\n701 \n$\n693 \n1.1 \n%\n1.1 \n%\nInternational\n11 \n9 \n29.7 \n%\n26.0 \n%\n31 \n28 \n14.2 \n%\n14.9 \n%\nTotal\n$\n326 \n$\n234 \n39.2 \n%\n39.1 \n%\n$\n732 \n$\n721 \n1.6 \n%\n1.6 \n%\nAll other\n$\n660 \n$\n726 \n(9.1)\n%\n(8.8)\n%\n$\n2,010 \n$\n2,280 \n(11.8)\n%\n(11.3)\n%\nTotal net revenues\n$\n15,776 \n$\n14,460 \n9.1 \n%\n8.4 \n%\n$\n44,542 \n$\n41,232 \n8.0 \n%\n8.2 \n%\nn/m – Not meaningful\nThe following discussion and analysis of AbbVie’s net revenues by product is presented on a constant currency basis.\nNet revenues for Skyrizi increased 46% for the three months and 58% for the nine months ended September 30, 2025 primarily driven by continued strong market share uptake as well as market growth across all indications.\nNet revenues for Rinvoq increased 34% for the three months and 43% for the nine months ended September 30, 2025 primarily driven by continued strong market share uptake as well as market growth across all indications.\nNet revenues for Humira decreased 56% for the three months and 55% for the nine months ended September 30, 2025 primarily driven by continued impact of direct biosimilar competition following the loss of exclusivity.\nNet revenues for Vraylar increased 7% for the three months and 11% for the nine months ended September 30, 2025 primarily driven by continued market share uptake as well as market growth. Net revenues for the three months ended September 30, 2025 were also partially offset by unfavorable pricing.\nNet revenues for Botox Therapeutic increased 16% for the three and nine months ended September 30, 2025 primarily driven by continued market share uptake as well as market growth.\nNet revenues for Ubrelvy increased 32% for the three months and 33% for the nine months ended September 30, 2025 primarily driven by continued market share uptake as well as market growth.\nNet revenues for Qulipta increased 63% for the three and nine months ended September 30, 2025 primarily driven by continued strong market share uptake as well as market growth.\n2025 Form 10-Q\n | \n32\nNet revenues for Imbruvica represent product revenues in the United States and collaboration revenues outside of the United States related to AbbVie’s 50% share of Imbruvica profit. AbbVie's global Imbruvica revenues decreased 15% for the three months and 12% for the nine months ended September 30, 2025 primarily driven by decreased demand and unfavorable pricing in the United States as well as decreased collaboration revenues.\nNet revenues for Venclexta increased 5% for the three months and 8% for the nine months ended September 30, 2025 primarily driven by increased demand, partially offset by unfavorable pricing.\nNet revenues for Elahere increased 22% for the three months and 53% for the nine months ended September 30, 2025 primarily driven by increased demand. Net revenues for the nine months ended September 30, 2025 were also favorably impacted by a full period of Elahere results in 2025 compared to the prior year.\nNet revenues for Botox Cosmetic decreased 5% for the three months and 7% for the nine months ended September 30, 2025. In the United States, Botox Cosmetic net revenues decreased 8% for the three months and 13% for the nine months ended September 30, 2025 primarily driven by unfavorable pricing due to consumer loyalty program changes, lower market share and decreased consumer demand, partially offset by the timing of customer inventory destocking in the prior year. Internationally, Botox Cosmetic net revenues increased 4% for the nine months ended September 30, 2025 primarily driven by increased consumer demand across certain international markets, partially offset by unfavorable pricing.\nNet revenues for Juvederm Collection decreased 3% for the three months and 17% for the nine months ended September 30, 2025 primarily driven by decreased global consumer demand, partially offset by the timing of customer inventory destocking in the prior year. \nGross Margin \nThree months ended\nSeptember 30,\nNine months ended\nSeptember 30,\n(dollars in millions)\n2025\n2024\n% change\n2025\n2024\n% change\nGross margin\n$\n10,472\n$\n10,248\n2 \n%\n$\n30,890\n$\n28,724\n8 \n%\nas a % of net revenues\n66 \n%\n71 \n%\n69 \n%\n70 \n%\nGross margin as a percentage of net revenues decreased for the three and nine months ended September 30, 2025 compared to the prior year primarily due to intangible asset impairment charges of $847 million and unfavorable changes in product mix, partially offset by increased leverage from net revenues growth and lower acquisition and integration costs. Gross margin as a percentage of net revenues for the nine months ended September 30, 2025 was also partially offset by lower amortization of intangibles.\nSelling, General and Administrative\nThree months ended\nSeptember 30,\nNine months ended\nSeptember 30,\n(dollars in millions)\n2025\n2024\n% change\n2025\n2024\n% change\nSelling, general and administrative \n$\n3,569\n$\n4,205\n(15)\n%\n$\n10,115\n$\n10,897\n(7)\n%\nas a % of net revenues\n23 \n%\n29 \n%\n23 \n%\n26 \n%\nSelling, general and administrative (SG&A) expenses as a percentage of net revenues decreased for the three and nine months ended September 30, 2025 compared to the prior year primarily due to leverage from net revenues growth and lower litigation reserve charges. SG&A expenses as a percentage of net revenues for the nine months ended September 30, 2025 were also favorably impacted by lower acquisition and integration costs.\nResearch and Development\nThree months ended\nSeptember 30,\nNine months ended\nSeptember 30,\n(dollars in millions)\n2025\n2024\n% change\n2025\n2024\n% change\nResearch and development\n$\n2,319 \n$\n2,130 \n9 \n%\n$\n6,517\n$\n6,017\n8 \n%\nas a % of net revenues\n15 \n%\n15 \n%\n15 \n%\n15 \n%\nResearch and development (R&D) expenses as a percentage of net revenues were flat for the three and nine months ended September 30, 2025 compared to the prior year. R&D expenses increased to support all stages of the company’s pipeline assets.\n2025 Form 10-Q\n | \n33\nAcquired IPR&D and Milestones\nThree months ended\nSeptember 30,\nNine months ended\nSeptember 30,\n(dollars in millions)\n2025\n2024\n2025\n2024\nUpfront charges\n$\n2,615 \n$\n82 \n$\n3,566 \n$\n1,088 \nDevelopment milestones\n65 \n— \n185 \n95 \nAcquired IPR&D and milestones\n$\n2,680 \n$\n82 \n$\n3,751 \n$\n1,183 \nAcquired IPR&D and milestones expense for the three and nine months ended September 30, 2025 included upfront charges of $1.9 billion related to the acquisition of Capstan Therapeutics, Inc. and $700 million related to a license agreement with Ichnos Glenmark Innovation, Inc. Acquired IPR&D and milestones expense for the nine months ended September 30, 2025 also included upfront charges of $350 million related to a license agreement with Gubra A/S and $335 million related to an option-to-license agreement with ADARx Pharmaceuticals, Inc. Acquired IPR&D and milestones expense for the nine months ended September 30, 2024 included an upfront charge of $250 million related to the acquisition of Celsius Therapeutics, Inc. See Note 4 to the Condensed Consolidated Financial Statements for additional information.\nOther Non-Operating Expenses (Income)\nThree months ended\nSeptember 30,\nNine months ended\nSeptember 30,\n(in millions)\n2025\n2024\n2025\n2024\nInterest expense\n$\n739 \n$\n720 \n$\n2,179 \n$\n2,106 \nInterest income\n(72)\n(129)\n(207)\n(556)\nInterest expense, net\n$\n667 \n$\n591 \n$\n1,972 \n$\n1,550 \nNet foreign exchange loss (gain)\n$\n20 \n$\n(3)\n$\n47 \n$\n2 \nOther expense, net\n503 \n1,159 \n4,583 \n3,090 \nInterest expense increased for the three and nine months ended September 30, 2025 compared to the prior year primarily due to the impact of higher average interest rates\n.\nInterest income decreased for the three and nine months ended September 30, 2025 compared to the prior year primarily due to a lower average cash and equivalents balance.\nOther expense, net included charges related to changes in fair value of contingent consideration liabilities of $776 million for the three months and $5.1 billion for the nine months ended September 30, 2025 and $1.4 billion for the three months and $3.5 billion for the nine months ended September 30, 2024. The fair value of contingent consideration liabilities is impacted by the passage of time and multiple other inputs, including the probability of success of achieving regulatory milestones, discount rates, the estimated amount of future sales of the acquired products and other market-based factors. For the three and nine months ended September 30, 2025, the change in fair value reflected the passage of time and lower discount rates. For the nine months ended September 30, 2025, the change in fair value also reflected higher estimated Skyrizi sales. For the three and nine months ended September 30, 2024, the change in fair value reflected higher estimated Skyrizi sales and the passage of time. For the three months ended September 30, 2024, the change in fair value also reflected the impact of lower discount rates.\nIncome Tax Expense\nThe effective tax rate was 74% for the three months and 39% for the nine months ended September 30, 2025 compared to 25% for the three months and 28% for the nine months ended September 30, 2024. The effective tax rate in each period was higher than the U.S. statutory tax rate of 21% principally due to business development activities and changes in fair value of contingent consideration, partially offset by the impact of foreign operations which reflects the impact of lower income tax rates in locations outside the United States. The increase in the effective tax rate for the three and nine months ended September 30, 2025 over the prior year was primarily due to business development activities and changes in fair value of contingent consideration, partially offset by changes in jurisdictional mix of earnings. \n2025 Form 10-Q\n | \n34\n FINANCIAL POSITION, LIQUIDITY AND CAPITAL RESOURCES \nNine months ended\nSeptember 30,\n(in millions)\n2025\n2024\nCash flows provided by (used in):\nOperating activities\n$\n13,812 \n$\n11,758 \nInvesting activities\n(5,180)\n(18,946)\nFinancing activities\n(8,558)\n1,650 \nOperating cash flows for the nine months ended September 30, 2025 increased compared to the prior year primarily due to increased results from operations driven by higher net revenues and lower acquisition-related cash expenses, partially offset by higher payments related to litigation matters and higher payments of contingent consideration liabilities.\nInvesting cash flows for the nine months ended September 30, 2025 included payments made for other acquisitions and investments, net of cash acquired of $4.1 billion and capital expenditures of $885 million. Investing cash flows for the nine months ended September 30, 2024 included $18.5 billion cash consideration paid to acquire ImmunoGen, Inc (ImmunoGen) and Cerevel Therapeutics Holdings, Inc. (Cerevel Therapeutics) offset by cash acquired of $952 million, net sales and maturities of investment securities of $470 million, payments made for other acquisitions and investments, net of cash acquired of $1.2 billion and capital expenditures of $683 million. \nFinancing cash flows for the nine months ended September 30, 2025 included the issuance of unsecured senior notes totaling $4.0 billion aggregate principal and $2.0 billion under the 364-day term loan credit agreement. Financing cash flows also included the repayment of $3.0 billion aggregate principal of 3.80% senior notes and $3.8 billion aggregate principal of 3.60% senior notes. Financing cash flows for the nine months ended September 30, 2024 included the issuance of unsecured senior notes totaling $15.0 billion aggregate principal which were used to finance the acquisitions of ImmunoGen and Cerevel Therapeutics. Additionally, financing cash flows included the issuance and repayment of $5.0 billion under the term loan credit agreement and repayments of €1.5 billion aggregate principal amount of 1.38% senior euro notes, €700 million aggregate principal amount of 1.25% senior euro notes, $1.0 billion aggregate principal amount of 3.85% senior notes, $99 million of secured term notes assumed from ImmunoGen in conjunction with the acquisition and the settlement of $400 million aggregate amount of 2.5% convertible senior notes assumed from Cerevel Therapeutics.\nFinancing cash flows also included cash dividend payments of $8.7 billion for the nine months ended September 30, 2025 and $8.3 billion for the nine months ended September 30, 2024. The increase in cash dividend payments was primarily driven by the increase in the quarterly dividend rate.\nOn September 5, 2025, the company announced that its board of directors declared a quarterly cash dividend of $1.64 per share for stockholders of record at the close of business on October 15, 2025, payable on November 14, 2025. On October 31, 2025, the board of directors declared an increase in the company’s quarterly dividend from $1.64 per share to $1.73 per share beginning with the dividend payable on February 17, 2026 to stockholders of record as of January 16, 2026. This reflects an increase of approximately 5.5% over the previous quarterly rate. The timing, declaration, amount of and payment of any dividends by AbbVie in the future is within the discretion of its board of directors and will depend upon many factors, including AbbVie’s financial condition, earnings, capital requirements of its operating subsidiaries, covenants associated with certain of AbbVie’s debt service obligations, legal requirements, regulatory constraints, industry practice, ability to access capital markets and other factors deemed relevant by its board of directors. \nThe company's stock repurchase authorization permits purchases of AbbVie shares from time to time in open-market or private transactions at management's discretion. The program has no time limit and can be discontinued at any time. On February 16, 2023, AbbVie’s board of directors authorized a $5.0 billion increase to the existing stock repurchase authorization. AbbVie repurchased 3 million shares for $606 million during the nine months ended September 30, 2025 and 5 million shares for $959 million during the nine months ended September 30, 2024.\nDuring the nine months ended September 30, 2025 and 2024, the company issued and redeemed commercial paper. The balance of commercial paper borrowings outstanding was $1.8 billion as of September 30, 2025, of which $791 million had original maturities greater than three months. There were no commercial paper borrowings outstanding as of December 31, 2024. AbbVie may issue additional commercial paper or retire commercial paper to meet liquidity requirements as needed.\n2025 Form 10-Q\n | \n35\nCredit Risk\nAbbVie monitors economic conditions, the creditworthiness of customers and government regulations and funding, both domestically and abroad. AbbVie regularly communicates with its customers regarding the status of receivable balances, including their payment plans and obtains positive confirmation of the validity of the receivables. AbbVie establishes an allowance for credit losses equal to the estimate of future losses over the contractual life of outstanding accounts receivable. AbbVie may also utilize factoring arrangements to mitigate credit risk, although the receivables included in such arrangements have historically not been a significant amount of total outstanding receivables.\nCredit Facility, Access to Capital and Credit Ratings\nCredit Facility\nIn January 2025, AbbVie entered into a new $3.0 billion five-year revolving credit facility that matures in January 2030 which is in addition to the existing $5.0 billion five-year revolving credit facility that matures in March 2028. The revolving credit facilities are available to support AbbVie’s commercial paper program and enable the company to borrow funds to meet liquidity requirements on an unsecured basis at variable interest rates and contain various covenants. At September 30, 2025, the company was in compliance with all covenants, and commitment fees under the credit facility were insignificant. No amounts were outstanding under the company's credit facility as of September 30, 2025 and December 31, 2024.\nIn April 2025, the company entered into a $4.0 billion 364-day term loan credit agreement. In May 2025, the company borrowed $2.0 billion under this term loan credit agreement which was outstanding and included in short-term borrowings on the condensed consolidated balance sheet as of September 30, 2025.\nIn December 2023, in connection with the acquisitions of ImmunoGen and Cerevel Therapeutics, AbbVie entered into a $9.0 billion 364-day bridge credit agreement and $5.0 billion 364-day term loan credit agreement. In February 2024, AbbVie borrowed and repaid $5.0 billion under the term loan credit agreement. Subsequent to the $15.0 billion issuance of senior notes, AbbVie terminated both the bridge and term loan credit agreements in the first quarter of 2024. \nAccess to Capital\nThe company intends to fund short-term and long-term financial obligations as they mature through cash on hand, future cash flows from operations or has the ability to issue additional debt. The company’s ability to generate cash flows from operations, issue debt or enter into financing arrangements on acceptable terms could be adversely affected if there is a material decline in the demand for the company’s products or in the solvency of its customers or suppliers, deterioration in the company’s key financial ratios or credit ratings or other material unfavorable changes in business conditions. At the current time, the company believes it has sufficient financial flexibility to issue debt, enter into other financing arrangements and attract long-term capital on acceptable terms to support the company’s growth objectives.\nCredit Ratings\nThere were no changes in the company’s credit ratings during the nine months ended September 30, 2025. Unfavorable changes to the ratings may have an adverse impact on future financing arrangements; however, they would not affect the company’s ability to draw on its credit facility and would not result in an acceleration of scheduled maturities of any of the company’s outstanding debt.\nCRITICAL ACCOUNTING POLICIES\nA summary of the company’s significant accounting policies is included in Note 2, “Summary of Significant Accounting Policies” in AbbVie's Annual Report on Form 10-K for the year ended December 31, 2024. There have been no significant changes in the company’s application of its critical accounting policies during the nine months ended September 30, 2025.\n2025 Form 10-Q\n | \n36\nFORWARD-LOOKING STATEMENTS\nSome statements in this quarterly report on Form 10-Q are, or may be considered, forward-looking statements for purposes of the Private Securities Litigation Reform Act of 1995. The words “believe,” “expect,” “anticipate,” “project,” and similar expressions and uses of future or conditional verbs, generally identify forward-looking statements. AbbVie cautions that these forward-looking statements are subject to risks and uncertainties that may cause actual results to differ materially from those expressed or implied in the forward-looking statements. Such risks and uncertainties include, but are not limited to challenges to intellectual property, competition from other products, difficulties inherent in the research and development process, adverse litigation or government action, changes to laws and regulations applicable to our industry, the impact of global macroeconomic factors, such as economic downturns or uncertainty, international conflict, trade disputes and tariffs, and other uncertainties and risks associated with global business operations. Additional information about the economic, competitive, governmental, technological and other factors that may affect AbbVie’s operations is set forth in Item 1A, “Risk Factors,” in AbbVie’s Annual Report on Form 10-K for the year ended December 31, 2024, which has been filed with the Securities and Exchange Commission. AbbVie notes these factors for investors as permitted by the Private Securities Litigation Reform Act of 1995. AbbVie undertakes no obligation, and specifically declines, to release publicly any revisions to forward-looking statements as a result of subsequent events or developments, except as required by law."
}