{
  "source_file": "abt-20241231.htm",
  "form_type": "10-K",
  "item1": "ITEM 1. BUSINESS\nGENERAL DEVELOPMENT OF BUSINESS\nAbbott Laboratories is an Illinois corporation, incorporated in 1900. Abbott’s* principal business is the discovery, development, manufacture, and sale of a broad and diversified line of healthcare products.\nNARRATIVE DESCRIPTION OF BUSINESS\nAbbott has four reportable segments: Established Pharmaceutical Products, Diagnostic Products, Nutritional Products, and Medical Devices.\nEstablished Pharmaceutical Products\nThese products include a broad line of branded generic pharmaceuticals manufactured worldwide and marketed and sold outside the United States in emerging markets. These products are generally sold directly to wholesalers, distributors, government agencies, healthcare facilities, pharmacies, and independent retailers from Abbott-owned distribution centers or public warehouses, depending on the market served. Certain products are co-marketed or co-promoted with, or licensed from, other companies.\nThe principal products included in the broad therapeutic area portfolios of the Established Pharmaceutical Products segment are:\n•\ngastroenterology products, including Creon™, for the treatment of pancreatic exocrine insufficiency associated with several underlying conditions, including cystic fibrosis and chronic pancreatitis; Duspatal™ and Dicetel™, for the treatment of irritable bowel syndrome or biliary spasm; Heptral™, Transmetil™, and Samyr™, for the treatment of intrahepatic cholestasis (associated with liver disease) or depressive symptoms; and Duphalac™, for regulation of the physiological rhythm of the colon;\n•\nwomen’s health products, including Duphaston™, for the treatment of many different gynecological disorders; and Femoston™, a hormone replacement therapy for postmenopausal women;\n•\ncardiovascular and metabolic products, including Lipanthyl™ and TriCor™, for the treatment of dyslipidemia; Omacor™, for the treatment of hypertriglyceridemia; Physiotens™, for the treatment of hypertension; and Synthroid™, for the treatment of hypothyroidism;\n•\npain and central nervous system products, including Serc™, for the treatment of Ménière’s disease and vestibular vertigo; Brufen™, for the treatment of pain, fever, and inflammation; and Sevedol™, for the treatment of severe migraines; \n•\nrespiratory drugs and vaccines, including the anti-infective clarithromycin (sold under the trademarks Klacid™, Claribid™, and Klaricid™); and Influvac™, an influenza vaccine; and\n•\nbiosimilar products, including the areas of oncology and women's health.\nThe Established Pharmaceutical Products segment directs its primary marketing efforts toward building strong brands with key stakeholders, including consumers, pharmacists, physicians, and other healthcare providers. Government agencies are also important customers.\nCompetition in the Established Pharmaceutical Products segment is generally from other healthcare and pharmaceutical companies. In addition, the substitution of generic drugs for the brand prescribed and introduction of additional forms of already marketed established products by generic or branded competitors may increase competitive pressures.\n________________________________________________________\n*\nAs used throughout the text of this report on Form 10-K, the term “Abbott” refers to Abbott Laboratories, an Illinois corporation, or Abbott Laboratories and its consolidated subsidiaries, as the context requires.\n1\nTable of Contents\nDiagnostic Products\nThese products include a broad line of diagnostic systems and tests manufactured, marketed, and sold worldwide. These products are generally marketed and sold directly to blood banks, hospitals, commercial laboratories, clinics, physicians’ offices, retailers, government agencies, alternate care testing sites, and plasma protein therapeutic companies from Abbott-owned distribution centers, public warehouses or third party distributors.\nThe principal products included in the Diagnostic Products segment are:\n•\ncore laboratory and transfusion medicine systems in the areas of immunoassay, clinical chemistry, hematology, and transfusion serology testing, including the Alinity\n®\n family of instruments along with the ARCHITECT\n®\n and Cell-Dyn\n®\n systems. These systems are used for screening and/or diagnosis for cancer, cardiac and metabolic disorders, drugs of abuse, thyroid function, fertility, neurologic and general chemistries, infectious diseases such as hepatitis and HIV, therapeutic drug monitoring, and a suite of SARS-CoV-2 serology assays;\n•\nmolecular diagnostics polymerase chain reaction (PCR) instrument systems, including Alinity\n®\n m and m2000™ that automate the extraction, purification, and preparation of DNA and RNA from patient samples, and detect and measure infectious agents including HIV, hepatitis, HPV, sexually transmitted infections, SARS-CoV-2 and influenza A & B, and respiratory syncytial virus (RSV); and products for oncology with the Vysis\n®\n FISH product line of genomic-based tests;\n•\npoint-of-care systems, including the i-STAT\n®\n and i-STAT\n®\n Alinity\n®\n and cartridges for testing blood gas, chemistry, electrolytes, coagulation and immunoassay;\n•\nrapid diagnostics lateral flow testing products in the area of infectious diseases such as SARS-CoV-2, including the BinaxNOW\n®\n and Panbio\n®\n rapid testing platforms, influenza, HIV, hepatitis, and tropical diseases such as malaria and dengue fever; molecular point-of-care testing for HIV, including the m-PIMA\n®\n HIV-1/2 Viral Load Test, and for SARS-CoV-2 and influenza A & B, RSV and strep A, including the ID NOW\n®\n rapid molecular system; cardiometabolic testing, including Afinion\n®\n and Cholestech LDX\n®\n platforms and tests; and a toxicology business for drug and alcohol testing; and\n•\ninformatics and automation solutions for use in laboratories, including laboratory automation systems such as the GLP systems Track™, the RALS\n®\n point-of-care solution, and AlinIQ\n®\n, a suite of informatics tools and professional services.\nThe Diagnostic Products segment’s products are subject to competition in technological innovation, price, convenience of use, service, instrument warranty provisions, product performance, laboratory efficiency, long-term supply contracts, and product potential for overall cost-effectiveness and productivity gains. Some products in this segment can be subject to rapid product obsolescence or regulatory changes. Although Abbott has benefited from technological advantages of certain of its current products, these advantages may be reduced or eliminated as competitors introduce new products.\nNutritional Products\nThese products include a broad line of pediatric and adult nutritional products manufactured, marketed, and sold worldwide. These products are generally marketed and sold directly to consumers and to institutions, wholesalers, retailers, healthcare facilities, government agencies, and third-party distributors from Abbott-owned distribution centers or third-party distributors.\nThe principal products included in the Nutritional Products segment are:\n•\nvarious forms of infant formula and follow-on formula, including Similac\n®\n, Similac\n®\n 360 Total Care\n®\n, Similac Pro-Advance\n®\n, Similac\n®\n Advance\n®\n, Similac 360 Total Care\n®\n Sensitive, Similac Sensitive\n®\n, Go & Grow by Similac\n®\n, Similac\n®\n NeoSure\n®\n, Similac\n®\n Organic, Similac\n®\n Special Care\n®\n, Similac Total Comfort\n®\n, Similac\n®\n Soy Isomil\n®\n,  Similac\n®\n Alimentum\n®\n, EleCare\n®\n, Gain™, and Grow™;\n•\nadult and other pediatric nutritional products, including Ensure\n®\n, Ensure Plus\n®\n, Ensure\n®\n Enlive\n®\n, Ensure\n®\n NutriVigor™, Ensure\n®\n Max Protein, Ensure\n®\n High Protein, Glucerna\n®\n, Glucerna Hunger Smart\n®\n, ProSure™, PediaSure\n®\n, PediaSure SideKicks\n®\n, PediaSure\n®\n Peptide, Juven\n®\n, Abound™, and Pedialyte\n®\n; and\n•\nnutritional products used in enteral feeding in healthcare institutions, including Jevity\n®\n, Glucerna\n®\n 1.2 Cal, Glucerna\n®\n 1.5 Cal, Osmolite\n®\n, Oxepa\n®\n, Freego™ (Enteral Pump) and Freego™ sets, Nepro\n®\n, and Vital\n®\n.\nPrimary marketing efforts for nutritional products are directed toward consumers or physicians or other healthcare professionals. In addition, nutritional products are also promoted directly to the public by consumer marketing efforts in markets where permitted.\n2\nTable of Contents\nCompetition for nutritional products in the segment is generally from other diversified consumer and healthcare manufacturers. Competitive factors include consumer advertising, formulation, packaging, scientific innovation, price, retail distribution, and availability of product forms. A significant aspect of competition is the search for ingredient innovations. The introduction of new products by competitors, changes in medical practices and procedures, and regulatory changes can result in product obsolescence. In addition, private label and local manufacturers’ products may increase competitive pressure.\nMedical Devices\nThese products include a broad line of rhythm management, electrophysiology, heart failure, vascular and structural heart devices for the treatment of cardiovascular diseases, and diabetes care and continuous glucose monitoring products, as well as neuromodulation devices for the management of chronic pain and movement disorders. Medical devices are manufactured, marketed and sold worldwide. In the United States, depending upon the product, medical devices are generally marketed and sold directly to wholesalers, hospitals, ambulatory surgery centers, physicians’ offices, consumers, and distributors from Abbott-owned distribution centers, public warehouses or third party distributors. Outside the United States, sales are made either directly to customers or through distributors, depending on the market served.\nThe principal products included in the Medical Devices segment are:\n•\nrhythm management products, including Assurity MRI\n®\n and Endurity MRI\n®\n pacemaker systems, and Aveir\n®\n single-chamber (VR and AR) and Aveir\n®\n dual chamber (DR) leadless pacemaker systems; Ellipse\n®\n, Fortify Assura\n®\n, and Gallant\n®\n implantable cardioverter defibrillators and Gallant and Quadra Assura MP\n®\n implantable cardioverter defibrillator with cardiac resynchronization therapy and MultiPoint™ Pacing technology; and Confirm Rx\n®\n, Jot Dx\n®\n and ASSERT-IQ\n®\n implantable cardiac monitors;\n•\nelectrophysiology products, including the TactiFlex\n®\n and TactiCath\n®\n families of ablation catheters, and FlexAbility\n®\n irrigated ablation catheters; EnSite\n®\n family of cardiac mapping systems; Agilis\n®\n NxT and Swartz™ introducer catheters; the Advisor\n®\n HD Grid mapping catheter; and ViewFlex\n®\n family of intracardiac echocardiography catheters;\n•\nheart failure related products, including the HeartMate\n®\n left ventricular assist device family; the CardioMEMS\n®\n HF System pulmonary artery sensor, a heart failure monitoring system; the CentriMag\n®\n System, an acute mechanical circulatory support system; and patient self-testing products and services;\n•\nvascular products, including the XIENCE\n®\n family of drug-eluting coronary stent systems developed on the Multi-Link Vision\n®\n platform; StarClose SE\n®\n, Perclose ProGlide\n®\n and Perclose ProStyle\n®\n vessel closure devices, TREK\n®\n coronary balloon dilatation products, Hi-Torque Balance Middleweight Universal II\n®\n guidewires, Supera\n®\n Peripheral Stent System, a peripheral vascular stent system; Acculink\n®\n/Accunet\n®\n and Xact\n®\n/Emboshield NAV6\n®\n, carotid stent systems; the OPTIS\n®\n integrated systems with Ultreon\n®\n 1.0 and 2.0 Software, compatible with the Dragonfly OPTIS\n®\n and OpStar\n®\n imaging catheters and PressureWire\n®\n fractional flow reserve measurement systems; Diamondback 360\n®\n coronary and peripheral orbital atherectomy systems; and Esprit™ BTK everolimus eluting resorbable scaffold system;\n•\nstructural heart products, including MitraClip\n®\n, a mitral valve transcatheter edge-to-edge repair system; TriClip\n®\n, a tricuspid valve transcatheter edge-to-edge repair system; Epic\n®\n, a surgical family of aortic valve and mitral valve replacement devices; Portico\n®\n and Navitor\n®\n transcatheter aortic heart valves; Regent™ and Masters Series\n®\n mechanical heart valves; Amplatzer\n®\n PFO occluders; Amplatzer Amulet\n®\n occluder devices; and the Tendyne\n®\n transcatheter mitral valve replacement system; \n•\ncontinuous glucose and blood glucose monitoring systems under the FreeStyle\n®\n brand such as the FreeStyle Libre\n®\n system, including sensors, data management decision software, test strips, and accessories for people with diabetes; and the Lingo\n®\n continuous glucose monitoring system, including sensors and data management decision software for people’s health and wellness; and\n•\nneuromodulation products, including spinal cord stimulators Proclaim\n®\n Plus and Proclaim\n®\n XR recharge-free implantable pulse generators (IPG) and rechargeable Eterna\n® \nIPG, each with BurstDR\n®\n stimulation, and Proclaim\n®\n DRG IPG, a neurostimulation device designed for dorsal root ganglion therapy, for the treatment of chronic pain disorders; and the non-rechargeable Infinity™ deep brain stimulation (DBS) system and the rechargeable Liberta RC™ DBS system, each with directional lead technology for the treatment of movement disorders.\n3\nTable of Contents\nThese products are subject to competition in technological innovation, price, convenience of use, service, product performance, long-term supply contracts, and product potential for overall cost-effectiveness and productivity gains. Some products in this segment can be subject to rapid product obsolescence or regulatory changes. Although Abbott has benefited from technological advantages of certain of its current products, these advantages may be reduced or eliminated as competitors introduce new products.\nINFORMATION WITH RESPECT TO ABBOTT’S BUSINESS IN GENERAL\nSources and Availability of Raw Materials\nAbbott purchases, in the ordinary course of business, raw materials and supplies essential to Abbott’s operations from numerous suppliers in the United States and around the world. There have been no recent significant availability problems or supply shortages for raw materials or supplies. \nPatents, Trademarks, and Licenses\nAbbott is aware of the desirability for patent and trademark protection for its products. Accordingly, where possible, patents and trademarks are sought and obtained for Abbott’s products in the United States and countries of interest to Abbott. Abbott owns or has licenses under a substantial number of patents and patent applications. Principal trademarks and the products they cover are discussed in the Narrative Description of Business on pages 1 through 4. These, and various patents that expire during the period from 2025 to 2045, in the aggregate, are believed to be of material importance in the operation of Abbott’s business. Abbott believes that no single patent, license, or trademark is material in relation to Abbott’s business as a whole.\nSeasonal Aspects, Customers, and Renegotiation\nThere are no significant seasonal aspects to Abbott’s business. Abbott has no single customer that, if the customer was lost, would have a material adverse effect on Abbott. No material portion of Abbott’s business is subject to renegotiation of profits or termination of contracts at the election of a government.\nEnvironmental Matters\nAbbott believes that its operations comply in all material respects with applicable laws and regulations concerning environmental protection. Regulations under federal, state, and various other countries’ environmental laws impose stringent limitations on emissions and discharges to the environment from various manufacturing operations. Abbott’s capital and operating expenditures for pollution control in 2024 were not material and are not expected to be material in 2025.\nAbbott has been identified as one of many potentially responsible parties in investigations and/or remediations at several locations in the United States, including Puerto Rico, under the Comprehensive Environmental Response, Compensation, and Liability Act, commonly known as Superfund. Abbott is also engaged in remediation at several other sites, some of which are owned by Abbott, in cooperation with the Environmental Protection Agency or similar agencies. While it is not feasible to predict with certainty the final costs related to those investigations and remediation activities, Abbott believes that such costs, together with other expenditures to maintain compliance with applicable laws and regulations concerning environmental protection, should not have a material adverse effect on Abbott’s financial position, cash flows, or results of operations.\nHuman Capital\nThe sustainability of Abbott’s business depends on attracting, engaging and developing talented people with diverse backgrounds who share Abbott’s mission to help people live their healthiest possible lives. Abbott provides its employees opportunities to grow and develop their careers, market competitive compensation and benefit programs, and the satisfaction of being part of a global company dedicated to improving health in more than 160 countries.\nAs of December 31, 2024, Abbott employed approximately 114,000 people, 69% of whom were employed outside of the U.S. Women represented 47% of Abbott’s U.S. workforce, 46% of its global workforce, and 43% of its managers.\n4\nTable of Contents\nTalent Management\nAbbott has an integrated global talent management process that is designed to identify and assess talent across the organization and provide equal and consistent opportunities for employees to develop their skills. All levels of employees participate in Abbott’s annual performance management process to create development plans that support their particular career objectives, and Abbott provides a broad range of training, mentoring and other development opportunities to help its employees meet these objectives. The board of directors conducts an annual Talent Management Review, focusing on development of talent, diversity, and succession planning for critical positions. Similar reviews take place across Abbott to develop talent and diversity across the organization. \nDiversity and Inclusion \nAbbott is committed to fostering a workplace that is inclusive for all. Abbott ties executive compensation to human capital management to sustain an inclusive culture and the fair and balanced treatment of Abbott’s employees. Abbott's diversity, equity, and inclusion report provides an update on the plans, strategies, and actions undertaken to ensure that Abbott continues to attract, retain, and develop the best talent from the more than 160 countries in which it does business. \nAbbott’s employee networks play an important role in building an inclusive culture across all Abbott operations. A corporate officer serves as a sponsor for each of these networks, helping to align their objectives with Abbott’s business strategies. Abbott has nine such networks, which are: Asian Leadership and Cultural Network, Black Business Network, disABILITY Network (supporting employees with disabilities), Early Career Network (supporting early career employees), LA VOICE Network (supporting Hispanic and Latino employees), PRIDE (supporting LGBTQ employees), Veterans Network, Women Leaders of Abbott, and Women in STEM. All networks are open to all Abbott employees.\nAbbott offers professional development programs, which provide recent college graduates the opportunity to rotate through different areas of Abbott, often with the chance to work outside their home country. Also, Abbott hosts hundreds of college students for paid internships. Further, Abbott has offered a STEM internship program for high school students in the U.S. since 2012 and since 2021, students who complete the program receive a college credit recommendation from the American Council on Education. The program’s objective is to increase the number of students pursuing STEM-related careers and contribute to a more diverse talent pipeline for Abbott. \nHealth and Safety\nThe health, safety and wellness of its employees is an Abbott priority embedded at every level of its business. Abbott’s integrated Environmental, Health and Safety organization governs health, safety and wellness at Abbott’s facilities. Abbott also maintains global policies and standards for managing employee health and safety.\nAbbott takes a holistic approach to employee well-being. Abbott’s global wellness programs are designed to meet the unique needs of employees across businesses and geographies and offer a wide range of programs, including supporting the emotional, physical, and financial health of employees and their families. For example, for over 20 years, Abbott has annually offered Exercise Across Abbott, which is a four-week physical wellness program that encourages employees to team up with colleagues and track how many minutes they exercise each day. Over 40,000 Abbott employees across 75 countries took part in 2024.\nCompensation and Benefits\nAbbott is committed to building, retaining, and motivating a diverse talent pipeline that can meet the current and future needs of its businesses. To that end, Abbott provides market competitive compensation, healthcare benefits, continuing education benefits, pension and/or retirement savings plans, financial support for employees with student loan debt, and several programs to facilitate employees building an ownership stake in Abbott, including a global long-term incentive program for employees generally beginning at the manager level. Abbott also has procedures and processes focused on ensuring employees receive equitable compensation, regardless of race or gender or other personal characteristics.\n5\nTable of Contents\nRegulation\nThe development, manufacture, marketing, sale, promotion, and distribution of Abbott’s products are subject to comprehensive government regulation by the U.S. Food and Drug Administration (FDA) and similar national and international regulatory agencies. Government regulation by various international, supranational, federal and state agencies addresses (among other matters) the development and approval to market Abbott’s products, as well as the inspection of, and controls over, research and laboratory procedures, clinical investigations, product approvals and manufacturing, postmarket changes to products, labeling, packaging, supply chains, marketing and promotion, pricing and reimbursement, sampling, distribution, quality control, post-market surveillance, record keeping, storage, and disposal practices. In addition, Abbott’s laboratories and associated testing services are subject to comprehensive government regulation, including registration, certification, and licensure, by federal, state, and local agencies, such as the Centers for Medicare & Medicaid Services, the Drug Enforcement Administration, the Substance Abuse and Mental Health Services Administration, and their respective foreign counterparts. Certain of these agencies require Abbott's laboratories to meet quality assurance, quality control, and personnel standards and undergo inspections.\nAbbott’s international operations are also affected by trade and investment regulations in many countries. These may require local investment, restrict Abbott’s investments, or limit the import of raw materials and finished products.\nAbbott’s laboratory facilities, home monitoring services, and durable medical equipment suppliers, which provide services, related products and medical devices to consumers, are subject to additional laws and regulations applicable to healthcare providers and suppliers that submit claims for reimbursement or payment to third-party payors, including government agencies such as Medicare and Medicaid, or governments. In the United States, these entities may from time to time conduct inquiries, claims audits, investigations, and enforcement actions relating to the claims or enrollment criteria.\nAbbott is subject to laws and regulations pertaining to healthcare fraud and abuse, including state and federal anti-kickback, anti-self-referral, and false claims laws in the United States. Prescription drug, nutrition, and medical device manufacturers such as Abbott are also subject to taxes, as well as application, product, user, establishment, and other fees. Governmental agencies can also invalidate intellectual property rights.\nCompliance with these laws and regulations is costly and materially affects Abbott’s business. Among other effects, healthcare regulations and significant changes thereto (such as the introduction of the Medical Devices Regulation and the In Vitro Diagnostic Medical Devices Regulation in the European Union) substantially increase the time, difficulty, and costs incurred in developing, obtaining and maintaining approval to market, and marketing newly developed and existing products. Abbott expects this regulatory environment will continue to require significant technical expertise and investment to ensure compliance. Failure to comply can delay the release of a new product or result in regulatory and enforcement actions, the seizure or recall of a product, the suspension or revocation of the authority necessary for a product’s production and sale, suspension or revocation of billing privileges, and other civil or criminal sanctions, including fines and penalties. Similarly, compliance with the laws and regulations governing laboratories and testing services requires specialized expertise. Failure to comply with these regulatory requirements can result in sanctions, including suspension, revocation, or limitation of a laboratory’s certification, which is necessary to conduct business, as well as significant fines or criminal penalties.\nAbbott’s business can also be affected by ongoing studies of the utilization, safety, efficacy, and outcomes of healthcare products and their components that are regularly conducted by industry participants, government agencies, and others. These studies can call into question the utilization, safety, and efficacy of previously marketed products. In some cases, these studies have resulted, and may in the future result, in the discontinuation of marketing of such products in one or more countries, and may give rise to claims for damages from persons who believe they have been injured as a result of their use.\n6\nTable of Contents\nAccess to human healthcare products continues to be a subject of investigation and action by governmental agencies, legislative bodies, and private organizations in many countries. A major focus is cost containment. Efforts to reduce health care costs are also being made in the private sector, notably by healthcare payors and providers, which have instituted various cost reduction and containment measures. Abbott expects that insurers and providers will continue attempts to reduce the cost or utilization of healthcare products. Many countries control the price of healthcare products directly or indirectly, through reimbursement, payment, pricing, or coverage limitations. Budgetary pressures on healthcare payors may also heighten the scope and severity of pricing pressures on Abbott’s products for the foreseeable future. In the United States, the federal government regularly evaluates reimbursement for medical devices, diagnostics, supplies, and other products, as well as the procedures in which these products may be used. The government follows a diagnosis-related group (DRG) payment system for certain institutional services provided under Medicare or Medicaid and has implemented a prospective payment system (PPS) for services delivered in hospital outpatient, nursing home, and home health settings. DRG and PPS entitle a healthcare facility to a fixed reimbursement based on the diagnosis and/or procedure rather than actual costs incurred in patient treatment, thereby increasing the incentive for the facility to limit or control expenditures for many healthcare products. Other payment methodology changes have been proposed and implemented from time to time. For example, Medicare implemented a competitive bidding system for certain durable medical equipment (including diabetes products), enteral nutrition products, and supplies. \nGovernmental cost containment efforts also affect Abbott’s nutritional products business. In the United States, for example, under regulations governing the federally funded Special Supplemental Nutrition Program for Women, Infants, and Children (WIC), all states must have a cost containment program for infant formula. As a result, through competitive bidding states obtain rebates from manufacturers of infant formula whose products are used in the program.\nThe Patient Protection and Affordable Care Act (the Affordable Care Act) includes provisions known as the Physician Payments Sunshine Act, which requires manufacturers of drugs, devices, and medical supplies covered under Medicare and Medicaid to record any transfers of value to physicians and teaching hospitals and to report this data to the Centers for Medicare & Medicaid Services for subsequent public disclosure. Similar reporting requirements have also been enacted at the state level domestically, and an increasing number of governments worldwide either have adopted or are considering similar laws requiring transparency of interactions with healthcare professionals. Failure to report appropriate data may result in civil or criminal fines and/or penalties.\nPolicy changes or implementation of new healthcare legislation could result in significant changes to healthcare systems. In the United States, this could include potential modification, including expansion or repeal of all or parts of the Affordable Care Act.\nThe regulation of data privacy and security, and the protection of the confidentiality of certain personal information (including patient health information, financial information and other sensitive personal information), is increasing. For example, the European Union, China, various other countries, and various U.S. states have enacted or are considering enacting data protection laws that contain significant compliance obligations and financial penalties for noncompliance. In addition, regulators with general consumer protection authority, such as the U.S. Federal Trade Commission and U.S. states Attorneys General, are focused on how consumer data is used by entities in the healthcare industry. Further, there are regulations of data privacy and security that are specific to healthcare companies. For example, the U.S. Department of Health and Human Services has issued rules governing the use, disclosure, and security of protected health information, and the FDA has issued further guidance concerning cybersecurity for medical devices. In addition, certain countries have issued or are considering “data localization” laws, which limit companies’ ability to transfer protected data across country borders. Failure to comply with data privacy and security laws and regulations can result in business disruption and enforcement actions, which could include civil or criminal penalties. Transferring and managing protected information will become more challenging as laws and regulations are enacted or amended, and Abbott expects there will be increasing complexity in this area. \nAbbott expects debate to continue at all government levels worldwide over the manufacture, quality assurance requirements, marketing authorization processes, post-market surveillance requirements, availability, method of delivery, and payment for healthcare products and services, as well as data privacy and security. Abbott believes that future legislation and regulation in the markets it serves could affect the timing and expense associated with bringing healthcare products or services to market, access to healthcare products and services, increase rebates, reduce prices or reimbursements or the rate of price increases for healthcare products and services, change healthcare delivery systems, create new fees and obligations for the pharmaceutical, nutrition, diagnostic, and medical device industries, or require additional reporting and disclosure. It is not possible to predict the extent to which Abbott or the healthcare industry in general might be affected by the matters discussed above.\n7\nTable of Contents\nINTERNET INFORMATION\nCopies of Abbott’s Annual Report on Form 10-K, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K, and amendments to those reports filed or furnished pursuant to Section 13(a) or 15(d) of the Securities Exchange Act of 1934 are available, free of charge, through Abbott’s investor relations website (\nwww.abbottinvestor.com\n) as soon as reasonably practicable after Abbott electronically files the material with, or furnishes it to, the Securities and Exchange Commission (the Commission). These reports and other information are also available, free of charge, at www.sec.gov.\nAbbott’s corporate governance guidelines, outline of directorship qualifications, code of business conduct and the charters of Abbott’s audit committee, compensation committee, nominations and governance committee, and public policy committee are all available on Abbott’s investor relations website (\nwww.abbottinvestor.com\n).\n8\nTable of Contents",
  "item7": "ITEM 7. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nFinancial Review\nAbbott’s revenues are derived primarily from the sale of a broad line of health care products, which include medical devices, diagnostic testing products, nutritional products and branded generic pharmaceuticals. These products are sold under short-term receivable arrangements. Patent protection and licenses, technological and performance features, and inclusion of Abbott’s products under a contract most impact which products are sold; price controls, competition and rebates most impact the net selling prices of products; and the measurement of net sales and costs is impacted by foreign currency translation. Sales in international markets comprise 61 percent of consolidated net sales.\nAbbott’s sales growth in 2024 was primarily driven by the Medical Devices, Established Pharmaceutical and Nutritional businesses. The growth is the result of a productive research and development (R&D) pipeline and a combination of the introduction of new products and indication expansions across various businesses. Sales growth was negatively impacted by continued year-over-year decline in COVID-19 testing-related sales, as the COVID-19 pandemic shifted to an endemic state. In 2024, 2023 and 2022, Abbott’s COVID-19 testing related sales total $747 million, $1.6 billion and $8.4 billion, respectively. Sales in emerging markets, which represent approximately 37 percent of total company sales, increased 8.2 percent in 2024 and 5.4 percent in 2023, excluding the impact of foreign exchange. (Emerging markets include all countries, except the United States, Japan, Canada, Australia, New Zealand, the United Kingdom and Western European countries.) \nAbbott’s operating margin profile increased in 2024 to 16.3 percent from 16.2 percent in 2023. The increase in 2024 reflects the favorable impact of margin improvement initiatives, partially offset by foreign exchange and inflation. In 2022, operating margin as a percentage of sales was 19.2 percent. The decrease in 2023 from 2022 reflects the unfavorable effects of lower COVID-19 testing-related sales, foreign exchange, and higher costs for various manufacturing inputs. In 2023, these unfavorable effects were partially offset by the favorable impact of margin improvement initiatives.  \nWith respect to the performance of each reportable segment over the last three years, sales in the Medical Devices segment, excluding the impact of foreign exchange, increased 13.7 percent in 2024 and 15.1 percent in 2023. In Medical Devices, sales in 2024 and 2023 increased across all businesses, with double-digit growth in Diabetes Care, Structural Heart, Electrophysiology, and Heart Failure. In 2023, Neuromodulation sales also increased double digits. Growth was led by Diabetes Care where sales of Abbott's continuous glucose monitoring (CGM) systems continued to increase and totaled $6.4 billion in 2024 and $5.3 billion in 2023.\nIn 2024, key product approvals in the Medical Devices segment included:\n•\nU.S. Food and Drug Administration (FDA) clearance for two new over-the-counter CGM systems, Lingo\n®\n and Libre Rio™, which are based on Abbott's FreeStyle Libre\n®\n CGM technology,\n•\nFDA approval of the Esprit™ below-the-knee (BTK) system, which is designed to keep arteries open in people living with peripheral artery disease and deliver a drug to support vessel healing prior to completely dissolving, \n•\nFDA approval of TriClip\n®\n, which provides a minimally invasive treatment option for patients with tricuspid regurgitation, or a leaky tricuspid heart valve, \n•\nCE Mark for the Aveir\n®\n dual chamber (DR) leadless pacemaker system, which is the world's first dual chamber leadless pacemaker system that treats people with abnormal or slow heart rhythms, and\n•\nFDA clearance for Advisor\n®\n HD Grid X Mapping Catheter, Sensor Enabled™, which will further support mapping of both pulsed field ablation (PFA) and radiofrequency (RF) ablation cases.\nOperating earnings for the Medical Devices segment increased 16.0 percent in 2024 and 19.6 percent in 2023. The operating margin profile for the Medical Devices segment increased from 30.0 percent in 2022 to 31.4 percent in 2023 and then increased to 32.4 percent in 2024. The increase in 2024 from 2022 reflects the impact of higher sales volumes across the Medical Devices businesses. \nIn Abbott’s Diagnostics segment, sales decreased 3.9 percent in 2024 and 38.2 percent in 2023, excluding the impact of foreign exchange. The 2024 and 2023 sales decreases were driven by continued lower demand for the company's portfolio of COVID-19 tests, partially offset by higher volume of routine diagnostic tests in the Rapid Diagnostics and Core Laboratory businesses and the continued deployment of Abbott's Alinity\n®\n testing platform. Abbott continues to build out its test menu for the Alinity testing platform. In the first quarter of 2024, Abbott received FDA clearance of its i-STAT™ traumatic brain injury (TBI) cartridge for use with the i-STAT Alinity instrument, a whole blood point-of-care test to help assess mild TBI. In the fourth quarter of 2023, Abbott received FDA approval of its new laboratory automation system, GLP systems Track™, to help laboratories optimize lab performance by consolidating multiple analytical instruments into a unified workflow.\n22\nTable of Contents\nIn 2024, operating earnings for the Diagnostics segment decreased 14.8 percent. The operating margin profile decreased from 40.3 percent in 2022 to 22.2 percent in 2024 primarily due to lower demand for Abbott's COVID-19 tests.\nIn Abbott’s Nutritional Products segment, total pediatric nutrition sales, excluding the impact of foreign exchange, increased 3.7 percent in 2024 and 14.8 percent in 2023, which includes market share recovery in the U.S. infant formula business following the voluntary recall of certain products in 2022, as discussed below, and the continued favorable impact of price increase initiatives. Excluding the impact of foreign exchange, total adult nutrition sales increased 8.0 percent in 2024 and 8.8 percent in 2023, led by the continued growth of Abbott's Ensure\n®\n and Glucerna\n®\n products. U.S. Adult Nutritionals sales were partially offset by the discontinuation of the ZonePerfect\n® \nproduct line.\nIn 2024, operating earnings for the Nutritional Products segment increased 12.9 percent compared to 2023. Operating margin profile for this segment increased from 9.5 percent in 2022 to 16.4 percent in 2023 and then increased to 17.9 percent in 2024. The increase in 2024 reflects the favorable effects of higher sales, the favorable impact of price increases and a continued focus on margin improvement initiatives. The increase in 2023 reflects the favorable effects of higher sales and a continued focus on margin improvement initiatives, partially offset by higher commodity and other costs.\nIn February 2022, Abbott’s U.S. Pediatric Nutrition business was impacted by a voluntary recall of certain infant powder formula products manufactured at its facility in Sturgis, Michigan, at which time the company temporarily stopped operations at that facility. Abbott took various actions to mitigate the impact of the recall on the supply of formula in the U.S. Abbott resumed operations later in 2022 and made significant progress through 2023 to increase production of infant formula in the U.S and recover market share. Beginning in the fourth quarter of 2023 and through 2024, Abbott has regained and maintained its market-leading position in the U.S., as measured on a volume basis.\nThe Established Pharmaceutical Products segment focuses on the sale of its products in emerging markets. Excluding the impact of foreign exchange, Established Pharmaceutical sales increased 9.2 percent in 2024 and 10.9 percent in 2023. The sales increase in 2024 was led by higher revenue in several countries in Latin America, Southeast Asia and the Middle East and across several therapeutic areas, including respiratory, gastroenterology, cardiometabolic and central nervous system/pain management. The sales increase in 2023 reflects higher sales in several geographies including India, Vietnam, and Brazil. In 2024, operating earnings for the Established Pharmaceutical Products segment increased 2.2 percent. Operating margin profile increased from 21.4 percent in 2022 to 23.7 percent in 2024 primarily due to the impact of margin improvement initiatives and higher sales, partially offset by inflation on various product inputs.\nWith respect to Abbott’s financial position, at December 31, 2024 and 2023, Abbott’s cash and cash equivalents and short-term investments total approximately $8.0 billion and $7.3 billion, respectively. Abbott’s long-term debt totals $14.1 billion and $14.7 billion at December 31, 2024 and 2023, respectively.\nAbbott declared dividends of \n$2.24\n per share in 2024 and $2.08 per share in 2023, an increase of \n7.7 percent\n. Dividends paid totaled $\n3.8 billion in 2024 \ncompared to $\n3.6 billion\n in 2023. The year-over-year change in the amount of dividends paid reflects the increase in the dividend rate. In December 2024, Abbott increased the company’s quarterly dividend by \n7.3 percent\n to $0.59 per share from $0.55 per share, effective with the dividend paid in February 2025. In December 2023, Abbott increased the company’s quarterly dividend by \n7.8 percent\n to $0.55 per share from $0.51 per share, effective with the dividend paid in February 2024. \nOn September 22, 2023, Abbott completed the acquisition of Bigfoot Biomedical, Inc. (Bigfoot)\n, which furthers \nAbbott's efforts to develop connected solutions for making diabetes management more personal and precise. On April 27, 2023, Abbott completed the acquisition of Cardiovascular Systems, Inc. (CSI). CSI's atherectomy system, which is used in treating peripheral and coronary artery disease, adds complementary technologies to Abbott's portfolio of vascular device offerings.\nIn 2025, Abbott will focus on continuing to invest in product development areas that provide the opportunity for strong sustainable growth over the next several years. In its diagnostics business, Abbott's focus will include driving sales growth from its Alinity suite of diagnostics instruments along with GLP track integration and its portfolio of rapid diagnostic testing systems. In the medical devices business, Abbott will focus on growing recently launched new products and expanding its market position across the various businesses. In its nutritional business, Abbott will continue to focus on driving growth globally and further enhancing its portfolio with the introduction of science-based products and line extensions. In the established pharmaceuticals business, Abbott will continue to focus on growing its business with the depth and breadth of its portfolio in emerging markets.\n23\nTable of Contents\nCritical Accounting Policies\nSales Rebates\n — In 2024, 48 percent of Abbott’s consolidated gross revenues were subject to various forms of rebates and allowances that Abbott recorded as reductions of revenues at the time of sale. Most of these rebates and allowances in 2024 are in the Nutritional Products and Diabetes Care businesses. Abbott provides rebates to state agencies that administer the Special Supplemental Nutrition Program for Women, Infants, and Children (WIC), wholesalers, group purchasing organizations, and other government agencies and private entities. Rebate amounts are usually based upon the volume of purchases using contractual or statutory prices for a product. Factors used in the rebate calculations include the identification of which products have been sold subject to a rebate, which customer or government agency price terms apply, and the estimated lag time between sale and payment of a rebate. Using historical trends, adjusted for current changes, Abbott estimates the amount of the rebate that will be paid, and records the liability as a reduction of gross sales when Abbott records its sale of the product. Settlement of the rebate gener\nally occurs from one to six months after sale. Abbott regularly analyzes the historical rebate trends and makes adjustments to reserves for changes in trends and terms of rebate programs. Rebates and chargebacks charged against gross sales in 2024, 2023, and 2022 amounted to $4.4 billion in 2024 and $3.9 billion in 2023 and 2022, or 18.6 percent, 17.4 percent, and 17.6 percent of gross sales, respectively, based on gross sales of approximately $23.5 billion, $22.7 billion, and $22.4 billion, respectively, subject to rebate. A one-percentage point increase in the percentage of rebates to related gross sales would decrease net sales by approximately $235 million in 2024. Abbott considers a one-percentage point increase to be a reasonably likely increase in the percentage of rebates to related gross sales. Other allowances charged against gross sales were approximately $319 million, $263 million, and $280 million for cash discounts in 2024, 2023, and 2022, respectively, and $211 million, $169 million, and $379 million for returns in 2024, 2023, and 2022, respectively. Cash discounts are known within 15 to 30 days of sale, and therefore can be reliably estimated. Returns can be reliably estimated be\ncause Abbott’s historical returns are low, and because sales returns terms and other sales terms have remained relatively unchanged for several periods.\nManagement analyzes the adequacy of ending rebate accrual balances each quarter. In the domestic nutritional business, management uses both internal and external data available to estimate the accruals. In the WIC business, estimates are required for the amount of WIC sales within each state where Abbott holds the WIC contract. The state where the sale is made, which is the determining factor for the applicable rebated price, is reliably determinable. Rebated prices are based on contractually obligated agreements generally lasting a period of two to four years. Except for a change in contract price or a transition period before or after a change in the supplier for the WIC business in a state, accruals are based on historical redemption rates and data from the U.S. Department of Agriculture (USDA) and the states submitting rebate claims. The USDA, which administers the WIC program, has been making its data available for many years. Management also estimates the states' processing lag time based on sales and claims data. Management has access to several large customers' inventory management data, which allows management to make reliable estimates of inventory in the retail distribution channel. At December 31, 2024, Abbott had WIC business in 42 states.\nHistorically, adjustments to prior years’ rebate accruals have not been material to net earnings. Abbott employs various techniques to verify the accuracy of claims submitted to it, and where possible, works with the organizations submitting claims to gain insight into changes that might affect the rebate amounts. For government agency programs, the calculation of a rebate involves interpretations of relevant regulations, which are subject to challenge or change in interpretation.\nIncome Taxes\n —\n \nAbbott operates in numerous countries where its income tax returns are subject to audits and adjustments. Because Abbott operates globally, the nature of the audit items is often very complex, and the objectives of the government auditors can result in a tax on the same income in more than one country. Abbott employs internal and external tax professionals to minimize audit adjustment amounts where possible. In accordance with the accounting rules relating to the measurement of tax contingencies, in order to recognize an uncertain tax benefit, the taxpayer must be more likely than not of sustaining the position, and the measurement of the benefit is calculated as the largest amount that is more than 50 percent likely to be realized upon resolution of the benefit. Application of these rules requires a significant amount of judgment. In the U.S., Abbott’s federal income tax returns through 2016 were settled as of December 31, 2024. Undistributed foreign earnings remain indefinitely reinvested in foreign operations. Determining the amount of unrecognized deferred tax liability related to any remaining undistributed foreign earnings not subject to the transition tax and additional outside basis difference in its foreign entities is not practicable.\nPension and Post-Employment Benefits\n — Abbott offers pension benefits and post-employment health care to many of its employees. Abbott engages outside actuaries to assist in the determination of the obligations and costs under these programs. Abbott must develop long-term assumptions, the most significant of which are the health care cost trend rates, discount rates and the expected return on plan assets. The discount rates used to measure liabilities were determined based on high-quality fixed income securities that match the duration of the expected retiree benefits. The health care cost trend rates represent Abbott’s expected annual rates of change in the cost of health care benefits and are a forward projection of health care costs as of the measurement date. A difference between the assumed rates and the actual rates, which will not be known for years, can be significant in relation to the obligations and the annual cost recorded for these programs. The \n24\nTable of Contents\nnet actuarial gains for these plans in 2024 reflect the impact of actual asset returns during the year in excess of expected returns and the impact of higher discount rates on the measurement of plan liabilities. At December 31, 2024, pretax net actuarial losses and prior service costs and (credits) recognized in Accumulated other comprehensive income (loss) were net losses of $777 million for Abbott’s defined benefit plans and net losses of $21 million for Abbott’s medical and dental plans. Actuarial losses and gains are amortized over the remaining service attribution periods of the employees under the corridor method, in accordance with the rules for accounting for post-employment benefits. Differences between the expected long-term return on plan assets and the actual annual return are amortized over a five-year period.\nValuation of Intangible Assets \n— Abbott has acquired and continues to acquire significant intangible assets that Abbott records at fair value at the acquisition date. Transactions involving the purchase or sale of intangible assets occur with some frequency between companies in the health care field and valuations are usually based on a discounted cash flow analysis. The discounted cash flow model requires assumptions about the timing and amount of future net cash flows, risk, cost of capital, terminal values and market participants. Each of these factors can significantly affect the value of the intangible asset. Abbott engages independent valuation experts who review Abbott’s critical assumptions and calculations for acquisitions of significant intangibles. Abbott reviews definite-lived intangible assets for impairment each quarter.  An undiscounted net cash flows approach is used to test for impairment. If the undiscounted cash flows of an intangible asset are less than the carrying value of an intangible asset, the intangible asset is written down to its fair value, which is usually the discounted cash flow amount. Where cash flows cannot be identified for an individual asset, the review is applied at the lowest group level for which cash flows are identifiable. Goodwill and indefinite-lived intangible assets, which relate to in-process research and development acquired in a business combination, are reviewed for impairment annually or when an event that could result in an impairment occurs. At December 31, 2024, goodwill amounted to \n$23.1 billion\n and net intangibles amounted to \n$6.6 billion\n. Amortization expense for intangible assets amounted to \n$1.9 billion\n in \n2024 and \n$2.0 billion per year in\n 2023\n and \n2022\n. There was no reduction of goodwill relating to impairments in \n2024\n, \n2023\n, and \n2022\n.\nLitigation \n— Abbott accounts for litigation losses in accordance with Financial Accounting Standards Board (FASB) Accounting Standards Codification (ASC) No. 450, “Contingencies.” Under ASC No. 450, loss contingency provisions are recorded for probable losses at management’s best estimate of a loss, or when a best estimate cannot be made, a minimum loss contingency amount is recorded. These estimates are often initially developed substantially earlier than the ultimate loss is known, and the estimates are refined each accounting period as additional information becomes known. Accordingly, Abbott is often initially unable to develop a best estimate of loss, and therefore the minimum amount, which could be zero, is recorded. As information becomes known, either the minimum loss amount is increased, resulting in additional loss provisions, or a best estimate can be made, also resulting in additional loss provisions. Occasionally, a best estimate amount is changed to a lower amount when events result in an expectation of a more favorable outcome than previously expected. Abbott estimates the range of possible loss to be from approximately $25 million to $35 million for its legal proceedings and environmental exposures. Accruals of approximately $30 million have been recorded at December 31, 2024 for these proceedings and exposures. These accruals represent management’s best estimate of probable loss, as defined by FASB ASC No. 450, “Contingencies.” \n25\nTable of Contents\nResults of Operations\nSales\nThe following table details the components of sales growth by reportable segment for the last two years:\nComponents of % Change\nTotal\n% Change\nPrice\nVolume\nExchange\nTotal Net Sales\n \n \n \n \n2024 vs. 2023\n4.6 \n3.5 \n3.7 \n(2.6)\n2023 vs. 2022\n(8.1)\n2.6 \n(8.7)\n(2.0)\nTotal U.S.\n2024 vs. 2023\n5.6 \n1.9 \n3.7 \n— \n2023 vs. 2022\n(14.8)\n1.1 \n(15.9)\n— \nTotal International\n2024 vs. 2023\n3.9 \n4.6 \n3.5 \n(4.2)\n2023 vs. 2022\n(3.3)\n3.7 \n(3.5)\n(3.5)\nEstablished Pharmaceutical Products Segment\n2024 vs. 2023\n2.5 \n8.2 \n1.0 \n(6.7)\n2023 vs. 2022\n3.1 \n6.0 \n4.9 \n(7.8)\nNutritional Products Segment\n2024 vs. 2023\n3.2 \n7.7 \n(1.7)\n(2.8)\n2023 vs. 2022\n9.3 \n11.4 \n0.2 \n(2.3)\nDiagnostic Products Segment\n2024 vs. 2023\n(6.5)\n1.4 \n(5.3)\n(2.6)\n2023 vs. 2022\n(39.4)\n(0.9)\n(37.3)\n(1.2)\nMedical Devices Segment\n2024 vs. 2023\n12.4 \n1.4 \n12.3 \n(1.3)\n2023 vs. 2022\n14.1 \n1.0 \n14.1 \n(1.0)\nThe increase in total net sales in 2024, excluding the impact of foreign exchange, primarily reflects higher sales in the Medical Devices, Established Pharmaceutical Products and Nutritional Products segments, partially offset by a decrease in demand for Abbott’s rapid diagnostic tests to detect COVID-19. Abbott’s COVID-19 testing-related sales totaled $747 million in 2024, $1.6 billion in 2023 and $8.4 billion in 2022. Excluding the impact of COVID-19 testing-related sales, Abbott’s total net sales increased 7.0 percent in 2024. Excluding the impacts of COVID-19 testing-related sales and foreign exchange, Abbott’s total net sales increased 9.6 percent. Abbott’s net sales in 2024 were unfavorably impacted by changes in foreign exchange rates as the relatively stronger U.S. dollar decreased total international sales by 4.2 percent and total sales by 2.6 percent. \nThe decrease in total net sales in 2023 reflects the decline in demand for Abbott’s rapid diagnostic tests to detect COVID-19, partially offset by higher sales in the Medical Devices, Established Pharmaceutical Products and Nutritional Products segments. Excluding the impact of COVID-19 testing-related sales, Abbott’s total net sales increased 9.2 percent in 2023. Excluding the impacts of COVID-19 testing-related sales and foreign exchange, Abbott’s total net sales increased 11.7 percent. Abbott’s net sales in 2023 were unfavorably impacted by changes in foreign exchange rates as the relatively stronger U.S. dollar decreased total international sales by 3.5 percent and total sales by 2.0 percent.\n \n26\nTable of Contents\nThe table below provides detail by sales category for the years ended December 31. Percent changes are versus the prior year and are based on unrounded numbers.\n2024\n2023\nTotal\nChange \nImpact of \nExchange \nTotal Change \nExcl. Exchange\n(dollars in millions)\nEstablished Pharmaceutical Products—\n \n \n \n \nKey Emerging Markets\n$\n3,858 \n$\n3,807 \n1.3 \n%\n(8.2)\n%\n9.5 \n%\nOther\n1,336 \n1,259 \n6.1 \n(2.3)\n8.4 \nNutritional Products —\nInternational Pediatric Nutritionals\n1,815 \n1,957 \n(7.3)\n(3.0)\n(4.3)\nU.S. Pediatric Nutritionals\n2,208 \n1,977 \n11.7 \n— \n11.7 \nInternational Adult Nutritionals\n2,909 \n2,784 \n4.5 \n(6.0)\n10.5 \nU.S. Adult Nutritionals\n1,481 \n1,436 \n3.2 \n— \n3.2 \nDiagnostic Products —\nCore Laboratory\n5,235 \n5,159 \n1.5 \n(4.1)\n5.6 \nMolecular\n521 \n574 \n(9.2)\n(0.7)\n(8.5)\nPoint of Care\n588 \n565 \n4.1 \n— \n4.1 \nRapid Diagnostics\n2,997 \n3,690 \n(18.8)\n(1.0)\n(17.8)\nMedical Devices —\nRhythm Management\n2,390 \n2,255 \n6.0 \n(0.9)\n6.9 \nElectrophysiology\n2,467 \n2,195 \n12.3 \n(2.1)\n14.4 \nHeart Failure\n1,279 \n1,161 \n10.2 \n(0.1)\n10.3 \nVascular\n2,837 \n2,681 \n5.8 \n(0.9)\n6.7 \nStructural Heart\n2,246 \n1,944 \n15.5 \n(1.5)\n17.0 \nNeuromodulation\n962 \n890 \n8.2 \n(1.3)\n9.5 \nDiabetes Care\n6,805 \n5,761 \n18.1 \n(1.6)\n19.7 \n27\nTable of Contents\n2023\n2022\nTotal\nChange \nImpact of\nExchange \nTotal Change \nExcl. Exchange \n(dollars in millions)\nEstablished Pharmaceutical Products —\n \n \n \nKey Emerging Markets\n$\n3,807 \n$\n3,766 \n1.1 \n%\n(9.2)\n%\n10.3 \n%\nOther\n1,259 \n1,146 \n9.8 \n(3.0)\n12.8 \nNutritional Products —\n \nInternational Pediatric Nutritionals\n1,957 \n1,919 \n2.0 \n(3.2)\n5.2 \nU.S. Pediatric Nutritionals\n1,977 \n1,562 \n26.6 \n— \n26.6 \nInternational Adult Nutritionals\n2,784 \n2,621 \n6.2 \n(4.2)\n10.4 \nU.S. Adult Nutritionals\n1,436 \n1,357 \n5.8 \n— \n5.8 \nDiagnostic Products —\n \nCore Laboratory\n5,159 \n4,888 \n5.5 \n(2.9)\n8.4 \nMolecular\n574 \n995 \n(42.3)\n(0.7)\n(41.6)\nPoint of Care\n565 \n525 \n7.5 \n(0.2)\n7.7 \nRapid Diagnostics\n3,690 \n10,061 \n(63.3)\n(0.4)\n(62.9)\nMedical Devices —\n \nRhythm Management\n2,255 \n2,119 \n6.5 \n(1.0)\n7.5 \nElectrophysiology\n2,195 \n1,927 \n13.9 \n(2.0)\n15.9 \nHeart Failure\n1,161 \n1,035 \n12.1 \n0.1 \n12.0 \nVascular\n2,681 \n2,483 \n8.0 \n(1.3)\n9.3 \nStructural Heart\n1,944 \n1,712 \n13.6 \n(0.7)\n14.3 \nNeuromodulation\n890 \n770 \n15.5 \n(0.9)\n16.4 \nDiabetes Care\n5,761 \n4,756 \n21.1 \n(0.8)\n21.9 \n_______________________________________________________\nNotes:\nThe Acelis Connected Health business was internally transferred from Diagnostic Products to Medical Devices on January 1, 2023. As a result, $115 million of sales in 2022 were moved from Diagnostic Products to Medical Devices.\nIn order to compute results excluding the impact of exchange rates, current year U.S. dollar sales are multiplied or divided, as appropriate, by the current year average foreign exchange rates and then those amounts are multiplied or divided, as appropriate, by the prior year average foreign exchange rates.\nEstablished Pharmaceutical Products sales increased 9.2 percent in 2024 and 10.9 percent in 2023, excluding the unfavorable impact of foreign exchange.\n \nExcluding the effect of foreign exchange, sales in Key Emerging Markets for Established Pharmaceutical Products increased 9.5 percent in 2024 and 10.3 percent in 2023, led by higher revenue in several countries and across several therapeutic areas, including respiratory, gastroenterology, cardiometabolic and central nervous system/pain management. Other Emerging Markets, excluding the effect of foreign exchange, increased by 8.4 percent in 2024\n \nand 12.8 percent in 2023.\n \nExcluding the impact of foreign exchange, total Nutritional Products sales increased 5.9 percent in 2024 and 11.6 percent in 2023. In U.S. Pediatric Nutritional sales, the 11.7 percent increase in 2024 reflects infant formula market share gains and the continued favorable impact of price increases, partially offset by a decrease in PediaSure\n®\n and Pedialyte\n®\n product sales. In 2023, U.S. Pediatric Nutritional sales increased 26.6 percent as a result of market share recovery related to the voluntary recall of certain infant formula products in the first quarter of 2022, partially offset by a decrease in 2023 Pedialyte sales.  \n Excluding the effect of foreign exchange, the 4.3 percent decrease in International Pediatric Nutritional sales in 2024 reflects a decrease in sales in the Asia Pacific and Latin America regions, partially offset by increased sales in Canada and the Europe/Middle East regions. Excluding the effect of foreign exchange, the 5.2 percent increase in International Pediatric Nutritional sales in 2023 reflects higher sales in Latin America and Canada, partially offset by the impact of exiting the pediatric nutrition business in China.   \n28\nTable of Contents\nIn 2024 and 2023, U.S. and International Adult Nutritional sales increased due to higher Ensure\n®\n and Glucerna\n®\n product sales. In 2024 and 2023, U.S. Adult Nutritional sales increased 3.2 percent\n \nand 5.8 percent, respectively, and International Adult Nutritional sales, excluding the effect of foreign exchange, increased 10.5 percent\n \nand 10.4 percent, respectively. In 2024, U.S. Adult Nutritional sales were partially offset by the discontinuation of the ZonePerfect\n®\n product line.\nExcluding the effect of foreign exchange, Diagnostic Products segment sales decreased 3.9 percent in 2024 and 38.2 percent in 2023, driven by lower demand for COVID-19 tests. Rapid Diagnostics sales decreased 17.8 percent in 2024 and 62.9 percent in 2023, excluding the effect of foreign exchange. The decrease reflects lower demand for COVID-19 tests. \nRapid \nDiagnostics COVID-19 testing-related sales\n \nwere $725 million in 2024, $1.5 billion in 2023 and $7.9 billion in 2022. \nRapid Diagnostics sales, excluding COVID-19 testing-related sales, increased 4.8 percent in 2024 and remained unchanged in 2023. In 2024, Rapid Diagnostics sales increased 6.0 percent, excluding the impact of foreign exchange and COVID-19 testing-related sales, due to strong demand for respiratory disease tests used to diagnose influenza, strep throat and RSV. In 2023, Rapid Diagnostics sales increased 1.3 percent, excluding the impact of foreign exchange and COVID-19 testing-related sales. Growth in various Rapid Diagnostics products in 2023 was partially offset by the unfavorable effects of an early 2022 flu season and a later start of the 2023 flu season.\n \n \nIn Core Laboratory, sales increased 5.6 percent in 2024 and 8.4 percent in 2023, excluding the effect of foreign exchange. The increase in 2024 was due to the continued deployment of Abbott's Alinity\n®\n testing platform and higher volume of routine diagnostic testing performed in hospitals and other laboratories along with price increases, partially offset by lower sales in China. The increase in 2023 was due to higher year-over-year volume of routine diagnostic testing performed in hospitals and other laboratories, partially offset by lower test sales for the detection of COVID-19 IgG and IgM antibodies. Core Laboratory COVID-19 testing-related sales on Abbott’s ARCHITECT\n®\n and Alinity i platforms were $10 million in 2024, $20 million in 2023, and $62 million in 2022. Excluding COVID-19 testing-related sales, Core Laboratory sales increased 1.7 percent in 2024 and 6.5 percent in 2023. Excluding the impact of foreign exchange and COVID-19 testing-related sales, Core Laboratory sales increased 5.8 percent in 2024 and 9.4 percent in 2023.\nExcluding the effect of foreign exchange, total Medical Devices sales grew 13.7 percent in 2024 and 15.1 percent in 2023, led by double-digit growth in 2024 in Diabetes Care, Structural Heart, Electrophysiology and Heart Failure\n. \nHigher Diabetes Care sales were driven by continued growth in Abbott’s CGM systems, in the U.S. and internationally. CGM sales totaled $6.4 billion in 2024, which reflected a 21.8 percent increase, excluding the effect of foreign exchange, over 2023 when CGM sales totaled $5.3 billion.\n \n \nProcedure volumes continued to increase across the cardiovascular and neuromodulation businesses in 2024. \nIn Structural Heart, excluding the effect of foreign exchange, the 17.0 percent and 14.3 percent sales increases in 2024 and 2023, respectively, reflect continued growth of the Navitor\n® \nand TriClip\n® \nproducts, as well as growth in surgical valves,  structural interventions and other transcatheter repair sales. \nElectrophysiology sales, excluding the effect of foreign exchange, increased 14.4 percent in 2024 and 15.9 percent in 2023 which primarily reflects higher procedure volumes and increased demand for catheters and cardiac mapping products across all regions.\nIn Heart Failure, the 10.3 percent increase in sales in 2024, excluding the effect of foreign exchange, primarily reflects growth in heart assist devices, which offer treatment for chronic and temporary conditions. In 2023, Heart Failure sales increased 12.0 percent, excluding the effect of foreign exchange, as procedure volumes and staffing challenges, which occurred during the COVID-19 pandemic, began to recover.\n \nIn Rhythm Management, the 6.9 percent increase in 2024, excluding the impact of foreign exchange, was primarily due to growth in Aveir\n®\n leadless pacemaker and ASSERT-IQ\n®\n implantable cardiac monitor sales. In 2023, the 7.5 percent increase, excluding the impact of foreign exchange, was due to growth across the portfolio of low and high voltage pacemakers, led by the Aveir leadless pacemaker that launched in 2022. \nIn Vascular, the 6.7 percent\n \nincrease in 2024, excluding the impact of foreign exchange, was primarily due to higher vessel closure sales. In 2023, the 9.3 percent increase, excluding the impact of foreign exchange, was primarily due to the acquisition of CSI in April 2023. \nAbbott’s operations in Russia and Ukraine represent approximately 2 percent of Abbott’s total revenues and net assets, and to date the financial impact of Russia’s invasion of Ukraine has not been material to Abbott’s operations or financial condition. Future implications are difficult to predict, but at present Abbott does not anticipate that the Russia-Ukraine conflict will have a material impact on its operations or financial condition. A more detailed discussion of the risks associated with the Russia-Ukraine conflict is contained in Item 1A. Risk Factors.\n29\nTable of Contents\nThe expiration of licenses and patent protection can affect the future revenues and operating income of Abbott. There are no significant patent or license expirations in the next three years that are expected to materially affect Abbott.\nOperating Earnings\nGross profit margins were \n50.9 percent\n of net sa\nles in 2024, 50.3 percent of net sales in 2023, \nand \n51.5 percent\n of net sales in 2022. The increase in 2024 reflects the favorable impacts of margin improvement initiatives, partially offset by the unfavorable effect of foreign exchange. The decrease in 2023 reflects the unfavorable effects of lower sales of COVID-19 tests, foreign exchange, and higher costs for various manufacturing inputs, partially offset by the nonrecurrence of the negative impact in 2022 of the voluntary product recall in the nutritional business and the impact in 2023 of margin improvement initiatives.  \nResearch and development (R&D) expenses were $2.8 billion in 2024, $2.7 billion in 2023, and $2.9 billion in 2022. The increase in R&D expense in 2024 was primarily driven by higher spending on various projects, partially offset by lower 2024 charges for the impairment of in-process R&D (IPR&D) assets acquired in previous business combinations. In 2023, the decrease in R&D expense was primarily driven by lower restructuring charges, lower impairment charges related to IPR&D acquired in previous business combinations, and other cost reductions. \nSelling, general and administrative (SG&A) expenses were $11.7 billion in \n2024, \n$10.9 billion\n in \n2023\n and \n$11.2 billion\n in \n2022\n. In 2024, higher selling and marketing spending to drive growth across various businesses was partially offset by the favorable impact of foreign exchange. \nThe 2023 decrease in SG&A expenses reflects the favorable impact of foreign exchange and lower restructuring charges in 2023, as well as the non-recurrence of 2022 expenses related to the voluntary product recall in the Nutritional Products segment.  \nRestructurings\nIn 2024, Abbott management approved plans to streamline certain operations in order to reduce costs and improve efficiencies in its Diagnostic, Medical Devices, Established Pharmaceutical and Nutritional businesses, including the discontinuation of its ZonePerfect\n®\n product line. Abbott recorded employee related severance and other charges of\n \n$129 million\n, of which \n$62 million\n was recorded in Cost of products sold, \n$21 million \nwas recorded in Research and development, and \n$46 million \nwas recorded in Selling, general and administrative expenses. Payments related to these actions totaled $\n32 million in\n 2024 and the remaining liability totaled $\n97 million \nat December 31, 2024. In addition, Abbott recognized inventory related charges of \n$34 million\n and fixed asset impairment charges of \n$12 million \nrelated to these restructuring plans.\nIn 2023, Abbott management approved plans to restructure various operations in order to reduce costs in its Medical Devices, Diagnostic, and Established Pharmaceutical businesses. Abbott recorded employee related severance and other charges of $144 million of which approximately $56 million was recorded in Cost of products sold, $22 million was recorded in Research and development and $66 million was recorded in Selling, general and administrative expenses. In addition, Abbott recognized fixed asset impairment and inventory related charges of $31 million related to these restructuring plans.\nIn 2022, Abbott management approved plans to streamline operations in order to reduce costs and improve efficiencies in its Medical Devices, Nutritional, Diagnostic, and Established Pharmaceutical businesses. Abbott recorded employee related severance and other charges of $234 million of which $59 million was recorded in Cost of products sold, $36 million was recorded in Research and development and $139 million was recorded in Selling, general and administrative expenses. In addition, Abbott recognized inventory related charges of $23 million and fixed asset impairment charges of $4 million related to these restructuring plans. \n30\nTable of Contents\nInterest Expense and Interest (Income)\nInterest expense, net decreased from $252 million in 2023 to $215 million in \n2024.\n Interest expense decreased in 2024 due to the repayment of approximately $2.25 billion of long-term debt in September and November of 2023, partially offset by a reduction in interest income due to lower average cash and short-term investment balances versus the prior year. Interest expense, net decreased $123 million in 2023 due t\no\n the favorable impact of higher interest rates on interest income, partially offset by the negative impact of interest rate hedge contracts related to certain fixed-rate debt.\nOther (Income) Expense, net\nOther income, net was $376 million of income in 2024,  $479 million\n \nof income in 2023 and $321 million of income in 2022. Other income, net includes income of approximat\nely $542 million, $498 million, and $406 million in 2024, 2023, and 2022, respectively, related to the non-service cost components of the net periodic benefit costs associated with the pension and post-retirement medical plans. \nThe decrease in 2024 reflects the recognition of a $143 million loss on the sale of a non-core business related to the Established Pharmaceutical Products segment. The decrease in 2024 was partially offset by an increase in income associated with the non-service cost components of net pension and post-retirement medical benefit costs. In 2023, \nOther income, net included \nequity investment impairments that totaled approximately $39 million, as well as income from a $42 million reduction in the fair value of contingent consideration related to previous business acquisitions. \nTaxes on Earnings\nTaxes on earnings reflect the annual effective rates, including charges for interest and penalties. Deferred income taxes reflect the tax consequences on future years of differences between the tax bases of assets and liabilities and their financial reporting amounts.\nTaxes on earnings include approximately $50 million, $22 million and $43 million in excess tax benefits associated with share-based compensation in 2024, 2023 and 2022, respectively. As a result of the resolution of various tax positions related to prior years, taxes on earnings in 2024, 2023 and 2022 also include approximately $25 million, $80 million and $20 million of net tax expense, respectively. In the fourth quarter of 2024, taxes on earnings includes $7.5 billion in non-cash valuation allowance adjustments resulting from the restructuring of certain foreign affiliates and the confirmation of certain tax filing positions. The restructuring improved profitability to several of Abbott’s affiliates and management concluded that the related preexisting deferred tax assets, which historically had a full valuation allowance, were more likely than not to be realizable in future periods. In particular, Abbott considered the likelihood of sustained ongoing profitability of the affiliates as a positive factor that outweighed all available negative evidence considered. Accordingly, Abbott released the full valuation allowance on such deferred tax assets and recorded the offset to tax expense.\nThe U.S. Tax Cuts and Jobs Act (TCJA) includes a one-time transition tax that is based on Abbott’s total post-1986 earnings and profits (E&P) that were previously deferred from U.S. income taxes. The tax computation also requires the determination of the amount of post-1986 E&P considered held in cash and other specified assets. As of December 31, 2024, the remaining balance of Abbott’s transition tax obligation related to the TCJA is approximately $432 million, which will be paid over the next two years as allowed by the TCJA. Undistributed foreign earnings remain indefinitely reinvested in foreign operations. Determining the amount of unrecognized deferred tax liability related to any remaining undistributed foreign earnings not subject to the transition tax and additional outside basis difference in its foreign entities is not practicable.\nIn the U.S., Abbott’s federal income tax returns through 2016 are settled. In September 2023, Abbott received a Statutory Notice of Deficiency (SNOD) from the U.S. Internal Revenue Service (IRS) for the 2019 Federal tax year in the amount of $417 million. The primary adjustments proposed in the SNOD relate to the reallocation of income between Abbott’s U.S. entities and its foreign affiliates. Abbott believes that the income reallocation adjustments proposed in the SNOD are without merit, in part because certain adjustments contradict methods that were agreed to with the IRS in prior audit periods. The SNOD also contains other proposed adjustments that Abbott believes are erroneous and unsupported. Abbott filed a petition with the U.S. Tax Court contesting the SNOD in December 2023.\nIn June 2024, Abbott received a SNOD from the IRS for the 2017 and 2018 Federal tax years in the amount of $192 million. The matters proposed in the 2017/2018 SNOD are substantially similar to the income allocation adjustments included in the 2019 SNOD. Abbott filed a petition in September 2024 with the U.S. Tax Court contesting the 2017/2018 SNOD in a manner consistent with its petition for the 2019 SNOD.\n31\nTable of Contents\nIn October 2024, Abbott received a SNOD from the IRS for the 2020 Federal tax year assessing an additional $443 million of income tax. The primary adjustments proposed in the SNOD are substantially similar to the income allocation adjustments included in the 2017/2018 and 2019 SNODs. Abbott believes that the income reallocation adjustments proposed in the SNOD are without merit. The SNOD also contains other proposed adjustments and omissions that Abbott believes are erroneous and unsupported. In addition to the tax assessment for the 2020 tax year, the 2020 SNOD also contested a deduction for which an estimated $440 million cash tax benefit would be available in a different taxable year as allowed under applicable U.S. tax law. Abbott filed a petition with the U.S. Tax Court contesting the SNOD in December 2024.\nAbbott intends to vigorously defend its filing positions through ongoing discussions with the IRS, the IRS independent appeals process and/or through litigation as necessary. Abbott reserves for uncertain tax positions related to unresolved matters with the IRS and other taxing authorities. Abbott continues to believe that its reserves for uncertain tax positions are appropriate.\nThere are numerous other income tax jurisdictions for which tax returns are not yet settled, none of which Abbott expects to be individually significant. Reserves for interest and penalties are not significant.\nThe Organization for Economic Cooperation & Development (OECD) has proposed a two-pillared plan for a revised international tax system. Pillar 1 proposes to reallocate taxing rights among the jurisdictions in which in-scope multinational corporations operate. Abbott is continuing to analyze the Pillar 1 proposal. Pillar 2 proposes to assess a 15 percent minimum tax on the earnings of in-scope multinational corporations on a country-by-country basis. Numerous countries have enacted legislation to adopt the Pillar 2 model rules. The enactment of current Pillar 2 model rules did not and is not projected to have a material impact to Abbott's consolidated financial statements.\n See Note 15 — Taxes on Earnings\n \nto the consolidated financial statements for a full reconciliation of the effective tax rate to the U.S. federal statutory rate.\nResearch and Development Programs\nAbbott currently has numerous pharmaceutical, medical device, diagnostic and nutritional products in development.\nResearch and Development Process\nIn the Established Pharmaceutical Products segment, the development process focuses on the geographic expansion and continuous improvement of the segment’s existing products to provide benefits to patients and customers. As Established Pharmaceutical Products does not actively pursue primary research, development usually begins with work on existing products or after the completion of an acquisition or licensing agreement.\nDepending upon the product, the phases of development may include:\n•\nDrug product development.\n•\nPhase I bioequivalence studies to compare a future Established Pharmaceutical’s brand with an already marketed compound with the same active pharmaceutical ingredient (API).\n•\nPhase II studies to test the efficacy of benefits in a small group of patients.\n•\nPhase III studies to broaden the testing to a wider population that reflects the actual medical use.\n•\nPhase IV and other post-marketing studies to obtain new clinical use data on existing products within approved indications.\nThe specific requirements (e.g., scope of clinical trials) for obtaining regulatory approval vary across different countries and geographic regions. The process may range from one year for a bioequivalence study project to six or more years for complex formulations, new indications, or geographic expansion in specific countries.\nIn the Diagnostic Products segment, the phases of the research and development process include:\n•\nDiscovery, which focuses on identification of a product that will address a specific therapeutic area, platform, or unmet clinical need.\n•\nConcept/Feasibility, during which the materials and manufacturing processes are evaluated; testing may include product characterization and analysis is performed to confirm clinical utility.\n•\nDevelopment, during which extensive testing is performed to demonstrate that the product meets specified design requirements and that the design specifications conform to user needs and intended uses.\n32\nTable of Contents\nThe regulatory requirements for diagnostic products vary across different countries and geographic regions. In the U.S., the FDA classifies diagnostic products into classes (I, II, or III) and the classification determines the regulatory process for approval. While the Diagnostics segment has products in all three classes, the vast majority of its products are categorized as Class I or Class II. Submission of a separate regulatory filing is not required for Class I products. Class II products typically require premarket notification to the FDA through a regulatory filing known as a 510(k) submission. Most Class III products are subject to the FDA’s Premarket Approval (PMA) requirements. Other Class III products, such as those used to screen blood, require the submission and approval of a Biological License Application (BLA).\nIn the European Union (EU), diagnostic products are also categorized into different categories and the regulatory process, which had been governed by the European In Vitro Diagnostic Medical Device Directive, depends upon the category. Certain product categories requiring review and approval by an independent company, known as a Notified Body, before the manufacturer can affix a CE mark to the product to declare conformity to the Directive. Other products only require a self-certification process. In 2017, the EU adopted the new In Vitro Diagnostic Regulation (IVDR) which replaced the existing directive in the EU for in vitro diagnostic products and imposed additional premarket and post-market regulatory requirements on manufacturers of such products. In July 2024, the IVDR was amended to extend the transition timeline period for dates of compliance as long as December 2029, depending on the diagnostic device classification.\n \nThe diagnostic device must meet additional specific conditions set out in the amended regulations. However, the amendment did not delay the date of application of the IVDR itself which took effect on May 26, 2022.\nIn the Medical Devices segment, the research and development process begins with research on a specific technology that is evaluated for feasibility and commercial viability. If the research program passes that hurdle, it moves forward into development. The development process includes evaluation, selection and qualification of a product design, completion of applicable clinical trials to test the product’s safety and efficacy, and validation of the manufacturing process to demonstrate its repeatability and ability to consistently meet pre-determined specifications.\nSimilar to the diagnostic products discussed above, in the U.S., medical devices are classified as Class I, II, or III. Most of Abbott’s medical device products are classified as Class II devices that follow the 510(k) regulatory process or Class III devices that are subject to the PMA process.\nIn the EU, medical devices are also categorized into different classes and the regulatory process, which had been governed by the European Medical Device Directive and the Active Implantable Medical Device Directive, varies by class. In the second quarter of 2017, the EU adopted the new Medical Devices Regulation (MDR) which replaced the existing directives in the EU for medical devices and imposes additional premarket and post-market regulatory requirements on manufacturers of such products. The MDR applies to manufacturers as of May 26, 2021 with extended transition periods lasting as long as December 31, 2028 depending on the risk classification of the device in the regulation. Each product must bear a CE mark to show compliance with the MDR.\nSome products require submission of a design dossier to the appropriate regulatory authority for review and approval prior to CE marking of the device. For other products, the company is required to prepare a technical file which includes testing results and clinical evaluations but can self-certify its ability to apply the CE mark to the product. Outside the U.S. and the EU, the regulatory requirements vary across different countries and regions.\nAfter approval and commercial launch of some medical devices, post-market trials may be conducted either due to a conditional requirement of the regulatory market approval or with the objective of proving product superiority.\nIn the Nutritional Products segment, the research and development process generally focuses on identifying and developing ingredients and products that address the nutritional needs of particular populations (e.g., infants and adults) or patients (e.g., people with diabetes). Depending upon the country and/or region, if claims regarding a product’s efficacy will be made, clinical studies typically must be conducted.\nIn the U.S., the FDA requires that it be notified of proposed new formulations and formulation or packaging changes related to infant formula products. Prior to the launch of an infant formula or product packaging change, the company is required to obtain the FDA’s confirmation that it has no objections to the proposed product or packaging. For other nutritional products, notification or pre-approval from the FDA is not required unless the product includes a new food additive. In some countries, regulatory approval may be required for certain nutritional products, including infant formula and medical nutritional products.\nAreas of Focus\nIn 2025 and beyond, Abbott expects to focus on the following areas:\nEstablished Pharmaceuticals — Abbott focuses on building country-specific portfolios made up of high-quality medicines that meet the needs of people in emerging markets. Over the next several years, Abbott plans to expand its \n33\nTable of Contents\nproduct portfolio in key therapeutic areas and biosimilars with the aim of addressing the health needs of more people in emerging markets and being among the first to launch new off-patent and differentiated medicines. In addition, Abbott continues to expand existing brands into new markets, implement product enhancements that provide value to patients and acquire strategic products and technology through licensing activities. Abbott is also actively working on the further development of several key brands such as Creon™, Duphaston™, Femoston™ and Influvac™. Depending on the product, the activities focus on development of new data, markets, formulations, delivery systems, or indications.\nMedical Devices — Abbott’s research and development programs focus on:\n•\nCardiac Rhythm Management – Development of next-generation rhythm management technologies, including advanced communication capabilities and leadless pacing therapies.\n•\nHeart Failure – Continued enhancements to Abbott’s mechanical circulatory support and pulmonary artery pressure systems, including enhanced clinical performance and usability.\n•\nElectrophysiology – Development of next-generation technologies in the areas of ablation, diagnostic, mapping, and visualization and recording.\n•\nVascular – Development of next-generation technologies for use in coronary and peripheral vascular procedures.\n•\nStructural Heart – Development of transcatheter and surgical devices for the repair and replacement of heart valves, and occlusion therapies for congenital heart defects and stroke-risk reduction.\n•\nNeuromodulation – Development of clinical evidence and next-generation technologies leveraging digital health to support improved patient clinical outcomes, physician engagement, and expanded indications in the treatment of chronic pain, movement disorders and other indications.\n•\nDiabetes Care – Develop enhancements and additional indications for continuous monitoring products to help patients improve their ability to manage diabetes and for use beyond diabetes. \nNutritionals — Abbott is focusing its research and development spend on platforms that span the pediatric and adult nutrition areas: gastrointestinal/immunity health, brain health, mobility and metabolism, and user experience platforms. Numerous new products that build on advances in these platforms are currently under development, including clinical outcome testing, and are expected to be launched over the coming years.\nCore Laboratory Diagnostics — Abbott continues to commercialize its next-generation blood and plasma screening, immunoassay, clinical chemistry and hematology systems, along with assays, including a focus on unmet medical needs, in various areas including infectious disease, cardiac care, metabolics, oncology, and neurologic assays as well as informatics solutions to help optimize diagnostics laboratory performance and automation solutions to increase efficiency in laboratories.\nRapid Diagnostics — Abbott’s research and development programs focus on the development of diagnostic products for infectious disease, cardiometabolic disease and toxicology.\nIn addition, the Diagnostic Products segment continues to pursue the FDA’s customary regulatory process for remaining COVID-19 tests for which Emergency Use Authorizations (EUAs) were obtained and yet to be cleared. \nGiven the diversity of Abbott’s business, its intention to remain a broad-based health care company and the numerous sources for potential future growth, no individual project is expected to be material to cash flows or results of operations over the next five years. Factors considered included research and development expenses projected to be incurred for the project over the next year relative to Abbott’s total research and development expenses, as well as qualitative factors, such as marketplace perceptions and impact of a new product on Abbott’s overall market position. There were no delays in Abbott’s 2024 research and development activities that are expected to have a material impact on operations.\nWhile the aggregate cost to complete the numerous projects currently in development is expected to be material, the total cost to complete will depend upon Abbott’s ability to successfully finish each project, the rate at which each project advances, and the ultimate timing for completion. Given the potential for significant delays and the risk of failure inherent in the development of new products and technologies, it is not possible to accurately estimate the total cost to complete all projects currently in development. Abbott plans to manage its portfolio of projects to achieve research and development spending that will be competitive in each of the businesses in which it participates, and such spending is targeted at approximately 7 percent of total Abbott sales in 2025. Abbott does not regularly accumulate or make management decisions based on the total expenses incurred for a particular development phase in a given period.\n34\nTable of Contents\nGoodwill\nAt December 31, 2024, goodwill recorded as a result of business combinations totaled $23.1 billion. Goodwill is reviewed for impairment annually in the third quarter or when an event that could result in an impairment occurs, using a quantitative assessment to determine whether it is more likely than not that the fair value of any reporting unit is less than its carrying amount. The income and market approaches are used to calculate the fair value of each reporting unit. The results of the last impairment test indicated that the fair value of each reporting unit was substantially in excess of its carrying value.\nFinancial Condition\nCash Flow \nNet cash from operating activities amounted to $8.6 billion, $7.3 billion, and $9.6 billion in 2024, 2023, and 2022, respectively. The increase in Net cash from operating activities in 2024 as compared to 2023 is primarily due to higher segment operating earnings and improved working capital management, partially offset by higher cash payments for income taxes. The decrease in Net cash from operating activities in 2023 compared to 2022 was primarily due to the decline in operating earnings and increased payments related to accounts payable and accrued liabilities, partially offset by lower expenditures for inventory and lower cash payments for income taxes due to lower\n \nearnings.\nA substantial portion of Abbott’s cash and cash equivalents at December 31, 2024, is held by Abbott affiliates outside of the U.S. If these funds were needed for operations in the U.S., Abbott does not expect to incur significant additional income taxes in the future to repatriate these funds.\nAbbott funded $349 million in 2024 and 2023, and $413 million in 2022 to defined benefit pension plans. Abbott expects pension funding of approximately $302 million in 2025 for its pension plans. Abbott expects annual cash flow from operating activities to continue to exceed Abbott’s capital expenditures and cash dividends.\nDebt and Capital \nAt December 31, 2024, Abbott’s long-term debt rating was AA- by S&P Global Ratings and Aa3 by Moody’s Investors Service. Abbott expects to maintain an investment grade rating.\nAbbott has readily available financial resources, including unused lines of credit that support commercial paper borrowing arrangements and provide Abbott with the ability to borrow up to $5 billion on an unsecured basis. On January 29, 2024, Abbott terminated its 2020 Five Year Credit Agreement (2020 Agreement) and entered into a new Five Year Credit Agreement (Revolving Credit Agreement). There were no outstanding borrowings under the 2020 Agreement at the time of its termination. Any borrowings under the Revolving Credit Agreement will mature and be payable on January 29, 2029 and will bear interest, at Abbott’s option, based on either a base rate or Secured Overnight Financing Rate (SOFR), plus an applicable margin based on Abbott’s credit ratings. \nAs of December 31, 2024, Abbott's total debt outstanding was $14.1 billion, of which approximately $1.5 billion will mature in 2025. On June 26, 2024, Abbott modified its existing, yen-denominated 5-year term loan scheduled to mature in November 2024. The amended terms include a net increase in principal debt from ¥59.8 billion to ¥92.0 billion, with a new maturity date in June 2029. The modified, 5-year term loan bears interest at the Tokyo Interbank Offered Rate (TIBOR) plus a fixed spread, and the interest rate is reset quarterly. The net proceeds equated to approximately $201 million. The ¥92.0 billion loan is designated as a hedge of Abbott’s net investment in certain foreign subsidiaries.\nOn November 19, 2024, Abbott repaid the €590 million outstanding principal amount of its 0.10% Notes upon maturity. The repayment equated to approximately $640 million. On November 30, 2023, Abbott repaid the $1.05 billion outstanding principal amount of its 3.40% Notes upon maturity. On September 27, 2023, Abbott repaid the €1.14 billion outstanding principal amount of its 0.875% Notes upon maturity. The repayment equated to approximately $1.2 billion. In September 2023, Abbott repaid approximately $197 million of debt assumed as part of a recent business acquisition.\nOn October 11, 2024, the board of directors authorized the repurchase of up to $7 billion of Abbott common shares, from time to time (the \"2024 repurchase program\"). The 2024 repurchase program is in addition to the unused portion of the 2021 repurchase program, which the board of directors approved in December 2021 and authorized the repurchase of up to $5 billion of Abbott’s common shares from time to time. As of December 31, 2024, $293 million remains available for repurchase under the 2021 repurchase program. In 2024 and 2023, Abbott repurchased approximately 10.2 million and 9.8 million, respectively, of its common shares for $1.1 billion and $1.0 billion, respectively, under the 2021 repurchase program. In 2022, Abbott repurchased 32.3 million of its common shares for $3.7 billion which fully utilized the authorization remaining under the October 2019 share repurchase program, and a portion of the 2021 repurchase program. \n35\nTable of Contents\nAbbott declared dividends of $2.24 per share in 2024 compared to $2.08 per share in 2023, an increase of 7.7 percent. Dividends paid were $3.8 billion in 2024 compared to $3.6 billion in 2023. The year-over-year change in dividends paid reflects the impact of the increase in the dividend rate.\nWorking Capital\nWorking capital was $9.5 billion at December 31, 2024 and $8.8 billion at December 31, 2023. The increase in working capital in 2024 primarily reflects an increase in cash and cash equivalents and accounts receivable, partially offset by an increase in the current portion of long-term debt. The increase in cash and cash equivalents from $6.9 billion at December 31, 2023 to $7.6 billion at December 31, 2024 primarily reflects the cash generated from operations and an increase in Abbott's yen-denominated loan, partially offset by the payment of dividends and capital expenditures.\n Abbott monitors the credit worthiness of customers and establishes an allowance that reflects the current estimate of credit losses expected to be incurred over the life of the financial asset. Abbott considers various factors in establishing, monitoring, and adjusting its allowance for doubtful accounts, including the aging of the accounts and aging trends, the historical level of charge-offs, and specific exposures related to particular customers. Abbott also monitors other risk factors and forward-looking information, such as country risk, when determining credit limits for customers and establishing adequate allowances.\nCapital Expenditures\nCapital expenditures of $2.2 billion in 2024 and 2023, and $1.8 billion in 2022 were principally for upgrading and expanding manufacturing and research and development facilities and equipment in various segments, investments in information technology, and laboratory instruments placed with customers. \nContractual Obligations \nAbbott believes that its available cash and cash equivalents along with its ability to generate operating cash flow and continued access to debt markets are sufficient to fund existing and planned cash requirements. Abbott's material cash requirements include the following contractual obligations:\nDebt\n — Principal payments required on long-term debt outstanding at December 31, 2024 are $1.5 billion in 2025, $2.9 billion in 2026, $617 million in 2027, $650 million in 2028, $583 million in 2029 and $8.0 billion in 2030 and thereafter. Interest payments required on long-term debt outstanding at December 31, 2024 are projected to be $512 million in 2025, $478 million in 2026, $396 million in 2027, $390 million in 2028, $384 million in 2029 and $4.7 billion in 2030 and thereafter.\nOperating leases\n — As of December 31, 2024, estimated contractual obligations for operating lease payments were $1.3 billion, with $290 million due within 12 months.\nIn addition, Abbott enters into purchase commitments in the normal course of business to meet operational and capital expenditure requirements. The majority of outstanding purchase commitments generally do not extend past one year.\nContingent Obligations\nAbbott periodically acquires a business or product rights in which Abbott agrees to pay contingent consideration based on attaining certain thresholds or based on the occurrence of certain events.\nBusiness Acquisitions\nOn September 22, 2023, Abbott completed the acquisition of Bigfoot, which furthers Abbott's efforts to develop connected solutions for making diabetes management more personal and precise. The purchase price, the final allocation of acquired assets and liabilities, and the revenue and net income contributed by Bigfoot since the date of acquisition are not material to Abbott's consolidated financial statements.\n \n \nOn April 27, 2023, Abbott completed the acquisition of CSI for $20 per common share, which equated to a purchase price of \n$851 million\n. The transaction was funded with cash on hand and accounted for as a business combination. CSI's atherectomy system, which is used in treating peripheral and coronary artery disease, adds complementary technologies to Abbott's portfolio of vascular device offerings.\n \n36\nTable of Contents\nThe final allocation of the purchase price of the CSI acquisition resulted in the recording of two non-deductible developed technology intangible assets totaling $305 million; a non-deductible in-process research and development asset of $15 million, which will be accounted for as an indefinite-lived intangible asset until regulatory approval or discontinuation; non-deductible goodwill of $369 million; net deferred tax assets of $46 million and other net assets of $116 million. The goodwill is identifiable to the Medical Devices reportable segment and is attributable to expected synergies from combining operations, as well as intangible assets that do not qualify for separate recognition. Revenues and earnings of CSI included in Abbott's consolidated financial statements since the acquisition date are not material to Abbott's consolidated revenue and earnings.\nLegislative Issues\nAbbott’s primary markets are highly competitive and subject to substantial government regulations throughout the world. Abbott expects debate to continue at all government levels worldwide over the manufacture, quality assurance requirements, marketing authorization processes, post-market surveillance requirements, availability, method of delivery, and payment for health care products and services, as well as data privacy and security. It is not possible to predict the extent to which Abbott or the health care industry in general might be adversely affected by these factors in the future. A more complete discussion of these factors is contained in Item 1, Business, and Item 1A, Risk Factors.\nRecently Issued Accounting Standards\nRecently Adopted Accounting Standards\nIn November 2023, the FASB issued ASU 2023-07, \nSegment Reporting (Topic 280): Improvements to Reportable Segment Disclosures\n, which expands the breadth and frequency of required segment disclosures. The guidance is required to be applied retrospectively to all periods presented in the financial statements. Abbott adopted the standard on January 1, 2024. The new standard did not have an impact on Abbott's consolidated financial statements, but required additional disclosures as included in Note 16 — Segment and Geographic Area Information.\nIn September 2022, the FASB issued Accounting Standards Update (ASU) 2022-04, \nDisclosure of Supplier Finance Program Obligations\n, which requires an entity to report information about its supplier finance program. Abbott adopted the standard on January 1, 2023. The new standard did not have an impact on Abbott's consolidated financial statements.\nRecent Accounting Standards Not Yet Adopted\nIn November 2024, the FASB issued ASU 2024-03, \nIncome Statement (Subtopic 220-40): Reporting Comprehensive Income - Expense Disaggregation Disclosures\n, which requires an entity to disclose on an annual and interim basis, disaggregated information about specific income statement expense categories. The guidance should be applied prospectively with the option to apply the standard retrospectively. The standard becomes effective for Abbott for full year 2027 reporting. Abbott is currently evaluating the impact of this new standard on its consolidated financial statements.\nIn December 2023, the FASB issued ASU 2023-09, \nIncome Taxes (Topic 740): Improvements to Income Tax Disclosures\n, which requires an entity to disclose annually additional information related to the company's income tax rate reconciliation and income taxes paid during the period. The guidance should be applied prospectively with the option to apply the standard retrospectively. The standard becomes effective for Abbott for full year 2025 reporting. Abbott is currently evaluating the impact of this new standard on its consolidated financial statements.\nPrivate Securities Litigation Reform Act of 1995 — A Caution Concerning Forward-Looking Statements\nUnder the safe harbor provisions of the Private Securities Litigation Reform Act of 1995, Abbott cautions investors that any forward-looking statements or projections made by Abbott, including those made in this document, are subject to risks and uncertainties that may cause actual results to differ materially from those projected. Economic, competitive, governmental, technological and other factors that may affect Abbott’s operations are discussed in Item 1A, Risk Factors.\n37\nTable of Contents",
  "item2": null
}