{
  "source_file": "abt-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2.    Management’s Discussion and Analysis of Financial Condition and Results of Operations\nFinancial Review — Results of Operations\nAbbott’s revenues are derived primarily from the sale of a broad line of healthcare products under short-term receivable arrangements. Patent protection and licenses, technological and performance features, and inclusion of Abbott’s products under a contract most impact which products are sold; price controls, competition, and rebates most impact the net selling prices of products; and foreign currency translation impacts the measurement of net sales and costs. Abbott’s primary products are medical devices, diagnostic testing products, nutritional products, and branded generic pharmaceuticals.\nThe following tables detail sales by reportable segment for the three and nine months ended September 30. Percent changes are versus the prior year and are based on unrounded numbers.\nNet Sales to External Customers\n(in millions)\nThree Months Ended\nSeptember 30, 2025\nThree Months Ended\nSeptember 30, 2024\nTotal Change\nImpact of Foreign Exchange\nTotal Change Excl. Foreign Exchange\nEstablished Pharmaceutical Products\n$\n1,511 \n$\n1,406 \n7.5 \n%\n0.4 \n%\n7.1 \n%\nNutritional Products\n2,153 \n2,066 \n4.2\n0.2\n4.0\nDiagnostic Products\n2,253 \n2,412 \n(6.6)\n1.2\n(7.8)\nMedical Devices\n5,448 \n4,747 \n14.8\n2.3\n12.5\nTotal Reportable Segments\n11,365 \n10,631 \n6.9\n1.4\n5.5\nOther\n4 \n4 \nn/m\nn/m\nn/m\nNet Sales\n$\n11,369 \n$\n10,635 \n6.9\n1.4\n5.5\nTotal U.S.\n$\n4,299 \n$\n4,202 \n2.3\n—\n2.3\nTotal International\n$\n7,070 \n$\n6,433 \n9.9\n2.3\n7.6\nNet Sales to External Customers\n(in millions)\nNine Months Ended September 30, 2025\nNine Months Ended September 30, 2024\nTotal Change\nImpact of Foreign Exchange\nTotal Change Excl. Foreign Exchange\nEstablished Pharmaceutical Products\n$\n4,154 \n$\n3,926 \n5.8 \n%\n(1.7)\n%\n7.5 \n%\nNutritional Products\n6,511 \n6,284 \n3.6\n(0.9)\n4.5\nDiagnostic Products\n6,480 \n6,821 \n(5.0)\n(0.2)\n(4.8)\nMedical Devices\n15,712 \n13,934 \n12.8\n0.4\n12.4\nTotal Reportable Segments\n32,857 \n30,965 \n6.1\n(0.3)\n6.4\nOther\n12 \n11 \nn/m\nn/m\nn/m\nNet Sales\n$\n32,869 \n$\n30,976 \n6.1\n(0.3)\n6.4\nTotal U.S.\n$\n12,743 \n$\n11,982 \n6.4\n—\n6.4\nTotal International\n$\n20,126 \n$\n18,994 \n6.0\n(0.4)\n6.4\n___________________________________\nNotes:\nIn order to compute results excluding the impact of exchange rates, current year U.S. dollar sales are multiplied or divided, as appropriate, by the current year average foreign exchange rates and then those amounts are multiplied or divided, as appropriate, by the prior year average foreign exchange rates.\nn/m = Percent change is not meaningful\n25\nTable of Contents\nThe 5.5 percent increase in total net sales during the third quarter of 2025, excluding the impact of foreign exchange, primarily reflected higher product sales in the Medical Devices and Established Pharmaceutical Products segments. Diagnostic Products sales continued to be impacted by the d\necline in COVID-19 testing-related sales and challenging market conditions in China, including the impact of volume-based procurement programs\n. COVID-19 testing-related sales were $69 million in the third quarter of 2025 compared to $265 million in the third quarter of 2024. Abbott’s net sales were favorably impacted by changes in foreign exchange rates in the third quarter as the relatively weaker U.S. dollar increased total international sales by 2.3 percent and total sales by 1.4 percent.\nThe 6.4 percent\n \nincrease in total net sales during the first nine months of 2025, excluding the impact of foreign exchange, reflected sales growth in the Medical Devices and Established Pharmaceutical Products segments, fueled by sales of recently launched products, as well as higher sales of existing products. Diagnostic Products sales growth continued to be impacted by the decline in COVID-19 testing-related sales and \nchallenging market conditions in China, including the impact of volume-based procurement programs\n. COVID-19 testing-related sales totaled $208 million during the first nine months of 2025 and $571 million during the first nine months of 2024. Abbott’s net sales were unfavorably impacted by changes in foreign exchange rates in the first nine months as the relatively stronger U.S. dollar at the beginning of the year decreased total international sales by 0.4 percent and total sales by 0.3 percent.\nThe table below provides detail by sales category for the nine months ended September 30. Percent changes are versus the prior year and are based on unrounded numbers.\n(in millions)\nSeptember 30, 2025\nSeptember 30, 2024\nTotal Change\nImpact of Foreign Exchange\nTotal Change Excl. Foreign Exchange\nEstablished Pharmaceutical Products —\nKey Emerging Markets\n$\n3,121 \n$\n2,910 \n7.3 \n%\n(2.4)\n%\n9.7 \n%\nOther Emerging Markets\n1,033 \n1,016 \n1.7 \n0.5 \n1.2 \nNutritional Products —\nInternational Pediatric Nutritionals\n1,377 \n1,377 \n— \n(1.8)\n1.8 \nU.S. Pediatric Nutritionals\n1,695 \n1,646 \n3.0 \n— \n3.0 \nInternational Adult Nutritionals\n2,334 \n2,146 \n8.8 \n(1.4)\n10.2 \nU.S. Adult Nutritionals\n1,105 \n1,115 \n(0.9)\n— \n(0.9)\nDiagnostic Products —\nCore Laboratory\n3,899 \n3,848 \n1.3 \n(0.3)\n1.6 \nMolecular\n376 \n384 \n(2.0)\n— \n(2.0)\nPoint of Care\n448 \n441 \n1.7 \n(0.1)\n1.8 \nRapid Diagnostics\n1,757 \n2,148 \n(18.2)\n(0.2)\n(18.0)\nMedical Devices —\nRhythm Management\n1,944 \n1,766 \n10.1 \n0.4 \n9.7 \nElectrophysiology\n2,034 \n1,824 \n11.5 \n0.2 \n11.3 \nHeart Failure\n1,073 \n948 \n13.2 \n0.3 \n12.9 \nVascular\n2,212 \n2,112 \n4.7 \n0.1 \n4.6 \nStructural Heart\n1,848 \n1,637 \n12.9 \n0.4 \n12.5 \nNeuromodulation\n736 \n705 \n4.4 \n(0.1)\n4.5 \nDiabetes Care\n5,865 \n4,942 \n18.7 \n0.6 \n18.1 \n26\nTable of Contents\nIn the first nine months of 2025, total Established Pharmaceutical Products sales, excluding the impact of foreign exchange, increased 7.5 percent. Excluding the unfavorable effect of foreign exchange, sales in Key Emerging Markets for Established Pharmaceutical Products increased 9.7 percent in the first nine months of 2025, led by higher revenue in several countries and across several therapeutic areas, including cardiometabolic, gastroenterology, and central nervous system/pain management. Other Emerging Markets, excluding the effect of foreign exchange, increased 1.2 percent in the first nine months of 2025.\nExcluding the impact of foreign exchange, total Nutritional Products sales in the first nine months of 2025 increased 4.5 percent. In U.S. Pediatric Nutritionals, the 3.0 percent increase in sales in the first nine months of 2025 reflects growth of infant formula and Pedialyte\n®\n product sales, partially offset by a decrease in PediaSure\n®\n product sales. Excluding the effect of foreign exchange, International Pediatric Nutritionals sales increased 1.8 percent in the first nine months of 2025.\nIn the first nine months of 2025, U.S. Adult Nutritionals sales decreased 0.9 percent as a result of lower Ensure\n®\n product sales and the discontinuation of the ZonePerfect\n®\n product line in March 2024. In the first nine months of 2025, International Adult Nutritionals sales, excluding the effect of foreign exchange, increased 10.2 percent due to growth of Ensure and Glucerna\n®\n product sales. \nIn the first nine months of 2025, Diagnostic Products sales decreased 4.8 percent, excluding the impact of foreign exchange, and increased 0.6 percent, excluding the impact of foreign exchange and COVID-19 testing-related sales. In the first nine months of 2025 and 2024, Abbott’s COVID-19 testing-related sales totaled $208 million and $571 million, respectively.\nIn Core Laboratory, sales increased 1.6 percent in the first nine months of 2025, excluding the effect of foreign exchange, driven by continued growth of Alinity\n® \nproduct sales outside of China, partially offset by lower sales in China due to the \nimpact of challenging market conditions\n. In Rapid Diagnostics, sales decreased 18.0 percent in the first nine months of 2025, excluding the effect of foreign exchange, primarily due to lower demand for COVID-19 tests. \nExcluding the effect of foreign exchange, total Medical Devices sales increased 12.4 percent in the first nine months of 2025, led by double-digit growth in Diabetes Care, Heart Failure, Structural Heart, and Electrophysiology. Higher Diabetes Care sales were driven by continued growth in Abbott's continuous glucose monitoring (CGM) systems. CGM systems sales totaled $5.6 billion and $4.7 billion in the first nine months of 2025 and 2024, respectively. Excluding the effect of foreign exchange, CGM systems sales increased 19.4 percent in the first nine months of 2025.\nIn Heart Failure, the 12.9 percent increase in sales, excluding the effect of foreign exchange, primarily reflects growth in chronic and acute pump products and related accessories. In Structural Heart, the 12.5 percent increase in sales, excluding the effect of foreign exchange, primarily reflects growth in TriClip\n® \nand Navitor\n® \nproducts. In Electrophysiology, the 11.3 percent increase in sales, excluding the effect of foreign exchange, primarily reflects higher procedure volumes and increased demand fo\nr Abbott's portfolio of products designed to diagnose and treat cardiac arrhythmias\n. In Rhythm Management, the 9.7 percent sales increase in the first nine months of 2025, excluding the impact of foreign exchange, was primarily due to growth in Aveir\n®\n leadless pacemakers, partially offset by a decrease in traditional pacemaker and implantable cardioverter defibrillator sales.\n \nIn March 2025, Abbott obtained CE Mark for its Volt™ Pulsed Field Ablation (PFA) System to treat patients with atrial fibrillation. In May 2025, Abbott announced U.S. Food and Drug Administration (FDA) approval of the company's Tendyne™ transcatheter mitral valve replacement (TMVR) system to treat people with mitral valve disease. In July 2025, Abbott received regulatory approval in Japan for TriClip, a minimally invasive treatment option for patients with tricuspid regurgitation, or a leaky tricuspid heart valve. In August 2025, Abbott obtained CE Mark for an expanded indication for the company's Navitor\n®\n transcatheter aortic valve implantation (TAVI) system to treat people with symptomatic, severe aortic stenosis who are at low or intermediate risk for open-heart surgery.\n27\nTable of Contents\nThe gross profit margin percentage was 51.7 percent for the third quarter of 2025, compared to 51.4 percent for the third quarter of 2024, and 52.4 percent for the first nine months of 2025 compared to 51.0 percent for the first nine months of 2024. The increase in the first nine months of 2025 reflects the favorable impact of gross margin improvement initiatives, partially offset by higher costs, including tariffs, and the unfavorable impact of foreign exchange. \nResearch and development (R&D) expenses increased $53 million to $766 million, or 7.5 percent, in the third quarter of 2025, and increased $112 million to $2.2 billion, or 5.4 percent, in the first nine months of 2025 compared to the prior year. The increase in R&D expenses in the first nine months of 2025 was primarily driven by higher spending on various projects. \nSelling, general, and administrative (SG&A) expenses increased $156 million to $3.1 billion, or 5.4 percent, in the third quarter of 2025, and increased $413 million to $9.2 billion, or 4.7 percent, in the first nine months of 2025 compared to the prior year due to higher selling and marketing spending to drive growth across various businesses. \nRestructuring Plans\nIn 2025, Abbott management approved plans to streamline operations in order to reduce costs and improve efficiencies in its diagnostic and medical devices businesses. In the nine months ended September 30, 2025, Abbott recorded employee related severance and other charges of $197 million, of which $100 million was recorded in Cost of products sold, $38 million was recorded in Research and development, and $59 million was recorded in Selling, general, and administrative. Payments related to these actions totaled $57 million in the first nine months of 2025 and the remaining liabilities totaled $140 million at September 30, 2025. In addition, in the first nine months of 2025, Abbott recognized asset impairment charges of $25 million related to these restructuring plans.\nOther (Income) Expense, net\nOther (income) expense, net increased from $121 million of income in the third quarter of 2024 to $150 million of income in the third quarter of 2025 and increased from $222 million of income in the first nine months of 2024 to $414 million of income in the first nine months of 2025. The increase in the third quarter of 2025 reflects higher income associated with the non-service cost components of net pension and post-retirement medical benefit costs and lower investment impairments. The increase in the first nine months of 2025 is primarily due to the recognition of a $143 million loss on the sale of a non-core business related to the Established Pharmaceutical Products segment in the second quarter of 2024. The increase in the first nine months of 2025 also reflects lower investment impairments and higher income associated with the non-service cost components of net pension and post-retirement medical benefit costs, partially offset by changes in the fair value of contingent consideration liabilities related to previous business combinations.  \nInterest Expense, net\nInterest expense, net decreased by $7 million to $44 million in the third quarter of 2025 and decreased by $27 million to $143 million in the first nine months of 2025. In the third quarter and the first nine months of 2025, interest expense decreased primarily as a result of the repayment of long-term debt in November 2024 and March 2025.\nTaxes on Earnings\nTaxes on earnings reflect the estimated annual effective rates and include charges for interest and penalties. In the first nine months of 2025 and 2024, taxes on earnings include $91 million and $44 million, respectively, in excess tax benefits associated with share-based compensation. In the first nine months of 2025, taxes on earnings includes approximately $460 million of tax expense related to a deferred tax asset that was recognized as a significant non-cash tax benefit in a prior year. In the first nine months of 2025 and 2024, taxes on earnings also included approximately $90 million of net tax benefit and $35 million of net tax expense, respectively, as the result of the resolution of various tax positions related to prior years.\n28\nTable of Contents\nIn September 2023, Abbott received a Statutory Notice of Deficiency (SNOD) from the U.S. Internal Revenue Service (IRS) for the 2019 Federal tax year in the amount of $417 million. The primary adjustments proposed in the SNOD relate to the reallocation of income between Abbott’s U.S. entities and its foreign affiliates. Abbott believes that the income reallocation adjustments proposed in the SNOD are without merit, in part because certain adjustments contradict methods that were agreed to with the IRS in prior audit periods. The SNOD also contains other proposed adjustments that Abbott believes are erroneous and unsupported. Abbott filed a petition with the U.S. Tax Court contesting the SNOD in December 2023.\nIn June 2024, Abbott received a SNOD from the IRS for the 2017 and 2018 Federal tax years in the amount of $192 million. The matters proposed in the 2017/2018 SNOD are substantially similar to the income allocation adjustments included in the 2019 SNOD. Abbott filed a petition in September 2024 with the U.S. Tax Court contesting the 2017/2018 SNOD in a manner consistent with its petition for the 2019 SNOD.\nIn October 2024, Abbott received a SNOD from the IRS for the 2020 Federal tax year assessing an additional $443 million of income tax. The primary adjustments proposed in the SNOD are substantially similar to the income allocation adjustments included in the 2017/2018 and 2019 SNODs. Abbott believes that the income reallocation adjustments proposed in the SNOD are without merit. The SNOD also contains other proposed adjustments and omissions that Abbott believes are erroneous and unsupported. In addition to the tax assessment for the 2020 tax year, the 2020 SNOD also contested a deduction for which an estimated $440 million cash tax benefit would be available in a different taxable year as allowed under applicable U.S. tax law. Abbott filed a petition with the U.S. Tax Court contesting the SNOD in December 2024.\nAbbott intends to vigorously defend its filing positions through ongoing discussions with the IRS, the IRS independent appeals process, and/or through litigation, as necessary. Abbott reserves for uncertain tax positions related to unresolved matters with the IRS and other taxing authorities. Abbott continues to believe that its reserves for uncertain tax positions are appropriate.\nThe Organization for Economic Cooperation & Development (OECD) has proposed a two-pillared plan for a revised international tax system. Pillar 1 proposes to reallocate taxing rights among the jurisdictions in which in-scope multinational corporations operate. Pillar 2 proposes to assess a 15 percent minimum tax on the earnings of in-scope multinational corporations on a country-by-country basis. Numerous countries have enacted legislation to adopt the Pillar 2 model rules. The enactment of current Pillar 2 model rules did not and is not projected to have a material impact to Abbott's consolidated financial statements. Abbott continues to monitor the Pillar 1 and Pillar 2 developments.\nLiquidity and Capital Resources\nThe decrease in cash and cash equivalents from $7.6 billion at December 31, 2024, to $7.5 billion at September 30, 2025, reflects the repayments of debt in September and March 2025 of $500 million and $1.0 billion, respectively, and the payment of dividends and capital expenditures in the first nine months of 2025, partially offset by cash generated from operations. Working capital was $10.3 billion at September 30, 2025, and $9.5 billion at December 31, 2024. The increase in working capital in 2025 primarily reflects increases in trade receivables and inventory.  \nIn the Condensed Consolidated Statement of Cash Flows, Net cash from operating activities for the first nine months of 2025 totaled $6.3 billion, an increase of $561 million from the prior year, primarily due to higher segment operating earnings. In the first nine months of 2025, Net cash from operating activities included $256 million of pension contributions and the payment of cash taxes of $1.5 billion. Net cash from operating activities in the first nine months of 2024 included $298 million of pension contributions and the payment of cash taxes of $1.2 billion. \nAt September 30, 2025, Abbott’s long-term debt rating was AA- by S&P Global Ratings and Aa3 by Moody’s Investors Service. Abbott expects to maintain an investment grade rating.\nOn September 15, 2025, Abbott repaid the $500 million outstanding principal amount of its 3.875% Notes upon maturity. On March 17, 2025, Abbott repaid the $1.0 billion outstanding principal amount of its 2.95% Notes upon maturity. \n29\nTable of Contents\nIn October 2024, the board of directors authorized the repurchase of up to $7 billion of Abbott common shares, from time to time. This authorization was in addition to the unused portion of the share repurchase program authorized in December 2021. In the third quarter of 2025, Abbott repurchased 2.4 million of its common shares for $303 million, which fully utilized the $293 million authorization remaining under the December 2021 share repurchase program, and a portion of the October 2024 repurchase program. \nIn each of the first three quarters of \n2025\n, Abbott declared a quarterly dividend of $0.59 per share on its common shares, which represents an increase of 7.3 percent over the $0.55 per share dividend declared in each of the first three quarters of \n2024\n.\nLegislative Issues\nAbbott’s primary markets are highly competitive and subject to substantial government regulations throughout the world. Abbott expects debate to continue over the availability, method of delivery, and payment for healthcare products and services. It is not possible to predict the extent to which Abbott or the healthcare industry in general might be adversely affected by these factors in the future. A more complete discussion of these factors is contained in Item 1, Business, and Item 1A, Risk Factors, in our Annual Report on Form 10-K for the year ended December 31, 2024.\nPrivate Securities Litigation Reform Act of 1995 — A Caution Concerning Forward-Looking Statements\nUnder the safe harbor provisions of the Private Securities Litigation Reform Act of 1995, Abbott cautions that any forward-looking statements made by Abbott are subject to risks and uncertainties that may cause actual results to differ materially from those indicated in the forward-looking statements. Economic, competitive, governmental, technological, and other factors that may affect Abbott's operations are discussed in Item 1A, \"Risk Factors\" in our Annual Report on Form 10-K for the year ended December 31, 2024, and are incorporated herein by reference. Abbott undertakes no obligation to release publicly any revisions to forward-looking statements as a result of subsequent events or developments, except as required by law. \n30\nTable of Contents\nPART I. FINANCIAL INFORMATION"
}