{
  "source_file": "acn-20250831.htm",
  "form_type": "10-K",
  "item1": "Item 1. Business\nOverview \nAccenture is a leading solutions and global professional services company that helps the world’s leading enterprises reinvent by building their digital core and unleashing the power of AI to create value at speed across the\n \nenterprise, bringing together the talent of our approximately 779,000 people, our \nproprietary assets and platforms,\n and deep ecosystem relationships. Our strategy is to be the reinvention partner of choice for our clients and to be the most AI-enabled, client-focused, great place to work in the world. Through our Reinvention Services we bring together our capabilities across strategy, consulting, technology, operations, Song and Industry X with our deep industry expertise to create and deliver solutions and services for our clients. Our purpose is to deliver on the promise of technology and human ingenuity, and we measure our success by the 360° value we create for all our stakeholders.\nFiscal 2025 Highlights\nWe serve clients and manage our business through three geographic markets: Americas, EMEA (Europe, Middle East and Africa) and Asia Pacific. These markets bring together all of our Reinvention Services with both local and global talent and solutions.\nWe go to market by industry, leveraging our deep expertise across our five industry groups—Communications, Media & Technology, Financial Services, Health & Public Service, Products and Resources. We deliver two types of work: Consulting and Managed Services. \n$69.7B\n \nin revenues\nOur revenues are derived primarily from Forbes Global 2000 companies, governments and government agencies. Today, we work across every major market with more than 9,000 clients, including the world’s largest companies; three quarters of the Fortune Global 100 and 500. \nAs of August 31, 2025, we employed approximately\n779,000\n \npeople. \nWe have long-term relationships and have partnered with \n195\n \nof our top \n200\n clients for \n10+\n \nyears.\nFiscal 2025 Investments\n$1.5B\n$0.8B\n$1.0B\nacross 23 strategic acquisitions\nin research and development\nin learning and professional development\nDuring fiscal 2025, we continued to make significant investments—in strategic acquisitions, in research and development (R&D) in our assets, platforms and industry and functional solutions, in patents and pending patents and in attracting, retaining and developing people. These investments help us to further enhance our differentiation and competitiveness in the marketplace. Our disciplined acquisition strategy, which is an engine to fuel organic growth, is focused on scaling our business in high-growth areas; adding skills and capabilities in new areas; and deepening our industry and functional expertise. In fiscal 2025, we invested $1.5 billion across 23 strategic acquisitions, $0.8 billion in R&D, and approximately $1.0 billion in learning and professional development, including approximately 47 million training hours.\nTable of Contents\nACCENTURE\n 2025 FORM 10-K\nItem 1. Business\n3\nWe also use our investment capacity to drive early leadership in areas of growth. For example, our early and decisive decision in fiscal 2023 to invest significantly to become a leader in generative AI with a $3 billion multi-year investment has positioned us to capture this new area of spend for our clients.\nGeographic Markets\nOur three geographic markets—Americas, EMEA and Asia Pacific—bring together our Reinvention Services in teams, which typically consist of industry and functional experts, AI, data and technology specialists and professionals with local market knowledge and experience, to meet client needs. The geographic markets have primary responsibility for building and sustaining long-term client relationships; bringing together our expertise from around the globe and collaborating across our business to sell and deliver our full range of solutions and services; ensuring client satisfaction; and achieving revenue and profitability objectives.\nWhile we serve clients in locally relevant ways, our global footprint and scale in every major country give us the ability to leverage our experience and people from around the world to accelerate outcomes for our clients. \nOur three geographic markets are our reporting segments. The percent of our revenues represented by each market is shown at right.\n \nReinvention Services \nEffective September 1, 2025, we brought all of our services, which are described below, together into a single, integrated business unit called Reinvention Services. With this change, our client-focused growth model is bringing together all our capabilities across strategy, consulting, technology, operations, Song and Industry X, including deep industry and functional expertise across these capabilities, plus our technology ecosystem partnerships, to create more leading solutions faster and embed AI and data more easily into creating and delivering our solutions and services. As the reinvention partner of choice for our clients, we are building the digital core and helping reinvent nearly every part of the enterprise, everything from functions that are common across industries like HR and Finance, to industry-specific functions like manufacturing and capital projects. With the majority of our large deals today already involving capabilities across multiple areas, the full rollout of our model is designed to make it faster and simpler to sell and deliver everything Accenture offers across our client base, while embedding more AI and data and equipping our people.\nStrategy and Consulting\nWe work with C-suite executives, leaders and boards of the world’s leading organizations, helping them reinvent nearly every part of their enterprise to set their strategic priorities, build their digital core, reinvent processes and reimagine their workforce to drive greater growth, enhance competitiveness, and deliver sustainable 360° stakeholder value. Our deep industry and functional expertise is supported by proprietary assets and platforms that help organizations transform faster and become more resilient. Underpinned by technology, data, analytics, AI, change management, talent, learning and sustainability, these capabilities help architect and accelerate all aspects of an organization’s reinvention. Our strategists and deep industry, functional, customer and technology consultants work hand-in-hand with our clients and across our capabilities to shape and deliver these reinventions.\nTechnology\nWe help our clients build their digital core including AI, data, cloud, systems integration and application management, security, intelligent platform services, infrastructure services, software engineering services, automation and global delivery \ncenters, \nutilizing our deep industry and functional knowledge to create solutions that will drive value at speed. We continuously innovate our solutions and services and develop new capabilities, assets and platforms through early adoption of new technologies such as advanced AI, which includes generative, agentic and physical AI, robotics, 5G, edge computing and quantum computing, as well as invest in R&D for both new and existing forms of technology. We also invest in emerging technologies through Accenture Ventures.\nTable of Contents\nACCENTURE\n 2025 FORM 10-K\nItem 1. Business\n4\nOperations\nWe operate business processes on behalf of clients for specific enterprise functions, including finance and accounting, sourcing and procurement, supply chain, marketing and sales, and human resources, as well as industry-specific services, such as platform trust and safety, banking, insurance, network and health services. We help organizations with reinvented operations, enabled by SynOps, our proprietary AI-powered, cloud-enabled platform that empowers people with data, processes, automation and a broad ecosystem of technology partners to transform enterprise operations at speed and scale. Our experience from operations also informs our strategy and consulting capabilities to better serve our clients.\nS\nong\nWe help our clients create new, hyper-personalized experiences and services that are intelligently designed to foster loyalty and drive growth by making customer interactions more compelling, useful, and simple from initial interaction through ongoing customer service. We also build the strong digital core that supports the customer agenda. Our suite of solutions and services spans design, digital products, marketing, sales, commerce, and customer service. We help brands amplify their value, by making their products, services and experiences clear and inspiring to stand out in a crowded marketplace. Our commerce strategies are designed to enhance sales effectiveness and create seamless buying experiences. Our customer service innovations powered with AI help make support more responsive and accessible. We leverage the power of a connected customer strategy, AI and data, ecosystem partnerships, and our ability to scale and manage programs on behalf of our clients to solve client challenges more effectively, and provide solutions that are designed to be advanced, ethically sound and sustainable to help our clients reinvent how they engage their customers and grow.\nIndustry X\nWe combine our digital capabilities with deep engineering and manufacturing expertise. By using the combined power of digital and data we help our clients to reinvent and reimagine the products they make and how they make them. We have expanded our capabilities over the last few years to include helping our clients to digitally transform how their capital projects are planned, managed and executed, from plant and asset construction to public infrastructure, power grids and data centers. We collaborate closely with our technology ecosystem partners to help our clients achieve compressed transformations by redefining how their products are designed and engineered, tested, sourced and supplied, manufactured, and serviced, returned and renewed. Our solutions and services include the use of data and transformative technologies such as advanced AI, artificial reality/virtual reality, advanced robotics and digital twins.\nEcosystem Partner Relationships\nOur successful strategy for more than a decade has been to be the number-one partner for the technology ecosystem. As technology is front and center for every client, we are the number-one partner for all of our top 10 ecosystem partners. These partners are among the world’s largest technology companies by revenue, and they are seeking deeper partnerships with us as they look for help to turn their technology into business outcomes and scale the adoption of AI. In fiscal 2025, we expanded our partnerships beyond the top 10 in AI and data and created new ones with companies that are becoming critical to many of our clients, which also want us to help them scale their client and customer relationships. \nClients\nWe continue to be the reinvention partner of choice, serving approximately 9,000 clients including a significant portion of the Fortune Global 100 and 500. We believe our global footprint and breadth of capabilities mean we can serve more of our clients’ needs for large-scale transformations than any other player in the industry. Our deep and long-standing relationships mean we know our clients and their industries thoroughly. We have long-term relationships and have partnered with\n 195 of our top 200 \nclients for 10 or more years, and have 305 Diamond clients, our largest client relationships.\nIndustry Groups  \nWe believe the depth and breadth of our industry expertise is a key competitive advantage which allows us to bring client-specific industry solutions and services to our clients to accelerate reinvention and value creation. Our industry focus gives us an understanding of industry evolution, business issues and trends, industry operating models, capabilities and processes and new and emerging technologies. The breadth of our industry expertise enables us to create solutions that are informed by cross industry experience. We go to market through the following five industry groups within our geographic markets.\nTable of Contents\nACCENTURE\n 2025 FORM 10-K\nItem 1. Business\n5\nCommunications, Media & Technology\nFY25 Revenues of $11.5B\nPercent of Group’s FY25 Revenue\n39%\n18%\n43%\nCommunications & Media\nHigh Tech\nSoftware & Platforms\nB2C and B2B communications service providers (both fixed and mobile), MVNO (mobile virtual network operators) and network infrastructure companies inclusive of edge and IOT connectivity infrastructure, cable and satellite communications, broadcasters and TV networks, gaming, print, online and traditional publishing, entertainment, sports, content producers (including studios), content aggregators and streaming live events (sports) and media infrastructure providers, integrated advertising agencies and creative\nEnterprise technology, hardware, and associated manufacturing; semiconductor including silicon design and development, foundries, capital equipment, and manufacturing; consumer technology, electronics, batteries, and associated manufacturing; network equipment and device providers and manufacturers; data centers; medical equipment companies and manufacturers\nCloud-based enterprise, consumer software and platform companies; large language model owners; both subscription and ad-driven consumer platforms spanning ecommerce, social, media, advertising and gaming\nFinancial Services\nFY25 Revenues of $12.8B\nPercent of Group’s FY25 Revenue\n70%\n30%\nBanking & Capital Markets\nInsurance\nRetail and commercial banks, wealth and asset managers, payment providers, corporate and investment banks, market infrastructure providers and exchanges, broker/dealers, depositories, private equity firms, central banks, clearing and settlement organizations, mortgage lenders, retirement services providers and other diversified financial enterprises\nProperty and casualty personal and commercial lines, life and annuities and group benefits insurers, retirement companies, reinsurance firms and insurance brokers\nHealth & Public Service\nFY25 Revenues of $14.8B\nPercent of Group’s FY25 Revenue\n32%\n68%\nHealth\nPublic Service\nHealthcare providers, such as hospitals, public health systems, policy-making authorities, health insurers (payers) and industry organizations and associations\nHuman and social services agencies; defense departments and military forces; public safety authorities, including justice departments; educational institutions; non-profit organizations; cities; transportation agencies; and postal, customs, revenue and tax agencies\nOur work with clients in the U.S. federal government is delivered through Accenture Federal Services, a U.S. company and a wholly owned subsidiary of Accenture LLP, and represented approximately 36% of Health & Public Service revenues, 15% of Americas revenues and 8% of total revenues in fiscal 2025. For risks related to our government contracting work, see Item 1A, Risk Factors—“Our work with government clients exposes us to additional risks inherent in the government contracting environment”.\nTable of Contents\nACCENTURE\n 2025 FORM 10-K\nItem 1. Business\n6\nProducts\nFY25 Revenues of $21.2B\nPercent of Group’s FY25 Revenue\n45%\n35%\n20%\nConsumer Goods, Retail & Travel Services\nIndustrials\nLife Sciences\nFood and beverage, household goods, personal care, fashion/apparel; supermarkets, mass-merchandise discounters, department, quick serve and convenience stores and specialty retailers; aviation, hospitality and travel services companies, tobacco, agribusiness and consumer health companies\nAutomotive & mobility, industrial & electrical equipment manufacturers, industrial suppliers, construction, infrastructure, heavy equipment,  consumer durables, business services, freight, logistics, aerospace & defense, rail and public transportation companies\nBiopharmaceutical, medical technology and distributors\nResources\nFY25 Revenues of $9.5B\nPercent of Group’s FY25 Revenue\n28%\n25%\n47%\nChemicals & Natural Resources\nEnergy\nUtilities\nMining, petrochemicals, specialty chemicals, polymers and plastics, gases and agricultural chemicals companies, as well as the metals and forest products industries\nOil and gas companies, including upstream, midstream, downstream, oilfield services, clean energy and energy trading companies\nPower generators and developers, including nuclear, renewables and other conventional generators; electric and gas transmission and distribution operators, energy and energy service retailers;  water, waste and recycling service providers\nPeople\nWe are a value and solution-led company with approximately 779,000 people as of August 31, 2025, whose skills and specialization are a significant source of competitive differentiation. We serve clients at any given time in more than 120  countries, with offices and operations in 52 countries and the majority of our people are in India, the Philippines and the U.S. \nWe have a culture of shared success, which is defined as success for our clients, our people, our shareholders, our partners and our communities. Our Code of Business Ethics, which applies to all of our people, reinforces our core values and helps drive our culture of compliance, ethical conduct and accountability.\nOur strategy is to be the most AI-enabled, client-focused, great place to work for reinventors, which is how we refer to our people, because we are the reinvention partner of choice for our clients. We were pleased that among our people who participated in the globally recognized Great Place To Work\n®\n Trust Index Survey™ in June 2025, 75% agreed that “Taking everything into account, I would say this is a great place to work.” In addition to earning the No. 6 spot on the Great Place To Work® list of the World’s Best Workplaces™, we are recognized as a Great Place To Work\n®\n in 12 countries, representing nearly 80% of our people.\nTo drive reinvention, innovation must be at the forefront, which requires us to attract, develop and inspire top talent. \nOur focus is to create talent and unlock the potential of our people, to create strong leaders, and to help them achieve their professional and personal aspirations, while continuously evolving to meet new client needs.\nWe are implementing a refreshed three-pronged talent strategy to meet current and future client demand: investing in upskilling people, which has been and continues to be our primary focus; exiting people in a compressed timeline where reskilling is not a viable path for the skills we need; and identifying areas to drive even more operating efficiencies in our business, including through AI.\nDuring fiscal 2025, we invested approximately $1.0 billion in learning and professional development. With our digital learning platform, we delivered approximately 47 million training hours, an increase of 9% compared with fiscal 2024. We continually invest in strengthening the industry, technology, functional and AI skills of our people. As part of our strategic \nTable of Contents\nACCENTURE\n 2025 FORM 10-K\nItem 1. Business\n7\nfocus on driving reinvention and growth with AI, we are launching a global learning program that integrates tools, platforms, and role-based learning, along with partnerships with leading educational institutions and certification programs. Additionally, Accenture’s industry learning framework and technology certification strategy are an important part of our competitive differentiation. \nWe also continue to steadily increase our AI and data workforce, reaching approximately \n77,000\n skilled AI and data practitioners at the end of fiscal 2025, against our goal of doubling our AI and data workforce to \n80,000\n by the end of fiscal 2026.\nWe promoted approximately 97,000 people in fiscal 2025, demonstrating our continued commitment to creating vibrant careers and opportunities for our people.\nWe balance our supply of skills with changes in client demand. We do this through adjusting levels of new hiring and managing our attrition (both voluntary and involuntary). We believe people are drawn to our strong purpose, values and reputation. For fiscal 2025, attrition, excluding involuntary terminations, was 14%, compared to 13% in fiscal 2024. For the fourth quarter of fiscal 2025, annualized attrition, excluding involuntary terminations, was 15%, down from 16% in the third quarter of fiscal 2025.\nAccenture’s total rewards consist of cash compensation, equity and a wide range of benefits. Our total rewards program is designed to recognize our people’s skills, contributions and career progression. Base salary, bonus and equity are tailored to the market where our people work and live. Certain rewards, like equity and bonuses, are opportunities for our people to share in the overall success of our company. As our people advance in their careers, they have greater opportunities to be rewarded. Accenture’s equitable rewards go beyond financial rewards and include health and well-being programs and practices—including physical, mental, emotional and financial well-being—that care for our people.\nGlobal Delivery Capability \nA key differentiator is our global delivery capability. We have one of the world’s largest networks of centers with deep capabilities that allow us to help our clients create exceptional business value. Our global approach provides scalable innovation; standardized processes, methods and tools; automation and AI; industry expertise and specialized capabilities; cost advantages; foreign language fluency; proximity to clients; and time zone advantages—to deliver high-quality solutions and services. Emphasizing quality, productivity, reduced risk, speed-to-market and predictability, our global delivery model supports all parts of our business to provide clients with price-competitive solutions and services. \nInnovation and Intellectual Property \nWe are committed to developing leading-edge ideas and leveraging emerging technologies and we see innovation as a source of competitive advantage. We use our investment in R&D—on which we spent $0.8 billion, $1.2 billion and $1.3 billion in fiscal 2025, 2024 and 2023, respectively—to help clients address new realities in the marketplace and to face the future with confidence.\nOur innovation experts work with clients across the world to imagine their future, build and co-create innovative business strategies and technology solutions, and then scale those solutions to sustain innovation. We believe our combination of people, platforms, assets and capabilities, including our global network of Innovation Centers, makes Accenture one of the leading strategic innovation partners for our clients.\nThis is all supported by our innovation approach, which includes Accenture Research, Accenture Ventures and Accenture Labs, our Innovation Centers as well as our Delivery Centers. Our research and thought leadership teams help identify market, technology and industry trends. Accenture Ventures partners with and invests in growth-stage companies that create innovative enterprise technologies. Accenture Labs incubate and prototype new concepts through applied research and development projects. Within this, we incubate and apply emerging technology innovation to business architectures, including robotics, quantum and advanced AI along with many other disruptive technologies and ideas.\nWe harness our unique intellectual property to deliver these innovation services. We have a global portfolio of patents and pending patent applications covering various technology areas, including AI, cloud, cybersecurity, automation, analytics and quantum. We leverage patent, trade secret and copyright laws as well as contractual arrangements and confidentiality procedures to protect the intellectual property in our innovative solutions and services. These include our proprietary platforms, software, reusable knowledge capital, and other innovations. We also have policies to respect the intellectual property rights of third parties, such as our clients, partners, vendors and others. \nTo protect Accenture’s brands, we rely on intellectual property laws and trademark registrations held around the world. Trademarks appearing in this report are the trademarks or registered trademarks of Accenture Global Services Limited, Accenture Global Solutions Limited, or third parties, as applicable.\nTable of Contents\nACCENTURE\n 2025 FORM 10-K\nItem 1. Business\n8\nAssets and Platforms\nWe bring industry specific solutions and services as well as cross industry expertise and leverage our scale and global footprint, innovation capabilities, and strong ecosystem partnerships together with our proprietary assets and platforms including GenWizard, myNav, SynOps and AI Navigator for Enterprise to deliver tangible value for our clients. We have significantly embedded advanced AI into our proprietary platforms like GenWizard, which enables us to deliver differently for our clients.\nCompetition\nAccenture operates in a highly competitive and rapidly changing global marketplace. We compete with a variety of organizations that offer solutions and services competitive with those we offer—but we believe no other company offers the full range of services at scale that Accenture does, which uniquely positions us in a highly competitive market. Our clients typically retain us on a non-exclusive basis. \nOur competitors include large multinational IT service providers, including the services arms of large global technology providers; off-shore IT service providers in lower-cost locations, particularly in India; accounting firms and consultancies that provide consulting, managed services and other IT solutions and services; solution or service providers that compete with us in a specific geographic market, industry or service area, including advertising agency holding companies, engineering services providers and technology start-ups and other companies that can scaled rapidly to focus on or disrupt certain markets and provide new or alternative products, end-to-end solutions, services, or commercial or delivery models; and in-house IT departments of large corporations that use their own resources rather than engage an outside firm, such as global capability centers (“GCC’s”).\nTable of Contents\nACCENTURE\n 2025 FORM 10-K\nItem 1. Business\n9\nInformation About Our Executive Officers \nOur executive officers as of October 10, 2025 are as follows:\nMelissa Burgum,\n 53, became our chief accounting officer in September 2022 and has served as our corporate controller since September 2021. Prior to that, Ms. Burgum served as our assistant corporate controller from December 2016 to September 2021 and as controller for Accenture Federal Services from May 2013 to December 2016. Prior to joining Accenture, Ms. Burgum held controllership roles at two public companies and was previously an auditor and consultant for Arthur Andersen. Ms. Burgum has been with Accenture for 12 years.\nKate Clifford,\n 48, became our chief leadership and human resources officer in September 2025. From September 2024 to September 2025, Ms. Clifford was our chief human resources officer—the Americas. From June 2022 to September 2024, she served as our chief human resources officer—North America. Prior to that, she served as our North America human resources service delivery lead from December 2018 to June 2022. Ms. Clifford has been with Accenture for 27 years.\nAtsushi Egawa,\n 60, became our co-chief executive officer—Asia Pacific and chief executive officer —Japan in September 2024. Since September 2015, Mr. Egawa has served as our market unit lead in Japan. Prior to September 2015, Mr. Egawa led our Products industry group in Japan. Prior to that role, he led our Consumer Goods business in Japan. He has partnered closely with numerous global clients on their digital transformations and was integral in the opening of Accenture’s Innovation Hub in Tokyo. Mr. Egawa has been with Accenture for 36 years.\nKate Hogan,\n 49, became our chief operating officer in September 2025. From September 2024 to September 2025, she served as our chief operating officer—the Americas. From September 2023 to September 2024, she served as chief operating officer—North America. Prior to that, Ms. Hogan served as our US West lead from September 2022 to September 2023 and chief operating officer—North America from March 2020 to August 2022. Ms. Hogan has been with Accenture for 27 years. \nMauro Macchi, \n60, became our chief executive officer—EMEA in September 2024. From September 2021 to September 2024, Mr. Macchi served as our market unit lead for Italy, Central Europe and Greece. From March 2020 to September 2021, Mr. Macchi served as the Strategy & Consulting lead for Europe. Previously, he served as our Financial Services lead for Europe from November 2019 to March 2020, Financial Services lead for Italy, Central Europe and Greece from October 2017 to October 2019 and global Banking industry lead for Strategy from March 2015 to September 2017. Mr. Macchi has been with Accenture for 35 years.\nAngie Park, \n53, became our chief financial officer in December 2024. From September 2023 to December 2024, she served as our Business and Commercial Finance lead. From September 2022 to September 2023, she served as our chief financial officer—Technology. Prior to assuming that role, she served as our head of investor relations from December 2016 to September 2022 and finance director—Health & Public Service from April 2014 to September 2023. Ms. Park has been with Accenture for 29 years\nTable of Contents\nACCENTURE\n 2025 FORM 10-K\nItem 1. Business\n10\nRyoji Sekido,\n 58, became our co-chief executive officer—Asia Pacific and chief executive officer—Asia Oceania in September 2024. From April 2023 to September 2024, Mr. Sekido served as our Technology lead for Growth Markets. Prior to March 2023, Mr. Sekido served as the Technology and Cloud First lead for Asia Pacific, Middle East and Africa. In his earlier roles, he led several industry and technology teams and served as the Financial Services client service group lead and the Financial Services technology consulting lead for APAC. Mr. Sekido has been with Accenture for 33 years.\nManish Sharma,\n 57, became our chief strategy and services officer in September 2025. Prior to that, Mr. Sharma served as our chief executive officer—the Americas from September 2024 to September 2025, chief executive officer—North America from September 2023 to September 2024 and chief operating officer from March 2022 to September 2023. From March 2020 to March 2022, Mr. Sharma served as our group chief executive—Operations. Prior to that, he held key leadership positions in Operations, including as group chief operating officer and global business process outsourcing delivery lead. Mr. Sharma has been with Accenture for 30 years.\nJulie Sweet,\n 58, became chair of our Board of Directors in September 2021 and has served as our chief executive officer since September 2019. From June 2015 to September 2019, she served as our chief executive officer—North America. From March 2010 to June 2015, she served as our general counsel, secretary and chief compliance officer. Prior to joining Accenture in 2010, Ms. Sweet was a partner for 10 years in the law firm Cravath, Swaine & Moore LLP, which she joined as an associate in 1992. Ms. Sweet has been with Accenture for 15 years and has served as a director since September 2019.\nJoel Unruch,\n 47, became our general counsel in September 2019 and has served as our corporate secretary since June 2015. Mr. Unruch also served as our chief compliance officer from September 2019 to January 2020. Mr. Unruch joined Accenture in 2011 as our assistant general counsel and assistant secretary and also oversaw ventures & acquisitions and alliances & ecosystems practices for our legal group. Prior to joining Accenture, Mr. Unruch was corporate counsel at Amazon.com and previously an associate in the corporate department of the law firm Cravath, Swaine & Moore LLP. Mr. Unruch has been with Accenture for 14 years.\nJohn Walsh, \n61, became our chief executive officer—the Americas in September 2025. Prior\nto that, Mr. Walsh served as our chief operating officer from September 2023 to September 2025. From March 2020 to September 2023, Mr. Walsh served as our chief strategic accounts and global sales officer. From November 2019 to March 2020, he served as our group chief executive—Communications, Media & Technology. He served as senior managing director—Communications, Media & Technology in North America, from 2013 to 2019. Mr. Walsh has been with Accenture for 39 years.\nOrganizational Structure \nAccenture plc was incorporated in Ireland on June 10, 2009 as a public limited company. We operate our business through subsidiaries of Accenture plc. \nThe Consolidated Financial Statements reflect the ownership interests in Accenture Canada Holdings Inc. held by certain current and former members of Accenture Leadership as noncontrolling interests. The noncontrolling ownership interests were less than 1% as of August 31, 2025. “Accenture Leadership” is comprised of members of our global management committee (our primary management and leadership team, which consists of approximately 55 of our most senior leaders), senior managing directors and managing directors.  \nTable of Contents\nACCENTURE\n 2025 FORM 10-K",
  "item7": "Item 7. Management's Discussion and Analysis of Financial Condition and Results of Operations\n31\nItem 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nThe following discussion and analysis should be read in conjunction with our Consolidated Financial Statements and related Notes included elsewhere in this Annual Report on Form 10-K. This discussion and analysis also contains forward-looking statements and should also be read in conjunction with the disclosures and information contained in “Disclosure Regarding Forward-Looking Statements” and “Risk Factors” in this Annual Report on Form 10-K. \nWe use the terms “Accenture,” “we,” “our” and “us” in this report to refer to Accenture plc and its subsidiaries. All references to years, unless otherwise noted, refer to our fiscal year, which ends on August 31. For example, a reference to “fiscal 2025” means the 12-month period that ended on August 31, 2025. All references to quarters, unless otherwise noted, refer to the quarters of our fiscal year. \nWe use the term “in local currency” so that certain financial results may be viewed without the impact of foreign currency exchange rate fluctuations, thereby facilitating period-to-period comparisons of business performance. Financial results “in local currency” are calculated by restating current period activity into U.S. dollars using the comparable prior-year period’s foreign currency exchange rates. This approach is used for all results where the functional currency is not the U.S. dollar.\nOverview \nAccenture is a leading solutions and global professional services company that helps enterprises reinvent by building their digital core and unleashing the power of AI to create value at speed across the enterprise, bringing together our people, proprietary assets and platforms, and deep ecosystem relationships. Through our Reinvention Services we bring together our capabilities across strategy, consulting, technology, operations, Song and Industry X with our deep industry expertise to create and deliver solutions and services for our clients. We serve clients in three geographic markets: the Americas, EMEA (Europe, Middle East and Africa) and Asia Pacific.\nOur results of operations are affected by economic conditions, including macroeconomic conditions, the overall inflationary environment, new and rapidly changing technologies, and levels of business confidence. We continue to see significant economic and geopolitical uncertainty in many markets around the world, which has impacted and may continue to impact our business. While the discretionary environment is unchanged, clients continue to prioritize large-scale transformations, which include becoming AI-ready.\nIn addition, the U.S. administration is reducing federal spending and the size of the federal workforce under the guidance of the Department of Government Efficiency. We are seeing impacts from these efforts in our federal government business (“Accenture Federal Services, or AFS”), including delays in new procurements, reductions in price and contract scope, and contract terminations. These changes have had an adverse effect on AFS’s results and could in the future have a material impact on our results of operations or financial condition. For a discussion of risks related to these and other recent developments, see Item 1A, “Risk Factors.”\nKey Metrics \nKey metrics for \nfiscal 2025 compared to fiscal 2024 are included below. We have presented operating income, operating margin, effective tax rate and diluted earnings per share for fiscal 2025 and 2024 on a non-GAAP or “adjusted” basis to exclude the impact of business optimization costs. During the fourth quarter of fiscal 2025, we initiated business optimization actions and recorded $615 million in related costs, which includes $344 million associated with a refreshed talent strategy, as well as asset impairments of approximately $271 million primarily related to the divestiture of two acquisitions that are no longer aligned with our strategic priorities. In fiscal 2024, we recorded $438 million in business optimization costs associated with actions initiated in fiscal 2023 and completed in fiscal 2024. For additional information regarding our business optimization actions and related costs, see Note 1 (Summary of Significant Accounting Policies) to our Consolidated Financial Statements under Item 8, “Financial Statements and Supplementary Data.”\n•\nRevenues of $69.7 billion, \nan increase of \n7%\n in both U.S. dollars and local currency;\n•\nNew bookings of $80.6 billion,\n a decrease of 1% in both U.S. dollars and local currency;\nTable of Contents\nACCENTURE\n 2025 FORM 10-K\nItem 7. Management's Discussion and Analysis of Financial Condition and Results of Operations\n32\n•\nOperating margin of 14.7%,\n a decrease from 14.8% in fiscal 2024; adjusted operating margin of 15.6%, an increase compared to 15.5% in fiscal 2024;\n•\nDiluted earnings per share of $12.15,\n a 6% increase over diluted earnings per share of $11.44 in fiscal 2024; adjusted earnings per share of $12.93, an 8% increase over adjusted earnings per share of $11.95 in fiscal 2024; and\n•\nCash returned to shareholders of $8.3 billion,\n including dividends of $3.7 billion and share purchases of $4.6 billion.\nRevenues\nFiscal\nPercent \nIncrease (Decrease) \nU.S. \nDollars\nPercent \nIncrease (Decrease) \nLocal \nCurrency\nPercent of Total\nRevenues \nfor Fiscal\n(in billions of U.S. dollars)\n2025\n2024\n2025\n2024\nGeographic Markets\nAmericas (1)\n$\n35.1 \n$\n32.6 \n8 \n%\n9 \n%\n50 \n%\n50 \n%\nEMEA\n24.6 \n22.8 \n8 \n6 \n35 \n35 \nAsia Pacific (1)\n10.0 \n9.5 \n5 \n4 \n14 \n15 \nTotal Revenues\n$\n69.7\n \n$\n64.9\n \n7\n \n%\n7\n \n%\n100\n \n%\n100\n \n%\nIndustry Groups\nCommunications, Media & Technology\n$\n11.5 \n$\n10.8 \n6 \n%\n6 \n%\n16 \n%\n17 \n%\nFinancial Services\n12.8 \n11.6 \n10 \n10 \n18 \n18 \nHealth & Public Service\n14.8 \n13.8 \n7 \n6 \n21 \n21 \nProducts\n21.2 \n19.6 \n8 \n8 \n30 \n30 \nResources\n9.5 \n9.1 \n5 \n5 \n14 \n14 \nTotal Revenues\n$\n69.7\n \n$\n64.9\n \n7\n \n%\n7\n \n%\n100\n \n%\n100\n \n%\nType of Work\nConsulting\n$\n35.1 \n$\n33.2 \n6 \n%\n5 \n%\n50 \n%\n51 \n%\nManaged Services\n34.6 \n31.7 \n9 \n9 \n50 \n49 \nTotal Revenues\n$\n69.7\n \n$\n64.9\n \n7\n \n%\n7\n \n%\n100\n \n%\n100\n \n%\nAmounts in table may not total due to rounding.\n(1)\nDuring the first quarter of fiscal 2025, our Latin America market unit moved from Growth Markets to North America. With this change, North America became the Americas market and Growth Markets became the Asia Pacific market. Prior period amounts have been reclassified to conform with the current period presentation.\nRevenues for fiscal 2025 increased 7% in both U.S. dollars and local currency compared to fiscal 2024. During fiscal 2025, revenue growth in local currency was very strong in the Americas, strong in EMEA and solid in Asia Pacific. We experienced local currency revenue growth that was very strong in Financial Services & Products, strong in Health & Public Service and Communications, Media & Technology and solid in Resources. Revenue growth in local currency was very strong in managed services and solid in consulting. While the business environment remained competitive, pricing improved in several areas of our business. We define pricing as the contract profitability or margin on the work that we sell.\nIn our consulting business, revenues for fiscal 2025 increased 6% in U.S. dollars and 5% in local currency compared to fiscal 2024. Consulting revenue growth in local currency for fiscal 2025 was driven by strong growth in the Americas, solid growth in EMEA and modest growth in Asia Pacific. Our consulting revenue continues to be driven by helping our clients accelerate their reinvention, leveraging cloud, enterprise platforms, security, AI and data, including advanced AI, as well as our change capabilities to help clients build new skills and drive the successful adoption of new processes and technologies. In addition, clients continue to be focused on initiatives designed to deliver cost savings, supply chain and operational resilience, as well as to accelerate growth and improve customer experiences. While we continue to experience demand for these services, we are seeing a slower pace and level of client spending, particularly for smaller contracts with a shorter duration.\nIn our managed services business, revenues for fiscal 2025 increased 9% in both U.S. dollars and local currency compared to fiscal 2024. Managed services revenue growth in local currency for fiscal 2025 was driven by very strong growth in the Americas and strong growth in EMEA and Asia Pacific. We continue to experience growing demand to assist clients with reinvented operations, application development and maintenance, and infrastructure management including cloud and security. Clients continue to be focused on transforming their operations through technology, AI and data, and leveraging our proprietary assets and platforms and talent to drive productivity and cost savings.\nAs we are a global company, our revenues are denominated in multiple currencies and may be significantly affected by currency exchange rate fluctuations. While a significant portion of our revenues are in U.S. dollars, the majority of our revenues are denominated in other currencies, including the Euro, Japanese yen and U.K. pound. There continues to be volatility in foreign currency exchange rates. Unfavorable fluctuations in foreign currency exchange rates have had and could in the future have a material effect on our financial results. If the U.S. dollar weakens against other currencies, resulting in favorable currency translation, our revenues, revenue growth and results of operations in U.S. dollars may be higher. If the \nTable of Contents\nACCENTURE\n 2025 FORM 10-K\nItem 7. Management's Discussion and Analysis of Financial Condition and Results of Operations\n33\nU.S. dollar strengthens against other currencies, resulting in unfavorable currency translation, our revenues, revenue growth and results of operations in U.S. dollars may be lower. There was minimal currency translation impact for fiscal 2025 compared to fiscal 2024. Assuming that exchange rates stay within recent ranges, we estimate that our fiscal 2026 revenue growth in U.S. dollars will be approximately 2% higher than our revenue growth in local currency.\nPeople Metrics    \nUtilization\nWorkforce\nVoluntary Attrition\n92%\n779,000+\n14%\nconsistent with fiscal 2024\ncompared to approximately 774,000 as of August 31, 2024\ncompared to 13% in fiscal 2024\nUtilization for fiscal 2025 was 92%, consistent with fiscal 2024. We hire to meet current and projected future demand. We proactively plan and manage the size and composition of our workforce and take actions as needed to address changes in the anticipated demand for our solutions and services, given that compensation costs are the most significant portion of our operating expenses. Our workforce, the majority of which serves our clients, increased to approximately 779,000 as of August 31, 2025, compared to approximately 774,000 as of August 31, 2024.\nFor fiscal 2025, attrition, excluding involuntary terminations, was 14%, compared to 13% in fiscal 2024. For the fourth quarter of fiscal 2025, annualized attrition, excluding involuntary terminations, was 15%, down from 16% in the third quarter of fiscal 2025. We evaluate voluntary attrition, adjust levels of new hiring and use involuntary terminations as a means to keep our supply of skills and resources in balance with changes in client demand.\nIn addition, we adjust compensation to provide market relevant pay based on the skills of our people and locations where we operate. We also consider a variety of factors, including the macroeconomic environment, in making our decisions around pay and benefits. We strive to adjust pricing as well as drive cost and delivery efficiencies, such as changing the mix of people and utilizing technology, to reduce the impact of compensation increases on our margin and contract profitability.\nOur ability to grow our revenues and maintain or increase our margin could be adversely affected if we are unable to: match people and skills with the types or amounts of solutions and services clients are demanding; recover or offset increases in compensation; deploy our employees globally on a timely basis; manage attrition; and/or effectively assimilate new employees.\nNew Bookings\nFiscal\nPercent \nIncrease (Decrease) \nU.S. \nDollars\nPercent\n Increase (Decrease) \nLocal \nCurrency\n(in billions of U.S. dollars)\n2025\n2024\nConsulting\n$\n37.6 \n$\n37.0 \n2 \n%\n2 \n%\nManaged Services\n43.0 \n44.2 \n(3)\n(3)\nTotal New Bookings\n$\n80.6\n \n$\n81.2\n \n(1)\n%\n(1)\n%\nWe provide information regarding our new bookings, which include new contracts, including those acquired through acquisitions, as well as renewals, extensions and changes to existing contracts, because we believe doing so provides useful trend information regarding changes in the volume of our new business over time. New bookings can vary significantly quarter to quarter depending in part on the timing of the signing of a small number of large managed services contracts. The types of solutions and services clients are demanding and the pace and level of their spending may impact the conversion of new bookings to revenues. For example, managed services bookings, which are typically for multi-year contracts, generally convert to revenue over a longer period of time compared to consulting bookings.\nInformation regarding our new bookings is not comparable to, nor should it be substituted for, an analysis of our revenues over time. New bookings involve estimates and judgments. There are no third-party standards or requirements governing the calculation of bookings. We do not update our new bookings for material subsequent terminations or reductions related to bookings originally recorded in prior fiscal years. New bookings are recorded using then-existing foreign currency exchange rates and are not subsequently adjusted for foreign currency exchange rate fluctuations. \nTable of Contents\nACCENTURE\n 2025 FORM 10-K\nItem 7. Management's Discussion and Analysis of Financial Condition and Results of Operations\n34\nThe majority of our contracts are terminable by the client on short notice with little or no termination penalties, and some without notice. Only the non-cancelable portion of these contracts is included in our remaining performance obligations disclosed in Note 2 (Revenues) to our Consolidated Financial Statements under Item 8, “Financial Statements and Supplementary Data.” Accordingly, a significant portion of what we consider contract bookings is not included in our remaining performance obligations.\nCritical Accounting Policies and Estimates \nThe preparation of our Consolidated Financial Statements in conformity with U.S. generally accepted accounting principles requires us to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the Consolidated Financial Statements and the reported amounts of revenues and expenses. We continually evaluate our estimates, judgments and assumptions based on available information and experience. Because the use of estimates is inherent in the financial reporting process, actual results could differ from those estimates. Certain of our accounting policies require higher degrees of judgment than others in their application. These include certain aspects of accounting for revenue recognition and income taxes. \nRevenue Recognition \nDetermining the method and amount of revenue to recognize requires us to make judgments and estimates. Specifically, complex arrangements with nonstandard terms and conditions may require contract interpretation to determine the appropriate accounting, including whether promised goods and services specified in an arrangement are distinct performance obligations and should be accounted for separately. Other judgments include determining whether performance obligations are satisfied over time or at a point in time and the selection of the method to measure progress towards completion. \nWe measure progress towards completion for technology integration consulting services and some non-technology consulting services using costs incurred to date relative to total estimated costs at completion. Revenues, including estimated fees, are recorded proportionally as costs are incurred. The amount of revenue recognized for these contracts in a period is dependent on our ability to estimate total contract costs. We continually evaluate our estimates of total contract costs based on available information and experience.  \nAdditionally, the nature of our contracts gives rise to several types of variable consideration, including incentive fees. Many contracts include incentives or penalties related to costs incurred, benefits produced or adherence to schedules that may increase the variability in revenues and margins earned on such contracts. We conduct reviews prior to signing such contracts to evaluate whether these incentives are reasonably achievable. Our estimates are monitored over the lives of our contracts and are based on an assessment of our anticipated performance, historical experience and other information available at the time. \nFor additional information, see Note 2 (Revenues) to our Consolidated Financial Statements under Item 8, “Financial Statements and Supplementary Data.” \nIncome Taxes \nDetermining the consolidated provision for income tax expense, income tax liabilities and deferred tax assets and liabilities involves judgment. Deferred tax assets and liabilities, measured using enacted tax rates, are recognized for the future tax consequences of temporary differences between the tax and financial statement bases of assets and liabilities. As a global company, we calculate and provide for income taxes in each of the tax jurisdictions in which we operate. This involves estimating current tax exposures in each jurisdiction as well as making judgments regarding the recoverability of deferred tax assets. Tax exposures can involve complex issues and may require an extended period to resolve. In assessing the realizability of deferred tax assets, we consider whether it is more likely than not that some portion or all of the deferred tax assets will not be realized and adjust the valuation allowances accordingly. Factors considered in making this determination include the period of expiration of the tax asset, planned use of the tax asset, tax planning strategies and historical and projected taxable income as well as tax liabilities for the tax jurisdiction in which the tax asset is located. Valuation allowances will be subject to change in each future reporting period as a result of changes in one or more of these factors. Changes in the geographic mix or estimated level of annual income before taxes can affect the overall effective tax rate. \nWe apply an estimated annual effective tax rate to our quarterly operating results to determine the interim provision for income tax expense. A change in judgment that impacts the measurement of a tax position taken in a prior year is recognized as a discrete item in the interim period in which the change occurs. In the event there is a significant unusual or infrequent item recognized in our quarterly operating results, the tax attributable to that item is recorded in the interim period in which it occurs. We release stranded tax effects from Accumulated other comprehensive loss using the specific identification approach for our defined benefit plans and the portfolio approach for other items. \nTable of Contents\nACCENTURE\n 2025 FORM 10-K\nItem 7. Management's Discussion and Analysis of Financial Condition and Results of Operations\n35\nNo taxes have been provided on undistributed foreign earnings that are planned to be indefinitely reinvested. If future events, including material changes in estimates of cash, working capital and long-term investment requirements, necessitate that these earnings be distributed, an additional provision for taxes may apply, which could materially affect our future effective tax rate. We currently do not foresee any event that would require us to distribute these indefinitely reinvested earnings. For additional information, see Note 11 (Income Taxes) to our Consolidated Financial Statements under Item 8, “Financial Statements and Supplementary Data.”\nAs a matter of course, we are regularly audited by various taxing authorities, and sometimes these audits result in proposed assessments where the ultimate resolution may result in us owing additional taxes. We establish tax liabilities or reduce tax assets when, despite our belief that our tax return positions are appropriate and supportable under local tax law, we believe we may not succeed in realizing the tax benefit of certain positions if challenged. In evaluating a tax position, we determine whether it is more likely than not that the position will be sustained upon examination, including resolution of any related appeals or litigation processes, based on the technical merits of the position. Our estimate of the ultimate tax liability contains assumptions based on past experiences, judgments about potential actions by taxing jurisdictions as well as judgments about the likely outcome of issues that have been raised by taxing jurisdictions. The tax position is measured at the largest amount of benefit that is greater than 50 percent likely of being realized upon settlement. We evaluate tax positions each quarter and adjust the related tax liabilities or assets in light of changing facts and circumstances, such as the progress of a tax audit or the expiration of a statute of limitations. We believe the estimates and assumptions used to support our evaluation of tax positions are reasonable. However, final determinations of prior-year tax liabilities, either by settlement with tax authorities or expiration of statutes of limitations, could be materially different from estimates reflected in assets and liabilities and historical income tax provisions. The outcome of these final determinations could have a material effect on our income tax provision, net income, or cash flows in the period in which that determination is made. We believe our tax positions comply with applicable tax law and that we have adequately accounted for these positions.\nRevenues by Segment/Geographic Market \nOur three reportable operating segments are our geographic markets, the Americas, EMEA and Asia Pacific. In addition to reporting revenues by geographic market and industry group, we also report revenues by two types of work: consulting and managed services, which represent the services sold by our geographic markets. Consulting revenues, which include strategy, management and technology consulting and technology integration consulting, reflect a finite, distinct project or set of projects with a defined outcome and typically a defined set of specific deliverables. Managed services revenues typically reflect ongoing, repeatable services or capabilities provided to transition, run and/or manage operations of client systems or business functions.  \nFrom time to time, our geographic markets work together to sell and implement certain contracts. The resulting revenues and costs from these contracts may be apportioned among the participating geographic markets. Generally, operating expenses for each geographic market have similar characteristics and are subject to the same factors, pressures and challenges. However, the economic environment and its effects on the industries served by our geographic markets affect revenues and operating expenses within our geographic markets to differing degrees. The mix between consulting and managed services is not uniform among our geographic markets. Local currency fluctuations also tend to affect our geographic markets differently, depending on the geographic concentrations and locations of their businesses. \nWhile we provide discussion about our results of operations below, we cannot measure how much of our revenue growth in a particular period is attributable to changes in price or volume. Management does not track standard measures of unit or rate volume. Instead, our measures of volume and price are extremely complex, as each of our services contracts is unique, reflecting a customized mix of specific services that does not fit into standard comparability measurements. Revenue for our services is a function of the nature of each service to be provided, the skills required and the outcome sought, as well as estimated cost, risk, contract terms and other factors. \nTable of Contents\nACCENTURE\n 2025 FORM 10-K\nItem 7. Management's Discussion and Analysis of Financial Condition and Results of Operations\n36\nResults of Operations for Fiscal 2025 Compared to Fiscal 2024 \nRevenues\nRevenues by geographic market, industry group and type of work are as follows: \n  \nFiscal\nPercent\nIncrease (Decrease)\nU.S. \nDollars\nPercent\nIncrease (Decrease)\nLocal\nCurrency\n(in millions of U.S. dollars)\n2025\n2024\nGeographic Markets\nAmericas (1)\n$\n35,057 \n$\n32,552 \n8 \n%\n9 \n%\nEMEA\n24,644 \n22,818 \n8 \n6 \nAsia Pacific (1)\n9,972 \n9,526 \n5 \n4 \nTotal Revenues\n$\n69,673\n \n$\n64,896\n \n7\n \n%\n7\n \n%\nIndustry Groups\nCommunications, Media & Technology\n$\n11,454 \n$\n10,837 \n6 \n%\n6 \n%\nFinancial Services\n12,774 \n11,610 \n10 \n10 \nHealth & Public Service\n14,763 \n13,841 \n7 \n6 \nProducts\n21,197 \n19,554 \n8 \n8 \nResources\n9,485 \n9,054 \n5 \n5 \nTotal Revenues\n$\n69,673\n \n$\n64,896\n \n7\n \n%\n7\n \n%\nType of Work\nConsulting\n$\n35,107 \n$\n33,195 \n6 \n%\n5 \n%\nManaged Services\n34,566 \n31,701 \n9 \n9 \nTotal Revenues\n$\n69,673\n \n$\n64,896\n \n7\n \n%\n7\n \n%\n(1)\nDuring the first quarter of fiscal 2025, our Latin America market unit moved from Growth Markets to North America. With this change, North America became the Americas market and Growth Markets became the Asia Pacific market. Prior period amounts have been reclassified to conform with the current period presentation.\n.\nGeographic Markets \nThe following revenues commentary discusses the primary drivers of local currency revenue changes by geographic market for fiscal 2025 compared to fiscal 2024: \n•\nAmericas revenues increased 9% in local currency, led by growth in Banking & Capital Markets, Industrials and Software & Platforms. Revenue growth was driven by the United States.\n•\nEMEA revenues increased 6% in local currency, led by growth in Public Service, Life Sciences, Insurance, Health and Consumer Goods, Retail & Travel Services. Revenue growth was driven by the United Kingdom and Germany, partially offset by a decline in France.\n•\nAsia Pacific revenues increased 4% in local currency, led by growth in Utilities, Banking & Capital Markets, Public Service and Insurance, partially offset by a decline in Chemicals & Natural Resources. Revenue growth was driven by Japan and Australia, partially offset by a decline in Singapore.\nOperating Expenses \nOperating expenses for fiscal 2025 increased $4,147 million over fiscal 2024, and increased as a percentage of revenues to 85.3% from 85.2% in fiscal 2024.\nThe primary categories of operating expenses include Cost of services, Sales and marketing and General and administrative costs. Cost of services is primarily driven by the cost of people serving our clients, which consists mainly of compensation and other payroll costs, as well as non-payroll costs such as subcontractors, facilities, technology and travel. Cost of services and the related gross margin may be impacted by several factors, including contract profitability, which includes the pricing on the work that we sell, as well as by the investments we make in our business and our people, such as research and development to build assets, platforms and industry and functional solutions, learning and professional development and strategic acquisitions. Sales and marketing costs are driven primarily by compensation costs for business development activities; marketing- and advertising-related activities; and certain acquisition-related costs. General and administrative costs primarily include costs for people that are non-client-facing, information systems, office space and certain acquisition-related costs.\nTable of Contents\nACCENTURE\n 2025 FORM 10-K\nItem 7. Management's Discussion and Analysis of Financial Condition and Results of Operations\n37\nOperating expenses by category are as follows:\nFiscal\n(in millions of U.S. dollars)\n2025\n2024\nIncrease \n (Decrease)\nOperating Expenses\n$\n59,447\n \n85.3\n \n%\n$\n55,301\n \n85.2\n \n%\n$\n4,147\n \nCost of services\n47,438 \n68.1 \n43,734 \n67.4 \n3,703 \nSales and marketing\n7,043 \n10.1 \n6,847 \n10.6 \n197 \nGeneral and administrative costs\n4,351 \n6.2 \n4,281 \n6.6 \n70 \nBusiness optimization costs\n615 \n0.9 \n438 \n0.7 \n177 \nAmounts in table may not total due to rounding.\nCost of Services \nCost of services for fiscal 2025 increased $3,703 million, or 8%, over fiscal 2024, and increased as a percentage of revenues to 68.1% over 67.4% during this period. Gross margin for fiscal 2025 decreased as a percentage of revenues to 31.9% from 32.6% during fiscal 2024. The decrease in gross margin was primarily due to higher payroll costs.\nSales and Marketing\nSales and marketing expense for fiscal 2025 increased $197 million, or 3%, over fiscal 2024, and decreased as a percentage of revenues to 10.1% from 10.6% during this period due to lower payroll and non-payroll costs.\nGeneral and Administrative Costs \nGeneral and administrative costs for fiscal 2025 increased $70 million, or 2%, over fiscal 2024, and decreased as a percentage of revenues to 6.2% from 6.6% during this period primarily due to lower payroll costs.\nBusiness Optimization Costs\nDuring the fourth quarter of fiscal 2025, we initiated business optimization actions and recorded $615 million in related costs, which includes $344 million related to a talent rotation that we are making in a compressed timeline, as well as asset impairments of approximately $271 million primarily related to the divestiture of two acquisitions that are no longer aligned with our strategic priorities. During fiscal 2024, we recorded business optimization costs of $438 million associated with actions initiated in fiscal 2023 and completed in fiscal 2024, primarily for employee severance. For additional information, see Note 1 (Summary of Significant Accounting Policies) to our Consolidated Financial Statements under Item 8, “Financial Statements and Supplementary Data.”\nNon-GAAP Financial Measures\nWe have presented operating income, operating margin, effective tax rate and diluted earnings per share on a non-GAAP or \n“\nadjusted\n”\n basis exclu\nding the business optimization costs recorded in fiscal 2025 and 2024 as we believe doing so facilitates understanding as to the impact of these items and our performance in comparison to the prior periods. While we believe that this non-GAAP financial information is useful in evaluating our operations, this information should be considered as supplemental in nature and not as a substitute for the related financial information prepared in accordance with GAAP. \nOperating Income and Operating Margin \nOperating income and operating margin for each of the geographic markets is as follows: \n  \nFiscal\n  \n2025\n2024\n(in millions of U.S. dollars)\nOperating\nIncome\nOperating\nMargin\nOperating\nIncome\nOperating\nMargin\nIncrease \n(Decrease)\nAmericas (1)\n$\n5,324 \n15 \n%\n$\n5,080 \n16 \n%\n$\n245 \nEMEA \n3,091 \n13 \n2,804 \n12 \n287 \nAsia Pacific (1)\n1,810 \n18 \n1,713 \n18 \n98 \nTotal\n$\n10,226\n \n14.7\n \n%\n$\n9,596\n \n14.8\n \n%\n$\n630\n \nAmounts in table may not total due to rounding.\n(1)\nDuring the first quarter of fiscal 2025, our Latin America market unit moved from Growth Markets to North America. With this change, North America became the Americas market and Growth Markets became the Asia Pacific market. Prior period amounts have been reclassified to conform with the current period presentation.\nTable of Contents\nACCENTURE\n 2025 FORM 10-K\nItem 7. Management's Discussion and Analysis of Financial Condition and Results of Operations\n38\nOperating income for fiscal 2025 increased $630 million, or 7%, compared with fiscal 2024. Operating margin for fiscal 2025 was 14.7%, compared with 14.8% for fiscal 2024. \nGeographic Markets\n    \nWe estimate that the aggregate percentage impact of foreign currency exchange rates on our operating income during fiscal 2025 was similar to that disclosed for revenue for each geographic market. Additionally, operating costs for our geographic markets increased in line with revenues. The commentary below provides insight into other factors affecting geographic market performance and operating income for fiscal 2025 compared with fiscal 2024: \n•\nAmericas operating income increased due to revenue growth, partially offset by higher business optimization costs.\n•\nEMEA operating income increased due to revenue growth and lower business optimization costs.\n•\nAsia Pacific operating income increased \ndue to revenue growth and lower business optimization costs.\nOperating Income and Operating Margin Excluding Business Optimization Costs (Non-GAAP)\nThe business optimization costs reduced operating margin for fiscal 2025 and fiscal 2024 by 90 and 70 basis points, respectively. Adjusted operating margin for fiscal 2025 was 15.6% compared to adjusted operating margin for fiscal 2024 of 15.5%.\nFiscal\n  \n2025\n2024\n(in millions of U.S. dollars)\nOperating\nIncome (GAAP)\nBusiness\nOptimization (1)\nOperating\nIncome (Non-GAAP)\nOperating\nMargin \n(Non-GAAP)\nOperating\nIncome (GAAP)\nBusiness\nOptimization (2)\nOperating\nIncome (Non-GAAP)\nOperating\nMargin \n(Non-GAAP)\nIncrease\n(Decrease)\nAmericas (3)\n$\n5,324 \n$\n420 \n$\n5,745 \n16 \n%\n$\n5,080 \n$\n83 \n$\n5,163 \n16 \n%\n$\n582 \nEMEA \n3,091 \n132 \n3,223 \n13 \n2,804 \n249 \n3,052 \n13 \n171 \nAsia Pacific (3)\n1,810 \n63 \n1,873 \n19 \n1,713 \n107 \n1,819 \n19 \n54 \nTotal\n$\n10,226\n \n$\n615\n \n$\n10,841\n \n15.6\n \n%\n$\n9,596\n \n$\n438\n \n$\n10,034\n \n15.5\n \n%\n$\n807\n \nAmounts in table may not total due to rounding.\n(1)\nCosts recorded in connection with business optimization actions initiated in fiscal 2025, including $344 million for employee severance associated with headcount reductions we are making in a compressed timeline and $271 million for asset impairments primarily related to the divestiture of two acquisitions in the Americas that are no longer aligned with our strategic priorities. \n(2)\nCosts recorded in connection with business optimization actions initiated in fiscal 2023 and completed in fiscal 2024, primarily for employee severance.\n(3)\nDuring the first quarter of fiscal 2025, our Latin America market unit moved from Growth Markets to North America. With this change, North America became the Americas market and Growth Markets became the Asia Pacific market. Prior period amounts have been reclassified to conform with the current period presentation.  \nInterest Income\nInterest income for fiscal 2025 was $336 million, an increase of $64 million, or 24%, over fiscal 2024. The increase was primarily due to a higher average cash balance.\nInterest\n \nExpense\nInterest expense for fiscal 2025 was $229 million, an increase of $170 million over fiscal 2024. The increase was primarily due to an increase in long-term debt.\nOther Income (Expense), net\nOther income (expense), net primarily consists of foreign currency gains and losses, non-operating components of pension expense, as well as gains and losses associated with our investments. During fiscal 2025, Other income (expense), net decreased $47 million, or 43%, from fiscal 2024, primarily due to higher gains on investments.\nIncome Tax Expense \nThe effective tax rate for fiscal 2025 was 23.7%, compared with 23.5% for fiscal 2024.\nIncome Tax Expense Excluding Business Optimization Costs (Non-GAAP)\nExcluding the business optimization costs of $615 million and related reduction in tax expense of $126 million, our adjusted effective tax rate was 23.6% for fiscal 2025. Excluding the business optimization costs of $438 million and related reduction in tax expense of $111 million, our adjusted effective tax rate was 23.6% for fiscal 2024.\nTable of Contents\nACCENTURE\n 2025 FORM 10-K\nItem 7. Management's Discussion and Analysis of Financial Condition and Results of Operations\n39\nNet Income Attributable to Noncontrolling Interests\nNet income attributable to noncontrolling interests reflects the income earned or expense incurred attributable to the equity interest that some current and former members of Accenture Leadership and their permitted transferees have in our Accenture Canada Holdings Inc. subsidiary. See “Business—Organizational Structure.” Noncontrolling interests also include amounts primarily attributable to noncontrolling shareholders in our Avanade Inc. subsidiary. Net income attributable to Accenture plc represents the income attributable to the shareholders of Accenture plc. \nEarnings Per Share \nDiluted earnings per share were $12.15 for fiscal 2025, compared with $11.44 for fiscal 2024. For information regarding our earnings per share calculations, see Note 3 (Earnings Per Share) to our Consolidated Financial Statements under Item 8, “Financial Statements and Supplementary Data.” \nEarnings Per Share Excluding Business Optimization Costs (Non-GAAP)\nThe business optimization costs of $489 million and $327 million, net of related taxes, decreased diluted earnings per share by $0.78 and $0.51 for fiscal 2025 and fiscal 2024, respectively. Adjusted diluted earnings per share were $12.93 and $11.95 for fiscal 2025 and fiscal 2024, respectively.\nFiscal\n2024 As Reported\n$\n11.44\n \nBusiness optimization costs\n0.69 \nTax effect of business optimization costs (1)\n(0.18)\n2024 As Adjusted\n$\n11.95\n \n2025 As Reported\n$\n12.15\n \nBusiness optimization costs\n0.98 \nTax effect of business optimization costs (1)\n(0.20)\n2025 As Adjusted\n$\n12.93\n \n(1)\nThe income tax effect of business optimization costs includes both the current and deferred income tax impact and was calculated by using the relevant tax rate of the country where the adjustments were recorded.\nThe increase in adjusted diluted earnings per share for fiscal 2025 compared to fiscal 2024 is due to the following factors:\nFiscal\n2024 As Adjusted\n$\n11.95\n \nHigher revenue and operating results\n0.97 \nLower share count\n0.07 \nLower effective tax rate\n0.01 \nLower non-operating income\n(0.07)\n2025 As Adjusted\n$\n12.93\n \nOur operating income and diluted earnings per share are affected by currency exchange rate fluctuations on revenues and costs. Most of our costs are incurred in the same currency as the related revenues. Where practical, we seek to manage foreign currency exposure for costs not incurred in the same currency as the related revenues, such as the costs associated with our global delivery model, by using currency protection provisions in our customer contracts and through our hedging programs. We seek to manage our costs, taking into consideration the residual positive and negative effects of changes in foreign exchange rates on those costs. For more information on our hedging programs, see Foreign Currency Risk under Item 7A, “Quantitative and Qualitative Disclosures About Market Risk” and Note 9 (Financial Instruments) to our Consolidated Financial Statements under Item 8, “Financial Statements and Supplementary Data.”\nResults of Operations for Fiscal 2024 Compared to Fiscal 2023\nOur Annual Report on Form 10-K for the fiscal year ended August 31, 2024 includes a discussion and analysis of our financial condition and results of operations for the year ended August 31, 2023 in Item 7 of Part II, “Management’s Discussion and Analysis of Financial Condition and Results of Operations.”\nTable of Contents\nACCENTURE\n 2025 FORM 10-K\nItem 7. Management's Discussion and Analysis of Financial Condition and Results of Operations\n40\nLiquidity and Capital Resources \nOur primary sources of liquidity are cash flows from operations, available cash reserves, debt capacity available under variou\ns credit facilities and other borrowings. We could raise additional funds through other public or private debt or equity financings. We may use our available or additional funds to, among other things:\n•\nfacilitate purchases, redemptions and exchanges of shares and pay dividends;\n•\nacquire complementary businesses or technologies;\n•\ntake advantage of opportunities, including more rapid expansion;\n•\ndevelop new solutions and services; or\n•\nrepay outstanding borrowings and other debt.\nSee Note 10 (Borrowings and Indebtedness) to our Consolidated Financial Statements under Item 8, “Financial Statements and Supplementary Data” for further information regarding our outstanding borrowings and other debt.\nAs of August 31, 2025, Cash and cash equivalents were $11.5 billion, compared with $5.0 billion as of \nAugust 31, 2024. \nCash flows from operating, investing and financing activities, as reflected in our Consolidated Cash Flows Statements, are summarized in the following table: \n  \nFiscal\nChange\n(in millions of U.S. dollars)\n2025\n2024\nNet cash provided by (used in):\nOperating activities\n$\n11,474 \n$\n9,131 \n$\n2,343 \nInvesting activities\n(2,020)\n(7,062)\n5,042 \nFinancing activities\n(2,948)\n(6,064)\n3,115 \nEffect of exchange rate changes on cash and cash equivalents\n(32)\n(46)\n14 \nNet increase (decrease) in cash and cash equivalents\n$\n6,474\n \n$\n(4,041)\n$\n10,515\n \nAmounts in table may not total due to rounding.\nOperating activities:\n The $2,343 million increase in operating cash flows was primarily due to higher net income and lower cash outflows for certain compensation payments compared to the prior year.\nInvesting activities: \nThe $5,042 million decrease in cash used was primarily due to lower spending on business acquisitions. For additional information, see Note 6 (Business Combinations and Dispositions) to our Consolidated Financial Statements under Item 8, “Financial Statements and Supplementary Data.”\nFinancing activities:\n The $3,115 million decrease in cash used was primarily due to higher net proceeds from borrowings. For additional information, see Note 14 (Shareholders’ Equity) to our Consolidated Financial Statements under Item 8, “Financial Statements and Supplementary Data.”\nWe believe that our current and longer-term working capital, investments and other general corporate funding requirements will be satisfied for the next twelve months and thereafter through cash flows from operations and, to the extent necessary, from our borrowing facilities and future financial market activities.\nSubstantially all of our cash is held in jurisdictions where there are no regulatory restrictions or material tax effects on the free flow of funds. Domestic cash inflows for our Irish parent, principally dividend distributions from lower-tier subsidiaries, have been sufficient to meet our historic cash requirements, and we expect this to continue into the future.\nBorrowings and Indebtedness\nOn September 30, 2024, we filed a registration statement on Form S-3, pursuant to which Accenture plc’s wholly owned finance subsidiaries Accenture Capital and Accenture Global Capital DAC may issue debt securities. As of \nAugust 31, 2025\n, we had outstanding long-term debt in the form of senior unsecured notes issued by Accenture Capital in an aggregate principal amount of $5 billion, which mature from 2027 through 2034. Accenture plc fully and unconditionally guarantees these notes, as well as all future debt securities that may be issued by these entities.\nFor additional information regarding our outstanding borrowings, credit facilities and other debt, see Note 10 (Borrowings and Indebtedness) to our Consolidated Financial Statements under Item 8, “Financial Statements and supplementary Data.”\nTable of Contents\nACCENTURE\n 2025 FORM 10-K\nItem 7. Management's Discussion and Analysis of Financial Condition and Results of Operations\n41\nShare Purchases and Redemptions \nWe intend to continue to use a significant portion of cash generated from operations for share repurchases during fiscal 2026. The number of shares ultimately repurchased under our open-market share purchase program may vary depending on numerous factors, including, without limitation, share price and other market conditions, our ongoing capital allocation planning, the levels of cash and debt balances, other demands for cash, such as acquisition activity, general economic and/or business conditions, and board and management discretion. Additionally, as these factors may change over the course of the year, the amount of share repurchase activity during any particular period cannot be predicted and may fluctuate from time to time. Share repurchases may be made from time to time through open-market purchases, in respect of purchases and redemptions of Accenture Canada Holdings Inc. exchangeable shares, through the use of Rule 10b5-1 plans and/or by other means. The repurchase program may be accelerated, suspended, delayed or discontinued at any time, without notice. For additional information, see Note 14 (Shareholders’ Equity) to our Consolidated Financial Statements under Item 8, “Financial Statements and Supplementary Data.” \nSubsequent Events\nSee Note 14 (Shareholders’ Equity) to our Consolidated Financial Statements under Item 8, “Financial Statements and Supplementary Data.” \nObligations and Commitments\nAs of August 31, 2025, we had commitments of $3 billion related to cloud hosting arrangements, software subscriptions, information technology services and other obligations in the ordinary course of business that we cannot cancel or where we would be required to pay a termination fee in the event of cancellation. Payments under these commitments are estimated to be made as follows:\n(in millions of U.S. dollars)\nPayments (1)\nLess than 1 year\n$\n1,154 \n1-3 years\n1,275 \n3-5 years\n513 \nMore than 5 years\n38 \nTotal\n$\n2,980\n \n(1)\nAmounts do not include recourse that we may have to recover termination fees or penalties from clients. \nFor information about borrowing facilities and leases, see Note 10 (Borrowings and Indebtedness) and Note 8 (Leases) to our Consolidated Financial Statements under Item 8, “Financial Statements and Supplementary Data.” \nOff-Balance Sheet Arrangements \nIn the normal course of business and in conjunction with some client engagements, we have entered into contractual arrangements through which we may be obligated to indemnify clients with respect to certain matters. To date, we have not been required to make any significant payment under any of these arrangements. For further discussion of these transactions, see Note 15 (Commitments and Contingencies) to our Consolidated Financial Statements under Item 8, “Financial Statements and Supplementary Data.” \nNew Accounting Pronouncements\nSee Note 1 (Summary of Significant Accounting Policies) to our Consolidated Financial Statements under Item 8, “Financial Statements and Supplementary Data.” \nTable of Contents\nACCENTURE\n 2025 FORM 10-K",
  "item2": null
}