{
  "source_file": "acn-20250531.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations \n23\nItem 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations \nThe following discussion and analysis should be read in conjunction with our Consolidated Financial Statements and related Notes included elsewhere in this Quarterly Report on Form 10-Q and in our Annual Report on Form 10-K for the year ended August 31, 2024, and with the information under the headings “Management’s Discussion and Analysis of Financial Condition and Results of Operations” in our Annual Report on Form 10-K for the year ended August 31, 2024 (“Annual Report”), and “Risk Factors” in our Annual Report as updated in our Quarterly Report on Form 10-Q for the quarter ended February 28, 2025. \nWe use the terms “Accenture,” “we,” “our” and “us” in this report to refer to Accenture plc and its subsidiaries. All references to years, unless otherwise noted, refer to our fiscal year, which ends on August 31. For example, a reference to “fiscal 2025” means the 12-month period that will end on August 31, 2025. All references to quarters, unless otherwise noted, refer to the quarters of our fiscal year. \nWe use the term “in local currency” so that certain financial results may be viewed without the impact of foreign currency exchange rate fluctuations, thereby facilitating period-to-period comparisons of business performance. Financial results “in local currency” are calculated by restating current period activity into U.S. dollars using the comparable prior year period’s foreign currency exchange rates. This approach is used for all results where the functional currency is not the U.S. dollar. \nDisclosure Regarding Forward-Looking Statements \nThis Quarterly Report on Form 10-Q contains forward-looking statements within the meaning of Section 27A of the Securities Act of 1933 and Section 21E of the Securities Exchange Act of 1934 (the “Exchange Act”) relating to our operations, results of operations and other matters that are based on our current expectations, estimates, assumptions and projections. Words such as “may,” “will,” “should,” “likely,” “anticipates,” “aspires,” “expects,” “intends,” “plans,” “projects,” “believes,” “estimates,” “positioned,” “outlook,” “goal,” “target,” and similar expressions are used to identify these forward-looking statements. These statements are not guarantees of future performance and involve risks, uncertainties and assumptions that are difficult to predict. Forward-looking statements are based upon assumptions as to future events that may not prove to be accurate. Actual outcomes and results may differ materially from what is expressed or forecast in these forward-looking statements. Risks, uncertainties and other factors that might cause such differences, some of which could be material, include but are not lim\nited to those identified below.\nBusiness Risks\n•\nOur results of operations have been, and may in the future be, adversely affected by volatile, negative or uncertain economic and geopolitical conditions and the effects of these conditions on our clients’ businesses and levels of business activity. \n•\nOur business depends on generating and maintaining client demand for our services and solutions, including through the adaptation and expansion of our services and solutions in response to ongoing changes in technology and offerings, and a significant reduction in such demand or an inability to respond to the evolving technological environment could materially affect our results of operations. \n•\nRisks and uncertainties related to the development and use of AI could harm our business, damage our reputation or give rise to legal or regulatory action.\n•\nIf we are unable to match people and their skills with client demand around the world and attract and retain professionals with strong leadership skills, our business, the utilization rate of our professionals and our results of operations may be materially adversely affected. \n•\nWe face legal, reputational and financial risks from any failure to protect client and/or Accenture data from security incidents or cyberattacks. \n•\nThe markets in which we operate are highly competitive, and we might not be able to compete effectively. \n•\nOur ability to attract and retain business and employees may depend on our reputation in the marketplace. \n•\nIf we do not successfully manage and develop our relationships with key ecosystem partners or if we fail to anticipate and establish new alliances in new technologies, our results of operations could be adversely affected. \nTable of Contents\nACCENTURE\n FORM 10-Q\nItem 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations \n24\nFinancial Risks\n•\nOur profitability could materially suffer due to pricing pressure, if we are unable to remain competitive, if our cost-management strategies are unsuccessful or if we experience delivery inefficiencies or fail to satisfy certain agreed-upon targets or specific service levels. \n•\nChanges in our level of taxes, as well as audits, investigations and tax proceedings, or changes in tax laws or in their interpretation or enforcement, could have a material adverse effect on our effective tax rate, results of operations, cash flows and financial condition. \n•\nOur results of operations could be materially adversely affected by fluctuations in foreign currency exchange rates. \n•\nOur debt obligations could adversely affect our business and financial condition.\n•\nChanges to accounting standards or in the estimates and assumptions we make in connection with the preparation of our consolidated financial statements could adversely affect our financial results. \nOperational Risks\n•\nAs a result of our geographically diverse operations and our strategy to continue to grow in our key markets around the world, we are more susceptible to certain risks.\n•\nIf we are unable to manage the organizational challenges associated with our size, we might be unable to achieve our business objectives.\n•\nWe might not be successful at acquiring, investing in or integrating businesses, entering into joint ventures or divesting businesses.\nLegal and Regulatory Risks\n•\nOur business could be materially adversely affected if we incur legal liability. \n•\nOur work with government clients exposes us to additional risks inherent in the government contracting environment. \n•\nOur global operations expose us to numerous and sometimes conflicting legal and regulatory requirements, and violation of these regulations could harm our business.\n•\nIf we are unable to protect or enforce our intellectual property rights, or if our services or solutions infringe upon the intellectual property rights of others or we lose our ability to utilize the intellectual property of others, our business could be adversely affected.\n•\nWe are incorporated in Ireland and Irish law differs from the laws in effect in the United States and might afford less protection to our shareholders. We may also be subject to criticism and negative publicity related to our incorporation in Ireland.\nFor a more detailed discussion of these factors, see the information under the heading “Risk Factors” in our Annual Report on Form 10-K for the year ended August 31, 2024, as updated in Item 1A, “Risk Factors” in our Quarterly Report on Form 10-Q for the quarter ended February 28, 2025. Our forward-looking statements speak only as of the date of this report or as of the date they are made, and we undertake no obligation to update any forward-looking statements.\nTable of Contents\nACCENTURE\n FORM 10-Q\nItem 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations \n25\nOverview\nAccenture is a leading global professional services company, providing a broad range of services and solutions across Strategy & Consulting, Technology, Operations, Industry X and Song. We serve clients in three geographic markets: the Americas, EMEA (Europe, Middle East and Africa) and Asia Pacific. We combine our strength in technology and leadership in cloud, data and AI with unmatched industry experience, functional expertise and global delivery capability to help the world’s leading businesses, governments and other organizations build their digital core, optimize their operations, accelerate revenue growth and enhance citizen services—creating tangible value at speed and scale.\nOur results of operations are affected by economic conditions, including macroeconomic conditions, the overall inflationary environment and levels of business confidence. We continue to see significant economic and geopolitical uncertainty in many markets around the world, which has impacted and may continue to impact our business. These conditions have slowed the pace and level of client spending, particularly for smaller contracts with a shorter duration and for our consulting services. Clients continue to prioritize large-scale transformations, which convert to revenue over a longer period.\nIn addition, the U.S. administration is seeking to reduce federal spending and the size of the federal workforce under the guidance of the Department of Government Efficiency. We are seeing some impact from these efforts in our federal government business, including delays in new procurements, reductions in price and contract scope, and contract terminations. These changes have not had a material impact on our results of operations or financial condition.\nFor a discussion of risks related to these and other recent developments, see Item 1A, “Risk Factors” in our Annual Report on Form 10-K for the year ended August 31, 2024, as updated in Item 1A, “Risk Factors” in our Quarterly Report on Form 10-Q for the quarter ended February 28, 2025.\nKey Metrics\nKey metrics for the third quarter of fiscal 2025 compared to the third quarter of fiscal 2024 are included below. We have presented operating income, operating margin, effective tax rate and diluted earnings per share for the third quarter of fiscal 2024 on a non-GAAP or “adjusted” basis to exclude the impact of $77 million in business optimization costs recorded during the quarter, as discussed further in our Results of Operations. \n•\nRevenues of $17.7 billion,\n an increase of 8% in U.S. dollars and\n \n7% in local currency;\n•\nNew bookings of $19.7 billion,\n a decrease of 6% in U.S. dollars and 7% in local currency;\n•\nOperating margin of 16.8%,\n compared to operating margin of 16.0% and adjusted operating margin of 16.4% in the third quarter of fiscal 2024;\n•\nDiluted earnings per share of $3.49,\n a 15% increase over diluted earnings per share of $3.04 and a 12% increase over adjusted earnings per share of $3.13 in the third quarter of fiscal 2024; and\n•\nCash returned to shareholders of $2.7 billion,\n including dividends of $924 million and share purchases of $1.8 billion. \nTable of Contents\nACCENTURE\n FORM 10-Q\nItem 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations \n26\nRevenues\nThree Months Ended\nPercent \nIncrease\n(Decrease)\nU.S. \nDollars\nPercent \nIncrease\n(Decrease) \nLocal \nCurrency\nPercent of Revenues \nfor the Three Months Ended\n(in billions of U.S. dollars)\nMay 31, 2025\nMay 31, 2024\nMay 31, 2025\nMay 31, 2024\nGeographic Markets\nAmericas (1)\n$\n9.0 \n$\n8.3 \n8 \n%\n9 \n%\n51 \n%\n50 \n%\nEMEA\n6.2 \n5.8 \n8 \n6 \n35 \n35 \nAsia Pacific (1)\n2.5 \n2.4 \n5 \n4 \n14 \n15 \nTotal Revenues\n$\n17.7\n \n$\n16.5\n \n8\n \n%\n7\n \n%\n100\n \n%\n100\n \n%\nIndustry Groups\nCommunications, Media & Technology \n$\n2.9 \n$\n2.8 \n5 \n%\n5 \n%\n16 \n%\n17 \n%\nFinancial Services\n3.3 \n2.9 \n13 \n13 \n18 \n18 \nHealth & Public Service\n3.8 \n3.5 \n7 \n7 \n21 \n21 \nProducts\n5.3 \n5.0 \n7 \n7 \n30 \n30 \nResources \n2.4 \n2.3 \n5 \n4 \n14 \n14 \nTotal Revenues\n$\n17.7\n \n$\n16.5\n \n8\n \n%\n7\n \n%\n100\n \n%\n100\n \n%\nType of Work\nConsulting\n$\n9.0 \n$\n8.5 \n7 \n%\n6 \n%\n51 \n%\n51 \n%\nManaged Services\n8.7 \n8.0 \n9 \n9 \n49 \n49 \nTotal Revenues\n$\n17.7\n \n$\n16.5\n \n8\n \n%\n7\n \n%\n100\n \n%\n100\n \n%\nAmounts in table may not total due to rounding.\n(1)\nDuring the first quarter of fiscal 2025, our Latin America market unit moved from Growth Markets to North America. With this change, North America became the Americas market and Growth Markets became the Asia Pacific market. Prior period amounts have been reclassified to conform with the current period presentation.\nRevenues for the third quarter of fiscal 2025 increased 8% in U.S. dollars and 7% in local currency compared to the third quarter of fiscal 2024. During the third quarter of fiscal 2025, revenue growth in local currency was very strong in the Americas, strong in EMEA and solid in Asia Pacific. We experienced local currency revenue growth that was very strong in Financial Services, strong in Health & Public Service and Products and solid in Communications, Media & Technology and Resources. Revenue growth in local currency was very strong in managed services and strong in consulting. While the business environment remained competitive, pricing improved in several areas of our business. We define pricing as the contract profitability or margin on the work that we sell.\nIn our consulting business, revenues for the third quarter of fiscal 2025 increased 7% in U.S. dollars and 6% in local currency compared to the third quarter of fiscal 2024. Consulting revenue growth in local currency for the third quarter of fiscal 2025 was driven by strong growth in the Americas and EMEA and modest growth in Asia Pacific. Our consulting revenue continues to be driven by helping our clients accelerate their reinvention, in particular technology, data, and AI led digital transformations. This includes moving to the cloud, embedding security and responsible AI across the enterprise and leveraging our change capabilities to help our clients build new skills and drive the successful adoption of new processes and technologies. In addition, clients continue to be focused on initiatives designed to deliver cost savings and supply chain and operational resilience, as well as projects to accelerate growth and improve customer experiences. While we continue to experience demand for these services, we are seeing a slower pace and level of client spending, particularly for smaller contracts with a shorter duration.\nIn our managed services business, revenues for the third quarter of fiscal 2025 increased 9% in both U.S. dollars and local currency compared to the third quarter of fiscal 2024. Managed services revenue growth in local currency for the third quarter of fiscal 2025 was driven by very strong growth in the Americas and strong growth in EMEA and Asia Pacific. We continue to experience growing demand to assist clients with application modernization and maintenance, cloud enablement and cybersecurity-as-a-service. In addition, clients continue to be focused on transforming their operations through technology, data and AI, and leveraging our digital platforms and talent to drive productivity and operational cost savings.\nAs we are a global company, our revenues are denominated in multiple currencies and may be significantly affected by currency exchange rate fluctuations. While a significant portion of our revenues are in U.S. dollars, the majority of our revenues are denominated in other currencies, including the Euro, Japanese yen and U.K. pound. There continues to be volatility in foreign currency exchange rates. Unfavorable fluctuations in foreign currency exchange rates have had and could in the future have a material effect on our financial results. If the U.S. dollar weakens against other currencies, resulting in favorable currency translation, our revenues, revenue growth and results of operations in U.S. dollars may be higher. If the U.S. dollar strengthens against other currencies, resulting in unfavorable currency translation, our revenues, revenue growth and results of operations in U.S. dollars may be lower. The U.S. dollar weakened against various currencies during the third quarter of fiscal 2025 compared to the third quarter of fiscal 2024, resulting in favorable currency translation and U.S. dollar revenue growth that was approximately 0.5% higher than our revenue growth in local currency. The U.S. dollar strengthened against various currencies during the nine months ended May 31, 2025 compared to the nine months ended May 31, 2024, resulting in unfavorable\nTable of Contents\nACCENTURE\n FORM 10-Q\nItem 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations \n27\ncurrency translation and U.S. dollar revenue growth that was approximately 0.5% lower than our revenue growth in local currency. Assuming that exchange rates stay within recent ranges for the remainder of fiscal 2025, we estimate that our full fiscal 2025 revenue growth in U.S. dollars will be approximately equal to our revenue growth in local currency.\nPeople Metrics\nUtilization\nWorkforce\nAnnualized Voluntary Attrition\n92%\n791,000\n16%\nconsistent with the third quarter of fiscal 2024\ncompared to approximately 750,000 as of May 31, 2024\ncompared to 14% in the third quarter of fiscal 2024\nUtilization for the third quarter of fiscal 2025 was 92%, consistent with the third quarter of fiscal 2024. We hire to meet current and projected future demand. We proactively plan and manage the size and composition of our workforce and take actions as needed to address changes in the anticipated demand for our services and solutions, given that compensation costs are the most significant portion of our operating expenses. Our workforce, the majority of which serves our clients, increased to approximately 791,000 as of May 31, 2025, compared to approximately 750,000 as of May 31, 2024. The year-over-year increase in our workforce reflects hiring for the skills needed to support demand for our services and solutions, as well as people added in connection with acquisitions.\nFor the third quarter of fiscal 2025, annualized attrition, excluding involuntary terminations, was 16%, up from 14% in the third quarter of fiscal 2024. We evaluate voluntary attrition, adjust levels of new hiring and use involuntary terminations as a means to keep our supply of skills and resources in balance with changes in client demand.\nIn addition, we adjust compensation to provide market relevant pay based on the skills of our people and locations where we operate. We also consider a variety of factors, including the macroeconomic environment, in making our decisions around pay and benefits. We strive to adjust pricing as well as drive cost and delivery efficiencies, such as changing the mix of people and utilizing technology, to reduce the impact of compensation increases on our margin and contract profitability.\nOur ability to grow our revenues and maintain or increase our margin could be adversely affected if we are unable to: match people and skills with the types or amounts of services and solutions clients are demanding; recover or offset increases in compensation; deploy our employees globally on a timely basis; manage attrition; and/or effectively assimilate new employees.\nNew Bookings\nThree Months Ended\nPercent \nIncrease\n(Decrease)\nU.S. \nDollars\nPercent\n Increase\n(Decrease) \nLocal\n Currency\nNine Months Ended\nPercent \nIncrease\n(Decrease)\nU.S. \nDollars\nPercent\n Increase\n(Decrease) \nLocal\n Currency\n(in billions of U.S. dollars)\nMay 31, 2025\nMay 31, 2024\nMay 31, 2025\nMay 31, 2024\nConsulting\n$\n9.1 \n$\n9.3 \n(2)\n%\n(3)\n%\n$\n28.8 \n$\n28.4 \n1 \n%\n2 \n%\nManaged Services\n10.6 \n11.8 \n(10)\n(10)\n30.5 \n32.7 \n(6)\n(5)\nTotal New Bookings\n$\n19.7\n \n$\n21.1\n \n(6)\n%\n(7)\n%\n$\n59.3\n \n$\n61.1\n \n(3)\n%\n(2)\n%\nWe provide information regarding our new bookings, which include new contracts, including those acquired through acquisitions, as well as renewals, extensions and changes to existing contracts, because we believe doing so provides useful trend information regarding changes in the volume of our new business over time. New bookings can vary significantly quarter to quarter depending in part on the timing of the signing of a small number of large managed services contracts. The types of services and solutions clients are demanding and the pace and level of their spending may impact the conversion of new bookings to revenues. For example, managed services bookings, which are typically for multi-year contracts, generally convert to revenue over a longer period of time compared to consulting bookings.\nInformation regarding our new bookings is not comparable to, nor should it be substituted for, an analysis of our revenues over time. New bookings involve estimates and judgments. There are no third-party standards or requirements governing the calculation of bookings. We do not update our new bookings for material subsequent terminations or reductions related to bookings originally recorded in prior fiscal years. New bookings are recorded using then-existing foreign currency exchange rates and are not subsequently adjusted for foreign currency exchange rate fluctuations. \nThe majority of our contracts are terminable by the client on short notice with little or no termination penalties, and some without notice. Only the non-cancelable portion of these contracts is included in our remaining performance obligations disclosed in Note 2 (Revenues) to our Consolidated Financial Statements under Item 1, “Financial Statements.” Accordingly, a significant portion of what we consider contract bookings is not included in our remaining performance obligations.\nTable of Contents\nACCENTURE\n FORM 10-Q\nItem 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations \n28\nResults of Operations for the Three and Nine Months Ended May 31, 2025 Compared to the Three and Nine Months Ended May 31, 2024\nRevenues\nRevenues by geographic market, industry group and type of work are as follows: \n  \nThree Months Ended\nPercent\nIncrease\n(Decrease)\nU.S.\nDollars\nPercent\nIncrease\n(Decrease)\nLocal\nCurrency\nNine Months Ended\nPercent\nIncrease\n(Decrease)\nU.S.\nDollars\nPercent\nIncrease\n(Decrease)\nLocal\nCurrency\n(in millions of U.S. dollars)\nMay 31, 2025\nMay 31, 2024\nMay 31, 2025\nMay 31, 2024\nGeographic Markets\nAmericas (1)\n$\n8,966 \n$\n8,287 \n8 \n%\n9 \n%\n$\n26,252 \n$\n24,129 \n9 \n%\n10 \n%\nEMEA\n6,232 \n5,777 \n8 \n6 \n18,448 \n17,179 \n7 \n7 \nAsia Pacific (1)\n2,530 \n2,404 \n5 \n4 \n7,377 \n7,182 \n3 \n3 \nTotal\n$\n17,728\n \n$\n16,467\n \n8\n \n%\n7\n \n%\n$\n52,077\n \n$\n48,491\n \n7\n \n%\n8\n \n%\nIndustry Groups\nCommunications, Media & Technology \n$\n2,912 \n$\n2,763 \n5 \n%\n5 \n%\n$\n8,500 \n$\n8,087 \n5 \n%\n6 \n%\nFinancial Services\n3,279 \n2,895 \n13 \n13 \n9,458 \n8,737 \n8 \n9 \nHealth & Public Service\n3,778 \n3,515 \n7 \n7 \n11,199 \n10,227 \n10 \n10 \nProducts\n5,344 \n4,983 \n7 \n7 \n15,821 \n14,605 \n8 \n8 \nResources\n2,415 \n2,310 \n5 \n4 \n7,098 \n6,835 \n4 \n5 \nTotal\n$\n17,728\n \n$\n16,467\n \n8\n \n%\n7\n \n%\n$\n52,077\n \n$\n48,491\n \n7\n \n%\n8\n \n%\nType of Work\nConsulting\n$\n9,007 \n$\n8,457 \n7 \n%\n6 \n%\n$\n26,335 \n$\n24,935 \n6 \n%\n6 \n%\nManaged Services\n8,721 \n8,010 \n9 \n9 \n25,742 \n23,556 \n9 \n10 \nTotal\n$\n17,728\n \n$\n16,467\n \n8\n \n%\n7\n \n%\n$\n52,077\n \n$\n48,491\n \n7\n \n%\n8\n \n%\nAmounts in table may not total due to rounding.\n(1)\nDuring the first quarter of fiscal 2025, our Latin America market unit moved from Growth Markets to North America. With this change, North America became the Americas market and Growth Markets became the Asia Pacific market. Prior period amounts have been reclassified to conform with the current period presentation.\nGeographic Markets\nThe following revenues commentary discusses the primary drivers of local currency revenue changes by geographic market for the three and nine months ended May 31, 2025 compared to the three and nine months ended May 31, 2024:\nAmericas\n•\nThree Months. \nRevenues increased 9% in local currency, led by growth in Banking & Capital Markets, Industrial and Health. Revenue growth was driven by the United States. \n•\nNine Months.\n Revenues increased 10% in local currency, led by growth in Banking & Capital Markets, Industrial, Health and Software & Platforms. Revenue growth was driven by the United States.\nEMEA\n•\nThree Months. \nRevenues increased 6% in local currency, led by growth in Life Sciences, Banking & Capital Markets and Insurance. Revenue growth was driven by the United Kingdom, Germany and Italy.\n•\nNine Months. \nRevenues increased 7% in local currency, led by growth in Public Service, Life Sciences, Health and Consumer Goods, Retail & Travel Services. Revenue growth was driven by the United Kingdom, Italy and Germany, partially offset by a decline in France.\nAsia Pacific\n•\nThree Months. \nRevenues increased 4% in local currency, led by growth in Public Service, Banking & Capital Markets and Insurance, partially offset by a decline in Chemicals & Natural Resources. Revenue growth was driven by Japan and Australia, partially offset by a decline in Singapore.\nTable of Contents\nACCENTURE\n FORM 10-Q\nItem 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations \n29\n•\nNine Months. \nRevenues increased 3% in local currency, led by growth in Utilities, Insurance, Public Service and Health, partially offset by a decline in Chemicals & Natural Resources. Revenue growth was driven by Japan, partially offset by a decline in Singapore.\nOperating Expenses\nOperating expenses for the third quarter of fiscal 2025 increased $909 million, or 7%, compared to the third quarter of fiscal 2024, and decreased as a percentage of revenues to 83.2% from 84.0% during this period. Operating expenses for the nine months ended May 31, 2025 increased $2,652 million, or 6%, compared to the nine months ended May 31, 2024, and decreased as a percentage of revenues to 84.3% from 85.1% during this period.\nThe primary categories of operating expenses include Cost of services, Sales and marketing and General and administrative costs. Cost of services is primarily driven by the cost of people serving our clients, which consists mainly of compensation, subcontractor and other payroll costs, and non-payroll costs such as facilities, technology and travel. Cost of services includes a variety of activities such as: contract delivery; recruiting and training; software development; and integration of acquisitions. Sales and marketing costs are driven primarily by compensation costs for business development activities; marketing- and advertising-related activities; and certain acquisition-related costs. General and administrative costs primarily include costs for people that are non-client-facing, information systems, office space and certain acquisition-related costs.\nOperating expenses by category are as follows:\nThree Months Ended\nNine Months Ended\n(in millions of U.S. dollars)\nMay 31, 2025\nMay 31, 2024\nIncrease\n(Decrease)\nMay 31, 2025\nMay 31, 2024\nIncrease\n(Decrease)\nOperating Expenses\n$\n14,745\n \n83.2\n \n%\n$\n13,836\n \n84.0\n \n%\n$\n909\n \n$\n43,901\n \n84.3\n \n%\n$\n41,248\n \n85.1\n \n%\n$\n2,652\n \nCost of services\n11,901 \n67.1 \n10,968 \n66.6 \n933 \n35,452 \n68.1 \n32,666 \n67.4 \n2,786 \nSales and marketing\n1,762 \n9.9 \n1,750 \n10.6 \n12 \n5,250 \n10.1 \n5,091 \n10.5 \n159 \nGeneral and administrative costs\n1,081 \n6.1 \n1,040 \n6.3 \n42 \n3,198 \n6.1 \n3,159 \n6.5 \n39 \nBusiness optimization costs\n— \n— \n77 \n0.5 \n(77)\n— \n— \n332 \n0.7 \n(332)\nAmounts in table may not total due to rounding.\nCost of Services\nCost of services for the third quarter of fiscal 2025 increased $933 million, or 9%, over the third quarter of fiscal 2024, and increased as a percentage of revenues to 67.1% compared to 66.6% during this period. Gross margin for the third quarter of fiscal 2025 decreased as a percentage of revenues to 32.9% from 33.4% during the third quarter of fiscal 2024. The decrease in gross margin was primarily due to higher labor costs, partially offset by lower non-payroll costs.\nCost of services for the nine months ended May 31, 2025 increased $2,786 million, or 9%, over the nine months ended May 31, 2024, and increased as a percentage of revenues to 68.1% compared to 67.4% during this period. Gross margin for the nine months ended May 31, 2025 decreased as a percentage of revenues to 31.9% from 32.6% during the nine months ended May 31, 2024. The decrease in gross margin was primarily due to higher subcontractor costs.\nSales and Marketing\nSales and marketing expense for the third quarter of fiscal 2025 increased $12 million, or 1%, over the third quarter of fiscal 2024, and decreased as a percentage of revenues to 9.9% from 10.6% during this period primarily due to both lower non-payroll and labor costs. Sales and marketing expense for the nine months ended May 31, 2025 increased $159 million, or 3%, over the nine months ended May 31, 2024, and decreased as a percentage of revenues to 10.1% from 10.5% during this period primarily due to lower labor costs.\nGeneral and Administrative Costs\nGeneral and administrative costs for the third quarter of fiscal 2025 increased $42 million, or 4%, over the third quarter of fiscal 2024, and decreased as a percentage of revenues to 6.1% from 6.3% during this period. General and administrative costs for the nine months ended May 31, 2025 increased $39 million, or 1%, over the nine months ended May 31, 2024, and decreased as a percentage of revenues to 6.1% from 6.5% during this period primarily due to lower labor costs.\nBusiness Optimization Costs\nDuring the second quarter of fiscal 2023, we initiated actions to streamline our operations, transform our non-billable corporate functions and consolidate our office space to reduce costs. We recorded a total of $1.5 billion related to these actions, primarily for employee severance, which have been completed as of August 31, 2024. \nTable of Contents\nACCENTURE\n FORM 10-Q\nItem 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations \n30\nNon-GAAP Financial Measures\nWe have presented operating income, operating margin, effective tax rate and diluted earnings per share on a non-GAAP or \n“\nadjusted\n”\n basis exclu\nding the business optimization costs recorded in fiscal 2024 as we believe doing so facilitates understanding as to the impact of this item and our performance in comparison to the prior periods. While we believe that this non-GAAP financial information is useful in evaluating our operations, this information should be considered as supplemental in nature and not as a substitute for the related financial information prepared in accordance with GAAP.\nOperating Income and Operating Margin \nOperating income and operating margin for each of the geographic markets are as follows: \nThree Months Ended\nNine Months Ended\n  \nMay 31, 2025\nMay 31, 2024\nMay 31, 2025\nMay 31, 2024\n(in millions of U.S. dollars)\nOperating\nIncome\nOperating\nMargin\nOperating\nIncome\nOperating\nMargin\nIncrease\n(Decrease)\nOperating\nIncome\nOperating\nMargin\nOperating\nIncome\nOperating\nMargin\nIncrease\n(Decrease)\nAmericas (1)\n$\n1,720 \n19 \n%\n$\n1,408 \n17 \n%\n$\n312 \n$\n4,337 \n17 \n%\n$\n3,784 \n16 \n%\n$\n553 \nEMEA\n753 \n12 \n750 \n13 \n3 \n2,428 \n13 \n2,102 \n12 \n326 \nAsia Pacific (1)\n510 \n20 \n473 \n20 \n37 \n1,410 \n19 \n1,356 \n19 \n55 \nTotal\n$\n2,983\n \n16.8\n \n%\n$\n2,631\n \n16.0\n \n%\n$\n352\n \n$\n8,176\n \n15.7\n \n%\n$\n7,242\n \n14.9\n \n%\n$\n934\n \nAmounts in table may not total due to rounding.\n(1)\nDuring the first quarter of fiscal 2025, our Latin America market unit moved from Growth Markets to North America. With this change, North America became the Americas market and Growth Markets became the Asia Pacific market. Prior period amounts have been reclassified to conform with the current period presentation.\nOperating income for the third quarter of fiscal 2025 increased $352 million, or 13%, compared with the third quarter of fiscal 2024. Operating margin for the third quarter of fiscal 2025 was 16.8%, compared with 16.0% for the third quarter of fiscal 2024. Operating income for the nine months ended May 31, 2025 increased $934 million, or 13%, compared with the nine months ended May 31, 2024. Operating margin for the nine months ended May 31, 2025 was 15.7%, compared with 14.9% for the nine months ended May 31, 2024.\nGeographic Markets\nWe estimate that the aggregate percentage impact of foreign currency exchange rates on our operating income during the three and nine months ended May 31, 2025 was similar to that disclosed for revenue for each geographic market. Additionally, costs associated with our business optimization actions did not impact fiscal 2025 operating income as the actions were completed in fiscal 2024. The commentary below provides insight into other factors affecting geographic market performance and operating income for the three and nine months ended May 31, 2025 compared with the three and nine months ended May 31, 2024:\nAmericas\n•\nThree Months.\n Operatin\ng income increased primarily due to revenue growth and an increase\n in consulting contract profitability.\n•\nNine Months.\n Operatin\ng income increased primarily due to revenue growth, \npartially offset by a decline in contract profitability.\nEMEA\n•\nThree Months.\n Operatin\ng income was relatively flat, as revenue growth was offset by higher labor costs\n.\n•\nNine Months.\n Operatin\ng income increased \nprimarily due to revenue growth, partially offset by a decline in contract profitability.\nAsia Pacific\n•\nThree Months.\n Opera\nting income increased primarily due to revenue growth.\n•\nNine Months.\n Operating income increased slightly as revenue growth was offset by a decline in contract profitability.\nTable of Contents\nACCENTURE\n FORM 10-Q\nItem 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations \n31\nOperating Income and Operating Margin Excluding Fiscal 2024 Business Optimization Costs (Non-GAAP)\nThe business optimization costs reduced operating margin for the third quarter of fiscal 2024 by 40 basis points\n. Operating margin for the \nthird quarter of fiscal 2025\n was \n16.8%\n compared to adjusted operating margin for the \nthird quarter of fiscal 2024\n of \n16.4%. The business optimization costs reduced operating margin for the nine months ended May 31, 2024 by 70 basis points. Operating margin for the nine months ended May 31, 2025 was 15.7% compared to adjusted operating margin for the nine months ended May 31, 2024 of 15.6%.\nThree Months Ended\n  \nMay 31, 2025\nMay 31, 2024\n(in millions of U.S. dollars)\nOperating\nIncome (GAAP)\nOperating\nMargin \n(GAAP)\nOperating\nIncome (GAAP)\nBusiness\nOptimization (1)\nOperating\nIncome (Non-GAAP)\nOperating\nMargin (Non-GAAP)\nIncrease\n(Decrease)\nAmericas (2)\n$\n1,720 \n19 \n%\n$\n1,408 \n$\n(4)\n$\n1,404 \n17 \n%\n$\n315 \nEMEA\n753 \n12 \n750 \n75 \n825 \n14 \n(72)\nAsia Pacific (2)\n510 \n20 \n473 \n6 \n479 \n20 \n31 \nTotal\n$\n2,983\n \n16.8\n \n%\n$\n2,631\n \n$\n77\n \n$\n2,708\n \n16.4\n \n%\n$\n274\n \nNine Months Ended\n  \nMay 31, 2025\nMay 31, 2024\n(in millions of U.S. dollars)\nOperating\nIncome (GAAP)\nOperating\nMargin \n(GAAP)\nOperating\nIncome (GAAP)\nBusiness\nOptimization (1)\nOperating\nIncome (Non-GAAP)\nOperating\nMargin (Non-GAAP)\nIncrease\n(Decrease)\nAmericas (2)\n$\n4,337 \n17 \n%\n$\n3,784 \n$\n58 \n$\n3,842 \n16 \n%\n$\n495 \nEMEA\n2,428 \n13 \n2,102 \n231 \n2,334 \n14 \n95 \nAsia Pacific (2)\n1,410 \n19 \n1,356 \n43 \n1,399 \n19 \n12 \nTotal\n$\n8,176\n \n15.7\n \n%\n$\n7,242\n \n$\n332\n \n$\n7,575\n \n15.6\n \n%\n$\n601\n \nAmounts in tables may not total due to rounding.\n(1)\nCosts recorded in connection with our business optimization initiatives, primarily for employee severance.\n(2)\nDuring the first quarter of fiscal 2025, our Latin America market unit moved from Growth Markets to North America. With this change, North America became the Americas market and Growth Markets became the Asia Pacific market. Prior period amounts have been reclassified to conform with the current period presentation.\nInterest Income\n \nInterest income for the third quarter of fiscal 2025 was $79 million, an increase of $25 million over the third quarter of fiscal 2024 primarily due to a higher average cash balance. Interest income for the nine months ended May 31, 2025 was $231 million, an increase of $10 million over the nine months ended May 31, 2024.\nInterest Expense\n \nInterest expense for the third quarter of fiscal 2025 was $68 million, an increase of $56 million over the third quarter of fiscal 2024. Interest expense for the nine months ended May 31, 2025 was $162 million, an increase of $126 million over the nine months ended May 31, 2024. The increase for the three and nine months ended May 31, 2025 was primarily due to an increase in long-term debt compared to the three and nine months ended May 31, 2024.\nOther Income (Expense), net\nOther income (expense), net primarily consists of foreign currency gains and losses, non-operating components of pension expense, as well as gains and losses associated with our investments. During the third quarter of fiscal 2025, Other income (expense), net decreased $24 million from the third quarter of fiscal 2024 primarily due to higher foreign currency exchange losses, partially offset by higher gains on investments. During the nine months ended May 31, 2025, Other income (expense), net increased $11 million over the nine months ended May 31, 2024. For additional information, see Note 1 (Basis of Presentation) to our Consolidated Financial Statements under Item 1, “Financial Statements.\"\nIncome Tax Expense\nThe effective tax rates for the third quarter of fiscal 2025 and 2024 were 24.0% and 25.4%, respectively. The lower effective tax rate was primarily due to lower tax expense from changes in the geographic distribution of earnings, partially offset by higher expense from adjustments to prior year tax liabilities. The effective tax rates for the nine months ended May 31, 2025 and 2024 were 22.1% and 22.6%, respectively. The lower effective tax rate was primarily due to lower tax expense from changes in the geographic distribution of earnings.\nTable of Contents\nACCENTURE\n FORM 10-Q\nItem 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations \n32\nIncome Tax Expense Excluding Fiscal 2024 Business Optimization Costs (Non-GAAP)\nExcluding the business optimization costs of $77 million and $332 million, and related reduction in tax expense of $24 million and $86 million, our adjusted effective tax rates were \n25.5% and 22.8%\n for the \nthree and nine months ended May 31, 2024, respectively.\nEarnings Per Share\nDiluted earnings per share were $3.49 for the third quarter of fiscal 2025, compared with $3.04 for the third quarter of fiscal 2024. Diluted earnings per share were $9.90 for the nine months ended May 31, 2025, compared with $8.77 for the nine months ended May 31, 2024. For information regarding our earnings per share calculations, see Note 3 (Earnings Per Share) to our Consolidated Financial Statements under Item 1, “Financial Statements.”\nEarnings Per Share Excluding Fiscal 2024 Business Optimization Costs (Non-GAAP)\nThe business optimization costs of $54 million and $247 million, net of related taxes, decreased diluted earnings per share by $0.08 and $0.39 \nfor the three and nine months ended May 31, 2024, respectively. Adjusted diluted earnings per share were \n$3.13 and $9.16 for the \nthree and nine months ended May 31, 2024, respectively.\nThree Months Ended\nNine Months Ended\nMay 31, 2024 As Reported\n$\n3.04\n \n$\n8.77\n \nBusiness optimization costs\n0.12 \n0.52 \nTax effect of business optimization costs (1)\n(0.04)\n(0.13)\nMay 31, 2024 As Adjusted\n$\n3.13\n \n$\n9.16\n \nMay 31, 2025 As Reported\n$\n3.49\n \n$\n9.90\n \nAmounts in tables may not total due to rounding.\n(1)\nThe income tax effect of business optimization costs includes both the current and deferred income tax impact and was calculated by using the relevant tax rate of the country where the adjustments were recorded.\nChanges in diluted earnings per share for the \nthree and nine months ended May 31, 2025\n compared to adjusted diluted earnings per share for the \nthree and nine months ended May 31, 2024\n were due to the following factors:\nThree Months Ended\nNine Months Ended\nMay 31, 2024 As Adjusted\n$\n3.13\n \n$\n9.16\n \nRevenue and operating results\n0.32 \n0.73 \nEffective tax rate\n0.07 \n0.09 \nLower share count\n0.03 \n0.05 \nNon-operating income\n(0.06)\n(0.13)\nMay 31, 2025 As Reported\n$\n3.49\n \n$\n9.90\n \nLiquidity and Capital Resources \nAs of May 31, 2025, Cash and cash equivalents was $9.6 billion, compared with $5.0 billion as of August 31, 2024. \nCash flows from operating, investing and financing activities, as reflected in our Consolidated Cash Flows Statements, are summarized in the following table: \n  \nNine Months Ended\n(in millions of U.S. dollars)\nMay 31, 2025\nMay 31, 2024\nChange\nNet cash provided by (used in):\nOperating activities\n$\n7,560 \n$\n5,742 \n$\n1,819 \nInvesting activities\n(1,248)\n(5,515)\n4,266 \nFinancing activities\n(1,673)\n(3,635)\n1,961 \nEffect of exchange rate changes on cash and cash equivalents\n(11)\n(100)\n89 \nNet increase (decrease) in cash and cash equivalents\n$\n4,627\n \n$\n(3,508)\n$\n8,135\n \nAmounts in table may not total due to rounding.\nTable of Contents\nACCENTURE\n FORM 10-Q\nItem 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations \n33\nOperating activities: \nThe $1,819 million increase in operating cash flows was primarily due to higher net income and changes in operating assets and liabilities, including lower spending on certain compensation payments.\nInvesting activities: \nThe $4,266 million decrease in cash used was primarily due to lower spending on business acquisitions. For additional information, see Note 5 (Business Combinations) to our Consolidated Financial Statements under Item 1, “Financial Statements.”\nFinancing activities:\n \nThe $1,961 million increase in financing cash flows was primarily due to higher net proceeds from borrowings. For additional information, see Note 9 (Borrowings and Indebtedness) to our Consolidated Financial Statements under Item 1, “Financial Statements.”\nWe believe that our current and longer-term working capital, investments and other general corporate funding requirements will be satisfied for the next twelve months and thereafter through cash flows from operations and, to the extent necessary, from our borrowing facilities and future financial market activities. \nSubstantially all of our cash is held in jurisdictions where there are no regulatory restrictions or material tax effects on the free flow of funds. Domestic cash inflows for our Irish parent, principally dividend distributions from lower-tier subsidiaries, have been sufficient to meet our historic cash requirements, and we expect this to continue into the future. \nBorrowings and Indebtedness \nOn September 30, 2024, we filed a registration statement on Form S-3, pursuant to which Accenture plc’s wholly owned finance subsidiaries Accenture Capital and Accenture Global Capital DAC may issue debt securities. As of May 31, 2025, we had outstanding long-term debt in the form of senior unsecured notes issued by Accenture Capital in an aggregate principal amount of $5 billion, which mature from 2027 through 2034. Accenture plc fully and unconditionally guarantees these notes, as well as all future debt securities that may be issued by these entities.\nFor additional information regarding our outstanding borrowings, credit facilities and other debt, see Note 9 (Borrowings and Indebtedness) to our Consolidated Financial Statements under Item 1, “Financial Statements.”\nShare Purchases and Redemptions \nThe Board of Directors of Accenture plc has authorized funding for our publicly announced open-market share purchase program for acquiring Accenture plc Class A ordinary shares and for purchases and redemptions of Accenture plc Class A ordinary shares and Accenture Canada Holdings Inc. exchangeable shares held by current and former members of Accenture Leadership and their permitted transferees. \nOur share purchase activity during the nine months ended May 31, 2025 is as follows: \n  \nAccenture plc Class A\nOrdinary Shares\nAccenture Canada\nHoldings Inc. Exchangeable Shares\n(in millions of U.S. dollars, except share amounts)\nShares\nAmount\nShares\nAmount\nOpen-market share purchases (1)\n10,326,925 \n$\n3,381 \n— \n$\n— \nOther share purchase programs\n— \n— \n11,811 \n4 \nOther purchases (2)\n2,151,936 \n760 \n— \n— \nTotal\n12,478,861\n \n$\n4,141\n \n11,811\n \n$\n4\n \n(1)\nWe conduct a publicly announced open-market share purchase program for Accenture plc Class A ordinary shares. These shares are held as treasury shares by Accenture plc and may be utilized to provide for select employee benefits, such as equity awards to our employees. \n(2)\nDuring the nine months ended May 31, 2025, as authorized under our various employee equity share plans, we acquired Accenture plc Class A ordinary shares primarily via share withholding for payroll tax obligations due from employees and former employees in connection with the delivery of Accenture plc Class A ordinary shares under those plans. These purchases of shares in connection with employee share plans do not affect our aggregate available authorization for our publicly announced open-market share purchase and the other share purchase programs. \nWe intend to continue to use a significant portion of cash generated from operations for share repurchases during the remainder of fiscal 2025. The number of shares ultimately repurchased under our open-market share purchase program may vary depending on numerous factors, including, without limitation, share price and other market conditions, our ongoing capital allocation planning, the levels of cash and debt balances, other demands for cash, such as acquisition activity, general economic and/or business conditions, and board and management discretion. Additionally, as these factors may change over the course of the year, the amount of share repurchase activity during any particular period cannot be predicted and may fluctuate from time to time. Share repurchases may be made from time to time through open-market purchases, in respect of purchases and redemptions of Accenture Canada Holdings Inc. exchangeable shares, through the use of Rule 10b5-1 plans and/or by other means. The repurchase program may be accelerated, suspended, delayed or discontinued at any time, without notice. \nTable of Contents\nACCENTURE\n FORM 10-Q\nItem 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations \n34\nOff-Balance Sheet Arrangements \nIn the normal course of business and in conjunction with some client engagements, we have entered into contractual arrangements through which we may be obligated to indemnify clients with respect to certain matters. \nTo date, we have not been required to make any significant payment under any of the arrangements described above. For further discussion of these transactions, see Note 11 (Commitments and Contingencies) to our Consolidated Financial Statements under Item 1, “Financial Statements.” \nSignificant Accounting Policies \nSee Note 1 (Basis of Presentation) to our Consolidated Financial Statements under Item 1, “Financial Statements.”"
}