{
  "source_file": "adbe-20241129.htm",
  "form_type": "10-K",
  "item1": "ITEM 1.  BUSINESS\nOVERVIEW\nAdobe is a global technology company with a mission to change the world through personalized digital experiences. For over four decades, Adobe’s innovations have transformed how individuals, teams, businesses, enterprises, institutions, and governments engage and interact across all types of media. Our products, services and solutions are used around the world to imagine, create, manage, deliver, measure, optimize and engage with content across surfaces and fuel digital experiences. We have a diverse user base that includes consumers, communicators, creative professionals, developers, students, small and medium businesses and enterprises. We are also empowering creators by putting the power of artificial intelligence (“AI”) in their hands, and doing so in ways we believe are responsible. Our products and services help unleash creativity, accelerate document productivity and power businesses in a digital world.\nOFFERINGS\nWe deliver a wide range of products, services and solutions to empower our customers and users to imagine and express ideas, create content and bring any digital experience to life. We focus our strategic investments in two areas of growth:\nDigital Media. \nWe provide products, services and solutions that enable individuals, teams, businesses, enterprises, institutions, and governments to create, publish and promote their content anywhere, and accelerate their productivity by transforming how they view, share, engage with and collaborate on documents and content creation. Our Digital Media segment is centered around Adobe Creative Cloud and Adobe Document Cloud, which include Adobe Photoshop, Adobe Illustrator, Adobe Lightroom, Adobe Premiere Pro, Adobe Acrobat, Adobe Acrobat Sign, Adobe Express, Adobe Firefly and many more products, offering a variety of tools for creative professionals (like photographers, graphic designers, video editors and game developers), communicators and other consumers. This is the core of what we have delivered to customers and users for decades, and we have continually evolved and expanded our Digital Media business model to provide our customers and users with a range of flexible solutions to help them reach their full creative potential.\nDigital Experience. \nWe provide an integrated platform and set of products, services and solutions through Adobe Experience Cloud that enable businesses to create, manage, execute, measure, monetize and optimize customer experiences. Our customers include marketers, advertisers, agencies, publishers, merchandisers, merchants, web analysts, data scientists, developers and executives across the C-suite. The foundation of our offering is Adobe Experience Platform, which provides businesses with an open and extensible system for customer experience management that transforms customer data into robust customer profiles that update in real time and uses insights to deliver personalized digital experiences across various channels.\nWe offer a comprehensive suite of products, services and solutions to our customers in our Digital Media business and Digital Experience business. With Adobe GenStudio, our cross-cloud, end-to-end solution that packages offerings across Digital Experience and Digital Media, enterprises can automate, optimize and accelerate their content supply chains for \n3\nTable of Contents\nmarketing campaigns and personalized customer experiences. We believe we are well positioned to deliver value in both the Digital Media and Digital Experience strategic areas where our mission to change the world through personalized digital experiences has never been more relevant as people seek new ways to create, collaborate and communicate and businesses continue to invest in digital transformation. \nSEGMENTS\nOur business is organized into three reportable segments: \n•\nDigital Media; \n•\nDigital Experience; and \n•\nPublishing and Advertising. \nThese segments provide Adobe’s senior management with a comprehensive financial view of our key businesses. Our segments are aligned around our two strategic growth opportunities further described below, and our legacy products, services and solutions are contained within the third segment, Publishing and Advertising.\nMARKET OVERVIEW\nThis overview provides an explanation of our markets and a discussion of strategic opportunities in fiscal 2025 and beyond for each of our segments. \nSee the section titled \n“Results of Operations” in Part II, Item 7 titled “Management’s Discussion and Analysis of Financial Condition and Results of Operations”\n and \nNote 2 of our Notes to Consolidated Financial Statement\ns\n of this report for further segment information.\nDigital Media\nOpportunity\nIn today’s digital world, content and digital documents are fueling the global economy, and productivity, design and creativity have never been more relevant, providing a significant market opportunity for Adobe in digital media. Everyone has a story to tell and needs products and services at their fingertips to tell those stories on an ever-increasing number of canvases. AI- and generative AI-powered technologies are increasing this opportunity by growing the demand for and production of content. This shift is changing how creative professionals work by accelerating their processes, increasing their productivity, and allowing them to explore and create in new fields, while empowering new creators by dramatically lowering barriers to creativity. At the same time, creativity is increasingly a team effort that is redefining productivity, making quick and easy collaboration even more critical to every company’s success. Adobe is driving innovation to shape these trends, democratize creativity, empower individuals to create wherever inspiration strikes and enable more effective collaboration between creators and stakeholders.\nThe flagship of our Digital Media business is Adobe Creative Cloud, a subscription service that allows subscribers to use our creative products and applications (“Apps”) integrated with cloud-delivered services across various surfaces and platforms. We believe in creativity for all, and Creative Cloud addresses the needs of all content creators, from creative professionals, such as artists, designers, developers, students, and administrators, to knowledge workers, marketers, educators, enthusiasts, communicators, and consumers. Our customers rely on our products for content creation, photo editing, design, video and animation production, mobile App and gaming development, and more. Our customers can choose between products optimized for different platforms and capabilities, from the speed and ease of use offered by Adobe Express, our AI-first, task-based web and mobile App, to the greater power and precision of our flagship Creative Cloud Apps. We believe we have significant opportunities to grow our Digital Media business by advancing every creative category across all surfaces; expanding content-first, task-based creativity with Adobe Express; enabling seamless collaboration across all stakeholders; inspiring the creative community through sharing and monetization; and expanding the user base of our tools through the infusion of AI into our products, services and solutions to enable users of any skill level to easily and efficiently create content.\nOur Digital Media segment includes our Adobe Document Cloud business, a unified, cloud-based document services platform that integrates Adobe’s pioneering PDF technology with our Adobe Acrobat, Adobe Scan and Adobe Acrobat Sign Apps to deliver fully digital document workflows across all surfaces. We have the opportunity to continue to accelerate document productivity with Adobe Document Cloud and transform how people view, share, collaborate, and engage with documents. Trillions of PDF documents are created every year, reflecting the important role PDF plays globally. There are hundreds of millions of users who engage with PDF files on a daily basis in industries such as legal, financial services, and publishing, as well as a broad array of communicators and Adobe Acrobat Reader customers who use the expanded capabilities provided by our Acrobat Apps and the document services platform in Adobe Document Cloud.\n4\nTable of Contents\nStrategy\nOur goal for our Digital Media business is to be a leading platform for creativity and digital document solutions, where we offer a range of products and services that allow anyone to design and deliver content seamlessly. We aim to achieve this goal by using data-driven customer engagement, driving product-led growth to allow our customers to create content and interact with documents in ways that are more frictionless, efficient and accessible, and meeting our customers’ needs holistically to increase the value they derive from our services.\nWe are redefining the creative process with Adobe Creative Cloud to unleash everyone’s ability to imagine and express ideas. We are empowering enterprises and users beyond creative professionals, such as novice content creators and communicators, to create, edit, schedule and share content quickly and easily using Adobe Express, which makes select capabilities from products like Adobe Photoshop, Adobe Premiere Pro and Adobe Acrobat easy to use for users at any level. With Adobe Acrobat Pro, subscribers have full convert and edit capabilities, advanced e-signature features including bulk send and custom branding, advanced protection and additional PDF features. We continue to add collaboration capabilities into our flagship products, Apps and workflows, and to infuse AI into our creative Apps to help our customers and users work faster and smarter, with new models for images and vector graphics, and AI-powered video features natively integrated into our flagship products. We are building our own foundation models in areas where we have domain expertise and which we believe are most relevant to our customers, and partnering with third-party AI models and large language models to further expand the capabilities of our products. We expanded Adobe Firefly with the launch of Adobe Firefly Services, which help organizations automate content production; Custom Models, which enable enterprises to train and customize models to support brand consistency amongst creative and marketing teams; Firefly Video Model (public beta), which enables generative text-to-video and image-to-video; and Firefly Image 3 Foundation Model, which allows for faster and higher-quality image generations. Developing our own foundation models enables us to design Firefly to be commercially safe and in line with our AI Ethics principles of accountability, responsibility and transparency. \nWe continue to pursue ways to inspire, empower and connect the creative community and support live, interactive tutorials with creators. Additionally, with Adobe GenStudio and Adobe GenStudio for Performance Marketing, a generative AI-first product that natively integrates Digital Media and Digital Experience offerings, we help enterprises to quickly create on-brand content variations and accelerate their marketing workflows. Further descriptions of our Digital Media products are included below under “Principal Products, Services and Solutions.”\nIn our Creative Cloud business, we employ our product-led growth strategy to minimize the friction of customer interactions and drive positive product experiences, which results in increasing adoption, usage, conversion, expansion and loyalty. We also continue to employ a pricing strategy, as appropriate, to migrate our customers to higher-value offerings as well as attract past customers and potential customers to try out our products and ultimately subscribe. We use a data-driven operating model and our Adobe Experience Cloud solutions to drive and optimize customer awareness, engagement and licensing of our creative products and services at every stop of the customer journey through our website and across other channels. Adobe.com is the central destination where we engage individual and small business customers to sign up for and renew Creative Cloud subscriptions. Our customers have the flexibility to subscribe to over twenty of our Creative Cloud products through a single subscription or, for many of our Apps, through various collections of our individual subscriptions to point products. To better serve our current users and potential users, we offer free and premium levels for certain Apps and targeted packages and suites. Further, our generative AI capabilities are increasing the value of our existing subscription products, expanding our potential customer base and increasing engagement and retention through Generative Credits—credits that provide users and subscribers the ability to generate content with Adobe Firefly. The collaboration features across many of our products help us to further expand our universe of customers beyond creative professionals to other stakeholders who use our products for review and approval, copywriting, social media marketing or other social content creation. We utilize channel partners to target mid-size creative customers with our Creative Cloud for Teams offering. Our direct sales force is focused on building relationships with our largest customers and driving adoption of our Creative Cloud for Enterprise offering. Overall, our strategy with Creative Cloud is designed to enable us to deliver customer value, increase our revenue with existing customers, attract new customers and grow a recurring and predictable revenue stream that is recognized ratably.\nIn our Adobe Document Cloud business, we expect to drive sustained long-term revenue growth through an expansion of our customer base by continuing to employ our product-led growth strategy; deliver the best PDF experience on and across every platform; improve Acrobat web’s functionality and ease of use; and expand the number of digital document and workflow-based actions in Acrobat. We are driving innovation with Acrobat AI Assistant, our generative AI-powered tool in Adobe Acrobat Pro, Acrobat Standard and Acrobat Reader, that allows users to better and more quickly understand their documents with quick answers and generative AI summaries, and Adobe Sensei, our cross-platform AI and machine learning technology to make documents more intelligent and responsive. Additionally, with the integration of Adobe Firefly in Acrobat, our customers can easily generate and edit visuals directly in PDFs. We are unlocking business workflows through PDF and Adobe Acrobat Sign Application Programming Interfaces (“APIs”); accelerating Document Cloud adoption through digital and \n5\nTable of Contents\ndirect sales; and deploying diversified go-to-market motions to reach all industries and businesses of all sizes. With over 100 million online searches for PDF-related actions per month, we intend to harness that demand and attract new users and customers to our Document Cloud services through Acrobat web, which allows anyone to quickly access tools to create, edit, convert, sign and compress PDFs through their web browser. As with our Creative Cloud strategy, we utilize a data-driven operating model to market our Document Cloud solutions and optimize our subscription-based pricing for individuals as well as small and medium businesses, large enterprises, students and education users, and government institutions around the world. We utilize our corporate and volume licensing programs to increase our reach in our key markets and are continuing to focus on marketing and licensing Acrobat in targeted vertical markets such as education, financial services, telecommunications and government, and on expanding into emerging markets. We will continue to engage in strategic partnerships to help expand our distribution reach and drive the enterprise business.\nAs our Document Cloud customers increasingly expect business processes to be seamless across surfaces and the web, we are expanding our Document Cloud capabilities to meet this need. Adobe Acrobat is available on the web, delivering quick results for common PDF actions with a single click. Users can ask questions using voice commands with Acrobat AI Assistant on mobile devices. Adobe Scan powers mobile devices with scanning capabilities, transforming paper documents into full-featured PDFs. Adobe Acrobat Sign provides a green alternative to costly, paper-based solutions and offers a convenient solution for our customers to digitally manage their documents, automate processes and contract workflows, and is integrated into Acrobat across all surfaces. Acrobat Reader is available on mobile devices, and features AI-powered “Liquid Mode” to automatically reformat PDFs for quick navigation and easier consumption on smaller screens. With features offered by AI Assistant and Adobe Firefly as well as new capabilities to Acrobat, Adobe Scan and Acrobat Sign, we help our customers and users continue to migrate away from paper-based processes and adopt our solutions for personalized, digital document experiences, growing our revenue with this business in the process.\nDigital Experience\nOpportunity\nConsumers today buy experiences, not just products, and they demand personalized digital experiences that are relevant, engaging, seamless and secure across an ever-expanding range of channels and surfaces. Businesses increasingly have the same expectations, driving business-to-business (“B2B”) companies to deliver equally engaging and seamless experiences as business-to-consumer (“B2C”) companies. With AI-powered automation and personalization, people and brands will increasingly stand out through unique creative expression, and the future of experiences across industries and everyday life will become increasingly personalized. Delivering the best, personalized experience at a given moment requires the right combination of data, insights and content across multiple channels in real time and at scale. We have a strategic opportunity to provide solutions that enable real-time personalization at scale and accelerate our customers’ content supply chain, with a streamlined and coordinated process from content ideation through deployment, measurement and optimization. Marketing is also increasingly evolving from a centralized discipline to a multi-practitioner, cross-functional, collaborative field, and marketing and IT teams are looking for a return on investment to demonstrate the business impact of their transformation initiatives.\nAdobe Experience Cloud is powering businesses by helping them provide exceptional personalized experiences to their customers via a comprehensive suite of solutions. Addressing the challenges of customer experience management is a large and growing opportunity and we are in position to help businesses and enterprises invest in solutions that aid their goals to transform how they engage with their customers and constituents digitally.\nStrategy\nOur goal is to be a leading provider of cloud-based solutions for delivering digital experiences and enabling digital transformation. Adobe Experience Cloud Apps and services are designed to manage customer journeys, enable personalized experiences at scale and deliver intelligence for businesses of any size in any industry. Adobe Experience Platform further strengthens our differentiation by offering a way to connect our comprehensive set of solutions. Further descriptions of our Digital Experience products are included below under “Principal Products, Services and Solutions.”\nAdobe Experience Cloud delivers solutions for our customers across the following strategic growth pillars:\n•\nData insights and audiences\n. Our products deliver actionable data to our customers in real time to enable highly tailored and adaptive experiences across platforms.\n•\nContent, commerce and workflows\n. Our products help our customers manage, deliver, personalize, and optimize content delivery; build multi-channel commerce experiences for B2B and B2C customers; strategically plan, \n6\nTable of Contents\nmanage, collaborate and execute on workflows for marketing campaigns and other projects at speed and scale; and leverage self-serve capabilities to deliver on-brand content.\n•\nCustomer journeys\n. Our products help businesses manage, test, target and personalize customer journeys delivered as campaigns across B2B and B2C use cases.\nOur goal is to deploy our capabilities to help enterprises generate highly engaging experiences, enable content creators to enhance creativity and scale content production, and provide marketing strategists with recommendations to improve marketing strategy and enhance the delivery of personalized customer journeys. In our Adobe Experience Cloud, we believe our innovations, natively embedded AI services, and end-to-end content supply chain solutions enhance the delivery and personalization of digital experiences by allowing our customers to gain insights and understand their data, simulate outcomes, automate tasks, generate audiences, create content, optimize marketing campaigns and enable the delivery of more relevant and personalized customer journeys. Adobe Experience Cloud offers domain-specific AI services in areas such as attribution and automated insights, customer journey management, lead management, sentiment analysis, one-click personalization, enhanced anomaly detection and more that work with Adobe Experience Platform to augment our Experience Cloud product offerings. By building on these features and capabilities, we increase the value we provide our customers and create a competitive differentiation in the market.\nAdobe Experience Cloud offers an open platform and ecosystem through Adobe Experience Platform. Adobe Experience Platform’s open system transforms businesses’ customer data from across their Adobe solutions and third-party software into robust customer profiles. These profiles are updated in real time and include AI-driven insights, allowing a brand to deliver the right customer experiences across channels and deliver true one-to-one personalization. This open architecture offers scalability with a wide variety of supporting products and services and empowers businesses to quickly develop innovative Apps to interact with their customers and enables a broad industry ecosystem.\nTo drive growth of Adobe Experience Cloud, we focus on delivering on-brand, customer engagement, growth within existing customer accounts, product differentiation and the best customer experience management solutions for B2B and B2C buyers across enterprise and mid-market segments. We intend to pursue growth through a scaled go-to-market approach focused on C-suite partnerships, transformational accounts, continued customer acquisition, customer value realization and solution expansion. We utilize a direct sales force to market and license our Experience Cloud solutions, as well as an extensive ecosystem of partners, including marketing agencies, systems integrators and independent software vendors that help license and deploy our solutions to their customers. We also maintain several strategic partnerships with other technology companies that allow us to increase our market reach. We have made significant investments to broaden the scale and size of all these routes to market and believe these investments will result in continued growth in revenue in our Digital Experience segment in fiscal 2025 and beyond.\nPublishing and Advertising\nOur Publishing and Advertising segment contains legacy products and services that address diverse market opportunities including eLearning solutions, technical document publishing, web conferencing, document and forms platform, web App development, high-end printing and our Adobe Advertising offerings. Graphics professionals and professional publishers continue to require quality, reliability and efficiency in production printing, and our Adobe PostScript and Adobe PDF printing technologies provide advanced functionality to meet the sophisticated requirements of this marketplace. As high-end printing systems evolve and transition to fully digital, composite workflows, we believe we are well positioned to be a supplier of software and technology based on the Adobe PostScript and Adobe PDF standards for this industry.\nAdobe Advertising delivers an end-to-end, demand-side platform for managing advertising across digital formats and simplifies the delivery of video, display and search advertising across channels and screens.\nWe generate revenue in our legacy Publishing products and services by licensing our technology to original equipment manufacturers that manufacture workflow software, printers and other output devices, and we generally generate revenue in Advertising through usage-based offerings. \nCOMPETITION\nOverview \nWe participate in a rapidly evolving, highly competitive global environment, where our competitors vary by industry and range from large multinational enterprises to smaller entities with specialized and focused product offerings. Across our business, we recognize hundreds of competitors worldwide. The markets for our products and services are characterized by new industry standards, evolving distribution models, rapid technological innovation, frequent product introductions and short \n7\nTable of Contents\nproduct life cycles. Our future success will depend on our ability to enhance our existing products, services and solutions and introduce new ones on a timely and cost-effective basis, accurately predict and meet changing customer needs, provide best-in-class information security to build customer confidence and combat cyber-attacks, extend our core technologies into new Apps and anticipate emerging standards, business models, software delivery methods and other technological changes.\nA summary of the competitive environment for each of our business segments is included below. See the section titled \n“Risk Factors” contained in Part \nI\n, Item 1A\n of this report for additional information regarding risks related to competition.\nDigital Media\nOur Digital Media segment faces competition from large, established companies and smaller, more recent entrants. These companies offer a variety of products, including multi-product packages, point offerings, free products, websites, downloadable Apps and other products and offerings. We compete in a rapidly evolving and growing market and face significant direct or indirect competition from:\n•\nsoftware companies and AI companies; \n•\ndevice, hardware, mobile device and camera manufacturers, including those that integrate software and AI capabilities for digital media, such as photo and video, collaboration tools and content creation; \n•\nmobile-first Apps; \n•\nweb-native tools and platforms; \n•\nsocial media platforms that provide digital media offerings, including editing capabilities; \n•\nproviders of stock content; \n•\ndigital document creation, storage, collaboration and signing providers;  \n•\nproductivity and presentation tools; \n•\noperating system developers that integrate digital media document viewers and markup features with their operating systems; and \n•\nproprietary and open-source web-authoring tools. \nWe believe competitive factors in our markets include: \n•\nbrand, product features and functionalities; \n•\nintegration with related tools, third-party Apps and workflows; \n•\nthe intuitiveness and visual appeal of user interfaces; \n•\ndemonstrable cost-effective benefits to our customers; \n•\npricing; \n•\nthe flexibility of services to match our customers’ evolving demands; \n•\nthe availability, usability and accessibility of our products, services and solutions; \n•\nsuccess in educating our customers in how to utilize services effectively; \n•\nthe ability to create and use AI models and integrate AI capabilities for digital media creation, generation, collaboration and editing; and \n•\nresponsible and secure data handling and storage protocols. \nWe attract our customers and users in this segment through our broad and comprehensive array of high-quality products and services, which are powerful, standalone tools that also work well together and complement one another. With Creative Cloud, we believe we compete well with our features and functionality, AI models and capabilities, ease of use, product reliability, value and performance characteristics. For example, with Adobe Firefly, we believe we compete well by offering generative AI models designed to be safe for commercial use and AI capabilities that are natively integrated into our products, \n8\nTable of Contents\nand with Adobe Express, we believe we compete well by making our creative technologies accessible to a wide audience and enabling easy-to-use, efficient content creation, collaboration and sharing for quick projects. With Adobe Document Cloud, we believe we compete well through our PDF offerings, features and functionalities that are critical tools for millions of business communicators, and our brand.\nDigital Experience\nOur Digital Experience segment competes in markets that are growing and evolving rapidly and characterized by intense competition. Our Adobe Experience Cloud solutions face competition from:\n•\nlarge, established companies, including large enterprise software, AI, internet and database management companies; \n•\npoint product solutions and focused companies; \n•\nnew companies constantly entering the digital experience markets; \n•\ncompanies that provide Software-as-a-Service (“SaaS”) solutions to our customers, generally through the web and software that is installed by our customers directly on their servers; and \n•\nOur customers’ or potential customers’ internally-developed Apps. \nWe believe competitive factors in our markets include: \n•\nthe proven performance, security, scalability, flexibility and reliability of services; \n•\nthe strategic relationships and integration with third-party Apps; \n•\nthe intuitiveness and visual appeal of our interfaces; \n•\ndemonstrable cost-effective benefits to our customers; \n•\npricing; \n•\nthe flexibility of services to match changing business demands; \n•\nenterprise-level customer service and training; \n•\nbrand; \n•\ndata governance features and functionality; \n•\nproduct features and functionality and the usability of services; \n•\nnear real-time data and reporting; \n•\nindependence from portals and search engines; \n•\nthe ability to deploy the services globally; \n•\nsuccess in educating our customers in how to utilize services effectively; and \n•\nthe integration and customization of high-quality AI models and the ability to customize and use such AI models. \nWe believe we compete well with our enterprise and low-cost alternatives based on many of these competitive factors, including:\n•\nour strong feature set;  \n•\nthe breadth of our offerings, which work well together and complement one another as part of Adobe Experience Cloud; \n•\nour focus on global, multi-brand companies; \n•\nprovision of AI through Adobe Sensei AI services; \n•\nour intuitive user experience; \n9\nTable of Contents\n•\ntools for building multi-screen; \n•\ntools for managing data across Apps and geographies; \n•\ncross-channel Apps; \n•\nstandards-based architecture; \n•\nscalability; \n•\nconnecting content creation with digital experience delivery, personalization and optimization; and \n•\nperformance. \nPublishing and Advertising\nOur Publishing and Advertising segment faces competition from large-scale publishing systems and Extensible Markup Language-based publishing companies and smaller desktop-publishing products. Our eLearning solutions and web conferencing products face competition from a number of established products from other large software companies. Competition involves a number of factors, including product features, ease-of-use, the level of customization and integration supported, the number of hardware platforms supported, service and price. We believe we can successfully compete based upon the quality and features of our products, their complementarity with our Adobe Creative Cloud, Adobe Document Cloud and Digital Experience products and our strong brand among users.\nPRINCIPAL PRODUCTS, SERVICES AND SOLUTIONS\nDigital Media Offerings\nAdobe Creative Cloud\nAdobe Creative Cloud is a cloud-based subscription to a collection of Apps that enables creative professionals and enthusiasts alike to express themselves and collaborate with Apps and services for photography, design, video, social media, and more that connect across surfaces, platforms and geographies. Subscribers have access to cloud storage to easily sync, access, collaborate and share their work, files and assets.\nCreative Cloud paid plans include the Adobe Firefly web App, the premium version of Adobe Express, and AI-powered features natively integrated throughout Adobe Photoshop, Adobe Illustrator and Adobe Premiere Pro. Creative Cloud, Adobe Firefly, and Adobe Express plans include a monthly allocation of Generative Credits, which are tokens that enable subscribers to use our generative AI features to generate content using text-based prompts. All Apps listed below and many more are available through subscriptions to Creative Cloud (except Substance 3D Apps, which are sold separately through the Adobe Substance 3D Collection plan), and many of our Apps are also available as standalone subscriptions on Adobe.com. Adobe Acrobat Pro is available as part of our Creative Cloud All Apps subscription and on a standalone basis and allows users to create, convert and edit PDFs, including text and images. Additionally, certain Creative Cloud Apps, such as Adobe Express, are available in Adobe GenStudio for Performance Marketing, allowing users to quickly use assets and Creative Cloud tools to create on-brand content.\nAdobe Photoshop and Adobe Lightroom\nAdobe Photoshop is the world’s most advanced digital imaging and design App, with powerful editing and effects tools to transform photos. It is available on desktop, iPad and through a web version. Features include Generative Fill, Generative Expand, Generate Similar and Generate Background, which allow our customers to use text prompts to quickly create, add to, remove, duplicate or replace images, or expand the borders of an existing image with AI-generated content without leaving Adobe Photoshop; the Adjustment Brush Tool, which combines the traditional workflow of selecting, masking, and applying an adjustment into one step, simplifying the way of making local adjustments; and Distraction Removal smart technology to help remove people, wires, poles and other distractions from images. Adobe Lightroom is our cloud-based photo App that allows subscribers to edit, organize, store and share photos across desktop, tablet, mobile devices and the web. Features include Lens Blur to blur the background or foreground by making a depth map of the photo using AI; the Denoise feature to remove noise in RAW photos; People Masking features to automatically select and edit facial hair and clothing; and Generative Remove, which uses Adobe Firefly to remove unwanted objects and distractions in a photo. In addition to individual subscriptions to Photoshop and Lightroom, we offer a Photography Plan, which is a more limited cloud-based offering than Creative Cloud, targeted at photographers and photo enthusiasts and includes Photoshop, Lightroom and Lightroom Classic.\n10\nTable of Contents\nAdobe Illustrator and Adobe Fresco\nAdobe Illustrator is our industry-standard vector graphics App for desktop and iPad used worldwide by designers of all types who want to create digital graphics and illustrations for all kinds of media—print, web, interactive, video and mobile—from web and mobile graphics to product packaging to book illustrations and billboards. Features include Adobe Firefly-powered Generative Recolor, which enables users to generate different color palettes using text prompts and apply them to their illustrations; Objects on Path to empower users to quickly attach, arrange and move an object along any path of their art board; and Enhanced Image Trace to make it easier and faster to convert images to vectors. Adobe Fresco is our free illustration App, available on various surfaces, that brings together the world’s largest collection of vector and raster brushes and AI-powered Live Brushes to deliver a natural painting and drawing experience.\nAdobe Premiere Pro\nAdobe Premiere Pro is a nonlinear video editing App used by filmmakers, TV editors, YouTubers and videographers. Our customers can import and combine various types of media, from video shot on a mobile device to 8K to virtual reality, and then edit in its native format without transcoding. Automated tools and workflows for color, graphics, audio and immersive 360/VR make the editing process more efficient. Premiere Pro offers Text-Based Editing, which allows our customers to review transcripts or search for keywords to find and edit the right content faster and AI-powered Enhance Speech to remove noise and improve the quality of dialogue clips.\nAdobe After Effects\nAdobe After Effects is our industry-standard motion graphics and visual effects App used by a wide variety of animators, designers and compositors to create cinematic movie titles, add effects and create animations. With an AI-enhanced Roto Brush, users can cut out objects from footage faster and more accurately than ever. After Effects works together seamlessly with other Adobe Apps such as Adobe Premiere Pro, Adobe Photoshop, Adobe Illustrator and Adobe Audition, as well as third party software and hardware partners.\nAdobe InDesign\nAdobe InDesign is a design and layout App for print and digital media. Our customers use it to create, preflight and publish a broad range of content including books, eBooks, digital magazines, posters and interactive PDFs for print, online and tablet App delivery. Integrations with other Adobe Apps such as Adobe Photoshop, Adobe Illustrator, Adobe Acrobat, Adobe Stock, Adobe Firefly, Adobe InCopy and Adobe Experience Manager expands InDesign’s capabilities and allows our customers to collaborate and share content, fonts and graphics across projects. Our customers can also access Adobe’s digital publishing capabilities from within InDesign to create and publish engaging Apps for a broad range of surfaces.\nAdobe Express\nAdobe Express is our all-in-one AI content creation App for users of any level, such as novice content creators and communicators, to easily create video, marketing, and social content. Users can easily design high-impact design elements, engaging videos and images, resumes, PDFs, animation and content ready for Instagram, TikTok and other social channels and platforms. The App features guided tools, one-click solutions for quick projects, simple drag and drop functions, collaboration tools, thousands of templates and access to more than 20,000 fonts and the entire Adobe Stock photo collection, and allows users to easily plan, schedule, preview, and publish content all from one place. Adobe Firefly integrated into Adobe Express makes it possible to quickly generate custom images and text effects from text prompts in over 100 languages and is designed to be commercially safe. Also available in Adobe GenStudio and Adobe GenStudio for Performance Marketing, Adobe Express allows marketers to quickly resize and reformat assets to create content variations for any channel. Adobe Express is available on mobile devices and the web. With Adobe Express, Creative Cloud subscribers can easily access, edit and work with creative assets from Adobe Photoshop and Adobe Illustrator directly, or add linked files into Adobe Express that always stay in sync across Apps.\nAdobe Firefly, Adobe Firefly Services and Custom Models\nAdobe Firefly is our family of creative generative AI models and standalone web App for exploring AI-assisted creative expression. Firefly’s foundation generative AI models allow users to generate images, text effects, design templates, and vector graphics using a text description. Firefly AI models include a version of the Firefly Image Model that generates high-quality images from text prompts, a Firefly Vector Model that generates fully editable vector graphics, a Firefly Design Model that generates fully editable design templates, and a Firefly Video Model (public beta) that generates video from text or image prompts. Firefly supports text prompts in more than 100 languages. In addition, with Adobe Firefly for Enterprise, certain businesses are eligible to obtain an intellectual property indemnification for AI-generated content generated by most Firefly-\n11\nTable of Contents\npowered workflows. Firefly-powered generative AI features are also available in a number of our products including Adobe Photoshop, Adobe Illustrator, Adobe Express, Adobe Acrobat and Adobe Stock. Firefly is available for free with a limited number of Generative Credits per month. Once that limit is reached, users and subscribers can buy additional Generative Credits through a Firefly paid subscription plan.\nAlso available for enterprises are Adobe Firefly Services and Custom Models. Firefly Services provides enterprises with APIs, tools and services for content generation, editing and assembly, to automate the production of content while maintaining quality and control. Custom Models enable enterprises to train generative AI models based on their intellectual property, product and brand styles across a wide variety of use cases such as localization or merchandising for e-commerce, maintaining and propagating brand consistency at scale across their organizations.\nAdobe Firefly-generated content is designed to be commercially safe. The Firefly generative AI model is trained on data Adobe has the rights to use. Every asset created using Firefly includes Content Credentials, a digital “nutrition label”, to indicate that generative AI was used, bringing more trust and transparency to digital content.\nAdobe Stock\nAdobe Stock provides designers and businesses with access to millions of high-quality, curated, royalty-free photos, vectors, illustrations, videos, templates, audio and 3D assets, for all their creative projects. Adobe Stock is built into our Creative Cloud Apps, including Adobe Photoshop, Adobe Illustrator, Adobe InDesign and Adobe Express, enabling users to search, browse and add assets to their Creative Cloud Libraries and instantly access them across all connected surfaces. Adobe Stock assets include free and paid collections and may be licensed directly within Adobe’s Apps, through stock.adobe.com or as a multi-asset subscription.\nFrame.io\nFrame.io is our cloud-native creative collaboration platform that streamlines the production of creative assets by enabling creative professionals and key project stakeholders to collaborate with real-time upload, review and approval, frame-accurate commenting, annotations and more. Frame.io includes support for video beyond post-production workflows including casting, location scouting, footage reviews, and marketing campaign management, as well as still images, design files and PDFs. Frame.io is directly integrated with Adobe Premiere Pro, Adobe After Effects, Adobe Photoshop, Adobe Lightroom and Adobe Workfront to allow video creators to request and receive streamlined frame-specific comments directly in those Apps. Frame.io’s Camera to Cloud functionality allows creators to automatically upload footage from cameras and other recording devices on set directly into Frame.io for review, with integrations for still image cameras that can connect natively to the platform. Frame.io, along with Adobe Express and Adobe Firefly Services, are available in Adobe GenStudio to enable content production at scale.\nAdobe Substance 3D Collection\nAdobe Substance 3D is an ecosystem of desktop Apps, including Substance 3D Stager, Substance 3D Painter, Substance 3D Sampler, Substance 3D Designer and Substance 3D Modeler. Our customers can build and assemble 3D scenes with Stager, use tools in Painter to texture 3D assets, from advanced brushes to Smart Materials that automatically adapt to your model and use Sampler to digitize and enrich assets. Substance 3D Assets is a 3D materials library from which users can import professional quality 3D textures into their projects and generate infinite texture variations. Substance 3D Modeler, which is available on desktop and certain VR headsets, interprets spatial input from the physical world, allowing the user to sculpt a model as if in a real workshop, using natural, fluid gestures of the artistic flow, and switch between VR and desktop, at every project stage.\nBehance\nBehance is a social community for creators to showcase and discover creative work online and live-stream their skills and creations from Creative Cloud Apps. Adobe Portfolio allows users to quickly and simply build a fully customizable and hosted website that seamlessly syncs with Behance.\nAdobe Document Cloud\nAdobe Document Cloud is a cloud-based subscription offering that enables complete, reliable and automated digital document and signature workflows across desktop, mobile, web and third-party enterprise Apps to drive business productivity for individuals, teams, small businesses and enterprises. With Document Cloud, users can create, review, approve, sign and track documents and store them in the cloud for easy access and sharing across surfaces. Document Cloud includes Adobe Acrobat, Adobe Acrobat Sign, Adobe Scan and other Apps and API services that work standalone or integrate with users’ existing productivity Apps, processes and systems.\n12\nTable of Contents\nAll the Apps listed below are available through a subscription to Adobe Acrobat. With the Acrobat Standard plan, subscribers can convert, edit, request signatures, and protect PDFs. The Acrobat Pro plan, available through both our Creative Cloud and Document Cloud businesses, offers additional advanced PDF features. Acrobat AI Assistant, our generative AI-powered conversational engine, gives our users the power to work more productively with their documents with its ability to summarize and answer questions about documents, provide intelligent citations and quickly generate and format content for sharing. Acrobat AI Assistant is offered as an add-on to Acrobat Pro, Acrobat Standard and Acrobat Reader. We also offer Acrobat subscription plans for teams and enterprises. Adobe Acrobat Sign is included in Adobe Acrobat subscriptions for individuals and teams. Document Cloud for enterprise includes Acrobat, Acrobat Sign, and APIs including third-party partner integrations. Acrobat Reader and Adobe Scan are also separately available as free downloads.\nAdobe Acrobat\nAt the heart of Adobe Document Cloud is Adobe Acrobat, our comprehensive PDF solution with a full set of tools to convert, edit, share and sign PDFs across various surfaces and platforms. Acrobat enables automated, collaborative workflows with a rich set of commenting, editing and sharing tools and direct integration with Adobe Acrobat Sign. Acrobat’s unified Share button combines sharing a link, sending the file by email, and sharing a file with others into one streamlined action, simplifying the sharing and review experience. Our Acrobat Chrome and Edge extensions allow users to access our Acrobat tools without leaving the web browser.\nAdobe Acrobat Reader\nAdobe Acrobat Reader, our free software for reliable viewing, annotating and printing of PDF documents on a variety of surfaces and platforms, offers features to create, edit, export, combine, share and collaborate on PDF documents, including the “Liquid Mode” feature that automatically reformats PDFs for quick navigation and consumption on mobile devices. Users of both Acrobat and Acrobat Reader can also access, edit and save changes to their PDF files stored in Adobe Document Cloud, or other third-party cloud storage services.\nAdobe Scan\nAdobe Scan can be used for free on mobile devices to provide scanning capabilities in the pocket of every person. It captures paper documents as images and transforms them into full-featured and versatile PDFs via Adobe Document Cloud services for instant sharing with others. Optical character recognition allows users to convert scanned documents into editable, searchable PDF files instantly. \nAdobe Acrobat Sign\nOur cloud-based e-signature service, Adobe Acrobat Sign, allows users securely to send any document electronically for signature across surfaces. Through web and mobile Apps, Acrobat Sign enables users to e-sign documents and forms, send them for signature, track responses in real time and obtain instant signatures with in-person signing. Acrobat Sign also integrates with users’ enterprise systems through a comprehensive set of APIs and Adobe Experience Manager Forms and Advanced Workflows for Acrobat Sign, to create forms and provide seamless experiences to our customers across web and mobile sites.\nDigital Experience Offerings\nAdobe Experience Cloud is a comprehensive collection of best-in-class products, services and solutions to manage the customer experience, all integrated into a cloud platform, along with service, support and an open ecosystem. Adobe Sensei uses AI and machine learning technology to analyze large amounts of data and make intelligent in-App recommendations, automate repetitive tasks, and drive real-time decisions within our products. Adobe Sensei GenAI allows customer experience and marketing teams to use natively embedded generative AI to deliver more accurate and personal customer journeys.\nExperience Cloud is comprised of the following sets of solutions for our customers: Adobe Experience Platform; Data Insights and Audiences; Content, Commerce and Workflows; and Customer Journeys, which are each described below.\nAdobe Experience Platform\nAdobe Experience Platform is a purpose-built platform for customer experience management that helps businesses collect, connect and activate their known and unknown customer data from every interaction across sources and channels in real time to create unified customer profiles. Adobe Experience Platform standardizes data for intelligence and profile creation and provides an open and extensible cloud infrastructure, real-time updates, and AI-driven insights and scalability. Federated Audience Composition allows our customers of Adobe Real-Time Customer Data Platform and Adobe Journey Optimizer to use data from their data partners directly to enrich existing high-value audiences and attributes all in one system. Adobe \n13\nTable of Contents\nExperience Platform also offers Query Service and Data Science Workspace, which enable businesses to gain deeper insights from stored datasets and customer journey intelligence. These tools leverage predefined data-driven operational best practices, AI and business intelligence to enable and optimize real-time decisions, actions and business processes. Our customers can leverage Adobe Experience Platform to activate AI-driven insights across all Adobe Experience Cloud Apps in near real time. Adobe Experience Platform AI Assistant is a generative AI-powered conversational interface that answers technical questions, automates tasks, simulates outcomes and generates new audiences and journeys across applications such as Adobe Real-Time Customer Data Platform, Adobe Journey Optimizer and Adobe Customer Journey Analytics. Adobe Experience Platform AI Assistant uses a collection of experience models designed to address the context of each use case and allows for quick data navigation as needed.\nData Insights and Audiences\nOur Data Insights and Audiences solutions enable our customers to stitch together their data from across the consumer journey into a single view to provide insights based on every interaction in real time, easily share data and analyses across teams and organizations and use AI and machine learning to optimize personalization. The following is a brief description of our products for Data Insights and Audiences.\nAdobe Analytics\nAdobe Analytics helps our customers create a holistic view of their business by turning their customer interactions into actionable insights. Driven by AI and machine learning, Adobe Analytics collects, organizes and structures vast streams of data from virtually any channel, including streaming web data, to deliver real-time insights that are easy for our customers to process, analyze and share to quickly identify problems and opportunities and to drive conversion and relevant customer experiences. Our customers can use these analytics to continuously improve marketing activities and better direct their marketing spend. Our Analysis Workspace features a drag-and-drop interface that allows our customers to craft an analysis, add visualizations so they can bring data to life, curate a dataset and share and schedule projects across their organization, among other features.\nAdobe Customer Journey Analytics\nAdobe Customer Journey Analytics brings a powerful set of analytics tools that allow our customers to interactively explore and visualize the end-to-end customer journey across multiple channels and utilize AI-powered insights, while making such analytics more accessible across their organization, to ensure that customer journeys flow seamlessly regardless of channel.\nAdobe Product Analytics\nAdobe Product Analytics enables product teams to self-serve data and insights about their product experience through guided analysis workflows built on cross-channel data from Adobe Customer Journey Analytics. This cross-functional analytics suite allows product teams to partner closely with their marketing and customer experience counterparts to coordinate and deliver more personalized customer experiences across all channels using a single source of data, audience, and metrics. Adobe Product Analytics has native integrations across Adobe Experience Platform, including integrations with Adobe Journey Optimizer and Adobe Real-Time Customer Data Platform that allow product owners to act immediately by publishing real-time audiences for activation.\nAdobe Mix Modeler\nAdobe Mix Modeler is a self-serve, AI-powered solution that helps organizations measure, optimize, and plan marketing investments. Adobe Mix Modeler applies machine learning models that provide insights via cross-channel, summary datasets in Adobe Experience Platform on the historic and future impact of marketing investments on key business goals. This holistic understanding of the top-to-bottom impact of campaigns enables marketers to measure, plan, monitor, and adjust all marketing campaigns in a single App.\nAdobe Real-Time Customer Data Platform\nAdobe Real-Time Customer Data Platform is an App service that delivers real-time personalization at scale to enable our customers to bring together and securely collaborate on their first-party customer data to activate in real-time their customer and account profiles that allow for B2B and B2C marketers to deliver timely, relevant experiences across channels. Real-Time Customer Data Platform does this by activating a business’ unified customer profiles on Adobe Experience Platform across channels to leverage intelligent decision making throughout the customer journey and deliver hyper-personalized experiences across all known channels and surfaces. Real-Time Customer Data Platform utilizes an open and extensible architecture that \n14\nTable of Contents\nallows integration with a variety of data sources and activation touchpoints and provides continuous data refreshes to keep their customer profiles updated in near real time.\nContent, Commerce and Workflows\nOur Content, Commerce and Workflows solutions help our customers manage, deliver, personalize and optimize on-brand content across web, mobile and App interfaces, as well as enable shopping experiences that scale from mid-market to enterprise businesses, across surfaces and channels. The following is a brief description of our products for Content, Commerce and Workflows. \nAdobe Experience Manager\nAdobe Experience Manager combines digital asset management with a content management system and an end-to-end digital document solution. Adobe Experience Manager Sites provides a marketer and developer-friendly content management system built on a scalable, cloud-native foundation to create and deploy personalized experiences across every channel. Adobe Experience Manager Assets offers cloud-native digital asset management to create, manage, deliver and optimize personalized experiences at scale. Adobe Experience Manager is also available in GenStudio for Performance Marketing, allowing marketers to retrieve generated assets and associated metadata for generating campaign assets. Adobe Experience Manager Forms provides a cloud-native and scalable solution for personalized end-to-end digital customer onboarding and enrollment, enabling our customers to create, manage, publish and approve forms and documents.\nAdobe Experience Manager Screens allows our customers to connect online and in-venue experiences through digital signage. Adobe Developer App Builder provides a set of tools and services for our customers’ developers to extend Experience Manager to their existing infrastructure and apply unique parameters to make the UI look and feel unique for their businesses.\nAdobe Commerce\nAdobe Commerce offers a highly customizable, end-to-end e-commerce platform to manage, personalize and optimize the commerce experience for physical and digital goods across every touchpoint by bringing together digital commerce, order management and predictive intelligence to enable engaging shopping experiences across B2B, B2C and direct-to-consumer. Based on an open-source ecosystem with thousands of third-party extensions, Adobe Commerce extends beyond the online shopping cart to shoppable experiences, with actionable data analysis and automated back-end workflows, native integrations with other Adobe products, such as Adobe Analytics, Adobe Target and Adobe Experience Manager, and the capability to be scalable and extensible.\nAdobe Workfront\nAdobe Workfront provides a unified work management App to enable teams to work more efficiently, with tools to strategize, plan, execute, review and deliver on complex workflows. Integrations with Adobe Creative Cloud and Adobe Experience Manager Assets allow our enterprise customers to scale content production with greater speed and efficiency. Adobe Workfront Planning, offered within Adobe Workfront, streamlines enterprise planning by delivering a comprehensive view of all marketing activities in an organization and enabling teams to be more strategic in planning and execution with full visibility into day-to-day marketing operations.\nAdobe GenStudio for Performance Marketing\nAdobe GenStudio for Performance Marketing is a generative AI-first product within Adobe GenStudio that enables marketing teams to use generative AI to quickly create on-brand advertisements and emails to deliver relevant and personalized experiences to their customers, while allowing brand and creative teams to retain oversight and strategic direction with brand guardrails. Businesses can import content performance data from third party platforms into Adobe GenStudio for Performance Marketing to understand campaign impact and optimize campaign performance. Adobe GenStudio for Performance Marketing natively integrates Digital Media and Digital Experience offerings, including Adobe Express and Adobe Experience Manager Assets, to optimize the process of planning, creating, managing, activating and measuring content for marketing campaigns and personalized customer experiences.\nCustomer Journeys\nOur Customer Journeys solutions enable our customers to manage and orchestrate individual cross-channel campaigns that encourage meaningful customer experiences, personalize content and deliver optimized experiences at scale that are important to each of their customers and plan, orchestrate and measure engagement with their prospects and consumers at every stage of the customer journey. The following is a brief description of our products for Customer Journeys.\n15\nTable of Contents\nAdobe Marketo Engage\nAdobe Marketo Engage is a customer experience management solution optimized for B2B, cross-channel campaigns by bringing together planning, engagement and measurement capabilities into an integrated marketing platform. Capabilities include lead nurturing and management; predictive account profiling for creating account-based experiences; integrated sales App; and integrations with third-party marketing Apps and Adobe Experience Cloud. Adobe Marketo Engage simplifies how companies plan, orchestrate and measure engagement at each stage of the customer experience, and allows companies to better align marketing and sales to engage high priority accounts.\nAdobe Campaign\nAdobe Campaign is optimized for managing B2C cross-channel marketing campaigns. Adobe Campaign enables businesses to orchestrate the entire customer journey and use their customer data to create, coordinate and deliver dynamic, personalized experiences that are synchronized across channels, including email, mobile and offline, and determined by their consumers’ behaviors and preferences. Adobe Campaign’s features also include AI-powered email management, multidimensional targeting, in-App messaging and dynamic, customizable reports to analyze success.\nAdobe Target\nAdobe Target is an AI- and machine learning-driven personalization engine that lets our customers test, target and optimize content across channels. With Adobe Target, our customers have the tools they need to create omnichannel personalized experiences and create A/B and multivariate tests, done at scale through AI-powered automation so they can quickly discover the best experience for their customers and deliver that experience across all touchpoints.\nAdobe Journey Optimizer\nAdobe Journey Optimizer is a scalable App built on Adobe Experience Platform that allows businesses to orchestrate and deliver personalized, connected customer journeys across any App, surface, screen, or channel across B2B and B2C. With this solution, brands can manage inbound customer engagement with outbound omnichannel campaigns and offer personalized content based on real-time profiles, data-driven insights, cloud-native scalability and API extensibility, all within a single App, and, for our B2B customers, build buying groups aligned to their organization’s product portfolio. Businesses can trigger individual consumer journeys and use real-time insights to personalize that journey, as well as visually map individual journeys across systems in an intuitive, workflow-based interface. Adobe Journey Optimizer also allows our customers to track detailed performance of executed journeys and how individuals are progressing in real time, with data automatically sent to Adobe Experience Platform to allow full-funnel analysis.\nOther Products, Services and Solutions \nWe also offer a broad range of other enterprise and digital media products, services and solutions. Information about other products, services and solutions not referenced here can be found on our corporate website, adobe.com.\nOPERATIONS\nMarketing and Sales\nWe market our products, services and solutions directly to enterprise customers through our sales force and local field offices and directly to businesses and consumers. We license our products to end-user customers through App stores and our own website at adobe.com. We offer many of our products via a SaaS model or a managed services model (both of which are referred to as hosted or cloud-based) as well as through term subscription and pay-per-use models. Our subscriptions and free plans include a monthly plan-specific number of Generative Credits for generative AI creation with Adobe Firefly. We market and distribute our products through sales channels, which include distributors, retailers, software developers, mobile App stores, systems integrators, independent software vendors and value-added resellers, as well as through original equipment manufacturers and hardware manufacturers.\nOur local field offices include locations in Australia, Belgium, Brazil, Canada, China, Denmark, France, Germany, Hong Kong, India, Ireland, Italy, Japan, Mexico, the Netherlands, Poland, Romania, Kingdom of Saudi Arabia, Singapore, South Africa, Republic of Korea, Spain, Sweden, Switzerland, Taiwan, Thailand, the United Kingdom and the United States.\nWe sell most of our products through a software subscription model where our customers purchase access to a product for a specific period during which they always have rights to use the most recent version of that product. We also license perpetual versions of certain products with maintenance and support, which includes rights to upgrades, when and if available, support, updates and enhancements.\n16\nTable of Contents\nServices and Support\nWe provide expert consulting, customer success management, technical support and learning services across all our customer segments, which include enterprises, small and medium businesses, creative professionals and consumers. With a focus on ensuring sustained customer success and realized value, this comprehensive portfolio of services is designed to help our customers and partners maximize the return on their investments in our cloud solutions and licensed products.\nConsulting Services\nWe have a global professional services team dedicated to designing and implementing solutions for our largest customers. Our professional services team uses a comprehensive, customer-focused methodology that has been refined over years of capturing and analyzing best practices from numerous customer engagements across a diverse mix of solutions, industries and customer segments. Our customers continually seek to integrate across Adobe’s products and cloud solutions and engage our professional services teams for their expertise in leading our customers’ digital strategies, multi-solution integrations and in running our customers’ platforms. Using our methodology, our professional services teams can accelerate our customers’ time to value and maximize their return on investment in Adobe solutions.\nAnother key component of Adobe’s strategy is developing a large partner ecosystem to expand the availability of Adobe solutions in the global marketplace. To assist partners in building their respective digital practices, Adobe Global Services provides a comprehensive set of deliverables through Adobe’s Solution Partner Program. The breadth of services offered in the program provides systems integrators, agencies and regional partners the tools required to develop core capabilities for positioning and building with Adobe technology, as well as implementing and running our customers’ platforms. We believe that through these programmatic services and support, our joint customers benefit greatly from the combination of Adobe technology and the deep customer context that our partners represent.\nCustomer Success Account Management \nAdobe Customer Solutions provides Customer Success Managers, who work with our enterprise and commercial customers on an ongoing basis to understand their current and future business needs, promote faster solution adoption and align product capabilities to our customers’ business objectives to maximize the return on their investment in Adobe’s offerings. We share innovative best practices, relevant industry and vertical knowledge and proven success strategies based on our extensive engagements with leading marketers and brands. The performance of these teams is directly associated with our customer-focused outcomes.\nTechnical Support\nAdobe provides enterprise maintenance and support services to our subscription customers as part of the subscription entitlement and to our perpetual license customers via annual fee-based maintenance and support programs. These offerings provide our customers with:\n•\ntechnical support on the products our customers have purchased from Adobe; \n•\n“how to” help in using our products; and \n•\nproduct upgrades and enhancements during the term of the maintenance and support or subscription period, which is typically one to three years.\nWe provide product support through our support organization that includes several regional and global support centers, supplemented with outsourced vendors for specific services. Our customers can seek help through multiple channels including phone, chat, web, social media and email, allowing quick and easy access to the information they need. These teams are responsible for providing timely, high-quality technical expertise on all our products.\nCertain consumers are eligible to receive Getting Started support, to assist with easy adoption of their products. Support for some products and in some countries may vary. For our enterprise customers with greater support needs, we offer personalized service options through premium support offerings, delivered by global support centers and technical account managers who can also provide proactive risk mitigation services and on-site support services for those with business-critical deployments.\nWe also offer delivery assurance, technical support and enablement services to partners and developer organizations. We provide developers with high-quality tools, software development kits, information and services.\n17\nTable of Contents\nDigital Learning Services\nAdobe Customer Solutions offers a comprehensive portfolio of learning and enablement services to assist our customer and partner teams in the use of our products, including those within Digital Experience, Digital Media and other legacy products, services and solutions. Our training portfolio includes a large number of free online self-service learning options on learning.adobe.com. Adobe Digital Learning Services also has an extensive portfolio of fee-based learning programs including a wide range of traditional classroom, virtual and on-demand training and certifications delivered by our team of training professionals and partners across the globe.\nThese core offerings are complemented by our custom learning services, which support our largest enterprise customers and their unique requirements. Solution-specific skills assessments help our enterprise customers objectively assess the knowledge and competencies within their marketing teams and tailor their learning priorities accordingly.\nInvestments\nFrom time to time, we make direct investments in privately held companies. We enter these investments with the intent of securing financial returns as well as for strategic purposes, as they often increase our knowledge of technological developments in the industry and expand our opportunities to provide Adobe products, services, and solutions.\nRESEARCH & DEVELOPMENT\nWith the speed of innovation and technological change that characterizes the software industry, a continuous high level of investment is required for the research and development of the cutting-edge technologies that lead to the development of new products, services and solutions and the continual enhancement of existing products, services and solutions. Our Adobe Research team of research scientists, engineers, artists and designers help turn ideas into technologies that power the future of our products, services and solutions. We are investing, and intend to continue to invest, in research and development to strengthen our existing products, services and solutions, and to expand our offerings across our clouds and the next generation of AI, machine learning and deep learning-driven tools and features to solve problems in areas such as content understanding and generation, recommendations, personalization and more. \nIn addition to our own research and development, we acquire products or technology developed by others by purchasing the stock or assets of the business entity that owns the technology. In other instances, we have licensed or purchased the intellectual property ownership rights of programs developed by others with license or technology transfer agreements that may obligate us to pay a flat license fee or royalties, typically based on a dollar amount per unit or a percentage of the revenue generated by those programs.\nPROTECTING AND LICENSING OUR PRODUCTS\nWe protect our intellectual property through a combination of patents, copyrights, trademarks and trade secrets, foreign intellectual property laws, confidentiality procedures and contractual provisions. We have U.S. and international patents and pending applications that relate to various aspects of our products and technology. Although our patents have value, no single patent is essential to any of our principal businesses. We have also registered, and applied for the registration of, U.S. and international trademarks, service marks, domain names and copyrights.\nWe license our desktop software and mobile Apps to users and customers under ‘click through’ or signed license agreements containing restrictions on duplication, disclosure and transfer. Similarly, cloud products and services are provided to users and customers under ‘click through’ or signed agreements containing restrictions on access and use. Our enterprise customers license our hosted offerings as SaaS or Managed Services via agreements based on our enterprise licensing terms.\nDespite our efforts to protect our proprietary technology and our intellectual property rights, unauthorized parties may attempt to copy or obtain and use our technology to develop Apps with the same functionality as our Apps. Policing unauthorized use of our technology and intellectual property rights is difficult. We believe that our subscription-based business model combined with the increased focus on cloud-based computing has and may continue to improve our efforts to combat the pirating of our products.\n18\nTable of Contents\nHUMAN CAPITAL\nOur culture is built on the foundation that our people and the way we treat one another promote creativity, innovation and performance, which spur our success. We are continually investing in our global workforce to provide fair and market-competitive pay and benefits to support our employees’ wellbeing, foster their growth and development, and to further drive diversity and inclusion. As of November 29, 2024, we employed 30,709 people, of which 50% were in the United States and 50% were in our international locations. During fiscal 2024, our total attrition rate was 7.8%. We have not experienced work stoppages and believe our employee relations are good. Understanding employee sentiment and listening to employee feedback is important to Adobe. We utilize a variety of feedback mechanisms throughout an employee lifecycle to gather insights that help inform our decision-making regarding employee programs, talent risks, management opportunities, employee networks and more. In fiscal 2024, 81% of our employees participated in our most recent engagement survey.\nDigital transformation has fundamentally changed how people work, and we continue to lean into digital-first workflows, tools and resources to enable us to be productive, wherever we are. We also believe in the value of people being together—fostering trust, relationships and collaboration and innovation. We have evolved into a hybrid model, in which employees who are assigned to an office can divide their work between the office and home about half the time. We continue to pilot, test and iterate our approach to support new ways of working and evolving the employee experience.\nWe encourage you to visit our website for more detailed information regarding our Human Capital programs and initiatives.\nCompensation, Benefits and Wellbeing\nAdobe offers fair, competitive compensation and benefits that support our employees’ overall wellbeing. To ensure alignment with our short- and long-term objectives, our compensation programs for all employees include base pay, short-term incentives and opportunities for long-term incentives. We believe this alignment, whether through equity awards issued by Adobe or participation in our employee stock purchase plan, makes employee shareholders more deeply connected to Adobe and engaged in contributing to our long-term success.\nOur benefit programs focus on four key wellbeing pillars: physical, emotional, financial and work and life. We offer a wide array of benefits including comprehensive health and welfare insurance, ergonomic support, employee assistance programs, wellbeing support programs, retirement, financial coaches and generous time-off and leave. In addition, we provide educational tools and resources, such as the global wellbeing speaker series, to help employees reach their personal wellbeing goals. We also strive to build community by bringing together our employees through onsite events, discussion groups, messaging forums and our Employee Networks as we believe that a sense of belonging contributes to our employees’ overall wellbeing.\nGrowth and Development\nWe provide employees with opportunities to build and develop a meaningful career. The Global Talent Development team creates programs to grow leaders and continually enhance the skills of our employee base. In addition to the content and experiences created in house, employees also have access to on-demand content via several industry-leading learning platforms. Through Adobe’s Learning Fund, employees are eligible to receive up to $11,000 per year toward university and short-term learning opportunities.\nWe are committed to enabling a culture that celebrates talent sharing, career development and agility across Adobe. We post all roles internally first before sharing them externally and provide resources to make the internal job search easier for employees. We also provide forums for managers and employees to have regular conversations about their career and contributions throughout the year. \nDiversity and Inclusion\nAdobe for All is our vision to advance diversity, equity and inclusion across Adobe. We recognize that when people feel respected and included, they can be more creative, innovative and successful. As of November 29, 2024, women represented 35.4% of our global employees, and underrepresented minorities (“URMs,” defined as those who identify as Black/African American, Hispanic/Latinx, Native American, Pacific Islander and/or two or more races) represented 11.6% of our U.S. employees.  \n19\nTable of Contents\nWe have a three-pillar strategy to grow the diversity and inclusion of our workforce over time, on which we have continued to drive progress during fiscal 2024:\n•\nWorkforce\n: We take action to improve the hiring, retention and promotion of a more diverse workforce that reflects Adobe’s global footprint. We invest in partnerships and events to grow our pipeline and engage candidates across underrepresented communities. We aim to give individuals from nontraditional backgrounds new skills and opportunities to enter technology and design careers through Adobe Digital Academy, in partnership with our educational partners. \n•\nWorkplace\n: We believe a sense of inclusion propels high performance resulting in creativity and innovation for Adobe. Consequently, we advance our vision of Adobe for All by building an inclusive environment that inspires a sense of belonging. Our annual Adobe for All event provides a unifying experience for employees to celebrate progress, be inspired by employee and guest speakers’ stories, and have a greater appreciation for how diversity, equity and inclusion positively impacts our people, purpose, and product efforts. We offer family-friendly benefits, support our employee resource groups to create community for employees from underrepresented groups and offer employees learning opportunities to strengthen their allyship.\n•\nEcosystem\n: Our employees, our customers and the communities we serve care deeply about diversity, equity, and inclusion. As result, we actively align our commitments to our products, partnerships and community engagement to amplify our reach and impact. We collaborate with industry peers to advance diversity across multiple dimensions, including through product equity and accessibility, as well as efforts to address harm and bias in our products. Through the Adobe Foundation, we continue to invest in our Equity and Advancement Initiative and in our partnerships with minority-serving institutions to support their students and faculties and the communities they serve. \nAdditional information on our diversity and inclusion programs can be found on our website at adobe.com/corporate-responsibility. \nAVAILABLE INFORMATION\n \nOur website address is adobe.com. Our Annual Report on Form 10-K, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K and all amendments to those reports filed or furnished pursuant to Sections 13(a) and 15(d) of the Securities Exchange Act of 1934, as amended, are available free of charge on our Investor Relations website at www.adobe.com/adbe as soon as reasonably practicable after we electronically file such material with, or furnish it to, the SEC. The information posted to our website and contents of the websites referred to above are not incorporated into this Annual Report on Form 10-K.\nInvestors and others should note that we announce material financial information to our investors using our investor relations website (www.adobe.com/adbe), SEC filings, press releases, public conference calls and webcasts. We use these channels, including our website and social media, to communicate with our investors and the general public about us, our products, services and solutions and other issues, and to comply with our disclosure obligations under Regulation FD. It is possible that the information that we make available on our website or social media could be deemed to be material information. Therefore, we encourage investors and others interested in Adobe to review the information we make available on our website and the social media channels listed on our website.\nINFORMATION ABOUT OUR EXECUTIVE OFFICERS\n \nAdobe’s executive officers as of January 13, 2025 are as follows:\nName\nAge\nPositions\nShantanu Narayen\n61\nChair and Chief Executive Officer\nMr. Narayen currently serves as our Chief Executive Officer and Chair of the Board. He joined Adobe in January 1998 as Vice President and General Manager of our engineering technology group. In January 1999, he was promoted to Senior Vice President, Worldwide Products, and in March 2001, he was promoted to Executive Vice President, Worldwide Product Marketing and Development. In January 2005, Mr. Narayen was promoted to President and Chief Operating Officer, and effective December 2007, he was appointed our Chief Executive Officer and joined our Board. In January 2017, he was named our Chair of the Board. Mr. Narayen holds a B.S. in Electronics Engineering from Osmania University in India, an M.S. in Computer Science from Bowling Green State University and an M.B.A. from the Haas School of Business, University of California, Berkeley.\n20\nTable of Contents\nName\nAge\nPositions\nDaniel Durn\n58\nChief Financial Officer and Executive Vice President, Finance, Technology, Security and Operations\nMr. Durn currently serves as our Chief Financial Officer and Executive Vice President, Finance, Technology, Security and Operations. Mr. Durn joined Adobe in October 2021 as our Executive Vice President and Chief Financial Officer. From August 2017 to October 2021, Mr. Durn served as a Senior Vice President and Chief Financial Officer of Applied Materials, Inc., a semiconductor equipment company. From December 2015 to August 2017, Mr. Durn served as Executive Vice President and Chief Financial Officer at NXP Semiconductors N.V., following its merger with Freescale Semiconductor Inc. (\"Freescale\"). From June 2014 to December 2015, Mr. Durn served as Senior Vice President of Finance and Chief Financial Officer at Freescale. Before Freescale, he served as Chief Financial Officer and Executive Vice President of Finance and Administration at GlobalFoundries, a multinational semiconductor company, and he served as Managing Director and Head of Mergers and Acquisitions and Strategy at Mubadala Technology Fund, a private equity fund. Prior to that, Mr. Durn was a Vice President of Mergers and Acquisitions in the technology practice at Goldman Sachs & Company, a global investment banking firm. Mr. Durn currently serves on the board of directors of Marvell Technology, Inc., a semiconductor equipment company. Mr. Durn received his MBA in Finance from Columbia Business School and graduated from the U.S. Naval Academy with a B.S. in Control Systems Engineering. He served in the Navy for six years, reaching the rank of lieutenant.\nAnil Chakravarthy\n57\nPresident, Digital Experience\nMr. Chakravarthy currently serves as President of Adobe’s Digital Experience business. Mr. Chakravarthy joined Adobe in January 2020 as Executive Vice President and General Manager, Digital Experience and was given responsibility over Worldwide Field Operations in July 2020, when he was appointed Executive Vice President and General Manager, Digital Experience Business and Worldwide Field Operations. Prior to joining Adobe, he served as Chief Executive Officer of Informatica LLC (\"Informatica\"), a software company, from August 2015 to January 2020 and Executive Vice President and Chief Product Officer from September 2013 to August 2015. Prior to joining Informatica, for over nine years, Mr. Chakravarthy held multiple leadership roles at Symantec Corporation (\"Symantec\"), a cybersecurity software and services company, most recently serving as its Executive Vice President, Information Security from February 2013 to September 2013. Prior to Symantec, he was a Director of Product Management for enterprise security services at VeriSign Inc., a network infrastructure company. Mr. Chakravarthy began his career as an engagement manager at McKinsey & Company, a global management consulting firm. He currently serves on the board of Ansys, Inc. and also served on the board of the Silicon Valley Leadership Group until December 2021. Mr. Chakravarthy holds a Bachelor of Technology in Computer Science and Engineering from the Institute of Technology, Varanasi, India and M.S. and Ph.D. degrees from the Massachusetts Institute of Technology.\nDavid Wadhwani\n53\nPresident, Digital Media\nMr. Wadhwani currently serves as President of Adobe’s Digital Media business. Mr. Wadhwani rejoined Adobe in June 2021 to lead Adobe’s global Digital Media business across Adobe Creative Cloud and Adobe Document Cloud as Chief Business Officer and Executive Vice President, Digital Media. Prior to joining Adobe, he was a Venture Partner at Greylock Partners, a venture capital firm, since October 2019. From September 2015 to October 2019, he was President and CEO of AppDynamics, a software company. Before that, Mr. Wadhwani previously worked at Adobe as Senior Vice President and General Manager of Adobe’s Digital Media business, having joined Adobe in 2005 through the Company’s acquisition of Macromedia, Inc., a software company, where he had been Vice President of Developer Products. Mr. Wadhwani holds a bachelor’s degree in computer science from Brown University and serves on the Brown computer science department advisory board. Mr. Wadhwani also advises early stage and growth companies and is on the board of directors of Gem Software, Inc. and on the board of trustees of StoryCorps and the Fine Arts Museums of San Francisco.\n21\nTable of Contents\nName\nAge\nPositions\nLara Balazs\n55\nChief Marketing Officer and Executive Vice President, Global Marketing\nMs. Balazs joined Adobe in December 2024 and currently serves as our Chief Marketing Officer and Executive Vice President, Global Marketing. From February 2021 to September 2024, Ms. Balazs served as Executive Vice President, General Manager, Strategic Partnership Group and Chief Marketing Officer of Intuit, Inc., a global financial technology platform (“Intuit”). From November 2018 to February 2021, Ms. Balazs served as Senior Vice President, Chief Marketing Officer of Intuit. From November 2017 to July 2018, Ms. Balazs served as Vice President, Worldwide Marketing, Prime, and North America, of Amazon.com, Inc., an online retailer and web service provider of consumer goods. From January 2006 to September 2017, Ms. Balazs held various leadership roles at Visa, Inc., a global payments technology company, including Senior Vice President, Head, North America Marketing; Head, Global Innovation Marketing; Head of Global Product Marketing Strategy and Planning; Head of Global and U.S. General Consumer Marketing; and Senior Director, U.S. Marketing. From 2001 to 2004, Ms. Balazs served in various marketing management roles at Nike, Inc., a global athletic footwear and apparel company, and Gap, Inc., a global apparel company. Ms. Balazs currently serves on the board of directors of Frontdoor, Inc., a home services company. Ms. Balazs holds a bachelor’s degree in Society & Justice from the University of Washington, and an M.B.A. from Northwestern University.\nScott Belsky\n44\nChief Strategy Officer and Executive Vice President, Design & Emerging Products\nMr. Belsky currently serves our Chief Strategy Officer and EVP, Design & Emerging Products. From December 2017 to March 2023, he served as our Chief Product Officer and Executive Vice President, Creative Cloud. Prior to joining Adobe in December 2017, Mr. Belsky was a venture investor at Benchmark, a venture capital firm, from February 2016 to December 2017. Prior to Benchmark, Mr. Belsky led Adobe's mobile strategy for Creative Cloud from December 2012 to January 2016, having joined the Company through the acquisition of Behance, a social media platform for creative work. Mr. Belsky co-founded Behance in 2006 and served as its Chief Executive Officer for over 6 years. He was an early advisor and investor to Pinterest, Inc., a software company, Uber Technologies, Inc., a multinational ride-sharing company, and Warby Parker Inc., an online retailer, and other early-stage companies. Mr. Belsky currently serves on the board of directors of Atlassian Corporation, an enterprise software company, on the advisory board of Cornell University's Entrepreneurship Program and on the board of trustees of the Museum of Modern Art. Mr. Belsky holds a bachelor’s degree from Cornell University and an MBA from Harvard Business School.\nGloria Chen\n60\nChief People Officer and Interim Executive Vice President, Legal and Government Relations\nMs. Chen joined Adobe in 1997 and currently serves as our Chief People Officer and Interim EVP, Legal and Government Relations. From January 2020 to September 2024, Ms. Chen served as our Chief People Officer and Executive Vice President, Employee Experience. In her more than 25 years at Adobe, she has held senior leadership positions in worldwide sales operations, customer service and support, and strategic planning. In October 2009, Ms. Chen was appointed Vice President and Chief of Staff to the Chief Executive Officer. In March 2018, she was promoted to Senior Vice President, Strategy and Growth, in November 2019, she was elevated to Executive Vice President, Strategy and Growth and in January 2020, she was promoted to Chief People Officer and Executive Vice President, Employee Experience. Prior to joining Adobe, Ms. Chen was an engagement manager at McKinsey & Company, a global management consulting firm. Ms. Chen holds a BS in electrical engineering from the University of Washington, an M.S. in electrical and computer engineering from Carnegie Mellon University and an MBA from Harvard Business School.\nJillian Forusz\n50\nSenior Vice President, Chief Accounting Officer and Corporate Controller\nMs. Forusz currently serves as our Senior Vice President, Chief Accounting Officer and Corporate Controller. Ms. Forusz served as our Vice President, Corporate Controller from February 2022 to August 2024, Vice President, Accounting & Operations from November 2019 to February 2022 and Senior Director from November 2015 to November 2019. Between November 2007 and November 2015, Ms. Forusz held various finance leadership positions of increasing responsibility at Adobe. Prior to joining Adobe, Ms. Forusz worked in the Audit practice at Deloitte. Ms. Forusz holds a bachelor’s degree from Penn State University.\n22\nTable of Contents",
  "item7": "ITEM 7.  MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\n \nThe following discussion should be read in conjunction with our Consolidated Financial Statements and Notes thereto. Discussion regarding our financial condition and results of operations for fiscal 2023 as compared to fiscal 2022 is included in Item 7 of our Annual Report on Form 10-K for the fiscal year ended December 1, 2023, filed with the SEC on January 17, 2024.\nCRITICAL ACCOUNTING POLICIES AND ESTIMATES\nIn preparing our Consolidated Financial Statements in accordance with generally accepted accounting principles in the United States (“GAAP”) and pursuant to the rules and regulations of the SEC, we make assumptions, judgments and estimates that affect the reported amounts of assets, liabilities, revenue and expenses, and related disclosures of contingent assets and liabilities. We base our assumptions, judgments and estimates on historical experience and various other factors that we believe to be reasonable under the circumstances. Actual results could differ materially from these estimates under different assumptions or conditions. We evaluate our assumptions, judgments and estimates on a regular basis. We also discuss our critical accounting policies and estimates with the Audit Committee of the Board of Directors.\nWe believe that the assumptions, judgments and estimates involved in the accounting for revenue recognition and income taxes have the greatest potential impact on our Consolidated Financial Statements. These areas are key components of our results of operations and are based on complex rules requiring us to make judgments and estimates, and consequently, we consider these to be our critical accounting policies. Historically, our assumptions, judgments and estimates relative to our critical accounting policies have not differed materially from actual results.\nRevenue Recognition \nOur contracts with customers may include multiple goods and services. For example, some of our offerings include both on-premise and/or on-device software licenses and cloud services. Determining whether the software licenses and the cloud services are distinct from each other, and therefore performance obligations to be accounted for separately, or not distinct from each other, and therefore part of a single performance obligation, may require significant judgment. We have concluded that the on-premise/on-device software licenses and cloud services provided in our Creative Cloud and Document Cloud subscription offerings are not distinct from each other such that revenue from each offering should be recognized ratably over the subscription period for which the cloud services are provided. In reaching this conclusion, we considered the nature of our promise to Creative Cloud and Document Cloud customers, which is to provide a complete end-to-end creative design or document workflow solution that operates seamlessly across multiple devices and teams. We fulfill this promise by providing access to a solution that integrates cloud-based and on-premise/on-device features that, together through their integration, provide functionalities, utility and workflow efficiencies that could not be obtained from either the on-premise/on-device software or cloud services on their own.\nCloud-based features that are integral to our Creative Cloud and Document Cloud offerings and that work together with the on-premise/on-device software include, but are not limited to: Creative Cloud Libraries, which enable customers to access their work, settings, preferences and other assets seamlessly across desktop and mobile devices and collaborate across teams in real time; shared reviews which enable simultaneous editing and commenting of digital assets across desktop, mobile and web; automatic cloud rendering of a design which enables it to be worked on in multiple mediums; and Sensei, Adobe’s cloud-hosted artificial intelligence and machine learning framework, which enables features such as automated photo-editing, photograph content-awareness, natural language processing, optical character recognition and automated document tagging.\nAccounting for Income Taxes\nWe use the asset and liability method of accounting for income taxes. Under this method, income tax expense is recognized for the amount of taxes payable or refundable for the current year. In addition, deferred tax assets and liabilities are recognized for the expected future tax consequences of temporary differences between the financial reporting and tax bases of assets and liabilities, and for tax loss and credit carryforwards. Significant judgment is required in determining our current provision for income taxes and deferred tax assets or liabilities. We record a valuation allowance to reduce deferred tax assets to an amount for which realization is more likely than not.\nOur assumptions, judgments and estimates relative to the current provision for income taxes take into account our interpretation and application of current tax laws and possible outcomes of current and future examinations conducted by domestic and foreign tax authorities. We have established reserves for income taxes to address potential exposures involving tax positions that could be challenged by tax authorities. We regularly assess the likelihood of outcomes resulting from these examinations to determine the adequacy of our provision for income taxes and associated reserves. To the extent that the final \n38\nTable of Contents\ndetermination of any of these examinations is different from the amounts recorded, such differences will affect the provision for income taxes and the effective tax rate in the period in which such determination is made.\nRecent Accounting Pronouncements \nSee Note 1 of our \nNotes\n to Consolidated Financial Statements for information regarding recent accounting pronouncements that are of significance or potential significance to us.\nRESULTS OF OPERATIONS\nOverview of 2024\nFor our fiscal 2024, we experienced strong demand across our Digital Media and Digital Experience offerings, driven by our innovative product roadmap. As we execute on our long-term growth initiatives, with focus on delivering product innovation and driving adoption and usage of our AI-powered solutions, we have continued to experience growth in software-based subscription revenue across our portfolio of offerings.\nDigital Media\nIn our Digital Media segment, we are a market leader with Creative Cloud, our subscription-based offering which provides desktop tools, mobile applications (“apps”) and cloud-based services for designing, creating and publishing rich content and immersive 3D experiences. Creative Cloud offers Adobe Acrobat Pro, our comprehensive PDF solution, integral to creative workflows and used by creators worldwide as part of our Creative Cloud All Apps subscription and on a standalone basis. In addition, Adobe Express is our web and mobile app designed to enable a broad spectrum of users, including novice content creators, communicators and creative professionals, to create, edit and customize content quickly and easily with content-first, task-based solutions. Creative Cloud also includes Adobe Firefly, a group of creative generative AI models designed to generate high quality images and text effects. Adobe Firefly-powered generative AI features are also available across Creative Cloud apps including Adobe Photoshop and Adobe Express. Creative Cloud delivers value with deep, cross-product integration, frequent product updates and feature enhancements, cloud-enabled services including storage and syncing of files across users’ devices, machine learning and artificial intelligence, access to marketplace, social and community-based features with our Adobe Stock and Behance services, app creation capabilities, tools which assist with enterprise deployments and team collaboration, and affordable pricing for cost-sensitive customers.\nWe offer Creative Cloud for individuals, students, teams and enterprises. We expect Creative Cloud will drive sustained long-term revenue growth through a continued expansion of our customer base by attracting new users with new features and products like Adobe Express and Adobe Firefly that make creative tools accessible to first-time creators and communicators, and delivering new features and technologies to existing customers with our latest releases such as generative AI capabilities. We have also built out a marketplace for Creative Cloud subscribers to enable the delivery and purchase of stock content in our Adobe Stock service. Overall, our strategy with Creative Cloud is designed to enable us to increase our revenue with existing users, continue to attract new customers, and grow our recurring and predictable revenue stream that is recognized ratably.\nWe continue to implement strategies that are designed to accelerate awareness, consideration and purchase of subscriptions to our Creative Cloud offerings. These strategies include increasing the value Creative Cloud users receive, such as offering new and enhanced desktop, web and mobile apps, as well as targeted promotions and offers that attract past customers and potential users to experience and ultimately subscribe to Creative Cloud. Because of the shift towards Creative Cloud subscriptions and Enterprise Term License Agreements (“ETLAs”), revenue from perpetual licensing of our Creative products has been immaterial to our business.\nWe are also a market leader with our Document Cloud offerings built around our Adobe Acrobat family of products, with a set of integrated mobile apps and cloud-based document services which enable users to create, collaborate, review, approve, sign and track documents regardless of platform or application source type. Document Cloud, which enhances the way people manage critical documents at home, in the office and across devices, includes subscriptions to Adobe Acrobat Pro and Standard, Adobe Acrobat Sign and Adobe Scan. Certain Adobe Acrobat products are also offered as perpetual licenses which are immaterial to our business. In April 2024, we introduced Acrobat AI Assistant, a generative AI-powered product designed to deliver insights and enhance productivity through interactive document experiences, which is available as an add-on subscription to our Adobe Acrobat Pro and Standard and Adobe Acrobat Reader products.\nAs part of our Creative Cloud and Document Cloud strategies, we utilize a data-driven operating model (“DDOM”) and our Adobe Experience Cloud solutions to raise awareness of our products, drive new customer acquisition, engagement and retention, and optimize customer journeys, which continue to contribute strong product-led growth in the business.\n39\nTable of Contents\nAnnualized Recurring Revenue (“ARR”) is currently the key performance metric our management uses to assess the health and trajectory of our overall Digital Media segment. ARR should be viewed independently of revenue, deferred revenue and remaining performance obligations as ARR is a performance metric and is not intended to be combined with any of these items. We adjust our reported ARR on an annual basis to reflect any exchange rate changes. Our reported ARR results in the current fiscal year are based on currency rates set at the beginning of the year and held constant throughout the year for measurement purposes. We calculate ARR as follows:\nCreative ARR\nAnnual Value of Creative Cloud Subscriptions and Services\n+ \nAnnual Creative ETLA Contract Value \nDocument Cloud ARR\nAnnual Value of Document Cloud Subscriptions and Services \n+\nAnnual Document Cloud ETLA Contract Value\nDigital Media ARR\nCreative ARR\n+ \nDocument Cloud ARR\nCreative ARR exiting fiscal 2024 was $13.85 billion, up from $12.49 billion at the end of fiscal 2023. Document Cloud ARR exiting fiscal 2024 was $3.48 billion, up from $2.84 billion at the end of fiscal 2023. Total Digital Media ARR grew to $17.33 billion at the end of fiscal 2024, up from $15.33 billion at the end of fiscal 2023. Revaluing our ending ARR for fiscal 2024 using currency rates determined at the beginning of fiscal 2025, our Digital Media ARR at the end of fiscal 2024 would be $17.22 billion or approximately $117 million lower than the ARR reported above.\nOur success in driving growth in ARR has positively affected our revenue growth. Creative revenue in fiscal 2024 was $12.68 billion, up from $11.52 billion in fiscal 2023, representing 10% year-over-year growth. Document Cloud revenue in fiscal 2024 was $3.18 billion, up from $2.70 billion in fiscal 2023, representing 18% year-over-year growth. Total Digital Media segment revenue grew to $15.86 billion in fiscal 2024, up from $14.22 billion in fiscal 2023, representing 12% year-over-year growth.\nDigital Experience\nWe are a market leader in the fast-growing category addressed by our Digital Experience segment. The Adobe Experience Cloud apps and services are designed to manage customer journeys, enable personalized experiences at scale and deliver intelligence for businesses of any size in any industry. Our differentiation and competitive advantage are strengthened by our ability to use the Adobe Experience Platform to integrate our comprehensive set of solutions and our ability to embed AI into our product portfolio, such as with our new Adobe Experience Platform AI Assistant, a generative AI-powered conversational interface designed to help customers automate workflows and generate new audiences and journeys.\nAdobe Experience Cloud delivers solutions for our customers across the following strategic growth pillars:\n•\nData insights and audiences\n. Our products deliver actionable data to our customers in real time to enable highly tailored and adaptive experiences across platforms through Adobe Analytics, Adobe Customer Journey Analytics, Adobe Product Analytics, Adobe Mix Modeler, and Adobe Real-time Customer Data Platform.\n•\nContent, commerce and workflows\n. Our products help our customers manage, deliver, personalize, and optimize content delivery through Adobe Experience Manager; build multi-channel commerce experiences for B2B and B2C customers with Adobe Commerce; strategically plan, manage, collaborate and execute on workflows for marketing campaigns and other projects at speed and scale with our enterprise work management App, Adobe Workfront; and leverage self-serve capabilities to deliver on-brand content powered by generative AI in Adobe GenStudio for Performance Marketing.\n•\nCustomer journeys\n. Our products help businesses manage, test, target and personalize customer journeys delivered as campaigns across B2B and B2C use cases, including through Adobe Marketo Engage, Adobe Campaign, Adobe Target and Adobe Journey Optimizer.\nIn addition to chief marketing officers, chief revenue officers and digital marketers, users of our Digital Experience solutions include advertisers, campaign managers, publishers, data analysts, content managers, social marketers, marketing executives and information management and technology executives. These customers often are involved in workflows that integrate other Adobe products, such as our Digital Media offerings. By combining the creativity of our Digital Media business \n40\nTable of Contents\nwith the science of our Digital Experience business, such as with our Adobe GenStudio solution, we help our customers to more efficiently and effectively make, manage, measure and monetize their content across every channel with an end-to-end workflow and feedback loop.\nWe utilize a direct sales force to market and license our Digital Experience solutions, as well as an extensive ecosystem of partners, including marketing agencies, systems integrators and independent software vendors that help license and deploy our solutions to their customers. We have made significant investments to broaden the scale and size of all of these routes to market, and our recent financial results reflect the success of these investments and our experience-led growth strategy.\nDigital Experience revenue was $5.37 billion in fiscal 2024, up from $4.89 billion in fiscal 2023, representing 10% year-over-year growth. Subscription revenue grew to $4.86 billion in fiscal 2024, up from $4.33 billion in fiscal 2023, representing 12% year-over-year growth.\nMacroeconomic Conditions\nAs a corporation with an extensive global footprint, we are subject to risks and exposures from the evolving macroeconomic environment, including the effects of increased global inflationary pressures and interest rates, fluctuations in foreign currency exchange rates, potential economic slowdowns or recessions and geopolitical pressures, including the unknown impacts of current and future trade regulations. We continuously monitor the direct and indirect impacts of these circumstances on our business and financial results.\nWhile our revenue and earnings are relatively predictable as a result of our subscription-based business model, the broader implications of these macroeconomic events on our business, results of operations and overall financial position, particularly in the long term, remain uncertain. \nSee the section titled “Risk Factors” in Part I, Item 1A of this report for further discussion of the possible impact of these macroeconomic issues on our business.\nFinancial Performance Summary for Fiscal 2024\n•\nTotal Digital Media ARR of approximately $17.33 billion as of November 29, 2024 increased by $2.00 billion, or 13%, from $15.33 billion as of December 1, 2023.\n•\nCreative revenue of $12.68 billion during fiscal 2024 increased by $1.17 billion, or 10%, from $11.52 billion in fiscal 2023. Document Cloud revenue of $3.18 billion during fiscal 2024 increased by $483 million, or 18%, from $2.70 billion in fiscal 2023.\n•\nDigital Experience revenue of $5.37 billion during fiscal 2024 increased by $473 million, or 10%, from $4.89 billion in fiscal 2023.\n•\nCost of revenue of $2.36 billion during fiscal 2024 remained relatively flat compared to fiscal 2023.\n•\nOperating expenses of $12.41 billion during fiscal 2024 increased by $2.00 billion, or 19%, from $10.41 billion in fiscal 2023 primarily due to the $1 billion Figma termination fee incurred in fiscal 2024.\n•\nNet income of $5.56 billion during fiscal 2024 increased by $132 million, or 2%, from $5.43 billion in fiscal 2023.\n•\nCash flows from operations of $8.06 billion during fiscal 2024 increased by $754 million, or 10%, from $7.30 billion in fiscal 2023.\n•\nRemaining performance obligations of $19.96 billion as of November 29, 2024 increased by $2.75 billion, or 16%, from $17.22 billion as of December 1, 2023.\n41\nTable of Contents\nRevenue\n(dollars in millions)\n2024\n2023\n2022\n% Change\n2024-2023\nSubscription\n$\n20,521 \n$\n18,284 \n$\n16,388 \n12 \n%\nPercentage of total revenue\n95 \n%\n94 \n%\n93 \n%\n \nProduct\n386 \n460 \n532 \n(16)\n%\nPercentage of total revenue\n2 \n%\n2 \n%\n3 \n%\n \nServices and other\n598 \n665 \n686 \n(10)\n%\nPercentage of total revenue\n3 \n%\n4 \n%\n4 \n%\n \nTotal revenue\n$\n21,505 \n$\n19,409 \n$\n17,606 \n11 \n%\nSubscription\nOur subscription revenue is comprised primarily of fees we charge for our subscription and hosted service offerings, and related support, including Creative Cloud and certain of our Adobe Experience Cloud and Document Cloud services. We primarily recognize subscription revenue ratably over the term of agreements with our customers, beginning with commencement of service. Subscription revenue related to certain offerings, where fees are based on a number of transactions and invoicing is aligned to the pattern of performance, customer benefit and consumption, are recognized on a usage basis.\nWe have the following reportable segments: Digital Media, Digital Experience, and Publishing and Advertising. Subscription revenue by reportable segment for fiscal 2024, 2023 and 2022 is as follows:\n(dollars in millions)\n2024\n2023\n2022\n% Change\n2024-2023\nDigital Media\n$\n15,547 \n$\n13,838 \n$\n12,385 \n12 \n%\nDigital Experience\n4,864 \n4,331 \n3,880 \n12 \n%\nPublishing and Advertising\n110 \n115 \n123 \n(4)\n%\nTotal subscription revenue\n$\n20,521 \n$\n18,284 \n$\n16,388 \n12 \n%\nProduct\nOur product revenue is comprised primarily of fees related to licenses for on-premise software purchased on a perpetual basis, for a fixed period of time, or based on usage for certain of our original equipment manufacturer and royalty agreements. We primarily recognize product revenue at the point in time the software is available to the customer, provided all other revenue recognition criteria are met.\nServices and Other\nOur services and other revenue is comprised primarily of fees related to consulting, training, maintenance and support for certain on-premise licenses that are recognized at a point in time and our advertising offerings. We typically sell our consulting contracts on a time-and-materials or fixed-fee basis. These revenues are recognized as the services are performed for time-and-materials contracts and on a relative performance basis for fixed-fee contracts. Training revenues are recognized as the services are performed. Our maintenance and support offerings, which entitle customers, partners and developers to receive desktop product upgrades and enhancements or technical support, depending on the offering, are generally recognized ratably over the term of the arrangement. Transaction-based advertising revenue is recognized on a usage basis as we satisfy the performance obligations to our customers.\nSegments \nIn fiscal 2024, we categorized our products into the following reportable segments:\n•\nDigital Media\n—Our Digital Media segment provides products and services that enable individuals, teams, businesses, and enterprises to create, publish and promote their content anywhere and accelerate their productivity by transforming how they view, share, engage with and collaborate on documents and creative content. Our customers include creative professionals, including photographers, video editors, graphic and experience designers and game developers; communicators, including content creators, students, marketers and knowledge workers; and consumers. \n•\nDigital Experience\n—Our Digital Experience segment provides an integrated platform and set of products, services and solutions that enable businesses to create, manage, execute, measure, monetize and optimize customer \n42\nTable of Contents\nexperiences that span from analytics to commerce. Our customers include marketers, advertisers, agencies, publishers, merchandisers, merchants, web analysts, data scientists, developers and executives across the C-suite. \n•\nPublishing and Advertising\n—Our Publishing and Advertising segment contains legacy products and services that address diverse market opportunities, including eLearning solutions, technical document publishing, web conferencing, document and forms platform, web app development, high-end printing and our Adobe Advertising offerings.\nSegment Information\n(dollars in millions)\n2024\n2023\n2022\n% Change\n2024-2023\nDigital Media\n$\n15,864 \n$\n14,216 \n$\n12,842 \n12 \n%\nPercentage of total revenue\n74 \n%\n73 \n%\n73 \n%\n \nDigital Experience\n5,366 \n4,893 \n4,422 \n10 \n%\nPercentage of total revenue\n25 \n%\n25 \n%\n25 \n%\n \nPublishing and Advertising\n275 \n300 \n342 \n(8)\n%\nPercentage of total revenue\n1 \n%\n2 \n%\n2 \n%\n \nTotal revenue\n$\n21,505 \n$\n19,409 \n$\n17,606 \n11 \n%\nDigital Media\nRevenue by major offerings in our Digital Media reportable segment for fiscal 2024, 2023 and 2022 were as follows:\n(dollars in millions)\n2024\n2023\n2022\n% Change\n2024-2023\nCreative Cloud\n$\n12,682 \n$\n11,517 \n$\n10,459 \n10 \n%\nDocument Cloud\n3,182 \n2,699 \n2,383 \n18 \n%\nTotal Digital Media revenue\n$\n15,864 \n$\n14,216 \n$\n12,842 \n12 \n%\nRevenue from Digital Media increased $1.65 billion during fiscal 2024 as compared to fiscal 2023, driven by increases in revenue associated with our Creative and Document Cloud subscription offerings due to continued demand amid an increasingly digital environment, strong engagement across customer segments and migrating our customers to higher valued subscription offerings with increased revenue per subscription.\nDigital Experience\nRevenue from Digital Experience increased $473 million during fiscal 2024 as compared to fiscal 2023 driven by subscription revenue growth across our offerings. \nGeographical Information\n(dollars in millions)\n2024\n2023\n2022\n% Change\n2024-2023\nAmericas\n$\n12,891 \n$\n11,654 \n$\n10,251 \n11 \n%\nPercentage of total revenue\n60 \n%\n60 \n%\n58 \n%\n \nEMEA\n5,554 \n4,881 \n4,593 \n14 \n%\nPercentage of total revenue\n26 \n%\n25 \n%\n26 \n%\n \nAPAC\n3,060 \n2,874 \n2,762 \n6 \n%\nPercentage of total revenue\n14 \n%\n15 \n%\n16 \n%\n \nTotal revenue\n$\n21,505 \n$\n19,409 \n$\n17,606 \n11 \n%\nOverall revenue during fiscal 2024 increased in all geographic regions as compared to fiscal 2023. Within each geographic region, the fluctuations in revenue by reportable segment were attributable to the factors noted in the segment information above. \n43\nTable of Contents\nIncluded in the overall change in revenue for fiscal 2024 as compared to fiscal 2023 were impacts associated with foreign currency and our foreign currency hedging program. During fiscal 2024, the U.S. Dollar primarily strengthened against APAC foreign currencies and weakened against EMEA foreign currencies as compared to fiscal 2023, which resulted in a net decrease in revenue in U.S. Dollar equivalents of approximately $45 million. During fiscal 2024, we had net hedging losses from our cash flow hedging program of $20 million.\nSee Note 2 of our Notes to Consolidated Financial Statements for additional details of revenue by geography.\nCost of Revenue\n(dollars in millions)\n2024\n2023\n2022\n% Change\n2024-2023\nSubscription\n$\n1,799 \n$\n1,822 \n$\n1,646 \n(1)\n%\nPercentage of total revenue\n8 \n%\n9 \n%\n9 \n%\n \nProduct\n25 \n29 \n35 \n(14)\n%\nPercentage of total revenue\n*\n*\n*\n \nServices and other\n534 \n503 \n484 \n6 \n%\nPercentage of total revenue\n2 \n%\n3 \n%\n3 \n%\n \nTotal cost of revenue\n$\n2,358 \n$\n2,354 \n$\n2,165 \n*\n_________________________________________\n(*)    \nPercentage is less than 1%.\nSubscription\nCost of subscription revenue consists of third-party hosting services and data center costs, including expenses related to operating our network infrastructure and AI inferencing costs. Cost of subscription revenue also includes compensation costs associated with network operations, implementation, account management and technical support personnel, royalty fees, software costs and amortization of certain intangible assets.\nCost of subscription revenue decreased due to the following:\n \nComponents of\n% Change\n2024-2023\nLoss contingency\n(5)\n%\nAmortization of intangibles\n(2)\nHosting services and data center costs\n4 \nVarious individually insignificant items\n2 \nTotal change\n(1)\n%\nCost of subscription revenue during fiscal 2024 included the reversal of a loss contingency incurred in fiscal 2023 associated with an IP litigation matter.\nProduct\n    \nCost of product revenue is primarily comprised of third-party royalties, localization costs and costs associated with the manufacturing of our products.\nServices and Other\nCost of services and other revenue is primarily comprised of compensation and contracted costs incurred to provide consulting services, training and product support, and hosting services and data center costs.\nCost of services and other revenue increased during fiscal 2024 as compared to fiscal 2023 primarily due to increases in compensation costs and professional fees.\n44\nTable of Contents\nOperating Expenses\n(dollars in millions)\n2024\n2023\n2022\n% Change\n2024-2023\nResearch and development\n$\n3,944 \n$\n3,473 \n$\n2,987 \n14 \n%\nPercentage of total revenue\n18 \n%\n18 \n%\n17 \n%\n \nSales and marketing\n5,764 \n5,351 \n4,968 \n8 \n%\nPercentage of total revenue\n27 \n%\n28 \n%\n28 \n%\n \nGeneral and administrative\n1,529 \n1,413 \n1,219 \n8 \n%\nPercentage of total revenue\n7 \n%\n7 \n%\n7 \n%\n \nAcquisition termination fee\n1,000 \n— \n— \n**\nPercentage of total revenue\n5 \n%\n*\n*\nAmortization of intangibles\n169 \n168 \n169 \n1 \n%\nPercentage of total revenue\n1 \n%\n1 \n%\n1 \n%\n \nTotal operating expenses\n$\n12,406 \n$\n10,405 \n$\n9,343 \n19 \n%\n_________________________________________\n(*)    \nPercentage is less than 1%.\n(**)\n    Percentage is not meaningful.\nResearch and Development \nResearch and development expenses consist primarily of compensation and contracted costs associated with software development, third-party hosting services and data center costs including AI training costs, related facilities costs and expenses associated with computer equipment and software used in development activities.\nResearch and development expenses increased due to the following:\n \nComponents of\n% Change\n2024-2023\nCompensation costs\n7 \n%\nHosting services and data center costs\n5 \nVarious individually insignificant items\n2 \nTotal change\n14 \n%\nInvestments in research and development, including the recruiting and hiring of software developers, are critical to remain competitive in the marketplace and are directly related to continued timely development of new and enhanced offerings and solutions. We will continue to focus on long-term opportunities available in our end markets and make significant investments in the development of our subscription and service offerings, apps and tools.\nSales and Marketing\nSales and marketing expenses consist primarily of compensation costs, amortization of contract acquisition costs, including sales commissions, travel expenses and related facilities costs for our sales, marketing, order management and global supply chain management personnel. Sales and marketing expenses also include the costs of programs aimed at increasing revenue, such as advertising, trade shows and events, public relations and other market development programs.\nSales and marketing expenses increased due to the following:\n \nComponents of\n% Change\n2024-2023\nCompensation costs\n4 \n%\nMarketing spend related to campaigns, events and overall marketing efforts\n2 \nVarious individually insignificant items\n2 \nTotal change\n8 \n%\n45\nTable of Contents\nGeneral and Administrative\nGeneral and administrative expenses consist primarily of compensation and contracted costs, travel expenses and related facilities costs for our finance, facilities, human resources, legal, information services and executive personnel. General and administrative expenses also include outside legal and accounting fees, provision for bad debts, expenses associated with computer equipment and software used in the administration of the business, charitable contributions and various forms of insurance.\nGeneral and administrative expenses increased due to the following:\n \nComponents of\n% Change\n2024-2023\nLease-related asset impairments and other charges\n7 \n%\nCompensation costs\n4 \nProfessional and consulting fees\n(5)\nVarious individually insignificant items\n2 \nTotal change\n8 \n%\nGeneral and administrative expenses during fiscal 2024 included costs associated with the optimization of our leased facilities, primarily consisting of impairment charges for certain operating lease right-of-use assets and leasehold improvements.\nAcquisition Termination Fee\nDuring fiscal 2024, we incurred a $1 billion termination fee which resulted from termination of the Figma transaction.\nNon-Operating Income (Expense), Net\n(dollars in millions)\n2024\n2023\n2022\n% Change\n2024-2023\nInterest expense\n$\n(169)\n$\n(113)\n$\n(112)\n50 \n%\nPercentage of total revenue\n(1)\n%\n(1)\n%\n(1)\n%\nInvestment gains (losses), net\n48 \n16 \n(19)\n**\nPercentage of total revenue\n*\n*\n*\n \nOther income (expense), net\n311 \n246 \n41 \n**\nPercentage of total revenue\n1 \n%\n1 \n%\n*\nTotal non-operating income (expense), net\n$\n190 \n$\n149 \n$\n(90)\n**\n_________________________________________\n(*)    \nPercentage is less than 1%.\n(**)\n    Percentage is not meaningful.\nInterest Expense\nInterest expense represents interest associated with our debt instruments. Interest on our senior notes is payable semi-annually, in arrears.\nInterest expense increased during fiscal 2024 as compared to fiscal 2023 due to the senior notes issued in April 2024. \nSee Note 1\n7\n for further details regarding our debt.\nInvestment Gains (Losses), Net\nInvestment gains (losses), net consists principally of unrealized holding gains and losses associated with our deferred compensation plan assets.\n46\nTable of Contents\nOther Income (Expense), Net\n \nOther income (expense), net consists primarily of interest earned on cash, cash equivalents and short-term fixed income investments. Other income (expense), net also includes realized gains and losses on fixed income investments and foreign exchange gains and losses.\nOther income (expense), net increased during fiscal 2024 as compared to fiscal 2023 primarily due to increases in interest income driven by higher average cash equivalent balances and interest rates.\nProvision for Income Taxes \n(dollars in millions)\n2024\n2023\n2022\n% Change\n2024-2023\nProvision for income taxes\n$\n1,371 \n$\n1,371 \n$\n1,252 \n*\nPercentage of total revenue\n6 \n%\n7 \n%\n7 \n%\n \nEffective tax rate\n20 \n%\n20 \n%\n21 \n%\n \n_________________________________________\n(*)    \nPercentage is less than 1%.\nOur effective tax rate for fiscal 2024 remained relatively flat compared to fiscal 2023, as the impact of the Figma acquisition termination fee, which was not deductible for financial statement purposes, was largely offset by increases in the net tax benefits from effects of non-U.S. operations and stock-based compensation in fiscal 2024.\nOur effective tax rate for fiscal 2024 was lower than the U.S. federal statutory tax rate of 21% primarily due to the net tax benefits from effects of non-U.S. operations and the U.S. federal research tax credit, partially offset by the impacts of the Figma acquisition termination fee and state taxes.\nWe recognize deferred tax assets to the extent that we believe these assets are more likely than not to be realized based on evaluation of all available positive and negative evidence. On the basis of this evaluation, we continue to maintain a valuation allowance to reduce our deferred tax assets to the amount realizable. The total valuation allowance was $725 million as of November 29, 2024, primarily related to certain state credits and federal capital loss carryforwards.\nWe are a U.S.-based multinational company subject to tax in multiple domestic and foreign tax jurisdictions. The current U.S. tax law subjects the earnings of certain foreign subsidiaries to U.S. tax and generally allows an exemption from taxation for distributions from foreign subsidiaries.\nIn the current global tax policy environment, the domestic and foreign governing bodies continue to consider, and in some cases introduce, changes in regulations applicable to corporate multinationals such as Adobe. As regulations are issued, we account for finalized regulations in the period of enactment. \nThe provision from the U.S. Tax Act which requires us to capitalize and amortize research and development costs became effective in fiscal 2023. This requirement continues to have an adverse impact on our effective rates for income taxes paid, which is partially offset by a benefit to our effective tax rates from the increase in the foreign-derived intangible income deduction.\nSeveral countries have enacted, or have committed to enact, the Organization for Economic Cooperation and Development’s 15% global minimum tax regime effective for our fiscal 2025. The currently enacted legislation is not expected to have a material impact on our provision for income taxes, however we continue to monitor developments and evaluate impacts, if any, of these provisions on our results of operations and cash flows.\nSee Note 10 of our Notes to Consolidated Financial Statements for further information regarding our provision for income taxes.\n \nAccounting for Uncertainty in Income Taxes\nThe gross liabilities for unrecognized tax benefits excluding interest and penalties were $683 million and $501 million at the end of fiscal 2024 and 2023, respectively. If the total unrecognized tax benefits as of November 29, 2024 and December 1, 2023 were recognized, $519 million and $356 million would decrease the respective effective tax rates.\nAs of November 29, 2024 and December 1, 2023, the combined amounts of accrued interest and penalties included in long-term income taxes payable related to tax positions taken on our tax returns were not material.\n47\nTable of Contents\nThe timing of the resolution of income tax examinations is highly uncertain as are the amounts and timing of tax payments that are part of any audit settlement process. These events could cause large fluctuations in the balance sheet classification of our tax assets and liabilities. We believe that within the next 12 months, it is reasonably possible that either certain audits will conclude or statutes of limitations on certain income tax examination periods will expire, or both. Although the timing of resolution, settlement and closing of audits is not certain, it is reasonably possible that the underlying unrecognized tax benefits may decrease by up to $50 million over the next 12 months.\nOur future effective tax rates may be materially affected by changes in the tax rates in jurisdictions where our income is earned, changes in jurisdictions in which our profits are determined to be earned and taxed, changes in the valuation of our deferred tax assets and liabilities, changes in or interpretation of tax rules and regulations in the jurisdictions in which we do business, or unexpected changes in business and market conditions that could reduce certain tax benefits.\nIn addition, tax laws in the United States as well as other countries and jurisdictions in which we conduct business are subject to change as new laws are passed and/or new interpretations are made available. These countries, governmental bodies, such as the European Commission of the European Union, and intergovernmental economic organizations, such as the Organization for Economic Cooperation and Development, have made or could make unprecedented assertions about how taxation is determined and, in some cases, have proposed or enacted new laws that are contrary to the way in which rules and regulations have historically been interpreted and applied. Changes in our operating landscape, such as changes in laws and/or interpretations of tax rules, could adversely affect our effective tax rates and/or cause us to respond by making changes to our business structure which could adversely affect our operations and financial results.\nMoreover, we are subject to the examination of our income tax returns by domestic and foreign tax authorities. We regularly assess the likelihood of outcomes resulting from these examinations to determine the adequacy of our provision for income taxes and have reserved for potential adjustments that may result from these examinations. Our policy is to record interest and penalties related to unrecognized tax benefits in income tax expense. While we believe our tax estimates are reasonable, we cannot provide assurance that the final determination of any of these examinations will not have an adverse effect on our financial position and results of operations.\nLIQUIDITY AND CAPITAL RESOURCES\nCash Flows \nOur primary source of cash is receipts from revenue. Other customary sources of cash include proceeds from maturities and sales of short-term investments. Our primary uses of cash are general business expenses including payroll and related benefits costs, income taxes, marketing and third-party hosting services, as well as our stock repurchase program as described below. Other customary uses of cash include purchases of property and equipment and payments for taxes related to net share settlement of equity awards.\nThis data should be read in conjunction with our Consolidated Statements of Cash Flows.\nAs of\n(in millions)\nNovember 29, 2024\nDecember 1, 2023\nCash and cash equivalents\n$\n7,613 \n$\n7,141 \nShort-term investments\n$\n273 \n$\n701 \nWorking capital\n$\n711 \n$\n2,833 \nStockholders’ equity\n$\n14,105 \n$\n16,518 \n A summary of our cash flows for fiscal 2024, 2023 and 2022 is as follows:\n(in millions)\n2024\n2023\n2022\nNet cash provided by operating activities\n$\n8,056 \n$\n7,302 \n$\n7,838 \nNet cash provided by (used for) investing activities\n149 \n776 \n(570)\nNet cash used for financing activities\n(7,724)\n(5,182)\n(6,825)\nEffect of foreign currency exchange rates on cash and cash equivalents\n(9)\n9 \n(51)\nNet change in cash and cash equivalents\n$\n472 \n$\n2,905 \n$\n392 \n48\nTable of Contents\nCash Flows from Operating Activities\nFor fiscal 2024, net cash provided by operating activities of $8.06 billion was primarily comprised of net income adjusted for the net effect of non-cash items. Payment of the $1 billion Figma termination fee during fiscal 2024 had an adverse impact on net income and cash flows from operations.\nCash Flows from Investing Activities\nFor fiscal 2024, net cash provided by investing activities of $149 million was primarily due to maturities of short-term investments, partially offset by ongoing capital expenditures and purchases of long-term and short-term investments.\nCash Flows from Financing Activities\nFor fiscal 2024, net cash used for financing activities of $7.72 billion was primarily due to payments for our common stock repurchases, partially offset by proceeds from the issuance of senior notes. \nSee the sections titled “Senior Notes” and “Stock Repurchase Program” below.\nLiquidity and Capital Resources Considerations\nOur existing cash, cash equivalents and investment balances may fluctuate during fiscal 2025 due to changes in our planned cash outlay. \nCash from operations could also be affected by various risks and uncertainties, including, but not limited to, risks detailed in the section titled “Risk Factors” in Part I, Item 1A of this report. Based on our current business plan and revenue prospects, we believe that our existing cash, cash equivalents and investment balances, our anticipated cash flows from operations and our available credit facility will be sufficient to meet our working capital, operating resource expenditure and capital expenditure requirements for the next twelve months and for the foreseeable future.\nOur cash equivalent and short-term investment portfolio as of November 29, 2024 consisted of money market funds, corporate debt securities, U.S. Treasury securities, time deposits, U.S. agency securities and asset-backed securities. We use professional investment management firms to manage a large portion of our invested cash.\nWe expect to continue our investing activities, including short-term and long-term investments, purchases of computer and server hardware to operate our network infrastructure, sales and marketing, product support and administrative staff. Furthermore, cash reserves may be used to repurchase stock under our stock repurchase program and to strategically acquire companies, products or technologies that are complementary to our business.\nRevolving Credit Agreement\nWe have a $1.5 billion senior unsecured revolving credit agreement (the “Revolving Credit Agreement”) with a syndicate of lenders, providing for loans to us and certain of our subsidiaries through June 30, 2027. Subject to the agreement of lenders, we may obtain up to an additional $500 million in commitments, for a maximum aggregate commitment of $2 billion. As of November 29, 2024, there were no outstanding borrowings under the Revolving Credit Agreement and the entire $1.5 billion credit line remains available for borrowing. Under the terms of our Revolving Credit Agreement, we are not prohibited from paying cash dividends unless payment would trigger an event of default or if one currently exists. We do not anticipate paying any cash dividends in the foreseeable future.\nCommercial Paper Program \nWe have a commercial paper program under which we may issue unsecured commercial paper up to a total of $3 billion outstanding at any time, with maturities of up to 397 days from the date of issue. The net proceeds from the issuance of commercial paper are expected to be used for general corporate purposes, which may include working capital, capital expenditures, acquisitions, stock repurchases, refinancing indebtedness or any other general corporate purposes. As of November 29, 2024, there were no outstanding borrowings under the commercial paper program.\nSenior Notes\nIn April 2024, we issued $500 million of senior notes due April 4, 2027, $750 million of senior notes due April 4, 2029 and $750 million of senior notes due April 4, 2034. In total, we have $5.65 billion of senior notes outstanding, which rank equally with our other unsecured and unsubordinated indebtedness. As of November 29, 2024, the carrying value of our senior notes was $5.63 billion and our maximum commitment for interest payments was $806 million for the remaining duration of our outstanding senior notes. Interest is payable semi-annually, in arrears. Our senior notes do not contain any financial covenants. \nSee Note 17 of our Notes to Consolidated Financial Statements for further details regarding our debt.\n49\nTable of Contents\nDuring the first quarter of fiscal 2024, we reclassified the senior notes due February 1, 2025 as current debt in our Consolidated Balance Sheets. As of November 29, 2024, the carrying value of our current debt was $1.50 billion, net of the related discount and issuance costs. Though we intend to refinance the current portion of our debt on or before the due date, the timing of the refinancing may be impacted by market conditions.\nContractual Obligations\nOur principal commitments consist of purchase obligations resulting from agreements to purchase goods and services in the ordinary course of business. As of November 29, 2024, the value of our non-cancellable unconditional purchase obligations was $5.79 billion, primarily relating to contracts with vendors for third-party hosting and data center services. \nSee Note 16 of our Notes to Consolidated Financial Statements for additional information regarding our purchase obligations.\nWe lease certain facilities and data centers under non-cancellable operating lease arrangements that expire at various dates through 2034. As of November 29, 2024, the value of our obligations under operating leases was $463 million. \nS\nee Note 18 of our Notes to Consolidated Financial Statements for additional information regarding our lease obligations\n.\nStock Repurchase Program\nTo facilitate our stock repurchase program, designed to return value to our stockholders and minimize dilution from stock issuances, we may repurchase our shares in the open market or enter into structured repurchase agreements with third parties. In December 2020, our Board of Directors granted authority to repurchase up to $15 billion in our common stock, which became fully utilized during fiscal 2024. In March 2024, our Board of Directors granted additional authority to repurchase up to $25 billion in our common stock through March 14, 2028.\nDuring fiscal 2024, we entered into accelerated share repurchase agreements (“ASRs”) with large financial institutions whereupon we provided them with prepayments totaling $9.5 billion. Subsequent to November 29, 2024, as part of the March 2024 stock repurchase authority, we entered into stock repurchase arrangements with a large financial institution which totaled $3.25 billion, including a $2.75 billion ASR and a trading plan under which we may execute up to $500 million in open market repurchases.\nSee section titled \n“\nMarket for Registrant’s Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities\n”\n in Part II, Item 5 of this report for stock repurchases during the quarter ended \nNovember 29, 2024 \nand Note 14 of our Notes to Consolidated Financial Statements for further details regarding our stock repurchase program.\nIndemnifications\nIn the ordinary course of business, we provide indemnifications of varying scope to our customers and channel partners against claims of intellectual property infringement made by third parties arising from the use of our products and from time to time, we are subject to claims by our customers under these indemnification provisions. Historically, costs related to these indemnification provisions have not been significant and we are unable to estimate the maximum potential impact of these indemnification provisions on our future results of operations.\nTo the extent permitted under Delaware law, we have agreements whereby we indemnify our officers and directors for certain events or occurrences while the officer or director is or was serving at our request in such capacity. The indemnification period covers all pertinent events and occurrences during the officer’s or director’s lifetime. The maximum potential amount of future payments we could be required to make under these indemnification agreements is unlimited; however, we have director and officer insurance coverage that reduces our exposure and enables us to recover a portion of any future amounts paid.\n50\nTable of Contents",
  "item2": null
}