{
  "source_file": "adbe-20250829.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "ITEM 2.  MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe following discussion should be read in conjunction with the condensed consolidated financial statements and notes thereto.\nIn addition to historical information, this Quarterly Report on Form 10-Q contains forward-looking statements, including statements regarding product plans, future growth, market opportunities, fluctuations in foreign currency exchange rates, strategic investments, industry positioning, customer acquisition and retention, the amount of annualized recurring revenue and revenue growth. In addition, when used in this report, the words “will,” “expects,” “could,” “would,” “may,” “anticipates,” “intends,” “plans,” “believes,” “seeks,” “targets,” “estimates,” “looks for,” “looks to,” “continues” and similar expressions, as well as statements regarding our focus for the future, are generally intended to identify forward-looking statements. Each of the forward-looking statements we make in this report involves risks and uncertainties that could cause actual results to differ materially from these forward-looking statements. Factors that might cause or contribute to such differences include, but are not limited to, those discussed in the section titled “Risk Factors” in Part II, Item 1A of this report. The risks described herein and in other documents we file from time to time with the U.S. Securities and Exchange Commission (the “SEC”), including our Annual Report on Form 10-K for fiscal 2024, should be carefully reviewed. Undue reliance should not be placed on these forward-looking statements, which speak only as of the date of this Quarterly Report on Form 10-Q. We undertake no obligation to publicly release any revisions to the forward-looking statements or reflect events or circumstances after the date of this document, except as required by law.\nBUSINESS OVERVIEW\nAdobe is a global technology company with a mission to change the world through personalized digital experiences. For over four decades, Adobe’s innovations have transformed how individuals, teams, businesses, enterprises, institutions, and governments engage and interact across all types of media. Our products, services and solutions are used around the world to imagine, create, manage, deliver, measure, optimize and engage with content across surfaces and fuel digital experiences. We have a diverse user base that includes consumers, communicators, creative professionals, developers, students, small and medium businesses and enterprises. We are also empowering creators by putting the power of artificial intelligence (“AI”) in their hands, and doing so in ways we believe are responsible. Our products and services help unleash creativity, accelerate document productivity and power businesses in a digital world. We have operations in the Americas; Europe, Middle East and Africa (“EMEA”); and Asia-Pacific (“APAC”).\nOPERATIONS OVERVIEW\nFor our third quarter of fiscal 2025, we experienced strong demand across our Digital Media and Digital Experience offerings, driven by transformative and customer-focused product innovation. As we execute on our long-term growth initiatives, with emphasis on delivering value through AI-powered and highly differentiated solutions to meet the needs of our diverse and expanding customer base, we have continued to experience growth in software-based subscription revenue across our portfolio of offerings.\nDigital Media\nOur Digital Media products, services and solutions help users create, design and publish rich content and 3D experiences, and improve productivity by transforming how they view, share and collaborate on documents and content. These offerings include our Creative Cloud flagship applications (“apps”) such as Adobe Photoshop, Adobe Illustrator, Adobe Lightroom, Adobe Premiere Pro and Adobe Stock; as well as Adobe Acrobat, Adobe Express, Adobe Firefly and many more products, which are available across surfaces and platforms as desktop tools, web and mobile apps and cloud-based services. Adobe Express is our web and mobile app designed to enable a broad spectrum of users, including novice content creators and communicators, to create, edit and customize content quickly and easily with content first, task-based solutions. Our Adobe Acrobat offerings fuel document productivity, enabling users to create, collaborate, review, approve, sign and track documents at home, in the office and across devices. AI innovation is deeply infused into our Digital Media solutions, including through Adobe Firefly-powered generative AI features available across our Creative Cloud flagship apps, and through Acrobat AI Assistant, a generative AI-powered conversational interface designed to enhance document experiences. Our Digital Media customers include business professionals, consumers, creative professionals, creators and marketing professionals.\nAnnualized Recurring Revenue (“ARR”) is currently the key performance metric our management uses to assess the health and trajectory of our overall Digital Media segment. ARR should be viewed independently of revenue, deferred revenue and remaining performance obligations as ARR is a performance metric and is not intended to be combined with any of these items. Digital Media ARR continues to be calculated as the sum of the annual value of Digital Media subscriptions and services and the annual value of Digital Media Enterprise Term License Agreements. We adjust our reported ARR on an annual basis to \n26\nTable of Contents\nreflect any exchange rate changes. Our reported ARR results in the current fiscal year are based on currency rates set at the beginning of the year and held constant throughout the year for measurement purposes. Prior year ARR balances are also revalued at the new currency rates for comparative purposes.\nDigital Media ARR grew to $18.59 billion at the end of the third quarter of fiscal 2025, representing 11.7% year-over-year growth. Our success in driving growth in ARR has positively affected our revenue growth. Digital Media segment revenue grew to $4.46 billion in the third quarter of fiscal 2025, up from $4.00 billion in the third quarter of fiscal 2024, representing 12% year-over-year growth.\nDigital Experience\nOur Digital Experience apps and services are designed to accelerate customer experience orchestration at scale and supply intelligence for businesses of any size in any industry. Digital Experience is comprised of solutions to deliver actionable data, with products such as Adobe Analytics and Adobe Real-Time Customer Data Platform; optimize personalized content delivery, with products such as Adobe Experience Manager, Adobe Commerce and Adobe GenStudio for Performance Marketing; and manage customer journeys, with products such as Adobe Marketo Engage and Adobe Campaign. Our differentiation and competitive advantage are strengthened by our ability to use the Adobe Experience Platform to integrate our comprehensive set of solutions and our ability to embed AI into our product portfolio, such as with our Adobe Experience Platform AI Assistant, a generative AI-powered conversational interface designed to help customers automate workflows and generate new audiences and journeys. Our Digital Experience customers include marketing professionals such as brand managers, channel marketers and campaign strategists.\nDigital Experience revenue was $1.48 billion in the third quarter of fiscal 2025, up from $1.35 billion in the third quarter of fiscal 2024, representing 9% year-over-year growth. Subscription revenue grew to $1.37 billion in the third quarter of fiscal 2025, up from $1.23 billion in the third quarter of fiscal 2024, representing 11% year-over-year growth. \nCustomer-Focused Strategy\nOur customers often are involved in workflows that integrate multiple Adobe products across both segments. By combining the creativity of our Digital Media business with the science of our Digital Experience business, such as with our Adobe GenStudio solutions, we help our customers to more efficiently and effectively make, manage, measure and monetize their content across every channel with an end-to-end workflow.\nSpanning both our Digital Media and Digital Experience segments, we are driving continued business success through audience-specific product innovation and go-to-market strategy focused on the following two customer groups: \n•\nBusiness Professionals and Consumers desire web and mobile apps with easy-to-use AI capabilities, and are increasingly benefiting from using Adobe Acrobat and Adobe Express. Revenue associated with the Business Professionals and Consumers customer group consists of Adobe Acrobat offerings and Adobe Express, all of which are part of Digital Media.\n•\nCreative and Marketing Professionals require agile and comprehensive solutions to create high volumes of compelling content, infused with commercially safe AI capabilities; and are benefiting from investments in powerful, integrated workflows through offerings such as Adobe Firefly and Adobe GenStudio. Revenue associated with the Creative and Marketing Professionals customer group consists of Digital Experience offerings as well as Creative Cloud flagship apps such as Photoshop, Lightroom and Illustrator within Digital Media.\nBy viewing the Digital Media and Digital Experience segments through this additional lens, we can more effectively execute on our long-term growth strategies. Our success will be achieved through continued acquisition and retention of our customer base by delivering valuable new features and technologies to customers with our latest releases, including generative AI capabilities to enhance creativity, productivity and marketing, and expanding availability of our offerings across an increasing number of surfaces.\nAs part of our customer-focused strategy, we utilize a data-driven operating model and tailored go-to-market motion to raise awareness of our products and drive customer acquisition, engagement and retention. Overall, our strategy is designed to increase our revenue with existing users, continue to attract new customers, and grow our recurring and predictable revenue stream that is recognized ratably.\n27\nTable of Contents\nMacroeconomic Conditions\nAs a corporation with an extensive global footprint, we are subject to risks and exposures from the evolving macroeconomic environment, including the effects of increased global inflationary pressures and interest rates, fluctuations in foreign currency exchange rates, potential economic slowdowns or recessions and geopolitical pressures, including the unknown impacts of current and future trade regulations. We continuously monitor the direct and indirect impacts of these circumstances on our business and financial results.\nWhile our revenue and earnings are relatively predictable as a result of our subscription-based business model, the broader implications of these macroeconomic events on our business, results of operations and overall financial position, particularly in the long term, remain uncertain. \nSee the section titled “Risk Factors” in Part II, Item \n1A\n of this report for further discussion of the possible impact of these macroeconomic issues on our business.\nCRITICAL ACCOUNTING POLICIES AND ESTIMATES\nIn preparing our condensed consolidated financial statements in accordance with generally accepted accounting principles in the United States (“GAAP”) and pursuant to the rules and regulations of the SEC, we make assumptions, judgments and estimates that affect the reported amounts of assets, liabilities, revenue and expenses, and related disclosures of contingent assets and liabilities. We base our assumptions, judgments and estimates on historical experience and various other factors that we believe to be reasonable under the circumstances. Actual results could differ materially from these estimates under different assumptions or conditions. We evaluate our assumptions, judgments and estimates on a regular basis. We also discuss our critical accounting policies and estimates with the Audit Committee of the Board of Directors.\nWe believe that the assumptions, judgments and estimates involved in the accounting for revenue recognition and income taxes have the greatest potential impact on our condensed consolidated financial statements. These areas are key components of our results of operations and are based on complex rules requiring us to make judgments and estimates, and consequently, we consider these to be our critical accounting policies. Historically, our assumptions, judgments and estimates relative to our critical accounting policies have not differed materially from actual results.\nThere have been no significant changes in our critical accounting policies and estimates during the nine months ended August 29, 2025, as compared to the critical accounting policies and estimates disclosed in Management’s Discussion and Analysis of Financial Condition and Results of Operations included in our Annual Report on Form 10-K for the year ended November 29, 2024.\nRecent Accounting Pronouncements\nSee Note 1 of our notes to condensed consolidated financial statements for information regarding recent accounting pronouncements that are of significance or potential significance to us.\n28\nTable of Contents\nRESULTS OF OPERATIONS\nFinancial Performance Summary\n•\nDigital Media ARR of approximately $18.59 billion as of August 29, 2025 increased by 11.7% from $16.64 billion as of August 30, 2024 revalued using currency rates determined at the beginning of fiscal 2025.\n•\nDigital Media revenue of $4.46 billion during the three months ended August 29, 2025 increased by $464 million, or 12%, compared to the year-ago period.\n•\nDigital Experience revenue of $1.48 billion during the three months ended August 29, 2025 increased by $122 million, or 9%, compared to the year-ago period.\n•\nCost of revenue of $642 million during the three months ended August 29, 2025 increased by $88 million, or 16%, compared to the year-ago period.\n•\nOperating expenses of $3.17 billion during the three months ended August 29, 2025 increased by $311 million, or 11%, compared to the year-ago period.\n•\nNet income of $1.77 billion during the three months ended August 29, 2025 increased by $88 million, or 5%, compared to the year-ago period.\n•\nCash flows from operations of $6.87 billion during the nine months ended August 29, 2025 increased by $1.74 billion, or 34%, compared to the year-ago period, primarily due to payment of the $1 billion Figma termination fee during the first quarter of fiscal 2024.\n•\nRemaining performance obligations of $20.44 billion as of August 29, 2025 increased by 13% from $18.14 billion as of August 30, 2024.\nRevenue for the Three and Nine Months Ended August 29, 2025 and August 30, 2024\n(dollars in millions)\nThree Months\nNine Months\n \n2025\n2024\n% Change\n2025\n2024\n% Change\nSubscription\n$\n5,791 \n$\n5,180 \n12 \n%\n$\n16,915 \n$\n15,156 \n12 \n%\nPercentage of total revenue\n97 \n%\n96 \n%\n \n96 \n%\n95 \n%\n \nProduct\n68 \n82 \n(17)\n%\n251 \n305 \n(18)\n%\nPercentage of total revenue\n1 \n%\n1 \n%\n \n2 \n%\n2 \n%\n \nServices and other\n129 \n146 \n(12)\n%\n409 \n438 \n(7)\n%\nPercentage of total revenue\n2 \n%\n3 \n%\n \n2 \n%\n3 \n%\n \nTotal revenue\n$\n5,988 \n$\n5,408 \n11 \n%\n$\n17,575 \n$\n15,899 \n11 \n%\nSubscription\nOur subscription revenue is comprised primarily of fees we charge for our subscription and hosted service offerings, and related support. We primarily recognize subscription revenue ratably over the term of agreements with our customers, beginning with commencement of service. Subscription revenue related to certain offerings, where fees are based on a number of transactions and invoicing is aligned to the pattern of performance, customer benefit and consumption, are recognized on a usage basis.\nProduct\nOur product revenue is comprised primarily of fees related to licenses for on-premise software purchased on a perpetual basis, for a fixed period of time, or based on usage for certain of our original equipment manufacturer and royalty agreements. We primarily recognize product revenue at the point in time the software is available to the customer, provided all other revenue recognition criteria are met.\nServices and Other\nOur services and other revenue is comprised primarily of fees related to consulting, training, maintenance and support for certain on-premise licenses that are recognized at a point in time and our advertising offerings. We typically sell our consulting \n29\nTable of Contents\ncontracts on a time-and-materials or fixed-fee basis. These revenues are recognized as the services are performed for time-and-materials contracts and on a relative performance basis for fixed-fee contracts. Training revenues are recognized as the services are performed. Our maintenance and support offerings, which entitle customers, partners and developers to receive desktop product upgrades and enhancements or technical support, depending on the offering, are generally recognized ratably over the term of the arrangement. Transaction-based advertising revenue is recognized on a usage basis as we satisfy the performance obligations to our customers.\nSegment Information\nWe have the following reportable segments: Digital Media, Digital Experience, and Publishing and Advertising. Total revenue by reportable segment for the three and nine months ended August 29, 2025 and August 30, 2024 were as follows:\n(dollars in millions)\nThree Months\nNine Months\n \n2025\n2024\n% Change\n2025\n2024\n% Change\nDigital Media\n$\n4,459 \n$\n3,995 \n12 \n%\n$\n13,031 \n$\n11,719 \n11 \n%\nPercentage of total revenue\n74 \n%\n74 \n%\n \n74 \n%\n74 \n%\n \nDigital Experience\n1,476 \n1,354 \n9 \n%\n4,347 \n3,970 \n9 \n%\nPercentage of total revenue\n25 \n%\n25 \n%\n \n25 \n%\n25 \n%\n \nPublishing and Advertising\n53 \n59 \n(10)\n%\n197 \n210 \n(6)\n%\nPercentage of total revenue\n1 \n%\n1 \n%\n \n1 \n%\n1 \n%\n \nTotal revenue\n$\n5,988 \n$\n5,408 \n11 \n%\n$\n17,575 \n$\n15,899 \n11 \n%\nRevenue from Digital Media increased $464 million and $1.31 billion, and revenue from Digital Experience increased $122 million and $377 million, during the three and nine months ended August 29, 2025 as compared to the three and nine months ended August 30, 2024. The increases in total revenue were due to subscription revenue growth across our Digital Media and Digital Experience offerings.\nSubscription revenue by reportable segment for the three and nine months ended August 29, 2025 and August 30, 2024 were as follows:\n(dollars in millions)\nThree Months\nNine Months\n2025\n2024\n% Change\n2025\n2024\n% Change\nDigital Media\n$\n4,397 \n$\n3,921 \n12 \n%\n$\n12,836 \n$\n11,474 \n12 \n%\nDigital Experience\n1,368 \n1,231 \n11 \n%\n3,999 \n3,599 \n11 \n%\nPublishing and Advertising\n26 \n28 \n(7)\n%\n80 \n83 \n(4)\n%\nTotal subscription revenue\n$\n5,791 \n$\n5,180 \n12 \n%\n$\n16,915 \n$\n15,156 \n12 \n%\nIncreases in subscription revenue for the Digital Media segment were driven by strength in Creative Cloud flagship apps and Acrobat across all routes to market and geographies. Increases in subscription revenue for the Digital Experience segment were driven by strength in Adobe Experience Platform and related apps, and Adobe Experience Manager.\nDigital Media and Digital Experience subscription revenue by customer group for the three and nine months ended August 29, 2025 and August 30, 2024 were as follows:\n(dollars in millions)\nThree Months\nNine Months\n2025\n2024\n% Change\n2025\n2024\n% Change\nCreative and Marketing Professionals\n$\n4,117 \n$\n3,715 \n11 \n%\n$\n12,058 \n$\n10,908 \n11 \n%\nBusiness Professionals and Consumers\n1,648 \n1,437 \n15 \n%\n4,777 \n4,165 \n15 \n%\nTotal Digital Media and Digital Experience subscription revenue\n$\n5,765 \n$\n5,152 \n12 \n%\n$\n16,835 \n$\n15,073 \n12 \n%\nIncreases in subscription revenue for the Creative and Marketing Professionals customer group were driven by strength in Creative Cloud flagship apps, Adobe Experience Platform and related apps, and Adobe Experience Manager. Increases in subscription revenue for the Business Professionals and Consumers customer group were driven by strength in Acrobat.\n30\nTable of Contents\nGeographical Information\n(dollars in millions)\nThree Months\nNine Months\n \n2025\n2024\n% Change\n2025\n2024\n% Change\nAmericas\n$\n3,555 \n$\n3,241 \n10 \n%\n$\n10,460 \n$\n9,539 \n10 \n%\nPercentage of total revenue\n59 \n%\n60 \n%\n \n60 \n%\n60 \n%\n \nEMEA\n1,586 \n1,405 \n13 \n%\n4,629 \n4,085 \n13 \n%\nPercentage of total revenue\n27 \n%\n26 \n%\n \n26 \n%\n26 \n%\n \nAPAC\n847 \n762 \n11 \n%\n2,486 \n2,275 \n9 \n%\nPercentage of total revenue\n14 \n%\n14 \n%\n \n14 \n%\n14 \n%\n \nTotal revenue\n$\n5,988 \n$\n5,408 \n11 \n%\n$\n17,575 \n$\n15,899 \n11 \n%\nOverall revenue during the three and nine months ended August 29, 2025 increased in all geographic regions as compared to the three and nine months ended August 30, 2024. Within each geographic region, the fluctuations in revenue were attributable to the factors noted in the segment information above. \nIncluded in the overall change in revenue were impacts associated with foreign currency which were mitigated in part by our foreign currency hedging program. During the three months ended August 29, 2025 as compared to the three months ended August 30, 2024, the U.S. Dollar weakened against EMEA currencies and the Japanese Yen, which resulted in a net increase in revenue in U.S. Dollar equivalents of approximately $43 million and was partially offset by net hedging losses of $12 million from our cash flow hedging program. During the nine months ended August 29, 2025 as compared to the nine months ended August 30, 2024, the U.S. Dollar primarily strengthened against APAC currencies and weakened against EMEA currencies, which resulted in a net decrease in revenue of approximately $55 million and was partially offset by net hedging gains of $26 million.\nCost of Revenue for the Three and Nine Months Ended August 29, 2025 and August 30, 2024\n(dollars in millions)\nThree Months\nNine Months\n \n2025\n2024\n% Change\n2025\n2024\n% Change\nSubscription\n$\n510 \n$\n413 \n23 \n%\n$\n1,505 \n$\n1,324 \n14 \n%\nPercentage of total revenue\n9 \n%\n8 \n%\n9 \n%\n8 \n%\nProduct\n5 \n6 \n(17)\n%\n17 \n19 \n(11)\n%\nPercentage of total revenue\n*\n*\n \n*\n*\n \nServices and other\n127 \n135 \n(6)\n%\n380 \n399 \n(5)\n%\nPercentage of total revenue\n2 \n%\n2 \n%\n \n2 \n%\n3 \n%\n \nTotal cost of revenue\n$\n642 \n$\n554 \n16 \n%\n$\n1,902 \n$\n1,742 \n9 \n%\n_________________________________________\n(*)    \nPercentage is less than 1%.\nSubscription\nCost of subscription revenue consists primarily of third-party hosting services and data center costs, including expenses related to operating our network infrastructure and AI inferencing costs. Cost of subscription revenue also includes compensation costs associated with network operations, implementation, account management and technical support personnel, royalty fees, software costs and amortization of certain intangible assets.\nCost of subscription revenue increased during the three and nine months ended August 29, 2025 as compared to the three and nine months ended August 30, 2024 primarily due to increases in hosting services and data center costs, as well as the reversal of a loss contingency during the three months ended August 30, 2024.\nProduct\nCost of product revenue is primarily comprised of third-party royalties, localization costs and costs associated with the manufacturing of our products. \n31\nTable of Contents\nServices and Other\nCost of services and other revenue is primarily comprised of compensation and contracted costs incurred to provide consulting services, training and product support, and hosting services and data center costs.\nOperating Expenses for the Three and Nine Months Ended August 29, 2025 and August 30, 2024\n(dollars in millions)\nThree Months\nNine Months\n \n2025\n2024\n % Change\n2025\n2024\n % Change\nResearch and development\n$\n1,088 \n$\n1,022 \n6 \n%\n$\n3,196 \n$\n2,945 \n9 \n%\nPercentage of total revenue\n18 \n%\n19 \n%\n18 \n%\n19 \n%\nSales and marketing\n1,639 \n1,431 \n15 \n%\n4,760 \n4,228 \n13 \n%\nPercentage of total revenue\n27 \n%\n26 \n%\n27 \n%\n27 \n%\nGeneral and administrative\n408 \n366 \n11 \n%\n1,152 \n1,073 \n7 \n%\nPercentage of total revenue\n7 \n%\n7 \n%\n7 \n%\n7 \n%\nAcquisition termination fee\n— \n— \n**\n— \n1,000 \n**\nPercentage of total revenue\n*\n*\n*\n6 \n%\nAmortization of intangibles\n38 \n43 \n(12)\n%\n120 \n127 \n(6)\n%\nPercentage of total revenue\n1 \n%\n1 \n%\n1 \n%\n1 \n%\nTotal operating expenses\n$\n3,173 \n$\n2,862 \n11 \n%\n$\n9,228 \n$\n9,373 \n(2)\n%\n \n_________________________________________\n(*)    \nPercentage is less than 1%.\n(**)    \nPercentage is not meaningful.\nResearch and Development \nResearch and development expenses consist primarily of compensation and contracted costs associated with software development, third-party hosting services and data center costs including AI training costs, related facilities costs and expenses associated with computer equipment and software used in development activities. \nResearch and development expenses increased during the three and nine months ended August 29, 2025 as compared to the three and nine months ended August 30, 2024 primarily due to increases in compensation costs.\nInvestments in research and development, including the recruiting and hiring of software developers, are critical to remain competitive in the marketplace and are directly related to continued timely development of new and enhanced offerings and solutions. We will continue to focus on long-term opportunities available in our end markets and make significant investments in the development of our subscription and service offerings, apps and tools.\nSales and Marketing\nSales and marketing expenses consist primarily of compensation costs, amortization of contract acquisition costs, including sales commissions, travel expenses and related facilities costs for our sales, marketing, order management and global supply chain management personnel. Sales and marketing expenses also include the costs of programs aimed at increasing revenue, such as advertising, trade shows and events, public relations and other market development programs.\nSales and marketing expenses increased during the three and nine months ended August 29, 2025 as compared to the three and nine months ended August 30, 2024 primarily due to increases in advertising expenses and compensation costs.\nGeneral and Administrative\nGeneral and administrative expenses consist primarily of compensation and contracted costs, travel expenses and related facilities costs for our finance, facilities, human resources, legal, information services and executive personnel. General and administrative expenses also include outside legal and accounting fees, expenses associated with computer equipment and software used in the administration of the business, charitable contributions, provision for bad debts and various forms of insurance.\nGeneral and administrative expenses increased during the three and nine months ended August 29, 2025 as compared to the three and nine months ended August 30, 2024 primarily due to increases in compensation costs and software licenses.\n32\nTable of Contents\nAcquisition Termination Fee\nDuring the nine months ended August 30, 2024, we incurred a $1 billion termination fee which resulted from termination of the Figma transaction.\nNon-Operating Income (Expense), Net for the Three and Nine Months Ended August 29, 2025 and August 30, 2024\n(dollars in millions)\nThree Months\nNine Months\n \n2025\n2024\n% Change\n2025\n2024\n% Change\nInterest expense\n$\n(67)\n$\n(51)\n31 \n%\n$\n(197)\n$\n(119)\n66 \n%\nInvestment gains (losses), net\n23 \n12 \n**\n31 \n34 \n**\nOther income (expense), net\n58 \n89 \n**\n191 \n241 \n**\nTotal non-operating income (expense), net\n$\n14 \n$\n50 \n**\n$\n25 \n$\n156 \n**\n \n_________________________________________\n(**)    \nPercentage is not meaningful.\nInterest Expense\nInterest expense represents interest associated with our debt instruments. Interest on our senior notes is payable semi-annually, in arrears. Floating interest payments on our interest rate swaps are paid quarterly. The fixed-rate interest receivable on the swaps is received semi-annually concurrent with the senior notes interest payments.\nInterest expense increased during the three and nine months ended August 29, 2025 as compared to the three and nine months ended August 30, 2024 primarily due to higher average debt balances. \nSee Notes 5 \nand 13 for further details regarding our i\nnterest rate swaps and \ndebt, respectively\n.\nInvestment Gains (Losses), Net\nInvestment gains (losses), net consists principally of unrealized holding gains and losses associated with our deferred compensation plan assets.\nOther Income (Expense), Net\n \nOther income (expense), net consists primarily of interest earned on cash, cash equivalents and short-term fixed income investments. Other income (expense), net also includes realized gains and losses on fixed income investments and foreign exchange gains and losses.\nProvision for Income Taxes for the Three and Nine Months Ended August 29, 2025 and August 30, 2024\n(dollars in millions)\nThree Months\nNine Months\n \n2025\n2024\n% Change\n2025\n2024\n% Change\nProvision for income taxes\n$\n415 \n$\n358 \n16 \n%\n$\n1,196 \n$\n1,063 \n13 \n%\nEffective tax rate\n19 \n%\n18 \n%\n18 \n%\n22 \n%\nOur effective tax rate increased by approximately one percentage point for the three months ended August 29, 2025, as compared to the three months ended August 30, 2024, primarily due to a net tax expense related to stock-based compensation recorded during the three months ended August 29, 2025 as compared to a net tax benefit related to stock-based compensation recorded during the year-ago period. Our effective tax rate decreased by approximately four percentage points for the nine months ended August 29, 2025, as compared to the nine months ended August 30, 2024, primarily due to the impact of the Figma acquisition termination fee incurred in the prior year, which was not deductible for financial statement purposes, and an increase in the anticipated benefit from a foreign tax asset in the current year. The decrease was partially offset by a net tax expense related to stock-based compensation recorded during the nine months ended August 29, 2025 as compared to a net tax benefit related to stock-based compensation recorded during the year-ago period.\nOur effective tax rates for the three and nine months ended August 29, 2025 were lower than the U.S. federal statutory tax rate of 21% primarily due to the net tax benefits from effects of non-U.S. operations and the U.S. federal research tax credit, partially offset by state taxes and a net tax expense related to stock-based compensation.\nWe recognize deferred tax assets to the extent that we believe these assets are more likely than not to be realized based on evaluation of all available positive and negative evidence. On the basis of this evaluation, we continue to maintain a \n33\nTable of Contents\nvaluation allowance to reduce our deferred tax assets to the amount realizable. The total valuation allowance was $805 million as of August 29, 2025, primarily related to certain state credits and capital loss carryforwards.\nWe are a U.S.-based multinational company subject to tax in multiple domestic and foreign tax jurisdictions. The current U.S. tax law subjects the earnings of certain foreign subsidiaries to U.S. tax and generally allows an exemption from taxation for distributions from foreign subsidiaries.\nIn the current global tax policy environment, the domestic and foreign governing bodies continue to consider, and in some cases introduce, changes in regulations applicable to corporate multinationals such as Adobe. As regulations are issued, we account for finalized regulations in the period of enactment.\nSeveral countries have enacted, or have committed to enact, the Organization for Economic Cooperation and Development’s 15% global minimum tax regime effective for our fiscal 2025. The currently enacted legislation is not expected to have a material impact on our provision for income taxes, however we continue to monitor developments and evaluate impacts, if any, of these provisions on our results of operations and cash flows.\nOn July 4, 2025, the One Big Beautiful Bill Act (“2025 U.S. Tax Act”) was enacted in the United States. Among the changes, the 2025 U.S. Tax Act restores immediate expensing of domestic research and development costs and modifies certain international provisions effective for us starting in fiscal 2026 and 2027, respectively. We do not expect a material impact on our current fiscal year effective rates for income taxes or for cash taxes paid. While we continue to evaluate the impact for future years, we anticipate a reduction to our effective rates for cash taxes paid in years after fiscal 2025.\nAccounting for Uncertainty in Income Taxes\nThe gross liabilities for unrecognized tax benefits excluding interest and penalties were $715 million and $703 million as of August 29, 2025 and August 30, 2024, respectively. If the total unrecognized tax benefits as of August 29, 2025 and August 30, 2024 were recognized, $542 million and $539 million would decrease the respective effective tax rates.\nAs of August 29, 2025 and August 30, 2024, the combined amounts of accrued interest and penalties included in long-term income taxes payable related to tax positions taken on our tax returns were not material.\nThe timing of the resolution of income tax examinations is highly uncertain as are the amounts and timing of tax payments that are part of any audit settlement process. These events could cause large fluctuations in the balance sheet classification of our tax assets and liabilities. We believe that within the next 12 months, it is reasonably possible that either certain audits will conclude or statutes of limitations on certain income tax examination periods will expire, or both. Although the timing of resolution, settlement and closing of audits is not certain, it is reasonably possible that the underlying unrecognized tax benefits may decrease by up to $55 million over the next 12 months.\nOur future effective tax rates may be materially affected by changes in the tax rates in jurisdictions where our income is earned, changes in jurisdictions in which our profits are determined to be earned and taxed, changes in the valuation of our deferred tax assets and liabilities, changes in or interpretation of tax rules and regulations in the jurisdictions in which we do business, or unexpected changes in business and market conditions that could reduce certain tax benefits.\nIn addition, tax laws in the United States as well as other countries and jurisdictions in which we conduct business are subject to change as new laws are passed and/or new interpretations are made available. These countries, governmental bodies, such as the European Commission of the European Union, and intergovernmental economic organizations, such as the Organization for Economic Cooperation and Development, have made or could make unprecedented assertions about how taxation is determined and, in some cases, have proposed or enacted new laws that are contrary to the way in which rules and regulations have historically been interpreted and applied. Changes in our operating landscape, such as changes in laws and/or interpretations of tax rules, could adversely affect our effective tax rates and/or cause us to respond by making changes to our business structure which could adversely affect our operations and financial results.\nMoreover, we are subject to the examination of our income tax returns by domestic and foreign tax authorities. We regularly assess the likelihood of outcomes resulting from these examinations to determine the adequacy of our provision for income taxes and have reserved for potential adjustments that may result from these examinations. Our policy is to record interest and penalties related to unrecognized tax benefits in income tax expense. While we believe our tax estimates are reasonable, we cannot provide assurance that the final determination of any of these examinations will not have an adverse effect on our financial position and results of operations.\n34\nTable of Contents\nLIQUIDITY AND CAPITAL RESOURCES\nCash Flows\nOur primary source of cash is receipts from revenue. Other customary sources of cash include proceeds from maturities and sales of short-term investments and issuance of debt instruments. Our primary uses of cash are general business expenses including payroll and related benefits costs, income taxes, marketing and third-party hosting services, as well as our stock repurchase program as described below. Other customary uses of cash include purchases of short-term investments, property and equipment, payments for taxes related to net share settlement of equity awards, repayment of debt instruments and business acquisitions.\nThis data should be read in conjunction with our condensed consolidated statements of cash flows.\nAs of\n(in millions)\nAugust 29, 2025\nNovember 29, 2024\nCash and cash equivalents\n$\n4,982 \n$\n7,613 \nShort-term investments\n$\n958 \n$\n273 \nWorking capital\n$\n173 \n$\n711 \nStockholders’ equity\n$\n11,770 \n$\n14,105 \nA summary of our cash flows is as follows:\n \nNine Months Ended\n(in millions)\nAugust 29, 2025\nAugust 30, 2024\nNet cash provided by operating activities\n$\n6,871 \n$\n5,135 \nNet cash provided by (used for) investing activities\n(1,041)\n130 \nNet cash used for financing activities\n(8,505)\n(5,223)\nEffect of foreign currency exchange rates on cash and cash equivalents\n44 \n10 \nNet change in cash and cash equivalents\n$\n(2,631)\n$\n52 \nCash Flows from Operating Activities\nNet cash provided by operating activities of $6.87 billion for the nine months ended August 29, 2025 was primarily comprised of net income adjusted for the net effect of non-cash items. Working capital sources of cash included increases in deferred revenue driven by our Digital Experience and Digital Media offerings. The primary working capital uses of cash included decreases in accrued expenses and other liabilities and increases in prepaid expenses and other assets.\nCash Flows from Investing Activities\nNet cash used for investing activities of $1.04 billion for the nine months ended August 29, 2025 was primarily due to purchases of short-term and long-term investments, net of proceeds from the maturities of short-term investments, and ongoing capital expenditures.\nCash Flows from Financing Activities\nNet cash used for financing activities of $8.51 billion for the nine months ended August 29, 2025 was primarily due to payments for our common stock repurchases and repayment of our 1.90% 2025 Notes and 3.25% 2025 Notes. These uses of cash were offset in part by proceeds from the issuance of senior notes. \nSee the sections titled “Senior Notes” and “Stock Repurchase Program” below.\nLiquidity and Capital Resources Considerations\nOur existing cash, cash equivalents and investment balances may fluctuate during fiscal 2025 due to changes in our planned cash outlay.\nCash from operations could also be affected by various risks and uncertainties, including, but not limited to, risks detailed in the section titled “Risk Factors” in titled Part II, Item 1A of this report. Based on our current business plan and revenue prospects, we believe that our existing cash, cash equivalents and investment balances, our anticipated cash flows from operations and our available revolving credit facility will be sufficient to meet our working capital, operating resource expenditure and capital expenditure requirements for the next twelve months and for the foreseeable future.\n35\nTable of Contents\nOur cash equivalent and short-term investment portfolio as of August 29, 2025 primarily consisted of money market funds, corporate debt securities, U.S. Treasury securities and time deposits.\nWe expect to continue our investing activities, including short-term and long-term investments, purchases of computer and server hardware to operate our network infrastructure, sales and marketing, product support and administrative staff. Furthermore, cash reserves may be used to repurchase stock under our stock repurchase program and to strategically acquire companies, products or technologies that are complementary to our business. \nRevolving Credit Agreement\nWe have a $1.5 billion senior unsecured revolving credit agreement (the “Revolving Credit Agreement”) with a syndicate of lenders, providing for loans to us and certain of our subsidiaries through June 30, 2027. Subject to the agreement of lenders, we may obtain up to an additional $500 million in commitments, for a maximum aggregate commitment of $2 billion. As of August 29, 2025, there were no outstanding borrowings under the Revolving Credit Agreement and the entire $1.5 billion credit line remains available for borrowing. Under the terms of our Revolving Credit Agreement, we are not prohibited from paying cash dividends unless payment would trigger an event of default or if one currently exists. We do not anticipate paying any cash dividends in the foreseeable future.\nCommercial Paper Program\nWe have a commercial paper program under which we may issue unsecured commercial paper up to a total of $3 billion outstanding at any time, with maturities of up to 397 days from the date of issue. The net proceeds from the issuance of commercial paper are expected to be used for general corporate purposes, which may include working capital, capital expenditures, acquisitions, stock repurchases, refinancing indebtedness or any other general corporate purposes. As of August 29, 2025, there were no outstanding borrowings under the commercial paper program.\nSenior Notes\nIn January 2025, we issued $800 million of senior notes due January 17, 2028, $700 million of senior notes due January 17, 2030 and $500 million of senior notes due January 17, 2035. In total, we have $6.15 billion of senior notes outstanding, which rank equally with our other unsecured and unsubordinated indebtedness. During the nine months ended August 29, 2025, we entered into interest rate swaps for certain of our senior notes that effectively convert the fixed interest rates on the notes to floating interest rates. As of August 29, 2025, the carrying value of our senior notes was $6.20 billion, net of fair value of the interest rate swaps and unamortized discount and debt issuance costs, and our maximum commitment for interest payments was $1.09 billion for the remaining duration of our outstanding senior notes and interest rate swaps. Interest on the notes is payable semi-annually, in arrears, and interest on the swaps is payable quarterly. Our senior notes do not contain any financial covenants. \nSee Note 13 of our notes to condensed consolidated financial statements for further details regarding our debt.\nContractual Obligations\nOur principal commitments as of August 29, 2025 consisted of purchase obligations resulting from agreements to purchase goods and services in the ordinary course of business and obligations under operating lease arrangements. During the second quarter of fiscal 2025, we executed agreements associated with certain of our long-term supplier commitments that increased our minimum purchase obligations by approximately $1.3 billion through December 2029. There have been no other material changes in our purchase obligations during the nine months ended August 29, 2025.\nStock Repurchase Program\nTo facilitate our stock repurchase program, designed to return value to our stockholders and minimize dilution from stock issuances, we may repurchase our shares in the open market or enter into structured repurchase agreements with third parties. In March 2024, our Board of Directors granted authority to repurchase up to $25 billion in our common stock through March 14, 2028. In June 2025, we entered into a stock repurchase arrangement with a large financial institution to execute up to $2.5 billion in open market repurchases, which remained partially outstanding as of August 29, 2025. Upon completion of this arrangement, $8.40 billion remains under our March 2024 stock repurchase authority.\nDuring the nine months ended August 29, 2025, we entered into stock repurchase arrangements with large financial institutions and made payments totaling $8.81 billion to repurchase shares. Subsequent to August 29, 2025, as part of the March 2024 stock repurchase authority, we entered into a stock repurchase arrangement with a large financial institution under which we may execute up to $2.5 billion in open market repurchases. \nSee Note 10 of our notes to condensed consolidated financial statements for further details regarding our stock repurchase program.\n36\nTable of Contents\nIndemnifications\nIn the ordinary course of business, we provide indemnifications of varying scope to our customers and channel partners against claims of intellectual property infringement made by third parties arising from the use of our products and from time to time, we are subject to claims by our customers under these indemnification provisions. Historically, costs related to these indemnification provisions have not been significant and we are unable to estimate the maximum potential impact of these indemnification provisions on our future results of operations.\nTo the extent permitted under Delaware law, we have agreements whereby we indemnify our officers and directors for certain events or occurrences while the officer or director is or was serving at our request in such capacity. The indemnification period covers all pertinent events and occurrences during the officer’s or director’s lifetime. The maximum potential amount of future payments we could be required to make under these indemnification agreements is unlimited; however, we have director and officer insurance coverage that reduces our exposure and enables us to recover a portion of any future amounts paid."
}