{
  "source_file": "adi-20251101.htm",
  "form_type": "10-K",
  "item1": "ITEM 1.    BUSINESS\nCompany Overview, Strategy and Mission\nAnalog Devices, Inc. (we, Analog Devices or the Company) is a global semiconductor leader dedicated to solving our customers’ most complex engineering challenges. We deliver innovations that connect technology to human breakthroughs and play a critical role at the intersection of the physical and digital worlds by providing the building blocks to sense, measure, interpret, connect and power. We design, manufacture, test and market a broad portfolio of solutions, including integrated circuits (ICs), software and subsystems that leverage high-performance analog, mixed-signal and digital signal processing technologies. Our comprehensive product portfolio, deep domain expertise and advanced manufacturing capabilities extend across high-performance precision and high-speed mixed-signal, power management and processing technologies – including data converters, amplifiers, power management, radio frequency (RF) ICs, edge processors and other sensors.  \nThe Intelligent Edge is characterized by ubiquitous sensing, hyper-scale and edge computing, artificial intelligence (AI) and pervasive connectivity. These technological trends drive new generations of applications that expand the demand for Analog Devices’ high-performance analog, mixed-signal, power and RF ICs. We have positioned our business to capitalize on these long-term growth opportunities and to deliver innovative solutions across industries. Central to our strategy is our focus on solving challenges that our customers face across the most impactful application areas. This strategy is built around the following key priorities, which we believe will continue to drive our long-term success: \n•\nEfficient use of capital.\n Research and development (R&D) is critical to continuing our cycle of innovation, driven by a diverse array of engineering talent who “engineer good” for our planet and society. We are committed to realizing targeted shareholder value creation from acquisitions to complement our R&D and drive long-term value creation. Through the development of cutting-edge innovations and our ability to solve difficult problems across a broad array of applications, we generate significant cash flow and are committed to delivering strong shareholder returns.\n•\nDeepening customer-centricity.\n Close customer relationships influence all aspects of our business: from our broad range of product portfolios and application expertise to manufacturing capabilities in high-performance power management and precision and high-speed signal processing technologies. We believe that our engineering talent continues to be an important competitive differentiator in the semiconductor space that will enable us to deepen our relationships with customers. We strive to be the destination for the world’s best engineering talent, with a team of approximately 13,000 engineers. Together, our products and our engineering talent enable us to partner with our customers, leveraging our analog domain expertise and the full breadth of our technology capabilities to develop complete and innovative solutions.\n•\nCapitalizing on secular trends. \nWe are positioned to capitalize on critical long-term growth trends to drive advancements in digitized factories, mobility and digital healthcare, combat climate change and reliably connect humans and the world. We are well aligned with the key B2B markets driving the increase in data at the Intelligent Edge and will continue to be a critical partner in the collection, creation and communication of our customers’ edge data. In addition, we incorporate AI capabilities across our technologies, business operations, products and services to enhance performance and drive smarter, more efficient solutions.\nWe were incorporated in Massachusetts in 1965\n \nwith our corporate headquarters near Boston in Wilmington, Massachusetts. We have manufacturing facilities primarily in the United States, Ireland and Southeast Asia. Our common stock is listed on the Nasdaq Global Select Market under the symbol ADI and is included in the Standard & Poor’s 500 Index. Our fiscal year is the 52-week or 53-week period ending on the Saturday closest to the last day in October; November 1, 2025 (fiscal 2025) was a 52-week fiscal period, while the fiscal year ended November 2, 2024 (fiscal 2024) was a 53-week fiscal period and the fiscal year ended October 28, 2023 (fiscal 2023) was a 52-week fiscal period. The additional week in fiscal 2024 was included in the first quarter ended February 3, 2024. Therefore, fiscal 2025 and fiscal 2023 include one less week of operations as compared to fiscal 2024.\n2\nAvailable Information\nWe maintain a website with the address www.analog.com. We make available free of charge through our website our Annual Reports on Form 10-K, Quarterly Reports on Form 10-Q and Current Reports on Form 8-K (including exhibits), and amendments to these reports, as soon as reasonably practicable after we electronically file such material with, or furnish such material to, the Securities and Exchange Commission (SEC). We also make available on our website our by-laws, corporate governance guidelines, the charters for the committees of our Board of Directors, our code of business conduct and ethics, which applies to our directors, officers and employees, and other governance documents. Such information is available in print and free of charge to any shareholder of Analog Devices who requests it. In addition, we intend to disclose on our website any amendments to, or waivers from, our code of business conduct and ethics that are required to be publicly disclosed pursuant to rules of the SEC or Nasdaq.\nWe have included our website address in this Annual Report on Form 10-K as an inactive textual reference. We are not including the information contained on our website as a part of, or incorporating it by reference into, this Annual Report on Form 10-K. \nProducts\nSemiconductor components are the building blocks used in electronic systems and equipment. These components are classified as either discrete devices, such as individual transistors, or as ICs, in which a number of transistors and other elements are combined to form a more complicated electronic circuit. \nOur ICs are designed to address a wide range of real-world signal processing applications. We sell our ICs to customers worldwide, many of whom use products spanning our core technologies in a wide range of applications. Our IC product portfolio includes both general-purpose products used by a broad range of customers and applications, as well as application-specific products designed for specific target markets. By using readily available, high-performance, general-purpose products in their systems, our customers can reduce the time they need to bring new products to market. Given the high cost of developing more customized ICs, our standard products often provide a cost-effective solution for many low to medium volume applications. Our analog ICs monitor, condition, amplify or transform continuous analog signals associated with physical properties, such as temperature, pressure, weight, light, sound or motion, and play an important role in bridging real world phenomena to a variety of electronic systems. Our analog ICs also provide voltage regulation and power control to electronic systems.\nWe also work with customers to design application-specific solutions. We begin with our existing core technologies, which leverage our analog and mixed signal, power management, RF and microwave, edge processors and other sensors, and devise solutions that more closely meet the needs of a specific customer or group of customers. In certain cases, because we have already developed the core technology platform for our general-purpose products, we can create application-specific solutions quickly and efficiently.\nOur analog and mixed-signal IC technology have been the foundation of our business for six decades, and we are one of the world’s largest suppliers of high-performance analog ICs. Our analog signal processing ICs are primarily high-performance devices, offering higher dynamic range, greater bandwidth and other enhanced features. We believe that the principal advantages these products have as compared to competitors’ products include higher accuracy, higher speed, smaller size, lower power consumption and fewer components, resulting in improved performance and reliability. Our product portfolio includes several thousand analog ICs, many of which can have several hundred end customers. Our analog ICs typically have long product life cycles. Our customers include original equipment manufacturers (OEMs) and customers who build electronic subsystems for integration into larger systems.\nWe continue to expand our capabilities in software, digital platforms and AI to support the evolving needs of our customers and markets. These efforts are intended to enhance system-level performance, improve design efficiency, reduce complexity and help customers accelerate time to market for their products and solutions.  Our strategic goal is to bridge the domains of analog and mixed-signal, digital and embedded and AI and software technologies to enable intelligent systems that can sense, process and respond to real-world conditions. This integrated approach supports the development of differentiated solutions across industrial, automotive, communications, consumer and healthcare applications.\nOur product offerings include more than 75,000 stock keeping units (SKUs) that can be aggregated into the following general categories:\n•\nAnalog and Mixed Signal\n—We are a leading supplier of data converter products. Data converters translate real-world analog signals into digital data and also translate digital data into analog signals. Data converters remain our largest and most diverse product family and an area where we are continuously innovating to enable our customers to redefine and differentiate their products. Our converter products combine sampling rates and accuracy with the low noise, power, price and small package size required by industrial, automotive, consumer and communications electronics.\n3\n•\nPower Management & Reference\n—Power management and reference products, which include functions such as power conversion, driver monitoring, sequencing and energy management, provide efficient solutions for power management and conversion applications in the automotive, communications, industrial and high-end consumer markets. Our high-performance power ICs include powerful performance, integration and software design simulation tools to provide fast and accurate power supply designs.\n•\nAmplifiers/RF and Microwave\n—We are also a leading supplier of high-performance amplifiers which are used to condition analog signals. High performance amplifiers emphasize the performance dimensions of speed and precision. Within this product portfolio we provide precision, instrumentation, high-speed, intermediate frequency/RF/microwave, broadband and other amplifiers. Our analog product line also includes a broad portfolio of high-performance RF and microwave ICs covering the entire RF signal chain. Our high-performance RF and microwave ICs support the high-performance requirements of cellular infrastructure and a broad range of applications in our target markets, including instrumentation, aerospace and automotive.\n•\nSensors & Actuators\n—Our analog technology portfolio is comprised of sensor and actuator products, including products based on micro-electro-mechanical systems (MEMS) technology. MEMS technology enables us to build extremely small sensors that incorporate an electromechanical structure and the supporting analog circuitry for conditioning signals obtained from the sensing element. Our MEMS product portfolio includes accelerometers used to sense acceleration, gyroscopes used to sense rotation, inertial measurement units used to sense multiple degrees of freedom combining multiple sensing types along multiple axes, and broadband switches suitable for radio and instrument systems. We offer other high-performance sensors, from temperature to magnetic fields, that are deployed in a variety of systems. In addition to sensor products, our other analog product category includes isolators that enable designers to implement isolation in designs without the cost, size, power, performance and reliability constraints found with optocouplers.\n•\nDigital Signal Processing and System Products\n \n(DSPs)\n—DSPs are optimized for high-speed numeric calculations, which are essential for instantaneous, or real-time, processing of digital data generated, in most cases, from analog to digital signal conversion. Our DSPs are designed to be fully programmable and to efficiently execute specialized software programs, or algorithms, associated with processing digitized real-time, real-world data. Programmable DSPs are designed to provide the flexibility to modify the device’s function quickly and inexpensively using software. Our general-purpose DSP IC customers typically write their own algorithms using software development tools provided by us and third-party suppliers. Our DSPs are designed in families of products that share common architectures and therefore can execute the same software across a range of products.\n•\nInterface\n—Includes general purpose analog ICs whose primary function is to modify or shape the signal in order to ensure signal integrity for transmission over a distance through a physical medium such as a wire, cable, waveguide or tracks within a printed circuit board. These include devices that shape the signal for transmission over the medium or reconstruct the received signal after transmission to recover the intended signal integrity. \n•\nSoftware, Digital Platforms and Artificial Intelligence\n—As part of our evolution from a component supplier to a full-system and solutions provider, we recently introduced an upgrade to our open-source embedded development platform, CodeFusion Studio 2.0, designed to support embedded system design through integrated workflows for signal processing, edge computing and connectivity. CodeFusion Studio 2.0 facilitates prototyping and deployment of applications on ADI platforms and is intended to reduce development time and improve system integration. In fiscal 2025, we also launched Power Studio, a digital simulation and design ecosystem integrating new system-level and IC-level design capabilities into a single product family. Together, the Power Studio family of products is designed to enable faster time to market by streamlining power management design and optimization. These platforms are part of our broader Physical Intelligence vision, which seeks to leverage our deep expertise in electro-physical systems to develop and fine-tune foundational AI models that can reason about and interact with the real world. This initiative integrates signal, power, sensing, time-series sampling, actuation and more to support autonomous operation and enhanced system responsiveness. These software and AI-driven capabilities complement our existing product portfolio and support our strategy to deliver differentiated solutions that address complex customer requirements.\nSales Channel\nWe sell our products globally through a direct sales force, third-party distributors, independent sales representatives and via our website. We have direct sales offices, sales representatives and/or distributors in approximately 50 countries. We support our worldwide sales efforts through our website and with extensive promotional programs that include editorial coverage and paid advertising in online and printed trade publications, webinars, social media and communities, promotional and training videos, direct mail programs, technical seminars and participation in trade shows. We publish, share and distribute technical content such as data sheets, application guides and catalogs. We maintain a staff of field application engineers who aid \n4\ncustomers in incorporating our products into their products. In addition, we offer a variety of web-based tools that ease product selection and aid in the design process for our customers.\nWe believe distributors provide a cost-effective means of reaching a broad range of customers while providing efficient logistics services. From time to time, we may add or terminate distributors in specific geographies, or move customers to a direct support or fulfillment model as we deem appropriate given our strategies, the level of distributor business activity and distributor performance and financial condition.\nThese distributors typically maintain an inventory of our products. Some of them also sell products that compete with our products, including those for which we are an alternate source. We make sales to distributors under agreements that allow certain distributors to receive price adjustment credits and to return qualifying products for credit, typically as determined by us, in order to reduce the amounts of slow-moving, discontinued or obsolete product from their inventory. These agreements limit such returns to a certain percentage of our shipments to that distributor during the prior quarter. In addition, certain distributors are allowed to return unsold products if we terminate the relationship with the distributor. Additional information relating to our revenue and customer concentration is set forth in Note 2l, \nConcentrations of Risk\n; Note 2n, \nRevenue Recognition\n; and Note 4, \nIndustry, Segment and Geographic Information\n, of the Notes to Consolidated Financial Statements contained in Part II, Item 8 of this Annual Report on Form 10-K.  \nWe typically do not have long-term sales contracts with our customers. In some of our markets where end-user demand may be particularly volatile and difficult to predict, some customers place orders that require us to manufacture product and have it available for shipment, even though the customer is unwilling to make a binding commitment to purchase all, or even any, of the product. In other instances, we manufacture product based on forecasts of customer demand. As a result, we may incur inventory and manufacturing costs in advance of anticipated sales and are subject to the risk of cancellation of orders leading to a sharp reduction of sales and backlog. Further, those orders or forecasts may be for products that meet the customer’s unique requirements such that those canceled orders would result in an inventory of unsaleable products, causing potential inventory write-offs. \nMarkets \nThe breakdown of our annual revenue by end market is set out in the table below:\nEnd Market*\nPercent of Fiscal 2025 Revenue\nPercent of Fiscal 2024 Revenue\nPercent of Fiscal 2023 Revenue\nIndustrial\n45%\n46%\n53%\nAutomotive\n30%\n30%\n24%\nConsumer\n13%\n13%\n10%\nCommunications\n13%\n12%\n13%\n*The sum of the individual percentages may not equal 100% due to rounding.\nThe following describes some of the characteristics of, and customer products within, our major end markets of Industrial, Automotive, Communications and Consumer:\nIndustrial\n — Our industrial market includes the following sectors:\nIndustrial Automation \n— We are a leader in industrial automation demonstrated through our delivery of robust, high-performance solutions derived from our expertise in deep motion and process control and precision sensing measurement and interpretation, which translate into expansive connectivity and power capabilities. We take real-world phenomena in the most complex environments on the factory floor and translate them into valuable insights and outcomes. We co-create with customers to architect robotics systems and solutions that improve dynamic behavior and precision while enhancing worker safety, machine health and manufacturing flexibility. Our industrial automation market includes applications such as:\n• Condition-based monitoring (CbM)\n \n• Industrial power supplies\n• Industrial robotics\n \n• Industrial motion control\n• Factory and process control\n \nInstrumentation & Measurement\n — Trusted measurement is at the forefront of innovation. With the rapid pace of global transformation, from ubiquitous connectivity, to electrification, to AI, to human health and environmental sustainability — all of these trends require reliable and efficient test solutions from R&D to manufacturing to field deployment. We enable high performance measurement through our components and system solutions. Our RF, high-speed and power management products are designed to enable solutions for complying with evolving communications standards. Our high-voltage, isolation and precision products are a key part of the systems that are designed for safety, longevity and efficiency in electric vehicles and renewable energy. Beyond electrical testing, our precision and power technology enable analytical instruments for drug or \n5\nvaccine R&D and manufacturing, food safety and quality and environmental monitoring. Our instrumentation and measurement market includes applications such as:\n• Automated test equipment\n \n• Automotive and energy test\n• Electronic test and measurement\n \n• Life sciences and drug discovery\n• Environmental and process analysis\nAerospace/Defense\n — The defense, commercial avionics and space markets all require high-performance ICs that meet rigorous environmental and reliability specifications. Many of our ICs can be supplied in versions that meet these standards. In addition, many products can be supplied to meet the standards required for broadcast satellites and other commercial space applications. Most of our products sold in this market are specially tested versions of products derived from our standard product offering. As end systems are becoming more complex, many of our customers in this market also look for us to provide higher levels of integration in order to minimize size, weight and power and to improve ease-of-use. As such, we also sell products in the form of system in package (SiPs), printed circuit board assemblies, modules and subsystems. Customer products include applications such as:\n• Navigation systems\n \n• Radar systems\n• Space and satellite communications\n \n• Security devices\n• Communication systems\n• Electronic surveillance and countermeasures\nHealthcare\n — The healthcare market is evolving in response to the need for increased access to better and more affordable care, as well as a growing focus on preventative healthcare and the need to better and more cost effectively manage chronic conditions. To help achieve this, we collaborate with customers and partners on innovative solutions designed to achieve better outcomes for patients and more efficient workflows for physicians at reduced costs. Our offerings include both standard and application-specific hardware, software and service-based products and are used in applications such as:\n• Ultrasound, PET and MRI systems\n \n• Anesthesia equipment\n• X-Ray equipment (CT and DX-Ray)\n \n• Lab and point of care diagnostic equipment\n• Image guided therapy\n \n• Robotic surgery, surgical tools and instruments\n• Multi-parameter vital signs monitors\n \n• Blood analyzers and infusion pumps\n• Remote patient monitoring and wellness\n \n• Renal therapy and organ transplant systems\n• Continuous glucose monitoring\n• Insulin pumps\nEnergy Management\n — The global drive towards improved energy efficiency, conservation, reliability and clean energy is driving investments in electrification across many different application areas, including electric vehicle charging infrastructure, renewable energy, power transmission and distribution systems, electric meters and other innovative areas. The common characteristic behind these efforts is the addition of sensing, measurement and communication technologies to electrical infrastructure. Our offerings include both standard and application-specific products and are used in applications such as:\n• Utility meters\n \n• Wind turbines\n• Electric vehicle charging infrastructure\n \n• Solar inverters\n• Substation relays and automation equipment\n \n• Building energy automation/control\nAutomotive \n— We develop differentiated, high-performance signal processing technologies that enable intelligent, efficient and immersive mobility solutions across electrification, digital cabin systems and autonomous platforms. Collaborating with global mobility solution providers, we deliver a comprehensive portfolio of analog, digital, power and sensor ICs engineered to meet the complex demands of modern mobility systems. Our innovations in precision sensing, edge processing and connectivity empower real-time insights and system-level intelligence, helping transform mobility platforms into dynamic, software-defined environments. These technologies support immersive user experiences, optimize energy efficiency and enable mission-critical perception and navigation capabilities across a wide range of mobility applications. Our solutions are deployed in applications such as:\n•\nAudio, voice processing and connectivity\n•\nBattery monitoring and management systems\n•\nVideo processing and networking\n•\nIntelligent power solutions\n6\nCommunications\n — Our communications market includes the following sectors:\nWireless Communications \n— The demand for ubiquitous global connectivity continues to drive the need for wireless network infrastructure. This market requires a range of high-performance RF communications ICs and solutions. Wireless technology relies on the conversion and processing of signals in both analog and digital domains to transmit and receive data over the air. Our high-performance RF and mixed-signal products are designed to deliver higher speed connectivity with lower latency and improved energy efficiency to mobile operators and network providers. In addition, we enable signal chains and advanced processing across the wireless spectrum supporting a diverse range of end systems. In wireless communication applications, our products are incorporated into:\n• Cellular base station equipment\n• Satellite and terrestrial broadband access equipment\n• Microwave backhaul systems\n• Two-way radio communication devices\n• Fixed wireless access systems\nData Center \n— This market is driven by rapid adoption of AI, machine learning and hyperscale architectures, which require advanced power delivery, thermal management and high-speed connectivity solutions to address the growing demand for high-performance computing and cloud infrastructure. Our offerings in this space include:\n• Power management solutions\n• Optical and high-speed connectivity\n• Energy optimization\nConsumer\n — To address the market demand for state of the art personal and professional entertainment systems and the consumer demand for high quality user interfaces, music, movies and photographs, we have developed analog, digital and mixed-signal and power solutions that meet the rigorous cost and time-to-market requirements of the consumer electronics market. The emergence of high-performance, feature-rich consumer products has created a market for our high-performance ICs with a high level of specific functionality that enables best in class user experience and battery management. These products include:\n• Portable devices (smartphones, tablets, handheld gaming and wearable technology) for media and vital signs monitoring applications\n• Prosumer audio/video equipment\n• Hearable devices (headphones, earbuds and hearing health)\nSee Note 4, \nIndustry, Segment and Geographic Information\n, of the Notes to Consolidated Financial Statements contained in Part II, Item 8 of this Annual Report on Form 10-K for further information about our products by end market.\nCompetition \nWe believe that competitive performance in the marketplace for integrated circuits depends upon multiple factors, including technological innovation, strength of brand, diversity of product portfolio, product performance, technical support, delivery capabilities, customer service quality, reliability and price, with the relative importance of these factors varying among products, markets and customers. We compete with a number of semiconductor companies in markets that are highly competitive. Many companies have sufficient financial, manufacturing, technical, sales and marketing resources to develop and market products that compete with our products. Some of our competitors may have more advantageous supply or development relationships with our current and potential customers or suppliers. Our competitors also include both emerging companies selling specialized products in markets we serve and companies outside of the U.S., including entities associated with well-funded efforts by foreign governments to create indigenous semiconductor industries.  \nWe believe that our technical innovation emphasizing product performance and reliability, supported by our commitment to strong customer service and technical support, enables us to make a fundamental difference to our customers’ competitiveness in our chosen markets.\nSeasonality\nOur sales are subject to a varying degree of seasonality. Historically, sales to customers during our first fiscal quarter have been lower than other quarters due to plant shutdowns at some of our customers. In addition, as explained in our risk factors contained in Item 1A of this Annual Report on Form 10-K, our revenue is more likely to be influenced on a quarter-to-quarter basis by cyclicality in the semiconductor industry.\nWe believe that a number of factors should be used to assess future customer demand, including backlog, macroeconomic trends, customer insights and current customer bookings as compared to billings (book-to-bill) ratio. We define backlog to mean firm orders from a customer or distributor with a requested delivery date within thirteen weeks. However, backlog may be \n7\nimpacted by the tendency of customers to rely on shorter lead times available from suppliers, including us, in periods of depressed demand. In periods of increased demand, there is a tendency towards longer lead times that has the effect of increasing backlog, and in some instances, we may not have manufacturing capacity sufficient to fulfill all orders. As is customary in the semiconductor industry, we allow most orders to be canceled within a reasonable notification period or deliveries to be delayed by customers without significant penalty, while also allowing certain distributors to receive price adjustment credits and to return qualifying products for credit, typically as determined by us, in order to reduce the amounts of slow-moving, discontinued or obsolete product from their inventory.  \nProduction Resources\nMonolithic IC components are manufactured in a sequence of semiconductor production steps that include wafer fabrication, wafer testing, dicing the wafer into individual “chips,” or dice, assembly of the dice into packages and electrical testing of the devices in final packaged form. The raw materials used to manufacture these devices include silicon wafers, processing chemicals (including liquefied gases), precious metals laminates, ceramic and plastic used for packaging. We utilize, develop and employ a wide variety of manufacturing processes, primarily based on bipolar and complementary metal-oxide semiconductor (CMOS) transistors, which are specifically tailored for use in fabricating high-performance analog, DSP and mixed-signal ICs. Devices such as MEMS, \ni\nCoupler® isolators and various sensors are fabricated using specialized processes, which typically use substantially similar equipment as bipolar and CMOS processes.\nOur IC products are fabricated on proprietary processes at our internal production facilities in Wilmington, Massachusetts; Camas, Washington; Beaverton, Oregon; and Limerick, Ireland and also on a mix of proprietary and non-proprietary processes at third-party wafer fabricators. We currently source more than half of our wafer requirements annually from third-party wafer fabrication foundries, such as Taiwan Semiconductor Manufacturing Company (TSMC) and others, and the remainder is sourced internally. In addition, we operate an assembly, wafer sort and testing facility in Penang, Malaysia and wafer sort and test facilities in the Philippines and Thailand. We also make extensive use of third-party subcontractors for the assembly and testing of our products. See Note 2e, \nProperty, Plant and Equipment\n, of the Notes to Consolidated Financial Statements contained in Part II, Item 8 of this Annual Report on Form 10-K for further information about our held for sale facility in Penang, Malaysia.\nOur products require a wide variety of components, raw materials and external foundry services, most of which we purchase from third-party suppliers. We have multiple sources for many of the components and materials that we purchase and incorporate into our products. If any of our key suppliers are unable or unwilling to manufacture and deliver sufficient quantities of components to us on the time schedule and of the quality that we require, we may be forced to seek to engage additional or replacement suppliers, which could result in significant expenses and disruptions or delays in manufacturing, product development and shipment of product to our customers. Although we have experienced shortages of components, materials and external foundry services from time to time, we work to balance these constraints by shifting global resources and capacity where appropriate.\nPatents and Intellectual Property Rights\nWe seek to establish and maintain our proprietary rights in our technology and products through the use of patents, copyrights, trademarks and trade secrets. We have a program to file applications for and obtain patents, copyrights and trademarks in the United States and in selected foreign countries where we believe filing for such protection is appropriate. We also seek to maintain our trade secrets and confidential information by nondisclosure policies and through the use of appropriate confidentiality agreements. We have obtained a substantial number of patents and trademarks in the United States and in other countries. As of November 1, 2025, we held approximately 4,780 U.S. patents and approximately 500 published pending U.S. patent applications. There can be no assurance, however, that the rights obtained can be successfully enforced against infringing products in every jurisdiction. While our patents, copyrights, trademarks and trade secrets provide some advantage and protection, we believe our competitive position and future success is largely determined by such factors as the system and application knowledge, innovative skills, technological expertise and management ability and experience of our personnel; the range and success of new products being developed by us; our market brand recognition and ongoing marketing efforts; and customer service and technical support. Although it is generally our policy to seek patent protection for significant inventions that may be patented, we may elect, in certain cases, not to seek patent protection even for significant inventions, if we determine other protection, such as maintaining the invention as a trade secret, to be more advantageous. We also have trademarks that are used in the conduct of our business to distinguish genuine Analog Devices products, and we maintain cooperative advertising programs to promote our brands and identify products containing genuine Analog Devices components.\n8\nGovernment Regulation\nOur business activities are subject to various federal, state, local and foreign laws and regulations, including those related to financial and other disclosures, accounting standards, corporate governance, intellectual property, tax, trade, including import, export and customs, antitrust, environment, health and safety, employment, immigration and travel, cybersecurity, privacy, data protection and localization and anti-corruption. These laws and regulations may differ among jurisdictions, and compliance with them may have a materially adverse impact on our business and results of operations. For more information about these potential impacts, see the section titled “Risk Factors—Risks Related to Cyber, Artificial Intelligence, Intellectual Property, Legal and Regulatory” of this Annual Report on Form 10-K. \nEnvironment, Social and Governance\nWe are a signatory to the United Nations Global Compact and the Business Ambition for 1.5°C campaign, as well as a member of the Responsible Business Alliance. Our Environment, Social and Governance (ESG) aspirations and programs, including our climate targets and our approach to ethical business conduct and ethics and applying fair labor standards, are communicated in our 2024 ESG Report. The ESG Report is available on our website at www.analog.com/corporate-responsibility. The contents of our website and the information contained in our ESG Report are not incorporated by reference into this Annual Report on Form 10-K.  \nTo support our commitment to ESG, we have implemented an oversight structure which includes a quarterly reporting cadence both to senior management and the Nominating and Corporate Governance Committee of the Board of Directors. These quarterly reports include updates on programs, as well as updates on topics such as stakeholder value, risks and opportunities, regulatory preparedness and key ESG focus areas. \nWe have programs and management systems in place to protect the environment and the health and safety of our employees, customers and the public. We endeavor to adhere to applicable environment, health and safety (EHS) regulatory and industry standards across all of our facilities, and to encourage pollution prevention, manage our water and energy consumption, control waste streams to divert from landfills and strive towards continual improvement. We endeavor to achieve excellence in EHS management practices as an integral part of our total quality management system. \nOur EHS management systems in all of our manufacturing facilities are certified to ISO 14001:2015 for environmental management and ISO 45001:2018 for occupation health and safety. Our industrial hygiene surveillance program is designed to minimize and prevent exposures in the workplace. We use two industry standard metrics to assess injury performance and trends worldwide. In fiscal 2025 and fiscal 2024, our global injury rates were lower than the U.S. semiconductor industry benchmark. \nOur manufacturing facilities are subject to numerous and increasingly strict federal, state, local and foreign laws and regulations, particularly with respect to the transportation, storage, handling, use, emission, discharge and disposal of certain chemicals used or produced in the semiconductor manufacturing process. Our products are subject to increasingly stringent regulations regarding substance content in jurisdictions where we do business. Contracts with many of our customers reflect these and additional compliance standards. Substance content of our products includes materials that are subject to reporting requirements, including conflict minerals. Compliance with these laws and regulations has not had a material impact on our capital expenditures, earnings, financial condition or competitive position. There can be no assurance, however, that current or future ESG laws and regulations will not impose costly requirements upon us. Any failure by us to comply with applicable laws, regulations and contractual obligations could result in fines, suspension of production, the need to alter manufacturing processes and legal liability.   \nHuman Capital and Empowerment\nOur company was founded on the principle that people are our greatest asset. Our future success depends in large part on the continued service of our key technical and senior management personnel, and on our ability to continue to attract, retain and motivate qualified employees, particularly highly-skilled engineers involved in the design, development, support and manufacture of new and existing products and processes. In order for us to attract the best talent, we aim to offer challenging work in an environment that enables our employees to learn, grow and reach their full potential. \nCore to our empowerment strategy is building a culture of inclusion across the organization. We are working to achieve this by expanding the diversity of our workforce, creating growth and development opportunities for our employees, embracing different perspectives and fostering an inclusive work environment for all. In addition, we encourage employees to develop different networks open to all employees, which contribute to our broader diversity and inclusion initiatives. Our current employee networks include the Analog Veterans Network, Neurodiversity Network, People of Color and Allies Network, Pride Network, Women’s Leadership Network and Young Professionals Network. As noted in “Environment, Social and Governance” above, we published our 2024 ESG Report which details our sustainability efforts, operations efficiency, \n9\nemployee engagement and governance, and also provides a look at the state of our organization and an overview of some of the initiatives we have launched to drive continuous improvements across inclusion, opportunity for all and equitable practices.\nAs of November 1, 2025, we had approximately 24,500 employees, of whom approximately 13,000 are in engineering roles. Approximately 60% of our workforce is male and 40% female. Our senior leadership team is 73% male and 27% female, while manager roles are approximately 75% male and 25% female. 40% of the members of our Board of Directors are female. For fiscal 2025, our voluntary employee turnover rate was approximately 7.2%. \nOur human capital resource objectives include identifying, recruiting, retaining, incentivizing and integrating our existing and future employees. We strive to attract and retain the most talented employees in the industry and across the globe by offering competitive compensation and benefits that support their health, financial and emotional well-being. Our compensation philosophy is based on rewarding each employee’s individual contributions and striving to achieve equal pay for equal work regardless of gender, race or ethnicity. We use a combination of fixed and variable pay including base salary, bonuses, performance awards and equity compensation. The principal purposes of our equity incentive plans are to attract, retain and motivate selected employees and directors through the granting of stock-based compensation awards. We offer employees benefits that vary by country and are designed to meet or exceed local laws and to be competitive in the marketplace. Examples of benefits offered in the U.S. include a 401(k) plan with employer contributions; health benefits; life, business travel and disability insurance; additional voluntary insurance; paid time off and parental leave; education assistance; paid counseling assistance; backup child and adult care; adoption support; and family college planning. For further information concerning our equity incentive plans, see Note 3, \nStock-based Compensation and Shareholders’ Equity,\n of the Notes to Consolidated Financial Statements contained in Part II, Item 8 of this Annual Report on Form 10-K.\nIn order to ensure that we are meeting our human capital objectives, we regularly conduct employee surveys to evaluate the effectiveness of our employee and compensation programs and to identify opportunities for improvement across the company. Our latest survey, completed in fiscal 2025, reflected a strong participation rate among employees, and the results indicated employee satisfaction in areas such as teamwork, collaboration, leadership support, manager availability and skill development, while also supporting communication, decision speed and removing barriers to execution. Our dual focus of being a great place to work and providing industry-leading benefits and work culture has led to strong employee satisfaction and pride that has been recognized across the globe, as evidenced with the following awards: \nTIME\n World’s Most Sustainable Companies (2025), \nTIME\n World’s Best Companies (2024, 2023), \nForbes\n America’s Best Employers for Company Culture (2025), \nForbes\n America’s Best Large Employers (2024) and \nNewsweek\n America’s Most Responsible Companies (2025).\n10",
  "item7": "ITEM 7.       MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS            OF OPERATIONS (all tabular amounts in thousands except per share amounts)\nThe following discussion includes results of operations and financial condition for the fiscal year ended November 1, 2025 (fiscal 2025) and the fiscal year ended November 2, 2024 (fiscal 2024) and year-over-year comparisons between fiscal 2025 and fiscal 2024. For discussion on results of operations and financial condition for fiscal 2024 and the fiscal year ended October 28, 2023 (fiscal 2023) and year-over-year comparisons between fiscal 2024 and fiscal 2023, please refer to Management’s Discussion and Analysis of Financial Condition and Results of Operations in Part II, Item 7 of our Annual Report on Form 10-K for fiscal 2024 filed with the Securities and Exchange Commission on November 26, 2024. Our fiscal year is the 52-week or 53-week period ending on the Saturday closest to the last day in October. Fiscal 2025 was a 52-week fiscal period, while fiscal 2024 was a 53-week fiscal period. The additional week in fiscal 2024 was included in the first quarter ended February 3, 2024. Therefore, fiscal 2025 includes one less week of operations as compared to fiscal 2024.\nResults of Operations\nOverview\n \nFiscal Year\n \n2025\n2024\n  $ Change\n% Change\nRevenue\n$\n11,019,707 \n$\n9,427,157 \n$\n1,592,550 \n17 \n%\nGross margin %\n61.5 \n%\n57.1 \n%\nNet income\n$\n2,267,342 \n$\n1,635,273 \n$\n632,069 \n39 \n%\nNet income as a % of revenue\n20.6 \n%\n17.3 \n%\nDiluted EPS\n$\n4.56 \n$\n3.28 \n$\n1.28 \n39 \n%\nRevenue Trends by End Market\nThe following table summarizes revenue by end market. The categorization of revenue by end market is determined using a variety of data points including the technical characteristics of the product, the “sold to” customer information, the “ship to” customer information and the end customer product or application into which our product will be incorporated. As data systems for capturing and tracking this data and our methodology evolves and improves, the categorization of products by end market can vary over time. When this occurs, we reclassify revenue by end market for prior periods. Such reclassifications typically do not materially change the sizing of, or the underlying trends of results within, each end market.\n \nFiscal 2025\nFiscal 2024\nRevenue\n% of\nTotal\nRevenue (1)\nY/Y%\nChange\nRevenue\n% of\nTotal\nRevenue (1)\nIndustrial\n$\n4,929,409 \n45 \n%\n15 \n%\n$\n4,290,324 \n46 \n%\nAutomotive\n3,277,865 \n30 \n%\n16 \n%\n2,837,522 \n30 \n%\nConsumer\n1,434,568 \n13 \n%\n19 \n%\n1,207,880 \n13 \n%\nCommunications\n1,377,865 \n13 \n%\n26 \n%\n1,091,431 \n12 \n%\nTotal Revenue\n$\n11,019,707 \n100 \n%\n17 \n%\n$\n9,427,157 \n100 \n%\n_______________________________________\n(1)\nThe su\nm of the individual percentages may not equal the total due to rounding.\nRevenue increased 17% in fiscal 2025 as compared to fiscal 2024 as a result of broad-based increase in demand for our products. In addition to increased demand, the increase in the Industrial end market was primarily due to customer inventory balances normalizing and growth in the test equipment and aerospace and defense sub-markets. In the Automotive end market, the increase was primarily driven by increases from connectivity solutions. The increase in the Consumer end market was primarily related to portable consumer products and the increase in the Communications end market was primarily driven by growth in the wireline sub-market from data center infrastructure expansion in support of AI applications. These increases were partially offset by the impact of an additional week of operations in fiscal 2024 as compared to fiscal 2025.\nRevenue by Sales Channel\nThe following table summarizes revenue by sales channel. We sell our products globally through a direct sales force, third-party distributors, independent sales representatives and via our website. Distributors are customers that buy products with the intention of reselling them. Direct customers are non-distributor customers and consist primarily of original equipment manufacturers (OEMs). Other customers include the U.S. government, government prime contractors and certain commercial \n31\ncustomers for which revenue is recorded over time.  \nFiscal 2025\nFiscal 2024\nRevenue\n% of\nTotal\nRevenue (1)\nRevenue\n% of\nTotal\nRevenue (1)\nDistributors\n$\n6,144,819 \n56 \n%\n$\n5,505,779 \n58 \n%\nDirect customers\n4,718,993 \n43 \n%\n3,772,945 \n40 \n%\nOther\n155,895 \n1 \n%\n148,433 \n2 \n%\nTotal Revenue\n$\n11,019,707 \n100 \n%\n$\n9,427,157 \n100 \n%\n_______________________________________\n(1)\nThe sum of the individual percentages may not equal the total due to rounding.\nAs indicated in the table above, the percentage of total revenue sold via each channel has remained relatively consistent in the periods presented but can fluctuate from time to time based on end market revenue trends. As a percentage of total revenue, the decrease in the distributor channel is primarily due to the decrease in the percentage of revenue from our Industrial end market.\nRevenue Trends by Geographic Region\nGeographic revenue information for fiscal 2025 and fiscal 2024 reflects the geographic location of the distributors or OEMs who purchased the Company’s products. This may differ from the geographic location of the end customers particularly in cases where a third-party contract manufacturer purchases the Company’s products through distributors.\nFiscal Year\n2025\n2024\n  $ Change\n% Change (1)\nUnited States\n$\n3,238,145 \n$\n2,840,426 \n$\n397,719 \n14 \n%\nRest of North and South America\n162,470 \n62,318 \n100,152 \n161 \n%\nEurope\n2,285,598 \n2,109,529 \n176,069 \n8 \n%\nJapan\n989,916 \n1,085,631 \n(95,715)\n(9)\n%\nChina\n2,858,286 \n2,128,840 \n729,446 \n34 \n%\nRest of Asia\n1,485,292 \n1,200,413 \n284,879 \n24 \n%\nTotal Revenue\n$\n11,019,707 \n$\n9,427,157 \n$\n1,592,550 \n17 \n%\n_______________________________________\n(1)\nThe sum of the individual percentages may not equal the total due to rounding.\nIn all periods presented, the predominant regions comprising “Rest of North and South America” are Mexico and Canada; the predominant regions comprising “Europe” are Germany, the Netherlands, France and Israel; and the predominant regions comprising “Rest of Asia” are Taiwan, South Korea, Malaysia and Singapore.\nTotal revenue increased in fiscal 2025 as compared to fiscal 2024 in most regions due to broad-based demand increases as discussed above under the heading \nRevenue Trends by End Market.\nGross Margin\n \nFiscal Year\n \n2025\n2024\n$ Change\n% Change\nGross margin\n$\n6,773,478 \n$\n5,381,343 \n$\n1,392,135 \n26 \n%\nGross margin %\n61.5 \n%\n57.1 \n%\nGross margin percentage in fiscal 2025 increased by 440 basis points compared to fiscal 2024, primarily due to higher utilization of our factories due to increased customer demand as well as a decrease in amortization expense related to acquired intangible assets.\n32\nResearch and Development (R&D)\n \nFiscal Year\n \n2025\n2024\n$ Change\n% Change\nR&D expenses\n$\n1,766,001 \n$\n1,487,863 \n$\n278,138 \n19 \n%\nR&D expenses as a % of revenue\n16 \n%\n16 \n%\nR&D expenses increased in fiscal 2025 as compared to fiscal 2024, primarily as a result of higher R&D employee related variable compensation expenses and higher salary and benefit expenses, partially offset by the impact of an additional week of operations in fiscal 2024 as compared to fiscal 2025.\nR&D expenses as a percentage of revenue will fluctuate from year-to-year depending on the amount of revenue and the success of new product development efforts, which we view as critical to our future growth. We expect to continue the development of innovative technologies and processes for new products. We believe that a continued commitment to R&D is essential to maintain product leadership with our existing products as well as to provide innovative new product offerings. \nSelling, Marketing, General and Administrative (SMG&A)\n \nFiscal Year\n \n2025\n2024\n$ Change\n% Change\nSMG&A expenses\n$\n1,255,339 \n$\n1,068,640 \n$\n186,699 \n17 \n%\nSMG&A expenses as a % of revenue\n11 \n%\n11 \n%\nSMG&A expenses increased in fiscal 2025 as compared to fiscal 2024, primarily as a result of higher SMG&A employee related variable compensation expenses and salary and benefit expenses, partially offset by an additional week of operations in fiscal 2024 as compared to fiscal 2025.\nAmortization of Intangibles\n \nFiscal Year\n \n2025\n2024\n$ Change\n% Change\nAmortization expenses\n$\n749,662 \n$\n754,784 \n$\n(5,122)\n(1)\n%\nAmortization expenses as a % of revenue\n7 \n%\n8 \n%\nAmortization expenses decreased in fiscal 2025 as compared to fiscal 2024, primarily as a result of a portion of our acquired intangible assets becoming fully amortized. \nSpecial Charges, Net\n \nFiscal Year\n \n2025\n2024\n$ Change\n% Change\nSpecial charges, net\n$\n69,980 \n$\n37,258 \n$\n32,722 \n88 \n%\nSpecial charges, net as a % of revenue\n1 \n%\n— \n%\nSpecial charges, net increased in fiscal 2025 as compared to fiscal 2024, primarily due to increased charges related to our Global Repositioning Actions. See Note 5, \nSpecial Charges, Net\n, of the Notes to Consolidated Financial Statements included in Item 8 of this Annual Report on Form 10-K for more information.\nNonoperating Expense (Income)\n \nFiscal Year\n \n2025\n2024\n$ Change\n% Change\nNonoperating expense (income)\n$\n220,384 \n$\n255,458 \n$\n(35,074)\n(14)\n%\nThe year-over-year decrease in nonoperating expense in fiscal 2025 as compared to fiscal 2024 was primarily the result of higher interest income from higher cash, cash equivalents and short-term investments balances during fiscal 2025.\n33\nProvision for Income Taxes\n \nFiscal Year\n \n2025\n2024\n$ Change\n% Change\nProvision for income taxes\n$\n444,770 \n$\n142,067 \n$\n302,703 \n213 \n%\nEffective income tax rate\n16.4 \n%\n8.0 \n%\nOur effective tax rates for fiscal 2025 and fiscal 2024 were below the U.S. statutory rate of 21% due to lower statutory tax rates applicable to our operations in the foreign jurisdictions in which we earn income. For fiscal 2025 and fiscal 2024 our pretax income was primarily generated in Ireland at a tax rate of 12.5%. Our effective tax rate for fiscal 2025 was impacted by a net deferred tax expense of $153.8 million related to the remeasurement of our Global Intangible Low-Taxed Income related deferred tax assets and liabilities attributable to the passage of the One Big Beautiful Bill Act.\nSee Note 10, \nIncome Taxes\n, of the Notes to Consolidated Financial Statements contained in Part II, Item 8 of this Annual Report on Form 10-K for further discussion. \nNet Income\n \nFiscal Year\n \n2025\n2024\n$ Change\n% Change\nNet income\n$\n2,267,342 \n$\n1,635,273 \n$\n632,069 \n39 \n%\nNet income, as a % of revenue\n20.6 \n%\n17.3 \n%\nDiluted EPS\n$\n4.56 \n$\n3.28 \n$\n1.28 \n39 \n%\nThe increase in net income in fiscal 2025 as compared to fiscal 2024 was a result of a $899.7 million increase in operating income and a $35.1 million decrease in nonoperating expense, partially offset by a $302.7 million increase in provision for income taxes.\nLiquidity and Capital Resources\nAt November 1, 2025, our principal source of liquidity was $3.7 billion of cash, cash equivalents and short-term investments, of which approximately $2.4 billion was held in the United States, with the balance held outside the United States in various foreign subsidiaries. We manage our worldwide cash requirements by, among other things, reviewing available funds held by our foreign subsidiaries and the cost effectiveness by which those funds can be accessed in the United States. We do not expect current regulatory restrictions or taxes on repatriation to have a material adverse effect on our overall liquidity, financial condition or results of operations. Our cash, cash equivalents and short-term investments consist of highly liquid investments, including money market funds and corporate and bank obligations. We maintain these balances with counterparties with high credit ratings and continually monitor the amount of credit exposure to any one issuer and diversify our investments in order to minimize our credit risk.\nWe believe that our existing sources of liquidity and cash expected to be generated from future operations, together with existing and anticipated available short- and long-term financing, will be sufficient to fund operations, capital expenditures, research and development efforts and dividend payments (if any) in the immediate future and for at least the next twelve months.\n \nFiscal Year\n \n2025\n2024\nNet cash provided by operating activities\n$\n4,812,202 \n$\n3,852,529 \nNet cash provided by operating activities as a % of revenue\n44 \n%\n41 \n%\nNet cash used for investing activities\n$\n(1,321,521)\n$\n(1,104,858)\nNet cash used for financing activities\n$\n(2,982,617)\n$\n(1,714,390)\nThe following changes contributed to the net change in cash and cash equivalents from fiscal 2024 to fiscal 2025. \n34\nOperating Activities\nCash provided by operating activities is net income adjusted for certain non-cash items and changes in assets and liabilities.\n \nThe increase in cash provided by operating activities during fiscal 2025 as compared to fiscal 2024 was primarily a result of higher net income adjusted for noncash items and changes in working capital. \nInvesting Activities\nInvesting cash flows generally consist of purchases of property, plant and equipment, available-for-sale investments and acquisitions of other businesses. The change in cash used for investing activities during fiscal 2025 as compared to fiscal 2024 was primarily the result of the net impact of purchases and maturities of available-for-sale investments, partially offset by a decrease in cash used for capital expenditures.\nFinancing Activities\nFinancing cash flows generally consist of payments of dividends to shareholders, repurchases of common stock, issuance and repayment of debt and proceeds from the sale of shares of common stock pursuant to employee equity incentive plans.\n \nThe increase in cash used for financing activities during fiscal 2025 as compared to fiscal 2024 was primarily the result of increased common stock repurchases and dividend payments to shareholders, partially offset by the net proceeds from our debt obligations.\nWorking Capital\n \nFiscal Year\n \n2025\n2024\n$ Change\n% Change\nAccounts receivable, net\n$\n1,436,075 \n$\n1,336,331 \n$\n99,744 \n7 \n%\nDays sales outstanding \n(1)\n46 \n54 \nInventory\n$\n1,656,323 \n$\n1,447,687 \n$\n208,636 \n14 \n%\nDays cost of sales in inventory\n (1)\n133 \n139 \n_______________________________________\n(1)\nWe use the average of the current year and prior year ending net accounts receivable and ending inventory balance in our calculation of days sales outstanding and days cost of sales in inventory, respectively.\nThe increase in accounts receivable for fiscal 2025 compared to fiscal 2024 was primarily the result of variations in the timing of collections and billings and increased revenue levels in the fourth quarter of fiscal 2025 as compared to the fourth quarter of fiscal 2024.\nInventory increased in fiscal 2025 as compared to fiscal 2024, primarily as a result of our efforts to balance manufacturing production, demand and inventory levels. Our inventory levels are impacted by our need to support forecasted sales demand and variations between those forecasts and actual demand.   \nCurrent liabilities increased to $3.2 billion at November 1, 2025 from $3.0 billion recorded at the end of fiscal 2024, primarily due to increases in accrued liabilities and income taxes payable, partially offset by a decrease in current debt.\nRevolving Credit Facility\n \nOur Fourth Amended and Restated Revolving Credit Agreement, dated as of April 11, 2025, with Bank of America N.A. as administrative agent and the other banks identified therein as lenders (the Revolving Credit Agreement) provides for a five year unsecured revolving credit facility in an aggregate principal amount not to exceed $3.0 billion (subject to certain terms and conditions).  \nWe may borrow under the Revolving Credit Agreement in the future and use the proceeds for repayment of existing indebtedness, stock repurchases, acquisitions, capital expenditures, working capital and other lawful corporate purposes. The terms of the Revolving Credit Agreement impose restrictions on our ability to undertake certain transactions, to create certain liens on assets and to incur certain subsidiary indebtedness. In addition, the Revolving Credit Agreement contains an interest coverage covenant which requires the ratio of consolidated earnings before interest, taxes, depreciation and amortization (EBITDA) to consolidated interest charges to be greater than 3.0 to 1.0. As of November 1, 2025, we were in compliance with these covenants. See Note 11, Revolving Credit Facility, of the Notes to Consolidated Financial Statements contained in Part II, Item 8 of this Annual Report on Form 10-K for further information on our revolving credit facility.\n35\nDebt\nAs of November 1, 2025, we had approximately $8.1 billion of carrying value outstanding on our senior notes. The difference in the carrying value of the debt and the principal is due to the unamortized discount and issuance fees and other adjustments on these instruments. The indentures governing certain of our debt instruments contain covenants that may limit our ability to: incur, create, assume or guarantee any debt or borrowed money secured by a lien upon a principal property; enter into sale and lease-back transactions with respect to a principal property; and consolidate with or merge into, or transfer or lease all or substantially all of our assets to, any other party. As of November 1, 2025, we were compliant with these covenants. See Note 12, \nDebt \nof the Notes to Consolidated Financial Statements contained in Part II, Item 8 of this Annual Report on Form 10-K for further information on our outstanding debt.\nCommercial Paper Program\nUnder our commercial paper program, we may issue short-term, unsecured commercial paper notes in amounts up to a maximum aggregate face amount of $3.0 billion outstanding at any time, with maturities of up to 397 days from the date of issuance. As of November 1, 2025, we had $446.6 million of outstanding borrowings under the commercial paper program recorded in the Consolidated Balance Sheet. We intend to use the net proceeds of the commercial paper program for general corporate purposes, including without limitation, repayment of indebtedness, stock repurchases, acquisitions, capital expenditures and working capital.\nStock Repurchase Program\nAs of November 1, 2025, our Board of Directors had authorized us to repurchase $26.7 billion of our common stock under our common stock repurchase program and $9.7 billion remained available for repurchases under the current authorized program. Repurchased shares are held as authorized but unissued shares of common stock. Unless terminated earlier by resolution of our Board of Directors, the repurchase program will expire when the full dollar amount of the authorization has been used to repurchase shares under the program. Future repurchases of common stock will be dependent upon our financial position, results of operations, outlook, liquidity and other factors we deem relevant.\nCapital Expenditures\nNet additions to property, plant and equipment were $533.6 million in fiscal 2025. We expect capital expenditures for fiscal 2026 to be between approximately 4% and 6% of fiscal 2026 revenue. These capital expenditures will be funded with a combination of cash on hand and cash expected to be generated from future operations, together with existing and anticipated available short- and long-term financing. \nDividends\nOn November 24, 2025, our Board of Directors declared a cash dividend of $0.99 per outstanding share of common stock. The dividend will be paid on December 22, 2025 to all shareholders of record at the close of business on December 8, 2025 and is expected to total approximately $484.8 million. We currently expect quarterly dividends to continue in future periods, although they remain subject to determination and declaration by our Board of Directors. The payment of future dividends, if any, will be based on several factors, including our financial performance, outlook and liquidity.\nContractual Obligations\nThe table below summarizes our material contractual obligations in specified periods as of November 1, 2025: \n \n \nPayment due by period\n \n \nLess than\n \n \nMore than\n(thousands)\nTotal\n1 Year\n1-3 Years\n3-5 Years\n5 Years\nDebt obligations \n(1)\n$\n8,663,716 \n$\n446,639 \n$\n2,940,212 \n$\n650,000 \n$\n4,626,865 \nInterest payments associated with debt obligations\n3,192,312 \n290,787 \n517,777 \n389,089 \n1,994,659 \nInvestment-related commitments \n(2)\n186,892 \n37,378 \n74,757 \n74,757 \n— \nTransition tax \n(3)\n167,856 \n167,856 \n— \n— \n— \nOperating leases (\n4)\n394,961 \n85,606 \n142,960 \n109,501 \n56,894 \nInventory-related purchase commitments (5)\n269,737 \n122,643 \n103,761 \n40,000 \n3,333 \nTotal\n$\n12,875,474 \n$\n1,150,909 \n$\n3,779,467 \n$\n1,263,347 \n$\n6,681,751 \n_______________________________________\n(1)\nDebt obligations are assumed to be held to maturity. \n(2)\nCommitments related to certain investments in venture funds directed to our strategic areas of targeted growth in digital biology, life sciences and sustainability, among others.\n36\n(3)\nTax obligation relates to the one-time tax on deemed repatriated earnings under the Tax Cuts and Jobs Act.\n(4)\nCertain of our operating lease obligations include escalation clauses. These escalating payment requirements are reflected in the table.\n(5)\nWe have supplier commitments for the purchase of materials and supplies in advance or with minimum purchase quantities.  \nAs of November 1, 2025, our total liabilities associated with uncertain tax positions was $199.7 million, which are included in non-current income taxes payable in our Consolidated Balance Sheets contained in Part II, Item 8 of this Annual Report on Form 10-K. Due to the complexity associated with our tax uncertainties, we cannot make a reasonably reliable estimate of the period in which we expect to settle the non-current liabilities associated with these uncertain tax positions. Therefore, we have not included these uncertain tax positions in the above contractual obligations table.\nNew Accounting Pronouncements\nFrom time to time, new accounting pronouncements are issued by the Financial Accounting Standards Board (FASB) and are adopted by us as of the specified effective date. Unless otherwise discussed, management believes that the impact of recently issued standards will not have a material impact on our future financial condition and results of operations. See Note 2s, \nNew Accounting Pronouncements,\n of the Notes to Consolidated Financial Statements contained in Part II, Item 8 of this Annual Report on Form 10-K for a description of recently issued and adopted accounting pronouncements, including the dates of adoption and impact on our financial condition and results of operations.\nCritical Accounting Policies and Estimates\nManagement’s discussion and analysis of the financial condition and results of operations is based upon the Consolidated Financial Statements, which have been prepared in accordance with U.S. GAAP. The preparation of these financial statements requires us to make estimates and judgments that affect the reported amounts of assets, liabilities, revenue and expenses, and related disclosure of contingent assets and liabilities. We base our estimates and judgments on historical experience, knowledge of current conditions and beliefs of what could occur in the future based on available information. We consider the following accounting policies to be both those most important to the portrayal of our financial condition and those that require the most subjective judgment. If actual results differ significantly from management’s estimates and projections, there could be a material effect on our financial statements. We also have other policies that we consider key accounting policies; however, the application of these policies does not require us to make significant estimates or judgments that are difficult or subjective.\nRevenue Recognition\nRecognition of revenue occurs when a customer obtains control of promised goods or services in an amount that reflects the consideration to which the providing entity expects to be entitled in exchange for those goods or services. We recognize revenue upon transfer of control of promised products or services to customers in an amount that reflects the consideration that we expect to receive in exchange for those products or services. We recognize revenue when all of the following criteria are met: (1) we have entered into a binding agreement, (2) the performance obligations have been identified, (3) the transaction price to the customer has been determined, (4) the transaction price has been allocated to the performance obligations in the contract, and (5) the performance obligations have been satisfied. The majority of our shipping terms permit us to recognize revenue at point of shipment or delivery. Certain shipping terms require the goods to be through customs or be received by the customer before title passes. In those instances, we defer the revenue recognized until title and control of the promised goods have passed to the customer. Shipping costs are charged to selling, marketing, general and administrative expense as incurred. Sales taxes are excluded from revenue.\nRevenue from contracts with the United States government, government prime contractors and certain commercial customers is recorded over time using either units delivered or costs incurred as the measurement basis for progress toward completion. These measures are used to measure results directly and is generally the best measure of progress toward completion in circumstances in which a reliable measure of output can be established. Estimated revenue in excess of amounts billed is reported as unbilled receivables. Contract accounting requires judgment in estimating costs and assumptions related to technical issues and delivery schedule. Contract costs include material, subcontract costs, labor and an allocation of indirect costs. The estimation of costs at completion of a contract is subject to numerous variables involving contract costs and estimates as to the length of time to complete the contract. Changes in contract performance, estimated gross margin, including the impact of final contract settlements, and estimated losses are recognized in the period in which the changes or losses are determined.\nPerformance Obligations\n: Substantially all of our contracts with customers contain a single performance obligation, the sale of mixed-signal integrated circuit (IC) products. Such sales represent a single performance obligation because the sale is one type of good or includes multiple goods that are neither capable of being distinct nor separable from the other promises in the contract. This performance obligation is satisfied when control of the product is transferred to the customer, which occurs upon shipment or delivery. Unsatisfied performance obligations primarily represent contracts for products with future delivery dates and with an original expected duration of one year or less. We generally warrant that our products will meet their \n37\npublished specifications, and that we will repair or replace defective products, for one year from the date title passes from us to the customer. Specific accruals are recorded for known product warranty issues. \nTransaction Price\n: The transaction price reflects our expectations about the consideration we will be entitled to receive from the customer and may include fixed or variable amounts. Fixed consideration primarily includes sales to direct customers and sales to distributors in which both the sale to the distributor and the sale to the end customer occur within the same reporting period. Variable consideration includes sales in which the amount of consideration that we will receive is unknown as of the end of a reporting period. The vast majority of such consideration are credits issued to the distributor due to price protection, but also include sales made to distributors under agreements that allow certain rights of return, referred to as stock rotation. Price protection represents price discounts granted to certain distributors to allow the distributor to earn an appropriate margin on sales negotiated with certain customers and in the event of a price decrease subsequent to the date the product was shipped and billed to the distributor. Stock rotation allows distributors limited levels of returns in order to reduce the amounts of slow-moving, discontinued or obsolete product from their inventory. A liability for distributor credits covering variable consideration is made based on management’s estimate of historical experience rates as well as considering economic conditions and contractual terms. To date, actual distributor claims activity has been materially consistent with the provisions we have made based on our historical estimates.\nContract Balances\n: Accounts receivable represents our unconditional right to receive consideration from our customers. Payments are typically due within 30 to 45 days of invoicing and do not include a significant financing component. To date, there have been no material impairment losses on accounts receivable. There were no material contract assets or contract liabilities recorded on the Consolidated Balance Sheets in any of the periods presented.\nInventory Valuation\nWe value inventories at the lower of cost (first-in, first-out method) or net realizable value. Because of the cyclical nature of the semiconductor industry, changes in inventory levels, obsolescence of technology, and product life cycles, we write down inventories to net realizable value. We employ a variety of methodologies to determine the net realizable value of inventory. While a portion of the calculation is determined via reference to the age of inventory and lower of cost or net realizable value calculations, an element of the calculation is subject to significant judgments made by us about future demand for our inventory. If actual demand for our products is less than our estimates, additional adjustments to existing inventories may need to be recorded in future periods. To date, our actual results have not been materially different than our estimates.\nGoodwill\nWe evaluate goodwill for impairment annually, as well as whenever events or changes in circumstances suggest that the carrying value of goodwill may not be recoverable, utilizing either the qualitative or quantitative method. We have determined that the business operates as a single operating segment and has a single reporting unit for the purpose of goodwill impairment testing. We test goodwill on an annual basis on the first day of the fourth quarter (August 3, 2025 in fiscal 2025) or more frequently if indicators of impairment exist or we reorganize our business. \nWe have the option to first assess qualitative factors to determine whether it is more likely than not that the fair value of a reporting unit is less than its net book value. When using the qualitative method, we consider several factors, including the following:\n–\nthe amount by which the fair value of our reporting unit exceeded its carrying value as of the date of the most recent quantitative impairment analysis, which indicated there would need to be substantial negative developments in the markets in which our reporting unit operates in order for there to be potential impairment;\n–\nthe carrying value of our reporting unit as of the assessment date compared to the previously calculated fair value as of the date of the most recent quantitative impairment analysis;\n–\nthe current forecasts as compared to the forecasts included in the most recent quantitative impairment analysis;\n–\npublic information from competitors and other industry information to determine if there were any significant adverse trends in our competitors’ businesses;\n–\nchanges in the value of major U.S. stock indices that could suggest declines in overall market stability that could impact the valuation of our reporting unit;\n–\nchanges in our market capitalization and overall enterprise valuation to determine if there were any significant decreases that could be an indication that the valuation of our reporting unit had significantly decreased; and\n–\nwhether there had been any significant increases to the weighted-average cost of capital rates used, which could materially lower our prior valuation conclusions under a discounted cash flow approach.\nIf we elect not to use this option, or we determine that it is more likely than not that the fair value of our reporting unit is less than its net book value, then we perform the quantitative goodwill impairment test. The quantitative goodwill impairment test requires us to compare the fair value of our reporting unit with its carrying amount. If fair value is determined to be less \n38\nthan carrying value, an impairment loss is recognized for the amount of the carrying value that exceeds the amount of the reporting unit’s fair value, not to exceed the total amount of goodwill allocated to the reporting unit. Additionally, we consider income tax effects from any tax deductible goodwill on the carrying amount of our reporting unit when measuring the goodwill impairment loss, if applicable. We determine the fair value of our reporting unit using a weighting of the income and market approaches. Under the income approach, we use a discounted cash flow methodology which requires management to make significant estimates and assumptions related to forecasted revenues, gross profit margins, operating income margins, working capital cash flow, perpetual growth rates, and long-term discount rates, among others. For the market approach, we use the guideline public company method. Under this method we utilize information from comparable publicly traded companies with similar operating and investment characteristics as the reporting unit, to create valuation multiples that are applied to the operating performance of the reporting unit being tested, in order to obtain the respective fair value. In order to assess the reasonableness of the calculated reporting unit fair value, we reconcile the fair value of our reporting unit determined, as described above, to our total company market capitalization, allowing for a reasonable control premium. \nDuring fiscal 2025, we used a combination of the quantitative and qualitative methods of assessing goodwill. During fiscal 2024, we used the qualitative method of assessing goodwill. In all periods presented, we concluded the reporting unit fair values exceeded their carrying amounts as of the assessment dates and no risk of impairment existed.\nAccounting for Income Taxes\nWe make certain estimates and judgments in determining income tax expense for financial statement purposes. These estimates and judgments occur in the calculation of income tax credits, benefits, and deductions, and in the calculation of certain tax assets and liabilities, which arise from differences in the timing of the recognition of certain expenses for tax and financial statement purposes. We assess the likelihood of the realization of deferred tax assets and record a corresponding valuation allowance as necessary if we determine those deferred tax assets may not be realized due to the uncertainty of the timing and amount to be realized of certain state and international tax credit carryovers. In reaching our conclusion, we evaluate certain relevant criteria including the existence of deferred tax liabilities that can be used to realize deferred tax assets, the taxable income in prior carryback years in the impacted state and international jurisdictions that can be used to absorb net operating losses and taxable income in future years. Our judgments regarding future profitability may change due to future market conditions, changes in U.S. or international tax laws and other factors. These changes, if any, may require material adjustments to these deferred tax assets, which may result in an increase or decrease to our income tax provision in future periods.\nWe account for uncertain tax positions by first determining if it is “more likely than not” that a tax position will be sustained by the appropriate taxing authorities prior to recording any benefit in the financial statements. An uncertain income tax position is not recognized if it has less than a 50% likelihood of being sustained. For those tax positions where it is more likely than not that a tax position will be sustained, we have recorded the largest amount of tax benefit with a greater than 50% likelihood of being realized upon ultimate settlement with a taxing authority that has full knowledge of all relevant information. For those income tax positions where it is not more likely than not that a tax benefit will be sustained, no tax benefit has been recognized in the financial statements. We classify interest and penalties related to uncertain tax positions within the provision for income taxes line of the Consolidated Statements of Income. We reevaluate these uncertain tax positions on a quarterly basis. This evaluation is based on factors including, but not limited to, changes in known facts or circumstances, changes in tax law, effectively settled issues under audit, and new guidance on legislative interpretations. A change in these factors could result in the recognition of an increase or decrease to our income tax provision, which could materially impact our consolidated financial position and results of operations.\nIn the ordinary course of global business, there are many transactions and calculations where the ultimate tax outcome is uncertain. Some of these uncertainties arise as a consequence of cost reimbursement and royalty arrangements among related entities. Although we believe our estimates are reasonable, no assurance can be given that the final tax outcome of these matters will not be different than that which is reflected in our historical income tax provisions and income tax liabilities. In the event our assumptions are incorrect, the differences could have a material impact on our income tax provision and operating results in the period in which such determination is made. In addition to the factors described above, our current and expected effective tax rate is based on then-current tax law. Significant changes during the year in enacted tax law could affect these estimates.\nSee Note 10, \nIncome Taxes\n, of the Notes to Consolidated Financial Statements contained in Part II, Item 8 of this Annual Report on Form 10-K for further discussion.\n39",
  "item2": null
}