{
  "source_file": "adm-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "ITEM 2.    MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThis Management’s Discussion and Analysis of Financial Condition and Results of Operations (MD&A) should be read in conjunction with the accompanying unaudited Consolidated Financial Statements, which can be found in Part I. Item 1. Consolidated Financial Statements. \nCompany Overview\nArcher-Daniels-Midland Company and its subsidiaries (the \"Company\" or \"ADM\") unlock the power of nature to enrich the quality of life. The Company is an essential global agricultural supply chain manager and processor, providing food security by connecting local needs with global capabilities. ADM is a premier human and animal nutrition provider, offering one of the industry’s broadest portfolios of ingredients and solutions from nature. The Company is a trailblazer in health and well-being, with an industry-leading range of products for consumers looking for new ways to live healthier lives. ADM is a cutting-edge innovator, guiding the way to a future of new bio-based consumer and industrial solutions. ADM is a leader in business-driven sustainability efforts that support a strong agricultural sector, resilient supply chains, and a vast and growing bioeconomy. Around the globe, the Company’s expertise and innovation are meeting critical needs from harvest to home.\nReportable Segments\nThe Company’s operations are organized, managed, and classified into three reportable segments: Ag Services and Oilseeds, Carbohydrate Solutions, and Nutrition. The Company’s remaining operations are not reportable segments, as defined by the applicable accounting standard\n,\n and are classified within either Corporate or Other Business.\nSee Part I. Item 1. Note 13. Segment Information of “Notes to Consolidated Financial Statements” for further details on the nature of our business and our reportable operating segments. \n2025 Strategy\nThe Company’s goal is to continue to build and sustain long-term value for its shareholders and customers. The Company established the following priorities to help achieve its goal: \n•\nFocus on execution and cost management – ADM seeks to prioritize operational excellence and driving targeted cost reductions through: (1) boosting plant efficiencies and restoring operations at the Decatur East plant; (2) optimizing operating leverage within the Nutrition segment; and (3) reducing third party spend and selling, general, and administrative expenses.\n•\nStrategic simplification – ADM seeks to enhance returns on invested capital by executing a pipeline of simplification opportunities to optimize our portfolio and organizational structure, including: (1) addressing performance, demand, and capacity challenges; (2) reducing capital expenditures that do not meet the Company’s return objectives; and (3) reducing capability overlaps through synergies, closures, and divestitures. \n•\nTargeted growth investment – ADM seeks to prioritize organic investment in key strategic initiatives, while also ensuring our businesses are ready for the future, including: (1) plant modernization investments; (2) cost optimization investments; and (3) enterprise system and process enhancements. \n•\nDeploy capital with discipline – ADM seeks to prudently invest in opportunities. The Company also expects to continue returning cash to shareholders through dividends and share repurchases as appropriate.\nADM has refined its digital strategy and is pivoting away from large global implementations and directing resources to prioritize regional, more agile projects. The Company is accelerating its data journey while continuing to invest the appropriate amount in cybersecurity and network and application resilience. As a result of this strategy adaptation, during the three months ended September 30, 2025, the Company recognized an impairment charge of $173 million related to previously capitalized internal-use software. See Part I. Item 1. Note 14. Asset Impairment, Exit, and Restructuring Costs for further information. \n    39\nTable of Contents\nARCHER-DANIELS-MIDLAND COMPANY\nMANAGEMENT’S DISCUSSION AND ANALYSIS\nOF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nSustainability \nFor more than 120 years, ADM has built its business on the strength of agriculture, innovation, and responsible stewardship. Today, sustainability is a core driver of ADM’s growth strategy, powering innovation, improving resilience, and unlocking new value across the global food system. The crops that ADM turns into an expansive array of products depend on healthy soil, water and air, and as the Company looks to the future, it is advancing efforts that enable and support agriculture and farmers, drive innovation and long-term value, and protect and strengthen vital supply chains.\nADM is reimagining agriculture by scaling regenerative practices in partnership with farmers, supporting them with tools, insights, and financial incentives to help their operations thrive. ADM is innovating to meet growing demand for sustainably sourced, bio-based products, creating new market opportunities for farmers whose crops deliver health, transparency, and environmental benefits. The Company is modernizing its own operations to improve efficiency, enhance competitiveness, reduce emissions, and build a more resilient supply chain that starts on the farm.\nSignificant Portfolio Actions and Targeted Actions to Deliver Cost Savings\nOn February 4, 2025, the Company announced targeted actions expected to deliver in excess of $500 million of cost savings by fiscal 2029. These include cost optimization and portfolio simplification initiatives designed to help the Company achieve cost efficiencies. See Note 14. Asset Impairment, Exit, and Restructuring Costs of “Notes to Consolidated Financial Statements” included in Item 1. Consolidated Financial Statements for additional information regarding restructuring related charges. \nADM’s recent significant portfolio actions and announcements included:\n•\nThe acquisition in January 2025 of Vandamme Hugaria Kft, a 700 metric ton/day non-genetically modified crush and extraction facility based in Hungary. See Note 4. Acquisitions of “Notes to Consolidated Financial Statements” included in Item 1. Consolidated Financial Statements for further information. \n•\nThe closure of the Tres Corações facility based in Brazil, in July 2025. Preparation for the closure resulted in exit and restructuring costs, including impairment of certain assets. \n•\nThe launch in September 2025 of a joint venture with PYCO Industries, Inc., a leader in the local agricultural communities it serves, combining its and ADM’s Lubbock, Texas, cottonseed processing capabilities.\n•\nThe execution of a definitive agreement in September 2025 with Alltech Inc., a global leader in agriculture, to launch a North American animal feed joint venture to offer an industry-leading range of products and solutions for livestock, equine, backyard and leisure animals.\nGovernment Investigation \nAs previously disclosed, the Company is under investigation by the United States Securities and Exchange Commission (“SEC”) and the Department of Justice (“DOJ”) relating to, among other things, intersegment sales between the Company’s Nutrition reporting segment and the Company’s Ag Services and Oilseeds and Carbohydrate Solutions reporting segments. The Company is continuing to cooperate with the SEC and DOJ investigations and is unable to predict the outcome of these investigations. \nMaterial Weakness \nAs previously disclosed, the Company had identified a material weakness in the Company’s internal control over financial reporting related to its accounting practices and procedures for segment disclosures which has been remediated. For more information, see “Controls and Procedures” in Part I. Item 4 herein.\n    40\nTable of Contents\nARCHER-DANIELS-MIDLAND COMPANY\nMANAGEMENT’S DISCUSSION AND ANALYSIS\nOF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nOperating Performance Indicators \nThe Company’s Ag Services and Oilseeds and Carbohydrate Solutions segments are principally agricultural commodity-based businesses where changes in selling prices move in relationship to changes in prices of the commodity-based agricultural raw materials. As a result, changes in agricultural commodity prices have relatively equal impacts on both Revenues and Cost of products sold. Therefore, margins per volume or metric ton generally are meaningful as performance indicators in these businesses.\nThe Nutrition segment also utilizes agricultural commodities (or products derived from agricultural commodities) as raw materials. However, in these operations, agricultural commodity market price changes do not necessarily correlate to changes in Cost of products sold. Therefore, changes in revenues of these businesses may correspond to changes in margins and margins rates generally are meaningful as a performance indicator in these businesses.\nThe Company has consolidated subsidiaries in approximately 78 countries. For the majority of the Company’s subsidiaries located outside the United States, the local currency is the functional currency except for certain significant subsidiaries in Switzerland where Euro is the functional currency, and Brazil and Argentina where U.S. dollar is the functional currency. Revenues and expenses denominated in foreign currencies are translated into U.S. dollars at the weighted average exchange rates for the applicable periods. For the majority of the Company’s business activities in Brazil and Argentina, the functional currency is the U.S. dollar; however, certain transactions, including taxes, occur in local currency and require remeasurement to the functional currency. Changes in revenues are expected to be correlated to changes in expenses reported by the Company caused by fluctuations in the exchange rates of foreign currencies, primarily the Euro, British pound, Canadian dollar, and Brazilian real, as compared to the U.S. dollar. \nThe Company measures its performance using key financial metrics including net earnings, adjusted diluted earnings per share (EPS), margins, segment operating profit, total segment operating profit, earnings before interest and taxes (EBIT), earnings before interest, taxes, depreciation, and amortization (EBITDA), and adjusted EBITDA. Some of these metrics are not defined by generally accepted accounting principles in the United States (GAAP) and should be considered in addition to, and not in lieu of, GAAP financial measures. For further information, see the “\nNon-GAAP Financial Measures\n” section below. \nThe Company’s financial results can vary significantly due to changes in factors such as fluctuations in energy prices, weather conditions, crop plantings, government programs and policies, trade policies, changes in global demand, general global economic conditions, changes in standards of living, global production of similar and competitive crops, and geopolitical developments. Due to the unpredictable nature of these and other factors, the Company undertakes no responsibility for updating any forward-looking information contained within this Item 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations.\nMarket Factors Influencing Operations, Results, and Comparability in the Three and Nine Months Ended September 30, 2025\nThe Company is subject to a variety of market factors which affect the Company's operating results.\nIn the Ag Services and Oilseeds segment, increased global supplies of grains and oilseeds, higher projected ending stocks-to-use ratios, the deferral of U.S. biofuel policy, the evolving global trade landscape, and competitive meal exports from Argentina resulted in compressed margins. Ag Services volumes in North America were positively impacted by solid executions, including larger than expected corn exports on stronger European demand, despite headwinds of uncertainty and low water concerns. In Crushing and Refined Products and Other (RPO), increased industry seasonal downtime tightened stocks and supported meal values, and the deferral of U.S. biofuel and trade policy evolution negatively impacted biodiesel and refining margins. \nIn the Carbohydrate Solutions segment, solid domestic and export demand for ethanol along with lower industry production, helped improve the imbalance between production and domestic demand. For Starches and Sweeteners, North America saw demand softness in the sweeteners, paper, and corrugated markets. Europe, the Middle East, and Africa (EMEA) saw higher corn costs and increased competition. \n    41\nTable of Contents\nARCHER-DANIELS-MIDLAND COMPANY\nMANAGEMENT’S DISCUSSION AND ANALYSIS\nOF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nIn the Nutrition segment, Human Nutrition continued to see growth trends in Flavors market as high value categories such as energy drinks and ready to drink beverages continue to perform strongly. Similarly, the Dietary Supplements market continues to grow in line with historical rates and shows expansion opportunities as customer acceptance of postbiotics (heat-stable version of probiotics) allows sales in a larger variety of segments (food and beverage). While tariffs and inflation continue to pose challenges to the Human Nutrition market, clean label and healthier categories are outpacing the broader industry. In Animal Nutrition, declining commodity prices continue to support feed ration commodities as well as additive markets. \nThree Months Ended September 30, 2025 Compared to Three Months Ended September 30, 2024 \nResults of Operations \nEarnings before income taxes was $147 million compared to $108 million in the prior year quarter. Results in the current year quarter were primarily driven by a decrease in impairment charges compared to the prior year quarter, partially offset by lower execution margins. The current year quarter included an impairment charge of $173 million, related to previously capitalized internal-use software, and $163 million of Wilmar International Limited (“Wilmar”) related penalty charges, compared to a $461 million impairment of the Company’s investment in Wilmar in the prior year quarter. \nTotal segment operating profit (a non-GAAP measure) decreased $192 million from $1.0 billion to $845 million driven by lower results in the Ag Services and Oilseeds segment and the Carbohydrate Solutions segment. Total segment operating profit (a non-GAAP measure) in the three months ended September 30, 2025 excluded specified items of $220 million that were primarily comprised of portfolio optimization and impairment charges, as well as the non-recurring penalty charge related to Wilmar. Total segment operating profit (a non-GAAP measure) in the three months ended September 30, 2024 excluded asset impairment charges of $504 million.\nTotal segment operating profit (a non-GAAP measure) is reconciled to earnings before income taxes, the most directly comparable GAAP measure, in the \"\nNon-GAAP Financial Measures\n\" section below.\nProcessed volumes by certain products for the three months ended September 30, 2025 and 2024 were as follows (in thousand metric tons).\nThree Months Ended\nSeptember 30,\n2025\n2024\nChange\nOilseeds\n8,803\n \n8,410 \n393 \nCorn\n4,666\n \n4,943 \n(277)\nThe Company generally operates its production facilities, on an overall basis, at or near capacity, adjusting facilities individually, as needed, to react to the current margin environment and seasonal local supply and demand conditions. The increase in processed oilseeds volumes in the current year quarter was primarily related to improved North America crush volumes due to improved utilization after the restoration of operations at the Company’s Decatur, Illinois facility, in addition to higher volumes in South America due to increased plant reliability. The decrease in processed corn volumes was primarily related to lower utilization in the current year quarter due to increased unplanned plant downtime when compared to the prior year quarter.\n    42\nTable of Contents\nARCHER-DANIELS-MIDLAND COMPANY\nMANAGEMENT’S DISCUSSION AND ANALYSIS\nOF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nRevenues for the three months ended September 30, 2025 and 2024, were as follows (in millions):\nThree Months Ended\nSeptember 30,\n \n2025\n2024\nChange\nAg Services and Oilseeds\nAg Services \n$\n10,276\n \n$\n9,653 \n$\n623 \nCrushing\n2,580\n \n2,869 \n(289)\nRefined Products and Other\n2,757\n \n2,567 \n190 \nTotal Ag Services and Oilseeds\n15,613\n \n15,089 \n524 \nCarbohydrate Solutions\n \n \n \nStarches and Sweeteners\n2,005\n \n2,192 \n(187)\nVantage Corn Processors\n729\n \n716 \n13 \nTotal Carbohydrate Solutions\n2,734\n \n2,908 \n(174)\nNutrition\nHuman Nutrition\n1,067\n \n1,004 \n63 \nAnimal Nutrition\n849\n \n827 \n22 \nTotal Nutrition\n1,916\n \n1,831 \n85 \nTotal Segment Revenues\n20,263\n \n19,828 \n435 \nOther Business\n109\n \n109 \n— \nTotal Revenues\n$\n20,372\n \n$\n19,937 \n$\n435 \nRevenues and cost of products sold in agricultural merchandising and processing businesses are significantly correlated to the underlying commodity prices and volumes. In periods of significant changes in market prices, the underlying performance of the Company is better evaluated by looking at margins since both revenues and cost of products sold, particularly in the Ag Services and Oilseeds segment, generally have a relatively equal impact from market price changes which generally result in an insignificant impact to gross profit. \nRevenues increased $435 million to $20.4 billion, driven by higher sales prices ($285 million) and higher sales volumes ($150 million). Higher sales prices of corn and oils were partially offset by lower sales prices of meal and soybeans. Higher sales volumes of soybeans were partially offset by lower sales volumes of corn, farming materials, sorghum and milo. Ag Services and Oilseeds revenues increased 3% to $15.6 billion, driven by higher sales prices ($320 million) and higher sales volumes ($203 million). Carbohydrate Solutions revenues decreased 6% to $2.7 billion, driven by lower sales prices ($111 million) and lower sales volumes ($62 million). Nutrition revenues increased 5% to $1.9 billion, driven by higher sales prices ($42 million) and foreign exchange gains ($34 million). Foreign exchange gains accounted for approximately $23 million of the increase in Human Nutrition revenue, and approximately $11 million of the increase in Animal Nutrition revenue.\nCost of products sold increased $530 million to $19.1 billion primarily driven by higher average commodity costs. Manufacturing expenses increased $23 million to $1.9 billion, driven by higher employee compensation costs and an increase in energy costs due to higher EMEA natural gas pricing, partially offset by lower maintenance expenses.\nGross profit decreased $95 million, or 7%, to $1.3 billion primarily driven by a decrease in margins of $85 million for Ag Services and Oilseeds and $51 million for Carbohydrate Solutions, partially offset by an increase in margins of $46 million in Nutrition.\n    43\nTable of Contents\nARCHER-DANIELS-MIDLAND COMPANY\nMANAGEMENT’S DISCUSSION AND ANALYSIS\nOF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nSelling, general, and administrative (SG&A) expenses decreased $32 million to $873 million, primarily driven by lower third party service costs, partially offset by higher employee compensation costs.\nAsset impairment, exit, and restructuring costs decreased $261 million to $246 million. Charges in the current year quarter primarily consisted of an impairment charge of $173 million related to previously capitalized internal-use software within Corporate and $67 million of restructuring charges within the Nutrition segment. Charges in the prior year quarter included a $461 million impairment charge related to the Company’s investment in Wilmar, within the Ag Services and Oilseeds segment, and a $43 million impairment charge related to certain discontinued Animal Nutrition trademarks, within the Nutrition segment.\nEquity in loss (earnings) of unconsolidated affiliates decreased $175 million to a loss of $41 million driven by lower earnings from the Company’s investments in Wilmar, due to the $163 million penalty charge, and in Almidones Mexicanos S.A. de C.V., Terminal de Grãos Ponta da Montanha S.A., and Stratas Foods, partially offset by higher earnings from the Company’s investment in Olenex.\nInterest and investment income decreased $16 million to $121 million, primarily driven by lower interest income at ADM Investor Services due to lower interest rates.\nInterest expense decreased $21 million to $153 million, driven by lower financing costs and lower interest rates.\nOther income — net increased $11 million to $69 million, driven by gains on sales of certain assets, partially offset by lower foreign exchange gains.\nIncome tax expense decreased $53 million to $37 million. The Company’s effective tax rate for the quarter ended September 30, 2025 was 25.2% compared to 83.3% for the quarter ended September 30, 2024. The decrease in the effective tax rate for the three months ended September 30, 2025 compared to the prior year quarter is related to the recognition of the impairment of the Company’s investment in Wilmar in the prior year quarter and other discrete tax items specific to each period. \n    44\nTable of Contents\nARCHER-DANIELS-MIDLAND COMPANY\nMANAGEMENT’S DISCUSSION AND ANALYSIS\nOF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nSegment operating profit for the three months ended September 30, 2025 and 2024 was as follows (in millions):\nThree Months Ended\nSeptember 30,\n2025\n2024\nChange\nSegment Operating Profit\nAg Services and Oilseeds\nAg Services \n$\n190\n \n$\n107 \n$\n83 \nCrushing\n13\n \n187 \n(174)\nRefined Products and Other\n120\n \n124 \n(4)\nWilmar\n56\n \n62 \n(6)\nTotal Ag Services and Oilseeds\n$\n379\n \n$\n480 \n$\n(101)\nCarbohydrate Solutions\n \n \n \nStarches and Sweeteners\n$\n293\n \n$\n455 \n$\n(162)\nVantage Corn Processors\n43\n \n(3)\n46 \nTotal Carbohydrate Solutions\n$\n336\n \n$\n452 \n$\n(116)\nNutrition\nHuman Nutrition\n$\n96\n \n$\n86 \n$\n10 \nAnimal Nutrition\n34\n \n19 \n15 \nTotal Nutrition\n$\n130\n \n$\n105 \n$\n25 \nIn the Ag Services and Oilseeds segment, segment operating profit decreased 21%. The Ag Services subsegment had higher operating profit compared to the prior year quarter, primarily driven by improved North America and South America Origination results. North American Origination results improved in the current year quarter due to strong corn exports. South American Origination results improved primarily due to lower costs related to logistics take-or-pay contracts, partially offset by the temporary disruption at a key port facility in Brazil. Global Trade results improved driven by higher ocean freight margins. The Ag Services subsegment had approximately $4 million of net positive mark-to-market timing impacts during the quarter, compared to approximately $50 million of net negative impacts in the prior year quarter. The Crushing subsegment had lower operating profit compared to prior year quarter, driven by lower soybean and canola crush margins in North America and EMEA and higher manufacturing costs. The prior year quarter benefitted from the receipt of $24 million of insurance proceeds for the partial settlement of the Decatur East and West insurance claims. The Crushing subsegment had approximately $41 million of net positive mark-to-market timing impacts during the quarter, compared to approximately zero of net impacts in the prior year quarter. The Refined Products and Other (RPO) subsegment operating profit decreased (3)% when compared to the prior year quarter, as U.S. biofuel and trade policy evolution negatively impacted biodiesel and refining margins in North America. RPO had approximately $8 million of net negative mark-to-market timing impacts during the quarter, compared to approximately $20 million of net negative impacts in the prior year quarter. Wilmar earnings decreased by $6 million to $56 million in the current year quarter.\nIn the Carbohydrate Solutions segment, segment operating profit decreased 26% compared to the prior year quarter. The Starches and Sweeteners subsegment operating profit was lower compared to the prior year quarter. In North America, results were driven by lower liquid sweetener and starch volumes and margins and lower wet mill ethanol margins. North American prior year quarter results benefitted from the receipt of $47 million of insurance proceeds for the partial settlement of the Decatur West insurance claims. In EMEA, lower Starches and Sweeteners volumes and margins were driven by persistent high corn costs due to crop quality issues. Global Wheat Milling margins and volumes were fairly stable relative to the prior year quarter. The Vantage Corn Processors subsegment operating profit was higher than the prior year quarter as improved ethanol volumes and margins were partially offset by certain mark-to-market positions.\n    45\nTable of Contents\nARCHER-DANIELS-MIDLAND COMPANY\nMANAGEMENT’S DISCUSSION AND ANALYSIS\nOF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nIn the Nutrition segment, segment operating profit increased 24%. Human Nutrition subsegment operating profit was 12% higher compared to prior year quarter, mainly due to Flavors, which continued to see strong sales growth among multiple product categories. Health and Wellness results were also higher due to revenue and margin growth, led by the Biotics business, partially offset by reduced tolling margins due to a contract cancellation. Specialty Ingredients results were lower, with higher raw material and insurance costs due to the restoration of operations at the Company’s Decatur, Illinois facility. The prior year quarter also benefited from approximately $25 million of insurance proceed gains as compared to $9 million in the current year quarter. Animal Nutrition subsegment operating profit was 79% higher compared to the prior year quarter due to higher margin product mix, cost optimization, and progress with on-going portfolio streamlining initiatives.\nOther Business and Corporate Results\nOther Business contribution of operating profit increased from a loss of $17 million to a profit of $55 million, driven by improved Captive Insurance results driven by lower claim settlements. \nCorporate results for the three months ended September 30, 2025 and 2024 were as follows (in millions):\nThree Months Ended\nSeptember 30,\n \n2025\n2024\nChange\nInterest expense - net \n(1)\n(98)\n(113)\n15 \nUnallocated corporate function costs \n(2)\n(265)\n(306)\n41 \nRevaluation losses, including impairment, and restructuring charges \n(3)\n(174)\n— \n(174)\nOther income - net\n5\n \n10 \n(5)\nTotal Corporate\n$\n(532)\n$\n(409)\n$\n(123)\n(1)\nInterest expense - net decreased, primarily driven by lower balances of outstanding commercial paper and lower interest rates. \n(2)\nUnallocated corporate function costs decreased, primarily driven by lower financing costs and select corporate function costs, partially offset by higher incentive compensation.\n(3)\nRevaluation losses, including impairment, and restructuring charges includes an impairment charge related to previously capitalized internal-use software.\nNon-GAAP Financial Measures\nThe Company uses certain “non-GAAP” financial measures as defined by the SEC. These are measures of performance not defined by accounting principles generally accepted in the United States, and should be considered in addition to, not in lieu of, GAAP reported measures. Reconciliations of these non-GAAP financial measures to the most directly comparable GAAP financial measures are included in this section.\nThe Company uses adjusted net earnings, adjusted diluted EPS, EBITDA, adjusted EBITDA, and total segment operating profit, non-GAAP financial measures as defined by the SEC, to evaluate the Company’s financial performance. \nAdjusted net earnings is defined as net earnings adjusted for the effects on net earnings of specified items as more fully described in the reconciliation tables. Adjusted diluted EPS is defined as diluted EPS adjusted for the effects on reported diluted EPS of specified items as more fully described in the reconciliation tables. \nEBITDA is defined as earnings before interest on borrowings, taxes, and depreciation and amortization. Adjusted EBITDA is defined as earnings before interest on borrowings, taxes, depreciation, and amortization, adjusted to exclude the impact of specified items as more fully described in the reconciliation tables. \nTotal segment operating profit is defined as ADM’s consolidated earnings before income taxes, adjusted for Other Business, Corporate, and specified items as more fully described in the reconciliation tables. \n    46\nTable of Contents\nARCHER-DANIELS-MIDLAND COMPANY\nMANAGEMENT’S DISCUSSION AND ANALYSIS\nOF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nManagement believes that adjusted net earnings, adjusted diluted EPS, EBITDA, adjusted EBITDA, and total segment operating profit are useful measures of the Company’s performance because they provide investors additional information about the Company’s operations allowing better evaluation of underlying business performance and better period-to-period comparability. Adjusted net earnings, adjusted diluted EPS, EBITDA, adjusted EBITDA, and total segment operating profit are not intended to replace or be an alternative to net earnings, diluted EPS, and earnings before income taxes, the most directly comparable amounts reported under GAAP. \nThe table below provides a reconciliation of net earnings (the most directly comparable GAAP measure) to adjusted net earnings (a non-GAAP measure) and diluted EPS (the most directly comparable GAAP measure) to adjusted diluted EPS (a non-GAAP measure) for the three months ended September 30, 2025 and 2024.\nThree Months Ended September 30,\n2025\n2024\nIn millions\nPer share\nIn millions\nPer share\nAverage number of shares outstanding - diluted\n484\n \n483 \nNet earnings and reported EPS (diluted)\n$\n108\n \n$\n0.22\n \n$\n18 \n$\n0.04 \nAdjustments:\n (1)\n(Gain) on sale of assets and businesses (net of tax of $7 million in 2025)\n(24)\n(0.05)\n(1)\n— \nImpairment, exit, restructuring charges, and settlement contingencies (net of tax of $60 million in 2025 and $4 million in 2024)\n201\n \n0.41\n \n500 \n1.03 \nADM's share of equity method investment penalty charge\n163\n \n0.34\n \n— \n— \nCertain discrete tax adjustments\n—\n \n—\n \n13 \n0.02 \nTotal adjustments\n340\n \n0.70\n \n512 \n1.05 \nAdjusted net earnings and adjusted diluted EPS\n$\n448\n \n$\n0.92\n \n$\n530 \n$\n1.09 \n(1)\n Tax effected using the U.S. and other applicable tax rates.\n    47\nTable of Contents\nARCHER-DANIELS-MIDLAND COMPANY\nMANAGEMENT’S DISCUSSION AND ANALYSIS\nOF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe table below provides a reconciliation of net earnings (the most directly comparable GAAP measure) to EBITDA (a non-GAAP measure) and adjusted EBITDA (a non-GAAP measure) for the three months ended September 30, 2025 and 2024 (in millions).\nThree Months Ended\nSeptember 30,\n2025\n2024\nNet Earnings Attributable to Archer-Daniels-Midland Company\n$\n108\n \n$\n18 \nNet earnings attributable to non-controlling interests\n2\n \n— \nIncome tax expense\n37\n \n90 \nEarnings Before Income Taxes\n147\n \n108 \nInterest expense \n(1)\n106\n \n124 \nDepreciation and amortization \n(2)\n295\n \n288 \nEBITDA\n548\n \n520 \n(Gain) on sales of assets and businesses\n(31)\n(1)\nImpairment, exit, restructuring charges and settlement contingencies\n261\n \n504 \nADM's share of equity method investment penalty charge\n163\n \n— \nRailroad maintenance expenses\n12\n \n28 \nAdjusted EBITDA\n$\n954\n \n$\n1,051 \n(1)\n Represents interest expense on borrowings and therefore excludes ADM Investor Services related interest expense.\n(2)\n Excludes $3 million of accelerated depreciation recorded within restructuring charges as a specified item for the three months ended September 30, 2025. \nThe table below provides a reconciliation of earnings before income taxes (the most directly comparable GAAP measure) to total segment operating profit (a non-GAAP measure) for the three months ended September 30, 2025 and 2024 (in millions). \nThree Months Ended\nSeptember 30,\n2025\n2024\nEarnings Before Income Taxes\n$\n147\n \n$\n108 \nOther Business (earnings) loss\n(55)\n17 \nCorporate\n532\n \n409 \nSpecified Items:\n(Gain) on sale of assets and businesses\n(31)\n(1)\nImpairment, exit, restructuring charges and settlement contingencies\n89\n \n504 \nADM's share of equity method investment penalty charge\n163\n \n— \nTotal Segment Operating Profit\n$\n845\n \n$\n1,037 \n    48\nTable of Contents\nARCHER-DANIELS-MIDLAND COMPANY\nMANAGEMENT’S DISCUSSION AND ANALYSIS\nOF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nNine Months Ended September 30, 2025 Compared to Nine Months Ended September 30, 2024 \nResults of Operations\nEarnings before income taxes decreased $809 million from $1.6 billion to $779 million. Results in the current year period were primarily driven by lower pricing and execution margins. In the current year period, the Company recorded asset impairment, exit, and restructuring costs of $237 million, $187 million of impairments pursuant the Company’s updated investment strategy for startup or development stage companies, $173 million related to impairment of previously capitalized internal-use software, and $163 million of Wilmar related penalty charges. In the prior year period, the Company recorded a $461 million impairment of its investment in Wilmar and $43 million of asset impairment charges in Nutrition.\nTotal segment operating profit (a non-GAAP measure) decreased $736 million from $3.2 billion to $2.4 billion, primarily driven by lower results in the Ag Services and Oilseeds segment and the Carbohydrate Solutions segment. Total segment operating profit (a non-GAAP measure) in the nine months ended September 30, 2025 excluded specified items of $416 million that were primarily comprised of portfolio optimization and impairment charges, as well as the penalty charge related to Wilmar. Total segment operating profit (a non-GAAP measure) in the nine months ended September 30, 2024 excluded asset impairment charges of $517 million. \nTotal segment operating profit (a non-GAAP measure) is reconciled to earnings before income taxes, the most directly comparable GAAP measure, in the \"\nNon-GAAP Financial Measures\n\" section below.\nProcessed volumes by product for the nine months ended September 30, 2025 and 2024 were as follows (in thousand metric tons).\nNine Months Ended\nSeptember 30,\n2025\n2024\nChange\nOilseeds\n26,944\n \n26,669 \n275 \nCorn\n13,861\n \n13,833 \n28 \nThe Company generally operates its production facilities, on an overall basis, at or near capacity, adjusting facilities individually, as needed, to react to the current margin environment and seasonal local supply and demand conditions. The increase in processed oilseeds volumes in the current year period was primarily related to improved North America crush volumes due to improved utilization after the restoration of operations at the Company’s Decatur, Illinois facility, in addition to higher volumes in South America due to increased plant reliability. The processed corn volumes were consistent year over year.\n    49\nTable of Contents\nARCHER-DANIELS-MIDLAND COMPANY\nMANAGEMENT’S DISCUSSION AND ANALYSIS\nOF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nRevenues for the nine months ended September 30, 2025 and 2024 were as follows (in millions):\nNine Months Ended\nSeptember 30,\n \n2025\n2024\nChange\nAg Services and Oilseeds\nAg Services \n$\n31,708\n \n$\n32,597 \n$\n(889)\nCrushing\n7,847\n \n9,046 \n(1,199)\nRefined Products and Other\n8,002\n \n7,999 \n3 \nTotal Ag Services and Oilseeds\n47,557\n \n49,642 \n(2,085)\n \n \n \nCarbohydrate Solutions\nStarches and Sweeteners\n6,042\n \n6,559 \n(517)\nVantage Corn Processors\n2,054\n \n1,925 \n129 \nTotal Carbohydrate Solutions\n8,096\n \n8,484 \n(388)\nNutrition\nHuman Nutrition\n3,226\n \n3,029 \n197 \nAnimal Nutrition\n2,500\n \n2,546 \n(46)\nTotal Nutrition\n5,726\n \n5,575 \n151 \nTotal Segment Revenues\n61,379\n \n63,701 \n(2,322)\nOther Business\n334\n \n331 \n3 \nTotal Revenues\n$\n61,713\n \n$\n64,032 \n$\n(2,319)\nRevenues and cost of products sold in agricultural merchandising and processing businesses are significantly correlated to the underlying commodity prices and volumes. In periods of significant changes in market prices, the underlying performance of the Company is better evaluated by looking at margins since both revenues and cost of products sold, particularly in the Ag Services and Oilseeds segment, generally have a relatively equal impact from market price changes which generally result in an insignificant impact to gross profit. \nRevenues decreased $2.3 billion to $61.7 billion, driven by lower sales prices ($2.4 billion), partially offset by higher sales volumes ($102 million). Lower sales prices of meal and soybeans were partially offset by higher sales prices of corn. Higher sales volumes of soybeans and oils were partially offset by lower sales volumes of sorghum and milo and wheat. Ag Services and Oilseeds revenues decreased 4% to $47.6 billion, driven by lower sales prices ($2.1 billion). Carbohydrate Solutions revenues decreased 5% to $8.1 billion, driven by lower sales prices ($342 million). Nutrition revenues increased 3% to $5.7 billion, driven by higher sales volumes ($103 million) and the benefit of a contract cancellation in Health and Wellness ($55 million).\nCost of products sold decreased $1.7 billion to $57.9 billion, primarily driven by lower average commodity costs. Manufacturing expenses increased $194 million to $5.8 billion driven by higher employee compensation costs and EMEA energy costs.\nGross profit decreased $600 million, or 14%, to $3.8 billion driven by a decrease in margins of $628 million for Ag Services and Oilseeds and $64 million for Carbohydrate Solutions, partially offset by an increase in margins of $83 million in Nutrition. \n    50\nTable of Contents\nARCHER-DANIELS-MIDLAND COMPANY\nMANAGEMENT’S DISCUSSION AND ANALYSIS\nOF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nSelling, general, and administrative expenses decreased $47 million to $2.7 billion primarily driven by lower third party service costs, partially offset by higher employee compensation costs.\nAsset impairment, exit, and restructuring costs decreased $111 million to $421 million. Charges in the current year period included $237 million of restructuring charges, primarily driven by $190 million and $34 million of charges within the Nutrition segment and the Ag Services and Oilseeds segment, respectively, and an impairment charge of $173 million, related to previously capitalized internal-use software, within Corporate. Charges in the prior year period included a $461 million impairment charge related to the Company’s investment in Wilmar within the Ag Services and Oilseeds segment, a $43 million impairment charge related to certain discontinued Animal Nutrition trademarks within the Nutrition segment, and $12 million of restructuring costs within Corporate.\nEquity in earnings of unconsolidated affiliates decreased $261 million to $237 million driven by lower earnings from the Company’s investments in Wilmar, reflecting the $163 million penalty charge, and in Terminal de Grãos Ponta da Montanha S.A., Hungrana Ltd, and Almidones Mexicanos S.A. de C.V., partially offset by higher earnings from the Company’s investment in Olenex.\nInterest and investment income decreased $211 million to $189 million, driven by revaluation losses, including impairment losses of $99 million and $88 million within Corporate and the Nutrition segment, respectively, in addition to lower interest income at ADM Investor Services due to lower interest rates. Prior year period results were driven by a revaluation loss related to an investment in alternative protein and precision fermentation and lower interest rates for ADM Investor Services, partially offset by higher interest income within Corporate driven by higher interest rates and balances within money-market accounts. \nInterest expense decreased $57 million to $470 million driven by decreased expense within Corporate driven by lower financing costs and favorable settlements of international tax audits, and lower interest rates at ADM Investor Services.\nOther income — net increased $48 million to $140 million driven by gains on sale of assets and benefits from termination of a supply agreement, partially offset by lower foreign exchange gains and provisions for contingent losses.\n \nIncome tax expense decreased $210 million to $160 million. The Company’s effective tax rate for the nine months ended September 30, 2025 was 20.5% compared to 23.3% for the nine months ended September 30, 2024. The decrease in the effective tax rate for the nine months ended September 30, 2025 compared to the prior year period is related to the recognition of the impairment of the Company’s investment in Wilmar in the prior year and other discrete tax items specific to each period. \n    51\nTable of Contents\nARCHER-DANIELS-MIDLAND COMPANY\nMANAGEMENT’S DISCUSSION AND ANALYSIS\nOF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nSegment operating profit for the nine months ended September 30, 2025 and 2024 was as follows (in millions):\nNine Months Ended\nSeptember 30,\n2025\n2024\nChange\nSegment Operating Profit \n(1)\nAg Services and Oilseeds\nAg Services \n$\n462\n \n$\n461 \n$\n1 \nCrushing\n93\n \n632 \n(539)\nRefined Products and Other\n410\n \n431 \n(21)\nWilmar\n205\n \n279 \n(74)\nTotal Ag Services and Oilseeds\n$\n1,170\n \n$\n1,803 \n$\n(633)\n \n \n \nCarbohydrate Solutions\nStarches and Sweeteners\n$\n804\n \n$\n1,039 \n$\n(235)\nVantage Corn Processors\n108\n \n18 \n90 \nTotal Carbohydrate Solutions\n$\n912\n \n$\n1,057 \n$\n(145)\nNutrition\nHuman Nutrition\n$\n263\n \n$\n265 \n$\n(2)\nAnimal Nutrition\n77\n \n33 \n44 \nTotal Nutrition\n$\n340\n \n$\n298 \n$\n42 \n(1)\n For the nine months ended September 30, 2025, segment operating profit for the Ag Services and Oilseeds, Carbohydrate Solutions and Nutrition segments included a positive impact of timing-related adjustments for incentive compensation payouts of $45 million, $12 million, and $20 million, respectively. The offsetting adjustment of $77 million was recorded in Corporate with no net impact to the Consolidated Financial Statements.\nIn the Ag Services and Oilseeds segment, segment operating profit decreased 35%. The Ag Services subsegment had similar operating profit compared to the prior year period. Global Trade results decreased driven by lower margins due to negative freight timing and weaker trading results. Ag Services results were further impacted by a decrease in volumes, the impact of certain export duties, and the temporary disruption at a key port facility in Brazil. These impacts were partially offset by North America Origination with improved results due to a strong corn exports, lower costs related to logistics take-or-pay contracts that negatively impacted the prior year period, productivity actions leading to decreased expenses, and improved Transportation results. The Ag Services subsegment had approximately $36 million of net positive mark-to-market timing impacts during the current year period, compared to approximately $15 million of net negative impacts in the prior year period. The Crushing subsegment had lower operating profit versus the prior year period, driven by lower soy and canola crush margins in North America and EMEA and higher manufacturing costs. South America Crushing results improved, driven by increased margins and volumes. The Crushing subsegment had approximately $66 million of net positive mark-to-market timing impacts during the current year period, compared to approximately $24 million of net positive impacts in the prior year period. The RPO subsegment operating profit was slightly lower than the prior year period, as lower vegetable oil demand and biofuel and trade policy evolution negatively impacted biodiesel and refining margins in Europe and North America. The RPO subsegment had approximately $24 million of net positive mark-to-market timing impacts during the current year period, compared to approximately $142 million of net negative impacts in the prior year period. Wilmar earnings decreased by $74 million to $205 million in the current year period.\n    52\nTable of Contents\nARCHER-DANIELS-MIDLAND COMPANY\nMANAGEMENT’S DISCUSSION AND ANALYSIS\nOF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nIn the Carbohydrate Solutions segment, segment operating profit decreased 14% compared to the prior year period. The Starches and Sweeteners subsegment operating profit was lower compared to the prior year period. In North America, results were driven by lower ethanol and starch margins and higher manufacturing costs. North American prior year period results benefitted from the receipt of $47 million of insurance proceeds for the partial settlement of the Decatur West insurance claims. In EMEA, results were driven by lower volumes and margins due to the competitive pricing environment and crop quality issues. Global Wheat Milling margins improved due to higher wheat basis gains. The Vantage Corn Processors subsegment operating profit increased compared to the prior year period, driven by improved margins resulting from improved risk management and higher ethanol volumes.\nIn the Nutrition segment, segment operating profit increased 14%. Human Nutrition results were fairly consistent relative to the prior year period. Specialty Ingredients results were lower compared to the prior year period driven by higher raw material and insurance costs due to the restoration of operations at the Company’s Decatur, Illinois facility. The prior year period also benefited from approximately $25 million of insurance proceed gains as compared to $9 million in the current year period. In Health and Wellness, results were lower, as decreased margins, driven by certain negative valuation adjustments and reduced tolling margins due to a contract cancellation, were partially offset by higher Biotics margins. Flavors saw a significant increase in operating profit compared to prior year period, driven by higher volumes and margins due to an increase in sales among existing key customers across multiple product categories. Animal Nutrition operating profit was 133% higher compared to the prior year period, driven by cost optimization efforts and improved margins due to higher margin product mix.\nOther Business and Corporate Results\nOther Business contribution of operating profit increased 23%, from $200 million to $245 million, driven by improved Captive Insurance results due to lower claim settlements, partially offset by lower net interest income in ADM Investor Services due to lower interest rates. \nCorporate results for the nine months ended September 30, 2025 and 2024 were as follows (in millions):\nNine Months Ended\nSeptember 30,\n2025\n2024\nChange\nInterest expense — net \n(1)\n$\n(311)\n$\n(351)\n40 \nUnallocated corporate function costs \n(2)\n(912)\n(903)\n(9)\nExpenses related to acquisitions\n—\n \n(4)\n4 \nRevaluation losses, including impairment, and restructuring charges \n(3)\n(278)\n(12)\n(266)\nOther income — net \n(4)\n29\n \n16 \n13 \nTotal Corporate\n$\n(1,472)\n$\n(1,254)\n$\n(218)\n(1)\nInterest expense - net decreased, primarily driven by reduced reliance on external credit facilities and reduced short-term borrowings, partially offset by higher average balances on the commercial paper program and absence of prior period interest cost on tax settlement.\n(2)\nUnallocated corporate function costs increased, primarily driven by higher incentive compensation adjustments, partially offset by lower financing costs and select corporate function costs.\n(3)\nRevaluation losses, including impairment, and restructuring charges includes an impairment charge related to previously capitalized internal-use software and impairment losses on certain investments.\n(4)\nOther income - net increased, primarily driven by timing of railroad maintenance expenses. \n    53\nTable of Contents\nARCHER-DANIELS-MIDLAND COMPANY\nMANAGEMENT’S DISCUSSION AND ANALYSIS\nOF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nNon-GAAP Financial Measures\nThe Company uses certain “non-GAAP” financial measures as defined by the SEC. These are measures of performance not defined by accounting principles generally accepted in the United States, and should be considered in addition to, not in lieu of, GAAP reported measures. Reconciliations of these non-GAAP financial measures to the most directly comparable GAAP financial measures are included in this section.\nThe Company uses adjusted net earnings, adjusted diluted EPS, EBITDA, adjusted EBITDA, and total segment operating profit, non-GAAP financial measures as defined by the SEC, to evaluate the Company’s financial performance. \nAdjusted net earnings is defined as net earnings adjusted for the effects on net earnings of specified items as more fully described in the reconciliation tables. Adjusted diluted EPS is defined as diluted EPS adjusted for the effects on reported diluted EPS of specified items as more fully described in the reconciliation tables. \nEBITDA is defined as earnings before interest on borrowings, taxes, and depreciation and amortization. Adjusted EBITDA is defined as earnings before interest on borrowings, taxes, depreciation, and amortization, adjusted to exclude the impact of specified items as more fully described in the reconciliation tables. \nTotal segment operating profit is defined as ADM’s consolidated earnings before income taxes, adjusted for Other Business, Corporate, and specified items as more fully described in the reconciliation tables. \nManagement believes that adjusted net earnings, adjusted diluted EPS, EBITDA, adjusted EBITDA, and total segment operating profit are useful measures of the Company’s performance because they provide investors additional information about the Company’s operations allowing better evaluation of underlying business performance and better period-to-period comparability. Adjusted net earnings, adjusted diluted EPS, EBITDA, adjusted EBITDA, and total segment operating profit are not intended to replace or be an alternative to net earnings, diluted EPS, and earnings before income taxes, the most directly comparable amounts reported under GAAP. \nThe table below provides a reconciliation of net earnings (the most directly comparable GAAP measure) to adjusted net earnings (a non-GAAP measure) and diluted EPS (the most directly comparable GAAP measure) to adjusted diluted EPS (a non-GAAP measure) for the nine months ended September 30, 2025 and 2024.\nNine Months Ended September 30,\n2025\n2024\nIn millions\nPer share\nIn millions\nPer share\nAverage number of shares outstanding - diluted\n484\n \n497 \nNet earnings and reported EPS (diluted)\n$\n622\n \n$\n1.29\n \n$\n1,233 \n$\n2.48 \nAdjustments: \n(1)\n(Gain) on sale of assets and businesses (net of tax of $9 million in 2025)\n(30)\n(0.06)\n(1)\n— \nImpairment, exit, restructuring charges, and settlement contingencies (net of tax of $103 million in 2025 and $6 million in 2024)\n535\n \n1.10\n \n523 \n1.06 \nADM's share of equity method investment penalty charge\n163\n \n0.34\n \n— \n— \nExpenses related to acquisitions (net of tax of $1 million in 2024)\n—\n \n—\n \n3 \n0.01 \n(Gain) on contract termination (net of tax of $17 million in 2025)\n(52)\n(0.11)\n— \n— \nCertain discrete tax adjustments\n—\n \n—\n \n30 \n0.06 \nTotal adjustments\n616\n \n1.27\n \n555 \n1.13 \nAdjusted net earnings and adjusted diluted EPS\n$\n1,238\n \n$\n2.56\n \n$\n1,788 \n$\n3.61 \n(1)\n Tax effected using the U.S. and other applicable tax rates.\n    54\nTable of Contents\nARCHER-DANIELS-MIDLAND COMPANY\nMANAGEMENT’S DISCUSSION AND ANALYSIS\nOF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe table below provides a reconciliation of net earnings (the most directly comparable GAAP measure) to EBITDA (a non-GAAP measure) and adjusted EBITDA (a non-GAAP measure) for the nine months ended September 30, 2025 and 2024 (in millions).\nNine Months Ended\nSeptember 30,\n2025\n2024\nNet Earnings Attributable to Archer-Daniels-Midland Company\n$\n622\n \n$\n1,233 \nNet (losses) attributable to non-controlling interests\n(3)\n(15)\nIncome tax expense\n160\n \n370 \nEarnings Before Income Taxes\n779\n \n1,588 \nInterest expense \n(1)\n338\n \n375 \nDepreciation and amortization \n(2)\n865\n \n854 \nEBITDA\n1,982\n \n2,817 \n(Gain) on sales of assets and businesses\n(39)\n(1)\nImpairment, exit, restructuring charges and settlement contingencies\n638\n \n529 \nADM's share of equity method investment penalty charge\n163\n \n— \n(Gain) on contract termination\n(69)\n— \nExpenses related to acquisitions\n—\n \n4 \nRailroad maintenance expenses\n16\n \n32 \nAdjusted EBITDA\n$\n2,692\n \n$\n3,381 \n(1)\n Represents interest expense on borrowings and therefore excludes ADM Investor Services related interest expense.\n(2)\n Excludes $11 million of accelerated depreciation recorded within restructuring charges as a specified item for the nine months ended September 30, 2025. \nThe table below provides a reconciliation of earnings before income taxes (the most directly comparable GAAP measure) to total segment operating profit (a non-GAAP measure) for the nine months ended September 30, 2025 and 2024 (in millions). \nNine Months Ended\nSeptember 30,\n2025\n2024\nEarnings Before Income Taxes\n$\n779\n \n$\n1,588 \nOther Business (earnings)\n(245)\n(200)\nCorporate\n1,472\n \n1,254 \nSpecified Items:\n(Gain) on sale of assets and businesses\n(39)\n(1)\nImpairment, exit, restructuring charges and settlement contingencies\n361\n \n517 \n(Gain) on contract termination\n(69)\n— \nADM's share of equity method investment penalty charge\n163\n \n— \nTotal Segment Operating Profit\n$\n2,422\n \n$\n3,158 \n    55\nTable of Contents\nARCHER-DANIELS-MIDLAND COMPANY\nMANAGEMENT’S DISCUSSION AND ANALYSIS\nOF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nLiquidity and Capital Resources\nThe Company’s objective is to have sufficient liquidity, balance sheet strength, and financial flexibility to fund the operating and capital requirements of a capital-intensive agricultural commodity-based business. The Company depends on access to credit markets, which can be impacted by its credit rating and factors outside of the Company’s control, to fund its working capital needs and capital expenditures. \nThe primary source of funds to finance the Company’s operations, capital expenditures, and advancement of its growth strategy is cash generated by operations and lines of credit, including a commercial paper borrowing facility and accounts receivable securitization programs. In addition, the Company believes it has access to funds from public and private equity and debt capital markets in both U.S. and international markets. \nAt September 30, 2025, the Company’s capital resources included shareholders’ equity of $22.5 billion and lines of credit, including the accounts receivable securitization programs described below, totaling $12.2 billion, of which $9.8 billion was unused. Of the Company’s total lines of credit, $5.1 billion supported the combined U.S. and European commercial paper borrowing programs. At September 30, 2025, there was $190 million of commercial paper outstanding.\nAs of September 30, 2025, the Company had $1.2 billion of cash and cash equivalents, $629 million of which was cash held by foreign subsidiaries whose undistributed earnings are considered indefinitely reinvested. Based on the Company’s historical ability to generate sufficient cash flows from its U.S. operations and unused and available U.S. credit capacity of $5.6 billion, the Company has asserted that these funds are indefinitely reinvested outside the U.S. \nAs of September 30, 2025, the Company had total available liquidity of $11.0 billion comprised of cash and cash equivalents and unused lines of credit. The Company believes that cash flows from operations, cash and cash equivalents on hand, and unused lines of credit will be sufficient to meet its ongoing liquidity requirements for at least the next twelve months.\nOperating Cash Flows \nCash provided by operating activities was $5.8 billion and $2.5 billion for the nine months ended September 30, 2025 and 2024, respectively.\nThe increase in cash provided by operating activities was primarily driven by changes in operating assets and liabilities, partially offset by lower earnings for the nine months ended September 30, 2025. Changes in net working capital were driven by changes in segregated investments, payables to brokerage customers, inventory, trade payables, and other current assets. \nSegregated investments decreased $113 million in the current year period compared to an increase of $257 million in the prior year period, driven by business conditions and change in mix of investment portfolio. \nBrokerage payables increased $1.8 billion in the current year period compared to a decrease of $249 million in the prior year period, driven by changes in customer balances in the brokerage business due to changes in business conditions.\nInventories\n decreased $3.2 billion i\nn the current year period compared to a decrease of $1.2 billion in the prior year period, \nlargely driven by the Company’s sharpening of its inventory management practices.\nTrade payables decreased by \n$637 million\n in the current year period compared to a decrease of \n$1.4 billion\n in the prior year period, primarily driven by changing market conditions and improved payment terms.\nOther current assets \nincreased by $190 million in\n the current year period compared to a decrease of $745 million in the prior year perio\nd, primarily driven by changes in ADM Investor Services customer related receivables and the valuation of derivative contracts. \n    56\nTable of Contents\nARCHER-DANIELS-MIDLAND COMPANY\nMANAGEMENT’S DISCUSSION AND ANALYSIS\nOF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nInvesting Cash Flows \nNet cash used in investing activities was $644 million and $2.0 billion for the nine months ended September 30, 2025 and 2024, respectively. \nNet cash used in investing activities for the nine months ended September 30, 2025 included additions to property, plant, and equipment of $892 million and business acquisitions, net of cash acquired, of $108 million, partially offset by proceeds from sales of marketable securities of $276 million and proceeds from the sale of assets of $78 million.\nNet cash used in investing activities for the nine months ended September 30, 2024 included business acquisitions, net of cash acquired, of $936 million and additions to property, plant, and equipment of $1.1 billion.\nFinancing Cash Flows \nNet cash used in financing activities was $3.2 billion and $1.5 billion for the nine months ended September 30, 2025 and 2024, respectively. \nIn the three and nine months ended September 30, 2025, the Company repaid in full €650 million of 1.000% notes, previously included within Current maturities of long-term debt. Net cash used in financing activities for the nine months ended September 30, 2025 and September 30, 2024 also included net (repayments) borrowings under short-term credit agreements of $(1.7) billion and $1.6 billion, respectively. \nNo share repurchases were made in the nine months ended September 30, 2025. Share repurchases for the nine months ended September 30, 2024 were $2.3 billion. \nDividends paid for the nine months ended September 30, 2025 and 2024 were $743 million and $744 million, respectively. \nStock Repurchase Program\nOn March 12, 2024, the Company entered into an accelerated share repurchase (“ASR”) transaction agreement with Merrill Lynch International, an affiliate of BofA Securities, Inc., to repurchase $1.0 billion of ADM common stock as part of ADM’s existing share repurchase program. \nOn March 28, 2024, the Company received an interim delivery of 8,880,986 shares at an average share price of $60.596, or $538 million in aggregate. On April 15, 2024, the Company received a final delivery of 7,325,733 shares at an average share price of $63.045, or $462 million in aggregate, as final settlement of the ASR transaction. \nOn December 11, 2024, the Company's Board of Directors approved a second extension of the stock repurchase program through December 31, 2029 and the repurchase of up to an additional 100 million shares under the extended program. \nAs of September 30, 2025, the Company had 115 million remaining shares under its share repurchase program until December 31, 2029.\nAccounts Receivable Securitization Programs \nThe Company has accounts receivable securitization programs (the “Programs”) with certain commercial paper conduit purchasers and committed purchasers. The Programs provide the Company with up to $3.0 billion in funding against accounts receivable transferred into the Programs and expands the Company’s access to liquidity through efficient use of its balance sheet assets (see Note 15. Sale of Accounts Receivable within “Notes to Consolidated Financial Statements” included in Item 1. Consolidated Financial Statements for further information). As of September 30, 2025, the Company had $866 million unused capacity of its facility under the Programs.\n    57\nTable of Contents\nARCHER-DANIELS-MIDLAND COMPANY\nMANAGEMENT’S DISCUSSION AND ANALYSIS\nOF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nContractual Obligations and Commercial Commitments\nThe Company’s purchase obligations as of September 30, 2025 and December 31, 2024 were $13.2 billion and $12.4 billion, respectively. As of September 30, 2025, the Company expects to make payments related to purchase obligations of $10.6 billion within the next twelve months. There were no other material changes in the Company’s contractual obligations during the three months ended September 30, 2025.\nCritical Accounting Estimates\nThere were no material changes in the Company’s critical accounting estimates during the three months ended September 30, 2025. For a description of the Company’s critical accounting estimates and assumptions used in the preparation of the Company’s financial statements, see Part II. Item 7 and Note 1 of “Notes to Consolidated Financial Statements” included in Part II. Item 8 of the Company’s Annual Report on Form 10-K for the year ended December 31, 2024."
}