{
  "item1": "ADP COS designed large enterprises outsource payroll. ADP COS, day-to-day payroll process becomes responsibility, freeing up clients address critical issues like employee engagement retention. combination technology, deep expertise data-driven insights ADP COS offers powerful, allowing clients focus strategy results. premier global solutions consist multi-country local in-country solutions employers any type size.",
  "item7": "PEO Services' revenues Less: PEO zero-margin benefits pass-throughs PEO Services' revenues excluding zero-margin benefits pass-throughs PEO Services' revenues increased fiscal 2025 due increase zero-margin benefits pass-throughs, increase average worksite employees 3%, compared fiscal 2024. Earnings before Income Taxes PEO Services’ earnings before income taxes increased fiscal 2025 due increased revenues discussed above, partially offset increases operating costs related workers' compensation state unemployment insurance, zero-margin benefits pass-through costs, selling marketing expenses. PEO Services' margin decreased fiscal 2025 due increases zero-margin benefits pass-through costs, operating costs related workers' compensation state unemployment insurance, selling marketing expenses, partially offset increase pre-tax benefit ADP Indemnity. ADP Indemnity provides workers’ compensation employer's liability deductible reimbursement insurance protection PEO Services’ worksite employees up $1 million per occurrence.",
  "item2": "ADP Indemnity recorded pre-tax benefit approximately $4.7 million three months ended September 30, 2025, compared approximately $4.8 million three months ended September 30, 2024, which primarily results more favorable actuarial loss development workers’ compensation reserves. ADP Indemnity paid premium $278 million July 2025, enter into reinsurance agreement Chubb cover substantially all losses incurred ADP Indemnity fiscal 2026 policy year terms substantially similar fiscal 2025 reinsurance policy. primary components “Other” certain corporate overhead charges expenses not been allocated reportable segments, including corporate functions, severance costs, non-recurring gains losses, elimination intercompany transactions, all other interest income expense. Non-GAAP Financial Measures addition GAAP results, use adjusted results other non-GAAP metrics set forth table below evaluate operating performance absence certain items planning forecasting future periods: Adjusted Financial Measure Adjusted provision income taxes Provision income taxes Adjusted net earnings Adjusted diluted earnings per share Diluted earnings per share Adjusted effective tax rate Organic constant currency believe exclusion identified items helps us reflect fundamentals underlying business model analyze results against expectations against prior periods, plan future periods focusing underlying operations."
}