{
  "source_file": "adp-20250630.htm",
  "form_type": "10-K",
  "item1": "Item 1. Business\nCORPORATE BACKGROUND\nGeneral\nIn 1949, our founders established ADP with a simple, innovative idea: help clients focus on their business by solving their payroll challenges. In the more than 75 years since, we have shaped the world of work with innovation and expertise, transforming Human Capital Management (“HCM”) from an administrative challenge to a strategic business advantage. We continuously aim to solve complex business challenges for our clients and their workers, helping them work smarter today so they can have more success tomorrow. \nA\nlways \nD\nesigning for \nP\neople means ADP focuses on people, leveraging our unparalleled data insights and innovative technology to elevate human potential. Today, we are a global leader in HR and payroll solutions, serving over 1.1 million clients and paying over 42 million workers in over 140 countries and territories. Our common stock is listed on the NASDAQ Global Select Market® under the symbol “ADP.”\nWhen we refer to “we,” “us,” “our,” “ADP,” or the “Company” in this Annual Report on Form 10-K, we mean Automatic Data Processing, Inc. and its consolidated subsidiaries.\n3\nBUSINESS OVERVIEW\nADP’s Mission\nOur mission is to help businesses make meaningful change in the world of work by providing insightful HCM solutions that meet the evolving needs of our clients and their workers. \nAs new technologies and shifting workplace dynamics continuously reshape the way people work, we support every HCM need of our clients whether that client is a small, local business or a large, global enterprise operating around the world. From HR, payroll, time and benefits to HR outsourcing, talent, compliance and retirement, our solutions span the entire employee experience from hire to retire. Our leading technology and commitment to service excellence are at the core of our relationship with each one of our clients, which span over 140 countries and territories. We are always designing better ways to work through industry leading products, premium services and exceptional experiences that enable people to reach their full potential all around the world.\nADP’s Strategy\nWith a large and growing addressable market, we are focused on our core growth areas and further enhancing our market position by executing on our three strategic priorities: \n• Lead with Best-in-Class HCM Technology. \nWe design and develop world-class HCM platforms that simplify work and utilize enabling technologies such as artificial intelligence (“AI”) and modern cloud architecture. We aim to solve the needs of our clients and their workers today by making HCM transactions compliant and effortless, while anticipating their needs of tomorrow by incorporating valuable data insights and guidance into our solutions to help them better understand their workforce and position them to make better decisions.\n• Provide Unmatched Expertise and Outsourcing Solutions.\n Our clients look to us as a source of expertise to understand key HR trends and best practices, employment and related legislation and regulations, and to offer thoughtful strategies to utilize HCM technology to achieve their business objectives and support their workforce. Many of our clients also ask us to take on responsibility for a portion or all of their HCM workflows via one of our Human Resources Outsourcing (“HRO”) solutions. We continue to build on our deep expertise and make it readily available to our clients through a variety of channels, ranging from traditional call and chat options to self-guided and AI-powered options. We will continue to leverage our significant data insights and investments in AI and other technologies to further enable and effectively apply our decades of knowledge and experience to help our clients and their workers navigate the ever-changing world of work.\n• Benefit our Clients with Our Global Scale. \nOur clients benefit from our unmatched global footprint and scale in the HCM industry. We will continue to build on these strengths to further improve our client experience, and to add to our global footprint to further meet our clients where they choose to do business and address their needs for a distributed and flexible workforce. We see meaningful opportunities to leverage our strength in global payroll and expand our HR and workforce management \n4\nsolutions to support our global and multinational clients. We continue to build more relationships with partners, such as through the ADP Marketplace, in order to provide clients with seamless integrations and customizations that simplify their HR processes and best address their unique needs. And we intend to grow our sales organization and continue to invest in best-in-class sales technology to not only optimize the purchase experience but to also empower our sellers to provide the deep expertise and insights our clients require to ensure they have the right HCM solutions to help them achieve their objectives and make a meaningful impact for their employees. \nInnovation at ADP\nInnovation is in our DNA. For over 75 years, we have proven that actively listening and responding to what clients and their employees need and want keeps the world of work progressing forward. As a founder in the industry, we pioneered HCM automation, HCM in the cloud, mobile HCM and a digital HCM marketplace, laying the groundwork and streamlining our infrastructure to innovate at a faster pace. This spirit of innovation remains a steady guide as we continue to listen and respond to emerging needs. As technologies like AI, machine learning (“ML”) and generative AI change how work happens, we remain focused on providing our clients and associates with HCM technology that is easy to use, powered with smart insights and personalized to support a human-centric experience. \nTo bring these solutions to market, we pursue multiple paths to innovation. From leveraging our unique data to provide differentiated insights to collaborating with, or investing in, organizations with complementary products to purchasing solutions that add to our strong foundation, each of these paths helps ADP sustain a culture focused on continuous innovation.\nStrategically infusing AI\nThe AI landscape is evolving quickly. As we move from early automation and predictive analytics to AI-enabled workflows, agentic AI is the future of innovation in the HCM space. Our AI strategy is to deliver AI agents for all \nmajor HCM roles that our clients have. Our clients have employees performing different roles such as payroll, HR, benefits, compensation, and recruiting. Our goal is to deliver AI agents that continue to automate tedious, time heavy tasks and deliver value to these individuals to do more strategic activities. Similarly, we intend to deliver AI role-based agents to our internal associates such as sales, software engineering, testing, product management, service, and implementation.\nTo advance these efforts, we continue to roll out ADP Assist, our award-winning cross-platform solution powered by generative AI that transforms data into credible and actionable insights. ADP Assist offers smart, user-centric solutions through a conversational interface that touches every aspect of HR – payroll, time, talent, benefits, recruitment, analytics, reporting, and compliance.\nADP Assist validates payroll information, checking for payroll anomalies and using generative AI to identify and help resolve missing tax registrations and answer questions by drawing on ADP’s large, up-to-date dataset of compliance information. ADP Assist also uses generative AI to simplify report creation, helping HR practitioners and leaders access internal, national, and global workforce data to analyze compensation, turnover, candidate profile relevancy, and talent market insights. A 2024 AI Breakthrough Award winner, the solution was also recognized in Business Intelligence Group’s 2025 BIG Innovation Awards and 2025 Artificial Intelligence Excellence Awards for driving innovation and possibilities in AI. \nAlong with transforming our solutions, we firmly believe AI and generative AI enhance our operations and enable us to elevate the end-to-end client experience. To lean into our service expertise, we continue to extend generative AI capabilities to a broader portion of our service and implementation associates to deliver an even better client experience. We also continue to explore generative AI capabilities to further empower our sellers to be more productive. In addition, we extended AI tools to all of our product developers for coding, testing, and documentation. \nData is our differentiator\nTo harness the power of AI, data is critical – and it’s the foundation of the advantage we bring to our clients. Data is at the core of our products and solutions, informing and driving our approach to innovation and new technology. The global scale and scope of our client base provide us the industry’s largest and deepest HCM dataset with over 1.1 million clients spanning over 140 countries and territories and 42 million workers globally. Our broad and granular data set positions us well to deliver smarter and more tailored HCM agents that we believe will be truly differentiated in the market. Additionally, combining our vast client and service data with client outcomes gives us a deeper understanding of clients’ needs and goals. \nAI represents the next frontier, and our industry-leading data set married to our best-in-class distribution offers \n5\nADP a distinct, competitive advantage. AI and ML drive many of the key features of ADP’s data products, including ADP DataCloud, our award-winning people analytics solution. ADP DataCloud analyzes aggregated, anonymized and timely HCM and compensation data from more than one million organizations across the U.S., powering solutions that provide clients with in-depth workforce and business insights that enable critical HR decisions. \nAnalytics enhanced by ADP Assist leverages generative AI to deliver answers to analytics questions across key practice areas including benefits, HR, payroll, recruitment and time, helping to remove user friction. \nScalable, Global HCM Offerings\nWe also continue to advance our next-gen platforms, launching ADP Lyric HCM in September 2024. Building on our position as a leader in global pay, we designed Lyric to be as dynamic as the world of work. The unified, global HCM solution is designed for adaptability, providing our clients with the flexibility they need to address today’s and tomorrow’s workplace challenges, and to personalize the experience based on their needs. The solution was named “Data Solution of the Year for Human Resources” in the 2025 Data Breakthrough Awards.\nTo expand our global offering and enhance our enterprise solution suite, in October 2024 ADP acquired WorkForce Software, a premier workforce management solutions provider that specializes in supporting large, global enterprises. WorkForce Software’s solutions can adapt to the dynamic needs of today’s employers, creating resiliency, driving performance and making managing a global workforce easy. This acquisition expands our current array of global time and attendance, absence management and scheduling tools and will drive workforce management innovation to help meet the future needs of businesses. In addition, ADP acquired Procesamiento Externo de Información, S.C. (PEI) in February 2025, a provider of  local payroll, HCM expertise, and technology solutions for Mexican businesses, strengthening ADP’s capabilities in local and global payroll and HR.\nSustaining a culture of responsible AI\nIn harnessing the power of data through AI and ML, ADP \nrecognizes the importance of accountability, transparency, privacy, explainability and governance, and in furtherance of those goals has established an active AI & Data Ethics Committee, comprised of both industry leaders and ADP experts, which advises on emerging industry trends and concerns and provides guidance with respect to compliance with the principles that ADP should follow while developing products, systems and applications that involve AI, ML and data.\nAs we continue to explore the potential that new technologies like generative AI can provide, we understand the great responsibility we have to approach these innovations in a way that is ethical, secure, and compliant for our business and the clients and workers we serve around the world. This led to our establishment of an interdisciplinary working group across ADP to determine governance for use cases and adoption of a set of principles and processes to govern the use of these newer technologies, including operational monitoring of recommendations made by AI and ML technologies.\nCreating a customized HR ecosystem\nTo meet clients’ shifting needs, we also collaborate with partners through solutions like ADP Marketplace, one of the largest e-commerce platforms for HR solutions in the industry. This innovative marketplace empowers our clients to connect and share data seamlessly across their HR systems, offering access to over 800 partner solutions - from recruiting and onboarding to compliance and learning management. With the introduction of AI technology, including our generative AI smart search tool, clients can quickly discover and evaluate partner solutions using natural language, enabling clients to tailor their HCM ecosystem with integrated solutions that best fit their unique needs. \nAdditionally, ADP API Central offers secure APIs and tools and resources for custom integrations to simplify and automate business processes. This solution was named \n6\n“New Product of the Year” in Business Intelligence Group’s 2024 BIG Awards for Business.\nAccelerating innovation\nReflecting our commitment to innovation, ADP’s corporate venture capital arm and innovation lab, ADP Ventures, is focused on enhancing and strengthening ADP’s core business, creating offerings in new adjacent segments and geographies, and developing new assets to monetize markets and segments beyond HCM.  As part of its strategy, ADP Ventures invests in and partners with early-stage and scaling tech startups that advance ADP’s innovation strategy. \nReportable Segments\nOur two reportable business segments are Employer Services and Professional Employer Organization (“PEO”), and are based on the way that management reviews the performance of, and makes decisions about, our businesses. For financial data by segment and by geographic area, see Note 15 to the “Consolidated Financial Statements” contained in this Annual Report on Form 10-K.\nEmployer Services\n.  Our Employer Services segment serves clients ranging from single-employee small businesses to large enterprises with tens of thousands of employees around the world, offering a comprehensive range of technology-based HCM solutions, including our strategic, cloud-based platforms, and HRO (other than PEO) solutions. These solutions address critical client needs and include: Payroll Services, Benefits Administration, Talent Management, HR Management, Workforce Management, Compliance Services, Insurance Services and Retirement Services.\nProfessional Employer Organization\n.  Our PEO business, called ADP TotalSource\n®\n, is our full-service PEO that offers expert guidance, user-friendly technology, comprehensive employee benefits, and a risk management, safety, and workers’ compensation program as part of a co-employment arrangement in which employees who work for a client (referred to as “worksite employees”) are co-employed by us and the client.\n7\nPRODUCTS AND SOLUTIONS\nIn order to serve the unique needs of our clients and their diverse types of businesses and workforce models, we provide a range of solutions that businesses of all types and sizes and across geographies can use to recruit, onboard, pay, manage, and retain their workforce. We address these broad market needs with our cloud-based strategic platforms: RUN Powered by ADP\n®\n, serving over 940,000 small businesses; ADP Workforce Now\n®\n, serving over 90,000 mid-sized and large businesses; and ADP Lyric HCM, serving large enterprise businesses. All of these solutions can be combined with ADP SmartCompliance\n®\n to address the increasingly broad and complex needs of employers. Outside the United States, we address the needs of over 70,000 clients with premier global solutions consisting of in-country solutions and multinational offerings, including Lyric, ADP Global Payroll and ADP iHCM.\nHCM Solutions\nIntegrated HCM Solutions.\n \n \nOur premier suite of HCM products offers complete solutions that assist employers of all types and sizes in all stages of the employment cycle, from recruitment to retirement.\nOur suite of HCM solutions are powered by our strategic, cloud-based, award-winning platforms, including:\n• RUN Powered by ADP is an all-in-one platform designed specifically for small businesses to simplify payroll, HR, and compliance. It combines easy-to-use technology with 24/7 real-person support from ADP’s team of payroll professionals.  RUN also integrates with other ADP solutions, including workforce management, workers’ compensation, benefits, and retirement services.\n• ADP Workforce Now is a flexible HCM solution used across mid-sized and large businesses in North America to manage their employees. \nMore businesses use ADP \nWorkforce Now in North America\n than any other HCM solution designed for both mid-sized and large businesses.\n• ADP Lyric HCM is a global HCM for large enterprises, unifying HR management, payroll, workforce management, talent, and data analytics into a flexible, intelligent, and human-centric solution. Businesses using Lyric also benefit from comprehensive end-to-end service support, with an emphasis on global compliance and expertise.\n \nLyric is built for the way people actually work together, mirroring practically any structure of work groups, such as divisions, regions, or dynamic teams.  Lyric integrates generative AI technology with ADP’s unmatched dataset, helping to support decision-making, drive efficiency and personalize employee experiences based on attributes of role, geographic location, typical behaviors, and anticipated need.\nGlobal Payroll\n. \n \nWe pay over 26 million (approximately 1 out of every 6) workers in the United States. We offer flexible payroll services to employers of all sizes, including the preparation of employee paychecks, pay statements, supporting journals, summaries, and management reports.\n8\nWe provide employers with a wide range of payroll options, including using mobile technology, connecting their major enterprise resource planning (“ERP”) applications with ADP’s payroll services or outsourcing their entire payroll process to us. Employers can choose a variety of payroll payment options including ADP’s electronic wage payment and, in the United States, payroll card solutions and digital accounts. On behalf of our clients in the United States, we prepare and file federal, state and local payroll tax returns, and quarterly and annual Social Security, Medicare, and federal, state and local income tax withholding reports. \nBenefits Administration.\n \n In the United States, we provide powerful and agile solutions for employee benefits administration. These options include health and welfare administration services, leave administration services, insurance carrier enrollment services, employee communication services, and dependent verification services. In addition, ADP benefits administration solutions offer employers a simple and flexible cloud-based eligibility and enrollment system that provides their employees with tools, communications, and other resources they need to understand their benefits options and make informed choices.\nTalent Management.\n \n \nADP’s Talent Management solutions simplify and improve the talent acquisition, management and activation process, from recruitment to ongoing employee engagement and development. Employers can outsource their internal recruitment function to ADP through ADP’s Recruitment Process Outsourcing services. Employers can also receive employer brand activation services, management of candidate advertising, talent community building services, and recruiter training services, as well as career search support and outplacement for reductions in force. Our solutions provide performance, learning, succession and compensation management tools that help employers align goals to outcomes, and enable managers to identify and mitigate potential retention risks. Our talent activation solutions include \nStandOut\n® powered by ADP, which provides team leaders with data and insights to drive employee engagement and leadership development, which in turn help drive employee performance.\nWorkforce Management.\n \n ADP’s Workforce Management offers a range of solutions to over 140,000 employers of all sizes, including time and attendance, absence management and scheduling tools. Time and attendance solutions include time capture via online timesheets, timeclocks with badge readers, biometrics and touch-screens, telephone/interactive voice response, and mobile smartphones and tablets. These tools automate the calculation and reporting of hours worked, helping employers prepare payroll, control costs and overtime, and manage compliance with wage and hour regulations. Absence management tools include accrued time off, attendance policy and leave case management modules. Our employee scheduling tools simplify visibility, offer shift-swapping capabilities and can assist managers with optimizing schedules to boost productivity and minimize under- and over-staffing. We also offer data analytics and reporting tools that provide clients with insights, benchmarks and performance metrics so they can better manage their workforce. In addition, industry-specific modules are available for labor forecasting, budgeting, activity and task management, grant and project tracking, and tips management.\nCompliance Solutions.\n \nADP’s Compliance Solutions provides industry-leading expertise in payment compliance and employment-related tax matters that complement the payroll, HR and ERP systems of our clients. In our fiscal year ended June 30, 2025, in the United States, we processed and delivered more than 78 million employee year-end tax statements and moved more than $3.3 trillion in client funds to our clients’ employees, tax authorities and other payees. Our offerings within Compliance Solutions include employment tax services, W-2 management, business tax credits, I-9 management, employment verification, wage garnishment and Wisely by ADP, our paycard solution.\nHuman Resources Management.\n \n \nCommonly referred to as Human Resource Information Systems, ADP’s Human Resources Management Solutions provide employers with a single system of record to support the entry, validation, maintenance, and reporting of data required for effective HR management, including employee names, addresses, job types, salary grades, employment history, and educational background. \nInsurance Services.\n \nADP’s Insurance Services business, in conjunction with our licensed insurance agency, Automatic Data Processing Insurance Agency, Inc., facilitates access in the United States to workers’ compensation and group health insurance for over 260,000 small and mid-sized clients through a variety of insurance carriers. Our automated Pay-by-Pay® premium payment \n9\nprogram calculates and collects workers’ compensation premium payments each pay period, simplifying this task for employers.\nRetirement Services.\n \n ADP Retirement Services helps over 190,000 employers in the United States administer various types of retirement plans, such as traditional and Roth 401(k)s, profit sharing (including new comparability), SIMPLE and SEP IRAs, and executive deferred compensation plans. ADP Retirement Services offers a full service 401(k) plan program which provides recordkeeping and administrative services, combined with an investment \nplatform offered through ADP Broker-Dealer, Inc. that gives our clients’ employees access to a wide range of non-proprietary investment options and online tools to monitor the performance of their investments. In addition, ADP Retirement Services offers investment management services to retirement plans through ADP Strategic Plan Services, LLC, an SEC registered investment adviser under the Investment Advisers Act of 1940. ADP Retirement Services also offers trustee services through ADP Retirement Trust Services, LLC, a New Hampshire state-chartered affiliated trust company, as well as through a third party.\nHRO Solutions\nAs a leader in the growing HR Outsourcing market, we partner with clients from small, mid-sized and large enterprise organizations, offering a full range of premium services and seamless technology for HR, benefits, payroll, and talent management. We help organizations streamline processes, reduce the daily workload and reduce compliance risk while also gaining a partner to navigate HR challenges. Whether a client chooses our PEO or HRO/Managed Services, we offer solutions tailored to a client’s specific needs and provide day-to-day expertise, guidance and tools, all personalized to meet their unique needs. ADP’s HR Outsourcing solutions serve over three million client employees.\nProfessional Employer Organization.\n ADP TotalSource is enabled by ADP Workforce Now and offers small and mid-sized businesses a comprehensive HR outsourcing solution through a co-employment model. With a PEO, both ADP and the client have a co-employment relationship with the client’s employees. We assume certain employer responsibilities such as payroll processing and tax filings, and the client maintains control of its business and all management responsibilities. ADP TotalSource clients are able to offer their employees services and benefits on par with those of much larger enterprises, without the need to staff a full HR department. With our cloud-based HCM software at the core, we serve more than 18,000 clients and more than 750,000 worksite employees in all 50 U.S. states. ADP TotalSource is the largest PEO certified by the Internal Revenue Service as meeting the requirements to operate as a Certified Professional Employer Organization under the Internal Revenue Code. ADP TotalSource is also an Employer Services Assurance Corporation accredited PEO, which demonstrates that ADP meets the industry’s high standards and has the experience and financial stability to fulfill the needs of the businesses it serves. As a full-service PEO, ADP TotalSource provides a broad range of HR administrative services, including payroll and payroll tax, employer compliance, HR guidance, employee benefits and benefit administration, talent strategies, and workers’ compensation insurance including risk and claims management. \nADP Comprehensive Services. \n ADP Comprehensive Services combines personalized, high-touch support with our market-leading ADP Workforce Now platform to offer a one-stop suite of managed services solutions that are tailored to the specific needs of businesses of all sizes. Our committed team of professionals provides expertise, guidance, and tools across HR, talent management, payroll, and benefits administration through a combination of proven expertise, deep experience, and best practices. We take the time to understand our clients’ businesses to offer the right strategic support, enabling a flexible partnership that can cover one, some, or all areas of their HR and payroll processes.\n \nOur scalable solution is designed to act as an extension of our clients’ in-house resources, providing outsourced execution that effectively combines expertise, processes and technology.  \nADP Comprehensive Outsourcing Services (ADP COS).\n \n ADP COS is designed for large enterprises to outsource their payroll. With ADP COS, the day-to-day payroll process becomes our responsibility, freeing up clients to address critical issues like employee engagement and retention. The combination of technology, deep expertise and data-driven insights that ADP COS offers is powerful, allowing clients to focus on strategy and results.\nGlobal Solutions\nOur premier global solutions consist of multi-country and local in-country solutions for employers of any type or size. We partner with clients to help them navigate the most complex HR and payroll scenarios using tailored and scalable technology supported by our deep compliance expertise.\n10\nADP Global Payroll is a solution for multinational organizations of all sizes, empowering them to harmonize HCM strategies in over 140 countries and territories globally. This improves visibility, control and operational efficiency, giving organizations the insight and confidence to adapt to changing local needs, while helping to drive overall organizational agility and engagement.\nWe also offer comprehensive, country-specific HCM solutions that combine innovative technology with deep local expertise. By operating a flexible service model, we help clients manage various combinations of payroll services, HR management, time and attendance management, talent management and benefits management, depending on the country in which the solution is provided.\nWe pay over 16 million workers outside the United States with our in-country and multi-country solutions, such as ADP iHCM and ADP Global Payroll. As part of our global payroll services, we supply year-end regulatory and legislative tax statements and other forms to our clients’ employees. Our global talent management solutions elevate the employee experience, from recruitment to ongoing employee engagement and development. Our comprehensive HR solutions combined with our deep expertise make our clients’ global HR management strategies a reality. Our configurable, automated time and attendance tools help global clients understand the work being performed and the resources being used, and help ensure the right people are in the right place at the right time.\nMARKETS AND SALES\nOur HCM solutions are offered in over 140 countries and territories across North America, Latin America, Europe, Asia and Africa. The most material markets for HCM Solutions, Global Solutions and HRO Solutions (other than PEO) are the United States, Canada and Europe. In each market, we have both country-specific solutions and multi-country solutions, for employers of all sizes and complexities. The major components of our offerings throughout these geographies are payroll, HR outsourcing and workforce management. In addition, we offer wage and tax collection and/or remittance services in the United States, Canada, the United Kingdom, Australia, India, China, Hong Kong, Macau, Malaysia, and Taiwan. Our PEO business offers services exclusively in the United States.\nWe market our solutions primarily through our direct sales force. We also market HCM Solutions, Global Solutions and HRO Solutions through indirect sales channels, such as marketing relationships with certified public accountants and banks, among others. None of our major business units has a single homogeneous client base or market. While concentrations of clients exist in specific industries, no one client, industry or industry group is material to our overall \nrevenues. We are a leader in each of our major service offerings and do not believe any of our major services or business units is subject to unique market risk.\nCOMPETITION\nThe industries in which we operate are highly competitive. We know of no reliable statistics by which we can determine the number of our competitors, but we believe that we are one of the largest providers of HCM solutions in the world. HCM Solutions, Global Solutions and HRO Solutions (other than PEO) compete with other business outsourcing companies, companies providing ERP services, providers of cloud-based HCM solutions and financial institutions. Our PEO business competes with other PEOs providing similar services, as well as business outsourcing companies, companies providing ERP services and providers of cloud-based HCM solutions. We also face ongoing competition from companies’ in-house functions, whereby companies install and operate their own HCM system.\nCompetition for business outsourcing solutions is primarily based on product and service quality, reputation, ease of use and accessibility of technology, breadth of offerings, and price. We believe that we are competitive in each of these areas and that our leading-edge technology (together with our data) and commitment to service excellence, distinguishes us from our competitors.\nINDUSTRY REGULATION\nOur business is subject to a wide range of complex U.S. and foreign laws and regulations. In addition, many of our solutions are designed to assist clients with their compliance with certain U.S. and foreign laws and regulations that apply to them. We have, and continue to enhance, compliance programs and policies to monitor and address the legal and regulatory requirements applicable to our operations and client solutions, including dedicated compliance personnel and training programs.\n11\nAs a global leader in HR and payroll solutions, our systems contain a significant amount of data related to clients, employees of our clients, vendors and our employees. We are, therefore, subject to compliance obligations under federal, state and foreign privacy, data protection, AI and cybersecurity-related laws, including federal, state and foreign security breach notification laws with respect to both client employee data and our own employee data. The changing nature of these comprehensive laws in the United States, Europe and elsewhere, including the European Union’s (the “EU”) General Data Protection Regulation (the “GDPR”),  the California Privacy Rights Act of 2020 (the “CPRA”), and the Department of Justice’s (the “DOJ”) Data Security Program established under Executive Order 14117, impact our processing of personal information of our employees and on behalf of our clients. The GDPR imposes strict and comprehensive requirements on us as both a data controller and a data processor. As part of our overall data protection compliance program, including with respect to data protection laws in the EU, we are one of the few companies in the world to have implemented Binding Corporate Rules (“BCRs”). Compliance with our BCRs permits us to process and transfer personal data across borders in accordance with the GDPR and other data protection laws in the EU. The\n \nCPRA requires companies to provide data disclosure, access, deletion and opt-out rights to consumers in California. The DOJ’s Data Security Program requires us to ensure that there is not access to sensitive personal data of U.S. persons by countries of concern in excess of certain thresholds. In the area of AI, some states and localities in the U.S., the EU and elsewhere have proposed or already enacted legislation that imposes obligations on how we develop and market AI-based products and solutions. Specifically, the EU Artificial Intelligence Act imposes requirements on providers of certain types of AI services. Additionally, self-regulatory frameworks like the National Institute of Standards and Technology AI Risk Management Framework are being promulgated and adherence to these may become an industry standard or client expectation. In the United States, the Health Insurance Portability and Accountability Act of 1996 applies to our insurance services businesses and ADP TotalSource.\nAs part of our payroll and payroll tax management services, we move client funds to our clients’ employees, tax authorities and other payees via electronic transfer, direct deposit, prepaid access and ADPCheck. In 2019, the Office of the Comptroller of Currency (the “OCC”) authorized us to open ADP Trust Company, National Association (the “ADP Trust Bank”), via a national trust bank charter pursuant to the National Bank Act. The ADP Trust Bank is the sole trustee of ADP Client Trust, our grantor trust which holds U.S. client funds, and is responsible for the oversight and management of those client funds. The ADP Trust Bank, and all of its fiduciary activities including the U.S. money movement it oversees and manages via ADP Client Trust, is subject to comprehensive ongoing oversight and regulation by the OCC. In addition, our U.S. money movement managed by the ADP Trust Bank and our U.S. prepaid access offering \nare subject to the anti-money laundering and reporting provisions of The Bank Secrecy Act of 1970, as amended by the USA PATRIOT Act of 2001 (the “BSA”). Our prepaid access offerings are subject to consumer protection laws and regulations, including the Electronic Funds Transfer Act and Regulation E issued by the Consumer Financial Protection Bureau as well as prohibitions on unfair, deceptive, or abusive acts or practices. Consumer protections for prepaid accounts under Regulation E include requirements related to pre-acquisition fee and other disclosures, error resolution and investigation, and account access. Elements of our money movement activities outside of the United States are subject to licensing and similar anti-money laundering and reporting laws and requirements in certain countries in which we provide such services. In February 2024, ADP Canada Co. became a registered entity with the Financial Transactions and Reports Analysis Centre of Canada (“FINTRAC”), Canada’s anti-money laundering and anti-terrorist financing supervisor, as a Money Service Business as a result of a change in policy guidance from FINTRAC related to the Canadian Proceeds of Crime (Money Laundering) and Terrorist Financing Act. In November 2024, ADP Canada Co. filed its application for registration with the Bank of Canada as a Payment Services Provider, as defined and required under the Retail Payment Activities Act.\nOur employee background screening services business offers background checking services that are subject to the Fair Credit Reporting Act. ADP TotalSource is subject to various state licensing requirements and, as a Certified PEO, maintains certifications with the Internal Revenue Service. Because ADP TotalSource is a co-employer with respect to its clients’ worksite employees, we may be subject to certain obligations, responsibilities and liabilities of an employer under federal and state tax, insurance and employment laws, including worksite employee payroll obligations and with respect to claimed employee retention and other tax credits. ADP Strategic Plan Services, LLC, our registered investment adviser, provides certain investment management and advisory services to retirement plan administrators under a heightened “fiduciary” standard and is regulated by the SEC and the U.S. Department of Labor. ADP Broker-Dealer, Inc., which supports our Retirement Services business, is a registered broker-dealer regulated by the SEC and the Financial Industry Regulatory Authority. ADP Retirement Trust Services, LLC supports our Retirement Services business as a New Hampshire state-chartered trust company. ADP Retirement Trust Services, LLC is a directed-fiduciary trustee with responsibility for oversight of the retirement plan assets of our clients and regulated by the Department of Labor under the Employee Retirement Income Security Act of 1974, as amended, and is also subject to the oversight of the New Hampshire Banking Department.\nOur current and future offerings in the payments and/or consumer space may also subject us to additional laws and regulations, which could also require corresponding compliance programs and policies and dedicated resources.\n12\nIn addition, many of our businesses offer solutions that assist our clients in complying with certain U.S. and foreign laws and regulations that apply to them. Although these laws and regulations apply to our clients and not to ADP, changes in such laws or regulations may affect our operations, products and services. For example, our payroll services are designed to facilitate compliance with state laws and regulations applicable to the payment of wages. In addition, our HCM solutions help clients manage their compliance with certain requirements of the Affordable Care Act in the United States. Similarly, our Tax Credit Services business, which helps clients in the United States realize tax credit opportunities in connection with the hiring of new employees and certain other activities, is based on federal, state or local tax laws and regulations allowing for tax credits, which are subject to renewal, amendment or rescission.\nWe believe that key components of our compliance programs provide real competitive differentiators. For instance, our BCRs have enabled ADP to apply a global standard of data protection, simplifying data transfer processes and assisting our clients in meeting the demanding standards of data protection expected in Europe – a solution that most competitors cannot provide. Similarly, the ADP Client Trust and ADP Trust Bank provide client funds with a level of protection that most competitors cannot offer. \nThe foregoing description does not include an exhaustive list of the laws and regulations governing or impacting our business. See the discussion contained in the “Risk Factors” section in Part I, Item 1A of this Annual Report on Form 10-K for information regarding changes in laws and regulations that could have a materially adverse effect on our reputation, results of operations or financial condition or have other adverse consequences.\nCLIENTS AND CLIENT CONTRACTS\nWe provide services to more than 1.1 million clients. In fiscal 2025, no single client or group of affiliated clients accounted for revenues in excess of 2% of our annual consolidated revenues.\nWe are continuously in the process of performing implementation services for new clients. Depending on the service agreement and/or the size of the client, the installation or conversion period for new clients can vary from a short period of time for a small Employer Services client (as little as 24 hours) to a longer period for a large Employer Services client with multiple deliverables (generally six to nine months). In some cases, based on a client's timeline, the period may exceed two years for a large, multi-country ADP Global Payroll or ADP Lyric HCM client or other large, multi-phase implementation. Although we monitor sales that have not yet been installed, \nwe do not view this metric as material to an understanding of our overall business in light of the recurring nature of our business. This metric is not a reported number, but it is used by management as a planning tool to allocate resources needed to install services, and as a means of assessing our performance against the expectations of our clients. In addition, some of our products and services are sold under longer-term contracts with initial terms typically ranging from two to seven years. However, this anticipated future revenue under contract is not a significant portion of our expected future revenue, is not a meaningful indicator of our future performance and is not material to management's estimate of our future revenue.\nOur business is typically characterized by long-term client relationships that result in recurring revenue. Our services are provided under written price quotations or service agreements having varying terms and conditions. No one price quotation or service agreement is material to us. Based on our retention levels in fiscal 2025, our client retention is estimated at approximately 13 \nyears\n in Employer Services, and approximately 6\n years\n in PEO.  \nPRODUCT DEVELOPMENT\nWe continually upgrade, enhance, and expand our solutions and services. In general, new solutions and services supplement rather than replace our existing solutions and services and, given our recurring revenue model, do not have a material and immediate effect on our revenues. We believe that our strategic solutions and services have significant remaining life cycles.\nRESEARCH AND DEVELOPMENT\nDuring the fiscal years ended June 30, 2025, 2024 and 2023, we invested approximately $1.388 billion, $1.276 billion, and $1.195 billion, respectively, in research and development. These investments include expenses for activities such as the development of new products, maintenance expenses associated with our existing technologies, investments in generative AI, purchases of \n13\nnew software and software licenses, and additions to software resulting from business combinations.\nLICENSES\nWe are the licensee under a number of agreements for computer programs and databases. Our business is not dependent upon a single license or group of licenses. Third-party licenses, patents, trademarks, and franchises are not material to our business as a whole.\nOUR PEOPLE AND CULTURE \nOur HCM strategy is simple: our people have differentiated us for over 75 years and we remain committed to valuing, developing and engaging them. \nOur Chief Human Resources Officer (“CHRO\n”\n), together with our Executive Leadership Team, manages our HCM strategy and related programs and initiatives, as well as our talent strategy. Our CHRO, along with our CEO, as appropriate, regularly updates and supports our Compensation and Management Development Committee of the Board (“CMDC”) as well as the Board of Directors on HCM matters. The CMDC is responsible for these matters, as well as our executive compensation program, company-wide equity-based plans, and our management succession planning and development program.\n \nOur Associates \nAs of \nJune 30, 2025\n, our global team of associates consisted of approximately 67,000 persons. \nOur Culture and Values\nOver seventy-five years ago, our founders established values that still guide us today. We seek to create a values-based culture where every associate feels like they belong and can thrive. \nOur long-term business success is closely linked to our commitment to creating an environment in which our associates can achieve their full potential, and to do so we listen to and engage our associates. We conduct an annual culture survey, myVoice, where our associates can share their perspectives on important topics, including client service, culture, social responsibility, ethics and compliance, innovation and leadership. Along with many of our world-class clients, we leverage our innovative StandOut\n®\n powered by ADP platform, to help managers drive talent engagement throughout the year. We issue quarterly global StandOut® Engagement Pulse® surveys to ensure that all associates can share with their leaders how they feel about their work and their colleagues, and for us to get a snapshot of engagement across the globe.  \nThrough our myMoment Recognition Program, we give our associates the opportunity to recognize and celebrate each other when they demonstrate our values, drive our \ngoals and go above and beyond in contributing to our collective success. Our global ADP Cares program, which is funded by the ADP Foundation and our generous associates, helps members of our team get through difficult, unforeseen events such as natural disasters and major illnesses. We also proudly support our associates that give back to our communities through paid volunteer time off and our donation matching program.\nWe value different perspectives and believe that our associates and their best ideas thrive in a diverse and inclusive environment.\nWe have a number of initiatives to strengthen and further cultivate our values-based culture. As an example, ADP’s Global IDEB Impact Council was created to align and amplify our inclusion efforts, providing us with an advantage to attract and retain associates and clients. The council, comprised of senior leaders across the enterprise, was designed to focus across four pillars, including Technology & Innovation, Culture & Belonging, Business Practices and Talent Practices. Our voluntary business resource groups, which cover a broad array of associates and are open to all that share common interests and experiences, make us stronger by promoting inclusion and cultural awareness, accelerating associate engagement, retention and career development, helping build relationships in our communities, and promoting the conservation and restoration of natural resources.  \nAt ADP, we are committed to upholding fair and equitable pay. Pay equity is critical to creating a culture that enables all associates to reach their full potential. We make pay decisions based on skills, job-related experience, the market value of the job and performance. We have incorporated regular pay equity reviews into our compensation decisions. And, we do not ask candidates to provide their salary history in most of the countries where we operate.\n14\nOur commitment to building a better world of work and creating a workplace where everyone can thrive has led to recognition across the globe, including Fortune’s World’s Most Admired Companies (19 consecutive years); Forbes’ America’s Best Large Employers; Fortune’s America’s Most Innovative Companies; Fast Company’s Best Workplaces for Innovators; TIME’s World’s Best Companies; and Newsweek’s Most Trustworthy Companies in America.\nOur Talent Strategy\nOur talent strategy is simple – we aim to attract, develop and retain ambitious, passionate and overall top talent by offering a place where our associates can grow their careers, challenge themselves, share generously, take risks, and create positive change. This has allowed us to be recognized by esteemed organizations as an employer of choice year after year. \nWe invest in our team members so that they have the skills necessary to succeed and grow their careers. The ADP talent journey begins with an innovative, engaging and comprehensive onboarding process followed by extensive training and mentorship. Thereafter, our associates can access a wide range of professional and functional skills training to further continue and enhance performance and career development. Our sales professionals are provided with award-winning training programs and tools throughout their careers, and we also provide our technologists with access to training and experiences in the latest technologies on the market. We know our people leaders have tremendous impact on our associates and clients, and so we invest in a leadership development strategy that uses innovative approaches to support new and experienced leaders with formal learning, tools to understand and engage their team, and in the moment support during moments that matter. Additionally, our succession planning process deploys leaders to new career experiences that help ensure we are developing executives that will deliver results now and in the future.\nOur Benefits and Health and Wellness Programs\nThe wide range of benefits and health and wellness programs we offer contribute to an environment where all our associates add to our success. Our associates receive a competitive benefits package, intended to help them enjoy physical, emotional and financial well-being and be productive members of their teams. While exact benefits vary by associate and region, they typically include health care coverage, a 401(k) plan with company matching contributions for U.S. associates, life insurance, paid time off and tuition reimbursement. We particularly emphasize benefits that support individual and family needs (parental leave, adoption/fertility benefits and caregiver support), and constantly update our programs according to our associates’ needs.\nWe offer physical and mental wellness programs that help our team pursue a healthy lifestyle and reduce absenteeism and lost time due to injuries. Our efforts include a company-wide health and safety manual and website, safety education and training, and a wellness program that rewards associates for completing wellness activities. Physical and mental health initiatives vary across regions, but can include personal health checks, nutrition and fitness expert visits offering free consultation and programs, employee mental wellness assistance programs, free counseling and mental health therapy assistance for associates, and mindfulness classes.  \nAvailable Information\nOur corporate website, \nwww.adp.com\n, provides materials for investors and information about our solutions and services. ADP’s Annual Reports on Form 10-K, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K, all amendments to those reports, and the Proxy Statements for our Annual Meetings of Stockholders are made available, free of charge, on our corporate website as soon as reasonably practicable after such reports have been filed with or furnished to the Securities and Exchange Commission (“SEC”), and are also available on the SEC’s website at \nwww.sec.gov\n. The content on any website referenced in this filing is not incorporated by reference into this filing unless expressly noted otherwise.\n15",
  "item7": "Item 7. Management's Discussion and Analysis of Financial Condition and Results of Operations\nTabular dollars are presented in millions, except per share amounts\nThe following section discusses our year ended June 30, 2025 (“fiscal 2025”), as compared to year ended June 30, 2024 (“fiscal 2024”). A detailed review of our fiscal 2024 performance compared to our fiscal 2023 performance is set forth in Part II, Item 7 of our Form 10-K for the fiscal year ended June 30, 2024. \nFORWARD-LOOKING STATEMENTS\nThis document and other written or oral statements made from time to time by Automatic Data Processing, Inc., its subsidiaries and variable interest entity (“ADP” or the “Company”) may contain “forward-looking statements” within the meaning of the Private Securities Litigation Reform Act of 1995.  Statements that are not historical in nature and which may be identified by the use of words like “outlook,” “expects,” “assumes,” “projects,” “anticipates,” “estimates,” “we believe,” “could,” “is designed to” and other words of similar meaning, are forward-looking statements.  These statements are based on management’s expectations and assumptions and depend upon or refer to future events or conditions and are subject to risks and uncertainties that may cause actual results to differ materially from those expressed.  Factors that could cause actual results to differ materially from those contemplated by the forward-looking statements or that could contribute to such difference include: ADP's success in obtaining and retaining clients, and selling additional services to clients; the pricing of products and services; the success of our new solutions; our ability to respond successfully to changes in technology, including artificial intelligence; compliance with existing or new legislation or regulations; changes in, or interpretations of, existing legislation or regulations; overall market, political and economic conditions, including interest rate and foreign currency trends and inflation; competitive conditions; our ability to maintain our current credit ratings and the impact on our funding costs and profitability; security or cyber breaches, fraudulent acts, and system interruptions and failures; employment and wage levels; availability of \n28\nskilled associates; the impact of new acquisitions and divestitures; the impact of any uncertainties related to major natural disasters or catastrophic events; and supply-chain disruptions. ADP disclaims any obligation to update any forward-looking statements, whether as a result of new information, future events, or otherwise, except as required by law.  These risks and uncertainties, along with the risk factors discussed under “Item 1A. Risk Factors”, and in other written or oral statements made from time to time by ADP, should be considered in evaluating any forward-looking statements contained herein.\nNON-GAAP FINANCIAL MEASURES\nIn addition to our U.S. GAAP results, we use adjusted results and other non-GAAP metrics to evaluate our operating performance in the absence of certain items and for planning and forecasting of future periods. Adjusted EBIT, adjusted EBIT margin, adjusted net earnings, adjusted diluted earnings per share, adjusted effective tax rate and organic constant currency are all non-GAAP financial measures. Please refer to the accompanying financial tables in the “Non-GAAP Financial Measures” section for a discussion of why ADP believes these measures are important and for a reconciliation of non-GAAP financial measures to their nearest comparable GAAP financial measures.\nEXECUTIVE OVERVIEW \nAs a global leader in HR and payroll solutions, ADP continuously aims to solve complex business challenges for our clients and their workers. Our Human Capital Management (\"HCM\") solutions, which include both software and outsourcing services, are designed to help our clients manage their workforce through a dynamic business and regulatory landscape and the changing world of work. We see tremendous opportunity ahead as we focus on our three key Strategic Priorities: Leading with Best-in-Class HCM technology, Providing Unmatched Expertise and Outsourcing Solutions, and Leveraging our Global Scale for the Benefit of our Clients. \nDuring fiscal 2025, we continued to make meaningful progress on our Strategic Priorities. We launched ADP Lyric HCM, an all-in-one solution designed to address workplace challenges with personalized experiences that meet client needs. We acquired WorkForce Software, a premier workforce management solutions provider, and began to integrate it into our global HCM ecosystem to better serve large, global enterprises. We enhanced our distribution network by launching an integrated payroll solution for small businesses. We augmented our global payroll capabilities by continuing to expand our offerings in markets with exciting growth opportunities like Japan and Saudi Arabia, and by acquiring payroll businesses like PEI (Procesamiento Externo de Informacion, S.C.) in Mexico. Lastly, we continued deploying AI tools in our products and across our sales, service, and research and development functions to improve the client experience and drive internal productivity gains. \nHighlights from the year ended June 30, 2025 include:\n•\nRevenue growth of 7% to $20,560.9 million; 7% growth on an organic constant currency\n•\nEarnings before income taxes margin expansion of 50 bps, and adjusted EBIT margin expansion of 50 bps \n•\nDiluted and adjusted diluted earnings per share (\"EPS\") growth of 10% and 9%, respectively, to $9.98 and $10.01, respectively\n•\nCash returned via shareholder friendly actions of $3.7B, including $2.4B of dividends and $1.3B of share repurchases\nFor fiscal 2025, we delivered strong revenue growth of 7% both on a reported and organic constant currency basis. Our pays per control metric, which represents the number of employees on ADP clients' payrolls in the United States when measured on a same-store-sales basis for a subset of clients ranging from small to large businesses, grew 1% for the year ended June 30, 2025 as compared to the year ended June 30, 2024. PEO average worksite employees increased 3% for the year ended June 30, 2025, as compared to the year ended June 30, 2024. Additionally, our ES new business bookings grew 3% in fiscal 2025, and ES client revenue retention was 92.1%. Our strong retention stems in part from our company-wide client satisfaction scores reaching new record highs for the year. These impressive client satisfaction results were broad-based and are a testament to the product investments we are making to improve the client experience.\nWe have a strong business model, generating significant cash flows with low capital intensity, and offer a suite of products that provide critical support to our clients’ HCM functions. We generate sufficient free cash flow to satisfy our cash dividend and our modest debt obligations, which enables us to absorb the impact of downturns and remain steadfast in our long term strategy and commitments to shareholder friendly actions. We are committed to building upon our past successes by investing in our business through enhancements in research and development and by driving meaningful transformation in the way we operate.\n Our financial condition remains solid at June 30, 2025 and we remain well positioned to support our associates and our clients.\n29\nRESULTS AND ANALYSIS OF CONSOLIDATED OPERATIONS\nTotal Revenues\nFor the year ended June 30, respectively:\nYears Ended\nJune 30,\n2025\n2024\nTotal Revenues\n$\n20,560.9 \n$\n19,202.6 \n  YoY Growth\n7 \n%\n7 \n%\n  YoY Growth, Organic Constant Currency\n7 \n%\n6 \n%\nRevenues increased in fiscal 2025 due to new business started from new business bookings, strong client retention, an increase in zero-margin benefits pass-throughs, an increase in pricing, an increase in interest on funds held for clients, and the impact from the WorkForce Software acquisition. Refer to “Analysis of Reportable Segments” for additional discussion of the changes in revenue for each of our reportable segments, Employer Services and Professional Employer Organization (“PEO”) Services. \nTotal revenues for fiscal 2025 include interest on funds held for clients of $1,189.1 million, as compared to $1,024.7 million in fiscal 2024. The increase in interest earned on funds held for clients resulted from an increase in our average interest rate earned to 3.2% in fiscal 2025, as compared to 2.9% in fiscal 2024, coupled with an increase in our average client funds balances of 6.4% to $37.6 billion in fiscal 2025 as compared to fiscal 2024. \nTotal Expenses\nYears Ended\nJune 30,\n \n2025\n2024\n%\nChange\nCosts of revenues:\n \n \nOperating expenses\n$\n9,622.7 \n$\n9,050.1 \n6 \n%\nResearch and development\n988.6 \n955.7 \n3 \n%\nDepreciation and amortization\n486.0 \n470.9 \n3 \n%\nTotal costs of revenues\n11,097.3 \n10,476.7 \n6 \n%\nSelling, general and administrative expenses\n4,051.7 \n3,778.9 \n7 \n%\nInterest expense\n455.9 \n361.4 \n26 \n%\nTotal expenses\n$\n15,604.9 \n$\n14,617.0 \n7 \n%\nFor the year ended June 30:\nOperating expenses increased in fiscal 2025 due to an increase of $313.1 million of PEO Services zero-margin benefits pass-through costs to $4,289.0 million in fiscal 2025 from $3,975.9 million in fiscal 2024. Additionally, operating expenses increased by $137.3 million due to higher service and implementation costs in support of our growing revenue and by $67.8 million due to an increase in costs related to workers' compensation coverage and state unemployment taxes for worksite employees.\nResearch and development expenses increased in fiscal 2025 due to increased costs to develop, support, and maintain our new and existing products and the WorkForce Software acquisition.\nDepreciation and amortization increased in fiscal 2025 due to the WorkForce Software acquisition, amortization of investments in internally developed software primarily for our next-gen products, and amortization of purchased software, partially offset by lower amortization of customer contracts and lists.\n30\nSelling, general and administrative expenses increased in fiscal 2025 primarily due to increases in selling and marketing expenses of $184.4 million as a result of investments in our sales organization and an increase from acquisition related costs.\nInterest expense increased in fiscal 2025 primarily due to an increase of $51.1 million related to commercial paper and reverse repurchase borrowings as a result of increases in \naverage daily commercial paper borrowings of \n$0.6 billion, \nand average reverse repurchase outstanding balances of \n$1.1 billion, as \ncompared to fiscal \n2024\n, \noffset by decreases in average interest rates on commercial paper issuances and reverse repurchases of 50 basis points and 70 basis points, respectively, as compared to fiscal 2024. Additionally, interest expense increased by $37.9 million related to the issuance of $1.0 billion of senior notes during the first quarter ended September 30, 2024.\nOther (Income)/Expense, net\nYears ended June 30,\n2025\n2024\n$ Change\nInterest income on corporate funds\n$\n(319.5)\n$\n(241.3)\n$\n78.2 \nRealized losses on available-for-sale securities, net\n1.7 \n5.9 \n4.2 \nGain on sale of assets\n(5.0)\n(17.1)\n(12.1)\nNon-service components of pension income, net\n(31.3)\n(34.2)\n(2.9)\nOther income, net\n$\n(354.1)\n$\n(286.7)\n$\n67.4 \nInterest income on corporate funds increased in fiscal 2025 due to higher average investment balances of $9.2 billion as compared to $7.4 billion in fiscal 2024, coupled with an increase in average interest rates of 20 basis points, as compared to fiscal 2024. See Note 11 of our Consolidated Financial Statements for further details on non-service components of pension income, net.\nIn fiscal 2025, the gain on sale of assets of $5.0 million related to sales of buildings.\nEarnings Before Income Taxes (\"EBIT\") and Adjusted EBIT\n \nFor the year ended June 30, respectively:\nYears Ended\nJune 30,\n2025\n2024\nYoY Growth\nEBIT\n$\n5,310.1 \n$\n4,872.3 \n9 \n%\n  EBIT Margin\n25.8 \n%\n25.4 \n%\n50 bps\nAdjusted EBIT\n$\n5,347.1 \n$\n4,890.1 \n9 \n%\n  Adjusted EBIT Margin\n26.0 \n%\n25.5 \n%\n50 bps\nNote: Numbers may not foot due to rounding.\nEarnings before income taxes increased in fiscal 2025 due to the increases in total revenues, partially offset by the increases in total expenses discussed above.  \nEBIT Margin increased in fiscal 2025 due to contributions from client funds interest revenues, discussed above, and operating efficiencies for costs of servicing and implementing our clients on growing revenue, partially offset by increased interest expense and acquisition related expenses.\nAdjusted EBIT and Adjusted EBIT margin exclude interest income and interest expense that are not related to our client funds\nextended investment strategy, and net charges, including certain legal matters, gain on sale of assets, and broad-based optimization initiatives, in the applicable periods.\n31\nProvision for Income Taxes\nThe \neffective tax rate in fiscal 2025 and 2024 was \n23.2%\n and 23.0%, respectively.\n The increase in the effective tax rate is primarily due to higher reserves for uncertain tax positions in fiscal 2025 and a valuation allowance release in fiscal 2024 offset by an increase in the excess tax benefit on stock-based compensation in fiscal 2025. Refer to Note 12, Income Taxes, within the Notes to the Consolidated Financial Statements for further discussion.\nAdjusted Provision for Income Taxes\nThe adjusted effective tax rate in fiscal 2025 and 2024 was 23.2% and 23.0%, respectively. The drivers of the adjusted effective tax rate are the same as the drivers of the effective tax rate discussed above.\nNet Earnings and Diluted EPS, Unadjusted and Adjusted\nFor the year ended June 30, respectively:\nYears Ended\nJune 30,\n2025\n2024\nYoY Growth\nNet earnings  \n$\n4,079.7 \n$\n3,752.0 \n9 \n%\nDiluted EPS  \n$\n9.98 \n$\n9.10 \n10 \n%\nAdjusted net earnings\n$\n4,092.0 \n$\n3,784.5 \n8 \n%\nAdjusted diluted EPS\n$\n10.01 \n$\n9.18 \n9 \n%\nFor fiscal 2025, in addition to the increase in net earnings, diluted EPS increased as a result of the impact of fewer shares outstanding resulting from the repurchase of approximately 4.4 million shares during fiscal 2025 and 5.1 million shares during fiscal 2024, partially offset by the issuances of shares under our employee benefit plans.\nFor fiscal 2025, adjusted net earnings and adjusted diluted EPS reflect the changes in components described above.\n32\nANALYSIS OF REPORTABLE SEGMENTS\nRevenues\nYears Ended\nJune 30,\n% Change\n \n2025\n2024\nAs Reported\nOrganic Constant Currency\nEmployer Services\n$\n13,883.1 \n$\n12,980.8 \n7 \n%\n6 \n%\nPEO Services\n6,690.4 \n6,233.6 \n7 \n%\n7 \n%\nOther\n(12.6)\n(11.8)\nn/m\nn/m\n$\n20,560.9 \n$\n19,202.6 \n7 \n%\n7 \n%\nEarnings before Income Taxes\nYears Ended\nJune 30,\n% Change\n \n2025\n2024\nAs Reported\nEmployer Services\n$\n5,008.5 \n$\n4,555.5 \n10 \n%\nPEO Services \n950.5 \n921.5 \n3 \n%\nOther\n(648.9)\n(604.7)\nn/m\n$\n5,310.1 \n$\n4,872.3 \n9 \n%\nMargin\nYears Ended\nJune 30,\n \n2025\n2024\nYoY Growth\nEmployer Services\n36.1 \n%\n35.1 \n%\n100 bps\nPEO Services\n14.2 \n%\n14.8 \n%\n(60) bps\nn/m - not meaningful\nEmployer Services\nRevenues\nEmployer Services' revenues increased in fiscal 2025 due to new business started from new business bookings, strong client retention, an increase in pricing, an increase in interest earned on funds held for clients, the impact from the WorkForce Software acquisition, and an increase in the volume of our pays per control of 1%, as compared to fiscal 2024.\nEarnings before Income Taxes\nEmployer Services' earnings before income taxes increased in fiscal 2025 due to increased revenues, including contributions from client funds interest, discussed above, and operating efficiencies for costs of servicing and implementing our clients on growing revenue, partially offset by increased selling and marketing expenses and the impact from the WorkForce Software acquisition.\nMargin\nEmployer Services' margin increased in fiscal 2025 due to contributions from operating efficiencies for costs of servicing and implementing our clients on growing revenue, and client funds interest revenues discussed above, partially offset by acquisition related expenses.\n33\nPEO Services\nRevenues\nPEO Revenues\nYears Ended\nChange\nJune 30,\n \n2025\n2024\n$\n%\nPEO Services' revenues\n$\n6,690.4 \n$\n6,233.6 \n$\n456.8 \n7 \n%\nLess: PEO zero-margin benefits pass-throughs\n4,289.0 \n3,975.9 \n313.1 \n8 \n%\nPEO Services' revenues excluding zero-margin benefits pass-throughs\n$\n2,401.4 \n$\n2,257.7 \n$\n143.7 \n6 \n%\nPEO Services' revenues increased in fiscal 2025 due to the increase in zero-margin benefits pass-throughs, and an increase in average worksite employees of 3%, as compared to fiscal 2024.\nEarnings before Income Taxes\nPEO Services’ earnings before income taxes increased in fiscal 2025 due to increased revenues discussed above, partially offset by increases in operating costs related to workers' compensation and state unemployment insurance, zero-margin benefits pass-through costs, and selling and marketing expenses.\nMargin\nPEO Services' margin decreased in fiscal 2025 due to increases in zero-margin benefits pass-through costs, operating costs related to workers' compensation and state unemployment insurance, and selling and marketing expenses, partially offset by an increase in the pre-tax benefit from ADP Indemnity.\nADP Indemnity provides workers’ compensation and employer's liability deductible reimbursement insurance protection for PEO Services’ worksite employees up to $1 million per occurrence. PEO Services has secured a workers’ compensation and employer’s liability insurance policy that caps the exposure for each claim at $1 million per occurrence and has also secured  aggregate stop loss insurance that caps aggregate losses at a certain level in fiscal years 2012 and prior from an admitted and licensed insurance company of AIG. We utilize historical loss experience and actuarial judgment to determine the estimated claim liability, and changes in estimated ultimate incurred losses are included in the PEO segment. \nAdditionally, starting in fiscal year 2013, ADP Indemnity paid premiums to enter into reinsurance arrangements with ACE American Insurance Company, a wholly-owned subsidiary of Chubb Limited (“Chubb”), to cover substantially all losses incurred by the Company up to the \n$1 million per occurrence related to the workers\n’\n compensation and employer's liability deductible reimbursement insurance protection for PEO Services' worksite employees. \nEach of these reinsurance arrangements limits our overall exposure incurred up to a certain limit. The Company believes the likelihood of ultimate losses exceeding this limit is remote. \nDuring fiscal 2025, \nADP Indemnity paid a premium of $276 million to enter into a reinsurance arrangement with Chubb to cover substantially all losses incurred by ADP Indemnity for the fiscal 2025 policy year up to $1 million per occurrence. ADP Indemnity recorded a pre-tax benefit of approximately $10 million in fiscal 2025 and a pre-tax benefit of approximately $3 million in fiscal 2024, which were primarily the results of more favorable actuarial loss development in workers’ compensation reserves. ADP Indemnity paid a premium of $278 million in July 2025, to enter into a reinsurance agreement with Chubb to cover substantially all losses incurred by ADP Indemnity for fiscal 2026 policy year on terms substantially similar to the fiscal 2025 reinsurance policy.\nOther\nThe primary components of “Other” are certain corporate overhead charges and expenses that have not been allocated to the reportable segments, including corporate functions, severance costs, non-recurring gains and losses, the elimination of intercompany transactions, and all other interest income and expense.\n34\nNon-GAAP Financial Measures\nIn addition to our GAAP results, we use the adjusted results and other non-GAAP metrics set forth in the table below to evaluate our operating performance in the absence of certain items and for planning and forecasting of future periods: \nAdjusted Financial Measures\nU.S. GAAP Measures\nAdjusted EBIT\nNet earnings  \nAdjusted provision for income taxes \nProvision for income taxes\nAdjusted net earnings  \nNet earnings  \nAdjusted diluted earnings per share  \nDiluted earnings per share\nAdjusted effective tax rate \nEffective tax rate\nOrganic constant currency\nRevenues\nWe believe that the exclusion of the identified items helps us reflect the fundamentals of our underlying business model and analyze results against our expectations and against prior periods, and to plan for future periods by focusing on our underlying operations. We believe that the adjusted results provide relevant and useful information for investors because it allows investors to view performance in a manner similar to the method used by management and improves their ability to understand and assess our operating performance.  The nature of these exclusions is for specific items that are not fundamental to our underlying business operations.  Since these adjusted financial measures and other non-GAAP metrics are not measures of performance calculated in accordance with U.S. GAAP, they should not be considered in isolation from, as a substitute for, or superior to their corresponding U.S. GAAP measures, and they may not be comparable to similarly titled measures at other companies.\n35\nYears Ended\nJune 30,\n% Change\n2025\n2024\nAs Reported\nNet earnings\n$\n4,079.7 \n$\n3,752.0 \n9 \n%\nAdjustments:\nProvision for income taxes\n1,230.4 \n1,120.3 \nAll other interest expense (a)\n114.8 \n71.4 \nAll other interest income (a)\n(94.2)\n(97.0)\nGain on sale of assets\n(2.6)\n— \nTransformation initiatives (b)\n0.1 \n5.4 \nLegal settlements (c)\n(0.4)\n(4.0)\nOptimization initiatives (d)\n19.3 \n42.0 \nAdjusted EBIT\n$\n5,347.1 \n$\n4,890.1 \n9 \n%\nAdjusted EBIT Margin\n26.0 \n%\n25.5 \n%\nProvision for income taxes\n$\n1,230.4 \n$\n1,120.3 \n10 \n%\nAdjustments:\nGain on sale of assets (e)\n(0.6)\n— \nTransformation initiatives (e)\n— \n1.3 \nLegal settlements (e)\n(0.1)\n(0.9)\nOptimization initiatives (e)\n4.8 \n10.5 \nAdjusted provision for income taxes\n$\n1,234.5 \n$\n1,131.2 \n9 \n%\nAdjusted effective tax rate (f)\n23.2 \n%\n23.0 \n%\nNet earnings\n$\n4,079.7 \n$\n3,752.0 \n9 \n%\nAdjustments:\nGain on sale of assets\n(2.6)\n— \nIncome tax provision on gain on sale of assets (e)\n0.6 \n— \nTransformation initiatives (b)\n0.1 \n5.4 \nIncome tax benefit for transformation initiatives (e)\n— \n(1.3)\nLegal settlements (c)\n(0.4)\n(4.0)\nIncome tax provision for legal settlements (e)\n0.1 \n0.9 \nOptimization initiatives (d)\n19.3 \n42.0 \nIncome tax benefit for optimization initiatives (e)\n(4.8)\n(10.5)\nAdjusted net earnings\n$\n4,092.0 \n$\n3,784.5 \n8 \n%\nDiluted EPS\n$\n9.98 \n$\n9.10 \n10 \n%\nAdjustments:\nTransformation initiatives (b) (e)\n— \n0.01 \nLegal settlements (c) (e)\n— \n(0.01)\nOptimization initiatives (d) (e)\n0.03 \n0.08 \nAdjusted diluted EPS\n$\n10.01 \n$\n9.18 \n9 \n%\n(a) In adjusted EBIT, we include the interest income earned on investments associated with our client funds extended investment strategy and interest expense on borrowings related to our client funds extended investment strategy as we believe these amounts to be fundamental to the underlying operations of our business model. The adjustments in the table above represent the interest income and interest expense that are not related to our client funds extended investment strategy and are labeled as “All other interest expense” and “All other interest income.”\n(b) The charges in fiscal 2024 include consulting costs relating to our company-wide transformation initiatives.\n(c) In fiscal 2024, this represents reserve reversal of a legal matter from fiscal 2023.\n36\n(d) In fiscal 2025, there were $23.9 million of severance charges related to broad-based, company-wide initiatives, including efforts to align resources with respect to our new global HCM products, offset by a $4.6 million partial reversal of the workforce optimization initiative from fiscal 2024. Severance charges have been taken in the past and not included as an adjustment to get to adjusted results. Unlike severance charges in prior periods, these specific charges relate to broad-based, company-wide initiatives.\n(e) The income tax (benefit)/provision was calculated based on the marginal rate in effect for the year ended June 30, 2025.\n(f) The adjusted effective tax rate is calculated as our adjusted provision for income taxes divided by the sum of our adjusted net earnings plus our adjusted provision for income taxes.\nThe following table reconciles our reported growth rates to the non-GAAP measure of organic constant currency, which excludes the impact of acquisitions, the impact of dispositions, and the impact of foreign currency. The impact of acquisitions and dispositions is calculated by excluding the current year revenues of acquisitions until the one-year anniversary of the transaction and by excluding the prior year revenues of divestitures for the one-year period preceding the transaction.  The impact of foreign currency is determined by calculating the current year results using foreign exchange rates consistent with the prior year. The PEO segment is not impacted by acquisitions, dispositions or foreign currency. \nYear Ended\nJune 30,\n2025\nConsolidated revenue growth as reported\n7 \n%\nAdjustments:\nImpact of acquisitions\n(1)\n%\nImpact of foreign currency\n— \n%\nConsolidated revenue growth, organic constant currency\n7\n \n%\nEmployer Services revenue growth as reported\n7 \n%\nAdjustments:\nImpact of acquisitions\n(1)\n%\nImpact of foreign currency\n— \n%\nEmployer Services revenue growth, organic constant currency\n6\n \n%\nNote: Numbers may not foot due to rounding.\nFINANCIAL CONDITION, LIQUIDITY AND CAPITAL RESOURCES\nAs of June 30, 2025, cash and cash equivalent\ns\n were $3.3 billion, which were primarily invested in time deposits and money market funds.\nFor corporate liquidity, we expect existing cash, cash equivalents, marketable securities, cash flow from operations together with our \n$10.6 billion\n of committed credit facilities and our ability to access both long-term and short-term debt financing from the capital markets will be adequate to meet our operating, investing, and financing activities, such as regular quarterly dividends, share repurchases, and capital expenditures for the foreseeable future. Our financial condition remains solid at June 30, 2025 and we have sufficient liquidity.\nFor client funds liquidity, we have the ability to borrow through our financing arrangements under our U.S. short-term commercial paper program and our U.S., Canadian and United Kingdom short-term reverse repurchase agreements \n($7.5 billion of which is available on a committed basis in the U.S. as of June 30, 2025)\n, together with our \n$10.6 billion\n of comm\nitted credit facilities and our ability to use corporate liquidity when necessary to meet short-term funding requirements related to client funds obligations.  Please see “Quantitative and Qualitative Disclosures about Market Risk” for a further discussion of the risks related to our client funds extended investment strategy. See Note 9 of our Consolidated Financial Statements for a description of our short-term financing including commercial paper. \n37\nOperating, Investing and Financing Cash Flows\nOur cash flows from operating, investing, and financing activities, as reflected in the Statements of Consolidated Cash Flows are summarized as follows: \nYears ended June 30,\n2025\n2024\n$ Change\nCash provided by (used in):\nOperating activities\n$\n4,939.7 \n$\n4,157.6 \n$\n782.1 \nInvesting activities\n(3,035.0)\n(1,389.0)\n(1,646.0)\nFinancing activities\n(6,973.4)\n(1,431.7)\n(5,541.7)\nEffect of exchange rate changes on cash, cash equivalents, restricted cash, and restricted cash equivalents\n37.3 \n(22.4)\n59.7 \nNet change in cash, cash equivalents, restricted cash, and restricted cash equivalents\n$\n(5,031.4)\n$\n1,314.5 \n$\n(6,345.9)\nNet cash flows provided by operating activities increased due to growth in our business, and net favorable changes in the components of operating assets and liabilities, as compared to fiscal 2024.\nNet cash flows used in investing activities changed due to the acquisition of WorkForce Software with a net cash disbursement of \n \n$1,158.3 million and timing of the net proceeds and purchases of corporate and client funds marketable securities of $523.0 million. \nNet cash flows used in financing activities changed due to a net decrease in the cash flow from client funds obligations of $9,288.1 million, which is due to the timing of impounds from our clients and payments to our clients' employees and other payees, a net increase in cash distributed to our clients that was received from the Internal Revenue Service, and a net increase in payments related to reverse repurchase agreements, partially offset by net proceeds from the issuance and redemption of debt.\nWe purchased approximately 4.4 million shares of our common stock at an average price per share of $289.11 during fiscal 2025, as compared to purchases of 5.1 million shares at an average price per share of $244.04 during fiscal 2024. From time to time, the Company may repurchase shares of its common stock under its authorized share repurchase program. The Company considers several factors in determining when to execute share repurchases, including, among other things, actual and potential acquisition activity, cash balances and cash flows, issuances due to employee benefit plan activity, and market conditions.\n \nCapital Resources and Client Fund Obligations\nWe have $4.0 billion\n of senior unsecured no\ntes with maturity dates in 2028, 2030, 2032, and 2034. We may from time to time revisit the long-term debt market to refinance existing debt, finance investments including acquisitions for our growth, and maintain the appropriate capital structure. However, there can be no assurance that volatility in the global capital and credit markets would not impair our ability to access these markets on terms acceptable to us, or at all.\n See Note 10 of our Consolidated Financial Statements for a description of our senior unsecured notes.\nOur U.S. short-term funding requirements related to client funds are sometimes obtained on an unsecured basis through the issuance of commercial paper, rather than liquidating previously-collected client funds that have already been invested in available-for-sale securities. This commercial paper program provides for the issuance of up to $10.6 billion in aggregate maturity value. Our commercial paper program is rated A-1+ by Standard and Poor’s, Prime-1 (“P-1”) by Moody’s and F1+ by Fitch. These ratings denote the highest quality commercial paper securities. Maturities of commercial paper can range from overnight to up to 364 days. As of\n June 30, 2025, the Company had \n$4.8 billion of commercial paper outstanding, which was \n38\nrepaid in early July 2025. A\ns of \nJune 30, 2024, \nthe Company had \nno\n co\nmmercial paper borrowing outstanding. Details of the borrowings under the commercial paper program are as follows:\nYears ended June 30,\n2025\n2024\nAverage daily borrowings (in billions)\n$\n4.1 \n$\n3.5 \nWeighted average interest rates\n4.8 \n%\n5.3 \n%\nWeighted average maturity (approximately in days)\n2 days\n2 days\n \nOur U.S., Canadian, and United Kingdom short-term funding requirements related to client funds obligations are sometimes obtained on a secured basis through the use of reverse repurchase agreements, which are collateralized principally by government and government agency securities, rather than liquidating previously-collected client funds that have already been invested in available-for-sale securities. These agreements generally have terms ranging from overnight to up to five business days. We have successfully borrowed through the use of reverse repurchase agreements on an as-needed basis to meet short-term funding requirements related to client funds obligations. As of June 30, 2025, we had $7.5 billion available to us on a committed basis under the U.S. reverse repurchase agreements. As of June 30, 2025 and 2024, there were $38.4 million and $385.4 million, respectively, of outstanding obligations related to the reverse repurchase agreements. Details of the reverse repurchase agreements are as follows: \nYears ended June 30,\n2025\n2024\nAverage outstanding balances (in billions)\n$\n2.9 \n$\n1.8 \nWeighted average interest rates\n4.8 \n%\n5.5 \n%\nWe vary the maturities of our committed credit facilities to limit the refinancing risk of any one facility. We have a $4.6 billion, 364-day credit agreement that matures in June 2026 with a one-year term-out option. In addition, we have a five-year $3.5 billion credit facility and a five-year $2.5 billion credit facility maturing in June 2029 and June 2030, respectively, each with an accordion feature under which the aggregate commitment can be increased by $500 million, subject to the availability of additional commitments. The primary uses of the credit facilities are to provide liquidity to the commercial paper program and funding for general corporate purposes, if necessary. We had no borrowings through June 30, 2025 under the credit facilities. We believe that we currently meet all conditions set forth in the revolving credit agreements to borrow thereunder, and we are not aware of any conditions that would prevent us from borrowing part or all of the $10.6 billion available to us under the revolving credit agreements. See Note 9 of our Consolidated Financial Statements for a description of our short-term financing including credit facilities.\nOur investment portfolio does not contain any asset-backed securities with underlying collateral of sub-prime mortgages, alternative-A mortgages, sub-prime auto loans or sub-prime home equity loans, collateralized debt obligations, collateralized loan obligations, credit default swaps, derivatives, auction rate securities, structured investment vehicles or non-investment grade fixed-income securities. We own AAA-rated senior tranches of primarily fixed rate auto loan, credit card, and device payment plan agreement receivables, secured predominantly by prime collateral. All collateral on asset-backed securities is performing as expected through June 30, 2025. In addition, we own U.S. government securities which primarily include debt directly issued by Federal Farm Credit Banks and Federal Home Loan Banks. Our client funds investment strategy is structured to allow us to average our way through an interest rate cycle by laddering the maturities of our investments out to five years (in the case of the extended portfolio) and out to ten years (in the case of the long portfolio). This investment strategy is supported by our short-term financing arrangements necessary to satisfy short-term funding requirements relating to client funds obligations. See Note 5 of our Consolidated Financial Statements for a description of our corporate investments and funds held for clients.\nCapital expenditures in fiscal 2025 were $176.8 million, as compared to $211.7 million in fiscal 2024. We expect capital expenditures in fiscal 2026 to be between $225.0 million and $250.0 million.\nContractual Obligations\nOur contractual obligations at June 30, 2025 relate primarily to operating leases (Note 7) and other arrangements recorded in our balance sheet or disclosed in the notes to our financial statements, including benefit plan obligations (Note 11), liabilities for uncertain tax positions (Note 12), purchase obligations (Note 13), debt obligations (Note 10) and $875.0 million of interest payments on our debt, of which $121.5 million is expected to be paid within one year. \nIn addition to the obligations described above, we had obligations for the remittance of funds relating to our payroll and payroll tax filing services. As of June 30, 2025, the obligations relating to these matters, which are expected to be paid in fiscal 2026,\n \n39\ntotal $31,343.3 million, and were recorded in client funds obligations on our Consolidated Balance Sheets. We had $30,985.7 million of cas\nh and cash e\nquivalents and marketable securities to satisfy such obligations recorded in funds held for clients on our Consolidated Balance Sheets as of June 30, 2025.\nSeparately, ADP Indemnity paid a p\nremium of \n$278.0 million\n in July\n 2025 to enter into a reinsurance agreement with Chubb to cover substantially all losses incurred by ADP Indemnity for the fiscal 2026 policy year. As of June 30, 2025, ADP Indemnity had total assets of $725.4 million to satisfy the actuarially estimated unpaid losses of $665.7 million for the policy years since July 1, 2003. ADP Indemnity paid claims of $6.3 million and $1.1 million, net of insurance recoveries, in fiscal 2025 and 2024, respectively. Refer to the “Analysis of Reportable Segments - PEO Services” above for additional information regarding ADP Indemnity.  \nIn the normal course of business, we also enter into contracts in which we make representations and warranties that relate to the performance of our services and products. We do not expect any material losses related to such representations and warranties.  \nQuantitative and Qualitative Disclosures about Market Risk\nOur overall investment portfolio is comprised of corporate investments (cash and cash equivalents, and marketable securities) and client funds assets (funds that have been collected from clients but have not yet been remitted to the applicable tax authorities, client employees or other payees).\nOur corporate investments are invested in cash and cash equivalents and highly liquid, investment-grade marketable securities. These assets are available for our regular quarterly dividends, share repurchases, capital expenditures and/or acquisitions, as well as other corporate operating purposes. All of our fixed-income securities are classified as available-for-sale securities.\nOur client funds assets are invested with safety of principal, liquidity, and diversification as the primary objectives. Consistent with those objectives, we also seek to maximize interest income and to minimize the volatility of interest income.  Client funds assets are invested in highly liquid, investment-grade marketable securities, with a maximum maturity of 10 years at the time of purchase, and money market securities and other cash equivalents.  \n    \nWe utilize a strategy by which we extend the maturities of our investment portfolio for funds held for clients and employ short-term financing arrangements to satisfy our short-term funding requirements related to client funds obligations. Our client funds investment strategy is structured to allow us to average our way through an interest rate cycle by laddering the maturities of our investments out to five years (in the case of the extended portfolio) and out to ten years (in the case of the long portfolio). As part of our client funds investment strategy, we use the daily collection of funds from our clients to satisfy other unrelated client funds obligations, rather than liquidating previously-collected client funds that have already been invested in available-for-sale securities. In circumstances where we experience a reduction in employment levels due to a slowdown in the economy, we may make tactical decisions to sell certain securities or not reinvest maturing securities in order to reduce the size of the funds held for clients to correspond to client funds obligations. We attempt to minimize the risk of not having funds collected from a client available at the time such client’s obligation becomes due by generally impounding the client's funds by the time we pay such client’s obligation. When we don't impound client funds in advance of paying such client obligations, we are at risk of not recovering such funds or material delay in such recovery. Through our client funds investment strategy and client impounding processes, we have consistently maintained the required level of liquidity to satisfy all of our obligations.\nThere are inherent risks and uncertainties involving our investment strategy relating to our client funds assets. Such risks include liquidity risk, including the risk associated with our ability to liquidate, if necessary, our available-for-sale securities in a timely manner in order to satisfy our client funds obligations. However, our investments are made with the safety of principal, liquidity, and diversification as the primary goals to minimize the risk of not having sufficient funds to satisfy all of our client funds obligations. We also believe we have significantly reduced the risk of not having sufficient funds to satisfy our client funds obligations by consistently maintaining access to other sources of liquidity, including our corporate cash balances, available borrowings under o\nur \n$10.6 billion\n commercial paper program (rated A-1+ by Standard and Poor’s, P-1 by Moody’s, and F1+ by Fitch, the highest possible short-term credit ratings), our ability to engage in reverse repurchase agreement transaction\ns ($7.5 billion of which is available on a committed basis in the U.S. as of June 30, 2025), \nand available borrowings under our $10.6 billion committe\nd credit facilities. The reduced availability of financing during periods of economic turmoil, even to borrowers with the highest credit ratings, may limit our ability to access short-term debt markets to meet the liquidity needs of our business. In addition to liquidity risk, our investments are subject to interest rate risk and credit risk, as discussed below.\n40\nWe have established credit quality, maturity, and exposure limits for our investments. The minimum allowed credit rating at time of purchase for corporate, Canadian government agency and Canadian provincial bonds is BBB, for asset-backed securities is AAA, and for municipal bonds is A. The maximum maturity at time of purchase for BBB-rated securities is 5 years, and for single A rated, AA-rated and AAA-rated securities it is 10 years. Time deposits and commercial paper must be rated A-1 and/or P-1. Money market funds must be rated AAA/Aaa-mf.\nDetails regarding our overall investment portfolio are as follows:\nYears ended June 30, \n2025\n2024\nAverage investment balances at cost:\n \n \nCorporate investments\n$\n9,246.6 \n$\n7,397.1 \nFunds held for clients\n37,631.2 \n35,369.5 \nTotal\n$\n46,877.8 \n$\n42,766.6 \n \n \nAverage interest rates earned exclusive of realized\n   losses/(gains) on:\n \n \nCorporate investments\n3.5 \n%\n3.3 \n%\nFunds held for clients\n3.2 \n%\n2.9 \n%\nTotal\n3.2 \n%\n3.0 \n%\nNet realized losses on available-for-sale securities\n1.7 \n5.9 \n \nAs of June 30:\nNet unrealized pre-tax losses on available-for-sale securities\n$\n(425.7)\n$\n(1,515.8)\nTotal available-for-sale securities at fair value\n$\n33,777.7 \n$\n31,207.5 \nWe are exposed to interest rate risk in relation to securities that mature, as the proceeds from maturing securities are reinvested. Factors that influence the earnings impact of interest rate changes include, among others, the amount of invested funds and the overall portfolio mix between short-term and long-term investments. This mix varies during the fiscal year and is impacted by daily interest rate changes. The annualized interest rate earned on our entire portfolio increased from 3.0% in fiscal 2024 to 3.2% in fiscal 2025. A hy\npothetical chan\nge in both short-term interest rates (e.g., overnight interest rates or the federal funds rate) and intermediate-term interest rates of 25 basis points applied to the estimated average investment balances and any related short-term borrowings would result in approximately an $24 million impact to earnings before income taxes over the ensuing twelve-month period ending June 30, 2026. A hypothetical change in only short-term interest rates of 25 basis points applied to the estimated average short-term investment balances and any related short-term borrowings would result in approximately an $8 million impact to earnings before income taxes over the ensuing twelve-month period ending June 30, 2026.\nWe are exposed to credit risk in connection with our available-for-sale securities through the possible inability of the borrowers to meet the terms of the securities. We limit credit risk by investing in investment-grade securities, primarily AAA-rated and AA- rated securities, as rated by Moody’s, Standard & Poor’s, DBRS for Canadian dollar denominated securities, and Fitch for asset-backed and commercial-mortgage-backed securities. In addition, we limit amounts that can be invested in any security other than U.S. government and government agency, Canadian government, and United Kingdom government securities.\nWe operate and transact business in various foreign jurisdictions and are therefore exposed to market risk from changes in foreign currency exchange rates that could impact our consolidated results of operations, financial position, or cash flows. We manage our exposure to these market risks through our regular operating and financing activities and, when deemed appropriate, through the use of derivative financial instruments. We may use derivative financial instruments as risk management tools and not for trading purposes.\nRECENTLY ISSUED ACCOUNTING PRONOUNCEMENTS\nSee Note 1, Recently Issued Accounting Pronouncements, of Notes to the Consolidated Financial Statements for a discussion of recent accounting pronouncements.\n41\nCRITICAL ACCOUNTING ESTIMATES\nOur Consolidated Financial Statements and accompanying notes have been prepared in accordance with U.S. GAAP. The preparation of these financial statements requires management to make estimates, judgments, and assumptions that affect reported amounts of assets, liabilities, revenues, expenses and other comprehensive income. We continually evaluate the accounting policies and estimates used to prepare the Consolidated Financial Statements. See Note 1 - Summary of Significant Accounting Policies for additional information.  \nThe estimates are based on historical experience and assumptions believed to be reasonable under current facts and circumstances. These estimates require levels of subjectivity and judgment, which could result in actual results differing from our estimates. The Company believes the following are its critical accounting estimates:\nDeferred Costs - Assets Recognized from the Costs to Obtain and Fulfill Contracts\nDescription\nIncremental costs of obtaining a contract (e.g., sales commissions) and cost incurred to implement clients on our solutions (e.g., direct labor) that are expected to be recovered are capitalized and amortized on a straight-line basis over the client retention period, depending on the business unit.\nJudgments and Uncertainties\nThe Company has estimated the amortization periods for deferred costs by using its historical client retention rates by business unit to estimate the pattern during which the service transfers. The expected client relationship period ranges from three to eight years.\nSensitivity of Estimate to Change\nAs the assumptions used to estimate the amortization period of the deferred costs could have a material impact on timing of recognition, we assess the amortization periods annually using historical retention rates. Actual retention rates were not materially different than those used in our calculation to determine the amortization period.  We regularly review our deferred costs for impairment. There were no impairment losses incurred during the fiscal years ended June 30, 2025, June 30, 2024, or June 30, 2023.\nGoodwill\n \nDescription\nGoodwill represents the excess of purchase price over the value assigned to the net tangible and identifiable intangible assets of businesses acquired. Goodwill is tested annually for impairment or more frequently when an event or circumstance indicates that goodwill might be impaired.\nJudgments and Uncertainties\nThe Company’s annual goodwill impairment assessment as of June 30, 2025 was performed for all reporting units using a quantitative approach by comparing the fair value of each reporting unit to its carrying value. We estimated the fair value of each reporting unit using, as appropriate, the income approach, which is derived using the present value of future cash flows discounted at a risk-adjusted weighted-average cost of capital, and the market approach, which is based upon using market multiples of companies in similar lines of business. Significant assumptions used in determining the fair value of our reporting units include projected revenue growth rates, profitability projections, working capital assumptions, the weighted average cost of capital, the determination of appropriate market comparison companies, and terminal growth rates. Several of these assumptions including projected revenue growth rates and profitability projections are dependent on our ability to upgrade, enhance, and expand our technology and services to meet client needs and preferences.   \nSensitivity of Estimate to Change\nSome of the inherent estimates and assumptions used in determining the fair value of the reporting units are outside the control of management including the weighted-average cost of capital, tax rates, market comparisons, and terminal growth rates. While we believe we have made reasonable estimates and assumptions to calculate the fair value of the reporting units, it is possible a material change could occur. If our actual results are not consistent with our estimates and assumptions used to calculate fair value, it could result in material impairments of our goodwill. The assumptions used to assess impairment consider historical trends, macroeconomic conditions, and projections consistent with the Company’s operating strategy. Changes in these estimates can have a significant impact on the assessment of fair value which could result in material impairment losses.\n42\nWe completed our annual assessment of goodwill as of June 30, 2025 and determined that there was no impairment of goodwill. We performed a sensitivity analysis and determined that a one percentage point increase in the weighted-average cost of capital would not result in an impairment of goodwill for all reporting units and their fair values substantially exceeded their carrying values.\nIncome Taxes\nDescription\nJudgment is required in addressing the future tax consequences of events that have been recognized in our Consolidated Financial Statements or tax returns (e.g., realization of deferred tax assets, changes in tax laws or interpretations thereof).  A change in the assessment of the outcomes of such matters could materially impact our Consolidated Financial Statements.  \nJudgments and Uncertainties\nThe Company computes its provision for income taxes based on the statutory tax rates in the various jurisdictions in which it operates. Assumptions, judgment, and the use of estimates are required in determining if the “more likely than not” standard has been met when computing the provision for income taxes, deferred tax assets and liabilities, and uncertain tax positions.  \nSensitivity of Estimate to Change\nWhile the Company considers all of its tax positions fully supportable, the Company is occasionally challenged by various tax authorities regarding the amount of taxes due. If certain pending tax matters settle within the next twelve months, the total amount of unrecognized tax benefits may increase or decrease for all open tax years and jurisdictions. As of June 30, 2025 and 2024, the Company's liabilities for unrecognized tax benefits, \nwhich include interest and penalti\nes, were $163.0 million and $126.9 million, respectively.",
  "item2": null
}