{
  "source_file": "adp-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2. Management's Discussion and Analysis of Financial Condition and Results of Operations\n \n(Tabular dollars are presented in millions, except per share amounts)\nFORWARD-LOOKING STATEMENTS\nThis document and other written or oral statements made from time to time by Automatic Data Processing, Inc., its subsidiaries and variable interest entity (“ADP” or the “Company”) may contain “forward-looking statements” within the meaning of the Private Securities Litigation Reform Act of 1995.\n \nStatements that are not historical in nature and which may be identified by the use of words like “outlook,” “expects,” “assumes,” “projects,” “anticipates,” “estimates,” “we believe,” “could,” “is designed to” and other words of similar meaning, are forward-looking statements.\n \nThese statements are based on management’s expectations and assumptions and depend upon or refer to future events or conditions and are subject to risks and uncertainties that may cause actual results to differ materially from those expressed.\n \nFactors that could cause actual results to differ materially from those contemplated by the forward-looking statements or that could contribute to such difference include: ADP's success in obtaining and retaining clients, and selling additional services to clients; the pricing of products and services; the success of our new solutions; our ability to respond successfully to changes in technology, including artificial intelligence; compliance with existing or new legislation or regulations; changes in, or interpretations of, existing legislation or regulations; overall market, political and economic conditions, including interest rate and foreign currency trends and inflation; competitive conditions; our ability to maintain our current credit ratings and the impact on our funding costs and profitability; security or cyber breaches, fraudulent acts, and system interruptions and failures; employment and wage levels; availability of skilled associates; the impact of new acquisitions and divestitures; the impact of any uncertainties related to major natural disasters or catastrophic events; and supply-chain disruptions. ADP disclaims any obligation to update any forward-looking statements, whether as a result of new information, future events, or otherwise, except as required by law.  These risks and uncertainties, along with the risk factors discussed under “Item 1A. - Risk Factors” in our Annual Report on Form 10-K for the fiscal year ended June 30, 2025 (“fiscal 2025”), and in other written or oral statements made from time to time by ADP, should be considered in evaluating any forward-looking statements contained herein.\nNON-GAAP FINANCIAL MEASURES\nIn addition to our U.S. GAAP results, we use adjusted results and other non-GAAP metrics to evaluate our operating performance in the absence of certain items and for planning and forecasting of future periods. Adjusted EBIT, adjusted EBIT margin, adjusted net earnings, adjusted diluted earnings per share, adjusted effective tax rate and organic constant currency are all non-GAAP financial measures. Please refer to the accompanying financial tables in the “Non-GAAP Financial Measures” section for a discussion of why ADP believes these measures are important and for a reconciliation of non-GAAP financial measures to their nearest comparable GAAP financial measures.\n25\nEXECUTIVE OVERVIEW\nAs a global leader in HR and payroll solutions, ADP continuously aims to solve complex business challenges for our clients and their workers. Our Human Capital Management (\"HCM\") solutions, which include both software and outsourcing services, are designed to help our clients manage their workforce through a dynamic business and regulatory landscape and the changing world of work. We see tremendous opportunity ahead as we focus on our three key Strategic Priorities: Leading with Best-in-Class HCM technology, Providing Unmatched Expertise and Outsourcing Solutions, and Leveraging our Global Scale for the Benefit of our Clients. \nDuring the first quarter, we made meaningful progress on our Strategic Priorities. We continued to scale ADP Embedded Payroll to reach additional small business clients, accelerated the deployment of Workforce Now Next-Gen to a growing percentage of new mid-market clients, and experienced ongoing strong enterprise sales momentum for ADP Lyric HCM. We continued to empower our associates to leverage their HR domain expertise by providing them with AI tools that further enhanced the client and associate experience. Finally, we continued to build on our global scale by enhancing the services offered within our existing footprint of more than 140 countries and territories.\nHighlights from the three months ended September 30, 2025 include:  \n•\nRevenue growth of 7% to $5,175.2 million; 6% growth on an organic constant currency\n•\nDiluted and adjusted diluted earnings per share (\"EPS\") growth of 6% and 7%, respectively, to $2.49\n•\nCash returned via shareholder friendly actions of $1.0B, including $0.6B of dividends and $0.4B of share repurchases\nFor the three months ended September 30, 2025, we delivered strong revenue growth of 7%, 6% growth on an organic constant currency basis. Our pays per control metric, which represents the number of employees on ADP clients' payrolls in the United States when measured on a same-store-sales basis for a subset of clients ranging from small to large businesses, remained stable for the three months ended September 30, 2025 as compared to the three months ended September 30, 2024. PEO average worksite employees increased 2% for the three months ended September 30, 2025, as compared to the three months ended September 30, 2024. \nWe have a strong business model, generating significant cash flows with low capital intensity, and offer a suite of products that provide critical support to our clients’ HCM functions. We generate sufficient free cash flow to satisfy our cash dividend and our modest debt obligations, which enables us to absorb the impact of downturns and remain steadfast in our long-term strategy and commitments to shareholder friendly actions. We are committed to building upon our past successes by investing in our business through enhancements in research and development of our products and services and by driving meaningful transformation in the way we operate. Our financial condition remains solid at September 30, 2025 and we remain well positioned to support our associates and our clients.\nRESULTS AND ANALYSIS OF CONSOLIDATED OPERATIONS\nTotal Revenues\nThree Months Ended\nSeptember 30,\n2025\n2024\nTotal Revenues\n$\n5,175.2 \n$\n4,832.7 \n  YoY Growth\n7 \n%\n7 \n%\n  YoY Growth, Organic Constant Currency\n6 \n%\n7 \n%\nTotal revenues increased for the three months ended September 30, 2025 due to new business started from new business bookings, strong client retention, an increase in interest on funds held for clients, the impact from the WorkForce Software acquisition, and an increase in zero-margin benefits pass-throughs.\nTotal revenues for the three months ended September 30, 2025 include interest on funds held for clients of $286.8 million, as compared to $253.3 million for the three months ended September 30, 2024. The increase in interest earned on funds held for \n26\nclients resulted from an increase in our average client funds balances of 6.5% to $34.9 billion for the three months ended September 30, 2025 as compared to the three months ended September 30, 2024, coupled with an increase in our average interest rate earned to 3.3% for the three months ended September 30, 2025, as compared to 3.1% for the three months ended September 30, 2024.\nTotal Expenses\nThree Months Ended\nSeptember 30,\n \n2025\n2024\n%\nChange\nCosts of revenues:\nOperating expenses\n$\n2,461.6 \n$\n2,285.8 \n8 \n%\nResearch and development\n251.2 \n232.6 \n8 \n%\nDepreciation and amortization\n123.3 \n115.3 \n7 \n%\nTotal costs of revenues\n2,836.1 \n2,633.7 \n8 \n%\nSelling, general and administrative expenses\n1,006.3 \n926.7 \n9 \n%\nInterest expense\n135.4 \n137.8 \n(2)\n%\nTotal expenses\n$\n3,977.8 \n$\n3,698.2 \n8 \n%\nOperating expenses increased for the three months ended September 30, 2025 due to an increase of $81.8 million of PEO Services zero-margin benefits pass-through costs to $1,131.0 million from $1,049.2 million for the three months ended September 30, 2024. Additionally, operating expenses increased by $67.1 million due to higher service and implementation costs in support of our growing revenue and by $10.6 million due to an increase in costs related to workers' compensation coverage and state unemployment taxes for worksite employees.\nResearch and development expenses increased for the three months ended September 30, 2025 due to increased costs to develop, support, and maintain our new and existing products, including the integration costs associated with the WorkForce Software acquisition.\nDepreciation and amortization expenses increased for the three months ended September 30, 2025 due to the amortization of intangible assets acquired in the WorkForce Software acquisition, amortization of investments in internally developed software primarily for our next-gen products, partially offset by lower amortization of customer contracts and lists.\nSelling, general and administrative expenses increased for the three months ended September 30, 2025 primarily due to increases in selling and marketing expenses of $57.2 million as a result of investments in our sales organization.\nInterest expense decreased for the three months ended September 30, 2025 primarily due to a decrease of $15.5 million related to commercial paper and reverse repurchase borrowings as a result of a decrease in average interest rates on commercial paper issuances and reverse repurchases of 90 basis points, coupled with a decrease in average daily commercial paper borrowings of $0.3 billion, offset by an increase in average reverse repurchase outstanding balances of $0.7 billion, as compared to the three months ended September 30, 2024. This decrease was partially offset by net increases in interest expense of $12.7 million related to the senior notes issued and redeemed during the year ended June 30, 2025.\n27\nOther (Income)/Expense, net\nThree Months Ended\nSeptember 30,\n2025\n2024\n$ Change\nInterest income on corporate funds\n$\n(101.5)\n$\n(91.7)\n$\n9.8 \nRealized (gains)/losses on available-for-sale securities, net\n(1.5)\n0.2 \n1.7 \nGain on sale of assets\n— \n(2.4)\n(2.4)\nNon-service components of pension income, net\n(7.1)\n(7.8)\n(0.7)\nOther income, net\n$\n(110.1)\n$\n(101.7)\n$\n8.4 \nInterest income on corporate funds increased for the three months ended September 30, 2025 due to higher average investment balances of $11.4 billion as compared to $10.7 billion for the three months ended September 30, 2024, coupled with an increase in average interest rates of 20 basis points, as compared to the three months ended September 30, 2024. \nSee Note 12 of our Consolidated Financial Statements for further details on non-service components of pension income, net. \n \nEarnings Before Income Taxes (\"EBIT\") and Adjusted EBIT\n \nThree Months Ended\nSeptember 30,\n2025\n2024\nYoY Growth\nEBIT\n$\n1,307.5 \n$\n1,236.2 \n6 \n%\n  EBIT Margin\n25.3 \n%\n25.6 \n%\n(30) bps\nAdjusted EBIT\n$\n1,318.3 \n$\n1,232.5 \n7 \n%\n  Adjusted EBIT Margin\n25.5 \n%\n25.5 \n%\n0 bps\nEarnings before income taxes increased for the three months ended September 30, 2025, due to the increase in total revenues, partially offset by the increase in total expenses discussed above.\nEBIT Margin decreased for the three months ended September 30, 2025, due to increased selling and marketing expenses and costs of servicing and implementing our clients on growing revenue, partially offset by contributions from client fund interest revenues discussed above and interest expense.\nAdjusted EBIT and Adjusted EBIT margin exclude interest income and interest expense that are not related to our client funds\nextended investment strategy, and net charges, including certain legal settlements, in the applicable periods.\nProvision for Income Taxes\nThe effective tax rate for the three months ended September 30, 2025 and 2024 was 22.5% and 22.6%, respectively. The decrease in the effective tax rate is primarily due to lower reserves for uncertain tax positions primarily offset by the cost of an intercompany transfer of certain assets and a lower excess tax benefit on stock-based compensation in the three months ended September 30, 2025.\nAdjusted Provision for Income Taxes\nThe adjusted effective tax rate for the three months ended September 30, 2025 and 2024 was 22.5% and 22.6%, respectively. The drivers of the adjusted effective tax rate are the same as the drivers of the effective tax rate discussed above.\n28\nNet Earnings and Diluted EPS, Unadjusted and Adjusted\nThree Months Ended\nSeptember 30,\n2025\n2024\nYoY Growth\nNet earnings  \n$\n1,013.0 \n$\n956.3 \n6 \n%\nDiluted EPS  \n$\n2.49 \n$\n2.34 \n6 \n%\nAdjusted net earnings  \n$\n1,013.0 \n$\n956.1 \n6 \n%\nAdjusted diluted EPS  \n$\n2.49 \n$\n2.33 \n7 \n%\nIn addition to the increase in net earnings, diluted EPS increased for the three months ended September 30, 2025 as a result of the impact of fewer shares outstanding resulting from the repurchase of approximately 1.2 million shares during the three months ended September 30, 2025, and 1.4 million shares during the three months ended September 30, 2024, partially offset by the issuances of shares under our employee benefit plans.\nAdjusted net earnings and adjusted diluted EPS reflect the changes in the components described above for the three months ended September 30, 2025.\n29\nANALYSIS OF REPORTABLE SEGMENTS\nRevenues\nThree Months Ended\n% Change\nSeptember 30,\n \n2025\n2024\nAs \nReported\nOrganic constant currency\nEmployer Services\n$\n3,491.2 \n$\n3,261.0 \n7 \n%\n5 \n%\nPEO Services\n1,687.5 \n1,574.5 \n7 \n%\n7 \n%\nOther\n(3.5)\n(2.8)\nn/m\nn/m\n$\n5,175.2 \n$\n4,832.7 \n7 \n%\n6 \n%\nEarnings before Income Taxes\nThree Months Ended\n%\nChange\nSeptember 30,\n \n2025\n2024\nAs Reported\nEmployer Services\n$\n1,228.8 \n$\n1,164.3 \n6 \n%\nPEO Services\n218.8 \n225.6 \n(3)\n%\nOther\n(140.1)\n(153.7)\nn/m\n$\n1,307.5 \n$\n1,236.2 \n6 \n%\nMargin\nThree Months Ended\nSeptember 30,\n \n2025\n2024\nYoY Growth\nEmployer Services\n35.2 \n%\n35.7 \n%\n(50) bps\nPEO Services\n13.0 \n%\n14.3 \n%\n(140) bps\nn/m - not meaningful\nNote: Numbers may not foot due to rounding.\nEmployer Services\nRevenues\nEmployer Services' revenues increased for the three months ended September 30, 2025 due to new business started from new business bookings, strong client retention, an increase in pricing, the impact from the WorkForce Software acquisition, and an increase in interest earned on funds held for clients.\nEarnings before Income Taxes\nEmployer Services' earnings before income taxes increased for the three months ended September 30, 2025, due to increased revenues, including contributions from client funds interest, discussed above, partially offset by increased costs of servicing and implementing our clients on growing revenue, selling and marketing expenses, and costs to develop, support, and maintain our new and existing products.\n30\nMargin\nEmployer Services' margin decreased for the three months ended September 30, 2025, due to increased selling and marketing expenses, costs of servicing and implementing our clients on growing revenue, and costs to develop, support, and maintain our new and existing products, partially offset by contributions from client fund interest revenues discussed above.\nPEO Services\nRevenues\nPEO Revenues\nThree Months Ended\nChange\nSeptember 30,\n \n2025\n2024\n$\n%\nPEO Services' revenues\n$\n1,687.5 \n$\n1,574.5 \n$\n113.0 \n7 \n%\nLess: PEO zero-margin benefits pass-throughs\n1,131.0 \n1,049.2 \n81.8 \n8 \n%\nPEO Services' revenues excluding zero-margin benefits pass-throughs\n$\n556.5 \n$\n525.3 \n$\n31.2 \n6 \n%\nPEO Services' revenues increased for the three months ended September 30, 2025 due to the increase in zero-margin benefits pass-throughs, and an increase in average worksite employees of 2%, as compared to the three months ended September 30, 2024.\nEarnings before Income Taxes\nPEO Services' earnings before income taxes decreased for the three months ended September 30, 2025 due to increased operating costs related to state unemployment insurance and selling and marketing expenses, partially offset by increased revenues discussed above.\nMargin \nPEO Services' margin decreased for the three months ended September 30, 2025, due to increased operating costs related to state unemployment insurance, selling and marketing expenses and zero-margin benefits pass-through costs, partially offset by increased revenues discussed above.\nADP Indemnity provides workers’ compensation and employer's liability deductible reimbursement insurance protection for PEO Services’ worksite employees up to $1 million per occurrence. PEO Services has secured a workers’ compensation and employer’s liability insurance policy that caps the exposure for each claim at $1 million per occurrence and has also secured  aggregate stop loss insurance that caps aggregate losses at a certain level in fiscal years 2012 and prior from an admitted and licensed insurance company of AIG. We utilize historical loss experience and actuarial judgment to determine the estimated claim liability, and changes in estimated ultimate incurred losses are included in the PEO segment. \nAdditionally, starting in fiscal year 2013, ADP Indemnity paid premiums to enter into reinsurance arrangements with ACE American Insurance Company, a wholly-owned subsidiary of Chubb Limited (“Chubb”), to cover substantially all losses incurred by the Company up to the \n$1 million per occurrence related to the workers\n’\n compensation and employer's liability deductible reimbursement insurance protection for PEO Services' worksite employees. \nEach of these reinsurance arrangements limits our overall exposure incurred up to a certain limit. The Company believes the likelihood of ultimate losses exceeding this limit is remote.\n \nADP Indemnity recorded a pre-tax benefit of approximately $4.7 million for the three months ended September 30, 2025, as compared to approximately $4.8 million for the three months ended September 30, 2024, which were primarily the results of more favorable actuarial loss development in workers’ compensation reserves. ADP Indemnity paid a premium of $278 million in July 2025, to enter into a reinsurance agreement with Chubb to cover substantially all losses incurred by ADP Indemnity for fiscal 2026 policy year on terms substantially similar to the fiscal 2025 reinsurance policy.\n31\nOther\nThe primary components of “Other” are certain corporate overhead charges and expenses that have not been allocated to the reportable segments, including corporate functions, severance costs, non-recurring gains and losses, the elimination of intercompany transactions, and all other interest income and expense.\nNon-GAAP Financial Measures\nIn addition to our GAAP results, we use the adjusted results and other non-GAAP metrics set forth in the table below to evaluate our operating performance in the absence of certain items and for planning and forecasting of future periods:\nAdjusted Financial Measure\nU.S. GAAP Measures\nAdjusted EBIT\nNet earnings  \nAdjusted provision for income taxes \nProvision for income taxes\nAdjusted net earnings  \nNet earnings  \nAdjusted diluted earnings per share  \nDiluted earnings per share\nAdjusted effective tax rate \nEffective tax rate\nOrganic constant currency\nRevenues\nWe believe that the exclusion of the identified items helps us reflect the fundamentals of our underlying business model and analyze results against our expectations and against prior periods, and to plan for future periods by focusing on our underlying operations. We believe that the adjusted results provide relevant and useful information for investors because it allows investors to view performance in a manner similar to the method used by management and improves their ability to understand and assess our operating performance.  The nature of these exclusions is for specific items that are not fundamental to our underlying business operations.  Since these adjusted financial measures and other non-GAAP metrics are not measures of performance calculated in accordance with U.S. GAAP, they should not be considered in isolation from, as a substitute for, or superior to their corresponding U.S. GAAP measures, and they may not be comparable to similarly titled measures at other companies.\n32\nThree Months Ended\n% Change\nSeptember 30,\n2025\n2024\nAs Reported\nNet earnings  \n$\n1,013.0 \n$\n956.3 \n6 \n%\nAdjustments:\nProvision for income taxes\n294.5 \n279.9 \nAll other interest expense (a)\n33.6 \n20.5 \nAll other interest income (a)\n(22.8)\n(23.9)\nLegal settlements (b)\n— \n(0.3)\nAdjusted EBIT\n$\n1,318.3 \n$\n1,232.5 \n7 \n%\nAdjusted EBIT Margin\n25.5 \n%\n25.5 \n%\nProvision for income taxes\n$\n294.5 \n$\n279.9 \n5 \n%\nAdjustments:\nLegal settlements (c)\n— \n(0.1)\nAdjusted provision for income taxes\n$\n294.5 \n$\n279.8 \n5 \n%\nAdjusted effective tax rate (d)\n22.5 \n%\n22.6 \n%\nNet earnings  \n$\n1,013.0 \n$\n956.3 \n6 \n%\nAdjustments:\nLegal settlements (b)\n— \n(0.3)\nIncome tax provision for legal settlements (c)\n— \n0.1 \nAdjusted net earnings  \n$\n1,013.0 \n$\n956.1 \n6 \n%\nDiluted EPS  \n$\n2.49 \n$\n2.34 \n6 \n%\nAdjustments:\nLegal settlements (b) (c)\n— \n— \nAdjusted diluted EPS  \n$\n2.49 \n$\n2.33 \n7 \n%\nNote: Numbers may not foot due to rounding.\n(a) In adjusted EBIT, we include the interest income earned on investments associated with our client funds extended investment strategy and interest expense on borrowings related to our client funds extended investment strategy as we believe these amounts to be fundamental to the underlying operations of our business model. The adjustments in the table above represent the interest income and interest expense that are not related to our client funds extended investment strategy and are labeled as “All other interest expense” and “All other interest income.”\n(b) In the three months ended September 30, 2024, this represents a reserve reversal of a legal reserve recorded during the year ended June 30, 2023.\n(c) The income tax provision was calculated based on the annualized marginal rate in effect during the quarter of the adjustment.\n(d) \nThe adjusted effective tax rate is calculated as our adjusted provision for income taxes divided by the sum of our adjusted net earnings plus our adjusted provision for income taxes.\nThe following table reconciles our reported growth rates to the non-GAAP measure of organic constant currency, which excludes the impact of acquisitions, the impact of dispositions, and the impact of foreign currency. The impact of acquisitions and dispositions is calculated by excluding the current year revenues of acquisitions until the one-year anniversary of the transaction and by excluding the prior year revenues of divestitures for the one-year period preceding the transaction.  The impact of foreign currency is determined by calculating the current year results using foreign exchange rates consistent with the prior year. The PEO segment is not impacted by acquisitions, dispositions or foreign currency.\n33\nThree Months Ended\nSeptember 30,\n2025\nConsolidated revenue growth as reported\n7 \n%\nAdjustments:\nImpact of acquisitions\n(1)\n%\nImpact of foreign currency\n(1)\n%\nConsolidated revenue growth, organic constant currency\n6 \n%\nEmployer Services revenue growth as reported\n7 \n%\nAdjustments:\nImpact of acquisitions\n(1)\n%\nImpact of foreign currency\n(1)\n%\nEmployer Services revenue growth, organic constant currency\n5 \n%\nNote: Numbers may not foot due to rounding.\nFINANCIAL CONDITION, LIQUIDITY AND CAPITAL RESOURCE\nS\nAs of September 30, 2025, cash and cash equivalents were $2.5 billion, which were primarily invested in time deposits and money market funds.\nFor corporate liquidity, we expect existing cash, cash equivalents, marketable securities, cash flow from operations together with our\n $10.6 billion \nof committed credit facilities and our ability to access both long-term and short-term debt financing from the capital markets will be adequate to meet our operating, investing, and financing activities, such as regular quarterly dividends, share repurchases, and capital expenditures for the foreseeable future. \nOur financial condition remains solid at September 30, 2025 and we have sufficient liquidity. \nFor client funds liquidity, we have the ability to borrow through our financing arrangements under our U.S. short-term commercial paper program and our U.S., Canadian and United Kingdom short-term reverse repurchase agreements\n ($7.5 billion of which is available on a committed basis in the U.S. as of June 30, 2025), together with our $10.6 billion \nof comm\nitted credit facilities and our ability to use corporate liquidity when necessary to meet short-term funding requirements related to client funds obligations.  Please see “Quantitative and Qualitative Disclosures about Market Risk” for a further discussion of the risks related to our client funds extended investment strategy. See Note 10 of our Consolidated Financial Statements for a description of our short-term financing including commercial paper.\nOperating, Investing and Financing Cash Flows\nOur cash flows from operating, investing, and financing activities, as reflected in the Statements of Consolidated Cash Flows for the three months ended September 30, 2025 and 2024, respectively, are summarized as follows: \nThree Months Ended\nSeptember 30,\n2025\n2024\n$ Change\nCash provided by (used in):\nOperating activities\n$\n642.3 \n$\n824.4 \n$\n(182.1)\nInvesting activities\n(1,862.6)\n(1,644.4)\n(218.2)\nFinancing activities\n164.1 \n(6,491.5)\n6,655.6 \nEffect of exchange rate changes on cash, cash equivalents, restricted cash, and restricted cash equivalents\n(6.7)\n17.0 \n(23.7)\nNet change in cash, cash equivalents, restricted cash, and restricted cash equivalents\n$\n(1,062.9)\n$\n(7,294.5)\n$\n6,231.6 \nNet cash flows provided by operating activities decreased primarily due to a net unfavorable change in the components of operating assets and liabilities partially offset by growth in our business, as compared to the three months ended September 30, 2024.\n34\nNet cash flows used in investing activities changed due to timing of net proceeds and purchases of corporate and client funds marketable securities of $203.7 million.\nNet cash flows provided by financing activities changed due to a net increase in the cash flow from client funds obligations of $11,443.6 million, which is due to the timing of impounds from our clients and payments to our clients' employees and other payees, partially offset by a decrease in the net proceeds from the issuance of commercial paper and debt.\nWe purchased approximately 1.2 million shares of our common stock at an average price per share of $302.10 during the three months ended September 30, 2025, as compared to purchases of 1.4 million shares at an average price per share of $259.47 during the three months ended September 30, 2024. From time to time, the Company may repurchase shares of its common stock under its authorized share repurchase program. The Company considers several factors in determining when to execute share repurchases, including, among other things, actual and potential acquisition activity, cash balances and cash flows, issuances due to employee benefit plan activity, and market conditions.\nCapital Resources and Client Funds Obligations\nWe have $4.0 billion \nof senior unsecured no\ntes with maturity dates in 2028, 2030, 2032, and 2034. We may from time to time revisit the long-term debt market to refinance existing debt, finance investments including acquisitions for our growth, and maintain the appropriate capital structure. However, there can be no assurance that volatility in the global capital and credit markets would not impair our ability to access these markets on terms acceptable to us, or at all.\n See Note 11 of our Consolidated Financial Statements for a description of our senior unsecured notes.\nOur U.S. short-term funding requirements related to client funds are sometimes obtained on an unsecured basis through the issuance of commercial paper, rather than liquidating previously-collected client funds that have already been invested in available-for-sale securities. This commercial paper program provides for the issuance of up to $10.6 billion in aggregate maturity value. Our commercial paper program is rated A-1+ by Standard and Poor’s, Prime-1 (“P-1”) by Moody’s and F1+ by Fitch. These ratings denote the highest quality commercial paper securities. Maturities of commercial paper can range from overnight to up to 364 days.\n \nAs of September 30, 2025 and June 30, 2025 the Company had $5.2 billion and $4.8 billion of commercial paper outstanding, which were repaid in early October 2025 and July 2025, respectively. Details\n of the borrowings under the commercial paper program are as follows:\nThree Months Ended\nSeptember 30,\n2025\n2024\nAverage daily borrowings (in billions)\n$\n4.5 \n$\n4.8 \nWeighted average interest rates\n4.4 \n%\n5.3 \n%\nWeighted average maturity (approximately in days)\n2 days\n2 days\nOur U.S., Canadian, and United Kingdom short-term funding requirements related to client funds obligations are sometimes obtained on a secured basis through the use of reverse repurchase agreements, which are collateralized principally by government and government agency securities, rather than liquidating previously-collected client funds that have already been invested in available-for-sale securities. These agreements generally have terms ranging from overnight to up to five business days. We have successfully borrowed through the use of reverse repurchase agreements on an as-needed basis to meet short-term funding requirements related to client funds obligations. As of September 30, 2025, we had $7.5 billion available to us on a committed basis under the U.S. reverse repurchase agreements. As of September 30, 2025 and June 30, 2025, the Company had $247.4 million and $38.4 million of outstanding obligations related to reverse repurchase agreements, respectively. Details of the reverse repurchase agreements are as follows:\nThree Months Ended\nSeptember 30,\n2025\n2024\nAverage outstanding balances (in billions)\n$\n4.5 \n$\n3.8 \nWeighted average interest rates\n4.4 \n%\n5.3 \n%\nWe vary the maturities of our committed credit facilities to limit the refinancing risk of any one facility. We have a $4.6 billion, 364-day credit agreement that matures in June 2026 with a one-year term-out option. In addition, we have a five-year $3.5 billion credit facility and a five-year $2.5 billion credit facility maturing in June 2029 and June 2030, respectively, each with an \n35\naccordion feature under which the aggregate commitment can be increased by $500 million, subject to the availability of additional commitments. The primary uses of the credit facilities are to provide liquidity to the commercial paper program and funding for general corporate purposes, if necessary. We had no borrowings through September 30, 2025 under the credit facilities. We believe that we currently meet all conditions set forth in the revolving credit agreements to borrow thereunder, and we are not aware of any conditions that would prevent us from borrowing part or all of the $10.6 billion available to us under the revolving credit agreements. See Note 10 of our Consolidated Financial Statements for a description of our short-term financing including credit facilities.\nOur investment portfolio does not contain any asset-backed securities with underlying collateral of sub-prime mortgages, alternative-A mortgages, sub-prime auto loans or sub-prime home equity loans, collateralized debt obligations, collateralized loan obligations, credit default swaps, derivatives, auction rate securities, structured investment vehicles or non-investment grade fixed-income securities. We own AAA-rated senior tranches of primarily fixed rate auto loan, credit card, and device payment plan agreement receivables, secured predominantly by prime collateral. All collateral on asset-backed securities is performing as expected through September 30, 2025. In addition, we own U.S. government securities which primarily include debt directly issued by Federal Farm Credit Banks and Federal Home Loan Banks. Our client funds investment strategy is structured to allow us to average our way through an interest rate cycle by laddering the maturities of our investments out to five years (in the case of the extended portfolio) and out to ten years (in the case of the long portfolio). This investment strategy is supported by our short-term financing arrangements necessary to satisfy short-term funding requirements relating to client funds obligations. See Note 7 of our Consolidated Financial Statements for a description of our corporate investments and funds held for clients.\nCapital expenditures for the three months ended September 30, 2025 were $44.9 million,\n as compared to \n$55.6 million\n for \nthe three months ended September 30, 2024. We expect capital expenditures in fiscal 2026 to be between $225.0 million and $250.0 million, as compared to $176.8 million in fiscal 2025. \n36\nQUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nOur overall investment portfolio is comprised of corporate investments (cash and cash equivalents, and marketable securities) and client funds assets (funds that have been collected from clients but have not yet been remitted to the applicable tax authorities, client employees or other payees).\nOur corporate investments are invested in cash and cash equivalents and highly liquid, investment-grade marketable securities. These assets are available for our regular quarterly dividends, share repurchases, capital expenditures and/or acquisitions, as well as other corporate operating purposes. All of our fixed-income securities are classified as available-for-sale securities.\nOur client funds assets are invested with safety of principal, liquidity, and diversification as the primary objectives. Consistent with those objectives, we also seek to maximize interest income and to minimize the volatility of interest income.  Client funds assets are invested in highly liquid, investment-grade marketable securities, with a maximum maturity of 10 years at the time of purchase, and money market securities and other cash equivalents.  \n    \nWe utilize a strategy by which we extend the maturities of our investment portfolio for funds held for clients and employ short-term financing arrangements to satisfy our short-term funding requirements related to client funds obligations. Our client funds investment strategy is structured to allow us to average our way through an interest rate cycle by laddering the maturities of our investments out to five years (in the case of the extended portfolio) and out to ten years (in the case of the long portfolio). As part of our client funds investment strategy, we use the daily collection of funds from our clients to satisfy other unrelated client funds obligations, rather than liquidating previously-collected client funds that have already been invested in available-for-sale securities. In circumstances where we experience a reduction in employment levels due to a slowdown in the economy, we may make tactical decisions to sell certain securities or not reinvest maturing securities in order to reduce the size of the funds held for clients to correspond to client funds obligations. We attempt to minimize the risk of not having funds collected from a client available at the time such client’s obligation becomes due by generally impounding the client's funds by the time we pay such client’s obligation. When we don't impound client funds in advance of paying such client obligations, we are at risk of not recovering such funds or material delay in such recovery. Through our client funds investment strategy and client impounding processes, we have consistently maintained the required level of liquidity to satisfy all of our obligations.\nThere are inherent risks and uncertainties involving our investment strategy relating to our client funds assets. Such risks include liquidity risk, including the risk associated with our ability to liquidate, if necessary, our available-for-sale securities in a timely manner in order to satisfy our client funds obligations. However, our investments are made with the safety of principal, liquidity, and diversification as the primary goals to minimize the risk of not having sufficient funds to satisfy all of our client funds obligations. We also believe we have significantly reduced the risk of not having sufficient funds to satisfy our client funds obligations by consistently maintaining access to other sources of liquidity, including our corporate cash balances, available borrowings under o\nur\n $10.6 billion \ncommercial paper program (rated A-1+ by Standard and Poor’s, P-1 by Moody’s, and F1+ by Fitch, the highest possible short-term credit ratings), our ability to engage in reverse repurchase agreement transaction\ns ($7.5 billion of which is available on a committed basis in the U.S. as of September 30, 2025) and available borrowings under our $10.6 billion committed credit facilities. The reduced availability of financing during periods of economic turmoil, even to borrowers with the highest credit ratings, may limit our ability to access short-term debt markets to meet the liquidity needs of our business. In addition to liquidity risk, our investments are subject to interest rate risk and credit risk, as discussed below.\nWe have established credit quality, maturity, and exposure limits for our investments. The minimum allowed credit rating at time of purchase for corporate, Canadian government agency and Canadian provincial bonds is BBB, for asset-backed securities is AAA, and for municipal bonds is A. The maximum maturity at time of purchase for BBB-rated securities is 5 years, and for single A rated, AA-rated and AAA-rated securities it is 10 years. Time deposits and commercial paper must be rated A-1 and/or P-1. Money market funds must be rated AAA/Aaa-mf.\n37\nDetails regarding our overall investment portfolio are as follows:\nThree Months Ended\nSeptember 30,\n2025\n2024\nAverage investment balances at cost:\n \n \nCorporate investments\n$\n11,393.8 \n$\n10,669.8 \nFunds held for clients\n34,928.7 \n32,787.0 \nTotal\n$\n46,322.5 \n$\n43,456.8 \n \n \nAverage interest rates earned exclusive of realized\n   (gains)/losses on:\n \n \nCorporate investments\n3.6 \n%\n3.4 \n%\nFunds held for clients\n3.3 \n%\n3.1 \n%\nTotal\n3.4 \n%\n3.2 \n%\nRealized (gains)/losses on available-for-sale securities, net\n$\n(1.5)\n$\n0.2 \n \nSeptember 30, 2025\nJune 30, 2025\nNet unrealized pre-tax losses on available-for-sale securities\n$\n(211.5)\n$\n(425.7)\nTotal available-for-sale securities at fair value\n$\n35,652.3 \n$\n33,777.7 \n \nWe are exposed to interest rate risk in relation to securities that mature, as the proceeds from maturing securities are reinvested. Factors that influence the earnings impact of interest rate changes include, among others, the amount of invested funds and the overall portfolio mix between short-term and long-term investments. This mix varies during the fiscal year and is impacted by daily interest rate changes. The annu\nalized interest rate earned on ou\nr entire portfolio increased from 3.2% for the three months ended September 30, 2024 to 3.4% for the three months ended September 30, 2025. A hy\npothetical chan\nge in both short-term interest rates (e.g., overnight interest rates or the federal funds rate) and intermediate-term interest rates of 25 basis points applied to the estimated average investment balances and any related short-term borrowings would result in approximately an $22 million impact to earnings before income taxes over the ensuing twelve-month period ending September 30, 2026. A hypothetical change in only short-term interest rates of 25 basis points applied to the estimated average short-term investment balances and any related short-term borrowings would result in approximately an $7 million impact to earnings before income taxes over the ensuing twelve-month period ending September 30, 2026.\nWe are exposed to credit risk in connection with our available-for-sale securities through the possible inability of the borrowers to meet the terms of the securities. We limit credit risk by investing in investment-grade securities, primarily AAA-rated and AA- rated securities, as rated by Moody’s, Standard & Poor’s, DBRS for Canadian dollar denominated securities, and Fitch for asset-backed and commercial-mortgage-backed securities. In addition, we limit amounts that can be invested in any security other than U.S. government and government agency, Canadian government, and United Kingdom government securities.\nWe operate and transact business in various foreign jurisdictions and are therefore exposed to market risk from changes in foreign currency exchange rates that could impact our consolidated results of operations, financial position, or cash flows. We manage our exposure to these market risks through our regular operating and financing activities and, when deemed appropriate, through the use of derivative financial instruments. We may use derivative financial instruments as risk management tools and not for trading purposes.\n38\nCRITICAL ACCOUNTING POLICIES\nOur Consolidated Financial Statements and accompanying notes have been prepared in accordance with U.S. GAAP. The preparation of these financial statements requires management to make estimates, judgments, and assumptions that affect reported amounts of assets, liabilities, revenues, expenses and other comprehensive income. We continually evaluate the accounting policies and estimates used to prepare the Consolidated Financial Statements. Refer to Note 2 of our Consolidated Financial Statements for changes to our accounting policies effective for fiscal 2026.\nNEW ACCOUNTING PRONOUNCEMENTS\nSee Note 2, New Accounting Pronouncements, of Notes to the Consolidated Financial Statements for a discussion of recent accounting pronouncements."
}