{
  "source_file": "adsk-20251031.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "ITEM 2.\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\n    The discussion in our MD&A and elsewhere in this Quarterly Report on Form 10-Q contains trend analyses and other forward-looking statements within the meaning of Section 27A of the Securities Act of 1933 and Section 21E of the Securities Exchange Act of 1934. Forward-looking statements are any statements that look to future events and consist of, among other things, our business strategies, including those discussed in “Strategy,” “Overview of the Three and Nine Months Ended October 31, 2025,” and in \n“Results of Operations-Overview.” \nExamples of such forward-looking statements may relate to items such as future net revenue, operating expenses, recurring revenue, net revenue retention rate, cash flow, remaining performance obligations, and other future financial results (by product type and geography); the transition to annual billings for multi-year contracts; the implementation of new transaction models; the effectiveness of our efforts to successfully manage transitions to new markets; our ability to increase our subscription base; expected market trends, including the growth of cloud and mobile computing; the availability of credit; the effects of global economic conditions, including from global trade wars or an economic downturn or recession in the United States or in other countries around the world; the effects of revenue recognition; the effects of recently issued accounting standards; expected trends in certain financial metrics, including expenses; expectations regarding our cash needs; the effects of fluctuations in exchange rates and our hedging activities on our financial results; our ability to successfully expand adoption of our products; our ability to gain market acceptance of new business and sales initiatives; the impact of restructuring activities; cybersecurity and privacy issues or incidents; the impact of past acquisitions, including our integration efforts and expected synergies; the impact of economic volatility and geopolitical activities in certain countries, particularly emerging economy countries; the timing and amount of purchases under our stock buy-back plan; and the effects of potential non-cash charges on our financial results and the resulting effect on our financial results. In addition, forward-looking statements also consist of statements involving expectations regarding product capability and acceptance, anticipated benefits of our products; statements regarding our liquidity and short-term and long-term cash requirements, as well as statements involving trend analyses and statements including such words as “may,” “believe,” “could,” “anticipate,” “would,” “might,” “plan,” “expect,” and similar expressions or the negative of these terms or other comparable terminology. These forward-looking statements speak only as of the date of this Quarterly Report on Form 10-Q and are subject to business and economic risks. As such, our actual results could differ materially from those set forth in the forward-looking statements as a result of a number of factors, including those set forth below in Part II, Item 1A, “Risk Factors,” and in our other reports filed with the U.S. Securities and Exchange Commission. We assume no obligation to update the forward-looking statements to reflect events that occur or circumstances that exist after the date on which they were made, except as required by law.\nNote: A glossary of terms used in this Quarterly Report on Form 10-Q appears at the end of this Item 2.\nStrategy\nAutodesk is changing how the world is designed and made. Our technology spans architecture, engineering, construction, product design, manufacturing, media and entertainment, empowering innovators everywhere to solve challenges big and small. From greener buildings to smarter products to more mesmerizing blockbusters, Autodesk technology helps our customers to design and make a better world for all.\nOur strategy is to drive customer workflow convergence by delivering a trusted design and make platform that connects people through automation, data, and insights to help them achieve better outcomes for their businesses and the world. To drive the execution of our strategy, we are focused on three strategic priorities: build the platform of choice for Design and Make, accelerate adoption of Fusion, Forma, and Flow, and transform how customers experience Autodesk.\nWe equip and inspire our users with the tailored tools, services, and access they need for success today and tomorrow. At every step, we help users harness the power of data to build upon their ideas and explore new ways of imagining, collaborating, and creating to achieve better outcomes for their customers, for society, and for the world. And because creativity can’t flourish in silos, we connect what matters - from steps in a project to collaborators on a unified platform.\nProduct Evolution\nWe offer subscriptions for individual products and Industry Collections, EBAs, and cloud service offerings (collectively referred to as “subscription plans”). Subscription plans are designed to give our customers more flexibility with how they use our offerings and to attract a broader range of customers, such as project-based users and small businesses.\n31\n \nOur subscription plans represent a hybrid of desktop software and cloud functionality, which provides a device-independent, collaborative design workflow for designers and their stakeholders. Our cloud offerings, for example, Autodesk Construction Cloud, Autodesk Build, Fusion, Flow Production Tracking, Autodesk Forma, AutoCAD web app, and AutoCAD mobile app, provide tools, including mobile and collaboration capabilities, to streamline design, collaboration, building and manufacturing, and data management processes. We believe that customer adoption of these latest offerings will continue to grow as customers across a range of industries begin to take advantage of the scalable computing power and flexibility provided through these services.\nIndustry Collections provide our customers with access to a broader selection of Autodesk solutions and services, simplifying the customers’ ability to benefit from a complete set of tools for their industry.\nTo support our strategic priority of digital transformation in Architecture, Engineering, Construction and Operations (“AECO”), we are strengthening our AECO solutions’ foundation with both organic and inorganic investments. In fiscal 2025, we acquired Payapps Limited (“Payapps”), a leading cloud-based software platform for managing construction-related payments. This acquisition will deepen Autodesk Construction Cloud’s footprint and provide a robust payment management offering to serve the needs of general contractors and trade contractors. Through automating the application of the payment process, Payapps’ solution provides greater transparency, reduces risk and helps accelerate time-to-payment. In fiscal 2024, we launched the first set of capabilities in Autodesk Forma, an industry cloud that unifies workflows across the teams that design, build, and operate the built environment. Autodesk Forma’s initial capabilities enable the early-stage planning and design process with automation and Artificial Intelligence (“AI”)-powered insights that simplify the exploration of design concepts, offload repetitive tasks, and help evaluate environmental qualities surrounding a building site.  \nIn manufacturing, our strategy is to combine organic and acquired software in existing and adjacent verticals to create end-to-end, cloud-based solutions for our customers that drive efficiency and sustainability. We continue to attract global manufacturing leaders and disruptive startups with our generative design and cloud-based Fusion that converges the design process with manufacturing. In fiscal 2024, we acquired a provider of simulation technology that enables factory and logistics center operators to optimize their processes. \nOur strategy includes improving our product functionality and expanding our product offerings through internal development as well as through the acquisition of products, technology, and businesses. Acquisitions often increase the speed at which we can deliver product functionality to our customers; however, they entail cost and integration challenges and may, in certain instances, negatively impact our operating margins. We continually review these factors in making decisions regarding acquisitions. We anticipate that we will continue to acquire products, technology, and businesses as compelling opportunities become available.\nGlobal Reach\nWe sell our products and services globally, through a combination of direct and indirect channels. Our direct channels include, but are not limited to, internal sales resources focused on selling our highly specialized solutions in our largest accounts, Solution Providers focused on serving certain Flex and subscription customers through our new transaction model, and business transacted through our online Autodesk branded store. In this new transaction model, Solution Providers provide a quote to customers but the actual transaction occurs directly between Autodesk and the customer. During fiscal 2026, we expect the change in recognition of sales incentives to Solution Providers from contra revenue to operating costs under the new transaction model to positively impact calculated revenue growth, while being broadly neutral to calculated operating profit and free cash flow dollars, and to result in a calculated negative impact to operating margin. See Part I, Item 1, “Financial Statements,” Note 3, “Revenue Recognition” in the Notes to the Condensed Consolidated Financial Statements for further detail on the results of our indirect and direct channel sales for the three and nine months ended October 31, 2025 and 2024.\nOur indirect channels primarily include distributors, resellers, direct market resellers, volume channel partners, and product-specific resellers. \nWe anticipate that our channel mix will continue to change as we scale our business. With the continued growth of our online Autodesk branded store and our new transaction model, we are transacting directly with more end customers, rather than through distributors, without substantial disruption to our revenue. We expect our indirect channel will continue to transact and support a considerable portion of our customers. We also expect our transition to annual billings for multi-year contracts to impact the timing of our billings and cash collections. We employ a variety of incentive programs and promotions to align our direct and indirect channels with our business strategies.\n32\n \nPlatform Capabilities\nWe are building a trusted, outcome-focused platform for critical customer workflows that enables end-to-end digital transformation for our customers and partners within and between the industries we serve. We aim to accelerate these customer workloads by providing granular, interoperable and accessible data.\nWe plan to do this by focusing on building the next generation of technology and services as trusted, shared capabilities. We aim to centralize critical and duplicative capabilities across key offerings. These include foundational capabilities to make our offers safer, faster, easier, and globally scalable, as well as capabilities that can accelerate new sources of value for our customers.  \n One example of these shared capabilities is Autodesk AI. We have been investing in AI for over a decade. Our focus is on building AI capabilities that add value to our customers’ workloads through augmentation, automation and analysis.  \nOne of our key strategies is to maintain an API based architecture of our software products to facilitate third-party development of complementary products and industry-specific software solutions. This approach enables customers and third parties to customize solutions for a wide variety of highly specific uses. We offer several programs that provide strategic investment funding, technological platforms, user communities, technical support, forums, and events to developers who develop add-on applications for our products. For example, we have established the Autodesk Platform Services to support innovators that build solutions to facilitate the development of a single connected ecosystem for the future of how things are designed, made, and used.\nIn addition to the competitive advantages afforded by our technology, our large global network of distributors, resellers, Solution Providers, third-party developers, customers, educators, educational institutions, learning partners, and students is a key competitive advantage that has been cultivated over an extensive period. This network of partners and relationships provides us with a broad and deep reach into volume markets worldwide. Our distributor, reseller and Solution Provider network is extensive and provides our customers with the resources to purchase, deploy, learn, and support our solutions quickly and easily. We have a significant number of registered third-party developers who create products that work well with our solutions and extend them to a variety of specialized applications.\nImpact at Autodesk\nAutodesk is committed to advancing a more sustainable, resilient, and inclusive world. We take action as a business to support our employees, customers, and communities in our collective opportunity to design and make a better world for all.\nWe focus our efforts to advance positive outcomes across three primary areas: energy and materials, health and resilience, and work and prosperity. These impact opportunity areas are derived from the UN Sustainable Development Goals (“SDGs”) and have been identified through a multi-pronged process to align the top needs of our stakeholders, the issues that are most important to our business, and the areas we are best placed to accelerate positive impact at scale.\nThese opportunities primarily manifest as outcomes through how our customers leverage our technology to design and make net-zero carbon buildings, resilient infrastructure, more sustainable products, and a thriving workforce. We support and amplify these opportunities through powering our business with 100% renewable energy, neutralizing greenhouse gas emissions associated with our operations, developing an inclusive culture and supporting students and educators with tools and training to equip the next generation of innovators. We advance these opportunities with industry innovators through collaboration with our customers and partners, deploying philanthropic capital to changemakers, and providing software donations, and training to our wider ecosystem. Autodesk committed to target 1% of annual operating profit for the long-term support of our impact programs, which includes our philanthropic work and our climate commitments. \nThese programs align with our operational priorities and long-term growth strategy. We aim to maintain our commitments, fostering trust with stakeholders and enabling compliance with global regulations.\nAdditional information about our impact and governance program is available in our annual impact report on our website at www.autodesk.com. Information contained on or accessible through our website is not part of or incorporated by reference into this report.\nAssumptions Behind Our Strategy\nOur strategy depends upon many assumptions, including: making our technology available to mainstream markets; leveraging our large global network of distributors, resellers, Solution Providers, third-party developers, customers, educators, \n33\n \neducational institutions, learning partners, and students; improving the performance and functionality of our products and platform; and adequately protecting our intellectual property. If the outcome of any of these assumptions differs from our expectations, we may not be able to implement our strategy, which could potentially adversely affect our business. For further discussion regarding these and related risks, Part II, Item 1A, “Risk Factors.”\nCritical Accounting Policies and Estimates\nOur Condensed Consolidated Financial Statements are prepared in conformity with U.S. generally accepted accounting principles (“GAAP”). In preparing our Condensed Consolidated Financial Statements, we make assumptions, judgments, and estimates that can have a significant impact on amounts reported in our Condensed Consolidated Financial Statements. We evaluate our estimates and assumptions on an ongoing basis.  We base our assumptions, judgments, and estimates on historical experience and various other factors that we believe to be reasonable under the circumstances. Actual results could differ materially from these estimates under different assumptions or conditions. Our significant accounting policies are described in Item 8, “Financial Statements and Supplementary Data,” Note 1, “Business and Summary of Significant Accounting Policies,” in the Notes to Consolidated Financial Statements in our Annual Report on Form 10-K for the fiscal year ended January 31, 2025.  \nAn accounting policy is deemed to be critical if it requires an accounting estimate to be made based on assumptions about matters that are highly uncertain at the time the estimate is made, if different estimates reasonably could have been used, or if changes in the estimate that are reasonably possible could materially impact the financial statements.  We highlighted those policies that involve a higher degree of judgment and complexity with further discussion in Item 7, “Management’s Discussion and Analysis of Financial Condition and Results of Operations,” in our Annual Report on Form 10-K. There have been no material changes to our critical accounting policies and estimates during the three and nine months ended October 31, 2025, as compared to those disclosed in our Annual Report on Form 10-K for the fiscal year ended January 31, 2025.  We believe these policies are the most critical to aid in fully understanding and evaluating our financial condition and results of operations. \nOverview of the Three and Nine Months Ended October 31,\n \n2025 \n \n•\nTotal net revenue increased 18% and 17% to $1.85 billion and $5.25 billion during the three and nine months ended October 31, 2025, respectively, compared to the same periods in the prior fiscal year.\n•\nRecurring revenue as a percentage of net revenue was 97% for both the three and nine months ended October 31, 2025, respectively, and 97% for both the three and nine months ended October 31, 2024.\n•\nNet revenue retention rate (“NR3”) was above 110%, on a constant currency basis, as of October 31, 2025, and was within the range of 100% and 110%, on a constant currency basis, as of October 31, 2024.\n•\nDeferred revenue was $3.85 billion, a decrease of 7% compared to the fourth quarter in the prior fiscal year. \n•\nRemaining performance obligations (short-term and long-term deferred revenue plus unbilled deferred revenue) (“RPO”) was $7.36 billion, an increase of 6% compared to the fourth quarter in the prior fiscal year. \n•\nCurrent remaining performance obligations was $4.83 billion, an increase of 8% compared to the fourth quarter in the prior fiscal year. \nRevenue Analysis\nNet revenue increased 18% and 17% during the three and nine months ended October 31, 2025, respectively, as compared to the same periods in the prior fiscal year, primarily due to an increase in subscription revenue.  For further discussion of these results, see below under the heading “Results of Operations.” \nWe rely significantly upon major distributors and resellers in both the U.S. and international regions, including TD Synnex Corporation and its global affiliates (collectively, “TD Synnex”). Total revenue from TD Synnex accounted for 12% and 16% of our total net revenue during the three and nine months ended October 31, 2025, respectively. Total revenue from TD Synnex accounted for 33% and 35% of Autodesk’s total net revenue during the three and nine months ended October 31, 2024, respectively. Our customers through TD Synnex are the resellers and end users who purchase our software subscriptions and services. In connection with our new transaction model, we entered into agreements to provide transition distribution activities with certain distributors and entered into a new distribution agreement with TD Synnex for government business in certain jurisdictions. We maintained distribution relationships in emerging markets. We have increased our selling efforts with Solution Providers in connection with our new transaction model. Consequently, we believe our business is not substantially dependent on TD Synnex.\n34\n \nRecurring Revenue and Net Revenue Retention Rate \nIn order to help better understand our financial performance, we use several key performance metrics including recurring revenue and NR3. These metrics are key performance metrics and should be viewed independently of revenue and deferred revenue as these metrics are not intended to be combined with those items. We use these metrics to monitor the strength of our recurring business. We believe these metrics are useful to investors because they can help in monitoring the long-term health of our business. Our determination and presentation of these metrics may differ from that of other companies. The presentation of these metrics is meant to be considered in addition to, not as a substitute for or in isolation from, our financial measures prepared in accordance with GAAP.  Please refer to the Glossary of Terms for the definitions of these metrics.\nThe following table outlines our recurring revenue metric for the three and nine months ended October 31, 2025 and 2024:\nThree Months Ended October 31, 2025\nChange compared to\nprior fiscal year\nThree Months Ended October 31, 2024\n(In millions, except percentage data) \n$\n%    \nRecurring revenue\n \n(1) \n$\n1,804 \n$\n274 \n18 \n%\n$\n1,530 \nAs a percentage of net revenue\n97 \n%\nN/A\nN/A\n97 \n%\nNine Months Ended October 31, 2025\nChange compared to\nprior fiscal year\nNine Months Ended October 31, 2024\n$\n%    \nRecurring Revenue\n \n(1)\n$\n5,115 \n$\n737 \n17 \n%\n$\n4,378 \nAs a percentage of net revenue\n97 \n%\nN/A\nN/A\n97 \n%\n ________________\n(1)\nThe acquisition of a business may cause variability in the comparison of recurring revenue in this table above and recurring revenue derived from the revenue reported in the Condensed Consolidated Statements of Operations.\nNR3 was above 110%, on a constant currency basis, as of October 31, 2025, in part due to our new transaction model, and was within the range of 100% and 110%, on a constant currency basis, as of October 31, 2024.\nForeign Currency Analysis \nWe generate a significant amount of our revenue in the United States, Germany, Japan, the United Kingdom, and Canada.\nThe following table shows the impact of foreign exchange rate changes on our net revenue and total spend: \nThree Months Ended October 31, 2025\nNine Months Ended October 31, 2025\nPercent change compared to\nprior fiscal year\nConstant Currency percent change compared to\nprior fiscal year (1)\nPositive/Negative/Neutral impact from foreign exchange rate changes\nPercent change compared to\nprior fiscal year\nConstant Currency percent change compared to\nprior fiscal year (1)\nPositive/Negative/Neutral impact from foreign exchange rate changes\nNet revenue\n18 \n%\n18 \n%\nFlat\n17 \n%\n18 \n%\nNegative\nTotal spend \n13 \n%\n13 \n%\nFlat\n17 \n%\n17 \n%\nFlat\n ________________\n(1)\nPlease refer to the Glossary of Terms for the definitions of our constant currency growth rates. \nChanges in the value of the U.S. dollar may have a significant effect on net revenue, total spend, and income from operations in future periods. We use foreign currency contracts to reduce the exchange rate effect on a portion of the net revenue of certain anticipated transactions but do not attempt to completely mitigate the impact of fluctuations of such foreign currency against the U.S. dollar.\n35\n \nRemaining Performance Obligations\nRPO represents deferred revenue and contractually stated or committed contracts under early renewal and multi-year billing plans for subscription, services, license, and maintenance for which the associated deferred revenue has not yet been recognized. Unbilled deferred revenue is not included as a receivable or deferred revenue on our Condensed Consolidated Balance Sheets. See Part I, Item 1, “Financial Statements,” Note 3, “Revenue Recognition,” for more details on Autodesk's performance obligations. \n(in millions)\nOctober 31, 2025\nJanuary 31, 2025\nDeferred revenue\n$\n3,846 \n$\n4,128 \nUnbilled deferred revenue \n3,515 \n2,810 \nRPO  \n$\n7,361 \n$\n6,938 \nRPO consisted of the following:\n(in millions)\nOctober 31, 2025\nJanuary 31, 2025\nCurrent RPO  \n$\n4,830 \n$\n4,457 \nNon-current RPO  \n2,531 \n2,481 \nRPO  \n$\n7,361 \n$\n6,938 \nWe expect that the amount of RPO will change from quarter to quarter for several reasons, including the specific timing, duration, and size of customer subscription and support agreements, the specific timing of customer renewals, and foreign currency fluctuations. Historically, we have had increased EBA sales activity in our fourth fiscal quarter and this seasonality may affect the relative value of our billings, RPO, and collections in the fourth and first fiscal quarters. As customers continue to transition from multi-year subscription contracts billed upfront to annual billing installments, some customers may choose annual contracts instead. If this were to occur, we would expect it to proportionately reduce the unbilled portion of our total remaining performance obligations and would expect it to impact total RPO growth rates negatively. Deferred revenue, billings, current RPO, revenue, non-GAAP operating margin, and free cash flow would remain broadly unchanged in this scenario. \nBalance Sheet and Cash Flow Items \nAt October 31, 2025, we had $2.59 billion in cash, cash equivalents, and marketable securities. Our cash flow from operations increased to $1.46 billion for the nine months ended October 31, 2025, compared to $915 million for the nine months ended October 31, 2024. We repurchased 3 million shares of our common stock for $1.07 billion during the nine months ended October 31, 2025. Comparatively, we repurchased 1.7 million shares of our common stock for $443 million during the nine months ended October 31, 2024. See further discussion regarding the balance sheet and cash flow activities under the heading “Liquidity and Capital Resources.”\nResults of Operations \nOverview\nWe believe our investment in cloud products and a subscription business model, backed by a strong balance sheet, give us a robust foundation to successfully navigate complex geopolitical and global macro-economic challenges. However, material scarcity, supply chain disruption and resulting inflationary pressures, higher interest rates, a global labor shortage, ongoing geopolitical conflicts, economic and regulatory uncertainty, the potential for global trade wars, and foreign exchange rate fluctuations, may impact our outlook. We also expect our continued transition to annual billings for multi-year contracts to impact the timing of our billings and cash collections. The extent of the impact of these risks on our business in remaining fiscal 2026 and beyond will depend on several factors, some of which are out of our control. Further discussion of the potential impacts of these risks on our business can be found in Part II, Item 1A, “Risk Factors.” \n36\n \nOur sales incentives to Solution Providers are recorded as operating expenses under the new transaction model in which  Solution Providers provide a quote to customers but the actual transaction occurs directly between Autodesk and the customer. Accordingly, we expect sales incentives paid to resellers recorded as a reduction of transaction price and subsequently recognized as a reduction to subscription revenue over the contract period to continue to decrease as we have transitioned to the new transaction model. Most of the sales incentives payments to Solution Providers in our new transaction model are considered incremental and recoverable costs of obtaining a contract with a customer and are capitalized and included in “Prepaid expenses and other current assets” and “Long-term other assets” on the Consolidated Balance Sheets. The deferred costs are amortized over the period of benefit and recorded to “Sales and Marketing” on the Consolidated Statement of Operations. The sales incentives not qualifying for capitalization are recorded to “Sales and Marketing” on the Consolidated Statement of Operations as the costs are incurred under the incentive program requirements.  During fiscal 2026, we expect the change in recognition of sales incentives to indirect channels from contra revenue to operating expenses under the new transaction model to positively impact calculated revenue growth, while being broadly neutral to calculated operating profit and free cash flow dollars, and to result in a calculated negative impact to operating margin. \nNet Revenue\nNet Revenue by Income Statement Presentation \nSubscription revenue consists of our term-based product subscriptions, cloud service offerings, and flexible EBAs. Revenue from these arrangements is predominately recognized ratably over the contract term commencing with the date our service is made available to customers and when all other revenue recognition criteria have been satisfied.\nMaintenance revenue consists of fees for maintenance purchased with software licenses. Under our maintenance plan, customers are eligible to receive unspecified upgrades, when and if available, and technical support. We recognize maintenance revenue ratably over the term of the agreements, which is generally one year. \nOther revenue consists of revenue from other products and services and is recognized as the products are delivered and services are performed. \n37\n \n \nThree Months Ended\nChange Compared to Prior Fiscal Year\nThree Months Ended\nManagement Comments\n(In millions, except percentages)\nOctober 31, 2025\n$    \n%    \nOctober 31, 2024\nNet Revenue:\nSubscription\n$\n1,734 \n$\n277 \n19 \n%\n$\n1,457 \nIncrease due to growth in subscription renewal revenue from the current subscriber base as compared to the prior period. Also contributing to the growth was an increase in revenue from Cloud Service offerings and EBA offerings.\nMaintenance\n8 \n(1)\n(11)\n%\n9 \nTotal subscription and maintenance revenue\n1,742 \n276 \n19 \n%\n1,466 \nOther \n111 \n7 \n7 \n%\n104 \n$\n1,853 \n$\n283 \n18 \n%\n$\n1,570 \n \nNine Months Ended\nChange compared to\nprior fiscal year\nNine Months Ended\nManagement Comments\nOctober 31, 2025\n$\n%    \nOctober 31, 2024\nNet Revenue:\nSubscription\n$\n4,924 \n$\n729 \n17 \n%\n$\n4,195 \nIncrease due to growth in subscription renewal revenue from the current subscriber base as compared to the prior period. Also contributing to the growth was an increase in revenue from Cloud Service offerings and EBA offerings.\nMaintenance\n25 \n(6)\n(19)\n%\n31 \nTotal subscription and maintenance revenue\n4,949 \n723 \n17 \n%\n4,226 \nOther\n300 \n34 \n13 \n%\n266 \n$\n5,249 \n$\n757 \n17 \n%\n$\n4,492 \n38\n \nNet Revenue by Product Family\nOur product offerings are focused in four primary product families: Architecture, Engineering, Construction and Operations (“AECO”), AutoCAD and AutoCAD LT, Manufacturing (“MFG”), and Media and Entertainment (“M&E”).\n \nThree Months Ended\nChange compared to\nprior fiscal year\nThree Months Ended\nManagement Comments\n(In millions, except percentages)\nOctober 31, 2025\n$    \n%    \nOctober 31, 2024\nNet Revenue by Product Family:\nAECO\n$\n921 \n$\n170 \n23 \n%\n$\n751 \nIncrease due to growth in revenue from AEC Collections, EBA offerings, and Autodesk Construction Cloud.\nAutoCAD and AutoCAD LT  \n458 \n60 \n15 \n%\n398 \nIncrease due to growth in revenue from both AutoCAD and AutoCAD LT.\nMFG\n355 \n48 \n16 \n%\n307 \nIncrease due to growth in revenue from MFG Collections, Inventor, and Fusion.\nM&E\n86 \n3 \n4 \n%\n83 \nIncrease primarily due to lower contra revenue driven by the adoption of the new transaction model.\nOther\n33 \n2 \n6 \n%\n31 \nTotal Net Revenue\n$\n1,853 \n$\n283 \n18 \n%\n$\n1,570 \nNine Months Ended\nChange compared to\nprior fiscal year\nNine Months Ended\nManagement Comments\nOctober 31, 2025\n$\n%    \nOctober 31, 2024\nNet Revenue by Product Family:\nAECO \n$\n2,608 \n$\n470 \n22 \n%\n$\n2,138 \nIncrease due to growth in revenue from AEC Collections, EBA offerings, and Autodesk Construction Cloud.\nAutoCAD and AutoCAD LT \n1,309 \n146 \n13 \n%\n1,163 \nIncrease due to growth in revenue from both AutoCAD and AutoCAD LT.\nMFG\n998 \n127 \n15 \n%\n871 \nIncrease due to growth in revenue from MFG Collections, Fusion, and Inventor.\nM&E\n242 \n11 \n5 \n%\n231 \nIncrease primarily due to lower contra revenue due to the adoption of the new transaction model.\nOther\n92 \n3 \n3 \n%\n89 \nTotal Net Revenue\n$\n5,249 \n$\n757 \n17 \n%\n$\n4,492 \n39\n \nNet Revenue by Geographic Area\nThree Months Ended October 31, 2025\nChange compared to\nprior fiscal year\nConstant currency change compared to prior fiscal year\nThree Months Ended October 31, 2024\n(In millions, except percentages)\n$    \n%    \n%    \nNet Revenue:\nAmericas\nU.S.\n$\n666 \n$\n87 \n15 \n%\n*\n$\n579 \nOther Americas\n154 \n28 \n22 \n%\n*\n126 \nTotal Americas\n820 \n115 \n16 \n%\n17 \n%\n705 \nEMEA\n715 \n135 \n23 \n%\n22 \n%\n580 \nAPAC\n318 \n33 \n12 \n%\n14 \n%\n285 \nTotal Net Revenue\n$\n1,853 \n$\n283 \n18 \n%\n18 \n%\n$\n1,570 \nNine Months Ended October 31, 2025\nChange compared to\nprior fiscal year\nConstant currency change compared to prior fiscal year\nNine Months Ended October 31, 2024\n(In millions, except percentages)\n$    \n%    \n%    \nNet Revenue:\nAmericas\nU.S.\n$\n1,880 \n$\n249 \n15 \n%\n*\n$\n1,631 \nOther Americas\n451 \n96 \n27 \n%\n*\n355 \nTotal Americas\n2,331 \n345 \n17 \n%\n18 \n%\n1,986 \nEMEA\n2,017 \n333 \n20 \n%\n20 \n%\n1,684 \nAPAC\n901 \n79 \n10 \n%\n13 \n%\n822 \nTotal Net Revenue\n$\n5,249 \n$\n757 \n17 \n%\n18 \n%\n$\n4,492 \n____________________ \n*        Constant currency data not provided at this level. \nWe believe that international revenue will continue to comprise a majority of our net revenue. Unfavorable economic conditions, including in connection with the ongoing geopolitical conflicts (and any related political or economic responses and counter-responses or otherwise by various global actors or the general effect on the global economy), or global trade wars, in the countries that contribute a significant portion of our net revenue, including in emerging economies such as Brazil, India, and China, has had and may continue to have an adverse effect on our business in those countries and our overall financial performance. Changes in the value of the U.S. dollar relative to other currencies have significantly affected, and could continue to significantly affect, our financial results for a given period even though we hedge a portion of our current and projected revenue. Increases to the levels of political and economic unpredictability or protectionism in the global market may impact our future financial results.\n40\n \n     Net Revenue by Sales Channel\n \nThree Months Ended\nChange compared to\nprior fiscal year\nThree Months Ended\n(In millions, except percentages)\nOctober 31, 2025\n$    \n%    \nOctober 31, 2024\nNet Revenue by Sales Channel:\nIndirect\n$\n626 \n$\n(282)\n(31)\n%\n$\n908 \nDirect\n1,227 \n565 \n85 \n%\n662 \nTotal Net Revenue \n$\n1,853 \n$\n283 \n18 \n%\n$\n1,570 \nNine Months Ended\nChange compared to\nprior fiscal year\nNine Months Ended\nOctober 31, 2025\n$\n%    \nOctober 31, 2024\nNet Revenue by Sales Channel:\nIndirect\n$\n2,044 \n$\n(652)\n(24)\n%\n$\n2,696 \nDirect\n3,205 \n1,409 \n78 \n%\n1,796 \nTotal Net Revenue \n$\n5,249 \n$\n757 \n17 \n%\n$\n4,492 \n For the three months ended October 31, 2025 and 2024, approximately 66% and 42%, respectively, of our revenue was derived from direct sales to customers. For the nine months ended October 31, 2025 and 2024, approximately 61% and 40%, respectively, of our revenue was derived from direct sales to customers. With the continued growth of our online Autodesk branded store and the introduction of our new transaction model, we have been decreasing our sales through resellers and distributors and transacting directly with more end customers. We anticipate that our revenue by direct sales channel will continue to increase as a percentage of total net revenue. We expect our indirect channel will continue to transact and support a considerable portion of our customers, particularly in emerging regions.\nNet Revenue by Product Type \nThree Months Ended October 31, 2025\nChange compared to\nprior fiscal year\nThree Months Ended October 31, 2024\n(In millions, except percentages)\n$    \n%    \nManagement Comments\nNet Revenue by Product Type:\nDesign\n$\n1,537 \n$\n242 \n19 \n%\n$\n1,295 \nIncrease primarily due to growth in AEC collections, EBA offerings, AutoCAD, AutoCAD LT, and MFG collections.\nMake\n205 \n34 \n20 \n%\n171 \nIncrease primarily due to growth in revenue from Autodesk Construction Cloud and Fusion.\nOther\n111 \n7 \n7 \n%\n104 \nTotal Net Revenue\n$\n1,853 \n$\n283 \n18 \n%\n$\n1,570 \nNine Months Ended October 31, 2025\nChange compared to\nprior fiscal year\nNine Months Ended October 31, 2024\n(In millions, except percentages)\n$    \n%    \nManagement Comments\nNet Revenue by Product Type:\nDesign\n$\n4,371 \n$\n623 \n17 \n%\n$\n3,748 \nIncrease primarily due to growth in AEC collections, EBA offerings, AutoCAD, AutoCAD LT, and MFG collections.\nMake\n578 \n100 \n21 \n%\n478 \nIncrease primarily due to growth in revenue from Autodesk Construction Cloud and Fusion.\nOther\n300 \n34 \n13 \n%\n266 \nTotal Net Revenue\n$\n5,249 \n$\n757 \n17 \n%\n$\n4,492 \n41\n \nCost of Revenue and Operating Expenses\nCost of subscription and maintenance revenue includes the labor costs of providing product support to our subscription and maintenance customers, SaaS vendor costs and allocated IT costs, facilities costs, professional services fees related to operating our network and cloud infrastructure, royalties, depreciation expense and operating lease payments associated with computer equipment, data center costs, related expenses of network operations, stock-based compensation expense, and gains and losses on our operating expense cash flow hedges.\nCost of other revenue includes costs of consulting and training services contracts and collaborative project management services contracts. Cost of other revenue also includes stock-based compensation expense, overhead charges, allocated IT and facilities costs, professional services fees, and gains and losses on our operating expense cash flow hedges. \nCost of revenue, at least over the near term, is affected by labor costs, hosting costs for our cloud offerings, the volume and mix of product sales, fluctuations in consulting costs, amortization of developed technology, new customer support offerings, royalty rates for licensed technology embedded in our products, stock-based compensation expense, and gains and losses on our operating expense cash flow hedges.\nMarketing and sales expenses include salaries, bonuses, benefits, and stock-based compensation expense for our marketing and sales employees, the expense of travel, entertainment, and training for such personnel, sales commissions to employees and Solution Providers, and the costs of programs aimed at increasing revenue, such as advertising, trade shows and expositions, and various sales and promotional programs. Marketing and sales expenses also include SaaS vendor costs and allocated IT costs, payment processing fees, the cost of supplies and equipment, gains and losses on our operating expense cash flow hedges, facilities costs, and labor costs associated with sales and order management.\nResearch and development expenses, which are expensed as incurred, consist primarily of salaries, bonuses, benefits, and stock-based compensation expense for research and development employees, the expense of travel, entertainment, and training for such personnel, professional services such as fees paid to software development firms and independent contractors, SaaS vendor costs and allocated IT costs, gains and losses on our operating expense cash flow hedges, and facilities costs.\nGeneral and administrative expenses include salaries, bonuses, benefits, and stock-based compensation expense for our CEO, finance, human resources, and legal employees, as well as professional fees for legal and accounting services, SaaS vendor costs and net IT costs, certain foreign business taxes, gains and losses on our operating expense cash flow hedges, expense of travel, entertainment, and training, facilities costs, acquisition-related costs, and the cost of supplies and equipment.\nRestructuring, other exit costs, and facility reductions include charges related to the restructuring plan (“2026 Plan”) to support our initiatives to optimize our go-to-market organization and, at the same time, to reallocate resources to our strategic priorities of investments in cloud, platform and artificial intelligence. With this restructuring plan, we are realigning roles to maximize talent investments and to distribute critical expertise globally. \nThree Months Ended\nChange compared to\nprior fiscal year\nThree Months Ended\nManagement comments\n(In millions, except percentages)\nOctober 31, 2025\n$    \n%    \nOctober 31, 2024\nCost of revenue:\nSubscription and maintenance\n$\n118 \n$\n13 \n12 \n%\n$\n105 \nIncrease primarily due to an increase in cloud hosting costs and employee-related costs.\nOther \n22 \n3 \n16 \n%\n19 \nIncrease primarily due to employee-related costs driven by higher headcount.\nAmortization of developed technologies\n25 \n2 \n9 \n%\n23 \nIncrease due to amortization of capitalized software costs.\nTotal cost of revenue\n$\n165 \n$\n18 \n12 \n%\n$\n147 \nOperating expenses:\nMarketing and sales\n$\n612 \n$\n87 \n17 \n%\n$\n525 \nIncrease primarily due to an increase in sales commissions to Solution Providers due to the recognition of these costs in marketing and sales expense under the new transaction model partially offset by a decrease in employee-related costs.\n42\n \nResearch and development\n416 \n38 \n10 \n%\n378 \nIncrease primarily due to an increase in employee-related costs driven by higher headcount and an increase in cloud hosting costs.\nGeneral and administrative\n172 \n11 \n7 \n%\n161 \nIncrease primarily due to charitable contributions to the Autodesk Foundation and an increase in employee-related costs.\nAmortization of purchased intangibles \n13 \n— \n— \n%\n13 \nAmortization of purchased intangibles remained flat period over period.\nRestructuring, other exit costs, and facility reductions\n5 \n5 \nNM (1)\n— \nThe increase is due to the restructuring plan initiated during the first quarter of fiscal 2026. See Part I, Item 1, “Financial Statements, Note 16, “Restructuring, other exit costs, and facility reductions” for more details.\nTotal operating expenses\n$\n1,218 \n$\n141 \n13 \n%\n$\n1,077 \nNine Months Ended\nChange compared to\nprior fiscal year\nNine Months Ended\nManagement comments\nOctober 31, 2025\n$\n%    \nOctober 31, 2024\nCost of revenue:\nSubscription and maintenance\n$\n343 \n$\n38 \n12 \n%\n$\n305 \nIncrease primarily due to an increase in cloud hosting costs and employee-related costs.\nOther \n68 \n11 \n19 \n%\n57 \nIncrease primarily due to employee-related costs driven by higher headcount.\nAmortization of developed technologies\n73 \n11 \n18 \n%\n62 \nIncrease is primarily due to amortization of acquired developed technologies as a result of acquisitions in fiscal 2025.\nTotal cost of revenue\n$\n484 \n$\n60 \n14 \n%\n$\n424 \nOperating expenses:\nMarketing and sales\n$\n1,737 \n$\n263 \n18 \n%\n$\n1,474 \nIncrease primarily due to an increase in sales commissions to Solution Providers due to the recognition of these costs in marketing and sales expense under the new transaction model partially offset by a decrease in employee-related costs.\nResearch and development\n1,223 \n131 \n12 \n%\n1,092 \nIncrease primarily due to employee-related costs driven by higher headcount and an increase in cloud hosting costs.\nGeneral and administrative\n502 \n25 \n5 \n%\n477 \nIncrease primarily due to an increase in stock-based compensation expense, professional fees and charitable contributions to the Autodesk Foundation partially offset by a decrease in acquisition-related costs.\nAmortization of purchased intangibles \n40 \n3 \n8 \n%\n37 \nThe increase is primarily due to amortization of acquired intangibles as a result of acquisitions in fiscal 2025.\nRestructuring, other exit costs, and facility reductions\n116 \n116 \nNM (1)\n— \nThe increase is due to the restructuring plan initiated during the first quarter of fiscal 2026. See Part I, Item 1, “Financial Statements, Note 16, “Restructuring, other exit costs, and facility reductions” for more details.\nTotal operating expenses\n$\n3,618 \n$\n538 \n17 \n%\n$\n3,080 \n_______________ \n(1)\nNot meaningful.\n43\n \nThe following table highlights our expectation for the absolute dollar change between the fourth quarter of fiscal 2026, as compared to the fourth quarter of fiscal 2025:\nAbsolute dollar impact\nManagement Comments\nCost of revenue\nIncrease\nWe expect our cost of revenue to increase as our revenue grows.\nMarketing and sales\nIncrease\nWe expect marketing and sales expenses to increase with the recognition of Solution Provider commissions under our new transaction model, partially offset by savings from the restructuring initiated in fiscal 2026.\nResearch and development\nIncrease\nWe expect our research and development expenses to increase as we continue our investments in cloud, platform, and artificial intelligence partially offset by savings from the restructuring initiated in fiscal 2026.\nGeneral and administrative\nDecrease\nWe expect general and administrative expenses to slightly decrease as we gain operational leverage.\nAmortization of purchased intangibles \nFlat\nWe expect our amortization of purchased intangibles to remain unchanged.\nRestructuring, other exit costs, and facility reductions\nDecrease\nWe expect immaterial restructuring, other exit costs, and facility reductions in the fourth quarter of fiscal 2026 related to the restructuring plan initiated during the first quarter of fiscal 2026 as the plan is substantially complete as of October 31, 2025.\nInterest and Other Income (Expense), Net\nThe following table sets forth the components of interest and other income (expense), net:\n \nThree Months Ended October 31,\nNine Months Ended October 31,\n(in millions)\n2025\n2024\n2025\n2024\nInterest and investment income, net\n$\n9 \n$\n6 \n$\n18 \n$\n25 \nGain on foreign currency\n2 \n— \n6 \n3 \nLoss on strategic investments\n(15)\n(3)\n(17)\n(9)\nOther income \n2 \n2 \n4 \n5 \nInterest and other (loss) income, net\n$\n(2)\n$\n5 \n$\n11 \n$\n24 \nInterest and other (loss) income, net, negatively changed by $7 million during the three months ended October 31, 2025 and decreased $13 million during the nine months ended October 31, 2025, respectively, as compared to the same periods in the prior fiscal year. The negative change in the three months ended October 31, 2025, as compared to the same period in the prior fiscal year was primarily due to an increase in losses on strategic investments. The decrease in the nine months ended October 31, 2025, as compared to the same period in the prior fiscal year was primarily due an increase in losses on strategic investments, decrease in interest income, and an increase interest expenses.\nInterest expense and investment income fluctuates based on average cash, marketable securities, debt balances, average maturities, and interest rates. \nGains and losses on foreign currency are primarily due to the impact of re-measuring foreign currency transactions and net monetary assets into the functional currency of the corresponding entity. The amount of the gain or loss on foreign currency is driven by the volume of foreign currency transactions and the foreign currency exchange rates for the period.\nProvision for Income Taxes\nWe had income tax expense of $125 million, relative to pre-tax income of $468 million for the three months ended October 31, 2025, and income tax expense of $76 million, relative to pre-tax income of $351 million for the three months ended October 31, 2024. Income tax expense for the three months ended October 31, 2025, reflects U.S. and foreign tax expense, including withholding tax, reduced by tax-deductible stock-based compensation, and tax credits.\n44\n \nWe had income tax expense of $350 million, relative to pre-tax income of $1.16 billion for the nine months ended October 31, 2025, and income tax expense of $203 million, relative to pre-tax income of $1.01 billion for the nine months ended October 31, 2024. Income tax expense for the nine months ended October 31, 2025, reflects U.S. and foreign tax expense, including withholding tax, reduced by tax-deductible stock-based compensation, and tax credits.\nThe income tax expense for both the three and the nine months ended October 31, 2025, increased compared to the corresponding periods in fiscal year 2025, primarily due to the election made in the U.S. regarding the timing of taxation of revenue, which reduced the taxable benefit arising from foreign-derived deduction-eligible income (“FDDEI”) and increased tax expense associated with NCTI in combination with the tax law change to full expensing of U.S. research and development expenses under the One Big Beautiful Bill Act (“OBBBA”), offset by benefits arising from return-to-provision adjustments relating to filing the fiscal year 2025 U.S. income tax return.\nWe filed an election in the U.S. for fiscal year 2026 that will more closely align the timing of taxation of our revenue with our U.S. GAAP revenue recognition principles. The one-time impact of this election reduces our estimated tax payments and increases our provision for income taxes due to the loss of taxation benefits through FDDEI and NCTI tax regimes.\nThe U.S. Tax Cut and Jobs Act (“Tax Act”) enacted on December 22, 2017, requires taxpayers to capitalize and amortize research and development expenses over five or fifteen years beginning in fiscal 2023. On July 4, 2025, the enactment of the OBBBA permanently eliminated the requirement to capitalize and amortize U.S. research and development expenses, thus, reducing the capitalization requirement to foreign research and development expenses only. In addition to this change, the OBBBA includes a broad range of tax reform provisions initially established by the Tax Act. The OBBBA has multiple effective dates, with certain provisions effective in fiscal year 2026 and others effective in fiscal year 2027.\nWe have reasonably estimated the tax effects of OBBBA and included the impact in our provision for income taxes as of October 31, 2025. For fiscal year 2026, the incremental effect of the OBBBA on the provision for income taxes was reduced due to the preceding elections to align the timing of our revenue with our U.S. GAAP revenue recognition principles. \nAs we continually strive to optimize our overall business model, tax planning strategies may become feasible and prudent allowing us to realize many of the deferred tax assets that are offset by a valuation allowance; therefore, we will continue to evaluate the ability to utilize the deferred tax assets each quarter, both in the U.S. and in foreign jurisdictions, based on all available evidence, both positive and negative.\nOur future effective annual tax rate may be materially impacted by the amount of benefits and charges from tax amounts associated with our foreign earnings that are taxed at rates different from the federal statutory rate, changes in valuation allowances, level of profit before tax, accounting for uncertain tax positions, business combinations, closure of statute of limitations or settlement of tax audits, and changes in tax laws. A significant amount of our earnings are generated by our European and Asia Pacific subsidiaries. Our future effective tax rates may be adversely affected to the extent earnings are lower than anticipated in countries where we have lower statutory tax rates. \nSigned into law on August 16, 2022 in the U.S., the Inflation Reduction Act contains many revisions to the Internal Revenue Code effective in taxable years beginning after December 31, 2022, including a 15% corporate alternative minimum tax. We expect that this will not have a material impact on our provision for income taxes in the current fiscal year.\n45\n \nOther Financial Information\nIn addition to our results determined under GAAP discussed above, we believe the following non-GAAP measures are useful to investors in evaluating our operating performance. For the three and nine months ended October 31, 2025 and 2024, our gross profit, income from operations, operating margin, net income, and diluted net income per share on a GAAP and non-GAAP basis were as follows (in millions except for operating margin and per share data):\n \nThree Months Ended October 31,\nNine Months Ended October 31,\n \n2025\n2024\n2025\n2024\n \n(Unaudited)\nGross profit\n$\n1,688 \n$\n1,423 \n$\n4,765 \n$\n4,068 \nNon-GAAP gross profit\n$\n1,725 \n$\n1,457 \n$\n4,876 \n$\n4,163 \nIncome from operations\n$\n470 \n$\n346 \n$\n1,147 \n$\n988 \nNon-GAAP income from operations\n$\n698 \n$\n573 \n$\n1,987 \n$\n1,623 \nOperating margin\n25 \n%\n22 \n%\n22 \n%\n22 \n%\nNon-GAAP operating margin\n38 \n%\n36 \n%\n38 \n%\n36 \n%\nNet income \n$\n343 \n$\n275 \n$\n808 \n$\n809 \nNon-GAAP net income \n$\n575 \n$\n470 \n$\n1,632 \n$\n1,341 \nGAAP diluted net income per share\n$\n1.60 \n$\n1.27 \n$\n3.76 \n$\n3.73 \nNon-GAAP diluted net income per share\n$\n2.67 \n$\n2.17 \n$\n7.59 \n$\n6.18 \nFor our internal budgeting and resource allocation process and as a means to provide consistency in period-to-period comparisons, we use non-GAAP measures to supplement our condensed consolidated financial statements presented on a GAAP basis. These non-GAAP measures do not include certain items that may have a material impact upon our reported financial results. We also use non-GAAP measures in making operating decisions because we believe those measures provide meaningful supplemental information regarding our earning potential and performance for management by excluding certain benefits, credits, expenses, and charges that may not be indicative of our core business operating results.  For the reasons set forth below, we believe these non-GAAP financial measures are useful to investors both because (1) they allow for greater transparency with respect to key metrics used by management in its financial and operational decision-making and (2) they are used by our institutional investors and the analyst community to help them analyze the health of our business. This allows investors and others to better understand and evaluate our operating results and future prospects in the same manner as management, compare financial results across accounting periods and to those of peer companies, and to better understand the long-term performance of our core business. We also use some of these measures for purposes of determining company-wide incentive compensation. \nThere are limitations in using non-GAAP financial measures because non-GAAP financial measures are not prepared in accordance with GAAP and may be different from non-GAAP financial measures used by other companies. The non-GAAP financial measures included above are limited in value because they exclude certain items that may have a material impact upon our reported financial results. In addition, they are subject to inherent limitations as they reflect the exercise of judgments by management about which charges are excluded from the non-GAAP financial measures. We compensate for these limitations by analyzing current and future results on a GAAP basis as well as a non-GAAP basis and also by providing GAAP measures in our public disclosures. The presentation of non-GAAP financial information is meant to be considered in addition to, not as a substitute for or in isolation from, the directly comparable financial measures prepared in accordance with GAAP. We urge investors to review the reconciliation of our non-GAAP financial measures to the comparable GAAP financial measures included below, and not to rely on any single financial measure to evaluate our business. \n46\n \nReconciliation of GAAP Financial Measures to Non-GAAP Financial Measures\n(In millions except for operating margin and per share data):\n \nThree Months Ended October 31,\nNine Months Ended October 31,\n \n2025\n2024\n2025\n2024\n \n(Unaudited)\nGross profit\n$\n1,688 \n$\n1,423 \n$\n4,765 \n$\n4,068 \nStock-based compensation expense\n14 \n12 \n44 \n36 \nAmortization of developed technologies\n23 \n22 \n67 \n59 \nNon-GAAP gross profit\n$\n1,725 \n$\n1,457 \n$\n4,876 \n$\n4,163 \nIncome from operations\n$\n470 \n$\n346 \n$\n1,147 \n$\n988 \nStock-based compensation expense\n186 \n181 \n607 \n500 \nAmortization of purchased intangibles and developed technologies\n36 \n35 \n105 \n96 \nAcquisition-related costs\n1 \n11 \n12 \n39 \nRestructuring, other exit costs, and facility reductions\n5 \n— \n116 \n— \nNon-GAAP income from operations\n$\n698 \n$\n573 \n$\n1,987 \n$\n1,623 \nOperating margin\n25 \n%\n22 \n%\n22 \n%\n22 \n%\nStock-based compensation expense\n10 \n%\n12 \n%\n12 \n%\n11 \n%\nAmortization of purchased intangibles and developed technologies\n2 \n%\n2 \n%\n2 \n%\n2 \n%\nAcquisition-related costs\n— \n%\n1 \n%\n— \n%\n1 \n%\nRestructuring, other exit costs, and facility reductions\n— \n%\n— \n%\n2 \n%\n— \n%\nNon-GAAP operating margin (1)\n38 \n%\n36 \n%\n38 \n%\n36 \n%\nNet income \n$\n343 \n$\n275 \n$\n808 \n$\n809 \nStock-based compensation expense\n186 \n181 \n607 \n500 \nAmortization of purchased intangibles and developed technologies\n36 \n35 \n105 \n96 \nAcquisition-related costs\n1 \n11 \n12 \n39 \nRestructuring, other exit costs, and facility reductions\n5 \n— \n116 \n— \nLoss on strategic investments and dispositions, net\n15 \n3 \n17 \n9 \nIncome tax adjustments\n(11)\n(35)\n(33)\n(112)\nNon-GAAP net income \n$\n575 \n$\n470 \n$\n1,632 \n$\n1,341 \nDiluted net income per share\n$\n1.60 \n$\n1.27 \n$\n3.76 \n$\n3.73 \nStock-based compensation expense\n0.87 \n0.83 \n2.82 \n2.30 \nAmortization of purchased intangibles and developed technologies\n0.17 \n0.16 \n0.49 \n0.44 \nAcquisition-related costs\n— \n0.05 \n0.06 \n0.18 \nRestructuring, other exit costs, and facility reductions\n0.02 \n— \n0.54 \n— \nLoss on strategic investments and dispositions, net\n0.07 \n0.01 \n0.07 \n0.04 \nIncome tax adjustments\n(0.06)\n(0.15)\n(0.15)\n(0.51)\nNon-GAAP diluted net income per share\n$\n2.67 \n$\n2.17 \n$\n7.59 \n$\n6.18 \n________________\n(1)\nTotals may not sum due to rounding.\nOur non-GAAP financial measures may exclude the following, as applicable:\nStock-based compensation expenses.\n We exclude stock-based compensation expenses from non-GAAP measures primarily because they are non-cash expenses and management finds it useful to exclude certain non-cash charges to assess the appropriate level of various operating expenses to assist in budgeting, planning, and forecasting future periods.  Moreover, because of varying available valuation methodologies, subjective assumptions, and the variety of award types that companies can use under FASB Accounting Standards Codification (\"ASC\") Topic 718, we believe excluding stock-based compensation \n47\n \nexpenses allows investors to make meaningful comparisons between our recurring core business operating results and those of other companies.\nAmortization of developed technologies and purchased intangibles.\n We incur amortization of acquisition-related developed technologies and purchased intangibles in connection with acquisitions of certain businesses and technologies. Amortization of developed technologies and purchased intangibles is inconsistent in amount and frequency and is significantly affected by the timing and size of our acquisitions. Management finds it useful to exclude these variable charges from our cost of revenues to assist in budgeting, planning, and forecasting future periods. Investors should note that the use of intangible assets contributed to our revenues earned during the periods presented and will contribute to our future period revenues as well. Amortization of developed technologies and purchased intangible assets will recur in future periods.\nAcquisition-related costs.\n We exclude certain acquisition-related costs, including due diligence costs, professional fees in connection with an acquisition, certain financing costs, and certain integration-related expenses. These expenses are unpredictable, and dependent on factors that may be outside of our control and unrelated to the continuing operations of the acquired business or our Company. In addition, the size and complexity of an acquisition, which often drives the magnitude of acquisition-related costs, may not be indicative of such future costs. We believe excluding acquisition-related costs facilitates the comparison of our financial results to our historical operating results and to other companies in our industry.\nRestructuring, other exit costs, and facility reductions.\n These expenses are associated with realigning our business strategies based on current economic conditions. In connection with these restructuring actions or other exit actions, we recognize costs related to termination benefits for former employees whose positions were eliminated, the reduction of facilities, and cancellation of certain contracts. We exclude these charges because these expenses are not reflective of ongoing business and operating results. We believe it is useful for investors to understand the effects of these items on our total operating expenses. \nLoss (gain) on strategic investments and dispositions.\n We exclude gains and losses related to our strategic investments and dispositions of strategic investments, purchased intangibles, and businesses from our non-GAAP measures primarily because management finds it useful to exclude these variable gains and losses on these investments and dispositions in assessing our financial results. Included in these amounts are non-cash unrealized gains and losses on the derivative components, dividends received, realized gains and losses on the sales or losses on the impairment of these investments, and gain and loss on dispositions. We believe excluding these items is useful to investors because these excluded items do not correlate to the underlying performance of our business and these losses or gains were incurred in connection with strategic investments and dispositions which do not occur regularly. \nIncome tax adjustments. \nThe income tax effects that are excluded from the non-GAAP measures relate to the tax impact on the difference between GAAP and non-GAAP expenses, primarily due to stock-based compensation, amortization of purchased intangibles, and restructuring, other exit costs, and facility reductions for GAAP and non-GAAP measures. We remove GAAP discrete tax items, including changes in valuation allowance, from the non-GAAP measure of net income (loss). The non-GAAP tax provision is based on a projected long-term annual non-GAAP effective tax rate. Management believes the income tax adjustments assist investors in understanding the tax provision and the effective tax rate related to ongoing operations. We believe the exclusion of the discrete tax items provides investors with useful supplemental information about our operational performance. \nLiquidity and Capital Resources\nOur primary source of cash is from the sale of our software and related services. Our primary use of cash is payment of our operating costs, which consist primarily of employee-related expenses, such as compensation and benefits, as well as general operating expenses for marketing, facilities, and overhead costs. Long-term cash requirements for items other than normal operating expenses are anticipated for the following: the acquisition of businesses, software products, or technologies complementary to our business; repayment of debt; common stock repurchases; and capital expenditures, including the purchase and implementation of internal-use software applications.\nAt October 31, 2025, our principal sources of liquidity were cash, cash equivalents, and marketable securities totaling $2.59 billion, net accounts receivable of $806 million, and our revolving loan facility.\nIn May 2025, the Company terminated its previous credit agreement and entered into a new Credit Agreement (the “2025 Credit Agreement”) by and among the Company, the lenders party thereto and Citibank, N.A. (“Citibank”), as administrative agent, which provides for an unsecured revolving loan facility in the aggregate principal amount of $1.5 billion, with an option to increase the principal amount to $2 billion subject to receipt of additional commitments and other customary conditions. The proceeds from the 2025 Credit Agreement are available for working capital and general corporate purposes. At October 31, \n48\n \n2025, Autodesk had no outstanding borrowings under the 2025 Credit Agreement. See Part I, Item 1, “Financial Statements,” Note 13, “Borrowing Arrangements,” in the Notes to Condensed Consolidated Financial Statements for further discussion on our covenant requirements and additional information with respect to the 2025 Credit Agreement. If we are unable to remain in compliance with the covenants under the 2025 Credit Agreement, we will not be able to draw on our revolving credit facility. Additionally, as of November 26, 2025, we have no amounts outstanding under the 2025 Credit Agreement. \nAs of October 31, 2025, we have $2.50 billion aggregate principal amount of notes outstanding.  See Part I, Item 1, “Financial Statements,” Note 13, “Borrowing Arrangements,” in the Notes to Condensed Consolidated Financial Statements for further discussion. \nOur cash and cash equivalents are held by diversified financial institutions globally. Our primary commercial banking relationship is with Citigroup and its global affiliates. In addition, Citibank N.A., an affiliate of Citigroup, is one of the lead lenders and agent in the syndicate of our $1.5 billion revolving credit facility. \nOur cash and cash equivalents and marketable securities balances are concentrated in a few locations around the world, with substantial amounts held outside of the United States. As of October 31, 2025, approximately 56% of our total cash and cash equivalents and marketable securities are located in foreign jurisdictions and that percentage will fluctuate subject to business needs. There are several factors that can impact our ability to utilize foreign cash balances, such as foreign exchange restrictions, foreign regulatory restrictions, or adverse tax costs. Earnings in foreign jurisdictions are generally available for distribution to the United States with little to no incremental U.S. taxes. We regularly review our capital structure and consider a variety of potential financing alternatives and planning strategies to ensure we have the proper liquidity available in the locations in which it is needed. We expect to meet our liquidity needs through or in combination of current cash balances, ongoing cash flows, and external borrowings.\nCash from operations could also be affected by various risks and uncertainties, including, but not limited to, the risks detailed in Part II, Item 1A titled “Risk Factors.”  Based on our current business plan and revenue prospects, we believe that our existing cash and cash equivalents, our anticipated cash flows from operations, and our available revolving credit facility will be sufficient to meet our working capital and operating resource expenditure requirements for at least the next 12 months.  \nOur revenue, earnings, cash flows, receivables, and payables are subject to fluctuations due to changes in foreign currency exchange rates, for which we have put in place foreign currency contracts as part of our risk management strategy. See Part I, Item 3, “Quantitative and Qualitative Disclosures About Market Risk” for further discussion.\nNine Months Ended October 31,\n(in millions)\n2025\n2024\nNet cash provided by operating activities\n$\n1,463 \n$\n915 \nNet cash used in investing activities\n(101)\n(836)\nNet cash used in financing activities\n(979)\n(530)\nNet cash provided by operating activities of $1,463 million for the nine months ended October 31, 2025, primarily consisted of $808 million of our net income adjusted for $1,413 million non-cash items such as stock-based compensation expense, restructuring, other exit costs, and facility reductions, amortization of costs to obtain a contract with a customer, depreciation, amortization, and accretion expense, and deferred income tax offset by changes in operating assets and liabilities. The decrease in working capital is primarily due to a negative change in prepaid expenses and other assets of $819 million, and a decrease in deferred revenue of $286 million due to the timing of our billing installments and seasonality of billings in the fourth fiscal quarter, partially offset by the change in accounts receivable of $202 million due to the seasonality of our billings in the fourth fiscal quarter and timing of cash collections from customers. \nNet cash provided by operating activities of $915 million for the nine months ended October 31, 2024, primarily consisted of $809 million of our net income adjusted for $700 million non-cash items such as stock-based compensation expense,  amortization of costs to obtain a contract with a customer, depreciation, amortization, and accretion expense, and deferred income tax. The decrease in working capital is primarily due to a decrease in deferred revenue of $612 million due to the timing of our billing installments and seasonality of billings in the fourth fiscal quarter and a negative change in prepaid expenses and other assets of $221 million partially offset by the change in accounts receivable of $177 million due to the seasonality of our billings in the fourth fiscal quarter and timing of cash collections from customers. \n49\n \nNet cash used in investing activities was $101 million for the nine months ended October 31, 2025, primarily due to purchases of marketable securities partially offset by sales and maturities of marketable securities. Net cash used in investing activities was $836 million for the nine months ended October 31, 2024, primarily due to business combinations, net of cash acquired, and purchases of marketable securities partially offset by the sales and maturities of marketable securities. \nNet cash used in financing activities was $979 million for the nine months ended October 31, 2025, primarily due to the  repurchases of common stock and payment of notes payable due in June 2025 partially offset by the proceeds from the  issuance of notes payable due in June 2035. Net cash used in financing activities was $530 million for the nine months ended October 31, 2024, primarily due to repurchases of common stock.\nIssuer Purchases of Equity Securities\nAutodesk's stock repurchase programs provide Autodesk with the ability to offset the dilution from the issuance of stock under our employee stock plans and reduce shares outstanding over time and has the effect of returning excess cash generated from our business to stockholders. Under the share repurchase programs, Autodesk may repurchase shares from time to time in open market transactions, privately negotiated transactions, accelerated share repurchase programs, tender offers, or by other means.  The share repurchase programs do not have an expiration date and the pace and timing of repurchases will depend on factors such as cash generation from operations, available surplus, the volume of employee stock plan activity, remaining shares or dollar amount available in the authorized pool, cash requirements for acquisitions, cash requirements to retire outstanding debt, economic and market conditions, stock price, and legal and regulatory requirements.\nThe following table provides information about the repurchase of common stock in open-market transactions during the three months ended October 31, 2025:\n(Shares in thousands)\nTotal Number of\nShares\nPurchased\nAverage Price Paid per Share\nTotal Number of Shares Purchased as Part of Publicly Announced Plans or Programs (1)\nApproximate Dollar Value of Shares that May Yet Be Purchased Under the Plans or Programs \n(in millions) \n(2)\nAugust 1 - August 31\n411 \n$\n290.70 \n411 \n$\n8,055 \nSeptember 1 - September 30\n336 \n321.64 \n336 \n$\n7,947 \nOctober 1 - October 31\n426 \n309.41 \n426 \n$\n7,815 \nTotal\n1,173 \n$\n306.35 \n1,173 \n ________________\n(1)\nThis represents shares purchased in open-market transactions under the stock repurchase plans approved by the Board of Directors.\n(2)\nThese amounts correspond to the plans publicly announced and approved by the Board of Directors in November 2022 and November 2024 that each authorized the repurchase of $5 billion. At October 31, 2025, $2.81 billion and $5 billion remained available for repurchase under the November 2022 and November 2024 repurchase programs, respectively. The plans do not have a fixed expiration date. See Part I, Item 1, “Financial Statements,” Note 18, “Stockholders' Equity,” in the Notes to the Condensed Consolidated Financial Statements for further discussion. \nGlossary of Terms\nBillings: \nTotal revenue plus the net change in deferred revenue from the beginning to the end of the period. \nCloud Service Offerings: \nRepresents individual term-based offerings deployed through web browser technologies or in a hybrid software and cloud configuration. Cloud service offerings that are bundled with other product offerings are not captured as a separate cloud service offering.\nConstant Currency (CC) Growth Rates: \nWe attempt to represent the changes in the underlying business operations by eliminating fluctuations caused by changes in foreign currency exchange rates as well as eliminating hedge gains or losses recorded within the current and comparative periods. We calculate constant currency growth rates by (i) applying the applicable prior period exchange rates to current period results and (ii) excluding any gains or losses from foreign currency hedge contracts that are reported in the current and comparative periods. \nDesign Business:\n Represents the combination of maintenance, product subscriptions and all EBAs. Main products include, but are not limited to, AutoCAD, AutoCAD LT, Industry Collections, Revit, Inventor, Maya and 3ds Max. Certain products, such as our computer aided manufacturing solutions, incorporate both Design and Make functionality and are classified as Design. \nEnterprise Business Agreements (EBAs):\n Represents programs providing enterprise customers with token-based access to a broad pool of Autodesk products over a defined contract term. \n50\n \nFlex:  \nA pay-as-you-go consumption option to pre-purchase tokens to access any product available with Flex for a daily rate.\nFree Cash Flow:\n \nCash flow from operating activities minus capital expenditures. \nIndustry Collections:\n Autodesk Industry Collections are a combination of products and services that target a specific user objective and support a set of workflows for that objective. Our Industry Collections consist of: Autodesk Architecture, Engineering and Construction Collection, Autodesk Product Design and Manufacturing Collection, and Autodesk Media and Entertainment Collection.\nMaintenance Plan: \nOur maintenance plans provide our customers with a cost effective and predictable budgetary option to obtain the productivity benefits of our new releases and enhancements when and if released during the term of their contracts. Under our maintenance plans, customers are eligible to receive unspecified upgrades when and if available, and technical support. We recognize maintenance revenue over the term of the agreements, generally one year. \nMake Business:\n Represents certain cloud-based product subscriptions. Main products include, but are not limited to, Autodesk Build, BIM Collaborate Pro, BuildingConnected, Fusion, and Flow Production Tracking. Certain products, such as Fusion, incorporate both Design and Make functionality and are classified as Make. \nNet Revenue Retention Rate (NR3): \nMeasures the year-over-year change in Recurring Revenue for the population of customers that existed one year ago (“base customers”).  Net revenue retention rate is calculated by dividing the current quarter Recurring Revenue related to base customers by the total corresponding quarter Recurring Revenue from one year ago. Recurring Revenue is based on USD reported revenue, and fluctuations caused by changes in foreign currency exchange rates and hedge gains or losses have not been eliminated. Recurring Revenue related to acquired companies, one year after acquisition, has been captured as existing customers until such data conforms to the calculation methodology. This may cause variability in the comparison. \nOther Revenue: \nConsists of revenue from consulting, and other products and services, and is recognized as the products are delivered and services are performed.  \nProduct Family: \nA grouping of related products or solutions that address specific industry or market needs, customer types, or use cases, or share core underlying technology or deployment models. Where a customer has a right to use different products over time, Autodesk may classify amounts to a single product family based on the customer’s primary industry or use case, or to product family other, or allocate the amounts across product families using estimates.\nProduct Subscription:\n \nProvides customers a flexible, cost-effective way to access and manage 3D design, engineering, and entertainment software tools. Our product subscriptions currently represent a hybrid of desktop and cloud functionality, which provides a device-independent, collaborative design workflow for designers and their stakeholders.  \nRecurring Revenue:\n Consists of the revenue for the period from our traditional maintenance plans, our subscription plan offerings and certain Other revenue. It excludes subscription revenue related to third-party products. Recurring revenue acquired with the acquisition of a business is captured when total subscriptions are captured in our systems and may cause variability in the comparison of this calculation.   \nRemaining Performance Obligations (RPO): \nThe sum of total short-term, long-term, and unbilled deferred revenue. Current remaining performance obligations is the amount of revenue we expect to recognize in the next twelve months. \n \nSolution Provider:\n Solution Provider is the name of our channel partners who primarily serve our new transaction model customers worldwide. Solution Providers may also be resellers in relation to Autodesk solutions.\nSpend:\n The sum of cost of revenue and operating expenses. \nSubscription Plan: \nComprises our term-based product subscriptions, cloud service offerings, and EBAs. Subscriptions represent a combined hybrid offering of desktop software and cloud functionality which provides a device-independent, collaborative design workflow for designers and their stakeholders. With subscription, customers can use our software anytime, anywhere, and get access to the latest updates to previous versions.  \nSubscription Revenue: \nIncludes our cloud-enabled term-based product subscriptions, cloud service offerings, and flexible EBAs.\n \n51\n \nUnbilled Deferred Revenue: \nUnbilled deferred revenue represents contractually stated or committed contracts under early renewal and multi-year billing plans for subscription, services, and maintenance for which the associated deferred revenue has not been recognized. Under FASB Accounting Standards Codification (\"ASC\") Topic 606, unbilled deferred revenue is not included as a receivable or deferred revenue on our Consolidated Balance Sheet."
}