{
  "source_file": "adsk-20250131.htm",
  "form_type": "10-K",
  "item1": "ITEM 1.\nBUSINESS\nNote: A glossary of terms used in this Form 10-K appears at the end of this Item 1.\nGENERAL\nWe are a global leader in 3D design, engineering and entertainment technology solutions, spanning architecture, engineering, construction, product design, manufacturing, media, and entertainment. Our customers design, fabricate, manufacture, and build anything by visualizing, simulating, and analyzing real-world performance early in the design process. These capabilities allow our customers to foster innovation, optimize their designs, streamline their manufacturing and construction processes, save time and money, improve quality, deliver more sustainable outcomes, communicate plans, and collaborate with others. Our professional software products are sold globally through a combination of indirect and direct channels. \nCorporate Information\nOur internet address is www.autodesk.com. The information posted on our website is not incorporated into this Annual Report on Form 10-K. Our Annual Report on Form 10-K, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K, and amendments to reports filed or furnished pursuant to Sections 13(a) and 15(d) of the Securities Exchange Act of 1934, as amended, are available free of charge on the Investor Relations portion of our website at www.autodesk.com as soon as reasonably practicable after we electronically file such material with, or furnish it to, the SEC.\nPRODUCTS\nOur architecture, engineering, construction and operations products improve the way building, infrastructure, and industrial projects are designed, built, and operated. Our product development and manufacturing software provides manufacturers in automotive, transportation, industrial machinery, consumer products, and building product industries with comprehensive digital design, engineering, manufacturing, and production solutions. These technologies bring together data from all phases of the product development and production life cycle, creating a digital pipeline that supports greater productivity, accuracy through process automation, and insights that enable more sustainable outcomes. Our digital media and entertainment products provide tools for digital sculpting, modeling, animation, effects, rendering, and compositing for design visualization, visual effects, 3D animation, games production, and enable connection of workflows and data from pre-production to post-production.  Our portfolio of products and services enables our customers to foster innovation, optimize and improve their designs, save time and money, improve quality, communicate plans, and collaborate with others. A summary of our revenue by geographic area and product family is found in Part II, Item 8, Note 2, “Revenue Recognition,” in the Notes to Consolidated Financial Statements.\nAutodesk’s product offerings include:\nArchitecture, Engineering, Construction and Operations (“AECO”)\n•\nArchitecture, Engineering, and Construction Collection\nThe AEC Collection, including AutoCAD, AutoCAD Civil 3D, and Revit, aims to help our customers design, engineer, and construct higher quality, more predictable building and civil infrastructure projects, commonly used by AECO industry experts. \n5\nTable of Contents \n•\nAutoCAD Civil 3D\nAutoCAD Civil 3D solution provides a surveying, design, analysis, and documentation solution for civil engineering, including land development, transportation, and environmental projects. Using a model-centric approach that automatically updates documentation as design changes are made, AutoCAD Civil 3D enables civil engineers, designers, drafters, and surveyors to significantly boost productivity and deliver higher-quality designs and construction documentation faster. With AutoCAD Civil 3D, the entire project team works from the same consistent, up-to-date model so they stay coordinated throughout all project phases.\n•\nAutodesk Build\nAutodesk Build delivers a connected set of project management and collaboration tools for the construction industry. Autodesk Build provides a toolset for managing, sharing, and accessing project documents that results in streamlined workflows between the office, trailer, and jobsite. In addition, Autodesk Build can be used to track the quality and safety of the project with issues and forms. Team members can use Autodesk Build for requests for information (RFIs), submittals, and meetings to manage the flow of information and track project progress across the construction timeline. The PlanGrid Build mobile app delivers field critical project information and collaboration from Autodesk Build to the jobsite. As part of Autodesk Construction Cloud, Build connects data originating in design and preconstruction to the construction and operations phase, allowing users to identify, manage and de-risk project decisions.\n•\nBIM Collaborate Pro \nAutodesk BIM Collaborate Pro is cloud-based design collaboration and design management software that enables teams to: organize project data, democratize access, and connect; improve project visibility to deliver on time; and work together on increasingly complex projects.\n•\nBuilding Connected\nBuildingConnected is a SaaS preconstruction solution that combines the largest real-time, construction network with  an easy-to-use tool that helps general contractors and owners streamline subcontractor qualification, and the bid and risk management process. \n•\nRevit\nRevit software is built for Building Information Modeling (“BIM”) to help professionals design, build, and maintain higher-quality, more energy-efficient buildings. Using the information-rich models created with Revit, architects, engineers, and construction firms can collaborate to make better-informed decisions earlier in the design process to deliver projects with greater efficiency. Revit includes features for architectural, mechanical, electrical, and plumbing design as well as structural engineering and construction, providing a comprehensive solution for the entire building project team.\n•\nTandem\nTandem is a cloud-based platform that transforms the built asset lifecycle. Tandem helps AECO firms harness BIM data throughout the project lifecycle to create and hand over a digital twin. Tandem helps owners connect operational systems to the digital twin, turning fragmented data into business intelligence.\nAutoCAD and AutoCAD LT\n•\nAutoCAD\nAutoCAD software is a customizable and extensible CAD application for professional design, drafting, detailing, and visualization. AutoCAD software provides digital tools that can be used independently and in conjunction with other specific applications in fields ranging from construction and civil engineering to manufacturing and plant design.\n6\nTable of Contents \n•\nAutoCAD LT\nAutoCAD LT software is purpose built for professional drafting and detailing. AutoCAD LT includes document sharing capability without the need for software customization or certain advanced functionality found in AutoCAD. Users can share all design data with team members who use AutoCAD or other Autodesk products built on AutoCAD.\nManufacturing (“MFG”)\n•\nFusion (Formerly Fusion 360)\nFusion is the first 3D CAD, CAM, and computer-aided engineering (“CAE”) tool of its kind. It connects the entire product development process on a single cloud-based platform. \n•\nInventor\nInventor enables manufacturers to go beyond 3D design to digital prototyping by giving engineers a comprehensive and flexible set of tools for 3D mechanical design, simulation, analysis, tooling, visualization, and documentation. Engineers can integrate AutoCAD drawings and model-based design data into a single digital model, creating a virtual representation of a final product that enables them to validate the form, fit, and function of the product before it is ever built.\n•\nProduct Design & Manufacturing Collection \nThe Product Design & Manufacturing Collection offers connected, professional-grade tools that help our customers make great products today and compete in the changing manufacturing landscape of the future. The collection offers access to a wide range of our products, including AutoCAD, Fusion, Vault, and Inventor.\n•\nVault\nVault data management software makes it easier to manage data in one central location, accelerate design processes, and streamline internal/external collaboration. Vault integrates with more than 30 Autodesk design applications, provides powerful revisioning and access control capabilities, and enables customers to share product data securely to improve engineering cycle time and reduce manufacturing errors.\nMedia and Entertainment (“M&E”)\n•\nFlow Production Tracking \nFlow Production Tracking is cloud-based production management software for the M&E industry. Creative companies use the Flow Production Tracking platform to provide essential tool collaboration, review, scheduling and tracking to producers, production managers, artists and supervisors, who often work globally with distributed teams. \n•\nMaya\nMaya software provides 3D modeling, animation, effects, rendering, and compositing solutions that enable film and video artists, game developers, and design visualization professionals to digitally create engaging, lifelike images, realistic animations and simulations, extraordinary visual effects, and full-length animated feature films.\n•\nMedia & Entertainment Collection\nThe M&E Collection provides end-to-end creative tools for entertainment creation. This collection enables animators, modelers, and visual effects artists to access the tools they need, including Maya and 3ds Max, to create compelling effects, 3D characters, and digital worlds.\n•\n3ds Max\n7\nTable of Contents \n3ds Max software provides 3D modeling, animation, and rendering solutions that enable game developers, design visualization professionals, and visual effects artists to digitally create realistic images, animations, and complex scenes and to digitally communicate abstract or complex mechanical, architectural, engineering, and construction concepts.\nPRODUCT DEVELOPMENT AND INTRODUCTION\nThe technology industry is characterized by rapid technological change in computer hardware, operating systems, and software. In addition, o\nur customers’ requirements and preferences rapidly evolve, as do their expectations of the performance of our software and services. To keep pace with these changes, we maintain a vigorous program of new product development to address demands in the marketplace for our products, such as enabling convergence, more flexibility and sustainable outcomes.\nWe are undertaking a multi-year process to develop lifecycle solutions within and between our industry clouds, powered by shared platform services, and with our data model at its core. Together, these will help enable Autodesk, its customers, and partners, to create more valuable, data-driven, and connected products and services. \nSubscription plan offerings are designed to give our customers increased flexibility with how they use our products and service offerings and to attract a broader range of customers such as project-based users and small businesses. Subscription plans represent a combined hybrid offering of desktop software and cloud functionality which provides a device-independent, collaborative design workflow for designers and their stakeholders. \nWe dedicate considerable technical and financial resources to research and development to deliver additional automation and insights to our customers through artificial intelligence (“AI”), machine learning, and generative design, which increase efficiency and sustainability and reduce waste. These investments further enhance our existing products and create new solutions and technologies which connect the workflows and data of our customers across the ecosystem of their projects and expand our market opportunity. Our tools connect and automate the phases of design and creation, enabling greater collaboration and the seamless flow of data for individuals and teams across all phases.\nOur software is primarily developed internally; however, we also use independent firms and contractors to perform some of our product development activities. Additionally, we acquire or license products and technologies developed by third parties. We continually review these investments to ensure that we are generating sufficient revenue or gaining a competitive advantage to justify their costs. \n \nThe majority of our research and product development is performed in the United States, Canada, and India. However, we employ experienced software developers in many of our other locations. Translation and localization of our products are performed in several local markets, principally Singapore and Ireland. We generally localize and translate our products into German, French, Italian, Spanish, Japanese, Korean, and simplified and traditional Chinese.\nWe plan to continue managing significant product development operations internationally over the next several years. We believe that our ability to conduct research and development at various locations throughout the world allows us to tap into a diverse global talent pool, optimize costs, and integrate local market knowledge into our development activities. We continually assess costs, hiring challenges, and intellectual property protection, against the benefits of our international development activities.\nFor further discussion regarding risks from our product development and introduction efforts, see Item 1A, “Risk Factors.”\nMARKETING AND SALES\nWe sell our products and services globally, through a combination of direct and indirect channels. We transact directly with our enterprise and named account customers, with customers through our online Autodesk branded store, and with certain customers through our new transaction model whereby Solution Providers provide a quote to customers but the actual transaction occurs directly between Autodesk and the customer. We introduced the new transaction model for our token-based Flex offering in North America, and certain countries in EMEA, and APAC during fiscal 2023 and 2024. Most of our subscription offerings transitioned to the new transaction model in Australia during fiscal 2024. In fiscal 2025, we transitioned most of our indirect business to the new transaction model in our major markets. The new transaction model helps customers with enhanced control and time savings through self-service, consistent pricing, and a more personalized buying experience.  Also, it gives Solution Providers and Autodesk access to essential data to improve our offerings and the customers’ buying experience. \n8\nTable of Contents \nWe expect our indirect channel will continue to transact and support a considerable portion of our customers, particularly in emerging regions and with governments. Our indirect channel model includes both a two-tiered distribution structure, where distributors sell to resellers, and a one-tiered structure, where Autodesk sells directly to resellers. We have a network of approximately 1,260 resellers and distributors worldwide. For fiscal 2025, approximately 58% of our revenue was derived from indirect channel sales through distributors and resellers.  We employ a variety of incentive programs and promotions to align our direct and indirect channels with our business strategies.  \nWe anticipate that our channel mix will continue to change as we scale our business. With the continued growth of our online Autodesk branded store and our new transaction model, we are transacting directly with more end customers, rather than through distributors, without substantial disruption to our revenue. Our ability to effectively distribute our products depends in part upon the financial and business condition of our distributor, reseller and Solution Provider networks. The loss of, or a significant reduction in, business with any one of our major distributors, large resellers or Solution Providers could harm our business. See Item 1A, “Risk Factors,” for further discussion. The transition to annual billings for multi-year contracts impacted the timing of our billings and cash collections in fiscal year 2025 and we expect this impact to continue into fiscal year 2026. See Part II, Item 7, “Management's Discussion and Analysis of Financial Condition and Results of Operations,” for further discussion.\nRevenue through our largest distributor, TD Synnex Corporation and its global affiliates (collectively, “TD Synnex”), accounted for 33%, 39%, and 37% of our net revenue for the fiscal years ended January 31, 2025,  2024 and 2023, respectively. During fiscal 2023, we entered into transition agreements with TD Synnex to provide transition distribution activities for a one-to-two-year period. In the third fiscal quarter of 2025, we entered into a new distribution agreement with TD Synnex for government business in certain jurisdictions. Existing distribution agreements will continue in emerging markets. We have increased our selling efforts with Solution Providers in connection with our new transaction model. Consequently, we believe our business is not substantially dependent on TD Synnex. No other distributor, reseller, or direct customer accounted for 10% or more of our revenue in fiscal 2025.\nOur customer-related operations are divided into three geographic regions: the Americas; EMEA; and APAC. Each geographic region is supported by global marketing and sales organizations. These organizations develop and manage overall marketing and sales programs and work closely with a network of domestic and international sales offices. We believe that international sales will continue to comprise the majority of our total net revenue. Adverse economic conditions and currency exchange rates in the countries that contribute a significant portion of our net revenue, including emerging economies, may have an adverse effect on our business in those countries and our overall financial performance. Our international operations and sales subject us to a variety of risks. See Item 1A, “Risk Factors,” for further discussion.\nWe also work directly with reseller, distributor, and Solution Provider partner organizations, computer manufacturers, other software developers, and peripherals manufacturers in cooperative advertising, promotions, and trade-show presentations. We connect with our audiences through scalable marketing strategies such as webinars, live and virtual events, personalized outreach, digital campaigns, sponsorships, and targeted advertising across industry publications, technology platforms, media outlets, and social networks. We also foster global user networks and online communities, enabling customers to connect, collaborate, and share insights about our products, services, and solutions.  \nWe generate revenue primarily through various offerings that provide recurring revenue. Under our subscription plan, customers can use our software anytime, anywhere, and get access to the latest updates to previous versions through term-based product subscriptions, cloud service offerings, and enterprise business agreements (“EBA”). Historically, we have had increased EBA sales activity in our fourth fiscal quarter. This seasonality may not have an immediate impact on our revenue as we recognize subscription revenue over the term of the contract.  This seasonality may also affect the relative value of our billings, Remaining Performance Obligations (“RPO”), and collections in the fourth and first fiscal quarters.  \n9\nTable of Contents \nCUSTOMER AND PARTNER SUPPORT\nWith the new transaction model, we are approaching the final phase of modernizing our go-to-market motion, which includes building more durable and direct relationships with our customers, updating our data infrastructure, and retiring old information systems and business models. We provide technical support and training to customers through a multi-tiered support model, augmented by direct programs designed to address certain specific customer needs. Some of our customers receive support and training from resellers and distributors from which they purchased subscriptions or licenses for our products or services, with Autodesk in turn providing second-tier support to the resellers and distributors. Some of our customers may also purchase support and training from Solution Providers. Other customers are supported directly via self-service using the Autodesk Knowledge Network, which guides customers to answers in our online support assets, support forums, or webinars, or to support representatives using different modalities such as social media, phone, email, and webchat. We also support our resellers and distributors through technical product training, sales training classes, webinars, and other knowledge-sharing programs. \nGOVERNANCE AND IMPACT PROGRAMS\nImpact at Autodesk\nAutodesk is committed to advancing a more sustainable, resilient, and inclusive world. We take action as a business to support our employees, customers, and communities in our collective opportunity to design and make a better world for all.\nWe focus our efforts to advance positive outcomes across three primary areas: energy and materials, health and resilience, and work and prosperity. These impact opportunity areas are derived from the UN Sustainable Development Goals (“SDGs”) and have been identified through a multi-pronged process to align the top needs of our stakeholders, the issues that are most important to our business, and the areas we are best placed to accelerate positive impact at scale.\nThese opportunities primarily manifest as outcomes through how our customers leverage our technology to design and make net-zero carbon buildings, resilient infrastructure, more sustainable products, and a thriving workforce. We support and amplify these opportunities through powering our business with 100% renewable energy, neutralizing greenhouse gas emissions associated with our operations, developing an inclusive culture and supporting students and educators with tools and training to equip the next generation of innovators. We advance these opportunities with industry innovators through collaboration with our customers and partners, deploying philanthropic capital to changemakers, and providing software donations, and training to our wider ecosystem. Autodesk committed to target 1% of annual operating profit for the long-term support of our impact programs, which includes our philanthropic work and our climate commitments. \nThese programs align with our operational priorities and long-term growth strategy. We aim to maintain our commitments, fostering trust with stakeholders and enabling compliance with global regulations.\nEducation\nAutodesk is committed to helping students gain the in-demand skills and certifications needed to demonstrate they are prepared for current and emerging roles in the industries we serve. We offer free educational licenses of Autodesk’s complete portfolio of professional software to verified students, educators, and accredited educational institutions worldwide. Additionally, we offer self-paced, modular learning and curriculum for K-12, post-secondary students, and educators. Our intention is to make Autodesk software the preferred choice for those poised to become the next generation of design, engineering, and construction professionals.\nSustainability\nClimate Change\nIn addressing the global challenges posed by climate change, we make it possible for our customers to innovate and respond to associated changes in regulation, building code, physical climate parameters, and other climate-related developments. This effort can directly and indirectly create more demand for existing and new Autodesk products and services in the short and long-term. Furthermore, our leadership is committed to taking climate action and that commitment goes hand in hand with our values and reputation in the marketplace.\nClimate Change Management Actions\n10\nTable of Contents \nTo drive continued progress and meet growing demand, we continue to expand the solutions, education, and support we offer, helping customers secure a competitive advantage for a low-carbon future by designing high-performance buildings, resilient cities and infrastructure, and more efficient transportation and products. To continue to grow this market, we invest in our tools to meet customer’s demand as well as provide software and support to early-stage entrepreneurs, nonprofit organizations, and start-up companies who are designing clean technologies. We are expanding these offerings based upon demand and opportunity in response to challenges posed by climate change.\nInternally, we are investing in best practices to mitigate our greenhouse gas emissions (“GHGs”) and climate change risk through investments in renewable energy, energy efficiency, and disaster management and recovery strategies. Our Enterprise Risk Management process considered how climate impacts could affect and potentially amplify the overall significance of each identified risk and opportunity. We regularly assess risks and opportunities in this area and respond accordingly. \nEmissions Performance & Other Key Performance Indicators\nIn fiscal year 2024, we made progress on our science-based GHG reduction target, to reduce Scope 1 and Scope 2 GHGs 50%, and reduce Scope 3 GHGs per dollar of gross profit 55%, by fiscal year 2031, compared to fiscal year 2020. Additionally, in fiscal 2024, we were responsible for 155,000 metric tons of carbon dioxide equivalent emissions across our market-based operational boundary. This represents a 32% reduction compared to our fiscal year 2020 base line. In addition, our residual 155,000 metric tons of CO2e emissions were neutralized through the procurement of high quality carbon offsets credits. \nImpact Reports\nMore information about our sustainability financing and commitment can be found in our annual Impact Reports, which we have published on our website since 2008. Our fiscal 2025 Impact Report will be published in fiscal 2026. Information contained on or accessible through our website is not part of or incorporated by reference into this report.\nPhilanthropy\nThe Autodesk Foundation (the “Foundation”), a privately funded 501(c)(3) charity organization established and solely funded by us, leads our philanthropic efforts. The purpose of the Foundation is twofold: to support employees to create a better world at work, at home, and in the community by matching employees’ volunteer time and donations to nonprofit organizations; and to support organizations using design and make solutions to drive positive impact. In the latter case, we use philanthropic capital, software donations, and training to accomplish this goal, selecting the most impactful and innovative organizations around the world who are innovating to create a better future for our planet. On our behalf, the Foundation also administers a discounted software donation program to nonprofit organizations, entrepreneurs, and others who are developing design solutions that will shape a more sustainable future.\nDEVELOPER PROGRAMS\nOur business and our customers benefit from our relationships with an extensive developer network. These developers create and sell their own interoperable products that further enhance the range of integrated solutions available to our customers. One of our key strategies is to maintain an API based architecture of our software products to facilitate third-party development of complementary products and industry-specific software solutions. This approach enables customers and third parties to customize solutions for a wide variety of highly specific uses. We offer several programs that provide strategic investment funding, technological platforms, user communities, technical support, forums, and events to developers who develop add-on applications for our products. For example, we have established the Autodesk Platform Services to support innovators that build solutions to facilitate the development of a single connected ecosystem for the future of how things are designed, made, and used. Autodesk Platform Services facilitates the development of a single connected ecosystem for integrating Autodesk applications with other enterprise, web, and mobile solutions.\nCOMPETITION\nThe markets for our products are highly competitive, are subject to rapid change, and can have complex interdependencies between many of the larger businesses. We strive to increase our competitive separation by investing in research and development, allowing us to bring new products to market and create exciting new versions of existing products that offer compelling efficiencies for our customers. We also compete through investments in marketing and sales to more effectively reach new customers and better serve existing customers.\n11\nTable of Contents \nOur competitors include large, global, publicly traded companies; small, geographically focused firms; startup firms; and solutions produced in-house by their users. Our primary global competitors include Adobe Systems Incorporated, Bentley Systems, Inc., Dassault Systèmes S.A. and its subsidiary Dassault Systèmes SolidWorks Corp., Intergraph Corporation, a wholly owned subsidiary of Hexagon AB, MSC Software Corporation, Nemetschek AG, Oracle Corporation, Procore Technologies, Inc., PTC Inc., 3D Systems Corporation, Siemens PLM, and Trimble Navigation Limited, among others.\nThe software industry has limited barriers to entry, and the availability of computing power with continually expanding performance at progressively lower prices contributes to the ease of market entry. The industry continues to undergo a platform shift from the personal computer to cloud and mobile computing. This shift further lowers barriers to entry and poses a disruptive challenge to established software companies. The design software market is characterized by vigorous competition in each of the vertical markets in which we compete, both from existing competitors and by entry of new competitors with innovative technologies. Competition is increasingly enhanced by consolidation of companies with complementary products and technologies and the possibility that competitors in one vertical segment may enter other vertical segments that we serve. In addition, some of our competitors in certain markets have greater financial, technical, sales and marketing, and other resources than we do. Because of these and other factors, competitive conditions in these industries are likely to continue to intensify in the future. Increased competition could result in price reductions, reduced net revenue and profit margins, and loss of market share, any of which could harm our business. See Item 1A, “Risk Factors,” for further discussion of risks regarding competition.\nWe believe that our future results depend largely upon our ability to better serve customers by offering new products, including cloud and mobile computing products, whether by internal development or acquisition, and to continue to provide existing product offerings that compete favorably with respect to ease of use, reliability, performance, range of useful features, continuing product enhancements, reputation, price, and training.\nINTELLECTUAL PROPERTY AND LICENSES\nWe maintain an active program to legally protect our investment in technology through intellectual property rights. We protect our intellectual property through a combination of patent, copyright, trademark, and trade secret protections, confidentiality procedures, and contractual provisions. The nature and extent of legal protection associated with each such intellectual property right depends on, among other things, the type of intellectual property right and the given jurisdiction in which such right arises. We believe that our intellectual property rights are valuable and important to our business.\nNonetheless, our intellectual property rights may not be successfully asserted in the future or may be invalidated, circumvented, or challenged. In addition, the laws and enforcement of the laws of various foreign countries where our products are distributed do not protect our intellectual property rights to the same extent as U.S. laws. Enforcement of intellectual property rights against alleged infringers can sometimes lead to costly litigation and counterclaims. Our inability to protect our proprietary information could harm our business.\nFrom time to time, we receive claims alleging infringement of a third party’s intellectual property rights, including patents. Disputes involving our intellectual property rights or those of another party have in the past and may in the future lead to, among other things, costly litigation or product shipment delays, which could harm our business.\nWe retain ownership of software we develop. Our combined hybrid offerings include both desktop software and cloud functionality. Desktop software is licensed to users pursuant to ‘click through’ or signed license agreements containing restrictions on duplication, disclosure, and transfer. Cloud software and associated services are provided to users pursuant to online or signed terms of service agreements containing restrictions on access and use.\nWe believe that because of the limitations of laws protecting our intellectual property and the rapid, ongoing technological changes in both the computer hardware and software industries, we must rely principally upon software engineering and marketing skills to continually maintain and enhance our competitive market position.\nWhile we have recovered some revenue resulting from the unauthorized use of our software solutions, we are unable to measure the full extent to which unauthorized use of our software products exists. We believe, however, that unauthorized use of our software is and can be expected to be a persistent problem that negatively impacts our revenue and financial results. We believe that our transition from perpetual use software licenses to a subscription-based business model combined with the change from desktop to cloud-based computing will shift the incentives and means by which software is used without authorization.\n12\nTable of Contents \nIn addition, through various licensing arrangements, we receive certain rights to intellectual property of others. We expect to maintain current licensing arrangements and to secure licensing arrangements in the future, as needed and to the extent available on reasonable terms and conditions, to support continued development and sales of our products and services. Some of these licensing arrangements require or may require royalty payments and other licensing fees. The amount of these payments and fees may depend on various factors, including but not limited to: the structure of royalty payments, offsetting considerations, if any, and the degree of use of the licensed technology.\nSee Item 1A, “Risk Factors,” for further discussion of risks related to protecting our intellectual property.\nPRODUCTION AND SUPPLIERS\nThe production of our software products and services involves duplication or hosting of software media. The way that we deliver software has evolved during our business model transition. For certain cloud-based products, we use a combination of co-located hosting facilities and increasingly Amazon Web Services and to a lesser degree other infrastructure-as-a-service providers. We offer customers an electronic software download option for both initial product fulfillment and subsequent product updates. Customers who choose electronic fulfillment receive the latest version of the software from our vendor’s secure servers. Customers may also obtain our software through media such as DVDs and USB flash drives available from multiple sources. \nTALENT AND HUMAN CAPITAL MANAGEMENT\nOur employees play a central role in the success of our long-term strategy. Autodesk’s Culture Code defines values and behaviors that support our commitment to being a customer company, where each employee takes responsibility for understanding our customers’ needs, expectations, and experiences. As of January 31, 2025, we employed approximately 15,300 people, an increase from approximately 14,100 employees as of the end of fiscal year 2024. None of our employees in the United States are represented by a labor union. In certain foreign countries, our employees are represented by trade unions or works councils. We have never experienced any work stoppages and believe our employee relations are strong. Reliance upon employees in other countries entails various risks and changes in these foreign countries, such as government instability or regulation unfavorable to foreign-owned businesses, which could negatively impact our business in the future. \nDiversity and Belonging\nAutodesk views our culture, diversity, and belonging efforts as directly linked to high performance and unlocking human ingenuity. Our commitment to maintaining a global workforce is grounded in our values and how we work, being inclusive, respectful, and collaborative.  Our culture seeks to enable Autodesk employees to do their best work, innovate, contribute to the success of our company, and prosper. \nWe believe there are markets for talent that remain untapped or underutilized, which drives our sourcing and networking efforts. We do this by widening our talent pipelines to attract and retain the most capable, skilled, and top-tier professionals from all backgrounds. This strategy strengthens our ability to meet and speak to an ever-expanding and diverse customer base, fueling our competitive edge, increasing customer trust, and driving sustainable growth and success in a dynamic global marketplace.  \nWe consistently expand our networks and investments in targeted partnerships-both professional and academic- including: Hispanic-serving educational institutions, Historically Black Colleges and Universities and professional organizations around the globe that provide greater access to pools of under recognized talent in key sectors like technology. By leveraging our extensive portfolio of programs—scholarships, internships, sponsorship agreements, mentorship, and development—we demonstrate our capability to nurture and retain top-tier talent.\nWe offer continuous development opportunities to all employees that facilitate mentorship relationships, as well as focused sponsorship and leadership development programs in partnership with our Employee Resource Groups (ERGs). \nWe proudly support nine ERGs, which are open to all employees and play a pivotal role in scaling a sense of belonging across the company. These groups are formed based on various factors, including shared interests, backgrounds, unique identities, and professional experiences. Our culture promotes choice, allowing employees to engage and participate in ways that resonate with them—whether as allies or direct members of one or more groups. ERGs are one of the ways we retain and engage our talent community of Autodesk employees, while also creating a work environment that learns from and leverages diverse perspectives and experiences that enrich how we all work together as one Autodesk.    \n13\nTable of Contents \nFinally, we are an equal opportunity employer that does not discriminate in recruiting, hiring, training, or promoting on any basis protected by law. Additional information on our Diversity and Belonging program, initiatives, and metrics can be found on our website at autodesk.com/company/diversity-and-belonging. Information contained on or accessible through our website is not part of or incorporated by reference into this report.     \n \nProfessional Development and Employee Impact\nWe believe career development plays an important role in keeping our employees engaged and in providing additional opportunities for them to grow and build their careers. Autodesk offers extensive professional and technical development opportunities for our employees. These include self-service online modules and personalized learning paths, professional and management development programs, and a tuition reimbursement program.\nWe also encourage our employees to advance our vision for a better world and support their professional development by participating in our pro bono consulting program, using paid time to volunteer, and have their charitable giving matched by the Autodesk Foundation.\nTotal Rewards\nTo attract, retain, and support our employees, we offer competitive compensation and benefits programs, several of which include an element of choice to meet the needs of our diverse and global population. In addition to competitive base pay and opportunities to receive short-term incentives, all our employees are eligible to participate in our long-term plans. We also have comprehensive health and wellness benefits, a generous time off program, an employee stock purchase plan, sabbaticals, retirement plans, financial support programs, financial tools and education, and an employee assistance program.\nACQUISITIONS\nWe acquired new technology or supplemented our existing technology by purchasing businesses or technology related assets focused in specific markets or industries. For the fiscal years ended January 31, 2025, 2024 and 2023, we acquired companies accounted for as business combinations. The acquisitions during both fiscal 2024 and 2023 were not individually significant. The following were significant acquisitions for fiscal year 2025.\nDate of closing\nCompany\nDetails\nMay 2024\nAether Media, Inc. (“Aether”)\nWith the acquisition, Autodesk expects to enhance artificial intelligence capabilities for Autodesk’s visual effects (“VFX”) creation tools and democratize high end VFX work on Autodesk’s Flow platform.\nMarch 2024\nPIX business of X2X, LLC (\"PIX\")\nThe acquisition will help foster broader collaboration and communication, as well as help drive greater efficiencies in the production process.\nFebruary 2024\nPayapps Limited (\"Payapps\")\nThis acquisition will deepen Autodesk Construction Cloud’s footprint and provide a robust payment management offering to serve the needs of general contractors and trade contractors. Through automating the application of the payment process, Payapps’ solution provides greater transparency, reduces risk and helps accelerate time-to-payment.\nWe acquire technology-related assets that are complementary to or otherwise enhance our existing technologies. We also make investments in privately held companies that develop technology that is complementary to or provide strategic value and expand opportunities for our technologies.  \nREGULATION\nWe are subject to various regulations, particularly those involving privacy and import/export controls. See Item 1A, “Risk Factors—Risks Relating to Laws and Regulations,” for further discussion.\nGLOSSARY OF TERMS\nBillings: \nTotal revenue plus the net change in deferred revenue from the beginning to the end of the period.\n14\nTable of Contents \nCloud Service Offerings: \nRepresents individual term-based offerings deployed through web browser technologies or in a hybrid software and cloud configuration. Cloud service offerings that are bundled with other product offerings are not captured as a separate cloud service offering. \nConstant Currency (CC) Growth Rates: \nWe attempt to represent the changes in the underlying business operations by eliminating fluctuations caused by changes in foreign currency exchange rates as well as eliminating hedge gains or losses recorded within the current and comparative periods. We calculate constant currency growth rates by (i) applying the applicable prior period exchange rates to current period results and (ii) excluding any gains or losses from foreign currency hedge contracts that are reported in the current and comparative periods. \nDesign Business:\n Represents the combination of maintenance, product subscriptions, and all EBAs. Main products include, but are not limited to, AutoCAD, AutoCAD LT, Industry Collections, Revit, Inventor, Maya, and 3ds Max. Certain products, such as our computer aided manufacturing solutions, incorporate both Design and Make functionality and are classified as Design.  \nEnterprise Business Agreements (EBAs):\n Represents programs providing enterprise customers with token-based access to a broad pool of Autodesk products over a defined contract term. \nFlex:  \nA pay-as-you-go consumption option to pre-purchase tokens to access any product available with Flex for a daily rate.\nFree Cash Flow:\n \nCash flow from operating activities minus capital expenditures. \nIndustry Collections: \nAutodesk Industry Collections are a combination of products and services that target a specific user objective and support a set of workflows for that objective. Our Industry Collections consist of: Autodesk Architecture, Engineering, and Construction Collection, Autodesk Product Design and Manufacturing Collection, and Autodesk Media and Entertainment Collection.\nMaintenance Plan: \nOur maintenance plans provide our customers with a cost effective and predictable budgetary option to obtain the productivity benefits of our new releases and enhancements when and if released during the term of their contracts. Under our maintenance plans, customers are eligible to receive unspecified upgrades when and if available, and technical support. We recognize maintenance revenue over the term of the agreements, generally one year.     \nMake Business:\n Represents certain cloud-based product subscriptions. Main products include, but are not limited to, Autodesk Build, BIM Collaborate Pro, BuildingConnected, Fusion, and Flow Production Tracking. Certain products, such as Fusion, incorporate both Design and Make functionality and are classified as Make. \nNet Revenue Retention Rate (NR3): \nMeasures the year-over-year change in Recurring Revenue for the population of customers that existed one year ago (“base customers”).  Net revenue retention rate is calculated by dividing the current quarter Recurring Revenue related to base customers by the total corresponding quarter Recurring Revenue from one year ago. Recurring Revenue is based on USD reported revenue, and fluctuations caused by changes in foreign currency exchange rates and hedge gains or losses have not been eliminated. Recurring Revenue related to acquired companies, one year after acquisition, has been captured as existing customers until such data conforms to the calculation methodology. This may cause variability in the comparison. \nOther Revenue: \nConsists of revenue from consulting, and other products and services, and is recognized as the products are delivered and services are performed.\nProduct Subscription:\n \nProvides customers a flexible, cost-effective way to access and manage 3D design, engineering, and entertainment software tools. Our product subscriptions currently represent a hybrid of desktop and cloud functionality, which provides a device-independent, collaborative design workflow for designers and their stakeholders.  \nRecurring Revenue:\n Consists of the revenue for the period from our traditional maintenance plans, our subscription plan offerings, and certain Other revenue. It excludes subscription revenue related to third-party products. Recurring revenue acquired with the acquisition of a business is captured when total subscriptions are captured in our systems and may cause variability in the comparison of this calculation.        \nRemaining Performance Obligations (RPO): \nThe sum of total short-term, long-term, and unbilled deferred revenue. Current remaining performance obligations is the amount of revenue we expect to recognize in the next twelve months. \n \n \n \n15\nTable of Contents \nSolution Provider\n: Solution Provider is the name of our channel partners who primarily serve our new transaction model customers worldwide. Solution Providers may also be resellers in relation to Autodesk solutions\n.\nSpend\n: The sum of cost of revenue and operating expenses. \nSubscription Plan: \nComprises our term-based product subscriptions, cloud service offerings, and EBAs. Subscriptions represent a combined hybrid offering of desktop software and cloud functionality which provides a device-independent, collaborative design workflow for designers and their stakeholders. With subscription, customers can use our software anytime, anywhere, and get access to the latest updates to previous versions.  \nSubscription Revenue: \nIncludes our cloud-enabled term-based product subscriptions, cloud service offerings, and flexible EBAs. \n \nUnbilled Deferred Revenue: \nUnbilled deferred revenue represents contractually stated or committed orders under early renewal and multi-year billing plans for subscription, services, and maintenance for which the associated deferred revenue has not been recognized. Under FASB Accounting Standards Codification (\"ASC\") Topic 606, unbilled deferred revenue is not included as a receivable or deferred revenue on our Consolidated Balance Sheet.",
  "item7": "ITEM 7.\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe following discussion and analysis of our financial condition and results of operations should be read in conjunction with our consolidated financial statements and related notes appearing in Part II, Item 8 of this Annual Report on Form 10-K. This discussion contains forward-looking statements based upon current expectations that involve risks and uncertainties. Our actual results may differ materially from those anticipated in these forward-looking statements as a result of several factors, including those set forth above in Part I, Item 1A, \"Risk Factors,\" and elsewhere in this report. See “Forward-Looking Information” immediately preceding Part I.\nSTRATEGY\nAutodesk is changing how the world is designed and made. Our technology spans architecture, engineering, construction, product design, manufacturing, media and entertainment, empowering innovators everywhere to solve challenges big and small. From greener buildings to smarter products to more mesmerizing blockbusters, Autodesk technology helps our customers to design and make a better world for all.\nOur strategy is to drive customer workflow convergence by delivering a trusted design and make platform that connects people through automation, data, and insights to help them achieve better outcomes for their businesses and the world. To drive the execution of our strategy, we are focused on three strategic priorities: build the platform of choice for Design and Make, accelerate adoption of Fusion, Forma, and Flow, and transform how customers experience Autodesk.\nWe equip and inspire our users with the tailored tools, services, and access they need for success today and tomorrow. At every step, we help users harness the power of data to build upon their ideas and explore new ways of imagining, collaborating, and creating to achieve better outcomes for their customers, for society, and for the world. And because creativity can’t flourish in silos, we connect what matters - from steps in a project to collaborators on a unified platform.\nProduct Evolution\nWe offer subscriptions for individual products and Industry Collections, enterprise business arrangements (“EBAs”), and cloud service offerings (collectively referred to as “subscription plans”). Subscription plans are designed to give our customers more flexibility with how they use our offerings and to attract a broader range of customers, such as project-based users and small businesses.\nOur subscription plans represent a hybrid of desktop software and cloud functionality, which provides a device-independent, collaborative design workflow for designers and their stakeholders. Our cloud offerings, for example, Autodesk Construction Cloud, Autodesk Build, Fusion, Flow Production Tracking, AutoCAD web app, and AutoCAD mobile app, provide tools, including mobile and collaboration capabilities, to streamline design, collaboration, building and manufacturing, and data management processes. We believe that customer adoption of these latest offerings will continue to grow as customers across a range of industries begin to take advantage of the scalable computing power and flexibility provided through these services.\nIndustry Collections provide our customers with access to a broader selection of Autodesk solutions and services, simplifying the customers’ ability to benefit from a complete set of tools for their industry.\n42\nTable of Contents \nTo support our strategic priority of digital transformation in Architecture, Engineering, Construction and Operations (“AECO”), we are strengthening our AECO solutions’ foundation with both organic and inorganic investments. In the first quarter of fiscal 2025, we acquired Payapps Limited (“Payapps”), a leading cloud-based software platform for managing construction-related payments. This acquisition will deepen Autodesk Construction Cloud’s footprint and provide a robust payment management offering to serve the needs of general contractors and trade contractors. Through automating the application of the payment process, Payapps’ solution provides greater transparency, reduces risk and helps accelerate time-to-payment.  In fiscal 2024, we launched the first set of capabilities in Autodesk Forma, an industry cloud that unifies workflows across the teams that design, build, and operate the built environment. Autodesk Forma’s initial capabilities enable the early-stage planning and design process with automation and Artificial Intelligence (“AI”)-powered insights that simplify the exploration of design concepts, offload repetitive tasks, and help evaluate environmental qualities surrounding a building site.  In fiscal 2023, we acquired a cloud-connected, extended reality (XR) platform enabling AECO professionals to present, collaborate and review projects in immersive and interactive experiences, from anywhere and at any time. This acquisition enables Autodesk to meet increasing needs for augmented reality (AR) and virtual reality (VR) technology advancements within the AECO industry and further support AECO customers throughout the project delivery lifecycle. \nIn manufacturing, our strategy is to combine organic and acquired software in existing and adjacent verticals to create end-to-end, cloud-based solutions for our customers that drive efficiency and sustainability. We continue to attract global manufacturing leaders and disruptive startups with our generative design and cloud-based Fusion that converges the design process with manufacturing. In fiscal 2024, we acquired a provider of simulation technology that enables factory and logistics center operators to optimize their processes. In fiscal 2023, we acquired a maker of software for optimizing manufacturing processes with automation and digitization from the shop floor upward that provides a real-time system of record for data collection, management, and analysis.\nOur strategy includes improving our product functionality and expanding our product offerings through internal development as well as through the acquisition of products, technology, and businesses. Acquisitions often increase the speed at which we can deliver product functionality to our customers; however, they entail cost and integration challenges and may, in certain instances, negatively impact our operating margins. We continually review these factors in making decisions regarding acquisitions. We anticipate that we will continue to acquire products, technology, and businesses as compelling opportunities become available.\nGlobal Reach\nWe sell our products and services globally, through a combination of direct and indirect channels. Our direct channels include, but are not limited to, internal sales resources focused on selling our highly specialized solutions in our largest accounts, Solution Providers focused on serving certain Flex and subscription customers through our new transaction model, and business transacted through our online Autodesk branded store. Our indirect channels primarily include distributors, resellers, direct market resellers, volume channel partners, and product-specific resellers. During fiscal 2023, we entered into transition agreements with certain of our distributors, including TD Synnex and Ingram Micro Inc., to provide transition distribution activities for a one-to-two-year period. In the third fiscal quarter of 2025, we entered into a new distribution agreement with TD Synnex for government business in certain jurisdictions. Existing distribution agreements will continue in emerging markets. We introduced a new transaction model for our token-based Flex offering in North America, and certain countries in EMEA, and APAC during fiscal 2023 and 2024. Most of our subscription offerings transitioned to the new transaction model in Australia during fiscal 2024. In fiscal 2025, we transitioned most of our indirect business to the new transaction model in our major markets. In this new transaction model, Solution Providers provide a quote to customers but the actual transaction occurs directly between Autodesk and the customer. We expect the change in recognition of sales incentives to indirect channels from contra revenue to operating costs under the new transaction model to positively impact calculated revenue growth, while being broadly neutral to calculated operating profit and free cash flow dollars, and to result in a calculated negative impact to operating margin.  See Part II, Item 8, Note 2, \"Revenue Recognition\" in the Notes to the Consolidated Financial Statements for further detail on the results of our indirect and direct channel sales for the fiscal years ended January 31, 2025, 2024, and 2023.\nWe anticipate that our channel mix will continue to change as we scale our business. With the continued growth of our online Autodesk branded store and our new transaction model, we are transacting directly with more end customers, rather than through distributors, without substantial disruption to our revenue. We expect our indirect channel will continue to transact and support a considerable portion of our customers. We also expect our transition to annual billings for multi-year contracts to impact the timing of our billings and cash collections. We employ a variety of incentive programs and promotions to align our direct and indirect channels with our business strategies.\nPlatform Capabilities\n43\nTable of Contents \nWe are building a trusted, outcome-focused platform for critical customer workflows that enables end-to-end digital transformation for our customers and partners within and between the industries we serve. We aim to accelerate these customer workloads by providing granular, interoperable and accessible data.\nWe plan to do this by focusing on building the next generation of technology and services as trusted, shared capabilities. We aim to centralize critical and duplicative capabilities across key offerings. These include foundational capabilities to make our offers safer, faster, easier, and globally scalable, as well as capabilities that can accelerate new sources of value for our customers.  \n One example of these shared capabilities is Autodesk AI. We have been investing in AI for over a decade. Our focus is on building AI capabilities that add value to our customers’ workloads through augmentation, automation and analysis.  \nOne of our key strategies is to maintain an API based architecture of our software products to facilitate third-party development of complementary products and industry-specific software solutions. This approach enables customers and third parties to customize solutions for a wide variety of highly specific uses. We offer several programs that provide strategic investment funding, technological platforms, user communities, technical support, forums, and events to developers who develop add-on applications for our products. For example, we have established the Autodesk Platform Services to support innovators that build solutions to facilitate the development of a single connected ecosystem for the future of how things are designed, made, and used.\nIn addition to the competitive advantages afforded by our technology, our large global network of distributors, resellers, Solution Providers, third-party developers, customers, educators, educational institutions, learning partners, and students is a key competitive advantage that has been cultivated over an extensive period. This network of partners and relationships provides us with a broad and deep reach into volume markets worldwide. Our distributor, reseller and Solution Provider network is extensive and provides our customers with the resources to purchase, deploy, learn, and support our solutions quickly and easily. We have a significant number of registered third-party developers who create products that work well with our solutions and extend them to a variety of specialized applications.\nImpact at Autodesk\nAutodesk is committed to advancing a more sustainable, resilient, and inclusive world. We take action as a business to support our employees, customers, and communities in our collective opportunity to design and make a better world for all. \n \nWe focus our efforts to advance positive outcomes across three primary areas: energy and materials, health and resilience, and work and prosperity. These impact opportunity areas, informed by the UN Sustainable Development Goals (“SDGs”), have been identified through a multi-pronged process to align the top needs of our stakeholders, the issues most important to our business, and the areas we are best placed to accelerate positive impact at scale. \nWe drive positive outcomes across these areas primarily by empowering customers to leverage our technology to design and make net-zero carbon buildings, resilient infrastructure, more sustainable products, and cultivate a thriving workforce. We advance these opportunities with industry innovators through collaboration, philanthropic capital, software donations, and training. \nWe continue to power our business with 100% renewable energy, neutralize greenhouse gas emissions associated with our operations, and support an inclusive culture at Autodesk.\nThe Autodesk Foundation (the “Foundation”), a privately funded 501(c)(3) charity organization established and solely funded by us, leads our philanthropic efforts. The purpose of the Foundation is twofold: to support employees to create a better world at work, at home, and in the community by matching employees’ volunteer time and donations to nonprofit organizations; and to support organizations using design and make solutions to drive positive impact. On our behalf, the Foundation also administers a discounted software donation program to nonprofit organizations, entrepreneurs, and others who are developing design solutions that will transform industries and help shape a better world for all. \nAdditional information about our environmental, social, and governance program is available in our annual impact report on our website at www.autodesk.com. Information contained on or accessible through our website is not part of or incorporated by reference into this report.\nAssumptions Behind Our Strategy\n44\nTable of Contents \nOur strategy depends upon many assumptions, including: making our technology available to mainstream markets; leveraging our large global network of distributors, resellers, Solution Providers, third-party developers, customers, educators, educational institutions, learning partners, and students; improving the performance and functionality of our products and platform; and adequately protecting our intellectual property. If the outcome of any of these assumptions differs from our expectations, we may not be able to implement our strategy, which could potentially adversely affect our business. For further discussion regarding these and related risks, see Part I, Item 1A, “Risk Factors.”\nCRITICAL ACCOUNTING POLICIES AND ESTIMATES\nOur Consolidated Financial Statements are prepared in accordance with U.S. generally accepted accounting principles. In preparing our Consolidated Financial Statements, we make assumptions, judgments, and estimates that can have a significant impact on amounts reported in our Consolidated Financial Statements. We evaluate our estimates and assumptions on an ongoing basis. We base our assumptions, judgments, and estimates on historical experience and various other factors that we believe to be reasonable under the circumstances. Actual results could differ materially from these estimates under different assumptions or conditions. \nOur significant accounting policies are described in Part II, Item 8, “Financial Statements and Supplementary Data,” Note 1, “Business and Summary of Significant Accounting Policies,” in the Notes to Consolidated Financial Statements. An accounting policy is deemed to be critical if it requires an accounting estimate to be made based on assumptions about matters that are highly uncertain at the time the estimate is made, if different estimates reasonably could have been used, or if changes in the estimate that are reasonably possible could materially impact the financial statements. We believe that of all our significant accounting policies, the following accounting policies and specific estimates involve a greater degree of judgment and complexity. Accordingly, these are the accounting policies we believe are the most critical to aid in fully understanding and evaluating our financial condition and results of operations.\nRevenue Recognition -\n \nJudgments with Multiple Performance Obligations. \nOur contracts with customers may include promises to transfer multiple products and services to a customer. A performance obligation is a promise in a contract with a customer to transfer products or services that are distinct. Determining whether products and services are distinct performance obligations that should be accounted for separately or combined as a single performance obligation may require significant judgment that requires us to assess the nature of the promise and value delivered to the customer and the interaction of the desktop applications and cloud functionalities.  \nFor our product subscriptions, cloud service offerings, and flexible enterprise business arrangements, the functional nature of the promise, as well as the customers’ value expectations, led us to conclude desktop applications and cloud functionalities are not distinct in the context of the contract and should be accounted for as a single performance obligation. There is a high degree of interaction of the desktop applications and cloud functionalities, which is not available with the desktop applications alone or in conjunction with third-party cloud service providers. Furthermore, customers are not able to use the desktop applications for its intended purpose without our cloud functionalities. \nFor contracts with more than one performance obligation, the transaction price is allocated among the performance obligations in an amount that depicts the relative standalone selling price (“SSP”) of each obligation. We establish SSP for most of our products and services based on observable prices when sold separately in similar circumstances or to similar customers. When products or services are not sold separately, we establish SSP based on other observable inputs.\nBusiness Combinations. \nThe assets acquired and liabilities assumed in a business combination are recorded based on their estimated fair values at the acquisition date, with the exception of contract assets and contract liabilities (i.e., deferred revenue) which are recognized and measured on the acquisition date in accordance with Autodesk’s “Revenue Recognition” policy in Part II, Item 8, “Financial Statements and Supplementary Data,” Note 1 “Business and Summary of Significant Accounting Policies”.  Any residual purchase price is recorded as goodwill. Accounting for business combinations requires us to make significant estimates and assumptions, especially at the acquisition date with respect to intangible assets.\nAlthough we believe the assumptions and estimates we have made are reasonable, they are based in part on historical experience and information obtained from the management of the acquired companies and are inherently uncertain and unpredictable. Unanticipated events and circumstances may occur which may affect the accuracy or validity of such assumptions, estimates, or actual results. Examples of critical estimates used in valuing certain of the acquired intangible assets and in determining their useful lives include but are not limited to: \n•\nfuture expected cash flows from subscriptions and maintenance agreements, sales, and acquired developed technologies;\n45\nTable of Contents \n•\nexpected growth in revenue from the acquired company’s existing customer relationships;\n•\nuncertain tax positions and tax related valuation allowances assumed; and \n•\ndiscount rates used to determine the present value of estimated future cash flows.\nIncome Taxes. \nWe account for income taxes and the related accounts under the liability method. Deferred tax liabilities and assets are determined based on the difference between the financial statement and tax basis of assets and liabilities, using enacted rates expected to be in effect during the year in which the basis differences reverse. We recognize the tax benefit for an uncertain tax position when it meets the more likely than not threshold for recognition. We recognize potential accrued interest and penalties related to unrecognized tax benefits as income tax expense. \nA valuation allowance is recorded to reduce deferred tax assets when management cannot conclude that it is more likely than not that the deferred tax asset will be recovered. The valuation allowance is determined by assessing both positive and negative evidence to determine whether it is more likely than not that deferred tax assets are recoverable; such assessment is required on a jurisdiction-by-jurisdiction basis. Significant judgment is required in determining whether the valuation allowance should be recorded against deferred tax assets. In assessing the need for or release of a valuation allowance, we consider all available evidence including past operating results and estimates of future taxable income. \nAs we continually strive to optimize our overall business model, tax planning strategies may become feasible and prudent, allowing us to realize many of the deferred tax assets that are offset by a valuation allowance; therefore, we will continue to evaluate the ability to utilize the deferred tax assets each quarter, both in the U.S. and in foreign jurisdictions, based on all available evidence, both positive and negative. \nLoss Contingencies\n. As described in Part I, Item 3, “Legal Proceedings” and Part II, Item 8, “Financial Statements and Supplementary Data, Note 11, “Commitments and Contingencies,” in the Notes to Consolidated Financial Statements, we are periodically involved in various legal claims and proceedings. We routinely review the status of each significant matter and assess our potential financial exposure. If the potential loss from any matter is considered probable and the amount can be reasonably estimated, we record a liability for the estimated loss. Significant judgment is required to determine both the likelihood of there being, and the estimated amount of, a loss related to such matters. Due to inherent uncertainties related to these matters, we base our loss accruals on the best information available at the time. Until the final resolution of such matters, there may be an exposure to loss in excess of the amount recorded. As additional information becomes available, we reassess our potential liability and may revise our estimates. Such revisions could have a material impact on future quarterly or annual results of operations.\nRECENTLY ISSUED ACCOUNTING STANDARDS\nSee Part II, Item 8, “Financial Statements and Supplementary Data,” Note 1, “Business and Summary of Significant Accounting Policies,” in the Notes to Consolidated Financial Statements for a full description of recent accounting pronouncements, including the expected dates of adoption and estimated effects on results of operations and financial condition.\nOVERVIEW OF FISCAL 2025 \n•\nTotal net revenue was $6.13 billion during fiscal 2025, an increase of 12% compared to the prior fiscal year.\n•\nRecurring revenue as a percentage of net revenue was 97% and 98% for fiscal years ending January 31, 2025 and 2024, respectively.\n•\nNet revenue retention rate (“NR3”) was within the range of 100% and 110%, on a constant currency basis, as of both January 31, 2025 and 2024.\n•\nDeferred revenue was $4.13 billion, a decrease of 3% compared to the prior fiscal year. \n•\nRemaining performance obligations (short-term and long-term deferred revenue plus unbilled deferred revenue) (“RPO”) was $6.94 billion, an increase of 14% compared to the fourth quarter in the prior fiscal year. \n•\nCurrent remaining performance obligations were $4.46 billion, an increase of 12% compared to the prior fiscal year.\nRevenue Analysis\nDuring fiscal 2025, net revenue increased 12%, as compared to the prior fiscal year, primarily due to a 12% increase in subscription revenue.\n46\nTable of Contents \nFurther discussion of the drivers of these results are discussed below under the heading “Results of Operations.” \nWe rely significantly upon major distributors and resellers in both the United States and international regions, including TD Synnex Corporation and its global affiliates (collectively, “TD Synnex”). Total revenue from TD Synnex accounted for 33%,  39%, and 37% of Autodesk’s total net revenue during fiscal 2025, 2024 and 2023, respectively. Our customers through TD Synnex are the resellers and end users who purchase our software subscriptions and services. During fiscal 2023, we entered into transition agreements with TD Synnex to provide transition distribution activities for a one-to-two-year period, with potential extensions.  In the third fiscal quarter of 2025, we entered into a new distribution agreement with TD Synnex for government business in certain jurisdictions. Existing distribution agreements will continue in emerging markets. We have increased our selling efforts with Solution Providers in connection with our new transaction model. Consequently, we believe our business is not substantially dependent on TD Synnex.\nRecurring Revenue and Net Revenue Retention Rate\nIn order to help better understand our financial performance we use several key performance metrics, including recurring revenue and NR3. These metrics are key performance metrics and should be viewed independently of revenue and deferred revenue as these metrics are not intended to be combined with those items. We use these metrics to monitor the strength of our recurring business. We believe these metrics are useful to investors because they can help in monitoring the long-term health of our business. Our determination and presentation of these metrics may differ from that of other companies. The presentation of these metrics is meant to be considered in addition to, not as a substitute for or in isolation from, our financial measures prepared in accordance with GAAP. Please refer to the “Glossary of Terms” for the definitions of these metrics in Part I, Item 1, “Business”.\nThe following table outlines our recurring revenue metric for the fiscal years ended January 31, 2025, 2024, and 2023:\nFiscal Year Ended January 31, 2025\nChange compared to\nprior fiscal year end\nFiscal Year Ended January 31, 2024\nChange compared to\nprior fiscal year end\nFiscal Year Ended January 31, 2023\n$\n%    \n$\n%    \nRecurring Revenue\n (in millions)\n (1)\n$\n5,974 \n$\n597 \n11 \n%\n$\n5,377 \n$\n470 \n10 \n%\n$\n4,907 \nAs a percentage of net revenue\n97 \n%\nN/A\nN/A\n98 \n%\nN/A\nN/A\n98 \n%\n ________________\n(1)     The acquisition of a business may cause variability in the comparison of recurring revenue in this table above and recurring revenue derived from the revenue reported in the Consolidated Statements of Operations.\n \nNR3 was within the range of 100% and 110%, on a constant currency basis, as of both January 31, 2025 and 2024.\nForeign Currency Analysis\nWe generate a significant amount of our revenue in the United States, Germany, Japan, the United Kingdom, and Canada.\nThe following table shows the impact of foreign exchange rate changes on our net revenue and total spend: \nFiscal Year Ended January 31, 2025\nPercent change compared to\nprior fiscal year (as reported)\nConstant currency percent change compared to\nprior fiscal year (1)\nPositive/negative/neutral impact from foreign exchange rate changes\nNet revenue\n12 \n%\n13 \n%\nNegative\nTotal spend \n9 \n%\n10 \n%\nPositive\n ________________\n(1)\nPlease refer to the “Glossary of Terms” in Part I, Item 1, “Business” for the definitions of our constant currency growth rates. \nChanges in the value of the U.S. dollar may have a significant effect on net revenue, total spend, income from operations, and cash flow in future periods. We use foreign currency contracts to reduce the exchange rate effect on a portion of the net revenue of certain anticipated transactions but do not attempt to completely mitigate the impact of fluctuations of such foreign currency against the U.S. dollar.\n47\nTable of Contents \nRemaining Performance Obligations \n \nRPO represents deferred revenue and contractually stated or committed orders under early renewal and multi-year billing plans for subscription, services, license, and maintenance for which the associated deferred revenue has not yet been recognized. Unbilled deferred revenue is not included as a receivable or deferred revenue on our Consolidated Balance Sheets. See Part II, Item 8, Note 2, “Revenue Recognition” for more details on Autodesk's performance obligations. \n(in millions)\nJanuary 31, 2025\nJanuary 31, 2024\nDeferred revenue\n$\n4,128 \n$\n4,264 \nUnbilled deferred revenue\n2,810 \n1,844 \nRPO\n$\n6,938 \n$\n6,108 \n \nRPO consisted of the following:\n(in millions)\nJanuary 31, 2025\nJanuary 31, 2024\nCurrent RPO\n$\n4,457 \n$\n3,976 \nNon-current RPO\n2,481 \n2,132 \nRPO\n$\n6,938 \n$\n6,108 \nWe expect that the amount of RPO will change from quarter to quarter for several reasons, including the specific timing, duration, and size of customer subscription and support agreements, the specific timing of customer renewals, and foreign currency fluctuations. Historically, we have had increased EBA sales activity in our fourth fiscal quarter and this seasonality may affect the relative value of our billings, RPO, and cash collections in the fourth and first fiscal quarters. As customers transition from multi-year subscription contracts billed upfront to annual billing installments, some customers may choose annual contracts instead. If this were to occur, we would expect it to proportionately reduce the unbilled portion of our total remaining performance obligations and would expect it to impact total RPO growth rates negatively. Deferred revenue, billings, current RPO, revenue, Non-GAAP operating margin, and free cash flow would remain broadly unchanged in this scenario.\nBalance Sheet and Cash Flow Items\nAt January 31, 2025, we had $2.15 billion in cash, cash equivalents, and marketable securities. Our cash flow from operations increased to $1.61 billion for the fiscal year ended January 31, 2025, from $1.31 billion for the fiscal year ended January 31, 2024. We repurchased 3 million shares of our common stock for $858 million during fiscal 2025. Comparatively, we repurchased 4 million shares of our common stock for $795 million during fiscal 2024. Further discussion regarding the balance sheet and cash flow activities are discussed below under the heading “Liquidity and Capital Resources.” \n48\nTable of Contents \nRESULTS OF OPERATIONS\nOverview\nWe believe our investment in cloud products and a subscription business model, backed by a strong balance sheet, give us a robust foundation to successfully navigate complex geopolitical and global macro-economic challenges. However, material scarcity, supply chain disruption and resulting inflationary pressures, higher interest rates, a global labor shortage, ongoing geopolitical conflicts, and foreign exchange rate fluctuations, may impact our outlook. We also expect our transition to annual billings for multi-year contracts to impact the timing of our billings and cash collections. The extent of the impact of these risks on our business in fiscal 2026 and beyond will depend on several factors, some of which are out of our control. Further discussion of the potential impacts of these risks on our business can be found in Part I, Item 1A, “Risk Factors.”\nWe introduced a new transaction model for our token-based Flex offering in North America, and certain countries in EMEA, and APAC during fiscal 2023 and 2024. Most of our subscription offerings transitioned to the new transaction model in Australia during fiscal 2024. In fiscal 2025, we transitioned most of our indirect business to the new transaction model in our major markets. In this new transaction model, Solution Providers provide a quote to customers but the actual transaction occurs directly between Autodesk and the customer.\nOur sales incentives to Solution Providers will be recorded as operating expenses under the new transaction model as we will contract directly with end customers. Accordingly, we expect sales incentives paid to resellers recorded as a reduction of transaction price and subsequently recognized as a reduction to subscription revenue over the contract period will decrease as we transition to the new transaction model. Most of the sales incentives payments to Solution Providers in our new transaction model, will be considered incremental and recoverable costs of obtaining a contract with a customer and will be capitalized and included in “Prepaid expenses and other current assets” and “Long-term other assets” on the Consolidated Balance Sheets. The deferred costs will then be amortized over the period of benefit and recorded to “Sales and Marketing” on the Consolidated Statement of Operations. The sales incentives not qualifying for capitalization will be recorded to “Sales and Marketing” on the Consolidated Statement of Operations as the costs are incurred under the incentive program requirements.  In the near term, we expect the change in recognition of sales incentives to indirect channels from contra revenue to operating expenses under the new transaction model to positively impact calculated revenue growth, while being broadly neutral to calculated operating profit and free cash flow dollars, and to result in a calculated negative impact to operating margin. \nNet Revenue by Income Statement Presentation\nSubscription revenue consists of our term-based product subscriptions, cloud service offerings, and flexible EBAs. Revenue from these arrangements is predominately recognized ratably over the contract term commencing with the date our service is made available to customers and when all other revenue recognition criteria have been satisfied.\nMaintenance revenue consists of renewal fees for existing maintenance plan agreements that were initially purchased with a perpetual software license. Under our maintenance plan, customers are eligible to receive unspecified upgrades, when and if available, and technical support. We recognize maintenance revenue ratably over the term of the agreements, which is generally one year. \nOther revenue consists of revenue from consulting and other products and services and is recognized as the products are delivered and services are performed.\n49\nTable of Contents \n \nFiscal Year Ended January 31, 2025\nChange compared to prior fiscal year\nFiscal Year Ended January 31, 2024\nManagement Comments\n(in millions, except percentages)\n$     \n%      \nNet revenue:\nSubscription\n$\n5,717 \n$\n601 \n12 \n%\n$\n5,116 \nIncrease due to growth in subscription renewal revenue. Also contributing to the growth was an increase in revenue from Cloud Service offerings.\nMaintenance \n41 \n(13)\n(24)\n%\n54 \n    Total subscription and maintenance revenue \n5,758 \n588 \n11 \n%\n5,170 \nOther\n373 \n46 \n14 \n%\n327 \n$\n6,131 \n$\n634 \n12 \n%\n$\n5,497 \n \n \nFiscal Year Ended January 31, 2024\nChange compared to prior fiscal year\nFiscal Year Ended January 31, 2023\nManagement Comments\n(in millions, except percentages)\n$\n%      \nNet revenue:\nSubscription\n$\n5,116 \n$\n465 \n10 \n%\n$\n4,651 \nIncrease due to growth in the subscriber base across subscription types, led by subscription renewal revenue with current-year subscription renewals reflecting new subscriptions sold in prior periods. Also contributing to the growth was an increase in revenue from EBA offerings and Cloud Service Offerings.\nMaintenance \n54 \n(11)\n(17)\n%\n65 \n    Total subscription and maintenance revenue \n5,170 \n454 \n10 \n%\n4,716 \nOther \n327 \n38 \n13 \n%\n289 \n$\n5,497 \n$\n492 \n10 \n%\n$\n5,005 \n50\nTable of Contents \nNet Revenue by Product Family\nOur product offerings are focused in four primary product families: Architecture, Engineering, Construction and Operations (“AECO”), AutoCAD and AutoCAD LT, Manufacturing (“MFG”), and Media and Entertainment (“M&E”).\n \nFiscal Year Ended January 31, 2025\nChange compared to prior fiscal year\nFiscal Year Ended January 31, 2024\nManagement Comments\n(in millions, except percentages)\n$     \n%      \nNet revenue by product family:\nAECO\n$\n2,937 \n$\n357 \n14 \n%\n$\n2,580 \nIncrease due to growth in revenue from AEC Collections, EBAs, Autodesk Construction Cloud, Revit, and Payapps.\nAutoCAD and AutoCAD LT\n1,572 \n110 \n8 \n%\n1,462 \nIncrease due to growth in revenue from both AutoCAD and AutoCAD LT.\nMFG\n1,189 \n126 \n12 \n%\n1,063 \nIncrease due to growth in revenue from MFG Collections, EBA offerings, Inventor, and Fusion.\nM&E\n315 \n20 \n7 \n%\n295 \nIncrease due to revenue from the PIX acquisition and EBA offerings.\nOther\n118 \n21 \n22 \n%\n97 \n$\n6,131 \n$\n634 \n12 \n%\n$\n5,497 \n \nFiscal Year Ended January 31, 2024\nChange compared to prior fiscal year\nFiscal Year Ended January 31, 2023\nManagement Comments\n(in millions, except percentages)\n$\n%      \nNet revenue by product family:\nAECO\n$\n2,580 \n$\n302 \n13 \n%\n$\n2,278 \nIncrease due to growth in revenue from AEC Collections, EBAs, Autodesk Build, and Revit.\nAutoCAD and AutoCAD LT\n1,462 \n75 \n5 \n%\n1,387 \nIncrease due to growth in revenue from both AutoCAD and AutoCAD LT.\nMFG\n1,063 \n85 \n9 \n%\n978 \nIncrease due to growth in revenue from Product Design & MFG Collections, EBAs, Fusion, and Inventor.\nM&E\n295 \n4 \n1 \n%\n291 \nIncrease primarily due to growth in revenue from EBAs.\nOther\n97 \n26 \n37 \n%\n71 \n$\n5,497 \n$\n492 \n10 \n%\n$\n5,005 \n51\nTable of Contents \nNet Revenue by Geographic Area\n \nFiscal Year Ended January 31, 2025\nChange compared to prior fiscal year\nConstant currency change compared to prior fiscal year\nFiscal Year Ended January 31, 2024\nChange compared to prior fiscal year\nConstant currency change compared to prior fiscal year\nFiscal Year Ended January 31, 2023\n(in millions, except percentages)\n$      \n%      \n%\n$      \n%      \n%\nNet revenue:\nAmericas\nU.S.\n$\n2,228 \n$\n250 \n13 \n%\n*\n$\n1,978 \n$\n258 \n15 \n%\n*\n$\n1,720 \nOther Americas\n488 \n28 \n6 \n%\n*\n460 \n88 \n24 \n%\n*\n372 \nTotal Americas\n2,716 \n278 \n11 \n%\n12 \n%\n2,438 \n346 \n17 \n%\n17 \n%\n2,092 \nEMEA\n2,307 \n265 \n13 \n%\n13 \n%\n2,042 \n136 \n7 \n%\n12 \n%\n1,906 \nAPAC\n1,108 \n91 \n9 \n%\n13 \n%\n1,017 \n10 \n1 \n%\n6 \n%\n1,007 \nTotal net revenue \n$\n6,131 \n$\n634 \n12 \n%\n13 \n%\n$\n5,497 \n$\n492 \n10 \n%\n13 \n%\n$\n5,005 \n____________________\n*        Constant currency data not provided at this level. \nWe believe that international revenue will continue to comprise a majority of our net revenue. Unfavorable economic conditions, including in connection with the ongoing geopolitical conflicts (and any related political or economic responses and counter-responses or otherwise by various global actors or the general effect on the global economy), in the countries that contribute a significant portion of our net revenue, including in emerging economies such as Brazil, India, and China, has had and may continue to have an adverse effect on our business in those countries and our overall financial performance. Changes in the value of the U.S. dollar relative to other currencies have significantly affected, and could continue to significantly affect, our financial results for a given period even though we hedge a portion of our current and projected revenue. Increases to the levels of political and economic unpredictability or protectionism in the global market may impact our future financial results.\n52\nTable of Contents \nNet Revenue by Sales Channel\n \nFiscal Year Ended January 31, 2025\nChange compared to prior fiscal year\nFiscal Year Ended January 31, 2024\n(in millions, except percentages)\n$     \n%      \nNet revenue by sales channel:\nIndirect\n$\n3,568 \n$\n124 \n4 \n%\n$\n3,444 \nDirect\n2,563 \n510 \n25 \n%\n2,053 \nTotal net revenue\n$\n6,131 \n$\n634 \n12 \n%\n$\n5,497 \n \nFiscal Year Ended January 31, 2024\nChange compared to prior fiscal year\nFiscal Year Ended January 31, 2023\n(in millions, except percentages)\n$\n%      \nNet revenue by sales channel:\nIndirect\n$\n3,444 \n$\n194 \n6 \n%\n$\n3,250 \nDirect\n2,053 \n298 \n17 \n%\n1,755 \nTotal net revenue\n$\n5,497 \n$\n492 \n10 \n%\n$\n5,005 \n For fiscal 2025 and 2024, approximately 42% and 37%, respectively, of our revenue was derived from direct sales to customers. With the continued growth of our online Autodesk branded store and the introduction of our new transaction model, we have been decreasing our sales through resellers and distributors and transacting directly with more end customers. We anticipate that our revenue by direct sales channel will continue to increase as a percentage of total net revenue. We expect our indirect channel will continue to transact and support a considerable portion of our customers, particularly in emerging regions. See further discussion regarding our new transaction model in the Overview to Results of Operations above. \n53\nTable of Contents \nNet Revenue by Product Type\nFiscal Year Ended January 31, 2025\nChange compared to\nprior fiscal year\nFiscal Year Ended January 31, 2024\n(In millions, except percentages)\n$    \n%    \nManagement Comments\nNet Revenue by Product Type:\nDesign\n$\n5,104 \n$\n457 \n10 \n%\n$\n4,647 \nIncrease primarily due to growth in AEC collections, AutoCAD Family, MFG collections and EBA offerings.\nMake\n654 \n131 \n25 \n%\n523 \nIncrease primarily due to growth in revenue from Autodesk Construction Cloud, Fusion and PIX.\nOther\n373 \n46 \n14 \n%\n327 \nTotal Net Revenue\n$\n6,131 \n$\n634 \n12 \n%\n$\n5,497 \nFiscal Year Ended January 31, 2024\nChange compared to\nprior fiscal year\nFiscal Year Ended January 31, 2023\n(In millions, except percentages)\n$    \n%    \nManagement Comments\nNet Revenue by Product Type:\nDesign\n$\n4,647 \n$\n383 \n9 \n%\n$\n4,264 \nIncrease primarily due to growth in AEC collections, EBA offerings, and AutoCAD Family.\nMake\n523 \n71 \n16 \n%\n452 \nIncrease primarily due to growth in revenue from Autodesk Construction Cloud and Fusion.\nOther\n327 \n38 \n13 \n%\n289 \nTotal Net Revenue\n$\n5,497 \n$\n492 \n10 \n%\n$\n5,005 \nCost of Revenue and Operating Expenses\nCost of subscription and maintenance revenue includes the labor costs of providing product support to our subscription and maintenance customers, SaaS vendor costs and allocated IT costs, facilities costs, professional services fees related to operating our network and cloud infrastructure, royalties, depreciation expense and operating lease payments associated with computer equipment, data center costs, related expenses of network operations, stock-based compensation expense, and gains and losses on our operating expense cash flow hedges.\nCost of other revenue includes labor costs associated with product setup, costs of consulting and training services contracts, and collaborative project management services contracts. Cost of other revenue also includes stock-based compensation expense, overhead charges, allocated IT and facilities costs, professional services fees, and gains and losses on our operating expense cash flow hedges.\nCost of revenue, at least over the near term, is affected by labor costs, hosting costs for our cloud offerings, the volume and mix of product sales, fluctuations in consulting costs, amortization of developed technology, new customer support offerings, royalty rates for licensed technology embedded in our products, stock-based compensation expense, and gains and losses on our operating expense cash flow hedges.\nMarketing and sales expenses include salaries, bonuses, benefits, and stock-based compensation expense for our marketing and sales employees, the expense of travel, entertainment, and training for such personnel, sales commissions to employees and Solution Providers, and the costs of programs aimed at increasing revenue, such as advertising, trade shows and expositions, and various sales and promotional programs. Marketing and sales expenses also include SaaS vendor costs and allocated IT costs, payment processing fees, the cost of supplies and equipment, gains and losses on our operating expense cash flow hedges, facilities costs, and labor costs associated with sales and order management.\n54\nTable of Contents \nResearch and development expenses, which are expensed as incurred, consist primarily of salaries, bonuses, benefits, and stock-based compensation expense for research and development employees, the expense of travel, entertainment, and training for such personnel, professional services such as fees paid to software development firms and independent contractors, SaaS vendor costs and allocated IT costs, gains and losses on our operating expense cash flow hedges, and facilities costs.\nGeneral and administrative expenses include salaries, bonuses, benefits, and stock-based compensation expense for our CEO, finance, human resources, and legal employees, as well as professional fees for legal and accounting services, SaaS vendor costs and net IT costs, certain foreign business taxes, gains and losses on our operating expense cash flow hedges, expense of travel, entertainment, and training, facilities costs, acquisition-related costs, and the cost of supplies and equipment.\nFiscal Year Ended January 31, 2025\nChange compared to prior fiscal year\nFiscal Year Ended January 31, 2024\nManagement Comments\n \n(In millions, except percentages)\n$     \n%      \nCost of revenue:\nSubscription and maintenance\n$\n413 \n$\n32 \n8 \n%\n$\n381 \nIncrease primarily due to employee-related costs driven by higher headcount and an increase in cloud hosting costs.\nOther\n80 \n(2)\n(2)\n%\n82 \nDecrease primarily due to decrease in professional fees and stock-based compensation expense.\n Amortization of developed technologies\n85 \n37 \n77 \n%\n48 \nIncrease is primarily due to amortization of acquired developed technologies related to acquisitions in fiscal 2025.\n           Total cost of revenue\n$\n578 \n$\n67 \n13 \n%\n$\n511 \nOperating expenses:\nMarketing and sales\n$\n2,000 \n$\n177 \n10 \n%\n$\n1,823 \nIncrease primarily due to an increase in employee-related costs mostly related to headcount growth, merit increases and internal sales commissions, partially offset by a decrease in stock-based compensation expense.  Also, due to an increase in sales commissions to Solution Providers due to the recognition of these costs in marketing and sales expense under the new transaction model, cloud hosting costs, and professional fees partially offset by an increase in capitalized software costs.\nResearch and development\n1,485 \n112 \n8 \n%\n1,373 \nIncrease primarily due to employee-related costs driven by higher headcount and merit increases and an increase in cloud hosting costs and professional fees partially offset by an increase in capitalized software costs.\nGeneral and administrative\n650 \n30 \n5 \n%\n620 \nIncrease primarily due to an increase in employee-related costs driven by higher headcount and merit increases and an increase in cloud hosting costs partially offset by a decrease in charitable contributions to the Autodesk Foundation and a decrease in lease-related asset impairment and other charges.\nAmortization of purchased intangibles\n49 \n7 \n17 \n%\n42 \nThe increase is primarily due to amortization of acquired intangibles as a result of acquisitions in fiscal 2025 offset by previously acquired assets that continue to become fully amortized.\nRestructuring, other exit costs, and facility reductions\n15 \n15 \nNM\n— \nThe increase is due to the restructuring plan the Company initiated during fiscal 2026. See Part II, Item 8, Note 17, “Subsequent Events” for more details.\n           Total operating expenses\n$\n4,199 \n$\n341 \n9 \n%\n$\n3,858 \n55\nTable of Contents \nFiscal Year Ended January 31, 2024\nChange compared to prior fiscal year\nFiscal Year Ended January 31, 2023\nManagement comments\n \n(In millions, except percentages)\n$      \n%      \nCost of revenue:\nSubscription and maintenance \n$\n381 \n$\n38 \n11 \n%\n$\n343 \nIncrease primarily due to employee-related costs, including stock-based compensation expense, driven by higher headcount and merit increases, as well as an increase in cloud hosting costs and professional fees.\nOther \n82 \n3 \n4 \n%\n79 \nIncrease primarily due to employee-related costs, including stock-based compensation expense, driven by higher headcount and merit increases.\n Amortization of developed technologies\n48 \n(10)\n(17)\n%\n58 \nThe decrease is primarily due to previously acquired assets that continue to become fully amortized offset by amortization of acquired developed technologies as a result of acquisitions in fiscal 2024.\n           Total cost of revenue\n$\n511 \n$\n31 \n6 \n%\n$\n480 \nOperating expenses:\nMarketing and sales\n$\n1,823 \n$\n78 \n4 \n%\n$\n1,745 \nIncrease primarily due to employee-related costs driven by merit and benefit increases and an increase in cloud hosting costs partially offset by higher capitalized software costs.\nResearch and development\n1,373 \n154 \n13 \n%\n1,219 \nIncrease primarily due to employee-related costs, including stock-based compensation, driven by higher headcount and merit increases, as well as an increase in cloud hosting costs partially offset by lower professional fees.\nGeneral and administrative\n620 \n88 \n17 \n%\n532 \nIncrease primarily due to an increase in employee-related costs, including stock-based compensation expense, driven by higher headcount and merit increases, as well as an increase in cloud hosting costs and lower capitalized software costs.\nAmortization of purchased intangibles\n42 \n2 \n5 \n%\n40 \nThe increase is primarily due to amortization of acquired intangibles as a result of acquisitions in fiscal 2024 offset by previously acquired assets that continue to become fully amortized.\n           Total operating expenses\n$\n3,858 \n$\n322 \n9 \n%\n$\n3,536 \nThe following table highlights our expectation for the absolute dollar change for fiscal 2026 as compared to fiscal 2025:\nAbsolute dollar impact\nManagement Comments\nCost of revenue\nIncrease\nWe expect our cost of revenue to increase as our revenue grows.\nMarketing and sales\nIncrease\nWe expect marketing and sales expenses to increase with the recognition of Solution Provider commissions under our new transaction model, partially offset by savings from the restructuring initiated in fiscal 2026.\nResearch and development\nIncrease\nWe expect our research and development expenses to increase as we continue our investments in cloud, platform, and artificial intelligence partially offset by savings from the restructuring initiated in fiscal 2026.\nGeneral and administrative\nFlat\nWe expect general and administrative expenses to remain flat as we gain increased operational leverage.\nAmortization of purchased intangibles \nFlat\nWe expect our amortization of purchased intangibles to remain unchanged.\n56\nTable of Contents \nInterest and Other Expense, Net\nThe following table sets forth the components of interest and other expense, net:\n \nFiscal year ended January 31,\n \n2025\n2024\n2023\n \n(in millions)\nInterest and investment income (expense), net \n$\n28 \n$\n26 \n$\n(71)\nGain on foreign currency\n6 \n10 \n15 \n(Loss) gain on strategic investments\n(10)\n(32)\n1 \nOther income \n6 \n4 \n12 \nInterest and other income (expense), net\n$\n30 \n$\n8 \n$\n(43)\nInterest and other income (expense), net, increased by $22 million during fiscal 2025, as compared to fiscal 2024. The increase in interest and other income (expense), net, was primarily due to a decrease in impairments of strategic investment equity securities and an increase in gains for investments in debt and equity securities that are held in a rabbi trust under non-qualified deferred compensation plans partially offset by a decrease in interest income and a decrease in gains on foreign currency in the current period as compared to the prior period.\nInterest and other income (expense), net, positively changed by $51 million during fiscal 2024, as compared to fiscal 2023. The positive change in interest and other income (expense), net, was primarily due to an increase in interest income due to higher interest rates in the current period as compared to the prior period and gains in the current year for investments in debt and equity securities that are held in a rabbi trust under non-qualified deferred compensation plans compared to losses in the prior period. The increase in interest and other income (expense), net, was partially offset by an increase in losses on strategic investment equity securities in the current period compared to the prior period.\nInterest expense and investment income fluctuates based on average cash, marketable securities, debt balances, average maturities, and interest rates.\nGains and losses on foreign currency are primarily due to the impact of re-measuring foreign currency transactions and net monetary assets into the functional currency of the corresponding entity. The amount of the gain or loss on foreign currency is driven by the volume of foreign currency transactions and the foreign currency exchange rates for the year.\nProvision for Income Taxes\nWe account for income taxes and the related accounts under the liability method. Deferred tax liabilities and assets are determined based on the difference between the financial statement and tax bases of assets and liabilities, using enacted rates expected to be in effect during the year in which the basis differences reverse. \nIncome tax expense was $272 million and $230 million for fiscal 2025 and 2024, relative to pre-tax income of $1,384 million and $1,136 million, respectively, for the same periods. The tax expense for fiscal 2025 consists primarily of the U.S. and foreign tax expense, including withholding tax on payments made to the United States or to Singapore from foreign sources, a partial audit settlement with the IRS, and related increase in reserves relating to research and development tax credits, offset by a decrease in tax expense relating to stock-based compensation and tax benefit from the Australia valuation allowance release. Tax expense for fiscal 2024 consisted primarily of the U.S. and foreign tax expense, including withholding tax on payments made to the United States or to Singapore from foreign sources, an increase in tax expense relating to stock-based compensation reduced by non-recurring integration net tax benefit and an income tax benefit arising from temporary relief provided by the Internal Revenue Service relating to U.S. foreign tax credit regulations.\nA valuation allowance is recorded to reduce deferred tax assets when management cannot conclude that it is more likely than not that the net deferred tax asset will be recovered. The valuation allowance is determined by assessing both positive and negative evidence to determine whether it is more likely than not that deferred tax assets are recoverable; such assessment is required on a jurisdiction-by-jurisdiction basis. Significant judgment is required in determining whether the valuation allowance should be recorded against deferred tax assets. In assessing the need for a valuation allowance, we consider all available evidence including past operating results and estimates of future taxable income. \n57\nTable of Contents \nIn fiscal 2025, the company established a valuation allowance through goodwill in Australia related to negative evidence at the time of the Payapps Limited acquisition; however, due to positive evidence supporting the realization of its deferred tax assets the valuation allowance was released.\n \nWe continue to retain a valuation allowance against California, Michigan, and Massachusetts deferred tax assets, as well as U.S. capital losses and deferred tax assets that will convert into a capital loss upon reversal as we do not have sufficient income of the appropriate character to benefit these deferred tax assets. Also, the Company continues to retain a valuation allowance against foreign deferred tax assets in Portugal and New Zealand and Australia. \nAs we continually strive to optimize our overall business model, tax planning strategies may become feasible whereby management may determine, based on all available evidence, both positive and negative, that it is more likely than not that the deferred tax assets in Portugal, New Zealand, California, Massachusetts, Michigan, and the assets relating to capital losses or assets that will convert into a capital loss upon reversal in Australia and U.S. will be realized.\nAs of January 31, 2025, we had $312 million of gross unrecognized tax benefits, of which $47 million would reduce our valuation allowance, if recognized.  The remaining $265 million would impact the effective tax rate. The amount of unrecognized tax benefits will immaterially decrease in the next twelve months for statute lapses.\nOur future effective annual tax rate may be materially impacted by the amount of benefits and charges from tax amounts associated with our foreign earnings that are taxed at rates different from the federal statutory rate, changes in valuation allowances, level of profit before tax, accounting for uncertain tax positions, business combinations, closure of statute of limitations or settlement of tax audits, and changes in tax laws. Our future effective tax rates may be adversely affected to the extent earnings are lower than anticipated in countries where we have lower statutory tax rates. \nOur revenue is currently subject to U.S. income tax at the time it is billed. We anticipate filing an election in fiscal 2026 that will more closely align the timing of taxation of our revenue with our U.S. GAAP revenue recognition principles. The impact of this election is anticipated to increase our cash flow from operating activities in fiscal 2026 and increase our provision for income taxes due to the loss of taxation benefits we receive through the FDII and GILTI tax regimes.\nSigned into law on August 16, 2022, the Inflation Reduction Act contains many revisions to the Internal Revenue Code effective in taxable years beginning after December 31, 2022, including a 15% corporate alternative minimum tax. We continue to monitor the impact the Inflation Reduction Act on our consolidated financial statements.\n58\nTable of Contents \nOTHER FINANCIAL INFORMATION\nIn addition to our results determined under U.S. generally accepted accounting principles (“GAAP”) discussed above, we believe the following non-GAAP measures are useful to investors in evaluating our operating performance. For the fiscal years ended January 31, 2025, 2024, and 2023, our gross profit, income from operations, operating margin, net income, and diluted net income per share on a GAAP and non-GAAP basis were as follows (in millions except for operating margin and per share data):\nFiscal Year Ended January 31,\n2025\n2024\n2023\n(Unaudited)\nGross profit\n$\n5,553 \n$\n4,986 \n$\n4,525 \nNon-GAAP gross profit\n$\n5,683 \n$\n5,080 \n$\n4,624 \nIncome from operations\n$\n1,354 \n$\n1,128 \n$\n989 \nNon-GAAP income from operations\n$\n2,231 \n$\n1,962 \n$\n1,785 \nOperating margin\n22 \n%\n21 \n%\n20 \n%\nNon-GAAP operating margin\n36 \n%\n36 \n%\n36 \n%\nNet income\n$\n1,112 \n$\n906 \n$\n823 \nNon-GAAP net income \n$\n1,839 \n$\n1,642 \n$\n1,445 \nDiluted net income per share\n$\n5.12 \n$\n4.19 \n$\n3.78 \nNon-GAAP diluted net income per share \n$\n8.47 \n$\n7.60 \n$\n6.63 \n \nFor our internal budgeting and resource allocation process and as a means to provide consistency in period-to-period comparisons, we use non-GAAP measures to supplement our consolidated financial statements presented on a GAAP basis. These non-GAAP measures do not include certain items that may have a material impact upon our reported financial results. We also use non-GAAP measures in making operating decisions because we believe those measures provide meaningful supplemental information regarding our earning potential and performance for management by excluding certain benefits, credits, expenses, and charges that may not be indicative of our core business operating results. For the reasons set forth below, we believe these non-GAAP financial measures are useful to investors both because (1) they allow for greater transparency with respect to key metrics used by management in its financial and operational decision-making and (2) they are used by our institutional investors and the analyst community to analyze the health of our business. This allows investors and others to better understand and evaluate our operating results and future prospects in the same manner as management, compare financial results across accounting periods and to those of peer companies, and to better understand the long-term performance of our core business. We also use some of these measures for purposes of determining company-wide incentive compensation. \nThere are limitations in using non-GAAP financial measures because non-GAAP financial measures are not prepared in accordance with GAAP and may be different from non-GAAP financial measures used by other companies. The non-GAAP financial measures included above are limited in value because they exclude certain items that may have a material impact upon our reported financial results. In addition, they are subject to inherent limitations as they reflect the exercise of judgments by management about which charges are excluded from the non-GAAP financial measures. We compensate for these limitations by analyzing current and future results on a GAAP basis as well as a non-GAAP basis and also by providing GAAP measures in our public disclosures. The presentation of non-GAAP financial information is meant to be considered in addition to, not as a substitute for or in isolation from, the directly comparable financial measures prepared in accordance with GAAP. We urge investors to review the reconciliation of our non-GAAP financial measures to the comparable GAAP financial measures included below, and not to rely on any single financial measure to evaluate our business. \n59\nTable of Contents \nRECONCILIATION OF GAAP FINANCIAL MEASURES TO NON-GAAP FINANCIAL MEASURES\n(In millions except for operating margin, and per share data):\n \nFiscal Year Ended January 31,\n \n2025\n2024\n2023\n(Unaudited)\nGross profit\n$\n5,553 \n$\n4,986 \n$\n4,525 \nStock-based compensation expense\n50 \n51 \n46 \nAmortization of developed technologies\n80 \n43 \n53 \nNon-GAAP gross profit\n$\n5,683 \n$\n5,080 \n$\n4,624 \nIncome from operations\n$\n1,354 \n$\n1,128 \n$\n989 \nStock-based compensation expense\n686 \n703 \n660 \nAmortization of developed technologies\n80 \n43 \n53 \nAmortization of purchased intangibles \n49 \n41 \n40 \nAcquisition-related costs\n47 \n33 \n10 \nLease-related asset impairments and other charges\n— \n14 \n33 \nRestructuring, other exit costs, and facility reductions\n15 \n— \n— \nNon-GAAP income from operations\n$\n2,231 \n$\n1,962 \n$\n1,785 \nOperating margin\n22 \n%\n21 \n%\n20 \n%\nStock-based compensation expense\n11 \n%\n13 \n%\n13 \n%\nAmortization of developed technologies\n1 \n%\n1 \n%\n1 \n%\nAmortization of purchased intangibles \n1 \n%\n1 \n%\n1 \n%\nAcquisition-related costs\n1 \n%\n1 \n%\n— \n%\nNon-GAAP operating margin (1)\n36 \n%\n36 \n%\n36 \n%\nNet income\n$\n1,112 \n$\n906 \n$\n823 \nStock-based compensation expense\n686 \n703 \n660 \nAmortization of developed technologies\n80 \n43 \n53 \nAmortization of purchased intangibles \n49 \n41 \n40 \nAcquisition-related costs\n47 \n33 \n10 \nLease-related asset impairments and other charges\n— \n14 \n33 \nRestructuring, other exit costs, and facility reductions\n15 \n— \n— \nLoss (gain) on strategic investments and dispositions, net\n10 \n32 \n(1)\n(Release) establishment of valuation allowance on deferred tax assets \n(15)\n16 \n(38)\nDiscrete GAAP tax items\n6 \n(34)\n28 \nIncome tax effect of non-GAAP adjustments\n(151)\n(112)\n(163)\nNon-GAAP net income \n$\n1,839 \n$\n1,642 \n$\n1,445 \n60\nTable of Contents \n \nFiscal Year Ended January 31,\n \n2025\n2024\n2023\n(Unaudited)\nDiluted net income per share\n$\n5.12 \n$\n4.19 \n$\n3.78 \nStock-based compensation expense\n3.15 \n3.26 \n3.03 \nAmortization of developed technologies\n0.37 \n0.20 \n0.24 \nAmortization of purchased intangibles \n0.23 \n0.19 \n0.18 \nAcquisition-related costs\n0.22 \n0.15 \n0.05 \nLease-related asset impairments and other charges\n— \n0.06 \n0.15 \nRestructuring, other exit costs, and facility reductions\n0.07 \n— \n— \nLoss (gain) on strategic investments and dispositions, net\n0.05 \n0.15 \n— \n(Release) establishment of valuation allowance on deferred tax assets\n(0.07)\n0.07 \n(0.18)\nDiscrete GAAP tax items\n0.03 \n(0.15)\n0.13 \nIncome tax effect of non-GAAP adjustments\n(0.70)\n(0.52)\n(0.75)\nNon-GAAP diluted net income per share \n$\n8.47 \n$\n7.60 \n$\n6.63 \n_______________\n(1)\nTotals may not sum due to rounding.\nOur non-GAAP financial measures may exclude the following: \nStock-based compensation expenses.\n We exclude stock-based compensation expenses from non-GAAP measures primarily because they are non-cash expenses and management finds it useful to exclude certain non-cash charges to assess the appropriate level of various operating expenses to assist in budgeting, planning, and forecasting future periods.  Moreover, because of varying available valuation methodologies, subjective assumptions, and the variety of award types that companies can use under FASB ASC Topic 718, we believe excluding stock-based compensation expenses allows investors to make meaningful comparisons between our recurring core business operating results and those of other companies.\nAmortization of developed technologies and purchased intangibles.\n We incur amortization of acquisition-related developed technologies and purchased intangibles in connection with acquisitions of certain businesses and technologies. Amortization of developed technologies and purchased intangibles is inconsistent in amount and frequency and is significantly affected by both the timing and size of our acquisitions. Management finds it useful to exclude these variable charges from our cost of revenues to assist in budgeting, planning, and forecasting future periods. Investors should note that the use of intangible assets contributed to our revenues earned during the periods presented and will contribute to our future period revenues as well. Amortization of developed technologies and purchased intangible assets will recur in future periods.\nRestructuring, other exit costs, and facility reductions.\n These expenses are associated with realigning our business strategies based on current economic conditions. In connection with these restructuring actions or other exit actions, we recognize costs related to termination benefits for former employees whose positions were eliminated, the reduction of facilities, and cancellation of certain contracts. We exclude these charges because these expenses are not reflective of ongoing business and operating results. We believe it is useful for investors to understand the effects of these items on our total operating expenses. \nLease-related asset impairments and other charges. \n These charges are associated with the optimization of our facilities costs related to leases for facilities that we have vacated as a result of our one-time move to a more hybrid remote workforce. In connection with these facility leases, we recognize costs related to the impairment or abandonment of operating lease right-of-use assets, computer equipment, furniture, and leasehold improvements, and other costs. We exclude these charges because these expenses are not reflective of ongoing business and operating results. We believe it is useful for investors to understand the effects of these items on our total operating expenses.\nAcquisition-related costs.\n We exclude certain acquisition-related costs, including due diligence costs, professional fees in connection with an acquisition, certain financing costs, and certain integration-related expenses. These expenses are unpredictable, and depend on factors that may be outside of our control and unrelated to the continuing operations of the acquired business or our Company. In addition, the size and complexity of an acquisition, which often drives the magnitude of \n61\nTable of Contents \nacquisition-related costs, may not be indicative of such future costs. We believe excluding acquisition-related costs facilitates the comparison of our financial results to the Company's historical operating results and to other companies in our industry.\nLoss (gain) on strategic investments and dispositions.\n We exclude gains and losses related to our strategic investments and dispositions of strategic investments, purchased intangibles, and businesses from our non-GAAP measures primarily because management finds it useful to exclude these variable gains and losses on these investments and dispositions in assessing our financial results. Included in these amounts are non-cash unrealized gains and losses, dividends received, realized gains and losses on the sales or losses on the impairment of these investments, and gain and loss on dispositions. We believe excluding these items is useful to investors because they do not correlate to the underlying performance of our business and these losses or gains were incurred in connection with strategic investments and dispositions which do not occur regularly. \nDiscrete tax provision items.\n We exclude the GAAP tax provision, including discrete items, from the non-GAAP measure of net income (loss), and include a non-GAAP tax provision based upon the projected annual non-GAAP effective tax rate. Discrete tax items include income tax expenses or benefits that do not relate to ordinary income from continuing operations in the current fiscal year, unusual or infrequently occurring items, or the tax impact of certain stock-based compensation. Examples of discrete tax items include, but are not limited to, certain changes in judgment and changes in estimates of tax matters related to prior fiscal years, certain costs related to business combinations, certain changes in the realizability of deferred tax assets, or changes in tax law. Management believes this approach assists investors in understanding the tax provision and the effective tax rate related to ongoing operations. We believe the exclusion of these discrete tax items provides investors with useful supplemental information about our operational performance.\nEstablishment (release) of a valuation allowance on certain net deferred tax assets.\n This is a non-cash charge to record or to release a valuation allowance on certain deferred tax assets. As explained above, management finds it useful to exclude certain non-cash charges to assess the appropriate level of various cash expenses to assist in budgeting, planning, and forecasting future periods.\nIncome tax effects on the difference between GAAP and non-GAAP costs and expenses.\n The income tax effects that are excluded from the non-GAAP measures relate to the tax impact on the difference between GAAP and non-GAAP expenses, primarily due to stock-based compensation, amortization of purchased intangibles, and restructuring charges and other exit costs (benefits) for GAAP and non-GAAP measures.\nLIQUIDITY AND CAPITAL RESOURCES\nOur primary source of cash is from the sale of our software and related services. Our primary use of cash is payment of our operating costs, which consist primarily of employee-related expenses, such as compensation and benefits, as well as general operating expenses for marketing, facilities, and overhead costs. Long-term cash requirements for items other than normal operating expenses are anticipated for the following: the acquisition of businesses, software products, or technologies complementary to our business; repayment of debt; common stock repurchases; and capital expenditures, including the purchase and implementation of internal-use software applications.\nAt January 31, 2025, our principal sources of liquidity were cash, cash equivalents, and marketable securities totaling $2.15 billion and net accounts receivable of $1.01 billion.\nIn November 2022, Autodesk entered into an amended and restated credit agreement (“Credit Agreement”) by and among Autodesk, the lenders party thereto, and Citibank, N.A., as agent, that provides for a revolving credit facility in the aggregate principal amount of $1.5 billion with an option to be increased up to $2.0 billion. The revolving credit facility is available for working capital or other business needs. The maturity date on the Credit Agreement is September 30, 2026.  At January 31, 2025, Autodesk had no outstanding borrowings under the Credit Agreement.  Additionally, as of March 6, 2025, we have no amounts outstanding under the Credit Agreement.  See Part II, Item 8, Note 8, “Borrowing Arrangements,” in the Notes to Consolidated Financial Statements for further discussion on our covenant requirements.  If we are unable to remain in compliance with the covenants under the Credit Agreement, we may not be able to draw on our revolving credit facility.\nAs of January 31, 2025, we had $2.30 billion aggregate principal amount of notes outstanding. See Part II, Item 8, Note 8, “Borrowing Arrangements,” in the Notes to Consolidated Financial Statements for further discussion.\nOur cash and cash equivalents are held by diversified financial institutions globally. Our primary commercial banking relationship is with Citigroup and its global affiliates. In addition, Citibank N.A., an affiliate of Citigroup, is one of the lead lenders and agent in the syndicate of our $1.5 billion revolving credit facility.\n62\nTable of Contents \nOur cash, cash equivalents, and marketable securities balances are concentrated in a few locations around the world, with substantial amounts held outside of the United States. As of January 31, 2025, approximately 66% of our total cash or cash equivalents and marketable securities are located in foreign jurisdictions and that percentage will fluctuate subject to business needs. There are several factors that can impact our ability to utilize foreign cash balances, such as foreign exchange restrictions, foreign regulatory restrictions, or adverse tax costs.  Earnings in foreign jurisdictions are generally available for distribution to the United States with little to no incremental U.S. taxes. We regularly review our capital structure and consider a variety of potential financing alternatives and planning strategies to ensure we have the proper liquidity available in the locations in which it is needed. We expect to meet our liquidity needs through or in combination of current cash balances, ongoing cash flows, and external borrowings. \nCash from operations could also be affected by various risks and uncertainties, including, but not limited to the risks detailed in Part I, Item 1A,“Risk Factors.”  Based on our current business plan and revenue prospects, we believe that our existing cash and cash equivalents, our anticipated cash flows from operations, and our available revolving credit facility will be sufficient to meet our working capital and operating resource expenditure requirements for at least the next 12 months from the date of this Annual Report.\nOur revenue, earnings, cash flows, receivables, and payables are subject to fluctuations due to changes in foreign currency exchange rates, for which we have put in place foreign currency contracts as part of our risk management strategy. See Part II, Item 7A, “Quantitative and Qualitative Disclosures about Market Risk” for further discussion.\nFiscal year ended January 31,\n(in millions)\n2025\n2024\n2023\nNet cash provided by operating activities\n$\n1,607 \n$\n1,313 \n$\n2,071 \nNet cash used in investing activities\n(903)\n(502)\n(143)\nNet cash used in financing activities\n(987)\n(852)\n(1,487)\nNet cash provided by operating activities of $1.61 billion for fiscal 2025, primarily consisted of $1.11 billion of our net income adjusted for $953 million non-cash items such as stock-based compensation expense, amortization of costs to obtain a contract with a customer, depreciation, amortization, and accretion expense, and deferred income tax. Net cash provided by working capital remained flat primarily due to an increase in accounts payable and other accrued liabilities due to the timing of payments related to employee compensation and related costs partially offset by a decrease in deferred revenue driven by the transition of  multi-year subscription contracts billed upfront to annual billing installments, a change in accounts receivable due to the growth in billings and more billings in the fourth fiscal quarter of the current year  as compared to the prior period, and a change in prepaid expenses and other assets.\nNet cash provided by operating activities of $1.31 billion for fiscal 2024, primarily consisted of $906 million of our net income adjusted for $858 million non-cash items such as stock-based compensation expense, amortization of costs to obtain a contract with a customer, depreciation, amortization, and accretion expense, and deferred income tax. The decrease in cash provided by working capital was primarily due to a decrease in deferred revenue of $316 million driven by the transition of multi-year subscription contracts billed upfront to annual billing installments.\nNet cash used in investing activities was $903 million for fiscal 2025 and was primarily due to business combinations, net of cash acquired, and purchases of marketable securities partially offset by sales and maturities of marketable securities.  \nNet cash used in investing activities was $502 million for fiscal 2024 and was primarily due to purchases of marketable securities partially offset by sales and maturities of marketable securities.\nNet cash used in financing activities was $987 million in fiscal 2025 and was primarily due to repurchases of our common stock.\nNet cash used in financing activities was $852 million in fiscal 2024 and was primarily due to repurchases of our common stock.\n63\nTable of Contents \nCONTRACTUAL OBLIGATIONS\nThe following table summarizes our significant financial contractual obligations at January 31, 2025, and the effect such obligations are expected to have on our liquidity and cash flows in future periods.\n(in millions)\nTotal\nFiscal year 2026\nFiscal years 2027-2028\nFiscal years 2029-2030\nThereafter\nManagement Comments\nNotes payable\n$\n2,583 \n$\n361 \n$\n601 \n$\n576 \n$\n1,045 \nNotes payable consist of the notes issued in June 2015, June 2017, January 2020, and October 2021 including interest. See Part II, Item 8, Note 8, “Borrowing Arrangements,” in the Notes to Consolidated Financial Statements for further discussion.\nOperating leases \n295 \n65 \n108 \n68 \n54 \nOperating lease obligations consist primarily of obligations for real estate, vehicles, and certain equipment. See Part II, Item 8, Note 9, “Leases,” in the Notes to Consolidated Financial Statements for further discussion.\nPurchase obligations\n843 \n289 \n422 \n125 \n7 \nPurchase obligations are contractual obligations for purchase of goods or services and are defined as agreements that are enforceable and legally binding to Autodesk and that specify all significant terms, including: fixed or minimum quantities to be purchased; fixed, minimum, or variable price provisions; and the approximate timing of the transaction. Purchase obligations relate primarily to acquisition of cloud services,  marketing and commitments related to our investment agreements with limited liability partnership funds.\nDeferred compensation obligations\n118 \n12 \n22 \n23 \n61 \nDeferred compensation obligations relate to amounts held in a rabbi trust under our non-qualified deferred compensation plan. See Part II, Item 8, Note 7, “Deferred Compensation,” in our Notes to Consolidated Financial Statements for further information regarding this plan.\nPension obligations\n40 \n4 \n7 \n8 \n21 \nPension obligations relate to our obligations for pension plans outside of the United States. See Part II, Item 8, Note 16, “Retirement Benefit Plans,” in our Notes to Consolidated Financial Statements for further information regarding these obligations.\nAsset retirement obligations\n11 \n4 \n3 \n1 \n3 \nAsset retirement obligations represent the estimated costs to bring certain office buildings that we lease back to their original condition after the termination of the lease.\nTotal (1)\n$\n3,890 \n$\n735 \n$\n1,163 \n$\n801 \n$\n1,191 \n____________________ \n(1)\nThis table generally excludes amounts already recorded on the balance sheet as current liabilities, certain purchase obligations as discussed below, long term deferred revenue, and amounts related to income tax accruals for uncertain tax positions, since we cannot predict with reasonable reliability the timing of cash settlements to the respective taxing authorities (see Part II, Item 8, Note 5, “Income Taxes” in the Notes to Consolidated Financial Statements).\nPurchase orders or contracts for the purchase of supplies and other goods and services are not included in the table above. We are not able to determine the aggregate amount of such purchase orders that represent contractual obligations, as purchase orders may represent authorizations to purchase rather than binding agreements. Our purchase orders are based on our current procurement or development needs and are fulfilled by our vendors within short time horizons. We do not have significant agreements for the purchase of supplies or other goods specifying minimum quantities or set prices that exceed our expected requirements for three months. In addition, we have certain software royalty commitments associated with the shipment and licensing of certain products. \nThe expected timing of payment of the obligations discussed above is estimated based on current information. Timing of payments and actual amounts paid may be different depending on the time of receipt of goods or services or changes to agreed-upon amounts for some obligations.\n64\nTable of Contents \nWe provide indemnifications of varying scopes and certain guarantees, including limited product warranties. Historically, costs related to these warranties and indemnifications have not been significant, but because potential future costs are highly variable, we are unable to estimate the maximum potential impact of these guarantees on our future results of operations.\nISSUER PURCHASES OF EQUITY SECURITIES\nOur stock repurchase programs provide us with the ability to offset the dilution from the issuance of stock under our employee stock plans and reduce shares outstanding over time and has the effect of returning excess cash generated from our business to stockholders. Under the share repurchase programs, we may repurchase shares from time to time in open market transactions, privately negotiated transactions, accelerated share repurchase programs, tender offers, or by other means. The share repurchase programs do not have an expiration date and the pace and timing of repurchases will depend on factors such as cash generation from operations, available surplus, the volume of employee stock plan activity, remaining shares available in the authorized pool, cash requirements for acquisitions, economic and market conditions, stock price, and legal and regulatory requirements.\nIn November 2024, our Board of Directors authorized the repurchase of $5 billion of our common stock, in addition to the $3.88 billion remaining under previously announced share repurchase programs.\nDuring the three and 12 months ended January 31, 2025, we repurchased 1 million and 3 million shares of our common stock, respectively. At January 31, 2025, $3.88 billion and $5 billion remained available for repurchase under the November 2022 and November 2024 repurchase programs approved by the Board of Directors. The plans do not have a fixed expiration dat\ne. \n See Part II, Item 8, Note 12, “Stock Repurchase Program,” in the Notes to Consolidated Financial Statements for further discussion.\n65\nTable of Contents",
  "item2": null
}