{
  "source_file": "aep-20241231.htm",
  "form_type": "10-K",
  "item1": "ITEM 1.   BUSINESS\nGENERAL\nOverview and Description of Major Subsidiaries\nAEP was incorporated under the laws of the State of New York in 1906 and reorganized in 1925.  It is a public utility holding company that owns, directly or indirectly, all of the outstanding common stock of its public utility subsidiaries and varying percentages of other subsidiaries.\nThe service areas of AEP’s public utility subsidiaries cover portions of the states of Arkansas, Indiana, Kentucky, Louisiana, Michigan, Ohio, Oklahoma, Tennessee, Texas, Virginia and West Virginia.  Transmission networks are interconnected with extensive distribution facilities in the territories served.  The public utility subsidiaries of AEP have traditionally provided electric service, consisting of generation, transmission and distribution, on an integrated basis to their retail customers.  Restructuring laws in Michigan, Ohio and the ERCOT area of Texas have caused AEP public utility subsidiaries in those states to unbundle previously integrated regulated rates for their retail customers. \nThe member companies of AEP have contractual, financial and other business relationships with the other member companies, such as participation in AEP savings and retirement plans and tax returns, sales of electricity and transportation and handling of fuel.  The member companies of AEP also obtain certain accounting, administrative, information systems, engineering, financial, legal, maintenance and other services at cost from a common provider, AEPSC.\nAs of December 31, 2024, the subsidiaries of AEP had a total of 16,330 employees.  Because it is a holding company rather than an operating company, AEP has no employees.  \nSummary information related to AEP subsidiary operating companies as of December 31, 2024 is shown in the table below:\nAEP Texas\nAEPTCo\nAPCo\nI&M\nKGPCo (a)\nKPCo\nOPCo (b)\nPSO \nSWEPCo\nWPCo\nState of Incorporation\nDelaware, 1925\nDelaware, 2006\nVirginia, 1926\nIndiana, 1907\nVirginia, 1917\nKentucky, 1919\nOhio,\n 1907\nOklahoma, 1913\nDelaware, 1912\nWest Virginia, 1883\nAEP Reportable Segment\nTransmission and Distribution Utilities\nAEP Transmission Holdco\nVertically Integrated Utilities\nVertically Integrated Utilities\nVertically Integrated Utilities\nVertically Integrated Utilities\nTransmission and Distribution Utilities\nVertically Integrated Utilities\nVertically Integrated Utilities\nVertically Integrated Utilities\nRTO Affiliation\nERCOT\n(c)\nPJM\nPJM\nPJM\nPJM\nPJM\nSPP\nSPP\nPJM\nApproximate Number of Retail Customers\n1,122,000\n(c)\n969,000\n617,000\n50,000\n163,000\n1,539,000\n584,000\n555,000\n41,000\nNumber of Employees\n1,598\n(c)\n1,613\n2,069\n47\n279\n1,594\n1,044\n1,314\n229\n(a)\nKGPCo does not own any generating facilities and purchases electric power from APCo for distribution to its customers.\n(b)\nOPCo purchases energy and capacity at auction to serve generation service customers who have not switched to a competitive generation supplier.\n(c)\nAEPTCo is a holding company for the State Transcos.  Five State Transcos are members of PJM and two State Transcos are members of SPP.  Neither AEPTCo nor its subsidiaries have any employees.  Instead, AEPSC and certain AEP utility subsidiaries provide services to these entities.\nService Company Subsidiary\nAEPSC is a service company subsidiary that provides accounting, administrative, information systems, engineering, financial, legal, maintenance and other services at cost to AEP subsidiaries.  The executive officers of AEP and certain of the executive officers of its public utility subsidiaries are employees of AEPSC.  As of December 31, 2024, AEPSC had 6,237 employees.\n1\nPrincipal Industries Served\nThe following table illustrates the principal industries and wholesale electric markets served by AEP’s public utility subsidiaries.\nAEP Texas\nAPCo\nI&M\nKGPCo\nKPCo\nOPCo\nPSO\nSWEPCo\nWPCo\nPrincipal Industries Served:\nPetroleum and Coal Products Manufacturing\nX\nX\nX\nX\nX\nChemical Manufacturing\nX\nX\nX\nX\nX\nX\nX\nX\nOil and Gas Extraction\nX\nX\nX\nX\nPipeline Transportation\nX\nX\nX\nX\nX\nX\nPrimary Metal Manufacturing\nX\nX\nX\nX\nX\nData Processing (a)\nX\nX\nX\nCoal-Mining\nX\nX\nX\nPaper Manufacturing\nX\nX\nX\nX\nTransportation Equipment\nX\nX\nPlastics and Rubber Products\nX\nX\nX\nX\nFabricated Metals Product Manufacturing\nX\nFood Manufacturing\nX\nSupply and Market Electric Power at Wholesale to:\nOther Electric Utility Companies\nX\nX\nX\nX\nX\nX\nRural Electric Cooperatives\nX\nX\nX\nMunicipalities\nX\nX\nX\nX\nX\nOther Market Participants\nX\nX\nX\nX\nX\nX\n(a)\nPrimarily includes data centers and cryptocurrency operations.\nPublic Utility Subsidiaries by Jurisdiction\nThe following table illustrates certain regulatory information with respect to the jurisdictions in which the public utility subsidiaries of AEP operate:\nPrincipal Jurisdiction\nAEP Utility Subsidiaries Operating in that Jurisdiction\nAuthorized Return on Equity (a)\nArkansas\nSWEPCo\n9.50 \n%\nFERC\nAEPTCo - PJM\n10.35 \n%\n(b)\nAEPTCo - SPP\n10.50 \n%\nIndiana\nI&M\n9.85 \n%\nKentucky\nKPCo\n9.75 \n%\nLouisiana\nSWEPCo\n9.50 \n%\nMichigan\nI&M\n9.86 \n%\nOhio\nOPCo\n9.70 \n%\nOklahoma\nPSO\n9.50 \n%\nTennessee\nKGPCo\n9.50 \n%\nTexas\nAEP Texas\n9.76 \n%\nSWEPCo\n9.25 \n%\n(c)\nVirginia\nAPCo\n9.75 \n%\nWest Virginia\nAPCo\n9.75 \n%\n \nWPCo\n9.75 \n%\n(a)\nIdentifies the predominant current authorized ROE, and may not include other, less significant, permitted recovery.  Actual ROE varies from authorized ROE.\n(b)\nIn December 2022, the FERC issued an order removing the 50 basis point RTO incentive from OHTCo transmission formula rates effective February 2022, reducing OHTCo’s authorized ROE to 9.85%.\n(c)\nIn February 2022, as part of the 2020 Texas Base Rate Case, SWEPCo filed a motion for rehearing with the PUCT alleging several errors in the final order, which included a challenge of the approved ROE.  In April 2022, the PUCT denied the motion for rehearing.  In May 2022, SWEPCo filed a petition for review with the Texas District Court seeking a judicial review of the several errors challenged in the PUCT’s final order.  See “2020 Texas Base Rate Case” section of Note 4 for additional information.\n2\nCLASSES OF SERVICE\nAEP and subsidiaries recognize revenues from customers for retail and wholesale electricity sales and electricity transmission and distribution delivery services.  AEP’s subsidiaries within the Vertically Integrated Utilities, Transmission and Distribution Utilities, AEP Transmission Holdco and Generation & Marketing segments derive revenue from the following sources: Retail Revenues, Wholesale and Competitive Retail Revenues, Other Revenues from Contracts with Customers and Alternative Revenues.  For further information relating to the sources of revenue for the Registrants, see Note 20 - Revenues from Contracts with Customers for additional information.\nFINANCING\nGeneral\nAEP subsidiaries generally use short-term debt to finance working capital needs.  Short-term debt may also be used to finance acquisitions, construction and redemption or repurchase of outstanding securities until such needs can be financed with long-term funding.  In recent history, short-term funding needs have been provided for by cash from operations, AEP’s commercial paper program and term loan issuances.  Funds are made available to subsidiaries under the AEP corporate borrowing program.  Certain public utility subsidiaries of AEP also sell accounts receivable to provide liquidity.  Sources of long-term funding include issuance of long-term debt, long-term asset securitizations, leasing agreements, hybrid securities or common stock.  See “Financial Condition” section of Management’s Discussion and Analysis of Financial Condition and Results of Operations for additional information.\nAEP’s revolving credit agreements (which backstop the commercial paper program) include covenants and events of default typical for these types of facilities, including a maximum debt-to-total capitalization test.  In addition, the acceleration of AEP’s payment obligations, or the obligations of certain of its major subsidiaries, prior to maturity under any other agreement or instrument relating to debt outstanding in excess of $100 million, would cause an event of default under the credit agreements.  As of December 31, 2024, AEP was in compliance with its debt covenants.  With the exception of a voluntary bankruptcy or insolvency, any event of default has either or both a cure period or notice requirement before termination of the applicable agreement.  A voluntary bankruptcy or insolvency of AEP or one of its significant subsidiaries would be considered an immediate termination event.  See “Financial Condition” section of Management’s Discussion and Analysis of Financial Condition and Results of Operations for additional information.\nAEP’s subsidiaries have also utilized, and expect to continue to utilize, additional financing arrangements, such as securitization financings and leasing arrangements.\nENVIRONMENTAL AND OTHER MATTERS\nGeneral\nAEP subsidiaries are currently subject to regulation by federal, state and local authorities with regard to air and water-quality control, solid and hazardous waste disposal and other environmental matters, and are subject to zoning and other regulation by local authorities.  The current and proposed environmental laws and regulations discussed below will have an impact on AEP’s operations.  Management continues to monitor developments in these regulations and evaluate the economic feasibility and refine cost estimates for compliance.  AEP is unable to predict changes in regulations, regulatory guidance, legal interpretations, policy positions and implementation actions that may result from the change in Presidential administrations.  For additional information on the laws and regulations discussed below, see “Environmental Issues” section of Management’s Discussion and Analysis of Financial Condition and Results of Operations.\nClean Air Act Requirements (CAA) \nThe CAA establishes a comprehensive program to protect and improve the nation’s air quality and control sources of air emissions.  The states implement and administer many of these programs and could impose additional or more stringent requirements.  The primary regulatory programs that continue to drive investments in AEP’s existing generating units include: (a) periodic revisions to NAAQS and the development of SIPs to achieve more stringent standards, (b) implementation of the regional haze program by the states and the Federal EPA, (c) regulation of hazardous air pollutant emissions under MATS, (d) implementation and review of CSAPR and (e) the Federal EPA’s regulation of GHG emissions from fossil generation under Section 111 of the CAA.\n3\nClean Water Act Requirements\nThe Federal EPA’s ELG rule for generating facilities establishes limits for FGD wastewater, fly ash and bottom ash transport water and flue gas mercury control wastewater, which are to be implemented through each facility’s wastewater discharge permit.  In April 2024, the Federal EPA finalized further revisions to the ELG rule that establish a zero liquid discharge standard for FGD wastewater, bottom ash transport water, and managed combustion residual leachate, as well as more stringent discharge limits for unmanaged combustion residual leachate.  The revised rule provides a new compliance alternative that would eliminate the need to install zero liquid discharge systems for facilities that comply with the 2020 rule’s control technology requirements and commit by December 31, 2025 to retire by 2034.  Management is evaluating the compliance alternatives in the rule, taking into consideration the requirements of the other new rules and their combined impacts to operations.  Several appeals have been filed with various federal courts challenging the 2024 ELG rule.  SWEPCo has also challenged the rule, by filing a joint appeal with a utility trade association in which AEP participates.  The various appeals have been consolidated before the United States Court of Appeals for the Eighth Circuit.  SWEPCo and the utility trade association filed a motion to stay the rule during the litigation.  In October 2024, the court denied the motion.  Management cannot predict the outcome of the litigation.   \nCoal Ash Regulation\nThe Federal EPA’s CCR Rule regulates the disposal and beneficial re-use of CCR, including fly ash and bottom ash created from coal-fired generating units and FGD gypsum generated at some coal-fired plants.  As originally promulgated, the rule applied to active and inactive CCR landfills and surface impoundments at facilities of active electric utility or independent power producers.   \nIn April 2024, the Federal EPA finalized revisions to the CCR Rule to expand the scope of the rule to include inactive impoundments at inactive facilities (“legacy CCR surface impoundments”) as well as to establish requirements for currently exempt solid waste management units that involve the direct placement of CCR on the land (“CCR management units”).  The Federal EPA is requiring that owners and operators of legacy surface impoundments comply with all of the existing CCR Rule requirements applicable to inactive CCR surface impoundments at active facilities, except for the location restrictions and liner design criteria.  The rule establishes compliance deadlines for legacy surface impoundments to meet regulatory requirements, including a requirement to initiate closure within five years after the effective date of the final rule.  The rule requires evaluations to be completed at both active facilities and inactive facilities with one or more legacy surface impoundments.  Closure may be accomplished by applying an impermeable cover system over the CCR material (“closure in place”) or the CCR material may be excavated and placed in a compliant landfill (“closure by removal”).  Groundwater monitoring and other analysis over the next three years will provide additional information on the planned closure method.  AEP evaluated the applicability of the rule to current and former plant sites and recorded incremental ARO of $674 million in the second quarter of 2024 based on initial cost estimates primarily reflecting compliance with the rule through closure in place and future groundwater monitoring requirements pursuant to the revised CCR Rule. \nAs further groundwater monitoring and other analysis is performed, management expects to refine the assumptions and underlying cost estimates used in recording the ARO.  These refinements may include, but are not limited to, changes in the expected method of closure, changes in estimated quantities of CCR at each site, the identification of new CCR management units, among other items.  These future changes could have a material impact on the ARO and materially reduce future net income and cash flows and further impact financial condition.\nClimate Change, CO\n2\n Regulation and Energy Policy\nIn April 2024, the Administrator of the Federal EPA signed new GHG standards and guidelines for new and existing fossil-fuel fired sources.  The rule relies on carbon capture and sequestration and natural gas co-firing as means to reduce CO\n2\n emissions from coal fired plants and carbon capture and sequestration or limited utilization to reduce CO\n2\n emissions from new gas turbines.  The rule also offers early retirement of coal plants in lieu of carbon capture and storage as an alternative means of compliance.   A number of parties filed petitions for review of the rule in the U.S. Court of Appeals for the D.C. Circuit.  AEP is in the early stages of evaluating and identifying the best strategy for complying with this rule while ensuring the adequacy of resources to meet customer needs.  The Federal EPA’s new GHG rule is directed at the fossil-fuel fired electric utility industry and could force AEP to close additional coal-fired generation facilities earlier than their estimated useful life.  If AEP is unable to recover the costs of its investments, it would reduce future net income and cash flows and impact financial condition.  \n4\nOther Environmental Issues and Matters\nThe Comprehensive Environmental Response, Compensation and Liability Act of 1980 imposes costs for environmental remediation upon owners and previous owners of sites, as well as transporters and generators of hazardous material disposed of at such sites.  See “The Comprehensive Environmental Response Compensation and Liability Act (Superfund) and State Remediation” section of Note 6 for additional information.\nElectric Industry Transformation \nThe electric utility industry is in the midst of an historic transformation, driven by large load growth in the commercial customer class from data processing loads, changing customer needs, evolving public policies, stakeholder demands, demographics, competitive offerings, technologies and commodity prices.\n \nAEP is committed to providing reliable affordable power to its customers.\n \nTo achieve this, AEP and its subsidiaries routinely meet with state regulators and key stakeholders to understand their needs for both dispatchable and renewable generation resources.\n \nThis process evaluates, amongst other things, future supply and demand fundamentals, the economic aspects of investments, grid reliability and resilience, regulations and evolving RTO requirements, the advancement of generation technologies, and market impacts and constraints.\n \nAs part of the regulatory process, AEP routinely submits IRPs in various regulatory jurisdictions to address future generation needs.\n \nThe objective of the IRPs is to recommend future generation and capacity resources that provide the most cost-efficient and reliable power to customers.\nAs of December 31, 2024, AEP’s generating capacity included owned and PPA capacity of approximately 23,200 MWs and 5,300 MWs, respectively.  The graph below summarizes AEP’s generating capacity by resource type for the years 1999, 2005 and 2024:\n(a)    Energy Efficiency/Demand Response represents avoided capacity rather than physical assets.\nCorporate Governance\nIn response to environmental issues and in connection with its assessment of AEP’s strategic plan, the Board of Directors continually reviews the risks posed by new environmental rules and requirements that could alter the retirement date of coal-fired generation assets.  The Board of Directors is informed of new environmental regulations and proposed environmental regulations or legislation that would significantly affect AEP.  In addition, the Board holds extended meetings twice a year to provide extra time for a more robust review of the Company’s strategy, including discussions about carbon and carbon risk.  The Board’s Committee on Directors and Corporate Governance oversees AEP’s annual Corporate Sustainability Report, which includes information about AEP’s environmental, social, governance and financial performance.  \n5\nHUMAN CAPITAL MANAGEMENT\nAttracting, developing and retaining high-performing employees with the skills and experience needed to serve our customers efficiently and effectively is crucial to AEP’s growth and competitiveness and is central to our long-term strategy.  AEP invests in employees and continues to build a high performance and inclusive culture that inspires leadership, encourages innovative thinking and welcomes everyone.\nThe following table shows AEP’s number of employees by subsidiary as of December 31, 2024: \nSubsidiary\nNumber of Employees\nAEPSC\n6,237 \nAEP Texas\n1,598 \nAPCo\n1,613 \nI&M\n2,069 \nKGPCo\n47 \nKPCo\n279 \nOPCo\n1,594 \nPSO\n1,044 \nSWEPCo\n1,314 \nWPCo\n229 \nOther (a)\n306 \nTotal AEP\n16,330 \n(a)  Primarily relates to AEP Energy employees.\nOf AEP’s 16,330 employees, less than 1% are Traditionalists (born before 1946), approximately 12% are Baby Boomers (born 1946-1964), approximately 37% are Generation X (born 1965-1980), approximately 42% are Millennials (born 1981-1996) and less than 9% are Generation Z (born after 1996).  As of December 31, 2024, women comprised approximately 20% of AEP’s total workforce, approximately 21% of AEP’s total workforce was represented by racially or ethnically diverse employees and approximately 25% of AEP’s total workforce was represented by labor unions.\nSafety\nSafety is integral to our culture and is one of AEP’s core values.  AEP is dedicated to ensuring the safety of our employees, contractors, customers and the communities we serve.  AEP has policies, procedures, programs, training and initiatives in place to help ensure a safety conscious work environment.  We are committed to fundamentally embed layers of protection in the work we do.  This includes focusing our efforts to prevent serious injuries and fatalities, strengthening pre-job briefing effectiveness, learning from safety incidents, providing appropriate training and education and improving proactive safety initiatives and data analysis to identify and address potential performance gaps.  \nSafety Metric\n2024\n2023\nDART\n0.556\n0.384\nTRIR\n0.913\n0.690\nAEP’s employee Days Away, Restricted and Transferred (DART) rate and Total Recordable Incident Rate (TRIR) increased in 2024.  A DART event is an event that results in one or more lost days, one or more restricted days, or results in an employee transferring to a different job within the company.  The DART rate is a mathematical calculation (number of DART events multiplied by 200,000 and divided by total YTD hours worked) that describes the number of injuries per 100 full-time employees annually.  A recordable event is a work-related event that results in death, days away from work, restricted work or transfer to another job, medical treatment beyond first aid, loss of consciousness or a significant injury or illness diagnosed by a physician or other licensed health care professional.  TRIR is a mathematical calculation (number of recordable events multiplied by 200,000 and divided by total year to date hours worked) that describes the number of incidents per 100 full-time employees annually.  In response to these challenges, AEP is recommitting to fundamental principles of excellence by integrating human performance fundamentals into our operational practices to ensure a safer work environment for all.\n6\nCulture and Inclusion\nAt AEP, we believe in doing the right thing every time for our customers and each other and that culture serves as the foundation for our success.  We recognize that an engaged, collaborative and inclusive workforce helps us better serve our employees, customers, suppliers and other key stakeholders.  AEP views a culture as a core business value that is centered on performance, accountability and developing our employees.  As a strategic priority, our commitment to culture and inclusion is guided by three principles:   \n•\nEnsuring leaders are held accountable for fostering an inclusive environment and culture. \n•\nPromoting an inclusive culture where all employees can thrive.\n•\nSupporting the communities we serve so they will prosper.\nAEP’s culture and inclusion progress is measured through our annual Employee Voice Survey.  The Employee Voice Survey is an opportunity for employees to provide feedback about their experience at AEP.  It also serves as a means for the company to understand how we can foster a workplace focused on performance, accountability, efficiency, and customer orientation.  2024 marks our eleventh consecutive year of formally surveying employees about their experience at AEP.\nTraining and Professional Development\nAttracting, developing, and retaining high-performing employees with the skills and experience needed to serve our customers efficiently and effectively is crucial to AEP’s growth and long-term strategy.  At AEP, we are preparing our workforce for the future by providing opportunities to learn new skills and engaging higher education institutions to better prepare the next generation of workers.  AEP offers co-op and internship programs in partnership with high schools, technical/vocational schools and colleges across our 11-state service territory.  AEP also provides a broad range of training and assistance that supports lifelong learning and development.  This includes operational skills training, professional training, leadership development, educational assistance, ongoing performance coaching, and other forms of training that offer developmental pathways for employees.  \nCompensation and Benefits\nAEP is committed to the well-being of our employees, and we offer programs to foster employee financial security, physical and emotional health, and social connectedness.  We provide market-competitive compensation and benefits, including medical and dental coverage, life insurance, and well-being programs that support our employees and their families.  Nearly all AEP employees participate in an annual incentive program that rewards individual performance and achievement of business goals, fostering a high-performance culture.  AEP also offers paid time off in the form of vacation, holidays, sick time, and parental leave.  \n7\nBUSINESS SEGMENTS\nAEP’s Reportable Segments\nAEP’s primary business is the generation, transmission and distribution of electricity.  Within its Vertically Integrated Utilities segment, AEP centrally dispatches generation assets and manages its overall utility operations on an integrated basis because of the substantial impact of cost-based rates and regulatory oversight applicable to each public utility subsidiary.  Intersegment sales and transfers are generally based on underlying contractual arrangements and agreements.  AEP’s reportable segments are as follows:\n•\nVertically Integrated Utilities\n•\nTransmission and Distribution Utilities\n•\nAEP Transmission Holdco\n•\nGeneration & Marketing\nThe remainder of AEP’s activities is presented as Corporate and Other, which is not considered a reportable segment.  See Note 9 - Business Segments for additional information on AEP’s segments.\nSeasonality\nThe consumption and delivery of electric power is generally seasonal which impacts the results of operations of AEP’s reportable segments.  In many parts of the country, demand for power peaks during the hot summer months, with market prices also peaking at that time.  In other areas, power demand peaks during the winter.  The pattern of this fluctuation may change due to the nature and location of AEP’s facilities and the terms of power sale contracts into which AEP enters.  In addition, AEP has historically sold and delivered less power, and consequently earned less income, when weather conditions are milder.  Unusually mild weather in the future could diminish AEP’s results of operations.  Conversely, unusually extreme weather conditions could increase AEP’s results of operations.\nVERTICALLY INTEGRATED UTILITIES\nGENERAL\nAEP’s vertically integrated utility operations are engaged in the generation, transmission and distribution of electricity for sale to retail and wholesale customers through assets owned and operated by AEGCo, APCo, I&M, KGPCo, KPCo, PSO, SWEPCo and WPCo.  AEPSC, as agent for AEP’s public utility subsidiaries, performs marketing, generation dispatch, fuel procurement and power-related risk management and trading activities on behalf of each of these subsidiaries.\nELECTRIC GENERATION\nFacilities\nAs of December 31, 2024, AEP’s vertically integrated public utility subsidiaries owned approximately 23,200 MWs of generation.  See Item 2 – Properties for more information regarding the generation capacity of vertically integrated public utility subsidiaries.\nFuel Supply \nThe following table shows the owned and leased generation sources by type (including wind purchase agreements), on an actual net generation (MWhs) basis, used by the Vertically Integrated Utilities:\n \n2024\n2023\n2022\nCoal and Lignite\n40%\n37%\n43%\nNuclear\n22%\n22%\n21%\nNatural Gas\n22%\n22%\n19%\nRenewables\n16%\n19%\n17%\n8\nAn increase/decrease in one or more generation types relative to previous years reflects changes in resource mix and price changes in one or more fuel commodity sources relative to the pricing of other fuel commodity sources.  AEP’s overall 2024 fossil fuel costs for the Vertically Integrated Utilities increased 3.2% on a dollar per MMBtu basis from 2023.\nCoal and Lignite\nAEP’s Vertically Integrated Utilities procure coal under a combination of purchasing arrangements, including long-term contracts, and spot agreements with various producers and marketers.  Coal consumption increased 12.7% in 2024 from 2023.\nManagement projects that the Vertically Integrated Utilities will be able to secure and transport coal of adequate quality and quantities to operate their coal fired units.  As of December 31, 2024, through subsidiaries, AEP owns, leases or controls 2,934 railcars, 296 barges, 4 towboats and a coal handling terminal with approximately 18 million tons of annual capacity to move and store coal for use in AEP generating facilities.  AEP will procure additional railcar and barge/towboat capacity as needed based on demand.\n \nAlthough coal prices remained stable for all of 2024 the market price for coal is greater than historical prices (excluding 2021 and 2022), due to the higher cost incurred by the suppliers to mine coal over the last few years.  Coal prices may see a fluctuation in the next few years as utilities begin to reenter the market as high inventories decline and as forecasted demand for electricity increases.  AEP’s strategy for purchasing coal includes maintaining a target inventory level by layering in supplies over time to help with reducing price volatility.  The price paid for coal delivered in 2024 decreased approximately 3.5% from 2023 mainly due to the completion of higher priced coal supply agreements that were agreed to in 2021 and 2022 when coal market pricing was stronger.  The decrease in the delivered cost of coal should continue into 2025 as some higher priced agreements ended in 2024.  With AEP’s strategy of layering tons into the coal portfolio the prices over the next few years will continue to fluctuate with the coal market.\nThe following table shows the amount of coal and lignite delivered to the Vertically Integrated Utilities’ plants during the past three years and the average delivered price of coal and lignite purchased by the Vertically Integrated Utilities:\n \n2024\n2023\n2022\nTotal coal and lignite delivered to the plants (in millions of tons)\n16.5\n20.9\n20.4 \nAverage cost per ton of coal and lignite delivered\n$\n62.05 \n$\n64.31 \n$\n56.16 \nThe coal supplies at the Vertically Integrated Utilities plants vary from time to time depending on various factors, including, but not limited to, consumption rates driven by the demand for electric power, unit outages, transportation limitations or delays, space limitations, labor issues, supplier outages and issues and weather conditions, all of which may impact production, consumption or deliveries.  As of December 31, 2024 and 2023, the Vertically Integrated Utilities’ coal inventory was approximately 71 days and 82 days of full load burn, respectively.  Inventory levels remained high in 2024 due to mild weather conditions and continued low natural gas prices.  Management expects inventory levels to remain elevated in 2025 due to many of these same factors.  While inventory targets vary by plant and are changed as necessary, the current coal inventory target for the Vertically Integrated Utilities is approximately 35 days of full load burn.  \nNatural Gas\nThe Vertically Integrated Utilities consumed approximately 155 billion cubic feet of natural gas during 2024 for generating power.  This represents an increase of 6.7% from 2023.  Several of AEP’s natural gas-fired units are connected to at least two pipelines, which allows greater access to competitive supplies and improves delivery reliability.  From a natural gas supply perspective, the Vertically Integrated Utilities secure forward month, fixed price baseload supply, prompt month baseload supply, and pursue daily spot market purchases or sales (to balance daily positions).  From a natural gas transportation perspective, the Vertically Integrated Utilities utilize firm and interruptible transportation capacity.  Furthermore, SWEPCo and PSO utilize firm natural gas storage, which supports price stability and provides additional surety of natural gas supply.  AEP’s natural gas supply, transportation and storage transactions are competitively bid and are based on applicable market prices.\nThe following table shows the amount of natural gas delivered to the Vertically Integrated Utilities’ plants during the past three years and the average delivered price of natural gas purchased by the Vertically Integrated Utilities:\n \n2024\n2023\n2022\nTotal natural gas delivered to the plants (in billions cubic feet)\n155.0 \n146.0 \n126.0 \nAverage delivered price per MMBtu of purchased natural gas\n$\n3.05 \n$\n2.69 \n$\n6.94 \n9\nNuclear\nI&M has made commitments to meet the current nuclear fuel requirements of the Cook Plant.  I&M has made and will make purchases of uranium in various forms in the spot, short-term, mid-term and long-term markets.  \nFor purposes of the storage of high-level radioactive waste in the form of SNF, I&M completed modifications to its SNF storage pool in the early 1990’s.  I&M entered into an agreement to provide for onsite dry cask storage of SNF to permit normal operations to continue.  I&M is scheduled to conduct further dry cask loading and storage projects on an ongoing periodic basis.  The year of expiration of each NRC Operating License is 2034 for Unit 1 and 2037 for Unit 2.  Management has started the application process for license extensions for both units that would extend Unit 1 and Unit 2 to 2054 and 2057, respectively.  \nNuclear Waste and Decommissioning\nAs the owner of the Cook Plant, I&M has a significant future financial commitment to dispose of SNF and decommission and decontaminate the plant safely.  The cost to decommission a nuclear plant is affected by NRC regulations and the SNF disposal program.  The most recent decommissioning cost study was completed in 2024.  According to that study, stated in 2024 undiscounted dollars, the estimated cost of decommissioning and disposal of low-level radioactive waste was $2.4 billion, with additional ongoing costs of $7 million per year for post decommissioning storage of SNF and an eventual cost of $45 million for the subsequent decommissioning of the SNF storage facility.  As of December 31, 2024 and 2023, the total decommissioning trust fund balance for the Cook Plant was approximately $4 billion and $3.5 billion, respectively.  The balance of funds available to eventually decommission Cook Plant will differ based on contributions and investment returns.  The ultimate cost of retiring the Cook Plant may be materially different from estimates and funding targets as a result of the:\n•\nEscalation of various cost elements (including, but not limited to, general inflation and the cost of energy).\n•\nFurther development of regulatory requirements governing decommissioning.\n•\nTechnology available at the time of decommissioning differing significantly from that assumed in studies.\n•\nAvailability of nuclear waste disposal facilities.\n•\nAvailability of a United States Department of Energy facility for permanent storage of SNF.\nAccordingly, management is unable to provide assurance that the ultimate cost of decommissioning the Cook Plant will not be significantly different than current projections.  AEP will seek recovery from customers through regulated rates if actual decommissioning costs exceed projections.  See the “Nuclear Contingencies” section of Note 6 - Commitments, Guarantees and Contingencies for additional information with respect to nuclear waste and decommissioning.\nLow-Level Radioactive Waste\nThe Low-Level Waste Policy Act of 1980 mandates that the responsibility for the disposal of low-level radioactive waste rests with the individual states.  Low-level radioactive waste consists largely of ordinary refuse and other items that have come in contact with radioactive materials.  Michigan does not currently have a disposal site for such waste available.  I&M cannot predict when such a site may be available.  However, the states of Utah and Texas have licensed low-level radioactive waste disposal sites which currently accept low-level radioactive waste from Michigan waste generators.  There is currently no set date limiting I&M’s access to either of these facilities.  The Cook Plant has a facility onsite designed specifically for the storage of low-level radioactive waste.  In the event that low-level radioactive waste disposal facility access becomes unavailable, it can be stored onsite at this facility.\nCounterparty Risk Management\nThe Vertically Integrated Utilities segment also sells power and enters into related energy transactions with wholesale customers and other market participants.  As a result, counterparties and exchanges may require cash or cash related instruments to be deposited on transactions as margin against open positions.  As of December 31, 2024, counterparties posted approximately $16 million in cash, cash equivalents or letters of credit with AEPSC for the benefit of AEP’s public utility subsidiaries (while, as of that date, AEP’s public utility subsidiaries posted approximately\n \n$201 million with counterparties and exchanges).  Since open trading contracts are valued based on market prices of various commodities, exposures change daily.  See the “Quantitative and Qualitative Disclosures About Market Risk” section of Management’s Discussion and Analysis of Financial Condition and Results of Operations for additional information.\n10\nCertain Power Agreements \nI&M \nA UPA between AEGCo and I&M (the I&M Power Agreement) provides for the sale by AEGCo to I&M of all the energy and capacity available to AEGCo at the Rockport Plant unless it is sold to another utility.  I&M is obligated, whether or not power is available from AEGCo, to pay as a demand charge for the right to receive such power (and as an energy charge for any associated energy taken by I&M) net of amounts received by AEGCo from any other sources, sufficient to enable AEGCo to pay all of its operating and other expenses, including a rate of return on the common equity of AEGCo as approved by the FERC.  The UPA will continue in effect until the debt obligations of AEGCo secured by the Rockport Plant have been satisfied and discharged (currently expected to be December 2028).  \nIn April 2021, AEGCo and I&M executed an agreement to purchase 100% of the interests in Rockport Plant, Unit 2 effective at the end of the lease term on December 7, 2022.  Prior to the termination of the lease, I&M assigned 30% of the power to KPCo.  Beginning December 8, 2022, AEGCo billed 100% of its share of the Rockport Plant to I&M and ceased billing to KPCo.  KPCo reached an agreement with I&M, from the end of the lease through May 2023, to buy capacity from Rockport Plant, Unit 2 through the PCA at a rate equal to PJM’s RPM clearing price.  See the “Unit Power Agreements” section of Note 17 - Related Party Transactions for additional information.\nOVEC\nAEP and several nonaffiliated utility companies jointly own OVEC.  The aggregate equity participation of AEP in OVEC is 43.47%.  Parent owns 39.17% and OPCo owns 4.3%.  Under the Inter-Company Power Agreement (ICPA), which defines the rights of the owners and sets the power participation ratio of each, the sponsoring companies are entitled to receive and are obligated to pay for all OVEC capacity (approximately 2,400 MWs) in proportion to their respective power participation ratios.  The aggregate power participation ratio of APCo, I&M and OPCo is 43.47%.  The ICPA terminates in June 2040.  The proceeds from charges by OVEC to sponsoring companies under the ICPA based on their power participation ratios are designed to be sufficient for OVEC to meet its operating expenses and fixed costs.  OVEC’s Board of Directors, as elected by AEP and nonaffiliated owners, has authorized environmental investments related to their ownership interests, with resulting expenses (including for related debt and interest thereon) included in charges under the ICPA.  OVEC financed capital expenditures in excess of $1 billion in connection with flue gas desulfurization projects and the associated scrubber waste disposal landfills at its two generation plants through debt issuances, including tax-advantaged debt issuances.  Both OVEC generation plants are operating with the environmental controls in-service.  See Note 18 - Variable Interest Entities and Equity Method Investments for additional information.\nELECTRIC DELIVERY\nGeneral\nOther than AEGCo, AEP’s vertically integrated public utility subsidiaries own and operate transmission and distribution lines and other facilities to deliver electric power.  See Item 2 – Properties for more information regarding the transmission and distribution lines.  Most of the transmission and distribution services are sold to retail customers of AEP’s vertically integrated public utility subsidiaries in their service territories.  These sales are made at rates approved by the state utility commissions of the states in which they operate, and in some instances, approved by the FERC.  The FERC regulates and approves the rates for both wholesale transmission transactions and wholesale generation contracts.  The use and the recovery of costs associated with the transmission assets of the AEP vertically integrated public utility subsidiaries are subject to the rules, principles, protocols and agreements in place with PJM and SPP, and as approved by the FERC.  See Item 1. Business – Vertically Integrated Utilities – Regulation – FERC.  As discussed below, some transmission services also are separately sold to nonaffiliated companies.\nOther than AEGCo, AEP’s vertically integrated public utility subsidiaries hold franchises or other rights to provide electric service in various municipalities and regions in their service areas.  In some cases, these franchises provide the utility with the exclusive right to provide electric service within a specific territory.  These franchises have varying provisions and expiration dates.  In general, the operating companies consider their franchises to be adequate for the conduct of their business. \n11\nTransmission Agreement\nAPCo, I&M, KGPCo, KPCo and WPCo own and operate transmission facilities that are used to provide transmission service under the PJM OATT and are parties to the TA.  OPCo, which is a subsidiary in AEP’s Transmission and Distribution Utilities segment that provides transmission service under the PJM OATT, is also a party to the TA.  The TA defines how the parties to the agreement share the revenues associated with their transmission facilities and the costs of transmission service provided by PJM.  The TA has been approved by the FERC.\nTransmission Coordination Agreement and Open Access Transmission Tariff \nPSO, SWEPCo and AEPSC are parties to the TCA.  Under the TCA, a coordinating committee is charged with the responsibility of: (a) overseeing the coordinated planning of the transmission facilities of the parties to the agreement, including the performance of transmission planning studies, (b) the interaction of such subsidiaries with independent system operators and other regional bodies interested in transmission planning and (c) compliance with the terms of the AEP and SPP OATTs filed with the FERC and the rules of the FERC relating to such tariffs.  Pursuant to the TCA, PSO, SWEPCo and AEPSC each have responsibility for monitoring and reporting situations or problems that materially affect the reliability of PSO’s and SWEPCo’s transmission systems.  The TCA also provides for the allocation among the parties of revenues collected for transmission and ancillary services as determined by the FERC-approved OATT for the SPP.\nRegional Transmission Organizations\nAEGCo, APCo, I&M, KGPCo, KPCo and WPCo are members of PJM, and PSO and SWEPCo are members of SPP (both FERC-approved RTOs).  RTOs operate, plan and control utility transmission assets in a manner designed to provide open access to such assets in a way that prevents discrimination between participants owning transmission assets and those that do not.\nREGULATION\nGeneral\nAEP’s vertically integrated public utility subsidiaries’ retail rates and certain other matters are subject to traditional cost-based regulation by the state utility commissions.  AEP’s vertically integrated public utility subsidiaries are also subject to regulation by the FERC under the Federal Power Act with respect to wholesale power and transmission service transactions.  I&M is subject to regulation by the NRC under the Atomic Energy Act of 1954, as amended, with respect to the operation of the Cook Plant.  AEP and its vertically integrated public utility subsidiaries are also subject to the regulatory provisions of, much of the Energy Policy Act of 2005, which is administered by the FERC.\nRates\nHistorically, state utility commissions have established electric service rates on a cost-of-service basis, which is designed to allow a utility an opportunity to recover its cost of providing service and to earn a reasonable return on its investment used in providing that service.  A utility’s cost of service generally reflects its operating expenses, including operation and maintenance expense, depreciation expense and taxes.  State utility commissions periodically adjust rates pursuant to a review of: (a) a utility’s adjusted revenues and expenses during a defined test period and (b) such utility’s level of investment.  Absent a legal limitation, such as a law limiting the frequency of rate changes or capping rates for a period of time, a state utility commission can review and change rates on its own initiative.  Some states may initiate reviews at the request of a utility, customer, governmental or other representative of a group of customers.  Such parties may, however, agree with one another not to request reviews of or changes to rates for a specified period of time.\nPublic utilities have traditionally financed capital investments until the new asset is placed in-service.  Provided the asset was found to be a prudent investment, it was then added to rate base and entitled to a return through rate recovery.  Given long lead times in construction, the high costs of plant and equipment and volatile capital markets, management actively pursues strategies to accelerate rate recognition of investments and cash flow.  AEP representatives continue to engage state commissioners and legislators on alternative rate-making options to reduce regulatory lag and enhance certainty in the process.  These options include pre-approvals, a return on construction work in progress, rider/trackers, formula rates and the inclusion of future test-year projections into rates.\n12\nThe rates of AEP’s vertically integrated public utility subsidiaries are generally based on the cost of providing traditional bundled electric service (i.e., generation, transmission and distribution service).  Historically, the state regulatory frameworks in the service area of the AEP vertically integrated public utility subsidiaries reflected specified fuel costs as part of bundled (or, more recently, unbundled) rates or incorporated fuel adjustment clauses in a utility’s rates and tariffs.  Fuel adjustment clauses permit periodic adjustments to fuel cost recovery from customers and therefore provide protection against exposure to fuel cost changes.\nThe following state-by-state analysis summarizes the regulatory environment of certain major jurisdictions in which AEP’s vertically integrated public utility subsidiaries operate.  Several public utility subsidiaries operate in more than one jurisdiction.  See Note 4 - Rate Matters for more information regarding pending rate matters. \nArkansas\nSWEPCo provides retail electric service in Arkansas at bundled rates approved by the APSC, with rates set on a historical cost-of-service basis and formula rates.  Arkansas provides for timely fuel and purchased power cost recovery through respective annual fuel and purchased power recovery mechanisms.\nIndiana\nI&M provides retail electric service in Indiana at fully bundled rates approved by the IURC, with rates set on a forecasted cost-of-service basis.  Indiana generally allows for timely recovery of fuel expenses through a fuel recovery surcharge mechanism.  I&M is subject to a semi-annual Indiana jurisdictional earnings test.\nKentucky\nKPCo provides retail electric service in Kentucky at bundled rates approved by the KPSC, with rates currently set on a historical cost-of-service basis.  Kentucky generally allows for timely recovery of fuel expenses through a fuel recovery surcharge mechanism.\nLouisiana\nSWEPCo provides retail electric service in Louisiana at bundled rates approved by the LPSC with rates set on a historical cost-of-service basis and formula rates.  Louisiana provides for timely fuel and purchased power cost recovery through respective fuel and purchased power recovery mechanisms updated monthly.\nMichigan\nI&M provides retail electric service in Michigan at both unbundled standard service and open access distribution service rates approved by the MPSC, with rates set on a forecasted cost-of-service basis.  Open access distribution service is limited to 10% of I&M’s retail load.  Michigan generally allows for timely recovery of fuel expenses, transmission expenses and purchased power expenses through a single surcharge mechanism.\nOklahoma\nPSO provides retail electric service in Oklahoma at bundled rates approved by the OCC.  PSO’s rates are set on a historical cost-of-service basis.  Fuel and purchased energy costs are recovered through a fuel adjustment clause.\nTennessee\nKGPCo currently provides retail electric service in Tennessee at bundled rates approved by the TPUC.  Tennessee generally allows for timely recovery of fuel expenses and purchased power expenses through a surcharge mechanism.\nTexas\nSWEPCo provides retail electric service in Texas at bundled rates approved by the PUCT with rates set on a historical cost-of-service basis.  Texas generally provides for timely fuel and purchased power cost recovery through respective fuel and purchased power recovery mechanisms.\n13\nVirginia\nAPCo currently provides retail electric service in Virginia at unbundled generation and distribution rates approved by the Virginia SCC.  Virginia generally allows for timely recovery of fuel expenses through a fuel cost recovery surcharge mechanism.  In addition to base rates and fuel cost recovery, APCo is permitted to recover transmission expenses provided at  OATT rates based on rates established by the FERC.  APCo is subject to a biennial Virginia retail generation and distribution earnings test.\nWest Virginia\nAPCo and WPCo provide retail electric service at bundled rates approved by the WVPSC with rates set on a combined APCo and WPCo cost-of-service basis.  West Virginia generally allows for timely recovery of fuel expenses, purchased power expenses and transmission expenses through a single surcharge mechanism.  \nFERC\nThe FERC regulates rates for interstate power sales at wholesale, transmission of electric power, accounting and other matters, including construction and operation of hydroelectric projects.  The FERC regulations require AEP’s vertically integrated public utility subsidiaries to provide open access transmission service at FERC-approved rates, and AEP has approved cost-based formula transmission rates on file at the FERC.  The FERC also regulates unbundled transmission service to retail customers.  In addition, the FERC regulates the sale of power for resale in interstate commerce by: (a) approving contracts for wholesale sales to municipal and cooperative utilities at cost-based rates and (b) granting authority to public utilities to sell power at wholesale at market-based rates upon a showing that the seller lacks the ability to improperly influence market prices.  AEP’s vertically integrated public utility subsidiaries have market-based rate authority from the FERC, under which much of their wholesale marketing activity takes place.  The FERC requires each public utility that owns or controls interstate transmission facilities, directly or through an RTO, to file an open access network and point-to-point transmission tariff that offers services comparable to the utility’s own uses of its transmission system.  The FERC also requires all transmitting utilities, directly or through an RTO, to establish an Open Access Same-time Information System, which electronically posts transmission information such as available capacity and prices, and requires utilities to comply with Standards of Conduct that prohibit utilities’ transmission employees from providing non-public transmission information to the utility’s marketing employees.  Additionally, the vertically integrated public utility subsidiaries are subject to mandatory reliability standards promulgated by the NERC, with the approval of the FERC, which standards protect the nation’s bulk power system against potential disruptions from cyber and physical security breaches.\nThe FERC oversees RTOs, entities created to operate, plan and control utility transmission assets.  AEGCo, APCo, I&M, KGPCo, KPCo and WPCo are members of PJM.  PSO and SWEPCo are members of SPP.\nThe FERC has jurisdiction over certain issuances of securities of most of AEP’s public utility subsidiaries, the acquisition of securities of utilities, the acquisition or sale of certain utility assets and mergers with another electric utility or holding company.  In addition, both the FERC and state regulators are permitted to review the books and records of any company within a holding company system.\nCOMPETITION\nAEP’s vertically integrated public utility subsidiaries primarily generate, transmit and distribute electricity to retail customers of AEP’s vertically integrated public utility subsidiaries in their service territories.  These sales are made at rates approved by the state utility commissions of the states in which they operate, and in some instances, approved by the FERC, and are not subject to competition from other vertically integrated public utilities.  Other than AEGCo, AEP’s vertically integrated public utility subsidiaries hold franchises or other rights that effectively grant the exclusive ability to provide electric service in various municipalities and regions in their service areas.  \nAEP’s vertically integrated public utility subsidiaries compete with self-generation and with distributors of other energy sources, such as natural gas, fuel oil, renewables and coal, within their service areas.  The primary factors in such competition are price, reliability of service and the capability of customers to utilize alternative sources of energy other than electric power.  With respect to competing generators and self-generation, the public utility subsidiaries of AEP believe that they currently maintain a competitive position. \n14\nTRANSMISSION AND DISTRIBUTION UTILITIES\nGENERAL\nThis segment consists of the transmission and distribution of electricity for sale to retail and wholesale customers through assets owned and operated by AEP Texas and OPCo.  \nAEP’s transmission and distribution utility subsidiaries own and operate transmission and distribution lines and other facilities to deliver electric power.  See Item 2 – Properties, for more information regarding the transmission and distribution lines.  Transmission and distribution services are sold to retail customers of AEP’s transmission and distribution utility subsidiaries in their service territories.  These sales are made at rates approved by the PUCT for AEP Texas and by the PUCO and the FERC for OPCo.  The FERC regulates and approves the rates for wholesale transmission transactions.  As discussed below, some transmission services also are separately sold to nonaffiliated companies.\nAEP’s transmission and distribution utility subsidiaries hold franchises or other rights to provide electric service in various municipalities and regions in their service areas.  In some cases, these franchises provide the utility with the exclusive right to provide electric service.  These franchises have varying provisions and expiration dates.  In general, the operating companies consider their franchises to be adequate for the conduct of their business.\nThe use and the recovery of costs associated with the transmission assets of the AEP transmission and distribution utility subsidiaries are subject to the rules, protocols and agreements in place with PJM and ERCOT, and as approved by the FERC.  In addition to providing transmission services in connection with power sales in their service areas, AEP’s transmission and distribution utility subsidiaries also provide transmission services for nonaffiliated companies through RTOs.\nTransmission Agreement\nOPCo owns and operates transmission facilities that are used to provide transmission service under the PJM OATT; OPCo is a party to the TA with other utility subsidiary affiliates.  The TA defines how the parties to the agreement share the revenues associated with their transmission facilities and the costs of transmission service provided by PJM.  The TA has been approved by the FERC.\nRegional Transmission Organizations \nOPCo is a member of PJM, a FERC-approved RTO.  RTOs operate, plan and control utility transmission assets to provide open access to such assets in a way that prevents discrimination between participants owning transmission assets and those that do not.  AEP Texas is a member of ERCOT.\nREGULATION\nOPCo provides distribution and transmission services to retail customers within its service territory at cost-based rates approved by the PUCO or by the FERC.  AEP Texas sets its rates through a combination of base rate cases and interim Transmission Cost of Services (TCOS) and Distribution Cost Recovery Factor (DCRF) filings.  AEP Texas may file interim TCOS and DCRF filings semi-annually to update its rates to reflect changes in its net invested capital.  Transmission and distribution rates are established on a cost-of-service basis, which is designed to allow a utility an opportunity to recover its cost of providing service and to earn a reasonable return on its investment used in providing that service.  The cost-of-service generally reflects operating expenses, including operation and maintenance expense, depreciation expense and taxes.  Utility commissions periodically adjust rates pursuant to a review of: (a) a utility’s adjusted revenues and expenses during a defined test period and (b) such utility’s level of investment.\nFERC\nThe FERC regulates rates for transmission of electric power, accounting and other matters.  The FERC regulations require AEP to provide open access transmission service at FERC-approved rates, and it has approved cost-based formula transmission rates on file at the FERC.  The FERC also regulates unbundled transmission service to retail customers.  The FERC requires each public utility that owns or controls interstate transmission facilities to, directly or through an RTO, file an open access network and point-to-point transmission tariff that offers services comparable to the utility’s own uses of its transmission system.  The FERC also requires all transmitting utilities, directly or through an RTO, to establish an Open Access Same-time Information System, which electronically posts transmission information such as available capacity and prices, and requires utilities to comply with Standards of Conduct that prohibit utilities’ transmission employees from providing non-public transmission information to the utility’s marketing employees.  In addition, both the FERC and state regulators are permitted to review the \n15\nbooks and records of any company within a holding company system.  Additionally, the transmission and distribution utility subsidiaries are subject to mandatory reliability standards as set forth by the NERC, with the approval of the FERC, which standards protect the nation’s bulk power system against potential disruptions from cyber and physical security breaches.\nAEP TRANSMISSION HOLDCO\nGENERAL\nAEPTHCo is a holding company for (a) AEPTCo, which is the direct holding company for the State Transcos and (b) AEP’s Transmission Joint Ventures.\nAEPTCo\nAEPTCo wholly owns the State Transcos which are independent of, but respectively overlay, the following AEP electric utility operating companies: APCo, I&M, KPCo, OPCo, PSO, SWEPCo and WPCo.  The State Transcos develop, own, operate and maintain their respective transmission assets.  Individual State Transcos (a) have obtained the approvals necessary to operate in Indiana, Kentucky, Michigan, Ohio, Oklahoma and West Virginia, subject to any applicable siting requirements, (b) are authorized to submit projects for commission approval in Virginia and (c) have been granted consent to enter into a joint license agreement that will support investment in Tennessee.  Assets of the State Transcos interconnect to transmission facilities owned by the aforementioned operating companies and nonaffiliated transmission owners within the footprints of PJM, MISO and SPP.  APTCo, IMTCo, KTCo, OHTCo and WVTCo are located within PJM.  IMTCo also owns portions of the Greentown station assets located in MISO.  OKTCo and SWTCo are located within SPP.  SWTCo does not currently own or operate transmission assets. \nThe State Transcos own, operate, maintain and invest in transmission infrastructure in order to maintain and enhance system integrity and grid reliability, grid security, safety, reduce transmission constraints and facilitate interconnections of new generating resources and new wholesale customers, as well as enhance competitive wholesale electricity markets.  A key part of AEP’s business is replacing and upgrading transmission facilities, assets and components of the existing AEP System as needed to maintain reliability.  As of December 31, 2024, the State Transcos had $15.4 billion of transmission and other assets in-service, excluding CWIP, with plans to construct approximately $4.7 billion of additional transmission assets through 2027.  \nIn January 2025, AEP announced a partnership between nonaffiliated entities to acquire a 19.9% noncontrolling interest in OHTCo and IMTCo for $2.82 billion.  The transaction is subject to FERC approval and clearance from the Committee on Foreign Investment in the United States.  See “Noncontrolling Interest in OHTCo and IMTCo”\n \nsection of Note 21 for additional information.\n16\nAEPTHCO JOINT VENTURE INITIATIVES\nAEP has established joint ventures with nonaffiliated electric utility companies for the purpose of developing, building and owning transmission assets that seek to improve reliability and market efficiency and provide transmission access to remote generation sources in North America (Transmission Joint Ventures).  The Transmission Joint Ventures currently include:\nJoint Venture Name\nLocation\nProjected or Actual Completion Date\nOwners\n (Ownership %)\nTotal Estimated/Actual Project Costs at Completion\nApproved Return on Equity\n \n(in millions)\nETT\nTexas\n(a)\nBHE (50%)\n$\n5,000.0 \n(a)\n9.6 \n%\n \n(ERCOT) \n \nAEP (50%) \n \n \n \nPrairie Wind\nKansas\n2014\nEvergy, Inc. (50%) \n158.0 \n12.8 \n%\nBHE (25%)\n \n \nAEP (25%)  \n \n \n \n \nPioneer\nIndiana\n2018\nJohn Lainge (50%) \n191.0 \n10.48 \n%\n(b)\n \n \n \n \nAEP (50%) \n \n \n \n \nTransource\nMissouri\n2016\nEvergy, Inc. (13.5%) (d)\n310.1 \n11.1 \n%\n(c)\nMissouri\n \n \n \nAEP (86.5%) (d) \n \n \n \n \nTransource\nWest\n2019\nEvergy, Inc. (13.5%) (d)\n84.3 \n10.5 \n%\nWest Virginia\nVirginia\nAEP (86.5%) (d) \nTransource\nMaryland\n(e)\nEvergy, Inc. (13.5%) (d)\n27.6 \n(e)\n10.4 \n%\nMaryland\nAEP (86.5%) (d)\nTransource\nPennsylvania\n(e)\nEvergy, Inc. (13.5%) (d)\n243.6 \n(e)\n10.4 \n%\nPennsylvania\nAEP (86.5%) (d)\nTransource\nOklahoma\n2025\nEvergy, Inc. (13.5%) (d)\n131.2\n(f)\n10.3 \n%\nOklahoma\nAEP (86.5%) (d)\nTransource\nPennsylvania\n2027\nEvergy, Inc. (13.5%) (d)\n148.1 \n(g)\n10.4 \n%\nPennsylvania\nAEP (86.5%) (d)\n(a)\nETT is undertaking multiple projects and the completion dates will vary for those projects.  ETT’s investment in completed and active projects in ERCOT is expected to be $5.0 billion by 2030.  Future projects will be evaluated on a case-by-case basis.\n(b)\nIn May 2020, Pioneer received FERC approval authorizing an ROE of 10.02% (10.52% inclusive of the RTO incentive adder of 0.5%).  In October 2024, the FERC issued an order reducing the base ROE for MISO Transmission Owners to 9.98% (10.48% inclusive of the RTO incentive adder of 0.5%).\n(c)\nThe ROE represents the weighted-average approved ROE based on the costs of two projects developed by Transource Missouri; the $64 million Iatan-Nashua project (10.3%) and the $246 million Sibley-Nebraska City project (11.3%).\n(d)\nAEP owns 86.5% of Transource Missouri, Transource West Virginia, Transource Maryland, Transource Pennsylvania and Transource Oklahoma through its ownership interest in Transource Energy, LLC (Transource).  Transource is a joint venture between AEPTHCo and Evergy, Inc. formed to pursue competitive transmission projects.  AEPTHCo and Evergy, Inc. own 86.5% and 13.5% of Transource, respectively.\n(e)\nSee “Independence Energy Connection Project” section of Note 4 for additional information.\n(f)\nIn 2016, Transource Kansas received approval from the FERC authorizing an ROE of 9.8% (10.3% inclusive of the RTO incentive adder of 0.5%) for future competitive transmission projects in SPP.  In October 2020, Transource was awarded the Sooner-Wekiwa project by SPP and the project was assigned to Transource Kansas.  In November 2020, Transource Kansas was renamed Transource Oklahoma.  The project is expected to go in-service in November 2025.\n(g)\nIn October 2022, Transource Energy’s North Delta A proposal was awarded by the New Jersey Board of Public Utilities.  In December 2023, the North Delta project was expanded with additional scope and approved by the PJM Board of Managers.  The project was renamed Bramah Station and is expected to go in-service in 2027.  The project was originally expected to go in-service in 2029.\nTransource Energy, and its subsidiaries Transource Missouri, Transource West Virginia, Transource Maryland, Transource Pennsylvania and Transource Oklahoma are consolidated joint ventures by AEP.  All other joint ventures in the table above are not consolidated by AEP.  AEP’s joint ventures do not have employees.  Business services for the joint ventures are provided by AEPSC and other AEP subsidiaries and the joint venture partners.  In 2024, approximately 502 AEPSC employees and 302 operating company employees provided service to one or more joint ventures.\n17\nREGULATION\nThe State Transcos and the Transmission Joint Ventures located outside of ERCOT establish transmission rates annually through forward-looking formula rate filings with the FERC pursuant to FERC-approved implementation protocols.  The protocols include a transparent, formal review process to ensure the updated transmission rates are prudently-incurred and reasonably calculated.  \nThe State Transcos’ and the Transmission Joint Ventures’ (where applicable) rates are included in the respective OATT for PJM and SPP.  An OATT is the FERC rate schedule that provides the terms and conditions for transmission and related services on a transmission provider’s transmission system.  The FERC requires transmission providers such as PJM and SPP to offer transmission service to all eligible customers (for example, load-serving entities, power marketers, generators and customers) on a non-discriminatory basis.\nThe FERC-approved formula rates establish the annual transmission revenue requirement (ATRR) and transmission service rates for transmission owners in annual rate base filings with the FERC.  The formula rates establish rates for a one-year period based on the current projects in-service and proposed projects for a defined timeframe.  The formula rates also include a true-up calculation for the previous year’s billings, allowing for over/under-recovery of the transmission owner’s ATRR.  PJM and SPP pay the transmission owners their ATRR for use of their facilities and bill transmission customers taking service under the PJM and SPP OATTs, based on the terms and conditions in the respective OATT for the service taken.  Additionally, the State Transcos are subject to mandatory reliability standards promulgated by the NERC, with the approval of the FERC, which standards protect the nation’s bulk power system against potential disruptions from cyber and physical security breaches.  Management monitors pending matters before the FERC, including inquiries and challenges related to ROEs and transmission formula rates, that have the potential to reduce AEP’s future transmission formula rates and/or the transmission ROE methodology.  \nIn the annual formula rate filings described above, the State Transcos in aggregate filed formula rate base totals of $11.4 billion, $10.7 billion and $9.9 billion for 2024, 2023 and 2022, respectively.  The total filed transmission revenue requirements, including prior year over/under-recovery of revenue and associated carrying charges were $1.9 billion, $1.8 billion and $1.7 billion for 2024, 2023 and 2022, respectively.\nThe rates of ETT, which is located in ERCOT, are determined by the PUCT.  ETT sets its rates through a combination of base rate cases and interim Transmission Cost of Services (TCOS) filings.  ETT may file interim TCOS filings semi-annually to update its rates to reflect changes in its net invested capital. \n18\nGENERATION & MARKETING\nGENERAL\nThe AEP Generation & Marketing segment consists of a retail supply business, a wholesale energy trading and marketing business and the rights to Cardinal Plant Unit 1’s power and capacity through 2028.  AEP Generation & Marketing previously included AEP OnSite Partners prior to its sale in September 2024 and AEP Renewables prior to its sale in August 2023.  \nThe retail energy supply business provides electricity and/or natural gas to residential, commercial and industrial customers in Illinois, Pennsylvania, Delaware, Maryland, New Jersey, Ohio and Washington, D.C.  AEP Energy had approximately 987,000 customer accounts as of December 31, 2024.\nThe wholesale trading and marketing business transacts within RTOs to provide supply to customers, manage pricing risk or otherwise provide service to fulfill contractual obligations.  Additionally in certain instances this business procures physical electricity from identified sources, including renewable generation, when providing service to customers.  When adapting to meet the demands of customers’ changing needs or in response to changing circumstances of electricity markets and generation sources, this business executes transactions and modifies contracts as applicable to maximize value and mitigate pricing and delivery risk when fulfilling contractual obligations to its customers. \nThis segment also includes rights to Cardinal Plant Unit 1’s power and capacity through 2028 through a PPA with a nonaffiliated electric cooperative.\nCOMPETITION\nThe AEP Generation & Marketing segment subsidiaries face competition for the sale of available power, capacity and ancillary services.  The principal factors of impact are electricity and fuel prices, new market entrants, construction or retirement of generating assets by others and technological advances in power generation.  Other factors impacting competitiveness include environmental regulation, transmission congestion or transportation constraints at or near generation facilities, inoperability or inefficiencies, outages and deactivations and retirements at generation facilities.  Technology advancements, increased demand for clean energy, changing consumer behaviors, low-priced and abundant natural gas, and regulatory and public policy reforms are among the catalysts for transformation within the industry that impact competition for AEP’s Generation & Marketing segment.\nAEP Generation & Marketing’s retail energy supply business operates in jurisdictions that each establish laws and regulations governing its competitive market, and public utility commission communications and utility default service pricing can affect customer participation in retail competition.  Severe load and market volatility, sustained low market volatility and maturing competitive environments can adversely affect this business.\nCounterparty Risk Management\nCounterparties and exchanges may require cash or cash related instruments to be deposited on these transactions as margin against open positions.  As of December 31, 2024, counterparties posted approximately $156 million in cash, cash equivalents or letters of credit with AEP for the benefit of AEP’s Generation & Marketing segment subsidiaries (while, as of that date, AEP’s Generation & Marketing segment subsidiaries posted approximately\n \n$153 million with counterparties and exchanges).  Since open trading contracts are valued based on market prices of various commodities, exposures change daily.  See the “Quantitative and Qualitative Disclosures About Market Risk” section of Management’s Discussion and Analysis of Financial Condition and Results of Operations for additional information.\n19\nINFORMATION ABOUT OUR EXECUTIVE OFFICERS\nThe following persons are executive officers of AEP.  Their ages are given as of February 13, 2025.  The officers are appointed annually for a one-year term by the board of directors of AEP.\nWilliam J. Fehrman\nPresident, Chief Executive Officer and Director\nAge 64\nPresident, Chief Executive Officer and Director since August 2024.  President and Chief Executive Office of Centuri Holdings, Inc. from January 2024 to July 2024.  President, Chief Executive Officer and Director of Berkshire Hathaway Energy Company from 2018 to 2023.\nDavid M. Feinberg\nExecutive Vice President, General Counsel and Secretary\nAge 55\nExecutive Vice President since January 2013.  General Counsel and Secretary since January 2012.\nKelly J. Ferneau\nExecutive Vice President and Chief Nuclear Officer\nAge 56\nExecutive Vice President and Chief Nuclear Officer since November 2024.  I&M Site Vice President-Donald C. Cook Plant from July 2022 to October 2024.  I&M Plant Manager from 2018 to June 2022.\nQ. Shane Lies\nExecutive Vice President - Projects and Services\nAge 54\nExecutive Vice President - Projects and Services since November 2024.  Executive Vice President and Chief Nuclear Officer from September 2024 to November 2024.  Senior Vice President and Chief Nuclear Officer from July 2022 to September 2024.  I&M Site Vice President-Donald C. Cook Plant from January 2016 to July 2022.\nTrevor I. Mihalik\nExecutive Vice President and Chief Financial Officer\nAge 58\nExecutive Vice President and Chief Financial Officer since January 2025.  Executive Vice President and Group President of Sempra from January 2024 to January 2025. Executive Vice President and Chief Financial Officer of Sempra from 2018 to 2023. Senior Vice President-Controller and Chief Accounting Officer of Sempra from 2012 to 2018.\nTherace M. Risch\nExecutive Vice President and Chief Information & Technology Officer\nAge 51\nExecutive Vice President since July 2021.  Chief Information & Technology Officer since April 2020.  Senior Vice President from April 2020 to July 2021.  Executive Vice President, Chief Information Officer of JCPenney from December 2015 to April 2020.  \nAntonio P. Smyth\nExecutive Vice President - Grid Solutions\nAge 48\nExecutive Vice President - Grid Solutions since December 2024.  Executive Vice President - Grid Solutions & Government Affairs from April 2023 to December 2024. Senior Vice President - Grid Solutions from January 2021 to April 2023.  Senior Vice President - Transmission Ventures, Strategy & Policy from October 2018 to December 2020.\nPhillip R. Ulrich\nExecutive Vice President and Chief Human Resources Officer\nAge 54\nExecutive Vice President since January 2023.  Chief Human Resources Officer since August 2021.  Senior Vice President from August 2021 to December 2022.  Chief Human Resources Officer of Flex, LTD from May 2019 to July 2021.  \n20",
  "item7": "ITEM 7.   MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nAEP\nThe information required by this item is incorporated herein by reference to the material under Management’s Discussion and Analysis of Financial Condition and Results of Operations.  Year-to-year comparisons between 2023 and 2022 have been omitted from this Form 10-K but may be found in \"Management's Discussion and Analysis of Financial Condition\" in Part II, Item 7 of our Form 10-K for the fiscal year ended December 31, 2023, which specific discussion is incorporated herein by reference.\nAEP Texas, AEPTCo, APCo, I&M, OPCo, PSO and SWEPCo\nOmitted pursuant to Instruction I(2)(a).  Management’s narrative analysis of the results of operations and other information required by Instruction I(2)(a) is incorporated herein by reference to the material under Management’s Discussion and Analysis of Financial Condition and Results of Operations.",
  "item2": null
}