{
  "source_file": "aes-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "ITEM 2. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe condensed consolidated financial statements included in Item 1.—\nFinancial Statements\n of this Form 10-Q and the discussions contained herein should be read in conjunction with our 2024 Form 10-K.\nForward-Looking Information\nThe following discussion may contain forward-looking statements regarding us, our business, prospects and our results of operations, that are subject to certain risks and uncertainties posed by many factors and events that could cause our actual business, prospects and results of operations to differ materially from those that may be anticipated by such forward-looking statements. These statements include, but are not limited to, statements regarding management’s intents, beliefs, and current expectations and typically contain, but are not limited to, the terms “anticipate,” “potential,” “expect,” “forecast,” “target,” “will,” “would,” “intend,” “believe,” “project,” “estimate,” “plan,” and similar words. Forward-looking statements are not intended to be a guarantee of future results, but instead constitute current expectations based on reasonable assumptions. Factors that could cause or contribute to such differences include, but are not limited to, those described in Item 1A.—\nRisk Factors \nof this Form 10-Q, Item 1A.—\nRisk Factors\n and Item 7.—\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations \nof our 2024 Form 10-K and subsequent filings with the SEC. \nReaders are cautioned not to place undue reliance on these forward-looking statements which speak only as of the date of this report. We undertake no obligation to revise any forward-looking statements in order to reflect events or circumstances that may subsequently arise. If we do update one or more forward-looking statements, no inference should be drawn that we will make additional updates with respect to those or other forward-looking statements. Readers are urged to carefully review and consider the various disclosures made by us in this report and in our other reports filed with the SEC that advise of the risks and factors that may affect our business.\nOverview of Our Business\nWe are a diversified power generation and utility company organized into the following four SBUs, mainly organized by technology: \nRenewables\n (solar, wind, energy storage, and hydro), \nUtilities\n (AES Indiana, AES Ohio, and AES El Salvador), \nEnergy Infrastructure\n (natural gas, LNG, coal, pet coke, diesel, and oil), and \nNew Energy Technologies\n (investments in Fluence, Uplight, Maximo, and other initiatives). Prior to the first quarter of 2025, our businesses in Chile (which have a mix of generation sources, including renewables, that were pooled to service our existing PPAs) were reported in the Energy Infrastructure SBU. After the sale or disconnection of a significant portion of AES Andes’ coal plants and the expiration of its coal-indexed contracts with regulated customers at the end of 2024, the results of our businesses in Chile, excluding the two remaining coal plants, are now reported as part of the Renewables SBU. The results of the two remaining coal plants in Chile, Angamos and Cochrane, remain within the Energy Infrastructure SBU. For additional information regarding our business, see Item 1.—\nBusiness\n of our 2024 Form 10-K.\nWe have two lines of business: generation and utilities. Our Renewables, Utilities, and Energy Infrastructure SBUs participate in our first business line, generation, in which we own and/or operate power plants to generate and sell power to customers, such as utilities, industrial users, and other intermediaries. Our Utilities SBU participates in our second business line, utilities, in which we own and/or operate utilities to generate or purchase, distribute, transmit, and sell electricity to end-user customers in the residential, commercial, industrial, and governmental sectors within a defined service area. In certain circumstances, our utilities also generate and sell electricity on the wholesale market. Our New Energy Technologies SBU includes investments in new and innovative technologies to support leading-edge greener energy solutions.\n48 | The AES Corporation | September 30, 2025 Form 10-Q\nExecutive Summary\nCompared with last year, third quarter net income increased $302 million, from $215 million to $517 million. This increase is primarily due to higher income tax benefit mainly driven by tax credit transfers, higher margins from new projects in the Renewables SBU, and an increase in rider revenues due to revised rates at AES Indiana and AES Ohio in the Utilities SBU. This was partially offset by lower generation at the Energy Infrastructure SBU and the sale of AES Brasil.\nAdjusted EBITDA, a non-GAAP measure, increased $132 million, from $698 million to $830 million, driven by higher contributions from new projects in the Renewables SBU and an increase in rider revenues due to revised rates at AES Indiana and AES Ohio in the Utilities SBU. This was partially offset by the sale of AES Brasil and the impact of the selldown of AES Ohio.\nAdjusted EBITDA with Tax Attributes, a non-GAAP measure, increased $82 million, from $1,174 million to $1,256 million, due to the drivers above, partially offset by lower realized tax attributes driven by timing of tax attribute recognition.\nCompared with last year, third quarter diluted earnings per share from continuing operations increased $0.22, from $0.72 to $0.94. This increase is mainly driven by higher income tax benefit, higher contributions from new projects in the Renewables SBU, and higher retail margin at the Utilities SBU. This was partially offset by lower realized tax attributes at the Renewables SBU due to timing of tax attribute recognition, lower other income, and lower interest income.\nAdjusted EPS, a non-GAAP measure, increased $0.04 from $0.71 to $0.75, mainly driven by a lower adjusted tax rate, including the impact of tax credit transfers, higher retail margin at the Utilities SBU, and lower general and administrative costs at Corporate. This was partially offset by lower realized tax attributes at the Renewables SBU due to timing of tax attribute recognition.\nCompared with last year, net income for the nine months ended September 30, 2025 decreased $352 million from $646 million to $294 million. This decrease is primarily driven by lower earnings from the Energy Infrastructure SBU due to higher prior year revenues from the monetization of the Warrior Run coal plant PPA, higher day-one losses on the commencement of sales type leases at AES Clean Energy Development, and the sale of AES Brasil. This was partially offset by the derecognition of a valuation allowance on the loan receivable upon reclassifying Mong Duong from held-for-sale to held and used, higher margins from new projects in the Renewables SBU, higher income tax benefit mainly driven by tax credit transfers, lower interest expense, and higher retail margin at AES Indiana in the Utilities SBU under the 2024 Base Rate Order, including the impact of certain riders now included in base rates.\nAdjusted EBITDA, a non-GAAP measure, increased $106 million, from $1,996 million to $2,102 million, for the nine months ended September 30, 2025, mainly driven by higher contributions from new projects in the Renewables SBU and higher retail margin at AES Indiana in the Utilities SBU under the 2024 Base Rate Order, including the impact of certain riders now included in base rates. This was partially offset by higher prior year revenues from the monetization of the Warrior Run coal plant PPA and the sale of AES Brasil.\nAdjusted EBITDA with Tax Attributes, a non-GAAP measure, increased $199 million, from $2,891 million to $3,090 million, for the nine months ended September 30, 2025, due to the drivers above as well as higher realized tax attributes driven by higher income from tax credit transfers.\nCompared with last year, diluted earnings per share from continuing operations for the nine months ended September 30, 2025 decreased $0.85, from $1.71 to $0.86. This decrease is mainly driven by lower earnings at the Energy Infrastructure SBU primarily due to higher prior year revenues from the monetization of the Warrior Run coal plant PPA, day-one losses on the commencement of sales-type leases at AES Clean Energy Development, lower realized tax attributes at the Renewables SBU due to timing of tax attribute recognition, lower interest income, higher foreign currency losses, and lower other income. This was partially offset by the derecognition of a valuation allowance on the loan receivable upon reclassifying Mong Duong from held-for-sale to held and used and higher income tax benefit mainly driven by tax credit transfers.\nAdjusted EPS, a non-GAAP measure, decreased $0.07 from $1.60 to $1.53, for the nine months ended September 30, 2025, mainly driven by lower realized tax attributes at the Renewables SBU due to timing of tax attribute recognition, and lower contributions at the Energy Infrastructure SBU primarily due to higher prior year revenues from the monetization of the Warrior Run coal plant PPA. This was partially offset by a lower adjusted tax rate, including the impact of tax credit transfers, and higher realized tax attributes and retail margin at the Utilities SBU.\n49 | The AES Corporation | September 30, 2025 Form 10-Q\n(1)\n    Non-GAAP measure. See Item 2.—\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\n—\nSBU Performance Analysis\n—\nNon-GAAP Measures \nfor reconciliation and definition.\n(2)\n    GWh sold in 2024.\n50 | The AES Corporation | September 30, 2025 Form 10-Q\nOverview of Strategic Performance\nAES is leading the industry's transition to clean energy by investing in renewables, utilities, and technology businesses.\n•\nOur PPA backlog, which consists of projects with signed contracts, but which are not yet operational, is 11.1 GW, including 5 GW under construction. Year-to-date, we:\n◦\nCompleted the construction of 2.9 GW of solar, energy storage, and wind, and we are on track to add a total of 3.2 GW to our operating portfolio by year-end 2025; and\n◦\nSigned or were awarded new long-term PPAs for 2.2 GW.\n•\nOur U.S. utilities made progress toward securing future growth:\n◦\nAES Ohio reached a unanimous settlement resolving its distribution rate review;\n◦\nAES Indiana reached a partial settlement agreement for its current rate review; and\n◦\nAES Indiana filed a 20-year IRP.\nReview of Consolidated Results of Operations (Unaudited)\nThree Months Ended September 30,\nNine Months Ended September 30,\n(in millions, except per share amounts)\n2025\n2024\n$ change\n% change\n2025\n2024\n$ change\n% change\nRevenue:\nRenewables SBU\n$\n817 \n$\n754 \n$\n63 \n8 \n%\n$\n2,127 \n$\n2,016 \n$\n111 \n6 \n%\nUtilities SBU\n1,105 \n961 \n144 \n15 \n%\n3,068 \n2,730 \n338 \n12 \n%\nEnergy Infrastructure SBU\n1,483 \n1,614 \n(131)\n-8 \n%\n4,109 \n4,685 \n(576)\n-12 \n%\nNew Energy Technologies SBU\n— \n1 \n(1)\n-100 \n%\n— \n1 \n(1)\n-100 \n%\nCorporate and Other\n32 \n33 \n(1)\n-3 \n%\n111 \n106 \n5 \n5 \n%\nEliminations\n(86)\n(74)\n(12)\n-16 \n%\n(283)\n(222)\n(61)\n-27 \n%\nTotal Revenue\n3,351 \n3,289 \n62 \n2 \n%\n9,132 \n9,316 \n(184)\n-2 \n%\nOperating Margin:\nRenewables SBU\n213 \n189 \n24 \n13 \n%\n371 \n352 \n19 \n5 \n%\nUtilities SBU\n197 \n165 \n32 \n19 \n%\n488 \n441 \n47 \n11 \n%\nEnergy Infrastructure SBU\n288 \n345 \n(57)\n-17 \n%\n653 \n997 \n(344)\n-35 \n%\nNew Energy Technologies SBU\n(2)\n(1)\n(1)\n-100 \n%\n(6)\n(5)\n(1)\n-20 \n%\nCorporate and Other\n61 \n47 \n14 \n30 \n%\n203 \n182 \n21 \n12 \n%\nEliminations\n(22)\n(23)\n1 \n4 \n%\n(80)\n(73)\n(7)\n-10 \n%\nTotal Operating Margin\n735 \n722 \n13 \n2 \n%\n1,629 \n1,894 \n(265)\n-14 \n%\nGeneral and administrative expenses\n(46)\n(57)\n11 \n-19 \n%\n(172)\n(198)\n26 \n-13 \n%\nInterest expense\n(348)\n(379)\n31 \n-8 \n%\n(1,042)\n(1,125)\n83 \n-7 \n%\nInterest income\n76 \n119 \n(43)\n-36 \n%\n215 \n312 \n(97)\n-31 \n%\nLoss on extinguishment of debt\n(2)\n(1)\n(1)\n100 \n%\n(15)\n(11)\n(4)\n36 \n%\nOther expense\n(26)\n(31)\n5 \n-16 \n%\n(373)\n(153)\n(220)\nNM\nOther income\n19 \n64 \n(45)\n-70 \n%\n57 \n120 \n(63)\n-53 \n%\nGain (loss) on disposal and sale of business interests\n1 \n(1)\n2 \nNM\n70 \n43 \n27 \n63 \n%\nAsset impairment reversals (expense)\n(31)\n(74)\n43 \n-58 \n%\n74 \n(158)\n232 \nNM\nForeign currency transaction gains (losses)\n(19)\n(28)\n9 \n-32 \n%\n(57)\n2 \n(59)\nNM\nOther non-operating expense\n(32)\n— \n(32)\nNM\n(42)\n— \n(42)\nNM\nIncome tax benefit (expense)\n226 \n(103)\n329 \nNM\n42 \n(52)\n94 \nNM\nNet equity in earnings (losses) of affiliates\n1 \n(9)\n10 \nNM\n(55)\n(21)\n(34)\nNM\nINCOME FROM CONTINUING OPERATIONS\n554 \n222 \n332 \nNM\n331 \n653 \n(322)\n-49 \n%\nLoss from disposal of discontinued businesses, net of income tax expense of $0, $7, $0, and $7, respectively\n(37)\n(7)\n(30)\nNM\n(37)\n(7)\n(30)\nNM\nNET INCOME\n517 \n215 \n302 \nNM\n294 \n646 \n(352)\n-54 \n%\nLess: Net loss attributable to noncontrolling interests and redeemable stock of subsidiaries\n122 \n289 \n(167)\n-58 \n%\n296 \n566 \n(270)\n-48 \n%\nNET INCOME ATTRIBUTABLE TO THE AES CORPORATION\n$\n639 \n$\n504 \n$\n135 \n27 \n%\n$\n590 \n$\n1,212 \n$\n(622)\n-51 \n%\nNet cash provided by operating activities\n$\n1,297 \n$\n985 \n$\n312 \n32 \n%\n$\n2,818 \n$\n1,664 \n$\n1,154 \n69 \n%\nComponents of Revenue, Cost of Sales, and Operating Margin — \nRevenue includes revenue earned from the sale of energy from our utilities and the production and sale of energy from our generation plants, which are \n51 | The AES Corporation | September 30, 2025 Form 10-Q\nclassified as regulated and non-regulated\n,\n respectively, on the Condensed Consolidated Statements of Operations. Revenue also includes the gains or losses on derivatives associated with the sale of electricity. \nCost of sales includes costs incurred directly by the businesses in the ordinary course of business. Examples include electricity and fuel purchases, operations and maintenance costs, depreciation and amortization expenses, bad debt expense and recoveries, and general administrative and support costs (including employee-related costs directly associated with the operations of the business). Cost of sales also includes the gains or losses on derivatives associated with the purchase of electricity or fuel.\nOperating margin is defined as revenue less cost of sales. \nConsolidated Revenue and Operating Margin\nThree Months Ended September 30, 2025\n \nRevenue\n(in millions)\nConsolidated Revenue\n \n— Revenue increased $62 million, or 2%, for the three months ended September 30, 2025, compared to the three months ended September 30, 2024, driven by: \n•\n$144 million at Utilities mainly driven by a $131 million increase in transmission, distribution, rider, and wholesale revenues mainly due to higher rates and $20 million due to higher net retail demand mainly driven by favorable weather; and\n•\n$63 million at Renewables mainly driven by a $241 million increase due to the results of AES Andes moving to Renewables in 2025 as described below, net of a current year increase in contracted sales in Chile, and $112 million due to new projects in service; partially offset by a $201 million negative impact from the sale of AES Brasil and $85 million net lower spot sales and prices, mainly at Colombia.\nThis favorable impact was partially offset by decreases of:\n•\n$131 million at Energy Infrastructure driven by $225 million of prior year revenue related to the AES Andes portfolio, which is reported in the Renewables SBU beginning in 2025 following the sale and expiration of certain coal-related assets and contracts and $21 million due to prior year unrealized and realized derivative gains; partially offset by $90 million higher fuel prices and transportation costs passed through to the offtaker, net of foreign exchange impact, and $21 million due to higher availability in 2025; and\n•\n$13 million at Corporate, Other and Eliminations mainly driven by higher eliminations of inter-segment revenue.\n52 | The AES Corporation | September 30, 2025 Form 10-Q\nOperating Margin\n(in millions)\nConsolidated Operating Margin\n \n— Operating margin increased $13 million, or 2%, for the three months ended September 30, 2025, compared to the three months ended September 30, 2024, driven by:\n•\n$32 million at Utilities primarily driven by an increase of $47 million due to transmission and rider revenues and deferral of cost in the current year; partially offset by a $9 million increase in depreciation expense from additional assets placed in service, and a $9 million increase in fixed cost mainly driven by higher property taxes;\n•\n$24 million at Renewables mainly driven by an $80 million positive impact from new businesses and a $20 million impact from AES Andes moving to Renewables in 2025, as described below; partially offset by a $66 million impact from the sale of AES Brasil and a $14 million increase in fixed costs primarily due to an accelerated growth plan; and\n•\n$15 million at Corporate, Other and Eliminations mainly driven by higher charge-outs of IT and other costs to the businesses and higher premiums earned by AGIC.\nThese favorable impacts were partially offset by a decrease of $57 million at Energy Infrastructure mainly driven by $29 million of lower generation due to dispatch, $20 million of prior year operating margin at AES Andes, which is reported in the Renewables SBU beginning in 2025, and $9 million driven by lower LNG sales; partially offset by $12 million of higher contract margin driven by lower fuel costs.\nNine Months Ended September 30, 2025\nRevenue\n(in millions)\nConsolidated Revenue\n \n— Revenue decreased $184 million, or 2%, for the nine months ended September 30, 2025, compared to the nine months ended September 30, 2024, driven by:\n•\n$576 million at Energy Infrastructure primarily driven by $697 million of prior year revenue related to the AES Andes portfolio, which is reported in the Renewables SBU beginning in 2025 following the sale and expiration of certain coal-related assets and contracts; $171 million of prior year revenues from the monetization of the Warrior Run coal plant PPA, and $145 million due to prior year unrealized and realized derivative gains; partially offset by $272 million higher fuel prices and transportation costs passed through to the offtaker, $126 million higher CO\n2\n purchases passed through due to higher production, $24 million due to higher availability, and $16 million of higher LNG sales and terminal fees; and\n53 | The AES Corporation | September 30, 2025 Form 10-Q\n•\n$56 million at Corporate, Other and Eliminations mainly driven by higher eliminations of inter-segment revenue.\nThese unfavorable impacts were partially offset by increases of: \n•\n$338 million at Utilities mainly driven by a $306 million increase in transmission, distribution, rider, and wholesale revenues mainly due to higher rates and $42 million due to higher net retail demand mainly driven by favorable weather; partially offset by $6 million of lower Fuel Adjustment Charge rider revenue; and\n•\n$111 million at Renewables mainly driven by a $623 million increase due to the results of AES Andes moving to Renewables in 2025 as described above, net of a current year decrease in regulated contract sales, and $234 million due to new projects in service; partially offset by a $540 million negative impact from the sale of AES Brasil, $174 million net lower spot sales and prices, mainly at Colombia, and a $48 million negative impact related to changes in mark-to-market of energy derivatives.\nOperating Margin\n(in millions)\nConsolidated Operating Margin\n \n— Operating margin decreased $265 million, or 14%, for the nine months ended September 30, 2025, compared to the nine months ended September 30, 2024, driven by:\n•\n$344 million at Energy Infrastructure mainly driven by $160 million higher prior year revenues from the monetization of the Warrior Run coal plant PPA, $117 million due to prior year net derivative gains as part of our commercial hedging strategy, $42 million of prior year operating margin related to the AES Andes portfolio, which is reported in the Renewables SBU beginning in 2025 following the sale and expiration of certain coal-related assets and contracts, $28 million of lower generation mainly driven by dispatch, $20 million of one-time costs due to restructuring, and $17 million due to the prior year selldown of Amman East and IPP4 in Jordan; partially offset by $45 million driven by higher availability in 2025 due to lower maintenance.\nThese unfavorable impacts were partially offset by increases of:\n•\n$47 million at Utilities mainly driven by $126 million due to higher retail rates as a result of the 2024 Base Rate Order, higher transmission and rider revenues, and higher demand due to the impact of weather; partially offset by a $32 million increase in depreciation expense from additional assets placed in service, a $17 million impact of planned outages, a $16 million increase in fixed cost mainly driven by higher property taxes, and $15 million higher credit losses;\n•\n$19 million at Renewables mainly driven by a $147 million impact from new businesses, $42 million impact of the results of AES Andes moving to Renewables in 2025, as described above, $36 million due to higher generation in Panama as a result of better hydrological conditions during the first quarter of 2025, and a $26 million increase in Colombia due to increased availability and lower spot prices on energy purchases in the second quarter of 2025. These positive impacts were partially offset by a $150 million negative impact from the sale of AES Brasil, a $46 million negative impact related to changes in mark-to-market of energy derivatives, a $33 million increase in fixed costs primarily related to an accelerated growth plan, and $17 million of one-time costs due to restructuring; and\n•\n$14 million at Corporate, Other and Eliminations mainly driven by higher premiums earned by AGIC.\nSee Item 2.—\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\n—\nSBU Performance Analysis\n of this Form 10-Q for additional discussion and analysis of operating results for each SBU.\n54 | The AES Corporation | September 30, 2025 Form 10-Q\nConsolidated Results of Operations — Other\nGeneral and administrative expenses\nGeneral and administrative expenses decreased $11 million, or 19%, to $46 million for the three months ended September 30, 2025, compared to $57 million for the three months ended September 30, 2024, primarily reflecting a $7 million decrease in people costs driven by the Company’s restructuring program, and $1 million lower IT related costs.\nGeneral and administrative expenses decreased $26 million, or 13%, to $172 million for the nine months ended September 30, 2025, compared to $198 million for the nine months ended September 30, 2024, primarily reflecting a $25 million decrease in business development costs and $8 million decrease in people costs, both driven by the Company’s restructuring program, and $3 million lower IT related costs, partially offset by $14 million of one-time restructuring-related charges.\nInterest expense\nInterest expense decreased $31 million, or 8%, to $348 million for the three months ended September 30, 2025, compared to $379 million for the three months ended September 30, 2024. This decrease is primarily due to a $53 million impact from the sale of AES Brasil in October 2024; partially offset by lower capitalized interest at the Renewables SBU due to fewer projects under construction.\nInterest expense decreased $83 million, or 7%, to $1,042 million for the nine months ended September 30, 2025, compared to $1,125 million for the nine months ended September 30, 2024. This decrease is primarily due to a $177 million impact from the sale of AES Brasil in October 2024 and lower debt balances at the Energy Infrastructure SBU; partially offset by lower capitalized interest at the Renewables SBU due to fewer projects under construction, and a higher weighted average interest rate and debt balance at the Parent Company.\nInterest income\nInterest income decreased $43 million, or 36%, to $76 million for the three months ended September 30, 2025, compared to $119 million for the three months ended September 30, 2024, primarily due to prior year interest recognized of $33 million on the Stabilization Fund receivables in Chile and a $14 million impact from the sale of AES Brasil in October 2024.\nInterest income decreased $97 million, or 31%, to $215 million for the nine months ended September 30, 2025, compared to $312 million for the nine months ended September 30, 2024, primarily due to a $42 million impact from the sale of AES Brasil in October 2024, prior year interest recognized of $34 million on the Stabilization Fund receivables in Chile, and a $20 million decrease at Argentina due to lower short-term investments at lower rates.\nLoss on extinguishment of debt\nLoss on extinguishment of debt increased $4 million, or 36%, to $15 million for the nine months ended September 30, 2025, compared to $11 million for the nine months ended September 30, 2024 primarily driven by a $5 million loss due to prepayment of senior notes at Mercury Chile, a $5 million loss related to a revolver amendment at AES Clean Energy, and a $4 million loss related to a prepayment at AES Andes in the current year; partially offset by a prior year loss of $8 million due to a prepayment at AES Andes. \nSee Note 8—\nObligations\n included in Item 1.—\nFinancial Statements\n of this Form 10-Q for further information.\nOther income and expense\nOther income decreased $45 million, or 70%, to $19 million for the three months ended September 30, 2025, compared to $64 million for the three months ended September 30, 2024, mainly due to a $13 million decrease in gains on remeasurement of contingent consideration primarily on projects acquired at AES Clean Energy and a $12 million impact from an indexation adjustment of Stabilization Fund receivables at AES Andes in prior year, partially offset by a $10 million gain at AES Andes corresponding to the write-off of contingent consideration for a renewables development project determined to be no longer viable.\nOther income decreased $63 million, or 53%, to $57 million for the nine months ended September 30, 2025, compared to $120 million for the nine months ended September 30, 2024, mainly due to a $12 million impact from an indexation adjustment of Stabilization Fund receivables at AES Andes in prior year, a $7 million decrease in AFUDC at our U.S. utilities in the current year, and the prior year impacts of a $5 million gain on commencement of a sales-type lease on land, $5 million in insurance proceeds primarily related to property damage at AES Andes, \n55 | The AES Corporation | September 30, 2025 Form 10-Q\nand a $5 million gain on contract termination, partially offset by a $10 million gain at AES Andes corresponding to the write-off of contingent consideration for a renewables development project determined to be no longer viable.\nOther expense decreased $5 million, or 16%, to $26 million for the three months ended September 30, 2025, compared to $31 million for the three months ended September 30, 2024, mainly due to a $16 million decrease in losses on remeasurement of contingent consideration primarily on projects acquired at AES Clean Energy; partially offset by $13 million in current period losses on commencement of sales-type leases at AES Clean Energy and AES Renewable Holdings.\nOther expense increased $220 million to $373 million for the nine months ended September 30, 2025, compared to $153 million for the nine months ended September 30, 2024, mainly due to an increase of $149 million in losses on commencement of sales-type leases at AES Clean Energy and AES Renewable Holdings, a $48 million loss on remeasurement of our investment in 5B, accounted for using the measurement alternative, and a $20 million increase in losses on remeasurement of contingent consideration primarily on projects acquired at AES Clean Energy; partially offset by a $20 million loss recognized in the prior year related to legal expenses and other direct costs associated with the troubled debt restructuring at AES Puerto Rico.\nSee Note 15—\nOther Income and Expense\n included in Item 1.—\nFinancial Statements\n of this Form 10-Q for further information.\nGain (loss) on disposal and sale of business interests\nGain on disposal and sale of business interests increased $27 million, or 63%, to $70 million for the nine months ended September 30, 2025 compared to $43 million for nine months ended September 30, 2024. This was primarily due to a $\n70\n million gain on the selldown of Dominican Republic Renewables and a $\n10\n million loss in the prior year on the selldown of Amman East and IPP4 in Jordan, which are now accounted for as equity method investments. This was partially offset by a $\n52\n million gain in the prior year on dilution of AES’ ownership interest in Uplight as a result of the AutoGrid acquisition. \nSee Note 7—\nInvestments in and Advances to Affiliates\n and Note 18—\nHeld-for-Sale and Dispositions\n \nfor further information.\nAsset impairment reversals (expense)\nAsset impairment expense decreased $43 million, or 58%, to $31 million for the three months ended September 30, 2025, compared to $74 million for the three months ended September 30, 2024. This decrease was primarily the result of prior year impairment expense of $55 million and $11 million at AES Brasil and Mong Duong, respectively, associated with the held-for-sale classification. This was partially offset by higher impairment expense of $16 million and $8 million at AES Andes and AES Clean Energy Development, respectively, due to the write-off of project development intangibles and capitalized development costs for projects that were determined to be no longer viable.\nAsset impairment expense decreased $232 million to a $74 million asset impairment reversal for the nine months ended September 30, 2025, compared to a $158 million expense for the nine months ended September 30, 2024. This decrease was primarily the result of a $\n243\n million increase in the carrying value of the Mong Duong asset group due to the derecognition of a valuation allowance on the loan receivable accounted for under ASC 310 and the elimination of net estimated costs to sell upon reclassifying Mong Duong from held-for-sale to held and used, and lower impairment expense of $37 million and $80 million at Mong Duong and AES Brasil, respectively, associated with the held-for-sale classification. This was partially offset by higher impairment expense of $111 million and $16 million at AES Clean Energy Development and AES Andes, respectively, due to the write-off of project development intangibles and capitalized development costs for projects that were determined to be no longer viable, including $\n51\n million at AES Clean Energy Development in the current year due to the right sizing of our development company as part of the restructuring program initiated in February 2025.\nSee Note 16—\nAsset Impairment Expense\n and Note 21—\nRestructuring\n \nincluded in Item 1.—\nFinancial Statements\n of this Form 10-Q for further information.\n56 | The AES Corporation | September 30, 2025 Form 10-Q\nForeign currency transaction gains (losses)\nThree Months Ended September 30,\nNine Months Ended September 30,\n(in millions)\n2025\n2024\n2025\n2024\nChile\n$\n(8)\n$\n(13)\n$\n(27)\n$\n(17)\nArgentina\n(16)\n1 \n(26)\n1 \nCorporate\n3 \n(17)\n(9)\n18 \nOther\n2 \n1 \n5 \n— \nTotal \n(1)\n$\n(19)\n$\n(28)\n$\n(57)\n$\n2 \n___________________________________________\n(1)\nIncludes losses of $8 million and $15 million on foreign currency derivative contracts for the three months ended September 30, 2025, and 2024, respectively, and losses of $22 million and gains of $94 million on foreign currency derivative contracts for the nine months ended September 30, 2025,and 2024, respectively.\nThe Company recognized net foreign currency transaction losses of $19 million for the three months ended September 30, 2025, primarily driven by unrealized losses due to the depreciation of the Argentine peso and net unrealized losses in Chile due to the appreciation of the Colombian peso, which negatively impacted foreign currency forwards, partially offset by unrealized gains due to the depreciation of the Chilean peso.\nThe Company recognized net foreign currency transaction losses of $57 million for the nine months ended September 30, 2025, primarily driven by unrealized losses due to the depreciation of the Argentine peso and unrealized losses in Chile due to the appreciation of the Colombian peso, which negatively impacted foreign currency forwards, and the appreciation of the Chilean peso.\nThe Company recognized net foreign currency transaction losses of $28 million for the three months ended September 30, 2024, primarily driven by unrealized losses on swaps and options denominated in the Brazilian real and unrealized losses due to the depreciation of the Chilean peso.\nThe Company recognized net foreign currency transaction gains of $2 million for the nine months ended September 30, 2024, primarily driven by unrealized gains on swaps and options denominated in the Brazilian real; partially offset by unrealized losses due to the depreciation of the Chilean peso.\nOther non-operating expense \nOther non-operating expense was $32 million for the three months ended September 30, 2025 due to an impairment of the Uplight equity method investment and adjustments to the convertible notes and related embedded derivative feature included within the convertible notes for Uplight as a result of observable market factors.\nOther non-operating expense was $42 million for the nine months ended September 30, 2025 due to the $32 million impact from Uplight mentioned above and a $10 million other-than-temporary impairment of convertible notes for 5B as a result of an observable price change from a transaction between 5B and a third-party.\nSee Note 7—\nInvestments in and Advances to Affiliates\n included in Item 1.—\nFinancial Statements\n of this Form 10-Q for further information.\nIncome tax benefit (expense)\nIncome tax benefit was $226 million for the three months ended September 30, 2025, compared to income tax expense of $103 million for the three months ended September 30, 2024. The Company’s effective tax rates were (69)% and 31% for the three months ended September 30, 2025 and 2024, respectively. Both the current and prior year effective tax rates were impacted by the benefits associated with U.S. investment tax credits (“ITCs”), partially offset by tax expense resulting from allocations of losses to tax equity investors on renewables projects.\nIncome tax benefit was $42 million for the nine months ended September 30, 2025, compared to income tax expense of $52 million for the nine months ended September 30, 2024. The Company’s effective tax rates were (12)% and 7% for the nine months ended September 30, 2025 and 2024, respectively. Both rates were impacted by the ITC benefits and tax equity allocations described above. Additionally, the 2025 effective tax rate was impacted by the reclassification of Mong Duong from held-for-sale to held and used, while the 2024 effective tax rate reflected the restructuring of a foreign holding company, as well as the AES Brasil held-for-sale reclassification.\nOur effective tax rate reflects the tax effect of significant operations outside the U.S., which are generally taxed at rates different than the U.S. statutory rate of 21%. Furthermore, our foreign earnings may be subjected to incremental U.S. taxation under the GILTI rules and incremental foreign taxation under Pillar 2. A future proportionate change in the composition of income before income taxes from foreign and domestic tax jurisdictions could impact our periodic effective tax rate.\n57 | The AES Corporation | September 30, 2025 Form 10-Q\nNet equity in earnings (losses) of affiliates\nNet equity in earnings of affiliates increased $10 million to $1 million for the three months ended September 30, 2025, compared to losses of $9 million for the three months ended September 30, 2024. This increase was primarily driven by higher earnings from Fluence of $9 million, mainly due to an increase in the volume of BESS products fulfilled.\nNet equity in losses of affiliates increased $34 million to $55 million for the nine months ended September 30, 2025, compared to $21 million for the nine months ended September 30, 2024. This increase was primarily driven by lower earnings from sPower of $35 million, mainly due to lower contributions from renewables projects that came online.\nSee Note 7—\nInvestments in and Advances to Affiliates\n included in Item 1.—\nFinancial Statements\n of this Form 10-Q for further information.\nLoss from disposal of discontinued businesses\nNet loss from disposal of discontinued businesses was $\n37\n million for the nine months ended September 30, 2025, compared to $7 million for the nine months ended September 30, 2024, primarily related to alleged damages plus interest, as well as potential future damages, under a dispute related to representations and warranties in the 2016 share purchase agreement for Sul in the current year.\nSee Note 22—\nDiscontinued Operations\n included in Item 1.—\nFinancial Statements \nof this Form 10-Q for further information.\nNet loss attributable to noncontrolling interests and redeemable stock of subsidiaries\nNet loss attributable to noncontrolling interests and redeemable stock of subsidiaries decreased $167 million, or 58%, to $122 million for the three months ended September 30, 2025, compared to $289 million for the three months ended September 30, 2024. This decrease was primarily due to a decrease of $165 million at AES Clean Energy Development and AES Renewable Holdings primarily attributable to lower allocation of losses to tax equity investors on projects placed in service.\nNet loss attributable to noncontrolling interests and redeemable stock of subsidiaries decreased $270 million, or 48%, to $296 million for the nine months ended September 30, 2025, compared to $566 million for the nine months ended September 30, 2024. This decrease was primarily due to a decrease of $203 million at AES Clean Energy Development primarily attributable to lower allocation of losses to tax equity investors on projects placed in service, $135 million at Mong Duong mostly driven by the derecognition of a valuation allowance on the loan receivable accounted for under ASC 310 upon reclassifying Mong Duong from held-for-sale to held and used, and $39 million related to the sale of AES Brasil. This was partially offset by an increase of $54 million at AES Indiana primarily attributable to higher allocation of losses to tax equity investors on BESS projects placed in service, and $52 million due to day-one losses on the commencement of sales-type leases at AES Clean Energy Development.\nNet income attributable to The AES Corporation\nNet income attributable to The AES Corporation increased $135 million, or 27%, to $639 million for the three months ended September 30, 2025, compared to $504 million for the three months ended September 30, 2024. This increase was primarily due to:\n•\nHigher income tax benefit of $334 million due to a lower effective tax rate, mainly driven by tax credit transfers;\n•\nHigher margins from the Renewables SBU of $23 million primarily due to increased revenue from new projects;\n•\nHigher margins from the Utilities SBU of $16 million due to higher retail rates;\n•\nLower general and administrative expenses of $13 million after implementation of the restructuring program;\n•\nLower foreign currency translation losses of $11 million primarily related to depreciation of the Argentine peso and appreciation of the Colombian peso; and\n•\nHigher margins at AGIC of $10 million due to a decrease in reserve for losses and increase in insurance premiums earned.\n58 | The AES Corporation | September 30, 2025 Form 10-Q\nThese increases were partially offset by:\n•\nLower contributions from renewables projects placed in service in the current year of $155 million;\n•\nLower other income of $34 million primarily related to decreased gains on remeasurement of contingent consideration primarily on projects acquired at AES Clean Energy and an indexation adjustment of Stabilization Fund receivables at AES Andes in the prior year, partially offset by a write-off of contingent consideration for a renewables project no longer viable at AES Andes;\n•\nLower interest income of $33 million primarily due to prior year interest recognized on Stabilization Fund receivables in Chile and the sale of AES Brasil;\n•\nOther non-operating expense of $32 million due to an impairment of the Uplight equity method investment and adjustments to the convertible notes and related embedded derivative feature within the convertible notes for Uplight; and\n•\nHigher loss from disposal of discontinued businesses of $30 million primarily due to a dispute in the current year related to representations and warranties in the 2016 share purchase agreement for Sul.\nNet income attributable to The AES Corporation decreased $622 million, or 51%, to $590 million for the nine months ended September 30, 2025, compared to $1,212 million for the nine months ended September 30, 2024. This decrease was primarily due to: \n•\nLower margins from the Energy Infrastructure SBU of $298 million, excluding one-time restructuring costs, primarily due to higher prior year revenues from the monetization of the Warrior Run coal plant PPA and prior year net derivative gains as part of our commercial hedging strategy;\n•\nHigher other expense of $164 million primarily related to day-one losses on commencement of sales-type leases at AES Clean Energy Development;\n•\nLower contributions from renewables projects placed in service in the current year of $162 million;\n•\nHigher impairments of $81 million at AES Clean Energy Development due to the write-off of project development intangibles and capitalized development costs for projects that were determined to be no longer viable;\n•\nLower interest income of $56 million primarily due to the sale of AES Brasil, prior year interest recognized on Stabilization Fund receivables in Chile, and lower short-term investments at lower rates in Argentina;\n•\nHigher foreign currency translation losses of $56 million primarily related to depreciation of the Argentine peso and appreciation of the Colombian peso;\n•\nLower other income of $51 million primarily related to a prior year indexation adjustment of Stabilization Fund receivables at AES Andes, a decrease in AFUDC at our U.S. utilities, and the prior year impacts of a gain on commencement of a sales-type lease on land, insurance proceeds, and a gain on contract termination, partially offset by a write-off of contingent consideration for a renewables project no longer viable at AES Andes;\n•\nOne-time restructuring costs of $50 million; and\n•\nOther non-operating expense of $42 million due to an impairment of the Uplight equity method investment and adjustments to the convertible notes and related embedded derivative feature included within the convertible notes for Uplight, as well as an other-than-temporary impairment of convertible notes for 5B.\nThese decreases were partially offset by:\n•\nDerecognition of a valuation allowance on the loan receivable accounted for under ASC 310 upon reclassifying Mong Duong from held-for-sale to held and used of $127 million;\n•\nHigher income tax benefit of $105 million due to a lower effective tax rate, mainly driven by tax credit transfers; and\n•\nHigher margins from the Renewables SBU of $74 million, excluding one-time restructuring costs, primarily due to increased revenue from new projects.\n59 | The AES Corporation | September 30, 2025 Form 10-Q\nSBU Performance Analysis\n \nNon-GAAP Measures\nEBITDA, Adjusted EBITDA, Adjusted EBITDA with Tax Attributes, Adjusted PTC, and Adjusted EPS are non-GAAP supplemental measures that are used by management and external users of our condensed consolidated financial statements such as investors, industry analysts, and lenders.\nDuring the first quarter of 2025, the Company updated the definitions of Adjusted EBITDA, Adjusted PTC, and Adjusted EPS to exclude costs directly associated with a major restructuring program, including, but not limited to, workforce reduction efforts. These restructuring initiatives to streamline our organization and right-size our development company would result in significant incremental costs above normal operations, and the inclusion of such costs would result in a lack of comparability in our results of operations and could be misleading to investors. We believe excluding these costs associated with a major restructuring initiative better reflects the underlying business performance of the Company.\nFor the year ended December 31, 2024, the Company updated the definitions of EBITDA and Adjusted EBITDA to include accretion of AROs in the \ndepreciation and amortization\n add-back. We believe excluding accretion of AROs from these metrics better reflects the underlying business performance of the Company and is aligned with the metrics of our industry peers. For comparability and consistency, all prior period EBITDA and Adjusted EBITDA measures have been recast to conform to the current presentation. The impact of this update resulted in an increase to Adjusted EBITDA of $6 million and $17 million, respectively, for the three and nine months ended September 30, 2024.\nDuring the first quarter of 2024, the Company updated the definitions of Adjusted EBITDA, Adjusted PTC, and Adjusted EPS add-back (a) \nunrealized gains or losses related to derivative transactions and equity securities\n to include financial assets and liabilities measured using the fair value option, and updated add-back (e) \ngains, losses, and costs due to the early retirement of debt\n to include troubled debt restructuring. We believe excluding these gains or losses better reflects the underlying business performance of the Company. The Company also removed the adjustment for net gains at Angamos, one of our businesses in the Energy Infrastructure SBU, associated with the early contract terminations with Minera Escondida and Minera Spence. As this adjustment was specific to certain contract terminations that occurred in 2020, we believe removing this adjustment from our non-GAAP definitions provides simplification and clarity for our investors. There were no such impacts in 2024.\nEBITDA, Adjusted EBITDA and Adjusted EBITDA with Tax Attributes\n \nWe define EBITDA as earnings before interest income and expense, taxes, depreciation, amortization, and accretion of AROs. We define Adjusted EBITDA as EBITDA adjusted for the impact of NCI and interest, taxes, depreciation, amortization, and accretion of AROs of our equity affiliates, adding back interest income recognized under service concession arrangements, and excluding gains or losses of both consolidated entities and entities accounted for under the equity method due to (a) unrealized gains or losses pertaining to derivative transactions, equity securities, and financial assets and liabilities measured using the fair value option; (b) unrealized foreign currency gains or losses; (c) gains, losses, benefits and costs associated with dispositions and acquisitions of business interests, including early plant closures, and gains and losses recognized at commencement of sales-type leases; (d) losses due to impairments; (e) gains, losses, and costs due to the early retirement of debt or troubled debt restructuring; and (f) costs directly associated with a major restructuring program, including, but not limited to, workforce reduction efforts. \nIn addition to the revenue and cost of sales reflected in Operating Margin, Adjusted EBITDA includes the other components of our Consolidated Statement of Operations, such as \ngeneral and administrative expenses\n in Corporate and Other as well as business development costs, \nother expense\n and \nother income,\n \nrealized foreign currency transaction gains and losses,\n and \nnet equity in earnings (losses) of affiliates\n.\nWe further define Adjusted EBITDA with Tax Attributes as Adjusted EBITDA, adding back the pre-tax effect of Production Tax Credits (“PTCs”), Investment Tax Credits (“ITCs”), and depreciation tax deductions allocated to tax equity investors, as well as the tax benefit recorded from tax credits retained or transferred to third parties.\nThe GAAP measure most comparable to EBITDA, Adjusted EBITDA, and Adjusted EBITDA with Tax Attributes is \nNet income\n. We believe that EBITDA, Adjusted EBITDA, and Adjusted EBITDA with Tax Attributes better reflect the underlying business performance of the Company. Adjusted EBITDA is the most relevant measure considered in the Company’s internal evaluation of the financial performance of its segments. Factors in this determination include the variability due to unrealized gains or losses pertaining to derivative transactions, equity securities, or financial \n60 | The AES Corporation | September 30, 2025 Form 10-Q\nassets and liabilities remeasurement, unrealized foreign currency gains or losses, losses due to impairments, strategic decisions to dispose of or acquire business interests, retire debt, or implement restructuring initiatives, and the variability of allocations of earnings to tax equity investors, which affect results in a given period or periods. In addition, each of these metrics represents the business performance of the Company before the application of statutory income tax rates and tax adjustments, including the effects of tax planning, corresponding to the various jurisdictions in which the Company operates. Given its large number of businesses and overall complexity, the Company concluded that Adjusted EBITDA is a more transparent measure than \nNet income\n that better assists investors in determining which businesses have the greatest impact on the Company’s results. \nEBITDA, Adjusted EBITDA, and Adjusted EBITDA with Tax Attributes should not be construed as alternatives to \nNet income\n, which is determined in accordance with GAAP.\nThree Months Ended September 30,\nNine Months Ended September 30,\nReconciliation of Adjusted EBITDA and Adjusted EBITDA with Tax Attributes (in millions)\n2025\n2024\n2025\n2024\nNet income\n$\n517 \n$\n215 \n$\n294 \n$\n646 \nIncome tax expense (benefit)\n(226)\n103 \n(42)\n52 \nInterest expense\n348 \n379 \n1,042 \n1,125 \nInterest income\n(76)\n(119)\n(215)\n(312)\nDepreciation, amortization, and accretion of AROs\n365 \n312 \n1,056 \n945 \nEBITDA\n$\n928 \n$\n890 \n$\n2,135 \n$\n2,456 \nLess: Loss from disposal of discontinued businesses\n37 \n7 \n37 \n7 \nLess: Adjustment for noncontrolling interests and redeemable stock of subsidiaries \n(1)\n(238)\n(233)\n(625)\n(579)\nLess: Income tax expense (benefit), interest expense (income) and depreciation, amortization, and accretion of AROs from equity affiliates\n39 \n31 \n120 \n93 \nInterest income recognized under service concession arrangements\n15 \n16 \n44 \n49 \nUnrealized derivatives, equity securities, and financial assets and liabilities losses (gains)\n(20)\n(47)\n112 \n(185)\nUnrealized foreign currency losses (gains)\n2 \n7 \n(1)\n10 \nDisposition/acquisition losses (gains)\n5 \n(11)\n172 \n8 \nImpairment losses\n61 \n37 \n7 \n86 \nLoss on extinguishment of debt and troubled debt restructuring\n1 \n1 \n13 \n51 \nRestructuring costs\n— \n— \n88 \n— \nAdjusted EBITDA\n \n(1)\n$\n830 \n$\n698 \n$\n2,102 \n$\n1,996 \nTax attributes\n426 \n476 \n988 \n895 \nAdjusted EBITDA with Tax Attributes \n(2)\n$\n1,256 \n$\n1,174 \n$\n3,090 \n$\n2,891 \n______________________________\n(1)        \nThe allocation of earnings and losses to tax equity investors from both consolidated entities and equity affiliates is removed from Adjusted EBITDA. NCI also excludes amounts allocated to preferred shareholders during the construction phase before a project becomes operational, as this is akin to a financing arrangement.\n(2)         \nAdjusted EBITDA with Tax Attributes includes the impact of the share of the ITCs, PTCs, and depreciation deductions allocated to tax equity investors under the HLBV accounting method and recognized as \nNet loss (income) attributable to noncontrolling interests and redeemable stock of subsidiaries \non the Condensed Consolidated Statements of Operations. It also includes the tax benefit recorded from tax credits retained or transferred to third parties. The tax attributes are related to the Renewables and Utilities SBUs.\n61 | The AES Corporation | September 30, 2025 Form 10-Q\nAdjusted PTC\nWe define Adjusted PTC as pre-tax income from continuing operations attributable to The AES Corporation excluding gains or losses of the consolidated entity due to (a) unrealized gains or losses pertaining to derivative transactions, equity securities, and financial assets and liabilities measured using the fair value option; (b) unrealized foreign currency gains or losses; (c) gains, losses, benefits, and costs associated with dispositions and acquisitions of business interests, including early plant closures, and gains and losses recognized at commencement of sales-type leases; (d) losses due to impairments; (e) gains, losses, and costs due to the early retirement of debt or troubled debt restructuring; and (f) costs directly associated with a major restructuring program, including, but not limited to, workforce reduction efforts. Adjusted PTC also includes net equity in earnings of affiliates on an after-tax basis adjusted for the same gains or losses excluded from consolidated entities. \nAdjusted PTC reflects the impact of NCI and excludes the items specified in the definition above. In addition to the revenue and cost of sales reflected in Operating Margin, Adjusted PTC includes the other components of our Consolidated Statement of Operations, such as \ngeneral and administrative expenses\n in Corporate and Other as well as business development costs, \ninterest expense\n and \ninterest income,\n \nother expense\n and \nother income,\n \nrealized foreign currency transaction gains and losses,\n and \nnet equity in earnings (losses) of affiliates\n.\nThe GAAP measure most comparable to Adjusted PTC is \nIncome from continuing operations attributable to The AES Corporation\n. We believe that Adjusted PTC better reflects the underlying business performance of the Company and is a relevant measure considered in the Company’s internal evaluation of the financial performance \n62 | The AES Corporation | September 30, 2025 Form 10-Q\nof its segments. Factors in this determination include the variability due to unrealized gains or losses pertaining to derivative transactions, equity securities, or financial assets and liabilities remeasurement, unrealized foreign currency gains or losses, losses due to impairments, and strategic decisions to dispose of or acquire business interests, retire debt, or implement restructuring initiatives, which affect results in a given period or periods. In addition, Adjusted PTC represents the business performance of the Company before the application of statutory income tax rates and tax adjustments, including the effects of tax planning, corresponding to the various jurisdictions in which the Company operates. Given its large number of businesses and complexity, the Company concluded that Adjusted PTC is a more transparent measure than \nIncome from continuing operations attributable to The AES Corporation \nthat better assists investors in determining which businesses have the greatest impact on the Company’s results.\n Adjusted PTC should not be construed as an alternative to \nIncome from continuing operations attributable to The AES Corporation\n, which is determined in accordance with GAAP.\nThree Months Ended September 30,\nNine Months Ended September 30,\nReconciliation of Adjusted PTC (in millions)\n2025\n2024\n2025\n2024\nIncome from continuing operations, net of tax, attributable to The AES Corporation\n$\n676 \n$\n511 \n$\n627 \n$\n1,219 \nIncome tax expense (benefit) from continuing operations attributable to The AES Corporation\n(253)\n82 \n(109)\n(4)\nPre-tax contribution\n423 \n593 \n518 \n1,215 \nUnrealized derivatives, equity securities, and financial assets and liabilities losses (gains)\n(20)\n(47)\n108 \n(185)\nUnrealized foreign currency losses (gains)\n2 \n7 \n(1)\n10 \nDisposition/acquisition losses (gains)\n5 \n(11)\n172 \n8 \nImpairment losses\n61 \n37 \n7 \n86 \nLoss on extinguishment of debt and troubled debt restructuring\n4 \n3 \n20 \n57 \nRestructuring costs\n— \n— \n88 \n— \nAdjusted PTC\n$\n475 \n$\n582 \n$\n912 \n$\n1,191 \n63 | The AES Corporation | September 30, 2025 Form 10-Q\nAdjusted EPS\nWe define Adjusted EPS as diluted earnings per share from continuing operations excluding gains or losses of both consolidated entities and entities accounted for under the equity method due to (a) unrealized gains or losses pertaining to derivative transactions, equity securities, and financial assets and liabilities measured using the fair value option; (b) unrealized foreign currency gains or losses; (c) gains, losses, benefits and costs associated with dispositions and acquisitions of business interests, including early plant closures, and the tax impact from the repatriation of sales proceeds, and gains and losses recognized at commencement of sales-type leases; (d) losses due to impairments; (e) gains, losses, and costs due to the early retirement of debt or troubled debt restructuring; and (f) costs directly associated with a major restructuring program, including, but not limited to, workforce reduction efforts. \nThe GAAP measure most comparable to Adjusted EPS is \nDiluted earnings per share from continuing operations\n. We believe that Adjusted EPS better reflects the underlying business performance of the Company and is considered in the Company’s internal evaluation of financial performance. Factors in this determination include the variability due to unrealized gains or losses pertaining to derivative transactions, equity securities, or financial assets and liabilities remeasurement, unrealized foreign currency gains or losses, losses due to impairments, and strategic decisions to dispose of or acquire business interests, retire debt, or implement restructuring initiatives, which affect results in a given period or periods.\nAdjusted EPS should not be construed as an alternative to \nDiluted earnings per share from continuing operations\n, which is determined in accordance with GAAP.\nThe Company reported diluted earnings per share of $0.94 and $0.86 for the three and nine months ended September 30, 2025, respectively. For purposes of measuring earnings per share under U.S. GAAP, income available to AES common stockholders is reduced by increases in the carrying amount of redeemable stock of subsidiaries to redemption value and increased by decreases in the carrying amount to the extent they represent recoveries of amounts previously reflected in the computation of earnings per share. While the adjustments for the three and nine months ended September 30, 2025 decreased earnings per share, neither adjustment impacted \nNet income\n on the Condensed Consolidated Statement of Operations. For purposes of computing Adjusted EPS, the Company excluded the adjustment to redemption value from the numerator. The table below reconciles the income available to AES common stockholders used in GAAP diluted earnings per share to the income from continuing operations used in calculating the non-GAAP measure of Adjusted EPS.\n64 | The AES Corporation | September 30, 2025 Form 10-Q\nReconciliation of Numerator Used for Adjusted EPS\nThree months ended September 30, 2025\nNine months ended September 30, 2025\n(in millions, except per share data)\nIncome\nShares\n$ per Share\nIncome\nShares\n$ per Share\nGAAP DILUTED EARNINGS PER SHARE\nIncome from continuing operations available to The AES Corporation common stockholders\n$\n671 \n712 \n$\n0.94 \n$\n612 \n712 \n$\n0.86 \nAdd back: Increase in redemption value of redeemable stock of subsidiaries\n5 \n— \n0.01 \n15 \n— \n0.02 \nNON-GAAP DILUTED EARNINGS PER SHARE BEFORE EFFECT OF DILUTIVE SECURITIES\n$\n676 \n712 \n$\n0.95 \n$\n627 \n712 \n$\n0.88 \nRestricted stock units\n— \n2 \n— \n— \n2 \n— \nNON-GAAP DILUTED EARNINGS PER SHARE\n$\n676 \n714 \n$\n0.95 \n$\n627 \n714 \n$\n0.88 \nThree Months Ended September 30,\nNine Months Ended September 30,\nReconciliation of Adjusted EPS\n2025\n2024\n2025\n2024\nDiluted earnings per share from continuing operations\n$\n0.95 \n$\n0.72 \n$\n0.88 \n$\n1.71 \nUnrealized derivatives, equity securities, and financial assets and liabilities losses (gains)\n(0.03)\n(1)\n(0.06)\n(2)\n0.16 \n(3)\n(0.26)\n(4)\nUnrealized foreign currency losses (gains)\n— \n0.01 \n— \n0.02 \nDisposition/acquisition losses (gains)\n0.01 \n(0.02)\n0.24 \n(5)\n0.01 \n(6)\nImpairment losses\n0.09 \n(7)\n0.05 \n(8)\n0.01 \n(9)\n0.12 \n(10)\nLoss on extinguishment of debt and troubled debt restructuring\n0.01 \n— \n0.03 \n0.08 \n(11)\nRestructuring costs\n— \n— \n0.12 \n(12)\n— \nLess: Net income tax expense (benefit)\n(0.28)\n(13)\n0.01 \n0.09 \n(14)\n(0.08)\n(15)\nAdjusted EPS\n$\n0.75 \n$\n0.71 \n$\n1.53 \n$\n1.60 \n_____________________________\n(1)\nAmount primarily relates to unrealized derivative gains on commodities at AES Clean Energy of $15 million, or $0.02 per share, and net unrealized derivative gains at the Energy Infrastructure SBU of $12 million, or $0.02 per share.\n(2)\nAmount primarily relates to net unrealized derivative gains at the Energy Infrastructure SBU of $50 million, or $0.07 per share, and unrealized gains on commodity derivatives at AES Clean Energy of $17 million, or $0.02 per share, partially offset by unrealized losses on foreign currency derivatives at Corporate of $17 million, or $0.02 per share.\n(3)\nAmount primarily relates to remeasurement of our investment in 5B of $48 million, or $0.07 per share, and net unrealized derivative losses at the Energy Infrastructure SBU of $34 million, or $0.05 per share.\n(4)\nAmount primarily relates to net unrealized derivative gains at the Energy Infrastructure SBU of $109 million, or $0.15 per share, unrealized gains on commodity derivatives at AES Clean Energy of $33 million, or $0.05 per share, unrealized gains on cross currency swaps in Brazil of $28 million, or $0.04 per share, and unrealized gains on foreign currency derivatives at Corporate of $20 million, or $0.03 per share.\n(5)\nAmount primarily relates to day-one losses on commencement of sales-type leases at AES Clean Energy Development of $153 million, or $0.21 per share, and AES Renewable Holdings of $11 million, or $0.02 per share, and losses on remeasurement of contingent consideration at AES Clean Energy of $15 million, or $0.02 per share, partially offset by gain on sale of Dominican Republic Renewables of $45 million, or $0.06 per share, and write-off of contingent consideration for a renewables development project at AES Andes of $10 million, or $0.01 per share.\n(6)\nAmount primarily relates to day-one losses at commencement of sales-type leases at AES Renewable Holdings of $63 million, or $0.09 per share, and the loss on partial sale of our ownership interest in Amman East and IPP4 in Jordan of $10 million, or $0.01 per share, partially offset by a gain on dilution of ownership in Uplight due to its acquisition of AutoGrid of $52 million, or $0.07 per share.\n(7)\nAmount primarily relates to $32 million, or $0.05, at Uplight related to an impairment of the equity method investment and adjustments to the convertible notes and related embedded derivative feature included within the convertible notes, impairments at a renewables development project at AES Andes of $16 million, or $0.02 per share, and AES Clean Energy Development projects of $11 million, or $0.02 per share.\n(8)\nAmount primarily relates to impairment of AES Brasil of $26 million, or $0.04 per share, and impairment at Mong Duong of $6 million, or $0.01 per share.\n(9)\nAmount primarily relates to impairments at AES Clean Energy Development projects of $61 million, or $0.09 per share, $32 million, or $0.05, at Uplight related to an impairment of the equity method investment and adjustments to the convertible notes and related embedded derivative feature included within the convertible notes, impairments at a renewables development project at AES Andes of $16 million, or $0.02 per share, and Mong Duong of $9 million, or $0.01 per share, partially offset by the derecognition of the valuation allowance on a loan receivable accounted for under ASC 310 and the elimination of estimated costs to sell at Mong Duong of $127 million, or $0.18 per share, after reclassification to held and used.\n(10)\nAmount primarily relates to impairment of AES Brasil of $38 million, or $0.05 per share, and impairment at Mong Duong of $28 million, or $0.04 per share.\n(11)\nAmount primarily relates to losses incurred at AES Andes due to early retirement of debt $29 million, or $0.04 per share, and costs incurred due to troubled debt restructuring at Puerto Rico of $20 million, or $0.03 per share.\n(12)\nAmount primarily relates to severance costs associated with the Company-wide restructuring program of $50 million, or $0.07 per share, and impairments at AES Clean Energy Development that were the result of the Company’s restructuring program of $38 million, or $0.05 per share.\n(13)\nAmount primarily relates to income tax benefit associated with day-one losses on commencement of sales-type leases at AES Clean Energy Development of $78 million, or $0.11 per share, impairments at AES Clean Energy Development projects of $44 million, or $0.06 per share, severance costs related to the Company-wide restructuring program of $19 million, or $0.03 per share, remeasurement of our investment in 5B of $18 million, or $0.03 per share, and net unrealized derivative losses at Integrated Energy of $18 million, or $0.02 per share.\n(14)\nAmount primarily relates to income tax expense associated with the AES Ohio selldown of $13 million, or $0.02 per share, day-one losses on commencement of sales-type leases at AES Clean Energy Development of $17 million, or $0.02 per share, impairments at AES Clean Energy Development projects of $11 million, or $0.02 per share, remeasurement of our investment in 5B of $9 million, or $0.01 per share, and severance costs related to the Company-wide restructuring program of $4 million, or $0.01 per share.\n(15)\nAmount primarily relates to income tax benefits associated with the tax over book investment basis differences related to the AES Brasil held-for-sale classification of $59 million, or $0.08 per share.\n65 | The AES Corporation | September 30, 2025 Form 10-Q\nRenewables SBU\nThe following table summarizes Operating Margin, Adjusted EBITDA, and Adjusted EBITDA with Tax Attributes (in millions) for the periods indicated:\nThree Months Ended September 30,\nNine Months Ended September 30,\n2025\n2024\n$ Change\n% Change\n2025\n2024\n$ Change\n% Change\nOperating Margin\n$\n213 \n$\n189 \n$\n24 \n13 \n%\n$\n371 \n$\n352 \n$\n19 \n5 \n%\nAdjusted EBITDA\n (1)\n296 \n214 \n82 \n38 \n%\n697 \n479 \n218 \n46 \n%\nAdjusted EBITDA with Tax Attributes\n (1)\n717 \n689 \n28 \n4 \n%\n1,612 \n1,357 \n255 \n19 \n%\n_____________________________\n(1)    \nA non-GAAP financial measure. See \nSBU Performance Analysis—Non-GAAP Measures\n for definition.\nOperating Margin for the three months ended September 30, 2025 increased $24 million. This increase was mainly driven by an $80 million positive impact from new businesses in the U.S. and Chile and a $20 million impact of the results of AES Andes moving to Renewables in 2025; partially offset by a $66 million impact from the sale of AES Brasil in 2024 and a $14 million increase in fixed costs primarily due to an accelerated growth plan.\nAdjusted EBITDA for the three months ended September 30, 2025 increased $82 million, primarily due to the drivers mentioned above, adjusted for NCI, unrealized derivatives, and depreciation, as well as higher Adjusted EBITDA from equity affiliates.\nAdjusted EBITDA with Tax Attributes for the three months ended September 30, 2025 increased $28 million, primarily driven by the increase in Adjusted EBITDA explained above, partially offset by lower tax attributes realized in the current quarter due to timing of tax attribute recognition. During the three months ended September 30, 2025 and 2024, we realized $421 million and $475 million, respectively, from tax attributes earned by our U.S. renewables business.\nOperating Margin for the nine months ended September 30, 2025 increased $19 million. This increase was primarily driven by $147 million positive impact from new businesses, $42 million impact of the results of AES Andes moving to Renewables in 2025, $36 million due to higher generation in Panama as a result of better hydrological conditions during the first quarter of 2025, and a $26 million increase in Colombia as a result of increased availability and lower spot prices on energy purchases in the second quarter of 2025. These positive impacts were partially offset by a $150 million negative impact from the sale of AES Brasil in 2024, a $46 million negative impact related to changes in mark-to-market of energy derivatives, a $33 million increase in fixed costs primarily related to an accelerated growth plan, and $17 million of one-time costs due to restructuring.\nAdjusted EBITDA for the nine months ended September 30, 2025 increased $218 million, primarily due to the drivers mentioned above, adjusted for NCI, unrealized derivatives, restructuring costs, and depreciation, as well as higher Adjusted EBITDA from equity affiliates.\nAdjusted EBITDA with Tax Attributes for the nine months ended September 30, 2025 increased $255 million, primarily driven by the increase in Adjusted EBITDA explained above, and higher tax attributes realized in the current year due to timing of tax attribute recognition. During the nine months ended September 30, 2025 and 2024, we realized $915 million and $878 million, respectively, from tax attributes earned by our U.S. renewables business.\nUtilities SBU\nThe following table summarizes Operating Margin, Adjusted EBITDA, Adjusted EBITDA with Tax Attributes, and Adjusted PTC (in millions) for the periods indicated:\nThree Months Ended September 30,\nNine Months Ended September 30,\n2025\n2024\n$ Change\n% Change\n2025\n2024\n$ Change\n% Change\nOperating Margin\n$\n197 \n$\n165 \n$\n32 \n19 \n%\n$\n488 \n$\n441 \n$\n47 \n11 \n%\nAdjusted EBITDA\n (1)\n240 \n223 \n17 \n8 \n%\n659 \n619 \n40 \n6 \n%\nAdjusted EBITDA with Tax Attributes \n(1)\n245 \n224 \n21 \n9 \n%\n732 \n636 \n96 \n15 \n%\nAdjusted PTC \n(1) (2)\n98 \n73 \n25 \n34 \n%\n276 \n197 \n79 \n40 \n%\n____________________________\n(1)    \nA non-GAAP financial measure. See \nSBU Performance Analysis—Non-GAAP Measures\n for definition.\n(2)    \nAdjusted PTC remains a key metric used by management for analyzing our businesses in the utilities industry\n.\n66 | The AES Corporation | September 30, 2025 Form 10-Q\nOperating Margin for the three months ended September 30, 2025 increased $32 million, mainly driven by $47 million due to higher transmission and rider revenues and deferral of costs in the current year, which were recognized in the prior year, related with AES Ohio’s distribution rate case settlement. This increase is partially offset by $9 million decrease due to higher depreciation and amortization expense from additional assets placed in service and $9 million decrease from higher fixed costs mainly driven by higher property taxes due to higher assessed values.\nAdjusted EBITDA for the three months ended September 30, 2025 increased $17 million, primarily due to the drivers above, adjusted for NCI, including the impact of the AES Ohio selldown, and depreciation.\nAdjusted EBITDA with Tax Attributes for the three months ended September 30, 2025 increased $21 million, mainly driven by the drivers above, as well as a $4 million increase in realized tax attributes, primarily related to the Pike County BESS project in the current year.\nAdjusted PTC for the three months ended September 30, 2025 increased $25 million due to the drivers above, as well as a decrease in interest expense, adjusted for NCI, including the impact of the AES Ohio selldown.\nOperating Margin for the nine months ended September 30, 2025 increased $47 million, mainly driven by $126 million due to higher retail rates as a result of the 2024 Base Rate Order, including the impact of certain riders now included in base rate; increase in transmission and rider revenues; and favorable margin due to higher demand due to the impact of weather. These increases are partially offset by $32 million decrease due to higher depreciation and amortization expense from additional assets placed in service, $17 million decrease due to the impact of planned outages, $16 million decrease from higher fixed costs mainly driven by higher property taxes due to higher assessed values, and $15 million decrease due to higher credit losses.\nAdjusted EBITDA for the nine months ended September 30, 2025 increased $40 million, primarily due to the drivers above, adjusted for NCI, depreciation, and restructuring costs.\nAdjusted EBITDA with Tax Attributes for the nine months ended September 30, 2025 increased $96 million, mainly driven by the drivers above, as well as a $56 million increase in realized tax attributes, primarily related to the Pike County BESS project in the current year.\nAdjusted PTC for the nine months ended September 30, 2025 increased $79 million due to the drivers above, partially offset by higher depreciation expense.\nEnergy Infrastructure SBU\nThe following table summarizes Operating Margin and Adjusted EBITDA (in millions) for the periods indicated:\nThree Months Ended September 30,\nNine Months Ended September 30,\n2025\n2024\n$ Change\n% Change\n2025\n2024\n$ Change\n% Change\nOperating Margin\n$\n288 \n$\n345 \n$\n(57)\n-17 \n%\n$\n653 \n$\n997 \n$\n(344)\n-35 \n%\nAdjusted EBITDA\n (1)\n301 \n290 \n11 \n4 \n%\n809 \n949 \n(140)\n-15 \n%\n_____________________________\n(1)    \nA non-GAAP financial measure. See \nSBU Performance Analysis—Non-GAAP Measures\n for definition.\nOperating Margin for the three months ended September 30, 2025 decreased $57 million, driven by $29 million of lower generation due to dispatch, $20 million of prior year operating margin at AES Andes, which is reported in the Renewables SBU beginning in 2025, and $9 million driven by lower LNG sales; partially offset by $12 million of higher contract margin driven by lower fuel costs.\nAdjusted EBITDA for the three months ended September 30, 2025 increased $11 million, primarily due to the increase in ownership of Cochrane and equity earnings due to Gatun starting commercial operations, partially offset by the decrease in Operating Margin described above, adjusted for unrealized derivatives.\nOperating Margin for the nine months ended September 30, 2025 decreased $344 million, driven by $160 million higher prior year revenues from the monetization of the Warrior Run coal plant PPA, $117 million due to prior year net derivative gains as part of our commercial hedging strategy, $42 million of prior year operating margin at AES Andes, which is reported in the Renewables SBU beginning in 2025, $28 million of lower generation mainly driven by dispatch, $20 million of one-time costs due to restructuring, and $17 million due to the prior year selldown of Amman East and IPP4 in Jordan; partially offset by an increase of $45 million driven by higher availability due to lower maintenance in 2025.\nAdjusted EBITDA for the nine months ended September 30, 2025 decreased $140 million, primarily due to the drivers above adjusted for NCI, unrealized derivatives, and restructuring costs; partially offset by the increase in \n67 | The AES Corporation | September 30, 2025 Form 10-Q\nownership of Cochrane and higher equity earnings due to Gatun starting commercial operations.\nNew Energy Technologies SBU\nThe following table summarizes Operating Margin and Adjusted EBITDA (in millions) for the periods indicated:\nThree Months Ended September 30,\nNine Months Ended September 30,\n2025\n2024\n$ Change\n% Change\n2025\n2024\n$ Change\n% Change\nOperating Margin\n$\n(2)\n$\n(1)\n$\n(1)\n100 \n%\n$\n(6)\n$\n(5)\n$\n(1)\n-20 \n%\nAdjusted EBITDA\n (1)\n(3)\n(7)\n4 \n-57 \n%\n(45)\n(38)\n(7)\n-18 \n%\n_____________________________\n(1)    \nA non-GAAP financial measure. See \nSBU Performance Analysis—Non-GAAP Measures\n for definition.\nOperating Margin for the three months ended September 30, 2025 decreased $1 million, with no material drivers.\nAdjusted EBITDA for the three months ended September 30, 2025 increased $4 million, with no material drivers.\nOperating Margin for the nine months ended September 30, 2025 decreased $1 million, with no material drivers.\nAdjusted EBITDA for the nine months ended September 30, 2025 decreased $7 million, primarily due to higher net losses at Fluence, partially offset by a decrease in general and administrative expenses, mostly due to lower people costs following the restructuring. The increased losses at Fluence were mainly driven by a decline in sales, reflecting lower volumes fulfilled due to the timing of customer schedules.\nKey Trends and Uncertainties\n \nDuring 2025 and beyond, we expect to face the following challenges at certain of our businesses. Management expects that improved operating performance at certain businesses, growth from new businesses, and global cost reduction initiatives may lessen or offset their impact. If these favorable effects do not occur, or if the challenges described below and elsewhere in this section impact us more significantly than we currently anticipate, or if volatile foreign currencies and commodities move more unfavorably, then these adverse factors (or other adverse factors unknown to us) may have a material impact on our operating margin, net income attributable to The AES Corporation, and cash flows. We continue to monitor our operations and address challenges as they arise. For the risk factors related to our business, see Item 1.\n—Business \nand Item 1A.\n—Risk Factors\n of our 2024 Form 10-K.\nOperational\nTrade Restrictions and Supply Chain \n— In April 2022, the U.S. Department of Commerce (“Commerce”) initiated an investigation into whether imports into the U.S. of solar cells and panels from Cambodia, Malaysia, Thailand, and Vietnam (“Southeast Asia”) were circumventing antidumping and countervailing duty (“AD/CVD”) orders on solar cells and panels from China. In August 2023, Commerce rendered final affirmative findings of circumvention with respect to all four countries, which resulted in the imposition of AD and CVD duties on certain imported cells and panels from Southeast Asia. Commerce’s determination and related matters remain the subject of ongoing litigation before the U.S. Court of International Trade and the U.S. Court of Appeals for the Federal Circuit.\nIn 2024, Commerce and the U.S. International Trade Commission (“U.S. ITC”) initiated new AD/CVD investigations on solar cells and panels imported from Southeast Asia. On April 18, 2025, Commerce rendered final affirmative determinations and AD/CVD rates with respect to all four countries. On June 13, 2025, the U.S. ITC issued its determination that imports from Malaysia and Vietnam have injured the U.S. industry and that imports from Cambodia and Thailand threaten injury. Commerce then issued orders on June 24, 2025, implementing the AD/CVD rates, which will be subject to annual review by Commerce. We do not expect these AD/CVD orders will have a negative impact on our business.\nSeparately, the U.S. maintains a global safeguard tariff (currently 14% ad valorem) on solar cells and modules pursuant to the Section 201 Safeguard Action on crystalline silicon photovoltaic products, which became effective in February 2018. On June 21, 2024, President Biden issued Proclamation 10779, revoking the exclusion of bifacial panels from safeguard relief previously proclaimed in Proclamation 10339, and reinstating the tariff on bifacial panels under the Section 201 Safeguard Action, subject to certain qualifications. These global tariffs are expected to expire in February 2026.\n68 | The AES Corporation | September 30, 2025 Form 10-Q\nThe U.S. also maintains Section 301 tariffs on certain Chinese made lithium-ion batteries and related components utilized for energy storage systems, with such tariff currently set at 7.5% and increasing to 25% effective January 1, 2026. There are also ongoing AD/CVD investigations with respect to exports by China of natural and synthetic graphite used to make lithium-ion battery anode material. Final ITC and Commerce AD/CVD determinations in these investigations are expected in the first quarter of 2026 and could result in price increases.\nAdditionally, the Uyghur Forced Labor Prevention Act (“UFLPA”) seeks to block the import of products made with forced labor in certain areas of China, at any point in the supply chain, and may lead to certain suppliers being blocked from importing solar cells and panels into the U.S. While this has impacted the U.S. market, AES has managed this issue without significant impact to our projects. Further forced labor designations of entities under the UFLPA may impact our suppliers’ ability or willingness to meet their contractual agreements or to continue to supply cells or panels into the U.S. market on terms that we deem satisfactory.\nThe Trump Administration has threatened or imposed tariffs on a wide range of countries and products. On February 10, 2025, President Trump signed Executive Orders modifying existing Section 232 tariffs on steel and aluminum imports to expand their scope and impose 25% tariffs on both products. The President raised these rates to 50% effective June 4, 2025. At this time, we do not expect the modifications to tariffs on steel and aluminum to have a material impact on our business. \nOn February 1, 2025, President Trump issued an Executive Order declaring a national emergency under the International Emergency Economic Powers Act (“IEEPA”) with respect to U.S. importation of fentanyl. The President imposed a 10% additional tariff on imports from China, effective February 4, 2025. Effective March 4, 2025, this tariff was increased to 20%. \nOn April 2, 2025, President Trump issued an Executive Order pursuant to IEEPA imposing an indefinite, baseline reciprocal 10% tariff on almost all goods imported into the U.S., effective April 5, 2025, and individualized higher IEEPA tariffs (11% to 50%) starting April 9, 2025 on goods originating from 57 countries with trade surpluses with the U.S. On April 9, 2025, the U.S. government issued a further Executive Order increasing the IEEPA reciprocal tariff on China to 125% effective April 10, 2025. Concurrently, the U.S. government announced a temporary suspension of the country-specific reciprocal tariff measures targeting most U.S. trading partners for a 90-day period, or until July 9, 2025, which was later extended until August 1, 2025. Effective May 14, 2025, the IEEPA reciprocal tariff rate applicable to China was lowered to 10%. IEEPA reciprocal tariffs, at various levels, have now gone into effect for most U.S. trading partners.\nSeveral trading partners (including the EU, Japan, South Korea, and the UK) have reached bilateral trade agreements with the U.S. The ultimate outcome of any reciprocal or other tariffs with countries that have not yet reached such trade agreements with the U.S. is uncertain. Also, the Supreme Court will hold oral argument on November 5, 2025, on the legality of the IEEPA tariffs, following lower court decisions declaring the tariffs unlawful.\nIn July 2025, Commerce initiated an investigation to determine the effects on national security of imports of polysilicon and its derivatives, pursuant to Section 232 of the Trade Expansion Act of 1962 (“Section 232”). In August 2025, Commerce initiated a separate investigation under Section 232 to determine the effects on national security of imports of wind turbines and their parts and components.\n \nThe outcomes of these investigations are uncertain.\nWe expect the tariffs on imports from China will increase overall costs for materials and parts that are imported to build and maintain renewable energy plants for the U.S. industry. However, AES has already shifted its supply chain outside of China for the vast majority of final products used to build and maintain renewable energy plants in the U.S. We expect limited impact to projects scheduled to become operational in 2025 through 2027 due to the recently announced tariffs on China.\n \nThe impact of new tariffs, reciprocal tariffs, or Commerce investigations, the impact of any additional adverse Commerce determinations or other tariff disputes or litigation, the impact of the UFLPA, potential future disruptions to the renewable energy supply chain and their effect on AES’ U.S. project development and construction activities remain uncertain. AES will continue to monitor developments and take prudent steps towards maintaining a robust supply chain for our renewable energy projects. To that end, we have accelerated imports into the U.S. and increased our contracting for U.S. domestically manufactured solar panels, batteries, wind turbines, trackers, and other equipment, significantly mitigating the potential impacts from reciprocal tariffs or other tariffs.\nMore specifically, we have contracted and imported into the U.S. all of the solar panels that are necessary to complete our U.S. backlog of solar projects scheduled to finish construction and become operational in 2025. For our U.S backlog of solar projects scheduled to finish construction and become operational in 2026 or 2027, we have contracted for most of our panel supply needs, with the majority of such panels being manufactured in the U.S. and \n69 | The AES Corporation | September 30, 2025 Form 10-Q\nmost of the remaining panels have already been imported into the U.S. As for solar projects that are expected to become operational by 2027, based on current assessments and the ramp-up of domestic manufacturing, we anticipate limited purchases of imported PV modules. These imports are expected to be largely insulated from AD/CVD measures and potential Section 232 outcomes, as they are expected to be manufactured using U.S. polysilicon. Imports will exclude modules from countries currently subject to AD/CVD orders or investigations. \nAdditionally, we have contracted and imported into the U.S.\n \nall the batteries needed for our U.S. energy storage projects scheduled to be completed in 2025.\nFor our U.S. backlog of storage projects scheduled to finish construction and become operational in 2026 or 2027, we have contracted all our battery needs, with almost all of such batteries coming from U.S. or Korean suppliers. We are also well advanced in contracting U.S. domestically manufactured battery modules to support the remainder of our U.S. energy storage growth through 2027. \nFor our U.S. backlog of wind projects scheduled to be completed in 2025 through 2026, we have contracted and received delivery of all turbines, and for our 2027 backlog of U.S. wind projects, we are fully contracted with U.S. suppliers and suppliers with primarily U.S. manufactured turbines.\nOperational Sensitivity to Dry Hydrological Conditions \n— Our hydroelectric generation facilities are sensitive to changes in the weather, particularly the level of water inflows into generation facilities. Dry hydrological conditions in Panama, Colombia, and Chile can present challenges for our businesses in these markets. Low inflows can result in low reservoir levels, reduced generation output, and subsequently possible increased prices for electricity. If our hydroelectric generation facilities cannot generate sufficient energy to meet contractual arrangements, we may need to purchase energy to fulfill our obligations, which could have an adverse impact on AES. As mitigation, AES has invested in thermal, wind, and solar generation assets, which have a complementary profile to hydroelectric plants. These plants are expected to have increased generation in low hydrology scenarios, offsetting possible impacts described from hydro assets.\nLa Niña conditions have emerged towards the end of Q3 2025 in the equatorial Pacific, following a period of ENSO-neutral conditions earlier in the year. According to the Climate Prediction Center (“CPC”) and the International Research Institute for Climate and Society (“IRI”), La Niña is expected to persist through the Northern Hemisphere winter (December 2025 to February 2026), with a transition back to ENSO-neutral conditions likely in early 2026. While the developing La Niña is forecasted to be weak, it may still produce regionally significant effects in some areas.\nIn Panama, total system inflows have remained near historical averages, with the Bayano and Fortuna reservoirs however experiencing above-average levels due to abundant rainfall in the northern basins. These favorable conditions have supported strong hydroelectric generation, reduced reliance on thermal generation, and enabled potential surplus energy sales into the spot market. Additionally, reduced dispatch of natural gas-fired units may create opportunities for gas reallocation to international markets.\nIn Colombia, the January to July 2025 period was the wettest since 1977 at key monitoring sites. Reservoir levels remained elevated through Q3, with Chivor and other major reservoirs above seasonal norms. Although August saw a slight decline in rainfall and a rise in spot prices, overall system storage remained robust. The onset of La Niña may bring additional rainfall in Q4, further supporting hydroelectric output and mitigating drought-related risks.\nIn Chile, 2025 is expected to be the third driest year on record. While winter precipitation and snowpack were near average, prolonged drought has kept reservoir levels low, broadly in line with last year’s levels. A weak La Niña may slow snowmelt; however, it is not expected to meaningfully alter near-term hydrological conditions.\nThe exact behavior pattern and strength of weather transitions (from/to La Niña or El Niño) is unknown and therefore the impacts could vary from those described above, and may include impacts to our businesses beyond hydrology, including with respect to power generation from other renewable sources of energy and demand. Even if rainfall and water inflows remain in line with historical averages, in some cases, market prices and generation above or below the average could present due to a variety of factors related to demand, market dynamics, or regulatory impacts. Impacts may be material to our results of operations.\nMacroeconomic and Political\nDuring the past few years, some countries where our subsidiaries conduct business have experienced macroeconomic and political changes. In the event these trends continue, there could be an adverse impact on our businesses.\n70 | The AES Corporation | September 30, 2025 Form 10-Q\nU.S. Tax Law Reform & Renewable Energy Tax Credits \n— On July 4, 2025, the U.S. enacted H.R. 1 (the “2025 Act”). The legislation significantly revised the laws governing U.S. renewable energy tax credits and the U.S. taxation of certain foreign earnings, which may impact our effective tax rate in future periods and could be material. In addition, the 2025 Act included amendments to, and extensions of, various other U.S. corporate income tax provisions including the determination of limitation on interest expense deductions. Any impact may change as U.S. Treasury and Internal Revenue Service (“IRS”) issue additional guidance, which may be material.\nThe U.S. Inflation Reduction Act of 2022 (the “IRA”) included provisions that benefited the U.S. clean energy industry, including increases, extensions, direct transfers, and/or new tax credits for onshore and offshore wind, solar, storage, and hydrogen projects. We account for U.S. renewables projects according to U.S. GAAP, which, when partnering with tax-equity investors to monetize tax benefits, utilizes the HLBV method. This method recognizes the value of the tax credit that benefits the tax equity investors at the time of its creation, which for projects utilizing the investment tax credit, begins in the quarter the renewables project is placed in service. For projects utilizing the production tax credit, this value is recognized over 10 years as the facility produces energy.\nThe 2025 Act amends the phase out of wind and solar ITC and PTC tax credits. Wind and solar renewables projects that begin construction within 12 months of the enactment of the 2025 Act remain eligible for 100% of the credit without the 2027 placed-in-service deadline, provided that, under current Treasury guidance, the projects are placed in service no more than four calendar years after the calendar year when construction began. Renewables projects that begin construction after 12 months of the enactment must be placed in service no later than 2027. Renewables projects that began construction by the end of 2024 are not impacted by the 2025 Act. The 2025 Act does not impose tighter timelines for energy storage projects to qualify for the ITC and PTC, and it allows energy storage projects to receive the full ITC or PTC credit if they begin construction by 2033.\nThe 2025 Act also imposes a restriction precluding credits for renewables projects, including storage, claiming the ITC or PTC credit that start construction after December 31, 2025 and receive material assistance from a prohibited foreign entity, effectively limiting the percentage of total project costs that may be derived from products that are mined, produced or manufactured in China, with varying permissible percentages depending on the calendar year and applicable renewable technology for the project. This restriction also precludes credit eligibility for projects that start construction after December 31, 2024 that are classified as a prohibited foreign entity, including projects over which a specified foreign entity is deemed to exercise formal or effective control.\nFurther, President Trump issued an Executive Order on July 7, 2025 that directed the Secretary of the Treasury to take action to enforce the provisions of the 2025 Act related to issuing updated guidance defining the start of construction for claiming the ITC and PTC and implementing the Foreign Entity of Concern (“FEOC”) Restrictions (the “Treasury Action”). The Executive Order also directed the Secretary of the Interior to take action to review its regulations, guidance, policies, and practices for any preferential treatment of wind and solar projects and eliminate those preferences within 45 days (the “Interior Action”). \nOn August 15, 2025, the Department of Treasury issued updated guidance defining the start of construction for purposes of claiming the ITC and PTC. AES does not expect the modifications to the start of construction guidance to materially impact its projects. The Department of Treasury did not issue guidance implementing the FEOC restrictions, however, guidance is expected to be released within the coming months, which may be material.\nWe expect the vast majority of our renewables project backlog to continue to qualify for the ITC and PTC. However, the Treasury Action may impose additional burdens in qualifying for the ITC and PTC.\nIn response to the Executive Order, the Department of Interior issued a memorandum requiring any “decisions, actions, consultations, and other undertakings” for wind or solar projects under Department of Interior jurisdiction to go through an additional three-phase approval process ending with approval from the Secretary of the Interior. \nOur U.S. wind and solar projects are developed on private land and are designed in a manner that minimizes the potential of a federal nexus. However, due to the broad language of the memorandum, there may be some impact to projects developed on private land. \nIn 2024, we realized $1,313 million of earnings from Tax Attributes, comprised of $1,293 million from the Renewables SBU and $20 million from the Utilities SBU. In 2025, we expect an increase in earnings from Tax Attributes, mainly from our U.S. renewables business that is in line with the growth in that business. For the nine months ended September 30, 2025, we recognized $988 million in Tax Attributes.\nThe enactment of the 2025 Act requires that substantial guidance be published by the U.S. Department of Treasury and other government agencies. While we have taken significant measures to protect against the impact of changes under the 2025 Act to the IRA, including by implementing a program designed to ensure our backlog of \n71 | The AES Corporation | September 30, 2025 Form 10-Q\nU.S. renewables projects satisfy IRS safe harbor requirements for qualifying for the ITCs and PTCs, the impacts of the 2025 Act, the Treasury Action, the Interior Action or future actions that have the effect of modifying or repealing the ITCs and PTCs or adversely impacting renewable energy projects may be material to our results of operations.\nNet CFC Tested Income (“NCTI”)\n — The 2025 Act amended the Global Intangible Low Taxed Income (“GILTI”) provision by eliminating the reduction to foreign earnings subject to GILTI by an allowable economic return on investment beginning January 1, 2026. The GILTI provision was also renamed to the NCTI provision. Additionally, the 2025 Act modified the U.S. foreign tax credit provisions beginning January 1, 2026. Although the new NCTI rules provide for a reduced 14 percent effective tax rate on captured foreign income, by way of a 40 percent deduction, companies with a U.S. net operating loss or otherwise insufficient taxable income will not benefit from the lower effective tax rate and may not be able to utilize foreign tax credits. The new NCTI rules may subject a portion of our foreign earnings to current U.S. taxation in the future and could be material. \nLimitation on Interest Expense Deductions\n — The 2025 Act retroactively amended the existing limitation on the deductibility of net interest expense beginning January 1, 2025. As amended, the deduction will be limited to interest income, plus 30% of tax basis EBITDA. Previously, the limitation was based on 30% of tax basis Earnings Before Interest and Taxes (“EBIT”). We expect the amendment to increase the current period permitted interest deductions and reduce the amount of disallowed interest expense subject to an indefinite carryforward. The limitation continues to be inapplicable to interest expense attributable to regulated utility property.\nGlobal Tax \n— The macroeconomic and political environments in the U.S. and in some countries where our subsidiaries conduct business have changed in recent years. This could result in significant impacts to future tax law. In the U.S., the IRA included a 15% corporate alternative minimum tax (“CAMT”) based on adjusted financial statement income. In June 2025, the IRS released interim guidance for CAMT and announced its intention to revise regulations that were proposed in September 2024. The impact to the Company in 2025 is not expected to be material. We will continue to monitor the issuance of CAMT revised guidance.\nThe Netherlands, Bulgaria, and Vietnam adopted legislation to implement Pillar 2 effective as of January 1, 2024. In June 2025, the Group of Seven (“G7”) nations issued a statement that they will work together to modify the Pillar 2 system in a manner that will fully exclude domestic and foreign profits of US-parented groups from Pillar 2’s Undertaxed Profits Rule and Income Inclusion Rule. We will continue to monitor the issuance of draft legislation in other non-EU countries where the Company operates that are considering Pillar 2 amendments and new interpretive guidance. \nInflation \n— In the markets in which we operate, there have been higher rates of inflation recently. While most of our contracts in our international businesses that are denominated in a currency other than the U.S. dollar are indexed to inflation, in general, our U.S.-based generation contracts are not indexed to inflation. If inflation continues to increase in our markets, it may increase our expenses that we may not be able to pass through to customers. It may also increase the costs of some of our development projects that could negatively impact their competitiveness. Our utility businesses do allow for recovering of operations and maintenance costs through the regulatory process, which may have timing impacts on recovery.\nInterest Rates \n— In the U.S. and other markets in which we operate, there has been a rise in interest rates since 2021, and interest rates are expected to remain volatile in the near term.\nAs discussed in Item 3.—\nQuantitative and Qualitative Disclosures about Market Risk, \nalthough most of our existing corporate and subsidiary debt is at fixed rates, an increase in interest rates can have several impacts on our business. For any existing debt under floating rate structures and any future debt refinancings, rising interest rates will increase future financing costs. In most cases in which we have floating rate debt, it is short term in nature or indexed to inflation, which helps mitigate the impact of rising rates. For future debt refinancings, AES actively manages a hedging program to reduce uncertainty and exposure to future interest rates. For new business, higher interest rates increase the financing costs for new projects under development and which have not yet secured financing.\nAES typically seeks to incorporate expected financing costs into our new PPA pricing such that we maintain our target investment returns, but higher financing costs may negatively impact our returns or the competitiveness of some of our development projects. Additionally, we typically seek to enter into interest rate hedges shortly after signing PPAs to mitigate the risk of rising interest rates prior to securing long-term financing.\nArgentina\n \n— In July 2024, the Argentine government enacted Law 27,742, known as Ley Bases, declaring a one-year public emergency in administrative, economic, financial, and energy matters. It grants the President delegated powers and initiates broad state reforms to deregulate the economy, including labor reform, the Incentive \n72 | The AES Corporation | September 30, 2025 Form 10-Q\nRegime for Large Investments, modifications to non-income tax measures, and the privatization of state-owned energy companies. Additionally, the Ministry of Energy issued Resolution 150/2024, repealing certain regulations from previous years that involved excessive state and CAMMESA intervention in the Wholesale Electricity Market (“MEM”).\nOn January 28, 2025, the Energy Secretariat issued Resolution 21/2025 to reform the MEM and is intended to ensure secure energy supply and stable consumer costs.\nOn April 11, 2025, the Central Bank of Argentina started a new economic program supported by a $20 billion agreement with the International Monetary Fund. Of this amount, $15 billion will be available in 2025. The key points of the program include (a) a removal of exchange restrictions for individuals and (b) foreign shareholders can distribute profits starting from 2025 and deadlines for foreign trade payments are relaxed.\nOn July 4, 2025, the Argentine government issued Decree 450/25, initiating a 24-month transition period to reform and deregulate the country’s electricity market. The decree encourages free contracting between private entities and fosters competition in electricity generation and commercialization. Subsequently, on October 20, 2025, the Ministry of Economy and the Secretariat of Energy issued Resolution 400/25, which became effective on November 1, 2025, and provides a new framework introducing more competitive price signals, decentralizing fuel management, and reducing subsidies.\nThese changes may have a profound impact on the sector, influencing our operations and financial results. It is not yet possible to predict the impact of these regulations in our consolidated results of operations, cash flows, and financial condition.\nPuerto Rico\n \n— As discussed in Item 7.—\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\n—\nKey Trends and Uncertainties\n of the 2024 Form 10-K, our subsidiaries in Puerto Rico have long-term PPAs with state-owned PREPA, which has been facing economic challenges that could result in a material adverse effect on our business in Puerto Rico. Despite the Title III protection, PREPA has been making substantially all of its payments to the generators in line with historical payment patterns.\nThe Puerto Rico Oversight, Management, and Economic Stability Act (“PROMESA”) was enacted to create a structure for exercising federal oversight over the fiscal affairs of U.S. territories and created procedures for adjusting debt accumulated by the Puerto Rico government and, potentially, other territories (“Title III”). PROMESA also expedites the approval of key energy projects and other critical projects in Puerto Rico. \nPROMESA allowed for the establishment of an Oversight Board with broad powers of budgetary and financial control over Puerto Rico. The Oversight Board filed for bankruptcy on behalf of PREPA under Title III in July 2017. As a result of the bankruptcy filing, AES Ilumina’s non-recourse debt of $20 million continues to be in technical default and is classified as current as of September 30, 2025.\nIn 2022, a mediation commenced to resolve the PREPA Title III case. On March 19, 2025, the judge presiding over the case entered an order to permit the filing of an amended plan of adjustment and litigation of specific issues, including administrative expense claim by non-settling bondholders. The stay of plan confirmation and bondholder rights-related litigation was extended without a termination date, and the non-settling bondholders' motion to lift the stay was denied. The PROMESA oversight board filed an amended plan of adjustment and disclosure statement for PREPA on March 28, 2025. The mediation period was extended through October 31, 2025.\nConsidering the information available as of the date hereof, management believes the carrying amount of our long-lived assets in Puerto Rico of $920 million is recoverable as of September 30, 2025.\nDecarbonization Initiatives\nOur strategy involves shifting towards clean energy platforms, including renewable energy, energy storage, LNG, and modernized grids. It is designed to position us for continued growth while reducing our carbon intensity and to be in support of our mission of accelerating the future of energy, together. We have made significant progress on our exit of coal generation, and by year-end 2025, we intend to have exited the substantial majority of our coal facilities that we owned in 2022. Due to a number of factors, including grid and market dynamics, we will continue to work towards exiting coal in the limited markets where we have coal generation. We currently anticipate these efforts will continue beyond 2027. We expect to further reduce the carbon intensity of our operations as we add more long-term contracted renewables to the grid each year.\nIn addition, initiatives have been announced by regulators, including in Chile, Puerto Rico, Bulgaria, and offtakers in recent years, with the intention of reducing GHG emissions generated by the energy industry. In parallel, \n73 | The AES Corporation | September 30, 2025 Form 10-Q\nthe shift towards renewables has caused certain customers to migrate to other low-carbon energy solutions and this trend may continue.\nAlthough we cannot currently estimate the financial impact of these decarbonization initiatives, new legislative or regulatory programs further restricting carbon emissions or other initiatives to voluntarily exit coal generation could require material capital expenditures, result in a reduction of the estimated useful life of certain coal facilities, or have other material adverse effects on our financial results.\nFor further information about the risks associated with decarbonization initiatives, see Item 1A.\n—Risk Factors\n—\nConcerns about GHG emissions and the potential risks associated with climate change have led to increased regulation and other actions that could impact our businesses\n included in the 2024 Form 10-K.\nRegulatory\nFERC, RTOs, and Interconnection Prioritization \n— FERC approved one-time queue jumping proposals in PJM, MISO, and SPP over the course of the year. Limited additions to each RTO’s queue are not expected to materially impact the projects already in our backlog; however, they could create uncertainty around network upgrade costs and the timing of integration of future projects in each RTO’s queue. See Item 1A.—\nRisk Factors\n - Our development projects are subject to substantial uncertainties\n included in the 2024 Form 10-K for further details.\nAES Maritza PPA Review \n— DG Comp is conducting a preliminary review of whether AES Maritza’s PPA with NEK is compliant with the European Union's State Aid rules. No formal investigation has been launched by DG Comp to date. AES Maritza has previously engaged in discussions with the DG Comp case team and the Government of Bulgaria to attempt to reach a negotiated resolution of the DG Comp’s review (“PPA Discussions”). There are no active PPA Discussions at present, but those discussions could resume at any time. The PPA continues to remain in place. However, there can be no assurance that, in the context of DG Comp’s preliminary review or any future PPA Discussions, the other parties will not seek a prompt termination of the PPA.\nWe do not believe termination of the PPA is justified. Nevertheless, the PPA Discussions involved a range of potential outcomes, including but not limited to the termination of the PPA and payment of some level of compensation to AES Maritza. Any negotiated resolution would be subject to mutually acceptable terms, lender consent, and DG Comp approval. At this time, we cannot predict whether and when the PPA Discussions might resume or the outcome of any such discussions. Nor can we predict how DG Comp might resolve its review if the PPA Discussions do not resume or if any such discussions fail to result in an agreement concerning the agency's review. AES Maritza believes that its PPA is legal and in compliance with all applicable laws, and it will take all actions necessary to protect its interests, whether through negotiated agreement or otherwise. However, there can be no assurance that this matter will be resolved favorably; if it is not, there could be a material adverse effect on the Company’s financial condition, results of operations, and cash flows. As of September 30, 2025, the carrying value of our long-lived assets at Maritza is $336 million.\nAES Ohio Smart Grid Phase 2 Filing\n — In February 2024, AES Ohio filed a Smart Grid Phase 2 with the PUCO proposing a ten-year investment plan to begin after Smart Grid Phase 1 ends. On September 13, 2024, AES Ohio reached a settlement with the PUCO Staff and other parties on the pending Smart Grid Phase 2 Application and an evidentiary hearing was held on October 29, 2024. A fundamental premise of the application was the continued availability of rider recovery of Smart Grid investments through the plan period. However, with the recent enactment of Sub. H.B. 15 described below, which prohibits AES Ohio from applying for a new electric security plan which includes certain rider recovery mechanisms, as well as the near-term financial uncertainty created by the statute, AES Ohio withdrew its Smart Grid Phase 2 Application on May 23, 2025. This withdrawal will provide AES Ohio flexibility as to the timing and scope of Smart Grid investments to continue to deliver their benefits to customers.\nAES Ohio Distribution Rate Case \n— On November 29, 2024, AES Ohio filed a new distribution rate case with the PUCO. The investments reflected in the distribution rate case include investments to enhance the safety, reliability, and resilience of the distribution system. The application is based on a date certain of September 30, 2024 and a test period of June 1, 2024 to May 31, 2025. On June 27, 2025 the PUCO Staff submitted their Report and Recommendations. On August 13, 2025, AES Ohio entered into an unopposed Stipulation and Recommendation (the “Settlement”) with various intervening parties and the Staff of the PUCO. The Settlement provides for updated base rates for electric distribution service customers in AES Ohio’s service territory and among other matters includes: (i) an increase to its annual distribution revenue requirement of $168 million, which incorporates certain investments that are currently recovered through the Distribution Investment Rider; (ii) a return \n74 | The AES Corporation | September 30, 2025 Form 10-Q\non equity of 9.999% and a cost of long-term debt of 4.49% on a distribution rate base of $1.25 billion and based on a capital structure of 53.87% equity and 46.13% long-term debt; and (iii) the net recovery of certain expenditures by AES Ohio, primarily related to one-time costs supporting the implementation of AES Ohio’s customer billing system upgrade. During the third quarter of 2025, AES Ohio recorded a net deferral of $8.4 million for previously recognized costs related to this recovery. The settlement is subject to, and conditioned upon, approval by the PUCO.\nAES Ohio Legislation \n— On April 30, 2025, the Ohio legislature passed a new energy legislation (H.B. 15) that was signed by the Governor and became effective on August 14, 2025. The legislation allows Ohio's electric utilities to file three-year forecasted base distribution rate cases, which would replace electric security plans and associated recovery riders. Among other provisions, the legislation eliminates the Legacy Generation Resource (LGR) Rider, which previously allowed for recovery of net OVEC costs and revenues. Changes to the regulatory framework from this legislation, including the recovery of future net OVEC costs and revenues, could be material to our results of operations, financial condition, and cash flows.\nAES Ohio Smart Grid Comprehensive Settlement\n \n— On October 23, 2020, AES Ohio entered into a Stipulation and Recommendation (the Settlement) with the staff of the PUCO, various customers and organizations representing customers of AES Ohio, and certain other parties with respect to, among other matters, AES Ohio's applications pending at the PUCO for (i) approval of AES Ohio's plan to modernize its distribution grid (Smart Grid Phase 1), (ii) findings that AES Ohio passed the SEET for 2018 and 2019, and (iii) findings that AES Ohio's ESP 1 satisfies the SEET and the more favorable in the aggregate (MFA) regulatory test. On June 16, 2021, the PUCO issued their opinion and order accepting the stipulation as filed. The OCC appealed the final PUCO order with respect to the 2018 and 2019 SEET to the Ohio Supreme Court on December 6, 2021. Oral arguments regarding this appeal were held on April 2, 2025. The Ohio Supreme Court reversed the PUCO's opinion and order with respect to the methodology used by the PUCO to support its findings related to the 2018 and 2019 SEET and remanded the case to the PUCO to conduct further analysis of the SEET for those years. AES Ohio filed testimony with the PUCO proposing a refund of $1.6 million based on analysis by its external financial consultant. The PUCO commenced an evidentiary hearing on this issue on October 28, 2025, and a PUCO decision is pending.\nAES Indiana Rate Case Filing \n— On June 3, 2025, AES Indiana filed a petition with the IURC for authority to increase its basic rates and charges. On October 15, 2025, AES Indiana entered into a Stipulation and Settlement Agreement (the “Settlement Agreement”) with most parties in AES Indiana’s pending regulatory rate review at the IURC. This Settlement Agreement provides for updated base rates for electric services in AES Indiana’s territory and is subject, and conditioned upon, approval by the IURC. Among other things, the Settlement Agreement proposes an increase in AES Indiana’s revenue of $90.7 million and provides a return on common equity of 9.75% and cost of long-term debt of 5.34%, on a rate base of approximately $5.5 billion for AES Indiana’s 2027 electric service base rates. AES Indiana expects to receive an order from the IURC during the second quarter of 2026. The partial Settlement Agreement also includes a commitment to not implement additional base rate increases, following the implementation of new base rates under the settlement, until at least January of 2030 and to not start a second TDSIC Plan before January of 2028.\nForeign Exchange Rates\nWe operate in multiple countries and as such are subject to volatility in exchange rates at varying degrees at the subsidiary level and between our functional currency, the USD, and currencies of the countries in which we operate. \nThe overall economic climate in Argentina has been volatile, resulting in increased risk that a further significant devaluation of the Argentine peso against the USD, similar to the devaluations experienced by the country in 2018, 2019, and 2023, may occur. A continued trend of peso devaluation could result in increased inflation, a deterioration of the country’s risk profile, and other adverse macroeconomic effects that could significantly impact our results of operations. For additional information, refer to Item 3.—\nQuantitative and Qualitative Disclosures About Market Risk\n.\nImpairments and Realizability\nLong-lived Assets and Current Assets Held-for-Sale\n \n—\n \nDuring the nine months ended September 30, 2025, the Company recognized asset impairment expense of $152 million. See Note 16\n—\nAsset Impairment Expense\n \nincluded in Item 1.\n—Financial Statements \nof this Form 10-Q for further information. After recognizing this impairment expense, the carrying value of long-lived assets and current assets held-for-sale that were assessed for impairment totaled $\n33\n million at September 30, 2025.\nEvents or changes in circumstances that may necessitate recoverability tests and potential impairments of \n75 | The AES Corporation | September 30, 2025 Form 10-Q\nlong-lived assets may include, but are not limited to, adverse changes in the regulatory environment, unfavorable changes in power prices or fuel costs, increased competition due to additional capacity in the grid, technological advancements, declining trends in demand, evolving industry expectations to transition away from fossil fuel sources for generation, or an expectation it is more likely than not the asset will be disposed of before the end of its estimated useful life. \nTax Asset Realizability \n—\n \nCertain AES Chilean businesses have recorded net deferred tax assets (\"DTA\") of $245 million relating primarily to net operating loss carryforwards, which are not subject to expiration. Their realization is dependent on generating sufficient taxable income. At this time, management believes it is more likely than not that all of the DTA will be realized; however, it could be reduced by way of valuation allowance in the near term if estimates of future taxable income are reduced. \nEnvironmental\nThe Company is subject to numerous environmental laws and regulations in the jurisdictions in which it operates. The Company faces certain risks and uncertainties related to these environmental laws and regulations, including existing and potential GHG legislation or regulations, and actual or potential laws and regulations pertaining to water discharges, waste management (including disposal of coal combustion residuals) and certain air emissions, such as SO\n2\n, NO\nx\n, particulate matter, mercury, and other hazardous air pollutants, and species and habitat protections. Such risks and uncertainties could result in increased capital expenditures or other compliance costs which could have a material adverse effect on certain of our U.S. or international subsidiaries and our consolidated results of operations. For further information about these risks, see Item 1A.—\nRisk Factors—Our operations are subject to significant government regulation and could be adversely affected by changes in the law or regulatory schemes; Several of our businesses are subject to potentially significant remediation expenses, enforcement initiatives, private party lawsuits and reputational risk associated with CCR; Our businesses are subject to stringent environmental laws, rules and regulations;\n and\n Concerns about GHG emissions and the potential risks associated with climate change have led to increased regulation and other actions that could impact our businesses\n included in the 2024 Form 10-K. \nCSAPR\n \n—\n \nCSAPR addresses the “good neighbor” provision of the CAA, which prohibits sources within each state from emitting any air pollutant in an amount which will contribute significantly to any other state’s nonattainment, or interference with maintenance of, any NAAQS. The CSAPR required significant reductions in SO\n2\n and NO\nx\n emissions from power plants in many states in which subsidiaries of the Company operate. The Company is required to comply with the CSAPR in certain states, including Indiana and Maryland. The CSAPR is implemented, in part, through a market-based program under which compliance may be achievable through the acquisition and use of emissions allowances created by the EPA. The Company complies with CSAPR through operation of existing controls and purchases of allowances on the open market, as needed.\nIn October 2016, the EPA published a final rule to update the CSAPR to address the 2008 ozone NAAQS (“CSAPR Update Rule”). The CSAPR Update Rule found that NO\nx\n ozone season emissions in 22 states (including Indiana and Maryland) affected the ability of downwind states to attain and maintain the 2008 ozone NAAQS, and, accordingly, the EPA issued federal implementation plans that both updated existing CSAPR NO\nx\n ozone season emission budgets for electric generating units (“EGUs”) within these states and implemented these budgets through modifications to the CSAPR NO\nx\n ozone season allowance trading program. Implementation started in the 2017 ozone season (May-September 2017). Affected facilities receive fewer ozone season NO\nx\n allowances in 2017 and later, possibly resulting in the need to purchase additional allowances. Following legal challenges to the CSAPR Update Rule, on April 30, 2021, the EPA issued the Revised CSAPR Update Rule. The Revised CSAPR Update Rule required affected EGUs within certain states (including Indiana and Maryland) to participate in a new trading program, the CSAPR NO\nx\n Ozone Season Group 3 trading program. These affected EGUs received fewer NO\nx\n Ozone Season allowances beginning in 2021. \nOn June 5, 2023, the EPA published a final Federal Implementation Plan (\"FIP\") to address air quality impacts with respect to the 2015 Ozone NAAQS. The rule establishes a revised CSAPR NO\nx\n Ozone Season Group 3 trading program for 22 states, including Indiana and Maryland, and became effective during 2023. The FIP also includes enhancements to the revised Group 3 trading program, which include a dynamic budget setting process beginning in 2026, annual recalibration of the allowance bank to reflect changes to affected sources, a daily backstop emissions rate limit for certain coal-fired EGUs beginning in 2024, and a secondary emissions limit prohibiting certain emissions associated with state assurance levels. It is too early to determine the impact of the final FIP, but it may result in the need to purchase additional allowances or make operational adjustments. On June 27, 2024, the U.S. Supreme Court issued an order granting a stay of the EPA’s 2023 FIP pending resolution of legal challenges to the FIP. On November 6, 2024, the EPA published an Interim Final Rule in the Federal Register in \n76 | The AES Corporation | September 30, 2025 Form 10-Q\nresponse to the U.S. Supreme Court’s stay of its FIP addressing interstate transport for the 2015 ozone national ambient air quality standards. The effective date is November 6, 2024. The Interim Final Rule stays the effectiveness of the Good Neighbor FIP and revises the CSAPR regulations to continue application of the states’ respective trading programs.\nWhile the Company's additional CSAPR compliance costs to date have been immaterial, the future availability of and cost to purchase allowances to meet the emission reduction requirements is uncertain at this time, but it could be material.\nMercury and Air Toxics Standard\n —\n In April 2012, the EPA’s rule to establish maximum achievable control technology standards for hazardous air pollutants regulated under the CAA emitted from coal and oil-fired electric utilities, known as “MATS”, became effective and AES facilities implemented measures to comply, as applicable. On May 7, 2024, the EPA published a final rule to revise MATS for coal and oil-fired EGUs. The final rule became effective on July 8, 2024. The final rule lowers certain emissions limits and revises certain other aspects of MATS. The MATS RTR Rule is subject to legal challenges. On October 4, 2024, the U.S. Supreme Court denied emergency stay applications. On June 17, 2025, the EPA published a proposed rule to repeal the majority of the May 7, 2024 final rule revising MATS.\nFurther rulemakings and/or proceedings are possible; however, in the meantime, MATS remains in effect. We currently cannot predict the outcome of the regulatory or judicial process, or its impact, if any, on our MATS compliance planning or ultimate costs.\nClimate Change Regulation\n \n—\n \nThe final NSPS for CO\n2\n emissions from new, modified, and reconstructed fossil-fuel-fired power plants were published in the \nFederal Register\n on October 23, 2015. Several states and industry groups challenged the NSPS for CO\n2\n in the D.C. Circuit Court. On December 20, 2018, the EPA published proposed revisions to the final NSPS for new, modified, and reconstructed coal-fired electric utility steam generating units. The EPA proposed that the Best System of Emissions Reduction (“BSER”) for these units is highly efficient generation that would be equivalent to supercritical steam conditions for larger units and sub-critical steam conditions for smaller units, and not partial carbon capture and sequestration (“CCS”), which had been the BSER for these units in the 2015 final NSPS. The EPA did not include revisions for natural-gas combined cycle or simple cycle units in the December 20, 2018 proposal. Challenges to the GHG NSPS remain held in abeyance at this time. On May 9, 2024, the EPA published the final NSPS requiring carbon capture and sequestration for new and reconstructed baseload stationary combustion turbines, among other requirements. The EPA did not finalize revisions to the NSPS for newly constructed or reconstructed coal-fired electric utility steam generating units as proposed in 2018.\nOn July 8, 2019, the EPA published the final Affordable Clean Energy (“ACE”) Rule which would have established CO\n2\n emission rules for existing power plants under CAA Section 111(d) and would have replaced the EPA's 2015 Clean Power Plan Rule (“CPP”). However, on January 19, 2021, the D.C. Circuit vacated and remanded the ACE Rule. Subsequently, on June 30, 2022, the Supreme Court reversed the judgment of the D.C. Circuit Court and remanded for further proceedings consistent with its opinion holding that the “generation shifting” approach in the CPP exceeded the authority granted to the EPA by Congress under Section 111(d) of the CAA. As a result of the June 30, 2022 Supreme Court decision, on October 27, 2022, the D.C. Circuit issued a partial mandate, holding pending challenges to the ACE Rule in abeyance while the EPA developed a replacement rule. On May 23, 2023, the EPA published a proposed rule that would vacate the ACE Rule and proposed New Source Performance Standards (“NSPSs”) that would establish emissions guidelines in the form of CO\n2\n emissions limitations for certain existing EGUs and would require states to develop State Plans that establish standards of performance for such EGUs that are at least as stringent as the EPA’s emissions guidelines. Depending on various EGU-specific factors, the bases of proposed emissions guidelines range from routine methods of operation to carbon capture and sequestration or co-firing low-GHG hydrogen starting in the 2030s. On May 9, 2024, the EPA published the final rule regulating GHGs from existing EGUs pursuant to Section 111(d) of the Clean Air Act and effective on July 8, 2024. Existing EGUs are those that were constructed prior to January 8, 2014. Depending on various EGU-specific factors, the bases of emissions guidelines for natural gas-fired units include the use of uniform fuels and routine methods of operation and maintenance and the bases of emissions guidelines for coal-fired units include 40% natural gas co-firing or carbon capture and sequestration with 90% capture of CO\n2\n depending on the date that coal operations cease. Specific standards for performance for EGUs will be established through a State Plan (or a Federal Plan if a state were to not submit an approvable plan). The May 2024 rule is subject to legal challenges. On October 16, 2024, the U.S. Supreme Court denied emergency stay applications. \nOn June 17, 2025, the EPA published a proposed rule to repeal the May 9, 2024 final rules for new and existing EGUs in addition to 2015 greenhouse gas NSPSs for certain new EGUs. In this proposed rule, the EPA \n77 | The AES Corporation | September 30, 2025 Form 10-Q\nalso offered an alternative proposal to repeal a narrower set of greenhouse gas requirements which would include the repeal of requirements for existing EGUs and requirements based on carbon capture and sequestration for new EGUs. On August 1, 2025, the EPA published a proposed rule to rescind the 2009 greenhouse gas endangerment finding which concluded that greenhouse gases endanger public health and welfare.\nThe impact of the rules, the results of further proceedings, and potential future greenhouse gas emissions regulations remain uncertain but could be material.\nWaste Management\n — On October 19, 2015, an EPA rule regulating CCR under the Resource Conservation and Recovery Act as nonhazardous solid waste became effective. The rule established nationally applicable minimum criteria for the disposal of CCR in new and currently operating landfills and surface impoundments, including location restrictions, design and operating criteria, groundwater monitoring, corrective action and closure requirements, and post-closure care. The primary enforcement mechanisms under this regulation would be actions commenced by the states and private lawsuits. On December 16, 2016, the Water Infrastructure Improvements for the Nation Act (\"WIIN Act\") was signed into law. This includes provisions to implement the CCR rule through a state permitting program, or if the state chooses not to participate, a possible federal permit program. If this rule is finalized before Indiana or Puerto Rico establishes a state-level CCR permit program, AES CCR units in those locations could eventually be required to apply for a federal CCR permit from the EPA. The EPA has indicated that it will implement a phased approach to amending the CCR Rule, which is ongoing. On August 28, 2020, the EPA published final amendments to the CCR Rule titled \"A Holistic Approach to Closure Part A: Deadline to Initiate Closure,\" that, among other amendments, required certain CCR units to cease waste receipt and initiate closure by April 11, 2021. The CCR Part A Rule also allowed for extensions of the April 11, 2021 deadline if the EPA determines certain criteria are met. Facilities seeking such an extension were required to submit a demonstration to the EPA by November 30, 2020. On January 11, 2022, the EPA released the first in a series of proposed determinations regarding CCR Part A Rule demonstrations and compliance-related letters notifying certain other facilities of their compliance obligations under the federal CCR regulations. The determinations and letters include interpretations regarding implementation of the CCR Rule. On April 8, 2022, petitions for review were filed challenging these EPA actions. The petitions are consolidated in \nElectric Energy, Inc. v. EPA. \nOn June 28, 2024, the D.C. Circuit dismissed the challenges.\n \nIt is too early to determine the direct or indirect impact of these letters or any determinations that may be made.\nOn May 18, 2023, the EPA published a proposed rule that would expand the scope of CCR units regulated by the CCR Rule to include inactive surface impoundments at inactive generating facilities as well as additional inactive and closed landfills and certain other accumulations of CCR. On May 8, 2024, the EPA published final revisions to the CCR rule which \nare effective on November 8, 2024. The final revisions expand the scope of CCR units regulated by the CCR rule to include legacy surface impoundments, inactive surface impoundments, and CCR management units. On July 22, 2025, the EPA published both a direct final rule and a proposed rule that, if finalized, would extend certain deadlines for CCR management units associated with its May 8, 2024 revisions to the CCR Rule. \nOn September 4, 2025, the EPA withdrew the direct final rule due to receipt of adverse comment. \nIt is \ntoo early to determine the potential impact from the July 22, 2025 proposed revisions to the CCR Rule.\nOn February 20, 2020, the EPA published a proposed rule to establish a federal CCR permit program that would operate in states without approved CCR permit programs. If this rule is finalized before Indiana establishes a final state-level CCR permit program, AES Indiana could eventually be required to apply for a federal CCR permit from the EPA. On December 21, 2022, the Indiana Department of Environmental Management (“IDEM”) published in the Indiana Register a Second Notice of Comment Period for its proposed CCR rulemaking which would include regulation of CCR through a state permitting program. On August 7, 2024, in response to changes to Indiana statute, as well as comments received during the Second Notice of Comment Period, IDEM published a Continuation of the Second Notice of Comment Period for proposed amendments to the draft rule language for a State CCR Permitting Program.\nThe CCR rule, current or proposed amendments to or interpretations of the CCR rule, the results of groundwater monitoring data, or the outcome of CCR-related litigation could have a material impact on our business, financial condition, and results of operations. AES Indiana would seek recovery of any resulting expenditures; however, there is no guarantee we would be successful in this regard.\nCooling Water Intake \n—\n \nThe Company's facilities are subject to a variety of rules governing water use and discharge. In particular, the Company's U.S. facilities are subject to the CWA Section 316(b) rule issued by the EPA effective in 2014 that seeks to protect fish and other aquatic organisms drawn into cooling water systems at power plants and other facilities. These standards require affected facilities to choose among seven Best Technology Available (“BTA”) options to reduce fish impingement. In addition, certain facilities must conduct studies to assist \n78 | The AES Corporation | September 30, 2025 Form 10-Q\npermitting authorities to determine whether and what site-specific controls, if any, would be required to reduce entrainment of aquatic organisms. It is possible that this process, which includes permitting and public input, could result in the need to install closed-cycle cooling systems (closed-cycle cooling towers) or other technology. Finally, the standards require that new units added to an existing facility to increase generation capacity are required to reduce both impingement and entrainment. It is not yet possible to predict the total impacts of this final rule at this time, including any challenges to such final rule and the outcome of any such challenges. However, if additional capital expenditures are necessary, they could be material.\nCertain AES Southland OTC units were required to be retired to provide interconnection capacity and/or emissions credits prior to startup of new (air cooled) generating units, and the remaining AES OTC generating units in California have been or will be shut down and permanently retired by the applicable OTC Policy compliance dates for the respective units. The California State Water Resources Board (“SWRCB”) OTC Policy currently requires the shutdown and permanent retirement of the remaining OTC generating units at AES Huntington Beach, LLC and AES Alamitos, LLC by December 31, 2026, as extended in support of grid reliability. This extension compliance date is contingent upon the facilities participating in the Strategic Reserve established by AB 205.\nPower plants are required to comply with the more stringent of state or federal requirements. At present, the California state requirements are more stringent and have earlier compliance dates than the federal EPA requirements, and are therefore applicable to the Company's California assets. The Company anticipates that compliance with CWA Section 316(b) regulations and associated costs could have a material impact on our consolidated financial condition or results of operations.\nWater Discharges \n—\n In June 2015, the EPA and the U.S. Army Corps of Engineers (\"the Agencies\") published a rule defining federal jurisdiction over waters of the U.S., known as the \"Waters of the U.S.\" (“WOTUS”) rule. WOTUS defines the geographic reach and authority of the Agencies to regulate streams, wetlands, and other water bodies under the CWA. There have been multiple Supreme Court decisions and dueling regulatory definitions over the past several years concerning the proper standard for how to properly determine whether a wetland or stream that is not navigable is considered a WOTUS. On May 25, 2023, the U.S. Supreme Court rendered a decision (“Decision”) in the case of \nSackett v. Environmental Protection Agency\n, addressing the definition of WOTUS with regards to the CWA. This decision provides a clear standard that substantially restricts the Agencies' ability to regulate certain types of wetlands and streams. Specifically, under this decision, wetlands that do not have a continuous surface connection with traditional interstate navigable water are not considered a WOTUS and therefore are not federally jurisdictional.\nOn September 8, 2023, the Agencies published final rule amendments in the Federal Register to amend the final “Revised Definition of ‘Waters of the United States’” rule. This final rule conforms the definition to the definition adopted in the Decision. The Agencies have amended key aspects of the regulatory text to conform the rule to the Decision. \nDue to ongoing litigation, the definition of WOTUS (as amended on September 8, 2023) is not operative in certain jurisdictions. In the jurisdictions involved in the litigation the amended 2023 Rule is subject to a preliminary injunction, and the Agencies interpret WOTUS consistent with the pre-2015 regulatory regime and the Supreme Court’s decision in \nSackett\n. In the remaining states the Agencies implement the definition in the January 2023 Rule, as amended in September 2023.\nOn March 12, 2025, the Agencies issued a joint guidance memorandum for implementing “continuous surface connection” consistent with the Decision and related issues. The Federal Register notice was published on March 24, 2025 outlining a process to gather recommendations for implementation of WOTUS. It is too early to determine whether the outcome of litigation or current or future revisions to rules interpreting federal jurisdiction over WOTUS may have a material impact on our business, financial condition, or results of operations.\nIn November 2015, the EPA published its final ELG rule to reduce toxic pollutants discharged into waters of the U.S. by steam-electric power plants through technology applications. These effluent limitations for existing and new sources include dry handling of fly ash, closed-loop or dry handling of bottom ash, and more stringent effluent limitations for flue gas desulfurization wastewater. AES Indiana Petersburg has installed a dry bottom ash handling system in response to the CCR rule and wastewater treatment systems in response to the NPDES permits in advance of the ELG compliance date. Other U.S. businesses already include dry handling of fly ash and bottom ash and do not generate flue gas desulfurization wastewater. Following the 2019 U.S. Court of Appeals vacatur and remand of portions of the 2015 ELG rule related to leachate and legacy water, on March 29, 2023, the EPA published a proposed rule revising the 2020 Reconsideration Rule. On May 9, 2024, the EPA published a final rule which became effective on July 8, 2024. The final rule established more stringent best available technology limits for flue gas desulfurization wastewater, bottom ash transport water, and combustion residual leachate and established \n79 | The AES Corporation | September 30, 2025 Form 10-Q\na new set of definitions and new limits for combustion residual leachate and legacy wastewater. The May 2024 rule is subject to legal challenges. On October 10, 2024, the Eighth Circuit Court denied stay applications. On October 2, 2025, the EPA published a proposed rule that, if finalized, would extend certain ELG deadlines and allow facilities to choose between compliance alternatives. On the same date, the EPA also published a direct final rule to extend the deadline for power plants to file a notice of planned participation for the permanent cessation of coal from December 31, 2025, to December 31, 2031, pending any significant adverse comment. It is too early to determine whether any outcome of these proposed rules, litigation or future revisions to the ELG rule might have a material impact on our business, financial condition, and results of operations.\nU.S. Executive Actions Affecting Environmental Regulations\n — On January 20, 2025, President Trump issued an Executive Order directing Agencies to, among other tasks, review regulations issued under the prior administration to determine whether they should be suspended, revised, or rescinded. President Trump also issued a Memorandum directing agencies to refrain from proposing or issuing any rules until the current administration has reviewed and approved those rules. In accordance with these and other Executive Orders, on March 12, 2025, the EPA released a list of environmental regulations that will be targeted for reconsideration and other deregulatory action. These and other actions, including other Executive Orders and directives from the administration, may have an impact on regulations and permitting processes that may affect our business, financial condition, or results of operations.\nCapital Resources and Liquidity\nOverview\nAs of September 30, 2025, the Company had unrestricted cash and cash equivalents of $1.8 billion, of which $31 million was held at the Parent Company and qualified holding companies. The Company had restricted cash and debt service reserves of $791 million. The Company also had non-recourse and recourse aggregate principal amounts of debt outstanding of $23.9 billion and $6.2 billion, respectively. Of the $2.9 billion of our current non-recourse debt, $2.8 billion was presented as such because it is due in the next twelve months and $171 million relates to debt considered in default. AES Puerto Rico is in payment default. All other defaults are not payment defaults but are instead technical defaults triggered by failure to comply with covenants or other requirements contained in the non-recourse debt documents. See Note 8—\nObligations\n in Item 1.—\nFinancial Statements \nof this Form 10-Q for additional detail. As of September 30, 2025, the Company also had $1,046 million outstanding related to supplier financing arrangements.\nWe expect current maturities of non-recourse debt, recourse debt, and amounts due under supplier financing arrangements to be repaid from net cash provided by operating activities of the subsidiary to which the liability relates, through opportunistic refinancing activity, or some combination thereof. We have $1.4 billion in recourse debt which matures within the next twelve months, including $643 million in outstanding borrowings under the commercial paper program. Furthermore, we have $767 million due under supplier financing arrangements that have a guarantee, $380 million guaranteed by the Parent Company and $387 million guaranteed by subsidiaries. From time to time, we may elect to repurchase our outstanding debt through cash purchases, privately negotiated transactions, or otherwise when management believes that such securities are attractively priced. Such repurchases, if any, will depend on prevailing market conditions, our liquidity requirements, and other factors. The amounts involved in any such repurchases may be material. \nWe rely mainly on long-term debt obligations to fund our construction activities. We have, to the extent available at acceptable terms, utilized non-recourse debt to fund a significant portion of the capital expenditures and investments required to construct and acquire our electric power plants, distribution companies, and related assets. Our non-recourse financing is designed to limit cross-default risk to the Parent Company or other subsidiaries and affiliates. Our non-recourse long-term debt is a combination of fixed and variable interest rate instruments. Debt is typically denominated in the currency that matches the currency of the revenue expected to be generated from the benefiting project, thereby reducing currency risk. In certain cases, the currency is matched through the use of derivative instruments. The majority of our non-recourse debt is funded by international commercial banks, with debt capacity supplemented by multilaterals and local regional banks.\nGiven our long-term debt obligations, the Company is subject to interest rate risk on debt balances that accrue interest at variable rates. When possible, the Company will borrow funds at fixed interest rates or hedge its variable rate debt to fix its interest costs on such obligations. In addition, the Company has historically tried to maintain at least 70% of its consolidated long-term obligations at fixed interest rates, including fixing the interest rate through the use of interest rate swaps. These efforts apply to the notional amount of the swaps compared to the amount of \n80 | The AES Corporation | September 30, 2025 Form 10-Q\nrelated underlying debt. Additionally, commercial paper issuances are short-term in nature and subject the Parent Company to interest rate risk at the time of refinancing the paper. On a consolidated basis, of the Company’s $30.6 billion of total gross debt outstanding as of September 30, 2025, approximately $8.9 billion accrues interest at variable rates. The Company actively hedges its current and expected variable rate exposure through a combination of currently effective and forward starting interest rate swaps. As of September 30, 2025, the total maximum outstanding amount of hedges protecting the company against current and expected variable rate exposure was $9.2 billion. These hedges generally provide economic protection through the entire expected life of the projects, regardless of the type of debt issued to finance construction or refinance the projects in the future.\nIn addition to utilizing non-recourse debt at a subsidiary level when available, the Parent Company provides a portion, or in certain instances all, of the remaining long-term financing or credit required to fund development, construction, or acquisition of a particular project. These investments have generally taken the form of equity investments or intercompany loans, which are subordinated to the project’s non-recourse loans. We generally obtain the funds for these investments from our cash flows from operations, proceeds from the sales of assets and/or the proceeds from our issuances of debt, common stock, and other securities. Similarly, in certain of our businesses, the Parent Company may provide financial guarantees or other credit support for the benefit of counterparties who have entered into contracts for the purchase or sale of electricity, equipment, or other services with our subsidiaries or lenders. In such circumstances, if a business defaults on its payment or supply obligation, the Parent Company will be responsible for the business’ obligations up to the amount provided for in the relevant guarantee or other credit support. As of September 30, 2025, the Parent Company had provided outstanding financial and performance-related guarantees or other credit support commitments to or for the benefit of our businesses, which were limited by the terms of the agreements, of approximately $5.1 billion in aggregate (excluding those collateralized by letters of credit and other obligations discussed below). \nSome counterparties may be unwilling to accept our general unsecured commitments to provide credit support. Accordingly, with respect to both new and existing commitments, the Parent Company may be required to provide some other form of assurance, such as a letter of credit, to backstop or replace our credit support. The Parent Company may not be able to provide adequate assurances to such counterparties. To the extent we are required and able to provide letters of credit or other collateral to such counterparties, this will reduce the amount of credit available to us to meet our other liquidity needs. As of September 30, 2025, we had $317 million in letters of credit under bilateral agreements, $158 million in letters of credit outstanding provided under our unsecured credit facilities, and $38 million in letters of credit outstanding provided under our revolving credit facilities. These letters of credit operate to guarantee performance relating to certain project development and construction activities and business operations.\nAdditionally, in connection with certain project financings, some of the Company's subsidiaries have expressly undertaken limited obligations and commitments. These contingent contractual obligations are issued at the subsidiary level and are non-recourse to the Parent Company. As of September 30, 2025, the maximum undiscounted potential exposure to guarantees and letters of credit issued by our subsidiaries was $6.1 billion, including $2 billion of customary payment guarantees under EPC contracts and other agreements, $1.8 billion of letters of credit outstanding, $1.3 billion of surety bonds and other guarantees issued by insurance companies, and $949 million of tax equity financing related guarantees.\nWe expect to continue to seek, where possible, non-recourse debt financing in connection with the assets or businesses that we or our affiliates may develop, construct, or acquire. However, depending on local and global market conditions and the unique characteristics of individual businesses, non-recourse debt may not be available on economically attractive terms or at all. If we decide not to provide any additional funding or credit support to a subsidiary project that is under construction or has near-term debt payment obligations and that subsidiary is unable to obtain additional non-recourse debt, such subsidiary may become insolvent, and we may lose our investment in that subsidiary. Additionally, if any of our subsidiaries lose a significant customer, the subsidiary may need to withdraw from a project or restructure the non-recourse debt financing. If we or the subsidiary choose not to proceed with a project or are unable to successfully complete a restructuring of the non-recourse debt, we may lose our investment in that subsidiary.\nMany of our subsidiaries depend on timely and continued access to capital markets to manage their liquidity needs. The inability to raise capital on favorable terms, to refinance existing indebtedness, or to fund operations and other commitments during times of political or economic uncertainty may have material adverse effects on the financial condition and results of operations of those subsidiaries. In addition, changes in the timing of tariff increases or delays in the regulatory determinations under the relevant concessions could affect the cash flows and results of operations of our businesses.\n81 | The AES Corporation | September 30, 2025 Form 10-Q\nLong-Term Receivables\nAs of September 30, 2025, the Company had approximately $115 million of gross accounts receivable classified as \nOther noncurrent assets\n. These noncurrent receivables mostly consist of accounts receivable in the U.S. and Chile that, pursuant to amended agreements or government resolutions, have collection periods that extend beyond September 30, 2026, or one year from the latest balance sheet date. Noncurrent receivables in the U.S. pertain primarily to the sale of the Redondo Beach land. Noncurrent receivables in Chile pertain primarily to payment deferrals granted to mining customers as part of our green blend agreements. See Note 5\n—\nFinancing Receivables\n in Item 1.—\nFinancial Statements\n of this Form 10-Q for further information.\nAs of September 30, 2025, the Company had an $874 million loan receivable related to the Mong Duong facility in Vietnam, which was constructed under a build, operate, and transfer contract. This loan receivable represents contract consideration related to the construction of the facility, which was substantially completed in 2015, and will be collected over the 25-year term of the plant’s PPA. Of the loan receivable balance, $93 million was classified in \nOther current assets\n and $781 million was classified in \nLoan receivable \non the Condensed Consolidated Balance Sheets. See Note 5\n—\nFinancing Receivables\n and Note 14\n—\nRevenue\n in Item 1.—\nFinancial Statements\n of this Form 10-Q for further information.\nCash Sources and Uses\nThe primary sources of cash for the Company in the nine months ended September 30, 2025 were debt financings, cash flows from operating activities, sales to noncontrolling interests, purchases under supplier financing arrangements, and sales to noncontrolling interest. The primary uses of cash in the nine months ended September 30, 2025 were repayments of debt, capital expenditures, and repayments of obligations under supplier financing arrangements.\nThe primary sources of cash for the Company in the nine months ended September 30, 2024 were debt financings, cash flows from operating activities, purchases under supplier financing arrangements, and sales to noncontrolling interests. The primary uses of cash in the nine months ended September 30, 2024 were repayments of debt, capital expenditures, repayments of obligations under supplier financing arrangements, and purchases of short-term investments.\nA summary of cash-based activities is as follows (in millions):\nNine Months Ended September 30,\nCash Sources:\n2025\n2024\nIssuance of non-recourse debt\n$\n4,397 \n$\n5,199 \nNet cash provided by operating activities\n2,818 \n1,664 \nBorrowings under the revolving credit facilities\n2,711 \n5,652 \nSales to noncontrolling interests\n1,289 \n869 \nPurchases under supplier financing arrangements\n1,237 \n1,211 \nIssuance of recourse debt\n800 \n950 \nCommercial paper borrowings (repayments), net\n643 \n611 \nIssuance of preferred shares in subsidiaries\n528 \n— \nSale of short-term investments\n70 \n731 \nOther\n545 \n148 \nTotal Cash Sources\n$\n15,038 \n$\n17,035 \nCash Uses:\nCapital expenditures \n(1)\n$\n(4,394)\n$\n(5,665)\nRepayments under revolving credit facilities\n(3,951)\n(4,051)\nRepayments of non-recourse debt\n(2,523)\n(3,311)\nRepayments of obligations under supplier financing arrangements\n(1,108)\n(1,412)\nRepayments of recourse debt\n(898)\n— \nDistributions to noncontrolling interests\n(523)\n(165)\nDividends paid on AES common stock\n(376)\n(361)\nPurchase of emissions allowances\n(260)\n(157)\nPurchase of short-term investments\n(57)\n(725)\nOther\n(438)\n(619)\nTotal Cash Uses\n$\n(14,528)\n$\n(16,466)\nNet increase in Cash, Cash Equivalents, and Restricted Cash\n$\n510 \n$\n569 \n_____________________________\n(1)\nIncludes interest capitalized on development and construction of $374 million and $491 million for the nine months ended September 30, 2025 and 2024, respectively. Of the total capitalized,\n \n$358 million and $440 million, respectively, are related to recourse and non-recourse debt interest payments. The remaining capitalized interest is primarily related to supplier financing arrangements. Interest capitalized during development and construction decreased primarily due to fewer projects in development at the Renewables SBU.\n82 | The AES Corporation | September 30, 2025 Form 10-Q\nConsolidated Cash Flows\n \nThe following table reflects the changes in operating, investing, and financing cash flows for the comparative nine-month period (in millions):\nNine Months Ended September 30,\nCash flows provided by (used in):\n2025\n2024\n$ Change\nOperating activities\n$\n2,818 \n$\n1,664 \n$\n1,154 \nInvesting activities\n(4,618)\n(6,089)\n1,471 \nFinancing activities\n2,253 \n5,187 \n(2,934)\nOperating Activities\nNet cash provided by operating activities increased $1.2 billion for the nine months ended September 30, 2025, compared to the nine months ended September 30, 2024.\nOperating Cash Flows \n(in millions)\n(1)\nThe change in adjusted net income is defined as the variance in \nnet income\n, net of the total \nadjustments to net income \nas shown on the Condensed Consolidated Statements of Cash Flows in Item 1.—\nFinancial Statements \nof this Form 10-Q.\n(2)\nThe change in working capital is defined as the variance in total c\nhanges in operating assets and liabilities\n as shown on the Condensed Consolidated Statements of Cash Flows in Item 1.—\nFinancial Statements \nof this Form 10-Q.\n•\nAdjusted net income increased $799 million, primarily due to increased proceeds from the transfer of U.S. investment tax credits, and a decrease in cash paid for interest and income taxes, partially offset by lower margin at our Energy Infrastructure SBU.\n•\nChange in working capital increased $355 million, primarily due to a decrease in accounts receivable due to the timing of collections and billings and an increase in accounts payable due to the timing of payments. These increases were partially offset by an increase in other current assets due to the timing of collection of tax credit transfer proceeds, as well as the prior year sale of financing receivables under the Warrior Run PPA termination agreement.\n83 | The AES Corporation | September 30, 2025 Form 10-Q\nInvesting Activities\nNet cash used in investing activities decreased $1.5 billion for the nine months ended September 30, 2025, compared to the nine months ended September 30, 2024.\nInvesting Cash Flows\n(in millions)\n•\nCash proceeds from the sale of business increased $94 million, primarily due to the selldown of Dominican Republic Renewables.\n•\nPurchase of emissions allowances increased $103 million primarily due to higher CO\n2\n purchases at Maritza.\n•\nCapital expenditures decreased $1.3 billion, discussed further below.\nCapital Expenditures\n(in millions)\n(1)\nGrowth expenditures generally include expenditures related to development projects in construction, expenditures that increase capacity of a facility beyond the original design, and investments in general load growth or system modernization.\n(2)\nMaintenance expenditures generally include expenditures that are necessary to maintain regular operations or net maximum capacity of a facility.\n(3)\nEnvironmental expenditures generally include expenditures to comply with environmental laws and regulations, expenditures for safety programs, and other expenditures to ensure a facility continues to operate in an environmentally responsible manner.\n•\nGrowth expenditures decreased $1.1 billion, primarily driven by a decrease in expenditures for U.S. renewables and transmission and distribution project investments at our U.S. utilities compared to the prior year, partially offset by an increase in expenditures for renewables projects in Chile in the current year. \n•\nMaintenance expenditures decreased $174 million, primarily driven by a $68 million decrease at AES Indiana, AES Ohio, and Southland due to the timing of maintenance, and a $56 million decrease due to the sale of AES Brasil in October 2024.\n•\nEnvironmental expenditures decreased $1 million, with no material drivers.\n84 | The AES Corporation | September 30, 2025 Form 10-Q\nFinancing Activities\nNet cash provided by financing activities decreased $2.9 billion for the nine months ended September 30, 2025, compared to the nine months ended September 30, 2024.\nFinancing Cash Flows\n(in millions)\nSee Notes 1—\nFinancial Statement Presentation\n, 8—\nObligations\n,\n \nand\n \n12—\nEquity\n \nin Item 1.—\nFinancial Statements\n of this Form 10-Q for more information regarding significant transactions.\n•\nThe $2.3 billion impact from non-recourse revolvers is primarily due to $1.2 billion of net borrowings in the prior year and $962 million net repayments in the current year at the Renewables SBU, and $143 million of higher net repayments at the Utilities SBU in the current year; partially offset by $40 million of higher net repayments at the Infrastructure SBU in the prior year. \n•\nThe $1 billion impact from recourse debt is primarily due to the issuance of $950 million subordinated notes at the Parent Company in the prior year and repayments of $898 million at the Parent Company in the current year, partially offset by current year issuance of $800 million of senior notes. \n•\nThe $530 million impact from the Parent Company revolver is due to higher net borrowings in the prior year.\n•\nThe $420 million impact from sales to noncontrolling interests is primarily due to $540 million from the sale of ownership interest in AES Ohio and $150 million at AES Indiana from the sale of ownership in the Pike County BESS project to a tax equity investor in the current year; partially offset by $162 million decrease in proceeds at AES Clean Energy Development and AES Renewable Holdings due to higher sales of ownership in project companies to tax equity investors in the prior year, $47 million related to the prior year sale of ownership interest in Hardy Hills to a tax equity investor, $35 million related to the prior year sale of ownership interest in the Marahu project, and a $26 million decrease in sales under the Chile Renovables partnership with GIP.\n•\nThe $528 million impact from issuance of preferred shares in subsidiaries is primarily due to the proceeds received from the issuance of preferred shares in AES Global Insurance and Desarrollos Renovables.\nParent Company Liquidity\nThe following discussion is included as a useful measure of the liquidity available to The AES Corporation, or the Parent Company, given the non-recourse nature of most of our indebtedness. Parent Company Liquidity, as outlined below, is a non-GAAP measure and should not be construed as an alternative to \nCash and cash equivalents,\n which is determined in accordance with GAAP. Parent Company Liquidity may differ from similarly titled measures used by other companies. The principal sources of liquidity at the Parent Company level are dividends and other distributions from our subsidiaries, including refinancing proceeds; proceeds from debt and equity financings at the Parent Company level, including availability under our revolving credit facilities and commercial paper program; and proceeds from asset sales. The Parent Company credit facilities and commercial paper program are generally used for short-term cash needs to bridge the timing of distributions from subsidiaries. Cash requirements at the Parent Company level are primarily to fund interest and principal repayments of debt, construction commitments, other equity commitments, acquisitions, taxes, Parent Company overhead and development costs, and dividends on common stock.\n85 | The AES Corporation | September 30, 2025 Form 10-Q\nThe Company defines Parent Company Liquidity as cash available to the Parent Company, including cash at qualified holding companies, plus available borrowings under our existing credit facilities and commercial paper program. The cash held at qualified holding companies represents cash sent to subsidiaries of the Company domiciled outside of the U.S. Such subsidiaries have no contractual restrictions on their ability to send cash to the Parent Company. Parent Company Liquidity is reconciled to its most directly comparable GAAP financial measure, \nCash and cash equivalents\n, at the periods indicated as follows (in millions):\nSeptember 30, 2025\nDecember 31, 2024\nConsolidated cash and cash equivalents\n$\n1,758 \n$\n1,524 \nLess: Cash and cash equivalents at subsidiaries\n(1,727)\n(1,259)\nParent Company and qualified holding companies’ cash and cash equivalents\n31 \n265 \nCommitments under the Parent Company credit facilities\n2,300 \n1,800 \nLess: Letters of credit under the credit facilities\n(38)\n(18)\nLess: Borrowings under the commercial paper program\n(643)\n— \nBorrowings available under the Parent Company credit facilities\n1,619 \n1,782 \nTotal Parent Company Liquidity\n$\n1,650 \n$\n2,047 \nThe Parent Company paid dividends of $0.17595 per outstanding share to its common stockholders during the first, second, and third quarters of 2025 for dividends declared in December 2024, February 2025, and July 2025, respectively. While we intend to continue payment of dividends and believe we will have sufficient liquidity to do so, we can provide no assurance that we will continue to pay dividends, or if continued, the amount of such dividends.\nRecourse Debt \nOur total recourse debt was $6.2 billion and $5.7 billion as of September 30, 2025 and December 31, 2024, respectively. See Note 8—\nObligations\n in Item 1.—\nFinancial Statements \nof this Form 10-Q and Note 12—\nObligations\n in Item 8.—\nFinancial Statements and Supplementary Data\n of our 2024 Form 10-K for additional detail.\nWe believe that our sources of liquidity will be adequate to meet our needs for the foreseeable future. This belief is based on a number of material assumptions, including, without limitation, assumptions about our ability to access the capital markets, the operating and financial performance of our subsidiaries, currency exchange rates, power market pool prices, and the ability of our subsidiaries to pay dividends. In addition, our subsidiaries’ ability to declare and pay cash dividends to us (at the Parent Company level) is subject to certain limitations contained in loans, governmental provisions, and other agreements. We can provide no assurance that these sources will be available when needed or that the actual cash requirements will not be greater than anticipated. We have met our interim needs for shorter-term and working capital financing at the Parent Company level with our revolving credit facility and commercial paper program. See Item 1A.—\nRisk Factors\n—\nThe AES Corporation’s ability to make payments on its outstanding indebtedness is dependent upon the receipt of funds from our subsidiaries\n of the Company’s 2024 Form 10-K for additional information.\nVarious debt instruments at the Parent Company level, including our revolving credit facilities and commercial paper program, contain certain restrictive covenants. The covenants provide for, among other items, limitations on other indebtedness, liens, investments and guarantees; limitations on dividends, stock repurchases and other equity transactions; restrictions and limitations on mergers and acquisitions, sales of assets, leases, transactions with affiliates and off-balance sheet and derivative arrangements; maintenance of certain financial ratios; and financial and other reporting requirements. As of September 30, 2025, we were in compliance with these covenants at the Parent Company level.\nNon-Recourse Debt \nWhile the lenders under our non-recourse debt financings generally do not have direct recourse to the Parent Company, defaults thereunder can still have important consequences for our results of operations and liquidity, including, without limitation:\n•\nreducing our cash flows as the subsidiary will typically be prohibited from distributing cash to the Parent Company during the time period of any default;\n•\ntriggering our obligation to make payments under any financial guarantee, letter of credit, or other credit support we have provided to or on behalf of such subsidiary;\n•\ncausing us to record a loss in the event the lender forecloses on the assets; and\n•\ntriggering defaults in our outstanding debt at the Parent Company.\nFor example, our revolving credit facilities and outstanding debt securities at the Parent Company include events of default for certain bankruptcy-related events involving material subsidiaries. In addition, our revolving \n86 | The AES Corporation | September 30, 2025 Form 10-Q\ncredit agreement at the Parent Company includes events of default related to payment defaults and accelerations of outstanding debt of material subsidiaries.\nSome of our subsidiaries are currently in default with respect to all or a portion of their outstanding indebtedness. The total non-recourse debt classified as current in the accompanying Condensed Consolidated Balance Sheets amounts to $2.9 billion. The portion of current debt related to such defaults was $171 million at September 30, 2025, all of which was non-recourse debt related to three subsidiaries: AES Puerto Rico, AES Ilumina, and AES Jordan Solar. AES Puerto Rico is in payment default. All other defaults are not payment defaults, but are instead technical defaults triggered by failure to comply with other covenants or other conditions contained in the non-recourse debt documents. See Note 8—\nObligations\n in Item 1.—\nFinancial Statements \nof this Form 10-Q for additional detail.\nNone of the subsidiaries that are currently in default are subsidiaries that met the applicable definition of materiality under the Parent Company’s debt agreements as of September 30, 2025, in order for such defaults to trigger an event of default or permit acceleration under the Parent Company’s indebtedness. However, as a result of additional dispositions of assets, other significant reductions in asset carrying values or other matters in the future that may impact our financial position and results of operations or the financial position of the individual subsidiary, it is possible that one or more of these subsidiaries could fall within the definition of a “material subsidiary” and thereby trigger an event of default and possible acceleration of the indebtedness under the Parent Company’s outstanding debt securities. A material subsidiary is defined in the Parent Company’s revolving credit agreement as any business that contributed 20% or more of the Parent Company’s total cash distributions from businesses for the four most recently ended fiscal quarters. As of September 30, 2025, none of the defaults listed above resulted in a cross-default under the recourse debt of the Parent Company. Furthermore, none of the non-recourse debt in default listed above is guaranteed by the Parent Company.\nCritical Accounting Policies and Estimates\nThe condensed consolidated financial statements of AES are prepared in conformity with U.S. GAAP, which requires the use of estimates, judgments, and assumptions that affect the reported amounts of assets and liabilities at the date of the financial statements and the reported amounts of revenue and expenses during the periods presented. \nThe Company’s significant accounting policies are described in Note 1—\nGeneral and Summary of Significant Accounting Policies\n of our 2024 Form 10-K. The Company’s critical accounting estimates are described in Item 7.—\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\n in the 2024 Form 10-K. An accounting estimate is considered critical if the estimate requires management to make an assumption about matters that were highly uncertain at the time the estimate was made, if different estimates reasonably could have been used, or if changes in the estimate that would have a material impact on the Company’s financial condition or results of operations are reasonably likely to occur from period to period. Management believes that the accounting estimates employed are appropriate and resulting balances are reasonable; however, actual results could differ from the original estimates, requiring adjustments to these balances in future periods. The Company has reviewed and determined that these remain as critical accounting policies as of and for the nine months ended September 30, 2025."
}