{
  "source_file": "afl-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2.   Management’s Discussion and Analysis of Financial Condition and Results of Operations (MD&A)\nFORWARD-LOOKING INFORMATION\nThe Private Securities Litigation Reform Act of 1995 provides a safe harbor to encourage companies to provide prospective information, so long as those informational statements are identified as forward-looking and are accompanied by meaningful cautionary statements identifying important factors that could cause actual results to differ materially from those included in the forward-looking statements. Aflac Incorporated (the Parent Company) and its subsidiaries (collectively with the Parent Company, the Company) desire to take advantage of these provisions. This report contains cautionary statements identifying important factors that could cause actual results to differ materially from those projected herein, and in any other statements made by Company officials in communications with the financial community and contained in documents filed with the Securities and Exchange Commission (SEC). Forward-looking statements are not based on historical information and relate to future operations, strategies, financial results or other developments. Furthermore, forward-looking information is subject to numerous assumptions, risks and uncertainties. In particular, statements containing words such as the ones listed below or similar words, as well as specific projections of future results, generally qualify as forward-looking. The Company undertakes no obligation to update such forward-looking statements.\n• expect\n• anticipate\n• believe\n• goal\n• objective\n• may\n• should\n• estimate\n• intends\n• projects\n• will\n• assumes\n• potential\n• target\n• outlook\nThe Company cautions readers that the following factors, in addition to other factors mentioned from time to time, could cause actual results to differ materially from those contemplated by the forward-looking statements: \n•\ndifficult conditions in global capital markets and the economy, including inflation\n•\ndefaults and credit downgrades of investments\n•\nglobal fluctuations in interest rates and exposure to significant interest rate risk\n•\nconcentration of business in Japan \n•\nlimited availability of acceptable yen-denominated investments\n•\nforeign currency fluctuations in the yen/dollar exchange rate\n•\ndiffering interpretations applied to investment valuations\n•\nsignificant valuation judgments in determination of expected credit losses recorded on the Company's investments\n•\ndecreases in the Company's financial strength or debt ratings\n•\ndecline in creditworthiness of other financial institutions\n•\nthe Company's ability to attract and retain qualified sales associates, brokers, employees, and distribution partners\n•\ndeviations in actual experience from pricing and reserving assumptions\n•\nability to continue to develop and implement improvements in information technology systems and on successful execution of revenue growth and expense management initiatives\n•\ninterruption in telecommunication, information technology and other operational systems, or a failure to maintain the security, confidentiality, integrity or privacy of sensitive data residing on such systems, and uncertainty regarding the impact of the incident involving unauthorized access to the Company’s network in June 2025\n•\nsubsidiaries' ability to pay dividends to the Parent Company\n•\ninherent limitations to risk management policies and procedures\n•\noperational risks of third-party vendors\n•\ntax rates applicable to the Company may change\n•\nfailure to comply with restrictions on policyholder privacy and information security\n•\nextensive regulation and changes in law or regulation by governmental authorities\n•\ncompetitive environment and ability to anticipate and respond to market trends\n•\ncatastrophic events, including, but not limited to, as a result of climate change, epidemics, pandemics, tornadoes, hurricanes, earthquakes, tsunamis, war or other military action, major public health issues, terrorism or other acts of violence, and damage incidental to such events\n•\nability to protect the Aflac brand and the Company's reputation\n•\nability to effectively manage key executive succession\n•\nchanges in accounting standards\n•\nlevel and outcome of litigation or regulatory inquiries\n•\nallegations or determinations of worker misclassification in the United States\n79\nMD&A OVERVIEW\nMD&A is intended to inform the reader about matters affecting the financial condition and results of operations of Aflac Incorporated and its subsidiaries for the nine-month periods ended September 30, 2025 and 2024, respectively. Results of operations for interim periods are not necessarily indicative of results for the entire year. As a result, the following discussion should be read in conjunction with the consolidated financial statements and notes that are included in the Company's annual report on Form 10-K for the year ended December 31, 2024 (2024 Annual Report). In this MD&A, amounts may not foot due to rounding.\nThis MD&A is divided into the following sections:\nPage\nExecutive Summary\n81\nResults of Operations\n82\nInvestments\n101\nHedging Activities\n107\nDeferred Policy Acquisition Costs\n110\nPolicy Liabilities\n111\nBenefit Plans\n111\nPolicyholder Protection\n111\nLiquidity and Capital Resources\n111\nCritical Accounting Estimates\n117\n \n80\nEXECUTIVE SUMMARY\nCompany Overview\nAflac Incorporated (the Parent Company) and its subsidiaries (collectively, the Company) provide financial protection to millions of policyholders and customers in Japan and the United States (U.S.). The Company’s principal business is supplemental health and life insurance products with the goal to provide customers the best value in supplemental insurance products in Japan and the U.S. The Company's insurance business consists of two reporting segments: Aflac Japan and Aflac U.S.  The Parent Company’s primary insurance subsidiaries are Aflac Life Insurance Japan Ltd. in Japan (Aflac Japan) and American Family Life Assurance Company of Columbus (Aflac); Continental American Insurance Company (CAIC), branded as Aflac Group Insurance (AGI); American Family Life Assurance Company of New York (Aflac New York); Tier One Insurance Company (TOIC) and Aflac Benefits Solutions, Inc. (ABS), which provides a platform for Aflac Dental and Vision in the U.S. (collectively, Aflac U.S.). The Parent Company, other operating business units that are not individually reportable, reinsurance activities, including internal reinsurance activity with Aflac Re Bermuda Ltd. (Aflac Re), and other business activities not included in Aflac Japan or Aflac U.S., as well as intercompany eliminations, are included in Corporate and other.\nPerformance Highlights\nTotal revenues were $4.7 billion in the third quarter of 2025, compared with $2.9 billion in the third quarter of 2024, primarily due to net investment gains of $275 million in the third quarter of 2025 compared with net investment losses of $1.4 billion in the third quarter of 2024. Net earnings were $1.6 billion, or $3.08 per diluted share, in the third quarter of 2025, compared with $(93) million, or $(.17) per diluted share, in the third quarter of 2024.\nTotal revenues were $12.3 billion in the first nine months of 2025, compared with $13.5 billion in the first nine months of 2024, primarily due to net investment losses of $1.1 billion in the first nine months of 2025 compared with net investment gains of $239 million in the first nine months of 2024. Net earnings were $2.3 billion, or $4.21 per diluted share, in the first nine months of 2025, compared with $3.5 billion, or $6.23 per diluted share, in the first nine months of 2024.\nNet earnings in the third quarter of 2025 included net investment gains of $275 million, compared with net investment losses of $1.4 billion in the third quarter of 2024. Net investment gains in the third quarter of 2025 included $285 million of net gains from certain derivative and foreign currency gains or losses; $33 million of net gains from sales and redemptions; a $10 million gain from an increase in the fair value of equity securities; offset by an increase in credit loss allowances of $53 million.\nNet earnings in the first nine months of 2025 included net investment losses of $1.1 billion, compared with net investment gains of $239 million in the first nine months of 2024. Net investment losses in the first nine months of 2025 included $1.1 billion of net losses from certain derivative and foreign currency gains or losses; an increase in credit loss allowances of $166 million and $6 million of impairments; offset by $71 million of net gains from sales and redemptions and a $47 million gain from an increase in the fair value of equity securities.\nThe average yen/dollar exchange rate\n(1)\n for the three-month period ended September 30, 2025 was 147.68, or .2% stronger than the average yen/dollar exchange rate\n(1)\n of 147.95 for the same period in 2024. The average yen/dollar exchange rate\n(1)\n for the nine-month period ended September 30, 2025 was 148.03, or 1.7% stronger than the average yen/dollar exchange rate\n(1)\n of 150.60 for the same period in 2024.\nAdjusted earnings\n(2)\n in the third quarter of 2025 were $1.3 billion, or $2.49 per diluted share, compared with $1.2 billion, or $2.16 per diluted share in the third quarter of 2024. The slightly stronger yen/dollar exchange rate did not impact adjusted earnings per diluted share. Adjusted earnings\n(2)\n in the first nine months of 2025 were $3.2 billion, or $5.92 per diluted share, compared with $3.2 billion, or $5.64 per diluted share, in the first nine months of 2024. The stronger yen/dollar exchange rate positively impacted adjusted earnings per diluted share by $.03.\nIn the first nine months of 2025, Aflac Incorporated repurchased $2.7 billion, or 25.7 million of its common shares. At September 30, 2025, the Company had 121.6 million remaining shares authorized for repurchase. \nShareholders’ equity was $28.7 billion, or $54.57 per share, at September 30, 2025, compared with $26.1 billion, or $47.45 per share, at December 31, 2024. Shareholders’ equity at September 30, 2025 included a cumulative increase of $6.8 billion from the effect of changes in discount rate assumptions on insurance reserves, compared with a corresponding cumulative increase of $2.0 billion at December 31, 2024, and a net unrealized loss on investment securities and derivatives of $1.7 billion, compared with a net unrealized gain of $4 million at December 31, 2024. Shareholders’ equity at September 30, 2025 also included an unrealized foreign currency translation loss\n \nof $4.5 billion, \n81\ncompared with an unrealized foreign currency translation loss of $5.0 billion at December 31, 2024. The annualized return on average shareholders’ equity in the third quarter of 2025 was 23.5%.\nShareholders’ equity excluding accumulated other comprehensive income (AOCI)\n(2)\n (adjusted book value) was $28.0 billion, or $53.33 per share, at September 30, 2025, compared with $29.1 billion, or $52.87 per share, at December 31, 2024. Adjusted book value excluding foreign currency remeasurement\n(2)\n was $24.4 billion, or $46.35 per share, at September 30, 2025, compared with $23.4 billion, or $42.46 per share, at December 31, 2024. The annualized adjusted return on equity (ROE) excluding foreign currency remeasurement\n(2)\n in the third quarter of 2025 was 22.1%.\nCyber Incident\nAs previously disclosed\n, the Company identified an incident involving unauthorized access to its network in the U.S. on June 12, 2025. The Company promptly initiated its cybersecurity incident response protocols and continues to believe it contained the intrusion within hours. The Company's systems were not affected by ransomware, and the Company continues to serve its policyholders and underwrite policies, review claims, and otherwise service customers as usual. The Company also remains engaged with leading third-party cybersecurity experts to support the Company’s response to the incident.\nThe Company is aware of the exfiltration of certain data including claims information, health information, social security numbers and/or other personal information relating to a substantial number of customers, beneficiaries, employees, agents, and other individuals in the Company’s U.S. business. The Company is still in the process of validating the extent and nature of the files that were involved.\nBased on the information currently available and the investigation to date, as of the date of this report, the Company has not determined that the incident is reasonably likely to have a material impact on the Company’s financial condition or results of operations. However, the Company’s investigation remains ongoing and as a result, it does not yet know the full impact of the cybersecurity incident, including how much of the financial impact will be covered by insurance. As a result of the cybersecurity incident, the Company has incurred certain costs and may, depending on future developments, incur additional costs, including but not limited to: costs to provide credit monitoring, identity theft protection, and Medical Shield to impacted individuals and maintain a call center related to the provision of such services; incident response costs; expenses arising from potential litigation, governmental investigations, or enforcement actions; expenses related to compliance, finance, and legal advisory services; elevated cybersecurity insurance premiums; and costs incurred in meeting evolving legal and regulatory requirements concerning cybersecurity governance, monitoring, and disclosure. The costs associated with the incident to date, including the cost to investigate and respond to the incident as well as related legal and other professional services, resulted in a slight increase to the Company's expenses and are recorded in the insurance and other expenses line in the consolidated statement of earnings.  \n(1)\n Yen/U.S. dollar exchange rates are based on the published MUFG Bank, Ltd. telegraphic transfer middle rate (TTM).\n(2) \nSee the Results of Operations section of this MD&A for a definition of this non-U.S. GAAP financial measure.\nRESULTS OF OPERATIONS\nThe Company earns its revenues principally from insurance premiums and investments. The Company’s operating expenses primarily consist of insurance benefits provided and reserves established for anticipated future insurance benefits, general business expenses, commissions and other costs of selling and servicing its products. Profitability for the Company depends principally on its ability to price its insurance products at a level that enables the Company to earn a margin over the costs associated with providing benefits and administering those products. Profitability also depends on, among other items, actuarial and policyholder behavior experience on insurance products, and the Company's ability to attract and retain customer assets, generate and maintain favorable investment results, effectively deploy capital and utilize tax capacity, and manage expenses.  \nThis document includes references to the Company’s financial performance measures which are not calculated in accordance with United States generally accepted accounting principles (U.S. GAAP) (non-U.S. GAAP). The financial measures exclude items that the Company believes may obscure the underlying fundamentals and trends in insurance operations because they tend to be driven by general economic conditions and events or related to infrequent activities not directly associated with insurance operations.\nDue to the size of Aflac Japan, where the functional currency is the Japanese yen, fluctuations in the yen/dollar exchange rate can have a significant effect on reported results. In periods when the yen weakens, translating yen into dollars results in fewer dollars being reported. When the yen strengthens, translating yen into dollars results in more dollars being reported. Consequently, yen weakening has the effect of suppressing current period results in relation to the comparable prior period, while yen strengthening has the effect of magnifying current period results in relation to the comparable prior \n82\nperiod. A significant portion of the Company’s business is conducted in yen and never converted into dollars but translated into dollars for U.S. GAAP reporting purposes, which results in foreign currency impact to earnings, cash flows and book value on a U.S. GAAP basis. Management evaluates the Company's financial performance both including and excluding the impact of foreign currency translation to monitor, respectively, cumulative currency impacts and the currency-neutral operating performance over time. The average yen/dollar exchange rate is based on the published MUFG Bank, Ltd. telegraphic transfer middle rate (TTM).\nThe Company defines the non-U.S. GAAP financial measures included in this document as follows:\n•\nAdjusted earnings\n are adjusted revenues less benefits and adjusted expenses. Adjusted earnings per share (basic or diluted) are the adjusted earnings for the period divided by the weighted average outstanding shares (basic or diluted) for the period presented. The adjustments to both revenues and expenses account for certain items that are outside of management’s control because they tend to be driven by general economic conditions and events or are related to infrequent activities not directly associated with insurance operations. Adjusted revenues are U.S. GAAP total revenues excluding adjusted net investment gains and losses. Adjusted expenses are U.S. GAAP total acquisition and operating expenses including the impact of interest from derivatives associated with notes payable but excluding any non-recurring or other items not associated with the normal course of the Company’s insurance operations and that do not reflect the Company's underlying business performance. Management uses adjusted earnings and adjusted earnings per diluted share to evaluate the financial performance of the Company’s insurance operations on a consolidated basis and believes that a presentation of these financial measures is vitally important to an understanding of the underlying profitability drivers and trends of the Company’s insurance business. The most comparable U.S. GAAP financial measures for adjusted earnings and adjusted earnings per share (basic or diluted) are net earnings and net earnings per share, respectively.\n•\nAdjusted net investment gains and losses \nare net investment gains and losses adjusted for i) amortized hedge cost/income related to foreign currency exposure management strategies and certain derivative activity, ii) net interest income/expense from foreign currency and interest rate derivatives associated with certain investment strategies, which are both reclassified to net investment income, and iii) the impact of interest from derivatives associated with notes payable, which is reclassified to interest expense as a component of total adjusted expenses. The Company considers adjusted net investment gains and losses important as it represents the remainder amount that is considered outside management’s control, while excluding the components that are within management’s control and are accordingly reclassified to net investment income and interest expense. The most comparable U.S. GAAP financial measure for adjusted net investment gains and losses is net investment gains and losses.\n•\nAmortized hedge costs/income\n represent costs/income incurred or recognized as a result of using foreign currency derivatives to hedge certain foreign exchange risks in the Company's Japan segment or in Corporate and other. These amortized hedge costs/income are estimated at the inception of the derivatives based on the specific terms of each contract and are recognized on a straight-line basis over the contractual term of the derivative. The Company believes that amortized hedge costs/income measure the periodic currency risk management costs/income related to hedging certain foreign currency exchange risks and are an important component of net investment income. There is no comparable U.S. GAAP financial measure for amortized hedge costs/income.\n•\nAdjusted earnings excluding current period foreign currency impact\n are computed using the average foreign currency exchange rate for the comparable prior-year period, which eliminates fluctuations driven solely by foreign currency exchange rate changes. Adjusted earnings per diluted share excluding current period foreign currency impact is adjusted earnings excluding current period foreign currency impact divided by the weighted average outstanding diluted shares for the period presented. The Company considers adjusted earnings excluding current period foreign currency impact and adjusted earnings per diluted share excluding current period foreign currency impact important because a significant portion of the Company's business is conducted in Japan and foreign exchange rates are outside management’s control; therefore, the Company believes it is important to understand the impact of translating foreign currency (primarily Japanese yen) into U.S. dollars. The most comparable U.S. GAAP financial measures for adjusted earnings excluding current period foreign currency impact and adjusted earnings per diluted share excluding current period foreign currency impact are net earnings and net earnings per share, respectively. \n83\n•\nAdjusted book value \nis the U.S. GAAP book value (representing total shareholders’ equity), less accumulated other comprehensive income as recorded on the U.S. GAAP balance sheet. Adjusted book value per common share is adjusted book value at the period end divided by the ending outstanding common shares for the period presented. The Company considers adjusted book value and adjusted book value per common share important as they exclude accumulated other comprehensive income, which fluctuates due to market movements that are outside management’s control. The most comparable U.S. GAAP financial measures for adjusted book value and adjusted book value per common share are total book value and total book value per common share, respectively.\n•\nAdjusted book value excluding foreign currency remeasurement \nis the U.S. GAAP book value (representing total shareholders’ equity), less accumulated other comprehensive income as recorded on the U.S. GAAP balance sheet and excluding the cumulative (beginning January 1, 2021) foreign currency gains/losses associated with i) foreign currency remeasurement and ii) sales and redemptions of invested assets. Adjusted book value excluding foreign currency remeasurement per common share is adjusted book value excluding foreign currency remeasurement at the period end divided by the ending outstanding common shares for the period presented. The Company considers adjusted book value excluding foreign currency remeasurement and adjusted book value excluding foreign currency remeasurement per common share important as they exclude both accumulated other comprehensive income and the cumulative foreign currency remeasurement gains/losses, which fluctuate due to market movements that are outside management's control. The most comparable U.S. GAAP financial measures for adjusted book value excluding foreign currency remeasurement and adjusted book value excluding foreign currency remeasurement per common share are total book value and total book value per common share, respectively.\n•\nAdjusted return on equity\n is annualized adjusted earnings divided by average shareholders’ equity, excluding accumulated other comprehensive income. Management uses adjusted return on equity to evaluate the financial performance of the Company’s insurance operations on a consolidated basis and believes that a presentation of this financial measure is vitally important to an understanding of the underlying profitability drivers and trends of the Company’s insurance business. The Company considers adjusted return on equity important as it excludes components of accumulated other comprehensive income, which fluctuate due to market movements that are outside management's control. The most comparable U.S. GAAP financial measure for adjusted return on equity is return on average equity as determined using annualized net earnings and average total shareholders’ equity.\n•\nAdjusted return on equity excluding foreign currency remeasurement \nis annualized adjusted earnings divided by average shareholders’ equity, excluding both accumulated other comprehensive income and the cumulative (beginning January 1, 2021) foreign currency gains/losses associated with i) foreign currency remeasurement and ii) sales and redemptions of invested assets. The Company considers adjusted return on equity excluding foreign currency remeasurement important because it excludes both accumulated other comprehensive income and the cumulative foreign currency remeasurement gains/losses, which fluctuate due to market movements that are outside management's control. The most comparable U.S. GAAP financial measure for adjusted return on equity excluding foreign currency remeasurement is return on average equity as determined using annualized net earnings and average total shareholders’ equity.\n•\nU.S. dollar-denominated investment income excluding foreign currency impact\n represents amounts excluding foreign currency impact on U.S. dollar-denominated investment income using the average foreign currency exchange rate for the comparable prior year period. The Company considers U.S. dollar-denominated investment income excluding foreign currency impact important as it eliminates the impact of foreign currency changes on the Aflac Japan segment results, which are outside management’s control. The most comparable U.S. GAAP financial measure for U.S. dollar-denominated investment income excluding foreign currency impact is the corresponding net investment income amount from the U.S. dollar denominated investments translated to yen.\n84\nThe following table is a reconciliation of items impacting adjusted earnings and adjusted earnings per diluted share to the most directly comparable U.S. GAAP financial measures of net earnings and net earnings per diluted share, respectively.\nReconciliation of Net Earnings to Adjusted Earnings\n \n \nIn Millions\nPer Diluted Share\nIn Millions\nPer Diluted Share\nThree Months Ended September 30,\nNine Months Ended September 30,\n2025\n2024\n2025\n2024\n2025\n2024\n2025\n2024\nNet earnings\n$\n1,639\n \n$\n(93)\n$\n3.08\n \n$\n(.17)\n$\n2,267\n \n$\n3,541 \n$\n4.21\n \n$\n6.23 \nItems impacting net earnings:\nAdjusted net investment (gains) losses \n(1)\n(335)\n1,347 \n(.63)\n2.40 \n966\n \n(411)\n1.79\n \n(.72)\nOther and non-recurring (income) loss\n1\n \n0 \n.00\n \n.00 \n54\n \n1 \n.10\n \n.00 \nIncome tax (benefit) expense on items excluded from adjusted earnings\n22\n \n(43)\n.04\n \n(.08)\n(97)\n76 \n(.18)\n.13 \nAdjusted earnings\n1,327\n \n1,211 \n2.49\n \n2.16 \n3,190\n \n3,207 \n5.92\n \n5.64 \nCurrent period foreign currency impact \n(2)\n(1)\nN/A\n.00\n \nN/A\n(16)\nN/A\n(.03)\nN/A\nAdjusted earnings excluding current period foreign currency impact\n$\n1,326\n \n$\n1,211 \n$\n2.49\n \n$\n2.16 \n$\n3,174\n \n$\n3,207 \n$\n5.89\n \n$\n5.64 \n(1)\n See reconciliation of net investment (gains) losses to adjusted net investment (gains) losses below.\n(2) \nPrior period foreign currency impact reflected as “N/A” to isolate change for current period only.\nReconciling Items\nNet Investment Gains and Losses\nThe following table is a reconciliation of items impacting adjusted net investment (gains) losses to the most directly comparable U.S. GAAP financial measure of net investment (gains) losses.\nReconciliation of Net Investment (Gains) Losses to Adjusted Net Investment (Gains) Losses\nThree Months Ended September 30,\nNine Months Ended September 30,\n(In millions)\n2025\n2024\n2025\n2024\nNet investment (gains) losses\n$\n(275)\n$\n1,408 \n$\n1,109\n \n$\n(239)\nItems impacting net investment (gains) losses:\nAmortized hedge costs\n(13)\n(7)\n(31)\n(19)\nAmortized hedge income\n20\n \n25 \n80\n \n87 \nNet interest income (expense) from derivatives associated \n  with certain investment strategies\n(66)\n(88)\n(195)\n(265)\nImpact of interest from derivatives associated with notes payable\n(1)\n8 \n3\n \n25 \nAdjusted net investment (gains) losses\n$\n(335)\n$\n1,347 \n$\n966\n \n$\n(411)\nThe Company's investment strategy is to invest primarily in fixed maturity securities to provide a reliable stream of investment income, which is one of the drivers of the Company’s profitability. This investment strategy incorporates asset-liability matching (ALM) to align the expected cash flows of the portfolio to the needs of the Company's liability structure. The Company does not purchase securities with the intent of generating investment gains or losses. However, investment gains and losses may be realized as a result of changes in the financial markets and the creditworthiness of specific issuers, tax planning strategies, and/or general portfolio management and rebalancing. The realization of investment gains and losses is independent of the underwriting and administration of the Company's insurance products. \n85\nNet investment gains and losses excluded from adjusted earnings include the following:\n•\nSecurities Transactions\n•\nCredit Losses \n•\nChanges in the Fair Value of Equity Securities \n•\nCertain Derivative and Foreign Currency Activities.  \nSecurities Transactions, Credit Losses and Changes in the Fair Value of Equity Securities\nSecurities transactions include gains and losses from sales and redemptions of investments where the amount received is different from the amortized cost of the investment. Credit losses include losses for held-to-maturity fixed maturity securities, available-for-sale fixed maturity securities, loan receivables, loan commitments and reinsurance recoverables. Changes in the fair value of equity securities are the result of gains or losses driven by fluctuations in market prices.\nCertain Derivative and Foreign Currency Activities\nThe Company's derivative activities include:\n•\nforeign currency forwards and options used in hedging foreign exchange risk on U.S. dollar-denominated investments in Aflac Japan's portfolio, with options used on a standalone basis and/or in a collar strategy;\n•\nforeign currency forwards and options used to economically hedge certain portions of forecasted cash flows denominated in yen and hedge the Company's long term exposure to a weakening yen;\n•\nforeign currency swaps used to hedge the foreign currency exchange risk associated with certain investments denominated in other foreign currencies in Aflac Japan's portfolio;\n•\ncross-currency swaps, also referred to as foreign currency swaps, associated with certain senior notes and subordinated debentures;\n•\nforeign currency swaps that are associated with variable interest entity (VIE) bond purchase commitments, and investments in special-purpose entities, including VIEs where the Company is the primary beneficiary;\n•\ninterest rate swaps used to economically hedge interest rate fluctuations in certain variable-rate investments;\n•\ninterest rate swaptions used to hedge changes in the fair value associated with interest rate fluctuations for certain U.S. dollar-denominated available-for-sale fixed-maturity securities; and\n•\nbond purchase commitments at the inception of investments in consolidated VIEs.\nGains and losses are recognized as a result of valuing these derivatives, net of the effects of hedge accounting. \nThe Company also excludes from adjusted earnings the accounting impacts of foreign currency remeasurement associated with changes in the foreign currency exchange rate.\nFor additional information regarding net investment gains and losses, including details of reported amounts for the periods presented, see Notes 3 and 4 of the Notes to the Consolidated Financial Statements.\nOther and Non-recurring Items\nThe U.S. insurance industry has a policyholder protection system that provides funds for the policyholders of insolvent insurers. The system can result in periodic charges to the Company as a result of insolvencies/bankruptcies that occur with other companies in the life insurance industry. Some states permit member insurers to recover assessments paid through full or partial premium tax offsets. These charges neither relate to the ordinary course of the Company’s business nor reflect the Company’s underlying business performance, but result from external situations not controlled by the Company. The Company excludes any charges associated with U.S. guaranty fund assessments and the corresponding tax benefit or expense from adjusted earnings.\nIn Japan, the government also requires the insurance industry to contribute to a policyholder protection corporation that provides funds for the policyholders of insolvent insurers; however, these costs are calculated and administered differently than in the U.S.  In Japan, these costs are not directly related to specific insolvencies or bankruptcies, but are rather a regular operational cost for an insurance company. Based on this structure, the Company does not remove the Japan policyholder protection expenses from adjusted earnings.\n86\nThe Company considers the costs associated with the early redemption of its debt to be unrelated to the underlying fundamentals and trends in its insurance operations. Additionally, these costs are driven by changes in interest rates subsequent to the issuance of the debt, and the Company considers these interest rate changes to represent economic conditions not directly associated with its insurance operations.\nIn January 2025, as part of the U.S. defined benefit plan freeze, the Company purchased a nonparticipating single premium group annuity contract from an external insurer to settle its obligations under the plan and paid to the insurer the related annuity premium. As a result, the Company recognized a settlement charge of $55 million in the first quarter of 2025. The settlement charge was both unusual and non-recurring; therefore, the Company excluded the settlement charge from adjusted earnings.\nForeign Currency Translation\nAflac Japan’s premiums and a significant portion of its investment income are received in yen, and its claims and most expenses are paid in yen. Aflac Japan purchases yen-denominated assets and U.S. dollar-denominated assets, which may be hedged to yen, to support yen-denominated policy liabilities. Yen-denominated income statement accounts are translated to U.S. dollars using the weighted average Japanese yen/U.S. dollar foreign exchange rate for the reporting period, except realized gains and losses on securities transactions which are translated at the exchange rate on the trade date of each transaction. Yen-denominated balance sheet accounts are translated to U.S. dollars using the spot Japanese yen/U.S. dollar foreign exchange rate at the end of the reporting period. \nIn recent periods, the Japanese yen has weakened against the U.S. dollar; however, the yen strengthened against the U.S. dollar during the first nine months of 2025. Although the Company is unable to predict the timing or extent of future movements of the Japanese yen/U.S. dollar foreign exchange rate, the Company maintains hedging strategies (see the Hedging Activities section of this MD&A) that are intended to mitigate the impacts of yen fluctuation on the Company’s financial position and results of operations. See the risk factor entitled “The Company is exposed to foreign currency fluctuations in the yen/dollar exchange rate” in Item 1A. Risk Factors of the 2024 Annual Report for more information.\nIncome Taxes\nThe Company's combined U.S. and Japanese effective income tax rate on pretax earnings was 17.8% for the three-month period ended September 30, 2025, compared with 201.8% for the same period in 2024. The Company's combined U.S. and Japanese effective income tax rate on pretax earnings was 23.4% for the nine-month period ended September 30, 2025, compared with 17.3% for the same period in 2024. The combined effective tax rate differs from the U.S. statutory rate primarily due to the exclusion of foreign currency translation gains and losses on certain Aflac Japan U.S. dollar-denominated investments held in the Delaware Statutory Trust and the impact of historic and solar tax credits.\nFor additional information, see Note 10 of the Notes to the Consolidated Financial Statements and the Critical Accounting Estimates - Income Taxes section of Item 7. MD&A in the 2024 Annual Report. The effective tax rate continues to be subject to future tax law changes both in the U.S. and in foreign jurisdictions. See the risk factor entitled \"Tax rates applicable to the Company may change\" in Item 1A. Risk Factors of the 2024 Annual Report for more information.\n87\nReconciliation of Book Value to Adjusted Book Value\n(Excluding Foreign Currency Remeasurement)\nThe following table is a reconciliation of items impacting adjusted book value and adjusted book value per diluted share excluding foreign currency remeasurement to the most directly comparable U.S. GAAP financial measures of book value and book value per diluted share, respectively.\n(In millions, except for share and per-share amounts)\nSeptember 30,\n2025\nDecember 31,\n2024\nU.S. GAAP book value\n$\n28,688\n \n$\n26,098 \nItems impacting U.S. GAAP book value:\nUnrealized foreign currency translation gains (losses)\n(4,504)\n(4,998)\nUnrealized gains (losses) on securities and derivatives\n(1,717)\n4 \nEffect of changes in discount rate assumptions\n6,832\n \n2,006 \nPension liability adjustment\n42\n \n10 \nTotal accumulated other comprehensive income\n653\n \n(2,978)\nAdjusted book value\n28,035\n \n29,076 \nForeign currency remeasurement gains (losses)\n3,666\n \n5,725 \nAdjusted book value excluding foreign currency remeasurement\n24,369\n \n23,351 \nNumber of shares outstanding at end of period\n525,710\n \n549,964 \nU.S. GAAP book value per common share\n$\n54.57\n \n$\n47.45 \nItems impacting U.S. GAAP book value per common share:\nUnrealized foreign currency translation gains (losses) per common share\n(8.57)\n(9.09)\nUnrealized gains (losses) on securities and derivatives per common share\n(3.27)\n.01 \nEffect of changes in discount rate assumptions per common share\n13.00\n \n3.65 \nPension liability adjustment per common share\n.08\n \n.02 \nTotal accumulated other comprehensive income per common share\n1.24\n \n(5.41)\nAdjusted book value per common share\n53.33\n \n52.87 \nForeign currency remeasurement gains (losses) per common share\n6.97\n \n10.41 \nAdjusted book value excluding foreign currency remeasurement per \n  common share\n46.35\n \n42.46 \n88\nReconciliation of Return on Equity to Adjusted Return on Equity\n(Excluding Foreign Currency Remeasurement)\nThe following table is a reconciliation of items impacting adjusted return on equity excluding foreign currency remeasurement to the most directly comparable U.S. GAAP financial measure of return on equity.\nThree Months Ended September 30,\n2025\n2024\nU.S. GAAP return on equity - net earnings \n(1)\n23.5\n \n%\n(1.5)\n%\nImpact of excluding unrealized foreign currency translation gains (losses)\n(5.4)\n.3 \nImpact of excluding unrealized gains (losses) on securities and derivatives\n(2.2)\n.0 \nImpact of excluding effect of changes in discount rate assumptions\n7.7\n \n.0 \nImpact of excluding pension liability adjustment\n.1\n \n.0 \nImpact of excluding accumulated other comprehensive income\n.1\n \n.2 \nU.S. GAAP return on equity less accumulated other comprehensive income\n23.5\n \n(1.3)\nDifferences between adjusted earnings and net earnings \n(2)\n(4.5)\n18.0 \nAdjusted return on equity - reported\n19.1\n \n16.7 \nImpact of excluding gains (losses) associated with foreign currency remeasurement \n(3)\n3.0\n \n3.5\nAdjusted return on equity excluding foreign currency remeasurement\n22.1\n \n20.2 \n(1) \nU.S. GAAP return on equity is calculated by dividing net earnings (annualized) by average shareholders' equity.\n(2) \nSee separate reconciliation of net earnings to adjusted earnings above.\n(3)\n Impact of gains/losses associated with foreign currency remeasurement is calculated by excluding the cumulative (beginning January 1, 2021) foreign currency gains/losses associated with i) foreign currency remeasurement and ii) sales and redemptions of invested assets. The impact is the difference of adjusted return on equity - reported compared with adjusted return on equity, excluding from shareholders' equity, gains/losses associated with foreign currency remeasurement.\nRESULTS OF OPERATIONS BY SEGMENT\nU.S. GAAP financial reporting requires that a company report financial and descriptive information about operating segments in its annual and interim period financial statements. Furthermore, the Company is required to report a measure of segment profit or loss, certain revenue and expense items, and segment assets. The Company's insurance business consists of two segments: Aflac Japan and Aflac U.S.  Aflac Japan is the principal contributor to consolidated earnings. In addition, the Parent Company, other business units that are not individually reportable, reinsurance activities, including internal reinsurance activity with Aflac Re, and other business activities not included in Aflac Japan or Aflac U.S., as well as intercompany eliminations, are included in Corporate and other. See Item 1. Business in the 2024 Annual Report for a summary of each segment's products and distribution channels. \nConsistent with U.S. GAAP guidance for segment reporting, pretax adjusted earnings is the Company's U.S. GAAP measure of segment performance. The Company believes that a presentation of this measure is vitally important to an understanding of the underlying profitability drivers and trends of its business. Additional performance measures used to evaluate the financial condition and performance of the Company's segments are listed below.\n•\nOperating Ratios\n•\nNew Annualized Premium Sales\n•\nNew Money Yield \n•\nReturn on Average Invested Assets\n•\nAverage Weekly Producer\n•\nPremium Persistency\nFor additional information on the Company’s performance measures included in this MD&A, see the Glossary of Selected Terms found directly following Part II. Other Information. See Note 2 of the Notes to the Consolidated Financial Statements for the reconciliation of segment results to the Company's consolidated U.S. GAAP results and additional information. \n89\nAFLAC JAPAN SEGMENT\nAflac Japan Pretax Adjusted Earnings\nChanges in Aflac Japan’s pretax adjusted earnings and profit margins are primarily affected by morbidity, mortality, expenses, persistency and investment yields. The following table presents a summary of operating results for Aflac Japan.\nAflac Japan Summary of Operating Results\nIn Dollars\nIn Yen\n  \nThree Months Ended September 30,\nNine Months Ended September 30,\nThree Months Ended September 30,\nNine Months Ended September 30,\n(In millions of dollars and billions of yen)\n2025\n2024\n2025\n2024\n2025\n2024\n2025\n2024\nNet earned premiums \n(1)\n$\n1,663\n \n$\n1,709 \n$\n5,105\n \n$\n5,241 \n¥\n245\n \n¥\n255 \n¥\n756\n \n¥\n793 \nNet investment income: \n(2)\nYen-denominated investment income\n217\n \n215 \n687\n \n673 \n32\n \n32 \n102\n \n102 \nU.S. dollar-denominated investment income\n461\n \n453 \n1,294\n \n1,382 \n68\n \n68 \n191\n \n209 \nNet investment income\n678\n \n668 \n1,981\n \n2,055 \n100\n \n100 \n293\n \n311 \nAmortized hedge costs\n13\n \n7 \n31\n \n19 \n2\n \n1 \n5\n \n3 \nAdjusted net investment income\n665\n \n662 \n1,950\n \n2,036 \n98\n \n99 \n288\n \n309 \nOther income (loss)\n7\n \n7 \n24\n \n20 \n1\n \n1 \n4\n \n3 \nTotal adjusted revenues\n2,335\n \n2,378 \n7,079\n \n7,297 \n344\n \n355 \n1,048\n \n1,104 \nBenefits and claims:\nBenefits and claims, excluding reserve remeasurement\n1,130\n \n1,197 \n3,446\n \n3,614 \n167\n \n179 \n511\n \n547 \nReserve remeasurement (gains) losses\n(474)\n(369)\n(513)\n(421)\n(71)\n(54)\n(76)\n(61)\nTotal benefits and claims, net\n656\n \n828 \n2,933\n \n3,193 \n96\n \n126 \n434\n \n485 \nAdjusted expenses:\nAmortization of deferred policy acquisition costs\n81\n \n82 \n245\n \n242 \n12\n \n12 \n36\n \n37 \nInsurance commissions\n111\n \n110 \n328\n \n330 \n16\n \n16 \n49\n \n50 \nInsurance and other expenses\n271\n \n285 \n845\n \n785 \n40\n \n42 \n125\n \n119 \nTotal adjusted expenses\n463\n \n477 \n1,418\n \n1,357 \n68\n \n71 \n210\n \n205 \nTotal benefits and adjusted expenses\n1,119\n \n1,305 \n4,351\n \n4,550 \n165\n \n197 \n644\n \n690 \nPretax adjusted earnings\n$\n1,216\n \n$\n1,073 \n$\n2,728\n \n$\n2,747 \n¥\n180\n \n¥\n159 \n¥\n404\n \n¥\n414 \nWeighted-average yen/dollar exchange rate\n147.68\n \n147.95 \n148.03\n \n150.60 \n—\n \n— \n—\n \n— \nPercentage change over previous period:\nNet earned premiums\n(2.7)\n%\n(13.4)\n%\n(2.6)\n%\n(15.6)\n%\n(4.0)\n%\n(10.5)\n%\n(4.6)\n%\n(7.4)\n%\nAdjusted net investment income\n.5\n \n(2.5)\n(4.2)\n5.7 \n(.9)\n.1 \n(6.5)\n15.2 \nTotal adjusted revenues\n(1.8)\n(10.6)\n(3.0)\n(10.6)\n(3.1)\n(7.8)\n(5.1)\n(2.0)\nTotal benefits and claims, net\n(20.8)\n(35.6)\n(8.1)\n(22.1)\n(23.2)\n(32.4)\n(10.5)\n(14.0)\nTotal adjusted expenses\n(2.9)\n(5.7)\n4.5\n \n(14.4)\n(3.9)\n(2.8)\n2.4\n \n(6.2)\nPretax adjusted earnings\n13.3\n \n23.5 \n(.7)\n10.8 \n13.1\n \n25.5 \n(2.4)\n20.3 \n(1) \nIncludes a gain (loss) of $(55) and $(75) for the three-month periods and $(55) and $(80) for the nine-month periods ended September 30, 2025 and 2024, respectively, related to remeasurement of the deferred profit liability for limited-payment contracts.\n(2) \nNet interest income/expense from derivatives associated with certain investment strategies of $(59) and $(79) for the three-month periods and $(176) and $(237) for the nine-month periods ended September 30, 2025 and 2024, respectively, have been reclassified from net investment gains (losses) and included in adjusted earnings as a component of net investment income.\n90\nFor the three-month period ended September 30, 2025, operating results in yen terms compared to the same period in the previous year were as follows:\n•\nNet earned premiums decreased primarily due to approximately ¥7 billion related to the internal cancer reinsurance transaction with Aflac Re established in the fourth quarter of 2024 and approximately ¥4 billion from limited-pay products reaching premium paid-up status. Net earned premiums also reflect a remeasurement loss of approximately ¥8 billion related to assumption updates of the deferred profit liability for limited-payment contracts in the third quarter of 2025, compared to a loss of approximately ¥11 billion in 2024.\n•\nAdjusted net investment income was relatively flat.\n•\nTotal adjusted revenues decreased primarily due to the decrease in net earned premiums.\n•\nTotal benefits and claims decreased primarily due to approximately ¥68 billion of reserve remeasurement gains related to assumption updates in the third quarter of 2025, compared to reserve remeasurement gains of approximately ¥50 billion in the third quarter of 2024, as well as the internal cancer reinsurance transaction with Aflac Re established in the fourth quarter of 2024.\n•\nTotal adjusted expenses decreased primarily due to the impact of the internal cancer reinsurance transaction with Aflac Re established in the fourth quarter of 2024 and an increase in the capitalization of deferred policy acquisition costs resulting from higher sales.\n•\nPretax adjusted earnings increased primarily due to the decrease in total benefits and claims, partially offset by the decrease in total adjusted revenues.\nFor the nine-month period ended September 30, 2025, operating results in yen terms compared to the same period in the previous year were as follows:\n•\nNet earned premiums decreased primarily due to approximately ¥21 billion related to the internal cancer reinsurance transaction with Aflac Re established in the fourth quarter of 2024 and approximately ¥11 billion from limited-pay products reaching premium paid-up status. Net earned premiums also reflect a remeasurement loss of approximately ¥8 billion related to assumption updates of the deferred profit liability for limited-payment contracts in the third quarter of 2025, compared to a loss of approximately ¥11 billion in 2024. \n•\nAdjusted net investment income decreased primarily due to lower floating rate income.\n•\nTotal adjusted revenues decreased primarily due to the decreases in net earned premiums and adjusted net investment income.\n•\nTotal benefits and claims decreased primarily due to approximately ¥68 billion of reserve remeasurement gains related to assumption updates in the third quarter of 2025, compared to reserve remeasurement gains of approximately ¥50 billion in the third quarter of 2024, as well as the internal cancer reinsurance transaction with Aflac Re established in the fourth quarter of 2024.\n•\nTotal adjusted expenses increased primarily due to an increase in technology expenses, partially offset by the impact of the internal cancer reinsurance transaction with Aflac Re established in the fourth quarter of 2024.\n•\nPretax adjusted earnings decreased primarily due to the decrease in total adjusted revenues, partially offset by the decrease in total benefits and claims.\nAnnualized premiums in force decreased 2.5% to ¥1.19 trillion as of September 30, 2025, compared with ¥1.22 trillion as of September 30, 2024. The decrease in annualized premiums in force in yen was driven primarily by limited-pay products reaching premium paid-up status. Annualized premiums in force, translated into dollars at respective period-end exchange rates, were $8.0 billion at September 30, 2025, compared with $8.5 billion at September 30, 2024. As of September 30, 2025, Aflac Japan exceeded 22 million individual policies in force in Japan, with approximately 14 million cancer policies in force in Japan.\nAflac Japan's investment portfolios include U.S. dollar-denominated securities and reverse dual-currency securities (yen-denominated debt securities with dollar coupon payments). In years when the yen strengthens in relation to the dollar, translating Aflac Japan's U.S. dollar-denominated investment income into yen lowers growth rates for net investment income, total adjusted revenues, and pretax adjusted earnings in yen terms. In years when the yen weakens, translating U.S. dollar-denominated investment income into yen magnifies growth rates for net investment income, total adjusted revenues, and pretax adjusted earnings in yen terms.\nThe following table illustrates the effect of translating Aflac Japan’s U.S. dollar-denominated investment income and related items into yen by comparing certain segment results with those that would have been reported had foreign currency exchange rates remained unchanged from the comparable period in the prior year. Amounts excluding foreign \n91\ncurrency impact on U.S. dollar-denominated investment income were determined using the average foreign currency exchange rate for the comparable prior year period. See non-U.S. GAAP financial measures defined above.\nAflac Japan Percentage Changes Over Previous Period\n(Yen Operating Results)\nFor the Periods Ended September 30,\n \n \nIncluding Foreign\nCurrency Changes\nExcluding Foreign \nCurrency Changes\nThree Months\nNine Months\nThree Months \nNine Months\n \n \n2025\n2024\n2025\n2024\n2025\n2024\n2025\n2024\nAdjusted net investment income\n(.9)\n%\n.1 \n%\n(6.5)\n%\n15.2 \n%\n(.9)\n%\n(1.9)\n%\n(5.4)\n%\n8.4 \n%\nTotal adjusted revenues\n(3.1)\n(7.8)\n(5.1)\n(2.0)\n(3.1)\n(8.3)\n(4.7)\n(3.7)\nPretax adjusted earnings\n13.1\n \n25.5 \n(2.4)\n20.3 \n13.1\n \n24.0 \n(1.6)\n15.1 \nThe following table presents a summary of operating ratios in yen terms for Aflac Japan followed by a discussion of the significant drivers of changes in operating ratios in yen compared to the same periods in the previous year.\n \n \nThree Months Ended September 30,\nNine Months Ended September 30,\nRatios to total adjusted revenues:\n2025\n2024\n2025\n2024\nTotal benefits and claims, net\n28.0\n \n%\n35.3 \n%\n41.5\n \n%\n44.0 \n%\nAdjusted expenses:\nAmortization of deferred policy acquisition costs\n3.5\n \n3.4 \n3.5\n \n3.3 \nInsurance commissions\n4.8\n \n4.6 \n4.6\n \n4.5 \nInsurance and other expenses\n11.6\n \n11.9 \n11.9\n \n10.7 \nTotal adjusted expenses\n19.8\n \n20.0 \n20.0\n \n18.6 \nPretax adjusted earnings\n52.2\n \n44.7 \n38.5\n \n37.5 \nRatios to total premiums:\nTotal benefits and claims, net\n39.3\n \n%\n49.2 \n%\n57.5\n \n%\n61.2 \n%\nAdjusted expenses:\nAmortization of deferred policy acquisition costs\n4.9\n \n4.8 \n4.8\n \n4.6 \n•\nFor the three- and nine-month periods ended September 30, 2025, the total benefits and claims to total premiums ratio decreased primarily due to lower benefits following assumption updates in the third quarter of 2025. For the full year of 2025, the Company expects Aflac Japan to generate a benefit ratio in the range of 58% to 60% as a result of the impact from assumption updates in the third quarter of 2025.\n•\nFor the three-month period ended September 30, 2025, the total adjusted expense ratio decreased primarily due to the decrease in total adjusted expenses associated with reinsurance activity and an increase in the capitalization of deferred policy acquisition costs resulting from higher sales. For the nine-month period ended September 30, 2025, the total adjusted expense ratio increased primarily due to an increase in technology expenses.\n•\nIn total, the pretax adjusted profit margin increased in the three- and nine-month periods ended September 30, 2025 primarily due to the lower benefit ratio.\nThe following table presents Aflac Japan's premium persistency on a 12-month rolling basis as of September 30.\n2025\n2024\nPremium persistency\n93.3\n \n%\n93.3 \n%\n92\nAflac Japan Sales\nThe following table presents Aflac Japan’s new annualized premium sales for the periods ended September 30.\n \n \nIn Dollars\nIn Yen\nThree Months\nNine Months\nThree Months\nNine Months\n(In millions of dollars and billions of yen)\n2025\n2024\n2025\n2024\n2025\n2024\n2025\n2024\nNew annualized premium sales\n$\n133\n \n$\n117 \n$\n369\n \n$\n309 \n¥\n19.6\n \n¥\n17.5 \n¥\n54.4\n \n¥\n46.9 \nIncrease (decrease) over prior period\n13.5\n \n%\n8.6 \n%\n19.4\n \n%\n(4.8)\n%\n11.8\n \n%\n12.3 \n%\n16.1\n \n%\n4.4 \n%\nThe increase in new annualized premium sales on a yen basis in the third quarter and first nine months of 2025 was driven primarily by continued strong sales of the new cancer insurance product,\n Miraito\n, that was launched in certain sales channels in mid-March 2025 and available in all sales channels starting in the second quarter of 2025 as well as sales of \nTsumitasu\n for the first nine months of 2025.\nThe following table details the contributions to Aflac Japan's new annualized premium sales by major insurance product for the periods ended September 30.\n  \nThree Months\nNine Months\n  \n2025\n2024\n2025\n2024\nCancer\n70.0\n \n%\n55.1 \n%\n68.5\n \n%\n58.6 \n%\nMedical and other health\n10.7\n \n12.4 \n12.0\n \n16.2 \nLife insurance:\nTraditional life \n(1)\n17.7\n \n30.8 \n17.6\n \n21.5 \nWAYS\n1.0\n \n.8 \n1.2\n \n2.5 \nChild endowment\n.1\n \n.1 \n.1\n \n.2 \nOther\n.5\n \n.8 \n.6\n \n1.0 \n    Total\n100.0\n \n%\n100.0 \n%\n100.0\n \n%\n100.0 \n%\n(1) \nIncludes term life, whole life and Tsumitasu\nThe foundation of Aflac Japan's product portfolio has been, and continues to be, third sector products, which include cancer, medical and other products. With continued cost pressure on Japan’s health care system, the Company expects the need for third sector products will continue to rise in the future and that the medical and cancer insurance products Aflac Japan provides will continue to be an important part of its product portfolio. Additionally, the Company believes that sales of first sector products, including \nTsumitasu,\n WAYS and Child Endowment, position Aflac Japan for potential future long-term sales opportunities by marketing these products to a younger demographic as well as potential cross-selling opportunities of Aflac Japan's third sector products. \nAflac Japan continues to promote digital and web-based sales to groups and use of its system that enables smart device-based insurance application by allowing the customer and an Aflac Japan operator to see the same screen through their smart devices. Further, Aflac Japan continues to utilize its virtual sales tool that enables online consultations and policy applications to be completed entirely online.\nThe following table details the contributions to Aflac Japan's new annualized premium sales by agency type for the three-month periods ended September 30.\n2025\n2024\nIndependent corporate and individual\n45.1\n \n%\n46.2 \n%\nAffiliated corporate \n(1)\n51.4\n \n50.2 \nBank\n3.5\n \n3.6 \nTotal\n100.0\n \n%\n100.0 \n%\n(1) \nIncludes Japan Post Group, Dai-ichi Life and Daido Life\n93\nDuring the three-month period ended September 30, 2025, Aflac Japan recruited 73 new sales agencies. At September 30, 2025, Aflac Japan was represented by more than 6,300 sales agencies, with approximately 112,000 licensed sales associates employed by those agencies. The number of sales agencies has declined in recent years due to Aflac Japan's focus on supporting agencies with strong management frameworks, high productivity and more producing agents.\nAt September 30, 2025, Aflac Japan had agreements to sell its products at 358 banks, approximately 90% of the total number of banks in Japan.\nAflac Japan Investments\nThe level of investment income in yen is affected by available cash flow from operations, the timing of investing the cash flow, yields on new investments, the effect of yen/dollar exchange rates on U.S. dollar-denominated investment income, and other factors. \nAs part of the Company's portfolio management and asset allocation process, Aflac Japan invests in yen and U.S. dollar-denominated investments. Yen-denominated investments primarily consist of Japan Government Bonds (JGBs), public and private fixed maturity securities and public equity securities. Aflac Japan's U.S. dollar-denominated investments include fixed maturity investments, loan receivables, and growth assets, including alternative investments in limited partnerships or similar investment vehicles. Aflac Japan invests in both publicly traded and privately originated U.S. dollar-denominated investment-grade and below-investment-grade fixed maturity securities and loan receivables, and has entered into foreign currency derivatives to economically hedge the currency risk on the fair value of a portion of the U.S. dollar investments. \n94\nThe following table details the investment purchases for Aflac Japan.\nThree Months Ended September 30,\nNine Months Ended September 30,\n(In millions)\n2025\n2024\n2025\n2024\nYen-denominated:\n  Fixed maturity securities:\n     Japan government and agencies\n$\n514\n \n$\n0 \n$\n5,122\n \n$\n0 \n     Private placements\n182\n \n0 \n182\n \n131 \n     Other fixed maturity securities\n19\n \n50 \n165\n \n290 \n  Equity securities \n122\n \n159 \n360\n \n335 \n  Other investments\n24\n \n6 \n41\n \n20 \nTotal yen-denominated\n$\n861\n \n$\n215 \n$\n5,870\n \n$\n776 \nU.S. dollar-denominated:\n  Fixed maturity securities:\n     Other fixed maturity securities\n$\n311\n \n$\n571 \n$\n3,410\n \n$\n2,460 \n     Infrastructure debt\n9\n \n89 \n125\n \n258 \n     Collateralized loan obligations\n0\n \n0 \n74\n \n30 \n  Equity securities\n1\n \n0 \n1\n \n0 \n  Commercial mortgage and other loans:\n     Transitional real estate loans\n5\n \n27 \n32\n \n73 \n     Middle market loans\n254\n \n298 \n776\n \n649 \n     Other loans\n15\n \n40 \n95\n \n40 \n  Other investments\n104\n \n89 \n296\n \n206 \nTotal U.S. dollar-denominated\n$\n699\n \n$\n1,114 \n$\n4,809\n \n$\n3,716 \nOther currencies:\n  Fixed maturity securities:\n     Infrastructure debt\n$\n0\n \n$\n26 \n$\n52\n \n$\n26 \n     Private placements\n0\n \n0 \n1\n \n0 \n     Other fixed maturity securities\n0\n \n0 \n66\n \n0 \n  Commercial mortgage and other loans:\n     Other loans\n0\n \n32 \n26\n \n32 \n  Other investments\n8\n \n3 \n12\n \n5 \nTotal other currencies\n$\n8\n \n$\n61 \n$\n157\n \n$\n63 \nTotal Aflac Japan purchases\n$\n1,568\n \n$\n1,390 \n$\n10,836\n \n$\n4,555 \nSee the Investments section of this MD&A for further discussion of these investment programs, and see Notes 3 and 4 of the Notes to the Consolidated Financial Statements and Notes 1, 3 and 4 of the Notes to the Consolidated Financial Statements in the 2024 Annual Report for more information regarding loans and loan receivables.\nThe following table presents the results of Aflac Japan’s investment yields for the periods ended September 30.\n  \nThree Months\nNine Months\n  \n2025\n2024\n2025\n2024\nTotal purchases for the period (in millions) \n(1)\n$\n1,432\n \n$\n1,292 \n$\n10,487\n \n$\n4,324 \nNew money yield \n(1),(2)\n4.66\n \n%\n6.21 \n%\n3.96\n \n%\n5.85 \n%\nReturn on average invested assets \n(3)\n3.24\n \n3.16 \n3.20\n \n3.31 \nPortfolio book yield, including U.S. dollar-denominated investments, end of period \n(1),(2)\n3.28\n \n%\n3.21 \n%\n3.28\n \n%\n3.21 \n%\n(1) \nIncludes fixed maturity securities, commercial mortgage and other loans, equity securities, and excludes alternative investments in limited partnerships\n(2) \nReported on a gross yield basis; excludes investment expenses, external management fees and amortized hedge costs\n(3) \nNet of investment expenses and amortized hedge costs, year-to-date number reflected on a quarterly average basis\n95\nThe decrease in the Aflac Japan new money yield in the three- and nine-month periods ended September 30, 2025 was primarily due to lower allocations to higher yielding asset classes. See Notes 3, 4 and 5 of the Notes to the Consolidated Financial Statements and the Investments and Hedging Activities sections of this MD&A for additional information on the Company's investments and hedging strategies.\nAFLAC U.S. SEGMENT\nAflac U.S. Pretax Adjusted Earnings\nChanges in Aflac U.S. pretax adjusted earnings and profit margins are primarily affected by morbidity, mortality, expenses, persistency and investment yields. The following table presents a summary of operating results for Aflac U.S.\nAflac U.S. Summary of Operating Results\n \n \nThree Months Ended September 30,\nNine Months Ended September 30,\n(In millions)\n2025\n2024\n2025\n2024\nNet earned premiums\n$\n1,495\n \n$\n1,459 \n$\n4,501\n \n$\n4,388 \nAdjusted net investment income \n(1)\n214\n \n210 \n623\n \n634 \nOther income\n19\n \n15 \n53\n \n46 \nTotal adjusted revenues\n1,728\n \n1,684 \n5,177\n \n5,068 \nBenefits and claims:\nBenefits and claims, excluding reserve remeasurement\n752\n \n711 \n2,219\n \n2,130 \nReserve remeasurement (gains) losses\n(71)\n(17)\n(110)\n(71)\nTotal benefits and claims, net\n681\n \n694 \n2,109\n \n2,059 \nAdjusted expenses:\nAmortization of deferred policy acquisition costs\n137\n \n132 \n410\n \n396 \nInsurance commissions\n143\n \n141 \n417\n \n422 \nInsurance and other expenses\n392\n \n367 \n1,120\n \n1,102 \nTotal adjusted expenses\n672\n \n640 \n1,947\n \n1,920 \nTotal benefits and adjusted expenses\n1,353\n \n1,334 \n4,056\n \n3,979 \nPretax adjusted earnings\n$\n375\n \n$\n350 \n$\n1,121\n \n$\n1,089 \nPercentage change over previous period:\nNet earned premiums\n2.5\n \n%\n2.8 \n%\n2.6\n \n%\n2.7 \n%\nAdjusted net investment income\n1.9\n \n.5 \n(1.7)\n4.1 \nTotal adjusted revenues\n2.6\n \n1.4 \n2.2\n \n1.7 \nTotal benefits and claims, net\n(1.9)\n36.1 \n2.4\n \n14.1 \nTotal adjusted expenses\n5.0\n \n(5.0)\n1.4\n \n(3.0)\nPretax adjusted earnings\n7.1\n \n(26.8)\n2.9\n \n(9.2)\n(1) \nNet interest income/expense from derivatives associated with certain investment strategies of $(7) and $(9) for the three-month periods and $(19) and $(28) for the nine-month periods ended September 30, 2025 and 2024, respectively, have been reclassified from net investment gains (losses) and included in adjusted earnings as a component of net investment income.\nFor the three-month period ended September 30, 2025, operating results compared to the same period in the previous year were as follows: \n•\nNet earned premiums increased primarily due to improved sales.\n•\nAdjusted net investment income increased primarily due to higher variable net investment income.\n•\nTotal adjusted revenues increased primarily due to the increase in net earned premiums.\n•\nTotal benefits and claims decreased primarily due to $60 million of reserve remeasurement gains related to assumption updates in the third quarter of 2025, compared to reserve remeasurement gains of $11 million in the third quarter of 2024, partially offset by higher incurred claims.\n•\nTotal adjusted expenses increased primarily due to one-time technology-related expense and higher deferred policy acquisition cost amortization.\n96\n•\nPretax adjusted earnings increased primarily due to the increase in total adjusted revenues and the decrease in total benefits and claims, partially offset by the increase in total adjusted expenses.\nFor the nine-month period ended September 30, 2025, operating results compared to the same period in the previous year were as follows:\n•\nNet earned premiums increased primarily due to improved sales.\n•\nAdjusted net investment income decreased primarily due to lower floating rate income.\n•\nTotal adjusted revenues increased primarily due to the increase in net earned premiums, partially offset by the decrease in adjusted net investment income.\n•\nTotal benefits and claims increased primarily due to higher incurred claims partially offset by $60 million of reserve remeasurement gains related to assumption updates in the third quarter of 2025, compared to reserve remeasurement gains of $11 million in the third quarter of 2024.\n•\nTotal adjusted expenses increased primarily due to one-time technology-related expense and higher deferred policy acquisition cost amortization.\n•\nPretax adjusted earnings increased primarily due to the increase in total adjusted revenues, partially offset by the increases in total benefits and claims and total adjusted expenses.\nAnnualized premiums in force increased 3.8% to $6.5 billion at September 30, 2025, compared with $6.3 billion at September 30, 2024.\nThe following table presents a summary of operating ratios for Aflac U.S. followed by a discussion of the significant drivers of changes in operating ratios compared to the same periods in the previous year.\n \n \nThree Months Ended September 30,\nNine Months Ended September 30,\nRatios to total adjusted revenues:\n2025\n2024\n2025\n2024\nTotal benefits and claims\n39.4\n \n%\n41.2 \n%\n40.7\n \n%\n40.6 \n%\nAdjusted expenses:\nAmortization of deferred policy acquisition costs\n7.9\n \n7.8 \n7.9\n \n7.8 \nInsurance commissions\n8.3\n \n8.4 \n8.1\n \n8.3 \nInsurance and other expenses\n22.7\n \n21.8 \n21.6\n \n21.7 \nTotal adjusted expenses\n38.9\n \n38.0 \n37.6\n \n37.9 \nPretax adjusted earnings\n21.7\n \n20.8 \n21.7\n \n21.5 \nRatios to total premiums:\nTotal benefits and claims\n45.6\n \n%\n47.6 \n%\n46.9\n \n%\n46.9 \n%\nAdjusted expenses:\nAmortization of deferred policy acquisition costs\n9.2\n \n9.0 \n9.1\n \n9.0 \n•\nFor the three-month period ended September 30, 2025, the total benefits and claims to total premiums ratio decreased primarily due to reserve remeasurement gains related to assumption updates in the third quarter of 2025. For the nine-month period ended September 30, 2025, the total benefits and claims to total premiums ratio was flat.\n•\nFor the three-month period ended September 30, 2025, the total adjusted expense ratio increased primarily due to one-time technology-related expenses. The total adjusted expense ratio decreased in the nine-month period ended September 30, 2025 primarily due to expense efficiency efforts.\n•\nIn total, the pretax adjusted profit margin increased in the three-month period ended September 30, 2025, primarily due to the lower benefit ratio. The pretax adjusted profit margin increased in the nine-month period ended September 30, 2025 primarily due to the lower total adjusted expense ratio. \nThe following table presents premium persistency for Aflac U.S. on a 12-month rolling basis as of September 30.\n2025\n2024\nPremium persistency\n79.0\n \n%\n78.9 \n%\n97\nAflac U.S. Sales\nThe following table presents Aflac's U.S. new annualized premium sales for the periods ended September 30.\nThree Months\nNine Months\n(In millions)\n2025\n2024\n2025\n2024\nNew annualized premium sales\n$\n390\n \n$\n379 \n$\n1,038\n \n$\n1,008 \nIncrease (decrease) over prior period\n2.8\n \n%\n5.5 \n%\n3.0\n \n%\n1.0 \n%\nThe increase in new annualized premium sales for Aflac U.S. in the third quarter and first nine months of 2025 was primarily driven by sales of group products.\nThe following table details the contributions to Aflac's U.S. new annualized premium sales by major insurance product category for the periods ended September 30.\n \n \nThree Months\nNine Months\n2025\n2024\n2025\n2024\nAccident\n16.9\n \n%\n17.7 \n%\n18.9\n \n%\n20.3 \n%\nDisability\n31.8\n \n28.8 \n28.3\n \n26.1 \n Critical care\n(1)\n15.9\n \n18.6 \n18.9\n \n20.5 \nHospital indemnity\n10.5\n \n11.9 \n12.3\n \n13.4 \nDental/vision\n5.6\n \n4.7 \n6.2\n \n5.6 \nLife\n19.3\n \n18.3 \n15.4\n \n14.1 \nTotal\n100.0\n \n%\n100.0 \n%\n100.0\n \n%\n100.0 \n%\n(1) \nIncludes cancer, critical illness, and hospital intensive care products\nIn the third quarter of 2025, the Aflac U.S. sales force included an average of approximately 5,200 U.S. agents, including brokers, who were actively producing business on a weekly basis. The Company believes that this average weekly producer equivalent metric allows sales management to monitor progress and needs, as well as serve as a leading indicator of future production capacity.\nAflac U.S. Investments\nThe level of investment income is affected by available cash flow from operations, the timing of investing the cash flow, yields on new investments, and other factors. \nAs part of the Company's portfolio management and asset allocation process, Aflac U.S. invests in fixed maturity investments, loan receivables, and growth assets, including public equity securities and alternative investments in limited partnerships. Aflac U.S. invests in both publicly traded and privately originated investment-grade and below-investment-grade fixed maturity securities and loan receivables.\n98\nThe following table details the investment purchases for Aflac U.S. \nThree Months Ended September 30,\nNine Months Ended September 30,\n(In millions)\n2025\n2024\n2025\n2024\nU.S. dollar-denominated:\nFixed maturity securities:\n     Other fixed maturity securities\n$\n118\n \n$\n110 \n$\n763\n \n$\n654 \n     Infrastructure debt\n0\n \n25 \n25\n \n64 \n     Collateralized loan obligations\n0\n \n0 \n25\n \n12 \nEquity securities \n0\n \n0 \n15\n \n22 \nCommercial mortgage and other loans:\n     Transitional real estate loans\n1\n \n7 \n9\n \n19 \n     Commercial mortgage loans\n0\n \n0 \n0\n \n13 \n     Middle market loans\n36\n \n16 \n125\n \n102 \n     Other loans\n0\n \n0 \n12\n \n0 \nOther investments\n92\n \n11 \n166\n \n23 \nTotal U.S. dollar-denominated\n$\n247\n \n$\n169 \n$\n1,140\n \n$\n909 \nOther currencies:\nOther investments\n$\n4\n \n$\n0 \n$\n4\n \n$\n0 \nTotal other currencies\n$\n4\n \n$\n0 \n$\n4\n \n$\n0 \nTotal Aflac U.S. Purchases\n$\n251\n \n$\n169 \n$\n1,144\n \n$\n909 \nSee Note 3 of the Notes to the Consolidated Financial Statements and Notes 1 and 3 of the Notes to the Consolidated Financial Statements in the 2024 Annual Report for more information regarding loans and loans receivables.\nThe following table presents the results of Aflac's U.S. investment yields for the periods ended September 30.\nThree Months     \nNine Months\n \n \n2025\n2024\n2025\n2024\nTotal purchases for period (in millions) \n(1)\n$\n155\n \n$\n158 \n$\n974\n \n$\n886 \nNew money yield \n(1),(2)\n6.62\n \n%\n6.00 \n%\n6.73\n \n%\n6.76 \n%\nReturn on average invested assets \n(3)\n5.07\n \n4.94 \n4.96\n \n5.00 \nPortfolio book yield, end of period\n (1),(2)\n5.55\n \n%\n5.63 \n%\n5.55\n \n%\n5.63 \n%\n(1) \nIncludes fixed maturity securities, commercial mortgage and other loans, equity securities, and excludes alternative investments in limited partnerships\n(2) \nReported on a gross yield basis; excludes investment expenses and external management fees\n(3) \nNet of investment expenses, year-to-date number reflected on a quarterly average basis\nThe increase in the Aflac U.S. new money yield in the three-month period ended September 30, 2025 was primarily due to higher long-term rates and a larger allocation to higher yielding asset classes. The decrease in the Aflac U.S. new money yield in the nine-month period ended September 30, 2025 was primarily due to lower short-term rates on floating rate assets. See Notes 3 and 5 of the Notes to the Consolidated Financial Statements and the Investments section of this MD&A for additional information on the Company's investments.\n99\nCORPORATE AND OTHER\nChanges in the pretax adjusted earnings of Corporate and other are primarily affected by internal reinsurance activity and net investment income. The following table presents a summary of operating results for Corporate and other.   \nCorporate and Other Summary of Operating Results\n \n \nThree Months Ended September 30,\nNine Months Ended September 30,\n(In millions)\n2025\n2024\n2025\n2024\nNet earned premiums\n$\n214\n \n$\n160 \n$\n618\n \n$\n479 \nNet investment income (loss) \n(1)\n110\n \n39 \n304\n \n146 \nAmortized hedge income\n20\n \n25 \n80\n \n87 \nAdjusted net investment income\n130\n \n64 \n384\n \n233 \nOther income\n(1)\n1 \n3\n \n11 \nTotal adjusted revenues\n343\n \n225 \n1,005\n \n723 \nBenefits and claims:\nBenefits and claims, excluding reserve remeasurement\n133\n \n95 \n384\n \n298 \nReserve remeasurement (gains) losses\n(34)\n(21)\n(35)\n(23)\nTotal benefits and claims, net\n99\n \n74 \n349\n \n275 \nAdjusted expenses:\nInterest expense\n55\n \n39 \n151\n \n113 \nOther adjusted expenses\n120\n \n97 \n373\n \n299 \nTotal adjusted expenses\n175\n \n136 \n524\n \n412 \nTotal benefits and adjusted expenses\n274\n \n210 \n873\n \n687 \nPretax adjusted earnings\n$\n69\n \n$\n15 \n$\n132\n \n$\n36 \nPercentage change over previous period:\nNet earned premiums\n33.8\n \n%\n92.8 \n%\n29.0\n \n%\n85.7 \n%\nAdjusted net investment income\n103.1\n \n137.0 \n64.8\n \n100.9 \nTotal adjusted revenues\n52.4\n \n95.7 \n39.0\n \n88.3 \nTotal benefits and claims, net\n33.8\n \n13.8 \n26.9\n \n33.5 \nTotal adjusted expenses\n28.7\n \n38.8 \n27.2\n \n44.6 \nPretax adjusted earnings\n360.0\n \n130.6 \n266.7\n \n133.6 \n(1)\n The change in value of federal historic rehabilitation and solar investments in partnerships of $6 and\n \n$57 for the three-month periods and $22 and $119 for the nine-month periods ended September 30, 2025 and 2024, respectively, is included as a reduction to net investment income. Tax credits on these investments of $7 and $78 for the three-month periods and $24 and $142 for the nine-month periods ended September 30, 2025 and 2024, respectively, have been recorded as an income tax benefit in the consolidated statements of earnings. See Note 3 of the Notes to the Consolidated Financial Statements for additional information on these investments.\nFor the three-month period ended September 30, 2025, operating results compared to the same period in the previous year were as follows: \n•\nNet earned premiums and total benefits and claims increased primarily due to higher internal reinsurance activity resulting from the transaction established in the fourth quarter of 2024. The increase in total benefits and claims was partially offset by $31 million of reserve remeasurement gains related to assumption updates in the third quarter of 2025, compared to reserve remeasurement gains of $20 million in the third quarter of 2024.\n•\nAdjusted net investment income increased primarily due to $51 million from a lower volume of federal historic rehabilitation and solar tax credit investments, with offsetting tax benefits recognized as a corresponding lower income tax expense, and higher Aflac Re consolidated investment income of $11 million from a higher volume of assets as part of the reinsurance agreement established in the fourth quarter of 2024.\n•\nTotal adjusted revenues increased primarily due to the increases in adjusted net investment income and net earned premiums.\n•\nTotal adjusted expenses increased primarily due to $16 million associated with internal reinsurance activity, higher interest expense of $16 million, and $7 million from higher costs pertaining to business operations, including costs \n100\nrelated to the ongoing investigation of and response to the cybersecurity incident and legal and other professional services related thereto.\n•\nPretax adjusted earnings increased primarily due to the increase in total adjusted revenues, partially offset by the increase in total benefits and adjusted expenses.\nFor the nine-month period ended September 30, 2025, operating results compared to the same period in the previous year were as follows:\n•\nNet earned premiums and total benefits and claims increased primarily due to higher internal reinsurance activity resulting from the transaction established in the fourth quarter of 2024. The increase in total benefits and claims was partially offset by $31 million of reserve remeasurement gains related to assumption updates in the third quarter of 2025, compared to reserve remeasurement gains of $20 million in the third quarter of 2024.\n•\nAdjusted net investment income increased primarily due to $97 million from a lower volume of federal historic rehabilitation and solar tax credit investments, with offsetting tax benefits recognized as a corresponding lower income tax expense, and higher Aflac Re consolidated investment income of $35 million from a higher volume of assets as part of the reinsurance agreement established in the fourth quarter of 2024.\n•\nTotal adjusted revenues increased primarily due to the increases in adjusted net investment income and net earned premiums.\n•\nTotal adjusted expenses increased primarily due to $39 million associated with internal reinsurance activity, higher interest expense of $38 million, and $34 million from higher costs pertaining to business operations, including costs related to the ongoing investigation of and response to the cybersecurity incident and legal and other professional services related thereto.\n•\nPretax adjusted earnings increased primarily due to the increase in total adjusted revenues, partially offset by the increase in total benefits and adjusted expenses.\nThe Parent Company invests in partnerships that specialize in rehabilitating historic structures or the installation of solar equipment in order to receive federal historic rehabilitation and solar tax credits. These investments are classified as limited partnerships and included in other investments in the consolidated balance sheets. The change in value of each investment is recorded as a reduction to net investment income. Tax credits generated by these investments are recorded as an income tax benefit in the consolidated statements of earnings.\nINVESTMENTS\nThe Company’s investment strategy utilizes disciplined asset and liability management while seeking long-term risk-adjusted investment returns and the delivery of stable income within regulatory and capital objectives, and preserving shareholder value. In attempting to optimally balance these objectives, the Company seeks to maintain on behalf of Aflac Japan a diversified portfolio of yen-denominated investment assets, a U.S. dollar-denominated investment portfolio hedged back to yen and a portfolio of unhedged U.S. dollar-denominated assets. As part of the Company's portfolio management and asset allocation process, Aflac U.S. invests in fixed maturity investments and growth assets, including public equity securities and alternative investments in limited partnerships. Aflac U.S. invests in both publicly traded and privately originated investment-grade and below-investment-grade fixed maturity securities and loans.\nFor additional information concerning the Company's investments, see Notes 3, 4, and 5 of the Notes to the Consolidated Financial Statements.\n101\nThe following tables detail investments by segment.\nInvestment Securities by Segment\nSeptember 30, 2025\n(In millions)\nAflac Japan\nAflac U.S.\nCorporate and Other\n \nTotal\nAvailable-for-sale, fixed maturity securities, \n   at fair value\n$\n47,543\n \n$\n12,573\n \n$\n7,160\n \n$\n67,276\n \nHeld-to-maturity, fixed maturity securities, \n   at amortized cost\n (1)\n16,955\n \n0\n \n0\n \n16,955\n \nEquity securities\n608\n \n2\n \n275\n \n885\n \nCommercial mortgage and other loans: \n(1)\nTransitional real estate loans \n3,120\n \n761\n \n165\n \n4,046\n \nCommercial mortgage loans\n895\n \n537\n \n0\n \n1,432\n \nMiddle market loans\n3,830\n \n418\n \n0\n \n4,248\n \nOther loans\n338\n \n58\n \n15\n \n411\n \nOther investments:\nPolicy loans\n180\n \n37\n \n0\n \n217\n \nShort-term investments \n(2)\n1,500\n \n133\n \n713\n \n2,346\n \nLimited partnerships\n3,179\n \n488\n \n294\n \n3,961\n \nReal estate owned\n815\n \n125\n \n0\n \n940\n \nOther\n0\n \n31\n \n0\n \n31\n \nInvestment in affiliate \n(3)\n0\n \n1,055\n \n(1,055)\n0\n \n     Total investments\n78,963\n \n16,218\n \n7,567\n \n102,748\n \nCash and cash equivalents\n2,157\n \n1,191\n \n3,420\n \n6,768\n \n              Total investments and cash\n$\n81,120\n \n$\n17,409\n \n$\n10,987\n \n$\n109,516\n \n(1)\n Net of allowance for credit losses \n(2) \nIncludes securities lending collateral\n(3)\n For consolidated reporting, Aflac U.S.'s investment in Aflac Re is eliminated in Corporate and other \n102\nDecember 31, 2024\n(In millions)\nAflac Japan\nAflac U.S.\nCorporate and Other\n \nTotal\nAvailable-for-sale, fixed maturity securities, \n   at fair value\n$\n45,970 \n$\n12,296 \n$\n7,003 \n$\n65,269 \nHeld-to-maturity, fixed maturity securities, \n   at amortized cost \n(1)\n15,966 \n0 \n0 \n15,966 \nEquity securities\n458 \n2 \n336 \n796 \nCommercial mortgage and other loans: \n(1)\nTransitional real estate loans \n3,648 \n866 \n189 \n4,703 \nCommercial mortgage loans \n915 \n608 \n0 \n1,523 \nMiddle market loans \n3,847 \n436 \n0 \n4,283 \nOther loans\n284 \n61 \n15 \n360 \nOther investments:\nPolicy loans\n168 \n35 \n0 \n203 \nShort-term investments \n(2)\n484 \n366 \n749 \n1,599 \nLimited partnerships\n2,861 \n306 \n268 \n3,435 \nReal estate owned\n570 \n112 \n0 \n682 \nOther\n0 \n39 \n0 \n39 \nInvestment in affiliate \n(3)\n0 \n638 \n(638)\n0 \n     Total investments\n75,171 \n15,765 \n7,922 \n98,858 \nCash and cash equivalents\n2,062 \n1,010 \n3,157 \n6,229 \n              Total investments and cash\n$\n77,233 \n$\n16,775 \n$\n11,079 \n$\n105,087 \n(1)\n Net of allowance for credit losses\n(2) \nIncludes securities lending collateral\n(3)\n For consolidated reporting, Aflac U.S.'s investment in Aflac Re is eliminated in Corporate and other \nThe Company has invested in a variety of commercial mortgage loans (CMLs) and other loans including transitional real estate loans (TREs). The Company's TRE and CML investments are collateralized by commercial real estate, including some office properties. The Company considers these investments to be well diversified by geography and among property types. Further, the Company believes that the portfolio is generally well positioned with exposures concentrated in high quality underlying properties with institutional investors who are experienced in managing their assets during periods of market volatility.\nWhile generally resilient, the Company's investments in TREs and CMLs have been affected by conditions in the commercial real estate market, with a greater impact on mortgages secured by office properties. The Company invested in certain TREs and CMLs that are currently in default of interest or maturity payments. The Company works with the affected borrowers to resolve specific situations through loan continuance with potential modifications, through loan sales, or through the process of foreclosure or deed in lieu of foreclosure. Since the third quarter of 2023, the Company has taken possession, through foreclosure or deed in lieu of foreclosure, of certain commercial real estate properties, which secured defaulted loans. Properties acquired by the Company through foreclosure and deed in lieu of foreclosure are reported as real estate owned (REO) in other investments in the Company's consolidated balance sheets. \nIn the nine-month period ended September 30, 2025, the Company completed foreclosure or deed in lieu of foreclosure on TREs collateralized with commercial real estate properties with an amortized cost of $257 million. As a result of the amortized cost of the TREs exceeding the estimated fair value of the collateral upon consummating the foreclosures or deed in lieu of foreclosure transactions, the Company recognized a net loss of $10 million in net investment gains (losses) for the nine-month period ended September 30, 2025. In the nine-month period ended September 30, 2024, the Company completed foreclosure or deed in lieu of foreclosure on TREs collateralized with commercial real estate properties with an amortized cost of $407 million. As a result of the amortized cost of the TREs exceeding the estimated fair value of the collateral upon consummating the foreclosures or deed in lieu of foreclosure transactions, the Company recognized a net loss of $27 million in net investment gains (losses) for the nine-month period ended September 30, 2024.\n103\nThe Company utilizes third-party asset managers to source, underwrite and manage each loan, as well as any resulting REO. The Company closely monitors the activities of these managers. In the event that a loan workout is necessary, the Company believes these external managers have the experience and resources to manage the process to maximize recovery.\nThe Company also monitors its commercial mortgage and other loan investments internally on an ongoing basis, including a review of loans' credit quality indicators and payment status as current, past due, restructured or under foreclosure. See Note 3 of the Notes to the Consolidated Financial Statements for further information concerning credit quality indicators, information on loans that are on nonaccrual status, and REO obtained through foreclosure or deed in lieu of foreclosure. See also Item 1A. Risk Factors of the 2024 Annual Report for a discussion of risk factors associated with the Company's investments.\nThe ratings of the Company's securities referenced in the table below are based on the ratings designations provided by major rating organizations such as Moody's, Standard & Poor's and Fitch or, if not rated, are determined based on the Company's internal analysis of such securities. When the ratings issued by the rating agencies differ, the Company utilizes the second lowest rating when three or more rating agency ratings are available or the lowest rating when only two rating agency ratings are available. \nThe distributions of fixed maturity securities the Company owns, by credit rating, were as follows:\nComposition of Fixed Maturity Securities by Credit Rating\n \nSeptember 30, 2025\nDecember 31, 2024\n \nAmortized\nCost\n  Fair    \n  Value    \nAmortized\nCost\n  Fair    \n  Value    \nAAA\n1.2\n \n%\n1.2\n \n%\n1.5 \n%\n1.5 \n%\nAA\n6.4\n \n6.7\n \n6.0 \n6.3 \nA\n68.8\n \n66.6\n \n68.0 \n66.1 \nBBB\n22.0\n \n23.8\n \n22.9 \n24.4 \nBB or lower\n1.6\n \n1.7\n \n1.6 \n1.7 \nTotal\n100.0\n \n%\n100.0\n \n%\n100.0 \n%\n100.0 \n%\nAs of September 30, 2025, the Company's direct and indirect exposure to securities in its investment portfolio that were guaranteed by third parties was immaterial both individually and in the aggregate.\nThe following table presents the 10 largest unrealized loss positions in the Company's portfolio as of September 30, 2025. \n(In millions)\nCredit\nRating\nAmortized\nCost\nFair\nValue\nUnrealized Loss \nJapan National Government\nA+\n$\n34,849 \n$\n31,596 \n$\n(3,253)\nUrban Renaissance Agency\nA+\n164 \n102 \n(62)\nKLM Royal Dutch Airlines\nB+\n134 \n93 \n(41)\nJP Morgan Chase and Co.\nA+\n203 \n165 \n(38)\nThames Water Utility\nCCC-\n134 \n97 \n(37)\nMitsubishi Estate Co Ltd.\nA\n134 \n101 \n(33)\nTokyo Gas Co Ltd\nA+\n101 \n69 \n(32)\nPrologis LP\nA\n152 \n120 \n(32)\nWest Japan Railway Company\nA+\n107 \n77 \n(30)\nSNCF Reseau\nAA-\n73 \n44 \n(29)\nGenerally, declines in fair values can be a result of changes in interest rates, yen/dollar exchange rate, and changes in net spreads driven by a broad market move or a change in the issuer's underlying credit quality. The Company believes these issuers have the ability to continue making timely payments of principal and interest. See the Unrealized Investment Gains and Losses section in Note 3 of the Notes to the Consolidated Financial Statements for further discussions of unrealized losses related to the Company's investments.\n104\nBelow-Investment-Grade Securities\nThe Company's portfolio of below-investment-grade securities includes debt securities purchased while the issuer was rated investment grade plus other loans and bonds invested in as part of an allocation to that segment of the market. The following is the Company's below-investment-grade exposure.\nBelow-Investment-Grade Investments\nSeptember 30, 2025\n(In millions)\nPar\nValue\nAmortized\nCost \n(1)\nFair\nValue\nUnrealized\nGain\n(Loss)\nInvestcorp Capital Limited\n$\n231\n \n$\n231\n \n$\n234\n \n$\n3\n \nHella KG Hueck and Co.\n148\n \n148\n \n142\n \n(6)\nThames Water Utility\n135\n \n134\n \n97\n \n(37)\nKLM Royal Dutch Airlines\n134\n \n134\n \n93\n \n(41)\nTelecom Italia SpA\n134\n \n134\n \n171\n \n37\n \nIKB Deutsche Industriebank AG\n87\n \n48\n \n74\n \n26\n \nAmarok Parent LLC\n25\n \n24\n \n25\n \n1\n \nCPI Property Group SA\n20\n \n20\n \n19\n \n(1)\nTralka Spa (Chadwick)\n18\n \n19\n \n17\n \n(2)\nOther Issuers\n34\n \n36\n \n33\n \n(3)\n          Subtotal \n(2)\n966\n \n928\n \n905\n \n(23)\nHigh yield corporate bonds\n497\n \n407\n \n482\n \n75\n \nMiddle market loans\n4,119\n \n3,955\n \n3,877\n \n(78)\n          Grand Total\n$\n5,582\n \n$\n5,290\n \n$\n5,264\n \n$\n(26)\n(1) \nNet of allowance for credit losses\n(2)\n Securities initially purchased as investment grade, but have subsequently been downgraded to below investment grade\nThe Company maintains an allocation to higher yielding corporate bonds within the Aflac Japan and Aflac U.S. portfolios. Most of these securities were rated below-investment-grade at the time of purchase, but the Company also purchased several that were rated investment grade which, because of market pricing, offer yields commensurate with below-investment-grade risk profiles. The objective of this allocation was to enhance the Company's yield on invested assets and further diversify credit risk. All investments in this program must have a minimum rating at purchase of low BB using the Company's above described rating methodology and are managed by the Company's internal credit portfolio management team.\nThe Company invests in middle market loans primarily to U.S. corporate borrowers, most of which have below-investment-grade ratings. The objectives of this program include enhancing the yield on invested assets, achieving further diversification of credit risk, and mitigating the risk of rising interest rates and hedge costs through the acquisition of floating rate assets. \n105\nFixed Maturity Securities by Sector\nThe Company maintains diversification in investments by sector to avoid concentrations to any one sector, thus managing exposure risk. The following table shows the distribution of fixed maturities by sector classification.\nSeptember 30, 2025\n(In millions)\nAmortized\nCost \n(1)\nGross\nUnrealized\nGains\nGross\nUnrealized\nLosses\nFair\nValue\n% of\nTotal\nGovernment and agencies\n$\n36,029\n \n$\n332\n \n$\n(3,710)\n$\n32,651\n \n42.3\n \n%\nMunicipalities\n2,335\n \n94\n \n(191)\n2,238\n \n2.7\n \nMortgage- and asset-backed securities\n4,271\n \n170\n \n(79)\n4,362\n \n5.0\n \nPublic utilities\n7,206\n \n568\n \n(312)\n7,462\n \n8.5\n \nElectric\n5,597 \n456 \n(169)\n5,885 \n6.6 \nNatural Gas\n914 \n69 \n(78)\n904 \n1.1 \nOther\n695 \n43 \n(65)\n673 \n.8 \nSovereign and supranational\n805\n \n36\n \n(16)\n825\n \n.9\n \nBanks/financial institutions\n9,529\n \n651\n \n(461)\n9,719\n \n11.2\n \nBanking\n5,337 \n361 \n(256)\n5,441 \n6.3 \nInsurance\n2,055 \n187 \n(68)\n2,175 \n2.4 \nOther\n2,137 \n103 \n(137)\n2,103 \n2.5 \nOther corporate\n25,051\n \n2,799\n \n(1,061)\n26,789\n \n29.4\n \nBasic Industry\n2,070 \n314 \n(99)\n2,285 \n2.4 \nCapital Goods\n2,729 \n280 \n(102)\n2,908 \n3.2 \nCommunications\n2,741 \n428 \n(64)\n3,105 \n3.2 \nConsumer Cyclical\n1,898 \n186 \n(42)\n2,042 \n2.2 \nConsumer Non-Cyclical\n5,924 \n689 \n(236)\n6,377 \n7.0 \nEnergy\n2,376 \n376 \n(25)\n2,726 \n2.8 \nOther\n1,074 \n53 \n(113)\n1,015 \n1.3 \nTechnology\n3,322 \n212 \n(150)\n3,384 \n3.9 \nTransportation\n2,917 \n261 \n(230)\n2,947 \n3.4 \nTotal fixed maturity securities\n$\n85,226\n \n$\n4,650\n \n$\n(5,830)\n$\n84,046\n \n100.0\n \n%\n(1) \nNet of allowance for credit losses\nSecurities by Type of Issuance\nThe Company has investments in both publicly and privately issued securities. The Company's ability to sell either type of security is a function of overall market liquidity which is impacted by, among other things, the amount of outstanding securities of a particular issuer or issuance, trading history of the issue or issuer, overall market conditions, and idiosyncratic events affecting the specific issue or issuer.\n106\nThe following table details investment securities by type of issuance.\nInvestment Securities by Type of Issuance\n \n \n \nSeptember 30, 2025\nDecember 31, 2024\n(In millions)\nAmortized\nCost \n(1)\nFair   \nValue   \nAmortized\nCost \n(1)\nFair  \nValue  \nPublicly issued securities:\nFixed maturity securities\n$\n68,678\n \n$\n67,322\n \n$\n65,291 \n$\n66,476 \nEquity securities\n721\n \n721\n \n638 \n638 \n      Total publicly issued\n69,399\n \n68,043\n \n65,929 \n67,114 \nPrivately issued securities: \n(2)\nFixed maturity securities \n(3)\n16,548\n \n16,724\n \n14,764 \n15,565 \nEquity securities\n164\n \n164\n \n158 \n158 \n      Total privately issued\n16,712\n \n16,888\n \n14,922 \n15,723 \n      Total investment securities\n$\n86,111\n \n$\n84,931\n \n$\n80,851 \n$\n82,837 \n(1) \nNet of allowance for credit losses\n(2)\n Primarily consists of securities owned by Aflac Japan \n(3)\n Excludes Rule 144A securities\nThe following table details the Company's reverse dual-currency securities.\nReverse Dual-Currency Securities\n(1)\n(Amortized cost, in millions)\nSeptember 30,\n2025\nDecember 31,\n2024\nPrivately issued reverse dual-currency securities\n$\n3,457\n \n$\n3,368 \nPublicly issued collateral structured as reverse dual-currency securities\n941\n \n945 \nTotal reverse dual-currency securities\n$\n4,398\n \n$\n4,313 \nReverse dual-currency securities as a percentage of total investment \n   securities\n5.1\n \n%\n5.3 \n%\n(1) \nPrincipal payments in yen and interest payments in dollars\nAflac Japan has a portfolio of privately issued securities to better match liability characteristics and secure higher yields than those available on Japanese government or other public corporate bonds.\n \nAflac Japan’s investments in yen-denominated privately issued securities consist primarily of non-Japanese issuers, are rated investment grade at purchase and have longer maturities, thereby allowing the Company to improve asset/liability matching and overall investment returns. These securities are generally either privately negotiated arrangements or issued under medium-term note programs and have standard documentation commensurate with credit ratings of the issuer, except when internal credit analysis indicates that additional protective and/or event-risk covenants were required. Many of these investments have protective covenants appropriate to the specific investment. These may include a prohibition of certain activities by the borrower, maintenance of certain financial measures, and specific conditions impacting the payment of the Company's notes.\nHEDGING ACTIVITIES\nThe Company uses derivative contracts to hedge foreign currency exchange rate risk and interest rate risk. The Company uses various strategies, including derivatives, to manage these risks. See Item 7A. Quantitative and Qualitative Disclosures About Market Risk in the 2024 Annual Report for more information about market risk and the Company’s use of derivatives.\nDerivatives are designed to reduce risk on an economic basis while minimizing the impact on financial results. The Company’s derivatives programs vary depending on the type of risk being hedged. See Note 4 of the Notes to the Consolidated Financial Statements for:\n•\nA description of the Company's derivatives, hedging strategies and underlying risk exposure.\n•\nInformation about the notional amount and fair market value of the Company's derivatives.\n•\nImpact on earnings and other comprehensive income (loss) from various qualifying and non-qualifying hedging relationships.\n107\nForeign Currency Exchange Rate Risk Hedge Program\nThe Company has deployed the following hedging strategies to mitigate exposure to foreign currency exchange rate risk:\n•\nAflac Japan hedges U.S. dollar-denominated investments back to yen (see \nAflac Japan’s U.S. Dollar-Denominated Hedge Program \nbelow).\n•\nAflac Japan maintains certain unhedged U.S. dollar-denominated securities, which serve as an economic currency hedge of a portion of the Company's investment in Aflac Japan, while utilizing foreign currency options to mitigate against significant movements in the yen/U.S. dollar exchange rate (see \nAflac Japan’s U.S. Dollar-Denominated Hedge Program \nbelow).\n•\nAflac Japan uses foreign currency swaps to economically hedge the foreign exchange rate risk on certain of its investments that are denominated in other foreign currencies.\n•\nThe Parent Company designates yen-denominated liabilities (notes payable and loans) as non-derivative hedging instruments and designates certain foreign currency forwards and options as derivative hedges of the Company’s net investment in Aflac Japan \n(\nsee \nEnterprise Corporate Hedging Program \nbelow)\n.\n•\nThe Parent Company enters into forward and option contracts to accomplish a dual objective of hedging foreign currency exchange rate risk related to dividend payments by its subsidiary, ALIJ, and reducing enterprise-wide hedge costs \n(\nsee \nEnterprise Corporate Hedging Program \nbelow\n).\nThe following table presents metrics related to Aflac Japan's U.S. dollar-denominated hedge program and the Parent Company's enterprise corporate hedging program, including associated amortized hedge costs/income, for the periods ended September 30. See the Results of Operations section of this MD&A for the Company's definition of amortized hedge costs/income. \nThree Months     \nNine Months\n2025\n2024\n2025\n2024\nAflac Japan:\nFX Forwards\n   FX forward notional at end of period (in billions) \n(1)\n$\n0.7\n \n$\n0.0 \n$\n0.7\n \n$\n0.0 \n   Amortized hedge income (cost) for period (in millions)\n$\n(4)\n$\n0 \n$\n(7)\n$\n1 \nFX Options\nFX option notional at the end of period (in billions) \n(1)\n$\n25.0\n \n$\n24.7 \n$\n25.0\n \n$\n24.7 \nAmortized hedge income (cost) for period (in millions)\n$\n(9)\n$\n(7)\n$\n(24)\n$\n(20)\nCorporate and other (Parent Company):\nFX Forwards\n   FX forward notional at end of period (in billions) \n(1)\n$\n1.8\n \n$\n1.9 \n$\n1.8\n \n$\n1.9 \n   Amortized hedge income (cost) for period (in millions)\n$\n20\n \n$\n25 \n$\n80\n \n$\n87 \nFX Options\nFX option notional at the end of period (in billions) \n(1)\n$\n0.0\n \n$\n0.0 \n$\n0.0\n \n$\n0.0 \nAmortized hedge income (cost) for period (in millions)\n$\n0\n \n$\n0 \n$\n0\n \n$\n0 \n(1)\n Notional is reported net of any offsetting positions within Aflac Japan or the Parent Company, respectively.\nAmortized hedge costs/income can fluctuate based upon many factors, including the derivative notional amount, the length of time of the derivative contract, changes in both U.S. and Japan interest rates, and supply and demand for U.S. dollar funding. Amortized hedge costs/income have fluctuated in recent periods due to changes in the previously mentioned factors.\n108\nAflac Japan’s U.S. Dollar-Denominated Hedge Program (U.S. Dollar Program)\nAflac Japan buys U.S. dollar-denominated investments, typically corporate bonds, and hedges them back to yen with foreign currency forwards and options to hedge foreign currency exchange rate risk. This economically creates yen assets that match yen liabilities during the life of the derivative and provides favorable capital treatment under the Japan solvency margin ratio (SMR) calculations. The currency risk being hedged is generally based on fair value of hedged investments. The following table summarizes the U.S. dollar-denominated investments held by Aflac Japan.\nSeptember 30,\n2025\nDecember 31,\n2024\n(In millions)\nAmortized \nCost \n(1)\nFair\nValue\nAmortized \nCost \n(1)\nFair\nValue\nAvailable-for-sale securities:\n  Fixed maturity securities\n$\n12,817\n \n$\n14,746\n \n$\n9,835 \n$\n12,183 \nEquity securities\n24\n \n24\n \n22 \n22 \nCommercial mortgage and other loans:\n  Transitional real estate loans (floating rate)\n3,120\n \n3,169\n \n3,648 \n3,656 \n  Commercial mortgage loans \n895\n \n823\n \n915 \n811 \n  Middle market loans (floating rate)\n3,830\n \n3,760\n \n3,847 \n3,794 \n  Other loans\n191\n \n195\n \n174 \n173 \nOther investments\n4,045\n \n4,045\n \n2,862 \n2,862 \n      Total U.S. Dollar Program\n24,922\n \n26,762\n \n21,303 \n23,501 \nAvailable-for-sale securities:\n  Fixed maturity securities - economically converted to yen\n1,768\n \n2,487\n \n1,645 \n2,406 \n      Total U.S. dollar-denominated investments in Aflac Japan\n$\n26,690\n \n$\n29,249\n \n$\n22,948 \n$\n25,907 \n(1) \nNet of allowance for credit losses\nThe U.S. Dollar Program includes all U.S. dollar-denominated investments in Aflac Japan other than the investments in certain consolidated VIEs where the instrument is economically converted to yen as a result of a derivative in the consolidated VIE. The Company uses foreign currency forwards to hedge foreign exchange risk on certain U.S. dollar-denominated investments in Aflac Japan's portfolio and one-sided foreign currency put options to mitigate the settlement risk on U.S. dollar-denominated assets related to extreme foreign currency rate changes. From time to time, Aflac Japan also maintains a collar program on a portion of its U.S. Dollar Program to mitigate against more extreme moves in foreign exchange and therefore support SMR. As of September 30, 2025, none of the Company's foreign currency options hedging Aflac Japan's U.S. dollar-denominated assets were in-the-money.\n \nForeign exchange derivatives used for hedging are periodically settled, which results in cash receipt or payment at inception, maturity or early termination. The following table presents the settlements associated with the Company's currency derivatives used for hedging Aflac Japan’s U.S. dollar-denominated investments. \nThree Months Ended September 30,\nNine Months Ended September 30,\n(In millions)\n2025\n2024\n2025\n2024\nNet cash inflows (outflows)\n$\n(23)\n$\n(8)\n$\n(39)\n$\n(423)\nIn addition to the U.S. Dollar Program, Aflac Japan also utilizes foreign currency swaps to economically hedge the foreign exchange rate risk on certain investments denominated in other foreign currencies. As of September 30, 2025, the Company had foreign currency swaps on other foreign currency-denominated investments with a fair value of $48 million.\nEnterprise Corporate Hedging Program\nThe Company has designated certain yen-denominated liabilities and foreign currency forwards and options of the Parent Company as accounting hedges of its net investment in Aflac Japan. The Company's consolidated yen-denominated net asset position was partially hedged at $7.1 billion as of September 30, 2025, with hedging instruments comprised of $5.3 billion of yen-denominated debt and $1.8 billion of foreign currency forwards, compared with $5.9 billion as of December 31, 2024, with hedging instruments comprised of $4.1 billion of yen-denominated debt and $1.8 billion of foreign currency forwards\n.\n109\nThe Company makes its accounting designation of net investment hedge at the beginning of each quarter. If the total of the designated Parent Company non-derivative and derivative notional is equal to or less than the Company's net investment in Aflac Japan, the hedge is deemed to be effective, and the currency exchange effect on the yen-denominated liabilities and the change in estimated fair value of the derivatives are reported in the unrealized foreign currency component of other comprehensive income. The Company's net investment hedge was effective during the three- and nine-month periods ended September 30, 2025 and 2024, respectively. For additional information on the Company's net investment hedging strategy, see Note 4 of the Notes to the Consolidated Financial Statements.\nIn order to economically mitigate risks associated with the enterprise-wide exposure to the yen and the level and volatility of hedge costs, the Parent Company enters into foreign currency forward and option contracts. By buying U.S. dollars and selling yen, the Parent Company is effectively lowering its overall economic exposure to the yen. In addition to reducing yen exposure from dividend payments by Aflac Japan to the Parent Company, this strategy also reduces enterprise-wide hedge costs. This activity is reported in Corporate and other. The Company continually evaluates the program’s efficacy. \nAs part of the Company’s internal reinsurance platform, Aflac Re enters into foreign currency forwards with the Parent Company, and may enter into such forwards with third parties, to economically manage the currency mismatch between Aflac Re's assets, which are mostly denominated in U.S. dollars, and liabilities, which are mostly denominated in yen, in order to support and optimize Bermuda Monetary Authority (BMA) capital requirements. For additional information on the Company's internal reinsurance platform, see Note 8 of the Notes to the Consolidated Financial Statements and the Liquidity and Capital Resources section of this MD&A and Note 8 of the Notes to the Consolidated Financial Statements in the 2024 Annual Report.\nInterest Rate Risk Hedge Program\nAflac Japan and Aflac U.S. use interest rate swaps from time to time to mitigate the risk of investment income volatility for certain variable-rate investments. Additionally, to manage interest rate risk associated with its U.S. dollar-denominated investments held by Aflac Japan, from time to time the Company utilizes interest rate swaptions.  \nFor additional discussion of the risks associated with the foreign currency exposure refer to the Currency Risk section in Item 7A., Quantitative and Qualitative Disclosures about Market Risk, and Item 1A, specifically to the Risk Factors titled “The Company is exposed to foreign currency fluctuations in the yen/dollar exchange rate\" and “Lack of availability of acceptable yen-denominated investments could adversely affect the Company's results of operations, financial position or liquidity\" in the 2024 Annual Report. \nSee Note 4 of the Notes to the Consolidated Financial Statements for additional information on the Company's hedging activities. \nDEFERRED POLICY ACQUISITION COSTS\nThe following table presents deferred policy acquisition costs (DAC) by segment.\n(In millions)\nSeptember 30,\n2025\nDecember 31,\n2024\n% Change      \nAflac Japan\n$\n5,523\n \n$\n5,102 \n8.3 \n%\n(1)\nAflac U.S.\n3,693\n \n3,656 \n1.0 \nTotal\n$\n9,216\n \n$\n8,758 \n5.2 \n%\n(1) \nAflac Japan’s deferred policy acquisition costs increased 1.9% in yen during the nine months ended September 30, 2025.\nSee Note 6 of the Notes to the Consolidated Financial Statements for additional information on the Company's deferred policy acquisition costs.\n110\nPOLICY LIABILITIES\nThe following table presents policy liabilities by segment.\n(In millions)\nSeptember 30,\n2025\nDecember 31,\n2024\n% Change      \nAflac Japan\n$\n64,462\n \n$\n67,549 \n(4.6)\n%\n(1)\nAflac U.S.\n11,419\n \n11,063 \n3.2 \nCorporate and other\n4,530\n \n4,839 \n(6.4)\nIntercompany eliminations \n(2)\n(5,674)\n(5,943)\n4.5 \nTotal\n$\n74,737\n \n$\n77,508 \n(3.6)\n%\n(1)\n Aflac Japan’s policy liabilities decreased 10.2% in yen during the nine months ended September 30, 2025.\n(2)\n Elimination entry necessary due to the internal reinsurance transactions with Aflac Re and to recapture of a portion of policy liabilities ceded externally as a result of the reinsurance retrocession transaction. See Note 8 of the Notes to the Consolidated Financial Statements in the 2024 Annual Report. \nSee Note 7 of the Notes to the Consolidated Financial Statements for additional information on the Company's policy liabilities.\nBENEFIT PLANS\nAflac Japan and Aflac U.S. have various benefit plans. For additional information on the Company's Japanese and U.S. plans, see Note 12 of the  Notes to the Consolidated Financial Statements and Note 14 of the Notes to the Consolidated Financial Statements in the 2024 Annual Report.\nPOLICYHOLDER PROTECTION\nPolicyholder Protection Corporation\nThe Japanese insurance industry has a policyholder protection system that provides funds for the policyholders of insolvent insurers. Legislation enacted regarding the framework of the Life Insurance Policyholder Protection Corporation (LIPPC) included government fiscal measures supporting the LIPPC. In March 2022, Japan's Diet passed legislation that extended the government's fiscal support of the LIPPC through March 2027. In March 2022, the LIPPC reached the required balance for the total life industry of ¥400 billion as specified by its Articles of Incorporation. As a result, additional contributions are not expected to be required unless the balance is reduced due to payments made by the LIPPC to the policyholders of insolvent insurers. Accordingly, Aflac Japan did not recognize an expense for LIPPC assessments for the nine-month periods ended September 30, 2025 and September 30, 2024.\nGuaranty Fund Assessments\nUnder U.S. state guaranty association laws, certain insurance companies can be assessed (up to prescribed limits) for certain obligations to the policyholders and claimants of impaired or insolvent insurance companies that write the same line or similar lines of business. The amount of the guaranty fund assessment that an insurer is assessed is based on its proportionate share of premiums in that state. Guaranty fund assessments for the three- and nine-month periods ended September 30, 2025 and 2024 were immaterial.\nLIQUIDITY AND CAPITAL RESOURCES\nLiquidity refers to the ability to generate sufficient cash resources to meet the payment obligations of the Company. Capital refers to the long-term financial resources available to support the operations of the businesses, fund business growth and provide for an ability to withstand adverse circumstances. Financial leverage (leverage) refers to a strategy of utilizing debt in managing the Company's capital structure and cost of capital. The Company targets and actively manages liquidity, capital and leverage in the context of a number of considerations, including:\n•\nbusiness investment and growth needs \n•\nstrategic growth objectives \n•\nfinancial flexibility and obligations\n•\ncapital support for hedging activity \n•\na constantly evolving business and economic environment \n•\na balanced approach to capital allocation and shareholder deployment. \n111\nThe governance framework supporting liquidity, capital, and leverage includes global senior management and board committees that review and approve all significant capital related decisions. \nThe Company's cash and cash equivalents include unrestricted cash on hand, money market instruments, and other debt instruments with a maturity of 90 days or less when purchased, all of which have minimal market, settlement or other risk exposure. The target minimum amount for the Parent Company’s cash and cash equivalents is approximately $1.8 billion to provide a capital buffer and liquidity support at the holding company. The Company remains committed to prudent liquidity and capital management. At September 30, 2025, the Company held $6.8 billion in cash and cash equivalents for stress conditions, which includes the Parent Company's target minimum amount of $1.8 billion.\nAflac Japan and Aflac U.S. generate cash flows from their operations and provide the primary sources of liquidity to the Parent Company through management fees and dividends, with Aflac Japan being the largest contributor. The primary uses of cash by the Parent Company are shareholder dividends, the repurchase of its common stock, interest on its outstanding indebtedness and operating expenses. \nThe following table presents the amounts provided to the Parent Company for the nine-month periods ended September 30.\nLiquidity Provided by Subsidiaries to Parent Company\n(In millions)\n2025\n2024\nManagement fees paid by subsidiaries\n$\n127\n \n$\n118 \nDividends declared or paid by subsidiaries\n3,058\n \n2,559 \nThe following table details Aflac Japan remittances, which are included in the totals above, for the nine-month periods ended September 30.\nAflac Japan Remittances\n \n(In millions of dollars and billions of yen)\n2025\n2024\nAflac Japan management fees paid to Parent Company\n$\n55\n \n$\n49 \nAflac Japan dividends declared or paid to Parent Company (in dollars)\n2,359\n \n2,032 \nAflac Japan dividends declared or paid to Parent Company (in yen)\n¥\n346.5\n \n¥\n313.3 \nThe Company intends to maintain higher than historical levels of liquidity and capital at the Parent Company for stress conditions and with the goals of addressing the Company’s hedge costs and related potential need for collateral and mitigating against long-term weakening of the Japanese yen. Further, the Company plans to continue to maintain a population of unhedged U.S. dollar-denominated investments at Aflac Japan and to consider whether the amount of such investments should be increased or decreased relative to the Company’s view of economic equity surplus in Aflac Japan in light of potentially rising hedge costs and other factors. See the Hedging Activities subsection of this MD&A for additional information.\nThe Company believes that its balance of cash and cash equivalents and cash generated by operations will be sufficient to satisfy both its short-term and long-term cash requirements and plans for cash, including material cash requirements from known contractual obligations and returning capital to shareholders through share repurchases and dividends. For additional information, see the Liquidity and Capital Resources section of Item 7. MD&A in the 2024 Annual Report.\nIn addition to cash and cash equivalents, the Company also maintains credit facilities, both intercompany and with external partners, and a number of other available tools to support liquidity needs on a global basis. \nThe Company was in compliance with all of the covenants of its notes payable and lines of credit at September 30, 2025. \n112\nIn August 2025, the Parent Company expanded its sources of liquidity by entering into two separate facility agreements, as follows:\n1.\nA 10-year facility agreement with a Delaware trust (2035 Trust) that provides the Parent Company with the right to issue and sell to the 2035 Trust from time to time up to $1.0 billion of senior notes due August 2035.\n2.\nA 30-year facility agreement with a Delaware trust (2055 Trust) that provides the Parent Company the right to issue and sell to the 2055 Trust from time to time up to $1.0 billion of senior notes due August 2055.\nAs of September 30, 2025, the Parent Company had no senior note issuances under these facility agreements. For additional information, see Note 9 of the Notes to the Consolidated Financial Statements.\nIn September 2024, the Parent Company filed a shelf registration statement with the SEC that allows the Company to issue an indefinite amount of debt securities, in one or more series, from time to time until September 2027. \nThe Company believes outside sources for additional debt and equity capital, if needed, will continue to be available. \nAs part of enterprise-wide capital management and optimization, the Company also utilizes the intercompany reinsurance platform to execute internal reinsurance transactions with Aflac Re. For additional information, see Note 8 of the Notes to the Consolidated Financial Statements.\nThe Company's consolidated financial statements convey its financing arrangements during the periods presented. The Company has not engaged in material intra-period short-term financings during the periods presented that are not otherwise reported in its balance sheet or disclosed therein. As of September 30, 2025, the Company had no material letters of credit, standby letters of credit, guarantees or standby repurchase obligations. The Company has not entered into transactions involving the transfer of financial assets with an obligation to repurchase financial assets that have been accounted for as a sale under applicable accounting standards, including securities lending transactions. See Notes 3 and 4 of the Notes to the Consolidated Financial Statements and Notes 1, 3, and 4 of the Notes to the Consolidated Financial Statements in the 2024 Annual Report for additional information on the Company's securities lending and derivative activities. See Note 15 of the Notes to the Consolidated Financial Statements in the 2024 Annual Report for information on material unconditional purchase obligations that are not recorded on the Company's balance sheet. With the exception of disclosed activities in those referenced footnotes and the Risk Factors in the 2024 Annual Report entitled, \"The Company is exposed to foreign currency fluctuations in the yen/dollar exchange rate\" and \"Lack of availability of acceptable yen-denominated investments could adversely affect the Company's results of operations, financial position or liquidity,\" the Company is not aware of any trend, demand, commitment, event or uncertainty that would reasonably result in its liquidity increasing or decreasing by a material amount. \nConsolidated Cash Flows\nThe Company consistently generates positive cash flows from operations, and has the ability to adjust cash flow management from other sources of liquidity including reinvestment cash flows and selling investments in order to meet short-term cash needs.\nThe Company translates cash flows for Aflac Japan’s yen-denominated items into U.S. dollars using weighted-average exchange rates. In periods when the yen weakens, translating yen into dollars causes fewer dollars to be reported. When the yen strengthens, translating yen into dollars causes more dollars to be reported.\nThe following table summarizes consolidated cash flows by activity for the nine-month periods ended September 30.\n(In millions)\n2025\n2024\nOperating activities\n$\n2,240\n \n$\n2,374 \nInvesting activities\n1,202\n \n1,264 \nFinancing activities\n(2,885)\n(2,402)\nExchange effect on cash and cash equivalents\n(18)\n70 \nNet change in cash and cash equivalents\n$\n539\n \n$\n1,306 \n113\nOperating Activities\nThe principal cash inflows for the Company's insurance activities come from insurance premiums and investment income. The principal cash outflows are the result of policy claims, operating expenses, income tax, as well as interest expense. As a result of policyholder aging, claims payments are expected to gradually increase over the life of a policy. Therefore, future policy benefit reserves are accumulated in the early years of a policy and are designed to help fund future claims payments.\nThe Company expects its future cash flows from premiums and investment portfolios to be sufficient to meet its cash needs for benefits and expenses.\nInvesting Activities\nThe Company's investment objectives provide for liquidity primarily through the purchase of publicly traded investment-grade debt securities. Prudent portfolio management dictates that the Company attempts to match the duration of its assets with the duration of its liabilities. Currently, when the Company's fixed maturity securities mature, the proceeds may be reinvested at a yield below that required for the accretion of policy benefit liabilities on policies issued in earlier years. However, the long-term nature of the Company's business and its strong cash flows provide the Company with the ability to minimize the effect of mismatched durations and/or yields identified by various asset adequacy analyses. From time to time or when market opportunities arise, the Company disposes of selected fixed maturity securities that are available-for-sale to improve the duration matching of assets and liabilities, improve future investment yields, and/or rebalance its portfolio. As a result, dispositions before maturity can vary significantly from year to year.\nAs part of its overall corporate strategy, the Company has committed up to $400 million to Aflac Ventures, LLC (Aflac Ventures), as opportunities emerge. As of September 30, 2025, of the $400 million committed, approximately $297 million has been deployed. Aflac Ventures is a subsidiary of Aflac Global Ventures, LLC (Aflac Global Ventures) which is reported in Corporate and other. The central mission of Aflac Global Ventures is to support the organic growth and business development needs of Aflac Japan and Aflac U.S. with an emphasis on digital applications designed to improve the customer experience, gain efficiencies, and develop new markets in an effort to enhance and defend long-term shareholder value. Investments are included in equity securities or the other investments line in the consolidated balance sheets.\nAs part of an arrangement with Federal Home Loan Bank of Atlanta (FHLB), Aflac U.S. obtains low-cost investment funding from FHLB supported by acceptable forms of collateral pledged by Aflac U.S. In the first nine months of 2025, Aflac U.S. borrowed and repaid $571 million under this program. As of September 30, 2025, Aflac U.S. had outstanding borrowings of $399 million reported in its balance sheet.\nSee Note 3 of the Notes to the Consolidated Financial Statements for details on certain investment commitments.\nFinancing Activities\nCash flows from financing activities consist primarily of share repurchases, dividends to shareholders and, from time to time, debt issuances and redemptions.\nIn September 2025, the Parent Company extinguished ¥12.4 billion of .300% senior notes upon their maturity.\nIn June 2025, the Parent Company issued four series of senior notes totaling ¥74.9 billion through a public debt offering under its U.S. shelf registration statement. The first series, which totaled ¥35.0 billion, bears interest at a fixed rate of 1.726% per annum, payable semi-annually, and will mature in October 2030. The second series, which totaled ¥23.4 billion, bears interest at a fixed rate of 2.003% per annum, payable semi-annually, and will mature in December 2032. The third series, which totaled ¥9.5 billion, bears interest at a fixed rate of 2.369% per annum, payable semi-annually, and will mature in June 2035. The fourth series, which totaled ¥7.0 billion, bears interest at a fixed rate of 2.779% per annum, payable semi-annually, and will mature in June 2040. These notes are redeemable at the Parent Company’s option at any time, in whole but not in part, upon the occurrence of certain changes affecting U.S. taxation, as specified in the indenture governing the terms of the issuance. In addition, the notes maturing in October 2030, December 2032, June 2035 and June 2040 are redeemable at the Parent Company's option, in whole or in part from time to time, on or after July 18, 2030, September 14, 2032, December 5, 2034, and December 5, 2039, respectively, at a redemption price equal to the aggregate principal amount of the applicable series to be redeemed plus accrued and unpaid interest on the principal amount to be redeemed to, but excluding, the date of redemption.\n114\nIn May 2025, the Parent Company issued four series of senior notes totaling ¥75.1 billion through a private placement. The first series, which totaled ¥18.2 billion, bears interest at a fixed rate of 1.990% per annum, payable semi-annually, and will mature in May 2032. The second series, which totaled ¥38.3 billion, bears interest at a fixed rate of 2.320% per annum, payable semi-annually, and will mature in May 2035. The third series, which totaled ¥11.6 billion, bears interest at a fixed rate of 2.650% per annum, payable semi-annually, and will mature in May 2040. The fourth series, which totaled ¥7.0 billion, bears interest at a fixed rate of 3.040% per annum, payable semi-annually, and will mature in May 2045. These notes are redeemable at the Parent Company's option (i) in whole at any time or (ii) in part from time to time in an amount not less than 5% of the aggregate principal amount then outstanding of the notes to be redeemed.\nSee Note 9 of the Notes to the Consolidated Financial Statements for further information on the debt issuances discussed above.\nCash returned to shareholders through treasury stock purchases and dividends was $3.6 billion during the nine-month period ended September 30, 2025, compared with $2.9 billion during the nine-month period ended September 30, 2024. \nThe following tables present a summary of treasury stock activity during the nine-month periods ended September 30.\nTreasury Stock Purchased\n(In millions of dollars and thousands of shares)\n2025\n2024\nTreasury stock purchases\n$\n2,729\n \n$\n2,050 \nNumber of shares purchased:\nShare repurchase program\n25,744\n \n23,446 \nOther\n407\n \n491 \nTotal shares purchased\n26,151\n \n23,937 \nTreasury Stock Issued\n(In millions of dollars and thousands of shares)\n2025\n2024\nStock issued from treasury:\n   Cash financing\n$\n5\n \n$\n21 \n   Noncash financing\n57\n \n52 \n   Total stock issued from treasury\n$\n62\n \n$\n73 \nNumber of shares issued\n819\n \n881 \nIn August 2025, the Company's board of directors authorized the purchase of an additional 100 million shares of its common stock. As of September 30, 2025, a remaining balance of 121.6 million shares of the Company's common stock was available for purchase under share repurchase authorizations by its board of directors.\nCash dividends paid to shareholders were $.58 per share in the third quarter of 2025, compared with $.50 per share in the third quarter of 2024. The following table presents the dividend activity for the nine-month periods ended September 30.\n(In millions)\n2025\n2024\nDividends paid in cash\n$\n906\n \n$\n820 \nDividends through issuance of treasury shares\n33\n \n31 \nTotal dividends to shareholders\n$\n939\n \n$\n851 \nIn November 2025, the board of directors declared the fourth quarter cash dividend of $.58 per share, an increase of 16.0% compared with the same period in 2024. The dividend is payable on December 1, 2025 to shareholders of record at the close of business on November 19, 2025.\n115\nRegulatory Restrictions\nAflac Japan\nAflac Japan is required to meet certain financial criteria as governed by the Companies Act of Japan in order to provide dividends to the Parent Company. Under these criteria, dividend capacity at Aflac Japan is defined as total equity excluding common stock and capital reserves (representing statutorily required amounts in Japan) but reduced for net after-tax unrealized losses on available-for-sale securities. These dividend capacity requirements are generally aligned with the SMR. Japan's Financial Services Agency (FSA) maintains its own solvency standard which is quantified through the SMR. Aflac Japan's SMR is sensitive to interest rate, credit spread, and foreign exchange rate changes; therefore, the Company continues to evaluate alternatives for reducing this sensitivity, including the reduction of subsidiary dividends paid to the Parent Company and Parent Company capital contributions. In the event of a rapid change in market risk conditions causing SMR to decline, or in the event of reduced liquidity, the Company has a senior unsecured revolving credit facility in the amount of ¥100 billion as a contingency plan. Additionally, subject to market conditions, the Company expects that it could take action to enter into derivatives on unhedged U.S. dollar-denominated investments with foreign currency options or forwards or execute additional reinsurance transactions. See Notes 8 and 9 of the Notes to the Consolidated Financial Statements for additional information.\nThe Company has already undertaken various measures to mitigate the sensitivity of Aflac Japan's SMR. For example, the Company employs policy reserve matching (PRM) investment strategies, which is a Japan-specific accounting treatment that reduces SMR interest rate sensitivity since PRM-designated investments are carried at amortized cost consistent with corresponding liabilities. In order for a PRM-designated asset to be held at amortized cost, there are certain criteria that must be maintained. The primary criterion relates to maintaining the duration of designated assets and liabilities within a specified tolerance range. If the duration difference is not maintained within the specified range without rebalancing, then a certain portion of the assets must be reclassified as available-for-sale and held at fair value with any associated unrealized gain or loss recorded in surplus. To rebalance, assets may need to be sold in order to maintain the duration with the specified range, resulting in realizing a gain or loss from the sale. For U.S. GAAP, PRM investments are categorized as available-for-sale. The Company also uses foreign currency derivatives to hedge a portion of its U.S. dollar-denominated investments. See Notes 3, 4 and 8 of the Notes to the Consolidated Financial Statements in the 2024 Annual Report for additional information on the Company's investment strategies, hedging activities, and reinsurance, respectively.\nAs of September 30, 2025, Aflac Japan's SMR remains high and reflects a strong capital and surplus position. The Company is committed to maintaining strong capital levels, consistent with maintaining current insurance financial strength and credit ratings.\nThe FSA will introduce an economic value-based solvency regime based on the Insurance Capital Standards (ICS) for insurance companies in Japan. The initial report on the Economic Solvency Ratio (ESR) will be issued as of March 31, 2026, which is Aflac Japan's 2025 fiscal year-end. \nAflac U.S.\nA life insurance company’s statutory capital and surplus is determined according to rules prescribed by the National Association of Insurance Commissioners (NAIC), as modified by the insurance department in the insurance company’s state of domicile. Statutory accounting rules are different from U.S. GAAP and are intended to emphasize policyholder protection and company solvency. The continued long-term growth of the Company's business may require increases in the statutory capital and surplus of its insurance operations. The Company's insurance operations may secure additional statutory capital through various sources, such as internally generated statutory earnings, reduced dividends paid to the Parent Company, capital contributions by the Parent Company from funds generated through debt or equity offerings, or reinsurance transactions. The NAIC’s Risk-based capital (RBC) formula is used by insurance regulators to help identify inadequately capitalized insurance companies. The RBC formula quantifies insurance risk, business risk, asset risk and interest rate risk by weighing the types and mixtures of risks inherent in the insurer’s operations. As of September 30, 2025, Aflac U.S.'s combined RBC ratio remains high and reflects a strong capital and surplus position.\nAflac, CAIC and TOIC are domiciled in Nebraska and are subject to its regulations. The maximum amount of dividends that can be paid to the Parent Company by Aflac, CAIC and TOIC without prior approval of Nebraska's director of insurance is the greater of the net income from operations, which excludes net investment gains, for the previous year determined under statutory accounting principles, or 10% of statutory capital and surplus as of the previous year-end. Dividends declared by Aflac during 2025 in excess of $912 million would be considered extraordinary and require such approval. Similar laws apply in New York, the domiciliary jurisdiction of Aflac New York.\n116\nCorporate and Other\nAflac Re is licensed by the BMA as a long-term insurer and is subject to the Bermuda Insurance Act of 1978 (Bermuda Insurance Act). Aflac Re is required to file annual and quarterly returns for its Bermuda Solvency Capital Requirement (BSCR) which utilizes an Economic Balance Sheet (EBS) framework to determine Aflac Re’s Enhanced Capital Requirement (ECR). Aflac Re is also subject to a Minimum Margin of Solvency (MSM) related to its statutory financial statements. The MSM is equal to the greater of $8,000,000; 2% of the first $500,000,000 of assets under management plus 1.5% of the amount by which assets exceed $500,000,000; or 25% of ECR.\nUnder the Bermuda Insurance Act, Aflac Re is prohibited from paying dividends in an amount that exceeds 25% of the prior year's statutory capital and surplus without an affidavit stating that Aflac Re will continue to meet its solvency margin. Further, Aflac Re may not reduce its total statutory capital by 15% or more without prior regulatory approval. Additionally, Aflac Re is not permitted to pay any dividends that would cause Aflac Re to fail to meet its minimum capital requirements.\nOther\nFor information regarding commitments and contingent liabilities, see Note 13 of the Notes to the Consolidated Financial Statements.\nAdditional Information\nInvestors should note that the Company announces material financial information in its SEC filings, press releases and public conference calls. In accordance with SEC guidance, the Company may also use the Investor Relations section of the Company's website (http://investors.aflac.com) to communicate with investors about the Company. It is possible that the financial and other information the Company posts there could be deemed to be material information. The information on the Company's website is not part of this document. Further, the Company's references to website URLs are intended to be inactive textual references only.\nCRITICAL ACCOUNTING ESTIMATES\nThe Company prepares its financial statements in accordance with U.S. GAAP. These principles are established primarily by the Financial Accounting Standards Board (FASB). In this MD&A, references to U.S. GAAP issued by the FASB are derived from the FASB Accounting Standards Codification\n™\n (ASC). The preparation of financial statements in conformity with U.S. GAAP requires the Company to make estimates based on currently available information when recording transactions resulting from business operations. The estimates that the Company deems to be most critical to an understanding of its results of operations and financial condition are those related to the valuation of investments and derivatives, DAC, liabilities for future policy benefits, and income taxes. The preparation and evaluation of these critical accounting estimates involve the use of various assumptions developed from management’s analyses and judgments. Calculations of DAC and the liability for future policy benefits require the use of estimates based on actuarial valuation techniques. The application of these critical accounting estimates determines the values at which 92% of the Company's assets and 74% of its liabilities are reported as of September 30, 2025, and thus has a direct effect on net earnings and shareholders’ equity. Subsequent experience or use of other assumptions could produce significantly different results.\nThere have been no changes in the items the Company has identified as critical accounting estimates during the nine-month period ended September 30, 2025. For additional information, see the Critical Accounting Estimates section of Item 7. MD&A included in the 2024 Annual Report.\nNew Accounting Pronouncements\nFor information on new accounting pronouncements and the impact, if any, on the Company's financial position or results of operations, see Note 1 of the Notes to the Consolidated Financial Statements.\n117"
}