{
  "item1": "PART I FORWARD-LOOKING INFORMATION Company cautions readers following factors, addition other factors mentioned time time, could cause actual results differ materially those contemplated forward-looking statements: difficult conditions global capital markets economy, including inflation defaults credit downgrades investments global fluctuations interest rates exposure significant interest rate risk concentration business Japan limited availability acceptable yen-denominated investments foreign currency fluctuations yen/dollar exchange rate differing interpretations applied investment valuations significant valuation judgments determination expected credit losses recorded Company's investments decreases Company's financial strength debt ratings decline creditworthiness other financial institutions Company's ability attract retain qualified sales associates, brokers, employees, distribution partners deviations actual experience pricing reserving assumptions ability continue develop implement improvements information technology systems successful execution revenue growth expense management initiatives interruption telecommunication, information technology other operational systems, failure maintain security, confidentiality, integrity privacy sensitive data residing such systems subsidiaries' ability pay dividends Parent Company inherent limitations risk management policies procedures operational risks third-party vendors tax rates applicable Company may change failure comply restrictions policyholder privacy information security extensive regulation changes law regulation governmental authorities competitive environment ability anticipate respond market trends catastrophic events, including, but not limited to, result climate change, epidemics, pandemics, tornadoes, hurricanes, earthquakes, tsunamis, war other military action, major public health issues, terrorism other acts violence, damage incidental such events ability protect Aflac brand Company's reputation ability effectively manage key executive succession changes accounting standards level outcome litigation regulatory inquiries allegations determinations worker misclassification United States ITEM 1. BUSINESS OVERVIEW Aflac Incorporated (the Parent Company) incorporated 1973 under laws state Georgia. Parent Company its subsidiaries (collectively, Company) provide financial protection millions policyholders customers Japan United States (U.S.). Company’s principal business supplemental health life insurance products goal provide customers best value supplemental insurance products Japan U.S.",
  "item7": "Aflac U.S., Company expects growth life disability increase benefit ratios. growth well realized benefits buy build initiatives expected decrease expense ratios over time. 2025 through 2027 period, Company expects Aflac U.S. generate benefit ratio range 48% 52% expense ratio range 36% 39%.",
  "item2": "compared unrealized foreign currency translation loss $5.0 billion December 31, 2024. annualized return average shareholders’ equity third quarter 2025 23.5%. Shareholders’ equity excluding accumulated other comprehensive income (AOCI) (adjusted book value) $28.0 billion, $53.33 per share, September 30, 2025, compared $29.1 billion, $52.87 per share, December 31, 2024. Adjusted book value excluding foreign currency remeasurement $24.4 billion, $46.35 per share, September 30, 2025, compared $23.4 billion, $42.46 per share, December 31, 2024."
}