{
  "source_file": "aiz-20241231.htm",
  "form_type": "10-K",
  "item1": "Item 1. \nBusiness\n \nAssurant, Inc. was incorporated as a Delaware corporation in 2004.\nWe are a premier global protection company that partners with the world’s leading brands to safeguard and service connected devices, homes and automobiles. We leverage data-driven technology solutions to provide exceptional customer experiences. We operate in North America, Latin America, Europe and Asia Pacific through two operating segments: Global Lifestyle and Global Housing. Through our Global Lifestyle segment, we provide mobile device solutions, extended service contracts and related services for consumer electronics and appliances, and credit and other insurance products (referred to as “Connected Living”); and vehicle protection services, commercial equipment services and other related services (referred to as “Global Automotive”). Through our Global Housing segment, we provide lender-placed homeowners, manufactured housing and flood insurance, as well as voluntary manufactured housing, condominium and homeowners insurance (referred to as “Homeowners”); and renters insurance and other products (referred to as “Renters and Other”). \nOur Competitive Strengths\nOur financial strength and capabilities across our businesses create competitive advantages that we believe allow us to support our clients, deliver a superior experience for their customers and drive sustainable profitable growth over the long term.\nOur financial strength and business model.\n We believe we have a strong balance sheet and operating cash flows. As of December 31, 2024, we had $35.02 billion in total assets and our debt to total capital was 29.0%. Our business-to-business-to-consumer business model in our Global Lifestyle and Global Housing segments generate significant operating cash flows, which provide us with the flexibility to make investments to strengthen our strategic capabilities and enhance our partnerships with our clients.\nInsights and capabilities enable innovation to meet evolving consumer needs. \nWe have a deep understanding of our clients and the consumer markets they serve. We seek to leverage consumer insights, together with extensive capabilities, to identify and anticipate the needs of our clients and the consumers they serve. We leverage those insights to invest in emerging technologies and operations, including digital solutions supported by artificial intelligence (“AI”), to introduce innovative products and services and continuously adapt those offerings to the changing needs of consumers.\nValue chain integration and customer experience. \nWe own or manage multiple pieces of the value chain, which enables us to create products and service offerings based on client and consumer needs and provide a seamless customer experience. Offering end-to-end solutions allows us to provide additional value for consumers and adapt more quickly and efficiently to their needs. Visibility across the value chain helps us further improve the customer experience and our offerings. Our ability to introduce value-added services and capabilities across the value chain and provide a superior customer experience allows us to strengthen our partnerships and our competitive position.\nOur Strategy for Profitable Growth \nAs we focus on executing our strategy, we believe we are positioned for continued long-term profitable growth by:\nGrowing our portfolio of market-leading businesses\n. Our businesses represent a group of leading, protection and service-oriented offerings focused on compelling growth opportunities in attractive markets. This includes capitalizing on the convergence of the connected world in the global markets and geographies in which we operate, as well as continuing to grow with expense leverage within specialized property markets. We intend to grow our businesses by strengthening our partnerships with major clients and prospects globally, while continuing to invest in talent, capabilities and technology, including digital and AI, to enable us to deliver a superior customer experience, as well as further broadening our offerings and diversifying our distribution channels. \nProviding integrated offerings through a superior customer experience\n.\n \nAs we continue to evolve our product and service capabilities and respond to client and consumer needs, we expect ongoing innovation of our integrated offerings, leveraging data-driven insights, technology and AI to deliver additional value through a superior customer experience.\nDeploying our capital strategically.\n Our strong financial position provides us with flexibility to strategically deploy our capital. We generally deploy capital to support business growth by funding investments and through acquisitions, to pay dividends and to repurchase shares. We target new businesses and capabilities, organically and through acquisitions, that complement or accelerate our strategy. Our approach to mergers, acquisitions and other growth opportunities reflects our strategic and disciplined approach to capital management.\n3\nInvesting in talent.\n Our employees play a critical role in contributing to our success and supporting our business strategy. We believe in fostering an inclusive culture to drive sustained profitable growth through innovation. We are focused on strategically attracting, developing, retaining and motivating our talent, as we prioritize programs and initiatives aimed at investing in their growth.\n2024 Highlights\nWe continued our momentum in 2024 with strong profitable growth led by sustained outperformance within Global Housing, as well as underlying growth within Connected Living which was muted by investments in new client programs and capabilities. The combination of our strong capital position, investments to support growth and robust shareholder returns were a testament to our balanced capital management and strong cash flows of our businesses. We completed contract renewals with several key clients including our major U.S. mobile device protection clients, expanded offerings with existing clients and onboarded new client programs across Global Lifestyle and Global Housing. We continued to drive ongoing expense leverage from our scale and operating efficiencies supported by ongoing technology innovation. In October 2024, we opened our Innovation and Device Care Center, which supports our mobile device lifecycle solutions in Global Lifestyle and the development of new and innovative ways to leverage automation, robotics and artificial intelligence.\nThroughout the year, we have maintained a strong balance sheet, generating $804.7 million in dividends or returns of capital from our subsidiaries (net of infusions of liquid assets and excluding amounts used for acquisitions or received from dispositions) and returning $455.8 million to shareholders through share repurchases and common stock dividends. \nSustainability Priorities\nAssurant is a purpose-driven company that remains committed to integrating sustainability into our long-term strategy.  In 2024, we introduced a new Sustainability vision focused on three areas: Connected Communities, Respected Resources and Protected Planet. We view these sustainability priorities as directly tied to how we deliver for our employees, our clients and end-consumers in support of Assurant’s broader growth and innovation objectives.\nOur Board of Directors (the “Board”), Management Committee and global workforce understand the importance of our sustainability initiatives in supporting the successful execution of our long-term strategy.\nMoving forward, we will lean into the following areas as we set our sights on advancing our impact: \nConnected Communities.\n As a purpose-driven company, we help our customers maximize opportunities in a connected world in a way that contributes to a thriving society. We do this by focusing on creating an inclusive workplace where employees have opportunities to learn and grow; supporting communities through investing our time, skills and resources where needed; and creating superior experiences for our customers. For additional information, refer to “– Human Capital Resources” below.\nRespected Resources.\n We look for opportunities to embed circularity across our operations and to integrate programs and services into our suite of offerings that embrace circular practices to help our customers live connected lives. This mindset has led us to become an industry leader in the transition effort from a linear to a circular economy for mobile devices including our approach to responsible recycling.\nProtected Planet.\n Across our enterprise, we integrate climate actions into our long-term strategy, global facilities and product and service offerings, and work with our operations and partners to minimize negative environmental impacts.\nFor additional information on our Sustainability priorities, including our most recent Sustainability report, please refer to our website at \nhttps://www.assurant.com/about-us/sustainability\n. The information found on our website and in such reports is not incorporated by reference into and does not constitute a part of this Report. \nSegments \nThe composition of our reportable segments aligns with how we view and manage our business. For additional information on our segments, see “Item 7 – Management’s Discussion and Analysis of Financial Condition and Results of Operations – Results of Operations” and Note 5 to the Consolidated Financial Statements included elsewhere in this Report.\n4\nGlobal Lifestyle\n \nYears Ended December 31,\n \n2024\n2023\n2022\nNet earned premiums, fees and other income by product:\nConnected Living (1)\n$\n4,807.9 \n$\n4,376.8 \n$\n4,259.4 \nGlobal Automotive\n4,159.4 \n4,184.6 \n3,802.5 \nTotal\n$\n8,967.3 \n$\n8,561.4 \n$\n8,061.9 \nSegment Adjusted EBITDA\n$\n773.4 \n$\n792.3 \n$\n809.4 \nSegment equity (2)\n$\n4,830.9 \n$\n4,822.0 \n$\n4,743.3 \n(1)\nFor the years ended December 31, 2024, 2023 and 2022, 50.6%, 44.8%, and 46.0%, respectively, of net earned premiums, fees and other income was from mobile device solutions; 38.8%, 44.7%, and 44.3%, respectively, was from extended service contracts and related services for consumer electronics and appliances; and 10.6%, 10.5%, and 9.7%, respectively, was from financial services and other insurance products. \n(2)\nSegment equity does not include components of accumulated other comprehensive income (“AOCI”), which is primarily comprised of net unrealized gains/ losses on securities, net of taxes. For additional information on total AOCI, see Note 21\n \nto the Consolidated Financial Statements included elsewhere in this Report.\nOur Products and Services\nThe key lines of business in Global Lifestyle are: Connected Living, which includes mobile device solutions (including extended service contracts, insurance policies and device lifecycle related services), extended service contracts and related services for consumer electronics and appliances, and financial services and other insurance products; and Global Automotive. \nConnected Living: \nThrough partnerships with mobile service providers (including carriers, retailers, original equipment manufacturers (“OEMs”) and cable operators) and financial and other institutions, we underwrite and provide administrative support and related services for extended service contracts. These contracts provide consumers with coverage on mobile devices and consumer electronics and appliances, protecting them from certain covered losses. We pay the cost of repairing or replacing these consumer goods in the event of loss, theft, accidental damage, mechanical breakdown or electronic malfunction after the manufacturer's warranty expires. Our strategy is to provide integrated service solutions to our clients that address all aspects of the insurance or extended service contract, including program design and marketing strategy, risk management, data analytics, customer support and claims handling, supply chain services, service delivery and repair and logistics management, while ensuring exceptional customer experience measured through our net promoter scores. For example, we provide end-to-end mobile device lifecycle solutions in our mobile business from when the device is received and inspected, repaired or refurbished, to when it is ultimately disposed of through a sale to a third-party or used to support an insurance claim. In addition to extended protection for multiple devices, our mobile offerings include trade-in and upgrade programs, premium technical support, including device self-diagnostic tools, and device disposition. We also sell repaired or refurbished mobile and other electronic devices, as well as provide Certified Pre-Owned (“CPO”) devices to our clients to fulfill their insurance and consumer needs. We provide in-store, same-day device repairs to customers through our nationwide network of over 900 repair and partner locations that support both our insurance and non-insurance customers. We believe that with the required administrative capability, digital platforms enabling on-boarding, claims management and service delivery, supply chain management, technical support infrastructure, insurance underwriting capabilities and a variety of adjacent value-added services, like trade-in and upgrade and asset value recovery, we maintain a differentiated position in this marketplace. \nWithin Connected Living, our global financial services business maintains a suite of protection and assurance products that deliver a combination of features and benefits for varying customer segment needs. With major financial services clients, we provide value-added financial services in the U.S. and internationally, ranging from credit insurance to inclusive credit card benefits, packaged bank account benefits and travel coverages. \n5\nGlobal Automotive: \nWe underwrite and provide administrative services for vehicle service contracts (“VSCs”) and ancillary products providing coverage for vehicles, including automobiles, trucks, recreational vehicles, motorcycles, construction and agricultural equipment, as well as parts. For VSCs, we pay the cost of repairing a customer’s vehicle in the event of mechanical breakdown. For ancillary products, including relating to commercial and other leased or financed equipment, coverage varies, but, generally, we pay the cost of repairing, servicing or replacing parts or provide other financial compensation in the event of mechanical breakdown, accidental damage or theft. We provide integrated service offerings to our clients, including program design and marketing strategy, risk management, data analytics, customer support and claims handling, reinsurance facilitation, actuarial consulting, experiential and digital training and performance management. We work closely with our global partners to develop innovative offerings that reflect the evolution of the auto market, such as Assurant Vehicle Care which represents a majority of dealer services contracts providing a comprehensive suite of enhanced vehicle protection products and a new digital experience for consumers. We also provide risk management solutions tailored for commercial and leased equipment where our core products include insurance tracking and physical damage insurance.\nDistribution and Clients \nGlobal Lifestyle operates globally, with approximately 82.1% of its revenue from North America (the U.S. and Canada), 7.5% from Latin America (Brazil, Argentina, Puerto Rico, Mexico, Chile, Colombia and Peru), 5.9% from Europe (the United Kingdom (the “U.K.”), France, Italy, Spain, Germany and the Netherlands) and 4.5% from Asia Pacific (Japan, Australia, New Zealand, South Korea, India, Singapore and Hong Kong for the year ended December 31, 2024). In fourth quarter 2023, we made the decision to fully exit our operations in mainland China (other than Hong Kong), which were subsequently sold in 2024. Global Lifestyle focuses on establishing strong, long-term relationships with clients that are leaders in their markets, including leading distributors of our products and services. In Connected Living, we partner with mobile service providers (including carriers, retailers, OEMs and cable operators) and financial and other institutions to market our mobile device solutions, with some of the largest OEMs, consumer electronics retailers, appliance retailers (including e-commerce retailers) and cable operators to market our extended service contracts and related services, and with financial institutions, insurers and retailers to market our credit and other insurance products. In Global Automotive, we partner with auto dealers and agents, third-party administrators, manufacturers, equipment retailers and large banks and financing companies to market our vehicle protection, commercial equipment-related products and other related services. Many of our agreements in Global Lifestyle are exclusive and multi-year with terms generally between three and five years and allow us to integrate our administrative systems with those of our clients.\nGlobal Lifestyle is dependent on a few clients, in particular mobile service providers, and a reduction in business with or the loss of one or more such clients could have a material adverse effect on our results of operations and cash flows. See “Item 1A – Risk Factors – Business, Strategic and Operational Risks – \nOur revenues and profits may decline if we are unable to maintain relationships with significant clients, distributors and other parties, or renew contracts with them on favorable terms, or if those parties face financial, reputational or regulatory issues.\n”\nOur Addressable Markets and Market Activity   \nThe mobile protection market is a large and growing global market with evolving wireless standards. While smartphone penetration in the U.S., Japanese and European markets is high, other markets are less mature and present growth opportunities. Global adoption of 5G by subscribers is a high priority for mobile service providers. The worldwide used and refurbished smartphone market is growing, driven by the cost and availability of new devices and sustainability-conscious customers.\nConsumer needs relating to mobile devices are continuing to expand in scope. We believe there are growth opportunities in bundled protection products, which support customers as they take full advantage of the features and functions of their mobile devices through their daily interaction with a connected world. Expanded capabilities like repair and logistics, technical support for customers and enhanced customer experience through digital solutions and AI allow us to create product and service offerings that customers find compelling. We believe there are additional growth opportunities in expanding protection to other devices and technologies within the home.\nOur business is subject to fluctuations in mobile device trade-in and upgrade volumes based on the release of new devices and carrier promotional programs, as well as customer preferences.  \nU.S. new vehicle sales have shown slight improvements from 2023 driven by increased vehicle availability and OEM incentives. The used vehicle market in the U.S. has started to normalize from recent elevated used vehicle prices and a shift in sales to new vehicles, but this normalization is tempered by lower and aging used vehicle inventory. In addition, higher interest rates have impacted affordability of finance and insurance products and lowered attachment rates. The commercial equipment segment continues to expand, partially mitigating challenges in our U.S. auto business. In addition, new vehicle sales continue to grow in some markets internationally. In addition, inflation continues to have a significant impact on our Global Automotive results as parts and labor adversely affect claims costs for clients where we have underwriting exposure.\n6\nConsumers are becoming increasingly connected across their mobile devices, vehicles and homes, which is creating a global market for smart home devices and related services. We believe this will create long-term opportunities for Assurant as consumers’ lifestyles will increasingly intertwine with their connected ecosystems, which we call the connected world. Due to our capabilities, including device protection, premium technology support, service delivery and financing, as well as technology components such as dynamic fulfillment, which integrates a dynamic mobile claims management process with risk and fraud mitigation, we are well positioned to support customers as the smart home market continues to grow.\nIn our financial services business, our focus is on expanding our partnerships with leading financial institutions to offer travel, purchase protection, and other credit card benefits, including underwriting and claims processing, and packaged bank account offerings to their customers. \nRisk Management\nWe earn premiums on our insurance and extended service contracts and fees for our other services. For a portion of our contracts, we share in the underwriting risk with our clients through reinsurance or profit-sharing agreements. We believe that these arrangements better align our clients’ interests with ours and help us to better manage risk exposure. For additional risks relating to our Global Lifestyle segment, please see “Item 1A – Risk Factors.”\nInventory \nIn our mobile business, we carry inventory to meet the delivery requirements of certain clients. These devices are ultimately disposed of through sales to third parties. Our inventory includes devices and parts on consignment with our nationwide network of over 900 repair and partner locations through which we provide in-store repairs. Inventory levels may vary from period to period due to, among other things, differences between actual and forecasted demand, supply chain constraints, the addition of new devices and parts, and strategic purchases. Payment terms with clients also vary, which may result in less inventory financed by clients and more inventory financed with our own capital. \nWe take various actions to manage our inventory, including monitoring our inventory levels, managing the timing of purchases and obtaining return rights for some programs and devices. However, the value of certain inventory could be adversely impacted by technological changes affecting the usefulness or desirability of the devices and parts, physical problems resulting from faulty design or manufacturing, increased competition, decreased consumer demand, including due to changes in customer preferences and changes in client promotions, supply chain constraints, growing industry emphasis on cost containment and adverse foreign trade relationships. No assurance can be given that we will be adequately protected against declines in inventory value. See “Item 1A – Risk Factors – Business, Strategic and Operational Risks – “\nOur mobile business is subject to the risk of declines in the value and availability of mobile devices, and to regulatory compliance and other risks.” \nSeasonality\nWe experience seasonal fluctuations that impact demand in each of our lines of business. For example, seasonality for extended service contracts and VSCs aligns with the seasonality of the retail and automobile markets. In addition, our mobile results may fluctuate quarter to quarter due to the actual and anticipated timing and availability of the release of new devices and carrier promotional programs.\nGlobal Housing\n \nYears Ended December 31,\n \n2024\n2023\n2022\nNet earned premiums, fees and other income by product:\nHomeowners\n$\n1,958.9 \n$\n1,663.4 \n$\n1,402.2 \nRenters and Other\n498.1 \n479.5 \n482.4 \nTotal\n$\n2,457.0 \n$\n2,142.9 \n$\n1,884.6 \nSegment Adjusted EBITDA\n$\n671.2 \n$\n574.2 \n$\n246.0 \nSegment equity (1)\n$\n1,597.8 \n$\n1,318.9 \n$\n1,272.8 \n(1)\nSegment equity does not include components of AOCI, which is primarily comprised of net unrealized gains/ losses on securities, net of taxes. For additional information on total AOCI, see Note 21 to the Consolidated Financial Statements included elsewhere in this Report.\n7\nOur Products and Services\nThe key lines of business in Global Housing are Homeowners and Renters and Other, each as described below.\nHomeowners:\n We provide lender-placed homeowners, manufactured housing and flood insurance, as well as voluntary manufactured housing, condominium and homeowners insurance.\nLender-placed homeowners insurance\n. Lender-placed homeowners insurance consists principally of fire and dwelling hazard insurance offered through our lender-placed program. The lender-placed program provides collateral protection to lenders, mortgage servicers and investors in mortgaged properties in the event that a homeowner does not maintain insurance on a mortgaged dwelling. Lender-placed homeowners insurance provides structural coverage, similar to that of a standard homeowners policy. The amount of coverage is often based on the last known insurance coverage under the prior policy for the property and provides replacement cost coverage on the property. It protects both the lender’s interest and the borrower’s interest and equity. We also provide real estate owned (“REO”) insurance, consisting of insurance on foreclosed properties managed by our clients.\nIn the majority of cases, we use proprietary insurance-tracking administration systems linked with the administrative systems of our clients to monitor clients’ mortgage portfolios to verify the existence of insurance on each mortgaged property and identify those that are uninsured. If there is a potential lapse in insurance coverage, we begin a process of outreach and notification to the homeowner and the last known insurance carrier or agent through phone calls, written correspondence and in some cases direct interfaces with insurance carriers, which generally takes up to 90 days to complete. If coverage cannot be verified at the end of this process, the mortgage servicer procures a lender-placed policy. The process of tracking voluntary coverage \n- \nincluding determining whether voluntary coverage is in force, the policy limits in place, the perils insured and the deductibles, and obtaining other required insurance related information \n- \nis part of our risk exposure management for our lender-placed insurance business. The exposure management process is needed in order to underwrite the risk we assume, to understand loss exposure and to communicate with appropriate parties, including the lender, insurance agent and homeowner. Our placement rates reflect the ratio of insurance policies placed to tracked hazard loans. The homeowner always retains the option to obtain or renew the insurance in the voluntary insurance market.\nLender-placed manufactured housing insurance.\n Lender-placed manufactured housing insurance consists principally of fire and dwelling hazard insurance for manufactured housing offered through our lender-placed program. Lender-placed manufactured housing insurance is issued after an insurance tracking and exposure management process similar to that described above. In most cases, tracking is performed using a proprietary insurance-tracking administration system.\nLender-placed flood insurance\n. Lender-placed flood insurance consists of flood insurance offered through our lender-placed program. It provides collateral protection to lenders in mortgaged properties in the event a homeowner does not maintain required flood insurance. Lender-placed flood insurance is issued after an insurance tracking and exposure management process similar to that described above.\nVoluntary insurance. \nWe offer voluntary manufactured housing, condominium and homeowners insurance. Our voluntary insurance products generally provide structural, contents and liability coverage. \nRenters and Other:\n We provide renters insurance and other products, as described below.\nRenters insurance. \nWe provide integrated solutions across the resident lifecycle. We offer renters insurance for a wide variety of single and multi-family rental properties, providing content protection for renters’ personal belongings and liability protection for the property owners against renter-caused damage. We also offer an integrated billing and tracking platform for our clients and their customers. In addition, we provide tenant bonds as an alternative to security deposits, which allows our clients to offer a lower move-in cost option while minimizing the risk of loss from damages, and receivables management, which helps our clients to maximize the collection of amounts owed by prior tenants.\nOther products. \nWe are the second largest administrator for the U.S. government under the voluntary National Flood Insurance Program (the “NFIP”), for which we earn fees for collecting premiums and processing claims. This business is 100% reinsured to the U.S. government. \nDistribution and Clients \nGlobal Housing establishes long-term relationships with leading mortgage lenders and servicers, manufactured housing lenders, property managers, and financial, insurance and other institutions. Lender-placed insurance products are distributed primarily through mortgage lenders, mortgage servicers and financial and other institutions. The majority of our lender-placed agreements are exclusive. Typically, these agreements have terms of three to five years and allow us to integrate our systems with those of our clients. Renters products are distributed primarily through property management companies and affinity marketing partners. We offer our voluntary insurance programs primarily through manufactured housing lenders and retailers, \n8\nalong with independent specialty agents. Independent specialty agents also distribute flood products and other property products.\nGlobal Housing is dependent on a few clients, and a reduction in business with or the loss of any one or more such clients could have a material adverse effect on our results of operations and cash flows. See “Item 1A – Risk Factors – Business, Strategic and Operational Risks – \nOur revenues and profits may decline if we are unable to maintain relationships with significant clients, distributors and other parties, or renew contracts with them on favorable terms, or if those parties face financial, reputational or regulatory issues.”\nOur Addressable Markets and Market Activity\nIn the lender-placed market, placement rates have increased in certain areas, due to reduced availability within the voluntary homeowners’ insurance market, including in California and Texas. We continue to monitor the state of the overall housing market and the potential impact of loan modifications, forbearances and foreclosure delays, including the impact to REO volumes. Should the housing market deteriorate for a prolonged period, we could experience a longer-term increase in our placement rates over time. In addition to the overall market, our lender-placed results are also impacted by inflation and the costs of paying claims, and the mix of loans we service.\n The U.S. renters insurance market is a growing market with new building development, high occupancy and favorable relocation trends. We believe there is opportunity to increase our market share and attachment rates with new and existing clients through our investments in digital platforms designed to deliver superior customer experience and our expanded offerings to provide end-to-end solutions.\nRisk Management\nWe earn premiums on our insurance products and fees for our services. Our lender-placed insurance products are not underwritten on an individual policy basis. Contracts with our clients require us to issue these policies automatically when a borrower’s insurance coverage is not maintained. These products are priced to factor in the additional risk from ensuring that all client properties have continuous insurance coverage. We monitor pricing adequacy based on a variety of factors and adjust pricing as required, subject to regulatory constraints, including through a built-in quarterly inflation guard feature. For additional risks relating to our Global Housing segment, please see “Item 1A – Risk Factors”, including “– Financial Risks – \nWe may be unable to accurately predict and price for claims and other costs, which could reduce our profitability\n” and “\n – Actual results may differ materially from the analytical models we use to assist in our decision-making in key areas such as pricing, catastrophe risks, reserving and capital management\n” therein.\nBecause several of our business lines (such as homeowners, manufactured housing and other property policies) are exposed to catastrophe risks, we purchase reinsurance coverage to reduce our financial exposure, protect capital, and mitigate earnings and cash flow volatility. Our reinsurance program generally incorporates a provision to allow for the reinstatement of coverage, which provides protection against the risk of multiple catastrophes in a single year. \nFor our 2024 catastrophe reinsurance program, we consolidated our main reinsurance purchases into a single placement date of April 2024. 2024 reinsurance premiums for the total program are estimated to be $188.9 million pre-tax, as of December 31, 2024, compared to $207.2 million pre-tax for 2023, reflecting impacts from changing the timing of program placement in this initial year of transition to a single placement date, as well as favorable underlying rates from improved reinsurance market conditions. The U.S. per-occurrence catastrophe coverage included a main reinsurance program providing $1.48 billion of coverage in excess of a $150.0 million retention for a first event. Layers 1 through 7 of the program allow for one automatic reinstatement. When combined with the Florida Hurricane Catastrophe Fund, the U.S. program protects against gross Florida losses of up to approximately $1.69 billion, in excess of retention.\nWe are also subject to non-catastrophe risk from isolated fire, water and wind damage, theft and vandalism, as well as general liability in renters and homeowners policies. Losses are impacted by increases in the cost of materials and labor required to settle claims. Please see “Item 1A – Risk Factors – Business, Strategic and Operational Risks – \nCatastrophe and non-catastrophe losses, including as a result of climate change and the current inflationary environment, could materially reduce our profitability and have a material adverse effect on our results of operations and financial condition\n.”\nSeasonality\nWe experience seasonal fluctuation in several of our lines of business, which are exposed to the risk of catastrophe and non-catastrophe losses. Catastrophe events such as hurricanes typically occur in the second half of the year, and may increase in frequency and severity due to climate change. We also experience some seasonal fluctuation in non-catastrophe weather-related claims that tend to occur in the first half of the year.\n9\nCompetition\nOur businesses focus on supporting, protecting and connecting major consumer purchases. Although we face global competition in each of our businesses, we believe that no single competitor competes against us in all of our business lines. Across Global Lifestyle and Global Housing, we compete for business, clients, customers, agents and other distribution relationships with many insurance companies, warranty and protection companies, financial services companies, mobile device repair and logistics companies, technology and software companies and specialized competitors that focus on one market, product or service. We must respond to the threat of disruption by traditional players, as well as from new entrants, such as “Insurtech” start-up companies and others. Competition in each business is based on a number of factors, including scope of products and services offered, ability to tailor products and services to client and consumer needs, product features and terms, pricing, technology offerings, diversity of distribution resources, brand recognition, costs, financial strength and ratings, resources, and quality of service, including speed of claims payment and the overall customer experience. The relative importance of these factors varies by product and market. To remain competitive in many of our businesses, we must also anticipate and respond effectively to changes in customer preferences, new industry standards, evolving distribution models, disruptive technology developments and alternate business models. For further information on the risks associated with competition, see “Item 1A – Risk Factors – Business, Strategic and Operational Risks – \nSignificant competitive pressures, changes in customer preferences and disruption could adversely affect our results of operations.\n”\nHuman Capital Resources\nA cornerstone of Assurant is the employees who bring our purpose, values and commitments to life each day for the millions of customers we serve worldwide. We believe in fostering an inclusive and performance-based culture to drive sustained profitable growth through innovation. We regularly evaluate our policies, practices and programs to ensure we continue to attract, develop and retain the best talent to support our strategy. This includes ongoing investments in competitive total rewards and wellbeing offerings, and providing programs for learning, development and engagement, while continuously enhancing the experience of our employees who are critical to our long-term success. \nAs of December 31, 2024, Assurant had approximately 14,200 employees representing, more than 80 nationalities, with a presence in 21 markets globally. Our global workforce spans a wide range of roles and skills. While 75% of our employee base was located in North America, we continued to expand our presence in key international markets across Europe, Latin America and Asia Pacific to support our increasingly global client portfolio. As of December 31, 2024, approximately 63% of our employees were frontline workers, predominantly in hourly roles such as customer care, claims administration, mobile repair and logistics. The remaining 37% were in managerial roles, predominantly salaried employees engaged in an array of business and support functions. As of December 31, 2024, 60% of our global workforce were women. In the U.S., our largest market, women accounted for 63% of employees while other underrepresented minority groups accounted for 56% of our domestic workforce. We continue to promote and welcome an inclusive workforce across all levels of the Company in support of our business strategy. \nFor full-year 2024, our global turnover rate was 13%, reflecting our blended workforce of frontline and managerial roles; turnover for managerial and salaried roles was 5%, and turnover for frontline employees was 17%, which is typically higher given the nature of the roles. The turnover rate for both frontline and managerial employees improved by 2 and 1 percentage points, respectively, year-over-year\n(1)\n. Overall, this is attributed to ongoing actions to identify and remediate talent risks and enhance the employee experience as well as stabilization in key labor markets.  \nThe Board, through the Compensation and Talent Committee, oversees the significant human capital management programs of Assurant, which are led by Assurant’s Chief Executive Officer (“CEO”), its Chief Operating Officer and its Chief People Officer. Attracting, developing and retaining the best talent globally is key to our success in sustaining long-term profitable growth. In January 2024, we expanded our Management Committee to broaden leadership expertise and depth in the areas of financial, human capital and technology strategy. These appointments further underscored our deep talent pool and robust succession bench. \nOur talent strategy is focused on empowering employees to learn, grow and thrive, equipping the business with the talent needed to deliver on our long-term strategy, and recognize and reward performance. As part of our talent strategy, we have established Global Capability Centers, or global talent hubs in key markets, to leverage our global scale and access to best-in-class talent. We believe this advances our operating model, creates new capacity for client growth, fosters innovation, and enables talent to focus on customer experiences in key attractive markets. \n(1) Beginning in 2024, we revised the definition of employer turnover to include voluntary turnover only. We believe this revised approach to exclude any involuntary actions provides better insight into the program and strategies we can take as an organization to impact employee retention.\nWe regularly engage with our employees to seek feedback through an array of forums and channels, including one-on-one discussions with managers, interactive townhall meetings, employee surveys and our enterprise-wide listening program \n10\ndesigned to expand opportunities for anonymous, real-time feedback between managers and employees. Key topics covered include our culture, learning and development, compensation, benefits, wellbeing and recognition. Based on employee feedback, action plans are implemented to address gaps or to further enhance employee satisfaction in alignment with our overall human capital strategy. Results from our most recent listening program that concluded in June 2024 benefited from strong employee participation and showed improvement above the prior year and generally above relevant industry benchmarks. Overall, the survey highlighted that employees generally feel engaged and aligned with the Company’s priorities and that our culture is a differentiator. In many areas, such as management support, mental wellbeing, and recognition, results trended more favorably against our 2023 engagement survey and at or above comparable industry benchmarks.\nFostering an Inclusive and Performance Driven Culture\nBuilding an inclusive culture is more than the right thing to do - it’s a business imperative - a key enabler of growth and innovation, rooted in our belief that more inclusive teams deliver stronger performance. We believe global teams and inclusive cultures perform better by improving our ability to respond to the changing global marketplace. We are committed to foster a sense of belonging at Assurant. Our Chief Operating Officer has direct oversight and responsibility for our strategy, along with our SVP, Global Communications and Sustainability.\nWe strategically recruit talent with different expertise, experiences, and perspectives necessary to deliver on our long-term strategies, including through strategic and educational partnerships that bring greater visibility and expertise. We are focused on inclusion through global programming, including five\n Employee Resource Groups, which are open to all employees globally and \nprovide forums for employees to raise topics that are important to them. All Employee Resource Groups are chaired by members of our Management Committee or senior leaders to reinforce commitment and engagement at the highest levels of the company.  In the marketplace, we support digital inclusion, STEM and thriving communities through the Assurant Foundation and we partner with nonprofit organizations to provide leadership development opportunities. \nFair Pay \nAssurant is committed to fair pay. Our compensation practices and programs consider a variety of factors designed to set fair compensation levels. We take a holistic approach to evaluating and aligning roles with compensation levels based on job responsibilities, market competitiveness, geographical location, strategic importance of roles and other relevant factors. We periodically evaluate our compensation practices and for the last several years have engaged in a multi-step pay equity assessment process to ensure that we are compensating fairly for employees performing substantially similar job responsibilities. Results from our last review completed in 2024, which examined base pay and target total cash compensation for U.S.- based employees, and base pay for the U.K.-, Argentina- and Canada-based employees, or roughly 87% of our workforce, confirmed that there is no evidence of systemic disparities for comparable job groupings with similar skill, scope and effort. We expect to continue to assess compensation practices annually and remain committed to remediate any significant pay disparities we may discover. We also continue to monitor and adjust market wages as necessary to ensure we provide competitive wages, consistent with our ongoing compensation practices. \nWe remain committed to investing in our people through competitive rewards and development opportunities. We continued to reward high performers and invest in merit increases, allocating more funding to front-line employees in recognition of the disproportionate impact of the current challenging economic environment. We have advanced our commitment to pay transparency, particularly in North America, by providing applicants and employees with base salary ranges for their role and grade. \nTotal Rewards and Wellbeing \nWe are committed to the health and safety of our employees as we believe the success of our business is directly connected to their wellbeing. In addition to providing robust compensation and benefits programs and opportunities to invest in their financial future, we offer employees and their families access to a variety of health and wellness programs. Our Total Rewards programs help to provide protection and security related to events that may require time away from work or that impact their financial wellbeing, such as paid time off, family leave, family care resources and flexible work schedules. Our Global Employee Assistance Plan provides additional support to help employees and their families access critical resources for their wellbeing, including financial, social, physical and mental health. \nTo further promote wellbeing, Assurant continued to expand the reach of its Personify Health (formerly known as Virgin Pulse) global wellbeing platform allowing employees to personalize their unique wellbeing goals with access to tools, activities and ways to stay engaged and accountable for building healthy habits. Assurant also included access to the Headspace App as a no-cost benefit for all global employees, which is an additional resource for managing stress and helping to find better balance. \nWe regularly benchmark our Total Rewards against companies of similar size and industries to ensure our offerings remain competitive and solicit employee feedback on the evolving needs of our workforce. We conducted employee focus groups that helped validate that recommended plan changes for 2024 met the needs of our global workforce, particularly around predictability and affordability of health care costs. Additionally, there were several enhancements to benefits starting in 2024, \n11\nsuch as increased employer contributions, expanded plan offerings and more affordable virtual care and mental health access. Assurant also has an HR virtual assistant to provide easy access to routine questions employees raise with the goal of improving their experience as an employee. We will continue to assess additional opportunities across Total Rewards and Wellbeing to help attract and retain top talent. \nRecognizing the benefit of flexible work arrangements for our business, customers and employees, we continued to enable a long-term shift to a hybrid work model to support our business and talent strategy. A majority of our employees work virtually on a full-time or part-time basis. While we will continue to encourage purposeful in-person engagement to support our culture, team development and product innovation, we believe our hybrid work model will remain a key competitive advantage to support the evolving needs of our customers and employees. Within this hybrid environment, we introduced a new framework to support enterprise engagement. \nWe continued our ongoing real estate consolidation to support work-from-home arrangements given our increasingly hybrid workforce, \nwhile making necessary investments in key facilities (such as our Nashville Innovation and Device Care Center) and markets to support the long-term strategy of the Company.\n \n \nLearning and Development \nLearning and development are essential to Assurant’s success. We continually invest in our employees’ career growth and provide employees with a wide range of training and development opportunities, including face-to-face, virtual and self-directed learning, mentoring and external development opportunities through a portfolio of initiatives called Leading the Way, which is designed to unlock the potential of our talent to achieve our vision and purpose. Leading the Way is intended to further grow skills, capabilities and careers to impact engagement, performance and drive results. Strengthening employees’ leadership, technical and professional skills to broaden career opportunities, while also reinforcing a culture of strong ethics and compliance, are primary focus areas. We continue to implement key initiatives to support upskilling and reskilling and increase adoption of new technology and processes by providing both learning and change support, furthering our focus on a digital-first mindset. In 2024, this included the ongoing integration of AI\n tools to enhance and improve the employee and customer experience with the appropriate training and reporting to ensure we effectively govern deployed solutions and continuously learn. We also continued to provide all employees with access to industry leading content and a virtual mentor to further develop professional, technical, and managerial skills. This also included specific access for technology employees to immerse in technology labs and assessments as we look to expand critical skills in this area. \nAdditionally, Assurant assists employees in the pursuit of undergraduate and graduate degrees, certifications and continuing education required by certain professional organizations. \nWe have adapted our learning and development programs and delivery modes to meet the varying needs of our business and our predominantly virtual workforce. We provide a broad array of training on topics such as managing virtual and hybrid teams, mental health awareness and building resilience, managerial skills and inclusion. In 2024, we continued to enhance our manager and senior leader programming to strengthen our bench of future ready leaders. In addition, we implemented an enterprise-wide mentorship program to help support emerging talent.   \nSuccession Planning\n \nAn important element of our talent strategy is succession planning and building leadership pipelines for our most critical roles across the organization. \nWe assess the performance and potential of current incumbents, identify and assess potential successors, and create targeted development plans to strengthen the preparedness of our talent pipeline. Annually, we conduct a comprehensive talent review to discuss potential successors of our Management Committee and other key leadership roles, as well as a broader group of top talent as we look to ensure better visibility into our strengths and opportunities for prioritized roles. The Compensation & Talent Committee annually reviews the CEO succession plan and succession plans for senior executives, which includes emergency successors for each role, and conducts a broader talent review with the goal to ensure we have the right leadership in place to execute the Company’s long-term strategic plans.\nFor more information on our human capital resources, please refer to our most recent Sustainability Report available at \nhttps://www.assurant.com/our-story/sustainability\n and our most recent Proxy Statement available at \nir.assurant.com\n. The information found on our website and in such reports is not incorporated by reference into and does not constitute a part of this Report.\nIntellectual Property\nWe rely on a combination of contractual rights and patents, trademarks, copyrights and trade secrets to establish and protect our intellectual property. We regularly file patent and trademark applications to protect innovations arising from our research, development, design and marketing. We own a number of patents and pending applications relating to technical innovations. In addition, we have a trademark portfolio that we consider important in the marketing of our products and services, including the “Assurant” brand name.\n12\nOver time, we have accumulated a sizeable portfolio of issued and registered intellectual property rights around the world, and we seek to protect it against infringement. No single intellectual property right is solely responsible for protecting our products and services. We have also entered into agreements that permit other companies to use certain of our patents and trademarks.\nWe believe the duration of our intellectual property rights is adequate relative to the expected lives of our products and services. Patents are of varying duration depending on the filing date, and they will typically expire at the end of their natural term. The trademark registrations may be renewed indefinitely, subject to country-specific use and registration requirements. For risks relating to our intellectual property, see “Item 1A – Risk Factors – Legal and Regulatory Risks – \nOur business is subject to risks related to litigation and regulatory actions.\n”\nRatings\n \nIndependent rating organizations periodically review the financial strength of insurers, including many of our insurance subsidiaries. Financial strength ratings represent the opinions of rating agencies regarding the ability of an insurance company to meet its financial obligations to policyholders and contract holders. These ratings are not applicable to our common stock or debt securities. Ratings are an important factor in establishing the competitive position of insurance companies.\nRating agencies also use an “outlook statement” of “positive,” “stable,” “negative” or “developing” to indicate a medium- or long-term trend in credit fundamentals which, if continued, may lead to a rating change. A rating may have a stable outlook to indicate that the rating is not expected to change; however, a stable outlook does not preclude a rating agency from changing a rating at any time, without notice.\nMost of our domestic operating insurance subsidiaries are rated by A.M. Best Company (“A.M. Best”). In addition, three of our domestic operating insurance subsidiaries are rated by Moody’s Investors Service, Inc. (“Moody’s”) and S&P Global Ratings, a division of S&P Global Inc. (“S&P”). The ratings issued on our operating insurance subsidiaries by these agencies are announced publicly and are available from the agencies.\nFor information on the risks associated with ratings downgrades, see “Item 1A – Risk Factors – Financial Risks – \nA decline in the financial strength ratings of our insurance subsidiaries could adversely affect our results of operations and financial condition.\n”\nThe following table summarizes the financial strength ratings and outlooks of our domestic operating insurance subsidiaries as of December 31, 2024:\nA.M. Best (1)\nMoody’s (2)\nS&P (3)\nCompany\nAmerican Bankers Insurance Company of Florida\nA+ \nA2\n A \nAmerican Bankers Life Assurance Company of Florida\nA \nA2\n A \nAmerican Security Insurance Company\nA+ \nA2\n A \nCaribbean American Life Assurance Company\nA \n N/A \n N/A \nCaribbean American Property Insurance Company\nA+ \n N/A \n N/A \nReliable Lloyds Insurance Company\nA+ \n N/A \n N/A \nStandard Guaranty Insurance Company\nA+ \n N/A \n N/A \nVirginia Surety Company, Inc.\nA+ \n N/A \n N/A \nVoyager Indemnity Insurance Company\nA+ \n N/A \n N/A \n(1)\nA.M. Best financial strength ratings range from “A+” (superior) to “D” (poor). A second “+” or a “-” may be appended to ratings from categories A+ to C to indicate relative position within a category. Ratings of A+ fall under the “superior” category, which is the highest of A.M. Best’s seven ratings categories, while ratings of A fall under the “excellent” category, which is the second highest of A.M. Best’s seven ratings categories. A.M. Best has a stable outlook on all of our domestic operating insurance subsidiaries’ financial strength ratings.\n(2)\nMoody’s insurance financial strength ratings range from “Aaa” (highest quality) to “C” (lowest rated). A numeric modifier may be appended to ratings from “Aa” to “Caa” to indicate relative position within a category, with 1 being the highest and 3 being the lowest. A rating of A2 is considered “upper-medium-grade” and falls within the third highest of Moody’s nine ratings categories. Moody's has a stable outlook on all of our domestic operating insurance subsidiaries’ insurance financial strength ratings.\n(3)\nS&P’s insurer financial strength ratings range from “AAA” (extremely strong) to “D” (general default). A “+” or “-” may be appended to ratings from categories AA to CCC to indicate relative position within a category. Ratings of A (strong) are within the third highest of S&P’s nine ratings categories. S&P has a stable outlook on all of our domestic operating insurance subsidiaries’ insurer financial strength ratings. \n13\nRegulation \nWe are subject to extensive federal, state and international regulation and supervision in the jurisdictions in which we do business. Regulations vary from jurisdiction to jurisdiction. \nThe following is a summary of significant regulations that apply to our businesses, but it is not intended to be a comprehensive review of every regulation to which we are subject. For information on the risks associated with regulations applicable to us, see “Item 1A – Risk Factors –\n \nBusiness, Strategic and Operational Risks”, “Item 1A – Risk Factors –\n \nTechnology, Cybersecurity and Privacy Risks” and “Item 1A – Risk Factors – Legal and Regulatory Risks.” \nHolding Company Insurance Regulations\nUnder applicable insurance holding company regulations, no person may acquire a controlling interest in the Company or any of our insurance company subsidiaries, unless such person has obtained prior regulatory approval for such acquisition. Under these laws, “control” is presumed when any person acquires or holds, directly or indirectly, 10% or more of our common stock or of the voting securities of any of our insurance company subsidiaries. To obtain approval, the proposed acquiror must file an application with the relevant regulator. For more information on the risks associated with holding company insurance regulations, see “Item 1A – Risk Factors – General Risk Factors  – \nApplicable laws and our certificate of incorporation and by-laws may discourage takeovers and business combinations that some stockholders might consider to be in their best interests.\n”\nU.S. Insurance Regulation \nWe are subject to the insurance holding company laws in the states and territories where our insurance companies are domiciled. These laws generally require insurance companies within the insurance holding company system to register with the insurance departments of their respective states and territories of domicile and furnish reports to such insurance departments regarding capital structure, ownership, financial condition, risk management, corporate governance, general business operations and intercompany transactions. These laws also require that transactions between affiliated companies be fair and equitable. In addition, certain intercompany transactions, changes of control, certain dividend payments and certain transfers of assets between the companies within the holding company system are subject to prior notice to, or approval by, regulatory authorities in such states and territories.\nWe are licensed to sell insurance through our insurance subsidiaries in all 50 states, Puerto Rico and the District of Columbia. Like all U.S. insurance companies, our insurance subsidiaries are subject to regulation and supervision in the jurisdictions where they do business. In general, these regulations are designed to protect the interests of policyholders, and not necessarily the interests of shareholders and other investors. To that end, the laws of the various jurisdictions establish insurance departments with broad powers with respect to such things as:\n•\nlicensing; \n•\ncapital, surplus and dividends;  \n•\nunderwriting requirements and limitations (including, in some cases, minimum or target loss ratios); \n•\nentrance into and exit from markets;\n•\nintroduction, cancellation and termination of certain coverages; \n•\nstatutory accounting and annual statement disclosure requirements; \n•\nproduct types, policy forms and mandated insurance benefits; \n•\npremium rates; \n•\nfines, penalties and assessments; \n•\nclaims practices, including occasional regulatory requirements to pay claims on terms other than those mandated by underlying policy contracts; \n•\ntransactions between affiliates; \n•\nthe form and content of disclosures to consumers; \n•\nthe type, amounts and valuation of investments; \n•\nannual tests of solvency and reserve adequacy; \n•\nassessments or other surcharges for guaranty funds and the recovery of assessments through premium increases; and \n \n•\nmarket conduct and sales practices of insurers and agents.\n14\nRisk-Based Capital Requirements.\n In order to enhance the regulation of insurer solvency, the National Association of Insurance Commissioners (the “NAIC”) has established certain risk-based capital (“RBC”) standards applicable to life, health and property and casualty insurers. RBC, which regulators use to assess the sufficiency of an insurer’s statutory capital, is calculated by applying factors to various asset, premium, expense, liability and reserve items. Factors are higher for items that the NAIC views as having greater underlying risk. The NAIC periodically reviews the RBC formula and changes to the formula could occur in the future. \nInvestment Regulation.\n Insurance company investments must comply with applicable laws and regulations that govern the kind, quality and concentration of investments made by insurance companies. These regulations require diversification of insurance company investment portfolios and limit the amount of investments in certain asset categories.\nProducts and Coverage.\n Insurance regulators have broad authority to regulate many aspects of our products and services. Additionally, certain non-insurance products and services we offer, such as service contracts, may be regulated by regulatory bodies other than departments of insurance and may be subject to consumer protection laws.\nPricing and Premium Rates.\n Nearly all states and territories have insurance laws requiring insurers to file price schedules and policy forms with the state’s or territory’s regulatory authority. In many cases, these price schedules and/or policy forms must be approved prior to use, and state and territory insurance departments have the power to disapprove increases or require decreases in the premium rates we charge.\nMarket Conduct Regulation.\n Activities of insurers are highly regulated by state and territory insurance laws and regulations, that govern the form and content of disclosure to consumers, advertising, sales practices and complaint handling. State and territory regulatory authorities enforce compliance through periodic market conduct examinations.\n Guaranty Associations and Indemnity Funds.\n Most states and territories require insurance companies to support guaranty associations or indemnity funds, which are established to pay claims on behalf of insolvent insurance companies. These associations may levy assessments on member insurers. In some states and territories, member insurers can recover a portion of these assessments through premium tax offsets and/or policyholder surcharges.\nInsurance Regulatory Initiatives.\n The NAIC, state and territory regulators and professional organizations have considered and are considering various proposals that may alter or increase state and territory authority to regulate insurance companies and insurance holding companies. For example, in 2021, the NAIC adopted the NAIC Real Property Lender-Placed Insurance Model Act (the “LPI Model Act”). The LPI Model Act governs the insurance that a mortgage servicer obtains when a borrower fails to obtain or maintain required insurance. Several states have enacted legislation that mirrors the LPI Model Act. See “Item 1A – Risk Factors – Legal and Regulatory Risks – \nChanges in insurance regulation may reduce our profitability and limit our growth\n” for a discussion of the risks related to such initiatives.\nFederal Regulation \nAlthough our business in the United States is primarily regulated by the states, federal initiatives often have an impact on our business in a variety of ways. Impacted areas include financial services regulation, privacy, tort reform legislation and taxation. In addition, various forms of direct and indirect federal regulation of insurance have been proposed from time to time, including proposals for the establishment of an optional federal charter for insurance companies.  See “Item 1A – Risk Factors – Legal and Regulatory Risks – \nOur business is subject to risks related to litigation and regulatory actions.”\nEmployee Retirement Income Security Act.\n We are subject to regulation under the Employee Retirement Income Security Act of 1974, as amended (“ERISA”). ERISA places certain requirements on how we may administer employee benefit plans covered by ERISA. Among other things, regulations under ERISA set standards for certain notice and disclosure requirements and for claim processing and appeals.\nGramm-Leach-Bliley Act.\n Certain of our activities are subject to the privacy requirements of the Gramm-Leach-Bliley Act, which, along with regulations adopted thereunder, generally requires insurers to provide customers with notice regarding how their nonpublic personal financial information is used and the opportunity to “opt out” of certain disclosures, if applicable.\nDodd-Frank Wall Street Reform and Consumer Protection Act\n. Regulations under the Dodd-Frank Wall Street Reform and Consumer Protection Act (the “Dodd-Frank Act”) address mortgage servicers’ obligations to correct errors asserted by mortgage loan borrowers; provide certain information requested by such borrowers; and provide protections to such borrowers in connection with lender-placed insurance. These requirements affect our operations because, in many instances, we administer such operations on behalf of our mortgage servicer clients. While the Consumer Financial Protection Bureau (the “CFPB”) does not have direct jurisdiction over insurance products, it is possible that additional regulations promulgated by the CFPB may extend its authority more broadly to cover these products and others we offer and thereby affect us or our clients. In addition, the Dodd-Frank Act created the Federal Insurance Office (“FIO”) within the U.S. Department of the Treasury (“U.S. Treasury”). While the FIO does not have general supervisory or regulatory authority over the business of insurance, the FIO director performs various functions with respect to insurance, including monitoring the insurance sector and representing the \n15\nU.S. on prudential aspects of international insurance matters, including at the International Association of Insurance Supervisors (“IAIS”). Additional regulations or new requirements may emerge from the activities of these regulatory entities.\nTax Reform\n. The Company is evaluating the impact of recent and upcoming changes in U.S. tax laws. The Corporate Alternative Minimum Tax, enacted as part of the Inflation Reduction Act of 2022, creates a 15% corporate alternative minimum tax (“CAMT”) on certain large “applicable corporations” and an excise tax of 1% on stock repurchases by publicly traded U.S. corporations, both effective after December 31, 2022. The excise tax on common stock repurchases is classified as an additional cost of the stock acquired included in treasury stock in shareholders' equity. The Company has determined that it is not considered an “applicable corporation” under the rules of CAMT.\nThe Organization for Economic Cooperation and Development has released Pillar Two Model Rules, a 15% minimum effective tax rate designed to ensure that large multinational enterprises pay a minimum level of tax on the income arising in each jurisdiction where they operate and mandates sharing of certain company information with taxing authorities on a local and global basis. Certain jurisdictions have enacted, and others have proposed, legislation to implement certain provisions of Pillar Two. We are continuing to monitor the implications resulting from the potential enactment of Pillar Two rules in the jurisdictions where we operate, and do not currently anticipate a material impact. For more information, see “Item 1A – Risk Factors – Legal and Regulatory Risks – \nChanges in tax laws and regulations could have a material adverse impact on our results of operations and financial condition.” \nInternational Regulation \nWe are subject to regulation and supervision of our international operations in various jurisdictions. These regulations, which vary depending on the jurisdiction, include, among others, anti-corruption laws; solvency and market conduct regulations; various privacy, insurance, tax, tariff and trade laws and regulations; and corporate, employment, intellectual property and investment laws and regulations. We operate in various jurisdictions, including Canada, the U.K., France, Argentina, Australia, Brazil, Chile, Peru, Colombia, Germany, India, the Netherlands, New Zealand, Puerto Rico, Spain, Italy, Mexico, Japan, South Korea, Hong Kong and Singapore, and, in several of these jurisdictions, our businesses are supervised by local regulatory authorities. In fourth quarter 2023, we made the decision to fully exit our operations in mainland China (other than Hong Kong), which were subsequently sold in 2024. See Note 5\n \nto the Consolidated Financial Statements included elsewhere in this Report\n \nfor more information. \nIn the past few years, the IAIS developed a model common framework for the supervision of Internationally Active Insurance Groups (“IAIGs”), which includes group-wide supervisory oversight across national boundaries and the establishment of ongoing supervisory colleges (“ComFrame”). ComFrame applies to entities that meet the IAIS’s criteria for IAIGs and that are so designated by their group-wide supervisor. The NAIC previously adopted changes to the Model Insurance Holding Company System Regulatory Act to allow state insurance regulators in the U.S. to be designated as group-wide supervisors for U.S.-based IAIGs. While we do not currently meet the criteria for IAIG designation, we are monitoring developments of reforms adopted by the IAIS as they influence NAIC activities, including those related to risk and group capital oversight. \nSecurities and Corporate Governance Regulation \n \nAs a company with publicly-traded securities, we are subject to certain legal and regulatory requirements applicable generally to public companies, including the rules and regulations of the U.S. Securities and Exchange Commission (the “SEC”) and the New York Stock Exchange (the “NYSE”) relating to public reporting and disclosure, accounting and financial reporting, corporate governance and other matters. One of our subsidiaries is a broker-dealer that is registered with the SEC and with the state securities commissions in all 50 states, and it is a member of the Financial Industry Regulatory Authority. Additionally, we and our subsidiaries are subject to the corporate governance laws of our respective jurisdictions of incorporation or formation. \nConsumer Protection Laws\nNumerous federal, state and international consumer protection laws affect the Company. For example, as part of the Dodd-Frank Act, Congress established the CFPB to supervise and regulate institutions that provide certain financial products and services to consumers. Although the consumer financial services subject to the CFPB’s jurisdiction generally exclude insurance businesses, the CFPB may take the position that it has the authority to regulate certain non-insurance consumer services we provide. In addition, new or amended international regulations relating to fair value and fair treatment relating to products and services for consumers are being further considered or proposed, depending on the jurisdiction. \n \nAnti-Corruption Regulation\nWe are subject to certain U.S. and foreign laws applicable to businesses generally, including anti-corruption laws. The Foreign Corrupt Practices Act of 1977 (the “FCPA”) regulates U.S. companies in their dealings with foreign officials and prohibits bribes and similar practices. In addition, the U.K. Anti-Bribery Act has wide applicability to certain activities that \n16\naffect U.K. companies, their commercial activities in the U.K., and potentially that of their affiliates located outside of the U.K. Anti-bribery and corruption laws and regulations continue to be implemented and/or enhanced across most of the jurisdictions in which we operate.\nCybersecurity, Privacy Regulation and Artificial Intelligence\nWe are subject to a variety of laws and regulations in the U.S. and abroad regarding privacy, data protection and data security. These laws and regulations are continuously evolving and developing. Since the enactment of EU General Data Protection Regulation (“GDPR”), multiple countries where we conduct business have or are in the process of enacting comprehensive data protection laws that largely model GDPR. In the United States, we are subject to a variety of federal and state privacy and data security laws and regulations. At the state level, the NAIC Insurance Data Security Model Law has been enacted in multiple states, imposing an array of detailed security measures, reporting and attestation requirements on insurance companies. The accelerated rate of adoption poses challenges for businesses as implementation and compliance may necessitate modifications to businesses processes, technological infrastructure, security measures and customer-facing websites. \nCybersecurity risks and incidents remain a focus for regulators. For example, in July 2023, the SEC adopted new rules for public companies requiring disclosure of material cybersecurity incidents and periodic disclosures regarding cybersecurity risk management, strategy and governance. Furthermore, in November 2023, the New York Department of Financial Services (the “NYDFS”) finalized amendments to its cybersecurity rule applicable to financial institutions licensed by the NYDFS.\nIn addition, we are monitoring increased regulatory activity related to artificial intelligence, including machine learning tools. For example, the NAIC has adopted a model bulletin, \nThe Use of Artificial Intelligence Systems by Insurers, \nto inform and articulate general expectations on how insurers will govern the development, acquisition and use of certain artificial intelligence technologies.  Approximately 20 states have adopted the bulletin with additional adoption expected in 2025, and several other states, such as Colorado, New York and California have adopted their own AI regulations or guidance specific for the insurance industry. Internationally, on August 1, 2024, the European Union Artificial Intelligence Act, the first comprehensive legal framework for the regulation of artificial intelligence systems across the EU, went into force, with enforcement beginning in 2026.  \nClimate-Related Regulation \nWe are subject to various federal, state, and international regulations regarding climate risk disclosure. In March 2024, the SEC adopted new rules for disclosing climate-related risks, Scope 1 and Scope 2 GHG emissions, and climate-related financial metrics. However, these rules were stayed in April 2024 due to ongoing federal litigation in the US Court of Appeals for the Eighth Circuit, leaving their implementation uncertain. \n     Furthermore, our European subsidiaries will be required to comply with the European Union’s Corporate Sustainability Directive (“CSRD”), and our U.S. operations may be subject to a series of climate-related disclosures in California. Proposals to delay compliance deadlines failed to pass during the state’s recently concluded legislative session and as a result, in-scope companies will be required to report under those laws as early as 2026 (unless pending legal challenges succeed). \nOther Regulation \nAs we continue to grow and evolve our business mix to cover other non-insurance-based products and services, we have and will continue to become subject to other legal and regulatory requirements, including regulations of the CFPB and other federal, state and municipal regulatory bodies, as well as additional regulatory bodies in non-U.S. jurisdictions. Examples include U.S. and local customs and trade regulations for the movement of mobile devices across geographic borders; health, safety, labor and environmental regulations, including those impacting our mobile supply chain operations; U.S. and international laws and regulations broadly relating to the performance, transparency and reporting of environmental, social and governance matters, including the SEC’s proposed rules to enhance climate-related disclosures; U.S. and international laws and regulations relating to the use of artificial intelligence; and antitrust and competition-related laws and regulations that may impact future transactions or business practices.\nGlobal Risk Management\nGovernance\nWe employ a risk governance structure, overseen by our Board and senior management and led by the Global Risk Management function, to provide a common framework for (i) evaluating the risks embedded in and across our businesses and functional areas, (ii) developing risk appetites, (iii) managing these risks, and (iv) identifying current and future risk challenges and opportunities. \nGlobal risk management is the responsibility of the Chief Marketing and Risk Officer (“CMRO”), who leads the Global Risk Management function.  The CMRO reports directly to the CEO, reports at least quarterly to the Finance and Risk Committee of the Board and reports at least annually to the Board. Our Enterprise Risk Management Policy, which outlines our risk management framework and establishes principles for its effectiveness, has been approved by the Board.  It is reviewed \n17\nannually to align with the Company’s business operations and strategy, as well as changes to applicable laws, regulations and industry standards. \nOur risk management framework cascades downwards into the enterprise through various management risk committees. Our risk governance structure is headed by the Enterprise Risk Committee, comprised of the CEO, the Chief Financial Officer, the CMRO, other members of the Management Committee, as well as the Treasurer, the Chief Internal Auditor, and the Global Ethics and Compliance Officer.\n \nThe Enterprise Risk Committee reviews the Company’s key enterprise risks, sets and monitors risk appetite, and oversees mitigation and remediation plans.\nBoard of Directors and Committee Oversight\nThe Board, directly and through its committees as described in their charters, oversees our risk management policies and practices, including our risk appetite, and discusses risk-related issues at least quarterly. The Board reviews management’s assessment of the Company’s key enterprise risks and receives a corresponding risk management update\n \nannually and management’s strategy with respect to each risk. \nThe Nominating and Corporate Governance Committee coordinates Board and committee oversight of the key enterprise risks. The Board and its committees receive updates from management on specific risks throughout the year, and each committee chair reports significant risk updates at least quarterly to the full Board so that the Board has the benefit of each committee’s specific areas of risk oversight. \nThe Audit Committee reviews the Company’s policies with respect to risk assessment and risk management and coordinates with the Finance and Risk Committee with respect to Board oversight of risk management and global risk management activities. The Audit Committee also focuses on risks relating to financial statements, internal control over financial reporting, disclosures, and compliance with legal and regulatory requirements. The Audit Committee receives reports at least quarterly from the Chief Internal Auditor and the Global Ethics and Compliance Officer.\nThe Finance and Risk Committee has primary oversight responsibility for the Global Risk Management function and corresponding risk activities.  It receives risk management reports at least quarterly from the CMRO that include the identification, assessment, reporting, and mitigation of existing and emerging key enterprise risks. The Finance and Risk Committee also focuses on risks relating to investments, capital management, and catastrophe reinsurance. \nThe Compensation and Talent Committee focuses on risks relating to management succession, talent management and compensation plan design. The Nominating and Corporate Governance Committee focuses on risks relating to director succession and has ultimate oversight responsibility for how we manage sustainability. \nThe Information Technology Committee is responsible for oversight of information technology risk assessment and risk management.\n \nThis includes oversight of cybersecurity policies, controls, and procedures, such as procedures to identify and assess internal and external cybersecurity risks. The Information Technology Committee receives updates from management, including the Chief Information Security Officer, on internal and external cybersecurity risks at least quarterly. \nIn fulfilling its responsibilities, the Board and each committee have the authority to retain external advisors. We believe that the Board’s leadership structure supports the risk oversight function of the Board and its committees, with the Chair of the Board and the CEO uniquely positioned to identify emerging risks while the Board’s five committees provide independent oversight of our risk management program within their purview.\nManagement Oversight\nGlobal Risk Management develops risk assessment and risk management policies, and facilitates the identification and assessment, monitoring and reporting, and mitigation of risks. The Company uses the three lines of defense operating model to provide structure around risk management and internal controls. \nThe first line of defense is comprised of the business and functional areas that are responsible for the daily management of Company’s business operations and related risks. The second line of defense provides independent oversight of risk-taking activities in the first line and is comprised of the Company’s Global Risk Management and Compliance functions.\n \nThe second line of defense assists in determining the risk appetite, strategies, policies, and structure for managing risk, including strategic and business risk, financial risk, and operational risk. The third line of defense is comprised of the Internal Audit function and is independently governed by the Audit Committee. Internal Audit evaluates the effectiveness and adequacy of the Company’s control environment and other components of our governance system, including compliance with policies, procedures, and processes established in the first and second lines, and assesses the design and ongoing effectiveness of risk management and the risk management framework.\nRisk Appetite, Identification and Assessment, Monitoring and Reporting, and Mitigation\n \n \n18\nRisk appetite defines the levels, types, and amount of risk that the Company is willing to accept in the pursuit of its business and strategic objectives, consistent with prudent management of risk concomitant with available levels of capital. Global Risk Management, in conjunction with various risk committees, develops recommendations for risk limits as part of our risk appetite framework.\n \nUsing metrics as appropriate in establishing these risk limits allows for a cohesive assessment of risk, resources, and strategy, and supports management and the Board in making well-informed business decisions. \nRisk identification and assessment are performed by Global Risk Management and conducted in coordination with the second and third lines of defense. Risks are classified using an enterprise-wide risk taxonomy.  Risk reporting provides tracking of each risk.  Risk identification and assessment process feeds into reporting and serves to escalate any elevated or emerging risks for review and action.  Risk reporting also includes reporting on the progress of key initiatives and risk mitigation activities.  Risk mitigation includes determining a course of action and monitoring progress against remediation.\n \nAvailable Information \nOur Annual Reports on Form 10-K, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K and all amendments to such reports filed or furnished pursuant to Section 13(a) or 15(d) of the Securities Exchange Act of 1934, as amended (the “Exchange Act”), as well as the Statements of Beneficial Ownership of Securities on Forms 3, 4 and 5 for our directors and officers, are available free of charge through the SEC website at \nwww.sec.gov\n.\n We make our periodic reports and other information filed with or furnished to the SEC available, free of charge, through the Investor Relations page of our website (\nwww.assurant.com\n) as soon as reasonably practicable after they are electronically filed with or furnished to the SEC. \nWe use our website (\nwww.assurant.com\n) and social media accounts, including X (formerly Twitter) (\n@Assurant\n), LinkedIn (\n@Assurant\n) and Facebook (\n@Assurant\n), as a means of disclosing information about us and our services and for complying with our disclosure obligations under the SEC’s Regulation FD (Fair Disclosure). The information we post on our website and social media accounts may be deemed material. Accordingly, investors should monitor our website and social media accounts in addition to following our press releases, SEC filings, and public conference calls and webcasts. Except as specifically noted, the information found on our website and social media accounts are not incorporated by reference into, and do not constitute a part of, this Report or any other report filed with or furnished to the SEC.",
  "item7": "Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations. \nThe following discussion and analysis of our financial condition and results of operations should be read in conjunction with our Consolidated Financial Statements and accompanying notes included elsewhere in this Report. It contains forward-looking statements that involve risks and uncertainties. Our actual results might differ materially from those projected in these forward-looking statements as a result of various factors, including those discussed below and elsewhere in this Report, particularly under the headings “Item 1A – Risk Factors” and “Forward-Looking Statements.” \nGeneral \nSegment Information\nAs of December 31, 2024, we had two reportable operating segments which are defined based on the manner in which the Company’s chief operating decision maker, our CEO, reviews the business to assess performance and allocate resources, and which align to the nature of the products and services offered: \n•\nGlobal Lifestyle: includes mobile device solutions (including extended service contracts, insurance policies and related services), extended service contracts and related services for consumer electronics and appliances, and financial services and other insurance products (referred to as “Connected Living”); and vehicle protection services, commercial equipment services and other related services (referred to as “Global Automotive”); and\n•\nGlobal Housing: includes lender-placed homeowners, manufactured housing and flood insurance, as well as voluntary manufactured housing, condominium and homeowners insurance (referred to as “Homeowners”); and renters insurance and other products (referred to as “Renters and Other”).\nIn addition, we report the Corporate and Other segment, which includes corporate employee-related expenses and activities of the holding company. \nWe define Adjusted EBITDA, our segment measure of profitability, as net income excluding net realized gains (losses) on investments and fair value changes to equity securities, non-core operations (which consists of certain businesses which we have fully exited or expect to fully exit, including the long-tail commercial liability businesses (sharing economy and small commercial businesses), certain legacy long-duration insurance policies and our operations in mainland China (not Hong Kong)), restructuring costs related to strategic exit activities (outside of normal periodic restructuring and cost management activities), Assurant Health runoff operations, interest expense, provision (benefit) for income taxes, depreciation expense, amortization of purchased intangible assets, as well as other highly variable or unusual items. In 2024, mainland China operations were sold.\nThe following discussion covers the year ended December 31, 2024 (“Twelve Months 2024”) and the year ended December 31, 2023 (“Twelve Months 2023”). Please see the discussion that follows, for each of these segments, for a more detailed comparative analysis. Our comparative analysis of Twelve Months 2023 and the year ended December 31, 2022 is included under the heading “Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations” in our Annual Report on Form 10-K for the fiscal year ended December 31, 2023 filed with the SEC on February 15, 2024.\n45\nExecutive Summary\nSummary of Financial Results\nConsolidated net income \nincreased $117.7 million, or 18%, to $760.2 million for Twelve Months 2024 from $642.5 million for Twelve Months 2023, primarily due to higher Global Housing segment earnings, lower impact of foreign exchange, and lower losses from non-core operations and lower restructuring costs, partially offset by higher reportable catastrophes and higher depreciation expense.\nGlobal Lifestyle Adjusted EBITDA\n decreased $18.9 million, or 2%, to $773.4 million for Twelve Months 2024 from $792.3 million for Twelve Months 2023, primarily driven by elevated claims costs in Global Automotive and approximately $25.0 million of investments in new client programs and capabilities in Connected Living to support future growth. This decrease was partially offset by a modest increase in Connected Living primarily due to increased contributions in Global Financial Services, higher investment income and improved results within extended service contracts.\nGlobal Lifestyle net earned premiums, fees and other income\n increased $405.9 million, or 5%, to $8.97 billion for the Twelve Months 2024 from $8.56 billion for Twelve Months 2023, primarily due to contributions from newly launched trade-in programs and device protection programs.\nGlobal Housing Adjusted EBITDA\n increased $97.0 million, or 17%, to $671.2 million for Twelve Months 2024 from $574.2 million for Twelve Months 2023, primarily driven by growth in Homeowners, partially offset by $134.2 million of higher pre-tax reportable catastrophes. Excluding reportable catastrophes, Adjusted EBITDA increased 34% due to top-line growth and expense leverage within Homeowners, more favorable prior year reserve development, lower reinsurance costs, and growth in Renters from the property management channel.\nGlobal Housing net earned premiums, fees and other income\n increased $314.1 million, or 15%, to $2.46 billion for Twelve Months 2024 from $2.14 billion for Twelve Months 2023, primarily due to Homeowners top-line growth, including growth in policies in-force and higher average premiums within lender-placed, as well as growth across various specialty Homeowners products.\nCorporate and Other Adjusted EBITDA\n was $(122.2) million for Twelve Months 2024 compared to $(109.0) million for Twelve Months 2023, primarily driven by higher third-party and employee-related expenses.\nIn addition, the California Wildfires began in January 2025, causing significant damage throughout the Los Angeles metropolitan area and surrounding regions. At the time of this filing, the claims process continues and our current view is that reportable catastrophes from the California Wildfires are expected to approach or slightly exceed our catastrophe reinsurance program per event retention of $150 million.\n \nThere is inherent variability in our estimates of early loss projections and claims severity, and therefore the estimate may change as additional information emerges.\nCritical Factors Affecting Results \nOur results depend on, among other things, the appropriateness of our product pricing, underwriting, the accuracy of our reserving methodology for future policyholder benefits and claims, the frequency and severity of reportable and non-reportable catastrophes, returns on and values of invested assets, our investment income, and our ability to realize greater operational efficiencies and manage our expenses. Our results also depend on our ability to profitably grow our businesses, including our Connected Living, Global Automotive and Renters businesses, and the performance of our Homeowners business. Factors affecting these items, including conditions in the financial markets, the global economy, political conditions and the markets in which we operate, fluctuations in exchange rates, interest rates and inflation, including the current period of inflationary pressures which have impacted claims costs including in the Global Automotive business, and tariffs and global supply chain disruptions may have a material adverse effect on our results of operations or financial condition. For more information on these and other factors that could affect our results, see “Item 1A – Risk Factors.”\n \nOur results may also be impacted by our ability to continue to grow in the markets in which we operate, which will be impacted by our ability to provide a superior customer experience, including from our investments in technology and digital initiatives, capitalize on the connected home opportunity and investments to onboard and ramp-up new business. Our mobile business is subject to volatility in mobile device trade-in volumes and margins based on the actual and anticipated timing of the release of new devices, carrier promotional programs and sales prices for used devices, as well as to changes in consumer preferences. Our Homeowners revenue is impacted by changes in the housing market, as well as the voluntary insurance market. In addition, across many of our businesses, we must respond to competitive pressures, including the threat of disruption and competition for talent, which has increased due to labor shortages and wage inflation. See “Item 1A – Risk Factors – Business, Strategic and Operational Risks – \nSignificant competitive pressures, changes in customer preferences and disruption could adversely affect our results of operations,\n” “ – \nOur mobile business is subject to the risk of declines in the value and availability of mobile devices, and to regulatory compliance and other risks\n” and “ – \nThe success of our business depends on \n46\nthe execution of our strategy, including through the continuing service of key executives, senior leaders, highly-skilled personnel and a high-performing workforce.”\nFor Twelve Months 2024, net cash provided by operating activities was $1.33 billion; net cash used in investing activities was $657.8 million; and net cash used in financing activities was $477.5 million. We had $1.81 billion in cash and cash equivalents as of December 31, 2024. Please see “ – Liquidity and Capital Resources” below for further details.\nRevenues\n \nWe generate revenues primarily from the sale of our insurance policies, service contracts and related products and services, and from income earned on our investments. Sales of insurance policies are recognized in revenue as earned premiums while sales of administrative services are recognized as fee income.\n \nOur premium and fee income is supplemented by income earned from our investment portfolio. We recognize revenue from interest payments, dividends, change in market value of equity securities and sales of investments. Currently, our investment portfolio is primarily invested in fixed maturity securities. Both investment income and changes in market value on these investments can be significantly affected by changes in interest rates.\n \nInterest rate volatility can increase or reduce unrealized gains or losses in our investment portfolios. Interest rates are highly sensitive to many factors, including governmental monetary policies, domestic and international economic and political conditions, inflation and other factors beyond our control. Fluctuations in interest rates affect our returns on, and the market value of, fixed maturity and short-term investments.\n \nThe fair market value of the fixed maturity securities in our investment portfolio and the investment income from these securities fluctuate depending on general economic and market conditions. The fair market value generally increases or decreases in an inverse relationship with fluctuations in interest rates, while net investment income realized by us from future investments in fixed maturity securities generally increases or decreases with fluctuations in interest rates. We also have investments that are subject to pre-payment risk, such as mortgage-backed and asset-backed securities. Interest rate fluctuations may cause actual net investment income and/or timing of cash flows from such investments to differ from estimates made at the time of investment. In periods of declining interest rates, mortgage prepayments generally increase and mortgage-backed securities, commercial mortgage obligations and bonds are more likely to be prepaid or redeemed as borrowers seek to borrow at lower interest rates. Therefore, in these circumstances we may be required to reinvest those funds in lower interest-earning investments. \nPlease see “Item 7A – Quantitative and Qualitative Disclosures About Market Risk” below for further details. \nExpenses \nOur expenses are primarily policyholder benefits, underwriting, selling, general and administrative expenses and interest expense.\n \nPolicyholder benefits are affected by our claims management programs, reinsurance coverage, contractual terms and conditions, regulatory requirements, economic conditions including inflation, and numerous other factors. Benefits paid or reserves required for future benefits could substantially exceed our expectations, causing a material adverse effect on our business, results of operations and financial condition.\n \nUnderwriting, selling, general and administrative expenses consist primarily of commissions, premium taxes, licenses, fees, amortization of deferred costs, general operating expenses and income taxes.\n \nIn addition to the restructuring plan announced in December 2022 and amended in 2023, we continue to undertake various expense savings initiatives while also making investments in talent, capabilities and technology, among other things, which will impact our expenses.\nWe also incur interest expense related to our debt.\n \nCritical Accounting Policies and Estimates\nCertain items in our Consolidated Financial Statements are based on estimates and judgment. Differences between actual results and these estimates and judgments could in some cases have material impacts on our Consolidated Financial Statements.\n \nThe following critical accounting policies require significant estimates and judgment:\n•\nReserves, Net of Reinsurance \n•\nValuation of Investments\n•\nValuation and Recoverability of Goodwill\nReserves, Net of Reinsurance \nReserves are established using generally accepted actuarial methods and reflect significant judgment and estimates about expected future claim payments. Factors used in their calculation include experience derived from historical claim payments \n47\nand actuarial assumptions. Calculations incorporate assumptions about the incidence of incurred claims, the extent to which all claims have been reported, reporting lags, expenses, inflation rates, future investment earnings, internal claims processing costs and other relevant factors. While the methods of making such estimates and establishing the related liabilities are periodically reviewed and updated, the estimation of reserves includes an element of uncertainty given that management is using historical information and methods to project future events and reserve outcomes.\n \nThe recorded reserves represent our best estimate at a point in time of the ultimate costs of settlement and administration of a claim or group of claims, based upon actuarial assumptions and projections using facts and circumstances known at the time of calculation. The adequacy of reserves may be impacted by future trends in claims severity, frequency, judicial theories of liability and other factors. These variables are affected by both external and internal events, including: changes in the economic cycle, inflation, changes in repair costs, natural or human-made catastrophes, judicial trends, legislative changes and claims handling procedures.\nMany of these items are not directly quantifiable and not all future events can be anticipated when reserves are established. Reserve estimates are refined as experience develops. Adjustments to reserves, both positive and negative, are reflected in the consolidated statement of operations in the period in which such estimates are updated.\n \nBecause establishment of reserves is an inherently complex process involving significant judgment and estimates, there can be no certainty that future settlement amounts for claims incurred through the financial reporting date will not vary from reported claims reserves. Future loss development could require reserves to be increased or decreased, which could have a material effect on our earnings in the periods in which such increases or decreases are made. However, based on information currently available, we believe our reserve estimates are adequate. See “Item 1A – Risk Factors – Financial Risks – \nOur actual claims losses may exceed our reserves for claims, requiring us to establish additional reserves or to incur additional expense for settling unreserved liabilities, which could have a material adverse effect on our results of operations, profitability and capital\n” and “ – Financial Risks – \nActual results may differ materially from the analytical models we use to assist in our decision-making in key areas such as pricing, catastrophe risks, reserving and capital management” \nfor more detail on this risk. \nReinsurance Recoverables\nWe utilize reinsurance for loss protection and capital management, business dispositions and client risk and profit sharing. Reinsurance premiums paid are amortized as reductions to premium over the terms of the underlying reinsured policies. Amounts recoverable from reinsurers are estimated in a manner consistent with claim and claim adjustment expense reserves or future policy benefits reserves. Reinsurance recoverables include amounts we are owed by reinsurers for claims paid as well as those included in reserve estimates that are subject to the reinsurance. \nWe use a probability of default and loss given default methodology in estimating an expected credit loss allowance, whereby the credit ratings of reinsurers are used in determining the probability of default. The allowance is established for reinsurance recoverables on paid and unpaid future policy benefits and claims and benefits. Prior to applying default factors, the net exposure to credit risk is reduced for any collateral for which the right of offset exists, such as funds withheld, assets held in trust and letters of credit, which are part of the reinsurance arrangements, with adjustments to include consideration of credit exposure on the collateral. Our methodology incorporates historical default factors for each reinsurer based on their credit rating using comparably rated bonds as published by a major ratings service. The allowance is based upon our ongoing review of amounts outstanding, length of collection periods, changes in reinsurer credit standing and other relevant factors. \nIn the ordinary course of business, we are involved in both the assumption and cession of reinsurance with non-affiliated companies. The following table provides details of the reinsurance recoverables balance as of December 31, 2024 and 2023:\n2024\n2023\nCeded future policyholder benefits and expense\n$\n340.7 \n$\n339.9 \nCeded unearned premium\n5,188.5 \n5,265.2 \nCeded claims and benefits payable\n1,808.9 \n971.4 \nCeded paid losses\n241.4 \n72.7 \nTotal\n$\n7,579.5 \n$\n6,649.2 \nFor additional information regarding our reserves and reinsurance recoverables, see Notes 2, 4, 16 and 17 to the Consolidated Financial Statements included elsewhere in this Report.\nShort Duration Contracts\n \nClaims and benefits payable reserves for short duration contracts include (1) case reserves for known claims which are unpaid as of the balance sheet date; (2) IBNR reserves for claims where the insured event has occurred but has not been \n48\nreported to us as of the balance sheet date; and (3) loss adjustment expense reserves for the expected handling costs of settling the claims. Periodically, we review emerging experience and make adjustments to our reserves and assumptions where necessary. \nUltimate loss and loss adjustment expenses are estimated utilizing generally accepted actuarial loss reserving methods. Both paid claims development as well as case incurred development are typically analyzed at the product or product grouping level, considering product size and data credibility. The reserving methods widely employed by us include the Chain Ladder, Munich Chain Ladder and Bornhuetter-Ferguson methods. For Global Housing, reportable catastrophes are analyzed and reserved for separately using a frequency and severity approach. \nThe methods all involve aggregating paid and case-incurred loss data by accident quarter (or accident year) and accident age for each product grouping. As the data ages, development factors are calculated that measure emerging claim development patterns between reporting periods. By selecting loss development factors indicative of remaining development, known losses are projected to an ultimate incurred basis for each accident period. The underlying premise of the Chain Ladder method is that future claims development is best estimated using past claims development, whereas the Bornhuetter-Ferguson method employs a combination of past claims development and estimates of ultimate losses based on an expected loss ratio. The Munich Chain Ladder method incorporates the correlations between paid and incurred development in projecting future development factors, and is typically more applicable to products experiencing variability in incurred to paid ratios. \nEach of these methods applied to the data groupings produces an estimate of the loss reserves for the product grouping. The best estimate is generally selected from a blend of the different methods. The determination of the best estimate is based on many factors, including:\n  \n•\nthe nature and extent of the underlying assumptions;\n•\nthe quality and applicability of historical data - whether internal or industry data;\n•\ncurrent and expected future economic and market conditions;\n•\nregulatory, legislative, and judicial considerations;\n•\nthe extent of data segmentation - data should be homogeneous yet credible enough for loss development methods to apply;\n•\ntrends in loss frequency and severity for various causes of loss;\n•\nconsideration of the distribution of loss reserves, management’s selection of the best estimate that may exceed an estimate based on median values, suggesting that favorable development may be more likely than unfavorable development; and \n•\nhindsight testing of prior loss estimates - the loss estimates on some product lines will vary from actual loss experience more than others.\nWhen employing the reserving methods, consideration is given to contractual requirements, historical utilization trends and payment patterns, coverage changes, seasonality, product mix, the legislative and regulatory environment, economic factors, natural catastrophes and other relevant factors. We consistently apply reserving principles and methodologies from year to year, while also giving due consideration to the potential variability of these factors. \nWhile management has used judgment in establishing its best estimate of required reserves, different assumptions and variables could lead to significantly different reserve estimates. Two key measures of loss activity are loss frequency, which is a measure of the number of claims per unit of insured exposure, and loss severity, which is a measure of the average size of claims. Factors affecting loss frequency include the effectiveness of loss controls, changes in economic activity and weather patterns. Factors affecting loss severity include changes in policy limits, retentions, rate of inflation and judicial interpretations.\n \nIf the actual level of loss frequency and severity are higher or lower than expected, the ultimate reserves required will be different than management’s estimate. The effect of higher and lower levels of loss frequency and severity on our ultimate costs for claims occurring in 2024 would be as follows:\n49\nChange in both loss frequency and severity for all Global Lifestyle and Global Housing\nUltimate cost of claims occurring in 2024\nChange in cost of claims occurring in 2024\n3% higher\n$\n2,765.8 \n$\n158.8 \n2% higher\n$\n2,712.3 \n$\n105.3 \n1% higher\n$\n2,659.4 \n$\n52.4 \nBase scenario (1)\n$\n2,607.0 \n$\n— \n1% lower\n$\n2,555.1 \n$\n(51.9)\n2% lower\n$\n2,503.8 \n$\n(103.2)\n3% lower\n$\n2,452.9 \n$\n(154.1)\n(1)\nRepresents the sum of the case reserves and incurred but not reported reserves as of December 31, 2024 for Global Lifestyle and Global Housing.\nNon-Core Operations\nShort duration contracts in non-core operations primarily consist of the sharing economy and small commercial products previously reported within Global Housing. While the contracts are classified as short duration, the coverages were predominantly commercial liability and have a long reporting and settlement tail compared to property coverages which make up most of our core operations. \nThe reserving methodology described for other short duration contacts is applicable for non-core operations. Given the nature of commercial liability coverages and its relatively long claim runoff duration, additional emphasis is placed on elevated loss activity from increasing attorney involvement and analysis of individual case reserve adequacy on known claims. This is done through use of average cost per claim methods that include an allowance for future inflation impacts, detailed open claim inventory analysis, and leveraging industry development patterns to supplement our own historical claims experience.\nLong Duration Contracts, including Disposed and Runoff Long Duration Lines\nReserves for future policy benefits represent the present value of future benefits to policyholders and related expenses less the present value of future net premiums. Reserve assumptions reflect best estimates for expected investment yield, inflation, mortality, morbidity, expenses and withdrawal rates. These assumptions are based on our experience to the extent it is credible, modified where appropriate to reflect current trends, industry experience and provisions for possible unfavorable deviation. We also record an unearned revenue reserve which represents premiums received which have not yet been recognized in our consolidated statements of operations. \nRisks related to the reserves recorded for certain discontinued individual life, annuity and long-term care insurance policies have been fully ceded via reinsurance. While we have not been released from our contractual obligation to the policyholders, changes in and deviations from economic, mortality, morbidity, and withdrawal assumptions used in the calculation of these reserves will not directly affect our results of operations unless there is a default by the assuming reinsurer. \nValuation of Investments\nIn determining the estimated fair value of our investments, fair values are primarily based on unadjusted quoted prices for identical investments in active markets that are readily and regularly obtainable. When such unadjusted quoted prices are not available, estimated fair values are based on quoted prices for identical or similar investments in markets that are not active, or other observable inputs. If these observable inputs are not available, or observable inputs are not determinable, unobservable inputs or adjustments to observable inputs requiring management judgment are used to determine the estimated fair value of investments. The methodologies, assumptions and inputs utilized are described in Note 9 to the Consolidated Financial Statements.\nFinancial markets are susceptible to severe events evidenced by rapid depreciation in asset values accompanied by a reduction in asset liquidity. Our ability to sell investments and the price ultimately realized for investments depends upon the demand and liquidity in the market.\nSee also Notes 2, 7 and 9 to the Consolidated Financial Statements included elsewhere in this Report, “Item 1A – Risk Factors – Financial Risks – \nOur investment portfolio is subject to credit, liquidity and other risks that may adversely affect our results of operations and financial condition\n” and “ – Investments” contained in this Item 7. \nValuation and Recoverability of Goodwill\nOur goodwill related to acquisitions of businesses was $2.62 billion and $2.61 billion as of December 31, 2024 and 2023, respectively. We review our goodwill annually in the fourth quarter for impairment, or more frequently if indicators of impairment exist. Such indicators include: a significant adverse change in legal factors, an adverse action or assessment by a regulator, unanticipated competition, loss of key personnel or a significant decline in our expected future cash flows due to \n50\nchanges in company-specific factors or the broader business climate. The evaluation of such factors requires considerable management judgment. Any adverse change in these factors could have a significant impact on the recoverability of goodwill and could have a material impact on our Consolidated Financial Statements. \nGoodwill is tested for impairment at the reporting unit level, which is either at the operating segment or one level below, if that component is a business for which discrete financial information is available and segment management regularly reviews such information. Components within an operating segment can be aggregated into one reporting unit if they have similar economic characteristics. A goodwill impairment loss is measured as the excess of the carrying value, including goodwill, of the reporting unit over its fair value. An impairment loss is limited to the amount of goodwill allocated to the reporting unit. \nOur Global Lifestyle operating segment is disaggregated into two reporting units: Connected Living and Global Automotive. Our reporting unit for goodwill testing was at the same level as the operating segment for Global Housing. \nThe following table illustrates the amount of goodwill carried by operating segment as of the dates indicated:\n \nDecember 31,\n \n2024\n2023\nGlobal Lifestyle (1)\n$\n2,299.3 \n$\n2,292.1 \nGlobal Housing\n316.7 \n316.7 \nTotal\n$\n2,616.0 \n$\n2,608.8 \n(1)\nAs of December 31, 2024, $793.6 million and $1,505.7 million of goodwill was assigned to the Connected Living and Global Automotive reporting units, respectively. As of December 31, 2023, $785.2 million and $1,506.9 million of goodwill was assigned to the Connected Living (including Global Financial Services which was aggregated with Connected Living in 2023) and Global Automotive reporting units, respectively. \nQualitative Impairment Testing\nFor the annual October 1, 2024 goodwill impairment test, we performed a qualitative assessment for all reporting units with goodwill (Connected Living, Global Automotive and Global Housing) due to high margins between fair value and book value based on quantitative impairment testing in 2023. \nBased on this assessment, the Company determined that it was more likely than not that the reporting units’ fair values were more than their respective book values and therefore quantitative impairment testing was not necessary for Connected Living, Global Automotive and Global Housing as of October 1, 2024.\nShould the operating results of these reporting units decline substantially compared to projected results, or changes to macroeconomic conditions having a potential impact of substantially reducing future profitability of the reporting units, we could determine that we need to perform an updated impairment test due to the potential impairment indicators, which may require the recognition of a goodwill impairment loss in any of the reporting units.\nRefer to Note 14 to the Consolidated Financial Statements included elsewhere in this Report for further detail.\nRecent Accounting Pronouncements\nPlease see Note 2 to the Consolidated Financial Statements included elsewhere in this Report. \n51\nResults of Operations\nAssurant Consolidated\nThe table below presents information regarding our consolidated results of operations:\n \nFor the Years Ended December 31,\n \n2024\n2023\nRevenues:\nNet earned premiums\n$\n9,795.8 \n$\n9,388.0 \nFees and other income\n1,638.6 \n1,323.2 \nNet investment income\n518.9 \n489.1 \nNet realized losses on investments and fair value changes to equity securities\n(75.8)\n(68.7)\nTotal revenues\n11,877.5 \n11,131.6 \nBenefits, losses and expenses:\nPolicyholder benefits\n2,766.5 \n2,521.8 \nUnderwriting, selling, general and administrative expenses\n8,076.7 \n7,695.1 \nInterest expense\n107.0 \n108.0 \nLoss on extinguishment of debt\n— \n(0.1)\nTotal benefits, losses and expenses\n10,950.2 \n10,324.8 \nIncome before provision for income taxes\n927.3 \n806.8 \nProvision for income taxes\n167.1 \n164.3 \nNet income\n$\n760.2 \n$\n642.5 \nYear Ended December 31, 2024 Compared to the Year Ended December 31, 2023\nNet Income \nConsolidated net income increased $117.7 million, or 18%, to $760.2 million for Twelve Months 2024 from $642.5 million for Twelve Months 2023, primarily driven by higher earnings in Global Housing, a $31.0 million favorable change in after-tax foreign exchange related gains (losses), a $32.2 million after-tax decline in losses related to our non-core operations and a $22.9 million reduction in after-tax restructuring costs related to our previously announced restructuring plan. The increase in net income was partially offset by $106.9 million increase in after-tax reportable catastrophes, higher after-tax depreciation expenses of $23.8 million, mainly due to higher software assets placed into service, and lower earnings from Global Lifestyle, mainly due to elevated claims in Global Automotive. \n52\nGlobal Lifestyle  \nThe table below presents information regarding the Global Lifestyle segment’s results of operations for the periods indicated:\n \nFor the Years Ended December 31,\n \n2024\n2023\nRevenues:\nNet earned premiums\n$\n7,506.0 \n$\n7,362.6 \nFees and other income\n1,461.3 \n1,198.8 \nNet investment income\n356.6 \n347.5 \nTotal revenues\n9,323.9 \n8,908.9 \nBenefits, losses and expenses:\nPolicyholder benefits\n1,738.6 \n1,607.9 \nSelling and underwriting expenses\n4,770.4 \n4,789.3 \nCost of sales\n841.6 \n564.2 \nGeneral expenses\n1,199.9 \n1,155.2 \nTotal benefits, losses and expenses\n8,550.5 \n8,116.6 \nGlobal Lifestyle Adjusted EBITDA\n$\n773.4 \n$\n792.3 \nNet earned premiums, fees and other income:\nConnected Living\n$\n4,807.9 \n$\n4,376.8 \nGlobal Automotive\n4,159.4 \n4,184.6 \nTotal\n$\n8,967.3 \n$\n8,561.4 \nNet earned premiums, fees and other income:\nDomestic \n$\n6,970.2 \n$\n6,739.5 \nInternational\n1,997.1 \n1,821.9 \nTotal\n$\n8,967.3 \n$\n8,561.4 \nYear Ended December 31, 2024 Compared to the Year Ended December 31, 2023\nAdjusted EBITDA\n decreased $18.9 million, or 2%, to $773.4 million for Twelve Months 2024 from $792.3 million for Twelve Months 2023, primarily due to elevated claims costs in Global Automotive, mainly from higher losses in select ancillary products, and from higher labor and parts costs due to inflation, higher expenses for investments in new client programs and capabilities in Connected Living, declines across mobile from trade-in programs due to the business mix and lower volumes and from mobile device protection from higher loss experience, and the unfavorable impact of foreign exchange. The decrease in Adjusted EBITDA was partially offset by higher net investment income across Global Lifestyle, as well as improved contributions from our financial services business and improved results within extended service contracts.\nTotal revenues \nincreased $415.0 million, or 5%, to $9.32 billion for Twelve Months 2024 from $8.91 billion for Twelve Months 2023. Fees and other income increased $262.5 million, or 22%, primarily due to contributions from newly launched global mobile trade-in programs. Net earned premiums increased $143.4 million, or 2%, primarily driven by growth from global mobile device protection programs and newly launched program within financial services in Connected Living, partially offset by a decline in extended service contracts in Connected Living and the unfavorable impact of foreign exchange. Net investment income increased $9.1 million, or 3%, primarily due to higher yields on cash, short-term investments and fixed maturity securities.\nTotal benefits, losses and expenses\n increased $433.9 million, or 5%, to $8.55 billion for Twelve Months 2024 from $8.12 billion for Twelve Months 2023. Cost of sales increased $277.4 million, or 49% mainly due to newly launched global mobile programs. Policyholder benefits increased $130.7 million, or 8%, primarily due to elevated claims costs in Global Automotive, as described above, and from higher claims in the global mobile device protection business and global financial services in Connected Living, partially offset by lower losses for extended service contracts in Connected Living in line with the decrease in net earned premiums. General expenses increased $44.7 million, or 4%, due to higher employee-related and information \n53\ntechnology expenses to support growth, as well as higher expenses relating to investments in new client programs and capabilities in Connected Living, as described above. Selling and underwriting expenses decreased $18.9 million, or 0.4% mainly due to lower commission expenses for extended service contracts in Connected Living and Global Automotive, partially offset by higher commissions from global mobile device protection programs.\n54\nGlobal Housing \nThe table below presents information regarding the Global Housing segment’s results of operations for the periods indicated:\n \nFor the Years Ended December 31,\n \n2024\n2023\nRevenues:\nNet earned premiums\n$\n2,281.0 \n$\n2,014.5 \nFees and other income\n176.0 \n128.4 \nNet investment income\n127.3 \n109.7 \nTotal revenues\n2,584.3 \n2,252.6 \nBenefits, losses and expenses:\nPolicyholder benefits\n1,010.2 \n862.0 \nSelling and underwriting expenses\n158.1 \n137.1 \nGeneral expenses\n744.8 \n679.3 \nTotal benefits, losses and expenses\n1,913.1 \n1,678.4 \nGlobal Housing Adjusted EBITDA\n$\n671.2 \n$\n574.2 \nImpact of reportable catastrophes\n$\n245.2 \n$\n111.0 \nNet earned premiums, fees and other income:\nHomeowners\n$\n1,958.9 \n$\n1,663.4 \nRenters and Other\n498.1 \n479.5 \nTotal\n$\n2,457.0 \n$\n2,142.9 \nYear Ended December 31, 2024 Compared to the Year Ended December 31, 2023  \nAdjusted EBITDA\n increased $97.0 million, or 17%, to $671.2 million for Twelve Months 2024 from $574.2 million for Twelve Months 2023, mainly due to continued growth from higher policies in-force, average insured values and premium rates within Homeowners and $52.6 million of favorable year-over-year net impact to non-catastrophe prior year reserve development. Twelve Months 2024 included $106.7 million of favorable non-catastrophe prior year reserve development compared to $54.1 million in Twelve Months 2023. The increase in Adjusted EBITDA was also driven by ongoing expense leverage from scale and operating efficiencies, lower reinsurance costs, higher net investment income and growth from Renters from the property management channel, partially offset by $134.2 million of higher reportable catastrophes and a previously disclosed $27.5 million non-run rate adjustment related to a change in earnings pattern assumptions. \nTotal revenues\n increased $331.7 million, or 15%, to $2.58 billion for Twelve Months 2024 from $2.25 billion for Twelve Months 2023. Net earned premiums increased $266.5 million, or 13%, primarily driven by Homeowners from higher lender-placed policies in-force, average insured values, higher premium rates and growth across various specialty products, partially offset by the non-run rate adjustment described above and exits from certain international markets. Fees and other income increased $47.6 million, or 37%, primarily driven by the reclassification of certain service fees from an expense account. Net investment income increased $17.6 million, or 16%, primarily due to higher yields and asset balances on fixed maturity securities, cash and cash equivalents and short-term investments. \nTotal benefits, losses and expenses\n increased $234.7 million, or 14%, to $1.91 billion for Twelve Months 2024 from $1.68 billion for Twelve Months 2023. Policyholder benefits increased $148.2 million, or 17%, primarily due to higher reportable catastrophe losses and non-catastrophe losses from exposure growth, partially offset by the favorable year-over-year non-catastrophe prior year reserve development. Selling and underwriting expenses increased $21.0 million, or 15%, primarily due to higher costs associated with growth. General expenses increased $65.5 million, or 10%, primarily due to higher costs associated with growth and the reclassification described above.\n55\nCorporate and Other\nThe table below presents information regarding the Corporate and Other segment’s results of operations for the periods indicated:\n \nFor the Years Ended December 31,\n \n2024\n2023\nRevenues:\nNet earned premiums\n$\n— \n$\n— \nFees and other income\n0.4 \n0.2 \nNet investment income\n27.2 \n21.4 \nTotal revenues\n27.6 \n21.6 \nBenefits, losses and expenses\nPolicyholder benefits\n— \n0.1 \nGeneral expenses\n149.8 \n130.5 \nTotal benefits, losses and expenses\n149.8 \n130.6 \nCorporate and Other Adjusted EBITDA\n$\n(122.2)\n$\n(109.0)\nYear Ended December 31, 2024 Compared to the Year Ended December 31, 2023\nAdjusted EBITDA\n was $(122.2) million for Twelve Months 2024 compared to $(109.0) million for Twelve Months 2023. The increase in the loss was primarily due to higher employee-related expenses and higher third-party consulting expenses to support enterprise growth initiatives, partially offset by higher net investment income from higher yields and asset balances for fixed maturity securities.\nTotal revenues\n increased $6.0 million, or 28%, to $27.6 million for Twelve Months 2024 from $21.6 million for Twelve Months 2023, primarily driven by an increase in net investment income of $5.8 million, or 27%, \nmostly due to higher yields and asset balances for fixed maturity securities.\nTotal benefits, losses and expenses\n increased $19.2 million, or 15%, to $149.8 million for Twelve Months 2024 from $130.6 million for Twelve Months 2023, primarily due to an increase in general expenses\n \nof $19.3 million, or 15%, primarily driven by higher employee-related expenses and higher third-party consulting expenses to support enterprise growth initiatives.\n56\nInvestments\n \nWe had total investments of $8.54 billion and $8.22 billion as of December 31, 2024 and 2023, respectively. Net unrealized losses on our fixed maturity securities portfolio decreased $30.6 million during Twelve Months 2024, from a $380.3 million unrealized loss at December 31, 2023 to a $349.7 million unrealized loss at December 31, 2024, primarily due to higher yields offset by spreads tightening.\nThe following table shows the credit quality of our fixed maturity securities portfolio as of the dates indicated:\n \nFair Value as of\nFixed Maturity Securities by Credit Quality\nDecember 31, 2024\nDecember 31, 2023\nAaa / Aa / A\n$\n3,987.5 \n55.6 \n%\n$\n3,958.7 \n57.3 \n%\nBaa\n2,699.7 \n37.6 \n%\n2,564.8 \n37.1 \n%\nBa\n415.7 \n5.8 \n%\n318.6 \n4.6 \n%\nB and lower\n72.2 \n1.0 \n%\n70.0 \n1.0 \n%\nTotal\n$\n7,175.1 \n100.0 \n%\n$\n6,912.1 \n100.0 \n%\nThe following table shows the major categories of net investment income for the periods indicated:\n \nYears Ended December 31,\n \n2024\n2023\nFixed maturity securities\n$\n385.9 \n$\n335.3 \nEquity securities\n13.2 \n15.2 \nCommercial mortgage loans on real estate\n19.2 \n17.5 \nShort-term investments\n18.4 \n12.9 \nOther investments\n21.3 \n39.1 \nCash and cash equivalents\n77.0 \n85.7 \nTotal investment income\n535.0 \n505.7 \nInvestment expenses\n(16.1)\n(16.6)\nNet investment income\n$\n518.9 \n$\n489.1 \nNet investment income increased $29.8 million, or 6%, to $518.9 million for Twelve Months 2024 from $489.1 million for Twelve Months 2023. The increase was primarily driven by higher yields and assets in fixed maturity securities and short term investments, partially offset by lower income in Other investments primarily driven by lower partnership income.\nNet realized losses on investments and fair value changes to equity securities were $75.8 million for Twelve Months 2024 compared to net realized losses on investments and fair value changes to equity securities of $68.7 million for Twelve Months 2023. The change in Twelve Months 2024 was primarily driven by sales of fixed maturity securities at a loss as well as impairments in the Assurant Ventures portfolio, partially offset by sales of equity securities at a gain as well as favorable market valuations in equity securities.   \nAs of December 31, 2024, we owned $16.5 million of securities guaranteed by financial guarantee insurance companies. Included in this amount was $15.2 million of municipal securities, whose credit rating was A+ with the guarantee, but would have had a rating of AA- without the guarantee. \nFor more information on our investments, see Notes 7\n \nand 9 to the Consolidated Financial Statements included elsewhere in this Report.  \nLiquidity and Capital Resources\n \nThe following section discusses our ability to generate cash flows from each of our subsidiaries, borrow funds at competitive rates and raise new capital to meet our operating and growth needs. Management believes that we will have sufficient liquidity to satisfy our needs over the next twelve months, including the ability to pay interest on our debt and dividends on our common stock.\nOn January 22, 2025, we entered into an agreement to sell our Miami, Florida property for a purchase price of $126.0 million, subject to the buyer receiving the requisite development approvals, which could take 18 to 24 months. If the transaction is consummated pursuant to the terms of the agreement, we expect to record a gain above the current carrying value of  $46.0 million as of December 31, 2024, less estimated costs to sell. We do not anticipate that any such gain will impact our capital deployment priorities. There can be no assurance that the transaction will be consummated.\n57\nRegulatory Requirements \nAssurant, Inc. is a holding company and, as such, has limited direct operations of its own. Our assets consist primarily of the capital stock of our subsidiaries. Accordingly, our future cash flows depend upon the availability of dividends and other statutorily permissible payments from our subsidiaries, such as payments under our tax allocation agreement and under management agreements with our subsidiaries. Our subsidiaries’ ability to pay such dividends and make such other payments is regulated by the states and territories in which our subsidiaries are domiciled. These dividend regulations vary from jurisdiction to jurisdiction and by type of insurance provided by the applicable subsidiary, but generally require our insurance subsidiaries to maintain minimum solvency requirements and limit the amount of dividends they can pay to the holding company. See “Item 1A – Risk Factors – Legal and Regulatory Risks – \nChanges in insurance regulation may reduce our profitability and limit our growth.\n” Along with solvency regulations, the primary driver in determining the amount of capital used for dividends from insurance subsidiaries is the level of capital needed to maintain desired financial strength ratings from A.M. Best. For the year ending December 31, 2025, the maximum amount of dividends our regulated U.S. domiciled insurance subsidiaries could pay us, under applicable laws and regulations without prior regulatory approval, is approximately $524.2 million. Our international and non-insurance subsidiaries provide additional sources of dividends. \nRegulators or rating agencies could become more conservative in their methodology and criteria, increasing capital requirements for our insurance subsidiaries or the enterprise. For further information on our ratings and the risks of ratings downgrades, see “Item 1 – Business – Ratings” and “Item 1A – Risk Factors – Financial Risks – \nA decline in the financial strength ratings of our insurance subsidiaries could adversely affect our results of operations and financial condition.\n”\nHolding Company\nAs of December 31, 2024, we had approximately $673.0 million in holding company liquidity, $448.0 million above our targeted minimum level of $225.0 million. The target minimum level of holding company liquidity, which can be used for unforeseen capital needs at our subsidiaries or liquidity needs at the holding company, is calibrated based on approximately one year of pre-tax corporate operating losses and interest expenses. We use the term “holding company liquidity” to represent the portion of cash and other liquid marketable securities held at Assurant, Inc. (out of a total of $760.1 million as of December 31, 2024) which we are not otherwise holding for a specific purpose as of the balance sheet date. We can use such assets for stock repurchases, stockholder dividends, acquisitions and other corporate purposes. \nDividends or returns of capital paid by our subsidiaries, net of infusions of liquid assets and excluding amounts used for or as a result of acquisitions or received from dispositions, were $804.7 million and $772.6 million for Twelve Months 2024 and Twelve Months 2023, respectively. We use these cash inflows primarily to pay holding company operating expenses, to make interest payments on indebtedness, to make dividend payments to our common stockholders, to fund investments and acquisitions, and to repurchase our common stock.\n \nFrom time to time, we may also seek to purchase outstanding debt in open market repurchases or privately negotiated transactions.   \nDividends and Repurchases\nDuring Twelve Months 2024 and Twelve Months 2023, we made common stock repurchases and paid dividends to our common stockholders of $455.8 million and $352.3 million, respectively. \nOn January 16, 2025, the Board declared a quarterly dividend of $0.80 per common share payable on March 31, 2025 to stockholders of record as of February 3, 2025. We paid dividends of $0.80 per common share on December 30, 2024 to stockholders of record as of December 9, 2024. This represented a 11% increase to the quarterly dividend of $0.72 per common share paid on September 30, June 24, and March 25, 2024.\nAny determination to pay future dividends will be at the discretion of the Board and will be dependent upon various factors, including: our subsidiaries’ payments of dividends and other statutorily permissible payments to us; our results of operations and cash flows; our financial condition and capital requirements; general business conditions and growth prospects; any legal, tax, regulatory and contractual restrictions on the payment of dividends; and any other factors the Board deems relevant. The Credit Facility (as defined below) also contains limitations on our ability to pay dividends to our stockholders and repurchase capital stock if we are in default, or such dividend payments or repurchases would cause us to be in default, of our obligations thereunder. In addition, if we elect to defer the payment of interest on our 7.00% Fixed-to-Floating Rate Subordinated Notes due March 2048 or our 5.25% Subordinated Notes due January 2061 (refer to “— \nSenior and Subordinated Notes\n” below), we generally may not make payments on or repurchase any shares of our capital stock.\nDuring Twelve Months 2024, we repurchased 1,548,520 shares of our outstanding common stock at a cost of $299.9 million, exclusive of commissions. In November 2023, the Board authorized an additional share repurchase program for up to $600.0 million of our outstanding common stock. As of December 31, 2024, $374.5 million aggregate cost at purchase remained unused under the repurchase authorization. The timing and the amount of future repurchases will depend on various factors, including those listed above.\n58\nAssurant Subsidiaries\nThe primary sources of funds for our subsidiaries consist of premiums and fees collected, proceeds from the sales and maturity of investments and net investment income. Cash is primarily used to pay insurance claims, agent commissions, operating expenses and taxes. We generally invest our subsidiaries’ funds in order to generate investment income.\nWe conduct periodic asset liability studies to measure the duration of our insurance liabilities, to develop optimal asset portfolio maturity structures for our significant lines of business and ultimately to assess that cash flows are sufficient to meet the timing of cash needs. These studies are conducted in accordance with formal company-wide Asset Liability Management guidelines.\n \nTo complete a study for a particular line of business, models are developed to project asset and liability cash flows and balance sheet items under a varied set of plausible economic scenarios. These models consider many factors including the current investment portfolio, the required capital for the related assets and liabilities, our tax position and projected cash flows from both existing and projected new business. For risks related to modeling, see “Item 1A – Risk Factors – Financial Risks –\nActual results may differ materially from the analytical models we use to assist in our decision-making in key areas such as pricing, catastrophe risks, reserving and capital management.\n”\nAlternative asset portfolio asset allocations are analyzed for significant lines of business. An investment portfolio maturity structure is then selected from these profiles given our return hurdle and risk appetite. Scenario testing of significant liability assumptions and new business projections is also performed.   \nOur liabilities generally do not include policyholder optionality, which means that the timing of payments is generally insensitive to the interest rate environment. In addition, our investment portfolio is largely comprised of highly liquid public fixed maturity securities with a sufficient component of such securities invested that are near maturity which may be sold with minimal risk of loss to meet cash needs.\nGenerally, our subsidiaries’ premiums, fees and investment income, along with planned asset sales and maturities, provide sufficient cash to pay claims and expenses. However, there may be instances when unexpected cash needs arise in excess of that available from usual operating sources. In such instances, we have several options to raise needed funds, including selling assets from the subsidiaries’ investment portfolios, using holding company cash (if available), issuing commercial paper, or drawing funds from the Credit Facility.\nSenior and Subordinated Notes\n \nThe following table shows the principal amount and carrying value of our outstanding debt, less unamortized discount and issuance costs as applicable, as of December 31, 2024 and 2023:\nDecember 31, 2024\nDecember 31, 2023\nPrincipal Amount\nCarrying Value\nPrincipal Amount\nCarrying Value\n6.10% Senior Notes due February 2026\n$\n175.0 \n$\n174.3 \n$\n175.0 \n$\n173.7 \n4.90% Senior Notes due March 2028\n300.0 \n298.6 \n300.0 \n298.2 \n3.70% Senior Notes due February 2030\n350.0 \n348.2 \n350.0 \n347.9 \n2.65% Senior Notes due January 2032\n350.0 \n347.3 \n350.0 \n347.0 \n6.75% Senior Notes due February 2034\n275.0 \n272.8 \n275.0 \n272.7 \n7.00% Fixed-to-Floating Rate Subordinated Notes due March 2048\n400.0 \n397.7 \n400.0 \n397.0 \n5.25% Subordinated Notes due January 2061\n250.0 \n244.2 \n250.0 \n244.1 \nTotal Debt\n$\n2,083.1 \n$\n2,080.6 \nIn the next five years, we have two debt maturities in February 2026 and March 2028 when the 2026 Senior Notes and the 2028 Senior Notes, respectively, become due and payable. \nCredit Facility and Commercial Paper Program\nWe have a $500.0 million five-year senior unsecured revolving credit facility (the “Credit Facility”) with a syndicate of banks arranged by JPMorgan Chase Bank, N.A. and Wells Fargo Bank, National Association. The Credit Facility provides for revolving loans and the issuance of multi-bank, syndicated letters of credit and letters of credit from a sole issuing bank in an aggregate amount of $500.0 million, which may be increased up to $700.0 million. The Credit Facility is available until December 2026, provided we are in compliance with all covenants. The Credit Facility has a sublimit for letters of credit issued thereunder of $50.0 million. The proceeds from these loans may be used for our commercial paper program or for general corporate purposes. \n59\nWe made no borrowings using the Credit Facility during Twelve Months 2024 and no loans were outstanding as of December 31, 2024.\nOur commercial paper program requires us to maintain liquidity facilities either in an available amount equal to any outstanding notes from the program or in an amount sufficient to maintain the ratings assigned to the notes issued from the program. Our commercial paper is rated AMB-1+ by A.M. Best, P-2 by Moody’s and A-2 by S&P. Our subsidiaries do not maintain commercial paper or other borrowing facilities. This program is currently backed up by the Credit Facility, of which $500.0 million was available as of December 31, 2024. \nWe did not use the commercial paper program during Twelve Months 2024 and there were no amounts relating to the commercial paper program outstanding as of December 31, 2024.  \nFor additional information, see Note 18\n \nto the Consolidated Financial Statements included elsewhere in this Report.\nLetters of Credit \nLetters of credit are issued in the ordinary course of business. These letters of credit are supported by commitments under which we are required to indemnify the financial institution issuing the letter of credit if the letter of credit is drawn. We had $1.8 million and $2.9 million of letters of credit outstanding as of December 31, 2024 and 2023, respectively.\n \nLimited Recourse Note\nIn 2024, Assurant entered into a financing arrangement pursuant to which it is able to issue a $100 million limited recourse note and, in return, obtain a $100 million asset-backed note from a Delaware master trust.  As of December 31, 2024 no notes have been issued under this arrangement. \nCash Flows\nWe monitor cash flows at the consolidated, holding company and subsidiary levels. Cash flow forecasts at the consolidated and subsidiary levels are provided on a monthly basis, and we use trend and variance analyses to project future cash needs making adjustments to the forecasts when needed.\n \nThe table below shows our recent net cash flows for the periods indicated:\n \nFor the Years Ended December 31,\n \n2024\n2023\nNet cash provided by (used in):\nOperating activities\n$\n1,332.7 \n$\n1,138.1 \nInvesting activities\n(657.8)\n(637.7)\nFinancing activities\n(477.5)\n(403.9)\nEffect of exchange rate changes on cash and cash equivalents\n(17.1)\n(5.8)\nNet change in cash\n$\n180.3 \n$\n90.7 \nCash Flows for the Years Ended December 31, 2024 and 2023\nOperating Activities\n \nWe typically generate operating cash inflows from premiums collected from our insurance products, fees received for services and income received from our investments while outflows consist of policy acquisition costs, benefits paid and operating expenses. These net cash flows are then invested to support the obligations of our insurance products and required capital supporting these products. Our cash flows from operating activities are affected by the timing of premiums, fees, and investment income received and expenses paid.\nNet cash provided by operating activities was $1.33 billion and $1.14 billion for Twelve Months 2024 and Twelve Months 2023, respectively. The change in net operating cash flows was largely attributable to the timing of tax payments as we received a refund in 2024 related to prior year tax returns as compared to payments in 2023. Also contributing to the change were lower profit share payments to our clients in domestic automotive due to higher losses from inflation. This was partially offset by higher net paid claims and an increase in employee incentive-based payments largely based on the performance of the Company.\nInvesting Activities\n \nNet cash used in investing activities was $657.8 million and $637.7 million for Twelve Months 2024 and Twelve Months 2023, respectively. The change in net investing cash flows was primarily driven by the increased investment of net cash \n60\nprovided by operating activities and reinvestment of proceeds from the sale of fixed maturity securities during the period. Also contributing to the change was a decrease in sales of short-term investments due to the timing of working capital needs.\nFinancing Activities\n \nNet cash used in financing activities was $477.5 million and $403.9 million for Twelve Months 2024 and Twelve Months 2023, respectively. The change in net financing cash flows was primarily due to higher share repurchases for Twelve Months 2024 and the issuance of the 2026 Senior Notes during Twelve Months 2023, partially offset by the redemption of our 4.20% 2023 Senior Notes during Twelve Month 2023. For additional information on our debt, see Note 18 to the Consolidated Financial Statements included elsewhere in this Report.\nThe table below shows our cash outflows for taxes, interest and dividends for the periods indicated:\n \nFor the Years Ended December 31,\n \n2024\n2023\n2022\nIncome taxes paid\n$\n(38.9)\n$\n235.4 \n$\n127.7 \nInterest paid on debt\n107.4 \n107.4 \n108.6 \nCommon stock dividends\n155.9 \n152.3 \n150.2 \nTotal\n$\n224.4 \n$\n495.1 \n$\n386.5 \nContractual Obligations and Commitments \nWe have contractual obligations and commitments to third parties as a result of our operations, as detailed in the table below by maturity date as of December 31, 2024:\n \n \nAs of December 31, 2024\n \nTotal\nLess than 1\nYear\n1-3\nYears\n3-5\nYears\nMore than 5\nYears\nContractual obligations\n:\nInsurance liabilities (1)\n$\n2,809.1 \n$\n2,138.9 \n$\n534.2 \n$\n80.3 \n$\n55.7 \nDebt and related interest\n3,592.0 \n107.3 \n369.2 \n467.6 \n2,647.9 \nOperating leases\n71.7 \n17.7 \n28.8 \n18.1 \n7.1 \nPension obligations and postretirement benefits (2)\n459.6 \n49.7 \n98.1 \n96.2 \n215.6 \nCommitments:\nInvestment purchases outstanding:\nCommercial mortgage loans on real estate\n6.4 \n6.4 \n— \n— \n— \nCapital contributions to non-consolidated VIEs\n239.2 \n239.2 \n— \n— \n— \nLiability for unrecognized tax benefits\n20.4 \n— \n16.9 \n— \n3.5 \nTotal obligations and commitments\n$\n7,198.4 \n$\n2,559.2 \n$\n1,047.2 \n$\n662.2 \n$\n2,929.8 \n(1)\nInsurance liabilities reflect undiscounted estimated cash payments to be made to policyholders, net of expected future premium cash receipts on in-force policies and excluding fully reinsured runoff operations. The total gross reserve for fully reinsured runoff operations that was excluded was $642.1 million which, if the reinsurers defaulted, would be payable over a 30+ year period with the majority of the payments occurring after 5 years. Additional information on the reinsurance arrangements can be found in Note 17 to the Consolidated Financial Statements included elsewhere in this Report. These liabilities also do not include recoverable amounts related to certain high deductible policies in our sharing economy business, included in our non-core operations, for which we are responsible for paying the entirety of the claim and are subsequently reimbursed by the insured for the deductible portion of the claim. As of December 31, 2024, we had exposure to $168.2 million of reserves below the deductible that we would be responsible for if the clients were to default on their contractual obligation to pay us the deductible. See Note 4 to the Consolidated Financial Statements included elsewhere in this Report for more information on our evaluation of the credit risk exposure from these recoverables. As a result, the amounts presented in this table do not agree to the future policy benefits and expenses and claims and benefits payable in the consolidated balance sheets.\n(2)\nOur pension obligations and postretirement benefits include an Assurant Pension Plan, various non-qualified pension plans (including an Executive Pension Plan) and certain life and health care benefits for retired employees and their dependents (“Retirement Health Benefits”), all of which were frozen in 2016. In February 2020, we amended the Retirement Health Benefits to terminate such plan benefits to retirees effective December 31, 2024. Due to the Assurant Pension Plan’s current overfunded status, no contributions were made during 2024 and none are expected to be made in 2025. See Note 23 to the Consolidated Financial Statements included elsewhere in this Report for more information.\n61\nLiabilities for future policy benefits and expenses have been included in the commitments and contingencies table. Significant uncertainties relating to these liabilities include mortality, morbidity, expenses, persistency, investment returns, inflation, contract terms and the timing of payments.",
  "item2": null
}