{
  "source_file": "akam-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2.  \nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\nThis quarterly report on Form 10-Q, particularly Management’s Discussion and Analysis of Financial Condition and Results of Operations set forth below, and notes to our unaudited interim condensed consolidated financial statements included herein contain “forward-looking statements” within the meaning of the Private Securities Litigation Reform Act of 1995. All statements other than statements of historical facts are statements that could be deemed forward-looking statements. These statements are subject to risks and uncertainties and are based on the beliefs and assumptions of our management as of the date hereof based on information currently available to our management. Use of words such as “believes,” “could,” “expects,” “anticipates,” “intends,” “plans,” “seeks,” “projects,” “estimates,” “should,” “would,” “forecasts,” “if,” “continues,” “goal,” “likely,” “may,” “will,” variations of such words or similar expressions are intended to identify a forward-looking statement. Forward-looking statements are not guarantees of future performance and involve risks, uncertainties and assumptions. Actual results may differ materially from the forward-looking statements we make as a result of various factors, including, but not limited to: potential slowing revenue growth, global economic and geopolitical conditions, including changes in customer spending and inflation, international tensions, changes in governmental policies including trade-related policies, volatility in capital markets, our ability to acquire or develop new products or solutions, our ability to compete effectively, including our ability to continue to grow our cloud computing services and solutions, security risks stemming from ineffective information technology systems or cybersecurity breaches, risks of maintaining global operations, regulatory developments, including changes in regulatory policy or resources, intellectual property claims or disputes, investment related risks and maintaining an effective system of internal controls. See “Risk Factors” elsewhere in this quarterly report on Form 10-Q and in our other reports with the Securities and Exchange Commission for a discussion of certain risks associated with our business. We disclaim any obligation to update forward-looking statements as a result of new information, future events or otherwise, including the potential impact of any mergers, acquisitions, divestitures or other events that may be announced after the date hereof.\n26\nTable of Contents\nOur management’s discussion and analysis of our financial condition and results of operations is based upon our unaudited interim condensed consolidated financial statements included elsewhere in this quarterly report on Form 10-Q, which we have prepared in accordance with accounting principles generally accepted in the United States of America (\"GAAP\"), for interim periods and with Regulation S-X promulgated under the Securities Exchange Act of 1934, as amended (the \"Exchange Act\"). The preparation of these unaudited interim condensed consolidated financial statements requires us to make estimates and judgments that affect the reported amounts of assets, liabilities, revenues and expenses and related items, including, but not limited to, revenue recognition, accounts receivable and related reserves, valuation and impairment of marketable securities, goodwill and acquired intangible assets, capitalized internal-use software development costs, impairment and useful lives of long-lived assets, income taxes and stock-based compensation. We base our estimates and judgments on historical experience and on various other assumptions that we believe to be reasonable under the circumstances at the time they are made. Actual results may differ from our estimates. See the section entitled “Application of Critical Accounting Policies and Estimates” in our annual report on Form 10-K for the year ended December 31, 2024 for further discussion of our critical accounting policies and estimates.\nOverview\nWe develop and provide solutions for global enterprises to build, secure and accelerate their applications and digital experiences through our massively distributed global network, which underpins our security, delivery and cloud computing solutions, and is central to our financial success. The key factors that influence our financial success are our ability to build on recurring revenue commitments across our security, delivery and compute product portfolios, increase traffic on our network, continue to develop, scale and successfully bring to market our compute platform and compute-to-edge solutions that meet the needs of professional users and enterprises, including with respect to reliability, effectively manage the prices we charge for our solutions, continuously develop new and existing products and appropriately manage our capital spending and other operational expenses. The purpose of this discussion and analysis section is to provide material information relevant to an assessment of our financial condition and results of operations from management’s perspective, including to describe and explain key trends, events and other factors that impacted our reported results and that are likely to impact our future performance.\nRevenue\nWe primarily derive revenue from the sale of services to customers pursuant to contracts having terms of one year or longer, which allows us to have a consistent and predictable base level of revenue. Services included in our contracts consist of security solutions, the delivery of content, applications and software over the internet, cloud computing solutions and professional services. In addition to a base level of revenue, we are also dependent on our ability to increase our product offerings and to cross-sell additional services to our new and existing customers, particularly for our security and cloud computing solutions portfolios. Our revenue is also impacted by customer renewals and the pricing for such renewals, the rate of adoption and timing of customer offerings, variability of one-time events, usage of cloud computing services and the amount of traffic we serve on our network. Geopolitical, economic and other developments that impact our customers' businesses can also impact our ability to attract new customers or continue to cross-sell additional services to existing customers and traffic levels for customers with variable usage. Over the longer term, our ability to continually develop and expand our product portfolio, to successfully bring those products to market and to effectively manage the prices we charge for our solutions are key factors impacting our revenue growth.\nWe have observed the following trends related to our revenue in recent years:\n•\nIncreased sales of our security solutions, led by application security solutions and Guardicore segmentation solutions, and increased sales of our cloud computing solutions, attributable to enhanced services on our compute platform and growth in our cloud infrastructure services, have made a significant contribution to revenue growth. Our security and cloud computing solutions continue to contribute to a large portion of revenue. We plan to continue to invest in these areas with a focus on higher growth security products and cloud infrastructure services to further advance our product portfolios and sales capabilities.\n•\nTraffic growth on our network has improved, but remains moderated as compared to prior years. We, and the industry more broadly, are seeing growth at a slower pace than we have experienced in the past. In particular, customers in verticals such as media and gaming have optimized their traffic to manage through underlying business challenges at a time of global macroeconomic and geopolitical headwinds. Some of our customers' businesses have been impacted by these headwinds, and as a result, they may continue to reduce their spending or optimize their traffic, which would reduce traffic on our network and revenue. However, we are seeing incremental traffic from contracts acquired as part of our recent asset acquisitions. We expect these traffic growth trends to continue for the remainder of 2025.\n27\nTable of Contents\n•\nThe prices paid by some of our delivery and security customers have declined in recent years at contract renewal due to competition, which negatively impacts our revenue growth rates. We have been able to mitigate some of the negative impacts to our revenue growth rates by upselling incremental solutions to our existing customers. We continue to take steps upon contract renewals to sign customers to multi-year contracts and to optimize how we charge certain high-volume traffic customers to maintain alignment between customer traffic volumes and unit pricing.\n•\nRevenue from our international operations continues to grow, particularly from new customer acquisition and cross-selling of incremental solutions. Because we publicly report in U.S. dollars, our reported revenue results are negatively impacted when the U.S. dollar strengthens and benefit when the U.S. dollar weakens.\n•\nWe have experienced variations in certain types of revenue from quarter-to-quarter. These quarterly variations in revenue are attributable to, among other things, the timing of large customer contract renewals; the frequency and timing of purchases of custom solutions or licensed software; the nature and timing of software and gaming releases by our customers; holiday season activity; and whether there are large live sporting or other events or situations that impact the amount of media traffic on our network.\nExpenses\nOur level of profitability is impacted by our expenses, including direct costs to support our revenue such as bandwidth and co-location costs, which includes energy to power our network. We have observed the following trends related to our profitability in recent years:\n•\nCo-location costs are a significant portion of our cost of revenue. As we continue to build out our new compute locations to provide us with the ability to scale our platform, we have entered into, and expect to continue to enter into, longer term leases that include certain financial commitments in order to achieve more favorable unit economics. The costs of the financial commitments are expensed ratably over the lease term, and, as a result, in some cases, we are incurring costs in advance of these compute locations being fully utilized. We continue to improve our internal-use software and remain disciplined in managing our hardware deployments, which enables us to use servers more efficiently. We will need to continue to effectively manage our co-location costs to maintain or improve current levels of profitability.\n•\nNetwork bandwidth costs are also a significant portion of our cost of revenue. We have been able to manage these costs through investment in internal-use software development to improve the performance and efficiency of our network and, more recently, improved pricing on contract renewals with our bandwidth providers. We will need to continue to focus on effectively managing our bandwidth costs to maintain or improve current levels of profitability.\n•\nNetwork build-out and supporting service costs represent another significant portion of our cost of revenue. These costs include maintenance and supporting services, as well as partner program costs, incurred as we continue to build out our compute platform and maintain our global network, and costs of third-party cloud providers used for some of our operations. We have seen some of these costs increase in recent years as a result of our network expansion, and particularly the build out of our compute platform. While we have previously experienced increased costs from third-party cloud providers, we have been able to reduce those costs by migrating to our own compute solutions and working to optimize any remaining spend with these third-party cloud providers. We will need to continue to effectively manage our network build-out and supporting service costs and continue to migrate third-party cloud services to our compute platform in an effort to manage costs.\n•\nOur employees are core to the operations of our business, and payroll and related costs, including stock-based compensation, is our largest expense. It is important to the success of our operations that we offer competitive compensation packages. However, we are focused on remaining disciplined in allocating our resources to support our faster growing security and cloud computing solutions, including maintaining operational efficiencies to mitigate the rising cost of talent. Over the past few years, we redesigned one of our non-executive short-term incentive compensation programs by shifting certain employees from a cash-based to stock-based program and introduced a non-executive incentive program tied to key initiatives. These programs are designed to better align employee incentives with the interests of our stockholders, which has increased our stock-based compensation. \n•\nDepreciation expense related to our network equipment also contributes to our overall expense levels. In recent years, we have invested in our network, particularly as part of building out our compute infrastructure, which increased our \n28\nTable of Contents\ncapital expenditures and resulting depreciation expense. We are also experiencing an increase in certain server component costs that support the continued build out of our compute platform. We plan to continue to make investments in capital expenditures and focus investments on our faster growing cloud computing solutions, including support for a new enterprise cloud computing customer and our new Akamai Inference Cloud (\"AIC\").\n•\nGrowth in our international operations incrementally increases our exposure to foreign currency fluctuations. Because we publicly report in U.S. dollars, our expenses are positively impacted when the U.S. dollar strengthens and are negatively impacted when the U.S. dollar weakens.\nMacroeconomic Conditions\nGlobal macroeconomic and geopolitical conditions continue to impact our customers, as well as our business and revenue growth rates. We, along with our customers, continue to manage through an uncertain period of fluctuating inflation, regulatory policies and resources that may negatively impact business, economic and political uncertainty, decreased consumer confidence and pressure on prices during contract renewals, uncertain energy supplies, heightened geopolitical tensions and conflict, potential for supply chain disruptions, changes in legislation and regulations, including U.S. and international tax laws, volatility and increasing tensions related to changing trade policies, including announced or expected tariffs, fluctuations in foreign exchange rates and elevated interest rates. To the extent these macroeconomic conditions continue, the impact may adversely affect our business, operations and financial results.\nResults of Operations\nThe following sets forth, as a percentage of revenue, interim condensed consolidated statements of income data for the periods indicated:\n \nFor the Three Months\nEnded September 30,\nFor the Nine Months \nEnded September 30,\n \n2025\n2024\n2025\n2024\nRevenue\n100 \n%\n100 \n%\n100 \n%\n100 \n%\nCosts and operating expenses:\nCost of revenue (exclusive of amortization of acquired intangible assets shown below)\n41 \n41 \n41 \n41 \nResearch and development\n12 \n12 \n12 \n12 \nSales and marketing\n14 \n14 \n14 \n14 \nGeneral and administrative\n15 \n16 \n15 \n16 \nAmortization of acquired intangible assets\n3 \n2 \n3 \n2 \nRestructuring (benefit) charge\n— \n8 \n— \n3 \nTotal costs and operating expenses\n (1)\n84 \n93 \n85 \n87 \nIncome from operations\n (1)\n16 \n7 \n15 \n13 \nInterest and marketable securities income, net\n2 \n2 \n2 \n3 \nInterest expense\n(1)\n(1)\n(1)\n(1)\nOther expense, net\n— \n(1)\n— \n— \nIncome before provision for income taxes\n (1)\n16 \n7 \n16 \n14 \nProvision for income taxes\n(3)\n(2)\n(4)\n(2)\nNet income\n (1)\n13 \n%\n6 \n%\n12 \n%\n12 \n%\n(1)  Amounts may not foot due to rounding.\n29\nTable of Contents\nRevenue\nRevenue by solution category during the periods presented was as follows (in thousands):\nFor the Three Months\nEnded September 30,\nFor the Nine Months \nEnded September 30,\n2025\n2024\n% Change\n% Change at Constant Currency\n2025\n2024\n% Change\n% Change at Constant Currency\nSecurity\n$\n568,437 \n$\n518,670 \n10 \n%\n9 \n%\n$\n1,651,046 \n$\n1,508,059 \n9 \n%\n9 \n%\nDelivery\n306,495 \n319,132 \n(4)\n(4)\n945,608 \n1,000,289 \n(5)\n(5)\nCloud computing\n179,698 \n166,877 \n8 \n7 \n516,609 \n462,881 \n12 \n12 \nTotal revenue\n$\n1,054,630 \n$\n1,004,679 \n5 \n%\n4 \n%\n$\n3,113,263 \n$\n2,971,229 \n5 \n%\n5 \n%\nDuring the three and nine months ended September 30, 2025, the increase in our revenue, as compared to the same periods in 2024, was primarily the result of continued growth in sales of our security and cloud computing solutions, partially offset by a decline in revenue from our delivery solutions due to downward pricing of contract renewals.\nThe increase in security solutions revenue for the three and nine months ended September 30, 2025, as compared to the same periods in 2024, was due to growth in sales of key products in our security solutions portfolio, including our API security, web application and Guardicore segmentation solutions.\nThe decrease in delivery solutions revenue for the three and nine months ended September 30, 2025, as compared to the same periods in 2024, was due to downward pricing of contract renewals which we believe is moderating compared to recent periods. Additionally, we believe macroeconomic headwinds are causing some customers to increase their focus on cost optimization, which reduced traffic on our network and delivery revenue. These decreases were partially offset by incremental revenue from contracts acquired as part of our recent asset acquisitions, such as Edgio, Inc.\nThe increase in cloud computing solutions revenue for the three and nine months ended September 30, 2025, as compared to the same periods in 2024, was due to growth in cloud infrastructure services, which includes our compute and storage solutions based on Linode, as well as our EdgeWorkers product and the partner solutions running on our cloud platform.\nRevenue derived in the U.S. and internationally during the periods presented was as follows (in thousands):\nFor the Three Months\nEnded September 30,\nFor the Nine Months \nEnded September 30,\n2025\n2024\n% Change\n% Change at Constant Currency\n2025\n2024\n% Change\n% Change at Constant Currency\nU.S.\n$\n529,978 \n$\n524,611 \n1 \n%\n1 \n%\n$\n1,586,324 \n$\n1,545,654 \n3 \n%\n3 \n%\nAs a percentage of revenue\n50 \n%\n52 \n%\n51 \n%\n52 \n%\nInternational\n524,652 \n480,068 \n9 \n8 \n1,526,939 \n1,425,575 \n7 \n7 \nAs a percentage of revenue\n50 \n%\n48 \n%\n49 \n%\n48 \n%\nTotal revenue\n$\n1,054,630 \n$\n1,004,679 \n5 \n%\n4 \n%\n$\n3,113,263 \n$\n2,971,229 \n5 \n%\n5 \n%\nFor the three and nine months ended September 30, 2025 and 2024, no single country outside the U.S. accounted for 10% or more of revenue during these periods. Changes in foreign currency exchange rates favorably impacted our revenue by $7.9 million and $2.0 million during the three and nine months ended September 30, 2025, respectively, as compared to the same periods in 2024.\n30\nTable of Contents\nCost of Revenue\nCost of revenue consisted of the following for the periods presented (in thousands):\n \nFor the Three Months\nEnded September 30,\nFor the Nine Months \nEnded September 30,\n \n2025\n2024\n% Change\n2025\n2024\n% Change\nCo-location fees\n$\n86,763 \n$\n79,074 \n10 \n%\n$\n257,713 \n$\n227,070 \n13 \n%\nBandwidth fees\n46,693 \n55,653 \n(16)\n140,163 \n178,084 \n(21)\nNetwork build-out and supporting services\n59,524 \n48,236 \n23 \n171,821 \n140,573 \n22 \nPayroll and related costs\n84,855 \n84,417 \n1 \n254,223 \n251,054 \n1 \nStock-based compensation, including amortization of prior capitalized amounts\n31,368 \n26,811 \n17 \n92,237 \n74,196 \n24 \nDepreciation of network equipment\n82,245 \n72,546 \n13 \n242,394 \n207,157 \n17 \nAmortization of internal-use software\n38,084 \n42,069 \n(9)\n116,461 \n128,303 \n(9)\nTotal cost of revenue\n$\n429,532 \n$\n408,806 \n5 \n%\n$\n1,275,012 \n$\n1,206,437 \n6 \n%\nAs a percentage of revenue\n41 \n%\n41 \n%\n41 \n%\n41 \n%\nThe increase in cost of revenue for the three and nine months ended September 30, 2025, as compared to the same periods in 2024, was primarily due to: \n•\nco-location fees and depreciation of network equipment as a result of investment in our network, particularly as we build out our compute platform to support future growth and scalability; \n•\nnetwork build-out and supporting services, particularly due to our partner program costs related to our cloud computing solutions; and\n•\nstock-based compensation due to the shift in some of our compensation programs from cash-based to stock-based for certain employees, including our employer 401(k) match program effective in 2025, and the increased expected achievement of our performance-based compensation plans.\nThese increases were partially offset by lower bandwidth fees as a result of improved pricing on contract renewals with our bandwidth providers and operational efficiencies on our network. \nDuring the remainder of 2025, we expect our cost of revenue to increase as compared to 2024, in particular our co-location fees and depreciation of network equipment, due to investments in our network to support the continued growth of our cloud computing solutions. Additionally, we expect network build-out and supporting services to increase due to our partner programs to support the growth of our cloud computing solutions.\n31\nTable of Contents\nResearch and Development Expenses\nResearch and development expenses consisted of the following for the periods presented (in thousands):\nFor the Three Months\nEnded September 30,\nFor the Nine Months \nEnded September 30,\n \n2025\n2024\n% Change\n2025\n2024\n% Change\nPayroll and related costs\n$\n150,712 \n$\n140,658 \n7 \n%\n$\n448,257 \n$\n423,772 \n6 \n%\nStock-based compensation\n42,415 \n39,275 \n8 \n124,486 \n114,271 \n9 \nCapitalized salaries and related costs\n(75,882)\n(67,385)\n13 \n(219,920)\n(208,403)\n6 \nOther expenses\n7,475 \n7,799 \n(4)\n21,284 \n20,991 \n1 \nTotal research and development\n$\n124,720 \n$\n120,347 \n4 \n%\n$\n374,107 \n$\n350,631 \n7 \n%\nAs a percentage of revenue\n12 \n%\n12 \n%\n12 \n%\n12 \n%\nThe increase in research and development expenses during the three and nine months ended September 30, 2025, as compared to the same periods in 2024, was primarily due to higher payroll and related costs and stock-based compensation as a result of headcount growth from our strategic initiatives, and the increased expected achievement of our performance-based compensation plans. Additionally, stock-based compensation increased due to a shift in our employer 401(k) match program from cash-based to stock-based, effective in 2025, which partially offset the increase in payroll and related costs.\nResearch and development costs are expensed as incurred, other than certain internal-use software development costs eligible for capitalization. Capitalized development costs consist of payroll and related costs for personnel and external consulting expenses involved in the development of internal-use software used to deliver our services and operate our network. During the three months ended September 30, 2025 and 2024, we capitalized $29.4 million and $25.7 million, respectively, of stock-based compensation. During the nine months ended September 30, 2025 and 2024, we capitalized $87.8 million and $76.0 million, respectively, of stock-based compensation. These capitalized internal-use software development costs are amortized to cost of revenue over their estimated useful lives, ranging from two to ten years based on the software developed and its expected useful life.\nDuring the remainder of 2025, we expect our research and development costs to increase as compared to 2024, in particular payroll and related costs, including stock-based compensation, in support of our faster growing security and cloud computing solutions.\nSales and Marketing Expenses\nSales and marketing expenses consisted of the following for the periods presented (in thousands):\nFor the Three Months\nEnded September 30,\nFor the Nine Months \nEnded September 30,\n \n2025\n2024\n% Change\n2025\n2024\n% Change\nPayroll and related costs\n$\n96,529 \n$\n97,146 \n(1)\n%\n$\n285,168 \n$\n290,518 \n(2)\n%\nStock-based compensation\n22,413 \n21,076 \n6 \n67,116 \n58,863 \n14 \nMarketing programs and related costs\n16,735 \n14,077 \n19 \n44,504 \n40,808 \n9 \nOther expenses\n9,190 \n6,252 \n47 \n28,449 \n21,971 \n29 \nTotal sales and marketing\n$\n144,867 \n$\n138,551 \n5 \n%\n$\n425,237 \n$\n412,160 \n3 \n%\nAs a percentage of revenue\n14 \n%\n14 \n%\n14 \n%\n14 \n%\nThe increase in sales and marketing expenses during the three and nine months ended September 30, 2025, as compared to the same periods in 2024, was primarily due to:\n•\nstock-based compensation as a result of the increased expected achievement of our performance-based compensation plans and a shift in our employer 401(k) match program from cash-based to stock-based, effective in 2025;\n•\nmarketing programs and related costs from the timing of events and increased campaigns; and \n32\nTable of Contents\n•\nother expenses as a result of professional service fees associated with our go-to-market transformation     initiative.\nDuring the remainder of 2025, we do not expect significant increases in sales and marketing expenses as compared to 2024, however as part of our go-to-market transformation initiative we plan to reinvest in headcount and resources to support our faster growing security and cloud computing solutions.\nGeneral and Administrative Expenses\nGeneral and administrative expenses consisted of the following for the periods presented (in thousands):\nFor the Three Months\nEnded September 30,\nFor the Nine Months \nEnded September 30,\n \n2025\n2024\n% Change\n2025\n2024\n% Change\nPayroll and related costs\n$\n57,739 \n$\n56,224 \n3 \n%\n$\n172,708 \n$\n169,737 \n2 \n%\nStock-based compensation\n30,857 \n25,690 \n20 \n90,595 \n76,151 \n19 \nDepreciation and amortization\n16,880 \n16,559 \n2 \n49,853 \n49,622 \n— \nFacilities-related costs\n21,680 \n22,368 \n(3)\n64,823 \n64,864 \n— \nProvision for doubtful accounts\n1,190 \n1,410 \n(16)\n2,896 \n3,491 \n(17)\nAcquisition-related costs\n17 \n5,036 \n(100)\n1,386 \n7,387 \n(81)\nSoftware and related service costs\n17,618 \n14,617 \n21 \n52,017 \n43,218 \n20 \nOther expenses\n15,738 \n18,053 \n(13)\n45,971 \n51,771 \n(11)\nTotal general and administrative\n$\n161,719 \n$\n159,957 \n1 \n%\n$\n480,249 \n$\n466,241 \n3 \n%\nAs a percentage of revenue\n15 \n%\n16 \n%\n15 \n%\n16 \n%\nThe increase in general and administrative expenses during the three and nine months ended September 30, 2025, as compared to the same periods in 2024, was primarily due to higher stock-based compensation as a result of the increased expected achievement of our performance-based compensation plans, an increase in the number of participants in the equity compensation program, as well as a shift in our employer 401(k) match program from cash-based to stock-based effective in 2025, which increased stock-based compensation and partially offset the increase in payroll and related costs. Additionally, software and related service costs increased as we transition to and expand usage of cloud-based applications to support our operations. These increases were partially offset by acquisition-related costs from our acquisition of Noname Gate Ltd. (\"Noname Security\") in 2024 that did not recur in 2025.\nDuring the remainder of 2025, we do not expect significant increases in general and administrative expenses as compared to 2024 as we plan to continue to carefully manage costs in an effort to support the operations of the business.\nAmortization of Acquired Intangible Assets\nFor the Three Months\nEnded September 30,\nFor the Nine Months \nEnded September 30,\n(in thousands)\n2025\n2024\n% Change\n2025\n2024\n% Change\nAmortization of acquired intangible assets\n$\n27,783 \n$\n24,368 \n14 \n%\n$\n83,141 \n$\n66,467 \n25 \n%\nAs a percentage of revenue\n3 \n%\n2 \n%\n3 \n%\n2 \n%\nThe increase in amortization of acquired intangible assets for the three and nine months ended September 30, 2025, as compared to the same periods in 2024, was the result of amortization of acquired intangible assets related to our acquisitions in 2024. Based on acquired intangible assets at September 30, 2025, we expect amortization of acquired intangible assets to be approximately $27.9 million for the remainder of 2025, and $104.0 million, $89.2 million, $81.8 million and $75.9 million for 2026, 2027, 2028 and 2029, respectively.\n33\nTable of Contents\nRestructuring Charge\nFor the Three Months\nEnded September 30,\nFor the Nine Months \nEnded September 30,\n(in thousands)\n2025\n2024\n% Change\n2025\n2024\n% Change\nRestructuring (benefit) charge\n$\n(15)\n$\n82,013 \n(100)\n%\n$\n3,449 \n$\n83,942 \n(96)\n%\nAs a percentage of revenue\n— \n%\n8 \n%\n— \n%\n3 \n%\nThe restructuring (benefit) charge for the three and nine months ended September 30, 2025 was primarily driven by management's commitment to redeploy headcount and resources to support our faster growing security and cloud computing solutions. The charges recognized during these periods include severance and related expenses for certain headcount reductions and impairments to capitalized internal-use software. We do not expect to incur material additional charges related to this action.\nThe restructuring charge for the three and nine months ended September 30, 2024 was driven by management's commitment to an action initiated during the third quarter of 2024 with the primary intent to redeploy resources to support our strategic investments and as a result of our completed acquisitions. The restructuring charge included severance and related expenses for certain headcount reductions, as well as impairments of acquired intangible assets and capitalized internal-use software. We do not expect to incur material additional charges related to these actions.\nNon-Operating Income\nFor the Three Months\nEnded September 30,\nFor the Nine Months \nEnded September 30,\n(in thousands)\n2025\n2024\n% Change\n2025\n2024\n% Change\nInterest and marketable securities income, net\n$\n18,893 \n$\n23,065 \n(18)\n%\n$\n52,552 \n$\n77,534 \n(32)\n%\nAs a percentage of revenue\n2 \n%\n2 \n%\n2 \n%\n3 \n%\nInterest expense\n$\n(7,915)\n$\n(6,735)\n18 \n%\n$\n(22,866)\n$\n(20,382)\n12 \n%\nAs a percentage of revenue\n(1)\n%\n(1)\n%\n(1)\n%\n(1)\n%\nOther expense, net\n$\n(3,837)\n$\n(13,161)\n(71)\n%\n$\n(3,268)\n$\n(13,599)\n(76)\n%\nAs a percentage of revenue\n— \n%\n(1)\n%\n— \n%\n— \n%\nInterest and marketable securities income, net consists of interest earned on invested cash and marketable securities balances and income and losses on mutual funds that are associated with our employee non-qualified deferred compensation plan. The decrease for the three months ended September 30, 2025, as compared to the same period in 2024, was primarily due to investing in marketable securities at lower rates of return due to lower market interest rates in 2025 as compared to 2024 and lower average investment balances for the three months ended September 30, 2025, as compared to the same period in 2024. The decrease for the nine months ended September 30, 2025, as compared to the same period in 2024 was due to a reduction of cash and marketable securities balances and re-positioning our investments to cash equivalents, yielding lower interest, in 2025 in order to repay our $1,150.0 million convertible senior notes that became due in May 2025. This decrease was partially offset by interest earned as a result of purchases of new marketable securities during the quarter with the proceeds of our convertible senior notes due 2033.\nInterest expense is related to our debt transactions, which are described in Note 6 to the interim condensed consolidated financial statements.\nOther expense, net primarily represents net foreign exchange gains and losses due to foreign exchange rate fluctuations on the remeasurement of monetary assets and liabilities that are not denominated in the functional currency and gains and losses on cost method investments, as well as other non-operating expense and income items. Other expense, net may fluctuate in the future based on changes in foreign currency exchange rates or other events.\n34\nTable of Contents\nProvision for Income Taxes\nFor the Three Months\nEnded September 30,\nFor the Nine Months \nEnded September 30,\n(in thousands)\n2025\n2024\n% Change\n2025\n2024\n% Change\nProvision for income taxes\n$\n(32,995)\n$\n(15,899)\n108 \n%\n$\n(131,527)\n$\n(63,891)\n106 \n%\nAs a percentage of revenue\n(3)\n%\n(2)\n%\n(4)\n%\n(2)\n%\nEffective income tax rate\n(19)\n%\n(22)\n%\n(26)\n%\n(15)\n%\nFor the three months ended September 30, 2025, as compared to the same period in 2024, our provision for income taxes increased due to an increase in profitability and a shortfall in the tax benefit related to stock-based compensation. These amounts were partially offset by an increase in foreign income taxed at lower rates and a decrease in global intangible low-taxed income. For the nine months ended September 30, 2025, as compared to the same period in 2024, our provision for income taxes increased due to a shortfall in the tax benefit related to stock-based compensation, an increase in profitability and an increase in certain tax reserves. \nFor the three months ended September 30, 2025, our effective income tax rate was lower than the federal statutory tax rate due to foreign income taxed at lower rates, a change in the valuation allowance recorded against state credits and the benefit of U.S. federal, state and foreign research and development credits. These amounts were partially offset by non-deductible stock-based compensation and an increase in certain tax reserves. For the nine months ended September 30, 2025, our effective income tax rate was higher than the federal statutory tax rate due to non-deductible stock-based compensation, an increase in certain tax reserves and a shortfall in the tax benefit related to stock-based compensation. These amounts were partially offset by foreign income taxed at lower rates and the benefit of U.S. federal, state and foreign research and development credits.\nFor the three months ended September 30, 2024, our effective income tax rate was higher than the federal statutory tax rate due to non-deductible stock-based compensation, partially offset by the excess tax benefit related to stock-based compensation, foreign income taxed at lower rates and the benefit of U.S. federal, state and foreign research and development credits. For the nine months ended September 30, 2024, our effective income tax rate was lower than the federal statutory tax rate due to the excess tax benefit related to stock-based compensation, foreign income taxed at lower rates and the benefit of U.S. federal, state and foreign research and development credits. These amounts were partially offset by non-deductible stock-based compensation and the adoption of a 15% global minimum corporate income tax by certain OECD member countries.\nIn determining our net deferred tax assets and valuation allowances, annualized effective income tax rates and cash paid for income taxes, management is required to make judgments and estimates about domestic and foreign profitability, the timing and extent of the utilization of net operating loss carryforwards, applicable tax rates, transfer pricing methodologies and tax planning strategies. Judgments and estimates related to our projections and assumptions are inherently uncertain; therefore, actual results could differ materially from our projections.\nUse of Non-GAAP Financial Measures\nIn addition to providing financial measurements based on GAAP, we provide additional financial metrics that are not prepared in accordance with GAAP (\"non-GAAP financial measures\"). Management uses non-GAAP financial measures, in addition to GAAP financial measures, to understand and compare operating results across accounting periods, for financial and operational decision making, for planning and forecasting purposes, to measure executive compensation and to evaluate our financial performance. These non-GAAP financial measures are non-GAAP income from operations, non-GAAP operating margin, non-GAAP net income, non-GAAP net income per diluted share, Adjusted EBITDA, Adjusted EBITDA margin and impact of foreign currency exchange rates, as discussed below.\nManagement believes that these non-GAAP financial measures reflect our ongoing business in a manner that allows for meaningful comparisons and analysis of trends in the business, as they facilitate comparison of financial results across accounting periods and may be comparable to those of our peer companies. Management also believes that these non-GAAP financial measures enable investors to evaluate our operating results and future prospects in the same manner as management. These non-GAAP financial measures may exclude expenses and gains that may be unusual in nature, infrequent or not reflective of our ongoing operating results.\nThe non-GAAP financial measures do not replace the presentation of our GAAP financial measures and should only be used as a supplement to, not as a substitute for, our financial results presented in accordance with GAAP.\n35\nTable of Contents\nThe non-GAAP adjustments, and our basis for excluding them from non-GAAP financial measures, are outlined below:\n•\nAmortization of acquired intangible assets \n– We have incurred amortization of intangible assets, included in our GAAP financial statements, related to various acquisitions we have made. The amount of an acquisition's purchase price allocated to intangible assets and term of its related amortization can vary significantly and is unique to each acquisition; therefore, we exclude amortization of acquired intangible assets from our non-GAAP financial measures to provide investors with a consistent basis for comparing pre- and post-acquisition operating results. \n•\nStock-based compensation and amortization of capitalized stock-based compensation\n – Stock-based compensation is an important aspect of the compensation paid to our employees which includes long-term incentive plans to encourage retention, performance-based plans to encourage achievement of specified financial targets, short-term incentive awards with a one year vest and shares issued as part of a retirement savings program. The grant date fair value of the stock-based compensation awards varies based on the stock price at the time of grant, varying valuation methodologies, subjective assumptions and the variety of award types. This makes the comparison of our current financial results to previous and future periods difficult to interpret; therefore, we believe it is useful to exclude stock-based compensation and amortization of capitalized stock-based compensation from our non-GAAP financial measures in order to highlight the performance of our core business and to be consistent with the way many investors evaluate our performance and compare our operating results to peer companies. \n•\nAcquisition-related costs \n– Acquisition-related costs include transaction fees, advisory fees, due diligence costs and other direct costs associated with strategic activities. Acquisition-related costs are impacted by the timing and size of the acquisitions, and we exclude acquisition-related costs from our non-GAAP financial measures to provide a useful comparison of operating results to prior periods and to peer companies because such amounts vary significantly based on the magnitude of our acquisition transactions and do not reflect our core operations. \n•\nRestructuring charge\n – We have incurred restructuring charges from programs that have significantly changed either the scope of the business undertaken by us or the manner in which that business is conducted. These charges include severance and related expenses for workforce reductions, impairments of long-lived assets that will no longer be used in operations (including acquired intangible assets, right-of-use assets, other facility-related property and equipment and internal-use software) and termination fees for any contracts cancelled as part of these programs. We exclude these items from our non-GAAP financial measures when evaluating our continuing business performance as such items vary significantly based on the magnitude of the restructuring action and do not reflect expected future operating expenses. In addition, these charges do not necessarily provide meaningful insight into the fundamentals of current or past operations of our business. \n•\nAmortization of debt issuance costs and capitalized interest expense \n– The issuance costs of our convertible senior notes are amortized to interest expense and are excluded from our non-GAAP results because management believes the non-cash amortization expense is not representative of ongoing operating performance.\n•\nGains and losses on cost method investments\n – We have recorded gains and losses from the disposition, changes to fair value and impairment of cost method investments. We believe excluding these amounts from our non-GAAP financial measures is useful to investors as the types of events giving rise to these gains and losses are not representative of our core business operations and ongoing operating performance.\n•\nIncome tax effect of non-GAAP adjustments and certain discrete tax items\n – The non-GAAP adjustments described above are reported on a pre-tax basis. The income tax effect of non-GAAP adjustments is the difference between GAAP and non-GAAP income tax expense. Non-GAAP income tax expense is computed on non-GAAP pre-tax income (GAAP pre-tax income adjusted for non-GAAP adjustments) and excludes certain discrete tax items (such as the impact of intercompany sales of intellectual property related to our acquisitions), if any. We believe that applying the non-GAAP adjustments and their related income tax effect allows us to highlight income attributable to our core operations. \n36\nTable of Contents\nThe following table reconciles GAAP income from operations to non-GAAP income from operations and non-GAAP operating margin for the periods presented (in thousands):\n \nFor the Three Months\nEnded September 30,\nFor the Nine Months \nEnded September 30,\n \n2025\n2024\n2025\n2024\nIncome from operations\n$\n166,024 \n$\n70,637 \n$\n472,068 \n$\n385,351 \nAmortization of acquired intangible assets\n27,783 \n24,368 \n83,141 \n66,467 \nStock-based compensation\n115,423 \n102,607 \n340,177 \n294,333 \nAmortization of capitalized stock-based compensation and capitalized interest expense\n12,753 \n11,089 \n37,400 \n31,646 \nRestructuring (benefit) charge\n(15)\n82,013 \n3,449 \n83,942 \nAcquisition-related costs\n17 \n5,036 \n1,386 \n7,387 \nNon-GAAP income from operations\n$\n321,985 \n$\n295,750 \n$\n937,621 \n$\n869,126 \nGAAP operating margin\n16 \n%\n7 \n%\n15 \n%\n13 \n%\nNon-GAAP operating margin\n31 \n%\n29 \n%\n30 \n%\n29 \n%\nThe following table reconciles GAAP net income to non-GAAP net income for the periods presented (in thousands):\n \nFor the Three Months\nEnded September 30,\nFor the Nine Months \nEnded September 30,\n \n2025\n2024\n2025\n2024\nNet income\n$\n140,170 \n$\n57,907 \n$\n366,959 \n$\n365,013 \nAmortization of acquired intangible assets\n27,783 \n24,368 \n83,141 \n66,467 \nStock-based compensation\n115,423 \n102,607 \n340,177 \n294,333 \nAmortization of capitalized stock-based compensation and capitalized interest expense\n12,753 \n11,089 \n37,400 \n31,646 \nRestructuring (benefit) charge\n(15)\n82,013 \n3,449 \n83,942 \nAcquisition-related costs\n17 \n5,036 \n1,386 \n7,387 \nAmortization of debt issuance costs\n1,926 \n1,591 \n5,176 \n4,933 \n(Gain) loss on cost method investments, net\n— \n— \n(9,313)\n66 \nIncome tax effect of above non-GAAP adjustments and certain discrete tax items\n(29,150)\n(41,097)\n(52,016)\n(112,130)\nNon-GAAP net income\n$\n268,907 \n$\n243,514 \n$\n776,359 \n$\n741,657 \n37\nTable of Contents\nThe following table reconciles GAAP net income per diluted share to non-GAAP net income per diluted share for the periods presented (in thousands, except per share data):\n \nFor the Three Months\nEnded September 30,\nFor the Nine Months \nEnded September 30,\n \n2025\n2024\n2025\n2024\nGAAP net income per diluted share\n$\n0.97 \n$\n0.38 \n$\n2.50 \n$\n2.36 \nAmortization of acquired intangible assets\n0.19 \n0.16 \n0.57 \n0.43 \nStock-based compensation\n0.80 \n0.67 \n2.31 \n1.90 \nAmortization of capitalized stock-based compensation and capitalized interest expense\n0.09 \n0.07 \n0.25 \n0.20 \nRestructuring (benefit) charge\n— \n0.54 \n0.02 \n0.54 \nAcquisition-related costs\n— \n0.03 \n0.01 \n0.05 \nAmortization of debt issuance costs\n0.01 \n0.01 \n0.04 \n0.03 \n(Gain) loss on cost method investments, net\n— \n— \n(0.06)\n— \nIncome tax effect of above non-GAAP adjustments and certain discrete tax items\n(0.20)\n(0.27)\n(0.35)\n(0.72)\nAdjustment for shares\n (1)\n— \n— \n— \n0.03 \nNon-GAAP net income per diluted share\n (2)\n$\n1.86 \n$\n1.59 \n$\n5.28 \n$\n4.82 \nShares used in GAAP per diluted share calculations\n144,811 \n153,240 \n147,041 \n154,765 \nImpact of benefit from note hedge transactions \n(1)\n— \n(294)\n— \n(869)\nShares used in non-GAAP per diluted share calculations\n (1)\n144,811 \n152,946 \n147,041 \n153,896 \n(1)  Shares used in non-GAAP per diluted share calculations have been adjusted for the three and nine months ended September 30, 2024, for the benefit of our note hedge transactions. During these periods, our average stock price was in excess of $95.10, which was the initial conversion price of our convertible senior notes that matured in May 2025. See further definition below.\n(2)  Amounts may not foot due to rounding.\nNon-GAAP net income per diluted share is calculated as non-GAAP net income divided by weighted average diluted common shares outstanding. Diluted weighted average common shares outstanding are adjusted in non-GAAP per share calculations for the shares that would be delivered to us pursuant to the note hedge transactions entered into in connection with the issuances of our convertible senior notes. Under GAAP, shares delivered under hedge transactions are not considered offsetting shares in the fully-diluted share calculation until they are delivered. However, we would receive a benefit from the note hedge transactions and would not allow the dilution to occur, so management believes that adjusting for this benefit provides a meaningful view of operating performance. With respect to the convertible senior notes due in each of 2033, 2029 and 2027, and those that matured in 2025, unless our weighted average stock price is greater than $93.01, $126.31, $116.18 and $95.10, respectively, the initial conversion prices, there will be no difference between GAAP and non-GAAP diluted weighted average common shares outstanding.\nWe consider Adjusted EBITDA to be another important indicator of the operational strength and performance of our business and a good measure of our historical operating trends. Adjusted EBITDA eliminates items that we do not consider to be part of our core operations. We define Adjusted EBITDA as GAAP net income excluding the following items: interest and marketable securities income and losses; income taxes; depreciation and amortization of tangible and intangible assets; stock-based compensation; amortization of capitalized stock-based compensation; acquisition-related costs; restructuring charges; legal settlements; foreign exchange gains and losses; interest expense; amortization of capitalized interest expense; gains and losses on cost method investments; and other non-recurring or unusual items that may arise from time to time. Adjusted EBITDA margin represents Adjusted EBITDA stated as a percentage of revenue.\n38\nTable of Contents\nThe following table reconciles GAAP net income to Adjusted EBITDA and Adjusted EBITDA margin for the periods presented (in thousands):\n \nFor the Three Months\nEnded September 30,\nFor the Nine Months \nEnded September 30,\n \n2025\n2024\n2025\n2024\nNet income\n$\n140,170 \n$\n57,907 \n$\n366,959 \n$\n365,013 \nInterest and marketable securities income, net\n(18,893)\n(23,065)\n(52,552)\n(77,534)\nProvision for income taxes\n32,995 \n15,899 \n131,527 \n63,891 \nDepreciation and amortization\n136,428 \n130,517 \n406,489 \n383,180 \nAmortization of capitalized stock-based compensation and capitalized interest expense\n12,753 \n11,089 \n37,400 \n31,646 \nAmortization of acquired intangible assets\n27,783 \n24,368 \n83,141 \n66,467 \nStock-based compensation\n115,423 \n102,607 \n340,177 \n294,333 \nRestructuring (benefit) charge\n(15)\n82,013 \n3,449 \n83,942 \nAcquisition-related costs\n17 \n5,036 \n1,386 \n7,387 \nInterest expense\n7,915 \n6,735 \n22,866 \n20,382 \n(Gain) loss on cost method investments, net\n— \n— \n(9,313)\n66 \nOther expense, net\n3,837 \n13,161 \n12,581 \n13,533 \nAdjusted EBITDA\n$\n458,413 \n$\n426,267 \n$\n1,344,110 \n$\n1,252,306 \nNet income margin\n13 \n%\n6 \n%\n12 \n%\n12 \n%\nAdjusted EBITDA margin\n43 \n%\n42 \n%\n43 \n%\n42 \n%\nImpact of Foreign Currency Exchange Rates\nRevenue and earnings from our international operations have historically been important contributors to our financial results. Consequently, our financial results have been impacted, and management expects they will continue to be impacted, by fluctuations in foreign currency exchange rates. For example, when the local currencies of our international subsidiaries weaken, our consolidated results stated in U.S. dollars are negatively impacted.\nBecause exchange rates are a meaningful factor in understanding period-to-period comparisons, management believes the presentation of the impact of foreign currency exchange rates on revenue and earnings enhances the understanding of our financial results and evaluation of performance in comparison to prior periods. The dollar impact of changes in foreign currency exchange rates presented is calculated by translating current period results using monthly average foreign currency exchange rates from the comparative period and comparing them to the reported amount. The percentage growth rate impacted by foreign currency exchange rates, sometimes referred to as constant currency, is calculated by comparing the prior period amounts as reported and the current period amounts translated using the same monthly average foreign currency exchange rates from the comparative period.\nLiquidity and Capital Resources\nTo date, we have financed our operations primarily through public and private sales of debt and equity securities and cash generated by operations. As of September 30, 2025, our cash, cash equivalents and marketable securities, which are detailed in Note 2 to the interim condensed consolidated financial statements, totaled $1.8 billion. We place our cash investments in instruments that meet high-quality credit standards, as specified in our investment policy. Our investment policy is also designed to limit the amount of our credit exposure to any one issue or issuer and seeks to manage these assets to achieve our goals of preserving principal and maintaining adequate liquidity at all times.\nChanges in cash, cash equivalents and marketable securities are dependent upon changes in, among other things, working capital items such as accounts receivable, deferred revenue, accounts payable, various accrued expenses and operating lease obligations, as well as changes in our capital and financial structure due to common stock repurchases, debt repayments and issuances, purchases and sales of marketable securities, cash paid for acquisitions and similar events. We believe our strong balance sheet, cash position and access to funds available under our revolving credit facilities are important competitive \n39\nTable of Contents\ndifferentiators that provide the financial stability and flexibility to enable us to continue to make investments at opportune times. We expect to continue to evaluate strategic investments to strengthen our business.\nAs of September 30, 2025, we had cash and cash equivalents of $416.4 million held in accounts outside the U.S. The U.S. Tax Cuts and Jobs Act establishes a territorial tax system in the U.S., which provides companies with the potential ability to repatriate earnings with minimal U.S. federal income tax impact. As a result, our liquidity is not expected to be materially impacted by the amount of cash and cash equivalents held in accounts outside the U.S.\nCash Provided by Operating Activities\nFor the Nine Months \nEnded September 30,\n(in thousands)\n2025\n2024\nNet income\n$\n366,959 \n$\n365,013 \nNon-cash reconciling items included in net income\n891,833 \n826,422 \nChanges in operating assets and liabilities\n(106,611)\n(16,052)\nNet cash provided by operating activities\n$\n1,152,181 \n$\n1,175,383 \nThe decrease in cash provided by operating activities for the nine months ended September 30, 2025, as compared to the same period in 2024, was due to timing of customer collections and severance payments occurring in 2025 related to our restructuring action in the third quarter of 2024, as well as higher income tax payments driven by intercompany sales of intellectual property.\nCash Used in Investing Activities\nFor the Nine Months \nEnded September 30,\n(in thousands)\n2025\n2024\nCash received (paid) for business acquisitions, net of cash acquired\n$\n790 \n$\n(434,066)\nCash paid for asset acquisitions\n(29,930)\n(4,862)\nPurchases of property and equipment and capitalization of internal-use software development costs\n(614,805)\n(522,408)\nNet marketable securities activity\n474,959 \n402,683 \nOther, net\n(5,365)\n4,160 \nNet cash used in investing activities\n$\n(174,351)\n$\n(554,493)\nThe decrease in cash used in investing activities during the nine months ended September 30, 2025, as compared to the same period in 2024, was due to:\n•\nthe acquisition of Noname Security in June 2024 that did not recur in 2025; and\n•\nan increase in net marketable securities activity, primarily due to higher maturities and sales compared to purchases; which resulted from repayment and proceeds from our convertible senior notes activities.\nThese increases were partially offset by higher purchases of property and equipment related to network expansion, primarily for our compute locations.\n40\nTable of Contents\nNet Cash Used in Financing Activities\nFor the Nine Months \nEnded September 30,\n(in thousands)\n2025\n2024\nNet convertible senior notes activity\n$\n276,839 \n$\n— \nActivity related to stock-based compensation\n(61,084)\n(109,407)\nRepurchases of common stock\n(799,963)\n(419,097)\nOther, net\n(2,126)\n(10,291)\nNet cash used in financing activities\n$\n(586,334)\n$\n(538,795)\nThe increase in cash used in financing activities during the nine months ended September 30, 2025, as compared to the same period in 2024, was primarily due to an increase in repurchases of common stock, partially offset by our net convertible senior notes activity. During the nine months ended September 30, 2025, we issued $1,725.0 million in par value of convertible senior notes and repaid $1,150.0 million in convertible senior notes which were due in May 2025.\nIn May 2024, our board of directors authorized a $2.0 billion share repurchase program, effective May 2024 through June 2027. During the nine months ended September 30, 2025, we repurchased 10.0 million shares of common stock at a weighted average price of $79.77 per share for an aggregate of $800.0 million. As of September 30, 2025, $1.2 billion remained available for future share repurchases under the authorization program. Our goals for the share repurchase program are to offset the dilution created by our employee equity compensation programs over time and provide the flexibility to return capital to stockholders as business and market conditions warrant, while still preserving our ability to pursue other strategic opportunities. The timing and amount of any future share repurchases will be determined by our management based on its evaluation of market conditions and other factors.\nConvertible Senior Notes\nIn May 2025, we issued $1,725.0 million in principal amount of convertible senior notes due 2033 and entered into related convertible note hedge and warrant transactions. We intend to use a portion of the net proceeds to repay at maturity our $1,150.0 million outstanding aggregate principal amount of convertible senior notes due in 2027. Additionally, we used a portion of the net proceeds to repay $250.0 million in borrowings made in April 2025 under our revolving credit agreement entered into in November 2022 (\"2022 Credit Agreement\") and for share repurchases.\nAs of September 30, 2025, we had $4,140.0 million of convertible senior notes outstanding that are senior unsecured obligations and bear interest payable semi-annually in arrears. These notes mature between September 2027 and May 2033. The terms of the notes and hedge and warrant transactions are discussed more fully in Note 6 to the interim condensed consolidated financial statements.\nRevolving Credit Facilities\nIn January 2025, we entered into a $150.0 million uncommitted revolving credit agreement (\"2025 Credit Agreement\"). Any outstanding borrowings are secured by collateral, consisting primarily of available-for-sale marketable securities. The 2025 Credit Agreement does not expire but is cancellable at any time and any borrowings can be due on demand. Borrowings under the 2025 Credit Agreement will bear a specified interest rate, based on the Secured Overnight Financing Rate, and interest period at the time of the confirmed borrowing. There were no outstanding borrowings under the 2025 Credit Agreement as of September 30, 2025.\nIn November 2022, we entered into a $500.0 million 2022 Credit Agreement, which allows us to borrow at various interest rates and contains customary representations and warranties, affirmative and negative covenants and events of default. The 2022 Credit Agreement was amended in May 2025 to increase the aggregate revolving commitments from $500.0 million to $1.0 billion and to extend the expiration one year. As of September 30, 2025, we were in compliance with all covenants. There were no outstanding borrowings under the 2022 Credit Agreement as of September 30, 2025.\nThe terms of the revolving credit agreements are discussed more fully in Note 6 to the interim condensed consolidated financial statements.\n41\nTable of Contents\nOperating Leases\nWe have entered into operating leases for real estate assets related to office space and co-location assets related to space or racks at co-location facilities and related equipment for our servers and other networking equipment. As of September 30, 2025, there have been no significant changes in our obligations under these operating lease arrangements from those reported on Form 10-K for the year ended December 31, 2024, other than normal period-to-period variations, particularly as we execute on our expansion plans for our compute locations.\nPurchase Commitments\nWe enter into long-term agreements with network and internet service providers for bandwidth, as well as execute purchase orders for the purchase of goods or services in the ordinary course of business, which may contain minimum commitments. These minimum commitments may vary from period to period depending on the timing and length of contract renewals with our vendors, and on our plans for network expansion, including our expansion plans related to our compute locations.\nLiquidity Outlook\nBased on our present business plan, we expect our current cash, cash equivalents and marketable securities balances and our forecasted cash flows from operations to be sufficient to meet our foreseeable cash needs for at least the next 12 months. Our foreseeable cash needs, in addition to our recurring operating costs, include our expected capital expenditures, investments in information technology, potential strategic acquisitions, anticipated share repurchases, lease and purchase commitments and settlements of other liabilities.\nOff-Balance Sheet Arrangements\nWe have entered into indemnification agreements with third parties, including vendors, customers, landlords, our officers and directors, stockholders of acquired companies, joint venture partners and third parties to which we license technology. Generally, these indemnification agreements require us to reimburse losses suffered by a third-party due to various events, such as lawsuits arising from patent or copyright infringement or our negligence. These indemnification obligations are considered off-balance sheet arrangements in accordance with the authoritative guidance for guarantor’s accounting and disclosure requirements for guarantees, including indirect guarantees of indebtedness of others. See also Note 13 to our consolidated financial statements included in our annual report on Form 10-K for the year ended December 31, 2024 for further discussion of these indemnification agreements. The fair value of guarantees issued or modified during the nine months ended September 30, 2025 was determined to be immaterial.\nAs of September 30, 2025, we did not have any additional material off-balance sheet arrangements.\nSignificant Accounting Policies and Estimates\nSee Note 2 to our consolidated financial statements included in our annual report on Form 10-K for the year ended December 31, 2024. There have been no material changes to our significant accounting policies and estimates from those reported in our annual report on Form 10-K for the year ended December 31, 2024."
}