{
  "item1": "Akamai's mission power protect life online. Since 1998, Akamai developed provided solutions global enterprises build, secure accelerate applications digital experiences. massively distributed global network comprised core distributed compute sites, more than 4,300 edge points-of-presence approximately 130 countries over 700 cities, underlying global network integrated roughly 1,200 network partners. scale distribution, Akamai visibility insight into traffic volumes, congestion, attack patterns, vulnerabilities other activities across internet's complex intersections networks systems.",
  "item7": "Payroll related costs Stock-based compensation Depreciation amortization Facilities-related costs Provision doubtful accounts Acquisition-related costs Software related service costs Total general administrative percentage revenue increase general administrative expenses 2024 compared 2023 primarily due higher payroll related costs result annual merit increases, increase stock-based compensation result timing performance-based equity award grants increase other expenses related professional service fees support business. These increases partially offset decreased facilities-related costs exited certain facilities connection FlexBase program. increase general administrative expenses 2023 compared 2022 due higher payroll related costs, including stock-based compensation, result annual merit increases, headcount growth, increased expected achievement performance-based compensation plans higher average equity awards employees driven talent market other expenses due increased professional service fees support business. Additionally, stock-based compensation increased due shift one compensation programs cash-based stock-based.",
  "item2": "Payroll related costs Stock-based compensation Depreciation amortization Facilities-related costs Provision doubtful accounts Acquisition-related costs Software related service costs Total general administrative percentage revenue increase general administrative expenses during three nine months ended September 30, 2025, compared same periods 2024, primarily due higher stock-based compensation result increased expected achievement performance-based compensation plans, increase number participants equity compensation program, well shift employer 401(k) match program cash-based stock-based effective 2025, which increased stock-based compensation partially offset increase payroll related costs. Additionally, software related service costs increased transition expand usage cloud-based applications support operations. These increases partially offset acquisition-related costs acquisition Noname Gate Ltd. (\"Noname Security\") 2024 did not recur 2025."
}