{
  "source_file": "alb-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2.\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations.\nForward-looking Statements\nSome of the information presented in this Quarterly Report on Form 10-Q, including the documents incorporated by reference herein, may constitute forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. Such forward-looking statements are based on our current expectations, which are in turn based on assumptions that we believe are reasonable based on our current knowledge of our business and operations. We have used words such as “ambition,” “anticipate,” “believe,” “could,” “estimate,” “expect,” “goal,” “intend,” “may,” “should,” “would,” “will” and variations of such words and similar expressions to identify such forward-looking statements.\nThese forward-looking statements are not guarantees of future performance and involve certain risks, uncertainties and assumptions, which are difficult to predict and many of which are beyond our control. There can be no assurance that our actual results will not differ materially from the results and expectations expressed or implied in the forward-looking statements. Factors that could cause actual results to differ materially from the outlook expressed or implied in any forward-looking statement include, without limitation, information related to:\n•\nchanges in economic and business conditions;\n•\nproduct development;\n•\nchanges in financial and operating performance of our major customers and industries and markets served by us;\n•\nthe timing of orders received from customers;\n•\nthe gain or loss of significant customers;\n•\nfluctuations in lithium market pricing, which could impact our revenues and profitability particularly due to our increased exposure to index-referenced and variable-priced contracts for battery grade lithium sales;\n•\ninflationary trends in our input costs, such as raw materials, transportation and energy, and their effects on our business and financial results;\n•\nchanges with respect to contract renegotiations;\n•\npotential production volume shortfalls;\n•\ncompetition from other manufacturers;\n•\nchanges in the demand for our products or the end-user markets in which our products are sold;\n•\nlimitations or prohibitions on the manufacture and sale of our products;\n•\navailability of raw materials;\n•\nincreases in the cost of raw materials and energy, and our ability to pass through such increases to our customers;\n•\ntechnological change and development;\n•\nchanges in our markets in general;\n•\nfluctuations in foreign currencies;\n•\nchanges in laws and government regulation impacting our operations or our products;\n•\nchanges in trade policies and tariffs;\n•\nthe occurrence of regulatory actions, proceedings, claims or litigation (including with respect to the U.S. Foreign Corrupt Practices Act and foreign anti-corruption laws);\n•\nthe occurrence of cyber-security breaches, terrorist attacks, industrial accidents or natural disasters;\n•\nthe effects of climate change, including any regulatory changes to which we might be subject;\n•\nhazards associated with chemicals manufacturing;\n•\nthe inability to maintain current levels of insurance, including product or premises liability insurance, or the denial of such coverage;\n•\npolitical unrest affecting the global economy, including adverse effects from terrorism or hostilities;\n•\npolitical instability affecting our manufacturing operations or joint ventures;\n•\nchanges in accounting standards;\n•\nthe inability to achieve results from our global manufacturing cost reduction initiatives as well as our ongoing continuous improvement and rationalization programs;\n•\nchanges in the jurisdictional mix of our earnings and changes in tax laws and rates or interpretation;\n34\nTable of Contents\n•\nchanges in monetary policies, inflation or interest rates that may impact our ability to raise capital or increase our cost of funds, impact the performance of our pension fund investments and increase our pension expense and funding obligations;\n•\nthe ability to apply for and obtain government funding to support new operations;\n•\nvolatility and uncertainties in the debt and equity markets;\n•\ntechnology or intellectual property infringement, including cyber-security breaches, and other innovation risks;\n•\ndecisions we may make in the future;\n•\nfuture acquisition and divestiture transactions, including the ability to successfully execute, operate and integrate acquisitions and divestitures and incurring additional indebtedness;\n•\nexpected benefits and expenses related to our new operating structure and asset optimization activities;\n•\ntiming of active and proposed restructuring and cost optimization projects;\n•\nimpact of any future pandemics;\n•\nimpacts of the situation in the Middle East and the military conflict between Russia and Ukraine, and the global response to it;\n•\nperformance of our partners in joint ventures and other projects;\n•\nchanges in credit ratings; and\n•\nthe other factors detailed from time to time in the reports we file with the Securities and Exchange Commission (“SEC”).\nThese forward-looking statements speak only as of the date of this Quarterly Report on Form 10-Q. We assume no obligation to provide any revisions to any forward-looking statements should circumstances change, except as otherwise required by securities and other applicable laws. The following discussion should be read together with our condensed consolidated financial statements and related notes included in this Quarterly Report on Form 10-Q.\nThe following is a discussion and analysis of our results of operations for the three-month and nine-month periods ended September 30, 2025 and 2024. A discussion of our consolidated financial condition and sources of additional capital is included under a separate heading, “Financial Condition and Liquidity.”\nOverview\nWe are a world leader in transforming essential resources into critical ingredients for mobility, energy, connectivity, and health. Our purpose is to enable a more resilient world. We partner to pioneer new ways to move, power, connect, and protect. The end markets we serve include grid storage, automotive, aerospace, conventional energy, electronics, construction, agriculture and food, pharmaceuticals and medical devices. We believe that our world-class resources with reliable and consistent supply, our leading process chemistry, high-impact innovation, customer centricity and focus on people and planet will enable us to maintain a leading position in the industries in which we operate.\nSecular trends favorably impacting demand within the end markets that we serve combined with our diverse product portfolio, cost discipline, broad geographic presence and customer-focused solutions will continue to be key drivers of our future earnings. We continue to build upon our existing green solutions portfolio and our ongoing mission to provide innovative, yet commercially viable, clean energy products and services to the marketplace to contribute to our sustainability-based revenue. For example, our Energy Storage business contributes to the growth of clean miles driven with electric vehicles and more efficient use of renewable energy through grid storage; Specialties enables the prevention of fires starting in electronic equipment, greater fuel efficiency from rubber tires and the reduction of emissions from coal fired power plants; and our Ketjen business enhances the efficiency of natural resources through more usable products from a single barrel of oil, enables safer, greener production of alkylates used to produce more environmentally-friendly fuels, and reduced emissions through cleaner transportation fuels. We believe our disciplined cost reduction efforts and ongoing productivity improvements, among other factors, position us well to take advantage of strengthening economic conditions as they occur, while softening the negative impact of the current challenging global economic environment. \nThird Quarter 2025 \nDuring the third quarter of 2025:\n•\nOur net sales for the quarter were $1.3 billion; volumes grew by 6% year-over-year in total, driven by 8% growth in both Energy Storage and Ketjen; adjusted EBITDA improved 7% year-over-year, driven by Specialties.\n•\nOur cash flows from operations for the quarter were $355.6 million, up 57% from the prior-year period; cash flows from operations during the first nine months of 2025 were $893.8 million, an increase of 29% from the prior year.\n35\nTable of Contents\n•\nOur board of directors declared a quarterly dividend of $0.405 per share on July 22, 2025, which was paid on October 1, 2025 to common shareholders of record at the close of business as of September 12, 2025.\nOutlook\nThe current global business environment presents a diverse set of opportunities and challenges in the markets we serve. In particular, we believe that the global market for lithium battery and energy storage, particularly for electric vehicles (“EV”), remains strong, providing the opportunity to continue to develop high quality and innovative products while managing the high cost of expanding capacity. The other markets we serve continue to present various opportunities for value and growth as we have positioned ourselves to manage the impact on our business of changing global conditions, such as trade policies and tariffs, slow and uneven global growth, currency exchange volatility, crude oil price fluctuation, a dynamic pricing environment, an ever-changing landscape in electronics, the continuous need for cutting edge catalysts and technology by our refinery customers and increasingly stringent environmental standards. During the course of 2023, 2024 and through the first nine months of 2025, lithium index pricing dropped significantly. Amidst these dynamics, and despite recent downward lithium price pressure, we believe our long-term business fundamentals are sound and that we are strategically well-positioned as we remain focused on increasing sales volumes, optimizing and improving the value of our portfolio primarily through pricing and product development, managing costs and delivering value to our customers and shareholders. We believe that our businesses remain well-positioned to capitalize on new business opportunities and long-term trends driving growth within our end markets and to respond quickly to changes in economic conditions in these markets.\nIn order to optimize our cost structure and strengthen our financial flexibility, we have taken proactive actions, including certain restructuring activities and reducing planned capital expenditures. As part of these actions, we announced a new operating structure, effective November 1, 2024, that transitioned from two core global business units to a fully integrated functional model (excluding Ketjen) designed to increase agility, deliver significant cost savings and maintain long-term competitiveness. We continue to report results across our three existing operating segments of Energy Storage, Specialties and Ketjen. If lithium index pricing trends further downward or remains at low levels for an extended time, we may need to take additional measures to support growth and financial flexibility, including further restructuring actions.\nThe Company continues to monitor the potential impact of tariffs proposed or imposed by the U.S. and internationally. At this time we do not expect a material, direct impact to our financial statements from the tariffs announced to date. The potential direct exposure of the Energy Storage segment to proposed or imposed tariffs is expected to be minimal as most of our China production is sold into China or other Asian countries, and some critical materials are fully or partially exempt from tariffs in their currently proposed form. While there may be an impact to the Specialties and Ketjen businesses, we do not expect it to be material due to our global footprint and planned mitigation actions. In July 2025, legislation commonly known as the “One Big Beautiful Bill Act” was signed into law. Among other potential impacts, this bill included a number of tax provisions including extending existing provisions that were set to expire, substantive changes in international tax rules, and the repeal or phase outs of certain energy tax credits. We are evaluating the impacts of this legislation on our financial statements. In addition, relating to the current situation in the Middle East, our business operations have continued as normal with some shipping and raw material delays. We are monitoring the situation and will continue to make efforts to protect the safety of our employees and the health of our business.\nEnergy Storage: \nWe expect Energy Storage net sales and profitability to decrease year-over-year in 2025 as lithium market prices are at lower levels compared to 2024. Because many of our contracts are index-referenced and variable-priced, our business is generally aligned with changes in market and index pricing. As a result, increases or further decreases in lithium market pricing could have a material impact on our results. We expect sales volume to be higher than prior year as a result of record integrated production, strong spodumene sales and reduced inventory. We could record inventory valuation charges in 2025 if lithium prices continue to deteriorate during the projected period of conversion and sale. Global EV sales are expected to continue to increase over the prior year, driving continued demand for lithium batteries.\nAs part of the above-mentioned actions to optimize our cost structure and strengthen our financial flexibility, we have stopped construction of the Kemerton Trains 3 and 4. In addition, we have put Kemerton Train 2 and the Chengdu, China conversion facilities into care and maintenance. Kemerton Train 1 will continue to operate and activity around it is currently focused on commercialization efforts. Production from the Chengdu site has been transferred to another processing facility in China.\nOn a longer-term basis, we believe that demand for lithium will continue to grow as new lithium applications advance and the use of plug-in hybrid EVs and full battery EVs increases. This demand for lithium is supported by a favorable backdrop of steadily declining lithium-ion battery costs, increasing battery performance, continuing significant investments in the battery and EV supply chain by cathode and battery producers and automotive OEMs and favorable global public policy toward e-mobility/renewable energy usage. Our outlook is also bolstered by long-term supply agreements with key strategic customers, \n36\nTable of Contents\nreflecting our standing as a preferred global lithium partner, highlighted by our scale, access to geographically diverse, low-cost resources and long-term track record of reliability of supply and operating execution.\nSpecialties: \nWe expect both net sales and profitability to be higher in 2025 year-over-year as we recover from reduced customer demand in certain markets, including consumer and industrial electronics. In addition, we expect to maintain strong demand in other end-markets, such as pharmaceuticals, agriculture and oilfield services.\nOn a longer-term basis, we continue to believe that improving global standards of living, widespread digitization, increasing demand for data management capacity and the potential for increasingly stringent fire safety regulations in developing markets are likely to drive continued demand for fire safety, bromine and lithium specialties products. We are focused on profitably growing our globally competitive production networks to serve all major bromine and lithium specialties consuming products and markets. The combination of our solid, long-term business fundamentals, strong cost position, product innovations and effective management of raw material costs should enable us to manage our business through end-market challenges and to capitalize on opportunities that are expected with favorable market trends in select end markets.\nKetjen:\n Total Ketjen results in 2025 are expected to increase year-over-year due to favorable fluidized catalytic cracking (“FCC”) volumes, partially offset by lower clean fuel technologies (“CFT”) volumes due to order timing. The FCC market is expected to remain stable. Hydroprocessing catalysts (“HPC”) demand is project-driven, based on the refineries taking turnarounds.\nOn a longer-term basis, we believe increased global demand for transportation fuels, new refinery start-ups, ongoing adoption of cleaner fuels and the continuous growth in chemical derivatives from petroleum products will be the primary drivers of growth in our Ketjen business. We believe delivering superior end-use performance continues to be the most effective way to create sustainable value in the refinery catalysts industry. We also believe our technologies continue to provide significant performance and financial benefits to refiners challenged to meet tighter regulations around the world.\nOn October 25, 2025, the Company signed a definitive agreement to divest the controlling ownership interest of its Refining Solutions business (as defined below) and will initially retain a 49% ownership interest upon completion of the transaction. The Refining Solutions business being divested is defined as the Company’s Ketjen reportable segment, excluding its PCS business and the Company’s 50% ownership interest in Eurecat S.A. In a separate transaction, on October 23, 2025, the Company signed a definitive agreement to divest its 50% ownership interest in Eurecat. The Company expects these transactions to be completed in the first half of 2026, subject to customary and regulatory closing conditions. The PCS business will continue to be operated by the Company following these transactions.\nCorporate:\n We continue to focus on cash generation, working capital management and process efficiencies. We expect our global effective tax rate will vary based on the locales in which income is actually earned and remains subject to potential volatility from changing legislation in the United States. In 2024, we took actions as part of an effort that will focus on preserving our world-class resource advantages, optimizing our global conversion network, improving our cost competitiveness and efficiency, reducing capital intensity and enhancing our financial flexibility. As part of these measures, we stopped construction or deferred spending on certain capital projects, such as the Kemerton conversion plant noted above. In addition, we will incur severance and other restructuring charges associated with the Company’s transition to a new fully integrated functional operating model.\nFrom time to time, we may evaluate the merits of any opportunities that may arise for acquisitions or other business development activities that will complement our business footprint. Additional information regarding our products, markets and financial performance is provided at our website, \nwww.albemarle.com\n. Our website is not a part of this document nor is it incorporated herein by reference.\nResults of Operations\nThe following data and discussion provides an analysis of certain significant factors affecting our results of operations during the periods included in the accompanying consolidated statements of loss. Certain percentage changes are considered not meaningful (“NM”).\n37\nTable of Contents\nThird Quarter 2025 Compared to Third Quarter 2024 \nNet Sales\nIn thousands\nQ3 2025\nQ3 2024\n$ Change\n% Change\nNet sales\n$\n1,307,829 \n$\n1,354,692 \n$\n(46,863)\n(3)\n%\n•\n$131.7 million decrease primarily attributable to lower lithium carbonate and hydroxide market pricing in Energy Storage\n•\n$75.7 million increase primarily attributable to higher sales volume in Energy Storage and Ketjen\n•\n$9.2 million of favorable currency translation resulting from the weaker U.S. Dollar against various currencies\nGross Profit (Loss)\nIn thousands\nQ3 2025\nQ3 2024\n$ Change\n% Change\nGross profit (loss)\n$\n117,610 \n$\n(104,034)\n$\n221,644 \nNM\nGross profit (loss) margin\n9.0 \n%\n(7.7)\n%\n•\nLower average input costs, driven by lower lithium market pricing dynamics in Energy Storage. The lower cost of goods sold of spodumene purchased from Windfield is offset in the equity in net income of unconsolidated investments in the period the converted inventory is sold to third-party customers\n•\nHigher sales volume primarily attributable to Energy Storage and Ketjen\n•\nFavorable currency exchange impacts resulting from the weaker U.S. Dollar against various currencies\nSelling, General and Administrative (“SG&A”) Expenses\nIn thousands\nQ3 2025\nQ3 2024\n$ Change\n% Change\nSelling, general and administrative expenses\n$\n138,577 \n$\n154,253 \n$\n(15,676)\n(10)\n%\nPercentage of Net sales\n10.6 \n%\n11.4 \n%\n•\nReduced expenses as part of cost reduction efforts, including compensation costs, outside services and travel and entertainment costs\nGoodwill Impairment Charges\nIn thousands\nQ3 2025\nQ3 2024\n$ Change\n% Change\nGoodwill impairment charges\n$\n181,070 \n$\n— \n$\n181,070 \nNM\n•\nNon-cash goodwill impairment charge recorded in 2025 representing the full value of goodwill associated with the Refining Solutions reporting unit within the Ketjen segment, following the signing of a definitive agreement to divest the controlling ownership interest in its Refining Solutions business\nRestructuring Charges and Asset Write-Offs\nIn thousands\nQ3 2025\nQ3 2024\n$ Change\n% Change\nRestructuring charges and asset write-offs\n$\n2,275 \n$\n828,146 \n$\n(825,871)\n(100)\n%\n•\n2025 primarily included adjustments to contract cancellation costs with key suppliers and costs to put Kemerton Train 2 into care and maintenance as part of the restructuring plan\n•\n2024 included capital project asset write-offs and associated contract cancellation costs for our Kemerton facility, and severance and employee benefit costs at Corporate and each of the segments\nResearch and Development Expenses\nIn thousands\nQ3 2025\nQ3 2024\n$ Change\n% Change\nResearch and development expenses\n$\n12,674 \n$\n22,397 \n$\n(9,723)\n(43)\n%\nPercentage of Net sales\n1.0 \n%\n1.7 \n%\n•\nReduction primarily driven by lower research and development spending in Specialties and Energy Storage as part of cost reduction efforts\n38\nTable of Contents\nInterest and Financing Expenses\nIn thousands\nQ3 2025\nQ3 2024\n$ Change\n% Change\nInterest and financing expenses\n$\n(50,959)\n$\n(47,760)\n$\n(3,199)\n7 \n%\n•\nLower capitalized interest in 2025 resulting from stopping construction of Kemerton Trains 3 and 4 and other projects, as well as the overall reduction of capital expenditure spending\nOther Income (Expenses), Net\nIn thousands\nQ3 2025\nQ3 2024\n$ Change\n% Change\nOther income (expenses), net\n$\n28,799 \n$\n(22,256)\n$\n51,055 \nNM\n•\n$51.7 million increase attributable to foreign exchange impacts from lower losses recorded in 2025. Foreign exchange impact in 2024 includes a loss of $16.2 million due to the reclass from accumulated other comprehensive loss related to the dedesignation of cash flow hedge.\n•\n$7.2 million decrease attributable to interest income from lower interest rates in 2025\n•\n2025 included a gain of $8.0 million related to the fair market value adjustment of equity securities in public companies compared to $5.0 million of losses for similar fair value adjustments in 2024\nIncome Tax (Benefit) Expense\nIn thousands\nQ3 2025\nQ3 2024\n$ Change\n% Change\nIncome tax (benefit) expense\n$\n(30,565)\n$\n110,853 \n$\n(141,418)\nNM\nEffective income tax rate\n12.8 \n%\n(9.4)\n%\n•\nChange in 2025 primarily driven by the geographic mix of earnings, including the impact from the valuation allowance for losses in our consolidated Australian entities and certain China entities\n•\nThe goodwill impairment charge recorded during the 2025 was primarily non-deductible and resulted in a minimal income tax benefit\n•\n2024 included the impact from the valuation allowance for losses in our consolidated Australian entities and certain China entities\nEquity in Net Income of Unconsolidated Investments\nIn thousands\nQ3 2025\nQ3 2024\n$ Change\n% Change\nEquity in net income of unconsolidated investments\n$\n60,640 \n$\n229,058 \n$\n(168,418)\n(74)\n%\n•\nDecreased earnings primarily due to lower pricing from the Windfield joint venture. The impact of lower spodumene pricing driving the decrease in equity in net income of Windfield is offset in cost of goods sold as lower input costs\n•\n$13.9 million decrease attributable to unfavorable foreign exchange impacts from the Windfield joint venture\nNet Income Attributable to Noncontrolling Interests\nIn thousands\nQ3 2025\nQ3 2024\n$ Change\n% Change\nNet income attributable to noncontrolling interests\n$\n(12,753)\n$\n(8,351)\n$\n(4,402)\n53 \n%\n•\nIncrease in consolidated income related to our Jordan Bromine Company Limited (“JBC”) joint venture primarily due to increased sales volume, partially offset by lower pricing\n39\nTable of Contents\nNet Loss Attributable to Albemarle Corporation\nIn thousands\nQ3 2025\nQ3 2024\n$ Change\n% Change\nNet loss attributable to Albemarle Corporation\n$\n(160,694)\n$\n(1,068,992)\n$\n908,298 \n85 \n%\nPercentage of Net sales\n(12.3)\n%\n(78.9)\n%\nNet loss attributable to Albemarle Corporation common shareholders\n$\n(202,382)\n$\n(1,110,679)\n$\n908,297 \n82 \n%\nBasic loss per share attributable to common shareholders\n$\n(1.72)\n$\n(9.45)\n$\n7.73 \n82 \n%\nDiluted loss per share attributable to common shareholders\n$\n(1.72)\n$\n(9.45)\n$\n7.73 \n82 \n%\n•\nIncrease in 2025 results due to reasons noted above\n•\nNet loss attributable to Albemarle Corporation common shareholders includes reductions of $41.7 million for mandatory convertible preferred stock dividends in both 2025 and 2024\nOther Comprehensive (Loss) Income, Net of Tax\nIn thousands\nQ3 2025\nQ3 2024\n$ Change\n% Change\nOther comprehensive (loss) income, net of tax\n$\n(4,094)\n$\n167,939 \n$\n(172,033)\nNM\n•\nForeign currency translation and other\n$\n(3,987)\n$\n158,724 \n$\n(162,711)\nNM\n•\n2025 included unfavorable movements in the Taiwanese Dollar of approximately $5 million, the Japanese Yen of approximately $4 million and a net unfavorable variance in various other currencies of less than $1 million, partially offset by favorable movements in the Chinese Renminbi of approximately $4 million and the Euro of approximately $2 million \n•\n2024 included favorable movements in the Euro of approximately $153 million, the Japanese Yen of approximately $12 million, the Taiwanese Dollar of approximately $3 million and a net favorable variance in various other currencies of $4 million, partially offset by unfavorable movements in the Chinese Renminbi of approximately $12 million\n•\nCash flow hedge\n$\n(107)\n$\n9,215 \n$\n(9,322)\nNM\nSegment Information Overview.\n \nWe have identified three reportable segments according to the nature and economic characteristics of our products as well as the manner in which the information is used internally by the Company’s chief operating decision maker to evaluate performance and make resource allocation decisions. Our reportable business segments consist of: (1) Energy Storage, (2) Specialties and (3) Ketjen.\nThe Corporate category is not considered to be a segment and includes corporate-related items not allocated to the operating segments. Pension and OPEB service cost (which represents the benefits earned by active employees during the period) and amortization of prior service cost or benefit are allocated to the reportable segments and Corporate, whereas the remaining components of pension and OPEB benefits cost or credit (“Non-operating pension and OPEB items”) are included in Corporate. Segment data includes intersegment transfers of raw materials at cost and allocations for certain corporate costs.\nOur chief operating decision maker (“CODM”) assesses the ongoing performance of the Company’s business segments and allocates resources by considering the variance in the actual results to the forecasts on a monthly basis. The annual operating budget and ongoing forecasting process use adjusted EBITDA as a key metric in assessing the segments performance. In addition, the CODM uses adjusted EBITDA for business and enterprise planning purposes and as a significant component in the calculation of performance-based compensation for management and other employees. The Company’s definition of adjusted EBITDA is earnings before interest and financing expenses, income tax expenses, the proportionate share of Windfield income tax expense, depreciation and amortization, as adjusted on a consistent basis for certain non-operating, non-recurring or unusual items on a segment basis. These non-operating, non-recurring or unusual items may include acquisition and integration related costs, gains or losses on sales of businesses, restructuring charges and asset write-offs, facility divestiture charges, certain litigation and arbitration costs and charges, non-operating pension and OPEB items and other significant non-recurring items. This calculation is consistent with the definition of adjusted EBITDA used in the leverage financial covenant calculation in the Company’s credit agreement, which is a material agreement for the Company. Total adjusted EBITDA is a financial measure that is not required by, or presented in accordance with, the generally accepted accounting principles in the United States (“U.S. GAAP”). Total adjusted EBITDA should not be considered as an alternative to Net loss attributable to Albemarle Corporation, the most directly comparable financial measure calculated and reported in accordance with U.S. GAAP, or any other financial measure reported in accordance with U.S. GAAP.\n40\nTable of Contents\nThree Months Ended September 30,\nPercentage Change\n2025\n%\n2024\n%\n2025 vs 2024\n(In thousands, except percentages)\nNet sales:\nEnergy Storage\n$\n708,755 \n54.2 \n%\n$\n767,291 \n56.6 \n%\n(8)\n%\nSpecialties\n344,960 \n26.4 \n%\n342,376 \n25.3 \n%\n1 \n%\nKetjen\n254,114 \n19.4 \n%\n245,025 \n18.1 \n%\n4 \n%\nTotal net sales\n$\n1,307,829 \n100.0 \n%\n$\n1,354,692 \n100.0 \n%\n(3)\n%\nAdjusted EBITDA:\nEnergy Storage\n$\n124,077 \n55.0 \n%\n$\n142,887 \n67.5 \n%\n(13)\n%\nSpecialties\n75,544 \n33.5 \n%\n56,273 \n26.6 \n%\n34 \n%\nKetjen\n33,566 \n14.9 \n%\n35,473 \n16.8 \n%\n(5)\n%\nTotal segment adjusted EBITDA\n233,187 \n103.4 \n%\n234,633 \n110.9 \n%\n(1)\n%\nCorporate\n(7,557)\n(3.4)\n%\n(23,135)\n(10.9)\n%\n(67)\n%\nTotal adjusted EBITDA\n$\n225,630 \n100.0 \n%\n$\n211,498 \n100.0 \n%\n7 \n%\nSee below for a reconciliation of total segment adjusted EBITDA to consolidated Net loss attributable to Albemarle Corporation, the most directly comparable financial measure calculated and reported in accordance with U.S. GAAP (in thousands):\nThree Months Ended\nSeptember 30,\n2025\n2024\nTotal segment adjusted EBITDA\n$\n233,187 \n$\n234,633 \nCorporate expenses, net\n(7,557)\n(23,135)\nDepreciation and amortization\n(164,483)\n(163,502)\nInterest and financing expenses\n(50,959)\n(47,760)\nIncome tax benefit (expense)\n30,565 \n(110,853)\nProportionate share of Windfield income tax expense\n(a)\n(20,023)\n(99,523)\nAcquisition and integration related costs\n(b)\n(1,883)\n(439)\nRestructuring charges and asset write-offs\n(c)\n(2,321)\n(860,864)\nGoodwill impairment charges\n(d)\n(181,070)\n— \nNon-operating pension and OPEB items\n(367)\n331 \nGain (loss) in fair value of public equity securities\n(e)\n7,980 \n(4,983)\nOther\n(f)\n(3,763)\n7,103 \nNet loss attributable to Albemarle Corporation\n$\n(160,694)\n$\n(1,068,992)\n(a)\nAlbemarle’s 49% ownership interest in the reported income tax expense of the Windfield joint venture.\n(b)\nCosts related to the acquisition, integration and potential divestitures for various significant projects, recorded in SG&A.\n(c)\nSee Note 9, “Restructuring Charges and Asset Write-offs,” to the Notes to the Condensed Consolidated Financial Statements in this Quarterly Report on Form 10-Q for further details.\n(d)\nSee Note \n4\n, “Goodwill and Other Intangibles,” to the Notes to the Condensed Consolidated Financial Statements in this Quarterly Report on Form 10-Q for further details.\n(e)\nRepresents the net change in fair value of investments in public equity securities for the three-month periods ended September 30, 2025 and 2024, recorded in Other income (expenses), net.\n(f)\nIncluded amounts for the three months ended September 30, 2025 recorded in:\n•\nSG&A - $2.0 million of severance expenses not related to a restructuring plan, $1.4 million of expenses related to the redemption of preferred equity in a Grace subsidiary, $1.4 million related to the write-off of certain fixed assets and $1.3 million of expenses related to certain historical legal matters, partially offset by $1.9 million of gains from the sale of assets not part of our production operations.\n•\nOther income (expenses), net - $0.5 million gain resulting from the adjustment of indemnification related to a previously disposed business.\nIncluded amounts for the three months ended September 30, 2024 recorded in:\n•\nSG&A - $0.1 million of expenses related to certain historical legal matters.\n•\nOther income (expenses), net - $9.2 million of income from PIK dividends of preferred equity in a Grace subsidiary, partially offset by a $2.0 million loss resulting from the adjustment of indemnification related to a previously disposed business.\n41\nTable of Contents\nEnergy Storage\nIn thousands\nQ3 2025\nQ3 2024\n$ Change\n% Change\nNet sales\n$\n708,755 \n$\n767,291 \n$\n(58,536)\n(8)\n%\n•\n$119.0 million decrease attributable to unfavorable pricing impacts, primarily in battery- and tech-grade carbonate and hydroxide sold under index-referenced and variable-priced contracts\n•\n$58.1 million increase attributable to higher sales volume driven by customer demand, partially offset by reduced tolling volumes\n•\n$2.4 million increase attributable to favorable currency translation resulting from the weaker U.S. Dollar against various currencies\nAdjusted EBITDA\n$\n124,077 \n$\n142,887 \n$\n(18,810)\n(13)\n%\n•\nUnfavorable pricing impacts in lithium carbonate and hydroxide\n•\nDecreased equity earnings from lower pricing from the Windfield joint venture. The impact of lower spodumene pricing offsets lower input costs in cost of goods sold\n•\nSavings from designed restructuring and productivity improvements\n•\nDecreased commission expenses in Chile resulting from the lower pricing\nSpecialties\nIn thousands\nQ3 2025\nQ3 2024\n$ Change\n% Change\nNet sales\n$\n344,960 \n$\n342,376 \n$\n2,584 \n1 \n%\n•\nPricing was essentially flat with favorable pricing in bromine and derivatives, and flame retardants, offset by unfavorable pricing in lithium specialties\n•\n$2.2 million decrease attributable to lower sales volumes related to timing of sales\n•\n$4.7 million increase attributable to favorable currency translation resulting from the weaker U.S. Dollar against various currencies\nAdjusted EBITDA\n$\n75,544 \n$\n56,273 \n$\n19,271 \n34 \n%\n•\nLower input costs from raw materials\n•\nSavings from restructuring and productivity improvements\n•\nLower sales volume related to timing of sales\nKetjen\nIn thousands\nQ3 2025\nQ3 2024\n$ Change\n% Change\nNet sales\n$\n254,114 \n$\n245,025 \n$\n9,089 \n4 \n%\n•\n$19.8 million increase attributable to higher sales volume driven by FCC\n•\n$12.8 million decrease attributable to unfavorable pricing impacts, primarily in CFT and FCC\n•\n$2.1 million increase attributable to favorable currency translation resulting from the weaker U.S. Dollar against various currencies\nAdjusted EBITDA\n$\n33,566 \n$\n35,473 \n$\n(1,907)\n(5)\n%\n•\nUnfavorable pricing impacts\n•\nHigher sales volume driven by FCC\n•\nFavorable equity in earnings from unconsolidated investments in CFT\n•\n$1.6 million decrease attributable to unfavorable currency translation resulting from the stronger U.S. Dollar against various currencies\nCorporate\nIn thousands\nQ3 2025\nQ3 2024\n$ Change\n% Change\nAdjusted EBITDA\n$\n(7,557)\n$\n(23,135)\n$\n15,578 \n(67)\n%\n•\n$21.7 million increase attributable to favorable currency exchange impacts, net of a $13.9 million decrease in foreign exchange impacts from our Windfield joint venture\n•\nReduced expenses as part of cost reduction efforts, including compensation costs, outside services and travel and entertainment costs\n42\nTable of Contents\nFirst Nine Months 2025 Compared to First Nine Months 2024\nNet Sales\nIn thousands\nYTD 2025\nYTD 2024\n$ Change\n% Change\nNet sales\n$\n3,714,702 \n$\n4,145,813 \n$\n(431,111)\n(10)\n%\n•\n$654.5 million decrease primarily attributable to lower lithium carbonate and hydroxide market pricing in Energy Storage\n•\n$220.4 million increase attributable to higher sales volume in Energy Storage and Specialties\n•\n$3.0 million of favorable currency translation resulting from the weaker U.S. Dollar against various currencies\nGross Profit (Loss)\nIn thousands\nYTD 2025\nYTD 2024\n$ Change\n% Change\nGross profit (loss)\n$\n470,785 \n$\n(75,674)\n$\n546,459 \nNM\nGross profit (loss) margin\n12.7 \n%\n(1.8)\n%\n•\nLower average input costs, driven by lower lithium market pricing dynamics in Energy Storage. The lower cost of goods sold of spodumene purchased from Windfield is offset in the equity in net income of unconsolidated investments in the period the converted inventory is sold to third-party customers\n•\nHigher sales volume in Energy Storage and Specialties\n•\nFavorable currency exchange impacts resulting from the weaker U.S. Dollar against various currencies\nSelling, General and Administrative Expenses\nIn thousands\nYTD 2025\nYTD 2024\n$ Change\n% Change\nSelling, general and administrative expenses\n$\n394,536 \n$\n482,052 \n$\n(87,516)\n(18)\n%\nPercentage of Net sales\n10.6 \n%\n11.6 \n%\n•\nReduced expenses as part of cost reduction efforts, including compensation costs, outside services and travel and entertainment costs\n•\n$13.3 million of gains from the sale of assets not part of our production operations in 2025\n•\n$5.3 million of expenses related to certain historical legal and environmental matters in 2024\nGoodwill Impairment Charges\nIn thousands\nYTD 2025\nYTD 2024\n$ Change\n% Change\nGoodwill impairment charges\n$\n181,070 \n$\n— \n$\n181,070 \nNM\n•\nNon-cash goodwill impairment charge recorded in 2025 representing the full value of goodwill associated with the Refining Solutions reporting unit within the Ketjen segment, following the signing of a definitive agreement to divest the controlling ownership interest in its Refining Solutions business\nRestructuring Charges and Asset Write-Offs\nIn thousands\nYTD 2025\nYTD 2024\n$ Change\n% Change\nRestructuring charges and asset write-offs\n$\n5,660 \n$\n1,156,522 \n$\n(1,150,862)\n(100)\n%\n•\n2025 primarily included adjustments to contract cancellation costs with key suppliers and costs to put the Chengdu, China conversion facility and Kemerton Train 2 into care and maintenance as part of the restructuring plan. These costs were partially offset by proceeds for certain Kemerton equipment, and updated its estimates concerning the progress of construction activities and related contractual obligations, resulting in a favorable adjustment of asset write-offs\n•\n2024 included capital project asset write-offs and associated contract cancellation costs for our Kemerton facility and certain other projects, and severance and employee benefit costs at Corporate and each of the segments\nResearch and Development Expenses\nIn thousands\nYTD 2025\nYTD 2024\n$ Change\n% Change\nResearch and development expenses\n$\n39,217 \n$\n66,699 \n$\n(27,482)\n(41)\n%\nPercentage of Net sales\n1.1 \n%\n1.6 \n%\n•\nReduction primarily driven by lower research and development spending in Specialties and Energy Storage as part of cost reduction efforts\n43\nTable of Contents\nInterest and Financing Expenses\nIn thousands\nYTD 2025\nYTD 2024\n$ Change\n% Change\nInterest and financing expenses\n$\n(149,875)\n$\n(120,916)\n$\n(28,959)\n24 \n%\n•\nLower capitalized interest in 2025 resulting from stopping construction of Kemerton Trains 3 and 4 and other projects, as well as the overall reduction of capital expenditure spending\n•\nPartially offset by lower debt balances in 2025 with commercial paper outstanding during the first quarter of 2024\nOther Income, Net\nIn thousands\nYTD 2025\nYTD 2024\n$ Change\n% Change\nOther income, net\n$\n32,490 \n$\n61,311 \n$\n(28,821)\n(47)\n%\n•\n$38.0 million loss resulting from the redemption of preferred equity in a Grace subsidiary in 2025\n•\n$18.8 million decrease attributable to interest income from lower interest rates in 2025\n•\n$16.5 million decrease attributable to foreign exchange impacts from losses recorded in 2025 compared to gains recorded in 2024\n•\n2025 included gains of $3.1 million related to the fair market value adjustment of equity securities in public companies compared to $65.9 million of losses for similar fair value adjustments and sales of equity securities in 2024\n•\n$17.3 million gain in 2024 primarily from the sale of assets at a site not part of our operations\nIncome Tax (Benefit) Expense\nIn thousands\nYTD 2025\nYTD 2024\n$ Change\n% Change\nIncome tax (benefit) expense\n$\n(449)\n$\n76,472 \n$\n(76,921)\nNM\nEffective income tax rate\n0.2 \n%\n(4.2)\n%\n•\nChange in 2025 primarily driven by the geographic mix of earnings, including the impact from the valuation allowance for losses in our consolidated Australian entities and certain China entities\n•\nThe goodwill impairment charge recorded during the 2025 was primarily non-deductible and resulted in a minimal income tax benefit\n•\n2024 included the impact from the valuation allowance for losses in our consolidated Australian entities and certain entities in China\nEquity in Net Income of Unconsolidated Investments\nIn thousands\nYTD 2025\nYTD 2024\n$ Change\n% Change\nEquity in net income of unconsolidated investments\n$\n203,184 \n$\n696,436 \n$\n(493,252)\n(71)\n%\n•\nDecreased earnings primarily due to lower pricing from the Windfield joint venture. The impact of lower spodumene pricing driving the decrease in equity in net income of Windfield is offset above in cost of goods sold as lower input costs\n•\n$11.8 million increase attributable to favorable foreign exchange impacts from the Windfield joint venture\nNet Income Attributable to Noncontrolling Interests\nIn thousands\nYTD 2025\nYTD 2024\n$ Change\n% Change\nNet income attributable to noncontrolling interests\n$\n(32,999)\n$\n(34,154)\n$\n1,155 \n(3)\n%\n•\nDecrease in consolidated income related to our JBC joint venture primarily due to lower pricing\n44\nTable of Contents\nNet Loss Attributable to Albemarle Corporation\nIn thousands\nYTD 2025\nYTD 2024\n$ Change\n% Change\nNet loss attributable to Albemarle Corporation\n$\n(96,449)\n$\n(1,254,742)\n$\n1,158,293 \nNM\nPercentage of Net sales\n(2.6)\n%\n(30.3)\n%\nNet loss attributable to Albemarle Corporation common shareholders\n$\n(221,512)\n$\n(1,349,701)\n$\n1,128,189 \n84 \n%\nBasic loss per share\n$\n(1.88)\n$\n(11.49)\n$\n9.61 \n84 \n%\nDiluted loss per share\n$\n(1.88)\n$\n(11.49)\n$\n9.61 \n84 \n%\n•\nIncrease in 2025 results due to reasons noted above\n•\nNet loss attributable to Albemarle Corporation common shareholders includes reductions of $125.1 million and $95.0 million for mandatory convertible preferred stock dividends in 2025 and 2024, respectively\nOther Comprehensive Income, Net of Tax\nIn thousands\nYTD 2025\nYTD 2024\n$ Change\n% Change\nOther comprehensive income, net of tax\n$\n373,465 \n$\n58,925 \n$\n314,540 \nNM\n•\nForeign currency translation and other\n$\n373,786 \n$\n61,753 \n$\n312,033 \nNM\n•\n2025 included favorable movements in the Euro of approximately $342 million, the Taiwanese Dollar of approximately $9 million, the Chinese Renminbi of approximately $8 million, the Brazilian Real of approximately $7 million, the Japanese Yen of approximately $5 million and a net favorable variance in various other currencies of approximately $4 million\n•\n2024 included favorable movements in the Euro of approximately $79 million, partially offset by unfavorable movements in the Brazilian Real of approximately $8 million, the Chinese Renminbi of approximately $3 million, the Taiwanese Dollar of approximately $3 million and a net unfavorable variance in various other currencies of $4 million\n•\nCash flow hedge\n$\n(321)\n$\n(2,828)\n$\n2,507 \n(89)\n%\nSegment Information Overview.\n \nSummarized financial information concerning our reportable segments is shown in the following tables.\nNine Months Ended September 30,\nPercentage Change\n2025\n%\n2024\n%\n2025 vs 2024\n(In thousands, except percentages)\nNet sales:\nEnergy Storage\n$\n1,950,976 \n52.5 \n%\n$\n2,398,299 \n57.8 \n%\n(19)\n%\nSpecialties\n1,017,534 \n27.4 \n%\n993,041 \n24.0 \n%\n2 \n%\nKetjen\n746,192 \n20.1 \n%\n754,473 \n18.2 \n%\n(1)\n%\nTotal net sales\n$\n3,714,702 \n100.0 \n%\n$\n4,145,813 \n100.0 \n%\n(10)\n%\nAdjusted EBITDA:\nEnergy Storage\n$\n530,157 \n64.0 \n%\n$\n623,862 \n70.2 \n%\n(15)\n%\nSpecialties\n207,187 \n25.0 \n%\n155,629 \n17.5 \n%\n33 \n%\nKetjen\n100,721 \n12.1 \n%\n95,288 \n10.7 \n%\n6 \n%\nTotal segment adjusted EBITDA\n838,065 \n101.1 \n%\n874,779 \n98.4 \n%\n(4)\n%\nCorporate\n(8,816)\n(1.1)\n%\n14,315 \n1.6 \n%\nNM\nTotal adjusted EBITDA\n$\n829,249 \n100.0 \n%\n$\n889,094 \n100.0 \n%\n(7)\n%\nSee below for a reconciliation of total segment adjusted EBITDA to consolidated Net loss attributable to Albemarle Corporation, the most directly comparable financial measure calculated and reported in accordance with U.S. GAAP (in thousands):\n45\nTable of Contents\nNine Months Ended\nSeptember 30,\n2025\n2024\nTotal segment adjusted EBITDA\n$\n838,065 \n$\n874,779 \nCorporate expenses, net\n(8,816)\n14,315 \nDepreciation and amortization\n(494,968)\n(425,532)\nInterest and financing expenses\n(149,875)\n(120,916)\nIncome tax benefit (expense)\n449 \n(76,472)\nProportionate share of Windfield income tax expense\n(a)\n(78,499)\n(292,992)\nAcquisition and integration related costs\n(b)\n(5,091)\n(3,927)\nRestructuring charges and asset write-offs\n(c)\n(5,772)\n(1,194,614)\nGoodwill impairment charges\n(d)\n(181,070)\n— \nNon-operating pension and OPEB items\n(978)\n993 \nGain (loss) in fair value on public equity securities\n(e)\n3,144 \n(65,922)\nOther\n(f)\n(13,038)\n35,546 \nNet loss attributable to Albemarle Corporation\n$\n(96,449)\n$\n(1,254,742)\n(a)\nAlbemarle’s 49% ownership interest in the reported income tax expense of the Windfield joint venture.\n(b)\nCosts related to the acquisition, integration and potential divestitures for various significant projects, recorded in SG&A.\n(c)\nSee Note 9, “Restructuring Charges and Asset Write-offs,” to the Notes to the Condensed Consolidated Financial Statements in this Quarterly Report on Form 10-Q for further details.\n(d)\nSee Note \n4\n, “Goodwill and Other Intangibles,” to the Notes to the Condensed Consolidated Financial Statements in this Quarterly Report on Form 10-Q for further details.\n(e)\nLoss of $33.7 million recorded in Other income, net for the nine months ended September 30, 2024 resulting from the sale of investments in public equity securities and a gain (loss) of $3.1 million and ($32.2) million recorded in Other income, net for the nine months ended September 30, 2025 and 2024, respectively, resulting from the change in fair value of investments in public equity securities.\n(f)\nIncluded amounts for the nine months ended September 30, 2025 recorded in:\n•\nSG&A - $13.3 million of gains from the sale of assets not part of our production operations, partially offset by $3.8 million of severance expenses not related to a restructuring plan, $1.9 million of expenses related to certain historical legal matters, $1.4 million of expenses related to the redemption of preferred equity in a Grace subsidiary and $1.4 million related to the write-off of certain fixed assets.\n•\nOther income, net - $38.0 million loss resulting from the redemption of preferred equity in a Grace subsidiary and $1.9 million of charges for asset retirement obligations at a site not part of our operations, partially offset by $19.8 million of income from PIK dividends of the preferred equity in a Grace subsidiary prior to redemption and a $2.4 million gain primarily resulting from the adjustment of indemnification related to previously disposed businesses.\nIncluded amounts for the nine\n \nmonths ended September 30, 2024 recorded in:\n•\nCost of goods sold - $1.4 million of expenses related to non-routine labor and compensation related costs that are outside normal compensation arrangements.\n•\nSG&A - $5.3 million of expenses related to certain historical legal and environmental matters.\n•\nOther income, net - $26.8 million of income from PIK dividends of preferred equity in a Grace subsidiary, a $17.3 million gain primarily from the sale of assets at a site not part of our operations, a $0.6 million gain from an updated cost estimate of an environmental reserve at a site not part of our operations and a $0.4 million net gain primarily resulting from the adjustment of indemnification related to previously disposed businesses, partially offset by $2.9 million of charges for asset retirement obligations at a site not part of our operations.\n46\nTable of Contents\nEnergy Storage\nIn thousands\nYTD 2025\nYTD 2024\n$ Change\n% Change\nNet sales\n$\n1,950,976 \n$\n2,398,299 \n$\n(447,323)\n(19)\n%\n•\n$627.4 million decrease attributable to unfavorable pricing impacts, primarily in battery- and tech-grade carbonate and hydroxide sold under index-referenced and variable-priced contracts\n•\n$181.1 million increase attributable to higher sales volume driven by customer demand\n•\n$1.0 million decrease attributable to unfavorable currency translation resulting from the stronger U.S. Dollar against various currencies\nAdjusted EBITDA\n$\n530,157 \n$\n623,862 \n$\n(93,705)\n(15)\n%\n•\nUnfavorable pricing impacts in lithium carbonate and hydroxide\n•\nDecreased equity earnings from lower pricing from the Windfield joint venture in Energy Storage. The impact of lower spodumene pricing offsets lower input costs in cost of goods sold\n•\nSavings from restructuring and productivity improvements\n•\nDecreased commission expenses in Chile resulting from the lower pricing\n•\n$8.8 million increase attributable to favorable currency translation resulting from the weaker U.S. Dollar against various currencies\nSpecialties\nIn thousands\nYTD 2025\nYTD 2024\n$ Change\n% Change\nNet sales\n$\n1,017,534 \n$\n993,041 \n$\n24,493 \n2 \n%\n•\n$50.9 million increase attributable to higher sales volume related to increased demand\n•\n$29.4 million decrease primarily attributable to unfavorable pricing impacts in lithium specialties, partially offset by favorable pricing in bromine and derivatives\n•\n$3.1 million increase attributable to favorable currency translation resulting from the weaker U.S. Dollar against various currencies\nAdjusted EBITDA\n$\n207,187 \n$\n155,629 \n$\n51,558 \n33 \n%\n•\nHigher sales volume related to increased demand\n•\nSavings from restructuring and productivity improvements\n•\nLower input costs from raw materials\n•\nUnfavorable pricing impacts\n•\n$2.0 million decrease attributable to unfavorable currency translation resulting from the stronger U.S. Dollar against various currencies\nKetjen\nIn thousands\nYTD 2025\nYTD 2024\n$ Change\n% Change\nNet sales\n$\n746,192 \n$\n754,473 \n$\n(8,281)\n(1)\n%\n•\n$11.6 million decrease attributable to lower sales volume, primarily in CFT\n•\n$2.3 million increase attributable to favorable pricing impacts, primarily in CFT and PCS\n•\n$1.0 million increase attributable to favorable currency translation resulting from the weaker U.S. Dollar against various currencies\nAdjusted EBITDA\n$\n100,721 \n$\n95,288 \n$\n5,433 \n6 \n%\n•\nFavorable pricing impacts driven by CFT and PCS\n•\nFavorable equity in earnings from unconsolidated investments in CFT\n•\n$2.6 million decrease attributable to unfavorable currency translation resulting from the stronger U.S. Dollar against various currencies\nCorporate\nIn thousands\nYTD 2025\nYTD 2024\n$ Change\n% Change\nAdjusted EBITDA\n$\n(8,816)\n$\n14,315 \n$\n(23,131)\nNM\n•\n$20.8 million decrease attributable to unfavorable currency exchange impacts, net of a $11.8 million increase in foreign exchange impacts from our Windfield joint venture\n•\nReduced expenses as part of cost reduction efforts, including compensation costs, outside services and travel and entertainment costs\n47\nTable of Contents\nFinancial Condition and Liquidity\nOverview\nThe principal uses of cash in our business generally have been capital investments and resource development costs, funding working capital, and service of debt. We also make contributions to our defined benefit pension plans, pay dividends to our shareholders and have the ability to repurchase shares of our common stock. Historically, cash to fund the needs of our business has been principally provided by cash from operations, debt financing and equity issuances.\nWe are continually focused on working capital efficiency particularly in the areas of accounts receivable, payables and inventory. We anticipate that cash on hand, cash provided by operating activities, proceeds from divestitures and borrowings will be sufficient to pay our operating expenses, satisfy debt service obligations, fund capital expenditures and other investing activities, fund pension contributions and pay dividends for the foreseeable future.\nCash Flow\nDuring the first nine months of 2025, cash on hand, cash provided by operations and $288.0 million received from the redemption of preferred equity funded $434.4 million of capital expenditures for plant, machinery and equipment, dividends to common shareholders of $142.9 million and dividends to mandatory convertible preferred shareholders of $125.1 million. Our operations provided $893.8 million of cash flows during the first nine months of 2025, as compared to $692.3 million for the first nine months of 2024. The change compared to prior year was primarily due to the receipt of an Energy Storage customer prepayment of $350 million during the first quarter of 2025 and increased earnings from Specialties and Ketjen, partially offset by a decrease in cash flows from working capital changes, lower dividends received from unconsolidated investments and decreased earnings from the Energy Storage segment, driven by lower lithium market prices. Net cash inflows from working capital changes in 2025 were primarily driven by lower accounts receivable from lower lithium prices. The lower lithium pricing drove a material increase in working capital changes in 2024 driving lower inventory, accounts receivable and payable balances. Overall, our cash and cash equivalents increased by $739.5 million to $1.9 billion at September 30, 2025 from $1.2 billion at December 31, 2024.\nCapital expenditures for the nine-month period ended September 30, 2025 of $434.4 million were primarily associated with plant, machinery and equipment. We expect our capital expenditures to be approximately $600 million in 2025, reflecting the announced new level of spending to unlock cash flow over the near term and generate long-term financial flexibility. The forecasted lower capital expenditures compared to prior years reflect reduced sustaining growth and capital spend, while continuing safety and critical maintenance expenditures.\nOn October 25, 2025, we signed a definitive agreement to divest the controlling ownership interest of our Refining Solutions business (as defined below) to ChemCat AcquisitionCo, LLC and contribute the remaining ownership interest to ChemCat Holdings, LP, a newly-formed limited partnership (“Holdco”). The Refining Solutions business being divested is defined as our Ketjen reportable segment, excluding its PCS business and our 50% ownership interest in Eurecat S.A. Following the completion of the transactions contemplated in the definitive agreement (collectively, the “Refining Solutions Business Transaction”), we will receive approximately $536 million in cash and will own 49% of the common units of Holdco. We expect the Refining Solutions Business Transaction to be completed in the first half of 2026, subject to customary and regulatory closing conditions.\nIn a separate transaction, on October 23, 2025, we entered into a definitive agreement to divest our 50% ownership interest in Eurecat S.A. for approximately €105 million (approximately $122 million using September 30, 2025 foreign exchange rates) in cash to Axens SA. We expect this transaction to be completed in the first half of 2026, subject to customary and regulatory closing conditions.\nUpon closing of both divestitures, we expect to receive an approximate total of $660 million in cash proceeds. We expect to use these proceeds for debt reduction and other general corporate purposes. As a result of entering into these definitive agreements, we recorded a non-cash goodwill impairment charge in the third quarter of 2025 of $181.1 million, representing the full value of goodwill associated with the Refining Solutions reporting unit as of September 30, 2025.  \nIn June 2025, the Company redeemed the preferred equity of a Grace subsidiary (originally issued as part of the proceeds from the sale of the FCS business in 2021) for an aggregate value of $307.4 million, comprised of $288.0 million in cash received in June 2025 for the redemption and $19.4 million in cash previously received for tax liabilities. Prior to its redemption, the preferred equity had a fair value of $326.0 million, which was reported in Investments in the consolidated balance sheets. Following the redemption, we recorded a loss of $38.0 million within Other income (expenses), net for the three-month and nine-month periods ended September 30, 2025, representing the difference between the cash received and the recorded fair value.\n48\nTable of Contents\nIn the normal course of business, amounts received from customers in advance of the Company’s satisfaction of its contractual performance obligations are recorded as deferred revenue, and are recognized within Net sales as the Company satisfies the related performance obligation. During the nine-month period ended September 30, 2025, the Company received $350 million from a customer for the delivery of specified amounts of spodumene and lithium salts over the next 5 years.\nBeginning in 2024, we took proactive actions to optimize our cost structure and strengthen our financial flexibility, including certain restructuring activities and reducing planned capital expenditures. As part of these actions, we transitioned to a new operating structure from two core global business units to a fully integrated functional model (excluding Ketjen), stopped construction of Kemerton Train 3 and 4, placed Kemerton Train 2 into care and maintenance, as well as deferred spending and investments in certain other capital projects. Additionally, as part of this restructuring plan, we placed the Chengdu, China conversion plant into care and maintenance during the first half of 2025. Since inception, we have recorded charges for these actions consisting of asset write-offs of $1.0 billion, severance and employee benefits of $72.3 million, contract cancellation costs of $63.6 million and other costs (primarily consisting of the reclassification of the related dedesignated cash flow hedge from Accumulated other comprehensive loss) of $44.1 million.\nNet current assets were $2.6 billion and $1.9 billion at September 30, 2025 and December 31, 2024, respectively. The increase is primarily due to an increased cash balance from the receipt of an Energy Storage customer prepayment of $350.0 million and $288.0 million from the redemption of the Grace preferred stock in 2025. Additional changes in the components of net current assets are primarily due to the timing of the sale of goods and other ordinary transactions leading up to the balance sheet dates. The additional changes are not the result of any policy changes by the Company, and do not reflect any change in either the quality of our net current assets or our expectation of success in converting net working capital to cash in the ordinary course of business.\nOn July 22, 2025, our board of directors declared a cash dividend of $0.405, which was paid on October 1, 2025 to shareholders of record at the close of business as of September 12, 2025.\nAt September 30, 2025 and December 31, 2024, our cash and cash equivalents included $1.0 billion and $833.7 million, respectively, held by our foreign subsidiaries. The majority of these foreign cash balances are associated with earnings that we have asserted are indefinitely reinvested and which we plan to use to support our continued growth plans outside the U.S. through funding of capital expenditures, acquisitions, research, operating expenses or other similar cash needs of our foreign operations. From time to time, we repatriate cash associated with earnings from our foreign subsidiaries to the U.S. for normal operating needs through intercompany dividends, but only from subsidiaries whose earnings we have not asserted to be indefinitely reinvested or whose earnings qualify as “previously taxed income” as defined by the Internal Revenue Code. During the first nine months of 2024, we repatriated $28.8 million of cash as part of these foreign earnings cash repatriation activities. There were no cash repatriations during the first nine months of 2025.\nWhile we continue to closely monitor our cash generation, working capital management and capital spending in light of continuing uncertainties in the global economy, we believe that we will continue to have the financial flexibility and capability to opportunistically fund future growth initiatives. Additionally, we anticipate that future capital spending, including business acquisitions and other cash outlays, should be financed primarily with cash flow provided by operations, cash on hand and additional issuances of debt or equity securities, as needed.\nLong-Term Debt\nWe currently have the following notes outstanding:\nIssue Month/Year\nPrincipal (in millions)\nInterest Rate\nInterest Payment Dates\nMaturity Date\nNovember 2019\n€377.1\n1.125%\nNovember 25\nNovember 25, 2025\nMay 2022\n(a)\n$650.0\n4.65%\nJune 1 and December 1\nJune 1, 2027\nNovember 2019\n€500.0\n1.625%\nNovember 25\nNovember 25, 2028\nNovember 2019\n(a)\n$171.6\n3.45%\nMay 15 and November 15\nNovember 15, 2029\nMay 2022\n(a)\n$600.0\n5.05%\nJune 1 and December 1\nJune 1, 2032\nNovember 2014\n(a)\n$350.0\n5.45%\nJune 1 and December 1\nDecember 1, 2044\nMay 2022\n(a)\n$450.0\n5.65%\nJune 1 and December 1\nJune 1, 2052\n(a)    Denotes senior notes.\nOur senior notes are senior unsecured obligations and rank equally with all our other senior unsecured indebtedness from time to time outstanding. The notes are effectively subordinated to all of our existing or future secured indebtedness and to the \n49\nTable of Contents\nexisting and future indebtedness of our subsidiaries. As is customary for such long-term debt instruments, each series of notes outstanding has terms that allow us to redeem the notes before maturity, in whole at any time or in part from time to time, at a redemption price equal to the greater of (i) 100% of the principal amount of these notes to be redeemed, or (ii) the sum of the present values of the remaining scheduled payments of principal and interest thereon (exclusive of interest accrued to the date of redemption) discounted to the redemption date on a semi-annual basis using the comparable government rate (as defined in the indentures governing these notes) plus between 25 and 40 basis points, depending on the series of notes, plus, in each case, accrued interest thereon to the date of redemption. Holders may require us to purchase such notes at 101% upon a change of control triggering event, as defined in the indentures. These notes are subject to typical events of default, including bankruptcy and insolvency events, nonpayment and the acceleration of certain subsidiary indebtedness of $40 million or more caused by a nonpayment default.\nOur Euro notes issued in 2019 are unsecured and unsubordinated obligations and rank equally in right of payment to all our other unsecured senior obligations. The Euro notes are effectively subordinated to all of our existing or future secured indebtedness and to the existing and future indebtedness of our subsidiaries. As is customary for such long-term debt instruments, each series of notes outstanding has terms that allow us to redeem the notes before their maturity, in whole at any time or in part from time to time, at a redemption price equal to the greater of (i) 100% of the principal amount of the notes to be redeemed and (ii) the sum of the present values of the remaining scheduled payments of principal thereof and interest thereon (exclusive of interest accrued to, but excluding, the date of redemption) discounted to the redemption date on an annual basis using the bond rate (as defined in the indentures governing these notes) plus between 25 and 35 basis points, depending on the series of notes, plus, in each case, accrued and unpaid interest on the principal amount being redeemed to, but excluding, the date of redemption. Holders may require us to purchase such notes at 101% upon a change of control triggering event, as defined in the indentures. These notes are subject to typical events of default, including bankruptcy and insolvency events, nonpayment and the acceleration of certain subsidiary indebtedness exceeding $100 million caused by a nonpayment default.\nGiven economic conditions, specifically around the market pricing of lithium, and the related impact on the Company’s earnings, on October 31, 2024, we further amended the 2022 Credit Agreement, which provides for borrowings of up to $1.5 billion and matures on October 28, 2027. Borrowings under the 2022 Credit Agreement bear interest at variable rates based on a benchmark rate depending on the currency in which the loans are denominated, plus an applicable margin which ranges from 0.910% to 1.375%, depending on the Company’s credit rating from Standard & Poor’s Ratings Services LLC, Moody’s Investors Services, Inc. and Fitch Ratings, Inc. With respect to loans denominated in U.S. dollars, interest is calculated using the term Secured Overnight Financing Rate (“SOFR”) plus a term SOFR adjustment of 0.10%, plus the applicable margin. The applicable margin on the facility was 1.20% as of September 30, 2025. As of September 30, 2025 there were no borrowings outstanding under the 2022 Credit Agreement.\nBorrowings under the 2022 Credit Agreement are conditioned upon satisfaction of certain customary conditions precedent, including the absence of defaults. The October 2024 amendment was entered into to modify the financial covenants under the 2022 Credit Agreement to avoid a potential covenant violation over the following 18 months given the market pricing of lithium. The amended 2022 Credit Agreement subjects the Company to two financial covenants, as well as customary affirmative and negative covenants. The amended first financial covenant requires that the ratio of (a) (i) the Company’s consolidated net funded debt plus a proportionate amount of Windfield’s net funded debt less (ii) the Company’s unrestricted cash and cash equivalents plus a proportionate amount of Windfield’s unrestricted cash and cash equivalents (up to a specified amount) to (b) consolidated Windfield-Adjusted EBITDA (as such terms are defined in the 2022 Credit Agreement) be less than or equal to (i) 5.50:1.0 as of the end of the third quarter of 2025, (ii) 5.00:1.0 as of the end of fourth quarter of 2025, (iii) 4.75:1.0 as of  the end of each of first and second quarter of 2026, and (iv) 3.50:1.0 as of the end of the third quarter of 2026 and each fiscal quarter thereafter through the third quarter of 2027. The maximum permitted leverage ratios described above are subject to adjustment in accordance with the terms of the 2022 Credit Agreement upon the consummation of an acquisition after June 30, 2026 if the consideration includes cash proceeds from the issuance of funded debt in excess of $500 million.\nBeginning in the fourth quarter of 2024, the amended second financial covenant requires that the ratio of the Company’s consolidated EBITDA to consolidated interest charges (as such terms are defined in the 2022 Credit Agreement) be no less than (i) 2.00:1 for the third quarter of 2025, (ii) 2.50:1 for the fourth quarter of 2025, and (iii) 3.00:1.0 for all fiscal quarters thereafter. The 2022 Credit Agreement also contains customary default provisions, including defaults for non-payment, breach of representations and warranties, insolvency, non-performance of covenants and cross-defaults to other material indebtedness. The occurrence of an event of default under the 2022 Credit Agreement could result in all loans and other obligations becoming immediately due and payable and the commitments under the 2022 Credit Agreement being terminated. Following the $2.2 billion issuance of mandatory convertible preferred stock in March 2024 and the amendments to the financial covenants, the Company expects to maintain compliance with the amended financial covenants in the near future. However, a significant downturn in lithium market prices or demand could impact the Company’s ability to maintain compliance with its amended financial covenants and it could require the Company to seek additional amendments to the 2022 Credit Agreement and/or issue debt or equity securities to fund its activities and maintain financial flexibility. If the Company were unable to obtain such \n50\nTable of Contents\nnecessary additional amendments, this could lead to an event of default and its lenders could require the Company to repay its outstanding debt. In that situation, the Company may not be able to raise sufficient debt or equity capital, or divest assets, to refinance or repay the lenders.\nOn May 29, 2013, we entered into agreements to initiate a commercial paper program on a private placement basis under which we may issue unsecured commercial paper notes (the “Commercial Paper Notes”) from time-to-time. The maximum aggregate face amount of Commercial Paper Notes outstanding at any time is $1.5 billion, with none outstanding as of September 30, 2025.\nIn the second quarter of 2023, the Company received a loan of $300.0 million to be repaid in five equal annual installments beginning on December 31, 2026. This interest-free loan was discounted using an imputed interest rate of 5.5% and the Company will amortize that discount through Interest and financing expenses over the term of the loan.\nWhen constructing new facilities or making major enhancements to existing facilities, we may have the opportunity to enter into incentive agreements with local government agencies in order to reduce certain state and local tax expenditures. Under these agreements, we transfer the related assets to various local government entities and receive bonds. We immediately lease the facilities from the local government entities and have an option to repurchase the facilities for a nominal amount upon tendering the bonds to the local government entities at various predetermined dates. The bonds and the associated obligations for the leases of the facilities offset, and the underlying assets are recorded in property, plant and equipment. We currently have the ability to transfer up to $540 million in assets under these arrangements. At September 30, 2025 and December 31, 2024 there were $159.4 million and $74.5 million, respectively, of bonds outstanding under these arrangements.\nThe non-current portion of our long-term debt amounted to $3.2 billion at September 30, 2025, compared to $3.1 billion at December 31, 2024. In addition, at September 30, 2025, we had the ability to borrow $1.5 billion under our commercial paper program and the 2022 Credit Agreement, and $106.5 million under other existing credit lines, subject to various financial covenants under the 2022 Credit Agreement. We have the ability and intent to refinance our borrowings under our other existing credit lines with borrowings under the 2022 Credit Agreement, as applicable. Therefore, the amounts outstanding under those credit lines, if any, are classified as long-term debt. We believe that at September 30, 2025 we were, and currently are, in compliance with all of our debt covenants.\nOff-Balance Sheet Arrangements\nIn the ordinary course of business with customers, vendors and others, we have entered into off-balance sheet arrangements, including bank guarantees and letters of credit, which totaled approximately $91.9 million at September 30, 2025. None of these off-balance sheet arrangements has, or is likely to have, a material effect on our current or future financial condition, results of operations, liquidity or capital resources.\nOther Obligations\nOur contractual obligations have not significantly changed, based on our ordinary business activities and projected capital expenditures noted above, from the information we provided in our Annual Report on Form 10-K for the year ended December 31, 2024.\nTotal expected 2025 contributions to our domestic and foreign qualified and nonqualified pension plans, including the Albemarle Corporation Supplemental Executive Retirement Plan, are expected to approximate $17 million. We may choose to make additional pension contributions in excess of this amount. We have made contributions of $14.4 million to our domestic and foreign pension plans (both qualified and nonqualified) during the nine-month period ended September 30, 2025.\nThe liability related to uncertain tax positions, including interest and penalties, recorded in Other noncurrent liabilities totaled $254.7 million at September 30, 2025 and $259.6 million at December 31, 2024. Related assets for corresponding offsetting benefits recorded in Other assets totaled $75.9 million at September 30, 2025 and $74.8 million at December 31, 2024. We cannot estimate the amounts of any cash payments associated with these liabilities for the remainder of 2025 or the next twelve months, and we are unable to estimate the timing of any such cash payments in the future at this time. \nWe are subject to federal, state, local and foreign requirements regulating the handling, manufacture and use of materials (some of which may be classified as hazardous or toxic by one or more regulatory agencies), the discharge of materials into the environment and the protection of the environment. To our knowledge, we are currently complying, and expect to continue to comply, in all material respects with applicable environmental laws, regulations, statutes and ordinances. Compliance with existing federal, state, local and foreign environmental protection laws is not expected to have a material effect on capital expenditures, earnings or our competitive position, but the costs associated with increased legal or regulatory requirements could have an adverse effect on our operating results.\n51\nTable of Contents\nAmong other environmental requirements, we are subject to the federal Superfund law, and similar state laws, under which we may be designated as a potentially responsible party (“PRP”), and may be liable for a share of the costs associated with cleaning up various hazardous waste sites. Management believes that in cases in which we may have liability as a PRP, our liability for our share of cleanup is de minimis. Further, almost all such sites represent environmental issues that are quite mature and have been investigated, studied and in many cases settled. In de minimis situations, our policy generally is to negotiate a consent decree and to pay any apportioned settlement, enabling us to be effectively relieved of any further liability as a PRP, except for remote contingencies. In other than de minimis PRP matters, our records indicate that unresolved PRP exposures should be immaterial. We accrue and expense our proportionate share of PRP costs. Because management has been actively involved in evaluating environmental matters, we are able to conclude that the outstanding environmental liabilities for unresolved PRP sites should not have a material adverse effect upon our results of operations or financial condition.\nLiquidity Outlook\nWe generally use cash on hand and cash provided by operating activities, divestitures and borrowings to pay our operating expenses, satisfy debt service obligations, fund any capital expenditures, make acquisitions, make pension contributions and pay dividends. For example, as noted above, in the first half of 2026, we expect to close on two divestitures and receive approximately $660 million in cash proceeds to be used for debt reduction and other general corporate purposes. We also could issue additional debt or equity securities to fund these activities in an effort to maintain our financial flexibility. Our main focus in the short-term, during the continued uncertainty surrounding the global economy, including lithium market pricing and recent inflationary trends, is to continue to maintain financial flexibility by continuing our cost savings initiative, committing to shareholder returns and maintaining an investment grade rating. Over the next three years, in terms of uses of cash, we will focus on deleveraging, investing in growth of the businesses and returning value to shareholders. Additionally, we will continue to evaluate the merits of any opportunities that may arise for acquisitions of businesses or assets, which may require additional liquidity. Financing the purchase price of any such acquisitions could involve borrowing under existing or new credit facilities and/or the issuance of debt or equity securities, in addition to cash on hand. \nWe expect our capital expenditures to be approximately $600 million in 2025, down from $1.7 billion in 2024. Lower capital expenditures in 2025 reflects the announced new level of spending to unlock cash flow over the near term and generate long-term financial flexibility and is driven by reduced sustaining growth and capital spend, while continuing safety and critical maintenance expenditures.\nThe Company’s actions regarding Kemerton are part of a broader effort focused on preserving its world-class resource advantages, optimizing its global conversion network, improving the Company’s cost competitiveness and efficiency, reducing capital intensity and enhancing the Company’s financial flexibility. We have achieved our $400 million per year cost and productivity improvement target resulting from the comprehensive review of our cost and operating structure.\nIn the normal course of business, amounts received from customers in advance of the Company’s satisfaction of its contractual performance obligations are recorded as deferred revenue, and are recognized within Net sales as the Company satisfies the related performance obligation. In January 2025, the Company received $350 million from a customer for the delivery of specified amounts of spodumene and lithium salts over the next 5 years.\nWe are party to a master receivables purchase agreement, under which we may sell up to approximately $94 million of available and eligible outstanding customer accounts receivable generated by sales to certain customers. The agreement is uncommitted and can be terminated by us or the purchaser with certain notice as defined in the contract. Transactions under this agreement are accounted for as sales of accounts receivable, and the receivables sold are removed from the consolidated balance sheets at the time of the sales transaction. During the three-month and nine-month periods ended September 30, 2025, the Company sold and removed approximately $45.8 million and $106.6 million, respectively, of accounts receivable under this master receivables purchase agreement. The Company incurred approximately $0.2 million and $0.3 million, respectively, of fees associated with the master receivables purchase agreement during the three-month and nine-month periods ended September 30, 2025. Costs associated with the sales of receivables are reflected in the consolidated statements of loss for the periods in which the sales occur.\nIn 2022, we announced we had been awarded a nearly $150 million grant from the U.S. Department of Energy to expand domestic manufacturing of batteries for EVs and the electrical grid and for materials and components currently imported from other countries. The grant funding is intended to support a portion of the anticipated cost to construct a new, commercial-scale U.S.-based lithium concentrator facility at our Kings Mountain, North Carolina, location. We expect the concentrator facility to create hundreds of construction and full-time jobs and to produce approximately 420,000 tons of spodumene concentrate annually. To further support the restart of the Kings Mountain mine, in 2023, we announced a $90 million critical materials award from the U.S. Department of Defense. Since inception, the Company has received $24.3 million of these funds.\n52\nTable of Contents\nOur cash flows from operations may be negatively affected by adverse consequences to our customers and the markets in which we compete as a result of moderating global economic conditions, continuing inflationary trends and reduced capital availability. We have experienced, and may continue to experience, volatility and increases in the price of certain raw materials and in transportation and energy costs as a result of global market and supply chain disruptions and the broader inflationary environment. As a result, we are planning for various economic scenarios and actively monitoring our balance sheet to maintain the financial flexibility needed.\nAlthough we maintain business relationships with a diverse group of financial institutions as sources of financing, an adverse change in their credit standing could lead them to not honor their contractual credit commitments to us, decline funding under our existing but uncommitted lines of credit with them, not renew their extensions of credit or not provide new financing to us. While the global corporate bond and bank loan markets remain strong, periods of elevated uncertainty related to the stability of the banking system, future pandemics or global economic and/or geopolitical concerns may limit efficient access to such markets for extended periods of time. If such concerns heighten, we may incur increased borrowing costs and reduced credit capacity as our various credit facilities mature. If the U.S. Federal Reserve or similar national reserve banks in other countries decide to continue tightening the monetary supply, we may incur increased borrowing costs (as interest rates increase on our variable rate credit facilities, as our various credit facilities mature or as we refinance any maturing fixed rate debt obligations), although these cost increases would be partially offset by increased income rates on portions of our cash deposits.\nOverall, with generally strong cash-generative businesses we believe we have, and will be able to maintain, a solid liquidity position. We expect that cash on hand will be sufficient to repay our €377.1 principal amount of 1.125% senior notes due November 2025. We have no additional significant long-term debt maturities before 2027.\nWe had cash and cash equivalents totaling $1.9 billion at September 30, 2025, of which $1.0 billion is held by our foreign subsidiaries. This cash represents an important source of our liquidity and is invested in bank accounts or money market investments with no limitations on access. The cash held by our foreign subsidiaries is intended for use outside of the U.S. We anticipate that any needs for liquidity within the U.S. in excess of our cash held in the U.S. can be readily satisfied with borrowings under our existing U.S. credit facilities or our commercial paper program.\nGuarantor Financial Information\nAlbemarle Wodgina Pty Ltd Issued Notes\nAlbemarle Wodgina Pty Ltd (the “Issuer”), a wholly-owned subsidiary of Albemarle Corporation, issued $300.0 million aggregate principal amount of 3.45% Senior Notes due 2029 (the “3.45% Senior Notes”) in November 2019. The 3.45% Senior Notes are fully and unconditionally guaranteed (the “Guarantee”) on a senior unsecured basis by Albemarle Corporation (the “Parent Guarantor”). No direct or indirect subsidiaries of the Parent Guarantor guarantee the 3.45% Senior Notes (such subsidiaries are referred to as the “Non-Guarantors”).\nIn 2019, we completed the acquisition of a 60% interest in Wodgina in Western Australia and formed an unincorporated joint venture with MRL, named MARBL Lithium Joint Venture, for the exploration, development, mining, processing and production of lithium and other minerals (other than iron ore and tantalum) from the Wodgina spodumene mine and for the operation of the Kemerton assets in Western Australia. We participate in Wodgina through our ownership interest in the Issuer. On October 18, 2023 we amended the joint venture agreements, resulting in a decrease of our ownership interest in the MARBL joint venture and Wodgina to 50%.\nPrior to January 1, 2024, the Parent Guarantor conducted its U.S. Specialties and Ketjen operations directly, and conducted its other operations (other than operations conducted through the Issuer) through the Non-Guarantors. Effective January 1, 2024, the Company split its U.S. Ketjen operations to a separate non-guarantor subsidiary and its results are no longer included within the summarized Parent Guarantor and Issuer financial information below for the 2024 periods presented.\nThe 3.45% Senior Notes are the Issuer’s senior unsecured obligations and rank equally in right of payment to the senior indebtedness of the Issuer, effectively subordinated to all of the secured indebtedness of the Issuer, to the extent of the value of the assets securing that indebtedness, and structurally subordinated to all indebtedness and other liabilities of its subsidiaries. The Guarantee is the senior unsecured obligation of the Parent Guarantor and ranks equally in right of payment to the senior indebtedness of the Parent Guarantor, effectively subordinated to the secured debt of the Parent Guarantor to the extent of the value of the assets securing the indebtedness and structurally subordinated to all indebtedness and other liabilities of its subsidiaries.\nFor cash management purposes, the Parent Guarantor transfers cash among itself, the Issuer and the Non-Guarantors through intercompany financing arrangements, contributions or declaration of dividends between the respective parent and its subsidiaries. The transfer of cash under these activities facilitates the ability of the recipient to make specified third-party payments for principal and interest on the Issuer and/or the Parent Guarantor’s outstanding debt, common stock dividends and \n53\nTable of Contents\ncommon stock repurchases. There are no significant restrictions on the ability of the Issuer or the Parent Guarantor to obtain funds from subsidiaries by dividend or loan.\nThe following tables present summarized financial information for the Parent Guarantor and the Issuer on a combined basis after elimination of (i) intercompany transactions and balances among the Issuer and the Parent Guarantor and (ii) equity in earnings from and investments in any subsidiary that is a Non-Guarantor. Each entity in the combined financial information follows the same accounting policies as described herein and in our Annual Report on Form 10-K for the year ended December 31, 2024.\nSummarized Statement of Operations\n$ in thousands\nNine Months Ended\nSeptember 30, 2025\nYear Ended December 31, 2024\nNet sales\n(a)\n$\n550,756 \n$\n861,876 \nGross profit (loss)\n173,512 \n(66,144)\nLoss before income taxes and equity in net income of unconsolidated investments\n(b)\n(227,217)\n(593,433)\nNet loss attributable to the Parent Guarantor and the Issuer\n(239,870)\n(442,751)\n(a)    Includes net sales to Non-Guarantors of $313.5 million and $460.6 million for the nine months ended September 30, 2025 and year ended December 31, 2024, respectively.\n(b)    Includes intergroup expenses to Non-Guarantors of $10.8 million and $46.6 million for the nine months ended September 30, 2025 and year ended December 31, 2024, respectively.\nSummarized Balance Sheet\n$ in thousands\nSeptember 30, 2025\nDecember 31, 2024\nCurrent assets\n(a)\n$\n1,456,463 \n$\n921,221 \nNet property, plant and equipment\n1,931,530 \n2,005,613 \nOther noncurrent assets\n(b)\n2,471,232 \n2,912,866 \nCurrent liabilities\n(c)\n$\n2,887,961 \n$\n2,190,646 \nLong-term debt\n2,254,238 \n2,253,328 \nOther noncurrent liabilities\n(d)\n7,178,747 \n7,157,705 \n(a)    Includes receivables from Non-Guarantors of $429.9 million and $411.2 million at September 30, 2025 and December 31, 2024, respectively.\n(b)    Includes noncurrent receivables from Non-Guarantors of $2.1 billion and $2.3 billion at September 30, 2025 and December 31, 2024, respectively.\n(c)    Includes current payables to Non-Guarantors of $2.5 billion and $1.9 billion at September 30, 2025 and December 31, 2024, respectively.\n(d)    Includes noncurrent payables to Non-Guarantors of $6.8 billion and $6.8 billion at September 30, 2025 and December 31, 2024, respectively.    \nThe 3.45% Senior Notes are structurally subordinated to the indebtedness and other liabilities of the Non-Guarantors. The Non-Guarantors are separate and distinct legal entities and have no obligation, contingent or otherwise, to pay any amounts due pursuant to the 3.45% Senior Notes or the Indenture under which the 3.45% Senior Notes were issued, or to make any funds available therefor, whether by dividends, loans, distributions or other payments. Any right that the Parent Guarantor has to receive any assets of any of the Non-Guarantors upon the liquidation or reorganization of any Non-Guarantor, and the consequent rights of holders of the 3.45% Senior Notes to realize proceeds from the sale of any of a Non-Guarantor’s assets, would be effectively subordinated to the claims of such Non-Guarantor’s creditors, including trade creditors and holders of preferred equity interests, if any, of such Non-Guarantor. Accordingly, in the event of a bankruptcy, liquidation or reorganization of any of the Non-Guarantors, the Non-Guarantors will pay the holders of their debts, holders of preferred equity interests, if any, and their trade creditors before they will be able to distribute any of their assets to the Parent Guarantor. \nThe 3.45% Senior Notes are obligations of the Issuer. The Issuer’s cash flow and ability to make payments on the 3.45% Senior Notes could be dependent upon the earnings it derives from the production from MARBL for Wodgina. Absent income received from sales of its share of production from MARBL, the Issuer’s ability to service the 3.45% Senior Notes could be \n54\nTable of Contents\ndependent upon the earnings of the Parent Guarantor’s subsidiaries and other joint ventures and the payment of those earnings to the Issuer in the form of equity, loans or advances and through repayment of loans or advances from the Issuer.\nThe Issuer’s obligations in respect of MARBL are guaranteed by the Parent Guarantor. Further, under MARBL pursuant to a deed of cross security between the Issuer, the joint venture partner and the manager of the project (the “Manager”), each of the Issuer, and the joint venture partner have granted security to each other and the Manager for the obligations each of the Issuer and the joint venture partner have to each other and to the Manager. The claims of the joint venture partner, the Manager and other secured creditors of the Issuer will have priority as to the assets of the Issuer over the claims of holders of the 3.45% Senior Notes.\nAlbemarle Corporation Issued Notes\nIn March 2021, Albemarle New Holding GmbH (the “Subsidiary Guarantor”), a wholly-owned subsidiary of Albemarle Corporation, added a full and unconditional guarantee (the “Upstream Guarantee”) to all securities of Albemarle Corporation (the “Parent Issuer”) issued and outstanding as of such date and, subject to the terms of the applicable amendment or supplement, securities issuable by the Parent Issuer pursuant to the Indenture, dated as of January 20, 2005, as amended and supplemented from time to time (the “Indenture”). No other direct or indirect subsidiaries of the Parent Issuer guarantee these securities (such subsidiaries are referred to as the “Upstream Non-Guarantors”). See Long-term debt section above for a description of the securities issued by the Parent Issuer.\nThe current securities outstanding under the Indenture are the Parent Issuer’s unsecured and unsubordinated obligations and rank equally in right of payment with all other unsecured and unsubordinated indebtedness of the Parent Issuer.\n \nAll securities currently outstanding under the Indenture are effectively subordinated to the Parent Issuer’s existing and future secured indebtedness to the extent of the value of the assets securing that indebtedness. With respect to any series of securities issued under the Indenture that is subject to the Upstream Guarantee (which series of securities does not include the series of notes issued by the Company on May 13, 2022 in the aggregate principal amounts of $650.0 million, $600.0 million and $450.0 million (collectively, the “2022 Notes”)), the Upstream Guarantee is, and will be, an unsecured and unsubordinated obligation of the Subsidiary Guarantor, ranking pari passu with all other existing and future unsubordinated and unsecured indebtedness of the Subsidiary Guarantor.\n \nAll securities currently outstanding under the Indenture (other than the 2022 Notes) are effectively subordinated to all existing and future indebtedness and other liabilities of the Parent’s Subsidiaries other than the Subsidiary Guarantor.\n \nThe 2022 Notes are effectively subordinated to all existing and future indebtedness and other liabilities of the Parent’s Subsidiaries, including the Subsidiary Guarantor.\nFor cash management purposes, the Parent Issuer transfers cash among itself, the Subsidiary Guarantor and the Upstream Non-Guarantors through intercompany financing arrangements, contributions or declaration of dividends between the respective parent and its subsidiaries. The transfer of cash under these activities facilitates the ability of the recipient to make specified third-party payments for principal and interest on the Parent Issuer and/or the Subsidiary Guarantor’s outstanding debt, common stock dividends and common stock repurchases. There are no significant restrictions on the ability of the Parent Issuer or the Subsidiary Guarantor to obtain funds from subsidiaries by dividend or loan.\nThe following tables present summarized financial information for the Subsidiary Guarantor and the Parent Issuer on a combined basis after elimination of (i) intercompany transactions and balances among the Parent Issuer and the Subsidiary Guarantor and (ii) equity in earnings from and investments in any subsidiary that is an Upstream Non-Guarantor. Each entity in the combined financial information follows the same accounting policies as described herein and in the Company’s Annual Report on Form 10-K for the year ended December 31, 2024.\nSummarized Statement of Operations\n$ in thousands\nNine Months Ended\nSeptember 30, 2025\nYear Ended December 31, 2024\nNet sales\n(a)\n$\n398,339 \n$\n639,866 \nGross profit (loss)\n226,234 \n(12,059)\nLoss before income taxes and equity in net income of unconsolidated investments\n(b)\n(107,390)\n(400,246)\nIncome (loss) attributable to the Subsidiary Guarantor and the Parent Issuer\n(130,915)\n(353,248)\n(a)    Includes net sales to Non-Guarantors of $161.0 million and $238.6 million for the nine months ended September 30, 2025 and year ended December 31, 2024, respectively.\n(b)    Includes intergroup income to Non-Guarantors of $10.4 million and $148.3 million for the nine months ended September 30, 2025 and year ended December 31, 2024, respectively.\n55\nTable of Contents\nSummarized Balance Sheet\n$ in thousands\nSeptember 30, 2025\nDecember 31, 2024\nCurrent assets\n(a)\n$\n1,671,776 \n$\n1,104,082 \nNet property, plant and equipment\n780,406 \n800,913 \nOther non-current assets\n(b)\n1,608,816 \n2,188,306 \nCurrent liabilities\n(c)\n$\n3,278,758 \n$\n2,559,256 \nLong-term debt\n2,615,500 \n2,551,714 \nOther noncurrent liabilities\n(d)\n6,138,903 \n6,303,456 \n(a)    Includes receivables from Non-Guarantors of $687.7 million and $646.3 million at September 30, 2025 and December 31, 2024, respectively.\n(b)    Includes noncurrent receivables from Non-Guarantors of $1.2 billion and $1.6 billion at September 30, 2025 and December 31, 2024, respectively.\n(c)    Includes current payables to Non-Guarantors of $2.5 billion and $1.9 billion at September 30, 2025 and December 31, 2024, respectively.\n(d)    Includes noncurrent payables to Non-Guarantors of $5.8 billion and $6.0 billion at September 30, 2025 and December 31, 2024, respectively.\nThese securities are structurally subordinated to the indebtedness and other liabilities of the Upstream Non-Guarantors. The Upstream Non-Guarantors are separate and distinct legal entities and have no obligation, contingent or otherwise, to pay any amounts due pursuant to these securities or the Indenture under which these securities were issued, or to make any funds available therefor, whether by dividends, loans, distributions or other payments. Any right that the Subsidiary Guarantor has to receive any assets of any of the Upstream Non-Guarantors upon the liquidation or reorganization of any Upstream Non-Guarantors, and the consequent rights of holders of these securities to realize proceeds from the sale of any of an Upstream Non-Guarantor’s assets, would be effectively subordinated to the claims of such Upstream Non-Guarantor’s creditors, including trade creditors and holders of preferred equity interests, if any, of such Upstream Non-Guarantor. Accordingly, in the event of a bankruptcy, liquidation or reorganization of any of the Upstream Non-Guarantors, the Upstream Non-Guarantors will pay the holders of their debts, holders of preferred equity interests, if any, and their trade creditors before they will be able to distribute any of their assets to the Subsidiary Guarantor.\nSummary of \nCr\nitical Accounting Policies and Estimates\nThere have been no significant changes in our critical accounting policies and estimates from the information we provided in our Annual Report on Form 10-K for the year ended December 31, 2024.\nRecent Accounting Pronouncements\nFor a description of recent accounting pronouncements, see Item 1 Financial Statements – Note 19, “Recently Issued Accounting Pronouncements” to the Notes to the Condensed Consolidated Financial Statements in this Quarterly Report on Form 10-Q."
}