{
  "source_file": "algn-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2.        Management’s Discussion and Analysis of Financial Condition and Results of Operations.\nForward-Looking Statements\nIn addition to historical information, this Quarterly Report on Form 10-Q contains forward-looking statements within the meaning of Section 27A of the Securities Act of 1933 and Section 21E of the Securities Exchange Act of 1934, as amended (the “Exchange Act”). These statements include, among other things, our expectations and intentions regarding our strategic objectives, business strategy and growth drivers, and the means to achieve them; our beliefs and expectations regarding macroeconomic conditions, including fluctuations in currency exchange rates, higher interest rates, market volatility, threats or actual imposition of tariffs, customs duties and fees by nations and retaliatory actions, inflation, threats of or actual economic slowdowns or recessions, or trade wars and geopolitical tensions; our expectations and beliefs regarding customer and consumer confidence, purchasing behavior and demand for dental services and changes in consumer spending habits; our expectations regarding implemented or proposed tariffs and retaliatory actions or other trade restrictions or measures taken by the United States and other countries that have or could impact our products and product sales; our expectations regarding product mix, product launches, product pilots and product adoption; our expectations regarding competition and our ability to compete in our target markets; our expectations regarding the sales growth of our clear aligners, intraoral scanners and other products; our expectations regarding the impact of the military conflicts in Ukraine and the Middle East, including military actions in Israel and increased geopolitical tensions involving Taiwan and the South China Sea, on our employees, operations and assets, particularly in Israel and Russia; our ability to implement and realize the anticipated benefits currently expected from our restructuring plan initiated in the third quarter of 2025, as well as the anticipated expenses we will incur pursuant to the plan; our marketing and efforts to build our brand awareness; our estimates regarding the size and opportunities of our target markets along with our expectations for growth in those markets and potential collaboration opportunities; our beliefs regarding the general impact of technological innovation and on our particular solutions and products; our beliefs regarding digital dentistry and its potential to impact our business and transform dentistry; our intentions regarding expansion of our business and any impacts on our operational flexibility and responsiveness to customer demand; our expectations regarding our tax positions and the judgments we make related to our tax obligations; our beliefs regarding the importance of our manufacturing operations on our success; our beliefs regarding the need for and benefits of our technological development on Invisalign treatment, the areas of development in which we focus our efforts, and the advantages of our intellectual property portfolio; our expectations regarding the utilization rates for our products, including the impact of marketing on those rates and causes for periodic fluctuations of the rates; our expectations regarding the existence and impact of seasonality; our expectations regarding the continued expansion of our international markets and their growth; our expectations regarding impacts or staying in compliance with laws and regulations currently applicable to, or which may become applicable to, our business both in the United States and internationally; our beliefs regarding our culture and commitment and its impact on our financial and operational performance and its importance to our future success; our expectations for future investments in and benefits from sales and marketing activities; our preparedness and our customers’ preparedness to react to changing circumstances and demand; our expectations for our expenses and capital obligations and expenditures in particular; our intentions to control spending and for investments, our intentions regarding the investment of and ability to repatriate foreign earnings; our belief regarding the sufficiency of our cash and investment balances and borrowing capacity; our judgments regarding the estimates used in our revenue recognition and assessment of goodwill and intangible assets; our predicted level of operating expenses and gross margins and other factors beyond our control, as well as other statements regarding our future operations, financial condition and prospects and business strategies. \nThese statements may contain words such as “expects,” “anticipates,” “intends,” “plans,” “believes,” “estimates,” or other words indicating future results. These forward-looking statements are subject to certain risks and uncertainties that could cause actual results to differ materially from those reflected in the forward-looking statements. Factors that could cause or contribute to such differences include, but are not limited to, those discussed in Part I, Item 2 “Management’s Discussion and Analysis of Financial Condition and Results of Operations,” and in particular, the risks discussed below in Part II, Item 1A “Risk Factors.” We undertake no obligation to revise or update these forward-looking statements. Given these risks and uncertainties, readers are cautioned not to place undue reliance on such forward-looking statements.\nThe following discussion and analysis of our financial condition and results of operations should be read together with our Condensed Consolidated Financial Statements and related notes included elsewhere in this Quarterly Report on Form 10-Q and with our audited Consolidated Financial Statements included in our Annual Report on Form 10-K for the year ended December 31, 2024 as filed with the Securities and Exchange Commission (the “SEC”) on February 28, 2025.\nExecutive Overview of Results\nTrends and Uncertainties\n28 \nTable of Contents\nOur strategic priorities focus on four principal pillars for growth: (i) international expansion; (ii) general dental practitioners (“GP”) treatment; (iii) patient demand; and (iv) orthodontic utilization. Our growth strategy depends on our ability to facilitate the digital transformation of dentistry, our continuous focus on innovation, and expansion to meet and exceed evolving customer expectations as the array of products and services available to them increases. Below is a discussion of the significant trends and uncertainties that could impact our operations:\nMacroeconomic Challenges, Trade Impediments and Geopolitical Tensions \nOur revenues and other results of operations are susceptible to fluctuations resulting from various events and circumstances, including macroeconomic conditions, threats or actual or proposed tariffs, inflation, higher interest rates, customs duties and fees by nations and retaliatory actions, threats of or actual slowdowns or recessions, wages, debt obligations, discretionary income, fluctuations in foreign currency exchange rates, supply chain challenges, market volatility, employment levels, health insurance coverage, and other factors, each of which impacts customer confidence, consumer sentiment, discretionary spending and ultimately demand for dental services and our products. Moreover, we rely on the operations of the U.S. federal government to obtain and maintain necessary clearances or approvals for the offer, sale and delivery of our products, including from the Patent and Trademark Office, Food and Drug Administration, Customs and Border Protection, and similar agencies. A prolonged government shutdown or reductions in government personnel may impede our ability to sell or deliver our products which could have a material adverse effect on our business, financial condition and results of operations.\nMany of these factors also impact the availability of certain raw materials, parts and components used in our products as well as our costs and those of our suppliers through higher raw material prices, transportation costs, labor costs, supply and distribution operations. We believe that since the second quarter of 2025, sales of our products have been adversely impacted by certain macroeconomic conditions, including global tariff volatility, inflation, and higher interest rates, which we believe have and may continue to impede dental patient demand. For example, patient traffic growth has been uneven for many doctors, with orthodontic starts down for four consecutive years. We believe uncertainty not only impacts consumer purchasing decisions but also the decisions and recommendations that doctors make, especially doctors who offer both clear aligners and wires and brackets in their practices and have the additional time to treat patients with wires and brackets when orthodontic starts are slowing or diminishing. We believe this has resulted in an increase in orthodontic starts using wires and brackets in lieu of clear aligners that was more pronounced in the second quarter of 2025. However, we believe these trends are continuing and will impede future sales for so long as consumer economic uncertainty persists, particularly to the extent it impairs discretionary spending. We also anticipate the geopolitical conflicts involving Ukraine, the Middle East, China and other regions will continue to add to market uncertainties and dampen consumer sentiment and demand. \nMore directly, we believe government actions relating to actual or proposed tariffs and retaliatory actions in key strategic countries or regions, particularly in the United States, China, Europe, Brazil, Canada, Israel and Mexico may adversely impact our revenue and cost of goods sold. Additionally, the trade war and geopolitical tensions between the United States and China may result in the limitation or prohibition of the availability of certain raw materials, components and parts necessary for our products or the products of our suppliers. The degree of our exposure depends on, among other things, the type of goods subject to any tariffs or trade restrictions enacted, the tariff rates or limits imposed, the timing of the tariffs or restrictions and any other retaliatory measures enacted. The impact may vary by time and region, making operational results uncertain and difficult to predict. These events may also cause a shift in public opinion about companies based in the United States and this may have an adverse impact on our reputation and business. We continue to closely monitor the foregoing issues, assess their potential impact on our operations and financial results, and implement plans to seek to mitigate the impact of any adverse events.\nAdditionally, a material amount of our revenues are derived internationally and many of our international operations are denominated in currencies other than the U.S. dollar. In the third quarter of 2025, the U.S. dollar weakened against major currencies, which positively impacted our financial condition and results of operations for the quarter. Foreign exchange volatility and the subsequent strengthening or weakening of the U.S. dollar against other currencies remains uncertain and unpredictable.\nWe continue to monitor the potential for violence and military actions that may directly or indirectly impact our personnel, manufacturing, supply chain, and sales. For instance, the ongoing conflict in Ukraine and unstable environment in the Middle East, as well as increased geopolitical tensions involving Taiwan and the South China Sea may further exacerbate general and regional macroeconomic instability. This is particularly true if fighting erupts, intensifies, spreads to other locations, creates shipping and logistical challenges or cost increases, leads to sanctions or boycotts, or otherwise materially impacts our operations or consumer spending. Our iTero business is headquartered in Israel and, although the sales, delivery times and cost of shipping have not been materially impacted to date, the situation remains fluid. We have implemented contingency planning and business continuity measures to mitigate these risks, but it is uncertain whether further escalation could disrupt our operations. While there have been export and import restrictions imposed against products originating from and businesses operating in Israel, they have not materially impacted our sales or operations to date although we continue to monitor the risk.\n29 \nTable of Contents\n2025 Restructuring\nBeginning in in the third quarter of 2025 and continuing into the fourth quarter, we initiated a plan to realign certain business groups and reduce our global workforce in response to the current macroeconomic environment. We anticipate incurring between $40.0 million and $50.0 million in total restructuring expenses, primarily related to involuntary termination benefits, including employee severance and other post-employment benefits. The foregoing estimates that we anticipate incurring in connection with these actions are contingent upon various assumptions and actual results may differ. We may also incur additional costs not currently contemplated due to events related to or resulting from any such action. Our management or board of directors may determine not to pursue certain portions of any of these actions and any actions ultimately pursued may not achieve the benefits currently anticipated. For more information, see \nNote 15. \n“\nRestructuring and Other Charges\n”\n of the Notes to Condensed Consolidated Financial Statements\nChanging Product Preferences\nAs the markets for clear aligners and digital processes and workflows used to transform the practice of dentistry continue to mature, we anticipate customer and patient expectations and demands will continue to evolve. We expect to meet customer demands with innovative treatment options that include more choices to address a wider scope of treatment goals and budgets based on our existing and new products. This may result in larger and unpredictable variations in geographic and product mix and selling prices with uncertain implications on our financial statements and business operations. For example, we have and may continue to experience a shift from certain products with higher average selling prices (“ASP”) to those with lower ASPs. \nWe strive to manage the challenges presented by the foregoing trends and uncertainties, including the macroeconomic conditions, tariffs and retaliatory measures, military conflicts and the evolution of our target markets, by focusing on improving our operations, further increasing flexibility and efficiencies in our processes, adjusting our business models to changing circumstances and offering products that meet market demand. Specifically, we are managing financial impacts by implementing strategic product innovations, introductions and pricing actions, implementing cost saving measures, and evaluating hiring needs.\nFurther discussion of the impact of these challenges on our business may be found in Part II, Item 1A “Risk Factors.”\nKey Financial and Operating Metrics\nWe measure our performance against the foregoing strategic priorities by the achievement of key financial and operating metrics. For the three months ended September 30, 2025, our business operations reflect the following:\n•\nRevenues of $996 million, an increase of 1.8% year-over-year;\n•\nClear Aligner revenues of $806 million, an increase of 2.4% year-over-year; \n•\nClear Aligner case volume increased 4.9% year-over-year and Clear Aligner case volume for teens and growing patients increased from 236.3 thousand shipments to 256.0 thousand or 8.3% year-over-year; \n•\nImaging Systems and CAD/CAM services revenues of $190 million, a decrease of 0.6% year-over-year;\n•\nIncome from operations of $96 million and operating margin of 9.7%;\n•\nEffective tax rate of 40.1%;\n•\nNet income of $57 million with diluted net income per share of $0.78;\n•\nCash and cash equivalents of $1,005 million as of September 30, 2025;\n•\nCash provided by operating activities of $189 million;\n•\nCapital expenditures of $20 million, primarily related to investments in our manufacturing capacity and facilities; and\n•\nNumber of employees was 21,065 as of September 30, 2025, a decrease of 2.9% year-over-year. \nOther Statistical Data and Trends\n•\nAs of September 30, 2025, approximately 21 million people worldwide have been treated with our Invisalign system. \n•\nFor the third quarter of 2025, the total number of Invisalign trained doctors cases were shipped to (doctor submitters) was 88.2 thousand compared to 87.4 thousand in the third quarter of 2024, a 0.9% increase. \n30 \nTable of Contents\n•\nThe total utilization rate in the third quarter of 2025 increased to 7.3 cases per doctor compared to 7.1 cases per doctor in the third quarter of 2024.\n•\nClear aligner revenue per case shipment (clear aligner revenues divided by case shipments) decreased from $1,275 in the third quarter of 2024 to $1,245 in the third quarter of 2025, a 2.4% decrease. \n \nResults of Operations\nNet Revenues by Reportable Segment     \nWe group our \noperations into two reportable segments: Clear Aligner segment and Systems and Services segment. \n•\nOur Clear Aligner segment consists of Comprehensive Products, Non-Comprehensive Products and Non-Case revenues as defined below:\n▪\nComprehensive Products include, but are not limited to, Invisalign Comprehensive, Invisalign First and Invisalign Comprehensive 3in3.\n▪\nNon-Comprehensive Products include, but are not limited to, Invisalign Moderate, Lite and Express packages, Invisalign Go and Invisalign Go Plus and Invisalign Palatal Expander.\n▪\nIn the United States, Canada and EMEA, we also offer a Doctor Subscription Program which is our monthly subscription-based clear aligner program. The program allows doctors the flexibility to order retainers and low-stage “touch-up” clear aligners within their subscribed tier and is designed for a segment of experienced Invisalign trained doctors who are currently not regularly using our retainers or low-stage aligners. The low-stage aligners, the Touch up product, are included as a Non-Comprehensive Product.\n▪\nNon-Case revenues include, but are not limited to, retention products including retention aligners ordered through the Doctor Subscription Program, Invisalign training, adjusting tools used by dental professionals during the course of treatment and Invisalign Accessory Products that are complementary to our doctor-prescribed principal products such as aligner cases (clamshells), teeth whitening products, cleaning solutions (crystals, foam and other material) and other oral health products available in certain commerce channels in select markets.\n▪\nOur Systems and Services segment consists of sales related to our iTero intraoral scanning systems, which includes a single hardware platform and restorative or orthodontic software options, scanner wand upgrades, and non-system revenues from leases of scanner systems, sales of pre-owned scanner systems, subscription software, disposables, pay per scan services, as well as exocad\n’\ns CAD/CAM software solutions that integrate workflows to dental labs and dental practices.\nNet revenues for our Clear Aligner and Systems and Services segments for the three and nine months ended September 30, 2025 and 2024 are as follows (in millions)\n1\n:\n \nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\nNet Revenues\n2025\n2024\nChange\n2025\n2024\nChange\nClear Aligner net revenues\n$\n805.8 \n$\n786.8 \n$\n19.0 \n2.4 \n%\n$\n2,407.3 \n$\n2,435.8 \n$\n(28.6)\n(1.2)\n%\nSystems and Services net revenues\n189.9 \n191.0 \n(1.1)\n(0.6)\n%\n580.1 \n568.0 \n12.2 \n2.1 \n%\nTotal net revenues\n$\n995.7 \n$\n977.9 \n$\n17.8 \n1.8 \n%\n$\n2,987.4 \n$\n3,003.8 \n$\n(16.4)\n(0.5)\n%\nChanges and percentages are based on actual values. Certain tables may not sum or recalculate due to rounding. \n1\n Beginning with our quarterly report on Form 10-Q for the quarter ended March 31, 2025, we are no longer disclosing Clear Aligner net revenues for Americas, International and Non-case. Rather our disclosure will align with our Clear Aligner reportable segment in total.\nClear Aligner Case Volume\n31 \nTable of Contents\nCase volume data which represents Clear Aligner case shipments for the \nthree and nine\n months ended September 30, 2025 and 2024 is as follows (in thousands): \n \nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n2025\n2024\nChange\n2025\n2024\nChange\nTotal case volume\n647.8 \n617.2 \n30.5 \n4.9 \n%\n1,934.4 \n1,865.0 \n69.4 \n3.7 \n%\nChanges and percentages are based on actual values. Certain tables may not sum or recalculate due to rounding. \nFor the three months ended September 30, 2025, total net revenues increased by $18 million as compared to the same period in 2024, primarily due to an increase in Clear Aligner volume.\nFor the nine months ended September 30, 2025, total net revenues decreased by $16 million as compared to the same period in 2024, primarily driven by a decrease in Clear Aligner ASP, partially offset by an increase in Systems and Services net revenues primarily driven by strong scanner wand sales. \nClear Aligner \nFor the three months ended September 30, 2025, Clear Aligner net revenues increased by $19 million as compared to the same period in 2024, primarily due to an increase in volume and favorable foreign exchange rates, which increased net revenues by $35 million and $13 million, respectively. These increases were partially offset by a decrease in ASP, driven by a product mix shift to lower priced countries and products and higher discounts, resulting in a decrease of net revenues of $29 million.\nFor the nine months ended September 30, 2025, Clear Aligner net revenues decreased by $29 million as compared to the same period in 2024, primarily due to a decrease in ASP, driven by a product mix shift to lower priced products and higher discounts, resulting in a decrease of net revenues of $103 million. Clear Aligner net revenues were further negatively impacted by $8 million due to unfavorable foreign exchange rates. These decreases were partially offset by an increase in volume which increased net revenues by $82 million.\nSystems and Services\nFor the three months ended September 30, 2025, Systems and Services net revenues decreased by $1 million as compared to the same period in 2024, due to lower scanner system sales of $10 million, primarily driven by lower scanner system volume. This decrease was partially offset by an increase of $3 million from sales of scanner wands, driven by strong volume, a $3 million increase from non-system sales and a $3 million favorable impact from foreign exchange rates.\nFor the nine months ended September 30, 2025, Systems and Services net revenues increased by $12 million as compared to the same period in 2024, primarily due to an increase of $27 million in sales of scanner wands, driven by strong volume partially offset by lower scanner wand ASP, and a $13 million increase from non-system sales. These increases were partially offset by lower scanner system sales of $25 million, driven by lower volume and ASP, and a $2 million negative impact from unfavorable foreign exchange rates. \n32 \nTable of Contents\nCost of net revenues and gross profit (in millions):\n \nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n \n2025\n2024\nChange\n2025\n2024\nChange\nClear Aligner\nCost of net revenues\n$\n282.9 \n$\n234.0 \n$\n48.9 \n$\n758.5 \n$\n715.3 \n$\n43.2 \n% of net segment revenues\n35.1 \n%\n29.7 \n%\n31.5 \n%\n29.4 \n%\nGross profit\n$\n522.9 \n$\n552.8 \n$\n(30.0)\n$\n1,648.8 \n$\n1,720.5 \n$\n(71.8)\nGross margin %\n64.9 \n%\n70.3 \n%\n68.5 \n%\n70.6 \n%\nSystems and Services\nCost of net revenues\n$\n73.6 \n$\n62.1 \n$\n11.5 \n$\n201.5 \n$\n186.3 \n$\n15.2 \n% of net segment revenues\n38.7 \n%\n32.5 \n%\n34.7 \n%\n32.8 \n%\nGross profit\n$\n116.3 \n$\n128.9 \n$\n(12.6)\n$\n378.7 \n$\n381.7 \n$\n(3.0)\nGross margin %\n61.3 \n%\n67.5 \n%\n65.3 \n%\n67.2 \n%\nTotal cost of net revenues\n$\n356.5 \n$\n296.1 \n$\n60.4 \n$\n960.0 \n$\n901.6 \n$\n58.4 \n% of net revenues\n35.8 \n%\n30.3 \n%\n32.1 \n%\n30.0 \n%\nGross profit\n$\n639.2 \n$\n681.8 \n$\n(42.6)\n$\n2,027.4 \n$\n2,102.2 \n$\n(74.8)\nGross margin %\n64.2 \n%\n69.7 \n%\n67.9 \n%\n70.0 \n%\nChanges and percentages are based on actual values. Certain tables may not sum or recalculate due to rounding.\nCost of net revenues includes personnel-related costs including payroll and stock-based compensation for staff involved in the production process, the cost of materials, packaging, freight and shipping, depreciation on capital equipment and facilities used in the production process, amortization of acquired intangible assets and training costs.\nFor the three and nine months ended September 30, 2025, our gross margin decreased as compared to the same periods in 2024 primarily due to an increase in Clear Aligner Cost of net revenues driven by restructuring charges, impairment losses on Assets held for sale and depreciation on assets disposed of other than by sale. Our gross margin was further impacted negatively by an impairment loss on inventory recorded in our Systems and Services segment. We also experienced a decline in ASP\n’\ns in both reportable segments. These decreases were partially offset by lower Cost of net revenues, excluding the items noted previously, from operational efficiencies.\nClear Aligner\nFor the three and nine months ended September 30, 2025, our gross margin decreased as compared to the same period in 2024 primarily due to restructuring charges of $5 million, impairment losses on Assets held for sale of $23 million and depreciation on assets disposed of other than by sale of $14 million. Clear Aligner gross margin was also negatively impacted by lower ASP\n’\ns. These decreases were partially offset by lower Cost of net revenues, excluding the items noted previously, from operational efficiencies.\nSystems and Services\nFor the three and nine months ended September 30, 2025, our gross margin decreased as compared to the same periods in 2024 primarily due to lower ASP's and an impairment loss on inventory of $15 million. These decreases were partially offset by lower Cost of net revenues, excluding the impairment loss, from operational efficiencies.\n33 \nTable of Contents\nSelling, general and administrative (in millions):\n \nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n \n2025\n2024\nChange\n2025\n2024\nChange\nSelling, general and administrative\n$\n417.8 \n$\n434.1 \n$\n(16.3)\n$\n1,314.1 \n$\n1,338.2 \n$\n(24.1)\n% of net revenues\n42.0 \n%\n44.4 \n%\n44.0 \n%\n44.6 \n%\nChanges and percentages are based on actual values. Certain tables may not sum or recalculate due to rounding.\nSelling, general and administrative expense generally includes personnel-related costs, including payroll, stock-based compensation and commissions for our sales force, marketing and advertising expenses including media, market research, marketing materials, clinical education, trade shows and industry events, legal and outside service costs, equipment, software and maintenance costs, depreciation and amortization expense and allocations of corporate overhead expenses including facilities and IT.\nFor the three months ended September 30, 2025, selling, general and administrative expense decreased compared to the same period in 2024 primarily due to lower employee costs, including salaries, fringe benefits and bonus and lower marketing expense.\nFor the nine months ended September 30, 2025, selling, general and administrative expense decreased compared to the same period in 2024 primarily due to lower employee costs, including salaries, fringe benefits, and bonus and lower outside services, partially offset by higher clinical education expense.\nResearch and development (in millions): \n \nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n \n2025\n2024\nChange\n2025\n2024\nChange\nResearch and development\n$\n93.3 \n$\n85.3 \n$\n8.0 \n$\n286.9 \n$\n269.3 \n$\n17.6 \n% of net revenues\n9.4 \n%\n8.7 \n%\n9.6 \n%\n9.0 \n%\nChanges and percentages are based on actual values. Certain tables may not sum or recalculate due to rounding.\nResearch and development expense generally includes personnel-related costs, including payroll and stock-based compensation, outside service costs associated with the research and development of new products and enhancements to existing products, software, equipment, material and maintenance costs, depreciation and amortization expense and allocations of corporate overhead expenses including facilities and IT.\nFor the three and nine months ended September 30, 2025, research and development expense increased compared to the same periods in 2024 primarily due to higher employee costs, including salaries, fringe benefits and stock-based compensation, partially offset by lower bonus cost.\nRestructuring and other charges (in millions):\n \nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n \n2025\n2024\nChange\n2025\n2024\nChange\nRestructuring and other charges\n$\n31.8 \n$\n— \n$\n31.8 \n$\n31.8 \n$\n— \n$\n31.8 \n% of net revenues\n3.2 \n%\n— \n%\n1.1 \n%\n— \n%\nChanges and percentages are based on actual values. Certain tables may not sum or recalculate due to rounding.\nFor the three and nine months ended September 30, 2025, \nrestructuring and other charges increased compared to the same period in \n2024. Refer to \nNote 15 \"Restructuring and other charges\" of the Notes to the Condensed Consolidated Financial Statements for more information\n.\n34 \nTable of Contents\nLegal settlement loss (in millions): \n \nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n \n2025\n2024\nChange\n2025\n2024\nChange\nLegal settlement loss\n$\n— \n$\n0.1 \n$\n(0.1)\n$\n4.2 \n$\n31.2 \n$\n(27.0)\n% of net revenues\n— \n%\n— \n%\n0.1 \n%\n1.0 \n%\nChanges and percentages are based on actual values. Certain tables may not sum or recalculate due to rounding.\nFor the nine months ended September 30, 2025, we recorded losses of $4 million due to legal settlements. Refer to \nNote 7\n “\nLegal Proceedings\n” \nof the Notes to Condensed Consolidated Financial Statements\n for more information.\nIncome from operations (in millions):\n \nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n \n2025\n2024\nChange\n2025\n2024\nChange\nClear Aligner\nIncome from operations\n$\n250.7 \n$\n276.3 \n$\n(25.6)\n$\n777.9 \n$\n862.2 \n$\n(84.2)\nOperating margin %\n31.1 \n%\n35.1 \n%\n32.3 \n%\n35.4 \n%\nSystems and Services\nIncome from operations\n$\n59.8 \n$\n68.7 \n$\n(8.9)\n$\n204.0 \n$\n189.2 \n$\n14.8 \nOperating margin %\n31.5 \n%\n36.0 \n%\n35.2 \n%\n33.3 \n%\nTotal income from operations\n 1\n$\n96.3 \n$\n162.3 \n$\n(66.0)\n$\n390.4 \n$\n463.5 \n$\n(73.0)\nOperating margin %\n9.7 \n%\n16.6 \n%\n13.1 \n%\n15.4 \n%\nChanges and percentages are based on actual values. Certain tables may not sum or recalculate due to rounding.\n1 \nRefer to\n Note 14 “Segments and Geographical Information” of the Notes to Condensed Consolidated Financial Statements\n for details on unallocated corporate expenses and the reconciliation to Income from Operations.\nFor the three and nine months ended September 30, 2025, our operating margin decreased compared to the same periods in 2024 primarily due to lower gross margin and higher restructuring and other charges.\nClear Aligner\nFor the three and nine months ended September 30, 2025, our operating margin decreased compared to the same periods in 2024 primarily due to a decrease in gross margin.\nSystems and Services\nFor the three months ended September 30, 2025, our operating margin decreased compared to the same period in 2024 primarily due to a decrease in gross margin.\nFor the nine months ended September 30, 2025, our operating margin increased compared to the same period in 2024 primarily due to improved operating leverage primarily from lower employee spend, partially offset by a decrease in gross margin.\nInterest income (in millions): \n \nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n \n2025\n2024\nChange\n2025\n2024\nChange\nInterest income\n$\n3.2 \n$\n4.0 \n$\n(0.8)\n$\n11.4 \n$\n11.7 \n$\n(0.3)\n% of net revenues\n0.3 \n%\n0.4 \n%\n0.4 \n%\n0.4 \n%\nChanges and percentages are based on actual values. Certain tables may not sum or recalculate due to rounding.\nInterest income generally includes interest earned on cash, cash equivalents and investment balances. \n35 \nTable of Contents\nFor the three and nine months ended September 30, 2025, interest income decreased slightly compared to the same period in 2024 primarily due to lower interest rates earned on cash and cash equivalent balances.\nOther income (expense), net (in millions): \n \nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n \n2025\n2024\nChange\n2025\n2024\nChange\nOther income (expense), net\n$\n(4.8)\n$\n(0.4)\n$\n(4.4)\n$\n6.8 \n$\n(7.0)\n$\n13.8 \n% of net revenues\n(0.5)\n%\n— \n%\n0.2 \n%\n(0.2)\n%\nChanges and percentages are based on actual values. Certain tables may not sum or recalculate due to rounding.\nOther income (expense), net, generally includes foreign exchange gains and losses, gains and losses on foreign currency forward contracts, interest expense, gains and losses on equity investments and other miscellaneous charges. \nFor the three months ended September 30, 2025, other income (expense), net decreased compared to the same period in 2024 primarily due to changes in foreign exchange rates.\nFor the nine months ended September 30, 2025, other income (expense), net increased compared to the same period in 2024 primarily due to changes in foreign exchange rates partially offset by a gain recorded on our equity investments in the first quarter of 2024.\nProvision for income taxes (in millions):\n \nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n \n2025\n2024\nChange\n2025\n2024\nChange\nProvision for income taxes\n$\n38.0 \n$\n50.0 \n$\n(12.0)\n$\n134.1 \n$\n150.6 \n$\n(16.5)\nEffective tax rates\n40.1 \n%\n30.1 \n%\n32.8 \n%\n32.2 \n%\n \nChanges and percentages are based on actual values. Certain tables may not sum or recalculate due to rounding.\nOur effective tax rate differs from the U.S. statutory federal income tax rate of 21% for the three and nine month periods ended September 30, 2025 and 2024 primarily due to the recognition of additional tax expense resulting from U.S. taxes on foreign earnings, foreign income taxed at different rates, state income taxes and non-deductible expense in the U.S.\nThe increase in our effective tax rate for the three months ended September 30, 2025 compared to the same period in 2024 is primarily attributable to the change in our jurisdictional mix of income, partially offset by the decrease in U.S. taxes on foreign earnings.\nThe increase in our effective tax rate for the nine months ended September 30, 2025 compared to the same period in 2024 is primarily attributable to the change in our jurisdictional mix of income, lower tax deduction from stock-based compensation, partially offset by the decrease in U.S. taxes on foreign earnings. \nLiquidity and Capital Resources \nLiquidity and Trends\nAs of September 30, 2025 and December 31, 2024, we had cash and cash equivalents of $1,005 million and $1,044 million, respectively, of which approximately $814 million and $855 million, respectively, were held by our foreign subsidiaries. We continue to evaluate opportunities to repatriate our foreign earnings if or when needed. We do not expect to incur significant additional costs upon repatriation of these foreign earnings. We generate sufficient operating cash flow from our domestic operations and have access to $300 million under our revolving line of credit. We believe that our current cash balances and the borrowing capacity under our credit facility, if necessary, will be sufficient to fund our business for at least the next 12 months.\n \nOur material cash requirements as of September 30, 2025 are as follows:\n36 \nTable of Contents\n•\nOur purchase commitments consist primarily of open purchase orders for goods and services, including manufacturing inventory, supplies and services, sales and marketing, research and development services and technological services, issued in the normal course of business. There have been no material changes to our purchase commitments for goods and services during the nine months ended September 30, 2025 as compared to the year ended December 31, 2024. \n•\nThere have been no material changes to our future operating lease payments during the nine months ended September 30, 2025 as compared to the year ended December 31, 2024. \n•\nWe anticipate our investments in capital expenditures for fiscal year 2025 to be approximately $100 million. Capital expenditures primarily relate to technology upgrades and investments in manufacturing and treatment planning to meet actual and anticipated demand.\n•\nIn April 2025, our Board of Directors authorized a plan to repurchase up to $1.0 billion of our common stock. The April 2025 Repurchase Program is expected to be completed over a period of up to three years. We continually evaluate opportunities to repurchase shares of our common stock depending on various factors including our share price and current liquidity requirements. We expect to repurchase $128.4 million during the fourth quarter of 2025 and through January 2026 pursuant to the open market repurchase program announced in August 2025. Refer to \nNote 10 “Common Stock Repurchase Program” of the Notes to Condensed Consolidated Financial Statements\n for details on our stock repurchase programs. \n•\nAs of September 30, 2025, we had no material off-balance sheet arrangements that have or are reasonably likely to have a current or future material impact on our liquidity or capital resources.\n•\nIn the third quarter of 2025, we initiated a restructuring plan which will continue through the fourth quarter of 2025. We anticipate incurring between approximately $40.0 million and $50.0 million in total restructuring expenses, primarily related to involuntary termination benefits, including employee severance and other post-employment benefits. \nSources and Uses of Cash \nThe following table summarizes our Condensed Consolidated Statements of Cash Flows for the nine months ended September 30, 2025 and 2024 (in thousands):\n \nNine Months Ended\nSeptember 30,\n \n2025\n2024\nNet cash provided by (used in):\nOperating activities\n$\n370,046 \n$\n452,153 \nInvesting activities\n(76,529)\n(200,996)\nFinancing activities\n(367,174)\n(152,703)\nEffect of foreign exchange rate changes on cash, cash equivalents and restricted cash\n34,502 \n6,008 \nNet (decrease) increase in cash, cash equivalents and restricted cash\n$\n(39,155)\n$\n104,462 \nOperating Activities\nFor the nine months ended September 30, 2025, cash flows from operations of $370 million resulted primarily from our net income of approximately $275 million as well as the following:\n Significant adjustments to reconcile net income to net cash provided by operating activities\n•\nDepreciation and amortization of $135 million related to our investments in property, plant and equipment and intangible assets; \n•\nStock-based compensation of $142 million related to equity awards granted to employees and directors;\n•\nNon-cash operating lease costs of $30 million;\n•\nOther non-cash operating activities of $29 million primarily related to an impairment loss on inventory and an increase in our bad debt allowance; and\n•\nImpairment loss on Assets held for sale of $23 million.\nSignificant changes in working capital\n37 \nTable of Contents\n•\nNet outflow of $118 million in accounts receivable due to timing of collections; \n•\nNet outflow of $68 million in accrued and other long-term liabilities primarily due to the payment of fiscal year 2024 bonuses in the first quarter of 2025; and\n•\nNet outflow of $89 million in deferred revenue.\nInvesting Activities\nNet cash used in investing activities was $77 million for the nine months ended September 30, 2025 which was primarily related to an outflow of $67 million for purchases of property, plant and equipment and $10 million for our additional investment in SD Holding Company.\nFinancing Activities\nNet cash used in financing activities was $367 million for the nine months ended September 30, 2025 which was primarily related to outflows of $369 million for share repurchases and $20 million for payroll taxes paid for vested equity awards, partially offset by $22 million of proceeds from the issuance of common stock under our employee stock purchase plan. \nCritical Accounting Estimates\nManagement’s discussion and analysis of our financial condition and results of operations is based on our Condensed Consolidated Financial Statements which have been prepared in accordance with accounting principles generally accepted in the U.S. The preparation of financial statements requires management to make estimates and judgments that affect the reported amounts of assets and liabilities, revenues and expenses and disclosures at the date of the financial statements. We evaluate our estimates on an ongoing basis, including those related to revenue recognition, goodwill and finite-lived intangible assets, income taxes and legal proceedings and litigation. We use authoritative pronouncements, historical experience and other assumptions as the basis for making estimates. Actual results could differ from those estimates.\nRevenue Recognition\nOur revenues are derived primarily from the sale of aligners, scanners and services from our Clear Aligner and Systems and Services segments. We enter into sales contracts that may consist of multiple distinct performance obligations where certain performance obligations of the sales contract are not delivered in one reporting period. We measure and allocate revenues according to ASC 606-10, \n“Revenues from Contracts with Customers.”\nDetermining the standalone selling price (“SSP”) in order to allocate consideration from the contract to the individual performance obligations is the result of various factors, such as historical prices, changing trends and market conditions, costs and gross margins. While changes in the allocation of the SSP between performance obligations will not affect the amount of total revenues recognized for a particular contract, any material changes could impact the timing of revenue recognition, which would have a material effect on our financial position and result of operations. This is because the contract consideration is allocated to each performance obligation, delivered or undelivered, at the inception of the contract based on the SSP of each distinct performance obligation.\nWe allocate consideration for each clear aligner treatment plan based on each unit’s SSP. Management considers a variety of factors such as same or similar product historical sales, costs and gross margin, which may vary over time depending upon the unique facts and circumstances related to each performance obligation in making these estimates. In addition to historical data, we take into consideration changing trends and market conditions. For treatment plans with multiple options, we also consider usage rates, which is the number of times a customer is expected to order more aligners after the initial shipment. Our process for estimating usage rates requires significant judgment and evaluation of inputs, including historical usage data by region, country and channel.\nWe estimate the SSP of each element in a scanner system and services sale taking into consideration same or similar product historical prices as well as our discounting strategies. For CAD/CAM services, we estimate the SSP of each element, including the initial software license and maintenance and support, using data such as historical prices.\n38 \nTable of Contents\nRecent Accounting Pronouncements\nSee \nNote 1 \n“\nSummary of Significant Accounting Policies\n” \nof the Notes to Condensed Consolidated Financial Statements\n for a discussion of recent accounting pronouncements."
}