{
  "source_file": "algn-20241231.htm",
  "form_type": "10-K",
  "item1": "Item 1.  Business. \nOur Company \nAlign Technology, Inc. (“we,” “us,” “our,” “Align” or the “Company”) is a global medical device company primarily engaged in the design, manufacture and marketing of Invisalign\n®\n clear aligners for the treatment of malocclusions, or the misalignment of teeth, by orthodontists and general dental practitioners (“GPs”), Vivera\nTM\n retainers for retention, iTero\nTM\n intraoral scanners and services for dentistry, and exocad\nTM\n computer-aided design and computer-aided manufacturing (“CAD/CAM”) software for dental laboratories and dental practitioners. Our vision and strategy is to revolutionize orthodontic and restorative dentistry through digital treatment planning and implementation using the Align\nTM \nDigital Platform, an integrated suite of proprietary technologies and services designed to deliver a seamless, end-to-end solution for patients, consumers, orthodontists, GPs and lab partners. We strive to achieve our vision and strategy through key objectives made possible with the proprietary technologies and services of the Align\nTM\n Digital Platform to establish: clear aligners as the principal solution for the treatment of malocclusions with the Invisalign System as the treatment solution of choice by orthodontists, GPs and patients globally, our iTero intraoral scanners as the preferred scanning technology for digital dental scans and our exocad CAD/CAM software as the dental restorative solution of choice for dental labs. \n3\nOur corporate headquarters are located at 410 North Scottsdale Road, Suite 1300, Tempe, Arizona 85288. Our telephone number is 602-742-2000. Our internet address is www.aligntech.com. Our Americas regional headquarters is located in Raleigh, North Carolina, U.S.A.; our European, Middle East and Africa (“EMEA”) regional headquarters is located in Rotkreuz, Switzerland; and our Asia Pacific (“APAC”) regional headquarters is located in Singapore.\nWe have two operating segments: (1) Clear Aligner and (2) Imaging Systems and CAD/CAM Services (“Systems and Services”). For the year ended December 31, 2024, Clear Aligner net revenues represented approximately 81% of worldwide net revenues, while Systems and Services net revenues represented the remaining 19%. We sell the majority of our products and services directly through a dedicated and specialized sales force to our customers: orthodontists, GPs, including prosthodontists, periodontists, oral surgeons and dental laboratories. We also sell through sales agents and distributors in certain countries. In addition, we sell directly to Dental Support Organizations (“DSOs”) who contract with dental practices to provide critical business management and support including non-clinical operations. We also sell our products to dental laboratories who use our products to manufacture or customize their own products for licensed dentists. We furthermore market and sell doctor and consumer accessory products complementary to our doctor-prescribed principal products under the Invisalign® and other brands, including retainers, dental supplies, clear aligner cases (clamshells), ultrasonic and UV electronic cleaning devices, teeth whitening products and cleaning solutions (collectively, “Invisalign Accessory Products”). Depending on the product, our Invisalign Accessory Products are sold through a variety of channels, including online through large e-commerce websites, our doctor portal and in-store through large retailers and pharmacy stores.\nOur clear aligners are sold under the Invisalign\n®\n brand name. Our Invisalign System is intended mainly for the treatment of malocclusions and is designed to help dental professionals achieve the clinical outcomes they expect and the results patients desire. To date, over 19 million people worldwide have been treated with the Invisalign System. In order to provide Invisalign treatment to their patients, orthodontists and GPs must initially complete an Invisalign training course. Our iTero intraoral scanners are used by dental professionals, labs, and service providers for restorative and orthodontic digital procedures as well as Invisalign case submissions. Our exocad CAD/CAM software products provide restorative dentistry, implantology, guided surgery and smile design to dental labs and dental practices through fully integrated workflows, with the goal to provide cross-disciplinary dentistry in labs and at chairside. \nOur Products, Services and Technologies\nAlign\nTM\n Digital Platform\nWe strive to be at the forefront of innovation in digital orthodontics and dentistry, helping doctors transform their practices using digital tools and technology to deliver exceptional, modern treatment experiences and outcomes to patients worldwide. The Align\nTM\n Digital Platform is the foundation of our goal to revolutionize the practice of dentistry, delivering interconnected, interdisciplinary workflows and treatment solutions designed to improve all aspects of treatment, from initial consultations to final smiles with our doctor-centered treatment model. The Align\nTM\n Digital Platform is an end-to-end digital platform that combines software, systems and services to seamlessly integrate and connect those critical to successful treatment outcomes – \n4\ndoctors, labs, patients and consumers. At the center of the Align\nTM\n Digital Platform are Invisalign clear aligners, iTero intraoral scanners and exocad CAD/CAM software.\nThe Align\nTM\n Digital Platform utilizes the Align\nTM\n Digital Workflow to enable an end-to-end digital treatment experience and generate interconnected workflows and treatment solutions, that includes the following key components:\n•\nConnect:\n The initial stage of the platform drives consumer demand and connects potential patients to our websites and the websites of Invisalign providers. Some of the tools that support this stage are Invisalign.com, the Invisalign SmileView\nTM\n tool, My Invisalign app, Doctor Locator, Invisalign\n®\n Practice App, and Invisalign\n®\n Virtual Appointment.\n•\nScan:\n During this stage, patient data is captured through intraoral scanning. Doctors and their staffs use intraoral scanning tools designed to support diagnosis of a patient’s oral conditions and health and support doctors to develop appropriate treatment pathways. Visualization of their potential smiles helps patients understand the benefits of treatment and increase patient conversion. The tools that support this stage, include, iTero intraoral scanners and exocad CAD/CAM imaging systems, Invisalign\n®\n Outcome Simulator Pro, Invisalign Photo Uploader, Invisalign SmileView\nTM\n tool, iTero Element\nTM \n5D auto-upload feature, iTero\nTM\n Scan Report and iTero\n-\nexocad Connector\nTM\n.\n•\nDiagnose\n: Doctors can access and use tools that support diagnosis of a patient’s oral health and develop an appropriate treatment pathway. The Align\nTM\n Digital Platform facilitates the doctor-patient conversation, through education regarding clinical needs and setting expectations. Some of the tools that support this stage include Align\nTM\n Oral Health Suite, iTero\nTM\n intraoral scanners, including those with NIRI technology (Near Infra-Red Imaging), iTero\nTM\n TimeLapse technology and iTero Occlusogram.\n•\nPlan:\n Doctors digitally visualize and plan orthodontic and restorative treatments. Orthodontists and GPs can use our products to design, build and share their vision for treatment planning and agree on a customized plan with their patients to reach the desired outcomes. Some of the tools that support this stage are ClinCheck\n®\n Pro 6.0,ClinCheck\n®\n Plan Editor, ClinCheck\n®\n In-Face Visualization, ClinCheck\n®\n Live Update, Invisalign\n®\n Practice App, Invisalign\n®\n Personalized Plan, CBCT Integration for ClinCheck\n® \nsoftware, Clincheck\n®\n Smile Video, Invisalign Smile Architect\nTM\n, iTero\nTM\n Design Suite, exocad Dental CAD\nTM\n software and exocad Dental CAD™ 3.2 Elefsina software.\n•\nTreat:\n During this stage, doctors treat their patients with our Invisalign\n®\n clear aligners and may offer teeth whitening using the Invisalign\nTM\n Professional Whitening System. The Invisalign\n®\n Palatal Expander System and the Invisalign\n®\n System with mandibular advancement featuring enhanced precision wings are additional products that support patient treatment.\n•\nMonitor:\n Doctors can remotely track their patients’ treatment between visits, and orthodontists and GPs can more easily track treatment progress and communicate issues, results and recommendations to their patients. Some of the tools that support this stage include Invisalign\n®\n Virtual Care AI, My Invisalign\nTM\n app, Invisalign Doctor Site, Invisalign\n®\n Practice App, Invisalign\n®\n Progress Assessment and iTero\nTM\n scanners.\n•\nRetain:\n Following completion of their orthodontic treatment, patients can retain the final position of their teeth using Vivera\nTM\n retainers.\nAs we further evolve the treatment planning experience for doctors through new technological research and development innovations, we expect to introduce new technologies, features and functionality that improve personalization of treatment planning, predictability, clinical preferences, and 2D/3D imaging, including digital tools for faster and more accurate final tooth positions. In 2024, we launched several new products and technologies that further enhance the Align\nTM\n Digital Platform, including the iTero Lumina\nTM\n intraoral scanner, iTero Multi-Direct Capture\nTM\n technology, Clincheck\n®\n Smile Video, iTero\nTM\n Design Suite, Invisalign Smile Architect\nTM \nwith treatment planning software with Multiple Treatment Plans, Invisalign\n®\n Outcome Simulator with Multiple Treatment Simulation and Align\nTM\n Oral Health Suite with new comparison tools.\nClear Aligner Segment\nMalocclusion and Traditional Orthodontic Treatment\n5\nMalocclusion is one of the most prevalent clinical dental conditions in the world, affecting approximately 60% to 75% of the global population. We estimate that there are approximately 600 million people globally with malocclusion who could benefit from straightening their teeth. However, most people afflicted by malocclusion do not seek orthodontic treatment for various reasons, including negative perceptions of traditional metal wires and brackets, affordability of treatment, and accessibility to doctors. Annually, only approximately 22 million people globally elect treatment by orthodontists. Today, most orthodontic patients continue to have their malocclusions treated with the use of traditional corrective methods such as metal arch wires and brackets, referred to as braces, augmented with elastics, metal expanders, headgear or functional appliances, and other ancillary devices as needed. Upon completion of a patient’s treatment, their dental professional may recommend the patient use a retainer appliance to preserve the benefits of their treatment. Of the 22 million cases started each year, we estimate that almost all can be treated using our Invisalign System, yet our share of the 22 million case starts through orthodontists is approximately 10% globally. Our business strategy remains focused on increasing our share of the existing market of orthodontic case starts compared to brackets and wires, especially among teens, and expand the market for digital orthodontics, especially among adults. By training more doctors, including GPs as well as orthodontists, increasing utilization of existing doctors using our products, educating more consumers about the benefits of straighter teeth using the Invisalign System and connecting consumers with an Invisalign-trained doctor of their choice, we are helping drive adoption of digital orthodontics and restorative dentistry globally.\nThe Invisalign System\nThe Invisalign System is a proprietary method for treating malocclusion based on a proprietary computer-simulated virtual treatment plan and a series of doctor-prescribed, custom manufactured, clear polymer removable aligners. We received 510(k) clearance from the U.S. Food and Drug Administration (“FDA”) to market the Invisalign System in 1998. The Invisalign System offers a range of treatment options, specialized services and access to proprietary software for treatment visualization and is comprised of the following phases:\nDiagnosis and transmission of treatment data\n. As part of the Align™ Digital Workflow, we have developed solutions to enable doctors to diagnosis and drive patient conversion from considering treatment to starting treatment – providing tools to support diagnosis of patients’ oral health and support to identify an appropriate treatment pathway, facilitating the doctor-patient conversation, education and clinical needs and expectations. An Invisalign trained dental professional prepares an online prescription form on our Invisalign Doctor Site and securely submits the patient’s records, which include a digital intraoral scan or a polyvinyl-siloxane (“PVS”) impression of the relevant dental arches, photographs of the patient and, at the dental professional’s election, x-rays of the patient’s dentition. Intraoral digital scans may be submitted through Align’s iTero scanner or certain third-party scanners capable of accurately interfacing with our systems and processes. Globally, approximately 94% of prescription orders for our Invisalign System are now submitted via digital scan, increasing the accuracy of treatment plans, reducing the time from when a doctor submits a prescription to the time a patient receives the clear aligners, and helping to decrease the carbon footprint resulting from elimination of the initial or upfront shipment of a patient’s PVS impressions to the doctors and shipping those PVS impressions back to us. \nComputer-simulated treatment plan\n. Our ClinCheck\n®\n Pro cloud-based treatment planning software is the cornerstone of the Align\nTM\n Digital Platform. ClinCheck Pro leverages proprietary algorithms based on the insights from data from over\n \n19 million patients treated worldwide. Using the digital scans or PVS impressions, any specific doctor preferences and digital data provided, we generate a proposed custom, three-dimensional ClinCheck\n®\n treatment plan using proprietary software developed through significant, ongoing research and development investments spanning over two decades. A patient’s ClinCheck treatment plan simulates desired tooth movement in stages and details the timing and placement of any features or attachments to be used during treatment. Attachments are tooth-colored shapes that can be affixed to a patient’s teeth to increase the biomechanical force on a specific tooth or teeth in order to affect the desired movement(s).\nTreatment plan review and approval by an Invisalign-trained doctor.\n The patient’s proposed ClinCheck treatment plan is then made available to the prescribing dental professional via our Invisalign Doctor Site, enabling the dental professional to evaluate projected tooth movement as it progresses from initial to final position and compare treatment plan options to best meet the dental professional’s treatment objectives. By reviewing, modifying as needed and approving an acceptable treatment plan, the dental professional retains control of the patient’s treatment.\nManufacture of custom clear aligners. \nFollowing the dental professional’s approval of a ClinCheck treatment plan, we use the data underlying the simulation as input for stereolithography technology (a form of 3D printing technology) to construct a series of molds. Each mold is a replica of the patient’s teeth at each stage of the simulated course of treatment. From these molds, clear aligners are fabricated by pressure-forming polymeric sheets over each mold. Clear aligners are thin, clear polymer, removable dental appliances that are custom manufactured in a series designed to correspond to each stage of a patient’s ClinCheck treatment plan.\n6\nShipment to the dental professional and patient clear aligner wear.\n Once manufactured, each clear aligner for a patient’s doctor-approved treatment plan is typically shipped directly to the dental professional. The majority of doctors then distribute each clear aligner to their patients. Each set of clear aligners (one clear aligner for the lower and a second for the upper jaw) are generally worn for one week or for a short period of time corresponding to the stages of the patient’s approved ClinCheck treatment plan and their doctor’s discretion. The patient replaces their current set of clear aligners with the next pair in the series as and when prescribed, advancing tooth movement through each stage. At various points in each patient’s treatment, their doctor may place attachments or use other auxiliaries to achieve desired tooth movements, per their doctor’s original prescription and the approved ClinCheck treatment plan. Additionally, for patients treated using many of our Invisalign System products, doctors have the option to order additional clear aligners for doctor-approved treatment plan refinements.\nClear Aligner Products\nWe offer our Invisalign System in a variety of treatment packages designed to correspond with the case-by-case treatment needs of our doctors and their patients and also designed on nonclinical needs. The table below provides a general description of the categories of products in our Invisalign System offered in various regions as they typically correspond to the severity of malocclusion and length of anticipated treatment.\nMalocclusion\nVery Mild \nModerate\nSevere\nProduct\nInvisalign® Express Package\nInvisalign® Lite Package\nInvisalign Go™ (GP)\nInvisalign® Moderate Packages (& Invisalign Go™ Plus)\nInvisalign® Comprehensive Packages\nTreatment Stages*\n7\n14\n20\n20-26\nAs many as required\nClinical Scope\nRelapse and minor movement, anterior esthetic alignment\nUp to 2mm AP correction, crowding/spacing, lower incisor extraction, pre-restorative\nNo AP correction, mild to moderate crowding, spacing, lower incisor extraction, pre-restorative tooth movement from 2nd premolar to 2nd premolar (5x5)\nClass I, mild AP correction, moderate crowding/spacing, mild anterior / posterior and vertical discrepancies, pre-restorative, (Go Plus tooth movement from 1st molar to 1st molar (6X6))\nClass I, II, III, moderate to severe crowding/spacing, anterior / posterior and vertical discrepancies, extractions, complex pre-restorative\n* The number of stages can vary by product and region.\nMost of our Invisalign System products described above provide dental professionals with the option to order additional clear aligners if the patient’s treatment progress or needs deviate from the original treatment plan. The number and timing of additional clear aligner orders are subject to certain requirements noted in our terms and conditions. \nComprehensive Products - Invisalign Treatment Options\nInvisalign Comprehensive Packages\n. The Invisalign Comprehensive Package is used to treat adults and teens over a wide spectrum of mild to severe malocclusion and contains a broad variety of features to address the desired treatment goals. It also addresses the frequently complex orthodontic needs of teenage or younger patients with advanced features such as mandibular advancement, compliance indicators and compensation for tooth eruption. These packages include Invisalign Comprehensive, Invisalign First\nTM\n Phase 1 and Invisalign First\nTM\n Comprehensive Phase 2. \nInvisalign First Phase 1 and Invisalign First Comprehensive Phase 2 Packages\n. Invisalign First Phase 1 Package is designed specifically for younger patients generally between the ages of six and ten, who frequently have a mixture of primary/baby and permanent teeth. Invisalign First Phase 1 treatment provides early interceptive orthodontic treatment, traditionally done through arch expansion, or partial metal braces, before all permanent teeth have erupted. Invisalign First Phase 1 clear aligners are designed specifically to address a wide range of younger patients’ malocclusions, including shorter clinical crowns, management of erupting dentition and predictable dental arch expansion. Our Invisalign First Comprehensive Phase 2 Package complements Invisalign First Phase 1 and is generally consistent with our Invisalign Comprehensive Package. After a patient completes Invisalign First Phase 1, doctors have the option to purchase a Comprehensive Phase 2 Package for that same patient. \nIn the first quarter of 2023, we launched the Invisalign Comprehensive 3in3 product. The 3in3 configuration offers doctors Invisalign Comprehensive treatment with a three-year treatment expiration date and three sets of additional clear aligners included prior to the treatment expiration date, rather than the five-year treatment expiration date with unlimited additional clear aligner sets prior to the treatment end date offered under the Invisalign Comprehensive Package. \n7\nNon-Comprehensive Products - Invisalign Treatment Options:\nInvisalign Non-comprehensive Packages. \nWe offer a variety of lower-priced treatment packages for less complex orthodontic cases, non-comprehensive relapse cases, or teeth straightening prior to restorative or cosmetic treatments, such as veneers. These treatment packages include Invisalign Express, Invisalign Lite, and Invisalign\n®\n Moderate. These packages may be offered in select countries and/or may differ from region to region. \nInvisalign Doctor Subscription Program (“DSP”) is our monthly subscription-based clear aligner program which includes retainers and low-stage “touch-up” clear aligner treatment. DSP is currently available in North America, Latin America, and certain countries in Europe. \nInvisalign Go Packages. \nIn various markets we also offer Invisalign Go\nTM\n, Invisalign Go\nTM\n Express and Invisalign Go Plus, which are streamlined non-comprehensive packages designed for GPs to more easily identify and treat patients with mild-to-moderate malocclusion cases, expand arch width, align anterior teeth prior to restorative treatment, and move teeth from second pre-molar to second pre-molar. These packages include case assessment support, simplified ClinCheck treatment plans and a progress assessment feature for case monitoring. \nNon-Case Products:\nThe Comprehensive and Non-Comprehensive clear aligner packages described above are distributed in cases, meaning that all the sets of clear aligners required for all the stages of a doctor-approved treatment plan are delivered in a case. We also sell non-case products. Clear aligner non-case products include retention products, Invisalign training, adjusting tools used by dental professionals during the course of treatment, ancillary Invisalign Accessory Products and other oral health products available in certain e-commerce and retail channels in the United States.\nRetention\n. We offer up to four sets of custom clear aligners called Vivera retainers made with proprietary material strong enough to maintain tooth position and correct minor relapse, if necessary, as well as Invisalign retainers. Retainers are generally available for doctors to offer to any of their patients, whether they use the Invisalign System or other products, including wires and brackets. In select markets, we also offer single set retainers. \nInvisalign Professional Whitening System.\n Additionally, we offer a professional whitening system using Ultradent’s Opalescence PF whitening system with Invisalign\n®\n clear aligners or Vivera retainers.\nNew Products/Feature Enhancement\nInvisalign® Palatal Expander System.\n In December 2023, we received 510(k) clearance in the United States for the Invisalign Palatal Expanders. Invisalign Palatal Expanders are intended for use in rapid expansion and subsequent holding of skeletal and/or dental narrow maxilla (upper jaw) with primary, mixed, or permanent dentition. The Invisalign Palatal Expander System consists of a series of removable devices staged in small increments of movement to expand a patient’s narrow maxilla to a position determined by their treating doctor. Each direct 3D printed device is customized to the patient’s unique anatomy based on an iTero™ intraoral digital scan. A palatal expansion treatment plan and device design are then developed using our proprietary orthodontic software. The Invisalign Palatal Expander is our first direct 3D printed orthodontic device. Combined with Invisalign First™ Phase 1 clear aligners, Invisalign Palatal Expanders provide doctors with a full early intervention treatment solution such as Phase 1, an early interceptive orthodontic treatment for young patients. The Invisalign Palatal Expander System is currently available in the United States, Canada, Australia, New Zealand, Hong Kong, Singapore, Japan and certain countries in EMEA. The Invisalign Palatal Expander System is expected to be commercially available in additional markets, pending regulatory approvals. \nIn January 2024, we completed the acquisition of Cubicure GmbH (“Cubicure”), a company that develops, produces and distributes innovative materials, equipment and processes for novel 3D printing solutions. We believe the acquisition of Cubicure will support our long-term growth strategy by enabling us to scale our 3D printing operations to eventually direct print millions of custom appliances per day. We expect the acquisition of Cubicure will ultimately extend and scale our printing, materials and manufacturing capabilities for our 3D printed products while concurrently materially reducing the amount of resin used in our manufacturing process. Direct fabrication offers the transformative potential of design flexibility that goes beyond what the current thermoforming technology allows. This will potentially allow us to design unique appliances \n8\nthat may perform even better than our existing ones and address unmet market needs. We expect to pilot our first devices on this platform with 3D printed retainers in the first half of 2025.\nSmart Technology: SmartTrack\nTM\n, SmartForce\nTM \nand SmartStage\nTM\nSmart technology is applied in the development of Invisalign treatments and leads to more precise control of individual and multiple tooth movements. We use a force driven system in our Invisalign clear aligners such that the next clear aligner is shaped so that when inserted, the clear aligner stretches and applies the desired force to the surface of the tooth, resulting in the desired tooth movement. Smart technology allows us to find the right thickness, the right elasticity, and the right force application over a period of time. Smart technology includes the use of SmartTrack, SmartForce and SmartStage Technology.\nSmartTrack Material\n. SmartTrack clear aligner material is a patented, custom-engineered Invisalign clear aligner material that provides gentle, more constant force to improve control of tooth movements. Conventional clear aligner materials relax and lose a substantial percentage of the force applied in the initial days of wear. SmartTrack material maintains more constant force over a longer period of time. The flexible SmartTrack material also more precisely conforms to tooth morphology, attachments and interproximal spaces to improve control of tooth movement throughout treatment.\nSmartForce Attachments\n. SmartForce attachments are small tooth-colored shapes that attach to teeth before or during Invisalign treatment. Invisalign clear aligners fit smoothly and tightly around the attachments and give the clear aligners something to gently push on. SmartForce attachments make complex tooth movements possible without braces by helping clear aligners apply the right amount of force in the right direction.\nSmartStage Technology\n. SmartStage is an advanced algorithm that determines the optimal path of tooth movement and the shape of the clear aligner at every stage of an Invisalign treatment. The programming determines tooth movement in a certain sequence, at the right time to achieve optimal outcomes with greater predictability and fewer undesirable interferences.\nSystems and Services Segment \nIntraoral scanning is a rapidly evolving technology substantially impacting the practice of dentistry. By enabling the dental practitioner to create a 3D image (digital scan) of a patient’s teeth using a handheld intraoral scanner, digital scanning is faster, more efficient, precise and comfortable for patients. Beginning patient care with the early use of our iTero intraoral scanners and combining the results with digital workflows designed to assist doctors and patients visualize and evaluate various treatment options with detailed imagery and CAD/CAM solutions helps patients decide to undergo treatment and improve treatment outcomes and satisfaction. The accuracy of digitally scanned models substantially reduces the rate of restoration “remakes,” which results in patients being recalled to dental offices less often and experiencing shorter treatment times for the restoration work because fewer procedures are required after teeth are aligned and spaced optimally, increasing overall patient satisfaction. Digital models also reduce the carbon footprint associated with the shipping of the materials used to create PVS impressions, the shipping of those impressions and their disposal. Moreover, the digital model file can be used for various procedures and services including fabrication of physical dental models for use by labs to create restorative units such as veneers, inlays, onlays, crowns, bridges and implant abutments; digital records storage; aid to caries detection; orthodontic diagnosis; orthodontic retainers and appliances; and Invisalign digital impression submission. \niTero Scanner\n. The iTero Element™ portfolio of intraoral scanners includes the iTero Element™ 2, the iTero Element™ Flex, iTero Element™ 5D Imaging System, iTero Element™ Plus Series and the iTero Lumina™ intraoral scanner which are each available in select regions and countries. These products build on the existing high precision, full-color imaging and fast scan times of the iTero Element portfolio and are available with software options for orthodontic and restorative procedures. The iTero scanner is interoperable with our Invisalign System such that a full arch or full mouth digital scan can be submitted as part of the Invisalign System prescription order submission process.\nOur iTero Element 5D Imaging System is the first integrated dental imaging system that simultaneously records 3D, intraoral color camera images, near infrared imaging (“NIRI”) technology and enables comparison over time using the iTero™ TimeLapse technology. NIRI technology, included in our iTero Element 5D and 5D Plus Imaging Systems, aids in detection and monitoring of interproximal caries above the gingiva in real time, without using harmful radiation. In October 2021, the findings of a clinical study we sponsored were published in the peer-reviewed Journal of Dentistry which demonstrated that the NIRI technology of the iTero Element 5D imaging system was 66% more sensitive than bitewing x-ray radiography for detection of interproximal lesions, without the use of harmful radiation. We received 510(k) clearance in the United States for the caries detection feature of the iTero Element 5D in 2020. The iTero Element Plus Series of intraoral scanners and imaging systems offers restorative and orthodontic digital workflows that include enhanced visualization for optimized patient \n9\nexperience, including a fully integrated 3D intraoral camera in certain models, seamless scanning with reduced processing time, artificial intelligence (“AI”)-based features, and, in certain models, NIRI technology.\nOur iTero Element scanners are offered in a number of software configurations such as Ortho Comprehensive, Restorative Comprehensive and Restorative Foundation. These software packages are included in the price of the scanner and have a service period of 1 to 5 years. They enable various orthodontic and restorative workflows as well as provide other applications, including Invisalign\n®\n Outcome Simulator, Invisalign Case Assessment tool, Invisalign Progress Assessment tool, and iTero TimeLapse technology. Our iTero software is designed for orthodontists for digital records storage, orthodontic diagnosis, and for the fabrication of printed models and retainers. Our restorative software is designed for GPs, prosthodontists, periodontists and oral surgeons and includes restorative workflows providing the ability to send digital impressions to the lab of their choice and communicate seamlessly with external treatment planning, custom implant abutment, chairside milling and laboratory CAD/CAM systems such as through our iTero-exocad Connector\nTM\n. \nIn January 2024, we launched the iTero Lumina intraoral scanner. The iTero Lumina intraoral scanner is designed with iTero Multi-Direct Capture\nTM\n technology that we believe quickly, easily and accurately captures more data while delivering exceptional scan quality and photorealistic images that remove the need for intraoral photos. iTero Multi-Direct Capture replaces the confocal imaging technology in earlier intraoral scanner models. It has a wider field of capture and multi-angled scanning that enables simultaneous capture from multiple angles. Additionally, the iTero Lumina scanner has a capture distance of up to 25mm, making it easier to scan complex oral regions such as narrow or deep palates, edentulous spaces, and partially erupted teeth with minimal maneuvering. It has a 50% smaller and 45% lighter wand (as compared to iTero Element™ 5D imaging system wand, excluding the wand cable), which is expected to be especially beneficial for kids and teen patients. The iTero Lumina scanner has photorealistic scans which enables high quality clinical decisions the same way intraoral photos do, and its advanced software enables scanning at two times the speed. We expect to launch the restorative software on the iTero Lumina intraoral scanner by the end of the first quarter of 2025.\nInvisalign® Outcome Simulator\n. The Invisalign Outcome Simulator is an exclusive chair-side and cloud-based application for the iTero scanner that allows doctors to help patients visualize how their teeth may look at the end of Invisalign treatment. This is achieved through a dual view layout that shows a prospective patient an image of their own current dentition next to a simulated final position after Invisalign treatment.\nInvisalign® Progress Assessment Tool. \nThe Invisalign Progress Assessment tool provides the ability to compare a patient’s new scan with a specific stage of their ClinCheck\n®\n treatment plan, allowing doctors to visually assess and communicate Invisalign treatment progress with an easy-to-read, color-coded, tooth movement report.\niTero\nTM\n TimeLapse Technology\n. Our iTero\nTM\n TimeLapse technology allows doctors or practitioners to compare a patient’s historic 3D scans to the present-day scan, enabling clinicians to identify and measure orthodontic movement, tooth wear, and gingival recession. This highlights areas of diagnostic interest to dental professionals and helps foster a proactive conversation with the patient regarding potential restorative or orthodontic solutions.\nAlign\nTM\n Oral Health Suite\n. The Align™ Oral Health Suite is a digital interface designed to enhance dental consultations and drive patient acceptance of dental treatment. It offers a modern approach to dental examinations, featuring an innovative clinical framework designed to empower doctors and their clinic staff to conduct comprehensive oral health assessments via a single scan using patient-friendly terminology, and providing a highly engaging patient-centric experience. It integrates iTero diagnostic aid and visualization tools, such as iTero NIRI, iTero Occlusogram, iTero TimeLapse and Invisalign Outcome Simulator Pro into a single interface chairside on the iTero scanner.\nCAD/CAM Service\ns. Our exocad CAD/CAM software platform addresses restorative needs in an end-to-end digital platform workflow to facilitate ortho-restorative and comprehensive dentistry. The platform provides doctors and dental labs with digital clinical solutions that aid GPs and dental labs in planning and delivering restorative dental treatments, adding restorative functionality to our comprehensive digital platform to deliver digital ortho-restorative workflows and interdisciplinary dentistry. Our exocad software is licensed and sold separately.\nOther proprietary software mentioned in this Annual Report on Form 10-K, such as software embedded in our iTero intraoral scanners, ClinCheck and ClinCheck Pro software, the Invisalign Doctor Site, Align X-Ray Insights and feature enhancements included as part of the Invisalign System are not sold separately, nor do they contribute as individual items to revenues. \n10\nBusiness Strategy\nOver the past 27 years, Align has helped doctors treat over 19 million patients with the Invisalign System and is driving the evolution in digital dentistry through the Align\nTM\n Digital Platform. Our technology and innovations are designed to meet the demands of today’s patients with convenient, comfortable and affordable treatment options, while improving overall oral health. We strive to help doctors and lab technicians move their businesses forward by connecting them with new patients, providing digital solutions that increase operational speed and efficiency and provide solutions that allow them to deliver exceptional treatment outcomes and experiences to millions of people around the world. We achieve this by focusing on and executing our strategic growth drivers: \n•\nInternational Expansion. \nWe continue increasing our presence globally by increasing awareness of our products and by making them available in more countries to more customers and consumers. We continue expansion of our sales and marketing by reaching into new countries and regions, including new areas in Africa and Latin America. As of the end of 2024, we are selling directly or through authorized distributors in more than 100 countries. As our business continues to grow in both number of new Invisalign-trained doctors and customer utilization, we support that growth through targeted investments such as clinical support, product improvements, technological innovations, clinical education and advertising. In addition, we are scaling and expanding our operations and facilities to better support the growing numbers of global customers. As of the end of 2024, we have 13 fabrication and treatment planning locations throughout the world. We have a manufacturing facility in each of our three key regions: Americas (Mexico), APAC (China), and EMEA (Poland).\n \nEach of these three facilities form the foundation of our manufacturing strategy, which continues to evolve to increase flexibility and optimize our capacity and cost structure. We also perform digital treatment planning and interpretation for restorative cases worldwide, including in Costa Rica, China, Germany, Spain, Poland, and Japan, among others. By establishing and expanding our key operational activities in locations closer to our customers, we are creating an infrastructure that allows us to be responsive to local and regional needs, while providing global operational flexibility and scale needed for variations in global and regional demand. We expect to continue expanding our business in 2025 by investing in resources, infrastructure and initiatives that help drive Invisalign treatment growth, position our iTero intraoral scanners as the preferred scanning technology for digital dental scans, and establish our exocad CAD/CAM software as the solution of choice for dental labs in existing and new international markets.\n•\nGP Dentist Treatment\n. We strive to enable GPs, who have the potential to treat the general patient population, to more easily identify potential cases they can treat with the Invisalign System, monitor patient progress or, if needed, help refer cases to an orthodontist while providing high-quality restorative, orthodontic and dental hygiene care. We believe success with GPs can be achieved through doctor training and clinical education, by offering digital tools such as the iTero intraoral scanner and products like Invisalign Go™ treatment that address the distinctive needs of GP patients, all delivered by sales and marketing personnel specifically focused on the unique needs of this customer category. We encourage GPs to scan every patient with intraoral scanners as a means to diagnose and treat patients over time and as an opportunity to drive future demand for their services and the Invisalign System. DSOs represent a large and growing opportunity to help drive adoption of digital technology across the dental industry. We have well established relationships with many DSOs globally that recognize the benefits of digital workflows enabled by our portfolio of products and services that make up the Align\nTM\n Digital Platform, including increased practice efficiency and profitability, as well as delivering a better patient experience from shorter cycle times and customer proximity. We have and may continue to financially invest in or explore collaborations with key ecosystem partners, including DSOs, whose missions and visions align with our own vision, strategy, business model and goals.\n•\nPatient Demand.\n Our goal is to make the Invisalign brand a highly recognized name brand worldwide by creating awareness for Invisalign treatment among consumers and motivating the potential 600 million patients who can benefit from treatment of malocclusion to seek treatment using the Invisalign System. We accomplish this through an integrated consumer marketing strategy that includes television, media, social networking and event marketing and strategic alliances with professional sports teams, as well as educating patients on treatment options and directing them to high volume Invisalign trained doctors. To further drive consumer awareness, we continue to offer additional dental-related Invisalign Accessory Products under the Invisalign brand name available in certain e-commerce channels in the United States. The initial stage of the Align\nTM\n Digital Platform drives consumer demand and connects potential patients to our websites and the websites of Invisalign providers. Some of the tools that support this stage are Invisalign.com, the Invisalign SmileViewTM tool, My Invisalign app, Doctor Locator, Invisalign® Practice App, and Invisalign® Virtual Appointment. The Align\nTM\n Digital Platform also facilitates the doctor-patient conversation, through education regarding clinical needs and setting expectations. Some of the tools that support this stage include \n11\nAlign™ Oral Health Suite, that integrates iTero diagnostic aid and visualization tools, such as iTero NIRI, iTero Occlusogram, iTero TimeLapse and Invisalign Outcome Simulator Pro with multiple treatment plans.\n•\nOrthodontist Utilization.\n We continue to innovate and increase product applicability and predictability to address a wide range of cases, from simple to complex, thereby enabling doctors to confidently diagnose and treat children and adults with the Invisalign System. This is especially important to treating teenage patients who make up the largest portion of the 22 million annual orthodontic case starts. We also continue to make improvements to our Invisalign treatment software, ClinCheck Pro, designed to deliver an exceptional user experience and increase treatment control to help doctors achieve their treatment goals. In combination with the new Invisalign System innovations that are part of the Align\nTM\n Digital Platform, we are enhancing the digital treatment planning experience for orthodontics by providing doctors with greater flexibility, consistency of treatment preferences and real-time treatment plan access and modification capabilities. \nManufacturing and Suppliers\nWe have regional fabrication facilities in our main markets for clear aligners, which are located in Juarez, Mexico; Ziyang, China; and Wroclaw, Poland. We believe this allows us to better serve our global customer base by being closer to our doctor customers and driving efficiencies in the business. We produce our handheld intraoral scanner wand, perform final scanner assembly and repair our scanners at our facilities in Ziyang, China and Petah Tikva, Israel and also perform final scanner assembly in Blonie, Poland and Juarez, Mexico; as well as service and repair certain scanners in Juarez, Mexico. \nWe also perform digital treatment planning and interpretation for restorative cases based on digital scans generated by our iTero intraoral scanners. Our digital treatment planning facilities are located worldwide, including in Costa Rica, China, Germany, Spain, Poland and Japan, among other international locations.\nOur quality system is required to be in compliance with the Quality System regulations enforced by the FDA, and similar regulations of other worldwide regulatory authorities. We are certified to ISO 13485:2016, an internationally recognized standard for medical device quality. We are routinely audited by third-party certification bodies as well as global health authorities for compliance to this standard and other international regulations. We maintain a formal, documented quality system by which quality objectives are defined, understood and achieved. Systems, processes and procedures are implemented to ensure high levels of product and service quality. We monitor the effectiveness of the quality system based on internal data and direct customer feedback and strive to continually improve our systems and processes, taking corrective action, as needed.\nSince the mass-customized treatment planning and manufacturing processes of our products requires substantial and varied technical expertise, we believe our manufacturing capacity and capabilities are important to our success. In order to produce our highly-customized, highly-precise, medical quality products in volume, we have developed a number of proprietary processes and technologies. These include complex software algorithms and solutions, including AI and machine-learning based CAD/CAM software, vision systems, CT scanning, stereolithography and automated custom clear aligner fabrication equipment. To increase the efficiency and yield of our manufacturing processes, we continue to focus our efforts on software development, equipment development and the improvement of rate-limiting processes or bottlenecks. In addition, we have invested in developing technologies that will allow us to directly print the devices that may help us improve and streamline the processes as well as the performance of devices. We continuously upgrade our proprietary, three-dimensional treatment planning software to enhance computer analysis of treatment data and to reduce time spent on manual and judgmental tasks for each case, thereby increasing the efficiency of our technicians. Moreover, to improve efficiency and increase the scale of our operations, we continue to invest in the development of automated systems for the fabrication and packaging of clear aligners.\nIn addition, predictable and consistent production is essential to our commitment to timely deliver products to our customers efficiently and profitably. Our production can be disrupted by such things as supply chain and shipping issues, production manufacturing software system issues, quality and safety issues, and production equipment downtime. Accordingly, as we have grown our operations, we have included flexibility and resiliency in our overall manufacturing design to mitigate the risks of production downtime. Our manufacturing facilities include backup generators and systems and each facility has an emergency response plan that is part of ongoing employee training and testing through recurring cross functional scenario-based simulation exercises. Likewise, having manufacturing facilities in key regions provides us with greater flexibility and capacity to adjust and redirect production to one or more of our production facilities as needed.\nAs part of our manufacturing resiliency design efforts, we have also considered climate change and climate-related risks such as higher average global temperatures, rising sea levels and more frequent and severe wildfires, hurricanes, floods, winter storms, heat waves and other events and natural disasters (collectively, “climate-related risks”). We view climate-related risks to be one of many operational challenges we face and factor them into our business continuity planning and strategic risk mitigation efforts. \n12\nFor instance, our manufacturing plants and operations may be impacted by extreme temperatures and weather, subjecting us to potential brownouts and blackouts, increased energy costs and capital investments needed to maintain ideal operating temperatures. Our manufacturing facility in Juarez, Mexico is located in an area classified as high-water stress and our operations could be impacted by water shortages, rationing and droughts. Our California, Costa Rica, Mexico and North Carolina operations are located in areas that have historically been impacted by extreme weather events such as hurricanes, tornados, wildfires or flooding. \nIn part to help mitigate risks to our manufacturing operations, we have strategically located our clear aligner production facilities in three facilities on different continents. This allows us to both respond more quickly to customer demand while also offering redundancy in the event natural disasters or climate-related events affect operations at one or more facilities. Moreover, each of our three key clear aligner manufacturing facilities are located at elevations less likely to be impacted by rising sea levels and at least two hundred miles inland.\nMoreover, we are highly dependent on manufacturers of specialized scanning equipment, rapid prototyping machines, resin and other advanced materials for our clear aligners, as well as the optics, electronic and other mechanical components of our intraoral scanners. We maintain single or sole source supplier relationships for many of these machines and materials technologies. In particular, our CT scanning and stereolithography equipment used in our clear aligner manufacturing and many of the critical components for the optics of our intraoral scanners are provided by single or sole source suppliers. We also currently purchase our resin and polymer, the primary raw materials used in our manufacturing process for clear aligners, from a single source. A discussion of the risks of our supply and manufacturing operations, including foreign operations, may be found in Item 1A of this Annual Report on Form 10-K under the heading “\nRisk Factors\n.”\nSales and Marketing\nOur sales and marketing efforts are focused on increasing adoption and utilization of the Invisalign System and Vivera retainers by orthodontists and GPs worldwide and integrating the iTero scanner and services and exocad CAD/CAM products into dental labs and practices. The iTero scanner is an important component to the customer experience and is central to a digital approach as well as overall customer utilization of Invisalign clear aligners. In each region, we have direct sales, marketing and support organizations, which include quota carrying sales representatives, sales management and sales administration. We also have distribution partners in certain markets. Our sales and marketing personnel are organized primarily to support orthodontists and GPs separately, allowing highly trained and specialized personnel to serve each customer channel, thereby increasing our focus and effectiveness on both. We continue to expand in existing markets through targeted investments in sales resources, professional marketing and education programs. Additionally, our consumer marketing programs are designed to create awareness and educate consumers on the benefits of Invisalign treatment and Vivera retainers, including where they can find trained doctors to provide treatment.\nWe provide training, marketing and clinical support to orthodontists and GPs. As of December 31, 2024, we had approximately 130,370 active Invisalign-trained doctors. We define doctors as active if they have submitted at least one Invisalign case in the prior 12-month period.\nResearch and Development\nWe are committed to investing in world-class digital technology development, which we believe is critical to achieving our goal of establishing the Invisalign System as the standard method for treating malocclusion, our iTero intraoral scanners as the preferred scanning technology for digital dental scans, and our exocad CAD/CAM software as the solution of choice for dental labs.\nOur research and development activities are directed toward developing digital technology innovations that we believe will deliver our next generation of products and solutions as part of the Align\nTM\n Digital Platform. These activities range from accelerating product and clinical innovation, to developing manufacturing process improvements, to researching future technologies, products and software.\nIn an effort to demonstrate the broad treatment capabilities of the Invisalign System, more than 200 peer-reviewed publications and various clinical case studies and articles have been published that highlight the clinical applicability of Invisalign treatment to malocclusion cases, including addressing malocclusions of severe complexity. Similarly, various studies have also been published demonstrating the capabilities of our scanners, including advanced features such as our NIRI technology. We undertake pre-commercialization trials and testing of our technological improvements to our products and manufacturing process. We furthermore fund research in the field of orthodontics and dentistry through initiatives such as our \n13\nAnnual Research Award Program, which was in its 15th year in 2024 and donations to the American Association of Orthodontists Foundation. \nIntellectual Property \nWe believe our intellectual property portfolio represents a substantial business advantage. As of December 31, 2024, we had 1,000 active U.S. patents, 1,063 active foreign patents, and 1,012 pending global patent applications. Our active U.S. patents expire between 2025 and 2043. When patents expire, we lose the protection and competitive advantages they provide, which could negatively impact our operating results; however, as we continue to pursue new innovations, we seek intellectual property protection for new inventions and know-how through U.S. and foreign patent applications and non-disclosure agreements. We also seek to protect our software, documentation and other written materials under trade secret and copyright laws. We furthermore have a broad and diverse trademark portfolio that we use to highlight and protect our universally recognized brands. Information regarding risks associated with our proprietary technology and our intellectual property rights may be found in Part I, Item 1A\n \nof this Annual Report on Form 10-K under the heading\n “Risk Factors.”\nSeasonal Fluctuations\nGeneral economic conditions impact our business and financial results, and we have historically experienced seasonal trends within our two operating segments, customer channels and the geographic locations that we serve. Sales of the Invisalign System are often weaker in Europe, especially southern European countries during the summer months and seasonally higher in China during the third quarter. Similarly, other international holidays like Lunar New Year can impact our sales in APAC in the first quarter. In North America, summer is typically the busiest season for orthodontists with practices that have a high percentage of adolescent and teenage patients as many parents start their children in treatment before the school year begins. Conversely, many GPs are on vacation during this time and therefore tend to start fewer cases. For our Systems and Services segment, capital equipment sales are often stronger in the fourth calendar quarter. However, many of these typical seasonal patterns have been impacted by changes in foreign exchange rates, military conflicts, inflation and other macroeconomic challenges. It remains unclear when or if these seasonal fluctuations will return to historical norms. Consequently, seasonal trends have and may continue to cause fluctuations in our quarterly results, including fluctuations in sequential revenue growth rates.\nCompetition\n Competition in the clear aligner market continues to increase. Our clear aligner products compete directly against traditional orthodontic treatments that use metal brackets and wires and increasingly against clear aligner products manufactured and distributed by various companies, both within and outside the United States. Although the number of competitors varies by segment, product, geography and customer, they include new and well-established regional competitors in certain foreign markets, as well as larger companies, divisions of larger companies or well-capitalized new entrants with substantial sales, marketing, research and financial capabilities. We also compete with direct-to-consumer (“DTC”) companies that provide clear aligners directly to the consumer requiring little or no in-office care from doctors and also from doctors themselves who can manufacture retainers and custom clear aligners using 3D printing technology. In addition, corresponding foreign patents began expiring in 2018 which has increased competition outside the United States. \nAdditionally, we face competition in the rapidly evolving markets for intraoral scanners and software solutions, including CAD/CAM. The global intraoral scanner market is very dynamic with participants spanning from traditional dental conglomerates to companies dedicated primarily to scanner development and sales with new entrants playing larger roles. The iTero intraoral scanner also competes with traditional PVS impressions that doctors use for clear aligner therapy or other dental procedures, as well as other intraoral scanners. It also competes with traditional bite wing 2D dental x-rays for detecting interproximal caries. Information regarding risks associated with increased competition may be found in Part I, Item 1A of this Annual Report on Form 10-K under the heading “\nRisk Factors\n.” \nWe believe we are well positioned to compete in the markets we target. We have thousands of dedicated, highly skilled sales force employees who are focused on key demographics in our target markets that allow us to uniquely address customer needs and thereby enhance the customer experience. Our significant historical and ongoing investments in research and development and design around the movement of teeth, SmartTrack aligner materials and design, intraoral scanning, 3D manufacturing, global scale of manufacturing and treatment planning, strong brand name recognition, strong workforce, diversified and knowledgeable customer base, geographic expansion, reliable financial results, leading digital platform, technology and IP, next wave of innovation with direct 3D printing and innovations powered by AI enabling more personalized care, and regulatory clearance of our products are among a few of our key competitive factors that compare favorably with our competitors’ products and services.\n14\nGovernment Regulations \nMany countries throughout the world have established regulatory frameworks for commercialization of medical devices. As a designer, manufacturer, and marketer of medical devices, we are obligated to comply with the respective frameworks of these countries to obtain and maintain access to these global markets. \nThe frameworks often define requirements for marketing authorizations which vary by country. Failure to obtain appropriate marketing authorization and to meet all local requirements, including specific quality and safety standards and new software and AI standards in any country in which we currently market our products, could cause commercial disruption and/or subject us to sanctions and fines. Delays in receipt of, or a failure to receive, such marketing authorizations, or the loss of any previously received authorizations, could have a material adverse effect on our business, financial condition and results of operations.\nWith regards to premarket authorization in the United States, many of our products are classified as medical devices under the U.S. Food, Drug, and Cosmetic Act (“FD&C Act”). The FD&C Act requires these products, when sold in the United States, to be safe and effective for their intended use and to comply with medical device regulations defined by the FDA. The regulatory framework depends on a set of written processes for ensuring consistent quality called a Quality Management System (“QMS”) coupled with a product marketing authorization which depends on the risk classification of the product. This regulatory framework is comparable to the framework established in the European Union (“EU”). Within the EU, our products are subject to the requirements defined by the Medical Device Regulation EU 2017/745 which replaced the Medical Device Directive 93/42/EEC with a final transition date of May 26, 2021. Similar market access regulations exist in Brazil, China, Japan and other countries. Our QMS is routinely audited by certification bodies as well as country regulators for compliance with applicable regulations. We believe we are in material compliance with all state, federal, and international regulatory requirements applicable to our products.\nWe are also subject to various laws around the world that govern interactions with our customers as healthcare professionals or government officials. The laws govern different interactions and may include: prohibiting improper influence of or payments to healthcare professionals, other decision makers or purchasers of medical devices and government officials; setting out rules for when and how to engage healthcare professionals; marketing our products within the regulatory approval (e.g., on label) promotion, sale and marketing of our products and services; the importing and exporting of our products; the operation of our facilities and distribution of our products; and disclosure of payments to healthcare professionals and institutions. As we expand our operations footprint, countries to which we sell and invest in new business models, compliance with applicable laws becomes more complex and the general trend is toward increasingly stringent oversight and enforcement. \nInitiatives sponsored by government agencies, legislative bodies, and the private sector to limit the growth of healthcare expenses generally are ongoing in markets where we do business. It is not possible to predict at this time whether these trends will impact our business or the potential cost containment measures on our future business.\nOur customers are healthcare providers that may be reimbursed by state or federal funded programs such as Medicaid, a foreign national healthcare program, or private pay insurance, each of which may offer some degree of oversight. As a medical device manufacturer and seller, we are subject to transparency reporting laws (also known as sunshine laws) that in certain countries and U.S. states require us to report transfers of value to healthcare professionals that perform services or receive other items from us (e.g., meals, travel, branded promotional or educational items, or other benefits of value). Enforcement actions and associated efforts to respond or defend against enforcement actions can be expensive, and any resulting findings carry the risk of significant civil and criminal penalties.\nIn addition, we must comply with numerous laws and regulations addressing privacy, data protection, data governance and cyber security. Many of these laws and regulations do or will soon regulate or restrict cross-border data transfers, such as in the United States, the EU, Switzerland, Brazil, China, Vietnam, Japan, Korea, Australia, New Zealand, the Kingdom of Saudi Arabia, Hong Kong and other countries. Further, in the United States, we may be required to comply with laws and regulations addressing the collection, use, security and processing of protected health information and other information relating to individuals, including the Health Insurance Portability and Accountability Act of 1996 (“HIPAA”) and its implementing rules. The HIPAA Standards for Privacy of Individually Identifiable Health Information (“Privacy Standards”) and the Security Standards for the Protection of Electronic Protected Health Information under HIPAA and the Health Information Technology for Economic and Clinical Health Act of 2009 (“HITECH Act”) (the “Security Standards”) are the subjects of final and proposed rule amendments, respectively, reflecting the rapidly evolving nature of these laws and regulations. Additionally, many U.S. states maintain laws and regulations addressing privacy, data protection, data governance and cybersecurity. Like many other companies, we must work to ensure our global privacy program framework incorporates applicable requirements of new and modified laws and regulations in relevant jurisdictions to support our efforts to ensure that our product innovations and our associated practices comply with these increasingly complex laws and regulations.\n15\nLegislatures and regulators globally are proposing, and in certain cases have enacted, new laws or regulations regarding privacy, data protection, data governance and cybersecurity that could require us to modify our policies and practices in order to comply with new and evolving obligations relating to these matters. Information regarding risks associated with data security and privacy may be found in Part I, Item 1A\n \nof this Annual Report on Form 10-K under the heading “\nRisk Factors\n.”\nEnvironmental Laws and Regulations\nWe are subject to numerous international, federal, state and local environmental laws, including provisions that regulate the purchase, use, distribution, and environmental impact of hazardous substances used in our operations, contained within our products and the packaging associated with our products. We are also subject to environmental laws applicable to our manufacturing facilities and operations, including environmental health, safety and sustainability regulations. The number and rate at which these regulations are being proposed and implemented are increasing at the regional, country and local territorial levels, requiring greater diligence, governance and skills to manage. We may be required to incur significant costs to comply with existing and new laws and regulations in the future. Information regarding risks associated with environmental laws and regulations may be found in Part I, Item 1A\n \nof this Annual Report on Form 10-K under the heading “\nRisk Factors\n.”\nHuman Capital \nWe believe our culture and commitment to employees provide unique value that benefits Align, its stockholders and the communities and other stakeholders we serve. Every employee, and every job, is important to our success and helps us achieve our purpose of transforming smiles and changing lives. Align is committed to building a global workforce with varied cultural backgrounds and life experiences. Fostering a culture of dignity, integrity, open dialogue, open-mindedness, compassion, fairness, recognition, and shared goals allows us to attract and retain the best talent, and provide a safe and supportive environment that allows our employees to excel.\nAs of December 31, 2024, we had approximately 20,945 employees, a decrease of approximately 3.1% and 9.6% over December 31, 2023, and December 31, 2022, respectively. The number of employees for each of the last five years and our employees’ roles as of December 31, 2024 are as follows: \n \nWe are fundamentally a global organization with approximately 91% of our employees located internationally, primarily in direct-labor roles in our manufacturing and clinical treatment planning facilities. Set forth in the following paragraphs are some of the most important elements of our culture and commitment to our employees.\nGovernance\n. Our commitment to improving the lives of our employees and the communities in which we live and work, including conducting our business ethically, responsibly and transparently through open and clear disclosures that allow us and others to hold us accountable, begins with our Board of Directors (“Board”) and management team. They set the tone for our organization by establishing and clearly communicating our core values of Agility, Customer and Accountability that inform our culture. Our Global Code of Conduct (“Code”) and quality policies are designed to enable us to operate with integrity and deliver superior treatment outcomes and experiences to patients. We seek to create an environment that values the health, safety and well-being of our teams, and we work to equip them with the knowledge and skills to serve our business and develop their careers. We believe that by effectively managing our business with these values as the foundation, we will drive long-term value for our stockholders and all stakeholders.\nAs part of our Board’s commitment to our employees and communities, our Board has delegated oversight responsibility of our policies and practices that foster Align’s sustainability and cultural initiatives, policies, practices, and programs to our \n16\nNominating and Governance Committee. Additionally, our Compensation and Human Capital Committee has oversight responsibilities of all human capital management strategies, programs and policies. Our Compensation and Human Capital Committee regularly reviews and discusses key performance indicators regarding human capital management that allow it to monitor trends on issues such as total headcount, employee hiring, recruiting, attrition, career development, compensation, benefits, workplace culture, and other measures of employee engagement and interest to management and the committee. \nWe believe our success continues to be driven by our focus on integrating and welcoming employees across the globe and of all different backgrounds, orientations, beliefs, perspectives and capabilities into our workforce. Our employees bring a positive mix of ethnic and culturally diverse backgrounds to the 47 different countries in which we operate. Our largest population of employees work in Mexico followed by Costa Rica and China. Employees in the United States represent approximately 9% of our global population. \nOur management team is comprised of individuals from varying countries and nationalities who are committed to promoting and encouraging the health and well-being of our employees at work, at home and in society in general. \nOur work culture is designed to create financial, health, career and personal benefits for our employees and organization. We sponsor cultural recognition events to increase awareness of inclusion and belonging, including its importance in creating an environment where every employee is safe, supported and can thrive.\nOur employees have also established and manage employee groups including employee resource groups which are based on shared characteristics or life experiences. These are open to all employees, including those who do not directly identify with other members.\nTalent Recruitment and Engagement.\n W\ne employ a variety of career development, employee benefits, compensation and other policies and programs designed to attract, develop and retain employees. We focus on building a talent pipeline that nurtures those early in their careers, encourages continuous learning and growth, and incentivizes employees to stay and contribute to our success over the long term. Our programs include early recruitment at high schools and universities, initiatives such as internships, co-ops, apprenticeships, and training programs, quarterly performance management check-ins focused on individual goals and commitment to values and conducting regular employee surveys to build trust and strengthen relationships. \nOur efforts have resulted in numerous awards for our positive work environment and culture. Some of the certifications, awards and recognitions recognized or received in 2024 and 2025 include:\n•\nBest Places to Work for Women in Korea\n•\nDun & Bradstreet Top Tech Companies to Work for in Israel\n•\nGreat Places to Work and Best Places to Work based on our employee-validated great workplaces in the following countries, Australia, Brazil, Canada, China, India, Italy, Korea, Singapore, Taiwan, Thailand, the United Kingdom, Vietnam and Raleigh, North Carolina (United States)\n•\nForbes America’s Dream Employers, America’s Best Midsize Employers, America’s Best Employers for Engineers, America’s Best Employers for New Grads\n•\nFortune, America’s Most Innovative Companies\n•\nLinkedIn Top Companies, Brazil\n•\nMercer China, Healthiest Workplace Award for Outstanding Women Care\n•\nNewsweek, America’s Greatest Workplaces; Greatest Workplaces for Mental Wellbeing America\n17\n•\nU.S. News & World Report - Best Companies to Work For and Best Companies to Work For in the Health Care Industry\nWe believe it is imperative to provide a vibrant employee experience and we value our employees’ collective voices. Accordingly, we conduct employee surveys that utilizes a continuous employee listening strategy.to collect employee feedback critical to improving our culture. This listening strategy includes globally managed pulse surveys, employee lifecycle surveys, and a self-service feature to support listening efforts. We use what we learn from the surveys to improve the employee experience, including enhancements to our workplaces, focus on employee connections, increased career development opportunities, support for relocated employees, and growth in our recognition programs and experiences. Our global response rates are consistently high, reflecting strong engagement by our employees.\nTraining and Professional Development\n. Training is an integral part of developing and retaining our employees and creating a culture of leadership within Align. \nTraining at Align begins with our Code and our strong commitment to ethical business practices in all aspects of our operations. Every employee and contractor is required to review the Code and confirm they understand and will comply with it. We routinely reference the Code in presentations and as part of everyday operations. \nAs a further part of our standard onboarding program, we train employees on important environmental health and safety topics to protect them and the environment. As a general practice, employees are trained to perform their jobs in accordance with all applicable statutory and regulatory requirements and that training is routinely refreshed and re-administered. \nAt Align, we believe employees learn best when skill development is driven by the changing and immediate needs of our employees and by empowering all employees to take action and ownership of their careers. We also believe learning should be relevant and actionable as well as rooted in our purpose and values. Develop@Align enables our global employee population to access a diverse portfolio of approximately 1,800 self-directed courses in up to 80 languages. We also offer a full suite of custom leadership development programs, beginning with aspiring leaders, continuing with managers and directors, and culminating with executive development opportunities. \nWe also recognize we must continually evolve by providing employees with the resources they need to continue to learn, grow, and thrive. To this end, we created Voyage. Voyage is a global initiative that offers a set of tools, resources and a new mindset, empowering employees to start thinking differently about career growth by embracing development opportunities in new and sometimes unexpected ways. Our Voyage Compass helps employees experience their career through four distinct lenses: Self, Networks, Experience and Skills. Since its launch in 2022, over 45% of the population has interacted with Voyage, and there have been over 140,000 visits to the Voyage website. In addition to our navigation site, we annually host two Voyage Set Sail weeks, where we offer experiential learning for individuals and teams utilizing activities that keep professional development front and center in employees’ minds.\nCompensation and Benefits\n. Our benefit and compensation programs reflect the value and contributions our employees make. In addition to competitive base pay, we offer an assortment of benefits that vary by country, roles and contributions, including performance-based variable compensation programs, health and welfare benefit plans, retirement planning services and benefits, holiday and leave policies, equity participation programs such as our 2005 Annual Incentive Plan and Employee Stock Purchase Plan, and charitable and community service opportunities. We also offer discounts to our employees and their dependents who undergo Invisalign treatment. \nWe are furthermore committed to pay equity practices. We exceed minimum pay requirements for our manufacturing employees and regularly review our pay equity practices globally and locally to address discrepancies.\nHealth, Wellness and Safety\n. Our employees’ health and well-being is critical to our success and their continuing achievements. We therefore offer a wide variety of robust programs and initiatives designed to promote the overall health and welfare of all our employees and their families. Every year, we sponsor the Month of Wellness, a month dedicated to well-being and a worldwide movement fostering employee health across our organization. Throughout the Month of Wellness, employees participate in a variety of activities such as informational sessions and health fairs and receive useful resources aligned to our wellness pillars - mental resilience, physical well-being and healthy living, social/family connections, and financial wellness. This provides employees with a variety of meaningful ways to embrace wellness and well-being through mindfulness, meditation, nutrition and mental wellness activities, exercise, hikes, yoga, volunteer activities, financial education sessions, social events and stress management.\nAdditionally, a primary objective is to prevent injuries and occupational diseases by focusing first and foremost on creating and maintaining safe environments. \nWe have e\nnvironmental, health, safety and sustainability personnel who are \n18\nresponsible for ensuring health and safety programs and processes are maintained and effective at each of our locations. Major worksites, such as our clear aligner fabrication sites, and large offices have dedicated Environmental Health and Safety (“EHS”) departments which are dedicated to ensuring our health and safety programs are maintained \nwhile contributing Best Management Practices and general input to corporate-wide programs.\n Each EHS department is responsible for ensuring all employees at their location are properly trained on various EHS topics and at the appropriate frequencies. A training suite is determined for each employee depending on their responsibilities and function modeled off ISO 45001. \nCommunity.\n We actively encourage employees to support charitable organizations by providing opportunities for volunteerism, team building, and donation and matching programs. In \n2024\n, our employees continued to make us proud through their generosity and dedication, especially during our annual Month of Smiles initiative in October where we encourage them to make a difference individually and as teams through volunteer activities, charitable donations, fundraising, and intentional acts of goodness. In addition, through our Align Foundation, we support organizations whose visions closely align with our mission to improve smiles, supporting and educating teens, and empowering our customers through partnerships with learning institutions and foundations. Below are some of our key community initiatives in \n2024\n:\n•\nSince 2013 we have been a proud supporter of Operation Smile, a global medical nonprofit that has provided hundreds of thousands of free surgeries for people born with cleft lips and cleft palates in low and middle-income countries. For the fourth year, we sponsored Operation Smile’s International Student Leadership Conference, a powerful opportunity for youth in high schools and colleges around the world to develop leadership skills and impact their communities. As part of our 2024 sponsorship, we provided full scholarships for 74 participants and students personally impacted with a cleft condition. In addition, we covered a portion of the conference fee for all students to make this opportunity more accessible for all attendees. As of December 31, 2024, we had donated approximately $3.0 million to Operation Smile.\n•\nAs part of Align’s commitment to improving oral health, we partnered with the INCAE Business School as they relaunched the CAHI Jeffe Fellowship in Health and Innovation to improve health services in Latin America. The CAHI Jeffe Fellowship brought together 23 leaders from six Latin American countries and focused on enhancing the quality, accessibility, and affordability of health services through a variety of programs. Align provided scholarships to two leaders from the program who focused on oral health education and expansion of dental health for low-income populations.\n•\nFor 17 years we have supported America’s ToothFairy, an organization with a mission to ensure underserved children in the United States have access to dental care and learn about oral health by supporting nonprofit clinics and community partners. As of December 31, 2024, we have provided almost $2 million for the foundation’s operational expenses and children’s oral health programs. As Title Sponsor of the HERO Program since 2019, we have helped the program reach an estimated 2.7 million children, caregivers, and parents. During America’s ToothFairy’s 2024 fiscal year, which ended June 30th, the HERO Program positively impacted more than 900,000 children and caregivers, including: \n◦\nMore than 600,000 children—33,500 of whom speak a language other than English—who were reached with downloadable resources accessed from AmericasToothFairy.org,\n◦\n43,250 children taught with ToothFairy 101\n®\n Community Education Kits distributed to educators, public health workers, and oral health professionals, and \n◦\nNearly 268,000 people who were reached through two sponsored awareness campaigns that included educational materials and social media kits. \nWe also provide product donations to the dental community to help patients in need of healthy, beautiful smiles. For more information on our charitable and community efforts, please refer to the Corporate Social Responsibility portion of our corporate website located at \nhttps://www.aligntech.com/about/corporate_social_responsibility\n. \nAvailable Information\nOur corporate website address is \nwww.aligntech.com\n, and our investor relations website address is \nhttp://investor.aligntech.com\n. The information on or accessible through either of these websites is not incorporated by reference into this Annual Report on Form 10-K, and the above references to these website URLs are intended to be inactive textual references only. Our Annual Report on Form 10-K, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K, our proxy statement on Schedule 14A for our annual stockholders’ meeting and amendments to reports filed pursuant to Sections 13(a) and 15(d) of the Exchange Act are available, free of charge, on our investor relations website as soon as reasonably practicable after we electronically file or furnish such material with the Securities and Exchange Commission (“SEC”). Further, the SEC maintains an internet site (\nhttp://www.sec.gov) \nthat contains reports, proxy and information statements and other information regarding our filings with the SEC.\n19\nInformation about our Executive Officers\nThe following table sets forth certain information regarding our executive officers as of February 28, 2025:\n \nName\nAge\nPosition\nPeriod\nJoseph M. Hogan\n67\nPresident and Chief Executive Officer of Align\n•  Chief Executive Officer of ABB \n•  Chief Executive Officer of GE Healthcare \n2015-Present\n2008-2013\n2000-2008\nJohn F. Morici\n58\nChief Financial Officer and Executive Vice President, Global Finance of Align\n•  \nChief Financial Officer and Senior Vice President, Global Finance of Align\n•  Chief Financial Officer of Align\n•  EVP and Managing Director of NBC Universal North America   Home Entertainment\n•  CFO/Chief Operating Officer of NBC Universal North America Home  Entertainment\n•  Senior Vice President and Chief Financial Officer of NBC Universal North America Home Entertainment\n2022-Present\n2018-2022\n2016-2018\n2014-2016\n2011-2014\n2007-2011\nJulie Coletti\n57\nExecutive Vice President, Chief Legal and Regulatory Officer of Align\n•  \nSenior Vice President, Chief Legal and Regulatory Officer of Align\n•  Vice President, Associate General Counsel, Strategic Commercial Affairs of Align\n•  Vice President, Global General Counsel and Chief Compliance Officer of Danaher\n•  Vice President, Chief Legal Officer and Corporate Secretary of Bayer HealthCare's MEDRAD/Radiology and Interventional Division\n2022-Present\n2019-2022\n2018-2019\n2013-2017\n2007-2013\nStuart Hockridge\n53\nExecutive Vice President, Global Human Resources of Align\n•  \nSenior Vice Present, Global Human Resources of Align\n•  Vice President, Global Human Resources of Align\n•  Vice President of Talent of Visa\n2022-Present\n2018-2022\n2016-2018\n2013-2016",
  "item7": "Item 7.\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations. \nThe following discussion and analysis of our financial condition and results of operations should be read together with our consolidated financial statements and related notes included elsewhere in this Annual Report on Form 10-K.\nA discussion regarding our financial condition and results of operations for fiscal 2024 compared to fiscal 2023 is presented under Results of Operations of this Form 10-K. Discussions regarding our financial condition and results of operations for fiscal 2023 compared to 2022 have been omitted from this Annual Report on Form 10-K, but can be found in \n\"Item 7. Management's Discussion and Analysis of Financial Condition and Results of Operations\"\n in our Annual Report on Form 10-K for the fiscal year ended December 31, 2023, filed with the SEC on February 28, 2024, which is available without charge on the SEC’s website at \nwww.sec.gov\n and on our investor relations website at \ninvestor.aligntech.com\n.\nExecutive Overview of Results\nTrends and Uncertainties\nOur strategic priorities focus on four principal pillars for growth: (i) international expansion; (ii) general dental practitioners (“GP”) treatment; (iii) patient demand; and (iv) orthodontic utilization. Our growth strategy depends on our ability to facilitate the digital transformation of dentistry happening around the world, our continuous focus on innovation, and expansion to meet and exceed evolving customer expectations as the array of products and services available to them increases. \nWe strive to deliver on each of our strategic growth drivers through a variety of interrelated enterprise-wide efforts including:\n•\nContinuing penetration and adoption of Invisalign clear aligners, intraoral scanners and CAD/CAM solutions in international markets by investing in manufacturing operations, research and development, clinical treatment planning, sales and marketing and building our quality and regulatory capabilities in existing and emerging markets globally. For instance, we have fabrication facilities in three key regions as a part of our strategy to bring operational facilities closer to customers to serve them more quickly and respond to their needs more effectively as well as new treatment planning operations in targeted regional geographies. We have also diversified our research and development activities, which has created a longer term, more stable environment for consistent hiring, retention and innovation in a variety of high technology locations.\n•\nTargeting growth opportunities with international orthodontists and GP customers, particularly with adopters of digital dentistry platforms by tailoring our sales and marketing strategies, manufacturing operations and resources around the unique needs of each customer channel. As we continue growing, we intend to opportunistically expand our research, development, manufacturing, treatment planning, and sales and marketing operations to meet local and regional demand thoughtfully and deliberately. Over the longer-term, we expect international revenues to grow faster than Americas' revenues as a result of growing international demand, our continued investment in international market expansion, the size of the market opportunities and our relatively low market penetration in these regions.\n•\nBuilding confidence within the GP and orthodontic communities through training and education efforts to increase their adoption and utilization of digital dental practice transformation and clear aligner treatment. We continue to expand our clear aligner customer base by educating new doctors on the benefits of digital dentistry through the Invisalign System. We furthermore demonstrate to GPs and orthodontists how the iTero portfolio of intraoral scanners, products like Invisalign Go™ treatment, and CAD/CAM restorative services and workflows can increase revenues and profitability for their dental practices by enhancing patient experiences and creating operational practice efficiencies. DSOs represent a large and growing opportunity to help drive adoption of digital technology across the dental industry. We have well established relationships with many DSOs globally that recognize the benefits of digital workflows enabled by our portfolio of products and services that make up the Align\nTM\n Digital Platform, including increased practice efficiency and profitability, as well as delivering a better patient experience from shorter cycle times and customer proximity. We have and may continue to financially invest in or explore collaborations with key ecosystem partners, including DSOs, whose missions and visions align with our own vision, strategy, business model and goals.\n40\n•\nInvesting in research and development that allows us to innovate, develop and bring to market products and solutions that deliver the ever-increasing clinical precision and predictability that doctors expect with the speed and convenience their patients require.\n•\nCreating demand and enabling patient conversion with targeted investments in advertising and public relations through social media, influencers and other forms of digital communications to encourage treatment by Invisalign trained doctors. We believe that well-designed, targeted sales and marketing promotions that build on our strong brand awareness allow us to differentiate our products and solutions from traditional and emerging competitors. To increase awareness and educate young adults, parents and teens about the benefits of Invisalign treatment, in 2024, we continued to invest in and create campaigns across markets in media platforms such as TikTok, Instagram, YouTube, SnapChat, WeChat, and Douyin. We expect to make further investments to create additional demand for Invisalign System treatment driving more consumers to dental professionals for those treatments.\n•\nPursuing new product lines that complement our doctor-prescribed principal products currently available in certain e-commerce and retail channels in the United States. Similarly, in 2024, we continued our focus on our doctor subscription plan and grew our underpenetrated share of the retainer business through strategic marketing campaigns focused on driving adoption and increasing market share.\n•\nIncreasing global orthodontic utilization rates as doctors’ clinical confidence in the efficacy and predictability of the Invisalign System increases with advancements in products and technology and as patients and doctors demand treatments that emphasize convenience and safety through fewer visits and less invasive and quicker treatments. In addition, the teenage and younger market makes up about 70% of the approximately 22 million total annual global orthodontic case starts. We continue to emphasize the benefits of the Invisalign System for teenage and younger patient treatments through education, training and sales and marketing programs. In 2024, we had record shipments to teenage and younger patients. We expect utilization rates to continue to rise. However, our utilization rates will fluctuate from period to period due to a variety of factors, which may include seasonal trends in our business, consumer demand due to macroeconomic factors, and adoption rates for new products and features.\nBelow is a discussion of the significant trends and uncertainties that could impact our operations:\nMacroeconomic Challenges and Military Conflicts in Ukraine and the Middle East \nOur revenues are susceptible to fluctuations resulting from events and circumstances, including macroeconomic conditions, fluctuations in foreign currency exchange rates, inflation, higher interest rates, actual and threatened wars and military actions, threats or actual imposition of tariffs, customs duties and fees by nations and retaliatory actions, threats of or actual slowdowns or recessions, supply chain challenges, market volatility, employment levels, wages, debt obligations, discretionary income and other factors, each of which impacts customer confidence, consumer sentiment and demand. Many of these same factors also impact our costs and those of our suppliers through higher raw material prices, transportation costs, labor costs, supply and distribution operations. During 2024, we believe sales of our products were adversely impacted by macroeconomic conditions that negatively affected disposable income and consumer demand. We believe this trend will continue in 2025. We also expect the military conflict between Russia and Ukraine to continue to create market uncertainties and dampen consumer sentiment and demand, particularly in Europe. \nAdditionally, government actions in various countries relating to implemented or proposed tariffs, particularly the United States, China, Mexico, and Europe are expected to adversely impact our revenue and cost of goods sold if implemented. The degree of our exposure is dependent on, among other things, the type of goods subject to any tariffs enacted, the tariff rates imposed, the timing of the tariffs and any retaliatory measures enacted. The impact of declining demand may vary by time and region, making operational results uncertain and difficult to predict. We continue to closely monitor the foregoing issues, assess their potential impact on our operations and financial results, and implement plans to mitigate the impact of any adverse events.\nAdditionally, a material amount of our revenues are derived internationally and many of our international operations are denominated in currencies other than the U.S. dollar. In 2024, the U.S. dollar remained strong against major currencies, which negatively impacted our financial condition and results of operations for the year. Foreign exchange volatility and the subsequent strengthening or weakening of the U.S dollar against other currencies remains uncertain and unpredictable.\nWe continue to monitor the potential for violence and military actions that may directly or indirectly impact our personnel, manufacturing, supply chain, and sales. For instance, ongoing conflicts in the Middle East may further exacerbate general and regional macroeconomic instability, particularly if fighting intensifies, spreads to other locations, creates shipping and logistical challenges or cost increases, leads to sanctions or boycotts, or otherwise may materially impact our operations. For instance, our iTero business is headquartered in Israel and, although the sales, delivery times and cost of shipping our \n41\nproducts have not been materially impacted and we have put measures in place to help reduce the future risks, it remains uncertain if there will be impacts on our sales, delivery times or cost of shipping our products. While there have been export and import restrictions imposed against products originating from and businesses operating in Israel, they have not materially impacted our sales or operations to date although we continue to monitor the risk. \nChanging Product Preferences\nAs the markets for clear aligners and digital processes and workflows used to transform the practice of dentistry continue to mature, we continue to anticipate customer and patient expectations and demands will continue to evolve. We expect to meet customer demands with innovative treatment options that include more choices to address a wider scope of treatment goals and budgets based on our existing and new products. This may result in larger and unpredictable variations in geographic and product mix and selling prices with uncertain implications on our financial statements and business operations.\nWe strive to manage the challenges from the trends and uncertainties, including the macroeconomic conditions, tariffs and retaliatory measures, military conflicts and the evolution of our target markets, by focusing on improving our operations, further increasing flexibility and efficiencies in our processes, adjusting our business models to changing circumstances and offering products that meet market demand. Specifically, we are managing financial impacts through strategic product innovations, introductions and pricing actions, implementing cost saving measures and evaluating hiring needs.\nAs an example, there was significant adoption of the Invisalign Comprehensive 3in3 product after it was introduced in 2023 that continued in 2024. The 3in3 configuration offers doctors Invisalign Comprehensive treatment with a three-year treatment expiration date and three additional clear aligners included prior to the treatment expiration date. The 3in3 product also allows us to recognize more revenue up front while doing so at a lower price as compared to our traditional Invisalign comprehensive product that has a five-year treatment expiration date with unlimited additional clear aligners prior to the treatment end date.\nFurther discussion of the impact of these challenges on our business may be found in Part I, Item 1A of this Annual Report on Form 10-K under the heading \n“Risk Factors.”\nKey Financial and Operating Metrics\nWe measure our performance against these strategic priorities by the achievement of key financial and operating metrics. For the year ended December 31, 2024, our business operations reflect the following:\n◦\nRevenues of $3,999.0 million, an increase of 3.5% year-over-year;\n◦\nClear Aligner revenues of $3,230.1 million, an increase of 1.0% year-over-year;\n▪\nAmericas Clear Aligner case revenues of $1,426.3 million, a decrease of 2.5% year-over-year;\n▪\nInternational Clear Aligner case revenues\n \nof $1,500.5 million, an increase of 3.5% year-over-year;\n▪\nClear Aligner volume increase of 3.5% year-over-year and Clear Aligner volume increase for kids and teens of 7.7% year-over-year;\n◦\nImaging Systems and computer-aided design and computer-aided manufacturing (“CAD/CAM”) Services revenues of $768.9 million, an increase of 16.0% year-over-year;\n◦\nIncome from operations of $607.6 million and operating margin of 15.2%;\n◦\nEffective tax rate of 30.8%;\n◦\nNet income of $421.4 million with diluted net income per share of $5.62;\n◦\nCash and cash equivalents of $1,043.9 million as of December 31, 2024;\n◦\nCash provided by operating activities of $738.2 million;\n◦\nCapital expenditures of $115.6 million, primarily related to investments in our manufacturing capacity and facilities; and\n◦\nNumber of employees of 20,945 as of December 31, 2024, a decrease of 3.1% year-over-year. \nOther Statistical Data and Trends\n•\nAs of December 31, 2024, over 19 million people worldwide have been treated with our Invisalign System. Management measures these results by comparing to the millions of people who can benefit from straighter teeth and uses this data to target opportunities to expand the market for orthodontics by educating consumers about the benefits of straighter teeth using the Invisalign System.\n42\n•\nThe total number of Invisalign trained doctors cases were shipped to (doctor submitters) in 2024 was 130.4 thousand compared to 125.8 thousand in 2023, a 3.6% increase. GP and orthodontist doctor submitters increased by approximately 3% and 4%, respectively, in 2024 compared to 2023.  \n•\nOur total utilization rate in 2024 of 19.1 cases per doctor was flat compared to 2023 and slightly down from 19.3 cases per doctor in 2022. Our utilization rates have been impacted by the macroeconomic conditions and other factors as described in the “Trends and Uncertainties” section above. In general, we expect utilization rates to rise over time although they are likely to fluctuate from period to period.\n•\nNorth America: \nThe utilization rate among our North American orthodontist customers was 95.0 cases per doctor in 2024 compared to 94.5 cases per doctor in 2023 and 94.9 cases per doctor in 2022 and the utilization rate among our North American GP customers was 14.3 cases per doctor in 2024 compared to 14.0 cases per doctor in 2023 and 13.9 cases per doctor in 2022. \n•\nInternational:\n International doctor utilization rate was 16.2 cases per doctor in 2024 compared to 16.3 cases per doctor in 2023 and 16.2 cases per doctor in 2022\n.\n* \nInvisalign utilization rates are calculated by the number of cases shipped divided by the number of doctors to whom cases were shipped. Our International region includes Europe, Middle East and Africa (\n“\nEMEA\n”\n) and Asia Pacific (\n“\nAPAC\n”\n). Latin America (\n“\nLATAM\n”\n) is excluded from the International region based on its immateriality to the year; however is included in the Total utilization.\n \nResults of Operations\nNet Revenues by Reportable Segment \nWe group our operations into two reportable segments: Clear Aligner segment and \nSystems and Services\n segment.\n•\nOur Clear Aligner segment consists of Comprehensive Products, Non-Comprehensive Products and Non-Case revenues as defined below:\n•\nComprehensive Products include, but are not limited to, Invisalign Comprehensive, Invisalign First and Invisalign Comprehensive 3in3. \n•\nNon-Comprehensive Products include, but are not limited to, Invisalign Moderate, Lite and Express packages, Invisalign Go and Invisalign Go Plus and Invisalign Palatal Expander.\n43\n•\nIn the United States, Canada, and EMEA, we also offer a Doctor Subscription Program which is our monthly subscription-based clear aligner program. The program allows doctors the flexibility to order retainers and low-stage “touch-up” clear aligners within their subscribed tier and is designed for a segment of experienced Invisalign trained doctors who are currently not regularly using our retainers or low-stage aligners. The low-stage aligners, the Touch up product, are included as a Non-Comprehensive Product.\n•\nNon-Case revenues include, but are not limited to, retention products including retention aligners ordered through the Doctor Subscription Program, Invisalign training, adjusting tools used by dental professionals during the course of treatment and Invisalign Accessory Products that are complementary to our doctor-prescribed principal products such as aligner cases (clamshells), teeth whitening products, cleaning solutions (crystals, foam and other material) and other oral health products available in certain commerce channels in select markets.\n•\nOur Systems and Services segment consists of sales related to our iTero intraoral scanning systems, which includes a single hardware platform and restorative or orthodontic software options, upgrades and leases of scanner systems, sales of pre-owned scanner systems, subscription software, disposables, pay per scan services, as well as exocad’s CAD/CAM software solutions that integrate workflows to dental labs and dental practices.\nNet revenues for our Clear Aligner and Systems and Services segments by region for the year ended December 31, 2024, 2023 and 2022 are as follows (in millions):\n \nYear Ended December 31,\nYear Ended December 31,\nNet Revenues\n2024\n2023\nChange\n2023\n2022\nChange\nClear Aligner revenues:\n    Americas\n$\n1,426.3 \n$\n1,463.0 \n$\n(36.6)\n(2.5)\n%\n$\n1,463.0 \n$\n1,471.9 \n$\n(9.0)\n(0.6)\n%\n    International\n1,500.5 \n1,449.5 \n51.1 \n3.5 \n%\n1,449.5 \n1,349.0 \n100.5 \n7.4 \n%\n    Non-case \n303.3 \n286.9 \n16.4 \n5.7 \n%\n286.9 \n251.7 \n35.2 \n14.0 \n%\nTotal Clear Aligner net revenues\n \n$\n3,230.1 \n$\n3,199.3 \n$\n30.8 \n1.0 \n%\n$\n3,199.3 \n$\n3,072.6 \n$\n126.7 \n4.1 \n%\nSystems and Services net revenues\n768.9 \n662.9 \n106.0 \n16.0 \n%\n662.9 \n662.1 \n0.9 \n0.1 \n%\nTotal net revenues\n$\n3,999.0 \n$\n3,862.3 \n$\n136.8 \n3.5 \n%\n$\n3,862.3 \n$\n3,734.6 \n$\n127.6 \n3.4 \n%\nChanges and percentages are based on actual values. Certain tables may not sum or recalculate due to rounding.\nClear Aligner Case Volume\nCase volume data which represents Clear Aligner case shipments for the year ended December 31, 2024, 2023 and 2022 is as follows (in thousands):\n \nYear Ended December 31,\nYear Ended December 31,\n2024\n2023\nChange\n2023\n2022\nChange\nTotal case volume\n2,493.7 \n2,408.5 \n85.2 \n3.5 \n%\n2,408.5 \n2,398.4 \n10.2 \n0.4 \n%\nChanges and percentages are based on actual values. Certain tables may not sum or recalculate due to rounding.\nTotal net revenues increased by $137 million in 2024 as compared to 2023, primarily due to an increase in Systems and Services net revenues from higher scanner ASP, increase in non-system sales and services revenue. Clear Aligner net revenues increased primarily from an increase in volume, partially offset by lower Clear Aligner ASP.\nClear Aligner - Americas\nAmericas net revenues decreased by $37 million in 2024 as compared to 2023, primarily due to a 3.0% decrease in ASP, resulting in a decrease of net revenues of $44 million. The decrease in ASP was primarily driven by a mix shift to lower priced products and countries which reduced net revenues by $88 million and higher promotional discounts which decreased net \n44\nrevenues by $66 million and unfavorable foreign exchange rates that decreased net revenues by $9 million. These decreases were partially offset by lower net deferrals which increased net revenues by $94 million and price changes which increased net revenues by $19 million. The decrease in ASP was partially offset by an increase in volume which increased net revenues by $7 million.\nClear Aligner - International\nInternational net revenues increased by $51 million in 2024 as compared to 2023\n \ndue to a 7.0% increase in volume, resulting in increased net revenues of $101 million. This increase was partially offset by a decrease of 3.3% in ASP which decreased net revenues by $50 million. Lower ASP was due to unfavorable foreign exchange rates that decreased net revenues by $21 million and a price reduction for sales in the United Kingdom (“UK”) to offset VAT we began charging in 2024, which decreased net revenues by $32 million, a mix shift to lower priced products and countries which reduced net revenues by $60 million and higher promotional discounts which reduced net revenues by $114 million. The decreases in ASP were partially offset by lower net deferrals and price changes which increased net revenues by $99 million and $72 million, respectively. \nClear Aligner - Non-Case\nNon-case net revenues increased by $16 million in 2024 compared to 2023 mainly due to increased volume of Vivera retainers which includes retention aligners ordered through our Doctor Subscription Program.\nSystems and Services\nSystems and Services net revenues increased by $106 million in 2024 as compared to 2023 primarily due to higher scanner ASP which increased net revenues by $45 million, an increase in sales of upgrade scanner systems which increased net revenues by $38 million, higher services revenue which increased net revenues by $19 million and higher volume which increased net revenues by $4 million. Additionally, CAD/CAM software revenues increased net revenues by $7 million. These increases were partially offset by unfavorable foreign exchange rates which decreased net revenues by $7 million.\nCost of net revenues and gross profit (in millions): \n \nYear Ended December 31,\nYear Ended December 31,\n \n2024\n2023\nChange\n2023\n2022\nChange\nClear Aligner\nCost of net revenues\n$\n952.1 \n$\n911.3 \n$\n40.8 \n$\n911.3 \n$\n844.4 \n$\n66.9 \n% of net segment revenues\n29.5 \n%\n28.5 \n%\n28.5 \n%\n27.5 \n%\nGross profit\n$\n2,278.0 \n$\n2,288.0 \n$\n(10.1)\n$\n2,288.0 \n$\n2,228.2 \n$\n59.9 \nGross margin %\n70.5 \n%\n71.5 \n%\n71.5 \n%\n72.5 \n%\nSystems and Services\nCost of net revenues\n$\n247.7 \n$\n244.1 \n$\n3.6 \n$\n244.1 \n$\n256.4 \n$\n(12.3)\n% of net segment revenues\n32.2 \n%\n36.8 \n%\n36.8 \n%\n38.7 \n%\nGross profit\n$\n521.2 \n$\n418.8 \n$\n102.3 \n$\n418.8 \n$\n405.6 \n$\n13.2 \nGross margin %\n67.8 \n%\n63.2 \n%\n63.2 \n%\n61.3 \n%\nTotal cost of net revenues\n$\n1,199.9 \n$\n1,155.4 \n$\n44.5 \n$\n1,155.4 \n$\n1,100.9 \n$\n54.5 \n% of net revenues\n30.0 \n%\n29.9 \n%\n29.9 \n%\n29.5 \n%\nGross profit\n$\n2,799.2 \n$\n2,706.9 \n$\n92.3 \n$\n2,706.9 \n$\n2,633.8 \n$\n73.1 \nGross margin %\n70.0 \n%\n70.1 \n%\n70.1 \n%\n70.5 \n%\nChanges and percentages are based on actual values. Certain tables may not sum or recalculate due to rounding.\nCost of net revenues includes personnel-related costs including payroll and stock-based compensation for staff involved in the production process, the cost of materials, packaging, freight and shipping, depreciation on capital equipment and facilities used in the production process, amortization of acquired intangible assets and training costs.\nClear Aligner\nThe gross margin percentage decreased in 2024 as compared to 2023 primarily due to lower ASPs and higher restructuring expense.\n45\nSystems and Services\nThe gross margin percentage increased in 2024 as compared to 2023 primarily due to higher ASPs and lower cost of net revenues leverage, partially offset by lower service revenue mix.\nSelling, general and administrative (in millions):\n \nYear Ended December 31,\nYear Ended December 31,\n \n2024\n2023\nChange\n2023\n2022\nChange\nSelling, general and administrative\n$\n1,763.2 \n$\n1,703.4 \n$\n59.8 \n$\n1,703.4 \n$\n1,674.5 \n$\n28.9 \n% of net revenues\n44.1 \n%\n44.1 \n%\n44.1 \n%\n44.8 \n%\nChanges and percentages are based on actual values. Certain tables may not sum or recalculate due to rounding.\nSelling, general and administrative expense generally includes personnel-related costs, including payroll, stock-based compensation and commissions for our sales force, marketing and advertising expenses including media, market research, marketing materials, clinical education, trade shows and industry events, legal and outside service costs, equipment, software and maintenance costs, depreciation and amortization expense and allocations of corporate overhead expenses including facilities and Information Technology (“IT”).\nSelling, general and administrative expense increased in 2024 compared to 2023 primarily due to higher employee costs, including salaries, fringe benefits, stock-based compensation and bonus partially offset by lower outside services expense. \nResearch and development (in millions):\n \nYear Ended December 31,\nYear Ended December 31,\n \n2024\n2023\nChange\n2023\n2022\nChange\nResearch and development\n$\n364.2 \n$\n346.8 \n$\n17.4 \n$\n346.8 \n$\n305.3 \n$\n41.6 \n% of net revenues\n9.1 \n%\n9.0 \n%\n9.0 \n%\n8.2 \n%\nChanges and percentages are based on actual values. Certain tables may not sum or recalculate due to rounding.\nResearch and development expense generally includes personnel-related costs, including payroll and stock-based compensation, outside service costs associated with the research and development of new products and enhancements to existing products, software, equipment, material and maintenance costs, depreciation and amortization expense and allocations of corporate overhead expenses including facilities and IT.\nResearch and development expense increased in 2024 compared to 2023 primarily due to higher employee costs, including salaries, fringe benefits, stock-based compensation, net of capitalized labor costs related to internal use software, and bonus, partially offset by lower outside services expense.\nRestructuring and other charges (in millions):\n \nYear Ended December 31,\nYear Ended December 31,\n \n2024\n2023\nChange\n2023\n2022\nChange\nRestructuring and other charges\n$\n33.2 \n$\n13.3 \n$\n19.9 \n$\n13.3 \n$\n11.5 \n$\n1.9 \n% of net revenues\n0.8 \n%\n0.3 \n%\n0.3 \n%\n0.3 \n%\nChanges and percentages are based on actual values. Certain tables may not sum or recalculate due to rounding.\nRestructuring and other charges increased in 2024 compared to 2023 due to higher severance and other one-time post-employment benefits, driven by a more significant restructuring plan initiated in 2024. Refer to \nNote 17\n “\nRestructuring and Other Charges” of the Notes to Consolidated Financial Statements\n for more information.\n46\nLegal settlement loss (in millions):\n \nYear Ended December 31,\nYear Ended December 31,\n \n2024\n2023\nChange\n2023\n2022\nChange\nLegal settlement loss\n$\n31.0 \n$\n— \n$\n31.0 \n$\n— \n$\n— \n$\n— \n% of net revenues\n0.8 \n%\n— \n%\n— \n%\n— \n%\nChanges and percentages are based on actual values. Certain tables may not sum or recalculate due to rounding.\nLegal settlement loss incurred during 2024 was due to litigation and other settlements. Refer to \nNote 8\n \n“Legal Proceedings” of the Notes to Consolidated Financial Statements\n for more information.\nIncome from operations (in millions):\n \nYear Ended December 31,\nYear Ended December 31,\n \n2024\n2023\nChange\n2023\n2022\nChange\nClear Aligner\nIncome from operations\n$\n1,142.2 \n$\n1,182.3 \n$\n(40.1)\n$\n1,182.3 \n$\n1,134.4 \n$\n47.8 \nOperating margin %\n35.4 \n%\n37.0 \n%\n37.0 \n%\n36.9 \n%\nSystems and Services\nIncome from operations\n$\n269.2 \n$\n191.4 \n$\n77.9 \n$\n191.4 \n$\n179.8 \n$\n11.6 \nOperating margin %\n35.0 \n%\n28.9 \n%\n28.9 \n%\n27.2 \n%\nTotal Income from operations \n1\n$\n607.6 \n$\n643.3 \n$\n(35.7)\n$\n643.3 \n$\n642.6 \n$\n0.7 \nOperating margin %\n15.2 \n%\n16.7 \n%\n16.7 \n%\n17.2 \n%\nChanges and percentages are based on actual values. Certain tables may not sum or recalculate due to rounding.\n1\n    \nRefer to\n Note 16 “Segments and Geographical Information” of the Notes to Consolidated Financial Statements\n for details on unallocated corporate expenses and the reconciliation to consolidated Income from operations.\nTotal operating margin percentage decreased in 2024 compared to 2023 primarily \ndue to increased legal settlement losses, restructuring and other charges and employee costs. Refer to\n \nNote 8\n “\nLegal Proceedings\n”\n \nof the Notes to Consolidated Financial Statements\n.\n \nClear Aligner\nOperating margin percentage decreased in 2024 compared to 2023 primarily \ndue to a decrease in gross margin and an increase in employee costs.\n \nSystems and Services\nOperating margin percentage increased in 2024 compared to 2023 primarily due to \nhigher gross margin, partially offset by an increase in employee costs\n. \nInterest income (in millions):\n \nYear Ended December 31,\nYear Ended December 31,\n \n2024\n2023\nChange\n2023\n2022\nChange\nInterest income\n$\n20.2 \n$\n17.3 \n$\n3.0 \n$\n17.3 \n$\n5.4 \n$\n11.9 \n% of net revenues\n0.5 \n%\n0.4 \n%\n0.4 \n%\n0.1 \n%\nChanges and percentages are based on actual values. Certain tables may not sum or recalculate due to rounding.\nInterest income generally includes interest earned on cash, cash equivalents and investment balances.\nInterest income increased in 2024 compared to 2023 primarily due to primarily due to higher cash and cash equivalents.\n47\nOther income (expense), net (in millions):\n \nYear Ended December 31,\nYear Ended December 31,\n \n2024\n2023\nChange\n2023\n2022\nChange\nOther income (expense), net\n$\n(18.9)\n$\n(19.4)\n$\n0.5 \n$\n(19.4)\n$\n(48.9)\n$\n29.5 \n% of net revenues\n(0.5)\n%\n(0.5)\n%\n(0.5)\n%\n(1.3)\n%\nChanges and percentages are based on actual values. Certain tables may not sum or recalculate due to rounding.\nOther income (expense), net, generally includes foreign exchange gains and losses, gains and losses on foreign currency forward contracts, interest expense, gains and losses on equity investments and other miscellaneous charges.\nOther income (expense), net increased in 2024 compared to 2023\n \nprimarily due to gains recorded on our equity investments, offset by the unfavorable impact of foreign exchange rates.\nProvision for income taxes (in millions): \n \nYear Ended December 31,\nYear Ended December 31,\n \n2024\n2023\nChange\n2023\n2022\nChange\nProvision for (benefit from) income taxes\n$\n187.6 \n$\n196.2 \n$\n(8.6)\n$\n196.2 \n$\n237.5 \n$\n(41.3)\nEffective tax rates\n30.8 \n%\n30.6 \n%\n30.6 \n%\n39.6 \n%\nChanges and percentages are based on actual values. Certain tables may not sum or recalculate due to rounding.\nThe increase in our effective tax rate for the year ended December 31, 2024 compared to the same period in 2023 is \nprimarily attributable to an increase in U.S. taxes on foreign earnings, partially offset by a change in our jurisdictional mix of income and release of unrecognized tax benefits due to a lapse of the statute of limitation.\nLiquidity and Capital Resources\nLiquidity and Trends\nAs of December 31, 2024 and 2023, we had the following cash and cash equivalents and short-term and long-term marketable securities (in thousands):\nDecember 31,\n \n2024\n2023\nCash and cash equivalents\n$\n1,043,887 \n$\n937,438 \nMarketable securities, short-term \n— \n35,304 \nMarketable securities, long-term\n— \n8,022 \nTotal\n$\n1,043,887 \n$\n980,764 \nAs of December 31, 2024 and 2023, approximately $855 million and $785 million, respectively, of cash, cash equivalents and marketable securities were held by our foreign subsidiaries. We continue to evaluate opportunities to repatriate our foreign earnings if or when needed. We do not expect to incur significant additional costs upon repatriation of these foreign earnings. We generate sufficient domestic operating cash flow and have access to $300 million under our revolving line of credit. We believe that our current cash balances and the borrowing capacity under our credit facility, if necessary, will be sufficient to fund our business for at least the next 12 months.\nOur material cash requirements as of December 31, 2024 are as follows:\n•\nOur purchase commitments consist primarily of open purchase orders for goods and services, including manufacturing inventory, supplies and services, sales and marketing, research and development services and technological services, issued in the normal course of business. Our purchase commitments totaled $1,193 million. We anticipate a majority, an estimated $1,003 million, will be payable within the next 12 months. These purchase commitments exclude capital expenditures. \n•\nWe expect our investments in capital expenditures to be between $100 million and $150 million for the next 12 months. Capital expenditures primarily relate to building construction and improvements as well as additional manufacturing capacity. Despite the challenging market conditions, we intend to expand our investments in research \n48\nand development, manufacturing, treatment planning, sales and marketing operations to meet actual and anticipated demand. \n•\nWe have future operating lease payments of $133 million, which includes $2.6 million for leases that have not yet commenced as of December 31, 2024. Refer to \nNote 4 \n“\nLeases\n”\n of the Notes to Consolidated Financial Statements \nfor details on the lease payments. \n•\nWe have approximately $297 million, inclusive of approximately $72 million repurchased in January 2025, available for repurchases of our common stock under the stock repurchase program authorized by our Board of Directors in January 2023 (“January 2023 Repurchase Program”). Our stock repurchase program is subject to periodic \nevaluations to determine when and if repurchases are in the best interests of our stockholders, taking into account prevailing market conditions. \nRefer to \nNote 11 \n“\nCommon Stock Repurchase Programs\n”\n of the Notes to Consolidated Financial Statements \nfor details on our stock repurchase activity. \n•\nIn 2024, we agreed, in principle, to settle certain legal matters. As of December 31, 2024, a total of $27.5 million remained unpaid. Settlement payments will be made in accordance with the terms and conditions as set forth in the settlement agreement. \nRefer to \nNote 8\n \n“\nLegal Proceedings\n”\n \nof the Notes to Consolidated Financial Statements\n for more information.\n•\nAs of December 31, 2024, we had no material off-balance sheet arrangements that have, or are reasonably likely to have, a current or future material impact on our liquidity or capital resources. \nSources and Uses of Cash \n The following table summarizes our Consolidated Statements of Cash Flows for the year ended December 31, 2024, 2023 and 2022 (in\n \nthousands): \n \nYear Ended December 31,\n \n2024\n2023\n2022\nNet cash provided by (used in):\nOperating activities\n$\n738,231 \n$\n785,776 \n$\n568,732 \nInvesting activities\n(254,912)\n(195,943)\n(213,316)\nFinancing activities\n(355,722)\n(598,340)\n(501,686)\nEffects of foreign exchange rate changes on cash, cash equivalents, and restricted cash \n(21,153)\n4,671 \n(11,514)\nNet (decrease) increase\n \nin cash, cash equivalents, and restricted cash\n$\n106,444 \n$\n(3,836)\n$\n(157,784)\nOperating Activities\nFor the year ended December 31, 2024, cash flows from operations of $738 million resulted primarily from our net income of approximately $421 million as well as the following:\nSignificant adjustments to net income\n•\nStock-based compensation of $174 million related to equity awards granted to employees and directors; and\n•\nDepreciation and amortization of $145 million related to our investments in property, plant and equipment and intangible assets.\nSignificant changes in working capital \n•\nNet inflow of $90 million from accrued and other long-term liabilities primarily due to timing of payments;\n•\nNet inflow of $68 million from prepaid expenses and other assets primarily due to settlement of tax matter. Refer to Note 8\n \n“Legal Proceeding\ns\n”\n of the Notes to Consolidated Financial Statements\n.\n•\nNet outflow of $80 million from deferred revenues; and\n•\nNet outflow of $153 million from accounts receivable due to timing of collections and increased revenues.\n49\nFor the year ended December 31, 2023, cash flows from operations of $786 million resulted primarily from our net income of approximately $445 million as well as the following:\nSignificant adjustments to net income\n•\nStock-based compensation of $154 million related to equity awards granted to employees and directors; and\n•\nDepreciation and amortization of $142 million related to our investments in property, plant and equipment and intangible assets.\nSignificant changes in working capital\n•\nNet inflow of $46 million from accrued and other long-term liabilities primarily due to higher incentive accruals for 2023, as well as timing of payments of other activities;\n•\nNet inflow of $87 million from deferred revenues due to the deferral of revenue on shipments;\n•\nNet inflow of $30 million from inventories primarily due to lower purchases of materials used in manufacturing; and \n•\nNet outflow of $105 million, net from accounts receivable due to timing of collections and increased revenues.\nInvesting Activities\nNet cash used in investing activities was $255 million for the year ended December 31, 2024 which primarily consisted of $116 million for purchases of property, plant and equipment, $77 million for the Cubicure acquisition and $106 million for investments in privately held companies, partially offset by sales and maturities of marketable securities of $44 million.  \nNet cash used in investing activities was $196 million for the year ended December 31, 2023 which primarily consisted of purchases of property, plant and equipment of $178 million which included a building acquisition for $25 million, an investment in equity of a privately held company of $77 million and purchases of marketable securities of $3 million, partially offset by sales and maturities of marketable securities of $61 million.\nFinancing Activities\nNet cash used in financing activities was $356 million for the year ended December 31, 2024 which consisted of payments to repurchase shares of our common stock of $353 million and payroll taxes paid for equity awards through share withholdings of $28 million, which were partially offset by proceeds from the issuance of common stock for $25 million. \nNet cash used in financing activities was $598 million for the year ended December 31, 2023 which consisted of payments to repurchase shares of our common stock of $602 million and payroll taxes paid for equity awards through share withholdings of $23 million, which were partially offset by proceeds from the issuance of common stock for $27 million of proceeds from the issuance of common stock.\nCritical Accounting Estimates \nManagement’s discussion and analysis of our financial condition and results of operations is based upon our consolidated financial statements, which have been prepared in accordance with accounting principles generally accepted in the United States of America. The preparation of financial statements requires management to make estimates and judgments that affect the reported amounts of assets and liabilities, revenues and expenses and disclosures at the date of the financial statements. We evaluate our estimates on an on-going basis and use authoritative pronouncements, historical experience and other assumptions as the basis for making the estimates. Actual results could differ from those estimates.\nWe believe the following critical accounting estimates affect our more significant judgments used in the preparation of our consolidated financial statements. For further information on all of our significant accounting policies, see \nNote 1 \n“\nSummary of Significant Accounting Policies\n” \nof the Notes to Consolidated Financial Statements\n.\n50\nRevenue Recognition\nOur revenues are derived primarily from the sale of aligners, scanners, and services from our Clear Aligner and Systems and Services segments. We enter into sales contracts that may consist of multiple distinct performance obligations. Sales contracts with multiple performance obligations require management to exercise judgment in allocating the transaction price, based on standalone selling prices, to each performance obligation and determining the timing of revenue recognition which directly impacts our unfulfilled performance obligations at period end.\nDetermining the standalone selling price (“SSP”) in order to allocate consideration from the contract to the individual performance obligations is the result of various factors, such as historical prices, changing trends and market conditions, costs, and gross margins. While changes in the allocation of the SSP between performance obligations will not affect the amount of total revenues recognized for a particular contract, any material changes could impact the timing of revenue recognition, which would have a material effect on our financial position and result of operations. This is because the contract consideration is allocated to each performance obligation, delivered or undelivered, at the inception of the contract based on the SSP of each distinct performance obligation.\nWe allocate consideration for each clear aligner treatment plan based on each unit’s SSP. Management considers a variety of factors such as same or similar product historical sales, costs, and gross margin, which may vary over time depending upon the unique facts and circumstances related to each performance obligation in making these estimates. In addition to historical data, we take into consideration changing trends and market conditions. For treatment plans with multiple options, we also consider usage rates, which is the number of times a customer is expected to order more aligners after the initial shipment. Our process for estimating usage rates requires significant judgment and evaluation of inputs, including historical usage data by region, country and channel.\nWe estimate the SSP of each element in a scanner system and services sale taking into consideration same or similar product historical prices as well as our discounting strategies. For CAD/CAM services, we estimate the SSP of each element, including the initial software license and maintenance and support, using data such as historical prices.\nUnfulfilled Performance Obligations for Clear Aligners and Scanners\nOur unfulfilled performance obligations, including deferred revenues and backlog, and the estimated revenues expected to be recognized in the future related to these performance obligations are $1,444.9 million and $1,578.3 million as of December 31, 2024 and 2023, respectively. This includes performance obligations from the Clear Aligner reportable segment, primarily the shipment of additional aligners, which are fulfilled over six months to five years. This also includes performance obligations from our Systems and Services reportable segment, primarily services and support, which are fulfilled over one to five years, and contracted deliveries of additional scanners. The estimate includes both product and service unfulfilled performance obligations and the time range reflects our best estimate of when we will transfer control to the customer and may change based on customer usage patterns, timing of shipments, readiness of customers' facilities for installation, and manufacturing availability.\nImpairment of Goodwill and Finite-Lived Intangible Assets\nGoodwill\nWe evaluate goodwill for impairment at least annually on November 30th or more frequently if indicators of impairment are identified between annual testing dates. Goodwill is tested for impairment between annual testing dates when events or circumstances indicate that the fair value of a reporting unit has been reduced below its carrying value. When an indicator of impairment is identified we perform a quantitative impairment assessment in which we determine the fair value of a reporting unit and compare it to the carrying value of the respective reporting unit. We generally determine the fair value of a reporting unit via a discounted cash flow (“DCF”) analysis and allocate our net assets to each reporting unit to determine carrying value. The use of a DCF model requires management to exercise significant judgement related to operating assumptions and estimates including, revenue growth rates, terminal growth rates, operating margins and discount rates, among others. Additionally, management exercises judgement when determining the methodology used to allocate net assets to each reporting unit. We will record an impairment charge when our quantitative impairment analysis indicates that the carrying value of a reporting unit exceeds its fair value. \nFinite-Lived Intangible Assets\nFinite-lived intangible assets are reviewed for impairment when events or circumstances indicate that the carrying value of an asset (asset group) may not be recoverable. When an impairment indicator is identified, we perform a recoverability test, in \n51\nwhich the estimated, undiscounted future cash flows expected to result from the use and eventual disposition of the asset (asset group) are compared to the carrying value of the asset (asset group). When our recoverability test results in undiscounted cash flows that are greater than carrying value, no impairment is recorded. However, when our recoverability test results in undiscounted cash flows that are less than carrying value, we determine the fair value of the asset (asset group) and reduce the carrying amount of the asset (asset group), through an impairment charge, to its fair value. The process of identifying impairment indicators, preparing an undiscounted cash flow and determining the fair value of the asset (asset group) require management to exercise significant judgement related to various assumptions and estimates.\nIf we were to have impairments to goodwill or finite-lived intangible assets, it could adversely affect our operating results. During the year ended 2024 and 2023, we did not have any impairment charges related to our goodwill or finite-lived intangible assets. \nAccounting for Income Taxes \nWe are subject to income taxes in the United States and numerous foreign jurisdictions. The evaluation of our uncertain tax positions involves significant judgment in the interpretation and application of U.S. GAAP and complex domestic and international tax laws related to the allocation of international taxation rights between countries. We are also required to evaluate the realizability of our deferred tax assets on an ongoing basis in accordance with U.S. GAAP. Realization of our deferred tax assets is dependent on our ability to generate future taxable income which is determined based on assumptions such as estimated growth rates in revenues, gross margins, future cash flows and discount rates in the jurisdictions in which we operate. The accuracy of these estimates could be affected by unforeseen events or actual results, and the sustainability of our future tax benefits is dependent upon the acceptance of these valuation estimates and assumptions by the taxing authorities. We may, in the future, be required to increase the valuation allowance to take into account additional deferred tax assets that we may be unable to realize. \nAccounting for Legal Proceedings\nEstimates of probable losses resulting from litigation are inherently difficult to make, particularly when the matters are in early procedural stages with incomplete facts and information. The final outcome of legal proceedings is dependent on many variables that are difficult to predict and, therefore, the ultimate cost to resolve such matters may be materially different than our current estimates. Consequently, new information or changes in judgments and estimates could have a material adverse effect on our business, financial condition, and results of operations or cash flows.\nRecent Accounting Pronouncements\nSee \nNote 1\n “\nSummary of Significant Accounting Policies” of the Notes to Consolidated Financial Statements\n for a discussion of recent accounting pronouncements, including the expected dates of adoption and estimated effects, if any, on results of operations and financial condition, which is incorporated herein.",
  "item2": null
}