{
  "source_file": "all-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations \nOverview  \nThe following discussion highlights significant factors influencing the consolidated financial position and results of operations of The Allstate Corporation (referred to in this document as “we,” “our,” “us,” the “Company” or “Allstate”). It should be read in conjunction with the condensed consolidated financial statements and related notes thereto found under Part I. Item 1. contained herein, and with the discussion, analysis, consolidated financial statements and notes thereto in Part I. Item 1. and Part II. Item 7. and Item 8. of The Allstate Corporation annual report on Form 10-K for 2024, filed February 24, 2025.\nFurther analysis of our insurance segments Allstate Protection and Run-off Property-Liability, together Property-Liability Operations, and Protection Services, is provided in Management’s Discussion and Analysis (“MD&A”). The segments are consistent with the way in which the chief operating decision maker reviews financial performance and makes decisions about the allocation of resources. The dispositions of the employer voluntary benefits (“EVB”) and group health businesses did not qualify for discontinued operations. Starting in the third quarter of 2025, the Allstate Health and Benefits segment is no longer a reportable segment, with results of this segment recast to reflect only the results of the EVB and group health businesses. The retained individual health business, previously included in the Allstate Health and Benefits segment, is a non-reportable segment with results included in all other for all periods presented.\nMeasuring segment profit or loss\nThe measure of segment profit or loss used in evaluating performance is underwriting income for the Allstate Protection and Run-off Property-Liability segments and adjusted net income for the Protection Services and Corporate segments. We use these measures in our evaluation of results of operations to analyze profitability.\nUnderwriting income\n is calculated as premiums earned and other revenue, less claims and claims expense (“losses”), amortization of deferred policy acquisition costs (“DAC”), operating costs and expenses, amortization or impairment of purchased intangibles and restructuring and related charges, as determined using accounting principles generally accepted in the United States of America (“GAAP”).\nAdjusted net income (loss)\n is net income (loss) applicable to common shareholders, excluding:\n•\nNet gains and losses on investments and derivatives\n•\nPension and other postretirement remeasurement gains and losses\n•\nAmortization or impairment of purchased intangibles\n•\nGain or loss on disposition\n•\nAdjustments for other significant non-recurring, infrequent or unusual items, when (a) the nature of the charge or gain is such that it is reasonably unlikely to recur within two years, or (b) there has been no similar charge or gain within the prior two years\n•\nIncome tax expense or benefit on reconciling items\nMacroeconomic impacts\nMacroeconomic factors have and may continue to impact the results of our operations, financial condition and liquidity, such as U.S. government fiscal and monetary policies, the Russia/Ukraine conflict, supply chain disruptions and labor shortages. \nTariffs \n \nBeginning on April 2, 2025, the U.S. government announced additional tariffs on goods imported to the U.S. We regularly evaluate scenarios to understand the potential impact of tariffs on our businesses and incorporate estimates of the impact into our development of reserves for claims. The evolving and uncertain global trade environment makes it difficult to predict the full effect on our business. The following factors may impact operations at levels beyond what we are currently observing:\n•\nHigher new and used vehicle pricing and replacement parts, increasing claims costs in Allstate Protection and Dealer Services\n•\nIncreases in building material costs, driving increases in homeowners claim costs\n•\nLack of availability of replacement parts from disruption in global trade broadly impacting all businesses\n•\nFewer auto new issued applications due to lower new and used vehicle sales\n•\nReduced demand in Dealer Services due to lower new vehicle sales\n•\nLower premiums written from reduced U.S. retail sales in Protection Plans\n•\nHigher claims costs at Protection Plans \n•\nBad debt and credit allowance exposure in all businesses\n•\nAdverse impacts on investment valuations and liquidity for market-based and performance-based investments\nThis is not inclusive of all potential impacts and should not be treated as such. \nThird Quarter 2025 Form 10-Q  \n \n45\nCorporate strategy\nOur strategy has two components: increase personal property-liability market share and expand protection offerings by leveraging the Allstate brand, customer base and capabilities.\nTransformative Growth\n is about creating a business model, capabilities and culture that continually transform to better serve customers. This is done by providing affordable, simple and connected protection through multiple distribution methods. The ultimate objective is to enhance customer value to drive growth in all businesses. \nIn the personal property-liability businesses, this has five key components:\n•\nImproving customer value\n•\nExpanding customer access\n•\nIncreasing sophistication and investment in customer acquisition \n•\nDeploying new technology ecosystems\n•\nDriving organizational transformation\nWe are expanding Protection Services businesses internationally and by leveraging the Allstate brand, customer base and capabilities.\nDispositions \nOn April 1, 2025, we closed the sale of American Heritage Life Insurance Company and American Heritage Service Company, comprising our employer voluntary benefits (“EVB”) business. We recorded a gain on the sale of $888 million or $641 million, after-tax for the nine months ended September 30, 2025.\nOn July 1, 2025, we closed the sale of Direct General Life Insurance Company, NSM Sales Corporation and The Association Benefits Solution, LLC, comprising the group health business. We recorded a gain on sale of approximately $722 million or $506 million, after-tax in the third quarter of 2025.\nSee Note 3 of the condensed consolidated financial statements for further information on the EVB and group health dispositions.\nHighlights\n \nQ1\nQ2\nQ3\nConsolidated net income applicable to common shareholders\n($ in millions)\nConsolidated net income applicable to common shareholders\n increased $2.56 billion to $3.72 billion in the third quarter of 2025 and increased $3.71 billion to $6.36 billion in the first nine months of 2025 compared to the same periods of 2024, primarily due to higher underwriting income and gains on dispositions.\nTotal revenues\n($ in millions)\nTotal revenues\n increased 3.8% to $17.26 billion in the third quarter of 2025 and increased 5.8% to $50.34 billion in the first nine months of 2025 compared to the same periods of 2024, primarily due to higher auto and homeowners insurance policies in force and premium rate increases.\nNet investment income\n($ in millions)\nNet investment income\n increased $166 million to $949 million in the third quarter of 2025 and increased $298 million to $2.56 billion in the first nine months of 2025 compared to the same periods of 2024, primarily due to higher market-based and performance-based investment results.\n46\n \nwww.allstate.com\nFinancial highlights\nInvestments \ntotaled $82.33 billion as of September 30, 2025, increasing from $72.61 billion as of December 31, 2024. \nAllstate shareholders’ equity\n was $27.51 billion as of September 30, 2025, increasing from $21.44 billion as of December 31, 2024, primarily due to net income and an increase in unrealized net capital gains on investments in 2025, partially offset by common share repurchases and dividends to shareholders.\nBook value per diluted common share\n (ratio of Allstate common shareholders’ equity to total common shares outstanding and dilutive potential common \nshares outstanding) was $95.95 as of September 30, 2025, an increase of 36.4% from $70.35 as of September 30, 2024, and an increase of 32.6% from $72.35 as of December 31, 2024.\nReturn on average Allstate common shareholders’ equity \nfor the twelve months ended September 30, 2025, was 37.2%, an increase of 11.1 points from 26.1% for the twelve months ended September 30, 2024. The increase was primarily due to higher net income applicable to common shareholders for the trailing twelve-month period ending September 30, 2025.\nSummarized consolidated financial results\nThree months ended September 30,\nNine months ended September 30,\n($ in millions)\n2025\n2024\n2025\n2024\nRevenues\n \n \n \n \nProperty and casualty insurance premiums\n$\n15,253 \n$\n14,333 \n$\n44,992 \n$\n41,797 \nAccident and health insurance premiums and contract charges\n110 \n487 \n832 \n1,439 \nOther revenue\n691 \n781 \n2,200 \n2,129 \nNet investment income \n949 \n783 \n2,557 \n2,259 \nNet gains (losses) on investments and derivatives\n252 \n243 \n(241)\n(24)\nTotal revenues\n17,255\n \n16,627\n \n50,340\n \n47,600\n \nCosts and expenses\n \n \n \n \nProperty and casualty insurance claims and claims expense\n(8,654)\n(10,409)\n(29,718)\n(30,711)\nAccident, health and other policy benefits\n(67)\n(317)\n(588)\n(904)\nAmortization of deferred policy acquisition costs\n(2,101)\n(2,037)\n(6,264)\n(5,977)\nOperating, restructuring and interest expenses\n(2,383)\n(2,349)\n(6,994)\n(6,471)\nPension and other postretirement remeasurement gains (losses)\n108 \n(26)\n30 \n(15)\nAmortization of purchased intangibles\n(59)\n(71)\n(175)\n(210)\nTotal costs and expenses\n(13,156)\n(15,209)\n(43,709)\n(44,288)\nGain on disposition of operations\n720 \n— \n1,610 \n— \nIncome from operations before income tax expense\n4,819\n \n1,418\n \n8,241\n \n3,312\n \nIncome tax expense\n(1,075)\n(254)\n(1,802)\n(603)\nNet income\n3,744\n \n1,164\n \n6,439\n \n2,709\n \nLess: Net loss attributable to noncontrolling interest\n(2)\n(26)\n(11)\n(30)\nNet income attributable to Allstate\n3,746\n \n1,190\n \n6,450\n \n2,739\n \nPreferred stock dividends\n(29)\n(29)\n(88)\n(88)\nNet income applicable to common shareholders\n$\n3,717\n \n$\n1,161\n \n$\n6,362\n \n$\n2,651\n \nSegment highlights\nAllstate Protection \nunderwriting income was $3.04 billion in the third quarter of 2025 compared to underwriting income of $555 million in the third quarter of 2024, due to lower catastrophe losses, increased premiums earned and the benefit of prior year reserve releases. Underwriting income totaled $4.69 billion in the first nine months of 2025 compared to underwriting income of $1.32 billion in the first nine months of 2024, due to increased premiums earned and the benefit of prior year reserve releases, partially offset by higher expenses. \nCatastrophe losses were $558 million and $4.75 billion in the third quarter and first nine months of 2025, respectively, compared to $1.70 billion and $4.55 billion in the third quarter and first nine months of 2024, respectively.\nPremiums written increased 6.3% to $15.63 billion in the third quarter of 2025 and increased 6.7% to $44.97 billion in the first nine months of 2025 compared to the same periods of 2024, reflecting higher auto and homeowners insurance policies in force and premium rate increases.\nThird Quarter 2025 Form 10-Q  \n \n47\nProtection Services \nadjusted net income was $46 million in the third quarter of 2025 compared to $58 million in the third quarter of 2024. Adjusted net income was $161 million the first nine months of 2025 compared to $167 million in the nine months of 2024. The decrease in both periods was primarily due to higher expenses at Arity and increased claims at Protection Plans, partially offset by premium growth at Protection Plans.\nPremiums and other revenue increased 12.7% to $844 million the third quarter of 2025 and increased 13.5% to $2.45 billion in the first nine months of 2025 compared to the same periods of 2024, primarily due to growth at Protection Plans.\nIncome taxes\n  The effective tax rate is the ratio of income tax expense (benefit) divided by income (loss) from operations before income tax expense. For the first nine months ended September 30, 2025, we reported an effective tax rate of 21.9% based on total \nincome tax expense of $1.80 billion on total income from operations before income tax expense of $8.24 billion. The effective rate for the first nine months ended September 30, 2025, is higher than the federal statutory rate of 21%, primarily due to non-deductible goodwill and higher state income taxes arising from the sales of the EVB and group health businesses, offset by tax benefits derived from tax credits, tax-exempt interest income and share-based payments.\nFor the first nine months ended September 30, 2024, we reported an effective tax rate of 18.2% based on a total income tax expense of $603 million on income from operations before income tax benefit of $3.31 billion. The effective tax rate for the first nine months ended 2024 was lower than the federal statutory rate of 21% due to the additional tax benefit derived from tax credits, shared-based payments and tax-exempt interest income.\nReconciliation of the statutory federal income tax rate to the effective income tax rate\nThree months ended\nSeptember 30,\nNine months ended\nSeptember 30,\n($ in millions)\n2025\n2024\n2025\n2024\nIncome (loss) before income taxes\n$\n4,819 \n$\n1,418 \n$\n8,241 \n$\n3,312 \nStatutory federal income tax rate on income from operations\n$\n1,012 \n21.0 \n%\n$\n298 \n21.0 \n%\n$\n1,731 \n21.0 \n%\n$\n696 \n21.0 \n%\nNon-deductible goodwill\n (1)\n42 \n0.9 \n— \n— \n94 \n1.1 \n— \n— \nState income taxes\n58 \n1.2 \n12 \n0.8 \n86 \n1.0 \n31 \n0.9 \nChange in valuation allowance\n1 \n— \n4 \n0.3 \n3 \n— \n(2)\n(0.1)\nTax credits\n(21)\n(0.4)\n(19)\n(1.3)\n(49)\n(0.6)\n(45)\n(1.3)\nTax-exempt income\n(8)\n(0.2)\n(8)\n(0.6)\n(27)\n(0.3)\n(19)\n(0.5)\nShare-based payments\n(3)\n(0.1)\n(15)\n(1.0)\n(23)\n(0.2)\n(29)\n(0.9)\nUncertain tax positions\n— \n— \n(3)\n(0.2)\n(14)\n(0.1)\n(3)\n(0.1)\nOther\n(6)\n(0.1)\n(15)\n(1.1)\n1 \n— \n(26)\n(0.8)\nEffective income tax rate on income from operations\n$\n1,075\n \n22.3\n \n%\n$\n254\n \n17.9\n \n%\n$\n1,802\n \n21.9\n \n%\n$\n603\n \n18.2\n \n%\n(1)\nThe sales of the employer voluntary benefits and group health businesses on April 1, 2025 and July 1, 2025, respectively, resulted in the disposal of non-deductible goodwill.\nOn July 4, 2025, H.R. 1 was signed into law, making a number of changes to the U.S. tax code. The legislation makes many provisions permanent that were originally enacted under the 2017 Tax Cuts and Jobs Act, in addition to implementing new measures that directly affect corporate taxpayers. Key provisions include the permanent reinstatement of full and immediate expensing for domestic research and development expenditures, new limitations on the deductibility of corporate charitable contributions, and a substantial rollback of renewable energy tax credits, including transferability of certain energy-related credits, while at the same time expanding availability of tax incentives for affordable housing developments. These changes do not have a significant impact to our consolidated financial statements.\n48\n \nwww.allstate.com\nProperty-Liability Operations\nProperty-Liability Operations\nOverview\n  Property-Liability operations consist of two reportable segments: Allstate Protection and Run-off Property-Liability. These segments are consistent with the groupings of financial information that management uses to evaluate performance and to determine the allocation of resources. \nWe do not allocate Property-Liability investment income, net gains and losses on investments and derivatives, or assets to the Allstate Protection and Run-off Property-Liability segments. Management reviews assets at the Property-Liability level for decision-making purposes. \nGAAP operating ratios\n are used to measure our profitability to enhance an investor’s understanding of our financial results and are calculated as follows:\n•\nLoss ratio: \nthe ratio of claims and claims expense (loss adjustment expenses), to premiums earned. Loss ratios include the impact of catastrophe losses and prior year reserve reestimates.\n•\nExpense ratio: \nthe ratio of amortization of DAC, operating costs and expenses, amortization or impairment of purchased intangibles and restructuring and related charges, less other revenue to premiums earned.\n•\nCombined ratio:\n the sum of the loss ratio and the expense ratio.\nWe have also calculated the following impacts of specific items on the GAAP operating ratios because of the volatility of these items between periods. The impacts are calculated by taking the specific items noted below divided by Property-Liability premiums earned:\n•\nEffect of catastrophe losses on combined ratio: \nincludes catastrophe losses and prior year reserve reestimates of catastrophe losses included in claims and claims expense\n•\nEffect of prior year reserve reestimates on combined ratio\n•\nEffect of amortization of purchased intangibles on combined ratio\n•\nEffect of restructuring and related charges on combined ratio\n•\nEffect of Run-off Property-Liability business on combined ratio:\n includes claims and claims expense, restructuring and related charges and operating costs and expenses in the Run-off Property-Liability segment \nPremium measures and statistics\n are used to analyze our premium trends and are calculated as follows:\n•\nPIF\n: policy counts are based on items rather than customers. A multi-car customer would generate multiple item (policy) counts, even if all cars were insured under one policy. Lender-placed policies are excluded from policy counts because relationships are with the lenders.\n•\nNew issued applications\n: item counts of automobile or homeowner insurance applications for insurance policies that were issued during the period, regardless of whether the customer was previously insured by another Allstate brand. \n•\nAverage premium - gross written (“average premium”):\n gross premiums written divided by issued item count. Gross premiums written include the impacts from discounts, surcharges and ceded reinsurance premiums and exclude the impacts from mid-term premium adjustments and premium refund accruals. Average premiums represent the appropriate policy term for each line.\n•\nImplemented rate changes: \nrepresents the impact in the locations (U.S. states, the District of Columbia or Canadian provinces) where rate changes were implemented during the period as a percentage of total prior year-end premiums written.\nThird Quarter 2025 Form 10-Q  \n \n49\nProperty-Liability Operations\nUnderwriting results\nThree months ended September 30,\nNine months ended September 30,\n($ in millions, except ratios)\n2025\n2024\n2025\n2024\nPremiums written\n$\n15,630 \n$\n14,707 \n$\n44,974 \n$\n42,169 \nPremiums earned\n$\n14,533 \n$\n13,694 \n$\n42,906 \n$\n39,933 \nOther revenue\n518 \n531 \n1,510 \n1,402 \nClaims and claims expense\n(8,466)\n(10,249)\n(29,210)\n(30,247)\nAmortization of DAC\n(1,757)\n(1,696)\n(5,231)\n(4,977)\nOther costs and expenses\n(1,873)\n(1,710)\n(5,259)\n(4,664)\nRestructuring and related charges\n(15)\n(23)\n(44)\n(45)\nAmortization of purchased intangibles\n(46)\n(52)\n(138)\n(154)\nUnderwriting income\n$\n2,894\n \n$\n495\n \n$\n4,534\n \n$\n1,248\n \nCatastrophe losses\nCatastrophe losses, excluding reserve reestimates\n$\n586 \n$\n1,717 \n$\n4,788 \n$\n4,868 \nCatastrophe reserve reestimates \n(1)\n(28)\n(14)\n(38)\n(314)\nTotal catastrophe losses\n$\n558\n \n$\n1,703\n \n$\n4,750\n \n$\n4,554\n \nNon-catastrophe reserve reestimates \n(1)\n$\n(396)\n$\n45 \n$\n(1,007)\n$\n(8)\nPrior year reserve reestimates \n(1)\n(424)\n31 \n(1,045)\n(322)\nGAAP operating ratios\n \n \n \n \nLoss ratio\n58.3 \n74.9 \n68.1 \n75.8 \nExpense ratio \n(2)\n21.8 \n21.5 \n21.3 \n21.1 \nCombined ratio\n80.1 \n96.4 \n89.4 \n96.9 \nEffect of catastrophe losses on combined ratio\n3.8 \n12.4 \n11.1 \n11.4 \nEffect of prior year reserve reestimates on combined ratio\n(2.9)\n0.3 \n(2.5)\n(0.8)\nEffect of catastrophe losses included in prior year reserve reestimates on combined ratio\n(0.2)\n(0.1)\n(0.1)\n(0.8)\nEffect of restructuring and related charges on combined ratio\n0.1 \n0.1 \n0.1 \n0.1 \nEffect of amortization of purchased intangibles on combined ratio\n0.3 \n0.4 \n0.3 \n0.4 \nEffect of Run-off Property-Liability business on combined ratio\n1.0 \n0.5 \n0.3 \n0.2 \n(1)\nReserve releases are shown in parentheses. \n(2)\nOther revenue is deducted from operating costs and expenses in the expense ratio calculation.\n50\n \nwww.allstate.com\nAllstate Protection\n \n \nSegment Results\n \nAllstate Protection Segment\nUnderwriting results\nThree months ended September 30,\nNine months ended September 30,\n($ in millions) \n2025\n2024\n2025\n2024\nPremiums written\n$\n15,630 \n$\n14,707 \n$\n44,974 \n$\n42,169 \nPremiums earned\n$\n14,533 \n$\n13,694 \n$\n42,906 \n$\n39,933 \nOther revenue\n518 \n531 \n1,510 \n1,402 \nClaims and claims expense\n(8,320)\n(10,190)\n(29,059)\n(30,182)\nAmortization of DAC\n(1,757)\n(1,696)\n(5,231)\n(4,977)\nOther costs and expenses\n(1,873)\n(1,709)\n(5,257)\n(4,661)\nRestructuring and related charges\n(15)\n(23)\n(44)\n(45)\nAmortization of purchased intangibles\n(46)\n(52)\n(138)\n(154)\nUnderwriting income\n$\n3,040\n \n$\n555\n \n$\n4,687\n \n$\n1,316\n \nCatastrophe losses\n$\n558 \n$\n1,703 \n$\n4,750 \n$\n4,554 \nUnderwriting income\n was $3.04 billion in the third quarter of 2025 compared to underwriting income of $555 million in the third quarter of 2024, due to lower catastrophe losses, increased premiums earned and the benefit of prior year reserve releases. Underwriting income increased $3.37 billion to $4.69 billion in the first nine months of 2025 compared to the first nine months of 2024, due to increased premiums earned and the benefit of prior year reserve releases, partially offset by higher expenses. \nChange in underwriting results from prior year period - three months ended\n($ in millions)\nChange in underwriting results from prior year period - nine months ended\n($ in millions)\nThird Quarter 2025 Form 10-Q  \n \n51\nSegment Results\n  Allstate Protection\nUnderwriting income (loss)\nThree months ended September 30,\nNine months ended September 30,\n($ in millions)\n2025\n2024\n2025\n2024\nAuto \n$\n1,726 \n$\n486 \n$\n3,873 \n$\n1,207 \nHomeowners\n1,107 \n60 \n580 \n249 \nOther personal lines\n61 \n(18)\n(15)\n(66)\nCommercial lines\n93 \n(16)\n92 \n(224)\nOther business lines \n(1)\n52 \n40 \n147 \n140 \nAnswer Financial\n1 \n3 \n10 \n10 \nTotal\n$\n3,040\n \n$\n555\n \n$\n4,687\n \n$\n1,316\n \n(1)\nRepresents commissions earned and other costs and expenses for Ivantage, non-proprietary life and annuity products and lender-placed products.\nPremium measures and statistics\n include PIF, new issued applications and average premiums to analyze our premium trends. Premiums written\n \nis the amount of premiums charged for policies issued during a reporting period. Premiums are considered earned and are included in the financial results on a pro-rata basis over the policy period. The portion of premiums written applicable to the unexpired term of the policies is recorded as unearned premiums on our Condensed Consolidated Statements of Financial Position.\nPremiums written\nThree months ended September 30,\nNine months ended September 30,\n($ in millions)\n2025\n2024\n2025\n2024\nAuto\n$\n9,869 \n$\n9,539 \n$\n29,250 \n$\n28,180 \nHomeowners\n4,607 \n4,073 \n12,455 \n10,792 \nOther personal lines\n887 \n817 \n2,481 \n2,322 \nCommercial lines\n101 \n104 \n295 \n411 \nOther business lines\n166 \n174 \n493 \n464 \nTotal premiums written\n$\n15,630\n \n$\n14,707\n \n$\n44,974\n \n$\n42,169\n \nPremiums earned\nThree months ended September 30,\nNine months ended September 30,\n($ in millions)\n2025\n2024\n2025\n2024\nAuto\n$\n9,593 \n$\n9,270 \n$\n28,468 \n$\n27,127 \nHomeowners\n3,880 \n3,403 \n11,308 \n9,812 \nOther personal lines\n800 \n718 \n2,320 \n2,078 \nCommercial lines\n99 \n151 \n316 \n478 \nOther business lines\n161 \n152 \n494 \n438 \nTotal premiums earned\n$\n14,533\n \n$\n13,694\n \n$\n42,906\n \n$\n39,933\n \nReconciliation of premiums written to premiums earned\nThree months ended September 30,\nNine months ended September 30,\n($ in millions)\n2025\n2024\n2025\n2024\nTotal premiums written\n$\n15,630\n \n$\n14,707\n \n$\n44,974\n \n$\n42,169\n \n(Increase) decrease in unearned premiums \n(1,119)\n(1,075)\n(2,158)\n(2,233)\nOther\n22 \n62 \n90 \n(3)\nTotal premiums earned\n$\n14,533\n \n$\n13,694\n \n$\n42,906\n \n$\n39,933\n \nPolicies in force\nAs of September 30,\n(In thousands)\n2025\n2024\nAuto\n25,332 \n24,998 \nHomeowners\n7,642 \n7,483 \nOther personal lines\n4,908 \n4,877 \nCommercial lines\n174 \n238 \nTotal \n38,056\n \n37,596\n \n52\n \nwww.allstate.com\nAllstate Protection\n \n \nSegment Results\n \nAuto insurance premiums written \nincreased 3.5% or $330 million in the third quarter of 2025 and increased 3.8% or $1.07 billion in the first nine months of 2025 compared to the same periods of 2024, primarily due to the following factors:\n•\nRate increases that have moderated as we focus on growth and continued rollout of Affordable, Simple and Connected auto products. In the nine months ended September 30, 2025, rate increases of 3.6% were implemented in 52 locations, resulting in total insurance premium impact of 2.4%\n•\nPIF increased 1.3% or 334 thousand to 25,332 thousand as of September 30, 2025 compared to September 30, 2024\n•\nIncreased new issued applications in all channels\n•\nIn locations not achieving acceptable returns, we expect to continue to pursue targeted rate increases. In states where we are achieving acceptable returns, we will focus on implementing rates to keep pace with increasing costs and explore opportunities for rate investments towards growth\nAuto premium measures and statistics\n \nThree months ended September 30,\nNine months ended September 30,\n2025\n2024\nChange\n2025\n2024\nChange\nNew issued applications (in thousands)\nAllstate Protection by channel\nExclusive agency\n823 \n675 \n21.9 \n%\n2,335 \n1,908 \n22.4 \n%\nIndependent agency\n696 \n597 \n16.6 \n2,067 \n1,714 \n20.6 \nDirect\n809 \n620 \n30.5 \n2,274 \n1,668 \n36.3 \nTotal new issued applications\n2,328\n \n1,892\n \n23.0\n \n%\n6,676\n \n5,290\n \n26.2\n \n%\nAllstate brand average premium\n$\n853 \n$\n852 \n0.1 \n%\n$\n852 \n$\n839 \n1.5 \n%\nHomeowners insurance premiums written\n \nincreased 13.1% or $534 million in the third quarter of 2025 and increased 15.4% or $1.66 billion in the first nine months of 2025 compared to the same periods of 2024, primarily due to the following factors:\n•\nHigher Allstate brand average premiums from implemented rate increases and inflation in insured home replacement costs and other aging factor adjustments, combined with policies in force growth\n•\nIn the nine months ended September 30, 2025, rate increases of 8.0% were implemented in 44 locations, resulting in total estimated insurance premium impact of 4.3%, excluding the impact of changes in insured home replacement costs\n•\nPIF increased 2.1% or 159 thousand to 7,642 thousand as of September 30, 2025 compared to September 30, 2024, primarily in the direct and exclusive agency channels, partially offset in the independent agency channel\n•\nIncreased new issued applications in direct and exclusive agency channels\nWe are not writing new homeowners business in Florida. We are also non-renewing certain policies in Florida. We may not be able to grow in certain states without regulatory or legislative reforms that enable customers to be provided coverage at appropriate risk adjusted returns.\nHomeowners premium measures and statistics\n \nThree months ended September 30,\nNine months ended September 30,\n2025\n \n2024\nChange\n2025\n2024\nChange\nNew issued applications (in thousands) \nAllstate Protection by channel\nExclusive agency\n262 \n260 \n0.8 \n%\n745 \n719 \n3.6 \n%\nIndependent agency\n41 \n63 \n(34.9)\n136 \n172 \n(20.9)\nDirect\n69 \n39 \n76.9 \n164 \n96 \n70.8 \nTotal new issued applications\n372\n \n362\n \n2.8\n \n%\n1,045\n \n987\n \n5.9\n \n%\nAllstate brand average premium\n$\n2,296 \n$\n2,050 \n12.0 \n%\n$\n2,262 \n$\n1,991 \n13.6 \n%\nOther personal lines premiums written\n increased 8.6% or $70 million in the third quarter of 2025 and increased 6.8% or $159 million in the first nine months of 2025 compared to the same periods of 2024, primarily due to increases in landlords and personal umbrella policies, partially offset by a decrease in auto assigned risk policies purchased from other carriers. We are not writing new condominium business in Florida, and we are non-renewing certain policies in Florida.\nCommercial lines premiums written\n decreased 2.9% or $3 million in the third quarter of 2025 compared to the third quarter of 2024, primarily driven by the run-off of Allstate brand, partially offset by growth in National General brand. Commercial lines premiums written decreased 28.2% or $116 million in the first nine months of 2025 compared to the first nine months of 2024, primarily due to the strategic decision for the Allstate brand to stop writing new business and non-renew policies. We are committed to \nThird Quarter 2025 Form 10-Q  \n \n53\nSegment Results\n  Allstate Protection\noffering comprehensive commercial products to customers through our exclusive agency, independent agency and direct channels. These offerings include solutions from National General as well as brokered products tailored to meet diverse needs across our business customers.\nOther business lines premiums written \ndecreased 4.6% or $8 million in the third quarter of 2025 compared to the third quarter of 2024, due to lower \nlender-placed auto premiums. Other business lines premiums written increased 6.3% or $29 million in the first nine months of 2025 compared to the first nine months of 2024, due to growth in the lender-placed homeowners business.\nGAAP operating ratios\n \ninclude loss ratio, expense ratio and combined ratio to analyze our profitability trends. Frequency and severity changes are used to describe the trends in loss costs.\nCombined ratios\nLoss ratio\nExpense ratio\n \n(3)\nCombined ratio\n2025\n2024\n2025\n2024\n2025\n2024\nThree months ended September 30,\nAuto\n60.6 \n71.9 \n21.4 \n22.9 \n82.0 \n94.8 \nHomeowners\n48.5 \n76.3 \n23.0 \n21.9 \n71.5 \n98.2 \nOther personal lines \n(1)\n75.1 \n96.2 \n17.3 \n6.3 \n92.4 \n102.5 \nCommercial lines\n(19.2)\n84.8 \n25.3 \n25.8 \n6.1 \n110.6 \nOther business lines \n(2)\n27.9 \n72.4 \n39.8 \n1.3 \n67.7 \n73.7 \nTotal\n57.3\n \n74.4\n \n21.8\n \n21.5\n \n79.1\n \n95.9\n \nImpact of amortization of purchased intangibles\n0.3 \n0.4 \n0.3 \n0.4 \nImpact of restructuring and related charges\n0.1 \n0.1 \n0.1 \n0.1 \nNine months ended September 30,\nAuto\n64.9 \n73.8 \n21.5 \n21.8 \n86.4 \n95.6 \nHomeowners\n73.4 \n75.9 \n21.5 \n21.6 \n94.9 \n97.5 \nOther personal lines \n(1)\n83.9 \n91.5 \n16.7 \n11.7 \n100.6 \n103.2 \nCommercial lines\n42.7 \n120.1 \n28.2 \n26.8 \n70.9 \n146.9 \nOther business lines \n(2)\n38.8 \n55.7 \n31.4 \n12.3 \n70.2 \n68.0 \nTotal\n67.8\n \n75.6\n \n21.3\n \n21.1\n \n89.1\n \n96.7\n \nImpact of amortization of purchased intangibles\n0.3 \n0.4 \n0.3 \n0.4 \nImpact of restructuring and related charges\n0.1 \n0.1 \n0.1 \n0.1 \n(1)\nExpense ratio includes other revenue of $43 million and $134 million for the three and nine months ended September 30, 2025, respectively, compared to $97 million and $161 million for the three and nine months ended September 30, 2024, respectively, for fees on auto assigned risk policies.\n(2)\nExpense ratio includes profit-sharing commissions on lender-placed business, which decreased in 2024 due to higher losses and increased in 2025 as losses declined. \n(3)\nOther revenue is deducted from operating costs and expenses in the expense ratio calculation.\n54\n \nwww.allstate.com\nAllstate Protection\n \n \nSegment Results\n \nLoss ratios\nLoss ratio\nEffect of catastrophe \nlosses \n(1) (2)\nEffect of prior year reserve reestimates\nEffect of catastrophe losses included in prior year reserve reestimates\n2025\n2024\n2025\n2024\n2025\n2024\n2025\n2024\nThree months ended September 30,\nAuto\n60.6 \n71.9 \n0.7 \n3.0 \n(5.0)\n(0.7)\n— \n(0.1)\nHomeowners \n48.5 \n76.3 \n12.3 \n36.2 \n(1.4)\n(0.4)\n(0.4)\n— \nOther personal lines\n75.1 \n96.2 \n1.0 \n23.8 \n8.3 \n7.1 \n(0.7)\n(0.4)\nCommercial lines\n(19.2)\n84.8 \n(3.0)\n5.3 \n(85.9)\n0.7 \n(5.1)\n— \nOther business lines\n27.9 \n72.4 \n3.1 \n9.2 \n(8.7)\n(1.9)\n— \n— \nTotal\n57.3\n \n74.4\n \n3.8\n \n12.4\n \n(3.9)\n(0.2)\n(0.2)\n(0.1)\nNine months ended September 30,\nAuto\n64.9 \n73.8 \n1.7 \n2.7 \n(4.1)\n(1.1)\n(0.1)\n(0.1)\nHomeowners\n73.4 \n75.9 \n34.6 \n34.7 \n(0.3)\n(3.9)\n— \n(2.8)\nOther personal lines\n83.9 \n91.5 \n12.2 \n17.0 \n6.1 \n7.9 \n(0.4)\n(0.3)\nCommercial lines\n42.7 \n120.1 \n0.6 \n2.9 \n(32.9)\n33.3 \n— \n(1.0)\nOther business lines\n38.8 \n55.7 \n11.7 \n9.8 \n(7.9)\n0.2 \n— \n— \nTotal\n67.8\n \n75.6\n \n11.1\n \n11.4\n \n(2.8)\n(1.0)\n(0.1)\n(0.8)\n(1)\nThe ten-year average effect of total catastrophe losses on the total combined ratio was 8.6 points and 10.3 points in the third quarter and first nine months of 2025, respectively.\n(2)\nThe ten-year average effect of homeowners catastrophe losses on the total homeowners combined ratio was 24.8 points and 32.9 points in the third quarter and first nine months of 2025, respectively. \nAuto loss ratio\n decreased 11.3 points in the third quarter of 2025 and decreased 8.9 points in the first nine months of 2025 compared to the same periods of 2024, driven by increased earned premiums, lower claim frequency and the benefit of prior year non-catastrophe reserve releases. Estimated report year 2025 incurred claim severity for Allstate brand increased compared to report year 2024 for major coverages due to higher repair costs, mix of total loss frequency, medical consumption and attorney representation. Gross claim frequency decreased relative to the prior year. We continue to enhance our claims practices to manage loss costs by increasing resources and expanding re-inspections and accelerating resolution of bodily injury claims.\nHomeowners loss ratio\n decreased 27.8 points in the third quarter of 2025 compared to the third quarter of 2024, primarily due to lower catastrophe losses and increased premiums earned. Homeowners loss ratio decreased 2.5 points in the first nine months of 2025 compared to the first nine months of 2024, primarily due to increased premiums earned, partially offset by higher losses.\nGross claim frequency, excluding catastrophes, decreased in the third quarter and first nine months of 2025 compared to the same periods of 2024. Paid claim severity, excluding catastrophes, increased in the third quarter and first nine months of 2025 compared to the same periods of 2024, due to a mix of fire and wind/hail perils. Homeowners paid claim severity can be impacted by both the mix of perils and the magnitude of specific losses paid during the quarter.\nOther personal lines loss ratio\n \ndecreased 21.1 points in the third quarter of 2025 compared to the \nthird quarter of 2024, primarily due to lower losses and increased premiums earned. Other personal lines loss ratio decreased 7.6 points in the first nine months of 2025 compared to the first nine months of 2024, primarily due to increased premiums earned, partially offset by higher non-catastrophe losses.\nCommercial lines loss ratio\n \ndecreased 104.0 points in the third quarter of 2025 and decreased 77.4 points in the first nine months of 2025 compared to the same periods of 2024, primarily due to the benefit of prior year reserve releases and lower losses, partially offset by a decrease in premiums earned driven by the strategic decision for the Allstate brand to stop writing new business and non-renew policies. \nOther business lines loss ratio\n decreased 44.5 points in the third quarter of 2025 compared to the third quarter of 2024, primarily due to lower losses and the benefit of prior year reserve releases. Other business lines loss ratio decreased 16.9 points in the first nine months of 2025 compared to the first nine months of 2024, primarily due to the benefit of prior year non-catastrophe reserve releases.\nCatastrophe losses\n \ndecreased $1.15 billion to $558 million in the third quarter of 2025 compared to the third quarter of 2024, primarily due to fewer and less severe events as well as the absence of any hurricanes and tropical storms. Catastrophe losses increased $196 million to $4.75 billion in the first nine months of 2025 compared to the first nine months of 2024.\nWe define a “catastrophe” as an event that produces pre-tax losses before reinsurance in excess of $1 million and involves multiple first party policyholders, or a winter weather event that produces a number of claims in excess of a preset, per-event \nThird Quarter 2025 Form 10-Q  \n \n55\nSegment Results\n  Allstate Protection\nthreshold of average claims in a specific area, occurring within a certain amount of time following the event. Catastrophes are caused by various natural events including high winds, winter storms and freezes, tornadoes, hailstorms, wildfires, tropical storms, tsunamis, hurricanes, earthquakes and volcanoes. \nWe are also exposed to man-made catastrophic events, such as certain types of terrorism, civil unrest, wildfires or industrial accidents. The nature and level of catastrophes in any period cannot be reliably predicted.\nLoss estimates are generally based on claim adjuster inspections and the application of historical loss development factors. Our loss estimates are calculated in accordance with the coverage provided by our policies. The establishment of appropriate reserves, including reserves for catastrophe losses, is an inherently uncertain and complex process. Reserving for hurricane losses is complicated by the inability of insureds to promptly report losses, limitations placed on claims adjusting staff affecting \ntheir ability to inspect losses, determining whether losses are covered by our homeowners policy (generally for damage caused by wind or wind driven rain) or specifically excluded coverage caused by flood, exposure to mold damage, and the effects of numerous other considerations, including the timing of a catastrophe in relation to other events, such as at or near the end of a financial reporting period, which can affect the availability of information needed to estimate reserves for that reporting period. In these situations, we may need to adapt our practices to accommodate these circumstances in order to determine a best estimate of our losses from a catastrophe. \nOver time, we have limited our aggregate insurance exposure to catastrophe losses in certain regions of the country that are subject to high levels of natural catastrophes by managing coverage, number of policies in force, utilizing reinsurance and participating in various state facilities.\nCatastrophe losses by the type of event\nThree months ended September 30,\nNine months ended September 30,\n($ in millions)\nNumber of events\n2025\nNumber of events\n2024\nNumber of events\n2025\nNumber of events\n2024\nHurricanes/tropical storms \n— \n$\n— \n5 \n$\n953 \n— \n$\n— \n5 \n$\n953 \nTornadoes\n— \n— \n— \n— \n— \n— \n1 \n57 \nWind/hail\n35 \n649 \n39 \n666 \n85 \n3,746 \n98 \n3,638 \nWildfires\n1 \n3 \n5 \n25 \n4 \n1,092 \n8 \n54 \nFreeze/other events\n1 \n2 \n1 \n3 \n1 \n2 \n2 \n166 \nPrior year reserve reestimates \n(1)\n(19)\n(14)\n31 \n(314)\nPrior year aggregate reinsurance recoveries\n(9)\n— \n(69)\n— \nCurrent year aggregate reinsurance recoveries\n(4)\n— \n(52)\n— \nPrior quarter reserve reestimates\n(64)\n70 \n— \n— \nTotal catastrophe losses\n37\n \n$\n558\n \n50\n \n$\n1,703\n \n90\n \n$\n4,750\n \n(2)\n114\n \n$\n4,554\n \n(1)\nIncludes reinsurance recoveries.\n(2)\nGross losses before reinsurance recoverables and reinstatement premiums were $6.01 billion.\nCatastrophe reinsurance\n  The catastrophe reinsurance program is part of our catastrophe management strategy, which is intended to provide shareholders with long-term returns on the risks assumed in our property business, reduce earnings volatility, and provide protection to our customers. The current catastrophe reinsurance program supports our risk and return framework which incorporates robust economic capital modeling and is informed by catastrophe risk models including hurricanes, earthquakes and wildfires. As of September 30, 2025, the modeled 1-in-100 annual aggregate probable maximum loss for hurricane, earthquake and wildfire perils is approximately $3.1 billion, net of reinsurance. We continually review our aggregate risk appetite and the cost and availability of reinsurance to optimize the risk and return profile of this exposure. \nThe total cost of our property catastrophe reinsurance programs, excluding reinstatement \npremiums, during the third quarter and first nine months of 2025 was $352 million and $914 million, respectively, compared to $298 million and $880 million in the third quarter and first nine months of 2024. Catastrophe placement premiums reduce net written and earned premium with approximately 82% of the reduction related to homeowners premium.\nPrior year reserve reestimates\n  Reserve reestimates, including catastrophes, decreased reserves by $570 million and $1.20 billion in the third quarter and first nine months of 2025, respectively. Reserve reestimates primarily related to favorable severity development of $284 million and $565 million in personal auto injury coverage and $196 million and $568 million in personal auto physical damage coverage in the third quarter and first nine months of 2025, respectively.\n56\n \nwww.allstate.com\nAllstate Protection\n \n \nSegment Results\n \nFor a more detailed discussion on reinsurance and reserve reestimates, see Note 9 of the condensed consolidated financial statements.\nPrior year reserve reestimates\nThree months ended September 30,\nNine months ended September 30,\n \nPrior year reserve\nreestimates \n(1)\nEffect on\ncombined ratio\n \n(2)\nPrior year reserve\nreestimates \n(1)\nEffect on\ncombined ratio \n(2)\n($ in millions, except ratios)\n2025\n2024\n2025\n2024\n2025\n2024\n2025\n2024\nAuto\n$\n(483)\n$\n(65)\n(3.3)\n(0.5)\n$\n(1,163)\n$\n(319)\n(2.7)\n(0.8)\nHomeowners\n(54)\n(12)\n(0.4)\n(0.1)\n(32)\n(392)\n(0.1)\n(1.0)\nOther personal lines\n66 \n51 \n0.5 \n0.4 \n142 \n164 \n0.3 \n0.4 \nCommercial lines\n(85)\n1 \n(0.6)\n— \n(104)\n159 \n(0.2)\n0.4 \nOther business lines\n(14)\n(3)\n(0.1)\n— \n(39)\n1 \n(0.1)\n— \nTotal Allstate Protection\n$\n(570)\n$\n(28)\n(3.9)\n(0.2)\n$\n(1,196)\n$\n(387)\n(2.8)\n(1.0)\n(1)\nReserve releases are shown in parentheses.\n(2)\nRatios are calculated using Allstate Protection premiums earned.\nExpense ratio\n increased 0.3 points and increased 0.2 points in the third quarter and first nine months of 2025, respectively, compared to the same periods of 2024, primarily due to an increase in advertising costs, higher expenses for lender-placed business and lower fees on involuntary auto policies included in other revenue, partially offset by higher earned premium growth relative to costs.\nImpact of specific costs and expenses on the expense ratio\nThree months ended September 30,\nNine months ended September 30,\n($ in millions, except ratios)\n2025\n2024\nChange\n2025\n2024\nChange\nAmortization of DAC\n$\n1,757 \n$\n1,696 \n$\n61 \n$\n5,231 \n$\n4,977 \n$\n254 \nAdvertising expense\n575 \n519 \n56 \n1,540 \n1,204 \n336 \nOther costs and expenses, net of other revenue\n780 \n659 \n121 \n2,207 \n2,055 \n152 \nAmortization of purchased intangibles\n46 \n52 \n(6)\n138 \n154 \n(16)\nRestructuring and related charges\n15 \n23 \n(8)\n44 \n45 \n(1)\nTotal underwriting expenses\n$\n3,173\n \n$\n2,949\n \n$\n224\n \n$\n9,160\n \n$\n8,435\n \n$\n725\n \nPremiums earned\n$\n14,533\n \n$\n13,694\n \n$\n839\n \n$\n42,906\n \n$\n39,933\n \n$\n2,973\n \nExpense ratio\nAmortization of DAC\n12.1 \n12.4 \n(0.3)\n12.2 \n12.5 \n(0.3)\nAdvertising expense\n4.0 \n3.8 \n0.2 \n3.6 \n3.0 \n0.6 \nOther costs and expenses, net of other revenue\n5.3 \n4.8 \n0.5 \n5.1 \n5.1 \n— \nSubtotal\n21.4 \n21.0 \n0.4 \n20.9 \n20.6 \n0.3 \nAmortization of purchased intangibles\n0.3 \n0.4 \n(0.1)\n0.3 \n0.4 \n(0.1)\nRestructuring and related charges\n0.1 \n0.1 \n— \n0.1 \n0.1 \n— \nTotal expense ratio\n21.8\n \n21.5\n \n0.3\n \n21.3\n \n21.1\n \n0.2\n \nThird Quarter 2025 Form 10-Q  \n \n57\nSegment Results\n \n Run-off Property-Liability\nRun-off Property-Liability Segment\nUnderwriting results\n($ in millions)\nThree months ended September 30,\nNine months ended September 30,\n2025\n2024\n2025\n2024\nClaims and claims expense\nAsbestos claims\n$\n(62)\n$\n(19)\n$\n(62)\n$\n(19)\nEnvironmental claims\n(27)\n(10)\n(27)\n(10)\nOther run-off lines\n(57)\n(30)\n(62)\n(36)\nTotal claims and claims expense\n$\n(146)\n$\n(59)\n$\n(151)\n$\n(65)\nOperating costs and expenses \n— \n(1)\n(2)\n(3)\nUnderwriting loss\n$\n(146)\n$\n(60)\n$\n(153)\n$\n(68)\nAnnual reserve review  \nIn the third quarter of 2025 and 2024, we performed our annual reserve review using established industry and actuarial best practices. The annual review resulted in reserve reestimates that increased reserves by $146 million and $58 million in 2025 and 2024, respectively. The reserve reestimates are included as part of claims and claims expense.\nThe reserve reestimates in 2025 primarily related to new reported information for asbestos claims, new reported claims for environmental and other mass tort claims and increased projections for claims expenses.\nThe reserve reestimates in 2024 primarily related to new reported information for asbestos related \nclaims and adverse developments within the other run-off lines.\nWe believe that our reserves are appropriately established based on available facts, technology, laws, regulations, and assessments of other pertinent factors and characteristics of exposure (e.g., claim activity, potential liability, jurisdiction, products versus non-products exposure) presented by individual policyholders, assuming no change in the legal, legislative or economic environment. However, as we progress with the resolution of disputed claims in the courts and arbitrations and with negotiations and settlements, our reported losses may be more variable.\nReserves for asbestos, environmental and other run-off claims before and after the effects of reinsurance\n($ in millions) \nSeptember 30, 2025\nDecember 31, 2024\nAsbestos claims\nGross reserves\n$\n1,125 \n$\n1,124 \nReinsurance \n(335)\n(350)\nNet reserves \n790 \n774 \nEnvironmental claims\nGross reserves\n322 \n320 \nReinsurance \n(59)\n(61)\nNet reserves \n263 \n259 \nOther run-off claims\nGross reserves\n461 \n439 \nReinsurance \n(38)\n(58)\nNet reserves\n423 \n381 \nTotal \nGross reserves\n \n1,908 \n1,883 \nReinsurance\n(432)\n(469)\nNet reserves\n$\n1,476\n \n$\n1,414\n \n58\n \nwww.allstate.com\nRun-off Property-Liability\n \nSegment Results\n \nReserves by type of exposure before and after the effects of reinsurance\n($ in millions)\nSeptember 30, 2025\nDecember 31, 2024\nDirect excess commercial insurance \nGross reserves\n \n$\n1,095 \n$\n1,082 \nReinsurance\n(351)\n(363)\nNet reserves\n744 \n719 \nAssumed reinsurance coverage\nGross reserves\n \n604 \n581 \nReinsurance \n(55)\n(54)\nNet reserves\n549 \n527 \nDirect primary commercial insurance\nGross reserves \n100 \n133 \nReinsurance \n(25)\n(51)\nNet reserves\n75 \n82 \nUnallocated loss adjustment expenses\nGross reserves\n109 \n87 \nReinsurance\n(1)\n(1)\nNet reserves\n108 \n86 \nTotal\nGross reserves\n1,908 \n1,883 \nReinsurance\n(432)\n(469)\nNet reserves\n$\n1,476\n \n$\n1,414\n \nPercentage of gross and ceded reserves by case and incurred but not reported (“IBNR”)\nSeptember 30, 2025\nDecember 31, 2024\nCase\nIBNR\nCase\nIBNR\nDirect excess commercial insurance \nGross reserves\n (1)\n58 \n%\n42 \n%\n58 \n%\n42 \n%\nCeded \n(2)\n66 \n34 \n62 \n38 \nAssumed reinsurance coverage\nGross reserves\n \n33 \n67 \n34 \n66 \nCeded \n44 \n56 \n51 \n49 \nDirect primary commercial insurance\nGross reserves \n39 \n61 \n54 \n46 \nCeded\n73 \n27 \n87 \n13 \n(1)\nApproximately 65% of gross case reserves as of September 30, 2025 and December 31, 2024 are subject to settlement agreements that define and limit our obligations.\n(2)\nApproximately 72% of ceded case reserves as of September 30, 2025 and December 31, 2024 are subject to settlement agreements that define and limit our obligations.\nGross payments from case reserves by type of exposure \n($ in millions)\nThree months ended September 30,\nNine months ended September 30,\n2025\n2024\n2025\n2024\nDirect excess commercial insurance \nGross \n(1)\n$\n14 \n$\n19 \n$\n74 \n$\n51 \nCeded \n(2)\n(6)\n(7)\n(27)\n(20)\nAssumed reinsurance coverage\nGross\n \n21 \n6 \n37 \n33 \nCeded\n(5)\n1 \n(6)\n(1)\nDirect primary commercial insurance\nGross\n \n2 \n1 \n4 \n4\nCeded\n(1)\n(1)\n(2)\n(2)\n(1)\nIn the third quarter and first nine months of 2025, 81% and 90%\n \nof payments related to settlement agreements, respectively, compared to 94%\n and \n89% in the third quarter and first nine months of 2024, respectively.\n(2)\nIn the third quarter and first nine months of 2025, 84% and 91% of payments related to settlement agreements, respectively, compared to 98% and 95% in the third quarter and first nine months of 2024, respectively.\nThird Quarter 2025 Form 10-Q  \n \n59\nSegment Results\n \n Run-off Property-Liability\nTotal net reserves as of September 30, 2025, included $773 million or 52% of estimated IBNR reserves compared to $723 million or 51% of estimated IBNR reserves as of December 31, 2024. \nTotal gross payments were $37 million and $115 million for the third quarter and first nine months\n \nof 2025, respectively, compared to $26 million and $88 million for the third quarter and first nine months of 2024, respectively. Payments primarily related to settlement agreements reached with several insureds on large claims, mainly asbestos related losses, where the scope of coverages has been agreed upon. The claims associated with these settlement agreements are expected to be substantially paid out over the next several years as qualified claims are submitted by these insureds. Reinsurance collections were $9 million and $25 million for the third quarter and first nine months of 2025, respectively, compared to $5 million and $31 million for the third quarter and first nine months of 2024, respectively.\n60\n \nwww.allstate.com\nProtection Services\n \n \nSegment Results\nProtection Services Segment\nSummarized financial information\n($ in millions)\nThree months ended September 30,\nNine months ended September 30,\n2025\n2024\n2025\n2024\nPremiums written\n$\n749\n \n$\n678\n \n$\n2,139\n \n$\n1,981\n \nRevenues\nPremiums \n$\n720 \n$\n639 \n$\n2,086 \n$\n1,864 \nOther revenue\n124 \n110 \n363 \n293 \nIntersegment insurance premiums and service fees \n(1)\n33 \n49 \n106 \n123 \nNet investment income\n25 \n24 \n74 \n68 \nCosts and expenses\nClaims and claims expense\n(193)\n(166)\n(524)\n(481)\nAmortization of DAC\n(337)\n(304)\n(983)\n(889)\nOperating costs and expenses\n(310)\n(280)\n(909)\n(760)\nRestructuring and related charges \n(1)\n— \n(2)\n(1)\nIncome tax expense on operations\n(16)\n(15)\n(51)\n(51)\nLess: noncontrolling interest\n(1)\n(1)\n(1)\n(1)\nAdjusted net income\n$\n46\n \n$\n58\n \n$\n161\n \n$\n167\n \nProtection Plans\n$\n34 \n$\n39 \n$\n130 \n$\n120 \nRoadside\n12 \n10 \n34 \n29 \nDealer Services\n6 \n5 \n14 \n17 \nIdentity Protection\n2 \n3 \n5 \n6 \nArity\n(8)\n1 \n(22)\n(5)\nAdjusted net income\n$\n46\n \n$\n58\n \n$\n161\n \n$\n167\n \nPolicies in force\nProtection Plans\n163,451 \n156,818 \nRoadside\n1,119 \n670 \nDealer Services\n3,681 \n3,703 \nIdentity Protection\n2,694 \n2,538 \nPolicies in force as of September 30 (in thousands)\n170,945\n \n163,729\n \n(1)\nPrimarily related to Arity and Roadside and are eliminated in our condensed consolidated financial statements.\nPremiums written\n increased 10.5% or $71 million in the third quarter of 2025 and increased 8.0% or $158 million in the first nine months of 2025 compared to the same periods of 2024, primarily due to international growth at Protection Plans.\nAdjusted net income \ndecreased 20.7% or $12 million in the third quarter of 2025 and decreased 3.6% or $6 million in the first nine months of 2025 compared to the same periods of 2024, primarily due to higher expenses at Arity and increased claims at Protection Plans, partially offset by premium growth at Protection Plans.\nPIF\n increased 4.4% or 7 million as of September 30, 2025 compared to September 30, 2024 due to growth at Protection Plans.\nOther revenue\n increased 12.7% or $14 million in the third quarter of 2025 and increased 23.9% or $70 million in the first nine months of 2025 compared to \nthe same periods of 2024, primarily due to higher lead generation revenue at Arity.\nIntersegment premiums and service fees\n decreased 32.7% or $16 million in the third quarter of 2025 and decreased 13.8% or $17 million in the first nine months of 2025 compared to the same periods of 2024, primarily driven by Arity and Roadside.\nClaims and claims expense \nincreased 16.3% or $27 million in the third quarter of 2025 and increased 8.9% or $43 million in the first nine months of 2025 compared to the same periods of 2024, primarily driven by growth at Protection Plans.\nAmortization of DAC\n increased 10.9% or $33 million in the third quarter of 2025 and increased 10.6% or $94 million in the first nine months of 2025 compared to the same periods of 2024, driven by growth at Protection Plans.\nThird Quarter 2025 Form 10-Q  \n \n61\nSegment Results\n \nProtection Services\nOperating costs and expenses\n increased 10.7% or $30 million in the third quarter of 2025 and increased 19.6% or $149 million in the first nine months of 2025 compared to the same periods of 2024, primarily due to expenses related to growth at Protection Plans and Arity.\n62\n \nwww.allstate.com\nInvestments\nInvestments \nPortfolio composition and strategy \n(1)\nSeptember 30, 2025\n($ in millions)\nProperty-Liability\nProtection Services \nCorporate \nand all other\nTotal\nFixed income securities \n(2)\n$\n51,615 \n$\n1,825 \n$\n3,746 \n$\n57,186 \nEquity securities \n(3)\n4,430 \n406 \n502 \n5,338 \nMortgage loans, net\n831 \n— \n— \n831 \nLimited partnership interests \n9,205 \n— \n8 \n9,213 \nShort-term investments \n(4)\n7,292 \n270 \n1,181 \n8,743 \nOther investments, net\n1,017 \n— \n— \n1,017 \nTotal\n$\n74,390\n \n$\n2,501\n \n$\n5,437\n \n$\n82,328\n \nPercent to total\n90.4\n \n%\n3.0\n \n%\n6.6\n \n%\n100.0\n \n%\nMarket-based\n$\n64,298 \n$\n2,461 \n$\n5,208 \n$\n71,967 \nPerformance-based\n10,092 \n40 \n229 \n10,361 \nTotal\n$\n74,390\n \n$\n2,501\n \n$\n5,437\n \n$\n82,328\n \n(1)\n    Balances reflect the elimination of related-party investments between segments.\n(2)\n    Fixed income securities are carried at fair value. Amortized cost, net for these securities was $51.19 billion, $1.81 billion, $3.73 billion and $56.73 billion for Property-Liability, Protection Services, Corporate and all other, and in total, respectively.\n(3)\n    Equity securities are carried at fair value. The fair value of equity securities held as of September 30, 2025, was $395 million in excess of cost. These net gains were primarily concentrated in the technology, equity index funds and banking sectors. Equity securities include $1.34 billion of funds with underlying investments in fixed income and short-term securities as of September 30, 2025.\n(4)\n    Short-term investments are carried at fair value.\nInvestments totaled $82.33 billion as of September 30, 2025, increasing from $72.61 billion as of December 31, 2024, primarily due to operating and investment cash flows.\nPortfolio composition by investment strategy\n  We utilize two primary strategies to manage risks and returns and to position our portfolio to take advantage of market opportunities while attempting to mitigate adverse effects. As strategies and market conditions evolve, the asset allocation may change.\nMarket-based\n \nstrategy seeks to deliver predictable earnings aligned to business needs and provide flexibility to adjust investment risk profile based on enterprise objectives and market opportunities primarily through public and private fixed income investments and public equity securities.\nPerformance-based\n \nstrategy seeks to deliver attractive risk-adjusted returns and supplement \nmarket risk with idiosyncratic risk primarily through investments in private equity, including infrastructure investments, and real estate with a majority being limited partnerships. These investments include investee level expenses, reflecting asset level operating expenses on directly held real estate and other consolidated investments.\nMacroeconomic impacts\n  We continually monitor the macroeconomic environment through our integrated Enterprise Risk and Return Management framework. In the third quarter of 2025, we increased the allocation of enterprise economic capital to the investment portfolio in response to evolving market conditions. Actions included lengthening the fixed income portfolio duration and increasing exposure to public equity securities and high yield bonds. \nThird Quarter 2025 Form 10-Q  \n \n63\nInvestments\nPortfolio composition by investment strategy\nSeptember 30, 2025\n($ in millions)\nMarket-\nbased\nPerformance-based\nTotal\nFixed income securities\n$\n57,037 \n$\n149 \n$\n57,186 \nEquity securities\n4,762 \n576 \n5,338 \nMortgage loans, net\n831 \n— \n831 \nLimited partnership interests\n232 \n8,981 \n9,213 \nShort-term investments\n8,742 \n1 \n8,743 \nOther investments, net\n363 \n654 \n1,017 \nTotal\n$\n71,967\n \n$\n10,361\n \n$\n82,328\n \nPercent to total\n87.4\n \n%\n12.6\n \n%\n100.0\n \n%\nUnrealized net capital gains and losses\nFixed income securities\n$\n454 \n$\n— \n$\n454 \nOther investments\n(2)\n— \n(2)\nTotal\n$\n452\n \n$\n—\n \n$\n452\n \nFixed income securities\nFixed income securities by type\nFair value as of\n($ in millions)\nSeptember 30, 2025\nDecember 31, 2024\nU.S. government and agencies\n$\n13,525 \n$\n11,108 \nMunicipal\n6,226 \n8,842 \nCorporate\n32,880 \n30,192 \nForeign government\n1,435 \n1,364 \nAsset-backed securities (“ABS”)\n986 \n1,145 \nMortgage-backed securities (“MBS”)\n2,134 \n96 \nTotal fixed income securities\n$\n57,186\n \n$\n52,747\n \nFixed income securities are rated by third-party credit rating agencies or are internally rated. The Securities Valuation Office (“SVO”) of the National Association of Insurance Commissioners (“NAIC”) evaluates the fixed income securities of insurers for regulatory reporting and capital assessment purposes. The NAIC assigns securities to one of six credit quality categories defined as “NAIC designations”. In general, securities with NAIC designations of 1 and 2 are considered investment grade and securities with NAIC designations of 3 through 6 are considered below investment grade. The rating is either received from the SVO based on availability of applicable ratings from rating agencies on the NAIC Nationally Recognized Statistical Rating Organizations provider list, including Moody’s Investors Service (“Moody’s”), S&P Global Ratings (“S&P”), Fitch Ratings or a comparable internal rating.\nAs a result of time lags between the funding of investments, the finalization of legal documents, and the completion of the SVO filing process, the portfolio includes certain securities that have not yet been designated by the SVO as of each balance sheet date and the categorization of these securities is based on the expected ratings indicated by internal analysis\n.\nAs of September 30, 2025, 91.5% of the consolidated fixed income securities portfolio was \nrated investment grade. Credit ratings below these designations are considered lower credit quality or below investment grade, which includes high yield bonds. \nMarket prices for certain securities may have credit spreads which imply higher or lower credit quality than the current third-party rating. Our initial investment decisions and ongoing monitoring procedures for fixed income securities are based on a due diligence process which includes, but is not limited to, an assessment of the credit quality, sector, structure and liquidity risks of each issuer.\nFixed income portfolio monitoring is a comprehensive process to identify and evaluate each fixed income security that may require a credit loss allowance. The process includes a quarterly review of all securities to identify instances where the fair value of a security compared to its amortized cost is below internally established thresholds. For further detail on our fixed income portfolio monitoring process, see Note 5 of the condensed consolidated financial statements.\nThe following table presents total fixed income securities by the applicable NAIC designation and comparable S&P rating.\n64\n \nwww.allstate.com\nInvestments\nFair value and unrealized net capital gains (losses) for fixed income securities by credit rating\nSeptember 30, 2025\nNAIC 1\nNAIC 2\nNAIC 3\nA and above\nBBB\nBB\n($ in millions)\nFair\nvalue\nUnrealized\ngain (loss)\nFair\nvalue\nUnrealized\ngain (loss)\nFair\nvalue\nUnrealized\ngain (loss)\nU.S. government and agencies\n$\n13,525 \n$\n35 \n$\n— \n$\n— \n$\n— \n$\n— \nMunicipal\n6,094 \n(32)\n130 \n(1)\n— \n— \nCorporate\nPublic\n6,677 \n116 \n14,552 \n137 \n554 \n5 \nPrivately placed\n2,851 \n30 \n4,018 \n51 \n2,433 \n31 \nTotal corporate\n9,528\n \n146\n \n18,570\n \n188\n \n2,987\n \n36\n \nForeign government\n1,435 \n13 \n— \n— \n— \n— \nABS\n880 \n1 \n33 \n— \n25 \n— \nMBS\n2,134 \n32 \n— \n— \n— \n— \nTotal fixed income securities\n$\n33,596\n \n$\n195\n \n$\n18,733\n \n$\n187\n \n$\n3,012\n \n$\n36\n \nNAIC 4\nNAIC 5-6\nTotal\nB\nCCC and lower\nFair\nvalue\nUnrealized\ngain (loss)\nFair\nvalue\nUnrealized\ngain (loss)\nFair\nvalue\nUnrealized\ngain (loss)\nU.S. government and agencies\n$\n— \n$\n— \n$\n— \n$\n— \n$\n13,525 \n$\n35 \nMunicipal\n— \n— \n2 \n1 \n6,226 \n(32)\nCorporate\nPublic\n104 \n1 \n— \n— \n21,887 \n259 \nPrivately placed\n1,560 \n27 \n131 \n(2)\n10,993 \n137 \nTotal corporate\n1,664\n \n28\n \n131\n \n(2)\n32,880\n \n396\n \nForeign government\n— \n— \n— \n— \n1,435 \n13 \nABS\n1 \n— \n47 \n9 \n986 \n10 \nMBS\n— \n— \n— \n— \n2,134 \n32 \nTotal fixed income securities\n$\n1,665\n \n$\n28\n \n$\n180\n \n$\n8\n \n$\n57,186\n \n$\n454\n \nMunicipal bonds\n, including tax-exempt and taxable securities,\n \ninclude general obligations of state and local issuers and revenue bonds.\nCorporate bonds\n include publicly traded and privately placed securities. Privately placed securities primarily consist of corporate issued senior debt securities that are negotiated with the borrower or are issued by public entities in unregistered form.\nABS\n includes collateralized debt obligations, consumer and other ABS. Credit risk is managed by monitoring the performance of the underlying collateral. Many of the securities in the ABS portfolio have credit enhancement with features such as overcollateralization, subordinated structures, reserve funds, guarantees or insurance. \nMBS\n includes residential mortgage-backed securities (“RMBS”) and commercial mortgage-backed securities (“CMBS”). RMBS is subject to interest rate risk, but unlike other fixed income securities, is additionally subject to prepayment risk from the underlying residential mortgage loans. RMBS primarily consists of a U.S. Agency portfolio having collateral issued or guaranteed by U.S. government agencies. CMBS investments are primarily traditional conduit transactions collateralized by commercial mortgage loans, broadly diversified across property types and geographical area.\nEquity securities\n of $5.34 billion primarily include common stocks, exchange traded and mutual funds, non-redeemable preferred stocks and REITs. Exchange traded and mutual funds that have fixed income and short-term securities as their underlying investments total $1.34 billion as of September 30, 2025. Sector exposure within exchange traded and mutual funds align with the respective tracked indices.\nMortgage loans \nof $831 million\n \ncomprise loans secured by first mortgages on developed commercial real estate of $680 million and residential mortgage loans of $151 million. Key considerations used to manage our exposure include property type and geographic diversification. For further detail on our mortgage loan portfolio, see Note 5 of the condensed consolidated financial statements.\nLimited partnership interests \ninclude $7.52 billion of interests in private equity funds, $1.47 billion of interests in real estate funds and $232 million of interests in other funds as of September 30, 2025. We have commitments to invest additional amounts in limited partnership interests totaling $3.26 billion as of September 30, 2025.\nOther investments\n \ninclude $383 million of bank loans, net and $621 million of direct investments in real estate as of September 30, 2025.\nThird Quarter 2025 Form 10-Q  \n \n65\nInvestments\nUnrealized net capital gains (losses)\nSeptember 30,\nDecember 31,\n($ in millions) \n2025\n2024\nU.S. government and agencies\n$\n35 \n$\n(315)\nMunicipal\n(32)\n(143)\nCorporate\n396 \n(438)\nForeign government\n13 \n12 \nABS\n10 \n15 \nMBS\n32 \n— \nFixed income securities\n454\n \n(869)\nShort-term investments\n— \n(2)\nDerivatives\n(2)\n(2)\nInvestments classified as held for sale\n— \n(110)\nUnrealized net capital gains and losses, pre-tax\n$\n452\n \n$\n(983)\nGross unrealized gains (losses) on fixed income securities by type and sector\n($ in millions)\nAmortized\ncost, net\nGross unrealized\nFair\nvalue\nGains\nLosses\nSeptember 30, 2025\nCorporate\nBanking\n$\n4,335 \n$\n98 \n$\n(19)\n$\n4,414 \nBasic industry  \n1,097 \n19 \n(8)\n1,108 \nCapital goods\n2,996 \n66 \n(26)\n3,036 \nCommunications\n2,268 \n48 \n(20)\n2,296 \nConsumer goods (cyclical and non-cyclical)\n6,905 \n132 \n(57)\n6,980 \nEnergy\n2,806 \n61 \n(16)\n2,851 \nFinancial services\n2,752 \n45 \n(25)\n2,772 \nTechnology\n3,469 \n53 \n(41)\n3,481 \nTransportation\n756 \n15 \n(5)\n766 \nUtilities \n4,617 \n112 \n(31)\n4,698 \nOther\n483 \n7 \n(12)\n478 \nTotal corporate fixed income portfolio\n32,484\n \n656\n \n(260)\n32,880\n \nU.S. government and agencies\n13,490 \n55 \n(20)\n13,525 \nMunicipal\n6,258 \n67 \n(99)\n6,226 \nForeign government\n1,422 \n23 \n(10)\n1,435 \nABS\n976 \n13 \n(3)\n986 \nMBS\n2,102 \n34 \n(2)\n2,134 \nTotal fixed income securities\n$\n56,732\n \n$\n848\n \n$\n(394)\n$\n57,186\n \nDecember 31, 2024\nCorporate\nBanking \n$\n4,194 \n$\n38 \n$\n(63)\n$\n4,169 \nBasic industry\n833 \n6 \n(21)\n818 \nCapital goods\n2,706 \n25 \n(62)\n2,669 \nCommunications\n2,364 \n16 \n(73)\n2,307 \nConsumer goods (cyclical and non-cyclical)\n6,674 \n51 \n(165)\n6,560 \nEnergy\n2,771 \n32 \n(50)\n2,753 \nFinancial services\n2,104 \n17 \n(53)\n2,068 \nTechnology\n2,613 \n18 \n(94)\n2,537 \nTransportation\n815 \n7 \n(19)\n803 \nUtilities\n5,125 \n56 \n(89)\n5,092 \nOther\n431 \n6 \n(21)\n416 \nTotal corporate fixed income portfolio\n30,630\n \n272\n \n(710)\n30,192\n \nU.S. government and agencies\n11,423 \n15 \n(330)\n11,108 \nMunicipal\n8,985 \n33 \n(176)\n8,842 \nForeign government\n1,352 \n22 \n(10)\n1,364 \nABS\n1,130 \n19 \n(4)\n1,145 \nMBS\n96 \n— \n— \n96 \nTotal fixed income securities\n$\n53,616\n \n$\n361\n \n$\n(1,230)\n$\n52,747\n \n66\n \nwww.allstate.com\nInvestments\nIn general, gross unrealized losses are related to an increase in market yields, which may include increased risk-free interest rates and wider credit spreads since the time of initial purchase. Similarly, gross unrealized gains reflect a decrease in market yields since the time of initial purchase.\nEquity securities by sector\nSeptember 30, 2025\nDecember 31, 2024\n($ in millions)\nCost\nOver (under) cost\nFair\nvalue\nCost\nOver (under) cost\nFair\nvalue\nBanking\n$\n157 \n$\n43 \n$\n200 \n$\n119 \n$\n41 \n$\n160 \nBasic industry\n50 \n5 \n55 \n39 \n(2)\n37 \nCapital goods\n222 \n8 \n230 \n201 \n(23)\n178 \nCommunications\n188 \n35 \n223 \n142 \n25 \n167 \nConsumer goods\n551 \n(5)\n546 \n462 \n(25)\n437 \nEnergy\n99 \n7 \n106 \n88 \n1 \n89 \nFinancial services\n203 \n15 \n218 \n332 \n6 \n338 \nREITs\n128 \n29 \n157 \n159 \n17 \n176 \nTechnology\n1,019 \n173 \n1,192 \n746 \n88 \n834 \nTransportation\n23 \n3 \n26 \n27 \n1 \n28 \nUtilities\n109 \n6 \n115 \n92 \n1 \n93 \nOther\n8 \n(3)\n5 \n6 \n(2)\n4 \nDirectly held equity securities\n2,757\n \n316\n \n3,073\n \n2,413\n \n128\n \n2,541\n \nFunds\nEquities\n856 \n66 \n922 \n1,077 \n22 \n1,099 \nFixed income and short-term\n1,328 \n13 \n1,341 \n838 \n(16)\n822 \nOther\n2 \n— \n2 \n1 \n— \n1 \nTotal funds\n2,186\n \n79\n \n2,265\n \n1,916\n \n6\n \n1,922\n \nTotal equity securities\n$\n4,943\n \n$\n395\n \n$\n5,338\n \n$\n4,329\n \n$\n134\n \n$\n4,463\n \nNet investment income\nThree months ended September 30,\nNine months ended September 30,\n($ in millions)\n2025\n2024\n2025\n2024\nFixed income securities\n$\n634 \n$\n587 \n$\n1,844 \n$\n1,684 \nEquity securities\n19 \n17 \n56 \n50 \nMortgage loans\n11 \n9 \n30 \n27 \nLimited partnership interests\n226 \n138 \n494 \n440 \nShort-term investments\n104 \n87 \n273 \n216 \nOther investments\n26 \n25 \n71 \n71 \nInvestment income, before expense\n1,020\n \n863\n \n2,768\n \n2,488\n \nInvestment expense\nInvestee level expenses\n(13)\n(12)\n(34)\n(36)\nSecurities lending expense\n(21)\n(28)\n(64)\n(80)\nOperating costs and expenses\n(37)\n(40)\n(113)\n(113)\nTotal investment expense\n(71)\n(80)\n(211)\n(229)\nNet investment income\n$\n949\n \n$\n783\n \n$\n2,557\n \n$\n2,259\n \nMarket-based\n$\n780 \n$\n708 \n$\n2,232 \n$\n2,001 \nPerformance-based\n240 \n155 \n536 \n487 \nInvestment income, before expense\n$\n1,020\n \n$\n863\n \n$\n2,768\n \n$\n2,488\n \nNet investment income\n increased 21.2% or $166 million in the third quarter of 2025 and increased 13.2% or $298 million in the first nine months of 2025 compared to the same periods of 2024. Net investment income increase included higher market-based income resulting from higher average investment balances and elevated fixed income yields. Performance-based investment results reflected broad-based valuation gains across private equity and real estate holdings.\nThird Quarter 2025 Form 10-Q  \n \n67\nInvestments\nPerformance-based investment income\nThree months ended September 30,\nNine months ended September 30,\n($ in millions)\n2025\n2024\n2025\n2024\nPrivate equity\n$\n197 \n$\n130 \n$\n374 \n$\n445 \nReal estate\n43 \n25 \n162 \n42 \nTotal performance-based income before investee level expenses\n$\n240\n \n$\n155\n \n$\n536\n \n$\n487\n \nInvestee level expenses\n (1)\n(13)\n(12)\n(34)\n(36)\nTotal performance-based income\n$\n227\n \n$\n143\n \n$\n502\n \n$\n451\n \n(1)\nInvestee level expenses include asset level operating expenses on directly held real estate and other consolidated investments reported in investment expense.\nPerformance-based investment income\n increased 58.7% or $84 million in the third quarter of 2025 compared to the same period of 2024, related to higher private equity valuation increases and real estate investment results. Performance-based investment income increased 11.3% or $51 million in the first nine months of 2025 compared to the same period of 2024, primarily due to higher real estate investment results, partially offset by lower private equity valuation increases.\nPerformance-based investment results and income can vary significantly between periods and are influenced by economic conditions, equity market \nperformance, comparable public company earnings multiples, capitalization rates, operating performance of the underlying investments and the timing of asset sales. The Company typically employs a lag in recording and recognizing changes in valuations of limited partnership interests due to the availability of investee financial statements. As a result, performance-based income in the third quarter of 2025 is primarily comprised of operating and market performance and results of our investments for the three months ended June 30, 2025, and may not reflect all economic conditions since the U.S.’s imposition of tariffs on goods imported to the U.S.\nComponents of net gains (losses) on investments and derivatives and the related tax effect\nThree months ended September 30,\nNine months ended September 30,\n($ in millions)\n2025\n2024\n2025\n2024\nSales\n$\n69 \n$\n116 \n$\n(313)\n$\n(85)\nCredit losses \n(1)\n(23)\n(12)\n(103)\n(143)\nValuation change of equity investments - appreciation (decline):\nEquity securities\n175 \n89 \n221 \n175 \nEquity fund investments in fixed income securities and short-term investments\n16 \n30 \n22 \n20 \nLimited partnerships \n(2)\n9 \n— \n10 \n12 \nTotal valuation of equity investments\n200\n \n119\n \n253\n \n207\n \nValuation change and settlements of derivatives\n6 \n20 \n(78)\n(3)\nNet gains (losses) on investments and derivatives, pre-tax\n252\n \n243\n \n(241)\n(24)\nIncome tax (expense) benefit\n(56)\n(54)\n49 \n4 \nNet gains (losses) on investments and derivatives, after-tax\n$\n196\n \n$\n189\n \n$\n(192)\n$\n(20)\nMarket-based \n(1)\n$\n222 \n$\n231 \n$\n(267)\n$\n(53)\nPerformance-based\n30 \n12 \n26 \n29 \nNet gains (losses) on investments and derivatives, pre-tax\n$\n252\n \n$\n243\n \n$\n(241)\n$\n(24)\n(1)\n2025 includes losses recorded for variable interests in Reciprocal Exchanges. 2024 includes losses related to the carrying value of surplus notes issued by Reciprocal Exchanges. See Note 8 for further details.\n(2)\nRelates to limited partnerships where the underlying assets are predominately public equity securities.\nNet gains on investments and derivatives\n in the third quarter of 2025 primarily related to valuation increases on equity investments and gains on sales of fixed income securities. Net losses in the first nine months of 2025 primarily related to losses on sales of fixed income securities, credit losses primarily related to variable interests in Reciprocal Exchanges and certain real estate-related investments and losses on valuation change and settlements of derivatives, partially offset by valuation increases on equity investments.\nNet gains on sales\n in the third quarter of 2025 related to sales of fixed income securities in connection with ongoing portfolio management and repositioning of the portfolio into intermediate-duration fixed income securities. Net losses on sales in the first nine months of 2025 related to sales of fixed income securities in connection with risk reduction and repositioning in the second and third quarters and ongoing portfolio management.\nNet gains on valuation change and settlements of derivatives\n of $6 million in the third quarter of 2025 primarily related to gains on foreign currency contracts \n68\n \nwww.allstate.com\nInvestments\nused to manage foreign currency and interest rate futures used to manage duration. Net losses of $78 million in the first nine months of 2025 primarily related to losses on foreign currency contracts used to \nmanage foreign currency, credit default contracts due to tightening credit spreads, equity futures used to manage equity exposure and interest rate futures used to manage duration. \nNet gains (losses) on performance-based investments and derivatives\nThree months ended September 30,\nNine months ended September 30,\n($ in millions)\n2025\n2024\n2025\n2024\nSales\n$\n(38)\n$\n8 \n$\n(41)\n$\n6 \nCredit losses\n(17)\n(7)\n(28)\n(28)\nValuation change of equity investments\n79 \n34 \n145 \n60 \nValuation change and settlements of derivatives\n6 \n(23)\n(50)\n(9)\nTotal performance-based\n$\n30\n \n$\n12\n \n$\n26\n \n$\n29\n \nNet gains on performance-based investments and derivatives\n in the third quarter of 2025 primarily related to valuation gains on equity investments, partially offset by losses on sales. Net gains on performance-based investments and derivatives in the first nine months of 2025 primarily related to valuation gains on equity investments, partially offset by decreased valuation change and settlements of derivatives from losses on foreign currency contracts used to manage foreign currency risk and losses on sales.\nThird Quarter 2025 Form 10-Q  \n \n69\nCapital Resources and Liquidity \nCapital Resources and Liquidity\nCapital resources\n consist of shareholders’ equity and debt, representing funds deployed or available to be deployed to support business operations or for general corporate purposes. \nCapital resources\n($ in millions)\nSeptember 30, 2025\nDecember 31, 2024\nPreferred stock, common stock, treasury stock, retained income and other shareholders’ equity items\n$\n27,207 \n$\n22,331 \nAccumulated other comprehensive income (loss)\n298 \n(889)\nTotal Allstate shareholders’ equity\n27,505\n \n21,442\n \nDebt \n(1)\n8,089 \n8,085 \nTotal capital resources\n$\n35,594\n \n$\n29,527\n \nRatio of debt to Allstate shareholders’ equity\n29.4 \n%\n37.7 \n%\nRatio of debt to capital resources\n22.7 \n27.4 \n(1)\nNet of debt issuance costs of $52 million and $56 million as of September 30, 2025 and December 31, 2024, respectively.\nAllstate shareholders’ equity \nincreased in the first nine months of 2025, primarily due to net income and an increase in unrealized net capital gains on investments in 2025, partially offset by common share repurchases and dividends to shareholders. In the nine months ended September 30, 2025, we paid dividends of $773 million and $88 million related to our common and preferred shares, respectively.\nDebt maturities  \nWe have $600 million of debt that is scheduled to mature in December 2025.\nDebt maturities for each of the next five years \nand thereafter (excluding issuance costs)\n($ in millions)\n2026\n$\n550 \n2027\n— \n2028\n— \n2029\n500 \n2030\n600 \nThereafter\n5,891 \nTotal long-term debt principal\n$\n7,541\n \nCommon share repurchases\n \n On February 26, 2025, the Board of Directors authorized a new $1.50 billion common share repurchase program that must be completed by September 30, 2026. As of September 30, 2025, there was $695 million remaining in the $1.50 billion common share repurchase program.\nDuring the first nine months of 2025, we repurchased 4.0 million common shares, or 1.5% of total common shares outstanding at December 31, 2024, for $805 million.\nCommon shareholder dividends\n  On January 2, 2025, April 1, 2025 and July 1, 2025, we paid a common shareholder dividend of $0.92, $1.00 and $1.00, respectively. On July 15, 2025, we declared a common shareholder dividend of $1.00 payable on October 1, 2025.\nFinancial ratings and strength\n \n Our ratings are influenced by many factors including our operating and financial performance, asset quality, liquidity, overall portfolio mix, financial leverage (i.e., debt), exposure to risks such as catastrophes and the current level of operating leverage. The preferred stock and subordinated debentures are viewed as having a \ncommon equity component by certain rating agencies and are given equity credit up to a pre-determined limit in our capital structure as determined by their respective methodologies. These respective methodologies consider the existence of certain terms and features in the instruments such as the noncumulative dividend feature in the preferred stock.\nIn May 2025, Moody’s affirmed The Allstate Corporation’s (the “Corporation”) senior debt and short-term issuer ratings of A3 and P-2, respectively, and Allstate Insurance Company’s (“AIC”) insurance financial strength rating of Aa3. The outlook for the ratings changed from negative to stable. \nIn May 2025, S&P affirmed the Corporation's senior debt and short-term issuer ratings of BBB+ and A-2, respectively, and AIC's insurance financial strength rating of A+. The outlook for the ratings is stable.\nIn August 2025, A.M. Best affirmed the Corporation’s senior debt and short-term issuer ratings of a- and AMB-1, respectively, and AIC’s insurance financial strength rating of A+. The outlook for the ratings is stable.\nLiquidity sources and uses\n \n We actively manage our financial position and liquidity levels in light of changing market, economic and business conditions. Liquidity is managed at both the entity and enterprise level across the Company and is assessed on both base and stressed level liquidity needs. We believe we have sufficient liquidity to meet these needs. As of September 30, 2025, we held $27.85 billion of cash, U.S. government and agencies fixed income securities, public equity securities and short-term investments, which we would expect to be able to liquidate within one week.\nAdditionally, we have existing intercompany agreements in place that facilitate liquidity management across the Company to enhance flexibility.\nThe Corporation is party to an Amended and Restated Intercompany Liquidity Agreement (“Liquidity Agreement”) with certain subsidiaries, which includes, but is not limited to AIC. The Liquidity Agreement allows for short-term advances of funds to be made between parties for liquidity and other general \n70\n \nwww.allstate.com\nCapital Resources and Liquidity \ncorporate purposes. The Liquidity Agreement does not establish a commitment to advance funds on the part of any party. AIC serves as a lender and borrower, certain other subsidiaries serve only as borrowers, and the Corporation serves only as a lender. The maximum amount of potential funding under each of these agreements is $1.00 billion.\nIn addition to the Liquidity Agreement, the Corporation also has an intercompany loan agreement with certain of its subsidiaries, which includes, but is not limited to, AIC. The amount of intercompany loans available to the Corporation’s subsidiaries is at the discretion of the Corporation. The maximum amount of loans the Corporation will have outstanding to all its eligible subsidiaries at any given point in time is limited to $1.00 billion. The Corporation may use commercial paper borrowings, bank lines of credit and securities lending to fund intercompany borrowings.\nParent company capital capacity\n \n At the parent holding company level, we have deployable assets totaling $5.54 billion as of September 30, 2025, primarily comprised of cash and short-term, fixed income and equity securities that are generally saleable within one quarter. The proceeds from the EVB and group health dispositions increased deployable assets at the parent holding company level. The earnings capacity of the operating subsidiaries is the primary source of capital generation for the Corporation.\nBased on the greater of 2024 statutory net income or 10% of actual December 31, 2024 statutory surplus, the maximum amount of dividends that AIC will be able to pay, without prior Illinois Department of Insurance approval, at a given point in time through February 2026, is estimated to be $3.95 billion, less dividends paid during the preceding twelve months measured at that point in time. In the first nine months of 2025, $750 million of dividends have been paid.\nDividends may not be paid or declared on our common stock and shares of common stock may not be repurchased unless the full dividends for the latest completed dividend period on our preferred stock have been declared and paid or provided for.\nThe terms of our outstanding subordinated debentures also prohibit us from declaring or paying any dividends or distributions on our common or preferred stock or redeeming, purchasing, acquiring, or making liquidation payments on our common stock or preferred stock if we have elected to defer interest payments on the subordinated debentures, subject to certain limited exceptions. In the first nine months of 2025, we did not defer interest payments on the subordinated debentures.\nAdditional resources to support liquidity are as follows:\n•\nThe Corporation and AIC have access to a $750 million unsecured revolving credit facility that is available for short-term liquidity requirements. The maturity date of this facility is November 2027. The facility is fully subscribed among 11 lenders with the largest commitment being $95 million. \nThe commitments of the lenders are several and no lender is responsible for any other lender’s commitment if such lender fails to make a loan under the facility. This facility contains an increase provision that would allow up to an additional $500 million of borrowing, subject to the lenders’ commitment. This facility has a financial covenant requiring that we not exceed a 37.5% debt to capitalization ratio as defined in the agreement. This ratio was 17.9% as of September 30, 2025. Although the right to borrow under the facility is not subject to a minimum rating requirement, the costs of maintaining the facility and borrowing under it are based on the ratings of our senior unsecured, unguaranteed long-term debt. There were no borrowings under the credit facility during 2025.\n•\nTo cover short-term cash needs, the Corporation has access to a commercial paper facility with a borrowing capacity limited to any undrawn credit facility balance up to $750 million. As of September 30, 2025, there were no balances outstanding for the credit facility or the commercial paper facility, and therefore the remaining borrowing capacity was $750 million.\n•\nThe Corporation has access to a universal shelf registration statement with the Securities and Exchange Commission that was filed on April 30, 2024 and expires in 2027. We can use this shelf registration to issue an unspecified amount of debt securities, common stock (including 638 million shares of treasury stock as of September 30, 2025), preferred stock, depositary shares, warrants, stock purchase contracts and stock purchase units. The specific terms of any securities we issue under this registration statement will be provided in the applicable prospectus supplements.\nThird Quarter 2025 Form 10-Q  \n \n71\nForward-Looking Statements\nThis report contains “forward-looking statements” that anticipate results based on our estimates, assumptions and plans that are subject to uncertainty. These statements are made subject to the safe-harbor provisions of the Private Securities Litigation Reform Act of 1995. Forward-looking statements do not relate strictly to historical or current facts and may be identified by their use of words like “plans,” “seeks,” “expects,” “will,” “should,” “anticipates,” “estimates,” “intends,” “believes,” “likely,” “targets” and other words with similar meanings. These statements may address, among other things, our strategy for growth, catastrophe exposure management, product development, investment results, regulatory approvals, market position, expenses, financial results, litigation and reserves. We believe that these statements are based on reasonable estimates, assumptions and plans. Forward-looking statements speak only as of the date on which they are made, and we assume no obligation to update any forward-looking statements resulting from new information or future events or developments. In addition, forward-looking statements are subject to certain risks or uncertainties that could cause actual results to differ materially from those communicated in these forward-looking statements. Factors that could cause actual results to differ materially from those expressed in, or implied by, the forward-looking statements include risks related to:\nInsurance and Financial Services\n (1)\n \nactual claim costs exceeding current reserves;\n \n(2) unexpected increases in claim frequency or severity;\n \n(3) catastrophes and severe weather events;\n \n(4) limitations in analytical models used for loss cost estimates; (5)\n \nprice competition and changes in regulation and underwriting standards; (6)\n \nregulatory limitations on rate increases and requirements to underwrite business and participate in loss sharing arrangements; (7)\n \nmarket risk and declines in credit quality of our investment portfolios; (8)\n \neconomic and capital market conditions affecting investments; (9) subjective determination of fair value and amount of credit losses for investments; (10) participation in indemnification programs, including state industry pools and facilities; (11) inability to mitigate the impact associated with changes in capital requirements; (12) a downgrade in financial strength ratings;\nBusiness, Strategy and Operations\n \n(13) operations in markets that are highly competitive; (14) changing consumer preferences; (15)\n \nnew or changing technologies impacting the business; (16)\n \ninability to successfully deploy new technologies;\n \n(17) Transformative Growth strategy; (18) catastrophe management strategy;\n \n(19)\n \nrestrictions on our subsidiaries’ ability to pay dividends; (20)\n \nrestrictions under terms of some of our securities on the ability to pay dividends or repurchase stock; (21)\n \nthe availability and cost of reinsurance; (22)\n \ncounterparty risk related to reinsurance; (23)\n \nacquisitions and divestitures of businesses; (24) intellectual property infringement, misappropriation and third-party claims; (25) reliance on vendors for products, services or protection of data and information; (26) inability to attract, develop and retain talent;\nMacro, Regulatory and Risk Environment\n \n(27)\n \nconditions in the global economy and capital markets, including changes in U.S. trade and tariff policy, new or additional U.S. and responsive non-U.S. tariffs, and our ability to plan for and respond to the impact of those changes; (28)\n \nrestrictions on liquidity or availability of credit on acceptable terms; (29)\n \na large-scale pandemic, the occurrence of terrorism, military actions or political and social unrest or other disruptive or destabilizing events; (30)\n \nthe failure in cyber or other information security controls;\n \n(31) failure of business continuity following a disaster or other event; (32) changing climate and weather conditions; (33) evolving environmental, social and governance standards and expectations;\n \n(34) evolving privacy and data security regulations and increased focus on enforcement;\n \n(35) failure to manage risk and to timely detect and mitigate a cybersecurity event; (36) restrictive regulations and uncertainty around the interpretation and implementation of regulations in the U.S. and internationally; (37) regulatory reforms and enforcement of existing regulations; (38) losses from legal and regulatory actions; (39) changes in or the application of accounting standards and changes in tax laws; and (40) misconduct or fraudulent acts by employees, agents and third parties.\nAdditional information concerning these and other factors may be found in our filings with the Securities and Exchange Commission, including the “Risk Factors” section in our most recent annual report on Form 10-K."
}