{
  "source_file": "all-20241231.htm",
  "form_type": "10-K",
  "item1": "Item 1. Business\nPart I\nItem 1. Business\nThe Allstate Corporation was incorporated under the laws of the State of Delaware on November 5, 1992, to serve as the holding company for Allstate Insurance Company. Its business is conducted principally through Allstate Insurance Company and other subsidiaries (collectively, including The Allstate Corporation, “Allstate”). \nThe Allstate Corporation is one of the largest publicly held personal lines insurers in the United States. Allstate’s strategy is to increase market share in personal property-liability and broaden protection offerings. The Allstate brand is widely known through the \n“You’re In Good Hands With Allstate\n®\n”\n slogan. \nAllstate at a Glance\n208\nmillion policies\nin force (“PIF”)\n55,000\nemployees\n3\nrd \nlargest personal property and casualty insurer in the United States \n(1)\n$72.61 billion\ninvestment portfolio\n(1)\nBased on 2023 statutory direct premiums written according to A.M. Best\nWe empower\n customers with protection to help them achieve their hopes and dreams.\nWe provide \naffordable, simple and connected protection solutions.\nWe create \nopportunity for our team, economic value for our shareholders and improve communities.\nWhat We Do\nAuto and homeowners insurance\nRoadside assistance\nSelect commercial property and casualty coverages\nAutomotive protection and insurance products\nConsumer product protection plans\nIdentity protection\nMobility data collection services and analytic solutions using automotive telematics information\nEmployer voluntary benefits, group health insurance and individual health insurance \nReportable segments\nAllstate Protection \n(1)\nOffers private passenger auto, homeowners, other personal lines and commercial insurance through exclusive agents, independent agents, contact centers and online under the Allstate, National General and Answer Financial brands.\nRun-off Property-Liability \n(1)\nRelates to property and casualty insurance policies written during the 1960s through the mid-1980s with exposure to asbestos, environmental and other claims in run-off.\nProtection Services\nProvides consumer product protection plans, device and mobile data collection services and analytic solutions using automotive telematics information, roadside assistance, protection and insurance products and identity protection and restoration through Allstate Protection Plans, Allstate Dealer Services, Allstate Roadside, Arity and Allstate Identity Protection.\nAllstate Health and Benefits\nOffers self-funded stop-loss and fully insured group health products to employers, and Medicare supplement, ancillary products and short-term medical insurance to individuals, sold through independent agents, owned agencies, benefits brokers and Allstate exclusive agents.\nCorporate and Other\nIncludes net investment income, net gains (losses) on investments, other revenue, debt service, holding company activities and certain non-insurance operations.\n(1)\nAllstate Protection and Run-off Property-Liability segments comprise Property-Liability. \nOn August 13, 2024, Allstate entered into an agreement with StanCorp Financial Group, Inc. to sell Allstate’s employer voluntary benefits business. The transaction is expected to close in the first half of 2025, subject to regulatory approvals and other customary closing conditions. On January 30, 2025, Allstate entered into an agreement with Nationwide Life Insurance Company to sell the group health business. The transaction is expected to close during 2025, subject to regulatory approvals and other customary closing conditions. The individual health business will either be retained or divested. \nIn this Annual Report on Form 10-K, we occasionally refer to statutory financial information. All domestic United States insurance companies are required to prepare statutory-basis financial statements. As a result, industry data is available that enables comparisons between insurance companies, including competitors that are not required to prepare financial statements in conformity with accounting principles generally accepted in the United States of America (“GAAP”). We frequently use industry publications containing statutory financial information to assess our competitive position.\nThe Allstate Corporation      1\n2024 Form 10-K\n \nItem 1. Business\n \nOur Shared Purpose, Strategy and Segment Information \nEstablished Our Shared Purpose in 2007 to articulate Allstate’s purpose and obligations to key stakeholders: customers, shareholders, employees and communities. The strategy to achieve those objectives is linked to operational execution by articulating values, operating standards and behaviors. \nOur Shared Purpose\nAs the Good Hands...\nOur Values\nOur Operating Standards\nOur Behaviors\n•\nWe \nempower\n \ncustomers with protection to help them achieve their hopes and dreams.\n•\nWe \nprovide\n \naffordable, simple and connected protection solutions.\n•\nWe \ncreate\n \nopportunity    for our team, economic value for our shareholders and improve communities.\n•\nIntegrity\n is non-negotiable.\n•\nInclusive Diversity & Equity\n \nvalues and leverages unique identities with equitable opportunity and rewards.\n•\nCollective Success\n is achieved through empathy and prioritizing enterprise outcomes ahead of individuals.\n•\nFocus on Customers\n by anticipating and exceeding service expectations at low costs.\n•\nBe the Best\n at protecting customers, developing talent and running our businesses.\n•\nBe Bold\n with original ideas using speed and conviction to beat the competition.\n•\nEarn Attractive Returns\n by providing customer value, proactively accepting risk and using analytics.\n•\nCollaborate\n early and often to develop and implement comprehensive solutions and share learnings.\n•\nChallenge Ideas\n to leverage collective expertise, evaluate multiple alternatives and create the best path forward.\n•\nProvide Clarity\n for expected outcomes, decision authority and accountability.\n•\nProvide Feedback\n that is candid, actionable, independent of hierarchy and safe.\nOur strategy has two components: increase personal property-liability market share and expand protection offerings by leveraging the Allstate brand, customer base and capabilities. \n2      www.allstate.com\n2024 Form 10-K\n \nItem 1. Business\nAllstate Protection’s strategy is to be a low cost digital provider that offers affordable, simple and connected products. Allstate Protection will increase personal lines market share through Transformative Growth. Transformative Growth is about creating a business model, capabilities and culture that continually transform to better serve customers. This is done by providing affordable, simple and connected protection through multiple distribution channels. The acquisition of National General expanded our independent agent relationships and Transformative Growth has improved our direct sales capabilities. The successful repositioning of distribution has increased new business in all channels. The ultimate objective is to enhance customer value to drive growth in all businesses by:\n•\nImproving customer value by providing low cost affordable, simple and connected protection solutions\n•\nExpanding customer access to Allstate and National General products and services through a wide variety of distribution channels\n•\nIncreasing sophistication and investment in customer acquisition \n•\nDeploying new technology ecosystems that are more flexible and enable a digital customer experience\n•\nDriving organizational transformation\n Protection Services’ strategy is to innovate new products and services, expand distribution and provide affordable, simple and connected protection solutions.\nAllstate Protection Plans\nExpand distribution and product breadth of consumer protection plans through new and existing retailers and mobile operators across North America, Europe, Asia and Australia.\nAllstate Dealer Services\nExpand distribution of Allstate branded protection and insurance products through auto dealerships, business partnerships and direct to consumer.\nAllstate Roadside\nModernize the roadside assistance business through technology and enhanced digital capabilities to deliver a superior customer experience.\nArity\nProvide industry-leading telematics and mobility insights to insurance companies, the transportation industry and location-enabled consumer apps.\nAllstate Identity Protection\nCreate a leading position in the identity protection and restoration market, offering full-service identity protection and expand partnership and direct to consumer distribution channels.\n \nThe Allstate Corporation      3\n2024 Form 10-K\n \nItem 1. Business\n \nAllstate Protection Segment\nOur Allstate Protection segment accounted for 92.4% of Allstate’s 2024 consolidated insurance premiums and contract charges and 18.0% of Allstate’s December 31, 2024 PIF. This segment includes private passenger auto, homeowners and other personal lines products offered through Allstate branded exclusive agents, independent agents and directly to consumers.\nWe have three market-facing property-liability businesses, Allstate brand, National General and Answer Financial with products and services that cater to different customer needs and distribution preferences. \nTransformative Growth \nImprove Customer Value\nSeeking to be a low cost provider through cost reductions, identifying savings opportunities for customers through proactive protection reviews and increasing pricing sophistication\nBroadening the benefits of being connected with the Allstate Mobile app and expanded use of telematics pricing sophistication\nImproving customer interactions and reducing customer effort\nExpand Customer Access\nIncreasing Allstate agent efficiency and productivity, positioning them to deliver greater value to customers at lower costs\nGrowing National General by leveraging Allstate pricing and product capabilities and expanding product offerings and independent agency relationships\nIncreasing direct channel distribution through improved customer experiences, increasing marketing and expanding sales capacity\nIncrease Sophistication and Investment in Customer Acquisition\nImproving the effectiveness of customer acquisition by centralizing lead management and using data and advanced computing capabilities\nIncreasing marketing spend in geographic areas meeting target margins\nDeploy New Technology Ecosystem\nDeploying an advanced technology ecosystem to deliver affordable, simple, and connected experiences and products at a lower cost\nUsing large language models to improve customer communications\nDrive Organizational Transformation\nImprove effectiveness and efficiency by empowering talent with decision clarity, agile business processes, measurement science and advanced technology\n \n4      www.allstate.com\n2024 Form 10-K\n \nItem 1. Business\nProducts and distribution\nAllstate Protection differentiates itself by offering a comprehensive range of affordable, simple and connected protection solutions across distribution channels for specific consumer segments. \nProtection Products \nInsurance products \n(1)\nAuto\nHomeowners\nSpecialty auto (motorcycle, trailer, motor home and off-road vehicle)\nOther personal lines (renters, condominium, landlord, boat, umbrella, manufactured home, scheduled personal property and valuable item protection)\nCommercial lines \nAnswer Financial\nComparison quotes and sales of non-proprietary auto, homeowners and other personal lines (condominium, renters, motorcycle, recreational vehicle and boat)\n(1)\nInsurance products are primarily offered by the Allstate and National General brands.\nDistribution \nExclusive agency channel\nIn the U.S., we offer products through over 27,700 Allstate exclusive agents and licensed sales professionals and 600 exclusive financial specialists who offer non-proprietary life and annuity insurance and investment products. In Canada, we offer Allstate brand products through approximately 500 employee sales agents.\nIndependent agency channel\nIn the U.S., we distribute our products through approximately 55,000 independent agent locations.\nDirect channel\nWe offer products through approximately 1,800 sales representatives in contact centers and online. We also offer Direct Auto products through employees in approximately 500 retail stores.\nStrategy updates and additional information\nAllstate exclusive agents and direct channel  \nOur Affordable, Simple and Connected auto and homeowners insurance product rollouts will be largely completed by the end of 2025. This will include a simplified shopping and customer experience and enhanced pricing sophistication that provides a seamless experience for customers.\nIndependent Agents  \nOur Custom360\n®\n middle market standard and preferred auto and homeowners insurance product will be rolled out to the majority of the country by the end of 2025. \nAllstate Protection pricing and risk management strategies  \nOur pricing and underwriting strategies and decisions are designed to generate sustainable profitable growth.\nA proprietary database of underwriting and loss experience enables sophisticated pricing algorithms and methodologies to accurately price risks while seeking to attract and retain customers in multiple risk segments.\n•\nFor auto insurance, risk evaluation factors can include, but are not limited to: vehicle make, model and year; driver age and marital status; territory; years licensed; loss history; years insured with prior carrier; prior liability limits; prior lapse in \ncoverage; and insurance scoring utilizing telematics data and other consumer information.\n•\nFor property insurance, risk evaluation factors can include, but are not limited to: geographic location of the property; loss history; age, condition and construction characteristics of the property; insurance scoring utilizing other consumer information; and the amount of insurance purchased.\nThe pricing strategy involves local marketplace pricing and underwriting decisions based on risk evaluation factors to the extent permissible by applicable law and an evaluation of competitors.\nPricing of property products is intended to generate risk-adjusted returns that are acceptable over a long-term period. Rate increases are pursued to keep pace with loss cost trends, including losses from catastrophic events and those that are weather-related (such as wind, hail, lightning and freeze not meeting our criteria to be declared a catastrophe). We also take into consideration potential customer disruption, the impact on our ability to market our products, regulatory limitations, our competitive position and profitability. \nThe Allstate Corporation      5\n2024 Form 10-K\n \nItem 1. Business\n \nIn any reporting period, loss experience from catastrophic events and weather-related losses may contribute to negative or positive underwriting performance relative to the expectations incorporated into product pricing.\nProperty catastrophe exposure is managed with the goal of providing shareholders an acceptable return on the risks assumed, managing variability of earnings, while providing protection to our customers. Catastrophe exposure management includes purchasing reinsurance to provide coverage for known exposure to hurricanes, earthquakes and fires following earthquakes, wildfires and other catastrophes. \nOur current catastrophe reinsurance program utilizes the Company’s risk and return framework which incorporates our robust economic capital model and is informed by catastrophe risk models including hurricanes, earthquakes and wildfires. We monitor risk both in aggregate and by peril, while also evaluating model performance relative to experience and our expectations of catastrophe risk trends. As of December 31, 2024, the modeled 1-in-100 probable maximum loss for hurricane, earthquake and wildfire perils is approximately $3.5 billion, net of reinsurance. We continually review our aggregate risk appetite and the cost and availability of reinsurance to optimize the risk and return profile of this exposure.\nThe use of different assumptions and updates to industry models and to our risk transfer program could materially change the projected loss. Growth strategies include areas where we believe diversification can be enhanced and an appropriate return can be earned for the risk. As a result, our modeled exposure may increase. In addition, we have exposure to other severe weather events, which impact catastrophe losses.\nWe are promoting measures to prevent and mitigate losses that are increasing due to climate change and increased severe weather including making homes and communities more resilient, enforcement of stronger building codes, adoption of sensible land use policies, expanded disaster response capabilities and creation of public risk sharing mechanisms.\nCommercial lines strategy \n The commercial lines strategy is focused on growing the National General commercial auto product lines with strategic expansion as the organization shifts from the Allstate brand to the National General brand. The National General commercial auto product is replacing the Allstate Business Insurance product and is sold through exclusive agents and independent agents. The National General brand will continue to expand geographically and increase product lines that were previously sold through the Allstate brand.\nIn 2024, the commercial insurance strategy was further advanced through an equity investment and commercial partnership with NEXT Insurance, a high-growth, digital platform for small business insurance. This partnership expands the availability of our commercial lines offerings via the NEXT product portfolio, which complements the commercial auto \nproduct offering, across a wider distribution network, and will expand to sell directly to consumers.\nIn 2023, we began exiting Allstate brand traditional commercial insurance and the run-off is expected to be complete by the end of 2025.  \nAnswer Financial strategy\n  Answer Financial is an insurance agency that sells Allstate and other insurance companies’ products directly to customers. Our strategy as a technology-enabled insurance agency is to provide comparison shopping and related services for consumers, offering choice, convenience and ease of use.\nCompensation structure\nExclusive agent\n \n \nThe compensation structure for Allstate exclusive agents rewards them for delivering high value to customers and achieving certain business outcomes such as profitable growth and household penetration. Allstate exclusive agent remuneration comprises a base commission, variable compensation and monthly and annual bonus opportunities.\n•\nAgents receive a monthly base commission payment as a percentage of their total eligible written premium.\n•\nNew business variable compensation rewards agents for acquiring new customers by exceeding a base production goal and bundling products in the household. Renewal variable compensation rewards agents for bundling.\n•\nAnnual bonus compensation is based on a percentage of premiums and can be earned by agents who are meeting certain sales goals and selling additional policies to meet customer needs profitably.\nIndependent agent\n remuneration for National General comprises a base commission and an annual bonus opportunity that can be earned by agents who are profitably growing the business. The value proposition expands for key independent agency partners where we offer additional incentives for targeted growth.\n•\nAgents receive a monthly base commission payment as a percentage of their total eligible written premium. Commission rates vary by state and by product and bundled rates are higher than monoline rates.\n•\nAnnual profit share opportunity is based upon growing premium profitably and includes higher payouts in relation to eligible premiums for agencies that achieve premium growth and profit targets.\n•\nAdditional annual incentives are offered to key agency partners to reach specific targets and are tailored to incentivize profitable growth.\n6      www.allstate.com\n2024 Form 10-K\n \nItem 1. Business\nDirect channel employee agents \n The compensation structure for employee agents in the direct channel comprises paying employee agents a base salary as well as a variable compensation opportunity for selling a variety of products. Employee agents sell products through contact centers and also offer Direct Auto products through retail stores.\n•\nEmployee agents are compensated with a competitive base salary.\n•\nEmployee agents have variable compensation opportunities based upon meeting sales goals.\nOther products and distribution\n \nAllstate also sells commercial and homeowners (in high-risk geographies) insurance, roadside assistance and a range of non-proprietary life and annuity products offered by third-party providers.\nInnovative product offerings and features\nMarket-leading solutions\nAllstate brand\nAffordable, Simple, Connected\nReimagined insurance experience and products, making them affordable, simple and connected. Examples include fewer questions for customers to answer before getting a quote, easy-to-understand coverage descriptions and customized coverage offers and an industry-leading rating plan. Offered through the exclusive agency channel, on the web or direct to consumers in 31 states for auto, 28 states for renters and 4 states for both homeowners and valuable item protection as of December 31, 2024.\nNew product suite includes feature options for qualified customers similar to Your Choice Auto\n®\n, such as Accident Forgiveness and Auto Replacement Protection and new features such as more flexible transportation expense and expanded household composition options. \nAllstate House and Home\n® \nFeatured options include Claim RateGuard\n®\n, Claim-Free Bonus, Deductible Rewards\n®\n and flexibility in options and coverages, including graduated roof coverage and pricing based on roof type and age for damage related to wind and hail events. \nBundling Benefits \nAuto customers with a qualifying property policy are provided an auto renewal guarantee and a deductible waiver (when the same event, with the same covered cause of loss, damages both auto and property). Offered in 47 states and District of Columbia (“D.C.”) as of December 31, 2024. \nAuto Replacement\nProtection \nReplaces a qualifying customer’s vehicle involved in a total loss accident with a newer vehicle with fewer miles. Offered in 48 states and D.C. as of December 31, 2024. \nNational General\nCustom360\n®\nEndorsements and coverage amounts can be scaled up or down to create a custom, needs-based insurance solution for customers at all stages in life. Leverages Allstate analytics and rating plans adapted to the independent agency channel. Offered in 30 states as of December 31, 2024.\nTelematics solutions\nAllstate brand\nDrivewise\n®\nTelematics-based program, available in 48 states and D.C. as of December 31, 2024, that uses a mobile application or an in-vehicle device to capture driving behaviors and encourage safe driving. It provides customers with information, tools and more accurate individual pricing.\nMilewise\n®\nUsage-based insurance product, available in 21 states and D.C. as of December 31, 2024, that gives customers flexibility to customize their insurance and pay based on the number of miles they drive.\nNational General\nDynamicDrive\n®\nMobile-based telematics application, available in 44 states as of December 31, 2024, used to capture driving behaviors and to more accurately rate customers.\nThe Allstate Corporation      7\n2024 Form 10-K\n \nItem 1. Business\n \nCompetition\nThe personal lines insurance markets, including private passenger auto and homeowners insurance, are highly competitive. The following charts provide Allstate Protection’s combined market share compared to our principal U.S. competitors using statutory direct written premium for the year ended December 31, 2023, according to A.M. Best.\n \n \n \n    \nGeographic markets\nWe primarily operate in the U.S. (all 50 states and D.C.) and Canada. Our top geographic markets based on 2024 statutory direct premiums are reflected below.\n8      www.allstate.com\n2024 Form 10-K\n \nItem 1. Business\nProtection Services Segment\nOur Protection Services segment accounted for 4.7% of Allstate’s 2024 consolidated total revenue and 80.0% of Allstate’s December 31, 2024 PIF. Protection Services includes Allstate Protection Plans, Allstate Dealer Services, Allstate Roadside, Arity and\n \nAllstate Identity Protection, which offer a broad range of products and services that expand and enhance customer value propositions. \nProducts and distribution\nProducts and services\nAllstate Protection Plans\nProvides consumer protection plans and related technical support for mobile phones, consumer electronics and major appliances which provide customers protection from mechanical or electrical failure, and in certain cases, accidental damage. Also provides coverage for accidental damage on furniture. \nAllstate Dealer Services\nOffers protection and insurance products, including vehicle service contracts, guaranteed asset protection waivers, road hazard tire and wheel, and paint and fabric protection.  \nAllstate Roadside\n \nOffers towing, jump-start, lockout, fuel delivery and tire change services.\nArity\n \nProvides telematics-enabled mobility insights and services created from data collected, normalized and analyzed by the Arity platform, including automotive telematics information. Product suite includes on-demand risk scoring (Arity IQ), lead generation, digital advertising, data integration, traditional telematics and data-as-a-service solutions.\nAllstate Identity Protection\nProvides identity protection and restoration, consumer cybersecurity, privacy and family digital safety services.\nDistribution channels\nAllstate Protection Plans\nRetailers and mobile operators, in-store or online.\nAllstate Dealer Services\nIndependent agents selling through auto dealerships in the U.S. in conjunction with the purchase of a new or used vehicle, through business partnerships and direct to consumer.\nAllstate Roadside\nAllstate exclusive agents, direct to consumer, wholesale partners, affinity groups and on-demand mobile application service. \nArity\nStrategic partnerships to both affiliate and non-affiliate customers and direct to companies. \nAllstate Identity Protection\nWorkplace benefit programs, partnerships with financial institutions and direct to consumer delivered through enterprise partnerships, online and mobile application sales.\nGeographic markets \nProtection Services primarily operates in the U.S. and Canada, with Allstate Protection Plans also offering services in Europe, Asia and Australia.\nCompetition\n \nWe compete on a variety of factors, including product offerings, brand recognition, financial strength, price and customer experience. The market for these services is highly competitive. \nThe Allstate Corporation      9\n2024 Form 10-K\n \nItem 1. Business\n \nAllstate Health and Benefits Segment\nStrategy\n Allstate Health and Benefits segment accounted for 4.0% of Allstate’s 2024 consolidated total revenue and 2.0% of Allstate’s December 31, 2024 PIF. The Allstate Health and Benefits segment provides consumers with financial protection against the risk of accidents, illness and mortality.\nAllstate Health and Benefits is differentiated through its broad product portfolio, flexible enrollment solutions, strong national accounts team and well-recognized brand. \n•\nEmployer voluntary benefits provides supplemental health and life protection to employees across all company sizes, delivering substantially more value through innovative product offerings and providing exceptional customer service experiences for new and existing customers.\n•\nGroup health provides self-funded stop-loss and fully insured group health products to employers, primarily targeting small employer groups. Group health is differentiated in the market through its customizable products, flexible enrollment solutions and strong distribution team. \n•\nIndividual health is a leading provider of short-term medical, Medicare supplement and ancillary insurance products to individuals as well as third-party health products. Individual health is differentiated through its broad product portfolio, automated enrollment solutions and deep pool of agents. \nOn August 13, 2024, Allstate entered into a share purchase agreement with StanCorp Financial Group, Inc. to sell American Heritage Life Insurance Company and American Heritage Service Company, comprising Allstate’s employer voluntary benefits business. The transaction is expected to close in the first half of 2025, subject to regulatory approvals and other customary closing conditions. \nOn January 30, 2025, Allstate entered into an agreement with Nationwide Life Insurance Company to sell Direct General Life Insurance Company, NSM Sales Corporation and The Association Benefits Solution, LLC, comprising the group health business. The transaction is expected to close during 2025, subject to regulatory approvals and other customary closing conditions. The individual health business will either be retained or divested.\nProducts and distribution channels\nEmployer voluntary benefits\nOver 3,000 independent agents, benefits brokers and Allstate exclusive agents for employer voluntary benefits focusing on workplace benefits for employers\nGroup health\nOver 4,000 independent agents for group health focusing on health plans for small employers\nIndividual health\nOver 33,000 independent agents, in-house agencies, direct-to-consumer marketing, wholesaling, worksite marketing and the internet for individual health\nCompetition\nWe compete on a wide variety of factors, including product offerings, brand recognition, financial strength and ratings, price, distribution and customer service. \nThe market for self-funded plans is growing as small employer groups seek to provide medical coverage for their employees while minimizing the cost of insurance. Short-term medical, ancillary products, and Medicare supplement insurance help fill the increasing gaps associated with continued medical cost inflation and the shifting of costs from employers to employees. We compete with large group medical carriers in our stop-loss, fully insured group health insurance, short-term medical and Medicare supplement insurance offerings.\nGeographic markets\nWe primarily operate in the U.S. (all 50 states and D.C.) and Canada. The top geographic markets based on 2024 statutory direct premiums are reflected below.\n \n10      www.allstate.com\n2024 Form 10-K\n \nItem 1. Business\nOther Business Segments\nRun-off Property-Liability Segment\nThe Run-off Property-Liability segment includes results from property and casualty insurance coverage that primarily relates to policies written during the 1960s through the mid-1980s.\nStrategy  \nManagement of this segment has been assigned to a designated group of professionals with expertise in claims handling, policy coverage interpretation, exposure identification, litigation and reinsurance collection. We may pursue settlement agreements including policy buybacks on direct excess commercial business when appropriate to improve the certainty of the liabilities. Settlement agreements are negotiated contracts between Allstate and third parties that generally set forth the rights and obligations of the parties, including terms of payment for claims. At the end of 2024, 65% of the gross case reserves, excluding incurred but not reported, on the run-off direct excess commercial business were attributable to settlement agreements. This group also manages other direct commercial and assumed reinsurance business in run-off and engages in reinsurance ceded and assumed commutations as required or when considered economically advantageous.\nChanges in the reserves established for asbestos, environmental and other run-off lines losses have occurred and may continue. Reserve changes can be caused by new information relating to new and additional claims, new exposures or the impact of resolving unsettled claims based on unanticipated events such as arbitrations, litigation, legislative, judicial or regulatory actions. Environmental losses may also increase as the result of additional funding for environmental site clean-up.\nChallenges related to the concentration of insurance and reinsurance claims from companies who specialize in this business continue to be addressed. \nCorporate and Other Segment\nOur Corporate and Other segment is comprised of net investment income, net gains (losses) on investments, other revenue, debt service, holding company activities and certain non-insurance operations, including expenses associated with strategic initiatives.\nThe Allstate Corporation      11\n2024 Form 10-K\n \nItem 1. Business\nRegulation\nAllstate is subject to extensive regulation, primarily at the U.S. state level. The method, extent and substance of such regulation vary by state but generally have their source in statutes that establish standards and requirements for conducting the business of insurance and that also delegate regulatory authority to a state agency. These rules have a substantial effect on our business and relate to a wide variety of matters, including insurer solvency and statutory surplus sufficiency, reserve adequacy, insurance company licensing and examination, agent and adjuster licensing, agent and broker compensation, policy forms, rate setting, the nature and amount of investments, claims practices, participation in shared markets and guaranty funds, transactions with affiliates, the payment of dividends, underwriting standards, statutory accounting methods, trade practices, privacy regulation and data security, corporate governance and risk management. In addition, state legislators and insurance regulators continue to examine the appropriate nature and scope of state insurance regulation. For a discussion of statutory financial information, see Note 18 of the consolidated financial statements. Allstate is also subject to regulation at the U.S. Federal level and by governments, regulators, and agencies in jurisdictions outside of the U.S. in which we conduct business.\n For a discussion of regulatory contingencies, see Note 16 of the consolidated financial statements. Note 16 and Note 18 are incorporated in this Part I, Item 1 by reference.\nThe Dodd-Frank Wall Street Reform and Consumer Protection Act created the Federal Insurance Office (“FIO”) within the U.S. Department of the Treasury (“U.S. Treasury”). The FIO monitors the insurance industry, provides advice to the Financial Stability Oversight Council (“FSOC”), represents the U.S. on international insurance matters, and studies the current regulatory system.\nAdditional regulations or new requirements may emerge from the activities of various regulatory entities, including the Federal Reserve Board, FIO, FSOC, the National Association of Insurance Commissioners (“NAIC”), and the International Association of Insurance Supervisors, that are evaluating solvency and capital standards for insurance company groups. Most states have adopted substantially similar versions of the NAIC Insurance Holding Company System Model Act and the Insurance Holding Company System Model Regulation. Other states, including New York and Massachusetts, have adopted modified versions of the model act, although the supporting regulation is substantially similar to the model regulation. \nWe cannot predict whether any specific state or federal measures will be adopted to change the nature or scope of the regulation of insurance or what effect any such measures would have on Allstate. We are working for changes in the regulatory environment to make insurance more available and affordable for \ncustomers, encourage market innovation, improve driving safety, strengthen cybersecurity and promote better catastrophe preparedness and loss mitigation. \nLimitations on dividends by insurance subsidiaries\n  As a holding company with most business operations conducted by subsidiaries, The Allstate Corporation relies on dividends from Allstate Insurance Company as one of the principal sources of cash to pay dividends and to meet its obligations, including the payment of principal and interest on debt or to fund non-insurance-related businesses. Allstate Insurance Company is regulated as an insurance company in Illinois, and its ability to pay dividends is restricted by Illinois law. The laws of the other jurisdictions that generally govern our other insurance subsidiaries contain similar limitations on the payment of dividends. However, such laws in some jurisdictions may be more restrictive.\n For additional information regarding limitations, see Part II, Item 7 - Management’s Discussion and Analysis of Financial Condition and Results of Operations of this report.\nIn addition, the NAIC adopted a group capital calculation covering all entities of the insurance company group for use in solvency monitoring activities by regulators. Any increase in the amount of capital or reserves our insurance subsidiaries are required to hold could reduce the amount of future dividends such subsidiaries are able to distribute to the holding company. Any reduction in the risk-based capital ratios of our insurance subsidiaries could also adversely affect their financial strength ratings as determined by statistical rating agencies. We have not experienced, and we do not expect to experience, any impact from the group capital calculation on our current dividend plans.\nInsurance holding company regulation – change of control \n The Allstate Corporation is a holding company and its insurance subsidiaries are subject to regulation in the jurisdictions in which they write business. In the U.S., these subsidiaries are organized under the insurance codes of Alabama, California, Florida, Illinois, Indiana, Massachusetts, Michigan, Mississippi, Missouri, New Jersey, New York, North Carolina, Ohio, South Carolina and Texas. Additionally, some of these subsidiaries are considered commercially domiciled in California, Florida, and Texas.\nGenerally, the insurance codes in these states provide that the acquisition or change of “control” of a domestic or commercially domiciled insurer or of any person that controls such an insurer cannot be consummated without the prior approval of the relevant insurance regulator. In general, a presumption of “control” arises from the ownership, control, possession with the power to vote, or possession of proxies with respect to ten percent or more of the voting securities of an insurer or of a person who controls an insurer. In addition, certain state insurance laws require pre-acquisition notification to state agencies of a change in control with respect to a non-\n12      www.allstate.com\n2024 Form 10-K\n \nItem 1. Business\ndomestic insurance company licensed to do business in that state. While such pre-acquisition notification statutes do not authorize the state agency to disapprove the change of control, such statutes do authorize certain remedies, including the issuance of a cease-and-desist order with respect to the non-domestic insurer if certain conditions exist, such as undue market concentration.\nThus, any transaction involving the acquisition of ten percent or more of The Allstate Corporation’s common stock would generally require prior approval by the state insurance departments in Alabama (where the threshold is five percent or more of The Allstate Corporation’s common stock), California, Florida, Illinois, Indiana, Massachusetts, Michigan, Mississippi, Missouri, New Jersey, New York, North Carolina, Ohio, South Carolina and Texas. Moreover, notification would be required in those other states that have adopted pre-acquisition notification provisions and where the insurance subsidiaries are admitted to transact business. Such approval requirements may deter, delay or prevent certain transactions affecting the ownership of The Allstate Corporation’s common stock.\nRate regulation  \nNearly all states and D.C (collectively, “locations”) have insurance laws requiring personal property and casualty insurers to file rating plans, policy or coverage forms, and other information with the location’s regulatory authority. In many cases, such rating plans, policy forms, or both must be approved prior to use.\nThe speed with which an insurer can change rates in response to competition or increasing costs depends on the location’s rating laws, which include the following categories:\n•\nPrior approval — Regulators must approve a rate before the insurer may use it (22 locations). Some of these permit insurers to make rate changes without prior approval within a limited range\n•\nFile-and-use — Insurers do not have to wait for the regulator’s approval to use a rate, but the rate must be filed with the regulatory authority prior to being used (19 locations)\n•\nUse-and-file — Requires an insurer to file rates within a certain period of time after the insurer begins using them (9 locations)\n•\nNo filing or approval — One location, with an immaterial amount of written premiums, does not require a filing to be submitted\n Under these rating laws, the regulator has the authority to disapprove a rate filing. \nAn insurer’s ability to adjust its rates in response to competition or to changing costs is dependent on an insurer’s ability to demonstrate to the regulator that its rates or proposed rating plan meets the requirements of the rating laws. In those locations that significantly restrict an insurer’s discretion in selecting the business that it wants to underwrite, an insurer can manage its risk of loss by charging a rate that reflects the cost and expense of providing the insurance. In those locations that significantly restrict an insurer’s ability to charge a rate that reflects the cost and expense of providing the insurance, the insurer may be able to manage its risk of loss by being more selective in the type of business it underwrites. When a location significantly restricts both underwriting and pricing, it becomes more difficult for an insurer to maintain its targeted level of profitability.\nFrom time to time, the personal lines insurance industry comes under pressure from state regulators, legislators, and special-interest groups to reduce, freeze, or set rates at levels that do not correspond with our analysis of underlying costs, catastrophe loss exposure, and expenses. We expect this kind of pressure to persist. Allstate and other insurers are using increasingly sophisticated pricing models and rating plans that are reviewed by regulators and special-interest groups. Regulators may limit the ability of insurers to include variables in their rating plans even though they are indicative of risk. Regulators may interpret existing law or rely on future legislation or regulations to impose new restrictions that adversely affect profitability or growth. We cannot predict the impact on our business of possible future legislative and regulatory measures regarding insurance rates.\nWe are also subject to limitations for cancellations and non-renewals for certain periods of time due to catastrophe events. In January 2025, the California Insurance Commissioner issued a mandatory one-year moratorium on non-renewing or canceling residential insurance coverage in specific zip codes affected by the wildfires. \nInvoluntary markets\n \n As a condition of maintaining our licenses to write personal property and casualty insurance in various states, we are required to participate in assigned risk plans, reinsurance facilities, and joint underwriting associations that provide various types of insurance coverage to individuals or entities that otherwise are unable to purchase such coverage from private insurers, including the California FAIR Plan Association.\n For a discussion of these items see Note 16 of the consolidated financial statements. Note 16 is incorporated in this Part I, Item 1 by reference. \nIndemnification programs\n  We are a participant in state-based industry pools, facilities or associations, mandating participation by insurers offering certain coverage in their state, including the Michigan Catastrophic Claims Association (“MCCA”), the New Jersey Property-Liability Insurance Guaranty Association, the North Carolina Reinsurance Facility and the Florida Hurricane Catastrophe Fund. We also \nThe Allstate Corporation      13\n2024 Form 10-K\n \nItem 1. Business\nparticipate in the Federal Government National Flood Insurance Program.\n For a discussion of these items see Note 12 of the consolidated financial statements. Note 12 is incorporated in this Part I, Item 1 by reference.\nGuaranty funds\n  Under state insurance guaranty fund laws, insurers doing business in a state can be assessed, up to prescribed limits, in order to cover certain obligations of insolvent insurance companies. We do not anticipate any material adverse financial impact on Allstate from these assessments.\nInvestment regulation\n  Our insurance subsidiaries are subject to state regulation that specifies the types of investments that can be made and concentration limits of invested assets. Failure to comply with these rules leads to the treatment of non-conforming investments as non-admitted assets for purposes of measuring statutory surplus. Further, in some instances, these rules require divestiture of non-conforming investments. The NAIC periodically reviews the statutory accounting and RBC requirements for investments and makes changes from time to time.\nExiting geographic markets; canceling and non-renewing policies\n  Most states regulate an insurer’s ability to exit a market. For example, states may limit, to varying degrees, an insurer’s ability to cancel and non-renew policies. Some states restrict or prohibit an insurer from withdrawing one or more types of insurance business from the state, except pursuant to a plan that is approved by the state insurance department. Regulations that limit cancellation and non-renewal and that subject withdrawal plans to prior approval requirements may restrict an insurer’s ability to exit unprofitable markets.\nBroker-dealer and investment advisers\n  The Allstate entities that operate as a broker-dealer and registered investment advisers are subject to regulation and supervision by the Securities and Exchange Commission (“SEC”), Financial Institution Regulatory Authority and/or, in some cases, state securities administrators. The SEC has proposed rules and amendments related to cybersecurity risk management and cybersecurity-related disclosure for broker-dealers, registered investment advisers, registered investment companies, and business development companies. The SEC has adopted a comprehensive set of rules and interpretations for broker-dealers and investment advisers, including Regulation Best Interest. In addition, individual states and their securities regulators have and may adopt their own enhanced conduct standards for broker-dealers that could impact products provided by Allstate agents and Allstate’s broker-dealer, their sales processes, sales volume, and producer compensation arrangements.\nInflation Reduction Act of 2022  \nThe Inflation Reduction Act of 2022, which contains several tax-related provisions, was signed into law in August 2022. The law established a 15% corporate alternative minimum tax (“CAMT”) for certain large corporations and an excise tax of 1% on stock repurchases by \npublicly traded U.S. corporations, both effective after December 31, 2022. The excise tax on common stock repurchases is classified as an additional cost of the stock acquired included in treasury stock in shareholders' equity. The Company has determined that it is considered an “applicable corporation” under the rules of CAMT.\n15% Global Minimum Tax\n  The Organization for Economic Cooperation and Development (“OECD”) secured agreement from nearly 140 countries to address how corporate profits are taxed for multinational enterprises (“MNEs”). OECD released Pillar Two model rules, a 15% minimum effective tax rate (also known as the Global Anti-Base Erosion, designed to ensure that large MNEs pay a minimum level of tax on the income arising in each jurisdiction where they operate and mandates sharing of certain company information with taxing authorities on a local and global basis.\nThe Company is within the scope of the OECD Pillar Two model rules, and certain jurisdictions where the Company operates have enacted their respective tax law to comply with the Pillar Two framework beginning on or after December 31, 2023. The Company does not expect the impact to be material to its results of operations. The Company continues to evaluate the impact as additional jurisdictions, including those in which we operate, adopt their own legislation throughout 2025 and beyond.\nClimate disclosures\n  In March 2024, the SEC adopted a final rule requiring registrants to disclose certain climate-related information in their registration statements and annual reports. On April 4, 2024, the SEC issued a voluntary stay of the final rule, awaiting the outcome of pending litigation. It is not yet clear whether or how the SEC’s stay will impact the compliance timeline for the rule. If implemented as adopted, the rule will require the disclosure of qualitative and quantitative information, with certain information, such as financial statement effects of severe weather events, included in the notes to the audited financial statements. Other disclosure requirements include material climate-related risks, processes to manage and govern those risks, disclosure of targets if the targets materially affect or are reasonably likely to materially affect the Company, and, if material, disclosure of certain greenhouse gas emissions. The Company is currently monitoring the status of the final rule. In February 2025, the SEC requested that the court not schedule the case for argument to provide time for the SEC to deliberate and determine next steps. \nIn October 2023, California enacted several climate disclosure bills. One of these is the Climate Corporate Data Accountability Act (Senate Bill 253), which requires disclosure and assurance over greenhouse gas emissions using a phased reporting approach. The law, as amended in September 2024, requires the California Air Resources Board to develop and adopt implementing regulations no later than July 1, 2025. Allstate has publicly reported its greenhouse gas inventory since 2010. We will continue evaluating the \n14      www.allstate.com\n2024 Form 10-K\n \nItem 1. Business\nanticipated impacts and scope of the new laws on our reporting and disclosures.\nPrivacy regulation and data security\n  Federal law and the laws of many states require companies, including financial institutions, to protect the security and confidentiality of consumer information and to notify consumers about their policies and practices relating to collection, use, disclosure, and protection of consumer information. Federal law and the laws of many states also regulate disclosures and disposal of consumer information. Congress, state legislatures, and regulatory authorities continue to consider additional privacy regulation.\nIn addition to laws and regulations specific to financial institutions, there are comprehensive privacy laws that apply across industries. For example, the California Consumer Privacy Act, as well as similar laws in Virginia, Connecticut, and many other states, impose significant compliance requirements for certain larger businesses in those states. Among other things, these privacy laws provide consumers with privacy rights such as the right to request access to or deletion of their personal information. The California Consumer Privacy Act also established a new privacy regulatory agency. In November 2023, the New York State Department of Financial Services amended its cybersecurity regulation, including both new and heightened requirements. Many states have now adopted some form of the NAIC  Insurance Data Security Model Law, establishing standards for data security, including the investigation of and notification to insurance commissioners of cybersecurity events. Additional states are also likely to adopt similarly themed cybersecurity requirements in the future. We cannot predict the impact on our business of possible future legislative or regulatory measures regarding privacy or cybersecurity. \nAsbestos\n  Congress has repeatedly considered legislation to address asbestos claims and litigation in the past. We cannot predict the impact on our business of possible future legislative measures regarding asbestos.\nEnvironmental\n  Environmental pollution and clean-up of polluted waste sites is the subject of federal and state regulation. The Comprehensive Environmental Response Compensation and Liability Act of 1980 and comparable state statutes (collectively, the “Environmental Clean-up Laws” or “ECLs”) govern the clean-up and restoration of waste sites by Potentially Responsible Parties (“PRPs”). The ECLs establish a mechanism to assign liability to PRPs or to fund the clean-up of waste sites if PRPs fail to do so. The extent of liability to be allocated to a PRP depends on a variety of factors. The insurance industry is involved in extensive litigation regarding coverage issues arising out of the clean-up of waste sites by insured PRPs and the insured parties’ alleged liability to third parties responsible for the clean-up.\nAllstate’s exposure to liability with regard to its insureds that have been, or may be, named as PRPs is uncertain. \nDevelopments in the insurance and reinsurance industries have fostered a movement to segregate asbestos, environmental and other run-off lines exposures into separate legal entities with dedicated capital. Regulatory bodies in certain cases have supported these actions. We are unable to determine the impact, if any, that these developments will have on the collectability of reinsurance recoverables in the future.\nThe Allstate Corporation      15\n2024 Form 10-K\n \nItem 1. Business\nHuman Capital\nAllstate’s success is highly dependent on human capital and a strong organizational culture.\n \nAllstate defines organizational culture as a self-sustaining system of shared values, priorities and principles that shape beliefs and drive behaviors and decision-making within an organization.\n Allstate encourages employees to proactively manage their career so it is integrated into their personal purpose. This includes investing in and holding management accountable for employee development and maintaining a culture aligned with Our Shared Purpose at all levels. Our culture supports Allstate as we transform to become the lowest cost protection provider with an affordable, simple, connected experience. \nWe invest in talent development and employee engagement, health, safety and well-being because this contributes to Allstate’s success. In 2024, Allstate was recognized for the 10\nth\n year as one of the World's Most Ethical Companies. As of December 31, 2024, Allstate had approximately 55,000 full-time employees and 400 part-time employees.\nAllstate’s human capital management focuses on the following priorities:\nTalent development and employee engagement\n  We seek to provide employees with rewarding work, professional growth, holistic support programs and educational opportunities. Our flexible work policies support talent attraction and retention.\n•\nIn 2024, Allstate:\n–\nSustained a voluntary turnover rate of 13%.\n–\nMaintained employee engagement scores that surpassed industry benchmarks, with 84% of employees expressing a favorable view of engagement. \n–\nIncreased its global workforce surveys on the employee experience, which assess employee sentiment around topics like their sense of connection, feelings of wellbeing, workload management and overall job satisfaction.\n–\nLaunched an early career enrichment experience, designed to upskill early career employees. The program provides tools, resources, and an environment to support the development of early career talent during their first year in role.\n–\nProvided financial assistance to more than 2,000 Allstate U.S. employees to enroll in a formal degree, certificate, or boot camp program.\n–\nFilled over 35% of open U.S. positions with internal applicants.\nEmployee well-being and safety\n  We believe in a culture of well-being and take our responsibility to care for employees’ well-being seriously, devoting resources to employee health and safety.\n•\nAllstate created a workplace well-being strategy based on employee feedback, including providing greater flexibility in how, when and where work is done.\n•\nWell-being assessments are offered to understand employee needs and wants to support their well-being. Completing the assessment lowers the cost of benefits to employees and allows Allstate to provide holistic programs based on personalized interests.\n•\nWe focus on supporting Allstaters outside of work, as all full-time and part-time Allstate employees are eligible for paid leave to care for family members from the day they join Allstate.\n•\nIn 2024, we spent $58 million for in-person and virtual events, travel budgets, and other engagement and team-building activities that bring Allstaters together to strengthen connection and belonging among teams that may not work in the same location. \n•\nWe provide avenues for Allstaters to recognize and support each other, including a global peer-to-peer recognition program available in the U.S., Mexico, Canada, India and Northern Ireland. In 2024, employees recognized each other over one million times. Recognized employees earn points that can be redeemed for merchandise, gift cards or donations to charities.\n•\nWe create an environment where employees feel confident and supported to raise concerns through Allstate's \"Speak Up\" process.\n•\nOur Wellbeing Champion community connects their teams and leaders with Allstate’s health and wellness resources and promotes opportunities to engage in programs and coaching, including courses facilitated by internal performance coaches on well-being themes and virtual yoga and meditation classes offered four times a week.\nOrganizational culture\n  We strive for a workforce where our varied backgrounds and experiences make us a better company. We work to attract, nurture and retain a skilled workforce. Talent acquisition, development, retention and mobility practices support all employees in achieving their career aspirations.\nAs part of our commitment to fair compensation practices, we complete pay equity analyses. Annually, we seek to identify potential pay gaps as well as identify policies or practices that may contribute to pay gaps. The external analyses found that Allstate’s results compared well to benchmarks for companies of similar size and scope.\n16      www.allstate.com\n2024 Form 10-K\n \nItem 1. Business\nAllstate supports and funds voluntary, employee-led Employee Impact Groups (“EIGs”) and Business Impact Groups (“BIGs”) that are open to all employees. EIGs and BIGs make our company stronger by enhancing employee connection, belonging and engagement, resulting in better business results and service for our customers. EIGs help foster a sense of belonging by focusing on development, engagement and collaboration. BIGs focus on creating opportunities for employees to solve business problems and serve as an incubator for innovation, collaboration and professional development. Analysis from 2024 shows that EIG members at Allstate have a 28% lower turnover than non-members. In 2024, 14% of our Allstate U.S. workforce participated in at least one EIG. Officers from across the enterprise leverage their time, networks and resources to support the EIGs and BIGs, and positively impact employee engagement and retention at Allstate.\nOur early career programs, including apprenticeship, internship and development programs, are designed to build skills through on-the-job experiences, formal learning and peer learning. These programs attract a variety of backgrounds and experiences.\nAllstate continues to make significant progress on Allstate’s talent strategy, including a focus on skills-based hiring by eliminating degree requirements for jobs where having a degree was not required. Allstate also focuses on prioritizing internal hiring and developing, strengthening and retaining existing talent.\n In addition to the above discussion of our employees, please see information about Allstate agents under the captions “Allstate Protection Segment - Products and Distribution” and “Compensation Structure” in Part I, Item 1 of this report.\nThe Allstate Corporation      17\n2024 Form 10-K\n \nItem 1. Business\nWebsite\nOur website is allstate.com. The Allstate Corporation’s annual reports on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K and any amendments to such reports that we file or furnish pursuant to Section 13(a) of the Securities Exchange Act of 1934 are available on the Investor Relations section of our website (www.allstateinvestors.com), free of charge, as soon as reasonably practicable after they are electronically filed or furnished to the SEC and available at www.sec.gov. In addition, our Corporate Governance Guidelines, our Global Code of Business Conduct, and the charters of our Audit Committee, Compensation and Human Capital Committee, Executive Committee, Nominating, Governance and Social Responsibility Committee and Risk and Return Committee are available on the Investor Relations section of our website. The information found on our website is not incorporated by reference into this Annual Report on Form 10-K or in any other report or document filed with the SEC.\nOther Information About Allstate\n•\nAllstate’s five reportable segments use shared services, including human resources, investment, finance, information technology and legal services, provided by Allstate Insurance Company and other affiliates.\n•\nAlthough the insurance business generally is not seasonal, claims and claims expense for the Allstate Protection segment tend to be higher for periods of severe or inclement weather.\n•\n“Allstate\n®\n” is a very well-recognized brand name in the United States. We use the “Allstate\n®”\n, “National General\n®\n” and “Answer Financial\n®\n” brands extensively in our business. We also provide additional protection products and services through “Allstate\n®\n Protection Plans”, “Allstate\n®\n Dealer Services”, “Allstate\n®\n Roadside\n”, \n“Arity\n®\n”, “Allstate\n®\n Identity Protection” “Allstate\n®\n \nBenefits” and “Allstate\n®\n Health Solutions”, among others. These brands, products and services are supported with the related service marks, logos, and slogans. Our rights in the United States to these names, service marks, logos and slogans continue as long as we continue to use them in commerce. Many service marks used by Allstate are the subject of renewable U.S. and/or foreign service mark registrations. We believe that these service marks are important to our business and we intend to maintain our rights to them.\n18      www.allstate.com\n2024 Form 10-K\n \nItem 1. Business\nInformation about our Executive Officers\nThe following table sets forth the names of our executive officers as of February 1, 2025, their ages, positions and business experience. “AIC” refers to Allstate Insurance Company. Each of the officers named below may be removed from office at any time, with or without cause, by the board of directors of the relevant company.\nName\nAge\nPosition with Allstate and Business Experience\nThomas J. Wilson\n67\nChairman of the Board (May 2008 to present), President (June 2005 to January 2015 and February 2018 to present), and Chief Executive Officer (January 2007 to present) of The Allstate Corporation and AIC.\nElizabeth A. Brady\n60\nExecutive Vice President, Chief Marketing, Customer and Communications Officer of AIC (January 2020 to present).\nChristine M. DeBiase\n56\nExecutive Vice President, Chief Legal Officer and General Counsel of The Allstate Corporation and AIC (May 2024 to present); Executive Vice President, Chief Legal Officer, General Counsel and Corporate Secretary of The Allstate Corporation and AIC (January 2023 to May 2024); Executive Vice President, Chief Administrative Officer and General Counsel of Brighthouse Financial (February 2018 to December 2022).\nJohn E. Dugenske\n58\nPresident, Investments and Corporate Strategy of AIC (September 2022 to present); President, Investments and Financial Products of AIC (January 2020 to September 2022).\nEric K. Ferren\n51\nSenior Vice President, Controller and Chief Accounting Officer of The Allstate Corporation and AIC (May 2024 to present); Chief Financial Officer of Revantage (April 2024 to May 2024); Senior Vice President, Controller, and Chief Accounting Officer of The Allstate Corporation (May 2017 to September 2019) and Senior Vice President of AIC (May 2014 to April 2024).\nSuren Gupta\n63\nExecutive Vice President, President, Protection Products & Enterprise Services of AIC (August 2023 to present); President, Enterprise Services (October 2022 to August 2023); Executive Vice President, Chief Information Technology and Enterprise Services Officer of AIC (January 2020 to October 2022).\nZulfikar Jeevanjee\n60\nExecutive Vice President and Chief Information Officer of AIC (October 2022 to present); Senior Vice President, Chief Technology Officer, CVS Health (February 2021 to September 2022); Senior Vice President, Chief Enterprise Architect of AIC (November 2018 to February 2021).\nJesse E. Merten\n50\nExecutive Vice President and Chief Financial Officer of The Allstate Corporation and AIC (September 2022 to present); President, Financial Products of AIC (May 2020 to September 2022); Executive Vice President and Chief Risk Officer of AIC (December 2017 to May 2020).\nMark Q. Prindiville\n57\nExecutive Vice President and Chief Risk Officer of AIC (May 2020 to present); Senior Vice President of AIC (September 2016 to May 2020).\nMario Rizzo\n58\nPresident, Property-Liability of AIC (September 2022 to present); Executive Vice President and Chief Financial Officer of The Allstate Corporation and AIC (January 2018 to September 2022).\nThe Allstate Corporation      19\n2024 Form 10-K\n \nItem 1. Business\nForward-Looking Statements\nThis report contains “forward-looking statements” that anticipate results based on our estimates, assumptions and plans that are subject to uncertainty. These statements are made subject to the safe-harbor provisions of the Private Securities Litigation Reform Act of 1995. Forward-looking statements do not relate strictly to historical or current facts and may be identified by their use of words like “plans,” “seeks,” “expects,” “will,” “should,” “anticipates,” “estimates,” “intends,” “believes,” “likely,” “targets” and other words with similar meanings. These statements may address, among other things, our strategy for growth, catastrophe exposure management, product development, investment results, regulatory approvals, market position, expenses, financial results, litigation and reserves. We believe that these statements are based on reasonable estimates, assumptions and plans. Forward-looking statements speak only as of the date on which they are made, and we assume no obligation to update any forward-looking statements as a result of new information or future events or developments. In addition, forward-looking statements are subject to certain risks or uncertainties that could cause actual results to differ materially from those communicated in these forward-looking statements. These risks and uncertainties include, but are not limited to, those described in Part 1, “Item 1A. Risk Factors” and elsewhere in this report and those described from time to time in our other reports filed with the Securities and Exchange Commission.\n20      www.allstate.com\n2024 Form 10-K\n \nPart I - Item 1A. Risk Factors and Other Disclosures",
  "item7": "Item 7.  Management’s Discussion and Analysis of Financial Condition and Results of Operations\nPage\n2024\n Highlights\n35\nProperty-Liability \nOperations\n39\nAllstate Protection \n41\nRun-off Property-Liability\n48\nProtection Services\n51\nReserve for Property and Casualty Insurance Claims and Claims Expense\n53\nAllstate Health and Benefits\n60\nInvestments\n62\nMarket Risk\n71\nCapital Resources and Liquidity\n73\nEnterprise Risk and Return Management\n78\nApplication of Critical Accounting Estimates\n81\nRegulation and Legal Proceedings\n91\nPending Accounting Standards\n91\n34      www.allstate.com\n2024 Form 10-K\n2024 Highlights\nOverview\nThe following discussion highlights significant factors influencing the consolidated financial position and results of operations of The Allstate Corporation (referred to in this document as “we,” “our,” “us,” the “Company” or “Allstate”). It should be read in conjunction with the consolidated financial statements and related notes found under Item 8. contained herein.\nA discussion of strategy, including updates to the multi-year Transformative Growth initiative, can be found in Part 1, Item 1. Business.\nThis section of this Form 10-K generally discusses 2024 and 2023 results and year-to-year comparisons between 2024 and 2023. Discussions of 2022 results and year-to-year comparisons between 2023 and 2022 that are not included in this Form 10-K can be found in Management’s Discussion and Analysis (“MD&A”) in Part II, Item 7 of our annual report on Form 10-K for 2023, filed February 21, 2024. \nThe most important factors we monitor to evaluate the financial condition and performance for the Company include:\n•\nAllstate Protection\n: premium, policies in force (“PIF”), new business sales, price changes, claim frequency and severity, catastrophes, loss ratio, expenses, underwriting results and combined ratio\n•\nProtection Services\n: revenues, premium written, PIF and adjusted net income\n•\nAllstate Health and Benefits\n: premiums, other revenue, new business sales, PIF, benefit ratio, expenses and adjusted net income\n•\nInvestments\n: exposure to market risk, asset allocation, credit quality, total return, net investment income, cash flows, net gains and losses on investments and derivatives, unrealized capital gains and losses, long-term returns and fixed income portfolio duration\n•\nFinancial condition\n: liquidity, parent holding company deployable assets, financial strength ratings, operating leverage, debt levels, book value per share and return on equity\nMeasuring segment profit or loss\nThe measure of segment profit or loss used in evaluating performance is underwriting income for the Allstate Protection and Run-off Property-Liability segments and adjusted net income for the Protection Services, Allstate Health and Benefits, and Corporate and Other segments. \nUnderwriting income (loss)\n is calculated as premiums earned and other revenue, less claims and claims expense (“losses”), amortization of deferred policy acquisition costs (“DAC”), operating costs and expenses, amortization or impairment of purchased intangibles, and restructuring and related charges, as determined using accounting principles generally accepted in the United States of America (“GAAP”). We \nuse this measure in our evaluation of results of operations to analyze profitability. \nAdjusted net income (loss)\n is net income (loss) applicable to common shareholders, excluding:\n•\nNet gains and losses on investments and derivatives\n•\nPension and other postretirement remeasurement gains and losses\n•\nAmortization or impairment of purchased intangibles\n•\nGain or loss on disposition\n•\nAdjustments for other significant non-recurring, infrequent or unusual items, when (a) the nature of the charge or gain is such that it is reasonably unlikely to recur within two years, or (b) there has been no similar charge or gain within the prior two years\n•\nIncome tax expense or benefit on reconciling items\nMacroeconomic impacts\nMacroeconomic factors have and may continue to impact the results of our operations, financial condition and liquidity, such as U.S. government fiscal and monetary policies, conflict in the Middle East, the Russia/Ukraine conflict, supply chain disruptions, labor shortages and potential trade policy actions, such as tariffs and quotas. These factors should be considered when comparing the current period to prior periods. Macroeconomic impacts are disclosed in Part 1 “Item 1A. Risk Factors’’, including the risk factors titled “\nA large-scale pandemic, the occurrence of terrorism, military actions, political and social unrest or other disruptive or destabilizing events may have an adverse effect on our business\n” and “\nConditions in the global economy and capital markets could adversely affect the business and results of operations\n”. This is not inclusive of all potential impacts and should not be treated as such. Within the MD&A, we have included further disclosures related to macroeconomic impacts on our 2024 results.\nDispositions \nOn August 13, 2024, we entered into a share purchase agreement with StanCorp Financial Group, Inc. to sell American Heritage Life Insurance Company and American Heritage Service Company, comprising our employer voluntary benefits business for approximately $2.0 billion in cash. The employer voluntary benefits business is reported in the Allstate Health and Benefits segment, and beginning in the third quarter of 2024, the assets and liabilities of the business were classified as held for sale. The transaction is expected to close in the first half of 2025, subject to regulatory approvals and other customary closing conditions. \nOn January 30, 2025, Allstate entered into an agreement with Nationwide Life Insurance Company to sell Direct General Life Insurance Company, NSM Sales Corporation and The Association Benefits Solution, LLC, comprising the group health business for approximately $1.25 billion in cash, adjusted for the closing balance sheet. The group health business is reported in the Allstate Health and Benefits segment, and beginning in the first quarter of 2025, the assets \nThe Allstate Corporation      35\n2024 Form 10-K\nand liabilities of the business will be classified as held for sale. The transaction is expected to close during 2025, subject to regulatory approvals and other customary closing conditions. The individual health business will either be retained or divested.\nThe transaction prices less costs to sell exceeds the carrying value of the net assets of both transactions, resulting in an expected gain that will be recognized at closing of each transaction. The ultimate amount of the anticipated gain on the sales will be impacted by purchase price adjustments associated with certain pre-close transactions, changes in the carrying value of net assets, changes in accumulated other comprehensive income and the related tax effects. \nSee Note 4 of the consolidated financial statements for further information on the employer voluntary benefits disposition.\n2024 Operating priorities and results\nAllstate continued to focus on its operating priorities while successfully executing a comprehensive plan to improve auto insurance profitability and making substantial progress in advancing Transformative Growth. The table below summarizes the results of our 2024 Operating Priorities.\n2024 Operating priorities\n \n(1)\nGrow Customer Base\nAchieve 2024 Plan Growth Objectives\nConsolidated policies in force reached 208 million, a 7.2% increase from prior year. Allstate Protection policies in force decreased by 0.6% compared to the prior year, as continued growth in the homeowners insurance business was more than offset by declines in the auto insurance business.\nProtection Services policies in force and revenue increased 9.3% and 16.7%, respectively, primarily due to growth at Allstate Protection Plans through expanding distribution relationships and protection offerings.\nAchieve Target Economic Returns on Capital\nAchieve 2024 Plan Returns\nReturn on average Allstate common shareholders’ equity was 25.8% in 2024.\nTotal return on the $72.61 billion investment portfolio was 3.8% in 2024. Proactive portfolio management repositioned the fixed income portfolio into longer duration and higher-yielding assets to increase income.\nThe Property-Liability combined ratio of 94.3 for the full year decreased compared to the prior year primarily reflecting successful execution of the Company’s comprehensive auto insurance profitability plan and lower catastrophe losses.\nExecute Transformative Growth\nImprove Customer Value\nEnterprise Net Promoter Score, which measures how likely customers are to recommend Allstate, finished below the prior year, reflecting the impact of substantial price increases necessary to offset higher loss costs.\nImproved over 25 million customer interactions.\nExpand Customer Access\nIncreased auto insurance new issued applications in all channels.\nNational General continues to build a strong competitive position in independent agent distribution with successful expansion on non-standard auto sales and roll-out of our auto and home Custom360 product now available in 30 states.\nIncrease Sophistication and Investment in Customer Acquisition\nIncreased advertising and reduced underwriting restrictions as higher average premium outpaced increased loss costs per policy.\nDeploy New Technology Ecosystems\nContinued roll-out of Affordable, Simple and Connected auto insurance offering now available in 31 states for auto, 28 states for renters and Affordable, Simple and Connected homeowners insurance offering now available in 4 states.\nContinued to build a digital enterprise by expanding utilization of machine-based learning and artificial intelligence.\nDrive Organizational Transformation\nStreamlined the organization by reducing bureaucracy, risk aversion and organizational silos.\n(1)\n2025 operating priorities will remain mostly consistent with the 2024\n \npriorities. \n36      www.allstate.com\n2024 Form 10-K\nConsolidated net income (loss) applicable to common shareholders\n($ in millions)\nConsolidated net income applicable to common shareholders\n was $4.55 billion in 2024 compared to net loss of $316 million in 2023, primarily due to improved underwriting results from increased earned premium and improved loss trends.\nFor the twelve months ended December 31, 2024, return on average Allstate common shareholders’ equity was 25.8% compared to (2.0)% for the twelve months ended December 31, 2023.\nTotal revenue\n($ in millions)\nTotal revenue \nincreased 12.3% to $64.11 billion in 2024 compared to 2023, primarily due to premium rate increases and higher net investment income.\nNet investment income\n($ in millions)\nNet investment income\n increased $614 million to $3.09 billion in 2024 compared to 2023, primarily due to higher market-based investment results. Market-based results continue to benefit from portfolio repositioning into higher yielding fixed income securities and higher investment balances.\nFinancial highlights\nInvestments \ntotaled $72.61 billion as of December 31, 2024, increasing from $66.68 billion as of December 31, 2023.\nAllstate shareholders’ equity\n was $21.44 billion as of December 31, 2024 and $17.77 billion as of December 31, 2023. The increase is primarily due to net income, partially offset by dividends to shareholders.\nBook value per diluted common share\n (ratio of Allstate common shareholders’ equity to total common shares outstanding and dilutive potential common shares outstanding) was $72.35 as of December 31, 2024, an increase of 21.8% from $59.39 as of December 31, 2023.\nReturn on average Allstate common shareholders’ equity \n For the twelve months ended December 31, 2024, return on Allstate common shareholders’ equity was 25.8%, an increase of 27.8 points from (2.0)% for the twelve months ended December 31, 2023, primarily due to net income applicable to common shareholders.\nThe Allstate Corporation      37\n2024 Form 10-K\nSummarized financial results\nYears Ended December 31,\n($ in millions)\n2024\n2023\n2022\nRevenues\n \n \nProperty and casualty insurance premiums\n$\n56,388 \n$\n50,670 \n$\n45,904 \nAccident and health insurance premiums and contract charges\n1,921 \n1,846 \n1,832 \nOther revenue\n2,930 \n2,400 \n2,344 \nNet investment income \n3,092 \n2,478 \n2,403 \nNet gains (losses) on investments and derivatives \n(225)\n(300)\n(1,072)\nTotal revenues\n64,106\n \n57,094\n \n51,411\n \nCosts and expenses\n \n \nProperty and casualty insurance claims and claims expense\n(39,735)\n(41,070)\n(37,264)\nAccident, health and other policy benefits\n(1,241)\n(1,071)\n(1,042)\nAmortization of deferred policy acquisition costs\n(8,039)\n(7,278)\n(6,634)\nOperating, restructuring and interest expenses\n(9,087)\n(7,685)\n(7,832)\nPension and other postretirement remeasurement gains (losses)\n37 \n(9)\n(116)\nAmortization of purchased intangibles\n(280)\n(329)\n(353)\nTotal costs and expenses\n(58,345)\n(57,442)\n(53,241)\nIncome (loss) from operations before income tax expense\n5,761\n \n(348)\n(1,830)\nIncome tax (expense) benefit\n(1,162)\n135 \n488 \nNet income (loss)\n4,599\n \n(213)\n(1,342)\nLess: Net loss attributable to noncontrolling interest\n(68)\n(25)\n(53)\nNet income (loss) attributable to Allstate\n4,667\n \n(188)\n(1,289)\nPreferred stock dividends\n(117)\n(128)\n(105)\nNet income (loss) applicable to common shareholders\n$\n4,550\n \n$\n(316)\n$\n(1,394)\nSegment highlights\nAllstate Protection \nunderwriting income was $3.15 billion in 2024 compared to an underwriting loss of $2.09 billion in 2023, primarily due to increased premiums earned, favorable reserve reestimates and lower losses, partially offset by higher advertising costs.\nPremiums written increased 11.1% to $55.93 billion in 2024 compared to $50.35 billion in 2023, reflecting higher premiums in auto and homeowners insurance.\nProtection Services\n adjusted net income was $217 million in 2024 compared to $106 million in 2023. The increase in 2024 was due to premium growth at Allstate Protection Plans, improved claim severity at Allstate Roadside, higher lead sales revenue at Arity and both growth and lower costs at Allstate Identity Protection. Prior year adjusted net income was also negatively impacted by an increase in state income taxes for Allstate Dealer Services.\nPremiums and other revenues increased 15.7% or $401 million to $2.96 billion in 2024 from $2.56 billion in 2023 primarily due to Allstate Protection Plans.\nAllstate Health and Benefits\n adjusted net income was $186 million in 2024 compared to $242 million in 2023. The decrease was primarily due to increased benefit utilization across all lines of business.\nPremiums and contract charges totaled $1.92 billion in 2024, an increase of 4.1% from $1.85 billion in 2023, primarily due to growth in individual health and group health, partially offset by a decline in employer voluntary benefits.\nIncome taxes\nThe effective tax rate is the ratio of income tax expense (benefit) divided by income (loss) from operations before income tax expense. For the year ended December 31, 2024, we reported an effective tax rate of 20.2% based on total income tax expense of $1.16 billion on total income from operations before income tax expense of $5.76 billion. The effective rate in 2024 is lower than the federal statutory rate of 21%, primarily due to tax benefits derived from tax credits, tax-exempt interest income, and share-based payments, offset by state income tax expense.\nFor the year ended December 31, 2023, we reported an effective tax rate of 38.8% based on a total income tax benefit of $135 million on the loss from operations before income tax benefit of $348 million. The effective tax rate in 2023 was higher than the federal statutory rate of 21% due to the additional tax benefit derived from tax credits, tax-exempt interest income and shared-based payments, offset by a change in valuation allowance and uncertain tax positions.\nFor additional information, see Note 17 of the consolidated financial statements.\n38      www.allstate.com\n2024 Form 10-K  \nProperty-Liability\nProperty-Liability Operations\nOverview\n  Property-Liability operations consist of two reportable segments: Allstate Protection and Run-off Property-Liability. These segments are consistent with the groupings of financial information that management uses to evaluate performance and to determine the allocation of resources.\nWe do not allocate Property-Liability investment income, net gains and losses on investments and derivatives, or assets to the Allstate Protection and Run-off Property-Liability segments. Management reviews assets at the Property-Liability level for decision-making purposes.\nGAAP operating ratios\n are used to measure our profitability to enhance an investor’s understanding of our financial results and are calculated as follows:\n•\nLoss ratio:\n \nthe ratio of claims and claims expense (loss adjustment expenses), to premiums earned. Loss ratios include the impact of catastrophe losses and prior year reserve reestimates.\n•\nExpense ratio:\n the ratio of amortization of DAC, operating costs and expenses, amortization or impairment of purchased intangibles and restructuring and related charges, less other revenue to premiums earned.\n•\nCombined ratio:\n the sum of the loss ratio and the expense ratio.\nWe have also calculated the following impacts of specific items on the GAAP operating ratios because of the volatility of these items between periods. The impacts are calculated by taking the specific items noted below divided by Property-Liability premiums earned:\n•\nEffect of catastrophe losses on combined ratio:\n includes catastrophe losses and prior year reserve reestimates of catastrophe losses included in claims and claims expense\n•\nEffect of prior year reserve reestimates on combined ratio\n•\nEffect of amortization of purchased intangibles on combined ratio\n•\nEffect of restructuring and related charges on combined ratio\n•\nEffect of Run-off Property-Liability business on combined ratio:\n includes claims and claims expense, restructuring and related charges and operating costs and expenses in the Run-off Property-Liability segment\nPremium measures and statistics\n are used to analyze our premium trends and are calculated as follows:\n•\nPIF\n: policy counts are based on items rather than customers. A multi-car customer would generate multiple item (policy) counts, even if all cars were insured under one policy. Lender-placed policies are excluded from policy counts because relationships are with the lenders. \n•\nNew issued applications\n: item counts of automobile or homeowner insurance applications for insurance policies that were issued during the period, regardless of whether the customer was previously insured by another Allstate brand. \n•\nAverage premium-gross written (“average premium”)\n:\n gross premiums written divided by issued item count. Gross premiums written include the impacts from discounts, surcharges and ceded reinsurance premiums and exclude the impacts from mid-term premium adjustments and premium refund accruals. Average premiums represent the appropriate policy term for each line.\n•\nImplemented rate changes\n:\n \nrepresents the impact in the locations (U.S. states, the District of Columbia or Canadian provinces) where rate changes were implemented during the period as a percentage of total prior year-end premiums written.\nThe Allstate Corporation      39\n2024 Form 10-K\n \nProperty-Liability\nUnderwriting results\n($ in millions, except ratios)\n2024\n2023\n2022\nPremiums written\n$\n55,926 \n$\n50,347 \n$\n45,787 \nPremiums earned\n$\n53,866 \n$\n48,427 \n$\n43,909 \nOther revenue\n1,895 \n1,545 \n1,416 \nClaims and claims expense\n(39,118)\n(40,453)\n(36,732)\nAmortization of DAC\n(6,676)\n(6,070)\n(5,570)\nOther costs and expenses\n(6,630)\n(5,255)\n(5,650)\nRestructuring and related charges \n(1)\n(51)\n(143)\n(44)\nAmortization of purchased intangibles\n(206)\n(235)\n(240)\nUnderwriting income (loss)\n$\n3,080\n \n$\n(2,184)\n$\n(2,911)\nCatastrophe losses\nCatastrophe losses, excluding reserve reestimates\n$\n5,334 \n$\n5,660 \n$\n3,094 \nCatastrophe reserve reestimates\n (2)\n(370)\n(24)\n18 \nTotal catastrophe losses\n$\n4,964\n \n$\n5,636\n \n$\n3,112\n \nNon-catastrophe reserve reestimates \n(2)\n$\n62 \n$\n574 \n$\n1,726 \nPrior year reserve reestimates \n(2)\n(308)\n550 \n1,744 \nGAAP operating ratios\nLoss ratio\n72.6 \n83.5 \n83.6 \nExpense ratio\n \n(3)\n21.7 \n21.0 \n23.0 \nCombined ratio\n94.3 \n104.5 \n106.6 \nEffect of catastrophe losses on combined ratio \n9.2 \n11.6 \n7.1 \nEffect of prior year reserve reestimates on combined ratio\n \n(0.5)\n1.2 \n3.9 \nEffect of catastrophe losses included in prior year reserve reestimates on combined ratio\n(0.7)\n— \n— \nEffect of restructuring and related charges on combined ratio \n(1)\n0.2 \n0.3 \n0.1 \nEffect of amortization of purchased intangibles on combined ratio\n0.3 \n0.5 \n0.5 \nEffect of Run-off Property-Liability business on combined ratio\n0.2 \n0.2 \n0.3 \n(1)\nRestructuring and related charges in 2024 primarily relate to the organizational transformation component of the Transformative Growth plan. See Note 15 of the consolidated financial statements for additional details. \n(2)\nFavorable reserve reestimates are shown in parentheses.\n(3)\nOther revenue is deducted from operating costs and expenses in the expense ratio calculation.\n40      www.allstate.com\n2024 Form 10-K  \nAllstate Protection  \nAllstate Protection Segment\nPrivate passenger auto, homeowners, and other personal lines insurance products are offered to consumers through exclusive agents, independent agents and directly to the consumer through contact centers and online. Our strategy is to offer products that allow customers to interact with us when, where and how they want affordable, simple and connected protection products. For additional information on our strategy and outlook, see Part I, Item 1. Business - Strategy and Segment Information.\nUnderwriting results \nFor the years ended December 31,\n($ in millions)\n2024\n2023\n2022\nPremiums written\n$\n55,926 \n$\n50,347 \n$\n45,787 \nPremiums earned\n$\n53,866 \n$\n48,427 \n$\n43,909 \nOther revenue\n1,895 \n1,545 \n1,416 \nClaims and claims expense\n(39,050)\n(40,364)\n(36,607)\nAmortization of DAC\n(6,676)\n(6,070)\n(5,570)\nOther costs and expenses\n(6,625)\n(5,251)\n(5,646)\nRestructuring and related charges\n(51)\n(142)\n(44)\nAmortization of purchased intangibles\n(206)\n(235)\n(240)\nUnderwriting income (loss)\n$\n3,153\n \n$\n(2,090)\n$\n(2,782)\nCatastrophe losses\n$\n4,964 \n$\n5,636 \n$\n3,112 \nUnderwriting income\n was $3.15 billion in 2024 compared to underwriting loss of $2.09 billion in 2023, primarily due to increased premiums earned, favorable reserve reestimates and lower losses, partially offset by higher advertising costs.\nChange in underwriting results from 2023 to 2024\n($ in millions)\nChange in underwriting results from 2022 to 2023\n($ in millions)\nThe Allstate Corporation      41\n2024 Form 10-K\n \nAllstate Protection\nUnderwriting income (loss) by line of business\nFor the years ended December 31,\n($ in millions)\n2024\n2023\n2022\nAuto \n$\n1,810 \n$\n(1,109)\n$\n(3,014)\nHomeowners \n1,319 \n(803)\n671 \nOther personal lines\n (1)\n67 \n(39)\n(88)\nCommercial lines\n(240)\n(265)\n(464)\nOther business lines \n(2)\n185 \n115 \n105 \nAnswer Financial\n12 \n11 \n8 \nTotal\n$\n3,153\n \n$\n(2,090)\n$\n(2,782)\n(1)\nInclude renters, condominium, landlord and other personal lines products.\n(2)\nOther business lines represents commissions earned and other costs and expenses for Ivantage, non-proprietary life and annuity products, and lender-placed products.\nPremium measures and statistics\n include PIF, new issued applications and average premiums to analyze our premium trends. Premiums written is the amount of premiums charged for policies issued during a fiscal period. Premiums are considered earned and are included in the financial results on a pro-rata basis over the policy period. The portion of premiums written applicable to the unexpired term of the policies is recorded as unearned premiums on our Consolidated Statements of Financial Position.\nPremiums written by line of business\nFor the years ended December 31,\n($ in millions)\n2024\n2023\n2022\nAuto\n$\n37,296 \n$\n33,958 \n$\n30,666 \nHomeowners\n14,416 \n12,584 \n11,209 \nOther personal lines \n3,068 \n2,519 \n2,249 \nCommercial lines\n495 \n720 \n1,124 \nOther business lines \n651 \n566 \n539 \nTotal premiums written\n$\n55,926\n \n$\n50,347\n \n$\n45,787\n \nPremiums earned by line of business\nFor the years ended December 31,\n($ in millions)\n2024\n2023\n2022\nAuto\n$\n36,475 \n$\n32,940 \n$\n29,715 \nHomeowners\n13,360 \n11,739 \n10,418 \nOther personal lines\n2,823 \n2,387 \n2,159 \nCommercial lines\n609 \n811 \n1,123 \nOther business lines\n599 \n550 \n494 \nTotal premiums earned\n$\n53,866\n \n$\n48,427\n \n$\n43,909\n \nReconciliation of premiums written to premiums earned\nFor the years ended December 31,\n($ in millions)\n2024\n2023\n2022\nTotal premiums written\n$\n55,926\n \n$\n50,347\n \n$\n45,787\n \nIncrease in unearned premiums\n(1,966)\n(2,004)\n(1,776)\nOther\n(94)\n84 \n(102)\nTotal premiums earned\n$\n53,866\n \n$\n48,427\n \n$\n43,909\n \nUnearned premium balance by line of business\n($ in millions)\nAs of December 31,\n2024\n2023\nAuto\n$\n10,931 \n$\n10,116 \nHomeowners\n8,060 \n6,986 \nOther personal lines \n1,473 \n1,333 \nCommercial lines\n248 \n349 \nOther business lines\n355 \n317 \nTotal\n$\n21,067\n \n$\n19,101\n \n42      www.allstate.com\n2024 Form 10-K  \nAllstate Protection  \nPolicies in force by line of business\nPIF (thousands)\n2024\n2023\n2022\nAuto\n24,936 \n25,283 \n26,034 \nHomeowners\n7,511 \n7,338 \n7,260 \nOther personal lines\n4,870 \n4,863 \n4,936 \nCommercial lines\n213 \n284 \n311 \nTotal \n37,530\n \n37,768\n \n38,541\n \nAuto insurance premiums written\n increased 9.8% or $3.34 billion in 2024 compared to 2023, primarily due to the following factors:\n•\nIncreased average premiums driven by rate increases. In 2024, rate increases of 10.4% were implemented in 55 locations, resulting in total insurance premium impact of 7.5%\n•\nIn 2024, we have removed underwriting restrictions in areas that represent the majority of Allstate brand countrywide premiums, which is expected to increase premiums written and PIF. In locations not achieving acceptable returns, we expect to \ncontinue to pursue targeted rate increases. In states where we are not achieving acceptable returns, we plan to implement rates that keep pace with increasing costs. See Note 9 for additional details on actions taken related to Adirondack Insurance Exchange and New Jersey Skylands Insurance Association\n•\nPIF decreased 1.4% or 347 thousand to 24,936 thousand as of December 31, 2024 compared to December 31, 2023\n•\nIncreased new issued applications in all channels\nAuto premium measures and statistics\n2024\n2023\n2022\n2024 vs. 2023\nNew issued applications (thousands)\nAllstate Protection by channel\nExclusive agency\n2,579 \n2,294 \n2,401 \n12.4 \n%\nIndependent agency\n2,276 \n1,989 \n1,718 \n14.4 \nDirect\n2,247 \n1,632 \n2,202 \n37.7 \nTotal new issued applications\n7,102\n \n5,915\n \n6,321\n \n20.1\n \nAllstate brand average premium\n$\n843 \n$\n757 \n$\n659 \n11.4 \n%\nHomeowners insurance premiums written\n increased 14.6% or $1.83 billion in 2024 compared to 2023, primarily due to the following factors:\n•\nHigher Allstate brand average premiums from implemented rate increases, combined with policies in force growth\n•\nIn 2024 rate increases of 14.5% were implemented in 53 locations, resulting in total insurance premium impact of 11.0%\n•\nIncreased new issued applications in the exclusive agency and direct channels\nPolicy growth is being driven primarily by the Allstate brand and is geographically widespread. We \nare not writing new homeowners business in California and Florida and we did not write new homeowners business in New Jersey in 2024. We are also non-renewing certain policies in Florida. We may not be able to grow in certain states without regulatory or legislative reforms that enable customers to be provided coverage at appropriate risk adjusted returns.\nNational General policy growth may be negatively impacted as we improve underwriting margins to targeted levels through underwriting and rate actions. See Note 9 for additional details on actions taken related to Adirondack Insurance Exchange and New Jersey Skylands Insurance Association.\nHomeowners premium measures and statistics\n2024\n2023\n2022\n2024 vs. 2023\nNew issued applications (thousands) \nAllstate Protection by channel\nExclusive agency\n946 \n800 \n826 \n18.3 \n%\nIndependent agency\n226 \n232 \n202 \n(2.6)\nDirect\n133 \n79 \n94 \n68.4 \nTotal new issued applications \n1,305\n \n1,111\n \n1,122\n \n17.5\n \nAllstate brand average premium\n$\n2,021 \n$\n1,812 \n$\n1,614 \n11.5 \n%\nOther personal lines\n \npremiums written\n increased 21.8% or $549 million in 2024 compared to 2023, primarily due to involuntary auto policies purchased from other carriers by National General and Allstate brand landlords policies. We are not writing \ncondominium new business in California and Florida and we are non-renewing certain policies in Florida.\nCommercial lines\n \npremiums written\n decreased 31.3% or $225 million in 2024 compared to 2023, due to the strategic decision for the Allstate brand to stop \nThe Allstate Corporation      43\n2024 Form 10-K\n \nAllstate Protection\nwriting new business and non-renew certain policies. We are committed to offering comprehensive commercial products to customers through our exclusive agency, independent agency and direct channels, with solutions offered by the National General brand, NEXT Insurance and other brokered solutions.\nOther business lines premiums written \nincreased 15.0% or $85 million in 2024 compared to 2023 due to growth in the lender-placed business.\nGAAP operating ratios\n \ninclude loss ratio, expense ratio and combined ratio to analyze our profitability trends. Frequency and severity changes are used to describe the trends in loss costs.\nCombined ratios by line of business \nFor the years ended December 31,\nLoss ratio\nExpense ratio\n \n(2)\nCombined ratio\n2024\n2023\n2022\n2024\n2023\n2022\n2024\n2023\n2022\nAuto\n72.7 \n82.8 \n87.2 \n22.3 \n20.6 \n22.9 \n95.0 \n103.4 \n110.1 \nHomeowners\n68.1 \n85.4 \n71.1 \n22.0 \n21.4 \n22.5 \n90.1 \n106.8 \n93.6 \nOther personal lines\n (1)\n85.9 \n82.0 \n79.7 \n11.7 \n19.6 \n24.4 \n97.6 \n101.6 \n104.1 \nCommercial lines\n111.5 \n105.8 \n120.7 \n27.9 \n26.9 \n20.6 \n139.4 \n132.7 \n141.3 \nOther business lines\n55.8 \n48.4 \n39.5 \n13.3 \n(3)\n30.7 \n39.2 \n69.1 \n79.1 \n78.7 \nTotal\n72.4\n \n83.3\n \n83.3\n \n21.7\n \n21.0\n \n23.0\n \n94.1\n \n104.3\n \n106.3\n \nImpact of amortization of purchased intangibles\n0.3 \n0.5 \n0.5 \n0.3 \n0.5 \n0.5 \nImpact of restructuring and related charges \n0.2 \n0.3 \n0.1 \n0.2 \n0.3 \n0.1 \n(1)\nExpense ratio includes other revenue of $223 million, $57 million, and $19 million in 2024,\n \n2023 and 2022, respectively, for fees on involuntary auto policies.\n(2)\nOther revenue is deducted from operating costs and expenses in the expense ratio calculation. \n(3)\nIncludes anticipated return commissions on lender-placed business due to increased losses.\nLoss ratios by line of business \nFor the years ended December 31,\nLoss ratio\nEffect of catastrophe losses \nEffect of prior year reserve reestimates\nEffect of catastrophe losses included in \nprior year reserve reestimates \n2024\n2023\n2022\n2024\n2023\n2022\n2024\n2023\n2022\n2024\n2023\n2022\nAuto\n72.7 \n82.8 \n87.2 \n2.2 \n2.1 \n1.7 \n(1.0)\n0.7 \n4.0 \n(0.1)\n(0.2)\n(0.2)\nHomeowners\n68.1 \n85.4 \n71.1 \n27.8 \n38.6 \n21.6 \n(2.9)\n0.8 \n1.9 \n(2.4)\n0.3 \n0.7 \nOther personal lines\n85.9 \n82.0 \n79.7 \n12.8 \n14.6 \n12.3 \n7.7 \n0.8 \n(1.5)\n(0.2)\n(0.8)\n0.1 \nCommercial lines\n111.5 \n105.8 \n120.7 \n2.8 \n3.7 \n2.5 \n27.3 \n10.4 \n24.2 \n(0.8)\n1.0 \n(0.1)\nOther business lines\n55.8 \n48.4 \n39.5 \n11.9 \n7.5 \n9.1 \n— \n2.2 \n(1.2)\n— \n— \n0.8 \nTotal\n72.4\n \n83.3\n \n83.3\n \n9.2\n \n11.6\n \n7.1\n \n(0.7)\n1.0\n \n3.6\n \n(0.7)\n—\n \n—\n \nAuto underwriting results\nFor the periods ended\n2024\n2023\n2022\n($ in millions, except ratios)\nQ4\nQ3\nQ2\nQ1\nQ4\nQ3\nQ2\nQ1\nQ4\nQ3\nQ2\nQ1\nUnderwriting income (loss)\n$\n603 \n$\n486 \n$\n370 \n$\n351 \n$\n93 \n$\n(178)\n$\n(678)\n$\n(346)\n$\n(974)\n$\n(1,315)\n$\n(578)\n$\n(147)\nLoss ratio\n69.3 \n71.9 \n74.2 \n75.4 \n78.5 \n81.4 \n87.9 \n83.4 \n90.6 \n95.3 \n84.9 \n77.6 \nEffect of prior year non-catastrophe reserve reestimates\n(0.4)\n(0.6)\n(1.9)\n(0.7)\n1.7 \n0.3 \n1.4 \n(0.1)\n2.3 \n8.5 \n3.8 \n2.1 \nFrequency and severity are influenced by:\n•\nSupply chain disruptions and labor shortages\n•\nMix of repairable losses and total losses\n•\nValue of total losses due to changes in used car prices\n•\nChanges in medical inflation and consumption\n•\nNumber of claims with attorney representation\n•\nLabor and part cost increases\n•\nChanges in commuting activity\n•\nDriving behavior (e.g., speed, time of day) impacting severity and mix of claim types\n•\nOrganizational and process changes impacting claim opening and closing practices and shifts in timing, if any, can impact comparisons to prior periods \nThe quarterly auto loss ratio has been more variable due to these and additional factors discussed below.\n44      www.allstate.com\n2024 Form 10-K  \nAllstate Protection  \nAuto loss ratio\n decreased 10.1 points in 2024 compared to 2023 driven by increased earned premiums and lower non-catastrophe losses compared to the prior year. Estimated report year 2024 incurred claim severity for Allstate increased compared to report year 2023 for major coverages due to higher repair costs, a higher mix of total losses, an increase in claims with attorney representation, higher medical consumption, and inflation. Gross claim frequency decreased relative to the prior year. We continue to enhance our claims practices to manage loss costs by increasing resources and expanding re-inspections, accelerating resolution of bodily injury claims, and negotiating improved vendor services and parts agreements.\nHomeowners loss ratio\n decreased 17.3 points in 2024 compared to 2023, primarily due to increased premiums earned and lower losses.\nGross claim frequency decreased in 2024 compared to 2023 primarily due to fewer claims reported related to water and fire perils. Paid claim severity increased in 2024 compared to 2023 due to inflationary loss cost pressure driven by increases in labor and materials costs. Homeowner paid claim severity can be impacted by both the mix of perils and the magnitude of specific losses paid during the period.\nOther personal lines loss ratio\n \nincreased 3.9 points in 2024 compared to 2023, primarily due to higher losses and unfavorable reserve development, partially offset by increased premiums earned.\nCommercial lines loss ratio\n \nincreased 5.7 points in 2024 compared to 2023 primarily due to lower \npremiums earned driven by Allstate brand strategy changes and unfavorable reserve development related to the shared economy business, partially offset by lower non-catastrophe losses.\nOther business lines loss ratio\n increased 7.4 points in 2024 compared to 2023 primarily due to higher losses.\nCatastrophe losses \ndecreased 11.9% or $672 million in 2024 compared to 2023 primarily due to lower losses per event for wind and hail events, partially offset by higher losses from hurricanes. Favorable prior year reserve reestimates of $370 million in 2024 were primarily due to reserve reestimates in homeowners lines for 2023 events.\nWe define a “catastrophe” as an event that produces pre-tax losses before reinsurance in excess of $1 million and involves multiple first-party policyholders, or a winter weather event that produces a number of claims in excess of a preset, per-event threshold of average claims in a specific area, occurring within a certain amount of time following the event. Catastrophes are caused by various natural events including high winds, winter storms and freezes, tornadoes, hailstorms, wildfires, tropical storms, tsunamis, hurricanes, earthquakes and volcanoes. \nWe are also exposed to man-made catastrophic events, such as certain types of terrorism, civil unrest, wildfires or industrial accidents. The nature and level of catastrophes in any period cannot be reliably predicted.\nCatastrophe losses by the type of event\nFor the years ended December 31,\n($ in millions)\nNumber of events\n2024\nNumber of events\n2023\nNumber of events\n2022\nHurricanes/tropical storms\n5 \n$\n1,180 \n3 \n$\n66 \n2 \n$\n399 \nTornadoes\n2 \n85 \n4 \n189 \n4 \n192 \nWind/hail\n113 \n3,832 \n136 \n5,065 \n106 \n1,936 \nWildfires\n10 \n71 \n4 \n335 \n9 \n52 \nFreeze/other events\n2 \n166 \n2 \n5 \n3 \n515 \nPrior year reserve reestimates \n(1)\n(370)\n(24)\n18 \nTotal catastrophe losses\n132\n \n$\n4,964\n \n149\n \n$\n5,636\n \n124\n \n$\n3,112\n \n(1)\nIncludes reinsurance recoveries.\nCatastrophe management\nHistorical catastrophe experience \n For the last ten years, the average annual impact of catastrophes on our loss ratio was 8.6 points, but it has varied from 5.7 points to 11.6 points. The impact of catastrophes on the homeowners loss ratio in 2024 was 27.8 points compared to the average annual impact for the last ten years of 27.6 points. Over time, we have limited our aggregate insurance exposure to catastrophe losses in certain regions of the country that are subject to high levels of natural catastrophes by our participation in various state facilities. For further discussion of these facilities, see Note 16 of the consolidated financial statements. However, the impact of these actions may \nbe diminished by the growth in insured values, the effect of state insurance laws and regulations and we may not be able to maintain our current level of reinsurance or purchase new reinsurance protection in amounts we consider sufficient at acceptable prices. In addition, in various states we are required to participate in assigned risk plans, reinsurance facilities and joint underwriting associations that provide insurance coverage to individuals or entities that otherwise are unable to purchase such coverage from private insurers including the California FAIR Plan Association. Because of our participation in these and other state facilities such as wind pools, we may be \nThe Allstate Corporation      45\n2024 Form 10-K\n \nAllstate Protection\nexposed to losses that surpass the capitalization of these facilities and to assessments from these facilities.\nWe have continued to take actions to maintain an appropriate level of exposure to catastrophic events while continuing to meet the needs of our customers, including the following:\n•\nContinuing to limit or not offer new homeowners, manufactured home and landlord package policy business in certain coastal geographies. Additionally, we:\n–\nReduced our exposure to high-risk areas, including California and Florida. We have decreased our overall homeowner exposure in California by more than 50% since 2007. Additionally, from 2016 to 2022 we wrote a limited number of homeowners policies in select areas of California. In 2022 we stopped writing new homeowners and condominium business in the states of California and Florida. As a result, since December 31, 2023, PIF has declined by approximately 5.0% and 21% in California and Florida, respectively. \n–\nWrite homeowners coverage, excluding in Florida, through our excess and surplus lines carrier, North Light Specialty Insurance Company (“North Light”), which can include earthquake coverage (other than fire following earthquakes) that is currently ceded via quota share reinsurance. \n•\nIncreased capacity in our brokerage platform for customers not offered an Allstate policy. As of December 31, 2024, Ivantage had $2.57 billion non-proprietary premiums under management.\n•\nCeded wind exposure related to insured property located in wind pool eligible areas in certain states.\n•\nGenerally require higher deductibles for tropical cyclone than all peril deductibles which are in place for a large portion of coastal insured properties.\n•\nInclude coverage for flood-related losses for auto comprehensive damage coverage since we have additional catastrophe exposure, beyond the property lines, for auto customers who have purchased comprehensive damage coverage. \n•\nProvide options of coverage for roof damage, including graduated coverage and pricing based on roof type and age. In 2024, premiums written totaled $8.75 billion or 60.7% of homeowners premiums written.\nHurricanes \n We consider the greatest areas of potential catastrophe losses due to hurricanes to be major metropolitan centers along the eastern and gulf coasts of the United States. The average premium on a property policy near these coasts is generally greater than in other areas. However, average premiums are often not considered commensurate with the inherent risk of loss. In addition, as explained in Note 16 of the consolidated financial statements, in various states Allstate is subject to assessments from assigned risk plans, reinsurance facilities and joint underwriting \nassociations providing insurance for wind related property losses.\nWe have addressed our risk of hurricane loss by, among other actions, purchasing reinsurance for specific states and on a countrywide basis for our personal lines property insurance in areas most exposed to hurricanes, limiting personal homeowners, landlord package policy and manufactured home new business writings in coastal areas in southern and eastern states, implementing tropical cyclone deductibles where appropriate, and not offering continuing coverage on certain policies in coastal counties in certain states. We continue to seek appropriate returns for the risks we write. This may require further actions, similar to those already taken, in geographies where we are not getting appropriate returns. However, we may maintain or opportunistically increase our presence in areas where adequate risk adjusted returns can be achieved.\nEarthquakes\n  We do not offer earthquake coverage in most states. We retain approximately 23,000 PIF with earthquake coverage, with the largest number of policies located in Kentucky, due to regulatory and other reasons. We purchase reinsurance in Kentucky and enter into arrangements in many states to make earthquake coverage available through our brokerage platform. \nWe continue to have exposure to earthquake risk on certain policies that do not specifically exclude coverage for earthquake losses, including our auto policies, and to homeowners insurance fire losses following earthquakes. Allstate homeowner policyholders in California are offered coverage for damage caused by an earthquake through the California Earthquake Authority (“CEA”), a privately financed, publicly managed state agency created to provide insurance coverage for earthquake damage. Allstate is subject to assessments from the CEA under certain circumstances as explained in Note 16 of the consolidated financial statements. While North Light writes property policies in California, which can include earthquake coverage, this coverage is 100% ceded via quota share reinsurance. \nFires following earthquakes\n  Under a standard homeowners policy we cover fire losses, including those caused by an earthquake. Actions taken related to our risk of loss from fires following earthquakes include restrictive underwriting guidelines in California for new business writings, purchasing reinsurance for Kentucky personal lines property risks, and purchasing nationwide occurrence reinsurance, excluding Florida.\nWildfires\n \n Actions taken related to managing our risk of loss from wildfires include purchasing nationwide occurrence reinsurance, new and renewal inspection programs to identify and remediate wildfire risk as well as leveraging contemporary underwriting tools in select areas. While these programs are designed to mitigate risk, the exposure to wildfires still exists. We continue to manage our\n \nexposure and seek appropriate returns for the risks we write. In addition, as explained in Note 16 of the consolidated financial statements, Allstate is subject to assessments from \n46      www.allstate.com\n2024 Form 10-K  \nAllstate Protection  \nthe California FAIR Plan Association providing insurance for property losses. Refer to Note 1 for more information on the impact of the California wildfires.\nTo manage the exposure, we may implement further actions, similar to those already taken, in geographies where we are not achieving appropriate returns. However, we may maintain or opportunistically increase our presence in areas where adequate risk adjusted returns can be achieved.\nCatastrophe reinsurance \n The total cost of our property catastrophe reinsurance programs, excluding \nreinstatement premiums, during 2024 was $1.11 billion compared to $1.02 billion during 2023. Catastrophe placement premiums reduce net written and earned premium with approximately 80% of the reduction related to homeowners premium. A description of our current catastrophe reinsurance program appears in Note 12 of the consolidated financial statements.\nExpense ratio \nincreased 0.7 points in 2024 compared to 2023, primarily due to an increase in advertising costs, partially offset by higher earned premium growth relative to fixed costs.\nImpact of specific costs and expenses on the expense ratio\nFor the years ended December 31,\n($ in millions, except ratios)\n2024\n2023\n2022\n2024 vs 2023\n2023 vs 2022\nAmortization of DAC\n$\n6,676 \n$\n6,070 \n$\n5,570 \n$\n606 \n$\n500 \nAdvertising expense\n1,863 \n638 \n934 \n1,225 \n(296)\nOther costs and expenses, net of other revenue\n2,867 \n3,068 \n3,296 \n(201)\n(228)\nAmortization of purchased intangibles\n206 \n235 \n240 \n(29)\n(5)\nRestructuring and related charges\n51 \n142 \n44 \n(91)\n98 \nTotal underwriting expenses\n$\n11,663\n \n$\n10,153\n \n$\n10,084\n \n$\n1,510\n \n$\n69\n \nPremiums earned\n$\n53,866\n \n$\n48,427\n \n$\n43,909\n \n$\n5,439\n \n$\n4,518\n \nExpense ratio\nAmortization of DAC\n12.4 \n12.5 \n12.7 \n(0.1)\n(0.2)\nAdvertising expense\n3.5 \n1.3 \n2.2 \n2.2 \n(0.9)\nOther costs and expenses, net of other revenue\n5.3 \n6.4 \n7.5 \n(1.1)\n(1.1)\nSubtotal\n21.2 \n20.2 \n22.4 \n1.0 \n(2.2)\nAmortization of purchased intangibles\n0.3 \n0.5 \n0.5 \n(0.2)\n— \nRestructuring and related charges\n0.2 \n0.3 \n0.1 \n(0.1)\n0.2 \nTotal expense ratio\n21.7\n \n21.0\n \n23.0\n \n0.7\n \n(2.0)\nDeferred acquisition costs\n  We establish a DAC asset for costs that are related directly to the acquisition of new or renewal insurance policies, principally agent remuneration and premium taxes. DAC is amortized to income over the period in which premiums are earned.\nDAC balance as of December 31 by product type\n($ in millions)\n2024\n2023\nAuto\n$\n1,302 \n$\n1,207 \nHomeowners\n958 \n890 \nOther personal lines\n182 \n177 \nCommercial lines\n31 \n42 \nOther business lines\n75 \n63 \nTotal DAC\n$\n2,548\n \n$\n2,379\n \nThe Allstate Corporation      47\n2024 Form 10-K\n \nRun-off Property-Liability\nRun-off Property-Liability Segment\nThe Run-off Property-Liability segment includes results from property and casualty insurance coverage that primarily relates to policies written during the 1960s through the mid-1980s. Our exposure to asbestos, environmental and other run-off lines claims arises principally from direct excess commercial insurance, assumed reinsurance coverage, direct primary commercial insurance and other businesses in run-off. We may pursue settlement agreements including policy buybacks on direct excess commercial business when appropriate to improve the certainty of the liabilities. Settlement agreements are negotiated contracts between Allstate and third parties that generally set forth the rights and obligations of the parties, including terms of payment for claims. For additional information on our strategy and outlook, see Part I, Item 1. Business - Strategy and Segment Information.\nUnderwriting results\nFor the years ended December 31,\n($ in millions)\n2024\n2023\n2022\nClaims and claims expense \nAsbestos claims\n$\n(19)\n$\n(44)\n$\n(34)\nEnvironmental claims\n(10)\n(18)\n(56)\nOther run-off lines\n(39)\n(27)\n(35)\nTotal claims and claims expense\n(68)\n(89)\n(125)\nOperating costs and expenses\n(5)\n(5)\n(4)\nUnderwriting loss\n$\n(73)\n$\n(94)\n$\n(129)\nUnderwriting losses\n in 2024 of $73 million and $94 million in 2023 primarily related to our annual reserve review using established industry and actuarial best practices and loss adjustment expenses. The annual review resulted in unfavorable reserve reestimates totaling $58 million and $80 million in 2024 and 2023, respectively. The reserve reestimates are included as part of claims and claims expense. \nThe reserve reestimates in 2024 primarily related to new reported information for asbestos related claims and adverse developments within the other run-off lines. The reserve reestimates in 2023 primarily related to new reported information and defense costs for asbestos related claims and other run-off exposures and higher than expected environmental reported losses.\nWe believe that our reserves are appropriately established based on available facts, technology, laws, regulations, and assessments of other pertinent factors and characteristics of exposure (e.g., claim activity, potential liability, jurisdiction, products versus non-products exposure) presented by individual policyholders, assuming no change in the legal, legislative or economic environment. However, as we progress with the resolution of disputed claims in the courts and arbitrations and with negotiations and settlements, our reported losses may be more variable.\nReserves for asbestos, environmental and other run-off claims before and after the effects of reinsurance\n($ in millions) \nDecember 31, 2024\nDecember 31, 2023\nAsbestos claims\nGross reserves\n$\n1,124 \n$\n1,166 \nReinsurance \n(350)\n(362)\nNet reserves \n774 \n804 \nEnvironmental claims\nGross reserves\n320 \n331 \nReinsurance \n(61)\n(64)\nNet reserves \n259 \n267 \nOther run-off claims\nGross reserves\n439 \n445 \nReinsurance \n(58)\n(72)\nNet reserves\n381 \n373 \nTotal \nGross reserves\n \n1,883 \n1,942 \nReinsurance\n \n(469)\n(498)\nNet reserves\n$\n1,414\n \n$\n1,444\n \n48      www.allstate.com\n2024 Form 10-K  \nRun-off Property-Liability\nReserves by type of exposure before and after the effects of reinsurance\n($ in millions)\nDecember 31, 2024\nDecember 31, 2023\nDirect excess commercial insurance \n    Gross reserves\n \n$\n1,082 \n$\n1,114 \n    Reinsurance \n(363)\n(382)\n    Net reserves\n719 \n732 \nAssumed reinsurance coverage\n    Gross reserves\n \n581 \n603 \n    Reinsurance \n(54)\n(54)\n    Net reserves\n527 \n549 \nDirect primary commercial insurance\n    Gross reserves \n133 \n140 \n    Reinsurance \n(51)\n(61)\n    Net reserves\n82 \n79 \nOther run-off business\n    Gross reserves\n— \n1 \n    Reinsurance\n— \n— \n    Net reserves\n— \n1 \nUnallocated loss adjustment expenses\n    Gross reserves\n87 \n84 \n    Reinsurance\n(1)\n(1)\n    Net reserves\n86 \n83 \nTotal\n    Gross reserves\n1,883 \n1,942 \n    Reinsurance\n(469)\n(498)\n    Net reserves\n$\n1,414\n \n$\n1,444\n \nPercentage of gross and ceded reserves by case and incurred but not reported (“IBNR”)\nDecember 31, 2024\nDecember 31, 2023\nCase\nIBNR\nCase\nIBNR\nDirect excess commercial insurance \nGross reserves\n (1)\n58 \n%\n42 \n%\n57 \n%\n43 \n%\nCeded \n(2)\n62 \n38 \n63 \n37 \nAssumed reinsurance coverage\nGross reserves\n \n34 \n66 \n32 \n68 \nCeded \n51 \n49 \n43 \n57 \nDirect primary commercial insurance\nGross reserves\n54 \n46 \n59 \n41 \nCeded\n87 \n13 \n83 \n17 \n(1)\nApproximately 65% and 68% of gross case reserves as of December 31, 2024 and December 31, 2023, respectively, are subject to settlement agreements that define and limit our obligations.\n(2)\nApproximately 72% of ceded case reserves as of both December 31, 2024 and December 31, 2023 are subject to settlement agreements that define and limit our obligations.\nThe Allstate Corporation      49\n2024 Form 10-K\n \nRun-off Property-Liability\nGross payments from case reserves by type of exposure \n($ in millions)\nFor the years ended December 31,\n2024\n2023\nDirect excess commercial insurance \nGross \n(1)\n$\n67 \n$\n72 \nCeded \n(2)\n(25)\n(27)\nAssumed reinsurance coverage\nGross\n \n45 \n45 \nCeded\n(2)\n(8)\nDirect primary commercial insurance\nGross\n6 \n7 \nCeded\n(2)\n— \n(1) \nIn 2024 and 2023, 87% and 85% of payments related to settlement agreements, respectively. \n(2) \nIn 2024 and 2023, 93% and 83% of payments related to settlement agreements, respectively.\nTotal net reserves as of December 31, 2024, included $723 million or 51% of estimated IBNR reserves compared to $762 million or 53% of estimated IBNR reserves as of December 31, 2023.\nTotal gross payments were $118 million and $124 million for 2024 and 2023, respectively. Payments primarily related to settlement agreements reached with several insureds on large claims, mainly asbestos related losses, where the scope of coverages has been agreed upon. The claims associated with these settlement agreements are expected to be substantially paid out over the next several years as qualified claims are submitted by these insureds. Reinsurance collections were $39 million and $35 million for 2024 and 2023, respectively. The allowance for uncollectible reinsurance recoverables was $61 million and $59 million as of December 31, 2024 and 2023, respectively. The allowance represents 11.3% and 10.3% of the related reinsurance recoverable balances as of December 31, 2024 and 2023, respectively.\n50      www.allstate.com\n2024 Form 10-K  \nProtection Services\nProtection Services Segment\n    Protection Services is comprised of Allstate Protection Plans, Allstate Dealer Services, Allstate Roadside, Arity and Allstate Identity Protection. In 2024, Protection Services represented 80.0% of total PIF and 4.8% of premiums written. We offer consumer product protection plans, automotive protection and insurance products (including vehicle service contracts, guaranteed asset protection, road hazard tire and wheel and paintless dent repair protection), roadside assistance, mobility data collection services and analytic solutions using automotive telematics information and identity theft protection and remediation services. For additional information on our strategy and outlook, see Part I, Item 1. Business - Strategy and Segment Information.\nSummarized financial information\nFor the years ended December 31,\n($ in millions)\n2024\n2023\n2022\nPremiums written\n$\n2,797\n \n$\n2,663\n \n$\n2,699\n \nRevenues\nPremiums \n$\n2,522 \n$\n2,243 \n$\n1,995 \nOther revenue\n441 \n319 \n347 \nIntersegment insurance premiums and service fees \n(1)\n180 \n138 \n149 \nNet investment income\n94 \n73 \n48 \nCosts and expenses\nClaims and claims expense\n(641)\n(632)\n(532)\nAmortization of DAC\n(1,217)\n(1,058)\n(928)\nOperating costs and expenses\n(1,090)\n(889)\n(874)\nRestructuring and related charges\n(2)\n(6)\n(2)\nIncome tax expense on operations\n(71)\n(83)\n(35)\nLess: noncontrolling interest\n(1)\n(1)\n(1)\nAdjusted net income\n$\n217\n \n$\n106\n \n$\n169\n \nAllstate Protection Plans \n$\n157 \n$\n117 \n$\n150 \nAllstate Dealer Services\n21 \n(15)\n35 \nAllstate Roadside\n39 \n24 \n7 \nArity\n(8)\n(18)\n(11)\nAllstate Identity Protection \n8 \n(2)\n(12)\nAdjusted net income\n$\n217\n \n$\n106\n \n$\n169\n \nPolicies in force\nAllstate Protection Plans\n159,761 \n145,292 \n138,726 \nAllstate Dealer Services\n3,710 \n3,776 \n3,865 \nAllstate Roadside\n758 \n553 \n531 \nAllstate Identity Protection\n2,511 \n2,884 \n3,112 \nPolicies in force as of December 31 (in thousands)\n166,740\n \n152,505\n \n146,234\n \n(1)\nPrimarily related to Arity and Allstate Roadside and are eliminated in our consolidated financial statements.\nPremiums written \nincreased 5.0% or $134 million in 2024 compared to 2023, primarily due to international growth at Allstate Protection Plans, partially offset by lower sales at Allstate Roadside.\nAdjusted net income\n increased 104.7% or $111 million in 2024 compared to 2023, due to premium growth at Allstate Protection Plans, improved claim severity at Allstate Roadside, higher lead sales revenue at Arity and both growth and lower costs at Allstate Identity Protection. Prior year adjusted net income was \nalso negatively impacted by an increase in state income taxes for Allstate Dealer Services.\nPIF\n increased 9.3% or 14 million in 2024 compared to 2023 due to growth at Allstate Protection Plans.\nOther revenue\n increased 38.2% or $122 million in 2024 compared to 2023, primarily due to higher revenue from increased customer lead sale purchases at Arity.\nThe Allstate Corporation      51\n2024 Form 10-K\n \nProtection Services\nIntersegment premiums and service fees\n increased 30.4% to $180 million in 2024 compared to 2023,\n \ndriven by increased lead sale purchases and higher software revenue at Arity.\nClaims and claims expense\n increased 1.4% or $9 million in 2024 compared to 2023, primarily driven by growth at Allstate Protection Plans partially offset by improved margins at Allstate Protection Plans resulting from lower frequency and lower claim severity at Allstate Roadside.\nAmortization of DAC\n increased 15.0% or $159 million in 2024 compared to 2023, driven by growth at Allstate Protection Plans.\nOperating costs and expenses \nincreased 22.6% or $201 million in 2024 compared to 2023, primarily due to expenses related to growth at Arity and Allstate Protection Plans, partially offset by lower expenses at Allstate Roadside and Allstate Identity Protection.\n52      www.allstate.com\n2024 Form 10-K  \nReserve for Property and Casualty Insurance Claims and Claims Expense  \nReserve for Property and Casualty Insurance Claims and Claims Expense \nUnderwriting results are significantly influenced by estimates of claims and claims expense reserves. The facts and circumstances leading to reestimates of reserves relate to claim activity and updates to the development factors used to predict how losses are likely to develop from the end of a reporting period until all claims have been paid. Reestimates occur when actual losses differ from those predicted by the estimated development factors used in prior reserve estimates. For a description of our reserve process, see Note 10 of the consolidated financial statements. For a description of our reserving policies and the potential variability in our reserve estimates, see the Application of Critical Accounting Estimates section of the MD&A. Reserves are an estimate of amounts necessary to settle all outstanding claims, including IBNR claims, as of the reporting date.\nWe believe the net loss reserves exposures are appropriately established based on available facts, laws and regulations.\nTotal claims and claims expense reserves, net of recoverables (“net reserves”), as of December 31\n($ in millions)\n2024\n2023\n2022\nAllstate Protection\n$\n31,846 \n$\n29,969 \n$\n26,876 \nRun-off Property-Liability\n1,414 \n1,444 \n1,451 \nTotal Property-Liability\n33,260 \n31,413 \n28,327 \nProtection Services\n55 \n49 \n38 \nTotal net reserves \n$\n33,315\n \n$\n31,462\n \n$\n28,365\n \nReserve for property and casualty insurance claims and claims expense\n$\n41,917 \n$\n39,858 \n$\n37,541 \nLess: reinsurance and indemnification recoverables \n(1)\n8,602 \n8,396 \n9,176 \nTotal net reserves\n$\n33,315\n \n$\n31,462\n \n$\n28,365\n \n(1)\nIncludes $6.41 billion, $6.36 billion and $6.66 billion of unpaid indemnification recoverables related to the Michigan Catastrophic Claims Association (“MCCA”) as of December 31, 2024, 2023 and 2022, respectively.\nImpact of reserve reestimates on combined ratio and net income applicable to common shareholders \n(1) (2)\n2024\n2023\n2022\n($ in millions, except ratios)\nReserve reestimates\nEffect on combined ratio\nReserve reestimates\nEffect on combined ratio\nReserve reestimates\nEffect on combined ratio\nAllstate Protection\n$\n(376)\n(0.7)\n$\n461 \n0.9 \n$\n1,619 \n3.6 \nRun-off Property-Liability\n68 \n0.2 \n89 \n0.2 \n125 \n0.3 \nTotal Property-Liability\n(308)\n(0.5)\n550 \n1.1 \n1,744 \n3.9 \nProtection Services\n— \n— \n(1)\n— \n(3)\n— \nTotal \n$\n(308)\n$\n549\n \n$\n1,741\n \nReserve reestimates, after-tax\n$\n(243)\n$\n434 \n$\n1,375 \nConsolidated net (loss) income applicable to common shareholders\n$\n4,550 \n$\n(316)\n$\n(1,394)\nReserve reestimates as a % impact on consolidated net income (loss) applicable to common shareholders\n5.3 \n%\nNM\n(98.6)\n%\nProperty-Liability prior year reserve reestimates included in catastrophe losses\n$\n(370)\n$\n(24)\n$\n18 \n(1)\nFavorable reserve reestimates are shown in parentheses.\n(2)\nRatios are calculated using property and casualty premiums earned.\nNM = not meaningful\nThe Allstate Corporation      53\n2024 Form 10-K\n \n Reserve for\n \nProperty and Casualty Insurance\n \nClaims and Claims Expense\nThe following tables reflect the accident years to which the reestimates shown above are applicable. Favorable reserve reestimates are shown in parentheses.\nPrior year reserve reestimates\n($ in millions)\n2024\n2019 & prior\n2020\n2021\n2022\n2023\nTotal\nAllstate Protection\n$\n228 \n$\n80 \n$\n276 \n$\n444 \n$\n(1,404)\n$\n(376)\nRun-off Property-Liability\n68 \n— \n— \n— \n— \n68 \nTotal Property-Liability\n296 \n80 \n276 \n444 \n(1,404)\n(308)\nProtection Services\n— \n— \n— \n— \n— \n— \nTotal\n$\n296\n \n$\n80\n \n$\n276\n \n$\n444\n \n$\n(1,404)\n$\n(308)\n2023\n2018 & prior\n2019\n2020\n2021\n2022\nTotal\nAllstate Protection\n$\n230 \n$\n130 \n$\n84 \n$\n401 \n$\n(384)\n$\n461 \nRun-off Property-Liability\n89 \n— \n— \n— \n— \n89 \nTotal Property-Liability\n319 \n130 \n84 \n401 \n(384)\n550 \nProtection Services\n— \n— \n— \n— \n(1)\n(1)\nTotal\n$\n319\n \n$\n130\n \n$\n84\n \n$\n401\n \n$\n(385)\n$\n549\n \n2022\n2017 & prior\n2018\n2019\n2020\n2021\nTotal\nAllstate Protection\n$\n27 \n$\n161 \n$\n294 \n$\n345 \n$\n792 \n$\n1,619 \nRun-off Property-Liability\n125 \n— \n— \n— \n— \n125 \nTotal Property-Liability\n152 \n161 \n294 \n345 \n792 \n1,744 \nProtection Services\n— \n— \n— \n— \n(3)\n(3)\nTotal\n$\n152\n \n$\n161\n \n$\n294\n \n$\n345\n \n$\n789\n \n$\n1,741\n \nAllstate Protection\nThe table below shows Allstate Protection net reserves representing the estimated cost of outstanding claims as they were recorded at the beginning of years 2024, 2023, and 2022, and the effect of reestimates in each year.\nImpact of reserve reestimates by line on net reserves, combined ratio and underwriting income\n2024\n2023\n2022\n($ in millions)\nJanuary 1 reserves\nReserve reestimates\nEffect on combined ratio\nJanuary 1 reserves\nReserve reestimates\nEffect on combined ratio\nJanuary 1 reserves\nReserve reestimates\nEffect on combined ratio\nAuto \n(1)\n$\n21,286 \n$\n(364)\n(0.7)\n$\n19,365 \n$\n244 \n0.5 \n$\n16,078 \n$\n1,185 \n2.7 \nHomeowners \n(1)\n4,754 \n(395)\n(0.7)\n3,520 \n102 \n0.2 \n2,731 \n200 \n0.4 \nOther personal lines\n1,736 \n217 \n0.4 \n1,653 \n19 \n0.1 \n1,844 \n(32)\n(0.1)\nCommercial lines and other \n(2)\n2,193 \n166 \n0.3 \n2,338 \n96 \n0.2 \n1,471 \n266 \n0.6 \nTotal Allstate Protection\n$\n29,969\n \n$\n(376)\n(0.7)\n$\n26,876\n \n$\n461\n \n1.0\n \n$\n22,124\n \n$\n1,619\n \n3.6\n \nUnderwriting income (loss)\n$\n3,153\n \n$\n(2,090)\n$\n(2,782)\n(1)\n2022 beginning reserves includes a $944 million reclassification of reserves from homeowners to auto.\n(2)\nIncludes the unamortized fair value adjustment related to the acquisition of National General.\nFavorable reserve reestimates in 2024 totaled $376 million, representing 11.9% of underwriting income, were primarily due to catastrophe reserve reestimates in homeowners and non-catastrophe reserve reestimates in personal auto lines, partially offset by unfavorable reserve reestimates in other personal lines and commercial lines driven by transportation network company coverage no longer offered.\nUnfavorable reserve reestimates in 2023 totaled $461 million and represented 22.1% of the underwriting loss and were primarily due to National General personal auto lines, homeowners and commercial lines.\n54      www.allstate.com\n2024 Form 10-K  \nReserve for Property and Casualty Insurance Claims and Claims Expense  \nRun-off Property-Liability \nWe conduct an annual review in the third quarter of each year to evaluate and establish asbestos, environmental and other run-off reserves. Reserves are recorded in the reporting period in which they are determined. Using established industry and actuarial best practices and assuming no change in the regulatory or economic environment, this detailed and comprehensive methodology determines reserves based on assessments of the characteristics of exposure (e.g., claim activity, potential liability, jurisdiction, products versus non-products exposure) presented by policyholders.\nRun-off Property-Liability net reserve reestimates\n2024\n2023\n2022\n($ in millions)\nJanuary 1 reserves\nReserve reestimates\nJanuary 1 reserves\nReserve reestimates\nJanuary 1 reserves\nReserve reestimates\nAsbestos claims\n$\n804 \n$\n19 \n$\n811 \n$\n44 \n$\n828 \n$\n34 \nEnvironmental claims\n267 \n10 \n267 \n18 \n226 \n56 \nOther run-off lines\n373 \n39 \n373 \n27 \n367 \n35 \nTotal \n$\n1,444\n \n$\n68\n \n$\n1,451\n \n$\n89\n \n$\n1,421\n \n$\n125\n \nUnderwriting loss\n$\n(73)\n$\n(94)\n$\n(129)\nReserve reestimates in 2024 primarily related to our annual reserve review based on new reported information for asbestos related claims and adverse developments within the other run-off lines, and loss adjustment expenses. \nReserve reestimates in 2023 primarily related to the annual reserve review based on new reported information and defense costs for asbestos related claims and other run-off exposures and higher than expected environmental reported losses, and loss adjustment expenses. \nReserves and claim activity before (Gross) and after (Net) the effects of reinsurance\n2024\n2023\n2022\n($ in millions, except ratios)\nGross\nNet\nGross\nNet\nGross\nNet\nAsbestos claims\nBeginning reserves\n$\n1,166 \n$\n804 \n$\n1,190 \n$\n811 \n$\n1,210 \n$\n828 \nIncurred claims and claims expense\n28 \n19 \n56 \n44 \n59 \n34 \nClaims and claims expense paid\n(70)\n(49)\n(80)\n(51)\n(79)\n(51)\nEnding reserves\n$\n1,124\n \n$\n774\n \n$\n1,166\n \n$\n804\n \n$\n1,190\n \n$\n811\n \nAnnual survival ratio\n16.1 \n15.8 \n14.6 \n15.8 \n15.1 \n15.9 \n3-year survival ratio\n14.6 \n15.3 \n13.8 \n14.8 \n13.1 \n14.0 \nEnvironmental claims\nBeginning reserves\n$\n331 \n$\n267 \n$\n328 \n$\n267 \n$\n273 \n$\n226 \nIncurred claims and claims expense\n11 \n10 \n23 \n18 \n79 \n56 \nClaims and claims expense paid\n(22)\n(18)\n(20)\n(18)\n(24)\n(15)\nEnding reserves\n$\n320\n \n$\n259\n \n$\n331\n \n$\n267\n \n$\n328\n \n$\n267\n \nAnnual survival ratio\n14.5 \n14.4 \n16.6 \n14.8 \n13.7 \n17.8 \n3-year survival ratio\n14.3 \n15.2 \n14.4 \n15.1 \n14.5 \n15.4 \nCombined environmental and asbestos claims\nAnnual survival ratio\n15.7 \n15.4 \n15.0 \n15.5 \n14.7 \n16.3 \n3-year survival ratio\n14.6 \n15.3 \n13.9 \n14.8 \n13.3 \n14.3 \nPercentage of IBNR in ending reserves\n54.0 \n%\n0\n55.7 \n%\n0\n55.9 \n%\nThe survival ratio is calculated by taking our ending reserves divided by payments made during the year. This is a commonly used but simplistic and imprecise approach to measuring the adequacy of asbestos and environmental reserve levels. Many factors, such as mix of business, level of coverage provided and settlement procedures have significant impacts on the amount of environmental and asbestos claims and claims expense reserves, claim payments and the resultant ratio. As payments result in corresponding reserve reductions, survival ratios can be expected to vary over time. The combined asbestos and environmental net 3-year survival ratio in 2024 increased from 2023 due to lower average payments.\nThe Allstate Corporation      55\n2024 Form 10-K\n \n Reserve for\n \nProperty and Casualty Insurance\n \nClaims and Claims Expense\nNet asbestos reserves by type of exposure and total reserve additions \nDecember 31, 2024\nDecember 31, 2023\nDecember 31, 2022\n($ in millions)\nNet reserves\n% of reserves\nNet reserves\n% of reserves\nNet reserves\n% of reserves\nDirect:\nPrimary\n$\n9 \n1.2 \n%\n$\n9 \n1.1 \n%\n$\n9 \n1.1 \n%\nExcess\n261 \n33.7 \n263 \n32.7 \n257 \n31.7 \nTotal direct\n270 \n34.9 \n272 \n33.8 \n266 \n32.8 \nAssumed reinsurance\n90 \n11.6 \n91 \n11.3 \n97 \n12.0 \nIBNR\n414 \n53.5 \n441 \n54.9 \n448 \n55.2 \nTotal net reserves\n$\n774\n \n100.0\n \n%\n$\n804\n \n100.0\n \n%\n$\n811\n \n100.0\n \n%\nTotal reserve additions\n$\n19 \n$\n44 \n$\n34 \nIBNR net reserves decreased $27 million as of December 31, 2024 compared to December 31, 2023. IBNR provides for reserve development of known claims and future reporting of additional unknown claims from current policyholders and ceding companies.\nReinsurance and indemnification programs\n  We purchase significant reinsurance to manage our aggregate countrywide exposure to an acceptable level. The price and terms of reinsurance and the credit quality of the reinsurer are considered in the purchase process. We utilize reinsurance to reduce exposure to catastrophe risk and manage capital, and to support the required statutory surplus and the insurance financial strength ratings of certain subsidiaries such as Castle Key Insurance Company (“CKIC”) and Allstate New Jersey Insurance Company (“ANJ”). We have also purchased reinsurance to mitigate exposures in our long-tail liability lines, including environmental, asbestos and other run-off lines as well as our commercial lines. We also participate in various indemnification mechanisms, including state-based \nindustry pool or facility programs mandating participation by insurers offering certain coverage in their state and the federal government National Flood Insurance Program (“NFIP”). See Note 12 of the consolidated financial statements for additional details on these programs.\nIntercompany reinsurance\n  We enter into certain intercompany insurance and reinsurance transactions in order to maintain underwriting control and manage insurance risk among various legal entities. These reinsurance agreements have been approved by the appropriate regulatory authorities. All significant intercompany transactions have been eliminated in consolidation.\nCatastrophe reinsurance\n  We anticipate completing the placement of our 2025 nationwide catastrophe reinsurance program in the first half of 2025. For further details of the existing 2024 program, see Note 12 of the consolidated financial statements.\n56      www.allstate.com\n2024 Form 10-K  \nReserve for Property and Casualty Insurance Claims and Claims Expense  \nReinsurance and indemnification recoverables, net of the allowance established for uncollectible amounts\nS&P financial strength rating\n \n(1)\nA.M. Best financial strength rating\n \n(1)\nReinsurance or indemnification\nrecoverables on paid and unpaid claims, net\n($ in millions)\n2024\n2023\nIndemnification programs\nState-based industry pool or facility programs\nMCCA \n(2) \nN/A\nN/A\n$\n6,478 \n$\n6,424 \nNorth Carolina Reinsurance Facility (“NCRF”)\nN/A\nN/A\n456 \n382 \nNew Jersey Property-Liability Insurance Guaranty Association (“PLIGA”) \nN/A\nN/A\n370 \n326 \nFlorida Hurricane Catastrophe Fund (“FHCF”)\nN/A\nN/A\n73 \n82 \nOther\n34 \n32 \nFederal Government \n- \nNFIP\nN/A\nN/A\n279 \n76 \nSubtotal\n7,690\n \n7,322\n \nCatastrophe reinsurance recoverables\nRenaissance Reinsurance Limited\nA+\nA+\n44 \n31 \nSanders RE II Ltd.\nN/A\nN/A\n31 \n36 \nDaVinci Reinsurance Limited\nA+\nA\n31 \n19 \nOther\n271 \n264 \nSubtotal\n377\n \n350\n \nOther reinsurance recoverables, net \n(3)\nLloyd’s of London\nN/A\nA+\n175 \n180 \nPacific Valley Insurance Company, Inc.\nN/A\nN/A\n77 \n67 \nWestport Insurance Corporation\nAA-\nA+\n75 \n87 \nAleka Insurance Inc.\nN/A\nN/A\n62 \n113 \nSwiss Reinsurance America Corporation\nAA-\nA+\n35 \n47 \nOther, including allowance for credit losses\n368 \n458 \nSubtotal\n792\n \n952\n \nTotal Property-Liability \n8,859\n \n8,624\n \nProtection Services\n28 \n26 \nTotal \n$\n8,887\n \n$\n8,650\n \n(1)\nN/A reflects no S&P Global Ratings (“S&P”) or A.M. Best ratings available.\n(2)\nAs of December 31, 2024 and 2023, MCCA includes $71 million and $62 million\n \nof reinsurance recoverable on paid claims, respectively, and $6.41 billion and $6.36 billion of reinsurance recoverable on unpaid claims, respectively.\n(3)\nOther reinsurance recoverables primarily relate to commercial lines, including shared economy, as well as asbestos, environmental and other liability exposures.\nReinsurance and indemnification recoverables include an estimate of the amount of insurance claims and claims expense reserves that are ceded under the terms of the agreements, including IBNR unpaid losses. We calculate our ceded reinsurance and indemnification estimates based on the terms of each applicable agreement, including an estimate of how IBNR losses will ultimately be ceded under the agreement. We also consider other limitations and coverage exclusions under our agreements. Accordingly, our estimate of recoverables is subject to similar risks and uncertainties as our estimate of reserves for claims and claims expense. We believe the recoverables are appropriately established; however, as our underlying reserves continue to develop, the amount ultimately recoverable may vary from amounts currently recorded. We regularly evaluate the reinsurers and the respective amounts of our reinsurance recoverables, and a provision for uncollectible reinsurance recoverables is recorded, if needed. The establishment of reinsurance \nrecoverables and the related allowance for uncollectible reinsurance is also an inherently uncertain process involving estimates. Changes in estimates could result in additional changes to the Consolidated Statements of Operations. \nIndemnification recoverables are considered collectible based on the industry pool and facility enabling legislation. The Company has not had any credit losses related to these programs, and we do not anticipate losses in the foreseeable future. We also have not experienced credit losses on our catastrophe reinsurance programs, which include highly rated reinsurers.\nThe allowance for uncollectible reinsurance relates to other reinsurance programs primarily related to our Run-off Property-Liability segment. The allowance was $63 million and $62 million as of December 31, 2024 and 2023, respectively.\nThe Allstate Corporation      57\n2024 Form 10-K\n \n Reserve for\n \nProperty and Casualty Insurance\n \nClaims and Claims Expense\nThe allowance is based upon our ongoing review of amounts outstanding, length of collection periods, changes in reinsurer credit standing, and other relevant factors. In addition, in the ordinary course of business, we may become involved in coverage disputes with certain of our reinsurers that may ultimately result in lawsuits and arbitrations brought by or against such reinsurers to determine the parties’ rights and obligations under the various reinsurance agreements. We employ dedicated specialists to manage reinsurance collections and disputes. We also consider recent developments in commutation activity between reinsurers and cedents, and recent trends in arbitration and litigation outcomes in disputes between cedents and reinsurers in seeking to maximize our reinsurance recoveries. \nAdverse developments in the insurance industry have led to a decline in the financial strength of some of our reinsurance carriers, causing amounts recoverable from them and future claims ceded to them to be considered a higher risk. There has also been consolidation activity in the industry, which causes reinsurance risk across the industry to be concentrated among fewer companies. \nSee Note 2 of the consolidated financial statements for a description of the methodology utilized to calculate the allowance for reinsurance recoverables.\nFor further details related to our reinsurance and indemnification recoverables, see the Regulation section in Part I and Note 12 of the consolidated financial statements.\nEffects of reinsurance ceded and indemnification programs on premiums earned and claims and claims expense\nFor the years ended December 31,\n($ in millions)\n2024\n2023\n2022\nAllstate Protection - Premiums\nIndemnification programs\nState-based industry pool or facility programs\nNCRF\n$\n441 \n$\n323 \n$\n300 \nMCCA\n26 \n29 \n18 \nPLIGA\n8 \n7 \n7 \nFHCF\n23 \n28 \n24 \nOther\n1 \n1 \n— \nFederal Government \n- \nNFIP \n(1)\n368 \n327 \n319 \nCatastrophe reinsurance\n1,088 \n995 \n764 \nOther reinsurance programs \n93 \n110 \n261 \nTotal Allstate Protection\n2,048\n \n1,820\n \n1,693\n \nRun-off Property-Liability\n— \n— \n— \nTotal Property-Liability\n2,048\n \n1,820\n \n1,693\n \nProtection Services\n162 \n169 \n176 \nTotal effect on premiums earned\n$\n2,210\n \n$\n1,989\n \n$\n1,869\n \nAllstate Protection - Claims\nIndemnification programs\nState-based industry pool or facility programs\nMCCA\n$\n180 \n$\n(185)\n$\n116 \nNCRF\n425 \n379 \n294 \nPLIGA\n60 \n14 \n(24)\nFHCF\n(1)\n(6)\n74 \nOther \n1 \n1 \n— \nFederal Government \n- \nNFIP \n(1)\n618 \n102 \n435 \nCatastrophe reinsurance\n \n198 \n32 \n298 \nOther reinsurance programs\n97 \n151 \n261 \nTotal Allstate Protection\n1,578\n \n488\n \n1,454\n \nRun-off Property-Liability\n2 \n29 \n50 \nTotal Property-Liability\n1,580\n \n517\n \n1,504\n \nProtection Services\n136 \n116 \n96 \nTotal effect on claims and claims expense\n$\n1,716\n \n$\n633\n \n$\n1,600\n \n(1)\nSee Note 12 of the consolidated financial statements for additional details on the National Flood Insurance Program.\nIn 2024, ceded premiums earned increased primarily due to NCRF and catastrophe reinsurance. In 2023, ceded premiums earned increased primarily due to catastrophe reinsurance.\nIn 2024, ceded claims and claims expenses increased $1.08 billion primarily due to an increase in the IBNR loss reserve for NFIP related to Hurricane Helene, catastrophe reinsurance, and a prior year \nreduction in gross reserves for Michigan Personal Injury Protection (“PIP”) coverage. In 2023, ceded claims and claims expenses decreased $967 million primarily due to lower amounts related to NFIP, and a reduction in gross reserves for Michigan PIP coverage. For further discussion of these items, see Regulation, Indemnification Programs and Note 12 of the consolidated financial statements.\n58      www.allstate.com\n2024 Form 10-K  \nReserve for Property and Casualty Insurance Claims and Claims Expense  \nMichigan PIP reserve and claim activity before and after the effects of MCCA recoverables\nFor the years ended December 31,\n2024\n2023\n2022\n($ in millions)\nGross\nNet\nGross\nNet\nGross\nNet\nBeginning reserves\n$\n7,003 \n$\n641 \n$\n7,393 \n$\n735 \n$\n7,387 \n$\n747 \nIncurred claims and claims expense - current year\n284 \n78 \n307 \n102 \n451 \n175 \nIncurred claims and claims expense - prior years\n(38)\n(14)\n(455)\n(60)\n(159)\n(15)\nClaims and claims expense paid - current year\n(21)\n(21)\n(21)\n(20)\n(26)\n(26)\nClaims and claims expense paid - prior years\n(200)\n(63)\n(221)\n(116)\n(260)\n(146)\nEnding reserves\n \n(1)\n$\n7,028\n \n$\n621\n \n$\n7,003\n \n$\n641\n \n$\n7,393\n \n$\n735\n \n(1)\nGross reserves for the year ended December 31, 2024, comprise 70% case reserves and 30% IBNR. Gross reserves for the year ended December 31, 2023, comprise 77% case reserves and 23% IBNR. Gross reserves for the year ended December 31, 2022, comprise 76% case reserves and 24% IBNR. The MCCA does not require member companies to report ultimate case reserves.\nPending MCCA claims differ from most personal lines insurance pending claims as other personal lines policies incurred claims settle in shorter periods due to having a coverage limit. MCCA claims can be outstanding for a claimant’s lifetime, as there is no contractual limitation on any policy effective July 1, 2020 or prior, and on policies that selected the unlimited PIP benefits option on or after July 2, 2020. Many of these injuries are catastrophic in nature, resulting in serious permanent disabilities that require attendant and residential care for periods that may span decades. A significant portion of the ultimate incurred claim reserves and the recoverables can be attributed to a small number of catastrophic claims that occurred more than five years ago and continue to pay lifetime benefits.\n As of December 31, 2024, approximately 90% of our 1,300 catastrophic claims that are eligible for reimbursement by the MCCA occurred more than 5 years ago and continue to incur costs. There are 63 claims with reserves in excess of $15 million as of December 31, 2024, which comprise approximately 24% of the gross ending reserves in the table above. As a result, significant developments with a single claimant can result in volatility in prior year incurred claims.\nPending, new and closed claims for Michigan PIP exposure\nFor the years ended December 31,\nNumber of claims \n(1)\n2024\n2023\n2022\nPending, beginning of year\n4,726 \n5,568 \n5,421 \nNew\n6,612 \n6,496 \n8,059 \nClosed\n(7,027)\n(7,338)\n(7,912)\nPending, end of year\n4,311\n \n4,726\n \n5,568\n \n(1)\nTotal claims includes those covered and not covered by the MCCA indemnification.\nThe Allstate Corporation      59\n2024 Form 10-K\n \nAllstate Health and Benefits\nAllstate Health and Benefits Segment\nAllstate Health and Benefits offers employer voluntary benefits, group health and individual health products, including life, accident, critical illness, hospital indemnity, short-term disability and other health products.\nIn 2024, Allstate Health and Benefits represented 2.0% of total PIF. Our target customers are small group employers and consumers with family and financial protection needs. For additional information on our strategy and outlook, see Part I, Item 1. Business - Strategy and Segment Information.\nOn August 13, 2024, we entered into a share purchase agreement with StanCorp Financial Group, Inc. to sell American Heritage Life Insurance Company and American Heritage Service Company, comprising the Company’s employer voluntary benefits business, reported within this segment. The transaction is expected to close in the first half of 2025, subject to regulatory approvals and other customary closing conditions. For additional information on the disposition, see Note 4. \nOn January 30, 2025, Allstate entered into an agreement with Nationwide Life Insurance Company to sell Direct General Life Insurance Company, NSM Sales Corporation and The Association Benefits Solution, LLC, comprising the group health business. The transaction is expected to close during 2025, subject to regulatory approvals and other customary closing conditions. The individual health business will either be retained or divested. \nSummarized financial information\nFor the years ended December 31,\n($ in millions)\n2024\n2023\n2022\nRevenues\nAccident and health insurance premiums and contract charges\n$\n1,921 \n$\n1,846 \n$\n1,832 \nOther revenue\n522 \n447 \n402 \nNet investment income\n100 \n82 \n69 \nCosts and expenses\nAccident, health and other policy benefits\n(1,241)\n(1,071)\n(1,042)\nAmortization of DAC\n(146)\n(150)\n(136)\nOperating costs and expenses\n(915)\n(842)\n(814)\nRestructuring and related charges\n(3)\n(7)\n(2)\nIncome tax expense on operations\n(52)\n(63)\n(64)\nAdjusted net income\n$\n186\n \n$\n242\n \n$\n245\n \nBenefit ratio \n(1)\n62.8 \n56.2 \n55.1 \nEmployer voluntary benefits \n(2)\n$\n85 \n$\n100 \n$\n124 \nGroup health \n(3)\n71 \n95 \n90 \nIndividual health \n(4)\n30 \n$\n47 \n31 \nAdjusted net income\n$\n186\n \n$\n242\n \n$\n245\n \nPolicies in force\nEmployer voluntary benefits \n(2)\n3,464 \n3,590 \n3,783 \nGroup health \n(3)\n140 \n136 \n119 \nIndividual health \n(4)\n471 \n417 \n394 \nPolicies in force as of December 31 (in thousands)\n4,075\n \n4,143\n \n4,296\n \n(1)\nBenefit ratio is calculated as accident, health and other policy benefits less interest credited to contractholder funds of $34 million, $33 million, and $33 million for the years ended December 31, 2024, 2023, and 2022, respectively, divided by premiums and contract charges.\n(2)\nEmployer voluntary benefits include supplemental life and health products offered through workplace enrollment.\n(3)\nGroup health includes health products and administrative services sold to employers.\n(4)\nIndividual health includes short-term medical and other health products sold directly to individuals.\nPremiums and contract charges\n increased 4.1% or $75 million in 2024 compared to 2023, primarily due to growth in individual health and group health, partially offset by a decline in employer voluntary benefits.\n60      www.allstate.com\n2024 Form 10-K  \nAllstate Health and Benefits\nPremiums and contract charges by line of business\nFor the years ended December 31,\n($ in millions)\n2024\n2023\n2022\nEmployer voluntary benefits\n$\n985 \n$\n1,001 \n$\n1,033 \nGroup health\n481 \n440 \n385 \nIndividual health\n455 \n405 \n414 \nPremiums and contract charges\n \n$\n1,921\n \n$\n1,846\n \n$\n1,832\n \nAdjusted net income\n decreased $56 million in 2024 compared to 2023, primarily due to increased benefit utilization across all lines of business.\nNew annualized premium sales\n (annualized premiums at initial employer voluntary benefit customer enrollment or health policy sale) were $732 million in both 2024 and 2023. \nOther revenue\n increased $75 million in 2024 compared to 2023, primarily due to increases in third party commission revenue for the individual health business and administrative fees in the group health business.\nAccident, health and other policy benefits\n increased 15.9% or $170 million in 2024 compared to 2023, primarily due to higher benefit utilization in all \nbusinesses and growth in group health and individual health.\nAccident, health and other policy benefits include changes in the reserve for future policy benefits, expected development on reported claims, and reserves for incurred but not reported claims as shown in Note 11 of the consolidated financial statements.\nBenefit ratio\n increased 6.6 points to 62.8 in 2024 compared to 56.2 in 2023, primarily due to higher claims experience across all lines of business.\nAmortization of DAC \ndecreased\n 2.7% or $4 million in 2024 compared to 2023. For information on changes in DAC, see Note 13 of the consolidated financial statements.\nOperating costs and expenses\n($ in millions)\nEmployer voluntary benefits\nGroup \nhealth\nIndividual\nhealth\nTotal\n2024\n \n \n \nNon-deferrable commissions\n$\n83 \n$\n108 \n$\n155 \n$\n346 \nOperating costs and expenses\n212 \n174 \n183 \n569 \nTotal\n$\n295\n \n$\n282\n \n$\n338\n \n$\n915\n \n2023\n \n \n \nNon-deferrable commissions\n$\n87 \n$\n97 \n$\n135 \n$\n319 \nOperating costs and expenses\n206 \n159 \n158 \n523 \nTotal\n$\n293\n \n$\n256\n \n$\n293\n \n$\n842\n \n2022\n \n \n \nNon-deferrable commissions\n$\n95 \n$\n83 \n$\n143 \n$\n321 \nOperating costs and expenses\n191 \n133 \n169 \n493 \nTotal\n$\n286\n \n$\n216\n \n$\n312\n \n$\n814\n \nOperating costs and expenses\n increased $73 million in 2024 compared to 2023, primarily due to growth in individual health and group health. \nThe Allstate Corporation      61\n2024 Form 10-K\n \nInvestments\nInvestments \nOverview and strategy\nThe return on our investment portfolios is an important component of our ability to offer value to customers, fund business improvements and create value for shareholders. Investment portfolios are held for Property-Liability, Protection Services, Allstate Health and Benefits and Corporate and Other operations. While taking into consideration the investment portfolio in aggregate, management of the underlying portfolios is significantly influenced by the nature of each respective business and its corresponding liability profile. For each business, we identify a strategic asset allocation which considers both the nature of the liabilities and the risk and return characteristics of the various asset classes in which we invest. This allocation is informed by our long-term business and market expectations, as well as other considerations such as risk appetite, portfolio diversification, duration, desired liquidity and capital. Within appropriate ranges relative to strategic allocations, tactical allocations are made in consideration of prevailing and potential future market conditions. We manage risks that involve uncertainty related to interest rates, inflation, credit spreads, equity returns and currency exchange rates.\nThe Property-Liability portfolio emphasizes protection of principal and consistent income generation within a total return framework. This approach has produced competitive returns over the long term and is designed to ensure financial strength and stability for paying claims, while maximizing economic value and surplus growth. Products with lower liquidity and capital needs, such as auto insurance and run-off lines, create capacity to invest in less liquid higher yielding fixed income securities, performance-based investments such as limited partnerships and equity securities. Products with higher liquidity needs, such as homeowners insurance, are invested primarily in high quality liquid fixed income securities.\nThe Protection Services portfolio is focused on protection of principal and consistent income generation within a total return framework. The portfolio is largely comprised of fixed income securities with a lesser allocation to equity securities and short-term investments.\nThe Allstate Health and Benefits portfolio is focused on protection of principal and consistent income generation within a total return framework. The portfolio is largely comprised of fixed income securities with a small allocation to short-term investments.\nThe Corporate and Other portfolio is primarily focused on liquidity needs and capital preservation within a total return framework. The portfolio is largely comprised of high-quality liquid fixed income securities and short-term investments with a lower allocation to performance-based and equity investments.\nWe utilize two primary strategies to manage risks and returns and to position our portfolio to take \nadvantage of market opportunities while attempting to mitigate adverse effects. As strategies and market conditions evolve, the asset allocation may change.\nMarket-based\n \nstrategy seeks to deliver predictable earnings aligned to business needs and provide flexibility to adjust investment risk profile based on enterprise objectives and market opportunities primarily through public and private fixed income investments and public equity securities.\nPerformance-based\n \nstrategy seeks to deliver attractive risk-adjusted returns and supplement market risk with idiosyncratic risk. Consequently, return patterns can be more volatile than the market-based portfolio. Returns are impacted by a variety of factors including general macroeconomic and public market conditions as public benchmarks are often used in the valuation of underlying investments. Variability in earnings will also result from the performance of the underlying assets or business and the timing of sales of those investments. Earnings from the sales of investments may be recorded as net investment income or net gains and losses on investments and derivatives. The portfolio, which primarily includes private equity (including infrastructure investments) and real estate with a majority being limited partnerships, is diversified across a number of characteristics, including managers or partners, vintage years, investment strategies, geographies (including international) and industry sectors or property types. These investments are generally illiquid in nature, often require specialized expertise, typically involve a third-party manager, and enhance returns and income through transformation at the company or property level. A portion of these investments seek returns in markets or asset classes that are dislocated or special situations, primarily in private markets.\nInvestments outlook \nOur focus is on the following priorities:\n•\nEnhance investment portfolio returns through use of a dynamic capital allocation framework and focus on tax efficiency.\n•\nLeverage our broad capabilities to manage the portfolio to earn higher risk-adjusted returns on capital.\n•\nInvest for the specific needs and characteristics of Allstate’s businesses, including its corresponding liability profile.\nWe utilize our integrated enterprise risk and return management framework to determine the amount of investment risk we are willing to accept. Beginning in 2023, we extended the fixed income portfolio duration as the sustained higher market yields provided an opportunity to increase risk-adjusted returns. In 2024, we increased public equity securities by $2.05 billion primarily funded through the sale of investment grade corporate bonds and short-term investments. \n62      www.allstate.com\n2024 Form 10-K  \nInvestments\nPortfolio composition and strategy by reporting segment \n(1)\nAs of December 31, 2024\n($ in millions)\nProperty-Liability\nProtection Services\nAllstate Health and Benefits\n \nCorporate \nand Other\nTotal\nFixed income securities \n(2)\n$\n49,203 \n$\n1,868 \n$\n362 \n$\n1,314 \n$\n52,747 \nEquity securities \n(3)\n3,830 \n229 \n— \n404 \n4,463 \nMortgage loans, net\n784 \n— \n— \n— \n784 \nLimited partnership interests\n9,244 \n— \n— \n11 \n9,255 \nShort-term investments \n(4)\n3,786 \n131 \n17 \n603 \n4,537 \nOther investments, net\n824 \n— \n— \n— \n824 \nTotal\n$\n67,671\n \n$\n2,228\n \n$\n379\n \n$\n2,332\n \n$\n72,610\n \nPercentage to total \n93.2\n \n%\n3.1\n \n%\n0.5\n \n%\n3.2\n \n%\n100.0\n \n%\nMarket-based\n$\n57,489 \n$\n2,228 \n$\n379 \n$\n2,054 \n$\n62,150 \nPerformance-based\n10,182 \n— \n— \n278 \n10,460 \nTotal\n$\n67,671\n \n$\n2,228\n \n$\n379\n \n$\n2,332\n \n$\n72,610\n \n(1)\nBalances reflect the elimination of related party investments between segments.\n(2)\nFixed income securities are carried at fair value. Amortized cost, net for these securities was $50.02 billion, $1.91 billion, $370 million, $1.32 billion and $53.62 billion for Property-Liability, Protection Services, Allstate Health and Benefits, Corporate and Other, and in total, respectively.\n(3)\nEquity securities are carried at fair value. The fair value of equity securities held as of December 31, 2024 was $134 million in excess of cost. These net gains were primarily concentrated in the technology and banking sectors. Equity securities include $750 million of funds with underlying investments in fixed income securities as of December 31, 2024.\n(4)\nShort-term investments are carried at fair value.\nInvestments totaled $72.61 billion as of December 31, 2024, increasing from $66.68 billion as of December 31, 2023, primarily due to positive operating and investment cash flows.\nPortfolio composition by investment strategy\nAs of December 31, 2024\n($ in millions)\nMarket-\nbased\nPerformance-based\nTotal\nFixed income securities\n$\n52,610 \n$\n137 \n$\n52,747 \nEquity securities\n3,797 \n666 \n4,463 \nMortgage loans, net\n784 \n— \n784 \nLimited partnership interests\n285 \n8,970 \n9,255 \nShort-term investments\n4,537 \n— \n4,537 \nOther investments, net\n137 \n687 \n824 \nTotal\n$\n62,150\n \n$\n10,460\n \n$\n72,610\n \nPercent to total\n85.6\n \n%\n14.4\n \n%\n100.0\n \n%\nUnrealized net capital gains and losses\nFixed income securities\n$\n(867)\n$\n(2)\n$\n(869)\nLimited partnership interests\n— \n— \n— \nShort-term investments\n(2)\n— \n(2)\nOther investments\n(2)\n— \n(2)\nTotal\n$\n(871)\n$\n(2)\n$\n(873)\nDuring 2024, strategic actions focused on optimizing portfolio yield, risk and return in the evolving market and macroeconomic environment. The sustained higher market yields provided an opportunity to increase risk-adjusted returns, so we extended the fixed income portfolio duration to 5.3 years (including the effect of interest rate derivatives and any call features associated with the securities) during 2024 from 4.8 years as of December 31, 2023. We increased public equity securities by $2.05 billion in 2024. \nThe Allstate Corporation      63\n2024 Form 10-K\n \nInvestments\nFixed income securities\nFixed income securities by type\nFair value as of December 31,\n($ in millions)\n2024\n2023\nU.S. government and agencies\n$\n11,108 \n$\n8,619 \nMunicipal\n8,842 \n6,006 \nCorporate\n30,192 \n31,205 \nForeign government\n1,364 \n1,290 \nAsset-backed securities (“ABS”)\n1,241 \n1,745 \nTotal fixed income securities\n$\n52,747\n \n$\n48,865\n \nFixed income securities are rated by third-party credit rating agencies or are internally rated. The Securities Valuation Office (“SVO”) of the National Association of Insurance Commissioners (“NAIC”) evaluates the fixed income securities of insurers for regulatory reporting and capital assessment purposes. The NAIC assigns securities to one of six credit quality categories defined as “NAIC designations”. In general, securities with NAIC designations of 1 and 2 are considered investment grade and securities with NAIC designations of 3 through 6 are considered below investment grade. The rating is either received from the SVO based on availability of applicable ratings from rating agencies on the NAIC Nationally Recognized Statistical Rating Organizations provider list, including Moody’s Investors Service (“Moody’s”), S&P Global Ratings (“S&P”), Fitch Ratings (“Fitch”) or a comparable internal rating.\nAs a result of time lags between the funding of investments, the finalization of legal documents, and the completion of the SVO filing process, the portfolio includes certain securities that have not yet been designated by the SVO as of each balance sheet date and the categorization of these securities is based on the expected ratings indicated by internal analysis\n.\nAs of December 31, 2024, 91.3% of the consolidated fixed income securities portfolio was rated investment grade. Credit ratings below these designations are considered lower credit quality or below investment grade, which includes high yield bonds. \nMarket prices for certain securities may have credit spreads which imply higher or lower credit quality than the current third-party rating. Our initial investment decisions and ongoing monitoring procedures for fixed income securities are based on a due diligence process which includes, but is not limited to, an assessment of the credit quality, sector, structure and liquidity risks of each issuer.\nFixed income portfolio monitoring is a\n \ncomprehensive process to identify and evaluate each fixed income security that may require a credit loss allowance. The process includes a quarterly review of all securities to identify instances where the fair value of a security compared to its amortized cost is below internally established thresholds. For further detail on our fixed income portfolio monitoring process, see Note 6 of the consolidated financial statements.\n64      www.allstate.com\n2024 Form 10-K  \nInvestments\nThe following table presents total fixed income securities by the applicable NAIC designation and comparable S&P rating.\nFair value and unrealized net capital gains (losses) for fixed income securities by credit rating\nDecember 31, 2024\nNAIC 1\nNAIC 2\nNAIC 3\nA and above\nBBB\nBB\n($ in millions)\nFair\nvalue\nUnrealized gain (loss)\nFair\nvalue\nUnrealized gain (loss)\nFair\nvalue\nUnrealized gain (loss)\nU.S. government and agencies\n$\n11,108 \n$\n(315)\n$\n— \n$\n— \n$\n— \n$\n— \nMunicipal\n8,709 \n(143)\n131 \n(2)\n— \n— \nCorporate\nPublic\n6,089 \n(29)\n14,529 \n(299)\n525 \n(8)\nPrivately placed\n1,769 \n(22)\n3,315 \n(56)\n2,427 \n(19)\nTotal corporate\n7,858\n \n(51)\n17,844\n \n(355)\n2,952\n \n(27)\nForeign government\n1,364 \n12 \n— \n— \n— \n— \nABS\n1,138 \n1 \n22 \n— \n27 \n— \nTotal fixed income securities\n$\n30,177\n \n$\n(496)\n$\n17,997\n \n$\n(357)\n$\n2,979\n \n$\n(27)\nNAIC 4\nNAIC 5-6\nTotal\nB\nCCC and lower\nFair\nvalue\nUnrealized gain (loss)\nFair\nvalue\nUnrealized gain (loss)\nFair\nvalue\nUnrealized gain (loss)\nU.S. government and agencies\n$\n— \n$\n— \n$\n— \n$\n— \n$\n11,108 \n$\n(315)\nMunicipal\n— \n— \n2 \n2 \n8,842 \n(143)\nCorporate\nPublic\n84 \n(1)\n6 \n— \n21,233 \n(337)\nPrivately placed\n1,337 \n(2)\n111 \n(2)\n8,959 \n(101)\nTotal corporate\n1,421\n \n(3)\n117\n \n(2)\n30,192\n \n(438)\nForeign government\n— \n— \n— \n— \n1,364 \n12 \nABS\n1 \n— \n53 \n14 \n1,241 \n15 \nTotal fixed income securities\n$\n1,422\n \n$\n(3)\n$\n172\n \n$\n14\n \n$\n52,747\n \n$\n(869)\nMunicipal bonds\n, including tax-exempt and taxable securities, include general obligations of state and local issuers and revenue bonds.\nOur practice for acquiring and monitoring municipal bonds is predominantly based on the underlying credit quality of the primary obligor. We currently rely on the primary obligor to pay all contractual cash flows and are not relying on bond insurers for payments.\nCorporate bonds\n include publicly traded and privately placed securities. Privately placed securities primarily consist of corporate issued senior debt securities that are negotiated with the borrower or are issued by entities in unregistered form under SEC Rule 144A which allows purchasers to more easily resell these securities under certain conditions.\nOur $8.96 billion portfolio of privately placed securities, primarily 144A bonds, is diversified by issuer, industry sector and country. The portfolio is made up of 544 issuers. Privately placed corporate obligations may contain structural security features such as financial covenants and call protections that provide investors greater protection against credit deterioration, reinvestment risk or fluctuations in interest rates than those typically found in publicly registered debt securities. Additionally, investments in these securities are made after fundamental analysis of issuers and sectors along with macro and asset class views. Ongoing monitoring includes continuous assessment of \noperating performance and financial position. Every issue not rated by an independent rating agency is internally rated with a formal rating affirmation at least once a year. $91 million of the portfolio is internally rated as of December 31, 2024. Liquidity of securities issued by public entities in unregistered form is similar to public debt markets.\nOur corporate bond portfolio includes $4.49 billion of below investment grade bonds, $3.88 billion of which are privately placed, primarily 144A bonds. These securities are diversified by issuer and industry sector. The below investment grade corporate bonds portfolio is made up of 356 issuers. We employ fundamental analyses of issuers and sectors along with macro and asset class views to identify investment opportunities. This results in a portfolio with broad exposure to the high yield market with an emphasis on idiosyncratic positions reflective of our views of market conditions and opportunities.\nForeign government securities\n consist of Canadian governmental and provincial securities (all of which are held by our Canadian companies).\nABS\n are structured securities that are primarily collateralized by consumer or corporate borrowings and residential and commercial real estate loans. The cash flows from the underlying collateral paid to the securitization trust are generally applied in a pre-determined order and are designed so that each \nThe Allstate Corporation      65\n2024 Form 10-K\n \nInvestments\nsecurity issued by the trust, typically referred to as a “class”, qualifies for a specific original rating.\nABS includes collateralized debt obligations, consumer and other ABS. Credit risk is managed by monitoring the performance of the underlying collateral. Many of the securities in the ABS portfolio have credit enhancement with features such as overcollateralization, subordinated structures, reserve funds, guarantees or insurance. ABS also includes\n \nresidential mortgage-backed securities and commercial mortgage-backed securities. \nThe payment priority and class subordination included in these securities serves as credit enhancement for holders of the senior or top portions of the structures. These securities continue to retain the payment priority features that existed at the origination of the securitization trust. Other forms of credit enhancement may include structural features embedded in the securitization trust, such as overcollateralization, excess spread and bond insurance. The underlying collateral may contain fixed interest rates, variable interest rates (such as adjustable-rate mortgages), or both fixed and variable rate features.\nEquity securities\n of $4.46 billion primarily include common stocks, exchange traded and mutual funds, non-redeemable preferred stocks and real estate investment trust (“REIT”) equity investments. Certain exchange traded and mutual funds have fixed income securities as their underlying investments.\nMortgage loans\n of $784 million comprise loans secured by first mortgages on developed commercial real estate of $723 million and residential mortgage loans of $61 million. Key considerations used to manage our exposure include property type and geographic diversification. For further detail on our mortgage loan portfolio, see Note 6 of the consolidated financial statements.\nLimited partnership interests\n include $7.73 billion of interests in private equity funds, $1.24 billion of interests in real estate funds and $285 million of interests in other funds as of December 31, 2024. We have commitments to invest additional amounts in limited partnership interests totaling $3.35 billion as of December 31, 2024. \nPrivate equity limited partnerships by sector\n(% of carrying value)\nDecember 31, 2024\nIndustrial\n21.6 \n%\nHealthcare\n13.0 \nInformation technology\n12.2 \nConsumer discretionary\n12.0 \nCommunication services\n7.7 \nOther\n33.5 \nTotal\n100.0\n \n%\nReal estate limited partnerships by sector\n(% of carrying value)\nDecember 31, 2024\nIndustrial\n30.7 \n%\nData centers\n23.2 \nResidential\n13.6 \nHealthcare\n12.5 \nConsumer staples\n5.3 \nOther\n14.7 \nTotal\n100.0\n \n%\nShort-term investments\n of $4.54 billion primarily comprise money market funds, commercial paper, U.S. Treasury bills, fixed income securities with a contractual maturity of one year or less at time of acquisition and other short-term investments, including securities lending collateral of $1.77 billion.\nOther investments \nprimarily comprise $201 million of bank loans, $620 million of real estate and $2 million of derivatives as of December 31, 2024. For further detail on our use of derivatives, see Note 8 of the consolidated financial statements.\nDirect real estate investments by sector\n(% of carrying value)\nDecember 31, 2024\nAgriculture\n32.4 \n%\nResidential\n28.7 \nIndustrial\n17.4 \nRetail\n14.0 \nOffice\n7.3 \nOther\n0.2 \nTotal\n100.0\n \n%\nUnrealized net capital gains (losses)\nAs of December 31,\n($ in millions)\n2024\n2023\nU.S. government and agencies\n$\n(315)\n$\n(5)\nMunicipal\n(143)\n(43)\nCorporate\n(438)\n(746)\nForeign government\n12 \n4 \nABS\n15 \n6 \nFixed income securities\n(869)\n(784)\nShort-term investments\n(2)\n(1)\nDerivatives\n(2)\n(2)\nEquity method of accounting (“EMA”) limited partnerships\n— \n(4)\nInvestments classified as held for sale\n(110)\n— \nUnrealized net capital gains and losses, pre-tax\n$\n(983)\n$\n(791)\n66      www.allstate.com\n2024 Form 10-K  \nInvestments\nGross unrealized gains (losses) on fixed income securities by type and sector\nAs of December 31, 2024\nAmortized cost, net\nGross unrealized\nFair value\n($ in millions)\nGains\nLosses\nCorporate\nBanking\n$\n4,194 \n$\n38 \n$\n(63)\n$\n4,169 \nBasic industry\n833 \n6 \n(21)\n818 \nCapital goods\n2,706 \n25 \n(62)\n2,669 \nCommunications\n2,364 \n16 \n(73)\n2,307 \nConsumer goods (cyclical and non-cyclical)\n6,674 \n51 \n(165)\n6,560 \nEnergy\n2,771 \n32 \n(50)\n2,753 \nFinancial services\n2,104 \n17 \n(53)\n2,068 \nTechnology\n2,613 \n18 \n(94)\n2,537 \nTransportation\n815 \n7 \n(19)\n803 \nUtilities\n5,125 \n56 \n(89)\n5,092 \nOther\n431 \n6 \n(21)\n416 \nTotal corporate fixed income portfolio\n30,630\n \n272\n \n(710)\n30,192\n \nU.S. government and agencies\n11,423 \n15 \n(330)\n11,108 \nMunicipal\n8,985 \n33 \n(176)\n8,842 \nForeign government\n1,352 \n22 \n(10)\n1,364 \nABS\n1,226 \n19 \n(4)\n1,241 \nTotal fixed income securities\n$\n53,616\n \n$\n361\n \n$\n(1,230)\n$\n52,747\n \nGross unrealized gains (losses) on fixed income securities by type and sector\nAs of December 31, 2023\nAmortized cost, net\nGross unrealized\nFair value\n($ in millions)\nGains\nLosses\nCorporate\nBanking\n \n$\n4,189 \n$\n31 \n$\n(135)\n$\n4,085 \nBasic industry\n1,007 \n7 \n(42)\n972 \nCapital goods\n2,800 \n33 \n(97)\n2,736 \nCommunications\n2,767 \n33 \n(115)\n2,685 \nConsumer goods (cyclical and non-cyclical)\n6,813 \n93 \n(251)\n6,655 \nEnergy\n2,645 \n35 \n(63)\n2,617 \nFinancial services\n2,111 \n17 \n(88)\n2,040 \nTechnology\n2,800 \n21 \n(153)\n2,668 \nTransportation\n1,104 \n13 \n(45)\n1,072 \nUtilities\n5,330 \n109 \n(123)\n5,316 \nOther\n385 \n5 \n(31)\n359 \nTotal corporate fixed income portfolio\n31,951\n \n397\n \n(1,143)\n31,205\n \nU.S. government and agencies\n8,624 \n114 \n(119)\n8,619 \nMunicipal\n6,049 \n109 \n(152)\n6,006 \nForeign government\n1,286 \n17 \n(13)\n1,290 \nABS\n1,739 \n13 \n(7)\n1,745 \nTotal fixed income securities\n$\n49,649\n \n$\n650\n \n$\n(1,434)\n$\n48,865\n \nIn general, the gross unrealized losses are related to an increase in market yields, which may include increased risk-free interest rates and wider credit spreads since the time of initial purchase. Similarly, gross unrealized gains reflect a decrease in market yields since the time of initial purchase.\nThe Allstate Corporation      67\n2024 Form 10-K\n \nInvestments\nEquity securities by sector\n($ in millions)\nDecember 31, 2024\nDecember 31, 2023\nCost\nOver (under) cost\nFair value\nCost\nOver (under) cost\nFair value\nBanking\n$\n119 \n$\n41 \n$\n160 \n$\n30 \n$\n38 \n$\n68 \nBasic industry\n39 \n(2)\n37 \n9 \n2 \n11 \nCapital goods\n201 \n(23)\n178 \n77 \n(27)\n50 \nConsumer goods\n462 \n(25)\n437 \n89 \n17 \n106 \nEnergy\n88 \n1 \n89 \n32 \n3 \n35 \nFinancial services\n332 \n6 \n338 \n210 \n12 \n222 \nFunds\n   Equities\n1,077 \n22 \n1,099 \n258 \n12 \n270 \n   Fixed income\n764 \n(14)\n750 \n1,038 \n(15)\n1,023 \n   Other\n75 \n(2)\n73 \n58 \n5 \n63 \n       Total funds\n1,916\n \n6\n \n1,922\n \n1,354\n \n2\n \n1,356\n \nREITs\n159 \n17 \n176 \n179 \n21 \n200 \nTechnology\n746 \n88 \n834 \n138 \n50 \n188 \nUtilities\n92 \n1 \n93 \n59 \n1 \n60 \nOther \n(1)\n175 \n24 \n199 \n67 \n48 \n115 \nTotal equity securities\n$\n4,329\n \n$\n134\n \n$\n4,463\n \n$\n2,244\n \n$\n167\n \n$\n2,411\n \n(1)\n \nOther is comprised of transportation and communications sectors.\nNet investment income\nFor the years ended December 31,\n($ in millions)\n2024\n2023\n2022\nFixed income securities\n$\n2,298 \n$\n1,761 \n$\n1,255 \nEquity securities\n77 \n75 \n132 \nMortgage loans\n36 \n35 \n33 \nLimited partnership interests\n600 \n499 \n985 \nShort-term investments\n290 \n253 \n82 \nOther investments\n106 \n169 \n162 \nInvestment income, before expense\n3,407\n \n2,792\n \n2,649\n \nInvestment expense\nInvestee level expenses\n(61)\n(79)\n(68)\nSecurities lending expense\n(103)\n(93)\n(30)\nOperating costs and expenses\n(151)\n(142)\n(148)\nTotal investment expense\n(315)\n(314)\n(246)\nNet investment income\n$\n3,092\n \n$\n2,478\n \n$\n2,403\n \nProperty-Liability\n$\n2,810 \n$\n2,218 \n$\n2,190 \nProtection Services\n94 \n73 \n48 \nAllstate Health and Benefits\n100 \n82 \n69 \nCorporate and Other\n88 \n105 \n96 \nNet investment income\n$\n3,092\n \n$\n2,478\n \n$\n2,403\n \nMarket-based\n$\n2,728 \n$\n2,219 \n$\n1,566 \nPerformance-based\n679 \n573 \n1,083 \nInvestment income, before expense\n$\n3,407\n \n$\n2,792\n \n$\n2,649\n \nNet investment income\n increased 24.8% or $614 million in 2024 compared to 2023, primarily due to higher results for both the market-based and performance-based strategies. Market-based investment results continue to benefit from portfolio repositioning into higher yielding fixed income securities and higher investment balances.\n68      www.allstate.com\n2024 Form 10-K  \nInvestments\nPerformance-based investment income\nFor the years ended December 31, \n($ in millions)\n2024\n2023\n2022\nPrivate equity\n$\n583 \n$\n414 \n$\n798 \nReal estate\n96 \n159 \n285 \nTotal performance-based income before investee level expenses\n$\n679\n \n$\n573\n \n$\n1,083\n \nInvestee level expenses\n \n(1)\n(61)\n(74)\n(59)\nTotal performance-based income\n$\n618\n \n$\n499\n \n$\n1,024\n \n(1)\nInvestee level expenses include asset level operating expenses on directly held real estate and other consolidated investments reported in investment expense. \nPerformance-based investment income\n increased 23.8% or $119 million in 2024 compared to 2023, primarily due to private equity valuation increases offset by lower real estate investment results, inclusive of investee level expenses.\nPerformance-based investment results and income can vary significantly between periods and are influenced by economic conditions, equity market \nperformance, comparable public company earnings multiples, capitalization rates, operating performance of the underlying investments and the timing of asset sales. The company typically employs a lag in recording and recognizing changes in valuations of limited partnership interests due to the availability of investee financial statements.\nComponents of net gains (losses) on investments and derivatives and the related tax effect\nFor the year December 31,\n($ in millions)\n2024\n2023\n2022\nSales\n$\n(160)\n$\n(433)\n$\n(832)\nCredit losses \n(1)\n(146)\n(99)\n(54)\nValuation change of equity investments - appreciation (decline):\nEquity securities\n78 \n239 \n(772)\nEquity fund investments in fixed income securities\n4 \n43 \n(128)\nLimited partnerships \n(2)\n13 \n34 \n(160)\nTotal valuation of equity investments\n95\n \n316\n \n(1,060)\nValuation change and settlements of derivatives\n(14)\n(84)\n874 \nNet gains (losses) on investments and derivatives, pre-tax\n(225)\n(300)\n(1,072)\nIncome tax benefit\n46 \n63 \n230 \nNet gains (losses) on investments and derivatives, after-tax\n$\n(179)\n$\n(237)\n$\n(842)\nProperty-Liability \n(1)\n$\n(181)\n$\n(230)\n$\n(688)\nProtection Services\n(11)\n— \n(40)\nAllstate Health and Benefits\n(4)\n2 \n(35)\nCorporate and Other\n17 \n(9)\n(79)\nNet gains (losses) on investments and derivatives, after-tax\n$\n(179)\n$\n(237)\n$\n(842)\nMarket-based \n(1)\n$\n(307)\n$\n(352)\n$\n(1,083)\nPerformance-based\n82 \n52 \n11 \nNet gains (losses) on investments and derivatives, pre-tax\n$\n(225)\n$\n(300)\n$\n(1,072)\n(1)\n2024 includes $123 million loss related to the carrying value of the surplus notes issued by Adirondack Insurance Exchange and New Jersey Skylands Insurance Association (together “Reciprocal Exchanges”). See Note 9 for further details.\n(2)\nRelates to limited partnerships where the underlying assets are predominately public equity securities.\nNet losses on investments and derivatives\n in 2024 related primarily to losses on sales of fixed income securities and a loss recognized related to surplus notes issued by the Reciprocal Exchanges, partially offset by valuation gains on equity investments. Net losses on investments and derivatives in 2023 related primarily to losses on sales of fixed income securities, partially offset by valuation gains on equity investments.\nNet losses on sales\n \nin 2024 and 2023 related primarily to sales of fixed income securities in connection with ongoing portfolio management.\nNet losses on valuation change and settlements of derivatives \nof $14 million in 2024 primarily related to net losses on rate futures used to manage duration and equity futures used to manage equity exposure, partially offset by gains on foreign currency contracts used to manage foreign currency risk. Net losses in 2023 primarily related to net losses on equity futures used to manage equity exposure, losses on credit default swaps used to reduce credit risk and losses on foreign currency contracts used to manage foreign currency risk.\nThe Allstate Corporation      69\n2024 Form 10-K\n \nInvestments\nNet gains (losses) on performance-based investments and derivatives\nFor the years ended December 31, \n($ in millions)\n2024\n2023\n2022\nSales\n$\n33 \n$\n76 \n$\n29 \nCredit losses\n(32)\n(68)\n(30)\nValuation change of equity investments\n48 \n58 \n(35)\nValuation change and settlements of derivatives\n33 \n(14)\n47 \nTotal performance-based\n$\n82\n \n$\n52\n \n$\n11\n \nNet gains on performance-based investments and derivatives\n in 2024 primarily related to increased valuation of equity investments, gains on sales and valuation change and settlements of derivatives, partially offset by credit losses. 2023 primarily related to gains on sales and increased valuation of equity investments, partially offset by increased credit losses.\n70      www.allstate.com\n2024 Form 10-K  \nMarket Risk\nMarket Risk\nMarket risk is the risk that we will incur losses due to adverse changes in interest rates, credit spreads, equity prices, commodity prices or foreign currency exchange rates. Adverse changes to these rates and prices may occur due to changes in fiscal policy, inflation, the economic climate, the liquidity of a market or market segment, insolvency or financial distress of key market makers or participants or changes in market perceptions of credit worthiness or risk tolerance. Our primary market risk exposures are to changes in interest rates, credit spreads and equity prices, and to a lesser extent, foreign currency exchange rates. We also have direct and indirect exposure to commodity price changes through our diversified investments in agriculture, infrastructure and energy primarily held in limited partnership interests and consolidated subsidiaries.\nThe active management of market risk is integral to our results of operations. We may use the following approaches to manage exposure to market risk within defined tolerance ranges: \n1)\nRebalance existing asset or liability portfolios\n2)\nChange the type of investments purchased in the future \n3)\nUse derivative instruments to modify the market risk characteristics of existing assets and liabilities or assets expected to be purchased\nOverview\n  In formulating and implementing guidelines for investing funds, we seek to earn attractive risk-adjusted returns that enhance our ability to offer competitive prices to customers while contributing to stable profits and long-term capital growth. Accordingly, our investment decisions and objectives are informed by underlying risks. Investment policies define the overall framework for managing market and other investment risks, including accountability and controls over risk management activities. Subsidiaries that conduct investment activities follow policies that have been approved by their respective boards of directors and which specify the investment limits and strategies that are appropriate given the liquidity, surplus, product profile and regulatory requirements of the subsidiary. Executive oversight of investment activities is conducted primarily through the subsidiaries’ boards of directors and legal entity investment committees. The Enterprise Risk and Return Council (“ERRC”) oversees the aggregate risk of Allstate and its subsidiaries. Working in conjunction with the board or the investment committee of each subsidiary, as applicable, the ERRC evaluates the risk tolerance of each subsidiary and determines the aggregate risk tolerance of the enterprise.\nWe use widely accepted quantitative and qualitative approaches to measure, monitor and manage market risk. We evaluate our market risk exposure using multiple measures including but not limited to:\n•\n \nDuration,\n a measure of the price sensitivity of assets and liabilities to changes in interest rates\n•\n \n \nValue-at-risk,\n a statistical estimate that the change in fair value of a portfolio will exceed a certain amount over a given time horizon, at a specified probability\n•\n \nScenario analysis,\n an estimate of the potential changes in the fair value of a portfolio that could occur under hypothetical market conditions defined by changes to multiple market risk factors: interest rates, credit spreads, equity prices or currency exchange rates\n•  \nSensitivity analysis,\n an estimate of the potential changes in the fair value of a portfolio that could occur using hypothetical shocks to a market risk factor  \nThe selection of measures used in our sensitivity analysis should not be construed as our prediction of future market events, but only as an illustration of the potential effect of such an event\n In general, we establish investment portfolio asset allocation and market risk limits based upon a combination of these measures. The asset allocation limits place restrictions on the total funds that may be invested within an asset class. Comprehensive day-to-day management of market risk within defined tolerance ranges occurs as portfolio managers buy and sell within their respective markets based upon the acceptable boundaries established by investment policies. Although we apply a similar overall philosophy to market risk, the underlying business frameworks and the accounting and regulatory environments may differ between our products and therefore affect investment decisions and risk parameters. Our actual experience may differ from the results of the sensitivity measurements provided below.\nInterest rate risk\n is the risk that we will incur a loss due to adverse changes in risk-free interest rates. This risk arises from many of our primary activities, as we invest substantial funds in interest-sensitive assets. Changes in interest rates can have favorable and unfavorable effects on our results. For example, increases in rates can improve investment income, but decrease the fair value of our fixed income securities portfolio which may result in sales of assets at losses. Decreases in rates could increase the fair value of our fixed income securities portfolio while decreasing future investment income due to reinvestment at lower market yields and accelerated pay-downs and prepayments of certain investments.\nFor our issued debt, we monitor market interest rates and evaluate refinancing opportunities as maturity dates approach. To mitigate this risk, we ladder the maturity dates of our debt. For our issued noncumulative perpetual preferred stock, we monitor market dividend rates and evaluate opportunities to redeem or refinance on or after specified dates. For further detail regarding our debt and our preferred stock, see Note 14 of the consolidated financial statements and the Capital Resources and Liquidity section of this Item.\nThe Allstate Corporation      71\n2024 Form 10-K\n \nMarket Risk\nOur assessment of interest rate risk reflects the effect of changing risk-free interest rates on interest-sensitive assets, including investments with callable or prepayable features. As of December 31, 2024, the fixed income portfolio duration, including the effects of interest rate derivatives, was 5.3 compared to 4.8 as of December 31, 2023.\nChange in fair value of interest-sensitive assets \n(1)\nAs of December 31,\n($ in millions)\n2024\n2023\n-100 bps interest rate change\n$\n2,996 \n$\n2,530 \n+100 bps interest rate change\n(2,765)\n(2,314)\n+200 bps interest rate change\n(5,298)\n(4,410)\n(1)\nIncludes the effects of interest rate derivatives. \nCredit spread risk\n is the risk that we will incur a loss due to adverse changes in credit spreads (“spreads”). A credit spread is the additional yield on fixed income securities and loans above the risk-free rate that market participants require to compensate them for assuming credit, liquidity or prepayment risks. This risk arises from many of our primary activities, as we invest substantial funds in spread-sensitive fixed income assets.\nOur assessment of credit spread risk reflects the effect of changing credit spreads on spread-sensitive assets, including investments with callable or prepayable features. As of December 31, 2024 and 2023, the spread duration\n(1)\n was 4.7.\nChange in fair value of spread-sensitive assets\n (1)\nAs of December 31,\n($ in millions)\n2024\n2023\n+100 bps credit spread change\n$\n(2,118)\n$\n(1,898)\n(1)\nIncludes the effects of credit derivatives.\nEquity price risk\n is the risk that we will incur losses due to adverse changes in the levels of equity indices, the value of individual stocks, or private market valuations related to our limited partnership interests.\nWe periodically use derivatives to reduce equity price risk or to adjust our equity risk profile. Equity derivatives may also be utilized to replicate cash market positions to increase equity exposure. \nEquity investments\n(1)\n  As of December 31, 2024, we held $4.00 billion in equity investments that comprise equity securities, excluding those with fixed income securities as their underlying investments, and including limited partnership interests where the underlying assets are predominately public equity securities, compared to $1.52 billion as of December 31, 2023. \nChange in fair value of equity investments\n (1)\nAs of December 31,\n($ in millions)\n2024\n2023\n-10% change in equity valuations\n$\n(399)\n$\n(127)\n(1)\nIncludes the effects of equity derivatives.\nLimited partnership interests\n \n As of December 31, 2024, we held $8.95 billion in limited partnership interests, excluding those limited partnership interests where the underlying assets are predominately public equity securities, compared to $8.24 billion as of December 31, 2023. These illiquid investments are primarily comprised of private equity and real estate funds, with valuation changes typically reflecting the idiosyncratic performance of the underlying asset.\nChange in fair value of limited partnership \ninterests\nAs of December 31,\n($ in millions)\n2024\n2023\n-10% change in private market valuations\n$\n(895)\n$\n(824)\nFor limited partnership interests, quarterly changes in fair values may not be highly correlated to equity indices in the short term and changes in value of these investments are generally recognized on a three-month delay due to the availability of the related investee financial statements. \nForeign currency exchange rate risk\n is the risk that we will incur economic losses due to adverse changes in foreign currency exchange rates. This risk primarily arises from our foreign equity investments, including common stocks, limited partnership interests, and our Canada, Northern Ireland, Europe and India operations. We use foreign currency derivative contracts to partially offset this risk.\nAs of December 31, 2024, we had $3.74 billion in foreign currency denominated investments, including the effects of foreign currency derivative contracts, and $1.29 billion net investment in our foreign subsidiaries, primarily related to our Canada operations. These amounts were $3.56 billion and $1.25 billion, respectively, as of December 31, 2023. \nChange in fair value of foreign currency denominated investments\nAs of December 31,\n($ in millions)\n2024\n2023\n–10% change in foreign currency exchange rates\n (1)\n$\n(374)\n$\n(356)\n–10% change in net investments in foreign subsidiaries \n(2)\n(129)\n(125)\n(1)\nIncludes the effects of foreign currency derivative contracts and excludes the offset from liabilities in foreign currencies. \n(2)\nIncludes the effects of foreign currency derivative contracts and the offset from liabilities in foreign currencies.\n72      www.allstate.com\n \n2024 Form 10-K  \nCapital Resources and Liquidity\nCapital Resources and Liquidity \nCapital resources \nconsist of shareholders’ equity and debt, representing funds deployed or available to be deployed to support business operations or for general corporate purposes. \nCapital resources\nAs of December 31,\n($ in millions)\n2024\n2023\n2022\nPreferred stock, common stock, treasury stock, retained income and other shareholders’ equity items\n$\n22,331 \n$\n18,470 \n$\n19,880 \nAccumulated other comprehensive income (loss) (“AOCI”)\n(889)\n(700)\n(2,392)\nTotal Allstate shareholders’ equity\n21,442\n \n17,770\n \n17,488\n \nDebt\n8,085 \n7,942 \n7,964 \nTotal capital resources\n$\n29,527\n \n$\n25,712\n \n$\n25,452\n \nRatio of debt to Allstate shareholders’ equity\n37.7 \n%\n44.7 \n%\n45.5 \n%\nRatio of debt to capital resources\n27.4 \n%\n30.9 \n%\n31.3 \n%\nAllstate shareholders’ equity\n increased in 2024, primarily due to net income, partially offset by dividends to shareholders. In 2024, we paid dividends of $962 million and $117 million related to our common and preferred shares, respectively. Allstate shareholders’ equity increased in 2023, primarily due to lower unrealized net capital losses on investments, partially offset by dividends paid to shareholders, common share repurchases and a net loss. In 2023, we paid dividends of $925 million and $107 million related to our common and preferred shares, respectively. \nRepayment of debt  \nOn May 15, 2024, the Company repaid, at maturity, $350 million of 6.75% Senior Notes.\nIssuance of debt  \nOn June 24, 2024, the Company issued $500 million of 5.05% Senior Notes due 2029. Interest on the Senior Notes is payable semi-annually in arrears on June 24 and December 24 of each year, beginning on December 24, 2024. The Senior Notes are redeemable at any time at the applicable redemption price prior to the maturity date. The net proceeds of this issuance were used for general corporate purposes.\nCommon share repurchases  \nOn March 31, 2024, our $5.00 billion share repurchase authorization expired.\nSince 1995, we have acquired 793 million shares of our common stock at a cost of $43.23 billion, primarily as part of various stock repurchase programs. We have reissued 159 million common shares since 1995, primarily associated with our equity incentive plans, the 1999 acquisition of American Heritage Life Investment Corporation and the 2001 redemption of certain mandatorily redeemable preferred securities. Since 1995, total common shares outstanding has decreased by 634 million shares or 70.5%, primarily due to our repurchase programs.\nCommon shareholder dividends\n  On January 2, 2024, April 1, 2024, July 1, 2024 and October 1, 2024, we paid a common shareholder dividend of $0.89, $0.92, $0.92 and $0.92, respectively. On November 14, 2024, we declared a common shareholder dividend of $0.92 payable on January 2, 2025.\nThe Allstate Corporation      73\n2024 Form 10-K\n \nCapital Resources and Liquidity\nFinancial ratings and strength\nSenior long-term debt, commercial paper and insurance financial strength ratings\nAs of December 31, 2024\nMoody’s\nS&P Global Ratings\nA.M. Best\nThe Allstate Corporation (debt)\nA3\nBBB+\na-\nThe Allstate Corporation (short-term issuer)\nP-2\nA-2\nAMB-1\nAllstate Insurance Company (insurance financial strength)\nAa3\nA+\nA+\nOur ratings are influenced by many factors including our operating and financial performance, asset quality, liquidity, overall portfolio mix, financial leverage (i.e., debt), exposure to risks such as catastrophes and the current level of operating leverage. The preferred stock and subordinated debentures are viewed as having a common equity component by certain rating agencies and are given equity credit up to a pre-determined limit in our capital structure as determined by their respective methodologies. These respective methodologies consider the existence of certain terms and features in the instruments such as the noncumulative dividend feature in the preferred stock.\nThe Allstate Corporation (the “Corporation”) and Allstate Insurance Company (“AIC”)\n  In May 2024, S&P affirmed the Corporation’s senior debt and short-term issuer ratings of BBB+ and A-2, respectively, and AIC’s insurance financial strength rating of A+. The outlook for the ratings is stable.\nIn August 2024, A.M. Best affirmed the Corporation’s senior debt and short-term issuer ratings of a- and AMB-1, respectively, and AIC’s insurance financial strength rating of A+. The outlook for the ratings is stable.\nIn October 2024, Moody’s affirmed the Corporation’s senior debt and short-term issuer ratings of A3 and P-2, respectively, and AIC’s insurance financial strength rating of Aa3. The outlook for the ratings is negative.\nAmerican Heritage Life (“AHL”)\n  In August 2024, subsequent to the announcement of the pending sale of the employer voluntary benefits business, A.M. Best placed under review with negative implications the insurance financial strength rating of A+ for AHL. \nOther property and casualty companies\n \n We have distinct and separately capitalized groups of subsidiaries licensed to sell property and casualty insurance that maintain separate group ratings. The ratings of these groups are influenced by the risks that relate specifically to each group. Many mortgage companies require property owners to have insurance from an insurance carrier with a secure financial strength rating from an accredited rating agency. \nIn August 2024, A.M. Best downgraded the insurance financial strength rating of A- for the members of Allstate New Jersey Group (Allstate New Jersey Insurance Company, Allstate New Jersey Property and Casualty Insurance Company, Encompass Insurance Company of New Jersey, Encompass Property and Casualty Insurance Company of New Jersey and Esurance Insurance Company of New \nJersey). The outlook for the rating is negative. ANJ writes auto and homeowners insurance in New Jersey, which has a financial strength rating of A’ from Demotech, that was affirmed in December 2024. \nIn August 2024, A.M. Best affirmed the insurance financial strength rating of A+ for North Light, our excess and surplus lines carrier. The outlook for the rating is stable.\nIn August 2024, A.M. Best affirmed the insurance financial strength ratings of B for the members of Castle Key Group (Castle Key Insurance Company, Castle Key Indemnity Company, Encompass Floridian Insurance Company and Encompass Floridian Indemnity Company). The outlook for the ratings is stable. CKIC also has a financial strength rating of A’ from Demotech that was affirmed in December 2024. \nANJ and North Light do not have support agreements with AIC.\nAllstate’s domestic property and casualty and life insurance subsidiaries prepare their statutory-basis financial statements in conformity with accounting practices prescribed or permitted by the insurance department of the applicable state of domicile. Statutory surplus is a measure that is often used as a basis for determining dividend paying capacity, operating leverage and premium growth capacity, and it is also reviewed by rating agencies in determining their ratings.\nThe property and casualty business is comprised of 59 insurance companies as of December 31, 2024, each of which has individual company dividend limitations. As of December 31, 2024, total statutory surplus is $18.64 billion compared to $14.56 billion as of December 31, 2023. Property and casualty subsidiaries surplus was $18.24 billion as of December 31, 2024, compared to $14.25 billion as of December 31, 2023. Our three life, accident and health insurance subsidiaries had surplus of $392 million as of December 31, 2024, compared to $310 million as of December 31, 2023.\nThe NAIC has developed financial relationships or tests known as the Insurance Regulatory Information System to assist state insurance regulators in monitoring the financial condition of insurance companies and identifying companies that require special attention or actions by state insurance regulators. The NAIC analyzes financial data provided by insurance companies using prescribed ratios, each with defined “usual ranges”. Additional regulatory scrutiny may occur if a company’s ratios fall outside the usual ranges for four or more of the ratios.\n74      www.allstate.com\n \n2024 Form 10-K  \nCapital Resources and Liquidity\nLiquidity sources and uses\n \nOur potential sources and uses of funds principally include the following activities below.\nActivities for potential sources of funds\nProperty-\nLiability\nProtection Services\nAllstate Health and Benefits\nCorporate\nand Other\nReceipt of insurance premiums\nü\nü\nü\nRecurring service fees\nü\nü\nü\nContractholder fund deposits\nü\nReinsurance and indemnification program recoveries\nü\nü\nü\nReceipts of principal, interest and dividends on investments\nü\nü\nü\nü\nSales of investments\nü\nü\nü\nü\nFunds from securities lending, commercial paper and line of credit agreements\nü\nü\nIntercompany loans\nü\nü\nü\nü\nCapital contributions from parent \n(1)\nü\nü\nü\nü\nDividends or return of capital from subsidiaries\nü\nü\nü\nü\nTax refunds/settlements\nü\nü\nü\nü\nFunds from periodic issuance of additional securities\nü\nReceipt of intercompany settlements related to employee benefit plans\nü\nFunds from dispositions\nü\n(1)\nCapital support is generally at management’s discretion unless contractual commitments are in place. \nActivities for potential uses of funds\nProperty-\nLiability\nProtection Services\nAllstate Health and Benefits\nCorporate\nand Other\nPayment of claims and related expenses\nü\nü\nPayment of contract benefits, surrenders and withdrawals\nü\nReinsurance cessions and indemnification program payments\nü\nü\nü\nOperating costs and expenses\nü\nü\nü\nü\nPurchase of investments\nü\nü\nü\nü\nRepayment of securities lending, commercial paper and line of credit agreements\nü\nü\nPayment or repayment of intercompany loans\nü\nü\nü\nü\nCapital contributions to subsidiaries\nü\nü\nü\nü\nDividends or return of capital to shareholders/parent company\nü\nü\nü\nü\nTax payments/settlements\nü\nü\nü\nü\nCommon share repurchases\nü\nDebt service expenses and repayment\nü\nPayments related to employee benefit plans\nü\nü\nü\nü\nPayments for acquisitions\nü\nü\nü\nü\nContractual obligations and commitments\n \n We have short-term and long-term contractual obligations and commitments. We manage our short-term liquidity position to ensure the availability of a sufficient amount of liquid assets to extinguish short-term liabilities as they come due in the normal course of business, including utilizing potential sources of liquidity. Long-term obligations include known contractual commitments that require cash needs beyond 12 months.\nShort-term contractual obligations \nare typically settled with cash or short-term investments and \noperating cash flows. Most of these obligations are paid within one year. These include unconditional purchase obligations, other liabilities and accrued expenses, including liabilities for collateral and operating leases, and net unrecognized tax benefits.\nWe actively manage our financial position and liquidity levels in light of changing market, economic, and business conditions. Liquidity is managed at both the entity and enterprise level across the Company and is assessed on both base and stressed level liquidity needs. We believe we have sufficient liquidity to meet these needs. Additionally, we have existing \nThe Allstate Corporation      75\n2024 Form 10-K\n \nCapital Resources and Liquidity\nintercompany agreements in place that facilitate liquidity management across the Company to enhance flexibility. \nAs of December 31, 2024, we held $20.05 billion of cash, U.S. government and agencies fixed income securities, public equity securities and short-term investments, which we would expect to be able to liquidate within one week. In addition, we regularly estimate how much of the total portfolio, which includes high quality corporate fixed income and municipal holdings, can be reasonably liquidated within one quarter. These estimates are subject to considerable uncertainty associated with evolving market conditions. As of December 31, 2024, cash and estimated liquidity available within one quarter, under normal market conditions and at current market prices, was $28.20 billion.\nCertain remote events and circumstances could constrain our liquidity. Those events and circumstances include, for example, a catastrophe resulting in extraordinary losses, a liquidity decrease in securities markets, dramatic changes in security pricing, a cybersecurity breach, a downgrade in our senior long-term debt ratings to non-investment grade status, or a downgrade in AIC’s financial strength ratings. The rating agencies also consider the interdependence of our individually rated entities; therefore, a rating change in one entity could potentially affect the ratings of other related entities.\nThe Corporation is party to an Amended and Restated Intercompany Liquidity Agreement (“Liquidity Agreement”) with certain subsidiaries, which includes, but is not limited to AIC. The Liquidity Agreement allows for short-term advances of funds to be made between parties for liquidity and other general corporate purposes. The Liquidity Agreement does not establish a commitment to advance funds on the part of any party. AIC serves as a lender and borrower, certain other subsidiaries serve only as borrowers, and the Corporation serves only as a lender. The maximum amount of potential funding under each of these agreements is $1.00 billion.\nIn addition to the Liquidity Agreement, the Corporation also has an intercompany loan agreement with certain of its subsidiaries, which includes, but is not limited to, AIC. The amount of intercompany loans available to the Corporation’s subsidiaries is at the discretion of the Corporation. The maximum amount of loans the Corporation will have outstanding to all its eligible subsidiaries at any given point in time is limited to $1.00 billion. The Corporation may use commercial paper borrowings, bank lines of credit and securities lending to fund intercompany borrowings.\nParent company capital capacity\n  At the parent holding company level, we have deployable assets totaling $3.28 billion as of December 31, 2024, primarily comprised of cash and short-term, fixed income and equity securities that are generally saleable within one quarter. The earnings capacity of the operating subsidiaries is the primary source of capital generation for the Corporation.\nThe payment of dividends by AIC to The Allstate Corporation is limited by Illinois insurance law to formula amounts based on statutory net income and statutory surplus, as well as the timing and amount of dividends paid in the preceding twelve months. The maximum amount of dividends that AIC will be able to pay, without prior Illinois Department of Insurance approval, at a given point in time in 2025, based on the greater of 2024 statutory net income or 10% of actual 2024 statutory surplus. This is estimated to be $3.95 billion, less dividends paid during the preceding twelve months measured at that point in time. No dividends were paid in 2024. For the year ended December 31, 2024, the maximum amount of dividends allowed to be paid by AIC was $1.20 billion. Notification and approval of intercompany lending activities are also required by the Illinois Department of Insurance for those transactions that exceed formula amounts based on statutory admitted assets and statutory surplus.\nThese holding company assets and subsidiary dividends provide funds for the parent company’s fixed charges and other corporate purposes. \nThere were intercompany capital transactions in 2024, 2023 and 2022 between the following companies: AIC, Allstate Insurance Holdings, LLC (“AIH”), the Corporation, Allstate Non-Insurance Holdings, Inc. (“ANIHI”) and Allstate Financial Insurance Holdings Corporation (“AFIHC”).\nIntercompany capital transactions\n($ in millions)\n2024\n2023\n2022\nAIC to AIH\n$\n— \n$\n— \n$\n4,203 \nAIH to the Corporation\n— \n— \n4,205 \nANIHI to the Corporation\n325 \n175 \n145 \nAFIHC to the Corporation\n130 \n50 \n112 \nThere were no capital contributions paid by the Corporation to AIC in 2024, 2023 or 2022.\nDividends may not be paid or declared on our common stock and shares of common stock may not be repurchased unless the full dividends for the latest completed dividend period on our preferred stock have been declared and paid or provided for.\nThe terms of our outstanding subordinated debentures also prohibit us from declaring or paying any dividends or distributions on our common or preferred stock or redeeming, purchasing, acquiring, or making liquidation payments on our common stock or preferred stock if we have elected to defer interest payments on the subordinated debentures, subject to certain limited exceptions. In 2024, we did not defer interest payments on the subordinated debentures.\nAdditional resources to support liquidity are as follows:\n•\nThe Corporation and AIC have access to a $750 million unsecured revolving credit facility that is available for short-term liquidity requirements. The maturity date of this facility is November 2027. The facility is fully subscribed among 11 lenders with the largest commitment being $95 million. The commitments of the lenders are several and \n76      www.allstate.com\n \n2024 Form 10-K  \nCapital Resources and Liquidity\nno lender is responsible for any other lender’s commitment if such lender fails to make a loan under the facility. This facility contains an increase provision that would allow up to an additional $500 million of borrowing, subject to the lenders’ commitment. This facility has a financial covenant requiring that we not exceed a 37.5% debt to capitalization ratio as defined in the agreement. This ratio was 20.8% as of December 31, 2024. Although the right to borrow under the facility is not subject to a minimum rating requirement, the costs of maintaining the facility and borrowing under it are based on the ratings of our senior unsecured, unguaranteed long-term debt. There were no borrowings under the credit facility during 2024.\n•\nTo cover short-term cash needs, the Corporation has access to a commercial paper facility with a borrowing capacity limited to any undrawn credit facility balance up to $750 million. The total amount outstanding at any point in time under the combination of the credit facility and the commercial paper program cannot exceed the amount that can be borrowed under the credit facility.\n•\nAs of December 31, 2024, there were no balances outstanding for the credit facility or the commercial paper facility and therefore the remaining borrowing capacity was $750 million under each facility.\n•\nThe Corporation has access to a universal shelf registration statement with the Securities and Exchange Commission that was filed on April 30, 2024 and expires in 2027. We can use this shelf registration to issue an unspecified amount of debt securities, common stock (including 635 million shares of treasury stock as of December 31, 2024), preferred stock, depositary shares, warrants, stock purchase contracts and stock purchase units. The specific terms of any securities we issue under this registration statement will be provided in the applicable prospectus supplements.\nLong-term contractual obligations\nDefined benefit pension plans and other postretirement benefit plans (“OPEB”)  \nPension plan obligations within the next 12 months represent our planned contributions to certain unfunded non-qualified plans where the benefit obligation exceeds the assets. Obligations beyond 12 months are projected based on the average remaining service period using the current underfunded status of the plans. The OPEB plans’ obligations are estimated based on the expected benefits to be paid. See Note 19 of the consolidated financial statements for further information.\nReserves for property and casualty insurance claims and claims expense\n represent estimated amounts necessary to settle all outstanding claims, including claims that have been IBNR as of the balance sheet date.\n E\nstimated timing of payments for reserves is based on our historical experience and our \nexpectation of future payment patterns. The ultimate cost of losses may vary materially from recorded amounts that are our best estimates. See Note 10 of the consolidated financial statements and Application of Critical Accounting Estimates section of the MD&A for further information.\nReserve for future policy benefits and contractholder funds \n We estimate the present value of cash payments to be made to contractholders and policyholders. We are currently making payments for contracts where the timing of a portion or all of the payments has been determined by the contract. Contracts such as voluntary accident and health insurance, interest-sensitive life and traditional life insurance involve payment obligations where a portion or all of the amount and timing of future payments is uncertain. We have estimated the timing of payments related to these contracts based on historical experience and our expectation of future payment patterns. Uncertainties relating to these liabilities include mortality, morbidity, customer lapse and withdrawal activity, estimated additional deposits for interest-sensitive life contracts, and renewal premiums for life policies, which may significantly impact both the timing and amount of future payments. See Note 11 of the consolidated financial statements for further information. \nContractual commitments\n \nrepresent investment commitments such as private placements, limited partnership interests and other loans. Limited partnership interests are typically funded over the commitment period, which is shorter than the contractual expiration date of the partnership and as a result, the actual timing of the funding may vary.\nWe have agreements in place for services we conduct, generally at cost, between subsidiaries relating to insurance, reinsurance, loans and capitalization. All material intercompany transactions have been appropriately eliminated in consolidation. Intercompany transactions among insurance subsidiaries and affiliates have been approved by the appropriate departments of insurance as required.\nFor a more detailed discussion of our off-balance sheet arrangements, see Note 8 of the consolidated financial statements.\nThe Allstate Corporation      77\n2024 Form 10-K\n \nEnterprise Risk and Return Management\nEnterprise Risk and Return Management\nAllstate creates shareholder value while serving customers through a comprehensive risk and return framework. These risks are discussed in more detail in the Risk Factors section of this document.\nWe regularly identify, measure, manage, monitor and report all significant risks and assess likely returns. Major categories of enterprise risk are strategic, insurance, investment, financial, operational and culture.\nAllstate manages these risks through an Enterprise Risk and Return Management (“ERRM”) framework that includes governance, processes, culture, and activities that are performed on an integrated, enterprise-wide basis, following our risk and return principles. Our legal and capital structures are designed to manage capital and solvency on a legal entity basis. Our risk-return \nprinciples define how we operate and guide risk and return decision-making. These principles state that our priority is to maintain a strong foundation by maintaining capital strength, solvency and liquidity, complying with laws, acting with integrity and protecting customers and proprietary information, assets and technology. We strive to build strategic value by continually investing in enhancing our strategic position, creating flexibility to adapt our business model in a changing world and differentiating through innovation. We optimize risk and return through profitable growth, recognizing the value of customer relationships in operating and strategic decisions and developing new business offerings and investment opportunities while managing risk concentrations.\nGovernance \n \nERRM governance includes board oversight, an executive management committee, and enterprise and market-facing business chief risk officers.\n•\nThe Allstate Corporation Board of Directors (“Allstate Board”) has overall responsibility for oversight of management’s design and implementation of Allstate’s ERRM framework, supported by the Audit Committee (“AC”) and the Risk and Return Committee (“RRC”).\n•\nThe RRC of the Allstate Board oversees effectiveness of the ERRM program, governance structure and risk-related decision-making, while focusing on the Company’s aggregate risk profile.\n•\nThe AC oversees the effectiveness of internal controls over financial reporting, disclosure controls and procedures, as well as management’s risk and control and cybersecurity program, and assists the Board in fulfilling certain oversight responsibilities as listed in the committee’s charter.\n78      www.allstate.com\n2024 Form 10-K \nEnterprise Risk and Return Management \n•\nThe ERRC directs ERRM activities by establishing risk and return targets, determining economic capital levels and monitoring integrated strategies and actions from an enterprise risk and return perspective. The ERRC consists of Allstate’s chief executive officer, chief financial officer, chief risk officer, chief legal officer and other senior leaders.\n•\nOther key committees work with the ERRC to direct ERRM activities, including the Operational Risk and Return Council, the Information Security Council, the Internal Compliance and Control Committee, the Environmental, Social, and Governance (“ESG”) Steering Committee, liability governance committees, and investment committees.\nKey risks are assessed and reported through comprehensive ERRM reports prepared for senior management and the RRC. These risk summary reports communicate the alignment of Allstate’s risk profile with risk and return principles, while providing a perspective on risk positioning. Discussion promotes active engagement with management and the RRC. Internal controls over key risks are managed and reported to senior management and the Audit Committee of the Company through a semi-annual risk control dashboard. Annually, we review risks related to the strategic plan, operating plan and incentive compensation programs with the Allstate Board.\nFramework \n \nWe apply risk and return principles using an integrated ERRM framework that focuses on assessment, transparency and dialogue, which provides a comprehensive view of risks and is used by senior management and business managers to drive risk-return based decisions. We continually validate and improve our ERRM practices by benchmarking and obtaining external perspectives.\nManagement and the ERRC utilize internal and external perspectives to determine an appropriate level of target economic capital. Internal perspectives include enterprise solvency and volatility assessments, review of key operating and model assumptions, and management judgment. Sensitivity testing and scenario analysis are used to gauge the robustness of Allstate’s risk, capital and liquidity positions. Analysis of extremely low-frequency scenarios is also used to assess the sufficiency of capital and contingency options under worst-case outcomes, including unlikely but impactful single events, as well as sequences of multiple tail events. External considerations include NAIC risk-based capital as well as S&P’s, Moody’s, and A.M. Best’s capital adequacy measurements. Our economic capital reflects management’s view of the aggregate level of capital necessary to satisfy stakeholder interests, manage Allstate’s risk profile and maintain financial strength. The impact of strategic initiatives on enterprise risk is evaluated through this context.\nThe NAIC has adopted the Risk Management and Own Risk and Solvency Assessment Model Act (“ORSA Model Act”), which has been enacted by our insurance subsidiaries’ domiciliary states. The ORSA Model Act requires that insurers maintain a risk management \nframework and conduct an internal own risk and solvency assessment of the insurer’s material risks in normal and stressed environments. Results of the assessment are filed annually. \nAllstate’s risk appetite is measured through our economic capital framework, which establishes the amount of capital needed to support the current and projected enterprise risk profile and provides a methodology for measuring risk-adjusted returns and optimizing capital allocations. The enterprise risk appetite is cascaded into individual risk limits which set boundaries on the amount of risk we are willing to accept from one specific risk category before escalating for further management discussion and action. Risk limits are established based upon expected returns, volatility, potential tail losses and impact on the enterprise portfolio. To effectively operate within risk limits and for risk-return optimization, Allstate establishes risk limits and capital targets specific to each business unit. Allstate’s risk management strategies adapt to changes in business and market environments.\nProcess \n \nWe establish a basis for transparency and dialogue across the enterprise and for continuous learning by embedding our risk and return management culture of identifying, assessing, managing, monitoring and reporting risks within the organization. Allstate designs business and enterprise strategies that seek to optimize risk-adjusted returns on capital. Risks are managed at both the legal entity and enterprise level.\nMany risk drivers impact more than one of the key risk categories. Examples include risks related to inflation and the impacts of climate change, which span Allstate’s major risk categories. Such risks are managed within Allstate’s integrated ERRM framework and the processes listed below, but the overall strategy is coordinated at the enterprise level, and holistic governance is provided by cross-functional committees such as the ERRC. \nA summary of our process to manage each of our major risk categories follows:\nStrategic risk and return management\n \nencompasses risks and opportunities associated with long-term business planning and strategy setting in the context of the evolving market environment.\nAreas of focus include macroeconomic, regulatory and competitive conditions, as well as customer preferences and behavior, Allstate’s reputation and the continuous enhancement of internal capabilities that allow Allstate to compete effectively in chosen markets. Allstate manages strategic risks in part through Allstate Board and senior management reviews that include risk and return assessment of strategic plans and ongoing monitoring of strategic actions, key assumptions and the broader market environment.\nInsurance risk and return management \nencompasses risks and opportunities associated with Allstate’s insurance activities, including expected trends and unanticipated fluctuations in premiums, \nThe Allstate Corporation      79\n2024 Form 10-K\n \nEnterprise Risk and Return Management\nclaims and future profits. Focus areas include loss frequency and severity trends and scenarios, severe weather and catastrophe exposures and claim handling processes. Allstate uses sophisticated mathematical modeling techniques to measure, monitor and manage associated risk exposures, including stochastic risk estimation and deterministic scenario analysis.\nInvestment risk and return management \nencompasses risks and opportunities associated with Allstate’s investment portfolio. Areas of focus include macroeconomic conditions and potential changes to key variables such as interest rates, credit spreads and equity price levels, as well as specific factors that may impact the returns associated with individual investments. Changes in such factors drive daily volatility in the valuations of portfolio holdings and could cause permanent impairments of capital due to credit defaults and equity write-downs.\nInvestment risk exposures are measured and monitored using tools such as sensitivity analysis, stochastic risk estimation and deterministic scenario analysis, which together are used to assess investment portfolio risk characteristics and how the investment portfolio contributes to the enterprise risk profile.\nFinancial risk and return management \naddresses the sufficiency of capital and cash flow liquidity to meet enterprise, subsidiary and policyholder needs. We actively manage associated risks and opportunities in light of changing market, economic and business conditions using modeling frameworks and tools that assess potential sources and uses of capital and liquidity and help ensure strategic and financial flexibility.\nWe generally assess solvency on a statutory accounting basis, but also consider holding company capital and liquidity needs. Capital at the insurance companies significantly exceeds regulatory risk-based capital requirements and capital levels at the parent holding company provide liquidity and financial flexibility to meet enterprise requirements.\nOperational risk and return management\n \nencompasses risks and opportunities associated with Allstate’s interconnected systems of people, processes and technology. Representative areas of focus include talent, privacy, regulatory compliance, ethics, fraud, system availability, cybersecurity, data quality, disaster recovery and business continuity.\nAssociated risks are managed using an integrated Operational Risk and Return Management framework anchored to the ERRM Learning Loop, a continual process which includes risk identification, measurement, management, monitoring, and reporting.\nCulture risk and return management\n \naddresses risks and opportunities associated with company culture, which we define as our self-sustaining system of shared values, principles and priorities that shape beliefs, drive behavior and influence decision-making. Allstate’s approach to culture risk and return management is grounded in risk and return principles and organized by Our Shared Purpose, targeting continual alignment of culture with the company’s mission, values, operating standards and behaviors.\nBoth operational and culture risk and return measurements and reviews are shared with key stakeholders and governance committees throughout the year.\n80      www.allstate.com\n2024 Form 10-K  \nApplication of Critical Accounting Estimates \nApplication of Critical Accounting Estimates\nThe preparation of financial statements in conformity with GAAP requires management to adopt accounting policies and make estimates and assumptions that affect amounts reported in the consolidated financial statements. The most critical estimates, presented in the order they appear in the Consolidated Statements of Financial Position, include those used in determining:\n•\nFair value of financial assets\n•\nImpairment of fixed income securities with credit losses\n•\nEvaluation of goodwill\n•\nReserve for property and casualty insurance claims and claims expense estimation\n•\nPension and other postretirement plans net costs and assumptions\nIn making these determinations, management makes subjective and complex judgments that frequently require estimates about matters that are inherently uncertain. Many of these policies, estimates and related judgments are common in the insurance and financial services industries; others are specific to our businesses and operations. It is reasonably likely that changes in these estimates could occur from period to period and result in a material impact on our consolidated financial statements.\nA summary of each of these critical accounting estimates follows. For a more detailed discussion of the effect of these estimates on our consolidated financial statements, and the judgments and assumptions related to these estimates, see the referenced sections of this document. For a more detailed summary of our significant accounting policies, see the notes to the consolidated financial statements.\nFair value of financial assets\n \n \nFair value is defined as the price that would be received to sell an asset or paid to transfer a liability in an orderly transaction between market participants at the measurement date. We are responsible for the determination of fair value of financial assets and the supporting assumptions and methodologies. We use independent third-party valuation service providers, broker quotes and internal pricing methods to determine fair values. We utilize one quote or price to value each financial instrument in our financial statements.\nValuation service providers typically obtain data about market transactions and other key valuation model inputs from multiple sources and, through the use of proprietary models, produce valuation information in the form of a single fair value for individual fixed income and other securities for which a fair value has been requested under the terms of our agreements. The inputs used by the valuation service providers include, but are not limited to, market prices from recently completed transactions and transactions of comparable securities, interest rate yield curves, \ncredit spreads, liquidity spreads, currency rates, and other information, as applicable. Credit and liquidity spreads are typically implied from completed transactions and transactions of comparable securities. Valuation service providers also use proprietary discounted cash flow models that are widely accepted in the financial services industry and similar to those used by other market participants to value the same financial instruments. The valuation models take into account, among other things, market observable information (as described above) as of the measurement date, as well as the specific attributes of the security being valued including its term, interest rate, credit rating, industry sector, and where applicable, collateral quality and other issue or issuer specific information. Executing valuation models effectively requires seasoned professional judgment and experience. For certain equity securities, valuation service providers provide market quotations for completed transactions on the measurement date. In cases where market transactions or other market observable data is limited, the extent to which judgment is applied varies inversely with the availability of market observable information.\nFor certain of our financial assets measured at fair value, where our valuation service providers cannot provide fair value determinations, we obtain a single non-binding price quote from a broker familiar with the security who, similar to our valuation service providers, may consider transactions or activity in similar securities among other information. The brokers providing price quotes are generally from the brokerage divisions of financial institutions with market making, underwriting and distribution expertise regarding the security subject to valuation.\nThe fair value of certain financial assets, including privately placed corporate fixed income securities and free-standing derivatives, for which our valuation service providers or brokers do not provide fair value determinations, is developed using valuation methods and models widely accepted in the financial services industry. Our internal pricing methods are primarily based on models using discounted cash flow methodologies that develop a single best estimate of fair value. Our models generally incorporate inputs that we believe are representative of inputs other market participants would use to determine fair value of the same instruments, including yield curves, quoted market prices of comparable securities or instruments, published credit spreads, and other applicable market data as well as instrument-specific characteristics that include, but are not limited to, coupon rates, expected cash flows, sector of the issuer, and call provisions. Because judgment is required in developing the fair values of these financial assets, they may differ from the amount actually received to sell an asset in an orderly transaction between market participants at the measurement date. Moreover, the use of different valuation assumptions may have a material effect on the financial assets’ fair values.\nFor most of our financial assets measured at fair value, all significant inputs are based on or \nThe Allstate Corporation      81\n2024 Form 10-K\n \n \nApplication of Critical Accounting Estimates\ncorroborated by market observable data, and significant management judgment does not affect the periodic determination of fair value. The determination of fair value using discounted cash flow models involves management judgment when significant model inputs are not based on or corroborated by market observable data. However, where market observable data is available, it takes precedence, and as a result, no range of reasonably likely inputs exists from which the basis of a sensitivity analysis could be constructed.\nWe gain assurance that our financial assets are appropriately valued through the execution of various processes and controls designed to ensure the overall reasonableness and consistent application of valuation methodologies, including inputs and assumptions, and compliance with accounting standards. For fair values received from third parties or internally estimated, our processes and controls are designed to ensure that the valuation methodologies are appropriate and consistently applied, the inputs and assumptions are reasonable and consistent with the objective of determining fair value, and the fair values are accurately recorded. For example, on a continuing basis, we assess the reasonableness of individual fair values that have stale security prices or that exceed certain thresholds as compared to previous fair values received from valuation service providers or brokers or derived from internal models. We perform procedures to understand and assess the methodologies, processes and controls of valuation service providers. In addition, we may validate the reasonableness of fair \nvalues by comparing information obtained from valuation service providers or brokers to other third-party valuation sources for selected securities. We perform ongoing price validation procedures such as back-testing of actual sales, which corroborate the various inputs used in internal models to market observable data. When fair value determinations are expected to be more variable, we validate them through reviews by members of management who have relevant expertise and who are independent of those charged with executing investment transactions.\nDuring periods of high volatility or market disruption, we may perform an analysis to determine whether there has been a significant decrease in the volume and level of activity for the asset when compared to normal market activity, and if so, whether transactions may not be orderly. Among the indicators we consider in determining whether a significant decrease in the volume and level of market activity for a specific asset has occurred include the level of new issuances in the primary market, trading volume in the secondary market, level of credit spreads over historical levels, bid-ask spread, and price consensuses among market participants and sources. If evidence indicates that prices are based on transactions that are not orderly, we place little, if any, weight on the transaction price and will estimate fair value using an internal model. As of December 31, 2024 and 2023, we did not adjust fair values provided by our valuation service providers or brokers or substitute them with an internal model for such securities.\nFixed income, equity securities and short-term investments by source of fair value determination\nDecember 31, 2024\n($ in millions)\nFair value\nPercent \nto total\nFair value based on internal sources\n$\n563 \n0.9 \n%\nFair value based on external sources \n(1)\n61,184 \n99.1 \nTotal\n$\n61,747\n \n100.0\n \n%\n(1)\nIncludes $129 million that are valued using broker quotes and $341 million that are valued using quoted prices or quoted net asset values from deal sponsors.\nFor additional detail on fair value measurements, see Note 7 of the consolidated financial statements.\nImpairment of fixed income securities with credit losses \n \nFor fixed income securities classified as available-for-sale, the difference between amortized cost, net of credit loss allowance (“amortized cost, net”) and fair value, net of certain other items and deferred income taxes (as disclosed in Note 6 of the consolidated financial statements), is reported as a component of AOCI on the Consolidated Statements of Financial Position and is not reflected in the operating results of any period until reclassified to net income upon the consummation of a transaction with an unrelated third party or when a credit loss allowance is recorded. We have a comprehensive portfolio monitoring process to identify and evaluate each fixed income security that may require a credit loss allowance.\nFor each fixed income security in an unrealized loss position, we assess whether management with the \nappropriate authority\n \nhas made the decision to sell or whether it is more likely than not we will be required to sell the security before recovery of the amortized cost basis for reasons such as liquidity, contractual or regulatory purposes. If a security meets either of these criteria, any existing credit loss allowance would be written-off against the amortized cost basis of the asset along with any remaining unrealized losses, with the incremental losses recorded in earnings.\nIf we have not made the decision to sell the fixed income security and it is not more likely than not we will be required to sell the fixed income security before recovery of its amortized cost basis, we evaluate whether we expect to receive cash flows sufficient to recover the entire amortized cost basis of the security. We calculate the estimated recovery value based on the best estimate of future cash flows considering past events, current conditions and reasonable and supportable forecasts. The estimated future cash flows are discounted at the security’s current effective rate and are compared to the amortized cost of the \n82      www.allstate.com\n2024 Form 10-K  \nApplication of Critical Accounting Estimates \nsecurity. The determination of cash flow estimates is inherently subjective, and methodologies may vary depending on facts and circumstances specific to the security. All reasonably available information relevant to the collectability of the security are considered when developing the estimate of cash flows expected to be collected. That information generally includes, but is not limited to, as applicable, the remaining payment terms of the security, prepayment speeds, the financial condition and future earnings potential of the issue or issuer, expected defaults, expected recoveries, the value of underlying collateral, origination vintage year, geographic concentration of underlying collateral, available reserves or escrows, current subordination levels, third-party guarantees and other credit enhancements. Other information, such as industry analyst reports and forecasts, sector credit ratings, and other market data relevant to the realizability of contractual cash flows, may also be considered. The estimated fair value of collateral will be used to estimate recovery value if we determine that the security is dependent on the liquidation of collateral for ultimate settlement.\nIf we do not expect to receive cash flows sufficient to recover the entire amortized cost basis of the fixed income security, a credit loss allowance is recorded in earnings for the shortfall in expected cash flows; however, the amortized cost, net of the credit loss allowance, may not be lower than the fair value of the security. The portion of the unrealized loss related to factors other than credit remains classified in AOCI. If we determine that the fixed income security does not have sufficient cash flow or other information to estimate a recovery value for the security, we may conclude that the entire decline in fair value is deemed to be credit related and the loss is recorded in earnings.\nWhen a security is sold or otherwise disposed or the security is deemed uncollectible and written off, we reverse amounts previously recognized in the credit loss allowance. Recoveries after write-offs are recognized when received.\nFor additional detail on investment impairments, see Note 6 of the consolidated financial statements.\nEvaluation of goodwill \nGoodwill represents the excess of amounts paid for acquiring businesses over the fair value of the net assets acquired, less any impairment of goodwill recognized. Goodwill is recognized when acquired and allocated to reporting units based on which unit is expected to benefit from the synergies of the business combination. Our goodwill reporting units are equivalent to our reportable segments to which goodwill has been assigned: Allstate Protection, Protection Services, and Allstate Health and Benefits. \nThe goodwill balance was $3.25 billion at December 31, 2024 and $3.50 billion at December 31, 2023. The decrease was related to the reclassification of goodwill as held for sale as of December 31, 2024 due to the pending sale of the employer voluntary benefits business.\nUpon acquisition, the purchase price of the acquired business is assumed to be its fair value. Subsequently, we estimate the fair value of our businesses in each goodwill reporting unit, utilizing a combination of widely accepted valuation techniques including a stock price and market capitalization analysis, discounted cash flow (“DCF”) calculations and an estimate of a business’s fair value using market to book multiples derived from peer company analysis. The stock price and market capitalization analysis take into consideration the quoted market price of our outstanding common stock and includes a control premium, derived from relevant historical acquisition activity, in determining the estimated fair value of the consolidated entity before allocating that fair value to individual reporting units. The DCF analysis utilizes long term assumptions for revenues, investment income, benefits, claims, other operating expenses and income taxes to produce projections of both income and cash flows available for dividends that are present valued using the weighted average cost of capital. Market to book multiples represent the mean market to book multiple for selected peer companies with operations similar to each goodwill reporting unit to which the multiple is applied. The outputs from these methods are weighted based on the nature of the business and the relative amount of market observable assumptions supporting the estimates. The computed values are then weighted to reflect the fair value estimate based on the specific attributes of each goodwill reporting unit.\nEstimating the fair value of reporting units is a subjective process that involves the use of significant estimates by management. Changes in market inputs or other events impacting the fair value of these businesses, including discount rates, operating results, investment returns, strategies and growth rate assumptions, among other factors, could result in goodwill impairments, resulting in a charge to income. Certain of our goodwill reporting units are comprised of a combination of legacy and acquired businesses and as a result have substantial internally generated and unrecognized intangibles and fair values that significantly exceed their carrying values. \nChanges in our growth assumptions, including the risk of loss of key customers in the Protection Services segment, or adverse changes in discount rates could result in a decline in fair value and result in a goodwill impairment charge.\nReserve for property and casualty insurance claims and claims expense estimation \n \nReserves are established to provide for the estimated costs of paying claims and claims expenses under insurance policies we have issued. These reserves are an estimate of amounts necessary to settle all outstanding claims, including estimates of all expenses associated with processing and settling incurred claims as of the financial statement date. \n Allstate Protection’s current period claims are typically reported promptly with relatively little lag between the date of occurrence and the date the loss is reported. Auto and homeowners liability losses \nThe Allstate Corporation      83\n2024 Form 10-K\n \n \nApplication of Critical Accounting Estimates\ngenerally take an average of about two years to settle, while auto physical damage, homeowners property and other personal lines generally have an average settlement time of less than one year. Liability losses, especially those involving litigation, can take many years to resolve. Run-off Property-Liability involves long-tail losses, such as those related to asbestos and environmental claims, which often involve substantial reporting lags and extended times to settle.\nEstimating the ultimate cost of claims and claims expenses is an inherently uncertain and complex process involving a high degree of judgment and is subject to the evaluation of numerous variables. Underwriting results are significantly influenced by estimates of property and casualty insurance claims and claims expense reserves.  \nThe actuarial methods used to develop reserve estimates\n \n Reserve estimates are derived by using several different actuarial estimation methods that are variations on one primary actuarial technique known as a “chain ladder” estimation process. In this process, historical loss patterns are applied to actual paid losses and reported losses (paid losses plus individual case reserves established by claim adjusters) for an accident year or a report year to create an estimate of how losses are likely to develop over time. \nIn the chain ladder estimation technique, development factors are calculated which compare current period results to results in the prior period for each accident year or report year. The effects of inflation are implicitly considered in the reserving process, as development factors use historic data that incorporates inflation from recent prior periods in estimating future loss costs. The estimation methodology may require modification when data changes due to changing claim reporting practices, changing claim settlement patterns, external regulatory or financial influences, or contractual coverage changes. Changes in such items and inflation can result in increased variability in loss costs and reserve estimates. Actuarial judgment is then applied to develop a best estimate of gross ultimate losses. These developments are discussed further in the loss ratio disclosures within the Allstate Protection Segment and the Reserve for Property and Casualty Insurance Claims and Claims Expense sections of the MD&A. See the Run-off Property-Liability reserve estimates section for specific disclosures of industry and actuarial best practices for this segment.\nHow reserve estimates are established and updated\n \nReserve estimates are developed at a detailed level, and the results are aggregated to form a consolidated reserve estimate. The detailed estimates include each line of insurance, major components of losses (such as coverages and perils), major states or groups of states and for reported losses and IBNR. The significant lines of business are auto, homeowners, and other personal lines for Allstate Protection, and asbestos, environmental, and other run-off lines for Run-off Property-Liability. Reserves are established for each business segment and line of business, independently of business segment management.\nDevelopment factors are calculated for data elements such as claim counts reported and settled, paid losses, and paid losses combined with case reserves. The historical development patterns for these data elements are used to calculate reserve estimates. Based on this review, our best estimate of required reserves is recorded.\nReserves are reestimated quarterly and periodically throughout the year, by combining historical results with current actual results to calculate new development factors. This process continuously incorporates the historic and latest actual trends, and other underlying changes in the data elements used to calculate reserve estimates. New development factors are likely to differ from previous development factors used in prior reserve estimates because actual results occur differently than the assumptions contained in the previous development factor calculations. When actual development of these data elements is different than the historical development pattern used in a prior period reserve estimate, a new reserve is determined. The difference between indicated reserves based on new reserve estimates and recorded reserves (the previous estimate) is the amount of reserve reestimate. This amount, which could be material and vary significantly from period to period, is recognized as an increase or decrease in Property and casualty insurance claims and claims expense in the Consolidated Statements of Operations. \nA more detailed discussion of reserve reestimates is presented in the Reserve for Property and Casualty Insurance Claims and Claims Expense section of the MD&A.\n84      www.allstate.com\n2024 Form 10-K  \nApplication of Critical Accounting Estimates \nNet reserves by segment and line of business \nAs of December 31,\n($ in millions)\n2024\n2023\n2022\nAllstate Protection\nAuto\n$\n23,076 \n$\n21,286 \n$\n19,365 \nHomeowners\n4,520 \n4,754 \n3,520 \nOther lines \n(1)\n4,250 \n3,929 \n3,991 \nTotal Allstate Protection\n31,846\n \n29,969\n \n26,876\n \nRun-off Property-Liability\nAsbestos\n774 \n804 \n811 \nEnvironmental\n259 \n267 \n267 \nOther run-off lines\n381 \n373 \n373 \nTotal Run-off Property-Liability\n1,414\n \n1,444\n \n1,451\n \nTotal Protection Services\n55\n \n49\n \n38\n \nTotal net reserves\n$\n33,315\n \n$\n31,462\n \n$\n28,365\n \n(1)\nIncludes the unamortized fair value adjustment related to the acquisition of National General.\nReserve reestimates \n($ in millions)\n2024\n2023\n2022\nReserve reestimates, after-tax \n(1) \n$\n(243)\n$\n434 \n$\n1,375 \nPercentage impact on net income (loss) applicable to common shareholders - favorable (unfavorable)\n5.3 \n%\nNM\n(98.6)\n%\n(1)\nFavorable reserve reestimates are shown in parentheses.\n3-year average of net reserve reestimates as a percentage of total reserves for its segment \n(1) (2)\n2024\nAllstate Protection\n1.9 \n%\nRun-off Property-Liability\n6.5 \n(1)\nFavorable reserve reestimates are shown in parentheses.\n(2)\nEach of these results is consistent within a reasonable actuarial tolerance for the respective businesses.\nAllstate Protection reserve estimate\nFactors affecting reserve estimates  \nGenerally, the initial reserves for a new accident year or report year are established based on actual claim frequency and severity assumptions for different business segments, lines and coverages based on historical relationships to relevant inflation indicators. Reserves for prior accident years are statistically determined using processes described above. These estimates are considered in conjunction with known facts and interpretations of circumstances, including our experience with similar cases, actual claims paid, historical trends involving claim payment patterns and pending levels of unpaid claims, loss management programs, product mix and contractual terms, changes in laws and regulations, judicial decisions, and economic conditions.\n Changes in auto claim frequency may result from changes in mix of business, driving behaviors, miles driven or other macroeconomic factors. Changes in auto current year claim severity are generally influenced by inflation in the medical and auto repair sectors, changes in attorney represented and litigated claim behavior, the effectiveness and efficiency of our claim settlements and changes in mix of claim types. Injury claims are affected largely by medical inflation, \ntreatment trends, attorney representation and litigation costs while physical damage claims are affected largely by auto repair cost inflation, used car prices, length of claim resolution and the timing of receipt of third-party carrier claims. \nChanges in homeowners current year claim severity are generally influenced by inflation in the cost of building materials, the cost of construction and property repair services, the cost of replacing home furnishings and other contents, the types of claims that qualify for coverage, deductibles, other economic and environmental factors and the effectiveness of our claim practices.\nAs loss experience for the current year develops for each type of loss, it is monitored relative to initial assumptions until it is judged to have sufficient statistical credibility. From that point in time forward, reserves are reestimated using statistical actuarial processes to reflect the impact actual loss trends have on development factors incorporated into the actuarial estimation processes. \nLoss experience and reserve variability are impacted by many factors, including but not limited to:\n•\nSupply chain disruptions and labor shortages, changes in used car prices, labor and part cost increases, unemployment levels, changes in commuting activity and driving behavior have and may continue to lead to historical development trends being less predictive of future loss development, potentially creating additional reserve variability. \n•\nIf a legal change is expected to have a significant impact on the development of claim severity for a coverage which is part of a particular line of insurance in a specific state, judgment is applied to determine appropriate development factors that will most accurately reflect the expected impact on that specific estimate.\n•\nIf a change in economic conditions is expected to affect the cost of repairs to damaged autos or property for a particular line, coverage, or state, actuarial judgment is applied to determine appropriate development factors to use in the \nThe Allstate Corporation      85\n2024 Form 10-K\n \n \nApplication of Critical Accounting Estimates\nreserve estimate that will most accurately reflect the expected impacts on severity development.\nCauses of reserve estimate uncertainty\n  At each reporting date, the highest degree of uncertainty in estimates for most of our losses from ongoing businesses arise from claims remaining to be settled for the current accident year and the most recent preceding accident year. The greatest degree of uncertainty exists in the current accident year because the current accident year contains the greatest proportion of losses that have not been reported or settled as well as heightened uncertainty for claims that involve litigation or take longer to settle during periods of rapidly increasing loss costs but must be estimated as of the current reporting date. Most of these losses relate to damaged property such as automobiles and homes, and medical care for injuries from accidents. During the first year after the end of an accident year, a large portion of the total losses for that accident year are settled. When accident year losses paid through the end of the first year following the initial accident year are incorporated into updated actuarial estimates, the trends inherent in the settlement of claims emerge more clearly. After the second year, the losses that we pay for an accident year typically relate to claims that are more difficult to settle, such as those involving serious injuries or litigation. Private passenger auto insurance provides a good illustration of the uncertainty of future loss estimates: our typical annual percentage payout of reserves remaining at December 31 for an accident year is approximately 50% in the first year after the end of the accident year, 20% in the second year, 10% in the third year, 10% in the fourth year, and the remaining 10% thereafter.\nPotential variability in reserve estimates\n  Reserve estimates, by their nature, are very complex to determine, subject to significant judgment, and represent estimates rather than an exact determination for each outstanding claim, including claims incurred but not reported. Accordingly, as actual claims, paid losses, and case reserve results emerge, our estimate of the ultimate cost to settle will differ from previous estimates.\nThe reserve liability recorded in the Consolidated Statements of Financial Position represents the aggregation of numerous analyses by each business segment, line of insurance, major types of losses (such as coverages and perils), and individual states or groups of states for reported losses and IBNR. Because of this detailed approach to our reserve analysis, there is not a single set of assumptions that determines our reserve estimates at the consolidated level or that management believes can produce a statistically credible or reliable actuarial reserve range that would be meaningful. \nTo develop a statistical measure of potential reserve variability, an actuarial technique (stochastic modeling) is applied to the countrywide data for paid losses combined with case reserves for each of auto liability, auto physical damage, and homeowners insurance excluding catastrophes. Based on the combined historical variability of the development \nfactors calculated for these data elements, an estimate of standard deviation around these reserve estimates is calculated within each accident year for the last twelve years for each type of loss. The variability of these reserve estimates within one standard deviation of the mean (a measure of frequency of dispersion often viewed to be an acceptable level of accuracy) is believed by management to represent a reasonable and statistically probable measure of potential variability.  \nBased on our Allstate brand products and coverages, historical experience, the statistical credibility of our extensive data and stochastic modeling of actuarial methodologies used to develop reserve estimates, we have derived standard deviations and the resulting pre-tax income for Allstate Protection reserves, excluding catastrophe losses, as shown below.\nReserve estimate variability\nDecember 31, 2024\n($ in millions)\nCarried reserves \n(1)\nStandard deviation\nIncome effect, pre-tax\nAuto insurance - liability coverage\n$\n28,800 \n6.5 \n%\n$\n1,872 \nAuto insurance - physical damage coverage\n755 \n15.5 \n117 \nHomeowners insurance\n3,475 \n8.0 \n278 \n(1) \nExcludes reserves related to catastrophes.\nAlthough this evaluation reflects most reasonably likely outcomes, it is possible the final outcome may fall below or above these amounts. Historical variability of reserve estimates is reported in the Reserve for Property and Casualty Insurance Claims and Claims Expense section of the MD&A.\nManagement believes that the reserve for property and casualty insurance claims and claims expense, net of recoverables, is appropriately established in the aggregate and adequate to cover the ultimate net cost of reported and unreported claims arising from losses which had occurred by the date of the Consolidated Statements of Financial Position based on available facts, laws and regulations.\nReserves for catastrophe losses\n \nCatastrophe losses\n \nare an inherent risk of the property and casualty insurance industry that have contributed, and will continue to contribute, to potentially material year-to-year fluctuations in our results of operations and financial position. We define a “catastrophe” as an event that produces pre-tax losses before reinsurance in excess of $1 million and involves multiple first-party policyholders, or a winter weather event that produces a number of claims in excess of a preset, per-event threshold of average claims in a specific area, occurring within a certain amount of time following the event. Catastrophes are caused by various natural events including high winds, winter storms and freezes, tornadoes, hailstorms, wildfires, tropical storms, tsunamis, hurricanes, earthquakes and volcanoes. \n86      www.allstate.com\n2024 Form 10-K  \nApplication of Critical Accounting Estimates \nWe are also exposed to man-made catastrophic events, such as certain types of terrorism, civil unrest, wildfires or industrial accidents. The nature and level of catastrophes in any period cannot be reliably predicted.\nThe estimation of claims and claims expense reserves for catastrophe losses also comprises estimates of losses from reported claims and IBNR, primarily for damage to property. In general, our estimates for catastrophe reserves are based on claim adjuster inspections and the application of historical loss development factors as described above. However, depending on the nature of the catastrophe, the estimation process can be further complicated. \nFor example, for hurricanes, complications could include the inability of insureds to promptly report losses, limitations placed on claims adjusting staff affecting their ability to inspect losses, determining whether losses are covered by our homeowners policy (generally for damage caused by wind or wind-driven rain) or specifically excluded coverage caused by flood, exposure to mold damage, and the effects of numerous other considerations. Additionally, the timing of a catastrophe in relation to other events, such as at or near the end of a financial reporting period, can affect the availability of information needed to estimate reserves for that reporting period. In these situations, we may need to adapt our practices to accommodate these circumstances in order to determine a best estimate of our losses from a catastrophe. \nFor example, to complete estimates for certain areas affected by catastrophes not yet inspected by our claims adjusting staff, or where we believed our historical loss development factors were not predictive, we rely on:\n•\nAnalysis of actual claim notices received compared to total PIF.\n•\nVisual, governmental and third-party information, including aerial photos, using satellites, aircrafts and drones, area observations, and data on wind speed and flood depth to the extent available. \nReserves for Michigan and New Jersey unlimited PIP \n Claims and claims expense reserves include reserves for Michigan unlimited PIP coverage to insureds involved in qualifying motor vehicle accidents. The administration of this program is through the MCCA, a state-mandated, non-profit association of which all insurers actively writing automobile coverage in Michigan are members. \nThe process employed to estimate MCCA covered losses involves a number of activities including the comprehensive review and interpretation of MCCA actuarial reports, other MCCA members’ reports and our PIP loss trends which have increased in severity over time. A significant portion of incurred claim reserves can be attributed to a small number of catastrophic claims and thus a large portion of the recoverable is similarly concentrated. We conduct comprehensive claim file reviews to develop case \nreserve type estimates of specific claims, which inform our view of future claim development and longevity of claimants. Each year, we update the actuarial estimate of our ultimate reserves and recoverables. We report our paid and unpaid claims based on MCCA requirements. The MCCA develops its own reserving estimates based on its own reserve methodologies, which may not align with our estimations. The MCCA does not provide member companies with its estimate of a company’s claim costs. \nWe provide similar PIP coverage in New Jersey for auto policies issued or renewed in New Jersey prior to 1991 that is administered by PLIGA. We use similar actuarial estimating techniques as for the MCCA exposures to estimate loss reserves for unlimited PIP coverage for policies covered by PLIGA. Unlimited coverage was not offered after 1991; therefore, no new claimants are being added.\nReserve estimates are confidential and proprietary and by their nature are very complex to determine and subject to significant judgments. Reserve estimates do not represent an exact determination for each outstanding claim. Claims may be subject to litigation. As actual claims, paid losses and case reserve results emerge, our estimate of the ultimate cost to settle may be materially greater or less than previously estimated amounts. \nFor additional information related to indemnification recoverables, see Item 1 - Regulation, Indemnification Programs and Note 12 of the consolidated financial statements.\nRun-off Property-Liability reserve estimates\n \nCharacteristics of Run-off exposure\n \n \nOur exposure to asbestos, environmental and other run-off claims arise principally from assumed reinsurance coverage written during the 1960s through the mid-1980s, including reinsurance on primary insurance written on large U.S. companies, and from direct excess commercial insurance written from 1972 through 1985, including substantial excess general liability coverages on large U.S. companies. Additional exposure stems from direct primary commercial insurance written during the 1960s through the mid-1980s. Asbestos claims relate primarily to bodily injuries asserted by claimants who were exposed to asbestos or products containing asbestos. Environmental claims relate primarily to pollution and related clean-up costs. Other run-off claims exposures primarily relate to general liability and product liability mass tort claims, such as those for medical devices and other products, workers’ compensation claims and claims for various other coverage exposures other than asbestos and environmental.\nIn 1986, the general liability policy form used by us and others in the property and casualty industry was amended to introduce an “absolute pollution exclusion,” which excluded coverage for environmental damage claims, and to add an asbestos exclusion. Most general liability policies issued prior to 1987 contain annual aggregate limits for product liability coverage. General liability policies issued in 1987 and thereafter contain annual aggregate limits for product \nThe Allstate Corporation      87\n2024 Form 10-K\n \n \nApplication of Critical Accounting Estimates\nliability coverage and annual aggregate limits for all coverages. Our experience to date is that these policy form changes have limited the extent of our exposure to environmental and asbestos claim risks.\nOur exposure to liability for asbestos, environmental and other run-off claims losses manifests differently depending on whether it arises from assumed reinsurance coverage, direct excess commercial insurance or direct primary commercial insurance. Direct excess commercial insurance and reinsurance involve coverage written by us for specific layers of protection above retentions and other insurance plans and largely has resulted in asbestos, environmental and mass tort claims. The nature of excess coverage and reinsurance provided to other insurers limits our exposure to loss to specific layers of protection in excess of policyholder retention on their primary insurance plans. Our exposure is further limited by the significant reinsurance that we had purchased on our direct excess business.\nOur assumed reinsurance business involved writing generally small participations in other insurers’ reinsurance programs. The reinsured losses in which we participate may be a proportion of all eligible losses or eligible losses in excess of defined retentions. Of the majority of our assumed reinsurance exposure, approximately 85% is for excess of loss coverage, while the remaining 15% is for pro-rata coverage.\nOur direct primary commercial insurance business comprises a cross section of policyholders engaged in many diverse business sectors throughout the country and did not include coverage to large asbestos manufacturers.\nHow reserve estimates are established and updated\n \nWe conduct an annual review in the third quarter to evaluate, establish and adjust as necessary, asbestos, environmental and other run-off claims reserves. Changes to reserves are recorded in the reporting period in which they are determined. Using established industry and actuarial best practices and assuming no change in the regulatory or economic environment, this detailed and comprehensive methodology determines asbestos reserves based on assessments of the characteristics of exposure (e.g., claim activity, potential liability, jurisdiction, products versus non-products exposure) presented by individual policyholders, and determines environmental reserves based on assessments of the characteristics of exposure (e.g., environmental damages, respective shares of liability of potentially responsible parties, appropriateness and cost of remediation) to pollution and related clean-up costs. The number and cost of these claims are affected by advertising by trial lawyers seeking asbestos plaintiffs, and entities with asbestos exposure seeking bankruptcy protection as a result of asbestos liabilities, initially causing a delay in the reporting of claims, often followed by an acceleration and an increase in claims and claims expenses as settlements occur.\nAfter evaluating our insureds’ probable liabilities for asbestos, environmental and other run-off claims, we evaluate our insureds’ coverage programs for such \nclaims. We consider our insureds’ total available insurance coverage, including the coverage we issued. We also consider relevant judicial interpretations of policy language and applicable coverage defenses or determinations, if any.\nEvaluation of both the insureds’ estimated liabilities and our exposure to the insureds depends heavily on an analysis of the relevant legal issues and litigation environment. This analysis is conducted by our specialized claims adjusting staff and legal counsel. Based on these evaluations, case reserves are established by claims adjusting staff and actuarial analysis is employed to develop an IBNR reserve, which includes estimated potential reserve development and claims that have occurred but have not been reported. As of December 31, 2024 and 2023, IBNR was 54.0% and 55.7%, respectively, of combined net asbestos and environmental reserves.\nFor both asbestos and environmental reserves, we also evaluate our historical direct net loss and expense paid and incurred experience to assess any emerging trends, fluctuations or characteristics suggested by the aggregate paid and incurred activity. Other run-off claims reserves are based on considerations similar to those described above, as they relate to the characteristics of specific individual coverage exposures.\nPotential reserve estimate variability\n \n Establishing net loss reserves for asbestos, environmental and other run-off claims is subject to uncertainties that are much greater than those presented by other types of property and casualty claims. Among the complications are lack of historical data, long reporting delays, uncertainty as to the number and identity of insureds with potential exposure and unresolved legal issues regarding policy coverage; unresolved legal issues regarding the determination, availability and timing of exhaustion of policy limits; plaintiffs’ evolving and expanding theories of liability; availability and collectability of recoveries from reinsurance; retrospectively determined premiums and other contractual agreements; estimates of the extent and timing of any contractual liability; the impact of bankruptcy protection sought by various asbestos producers and other asbestos defendants; and other uncertainties. \nThere are also complex legal issues concerning the interpretation of various insurance policy provisions and whether those losses are covered, or were ever intended to be covered, and could be recoverable through retrospectively determined premium, reinsurance or other contractual agreements. Courts have reached different and sometimes inconsistent conclusions as to when losses are deemed to have occurred and which policies provide coverage; what types of losses are covered; whether there is an insurer obligation to defend; how policy limits are determined; how policy exclusions and conditions are applied and interpreted; and whether clean-up costs represent insured property damage. \nOur reserves for asbestos, environmental and other run-off exposures could be affected by tort \n88      www.allstate.com\n2024 Form 10-K  \nApplication of Critical Accounting Estimates \nreform, class action litigation, and other potential legislation and judicial decisions. Environmental exposures could also be affected by a change in the existing federal Superfund law and similar state statutes. There can be no assurance that any reform legislation will be enacted or that any such legislation will provide for a fair, effective and cost-efficient system for settlement of asbestos or environmental claims. We believe these issues are not likely to be resolved in the near future, and the ultimate costs may vary materially from the amounts currently recorded resulting in material changes in loss reserves. Due to the uncertainties and factors described above, management believes it is not practicable to develop a meaningful net loss reserve range. Historical variability of reserve estimates is reported in the Property and Casualty Insurance Claims and Claims Expense Reserves section of the MD&A.\nAdequacy of reserve for property and casualty insurance claims and claims expense estimates\nWe believe our net reserves are appropriately established based on available facts, laws and regulations and assessments of other pertinent factors and characteristics of exposure (e.g., claim activity, potential liability, jurisdiction, products versus non-products exposure) presented by individual policyholders, assuming no change in the legal, legislative or economic environment. Additionally, we rely on historical claims experience to inform the level of the recorded reserve. We calculate and record a single best reserve estimate, in conformance with generally accepted actuarial standards and practices, for each line of insurance, its components (coverages and perils) and state, for reported losses and for IBNR losses, and as a result we believe that no other estimate is better than our recorded amount. Due to the uncertainties involved, the ultimate cost of losses may vary materially from recorded amounts, which are based on our best estimates. \nFor further discussion of these estimates and quantification of the impact of reserve estimates, reserve reestimates and assumptions, see Note 10 and Note 16 of the consolidated financial statements and the Reserve for Property and Casualty Insurance Claims and Claims Expense section of the MD&A.\nPension and other postretirement plans net costs and assumptions  \nOur pension and other postretirement benefit costs are calculated using various actuarial assumptions and methodologies. These assumptions include discount rates, health care cost trend rates, inflation, expected returns on plan assets, mortality and other factors. The assumptions utilized in recording the obligations under our defined benefit plans represent our best estimates, and we believe they are reasonable based on information as to historical experience and performance as well as other \nfactors that might cause future expectations to differ from past trends. Approximately 90% of our benefit obligation relates to our U.S. qualified defined benefit pension plan.\nSee Note 19 of the consolidated financial statements for a discussion of our pension and other postretirement benefit plans and their effect on the consolidated financial statements.\nNet costs for our defined benefit plans are recognized on the Consolidated Statements of Operations and consist of two elements: 1) costs comprised of service and interest costs, expected return of plan assets, amortization of prior service credit and curtailment gains and losses which are reported in property and casualty claims and claims expense, operating costs and expenses, net investment income and, if applicable, restructuring and related charges and 2) remeasurement gains and losses comprised of changes in actuarial assumptions and the difference between actual and expected returns on plan assets which are recognized immediately in earnings as part of pension and other postretirement remeasurement gains and losses.\nWe recognize expected returns on plan assets using an unadjusted fair value method. Our policy is to remeasure our pension and postretirement plans on a quarterly basis. We immediately recognize the remeasurement of the benefit obligation and plan assets in earnings as it provides greater transparency of our economic obligations in accounting results and better aligns the recognition of the effects of economic and interest rate changes on pension and other postretirement plan assets and liabilities in the year in which the gains and losses are incurred.\nDifferences in actual experience and changes in other assumptions affect our pension and other postretirement obligations and expenses. Differences between expected and actual returns on plan assets affect remeasurement gains and losses. The primary factors contributing to pension and postretirement remeasurement gains and losses are: 1) changes in the discount rate used to value pension and postretirement obligations as of the measurement date; 2) differences between the expected and the actual return on plan assets; 3) changes in demographic assumptions, including mortality and participant experience; and 4) changes in lump sum interest rates and cash balance interest crediting rates used to value pension obligations as of the measurement date. \nPension and other postretirement service cost, interest cost, expected return on plan assets and amortization of prior service credits are allocated to our reportable segments. The pension and other postretirement remeasurement gains and losses are reported in the Corporate and Other segment.\nThe Allstate Corporation      89\n2024 Form 10-K\n \n \nApplication of Critical Accounting Estimates\nPension and postretirement benefits remeasurement gains and losses\nFor the years ended December 31,\n($ in millions)\n2024\n2023\n2022\nRemeasurement of benefit obligation (gains) losses:\nDiscount rate\n$\n(133)\n$\n104 \n$\n(1,268)\nOther assumptions\n4 \n17 \n(176)\nRemeasurement of plan assets (gains) losses\n92 \n(112)\n1,560 \nRemeasurement (gains) losses\n$\n(37)\n$\n9\n \n$\n116\n \nImpact of assumption changes to net cost for pension and other postretirement plans  \nRemeasurement gains in 2024 primarily related to an increase in the liability discount rate and changes in other assumptions, partially offset by unfavorable asset performance compared to expected return on plan assets. Remeasurement losses in 2023 primarily related to losses on the remeasurement of the projected benefit obligation driven by a decrease in the liability discount rate, partially offset by gains due to favorable asset performance compared to expected return on plan assets.\nThe discount rate is based on rates at which expected pension benefits attributable to past employee service could effectively be settled on a present value basis at the measurement date. We develop the assumed discount rate by utilizing the weighted average yield of a theoretical dedicated portfolio derived from non-callable bonds and callable bonds with a make-whole provision available in the Bloomberg corporate bond universe having ratings of “AA” by S&P or “Aa” by Moody’s on the measurement date with cash flows that match expected plan benefit requirements. Significant changes in discount rates, such as those caused by changes in the credit spreads, yield curve, the mix of bonds available in the market, the duration of selected bonds and expected benefit payments, may result in volatility in pension cost. The weighted average discount rate used to measure the benefit obligation increased to 5.71% on December 31, 2024 compared to 5.35% on December 31, 2023, resulting in remeasurement gains for 2024.\nThe expected long-term rate of return on plan assets reflects the average rate of earnings expected on plan assets. While this rate reflects long-term assumptions and is consistent with long-term historical returns, sustained changes in the market or changes in \nthe mix of plan assets may lead to revisions in the assumed long-term rate of return on plan assets that may result in variability of pension cost. Differences between the actual return on plan assets and the expected long-term rate of return on plan assets are immediately recognized through earnings at each quarterly remeasurement date. Short-term asset performance can differ significantly from the expected rate of return, especially in volatile markets. In 2024, the actual return on plan assets was lower than the expected return primarily due to lower fixed income valuations driven by higher rates, partially offset by higher equity valuations. In 2023, the actual return on plan assets was higher than the expected return primarily due to positive equity returns and higher fixed income valuations from lower interest rates and tighter credit spreads.\nWe complete periodic evaluations of demographic information and historical experience that affects our pension and other postretirement obligations to identify any required changes to long-term actuarial assumptions and methodologies. Demographic assumptions affect both our pension and postretirement plans and include elements such as retirement rates and participation rates in our postretirement programs, among other factors.\nThese actuarial assumption updates affect our pension and other postretirement obligations and are incorporated into our best estimates of these assumptions. Remeasurement losses for other assumptions in 2024 primarily related to an increase in the cash balance interest crediting rate, partially offset by gains from an experience study. Remeasurement losses for other assumptions in 2023 primarily related to a decrease in the long-term lump sum interest rate, partially offset by gains from mortality updates. \nImpact of assumption changes to net periodic pension cost as of December 31, 2024\n($ in millions)\nBasis/percentage point change\nIncrease (decrease) to net cost, pre-tax\nPension plans discount rate\n+100 basis points\n$\n(392)\n-100 basis points\n467 \nExpected long-term rate of return on assets\n+100 basis points\n(41)\n-100 basis points\n41 \n90      www.allstate.com\n \n2024 Form 10-K\nRegulation and Legal Proceedings \nWe are subject to extensive regulation and we are involved in various legal and regulatory actions, all of which have an effect on specific aspects of our business. For a detailed discussion of the legal and regulatory actions in which we are involved, see Note 16 of the consolidated financial statements.\nPending Accounting Standards\nThere are pending accounting standards that we have not implemented because the implementation dates have not yet occurred. For a discussion of these pending standards, see Note 2 of the consolidated financial statements.\nThe effect of implementing certain accounting standards on our financial results and financial condition is often based in part on market conditions at the time of implementation of the standard and other factors we are unable to determine prior to implementation. For this reason, we are sometimes unable to estimate the effect of certain pending accounting standards until the relevant authoritative body finalizes these standards or until we implement them.",
  "item2": null
}