{
  "item1": "Allstate Corporation incorporated under laws State Delaware November 5, 1992, serve holding company Allstate Insurance Company. Its business conducted principally through Allstate Insurance Company other subsidiaries (collectively, including Allstate Corporation, “Allstate”). Allstate Corporation one largest publicly held personal lines insurers United States. Allstate’s strategy increase market share personal property-liability broaden protection offerings.",
  "item7": "Item 7. Management’s Discussion Analysis Financial Condition Results Operations Run-off Property-Liability Reserve Property Casualty Insurance Claims Claims Expense Allstate Health Benefits Capital Resources Liquidity Enterprise Risk Return Management Application Critical Accounting Estimates Regulation Legal Proceedings Pending Accounting Standards following discussion highlights significant factors influencing consolidated financial position results operations Allstate Corporation (referred document “we,” “our,” “us,” “Company” “Allstate”). should read conjunction consolidated financial statements related notes found under Item 8. contained herein.",
  "item2": "increased 13.1% $534 million third quarter 2025 increased 15.4% $1.66 billion first nine months 2025 compared same periods 2024, primarily due following factors: Higher Allstate brand average premiums implemented rate increases inflation insured home replacement costs other aging factor adjustments, combined policies force growth nine months ended September 30, 2025, rate increases 8.0% implemented 44 locations, resulting total estimated insurance premium impact 4.3%, excluding impact changes insured home replacement costs PIF increased 2.1% 159 thousand 7,642 thousand September 30, 2025 compared September 30, 2024, primarily direct exclusive agency channels, partially offset independent agency channel Increased new issued applications direct exclusive agency channels not writing new homeowners business Florida. also non-renewing certain policies Florida. may not able grow certain states without regulatory legislative reforms enable customers provided coverage appropriate risk adjusted returns. Homeowners premium measures statistics threshold average claims specific area, occurring within certain amount time following event."
}