{
  "item1": "BUSINESS Allegion plc (\"Allegion,\" \"we,\" \"us\" \"the Company\") leading global provider security products solutions keep people assets safe secure places they live, learn, work connect. pioneer safety security create safer more accessible world. Central work partnering developing ecosystems create flawless, seamless access experiences enable uninterrupted secure flow people assets. offer extensive versatile portfolio security access control security products solutions across range market-leading brands.",
  "item7": "Determining costs obligations associated defined benefit plans dependent various actuarial assumptions including discount rates, expected returns plan assets, employee mortality turnover rates. Changes any assumptions can impact net periodic pension benefit cost. estimated 0.5% rate decline discount rate would increased net periodic pension benefit cost approximately $0.4 million 2024, while 0.5% rate decline estimated return assets would increased net periodic pension benefit cost approximately $2.2 million. further details defined benefit plan activity, see Note 12 Consolidated Financial Statements.",
  "item2": "Item 2 – Management’s Discussion Analysis Financial Condition Results Operations Allegion plc its consolidated subsidiaries (\"Allegion,\" \"the Company\", \"we,\" \"our,\" \"us\") leading global provider security products solutions operating two segments: Allegion Americas Allegion International. sell wide range security products solutions end-users commercial, institutional residential facilities worldwide, including education, healthcare, government, hospitality, retail, commercial office single multi-family residential markets. leading brands include CISA®, Interflex®, LCN®, Schlage®, SimonsVoss® Von Duprin®. Business Industry Trends Outlook third quarter 2025, delivered low-double digit revenue growth compared same period 2024, driven favorable pricing volume growth Allegion Americas Allegion International segments, well impact acquisitions made during year."
}