{
  "source_file": "alle-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2 – Management’s Discussion and Analysis of Financial Condition and Results of Operations\nThe following Management’s Discussion and Analysis of Financial Condition and Results of Operations contains forward-looking statements that involve risks and uncertainties. Our actual results may differ materially from the results discussed in the forward-looking statements. Factors that may cause a difference include, but are not limited to, those discussed under Part I, Item 1A – Risk Factors in the Annual Report on Form 10-K for the fiscal year ended December 31, 2024. The following section is qualified in its entirety by the more detailed information, including our Condensed and Consolidated Financial Statements and the notes thereto, which appears elsewhere in this Quarterly Report.\nOverview\nOrganization\nAllegion plc and its consolidated subsidiaries (\"Allegion,\" \"the Company\", \"we,\" \"our,\" or \"us\") are a leading global provider of security products and solutions operating in two segments: Allegion Americas and Allegion International. We sell a wide range of security products and solutions for end-users in commercial, institutional and residential facilities worldwide, including the education, healthcare, government, hospitality, retail, commercial office and single and multi-family residential markets. Our leading brands include CISA®, Interflex®, LCN®, Schlage®, SimonsVoss® and Von Duprin®.\nRecent Developments\nBusiness and Industry Trends and Outlook\nIn the third quarter of 2025, we delivered low-double digit revenue growth compared to the same period in 2024, driven by favorable pricing and volume growth in the Allegion Americas and Allegion International segments, as well as the impact from acquisitions made during the year.\nDemand for electronic security products has also remained strong and continues to be a long-term growth driver. Macroeconomic conditions in our International markets remain mixed.\nGlobal Trade and Macroeconomic Environment\nThroughout 2025, the U.S. government announced tariffs on imports from several countries from which we manufacture and/or import products and components. Through the nine months ended September 30, 2025, we have offset inflation due to tariffs with pricing actions. We continue to analyze the impact of changes in tariffs and what, if any, steps, including pricing actions, we may take to mitigate the impact of the tariffs. We estimate we source approximately 20-25% of cost of goods sold (\"COGS\") from Mexico, less than 5% of COGS from China, and 5-10% of COGS from all other non-US countries. Additionally, this could impact future demand.\nAcquisitions\nThe following acquisitions were completed during the nine months ended September 30, 2025:\nOn February 4, 2025, we, through our subsidiaries, acquired Next Door Company (\"Next Door\"), a global provider of security products and solutions based in the United States. Next Door is reported in the Allegion Americas segment.\nOn March 1, 2025, we, through our subsidiaries, acquired Lemaar Pty Ltd (\"Lemaar\"), a global provider of security products and solutions based in Australia. Lemaar is reported in the Allegion International segment.\nOn April 2, 2025, we, through our subsidiaries, acquired 100% of Trimco Hardware (\"Trimco\"), a manufacturer of high-performance and custom-designed architectural hardware primarily sold for commercial and institutional markets based in the United States. Trimco is reported in the Allegion Americas segment.\nOn June 2, 2025, we, through our subsidiaries, acquired 100% of Nova Hardware Pty Ltd (\"Novas\"), an architectural door hardware company based in Australia. Novas is reported in the Allegion International segment.\nOn July 1, 2025, we, through our subsidiaries, acquired 100% of ELATEC, including Elatec GmbH and other group entities (\"ELATEC\"). ELATEC is a leading manufacturer of security and access technology based in Germany. This acquisition helps the Company expand its global electronics portfolio in attractive end markets while also increasing strategic relationships with channel partners. The closing purchase price of the acquisition was €330.0 million (approximately $389.0 million), subject to customary working capital adjustments. We used cash on hand and borrowings under the Revolving Facility to finance the acquisition. ELATEC is reported in the Allegion International segment.\nOn July 2, 2025, we, through our subsidiaries, acquired 100% of Gatewise Inc. (“Gatewise\"), a provider of smart access control solutions in the U.S. multifamily marketplace based in the United States. Gatewise is reported in the Allegion Americas segment.\n20\nTable of Contents\nOn July 7, 2025, we, through our subsidiaries, acquired 100% of Waitwhile Inc. (“Waitwhile\"), a software-as-a-service provider that specializes in cloud-based appointment scheduling and queue management based in the United States. Waitwhile is reported in the Allegion Americas segment.\nOn August 1, 2025, we, through our subsidiaries, acquired 100% of UAP Group Limited (“UAP\"), a securities solutions provider based in the United Kingdom. UAP is reported in the Allegion International segment.\nOn August 12, 2025, we, through our subsidiaries, acquired 100% of Brisant Secure Limited (“Brisant\"), a security hardware provider based in the United Kingdom. Brisant is reported in the Allegion International segment.\n2025 Dividends and Share Repurchases\nDuring the nine months ended September 30, 2025, we paid dividends of $1.53 per ordinary share to shareholders and repurchased approximately 0.6 million shares for $80.0 million.\nResults of Operations – Three months ended September 30\nIn millions, except per share amounts\n2025\n% of\nrevenues\n2024\n% of\nrevenues\nNet revenues\n$\n1,070.2 \n$\n967.1 \nCost of goods sold\n580.4 \n54.3 \n%\n535.0 \n55.4 \n%\nSelling and administrative expenses\n256.0 \n23.9 \n%\n217.1 \n22.4 \n%\nOperating income\n233.8 \n21.8 \n%\n215.0 \n22.2 \n%\nInterest expense\n26.6 \n28.8 \nOther income, net\n(1.7)\n(8.4)\nEarnings before income taxes\n208.9 \n194.6 \nProvision for income taxes\n20.5 \n20.4 \nNet earnings \n188.4 \n174.2 \nDiluted net earnings per ordinary share:\n$\n2.18 \n$\n1.99 \nThe discussions that follow describe the significant factors contributing to the changes in our results of operations for the periods presented and form the basis used by management to evaluate the financial performance of the business.\nNet Revenues\nNet revenues for the three months ended September 30, 2025, increased by 10.7%, or $103.1 million, compared with the same period in 2024, due to the following:\nPricing\n4.0 \n%\nVolume\n1.9 \n%\nAcquisitions / divestitures\n3.9 \n%\nCurrency exchange rates\n0.9 \n%\nTotal\n10.7 \n%\nThe increase in Net revenues was driven by improved pricing, favorable impact from acquisitions/divestitures, higher volumes, and favorable foreign currency exchange rate movements.\nPricing includes increases or decreases of price, including discounts, surcharges and/or other sales deductions, on our existing products and services. Volume includes increases or decreases of revenue due to changes in unit volume of existing products and services, as well as new products and services.\n21\nTable of Contents\nOperating Income/Margin\nOperating income for the three months ended September 30, 2025, increased $18.8 million compared to the same period in 2024. Operating margin, which we define as Operating income as a percentage of total Net revenues, for the three months ended September 30, 2025, decreased to 21.8% from 22.2% for the same period in 2024, due to the following:\nIn millions\nOperating Income\nOperating Margin\nSeptember 30, 2024\n$\n215.0 \n22.2 \n%\nPricing and productivity in excess of inflation and investment spending\n2.2 \n(0.6)\n%\nVolume / product mix\n12.7 \n0.9 \n%\nAcquisitions / divestitures\n7.0 \n(0.2)\n%\nCurrency exchange rates\n1.7 \n— \n%\nAcquisition / integration / restructuring expenses\n(4.8)\n(0.5)\n%\nSeptember 30, 2025\n$\n233.8 \n21.8 \n%\nThe increase in Operating income was driven by favorable volume/product mix, the favorable impact from acquisitions/divestitures, pricing and productivity improvements in excess of inflation and investment spending, and favorable foreign currency exchange rate movements, inclusive of transactional currency gains and losses. These increases were partially offset by higher acquisition, integration and restructuring expenses.\nThe decrease in Operating margin was driven by inflation and investment spending in excess of pricing and productivity, higher acquisition, integration and restructuring expenses, and the unfavorable impact on operating margin from acquisitions/divestitures. These decreases were partially offset by favorable volume/product mix.\nInflation and investment spending in excess of pricing and productivity includes the impact to both Operating income and Operating margin from pricing, as defined above, in addition to productivity, inflation and investment spending. Productivity represents improvements in unit costs of materials, cost reductions related to improvements to our manufacturing design and processes and reductions in selling and administrative expenses due to productivity projects. Inflation includes both unit costs for the current period compared to the average actual cost for the prior period, multiplied by current year volumes, and current period costs of ongoing selling and administrative functions compared to the same ongoing expenses in the prior period. Expenses related to increased head count for strategic initiatives, new facilities or other significant spending for strategic initiatives or new product and channel development, are captured in investment spending. \nVolume/product mix represents the impact to both Operating income and Operating margin due to increases or decreases of revenue due to changes in unit volume, including new products and services, including the effect of changes in the mix of products and services sold on Cost of goods sold.\nInterest Expense\nInterest expense for the three months ended September 30, 2025, decreased $2.2 million compared with the same period in 2024, primarily due to lower outstanding indebtedness compared to the same period in the prior year.\nOther Income, net\nThe components of Other income, net for the three months ended September 30 were as follows:\nIn millions\n2025\n2024\nInterest income\n$\n(2.5)\n$\n(8.3)\nForeign currency exchange loss\n1.2 \n(0.5)\nOther (income) expense\n(0.4)\n0.4 \nOther income, net\n$\n(1.7)\n$\n(8.4)\nProvision for Income Taxes\nThe effective income tax rates for the three months ended September 30, 2025 and 2024, were 9.8% and 10.5%, respectively. The decrease in the effective income tax rate compared to 2024 is primarily due to a tax benefit related to the enactment of a tax legislative change, partially offset by the unfavorable year over year changes in amounts recognized for uncertain tax positions.\n22\nTable of Contents\nResults of Operations – Nine months ended September 30\nIn millions, except per share amounts\n2025\n% of\nrevenues\n2024\n% of\nrevenues\nNet revenues\n$\n3,034.1 \n$\n2,826.6 \nCost of goods sold\n1,655.3 \n54.6 \n%\n1,574.8 \n55.7 \n%\nSelling and administrative expenses\n728.9 \n24.0 \n%\n655.7 \n23.2 \n%\nOperating income\n649.9 \n21.4 \n%\n596.1 \n21.1 \n%\nInterest expense\n75.9 \n76.8 \nOther income, net\n(10.5)\n(17.2)\nEarnings before income taxes\n584.5 \n536.5 \nProvision for income taxes\n88.2 \n83.1 \nNet earnings \n$\n496.3 \n$\n453.4 \nDiluted net earnings per ordinary share:\n$\n5.73 \n$\n5.16 \nThe discussions that follow describe the significant factors contributing to the changes in our results of operations for the periods presented and form the basis used by management to evaluate the financial performance of the business.\nNet Revenues\nNet revenues for the nine months ended September 30, 2025, increased by 7.3%, or $207.5 million, compared with the same period in 2024, due to the following:\nPricing\n2.6 \n%\nVolume\n1.8 \n%\nAcquisitions / divestitures\n2.6 \n%\nCurrency exchange rates\n0.3 \n%\nTotal\n7.3 \n%\nThe increase in Net revenues was driven by the favorable impact from acquisitions, improved pricing, higher volumes, and favorable foreign currency exchange rate movements.\nOperating Income/Margin\nOperating income for the nine months ended September 30, 2025, increased $53.8 million compared to the same period in 2024. Operating margin for the nine months ended September 30, 2025, increased to 21.4% from 21.1% for the same period in 2024, due to the following:\nIn millions\nOperating Income\nOperating Margin\nSeptember 30, 2024\n$\n596.1 \n21.1 \n%\nInflation and investment spending in excess of pricing and productivity\n(3.5)\n(0.6)\n%\nVolume / product mix\n40.8 \n1.0 \n%\nAcquisitions / divestitures\n16.7 \n— \n%\nCurrency exchange rates\n7.1 \n0.2 \n%\nAcquisition / integration / restructuring expenses\n(7.3)\n(0.3)\n%\nSeptember 30, 2025\n$\n649.9 \n21.4 \n%\nThe increase in Operating income and Operating margin was driven by favorable volume/product mix, the favorable impact from acquisitions/divestitures and favorable foreign currency exchange rate movements, inclusive of transactional currency gains and losses. These increases were partially offset by higher acquisition, integration and restructuring expenses and inflation and investment spending in excess of pricing and productivity.\nInterest Expense\nInterest expense for the nine months ended September 30, 2025, increased $0.9 million compared with the same period in 2024, primarily due to higher interest rates on outstanding indebtedness compared to the same period in the prior year.\n23\nTable of Contents\nOther Income, net\nThe components of Other income, net for the nine months ended September 30 were as follows:\nIn millions\n2025\n2024\nInterest income\n$\n(10.3)\n$\n(16.9)\nForeign currency exchange loss\n2.7 \n0.3 \nOther income\n(2.9)\n(0.6)\nOther income, net\n$\n(10.5)\n$\n(17.2)\nProvision for Income Taxes\nThe effective income tax rates for the nine months ended September 30, 2025 and 2024, were 15.1% and 15.5%, respectively. The decrease in the effective income tax rate compared to 2024 is primarily due to a tax benefit related to the enactment of a tax legislative change, partially offset by the unfavorable year over year changes in amounts recognized for uncertain tax positions.\nReview of Business Segments\nWe operate in and report financial results for two segments: Allegion Americas and Allegion International. These segments represent the level at which our chief operating decision maker reviews our financial performance and makes operating decisions. \nSegment operating income is the measure of profit and loss that our chief operating decision maker uses to evaluate the financial performance of the business and as the basis for resource allocation, performance reviews and compensation. For these reasons, we believe that Segment operating income represents the most relevant measure of Segment profit and loss. Our chief operating decision maker may exclude certain charges or gains, such as corporate charges and other special charges, to arrive at a Segment operating income that is a more meaningful measure of profit and loss upon which to base our operating decisions. We define Segment operating margin as Segment operating income as a percentage of the segment’s Net revenues.\nThe segment discussions that follow describe the significant factors contributing to the changes in results for each segment included in Net earnings.\nSegment Results of Operations - For the three and nine months ended September 30:\nThree months ended\nNine months ended\nIn millions\n2025\n2024\n% Change\n2025\n2024\n% Change\nNet revenues\nAllegion Americas\n$\n844.0 \n$\n782.4 \n7.9 \n%\n$\n2,423.3 \n$\n2,262.4 \n7.1 \n%\nAllegion International\n226.2 \n184.7 \n22.5 \n%\n610.8 \n564.2 \n8.2 \n%\nTotal\n$\n1,070.2 \n$\n967.1 \n$\n3,034.1 \n$\n2,826.6 \nSegment operating income\nAllegion Americas\n$\n242.4 \n$\n221.1 \n9.6 \n%\n$\n690.4 \n$\n622.4 \n10.9 \n%\nAllegion International\n19.7 \n17.9 \n10.1 \n%\n47.1 \n48.6 \n(3.1)\n%\nTotal\n$\n262.1 \n$\n239.0 \n$\n737.5 \n$\n671.0 \nSegment operating margin\nAllegion Americas\n28.7 \n%\n28.3 \n%\n28.5 \n%\n27.5 \n%\nAllegion International\n8.7 \n%\n9.7 \n%\n7.7 \n%\n8.6 \n%\nAllegion Americas\nOur Allegion Americas segment is a leading provider of security products, services and solutions throughout North America. The segment sells a broad range of products and solutions including locks, locksets, key systems, door controls and door control systems, exit devices, doors, glass and door systems, accessories, electronic security products, access control systems and software and service solutions to customers in institutional, commercial and residential facilities, including the education, healthcare, government, hospitality, retail, commercial office and single and multi-family residential markets. This segment’s primary brands are LCN, Schlage, Von Duprin and Stanley Access Technologies, which we utilize with permission in accordance with the terms of an agreement with Stanley Black & Decker (\"Stanley\" is the property of Stanley Logistics L.L.C.).\n24\nTable of Contents\nNet Revenues\nNet revenues for the three months ended September 30, 2025, increased by 7.9%, or $61.6 million, compared to the same period in 2024, due to the following:\nPricing\n4.6 \n%\nVolume\n1.8 \n%\nAcquisitions\n1.5 \n%\nTotal\n7.9 \n%\nThe increase in Net revenues was driven by improved pricing, higher volumes, and the favorable impact of acquisitions.\nNet revenues from non-residential products for the three months ended September 30, 2025, increased by a high-single digits percent compared to the same period in the prior year, as demand for our products remains healthy. We currently anticipate growth in revenues from our non-residential products for the remainder of 2025.\nNet revenues from residential products for the three months ended September 30, 2025, increased by a mid-single digits percent compared to the same period in the prior year, partially driven by higher volumes due to new products launched in the quarter. Residential market demand continues to be soft, consistent with recent quarters.\nGrowth in electronic security products and solutions is a metric that is actively monitored by management and a focus of our investors. Electronic products encompass both residential and non-residential solutions and include all electrified product categories including, but not limited to, electronic and electrified locks, access control systems and electronic and electrified door controls and systems and exit devices. For the three months ended September 30, 2025, Net revenues from the sale of electronic products in the Allegion Americas segment increased by a mid-teens percent compared to the same period in the prior year. We expect continued growth in our electronic products in 2025.\nNet revenues for the nine months ended September 30, 2025, increased by 7.1%, or $160.9 million, compared to the same period in 2024, due to the following:\nPricing\n2.9 \n%\nVolume\n2.4 \n%\nAcquisitions\n2.0 \n%\nCurrency exchange rates\n(0.2)\n%\nTotal\n7.1 \n%\nThe increase in Net revenues was driven by improved pricing, higher volumes, and the favorable impact of acquisitions, partially offset by unfavorable foreign currency exchange rate movements.\nNet revenues from non-residential products for the nine months ended September 30, 2025, increased by a high-single digits percent compared to the same period in the prior year, as demand for our products remains healthy. \nNet revenues from residential products for the nine months ended September 30, 2025, decreased by a low-single digits percent compared to the same period in the prior year as a result of softer residential markets.\nNet revenues from the sale of electronic products for the nine months ended September 30, 2025 increased by a low double-digits percent compared to the same period in the prior year. We expect continued growth in our electronic products in 2025.\nOperating income/margin\nSegment operating income for the three months ended September 30, 2025, increased $21.3 million compared to the same period in 2024, and Segment operating margin for the three months ended September 30, 2025, increased to 28.7% from 28.3%, due to the following:\nIn millions\nOperating Income\nOperating Margin\nSeptember 30, 2024\n$\n221.1 \n28.3 \n%\nPricing and productivity in excess of inflation and investment spending\n10.2 \n— \n%\nVolume / product mix\n9.3 \n0.7 \n%\nCurrency exchange rates\n(0.9)\n(0.3)\n%\nAcquisitions\n2.2 \n(0.1)\n%\nAcquisition / integration / restructuring expenses\n0.5 \n0.1 \n%\nSeptember 30, 2025\n$\n242.4 \n28.7 \n%\n25\nTable of Contents\nThe increase in Segment operating income was primarily driven by pricing and productivity in excess of inflation and investment spending, favorable volume/product mix, the favorable impact of recent acquisitions, and lower acquisition, integration, and restructuring expenses. These increases were partially offset by unfavorable foreign currency exchange rate movements.\nThe increase in Segment operating margin was primarily driven by favorable volume/product mix, and lower acquisition, integration, and restructuring expenses. These increases were partially offset by unfavorable foreign currency exchange rate movements, and the unfavorable impact on operating margin from recent acquisitions.\nSegment operating income for the nine months ended September 30, 2025, increased $68.0 million compared to the same period in 2024, and Segment operating margin for the nine months ended September 30, 2025, increased to 28.5% from 27.5%, due to the following:\nIn millions\nOperating Income\nOperating Margin\nSeptember 30, 2024\n$\n622.4 \n27.5 \n%\nPricing and productivity in excess of inflation and investment spending\n9.6 \n(0.4)\n%\nVolume / product mix\n39.2 \n1.1 \n%\nCurrency exchange rates\n4.1 \n0.2 \n%\nAcquisitions\n11.0 \n(0.1)\n%\nAcquisition / integration / restructuring expenses\n4.1 \n0.2 \n%\nSeptember 30, 2025\n$\n690.4 \n28.5 \n%\nThe increase in Segment operating income was primarily driven by favorable volume/product mix, the favorable impact of recent acquisitions, pricing and productivity in excess of inflation and investment spending, favorable foreign currency exchange rate movements, and lower acquisition, integration, and restructuring expenses.\nThe increase in Segment operating margin was primarily driven by favorable volume/product mix, lower acquisition, integration, and restructuring expenses, and favorable foreign currency exchange rate movements. These increases were partially offset by inflation and investment spending in excess of pricing and productivity, and the unfavorable impact on operating margin from recent acquisitions.\nThe currency impact above is primarily due to the strengthening of the U.S. dollar versus the Mexican peso compared to the prior year.\nAllegion International\nOur Allegion International segment provides security products, services and solutions primarily throughout Europe, Asia and Oceania. The segment offers end-users a broad range of products, services and solutions including locks, locksets, portable locks, key systems, door controls and door control systems, exit devices, doors, electronic security products, access control systems, time and attendance and workforce productivity solutions, among other software and service solutions. This segment’s primary brands are AXA, CISA, ELATEC, Gainsborough, Interflex, and SimonsVoss.\nNet Revenues\nNet revenues for the three months ended September 30, 2025, increased by 22.5%, or $41.5 million, compared to the same period in 2024, due to the following:\nPricing\n1.3 \n%\nVolume\n2.3 \n%\nAcquisitions / divestitures\n13.6 \n%\nCurrency exchange rates\n5.3 \n%\nTotal\n22.5 \n%\nThe increase in Net revenues was primarily driven by the favorable impact from acquisitions/divestitures, favorable foreign currency exchange rate movements, higher volumes, and improved pricing.\n26\nTable of Contents\nNet revenues for the nine months ended September 30, 2025, increased by 8.2%, or $46.6 million, compared to the same period in 2024, due to the following:\nPricing\n1.1 \n%\nVolume\n(0.4)\n%\nAcquisitions / divestitures\n5.4 \n%\nCurrency exchange rates\n2.1 \n%\nTotal\n8.2 \n%\nThe increase in Net revenues was primarily driven by the favorable impact from acquisitions/divestitures, favorable foreign currency exchange rate movements, and improved pricing, which was partially offset by lower volumes.\nOperating income/margin\nSegment operating income for the three months ended September 30, 2025, increased $1.8 million compared to the same period in 2024, and Segment operating margin for the three months ended September 30, 2025, decreased to 8.7% from 9.7%, due to the following:\nIn millions\nOperating Income\nOperating Margin\nSeptember 30, 2024\n$\n17.9 \n9.7 \n%\nInflation and investment spending in excess of pricing and productivity \n(3.6)\n(2.1)\n%\nVolume / product mix\n3.4 \n1.6 \n%\nCurrency exchange rates\n2.4 \n0.9 \n%\nAcquisitions / divestitures\n4.9 \n1.2 \n%\nAcquisition / integration / restructuring expenses\n(5.3)\n(2.6)\n%\nSeptember 30, 2025\n$\n19.7 \n8.7 \n%\nThe increase in Segment operating income was primarily driven by the favorable impact from recent acquisitions/divestitures, the favorable impact from volume/product mix, and the favorable impact from foreign currency exchange rate movements. These increases were partially offset by higher acquisition, integration and restructuring expenses, and inflation and investment spending in excess of pricing and productivity.\nThe decrease in Segment operating margin was primarily driven by higher acquisition, integration and restructuring expenses, and inflation and investment spending in excess of pricing and productivity. These decreases were offset by the favorable impact from volume/product mix, the favorable impact from recent acquisitions/divestitures, and the favorable impact from foreign currency exchange rate movements.\nSegment operating income for the nine months ended September 30, 2025, decreased $1.5 million compared to the same period in 2024, and Segment operating margin for the nine months ended September 30, 2025, decreased to 7.7% from 8.6%, due to the following:\nIn millions\nOperating Income\nOperating Margin\nSeptember 30, 2024\n$\n48.6 \n8.6 \n%\nInflation and investment spending in excess of pricing and productivity \n(1.0)\n(0.3)\n%\nVolume / product mix\n1.6 \n0.3 \n%\nCurrency exchange rates\n2.8 \n0.5 \n%\nAcquisitions / divestitures\n5.7 \n0.5 \n%\nAcquisition / integration / restructuring expenses\n(10.6)\n(1.9)\n%\nSeptember 30, 2025\n$\n47.1 \n7.7 \n%\nThe decrease in Segment operating income and Segment operating margin was primarily driven by higher acquisition, integration and restructuring expenses, and inflation and investment spending in excess of pricing and productivity. These decreases were partially offset by the favorable impact from recent acquisitions/divestitures, the favorable impact from foreign currency exchange rate movements, and the favorable impact from volume/product mix.\n27\nTable of Contents\nLiquidity and Capital Resources\nLiquidity Outlook, Sources and Uses\nOur primary source of liquidity is cash provided by operating activities. Cash provided by operating activities is used to invest in new product development and fund capital expenditures and working capital requirements. Our ability to generate cash from operating activities, our unused borrowing capacity under the Revolving Facility and our access to the capital and credit markets enable us to fund these capital needs, execute our long-term growth strategies and return value to our shareholders. Further, our business operates with strong operating cash flows, low leverage and low capital intensity, providing financial flexibility. \nOur short-term financing needs primarily consist of working capital requirements, restructuring initiatives, capital spending, dividend payments and principal and interest payments on our long-term debt. Long-term financing needs depend largely on potential growth opportunities, including potential acquisitions, repayment or refinancing of our long-term obligations and repurchases of our ordinary shares. Of our total outstanding indebtedness as of September 30, 2025, approximately 86% incurs fixed-rate interest and is therefore not exposed to the risk of rising variable interest rates. \nBased upon our operations, existing cash balances and unused borrowing capacity under the Revolving Facility, as of September 30, 2025, we expect our cash flows from operations will be sufficient to maintain a sound financial position and liquidity and to meet our current financing needs for at least the next 12 months. Further, we do not anticipate any covenant compliance challenges with any of our outstanding indebtedness for at least the next 12 months. We also believe existing borrowing capacity under the Credit Facilities and access to credit and capital markets are sufficient to achieve our longer-term strategic plans.\nThe following table reflects the major categories of cash flows for the nine months ended September 30. For additional details, see the Condensed and Consolidated Statements of Cash Flows in the Condensed and Consolidated Financial Statements.\nIn millions\n2025\n2024\nNet cash provided by operating activities\n$\n543.7 \n$\n456.0 \nNet cash used in investing activities\n(649.3)\n(190.2)\nNet cash (used in) provided by financing activities\n(115.2)\n147.3 \nOperating Activities: \nNet cash provided by operating activities during the nine months ended September 30, 2025, increased $87.7 million compared to the same period in 2024, primarily driven by less cash used for working capital and higher net earnings.\nInvesting Activities: \nNet cash used in investing activities during the nine months ended September 30, 2025, increased $459.1 million compared to the same period in 2024, primarily due to higher cash used for acquisitions. \nFinancing Activities: \nNet cash used in financing activities during the nine months ended September 30, 2025, increased $262.5 million compared to the same period in 2024. Net proceeds from debt borrowings were $306.6 million lower year over year due to the timing of the issuance of the $400 million 5.600% Senior Notes in May 2024. The proceeds from the 5.600% Senior Notes were used to repay senior notes that matured in October 2024. Net proceeds from the debt borrowings in 2025 were $83.3 million and were used to partially fund the acquisitions completed during the year. Additionally, repurchases of ordinary shares were $40 million lower than the prior year period. \n28\nTable of Contents\nCapitalization\nLong-term debt and other borrowings consisted of the following:\nIn millions\nSeptember 30,\n2025\nDecember 31,\n2024\nTerm Facility\n$\n196.9 \n$\n212.5 \nRevolving Facility\n99.0 \n— \n3.550% Senior Notes due 2027\n400.0 \n400.0 \n3.500% Senior Notes due 2029\n400.0 \n400.0 \n5.411% Senior Notes due 2032\n600.0 \n600.0 \n5.600% Senior Notes due 2034\n400.0 \n400.0 \nOther short term borrowings\n3.2 \n— \nTotal borrowings outstanding\n2,099.1 \n2,012.5 \nDiscounts and debt issuance costs, net\n(11.4)\n(13.0)\nTotal debt\n2,087.7 \n1,999.5 \nLess current portion of long-term debt\n28.2 \n21.9 \nTotal long-term debt\n$\n2,059.5 \n$\n1,977.6 \nWe have an unsecured credit agreement in place, consisting of a $250.0 million term loan facility (the “Term Facility”), of which $196.9 million was outstanding at September 30, 2025, and a $750.0 million revolving credit facility (the “Revolving Facility” and, together with the Term Facility, the “Credit Facilities”), of which $99.0 million was outstanding at September 30, 2025.\nThe Term Facility requires quarterly principal payments through its maturity on November 18, 2026. Future payments total $6.3 million for the remainder of 2025 and $190.6 million in 2026. We repaid $15.6 million of principal on the Term Facility during the nine months ended September 30, 2025. The Revolving Facility matures on May 20, 2029 and includes up to $100.0 million for the issuance of letters of credit. We had $18.7 million of letters of credit outstanding at September 30, 2025. Borrowings under the Revolving Facility are due upon its maturity but may be repaid at any time without premium or penalty, and amounts repaid may be reborrowed.\nOutstanding borrowings under the Credit Facilities accrue interest, at our option, equal to either: (i) a Secured Overnight Financing Rate (\"SOFR\") plus an applicable margin or (ii) a base rate plus the applicable margin. The applicable margin ranges from 0.875% to 1.375% depending on our credit ratings. At September 30, 2025, our outstanding borrowings under the Credit Facilities accrued interest at SOFR plus a margin of 1.225%, resulting in an interest rate of 5.388%. The Credit Facilities also contain negative and affirmative covenants and events of default that, among other things, limit or restrict our ability to enter into certain transactions. In addition, the Credit Facilities require us to comply with a maximum leverage ratio as defined in the credit agreement. As of September 30, 2025, we were in compliance with all applicable covenants under the credit agreement.\nAs of September 30, 2025, we also have $400.0 million outstanding of 3.550% Senior Notes due 2027 (the “3.550% Senior Notes”), $600.0 million outstanding of 5.411% Senior Notes due 2032 (the “5.411% Senior Notes”), $400.0 million outstanding of 5.600% Senior Notes due 2034 (the \"5.600% Senior Notes\"), and $400.0 million outstanding of 3.500% Senior Notes due 2029 (the “3.500% Senior Notes”, and all four senior notes collectively, the \"Senior Notes\"). The 3.550% Senior Notes and 3.500% Senior Notes both require semi-annual interest payments on April 1 and October 1 of each year and mature on October 1, 2027 and October 1, 2029, respectively. The 5.411% Senior Notes require semi-annual interest payments on January 1 and July 1 of each year and mature on July 1, 2032. The 5.600% Senior Notes require semi-annual interest payments on May 29 and November 29 of each year and mature on May 29, 2034. \nHistorically, the majority of our earnings were considered to be permanently reinvested in jurisdictions where we have made, and intend to continue to make, substantial investments to support the ongoing development and growth of our global operations. At September 30, 2025, we analyzed our working capital requirements and the potential tax liabilities that would be incurred if certain subsidiaries made distributions and concluded that no material changes to our historic permanent reinvestment assertions are required.\nDefined Benefit Plans\nOur investment objective in managing defined benefit plan assets is to ensure that all present and future benefit obligations are met as they come due. We seek to achieve this goal while trying to mitigate volatility in plan funded status, contributions and expense by better matching the characteristics of the plan assets to that of the plan liabilities. Global asset allocation decisions are based on a dynamic approach whereby a plan’s allocation to fixed income assets increases as the funded status increases. We monitor plan funded status, asset allocation and the impact of market conditions on our defined benefit plans regularly in \n29\nTable of Contents\naddition to investment manager performance. For further details on pension plan activity, see Note 10 to the Condensed and Consolidated Financial Statements.\nFor a further discussion of Liquidity and Capital Resources, refer to Part II, Item 7, \"Management’s Discussion and Analysis of Financial Condition and Results of Operations,\" contained in our Annual Report on Form 10-K for the year ended December 31, 2024.\nGuarantor Financial Information\nAllegion US Hold Co is or was, as applicable, the issuer of the 3.550% Senior Notes, 5.411% Senior Notes, and 5.600% Senior Notes and is the guarantor of the 3.500% Senior Notes. Allegion plc (the “Parent”) is or was, as applicable, the issuer of the 3.500% Senior Notes and is or was, as applicable, the guarantor of the 3.550% Senior Notes, 5.411% Senior Notes, and 5.600% Senior Notes. Allegion US Hold Co is directly or indirectly 100% owned by the Parent and each of the guarantees of Allegion US Hold Co and the Parent is full and unconditional and joint and several.\nThe 3.550% Senior Notes, 5.411% Senior Notes, and 5.600% Senior Notes are or were, as applicable, senior unsecured obligations of Allegion US Hold Co and rank equally with all of Allegion US Hold Co’s existing and future senior unsecured and unsubordinated indebtedness. The guarantee of the 3.550% Senior Notes, 5.411% Senior Notes, and 5.600% Senior Notes is or was, as applicable, the senior unsecured obligation of the Parent and ranks equally with all of the Parent’s existing and future senior unsecured and unsubordinated indebtedness. The 3.500% Senior Notes are senior unsecured obligations of the Parent and rank equally with all of the Parent’s existing and future senior unsecured and unsubordinated indebtedness. The guarantee of the 3.500% Senior Notes is the senior unsecured obligation of Allegion US Hold Co and ranks equally with all of Allegion US Hold Co's existing and future senior unsecured and unsubordinated indebtedness.\nEach guarantee is effectively subordinated to any secured indebtedness of the guarantor to the extent of the value of the assets securing such indebtedness. The Senior Notes are structurally subordinated to indebtedness and other liabilities of the subsidiaries of the guarantor, none of which guarantee the notes. The obligations of the guarantor under its guarantee are limited as necessary to prevent such guarantee from constituting a fraudulent conveyance under applicable law and, therefore, are limited to the amount that the applicable guarantor could guarantee without such guarantee constituting a fraudulent conveyance; this limitation, however, may not be effective to prevent such guarantee from constituting a fraudulent conveyance. If the guarantee was rendered voidable, it could be subordinated by a court to all other indebtedness (including guarantees and other contingent liabilities) of the applicable guarantor, and, depending on the amount of such indebtedness, the applicable guarantor’s liability on its guarantee could be reduced to zero. In such an event, the notes would be structurally subordinated to the indebtedness and other liabilities of the guarantor.\nFor further details, terms and conditions of the Senior Notes refer to the Company’s Forms 8-K filed October 2, 2017, September 27, 2019, June 22, 2022, and May 29, 2024.\nThe following tables present the summarized financial information specified in Rule 1-02(bb)(1) of Regulation S-X for each issuer and guarantor. The summarized financial information has been prepared in accordance with Rule 13-01 of Regulation S-X.\nSelected Condensed Statement of Comprehensive Income Information\nNine months ended September 30, 2025\nYear ended December 31, 2024\nIn millions\nAllegion plc\nAllegion US \nHold Co\nAllegion plc\nAllegion US \nHold Co\nNet revenues\n$\n— \n$\n— \n$\n— \n$\n— \nGross profit\n— \n— \n— \n— \nOperating loss\n(6.6)\n— \n(7.8)\n(0.1)\nEquity earnings in affiliates, net of tax\n541.8 \n355.9 \n669.6 \n421.4 \nTransactions with related parties and subsidiaries\n(a)\n(15.5)\n(68.6)\n(31.4)\n(87.3)\nNet earnings\n496.3 \n265.3 \n597.5 \n311.4 \n(a) Transactions with related parties and subsidiaries include intercompany interest and fees.\n30\nTable of Contents\nSelected Condensed Balance Sheet Information\nSeptember 30, 2025\nDecember 31, 2024\nIn millions\nAllegion plc\nAllegion US \nHold Co\nAllegion plc\nAllegion US \nHold Co\nCurrent assets:\nAmounts due from related parties and subsidiaries \n$\n0.2 \n$\n696.6 \n$\n0.1 \n$\n932.8 \nTotal current assets\n27.1 \n726.6 \n10.0 \n954.9 \nNoncurrent assets:\nAmounts due from related parties and subsidiaries\n— \n1,298.4 \n— \n1,296.5 \nTotal noncurrent assets\n1,792.4 \n1,414.7 \n1,792.9 \n1,399.7 \nCurrent liabilities:\nAmounts due to related parties and subsidiaries \n$\n7.2 \n$\n739.6 \n$\n12.1 \n$\n801.4 \nTotal current liabilities\n55.6 \n769.5 \n48.0 \n824.2 \nNoncurrent liabilities:\nAmounts due to related parties and subsidiaries\n515.1 \n2,556.8 \n472.4 \n2,756.6 \nTotal noncurrent liabilities\n1,085.3 \n3,961.2 \n1,061.1 \n4,145.8 \nCritical Accounting Policies\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations are based upon our Condensed and Consolidated Financial Statements, which have been prepared in accordance with accounting principles generally accepted in the United States. The preparation of financial statements in conformity with those accounting principles requires management to use judgments in making estimates and assumptions based on the relevant information available at the end of each period. These estimates and assumptions have a significant effect on reported amounts of assets and liabilities, revenue and expenses, as well as the disclosure of contingent assets and liabilities because they result primarily from the need to make estimates and assumptions on matters that are inherently uncertain. Actual results may differ from estimates.\nManagement believes there have been no significant changes during the nine months ended September 30, 2025, to the items we disclosed as our critical accounting policies in \"Management’s Discussion and Analysis of Financial Condition and Results of Operations\" in our Annual Report on Form 10-K for the year ended December 31, 2024.\nRecent Accounting Pronouncements\nRefer to Note 2 in our Condensed and Consolidated Financial Statements for a discussion of recently issued and adopted accounting pronouncements.\nForward-Looking Statements\nCertain statements in this report, other than purely historical information, are \"forward-looking statements\" within the meaning of the Private Securities Litigation Reform Act of 1995, Section 27A of the Securities Act of 1933 and Section 21E of the Securities Exchange Act of 1934, as amended (the \"Exchange Act\"). These forward-looking statements generally are identified by the words \"believe,\" \"aim,\" \"projected,\" \"expect,\" \"anticipate,\" \"estimate,\" \"forecast,\" \"outlook,\" \"intend,\" \"scheduled,\" \"targets,\" \"strategy,\" \"future,\" \"opportunity,\" \"plan,\" \"may,\" \"should,\" \"will,\" \"would,\" \"will be,\" \"will continue,\" \"will likely result,\" or the negative thereof or variations thereon or similar expressions generally intended to identify forward-looking statements.\nThese statements are based on currently available information and our current assumptions, expectations and projections about future events. While we believe that our assumptions, expectations and projections are reasonable in view of the currently available information, you are cautioned not to place undue reliance on our forward-looking statements. Forward-looking statements speak only as of the date they are made and are not guarantees of future performance. They are subject to future events, risks and uncertainties – many of which are beyond our control – as well as potentially inaccurate assumptions, that could cause actual results to differ materially from our expectations and projections including, among other things:\n•\nongoing macroeconomic challenges and continued economic instability;\n•\nincreased prices and inflation;\n•\nvolatility and uncertainty in the political, economic and regulatory environments in which we operate, including changes to trade agreements, sanctions, import and export regulations, custom duties and applicable tax regulations and interpretations, social and political unrest, instability, national and international conflict, terrorist acts and other geographical disputes and uncertainties;\n•\nthe strength and stability of the institutional, commercial and residential construction and remodeling markets; \n31\nTable of Contents\n•\nfluctuations in currency exchange rates;\n•\npotential impairment of our goodwill, indefinite-lived intangible assets and/or our long-lived assets;\n•\ninstability in the U.S. and global capital and credit markets;\n•\nour ability to make scheduled debt payments or to refinance our debt obligations;\n•\nincreased competition, including from technological developments;\n•\nthe development, commercialization and acceptance of new products and services;\n•\nchanges in customer and consumer preferences and our ability to maintain beneficial relationships with large customers;\n•\nour products or solutions failing to meet certification and specification requirements, being defective, causing property damage, bodily harm or injury, or otherwise falling short of customers’ needs and expectations;\n•\nour ability to identify and successfully complete and integrate acquisitions, including achieving their anticipated strategic and financial benefits;\n•\nbusiness opportunities that diverge from our core business;\n•\nour ability to achieve the expected improvements or financial returns we expect from our strategic initiatives;\n•\nour ability to effectively manage and implement restructuring initiatives or other organizational changes;\n•\nglobal climate change or other unexpected events, including global health crises, such as COVID-19;\n•\nthe proper functioning of our information technology and operational technology systems, including disruption or breaches of our information systems, such as cybersecurity attacks;\n•\nthe failure of our third-party vendors to provide effective support for many of the critical elements of our global information and operational technology infrastructure;\n•\nour ability to recruit and retain a highly qualified and diverse workforce;\n•\ndisruptions in our global supply chain, including product manufacturing and logistical services provided by our supplier partners;\n•\nour ability to effectively manage real or perceived issues related to product quality, safety, corporate social responsibility and other reputational matters;\n•\nour ability to protect our brand reputation and trademarks; \n•\nlegal judgments, fines, penalties or settlements imposed against us or our assets as a result of legal proceedings, claims and disputes;\n•\nclaims of infringement of intellectual property rights by third parties;\n•\nimproper conduct by any of our employees, agents or business partners;\n•\nchanges to, or changes in interpretations of, current laws and regulations; \n•\nuncertainty and inherent subjectivity related to transfer pricing regulations in the countries in which we operate;\n•\nchanges in tax rates, the adoption of new tax legislation or exposure to additional tax liabilities; and\n•\nrisks related to our incorporation in Ireland, including the possible effects on us of future legislation or adverse determinations by taxing authorities that could increase our tax burden.\nThese events, risks and uncertainties are described more fully in the “Risk Factors” section of our Annual Report on Form 10-K for the fiscal year ended December 31, 2024. There may also be other factors that have not been anticipated or that are not described in our periodic filings with the SEC, generally because we did not believe them to be significant at the time, which could cause actual results to differ materially from our projections and expectations. We do not undertake to update any forward-looking statements, except as required by applicable law."
}