{
  "source_file": "alle-20241231.htm",
  "form_type": "10-K",
  "item1": "Item 1.\n    \nBUSINESS\nOverview\nAllegion plc (\"Allegion,\" \"we,\" \"us\" or \"the Company\") is a leading global provider of security products and solutions that keep people and assets safe and secure in the places they live, learn, work and connect. We pioneer safety and security to create a safer and more accessible world. Central to our work is partnering and developing ecosystems to create flawless, seamless access experiences and enable an uninterrupted and secure flow of people and assets. We offer an extensive and versatile portfolio of security and access control security products and solutions across a range of market-leading brands. Our experts across the globe deliver high-quality hardware, software, services and systems, and we use our deep expertise to serve as trusted partners to end-users who seek customized solutions to their security needs.\nAllegion Principal Products and Services\nDoor controls, door control systems, and exit devices\nDoors, glass and door systems, and accessories\nElectronic security products and access control systems, including time, attendance and workforce productivity \nLocks, locksets, portable locks, and key systems\nServices and software\nSecurity and access control security products and solutions are critical elements in every building and home. Many door openings are configured to maximize a room’s particular form and function while also meeting local and national building and safety code requirements and end-user security needs. Most buildings have multiple door openings, each serving its own purpose and requiring different specific access control solutions. Each door must fit exactly within its frame, be prepared precisely for its hinges, synchronize with its specific lockset and corresponding latch and align with a specific key to secure the door. Moreover, with the growing adoption of connected hardware and software solutions, security products – including credentials – are increasingly linked electronically, integrated into access control software and popular consumer technology platforms and controlled with mobile applications, creating additional functionality and complexity.\nWe believe our ability to deliver a wide range of solutions that can be custom configured to meet end-users’ security needs is a key driver of our success. We accomplish this with: \n•\nOur extensive and versatile product and service portfolio, combined with our deep expertise, which enables us to deliver the right products and solutions to meet diverse security and functional specifications and to successfully and securely integrate into leading technologies and systems; \n•\nOur consultative approach and expertise, which enables us to develop the most efficient and appropriate building security and access control specifications to fulfill the unique needs of our end-users and their partners, including architects, designers, security consultants, contractors, homebuilders and engineers;\n•\nOur access to and management of key channels in the market, which is critical to delivering our products in an efficient and consistent manner; and \n•\nOur enterprise excellence capabilities, including our global manufacturing operations and agile supply chain, which facilitate our ability to deliver specific product and system configurations to end-users and consumers worldwide, quickly and efficiently. \nWe believe the security products industry will continue to benefit from several global macroeconomic trends, including:\n•\nExpected growth in global electronic and electromechanical products and solutions as end-users adopt newer technologies in their facilities and homes;\n•\nHeightened awareness of security and privacy requirements;\n•\nIncreased focus and adoption of mobile technology; and\n•\nThe shift to a digital, interconnected and increasingly interoperable environments that require a strong ecosystem of partners.\nWe operate in and report financial results for two segments: Allegion Americas and Allegion International, the latter of which provides security and access control security products, services and solutions primarily throughout Europe, Asia and Oceania. We sell our products and solutions under the following brands:\n4\nTable of Contents\n5\nTable of Contents\n6\nTable of Contents\nWe sell a wide range of security and access control solutions for end-users in commercial, institutional and residential facilities worldwide, including the education, healthcare, government, hospitality, retail, commercial office and single and multi-family residential markets. Our leading brands include CISA®, Interflex®, LCN®, Schlage®, SimonsVoss®, and Von Duprin®.\nDuring the year ended December 31, 2024, we generated Net revenues of $3,772.2 million and Operating income of $780.7 million. \nHistory and Developments\nWe were incorporated in Ireland on May 9, 2013, to hold the commercial and residential security businesses of what was then Ingersoll Rand plc (\"Ingersoll Rand\"). On December 1, 2013, we became a stand-alone public company after Ingersoll Rand completed the separation of these businesses from the rest of Ingersoll Rand via the transfer of these businesses from Ingersoll Rand to us and the issuance by us of ordinary shares directly to Ingersoll Rand’s shareholders. Our security businesses have long and distinguished operating histories. Several of our brands were established more than 100 years ago, and many originally created their categories: \n•\nVon Duprin, established in 1908, was awarded the first exit device patent;\n•\nSchlage, established in 1920, was awarded the first patents granted for the cylindrical lock and the push button lock; \n•\nLCN, established in 1926, created the first door closer; \n•\nCISA, established in 1926, devised the first electronically controlled lock; \n•\nSimonsVoss, established in 1995, created the first keyless digital transponder; and\n•\nStanley Access Technologies patented the world's first hands-free door operator in 1931.\nWe have built upon these founding legacies since our entry into the security products market through the acquisition of Schlage, Von Duprin and LCN. Today, we continue to develop, acquire and introduce innovative products.\n7\nTable of Contents\nIn 2018, we announced the formation of Allegion Ventures to invest in and help accelerate the growth of companies that have innovative, digital-first technologies and products such as touchless access and workspace monitoring solutions that complement our core business solutions. Building on this success, in December 2021, Allegion Ventures announced a second fund with an additional allocation of $100 million to focus on investing in technologies like artificial intelligence, video monitoring, machine learning and cybersecurity. \nRecent examples of successful product launches by Allegion are illustrated in the table below:\nProducts and Services\nBrands\nYear\nInnovation\nDoor controls, door control systems, and exit devices\nCISA, \nStanley Access Technologies, Von Duprin\n2023/2024\nCISA Multitop Matic Exit, a secondary lock for single and double leaf aluminum and iron panic doors, brings to market the only \"Made in Italy\" counter-lock featuring a long faceplate. Enables the automatic and secure locking of the main leaf against the door jam. \nStanley Access Technologies new automatic door/window solution for increased efficiencies for drive-through restaurants (DuraGlide DT). Telescopic manual and automatic version of ICU doors, providing the biggest clear door opening in the industry, proprietary handle design and the slimmest header (ProCare 8500). More energy-efficient and robust hurricane-rated sliding doors (DuraStorm Class E).\nVon Duprin 70 series delivering both performance and value at a medium price point and is ideal for heavy duty warehouse, industrial, office, multifamily, retail and hospitality applications.\nDoors, glass and door systems, and accessories\nTGP, Unicel\n2023/2024\nSmoke-rated partition featuring doors, sidelites/transoms and standalone windows suitable for enclosed elevator lobbies in multifamily buildings.  It is comprised of glass, frames and hardware and is the first system fully tested to UL 1784 (TGP SmokeSafe™ Window & Door System). \nNorth America’s first fire-rated full-lite door system certified to forced-entry standards (TGP TGProtect™ FR System). \nUL Certification of American Architectural Manufacturers Association (AAMA) 501.8 human impact resistant curtain wall using durable SentryGlas Plus (SGP) laminated glass (Unicel). \n8\nTable of Contents\nProducts and Services\nBrands\nYear\nInnovation\nElectronic security products and access control systems, including time, attendance, and workforce productivity\nGainsborough,Schlage, SimonsVoss, \n2023/2024\nSchlage XE360 series electronic lock is the next generation wireless lock from Schlage, designed specifically for multifamily properties. It delivers innovation, intelligence and reliability wrapped in a modern, sleek design for a variety of lock applications (mortice, tubular and exit device).   \nSchlage, in collaboration with Airbnb, was the first to launch the “airkey” integration, connecting Schlage smart locks and Airbnb accounts for easy guest check-ins. \nSchlage Encode Smart WiFi Lever is for use in doors without a deadbolt; connects to home WiFi and pairs with the Schlage app.  \nGainsborough Freestyle Trilock now has built-in Wi-Fi, no longer needing a separate bridge to communicate to the router. The latest version of this residential product includes Matter over Thread - the first smart lock in Australia to feature this technology.\nNarrow profile smart lock for Australia and New Zealand for use on aluminum and timber doors, utilizing the Schlage Breeze app (Schlage Artus). Next-generation smart entry door lock for the New Zealand market, operating on the Schlage Breeze app and offering a retrofit solution to Schlage S-6000 and competitor products (Schlage Resolute). \nSimonsVoss AX2Go, a BLE-based mobile app for iOS and Android, supporting the same user experience, regardless the OS of the smartphone. Users can place unlocked smartphone on the lock and the app will send the needed data in the background.\nSimonsVoss PinCode keypad AX, a BLE-based pincode keypad suitable for communication with SimonsVoss based AX products, with a range up to 1.5 meters. \nLocks, locksets, portable locks, and key systems\nBricard, Legge\n2023/2024\nBricard Evidence handle range for commercial and residential markets, with an exclusive and unique rose fixation and adjustment design, functionality and finishes.   \nBricard Bi-Pass key is equipped with an integrated RFID tag, enabling seamless operation of both mechanical and electronic access control devices.\nNext generation of multi-function mortice locks, 991 Multi-Function Mortice Lock Series (Legge), allows easy conversions and anti-lockout function. \nServices and software\nSimonsVoss, Zentra\n2023/2024\nSimonsVoss AXM Plus Software, first on-premise software variant with an optional cloud con\nnection, to give customers the opportunity to deploy mobile credentials in a virtual networked environment.\nMultifamily access control solution providing a turnkey, simple, secure and smart offering of software and integrated hardware covering all access needs for the building (Zentra). \n9\nTable of Contents\nIndustry and Competition \nWe serve customers within institutional, commercial and residential construction and remodeling markets throughout North America, Europe, Asia and Oceania. We expect the security products industry will continue to benefit from favorable trends such as increased concerns about safety and security, and technology-driven innovation that enables seamless access and a better user experience as people and assets traverse multiple locations and facilities. Further, we expect continued growth in connected security products and solutions as end-users continue to adopt newer technologies, including mobile solutions and artificial intelligence, in their facilities and single and multi-family homes.\nThe security products markets are highly competitive and fragmented throughout the world, with a number of large multi-national companies and thousands of smaller regional and local companies. This high degree of fragmentation primarily reflects local regulatory requirements and highly variable end-user needs. We believe our principal global competitors are Assa Abloy AB and dormakaba Group. We also face competition in various markets and product categories throughout the world, including Fortune Brands Innovations, Inc. in the North American residential market. As we move into more technologically advanced product categories, we may also compete against new, more specialized competitors.\nOur success depends on a variety of factors, including brand and reputation, knowledge and expertise in our industry, product breadth, innovation, integration with popular technology platforms, quality and delivery capabilities, price and service capabilities. As many of our businesses sell through distribution, our success also depends on building and partnering with a strong channel network. We compete based on the breadth, innovation and quality of our products and solutions, pricing, our ability to custom-configure solutions to meet individual end-user requirements and our global supply chain.\nProducts and Services\nWe offer the following extensive and versatile portfolio of security and access control products and solutions across a range of market-leading brands:\n•\nDoor controls, door control systems, and exit devices\n: An extensive portfolio of life-safety products and solutions generally installed on fire doors and facility entrances and exits. Exit devices, also known as panic hardware, provide rapid egress to allow building occupants to exit safely in an emergency. Door controls and systems include mechanical door closers, automatic door operators, as well as high-performance interior and storefront door systems. In addition, we offer a full range of automatic entrance solutions, including sliding, swing, folding and ICU doors, as well as an array of sensors, controls and security options for commercial and institutional buildings;\n•\nDoors, glass and door systems, and accessories\n: A portfolio of hollow metal doors and frames, glass and specialty door systems, as well as a variety of additional security products and components, including hinges, door pulls, door stops, bike lights, louvers, weather stripping, thresholds and other accessories, as well as certain bathroom fittings and accessibility aids;\n•\nElectronic security products and access control systems, including time, attendance and workforce productivity\n: A broad range of electronic locks, electronic door closers and exit devices, access control products and systems, credentials and credential readers and accessories, including Bluetooth Low Energy, Power over Ethernet and cloud-based solutions, including products designed to help business customers manage and monitor workforce access, attendance and employee scheduling;\n•\nLocks, locksets, portable locks, and key systems\n: A broad array of cylindrical, tubular and mortice door locksets, security levers and master key systems that are used to protect and control access and a range of portable security products, including bicycle, small vehicle and travel locks; and\n•\nServices and software\n: Our Stanley Access Technologies business offers extensive planned inspection, maintenance and repair services for its automatic entrance solutions throughout the U.S. and Canada. Additionally, we offer software as a service (\"SaaS\") offerings throughout the U.S. and internationally, including access control, platform integration and workforce management solutions through our Interflex business. We also offer ongoing aftermarket services, design and installation offerings and locksmith services in select locations.\nCustomers\nWe sell most of our products and solutions through distribution and retail channels, including specialty distribution, e-commerce and wholesalers. We have built a network of channel partners that help our customers choose the right solution to meet their security needs and help commercial and institutional end-users fulfill and install orders. We also sell through a variety of retail channels, including large do-it-yourself home improvement centers, multiple online and e-commerce platforms, as well as small, specialty showroom outlets. We work with our retail partners on developing marketing and merchandising strategies to maximize their sales per square foot of shelf space. Through a few of our businesses, most notably Stanley Access Technologies, Interflex and our Global Portable Security brands, we also provide products and services directly to end-users.\nOur 10 largest customers represented approximately 27% of our total Net revenues in 2024. No single customer represented 10% or more of our total Net revenues in 2024.\n10\nTable of Contents\nSales and Marketing\nIn markets where we sell through commercial and institutional distribution channels, we employ sales professionals around the world who work with a combination of end-users, security professionals, architects, contractors, engineers and distribution partners to develop specific, custom-configured solutions to meet our end-users’ needs. Our field sales professionals are assisted by specification writers who work with architects, engineers and consultants to help design door openings and security systems to meet end-users’ functional, aesthetic and regulatory requirements. Both groups are supported by dedicated customer care and technical sales-support specialists worldwide. We also support our sales efforts with a variety of marketing efforts, including trade-specific advertising, cooperative distributor merchandising, digital marketing and marketing at a variety of industry trade shows.\nIn markets where we sell through retail and homebuilder distribution channels, we have teams of sales, merchandising and marketing professionals who help drive brand and product awareness through our channel partners and to consumers. We utilize a variety of advertising and marketing strategies, including traditional consumer media, retail merchandising, digital marketing, retail promotions and builder and consumer trade shows, to support these teams. \nWe also work actively with several industry bodies around the world to help promote effective and consistent safety and security open platform standards. For example, we are members of the American Association of Automatic Door Manufacturers (AAADM), Builders Hardware Manufacturers Association (BHMA), Connectivity Standards Alliance (CSA), Construction Specification Institute, Door and Hardware Institute (DHI), FiRa Consortium, National Association of State Fire Marshals (NASFM), Partner Alliance for Safer Schools (PASS), Physical Security Interoperability Alliance (PSIA), Security Industry Association (SIA), Security Technology Alliance, Z-Wave Alliance, The European Federation of Associations of Locks and Builders Hardware Manufacturers (ARGE), ASSOFERMA (Italy), BHE (Germany), Door Hardware Federation (UK), Open Security Standards Association (Germany) and UNIQ (France).\nProduction and Distribution\nWe manufacture products in several geographic markets around the world. We operate 34 principal production and assembly facilities – 21 in our Allegion Americas segment and 13 in our Allegion International segment. We own 16 of these facilities and lease the others. Our strategy is to produce in the region of use, wherever appropriate, to allow us to be closer to the end-user and increase efficiency and timely product delivery. Much of our U.S. based residential portfolio is manufactured in the Baja region of Mexico under the Maquiladora, Manufacturing and Export Services Industry (\"IMMEX\") program. In managing our network of production and assembly facilities, we focus on continuous improvement in customer experience, employee health and safety, productivity, resource utilization and operational excellence.\nWe distribute our products through a broad network of channel partners. In addition, third-party manufacturing and logistics providers perform certain manufacturing, storage and distribution services for us to support certain parts of our manufacturing and distribution network.\nRaw Materials\nWe continue to support our region-of-use production strategy with corresponding region-of-use supplier partners for much of our supply base. Our global and regional commodity teams work with production leadership, product management and materials management teams to source materials for production. Where appropriate, we may enter fixed-cost contracts to lower overall costs.\nWe purchase a wide range of raw materials, including steel, zinc, brass and other non-ferrous metals, as well as other parts and components, such as electronic components, to support our production facilities. \nIntellectual Property\nIntellectual property, inclusive of certain patents, trademarks, copyrights, know-how, trade secrets and other proprietary rights, is important to our business. We create, protect and enforce our intellectual property investments in a variety of ways. We work actively in the U.S. and internationally to try to ensure the protection and enforcement of our intellectual property rights. We use trademarks on nearly all of our products and believe such distinctive marks are an important factor in creating a market for our goods, in identifying us and in distinguishing our products from others. We consider our CISA, Interflex, LCN, Schlage, SimonsVoss, Von Duprin and other associated trademarks to be among our most valuable assets, and we have registered these trademarks in a number of countries. Although certain proprietary intellectual property rights are important to our success, we do not believe we are materially dependent on any particular patent or license, or any particular group of patents or licenses. \nFacilities\nWe operate through a broad network of sales offices, engineering centers, 34 principal production and assembly facilities and several distribution centers throughout the world. Our active properties represent approximately 7.7\n \nmillion square feet, of which approximately 44%\n \nis leased. The following table shows the location of our principal production and assembly facilities under the business segments in which they operate:\n11\nTable of Contents\nProduction and Assembly Facilities\nAllegion Americas\nAllegion International\nBlue Ash, Ohio\nAuckland, New Zealand\nChino, California\nBlackburn, Australia\nEnsenada, Mexico\nBrooklyn, Australia\nEverett, Washington\nClamecy, France\nFarmington, Connecticut\nDurchhausen, Germany\nGreenfield, Indiana (2)\nFaenza, Italy\nIndianapolis, Indiana\nFeuquieres, France\nIrving, Texas\nMonsampolo, Italy\nJurong, Singapore\nOsterfeld, Germany\nLongueuil, Canada\nRenchen, Germany\nMcKenzie, Tennessee\nValencia, Spain\nMississauga, Canada\nVeenendaal, Netherlands\nPerrysburg, Ohio\nZawiercie, Poland\nPico Rivera, California\nPrinceton, Illinois\nQueretaro, Mexico\nSecurity, Colorado\nSnoqualmie, Washington\nTecate, Mexico\nTijuana, Mexico\nResearch and Development\nWe are committed to investing in our research and development capabilities with a focus on innovations that will deliver growth through the introduction of new products and solutions. In addition, we invest in initiatives that continuously drive improvements in product cost, quality, safety and sustainability.\nOur research and development resources are managed globally to permit leveraging of innovative technologies and product platforms across businesses as well as to optimize development cost and resource efficiency. Our regionally located resources leverage expertise in local standards and configurations and apply those to adapt products for the benefit of our customers. Further, we operate a global technology center in Bengaluru, India, which augments and supports our regional engineering and technology teams.\nSeasonality\nOur business experiences seasonality that varies by product and service line. For instance, as more construction and do-it-yourself projects occur during the second and third calendar quarters in the Northern Hemisphere, our security product sales related to those projects are typically higher in those quarters than in the first and fourth quarters. However, certain other businesses typically experience higher sales in the fourth quarter due to demand for services and project timing. \nHuman Capital\nOur human capital strategy is based on our values and is foundational to achieving our business strategy. Our workplace culture is based on practices that reward performance, provide growth and development opportunities, and support employees with competitive compensation and benefits packages. As a testament to this, Allegion received the 2024 Gallup Exceptional Workplace Award. This award recognizes the most engaged workplace cultures in the world. \nAs of December 31, 2024, we had approximately 14,400 employees worldwide. Approximately 48% of employees are employed within the U.S. and approximately 52% based outside the U.S. Among our U.S. based employees, approximately 14% were subject to collective bargaining agreements with various labor unions. Outside the U.S., we have employees in certain countries, particularly in Europe, that are represented by an employee representative organization, such as a works council. Our employee base is supplemented by contingent labor where business demand fluctuates or we experience short-term needs for specialized skills. We believe our relations with our workforce in both unionized and non-unionized settings are generally positive.\n12\nTable of Contents\nTalent Attraction and Retention\nOur employer brand creates a differentiated employee experience intended to attract and retain the right talent for Allegion. Our talent attraction efforts are focused on and highlight a culture that reflects our core values, Allegion leadership behaviors and business objectives. \nWe want to attract talent with core capabilities relevant to our long-term corporate business strategy: customer focus, innovation, partnering, pace and agility and collaboration. We use a variety of recruitment tactics to ensure a strong base of labor for manufacturing operations and to build the base of talent with these capabilities. Throughout the recruitment cycle, we provide a technology-enabled seamless experience for internal and external candidates and hiring managers. Our compensation and benefit programs are designed to be competitive in the geographies where we work, including a total rewards package (which varies by country/region) that includes hourly and salaried compensation, performance-based incentive and long-term equity incentive plans, retirement, insurance and government social welfare programs, disability and family leave, health and wellness programs, education benefits to pursue degrees and certifications and additional offerings to support financial stability and personal planning.\nTalent Development and Succession Planning\nTalent development and succession planning are key components of the Allegion Operating System, which supports governance, reporting processes and management of the business. Our performance management system includes annual performance reviews for all permanent salaried employees. Talent development and succession planning takes place at all levels of the organization and is supported through individual career mapping, assessment of performance and talent pipeline planning up to and including the executive leadership team (\"ELT\"). As part of their quarterly business review, the ELT reviews talent development, focusing on developing a diverse succession pipeline. These cross-functional reviews highlight individuals who are ready for new opportunities, individuals who are on a special assignment or project and individuals early in their career that demonstrate emerging leadership skills.\nLearning and Development \nOpportunities for ongoing learning and development are delivered to employees through structured coursework, on-site and expert-led training and experiential, applied development. The Allegion Academy is offered globally, supporting multiple languages and providing thousands of self-guided online courses. We offer programs to provide successive levels of development, including re-skilling and upskilling existing employees, as well as strengths-based leadership curriculum and global programs for employee mentoring and coaching. \nCulture and Engagement\nCulture and engagement are also parts of the Allegion Operating System. Engagement surveys provide a mechanism to gather direct employee feedback, give team leaders insights on potential areas of focus and allow leaders to prioritize and act on their teams’ foundational, inclusion, growth and development needs. Strengths-based leadership is an element of our commitment to inclusion: the more employees understand their own strengths, the better equipped they are to add value and appreciate the contributions of diverse members of their teams.\nWe believe in fundamental standards that support our employees, while building and maintaining diverse and inclusive workplaces. Employee-led resource and affinity groups provide opportunities for women's leadership, early career professionals, allies and members of the LGBTQIA+, Black, veteran and Hispanic communities, among others.\nEmployee Health and Safety \nEmployee health and safety are top priorities and integral to the Company's growth strategy. ‘Be safe, be healthy’ is a core organizational value in our proactive safety culture.\nThe ELT, with oversight from our Board of Directors, is responsible for risk management, employee accountability, safety hazard recognition and executing safety initiatives. We monitor leading and lagging indicators related to health and safety as part of our ongoing management of the Allegion Operating System and regularly update the Corporate Governance and Nominating Committee of the Board of Directors on key developments and employee health and safety topics.\nRegulatory Matters\nWe are subject to a variety of federal, state and local laws and regulations, both within and outside the U.S., relating to Environmental, Health and Safety (\"EHS\") matters. We are committed to conducting business in a safe, environmentally responsible and sustainable manner, in compliance with all applicable EHS laws and regulations, as well as some applicable voluntary programs and collective agreements. We continously work to promote and protect the health and safety of our environment, associates, customers, contractors and members of our local communities worldwide.\n \nWe operate with principles and practices that support our commitments, including:\n•\nIntegrating sound EHS and sustainability strategies in all elements of our business, we set quantitative metrics and targets to provide clear accountability and to monitor and measure improvement in EHS performance;\n13\nTable of Contents\n•\nConducting periodic, formal evaluations and audits of our compliance status, while also routinely reviewing our objectives and metrics;\n•\nFostering a workplace culture where everyone at Allegion is responsible for safety;\n•\nImplementing measures to enhance internal and external stakeholder awareness of our environmental management policy and its impacts;\n•\nEstablishing prioritization and action plans to continuously improve our EHS and sustainability management systems and performance; this includes reduction in use of natural resources, minimization of waste and prevention of pollution, as well as prevention and elimination of workplace accidents, injuries and risks;\n•\nDesigning, operating and maintaining our facilities in a manner that minimizes negative EHS and sustainability impacts;\n•\nUsing materials responsibly, including, where feasible, the recycling and reuse of materials; and\n•\nActing in a way that shows sensitivity to community concerns about EHS and sustainability issues.\nWe recognize that these principles are critical to our future success. We are currently engaged in site investigations and remediation activities to address environmental cleanup from past operations at current and former production facilities. We also regularly evaluate our remediation methods that are in addition to, or in replacement of, those we currently utilize based upon enhanced technology and regulatory changes. We are sometimes a party to environmental lawsuits and claims and have, from time to time, received notices of potential violations of environmental laws and regulations from the U.S. Environmental Protection Agency (\"EPA\") and similar state authorities. We have also been identified as a potentially responsible party (\"PRP\") for cleanup costs associated with off-site waste disposal at federal Superfund and state remediation sites. For all such sites, there are other PRPs and we believe our involvement is minimal.\nIn estimating our liability, we have assumed that we will not bear the entire cost of remediation of any site to the exclusion of other PRPs who may be jointly and severally liable. The ability of other PRPs to participate has been taken into account, based on our understanding of the parties’ financial condition and probable contributions on a per site basis. Additional lawsuits and claims involving environmental matters are likely to arise from time to time in the future. For a further discussion of our potential environmental liabilities, see Notes 2 and 21 to the Consolidated Financial Statements. \nEnvironmental, social and governance (\"ESG\") factors important to our business are embedded into our values and our leadership's commitment to create a workplace culture committed to doing the right thing in the right way. Our Board of Directors oversees the Company's ESG strategies, goals and performance, and both our leadership and employees all have a responsibility to uphold excellence, as we believe our commitment to ESG matters helps advance engagement and business vitality. Additional information about our ESG priorities and progress may be found in the ESG section of our website (found under the ESG tab at \nwww.allegion.com\n). The website highlights our ongoing progress and advancements in ESG matters, and includes our materiality matrix of ESG priorities.\nAvailable Information\nWe are required to file annual, quarterly and current reports, proxy statements and other documents with the SEC under the Exchange Act. The SEC maintains an Internet website that contains reports, proxy and information statements and other information regarding issuers that file electronically with the SEC. The public can obtain any documents that are filed by us at www.sec.gov.\nIn addition, the Company's Annual Report on Form 10-K, as well as future quarterly reports on Form 10-Q, current reports on Form 8-K and any amendments to all of the foregoing reports, are made available free of charge on our investor website (investor\n.allegion.com\n) as soon as reasonably practicable after such reports are electronically filed with or furnished to the SEC. \nThroughout this Annual Report on Form 10-K, we refer to additional information that may be found or is available on our websites. The information contained on, or that may be accessed through, our websites is not incorporated by reference into, and is not part of, this Annual Report on Form 10-K.\n14\nTable of Contents",
  "item7": "Item 7.\n \nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe following Management’s Discussion and Analysis of Financial Condition and Results of Operations contains forward-looking statements that involve risks and uncertainties. Our actual results may differ materially from the results discussed in the forward-looking statements. Factors that might cause a difference include, but are not limited to, those discussed under Part I, Item 1A. Risk Factors in this Annual Report on Form 10-K. The following section is qualified in its entirety by the more detailed information, including our consolidated financial statements and the notes thereto, which appears elsewhere in this Annual Report on Form 10-K.\nOverview\nOrganization\nWe are a leading global provider of security products and solutions operating in two segments: Allegion Americas and Allegion International. We sell a wide range of security products and solutions for end-users in commercial, institutional and residential facilities worldwide, including the education, healthcare, government, hospitality, retail, commercial office and single and multi-family residential markets. Our leading brands include CISA, Interflex, LCN, Schlage, SimonsVoss and Von Duprin.  \nRecent Developments\nBusiness and Industry Trends and Outlook\nIn 2024, we delivered low-single-digit revenue growth in both our Allegion Americas and Allegion International segments, as well as operating margin expansion and strong cash flows from operations. We continued to execute our strategy of balanced capital allocation, evidenced by our acquisition activity, dividends paid and shares repurchased throughout the year.\nWithin our Allegion Americas segment, both the non-residential and residential businesses grew by a low single-digits percent compared to the prior year. Our Allegion International segment also grew by a low single-digits percent. We experienced a softening of demand within certain businesses in our Allegion International segment. \nElectronic security products and solutions revenue declined by a low single-digit percent in 2024, as comparisons to the prior year were impacted by supply chain dynamics. We expect growth in global electronic security product and solutions to continue to outperform growth in mechanical products and solutions over the long-term, as end-users continue to adopt newer technologies in their facilities and homes.\nWe expect continued growth in 2025, and for the security products industry to benefit from increased concerns about safety and security and technology-driven innovation.\nGlobal Trade and Macroeconomic Environment \nIn February 2025, the US government announced tariffs on imports from Mexico, Canada and China, countries from which we manufacture and/or import products and components. Subsequently, the tariffs on imports from Mexico and Canada were paused. We are evaluating the potential impact of these actions and considering what, if any, steps, including pricing actions, we take to mitigate the impact of the tariffs. \nThe demand trends and macroeconomic conditions discussed above and a number of other challenges and uncertainties that could affect our businesses are described under Part I, Item 1A, \"Risk Factors.\"\n2024 and 2023 Significant Events \nAcquisitions\nOn February 1, 2024, we, through our subsidiaries, acquired 100% of Boss Door Controls, a door solutions provider in the United Kingdom. Boss Door Controls is reported in the Allegion International segment.\nOn March 4, 2024, we, through our subsidiaries, acquired 100% of Montajes electronicos Dorcas S.L. (\"Dorcas\"), a manufacturer of electromechanical access control solutions based in Spain. Dorcas is reported in the Allegion International segment.\nOn June 3, 2024, we, through our subsidiaries, acquired 100% of Krieger Specialty Products, LLC (\"Krieger\"), a manufacturer of high-performance special purpose doors and windows based in the United States. Krieger is reported in the Company's Allegion Americas segment.\nOn June 10, 2024, we, through our subsidiaries, acquired 100% of Unicel Architectural Corp. (\"Unicel\"), a manufacturer of advanced glass, timber and aluminum building solutions based in Canada. Unicel is reported in the Company's Allegion Americas segment.\nOn October 18, 2024, we, through its subsidiaries, acquired 100% of SOSS Door Hardware (\"SOSS\"), a manufacturer of premium hinges and door hardware based primarily in the United States. SOSS is reported in the Company's Allegion Americas segment.\n30\nTable of Contents\nOn January 3, 2023, we, through our subsidiaries, acquired plano. group (\"plano\"), a SaaS workforce management solution business based in Germany. Plano is reported in our Allegion International segment.\n2023 Impairment of Intangible Assets\nAs discussed in Note 7 to the Consolidated Financial Statements, the results of our 2023 impairment test indicated that the estimated fair value of two indefinite-lived trade names in our International segment were determined to be less than book value. Consequently, intangible asset impairment charges totaling $7.5 million were recorded in 2023 in our Allegion International segment. The impairments related to declines in volumes which reduced the brands' expected future cash flows.\nFinancing Activities\nOn May 20, 2024, we amended and restated our Credit Facilities which, among other things, (i) increased the total commitment on the Revolving Facility from $500.0 million to $750.0 million, (ii) extended the maturity of the Revolving Facility from November 18, 2026 to May 20, 2029, and (iii) transitioned the benchmark interest rate from the Bloomberg Short-Term Bank Yield Index (“BSBY”) to the Secured Overnight Financing Rate (“SOFR”) for the Credit Facilities.\nOn May 29, 2024, Allegion US Holding Company Inc. (\"Allegion US Hold Co\"), our wholly-owned subsidiary, issued $400.0 million principal amount of 5.600% Senior Notes due 2034 (the “5.600% Senior Notes”). The 5.600% Senior Notes require semi-annual interest payments on May 29 and November 29, and mature on May 29, 2034. \nNet proceeds from the 5.600% Senior Notes were used to repay the $400.0 million outstanding on our 3.200% Senior Notes due 2024 (the \"3.200% Senior Notes\") on October 1, 2024.\nWe incurred and deferred a total of $7.6 million of discounts and financing costs associated with amending and restating our Credit Facilities and issuing our 5.600% Senior Notes, which is being amortized to Interest expense over their respective terms.\nDividends and Share Repurchases\nDuring 2024, we paid quarterly dividends of $0.48 per ordinary share to shareholders on record as of March 15, 2024, June 14, 2024, September 20, 2024, and December 17, 2024, for a total of $167.0 million, and repurchased approximately 1.6 million ordinary shares for approximately $220.0 million.\nDuring 2023, we paid quarterly dividends of $0.45 per ordinary share to shareholders on record as of March 15, 2023, June 15, 2023, September 18, 2023, and December 18, 2023, for a total of $158.7 million, and repurchased approximately 0.5 million ordinary shares for approximately $59.9 million.\n31\nTable of Contents\nResults of Operations - For the years ended December 31\nDollar amounts in millions, except per share amounts\n2024\n% of Net\nrevenues\n2023\n% of Net\nrevenues\nNet revenues\n$\n3,772.2 \n$\n3,650.8 \nCost of goods sold\n2,103.7 \n55.8 \n%\n2,069.3 \n56.7 \n%\nSelling and administrative expenses\n887.8 \n23.5 \n%\n865.6 \n23.7 \n%\nImpairment of intangible assets\n— \n— \n%\n7.5 \n0.2 \n%\nOperating income\n780.7 \n20.7 \n%\n708.4 \n19.4 \n%\nInterest expense\n102.0 \n93.1 \nOther income, net\n(20.1)\n \n(1.9)\n \nEarnings before income taxes\n698.8 \n617.2 \nProvision for income taxes\n101.3 \n \n76.6 \n \nNet earnings\n597.5 \n540.6 \nLess: Net earnings attributable to noncontrolling interests\n— \n \n0.2 \n \nNet earnings attributable to Allegion plc\n$\n597.5 \n \n$\n540.4 \n \nDiluted net earnings per ordinary share attributable to Allegion plc ordinary shareholders:\n$\n6.82 \n \n$\n6.12 \n \nThe discussions that follow describe the significant factors contributing to the changes in our results of operations for the years presented and form the basis used by management to evaluate the financial performance of the business. For a discussion of our results of operations for the year ended December 31, 2023, compared to the year ended December 31, 2022, see “Part II, Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations” of our 2023 Annual Report on Form 10-K filed with the SEC on February 20, 2024.\nNet Revenues\nNet revenues for the year ended December 31, 2024, increased by 3.3%, or $121.4 million, as compared to the year ended December 31, 2023, due to the following:\nPricing\n2.4 \n%\nVolume\n(0.3)\n%\nAcquisitions\n1.3 \n%\nCurrency exchange rates\n(0.1)\n%\nTotal\n3.3 \n%\nThe increase in Net revenues was driven by improved pricing and the impact from acquisitions made during the year. These increases were partially offset by lower volumes and unfavo\nrable foreign currency exchange rate movements.\nPricing includes increases or decreases of price, including discounts, surcharges and/or other sales deductions, on our existing products and services. Volume includes increases or decreases of revenue due to changes in unit volume of existing products and services, as well as new products and services.\nCost of Goods Sold\nFor the year ended December 31, 2024, Cost of goods sold as a percentage of Net revenues decreased to 55.8% from 56.7%, as compared to the year ended December 31, 2023, due to the following: \nPricing and productivity in excess of inflation and investment spending\n(0.8)\n%\nVolume / product mix\n(0.1)\n%\nAcquisitions\n0.1 \n%\nCurrency exchange rates\n(0.1)\n%\nTotal\n(0.9)\n%\nCost of goods sold as a percentage of Net revenues decreased primarily due to pricing and productivity, which exceeded the impacts from inflation and investment spending, favorable product mix and favorable foreign currency exchange rate movements. These decreases were partially offset by the impacts to gross margin associated with our acquired businesses. \nPricing and productivity in excess of inflation and investment spending includes the impact to Costs of goods sold from pricing, as defined above, in addition to productivity, inflation and investment spending. Productivity represents improvements in unit costs of materials and cost reductions related to improvements to our manufacturing design and processes. Inflation includes unit costs for the current period compared to the average actual cost for the prior period, multiplied by current year volumes. \n32\nTable of Contents\nExpenses related to increased head count for strategic initiatives, new facilities or other significant spending for strategic initiatives or new product and channel development, are captured in investment spending. Volume/product mix represents the impact due to increases or decreases of revenue due to changes in unit volume, including new products and services, including the effect of changes in the mix of products and services sold on Cost of goods sold.\nSelling and Administrative Expenses\nFor the year ended December 31, 2024, Selling and administrative expenses as a percentage of Net revenues decreased to 23.5% from 23.7%, as compared to the year ended December 31, 2023, due to the following:\nInflation in excess of productivity and investment spending\n0.1 \n%\nVolume leverage\n0.1 \n%\nAcquisitions\n(0.1)\n%\nRestructuring / integration / acquisition expenses\n(0.3)\n%\nTotal\n(0.2)\n%\nSelling and administrative expenses as a percentage of Net revenues decreased due to a year-over-year decrease in restructuring, integration, and acquisition expenses and the beneficial impacts from current and prior year acquisition activity. These decreases were partially offset by inflation in excess of productivity and investment spending, as well as the unfavorable impact of lower volumes. \nVolume leverage represents the contribution margin related to changes in sales volume, excluding the impact of price, productivity, mix and inflation. Expenses related to increased head count for strategic initiatives, new facilities or significant spending for strategic initiatives or new product and channel development, are captured in investment spending in the table above.\nOperating Income/Margin\nOperating income for the year ended December 31, 2024, increased $72.3 million as compared to the year ended December 31, 2023, and Operating margin increased to 20.7% from 19.4%, due to the following: \nIn millions\nOperating Income\nOperating Margin\nDecember 31, 2023\n$\n708.4 \n19.4 \n%\nPricing and productivity in excess of inflation and investment spending\n44.5 \n0.7 \n%\nVolume / product mix\n(1.2)\n— \n%\nCurrency exchange rates\n1.9 \n0.1 \n%\nAcquisitions\n10.0 \n— \n%\nRestructuring / integration / acquisition expenses\n9.6 \n0.3 \n%\nImpairment of intangible assets\n7.5 \n0.2 \n%\nDecember 31, 2024\n$\n780.7 \n20.7 \n%\nThe increase in Operating income was driven by pricing and productivity improvements in excess of inflation and investment spending, favorable foreign currency exchange rate movements, the contributions from recent acquisition activity, a year-over-year decrease in restructuring, integration, and acquisition costs and impairment charges on intangible assets recorded in the prior year. These increases were partially offset by unfavorable volume/product mix.\nThe increase in Operating margin was driven by pricing and productivity improvements in excess of inflation and investment spending, favorable foreign currency exchange rate movements, the year-over-year decrease in restructuring, integration and acquisition expenses, as well as the impairment charges recorded in the prior year. \nInterest Expense\nInterest expense for the year ended December 31, 2024, increased $8.9 million as compared to the year ended December 31, 2023, primarily due to higher outstanding indebtedness compared to the same period in the prior year.\n33\nTable of Contents\nOther Income, net\nThe components of Other income, net, for the years ended December 31 were as follows:\nIn millions\n2024\n2023\nInterest income\n$\n(20.5)\n$\n(6.8)\nCurrency translation loss\n2.2 \n3.9 \nEarnings and gains from the sale of equity method investments, net\n(1.1)\n(1.0)\nNet periodic pension and postretirement benefit (income) cost, less service cost\n(0.2)\n1.0 \nOther (income) expense\n(0.5)\n1.0 \nOther income, net\n$\n(20.1)\n$\n(1.9)\nFor the year ended December 31, 2024, Other income, net, increased $18.2 million compared to 2023, primarily due to higher cash on hand and higher interest rates earned on deposits. \nProvision for Income Taxes\nFor the year ended December 31, 2024, our effective tax rate was 14.5%, compared to 12.4% for the year ended December 31, 2023. The increase in the effective tax rate was primarily due to the enactment of Global Minimum Tax and the mix of income earned in higher tax rate jurisdictions.\nReview of Business Segments\nWe operate in and report financial results for two segments: Allegion Americas and Allegion International. These segments represent the level at which our chief operating decision maker (the \"CODM\") reviews our financial performance and makes operating decisions. \nSegment operating income is the measure of profit and loss that our CODM uses to evaluate the financial performance of the business and as the basis for resource allocation, performance reviews and compensation. For these reasons, we believe Segment operating income represents the most relevant measure of Segment profit and loss. Our CODM may exclude certain charges or gains, such as corporate charges and other special charges, to arrive at a Segment operating income that is a more meaningful measure of profit and loss upon which to base our operating decisions. We define Segment operating margin as Segment operating income as a percentage of the segment's Net revenues.\nThe segment discussions that follow describe the significant factors contributing to the changes in results for each segment included in Net Earnings. \nSegment Results of Operations - For the years ended December 31\nIn millions\n2024\n2023\n% Change\nNet revenues\nAllegion Americas\n$\n3,012.4 \n$\n2,913.6 \n3.4 \n%\nAllegion International\n759.8 \n$\n737.2 \n3.1 \n%\nTotal\n$\n3,772.2 \n$\n3,650.8 \nSegment operating income\nAllegion Americas\n$\n816.2 \n$\n757.2 \n7.8 \n%\nAllegion International\n66.3 \n58.1 \n14.1 \n%\nTotal\n$\n882.5 \n$\n815.3 \nSegment operating margin\nAllegion Americas\n27.1 \n%\n26.0 \n%\nAllegion International\n8.7 \n%\n7.9 \n%\nAllegion Americas\nOur Allegion Americas segment is a leading provider of security products, services and solutions throughout North America. The segment sells a broad range of products and solutions including, locks, locksets, portable locks, key systems, door controls and door control systems, exit devices, doors, glass and door systems, accessories, electronic security products, access control systems and software and service solutions to customers in commercial, institutional and residential facilities, including the education, healthcare, government, hospitality, retail, commercial office and single and multi-family residential markets. This segment’s primary brands are LCN, Schlage, Von Duprin and Stanley Access Technologies, which we utilize with permission in accordance with the terms of an agreement with Stanley Black & Decker (\"Stanley\" is the property of Stanley Logistics L.L.C).\n34\nTable of Contents\nNet revenues\nNet revenues for the year ended December 31, 2024, increased by 3.4%, or $98.8 million, as compared to the year ended December 31, 2023, due to the following:\n \nPricing\n2.6 \n%\nVolume\n(0.1)\n%\nAcquisitions\n1.0 \n%\nCurrency exchange rates\n(0.1)\n%\nTotal\n3.4 \n%\nThe increase in Net revenues was driven by improved pricing and the impact from our acquisitions made during the year. These increases were partially offset by slightly lower volumes and unfavorable foreign currency exchange rate movements.\nGrowth in Americas electronic security products and solutions is a metric monitored by management and a focus of our investors. Electronic products encompass both residential and non-residential products, and include all electrified product categories including, but not limited to, electronic and electrified locks, access control systems and electronic and electrified door controls and systems and exit devices. Net revenues from the sale of electronic products decreased by a low single-digits percent compared to 2023. In 2023, we experienced a low-twenties percent increase compared to 2022, driven by improvements around the availability of materials and components. We continue to believe electronic products are a long-term growth driver.\nOperating income/margin\nSegment operating income for the year ended December 31, 2024, increased $59.0 million, and Segment operating margin increased to 27.1% from 26.0% as compared to the year ended December 31, 2023, due to the following: \nIn millions\nOperating Income\nOperating Margin\nDecember 31, 2023\n$\n757.2 \n26.0 \n%\nPricing and productivity in excess of inflation and investment spending\n46.4\n0.9 \n%\nVolume / product mix\n0.7\n— \n%\nCurrency exchange rates\n1.4\n0.1 \n%\nAcquisitions\n8.0\n— \n%\nRestructuring/ integration / acquisition expenses\n2.5\n0.1 \n%\nDecember 31, 2024\n$\n816.2 \n27.1 \n%\nThe increase in Segment operating income was primarily driven by pricing and productivity improvements in excess of inflation and investment spending, favorable volume/product mix, favorable foreign currency exchange rate movements, operating income from our acquired businesses and a year-over-year decrease in restructuring, integration, and acquisition expenses.\nThe increase in Segment operating margin was driven by pricing and productivity improvements in excess of inflation and investment spending, favorable foreign currency exchange rate movements, and a year-over-year decrease in restructuring, integration and acquisition expenses.\nAllegion International\nOur Allegion International segment provides security products, services and solutions primarily throughout Europe, Asia and Oceania. The segment offers end-users a broad range of products, services and solutions including locks, locksets, portable locks, key systems, door controls and door control systems, exit devices, doors, electronic security products, access control systems, time and attendance and workforce productivity solutions, among other software and service solutions. This segment’s primary brands are AXA, CISA, Gainsborough, Interflex, and SimonsVoss.\nNet revenues\nNet revenues for the year ended December 31, 2024, increased by 3.1%, or $22.6 million, as compared to the year ended December 31, 2023, due to the following:\nPricing\n1.5 \n%\nVolume\n(1.1)\n%\nAcquisitions\n2.5 \n%\nCurrency exchange rates\n0.2 \n%\nTotal\n3.1 \n%\nThe increase in Net revenues was driven by improved pricing, the impact from our acquisitions made during the year and favorable foreign currency exchange rate movements. These increases were partially offset by lower volumes.\n35\nTable of Contents\nA softening demand throughout parts of Europe, Asia and Oceania in 2024 has impacted several of our businesses. Macroeconomic conditions in certain markets continue to be weak and the U.S. dollar has strengthened against most foreign currencies, particularly in the fourth quarter of 2024. As such, we currently expect foreign currency translation to have a negative impact on revenues in 2025.\nOperating income margin\nSegment operating income for the year ended December 31, 2024, increased $8.2 million, and Segment operating margin increased to 8.7% from 7.9% as compared to the year ended December 31, 2023, due to the following:\nIn millions\nOperating Income\nOperating Margin\nDecember 31, 2023\n$\n58.1 \n7.9 \n%\nPricing and productivity in excess of inflation and investment spending\n1.8 \n0.1 \n%\nVolume / product mix\n(1.9)\n(0.2)\n%\nCurrency exchange rates\n0.5 \n0.1 \n%\nAcquisitions\n2.0 \n0.1 \n%\nRestructuring/ integration / acquisition expenses\n(1.7)\n(0.2)\n%\nImpairment of intangible assets\n7.5 \n0.9 \n%\nDecember 31, 2024\n$\n66.3 \n8.7 \n%\nThe increases in Segment operating income and Segment operating margin were primarily driven by pricing and productivity improvements in excess of inflation and investment spending, favorable movements in foreign currency exchange rates, current year acquisition activity and impairment charges on intangible assets recorded in the prior year. These increases were partially offset by unfavorable volume/product mix and a year-over-year increase in restructuring, integration and acquisition expenses.\nLiquidity and Capital Resources\nLiquidity Outlook, Sources and Uses\nOur primary source of liquidity is cash provided by operating activities. Cash provided by operating activities is used to invest in new product development and fund capital expenditures and working capital requirements. Our ability to generate cash from our operating activities, our unused availability under the Revolving Facility and our access to the capital and credit markets enable us to fund these capital needs, execute our long-term growth strategies and return value to our shareholders. Further, our business operates with strong operating cash flows, low leverage and low capital intensity, providing us financial flexibility. \nOur short-term financing needs primarily consist of working capital requirements, restructuring initiatives, capital spending, dividend payments and principal and interest payments on our long-term debt. Long-term financing needs depend largely on potential growth opportunities, including potential acquisitions, repayment or refinancing of our long-term obligations and repurchases of our ordinary shares. Of our total outstanding indebtedness as of December 31, 2024, approximately 89% incurs fixed-rate interest and is therefore not exposed to the risk of rising variable interest rates. \nBased upon our operations, existing cash balances and unused availability under the Revolving Facility, as of December 31, 2024, we expect cash flows from operations to be sufficient to maintain a sound financial position and liquidity and to meet our financing needs for at least the next 12 months. Further, we do not anticipate any covenant compliance challenges with any of our outstanding indebtedness for at least the next 12 months. We also believe existing availability under the Credit Facilities and access to credit and capital markets are sufficient to achieve our longer-term strategic plans.\nThe following table reflects the major categories of cash flows for the years ended December 31. For additional details, see the Consolidated Statements of Cash Flows in the Consolidated Financial Statements.\nIn millions\n2024\n2023\nNet cash provided by operating activities\n$\n675.0 \n$\n600.6 \nNet cash used in investing activities\n(228.4)\n(129.1)\nNet cash used in financing activities\n(394.5)\n(298.7)\nOperating activities\n: Net cash provided by operating activities for the year ended December 31, 2024, increased by $74.4 million compared to 2023, driven primarily by higher net earnings and improvements in working capital. \nInvesting activities\n: Net cash used in investing activities for the year ended December 31, 2024, increased by $99.3 million compared to 2023, primarily due to the acquisition activity in 2024 and a $7.9 million increase in capital expenditures compared to 2023. These increases were partially offset by a decrease in other investments compared to 2023.\nFinancing activities\n: Net cash used in financing activities for the year ended December 31, 2024, increased by $95.8 million compared to 2023. The change in cash used in financing activities was primarily due to an increase in cash used for share repurchases and dividend payments, partially offset by lower net repayments on debt compared to 2023.\n36\nTable of Contents\nCapitalization\nAt December 31, long-term debt and other borrowings consisted of the following:\nIn millions\n2024\n2023\nTerm Facility\n$\n212.5 \n$\n225.0 \n3.200% Senior Notes due 2024\n— \n400.0 \n3.550% Senior Notes due 2027\n400.0 \n400.0 \n3.500% Senior Notes due 2029\n400.0 \n400.0 \n5.411% Senior Notes due 2032\n600.0 \n600.0 \n5.600% Senior Notes due 2034\n400.0 \n— \nOther debt\n— \n0.1 \nTotal borrowings outstanding\n2,012.5 \n2,025.1 \nDiscounts and debt issuance costs, net\n(13.0)\n(10.1)\nTotal debt\n1,999.5 \n2,015.0 \nLess current portion of long-term debt\n21.9 \n412.6 \nTotal long-term debt\n$\n1,977.6 \n$\n1,602.4 \nWe have an unsecured credit agreement in place, consisting of a $250.0 million term loan facility (the \"Term Facility\"), of which $212.5 million was outstanding at December 31, 2024, and a revolving credit facility (the \"Revolving Facility\" and, together with the Term Facility, the “Credit Facilities”), of which there was no balance outstanding at December 31, 2024. On May 20, 2024, we amended and restated the Credit Facilities which, among other things, (i) increased the total commitment on the Revolving Facility from $500.0 million to $750.0 million, (ii) extended the maturity of the Revolving Facility from November 18, 2026 to May 20, 2029, and (iii) transitioned the benchmark interest rate from the Bloomberg Short-Term Bank Yield Index (“BSBY”) to the Secured Overnight Financing Rate (“SOFR”) for the Credit Facilities.\nThe Term Facility requires quarterly principal payments through its maturity on November 18, 2026. Future payments total \n$21.9 million due in 2025 and $190.6 mill\nion due in 2026. We repa\nid $12.5 millio\nn of principal on the Term Facility during the year ended December 31, 2024. Principal amounts repaid on the Term Facility may not be reborrowed. The Revolving Facility aggregate commitments of up to $750.0 million includes up to $100.0 million for the issuance of letters of credit. We had  $18.5 million\n of\n letters of credit outstanding at December 31, 2024. Borrowings under the Revolving Facility may be repaid at any time without premium or penalty, and amounts repaid may be reborrowed.\nOutstanding borrowings under the Credit Facilities accrue interest, at our option, equal to either: (i) SOFR plus an applicable margin or (ii) a base rate plus the applicable margin. The applicable margin ranges from 0.875% to 1.375% depending on our credit ratings. At December 31, 2024, our outstanding borrowings under the Credit Facilities accrued interest at SOFR plus a margin of 1.225%, resulting in an interest rate of 5\n.582%. T\nhe Credit Facilities also contain negative and affirmative covenants and events of default that, among other things, limit or restrict our ability to enter into certain transactions. In addition, the Credit Facilities require us to comply with a maximum leverage ratio as defined in the credit agreement. As of December 31, 2024, we were in compliance with all applicabl\ne covenants under the credit agreement, and we do not anticipate any potential concerns for at least the next 12 months.\nAs of December 31, 2024, we also have $400.0 million outstanding of 3.550% Senior Notes due 2027 (the “3.550% Senior Notes”), $400.0 million outstanding of 3.500% Senior Notes due 2029 (the “3.500% Senior Notes”), $600.0 million outstanding of 5.411% Senior Notes due 2032 (the “5.411% Senior Notes”), and $400.0 million outstanding of our 5.600% Senior Notes (all four senior notes collectively, the \"Senior Notes\"). The 3.550% Senior Notes, 3.500% Senior Notes, 5.411% Senior Notes, and 5.600% Senior Notes all require semi-annual interest payments, and mature on October 1, 2027, October 1, 2029, July 1, 2032, and \nMay 29, 2034, \nrespectively.\nHistorically, the majority of our earnings were considered to be permanently reinvested in jurisdictions where we have made, and intend to continue to make, substantial investments to support the ongoing development and growth of our global operations. At December 31, 2024, we analyzed our working capital requirements and the potential tax liabilities that would be incurred if certain subsidiaries made distributions and concluded that no material changes to our historic permanent reinvestment assertions were required.\nScheduled future principal repayments on our outstanding indebtedness can be found in Note 9 to the Consolidated Financial Statements. Expected principal and interest payments related to our long-term indebtedness in 2025 amount to \n$21.9 million\n and\n approximately $95.0 million, respe\nctively, given our current level of indebtedness and effective interest rates as of December 31, 2024. \n37\nTable of Contents\nContractual Obligations and Other Commitments\nIn addition to the scheduled principal and interest payments discussed above, our material cash requirements include the following contractual and other obligations:\nPurchase Commitments \n– We occasionally enter into short-term, firm purchase commitments to mitigate pricing risk related to certain of our commodity, parts and component purchases, which represent commitments under enforceable and legally binding agreements. Such purchase commitments are made in the normal course of business and are not anticipated to materially impact our liquidity or financial position over the next 12 months.\nLeases \n– We have numerous real estate and equipment leasing arrangements for which we are a lessee. See Note 11 to the Consolidated Financial Statements for further information as to the short and long-term lease liabilities included within the Consolidated Balance Sheets, as well as future minimum lease payments for 2025 and future years.\nDefined Benefit Plans \n– Our investment objective in managing defined benefit plan assets is to ensure that all present and future benefit obligations are met as they come due. We seek to achieve this goal while trying to mitigate volatility in plan funded status, contributions and expense by matching the characteristics of the plan assets to that of the plan liabilities. Global asset allocation decisions are based on a dynamic approach whereby a plan's allocation to fixed income assets increases as the funded status increases. We monitor plan funded status, asset allocation and the impact of market conditions on our defined benefit plans regularly in addition to investment manager performance. None of our defined benefit plans have experienced a significant impact on their liquidity due to volatility in the markets.\nAt December 31, 2024, we had net pension assets of $5.3 million, which consist of plan assets of $473.0 million and benefit obligations of $467.7 million. It is our objective to contribute to our pension plans in order to ensure adequate funds are available to make benefit payments to plan participants and beneficiaries when required. At December 31, 2024, the funded status of our U.S. pension plans decreased to 100.8% from 101.6% at December 31, 2023. The funded status for our non-U.S. pension plans increased to 101.4% at December 31, 2024 from 98.5% at December 31, 2023. The funded status for all of our pension plans at December 31, 2024 increased to 101.1% from 99.9% at December 31, 2023. We currently expect to contribute approximately $5 million to our plans worldwide in 2025.\n \nDetermining the costs and obligations associated with our defined benefit plans is dependent on various actuarial assumptions including discount rates, expected returns on plan assets, employee mortality and turnover rates. Changes in any of the assumptions can have an impact on the net periodic pension benefit cost. An estimated 0.5% rate decline in the discount rate would have increased net periodic pension benefit cost by approximately $0.4 million in 2024, while a 0.5% rate decline in the estimated return on assets would have increased net periodic pension benefit cost by approximately $2.2 million. For further details on defined benefit plan activity, see Note 12 to the Consolidated Financial Statements. \nIncome Taxes \n– At December 31, 2024, we have total unrecognized tax benefits for uncertain tax positions of $44.5 million and $9.2 million of related accrued interest and penalties, net of tax, although we are unable to reasonably estimate the timing over which these liabilities might be paid. See Note 18 to the Consolidated Financial Statements for additional information regarding matters relating to income taxes, including unrecognized tax benefits and tax authority disputes.\nContingent Liabilities \n– We are involved in various litigation, claims and administrative proceedings, including those related to environmental, asbestos-related and product liability matters. We believe that these liabilities are subject to the uncertainties inherent in estimating future costs for contingent liabilities and will likely be resolved over an extended period of time. See Note 21 to the Consolidated Financial Statements for additional information.\nGuarantor Financial Information\nAllegion US Hold Co is or was, as applicable, the issuer of the 3.200% Senior Notes, 3.550% Senior Notes, 5.411% Senior Notes, and 5.600% Senior Notes and is the guarantor of the 3.500% Senior Notes. Allegion plc (the “Parent”) is or was, as applicable, the issuer of the 3.500% Senior Notes and is or was, as applicable, the guarantor of the 3.200% Senior Notes, 3.550% Senior Notes, 5.411% Senior Notes, and 5.600% Senior Notes. Allegion US Hold Co is directly or indirectly 100% owned by the Parent and each of the guarantees of Allegion US Hold Co and the Parent is full and unconditional and joint and several.\nThe 3.200% Senior Notes, 3.550% Senior Notes, 5.411% Senior Notes, and 5.600% Senior Notes are or were, as applicable, senior unsecured obligations of Allegion US Hold Co and rank equally with all of Allegion US Hold Co’s existing and future senior unsecured and unsubordinated indebtedness. The guarantee of the 3.200% Senior Notes, 3.550% Senior Notes, 5.411% Senior Notes, and 5.600% Senior Notes is or was, as applicable, the senior unsecured obligation of the Parent and ranks equally with all of the Parent’s existing and future senior unsecured and unsubordinated indebtedness. The 3.500% Senior Notes are senior unsecured obligations of the Parent and rank equally with all of the Parent’s existing and future senior unsecured and unsubordinated indebtedness. The guarantee of the 3.500% Senior Notes is the senior unsecured obligation of Allegion US Hold Co and ranks equally with all of Allegion US Hold Co's existing and future senior unsecured and unsubordinated indebtedness.\n38\nTable of Contents\nEach guarantee is effectively subordinated to any secured indebtedness of the applicable guarantor to the extent of the value of the assets securing such indebtedness. The Senior Notes are structurally subordinated to indebtedness and other liabilities of the subsidiaries of the applicable guarantor, none of which guarantee the notes. The obligations of the applicable guarantor under its guarantee are limited as necessary to prevent such guarantee from constituting a fraudulent conveyance under applicable law and, therefore, are limited to the amount that the applicable guarantor could guarantee without such guarantee constituting a fraudulent conveyance; this limitation, however, may not be effective to prevent such guarantee from constituting a fraudulent conveyance. If the guarantee was rendered voidable, it could be subordinated by a court to all other indebtedness (including guarantees and other contingent liabilities) of the applicable guarantor, and, depending on the amount of such indebtedness, the applicable guarantor’s liability on its guarantee could be reduced to zero. In such an event, the notes would be structurally subordinated to the indebtedness and other liabilities of the applicable guarantor.\nFor further details, terms and conditions of the Senior Notes refer to the Company’s Forms 8-K filed October 2, 2017, September 27, 2019 June 22, 2022, and May 29, 2024.\nThe following tables present the summarized financial information specified in Rule 1-02(bb)(1) of Regulation S-X for each issuer and guarantor. The summarized financial information has been prepared in accordance with Rule 13-01 of Regulation S-X.\nSelected Condensed Statement of Comprehensive Income Information\nYear ended December 31, 2024\nIn millions\nAllegion plc\nAllegion US Hold Co\nNet revenues\n$\n— \n$\n— \nGross profit\n— \n— \nOperating loss\n(7.8)\n(0.1)\nEquity earnings in affiliates, net of tax\n669.6 \n421.4 \nTransactions with related parties and subsidiaries\n(a)\n(31.4)\n(87.3)\nNet earnings\n597.5 \n311.4 \nNet earnings attributable to the entity\n597.5 \n311.4 \n(a) Transactions with related parties and subsidiaries include intercompany interest and fees.\nSelected Condensed Balance Sheet Information\nDecember 31, 2024\nIn millions\nAllegion plc\nAllegion US Hold Co\nCurrent assets:\nAmounts due from related parties and subsidiaries\n$\n0.1 \n$\n932.8 \nTotal current assets\n10.0 \n954.9 \nNoncurrent assets:\nAmounts due from related parties and subsidiaries\n— \n1,296.5 \nTotal noncurrent assets\n1,792.9 \n1,399.7 \nCurrent liabilities:\nAmounts due to related parties and subsidiaries\n$\n12.1 \n$\n801.4 \nTotal current liabilities\n48.0 \n824.2 \nNoncurrent liabilities:\nAmounts due to related parties and subsidiaries\n472.4 \n2,756.6 \nTotal noncurrent liabilities\n1,061.1 \n4,145.8 \nCritical Accounting Estimates\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations are based upon our Consolidated Financial Statements, which have been prepared in accordance with GAAP. The preparation of financial statements in accordance with GAAP requires management to use judgment in making estimates and assumptions based on the relevant information available at the end of each period. These estimates and assumptions have a significant effect on reported amounts of assets and liabilities, revenues and expenses as well as the disclosure of contingent assets and liabilities because they result primarily from the need to make estimates and assumptions on matters that are inherently uncertain. Actual results may differ from estimates. If updated information or actual amounts are different from previous estimates, the revisions are included in our results for the period in which they become known.\n39\nTable of Contents\nThe following is a summary of certain accounting estimates and assumptions made by management that we consider critical:\n•\nGoodwill \n– Goodwill is tested annually during the fourth quarter for impairment or when there is a significant change in events or circumstances that indicate the fair value of a reporting unit is, more likely than not, less than its carrying amount. Recoverability of goodwill is measured at the reporting unit level and starts with a comparison of the carrying amount of a reporting unit to its estimated fair value. If the estimated fair value of a reporting unit exceeds its carrying amount, goodwill of the reporting unit is not impaired. To the extent that the carrying value of a reporting unit exceeds its estimated fair value, a goodwill impairment charge will be recognized for the amount by which the carrying value of the reporting unit exceeds its fair value, not to exceed the carrying amount of the reporting unit's goodwill. \nAs quoted market prices are not available for our reporting units, the calculation of their estimated fair values is based on two valuation techniques, a discounted cash flow model (income approach) and a market multiple of earnings (market approach), with each method being weighted in the calculation. The income approach relies on our estimates of revenue growth rates, margin assumptions and discount rates to estimate future cash flows and explicitly addresses factors such as timing, with due consideration given to forecasting risk. These assumptions are subject to varying degrees of judgment and complexity. Estimates of future revenue growth rates and margin assumptions represent our best estimates of future cash flows given our expectations of market growth for the security products industry in the specific markets in which we operate, as well as factors such as our market positioning, brand strength, pricing and marketing efforts and other growth and productivity opportunities and initiatives. Discount rate assumptions represent our best estimates of market participant adjusted weighted-average costs of capital. Although these assumptions represent our best estimates as of the assessment date, certain factors could potentially create variances in these estimates, including, but not limited to:\n•\nDecreases in estimated market sizes or market growth rates due to greater than expected declines in volumes, pricing pressures or disruptive technology;\n•\nDeclines in our market share and penetration assumptions due to increased competition or an inability to develop or launch new products;\n•\nThe impacts of market volatility, including but not limited to, impacts of global pandemics, greater than expected inflation, supply chain disruption and delays, declines in pricing, reductions in volumes or fluctuations in foreign currency exchange rates; \n•\nThe level of success of on-going and future research and development efforts, including those related to acquisitions, and increases in the research and development costs necessary to obtain regulatory approvals and launch new products; and\n•\nVolatility in market interest rates that could impact the selection of an appropriate discount rate.\nThe market approach requires determining an appropriate peer group, which is utilized to derive estimated fair values of our reporting units based on selected market multiples. The market approach reflects the market’s expectations for future growth and risk, with adjustments to account for differences between the selected peer group companies and the subject reporting units. While market multiples are based on observable, arm’s-length evidence of value, these assumptions are still subject to inherent uncertainty, as the peer-group companies may differ in significant ways from one or more of our reporting units in terms of size, growth or business characteristics.\nThe critical accounting estimates and assumptions discussed above, include our estimates of revenue growth rates and margin assumptions, discount rates, our selection of an appropriate peer group and selected market multiples. These estimates and assumptions are considered critical, as they are subject to a high degree of judgment and complexity. Forecasted revenue growth rates and margin assumptions are updated annually and often fluctuate from year to year due to a myriad of factors, such as our assessment of the macroeconomic conditions throughout the major markets in which we do business, supply chain challenges, elevated levels of inflation in recent years and pricing initiatives to offset inflation, market acceptance of new product innovation, investments in productivity projects, restructuring efforts, among other economic, strategic and operational factors impacting our businesses. Discount rate and market multiple assumptions are similarly updated annually, based on our best estimates of market participants, which typically include observable, arm's length-evidence of value, where possible. While we make every effort to estimate fair value as accurately as possible with the information available at the assessment date, changes in assumptions and estimates may affect the estimated fair value of the reporting unit and could result in impairment charges in future periods. During our most recent annual impairment analysis, none of our reporting units were determined to be impaired.\n•\nIndefinite-lived intangible assets\n – Similar to goodwill, indefinite-lived intangible assets are tested annually during the fourth quarter for impairment or when there is a significant change in events or circumstances that indicate the fair value of the asset is, more likely than not, less than its carrying amount. Recoverability of indefinite-lived intangible assets is determined on a relief from royalty methodology, which is based on the implied royalty paid, at an appropriate discount rate, to license the use of an asset rather than owning the asset. The present value of the after-tax cost savings (i.e. royalty relief) indicates the estimated fair value of the asset. Any excess of the carrying value over the estimated fair value is recognized as an impairment loss equal to that excess. The critical assumptions utilized in our annual impairment analysis for indefinite-lived intangible assets include our estimates of revenue growth rate, royalty rates and discount rates, which often differ amongst our various indefinite-lived assets. We assess the appropriateness of each royalty rate \n40\nTable of Contents\nassumption annually, based on our assessment of observable market royalty rates and an analysis of the profitability of the primary business that owns or otherwise uses the indefinite-lived asset. Discount rate assumptions typically consider the discount rate conclusions for the reporting unit in which an underlying business operates, plus an incremental spread, where appropriate, to consider size, country or other company-specific risk. A significant change in any or a combination of the assumptions used to estimate fair value of our indefinite-lived intangible assets could have a negative impact on the estimated fair values. \n•\nIncome taxes\n – We account for income taxes in accordance with ASC Topic 740. Deferred tax assets and liabilities are determined based on temporary differences between financial reporting and tax bases of assets and liabilities, applying enacted tax rates expected to be in effect for the year in which the differences are expected to reverse. We recognize future tax benefits, such as net operating losses and non-U.S. tax credits, to the extent that realizing these benefits is considered in our judgment to be more likely than not. The recoverability of our deferred tax assets, which we consider to be a critical estimate, is reviewed regularly by considering our historic profitability, projected future taxable income, timing of the reversals of existing temporary differences and the feasibility of our tax planning strategies. Where appropriate, we record a valuation allowance with respect to future tax benefits. We establish valuation allowances against the realizability of any deferred tax assets based on our consideration of all available evidence, both positive and negative, using a “more likely than not” standard. This assessment considers the nature, frequency and amount of recent losses, the duration of statutory carryforward periods and tax planning strategies. Although our assessments of the valuation and recoverability of our deferred tax assets can change given a change in facts and circumstances (such as a change in a statutory tax rate), in making such judgments and estimates, significant weight is given to evidence that can be objectively verified. \nThe provision for income taxes also involves a significant amount of management judgment regarding interpretation of relevant facts and laws in the jurisdictions in which we operate. Future changes in applicable laws, projected levels of taxable income and tax planning could change the effective tax rate and tax balances recorded by us. In addition, tax authorities periodically review income tax returns filed by us and can raise issues regarding our filing positions, timing and amount of income or deductions and the allocation of income among the jurisdictions in which we operate. A significant period of time may elapse between the filing of an income tax return and the ultimate resolution of an issue raised by a tax authority with respect to that return. We believe we have adequately provided for any reasonably foreseeable resolution of these matters and will adjust our estimates if significant events so dictate. To the extent that the ultimate results differ from our original or adjusted estimates, the effect will be recorded in the Provision for income taxes in the period the matter is finally resolved.\n•\nBusiness combinations\n – The accounting for business combinations involves a considerable amount of judgment and estimation, including the identification of and fair values determined for acquired intangible assets, which typically include trade names, customer relationships and completed technologies. The determination of fair values of acquired intangible assets involves projections of future revenues and cash flows that are either discounted at an estimated discount rate or measured at an estimated royalty rate; fair values of other acquired assets and assumed liabilities, including potential contingent consideration; and the useful lives of the acquired assets. Due to the level of judgment and estimation required, in the case of significant acquisitions, we normally obtain the assistance of a third-party valuation specialist in estimating fair values of acquired tangible and intangible assets and assumed liabilities. An income approach or market approach (or both) is utilized in accordance with accepted valuation models to determine fair value. The determination of fair value of acquired assets typically requires the use of assumptions that include projections developed using historical information, internal forecasts, available industry and market data, estimates of revenue growth rates, profitability, customer attrition and discount and royalty rates, which are estimated at the time of acquisition, considering the perspective of marketplace participants. While we believe expectations and assumptions utilized for historical business combinations have been reasonable, they are inherently uncertain, and unanticipated market or macroeconomic events and circumstances occasionally do occur, and may occur in the future, which could affect the accuracy and validity of such assumptions. \nThe impact of future business combinations on our financial condition or results of operations may also be materially impacted by the change in or initial selection of assumptions and estimates, in addition to events and circumstances subsequent to the acquisition that are not reasonably anticipated when finalizing our purchase accounting estimates and assumptions.\nRecent Accounting Pronouncements\nSee Note 2 to our Consolidated Financial Statements for a discussion of recently issued and adopted accounting pronouncements.\n41\nTable of Contents",
  "item2": null
}