{
  "source_file": "amat-20241027.htm",
  "form_type": "10-K",
  "item1": "Item 1:     \nBusiness\nApplied Materials, Inc. is the leader in the materials engineering solutions used to produce virtually every semiconductor and advanced display in the world. We are experts in the design, development, production, and servicing of the critical wafer fabrication and display fabrication tools our customers need to manufacture semiconductors and displays. Our customers’ products are used in a wide variety of products such as personal computing devices, mobile phones, artificial intelligence (AI) and data center servers, automobiles, connected devices, industrial applications and consumer electronics. We have the semiconductor capital equipment industry’s most comprehensive portfolio of products. This breadth allows us the ability to connect and co-optimize technologies across our portfolio, enabling our customers to achieve superior results as manufacturing semiconductors and displays is becoming increasingly complex. Semiconductors provide the foundation for advances in technology that are reshaping the global economy, including artificial intelligence, internet of things, robotics, electric and autonomous vehicles, and clean energy.\nIncorporated in 1967, we are a Delaware corporation. Our fiscal year ends on the last Sunday in October. We operate in three reportable segments: Semiconductor Systems, Applied Global Services® (AGS), and Display. The Semiconductor Systems segment represents the largest contributor to our net revenue. A summary of financial information for each reportable segment is found in Note 14 of Notes to Consolidated Financial Statements. A discussion of factors that could affect operations is set forth under “Risk Factors” in Item 1A, which is incorporated herein by reference.\nSemiconductor Systems \nOur Semiconductor Systems segment designs, develops, manufactures and sells a wide range of primarily 300mm equipment used to fabricate semiconductor chips, also referred to as integrated circuits (ICs). The Semiconductor Systems segment consists of the semiconductor capital equipment industry’s most comprehensive portfolio of products used in the chip making process. Our products address steps across materials engineering, process control and advanced packaging, including the conversion of patterns into device structures, transistor and interconnect fabrication, metrology, inspection and review, and packaging technologies for connecting finished IC die. In addition to providing equipment for individual process steps, we have the ability to combine, co-optimize and integrate our technologies to develop highly differentiated solutions for our customers. Our equipment helps customers improve the power, performance, yield and costs of the semiconductor devices.\nOur patterning systems and technologies address challenges resulting from shrinking pattern dimensions and the growing complexity in vertical stacking found in today’s most advanced semiconductor devices. Our transistor and interconnect products and technologies enable continued power and performance improvements of 3D transistors. Our process control systems employ optical and eBeam technologies that allow customers to inspect and review critical semiconductor architectures throughout the manufacturing process, helping improve chip yields. Our advanced packaging systems use our materials engineering expertise to allow customers to connect multiple chips together through heterogeneous integration, enabling them to advance the technology roadmap beyond a single chip.\nOur Semiconductor Systems sales are to customers that serve the following markets: foundry, logic and other; DRAM; flash memory. Foundry, logic, and other is comprised of leading-edge and non-leading edge technology nodes. Leading-edge represents customers that are producing on the most advanced technology nodes. Non-leading edge technology nodes serve markets such as internet of things, communications, automotive, power and sensors.\n4\nTable of Contents\nApplied Global Services\nThe AGS segment provides services, spares and factory automation software to customer fabrication plants globally. The AGS segment also manufactures and sells 200mm and other equipment, which is shipped to customers globally that serve non-leading-edge markets.\nAGS’s transactional and subscription service products, spares and factory automation software is purchased by customers to optimize the performance of our large, global installed base of semiconductor, display and other equipment. These solutions are also used to optimize plant performance and productivity. Customer demand is fulfilled through a global distribution system in more than 200 locations and trained field engineers located near customer sites to support our semiconductor, display and other equipment worldwide.\nDisplay\nDisplay segment is comprised primarily of products for manufacturing liquid crystal displays (LCDs), organic light-emitting diodes (OLEDs), and other display technologies for TVs, monitors, laptops, personal computers (PCs), tablets, smartphones, and other consumer-oriented devices. While similarities exist between the technologies utilized in semiconductor and display fabrication, the most significant differences are in the size and composition of the substrate. Substrates used to manufacture display panels and other devices are typically glass, although newer flexible materials are entering the market. Display segment growth depends primarily on consumer demand for increasingly larger and more advanced TVs and high-resolution displays for mobile devices and information technology (IT) products, including laptops, monitors and tablets, as well as new form factors, including thin, light, curved and flexible displays, and new applications such as augmented and virtual reality. In addition to display applications, the segment’s Chemical Vapor Deposition (CVD) technology is used to manufacture solar energy cells. The expertise that we have in materials engineering on large glass substrates is synergistic with the advanced packaging business in the Semiconductor Products Group, as there is a trend in the industry to utilize various types of substrates, including glass.\n5\nTable of Contents\nBacklog\nWe manufacture systems to meet demand represented by order backlog and customer commitments. Backlog consisted of: (1) orders for which written authorizations have been accepted, or shipment has occurred but revenue has not been recognized; and (2) contractual service revenue and maintenance fees.\nBacklog by reportable segment as of October 27, 2024 and October 29, 2023 was as follows:\n \n2024\n2023\n \n(In millions, except percentages)\nSemiconductor Systems\n$\n8,259 \n52 \n%\n$\n11,127 \n65 \n%\nApplied Global Services\n6,767 \n43 \n%\n5,162 \n30 \n%\nDisplay\n827 \n5 \n%\n833 \n5 \n%\nCorporate and Other\n20 \n— \n%\n49 \n— \n%\nTotal\n$\n15,873 \n100 \n%\n$\n17,171 \n100 \n%\nOf the total backlog as of October 27, 2024, approximately 31% is not reasonably expected to be filled within the next 12 months.\nAs a result of new export rules and regulations issued in December 2024, backlog as of October 27, 2024 is expected to be reduced by approximately $549 million. This reduction would have resulted in total backlog as of October 27, 2024 of $15.3 billion, of which approximately 31% would not have been reasonably expected to be filled within 12 months.\nOur backlog on any particular date is not necessarily indicative of actual sales for any future periods. Our backlog is subject to change, including the potential for customer changes such as new orders or cancellations, and changes in export rules and regulations. Customers may delay delivery of products or cancel orders prior to shipment, subject to possible cancellation penalties. Delays in delivery schedules or a reduction of backlog during any particular period could have a material adverse effect on our business and results of operations.\nManufacturing, Raw Materials and Supplies\nOur worldwide manufacturing activities consist primarily of assembly, integration and test of various proprietary and commercial parts, components and subassemblies that are used to manufacture systems. We utilize a distributed manufacturing model under which manufacturing and supply chain activities are conducted in various countries, including United States, Singapore, Japan, China, Korea, Taiwan, Israel and other countries in Asia and Europe. We use qualified vendors, including contract manufacturers, to supply parts, services and product support. Our supply chain strategy commits to adhere to ethical labor practices, responsible minerals sourcing, Responsible Business Alliance and SEMI guidelines, and the Applied Materials Standards of Business Conduct as defined in our Environmental, Social and Governance (ESG) commitment. \nAlthough we make reasonable efforts to assure that parts are available from multiple qualified suppliers, this is not always possible. Accordingly, some key parts may be obtained from only a qualified single supplier or a limited group of qualified suppliers. We seek to reduce costs and to lower the risks of manufacturing and service interruptions by selecting and qualifying alternate suppliers for parts; monitoring the financial condition of key suppliers; maintaining appropriate inventories of parts; qualifying new parts on a timely basis; and ensuring quality and performance of parts.\nResearch, Development and Engineering\nOur long-term growth strategy requires continued development of new materials engineering solutions, including products and platforms that enable expansion into new and adjacent markets. Our significant investments in research, development and engineering (RD&E) must generally enable us to deliver new products and technologies before the emergence of strong demand, thus allowing customers to incorporate these products into their manufacturing plans during early-stage technology selection. We work closely with our global customers and ecosystem partners to design systems and processes that meet planned technical and production requirements. Our product development and engineering, and process support are performed primarily in the United States, India and Israel. Our customer demonstrations are performed primarily in the United States, China, Taiwan, Israel and South Korea.\n6\nTable of Contents\nMarketing and Sales\nBecause of the highly technical nature of our products, we market and sell products worldwide almost entirely through a direct sales force.\nWe have operations in many countries, with some of our business activities concentrated in certain geographic areas. Our business is based on capital equipment investments by major semiconductor, display and other manufacturers, and is subject to significant variability in customer demand for our products. Customers’ expenditures depend on many factors, including: general economic conditions; anticipated market demand and pricing for semiconductors, display technologies and other electronic devices; the development of new technologies; customers’ factory utilization; capital resources and financing; trade policies and export regulations; and government incentives. \nInformation on net revenue to unaffiliated customers and long-lived assets attributable to our geographic regions is included in Note 14 of Notes to Consolidated Financial Statements. The following companies accounted for at least 10 percent of our net revenue for the following fiscal years for products and services in multiple reportable segments.\n \n2024\n2023\nSamsung Electronics Co., Ltd.\n12%\n15%\nTaiwan Semiconductor Manufacturing Company Limited\n11%\n19%\n7\nTable of Contents\nCompetition\nThe industries in which we operate are highly competitive and characterized by rapid technological change. Our ability to compete generally depends on our ability to commercialize our technology in a timely manner, continually improve our products, and develop new products that meet constantly evolving customer requirements. Significant competitive factors include technical capability and differentiation, productivity, cost-effectiveness and the ability to support a global customer base. The importance of these factors varies according to customers’ needs, including product mix and respective product requirements, applications, and the timing and circumstances of purchasing decisions. Substantial competition exists across all the segments of our business. Competitors range from small companies that compete in a single region, which may benefit from policies and regulations that favor domestic companies, to global, diversified companies, which operate in more complex global economic and regulatory environments. We could see increased competition from domestic equipment manufacturers in China resulting from local government incentives and funding as well as export controls established by the United States government to restrict the sale of certain technologies to customers in China. Export controls enacted by the United States government that restrict the sale of certain technologies to customers in China may also provide an advantage to our international competitors. Our ability to compete requires a high level of investment in RD&E, marketing and sales, and global customer support activities. We believe that many of our products have strong competitive positions.\nThe competitive environment for each segment is described below.\nThe semiconductor industry is driven by demand for advanced electronic products, including smartphones and other mobile devices, servers, personal computers, automotive electronics, storage, and other products. The growth of data and emerging end-market drivers such as artificial intelligence, the internet of things, 5G networks, smart vehicles and augmented and virtual reality are also creating the next wave of growth for the industry. As a result, products within the Semiconductor Systems segment are subject to significant changes in customer requirements, including transitions to smaller dimensions, increasingly complex chip architectures, new materials and an increasing number of applications. While certain existing technologies may be adapted to new requirements, some applications create the need for an entirely different technological approach. The rapid pace of technological change can quickly diminish the value of current technologies and products and create opportunities for existing and new competitors. Our comprehensive portfolio offers a variety of differentiated products, including co-optimized and integrated materials solutions that enable unique films, structures and devices. We must successfully anticipate technology inflections, and our products must continuously evolve to satisfy customers’ requirements to compete effectively in the marketplace. We allocate resources among our numerous product offerings and therefore may decide not to invest in an individual product depending on market requirements. Competitors serving the semiconductor equipment industry range from companies offering a single product line to others offering multiple product lines, and those that serve a single region to global, diversified companies.\nThe products and services offered by the AGS segment enhance those of the Semiconductor Systems and Display segments, particularly in markets with demanding global service requirements. Competition in the AGS segment includes a diverse group of third-party service providers as well as customers that choose to perform their own service.\nTo compete effectively, we offer products and services to improve system performance, lower overall cost of ownership, and increase yields and productivity of customers’ fab operations. Significant competitive factors include cost-effectiveness and the level of technical service and support. The importance of these factors varies according to customers’ needs and the type of products or services offered.\nProducts in the Display segment are generally subject to strong competition from a number of major competitors primarily in Asia. We hold established market positions with our technically-differentiated LCD and OLED manufacturing solutions for PECVD, color filter PVD, PVD array, PVD touch panel, and TFT array testing, although our market position could change quickly due to customers’ evolving requirements. Important factors affecting the competitive position of our Display products include: industry trends, our ability to innovate and develop new products, and the extent to which our products are technically-differentiated, as well as which customers within a highly concentrated customer base are making capital equipment investments and our existing position at these customers.\n8\nTable of Contents\nPatents and Licenses\nProtection of our technology assets through enforcement of our intellectual property rights, including patents, is important for our competitive position. Our practice is to file patent applications in the United States and other countries for inventions that we consider significant. We have more than 22,000 active patents in the United States and other countries, and additional applications are pending for new inventions. Although we do not consider our business materially dependent upon any one patent, our rights and the products made and sold under our patents, taken as a whole, are a significant element of our business. In addition to our patents, we possess other intellectual property, including trademarks, know-how, trade secrets, and copyrights. \nWe enter into patent and technology licensing agreements with other companies when it is determined to be in our best interest. We pay royalties under patent license agreements for the use, in some of our products, of certain patented technologies. We also receive royalties from licenses granted to third parties. Royalties received from or paid to third parties have not been material to our consolidated results of operations.\nIn the normal course of business, we periodically address the possibility of patent infringement. In responding to such inquiries, it may become necessary or useful for us to obtain or grant licenses or other rights. However, there can be no assurance that such licenses or rights will be available to us on commercially reasonable terms, or at all. If we are not able to resolve or settle claims, obtain necessary licenses on commercially reasonable terms, or successfully prosecute or defend our position, our business, financial condition and results of operations could be materially and adversely affected.\nGovernmental Regulation\nAs a public company with global operations, we are subject to the laws and regulations of the United States and multiple foreign jurisdictions. These regulations, which differ among jurisdictions, include those related to financial and other disclosures, accounting standards, securities, corporate governance, public procurement and public funding, intellectual property, tax, trade (including import, export and customs), antitrust, cybersecurity, environment (including those related to sustainability and climate), health and safety employment, immigration and travel regulations, human rights, privacy, data protection and localization, and anti-corruption. \nSee “Risk Factors – Legal, Compliance, and Other Risks – We are exposed to risks related to the global regulatory environment” for further details.\nWe are regulated under various international laws regarding the purchase and sale of goods and related items, including but not limited to those related to trade policies and export regulations, and limitations on transfer of intellectual property. \nSee “Risk Factors – Business and Industry Risks – Global trade issues and changes in and uncertainties with respect to trade policies and export regulations, including import and export license requirements, trade sanctions, tariffs and international trade disputes, have adversely impacted and could further adversely impact our business and operations, and reduce the competitiveness of our products relative to local and global competitors” for further details.\nWith respect to environmental, health and safety regulations, we maintain a number of programs that are primarily preventative in nature and regularly monitor ongoing compliance with applicable laws and regulations. In addition, we have trained personnel to conduct investigations of any environmental, health, or safety incidents, including, but not limited to, spills, releases, or possible contamination. \nSee also “Risk Factors – Risks Related to Legal, Compliance, and Other Risks – We are subject to risks associated with environmental, health and safety regulations”\n \nfor further details.\nWe are subject to income taxes in the United States and foreign jurisdictions. Our provision for income taxes, effective tax rate and financial results could be affected by numerous factors, including changes in applicable tax laws, interpretations of applicable tax laws, amount and composition of pre-tax income in jurisdictions with differing tax rates, and valuation of deferred tax assets. There have been a number of proposed changes in the tax laws that could increase our tax liability. \nSee\n \n“Risk Factors – Operational and Financial Risks – We operate in jurisdictions with complex and changing tax laws” for further details\n. For additional discussions regarding the impact of compliance with income tax laws and regulations on our business and operations, \nsee also “Management’s Discussion and Analysis of Financial Condition and Results of Operations– Results of Operations – Income Taxes” and Note 12 of the Notes to the Consolidated Financial Statements.\n9\nTable of Contents\nOur People\nOur commitment to innovation begins with the commitment to creating an environment in which our employees can do their best work. Our ability to create differentiated value in the marketplace is driven by the capability of our people to anticipate technology inflections and integrate customer requirements. To achieve this level of value creation, we believe we must continue to attract, hire, develop and retain a world-class global workforce. We invest in our employees by providing quality training and learning opportunities, a compelling career path, promoting inclusion, equity and diversity, and upholding a high standard of ethics and respect for human rights. \nAs of October 27, 2024, we employed approximately 35,700 regular full-time employees, of whom approximately 45%, 43% and 12% resided in the Asia-Pacific region, North America, and Europe/Middle East, respectively. Our team spans 24 countries, reflecting various cultures, back grounds, race, color, national origin, religion, sex, sexual orientation, gender identity, ages, and disability, veteran and military status.\nCulture of Inclusion \nWe value great talent and different perspectives, knowing that diversity is one of our greatest strengths. We therefore strive to provide fair and equal opportunity for career development and advancement to all our employees and incorporate respect for diverse backgrounds and perspectives into our culture at every level – from strategy and policy down to everyday interactions.\nWe expect that our commitment to strengthening our culture of inclusion will broaden the diversity of our workplace and help us build a culture that benefits everyone. In recent years, we continued to make progress in our culture of inclusion journey, including, among other things, increasing female representation in the United States and global workforce, and increasing minority representation in the United States. As of October 27, 2024, our global workforce was 79.2% male and 20.6% female, and 19.8% of our workforce in the United States was composed of underrepresented minorities.\nTalent Acquisition and Retention\n \nWe believe that our future success is highly dependent upon our continued ability to attract, develop, retain and engage employees. As part of our effort to attract and retain employees, we offer competitive rewards, compensation and benefits, including an Employee Stock Incentive Plan, an Employees’ Stock Purchase Plan, healthcare and retirement benefits, parental and family leave, adoption credits, holiday and paid time off, and tuition assistance.\nEmployee Learning & Development \nWe seek to create growth and development opportunities to support an engaged and inclusive workforce. We promote holistic employee learning and development based on the 70/20/10 model--70% on-the-job learning, 20% social/collaborative and 10% formal training, with a focus on advancing technical skills as well as improving general business acumen to address increasing work complexity. Also, to help expand professional breadth, the segments and functions provide technical and job-specific training tied to their disciplines, while general professional, management, and leadership training is provided at the corporate level. All training is coordinated centrally and aligned with common objectives through Applied Global University. In addition to instructor-led and web-based training, we offer state-of-the-art training modalities, such as AI-based simulations and Augmented and Virtual Reality learning capabilities, to further the development of our new products, train our manufacturing and field support employees, and facilitate remote collaboration.\nEmployee Engagement\nWe have historically measured employee engagement through surveys to gain insight into employees’ experiences, levels of workplace satisfaction, and key drivers for engagement, inclusion and overall well-being. We plan to conduct an all-employee survey anonymously in fiscal 2025 through an external partner to encourage maximal participation and elicit candid responses. We also plan to benchmark the survey results against a large and standardized data set involving large technology companies globally. We expect that the survey results and the benchmarking data will allow us to better understand enterprise-wide trends, gauge effectiveness of interventions, and define targeted employee populations (e.g., early tenure employees). The survey results are also expected to provide leaders and people managers with actionable insights tailored to their own groups that can further enhance employee engagement and inclusion. These actionable insights will then be integrated with the people strategy process and cadence within the Company.\nAdditional information regarding our activities related to our people and sustainability, as well as our workforce diversity data, can be found in our latest Sustainability Report, which is located on our website at https://www.appliedmaterials.com/us/en/corporate-responsibility.html. The Sustainability Report is updated annually. This website address is intended to be an inactive textual reference only. None of the information on, or accessible through, our website is part of this Form 10-K or is incorporated by reference herein.\n10\nTable of Contents\nInformation about our executive officers\nThe following table and notes set forth information about our executive officers:\nName of Individual\nPosition\nGary E. Dickerson(1)\nPresident, Chief Executive Officer\nBrice Hill(2)\nSenior Vice President, Chief Financial Officer and Global Information Services\nPrabu Raja(3)\nPresident, Semiconductor Products Group\nTeri Little(4)\nSenior Vice President, Chief Legal Officer and Corporate Secretary\nOmkaram Nalamasu(5)\nSenior Vice President, Chief Technology Officer\nTimothy M. Deane(6)\nGroup Vice President, Applied Global Services\n(1)\nMr. Dickerson, age 67, was named President of Applied in June 2012 and appointed Chief Executive Officer and a member of the Board of Directors in September 2013. Before joining Applied, he served as Chief Executive Officer and a director of Varian Semiconductor Equipment Associates, Inc. (Varian) from 2004 until its acquisition by us in November 2011. Prior to Varian, Mr. Dickerson served 18 years with KLA-Tencor Corporation (KLA-Tencor), a supplier of process control and yield management solutions for the semiconductor and related industries, where he held a variety of operations and product development roles, including President and Chief Operating Officer. Mr. Dickerson started his semiconductor career in manufacturing and engineering management at General Motors’ Delco Electronics Division and then AT&T Technologies.\n(2)\nMr. Hill, age 58, has been Senior Vice President and Chief Financial Officer since March 2022. He also oversees Global Information Services for Applied. Prior to joining Applied, Mr. Hill was Executive Vice President and Chief Financial Officer of Xilinx, Inc., a company that designed and developed programmable devices and associated technologies, from April 2020 until its acquisition by Advanced Micro Devices, Inc. in February 2022. Prior to Xilinx, Mr. Hill served in various finance positions with Intel Corporation for 25 years, most recently as Corporate Vice President and Chief Financial Officer and Chief Operating Officer, Technology, Systems and Core Engineering Group. \n(3)\nDr. Raja, age 62, has been President, Semiconductor Products Group since March 2023. He previously served as Senior Vice President, Semiconductor Products Group of Applied from November 2017 to March 2023, and before that served in various senior management, product development and operational roles since joining Applied in 1995, including Group Vice President and General Manager of the Patterning and Packaging Group.\n(4)\nMs. Little, age 60, joined Applied as Senior Vice President, Chief Legal Officer and Corporate Secretary in June 2020. Prior to joining Applied, Ms. Little served as Executive Vice President, Chief Legal Officer and Corporate Secretary at KLA Corporation from August 2017 to June 2020. Prior to that she was Senior Vice President, General Counsel and Corporate Secretary of KLA Corporation from October 2015 until August 2017, and prior to that she held various other positions at KLA Corporation since 2002. Prior to joining KLA Corporation, she was a Senior Corporate Associate at Wilson Sonsini Goodrich & Rosati, and a Litigation Associate at Heller Ehrman White & McAuliffe.\n(5)\nDr. Nalamasu, age 66, has been Senior Vice President, Chief Technology Officer since June 2013, and President of Applied Ventures, LLC, Applied’s venture capital arm, since November 2013. He had served as Group Vice President, Chief Technology Officer from January 2012 to June 2013, and as Corporate Vice President, Chief Technology Officer from January 2011 to January 2012. Upon joining Applied in June 2006 until January 2011, Dr. Nalamasu was an Appointed Vice President of Research and served as Deputy Chief Technology Officer and General Manager for the Advanced Technologies Group. From 2002 to 2006, Dr. Nalamasu was a NYSTAR distinguished professor of Materials Science and Engineering at Rensselaer Polytechnic Institute, where he also served as Vice President of Research from 2005 to 2006. Prior to Rensselaer, Dr. Nalamasu served in several leadership roles at Bell Laboratories.\n(6)\nMr. Deane, age 59, has been Group Vice President, Applied Global Services since September 2022. He joined Applied in 1995 and previously served in various senior management and field operations roles, including head of Field Operations and Business Management for the Semiconductor Products Group, Account General Manager and Region General Manager. \n11\nTable of Contents\nAvailable Information\nOur website is http://www.appliedmaterials.com. We make available free of charge, on or through our website, our annual, quarterly and current reports, and any amendments to those reports, as soon as reasonably practicable after electronically filing such reports with, or furnishing them to, the SEC. The SEC’s website, www.sec.gov, contains reports, proxy and information statements, and other information regarding issuers that file electronically with the SEC. These website addresses are intended to be an inactive textual references only. None of the information on, or accessible through, these websites is part of this Form 10-K or is incorporated by reference herein.\n12\nTable of Contents",
  "item7": "Item 7:      \nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\nIntroduction\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations (MD&A) is intended to facilitate an understanding of our business and results of operations. This MD&A should be read in conjunction with our Consolidated Financial Statements and the accompanying Notes to Consolidated Financial Statements included elsewhere in this Form 10-K. The following discussion contains forward-looking statements and should also be read in conjunction with the cautionary statement set forth at the beginning of this Form 10-K. \nThe following section generally discusses 2024 and 2023 items and year-to-year comparisons between 2024 and 2023. Discussions of 2023 items and year-to-year comparisons between 2023 and 2022 that are not included in this Form 10-K can be found in \"Management's Discussion and Analysis of Financial Condition and Results of Operations\" in Part II, Item 7 of our Annual Report on Form 10-K for the fiscal year ended October 29, 2023, filed on December 15, 2023.\n \nOverview\nWe provide equipment, services and software to the semiconductor, display, and related industries. Our customers include manufacturers of semiconductor wafers and chips, liquid crystal and organic light-emitting diode (OLED) displays, and other electronic devices. Our customers’ products are used in a wide variety of products such as personal computing devices, mobile phones, artificial intelligence (AI) and data center servers, automobiles, connected devices, industrial applications and consumer electronics. Each of our segments is subject to variable industry conditions, as demand for equipment and services can change depending on supply and demand for chips, display technologies and other electronic devices, as well as other factors, such as global economic, political and market conditions, and the nature and timing of technological advances in fabrication processes. \nOur strategic priorities include developing products that help solve customers’ challenges at technology inflections; expanding our served market opportunities in the semiconductor and display industries; and growing our service business. Our long-term growth strategy requires continued development of new materials engineering capabilities, including products and platforms that enable expansion into new and adjacent markets. Our significant investments in research, development and engineering (RD&E) are intended to enable us to deliver new products and technologies before the emergence of strong demand, allowing customers to incorporate these products into their manufacturing plans during early-stage technology selection. We collaborate closely with our global customers to design systems and processes to meet their technical and production requirements.\nOur future operating results depend to a considerable extent on our ability to maintain a competitive advantage in the equipment and service products we provide. Development cycles depend on whether the product is an enhancement of an existing product, which typically has a shorter development cycle, or a new product, which typically has a longer development cycle. Most of our existing products resulted from internal development activities and innovations involving new technologies, materials and processes. In certain instances, we acquire technologies, either in existing or new product areas, to complement our existing technology capabilities and to reduce time to market. Product development and manufacturing activities occur primarily in the United States, Europe, Israel, and Asia. Our portfolio of equipment and service products are highly technical and are sold primarily through a direct sales force.\nWe believe that it is critical to make substantial investments in RD&E to assure the availability of innovative technology that meets the current and projected requirements of our customers’ most advanced designs. We have and continue to invest in RD&E in order to continue to offer new products and technologies.\nWe operate in three reportable segments: Semiconductor Systems, Applied Global Services® (AGS), and Display. A summary of financial information for each reportable segment is found in Note 14 of Notes to Consolidated Financial Statements. A discussion of factors that could affect our operations is set forth under “Risk Factors” in Part I, Item 1A, which is incorporated herein by reference. \nOur results are driven primarily by customer spending on capital equipment and services to support key technology transitions or to increase production volume in response to worldwide demand for semiconductors and displays. \n32\nTable of Contents\nThe Semiconductor Systems segment is comprised primarily of capital equipment used to fabricate semiconductor chips. Spending by semiconductor customers, which include companies that operate in the foundry, logic, memory, and other semiconductor chip markets, is driven by demand for products such as smartphones, mobile devices, personal computers, servers for artificial intelligence (AI) and data centers, automobiles, clean energy, storage, and other products, and the nature and timing of technological advances in fabrication processes. The growth of data and emerging end-market drivers such as AI, the internet of things, 5G networks, electric and autonomous vehicles and augmented and virtual reality are also creating the next wave of growth for the industry. As a result, products within the Semiconductor Systems segment are subject to significant changes in customer requirements, including transitions to smaller dimensions, increasingly complex chip architectures, new materials and an increasing number of applications. Spending can also depend on customer facility readiness and timeline for installation of capital equipment at customer sites. Development efforts are focused on solving customers’ key technical challenges in patterning, transistor, interconnect, process control, and packaging performance.\nThe AGS segment provides services, spares and factory automation software to customer fabrication plants globally to help customers optimize performance of our large, global installed base of semiconductor, display and other equipment. The AGS segment also includes 200mm and other equipment, which is shipped to many customers globally that serve the non-leading-edge end markets. Demand for AGS’ service and spares is driven by our large and growing installed base of manufacturing systems, and customers’ needs to shorten ramp times, improve system performance, and optimize factory output and operating costs. Industry conditions that affect AGS’ sales of spares and services are primarily characterized by changes in semiconductor manufacturers’ wafer starts and utilization rates, growth of the installed base of equipment and growing service intensity of newer tools. Our strategy is to continue to shift the AGS’ service and spares business to a subscription agreement model, improving customer factory performance and optimizing operating costs, and providing us a more predictable revenue stream.\nThe Display segment encompasses products for manufacturing liquid crystal and OLED displays, and other display technologies for TVs, monitors, laptops, personal computers (PC), tablets, smart phones, other consumer-oriented devices, equipment upgrades and solar energy cells. The segment is focused on expanding its presence through technologically-differentiated equipment and products that provide customers with improved performance and yields. Display segment growth depends primarily on consumer demand for increasingly larger and more advanced TVs and high-resolution displays for mobile devices and information technology (IT) products, including laptops, monitors and tablets, as well as new form factors, including thin, light, curved and flexible displays, and new applications such as augmented and virtual reality. The timing of customer investment in manufacturing equipment is also affected by the timing of next-generation process development and of capacity expansion to meet end-market demand.\nThe Corporate and Other category includes revenues and costs of product sold from other products, as well as certain operating expenses that are not allocated to our reportable segments and are managed separately at the corporate level. These operating expenses include costs for certain management, finance, legal, human resource, and RD&E functions performed at the corporate level; and unabsorbed information technology and occupancy. In addition, we do not allocate to our reportable segments severance, asset impairment and any associated charges related to restructuring actions, unless these actions pertain to a specific reportable segment. Effective in the first quarter of fiscal 2024, management began including share-based compensation expense in the evaluation of reportable segments' performance. Prior-year numbers have been recast to conform to the current-year presentation.\nThe United States government has implemented export regulations for U.S. semiconductor technology sold or provided to customers in China, which have limited our ability to provide certain products and services to customers in China, over the past several years. The U.S. government continues to issue new export licensing requirements, and additional updates and other requirements that have had the effect of further limiting our ability to provide certain products and services to customers outside the U.S., including in China. For a description of these risks, see the risk factor entitled “\nBusiness and Industry Risks - Global trade issues and changes in and uncertainties with respect to trade policies and export regulations, including import and export license requirements, trade sanctions, tariffs and international trade disputes, have adversely impacted and could further adversely impact our business and operations, and reduce the competitiveness of our products and services relative to local and global competitors\n” in Part I, Item 1A, “Risk Factors.”\n33\nTable of Contents\nResults of Operations\n  Our fiscal 2024 and 2023 each contained 52 weeks.\nThe following table presents certain significant measurements for the periods indicated:\n \n \nChange\n2024\n2023\n2024 over 2023\n \n \n(In millions, except per share amounts and percentages)\nNet revenue\n$\n27,176 \n$\n26,517 \n$\n659 \nGross margin\n47.5 \n%\n46.7 \n%\n0.8 points\nOperating income\n$\n7,867 \n$\n7,654 \n$\n213 \nOperating margin\n28.9 \n%\n28.9 \n%\n— points\nNet income\n$\n7,177 \n$\n6,856 \n$\n321 \nEarnings per diluted share\n$\n8.61 \n$\n8.11 \n$\n0.50 \nNet revenue by segment for the periods presented were as follows:\n \nChange\n \n2024\n2023\n2024 over 2023\n \n(In millions, except percentages)\nSemiconductor Systems\n$\n19,911 \n73%\n$\n19,698 \n74%\n1 \n%\nApplied Global Services\n6,225 \n23%\n5,732 \n22%\n9 \n%\nDisplay\n885 \n3%\n868 \n3%\n2 \n%\nCorporate and Other\n155 \n1%\n219 \n1%\n(29)\n%\nTotal\n$\n27,176 \n100%\n$\n26,517 \n100%\n2 \n%\nNet revenue for Semiconductor Systems by market for the periods presented were as follows:\n \n2024\n2023\nFoundry, logic and other\n68 \n%\n77 \n%\nDynamic random-access memory (DRAM)\n28 \n%\n17 \n%\nFlash memory\n4 \n%\n6 \n%\n100 \n%\n100 \n%\nNet revenue in fiscal 2024 increased as compared to the prior year. Gross margin increased primarily driven by lower material, freight, logistics, and manufacturing costs, favorable changes in customer and product mix and lower depreciation expense as a result of changes in certain assets’ useful lives effective as of the beginning of fiscal 2024, partially offset by an increase in labor costs.\nSemiconductor Systems net revenue increased in fiscal 2024 as compared to the prior year as customers continued to make strategic investments in new capacity and new technology transitions. Foundry and logic customers’ spending decreased driven primarily by lower customer investments in leading-edge manufacturing technologies, partially offset by increased customer investments in non-leading edge manufacturing technologies. Memory customers’ spending in fiscal 2024 was higher due to increased investments in DRAM technology transitions. Investments by semiconductor equipment customers are expected to remain strong with growth in the adoption of high-bandwidth memory and other forms of advanced packaging, continued demand for AI and data center computing, and for non-leading edge nodes. The Semiconductor Systems segment continued to represent the largest contributor of net revenue.\nOur AGS net revenue in fiscal 2024 increased primarily due to an increase in net revenue associated with long-term service agreements and customer spending on spares, partially offset by lower customer spending on 200mm equipment. Demand for services is expected to grow as our installed base of systems and chambers increases and customers renew long-term service agreements.\n34\nTable of Contents\nOur Display net revenue increased in fiscal 2024 compared to the prior year primarily due to higher customer investments in display fabrication equipment for IT products including laptops, monitors and tablets, partially offset by lower customer investments in display fabrication equipment for TVs.\nOver the longer term, we believe secular drivers such as AI, data center computing, the internet of things, 5G networks, electric and autonomous vehicles and augmented and virtual reality will create the next wave of growth for semiconductors and expand our served market opportunities.\nNet revenue by geographic region, determined by the location of customers’ facilities to which products were shipped and services were performed, was as follows:\nChange\n \n2024\n2023\n2024 over 2023\n \n(In millions, except percentages)\nChina\n$\n10,117 \n37%\n$\n7,247 \n27%\n40 \n%\nKorea\n4,493 \n17%\n4,609 \n18%\n(3)\n%\nTaiwan\n4,010 \n15%\n5,670 \n21%\n(29)\n%\nJapan\n2,154 \n8%\n2,075 \n8%\n4 \n%\nSoutheast Asia\n1,141 \n4%\n758 \n3%\n51 \n%\nAsia Pacific\n21,915 \n81%\n20,359 \n77%\n8 \n%\nUnited States\n3,818 \n14%\n4,006 \n15%\n(5)\n%\nEurope\n1,443 \n5%\n2,152 \n8%\n(33)\n%\nTotal\n$\n27,176 \n100%\n$\n26,517 \n100%\n2 \n%\nNet revenue increased from customers in China in fiscal 2024 primarily due to investments in semiconductor equipment and spending on spares and services, partially offset by a decrease in investments in 200mm equipment. Net revenue decreased from customers in Europe primarily due to lower investments in semiconductor equipment. Net revenue from customers in Taiwan decreased primarily due to lower investments in semiconductor equipment and spares, offset by higher spending on services. The changes in net revenue from customers in all other regions for fiscal 2024 primarily reflected changes in investment and spending on semiconductor equipment and services.\nOperating Expenses\nOperating expenses for the periods presented were as follows:\n \n \nChange\n \n2024\n2023\n2024 over 2023\n \n(In millions)\nResearch, development and engineering (RD&E)\n$\n3,233 \n$\n3,102 \n$\n131 \nMarketing and selling\n$\n836 \n$\n776 \n$\n60 \nGeneral and administrative\n$\n961 \n$\n852 \n$\n109 \nThe year-over-year change in RD&E expenses was primarily due to additional headcount to support our ongoing investments in product development initiatives, consistent with our growth strategy, offset by lower depreciation expense as a result of changes in certain assets’ useful lives effective as of the beginning of fiscal 2024. We continued to prioritize existing RD&E investments in technical capabilities and critical RD&E programs in current and new markets, with a focus on the development of new unit process systems and integrated materials solutions. Areas of investment in Semiconductor Systems include etch, deposition, metrology and inspection, patterning, packaging and other technologies to improve chip performance, power, area, cost and time-to-market. In Display, RD&E investments were focused on expanding our market opportunity with new display technologies.\nMarketing and selling expenses for fiscal 2024 increased primarily due to additional headcount.\nGeneral and administrative expenses in fiscal 2024 increased primarily due to the increases in share-based compensation expense and professional fees.\n35\nTable of Contents\nInterest Expense and Interest and Other Income (expense), net\nInterest expense and interest and other income (expense), net for the periods presented were as follows:\n \nChange\n \n2024\n2023\n2024 over 2023\n \n(In millions)\nInterest expense\n$\n247 \n$\n238 \n$\n9 \nInterest and other income (expense), net\n$\n532 \n$\n300 \n$\n232 \nInterest expense incurred was primarily associated with issued senior unsecured notes. Interest expense in fiscal 2024 increased slightly as a result of the issuance of senior unsecured notes in June 2024.\nInterest and other income (expense), net in fiscal 2024 increased primarily driven by higher interest income due to higher cash balances and lower impairment on equity investment, partially offset by higher net loss on equity investment.\nIncome Taxes\nProvision for income taxes and effective tax rates for the periods indicated were as follows:\n \nChange\n \n2024\n2023\n2024 over 2023\n \n(In millions, except percentages)\nProvision for income taxes\n$\n975 \n$\n860 \n$\n115 \nEffective income tax rate\n12.0 \n%\n11.1 \n%\n0.9 points\nOur provision for income taxes and effective tax rate are affected by the geographical composition of pre-tax income which includes jurisdictions with differing tax rates, conditional reduced tax rates and other income tax incentives. It is also affected by events that vary from period to period, such as changes in income tax laws and the resolution of prior years’ income tax filings.\nOur effective tax rate for fiscal 2024 was higher than the prior fiscal year primarily due to lower tax credits in fiscal 2024, partially offset by higher proportion of pre-tax income in lower tax jurisdictions in fiscal 2024.\n36\nTable of Contents\nSegment Operating Income\nOperating income by segment for the periods presented were as follows:\n \nChange\n \n2024\n2023\n2024 over 2023\n \n(In millions, except percentages and ratios)\nOperating income (loss)\nSemiconductor Systems\n$\n6,981 \n$\n6,879 \n$\n102 \n1 \n%\nApplied Global Services\n1,812 \n1,529 \n283 \n19 \n%\nDisplay\n51 \n114 \n(63)\n(55)\n%\nCorporate and Other\n(977)\n(868)\n(109)\n13 \n%\nTotal\n$\n7,867 \n$\n7,654 \n$\n213 \n3 \n%\nOperating margin\nSemiconductor Systems\n35.1 \n%\n34.9 \n%\n0.2 points\nApplied Global Services\n29.1 \n%\n26.7 \n%\n2.4 points\nDisplay\n5.8 \n%\n13.1 \n%\n(7.3) points\n \nSemiconductor Systems’ operating margin for fiscal 2024 increased primarily driven by lower material, freight, logistics and manufacturing costs, favorable changes in customer and product mix and lower depreciation expense as a result of changes in certain assets’ useful lives effective as of the beginning of fiscal 2024, partially offset by increased RD&E expenses.\nAGS’ operating margin for fiscal 2024 increased primarily due to the increase in net revenue and a favorable change in product mix.\nDisplay’s operating margin for fiscal 2024 decreased primarily due to unfavorable changes in product mix.\n37\nTable of Contents\nRecent Accounting Pronouncements\nAccounting Standards Not Yet Adopted\nDisaggregation of Income Statements Expenses\n. In November 2024, the Financial Accounting Standards Board (FASB) issued an accounting standard update to improve income statement expenses disclosures (Subtopic 220-40). The standard requires more detailed information related to the types of expenses, including (among other items) the amounts of purchases of inventory, employee compensation, depreciation and intangible asset amortization included within each interim and annual income statement’s expense caption, as applicable. This authoritative guidance can be applied prospectively or retrospectively and will be effective for us in fiscal 2028 for annual periods and in the first quarter of fiscal 2029 for interim periods, with early adoption permitted. We are evaluating the effect of this guidance on our consolidated financial statements and related disclosures.\nImprovements to Income Tax Disclosures\n. In December 2023, the FASB issued an accounting standard update to improve income tax disclosures (Topic 740). The standard prescribes specific categories for the components of the effective tax rate reconciliation, requires disclosure of income taxes paid by jurisdiction, and modifies other income tax-related disclosures. This authoritative guidance will be effective for us beginning with our annual reporting for fiscal year 2026, with early adoption permitted. We are evaluating the effect of this guidance on our consolidated financial statements and related disclosures.\nImprovements to Reportable Segment Disclosures\n. In November 2023, the FASB issued an accounting standard update to improve reportable segment disclosure requirements, primarily through enhanced disclosures about significant segment expenses (Topic 280). The standard requires interim and annual disclosure of significant segment expenses that are regularly provided to the chief operating decision-maker (CODM) and included within the reported measure of a segment’s profit or loss, requires interim disclosures about a reportable segment’s profit or loss and assets that are currently required annually, requires disclosure of the position and title of the CODM, clarifies circumstances in which an entity can disclose multiple segment measures of profit or loss and contains other disclosure requirements. This authoritative guidance will be effective for us in fiscal 2025 for annual periods and in the first quarter of fiscal 2026 for interim periods, with early adoption permitted. We are evaluating the effect of this guidance on our consolidated financial statements and related disclosures.\nFair Value Measurement of Equity Securities Subject to Contractual Sale Restrictions. \nIn June 2022, the FASB issued an accounting standard update which clarifies how the fair value of equity securities subject to contractual sale restrictions is determined (Topic 820). The amendment clarifies that a contractual sale restriction should not be considered in measuring fair value. It also requires certain qualitative and quantitative disclosures related to equity securities subject to contractual sale restrictions. We will adopt this guidance in the first quarter of fiscal 2025. The adoption of this guidance is not expected to have a significant impact on our consolidated financial statements.\nAccounting Standards Adopted\nFor a description of recently adopted accounting standards, including the date of adoption and the effect, if any, on our consolidated financial statements, see Note 1, “Summary of Significant Accounting Policies,” of the Notes to Consolidated Financial Statements.\n38\nTable of Contents\nFinancial Condition, Liquidity and Capital Resources\nOur cash, cash equivalents and investments consist of the following:\n \nOctober 27,\n2024\nOctober 29,\n2023\n \n(In millions)\nCash and cash equivalents\n$\n8,022 \n$\n6,132 \nShort-term investments\n1,449 \n737 \nLong-term investments\n2,787 \n2,281 \nTotal cash, cash-equivalents and investments\n$\n12,258 \n$\n9,150 \nSources and Uses of Cash\nA summary of cash provided by (used in) operating, investing, and financing activities is as follows:\n \n2024\n2023\n \n(In millions)\nCash provided by operating activities\n$\n8,677 \n$\n8,700 \nCash used in investing activities\n$\n(2,327)\n$\n(1,535)\nCash used in financing activities\n$\n(4,470)\n$\n(3,032)\nOperating Activities\nCash from operating activities for fiscal 2024 was $8.7 billion, which reflects net income adjusted for the effect of non-cash charges and changes in working capital components. Significant non-cash charges included depreciation, amortization, share-based compensation and deferred income taxes. Cash provided by operating activities in fiscal 2024 remained relatively flat primarily due to lower collections of customer receivable balances, partially offset by lower payments to vendors and higher net income.\nWe have agreements with various financial institutions to sell accounts receivable and discount promissory notes from selected customers. We sell our accounts receivable generally without recourse. From time to time, we also discount letters of credit issued by customers through various financial institutions. The discounting of letters of credit depends on many factors, including the willingness of financial institutions to discount the letters of credit and the cost of such arrangements. We sold $0.4 billion and $0.7 billion of accounts receivable during fiscal 2024 and 2023, respectively. We did not discount letters of credit issued by customers in fiscal 2024 and 2023. There was no discounting of promissory notes in each of fiscal 2024 and 2023.\nOur working capital was $12.8 billion at October 27, 2024 and $11.8 billion at October 29, 2023. \nDays sales outstanding of our accounts receivable at the end of fiscal 2024 and 2023 was 68 days and 70 days, respectively. Days sales outstanding varies due to the timing of shipments and payment terms. The decrease in days sales outstanding was primarily due to favorable revenue linearity.\nInvesting Activities\nWe used $2.3 billion and $1.5 billion of cash in investing activities in fiscal 2024 and 2023, respectively. Capital expenditures in fiscal 2024 and 2023 were $1.2 billion and $1.1 billion, respectively. Capital expenditures were primarily for investments in real property acquisitions and improvements, demonstration and testing equipment, manufacturing and network equipment. Purchases of investments, net of proceeds from sales and maturities of investments, for 2024 and 2023 was $1.1 billion and $404 million, respectively. Net cash paid for acquisitions in fiscal 2023 was $25 million. Investing activities also included investments in technology to allow us to access new market opportunities or emerging technologies.\nOur investment portfolio consists principally of investment grade money market mutual funds, U.S. Treasury and agency securities, municipal bonds, corporate bonds and mortgage-backed and asset-backed securities, as well as equity securities. We regularly monitor the credit risk in our investment portfolio and take appropriate measures, which may include the sale of certain securities, to manage such risks prudently in accordance with our investment policies.\n39\nTable of Contents\nFinancing Activities\nWe used $4.5 billion of cash in financing activities in fiscal 2024, consisting primarily of repurchases of common stock of $3.8 billion, cash dividends to stockholders of $1.2 billion, tax withholding payments for vested equity awards of $291 million, and net payments of principal on financing leases of $102 million, partially offset by net proceeds received from the issuance of senior unsecured notes of $694 million and proceeds received from common stock issuances of $243 million.\nWe used $3.0 billion of cash in financing activities in fiscal 2023, consisting primarily of repurchases of common stock of $2.2 billion, cash dividends to stockholders of $975 million and tax withholding payments for vested equity awards of $179 million, offset by proceeds received from common stock issuances of $227 million and net proceeds from issuances of commercial paper of $91 million.\nIn March 2023, our Board of Directors approved a common stock repurchase program authorizing $10.0 billion in repurchases, which supplemented the previously existing $6.0 billion authorization approved in March 2022. At October 27, 2024, approximately $8.9 billion remained available for future stock repurchases under the repurchase program.\nDuring each of fiscal 2024 and 2023 we paid four quarterly cash dividends, totaling $1.2 billion and $975 million, respectively. We currently anticipate that cash dividends will continue to be paid on a quarterly basis, although the declaration of any future cash dividend is at the discretion of the Board of Directors and will depend on our financial condition, results of operations, capital requirements, business conditions and other factors, as well as a determination by the Board of Directors that cash dividends are in the best interests of our stockholders.\nWe have credit facilities for unsecured borrowings in various currencies of up to $1.6 billion, of which $1.5 billion is comprised of a committed revolving credit agreement (Revolving Credit Agreement) with a group of banks. The Revolving Credit Agreement is scheduled to expire in February 2026, unless extended as permitted under the Revolving Credit Agreement. The Revolving Credit Agreement includes financial and other covenants with which we were in compliance as of October 27, 2024. No amounts were outstanding under the Revolving Credit Agreement as of October 27, 2024 and October 29, 2023. See Note 9\n,\n Borrowing Facilities and Debt, of the Notes to the Consolidated Financial Statements for further discussion related to our Revolving Credit Agreement and other credit facilities.\nWe have a short-term commercial paper program under which we may from time to time issue unsecured commercial paper notes of up to a total amount of $1.5 billion. The proceeds from the issuances of commercial paper are used for general corporate purposes. At October 27, 2024, we had $100 million of commercial paper notes outstanding. The commercial paper program is backstopped by the Revolving Credit Agreement and borrowings under the Revolving Credit Agreement reduce the amount of commercial paper notes we can issue.\nIn June 2024, we issued $700 million aggregate principal amount of 4.800% senior unsecured notes due 2029 in a registered public offering. The proceeds from the issuance of the senior unsecured notes are intended for general corporate purposes.\nWe had senior unsecured notes in the aggregate principal amount of $6.2 billion outstanding as of October 27, 2024. See Note 9 of the Notes to the Consolidated Financial Statements for additional discussion of existing debt. We may seek to refinance our existing debt and may incur additional indebtedness depending on our capital requirements and the availability of financing.\nOthers\nOn December 22, 2017, the U.S. government enacted the Tax Cuts and Jobs Act (Tax Act). The Tax Act requires a one-time transition tax on certain unrepatriated earnings of foreign subsidiaries. The transition tax expense is payable in installments over eight years, with eight percent due in each of the first five years starting with fiscal 2018. As of October 27, 2024, we had $459 million of total payments remaining, payable in installments in the next two years.\nOn August 9, 2022, the U.S. government enacted the U.S. CHIPS and Science Act (“CHIPS Act”). The CHIPS Act creates a 25% investment tax credit for certain investments in domestic semiconductor manufacturing. The credit is provided for qualifying property, which is placed in service after December 31, 2022, for which construction begins before January 1, 2027, and is treated as a government grant. We recognize this investment tax credit when there is reasonable assurance that we will qualify for the credit and the benefit will be received. Investments related to the 25% investment tax credit reduced our income taxes payable by $170 million as of October 27, 2024.\nOn August 16, 2022, the U.S. government enacted the Inflation Reduction Act. The Inflation Reduction Act introduced a new 15% corporate minimum tax, based on adjusted financial statement income of certain large corporations. Applicable corporations are allowed to claim a credit for the minimum tax paid against regular tax in future years. We are subject to the minimum tax in fiscal 2024 and expect to claim a credit for the minimum tax in future years.\n40\nTable of Contents\nSeveral countries where we do business have enacted global minimum tax regimes based on the Organization for Economic Cooperation and Development (“OECD”) Base Erosion and Profit Shifting Project. This will change various aspects of the existing framework under which our global tax obligations are determined and is expected to increase our tax liabilities beginning in fiscal 2025. The OECD continues to release additional guidance on this new global minimum tax framework. We will continue to monitor these developments, as each jurisdiction incorporates changes into its tax laws.\nOur conditional reduced tax rates in Singapore will expire in fiscal 2025, excluding potential renewal and subject to certain conditions with which we expect to comply. \nAlthough cash requirements will fluctuate based on the timing and extent of factors such as those discussed above, our management believes that cash generated from operations, together with the liquidity provided by existing cash balances and borrowing capability, will be sufficient to satisfy our liquidity requirements for the next 12 months. For further details regarding our operating, investing and financing activities, see the Consolidated Statements of Cash Flows in this report.\nFor details on standby letters of credit, guarantee instruments and other agreements with banks, see Off-Balance Sheet Arrangements below.\n41\nTable of Contents\nContractual Obligations and Off-Balance Sheet Arrangements\nWe have certain on-balance sheet and off-balance sheet obligation arrangements to make future payments under various contracts. Certain contractual arrangements which are recorded on our balance sheet include borrowing facilities and debts and lease obligations.\nBorrowing Facilities and Debt Obligations\nAs of October 27, 2024, we had $6.2 billion in aggregate principal amount of senior unsecured notes with varying maturities, of which $700 million is due within 12 months and the remaining notes are due beyond 12 months. Future interest payments associated with these unsecured notes were $2.8 billion, of which $239 million is due within 12 months and the remaining interest payments are due beyond 12 months. See Note 9\n,\n Borrowing Facilities and Debt, of the Notes to the Consolidated Financial Statements for further discussion related to our borrowing facilities and debt obligations.\nLease Obligations\nAs of October 27, 2024, our operating lease obligation was $384 million related to \nvarious operating lease arrangements for certain facilities, of which \n$96 million \nis payable within 12 months and the remaining amount is payable beyond 12 months.\nPurchase Obligations\nAs of October 27, 2024, we had $8.1 billion of purchase obligations for goods and services, of which $4.2 billion is payable within 12 months and the remaining amount is payable beyond 12 months.\nDeemed Repatriation Tax Payable\nAs of October 27, 2024, we had $459 million of transition tax liability, of which $204 million is payable within 12 months and the remaining amount is payable beyond 12 months. This transition tax liability is associated with the deemed repatriation of accumulated foreign earnings as a result of the enactment of the Tax Act.\nOther Long-term Liabilities\nWe also have the obligation to fund our pension, postretirement and deferred compensation plans. We evaluate the need to make contributions to our pension and postretirement benefit plans after considering the funded status of the plans, movements in the discount rate, performance of the plan assets and related tax consequences. Payments to the plans would be dependent on these factors and could vary across a wide range of amounts and time periods. Payments for deferred compensation plans are dependent on activity by participants, making the timing of payments uncertain. As of October 27, 2024, the total of our future expected benefit payments for the pension plans and the postretirement plan over the next ten fiscal years were $214 million, of which $14 million is payable within 12 months and the remaining amount is payable beyond 12 months.\nAs of October 27, 2024, the gross liability for unrecognized tax benefits that was not expected to result in payment of cash within one year was $521 million. Interest and penalties related to uncertain tax positions that were not expected to result in payment of cash within one year of October 27, 2024 was $181 million. At this time, we are unable to reliably estimate the timing of payments due to uncertainties in the timing of tax audit outcomes.    \nOff-Balance Sheet Arrangements\nIn the ordinary course of business, we provide standby letters of credit or other guarantee instruments to third parties as required for certain transactions initiated by either us or our subsidiaries. These include agreements with various banks to facilitate subsidiary banking operations worldwide, including overdraft arrangements. We also have agreements with various banks to facilitate subsidiary banking operations worldwide, including overdraft arrangements, issuance of bank guarantees, and letters of credit. See Note 13, Guarantees, Commitments and Contingencies, of the Notes to the Consolidated Financial Statements for further discussion relating to these arrangements.\n42\nTable of Contents\nCritical Accounting Estimates\nThe preparation of consolidated financial statements and related disclosures in conformity with accounting principles generally accepted in the United States of America requires management to make judgments, assumptions and estimates that affect the amounts reported.\nEstimates and assumptions about future events and their effects cannot be determined with certainty. We base our estimates on historical experience and on various other assumptions believed to be applicable and reasonable under the circumstances. These estimates may change as new events occur, as additional information is obtained and as our operating environment changes. These changes have historically been minor and have been included in the consolidated financial statements as soon as they became known. In addition, management is periodically faced with uncertainties, the outcomes of which are not within our control and will not be known for prolonged periods of time. These uncertainties include those discussed in Part I, Item 1A, “Risk Factors.”\nManagement believes that the following is a critical accounting estimate:\nIncome Taxes \nWe are subject to income taxes in the U.S. and numerous foreign jurisdictions. The calculation of our provision for income taxes and effective tax rate involves significant judgment in estimating the impact of uncertainties in the application of complex and evolving tax laws. Resolution of these uncertainties in a manner inconsistent with our expectations could have a material impact on our results of operations and financial condition. We recognize a current tax liability for the estimated amount of income taxes payable on tax returns for the current fiscal year. Deferred tax assets and liabilities are recognized for the estimated future tax effects of events that have been recognized in our financial statements or tax returns. These estimates consider future operational results including realizability of our deferred tax assets. Deferred tax assets and liabilities are adjusted to reflect the effects of enacted changes in tax rates, laws and status, including changes in tax incentives.\n43\nTable of Contents",
  "item2": null
}