{
  "source_file": "amt-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "ITEM 2.\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThis Quarterly Report on Form 10-Q (this “Quarterly Report”) contains statements about future events and expectations, or “forward-looking statements,” which relate to our goals, beliefs, strategies, plans or current expectations and other statements that are not of historical facts. For example, when we use words such as “project,” “plan,” “believe,” “anticipate,” “expect,” “forecast,” “estimate,” “intend,” “should,” “would,” “could,”\n \n“may” or other words that convey uncertainty of future events or outcomes, we are making forward-looking statements. Certain important factors may cause actual results to differ materially from those indicated by our forward-looking statements, including those factors set forth under the caption “Risk Factors” in Part I, Item 1A of our Annual Report on Form 10-K for the year ended December 31, 2024 (the “2024 Form 10-K”). Forward-looking statements represent management’s current expectations, beliefs and assumptions, and are inherently uncertain. We do not undertake any obligation to update our forward-looking statements.\nThe discussion and analysis of our financial condition and results of operations that follow are based upon our consolidated and condensed consolidated financial statements, which have been prepared in accordance with accounting principles generally accepted in the United States (“GAAP”). The preparation of our financial statements requires us to make estimates and assumptions that affect the reported amounts of assets and liabilities, revenues and expenses, and the related disclosure of contingent assets and liabilities at the date of our financial statements. Actual results may differ from these estimates and such differences could be material to the financial statements. This discussion should be read in conjunction with our consolidated and condensed consolidated financial statements herein and the accompanying notes, information set forth under the caption “Critical Accounting Policies and Estimates” in the 2024 Form 10-K, and in particular, the information set forth therein under Item 7 “Management’s Discussion and Analysis of Financial Condition and Results of Operations.” \nDuring the fourth quarter of 2024, following recent divestitures, including the ATC TIPL Transaction (as defined below), and changes to our organizational structure, we reviewed and changed our reportable segments. Our APAC property segment and our Africa property segment were combined into the Africa & APAC property segment. As a result, we now report our results in six segments: U.S. & Canada property (which includes all assets in the United States and Canada, other than our data center facilities and related assets), Africa & APAC property, Europe property, Latin America property, Data Centers and Services. In evaluating financial performance in each business segment, management uses, among other factors, segment gross margin and segment operating profit (see note 15 to our consolidated and condensed consolidated financial statements included in this Quarterly Report). Historical financial information included in Management’s Discussion and Analysis of Financial Condition and Results of Operations has been adjusted to reflect the change in reportable segments.\nIn 2023, we initiated a strategic review of our India business, as further discussed below under “Results of Operations—Loss from Discontinued Operations, Net of Taxes.” The strategic review concluded in January 2024 with the signed agreement for the ATC TIPL Transaction. The ATC TIPL Transaction received all government and regulatory approvals during the three months ended September 30, 2024. On September 12, 2024, we completed the ATC TIPL Transaction and received total consideration of 182 billion INR (approximately $2.2 billion). ATC TIPL’s operating results are presented as discontinued operations. See discussion below and note 16 to our consolidated and condensed consolidated financial statements included in this Quarterly Report (“Note 16”) for further discussion. Historical financial information included in Management’s Discussion and Analysis of Financial Condition and Results of Operations has been adjusted to reflect the operating results of ATC TIPL as discontinued operations for all periods presented.\nOverview\nWe are one of the largest global real estate investment trusts and a leading independent owner, operator and developer of multitenant communications real estate. Our primary business is the leasing of space on communications sites to wireless service providers, radio and television broadcast companies, wireless data providers, government agencies and municipalities and tenants in a number of other industries. In addition to the communications sites in our portfolio, we manage rooftop and tower sites for property owners under various contractual arrangements. We also hold other telecommunications infrastructure and property interests that we lease primarily to communications service providers and third-party tower operators, and, as discussed further below, we hold a portfolio of highly interconnected data center facilities and related assets in the United States. Our customers include our tenants, licensees and other payers. We refer to the business encompassing the above as our property operations, which accounted for 96% and 97% of our total revenues for the three and nine months ended September 30, 2025, respectively, and includes our U.S. & Canada property, Africa & APAC property, Europe property and Latin America property segments and Data Centers segment.\n32\nWe also offer tower-related services in the United States, including site application, zoning and permitting, structural and mount analyses, and construction management, which primarily support our site leasing business, including the addition of new tenants and equipment on our sites.\nThe following table details the number of communications sites, excluding managed sites, that we owned or operated as of September 30, 2025:\n \nNumber of\nOwned Towers\nNumber of\nOperated \nTowers (1)\nNumber of\nOwned DAS Sites\nU.S. & Canada:\nCanada\n225 \n— \n— \nUnited States\n26,736 \n14,860 \n431 \nU.S. & Canada total\n26,961 \n14,860 \n431 \nAfrica & APAC:\nBangladesh\n976 \n— \n— \nBurkina Faso\n733 \n— \n— \nGhana\n3,441 \n— \n37 \nKenya\n4,456 \n— \n11 \nNiger\n929 \n— \n— \nNigeria\n9,424 \n— \n— \nPhilippines\n382 \n— \n— \nSouth Africa\n2,484 \n— \n— \nUganda\n4,515 \n— \n37 \nAfrica & APAC total\n27,340 \n— \n85 \nEurope:\nFrance\n4,218 \n303 \n9 \nGermany\n15,386 \n— \n— \nSpain \n12,376 \n— \n1 \nEurope total\n31,980 \n303 \n10 \nLatin America:\nArgentina\n497 \n— \n11 \nBrazil\n20,901 \n1,434 \n125 \nChile\n3,682 \n— \n107 \nColombia\n4,916 \n— \n6 \nCosta Rica\n712 \n— \n2 \nMexico\n8,727 \n185 \n85 \nParaguay\n1,450 \n— \n— \nPeru\n3,973 \n450 \n1 \nLatin America total\n44,858 \n2,069 \n337 \n_______________\n(1)\nApproximately 98% of the operated towers are held pursuant to long-term finance leases, including those subject to purchase options.\n33\nAs of September 30, 2025, our property portfolio included 30 operating data center facilities across 11 markets in the United States that collectively comprise approximately 3.6 million net rentable square feet (“NRSF”) of data center space, as follows:\nNumber of Data Centers\nTotal NRSF (1)\n(in thousands)\nSan Francisco Bay, CA\n9\n1,051\nLos Angeles, CA\n3\n724\nNorthern Virginia, VA\n3\n604\nNew York, NY\n3\n376\nChicago, IL\n2\n272\nDenver, CO\n2\n151\nBoston, MA\n1\n124\nOrlando, FL\n1\n104\nAtlanta, GA\n2\n95\nMiami, FL\n2\n89\nWashington, D.C.\n2\n47\nTotal\n30\n3,637 \n_______________\n(1)\nExcludes approximately 0.4 million of office and light industrial NRSF. \nSale of South Africa Fiber\n— On March 6, 2025, we completed the sale of our fiber assets in South Africa (“South Africa Fiber”). Prior to the divestiture, South Africa Fiber’s operating results were included within the Africa & APAC property segment.\nThe 2024 Form 10-K contains information regarding management’s expectations of long-term drivers of demand for our communications sites, as well as key trends, which management believes provide valuable insight into our operating and financial resource allocation decisions. The discussion below should be read in conjunction with the 2024 Form 10-K and, in particular, the information set forth therein under Item 7 “Management’s Discussion and Analysis of Financial Condition and Results of Operations—Executive Overview.”\nWe are currently engaged in a legal dispute (the “Arbitration”) with one of our customers in Mexico, AT&T Comunicaciones Digitales, S. de R.L. de C.V. and related entities (collectively, “AT&T Mexico”). AT&T Mexico, which represented approximately $300 million of tenant revenue in 2024, is challenging the calculation of the monthly lease amount established under our Master Lease Agreement with AT&T Mexico (the “MLA”), as well as certain other provisions of the MLA, seeking rent abatement both retroactively and prospectively, and had been withholding tower rents since the start of 2025. We incurred approximately $19 million of reserves through the third quarter of 2025, and expect approximately $30 million of reserves for the full year, related to this customer. We expect to record future reserves until the Arbitration is settled. We believe we have meritorious defenses to the claims raised in this Arbitration, are vigorously defending the full enforceability of the MLA and remain confident in the terms and conditions of the MLA. The Arbitration is scheduled for a hearing in August 2026.\nOn September 23, 2025, we and AT&T Mexico reached an agreement pursuant to which AT&T Mexico will remit payment of the majority of the withheld tower rents and will resume monthly payments of the majority of its owed tower rents going forward. The remainder of the outstanding receivables and the future monthly tower rent amounts not remitted directly to us will be deposited into an irrevocable escrow account, overseen by an independent trustee, to be released in accordance with a final ruling in the Arbitration or by mutual consent of us and AT&T Mexico.\n34\nIn most of our markets, our tenant leases for our communications sites with wireless carriers generally have initial non-cancellable terms of five to ten years with multiple renewal terms. Accordingly, the vast majority of the revenue generated by our property operations during the nine months ended September 30, 2025 was recurring revenue that we should continue to receive in future periods. Most of our tenant leases for our communications sites have provisions that periodically increase or “escalate” the rent due under the lease, typically based on (a) an annual fixed escalation (averaging approximately 3% in the United States), (b) an inflationary index in most of our international markets, or (c) a combination of both. In addition, certain of our tenant leases provide for additional revenue primarily to cover costs (pass-through revenue), such as ground rent or power and fuel costs.\nBased upon existing customer leases and foreign currency exchange rates as of September 30, 2025, we expect to generate over $54 billion of non-cancellable customer lease revenue over future periods, before the impact of straight-line lease accounting. \nThe revenues generated by our property operations may be affected by cancellations of existing tenant leases. As discussed above, most of our tenant leases with wireless carriers and broadcasters are multiyear contracts, which typically are non-cancellable; however, in some instances, a lease may be cancelled upon the payment of a termination fee. Revenue lost from either tenant lease cancellations or the non-renewal of leases or rent renegotiations, which we refer to as churn, has historically not had a material adverse effect on the revenues generated by our consolidated property operations. During the nine months ended September 30, 2025, churn was approximately 2% of our tenant billings, primarily driven by churn in our U.S. & Canada property segment, as discussed below.\nWe expect that our churn rate in our U.S. & Canada property segment will remain elevated through 2025 due to contractual lease cancellations and non-renewals by T-Mobile, including legacy Sprint Corporation leases, pursuant to the terms of our master lease agreement with T-Mobile US, Inc. entered into in September 2020.\nNon-GAAP Financial Measures \nIncluded in our analysis of our results of operations are discussions regarding earnings before interest, taxes, depreciation, amortization and accretion, as adjusted (“Adjusted EBITDA”), Funds From Operations, as defined by the National Association of Real Estate Investment Trusts (“Nareit FFO”) attributable to American Tower Corporation common stockholders, Adjusted Funds From Operations (“AFFO”) attributable to American Tower Corporation common stockholders (“AFFO attributable to American Tower Corporation common stockholders”) and Segment gross margin.\nWe define Adjusted EBITDA as Net income before Income (loss) from equity method investments; Income (loss) from discontinued operations, net of taxes; Income tax benefit (provision); Other income (expense); Gain (loss) on retirement of long-term obligations; Interest expense; Interest income; Other operating income (expense), including Goodwill impairment; Depreciation, amortization and accretion; and stock-based compensation expense.\nNareit FFO attributable to American Tower Corporation common stockholders is defined as net income before gains or losses from the sale or disposal of real estate, real estate related impairment charges, real estate related depreciation, amortization and accretion, and including adjustments and distributions for unconsolidated affiliates and noncontrolling interests and adjustments for discontinued operations. In this section, we refer to Nareit FFO attributable to American Tower Corporation common stockholders as “Nareit FFO (common stockholders).”\nWe define AFFO attributable to American Tower Corporation common stockholders as Nareit FFO (common stockholders) before (i) straight-line revenue and expense; (ii) stock-based compensation expense; (iii) the deferred portion of income tax and other income tax adjustments; (iv) non-real estate related depreciation, amortization and accretion; (v) amortization of deferred financing costs, debt discounts and premiums and long-term deferred interest charges; (vi) other income (expense); (vii) gain (loss) on retirement of long-term obligations; and (viii) other operating income (expense); less cash payments related to capital improvements and cash payments related to corporate capital expenditures and including adjustments and distributions for unconsolidated affiliates and noncontrolling interests and adjustments for discontinued operations, which includes the impact of noncontrolling interests and discontinued operations on both Nareit FFO and the corresponding adjustments included in AFFO. In this section, we refer to AFFO attributable to American Tower Corporation common stockholders as “AFFO (common stockholders).”\nWe define Segment gross margin as segment revenue less segment operating expenses, excluding depreciation, amortization and accretion; selling, general, administrative and development expense; and other operating expenses.\n35\nAdjusted EBITDA, Nareit FFO (common stockholders), AFFO (common stockholders) and Segment gross margin are not intended to replace net income or any other performance measures determined in accordance with GAAP. None of Adjusted EBITDA, Nareit FFO (common stockholders), AFFO (common stockholders) or Segment gross margin represents cash flows from operating activities in accordance with GAAP and, therefore, these measures should not be considered indicative of cash flows from operating activities, as a measure of liquidity or a measure of funds available to fund our cash needs, including our ability to make cash distributions. Rather, Adjusted EBITDA, Nareit FFO (common stockholders), AFFO (common stockholders) and Segment gross margin are presented as we believe each is a useful indicator of our current operating performance. We believe that these metrics are useful to an investor in evaluating our operating performance because (1) each is a key measure used by our management team for decision making purposes and for evaluating our operating segments’ performance; (2) Adjusted EBITDA is a component underlying our credit ratings; (3) Adjusted EBITDA is widely used in the telecommunications real estate sector to measure operating performance as depreciation, amortization and accretion may vary significantly among companies depending upon accounting methods and useful lives, particularly where acquisitions and non-operating factors are involved; (4) AFFO (common stockholders) is widely used in the telecommunications real estate sector to adjust Nareit FFO (common stockholders) for items that may otherwise cause material fluctuations in Nareit FFO (common stockholders) growth from period to period that would not be representative of the underlying performance of property assets in those periods; (5) Segment gross margin provides valuable insight into the site-level profitability of our assets; (6) each provides investors with a meaningful measure for evaluating our period-to-period operating performance by eliminating items that are not operational in nature; and (7) each provides investors with a measure for comparing our results of operations to those of other companies, particularly those in our industry.\nOur measurement of Adjusted EBITDA, Nareit FFO (common stockholders), AFFO (common stockholders) and Segment gross margin may not, however, be fully comparable to similarly titled measures used by other companies. Reconciliations of Adjusted EBITDA, Nareit FFO (common stockholders) and AFFO (common stockholders) to net income and Segment gross margin to gross margin, the most directly comparable GAAP measures, have been included below.\n36\nResults of Operations\nThree and Nine Months Ended\n \nSeptember 30, 2025\n \nand\n \n2024 \n(in millions, except percentages)\nRevenue\n \nThree Months Ended September 30,\nPercent Increase (Decrease)\nNine Months Ended September 30,\nPercent Increase (Decrease)\n \n2025\n2024\n2025\n2024\nProperty\nU.S. & Canada\n$\n1,318.8 \n$\n1,318.0 \n0 \n%\n$\n3,924.2 \n$\n3,944.1 \n(1)\n%\nAfrica & Asia-Pacific (1)\n370.8 \n302.6 \n23 \n1,040.7 \n898.9 \n16 \nEurope\n243.6 \n212.8 \n14 \n689.3 \n620.5 \n11 \nLatin America\n416.5 \n402.8 \n3 \n1,205.1 \n1,297.0 \n(7)\nData Centers\n266.6 \n233.7 \n14 \n772.6 \n689.1 \n12 \nTotal property\n2,616.3 \n2,469.9 \n6 \n7,631.9 \n7,449.6 \n2 \nServices\n101.1 \n52.4 \n93 \n275.2 \n130.0 \n112 \nTotal revenues\n$\n2,717.4 \n$\n2,522.3 \n8 \n%\n$\n7,907.1 \n$\n7,579.6 \n4 \n%\n_______________\n(1)\nExcludes the operating results of ATC TIPL, which are reported as discontinued operations. See Note 16 for further discussion.\nThree Months Ended September 30, 2025 \nU.S. & Canada property segment revenue growth of $0.8 million was attributable to:\n•   \nTenant billings growth of $49.7 million, which was driven by:\n•   \n$40.5 million due to leasing additional space on our sites (“colocations”) and amendments;\n•   \n$9.0 million resulting from contractual escalations, net of churn; and\n•   \n$1.5 million generated from sites acquired or constructed since the beginning of the prior-year period (“newly acquired or constructed sites”);\n•   \nPartially offset by a decrease of $1.3 million from other tenant billings;\n•   \nPartially offset by a decrease of $48.9 million in other revenue, primarily due to a decrease of $41.9 million due to straight-line accounting.\nSegment revenue growth was not meaningfully impacted by foreign currency translation related to fluctuations in Canadian Dollar (“CAD”).\nAfrica & APAC property segment revenue growth of $68.2 million was attributable to:\n•   \nTenant billings growth of $33.2 million, which was driven by:\n•   \n$14.4 million due to colocations and amendments;\n•   \n$10.8 million resulting from contractual escalations, net of churn;\n•   \n$5.1 million generated from newly acquired or constructed sites; and\n•   \n$2.9 million from other tenant billings;\n•   \nAn increase of $8.6 million in other revenue, primarily attributable to a decrease in revenue reserves related to a customer in Burkina Faso; and\n•   \nAn increase of $4.7 million in pass-through revenue.\nSegment revenue growth included an increase of $21.7 million, attributable to the impact of foreign currency translation, which included, among others, positive impacts of $15.1 million related to fluctuations in Ghanaian Cedi (“GHS”), $2.4 million related to fluctuations in Ugandan Shilling (“UGX”), $2.1 million related to fluctuations in West African CFA Franc (“XOF”) and $1.3 million related to fluctuations in Nigerian Naira (“NGN”).\nEurope property segment revenue growth of $30.8 million was attributable to:\n•   \nTenant billings growth of $10.0 million, which was driven by:\n•   \n$4.4 million due to colocations and amendments;\n•   \n$3.0 million resulting from contractual escalations, net of churn; and\n•   \n$2.9 million generated from newly acquired or constructed sites;\n•   \nPartially offset by a decrease of $0.3 million from other tenant billings;\n•   \nAn increase of $3.9 million in other revenue; and\n37\n•   \nAn increase of $2.3 million in pass-through revenue, primarily attributable to an increase in energy costs. \nSegment revenue growth included an increase of $14.6 million attributable to the positive impact of foreign currency translation related to fluctuations in Euro (“EUR”).\nLatin America property segment revenue growth of $13.7 million was attributable to:\n•   \nTenant billings growth of $9.2 million, which was driven by:\n•   \n$6.7 million due to colocations and amendments; \n•   \n$3.3 million from contractual escalations, net of churn; and\n•   \n$0.2 million generated from newly acquired or constructed sites;\n•   \nPartially offset by a decrease of $1.0 million from other tenant billings; and\n•   \nAn increase of $3.5 million in pass-through revenue;\n•   \nPartially offset by a decrease of $4.4 million in other revenue, primarily attributable to an increase in revenue reserves related to customers in Brazil and Mexico.\nSegment revenue growth included an increase of $5.4 million, attributable to the impact of foreign currency translation, which included, among others, positive impacts of $2.6 million related to fluctuations in Brazilian Real (“BRL”), $1.5 million related to fluctuations in Mexican Peso (“MXN”) and $1.3 million related to fluctuations in Peruvian Sol.\nData Centers segment revenue growth of $32.9 million was attributable to: \n•\nAn increase of $18.3 million in rental, related and other revenue, primarily due to new lease commencements, customer expansions and rent increases upon customer renewals;\n•\nAn increase of $9.6 million in power revenue from new lease commencements, increased power consumption and pricing increases from existing customers; \n•\nAn increase of $3.9 million in interconnection revenue, primarily due to customer interconnection net additions and pricing increases from existing cross connects; and\n•\nAn increase of $1.1 million in straight-line revenue.\nServices segment revenue growth of $48.7 million was primarily attributable to an increase in construction management and site application, zoning and permitting services, partially offset by a decrease in structural and mount analyses services.\nNine Months Ended September 30, 2025\nU.S. & Canada property segment revenue decrease of $19.9 million was attributable to:\n•   \nA decrease of $159.9 million in other revenue, primarily due to a decrease of $143.4 million due to straight-line accounting;\n•   \nPartially offset by tenant billings growth of $140.2 million, which was driven by:\n•   \n$117.1 million due to colocations and amendments;\n•   \n$25.3 million resulting from contractual escalations, net of churn; and\n•   \n$4.1 million generated from newly acquired or constructed sites;\n•   \nPartially offset by a decrease of $6.3 million from other tenant billings.\nSegment revenue decrease included a decrease of $0.2 million attributable to the negative impact of foreign currency translation related to fluctuations in CAD.\nAfrica & APAC property segment revenue growth of $141.8 million was attributable to:\n•   \nTenant billings growth of $98.6 million, which was driven by:\n•   \n$38.4 million due to colocations and amendments;\n•   \n$34.7 million resulting from contractual escalations, net of churn;\n•   \n$17.5 million generated from newly acquired or constructed sites; and\n•   \n$8.0 million from other tenant billings;\n•   \nAn increase of $13.0 million in other revenue, primarily attributable to a decrease in revenue reserves related to customers in Burkina Faso and Kenya; and\n•   \nAn increase of $10.2 million in pass-through revenue.\nSegment revenue growth included an increase of $20.0 million, attributable to the impact of foreign currency translation, which included, among others, positive impacts of $12.7 million related to fluctuations in GHS, $7.1 million related to fluctuations in UGX, $6.8 million related to fluctuations in Kenyan Shilling and $2.4 million related to fluctuations in XOF, partially offset by negative impacts of $10.9 million related to fluctuations in NGN.\n38\nEurope property segment revenue growth of $68.8 million was attributable to:\n•   \nTenant billings growth of $29.8 million, which was driven by:\n•   \n$14.9 million due to colocations and amendments;\n•   \n$8.1 million resulting from contractual escalations, net of churn; and\n•   \n$7.9 million generated from newly acquired or constructed sites; \n•   \nPartially offset by a decrease of $1.1 million from other tenant billings;\n•   \nAn increase of $11.5 million in pass-through revenue, primarily attributable to an increase in energy costs; and\n•   \nAn increase of $9.1 million in other revenue. \nSegment revenue growth included an increase of $18.4 million attributable to the positive impact of foreign currency translation related to fluctuations in EUR.\nLatin America property segment revenue decrease of $91.9 million was attributable to:\n•   \nA decrease of $88.4 million, attributable to the impact of foreign currency translation, which included, among others, negative impacts of $45.3 million related to fluctuations in BRL and $40.3 million related to fluctuations in MXN; and\n•   \nA decrease of $41.9 million in other revenue, primarily attributable to an increase in revenue reserves related to customers in Brazil, Mexico and Peru;\n•   \nPartially offset by:\n•   \nTenant billings growth of $28.0 million, which was driven by:\n•   \n$20.3 million due to colocations and amendments; \n•   \n$10.3 million from contractual escalations, net of churn; and\n•   \n$0.9 million generated from newly acquired or constructed sites;\n•   \nPartially offset by a decrease of $3.5 million from other tenant billings; and\n•   \nAn increase of $10.4 million in pass-through revenue.\nData Centers segment revenue growth of $83.5 million was attributable to: \n•\nAn increase of $49.9 million in rental, related and other revenue, primarily due to new lease commencements, customer expansions and rent increases upon customer renewals;\n•\nAn increase of $25.0 million in power revenue from new lease commencements, increased power consumption and pricing increases from existing customers; and\n•\nAn increase of $11.5 million in interconnection revenue, primarily due to customer interconnection net additions and pricing increases from existing cross connects; \n•\nPartially offset by a decrease of $2.9 million in straight-line revenue.\nServices segment revenue growth of $145.2 million was primarily attributable to an increase in construction management services, site application, zoning and permitting services and structural and mount analyses services.\nGross Margin\n \nThree Months Ended September 30,\nPercent Increase (Decrease)\nNine Months Ended September 30,\nPercent Increase (Decrease)\n \n2025\n2024\n2025\n2024\nProperty\nU.S. & Canada\n$\n1,101.4 \n$\n1,093.1 \n1 \n%\n$\n3,282.3 \n$\n3,294.3 \n(0)\n%\nAfrica & APAC (1)\n256.7 \n208.2 \n23 \n722.8 \n612.7 \n18 \nEurope\n154.3 \n133.6 \n15 \n437.4 \n394.6 \n11 \nLatin America\n284.2 \n274.6 \n3 \n825.7 \n892.1 \n(7)\nData Centers\n162.7 \n133.5 \n22 \n466.5 \n396.7 \n18 \nTotal property\n1,959.3 \n1,843.0 \n6 \n5,734.7 \n5,590.4 \n3 \nServices\n47.3 \n27.5 \n72 \n%\n138.4 \n69.2 \n100 \n%\n______________\n(1)\nExcludes the operating results of ATC TIPL, which are reported as discontinued operations. See Note 16 for further discussion.\n39\nThree Months Ended September 30, 2025 \n•\nThe increase in U.S. & Canada property segment gross margin was primarily attributable to the increase in revenue described above and a decrease in direct expenses of $7.5 million primarily driven by a decrease in straight-line expense.\n•\nThe increase in Africa & APAC property segment gross margin was primarily attributable to the increase in revenue described above, partially offset by an increase in direct expenses of $12.1 million, primarily due to an increase in costs associated with pass-through revenue, including fuel and utility costs. Direct expenses were also negatively impacted by $7.6 million from the impact of foreign currency translation.\n•\nThe increase in Europe property segment gross margin was primarily attributable to the increase in revenue described above, partially offset by an increase in direct expenses of $4.7 million, primarily due to an increase in costs associated with pass-through revenue, including energy costs and an increase in land rent costs. Direct expenses were also negatively impacted by $5.4 million from the impact of foreign currency translation.\n•\nThe increase in Latin America property segment gross margin was primarily attributable to the increase in revenue described above, partially offset by an increase in direct expenses of $2.4 million, primarily due to an increase in land rent costs. Direct expenses were also negatively impacted by $1.7 million from the impact of foreign currency translation.\n•\nThe increase in Data Centers segment gross margin was primarily attributable to the increase in revenue described above, partially offset by an increase in direct expenses of $3.7 million, primarily due to an increase in costs associated with power revenue, including utility costs, partially offset by a decrease in property taxes.\n•\nThe increase in Services segment gross margin was primarily attributable to the increase in revenue described above, partially offset by an increase in direct expenses of $28.9 million.\nNine Months Ended September 30, 2025\n•\nThe decrease in U.S. & Canada property segment gross margin was primarily attributable to the decrease in revenue described above, partially offset by a decrease in direct expenses of $7.9 million, primarily driven by a decrease in straight-line expense.\n•\nThe increase in Africa & APAC property segment gross margin was primarily attributable to the increase in revenue described above, partially offset by an increase in direct expenses of $23.4 million, primarily due to an increase in repair and maintenance spending and an increase in costs associated with pass-through revenue, including fuel and utility costs. Direct expenses also were negatively impacted by $8.3 million from the impact of foreign currency translation.\n•\nThe increase in Europe property segment gross margin was primarily attributable to the increase in revenue described above, partially offset by an increase in direct expenses of $19.1 million, primarily due to an increase in costs associated with pass-through revenue, including energy costs and an increase in land rent costs. Direct expenses also were negatively impacted by $6.9 million from the impact of foreign currency translation.\n•\nThe decrease in Latin America property segment gross margin was primarily attributable to the decrease in revenue described above, partially offset by a decrease in direct expenses of $0.9 million. Direct expenses also benefited by $24.6 million from the impact of foreign currency translation. \n•\nThe increase in Data Centers segment gross margin was primarily attributable to the increase in revenue described above, partially offset by an increase in direct expenses of $13.7 million, primarily due to an increase in costs associated with power revenue, including utility costs, partially offset by a decrease in property taxes. Direct expenses were benefited by a legal settlement and resolution of a utility back billing matter.\n•\nThe increase in Services segment gross margin was primarily attributable to the increase in revenue described above, partially offset by an increase in direct expenses of $76.0 million.\n40\nSelling, General, Administrative and Development Expense (“SG&A”)\n \nThree Months Ended September 30,\nPercent Increase (Decrease)\nNine Months Ended September 30,\nPercent Increase (Decrease)\n \n2025\n2024\n2025\n2024\nProperty\nU.S. & Canada\n$\n41.2 \n$\n41.0 \n0 \n%\n$\n121.8 \n$\n117.8 \n3 \n%\nAfrica & APAC (1)\n18.5 \n18.0 \n3 \n57.5 \n52.7 \n9 \nEurope\n16.8 \n14.1 \n19 \n47.2 \n45.3 \n4 \nLatin America\n28.7 \n28.6 \n0 \n76.8 \n78.1 \n(2)\nData Centers\n22.7 \n20.5 \n11 \n64.7 \n56.6 \n14 \nTotal property\n127.9 \n122.2 \n5 \n368.0 \n350.5 \n5 \nServices\n6.2 \n5.1 \n22 \n19.1 \n14.6 \n31 \nOther \n98.9 \n100.4 \n(1)\n317.1 \n325.2 \n(2)\nTotal selling, general, administrative and development expense\n$\n233.0 \n$\n227.7 \n2 \n%\n$\n704.2 \n$\n690.3 \n2 \n%\n______________\n(1)\nExcludes the operating results of ATC TIPL, which are reported as discontinued operations. See Note 16 for further discussion.\nThree Months Ended September 30, 2025 \n•\nOur U.S. & Canada property segment SG&A was relatively consistent as compared to the prior-year period.\n•\nThe increase in our Africa & APAC property segment SG&A was primarily driven by increased local tax and professional services costs and the negative impact of foreign currency translation, partially offset by decreased personnel and related costs. \n•\nThe increase in our Europe property segment SG&A was primarily driven by increased canceled construction costs, increased professional services costs, and the negative impact of foreign currency translation, partially offset by decreased personnel and related costs.\n•\nThe increase in our Latin America property segment SG&A was primarily driven by increased local tax and professional services costs, including legal fees in Mexico, and the negative impact of foreign currency translation, partially offset by a net decrease in bad debt expense of $3.7 million.\n•\nThe increases in our Data Centers and Services segment SG&A were primarily driven by increased personnel and related costs to support our business.\n•\nThe decrease in other SG&A was primarily attributable to a decrease in stock-based compensation expense of $1.8 million, partially offset by an increase in corporate SG&A, including an increase in personnel and related costs to support our business.\nNine Months Ended September 30, 2025\n•\nThe increase in our U.S. & Canada property segment SG&A was primarily driven by increased personnel and related costs and an increase in bad debt expense, partially offset by decreased professional services costs and lower canceled construction costs.\n•\nThe increase in our Africa & APAC property segment SG&A was primarily driven by increased local tax and professional services costs and the negative impact of foreign currency translation, partially offset by decreased personnel and related costs. \n•\nThe increase in our Europe property segment SG&A was primarily driven by increased canceled construction costs, increased professional services costs, and the negative impact of foreign currency translation, partially offset by decreased personnel and related costs.\n41\n•\nThe decrease in our Latin America property segment SG&A was primarily driven by a net decrease in bad debt expense of $2.0 million, decreased personnel and related costs, and a benefit from the impact of foreign currency translation, partially offset by increased local tax and professional services costs, including legal fees in Mexico.\n•\nThe increase in our Data Centers segment SG&A was primarily driven by increased personnel and related costs to support our business, partially offset by a legal settlement in the period.\n•\nThe increase in our Services segment SG&A was primarily driven by increased personnel and related costs to support our business.  \n•\nThe decrease in other SG&A was primarily attributable to a decrease in stock-based compensation expense of $8.2 million, primarily driven by the reversal of previously recognized stock-based compensation expense associated with awards forfeited in connection with the departure of our Executive Vice President and President, APAC due to such role being eliminated, as discussed in note 9 to our consolidated and condensed consolidated financial statements included in this Quarterly Report, and a decrease in other corporate SG&A, partially offset by an increase in personnel and related costs to support our business.\nOperating Profit\n \nThree Months Ended September 30,\nPercent Increase (Decrease)\nNine Months Ended September 30,\nPercent Increase (Decrease)\n \n2025\n2024\n2025\n2024\nProperty\nU.S. & Canada\n$\n1,060.2 \n$\n1,052.1 \n1 \n%\n$\n3,160.5 \n$\n3,176.5 \n(1)\n%\nAfrica & APAC (1)\n238.2 \n190.2 \n25 \n665.3 \n560.0 \n19 \nEurope\n137.5 \n119.5 \n15 \n390.2 \n349.3 \n12 \nLatin America\n255.5 \n246.0 \n4 \n748.9 \n814.0 \n(8)\nData Centers\n140.0 \n113.0 \n24 \n401.8 \n340.1 \n18 \nTotal property\n1,831.4 \n1,720.8 \n6 \n5,366.7 \n5,239.9 \n2 \nServices\n41.1 \n22.4 \n83 \n%\n119.3 \n54.6 \n118 \n%\n______________\n(1)\nExcludes the operating results of ATC TIPL, which are reported as discontinued operations. See Note 16 for further discussion.\n•\nThe increase in operating profit for the three months ended September 30, 2025 for our U.S. & Canada property segment was primarily attributable to an increase in our segment gross margin, partially offset by an increase in our segment SG&A. The decrease in operating profit for the nine months ended September 30, 2025 for our U.S. & Canada property segment was primarily attributable to a decrease in our segment gross margin and an increase in our segment SG&A.\n•\nThe increases in operating profit for the three and nine months ended September 30, 2025 for our Africa & APAC property segment, Europe property segment, Data Centers segment and our Services segment were primarily attributable to increases in our segment gross margin, partially offset by increases in our segment SG&A.\n•\nThe increase in operating profit for the three months ended September 30, 2025 for our Latin America property segment was primarily attributable to an increase in our segment gross margin, partially offset by an increase in our segment SG&A. The decrease in operating profit for the nine months ended September 30, 2025 for our Latin America property segment was primarily attributable to a decrease in our segment gross margin, partially offset by a decrease in our segment SG&A.\n42\nDepreciation, Amortization and Accretion\n \nThree Months Ended September 30,\nPercent Increase (Decrease)\nNine Months Ended September 30,\nPercent Increase (Decrease)\n \n2025\n2024\n2025\n2024\nDepreciation, amortization and accretion\n$\n522.9 \n$\n498.5 \n5 \n%\n$\n1,525.7 \n$\n1,527.9 \n(0)\n%\nThe increase in depreciation, amortization and accretion expense for the three months ended September 30, 2025 was primarily attributable to the acquisition, lease or construction of new sites since the beginning of the prior-year period, which resulted in increases in property and equipment and intangible assets subject to amortization and the impact of foreign currency exchange rate fluctuations. The decrease in depreciation, amortization and accretion expense for the nine months ended September 30, 2025 was primarily attributable to foreign currency exchange rate fluctuations. \nOther Operating Expense (Income)\n \nThree Months Ended September 30,\nPercent Increase (Decrease)\nNine Months Ended September 30,\nPercent Increase (Decrease)\n \n2025\n2024\n2025\n2024\nOther operating expense (income)\n$\n17.4 \n$\n5.1 \n241 \n%\n$\n(41.9)\n$\n5.0 \n(938)\n%\nThe increase in other operating expense (income) during the three months ended September 30, 2025 was primarily attributable to registration fees related to our acquisition of Eaton Towers Holdings Limited in 2019 and an increase in losses on sales or disposals of assets. The change in other operating expense (income) during the nine months ended September 30, 2025 was primarily attributable to the gain on the sale of South Africa Fiber of $53.6 million.\nTotal Other Expense\n \nThree Months Ended September 30,\nPercent Increase (Decrease)\nNine Months Ended September 30,\nPercent Increase (Decrease)\n \n2025\n2024\n2025\n2024\nTotal other expense\n$\n283.3 \n$\n588.7 \n(52)\n%\n$\n1,605.8 \n$\n1,117.3 \n44 \n%\nTotal other expense consists primarily of interest expense and realized and unrealized foreign currency gains or losses as a result of foreign currency exchange rate fluctuations primarily associated with our EUR denominated senior unsecured notes, our intercompany notes and similar unaffiliated balances denominated in a currency other than the subsidiaries’ functional currencies. \nThe decrease in total other expense during the three months ended September 30, 2025 was primarily due to foreign currency gains of $18.0 million in the current period, as compared to foreign currency losses of $337.4 million in the prior-year period. Total other expense during the three months ended September 30, 2025 and 2024 includes $10.9 million and $67.9 million, respectively, in unrealized gains from equity securities in the United States. The increase in total other expense during the nine months ended September 30, 2025 was primarily due to an increase in foreign currency losses of $580.3 million, partially offset by a decrease in net interest expense of $58.8 million, primarily due to a decrease in our weighted average interest rate and our average debt outstanding. Total other expense during the nine months ended September 30, 2025 and 2024 includes $129.2 million and $93.9 million, respectively,\n \nin unrealized gains from equity securities in the United States.\nIncome Tax Provision\n \nThree Months Ended September 30,\nPercent Increase (Decrease)\nNine Months Ended September 30,\nPercent Increase (Decrease)\n \n2025\n2024\n2025\n2024\nIncome tax provision\n$\n37.4 \n$\n122.4 \n(69)\n%\n$\n287.6 \n$\n291.1 \n(1)\n%\nEffective tax rate\n3.9 \n%\n22.2 \n%\n13.8 \n%\n12.6 \n%\nAs a real estate investment trust for U.S. federal income tax purposes (“REIT”), we may deduct earnings distributed to stockholders against the income generated by our REIT operations. Consequently, the effective tax rate on income from continuing operations for the nine months ended September 30, 2025 and 2024 differs from the federal statutory rate. \n43\nThe decrease in the income tax provision during the three months ended September 30, 2025 was primarily attributable to the benefit from the application of a tax law change in Germany and a decrease in tax expense attributable to unrealized gains from equity securities in the United States. The decrease in the income tax provision during the nine months ended September 30, 2025 was primarily attributable to the benefit from the application of a tax law change in Germany, partially offset by increased earnings in certain foreign jurisdictions, taxes incurred as a result of the sale of South Africa Fiber, and additions to reserves for uncertain tax positions.\nLoss from Discontinued Operations, Net of Taxes\nOn January 4, 2024, we, through our subsidiaries, ATC Asia Pacific Pte. Ltd. and ATC Telecom Infrastructure Private Limited (“ATC TIPL”), entered into an agreement with Data Infrastructure Trust (“DIT”), an infrastructure investment trust sponsored by an affiliate of Brookfield Asset Management, pursuant to which DIT agreed to acquire a 100% ownership interest in ATC TIPL (the “ATC TIPL Transaction”). Per the terms of the agreement, total aggregate consideration represented up to approximately 210 billion Indian Rupees (“INR”) (approximately $2.5 billion), including the value of the VIL OCDs and the VIL Shares (each as defined and further discussed below), payments on certain existing customer receivables, the repayment of existing intercompany debt and the repayment, or assumption, of the Company’s existing term loan in India, by DIT. \nDuring the year ended December 31, 2024, ATC TIPL distributed approximately 29.6 billion INR (approximately $354.1 million) to the Company, which included the value of the VIL Shares and the VIL OCDs and the satisfaction \nof the economic benefit associated with the rights to payments on certain existing customer receivables. The distributions\n were deducted from the total aggregate consideration received by the Company at closing. \nThe ATC TIPL Transaction received all government and regulatory approvals during the three months ended September 30, 2024. On September 12, 2024, we completed the ATC TIPL Transaction and received total consideration of 182 billion INR (approximately $2.2 billion). We used the proceeds from the ATC TIPL Transaction to repay existing indebtedness under the 2021 Multicurrency Credit Facility. During the three months ended September 30, 2024, we recorded a loss on the sale of ATC TIPL of $1.2 billion, which primarily included the reclassification of our cumulative translation adjustment in India upon exiting the market of $1.1 billion. \nThe following table presents key components of Loss from discontinued operations, net of taxes in the consolidated statements of operations:\n44\n \nThree Months Ended September 30,\nPercent Increase (Decrease)\nNine Months Ended September 30,\nPercent Increase (Decrease)\n \n2025\n2024 (1)\n2025\n2024 (1)\nRevenue\n$\n— \n$\n234.1 \n(100)\n%\n$\n— \n$\n911.2 \n(100)\n%\nCost of operations\n— \n(131.8)\n(100)\n— \n(473.8)\n(100)\nDepreciation, amortization and accretion\n— \n(14.3)\n(100)\n— \n(96.0)\n(100)\nSelling, general, administrative and development expense\n— \n(30.0)\n(100)\n— \n(58.7)\n(100)\nOther operating expense\n— \n(5.7)\n(100)\n— \n(6.7)\n(100)\nLoss on sale of ATC TIPL\n— \n(1,245.5)\n100 \n— \n(1,245.5)\n100 \nOperating loss\n— \n(1,193.2)\n(100)\n— \n(969.5)\n(100)\nInterest income\n— \n4.4 \n(100)\n— \n30.7 \n(100)\nInterest expense\n— \n(2.0)\n(100)\n— \n(7.6)\n(100)\nOther income, net\n— \n0.2 \n(100)\n— \n46.5 \n(100)\nLoss from discontinued operations before taxes\n$\n— \n$\n(1,190.6)\n(100)\n$\n— \n$\n(899.9)\n(100)\nIncome tax provision\n— \n(17.9)\n(100)\n— \n(78.4)\n(100)\nLoss from discontinued operations, net of taxes\n$\n— \n$\n(1,208.5)\n(100)\n%\n$\n— \n$\n(978.3)\n(100)\n%\n_______________\n(1)\nIncludes the results of operations for ATC TIPL through September 12, 2024.\nFollowing the rulings by the Supreme Court of India regarding carriers’ obligations for the adjusted gross revenue fees and charges prescribed by the court, we experienced variability and a level of uncertainty in collections in India. In the third quarter of 2022, one of our largest customers in India, Vodafone Idea Limited (“VIL”), communicated that it would make partial payments of its contractual amounts owed to us (the “VIL Shortfall”). We recorded reserves in late 2022 and the first half of 2023 for the VIL Shortfall. In the second half of 2023, VIL began making payments in full of its monthly contractual obligations owed to us. During the year ended December 31, 2023, we deferred recognition of revenue of approximately $27.3 million, net of recoveries, related to VIL in India. During the three months ended March 31, 2024, we recognized approximately $29.0 million of this previously deferred revenue. We have fully recognized this previously deferred revenue.\nIn February 2023, and as amended in August 2023, VIL issued optionally convertible debentures (the “VIL OCDs”) to ATC TIPL in exchange for VIL’s payment of certain amounts towards accounts receivables. The VIL OCDs were issued for an aggregate face value of 16.0 billion INR (approximately $193.2 million on the date of issuance). On March 23, 2024, we converted an aggregate face value of 14.4 billion INR (approximately $172.7 million) of VIL OCDs into 1,440 million shares of equity of VIL (the “VIL Shares”). On April 29, 2024, we completed the sale of 1,440 million VIL Shares at a price of 12.78 INR per share. The net proceeds for this transaction were approximately 18.0 billion INR (approximately $216.0 million at the date of settlement) after deducting commissions and fees. On June 5, 2024, we completed the sale of the remaining aggregate face value of 1.6 billion INR (approximately $19.2 million) of the VIL OCDs. The net proceeds for this transaction, excluding accrued interest, were approximately 1.8 billion INR (approximately $22.0 million at the date of settlement) after deducting fees. None of the VIL Shares or the VIL OCDs remained outstanding. During the nine months ended September 30, 2024, we recognized a gain of $46.4 million on the sales of the VIL Shares and the VIL OCDs. \n45\nNet Income / Adjusted EBITDA and Net Income / Nareit FFO attributable to American Tower Corporation common stockholders / AFFO attributable to American Tower Corporation common stockholders\n \n \nThree Months Ended September 30,\nPercent Increase (Decrease)\nNine Months Ended September 30,\nPercent Increase (Decrease)\n \n2025\n2024\n2025\n2024\nNet income (loss)\n$\n912.6 \n$\n(780.4)\n(217)\n%\n$\n1,791.7 \n$\n1,049.7 \n71 \n%\nLoss from discontinued operations, net of taxes\n— \n1,208.5 \n(100)\n— \n978.3 \n(100)\nIncome tax provision\n37.4 \n122.4 \n(69)\n287.6 \n291.1 \n(1)\nOther (income) expense\n(27.7)\n269.6 \n(110)\n684.4 \n137.1 \n399 \nInterest expense\n347.1 \n356.8 \n(3)\n1,015.0 \n1,083.3 \n(6)\nInterest income\n(36.1)\n(37.7)\n(4)\n(93.6)\n(103.1)\n(9)\nOther operating expense (income)\n17.4 \n5.1 \n241 \n(41.9)\n5.0 \n(938)\nDepreciation, amortization and accretion\n522.9 \n498.5 \n5 \n1,525.7 \n1,527.9 \n(0)\nStock-based compensation expense\n41.9 \n43.7 \n(4)\n142.6 \n150.8 \n(5)\nAdjusted EBITDA (1)\n$\n1,815.5 \n$\n1,686.5 \n8 \n%\n$\n5,311.5 \n$\n5,120.1 \n4 \n%\n______________\n(1)\nExcludes the operating results of ATC TIPL, which are reported as discontinued operations. See Note 16 for further discussion.\n46\n \nThree Months Ended September 30,\nPercent Increase (Decrease)\nNine Months Ended September 30,\nPercent Increase (Decrease)\n \n2025\n2024\n2025\n2024\nNet income (loss) (1)\n$\n912.6 \n$\n(780.4)\n(217)\n%\n$\n1,791.7 \n$\n1,049.7 \n71 \n%\nReal estate related depreciation, amortization and accretion\n486.0 \n461.5 \n5 \n1,418.7 \n1,414.1 \n0 \nLosses (gains) from sale or disposal of real estate and real estate related impairment charges (2)\n11.4 \n9.6 \n19 \n(28.6)\n22.9 \n(225)\nAdjustments and distributions for unconsolidated affiliates and noncontrolling interests (3)\n(147.9)\n(92.6)\n60 \n(339.0)\n(269.6)\n26 \nAdjustments for discontinued operations (4)\n— \n1,259.3 \n(100)\n— \n1,334.5 \n(100)\nNareit FFO attributable to American Tower Corporation common stockholders\n$\n1,262.1 \n$\n857.4 \n47 \n%\n$\n2,842.8 \n$\n3,551.6 \n(20)\n%\nStraight-line revenue\n(27.7)\n(68.5)\n(60)\n(73.0)\n(221.7)\n(67)\nStraight-line expense\n9.4 \n17.3 \n(46)\n27.9 \n38.8 \n(28)\nStock-based compensation expense\n41.9 \n43.7 \n(4)\n142.6 \n150.8 \n(5)\nDeferred portion of income tax and other income tax adjustments (5)\n(2.7)\n79.1 \n(103)\n135.7 \n139.8 \n(3)\nNon-real estate related depreciation, amortization and accretion\n36.9 \n37.0 \n(0)\n107.0 \n113.8 \n(6)\nAmortization of deferred financing costs, capitalized interest, debt discounts and premiums and long-term deferred interest charges\n13.5 \n13.7 \n(1)\n41.0 \n40.0 \n3 \nOther (income) expense (6)\n(27.7)\n269.6 \n(110)\n684.4 \n137.1 \n399 \nOther operating expense (income) (7)\n6.0 \n(4.5)\n(233)\n(13.3)\n(17.9)\n(26)\nCapital improvement capital expenditures\n(48.4)\n(36.8)\n32 \n(122.5)\n(88.0)\n39 \nCorporate capital expenditures\n(5.9)\n(4.3)\n37 \n(9.7)\n(9.8)\n(1)\nAdjustments and distributions for unconsolidated affiliates and noncontrolling interests (8)\n45.7 \n1.4 \n3,164 \n48.7 \n2.8 \n1,639 \nAdjustments for discontinued operations (9)\n— \n32.3 \n(100)\n— \n9.0 \n(100)\nAFFO attributable to American Tower Corporation common stockholders\n$\n1,303.1 \n$\n1,237.4 \n5 \n%\n$\n3,811.6 \n$\n3,846.3 \n(1)\n%\nAFFO attributable to American Tower Corporation common stockholders from continuing operations\n$\n1,303.1 \n$\n1,154.3 \n13 \n%\n$\n3,811.6 \n$\n3,481.1 \n9 \n%\nAFFO attributable to American Tower Corporation common stockholders from discontinued operations\n$\n— \n$\n83.1 \n(100)\n%\n$\n— \n$\n365.2 \n(100)\n%\n_______________\n(1)\nFor the three and nine months ended September 30, 2024, includes Loss from discontinued operations, net of taxes of $1.2 billion and $978.3 million, respectively. \n(2)\nThere were no material impairment charges for the three and nine months ended September 30, 2025 and 2024. For the nine months ended September 30, 2025, includes a gain on the sale of South Africa Fiber of $53.6 million. \n(3)\nIncludes distributions to noncontrolling interest holders, distributions related to the outstanding mandatorily convertible preferred equity in connection with our agreements with certain investment vehicles affiliated with Stonepeak Partners LP and adjustments for the impact of noncontrolling interests on Nareit FFO attributable to American Tower Corporation common stockholders.\n(4)\nFor the three and nine months ended September 30, 2024, includes (i) real estate related depreciation, amortization and accretion for discontinued operations of $13.1 million and $91.3 million, respectively, and (ii) losses from the sale or disposal of real estate and real estate related impairment charges for discontinued operations of $1.2 billion and $1.2 billion, respectively. For the three and nine months ended September 30, 2024, includes a loss on the sale of ATC TIPL of $1.2 billion.\n47\n(5)\nFor the three and nine months ended September 30, 2025, includes adjustments for taxes paid in Singapore of $0.3 million related to the ATC TIPL Transaction. For the nine months ended September 30, 2025 also includes adjustments for taxes paid in South Africa of $19.6 million, which were incurred as a result of the sale of South Africa Fiber. For the three and nine months ended September 30, 2024, includes adjustments for withholding taxes paid in Singapore of $2.9 million and $36.4 million, respectively, which were incurred as a result of the ATC TIPL Transaction. We believe that these tax payments are nonrecurring, and do not believe these are an indication of our operating performance. Accordingly, we believe it is more meaningful to present AFFO attributable to American Tower Corporation common stockholders excluding these amounts.\n(6)\nIncludes (gains) losses on foreign currency exchange rate fluctuations of $(18.0) million, $337.4 million, $811.7 million and $231.4 million, respectively.\n(7)\nPrimarily includes acquisition-related costs, integration costs and disposition costs.\n(8)\nIncludes adjustments for the impact of noncontrolling interests on other line items, excluding those already adjusted for in Nareit FFO attributable to American Tower Corporation common stockholders.\n(9)\nIncludes the impact of discontinued operations associated with other line items, excluding the impact already included in Nareit FFO attributable to American Tower Corporation common stockholders.\nThe changes in net income (loss) for the three and nine months ended September 30, 2025 were primarily due to losses from discontinued operations, net of tax, as a result of the ATC TIPL Transaction in the prior year. \nThe increase in net income from continuing operations for the three months ended September 30, 2025 was primarily due to (i) changes in other income (expense), primarily due to foreign currency exchange rate fluctuations, (ii) an increase in segment operating profit and (iii) a decrease in the income tax provision, partially offset by (y) an increase in depreciation, amortization, and accretion and (z) an increase in other operating expense (income). \nThe decrease in net income from continuing operations for the nine months ended September 30, 2025 was primarily due to changes in other income (expense), primarily due to foreign currency exchange rate fluctuations, partially offset by (x) an increase in segment operating profit, (y) a decrease in interest expense and (z) changes in other operating expense (income), which included the gain on the sale of South Africa Fiber during the nine months ended September 30, 2025. \nThe increases in Adjusted EBITDA for the three and nine months ended September 30, 2025 were primarily attributable to increases in our gross margin, partially offset by increases in SG&A, excluding the impact of stock-based compensation expense of $7.1 million and $22.1 million, respectively.\nThe increase in AFFO attributable to American Tower Corporation common stockholders for the three months ended September 30, 2025 was primarily attributable to (i) an increase in our operating profit, excluding the impact of straight-line accounting and (ii) decreases in cash paid for interest and cash paid for income taxes, partially offset by (x) a decrease in AFFO attributable to American Tower Corporation common stockholders from discontinued operations as a result of the sale of ATC TIPL in the third quarter of 2024, (y) an increase in capital improvement capital expenditures and (z) an increase in distributions and adjustments for noncontrolling interests, including distributions to noncontrolling interest holders in our Data Centers segment. \nThe decrease in AFFO attributable to American Tower Corporation common stockholders for the nine months ended September 30, 2025 was primarily attributable to (i) a decrease in AFFO attributable to American Tower Corporation common stockholders from discontinued operations as a result of the sale of ATC TIPL in the third quarter of 2024, (ii) an increase in capital improvement capital expenditures, and (iii) an increase in distributions and adjustments for noncontrolling interests, including distributions to noncontrolling interest holders in our Europe property segment and Data Centers segment, partially offset by (y) an increase in our operating profit, excluding the impact of straight-line accounting and (z) a decrease in cash paid for interest.\n48\nSegment Gross Margin Reconciliations\nGross margin is defined as revenue less costs of operations inclusive of real estate related depreciation, amortization and accretion. Segment gross margin excludes depreciation, amortization and accretion. \n \nProperty\nTotal \nProperty\nServices\nTotal\nThree Months ended September 30, 2025\nU.S. & Canada\nAfrica & APAC\nEurope\nLatin America\nData Centers\nGross margin\n$\n952.6 \n$\n203.2 \n$\n74.3 \n$\n234.0 \n$\n9.2 \n$\n1,473.3 \n$\n47.3 \n$\n1,520.6 \nReal estate related depreciation, amortization and accretion\n148.8 \n53.5 \n80.0 \n50.2 \n153.5 \n486.0 \n— \n486.0 \nSegment gross margin\n$\n1,101.4 \n$\n256.7 \n$\n154.3 \n$\n284.2 \n$\n162.7 \n$\n1,959.3 \n$\n47.3 \n$\n2,006.6 \n \nProperty\nTotal \nProperty\nServices\nTotal\nThree Months ended September 30, 2024\nU.S. & Canada\nAfrica & APAC (1)\nEurope\nLatin America\nData Centers\nGross margin\n$\n946.7 \n$\n156.6 \n$\n61.5 \n$\n225.8 \n$\n(9.1)\n$\n1,381.5 \n$\n27.5 \n$\n1,409.0 \nReal estate related depreciation, amortization and accretion\n146.4 \n51.6 \n72.1 \n48.8 \n142.6 \n461.5 \n— \n461.5 \nSegment gross margin\n$\n1,093.1 \n$\n208.2 \n$\n133.6 \n$\n274.6 \n$\n133.5 \n$\n1,843.0 \n$\n27.5 \n$\n1,870.5 \n______________\n(1)\nExcludes the operating results of ATC TIPL, which are reported as discontinued operations. See Note 16 for further discussion.\n \nProperty\nTotal \nProperty\nServices\nTotal\nNine Months ended September 30, 2025\nU.S. & Canada\nAfrica & APAC\nEurope\nLatin America\nData Centers\nGross margin\n$\n2,837.0 \n$\n575.1 \n$\n211.4 \n$\n680.3 \n$\n12.2 \n$\n4,316.0 \n$\n138.4 \n$\n4,454.4 \nReal estate related depreciation, amortization and accretion\n445.3 \n147.7 \n226.0 \n145.4 \n454.3 \n1,418.7 \n— \n1,418.7 \nSegment gross margin\n$\n3,282.3 \n$\n722.8 \n$\n437.4 \n$\n825.7 \n$\n466.5 \n$\n5,734.7 \n$\n138.4 \n$\n5,873.1 \n \nProperty\nTotal \nProperty\nServices\nTotal\nNine Months ended September 30, 2024\nU.S. & Canada\nAfrica & APAC (1)\nEurope\nLatin America\nData Centers\nGross margin\n$\n2,854.7 \n$\n451.7 \n$\n181.0 \n$\n740.4 \n$\n(51.5)\n$\n4,176.3 \n$\n69.2 \n$\n4,245.5 \nReal estate related depreciation, amortization and accretion\n439.6 \n161.0 \n213.6 \n151.7 \n448.2 \n1,414.1 \n— \n1,414.1 \nSegment gross margin\n$\n3,294.3 \n$\n612.7 \n$\n394.6 \n$\n892.1 \n$\n396.7 \n$\n5,590.4 \n$\n69.2 \n$\n5,659.6 \n______________\n(1)\nExcludes the operating results of ATC TIPL, which are reported as discontinued operations. See Note 16 for further discussion.\n49\nLiquidity and Capital Resources \nThe information in this section updates as of September 30, 2025 the “Liquidity and Capital Resources” section of the 2024 Form 10-K and should be read in conjunction with that report.  \nOverview  \nDuring the nine months ended September 30, 2025, our significant financing transactions included:\n•\nRedemption of our 2.950% senior unsecured notes due 2025 (the “2.950% Notes”), our 2.400% senior unsecured notes due 2025 (the “2.400% Notes”), our 1.375% senior unsecured notes due 2025 (the “1.375% Notes”), our 4.000% notes due 2025 (the “4.000% Notes”) and our 1.300% senior unsecured notes due 2025 (the “1.300% Notes”);\n•\nRepayment of $525.0 million aggregate principal amount outstanding under our Secured Tower Revenue Notes, Series 2015-2, Class A (the “Series 2015-2 Notes”);\n•\nRegistered public offering in an aggregate principal amount of $2.1 billion, including 500.0 million EUR, of senior unsecured notes with maturities ranging from 2030 to 2035; and\n•\nAmendment of the 2021 Multicurrency Credit Facility, the 2021 Credit Facility and the 2021 Term Loan (each as defined below) to, among other things, (i) extend the maturity dates and (ii) update the Applicable Margins (as defined in the loan agreements).\nAs a holding company, our cash flows are derived primarily from the operations of, and distributions from, our operating subsidiaries or funds raised through borrowings under our credit facilities and debt or equity offerings.    \nThe following table summarizes the significant components of our liquidity (in millions):\nAs of September 30, 2025\nAvailable under the 2021 Multicurrency Credit Facility\n$\n5,555.0 \nAvailable under the 2021 Credit Facility\n3,185.0 \nLetters of credit\n(36.1)\nTotal available under credit facilities, net\n$\n8,703.9 \nCash and cash equivalents\n1,950.7 \nTotal liquidity\n$\n10,654.6 \nSubsequent to September 30, 2025, we made additional net borrowings\n of \n$405.0 million\n under\n the 2021 Credit Facility.\nSummary cash flow information is set forth below (in millions): \nNine Months Ended September 30,\n \n2025\n2024\nNet cash provided by (used for):\nOperating activities\n$\n4,036.5 \n$\n4,091.5 \nInvesting activities (1)\n(1,391.7)\n771.3 \nFinancing activities\n(2,764.7)\n(4,543.9)\nNet effect of changes in foreign currency exchange rates on cash and cash equivalents, and restricted cash\n112.5 \n(130.1)\nNet (decrease) increase in cash and cash equivalents, and restricted cash\n$\n(7.4)\n$\n188.8 \n_______________\n(1)\nFor the nine months ended September 30, 2024, includes $2.2 billion of proceeds from the ATC TIPL Transaction.\nWe use our cash flows to fund our operations and investments in our business, including maintenance and improvements, communications site and data center construction, managed network installations and acquisitions. Additionally, we use our cash flows to make distributions, including distributions of our REIT taxable income to maintain our qualification for taxation as a REIT under the Internal Revenue Code of 1986, as amended (the “Code”). We may also periodically repay or repurchase our existing indebtedness or equity. We typically fund our international expansion efforts primarily through a combination of cash on hand, intercompany debt and equity contributions.\nAs of September 30, 2025, we had total outstanding indebtedness of $37.5 billion, with a current portion of $2.4 billion. During the nine months ended September 30, 2025, we generated sufficient cash flow from operations, together with \n50\nborrowings under our credit facilities, proceeds from our debt issuance and cash on hand, to fund our acquisitions, capital expenditures and debt service obligations, as well as our required distributions. We believe the cash generated by operating activities during the year ending December 31, 2025, together with our borrowing capacity under our credit facilities, will suffice to fund our required distributions, capital expenditures, debt service obligations (interest and principal repayments) and signed acquisitions.\nWe utilize notional cash pooling arrangements with financial institutions for cash management purposes. These arrangements allow for cash withdrawals based upon aggregate cash balances on deposit at the same financial institution. \nMaterial Cash Requirements\n— There were no material changes to the Material Cash Requirements section of the 2024 Form 10-K.\nAs of September 30, 2025, we had $1.7 billion of cash and cash equivalents held by our foreign subsidiaries. As of September 30, 2025, we had $397.7 million of cash and cash equivalents held by our joint ventures, of which $279.4 million was held by our foreign joint ventures. Certain foreign subsidiaries may pay us interest or principal on intercompany debt. Additionally, in the event that we repatriate funds from our foreign subsidiaries, we may be required to accrue and pay certain taxes.\nCash Flows from Operating Activities\nThe decrease in cash provided by operating activities for the nine months ended September 30, 2025 was primarily attributable to (i) a reduction in cash flows from ATC TIPL as a result of the sale in the third quarter of 2024 and (ii) an increase in cash required for working capital, partially offset by (y) decreases in cash paid for interest and cash paid for taxes and (z) an increase in our operating profit, including the impact of straight-line accounting.\nCash Flows from Investing Activities\nOur significant investing activities during the nine months ended September 30, 2025 are highlighted below:\n•\nWe spent $420.2 million for acquisitions,\n•\nWe spent $1,128.8 million for capital expenditures, as follows (in millions):    \nDiscretionary capital projects (1)\n$\n624.3 \nGround lease purchases (2)\n132.6 \nCapital improvements and corporate expenditures (3)\n132.2 \nRedevelopment\n190.2 \nStart-up capital projects\n49.5 \nTotal capital expenditures\n$\n1,128.8 \n_______________\n(1)\nIncludes the construction of 1,309 communications sites globally and approximately $378.4 million of spend related to data center assets.\n(2)\nIncludes $24.1 million of perpetual land easement payments reported in Deferred financing costs and other financing activities in the cash flows from financing activities in our condensed consolidated statements of cash flows. \n(3)\nIncludes $3.5 million of finance lease payments reported in Repayments of notes payable, credit facilities, senior notes, secured debt, term loan and finance leases in the cash flows from financing activities in our condensed consolidated statements of cash flows.\nWe plan to continue to allocate our available capital, after satisfying our distribution requirements, among investment alternatives that meet our return on investment criteria, while maintaining our commitment to our long-term financial policies. Accordingly, we expect to continue to deploy capital through our annual capital expenditure program, including land purchases and new site and data center facility construction, and through acquisitions. We also regularly review our portfolios as to capital expenditures required to upgrade our infrastructure to our structural standards or address capacity, structural or permitting issues.\n51\nWe expect that our 2025 total capital expenditures will be as follows (in millions):  \nDiscretionary capital projects (1)\n$\n865 \nto\n$\n895 \nGround lease purchases\n200 \nto\n220 \nCapital improvements and corporate expenditures\n170 \nto\n180 \nRedevelopment\n320 \nto\n350 \nStart-up capital projects\n65 \nto\n85 \nTotal capital expenditures\n$\n1,620 \nto\n$\n1,730 \n_______________ \n(1)\nIncludes the construction of approximately 1,850 to 2,450 communications sites globally and approximately $600 million of anticipated spend related to data center assets.\nCash Flows from Financing Activities \nOur significant financing activities were as follows (in millions): \nNine Months Ended September 30,\n2025\n2024\nProceeds from issuance of senior notes, net\n$\n2,153.3 \n$\n2,374.1 \nProceeds from (repayments of) credit facilities, net\n1,242.2 \n(1,113.1)\nRepayments of term loans (1)\n— \n(1,015.4)\nRepayments of securitized debt\n(525.0)\n— \nRepayments of senior notes\n(3,206.2)\n(2,150.0)\nContributions from noncontrolling interest holders\n148.1 \n103.7 \nDistributions to noncontrolling interest holders\n(140.7)\n(361.8)\nDistributions paid on common stock\n(2,361.0)\n(2,316.9)\n_______________\n(1)\nFor the nine months ended September 30, 2024, includes repayments of the 825.0 million EUR unsecured term loan, as amended in December 2021, and the 10.0 billion INR unsecured term loan in India.\nSecuritizations\nAmerican Tower Secured Revenue Notes and Repayment of Series 2015-2 Notes\n—In May 2015, GTP Acquisition Partners I, LLC, one of our wholly owned subsidiaries, refinanced existing debt with cash on hand and proceeds from a private issuance (the “2015 Securitization”) of (i) $350.0 million of American Tower Secured Revenue Notes, Series 2015-1, Class A, which were subsequently repaid on the June 2020 payment date, and (ii) $525.0 million of the Series 2015-2 Notes. On the June 2025 payment date, we repaid $525.0 million aggregate principal amount outstanding under the Series 2015-2 Notes, pursuant to the terms of the agreements governing such securities. The repayment was funded with borrowings under the 2021 Multicurrency Credit Facility and cash on hand. Following such repayment, no notes were outstanding under the 2015 Securitization.\nRepayments of Senior Notes\nRepayment of 2.950% Senior Notes\n—On January 14, 2025, we repaid $650.0 million aggregate principal amount of the 2.950% Notes upon their maturity. The 2.950% Notes were repaid using cash on hand and borrowings under the 2021 Multicurrency Credit Facility. Upon completion of the repayment, none of the 2.950% Notes remained outstanding.\nRepayment of 2.400% Senior Notes\n—On March 14, 2025, we repaid $750.0 million aggregate principal amount of the 2.400% Notes upon their maturity. The 2.400% Notes were repaid using proceeds from the issuance of the 4.900% Notes and the 5.350% Notes (each as defined below). Upon completion of the repayment, none of the 2.400% Notes remained outstanding.\n52\nRepayment of 1.375% Senior Notes—\nOn April 3, 2025, we repaid 500.0 million EUR aggregate principal amount of our 1.375% Notes upon their maturity. The 1.375% Notes were repaid using borrowings under the 2021 Multicurrency Credit Facility and cash on hand. Upon completion of the repayment, none of the 1.375% Notes remained outstanding.\nRepayment of 4.000% Senior Notes\n—On May 30, 2025, we repaid $750.0 million aggregate principal amount of our 4.000% Notes upon their maturity. The 4.000% Notes were repaid using borrowings under the 2021 Credit Facility and cash on hand. Upon completion of the repayment, none of the 4.000% Notes remained outstanding.\nRepayment of 1.300% Senior Notes\n—On September 12, 2025, we repaid $500.0 million aggregate principal amount of our 1.300% Notes upon their maturity. The 1.300% Notes were repaid using borrowings under the 2021 Credit Facility. Upon completion of the repayment, none of the 1.300% Notes remained outstanding.\nOfferings of Senior Notes\n4.900% Senior Notes and 5.350% Senior Notes Offering—\nOn March 14, 2025, we completed a registered public offering of $650.0 million aggregate principal amount of 4.900% senior unsecured notes due 2030 (the “Initial 4.900% Notes”) and $350.0 million aggregate principal amount of 5.350% senior unsecured notes due 2035 (the “Initial 5.350% Notes”). The net proceeds from this offering were approximately $988.9 million, after deducting commissions and estimated expenses. We used the net proceeds to repay the 2.400% Notes, to repay existing indebtedness under the 2021 Multicurrency Credit Facility and for general corporate purposes.\nOn September 16, 2025, we completed a registered public offering of $200.0 million aggregate principal amount through a reopening of the Initial 4.900% Notes (the “Reopened 4.900% Notes” and, collectively with the Initial 4.900% Notes, the “4.900% Notes”) and $375.0 million aggregate principal amount through a reopening of the Initial 5.350% Notes (the “Reopened 5.350% Notes” and, collectively with the Initial 5.350% Notes, the “5.350% Notes”). The net proceeds from this offering were approximately $587.8 million, after deducting commissions and estimated expenses. We used the net proceeds to repay existing indebtedness under the 2021 Credit Facility and for general corporate purposes.\n3.625% Senior Notes Offering—\nOn May 30, 2025, we completed a registered public offering of 500.0 million EUR (approximately $567.4 million at the date of issuance) aggregate principal amount of 3.625% senior unsecured notes due 2032 (the “3.625% Notes,” and, collectively with the 4.900% Notes and the 5.350% Notes, the “Notes”). The net proceeds from this offering were approximately 496.8 million EUR (approximately $563.7 million at the date of issuance), after deducting commissions and estimated expenses. We used the net proceeds to repay existing indebtedness under the 2021 Multicurrency Credit Facility and for general corporate purposes.\nThe key terms of the Notes are as follows:\nSenior Notes\nAggregate Principal Amount (in millions)\nIssue Date and Interest Accrual Date\nMaturity Date\nContractual Interest Rate\nFirst Interest Payment\nInterest Payments Due (1)\nPar Call Date (2)\n4.900% Notes\n(3)\n$\n850.0 \nMarch 14, 2025\nMarch 15, 2030\n4.900%\nSeptember 15, 2025\nMarch 15 and September 15\nFebruary 15, 2030\n5.350% Notes\n(3)\n$\n725.0 \nMarch 14, 2025\nMarch 15, 2035\n5.350%\nSeptember 15, 2025\nMarch 15 and September 15\nDecember 15, 2034\n3.625% Notes\n(4)\n$\n567.4 \nMay 30, 2025\nMay 30, 2032\n3.625%\nMay 30, 2026\nMay 30\nMarch 30, 2032\n___________\n(1)\nAccrued and unpaid interest on U.S. Dollar (“USD”) denominated notes is payable in USD semi-annually in arrears and will be computed from the issue date on the basis of a 360-day year comprised of twelve 30-day months.  Interest on EUR denominated notes is payable in EUR annually in arrears and will be computed on the basis of the actual number of days in the period for which interest is being calculated and the actual number of days from and including the last date on which interest was paid on the notes, beginning on the issue date.\n(2)\nWe may redeem the Notes at any time, in whole or in part, at a redemption price equal to 100% of the principal amount of the Notes plus a make-whole premium, together with accrued interest to the redemption date. If we redeem the Notes on or after the par call date, we will not be required to pay a make-whole premium.\n(3)\nThe Initial 4.900% Notes and the Initial 5.350% Notes were issued on March 14, 2025. The Reopened 4.900% Notes and the Reopened 5.350% Notes were issued on September 16, 2025. The first interest payments made on September 15, 2025 related solely to the Initial 4.900% Notes and the Initial 5.350% Notes. The first interest payments on the Reopened 4.900% Notes and the Reopened 5.350% Notes are due on March 15, 2026.\n(4)\nThe 3.625% Notes are denominated in EUR; dollar amounts represent the equivalent issuance date aggregate principal amount.\nIf we undergo a change of control and corresponding ratings decline, each as defined in the applicable supplemental indenture for the Notes, we may be required to repurchase all of the Notes at a purchase price equal to 101% of the aggregate principal amount of the Notes repurchased, plus accrued and unpaid interest (including additional interest, if any), up to but not including the repurchase date. The Notes rank equally in right of payment with all of our other senior \n53\nunsecured debt obligations and are structurally subordinated to all existing and future indebtedness and other obligations of our subsidiaries.\nEach applicable supplemental indenture contains certain covenants that restrict our ability to merge, consolidate or sell assets and our (together with our subsidiaries’) ability to incur liens. These covenants are subject to a number of exceptions, including that we and our subsidiaries may incur certain liens on assets, mortgages or other liens securing indebtedness if the aggregate amount of indebtedness secured by such liens does not exceed 3.5x Adjusted EBITDA, as defined in the applicable supplemental indenture.\nBank Facilities\nAmendments to Bank Facilities—\nOn January 28, 2025, we amended our (i) $6.0 billion senior unsecured multicurrency revolving credit facility, as amended and restated in December 2021, as further amended (the “2021 Multicurrency Credit Facility”) (ii) $4.0 billion senior unsecured revolving credit facility, as amended and restated in December 2021, as further amended (the “2021 Credit Facility”) and (iii) $1.0 billion unsecured term loan, as amended and restated in December 2021, as further amended (the “2021 Term Loan”). \nThese amendments, among other things, \ni.\nextend the maturity dates of the 2021 Multicurrency Credit Facility and the 2021 Credit Facility to January 28, 2028 and January 28, 2030, respectively; \nii.\nextend the maturity date of the 2021 Term Loan to January 28, 2028; and\niii.\nupdate the Applicable Margins (as defined in the loan agreements).\n2021 Multicurrency Credit Facility—\nDuring the nine months ended September 30, 2025, we borrowed an aggregate of $2.4 billion, including 492.0 million EUR ($529.1 million as of the borrowing date) and repaid an aggregate of $2.0 billion, including 492.0 million EUR ($549.9 million as of the repayment date) of revolving indebtedness under the 2021 Multicurrency Credit Facility. We used the borrowings to repay outstanding indebtedness, including the 2.950% Notes, the 1.375% Notes and the Series 2015-2 Notes, and for general corporate purposes. We currently have $6.3 million of undrawn letters of credit and maintain the ability to draw down and repay amounts under the 2021 Multicurrency Credit Facility in the ordinary course.\n2021 Credit Facility—\nDuring the nine months ended September 30, 2025, we borrowed an aggregate of $2.9 billion and repaid an aggregate of $2.1 billion of revolving indebtedness under the 2021 Credit Facility. We used the borrowings to repay outstanding indebtedness, including the 4.000% Notes and the 1.300% Notes, and for general corporate purposes. We currently have $29.8 million of undrawn letters of credit and maintain the ability to draw down and repay amounts under the 2021 Credit Facility in the ordinary course.\nAs of September 30, 2025, the key terms under the 2021 Multicurrency Credit Facility, the 2021 Credit Facility and the 2021 Term Loan, were as follows:\nBank Facility\nOutstanding Principal Balance \n($ in millions)\nMaturity Date\nSOFR or EURIBOR borrowing interest rate range (1)\nBase rate borrowing interest rate range (1)\nCurrent margin over SOFR or EURIBOR and the base rate, respectively\n2021 Multicurrency Credit Facility\n(2)\n$\n445.0 \nJanuary 28, 2028\n(3)\n0.750% - 1.375%\n0.000% - 0.375%\n0.875% and 0.000%\n2021 Credit Facility\n(2)\n815.0 \nJanuary 28, 2030\n(3)\n0.750% - 1.375%\n0.000% - 0.375%\n0.875% and 0.000%\n2021 Term Loan\n(2)\n1,000.0 \nJanuary 28, 2028\n0.750% - 1.375%\n0.000% - 0.375%\n0.875% and 0.000%\n___________\n(1)\nRepresents interest rate above: (a) Secured Overnight Financing Rate (“SOFR”) for SOFR based borrowings, (b) Euro Interbank Offer Rate (“EURIBOR”) for EURIBOR based borrowings and (c) the defined base rate for base rate borrowings, in each case based on our debt ratings. \n(2)\nCurrently borrowed at SOFR. \n(3)\nSubject to two optional renewal periods.\nWe must pay a quarterly commitment fee on the undrawn portion of each of the 2021 Multicurrency Credit Facility and the 2021 Credit Facility. The commitment fee for the 2021 Multicurrency Credit Facility and the 2021 Credit Facility ranges from 0.080% to 0.200% per annum, based upon our debt ratings, and is currently 0.100%. \n54\nThe 2021 Multicurrency Credit Facility, the 2021 Credit Facility and the 2021 Term Loan and the associated loan agreements (the “Bank Loan Agreements”) do not require amortization of principal and may be paid prior to maturity in whole or in part at our option without penalty or premium. We have the option of choosing either a defined base rate, SOFR or EURIBOR as the applicable base rate for borrowings under these bank facilities.\nEach Bank Loan Agreement contains certain reporting, information, financial and operating covenants and other restrictions (including limitations on additional debt, guaranties, sales of assets and liens) with which we must comply. Failure to comply with these financial and operating covenants could not only prevent us from being able to borrow additional funds under the revolving credit facilities, but may constitute a default, which could result in, among other things, the amounts outstanding under the applicable agreement, including all accrued interest and unpaid fees, becoming immediately due and payable.\nBangladesh Term Loan—\nIn March 2025, we entered into a 400.0 million Bangladeshi Taka (“BDT”) (approximately $3.3 million) term loan with a maturity date that is eight years from the date of the first draw thereunder (the “Bangladesh Term Loan”). On March 24, 2025, we borrowed 150.0 million BDT (approximately $1.2 million) under the Bangladesh Term Loan. The Bangladesh Term Loan bears interest at 13.50% per annum, subject to quarterly resets. Interest is payable quarterly. Any outstanding principal and accrued but unpaid interest will be due and payable in full at maturity. The Bangladesh Term Loan does not require amortization of principal and may be paid prior to maturity in whole or in part at our option without penalty or premium.\nCoreSite DE1 Note—\nOn April 1, 2025, in connection with our acquisition of a multi-tenant data center facility in Denver, Colorado, in which we previously leased space (“DE1”), we entered into an agreement to pay $5.0 million of purchase price to the seller in monthly installments through March 31, 2028 (the “CoreSite DE1 Note”). The CoreSite DE1 Note accrues interest at the prime rate as announced by Bank of America, N.A plus 200 basis points. As of September 30, 2025, the interest rate was 9.50% per annum. Interest is payable monthly in arrears. Any outstanding principal and accrued but unpaid interest will be due and payable in full at maturity. The CoreSite DE1 Note may be paid prior to maturity in whole or in part at our option without penalty or premium, provided that if such prepayment is made prior to April 1, 2027, we are required to pay any additional interest which would have accrued under the CoreSite DE1 Note in the ordinary course through April 1, 2027. \nStock Repurchase Programs\n—In March 2011, our Board of Directors approved a stock repurchase program, pursuant to which we are authorized to repurchase up to $1.5 billion of our common stock (the “2011 Buyback”). In December 2017, our Board of Directors approved an additional stock repurchase program, pursuant to which we are authorized to repurchase up to $2.0 billion of our common stock (the “2017 Buyback,” and, together with the 2011 Buyback, the “Buyback Programs”).\nDuring the nine months ended September 30, 2025, there were no repurchases under either of the Buyback Programs. Subsequent to September 30, 2025, through October 21, 2025, we repurchased 151,133 shares of our common stock for an aggregate of approximately $28.0 million, including commissions and fees, under both the 2011 Buyback and the 2017 Buyback. We have no amounts remaining under the 2011 Buyback. \nWe expect to continue managing the pacing of the remaining approximately $2.0 billion under the 2017 Buyback in response to general market conditions and other relevant factors. We expect to fund any further repurchases of our common stock through a combination of cash on hand, cash generated by operations and borrowings under our credit facilities. Repurchases under the 2017 Buyback are subject to, among other things, us having available cash to fund the repurchases. \nSales of Equity Securities—\nWe receive proceeds from sales of our equity securities pursuant to our employee stock purchase plan and upon exercise of stock options granted under our equity incentive plan. During the nine months ended September 30, 2025, we received an aggregate of $34.6 million in proceeds upon exercises of stock options and sales pursuant to our employee stock purchase plan.\nFuture Financing Transactions\n—We regularly consider various options to obtain financing and access the capital markets, subject to market conditions, to meet our funding needs. Such capital raising alternatives, in addition to those noted above, may include amendments and extensions of our bank facilities, entry into new bank facilities, transactions with private equity funds or partnerships, additional senior note and equity offerings and securitization transactions. No assurance can be given as to whether any such financing transactions will be completed or as to the timing or terms thereof.\n55\nDistributions—\nAs a REIT, we must annually distribute to our stockholders an amount equal to at least 90% of our REIT taxable income (determined before the deduction for distributed earnings and excluding any net capital gain). Generally, we have distributed, and expect to continue to distribute, all or substantially all of our REIT taxable income after taking into consideration our utilization of net operating losses (“NOLs”). We have distributed an aggregate of approximately $22.9 billion to our common stockholders, including the dividend paid in October 2025, primarily classified as ordinary income that may be treated as qualified REIT dividends under Section 199A of the Code for taxable years beginning before 2026.\nDuring the nine months ended September 30, 2025, we paid $5.02 per share, or $2.3 billion, to our common stockholders of record. In addition, we declared a distribution of $1.70 per share, or $796.1 million, paid on October 20, 2025 to our common stockholders of record at the close of business on September 30, 2025.\nThe amount, timing and frequency of future distributions will be at the sole discretion of our Board of Directors and will depend on various factors, a number of which may be beyond our control, including our financial condition and operating cash flows, the amount required to maintain our qualification for taxation as a REIT and reduce any income and excise taxes that we otherwise would be required to pay, limitations on distributions in our existing and future debt and preferred equity instruments, our ability to utilize NOLs to offset our distribution requirements, limitations on our ability to fund distributions using cash generated through our taxable REIT subsidiaries and other factors that our Board of Directors may deem relevant.\nWe accrue distributions on unvested restricted stock units, which are payable upon vesting. As of September 30, 2025, the amount accrued for distributions payable related to unvested restricted stock units was $18.5 million. During the nine months ended September 30, 2025, we paid $12.1 million of distributions upon the vesting of restricted stock units.\nFactors Affecting Sources of Liquidity\n    \nAs discussed in the “Liquidity and Capital Resources” section of the 2024 Form 10-K, our liquidity depends on our ability to generate cash flow from operating activities, borrow funds under our credit facilities and maintain compliance with the contractual agreements governing our indebtedness. We believe that the debt agreements discussed below represent our material debt agreements that contain covenants, our compliance with which would be material to an investor’s understanding of our financial results and the impact of those results on our liquidity.\nRestrictions Under Loan Agreements Relating to Our Credit Facilities—\nEach Bank Loan Agreement contains certain financial and operating covenants and other restrictions applicable to us and our subsidiaries that are not designated as unrestricted subsidiaries on a consolidated basis. These restrictions include limitations on additional debt, distributions and dividends, guaranties, sales of assets and liens. The Bank Loan Agreements also contain covenants that establish financial tests with which we and our restricted subsidiaries must comply related to total leverage and senior secured leverage, as set forth in the table below. As of September 30, 2025, we were in compliance with each of these covenants.\nCompliance Tests For The 12 Months Ended \nSeptember 30, 2025\n($ in billions)\nRatio (1)\nAdditional Debt Capacity Under Covenants (2)\nCapacity for Adjusted EBITDA Decrease Under Covenants (3)\nConsolidated Total Leverage Ratio\nTotal Debt to Adjusted EBITDA \n≤ 6.00:1.00\n~ 5.1\n~ 0.9\nConsolidated Senior Secured Leverage Ratio\nSenior Secured Debt to Adjusted EBITDA \n≤ 3.00:1.00\n~ 19.4 (4)\n~6.5 (4)\n_______________\n(1)\nEach component of the ratio as defined in the applicable loan agreement.\n(2)\nAssumes no change to Adjusted EBITDA.\n(3)\nAssumes no change to our debt levels. \n(4)\nEffectively, however, additional Senior Secured Debt under this ratio would be limited to the capacity under the Consolidated Total Leverage Ratio.  \nThe Bank Loan Agreements also contain reporting and information covenants that require us to provide financial and operating information to the lenders within certain time periods. If we are unable to provide the required information on a timely basis, we would be in breach of these covenants.\nFailure to comply with the financial maintenance tests and certain other covenants of the Bank Loan Agreements could not only prevent us from being able to borrow additional funds under the revolving credit facilities, but may also \n56\nconstitute a default under these credit facilities, which could result in, among other things, the amounts outstanding, including all accrued interest and unpaid fees, becoming immediately due and payable. If this were to occur, we may not have sufficient cash on hand to repay such indebtedness. The key factors affecting our ability to comply with the debt covenants described above are our financial performance relative to the financial maintenance tests defined in the Bank Loan Agreements and our ability to fund our debt service obligations. Based upon our current expectations, we believe our operating results during the next 12 months will be sufficient to comply with these covenants.\nRestrictions Under Agreements Relating to the Trust Securitizations—\nThe indenture and related supplemental indenture governing the loan agreement related to the securitization transactions completed in March 2018 (the “2018 Securitization”) and March 2023 (the “2023 Securitization” and, together with the 2018 Securitization, the “Trust Securitizations”) (the “Securitization Loan Agreements”) include certain financial ratios and operating covenants and other restrictions customary for transactions subject to rated securitizations. Among other things, American Tower Asset Sub, LLC and American Tower Asset Sub II, LLC (together, the “AMT Asset Subs”) are prohibited from incurring other indebtedness for borrowed money or further encumbering their assets, subject to customary carve-outs for ordinary course trade payables and permitted encumbrances (as defined in the applicable agreements).\nUnder the Securitization Loan Agreements, amounts due will be paid from the cash flows generated by the assets securing the nonrecourse loan that secures the Secured Tower Revenue Securities, Series 2018-1, Subclass A (the “Series 2018-1A Securities”), the Secured Tower Revenue Securities, Series 2018-1, Subclass R (the “Series 2018-1R Securities” and, together with the Series 2018-1A Securities, the “2018 Securities”), the Secured Tower Revenue Securities 2023-1, Subclass A (the “Series 2023-1A Securities”), the Secured Tower Revenue Securities, Series 2023-1, Subclass R (the “Series 2023-1R Securities” and, together with the Series 2023-1A Securities, the “2023 Securities”) issued in the Trust Securitizations (the “Loan”), as applicable, which must be deposited into certain reserve accounts, and thereafter distributed, solely pursuant to the terms of the applicable agreement. On a monthly basis, after paying all required amounts under the applicable agreement, subject to the conditions described in the table below, the excess cash flows generated from the operation of these assets are released to the AMT Asset Subs, which can then be distributed to us for use. As of September 30, 2025, $90.0 million held in such reserve accounts was classified as restricted cash. \nCertain information with respect to the Trust Securitizations is set forth below. The debt service coverage ratio (“DSCR”) is generally calculated as the ratio of the net cash flow (as defined in the applicable agreement) to the amount of interest, servicing fees and trustee fees required to be paid over the succeeding 12 months on the principal amount of the Loan that will be outstanding on the payment date following such date of determination. \nIssuer or Borrower\nNotes/Securities Issued\nConditions Limiting Distributions of Excess Cash\nExcess Cash Distributed During the Three Months Ended September 30, 2025\nDSCR \nas of September 30, 2025\nCapacity for Decrease in Net Cash Flow Before Triggering  Cash Trap DSCR (1)\nCapacity for Decrease in Net Cash Flow Before Triggering Minimum DSCR (1)\nCash Trap DSCR\nAmortization Period\n(in millions)\n(in millions)\n(in millions)\nTrust Securitizations\nAMT Asset Subs\nSecured Tower Revenue Securities, Series 2023-1, Subclass A, Secured Tower Revenue Securities, Series 2023-1, Subclass R, Secured Tower Revenue Securities, Series 2018-1, Subclass A and Secured Tower Revenue Securities, Series 2018-1, Subclass R\n1.30x, Tested Quarterly (2)\n(3)(4)\n$442.1\n6.51x\n$469.6\n$483.2\n_____________\n(1)\nBased on the net cash flow of the issuer or borrower as of September 30, 2025 and the expenses payable over the next 12 months on the Loan.   \n(2)\nIf the DSCR were equal to or below 1.30x (the “Cash Trap DSCR”) for any quarter, all cash flow in excess of amounts required to make debt service payments, fund required reserves, pay management fees and budgeted operating expenses and make other payments required under the applicable transaction documents, referred to as excess cash flow, will be deposited into a reserve account (the “Cash Trap Reserve Account”) \n57\ninstead of being released to the applicable issuer or borrower. Once triggered, a Cash Trap DSCR condition continues to exist until the DSCR exceeds the Cash Trap DSCR for two consecutive calendar quarters. \n(3)\nAn amortization period commences if the DSCR is equal to or below 1.15x (the “Minimum DSCR”) at the end of any calendar quarter and continues to exist until the DSCR exceeds the Minimum DSCR for two consecutive calendar quarters.\n(4)\nAn amortization period exists if the outstanding principal amount has not been paid in full on the applicable anticipated repayment date and continues to exist until the principal has been repaid in full. \nA failure to meet the noted DSCR tests could prevent the AMT Asset Subs from distributing excess cash flow to us, which could affect our ability to fund our capital expenditures, including tower construction and acquisitions, and to meet REIT distribution requirements. During an “amortization period,” all excess cash flow and any amounts then in the applicable Cash Trap Reserve Account would be applied to pay the principal of the Loan on each monthly payment date, and so would not be available for distribution to us. Further, additional interest will begin to accrue with respect to the Loan from and after the anticipated repayment date at a\n \nper annum rate determined in accordance with the applicable agreement. Furthermore, if the AMT Asset Subs were to default on the Loan, the trustee may seek to foreclose upon or otherwise convert the ownership of all or any portion of the 5,024 broadcast and wireless communications towers and related assets that secure the Loan, in which case we could lose those sites and their associated revenue.\nAs discussed above, we use our available liquidity and seek new sources of liquidity to fund capital expenditures, future growth and expansion initiatives, satisfy our distribution requirements and repay or repurchase our debt. If we determine that it is desirable or necessary to raise additional capital, we may be unable to do so, or such additional financing may be prohibitively expensive or restricted by the terms of our outstanding indebtedness. Additionally, as further discussed under the caption “Risk Factors” in Item 1A of the 2024 Form 10-K, market volatility and disruption caused by inflation, high interest rates and supply chain disruptions may impact our ability to raise additional capital through debt financing activities or our ability to repay or refinance maturing liabilities, or impact the terms of any new obligations. If we are unable to raise capital when our needs arise, we may not be able to fund capital expenditures, future growth and expansion initiatives, satisfy our REIT distribution requirements and debt service obligations, or refinance our existing indebtedness.\nIn addition, our liquidity depends on our ability to generate cash flow from operating activities. As set forth under the caption “Risk Factors” in Item 1A of the 2024 Form 10-K, we derive a substantial portion of our current and projected future revenue from a small number of customers and, consequently, a failure by a significant customer to perform its contractual obligations to us could adversely affect our cash flow and liquidity.\nFor more information regarding the terms of our outstanding indebtedness, please see note 8 to our consolidated financial statements included in the 2024 Form 10-K.   \nCritical Accounting Policies and Estimates\nManagement’s discussion and analysis of financial condition and results of operations are based upon our consolidated and condensed consolidated financial statements, which have been prepared in accordance with GAAP. The preparation of these financial statements requires us to make estimates and assumptions that affect the reported amounts of assets, liabilities, revenues and expenses, as well as related disclosures of contingent assets and liabilities. We evaluate our policies and estimates on an ongoing basis, including those related to assets held for sale, discontinued operations, accounting and impairment of long-lived assets, revenue recognition, rent expense and income taxes, as further discussed in the 2024 Form 10-K. Management bases its estimates on historical experience and various other assumptions that are believed to be reasonable under the circumstances, the results of which form the basis for making judgments about the carrying amounts of assets and liabilities that are not readily apparent from other sources. Actual results may differ from these estimates under different assumptions or conditions.\nWe have reviewed our policies and estimates to determine our critical accounting policies for the nine months ended September 30, 2025. We have made no material changes to the critical accounting policies described in the 2024 Form 10-K.\nAccounting Standards Update\nFor a discussion of recent accounting standards updates, see note 1 to our consolidated and condensed consolidated financial statements included in this Quarterly Report.\n58"
}