{
  "item1": "During year ended December 31, 2024, also completed sales subsidiaries Australia (“ATC Australia”) New Zealand (“ATC New Zealand”) total aggregate consideration approximately $77.6 million. recorded gain sales ATC Australia ATC New Zealand $8.5 million, which included Other operating expenses accompanying consolidated statements operations. divestitures did not qualify presentation discontinued operations. operate real estate investment trust U.S.",
  "item7": "Non-GAAP Financial Measures Included analysis results operations discussions regarding earnings before interest, taxes, depreciation, amortization accretion, adjusted (“Adjusted EBITDA”), Funds Operations, defined National Association Real Estate Investment Trusts (“Nareit FFO”) attributable American Tower Corporation common stockholders, Adjusted Funds Operations (“AFFO”) attributable American Tower Corporation common stockholders (“AFFO attributable American Tower Corporation common stockholders”) Segment gross margin. define Adjusted EBITDA Net income before Income (loss) equity method investments; Income (loss) discontinued operations, net taxes; Income tax benefit (provision); Other income (expense); Gain (loss) retirement long-term obligations; Interest expense; Interest income; Other operating income (expense), including Goodwill impairment; Depreciation, amortization accretion; stock-based compensation expense. Nareit FFO attributable American Tower Corporation common stockholders defined net income before gains losses sale disposal real estate, real estate related impairment charges, real estate related depreciation, amortization accretion including adjustments distributions unconsolidated affiliates noncontrolling interests discontinued operations. section, refer Nareit FFO attributable American Tower Corporation common stockholders “Nareit FFO (common stockholders).” define AFFO attributable American Tower Corporation common stockholders Nareit FFO (common stockholders) before (i) straight-line revenue expense; (ii) stock-based compensation expense; (iii) deferred portion income tax other income tax adjustments; (iv) non-real estate related depreciation, amortization accretion; (v) amortization deferred financing costs, debt discounts premiums long-term deferred interest charges; (vi) other income (expense); (vii) gain (loss) retirement long-term obligations; (viii) other operating income (expense); less cash payments related capital improvements cash payments related corporate capital expenditures including adjustments distributions unconsolidated affiliates noncontrolling interests adjustments discontinued operations, which includes impact noncontrolling interests discontinued operations both Nareit FFO corresponding adjustments included AFFO.",
  "item2": "During fourth quarter 2024, following recent divestitures, including ATC TIPL Transaction (as defined below), changes organizational structure, reviewed changed reportable segments. APAC property segment Africa property segment combined into Africa & APAC property segment. result, now report results six segments: U.S. & Canada property (which includes all assets United States Canada, other than data center facilities related assets), Africa & APAC property, Europe property, Latin America property, Data Centers Services."
}