{
  "source_file": "amt-20241231.htm",
  "form_type": "10-K",
  "item1": "ITEM 1.\nBUSINESS\nOverview\nWe are one of the largest global real estate investment trusts and a leading independent owner, operator and developer of multitenant communications real estate. Our primary business is the leasing of space on communications sites to wireless service providers, radio and television broadcast companies, wireless data providers, government agencies and municipalities and tenants in a number of other industries. We refer to this business, inclusive of our data center business discussed below, as our property operations, which accounted for 98% of our total revenues for the year ended December 31, 2024. We also offer tower-related services in the United States, which we refer to as our services operations. These services include site application, zoning and permitting, structural and mount analyses, and construction management, which primarily support our site leasing business, including the addition of new tenants and equipment on our sites. Our customers include our tenants, licensees and other payers.\nSince inception, we have grown our communications real estate portfolio through acquisitions, long-term lease arrangements and site development. Our portfolio primarily consists of towers that we own and towers that we operate pursuant to long-term lease arrangements, as well as distributed antenna system (“DAS”) networks, which provide seamless coverage solutions in certain in-building and outdoor wireless environments. In addition to the communications sites in our portfolio, we manage rooftop and tower sites for property owners under various contractual arrangements. We also hold other telecommunications infrastructure, fiber and property interests that we lease primarily to communications service providers and third-party tower operators, and, as discussed further below, we hold a portfolio of highly interconnected data center facilities and related assets in the United States that we provide for the leasing of space primarily to enterprises, network operators, cloud providers and supporting service providers.\nAs of December 31, 2024, our communications real estate portfolio of 148,957 communications sites included 42,222 communications sites in the U.S. & Canada, 26,642 communications sites in Africa & APAC (as defined below), 31,786 communications sites in Europe and 48,307 communications sites in Latin America, as well as (i) urban telecommunications assets in Argentina, Brazil, Colombia, South Africa and Spain, (ii) other property interests in Canada and the United States and (iii) 29 data center facilities across ten markets in the United States.\nIn 2023, we undertook a strategic review of our India operations, where we evaluated the appropriate level of exposure to the India market within our global portfolio of communications assets, and assessed opportunities to repurpose capital to drive long-term shareholder value and sustained growth. The strategic review concluded in January 2024 with the signed agreement for the ATC TIPL Transaction (as defined below). \nOn January 4, 2024, we, through our subsidiaries, ATC Asia Pacific Pte. Ltd. and ATC Telecom Infrastructure Private Limited (“ATC TIPL”), which held our operations in India, entered into an agreement with Data Infrastructure Trust (“DIT”), an infrastructure investment trust sponsored by an affiliate of Brookfield Asset Management, pursuant to which DIT agreed to acquire a 100% ownership interest in ATC TIPL (the “ATC TIPL Transaction”). Per the terms of the agreement, total aggregate consideration represented up to approximately 210 billion Indian Rupees (“INR”) (approximately $2.5 billion), including the value of the VIL OCDs and the VIL Shares (each as defined and further discussed in Item 7 of this Annual Report under the caption “Management’s Discussion and Analysis of Financial Condition and Results of Operations—Results of Operations—Loss from Discontinued Operations, Net of Taxes”), payments on certain existing customer receivables, the repayment of existing intercompany debt and the repayment, or assumption, of our existing term loan in India, by DIT. \nDuring the year ended December 31, 2024, ATC TIPL distributed approximately 29.6 billion INR (approximately $354.1 million) to us, which included the value of the VIL Shares and the VIL OCDs and the satisfaction of the economic benefit associated with the rights to payments on certain existing customer receivables. The distributions were deducted from the total aggregate consideration received by us at closing. \nThe ATC TIPL Transaction received all government and regulatory approvals during the three months ended September 30, 2024, and on September 12, 2024, we completed the sale of ATC TIPL and received total consideration of 182 billion INR (approximately $2.2 billion). We used the proceeds from the ATC TIPL Transaction to repay existing indebtedness under our $6.0 billion senior unsecured multicurrency revolving credit facility, as amended and restated in December 2021, as further amended (the “2021 Multicurrency Credit Facility”). The divestiture qualified for presentation as discontinued operations. We recorded a loss on the sale of ATC TIPL of $1.2 billion, which primarily included the reclassification of our cumulative translation adjustment in India upon exiting the market of $1.1 billion. The loss on sale of ATC TIPL is included in Loss from discontinued operations, net of taxes in the consolidated statements of operations for the year ended December 31, 2024. See note 22 to our consolidated and condensed consolidated financial statements included in this Annual Report (“Note 22”) for further discussion.\n1\nTable of Contents\n \nDuring the year ended December 31, 2024, we also completed the sales of our subsidiaries in Australia (“ATC Australia”) and New Zealand (“ATC New Zealand”) for total aggregate consideration of approximately $77.6 million. We recorded a gain on the sales of ATC Australia and ATC New Zealand of $8.5 million, which is included in Other operating expenses in the accompanying consolidated statements of operations. The divestitures did not qualify for presentation as discontinued operations.\nWe operate as a real estate investment trust for U.S. federal income tax purposes (“REIT”). Accordingly, we generally are not required to pay U.S. federal income taxes on income generated by our REIT operations, including the income derived from leasing space on our towers and in our data centers, as we receive a dividends paid deduction for distributions to stockholders that offsets our REIT taxable income and gains. However, we remain obligated to pay U.S. federal income taxes on earnings from our domestic taxable REIT subsidiaries (“TRSs”). In addition, our international assets and operations, regardless of their classification for U.S. tax purposes, continue to be subject to taxation in the jurisdictions where those assets are held or those operations are conducted.\nThe use of TRSs enables us to continue to engage in certain businesses and jurisdictions while complying with REIT qualification requirements. We may, from time to time, change the election of previously designated TRSs to be included as part of the REIT. As of December 31, 2024, our REIT-qualified businesses included our U.S. tower leasing business, a majority of our U.S. DAS networks business, our Services and Data Centers segments, as well as most of our operations in Canada, Costa Rica, France, Germany, Ghana, Kenya, Mexico, Nigeria, South Africa, Spain and Uganda.\nDuring the fourth quarter of 2024, following recent divestitures, including the ATC TIPL Transaction, and changes to our organizational structure, we reviewed and changed our reportable segments. Our Asia-Pacific (“APAC”) property segment and our Africa property segment were combined into the Africa & APAC property segment. As a result, we now have six reportable segments: U.S. & Canada property (which includes all assets in the United States and Canada, other than our data center facilities and related assets), Africa & APAC property, Europe property, Latin America property, Data Centers and Services. This change aligns with our management structure and better aligns our reporting with management’s current approach of allocating costs and resources, managing growth and profitability and assessing the operating performance of our business segments.\nProducts and Services\nProperty Operations \nOur property operations accounted for 98%, 99% and 98% of our total revenues for the years ended December 31, 2024, 2023 and 2022, respectively. Our revenue is primarily generated from tenant leases. Within our tower leasing operations, our tenants lease space on our communications real estate, where they install and maintain their equipment. Rental payments vary considerably depending upon numerous factors, including, but not limited to, amount, type and position of tenant equipment on the tower, remaining tower capacity and tower location. Our costs typically include ground rent (which is primarily fixed under long-term lease agreements with annual cost escalations) and power and fuel costs, some or all of which may be passed through to our tenants, as well as property taxes and repair and maintenance expenses. Our property operations have generated consistent growth in revenue and typically have low cash flow volatility due to the following characteristics: \n•\nLong-term tenant leases with contractual rent escalations.\n In general, our tenant leases for our communications sites with wireless carriers have initial non-cancellable terms of five to ten years with multiple renewal terms, with provisions that periodically increase the rent due under the lease, typically annually, based on a fixed escalation percentage (averaging approximately 3% in the United States) or an inflationary index in most of our international markets, or a combination of both. Based upon foreign currency exchange rates and the tenant leases in place as of December 31, 2024, we expect to generate nearly $54 billion of non-cancellable tenant lease revenue over future periods, before the impact of straight-line lease accounting. \n•\nConsistent demand for our sites.\n As a result of rapidly growing usage of mobile data and other wireless services and the corresponding wireless industry capital spending trends in the markets we serve, we anticipate consistent demand for our communications sites. We believe that our global asset base positions us well to benefit from the increasing proliferation of advanced wireless devices and the increasing usage of high bandwidth applications on those devices. We have the ability to add new tenants and new equipment for existing tenants on our sites, which typically results in incremental revenue and modest incremental costs. Our site portfolio and our established tenant base provide us with a solid platform for new business opportunities, which has historically resulted in consistent and predictable organic revenue growth.\n•\nHigh lease renewal rates.\n Our tenants tend to renew leases because suitable alternative sites may not exist or be available and repositioning a site in their network may be expensive and may adversely affect network quality. We define churn as tenant billings lost when a tenant cancels or does not renew its lease or, in limited circumstances, when the lease rates on existing leases are reduced. We derive our churn rate for a given year by dividing our tenant billings \n2\nTable of Contents\n \nlost on this basis by our prior-year tenant billings. During the year ended December 31, 2024, churn was approximately 2% of our tenant billings, primarily driven by churn in our U.S. & Canada property segment. We expect that our churn rate in our U.S. & Canada property segment will continue to be elevated through 2025 due to contractual lease cancellations and non-renewals by T-Mobile US, Inc. (“T-Mobile”), including legacy Sprint Corporation leases, pursuant to the terms of our master lease agreement with T-Mobile (the “T-Mobile MLA”) entered into in September 2020. \n•\nHigh operating margins.\n Incremental operating costs associated with adding new tenants or equipment to an existing communications site are typically relatively minimal. Therefore, as tenants or equipment are added, the substantial majority of incremental revenue flows through to gross margin and operating profit. In addition, in many of our international markets, certain expenses, such as ground rent or power and fuel costs, are reimbursed or shared by our tenant base.\n•\nLow maintenance capital expenditures.\n On average, we require relatively low amounts of annual capital expenditures to maintain our communications sites.\nOur property business includes the operation of communications sites and managed networks, the leasing of property interests  and, in select markets, the operation of fiber, the operation of data centers and the provision of backup power through shared generators. Our presence in a number of markets at different relative stages of wireless development provides us with significant diversification and long-term growth potential. Our property segments accounted for the following percentage of consolidated total revenue for the years ended December 31,: \n2024\n2023\n2022\nU.S. & Canada\n52 \n%\n53 \n%\n52 \n%\nAfrica & APAC (1)\n12 \n%\n12 \n%\n12 \n%\nEurope\n8 \n%\n8 \n%\n8 \n%\nLatin America\n17 \n%\n18 \n%\n18 \n%\nData Centers\n9 \n%\n8 \n%\n8 \n%\n_______________\n(1)    Excludes the operating results of ATC TIPL, which are reported as discontinued operations. See Note 22 for further discussion.\nCommunications Sites.\n Approximately 87%, 88% and 87% of revenue in our property segments was attributable to our communications sites, excluding DAS networks and fiber, for the years ended December 31, 2024, 2023 and 2022, respectively. \nWe lease space on our communications sites to tenants providing a diverse range of communications services, including cellular voice and data, broadcasting, mobile video and a number of other applications. In addition, in many of our international markets, we receive pass-through revenue from our tenants to cover certain costs, including power and fuel costs and ground rent. Our top tenants by revenue for each property segment are as follows for the year ended December 31, 2024:\n•\nU.S. & Canada:\n AT&T Inc. (“AT&T”); T-Mobile; and Verizon Communications Inc. (“Verizon Wireless”) accounted for an aggregate of 86% of U.S. & Canada property segment revenue. \n•\nAfrica & APAC: \nBharti Airtel Limited (“Airtel”); and MTN Group Limited (“MTN”) accounted for an aggregate of 81% of Africa & APAC property segment revenue.\n•\nEurope: \nTelefónica S.A. (“Telefónica”) accounted for an aggregate of 70% of Europe property segment revenue. \n•\nLatin America:\n América Móvil; AT&T; Telefónica; and TIM S.p.A. accounted for an aggregate of 74% of Latin America property segment revenue.  \nAccordingly, we are subject to certain risks, as set forth in Item 1A of this Annual Report under the caption “Risk Factors—A substantial portion of our current and projected future revenue is derived from a small number of customers, and we are sensitive to adverse changes in the creditworthiness and financial strength of our customers.” In addition, we are subject to risks related to our international operations, as set forth under the caption “Risk Factors—Our foreign operations are subject to economic, political and other risks that could materially and adversely affect our revenues or financial position, including risks associated with fluctuations in foreign currency exchange rates.”\nManaged Networks, Data Centers and Related Assets, Other Telecommunications Assets, Property Interests and Shared Generators. \nIn addition to our communications sites, we also own and operate several types of managed network solutions, provide communications site management services to third parties, manage and lease property interests under carrier or other third-party communications sites, operate data center facilities and related assets, operate other telecommunications assets and provide back-up power sources to tenants at our sites. The balance of our property segment revenue not attributable to our communications sites was attributable to these items.\n3\nTable of Contents\n \n•\nManaged Networks. \nWe own and operate DAS networks in the United States and certain international markets. We obtain rights from property owners to install and operate in-building DAS networks, and we grant rights to wireless service providers to attach their equipment to our installations. We also offer a small portfolio of outdoor DAS networks as a complementary shared infrastructure solution for our tenants in the United States and in certain international markets. Typically, we have designed, built and operated our outdoor DAS networks in areas in which zoning restrictions or other barriers may prevent or delay deployment of more traditional wireless communications sites, such as macro tower sites. We also hold lease rights and easement interests on rooftops capable of hosting communications equipment in locations where towers are generally not a viable solution based on area characteristics. In addition, we provide management services to property owners in the United States who elect to retain full rights to their property while simultaneously marketing the rooftop for wireless communications equipment installation. As the demand for advanced wireless services in urban markets evolves, we continue to evaluate a variety of infrastructure solutions, including small cells and other network architectures that may support our tenants’ networks in these areas.\n•\nData Centers and Related Assets. \nWe own and operate data center facilities and related assets in the United States, which consist of specialized and secure buildings that house networking, storage and communications technology infrastructure, including servers, storage devices, switches, routers and fiber optic transmission equipment. These buildings are designed to provide the power, cooling and network connectivity necessary to efficiently operate this equipment. Data centers located at points where many communications networks converge can also function as interconnection hubs where customers are able to connect to multiple networks, cloud companies and other service providers to exchange traffic and interoperate with each other.\n•\nOther Telecommunications Assets. \nWe own and operate other telecommunications assets, including fiber and related assets, in certain international markets. We currently provide the right to use such fiber and related assets to communications and internet service providers and third-party operators to support their telecommunications infrastructure.\n•\nProperty Interests\n.\n We own portfolios of property interests in Canada and the United States, including land under carrier or other third-party communications sites, which provide recurring cash flow under complementary leasing arrangements.\n•\nShared Generators\n.\n We have contracts with certain of our tenants in the United States pursuant to which we provide access to shared backup power generators.\nServices Operations\nWe offer tower-related services in the United States, including site application, zoning and permitting, structural and mount analyses, and construction management services. Our services operations primarily support our site leasing business, including through the addition of new tenants and equipment on our sites. This segment accounted for 2%, 1% and 2% of our total revenue for the years ended December 31, 2024, 2023 and 2022, respectively.\nSite Application, Zoning and Permitting\n. We engage in site application services on our own behalf in connection with our tower development projects, as well as on behalf of our tenants. We typically work with our tenants’ engineers to determine the geographic areas where new communications sites will best address the tenants’ needs and meet their coverage objectives. Once a new site is identified, we acquire the rights to the land or structure on which the site will be constructed, and we manage the permitting process to ensure all necessary approvals are obtained to construct and operate the communications site.\nStructural and Mount Analyses.\n We offer structural and mount analyses services to wireless carriers in connection with the installation of their communications equipment on our towers. Our team of engineers can evaluate whether a tower structure can support the additional burden of the new equipment or if an upgrade is needed, and whether the proposed mount configurations will be capable of supporting the required loads in accordance with applicable standards. This enables our tenants to better assess potential sites before making an installation decision. Our structural and mount analyses capabilities enable us to provide higher quality service to our existing tenants by, among other things, reducing the time required to achieve on-air readiness, while also providing opportunities to offer structural and mount analyses services to third parties. \nConstruction Management.\n We offer construction management services to wireless carriers in connection with the deployment of their networks on our tower sites. Our construction management team oversees construction activities such as contractor sourcing, contractor selection and management, materials management, on-site quality control and closeout documentation for new installations or modifications. Our construction management capabilities enable us to provide efficient deployment to the carriers while ensuring that the construction work meets our quality control standards. \n4\nTable of Contents\n \nStrategy\nOperational Strategy\nAs wireless communications technologies advance and the use of wireless services on handsets, tablets and other advanced mobile devices grows, there is a corresponding increase in demand for the communications infrastructure required to facilitate ever growing network demand. To capture this demand, our primary operational focus is to (i) increase the occupancy of our existing communications real estate portfolio to support global connectivity, (ii) invest in, and selectively grow, our communications real estate portfolio and service offerings, including through platform expansion initiatives, (iii) further improve our operational performance and efficiency and (iv) maintain a strong balance sheet. We believe these efforts to meet our customers’ needs will support and enhance our ability to capitalize on the growth in demand for wireless infrastructure. In addition, we expect to explore new opportunities to enhance or extend our shared communications infrastructure businesses, including those that may make our assets incrementally more attractive to new customers, or to existing customers for new uses, and those that increase our operational efficiency. \n•\nIncrease the occupancy of our existing communications real estate portfolio to support global connectivity.\n We believe that our highest incremental returns will be achieved by leasing additional space on our existing communications sites. Increasing demand for wireless services in our served markets has resulted in significant capital spending by major wireless carriers and other connectivity providers. As a result, we anticipate growing demand for our communications sites because they are attractively located and typically have capacity available for additional tenants and equipment. In the United States, incremental carrier network activity is being driven by ongoing 5G network deployments. In our international markets, carriers are increasingly deploying more advanced network technologies such as 4G and, in the case of our international markets with more mature network technology, 5G, while continuing to selectively augment legacy networks. We believe that the majority of our towers have capacity for additional tenants and that substantially all of our towers that are currently at or near full structural capacity can be upgraded or augmented to meet future tenant demand with relatively modest capital investment. Therefore, we will continue to target our sales and marketing activities to increase the utilization and return on investment of our existing communications sites.\n•\nInvest in and selectively grow our communications real estate portfolio to meet our customers’ needs.\n We seek opportunities to invest in and grow our operations through our capital expenditure program, acquisitions and platform expansion initiatives. A significant portion of our inorganic growth has been focused on properties with lower initial tenancy because we believe that over time we can significantly increase tenancy levels, and therefore, drive strong returns on those assets. More recently, we have invested in strategic data center assets, including through our acquisition of CoreSite Realty Corporation (“CoreSite,” and the acquisition, the “CoreSite Acquisition”) in late 2021, which we believe can drive strong, recurring growth and also meaningfully enhance the value of our existing communications tower real estate through emerging edge compute opportunities in the future. We also expect to explore additional ways to use our platform expansion initiatives to enhance the efficiency of our operations over time.\n•\nFurther improve our operational performance and efficiency.\n We continue to seek opportunities to improve our operational performance throughout the organization. This includes investing in our systems and people as we strive to improve efficiency and provide superior service to our customers. To achieve this, we intend to continue to focus on customer service initiatives, such as reducing cycle times for key functions, including lease processing and tower structural analysis. We are also focused on developing and implementing sustainable power solutions across our footprint to reduce our reliance on fossil fuels and help improve the overall efficiency of the communications infrastructure and wireless industries through our sustainability and power as a service (PaaS) initiatives. \n•\nMaintain a strong balance sheet.\n We remain committed to disciplined financial policies, which we believe result in our ability to maintain a strong balance sheet and will support our overall strategy and focus on asset growth and operational excellence. As a result of these policies, we currently have investment grade credit ratings. We continue to focus on maintaining a robust liquidity position and, as of December 31, 2024, had $12.0 billion of available liquidity. We believe that our investment grade credit ratings provide us consistent access to the capital markets and our liquidity provides us the ability to continue to invest in growing and augmenting our business.\nCapital Allocation Strategy\nThe objective of our capital allocation strategy is to simultaneously increase adjusted funds from operations per share and our return on invested capital over the long term. To maintain our qualification for taxation as a REIT, we are required annually to distribute an amount equal to at least 90% of our REIT taxable income (determined before the deduction for distributed earnings and excluding any net capital gain) to our stockholders. After complying with our REIT distribution requirements, we plan to continue to allocate our available capital among investment alternatives that meet or exceed our return on investment criteria, while taking into account the repayment of debt consistent with our financial policies. On an ongoing basis, we also perform a comprehensive assessment of our global operations to ensure our portfolio is positioned to drive sustained growth \n5\nTable of Contents\n \nand achieve our risk-adjusted return objectives. This assessment can influence our decisions on future capital allocation priorities between certain countries and assets, and may result in our decision to divest a portion, or all, of certain assets, including our Mexico fiber and Poland businesses in 2023, and our Australia, India and New Zealand businesses in 2024, and repurpose proceeds, and potential future capital, to other capital priorities.\n•\nCapital expenditure program.\n We expect to continue to invest in and expand our existing communications real estate portfolio through our capital expenditure program. This includes capital expenditures associated with site maintenance, increasing the capacity of our existing sites and projects such as new site and data center facility construction, land interest acquisitions and power solutions.\n•\nAcquisitions.\n We intend to continue to pursue acquisitions of communications sites and other telecommunications infrastructure in our existing or new markets where we can meet or exceed our risk-adjusted return on investment criteria. The risk-adjusted hurdle rates used to evaluate acquisition opportunities consider additional factors such as the country and counterparties involved, investment and economic climate, legal and regulatory conditions and industry risk, among others. \n•\nReturn excess capital to stockholders\n. If we have excess capital available after funding (i) our required distributions, (ii) capital expenditures, (iii) the repayment of debt consistent with our financial policies and (iv) anticipated future investments, including acquisition and select platform expansion opportunities, we will seek to return such excess capital to stockholders, including through our stock repurchase programs. \nInternational Strategy\nWe believe that, in certain international markets, we can create value by expanding our existing, communications real estate leasing business, and leveraging our shared global experience, capabilities and services, to deliver a best-in-class offering for our customers and attractive risk-adjusted return for our shareholders. We strive to maintain a diversified approach to our international strategy by operating in a geographically diverse array of markets in a variety of stages of wireless network development. Our international strategy includes a disciplined, individualized market evaluation, in which we conduct the following analyses, among others:\n•\nCountry analysis.\n Prior to entering a new market, and on an ongoing basis as we evaluate our portfolio, we conduct an extensive review of the country’s historical and projected macroeconomic fundamentals, including inflation and foreign currency exchange rate trends, demographics, capital markets, tax regime and investment alternatives, and the general business, political and legal environments, including property rights and regulatory regime.\n•\nWireless industry analysis.\n To confirm the presence of sufficient demand to support an independent tower leasing model, we analyze the competitiveness of the country’s wireless market. This includes an evaluation of the industry’s pricing environment, past and potential consolidation and the stage of its wireless network development. Characteristics that result in an attractive investment opportunity include (i) multiple competitive wireless service providers who are actively seeking to invest in deploying voice and data networks and (ii) ongoing or expected deployment of incremental spectrum from recent or anticipated auctions.\n•\nOpportunity and counterparty analysis.\n Once an investment opportunity is identified within a geographic area with an attractive wireless industry, we conduct a multifaceted opportunity and counterparty analysis. This includes evaluating (i) the type of transaction, (ii) its ability to meet our risk-adjusted return criteria given the country and the counterparties involved, including the anticipated anchor tenant and (iii) how the transaction fits within our long-term strategic objectives, including future potential investment and expansion within the region.\nRegulatory Matters \nTowers, Antennas and Fiber.\n Our U.S. and international tower leasing businesses are subject to national, state and local regulatory requirements with respect to the registration, siting, construction, lighting, marking and maintenance of our towers. In the United States, the construction of new towers or modifications to existing towers may require pre-approval by the Federal Communications Commission (“FCC”) and the Federal Aviation Administration (“FAA”), depending on factors such as tower height and proximity to public airfields. Towers requiring pre-approval must be registered with the FCC and maintained in accordance with FAA standards. Similar requirements regarding pre-approval of the construction and modification of towers are imposed by regulators in other countries. Non-compliance with applicable tower-related requirements may lead to monetary penalties or site deconstruction orders. \nCertain of our international operations are subject to regulatory requirements with respect to licensing, registration and permitting.\nIn Africa & APAC, our subsidiaries in Burkina Faso, Ghana, Kenya, Niger, Nigeria and Uganda are required to hold a license in order to establish and maintain passive telecommunications infrastructure services and DAS networks for communications \n6\nTable of Contents\n \nservice providers. Our subsidiaries in the Philippines and Bangladesh are required to hold a registration or license in order to establish, manage and operate passive telecommunications infrastructure services.\nIn Latin America, our subsidiary in Chile holds a concession of intermediate telecommunications services and our subsidiary in Argentina holds an information and communications technology service license. In Peru, our subsidiaries are registered as infrastructure providers and in Colombia, passive infrastructure activities do not need any authorization, but our fiber subsidiary is registered as a carrier service provider. The subsidiary that holds our fiber business in Brazil is also licensed and regulated as a concession holder and permit holder authorized to provide telecommunications services. In certain of the markets in which we operate, we are required to provide tower space to service providers on a non-discriminatory basis, subject to the negotiation of mutually agreeable terms. Additionally, one of our Brazilian subsidiaries, American Tower do Brasil – Cessao de Infraestruturas S.A. (“ATC Brazil”) issued non-convertible debentures in 2023 and in 2025, which are listed on the Brazilian stock exchange. Although the non-convertible debentures are held by another subsidiary of ours and are eliminated in consolidation, ATC Brazil is still subject to the listing requirements of such exchange.\nOur international business operations may be subject to increased licensing fees or ownership restrictions. For example, in South Africa, the Broad-Based Black Economic Empowerment Act, 2003 (the “BBBEE Act”) has established a legislative framework for the promotion of economic empowerment of South African citizens disadvantaged by Apartheid. Accordingly, the BBBEE Act and related codes measure BBBEE Act compliance and good corporate practice by the inclusion of certain ownership, management control, employment equity and other metrics for companies that do business there. In addition, certain municipalities have sought to impose permit fees based upon structural or operational requirements of towers and certain regional and other governmental bodies have sought to impose levies or other forms of fees. Our foreign operations may be affected if a country’s regulatory authority restricts, revokes or modifies spectrum licenses of certain wireless service providers or implements limitations on foreign ownership.\nIn all countries where we operate, we are subject to zoning restrictions and restrictive covenants imposed by local authorities or community organizations. While these regulations vary, they typically require tower owners or tenants to obtain approval from local authorities, environmental bodies or community standards organizations prior to tower construction or the addition of a new antenna to an existing tower. Local zoning authorities and community residents periodically oppose construction in their communities, which can delay or prevent new tower construction, new antenna installation or site upgrade projects, thereby limiting our ability to respond to tenant demand. This opposition and existing or new zoning, environmental or aviation regulations can increase costs associated with new tower construction, tower modifications or additions of new antennas to a site or site upgrades, as well as adversely affect the associated timing or cost of such projects. Further, additional regulations may be adopted that cause delays or result in additional costs to us or changes in the competitive landscape that may negatively affect our business. These factors could materially and adversely affect our operations. In the United States, the Telecommunications Act of 1996 prohibits any action by state and local authorities that would discriminate between different providers of wireless services or ban altogether the construction, modification or placement of communications sites. It also prohibits state or local restrictions based on the environmental effects of radio frequency emissions to the extent the facilities comply with FCC regulations. Further, in February 2012, the United States government adopted regulations requiring that local and state governments approve modifications or colocations that qualify as eligible facilities under the regulations. \nPortions of our business are subject to additional regulations, for example, in a number of states throughout the United States, certain of our subsidiaries hold Competitive Local Exchange Carrier (CLEC) or other status, in connection with the operation of our outdoor DAS networks business. In addition, we, or our customers, may be subject to new regulatory policies in certain jurisdictions from time to time that may materially and adversely affect our business or the demand for our communications sites. \nData Centers\n. Our U.S. data center facilities and related assets are subject to various federal, state and local regulations, such as state and local fire and life safety regulations and Americans with Disabilities Act (“ADA”) federal requirements. If one of our properties is not in compliance with these regulations, we may be required to make significant unanticipated expenditures in order to comply with such regulations and/or pay fines or civil damage awards. Existing regulations may subsequently change or future regulations may be enacted, either of which could have a similar impact as described above, and could materially and adversely affect our operations.\nEnvironmental Matters.\n Our U.S. and international operations are subject to various national, state and local environmental laws and regulations, including those relating to the management, use, storage, disposal, emission and remediation of, and exposure to, hazardous and non-hazardous substances, materials and wastes, the siting of our towers and the maintenance of our data center facilities. We may be required to obtain permits, pay additional property taxes, comply with regulatory requirements and make certain informational filings related to hazardous substances or devices used to provide power such as batteries, generators and fuel at our tower sites and/or data center facilities. When a site is decommissioned, we are required to follow applicable regulatory requirements, including by following decommissioning procedures and environmental management plans. \n7\nTable of Contents\n \nWith respect to our data center facilities, the presence of contamination, asbestos, lead or lead-based paint, mold or other air quality issues or the failure to remediate contamination, asbestos, lead or lead-based paint, mold or other air quality issues at our facilities may expose us to third-party liability or materially and adversely affect our ability to sell, lease or develop the real estate or to borrow using the real estate as collateral. Violations of these types of regulations could subject us to fines or criminal sanctions.\nAdditionally, in the United States and in other countries where we operate, before constructing a new tower or adding an antenna to an existing site, we must review and evaluate the impact of the action to determine whether it may significantly affect the environment and whether we must disclose any significant impacts in an environmental assessment. If a tower or new antenna might have a material adverse impact on the environment, FCC or other governmental approval of the tower or antenna could be significantly delayed or modifications to the site construction plans may be necessary.\nThe U.S. Environmental Protection Agency, or EPA, some of the states and localities in which we operate and the governments of other countries in which we operate have also enacted or proposed certain climate-related disclosures and may adopt new regulations related to the use of fossil fuels or requiring the use of alternative fuel or renewable energy sources to power energy resources that serve our data centers. Efforts to support and enhance renewable electricity generation may increase our costs of electricity above those that would be incurred through procurement of conventional electricity. Our data centers require and consume significant amounts of power, including electricity generated by the burning of fossil fuels. These laws, regulations and stakeholder requests could limit our ability to develop new facilities or result in substantial compliance, maintenance, repair, retrofit and construction costs, including capital expenditures for environmental control facilities and other new equipment. Changes in regulations that affect electric power providers, such as regulations related to the control of greenhouse gas emissions or other climate change-related matters, could adversely affect the costs of electric power and increase our operating costs, which could adversely affect our business, financial condition and results of operations or those of our customers. See “Risk Factors” in Item 1A of this Annual Report for more information on our data center-related risks.\nHealth and Safety.\n In the United States and in other countries where we operate, we are subject to various national, state and local laws regarding employee health and safety, including protection from radio frequency exposure and air quality issues.\nCompetition\nOur industry is highly competitive. We compete, both for new business and for the acquisition of assets, with other public tower companies, such as Crown Castle International Corp., SBA Communications Corporation, Telesites S.A.B. de C.V. and Cellnex Telecom, S.A., wireless carrier tower consortia and private tower companies, private equity sponsored firms, carrier-affiliated tower companies, independent wireless carriers, tower owners, broadcasters and owners of non-communications sites, including rooftops, utility towers, water towers and other alternative structures. Our data center business also competes with a variety of companies offering similar data center solutions and services, including space, power, interconnection and development services. We believe that location and capacity, grid distribution constraints, network and/or interconnection density, price, quality and speed of service have been, and will continue to be, significant competitive factors affecting owners, operators and managers of communications sites and data center facilities.\nOur services business competes with a variety of companies offering individual, or combinations of, competing services. The field of competitors includes site application consultants, zoning consultants, real estate firms, right-of-way consultants, structural engineering firms, construction management firms, tower owners/managers, telecommunications equipment vendors who can provide turnkey site development services through multiple subcontractors and our tenants’ personnel. We believe that our tenants base their decisions for services on various criteria, including a company’s experience, local reputation, price and time for completion of a project.\nFor more information on demand trends in our industry, see Item 7 of this Annual Report under the caption “Management’s Discussion and Analysis of Financial Condition and Results of Operations—Executive Overview.”\nHuman Capital Resources \nAs of December 31, 2024, we employed 4,691 full-time individuals, including 2,589 employees based in the United States and 2,102 employees based internationally. Our teams in our more than 20 countries around the world are our most important assets and fundamental to our success. Aligned with our business strategy, our human capital management strategy focuses on developing and delivering solutions to attract, develop, engage and retain top talent in each of the countries where we operate. Our Chief Human Resources Officer regularly reports to the Compensation Committee of our Board of Directors (our “Board”) on our initiatives related to human capital management. \n8\nTable of Contents\n \nInclusion and Belonging\n. A critical factor in our success is ensuring that an inclusive and collaborative workplace remains at the core of our business culture, infusing fresh ideas, helping us remain connected to our customers in a dynamic global market and ensuring mutual respect guides us in our interactions both internally and externally. \nAdditionally, we have implemented several initiatives designed to support our inclusion efforts, including pledges from the American Tower Foundation. Furthermore, we have worked to provide access and opportunity for underrepresented groups in the REIT industry. We also enable global employee resource groups to promote better employee engagement. Our employee resource groups are open to all employees with the goal of enhancing professional development, connection and collaboration for everyone.\nTalent Development and Recruitment. \nAs a critical investment in our capacity to provide our customers with outstanding support and customer service, we offer a variety of development opportunities unique to each market to cultivate our talent throughout our global organization. For individual contributors, we provide resources in up to five languages that focus on job-specific training and general topics, such as productivity, collaboration and project management. We create and customize courses to meet regional needs and update these courses regularly to address changing marketplace dynamics and employee interests.\nDeveloping our managers is critical to our success, and several resources and tools are provided to all levels of management. For example, our Management Essentials program provides continuous learning opportunities through training led by American Tower leaders globally. Managers learn tools and best practices that enable both management and team success, and that build and strengthen competencies to better respond to the needs of a growing and increasingly complex organization. Furthermore, our Gateway to Leadership program builds further on the skills and competencies we deliver through Management Essentials by providing additional leadership training for managers in Europe, Africa and Latin America. Our annual Accelerated Leadership Development program, in collaboration with the INSEAD executive education program, provides our next generation leaders in Latin America, Europe, the U.S. and Africa, with a seven-week intensive workshop to enhance management and leadership skills. For our employees with high potential, we offer several professional development opportunities designed to support these employees through a career path journey to become inclusive leaders. These are all supported by a comprehensive talent-management review process to develop future leaders and ensure effective succession planning. Additionally, our virtual corporate university, ATC YOU, provides our employees with a range of global learning resources for professional development and career growth.\nOur recruiting efforts consistently include strategies to build qualified candidate pipelines with varied skills and backgrounds and promote a culture that supports a diverse team of global employees. We have developed education initiatives and increased access to professional development opportunities for employees, including an enhanced focus on mentoring opportunities.\nOur Compensation Committee also approved a shared human capital management goal for the entire executive team for 2024, which focuses on developing talent.\nWorkplace Safety\n. We are committed to the safety of our employees and surrounding communities. Depending on the role, team members are required to pass and complete regular safety training courses and follow specific tower and site safety protocols with the support of operational manuals. A key component of our culture is a strong commitment to incident reporting and corrective actions, as well as a comprehensive program for ensuring vendor compliance with safety standards and certifications. Our strict adherence to the rigorous standards set forth by the relevant government agencies and other authorities, such as the Telecommunications Infrastructure Registered Apprenticeship Program and Telecommunications Industry Association, is critical to ensuring our towers are structurally safe for field personnel, vendors, customers and communities. We have several employee security protocols and standards in place to better protect our people and assets worldwide. These include global standards for the security of international travelers and personnel ground movements. We also operate a traveler assistance program that allows us to better monitor international travel and provide employees with relevant trip advice and 24/7 assistance services. A related journey risk management program provides support for trips in complex threat environments, and includes hostile environment awareness training, real-time tracking of personnel and 24/7 support.\nHealth and Wellness. \nWe offer medical and parental leave benefits to full-time employees across all markets, with some local variation. We conduct wellness check-ins and offer resources to support our employees’ mental health and well-being, including access to a free Employee Assistance Program, which offers confidential assistance on a wide range of issues. We also offer market competitive benefits in all locations and, in 2024, continued our behavioral health benefit in the United States to support employees’ mental well-being.\n9\nTable of Contents\n \nExecutive Officers\nFor information about our Executive Officers, see Item 10 of this Annual Report under the caption “Directors, Executive Officers and Corporate Governance.” \nAvailable Information\nOur internet website address is \nwww.americantower.com\n. Information contained on our website is not incorporated by reference into this Annual Report, and you should not consider information contained on our website as part of this Annual Report. You may access, free of charge, our Annual Reports on Form 10-K, Quarterly Reports on Form 10-Q and Current Reports on Form 8-K, plus amendments to such reports as filed or furnished pursuant to Sections 13(a) or 15(d) of the Securities Exchange Act of 1934, as amended (“Exchange Act”), through the “Investor Relations” portion of our website as soon as reasonably practicable after we electronically file such material with, or furnish it to, the Securities and Exchange Commission (the “SEC”).\nWe have adopted a written Code of Ethics and Business Conduct Policy (the “Code of Conduct”) that applies to all of our employees and directors, including, but not limited to, our principal executive officer, principal financial officer and principal accounting officer or controller or persons performing similar functions. The Code of Conduct, our Corporate Governance Guidelines and the charters of the audit, compensation and nominating and corporate governance committees of our Board are available on the “Investor Relations” portion of our website, under the “Corporate Governance” tab. In the event we amend the Code of Conduct, or provide any waivers of the Code of Conduct to our directors or executive officers, we will disclose these events on our website as required by the regulations of the New York Stock Exchange (the “NYSE”) and applicable law.\nIn addition, paper copies of these documents may be obtained free of charge by writing us at the following address: 116 Huntington Avenue, Boston, Massachusetts 02116, Attention: Investor Relations; or by calling us at (617) 375-7500.",
  "item7": "ITEM 7.\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe discussion and analysis of our financial condition and results of operations that follow are based upon our consolidated financial statements, which have been prepared in accordance with GAAP. The preparation of our financial statements requires us to make estimates and assumptions that affect the reported amounts of assets and liabilities, revenues and expenses, and the related disclosure of contingent assets and liabilities at the date of our financial statements. Actual results may differ from these estimates and such differences could be material to the financial statements. This discussion should be read in conjunction with our consolidated financial statements included in this Annual Report and the accompanying notes, and the information set forth under the caption “Critical Accounting Policies and Estimates” below.\nDuring the year ended December 31, 2024, we completed the sale of ATC TIPL. The divestiture qualified for presentation as discontinued operations. See Note 22 for further discussion. Prior to the divestiture and classification as discontinued operations, ATC TIPL’s operating results were included within the Asia-Pacific property segment. Historical financial information included in Management’s Discussion and Analysis of Financial Condition and Results of Operations has been adjusted to reflect the operating results of ATC TIPL as discontinued operations for all periods presented.\nDuring the year ended December 31, 2024, we also completed the sales of ATC Australia and ATC New Zealand. The divestitures did not qualify for presentation as discontinued operations.\nDuring the fourth quarter of 2024, following recent divestitures, including the ATC TIPL Transaction, and changes to our organizational structure, we reviewed and changed our reportable segments. Our APAC property segment and our Africa property segment were combined into the Africa & APAC property segment. As a result, we now report our results in six segments: U.S. & Canada property (which includes all assets in the United States and Canada, other than our data center facilities and related assets), Africa & APAC property, Europe property, Latin America property, Data Centers and Services. In evaluating financial performance in each business segment, management uses, among other factors, segment gross margin and segment operating profit (see note 20 to our consolidated financial statements included in this Annual Report). Historical financial information included in Management’s Discussion and Analysis of Financial Condition and Results of Operations has been adjusted to reflect the change in reportable segments.\nExecutive Overview\nWe are one of the largest global REITs and a leading independent owner, operator and developer of multitenant communications real estate. Our primary business is the leasing of space on communications sites to wireless service providers, radio and television broadcast companies, wireless data providers, government agencies and municipalities and tenants in a number of other industries. In addition to the communications sites in our portfolio, we manage rooftop and tower sites for property owners under various contractual arrangements. We also hold other telecommunications infrastructure and property interests that we lease primarily to communications service providers and third-party tower operators, and, as discussed further below, we hold a portfolio of highly interconnected data center facilities and related assets in the United States. Our customers include our tenants, licensees and other payers. We refer to the business encompassing the above as our property operations, which accounted for 98% of our total revenues for the year ended December 31, 2024 and includes our U.S. & Canada property, Africa & APAC property, Europe property and Latin America property segments and Data Centers segment. \nWe also offer tower-related services in the United States, including site application, zoning and permitting, structural and mount analyses, and construction management, which primarily support our site leasing business, including the addition of new tenants and equipment on our sites. \n27\nTable of Contents\n \nThe following table details the number of communications sites, excluding managed sites, that we owned or operated as of December 31, 2024:  \n \nNumber of\nOwned Towers\nNumber of\nOperated \nTowers (1)\nNumber of\nOwned DAS Sites\nU.S. & Canada:\nCanada\n226 \n— \n— \nUnited States\n26,583 \n14,979 \n434 \nU.S. & Canada total\n26,809 \n14,979 \n434 \nAfrica & APAC:\nBangladesh\n900 \n— \n— \nBurkina Faso\n733 \n— \n— \nGhana\n3,477 \n— \n37 \nKenya\n4,272 \n— \n11 \nNiger\n916 \n— \n— \nNigeria\n9,079 \n— \n— \nPhilippines\n373 \n— \n— \nSouth Africa\n2,517 \n— \n— \nUganda\n4,302 \n— \n25 \nAfrica & APAC total\n26,569 \n— \n73 \nEurope:\nFrance\n4,189 \n303 \n9 \nGermany\n15,204 \n— \n— \nSpain\n12,080 \n— \n1 \nEurope total\n31,473 \n303 \n10 \nLatin America:\nArgentina\n498 \n— \n11 \nBrazil\n21,171 \n1,440 \n124 \nChile\n3,712 \n— \n110 \nColombia\n4,945 \n— \n6 \nCosta Rica\n712 \n— \n2 \nMexico\n9,423 \n186 \n89 \nParaguay\n1,451 \n— \n— \nPeru\n3,976 \n450 \n1 \nLatin America total\n45,888 \n2,076 \n343 \n_______________\n(1)\nApproximately 98% of the operated towers are held pursuant to long-term finance leases, including those subject to purchase options.  \nAs of December 31, 2024, our property portfolio included 29 operating data center facilities across ten markets in the United States that collectively comprise approximately 3.3 million NRSF of data center space, as detailed below:  \nNumber of\nData Centers\nTotal NRSF (1)\n(in thousands)\nSan Francisco Bay, CA\n9 \n998 \nLos Angeles, CA\n3 \n724 \nNorthern Virginia, VA\n5 \n651 \nNew York, NY\n2 \n285 \nChicago, IL\n2 \n216 \nBoston, MA\n1 \n143 \nOrlando, FL\n1 \n104 \nAtlanta, GA\n2 \n95 \nMiami, FL\n2 \n89 \nDenver, CO\n2 \n38 \nTotal\n29 \n3,343 \n_______________\n(1)\nExcludes approximately 0.4 million of office and light-industrial NRSF.\nIn most of our markets, our tenant leases for our communications sites with wireless carriers generally have initial non-cancellable terms of five to ten years with multiple renewal terms. Accordingly, the vast majority of the revenue generated by our property operations during the year ended December 31, 2024 was recurring revenue that we should continue to receive in \n28\nTable of Contents\n \nfuture periods. Most of our tenant leases for our communications sites have provisions that periodically increase or “escalate” the rent due under the lease, typically based on (a) an annual fixed escalation (averaging approximately 3% in the United States), (b) an inflationary index in most of our international markets, or (c) a combination of both. In addition, certain of our tenant leases provide for additional revenue primarily to cover costs, such as ground rent or power and fuel costs. \nBased upon existing customer leases and foreign currency exchange rates as of December 31, 2024, we expect to generate nearly $54 billion of non-cancellable customer lease revenue over future periods, before the impact of straight-line lease accounting. \nIn 2023, we initiated a strategic review of our India business, as further discussed below under “Results of Operations—Loss from Discontinued Operations, Net of Taxes.” The strategic review concluded in January 2024 with the signed agreement for the ATC TIPL Transaction. The ATC TIPL Transaction received all government and regulatory approvals during the three months ended September 30, 2024. On September 12, 2024, we completed the ATC TIPL Transaction and received total consideration of 182 billion INR (approximately $2.2 billion). ATC TIPL’s operating results are presented as discontinued operations. See discussion below and Note 22 for further discussion.\nThe revenues generated by our property operations may be affected by cancellations of existing tenant leases. As discussed above, most of our tenant leases with wireless carriers and broadcasters are multiyear contracts, which typically are non-cancellable; however, in some instances, a lease may be cancelled upon the payment of a termination fee.\nRevenue lost from either tenant lease cancellations or the non-renewal of leases or rent renegotiations, which we refer to as churn, has historically not had a material adverse effect on the revenues generated by our consolidated property operations. During the year ended December 31, 2024, churn was approximately 2% of our tenant billings, primarily driven by churn in our U.S. & Canada property segment, as discussed below. \nWe expect that our churn rate in our U.S. & Canada property segment will remain elevated through 2025 due to contractual lease cancellations and non-renewals by T-Mobile, including legacy Sprint Corporation leases, pursuant to the terms of the T-Mobile MLA entered into in September 2020.\nProperty Operations Revenue Growth\n. Due to our diversified communications site portfolio, our tenant lease rates vary considerably depending upon numerous factors, including, but not limited to, amount, type and position of tenant equipment on the tower, remaining tower capacity and tower location. We measure the remaining tower capacity by assessing several factors, including tower height, tower type, environmental conditions, existing equipment on the tower and zoning and permitting regulations in effect in the jurisdiction where the tower is located. In many instances, tower capacity can be increased with relatively modest tower augmentation capital expenditures, which are often reimbursed to us.\nThe primary factors affecting the revenue growth of our property segments are:\n•\nGrowth in tenant billings, including:\n•\nNew revenue attributable to leasing additional space on our sites (“colocations”) and lease amendments; \n•\nContractual rent escalations on existing tenant leases, net of churn; and\n•\nNew revenue attributable to leases in place on day one on sites acquired or constructed since the beginning of the prior-year period.\n•\nRevenue growth from our Data Centers segment in the United States, including rental and power revenue from new lease commencements and expansions, contractual rent and power escalations on existing leases, mark-to-market increases on renewing leases and increased interconnection services and solutions.  \n•\nRevenue growth from other items, including additional tenant payments primarily to cover costs, such as ground rent or power and fuel costs included in certain tenant leases (“pass-through”), straight-line revenue and decommissioning, partially offset, in certain cases, by revenue reserve provisions.\nWe continue to believe that our site leasing revenue, which makes up the vast majority of our property segment revenue, is likely to increase due to the growing use of wireless services globally and our ability to meet the corresponding incremental demand for our communications real estate. By adding new tenants and new equipment for existing tenants on our sites, we are able to increase these sites’ utilization and profitability. We believe the majority of our site leasing activity will continue to come from wireless service providers, with tenants in a number of other industries contributing incremental leasing demand. Our site portfolio and our established tenant base provide us with new business opportunities, which have historically resulted in consistent and predictable organic revenue growth as wireless carriers seek to increase the coverage and capacity of their existing networks, while also deploying next generation wireless technologies. In addition, we intend to continue to supplement our organic growth by selectively developing or acquiring new sites in our existing and new markets where we can achieve our risk-adjusted return on investment objectives. \n29\nTable of Contents\n \nProperty Operations Organic Revenue Growth\n. Consistent with our strategy to increase the utilization and return on investment from our sites, our objective is to add new tenants and new equipment for existing tenants through colocation and lease amendments. Our ability to lease additional space on our sites is primarily a function of the rate at which wireless carriers and other tenants deploy capital to improve and expand their wireless networks. This rate, in turn, is influenced by the growth of wireless services, the penetration of advanced wireless devices, the level of emphasis on network quality and capacity in carrier competition, the financial performance of our tenants and their access to capital and general economic conditions. According to industry data, recent aggregate annual wireless capital spending in the United States has averaged at least $30 billion, resulting in consistent demand for our sites. \nBased on industry research and projections, we expect that a number of key industry trends will result in incremental revenue opportunities for us:\n•\nIn less advanced wireless markets where network deployments are in earlier stages, we expect these deployments to drive demand for our tower space as carriers seek to expand their footprints and increase the scope and density of their networks. We have established operations in many of these markets at the early stages of wireless development, which we believe will enable us to meaningfully participate in these deployments over the long term.\n•\nSubscribers’ use of mobile data continues to grow rapidly given increasing smartphone and other advanced device penetration, the proliferation of bandwidth-intensive applications on these devices and the continuing evolution of the mobile ecosystem. We believe carriers will be compelled to deploy additional equipment on existing networks while also rolling out more advanced wireless networks to address coverage and capacity needs resulting from this increasing mobile data usage.\n•\nThe deployment of advanced mobile technology, such as 4G and 5G, will provide higher speed data services and further enable fixed broadband substitution. As a result, we expect that our tenants will continue deploying additional equipment across their existing networks.\n•\nWireless service providers compete based on the quality of their networks, which is driven by capacity and coverage. To maintain or improve their network performance as overall network usage increases, our tenants continue to deploy additional equipment across their existing sites while also adding new cell sites. We anticipate increasing network densification over the next several years, as existing network density is anticipated to be insufficient to account for rapidly increasing levels of wireless data usage. \n•\nWireless service providers continue to acquire additional spectrum, and as a result are expected to add additional sites and equipment to their networks as they seek to optimize their network configuration and utilize additional spectrum. We expect this to be particularly relevant in the context of higher-band spectrum such as 2.5 gigahertz (GHz) and C-Band being deployed for 5G, as these spectrum assets tend to have more limited propagation characteristics compared to the lower-band spectrum that has historically been deployed on our towers.\n•\nNext generation technologies requiring wireless connectivity have the potential to provide incremental revenue opportunities for us. These technologies may include edge computing functionality, autonomous vehicle networks and a number of other internet-of-things, or IoT, applications, as well as other potential use cases for wireless services. These technologies may create new and complementary use cases for our communications real estate over time, although these use cases are currently in nascent stages.\n•\nContinued data growth, including through increased use of artificial intelligence, and emerging high-performance, latency-sensitive applications will drive an increased need for reliable, secure and interconnected data center solutions. We believe these trends will result in incremental utilization and interconnection demand at our data center facilities. \nAs part of our international expansion initiatives, we have targeted markets in various stages of network development to diversify our international exposure and position us to benefit from a number of different wireless technology deployments over the long term, while benefitting from our shared global experience, capabilities and services. In addition, we have focused on building relationships with large multinational carriers to increase the opportunities for growth or mutually beneficial transactional opportunities across common markets. We believe that consistent carrier network investments across our international markets will, over the long term, position us to generate meaningful organic revenue growth going forward.\nIn emerging markets, such as Bangladesh, Burkina Faso, Ghana, Kenya, Niger, Nigeria, the Philippines and Uganda, wireless networks tend to be significantly less advanced than those in the United States, and initial voice networks continue to be deployed in certain underdeveloped areas. A majority of consumers in these markets still utilize basic wireless services and advanced device penetration remains low. In more developed urban locations within these markets, mobile data usage tends to be higher and advanced network deployments are further along. Carriers are focused on completing voice network build-outs while increasing investments in data networks as mobile data usage and smartphone penetration within their customer bases begin to accelerate. \nIn markets with rapidly evolving network technology, such as South Africa and most of the countries in Latin America where we do business, initial voice networks, for the most part, have already been built out, and carriers are increasingly focused on \n30\nTable of Contents\n \nthe early stages of 5G network deployments. Consumers in these regions are increasingly adopting smartphones and other advanced devices, in particular as lower cost smartphones become increasingly available. As a result, the usage of bandwidth-intensive mobile applications is growing materially. Recent spectrum auctions in these rapidly evolving markets have allowed incumbent carriers to accelerate their data network deployments and have also enabled new entrants to begin initial investments in data networks. Smartphone penetration and wireless data usage in these markets are advancing rapidly, which typically requires that carriers continue to invest in their networks to maintain and augment their quality of service.\nFinally, in markets with more mature network technology, such as Canada, Germany, France and Spain, carriers are focused on deploying 5G data networks to account for rapidly increasing wireless data usage among their customer base.\nWe believe that the network technology migration we have seen in the United States, which has led to significantly denser networks and meaningful new business commencements for us over a number of years, will be replicated in our international markets over time. As a result, we expect to be able to leverage our extensive international portfolio of approximately 107,000 communications sites and the relationships we have built with our carrier tenants to drive sustainable, long\n-\nterm growth.\nWe have master lease agreements with many of our tenants for our communications sites that provide for consistent, long-term revenue and reduce the likelihood of non-contractual churn. Certain of those master lease agreements are comprehensive in nature and further build and augment strong strategic partnerships with our tenants while significantly reducing colocation cycle times, thereby providing our tenants with the ability to rapidly and efficiently deploy equipment on our sites.\nDemand for our communications infrastructure assets could be negatively impacted by a number of factors, including an increase in network sharing or consolidation among our customers and financial difficulties for our customers, as set forth in Item 1A of this Annual Report under the captions “Risk Factors—If our customers consolidate their operations, exit their businesses or share site infrastructure to a significant degree, our growth, revenue and ability to generate positive cash flows could be materially and adversely affected” and “Risk Factors—A substantial portion of our current and projected future revenue is derived from a small number of customers, and we are sensitive to adverse changes in the creditworthiness and financial strength of our customers.” In addition, the emergence and growth of new technologies could reduce demand for our sites, as set forth under the caption “Risk Factors—New technologies or changes, or lack thereof, in our or a customer’s business model could make our communications infrastructure leasing business less desirable and result in decreasing revenues and operating results.” Further, our customers may be subject to new regulatory policies from time to time that materially and adversely affect the demand for our communications infrastructure assets.\nProperty Operations New Site Revenue Growth. \nDuring the year ended December 31, 2024, we grew our portfolio of communications real estate through the acquisition and construction of approximately 2,450 communications sites globally. In a majority of our Africa & APAC, Europe and Latin America markets, the revenue generated from newly acquired or constructed sites resulted in increases in both tenant and pass-through revenues (such as ground rent or power and fuel costs) and expenses. We continue to evaluate opportunities to acquire communications real estate portfolios, both domestically and internationally, to determine whether they meet our risk-adjusted hurdle rates and whether we believe we can effectively integrate them into our existing portfolio.\nNew Sites (Acquired or Constructed)\n2024\n2023\n2022\nU.S. & Canada\n15 \n20 \n55 \nAfrica & APAC (1)\n1,660 \n1,700 \n2,285 \nEurope\n590 \n555 \n690 \nLatin America\n185 \n215 \n340 \n_______________\n(1)\nFor the years ended December 31, 2024, 2023 and 2022, excludes approximately 90, 865, and 4,035 new sites in India, respectively.  \nProperty Operations Expenses.\n Direct operating expenses incurred by our property segments include direct site or facility level expenses and consist primarily of ground rent and power and fuel costs, some or all of which may be passed through to our customers, as well as property taxes and repairs and maintenance expenses. These segment direct operating expenses exclude all segment and corporate selling, general, administrative and development expenses, which are aggregated into one line item entitled Selling, general, administrative and development expense in our consolidated statements of operations. In general, our property segments’ selling, general, administrative and development expenses do not significantly increase as a result of adding incremental customers to our sites or facilities and typically increase only modestly year-over-year. As a result, leasing additional space to new customers on our sites or within our facilities provides significant incremental gross margin and cash flow. We may, however, incur additional segment selling, general, administrative and development expenses as we increase our presence in our existing markets or expand into new markets. Our profit margin growth is therefore positively impacted by the addition of new customers to our sites or facilities but can be temporarily diluted by our development activities.\n31\nTable of Contents\n \nServices Segment Revenue Growth\n. As we continue to focus on growing our property operations, we anticipate that our services revenue will continue to represent a small percentage of our total revenues. \n32\nTable of Contents\n \nNon-GAAP Financial Measures\nIncluded in our analysis of our results of operations are discussions regarding earnings before interest, taxes, depreciation, amortization and accretion, as adjusted (“Adjusted EBITDA”), Funds From Operations, as defined by the National Association of Real Estate Investment Trusts (“Nareit FFO”) attributable to American Tower Corporation common stockholders, Adjusted Funds From Operations (“AFFO”) attributable to American Tower Corporation common stockholders (“AFFO attributable to American Tower Corporation common stockholders”) and Segment gross margin.\nWe define Adjusted EBITDA as Net income before Income (loss) from equity method investments; Income (loss) from discontinued operations, net of taxes; Income tax benefit (provision); Other income (expense); Gain (loss) on retirement of long-term obligations; Interest expense; Interest income; Other operating income (expense), including Goodwill impairment; Depreciation, amortization and accretion; and stock-based compensation expense. \nNareit FFO attributable to American Tower Corporation common stockholders is defined as net income before gains or losses from the sale or disposal of real estate, real estate related impairment charges, real estate related depreciation, amortization and accretion including adjustments and distributions for unconsolidated affiliates and noncontrolling interests and discontinued operations. In this section, we refer to Nareit FFO attributable to American Tower Corporation common stockholders as “Nareit FFO (common stockholders).” \nWe define AFFO attributable to American Tower Corporation common stockholders as Nareit FFO (common stockholders) before (i) straight-line revenue and expense; (ii) stock-based compensation expense; (iii) the deferred portion of income tax and other income tax adjustments; (iv) non-real estate related depreciation, amortization and accretion; (v) amortization of deferred financing costs, debt discounts and premiums and long-term deferred interest charges; (vi) other income (expense); (vii) gain (loss) on retirement of long-term obligations; and (viii) other operating income (expense); less cash payments related to capital improvements and cash payments related to corporate capital expenditures and including adjustments and distributions for unconsolidated affiliates and noncontrolling interests and adjustments for discontinued operations, which includes the impact of noncontrolling interests and discontinued operations on both Nareit FFO and the corresponding adjustments included in AFFO. In this section, we refer to AFFO attributable to American Tower Corporation common stockholders as “AFFO (common stockholders).”\nWe define Segment gross margin as segment revenue less segment operating expenses, excluding depreciation, amortization and accretion; selling, general, administrative and development expense; and other operating expenses.\nAdjusted EBITDA, Nareit FFO (common stockholders), AFFO (common stockholders) and Segment gross margin are not intended to replace net income or any other performance measures determined in accordance with GAAP. None of Adjusted EBITDA, Nareit FFO (common stockholders), AFFO (common stockholders) or Segment gross margin represents cash flows from operating activities in accordance with GAAP and, therefore, these measures should not be considered indicative of cash flows from operating activities, as a measure of liquidity or a measure of funds available to fund our cash needs, including our ability to make cash distributions. Rather, Adjusted EBITDA, Nareit FFO (common stockholders), AFFO (common stockholders) and Segment gross margin are presented as we believe each is a useful indicator of our current operating performance. We believe that these metrics are useful to an investor in evaluating our operating performance because (1) each is a key measure used by our management team for decision making purposes and for evaluating our operating segments’ performance; (2) Adjusted EBITDA is a component underlying our credit ratings; (3) Adjusted EBITDA is widely used in the telecommunications real estate sector to measure operating performance as depreciation, amortization and accretion may vary significantly among companies depending upon accounting methods and useful lives, particularly where acquisitions and non-operating factors are involved; (4) AFFO (common stockholders) is widely used in the telecommunications real estate sector to adjust Nareit FFO (common stockholders) for items that may otherwise cause material fluctuations in Nareit FFO (common stockholders) growth from period to period that would not be representative of the underlying performance of property assets in those periods; (5) Segment gross margin provides valuable insight into the site-level profitability of our assets (6) each provides investors with a meaningful measure for evaluating our period-to-period operating performance by eliminating items that are not operational in nature; and (7) each provides investors with a measure for comparing our results of operations to those of other companies, particularly those in our industry.\nOur measurement of Adjusted EBITDA, Nareit FFO (common stockholders), AFFO (common stockholders) and Segment gross margin may not, however, be fully comparable to similarly titled measures used by other companies. Reconciliations of Adjusted EBITDA, Nareit FFO (common stockholders) and AFFO (common stockholders) to net income and Segment gross margin to gross margin, the most directly comparable GAAP measures, have been included below.\n33\nTable of Contents\n \nResults of Operations\nYears Ended December 31, 2024,\n \n2023 and 2022 \n(in millions, except percentages) \nRevenue   \n \nYear Ended December 31,\nPercent Change 2024 vs 2023\nPercent Change 2023 vs 2022\n \n2024\n2023\n2022\nProperty\nU.S. & Canada\n$\n5,248.1 \n$\n5,216.2 \n$\n5,006.3 \n1 \n%\n4 \n%\nAfrica & APAC (1)\n1,208.0 \n1,244.4 \n1,203.8 \n(3)\n3 \nEurope\n834.7 \n775.6 \n735.7 \n8 \n5 \nLatin America\n1,717.9 \n1,798.3 \n1,691.9 \n(4)\n6 \nData Centers\n924.8 \n834.7 \n766.6 \n11 \n9 \nTotal property\n9,933.5 \n9,869.2 \n9,404.3 \n1 \n5 \nServices\n193.7 \n143.0 \n241.1 \n35 \n(41)\nTotal revenues\n$\n10,127.2 \n$\n10,012.2 \n$\n9,645.4 \n1 \n%\n4 \n%\n_______________\n(1)    Excludes the operating results of ATC TIPL, which are reported as discontinued operations. See Note 22 for further discussion.\nYear ended December 31, 2024 \nU.S. & Canada property segment revenue growth of $31.9 million was attributable to:   \n•   \nTenant billings growth of $216.2 million, which was driven by:\n◦\n$180.3 million due to colocations and amendments; and\n◦\n$49.1 million resulting from contractual escalations, net of churn;\n◦\nPartially offset by a decrease of $13.2 million from other tenant billings;\n•   \nPartially offset by a decrease of $184.1 million in other revenue, which includes a $162.7 million decrease due to straight-line accounting and a decrease due to equipment removal and other fees received in the prior year period.\nSegment revenue growth was partially offset by the negative impact of foreign currency translation related to fluctuations in Canadian Dollar (“CAD”).\nAfrica & APAC property segment revenue decrease of $36.4 million was attributable to:\n•   \nA decrease of $157.3 million attributable to the negative impact of foreign currency translation related which included, among others, negative impacts of $131.4 million related to fluctuations in Nigerian Naira (“NGN”), $29.3 million related to fluctuations in Ghanaian Cedi (“GHS”), $1.9 million related to fluctuations in Ugandan Shilling, partially offset by positive impacts of $5.0 million related to fluctuations in Kenyan Shilling (“KES”); and\n•   \nA decrease of $39.4 million in pass-through revenue, primarily due to a decrease in fuel costs;\n•   \nPartially offset by:\n•   \nTenant billings growth of $154.2 million, which was driven by:\n◦\n$51.7 million due to colocations and amendments; \n◦\n$49.3 million generated from sites acquired or constructed since the beginning of the prior-year period (“newly acquired or constructed sites”);\n◦\n$49.2 million resulting from contractual escalations, net of churn; and\n◦\n$4.0 million from other tenant billings; and\n•   \nAn increase of $6.1 million in other revenue.\nEurope property segment revenue growth of $59.1 million was attributable to:\n•   \nTenant billings growth of $38.5 million, which was driven by: \n◦\n$20.4 million due to colocations and amendments;\n◦\n$11.3 million resulting from contractual escalations, net of churn; and\n◦\n$8.0 million generated from newly acquired or constructed sites;\n◦\nPartially offset by a decrease of $1.2 million from other tenant billings;\n•   \nAn increase of $14.3 million in pass-through revenue; and\n•   \nAn increase of $5.5 million in other revenue.\nSegment revenue growth included an increase of $0.8 million, primarily attributable to the positive impact of foreign currency translation related to fluctuations in Euro (“EUR”).\n34\nTable of Contents\n \nLatin America property segment revenue decrease of $80.4 million was attributable to: \n•   \nA decrease of $79.9 million, attributable to the impact of foreign currency translation, which included, among others, negative impacts of $58.6 million related to fluctuations in Brazilian Real (“BRL”), $13.4 million related to fluctuations in Mexican Peso (“MXN”) and $13.1 million related to fluctuations in Chilean Peso (“CLP”), partially offset by positive impacts of $6.4 million related to fluctuations in Colombian Peso (“COP”); and\n•   \nA decrease of $43.9 million in other revenue, primarily attributable to an increase in revenue reserves related to a customer in Colombia, a decrease in tenant settlements in Mexico and the sale of one of our subsidiaries in Mexico that held fiber assets (“Mexico Fiber”) in the prior year period, partially offset by the recognition of previously deferred revenue in Brazil;\n•   \nPartially offset by:\n•   \nTenant billings growth of $28.9 million, which was driven by:\n◦\n$31.8 million due to colocations and amendments; and\n◦\n$1.9 million generated from newly acquired or constructed sites;\n◦\nPartially offset by decreases of:\n◦\n$3.2 million from other tenant billings; and\n◦\n$1.6 million from churn in excess of contractual escalations; and\n•   \nAn increase of $14.5 million in pass-through revenue. \nData Centers segment revenue growth of $90.1 million was attributable to: \n•\nAn increase of $56.9 million in rental, related and other revenue, primarily due to new lease commencements, customer expansions and rent increases upon customer renewals; \n•\nAn increase of $30.8 million in power revenue from new lease commencements, increased power consumption and pricing increases from existing customers; and\n•\nAn increase of $11.9 million in interconnection revenue, primarily due to customer interconnection net additions and set-up fees; \n•\nPartially offset by a decrease of $9.5 million in straight-line revenue.\nServices segment revenue growth of $50.7 million was primarily attributable to an increase in construction management and structural and mount analyses services.\nYear ended December 31, 2023 \nU.S. & Canada property segment revenue growth of $209.9 million was attributable to:   \n•   \nTenant billings growth of $232.5 million, which was driven by:\n◦\n$229.9 million due to colocations and amendments; and\n◦\n$12.5 million resulting from contractual escalations, net of churn;\n◦\nPartially offset by:\n◦\na decrease of $8.5 million from other tenant billings; and\n◦\na decrease of $1.4 million generated from newly acquired or constructed sites, which includes the impact of the disposition in the second quarter of 2022 of certain operations acquired in connection with our acquisition of InSite Wireless Group, LLC;\n•   \nPartially offset by a decrease of $22.0 million in other revenue, which includes a $66.9 million decrease due to straight-line accounting, partially offset by equipment removal and other fees.\nSegment revenue growth included a decrease of $0.6 million attributable to the negative impact of foreign currency translation related to fluctuations in CAD.\nAfrica & APAC property segment revenue growth of $40.6 million was attributable to:\n•   \nTenant billings growth of $147.9 million, which was driven by:\n◦\n$58.5 million due to colocations and amendments;\n◦\n$49.5 million generated from newly acquired or constructed sites;\n◦\n$35.4 million resulting from contractual escalations, net of churn; and\n◦\n$4.5 million from other tenant billings;\n•   \nAn increase of $126.9 million in pass-through revenue, primarily due to an increase in energy costs; and\n•   \nAn increase of $2.7 million in other revenue, primarily due to an increase from straight-line accounting, partially offset by an increase in revenue reserves.\nSegment revenue growth was partially offset by a decrease of $236.9 million attributable to the negative impact of foreign currency translation related which included, among others, negative impacts of $148.2 million related to fluctuations in NGN, $45.4 million related to fluctuations in GHS, $22.3 million related to fluctuations in KES and $20.4 million related to fluctuations in South African Rand.\n35\nTable of Contents\n \nEurope property segment revenue growth of $39.9 million was attributable to:\n•   \nTenant billings growth of $47.2 million, which was driven by: \n◦\n$25.8 million resulting from contractual escalations, net of churn;\n◦\n$13.6 million due to colocations and amendments; and\n◦\n$8.5 million generated from newly acquired or constructed sites;\n◦\nPartially offset by a decrease of $0.7 million from other tenant billings; and\n•   \nAn increase of $9.9 million in other revenue, which includes an increase attributable to our Spain fiber business acquired in the second quarter of 2022;\n•   \nPartially offset by a decrease of $36.4 million in pass-through revenue, primarily due to a decrease in energy costs.\nSegment revenue growth included an increase of $19.2 million, primarily attributable to the positive impact of foreign currency translation related to fluctuations in EUR.\nLatin America property segment revenue growth of $106.4 million was attributable to: \n•   \nTenant billings growth of $58.0 million, which was driven by:\n◦\n$35.3 million due to colocations and amendments;\n◦\n$20.2 million resulting from contractual escalations, net of churn;\n◦\n$2.2 million generated from newly acquired or constructed sites; and\n◦\n$0.3 million from other tenant billings; and\n•   \nAn increase of $23.8 million in pass-through revenue, primarily attributable to increased pass-through ground rent costs in Brazil;\n•   \nPartially offset by a decrease of $74.0 million in other revenue, primarily attributable to the sale of Mexico Fiber and a decrease in tenant settlements in Mexico.\nSegment revenue growth included an increase of $98.6 million, attributable to the impact of foreign currency translation, which included, among others, positive impacts of $69.3 million related to fluctuations in MXN, $25.4 million related to fluctuations in BRL and $4.0 million related to fluctuations in CLP, partially offset by negative impacts of $1.9 million related to fluctuations in COP.\nData Centers segment revenue growth of $68.1 million was attributable to: \n•\nAn increase of $31.9 million in rental, related and other revenue, primarily due to new lease commencements, customer expansions and rent increases upon customer renewals; \n•\nAn increase of $27.7 million in power revenue from new lease commencements, increased power consumption and pricing increases from existing customers; and\n•\nAn increase of $9.6 million in interconnection revenue, primarily due to customer interconnection net additions and set-up fees; \n•\nPartially offset by a decrease of $1.1 million in straight-line revenue.\nServices segment revenue decrease of $98.1 million was primarily attributable to a decrease in site application, zoning and permitting, structural and mount analyses services and construction management services.\nGross Margin\n \nYear Ended December 31,\nPercent Change 2024 vs 2023\nPercent Change 2023 vs 2022\n \n2024\n2023\n2022\nProperty\nU.S. & Canada\n$\n4,377.2 \n$\n4,366.3 \n$\n4,160.9 \n0 \n%\n5 \n%\nAfrica & APAC (1)\n827.5 \n806.0 \n755.7 \n3 \n7 \nEurope\n525.3 \n476.1 \n416.1 \n10 \n14 \nLatin America\n1,187.7 \n1,232.3 \n1,165.2 \n(4)\n6 \nData Centers\n534.0 \n487.1 \n444.6 \n10 \n10 \nTotal property\n7,451.7 \n7,367.8 \n6,942.5 \n1 \n6 \nServices\n101.1 \n82.9 \n133.7 \n22 \n%\n(38)\n%\n_______________\n(1)    Excludes the operating results of ATC TIPL, which are reported as discontinued operations. See Note 22 for further discussion.\n36\nTable of Contents\n \nYear ended December 31, 2024 \n•\nThe increase in U.S. & Canada property segment gross margin was primarily attributable to the increase in revenue described above, partially offset by an increase in direct expenses of $21.0 million, primarily attributable to impacts of straight-line accounting.\n•\nThe increase in Africa & APAC property segment gross margin was primarily attributable to a decrease in direct expenses of $12.9 million, primarily due to a decrease in costs associated with pass-through revenue, including fuel costs, partially offset by an increase in repair and maintenance spending. The decrease in direct expenses was partially offset by the decrease in revenue described above. Direct expenses also benefited by $45.0 million from the impact of foreign currency translation.\n•\nThe increase in Europe property segment gross margin was primarily attributable to the increase in revenue described above, partially offset by an increase in direct expenses of $9.6 million, primarily due to an increase in costs associated with pass-through revenue, including energy costs, an increase in land rent costs and an increase in repair and maintenance spending. Direct expenses were also negatively impacted by $0.3 million from the impact of foreign currency translation.\n•\nThe decrease in Latin America property segment gross margin was primarily attributable to the decrease in revenue described above, partially offset by a decrease in direct expenses of $13.8 million, including a decrease due to the sale of Mexico Fiber in the prior year period, as well as land rent costs. Direct expenses also benefited by $22.0 million from the impact of foreign currency translation.\n•\nThe increase in Data Centers segment gross margin was primarily attributable to the increase in revenue described above, partially offset by an increase in direct expenses of $43.2 million, primarily due to an increase in costs associated with power revenue, including utility costs.\n•\nThe increase in Services segment gross margin was primarily attributable to the increase in revenue described above, partially offset by an increase in direct expenses of $32.5 million.\nYear ended December 31, 2023 \n•\nThe increase in U.S. & Canada property segment gross margin was primarily attributable to the increase in revenue described above, partially offset by an increase in direct expenses of $4.5 million.\n•\nThe increase in Africa & APAC property segment gross margin was primarily attributable to the increase in revenue described above, partially offset by an increase in direct expenses of $93.4 million, primarily due to an increase in costs associated with pass-through revenue, including energy costs. Direct expenses also benefited by $103.1 million from the impact of foreign currency translation.\n•\nThe increase in Europe property segment gross margin was primarily attributable to the increase in revenue described above, and a decrease in direct expenses of $27.6 million, primarily due to a decrease in costs associated with pass-through revenue, including energy costs. Direct expenses were also negatively impacted by $7.5 million from the impact of foreign currency translation.\n•\nThe increase in Latin America property segment gross margin was primarily attributable to the increase in revenue described above, partially offset by an increase in direct expenses of $15.0 million, primarily due to an increase in costs associated with pass-through revenue, including land rent costs. Direct expenses were also negatively impacted by $24.3 million from the impact of foreign currency translation.\n•\nThe increase in Data Centers segment gross margin was primarily attributable to the increase in revenue described above, partially offset by an increase in direct expenses of $25.6 million, primarily due to power costs.\n•\nThe decrease in Services segment gross margin was primarily due to the decrease in revenue described above, partially offset by a decrease in direct expenses of $47.3 million.\n37\nTable of Contents\n \nSelling, General, Administrative and Development Expense (“SG&A”)\n \nYear Ended December 31,\nPercent Change 2024 vs 2023\nPercent Change 2023 vs 2022\n \n2024\n2023\n2022\nProperty\nU.S. & Canada\n$\n161.1 \n$\n165.1 \n$\n183.2 \n(2)\n%\n(10)\n%\nAfrica & APAC (1)\n68.0 \n87.3 \n86.5 \n(22)\n1 \nEurope\n64.8 \n65.6 \n52.4 \n(1)\n25 \nLatin America\n111.0 \n107.9 \n107.6 \n3 \n0 \nData Centers\n78.8 \n72.4 \n63.9 \n9 \n13 \nTotal property\n483.7 \n498.3 \n493.6 \n(3)\n1 \nServices\n21.0 \n22.9 \n22.3 \n(8)\n3 \nOther \n428.7 \n424.8 \n386.2 \n1 \n10 \nTotal selling, general, administrative and development expense\n$\n933.4 \n$\n946.0 \n$\n902.1 \n(1)\n%\n5 \n%\n_______________\n(1)    Excludes the operating results of ATC TIPL, which are reported as discontinued operations. See Note 22 for further discussion.\nYear Ended December 31, 2024 \n•\nThe decrease in our U.S. & Canada property segment SG&A was primarily driven by decreased personnel and related costs and lower canceled construction costs.\n•\nThe decrease in our Africa & APAC property segment SG&A was primarily driven by a benefit from the impact of foreign currency translation of $11.5 million and lower canceled construction costs, partially offset by a net increase in bad debt expense. \n•\nThe decrease in our Europe property segment SG&A was primarily driven by decreased professional services costs and decreased personnel and related costs.\n•\nThe increase in our Latin America property segment SG&A was primarily driven by a net increase in bad debt expense of $14.1 million, partially offset by decreased professional services costs, decreased personnel and related costs and a benefit from the impact of foreign currency translation.\n•\nThe increase in our Data Centers segment SG&A was primarily driven by increased personnel and related costs to support our business.\n•\nThe decrease in our Services segment SG&A was primarily driven by decreased personnel and related costs.\n•\nThe increase in other SG&A was primarily attributable to an increase in stock-based compensation expense and an increase in personnel and related costs to support our business, partially offset by a decrease in other corporate SG&A.\nYear Ended December 31, 2023\n•\nThe decrease in our U.S. & Canada property segment SG&A was primarily driven by decreased personnel and related costs.\n•\nThe increase in our Africa & APAC property segment SG&A was primarily driven by increased personnel and related costs to support our business, increased costs associated with the cancellation of projects and an increase in bad debt expense, partially offset by a benefit from the impact of foreign currency translation.\n•\nThe increases in our Europe property and Data Centers segment SG&A were primarily driven by increased personnel and related costs to support our business.\n•\nThe increases in our Latin America property and Services segment SG&A were primarily driven by net increases in bad debt expense, partially offset by decreased personnel and related costs. The Latin America property segment SG&A increase also includes the negative impact of foreign currency translation.\n•\nThe increase in other SG&A was primarily attributable to an increase in stock-based compensation expense of $21.6 million, including an increase of $7.6 million related to the change in vesting terms as described in note 13 to our consolidated financial statements included in this Annual Report, and an increase in corporate SG&A, including an increase in personnel and related costs to support our business.\n38\nTable of Contents\n \nOperating Profit\n \nYear Ended December 31,\nPercent Change 2024 vs 2023\nPercent Change 2023 vs 2022\n \n2024\n2023\n2022\nProperty\nU.S. & Canada\n$\n4,216.1 \n$\n4,201.2 \n$\n3,977.7 \n0 \n%\n6 \n%\nAfrica & APAC (1)\n759.5 \n718.7 \n669.2 \n6 \n7 \nEurope\n460.5 \n410.5 \n363.7 \n12 \n13 \nLatin America\n1,076.7 \n1,124.4 \n1,057.6 \n(4)\n6 \nData Centers\n455.2 \n414.7 \n380.7 \n10 \n9 \nTotal property\n$\n6,968.0 \n$\n6,869.5 \n$\n6,448.9 \n1 \n%\n7 \n%\nServices\n$\n80.1 \n$\n60.0 \n$\n111.4 \n34 \n%\n(46)\n%\n_______________\n(1)    Excludes the operating results of ATC TIPL, which are reported as discontinued operations. See Note 22 for further discussion.\nYear Ended December 31, 2024 \n•\nThe increases in operating profit for our U.S. & Canada, Africa & APAC and Europe property segments and our Services segment were primarily attributable to increases in our segment gross margin and decreases in our segment SG&A.\n•\nThe decrease in operating profit for Latin America property segment was primarily attributable to a decrease in our segment gross margin and an increase in our segment SG&A.\n•\nThe increase in operating profit for our Data Centers segment was primarily attributable to an increase in our segment gross margin, partially offset by an increase in our segment SG&A.\nYear Ended December 31, 2023\n•\nThe increase in operating profit for our U.S. & Canada property segment was primarily attributable to an increase in our segment gross margin and a decrease in our segment SG&A.\n•\nThe increases in operating profit for our Africa & APAC, Europe and Latin America property segments and our Data Centers segment were primarily attributable to increases in our segment gross margin, partially offset by increases in our segment SG&A.\n•\nThe decrease in operating profit for our Services segment was primarily attributable to a decrease in our segment gross margin and an increase in our segment SG&A.\nDepreciation, Amortization and Accretion\n \nYear Ended December 31,\nPercent Change 2024 vs 2023\nPercent Change 2023 vs 2022\n \n2024\n2023\n2022\nDepreciation, amortization and accretion\n$\n2,028.8 \n$\n2,928.5 \n$\n3,164.9 \n(31)\n%\n(7)\n%\nThe decrease in depreciation, amortization and accretion expense for the year ended December 31, 2024 was primarily attributable to the change in estimated useful lives of our tower assets. \nDuring the first quarter of 2024, we finalized our reviews of the estimated useful lives of our tower assets and estimated settlement dates for our asset retirement obligations. Based on information obtained, we determined that our estimated asset lives and our estimated settlement dates should be extended, which resulted in an estimated $730 million decrease in depreciation and amortization expense and an estimated $75 million decrease in accretion expense for the year ended December 31, 2024. For more information on the change in the estimated useful lives of our tower assets and the change in the estimated settlement dates for our asset retirement obligations, see the information under the captions “Property and Equipment” and “Asset Retirement Obligations” included in note 1 to our consolidated financial statements included in this Annual Report (“Note 1”).\nThe decrease in depreciation, amortization and accretion expense for the year ended December 31, 2023 was primarily attributable to the decrease in property and equipment and intangible assets subject to amortization as a result of impairments taken and disposals since the beginning of the prior-year period and foreign currency exchange rate fluctuations.\n39\nTable of Contents\n \nOther Operating Expenses\n \nYear Ended December 31,\nPercent Change 2024 vs 2023\nPercent Change 2023 vs 2022\n \n2024\n2023\n2022\nOther operating expenses\n$\n74.1 \n$\n370.7 \n$\n270.6 \n(80)\n%\n37 \n%\nThe decrease in other operating expenses for the year ended December 31, 2024 was primarily attributable to a decrease in impairment charges, excluding goodwill impairments, of $131.4 million, a decrease in losses on sales or disposals of assets of $113.4 million, primarily attributable to the loss on the sale of Mexico Fiber of $80.0 million in the prior year period, and a decrease in integration and acquisition related costs, including benefits related to pre-acquisition contingencies and settlements.\nThe increase in other operating expenses for the year ended December 31, 2023 was primarily attributable to a loss on the sale of Mexico Fiber of $80.0 million, an increase in impairment charges, excluding goodwill impairments, of $52.7 million and an increase in severance and related costs of $21.8 million, partially offset by a decrease in integration and acquisition related costs, including pre-acquisition contingencies and settlements, of $67.2 million.\nGoodwill Impairment \nThere was no Goodwill impairment recorded during the year ended December 31, 2024. During the year ended December 31, 2023, Goodwill impairment consisted of $80.0 million of an impairment charge recorded for our Spain reporting unit. For more information on these impairments, see the information under the caption “Goodwill Impairments” included in note 5 to our consolidated financial statements included in this Annual Report.\nTotal Other Expense\n \nYear Ended December 31,\nPercent Change 2024 vs 2023\nPercent Change 2023 vs 2022\n \n2024\n2023\n2022\nTotal other expense\n$\n891.7 \n$\n1,596.2 \n$\n652.6 \n(44)\n%\n145 \n%\nTotal other expense consists primarily of interest expense and realized and unrealized foreign currency gains and losses. We record unrealized foreign currency gains or losses as a result of foreign currency exchange rate fluctuations primarily associated with our intercompany notes and similar unaffiliated balances denominated in a currency other than the subsidiaries’ functional currencies.\nThe decrease in total other expense during the year ended December 31, 2024 was primarily due to foreign currency gains of $308.3 million in the current period, as compared to foreign currency losses of $330.6 million in the prior-year period. Total other expense during the year ended December 31, 2024 also includes \n$70.4 million\n in unrealized gains from equity securities in the United States.\nThe increase in total other expense during the year ended December 31, 2023 was primarily due to foreign currency losses of $330.6 million in the current period, as compared to foreign currency gains of $451.4 million in the prior-year period, and an increase in net interest expense of $182.7 million, primarily due to increases in our weighted average interest rate.\nIncome Tax Provision\n \nYear Ended December 31,\nPercent Change 2024 vs 2023\nPercent Change 2023 vs 2022\n \n2024\n2023\n2022\nIncome tax provision\n$\n366.3 \n$\n90.8 \n$\n112.8 \n303 \n%\n(20)\n%\nEffective tax rate\n10.1 \n%\n5.9 \n%\n5.4 \n%\nAs a REIT, we may deduct earnings distributed to stockholders against the income generated by our REIT operations. Consequently, the effective tax rate on income from continuing operations for each of the years ended December 31, 2024 and 2023 differs from the federal statutory rate.\nThe increase in the income tax provision for the year ended December 31, 2024 was primarily attributable to increased earnings in certain foreign jurisdictions, partially due to the impacts of the change in estimated useful lives on depreciation and amortization expense as described in Note 1 and withholding taxes on equity distributions, including those related to the ATC TIPL Transaction, and management fees from certain foreign subsidiaries. Additionally, the income tax provision for the year ended December 31, 2024 included the reversal of valuation allowances of $20.5 million in foreign and domestic jurisdictions as compared to the reversal of valuation allowances of $87.2 million for the year ended December 31, 2023. The income tax provision for the year ended December 31, 2023 also included a benefit from the application of a tax law change in Kenya. For more information on the change in the estimated useful lives of our tower assets, see the information under the caption “Property and Equipment” included in Note 1.\n40\nTable of Contents\n \nThe decrease in the income tax provision for the year ended December 31, 2023 was primarily attributable to a benefit in 2023 from the application of a tax law change in Kenya. The income tax provision for the year ended December 31, 2023 included the reversal of valuation allowances of $87.2 million in certain foreign jurisdictions as compared to the reversal of valuation allowances of $76.5 million for the year ended December 31, 2022.\nLoss from Discontinued Operations, Net of Taxes\n \nThe ATC TIPL Transaction received all government and regulatory approvals during the three months ended September 30, 2024. The divestiture qualified for presentation as discontinued operations. Accordingly, the operating results of ATC TIPL are reported as discontinued operations for all periods presented. Prior to the divestiture and classification as discontinued operations, ATC TIPL’s operating results were included within the Asia-Pacific property segment. See Note 22 for further discussion. \nOn September 12, 2024, we completed the ATC TIPL Transaction and received total consideration of 182 billion INR (approximately $2.2 billion). We used the proceeds from the ATC TIPL Transaction to repay existing indebtedness under the 2021 Multicurrency Credit Facility. We recorded a loss on the sale of ATC TIPL of $1.2 billion, which primarily included the reclassification of our cumulative translation adjustment in India upon exiting the market of $1.1 billion. \nThe following table presents key components of Loss from discontinued operations, net of taxes in the consolidated statements of operations:\nYear Ended December 31,\nPercent Change 2024 vs 2023\nPercent Change 2023 vs 2022\n2024 (1)\n2023\n2022\nRevenue\n$\n911.2 \n$\n1,132.0 \n$\n1,065.7 \n(20)\n%\n6 \n%\nCost of operations\n(473.8)\n(699.1)\n(694.6)\n(32)\n1 \nDepreciation, amortization and accretion\n(96.0)\n(158.0)\n(190.2)\n(39)\n(17)\nSelling, general, administrative and development expense\n(58.7)\n(46.5)\n(70.2)\n26 \n(34)\nOther operating expense\n(6.7)\n(7.0)\n(497.0)\n(4)\n(99)\nLoss on sale of ATC TIPL\n(1,245.5)\n— \n— \n100 \n— \nGoodwill impairment\n— \n(322.0)\n— \n(100)\n100 \nOperating loss\n$\n(969.5)\n$\n(100.6)\n$\n(386.3)\n864 \n%\n(74)\n%\nInterest income\n30.7 \n24.8 \n22.5 \n24 \n10 \nInterest expense\n(7.6)\n(10.0)\n(0.5)\n(24)\n1,900 \nOther income (expense), net\n46.5 \n77.8 \n(1.0)\n(40)\n(7,880)\nLoss from discontinued operations before taxes\n$\n(899.9)\n$\n(8.0)\n$\n(365.3)\n11,149 \n%\n(98)\n%\nIncome tax provision (benefit)\n78.4 \n63.4 \n(88.8)\n24 \n(171)\nLoss from discontinued operations, net of taxes\n$\n(978.3)\n$\n(71.4)\n$\n(276.5)\n1,270 \n%\n(74)\n%\n_______________\n(1)    Includes the results of operations for ATC TIPL through September 12, 2024.\nFollowing the rulings by the Supreme Court of India regarding carriers’ obligations for the adjusted gross revenue fees and charges prescribed by the court, we experienced variability and a level of uncertainty in collections in India. In the third quarter of 2022, one of our largest customers in India, Vodafone Idea Limited (“VIL”), communicated that it would make partial payments of its contractual amounts owed to us (the “VIL Shortfall”). We recorded reserves in late 2022 and the first half of 2023 for the VIL Shortfall. In the second half of 2023, VIL began making payments in full of its monthly contractual obligations owed to us.\nDuring the year ended December 31, 2023, we deferred recognition of revenue of approximately $27.3 million, net of recoveries, related to VIL in India. During the year ended December 31, 2024, we recognized approximately $95.7 million of this previously deferred revenue. As of December 31, 2024, we have fully recognized this previously deferred revenue. \nIn 2023, we initiated a strategic review of our India business. During the process, and based on information gathered therein, we updated our estimate on the fair value of the India reporting unit and determined that the carrying value exceeded fair value. As a result, we recorded a goodwill impairment charge of $322.0 million in the third quarter of 2023 for our India reporting unit. \nIn February 2023, and as amended in August 2023, VIL \nissued optionally convertible debentures (the “VIL OCDs”) to ATC TIPL in exchange for VIL’s payment of certain amounts towards accounts receivables.\n \nThe VIL \nOCDs were issued for an aggregate face value of 16.0 billion INR (approximately $193.2 million on the date of issuance). On March 23, 2024, we \n41\nTable of Contents\n \nconverted an aggregate face value of 14.4 billion INR (approximately $172.7 million) of VIL OCDs into 1,440 million shares of equity of VIL (the “VIL Shares”). On April 29, 2024, we completed the sale of 1,440 million VIL Shares at a price of 12.78 INR per share. The net proceeds for this transaction were approximately 18.0 billion INR (approximately $216.0 million at the date of settlement) after deducting commissions and fees. On June 5, 2024, we completed the sale of the remaining aggregate face value of 1.6 billion INR (approximately $19.2 million) of the VIL OCDs. The net proceeds for this transaction, excluding accrued interest, were approximately 1.8 billion INR (approximately $22.0 million at the date of settlement) after deducting fees. As of December 31, 2024, none of the VIL Shares or the VIL OCDs remained outstanding.\nDuring the year ended December 31, 2024, we recognized a gain of $46.4 million on the sale of the VIL Shares and the VIL OCDs. The gains on the sales of the VIL Shares and the VIL OCDs are recorded in Loss from discontinued operations, net of taxes in the consolidated statements of operations in the current period. During the year ended December 31, 2023, we recognized an unrealized gain of $76.7 million related to the VIL OCDs. Gains related to the VIL Shares and the VIL OCDs are included in Other income, net in the table above. \nDuring the year ended December 31, 2022, we recorded impairment charges of $97.0 million related to tower and network location intangible assets and $411.6 million related to tenant-related intangible assets related to a customer of ATC TIPL in India. Impairment changes are included in Other operating expense in the able above. For more information on these impairments, see the information under the caption “India Impairments” included in Note 22.\nNet Income / Adjusted EBITDA and Net Income / Nareit FFO attributable to American Tower Corporation common stockholders / AFFO attributable to American Tower Corporation common stockholders\nDuring the year ended December 31, 2024, we updated our presentation of Nareit FFO attributable to American Tower Corporation common stockholders and AFFO attributable to American Tower Corporation common stockholders to remove the separate presentation of Consolidated AFFO. We believe this presentation better aligns our reporting with management’s     current approach of allocating capital and resources, managing growth and profitability and assessing the operating performance of our business. The change in presentation has no impact on our Nareit FFO attributable to American Tower Corporation common stockholders or AFFO attributable to American Tower Corporation common stockholders for any periods. Historical financial information included below has been adjusted to reflect the change in presentation.\n \nYear Ended December 31,\nPercent Change 2024 vs 2023\nPercent Change 2023 vs 2022\n \n2024\n2023\n2022\nNet income\n$\n2,280.2 \n$\n1,367.1 \n$\n1,696.7 \n67 \n%\n(19)\n%\nLoss from discontinued operations, net of taxes\n978.3 \n71.4 \n276.5 \n1,270 \n(74)\nIncome tax provision\n366.3 \n90.8 \n112.8 \n303 \n(20)\nOther (income) expense\n(377.6)\n326.3 \n(434.7)\n(216)\n(175)\nLoss on retirement of long-term obligations\n— \n0.3 \n0.4 \n(100)\n(25)\nInterest expense\n1,404.5 \n1,388.2 \n1,136.0 \n1 \n22 \nInterest income\n(135.2)\n(118.6)\n(49.1)\n14 \n142 \nOther operating expenses\n74.1 \n370.7 \n270.6 \n(80)\n37 \nGoodwill impairment\n— \n80.0 \n— \n(100)\n100 \nDepreciation, amortization and accretion\n2,028.8 \n2,928.5 \n3,164.9 \n(31)\n(7)\nStock-based compensation expense\n192.7 \n183.3 \n161.7 \n5 \n13 \nAdjusted EBITDA (1)\n$\n6,812.1 \n$\n6,688.0 \n$\n6,335.8 \n2 \n%\n6 \n%\n_______________\n(1)    Excludes the operating results of ATC TIPL, which are reported as discontinued operations. See Note 22 for further discussion.\n42\nTable of Contents\n \n \nYear Ended December 31,\nPercent Change 2024 vs 2023\nPercent Change 2023 vs 2022\n \n2024\n2023\n2022\nNet income (1)\n$\n2,280.2 \n$\n1,367.1 \n$\n1,696.7 \n67 \n%\n(19)\n%\nReal estate related depreciation, amortization and accretion\n1,879.6 \n2,682.7 \n2,925.5 \n(30)\n(8)\nLosses from sale or disposal of real estate and real estate related impairment charges (2)\n91.6 \n414.6 \n184.0 \n(78)\n125 \nAdjustments and distributions for unconsolidated affiliates and noncontrolling interests (3)\n(352.7)\n(324.0)\n(210.4)\n9 \n54 \nAdjustments for discontinued operations (4)\n1,334.5 \n469.6 \n683.7 \n184 \n(31)\nNareit FFO attributable to American Tower Corporation common stockholders\n$\n5,233.2 \n$\n4,610.0 \n$\n5,279.5 \n14 \n%\n(13)\n%\nStraight-line revenue\n(277.6)\n(465.4)\n(508.5)\n(40)\n(8)\nStraight-line expense\n46.8 \n24.4 \n34.0 \n92 \n(28)\nStock-based compensation expense\n192.7 \n183.3 \n161.7 \n5 \n13 \nDeferred portion of income tax and other income tax adjustments (5)\n88.7 \n(162.6)\n(195.4)\n(155)\n(17)\nGTP one-time cash tax settlement (6)\n— \n— \n48.3 \n— \n(100)\nNon-real estate related depreciation, amortization and accretion\n149.2 \n245.8 \n239.4 \n(39)\n3 \nAmortization of deferred financing costs, capitalized interest, debt discounts and premiums and long-term deferred interest charges\n54.1 \n49.8 \n47.5 \n9 \n5 \nOther (income) expense (7)\n(377.6)\n326.3 \n(434.7)\n(216)\n(175)\nLoss on retirement of long-term obligations\n— \n0.3 \n0.4 \n(100)\n(25)\nOther operating (income) expenses (8)\n(17.5)\n36.1 \n86.6 \n(148)\n(58)\nCapital improvement capital expenditures\n(157.4)\n(186.6)\n(164.8)\n(16)\n13 \nCorporate capital expenditures\n(13.9)\n(16.2)\n(9.4)\n(14)\n72 \nAdjustments and distributions for unconsolidated affiliates and noncontrolling interests (9)\n4.4 \n19.4 \n20.0 \n(77)\n(3)\nAdjustments for discontinued operations (10)\n9.0 \n(53.1)\n(87.9)\n(117)\n(40)\nAFFO attributable to American Tower Corporation common stockholders\n$\n4,934.1 \n$\n4,611.5 \n$\n4,516.7 \n7 \n%\n2 \n%\nAFFO attributable to American Tower Corporation common stockholders from continuing operations\n$\n4,568.9 \n$\n4,266.4 \n$\n4,197.4 \n7 \n%\n2 \n%\nAFFO attributable to American Tower Corporation common stockholders from discontinued operations\n$\n365.2 \n$\n345.1 \n$\n319.3 \n6 \n%\n8 \n%\n_______________\n(1)    For the years ended December 31, 2024, 2023 and 2022, includes Loss from discontinued operations, net of taxes of $978.3 million, $71.4 million and $276.5 million, respectively. \n(2)    For the years ended December 31, 2024, 2023 and 2022, includes impairment charges of $68.6 million, $200.0 million and $147.3 million, respectively. For the year ended December 31, 2023, also includes a goodwill impairment charge of $80.0 million recorded for the Spain reporting unit and a loss on the sale of Mexico Fiber of $80.0 million.\n(3)    Includes distributions to noncontrolling interest holders, distributions related to the outstanding mandatorily convertible preferred equity in connection with our agreements with certain investment vehicles affiliated with Stonepeak Partners LP and adjustments for the impact of noncontrolling interests on Nareit FFO attributable to American Tower Corporation common stockholders.\n(4)    For the years ended December 31, 2024, 2023 and 2022, includes (i) real estate related depreciation, amortization and accretion for discontinued operations of $91.3 million, $151.4 million and $183.4 million, respectively, and (ii) losses from the sale or disposal of real estate and real estate related impairment charges for discontinued operations of $1.2 billion, $318.2 million and $500.3 million, respectively. For the year ended December 31, 2024, includes a loss on the sale of ATC TIPL of $1.2 billion. For the year ended December 31, 2023, includes goodwill impairment charges of $322.0 million recorded for the India reporting unit.\n(5)    For the year ended December 31, 2024, includes adjustments for withholding taxes paid in Singapore of $36.4 million, which were incurred as a result of the ATC TIPL Transaction. We believe that these withholding tax payments are nonrecurring, and do not believe these are an indication of our operating performance. Accordingly, we believe it is more meaningful to present AFFO attributable to American Tower Corporation common stockholders excluding these amounts.\n(6)    In 2015, we incurred charges in connection with certain tax elections wherein MIP Tower Holdings LLC, parent company to Global Tower Partners (“GTP”), would no longer operate as a separate REIT for federal and state income tax purposes. We finalized a settlement related to this tax election during the year ended December 31, 2022. We believe that these related transactions are nonrecurring, and do not believe it is an indication of our operating performance. Accordingly, we believe it is more meaningful to present AFFO attributable to American Tower Corporation common stockholders excluding these amounts.\n43\nTable of Contents\n \n(7)    Includes (gains) losses on foreign currency exchange rate fluctuations of $(308.3) million, $330.6 million and $(451.4) million, respectively.\n(8)    Primarily includes acquisition-related costs, integration costs and disposition costs.\n(9)    Includes adjustments for the impact of noncontrolling interests on other line items, excluding those already adjusted for in Nareit FFO attributable to American Tower Corporation common stockholders.\n(10)    Includes the impact of discontinued operations associated with other line items, excluding the impact already included in Nareit FFO attributable to American Tower Corporation common stockholders.\nYear Ended December 31, 2024 \nThe increase in net income from continuing operations was primarily due to (i) a decrease in depreciation, amortization and accretion expense, (ii) changes in other (income) expense, primarily due to foreign currency exchange rate fluctuations, (iii) a decrease in other operating expense, (iv) an increase in segment operating profit and (v) a decrease in goodwill impairment, partially offset by an increase in the income tax provision.\nThe increase in Adjusted EBITDA was primarily attributable to an increase in our gross margin and a decrease in SG&A, excluding the impact of stock-based compensation expense of $22.0 million.\nThe increase in AFFO attributable to American Tower Corporation common stockholders was primarily attributable to (i) an increase in our operating profit, excluding the impact of straight-line accounting, (ii) a decrease in capital improvement capital expenditures and (iii) an increase in AFFO attributable to American Tower Corporation common stockholders from discontinued operations, partially offset by distributions and adjustments for noncontrolling interests, including distributions to noncontrolling interest holders in our Europe property segment and Data Centers segment.\nYear Ended December 31, 2023\nThe decrease in net income from continuing operations was primarily due to (i) changes in other expense (income) primarily due to foreign currency exchange rate fluctuations, (ii) an increase in net interest expense, (iii) an increase in other operating expenses and (iv) an increase in goodwill impairment expense, partially offset by (x) an increase in segment operating profit, (y) a decrease in depreciation, amortization and accretion expense and (z) a decrease in the income tax provision. \nThe increase in Adjusted EBITDA was primarily attributable to an increase in our gross margin, partially offset by an increase in SG&A, excluding the impact of stock-based compensation expense, of $22.3 million. \nThe increase in AFFO attributable to American Tower Corporation common stockholders was primarily attributable to (i) an increase in our operating profit, excluding the impact of straight-line accounting, and (ii) an increase in AFFO attributable to American Tower Corporation common stockholders from discontinued operations, partially offset by (x) an increase in net cash paid for interest, (y) distributions and adjustments for noncontrolling interests, including distributions to noncontrolling interest holders in our Data Centers segment and (z) increases in cash paid for income taxes and capital improvement capital expenditures.\n44\nTable of Contents\n \nSegment Gross Margin Reconciliation\nGross margin is defined as revenue less costs of operations inclusive of real estate related depreciation, amortization and accretion. Segment gross margin excludes depreciation, amortization and accretion. \n \nProperty\nTotal \nProperty\nServices\nTotal\nYear ended December 31, 2024\nU.S. & Canada\nAfrica & APAC (1)\nEurope\nLatin America\nData Centers\nGross margin\n$\n3,790.6 \n$\n610.9 \n$\n240.9 \n$\n985.9 \n$\n(56.2)\n$\n5,572.1 \n$\n101.1 \n$\n5,673.2 \nReal estate related depreciation, amortization and accretion\n586.6 \n216.6 \n284.4 \n201.8 \n590.2 \n1,879.6 \n— \n1,879.6 \nSegment gross margin\n$\n4,377.2 \n$\n827.5 \n$\n525.3 \n$\n1,187.7 \n$\n534.0 \n$\n7,451.7 \n$\n101.1 \n$\n7,552.8 \n______________\n(1)\nExcludes the operating results of ATC TIPL, which are reported as discontinued operations. See note 22 for further discussion.\n \nProperty\nTotal \nProperty\nServices\nTotal\nYear ended December 31, 2023\nU.S. & Canada\nAfrica & APAC (1)\nEurope\nLatin America\nData Centers\nGross margin\n$\n3,362.7 \n$\n505.0 \n$\n122.9 \n$\n890.5 \n$\n(196.0)\n$\n4,685.1 \n$\n82.9 \n$\n4,768.0 \nReal estate related depreciation, amortization and accretion\n1,003.6 \n301.0 \n353.2 \n341.8 \n683.1 \n2,682.7 \n— \n2,682.7 \nSegment gross margin\n$\n4,366.3 \n$\n806.0 \n$\n476.1 \n$\n1,232.3 \n$\n487.1 \n$\n7,367.8 \n$\n82.9 \n$\n7,450.7 \n______________\n(1)\nExcludes the operating results of ATC TIPL, which are reported as discontinued operations. See note 22 for further discussion.\n \nProperty\nTotal \nProperty\nServices\nTotal\nYear ended December 31, 2022\nU.S. & Canada\nAfrica & APAC (1)\nEurope\nLatin America\nData Centers\nGross margin\n$\n3,136.3 \n$\n433.7 \n$\n71.0 \n$\n803.0 \n$\n(427.0)\n$\n4,017.0 \n$\n133.7 \n$\n4,150.7 \nReal estate related depreciation, amortization and accretion\n1,024.6 \n322.0 \n345.1 \n362.2 \n871.6 \n2,925.5 \n— \n2,925.5 \nSegment gross margin\n$\n4,160.9 \n$\n755.7 \n$\n416.1 \n$\n1,165.2 \n$\n444.6 \n$\n6,942.5 \n$\n133.7 \n$\n7,076.2 \n______________\n(1)\nExcludes the operating results of ATC TIPL, which are reported as discontinued operations. See note 22 for further discussion.\n45\nTable of Contents\n \nLiquidity and Capital Resources  \nFor a discussion of our 2023 Liquidity and Capital Resources, including a discussion of cash flows for the fiscal year ended December 31, 2023 compared to the fiscal year ended December 31, 2022, refer to Part I, Item 7 of the 2023 Form 10-K.\nOverview \nDuring the year ended December 31, 2024, we increased our financial flexibility and our ability to grow our business while maintaining our long-term financial policies. Our significant 2024 financing transactions included:\n•\nRedemption of our 0.600% senior unsecured notes due 2024 (the “0.600% Notes”), our 5.00% senior unsecured notes due 2024 (the “5.00% Notes”) and our 3.375% senior unsecured notes due 2024 (the “3.375% Notes”) upon their maturity;\n•\nRegistered public offering in an aggregate principal amount of $3.6 billion, including 1.0 billion EUR, of senior unsecured notes with maturities ranging from 2029 to 2035; \n•\nRepayment of 825.0 million EUR ($895.5 million as of the repayment date) unsecured term loan, as amended in December 2021 (the “2021 EUR Three Year Delayed Draw Term Loan”); and\n•\nRepayment of indebtedness under the 2021 Multicurrency Credit Facility using proceeds from the ATC TIPL Transaction.\nThe following table summarizes our liquidity as of December 31, 2024 (in millions):   \nAvailable under the 2021 Multicurrency Credit Facility\n$\n6,000.0 \nAvailable under the 2021 Credit Facility\n4,000.0 \nLetters of credit\n(35.6)\nTotal available under credit facilities, net\n9,964.4 \nCash and cash equivalents\n1,999.6 \nTotal liquidity\n$\n11,964.0 \nSubsequent to December 31, 2024, we made additional borrowings of $610.0 million under the 2021 Credit Facility (as defined below) and net borrowings of $210.0 million under the 2021 Multicurrency Credit Facility. The borrowings were used to repay existing indebtedness and for general corporate purposes.\nSummary cash flow information is set forth below for the years ended December 31, (in millions): \n \n2024\n2023\nNet cash provided by (used for):\nOperating activities\n$\n5,290.5 \n$\n4,722.4 \nInvesting activities (1)\n410.6 \n(1,695.5)\nFinancing activities\n(5,452.4)\n(3,097.4)\nNet effect of changes in foreign currency exchange rates on cash and cash equivalents, and restricted cash\n(233.9)\n23.2 \nNet increase (decrease) in cash and cash equivalents, and restricted cash\n$\n14.8 \n$\n(47.3)\n_______________ \n(1)    For the year ended December 31, 2024, includes $2.2 billion of proceeds from the ATC TIPL Transaction.\nWe use our cash flows to fund our operations and investments in our business, including maintenance and improvements, communications site and data center construction, managed network installations and acquisitions. Additionally, we use our cash flows to make distributions, including distributions of our REIT taxable income to maintain our qualification for taxation as a REIT under the Code. We may also periodically repay or repurchase our existing indebtedness or equity. We typically fund our international expansion efforts primarily through a combination of cash on hand, intercompany debt and equity contributions. \nOn an on-going basis, we also perform a comprehensive assessment of our global operations to ensure our portfolio is positioned to drive sustained growth and achieve our risk-adjusted return objectives. This assessment may result in our decision to divest a portion, or all, of certain assets, including our Australia and New Zealand businesses in 2024, and the ATC TIPL Transaction, and repurpose proceeds, and potential future capital, to other capital priorities.\nAs of December 31, 2024, we had total outstanding indebtedness of $36.8 billion, with a current portion of $3.7 billion. During the year ended December 31, 2024, we generated sufficient cash flow from operations, together with borrowings under our credit facilities, proceeds from our debt issuances and cash on hand, to fund our acquisitions, capital expenditures and debt service obligations, as well as our required distributions. We believe the cash generated by operating activities during the year \n46\nTable of Contents\n \nending December 31, 2025, together with our borrowing capacity under our credit facilities, will suffice to fund our required distributions, capital expenditures, debt service obligations (interest and principal repayments) and signed acquisitions.\nAs of December 31, 2024, we had $1.1 billion of cash and cash equivalents held by our foreign subsidiaries. As of December 31, 2024, we had $228.2 million of cash and cash equivalents held by our joint ventures, of which $211.6 million was held by our foreign joint ventures. Certain foreign subsidiaries may pay us interest or principal on intercompany debt. Additionally, in the event that we repatriate funds from our foreign subsidiaries, we may be required to accrue and pay certain taxes.\nCash Flows from Operating Activities\nFor the year ended December 31, 2024, cash provided by operating activities increased $568.1 million as compared to the year ended December 31, 2023. The primary factors that impacted cash provided by operating activities as compared to the year ended December 31, 2023, include:\n•\nincreases in the operating profits of our U.S. & Canada, Africa & APAC and Europe property segments, our Data Centers segment, our Services segment and in India, excluding the loss on sale of ATC TIPL;\n•\na decrease in the impact of straight-line revenue; and \n•\na decrease in cash required for working capital;\n•\nPartially offset by increases in cash paid for interest and cash paid for taxes.\nCash Flows from Investing Activities\nOur significant investing activities during the year ended December 31, 2024 are highlighted below: \n•\nWe spent approximately $123.0 million for acquisitions, including $25.7 million in payments made for acquisitions completed in 2023, $59.1 million in payments for sites acquired in connection with the AT&T transaction described in note 18 to our consolidated financial statements included in this Annual Report.\n•\nWe received $238.0 million from the sales of the VIL Shares and the VIL OCDs. \n•\nWe received $2.2 billion from the ATC TIPL Transaction.\n•\nWe spent $1.6 billion for capital expenditures, as follows (in millions):\nDiscretionary capital projects (1)\n$\n851.0 \nGround lease purchases (2)\n144.2 \nCapital improvements and corporate expenditures (3)\n189.3 \nRedevelopment\n350.0 \nStart-up capital projects\n81.3 \nTotal capital expenditures (4)\n$\n1,615.8 \n_______________\n(1)\nIncludes the construction of 2,391 communications sites globally, the construction of 90 communications sites in India, which are reported as discontinued operations, and approximately $491.6 million of spend related to data center assets.\n(2)\nIncludes $32.7 million of perpetual land easement payments reported in Deferred financing costs and other financing activities in the cash flows from  financing activities in our consolidated statements of cash flows.\n(3)\nIncludes $4.7 million of finance lease payments reported in Repayments of notes payable, credit facilities, senior notes, secured debt, term loans and finance leases in the cash flows from financing activities in our consolidated statements of cash flows.\n(4)\nNet of purchase credits of $11.6 million on certain assets, which are recorded in investing activities in our consolidated statements of cash flows. \nWe plan to continue to allocate our available capital, after satisfying our distribution requirements, among investment alternatives that meet our return on investment criteria, while maintaining our commitment to our long-term financial policies. Accordingly, we expect to continue to deploy capital through our annual capital expenditure program, including land purchases and new site and data center facility construction, and through acquisitions. We also regularly review our portfolios as to capital expenditures required to upgrade our infrastructure to our structural standards or address capacity, structural or permitting issues. \nWe expect that our 2025 total capital expenditures will be as follows (in millions): \nDiscretionary capital projects (1)\n$\n880 \nto\n$\n910 \nGround lease purchases\n190 \nto\n210 \nCapital improvements and corporate expenditures\n155 \nto\n165 \nRedevelopment\n360 \nto\n390 \nStart-up capital projects\n50 \nto\n70 \nTotal capital expenditures\n$\n1,635 \nto\n$\n1,745 \n47\nTable of Contents\n \n_______________ \n(1)    Includes the construction of approximately 1,950 to 2,550 communications sites globally and approximately $610 million of anticipated spend related to data center assets.\nCash Flows from Financing Activities \nOur significant financing activities were as follows (in millions): \nYear Ended December 31,\n2024\n2023\nProceeds from issuance of senior notes, net\n$\n3,568.6 \n$\n5,678.3 \nRepayments of credit facilities, net\n(2,321.1)\n(2,563.8)\nRepayments of term loans (1)\n(1,015.4)\n(1,500.0)\nProceeds from issuance of securities in securitization transaction\n— \n1,300.0 \nRepayments of securitized debt \n— \n(1,300.0)\nRepayments of senior notes \n(2,150.0)\n(1,700.0)\nDistributions paid on common stock\n(3,074.9)\n(2,949.3)\n_______________  \n(1)\nFor the year ended December 31, 2024, includes the repayments of the 2021 EUR Three Year Delayed Draw Term Loan and the India Term Loan (as defined below).\nSenior Notes\nRepayments of Senior Notes\nRepayment of 0.600% Senior Notes—\nOn January 12, 2024, we repaid $500.0 million aggregate principal amount of the 0.600% Notes upon their maturity. The 0.600% Notes were repaid using borrowings under the 2021 Multicurrency Credit Facility. Upon completion of the repayment, none of the 0.600% Notes remained outstanding.\nRepayment of 5.00% Senior Notes—\nOn February 14, 2024, we repaid $1.0 billion aggregate principal amount of the 5.00% Notes upon their maturity. The 5.00% Notes were repaid using borrowings under the 2021 Multicurrency Credit Facility. Upon completion of the repayment, none of the 5.00% Notes remained outstanding.\nRepayment of 3.375% Senior Notes\n—On May 15, 2024, we repaid $650.0 million aggregate principal amount of the 3.375% Notes upon their maturity. The 3.375% Notes were repaid using borrowings under the 2021 Credit Facility (as defined below). Upon completion of the repayment, none of the 3.375% Notes remained outstanding.\nRepayment of 2.950% Senior Notes—\nOn January 14, 2025, we repaid $650.0 million aggregate principal amount of our 2.950% senior unsecured notes due 2025 (the “2.950% Notes”) upon their maturity. The 2.950% Notes were repaid using cash on hand and borrowings under the 2021 Multicurrency Credit Facility. Upon completion of the repayment, none of the 2.950% Notes remained outstanding.\nOfferings of Senior Notes\n5.200% Senior Notes and 5.450% Senior Notes Offering—\nOn March 7, 2024, we completed a registered public offering of $650.0 million aggregate principal amount of 5.200% senior unsecured notes due 2029 (the “5.200% Notes”) and $650.0 million aggregate principal amount of 5.450% senior unsecured notes due 2034 (the “5.450% Notes”). The net proceeds from this offering were approximately $1,281.3 million, after deducting commissions and estimated expenses. We used the net proceeds to repay existing indebtedness under the 2021 Multicurrency Credit Facility.\n3.900% Senior Notes and 4.100% Senior Notes Offering—\nOn May 29, 2024, we completed a registered public offering of 500.0 million EUR ($540.1 million at the date of issuance) aggregate principal amount of 3.900% senior unsecured notes due 2030 (the “3.900% Notes”) and 500.0 million EUR ($540.1 million at the date of issuance) aggregate principal amount of 4.100% senior unsecured notes due 2034 (the “4.100% Notes”). The net proceeds from this offering were approximately 988.4 million EUR (approximately $1,067.5 million at the date of issuance), after deducting commissions and estimated expenses. We used the net proceeds to repay existing EUR indebtedness under the 2021 Multicurrency Credit Facility.\n5.000% Senior Notes and 5.400% Senior Notes Offering— \nOn November 21, 2024, we completed a registered public offering of $600.0 million aggregate principal amount of 5.000% senior unsecured notes due 2030 (the “5.000% Notes”) and $600.0 million aggregate principal amount of 5.400% senior unsecured notes due 2035 (the “5.400% Notes” and, collectively with the 5.200% Notes, the 5.450% Notes, the 3.900% Notes, the 4.100% Notes and the 5.000% Notes, the “2024 Notes”). The \n48\nTable of Contents\n \nnet proceeds from this offering were approximately $1,183.7 million, after deducting commissions and estimated expenses. We used the net proceeds to repay existing indebtedness under the 2021 Multicurrency Credit Facility and the 2021 Credit Facility.\nThe key terms of the 2024 Notes are as follows:\nSenior Notes\nAggregate Principal Amount (in millions)\nIssue Date and Interest Accrual Date\nMaturity Date\nContractual Interest Rate\nFirst Interest Payment\nInterest Payments Due (1)\nPar Call Date (2)\n5.200% Notes\n$\n650.0 \nMarch 7, 2024\nFebruary 15, 2029\n5.200 \n%\nAugust 15, 2024\nFebruary 15 and August 15\nJanuary 15. 2029\n5.450% Notes\n$\n650.0 \nMarch 7, 2024\nFebruary 15, 2034\n5.450 \n%\nAugust 15, 2024\nFebruary 15 and August 15\nNovember 15. 2033\n3.900% Notes (3)\n$\n540.1 \nMay 29, 2024\nMay 16, 2030\n3.900 \n%\nMay 16, 2025\nMay 16\nFebruary 16, 2030\n4.100% Notes (3)\n$\n540.1 \nMay 29, 2024\nMay 16, 2034\n4.100 \n%\nMay 16, 2025\nMay 16\nFebruary 16. 2034\n5.000% Notes\n$\n600.0 \nNovember 21, 2024\nJanuary 31, 2030\n5.000 \n%\nJuly 31, 2025\nJanuary 31 and July 31\nDecember 31, 2029\n5.400% Notes\n$\n600.0 \nNovember 21, 2024\nJanuary 31, 2035\n5.400 \n%\nJuly 31, 2025\nJanuary 31 and July 31\nOctober 31, 2034\n_______________ \n(1)\nAccrued and unpaid interest on U.S. Dollar (“USD”) denominated notes is payable in USD semi-annually in arrears and will be computed from the issue date on the basis of a 360-day year comprised of twelve 30-day months. Interest on EUR denominated notes is payable in EUR annually in arrears and will be computed on the basis of the actual number of days in the period for which interest is being calculated and the actual number of days from and including the last date on which interest was paid on the notes, beginning on the issue date.\n(2)\nWe may redeem the 2024 Notes at any time, in whole or in part, at a redemption price equal to 100% of the principal amount of the 2024 Notes plus a make-whole premium, together with accrued interest to the redemption date. If we redeem the 2024 Notes on or after the par call date, we will not be required to pay a make-whole premium.\n(3)\nThe 3.900% Notes and the 4.100% Notes are denominated in EUR; dollar amounts represent the aggregate principal amount at the issuance date.\nIf we undergo a change of control and corresponding ratings decline, each as defined in the applicable supplemental indenture for the 2024 Notes, we may be required to repurchase all of the 2024 Notes at a purchase price equal to 101% of the aggregate principal amount of those 2024 Notes, plus accrued and unpaid interest (including additional interest, if any), up to but not including the repurchase date. The 2024 Notes rank equally in right of payment with all of our other senior unsecured debt obligations and are structurally subordinated to all existing and future indebtedness and other obligations of our subsidiaries.\nEach applicable supplemental indenture contains certain covenants that restrict our ability to merge, consolidate or sell assets and our (together with our subsidiaries’) ability to incur liens. These covenants are subject to a number of exceptions, including that we and our subsidiaries may incur certain liens on assets, mortgages or other liens securing indebtedness if the aggregate amount of indebtedness secured by such liens does not exceed 3.5x Adjusted EBITDA, as defined in the applicable supplemental indenture.\nBank Facilities\nAmendments to Bank Facilities—\nOn January 28, 2025, we amended our (i) 2021 Multicurrency Credit Facility, (ii) $4.0 billion senior unsecured revolving credit facility, as amended and restated on December 8, 2021, as further amended (the “2021 Credit Facility”) and (iii) $1.0 billion unsecured term loan, as amended and restated on December 8, 2021, as further amended (the “2021 Term Loan”). \nThese amendments, among other things, \ni.\nextend the maturity dates of the 2021 Multicurrency Credit Facility and the 2021 Credit Facility to January 28, 2028 and January 28, 2030, respectively; \nii.\nextend the maturity date of the 2021 Term Loan to January 28, 2028; and\niii.\nupdate the Applicable Margins (as defined in the loan agreements).\n2021 Multicurrency Credit Facility—\nAs of December 31, 2024, we had the ability to borrow up to $6.0 billion under the 2021 Multicurrency Credit Facility, which includes a $3.5 billion sublimit for multicurrency borrowings, a $200.0 million sublimit for letters of credit and a $50.0 million sublimit for swingline loans. During the year ended December 31, 2024, we borrowed an aggregate of $5.4 billion, including 0.9 billion EUR ($1.0 billion as of the borrowing date) and repaid an aggregate of $6.1 billion, including 1.1 billion EUR ($1.2 billion as of the repayment date), of revolving indebtedness under the 2021 Multicurrency Credit Facility. We used the borrowings to repay outstanding indebtedness, including the 0.600% Notes, the \n49\nTable of Contents\n \n5.00% Notes and the 2021 EUR Three Year Delayed Draw Term Loan, and for general corporate purposes. We used the proceeds from the ATC TIPL Transaction to repay existing indebtedness under the 2021 Multicurrency Credit Facility. As of December 31, 2024, there are no EUR borrowings outstanding under the 2021 Multicurrency Credit Facility.\n2021 Credit Facility—\nAs of December 31, 2024, we had the ability to borrow up to $4.0 billion under the 2021 Credit Facility, which includes a $2.5 billion sublimit for multicurrency borrowings, $200.0 million sublimit for letters of credit and a $50.0 million sublimit for swingline loans. During the year ended December 31, 2024, we borrowed an aggregate of $1.5 billion and repaid an aggregate of $3.1 billion of revolving indebtedness under our 2021 Credit Facility. We used the borrowings to repay outstanding indebtedness, including the 3.375%\n \nNotes, and for general corporate purposes.\nRepayment of 2021 EUR Three Year Delayed Draw Term Loan—\nOn May 21, 2024, we repaid all amounts outstanding under the 2021 EUR Three Year Delayed Draw Term Loan using borrowings under the 2021 Multicurrency Credit Facility.\nAs of December 31, 2024, the key terms under the 2021 Multicurrency Credit Facility, the 2021 Credit Facility and the 2021 Term Loan were as follows:\nBank Facility \nOutstanding Principal Balance\nMaturity Date\nSOFR or EURIBOR borrowing interest rate range (1)\nBase rate borrowing interest rate range (1)\nCurrent margin over SOFR or EURIBOR and the base rate, respectively (2)\n2021 Multicurrency Credit Facility\n(3)\n$\n— \nJuly 1, 2026\n(4)\n0.875% - 1.500%\n0.000% - 0.500%\n1.125% and 0.125%\n2021 Credit Facility\n(3)\n— \nJuly 1, 2028\n(4)\n0.875% - 1.500%\n0.000% - 0.500%\n1.125% and 0.125%\n2021 Term Loan\n(3)\n1,000.0 \nJanuary 31, 2027\n0.875% - 1.750%\n0.000% - 0.750%\n1.125% and 0.125%\n_______________\n(1)\nRepresents interest rate above: (a) Secured Overnight Financing Rate (“SOFR”) for SOFR based borrowings, (b) Euro Interbank Offer Rate (“EURIBOR”) for EURIBOR based borrowings and (c) the defined base rate for base rate borrowings, in each case based on our debt ratings.\n(2)\nAs further discussed above, on January 28, 2025, we amended the 2021 Multicurrency Credit Facility, the 2021 Credit Facility and the 2021 Term Loan to update the current margin over SOFR or EURIBOR and the base rate to 1.000% and 0.000%, respectively. \n(3)\nCurrently borrowed at SOFR.\n(4)\nSubject to two optional renewal periods.\nWe must pay a quarterly commitment fee on the undrawn portion of each of the 2021 Multicurrency Credit Facility and the 2021 Credit Facility. The commitment fee for the 2021 Multicurrency Credit Facility and the 2021 Credit Facility ranges from 0.080% to 0.200% per annum, based upon our debt ratings, and is currently 0.110%.\nThe 2021 Multicurrency Credit Facility, the 2021 Credit Facility and the 2021 Term Loan and the associated loan agreements (the “Bank Loan Agreements”) do not require amortization of principal and may be paid prior to maturity in whole or in part at our option without penalty or premium. We have the option of choosing either a defined base rate, SOFR or EURIBOR as the applicable base rate for borrowings under these bank facilities.\nEach Bank Loan Agreement contains certain reporting, information, financial and operating covenants and other restrictions (including limitations on additional debt, guaranties, sales of assets and liens) with which we must comply. Failure to comply with the financial and operating covenants of the loan agreements could not only prevent us from being able to borrow additional funds under the revolving credit facilities, but may constitute a default, which could result in, among other things, the amounts outstanding under the applicable agreement, including all accrued interest and unpaid fees, becoming immediately due and payable.\nOther Subsidiary Debt—\nAs of December 31, 2023, our other subsidiary debt included drawn letters of credit in Nigeria (the “Nigeria Letters of Credit”).\nAmounts outstanding and key terms of other subsidiary debt consisted of the following as of December 31, (in millions, except percentages):   \nCarrying Value \n(Denominated Currency)\nCarrying Value\n (USD)\nInterest Rate\nMaturity Date\n2024\n2023\n2024\n2023\nNigeria Letters of Credit (1)\n$\n— \n$\n3.4 \n$\n— \n$\n3.4 \nVarious\nVarious\n_______________\n(1)    Denominated in USD. During the years ended December 31, 2024 and 2023, we drew on letters of credit in Nigeria. The drawn amounts bear interest at a rate equal to the SOFR at the time of drawing plus a spread. Amounts are due 270 days from the date of drawing.\nEach of the agreements governing the other subsidiary debt contains contractual covenants and other restrictions. Failure to comply with certain of the financial and operating covenants could constitute a default under the applicable debt agreement, \n50\nTable of Contents\n \nwhich could result in, among other things, the amounts outstanding, including all accrued interest and unpaid fees, becoming immediately due and payable.\nIndia Term Loan\n—On February 17, 2023, we borrowed 10.0 billion INR (approximately $120.7 million at the date of borrowing) under an unsecured term loan in India with a maturity date that is one year from the date of the first draw thereunder (the “India Term Loan”). In January 2024, we amended the India Term Loan to extend the maturity date to December 31, 2024. On September 12, 2024, in connection with the completion of the ATC TIPL Transaction, we repaid the India Term Loan.\nStock Repurchase Programs\n—In March 2011, our Board approved a stock repurchase program, pursuant to which we are authorized to repurchase up to $1.5 billion of our common stock (the “2011 Buyback”). In December 2017, our Board approved an additional stock repurchase program, pursuant to which we are authorized to repurchase up to $2.0 billion of our common stock (the “2017 Buyback,” and, together with the 2011 Buyback, the “Buyback Programs”).\nDuring the year ended December 31, 2024, there were no repurchases under either of the Buyback Programs.\nUnder each program, we are authorized to purchase shares from time to time through open market purchases or in privately negotiated transactions not to exceed market prices and subject to market conditions and other factors. With respect to open market purchases, we may use plans adopted in accordance with Rule 10b5-1 under the Exchange Act in accordance with securities laws and other legal requirements, which allows us to repurchase shares during periods when we may otherwise be prevented from doing so under insider trading laws or because of self-imposed trading blackout periods. These programs may be discontinued at any time.\nWe have repurchased a total of 14.5 million shares of our common stock under the 2011 Buyback for an aggregate of $1.5 billion, including commissions and fees. We expect to continue managing the pacing of the remaining approximately $2.0 billion under the Buyback Programs in response to general market conditions and other relevant factors. We expect to fund any further repurchases of our common stock through a combination of cash on hand, cash generated by operations and borrowings under our credit facilities. Repurchases under the Buyback Programs are subject to, among other things, us having available cash to fund the repurchases. \nSales of Equity Securities\n—We receive proceeds from sales of our equity securities pursuant to our employee stock purchase plan (the “ESPP”) and upon exercise of stock options granted under our equity incentive plan, as amended (the “2007 Plan”). During the year ended December 31, 2024, we received an aggregate of $46.4 million in proceeds upon exercises of stock options and sales pursuant to the ESPP. \nFuture\n \nFinancing Transactions\n—\nWe regularly consider various options to obtain financing and access the capital markets, subject to market conditions, to meet our funding needs. Such capital raising alternatives, in addition to those noted above, may include amendments and extensions of our bank facilities, entry into new bank facilities, transactions with private equity funds or partnerships, additional senior note and equity offerings and securitization transactions. No assurance can be given as to whether any such financing transactions will be completed or as to the timing or terms thereof.\nDistributions—\nAs a REIT, we must annually distribute to our stockholders an amount equal to at least 90% of our REIT taxable income (determined before the deduction for distributed earnings and excluding any net capital gain). Generally, we have distributed, and expect to continue to distribute, all or substantially all of our REIT taxable income after taking into consideration our utilization of NOLs. We have distributed an aggregate of approximately $20.5 billion to our common stockholders, including the dividend paid in February 2025, primarily classified as ordinary income that may be treated as qualified REIT dividends under Section 199A of the Code for taxable years beginning before 2026. \nDuring the year ended December 31, 2024, we paid $6.56 per share, or $3.1 billion, to our common stockholders of record. In addition, we declared a distribution of $1.62 per share, or $757.1 million, paid on February 3, 2025 to our common stockholders of record at the close of business on December 27, 2024.\nWe accrue distributions on unvested restricted stock units, which are payable upon vesting. The amount accrued for distributions payable related to unvested restricted stock units was $22.5 million and $21.5 million as of December 31, 2024 and 2023, respectively. During the year ended December 31, 2024, we paid $12.0 million of distributions upon the vesting of restricted stock units. \nThe amount, timing and frequency of future distributions will be at the sole discretion of our Board and will depend on various factors, a number of which may be beyond our control, including our financial condition and operating cash flows, the amount required to maintain our qualification for taxation as a REIT and reduce any income and excise taxes that we otherwise would be required to pay, limitations on distributions in our existing and future debt and preferred equity instruments, our ability to utilize NOLs to offset our distribution requirements, limitations on our ability to fund distributions using cash generated through our TRSs and other factors that our Board may deem relevant.\n51\nTable of Contents\n \nFor more details on the cash distributions paid to our common stockholders during the year ended December 31, 2024, see note 14 to our consolidated financial statements included in this Annual Report.\nMaterial Cash Requirements\n—\nThe following table summarizes material cash requirements from known contractual and other obligations as of December 31, 2024 (in millions):\n2025\n2026\n2027\n2028\n2029\nThereafter\nTotal\nDebt obligations (1)\n$\n3,693.0 \n$\n3,319.3 \n$\n5,466.7 \n$\n6,027.4 \n$\n3,677.0 \n$\n14,572.9 \n$\n36,756.3 \nOperating lease obligations (2)\n986.9 \n924.9 \n886.1 \n843.4 \n801.7 \n7,088.1 \n11,531.1 \n______________\n(1)    Includes aggregate principal maturities of long-term debt, including finance lease obligations (see note 8 to our consolidated financial statements included in this Annual Report).\n(2)    Includes payments under non-cancellable initial terms, as well as payments for certain renewal periods at our option, which we expect to renew because failure to do so could result in a loss of the applicable communications sites and related revenues from tenant leases (see note 4 to our consolidated financial statements included in this Annual Report).\nDistributions—\nWe expect that our 2025 total distributions declared to our common stockholders will be $3.2 billion. The amount, timing and frequency of future distributions will be at the sole discretion of our Board. \nAsset Retirement Obligations—\nWe are required to remove our assets and remediate the leased sites upon which certain of our assets are located. As of December 31, 2024, the estimated undiscounted future cash outlay for asset retirement obligations was $4.5 billion. \nFactors Affecting Sources of Liquidity\nOur liquidity depends on our ability to generate cash flow from operating activities, borrow funds under our credit facilities and maintain compliance with the contractual agreements governing our indebtedness. We believe that the debt agreements discussed below represent our material debt agreements that contain covenants, our compliance with which would be material to an investor’s understanding of our financial results and the impact of those results on our liquidity.\nInternally Generated Funds\n—Because the majority of our customer leases are multiyear contracts, a significant majority of the revenues generated by our property operations as of the end of 2024 is recurring revenue that we should continue to receive in future periods. Accordingly, a key factor affecting our ability to generate cash flow from operating activities is to maintain this recurring revenue and to convert it into operating profit by minimizing operating costs and fully achieving our operating efficiencies. In addition, our ability to increase cash flow from operating activities depends upon the demand for our communications infrastructure and our related services and our ability to increase the utilization of our existing communications infrastructure.\nRestrictions Under Loan Agreements Relating to Our Credit Facilities\n—Each Bank Loan Agreement contains certain financial and operating covenants and other restrictions applicable to us and our subsidiaries that are not designated as unrestricted subsidiaries on a consolidated basis. These restrictions include limitations on additional debt, distributions and dividends, guaranties, sales of assets and liens. The Bank Loan Agreements also contain covenants that establish financial tests with which we and our restricted subsidiaries must comply related to total leverage and senior secured leverage, as set forth in the table below. As of December 31, 2024, we were in compliance with each of these covenants.  \nCompliance Tests For The 12 Months Ended \nDecember 31, 2024\n($ in billions)\nRatio (1)\nAdditional Debt Capacity Under Covenants (2)\nCapacity for Adjusted EBITDA Decrease Under Covenants (3)\nConsolidated Total Leverage Ratio\nTotal Debt to Adjusted EBITDA \n≤ 6.00:1.00\n~5.4\n~0.9\nConsolidated Senior Secured Leverage Ratio\nSenior Secured Debt to Adjusted EBITDA \n≤ 3.00:1.00\n~18.4 (4)\n~6.1 (4)\n_______________\n(1)    Each component of the ratio as defined in the applicable loan agreement.\n(2)    Assumes no change to Adjusted EBITDA.\n(3)    Assumes no change to our debt levels.  \n(4)    Effectively, however, additional Senior Secured Debt under this ratio would be limited to the capacity under the Consolidated Total Leverage Ratio.\nThe Bank Loan Agreements also contain reporting and information covenants that require us to provide financial and operating information to the lenders within certain time periods. If we are unable to provide the required information on a timely basis, we would be in breach of these covenants.\n52\nTable of Contents\n \nFailure to comply with the financial maintenance tests and certain other covenants of the Bank Loan Agreements could not only prevent us from being able to borrow additional funds under the revolving credit facilities, but may also constitute a default under these credit facilities, which could result in, among other things, the amounts outstanding, including all accrued interest and unpaid fees, becoming immediately due and payable. If this were to occur, we may not have sufficient cash on hand to repay such indebtedness. The key factors affecting our ability to comply with the debt covenants described above are our financial performance relative to the financial maintenance tests defined in the Bank Loan Agreements and our ability to fund our debt service obligations. Based upon our current expectations, we believe our operating results during the next 12 months will be sufficient to comply with these covenants.\nRestrictions Under Agreements Relating to the 2015 Securitization and the Trust Securitizations—\nThe indenture and related supplemental indenture governing the American Tower Secured Revenue Notes, Series 2015-2, Class A (the “Series 2015-2 Notes”) issued by GTP Acquisition Partners I, LLC (“GTP Acquisition Partners”) in a private securitization transaction in May 2015 (the “2015 Securitization”) and the loan agreement related to the securitization transactions completed in March 2018 (the “2018 Securitization”) and March 2023 (the “2023 Securitization” and, together with the 2018 Securitization, the “Trust Securitizations”) (collectively, the “Securitization Loan Agreements”) include certain financial ratios and operating covenants and other restrictions customary for transactions subject to rated securitizations. Among other things, GTP Acquisition Partners and American Tower Asset Sub, LLC and American Tower Asset Sub II, LLC (together, the “AMT Asset Subs”) are prohibited from incurring other indebtedness for borrowed money or further encumbering their assets, subject to customary carve-outs for ordinary course trade payables and permitted encumbrances (as defined in the applicable agreements).\nUnder the Securitization Loan Agreements, amounts due will be paid from the cash flows generated by the assets securing the Series 2015-2 Notes or the assets securing the nonrecourse loan that secures the Secured Tower Revenue Securities, Series 2018-1, Subclass A (the “Series 2018-1A Securities”), the Secured Tower Revenue Securities, Series 2018-1, Subclass R (the “Series 2018-1R Securities” and, together with the Series 2018-1A Securities, the “2018 Securities”), the Secured Tower Revenue Securities 2023-1, Subclass A (the “Series 2023-1A Securities”), the Secured Tower Revenue Securities, Series 2023-1, Subclass R (the “Series 2023-1R Securities” and, together with the Series 2023-1A Securities, the “2023 Securities”) issued in the Trust Securitizations (the “Loan”), as applicable, which must be deposited into certain reserve accounts, and thereafter distributed, solely pursuant to the terms of the applicable agreement. On a monthly basis, after paying all required amounts under the applicable agreement, subject to the conditions described in the table below, the excess cash flows generated from the operation of these assets are released to GTP Acquisition Partners or the AMT Asset Subs, as applicable, which can then be distributed to us for use. As of December 31, 2024, $60.8 million held in such reserve accounts was classified as restricted cash. \nCertain information with respect to the 2015 Securitization and the Trust Securitizations is set forth below. The debt service coverage ratio (“DSCR”) is generally calculated as the ratio of the net cash flow (as defined in the applicable agreement) to the amount of interest, servicing fees and trustee fees required to be paid over the succeeding 12 months on the principal amount of the Series 2015-2 Notes or the Loan, as applicable, that will be outstanding on the payment date following such date of determination.    \n53\nTable of Contents\n \nIssuer or Borrower\nNotes/Securities Issued\nConditions Limiting Distributions of Excess Cash\nExcess Cash Distributed During Year Ended December 31, 2024\nDSCR as of \nDecember 31, 2024\nCapacity for Decrease in Net Cash Flow Before Triggering  Cash Trap DSCR (1)\nCapacity for Decrease in Net Cash Flow Before Triggering Minimum DSCR (1)\nCash Trap DSCR\nAmortization Period\n(in millions)\n(in millions)\n(in millions)\n2015 Securitization\nGTP Acquisition Partners\nAmerican Tower Secured Revenue Notes, Series 2015-2\n1.30x,  Tested Quarterly (2)\n(3)(4)\n$354.0\n18.10x\n$309.1\n$311.9\nTrust Securitizations\nAMT Asset Subs\nSecured Tower Revenue Securities, Series 2023-1, Subclass A, Secured Tower Revenue Securities, Series 2023-1, Subclass R, Secured Tower Revenue Securities, Series 2018-1, Subclass A and Secured Tower Revenue Securities, Series 2018-1, Subclass R\n1.30x, Tested Quarterly (2)\n(3)(5)\n$540.1\n7.14x\n$526.4\n$540.0\n_______________\n(1)    Based on the net cash flow of the applicable issuer or borrower as of December 31, 2024 and the expenses payable over the next 12 months on the Series 2015-2 Notes or the Loan, as applicable.\n(2)    If the DSCR were equal to or below 1.30x (the “Cash Trap DSCR”) for any quarter, all cash flow in excess of amounts required to make debt service payments, fund required reserves, pay management fees and budgeted operating expenses and make other payments required under the applicable transaction documents, referred to as excess cash flow, will be deposited into a reserve account (the “Cash Trap Reserve Account”) instead of being released to the applicable issuer or borrower. Once triggered, a Cash Trap DSCR condition continues to exist until the DSCR exceeds the Cash Trap DSCR for two consecutive calendar quarters. \n(3)    An amortization period commences if the DSCR is equal to or below 1.15x (the “Minimum DSCR”) at the end of any calendar quarter and continues to exist until the DSCR exceeds the Minimum DSCR for two consecutive calendar quarters.\n(4)    No amortization period is triggered if the outstanding principal amount of a series has not been repaid in full on the applicable anticipated repayment date. However, in that event, additional interest will accrue on the unpaid principal balance of the applicable series, and that series will begin to amortize on a monthly basis from excess cash flow.\n(5)    An amortization period exists if the outstanding principal amount has not been paid in full on the applicable anticipated repayment date and continues to exist until the principal has been repaid in full. \nA failure to meet the noted DSCR tests could prevent GTP Acquisition Partners or the AMT Asset Subs from distributing excess cash flow to us, which could affect our ability to fund our capital expenditures, including tower construction and acquisitions and to meet REIT distribution requirements. During an “amortization period,” all excess cash flow and any amounts then in the applicable Cash Trap Reserve Account would be applied to pay the principal of the Series 2015-2 Notes or the Loan, as applicable, on each monthly payment date, and so would not be available for distribution to us. Further, additional interest will begin to accrue with respect to the Series 2015-2 Notes or subclass of the Loan from and after the anticipated repayment date at a per annum rate determined in accordance with the applicable agreement. With respect to the Series 2015-2 Notes, upon the occurrence of, and during, an event of default, the applicable trustee may, in its discretion or at the direction of holders of more than 50% of the aggregate outstanding principal of the Series 2015-2 Notes, declare the Series 2015-2 Notes immediately due and payable, in which case any excess cash flow would need to be used to pay holders of those notes. Furthermore, if GTP Acquisition Partners or the AMT Asset Subs were to default on the Series 2015-2 Notes or the Loan, the applicable trustee may seek to foreclose upon or otherwise convert the ownership of all or any portion of the 3,338 communications sites that secure the Series 2015-2 Notes or the 5,029 broadcast and wireless communications towers and related assets that secure the Loan, respectively, in which case we could lose those sites and their associated revenue.\nAs discussed above, we use our available liquidity and seek new sources of liquidity to fund capital expenditures, future growth and expansion initiatives, satisfy our distribution requirements and repay or repurchase our debt. If we determine that it is desirable or necessary to raise additional capital, we may be unable to do so, or such additional financing may be prohibitively expensive or restricted by the terms of our outstanding indebtedness. Further, as discussed under Item 1A of this Annual Report \n54\nTable of Contents\n \nunder the caption “Risk Factors,” market volatility and disruption caused by inflation, high interest rates and supply chain disruptions may impact our ability to raise additional capital through debt financing activities or our ability to repay or refinance maturing liabilities, or impact the terms of any new obligations. If we are unable to raise capital when our needs arise, we may not be able to fund capital expenditures, future growth and expansion initiatives, satisfy our REIT distribution requirements and debt service obligations, or refinance our existing indebtedness. \nIn addition, our liquidity depends on our ability to generate cash flow from operating activities. As set forth under Item 1A of this Annual Report under the caption “Risk Factors,” we derive a substantial portion of our current and projected future revenue from a small number of customers and, consequently, a failure by a significant customer to perform its contractual obligations to us could adversely affect our cash flow and liquidity.\nCritical Accounting Policies and Estimates\nManagement’s discussion and analysis of financial condition and results of operations are based upon our consolidated financial statements, which have been prepared in accordance with GAAP. The preparation of these financial statements requires us to make estimates and assumptions that affect the reported amounts of assets, liabilities, revenues and expenses, as well as related disclosures of contingent assets and liabilities. We evaluate our policies and estimates on an ongoing basis. Management bases its estimates on historical experience and various other assumptions that are believed to be reasonable under the circumstances, the results of which form the basis for making judgments about the carrying amounts of assets and liabilities that are not readily apparent from other sources. Actual results may differ from these estimates under different assumptions or conditions.\nWe have reviewed our policies and estimates to determine our critical accounting policies for the year ended December 31, 2024. We have identified the following policies as critical to an understanding of our results of operations and financial condition. This is not a comprehensive list of our accounting policies. See note 1 to our consolidated financial statements included in this Annual Report for a summary of our significant accounting policies. In many cases, the accounting treatment of a particular transaction is specifically dictated by GAAP, with no need for management’s judgment in its application. There are also areas in which management’s judgment in selecting any available alternative would not produce a materially different result.\n•\nAssets Held for Sale\n—We consider long-lived assets to be “held for sale” upon satisfaction of the following criteria: (a) management commits to a plan to sell an asset (or group of assets), (b) the asset is available for immediate sale in its present condition subject only to terms that are usual and customary for sales of such assets, (c) an active program to locate a buyer and other actions required to complete the plan to sell the asset have been initiated, (d) the sale of the asset is probable and transfer of the asset is expected to be completed within one year, (e) the asset is being actively marketed for sale at a price that is reasonable in relation to its current fair value and (f) actions required to complete the plan indicate that it is unlikely that significant changes to the plan will be made or that the plan will be withdrawn. Typically, these criteria are all met when the relevant assets are under contract, significant non-refundable deposits have been made by the potential buyer, the assets are immediately available for transfer and there are no contingencies related to the sale that may prevent the transaction from closing.\nAssets classified as held for sale are reported at the lesser of the carrying value, or estimated fair value, less estimated costs to sell and are not depreciated. We reassess the fair value less costs to sell of assets held for sale in each reporting period in which they are classified as held for sale. Gains (losses) on held for sale assets are recorded in Other operating income in the accompanying consolidated statements of operations.\n•\nDiscontinued Operations\n—We classify the results of operations related to a disposal of assets and liabilities (“the disposal group”) in discontinued operations in the consolidated statements of operations if all of the following criteria are met: (a) the operations and cash flows of the disposal group can be clearly distinguished from the rest of the Company, (b) the disposal group meets the criteria to be classified as held for sale (as described above) or has been sold or disposed of by other means and (c) the disposal represents a strategic shift that has or will have a major effect on our operations and financial results. \nThe results of operations classified as discontinued operations are reported in Loss from discontinued operations, net of taxes in the accompanying consolidated statements of operations for all periods presented. Historical financial information included in the notes to the consolidated financial statements is adjusted to reflect the classification of results of operations as discontinued operations. \n•\nAccounting for Long-Lived Assets—Change in Useful Lives: \nWe finalized our review of the estimated useful lives of our tower assets during the first quarter of 2024. We now have over 20 years of operating history, and determined that we should modify our current estimates for asset lives based on our historical operating experience. We previously depreciated our towers on a straight-line basis over the shorter of the term of the underlying ground lease (including renewal options) taking into account residual value or the estimated useful life of the tower, which we had historically \n55\nTable of Contents\n \nestimated to be 20 years. We determined that the estimated useful life of our tower assets is 30 years, before taking into account residual value. Depreciation expense is recorded using the straight-line method over the assets’ estimated useful lives. \nAdditionally, certain of our intangible assets are amortized on a similar basis to our tower assets, as the estimated useful lives of such intangible assets correlate to the useful life of the towers. The acquired network location intangibles represent the value of the incremental revenue growth that could potentially be obtained from leasing the excess capacity on acquired tower communications infrastructure. The acquired tenant-related intangibles typically represent the value of tenant contracts and relationships in place at the time of an acquisition or similar transaction, including assumptions regarding estimated renewals. Amortization expense for intangible assets is computed using the straight-line method over the estimated useful life of each of the intangible assets. The useful lives of our intangible assets are estimated based on the period over which the intangible asset is expected to benefit us. \nWe accounted for the changes in the useful lives as a change in accounting estimate under ASC 250 \nAccounting Changes and Error Corrections\n, which were recorded prospectively beginning on January 1, 2024. On January 1, 2024, we began depreciating our towers and related intangible assets on a straight-line basis over the remaining estimated useful life of the tower, taking into account the extended useful life and residual value. The extension of the asset lives (i) resulted in an approximately $515 million increase in the right of use asset, as additional renewal options may be included, with an offsetting adjustment made to increase the related operating lease liability and (ii) resulted in an estimated $730 million ($649 million after tax, or an increase of $1.39 per diluted share) decrease in depreciation and amortization expense for the year ended December 31, 2024.\n•\nImpairment of Assets—Assets Subject to Depreciation and Amortization\n: We review long-lived assets for impairment at least annually or whenever events, changes in circumstances or other indicators or evidence indicate that the carrying amount of our assets may not be recoverable. \nWe review our tower portfolio, network location intangible and right-of-use assets for indicators of impairment at the lowest level of identifiable cash flows, typically at an individual tower basis. Possible indicators include a tower not having current tenant leases or having expenses in excess of revenues. A cash flow modeling approach is utilized to assess recoverability and incorporates, among other items, the tower location, the tower location demographics, the timing of additions of new tenants, lease rates and estimated length of tenancy and ongoing cash requirements.\nWe review our tenant-related intangible assets on a tenant by tenant basis for indicators of impairment, such as high levels of turnover or attrition, non-renewal of a significant number of contracts or the cancellation or termination of a relationship. We assess recoverability by determining whether the carrying amount of the tenant-related intangible assets will be recovered primarily through projected undiscounted future cash flows. \nIf the sum of the estimated undiscounted future cash flows of our long-lived assets is less than the carrying amount of the assets, an impairment loss may be recognized. Key assumptions included in the undiscounted cash flows are future revenue projections, estimates of ongoing tenancies and operating margins. An impairment loss would be based on the fair value of the asset, which is based on an estimate of discounted future cash flows to be provided from the asset. We record any related impairment charge in the period in which we identify such impairment.  \n•\nImpairment of Assets—Goodwill:\n We review goodwill for impairment at least annually (as of December 31) or whenever events or circumstances indicate the carrying amount of an asset may not be recoverable. Goodwill is recorded in the applicable segment and assessed for impairment at the reporting unit level. We employ a discounted cash flow analysis when testing goodwill for impairment. The key assumptions utilized in the discounted cash flow analysis include current operating performance, terminal revenue growth rate, management’s expectations of future operating results and cash requirements, the current weighted average cost of capital and an expected tax rate. We compare the fair value of the reporting unit, as calculated under an income approach using future discounted cash flows, to the carrying amount of the applicable reporting unit. If the carrying amount exceeds the fair value, an impairment loss would be recognized for the amount of the excess. The loss recognized is limited to the total amount of goodwill allocated to that reporting unit.\nDuring the year ended December 31, 2023, the results of our annual goodwill impairment test indicated that the carrying amount of our Spain reporting unit exceeded its estimated fair value, as calculated under an income approach using future discounted cash flows. As a result, we recorded a goodwill impairment charge of $80.0 million. The key assumptions utilized in the discounted cash flow analysis include current operating performance, terminal revenue growth rate, management’s expectations of future operating results and cash requirements, the current weighted average cost of capital and an expected tax rate. The reduction in the fair value of the Spain reporting unit was due to an increase in the weighted average cost of capital. The goodwill impairment charge in Spain was recorded in Goodwill impairment in the accompanying consolidated statements of operations. \n56\nTable of Contents\n \nDuring the year ended December 31, 2024, no potential goodwill impairment was identified as the fair value of each of our reporting units was in excess of its carrying amount.\n•\nRevenue Recognition:\n Our revenue is derived from leasing the right to use our communications sites, the land on which the sites are located, the land underlying our customers’ sites and the space in our data center facilities (the “lease component”) and from the reimbursement of costs incurred in operating the communications sites and data center facilities and supporting the customers’ equipment as well as other services and contractual rights (the “non-lease component”). Most of our revenue is derived from leasing arrangements and is accounted for as lease revenue unless the timing and pattern of revenue recognition of the non-lease component differs from the lease component. If the timing and pattern of the non-lease component revenue recognition differs from that of the lease component, we separately determine the stand-alone selling prices and pattern of revenue recognition for each performance obligation.\nOur revenue from leasing arrangements, including fixed escalation clauses present in non-cancellable lease arrangements, is reported on a straight-line basis over the term of the respective leases when collectibility is probable. Escalation clauses tied to a consumer price index or other inflation-based indices, and other incentives present in lease agreements with our tenants, are excluded from the straight-line calculation. Total property straight-line revenues for the years ended December 31, 2024, 2023 and 2022 were $277.6 million, $465.4 million and $508.5 million, respectively. Amounts billed upfront in connection with the execution of lease agreements are initially deferred and reflected in Unearned revenue in the accompanying consolidated balance sheets and recognized as revenue over the terms of the applicable lease arrangements. Amounts billed or received for services prior to being earned are deferred and reflected in Unearned revenue in the accompanying consolidated balance sheets until the criteria for recognition have been met. Periodically, we provide lease incentives to our tenants. If incentives are present in our leases, they are evaluated to determine proper treatment and, to the extent present, are recorded in Other current assets and Other non-current assets in the consolidated balance sheets and amortized on a straight line basis over the corresponding lease term as a non-cash reduction to revenue. \nWe derive the largest portion of our revenues, corresponding trade receivables and the related deferred rent asset from a small number of customers in the telecommunications industry, with 60% of our revenues derived from four customers. In addition, we have concentrations of credit risk in certain geographic areas. We mitigate the concentrations of credit risk with respect to trade receivables and the related deferred rent assets by actively monitoring the creditworthiness of our customers. In recognizing customer revenue we assess the collectibility of both the amounts billed and the portion recognized on a straight-line basis. This assessment takes customer credit risk and business and industry conditions into consideration to ultimately determine the collectibility of the amounts billed. To the extent the amounts, based on management’s estimates, may not be collectible, recognition is deferred until such point as the uncertainty is resolved. Any amounts that were previously recognized as revenue and are subsequently determined to present a risk of collection are reserved as bad debt expense. Accounts receivable are reported net of allowances for doubtful accounts related to estimated losses resulting from a customer’s inability to make required payments and allowances for amounts invoiced whose collectibility is not reasonably assured.\n•\nRent Expense and Lease Accounting:\n Many of the leases underlying our tower sites and data centers have fixed rent escalations, which provide for periodic increases in the amount of ground rent payable over time. In addition, certain of our tenant leases require us to exercise available renewal options pursuant to the underlying ground lease if the tenant exercises its renewal option. Our calculation of the lease liability includes the term of the underlying ground lease plus all periods, if any, for which failure to renew the lease imposes an economic penalty to us such that renewal appears to be reasonably assured. \nWe recognize a right-of-use lease asset and lease liability for operating and finance leases. The right-of-use asset is measured as the sum of the lease liability, prepaid or accrued lease payments, any initial direct costs incurred and any other applicable amounts.\nThe calculation of the lease liability requires us to make certain assumptions for each lease, including lease term and discount rate implicit in each lease, which could significantly impact the gross lease obligation, the duration and the present value of the lease liability. When calculating the lease term, we consider the renewal, cancellation and termination rights available to us and the lessor. We determine the discount rate by calculating the incremental borrowing rate on a collateralized basis at the commencement of a lease or upon a change in the lease term.\n•\nIncome Taxes:\n Accounting for income taxes requires us to estimate the timing and impact of amounts recorded in our financial statements that may be recognized differently for tax purposes. To the extent that the timing of amounts recognized for financial reporting purposes differs from the timing of recognition for tax reporting purposes, deferred tax assets or liabilities are required to be recorded. We measure deferred tax assets and liabilities using enacted tax rates expected to apply to taxable income in the years in which those temporary differences and carryforwards are \n57\nTable of Contents\n \nexpected to be recovered or settled. The effect on deferred tax assets and liabilities as a result of a change in tax rates is recognized in income in the period that includes the enactment date. We do not expect to pay federal income taxes on our REIT taxable income.\nWe periodically review our deferred tax assets, and we record a valuation allowance if, based on the available evidence, it is more likely than not that some or all of the deferred tax assets will not be realized. Management assesses the available positive and negative evidence to estimate if sufficient future taxable income will be generated to use the existing deferred tax assets. Valuation allowances would be reversed as a reduction to the provision for income taxes, if related deferred tax assets are deemed realizable based on changes in facts and circumstances relevant to the assets’ recoverability.\nWe recognize the benefit of uncertain tax positions when, in management’s judgment, it is more likely than not that positions we have taken in our tax returns will be sustained upon examination, which are measured at the largest amount that is greater than 50% likely of being realized upon settlement. We adjust our tax liabilities when our judgment changes as a result of the evaluation of new information or information not previously available. Due to the complexity of some of these uncertainties, the ultimate resolution may result in a payment that is materially different from our current estimate of the tax liabilities. These differences will be reflected as increases or decreases to income tax expense in the period in which additional information is available or the position is ultimately settled under audit.\nAccounting Standards Update\nFor a discussion of recent accounting standards updates, see note 1 to our consolidated financial statements included in this Annual Report.",
  "item2": null
}