{
  "item1": "OVERVIEW Aon plc (which may referred “Aon,” “Company,” “we,” “us,” “our”) leading global professional services firm providing broad range Risk Capital Human Capital solutions. Through experience, global reach, comprehensive analytics, help clients meet rapidly changing, increasingly complex, interconnected challenges related risk people. committed accelerating innovation address unmet evolving client needs so clients better informed, better advised, able make better decisions protect grow business. Management remains focused strengthening Aon uniting firm through its Aon United strategy, capabilities delivered through Risk Capital Human Capital enabled data analytics deliver additional insight, connectivity, efficiency.",
  "item7": "Item 7. Management’s Discussion Analysis Financial Condition Results Operations EXECUTIVE SUMMARY 2024 FINANCIAL RESULTS Aon plc leading global professional services firm providing broad range Risk Capital Human Capital solutions. Through experience, global reach, comprehensive analytics, help clients meet rapidly changing, increasingly complex, interconnected challenges related risk people. committed accelerating innovation address unmet evolving client needs so clients better informed, better advised, able make better decisions protect grow business.",
  "item2": "Compensation benefits Information technology Depreciation fixed assets Amortization impairment intangible assets Other general expense Accelerating Aon United Program expenses Total operating expenses Other income (expense) Income before income taxes Less: Net income attributable redeemable nonredeemable noncontrolling interests Net income attributable Aon shareholders Diluted net income per share attributable Aon shareholders Weighted average ordinary shares outstanding - diluted segment results (unaudited) follows (in millions): Three Months Ended September 30, Corporate/Eliminations Compensation benefits Information technology Total operating expenses Nine Months Ended September 30, Corporate/Eliminations Compensation benefits Information technology Total operating expenses Corporate expenses/eliminations include governance costs, post-retirement benefits, other costs not directly attributable specific segment. Includes expenses related Depreciation fixed assets, Amortization impairment intangible assets, Accelerating Aon United Program expenses, Other general expenses. Total revenue increased $276 million, 7%, $4.0 billion third quarter 2025, compared prior year period. increase reflects 7% organic revenue growth 1% favorable impact foreign currency translation, partially offset 1% unfavorable impact acquisitions, divestitures other items."
}