{
  "source_file": "apa-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "ITEM 2\n.    \nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe following discussion relates to APA Corporation (APA or the Company) and its consolidated subsidiaries and should be read together with the Company’s Consolidated Financial Statements and accompanying notes included in Part I, \nItem 1—Financial Statements\n of this Quarterly Report on Form 10-Q, as well as related information set forth in the Company’s Consolidated Financial Statements, accompanying Notes to Consolidated Financial Statements, and Management’s Discussion and Analysis of Financial Condition and Results of Operations included in the Company’s Annual Report on Form 10-K for the fiscal year ended December 31, 2024.\nOverview\nAPA is an independent energy company that owns subsidiaries that explore for, develop, and produce crude oil, natural gas, and natural gas liquids (NGLs). The Company’s business has oil and gas operations in three geographic areas: the U.S., Egypt, and offshore the U.K. in the North Sea (North Sea). APA also has active development, exploration and appraisal operations ongoing in Suriname, as well as exploration interests in Uruguay, Alaska, and other international locations that may, over time, result in reportable discoveries and development opportunities. As a holding company, APA Corporation’s primary assets are its ownership interests in its consolidated subsidiaries.\nAPA believes energy underpins global progress, and the Company wants to be a part of the solution as society works to meet growing global demand for reliable and affordable energy. APA strives to meet those challenges while creating value for all its stakeholders.\nUncertainties in the global supply chain and financial markets impact oil supply and demand and contribute to commodity price volatility. These uncertainties include the impacts of ongoing international conflicts, inflation, current and potential tariffs or other trade barriers, global trade policies, and actions taken by foreign oil and gas producing nations, including OPEC+. Despite these uncertainties, the Company remains committed to its longer-term objectives: (1) to invest for long-term returns in pursuit of moderate, sustainable production growth; (2) to strengthen the balance sheet to underpin the generation of cash flow in excess of its upstream exploration, appraisal, and development capital program that can be directed to debt reduction, share repurchases, and other return of capital to its shareholders; and (3) to responsibly manage its cost structure regardless of the oil price environment.\nThe Company closely monitors hydrocarbon pricing fundamentals to reallocate capital as part of its ongoing planning process. APA’s diversified asset portfolio and operational flexibility provide the Company the ability to timely respond to near-term price volatility and effectively manage its investment programs accordingly. For additional detail on the Company’s forward capital investment outlook, refer to “Capital Resources and Liquidity” below.\nIn the first quarter of 2025, the Company announced a significant cost reduction initiative. The Company’s primary objective is to drive sustainable cost savings for the long-term and is targeting $350 million in annualized savings across G&A, LOE, and capital by the end of 2025 and an additional $50 million to $100 million by the end of 2026. This will include reducing the Company’s overhead costs, addressing the capital cost structure for its drilling, completions, and facility investments, and improving efficiencies of day-to-day field operating practices.\nThe Company remains committed to its capital return framework for equity holders to participate more directly and materially in cash returns. The Company believes returning 60 percent of free cash flow through dividends and share repurchases creates a good balance for providing near-term cash returns to shareholders while still recognizing the importance of longer-term balance sheet strengthening.\n•\nThe Company pays a quarterly dividend of $0.25 per share on its common stock. \n•\nBeginning in the fourth quarter of 2021 and through the end of the third quarter of 2025, the Company has repurchased 95.5 million shares of the Company’s common stock. Subsequent to the quarter ended September 30, 2025 through October 31, 2025, the Company repurchased 1.0 million shares, and as of October 31, 2025, the Company had remaining authorization to repurchase up to 23.6 million shares under the Company’s share repurchase programs.\n27\nFinancial and Operational Highlights\nIn the third quarter of 2025, the Company reported net income attributable to common stock of $205 million, or $0.57 per diluted share, compared to a net loss of $223 million, or $0.60 per diluted share, in the third quarter of 2024. In the first nine months of 2025, the Company reported net income attributable to common stock of $1.2 billion, or $3.20 per diluted share, compared to net income of $450 million, or $1.29 per diluted share, in the first nine months of 2024. The increase in net income in the third quarter and the first nine months of 2025 compared to the same prior-year periods was primarily driven by $1.1 billion of impairments recorded in the prior-year period. Lower operating expenses in the third quarter and first nine months of 2025, resulting largely from focused cost-reduction efforts undertaken in 2025, further contributed to the increase in net income.\nThe Company generated $3.7 billion of cash from operating activities during the first nine months of 2025, 45 percent higher than the first nine months of 2024. APA’s higher operating cash flows for the first nine months of 2025 were primarily driven by lower overall expenses, collection of outstanding receivables, and timing of other working capital items. The Company repurchased 10.2 million shares of its common stock for $215 million and paid $271 million in dividends to APA common stockholders during the first nine months of 2025. The Company exited the quarter with approximately $4.5 billion of debt, a reduction of $1.6 billion from year-end 2024.\nKey operational highlights include:\nUnited States\n•\nDaily boe production from the Company’s U.S. assets, which decreased 7 percent from the third quarter of 2024, accounted for 61 percent of the Company’s worldwide production during the third quarter of 2025. The Company averaged six drilling rigs in the Permian Basin, including four rigs in the Southern Midland Basin and two rigs in the Delaware Basin in the third quarter of 2025. The Company brought online 42 operated wells during the quarter. The Company’s core Permian Basin development program continues to represent the key growth area for its U.S. assets.\n•\nIn the Permian Basin, the Company is currently operating five rigs, reflecting improved capital efficiency while sustaining the pace of wells brought online. The Company anticipates continuing this level of activity to deliver consistent year-over-year oil production. Should oil prices decline, the Company may moderate activity in 2026 and further reduce capital spending, with minimal anticipated impact on 2026 oil volumes.\n•\nAPA holds approximately 750,000 MMBtu/d of firm capacity on various pipelines. As of September 30, 2025, the Company had open basis swap contracts which purchased NYMEX Henry Hub/Waha and sold NYMEX Henry Hub/HSC on approximately two-thirds of its firm transport capacity for 2025 and including swap contracts entered into subsequent to September 30, 2025, approximately one-third for 2026, thereby locking in a significant portion of cash flows associated with its marketing activities for the near term. Refer to \nNote 4—Derivative Instruments and Hedging Activities\n for further discussion of these basis swap agreements.\nInternational\n•\nIn Egypt, the Company averaged 12 drilling rigs and drilled 17 new productive wells during the third quarter of 2025. During the same period, the Company averaged 19 workover rigs as it continues to align its drilling and workover activity with a goal of driving improved capital efficiency. Third quarter 2025 gross and net production from the Company’s Egypt assets decreased 1 percent and increased 7 percent, respectively, from the third quarter of 2024.\n•\nIn Egypt, following the recent success of the gas program and the relative softening of oil prices, the Company expects one-third of its activities to be gas-focused and anticipates continued strong performance for the rest of the year, with realized gas prices increasing through the period.\n•\nThe Government of Egypt awarded the Company an additional two million net exploration acreage in the Western Desert. This new acreage expands on the Company’s existing position in the country. In addition to a signature bonus of $25 million, the Company has committed to a drilling program on the acreage that the Company believes it will be able to meet in the normal course of operations. The Government also helped facilitate significant payments in the third quarter, nearly eliminating EGPC’s past due receivables.\n28\nResults of Operations\nOil, Natural Gas, and Natural Gas Liquids Production Revenues\nRevenue\nThe Company’s production revenues and respective contribution to total revenues by country were as follows: \n \nFor the Quarter Ended\nSeptember 30,\nFor the Nine Months Ended \nSeptember 30,\n \n2025\n2024\n2025\n2024\n$ Value\n%\nContribution\n$ Value\n%\nContribution\n$ Value\n%\nContribution\n$ Value\n%\nContribution\n \n($ in millions)\nOil Revenues:\nUnited States\n$\n737 \n50 \n%\n$\n1,007 \n56 \n%\n$\n2,283 \n51 \n%\n$\n2,616 \n51 \n%\nEgypt\n(1)\n565 \n39 \n%\n673 \n37 \n%\n1,668 \n38 \n%\n2,003 \n39 \n%\nNorth Sea\n168 \n11 \n%\n117 \n7 \n%\n500 \n11 \n%\n517 \n10 \n%\nTotal\n(1)\n$\n1,470 \n100 \n%\n$\n1,797 \n100 \n%\n$\n4,451 \n100 \n%\n$\n5,136 \n100 \n%\nNatural Gas Revenues:\nUnited States\n$\n34 \n18 \n%\n$\n7 \n7 \n%\n$\n186 \n31 \n%\n$\n79 \n19 \n%\nEgypt\n(1)\n130 \n68 \n%\n81 \n79 \n%\n330 \n54 \n%\n231 \n56 \n%\nNorth Sea\n28 \n14 \n%\n15 \n14 \n%\n93 \n15 \n%\n104 \n25 \n%\nTotal\n(1)\n$\n192 \n100 \n%\n$\n103 \n100 \n%\n$\n609 \n100 \n%\n$\n414 \n100 \n%\nNGL Revenues:\nUnited States\n$\n134 \n94 \n%\n$\n153 \n97 \n%\n$\n474 \n95 \n%\n$\n436 \n95 \n%\nNorth Sea\n8 \n6 \n%\n5 \n3 \n%\n27 \n5 \n%\n21 \n5 \n%\nTotal\n(1)\n$\n142 \n100 \n%\n$\n158 \n100 \n%\n$\n501 \n100 \n%\n$\n457 \n100 \n%\nOil and Gas Revenues:\nUnited States\n$\n905 \n50 \n%\n$\n1,167 \n56 \n%\n$\n2,943 \n53 \n%\n$\n3,131 \n52 \n%\nEgypt\n(1)\n695 \n39 \n%\n754 \n37 \n%\n1,998 \n36 \n%\n2,234 \n37 \n%\nNorth Sea\n204 \n11 \n%\n137 \n7 \n%\n620 \n11 \n%\n642 \n11 \n%\nTotal\n(1)\n$\n1,804 \n100 \n%\n$\n2,058 \n100 \n%\n$\n5,561 \n100 \n%\n$\n6,007 \n100 \n%\n(1)    Includes revenues attributable to a noncontrolling interest in Egypt.\n29\nProduction\nThe Company’s production volumes by country were as follows:\n \nFor the Quarter Ended\nSeptember 30,\nFor the Nine Months Ended\nSeptember 30,\n2025\nIncrease\n(Decrease)\n2024\n2025\nIncrease\n(Decrease)\n2024\nOil Volume (b/d)\nUnited States\n121,225 \n(15)%\n143,299 \n123,343 \n1%\n122,138 \nEgypt\n(1)(2)\n89,493 \n(2)%\n91,673 \n87,304 \n(2)%\n88,725 \nNorth Sea\n23,518 \n10%\n21,334 \n24,672 \n(5)%\n25,888 \nTotal\n234,236 \n(9)%\n256,306 \n235,319 \n(1)%\n236,751 \nNatural Gas Volume (Mcf/d)\nUnited States\n523,271 \n12%\n467,615 \n538,906 \n14%\n473,997 \nEgypt\n(1)(2)\n374,236 \n25%\n300,418 \n345,907 \n20%\n287,953 \nNorth Sea\n34,712 \n84%\n18,911 \n31,842 \n(22)%\n41,042 \nTotal\n932,219 \n18%\n786,944 \n916,655 \n14%\n802,992 \nNGL Volume (b/d)\nUnited States\n72,709 \n(9)%\n79,474 \n76,565 \n7%\n71,690 \nNorth Sea\n1,501 \n176%\n543 \n1,278 \n10%\n1,164 \nTotal\n74,210 \n(7)%\n80,017 \n77,843 \n7%\n72,854 \nBOE per day\n(3)\nUnited States\n281,145 \n(7)%\n300,709 \n289,726 \n6%\n272,827 \nEgypt\n(1)(2)\n151,866 \n7%\n141,742 \n144,955 \n6%\n136,718 \nNorth Sea\n(4)\n30,804 \n23%\n25,029 \n31,257 \n(8)%\n33,892 \nTotal\n463,815 \n(1)%\n467,480 \n465,938 \n5%\n443,437 \n(1)    Gross oil, natural gas, and NGL production in Egypt were as follows:\nFor the Quarter Ended September 30,\nFor the Nine Months Ended September 30,\n \n2025\n2024\n2025\n2024\nOil (b/d)\n124,944 \n136,670 \n125,595 \n138,039 \nNatural Gas (Mcf/d)\n508,346 \n447,173 \n481,700 \n445,397 \n(2)    Includes net production volumes per day attributable to a noncontrolling interest in Egypt of:\nFor the Quarter Ended September 30,\nFor the Nine Months Ended September 30,\n \n2025\n2024\n2025\n2024\nOil (b/d)\n29,860 \n30,579 \n29,127 \n29,596 \nNatural Gas (Mcf/d)\n124,867 \n100,210 \n115,405 \n96,054 \n(3)    The table shows production on a boe basis in which natural gas is converted to an equivalent barrel of oil based on a 6:1 energy equivalent ratio. This ratio is not reflective of the price ratio between the two products.\n(4)    Average sales volumes from the North Sea for the third quarters of 2025 and 2024 were 32,832 boe/d and 19,374 boe/d, respectively, and 32,503 boe/d and 30,607 boe/d for the first nine months of 2025 and 2024, respectively. Sales volumes may vary from production volumes as a result of the timing of liftings.\n30\nPricing\nThe Company’s average selling prices by country were as follows:\n \nFor the Quarter Ended\nSeptember 30,\nFor the Nine Months Ended\nSeptember 30,\n2025\nIncrease\n(Decrease)\n2024\n2025\nIncrease\n(Decrease)\n2024\nAverage Oil Price – Per barrel\nUnited States\n$\n66.03 \n(14)%\n$\n76.34 \n$\n67.78 \n(13)%\n$\n78.16 \nEgypt\n68.63 \n(14)%\n79.88 \n69.99 \n(15)%\n82.41 \nNorth Sea\n69.78 \n(16)%\n83.36 \n70.99 \n(15)%\n83.67 \nTotal\n67.43 \n(14)%\n78.06 \n68.94 \n(14)%\n80.31 \nAverage Natural Gas Price – Per Mcf\nUnited States\n$\n0.71 \n344%\n$\n0.16 \n$\n1.27 \n108%\n$\n0.61 \nEgypt\n3.75 \n28%\n2.93 \n3.49 \n19%\n2.93 \nNorth Sea\n11.06 \n13%\n9.76 \n12.59 \n27%\n9.89 \nTotal\n2.25 \n57%\n1.43 \n2.45 \n30%\n1.89 \nAverage NGL Price – Per barrel\nUnited States\n$\n20.11 \n(4)%\n$\n20.91 \n$\n22.69 \n2%\n$\n22.20 \nNorth Sea\n40.42 \n(12)%\n45.93 \n44.49 \n(4)%\n46.47 \nTotal\n20.65 \n(3)%\n21.29 \n23.30 \n3%\n22.73 \nThird-Quarter 2025 compared to Third-Quarter 2024\nCrude Oil \n Crude oil revenues for the third quarter of 2025 totaled $1.5 billion, a $327 million decrease from the comparative 2024 quarter. A 14 percent decrease in average realized prices decreased third-quarter 2025 oil revenues by $245 million compared to the third quarter of 2024, while 9 percent lower average daily production decreased revenues by $82 million. Crude oil revenues accounted for 81 percent of total oil and gas production revenues and 51 percent of worldwide production in the third quarter of 2025. Crude oil prices realized in the third quarter of 2025 averaged $67.43 per barrel, compared with $78.06 per barrel in the comparative prior-year quarter.\nThe Company’s worldwide oil production decreased 22.1 Mb/d to 234.2 Mb/d during the third quarter of 2025 from the comparative prior-year period, primarily a result of the sale of non-core assets in the U.S. and natural production decline in the U.S. and the North Sea. These decreases were offset by drilling activity in the Permian Basin and downtime recovery in the North Sea.\nNatural Gas\n  Natural gas revenues for the third quarter of 2025 totaled $192 million, an $89 million increase from the comparative 2024 quarter. A 57 percent increase in average realized prices increased third-quarter 2025 natural gas revenues by $60 million compared to the third quarter of 2024, while 18 percent higher average daily production increased revenues by $29 million. Natural gas revenues accounted for 11 percent of total oil and gas production revenues and 33 percent of worldwide production during the third quarter of 2025. \nThe Company’s worldwide natural gas production increased 145.3 MMcf/d to 932.2 MMcf/d during the third quarter of 2025 from the comparative prior-year period, primarily a result of increased drilling activity in Egypt and downtime recovery in the North Sea. Natural gas production was also higher as a result of lower volume curtailments at Alpine High compared with the 2024 period in response to extreme Waha basis differentials. These increases were partially offset by the sale of non-core assets in the U.S. and natural production decline in the U.S. and North Sea.\nNGL \n NGL revenues for the third quarter of 2025 totaled $142 million, a $16 million decrease from the comparative 2024 quarter. A 7 percent lower average daily production decreased third-quarter 2025 NGL revenues by $11 million compared to the third quarter of 2024, while a 3 percent decrease in average realized prices decreased revenues by $5 million. NGL revenues accounted for 8 percent of total oil and gas production revenues and 16 percent of worldwide production during the third quarter of 2025.\n31\nThe Company’s worldwide NGL production decreased 5.8 Mb/d to 74.2 Mb/d during the third quarter of 2025 from the comparative prior-year period, primarily a result of the sale of non-core assets in the U.S. and natural production decline in the U.S. and the North Sea. These decreases were offset by drilling activity in the Permian Basin and downtime recovery in the North Sea.\nYear-to-Date 2025 compared to Year-to-Date 2024 \nCrude Oil\n  Crude oil revenues for the first nine months of 2025 totaled $4.5 billion, a $685 million decrease from the comparative 2024 period. A 14 percent decrease in average realized prices lowered oil revenues for the 2025 period by $726 million compared to the same prior-year period, while higher sales volumes, despite relatively flat average daily production, increased oil revenues by $41 million. Crude oil revenues accounted for 80 percent of total oil and gas production revenues and 50 percent of worldwide production for the first nine months of 2025. Crude oil prices realized during the first nine months of 2025 averaged $68.94 per barrel, compared to $80.31 per barrel in the comparative prior-year period. \nThe Company’s worldwide oil production stayed relatively flat in the first nine months of 2025 compared to the same prior-year period, the result of the sale of non-core assets in the U.S. and natural production decline, mostly offset by drilling activity in the Permian Basin and downtime recovery in the North Sea.\nNatural Gas\n  Natural gas revenues for the first nine months of 2025 totaled $609 million, a $195 million increase from the comparative 2024 period. A 30 percent increase in average realized prices increased natural gas revenues for the 2025 period by $123 million compared to the same prior-year period, while 14 percent higher average daily production increased revenues by $72 million. Natural gas revenues accounted for 11 percent of total oil and gas production revenues and 33 percent of worldwide production for the first nine months of 2025. \nThe Company’s worldwide natural gas production increased 113.7 MMcf/d to 917 MMcf/d in the first nine months of 2025 compared to the same prior-year period, primarily a result of increased drilling activity in Egypt and the Permian Basin coupled with the Callon acquisition in the U.S., and downtime recovery in the North Sea. Natural gas production was also higher as a result of reduced volume curtailments at Alpine High compared with the 2024 period in response to extreme Waha basis differentials. These increases were offset by the sale of non-core assets in the U.S., natural production decline in the U.S. and North Sea, and operational downtime in the U.S.\nNGL\n  NGL revenues for the first nine months of 2025 totaled $501 million, a $44 million increase from the comparative 2024 period. A 7 percent higher average daily production increased NGL revenues for the 2025 period by $33 million compared to the same prior-year period, while a 3 percent increase in average realized prices increased revenues by $11 million. NGL revenues accounted for 9 percent of total oil and gas production revenues and 17 percent of worldwide production for the first nine months of 2025. \nThe Company’s worldwide NGL production increased 5.0 Mb/d to 77.8 Mb/d in the first nine months of 2025 compared to the same prior-year period, primarily a result of increased drilling activity in the Permian Basin coupled with the Callon acquisition in the U.S. and downtime recovery in the North Sea. NGL production was also higher as a result of reduced volume curtailments at Alpine High compared with the 2024 period in response to extreme Waha basis differentials. These increases were offset by the sale of non-core assets in the U.S., natural production decline in the U.S. and North Sea, and operational downtime in the U.S.\nPurchased Oil and Gas Sales\nPurchased oil and gas sales represent volumes primarily attributable to domestic oil and gas purchases that were sold by the Company to fulfill oil and natural gas takeaway obligations and delivery commitments. Sales related to purchased volumes totaled $311 million and $473 million during the third quarters of 2025 and 2024, respectively, and $1.4 billion and $1.0 billion during the first nine months of 2025 and 2024, respectively. Purchased oil and gas sales were partially offset by associated purchase costs of $184 million and $292 million during the third quarters of 2025 and 2024, respectively, and $962 million and $665 million, respectively, during the first nine months of 2025 and 2024, respectively. Gross purchased oil and gas sales values were lower in the third quarter, primarily driven by lower oil volume sales and lower oil prices. Gross purchased oil and gas sales values were higher in the first nine months of 2025, primarily driven by higher natural gas prices and activity associated with the Callon acquisition.\n32\nOperating Expenses\nThe Company’s operating expenses were as follows and include costs attributable to a noncontrolling interest in Egypt:\n \nFor the Quarter Ended\nSeptember 30,\nFor the Nine Months Ended\nSeptember 30,\n \n2025\n2024\n2025\n2024\n \n(In millions)\nLease operating expenses\n$\n376 \n$\n418 \n$\n1,150 \n$\n1,216 \nGathering, processing, and transmission\n110 \n123 \n318 \n328 \nPurchased oil and gas costs\n184 \n292 \n962 \n665 \nTaxes other than income\n51 \n70 \n179 \n205 \nExploration\n22 \n29 \n95 \n248 \nGeneral and administrative\n95 \n92 \n259 \n270 \nTransaction, reorganization, and separation\n18 \n14 \n66 \n156 \nDepreciation, depletion, and amortization:\nOil and gas property and equipment\n557 \n588 \n1,716 \n1,589 \nGathering, processing, and transmission assets\n2 \n2 \n5 \n5 \nOther assets\n6 \n5 \n17 \n19 \nAsset retirement obligation accretion\n40 \n36 \n118 \n112 \nImpairments\n— \n1,111 \n— \n1,111 \nFinancing costs, net\n46 \n100 \n55 \n276 \nTotal Operating Expenses\n$\n1,507 \n$\n2,880 \n$\n4,940 \n$\n6,200 \nLease Operating Expenses (LOE)\nLOE decreased $42 million and $66 million from the third quarter and the first nine months of 2024, respectively. On a per-unit basis, LOE decreased 11 percent in each of the third quarter and the first nine months of 2025, respectively, when compared to the third quarter and the first nine months of 2024. The decrease in absolute costs when compared to the same prior-year periods was primarily driven by lower workover activity, continued cost reduction efforts in all operating areas, and the sale of non-core assets in the Permian Basin. The decrease in absolute costs for the first nine months of 2025 was partially offset by a full year of operating cost activity related to the Callon transaction.\nGathering, Processing, and Transmission (GPT)\nThe Company’s GPT expenses were as follows:\nFor the Quarter Ended\nSeptember 30,\nFor the Nine Months Ended\nSeptember 30,\n2025\n2024\n2025\n2024\n(In millions)\nThird-party processing and transmission costs\n$\n110 \n$\n123 \n$\n318 \n$\n305 \nMidstream service costs – Kinetik\n— \n— \n— \n23 \nTotal Gathering, processing, and transmission\n$\n110 \n$\n123 \n$\n318 \n$\n328 \nGPT costs decreased $13 million and $10 million from the third quarter and the first nine months of 2024, respectively. The decrease in third-party costs for the third quarter of 2025 was primarily driven by decreased oil and NGL production volumes in the U.S. partially offset by production volumes resulting from downtime recovery in the North Sea compared to the same prior-year period. The decrease in third-party costs for the first nine months of 2025 was driven by decreases in average transportation rates compared to the same prior-year period.\nPurchased Oil and Gas Costs\nPurchased oil and gas costs decreased $108 million and increased $297 million from the third quarter and the first nine months of 2024, respectively. The decrease in the third quarter of 2025 was primarily driven by decreased oil volume purchases, compared to the same prior-year periods. The increase in the first nine months of 2025 was primarily driven by increased oil volume purchases and gas volumes purchased at a higher rate coupled with activity associated with the Callon acquisition. With widening margins under third-party gas agreements, purchased oil and gas costs were more than offset by associated sales to fulfill oil and natural gas takeaway obligations and delivery commitments in the third quarter and first nine months of 2025, as discussed above.\n33\nTaxes Other Than Income\nTaxes other than income decreased $19 million and $26 million from the third quarter and the first nine months of 2024, respectively, primarily from lower severance taxes driven by lower oil prices and lower ad valorem taxes.\nExploration Expenses\nThe Company’s exploration expenses were as follows:\nFor the Quarter Ended\nSeptember 30,\nFor the Nine Months Ended\nSeptember 30,\n2025\n2024\n2025\n2024\n(In millions)\nUnproved leasehold impairments\n$\n— \n$\n1 \n$\n— \n$\n11 \nDry hole expense\n4 \n8 \n47 \n172 \nGeological and geophysical expense\n3 \n6 \n7 \n22 \nExploration overhead and other\n15 \n14 \n41 \n43 \nTotal Exploration\n$\n22 \n$\n29 \n$\n95 \n$\n248 \nExploration expenses decreased $7 million and $153 million from the third quarter and the first nine months of 2024, respectively. The decrease in expenses for the third quarter of 2025 was primarily driven by higher dry hole and seismic expenses in Alaska in the prior-year period. The decrease in expenses for the first nine months of 2025 was primarily driven by higher dry hole expenses in Alaska and Suriname in the prior-year period.\nGeneral and Administrative (G&A) Expenses\nG&A expenses increased $3 million and decreased $11 million from the third quarter and the first nine months of 2024, respectively. The increase in expenses for the third quarter of 2025 compared to the same prior-year period was primarily driven by higher cash-based stock compensation expense resulting from changes in the Company’s stock price and expected payouts for the Company’s performance programs, which were largely offset by the impacts of focused cost-reduction efforts on personnel and other overhead expenses. The decrease in expenses for the first nine months of 2025 compared with the prior-year period was primarily the result of these focused cost-reduction efforts.\nTransaction, Reorganization, and Separation (TRS) Costs\nTRS costs increased $4 million and decreased $90 million from the third quarter and the first nine months of 2024, respectively. TRS costs for 2025 were primarily associated with employee separations and other cost-saving initiatives, while TRS costs for 2024 comprised primarily expenses associated with the Callon merger.\nDepreciation, Depletion, and Amortization (DD&A)\nTotal DD&A expenses decreased $30 million and increased $125 million from the third quarter and the first nine months of 2024, respectively. The Company’s DD&A rate on its oil and gas properties decreased $0.81 per boe and increased $0.29 per boe from the third quarter and the first nine months of 2024, respectively. The decrease in DD&A absolute expenses and on a per boe basis for the third quarter of 2025 was primarily driven by lower DD&A rates resulting from the sale of non-core assets in the Permian Basin. For the first nine months of 2025, the Company’s higher DD&A rate on its oil and gas properties on a per boe basis was driven by year-end 2024 negative gas price-related reserve revisions in the U.S. Permian Basin. Higher absolute dollar amounts of DD&A for the first nine months of 2025 were directly impacted by these higher rates.\n34\nFinancing Costs, Net\nThe Company’s Financing costs were as follows:\n \nFor the Quarter Ended\nSeptember 30,\nFor the Nine Months Ended\nSeptember 30,\n \n2025\n2024\n2025\n2024\n \n(In millions)\nInterest expense\n$\n72 \n$\n109 \n$\n249 \n$\n302 \nAmortization of debt issuance costs\n2 \n1 \n6 \n4 \nCapitalized interest\n(12)\n(8)\n(32)\n(22)\nGain on extinguishment of debt\n(2)\n— \n(147)\n— \nInterest income\n(14)\n(2)\n(21)\n(8)\nTotal Financing costs, net\n$\n46 \n$\n100 \n$\n55 \n$\n276 \nNet financing costs decreased $54 million and $221 million from the third quarter and the first nine months of 2024, respectively. The lower overall interest expense was primarily a result of lower outstanding credit facility borrowings compared to the prior-year periods. The decrease in net financing costs during the first nine months of 2025 was further driven by gains on extinguishment of debt from the Company’s cash tender purchases during the first quarter of 2025.\nProvision for Income Taxes\nThe Company estimates its annual effective income tax rate in recording its quarterly provision for income taxes in the various jurisdictions in which the Company operates. Non-cash impairments on the carrying value of the Company’s oil and gas properties, gains and losses on the sale of assets, statutory tax rate changes, and other significant or unusual items are recognized as discrete items in the quarter in which they occur.\nThe Company’s effective income tax rate for the three and nine months ended September 30, 2025 differed from the U.S. federal statutory income tax rate of 21 percent due to taxes on foreign operations and a deferred tax expense related to the remeasurement of taxes in the U.K. as a result of the enactment of Finance Act 2025 on March 20, 2025. The Company’s effective income tax rate for the three and nine months ended September 30, 2024 differed from the U.S. federal statutory income tax rate of 21 percent due to taxes on foreign operations.\nOn March 20, 2025, Finance Act 2025 was enacted, receiving Royal Assent, and included amendments to the Energy (Oil and Gas) Profits Levy Act of 2022, increasing the levy from a 35 percent rate to a 38 percent rate, among other changes, effective for the period of November 1, 2024 through March 31, 2030. Under GAAP, the financial statement impact of new legislation is recorded in the period of enactment. Therefore, in the first quarter of 2025, the Company recorded a deferred tax expense of $76 million related to the remeasurement of the December 31, 2024 U.K. deferred tax liability.\nOn July 4, 2025, the U.S. enacted the One Big Beautiful Bill Act of 2025 (OBBBA). Among other changes, the OBBBA expanded and made permanent 100 percent bonus depreciation for eligible assets acquired and placed in service after January 19, 2025, and aligned the treatment of intangible drilling costs for CAMT purposes with regular tax treatment starting in 2026. The Company does not expect the OBBBA to have a material impact on total tax expense for the year ended December 31, 2025, as impacts to current tax expense are offset by impacts to deferred tax expense. In the third quarter of 2025, the Company has recorded a current tax benefit of $29 million fully offset by a deferred tax expense of the same amount.\nOn September 30, 2025, the Internal Revenue Service issued further interim guidance on CAMT. Among other changes, the guidance provided for a reduction to CAMT related to net operating loss utilization for regular federal income tax purposes. The Company does not expect this guidance to have a material impact on total tax expense for the year ended December 31, 2025, as impacts to current tax expense are offset by impacts to deferred tax expense. In the third quarter of 2025, the Company has recorded a current tax benefit of $60 million, fully offset by a deferred tax expense of the same amount.\nIn December 2021, the Organisation for Economic Co-operation and Development issued Pillar Two Model Rules introducing a new global minimum tax of 15 percent on a country-by-country basis, with certain aspects effective in certain jurisdictions on January 1, 2024. Although the Company continues to monitor enacted legislation to implement these rules in countries where the Company could be impacted, the Company does not expect that the Pillar Two framework will have a material impact on its consolidated financial statements. \n35\nThe Company and its subsidiaries are subject to U.S. federal income tax as well as income or capital taxes in various states and foreign jurisdictions. The Company’s tax reserves are related to tax years that may be subject to examination by the relevant taxing authority. \nCapital Resources and Liquidity\nOperating cash flows are the Company’s primary source of liquidity. The Company’s short-term and long-term operating cash flows are impacted by highly volatile commodity prices, as well as production costs and sales volumes. The Company expects commodity prices to continue to be volatile in the near term as a result of macroeconomic uncertainty, current and potential tariffs or trade barriers, supply chain disruptions, and concerns over a potential economic recession. Significant changes in commodity prices impact the Company’s revenues, earnings, and cash flows. These changes potentially impact the Company’s liquidity if costs do not trend with sustained decreases in commodity prices. Historically, costs have trended with commodity prices, albeit on a lag. Sales volumes also impact cash flows; however, they have a less volatile impact in the short term.\nThe Company’s long-term operating cash flows are dependent on reserve replacement and the level of costs required for ongoing operations. Cash investments are required to fund activity necessary to offset the inherent declines in production and proved crude oil and natural gas reserves. Future success in maintaining and growing reserves and production is highly dependent on the success of the Company’s drilling program and its ability to add reserves economically. Changes in commodity prices also impact estimated quantities of proved reserves.\nAt this time, the Company is unable to predict to what extent recent and potential changes in trade restrictions and tariffs will impact its business. If inflationary pressures from these and other economic conditions persist or worsen, the Company may incur additional operating costs. The Company will continue to monitor the impact and consequences of these factors on its operations.\nThe Company expects its full-year 2025 estimated upstream capital investment to be approximately $2.3 billion to $2.4 billion. During the third quarter of 2025, continued efficiency gains allowed the Company to further reduce the Permian rig count to five, while increasing oil production outlook for fourth quarter. In Egypt, following the ongoing momentum of the Company’s gas program and the relative softening of oil prices, the Company expects one-third of its activities to be gas-focused. APA remains committed to its capital return framework for equity holders to participate more directly and materially in cash returns through dividends and share repurchases\n.\nThe Company believes its available liquidity and capital resource alternatives, combined with proactive measures to adjust its capital budget to reflect volatile commodity prices and anticipated operating cash flows, will be adequate to fund short-term and long-term operations, including the Company’s capital development program, repayment of debt maturities, payment of dividends, share buy-back activity, and amounts that may ultimately be paid in connection with commitments and contingencies. \nThe Company may also elect to utilize available cash on hand, committed borrowing capacity, access to both debt and equity capital markets, or proceeds from the sale of nonstrategic assets for all other liquidity and capital resource needs.\nFor additional information, refer to Part I, Items 1 and 2—Business and Properties, and Item 1A—Risk Factors, in the Company’s Annual Report on Form 10-K for the fiscal year ended December 31, 2024.\n36\nSources and Uses of Cash\nThe following table presents the sources and uses of the Company’s cash and cash equivalents for the periods presented:\n \nFor the Nine Months Ended\nSeptember 30,\n \n2025\n2024\n \n(In millions)\nSources of Cash and Cash Equivalents:\nNet cash provided by operating activities\n$\n3,737 \n$\n2,584 \nFixed-rate debt borrowings\n846 \n— \nProceeds from commercial paper and revolving credit facilities, net\n— \n190 \nProceeds from term loan facility \n— \n1,500 \nProceeds from asset divestitures\n590 \n724 \nProceeds from sale of Kinetik Shares\n— \n428 \nOther\n— \n20 \nTotal Sources of Cash and Cash Equivalents\n5,173 \n5,446 \nUses of Cash and Cash Equivalents:\nAdditions to upstream oil and gas property\n$\n2,156 \n$\n2,153 \nLeasehold and property acquisitions\n20 \n64 \nPayments on commercial paper and revolving credit facilities, net\n333 \n— \nPayments on term loan facility\n900 \n500 \nPayment on Callon Credit Agreement\n— \n472 \nPayments on fixed-rate debt\n1,016 \n1,641 \nDividends paid to APA common stockholders\n271 \n260 \nDistributions to noncontrolling interest\n390 \n233 \nTreasury stock activity, net\n215 \n146 \nOther, net\n22 \n— \nTotal Uses of Cash and Cash Equivalents\n5,323 \n5,469 \nDecrease in Cash and Cash Equivalents\n$\n(150)\n$\n(23)\nSources of Cash and Cash Equivalents\nNet Cash Provided by Operating Activities\n  Operating cash flows are the Company’s primary source of capital and liquidity and are impacted, both in the short term and the long term, by volatile commodity prices. The factors that determine operating cash flows are largely the same as those that affect net earnings, with the exception of non-cash expenses such as DD&A, exploratory dry hole expense, asset impairments, asset retirement obligation accretion, and deferred income tax expense.\nNet cash provided by operating activities during the first nine months of 2025 totaled $3.7 billion, $1.1 billion higher from the first nine months of 2024, primarily due to collection of outstanding receivables, lower overall expenses, and timing of other working capital items.\nFor a detailed discussion of commodity prices, production, and operating expenses, refer to “Results of Operations” in this Item 2. For additional detail on the changes in operating assets and liabilities and the non-cash expenses that do not impact net cash provided by operating activities, refer to the Statement of Consolidated Cash Flows in the Consolidated Financial Statements set forth in Part I, Item 1, Financial Statements of this Quarterly Report on Form 10-Q.\nFixed-Rate Debt Borrowings\n  During the first nine months of 2025, the Company issued new notes for proceeds of $846 million, after deducting discounts and loan costs, to fund in part APA’s purchase of Apache notes in APA’s cash tender offers.\nProceeds from Asset Divestitures\n  The Company received $590 million and $724 million in proceeds from the divestitures of certain non-core assets during the first nine months of 2025 and 2024, respectively. For more information regarding the Company’s acquisitions and divestitures, refer to \nNote 2—Acquisitions and Divestitures\n in the Notes to Consolidated Financial Statements in Part I, Item 1 of this Quarterly Report on Form 10-Q.\n37\nUses of Cash and Cash Equivalents\nAdditions to Oil & Gas Property\n  During the first nine months of 2025 and 2024, exploration and development cash expenditures were $2.2 billion in each period. The capital investment is reflective of the Company’s plan to streamline capital deployment and the sale of certain non-core assets and leasehold in the Permian Basin. The Company operated an average of approximately 20 drilling rigs during the first nine months of 2025, compared to an average of approximately 23 drilling rigs during the first nine months of 2024.\nLeasehold and Property Acquisitions  \nDuring the first nine months of 2025 and 2024, the Company completed other leasehold and property acquisitions, primarily in the Permian Basin, for total cash consideration of $20 million and $64 million, respectively.\nPayments on Commercial Paper and Revolving Credit Facilities, Net\n  During the first nine months of 2025, the Company made net payments of $333 million on its commercial paper and U.S. dollar denominated syndicated credit facility borrowings. As of September 30, 2025, there were no outstanding borrowings under each of the Company’s commercial paper and U.S. dollar denominated syndicated credit facility.\nPayments on Term Loan Facility  \nDuring the first nine months of 2025 and 2024, the Company made a payment of $900 million\n \nand $500 million, respectively, on its syndicated term loan credit agreement and fully repaid the term loans. For additional details of this credit agreement, see “\nUnsecured Committed Term Loan Facility” \nin the Liquidity section below.\nPayments on Fixed-Rate Debt\n  During the first nine months of 2025, the Company settled its private exchange and cash tender offers for certain notes and debentures of Apache and made open market repurchases of indenture debt of APA and Apache, and Apache redeemed certain notes for aggregate cash payments of $1.0 billion, reflecting principal amounts, discount to par, and associated fees.\nDuring the first nine months of 2024, the Company financed Callon’s repayment pursuant to Callon’s cash tender offers for, and redemptions of all senior notes issued under Callon’s indentures for an aggregate cash payment amount of $1.6 billion, reflecting principal amounts, premium to par, and associated fees.\nThe Company may, and expects that Apache will continue to, reduce debt outstanding under its indentures from time to time.\nDividends Paid to APA Common Stockholders\n  During the first nine months of 2025 and 2024, the Company paid $271 million and $260 million, respectively, for dividends on its common stock. \nDistributions to Noncontrolling Interest  \nSinopec International Petroleum Exploration and Production Corporation (Sinopec) holds a one-third minority participation interest in the Company’s oil and gas operations in Egypt. During the first nine months of 2025 and 2024, the Company paid $390 million and $233 million, respectively, in cash distributions to Sinopec.\nTreasury Stock Activity, net  \nIn the first nine months of 2025, the Company repurchased 10.2 million shares at an average price of $21.08 per share and an aggregate purchase price of approximately $215 million, and as of September 30, 2025, the Company had remaining authorization to repurchase 24.6 million shares. In the first nine months of 2024, the Company repurchased 4.6 million shares at an average price of $31.72 per share and an aggregate purchase price of approximately $146 million.\nLiquidity\nThe following table presents a summary of the Company’s key financial indicators:\nSeptember 30,\n2025\nDecember 31,\n2024\n \n(In millions)\nCash and cash equivalents\n$\n475 \n$\n625 \nTotal debt – APA and Apache\n4,488 \n6,044 \nTotal equity\n6,863 \n6,362 \nAvailable committed borrowing capacity under syndicated credit facilities\n4,016 \n2,966 \nCash and Cash Equivalents\n  As of September 30, 2025, the Company had $475 million in cash and cash equivalents. The majority of the Company’s cash is invested in highly liquid, investment-grade instruments with maturities of three months or less at the time of purchase.\n38\nDebt\n  As of September 30, 2025, the Company had $4.5 billion in total debt outstanding, which consisted of notes and debentures of APA and Apache and finance lease obligations. As of September 30, 2025, current debt included $2 million of finance lease obligations and $211 million of APA and Apache notes coming due within the next year.\nIndenture Debt Activity\n  During the first nine months of 2025, the Company purchased in the open market and had canceled indebtedness issued under indentures of APA and Apache in an aggregate principal amount of $122 million for an aggregate purchase price of $112 million in cash, including accrued interest and broker fees, reflecting a discount to par of an aggregate $13 million. The Company recognized a $12 million gain on these repurchases. The repurchases were partially financed by APA’s borrowing under the Company’s commercial paper program. Refer to discussion of APA exchange and tender offers for Apache indenture debt below for further details regarding the gain on extinguishment of debt during the quarter ended March 31, 2025.\nAdditionally, on August 20, 2025, Apache redeemed the outstanding $51 million principal amount of 4.625% Notes due 2025, at a redemption price equal to 100 percent of their principal amount, plus accrued and unpaid interest to the redemption date.\nAPA Exchange and Tender Offers for Apache Indenture Debt  \nOn January 10, 2025, the Company settled its private exchange and cash tender offers for certain notes and debentures issued by Apache under its indentures. The Company also then settled its private offering of new notes to fund in part its purchase of Apache notes in APA’s cash tender offers. In settling these offerings pursuant to their respective terms:\n•\nAPA issued new notes and debentures under its indentures in aggregate principal amounts of (i) $2.5 billion in exchange for Apache notes and debentures tendered and accepted in APA’s exchange offers, (ii) $203 million in exchange for Apache notes tendered in the cash tender offers in excess of the stated maximum purchase amount or series caps, and (iii) $850 million in the new notes offering, comprised of $350 million aggregate principal amount of APA’s 6.10% Notes due 2035 and $500 million aggregate principal amount of APA’s 6.75% Notes due 2055.\n•\nIn addition to issuing the APA notes in the exchange offers, APA paid a total of $2.5 million in cash as part of the exchange consideration.\n•\nAPA paid a total of $869 million in cash in the tender offers (comprised of tender offer consideration, exchange consideration for tendered notes exchanged, early participation premium, and accrued interest) for the aggregate $1 billion in principal amount of Apache notes tendered and accepted in the cash tender offers. The Company recognized a gain of $135 million on these purchases, including broker fees and loan costs.\n•\nNet proceeds from the sale of the notes in APA’s new notes offering, after deducting the initial purchasers’ discounts and estimated offering expenses, were approximately $839 million and were used to fund in part APA’s purchase of Apache notes in APA’s cash tender offers.\n•\nEach series of APA notes and debentures issued in settlement of the exchange and tender offers had the same interest rate, maturity date, and interest payment dates and the same optional redemption prices (if any) as the corresponding series of Apache notes and debentures for which they were exchanged.\n•\nEach series of APA notes and debentures issued in settlement of the exchange and tender offers and new notes offering were fully and unconditionally guaranteed by Apache until the first time that the aggregate principal amount of indebtedness under senior notes and debentures outstanding under Apache’s existing indentures was less than $1 billion, which occurred in May 2025, after which Apache’s guarantees were terminated in accordance with their terms on May 16, 2025.\n39\n•\nAPA entered into two registration rights agreements, one covering notes and debentures issued in APA’s exchange and tender offers and one covering notes issued in APA’s new notes offering (each a Registration Rights Agreement). These offerings were not registered under the Securities Act of 1933, as amended (Securities Act), in reliance upon an exemption therefrom, and the APA notes and debentures issued pursuant to such offers are subject to certain transfer restrictions (collectively, the Unregistered Notes). Each Registration Rights Agreement required APA to use commercially reasonable efforts to cause to be filed and become effective under the Securities Act, a registration statement with respect to a registered offer to exchange each series of Unregistered Notes for registered notes and debentures issued by APA containing terms substantially identical in all material respects to the applicable series of Unregistered Notes (except that the registered notes and debentures do not contain terms with respect to transfer restrictions, registration rights applicable to the Unregistered Notes, or any increase in annual interest rate for failure to comply with such registration rights). In August 2025, APA filed such registration statement, and it became effective. On September 18, 2025, APA settled the exchange offers covered by such registration statement, issuing registered notes and debentures in the same aggregate principal amount as the Unregistered Notes accepted for exchange and canceled. Of the $3.6 billion aggregate principal amount of Unregistered Notes covered by the exchange offers, 99 percent was exchanged for registered notes and debentures, and the remaining Unregistered Notes remained outstanding.\nUnsecured 2025 Committed Credit Facilities\n  On January 15, 2025, the Company entered into two unsecured syndicated credit agreements for general corporate purposes:\n•\nOne agreement is denominated in US dollars (the 2025 USD Agreement) and provides for an unsecured five-year revolving credit facility for loans and letters of credit, with aggregate commitments of US$2.0 billion (including a letter of credit subfacility of up to US$750 million, of which US$250 million currently is committed). APA may increase commitments up to an aggregate US$2.5 billion by adding new lenders or obtaining the consent of any increasing existing lenders. This facility matures in January 2030, subject to the Company’s two, one-year extension options. \n•\nThe second agreement is denominated in pounds sterling (the 2025 GBP Agreement) and provides for an unsecured five-year revolving credit facility, with aggregate commitments of £1.5 billion for loans and letters of credit. This facility matures in January 2030, subject to the Company’s two, one-year extension options.\nApache guaranteed obligations under each of the 2025 USD Agreement and 2025 GBP Agreement (each, a 2025 Agreement) effective until the aggregate principal amount of indebtedness under senior notes and debentures outstanding under Apache’s existing indentures first was less than US$1.0 billion, which occurred in May 2025, after which Apache’s guarantees were terminated in accordance with their terms on May 16, 2025.\nThe 2025 Agreements replaced on substantially the same terms two syndicated credit agreements that the Company entered in April 2022: \n•\nOne agreement was denominated in US dollars (the 2022 USD Agreement) and provided for an unsecured five-year revolving credit facility, with aggregate commitments of US$1.8 billion (including a letter of credit subfacility of up to US$750 million, of which US$150 million was committed).\n•\nThe second agreement was denominated in pounds sterling (the 2022 GBP Agreement) and provided for an unsecured five-year revolving credit facility, with aggregate commitments of £1.5 billion for loans and letters of credit. \nOn January 15, 2025, the Company terminated commitments under both the 2022 USD Agreement and 2022 GBP Agreement in connection with entry into the 2025 Agreements.\nAs of September 30, 2025, there were no borrowings or letters of credit outstanding under the 2025 USD Agreement and an aggregate £1 million in letters of credit outstanding under the 2025 GBP Agreement. As of December 31, 2024, there were $10 million of borrowings and no letters of credit outstanding under the 2022 USD Agreement and an aggregate £303 million in letters of credit outstanding under the 2022 GBP Agreement.\nUncommitted Lines of Credit  \nEach of the Company and\n \nApache, from time to time, has and uses uncommitted credit and letter of credit facilities for working capital and credit support purposes. As of September 30, 2025 and December 31, 2024, there were no outstanding borrowings under these facilities. As of September 30, 2025, there were £817 million and $11 million in letters of credit outstanding under these facilities. As of December 31, 2024, there were £640 million and $11 million in letters of credit outstanding under these facilities.\n40\nCommercial Paper Program  \nThe Company has a commercial paper program under which it from time to time may issue in private placements exempt from registration under the Securities Act short-term unsecured promissory notes (CP Notes) up to a maximum aggregate face amount of $2.0 billion outstanding at any time. The program was established in December 2023, and the maximum aggregate face amount of CP Notes issuable thereunder was increased to $2.0 billion from $1.8 billion on June 20, 2025. The maturities of CP Notes may vary but may not exceed 397 days from the date of issuance. Outstanding CP Notes are supported by available borrowing capacity under the Company’s committed revolving credit facilities for general corporate purposes, which as of September 30, 2025, included the $2.0 billion 2025 USD Agreement.\nPayment of CP Notes was unconditionally guaranteed on an unsecured basis by Apache, such guarantee effective until the first time that the aggregate principal amount of indebtedness under senior notes and debentures outstanding under Apache’s existing indentures was less than US$1.0 billion, which occurred in May 2025, after which Apache’s guarantees were terminated in accordance with their terms on June 20, 2025.\nThe CP Notes are sold under customary market terms in the U.S. commercial paper market at a discount from par or at par and bear interest at rates determined at the time of issuance.\nAs of September 30, 2025, the Company had no CP Notes outstanding. As of December 31, 2024, the Company had $323 million in aggregate face amount of CP Notes outstanding, which was classified as long-term debt.\nUnsecured Committed Term Loan Facility\n \nOn January 30, 2024, APA entered into a syndicated credit agreement under which the lenders committed an aggregate $2.0 billion for senior unsecured delayed-draw term loans to APA (Term Loan Credit Agreement), the proceeds of which could be used to refinance certain indebtedness of Callon upon closings of APA’s acquisition of Callon and the Term Loan Credit Agreement. Of such aggregate commitments, $1.5 billion was for term loans that would mature three years after the date of such closings (3-Year Tranche Loans) and $500 million was for term loans that would mature 364 days after the date of such closings (364-Day Tranche Loans).\nOn April 1, 2024, APA acquired Callon and closed the transactions under the Term Loan Credit Agreement, electing to borrow an aggregate $1.5 billion in 3-Year Tranche Loans maturing April 1, 2027 and to allow the lender commitments for the 364-Day Tranche Loans to expire. \nAs of December 31, 2024, there were $900 million in 3-Year Tranche Loans remaining outstanding under the Term Loan Credit Agreement. APA could at any time prepay loans under the Term Loan Credit Agreement, which it elected to do on March 10, 2025, when APA fully repaid amounts outstanding under the Term Loan Credit Agreement. The repayment was partially financed with borrowings under APA’s 2025 USD Agreement and commercial paper program.\nOff-Balance Sheet Arrangements  \nThe Company enters into customary agreements in the oil and gas industry for drilling rig commitments, firm transportation agreements, and other obligations that may not be recorded on the Company’s consolidated balance sheet. For more information regarding these and other contractual arrangements, please refer to “Contractual Obligations” in Part II, Item 7 of APA’s Annual Report on Form 10-K for the fiscal year ended December 31, 2024. There have been no material changes to the contractual obligations described therein.\nPotential Decommissioning Obligations on Sold Properties\nIn 2013, Apache sold its Gulf of America (GOA) Shelf operations and properties and its GOA operating subsidiary, GOM Shelf LLC (GOM Shelf) to Fieldwood Energy LLC (Fieldwood). Fieldwood assumed the obligation to decommission the properties held by GOM Shelf and the properties acquired from Apache and its other subsidiaries (collectively, the Legacy GOA Assets). On February 14, 2018, Fieldwood filed for (and subsequently emerged from) Chapter 11 bankruptcy protection. On August 3, 2020, Fieldwood filed for (and subsequently emerged from) Chapter 11 bankruptcy protection for a second time. Upon emergence from this second bankruptcy, \nthe Legacy GOA Assets were separated into a standalone company, which was subsequently merged into GOM Shelf. Under GOM Shelf’s limited liability company agreement, the proceeds of production of the Legacy GOA Assets are to be used to fund the operation of GOM Shelf and the decommissioning of Legacy GOA Assets.\n \nPursuant to the terms of the original transaction, as amended in the first bankruptcy, \nthe securing of the asset retirement obligations for the Legacy GOA Assets as and when Apache is required to perform or pay for any such decommissioning was accomplished through the posting of letters of credit in favor of Apache (Letters of Credit), the provision of two bonds (Bonds) in favor of Apache, and the establishment of a trust account of which Apache was a beneficiary and which was funded by net profits interests (NPIs) depending on future oil prices. In addition, after such sources have been exhausted, Apache agreed upon resolution of GOM Shelf’s second bankruptcy to GOM Shelf loans of up to $400 million to perform decommissioning, with such loans and related obligations secured by first and prior liens on the Legacy GOA Assets.\n41\nBy letter dated April 5, 2022 (replacing two earlier letters) and by subsequent letter dated March 1, 2023, GOM Shelf notified the Bureau of Safety and Environmental Enforcement (BSEE) that it was unable to fund the decommissioning obligations that it was obligated to perform on certain of the Legacy GOA Assets. As a result, Apache and other current and former owners in these assets have received orders from BSEE and demands from third parties to decommission certain of the Legacy GOA Assets included in GOM Shelf’s notifications to BSEE. Apache expects to receive similar orders and demands on the other Legacy GOA Assets included in GOM Shelf’s notification letters. Apache has also received orders to decommission other Legacy GOA Assets that were not included in GOM Shelf’s notification letters. Further, Apache anticipates that GOM Shelf may send additional such notices to BSEE in the future and that it may receive additional orders from BSEE requiring it to decommission other Legacy GOA Assets. \nOn June 21, 2023, two sureties that issued Bonds directly to Apache and two sureties that issued bonds to the issuing bank on the Letters of Credit filed suit against Apache in a case styled \nZurich American Insurance Company, HCC International Insurance Company PLC, Philadelphia Indemnity Insurance Company and Everest Reinsurance Company (Insurers) v. Apache Corporation\n, Cause No. 2023-38238 in the 281\nst\n Judicial District Court, Harris County Texas. The sureties sought to prevent Apache from drawing on the $148 million in Bonds and $350 million in Letters of Credit and further alleged that they are discharged from their reimbursement obligations related to decommissioning costs and are entitled to other relief. The parties settled their dispute in the first quarter of 2025, which resulted in, among other things, mutual releases, the retention by Apache of all amounts drawn on the Letters of Credit, and payment to Apache of $140 million under the Bonds.\nAs of September 30, 2025, the Company recorded an asset of $40 million, representing the remaining amount the Company expects to be reimbursed from security related to these decommissioning costs. \nThe Company has also recorded contingent liabilities in the amounts of $1.0 billion for each of the periods ended September 30, 2025 and December 31, 2024, representing the estimated costs of decommissioning it may be required to perform on the Legacy GOA Assets. There have been no other changes in estimates from December 31, 2024 that would have a material impact on the Company’s financial position, results of operations, or liquidity.\nThe Company recognized $83 million in the first six months of 2024, respectively, of losses for estimated decommissioning costs on GOA properties previously sold to Fieldwood and other GOA operators.\n42"
}