{
  "source_file": "apa-20241231.htm",
  "form_type": "10-K",
  "item1": null,
  "item7": "ITEM 7.\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe following discussion relates to APA Corporation (APA or the Company) and its consolidated subsidiaries and should be read together in conjunction with the Company’s Consolidated Financial Statements and accompanying notes included in Part IV, Item 15 of this Annual Report on Form 10-K, and the risk factors and related information set forth in Part I, Item 1A and Part II, Item 7A of this Annual Report on Form 10-K. This section of this Annual Report on Form 10-K generally discusses 2024 and 2023 items and year-to-year comparisons between 2024 and 2023. Discussions of 2022 items and year-to-year comparisons between 2023 and 2022 that are not included in this Annual Report on Form 10-K are incorporated by reference to “Management’s Discussion and Analysis of Financial Condition and Results of Operations” in Part II, Item 7 of APA Corporation’s Annual Report on Form 10-K for the fiscal year ended December 31, 2023 (filed with the SEC on February 22, 2024).\nOverview\nAPA is an independent energy company that owns subsidiaries that explore for, develop, and produce crude oil, natural gas, and natural gas liquids (NGLs). The Company’s business has oil and gas operations in three geographic areas: the U.S., Egypt, and offshore the U.K. in the North Sea (North Sea). APA also has active development, exploration, and appraisal operations ongoing in Suriname, as well as exploration interests in Uruguay, Alaska, and other international locations that may, over time, result in reportable discoveries and development opportunities. As a holding company, APA Corporation’s primary assets are its ownership interests in its consolidated subsidiaries.\nAPA believes energy underpins global progress, and the Company wants to be a part of the solution as society works to meet growing global demand for reliable and affordable energy. APA strives to meet those challenges while creating value for all its stakeholders.\nUncertainties in the global supply chain and financial markets, including the impact of ongoing international conflicts, inflation, trade disputes, and actions taken by foreign oil and gas producing nations, including OPEC+, impact oil supply and demand and contribute to commodity price volatility. Despite these uncertainties, the Company remains committed to its longer-term objectives: (1) to invest for long-term returns in pursuit of moderate, sustainable production growth; (2) to strengthen the balance sheet to underpin the generation of cash flow in excess of its upstream exploration, appraisal, and development capital program that can be directed to debt reduction, share repurchases, and other return of capital to its shareholders; and (3) to responsibly manage its cost structure regardless of the oil price environment. \nThe Company closely monitors hydrocarbon pricing fundamentals to reallocate capital as part of its ongoing planning process. APA’s diversified asset portfolio and operational flexibility provide the Company the ability to timely respond to near-term price volatility and effectively manage its investment programs accordingly. For example, the Company curtailed production in the Permian Basin in the second half of 2024 in response to weakness in Waha natural gas and NGL prices; however, in Egypt, the Company contracted an additional drilling rig in late 2024 after signing an agreement to incentivize gas exploration and production at new pricing. In 2023, the Company decided to suspend drilling activity in the North Sea, as increasing cost and tax burdens impacted the competitiveness of these assets within the Company’s portfolio. Capital investment plans have accordingly been aligned across other areas of the portfolio while maintaining a focus on the Company’s capital returns framework.\nThe Company remains committed to its capital return framework for equity holders to participate more directly and materially in cash returns.\n•\nThe Company believes returning 60 percent of free cash flow through dividends and share repurchases creates a good balance for providing near-term cash returns to shareholders while still recognizing the importance of longer-term balance sheet strengthening.\n•\nThe Company pays a quarterly dividend of $0.25 per share on its common stock.  \n•\nBeginning in the fourth quarter of 2021 and through the end of 2024, the Company has repurchased 85.3 million shares of the Company’s common stock. Subsequent to year-end 2024 and through the date of this filing on February 28, 2025, the Company repurchased 3.9 million shares, and as of February 28, 2025, the Company had remaining authorization to repurchase up to 30.9 million shares under the Company’s share repurchase programs.\n34\nFinancial and Operational Highlights\nDuring 2024, the Company reported net income attributable to common stock of $804 million, or $2.27 per diluted share, compared to net income of $2.9 billion, or $9.25 per diluted share, in 2023. Net income in 2024 was primarily impacted by impairments of $1.1 billion, which included oil and gas property impairments of $796 million in the North Sea and $315 million in the U.S., and lower realized crude oil and natural gas prices during the year compared to 2023. The Company also recorded higher oil and gas revenues and associated operating expenses resulting from the Callon acquisition.\nThe Company generated $3.6 billion of cash from operating activities in 2024, which was $491 million or 16 percent higher than 2023. APA’s higher operating cash flows for 2024 were primarily driven by higher oil and gas revenues resulting from increased drilling activity in the Permian Basin and production from the acquired Callon properties, partially offset by lower realized commodity prices. The Company repurchased 9.2 million shares of its common stock for $246 million and paid $353 million in dividends to APA common stockholders during 2024.\nKey operational highlights for the year include:\nUnited States\n•\nDaily boe production from the Company’s U.S. assets, which increased 30 percent from 2023, accounted for 62 percent of the Company’s worldwide production during 2024. The Company averaged nine drilling rigs in the U.S. during the year, including five rigs in the Southern Midland Basin and four rigs in the Delaware Basin, and drilled and brought online 159 operated wells in 2024. The Company’s drilling was primarily focused on oil prospects, and combined with the Callon acquisition, oil production increased approximately 63 percent in the U.S. compared to the prior year. The Company’s core Permian Basin development program continues to represent key growth areas for the U.S. assets. \n•\nDuring the first quarter of 2024, the Company completed a three-well exploration program in Alaska, confirming a working petroleum system on the Company’s acreage. The Company is currently drilling an additional exploration well on this acreage. The Company holds a 50 percent ownership interest in the project.\nInternational\n•\nIn Egypt, the Company continued its drilling and workover activity with a focus on oil prospects. The Company averaged 14 drilling rigs and drilled 62 new productive wells during 2024. During the same period, the Company averaged 20 workover rigs as it continues to align its drilling and workover activity with a goal of driving improved capital efficiency. The 2024 gross and net production from the Company’s Egypt assets decreased 6 percent and 4 percent, respectively, from 2023.\n•\nDuring the fourth quarter of 2024, the Company entered into a new gas sales agreement which could result in improved pricing if certain production thresholds are met. The new gas sales agreement creates the potential for significant new drilling inventory with returns on par with oil.\n•\nDuring the second quarter of 2023, the Company suspended all new drilling activity in the North Sea. During the third quarter of 2024, the Company continued its economic assessment of its North Sea assets in light of several new regulatory guidelines and obligations surrounding significant tax levies and modernization of aging infrastructure. The Company determined the expected returns do not economically support making investments required under the combined impact of the regulations, and it will cease production at its facilities in the North Sea prior to 2030. The Company’s investment program in the North Sea is now directed toward asset safety and integrity.\n•\nIn October 2024, the Company announced that its subsidiary reached a positive final investment decision for the first oil development, named GranMorgu, in Block 58 offshore Suriname. This development will include production from the Krabdagu and Sapakara oil discoveries. These fields, located in water depths between 100 and 1,000 meters, will be produced through a system of subsea wells connected to a floating production, storage and offloading (FPSO) unit located 150 km off the Suriname coast, with an oil production capacity of 220,000 barrels per day. The GranMorgu FPSO unit is designed to accommodate future tie-back opportunities that would extend its 4-year production plateau and will feature technology that minimizes greenhouse gas emissions. Total investment is estimated at $10.5 billion, with APA’s share of the investment subject to the existing agreement with TotalEnergies to carry a portion of Apache’s appraisal and development capital. First oil is anticipated in 2028.\nFor a more detailed discussion related to the Company’s various geographic segments, refer to “Exploration and Production—Operating Areas” set forth in Part I, Items 1 and 2 of this Annual Report on Form 10-K.\n35\nAcquisition and Divestiture Activity\nOver the Company’s history, it has repeatedly demonstrated the ability to capitalize quickly and decisively on changes in its industry and economic conditions. A key component of this strategy is to continuously review and optimize APA’s portfolio of assets in response to these changes. Most recently, the Company has completed a series of acquisitions and divestitures designed to enhance the Company’s portfolio and monetize nonstrategic assets in order to allocate resources to more impactful exploration and development opportunities. These acquisitions and divestitures include:\n•\nCallon Petroleum Company Acquisition  \nOn April 1, 2024, APA completed its acquisition of Callon Petroleum Company (Callon) in an all-stock transaction valued at approximately $4.5 billion, inclusive of Callon’s debt (the Callon acquisition). The acquired assets include approximately 120,000 net acres in the Delaware Basin and 25,000 net acres in the Midland Basin. The Company believes the acquisition of Callon provides opportunities to reduce costs, improve capital efficiencies, leverage economies of scale, and expand the development inventory that formed the basis of the transaction value. \n•\nSale of Non-core Permian Basin Properties\n  On December 31, 2024, APA completed the sale of non-core producing properties in the Permian Basin that had a carrying value of $1.1 billion and associated asset retirement obligation of $224 million for total cash proceeds of $869 million after closing adjustments. The properties are located in the Central Basin Platform, Texas and New Mexico Shelf, and Northwest Shelf.\n•\nNon-core Acreage Divestiture \n During 2024, the Company completed the sale of non-core acreage in the East Texas Austin Chalk and Eagle Ford plays that had a carrying value of $347 million for aggregate cash proceeds of $255 million and the assumption of asset retirement obligations of $42 million.\n•\nMineral Rights Divestiture\n  During 2024, the Company also completed the sale of non-core mineral and royalty interests in the Permian Basin that had a carrying value of $71 million for approximately $394 million subject to post-closing adjustments.\n•\nSales of Kinetik Shares\n  During 2022 and 2023, the Company sold a portion of its Kinetik Shares for cash proceeds of $224 million and $228 million, respectively. During the first quarter of 2024, the Company sold its remaining shares of Kinetik Class A Common Stock for cash proceeds of $428 million. On April 3, 2024, the Company’s designated director resigned from the Kinetik Holdings, Inc. (Kinetik) board of directors.\nFor detailed information regarding APA’s acquisitions and divestitures, refer to \nNote 2—Acquisitions and Divestitures\n in the Notes to Consolidated Financial Statements set forth in Part IV, Item 15 of this Annual Report on Form 10-K.\n36\nResults of Operations\nOil, Natural Gas, and Natural Gas Liquids Production Revenues\nThe Company’s production revenues and respective contribution to total revenues by country are as follows:\n \nFor the Year Ended December 31,\n \n2024\n2023\n2022\n \n$ Value\n% Contribution\n$ Value\n% Contribution\n$ Value\n% Contribution\n \n($ in millions)\nOil Revenues:\nUnited States\n$\n3,572 \n51 \n%\n$\n2,241 \n37 \n%\n$\n2,458 \n36 \n%\nEgypt\n(1)\n2,620 \n38 \n%\n2,683 \n45 \n%\n3,145 \n46 \n%\nNorth Sea\n774 \n11 \n%\n1,073 \n18 \n%\n1,232 \n18 \n%\nTotal\n(1)\n$\n6,966 \n100 \n%\n$\n5,997 \n100 \n%\n$\n6,835 \n100 \n%\nNatural Gas Revenues:\nUnited States\n$\n126 \n22 \n%\n$\n297 \n34 \n%\n$\n918 \n59 \n%\nEgypt\n(1)\n313 \n53 \n%\n346 \n39 \n%\n370 \n23 \n%\nNorth Sea\n145 \n25 \n%\n237 \n27 \n%\n281 \n18 \n%\nTotal\n(1)\n$\n584 \n100 \n%\n$\n880 \n100 \n%\n$\n1,569 \n100 \n%\nNGL Revenues:\nUnited States\n$\n617 \n96 \n%\n$\n480 \n94 \n%\n$\n765 \n94 \n%\nEgypt\n(1)\n— \n— \n%\n— \n— \n%\n6 \n1 \n%\nNorth Sea\n29 \n4 \n%\n28 \n6 \n%\n45 \n5 \n%\nTotal\n(1)\n$\n646 \n100 \n%\n$\n508 \n100 \n%\n$\n816 \n100 \n%\nOil and Gas Revenues:\nUnited States\n$\n4,315 \n53 \n%\n$\n3,018 \n41 \n%\n$\n4,141 \n45 \n%\nEgypt\n(1)\n2,933 \n36 \n%\n3,029 \n41 \n%\n3,521 \n38 \n%\nNorth Sea\n948 \n11 \n%\n1,338 \n18 \n%\n1,558 \n17 \n%\nTotal\n(1)\n$\n8,196 \n100 \n%\n$\n7,385 \n100 \n%\n$\n9,220 \n100 \n%\n(1)\nIncludes revenues attributable to a noncontrolling interest in Egypt.\n37\nProduction\nThe following table presents production volumes by country:\n \nFor the Year Ended December 31,\n \n2024\nIncrease\n(Decrease)\n2023\nIncrease\n(Decrease)\n2022\nOil Volumes – b/d:\nUnited States\n128,531 \n63%\n78,889 \n12%\n70,398 \nEgypt\n(3)(4)\n89,027 \n—%\n89,129 \n5%\n85,081 \nNorth Sea\n26,340 \n(24)%\n34,728 \n7%\n32,578 \nTotal\n243,898 \n20%\n202,746 \n8%\n188,057 \nNatural Gas Volumes – Mcf/d:\nUnited States\n483,446 \n7%\n452,281 \n(4)%\n473,292 \nEgypt\n(3)(4)\n291,011 \n(11)%\n325,778 \n(9)%\n356,327 \nNorth Sea\n39,986 \n(20)%\n50,284 \n42%\n35,327 \nTotal\n814,443 \n(2)%\n828,343 \n(4)%\n864,946 \nNGL Volumes – b/d:\nUnited States\n73,877 \n17%\n62,997 \n—%\n62,727 \nEgypt\n(3)(4)\n— \nNM\n— \nNM\n196 \nNorth Sea\n1,201 \n(3)%\n1,240 \n12%\n1,111 \nTotal\n75,078 \n17%\n64,237 \n—%\n64,034 \nBOE per day:\n(1)\nUnited States\n282,983 \n30%\n217,266 \n2%\n212,007 \nEgypt\n(3)(4)\n137,529 \n(4)%\n143,425 \n(1)%\n144,665 \nNorth Sea\n(2)\n34,204 \n(23)%\n44,349 \n12%\n39,577 \nTotal\n454,716 \n12%\n405,040 \n2%\n396,249 \n(1)\nThe table shows production on a boe basis in which natural gas is converted to an equivalent barrel of oil based on a 6:1 energy equivalent ratio. This ratio is not reflective of the price ratio between the two products.\n(2)\nAverage sales volumes from the North Sea were 33,954 boe/d, 45,476 boe/d, and 40,812 boe/d for 2024\n, \n2023, and 2022, respectively. Sales volumes may vary from production volumes as a result of the timing of liftings.\n(3)\nGross oil, natural gas, and NGL production in Egypt were as follows:\n2024\n2023\n2022\nOil (b/d)\n137,150 \n141,985 \n137,260 \nNatural Gas (Mcf/d)\n443,551 \n500,080 \n555,562 \nNGL (b/d)\n— \n— \n297 \n(4)\nIncludes net production volumes per day attributable to a noncontrolling interest in Egypt of:\n2024\n2023\n2022\nOil (b/d)\n29,698 \n29,739 \n28,200 \nNatural Gas (Mcf/d)\n97,078 \n108,703 \n118,074 \nNGL (b/d)\n— \n— \n65 \nNM — Not Meaningful\n38\nPricing\nThe following table presents pricing information by country:\n \nFor the Year Ended December 31,\n \n2024\nIncrease\n(Decrease)\n2023\nIncrease\n(Decrease)\n2022\nAverage Oil Price - Per barrel:\nUnited States\n$\n75.92 \n(2)%\n$\n77.84 \n(19)%\n$\n95.68 \nEgypt\n80.41 \n(2)%\n82.47 \n(19)%\n101.25 \nNorth Sea\n80.74 \n(2)%\n82.75 \n(18)%\n100.87 \nTotal\n78.08 \n(3)%\n80.72 \n(19)%\n99.11 \nAverage Natural Gas Price - Per Mcf:\nUnited States\n$\n0.71 \n(61)%\n$\n1.80 \n(66)%\n$\n5.31 \nEgypt\n2.94 \n1%\n2.91 \n2%\n2.85 \nNorth Sea\n10.84 \n(17)%\n13.02 \n(44)%\n23.36 \nTotal\n1.97 \n(32)%\n2.91 \n(42)%\n4.98 \nAverage NGL Price - Per barrel:\nUnited States\n$\n22.83 \n9%\n$\n20.85 \n(38)%\n$\n33.41 \nEgypt\n— \nNM\n— \nNM\n76.80 \nNorth Sea\n47.59 \n—%\n47.77 \n(29)%\n67.07 \nTotal\n23.37 \n8%\n21.54 \n(38)%\n34.51 \nNM — Not Meaningful\nCrude Oil Prices  \nA substantial portion of the Company’s crude oil production is sold at prevailing market prices, which fluctuate in response to many factors that are outside of the Company’s control. Average realized crude oil prices for 2024 were down 3 percent compared to 2023, a direct result of decreasing benchmark oil prices over the past year. Crude oil prices realized in 2024 averaged $78.08 per barrel.\nContinued volatility in the commodity price environment reinforces the importance of the Company’s asset portfolio. While the market price received for natural gas varies among geographic areas, crude oil tends to trade within a global market. Prices for all types and grades of crude oil generally move in the same direction.\nNatural Gas Prices  \nNatural gas, which currently has a limited global transportation system, is subject to price variances based on local supply and demand conditions. The Company’s primary markets include North America, Egypt, and the U.K. An overview of the market conditions in the Company’s primary gas-producing regions follows:\n•\nThe Company sells its U.S. natural gas production at liquid index sales points within the U.S., at either monthly or daily index-based prices. The Company’s U.S. realizations averaged $0.71 per Mcf in 2024, a 61 percent decrease from an average of $1.80 per Mcf in 2023.\n•\nIn Egypt, the Company’s natural gas is sold to EGPC, primarily under an industry-pricing formula, a sliding scale based on Dated Brent crude oil with a minimum of $1.50 per MMBtu and a maximum of $2.65 per MMBtu, plus an upward adjustment for liquids content. Overall, the Company’s Egypt operations averaged $2.94 per Mcf in 2024, a one percent increase from an average of $2.91 per Mcf in 2023. In the fourth quarter of 2024, the Company entered into a new gas sales agreement, which could result in improved pricing if certain production thresholds are met. The new gas sales agreement, which is effective beginning January 2025, creates the potential for significant new drilling inventory with returns on par with oil.\n•\nNatural gas from the North Sea Beryl field is processed through the SAGE gas plant. The gas is sold to a third party at the St. Fergus entry point of the national grid on a National Balancing Point index price basis. The Company’s North Sea operations averaged $10.84 per Mcf in 2024, a 17 percent decrease from an average of $13.02 per Mcf in 2023.\n39\nNGL Prices  \nThe Company’s U.S. NGL production, which accounted for 98 percent of the Company’s total 2024 NGL production, is sold under contracts with prices at market indices based on Gulf Coast supply and demand conditions, less the costs for transportation and fractionation, or on a weighted-average sales price received by the purchaser.\nCrude Oil Revenues\nCrude oil revenues for 2024 totaled $7.0 billion, a $969 million increase from the 2023 total of $6.0 billion. A 20 percent higher average daily production increased 2024 revenues by $1.2 billion compared to 2023, while a 3 percent decrease in average realized prices reduced revenues by $196 million. Average daily production in 2024 was 244 Mb/d, with prices averaging $78.08 per barrel. Crude oil sales accounted for 85 percent of the Company’s 2024 oil and gas production revenues and 54 percent of its worldwide production.\nThe Company’s worldwide crude oil production increased 41 Mb/d compared to 2023, primarily a result of increased drilling activity in the Permian Basin coupled with the Callon acquisition. These increases were partially offset by natural production decline across all assets, the sale of non-core assets in the U.S., and operational downtime due to maintenance activities in the North Sea.\nNatural Gas Revenues\nNatural gas revenues for 2024 totaled $584 million, a $296 million decrease from the 2023 total of $880 million. A 32 percent decrease in average realized prices reduced 2024 revenues by $285 million compared to 2023, while 2 percent lower average daily production decreased revenues by $11 million. Average daily production in 2024 was 814 MMcf/d, with prices averaging $1.97 per Mcf. Natural gas sales accounted for 7 percent of the Company’s 2024 oil and gas production revenues and 30 percent of its worldwide production.\nThe Company’s worldwide natural gas production decreased 14 MMcf/d compared to 2023, primarily a result of natural production decline in the North Sea and U.S., reduced gas-focused activity in Egypt, curtailment of volumes at Alpine High in response to extreme Waha basis differentials, and the sale of non-core assets in the U.S. These decreases were partially offset by increased drilling activity in the Permian Basin coupled with the Callon acquisition.\nNGL Revenues\nNGL revenues for 2024 totaled $646 million, a $138 million increase from the 2023 total of $508 million. A 17 percent higher average daily production increased 2024 revenues by $95 million compared to 2023, while an 8 percent increase in average realized prices increased 2024 revenues by $43 million. Average daily production in 2024 was 75 Mb/d, with prices averaging $23.37 per barrel. NGL sales accounted for 8 percent of the Company’s 2024 oil and gas production revenues and 16 percent of its worldwide production.\nThe Company’s worldwide NGL production increased 11 Mb/d compared to 2023, primarily a result of increased drilling activity in the Permian Basin coupled with the Callon acquisition, partially offset by natural production decline in the U.S., curtailment of volumes at Alpine High in response to extreme Waha basis differentials, and the sale of non-core assets in the U.S.\nPurchased Oil and Gas Sales\nPurchased oil and gas sales represent volumes primarily attributable to domestic gas purchases that were sold by the Company to fulfill natural gas takeaway obligations and delivery commitments. Sales related to purchased volumes increased $647 million for the year ended December 31, 2024 to $1.5 billion from $894 million in 2023. Purchased oil and gas sales were partially offset by associated purchase costs of $1.0 billion and $742 million for the years ended December 31, 2024 and 2023, respectively. The increase in purchased oil and gas sales was primarily driven by increased oil volume sales coupled with activity associated with the Callon acquisition.\n40\nOperating Expenses\nThe table below presents a comparison of the Company’s operating expenses for the years ended December 31, 2024, 2023, and 2022. All operating expenses include costs attributable to a noncontrolling interest in Egypt.\n \nFor the Year Ended December 31,\n \n2024\n2023\n2022\n \n(In millions)\nLease operating expenses\n$\n1,690 \n$\n1,436 \n$\n1,444 \nGathering, processing, and transmission\n432 \n334 \n367 \nPurchased oil and gas costs\n1,047 \n742 \n1,776 \nTaxes other than income\n270 \n207 \n268 \nExploration\n313 \n195 \n305 \nGeneral and administrative\n372 \n351 \n483 \nTransaction, reorganization, and separation\n168 \n15 \n26 \nDepreciation, depletion, and amortization:\nOil and gas property and equipment\n2,235 \n1,500 \n1,186 \nGathering, processing, and transmission assets\n6 \n6 \n15 \nOther assets\n25 \n34 \n32 \nAsset retirement obligation accretion\n148 \n116 \n117 \nImpairments\n1,129 \n61 \n— \nFinancing costs, net\n367 \n312 \n379 \nLease Operating Expenses (LOE)\n \nLOE includes several key components, such as direct operating costs, repairs and maintenance, and workover costs. Direct operating costs generally trend with commodity prices and are impacted by the type of commodity produced and the location of properties (i.e., offshore, onshore, remote locations, etc.). Fluctuations in commodity prices impact operating cost elements both directly and indirectly. They directly impact costs such as power, fuel, and chemicals, which are commodity price based. Commodity prices also affect industry activity and demand, thus indirectly impacting the cost of items such as rig rates, labor, boats, helicopters, materials, and supplies. Crude oil, which accounted for 54 percent of the Company’s total 2024 production, is inherently more expensive to produce than natural gas. Repair and maintenance costs are typically higher on offshore properties.\nDuring 2024, LOE increased $254 million, or 18 percent, compared to 2023. On a per-boe basis, LOE increased $0.48, or 5 percent, compared to 2023, from $9.68 per boe to $10.16 per boe. The increase in absolute costs was primarily driven by higher operating and labor costs and workover activity associated with the Callon acquisition. The Company also had higher labor costs and other operating costs trending with general inflation across all regions, which were partially offset by changes in foreign currency exchange rates against the U.S. dollar.\n41\nGathering, Processing, and Transmission (GPT)\nGPT expenses include amounts paid to third-party carriers for gathering and transmission services for the Company’s upstream natural gas production. Prior to the BCP Business Combination and the Company’s deconsolidation of Altus on February 22, 2022, GPT expenses also included gathering and transmission services provided by Altus Midstream and midstream operating costs incurred by Altus. The following table presents a summary of these expenses:\nFor the Year Ended December 31,\n2024\n2023\n2022\n(In millions)\nThird-party processing and transmission costs\n$\n409 \n$\n225 \n$\n269 \nMidstream service costs – ALTM\n— \n— \n18 \nMidstream service costs – Kinetik\n23 \n109 \n93 \nUpstream processing and transmission costs\n432 \n334 \n380 \nMidstream operating expenses\n— \n— \n5 \nIntersegment eliminations\n— \n— \n(18)\nTotal Gathering, processing, and transmission\n$\n432 \n$\n334 \n$\n367 \nGPT costs increased $98 million compared to 2023, primarily the result of increased oil and NGL production volumes in the U.S., primarily associated with the Callon acquisition, as well as increased charges for transporting gas production.\nPurchased Oil and Gas Costs\n \nPurchased oil and gas costs increased $305 million for the year ended December 31, 2024, to $1.0 billion from $742 million in 2023. The increase is primarily driven by increased oil volume purchases coupled with activity associated with the Callon acquisition during 2024, partially offset by lower average natural gas prices during 2024 compared to the prior-year period. With widening margins under third-party gas agreements, purchased oil and gas costs were more than offset by associated sales to fulfill natural gas takeaway obligations and delivery commitments totaling $1.5 billion for the year ended 2024, as discussed above.\nTaxes Other Than Incom\ne\nTaxes other than income primarily consist of severance taxes on onshore properties and in state waters off the coast of the U.S. and ad valorem taxes on U.S. properties. Severance taxes are generally based on a percentage of oil and gas production revenues. The Company is also subject to a variety of other taxes, including U.S. franchise taxes.\nTaxes other than income increased $63 million compared to 2023, primarily from higher severance taxes driven by increased U.S. production volumes primarily attributable to the Callon acquisition.\nExploration Expenses\nExploration expenses include unproved leasehold impairments, exploration dry hole expense, geological and geophysical expenses, and the costs of maintaining and retaining unproved leasehold properties. The following table presents a summary of these expenses:\nFor the Year Ended December 31,\n2024\n2023\n2022\n(In millions)\nUnproved leasehold impairments\n$\n35 \n$\n22 \n$\n24 \nDry hole expenses\n201 \n92 \n183 \nGeological and geophysical expenses\n21 \n19 \n23 \nExploration overhead and other\n56 \n62 \n75 \nTotal Exploration\n$\n313 \n$\n195 \n$\n305 \nExploration expenses increased $118 million compared to 2023, primarily the result of dry hole expense associated with an exploration well in Suriname and the completion of an initial drilling campaign in Alaska, where two wells were unable to reach target objectives in the allotted seasonal time window.\n42\nGeneral and Administrative (G&A) Expenses\nG&A expenses increased $21 million compared to 2023, primarily driven by higher overall labor costs across the Company and the Callon acquisition, partially offset by lower cash-based stock compensation expense resulting from changes in the Company’s stock price in 2024. For additional information refer to \nNote 13—Capital Stock\n in the Notes to Consolidated Financial Statements set forth in Part IV, Item 15 of this Annual Report on Form 10-K.\nTransaction, Reorganization, and Separation (TRS) Costs\nTRS costs increased $153 million compared to 2023, primarily a result of transaction costs related to the Callon acquisition coupled with separation costs in the North Sea. TRS costs incurred in 2024 primarily comprised $147 million associated with the Callon acquisition, including $76 million of separation costs and $71 million of transaction and integration costs.\nDepreciation, Depletion and Amortization (DD&A)\nDD&A expenses on the Company’s oil and gas property for the year ended December 31, 2024 increased $735 million compared to 2023. The Company’s oil and gas property DD&A rate increased $3.32 per boe in 2024 compared to 2023, from $10.12 per boe to $13.44 per boe, driven by negative gas price-related reserve revisions in the U.S. Permian Basin and impacts resulting from the Callon acquisition in 2024. The increase on an absolute basis was also driven by higher capital expenditures incurred in the U.S. and the Callon acquisition.\nImpairments\nDuring 2024, the Company recorded $1.1 billion of impairments, which included $796 million of oil and gas property impairments in the North Sea, a $315 million impairment of certain oil and gas properties in the U.S. to agreed-upon proceeds for their disposition, and $18 million of inventory impairments in the North Sea and U.S. During 2023, the Company recorded $61 million of impairments, primarily in connection with valuations of drilling and operations equipment inventory upon the Company’s decision to suspend drilling operations in the North Sea.\nFinancing Costs, Net  \nFinancing costs incurred during 2024, 2023, and 2022 comprised the following:\n \nFor the Year Ended December 31,\n \n2024\n2023\n2022\n \n(In millions)\nInterest expense\n$\n402 \n$\n351 \n$\n332 \nAmortization of debt issuance costs\n6 \n4 \n8 \nCapitalized interest\n(29)\n(24)\n(18)\nLoss (gain) on extinguishment of debt\n— \n(9)\n67 \nInterest income\n(12)\n(10)\n(10)\nTotal Financing costs, net\n$\n367 \n$\n312 \n$\n379 \nNet financing costs during 2024 increased $55 million compared to 2023, primarily driven by higher interest expense from higher average long-term debt balances.\n43\nProvision for Income Taxes \n \nIncome tax expense increased $741 million from an income tax benefit of $324 million during 2023 to an income tax expense of $417 million during 2024. The Company’s 2024 effective income tax rate was primarily impacted by taxes related to foreign operations. During 2023, the Company’s effective income tax rate was primarily impacted by a deferred tax benefit related to the release of a portion of its valuation allowance against U.S. deferred tax assets and a deferred tax expense related to the remeasurement of taxes in the U.K. as a result of the enactment of Finance Act 2023 on January 10, 2023.\nOn July 14, 2022, the Energy (Oil and Gas) Profits Levy Act of 2022 (the Energy Profits Levy) was enacted, receiving Royal Assent. Under the law, an additional levy was assessed at a 25 percent rate, effective for the period of May 26, 2022 through December 31, 2025. The Finance Act 2023 included amendments to the Energy Profits Levy that increased the levy from a 25 percent rate to a 35 percent rate, effective for the period of January 1, 2023 through March 31, 2028. As a result, the Company recorded a deferred tax expense of $174 million and $208 million related to the remeasurement of the U.K. deferred tax liability in 2023 and 2022, respectively\n.\nOn August 16, 2022, the U.S. enacted the Inflation Reduction Act of 2022 (IRA). The IRA includes a new 15 percent corporate alternative minimum tax (CAMT) on applicable corporations with an average annual adjusted financial statement income that exceeds $1.0 billion for any three consecutive years preceding the tax year at issue. The CAMT is effective for tax years beginning after December 31, 2022. The Company became an applicable corporation subject to CAMT beginning on January 1, 2024. On September 12, 2024, the U.S. Department of Treasury and the Internal Revenue Service released proposed regulations relating to the application and implementation of CAMT. In 2024, the Company accrued tax expense of $74 million, which results in a tax credit that can be carried forward indefinitely to offset regular federal income tax expense in subsequent years.\nIn December 2021, the Organisation for Economic Co-operation and Development issued Pillar Two Model Rules introducing a new global minimum tax of 15 percent on a country-by-country basis, with certain aspects effective in certain jurisdictions on January 1, 2024. Although the Company continues to monitor enacted legislation to implement these rules in countries where the Company could be impacted, the Company does not expect that the Pillar Two framework will have a material impact on its consolidated financial statements.\nDeferred tax assets are recorded for future deductible amounts and certain other tax benefits, such as net operating losses, tax credits and other tax attributes, provided that the Company assesses the utilization of such assets to be “more likely than not.” The Company assesses the available positive and negative evidence to estimate whether sufficient future taxable income will be generated to realize the existing deferred tax assets. Based on this assessment, the Company has recorded valuation allowances for certain net operating losses, foreign tax credits and capital loss carryforwards that it does not believe are more likely than not to be realized.\nDuring the fourth quarter of 2023, as a result of increases in projections of future taxable income and the absence of objective negative evidence such as a cumulative loss in recent years, the Company determined there was sufficient positive evidence to release a majority of the U.S. valuation allowance, which resulted in a non-cash deferred income tax benefit of $1.7 billion.\nFor additional information regarding income taxes, refer to \nNote 10—Income Taxes\n in the Notes to Consolidated Financial Statements set forth in Part IV, Item 15 of this Annual Report on Form 10-K.\nThe Company and its subsidiaries are subject to U.S. federal income tax as well as income or capital taxes in various states and foreign jurisdictions. The Company’s tax reserves are related to tax years that may be subject to examination by the relevant taxing authority. The Company is under audit by the Internal Revenue Service and in various states and foreign jurisdictions as part of its normal course of business.\n44\nCapital and Operational Outlook\nThe Company continues to prudently manage its capital program against a volatile price environment and the effects of global inflation and rising interest rates. Despite these uncertainties, the Company remains committed to its longer-term objectives: (1) to invest for long-term returns in pursuit of moderate, sustainable production growth; (2) to strengthen the balance sheet to underpin the generation of cash flow in excess of its upstream exploration, appraisal, and development capital program that can be directed to debt reduction, share repurchases, and other return of capital to its shareholders; and (3) to responsibly manage its cost structure regardless of the oil price environment. \nIn 2025, the Company plans to invest $2.5 billion to $2.6 billion in upstream capital investment. The Company is planning an 8-rig program in the Permian Basin, with approximately four rigs in each of the Midland and Delaware basins, and a 12-rig program in Egypt, with one rig dedicated to gas appraisal and exploration. This activity set translates to a combined development capital budget for the Permian Basin and Egypt of $2.2 billion to $2.3 billion. In addition, the Company will invest approximately $200 million for Suriname development and $100 million for exploration, primarily in Alaska. \nBased on this development capital budget, the Company anticipates production in 2025 to be slightly higher compared to 2024. This investment profile underscores the progress the Company has made on capital efficiency through the integration of Callon and stabilization of Egypt volumes. At current strip pricing, the Company expects to generate significant cash flow over this capital activity budget. The Company’s current commitment to return capital to shareholders through a mix of dividends and share buybacks remains unchanged.\nCapital Resources and Liquidity\nOperating cash flows are the Company’s primary source of liquidity. The Company’s short-term and long-term operating cash flows are impacted by highly volatile commodity prices, as well as production costs and sales volumes. Significant changes in commodity prices impact the Company’s revenues, earnings, and cash flows. These changes potentially impact the Company’s liquidity if costs do not trend with sustained decreases in commodity prices. Historically, costs have trended with commodity prices, albeit on a lag. Sales volumes also impact cash flows; however, they have a less volatile impact in the short term.\nThe Company’s long-term operating cash flows are dependent on reserve replacement and the level of costs required for ongoing operations. Cash investments are required to fund activity necessary to offset the inherent declines in production and proved crude oil and natural gas reserves. Future success in maintaining and growing reserves and production is highly dependent on the success of the Company’s drilling program and its ability to add reserves economically. Changes in commodity prices also impact estimated quantities of proved reserves. \nFor the year ended December 31, 2024, the Company recognized downward reserve revisions related to decreases in commodity prices during the year. The Company’s estimates of proved reserves, proved developed reserves, and PUD reserves as of December 31, 2024, 2023, and 2022, changes in estimated proved reserves during the last three years, and estimates of future net cash flows from proved reserves are contained in \nNote 17—Supplemental Oil and Gas Disclosures (Unaudited)\n in the Notes to Consolidated Financial Statements set forth in Part IV, Item 15 of this Annual Report on Form 10-K.\nThe Company believes its available liquidity and capital resource alternatives, combined with proactive measures to adjust its capital budget to reflect volatile commodity prices and anticipated operating cash flows, will be adequate to fund short-term and long-term operations, including the Company’s capital development program, repayment of debt maturities, payment of dividends, share buy-back activity, and amounts that may ultimately be paid in connection with commitments and contingencies. \nThe Company may also elect to utilize available cash on hand, committed borrowing capacity, access to both debt and equity capital markets, or proceeds from the sale of nonstrategic assets for all other liquidity and capital resource needs.\nFor additional information, refer to \nPart I, Items 1 and 2—Business and Properties\n and \nPart I, Item 1A—Risk Factors\n of this Annual Report on Form 10-K.\n45\nSources and Uses of Cash\nThe following table presents the sources and uses of the Company’s cash and cash equivalents for the years presented:\n \nFor the Year Ended December 31,    \n \n2024\n2023\n2022\n \n(In millions)\nSources of Cash and Cash Equivalents:\nNet cash provided by operating activities\n$\n3,620 \n$\n3,129 \n$\n4,943 \nProceeds from commercial paper and revolving credit facilities, net\n— \n— \n24 \nProceeds from asset divestitures\n1,609 \n29 \n778 \nProceeds from term loan facility\n1,500 \n— \n— \nProceeds from sale of Kinetik shares\n428 \n228 \n224 \nTotal Sources of Cash and Cash Equivalents\n7,157 \n3,386 \n5,969 \nUses of Cash and Cash Equivalents:\nAdditions to oil and gas property\n(1)\n2,851 \n2,313 \n1,770 \nAcquisition of Delaware Basin properties\n— \n24 \n591 \nLeasehold and property acquisitions\n60 \n20 \n37 \nPayments on term loan facility\n600 \n— \n— \nPayments on commercial paper and revolving credit facilities, net\n40 \n194 \n— \nPayments on Callon Credit Agreement\n472 \n— \n— \nPayments on fixed-rate debt\n1,641 \n65 \n1,493 \nDividends paid to APA common stockholders\n353 \n308 \n207 \nDistributions to noncontrolling interest – Egypt\n268 \n238 \n362 \nTreasury stock activity, net\n246 \n329 \n1,423 \nDeconsolidation of Altus cash and cash equivalents\n— \n— \n143 \nOther, net\n88 \n53 \n— \nTotal Uses of Cash and Cash Equivalents\n6,619 \n3,544 \n6,026 \nIncrease (decrease) in cash and cash equivalents\n$\n538 \n$\n(158)\n$\n(57)\n(1)\nThe table presents capital expenditures on a cash basis; therefore, the amounts may differ from those discussed elsewhere in this Annual Report on Form 10-K, which include accruals.\nSources of Cash and Cash Equivalents\nNet Cash Provided by Operating Activities  \nOperating cash flows are the Company’s primary source of capital and liquidity and are impacted, both in the short term and the long term, by volatile commodity prices. The factors that determine operating cash flows are largely the same as those that affect net earnings, with the exception of non-cash expenses such as DD&A, exploratory dry hole expense, asset impairments, asset retirement obligation (ARO) accretion, and deferred income tax expense.\nNet cash provided by operating activities for the year ended December 31, 2024 totaled $3.6 billion, up $491 million from the year ended December 31, 2023, primarily due to higher oil and gas revenues resulting from increased drilling activity in the Permian Basin and production from the acquired Callon properties, partially offset by lower realized commodity prices.\nFor a detailed discussion of commodity prices, production, and operating expenses, refer to “Results of Operations” in this Item 7. For additional detail on the changes in operating assets and liabilities and the non-cash expenses that do not impact net cash provided by operating activities, refer to the \nStatement of Consolidated Cash Flows\n in the Consolidated Financial Statements set forth in Part IV, Item 15 of this Annual Report on Form 10-K.\nProceeds from Asset Divestitures\n  The Company received $1.6 billion and $29 million in proceeds from the divestiture of certain non-core assets during the years ended December 31, 2024 and 2023, respectively. For more information regarding the Company’s divestitures, refer to \nNote 2—Acquisitions and Divestitures\n in the Notes to Consolidated Financial Statements set forth in Part IV, Item 15 of this Annual Report on Form 10-K.\n46\nProceeds from Term Loan Facility  \nOn April 1, 2024, the Company borrowed an aggregate $1.5 billion under a syndicated credit agreement. Loan proceeds were used to refinance certain indebtedness of Callon upon the closing of the Callon acquisition. For additional details of the credit agreement, see “\nUnsecured Committed\n \nTerm Loan Facility” \nin the Liquidity section below. As of December 31, 2024, $900 million remained outstanding under the term loan facility governed by the Term Loan Credit Agreement.\nProceeds from Sale of Kinetik Shares\n  The Company received $428 million and $228 million of cash proceeds from the sales of its Kinetik Shares during 2024 and 2023, respectively. For more information regarding the Company’s equity method interests, refer to \nNote 6—Equity Method Interests\n in the Notes to Consolidated Financial Statements set forth in Part IV, Item 15 of this Annual Report on Form 10-K.\nUses of Cash and Cash Equivalents\nAdditions to Oil & Gas Property \n Exploration and development cash expenditures were $2.9 billion and $2.3 billion for the years ended December 31, 2024 and 2023, respectively. The increase is reflective of the Company’s acquisition of Callon, which increased the number of drilling rigs being operated in the Permian Basin, partially offset by the Company’s efforts to balance workover activity in Egypt and reduce drilling activity in the North Sea as it continually assesses inventory opportunities across its diverse portfolio in 2024. The Company operated an average of 22 drilling rigs during 2024, compared to an average of 24 drilling rigs during 2023. \nLeasehold and Property Acquisitions  \nDuring 2024 and 2023, in addition to the Callon acquisition, the Company completed other leasehold and property acquisitions, primarily in the Permian Basin, for total cash consideration of $60 million and $20 million, respectively.\nPayments on Term Loan Facility  \nDuring 2024, the Company made payments of $600 million on its syndicated term loan credit agreement. For additional details of the credit agreement, see “\nUnsecured Committed Term Loan Facility” \nin the Liquidity section below. As of December 31, 2024, $900 million remained outstanding under the term loan facility governed by the Term Loan Credit Agreement.\nPayments on Commercial Paper and Revolving Credit Facilities, Net\n  As of December 31, 2024, outstanding borrowings under the Company’s commercial paper and U.S. dollar denominated syndicated credit facility were $333 million, a decrease of $40 million from December 31, 2023 as operating cash flows generated in 2024 were used to repay facility borrowings.\nPayments on Callon Credit Agreement  \nUpon closing of the Callon acquisition, the Company financed Callon’s repayment in full of its $472 million outstanding under the Callon Credit Agreement.\nPayments on Fixed-Rate Debt  \nIn April and May of 2024, the Company financed Callon’s repayment pursuant to Callon’s cash tender offers for, and redemptions of all senior notes issued under Callon’s indentures for an aggregate cash payment of $1.6 billion, reflecting principal amounts, premium to par, and associated fees.\nDuring 2023, Apache purchased in the open market and canceled senior notes issued under its indentures in an aggregate principal amount of $74 million for an aggregate purchase price of $65 million in cash, including accrued interest and broker fees, reflecting a discount to par of an aggregate $10 million. The Company recognized a $9 million gain on these repurchases. \nThe Company may, and expects that Apache will continue to, reduce debt outstanding under its indentures from time to time.\nDividends Paid to APA Common Stockholders  \nThe Company paid $353 million and $308 million during the years ended December 31, 2024 and 2023, respectively, for dividends on its common stock.\nDistributions to Noncontrolling Interest - Egypt  \nSinopec International Petroleum Exploration and Production Corporation (Sinopec) holds a one-third minority participation interest in the Company’s oil and gas operations in Egypt. The Company paid $268 million and $238 million during the years ended December 31, 2024 and 2023, respectively, in cash distributions to Sinopec.\nTreasury Stock Activity, Net  \nDuring 2024, the Company repurchased 9.2 million shares at an average price of $26.83 per share totaling $246 million, and as of December 31, 2024, the Company had remaining authorization to repurchase 34.8 million shares. During 2023, the Company repurchased 8.7 million shares at an average price of $37.81 per share totaling $329 million.\n47\nLiquidity\nThe following table presents a summary of the Company’s key financial indicators as of December 31:\n \n2024\n2023\n \n(In millions)\nCash and cash equivalents\n$\n625 \n$\n87 \nTotal debt – APA and Apache \n6,044 \n5,188 \nTotal equity\n6,362 \n3,691 \nAvailable committed borrowing capacity under syndicated credit facilities\n2,966 \n2,894 \nCash and Cash Equivalents\n  As of December 31, 2024, the Company had $625 million in cash and cash equivalents. The majority of the Company’s cash is invested in highly liquid, investment-grade instruments with maturities of three months or less at the time of purchase.\nDebt  \nAs of December 31, 2024, the Company had $6.0 billion in total debt outstanding, which consisted of notes and debentures of Apache, credit facility borrowings, and finance lease obligations. As of December 31, 2024, current debt included $53 million of finance lease obligations.\nUnsecured 2022 Committed Bank Credit Facilities  \nOn April 29, 2022, the Company entered into two unsecured syndicated credit agreements for general corporate purposes that remained in effect as of December 31, 2024, but were replaced on January 15, 2025 as detailed below under “Subsequent Event — Unsecured 2025 Committed Bank Credit Facilities.” As of December 31, 2024:\n•\nOne agreement was denominated in US dollars (the 2022 USD Agreement) and provides for an unsecured five-year revolving credit facility, with aggregate commitments of US$1.8 billion (including a letter of credit subfacility of up to US$750 million, of which US$150 million was committed).\n•\nThe second agreement was denominated in pounds sterling (the 2022 GBP Agreement) and provided for an unsecured five-year revolving credit facility, with aggregate commitments of £1.5 billion for loans and letters of credit.\nAs of December 31, 2024, there were $10 million of borrowings under the 2022 USD Agreement and an aggregate £303 million in letters of credit outstanding under the GBP Agreement. As of December 31, 2024, there were no letters of credit outstanding under the USD Agreement. As of December 31, 2023, there were $372 million of borrowings under the 2022 USD Agreement, and an aggregate £348 million in letters of credit outstanding under the GBP Agreement. As of December 31, 2023, there were no letters of credit outstanding under the 2022 USD Agreement.\nThe Company was in compliance with the terms of the 2022 Agreements as of December 31, 2024.\nThere is no assurance of the terms upon which potential lenders under future credit facilities will make loans or other extensions of credit available to APA or its subsidiaries or the composition of such lenders. \nThere is no assurance that the financial condition of banks with lending commitments to APA or its subsidiaries will not deteriorate. The Company closely monitors the ratings of the banks in its bank groups. Having large bank groups allows the Company to mitigate the potential impact of any bank’s failure to honor its lending commitment.\nUncommitted Lines of Credit  \nEach of the Company and Apache from time to time has and uses uncommitted credit and letter of credit facilities for working capital and credit support purposes. As of December 31, 2024 and 2023, there were no outstanding borrowings under these facilities. As of December 31, 2024, there were £640 million and $11 million in letters of credit outstanding under these facilities. As of December 31, 2023, there were £416 million and $2 million in letters of credit outstanding under these facilities.\n48\nCommercial Paper Program\n \nIn December 2023, the Company established a commercial paper program under which it from time to time may issue in private placements exempt from registration under the Securities Act short-term unsecured promissory notes (the CP Notes) up to a maximum aggregate face amount of $1.8 billion outstanding at any time. The maturities of the CP Notes may vary but may not exceed 397 days from the date of issuance. Outstanding CP Notes are supported by available borrowing capacity under the Company’s committed revolving credit facilities for general corporate purposes, which as of December 31, 2024, included the $1.8 billion 2022 USD Agreement.\nPayment of the CP Notes has been unconditionally guaranteed on an unsecured basis by Apache, such guarantee effective until the first time that the aggregate principal amount of indebtedness under senior notes and debentures outstanding under Apache’s existing indentures is less than US$1.0 billion.\nThe CP Notes are sold under customary market terms in the U.S. commercial paper market at a discount from par or at par and bear interest at rates determined at the time of issuance.\nAs of December 31, 2024, the Company had $323 million in aggregate face amount of CP Notes outstanding, which is classified as long-term debt. As of December 31, 2023, there were no CP Notes outstanding.\nUnsecured Committed Term Loan Facility\n  On January 30, 2024, APA entered into a syndicated credit agreement under which the lenders committed an aggregate $2.0 billion for senior unsecured delayed-draw term loans to APA (Term Loan Credit Agreement) the proceeds of which could be used to refinance certain indebtedness of Callon only once upon the date of the closings under the Merger Agreement and Term Loan Credit Agreement. Of such aggregate commitments, $1.5 billion was for term loans that would mature three years after the date of such closings (3-Year Tranche Loans) and $500 million was for term loans that would mature 364 days after the date of such closings (364-Day Tranche Loans). Apache has guaranteed obligations under the Term Loan Credit Agreement effective until the aggregate principal amount of indebtedness under senior notes and debentures outstanding under Apache’s existing indentures first is less than $1.0 billion.\nOn April 1, 2024 (the Closing Date), APA closed the transactions under the Term Loan Credit Agreement, electing to borrow an aggregate $1.5 billion in 3-Year Tranche Loans maturing April 1, 2027 and to allow the lender commitments for the 364-Day Tranche Loans to expire. As of December 31, 2024, there were $900 million in 3-Year Tranche Loans remaining outstanding under the Term Loan Credit Agreement.\nLoan proceeds were used to refinance certain indebtedness of Callon upon the substantially simultaneous closing of APA’s acquisition of Callon pursuant to the Merger Agreement and to pay related fees and expenses. APA may at any time prepay loans under the Term Loan Credit Agreement. \nBorrowings under the Term Loan Credit Agreement bear interest at one of two rate options selected by APA, being either (i) an alternate base rate (as defined), plus a margin (Term Base Rate Margin) varying from 0.375% to 1.125% for 3-Year Tranche Loans until the second anniversary of the Closing Date, and 0.625% to 1.375% for 3-Year Tranche Loans after the second anniversary of the Closing Date, or (ii) an adjusted term SOFR rate (as defined), plus a margin (Term Applicable Margin) varying from 1.375% to 2.125% for 3-Year Tranche Loans until the second anniversary of the Closing Date, and 1.625% to 2.375% for 3-Year Tranche Loans after the second anniversary of the Closing Date.\nMargins are at varying rates per annum determined by reference to the senior, unsecured, non-credit enhanced, long-term indebtedness for borrowed money of APA, or if such indebtedness is not rated and the Apache guaranty is in effect, of Apache (Long-Term Debt Rating). As of December 31, 2024, Apache’s Long-Term Debt Rating applied, and the Term Base Rate Margin was 0.75% for 3-Year Tranche Loans, and the Term Applicable Margin was 1.75% for 3-Year Tranche Loans. \nAPA is subject to representations and warranties, covenants, and events of default under the Term Loan Credit Agreement, such as:\n•\nA financial covenant requires APA to maintain an adjusted debt-to-capital ratio of not greater than 60 percent at the end of any fiscal quarter. At December 31, 2024, APA’s debt-to-capital ratio as calculated under the Term Loan Credit Agreement was 19 percent.\n•\nA negative covenant restricts the ability of APA and its subsidiaries to create liens securing debt on their hydrocarbon-related assets, with customary exceptions and exceptions for liens on subsidiary assets located outside of the U.S. and Canada. Liens on assets also are permitted if debt secured thereby does not exceed 15 percent of APA’s consolidated net tangible assets or approximately $2.5 billion as of December 31, 2024.\n49\n•\nNegative covenants restrict APA’s ability to merge with another entity unless it is the surviving entity, a borrower’s disposition of substantially all of its assets, prohibitions on the ability of certain subsidiaries to make payments to borrowers, and guarantees by APA or certain subsidiaries of debt of non-consolidated entities in excess of the stated threshold.\n•\nLenders may accelerate payment maturity and terminate lending commitments for nonpayment and other breaches; if APA or certain subsidiaries default on other indebtedness in excess of the stated threshold, has any unpaid, non-appealable judgment against it for payment of money in excess of the stated threshold, or has specified pension plan liabilities in excess of the stated threshold; or APA undergoes a specified change in control. Such acceleration and termination are automatic upon specified insolvency events of APA or certain subsidiaries.\nThe Term Loan Credit Agreement does not permit lenders to accelerate maturity based on unspecified material adverse changes and does not have prepayment obligations in the event of a decline in credit ratings.\nThe Company was in compliance with the terms of the Term Loan Credit Agreement as of December 31, 2024.\nSubsequent Event—Unsecured 2025 Committed Bank Credit Facilities\nOn January 15, 2025, the Company terminated commitments under the 2022 Agreements and in replacement thereof, entered into two unsecured syndicated credit agreements for general corporate purposes on terms substantially the same as those of the 2022 Agreements:\n•\nOne agreement is denominated in US dollars (the 2025 USD Agreement) and provides for an unsecured five-year revolving credit facility for loans and letters of credit, with aggregate commitments of US$2.0 billion (including a letter of credit subfacility of up to US$750 million, of which US$250 million currently is committed). APA may increase commitments up to an aggregate US$2.5 billion by adding new lenders or obtaining the consent of any increasing existing lenders. This facility matures in January 2030, subject to the Company’s two, one-year extension options.\n•\nThe second agreement is denominated in pounds sterling (the 2025 GBP Agreement) and provides for an unsecured five-year revolving credit facility, with aggregate commitments of £1.5 billion for loans and letters of credit. This facility matures in January 2030, subject to the Company’s two, one-year extension options.\nApache has guaranteed obligations under each of the 2025 USD Agreement and 2025 GBP Agreement (each, a 2025 Agreement) effective until the aggregate principal amount of indebtedness under senior notes and debentures outstanding under Apache’s existing indentures first is less than US$1.0 billion.\nLetters of credit are available under each 2025 Agreement for credit support needs of APA and its subsidiaries, including in respect of North Sea decommissioning obligations. As of January 15, 2025, letters of credit aggregating approximately £253 million originally issued under the 2022 GBP Agreement were deemed issued and outstanding under the 2025 GBP Agreement.\nAll borrowings under the 2025 USD Agreement bear interest at one of two per annum rate options selected by the borrower, being either an alternate base rate (as defined), plus a margin varying from 0.0% to 0.675% (Base Rate Margin), or an adjusted term SOFR rate (as defined), plus a margin varying from 1.00% to 1.675% (Applicable Margin). All borrowings under the 2025 GBP Agreement bear interest with respect to any business day at an adjusted rate per annum determined by reference to the Sterling Overnight Index Average with respect to such business day published by the Bank of England, plus the Applicable Margin.\nEach 2025 Agreement also requires the borrower to pay quarterly (i) a facility fee on total commitments at a per annum rate that varies from 0.125% to 0.325% and (ii) a commission on the face amount of each outstanding letter of credit at a per annum rate equal to the Applicable Margin then in effect.  Customary letter of credit fronting fees and other charges are payable to issuing banks.\nMargins and facility fees are at varying rates per annum determined by reference to the senior, unsecured, non-credit enhanced, long-term indebtedness for borrowed money of APA, or if such indebtedness is not rated and the Apache guaranty is in effect, of Apache (Long-Term Debt Rating). APA’s Long-Term Debt Rating currently applies, and the Base Rate Margin is 0.30%, the Applicable Margin is 1.30%, and the facility fee is 0.20%.\n50\nBorrowers under each 2025 Agreement, which include certain subsidiaries of APA, may borrow, prepay, and reborrow loans and obtain letters of credit, and APA may obtain letters of credit for the account of its subsidiaries, in each case subject to representations and warranties, covenants, and events of default, such as:\n•\nA financial covenant requires APA to maintain an adjusted debt-to-capital ratio of not greater than 65% at the end of any fiscal quarter.\n•\nA negative covenant restricts the ability of APA and its subsidiaries to create liens securing debt on their hydrocarbon-related assets, with customary exceptions and exceptions for liens on subsidiary assets located outside of the U. S. and Canada. Liens on assets also are permitted if debt secured thereby does not exceed 15% of APA’s consolidated net tangible assets.\n•\nNegative covenants restrict APA’s ability to merge with another entity unless it is the surviving entity, a borrower’s disposition of substantially all of its assets, prohibitions on the ability of certain subsidiaries to make payments to borrowers, and guarantees by APA or certain subsidiaries of debt of non-consolidated entities in excess of the stated threshold.\n•\nLenders may accelerate payment maturity and terminate lending and issuance commitments for nonpayment and other breaches; if a borrower or certain subsidiaries defaults on other indebtedness in excess of the stated threshold, has any unpaid, non-appealable judgment against it for payment of money in excess of the stated threshold, or has specified pension plan liabilities in excess of the stated threshold; or APA undergoes a specified change in control. Such acceleration and termination are automatic upon specified insolvency events of a borrower or certain subsidiaries.\nThe 2025 Agreements do not require collateral, do not have a borrowing base, do not permit lenders to accelerate maturity or refuse to lend based on unspecified material adverse changes, and do not have borrowing restrictions or prepayment obligations in the event of a decline in credit ratings.\nSubsequent Event—APA Exchange and Tender Offers for Apache Indenture Debt\nOn January 10, 2025, the Company settled its private exchange and cash tender offers for certain notes and debentures issued by Apache under its indentures. The Company also then settled its private offering of new notes to fund in part its purchase of Apache notes in APA’s cash tender offers.  In settling these offerings pursuant to their respective terms:\n•\nA\nPA issued new notes and debentures under its indentures in aggregate principal amounts of (i) $2.5 billion in exchange for Apache notes and debentures tendered and accepted in APA’s exchange offers, (ii) $203 million in exchange for Apache notes tendered in the cash tender offers in excess of the stated maximum purchase amount or series caps, and (iii) $850 million in the new notes offering, comprised of $350 million aggregate principal amount of APA’s 6.10% Notes due 2035 and $500 million aggregate principal amount of APA’s 6.75% Notes due 2055.\n•\nIn addition to issuing the APA notes in the exchange offers, APA paid a total of $2.5 million in cash as part of the exchange consideration.\n•\nAPA paid a total of $869 million in cash in the tender offers (comprised of tender offer consideration, exchange consideration for tendered notes exchanged, early participation premium, and accrued interest) for the aggregate $1 billion in principal amount of Apache notes tendered and accepted in the cash tender offers.\n•\nNet proceeds from the sale of the notes in APA’s new notes offering, after deducting the initial purchasers’ discounts and estimated offering expenses, were approximately $839 million and used to fund in part APA’s purchase of Apache notes in APA’s cash tender offers.\n•\nEach series of APA notes and debentures issued in settlement of the exchange and tender offers has the same interest rate, maturity date, and interest payment dates and the same optional redemption prices (if any) as the corresponding series of Apache notes and debentures for which they were exchanged.\n•\nEach series of APA notes and debentures issued in settlement of the exchange and tender offers and new notes offering are fully and unconditionally guaranteed by Apache until the first time that the aggregate principal amount of indebtedness under senior notes and debentures outstanding under Apache’s existing indentures is less than $1 billion.\n•\nAPA entered into two registration rights agreements, one covering notes and debentures issued in APA’s exchange and tender offers and one covering notes issued in APA’s new notes offering (each a Registration Rights Agreement). \n51\nThese offerings were not registered under the Securities Act of 1933, as amended (Securities Act), in reliance upon an exemption therefrom, and the APA notes and debentures issued pursuant to such offers are subject to certain transfer restrictions. Each Registration Rights Agreement requires APA and Apache to use their commercially reasonable efforts to (i) cause to be filed a registration statement with respect to a registered offer to exchange each series of APA notes issued in settlement of the exchange and tender offers or new notes offering, as applicable, for registered notes issued by APA and guaranteed, if applicable, by Apache containing terms substantially identical in all material respects to the applicable series of APA notes issued in settlement of the exchange and tender offers or new notes offering (except that the registered notes will not contain terms with respect to transfer restrictions or any increase in annual interest rate) and (ii) cause such registration statement to become effective under the Securities Act.  If, among other events, such exchange offers are not completed on or prior to the 360th day following January 10, 2025, then additional interest will accrue on the principal amount of such registrable securities at a rate of 0.25% per annum for the first 90-day period beginning on the day immediately following such registration default (which rate will be increased by an additional 0.25% per annum for each subsequent 90-day period that such additional interest continues to accrue, provided that the rate at which such additional interest accrues may in no event exceed 1.00% per annum). To the extent Apache’s guarantee of the registrable securities is terminated in accordance with the terms of such guarantee, the registered notes will not be guaranteed by Apache, the exchange offer and registration requirements with respect thereto will be the sole obligation of the Company, and Apache will automatically be released from all obligations under the applicable Registration Rights Agreement.\nThe following table presents the aggregate principal amounts of notes and debentures outstanding under indentures of APA and Apache on January 10, 2025 upon settlement of the APA’s exchange and tender offers and new notes offering (Apache notes due 2025 were not included in APA’s exchange or tender offers):\nJanuary 10, 2025\nAPA\nApache\n(In millions)\n4.625% notes due 2025\n$\n— \n$\n51 \n7.70% notes due March 2026\n(1)(5)(6)\n58 \n21 \n7.95% notes due April 2026\n(1)(5)(6)\n56 \n76 \n4.875% notes due 2027\n(4)(5)(6)\n39 \n69 \n4.375% notes due 2028\n(4)(5)(6)\n239 \n86 \n7.75% notes due 2029\n(2)(5)(6)\n164 \n72 \n4.25% notes due 2030\n(4)(5)(6)\n374 \n142 \n6.0% notes due 2037\n(1)(5)(6)\n341 \n102 \n5.1% notes due 2040\n(1)(5)(6)\n539 \n225 \n5.25% notes due 2042\n(1)(5)(6)\n209 \n65 \n4.75% notes due 2043\n(3)(5)(6)\n153 \n79 \n4.25% notes due 2044\n(3)(5)(6)\n77 \n24 \n7.375% debentures due 2047\n(1)(5)(6)\n126 \n24 \n5.35% notes due 2049\n(4)(5)(6)\n330 \n57 \n7.625% debentures due 2096\n(1)(5)(6)\n37 \n2 \n6.10% notes due 2035\n(7)\n350 \n— \n6.75% notes due 2055\n(7)\n500 \n— \nTotal\n$\n3,592 \n$\n1,095 \n(1)\nThe Apache March 2026 notes, the Apache April 2026 notes, the Apache 2037 notes, the Apache 2040 notes, the Apache 2042 notes, the Apache 2047 debentures, and the Apache 2096 debentures were issued under the Senior Indenture, dated as of February 15, 1996, between Apache and The Bank of New York Mellon Trust Company, N.A. (formerly known as The Bank of New York Trust Company, N.A., as successor to JPMorgan Chase Bank, formerly known as The Chase Manhattan Bank, as trustee), as trustee (an Apache Indenture).\n(2)\nThe Apache 2029 notes were issued under the Indenture, dated as of November 23, 1999, between Apache (as successor to Apache Finance Canada Corporation), and The Bank of New York Mellon Trust Company, N.A. (formerly known as The Bank of New York Trust Company, N.A., as successor to The Chase Manhattan Bank, as trustee), as trustee (an Apache Indenture).\n(3)\nThe Apache 2043 notes and the Apache 2044 notes were issued under the Senior Indenture, dated as of May 19, 2011, between Apache and Computershare Trust Company, N.A., as successor to Wells Fargo Bank, National Association, as trustee (an Apache Indenture).\n(4)\nThe Apache 2027 notes, the Apache 2028 notes, the Apache 2030 notes, and the Apache 2049 notes were issued under the Indenture, dated as of August 14, 2018, between Apache and Computershare Trust Company, N.A., as successor to Wells Fargo Bank, National Association, as trustee (an Apache Indenture).\n52\n(5)\nIn connection with APA’s exchange and tender offers, Apache solicited the consents of the holders of these Apache notes and debentures to amend the applicable Apache Indenture to remove certain restrictive and reporting covenants. The Apache notes and debentures are senior unsecured obligations of Apache. Apache received consents sufficient to approve the proposed amendments to the Apache Indentures with respect to the Apache March 2026 notes, the Apache 2028 notes, the Apache 2029 notes, the Apache 2030 notes, the Apache 2037 notes, the Apache 2040 notes, the Apache 2042 notes, the Apache 2043 notes, the Apache 2044 notes, the Apache 2047 debentures, the Apache 2049 notes, and the Apache 2096 debentures. As a result, Apache and the respective trustee for the Apache Indentures entered into supplemental indentures on January 10, 2025, implementing the proposed amendments effective as of that date.\n(6)\nThe APA March 2026 notes, the APA April 2026 notes, the APA 2027 notes, the APA 2028 notes, the APA 2029 notes, the APA 2030 notes, the APA 2037 notes, the APA 2040 notes, the APA 2042 notes, the APA 2043 notes, the APA 2044 notes, the APA 2047 debentures, the APA 2049 notes, and the APA 2096 debentures were issued under the Indenture, dated as of June 30, 2021, between the Company, as issuer, and Computershare Trust Company, N.A., as successor to Wells Fargo Bank, National Association, as trustee. These APA notes and debentures were issued in APA’s exchange and tender offers for Apache’s notes and debentures.\n(7)\nThe APA 2035 notes and the APA 2055 notes were issued under the Indenture, dated as of December 11, 2024, between the Company, as issuer, and Regions Bank, as trustee. These APA notes were issued in APA’s new notes offering to fund in part its purchase of Apache notes in APA’s cash tender offers.\nSubsequent Event—Open Market Repurchases of Apache Indenture Debt\nIn the first quarter of 2025 through the date of this filing, Apache purchased in the open market and canceled senior notes issued under its indentures in an aggregate principal amount of $55 million for an aggregate purchase price of $50 million in cash, including accrued interest and broker fees, reflecting a discount to par of an aggregate $7 million. The Company recognized a $6 million gain on these repurchases. The repurchases were partially financed by APA’s borrowing under the Company’s commercial paper program.\nContractual Obligations\nPurchase Obligations  \nFrom time to time, the Company enters into agreements to purchase goods or services that are enforceable and legally binding and that specify all significant terms. These include minimum commitments associated with take-or-pay contracts, NGL processing agreements, drilling work program commitments and agreements to secure capacity rights on third-party pipelines. As of December 31, 2024, the Company had contractual obligations totaling $1.1 billion, of which $963 million is related to U.S. firm transportation contracts, $45 million is related to the merged concession agreement with the EGPC, and $110 million is related to other items. Under terms agreed to in the Egypt modernized PSC, the Company committed to spend a minimum of $3.5 billion on exploration, development, and operating activities by March 31, 2026. As of December 31, 2024, the Company has met and fully satisfied the obligation.\nLeases  \nIn the normal course of business, the Company enters into various lease agreements for real estate, drilling rigs, vessels, aircrafts, and equipment related to its exploration and development activities, which are typically classified as operating leases under the provisions of Financial Accounting Standards Board (FASB) Accounting Standards Codification (ASC) Topic 842 (Leases). As of December 31, 2024, the Company had net undiscounted minimum commitments of $467 million and $37 million for operating and finance leases, respectively. \nInterest Expense\n  Future interest payments based on the current maturity dates of the Company’s fixed-rate notes and debentures as of December 31, 2024 are approximately $3.6 billion. \n53\nFor additional information regarding these obligations, refer to \nNote 9—Debt and Financing Costs\n and \nNote 11—Commitments and Contingencies\n in the Notes to Consolidated Financial Statements set forth in Part IV, Item 15 of this Annual Report on Form 10-K.\nFor information regarding the Company’s liability for dismantlement, abandonment, and restoration costs of oil and gas properties, refer to \nNote 8—Asset Retirement Obligation\n in the Notes to Consolidated Financial Statements set forth in Part IV, Item 15 of this Annual Report on Form 10-K.\nFor information regarding pension or postretirement benefit obligations, refer to \nNote 12—Retirement and Deferred Compensation Plans\n in the Notes to Consolidated Financial Statements set forth in Part IV, Item 15 of this Annual Report on Form 10-K.\nThe Company is also subject to various contingent obligations that become payable only if certain events or rulings were to occur. The inherent uncertainty surrounding the timing of and monetary impact associated with these events or rulings prevents any meaningful accurate measurement, which is necessary to assess settlements resulting from litigation. The Company’s management believes that it has adequately reserved for its contingent obligations, including approximately $2 million for environmental remediation and approximately $20 million for various contingent legal liabilities. For a detailed discussion of the Company’s environmental and legal contingencies and other commitments, please see \nNote 11—Commitments and Contingencies\n in the Notes to Consolidated Financial Statements set forth in Part IV, Item 15 of this Annual Report on Form 10-K.\nWith respect to oil and gas operations in the Gulf of America, the Bureau of Ocean Energy Management (BOEM) issued a Notice to Lessees (NTL No. 2016-N01) significantly revising the obligations of companies operating in the Gulf of America to provide supplemental assurances of performance with respect to plugging, abandonment, and decommissioning obligations associated with wells, platforms, structures, and facilities located upon or used in connection with such companies’ oil and gas leases. While the NTL was paused in mid-2017 and is currently listed on BOEM’s website as “rescinded,” if reinstated, the NTL will likely require that the Company provide additional security to BOEM with respect to plugging, abandonment, and decommissioning obligations relating to the Company’s current ownership interests in various Gulf of America leases. Additionally, the Company is not able to predict the effect that these changes might have on counterparties to which the Company has sold Gulf of America assets or with whom the Company has joint ownership. Such changes could cause the bonding obligations of such parties to increase substantially, thereby causing a significant impact on the counterparties’ solvency and ability to continue as a going concern.\nPotential Decommissioning Obligations on Sold Properties\nThe Company’s subsidiaries have potential exposure to future obligations related to divested properties. The Company has divested various leases, wells, and facilities located in the Gulf of America (GOA) where the purchasers typically assume all obligations to plug, abandon, and decommission the associated wells, structures, and facilities acquired. One or more of the counterparties in these transactions could, either as a result of the severe decline in oil and natural gas prices or other factors related to the historical or future operations of their respective businesses, face financial problems that may have a significant impact on their solvency and ability to continue as a going concern. If a purchaser of such GOA assets becomes the subject of a case or proceeding under relevant insolvency laws or otherwise fails to perform required abandonment obligations, APA’s subsidiaries could be required to perform such actions under applicable federal laws and regulations. In such event, such subsidiaries may be forced to use available cash to cover the costs of such liabilities and obligations should they arise.\nIn 2013, Apache sold its GOA Shelf operations and properties and its GOA operating subsidiary, GOM Shelf LLC (GOM Shelf) to Fieldwood Energy LLC (Fieldwood). Fieldwood assumed the obligation to decommission the properties held by GOM Shelf and the properties acquired from Apache and its other subsidiaries (collectively, the Legacy GOA Assets). On February 14, 2018, Fieldwood filed for (and subsequently emerged from) Chapter 11 bankruptcy protection. On August 3, 2020, Fieldwood filed for (and subsequently emerged from) Chapter 11 bankruptcy protection for a second time. Upon emergence from this second bankruptcy, \nthe Legacy GOA Assets were separated into a standalone company, which was subsequently merged into GOM Shelf. Under GOM Shelf’s limited liability company agreement, the proceeds of production of the Legacy GOA Assets are to be used to fund the operation of GOM Shelf and the decommissioning of Legacy GOA Assets.\n \nPursuant to the terms of the original transaction, as amended in the first bankruptcy, \nthe securing of the asset retirement obligations for the Legacy GOA Assets as and when Apache is required to perform or pay for any such decommissioning was accomplished through the posting of letters of credit in favor of Apache (Letters of Credit), the provision of two bonds (Bonds) in favor of Apache, and the establishment of a trust account of which Apache was a beneficiary and which was funded by net profits interests (NPIs) depending on future oil prices. In addition, after such sources have been exhausted, Apache agreed upon \n54\nresolution of GOM Shelf’s second bankruptcy to provide a standby loan to GOM Shelf of up to $400 million to perform decommissioning, with such standby loan secured by a first and prior lien on the Legacy GOA Assets.\nBy letter dated April 5, 2022 (replacing two earlier letters) and by subsequent letter dated March 1, 2023, GOM Shelf notified the Bureau of Safety and Environmental Enforcement (BSEE) that it was unable to fund the decommissioning obligations that it was obligated to perform on certain of the Legacy GOA Assets. As a result, Apache and other current and former owners in these assets have received orders from BSEE and demands from third parties to decommission certain of the Legacy GOA Assets included in GOM Shelf’s notifications to BSEE. Apache expects to receive similar orders and demands on the other Legacy GOA Assets included in GOM Shelf’s notification letters. Apache has also received orders to decommission other Legacy GOA Assets that were not included in GOM Shelf’s notification letters. Further, Apache anticipates that GOM Shelf may send additional such notices to BSEE in the future and that it may receive additional orders from BSEE requiring it to decommission other Legacy GOA Assets.\nOn June 21, 2023, two sureties that issued Bonds directly to Apache and two sureties that issued bonds to the issuing bank on the Letters of Credit filed suit against Apache in a case styled \nZurich American Insurance Company, HCC International Insurance Company PLC, Philadelphia Indemnity Insurance Company and Everest Reinsurance Company (Insurers) v. Apache Corporation\n, Cause No. 2023-38238 in the 281\nst\n Judicial District Court, Harris County Texas. The sureties sought to prevent Apache from drawing on the $148 million in Bonds and $350 million in Letters of Credit and further alleged that they are discharged from their reimbursement obligations related to decommissioning costs and are entitled to other relief. On July 20, 2023, the 281\nst\n Judicial District Court denied the Insurers’ request for a temporary injunction. On July 26, 2023, Apache removed the suit to the United States Bankruptcy Court for the Southern District of Texas (Houston Division). Since the time the sureties filed their state court lawsuit, Apache has drawn down the entirety of the $350 million in Letters of Credit. Apache has also sought to draw down on the Bonds; however, the sureties refused to honor such Bond draws. On September 12, 2024, the bankruptcy court issued its opinion (1) finding that sureties’ state court lawsuit against Apache was void; (2) holding that Apache’s claims against the sureties for unpaid amounts may proceed in bankruptcy court; and (3) holding the sureties in civil contempt and awarding attorneys’ fees to Apache as a sanction. The parties settled their dispute in the first quarter of 2025, which resulted in, among other things, mutual releases, the retention by Apache of all amounts drawn on the Letters of Credit, and payment to Apache of $140 million under the Bonds.\nAs of December 31, 2024, the Company recorded an asset of $178 million representing the remaining amount the Company expects to be reimbursed from security related to these decommissioning costs.\nAs of December 31, 2024, Apache estimates that its potential liability to fund the remaining decommissioning of Legacy GOA Assets and assets previously sold to other operators ranges from $1.0 billion to $1.4 billion on an undiscounted basis. Management does not believe any specific estimate within this range is a better estimate than any other. Accordingly, the Company recorded contingent liabilities in the amounts of $1.0 billion and $824 million as of December 31, 2024, and December 31, 2023, respectively. Of the total liability recorded as of December 31, 2024, $929 million is reflected under the caption “Decommissioning contingency for sold Gulf of America properties” and $88 million is reflected under “Other current liabilities” in the Company’s consolidated balance sheet. Changes in significant assumptions impacting Apache’s estimated liability, including expected well decommissioning spread rates, derrick barge rates, and planned abandonment logistics, could result in a liability in excess of the amount accrued.\nThe Company recognized $273 million of “Losses on previously sold Gulf of America properties” during 2024 to reflect the net impact of an increase in estimated decommissioning costs of Legacy GOA Assets which BSSE may order the Company to decommission. The loss includes $67 million related to properties previously sold to third parties other than Fieldwood for which the Company received BSSE orders to decommission during the year, as well as an increase to the estimated net liability the Company expects to incur for decommissioning Legacy GOA Assets. The Company also recognized losses on previously sold Gulf of America properties of $212 million and $157 million during 2023 and 2022, respectively, in the Company’s statement of consolidated operations.\n55\nInsurance Program\nThe Company maintains insurance policies that include coverage for physical damage to its assets, general liabilities, workers’ compensation, employers’ liability, sudden and accidental pollution, and other risks. The Company’s insurance coverage is subject to deductibles or retentions that it must satisfy prior to recovering on insurance. Additionally, the Company’s insurance is subject to policy exclusions and limitations. There is no assurance that insurance will adequately protect the Company against liability from all potential consequences and damages. Further, the Company does not have coverage in place for a variety of other risks including Gulf of America named windstorm and business interruption. Service agreements, including drilling contracts, generally indemnify the Company for injuries and death of the service provider’s employees as well as subcontractors hired by the service provider. \nThe Company purchases multi-year political risk insurance from The Islamic Corporation for the Insurance of Investment and Export Credit Trade (ICIEC, an agency of the Islamic Development Bank) and highly-rated insurers covering a portion of its investments in Egypt for losses arising from confiscation, nationalization, and expropriation risks. In the aggregate, these insurance policies provide up to $750 million of coverage, subject to policy terms and conditions and a retention of approximately $500 million.\nFuture insurance coverage for the Company’s industry could increase in cost and may include higher deductibles or retentions. In addition, some forms of insurance may become unavailable or unavailable on terms economically acceptable.\nCritical Accounting Estimates\nThe Company prepares its financial statements and accompanying notes in conformity with accounting principles generally accepted in the U.S., which require management to make estimates and assumptions about future events that affect reported amounts in the financial statements and the accompanying notes. The Company identifies certain accounting policies involving estimation as critical accounting estimates based on, among other things, their impact on the portrayal of the Company’s financial condition, results of operations, or liquidity, as well as the degree of difficulty, subjectivity, and complexity in their deployment. Critical accounting estimates address accounting matters that are inherently uncertain due to unknown future resolution of such matters. Management routinely discusses the development, selection, and disclosure of each critical accounting estimate. The following is a discussion of the Company’s most critical accounting estimates.\nLong-Lived Asset Impairments\nLong-lived assets used in operations, including proved oil and gas properties and GPT assets, are assessed for impairment whenever changes in facts and circumstances indicate a possible significant deterioration in future cash flows expected to be generated by an asset. Individual assets are grouped for impairment purposes based on a judgmental assessment of the lowest level for which there are identifiable cash flows that are largely independent of the cash flows of other groups of assets. If there is an indication that the carrying amount of an asset group may not be recovered, the asset is assessed by management through an established process in which changes to significant assumptions such as prices, volumes, and future development plans are reviewed. If, upon review, the sum of the undiscounted pre-tax cash flows is less than the carrying value of the asset group, the carrying value is written down to estimated fair value. Because there usually is a lack of quoted market prices for long-lived assets, the fair value of impaired assets is assessed by management using the income approach.\nUnder the income approach, the fair value of each asset group is estimated based on the present value of expected future cash flows. The income approach is dependent on a number of factors including estimates of forecasted revenue and operating costs, proved reserves, the success of future exploration for and development of unproved reserves, expected throughput volumes for GPT assets, discount rates, and other variables. Key assumptions used in developing a discounted cash flow model described above include estimated quantities of crude oil and natural gas reserves; estimates of market prices considering forward commodity price curves as of the measurement date; and estimates of operating and administrative costs. The Company discounts the resulting future cash flows using a discount rate believed to be consistent with those applied by market participants. \nTo assess the reasonableness of our fair value estimate, when available, management uses a market approach to compare the fair value to similar assets. This requires management to make certain judgments about the selection of comparable assets, recent comparable asset transactions, and transaction premiums.\n56\nAlthough the fair value estimate of each asset group is based on assumptions believed to be reasonable, those assumptions are inherently unpredictable and uncertain, and actual results could differ from the estimate. Negative revisions of estimated reserves quantities, increases in future cost estimates, divestiture of a significant component of the asset group, or sustained decreases in crude oil or natural gas prices could lead to a reduction in expected future cash flows and possibly an additional impairment of long-lived assets in future periods.\nThe Company has recorded material impairments of certain proved oil and gas properties and gathering, processing, and transmission facilities during 2024. For discussion of these impairments, see “Fair Value Measurements” of \nNote 1—Summary of Significant Accounting Policies\n in the Notes to Consolidated Financial Statements set forth in Part IV, Item 15 of this Annual Report on Form 10-K.\nPurchase Price Allocation\nAccounting for the acquisition of a business requires the allocation of the purchase price to the various assets and liabilities of the acquired business. The amount of goodwill or bargain purchase gain recognized, if any, is determined based on the consideration transferred compared to the amounts of the identifiable net assets acquired on the acquisition date.\nThe purchase price allocation is accomplished by recording each asset and liability at its estimated fair value. Estimated deferred taxes are based on available information concerning the tax basis of the acquired company’s assets and liabilities and tax-related carryforwards at the merger date, although such estimates may change in the future as additional information becomes known.\nIn estimating the fair values of assets acquired and liabilities assumed, the Company has made various assumptions. The most significant assumptions relate to the estimated fair values assigned to proved oil and natural gas properties. The fair value of proved oil and natural gas properties as of the acquisition date were estimated using the income approach where fair value was determined based on the expected future cash flows from estimated proved oil, natural gas, and NGL reserves and related discounted future net cash flows as of that date. Significant inputs to the fair value estimate included estimates of future production volumes, future operating and development costs, future commodity prices, and a weighted average cost of capital discount rate.\nThe estimates used in determining fair values are based on assumptions believed to be reasonable but which are inherently uncertain. Accordingly, actual results may differ from the projected results used to determine fair value. Historically there has been volatility in oil, natural gas, and NGL prices, and estimates of such future prices are inherently imprecise. Additionally, the actual timing of the production could be different than projected volumes as of the acquisition date.\nReserves Estimates\nProved oil and gas reserves are the estimated quantities of natural gas, crude oil, condensate, and NGLs that geological and engineering data demonstrate with reasonable certainty to be economically recoverable in future years from known reservoirs under existing conditions, operating conditions, and government regulations.\nDespite judgment involved in these engineering estimates, the Company’s reserves are used throughout its financial statements. For example, since the Company uses the units-of-production method to amortize its oil and gas properties, the quantity of reserves could significantly impact DD&A expense. A material adverse change in the estimated volumes of reserves could result in property impairments. Finally, these reserves are the basis for the Company’s supplemental oil and gas disclosures. For more information regarding the Company’s supplemental oil and gas disclosures, refer to \nNote 17—Supplemental Oil and Gas Disclosures (Unaudited)\n in the Notes to Consolidated Financial Statements set forth in Part IV, Item 15 of this Annual Report on Form 10-K.\nReserves are calculated using an unweighted arithmetic average of commodity prices in effect on the first day of each of the previous twelve months, held flat for the life of the production, except where prices are defined by contractual arrangements. Operating costs, production and ad valorem taxes and future development costs are based on current costs with no escalation.\nThe Company has elected not to disclose probable and possible reserves or reserve estimates in this filing.\n57\nOffshore Decommissioning Contingency\nThe Company has potential exposure to future obligations related to divested properties. For information regarding estimated potential decommissioning obligations on sold properties, please refer to “Potential Decommissioning Obligations on Sold Properties” above and in \nNote 11—Commitments and Contingencies\n in the Notes to Consolidated Financial Statements set forth in Part IV, Item 15 of this Annual Report on Form 10-K.\nThe Company’s estimated contingent obligation is primarily associated with the abandonment, removal and decommissioning of offshore wells and platforms in the Gulf of America. Estimating any future obligation requires significant judgment. The Company utilizes actual abandonment and decommissioning costs incurred as the basis to estimate the expected cash outflows for future obligations. Actual costs incurred often vary based on each structure’s condition, depth-of-water, type, and other similar factors, which are key considerations when estimating the remaining well and platform decommissioning obligation. Asset removal technologies and costs are constantly changing, as are regulatory, political, environmental, and safety considerations. Changes in significant assumptions or the regulatory framework impacting the Company’s estimated liability could result in a liability in excess of the amount accrued.\nAsset Retirement Obligation (ARO)\nThe Company has significant obligations to remove tangible equipment and restore land or seabed at the end of oil and gas production operations. The Company’s removal and restoration obligations are primarily associated with plugging and abandoning wells and removing and disposing of offshore oil and gas platforms in the North Sea. Estimating the future restoration and removal costs is difficult and requires management to make estimates and judgments. Asset removal technologies and costs are constantly changing, as are regulatory, political, environmental, and safety considerations.\nARO associated with retiring tangible long-lived assets is recognized as a liability in the period in which the legal obligation is incurred and becomes determinable. The liability is offset by a corresponding increase in the underlying asset. The ARO liability reflects the estimated present value of the amount of dismantlement, removal, site reclamation, and similar activities associated with the Company’s oil and gas properties and other long-lived assets. The Company utilizes current retirement costs to estimate the expected cash outflows for retirement obligations. Inherent in the present value calculation are numerous assumptions and judgments including the ultimate settlement amounts, inflation factors, credit-adjusted discount rates, timing of settlement, and changes in the legal, regulatory, environmental, and political environments. Accretion expense is recognized over time as the discounted liability is accreted to its expected settlement value.\nIncome Taxes\nThe Company’s oil and gas exploration and production operations are subject to taxation on income in numerous jurisdictions worldwide. The Company records deferred tax assets and liabilities to account for the expected future tax consequences of events that have been recognized in its financial statements and tax returns. Management routinely assesses the ability to realize the Company’s deferred tax assets. If management concludes that it is more likely than not that some portion or all of the deferred tax assets will not be realized under accounting standards, the tax asset would be reduced by a valuation allowance. Numerous judgments and assumptions are inherent in the determination of future taxable income, including factors such as future operating conditions (particularly as related to prevailing oil and gas prices).\n58",
  "item2": null
}