{
  "source_file": "apd-20250630.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nThird Quarter 2025 in Summary\n46\nThird Quarter 2025 Results of Operations\n48\nFirst Nine Months 2025 in Summary\n55\nFirst Nine Months 2025 Results of Operations\n57\nReconciliations of Non-GAAP Financial Measures\n66\nLiquidity and Capital Resources\n74\nPension Benefits\n79\nCritical Accounting Policies and Estimates\n80\nThis Management’s Discussion and Analysis contains “forward-looking statements” within the safe harbor provisions of the Private Securities Litigation Reform Act of 1995, including statements about business outlook. These forward-looking statements are based on management’s expectations and assumptions as of the date of this Quarterly Report on Form 10-Q and are not guarantees of future performance. Actual performance and financial results may differ materially from projections and estimates expressed in the forward-looking statements because of many factors not anticipated by management, including, without limitation, those described in \"\nForward-Looking Statements\n\" and Item 1A, \nRisk Factors\n, of our Annual Report on Form 10-K for the fiscal year ended 30 September 2024 (the \"\n2024 Form 10-K\n\"),\n \nwhich was filed with the SEC on 21 November 2024.\nThis discussion should be read in conjunction with the interim consolidated financial statements and the accompanying notes contained in this Quarterly Report on Form 10-Q. Financial information is presented on a continuing operations basis. Unless otherwise stated, amounts discussed are in millions of U.S. Dollars, except for per share data, which is calculated and presented on a diluted basis in U.S. Dollars per weighted average common share.\nThe financial measures discussed below are presented in accordance with U.S. generally accepted accounting principles (\"GAAP\"), except as noted. We present certain financial measures on an \"adjusted\", or \"non-GAAP\", basis because we believe such measures, when viewed together with financial results computed in accordance with GAAP, provide a more complete understanding of the factors and trends affecting our historical financial performance. For each non-GAAP financial measure, including adjusted earnings per share (\"EPS\"), adjusted EBITDA, adjusted effective tax rate, and capital expenditures, we present a reconciliation to the most directly comparable financial measure calculated in accordance with GAAP. These reconciliations and explanations regarding the use of non-GAAP financial measures are presented under the “\nReconciliations of Non-GAAP Financial Measures\n” section beginning on page \n66\n.\nComparisons included in the discussion that follows are for the third quarter and first nine months of fiscal year 2025 versus (\"vs.\") the third quarter and first nine months of fiscal year 2024. The disclosures provided in this Quarterly Report on Form 10-Q are complementary to those made in our \n2024 Form 10-K\n.\nWe manage our operations, assess performance, and report earnings under five reportable segments: Americas, Asia, Europe, Middle East and India, and Corporate and other. The discussion that follows is based on these operations. Refer to Note 20, \nBusiness Segment Information\n, to the consolidated financial statements for additional information.\nFor information concerning activity with our related parties, refer to Note 19, \nSupplemental Information\n, to the consolidated financial statements.\n45\nTable of Contents\nTHIRD QUARTER 2025 VS. THIRD QUARTER 2024 \nTHIRD QUARTER 2025 IN SUMMARY\n•\nSales of $3.0 billion\n \nincreased 1%, or $37.2, as higher energy cost pass-through to customers of 3%, higher pricing of 1%, and a favorable impact from currency of 1% were partially offset by lower volumes of 4%. The lower volumes primarily reflect the September 2024 LNG business divestiture, lower global helium demand, and project exits, partially offset by higher on-sites.\n•\nOperating income of $790.6 increased 7%, or $53.0, reflecting gains from the sale of a business and other assets, non-helium merchant pricing, and cost improvements. These benefits were partially offset by shareholder activism-related costs, a net charge for updated cost estimates related to previously announced business and asset actions, and the September 2024 LNG business divestiture. Operating\n \nmargin of 26.2% increased 150 basis points (\"bp\") from 24.7% in the prior year.\n•\nEquity affiliates' income of $167.6 decreased 1%, or $1.3.\n•\nNet income of $723.2 increased 2%, or $14.3, as gains from the sale of a business and other assets, higher non-helium merchant pricing, and cost improvements were partially offset by lower volumes, shareholder activism-related costs, and a charge for business and asset actions.\n•\nAdjusted EBITDA of $1.3 billion increased 3%, or $42.9, driven by favorable costs and higher pricing, partially offset by lower volumes.\n•\nEPS of $3.24\n \nincreased 4%, or $0.11 per share. EPS major factors are summarized in the table presented on page \n47\n.\n•\nAdjusted EPS of $3.09 decreased 3%, or $0.11 per share. Adjusted EPS excludes a net gain of $0.15 per share driven by gains recognized on the sale of a business and other assets as well as other adjustments as summarized in the reconciliation on page \n67\n.\n46\nTable of Contents\nSummary of Changes in Earnings Per Share\nThe diluted per share impacts presented in the tables below were calculated independently and do not sum to the total change due to rounding.\nThree Months Ended\nChange vs.\nPrior Year\n30 June\n2025\n2024\nEarnings per share\n$3.20\n \n$3.13\n \n$0.07\n \nLess: Loss per share from discontinued operations\n(0.04)\n— \n(0.04)\nEarnings per share from continuing operations\n$3.24\n \n$3.13\n \n$0.11\n \n% Change from prior year\n4\n%\nOperating Items\nUnderlying business:\nVolume\n(0.08)\nPrice, net of variable costs\n0.05 \nOther costs\n0.03 \nCurrency\n0.01 \nBusiness and asset actions\n(0.07)\nShareholder activism-related costs\n(0.08)\nGain on sale of business\n0.23 \nGain on sale of other assets\n(A)\n0.11 \nTotal Operating Items\n$0.20\n \nOther Items\nInterest expense\n(0.02)\nOther non-operating income/expense, net:\nGain/Loss on de-designation of cash flow hedges\n(B)\n(0.01)\nNon-service pension cost, net\n0.05 \nOther\n(0.03)\nChange in effective tax rate\n(0.05)\nNoncontrolling interests\n(B)\n(0.02)\nTotal Other Items\n($0.08)\nTotal Change\n$0.11\n \n% Change from prior year\n4\n%\n(A)\nReflected on the consolidated income statements within \"Other income (expense), net.\"\n(B)\nThe per share impact reflected within \"Gain/Loss on de-designation of cash flow hedges\" was calculated based on an after-tax loss attributable to Air Products of $0.1 during the third quarter of fiscal year 2025 compared to a gain of $3.0 in the prior year period. The loss/gain attributable to noncontrolling interests was $0.1 and $7.3 for the three months ended 30 June 2025 and 2024, respectively.\n47\nTable of Contents\nThe table below summarizes the diluted per share impact of our non-GAAP adjustments for the third quarter of fiscal years 2025 and 2024:\nThree Months Ended\nChange vs.\nPrior Year\n30 June\n2025\n2024\nEarnings per Share\n$3.24\n \n$3.13\n \n$0.11\n \nBusiness and asset actions\n0.07 \n— \n0.07 \nShareholder activism-related costs\n0.08 \n— \n0.08 \nGain on sale of business\n(0.23)\n— \n(0.23)\nGain on sale of other assets\n(0.11)\n— \n(0.11)\n(Gain) Loss on de-designation of cash flow hedges\n— \n(0.01)\n0.01 \nNon-service pension cost, net\n0.04 \n0.09 \n(0.05)\nAdjusted Earnings per Share\n$3.09\n \n$3.20\n \n($0.11)\n% Change from prior year\n(3%)\nTHIRD QUARTER 2025 RESULTS OF OPERATIONS\nDiscussion of Third Quarter Consolidated Results\nThree Months Ended\n30 June\nChange vs. Prior Year\n2025\n2024\n$\n%\nGAAP Measures\nSales\n$3,022.7 \n$2,985.5 \n$37.2 \n1\n%\nOperating income\n790.6 \n737.6 \n53.0 \n7\n%\nOperating margin\n26.2\n%\n24.7\n%\n150\n bp\nEquity affiliates’ income\n$167.6 \n$168.9 \n($1.3)\n(1\n%)\nNet income\n723.2 \n708.9 \n14.3 \n2\n%\nNon-GAAP Measure\nAdjusted EBITDA\n$1,309.7 \n$1,266.8 \n$42.9 \n3\n%\nSales\nThe table below summarizes the major factors that impacted consolidated sales for the periods presented:\nVolume\n(4\n%)\nPrice\n1\n%\nEnergy cost pass-through to customers\n3\n%\nCurrency\n1\n%\nTotal Consolidated Sales Change\n1\n%\n48\nTable of Contents\nSales of $3.0 billion\n \nincreased 1%, or $37.2, as higher energy cost pass-through to customers of 3%, higher pricing of 1%, and a favorable impact from currency of 1% were partially offset by lower volumes of 4%. The increase in energy cost pass-through to customers was primarily due to higher natural gas prices in the U.S. Gulf Coast and California. The 1% total company price improvement, which equates to a 2% improvement for the merchant business, was driven by non-helium pricing actions primarily in the Europe and Americas segments. Currency was favorable as the U.S. Dollar weakened primarily against the British Pound Sterling and the Euro. Unfavorable volumes were driven by the divestiture of the LNG business in September 2024, which resulted in a headwind of approximately 2%, lower global helium demand, and previously announced project exits, partially offset by higher on-sites.\nCost of Sales and Gross Margin\nCost of sales of $2.0 billion increased 2%, or $34.5, primarily due to higher energy cost pass-through to customers of $100, an unfavorable currency impact of $25, and higher power and fuel costs in our merchant business of $10, partially offset by lower costs of $102 attributable to lower sales volumes. Other costs were relatively flat as productivity improvements and lower planned maintenance were largely offset by higher depreciation expense and fixed-cost inflation. Gross margin of 32.5% decreased 30 bp from 32.8% in the prior year primarily due to higher energy cost pass-through to customers. \nSelling and Administrative Expense\nSelling and administrative expense of $222.6 decreased 5%, or $12.8, as productivity improvements were partially offset by fixed-cost inflation. Selling and administrative expense as a percentage of sales decreased to 7.4% from 7.9% in the prior year.\nResearch and Development Expense\nResearch and development expense of $24.1 decreased 11%, or $2.9.\n \nResearch and development expense as a percentage of sales decreased to 0.8% from 0.9% in the prior year.\nBusiness and Asset Actions\nDuring the third quarter of fiscal year 2025, we recorded a charge of $24.1 ($15.4 after tax, or $0.07 per share) related to business and asset actions. This charge reflects updated cost estimates associated with our previously announced decision to exit certain clean energy generation and distribution projects. For additional information, refer to the discussion for the first nine months of fiscal year 2025 beginning on page \n58\n of this Management's Discussion and Analysis as well as Note 4, \nBusiness and Asset Actions\n, to the consolidated financial statements. The charge is not reflected in segment results.\nOur estimates related to exiting these projects reflect our best judgment based on information available as of 30 June 2025. Final settlement of these items may differ materially from our current estimates, which could impact our consolidated financial statements in future periods. Additionally, our Board of Directors continues to review the business, which may lead to decisions that could result in additional charges in future periods.\nShareholder Activism-Related Costs\nDuring the third quarter of fiscal year 2025, we recorded shareholder activism-related costs of $25.0 ($18.8 after tax, or $0.08 per share). These costs primarily reflect a cash reimbursement to Mantle Ridge for expenses incurred during its proxy engagement with Air Products. Refer to Note 19, \nSupplemental Information\n, for additional information. Shareholder activism-related costs are not reflected in segment results. \nGain on Sale of Business\nDuring the third quarter of fiscal year 2025, we recognized a gain of $67.3 ($51.9 after tax, or $0.23 per share) on the sale of our 100% ownership interest in a consolidated subsidiary in Singapore. This gain is not reflected in the results of the Asia segment. Refer to Note 5, \nAcquisitions and Divestitures\n, to the consolidated financial statements for additional information. Prior to the divestiture, the subsidiary contributed annual sales of approximately $50 to our Asia segment, primarily through the merchant gas supply mode.\nOther Income (Expense), Net\nOther income of $36.5 increased 82%, or $16.4. The increase was driven by a $31.3 gain ($23.8 after tax, or $0.11 per share) on the sale of a regional office in Hersham, England, which was not reflected in the results of the Europe segment. In the prior-year quarter, other income benefited from a favorable legal settlement in our Americas segment related to energy management charges in connection with an extreme weather event in 2021.\n49\nTable of Contents\nOperating Income and Operating Margin\nOperating income of $790.6 increased 7%, or $53.0. In fiscal year 2025, we recognized pre-tax gains totaling approximately $99 in connection with the sale of a consolidated subsidiary and a regional office, as described above. Compared to the prior year, higher pricing, net of power and fuel costs, favorably impacted operating results by $15, driven by non-helium merchant products. Costs were $9 favorable as productivity improvements and lower planned maintenance were partially offset by higher depreciation expense, fixed-cost inflation, and a favorable legal settlement recorded in the prior year. These items were partially offset by shareholder activism-related costs of $25 and charges for business and asset actions of $24. Additionally, volumes were unfavorable by $23, reflecting the September 2024 divestiture of the LNG business, lower global helium demand, and previously announced project exits. In the prior year, the LNG business contributed approximately $35 in operating income. These headwinds were partially offset by higher on-site volumes.\nOperating margin of 26.2% increased 150 bp compared to 24.7% in the prior year, primarily reflecting the margin impact of gains from the sale of a subsidiary and a regional office, partially offset by charges for business and asset actions and shareholder activism-related costs.\nEquity Affiliates' Income\nEquity affiliates' income of $167.6 decreased 1%, or $1.3.\nInterest Expense\nThree Months Ended\n30 June\n2025\n2024\nInterest incurred\n$161.1 \n$133.7 \nLess: Capitalized interest\n99.7 \n78.0 \nInterest expense\n$61.4 \n$55.7 \nInterest expense of $61.4 increased 10%, or $5.7, driven by the impact of project exits and a higher debt balance, partially offset by a higher carrying value of ongoing projects under construction.\nOther Non-Operating Income (Expense), Net\nOther non-operating expense of $6.0 increased $4.7 from the prior year. De-designated interest rate swaps related to financing for the NEOM Green Hydrogen Project resulted in an immaterial unrealized loss in the third quarter of fiscal year 2025, compared to a gain of $11.2 ($3.0 after tax, or $0.01 per share) in the prior year. Refer to Note 3, \nVariable Interest Entities\n, and Note 10, \nFinancial Instruments\n, to the consolidated financial statements for additional information. Additionally, we recognized lower interest income on short-term investments in fiscal year 2025. These items were partially offset by a decrease in non-service pension costs, which were $10.9 ($8.1 after tax, or $0.04 per share) for the third quarter of fiscal year 2025 versus $25.3 ($19.1 after tax, or $0.09 per share) in the prior year.\nDiscontinued Operations\nDuring the third quarter of fiscal year 2025, we recorded a pre-tax loss from discontinued operations of $10.6 ($8.0 after tax) primarily to increase our existing liability for retained environmental remediation obligations associated with production facilities in the atmospheric emulsions and global pressure sensitive adhesives businesses sold in 2008. Refer to the \"Piedmont\" discussion under Note 14, \nCommitments and Contingencies\n, for additional information. The loss did not have an impact on our statement of cash flows for the first nine months of fiscal year 2025.\n50\nTable of Contents\nNet Income\nNet income of $723.2 increased 2%, or $14.3. Fiscal year 2025 benefited from gains recognized in connection with the sale of a consolidated subsidiary and a regional office, higher non-helium merchant pricing, and lower non-service pension costs. Costs were also favorable, as productivity improvements and lower planned maintenance were partially offset by higher depreciation expense, fixed-cost inflation, and a prior year legal settlement. These items were partially offset by lower volumes, shareholder activism-related costs, and charges for business and asset actions. The lower volumes were primarily associated with the divestiture of the LNG business in September 2024. Additionally, fiscal year 2025 includes an after-tax loss from discontinued operations, primarily reflecting an increase to an existing liability for retained environmental remediation obligations associated with a previously divested business.\nAdjusted EBITDA\nAdjusted EBITDA of $1.3 billion increased 3%, or $42.9, driven by favorable costs and higher pricing, partially offset by lower volumes.\nEffective Tax Rate\nThe effective tax rate equals the income tax provision divided by income before taxes. Equity affiliates' income is primarily included net of income taxes within income before taxes on our consolidated income statements.\nOur effective tax rate was 17.9% and 16.6% for the three months ended 30 June 2025 and 2024, respectively. Our effective rate was higher in fiscal year 2025 due to lower tax benefits on both U.S. export income and excess tax benefits on share-based compensation, and higher net costs on foreign-related income taxed in the U.S. These increases were partially offset by larger benefits in fiscal year 2025 for the release of certain unrecognized tax benefits upon expiration of the statute of limitations.\nOur adjusted effective tax rate, which excludes the impact of adjustments presented in the \"Reconciliations of Non-GAAP Financial Measures\" section beginning on page \n66\n, was 18.1% and 16.9% for the three months ended 30 June 2025 and 2024, respectively. \nOn 4 July 2025, H.R.1, commonly referred to as the One Big Beautiful Bill Act (OBBBA), was enacted in the United States. OBBBA includes a broad range of tax reform provisions, including extending and modifying certain key Tax Cuts and Jobs Act provisions (both domestic and international), expanding certain Inflation Reduction Act incentives, and accelerating the phase-out of other provisions. We are evaluating the impacts of this legislation on our consolidated financial statements.\nDespite the OBBBA’s revisions to the Inflation Reduction Act incentives, we still anticipate future benefits from tax incentives for certain carbon sequestration and clean hydrogen production projects\n. \n51\nTable of Contents\nDiscussion of Third Quarter Results by Business Segment\nAmericas\nThree Months Ended\n30 June\nChange vs. Prior Year\n2025\n2024\n$\n%/bp\nSales\n$1,261.0 \n$1,234.7 \n$26.3 \n2\n%\nOperating income\n374.1 \n391.1 \n(17.0)\n(4\n%)\nOperating margin\n29.7\n%\n31.7\n%\n(200\n bp)\nEquity affiliates’ income\n$37.8 \n$37.5 \n$0.3 \n1\n%\nAdjusted EBITDA\n604.3 \n604.2 \n0.1 \n—\n%\nThe table below summarizes the major factors that impacted sales in the Americas segment for the periods presented:\nVolume\n(6\n%)\nPrice\n1\n%\nEnergy cost pass-through to customers\n7\n%\nCurrency\n—\n%\nTotal Americas Sales Change\n2\n%\nSales of $1.3 billion\n \nincreased 2%, or $26.3, as\n \nhigher energy cost pass-through to customers of 7% and favorable pricing of 1% were partially offset by lower volumes of 6%.\n \nHigher energy cost pass-through to customers was primarily attributable to higher natural gas prices in the U.S. Gulf Coast and California. The total segment price increase of 1% equates to a 3% improvement in our merchant business, primarily in non-helium product lines. Volumes were unfavorable primarily due to lower on-sites, including previously announced project exits, and lower helium demand.\nOperating income of $374.1 decreased 4%, or $17.0, primarily due to unfavorable costs of $21 and lower volumes of $4, partially offset by higher pricing, net of power and fuel costs in our merchant business, of $9. The unfavorable costs were driven by maintenance-related depreciation and a favorable prior year legal settlement. Operating margin of 29.7% decreased 200 bp from 31.7% in the prior year, primarily due to higher energy cost pass-through to customers.\nEquity affiliates’ income of $37.8 increased 1%, or $0.3.\n52\nTable of Contents\nAsia\nThree Months Ended\n30 June\nChange vs. Prior Year\n2025\n2024\n$\n%/bp\nSales\n$810.0 \n$789.6 \n$20.4 \n3\n%\nOperating income\n216.8 \n200.1 \n16.7 \n8\n%\nOperating margin\n26.8\n%\n25.3\n%\n150\n bp\nEquity affiliates’ income\n$9.5 \n$8.7 \n$0.8 \n9\n%\nAdjusted EBITDA\n353.0 \n324.3 \n28.7 \n9\n%\nThe table below summarizes the major factors that impacted sales in the Asia segment for the periods presented:\nVolume\n2\n%\nPrice\n(1\n%)\nEnergy cost pass-through to customers\n1\n%\nCurrency\n1\n%\nTotal Asia Sales Change\n3\n%\nSales of $810.0\n \nincreased 3%, or $20.4, as\n \nhigher volumes of 2%, higher energy cost pass-through to customers of 1%, and a favorable currency impact of 1%, were partially offset by lower pricing of 1%. The higher volumes were driven by on-sites, partially offset by lower helium demand. The total segment pricing decline of 1% equates to a 4% decline in our merchant business, which was primarily attributable to helium. \nOperating income of $216.8 increased 8%, or $16.7. Favorable costs of $25, primarily due to productivity improvements and lower maintenance, were partially offset by $10 of lower pricing, net of power and fuel costs, which was primarily attributable to helium. Operating margin of 26.8% increased 150 bp from 25.3% in the prior year, as the cost improvement was partially offset by lower helium pricing.\nEquity affiliates’ income of $9.5\n \nincreased 9%, or $0.8.\n53\nTable of Contents\nEurope\nThree Months Ended\n30 June\nChange vs. Prior Year\n2025\n2024\n$\n%/bp\nSales\n$770.5 \n$693.4 \n$77.1 \n11\n%\nOperating income\n225.2 \n204.7 \n20.5 \n10\n%\nOperating margin\n29.2\n%\n29.5\n%\n(30\n bp)\nEquity affiliates’ income\n$29.7 \n$26.3 \n$3.4 \n13\n%\nAdjusted EBITDA\n319.8 \n283.2 \n36.6 \n13\n%\nThe table below summarizes the major factors that impacted sales in the Europe segment for the periods presented:\nVolume\n3\n%\nPrice\n2\n%\nEnergy cost pass-through to customers\n1\n%\nCurrency\n5\n%\nTotal Europe Sales Change\n11\n%\nSales of $770.5\n \nincreased 11%, or $77.1, due to favorable currency of 5%, higher volumes of 3%, higher pricing of 2%, and higher energy cost pass-through to customers of 1%. Favorable currency was primarily attributable to weakening of the U.S. Dollar against the British Pound Sterling and the Euro. The higher volumes were driven by on-sites, partially offset by lower helium demand. The total segment price increase of 2% equates to a 4% improvement in our merchant business, driven by non-helium product lines.\nOperating income of $225.2 increased 10%, or $20.5, due to higher pricing of $14, net of power and fuel costs, favorable currency of $8, and higher volumes of $4, partially offset by higher costs of $5. The higher costs were driven by depreciation and fixed-cost inflation, partially offset by productivity improvements. Operating margin of 29.2% decreased 30 bp from 29.5% in the prior year as the higher costs and unfavorable business mix were partially offset by pricing.\nEquity affiliates’ income of $29.7\n \nincreased 13%, or $3.4, driven by an affiliate in Italy.\nMiddle East and India\nThree Months Ended\n30 June\nChange vs. Prior Year\n2025\n2024\n$\n%\nSales\n$38.3 \n$32.8 \n$5.5 \n17\n%\nOperating income (loss)\n8.1 \n(1.4)\n9.5 \n**\nEquity affiliates' income\n86.0 \n89.2 \n(3.2)\n(4\n%)\nAdjusted EBITDA\n100.9 \n94.6 \n6.3 \n7\n%\n**\n \nChange versus prior period is not meaningful.\nSales of $38.3\n \nincreased 17%, or $5.5, primarily due to higher volumes. Operating income was $8.1 compared to a loss of $1.4 in the prior year, which reflects the impact of lower costs and favorable volumes. \nEquity affiliates' income of $86.0\n \ndecreased 4%, or $3.2, driven by JIGPC.\n54\nTable of Contents\nCorporate and other\nThree Months Ended\n30 June\nChange vs. Prior Year\n2025\n2024\n$\n%\nSales\n$142.9 \n$235.0 \n($92.1)\n(39\n%)\nOperating loss\n(83.1)\n(56.9)\n(26.2)\n(46\n%)\nEquity affiliates' income\n4.6 \n7.2 \n(2.6)\n(36\n%)\nAdjusted EBITDA\n(68.3)\n(39.5)\n(28.8)\n(73\n%)\nSales of $142.9 decreased 39%, or $92.1, and operating loss of $83.1 increased 46%, or $26.2, primarily due to the divestiture of the LNG business in September 2024. Operating income generated by LNG in the prior year was approximately $35. The headwind from the LNG divestiture was partially offset by lower costs related to sale of equipment and productivity improvements.\nEquity affiliates' income of $4.6 decreased 36%, or $2.6, driven by an affiliate in Algeria.\nFIRST NINE MONTHS 2025 VS. FIRST NINE MONTHS 2024 \nFIRST NINE MONTHS 2025 IN SUMMARY\n•\nSales of $8.9 billion decreased $42.7. On a percentage basis, sales were flat as higher energy cost pass-through to customers of 2% and higher pricing of 1% were offset by lower volumes of 3%. Unfavorable volumes were driven by the September 2024 LNG divestiture, lower global helium demand, and previously announced project exits, partially offset by higher on-sites and favorable non-recurring items in the Americas segment. \n•\nOperating loss was $893.8 and operating margin was negative 10.1%, primarily due to project exit costs in fiscal year 2025. In the prior year, operating income was $2.0 billion and operating margin was 22.9%. \n•\nEquity affiliates' income of $463.7 decreased 1%, or $6.9, primarily due to lower income from JIGPC, a prior year asset sale in an Americas affiliate, and an impairment charge related to a joint venture in China that was recorded during the second quarter of fiscal year 2025. These impacts were partially offset by higher income from an affiliate in Italy.\n•\nNet loss was $364.5, primarily due to materially higher charges for business and asset actions in fiscal year 2025. In the prior year, net income was $1.9 billion. \n•\nAdjusted EBITDA of $3.7 billion increased 1%, or $28.2, as higher pricing and productivity improvements were partially offset by higher costs, lower volumes, and unfavorable currency.\n•\nLoss per share of $1.76\n \nwas driven by an after-tax charge attributable to Air Products of $2.3 billion for business and asset actions that was primarily recorded during the second quarter. In the prior year, earnings per share (\"EPS\") was $8.43. Major factors impacting earnings (loss) per share are summarized in the table presented on page \n56\n.\n•\nAdjusted EPS of $8.63 decreased 3%, or $0.24. Adjusted EPS excludes charges for business and asset actions and other items as summarized in the reconciliation on page \n67\n.\n55\nTable of Contents\nSummary of Changes in Earnings (Loss) Per Share\nThe diluted per share impacts presented in the tables below were calculated independently and do not sum to the total change due to rounding. \nNine Months Ended\nChange vs.\nPrior Year\n30 June\n2025\n2024\nEarnings (Loss) per share\n($1.79)\n$8.43\n \n($10.22)\nLess: Loss per share from discontinued operations\n(0.04)\n— \n(0.04)\nEarnings (Loss) per share from continuing operations\n($1.76)\n$8.43 \n($10.19)\n% Change from prior year\n**\nOperating Items\nUnderlying business:\nVolume\n($0.22)\nPrice, net of variable costs\n0.19 \nOther costs\n(0.15)\nCurrency\n(0.02)\nBusiness and asset actions\n(A)\n(10.13)\nShareholder activism-related costs\n(0.32)\nGain on sale of business\n0.23 \nGain on sale of other assets\n(B)\n0.11 \nTotal Operating Items\n($10.31)\nOther Impacts\nEquity method investment impairment associated with business and asset actions\n(A)\n($0.02)\nInterest expense\n0.08 \nOther non-operating income/expense, net:\nGain on de-designation of cash flow hedges\n(C)\n0.02 \nNon-service pension cost, net\n0.14 \nOther\n(0.07)\nChange in effective tax rate, excluding discrete items below\n(0.07)\nTax reform adjustment related to deemed foreign dividends\n0.16 \nTax on repatriation of foreign earnings\n(0.14)\nNoncontrolling interests\n(A)(C)\n0.02 \nTotal Other Items\n$0.12\n \nTotal Change\n($10.19)\n% Change from prior year\n**\n**Change versus prior period is not meaningful due to materially higher charges for business and asset actions in fiscal year 2025. The per share impact of these charges is primarily reflected in the \"Operating Items\" section in the table above.\n(A)\nThe per share impacts associated with charges for business and asset actions were calculated based on a total after-tax charge attributable to Air Products of $2.3 billion ($10.35 per share). The amount of the charges attributable to our noncontrolling partners was $3.5.\n(B)\nReflected on the consolidated income statements within \"Other income (expense), net.\"\n(C)\nThe per share impact reflected within \"Gain on de-designation of cash flow hedges\" was calculated based on an after-tax gain attributable to Air Products of $7.2 ($0.03 per share) compared to $3.0 ($0.01 per share) in the prior year. Amounts attributable to our noncontrolling partners were $17.6 and $7.3, respectively.\n56\nTable of Contents\nThe table below summarizes the diluted per share impact of our non-GAAP adjustments for the first nine months of fiscal years 2025 and 2024:\nNine Months Ended\nChange vs.\nPrior Year\n30 June\n2025\n2024\nEarnings (Loss) per Share\n($1.76)\n$8.43\n \n($10.19)\nBusiness and asset actions\n(A)\n10.35 \n0.20 \n10.15 \nShareholder activism-related costs\n0.32 \n— \n0.32 \nGain on sale of business\n(0.23)\n— \n(0.23)\nGain on sale of other assets\n(0.11)\n— \n(0.11)\nGain on de-designation of cash flow hedges\n(0.03)\n(0.01)\n(0.02)\nNon-service pension cost, net\n0.11 \n0.25 \n(0.14)\nTax reform adjustment related to deemed foreign dividends\n(0.16)\n— \n(0.16)\nTax on repatriation of foreign earnings\n0.14 \n— \n0.14 \nAdjusted Earnings per Share\n$8.63\n \n$8.87\n \n($0.24)\n% Change from prior year\n(3\n%)\n(A)\nThe charge for business and asset actions in fiscal year 2025 was primarily recorded within operating results. For additional information regarding this charge, Refer to Note 4, \nBusiness and Asset Actions\n, to the consolidated financial statements.\nFIRST NINE MONTHS 2025 RESULTS OF OPERATIONS\nDiscussion of First Nine Months Consolidated Results\nNine Months Ended\n30 June\nChange vs. Prior Year\n2025\n2024\n$\n%\nGAAP Measures\nSales\n$8,870.4 \n$8,913.1 \n($42.7)\n—\n%\nOperating income (loss)\n(893.8)\n2,041.7 \n(2,935.5)\n**\nOperating margin\n(10.1\n%)\n22.9\n%\n**\nEquity affiliates’ income\n$463.7 \n$470.6 \n($6.9)\n(1\n%)\nNet income (loss)\n(364.5)\n1,911.4 \n(2,275.9)\n**\nNon-GAAP Measure\nAdjusted EBITDA\n$3,667.8 \n$3,639.6 \n$28.2 \n1\n%\n**\n \nChange versus prior period is not meaningful due to pre-tax charges for business and asset actions of $3.0 billion in the first nine months of fiscal year 2025, the majority of which were recorded during the second quarter of fiscal year 2025. \n57\nTable of Contents\nSales\nThe table below summarizes the major factors that impacted consolidated sales for the periods presented:\nVolume\n(3\n%)\nPrice\n1\n%\nEnergy cost pass-through to customers\n2\n%\nCurrency\n—\n%\nTotal Consolidated Sales Change\n—\n%\nSales of $8.9 billion decreased $42.7 versus the prior year. On a percentage basis, sales were flat as lower volumes of 3% were partially offset by higher energy cost pass-through to customers of 2% and higher pricing of 1%. Unfavorable volumes were driven by the divestiture of the LNG business in September 2024, which resulted in a headwind of approximately 2%, lower global helium demand, and previously announced project exits within the Americas segment. These items were partially offset by higher on-sites and favorable non-recurring items in the Americas segment during the fiscal half of fiscal year 2025, which included a significant sale of helium to an existing merchant customer and a one-time customer contract amendment. The 1% total company price improvement, which equates to a 2% improvement for the merchant business, was primarily driven by non-helium pricing actions in the Americas and Europe segments.\nCost of Sales and Gross Margin\nCost of sales of $6.1 billion\n \nincreased 1%, or $46.2, due to\n \nhigher energy cost pass-through to customers of $191, higher costs of $60, and\n \nhigher power and fuel costs in our merchant business of $40.\n \nThe higher costs of $60 were driven by depreciation, fixed-cost inflation, and incentive compensation partially offset by productivity improvements.\n \nThese impacts were partially offset by lower costs of $223 attributable to sales volumes and a favorable currency impact of $22. Gross margin of 31.1% decreased 90 bp from 32.0% in the prior year.\nSelling and Administrative Expense\nSelling and administrative expense of $687.0\n \ndecreased 4%, or $27.4, as productivity improvements were partially offset by fixed-cost inflation and incentive compensation.\n \nSelling and administrative expense as a percentage of sales decreased to 7.7% from 8.0% in the prior year.\nResearch and Development Expense\nResearch and development expense of $69.0\n \ndecreased 12%, or $9.1. Research and development expense as a percentage of sales decreased to 0.8% from 0.9% in the prior year.\nBusiness and Asset Actions\nOur consolidated income statements include charges of $3.0 billion ($2.3 billion after tax attributable to Air Products, or $10.35 per share) and $57.0 ($43.8 after tax, or $0.20 per share) for the nine months ended 30 June 2025 and 2024, respectively, for the initiatives discussed below. Charges for business and asset actions are not reflected in segment results. \nThe charge in fiscal year 2025 primarily includes project exit costs resulting from an ongoing review of our project backlog, which led to a decision to exit various projects related to clean energy generation and distribution in the second quarter. The affected projects were primarily in our Americas segment. Our estimates related to exiting these projects reflect our best judgment based on information available as of 30 June 2025. Final settlement of these items may differ materially from our current estimates, which could impact our consolidated financial statements in future periods. Additionally, our Board of Directors continues to review the business, which may lead to decisions that could result in additional charges in future periods.\nThe charge also included $66.1 for involuntary termination benefits for additional actions identified under our existing global cost reduction plan. The charge related to this plan in the prior year was $57.0 ($43.8 after tax, or $0.20 per share). Once all actions under the plan are fully executed, we expect to realize annual pre-tax savings of approximately $185 to $195, primarily through selling and administrative expense. \nFor additional information, refer to Note 4, \nBusiness and Asset Actions\n, to the consolidated financial statements. \n58\nTable of Contents\nShareholder Activism-Related Costs\nIn fiscal year 2025, we incurred shareholder activism-related costs of $86.3 ($71.7 after tax, or $0.32 per share) in connection with a proxy contest that concluded in January 2025 following certification of the election of directors at the 2025 Annual Meeting of Shareholders. Shareholder activism-related costs are not reflected in segment results.\nShareholder activism-related costs recorded in fiscal year 2025 included $31.9 for legal and other professional service fees as well as incremental proxy solicitation costs related to the 2025 Annual Meeting of Shareholders; $29.7 for executive separation costs for our former CEO, which included a noncash expense of $22.4 to accelerate vesting of share-based awards and $7.3 for severance and other cash benefits; and $24.7 for a cash reimbursement to Mantle Ridge for expenses incurred during its proxy engagement. Refer to Note 19, \nSupplemental Information\n, for additional information.\nGain on Sale of Business\nDuring the third quarter of fiscal year 2025, we recognized a gain of $67.3 ($51.9 after tax, or $0.23 per share) on the sale of our 100% ownership interest in a consolidated subsidiary in Singapore. This gain is not reflected in the results of the Asia segment. Refer to Note 5, \nAcquisitions and Divestitures\n, to the consolidated financial statements for additional information. Prior to the divestiture, the subsidiary contributed annual sales of approximately $50 to our Asia segment, primarily through the merchant gas supply mode.\nOther Income (Expense), Net\nOther income of $73.3 increased 73%, or $30.9. The increase was driven by a $31.3 gain ($23.8 after tax, or $0.11 per share) on the sale of a regional office in Hersham, England, during the third quarter of fiscal year 2025. This gain is not reflected in the results of the Europe segment.\nOperating Income (Loss) and Operating Margin\nOperating loss was $893.8 during the first nine months of fiscal year 2025 compared to income of $2.0 billion in the prior year. The loss in fiscal year 2025 was primarily attributable to significantly higher pre-tax charges for business and asset actions, which totaled $3 billion in fiscal year 2025 versus $57 in the prior year. Volumes were lower by $59 driven by the divestment of the LNG business in September 2024. Operating income contributed by the LNG business in the prior year was approximately $95. Fiscal year 2025 also included shareholder activism-related costs of $86. Additionally, other costs were unfavorable by $40 as fixed-cost inflation, higher depreciation, and incentive compensation were partially offset by productivity improvements. We also recorded pre-tax gains totaling approximately $99 in connection with the sale of a consolidated subsidiary and the sale of a regional office during the third quarter of fiscal year 2025. Additionally, higher pricing driven by non-helium merchant products favorably impacted operating results by $51, net of power and fuel costs.\nOperating margin was negative 10.1% compared to positive 22.9% in the prior year, which was primarily attributable to the charge for business and asset actions. \nEquity Affiliates' Income\nEquity affiliates' income of $463.7 decreased 1%, or $6.9, primarily due to lower income from JIGPC, a prior year asset sale in an Americas affiliate, and an impairment charge related to a joint venture in China that was recorded as part of our business and asset actions during the second quarter of fiscal year 2025. These impacts were partially offset by higher income from an affiliate in Italy.\nInterest Expense\nNine Months Ended\n30 June\n2025\n2024\nInterest incurred\n$446.8 \n$367.8 \nLess: Capitalized interest\n300.6 \n198.7 \nInterest expense\n$146.2 \n$169.1 \nInterest expense decreased 14%, or $22.9, driven by a higher carrying value of ongoing projects under construction, partially offset by the impact of a higher debt balance and project exits.\n59\nTable of Contents\nOther Non-Operating Income (Expense), net\nOther non-operating income of $14.3 increased $39.6 from an expense of $25.3 in the prior year. The increase was driven by lower non-service pension costs, which were $32.1 ($24.0 after tax, or $0.11 per share) for the first nine months of fiscal year 2025 compared to $75.3 ($56.7 after tax, or $0.25 per share) in the prior year.\n \nAdditionally, de-designated interest rate swaps related to financing for the NEOM Green Hydrogen Project resulted in an unrealized gain of $27.0 ($7.2 attributable to Air Products after tax, or $0.03 per share), compared to $11.2 ($3.0 after tax, or $0.01 per share) in the prior year. Refer to Note 3, \nVariable Interest Entities\n, and Note 10, \nFinancial Instruments\n, to the consolidated financial statements for additional information. These items were partially offset by lower interest income on short-term investments.\nDiscontinued Operations\nDuring the third quarter of fiscal year 2025, we recorded a pre-tax loss from discontinued operations of $10.6 ($8.0 after tax) primarily to increase our existing liability for retained environmental remediation obligations associated with production facilities in the atmospheric emulsions and pressure sensitive adhesives businesses sold in 2008. Refer to the \"Piedmont\" discussion under Note 14, \nCommitments and Contingencies\n, for additional information. The loss did not have an impact on our statement of cash flows for the first nine months of fiscal year 2025.\nNet Income (Loss)\nNet loss was $364.5 during the first nine months of fiscal year 2025 compared to net income of $1.9 billion in the prior year. The loss in fiscal year 2025 was primarily attributable to significantly higher after-tax charges for business and asset actions, which totaled $2.3 billion in fiscal year 2025 versus $44 in the prior year. Additionally, the current year reflects shareholder activism-related costs, lower volumes associated with the divestiture of the LNG business in September 2024, and higher costs for fixed-cost inflation, higher depreciation, and incentive compensation, which were partially offset by productivity improvements. Additionally, fiscal year 2025 benefited from gains recognized in connection with the sale of a consolidated subsidiary and the sale of a regional office, higher non-helium merchant pricing, and lower non-service pension costs.\nAdjusted EBITDA\nAdjusted EBITDA of $3.7 billion increased 1%, or $28.2, as higher pricing and productivity improvements were partially offset by higher costs, lower volumes, and unfavorable currency.\nEffective Tax Rate\nThe effective tax rate equals the income tax provision divided by income before taxes. Equity affiliates' income is primarily included net of income taxes within income before taxes on our consolidated income statements.\nFor the nine months ended 30 June 2025, our consolidated income statements include an income tax benefit of $205.5 compared to an income tax expense of $406.5 for the prior year period. The tax benefit in fiscal year 2025 represents an effective tax rate of 36.6% on the pre-tax loss reported for the nine months ended 30 June 2025 compared to an effective rate of 17.5% for tax expense on the pre-tax income reported for the nine months ended 30 June 2024.\nThe current year rate was primarily impacted by a $3.0 billion pre-tax charge for business and asset actions and other items as further discussed below. Our estimates related to many of these items reflect our best judgment based on information available as of 30 June 2025. The amount and timing of final settlement of these items may differ from our current estimates, which could impact our tax provision in future periods.\nFor additional information, refer to Note 18, \nIncome Taxes\n, to the consolidated financial statements.\nTax Impact of Business and Asset Actions\nDuring fiscal year 2025, we recorded a pre-tax charge of $3.0 billion for the business and asset actions discussed in Note 4, \nBusiness and Asset Actions\n, to the consolidated financial statements. This charge had a related net income tax benefit of $649.3.\nTax Reform Adjustment Related to Deemed Foreign Dividends\nDuring the second quarter of fiscal year 2025, we recorded a $34.9 net income tax benefit related to our intent to file a refund claim after the review of several U.S. Tax Court cases regarding the U.S. taxation of deemed foreign dividends in the transition year of the Tax Cuts and Jobs Act (our fiscal year 2018).\n60\nTable of Contents\nTax on Repatriation of Foreign Earnings\nDuring the second quarter of fiscal year 2025, we recorded a $31.4 cost related to estimated withholding taxes on foreign earnings we no longer intend to indefinitely reinvest. There were no other significant changes to our assumptions regarding the reinvestment of foreign earnings during the first nine months of fiscal year 2025.\nShareholder Activism-Related Costs\nDuring fiscal year 2025, we incurred costs of $86.3 related to a proxy contest as further discussed in Note 19, \nSupplemental Information\n, to the consolidated financial statements. We recognized an income tax benefit of $14.6 primarily related to legal and other professional service fees as well as incremental proxy solicitation costs related to the 2025 Annual Meeting of Shareholders.\nOther\nIn addition to the items discussed above, our effective tax rate was higher in fiscal year 2025 due to lower tax benefits on U.S. export income, higher net costs on foreign-related income taxed in the U.S, and an income tax benefit for a tax election related to a non-U.S. subsidiary that occurred in our prior fiscal year but did not recur in fiscal year 2025. These increases were partially offset by larger benefits in fiscal year 2025 for the release of certain unrecognized tax benefits upon expiration of the statute of limitations.\nAdjusted Effective Tax Rate\nOur adjusted effective tax rate, which excludes the impact of adjustments presented in the \"Reconciliations of Non-GAAP Financial Measures\" section beginning on page \n66\n, was 18.6% and 17.9% for the nine months ended 30 June 2025 and 2024, respectively.\nOn 4 July 2025, H.R.1, commonly referred to as the One Big Beautiful Bill Act (OBBBA), was enacted in the United States. OBBBA includes a broad range of tax reform provisions, including extending and modifying certain key Tax Cuts and Jobs Act provisions (both domestic and international), expanding certain Inflation Reduction Act incentives, and accelerating the phase-out of other provisions. We are evaluating the impacts of this legislation on our consolidated financial statements.\nDespite the OBBBA’s revisions to the Inflation Reduction Act incentives, we still anticipate future benefits from tax incentives for certain carbon sequestration and clean hydrogen production projects\n. \n61\nTable of Contents\nDiscussion of First Nine Months Results by Business Segment\nAmericas\nNine Months Ended\n30 June\nChange vs. Prior Year\n2025\n2024\n$\n%/bp\nSales\n$3,835.8 \n$3,732.6 \n$103.2 \n3\n%\nOperating income\n1,128.0 \n1,117.4 \n10.6 \n1\n%\nOperating margin\n29.4\n%\n29.9\n%\n(50\n bp)\nEquity affiliates’ income\n$104.1 \n$118.8 \n($14.7)\n(12\n%)\nAdjusted EBITDA\n1,776.3 \n1,755.6 \n20.7 \n1\n%\nThe table below summarizes the major factors that impacted sales in the Americas segment for the periods presented:\nVolume\n(1\n%)\nPrice\n2\n%\nEnergy cost pass-through to customers\n3\n%\nCurrency\n(1\n%)\nTotal Americas Sales Change\n3\n%\nSales of $3.8 billion\n \nincreased 3%, or $103.2, as higher energy cost pass-through to customers of 3% and higher pricing of 2% were partially offset by lower volumes of 1% and an unfavorable currency impact of 1%. Higher energy cost pass-through to customers was primarily attributable to higher natural gas prices. The total segment pricing increase of 2% equates to a 4% improvement in our merchant business,\n \nprimarily in non-helium product lines\n. \nVolumes were unfavorable primarily due to lower on-sites, including previously announced project exits, and lower helium demand despite a significant, non-recurring sale of helium to an existing merchant customer during the first quarter. These headwinds were partially offset by a favorable one-time customer contract amendment in the second quarter of fiscal year 2025.\nOperating income of $1.1 billion increased 1%, or $10.6, due to favorable volumes of $49 and positive pricing, net of power and fuel costs in our merchant business, of $38, partially offset by higher costs of $68 and unfavorable currency of $8. The higher costs primarily reflect higher depreciation, fixed-cost inflation, and  maintenance, which were partially offset by productivity improvements. Additionally, income recognized on the sale of an equity method investment in the first quarter of fiscal year 2025 was largely offset by a favorable prior year legal settlement. Operating margin of 29.4% decreased 50 bp from 29.9% in the prior year as the margin impacts of higher costs and higher energy cost pass-through to customers were partially offset by favorable business mix. Higher energy cost pass-through to customers accounted for approximately 100 bp of the decline.\nEquity affiliates’ income of $104.1\n \ndecreased 12%, or $14.7, driven by\n \nour share of income from an asset sale in the prior year as well as lower income from an affiliate in Mexico. \n62\nTable of Contents\nAsia\nNine Months Ended\n30 June\nChange vs. Prior Year\n2025\n2024\n$\n%/bp\nSales\n$2,401.2 \n$2,363.1 \n$38.1 \n2\n%\nOperating income\n624.6 \n614.9 \n9.7 \n2\n%\nOperating margin\n26.0\n%\n26.0\n%\n—\n bp\nEquity affiliates’ income\n$30.3 \n$21.2 \n$9.1 \n43\n%\nAdjusted EBITDA\n1,036.3 \n979.8 \n56.5 \n6\n%\nThe table below summarizes the major factors that impacted sales in the Asia segment for the periods presented:\nVolume\n2\n%\nPrice\n(1\n%)\nEnergy cost pass-through to customers\n2\n%\nCurrency\n(1\n%)\nTotal Asia Sales Change\n2\n%\nSales of $2.4 billion\n \nincreased 2%, or $38.1, as\n \nhigher volumes of 2% and higher energy cost pass-through to customers of 2% were partially offset by lower pricing of 1% and an unfavorable currency impact of 1%. Higher on-site volumes were partially offset by lower helium demand. The total segment pricing decline of 1% equates to a 2% decline in our merchant business, which was primarily attributable to helium.\nOperating income of $624.6 increased 2%, or $9.7, primarily due to lower costs of $35 partially offset by lower pricing, net of power and fuel costs, of $22 and unfavorable currency of $6. The cost improvement was primarily attributable to productivity and lower maintenance costs, which was partially offset by higher costs related to incentive compensation and fixed-cost inflation. Operating margin of 26.0% was flat versus the prior year as the margin impact of lower costs was offset by lower helium pricing.\nEquity affiliates’ income of $30.3 increased 43%, or $9.1, driven by\n \nprior year maintenance expense at an affiliate in China as well as higher income from affiliates in Thailand. \n63\nTable of Contents\nEurope\nNine Months Ended\n30 June\nChange vs. Prior Year\n2025\n2024\n$\n%/bp\nSales\n$2,195.1 \n$2,092.5 \n$102.6 \n5\n%\nOperating income\n607.2 \n603.3 \n3.9 \n1\n%\nOperating margin\n27.7\n%\n28.8\n%\n(110\n bp)\nEquity affiliates’ income\n$75.6 \n$58.7 \n$16.9 \n29\n%\nAdjusted EBITDA\n859.0 \n813.2 \n45.8 \n6\n%\nThe table below summarizes the major factors that impacted sales in the Europe segment for the periods presented:\nVolume\n—\n%\nPrice\n2\n%\nEnergy cost pass-through to customers\n2\n%\nCurrency\n1\n%\nTotal Europe Sales Change\n5\n%\nSales of $2.2 billion\n \nincreased 5%, or $102.6, due to higher pricing of 2%, higher energy cost pass-through to customers of 2%, and a favorable impact from currency of 1%. The total segment price increase of 2% equates to a 4% improvement in our merchant business, driven by non-helium product lines. Volumes were flat as higher on-sites were offset by lower helium demand.\nOperating income of $607.2 increased 1%, or $3.9, due to favorable pricing, net of power and fuel costs, of $35 and favorable currency of $5, partially offset by unfavorable business mix of $24 and higher costs of $12. Higher costs for depreciation and fixed-cost inflation were partially offset by productivity improvements. Operating margin of 27.7% decreased 110 bp from 28.8% in the prior year as the margin impacts of unfavorable business mix, higher costs, and higher energy cost pass-through to customers were partially offset by higher non-helium pricing.\nEquity affiliates’ income of $75.6\n \nincreased 29%, or $16.9, driven by higher income from our affiliate in Italy.\nMiddle East and India\nNine Months Ended\n30 June\nChange vs. Prior Year\n2025\n2024\n$\n%\nSales\n$103.9 \n$103.9 \n$— \n—\n%\nOperating income (loss)\n4.6 \n8.1 \n(3.5)\n(43\n%)\nEquity affiliates' income\n249.2 \n256.0 \n(6.8)\n(3\n%)\nAdjusted EBITDA\n273.5 \n284.2 \n(10.7)\n(4\n%)\nSales of $103.9 were flat as higher volumes and unfavorable currency were immaterial. Operating income of $4.6 decreased 43%, or $3.5, primarily due to higher costs. \nEquity affiliates' income of $249.2\n \ndecreased 3%, or $6.8, driven by JIGPC. \n64\nTable of Contents\nCorporate and other\nNine Months Ended\n30 June\nChange vs. Prior Year\n2025\n2024\n$\n%\nSales\n$334.4 \n$621.0 \n($286.6)\n(46\n%)\nOperating loss\n(318.5)\n(245.0)\n(73.5)\n(30\n%)\nEquity affiliates' income\n11.3 \n15.9 \n(4.6)\n(29\n%)\nAdjusted EBITDA\n(277.3)\n(193.2)\n(84.1)\n(44\n%)\nSales of $334.4 decreased 46%, or $286.6, and operating loss of $318.5 increased 30%, or $73.5, primarily due to the divestiture of the LNG business in September 2024. Operating income generated by LNG in the prior year was approximately $95. These impacts were partially offset by productivity improvements.\nEquity affiliates' income of $11.3 decreased 29%, or $4.6, driven by an affiliate in Algeria.\n65\nTable of Contents\nRECONCILIATIONS OF NON-GAAP FINANCIAL MEASURES\n(Millions of U.S. Dollars unless otherwise indicated, except for per share data)\nWe present certain financial measures, other than in accordance with U.S. generally accepted accounting principles (\"GAAP\"), on an \"adjusted\" or \"non-GAAP\" basis. On a consolidated basis, these measures include adjusted operating income, adjusted earnings per share (\"EPS\"), adjusted EBITDA, the adjusted effective tax rate, and capital expenditures, while on a segment basis, we present adjusted EBITDA. In addition to these measures, we also present certain supplemental non-GAAP financial measures to help the reader understand the impact that certain disclosed items, or \"non-GAAP adjustments,\" have on the calculation of our adjusted EPS. For each non-GAAP financial measure, we present a reconciliation to the most directly comparable financial measure calculated in accordance with GAAP. \nWe provide these non-GAAP financial measures to allow investors, potential investors, securities analysts, and others to evaluate the performance of our business in the same manner as our management. We believe these measures, when viewed together with financial results computed in accordance with GAAP, provide a more complete understanding of the factors and trends affecting our historical financial performance and projected future results. However, we caution readers not to consider these measures in isolation or as a substitute for the most directly comparable measures calculated in accordance with GAAP. Readers should also consider the limitations associated with these non-GAAP financial measures, including the potential lack of comparability of these measures from one company to another.\nIn many cases, non-GAAP financial measures are determined by adjusting the most directly comparable GAAP measure to exclude gains or losses that we believe are not representative of our underlying business performance. For example, we exclude the impact of the non-service components of net periodic benefit/cost for our defined benefit pension plans. Non-service related components are recurring, non-operating items that include interest cost, expected returns on plan assets, prior service cost amortization, actuarial loss amortization, as well as special termination benefits, curtailments, and settlements. The net impact of non-service related components is reflected within “Other non-operating income (expense), net” on our consolidated income statements. Adjusting for the impact of non-service pension components provides management and users of our financial statements with a more accurate representation of our underlying business performance because these components are driven by factors that are unrelated to our operations, such as volatility in equity and debt markets. Further, non-service related components are not indicative of our defined benefit plans’ future contribution needs due to the funded status of the plans. Additionally, our adjustments this quarter include other gains and losses that are not associated with the ongoing operation of our business. These items are oftentimes difficult to predict; however, the reader should be aware that we may recognize similar gains or losses in the future.\nWhen applicable, the tax impact of our pre-tax non-GAAP adjustments reflects the expected current and deferred income tax impact of our non-GAAP adjustments. These tax impacts are primarily driven by the statutory tax rate of the various relevant jurisdictions and the taxability of the adjustments in those jurisdictions. Additionally, in some cases, we may adjust for tax-only items, such as the income tax benefit related to U.S. tax reform and additional withholding taxes related to the repatriation of foreign earnings.  \n66\nTable of Contents\nADJUSTED OPERATING INCOME AND ADJUSTED EPS\nIn addition to adjusted EPS, adjusted operating income is an important measure to evaluate our business performance following the appointment of our new Chief Executive Officer in February 2025. The table below provides a reconciliation to the most directly comparable GAAP measure for adjusted operating income, as well as for each of the major components used to calculate adjusted EPS. In periods that we have non-GAAP adjustments, we believe it is important for readers to understand the impact of each such adjustment because management does not consider these impacts when evaluating underlying business performance. Per share impacts are calculated independently and may not sum to total GAAP EPS and total adjusted EPS due to rounding.\n \nThree Months Ended 30 June\nQ3 2025 vs. Q3 2024\nOperating \nIncome/Loss\nEquity\n Affiliates'\n Income\nOther Non-Operating Inc/Exp, Net\nIncome Tax Benefit/Expense\nNet Income/Loss Attributable to Air Products\nEarnings/Loss per Share\n(A)\nQ3 2025 GAAP\n$790.6 \n$167.6 \n($6.0)\n$159.6 \n$721.8 \n$3.24 \nQ3 2024 GAAP\n737.6 \n168.9 \n(1.3)\n140.6 \n696.6 \n3.13 \n$ GAAP Change\n$53.0 \n$0.11 \n% GAAP Change \n7%\n4%\nQ3 2025 GAAP\n$790.6 \n$167.6 \n($6.0)\n$159.6 \n$721.8 \n$3.24 \nBusiness and asset actions\n24.1 \n— \n— \n8.7 \n15.4 \n0.07 \nShareholder activism-related costs\n25.0 \n— \n— \n6.2 \n18.8 \n0.08 \nGain on sale of business\n(67.3)\n— \n— \n(15.4)\n(51.9)\n(0.23)\nGain on sale of other assets\n(B)\n(31.3)\n— \n— \n(7.5)\n(23.8)\n(0.11)\nLoss on de-designation of cash flow hedges\n(C)\n— \n— \n0.3 \n0.1 \n0.1 \n— \nNon-service pension cost, net\n— \n— \n10.9 \n2.8 \n8.1 \n0.04 \nQ3 2025 Adjusted Measures\n$741.1 \n$167.6 \n$5.2 \n$154.5 \n$688.5 \n$3.09 \nQ3 2024 GAAP\n$737.6 \n$168.9 \n($1.3)\n$140.6 \n$696.6 \n$3.13 \nGain on de-designation of cash flow hedges\n(C)\n— \n— \n(11.2)\n(0.9)\n(3.0)\n(0.01)\nNon-service pension cost, net\n— \n— \n25.3 \n6.2 \n19.1 \n0.09 \nQ3 2024 Adjusted Measures\n$737.6 \n$168.9 \n$12.8 \n$145.9 \n$712.7 \n$3.20 \n$ Adjusted Change\n$3.5 \n($0.11)\n% Adjusted Change\n—%\n(3%)\n(A)\nCalculated and presented on a diluted basis from continuing operations attributable to Air Products. \n(B)\nReflected on the consolidated income statements within \"Other income (expense), net.\"\n(C)\nThe loss (gain) attributable to noncontrolling interests was $0.1 and ($7.3) for the three months ended 30 June 2025 and 2024, respectively.\n67\nTable of Contents\nNine Months Ended 30 June\n2025 vs. 2024\nOperating \nIncome/Loss\nEquity\n Affiliates'\n Income\nOther Non-Operating Inc/Exp, Net\nIncome Tax Benefit/Expense\nNet Income/Loss Attributable to Air Products\nEarnings/Loss per Share\n(A)\n2025 GAAP\n($893.8)\n$463.7 \n$14.3 \n($205.5)\n($391.4)\n($1.76)\n2024 GAAP\n2,041.7 \n470.6 \n(25.3)\n406.5 \n1,878.3 \n8.43 \n$ GAAP Change\n($2,935.5)\n($10.19)\n% GAAP Change\n**\n**\n2025 GAAP\n($893.8)\n$463.7 \n$14.3 \n($205.5)\n($391.4)\n($1.76)\nBusiness and asset actions\n(B)\n2,952.0 \n6.8 \n— \n649.3 \n2,306.0 \n10.35 \nShareholder activism-related costs\n86.3 \n— \n— \n14.6 \n71.7 \n0.32 \nGain on sale of business\n(67.3)\n— \n— \n(15.4)\n(51.9)\n(0.23)\nGain on sale of other assets\n(C)\n(31.3)\n— \n— \n(7.5)\n(23.8)\n(0.11)\nGain on de-designation of cash flow hedges\n(D)\n— \n— \n(27.0)\n(2.2)\n(7.2)\n(0.03)\nNon-service pension cost, net\n— \n— \n32.1 \n8.1 \n24.0 \n0.11 \nTax reform adjustment related to deemed foreign dividends\n— \n— \n— \n34.9 \n(34.9)\n(0.16)\nTax on repatriation of foreign earnings\n— \n— \n— \n(31.4)\n31.4 \n0.14 \n2025 Adjusted Measures\n$2,045.9 \n$470.5 \n$19.4 \n$444.9 \n$1,923.9 \n$8.63 \n2024 GAAP\n$2,041.7 \n$470.6 \n($25.3)\n$406.5 \n$1,878.3 \n$8.43 \nBusiness and asset actions\n57.0 \n— \n— \n13.2 \n43.8 \n0.20 \nGain on de-designation of cash flow hedges\n(D)\n— \n— \n(11.2)\n(0.9)\n(3.0)\n(0.01)\nNon-service pension cost, net\n— \n— \n75.3 \n18.6 \n56.7 \n0.25 \n2024 Adjusted Measures\n$2,098.7 \n$470.6 \n$38.8 \n$437.4 \n$1,975.8 \n$8.87 \n$ Adjusted Change\n($52.8)\n($0.24)\n% Adjusted Change\n(3%)\n(3%)\n(A)\nCalculated and presented on a diluted basis from continuing operations attributable to Air Products. Because we reported a loss from operations in fiscal year 2025, GAAP loss per share is calculated using the basic weighted average share value of 222.7 million, which does not consider outstanding share-based awards due to their anti-dilutive effect. Adjusted earnings per share is calculated using a diluted weighted average share value of 222.9 million.\n(B)\nLoss attributable to noncontrolling interests was $3.5.\n(C)\nReflected on the consolidated income statements in \"Other income (expense), net.\"\n(D)\nGain attributable to noncontrolling interests was $17.6 and $7.3 for the nine months ended 30 June 2025 and 2024, respectively.\n**\n \nChange versus prior period is not meaningful due to the $3.0 billion pre-tax charge for business and asset actions in fiscal year 2025. Refer to Note 4, \nBusiness and Asset Actions\n, to the consolidated financial statements for additional information. \n68\nTable of Contents\nADJUSTED EBITDA \nWe define adjusted EBITDA as net income or loss less income or loss from discontinued operations, net of tax, and excluding non-GAAP adjustments, which we do not believe to be indicative of underlying business trends, before interest expense, other non-operating income (expense), net, income tax expense (benefit), and depreciation and amortization expense. Adjusted EBITDA provides a useful metric for management to assess operating performance on both a consolidated and a segment basis.\nThe table below presents a reconciliation of net income (loss) on a GAAP basis to adjusted EBITDA:\nThree Months Ended\n30 June\nNine Months Ended \n30 June\n2025\n2024\n2025\n2024\nNet income (loss)\n$723.2 \n$708.9 \n($364.5)\n$1,911.4 \nLess: Loss from discontinued operations, net of tax\n(8.0)\n— \n(8.0)\n— \nAdd: Interest expense\n61.4 \n55.7 \n146.2 \n169.1 \nLess: Other non-operating income (expense), net\n(6.0)\n(1.3)\n14.3 \n(25.3)\nAdd: Income tax expense (benefit)\n159.6 \n140.6 \n(205.5)\n406.5 \nAdd: Depreciation and amortization\n401.0 \n360.3 \n1,151.4 \n1,070.3 \nAdd: Business and asset actions\n24.1 \n— \n2,952.0 \n57.0 \nAdd: Shareholder activism-related costs\n25.0 \n— \n86.3 \n— \nLess: Gain on sale of business\n67.3 \n— \n67.3 \n— \nLess: Gain on sale of other assets\n31.3 \n— \n31.3 \n— \nAdd: Equity method investment impairment associated with business and asset actions\n— \n— \n6.8 \n— \nAdjusted EBITDA\n$1,309.7 \n$1,266.8 \n$3,667.8 \n$3,639.6 \nChange GAAP\nNet income (loss) $ change\n$14.3\n($2,275.9)\nNet income (loss) % change\n2%\n**\nChange Non-GAAP\nAdjusted EBITDA $ change\n$42.9\n$28.2\nAdjusted EBITDA % change\n3%\n1%\n**\n \nChange versus prior period is not meaningful due to pre-tax charges for business and asset actions of $3.0 billion in the first nine months of fiscal year 2025, the majority of which were recorded during the second quarter of fiscal year 2025. \n69\nTable of Contents\nThe tables below present a reconciliation of operating income (loss) by segment to adjusted EBITDA by segment for the three and nine months ended 30 June 2025 and 2024:\nThree Months Ended\nNine Months Ended\n30 June\nChange vs.\n Prior Year\n30 June\nChange vs.\nPrior Year\nAmericas\n2025\n2024\n$\n%\n2025\n2024\n$\n%\nOperating income\n$374.1 \n$391.1 \n($17.0)\n(4\n%)\n$1,128.0 \n$1,117.4 \n$10.6 \n1\n%\nAdd: Depreciation and amortization\n192.4 \n175.6 \n544.2 \n519.4 \nAdd: Equity affiliates' income\n37.8 \n37.5 \n104.1 \n118.8 \nAdjusted EBITDA\n$604.3 \n$604.2 \n$0.1 \n—\n%\n$1,776.3 \n$1,755.6 \n$20.7 \n1\n%\nThree Months Ended\nNine Months Ended\n30 June\nChange vs.\n Prior Year\n30 June\nChange vs.\nPrior Year\nAsia\n2025\n2024\n$\n%\n2025\n2024\n$\n%\nOperating income\n$216.8 \n$200.1 \n$16.7 \n8\n%\n$624.6 \n$614.9 \n$9.7 \n2\n%\nAdd: Depreciation and amortization\n126.7 \n115.5 \n381.4 \n343.7 \nAdd: Equity affiliates' income\n9.5 \n8.7 \n30.3 \n21.2 \nAdjusted EBITDA\n$353.0 \n$324.3 \n$28.7 \n9\n%\n$1,036.3 \n$979.8 \n$56.5 \n6\n%\nThree Months Ended\nNine Months Ended\n30 June\nChange vs.\n Prior Year\n30 June\nChange vs.\nPrior Year\nEurope\n2025\n2024\n$\n%\n2025\n2024\n$\n%\nOperating income\n$225.2 \n$204.7 \n$20.5 \n10\n%\n$607.2 \n$603.3 \n$3.9 \n1\n%\nAdd: Depreciation and amortization\n64.9 \n52.2 \n176.2 \n151.2 \nAdd: Equity affiliates' income\n29.7 \n26.3 \n75.6 \n58.7 \nAdjusted EBITDA\n$319.8 \n$283.2 \n$36.6 \n13\n%\n$859.0 \n$813.2 \n$45.8 \n6\n%\n70\nTable of Contents\nThree Months Ended\nNine Months Ended\n30 June\nChange vs. \nPrior Year\n30 June\nChange vs.\nPrior Year\nMiddle East and India\n2025\n2024\n$\n%\n2025\n2024\n$\n%\nOperating income (loss)\n$8.1 \n($1.4)\n9.5 \n**\n$4.6 \n$8.1 \n($3.5)\n(43\n%)\nAdd: Depreciation and amortization\n6.8 \n6.8 \n19.7 \n20.1 \nAdd: Equity affiliates' income\n86.0 \n89.2 \n249.2 \n256.0 \nAdjusted EBITDA\n$100.9 \n$94.6 \n$6.3 \n7\n%\n$273.5 \n$284.2 \n($10.7)\n(4\n%)\n**\n \nChange versus prior period is not meaningful.\nThree Months Ended\nNine Months Ended\n30 June\nChange vs.\n Prior Year\n30 June\nChange vs.\nPrior Year\nCorporate and other\n2025\n2024\n$\n%\n2025\n2024\n$\n%\nOperating loss\n($83.1)\n($56.9)\n(26.2)\n(46\n%)\n($318.5)\n($245.0)\n($73.5)\n(30\n%)\nAdd: Depreciation and amortization\n10.2 \n10.2 \n29.9 \n35.9 \nAdd: Equity affiliates' income\n4.6 \n7.2 \n11.3 \n15.9 \nAdjusted EBITDA\n($68.3)\n($39.5)\n($28.8)\n(73\n%)\n($277.3)\n($193.2)\n($84.1)\n(44\n%)\n71\nTable of Contents\nADJUSTED EFFECTIVE TAX RATE\nThe effective tax rate equals the income tax provision divided by income before taxes. We calculate our adjusted effective tax rate by adjusting the numerator and denominator to exclude the tax and before tax impacts of our non-GAAP adjustments, respectively. The table below presents a reconciliation of the GAAP effective tax rate to our adjusted effective tax rate:\nThree Months Ended\n30 June\nNine Months Ended\n30 June\n  \n2025\n2024\n2025\n2024\nIncome tax expense (benefit)\n$159.6 \n$140.6 \n($205.5)\n$406.5 \nIncome (Loss) from continuing operations before taxes\n890.8 \n849.5 \n(562.0)\n2,317.9 \nEffective tax rate\n17.9\n%\n16.6\n%\n36.6\n%\n17.5\n%\nReconciliation of GAAP to Non-GAAP:\nIncome tax expense (benefit)\n$159.6 \n$140.6 \n($205.5)\n$406.5 \nBusiness and asset actions tax impact\n8.7 \n— \n649.3 \n13.2 \nShareholder activism-related costs tax impact\n6.2 \n— \n14.6 \n— \nGain on sale of business tax impact\n(15.4)\n— \n(15.4)\n— \nGain on sale of other assets tax impact\n(7.5)\n— \n(7.5)\n— \n(Gain) Loss on de-designation of cash flow hedges tax impact\n0.1 \n(0.9)\n(2.2)\n(0.9)\nNon-service pension cost, net tax impact\n2.8 \n6.2 \n8.1 \n18.6 \nTax reform adjustment related to deemed foreign dividends\n— \n— \n34.9 \n— \nTax on repatriation of foreign earnings\n— \n— \n(31.4)\n— \nAdjusted income tax expense\n$154.5 \n$145.9 \n$444.9 \n$437.4 \nIncome (Loss) from continuing operations before taxes\n$890.8 \n$849.5 \n($562.0)\n$2,317.9 \nBusiness and asset actions\n24.1 \n— \n2,952.0 \n57.0 \nShareholder activism-related costs\n25.0 \n— \n86.3 \n— \nGain on sale of business\n(67.3)\n— \n(67.3)\n— \nGain on sale of other assets\n(31.3)\n— \n(31.3)\n— \n(Gain) Loss on de-designation of cash flow hedges\n0.3 \n(11.2)\n(27.0)\n(11.2)\nNon-service pension cost, net\n10.9 \n25.3 \n32.1 \n75.3 \nBusiness and asset actions\n—\nequity method investment\n— \n— \n6.8 \n— \nAdjusted income from continuing operations before taxes\n$852.5 \n$863.6 \n$2,389.6 \n$2,439.0 \nAdjusted effective tax rate\n18.1\n%\n16.9\n%\n18.6\n%\n17.9\n%\n72\nTable of Contents\nCAPITAL EXPENDITURES\nCapital expenditures is a non-GAAP financial measure that we define as the sum of cash flows for additions to plant and equipment, including long-term deposits, acquisitions (less cash acquired), investment in and advances to unconsolidated affiliates, and investment in financing receivables on our consolidated statements of cash flows. Additionally, we adjust additions to plant and equipment to exclude NEOM Green Hydrogen Company (“NGHC”) expenditures funded by the joint venture's project financing, which is non-recourse to Air Products, as well as our partners’ equity contributions to arrive at a measure that we believe is more representative of our investment activities. Substantially all the funding we provide to NGHC is limited for use by the venture for its capital expenditures. \nA reconciliation of cash used for investing activities to our reported capital expenditures is provided below:\nNine Months Ended\n30 June\n2025\n2024\nCash used for investing activities\n$5,681.0 \n$4,773.8 \nProceeds from sale of assets and investments\n185.4 \n26.3 \nPurchases of short-term investments\n(117.6)\n(141.4)\nProceeds from short-term investments\n122.5 \n413.1 \nOther investing activities\n112.7 \n45.9 \nNGHC expenditures not funded by Air Products' equity\n(A)\n(1,981.2)\n(1,242.0)\nCapital expenditures\n$4,002.8 \n$3,875.7 \n(A)\nReflects the portion of \"Additions to plant and equipment, including long-term deposits\" that is associated with NGHC, less our approximate cash investment in the joint venture.\n73\nTable of Contents\nLIQUIDITY AND CAPITAL RESOURCES\nWe believe we have sufficient cash, cash flows from operations, and funding sources to meet our liquidity needs. As further discussed in the \"\nCash Flows From Financing Activities\n\" section below, we have the ability to raise capital through a variety of financing activities, including accessing capital or commercial paper markets or drawing upon our credit facilities.\nAs of 30 June 2025, we had $1.7 billion of foreign cash and cash items compared to total cash and cash items of $2.3 billion. We do not expect that a significant portion of the earnings of our foreign subsidiaries and affiliates will be subject to U.S. income tax upon repatriation to the U.S. Depending on the country in which the subsidiaries and affiliates reside, the repatriation of these earnings may be subject to foreign withholding and other taxes. However, since we have significant current investment plans outside the U.S., it is our intent to indefinitely reinvest the majority of our foreign cash and cash items that would be subject to additional taxes outside the U.S.\nCash Flows From Operations\nNine Months Ended\n30 June\n2025\n2024\nNet income (loss) from continuing operations attributable to Air Products\n(391.4)\n1,878.3 \nAdjustments to reconcile income to cash provided by operating activities:\nDepreciation and amortization\n1,151.4 \n1,070.3 \nDeferred income taxes\n(497.2)\n(74.3)\nTax reform repatriation\n(34.9)\n— \nGain on sale of business\n(67.3)\n— \nBusiness and asset actions\n2,952.0 \n57.0 \nUndistributed earnings of equity method investments\n(137.8)\n(124.1)\nGain on sale of assets and investments\n(46.9)\n(23.3)\nShare-based compensation\n65.7 \n46.2 \nNoncurrent lease receivables\n40.1 \n59.2 \nOther adjustments\n31.4 \n36.4 \nChanges in working capital accounts\n(1,069.5)\n(236.0)\nCash Provided by Operating Activities\n$1,995.6 \n$2,689.7 \nFor the first nine months of fiscal year 2025, cash provided by operating activities was $2.0 billion. The adjustment for deferred income taxes of $497.2 was driven by the tax impacts of project exit costs as described in Note 4, \nBusiness and Asset Actions\n, to the consolidated financial statements. The working capital accounts were a use of cash of $1.1 billion. The use of cash of $624.6 in other working capital was driven by payments for income taxes that exceeded income tax expense by $538.6, including tax impacts of the project exit costs described in Note 4, \nBusiness and Asset Actions\n, to the consolidated financial statements. We made approximately $395 of tax payments related to the gain on the September 2024 sale of the LNG business in fiscal year 2025. Payables and accrued liabilities were a use of cash of $215.1 primarily due to payments for contract terminations and severance related to our business and asset actions. A use of cash of $102.8 for other receivables was primarily due to the timing of value added tax payments during the construction of the NEOM Green Hydrogen Project. Trade receivables resulted in a use of cash of $91.4, driven by the timing of cash collections. \n74\nTable of Contents\nFor the first nine months of fiscal year 2024, cash provided by operating activities was $2.7 billion. We recorded a charge of $57.0 for the accrual of severance and other postemployment benefits under our global cost reduction plan. Refer to Note 4, \nBusiness and Asset Actions\n, to the consolidated financial statements for additional information. The working capital accounts were a use of cash of $236.0. A use of cash of $175.1 within \"Payables and accrued liabilities\" primarily resulted from payments for incentive compensation under the fiscal year 2023 plan, a reduction of customer advances for sale of equipment projects as we recognized revenue, and a reduction of liabilities associated with accrued utilities. The use of cash of $111.0 within \"Inventories\" primarily related to purchases of helium. The use of cash of $21.9 within \"Other working capital\" primarily related to the timing of tax payments. The source of cash of $82.4 within \"Other receivables\" primarily related to the refunds of value added taxes paid during the construction of the NEOM Green Hydrogen Project.\nCash Flows From Investing Activities\nNine Months Ended\n30 June\n2025\n2024\nAdditions to plant and equipment, including long-term deposits\n($5,504.9)\n($4,721.5)\nAcquisitions, less cash acquired\n(59.9)\n— \nInvestment in and advances to unconsolidated affiliates\n(365.4)\n— \nInvestment in financing receivables\n(53.8)\n(396.2)\nProceeds from sale of assets and investments\n185.4 \n26.3 \nPurchases of short-term investments\n(117.6)\n(141.4)\nProceeds from short-term investments\n122.5 \n413.1 \nOther investing activities\n112.7 \n45.9 \nCash Used for Investing Activities\n($5,681.0)\n($4,773.8)\nFor the first nine months of fiscal year 2025, cash used for investing activities was $5.7 billion. The use of cash primarily resulted from additions to plant and equipment, including long-term deposits, of $5.5 billion, as well as a use of cash of $365.4 for investments in and advances to unconsolidated affiliates. Refer to the \"Capital Expenditures\" section below for further detail. Cash paid for acquisitions, net of cash acquired, totaled $59.9 and was paid at the closing of the acquisition of an independent industrial gases company in Belgium. Refer to Note 5, \nAcquisitions and Divestitures\n, to the consolidated financial statements for additional information. These uses of cash were partially offset by proceeds of $185.4 from asset and investment sales, including $104.3 from the sale of a subsidiary in Singapore and $37.7 for the sale of a regional office in Hersham, England. Refer to Note 5, \nAcquisitions and Divestitures\n, to the consolidated financial statements for additional information.\nFor the first nine months of fiscal year 2024, cash used for investing activities was $4.8 billion. The use of cash primarily resulted from additions to plant and equipment, including long-term deposits, of $4.7 billion and an investment in financing receivables of $396.2. Refer to the \"Capital Expenditures\" section below for further detail. Proceeds from investments of $413.1 resulted from maturities of time deposits with terms greater than three months but less than one year and exceeded purchases of investments of $141.4.\n75\nTable of Contents\nCapital Expenditures\n \n(Non-GAAP Financial Measure)\nThe components of our capital expenditures are detailed in the table below. Refer to page \n72\n for a definition of this non-GAAP financial measure as well as a reconciliation to cash used for investing activities.\nNine Months Ended\n30 June\n2025\n2024\nAdditions to plant and equipment, including long-term deposits\n$5,504.9 \n$4,721.5 \nAcquisitions, less cash acquired\n59.9 \n— \nInvestment in and advances to unconsolidated affiliates\n365.4 \n— \nInvestment in financing receivables\n53.8 \n396.2 \nNGHC expenditures not funded by Air Products' equity\n(A)\n(1,981.2)\n(1,242.0)\nCapital Expenditures\n$4,002.8 \n$3,875.7 \n(A)\nReflects the portion of \"Additions to plant and equipment, including long-term deposits\" that is associated with NGHC, less our approximate cash investment in the joint venture.\nCapital expenditures for the first nine months of fiscal year 2025 totaled $4.0 billion compared to $3.9 billion for the first nine months of fiscal year 2024. Spending for plant and equipment primarily included project spending for our clean energy projects such as the NEOM Green Hydrogen Project in NEOM City, Saudi Arabia, as well as our clean energy complexes in Louisiana, United States, and Alberta, Canada. Additionally, we continue to invest capital in our core industrial gas business for new industrial gas plants as well as maintaining and replacing existing facilities. The investment in and advances to unconsolidated affiliates of $365.4 includes approximately $213 associated with Blue Hydrogen Industrial Gases (\"BHIG\"), and approximately $115 associated with our final investment in the JIGPC joint venture. Cash paid for acquisitions, net of cash acquired, totaled $59.9 and was paid at the closing of the acquisition of an independent industrial gases company in Belgium. The investment in financing receivables of $53.8 relates to payments made in connection with the financing arrangement for the natural gas-to-syngas processing facility in Uzbekistan. The prior year investment in financing receivables of $396.2 primarily reflects payments associated with the purchase of renewable fuel assets from World Energy as well as the purchase of a natural gas-to-syngas processing facility in Uzbekistan. Refer to Note 3, \nVariable Interest Entities,\n and Note 19, \nSupplemental Information, \nto the consolidated financial statements for additional information.\nOutlook for Investing Activities\nIt is not possible, without unreasonable efforts, to reconcile our forecasted capital expenditures to future cash used for investing activities because we are unable to identify the timing or occurrence of our future investment activity, which is driven by our assessment of competing opportunities at the time we enter into transactions. These decisions, either individually or in the aggregate, could have a significant effect on our cash used for investing activities.\nWe expect capital expenditures for fiscal year 2025 to be approximately $5 billion. We anticipate capital expenditures to be funded with our current cash balance and cash generated from continuing operations. We also have access to other sources of funding as discussed below.\n76\nTable of Contents\nCash Flows From Financing Activities\nNine Months Ended\n30 June\n2025\n2024\nLong-term debt proceeds\n$3,978.2 \n$4,119.9 \nPayments on long-term debt\n(380.1)\n(76.7)\nNet increase (decrease) in commercial paper and short-term borrowings\n214.7 \n(183.3)\nDividends paid to shareholders\n(1,185.7)\n(1,171.4)\nProceeds from stock option exercises \n1.1 \n6.2 \nInvestments by noncontrolling interests\n485.9 \n278.7 \nOther financing activities\n(79.8)\n(125.7)\nCash Provided by Financing Activities\n$3,034.3 \n$2,847.7 \nFor the first nine months of fiscal year 2025, cash provided by financing activities was $3.0 billion. The source of cash was driven by long-term debt proceeds of $4.0 billion, including $2.7 billion from Euro- and U.S. Dollar-denominated senior fixed-rate notes in February and June 2025. We used the net proceeds from the February 2025 Offering to repay commercial paper obligations, including those incurred prior to the closing of the February 2025 Offering that were used to repay €300 million aggregate principal amount outstanding of our 1.000% Euro-denominated senior fixed-rate notes at maturity, plus accrued interest. We intend to use the net proceeds from the June 2025 Offerings to repay commercial paper obligations and for general corporate purposes. The remaining $1.3 billion was provided from project financing available to the NGHC joint venture as further discussed below. Additionally, we received $485.9 from noncontrolling interests in NGHC and BHIG and proceeds, net of repayments, of $214.7 from commercial paper and short-term instruments. These sources of cash were partially offset by dividend payments to shareholders of $1.2 billion.\nFor the first nine months of fiscal year 2024, cash provided by financing activities was $2.8 billion. The source of cash was primarily driven by long-term debt proceeds of $4.1 billion, which was largely attributable to U.S. Dollar-denominated green bonds totaling $2.5 billion that were issued during the second quarter of fiscal year 2024 under our Green Finance Framework as well as borrowings from project financing associated with the NGHC joint venture, partially offset by dividend payments to shareholders of $1.2 billion.\nFinancing and Capital Structure\nDebt\nTotal debt increased to $17.7 billion as of 30 June 2025 from $14.2 billion as of 30 September 2024. We issued Euro- and U.S. Dollar-denominated senior fixed-rate notes in February and June 2025, which together had a combined carrying value of $2.9 billion as of 30 June 2025. Total debt also increased due to incremental borrowings under a project financing arrangement related to the NEOM Green Hydrogen Project as further discussed below as well as commercial paper issuances. Total debt included related party debt of $298.2 and $304.4 as of 30 June 2025 and 30 September 2024, respectively.\nSome of our debt agreements contain financial covenants and other restrictions, including limitations on creating property liens and entering into certain sale and leaseback transactions. As of 30 June 2025, we were in compliance with all financial and non-financial covenants under these agreements.\n77\nTable of Contents\nCommitted Credit Facilities\nDuring the second quarter of fiscal year 2025, we refinanced our existing 364-day $500 revolving credit agreement to extend its maturity date from 27 March 2025 to 26 March 2026. All other terms remain consistent with the original agreement, including our ability to convert the facility into a term loan maturing 26 March 2027. Fees incurred in connection with the refinancing were not material. \nWe also maintain a five-year $3.0 billion revolving credit agreement that matures on 31 March 2029. Both the 364-day agreement and the five-year agreement are syndicated committed facilities that provide a source of liquidity and support our commercial paper program through the availability of senior unsecured debt to us and certain of our subsidiaries. No borrowings were outstanding under either of the agreements as of 30 June 2025 or 30 September 2024.\nSeparately, certain of our foreign subsidiaries maintain access to committed credit facilities with a combined maximum borrowing capacity of $420.8, all of which was borrowed and outstanding as of 30 June 2025. The amount borrowed from available facilities as of 30 September 2024 was $1.1 billion, which included long-term borrowings of approximately $675 that were derecognized upon deconsolidation of BHIG during the second quarter of fiscal year 2025. Refer to Note 19, \nSupplemental Information\n, to the consolidated financial statements for additional information.\nNEOM Green Hydrogen Project Financing\nNGHC has access to project financing of approximately $6.1 billion, which is expected to fund approximately 73% of the NEOM Green Hydrogen Project and is being drawn over the construction period, as well as additional credit facilities totaling approximately $500 primarily for NGHC's working capital needs. Creditors of NGHC do not have recourse to the general credit of Air Products. As of 30 June 2025, the joint venture had borrowed short- and long-term principal amounts totaling $4.6 billion compared to $3.3 billion as of 30 September 2024. Refer to Note 3, \nVariable Interest Entities\n, to the consolidated financial statements for additional information.\nDividends\nThe Board of Directors determines whether to declare cash dividends on our common stock and the timing and amount based on financial condition and other factors it deems relevant. We believe providing a consistent dividend plays a critical part in the creation of shareholder value and expect to return approximately $1.6 billion to shareholders in 2025.\nDividends are paid quarterly, usually during the sixth week after the close of the fiscal quarter. In fiscal year 2025, the Board of Directors approved a $0.02 per share increase to our quarterly dividend, marking the 43\nrd\n consecutive year of dividend increases. We expect to continue our history of increasing our quarterly dividend.\nOn 22 May 2025, the Board of Directors declared a quarterly dividend of $1.79 per share that is payable on 11 August 2025 to shareholders of record at the close of business on 1 July 2025. On 18 July 2025, the Board of Directors declared another quarterly dividend of $1.79 per share that is payable on 10 November 2025 to shareholders of record at the close of business on 1 October 2025.\n78\nTable of Contents\nPENSION BENEFITS\nWe and certain of our subsidiaries sponsor defined benefit pension plans and defined contribution plans that cover a substantial portion of our worldwide employees. The principal defined benefit pension plans are the U.S. salaried pension plan and the U.K. pension plan. These plans were closed to new participants in 2005, after which defined contribution plans were offered to new employees. The shift to defined contribution plans is expected to continue to reduce volatility of both plan expense and contributions. For additional information, refer to Note 13, \nRetirement Benefits\n, to the consolidated financial statements.\nNet Periodic Cost\nThe table below summarizes the components of net periodic cost for our U.S. and international defined benefit pension plans:\nThree Months Ended\nNine Months Ended\n30 June\n30 June\n2025\n2024\n2025\n2024\nService cost\n$5.3 \n$5.2 \n$15.5 \n$15.6 \nNon-service cost\n10.9 \n25.3 \n32.1 \n75.3 \nOther\n0.1 \n0.6 \n0.2 \n0.8 \nNet Periodic Cost\n$16.3 \n$31.1 \n$47.8 \n$91.7 \nNet periodic cost was $16.3 and $47.8 for the three and nine months ended 30 June 2025, respectively.  Net periodic cost was $31.1 and $91.7 for the three and nine months ended 30 June 2024, respectively. The decrease in costs versus the prior year were primarily attributable to non-service costs, which were driven by a higher expected return on plan assets due to a higher beginning balance of plan assets, lower interest cost, and a decrease in actuarial loss amortization. Non-service related components of net periodic cost are reflected within \"Other non-operating income (expense), net\" on our consolidated income statements.\nService costs result from benefits earned by active employees and are reflected as operating expenses primarily within \"Cost of sales\" and \"Selling and administrative expense\" on our consolidated income statements. The amount of service costs capitalized in the first nine months of fiscal years 2025 and 2024 was not material.\nCompany Contributions\nManagement considers various factors when making pension funding decisions, including tax, cash flow, and regulatory implications. For the nine months ended 30 June 2025 and 2024, our cash contributions to funded pension plans and benefit payments for unfunded pension plans were $20.8 and $25.6, respectively.\nTotal contributions for fiscal year 2025 are expected to be approximately $30 to $40. During fiscal year 2024, total contributions were $34.7.\n79\nTable of Contents\nCRITICAL ACCOUNTING POLICIES AND ESTIMATES\nA description of our major accounting policies, including those that we consider to be the most critical to understanding our financial statements, is included in our 2024 Form 10-K. There were no significant changes to our accounting policies during the first nine months of fiscal year 2025.\nManagement’s Discussion and Analysis of our financial condition and results of operations is based on the consolidated financial statements and accompanying notes that have been prepared in accordance with GAAP. The preparation of these financial statements requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities as of the date of the financial statements and the reported amounts of revenues and expenses during the reporting period. These estimates reflect our best judgment about current and/or future economic and market conditions and their effect based on information available as of the date of our consolidated financial statements. If conditions change, actual results may differ materially from these estimates.\nJudgments and estimates of uncertainties are required to apply our accounting policies in many areas. However, application of policies that management has identified as critical places significant importance on management’s judgment, often as the result of the need to make estimates about the effects of matters that are inherently uncertain. \nDuring the first nine months of fiscal year 2025, we recorded charges totaling approximately $3.0 billion ($2.3 billion attributable to Air Products after tax, or $10.35 per share) for the actions described in Note 4, \nBusiness and Asset Actions\n, to the consolidated financial statements. This charge included approximately $1.8 billion to reduce the carrying value of assets associated with project exits to their estimated net realizable value of $22.5. We estimated the net realizable value of the assets as of 31 March 2025 assuming an orderly liquidation through a secondary equipment market based on our experience with selling similar equipment. An asset’s orderly liquidation value is the amount that could be realized from a liquidation sale, given a reasonable period of time to find a buyer, selling the asset in the existing condition where it is located, and assuming the highest and best use of the asset by market participants. The inputs used for the valuation include significant unobservable inputs, or \"Level 3\" inputs, based on our best judgment regarding assumptions we expect market participants would use. The loss was measured as the difference between the orderly liquidation value of the assets and the net book value of the assets as of 31 March 2025. There have been no significant changes in the estimated net realizable value as of 30 June 2025.\nAdditionally, during the first nine months of fiscal year 2025, we recorded changes to project revenue and cost estimates on certain sale of equipment projects that are accounted for under the cost incurred input method. Accordingly, we recorded cumulative effect adjustments that unfavorably impacted operating income (loss) by approximately $20 and $63 for the three and nine months ended 30 June 2025, respectively. \nThere were no other changes to our estimates during the first nine months of fiscal year 2025 that had a significant impact on our financial condition, change in financial condition, liquidity, or results of operations.\n80\nTable of Contents"
}