{
  "item1": "Company sells its products through its own global sales force, independent representatives global network electronics distributors. Company’s sales distributors represented approximately 18% 17% Company’s net sales 2024 2023, respectively. addition product design teams collaborative initiatives customers, Company uses key account managers manage certain customer relationships global basis so can bring bear its total resources meet worldwide needs its multinational customers. Company global manufacturer employing advanced manufacturing processes including molding, stamping, plating, turning, computer numerical control (CNC) machining, 3D printing, extruding, die casting, certain other manufacturing, automation assembly operations proprietary process technology connectors, specialty coaxial cable production, antenna sensor fabrication.",
  "item7": "Item 7. Management’s Discussion Analysis Financial Condition Results Operations (amounts millions, except share per share data, unless otherwise noted) following discussion analysis financial condition results operations years ended December 31, 2024, 2023 2022 been derived should read conjunction Consolidated Financial Statements accompanying Notes Consolidated Financial Statements included Part II,",
  "item2": "Forward-looking statements nature address matters are, different degrees, uncertain, such statements about expected earnings, revenues, growth, liquidity, effective tax rate, interest rates, anticipated benefits certain acquisitions, financing sources, expected timing closing certain acquisitions other matters. Although Company believes expectations reflected all forward-looking statements based upon reasonable assumptions, expectations may not attained there may material deviation. Readers investors cautioned not place undue reliance these forward-looking statements, which speak only date which they made. There risks uncertainties could cause actual results differ materially these forward-looking statements, which include, but not limited to, following: risks associated proposed acquisitions CCS Business Trexon, including (i) risk proposed acquisitions may not completed timely manner all, if they completed, expected benefits proposed acquisitions may not realized, (ii) failure satisfy conditions consummation proposed acquisitions, including receipt certain regulatory other approvals, (iii) occurrence any event, change other circumstance could give rise termination purchase agreements between parties (iv) unanticipated difficulties expenditures relating acquisitions, response business partners competitors announcement proposed acquisitions, potential disruptions current plans operations and/or potential difficulties employee retention result announcement pendency acquisitions; political, economic, military other risks related operating countries outside United States, well changes general economic conditions, geopolitical conditions, U.S."
}