{
  "source_file": "aph-20250930x10q.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2.\nMANAGEMENT’S DISCUSSION AND ANALYSIS\n​\n​\nOF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\n​\n​\n​\n​\n​\n(amounts in millions, except share and per share data, unless otherwise noted)\n​\n​\nThe following discussion and analysis of the financial condition and results of operations for the three and nine months ended September 30, 2025 and 2024 has been derived from and should be read in conjunction with our unaudited Condensed Consolidated Financial Statements and the accompanying notes thereto included in Part I, Item 1 herein for Amphenol Corporation (together with its subsidiaries, “Amphenol,” the “Company,” “we,” “our” or “us”).  The following discussion and analysis should also be read in conjunction with the consolidated financial statements and notes included in the Company’s Annual Report on Form 10-K for the fiscal year ended December 31, 2024 (the “2024 Annual Report”).  The Condensed Consolidated Financial Statements have been prepared in U.S. dollars, in accordance with accounting principles generally accepted in the United States of America (“U.S. GAAP” or “GAAP”).  The following discussion and analysis also includes references to certain non-GAAP financial measures, which are defined in the “Non-GAAP Financial Measures” section below, including “Constant Currency Net Sales Growth” and “Organic Net Sales Growth.”  For purposes of the following discussion, the terms “constant currencies” and “organically” have the same meaning, respectively, as these aforementioned non-GAAP financial measures.  Refer to “Non-GAAP Financial Measures” within this Item 2 for more information, including our reasons for including non-GAAP financial measures and material limitations with respect to the usefulness of the measures.\n​\nCautionary Note Regarding Forward-Looking Statements\n​\nThis Quarterly Report on Form 10-Q includes forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995, which relate to future events and are subject to risks and uncertainties, including but not limited to, the risk factors described in Part I, Item 1A. of the 2024 Annual Report.  All statements that address events or developments that we expect or believe may or will occur in the future are forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended (the “Exchange Act”).  Such forward-looking statements are based on our management’s assumptions and beliefs about future events or circumstances using information currently available, and as a result, they are subject to risks and uncertainties.  The forward-looking statements, which address the Company’s expected business and financial performance and financial condition, among other matters, may contain words and terms such as: “anticipate,” “believe,” “continue,” “could,” “estimate,” “expect,” “forecast,” “guidance,” “intend,” “look ahead,” “may,” “ongoing,” “optimistic,” “plan,” “potential,” “predict,” “project,” “seek,” \n“should,” “target,” “will” or “would” and other words and terms of similar meaning.\n​\n31\n\n\nTable of Contents\nForward-looking statements by their nature address matters that are, to different degrees, uncertain, such as statements about expected earnings, revenues, growth, liquidity, effective tax rate, interest rates, anticipated benefits of certain acquisitions, financing sources, the expected timing for the closing of certain acquisitions or other matters. \n Although the Company believes the expectations reflected in all forward-looking statements are based upon reasonable assumptions, the expectations may not be attained or there may be material deviation.  \nReaders and investors are cautioned not to place undue reliance on these forward-looking statements, which speak only as of the date on which they are made.  There are risks and uncertainties that could cause actual results to differ materially from these forward-looking statements, which include, but are not limited to, the following: risks associated with our proposed acquisitions of the CCS Business and Trexon, including (i) the risk that the proposed acquisitions may not be completed in a timely manner or at all, or if they are completed, that the expected benefits of the proposed acquisitions may not be realized, (ii) the failure to satisfy the conditions to the consummation of the proposed acquisitions, including the receipt of certain regulatory and other approvals, (iii) the occurrence of any event, change or other circumstance that could give rise to the termination of the purchase agreements between the parties and (iv) unanticipated difficulties or expenditures relating to the acquisitions, the response of business partners and competitors to the announcement of the proposed acquisitions, potential disruptions to current plans and operations and/or potential difficulties in employee retention as a result of the announcement and pendency of the acquisitions; political, economic, military and other risks related to operating in countries outside the United States, as well as changes in general economic conditions, geopolitical conditions, U.S. and other countries’ trade policies, export control laws, sanctions, legislation, treaties and tariffs and other factors beyond the Company’s control; uncertainties associated with an economic slowdown or recession in any of the Company’s end markets that could negatively affect the financial condition of our customers and could result in reduced demand; risks and impacts associated with adverse public health developments, including epidemics and pandemics; risks associated with our inability to obtain certain raw materials and components, as well as the increasing cost of certain of the Company’s raw materials and components; cybersecurity threats and techniques used to disrupt operations and gain unauthorized access to our information technology systems, including, but not limited to, malware, social engineering/phishing, credential harvesting, ransomware, malfeasance by insiders, human or technological error and other increasingly sophisticated attacks, that continue to expand and evolve, including through the use of artificial intelligence and machine learning, which could, among other things, impair our information technology systems and disrupt business operations, result in reputational damage that may cause the loss of existing or future customers, loss of our intellectual property, the loss of or inability to access confidential information and critical business, financial or other data, and/or cause the release of highly sensitive confidential or personal information, and potentially lead to litigation and/or governmental investigations, fines and other penalties, among other risks, and risks and impacts associated with an increasingly demanding regulatory environment surrounding information security and privacy, including additional fines, penalties and other related costs; negative impacts caused by extreme weather conditions and natural catastrophic events, including those caused or intensified by climate change and global warming; risks associated with the improper conduct by any of our employees, customers, suppliers, distributors or any other business partners which could impair our business reputation and financial results and could result in our non-compliance with anti-corruption laws and regulations of the U.S. government and various foreign jurisdictions; changes in exchange rates of the various currencies in which the Company conducts business; the risks associated with the Company’s dependence on attracting, recruiting, hiring and retaining skilled employees, including as part of our various management teams; risks and difficulties in trying to compete successfully on the basis of technology innovation, product quality and performance, price, customer service and delivery time; the Company’s dependence on end market dynamics to sell its products, particularly certain end markets that are subject to cyclical and at times rapid periods of reduced demand; difficulties and unanticipated expenses in connection with purchasing and integrating newly acquired businesses, including the potential for the impairment of goodwill and other intangible assets; events beyond the Company’s control that could lead to an inability to meet its financial and other covenants and requirements, which could result in a default under the Company’s revolving credit facility or any of our various senior notes; risks associated with the Company’s inability to access the global capital markets on favorable terms, including as a result of significant deterioration of general economic or capital market conditions, or as a result of a downgrade in the Company’s credit rating; changes in interest rates; government contracting risks that the Company may be subject to, including laws and regulations governing reporting obligations, performance of government contracts and related risks associated with conducting business with the U.S. and other foreign governments or their suppliers (both directly and indirectly); governmental export and import controls as well as sanctions and trade embargoes that certain of our products may be subject to, including export licensing, customs regulations, economic sanctions and other laws; changes in fiscal and tax policies, audits and examinations by taxing authorities, laws, regulations and guidance in the United States and foreign jurisdictions; any difficulties in enforcing \n32\n\n\nTable of Contents\nand protecting the Company’s intellectual property rights; litigation, customer claims, voluntary or forced product recalls, governmental investigations, criminal liability or environmental matters including changes to laws and regulations to which the Company may be subject; incremental costs, risks and regulations associated with efforts to combat the negative effects of climate change; and risks associated with the increasing scrutiny and expectations regarding environmental, social and corporate governance matters that could result in additional costs or risks or otherwise adversely impact our business.\n​\nA further description of these uncertainties and other risks can be found in the 2024 Annual Report, Quarterly Reports on Form 10-Q and the Company’s other reports filed with the Securities and Exchange Commission.  These or other uncertainties not identified in these documents (that we either currently do not expect to have an adverse effect on our business or that we are unable to predict or identify at this time) may cause the Company’s actual future results to be materially different from those expressed in any forward-looking statements.  Our forward-looking statements may also be impacted by, among other things, future tax, regulatory and other legal changes that may arise in any of the jurisdictions in which we operate.  The Company undertakes no obligation to update or revise any forward-looking statements except as required by law.\n​\nReportable Business Segments\n​\nThe Company aligns its businesses into the following three reportable business segments\n:\n​\n●\nHarsh Environment Solutions\n – the Harsh Environment Solutions segment designs, manufactures and markets a broad range of ruggedized interconnect products, including connectors and interconnect systems, specialty cable, printed circuits and printed circuit assemblies and other products for use in the industrial, defense, commercial aerospace, automotive, communications networks and information technology and data communications end markets.\n​\n●\nCommunications Solutions\n – the Communications Solutions segment designs, manufactures and markets a broad range of connector and interconnect systems, including high speed, radio frequency, power, fiber optic and other products, coaxial and high-speed cable, as well as antennas, for use in the information technology and data communications, mobile devices, industrial, communications networks, automotive, commercial aerospace and defense end markets.\n​\n●\nInterconnect and Sensor Systems\n – the Interconnect and Sensor Systems segment designs, manufactures and markets a broad range of sensors, sensor-based systems, connectors and value-add interconnect systems used in the automotive, industrial, information technology and data communications, communications networks, defense and commercial aerospace end markets.\n​\nRefer to Note 13 o\nf the Notes to Condensed Consolidated Financial Statements, as well as the 2024 Annual Report, \nfor further details related to the Company’s reportable business segments.\n​\nPillar Two Framework\n​\nThe Organization for Economic Co-operation and Development (OECD)/G20 Inclusive Framework, known as Pillar Two, provides guidance for a global minimum tax.  This guidance lays out a common approach for adopting the global minimum tax and enacting local legislation codifying the provisions that all 142 countries in the Inclusive Framework agreed to by consensus.  The European Union (“EU”) member states have agreed to adopt these rules in two stages.  The first component became effective on January 1, 2024, and the second component became effective January 1, 2025.  Non-EU countries have enacted or are expected to enact legislation on a similar timeline.  Certain countries in which we operate have already enacted legislation to adopt the Pillar Two framework, while several other countries are expected to also implement similar legislation with varying effective dates in the future. When and how this framework is adopted or enacted by the various countries in which we do business will increase tax complexity and may increase uncertainty and adversely affect our provision for income taxes in the U.S. and non-U.S. jurisdictions. The Company has done a preliminary review of currently enacted legislation. The implementation did not have a material impact on the \n33\n\n\nTable of Contents\nCompany’s condensed consolidated financial statements during the three and nine months ended September 30, 2025, and it is not currently expected to have a material impact on the Company’s operations, financial condition or cash flows in the future.  However, the Company will continue to evaluate the potential impact of Pillar Two on the Company and its results as additional countries adopt legislation and issue individual guidance on their enacted legislation.\n​\nResults of Operations\n​\nThree and nine months ended September 30, 2025 compared to the three and nine months ended September 30, 2024\n​\nNet sales were $6,194.4 in the third quarter of 2025 compared to $4,038.8 in the third quarter of 2024, representing an increase of 53% in U.S. dollars, 53% in constant currencies and 41% organically (excluding both currency and acquisition impacts; unless otherwise indicated, organic net sales growth is primarily driven by higher sales volumes), compared to the prior year period.  \nThe increase in net sales in the third quarter of 2025 was driven by robust organic growth in the Communications Solutions segment and strong organic growth in the Harsh Environment Solutions and Interconnect and Sensor Systems segments, along with contributions from the Company’s acquisition program, as described below.  From an end market standpoint, the increase in net sales in the third quarter of 2025 relative to the prior year period was driven by robust organic growth in the information technology and data communications (“IT datacom”) market, and strong organic growth in nearly all other markets, along with contributions from the Company’s acquisition program.\n​\nNet sales were $16,655.7 in the first nine months of 2025 compared to $10,904.9 in the first nine months of 2024, which represented an increase of 53% in U.S. dollars, 52% in constant currencies and 39% organically (excluding both currency and acquisition impacts), compared to the prior year period.  The increase in net sales in the first nine months of 2025 was driven by robust organic growth in the Communications Solutions segment and strong organic growth in the Harsh Environment Solutions and Interconnect and Sensor Systems segments, along with contributions from the Company’s acquisition program, as described below.  From an end market standpoint, the increase in net sales in the first nine months of 2025 relative to the prior year period was driven by robust organic growth in the IT datacom market, and strong organic growth in nearly all other markets, along with contributions from the Company’s acquisition program. \n​\nNet sales in the Harsh Environment Solutions segment (approximately 25% of net sales) in the third quarter of 2025 increased 27% in U.S. dollars, 26% in constant currencies and 19% organically, compared to the third quarter of 2024.  \nThe increase in the third quarter of 2025 was driven by strong organic growth in the defense, industrial, commercial aerospace, automotive and IT datacom markets, along with contributions from the Company’s acquisition program.  Net sales in the Harsh Environment Solutions segment (approximately 25% of net sales) in the first nine months of 2025 increased 34% in U.S. dollars, 34% in constant currencies and 15% organically, compared to the prior year period.  The increase in the first nine months of 2025 was driven by strong organic growth in the industrial, defense, IT datacom and communications networks markets, and moderate organic growth in the commercial aerospace market, along with contributions from the Company’s acquisition program.\n​\nNet sales in the Communications Solutions segment (approximately 53% of net sales) in the third quarter of 2025 increased 96% in U.S. dollars, 96% in constant currencies and 75% organically, compared to the third quarter of 2024.  \nThe increase in the third quarter of 2025 was driven by robust organic growth in the IT datacom market, with particular strength in artificial intelligence (“AI”)-related applications, as well as strong organic growth in the communications networks, automotive and industrial markets, along with contributions from the Company’s acquisition program. Net sales in the Communications Solutions segment (approximately 52% of net sales) in the first nine months of 2025 increased 96% in U.S. dollars, 96% in constant currencies and 75% organically, compared to the first nine months of 2024. The increase in the first nine months of 2025 was driven by robust organic growth in the IT datacom market, with particular strength in AI-related applications, as well as strong organic growth in the communications networks, automotive and industrial markets, and moderate organic growth in the mobile devices market, along with contributions from the Company’s acquisition program.\n​\n34\n\n\nTable of Contents\nNet sales in the Interconnect and Sensor Systems segment (approximately 22% of net sales) in the third quarter of 2025 increased 18% in U.S. dollars, 16% in constant currencies and 15% organically, compared to the third quarter of 2024. T\nhe increase in the third quarter of 2025 was driven by robust organic growth in the IT datacom market, with particular strength in AI-related applications. Net sales in the Interconnect and Sensor Systems segment (approximately 23% of net sales) in the first nine months of 2025 increased 13% in U.S. dollars, 12% in constant currencies and 12% organically, compared to the first nine months of 2024.  The increase in the first nine months of 2025 was driven by robust organic growth in the IT datacom market, with particular strength in AI-related applications.\n​\nThe table below reconciles Constant Currency Net Sales Growth and Organic Net Sales Growth to the most directly comparable U.S. GAAP financial measures, by segment, geography and consolidated, for the three and nine months ended September 30, 2025 compared to the three and nine months ended September 30, 2024:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nPercentage Growth (relative to same prior year period) (1)\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nNet sales\n​\nForeign\n​\nConstant\n​\n​\n​\nOrganic\n​\n​\n​\n​\n​\n​\n​\n​\ngrowth in\n​\ncurrency\n​\nCurrency Net\n​\nAcquisition\n​\nNet Sales\n​\n​\n​\n​\n​\n​\n​\n​\nU.S.\n \nDollars\n \n(2)\n​\nimpact\n \n(3)\n​\n Sales\n \nGrowth\n \n(4)\n​\nimpact\n \n(5)\n​\nGrowth\n \n(4)\nThree Months Ended September 30, \n  \n2025\n   \n2024\n   \n(GAAP)\n​\n(non-GAAP)\n​\n(non-GAAP)\n​\n(non-GAAP)\n​\n(non-GAAP)\nNet sales by:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nSegment\n:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nHarsh Environment Solutions\n​\n$\n 1,515.8\n \n$\n 1,193.5\n​\n 27\n%  \n​\n 1\n%  \n​\n 26\n%  \n​\n 7\n%  \n​\n 19\n%  \nCommunications Solutions\n​\n​\n 3,309.5\n​\n​\n 1,685.5\n​\n 96\n%  \n​\n —\n%  \n​\n 96\n%  \n​\n 21\n%  \n​\n 75\n%  \nInterconnect and Sensor Systems\n​\n \n 1,369.1\n​\n \n 1,159.8\n​\n 18\n%  \n​\n 2\n%  \n​\n 16\n%  \n​\n 2\n%  \n​\n 15\n%  \nConsolidated\n​\n$\n 6,194.4\n​\n$\n 4,038.8\n​\n 53\n%  \n​\n 1\n%  \n​\n 53\n%  \n​\n 11\n%  \n​\n 41\n%  \n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nGeography \n(6)\n:\n \n​\n​\n​\n​\n​\n \n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nUnited States\n​\n$\n 2,206.8\n \n$\n 1,411.7\n​\n 56\n%  \n​\n —\n%  \n​\n 56\n%  \n​\n 21\n%  \n​\n 35\n%  \nForeign\n​\n \n 3,987.6\n​\n \n 2,627.1\n​\n 52\n%  \n​\n 1\n%  \n​\n 51\n%  \n​\n 6\n%  \n​\n 44\n%  \nConsolidated\n​\n$\n 6,194.4\n​\n$\n 4,038.8\n​\n 53\n%  \n​\n 1\n%  \n​\n 53\n%  \n​\n 11\n%  \n​\n 41\n%  \n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nNine Months Ended September 30, \n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nNet sales by:\n \n​\n​\n​\n​\n​\n \n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nSegment\n:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nHarsh Environment Solutions\n​\n$\n 4,229.3\n \n$\n 3,155.5\n​\n 34\n%  \n​\n —\n%  \n​\n 34\n%  \n​\n 18\n%  \n​\n 15\n%  \nCommunications Solutions\n​\n​\n 8,633.0\n​\n​\n 4,395.8\n​\n 96\n%  \n​\n —\n%  \n​\n 96\n%  \n​\n 21\n%  \n​\n 75\n%  \nInterconnect and Sensor Systems\n​\n \n 3,793.4\n​\n \n 3,353.6\n​\n 13\n%  \n​\n 1\n%  \n​\n 12\n%  \n​\n 1\n%  \n​\n 12\n%  \nConsolidated\n​\n$\n 16,655.7\n​\n$\n 10,904.9\n​\n 53\n%  \n​\n —\n%  \n​\n 52\n%  \n​\n 14\n%  \n​\n 39\n%  \n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nGeography \n(6)\n:\n \n​\n​\n​\n​\n​\n \n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nUnited States\n​\n$\n 5,787.6\n \n$\n 3,780.8\n​\n 53\n%  \n​\n —\n%  \n​\n 53\n%  \n​\n 27\n%  \n​\n 26\n%  \nForeign\n​\n \n 10,868.1\n​\n \n 7,124.1\n​\n 53\n%  \n​\n —\n%  \n​\n 52\n%  \n​\n 7\n%  \n​\n 45\n%  \nConsolidated\n​\n$\n 16,655.7\n​\n$\n 10,904.9\n​\n 53\n%  \n​\n —\n%  \n​\n 52\n%  \n​\n 14\n%  \n​\n 39\n%  \n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n(1)\nPercentages in this table were calculated using actual, unrounded results; therefore, the sum of the components may not add due to rounding.\n(2)\nNet sales growth in U.S. dollars is calculated based on Net sales as reported in the Condensed Consolidated Statements of Income and Note 13 of the Notes to Condensed Consolidated Financial Statements.  While the term “net sales growth in U.S. dollars” is not considered a U.S. GAAP financial measure, for purposes of this table, we derive the reported (GAAP) measure based on GAAP results, which serves as the basis for the reconciliation to its comparable non-GAAP financial measures.\n(3)\nForeign currency translation impact, a non-GAAP measure, represents the percentage impact on net sales resulting from foreign currency exchange rate changes in the current reporting period(s) compared to the same respective period(s) in the prior year.  Such amount is calculated by subtracting net sales for the current reporting period(s) translated at average foreign currency exchange rates for the respective prior year period(s) from net sales for the current reporting period(s), taken as a percentage of the respective prior year period(s) net sales.\n(4)\nConstant Currency Net Sales Growth and Organic Net Sales Growth are non-GAAP financial measures as defined in the “Non-GAAP Financial Measures” section of this Item 2.\n(5)\nAcquisition impact, a non-GAAP measure, represents the percentage impact on net sales resulting from acquisitions that have not been included in the Company’s consolidated results for the full current period(s) and/or prior comparable period(s) presented.  Such net sales related to these acquisitions do not reflect the underlying growth of the Company on a comparative basis.  Acquisition impact is calculated as a percentage of the respective prior year period(s) net sales. \n(6)\nNet sales by geographic area are based on the customer location to which the product is shipped.\n​\n35\n\n\nTable of Contents\nThe comparatively weaker U.S. dollar for the third quarter and first nine months of 2025 had the effect of increasing sales by approximately $31.0 and $31.8, respectively, relative to the comparable periods in 2024.\n​\nSelling, general and administrative expenses (“SG&A”) were $657.0, or 10.6% of net sales, and $1,854.7, or 11.1% of net sales, for the third quarter and first nine months of 2025, compared to $492.0, or 12.2% of net sales, and $1,340.4, or 12.3% of net sales, for the third quarter and first nine months of 2024, respectively.  Approximately half of the increase in SG&A expenses when compared to the third quarter and first nine months of 2024 is related to acquisitions closed in the prior 12 months.  Administrative expenses represented approximately 4.4% and 4.6% of net sales for the third quarter and first nine months of 2025, respectively, and represented approximately 5.0% and 4.9% of net sales for the third quarter and first nine months of 2024, respectively.  Research and development expenses represented approximately 2.8% of net sales for both the third quarter and first nine months of 2025, and represented approximately 3.1% and 3.0% of net sales for the third quarter and first nine months of 2024, respectively.  Selling and marketing expenses represented approximately 3.4% and 3.8% of net sales for the third quarter and first nine months of 2025, respectively, and represented approximately 4.1% and 4.3% of net sales for the third quarter and first nine months of 2024, respectively. \n​\nOperating income was $1,702.3, or 27.5% of net sales, and $4,145.9, or 24.9% of net sales, for the third quarter and first nine months of 2025, respectively, compared to $819.5, or 20.3% of net sales, and $2,203.2, or 20.2% of net sales, for the third quarter and first nine months of 2024, respectively.  Operating income for the first nine months of 2025 includes $133.8 of acquisition-related expenses, comprised primarily of (i) the non-cash amortization of the value associated with acquired backlog resulting from the Andrew Business acquisition and external transaction costs related to acquisitions (such acquisition-related expenses aggregating $56.0 are presented separately in the Condensed Consolidated Statements of Income) and (ii) the non-cash amortization of acquisition-related inventory step-up costs of $77.8 associated with the Andrew Business acquisition (such costs are recorded in Cost of sales in the Condensed Consolidated Statements of Income).  Operating income for the third quarter and first nine months of 2024 includes $63.6 and $133.6, respectively, of acquisition-related expenses comprised primarily of (i) the amortization related to the value associated with acquired backlog resulting from the Carlisle Interconnect Technologies (“CIT”) acquisition and external transaction costs associated with acquisitions (such acquisition-related expenses aggregating $45.4 and $115.4, respectively, are presented separately in the Condensed Consolidated Statements of Income) and (ii) the amortization of acquisition-related inventory step-up costs in the third quarter of 2024 of $18.2 associated with the CIT acquisition (such costs are recorded in Cost of sales in the Condensed Consolidated Statements of Income).\n​\nFor the first nine months of 2025, the acquisition-related expenses had the effect of decreasing net income by $106.3, or $0.08 per share, while for the third quarter and first nine months of 2024, the acquisition-related expenses had the effect of decreasing net income by $49.8, or $0.04 per share, and $109.7, or $0.09 per share, respectively, as shown in the tables below.  Excluding the effect of these acquisition-related expenses, Adjusted Operating Income and Adjusted Operating Margin, each as defined in the “Non-GAAP Financial Measures” section below, were $1,702.3, or 27.5% of net sales, and $883.1, or 21.9% of net sales, for the three months ended September 30, 2025 and 2024, respectively.  Excluding the effect of these acquisition-related expenses, Adjusted Operating Income and Adjusted Operating Margin were $4,279.7, or 25.7% of net sales, and $2,336.8, or 21.4% of net sales, for the nine months ended September 30, 2025 and 2024, respectively.  The increases in Adjusted Operating Income and Adjusted Operating Margin for both the third quarter and first nine months of 2025 relative to the comparable periods in 2024 were \nprimarily driven by strong operating performance on the higher sales volumes, slightly offset by the negative impact on operating margin related to acquisitions completed within the prior 12 months that are currently operating below the average operating margin of the Company.\n​\nOperating income for the Harsh Environment Solutions segment for the third quarter and first nine months of 2025 was $410.9, or 27.1% of net sales, and $1,085.8, or 25.7% of net sales, respectively, compared to $283.7, or 23.8% of net sales, and $787.8, or 25.0% of net sales, for the third quarter and first nine months of 2024, respectively.  The increases in operating margin for the Harsh Environment Solutions segment for both the third quarter and first nine months of 2025 relative to the comparable periods in 2024 were primarily driven by strong operating leverage on the higher organic sales volumes, slightly offset by the negative impact on operating margin related to acquisitions completed within the prior 12 months that are currently operating below the average operating margin of the Company.  \n36\n\n\nTable of Contents\n \n​\nOperating income for the Communications Solutions segment for the third quarter and first nine months of 2025 was $1,081.3, or 32.7% of net sales, and $2,632.8, or 30.5% of net sales, respectively, compared to $431.0, or 25.6% of net sales, and $1,067.7, or 24.3% of net sales, for the third quarter and first nine months of 2024, respectively.  The increases in operating margin for the Communications Solutions segment for both the third quarter and first nine months of 2025 relative to the comparable periods in 2024 were primarily driven by strong operating leverage on the significantly higher organic sales volumes, slightly offset by the negative impact on operating margin related to acquisitions completed within the prior 12 months that are currently operating below the average operating margin of the Company.\n​\nOperating income for the Interconnect and Sensor Systems segment for the third quarter and first nine months of 2025 was $274.4, or 20.0% of net sales, and $731.2, or 19.3% of net sales, respectively, compared to $217.6, or 18.8% of net sales, and $616.3, or 18.4% of net sales, for the third quarter and first nine months of 2024, respectively. The increases in operating margin for the Interconnect and Sensor Systems segment for both the third quarter and first nine months of 2025 relative to the comparable periods in 2024 were primarily driven by strong operating leverage on the higher organic sales volumes.\n​\nInterest expense for the third quarter and first nine months of 2025 was $80.7 and $238.1, respectively, compared to $55.7 and $150.1 for the third quarter and first nine months of 2024, respectively.  The increases in interest expense for both the third quarter and first nine months of 2025 were primarily driven by higher average borrowing levels from the issuances of the 2028 Senior Notes, the 2032 Euro Notes, the April Senior Notes and the October Senior Notes, as well as the USCP Notes (all as defined below) issued during the periods, which were primarily intended to fully or partially fund acquisitions, including the acquisition of the Andrew Business, as well as for other general corporate purposes.\n​\nProvision for income taxes for the third quarter and first nine months of 2025 was at an effective tax rate of 23.5% and 21.6%, respectively.  Provision for income taxes for the third quarter and first nine months of 2024 was at an effective tax rate of 21.4% and 19.6%, respectively.  Various items incurred in the third quarter and first nine months of 2025 and 2024 \nimpacted the effective tax rate and earnings per share by the amounts noted in the tables \nbelow.  For the third quarter and first nine months of 2025 and 2024, these items included excess tax benefits resulting from stock option exercise activity.  For the first nine months of 2025 and 2024, the effective tax rate was further impacted by the tax effect of the aforementioned acquisition-related expenses incurred during the period.  For the first nine months of 2024, the effective tax rate was further impacted by a discrete tax benefit related to the settlement of tax audits and associated lapses of statutes of limitation, along with a difference in a non-U.S. tax filing position.  Excluding the effect of these items, the Adjusted Effective Tax Rate, a non-GAAP financial measure as defined in the “Non-GAAP Financial Measures” section below within this Item 2, for the three and nine months ended September 30, 2025 was 27.0% and 25.5%, respectively, and for both the three and nine months ended September 30, 2024 was 24.0%, as reconciled in the tables below to the comparable effective tax rate based on GAAP results.  Refer to Note 6 of the Notes to Condensed Consolidated Financial Statements for further information related to income taxes.\n​\nNet income attributable to Amphenol Corporation and Net income attributable to Amphenol Corporation per common share - Diluted (“Diluted EPS”) were $1,245.7 and $0.97, respectively, for the third quarter of 2025, compared to $604.4 and $0.48, respectively, for the third quarter of 2024.  Excluding the effect of the items listed in the tables below, Adjusted Net Income attributable to Amphenol Corporation and Adjusted Diluted EPS, non-GAAP financial measures as defined in the “Non-GAAP Financial Measures” section below within this Item 2, were $1,188.6 and $0.93, respectively, for the third quarter of 2025, compared to $632.8 and $0.50, respectively, for the third quarter of 2024.  Net income attributable to Amphenol Corporation and Diluted EPS were $3,074.8 and $2.41, respectively, for the first nine months of 2025, compared to $1,677.8 and $1.33, respectively, for the first nine months of 2024.  Excluding the effect of the items listed in the tables below, Adjusted Net Income attributable to Amphenol Corporation and Adjusted Diluted EPS were $3,018.5 and $2.37, respectively, for the first nine months of 2025, compared to $1,686.9 and $1.34, respectively, for the first nine months of 2024.\n​\n37\n\n\nTable of Contents\nThe following tables reconcile Adjusted Operating Income, Adjusted Operating Margin, Adjusted Net Income attributable to Amphenol Corporation, Adjusted Effective Tax Rate and Adjusted Diluted EPS (each as defined in the “Non-GAAP Financial Measures” section below) to the most directly comparable U.S. GAAP financial measures for the three and nine months ended September 30, 2025 and 2024:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nThree Months Ended September 30, \n​\n​\n2025\n​\n2024\n​\n​\n​\n​\n​\n​\n​\nNet Income\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nNet Income\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nattributable\n​\nEffective\n​\n​\n​\n​\n​\n​\n​\n​\nattributable\n​\nEffective\n​\n​\n​\n​\nOperating\n​\nOperating\n​\nto Amphenol\n​\nTax\n \n​\nDiluted\n​\nOperating\n​\nOperating\n​\nto Amphenol\n​\nTax\n \n​\nDiluted\n​\n​\nIncome\n   \nMargin (1)\n    \nCorporation\n   \nRate (1)\n   \nEPS\n   \nIncome\n   \nMargin (1)\n    \nCorporation\n   \nRate (1)\n   \nEPS\nReported (GAAP)\n​\n$\n 1,702.3\n  \n 27.5\n%\n$\n 1,245.7\n  \n 23.5\n%\n$\n 0.97\n​\n$\n 819.5\n  \n 20.3\n%\n$\n 604.4\n  \n 21.4\n%\n$\n 0.48\nAmortization of acquisition-related inventory step-up costs\n​\n​\n —\n​\n —\n​\n​\n —\n​\n —\n​\n​\n —\n​\n​\n 18.2\n​\n 0.5\n​\n​\n 14.0\n​\n —\n​\n​\n 0.01\nAcquisition-related expenses\n​\n​\n —\n​\n —\n​\n​\n —\n​\n —\n​\n​\n —\n​\n​\n 45.4\n​\n 1.1\n​\n​\n 35.8\n​\n (0.2)\n​\n​\n 0.03\nExcess tax benefits related to stock-based compensation\n​\n​\n —\n​\n —\n​\n​\n (57.1)\n​\n 3.5\n​\n​\n (0.04)\n​\n​\n —\n​\n —\n​\n​\n (21.4)\n​\n 2.8\n​\n​\n (0.02)\nAdjusted (non-GAAP) (2)\n​\n$\n 1,702.3\n​\n 27.5\n%\n$\n 1,188.6\n​\n 27.0\n%\n$\n 0.93\n​\n$\n 883.1\n​\n 21.9\n%\n$\n 632.8\n​\n 24.0\n%\n$\n 0.50\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nNine Months Ended September 30, \n​\n​\n2025\n​\n2024\n​\n​\n​\n​\n​\n​\n​\nNet Income\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nNet Income\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nattributable\n​\nEffective\n​\n​\n​\n​\n​\n​\n​\n​\nattributable\n​\nEffective\n​\n​\n​\n​\nOperating\n​\nOperating\n​\nto Amphenol\n​\nTax\n \n​\nDiluted\n​\nOperating\n​\nOperating\n​\nto Amphenol\n​\nTax\n \n​\nDiluted\n​\n​\nIncome\n   \nMargin (1)\n    \nCorporation\n   \nRate (1)\n   \nEPS\n   \nIncome\n   \nMargin (1)\n    \nCorporation\n   \nRate (1)\n   \nEPS\nReported (GAAP)\n​\n$\n 4,145.9\n  \n 24.9\n%\n$\n 3,074.8\n  \n 21.6\n%\n$\n 2.41\n​\n$\n 2,203.2\n  \n 20.2\n%\n$\n 1,677.8\n  \n 19.6\n%\n$\n 1.33\nAmortization of acquisition-related inventory step-up costs\n​\n​\n 77.8\n​\n 0.5\n​\n​\n 59.6\n​\n —\n​\n​\n 0.05\n​\n​\n 18.2\n​\n 0.2\n​\n​\n 14.0\n​\n —\n​\n​\n 0.01\nAcquisition-related expenses\n​\n​\n 56.0\n​\n 0.3\n​\n​\n 46.7\n​\n (0.2)\n​\n​\n 0.03\n​\n​\n 115.4\n​\n 1.1\n​\n​\n 95.7\n​\n (0.4)\n​\n​\n 0.08\nExcess tax benefits related to stock-based compensation\n​\n​\n —\n​\n —\n​\n​\n (162.6)\n​\n 4.1\n​\n​\n (0.13)\n​\n​\n —\n​\n —\n​\n​\n (82.0)\n​\n 3.9\n​\n​\n (0.06)\nDiscrete tax items\n​\n​\n —\n​\n —\n​\n​\n —\n​\n —\n​\n​\n —\n​\n​\n —\n​\n —\n​\n​\n (18.6)\n​\n 0.9\n​\n​\n (0.01)\nAdjusted (non-GAAP) (2)\n​\n$\n 4,279.7\n​\n 25.7\n%\n$\n 3,018.5\n​\n 25.5\n%\n$\n 2.37\n​\n$\n 2,336.8\n​\n 21.4\n%\n$\n 1,686.9\n​\n 24.0\n%\n$\n 1.34\n​\n(1)\nWhile the terms “operating margin” and “effective tax rate” are not considered U.S. GAAP financial measures, for purposes of this table, we derive the reported (GAAP) measures based on GAAP results, which serve as the basis for the reconciliation to their comparable non-GAAP financial measures.\n(2)\nAll percentages and per share amounts in this table were calculated using actual, unrounded results; therefore, the sum of the components may not add due to rounding.\n​\nLiquidity and Capital Resources\n​\nLiquidity and Cash Requirements\n​\nAs of September 30, 2025 and December 31, 2024, the Company had cash, cash equivalents and short-term investments of $3,888.1 and $3,335.4, respectively, with approximately 67% and 50% of the Company’s cash, cash equivalents and short-term investments on hand located outside of the United States as of September 30, 2025 and December 31, 2024, respectively.\n​\nThe Company’s primary sources of liquidity are internally generated cash provided by operating activities, cash, cash equivalents and short-term investments on hand, as well as availability under the U.S. Commercial Paper Program, the Euro Commercial Paper Program, the Revolving Credit Facility and the Delayed Draw Term Loans (all as defined below).  The Company believes that these sources of liquidity, along with access to capital markets (which the Company accessed during the nine months ended September 30, 2025 in connection with the issuance of the 2028 Senior Notes and the 2032 Euro Notes, and in 2024 in connection with the issuances of both the April Senior Notes and October Senior Notes), provide adequate liquidity to meet both its short-term (next 12 months) and reasonably foreseeable long-term requirements and obligations.  The Company’s debt instruments are defined and discussed in more detail below within this Item 2.\n38\n\n\nTable of Contents\n​\nCash Requirements from Known Contractual and Other Obligations\n​\nThe Company’s primary ongoing cash requirements will be for operating and working capital needs, capital expenditures, product development activities, repurchases of our Common Stock, dividends, debt service, taxes due upon the repatriation of foreign earnings (which will be payable upon the repatriation of such earnings), funding of pension obligations, funding of acquisitions, and other contractual obligations and commitments included in Item 7 of the 2024 Annual Report.  The Company may also use cash to fund all or part of the cost of future acquisitions including the acquisitions of the CCS Business and Trexon if, and when, the acquisitions are consummated, which has been the case in recent years with the Company’s various acquisitions, including the acquisition of CommScope’s Andrew Business, which closed on January 31, 2025.  The Company’s debt service requirements primarily consist of principal and interest on the Company’s Senior Notes, and to the extent of any amounts outstanding, the Revolving Credit Facility, Commercial Paper Programs and Delayed Draw Term Loans.  As of September 30, 2025 and December 31, 2024, the Company had no borrowings outstanding under the Revolving Credit Facility, U.S. Commercial Paper Program, Euro Commercial Paper Program and Delayed Draw Term Loans.  However, the Company borrowed under the U.S. Commercial Paper Program during the first nine months of 2025 from time to time, the proceeds of which were used for general corporate purposes, including, but not limited to, partially funding the acquisition of the Andrew Business in January 2025, as discussed later within this Item 2.  Although all such borrowings were repaid before the end of the second quarter of 2025, the Company may make additional borrowings under any of its debt instruments in the future.  To the extent that interest rates change related to floating interest rate debt and the Company borrows under any of our floating interest rate instruments in the future (Commercial Paper Programs, Revolving Credit Facility and the Delayed Draw Term Loans), our interest expense and interest payments will be impacted accordingly.  Although the Company does not expect changes in interest rates to have a material effect on income or cash flows for the remainder of 2025, there can be no assurance that interest rates will not change significantly from current levels.\n​\nRepatriation of Foreign Earnings and Related Income Taxes\n​\nThe Company has previously indicated an intention to repatriate most of its pre-2025 accumulated earnings and has accrued the foreign and U.S. state and local taxes, if applicable, on those earnings, as appropriate.  The associated tax payments are due as the repatriations are made.  The Company intends to indefinitely reinvest the remaining pre-2025 foreign earnings.  As of September 30, 2025, the Company has accrued the foreign and U.S. state and local taxes associated with the foreign earnings that it intends to repatriate.  The Company intends to evaluate future earnings for repatriation, and will accrue for those distributions where appropriate, and to indefinitely reinvest all other foreign earnings.  In addition, the Company paid the balance of the Transition Tax, net of applicable tax credits and deductions, during the second quarter of 2025, as permitted under the Tax Cuts and Jobs Act (the “Tax Act”).\n​\nH.R. 1\n​\nOn July 4, 2025, the United States federal government enacted the tax and spending bill H.R. 1. This legislation contains changes to previously enacted provisions of the Internal Revenue Code and provides for extensions of certain expiring tax provisions included in the Tax Act.  Certain corporate tax provisions in H.R. 1 were enacted with retroactive effect to January 1, 2025.  H.R. 1 did not have a material impact on our effective tax rate for the three months ended September 30, 2025.  The Company continues to evaluate the corporate tax provisions contained within H.R. 1, and the future impact of the bill depends on several factors, including interpretive regulatory guidance, which has not yet been released.\n​\n39\n\n\nTable of Contents\nCash Flow Summary\n​\nThe following table summarizes the Company’s cash flows from operating, investing and financing activities for the nine months ended September 30, 2025 and 2024, as reflected in the Condensed Consolidated Statements of Cash Flow:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nNine Months Ended September 30, \n​\n    \n2025\n    \n2024\nNet cash provided by operating activities\n​\n$\n 3,652.5\n​\n$\n 1,967.6\nNet cash used in investing activities\n​\n \n (3,578.6)\n​\n \n (2,398.2)\nNet cash provided by financing activities\n​\n \n 346.0\n​\n \n 515.8\nEffect of exchange rate changes on cash and cash equivalents\n​\n \n 62.4\n​\n \n 2.8\nNet increase in cash and cash equivalents\n​\n$\n 482.3\n​\n$\n 88.0\n​\nOperating Activities\n​\nThe ability to generate cash from operating activities is one of the Company’s fundamental financial strengths.  Net cash provided by operating activities (“Operating Cash Flow”) was $3,652.5 in the first nine months of 2025 compared to $1,967.6 in the first nine months of 2024.  The increase in Operating Cash Flow for the first nine months of 2025 compared to the first nine months of 2024 is primarily due to the increase in net income, partially offset by a higher usage of cash related to the change in working capital.\n​\nIn the first nine months of 2025, the components of working capital as presented on the accompanying Condensed Consolidated Statements of Cash Flow increased $435.2, excluding the impact of acquisitions and foreign currency translation, primarily due to increases in accounts receivable of $849.3, inventories of $424.3 and prepaid expenses and other current assets of $\n83.8, partially offset by increases in accounts payable of $435.6 and accrued liabilities, including income taxes, of $486.6.  \nIn the first nine months of 2024, the components of working capital as presented on the accompanying Condensed Consolidated Statements of Cash Flow increased $197.6, excluding the impact of acquisitions and foreign currency translation, primarily due to increases in accounts receivable of $358.9, inventories of $186.0 and prepaid expenses and other current assets of $83.2, partially offset by increases in accounts payable of $319.2 and accrued liabilities, including income taxes, of $111.3.\n​\n40\n\n\nTable of Contents\nThe following describes the significant changes in the amounts as presented on the accompanying Condensed Consolidated Balance Sheets at September 30, 2025 as compared to December 31, 2024.  Accounts receivable increased $1,255.9 to $4,543.8, primarily due to the\n \nhigher sales in the third quarter of 2025 relative to the fourth quarter of 2024, along with the \nimpact of the four acquisitions (collectively, the “2025 Acquisitions”) that closed during the first nine months of 2025 and \nthe effect of translation from exchange rate changes (“Translation”) at September 30, 2025 compared to December 31, 2024.  Days sales outstanding at September 30, 2025 and December 31, 2024 were 67 days and 68 days, respectively.  Inventories increased $754.4 to $3,300.1, \nprimarily due to the impact of the 2025 Acquisitions, along with the impact of higher sales in the third quarter of 2025 relative to the fourth quarter of 2024 and Translation\n.  Inventory days at September 30, 2025 and December 31, 2024 were 77 days and 80 days, respectively.  Prepaid expenses and other current assets increased $134.9 to $651.9, primarily due to \nincreases in various prepaid expenses and other current receivables, along with the impact of the 2025 Acquisitions and Translation\n.  Property, plant and equipment, net, increased $429.7 to $2,141.5, primarily due to capital expenditures of $742.9, \nthe impact of the 2025 Acquisitions and Translation, partially offset by \ndepreciation of $454.6.  Goodwill increased $1,632.4 to $9,868.6, primarily \ndriven by \ngoodwill recognized from the 2025 Acquisitions, in particular the acquisition of the Andrew Business\n, and Translation\n.  Other intangible assets, net, increased $757.2 to $1,982.3, primarily due to \nthe recognition of certain intangible assets related to the 2025 Acquisitions, in particular the acquisition of the Andrew Business, and Translation, partially offset by \nthe amortization associated with the Company’s current intangible assets.  Other long-term assets increased $185.6 to $766.7, primarily due to an increase in operating lease right-of-use assets resulting from new and renewed lease agreements entered into during the first nine months of 2025 as well as acquired leases resulting from the 2025 Acquisitions and Translation. Accounts payable increased $643.0 to $2,462.4, primarily due to \nincr\neased purchasing activity related to the higher sales levels in the third quarter of 2025 relative to the fourth quarter of 2024, along with \nthe impact of the 2025 Acquisitions and\n Translation.  Payable days at September 30, 2025 and December 31, 2024 were both 58 days.  Total accrued expenses, including accrued income taxes, increased $721.2 to $2,583.9, primarily as a result of \nincreases in accrued salaries, wages and employee benefits and various other accrued expenses, along with the impact of the 2025 Acquisitions and Translation.  \nOther long-term liabilities, including deferred tax liabilities, increased $386.4 to $1,272.5, primarily as a result of an increase in long-term lease liabilities resulting from new and renewed lease agreements entered into during the first nine months of 2025 as well as acquired leases resulting from the 2025 Acquisitions, and increases in various other long-term liabilities and Translation.\n​\nIn addition to Operating Cash Flow, the Company also considers Free Cash Flow, a non-GAAP financial measure defined in the “Non-GAAP Financial Measures” section below, as a key metric in measuring the Company’s ability to generate cash.  The following table reconciles Free Cash Flow to its most directly comparable U.S. GAAP financial measure for the nine months ended September 30, 2025 and 2024.\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nNine Months Ended September 30, \n​\n    \n2025\n        \n2024\nOperating Cash Flow (GAAP)\n \n$\n 3,652.5\n \n$\n 1,967.6\nCapital expenditures (GAAP)\n​\n​\n (742.9)\n​\n​\n (465.6)\nProceeds from disposals of property, plant and equipment (GAAP)\n​\n \n 7.6\n​\n \n 7.1\nFree Cash Flow (non-GAAP)\n​\n$\n 2,917.2\n​\n$\n 1,509.1\n​\nInvesting Activities\n​\nCash flows from investing activities primarily consist of cash flows associated with capital expenditures, proceeds from disposals of property, plant and equipment, net purchases (sales and maturities) of short- and long-term investments, and acquisitions.\n​\n41\n\n\nTable of Contents\nNet cash used in investing activities was $3,578.6 in the first nine months of 2025, compared to $2,398.2 in the first nine months of 2024.  In the first nine months of 2025, net cash used in investing activities was primarily driven by the \nuse of $2,772.2 to fund acquisitions, \ncapital expenditures (net of disposals) of $735.3 and net purchases of short-term investments of $71.1.  In the first nine months of 2024, net cash used in investing activities was primarily driven by the use of $2,099.8 to fund acquisitions and capital expenditures (net of disposals) of $458.5, partially offset by net sales and maturities of short-term investments of $161.0.  The elevated capital expenditures for the first nine months of 2025 were driven by investments primarily in support of the growth in our IT datacom and defense markets.  We currently expect this elevated level of capital spending to continue for the fourth quarter of 2025 to support the significant growth we are experiencing related to AI applications in our IT datacom market. \n​\nFinancing Activities\n​\nCash flows from financing activities primarily consist of cash flows associated with borrowings and repayments of the Company’s credit facilities and other long-term debt, repurchases of Common Stock, proceeds from stock option exercises, dividend payments, and distributions to and purchases of noncontrolling interests.\n​\nNet cash provided by financing activities was $346.0 in the first nine months of 2025, compared to $515.8 in the first nine months of 2024.  In the first nine months of 2025, net cash provided by financing activities was primarily driven by (i) net cash proceeds from borrowings of $1,430.0, primarily related to the issuance of the 2028 Senior Notes and the 2032 Euro Notes (both as defined below), and (ii) cash proceeds of $445.4 from the exercise of stock options, partially offset by (i) redemption of the 2.050% Senior Notes of $400.0, (ii) dividend payments of $600.3, (iii) repurchases of the Company’s Common Stock of $493.9, (iv) payments of $29.1 related to debt financing costs associated with the Delayed Draw Term Loans, as well as the issuances of the 2028 Senior Notes and the 2032 Euro Notes, and (v) distributions to and purchases of noncontrolling interests of $5.5\n.\n \nIn the first nine months of 2024, net cash provided by financing activities was primarily driven by (i) net cash proceeds from borrowings of $1,500.1, primarily related to the issuance of the April Senior Notes, and (ii) cash proceeds of $320.3 from the exercise of stock options, partially offset by (i) repurchases of the Company’s Common Stock of $520.4, (ii) dividend payments of $396.2, (iii) debt repayments of $353.7, primarily related to the redemption of the 3.20% Senior Notes in the second quarter of 2024, (iv) distributions to and purchases of noncontrolling interests of $20.8, and (v) payments of $14.7 related to debt financing costs associated with the Company’s amended and restated Revolving Credit Facility in March 2024 as well as the issuances of the April Senior Notes.\n​\nThe Company has significant flexibility to meet its financial commitments.  The Company uses debt financing to lower the overall cost of capital and increase return on stockholders’ equity.  The Company’s debt financing includes the use of the Commercial Paper Programs, the Revolving Credit Facility, the Delayed Draw Term Loans and senior notes as part of its overall cash management strategy.\n​\nOn March 21, 2024, the Company entered into a third amended and restated credit agreement, which amended and restated its $2,500.0 unsecured revolving credit facility, increasing the lenders’ aggregate unsecured revolving commitments under the facility by $500.0 to $3,000.0 (the “Revolving Credit Facility”).  The Revolving Credit Facility matures in March 2029 and gives the Company and certain of its subsidiaries the ability to borrow, in various currencies, at a spread that varies, based on the Company’s debt rating, over certain currency-specific benchmark rates, which benchmark rates, in the case of U.S. dollar borrowings, are either the base rate or the adjusted term Secured Overnight Financing Rate (“SOFR”).  The Revolving Credit Facility was undrawn on the date it was amended and restated.  The Company may utilize the Revolving Credit Facility for general corporate purposes.  As of September 30, 2025 and December 31, 2024, there were no outstanding borrowings under the Revolving Credit Facility then in effect.  The Revolving Credit Facility requires payment of certain annual agency and commitment fees and requires that the Company satisfy certain financial covenants.  On September 30, 2025, the Company was in compliance with the financial covenants under the Revolving Credit Facility.\n​\nOn August 22, 2025, the Company entered into (i) a three-year, $2,000.0 unsecured delayed draw term loan credit agreement among the Company, certain subsidiaries of the Company, a syndicate of financial institutions, and JPMorgan Chase Bank, N.A., acting as the administrative agent (the “Three-Year Delayed Draw Term Loan”), which is scheduled \n42\n\n\nTable of Contents\nto mature on the three-year anniversary of the funding date, and (ii) a 364-day, $2,000.0 unsecured delayed draw term loan credit agreement among the Company, certain subsidiaries of the Company, a syndicate of financial institutions and JPMorgan Chase Bank, N.A., acting as the administrative agent (the “364-Day Delayed Draw Term Loan” and, together with the Three-Year Delayed Draw Term Loan, the “Delayed Draw Term Loans”), which is scheduled to mature on the date that is 364 days after the funding date.  The Delayed Draw Term Loans were undrawn at closing and may each only be drawn in a single drawing over the life of the facilities.  The Delayed Draw Term Loans may be repaid at any time without premium or penalty and, once repaid, cannot be reborrowed.  When and if drawn upon, the proceeds from the Delayed Draw Term Loans are expected to be used to finance a portion of the consideration for the Company’s acquisition of CommScope’s Connectivity and Cable Solutions Business (“CCS Business”) and certain related costs, fees and expenses, as discussed further in Note 11 herein.  Interest rates under the Delayed Draw Term Loans are based on a spread over either the base rate or the adjusted term SOFR, which spread varies based on the Company’s debt rating.  As of September 30, 2025, the Company had not yet drawn upon the Delayed Draw Term Loans, and as such, there were no outstanding borrowings under the Delayed Draw Term Loans.  On September 30, 2025, the Company was in compliance with the financial covenants under the Delayed Draw Term Loans.\n​\nThe Company has a commercial paper program (the “U.S. Commercial Paper Program”) pursuant to which the Company may issue short-term unsecured commercial paper notes (the “USCP Notes” or “U.S. Commercial Paper”) in one or more private placements in the United States.  On March 21, 2024, in conjunction with the increase in the capacity of the Revolving Credit Facility, the Company increased the borrowings available under its U.S. Commercial Paper Program by $500.0.  As of September 30, 2025, the maximum aggregate principal amount outstanding of USCP Notes at any time is $3,000.0.  The Company utilizes borrowings under the U.S. Commercial Paper Program for general corporate purposes, which, in recent years, have included fully or partially funding acquisitions, as well as repaying certain outstanding senior notes. The Company borrowed under the U.S. Commercial Paper Program throughout some of the first nine months of 2025, the proceeds of which were used for general corporate purposes, including, but not limited to, partially funding the acquisition of the Andrew Business in January 2025.  Before the end of the second quarter of 2025, the Company repaid all of its USCP Notes outstanding using the proceeds from the 2028 Senior Notes and the 2032 Euro Notes.  As of September 30, 2025 and December 31, 2024, there were no USCP Notes outstanding.\n​\nThe Company and one of its wholly owned European subsidiaries (the “Euro Issuer”) also have a commercial paper program (the “Euro Commercial Paper Program” and, together with the U.S. Commercial Paper Program, the “Commercial Paper Programs”), pursuant to which the Euro Issuer may issue short-term unsecured commercial paper notes (the “ECP Notes” and, together with the USCP Notes, the “Commercial Paper”), which are guaranteed by the Company and are to be issued outside of the United States.  The ECP Notes may be issued in Euros, Sterling, U.S. dollars or other currencies.  The maximum aggregate principal amount outstanding of ECP Notes at any time is $2,000.0.  The Company utilizes borrowings under the Euro Commercial Paper Program for general corporate purposes, which may include, for example, fully or partially funding acquisitions.  The Company did not borrow under the Euro Commercial Paper Program during the first nine months of 2025, and, as of September 30, 2025 and December 31, 2024, there were no ECP Notes outstanding.\n​\nAmounts available under the Commercial Paper Programs may be borrowed, repaid and re-borrowed from time to time.  In conjunction with the Revolving Credit Facility, as of September 30, 2025, the authorization from the Board limits the maximum aggregate principal amount outstanding of USCP Notes, ECP Notes, and any other commercial paper or similar programs, along with outstanding amounts under the Revolving Credit Facility, at any time to $3,000.0 in the aggregate.  The Commercial Paper Programs are rated A-2 by Standard & Poor’s and P-2 by Moody’s and, based on the Board’s authorization described above, are currently backstopped by the Revolving Credit Facility, as amounts undrawn under the Revolving Credit Facility are available to repay Commercial Paper, if necessary.  The Company reviews its optimal mix of short-term and long-term debt regularly and may replace certain amounts of Commercial Paper, short-term debt and current maturities of long-term debt with new issuances of long-term debt in the future.\n​\n43\n\n\nTable of Contents\nAs of September 30, 2025, the Company has outstanding senior notes (the “Senior Notes”) as follows:\n​\n​\n​\n​\n​\n​\n​\nPrincipal\n  \nInterest\n  \n​\nAmount\n  \nRate\n​\nMaturity\n$\n 350.0\n​\n4.750\n% \nMarch 2026\n​\n 700.0\n​\n5.050\n% \nApril 2027\n​\n 750.0\n​\n4.375\n% \nJune 2028\n​\n 450.0\n​\n5.050\n% \nApril 2029\n​\n 500.0\n  \n4.350\n% \nJune 2029\n​\n 900.0\n  \n2.800\n% \nFebruary 2030\n​\n 750.0\n​\n2.200\n% \nSeptember 2031\n​\n 600.0\n​\n5.250\n% \nApril 2034\n​\n 750.0\n​\n5.000\n% \nJanuary 2035\n​\n 500.0\n​\n5.375\n% \nNovember 2054\n​\n​\n​\n​\n​\n​\n€\n 500.0\n​\n0.750\n% \nMay 2026 (Euro Notes)\n​\n 500.0\n  \n2.00\n% \nOctober 2028 (Euro Notes)\n​\n 600.0\n  \n3.125\n% \nJune 2032 (Euro Notes)\n​\nOn June 12, 2025, the Company issued $750.0 aggregate principal amount of unsecured 4.375% Senior Notes due June 12, 2028 at 99.911% of face value (the “2028 Senior Notes”).  The 2028 Senior Notes are unsecured and rank equally in right of payment with all of the Company’s other senior unsecured and unsubordinated indebtedness, including the Company’s guarantee of the Euro Issuer’s obligations under the Existing Euro Notes.  Interest on the 2028 Senior Notes is payable semiannually on June 12 and December 12 of each year, commencing on December 12, 2025.  Prior to May 12, 2028, the Company may redeem, from time to time, some or all of the 2028 Senior Notes at a redemption price equal to 100% of the principal amount thereof, plus accrued and unpaid interest, if any, to the date of redemption, plus a make-whole premium.  On or after May 12, 2028, the Company may redeem, from time to time, the 2028 Senior Notes in whole or in part, at a redemption price equal to 100% of the principal amount thereof, plus accrued and unpaid interest, if any, to the date of redemption.  The Company used net proceeds from the 2028 Senior Notes to repay borrowings under the U.S. Commercial Paper Program and for general corporate purposes. \n​\nOn March 3, 2025, the Company used a combination of cash on hand and borrowings under the U.S. Commercial Paper Program to repay the $400.0 aggregate principal amount of unsecured 2.050% Senior Notes due March 1, 2025 upon maturity.\n​\nOn April 5, 2024, the Company issued three series of unsecured senior notes (collectively, the “April Senior Notes”):  (i) $450.0 aggregate principal amount of unsecured 5.050% Senior Notes due April 5, 2027 at 99.887% of face value (the “Original 2027 Senior Notes”), (ii) $450.0 aggregate principal amount of unsecured 5.050% Senior Notes due April 5, 2029 at 99.900% of face value (the “2029 Senior Notes”) and (iii) $600.0 aggregate principal amount of unsecured 5.250% Senior Notes due April 5, 2034 at 99.900% of face value (the “2034 Senior Notes”).  The Company used net proceeds from the April Senior Notes, together with a combination of cash on hand and borrowings under the U.S. Commercial Paper Program, to fund the cash consideration for the CIT acquisition in May 2024, as discussed in further detail in Note 11 of the accompanying Notes to Condensed Consolidated Financial Statements herein, along with the fees and expenses related thereto.\n​\n44\n\n\nTable of Contents\nOn October 31, 2024, the Company issued three series of unsecured senior notes (collectively, the “October Senior Notes”): (i) $250.0 aggregate principal amount of unsecured 5.050% Senior Notes due April 5, 2027 (the “Additional 2027 Senior Notes”), which constituted a further issuance of the Company’s Original 2027 Senior Notes issued in April 2024, thus forming a single series with, and having the same terms (other than the issue date, issue price and the first interest payment date) as, the Original 2027 Senior Notes, and thus having a total aggregate principal amount of $700.0 of unsecured 5.050% Senior Notes due April 5, 2027 outstanding (the Original 2027 Senior Notes, together with the Additional 2027 Senior Notes, collectively referred to as the “2027 Senior Notes”), (ii) $750.0 aggregate principal amount of unsecured 5.000% Senior Notes due January 15, 2035 (the “2035 Senior Notes”) and (iii) $500.0 aggregate principal amount of unsecured 5.375% Senior Notes due November 15, 2054 (the “2054 Senior Notes”).  On January 31, 2025, the Company used the net proceeds from the October Senior Notes, together with borrowings under the U.S. Commercial Paper Program and cash on hand, to fund the cash consideration for the Company’s acquisition of the Andrew Business, along with the fees and expenses related thereto.\n​\nAll of the Company’s outstanding senior notes in the United States (the “U.S. Senior Notes”) are unsecured and rank equally in right of payment with all of the Company’s other senior unsecured and unsubordinated indebtedness, including the Company’s guarantee of the Euro Issuer’s obligations under the Existing Euro Notes.  Interest on each series of U.S. Senior Notes is payable semiannually.  The Company may, at its option, redeem some or all of any series of U.S. Senior Notes at any time, subject to certain terms and conditions.\n​\nOn June 16, 2025, the Company issued €600.0 (approximately $685.9 at date of issuance) aggregate principal amount of unsecured 3.125% Senior Notes due June 16, 2032 at 99.247% of face value (the “2032 Euro Notes”).  The 2032 Euro Notes are unsecured and rank equally in right of payment with all of the Company’s other senior unsecured and unsubordinated indebtedness, including the Company’s guarantee of the Euro Issuer’s obligations under the Existing Euro Notes.  Interest on the 2032 Euro Notes is payable annually on June 16 of each year, commencing on June 16, 2026.  Prior to March 16, 2032, the Company may redeem, from time to time, some or all of the 2032 Euro Notes at a redemption price equal to 100% of the principal amount thereof, plus accrued and unpaid interest, if any, to the date of redemption, plus a make-whole premium.  On or after March 16, 2032, the Company may redeem, from time to time, the 2032 Euro Notes in whole or in part, at a redemption price equal to 100% of the principal amount thereof, plus accrued and unpaid interest, if any, to the date of redemption.  The Company used net proceeds from the 2032 Euro Notes to repay borrowings under the U.S. Commercial Paper Program and for general corporate purposes. \n​\nThe Euro Issuer has two outstanding unsecured senior notes issued in Europe (the “Existing Euro Notes”, together with the 2032 Euro Notes, the “Euro Notes” and, together with the U.S. Senior Notes, the “Senior Notes”), each of which was issued with an aggregate principal amount of €500.0, with one series of the Existing Euro Notes maturing in May 2026 and the other in October 2028.  The Existing Euro Notes are unsecured and rank equally in right of payment with all of the Euro Issuer’s senior unsecured and unsubordinated indebtedness and are fully and unconditionally guaranteed on a senior unsecured basis by the Company.  Interest on each series of Existing Euro Notes is payable annually.  The Company may, at its option, redeem some or all of either series of Existing Euro Notes at any time, subject to certain terms and conditions.\n​\nThe Senior Notes impose certain obligations on the Company and prohibit various actions by the Company unless it satisfies certain financial requirements.  On September 30, 2025, the Company was in compliance with all requirements under its Senior Notes.  Refer to Note 4 of the Notes to Condensed Consolidated Financial Statements for further information related to the Company’s debt.\n​\n45\n\n\nTable of Contents\nOn April 23, 2024, the Board authorized a stock repurchase program under which the Company may purchase up to $2,000.0 of its Common Stock during the three-year period ending on the close of business on April 28, 2027 (the “2024 Stock Repurchase Program”).  The 2024 Stock Repurchase Program became effective on April 29, 2024.  \nDuring the three and nine months ended September 30, 2025, the Company repurchased 1.4 million and 6.1 million shares of its Common Stock for $152.9 and $493.9, respectively, under the 2024 Stock Repurchase Program.  \nOf the total repurchases made during the nine months ended September 30, 2025 under the 2024 Stock Repurchase Program, 4.7 million shares, or $341.0, have been retired by the Company, with the remainder of the repurchased shares retained in Treasury stock at the time of repurchase.  \nFrom October 1, 2025 to October 21, 2025, the Company repurchased 0.3 million additional shares of its Common Stock for $39.5, and, as of October 21, 2025, the Company has remaining authorization to purchase up to $1,002.9 of its Common Stock under the 2024 Stock Repurchase Program.  \nThe timing and amount of any future repurchases will depend on a number of factors, such as the levels of cash generation from operations, the volume of stock options exercised by employees, cash requirements for acquisitions, dividends paid, economic and market conditions and the price of the Common Stock.\n​\nContingent upon declaration by the Board, the Company pays a quarterly dividend on shares of its Common Stock.  On July 23, 2024, the Board approved an increase to the Company’s quarterly dividend rate from $0.11 per share to $0.165 per share, effective with dividends declared in the third quarter of 2024, and on October 21, 2025, the Board approved an additional increase to the Company’s quarterly dividend rate from $0.165 per share to $0.25 per share, effective with dividends declared in the fourth quarter of 2025, contingent upon declaration by the Board.\n​\nThe following table summarizes the declared quarterly dividends per share as well as the dividends declared and paid during the three and nine months ended September 30, 2025 and 2024:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nThree Months Ended September 30, \n​\nNine Months Ended September 30, \n​\n    \n2025\n \n​\n2024\n​\n2025\n \n​\n2024\nDividends declared per share\n​\n$\n 0.165\n​\n$\n 0.165\n​\n$\n 0.495\n​\n$\n 0.385\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nDividends declared\n​\n$\n 201.9\n​\n$\n 198.9\n​\n$\n 602.7\n​\n$\n 463.4\nDividends paid (including those declared in the prior year)\n​\n \n 201.2\n​\n \n 132.4\n​\n \n 600.3\n​\n \n 396.2\n​\nAcquisitions\n​\nDuring the nine months ended September 30, 2025, the Company completed four acquisitions (collectively, the “2025 Acquisitions”), including the acquisition of the Andrew Business from CommScope, for approximately $2,772.2, net of cash acquired.  The Andrew Business has been included in the Communications Solutions segment, two acquisitions have been included in the Harsh Environment Solutions segment, and one acquisition has been included in the Interconnect and Sensor Systems segment. The 2025 Acquisitions were each funded using cash on hand, proceeds from the\n October Senior Notes, borrowings under the U.S. Commercial Paper Program, or a combination thereof\n.  The 2025 Acquisitions were not material, either individually or in the aggregate, to the Company’s financial results.\n​\nDuring the year ended December 31, 2024, the Company completed two acquisitions (collectively, the “2024 Acquisitions”), including the acquisition of CIT, for approximately $2,156.4, net of cash acquired.  Both acquisitions have been included in the Harsh Environment Solutions segment.  The 2024 Acquisitions were each funded using cash on hand, proceeds from the April Senior Notes or borrowings under the U.S. Commercial Paper Program, or a combination thereof.  The 2024 Acquisitions were not material, either individually or in the aggregate, to the Company’s financial results.\n​\n46\n\n\nTable of Contents\nAcquisition-related expenses\n​\nDuring the nine months ended September 30, 2025, the Company incurred $133.8 ($106.3 after-tax) of acquisition-related expenses, comprised primarily of (i) the non-cash amortization of the value associated with acquired backlog resulting from the Andrew Business acquisition and external transaction costs related to acquisitions (such acquisition-related expenses aggregating $56.0 are presented separately in the Condensed Consolidated Statements of Income) and (ii) the non-cash amortization of acquisition-related inventory step-up costs of $77.8 associated with the Andrew Business acquisition (such costs are recorded in Cost of sales in the Condensed Consolidated Statements of Income)\n.  \n​\nDuring the three and nine months ended September 30, 2024, the Company incurred $63.6 ($49.8 after-tax) and $133.6 ($109.7 after-tax), respectively, of acquisition-related expenses, comprised primarily of (i) the amortization related to the value associated with the acquired backlog resulting from the CIT acquisition and external transaction costs associated with acquisitions (such acquisition-related expenses aggregating $45.4 and $115.4, respectively, are presented separately in the Condensed Consolidated Statements of Income) and (ii) the amortization of acquisition-related inventory step-up costs in the third quarter of 2024 of $18.2 associated with the CIT acquisition (such costs are recorded in Cost of sales in the Condensed Consolidated Statements of Income).\n​\nPurchase Agreement to Acquire CommScope’s Connectivity and Cable Solutions Business\n​\nOn August 4, 2025, the Company entered into a Purchase Agreement with CommScope to acquire CommScope’s Connectivity and Cable Solutions Business (“CCS Business”), for an aggregate purchase price of approximately $10,500 in cash, subject to customary post-closing adjustments.  Subject to the receipt of certain regulatory approvals and satisfaction of other customary closing conditions, the acquisition is expected to close by the end of the first quarter of 2026.  The Company expects to finance this acquisition through a combination of cash on hand and debt.  In connection with its entry into the Purchase Agreement, the Company obtained a commitment from JPMorgan Chase Bank, N.A., BNP Paribas, BNP Paribas Securities Corp. and Mizuho Bank, Ltd. for a $10,500 senior unsecured bridge facility, subject to customary conditions.  A portion ($4,000) of such financing was replaced by the Delayed Draw Term Loans, as discussed in Note 4 herein, and the remaining $6,500 is expected to be replaced by the issuance of new senior unsecured notes prior to the closing of the acquisition.  The CCS Business would expand the Company’s interconnect product capabilities in the IT datacom, communications networks and industrial markets, particularly adding complementary fiber optic interconnect capabilities.  If, and when, the acquisition is consummated, the Company expects to report the CCS Business within its Communications Solutions segment. \n​\nPurchase Agreement to Acquire Trexon\n​\nOn August 18, 2025, the Company announced that it had entered into a definitive agreement to acquire Trexon, for an aggregate purchase price of approximately $1,000 in cash, subject to customary post-closing adjustments.  Subject to the receipt of certain regulatory approvals and satisfaction of other customary closing conditions, the acquisition is expected to close by the end of the fourth quarter of 2025.  The Company expects to finance this acquisition with cash on hand.  Trexon would expand the Company’s high-reliability interconnect and cable assembly capabilities, primarily for the defense market.  If, and when, the acquisition is consummated, the Company expects to report Trexon within its Harsh Environment Solutions segment.\n​\nEnvironmental Matters\n​\nCertain operations of the Company are subject to environmental laws and regulations that govern the discharge of pollutants into the air and water, as well as the handling and disposal of solid and hazardous wastes.  The Company believes that its operations are currently in substantial compliance with applicable environmental laws and regulations and that the costs of continuing compliance will not have a material adverse effect on the Company’s financial condition, results of operations or cash flows.\n​\n47\n\n\nTable of Contents\nNon-GAAP Financial Measures\n​\nIn addition to assessing the Company’s financial condition, results of operations, liquidity and cash flows in accordance with U.S. GAAP, management utilizes certain non-GAAP financial measures, defined below, as part of its internal reviews for purposes of monitoring, evaluating and forecasting the Company’s financial performance, communicating operating results to the Board and assessing related employee compensation measures.  Management believes that these non-GAAP financial measures may be helpful to investors in assessing the Company’s overall financial performance, trends and period-over-period comparative results, in addition to the reasons noted below.  Non-GAAP financial measures related to operating income, operating margin, net income attributable to Amphenol Corporation, effective tax rate and diluted EPS exclude income and expenses that are not directly related to the Company’s operating performance during the periods presented.  Items excluded in the presentation of such non-GAAP financial measures in any period may consist of, without limitation, acquisition-related expenses, refinancing-related costs, gains associated with bargain purchase acquisitions, and certain discrete tax items including, but not limited to, (i) the excess tax benefits related to stock-based compensation, (ii) the impact of tax audits relating to prior periods and (iii) significant changes in tax law.  Non-GAAP financial measures related to net sales exclude the impact of foreign currency exchange rates and acquisitions.  The non-GAAP financial information contained herein is included for supplemental purposes only and should not be considered in isolation or as a substitute for or superior to the related U.S. GAAP financial measures.  In addition, these non-GAAP financial measures are not necessarily the same or comparable to similar measures presented by other companies as such measures may be calculated differently or may exclude different items.\nThe non-GAAP financial measures defined below should be read in conjunction with the Company’s financial statements presented in accordance with U.S. GAAP.  The reconciliations of these non-GAAP financial measures to the most directly comparable U.S. GAAP financial measures for the three and nine months ended September 30, 2025 and 2024 are included in “Results of Operations” and “Liquidity and Capital Resources” within this Item 2:\n​\n●\nAdjusted Diluted EPS\n is defined as diluted earnings per share (as reported in accordance with U.S. GAAP), excluding income and expenses and their specific tax effects that are not directly related to the Company’s operating performance during the periods presented.  Adjusted Diluted EPS is calculated as Adjusted Net Income attributable to Amphenol Corporation, as defined below, divided by the weighted average outstanding diluted shares as reported in the Condensed Consolidated Statements of Income.\n​\n●\nAdjusted Effective Tax Rate\n is defined as Provision for income taxes, as reported in the Condensed Consolidated Statements of Income, expressed as a percentage of Income before income taxes, as reported in the Condensed Consolidated Statements of Income, each excluding income and expenses and their specific tax effects that are not directly related to the Company’s operating performance during the periods presented.\n​\n●\nAdjusted Net Income attributable to Amphenol Corporation \nis defined as Net income attributable to Amphenol Corporation, as reported in the Condensed Consolidated Statements of Income, excluding income and expenses and their specific tax effects that are not directly related to the Company’s operating performance during the periods presented.\n​\n●\nAdjusted Operating Income\n is defined as Operating income, as reported in the Condensed Consolidated Statements of Income, excluding income and expenses that are not directly related to the Company’s operating performance during the periods presented.\n​\n●\nAdjusted Operating Margin\n is defined as Adjusted Operating Income (as defined above) expressed as a percentage of Net sales (as reported in the Condensed Consolidated Statements of Income).\n​\n48\n\n\nTable of Contents\n●\nConstant Currency Net Sales Growth\n is defined as the period-over-period percentage change in net sales growth, excluding the impact of changes in foreign currency exchange rates.  The Company’s results are subject to volatility related to foreign currency translation fluctuations.  As such, management evaluates the Company’s sales performance based on actual sales growth in U.S. dollars, as well as Organic Net Sales Growth (as defined below) and Constant Currency Net Sales Growth, and believes that such information is useful to investors to assess the underlying sales trends.\n​\n●\nFree Cash Flow\n is defined as (i) Net cash provided by operating activities (“Operating Cash Flow” - as reported in accordance with U.S. GAAP) less (ii) capital expenditures (as reported in accordance with U.S. GAAP), net of proceeds from disposals of property, plant and equipment (as reported in accordance with U.S. GAAP), all of which are derived from the Condensed Consolidated Statements of Cash Flow.  Free Cash Flow is an important liquidity measure for the Company, as we believe it is useful for management and investors to assess our ability to generate cash, as well as to assess how much cash can be used to reinvest in the growth of the Company or to return to stockholders through either stock repurchases or dividends.\n​\n●\nOrganic Net Sales Growth\n is defined as the period-over-period percentage change in net sales growth resulting from operating volume, pricing changes and sales mix and excludes the impact of (i) changes in foreign currency exchange rates (described above), which is outside the control of the Company, and (ii) acquisitions, both of which are taken as a percentage of the respective prior period(s) net sales.  The acquisition impact represents the percentage impact on net sales resulting from acquisitions that have not been included in the Company's consolidated results for the full current period(s) and/or prior comparable period(s) presented.  Such net sales related to these acquisitions do not reflect the underlying growth of the Company on a comparative basis.  Management evaluates the Company’s sales performance based on actual sales growth in U.S. dollars, as well as Constant Currency Net Sales Growth (as defined above) and Organic Net Sales Growth, and believes that such information is useful to investors to assess the underlying sales trends.\n​\nCritical Accounting Policies and Estimates\n​\nThe Company’s disclosures of its critical accounting policies and estimates, which are discussed in Part II, Item 7. \nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\n of its 2024 Annual Report, have not materially changed since that report was filed.\n​"
}