{
  "source_file": "app-20241231.htm",
  "form_type": "10-K",
  "item1": "Item 1. Business\nOur mission is to create meaningful connections between companies and their ideal customers. We provide end-to-end artificial intelligence-powered (\"AI\") advertising solutions for businesses to reach, monetize and grow their global audience (\"Advertising\"). We also operate a portfolio of owned mobile apps (“Apps”). Our scaled business model is intricately linked to the advertising ecosystem, providing a durable competitive advantage. We generate revenue when our advertisers achieve their return on spend targets with our Advertising solutions, ensuring that their success directly fuels our growth.\nAppLovin is critical to the success of advertisers and publishers seeking to solve marketing and monetization challenges. Through our technologies and scaled distribution, advertisers are able to better place content so that it is discovered by the right audience, manage, optimize, and analyze their marketing investments, and improve the monetization of their content, and publishers are able to better monetize their gaming apps. Our Advertising solutions include a comprehensive suite of tools including: \n•\nAppDiscovery, our user acquisition solution, is the cornerstone of our Advertising solutions. AppDiscovery is powered by AXON, our AI-powered advertising engine, and matches advertiser demand with publisher supply through auctions at vast scale and at microsecond-level speeds.\n•\nMAX is our monetization solution, utilizing an advanced in-app bidding technology that optimizes the value of a publisher’s advertising inventory by running a real-time competitive auction, driving more competition, and higher returns for publishers.\n•\nAdjust is our measurement and analytics marketing platform which provides marketers with the visibility, insights, and data needed to scale their apps marketing and drive more informed results. \n•\nWurl is our connected TV (\"CTV\") platform that both distributes streaming video for content companies and provides advanced advertising and publishing solutions to attract viewers and maximize revenue.\nWe generate our revenue from Advertising and our Apps. As more advertisers use our Advertising solutions to market and monetize their content, we gain access to more data regarding users and user engagement\n1\n, further strengthening our scaled distribution. As our distribution grows, we gain better insights for our AXON recommendation engine, which then further enhances the efficiency and effectiveness of our Advertising solutions. Our Apps consist of a globally diversified portfolio of over 200 free-to-play mobile games across five genres, run by ten studios, some of which we own and others that we partner with. Our studios generally focus on the development of easy to learn and play games, which appeal to a broad range of demographics, but our portfolio also includes several games for other genres.\nWe report our operating results through two reportable segments: Advertising and Apps. These segments align with how our Chief Operating Decision Maker (\"CODM\") allocates resources, makes operating decisions, and manages and assesses the performance of our business. For the amount of revenue derived from our two segments and other relevant data for the years ended December 31, 2024, 2023, and 2022, as well as other additional information, see Note 14 of our consolidated financial statements included elsewhere in this Annual Report on Form 10-K.\nAppLovin Advertising\nOur comprehensive, end-to-end Advertising solutions deliver value by helping companies scale their businesses and maximize their revenue. Specifically, our solutions enable advertisers to automate their marketing, engagement, and monetization efforts in three core ways. First, we provide marketing technology that allows advertisers to reach more of the most suitable users with personalized content in order to increase the number of users who download and engage with their content. Second, we provide advertisers with monetization and analytics technology to maximize the value of their advertising inventory \n1\n \nAdjust’s marketing platform is operated by our wholly-owned subsidiary and data generated by Adjust's services is not shared with AppLovin or incorporated into or used to optimize its recommendation engine or other technologies. \n2\nTable\n of \nContents\nby obtaining a high price for each impression. Third, we provide developers, who are often also advertisers, a set of capabilities to optimize their apps and help streamline their businesses. Additionally, we have entered the CTV advertising market with the integration of Wurl.\nOur Advertising solutions also enable publishers to leverage real-time auctions that optimize the value for each impression, while simultaneously enabling them to attain an attractive value for each of the impressions from their advertising inventory. When these mutually reinforcing elements are combined, it creates a robust and successful marketing and monetization engine that both sells attractive advertising inventory to advertisers while monetizing it for publishers. \nOur Advertising solutions are delivered through an integrated and seamless user interface, which provides the following benefits to advertisers: \n•\nReach and attract users at scale: \nWe provide advertisers with access to approximately 1.6 billion daily active users\n2\n, enabling developers to target and find the right users for their content worldwide. Advertisers are able to set their user acquisition and revenue goals to target the most relevant, highest value users.\n•\nMaximize monetization of engagement: \nAdvertisers use MAX to generate incremental revenue by maximizing the monetization of their ad inventory. Our tools operate at microsecond-level speeds and at vast scale to enhance monetization for developers while preserving the end user experience.\n•\nLeverage proprietary data and insights: \nAdvertisers benefit from accessing comprehensive real-time insights through our customized user dashboards, helping them optimize campaigns, improve user engagement, and manage their return on investment.\n•\nAutomate time consuming and manual processes: \nOur Advertising solutions automate marketing and monetization, allowing advertisers to focus on improving their content rather than managing complex go-to-market processes manually.\n•\nSeamlessly adapt to industry innovation: \nOur technology is regularly updated as the advertising ecosystem evolves. Advertisers benefit from this ongoing advancement and optimization and are able to rapidly adapt to industry changes in marketing and monetization without losing focus on content creation.\nOur Advertising solutions are primarily made up of four key products: AppDiscovery, MAX, Adjust, and Wurl.\nAppDiscovery \nAppDiscovery is a suite of marketing solutions that enables developers to automate, optimize, and manage their marketing efforts. AppDiscovery is powered by AXON's predictive algorithms to enable advertisers to match their apps to users that are more likely to download them. This form of personalized advertising focuses on the end user, enabling the advertisers to find the right users and delivering to users more of what they are likely to be interested in. Advertisers set return goals for their campaigns and AppDiscovery targets users to match those goals. Return on advertising spend is measured based on third-party attribution, Advertisers are charged for advertising dynamically based on the revenue they receive from acquired users, rather than a simple fixed price per impression or per action (click or installation). Advertisers are not only able to attract users that download, but also find a high volume of users that stay and engage with their apps for greater retention and ultimately, increased opportunities for better monetization. Revenue from AppDiscovery comprises a vast majority of our Advertising Revenue.\nWith AppDiscovery, advertisers can define the framework of their campaigns in the following ways:\n•\nReach:\n Advertisers identify what they are willing to pay to acquire their target users. Our technology finds the users at that value who are most likely to download and engage with the app.\n•\nGlobal scale:\n Advertisers can choose to connect with users in different regions around the world, and our technology suggests the best locations based on their parameters.\n2\n \nWe calculate daily active users as the average number of unique device identities that open a mobile app (whether that mobile app our own or a third party’s) which has our software development kit (SDK) on each day in a period. We measure this figure through our SDK. An individual who uses an app in more than one country on a particular day will be counted as more than one unique device identity; however, if an individual uses more than one app in the same day, such individual is only counted once. This figure does not include any users who have opted out of allowing apps to track on their mobile phone\n.\n3\nTable\n of \nContents\n•\nRetain and engage:\n Our system is built around optimizing to the advertisers revenue so our algorithms automatically adjust based on the likelihood users will engage. Our clients can analyze by retention periods from initial app download onwards, so that advertisers understand the effectiveness of their marketing investments.\n•\nTargeted returns:\n Advertisers set their goals and target return on ad sales and our algorithms adjust cost and campaign specifics to meet them.\nAppDiscovery includes the following features:\n•\nAdvanced campaign management:\n An interface to create, manage, and automatically optimize campaigns based on return on ad sales goals.\n•\nReal-time analytics:\n An interface to see results and optimize against them with our ROI-based analytics environment.\n•\nLifetime Value (\"LTV\") reporting:\n A tool that breaks down campaign results by source and location, allowing advertisers to make real-time, informed decisions about the value and longevity of their campaigns.\n•\nHigh quality and quantity creatives:\n Advertisers can make and test as many creatives as needed. They also have access to our in-house creative team, SparkLabs, for expert ad creation and testing strategies.\nMAX \nMAX is our in-app bidding solution that optimizes the value of publishers' advertising inventory by running a single unbiased, real-time competitive auction, driving more competition and higher returns for publishers. MAX auctions are more effective than historical tools and approaches because MAX yields more targeted users for advertisers and enables publishers to achieve better competitive prices for each impression. Many developers who integrate MAX have experienced a measurable increase in their average revenue per daily active user (\"ARPDAU\") over traditional monetization tools and save countless hours because they are able to automate manual monetization work through its advanced feature set. As a result, MAX has become the preferred in-app bidding solution for many publishers worldwide, helping drive meaningful growth and momentum for AppLovin.\nMAX includes the following features:\n•\nAdvanced in-app bidding technology: \nMAX’s competitive auctions happen in real time with most bidding platforms in the industry bidding simultaneously for developers’ inventory at high volume. The competitive global demand helps maximize average revenue per user on each impression with many developers experiencing a measurable increase when moving to MAX.\n•\nAutomated monetization: \nMAX saves developers time through its extensive suite of APIs for automation.\n•\nAd quality assurance and review: \nMAX drives superior user experience with exclusive features that automatically flag risky content to keep developers’ brands safe.\n•\nPowerful insights: \nMAX helps developers better understand the LTV for each user and increase revenue to maximize yield for each ad opportunity.\nAdjust\nAdjust is our measurement and analytics marketing platform which provides the visibility, insights, and tools marketers need to grow their apps from early stage to maturity. Our software-as-a-service (\"SaaS\") platform is an end-to-end solution for optimizing ad performance and maximizing returns, powered by accurate attribution data and in-depth reporting that are essential for meeting business goals. Adjust allows clients to better understand their users’ journey while allowing marketers to make smarter decisions through measurement, attribution, and fraud prevention.\nThe Adjust product solutions allow customers to benefit from the following key features: \n•\nImpact through measurement:\n Drive results faster with accurate, timely measurement on marketing and ad spend across channels.\n•\nInsights through real-time data and reports: \nEasily share timely, actionable insights with stakeholders to drive their business forward.\n•\nStrategic growth with automated attribution solutions: \nScale profits with automated solutions that attribute sources and help customers work smarter and accomplish more.\nWurl\nWurl is our connected TV (\"CTV\") platform which distributes streaming video for content companies and provides advertising and publishing solutions to maximize Advertising Revenue, grow their CTV viewership, and strengthen their brand value. Wurl focuses on driving the streaming industry forward with market-leading solutions that help connect the right viewers to the right content. It brings data-driven advertising and measurement to Connected TV. The technology helps companies engage with the highest-value viewers, and ultimately increase their revenue.\n4\nTable\n of \nContents\nWurl has built the following products to meet their customers’ needs:\n•\nAdPool: \nis a monetization solution that connects CTV supply with top advertisers and access to exclusive demand.\n•\nTVBits:\n is an AI-powered interactive, personalized, short-form CTV application that allows viewers to discover content and content companies and streamers the ability to increase viewership, engagement, and revenue.\n•\nBrandDiscovery:\n is an AI-powered CTV advertising tool that identifies contextual segments based on genre, brand safety, and the emotion of each scene to help advertisers deliver the right ad at the right time.\n•\nContentDiscovery:\n is an AI-powered advertising solution that grows audiences, increases engagement, and reduces churn for streaming platforms and apps.\n•\nGlobal FAST Pass (GFP):\n is a distribution solution that makes it easy to launch Free Ad-supported CTV channels, monetize them instantly, and access data to grow and retain audiences.\nAppLovin Apps\nToday, our Apps consist of a globally diversified portfolio of over 200 free-to-play mobile games across five genres, run by ten studios located worldwide with a deep bench of talented developers. Our studios have developed and published games across a number of genres including: casual, match-three, card/casino, mid-core, and hyper-casual. A large portion of our portfolio are casual, match-three and card/casino games that have a lower risk of development and generally have more predictable revenue streams and return. These games can be played a few minutes at a time and appeal to a wide range of users across many highly attractive demographics. Our studios leverage live ops to quickly iterate and increase in-game monetization by optimizing app economies and improving in-game conversion on items and offers. The studios operating our portfolio of Apps utilize our Advertising solutions to market, scale, and monetize our Apps.\nOn February 12, 2025, we announced that we had entered into a term sheet for the sale of our mobile gaming business to a privately held company for total consideration of $900.0 million, consisting of $400.0 million in shares of the acquirer’s common equity and $500.0 million in cash, subject to customary purchase price adjustments. For additional information, refer to Part II, Item 7, \"Management's Discussion and Analysis of Financial Condition and Results of Operations—Recent Developments\".\nOur Strategy for Growth\nWe have a comprehensive strategy to continue our growth and further enhance our market position in the advertising ecosystem:\n•\nExisting market expansion: \nWe continue to have an attractive market opportunity within our current mobile app segment, which we intend to address through the optimization of our Advertising solutions.\n•\nEnhance and extend AI-based technologies: \nAs we increase our scale and reach, our customers benefit from compounding improvements to AXON, our AI-powered advertising engine, which in turn improves the efficacy and growth of our Advertising solutions.\n•\nNew market expansion: \nWe are confident our technology and expertise are applicable to other market segments and geographies we have not historically addressed, including:\n◦\nNon-gaming mobile app segments and industries:\n One of our long-term objectives is to provide critical tools to mobile app developers across multiple verticals, including, for example, e-commerce and social media. We have made our Advertising solutions available to e-commerce advertisers, and while we are early in this market expansion, our e-commerce customers to date have experienced positive results, demonstrating the flexibility and future growth potential of our Advertising solutions.\n◦\nOther content industries: \nWe believe our deep expertise and capabilities will allow us to successfully apply our solutions to tangential sectors, including with mobile OEMs and carriers through our Array product initiative, as well as the growing CTV industry through Wurl. We continue to expand our CTV business through the addition of new content advertisers and supply channels as well as through the application of AXON to CTV. \n◦\nIndustry partnerships:\n We plan to further invest in our sales and marketing teams to increase penetration among new and existing clients, including in expansion markets we are targeting. \n•\nAttracting and retaining the best talent:\n Our employees are at the core of our technology and success. We intend to continue to invest in attracting and retaining exceptional talent who share our values and will drive our future growth.\n•\nPursue strategic investments and partnerships: \nGiven our proven track record in strategic transactions, and our long-standing relationships with key industry players, we have earned a reputation as a partner of choice, and will continue to consider and leverage strategic acquisitions, partnerships, and investment opportunities to accelerate our growth.\n5\nTable\n of \nContents\nOur Customers and Developer Community\nOur globally diverse customers range from the largest enterprises to small and independent businesses and individuals across a variety of industries. Our customers comprise multiple groups within the advertising ecosystem including advertisers leveraging our platform to find users and advertising networks using our mediation solution to purchase advertising inventory. Our Apps also work with advertising networks who purchase advertising inventory and consumers who purchase in-app products. We also work with the mobile app publisher community who leverage our mediation solution to monetize their advertising inventory. The scale and breadth of our customers in terms of size and industry provides us with a competitive advantage.\nCompetition\nWe operate in a fragmented advertising ecosystem composed of divisions of large, well-established companies as well as privately-held companies. The large companies in our advertising and mobile app ecosystems may play multiple different roles given the breadth of their businesses.\n•\nAdvertisers typically engage with several advertising platforms and networks to purchase advertisements on mobile apps, devices, and on CTV, looking to optimize their marketing investments. Such advertising companies vary in size and include Facebook, Google, Amazon, and Unity Software, as well as various private companies, several of which are also our partners and clients.\n•\nThere are many companies that develop online and mobile games and other mobile apps. The larger gaming companies in our gaming ecosystem include Activision Blizzard (Microsoft), Tencent, and Zynga (Take-Two Interactive), as well as other public and private companies, many of which are also our partners and clients. We also expect new developers to enter the market and existing companies to allocate more resources to develop and market more mobile games and apps.\nWe believe that the principal competitive factors in our market are:\n•\nthe ability to enhance and improve technologies and offerings;\n•\nknowledge, expertise, and experience in the advertising ecosystem;\n•\nrelationships with third parties in the advertising ecosystem;\n•\nthe ability to reach and target a large number of users;\n•\nthe ability to identify and execute on strategic transactions;\n•\nthe ability to successfully launch and monetize mobile apps;\n•\nthe pricing and perceived value of offerings;\n•\nbrand and reputation; and\n•\nability to expand into new offerings and geographies.\nWe believe we compete favorably with respect to these factors.\nSeasonality\nThe revenue we generate from our Advertising solutions may experience seasonality in the fourth quarter of the year due in part to seasonal holiday demand. As the breadth of advertisers using our Advertising solutions increases, the impact of this seasonality may become more pronounced over time. \nResearch and Development\nContinued investment in research and development is important to advancing our Advertising solutions, and Apps. The continued development of our AI-powered AXON advertising engine is critical to our future growth and competitive advantage. These AI advancements are also key to attaining our strategic objectives and meeting the evolving needs of our customers. The underlying elastic architecture of our solutions allows us to create, test, and deploy new features rapidly while distributing them globally. \nOur research and development team is working on cutting edge technologies, which allows us to attract top talent globally. As of December 31, 2024, we had approximately 788 employees, or 50% of our total headcount, involved in research and development and related activities. Our research and development organization is based in Palo Alto, California with additional resources around the world.\nIntellectual Property\nOur success depends in part upon our ability to protect our intellectual property rights with respect to our Advertising solutions and Apps, and to operate without infringing, misappropriating or otherwise violating valid and enforceable third-party intellectual property. We seek to accomplish that objective by establishing intellectual property rights in and protecting those assets through a combination of registered and unregistered trademarks, copyrights, trade secrets, license agreements, confidentiality procedures, non-disclosure agreements with third parties, and other contractual measures. Though we rely in part \n6\nTable\n of \nContents\nupon these legal and contractual protections, we believe that factors, such as our unique position in the advertising ecosystem, our expertise and determination of our employees, the speed of our technological development and the functionality and flexibility of our Advertising solutions in an ever-evolving industry, are critical contributors to our success.\nAs of December 31, 2024, we owned the following trademarks related to the business: 58 registered trademarks in the United States, 16 pending trademark applications in the United States, as well as 400 registered trademarks in non-U.S. jurisdictions, and 31 pending trademark applications in various non-U.S. jurisdictions. We also have registered domain names for websites that we use in our business, such as www.applovin.com. As of December 31, 2024, we owned seven patents related to our Advertising solutions and four related to our Apps business. \nWe intend to pursue additional intellectual property protection to the extent we believe it would advance our business objectives and maintain our competitive position. Notwithstanding these efforts, there can be no assurance that we will adequately protect our intellectual property or that it will provide any competitive advantage. We take steps to protect our proprietary information, in part, by entering into confidentiality agreements with our employees, consultants, developers, and vendors, and generally limiting access to and distribution of our proprietary information. However, we cannot assure you that the steps taken by us will prevent misappropriation of our proprietary rights. Despite our efforts to protect our intellectual property rights, unauthorized parties may attempt to copy aspects of our Advertising solutions or Apps or obtain and use information that we regard as proprietary. Policing unauthorized use of our proprietary rights is difficult and time consuming. Further, our intellectual property rights may be invalidated, circumvented, or challenged. In addition, the laws of some foreign countries do not protect our proprietary rights to the same extent as the laws of the United States, and many foreign countries do not enforce these laws as diligently as government agencies and private parties in the United States. See the section titled “Risk Factors—Risks Related to Intellectual Property” for more information regarding risks related to intellectual property.\nEmployees and Human Capital Resources\nAs of December 31, 2024, we had a total of 1,563 employees, comprised of 1,533 full-time and 30 part-time/intern employees, located in 17 countries. As a result of our historical strategic acquisition and partnership activity, we also have access to approximately 2,000 additional team members, a majority of whom are research and development resources and all of whom are located outside of the United States. Our geographic diversification enhances our ability to retain and attract highly skilled talent as well as manage our headcount costs. As of December 31, 2024, approximately 54% of our global employees were located outside of the U.S. and 46% in the U.S. Approximately 45% of our U.S. employees are from one or more diverse groups, including Asian, Hispanic or Latino, Black or African American, Native Hawaiian or Other Pacific Islander, American Indian or Alaska Native, or Two or More Races and approximately 34% of our U.S. employees are female. None of our employees are represented by a labor union. In certain countries in which we operate, we are subject to, and comply with, local labor law requirements, which may automatically make our employees subject to industry-wide collective bargaining agreements. We have not experienced any work stoppages and we consider our relations with our employees as positive. \nOur employees are a key reason for our success and essential for our continued growth. We benefit from a distributed global workforce and plan to continue investing in our employees. We provide competitive compensation packages designed to attract and retain talent, as informed by market compensation surveys and data. We have multiple incentive programs throughout the organization designed to provide short-term and long-term incentives, including base cash, equity and/or performance cash awards. \nCompliance with Government Regulation\nWe are subject to various federal, state, and international laws and regulations that affect companies conducting business on mobile platforms, including those relating to privacy, data protection, and the use and protection of data from employees, users and others (including minors), the internet, behavioral advertising, mobile apps, content, advertising and marketing activities, sweepstakes and giveaways, e-commerce and anti-corruption. Additional laws and regulations relating to these areas likely will be passed in the future, and these or existing laws and regulations may be interpreted or enforced in new or expanded manners, each of which could result in significant limitations on ways we can collect and process data of users, employees and others, communicate with users, and operate our business. New and evolving laws and regulations, and changes in their enforcement and interpretation, may require changes to our Advertising solutions, Apps, or business practices, and may significantly increase our compliance costs and otherwise adversely affect our business and results of operations. As our business expands to further scale our Advertising solutions and include additional Apps, as we continue to operate our AI-powered advertising engine AXON, and as our operations continue to expand internationally, our compliance requirements and costs may increase and we may be subject to increased regulatory scrutiny.\nData Privacy and Security Laws\nThe data we collect and otherwise process is integral to our Advertising solutions and Apps, providing us with insights to improve our AI-powered advertising engine AXON and our developer tools, to optimize app discovery and monetization and to improve our Apps. Our collection, use, receipt, and other processing of data in our business subjects us to numerous U.S. state and federal laws and regulations, and foreign laws and regulations, addressing privacy, data protection and the collection, storing, sharing, use, transfer, disclosure, protection and processing of certain types of data. Such regulations include, for example, the European Union General Data Protection Regulation, the Children’s Online Privacy Protection Act, Section 5(a) of the Federal Trade Commission Act, and the California Consumer Privacy Act and similar U.S. state laws. We work to comply with, and to help allow developers and advertising ecosystem partners to comply with, applicable laws and regulations relating to privacy, data protection and information security. This helps underpin our strategy of building trust and providing a strong \n7\nTable\n of \nContents\nexperience to advertising ecosystem partners and clients. See the section titled “Risk Factors—Risks Related to Legal and Regulatory Matters—We are subject to laws and regulations concerning privacy, information security, data protection, consumer protection, advertising, tracking, targeting, and protection of minors, and these laws and regulations are continually evolving. Our actual or perceived failure to comply with these laws and regulations could adversely affect our business, financial condition, and results of operations” for additional information about our approach to laws and regulations relating to privacy, data protection, and information security.\nCorporate Information\nWe were incorporated under the laws of the state of Delaware in July 2011. Our principal executive offices are located at 1100 Page Mill Road, Palo Alto, California 94304, and our telephone number is (800) 839-9646. Our website address is www.applovin.com. Information contained on, or that can be accessed through, our website does not constitute part of this Annual Report on Form 10-K and inclusions of our website address in this Annual Report on Form 10-K are inactive textual references only. You should not consider information contained on our website to be part of this Annual Report on Form 10-K or in deciding whether to purchase shares of our Class A common stock.\n“AppLovin,” our logo, and our other registered or common law trademarks, service marks, or trade names appearing in this Annual Report on Form 10-K are the property of AppLovin Corporation. Other trademarks and trade names referred to in this Annual Report on Form 10-K are the property of their respective owners.\nAvailable Information\nOur Annual Reports on Form 10-K, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K, and amendments to reports filed pursuant to Sections 13(a) and 15(d) of the Securities Exchange Act of 1934, as amended, or the Exchange Act, are filed with the SEC. Such reports and other information filed by us with the SEC are available free of charge on our website at www.investors.applovin.com when such reports are available on the SEC’s website. The SEC maintains an internet site that contains reports, proxy and information statements and other information regarding issuers that file electronically with the SEC at www.sec.gov. The information contained on the websites referenced in this Annual Report on Form 10-K is not incorporated by reference into this filing. Further, our references to website URLs are intended to be inactive textual references only.\nWe announce material information to the public through filings with the SEC, the investor relations page on our website, press releases, public conference calls, webcasts, and our corporate blog at blog.applovin.com in order to achieve broad, non-exclusionary distribution of information to the public and for complying with our disclosure obligations under Regulation FD. We encourage investors, the media, and others to follow the channels listed above and to review the information disclosed through such channels. Any updates to the list of disclosure channels through which we will announce information will be posted on the investor relations page on our website.\n8\nTable\n of \nContents",
  "item7": "Item 7. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe following discussion and analysis of our financial condition and results of operations should be read in conjunction with our consolidated financial statements and the related notes included elsewhere in this Annual Report on Form 10-K. This discussion contains forward-looking statements that involve risks and uncertainties. Factors that could cause or contribute to such differences include those identified below and those discussed in the section titled “Risk Factors” and other parts of this Annual Report on Form 10-K. Our historical results are not necessarily indicative of the results that may be expected for any period in the future. \nOverview\nOur mission is to create meaningful connections between companies and their ideal customers. We provide end-to-end software and AI-powered solutions for businesses to reach, monetize and grow their global audience. We also operate a portfolio of owned mobile apps and accelerated our market penetration through an active acquisition and partnership strategy. Our scaled business model is intricately linked to the advertising ecosystem, providing a durable competitive advantage. We generate revenue when our advertisers achieve their return on spend targets with our Advertising solutions, ensuring that their success directly fuels our growth.\nSince our founding in 2011, we have been focused on building Advertising solutions for advertisers to improve the marketing and monetization of their content. Our founders, who were mobile app developers themselves, quickly realized the real impediment to success and growth in the advertising ecosystem was a discovery and monetization problem—breaking through the congested app stores to efficiently find users and successfully grow their business. Their first-hand experience with these challenges led to the development of our infrastructure and Advertising solutions. We capitalized on our success and understanding of the mobile app ecosystem by entering into the mobile game apps industry in 2018. Our global diversified portfolio of apps now consist of over 200 free-to-play mobile games across five genres, run by ten studios.\nFor 2024, our revenue grew 43% year-over-year from 2023, from $3.3 billion in 2023 to $4.7 billion in 2024. For 2023, our revenue grew 17% year-over-year from 2022, from $2.8 billion in 2022 to $3.3 billion in 2023. We generated net income of $1.6 billion in 2024, net income of $356.7 million in 2023, and net loss of $192.9 million in 2022. We generated Adjusted EBITDA of $2.7 billion, $1.5 billion, and $1.1 billion in 2024, 2023, and 2022, respectively. Additionally, we have generated strong cash flows, with net cash provided by operating activities of $2.1 billion, $1.1 billion, and $412.8 million in 2024, 2023, and 2022, respectively. Given our strong financial position, we have been able to reinvest in our expansion and growth, and repurchase and withhold shares of our Class A common stock. See the section titled “Non-GAAP Financial Measures” for a definition of Adjusted EBITDA and a reconciliation of Adjusted EBITDA to net income (loss), the most directly comparable financial measure calculated in accordance with GAAP.\n43\nTable\n of \nContents\nRecent Developments\nOn February 12, 2025, we announced that we entered into a term sheet for the sale of our mobile gaming business to a privately held company (the “Acquirer”) for total consideration of $900.0 million (the “Term Sheet”). The Term Sheet provides for the total consideration to consist of $400.0 million in shares of the Acquirer’s common equity and $500.0 million in cash, subject to customary purchase price adjustments. The Term Sheet also provides that the Acquirer will borrow up to $250.0 million of the cash portion of the total consideration and that, if the Acquirer is unable to obtain such financing, we agree to provide financing in such amount to the Acquirer through the issuance of a promissory note. The Term Sheet is non-binding, except with respect to an agreement by the parties to use commercially reasonable best efforts in good faith to negotiate and finalize definitive agreements for the proposed transaction, a prohibition on us from engaging in discussions or negotiations with any third party other than the Acquirer regarding the sale of our mobile gaming business for a specified period, and customary terms such as fees and expenses, governing law, and termination.\nOur Business Model\nWe collect revenue from Advertising and our Apps. During the twelve months ended December 31, 2024, Advertising Revenue represented 68% of total revenue and Apps Revenue represented 32% of total revenue.\nWe report our operating results through two reportable segments: Advertising and Apps.\nOur CODM, the Chief Executive Officer, evaluates performance of each segment based on several factors, of which the financial measures are segment revenue and segment adjusted EBITDA, as defined in Note 14 to our consolidated financial statements.\nThe Advertising and Apps segments provide a view into the organization of our business and generate revenue as follows:\nAdvertising Revenue\nWe primarily generate Advertising Revenue from fees paid by advertisers who use our Advertising solutions to grow and monetize their content. We are able to grow our Advertising Revenue by improving our various technologies.\nAdvertising clients include a wide variety of advertisers, from indie developer studios to some of the largest global internet platforms, such as Facebook and Google. We see multiple opportunities to gain new Advertising clients, and to increase spend from existing clients, as we help them grow their businesses and make them more successful.\nOur Advertising solutions include AppDiscovery, MAX, Adjust, and Wurl. Clients use AppDiscovery to automate, optimize, and manage their user acquisition investments. They set marketing and user growth goals, and AppDiscovery optimizes their ad spend in an effort to achieve their return on advertising spend targets and other marketing objectives. AppDiscovery comprises the vast majority of Advertising Revenue. Revenue is generated from our advertisers, typically on a performance-basis, and shared with our advertising publishers, typically on a cost per impression model. \nAdvertising clients use MAX to optimize purchases of app advertising inventory. The MAX tool provides insights to manage against key performance indicators, understand the long-term value of users, and help manage profitability. Revenue from MAX is generated based on a percentage of client spend. As more advertising networks move to in-app real-time bidding, we expect growth in the adoption of, and revenue from, MAX.\nAdvertising clients use Adjust's measurement and analytics marketing platform to better understand their users' journey while allowing marketers to make smarter decisions through measurement, attribution and fraud prevention. Revenue from Adjust is primarily generated from an annual software subscription fee.\nAdvertising clients use Wurl's CTV platform to distribute streaming video, maximize Advertising Revenue, and acquire and retain viewers or subscribers. Revenue from Wurl is primarily generated from content companies, typically on a usage-based model.\nApps Revenue\nApps Revenue is generated when a user of one of our Apps makes an in-app purchase (“IAP\") and when clients purchase the digital advertising inventory of our portfolio of Apps (\"IAA\"). We are able to grow our Apps Revenue by adding more apps to our Apps portfolio and increasing engagement on our existing Apps.\nOur Apps are generally free-to-play mobile games and generate IAP Revenue through IAPs. IAPs consist of virtual goods used to enhance gameplay, accelerate access to certain features or levels, and augment other mobile game progression opportunities for the user. IAPs drive more engagement and better economics from our Apps. The vast majority of our IAP Revenue flows through two app stores, Apple App Store and Google Play, which charge us a standard commission on IAPs. IAP Revenue represented 68% of total Apps Revenue for the twelve months ended December 31, 2024.\nDuring the twelve months ended December 31, 2024, we had an average of 1.6 million Monthly Active Payers (\"MAPs\") across our portfolio of Apps. Over that period, we had an Average Revenue Per Monthly Active Payer (\"ARPMAP\") of $51. See “Key Metrics” below for additional information on how we calculate MAPs and ARPMAP.\nIAA clients that purchase advertising inventory from our Apps are able to target highly relevant users from our diverse and global portfolio of over 200 mobile games. Our clients leverage a broad set of high-performing mobile ad formats, including playable and rewarded video, and are able to match these ads with relevant users resulting in a better return on their advertising \n44\nTable\n of \nContents\nspend. By increasing the number of users and their engagement, as well as better matching ads with the appropriate target audience, we are able to increase our revenue from IAA clients that purchase advertising inventory from our Apps. IAA Revenue represented 32% of total Apps Revenue for the twelve months ended December 31, 2024.\nKey Metrics\nWe review the following key metrics on a regular basis in order to evaluate the health of our business, identify trends affecting our performance, prepare financial projections, and make strategic decisions.\nMonthly Active Payers (\"MAPs\"). \nWe define a MAP as a unique mobile device active on one of our Apps in a month that completed at least one IAP during that time period. A consumer who makes IAPs within two separate Apps on the same mobile device in a monthly period will be counted as two MAPs. MAPs for a particular time period longer than one month are the average MAPs for each month during that period. We estimate the number of MAPs by aggregating certain data from third-party attribution partners. \nAverage Revenue Per Monthly Active Payer (\"ARPMAP\"). \nWe define ARPMAP as (i) the total IAP Revenue derived from our Apps in a monthly period, divided by (ii) MAPs in that same period. ARPMAP for a particular time period longer than one month is the average ARPMAP for each month during that period. ARPMAP shows how efficiently we are monetizing each MAP.\nThe following table shows our Monthly Active Payers and Average Revenue Per Monthly Active Payer for the years ended December 31, 2024, 2023, and 2022:\nYear Ended December 31,\n2024\n2023\n2022\nMonthly Active Payers (millions)\n1.6 \n1.8 \n2.3 \nAverage Revenue Per Monthly Active Payer\n$\n51 \n$\n46 \n$\n43 \nOur key metrics are not based on any standardized industry methodology and are not necessarily calculated in the same manner or comparable to similarly titled measures presented by other companies. Similarly, our key metrics may differ from estimates published by third parties or from similarly titled metrics of our competitors due to differences in methodology. The numbers that we use to calculate MAPs and ARPMAP are based on internal data. While these numbers are based on what we believe to be reasonable judgments and estimates for the applicable period of measurement, there are inherent challenges in measuring usage and engagement. We regularly review and may adjust our processes for calculating our internal metrics to improve their accuracy.\nNon-GAAP Financial Measures\nAdjusted EBITDA and Adjusted EBITDA Margin\nWe define Adjusted EBITDA for a particular period as net income (loss) before interest expense and loss on settlement of debt, other income, net (excluding certain recurring items), provision for (benefit from) income taxes, amortization, depreciation and write-offs and as further adjusted for stock-based compensation expense, acquisition-related expense and transaction bonus, publisher bonuses, MoPub acquisition transition services, restructuring costs, loss on disposal of long-lived assets, and non-operating foreign exchange (gain) losses. We define Adjusted EBITDA margin as Adjusted EBITDA divided by revenue for the same period.\nAdjusted EBITDA and Adjusted EBITDA margin are key measures we use to assess our financial performance and are also used for internal planning and forecasting purposes. We believe Adjusted EBITDA and Adjusted EBITDA margin are helpful to investors, analysts, and other interested parties because they can assist in providing a more consistent and comparable overview of our operations across our historical financial periods. In addition, these measures are frequently used by analysts, investors, and other interested parties to evaluate and assess performance. We use Adjusted EBITDA and Adjusted EBITDA margin in conjunction with GAAP measures as part of our overall assessment of our performance, including the preparation of our annual operating budget and quarterly forecasts, to evaluate the effectiveness of our business strategies, and to communicate with our board of directors concerning our financial performance.\nAdjusted EBITDA and Adjusted EBITDA margin are non-GAAP financial measures and are presented for supplemental informational purposes only and should not be considered as alternatives or substitutes to financial information presented in accordance with GAAP. These measures have certain limitations in that they do not include the impact of certain expenses that are reflected in our consolidated statement of operations that are necessary to run our business. Our definitions may differ from the definitions used by other companies and therefore comparability may be limited. In addition, other companies may not publish these or similar metrics. Thus, our Adjusted EBITDA and Adjusted EBITDA margin should be considered in addition to, not as substitutes for, or in isolation from, measures prepared in accordance with GAAP.\n45\nTable\n of \nContents\nThe following table provides our Adjusted EBITDA and Adjusted EBITDA margin for 2024, 2023, and 2022, and a reconciliation of net income (loss) to Adjusted EBITDA:\nYear Ended December 31,\n2024\n2023\n2022\n(in thousands, except percentages)\nNet income (loss)\n$\n1,579,776\n$\n356,711\n$\n(192,947)\nAdjusted as follows:\nInterest expense and loss on settlement of debt\n318,260\n275,665\n171,863\nOther income, net\n1\n(25,440)\n(7,831)\n(18,647)\nProvision for (benefit from) income taxes\n(3,771)\n23,859\n(12,230)\nAmortization, depreciation and write-offs\n448,680\n489,008\n547,084\nLoss on disposal of long-lived assets\n1,646\n—\n127,892\nNon-operating foreign exchange (gain) loss\n291\n(1,224)\n(164)\nStock-based compensation\n376,455\n363,107\n191,612\nAcquisition-related expense and transaction bonus\n885\n1,047\n21,279\nPublisher bonuses\n2\n—\n—\n209,635\nMoPub acquisition transition services\n3\n—\n—\n6,999\nRestructuring costs\n22,823\n2,316\n10,834\nAdjusted EBITDA\n$\n2,719,605\n$\n1,502,658\n$\n1,063,210\nNet income (loss) margin\n33.5%\n10.9%\n(6.8)%\nAdjusted EBITDA margin\n57.8%\n45.8%\n37.7%\n1 \nExcludes recurring operational foreign exchange gains and losses.\n2 \nIn association with the MoPub acquisition, we incurred certain costs to incentivize publishers to migrate to our MAX mediation solution, including existing publishers of MoPub as well as publishers on other competitor offerings. We have not historically incurred significant publisher migration costs, nor do we currently intend to incur significant publisher migration costs in the future. As such, we have removed the impact of these costs from Adjusted EBITDA.\n3\n \nReflects one-time transition services provided by Twitter to AppLovin.\nFree Cash Flow\nWe define Free Cash Flow as net cash provided by operating activities less purchases of property and equipment and principal payment of finance leases. We use Free Cash Flow to help manage the health of our business, prepare budgets and for capital allocation purposes. We believe Free Cash Flow provides useful supplemental information to help investors understand underlying trends in our business and our liquidity. Free cash flow has certain limitations, including that it does not reflect our future contractual commitments. Our definition may differ from the definitions used by other companies and therefore comparability may be limited. In addition, other companies may not publish Free Cash Flow or similar metrics. Thus, our Free Cash Flow should be considered in addition to, not as a substitute for, or in isolation from, measures prepared in accordance with GAAP.\nThe following table provides our Free Cash Flow for 2024, 2023, and 2022, and a reconciliation of net cash provided by operating activities to Free Cash Flow:\nYear Ended December 31,\n2024\n2023\n2022\n(in thousands)\nNet cash provided by operating activities\n$\n2,099,011 \n$\n1,061,510 \n$\n412,773 \nLess:\nPurchase of property and equipment\n(4,776)\n(4,246)\n(662)\nPrincipal payments of finance leases\n(20,875)\n(20,170)\n(24,083)\nFree Cash Flow\n$\n2,073,360 \n$\n1,037,094 \n$\n388,028 \nNet cash used in investing activities\n$\n(106,754)\n$\n(77,829)\n$\n(1,371,468)\nNet cash used in financing activities\n$\n(1,749,844)\n$\n(1,562,791)\n$\n(526,848)\nFactors Affecting Our Performance\nWe believe that the future success of our business depends on many factors, including the factors described below. While each of these factors presents significant opportunities for our business, they also pose important challenges that we must successfully address in order to continue to grow profitably while maintaining strong cash flow.\n46\nTable\n of \nContents\nContinue to invest in innovation\nWe have made, and intend to continue to make, significant investments in our Advertising solutions to enhance their effectiveness and value proposition for our clients. We expect that these investments will require spending on research and development, and acquisitions and partnerships related to technology components and products. We believe investments in our technology, including our AI-powered advertising engine AXON, AppDiscovery, Adjust, and MAX, will further improve effectiveness for advertisers. In addition, we plan to continue to invest in the AI-based, self-learning capabilities of our advertising recommendation engine, AXON. Our investments will also allow us to enter into and expand into new verticals outside of gaming, such as e-commerce, CTV, original equipment manufacturer (\"OEM\"), and carrier-related markets. While our investments in research and development and acquisitions and partnerships may not result in revenue in the near term, we believe these investments position us to increase our revenue over time.\nRetain and grow existing clients\nWe rely on existing clients for a significant portion of our revenue. As we improve our Advertising solutions and Apps, we can attract additional spend from these clients. Our clients include indie studio developers and some of the largest advertising platforms in the world. We believe there is significant room for us to further expand our relationships with these clients and increase their usage of our Advertising solutions. \nIn the past, our clients have generally increased their usage of our Advertising solutions and Apps, and as a result, growth from existing clients has been a primary driver of our revenue growth. We must continue to retain our existing clients and expand their spend with us over time to continue to grow our revenue, increase profitability and drive greater cash flow.\nAdd new clients globally\nOur future success depends in part on our ability to acquire new clients. In 2024, 43% of our revenue was generated from outside of the United States. We believe that the global opportunity is significant and will continue to expand as developers and advertisers outside the United States adopt our Advertising solutions and advertise on our Apps. We also see opportunities to acquire new clients outside of mobile gaming, as the capabilities of our Advertising solutions are relevant to the broader advertising ecosystem. We are investing in direct sales, product development, education, and other capabilities to drive increased awareness and adoption of our Advertising solutions and Apps, which investments may impact our profitability in the near term as we seek further scale. \nContinued execution of strategic partnerships\nWe continue to explore strategic partnership opportunities related to our Software Platform and the expansion of the markets it serves and we may from time to time evaluate strategic acquisitions and partnerships opportunistically. From the beginning of 2018 through 2024, we have invested approximately $4.1 billion in 33 strategic acquisitions and partnerships with mobile app developers and for technologies or relationships to enhance our Advertising solutions, including the acquisition of MAX in 2018, Adjust in April 2021, MoPub in January 2022, and Wurl in April 2022. We believe our future results of operations will be affected by our ability to continue to identify and execute such strategic transactions that are accretive to our growth and profitability. \nGrowth and structure of the mobile app and advertising ecosystems\nOur business and results of operations will be impacted by industry factors that drive the overall performance of the mobile app and advertising ecosystems. Mobile app developers, including AppLovin, rely on third-party platforms, such as the Apple App Store and Google Play Store, among others, to distribute games, collect payments made for IAPs, and target users with relevant advertising. We expect this to continue for the foreseeable future. These third-party platforms have significant market power and discretion to set platform fees, select which apps to promote, and decide how much consumer information to provide to advertising networks that enable our Advertising solutions to target users with personalized and relevant advertising and allocate marketing campaigns in an efficient and cost-effective manner. Any changes made in the policies of third-party platforms could drive rapid change across the mobile app and advertising ecosystems. For example, in April 2021, Apple started implementing its application tracking transparency framework that, among other things, requires users' opt-in consent for certain types of tracking. While this transparency framework has not had a significant impact on our overall business, it may do so in the future, including with respect to the effectiveness of our advertising practices and/or our ability to efficiently generate revenue for our Apps. We rely in part on Identifier for Advertisers (\"IDFA\") to provide us with data that helps our Advertising solutions better market and monetize Apps. In light of the IDFA and transparency changes, we made changes to our data collection practices. To the extent we are unable to utilize IDFA or a similar offering, or if the transparency changes and any related opt-in or other requirements result in decreases in the availability or utility of data relating to Apps, our Advertising solutions may not be as effective, we may not be able to continue to efficiently generate revenue for our Apps, and our revenue and results of operations may be harmed. Additionally, Apple implemented new requirements for consumer disclosures regarding privacy and data processing practices in December 2020, which has resulted in increased compliance requirements and could result in decreased usage of our Apps. Apple incorporated new SDK privacy controls into iOS 17, which was released in September 2023, including privacy manifests and signatures designed to allow app developers to outline the data practices for SDKs embedded in their apps, manage tracking domains within SDKs, and curb device fingerprinting by requiring app developers to select allowed reasons for using data received through certain APIs. In February 2022, Google announced its Privacy Sandbox initiative for Android, a multi-year effort expected to restrict tracking activity and limit advertisers' ability to collect app and user data across Android devices. In January 2024, Google commenced rolling out a Chrome feature, called Tracking Protection, which limits \n47\nTable\n of \nContents\ncross-site tracking. In May 2023, Google announced new consent management platform (\"CMP\") requirements for ads served in the European Economic Area (\"EEA\") and UK, which requires, as of January 2024, publishers using Google AdSense, Ad Manager, or AdMob to use a CMP that has been certified by Google and has integrated with the Interactive Advertising Bureau's (\"IAB\") Transparency and Consent Framework when serving ads to users in the EEA or the UK. While to date these third-party platform privacy changes have had some impact on the discoverability of apps across these platforms and have had a relatively muted aggregate impact on our results of operations, the ultimate impact of these or any similar or future changes to the policies of Apple or Google could adversely affect our business, financial condition, and results of operations. \nNew tools for developers, industry standards, and platforms may emerge in the future. We believe our focus on the advertising ecosystem has allowed us to understand the needs of our clients and our relentless innovation has enabled us to quickly adapt to changes in the industry and pioneer new solutions. We must continue to innovate and stay ahead of developments in the advertising and mobile app ecosystems in order for our business to succeed and our results of operations to continue to improve.\nComponents of Results of Operations\nRevenue\nWe generate Advertising Revenue primarily from fees collected from advertisers spending on AppDiscovery, typically on a performance basis, then shared with our advertising publishers, typically on a cost per impression basis. Advertising Revenue also includes fees generated based on a percentage of client spend through MAX and subscription fees for Adjust's measurement and analytics marketing platform.\n Revenue from other services under Advertising was not material. \nWe generate Apps Revenue from IAPs made by the users within our Apps and from IAA generated from advertisers that purchase advertising inventory from our diverse portfolio of Apps. IAA Revenue from our Apps was 32%, 31%, and 33% of total Apps Revenue in 2024, 2023, and 2022, respectively.\nCost of Revenue and Operating Expenses\nCost of revenue. \nCost of revenue consists primarily of payment processing fees related to IAP Revenue, amortization of acquired technology-related intangible assets, \namortization of \nfinance lease right-of-use assets related to certain servers and networking equipment\n and data center costs related primarily to third-party cloud computing services.\n The fees for IAPs are processed and collected by third-party distribution partners. We expect our cost of revenue to increase in absolute dollars over the long term as our business and revenue continue to grow. We also expect our cost of revenue as a percentage of revenue to fluctuate period-over-period.\nSales and marketing\n. Sales and marketing expenses consist primarily of user acquisition costs, marketing programs and other advertising expenses, professional services costs related to the marketing of apps by third parties, personnel-related expenses including salaries, employee benefits, and stock-based compensation for employees engaged in sales and marketing activities, amortization of acquired user-related intangible assets, travel and allocated facilities and information technology costs.\nWe plan to continue to invest in sales and marketing to grow our Advertising customer base and increase brand awareness. We expect sales and marketing expenses to fluctuate period-over-period as we launch new games. We also expect our sales and marketing expenses as a percentage of revenue to fluctuate period- over-period in the near term as we invest to grow our customer base and increase brand awareness, and to decrease over the long term as we benefit from greater scale.\nResearch and development. \nResearch and development expenses consist primarily of product development costs, including personnel-related expenses such as salaries, employee benefits, and stock-based compensation for employees engaged in research and development activities, professional services costs related to development of new apps by third parties, consulting costs, regulatory compliance costs, and allocated facilities and information technology costs.\nWe plan to continue to invest in research and development to continue to enhance our Advertising solutions and to improve existing games and develop new games. We expect our research and development expenses as a percentage of revenue to fluctuate period-over-period in the near term as we invest to enhance our Advertising solutions and improve our existing Apps and develop new Apps, and to decrease over the long term as we benefit from greater scale.\nGeneral and administrative. \nGeneral and administrative expenses consist primarily of costs incurred to support our business, including personnel-related expenses such as salaries, employee benefits, and stock-based compensation for employees engaged in finance, accounting, legal, human resources and administration, professional services fees for legal, accounting, recruiting, and administrative services (including acquisition-related expenses), insurance, travel, and allocated facilities and information technology costs.\nWe plan to continue to invest in our general and administrative function to support the growth of our business. We expect our general and administrative expenses as a percentage of revenue to fluctuate period-over-period in the near term as we invest to support the growth of our business, and to decrease over the long term as we benefit from greater scale.\nOther Income and Expenses\nInterest expense and loss on settlement of debt. \nInterest expense and loss on settlement of debt consists primarily of interest expense associated with our outstanding debt, including accretion of debt discount and issuance costs.\n48\nTable\n of \nContents\nOther income, net. \nOther income, net, primarily includes interest earned on our cash and cash equivalents, fair value adjustments relating to our non-marketable equity securities, and foreign currency gains and losses.\nProvision for (benefit from) income taxes. \nWe are subject to income taxes in the United States and foreign jurisdictions in which we do business. These foreign jurisdictions have different statutory tax rates than those in the United States. Additionally, certain of our foreign earnings may also be taxable in the United States. Accordingly, our effective tax rate will vary depending on the relative proportion of foreign to domestic income, impacts from acquisition restructuring, deduction benefits related to foreign-derived intangible income, future changes in the valuation of our deferred tax assets and liabilities, and changes in tax laws. Additionally, our effective tax rate can vary based on the amount of pre-tax income or loss.\nResults of Operations\nIn this section, we discuss the results of our operations for the year ended December 31, 2024 compared to the year ended December 31, 2023.\nThe following tables summarize our consolidated statement of operations:\nYear Ended December 31,\n2024\n2023\n2022\n(in thousands)\nRevenue\n$\n4,709,248 \n$\n3,283,087 \n$\n2,817,058 \nCosts and expenses\nCost of revenue\n1,2\n1,166,806 \n1,059,191 \n1,256,065 \nSales and marketing\n1,2\n849,209 \n830,718 \n919,550 \nResearch and development\n1\n638,689 \n592,386 \n507,607 \nGeneral and administrative\n1\n181,085 \n152,585 \n181,627 \nTotal costs and expenses\n2,835,789 \n2,634,880 \n2,864,849 \nIncome (loss) from operations\n1,873,459 \n648,207 \n(47,791)\nOther income (expense):\nInterest expense and loss on settlement of debt\n(318,260)\n(275,665)\n(171,863)\nOther income, net\n20,806 \n8,028 \n14,477 \nTotal other expense\n(297,454)\n(267,637)\n(157,386)\nIncome (loss) before income taxes\n1,576,005 \n380,570 \n(205,177)\nProvision for (benefit from) income taxes\n(3,771)\n23,859 \n(12,230)\nNet income (loss)\n$\n1,579,776 \n$\n356,711 \n$\n(192,947)\n_______\n1 \nIncludes stock-based compensation expense as follows:\nYear Ended December 31,\n2024\n2023\n2022\n(in thousands)\nCost of revenue\n$\n5,499 \n$\n5,229 \n$\n6,307 \nSales and marketing\n83,435 \n79,879 \n41,533 \nResearch and development\n239,902 \n230,806 \n94,319 \nGeneral and administrative\n47,619 \n47,193 \n49,453 \nTotal stock-based compensation\n$\n376,455 \n$\n363,107 \n$\n191,612 \n _______\n2\n Includes amortization expense related to acquired intangibles as follows:\nYear Ended December 31,\n2024\n2023\n2022\n(in thousands)\nCost of revenue\n$\n338,380 \n$\n382,956 \n$\n448,462 \nSales and marketing\n74,248 \n67,190 \n66,173 \nTotal amortization expense related to acquired intangibles\n$\n412,628 \n$\n450,146 \n$\n514,635 \n49\nTable\n of \nContents\nThe following table sets forth the components of our consolidated statements of operations for each of the periods presented as a percentage of revenue\n1\n:\nYear Ended December 31,\n2024\n2023\n2022\nRevenue\n100 \n%\n100 \n%\n100 \n%\nCosts and expenses:\nCost of revenue\n25 \n%\n32 \n%\n45 \n%\nSales and marketing\n18 \n%\n25 \n%\n33 \n%\nResearch and development\n14 \n%\n18 \n%\n18 \n%\nGeneral and administrative\n4 \n%\n5 \n%\n6 \n%\nTotal costs and expenses\n60 \n%\n80 \n%\n102 \n%\nIncome (loss) from operations\n40 \n%\n20 \n%\n(2)\n%\nOther income (expense):\nInterest expense and loss on settlement of debt\n(7)\n%\n(8)\n%\n(6)\n%\nOther income, net\n— \n%\n— \n%\n1 \n%\nTotal other expense\n(6)\n%\n(8)\n%\n(6)\n%\nIncome (loss) before income taxes\n33 \n%\n12 \n%\n(7)\n%\nProvision for (benefit from) income taxes\n— \n%\n1 \n%\n— \n%\nNet income (loss)\n34 \n%\n11 \n%\n(7)\n%\n_______\n1 \nTotals of percentages of revenue may not foot due to rounding.\nComparison of Our Results of Operations for the Twelve Months Ended December 31, 2024, 2023, and 2022\nRevenue\nYear Ended December 31,\n2023 to 2024\n% change\n2022 to 2023\n% change\n2024\n2023\n2022\n(in thousands, except percentages)\nAdvertising Revenue\n$\n3,224,058 \n$\n1,841,762 \n$\n1,049,167 \n75 \n%\n76 \n%\nIn-App Purchases Revenue\n1,002,656 \n989,007 \n1,179,133 \n1 \n%\n(16)\n%\nIn-App Advertising Revenue\n482,534 \n452,318 \n588,758 \n7 \n%\n(23)\n%\nTotal Apps Revenue\n1,485,190 \n1,441,325 \n1,767,891 \n3 \n%\n(18)\n%\nTotal Revenue\n$\n4,709,248 \n$\n3,283,087 \n$\n2,817,058 \n43 \n%\n17 \n%\nFor the twelve months ended December 31, 2024, our Advertising Revenue increased by $1.4 billion, or 75%, from the prior year period primarily due to improved AppDiscovery performance, where the volume of installations increased 50% and net revenue per installation increased 22% compared to the prior year period. We do not recognize Advertising Revenue from transactions with our studios. \nFor the twelve months ended December 31, 2024, our Apps Revenue increased by $43.9 million, or 3%, from the prior year period. Our IAA Revenue from Apps increased by $30.2 million, or 7%, compared to the prior year period, due to a 34% increase in the volume of advertising impressions, partially offset by a 20% decrease in price per advertising impression. We do not recognize IAA Revenue from transactions with our studios. For the twelve months ended December 31, 2024, our IAP Revenue from Apps increased by $13.6 million, or 1%, from the prior year period, primarily due to a 3% increase in price per in-app purchase, partially offset by a 2% decrease in the volume of in-app purchases. We do not recognize IAA Revenue from transactions with our studios.\nFor the twelve months ended December 31, 2023, our Advertising Revenue increased by $792.6 million, or 76%, from the prior year period primarily due to publisher bonuses of $209.6 million accounted for as a reduction to revenue in the prior year period. The increase in Advertising Revenue was also due to improved AppDiscovery performance, where installations increased 17% and net revenue per installation increased 35% compared to the prior year period. We do not recognize Advertising Revenue from transactions with our studios.\nFor the twelve months ended December 31, 2023, our Apps Revenue decreased by $326.6 million, or 18%, from the prior year period. For the twelve months ended December 31, 2023, our IAP Revenue from Apps decreased by $190.1 million, or 16%, from the prior year period, primarily due to a 12% decrease in the volume of IAPs and a 5% decrease in price per IAP. Our IAA Revenue from Apps decreased by $136.4 million, or 23%, compared to the prior year period, due to a 45% decrease in price per advertising impression, partially offset by a 39% increase in the volume of advertising impressions. We do not recognize IAA Revenue from transactions with our studios.\n50\nTable\n of \nContents\nCost of revenue\nYear Ended December 31,\n2023 to 2024\n% change\n2022 to 2023\n% change\n2024\n2023\n2022\n(in thousands, except percentages)\nCost of revenue\n$\n1,166,806 \n$\n1,059,191 \n$\n1,256,065 \n10 \n%\n(16)\n%\nPercentage of revenue\n25 \n%\n32 \n%\n45 \n%\nCost of revenue in 2024 increased by $107.6 million, or 10%, compared to 2023. The increase in 2024 was primarily due to an increase in expenses associated with operating our network infrastructure driven by the growth in our Advertising operations of $141.4 million, partially offset by a decrease of $44.5 million in amortization and impairment of intangible assets resulting from the end of the useful life of certain intangible assets.\nCost of revenue in 2023 decreased by $196.9 million, or 16%, compared to 2022. The decrease in 2023 was primarily due to a decrease of $192.3 million in amortization and impairment of intangible assets resulting from the sale of certain assets within our Apps segment during the second half of 2022 and a decrease of $50.0 million in third-party payment processing fees as a result of the decline in IAP revenue, offset by an increase in expenses associated with operating our network infrastructure driven by the growth in our Software Platform operations of $42.7 million.\nSales and marketing\nYear Ended December 31,\n2023 to 2024\n% change\n2022 to 2023\n% change\n2024\n2023\n2022\n(in thousands, except percentages)\nSales and marketing\n$\n849,209 \n$\n830,718 \n$\n919,550 \n2 \n%\n(10)\n%\nPercentage of revenue\n18 \n%\n25 \n%\n33 \n%\nSales and marketing expenses in 2024 increased by $18.5 million, or 2%, compared to 2023 due primarily to an increase of $10.3 million in depreciation and amortization driven by write-offs of certain intangible assets, an increase of $9.4 million increase in personnel-related expenses primarily related to an increase in stock-based compensation related payroll costs and an increase of $9.6 million in professional services costs associated with the marketing of apps by third parties. This was partially offset by a decrease of $17.9 million in user acquisition costs.\nSales and marketing expenses in 2023 decreased by $88.8 million, or 10%, compared to 2022 primarily due to a $126.5 million decrease in user acquisition costs and a $12.3 million decrease in professional services costs associated with the strategic review and optimization of our Apps segment, offset by a $47.5 million increase in personnel-related expense primarily due to an increase in stock-based compensation.\nResearch and development\nYear Ended December 31,\n2023 to 2024\n% change\n2022 to 2023\n% change\n2024\n2023\n2022\n(in thousands, except percentages)\nResearch and development\n$\n638,689 \n$\n592,386 \n$\n507,607 \n8 \n%\n17 \n%\nPercentage of revenue\n14 \n%\n18 \n%\n18 \n%\nResearch and development expenses in 2024 increased by $46.3 million, or 8%, compared to 2023. The increase was primarily due to an increase of $44.9 million in personnel-related expenses related to an increase in stock-based compensation related payroll costs.\nResearch and development expenses in 2023 increased by $84.8 million, or 17%, compared to 2022. The increase was primarily due to an increase of $145.5 million in personnel-related expenses related to an increase in stock-based compensation expense as a result of an increase in headcount, offset by a decrease of $67.1 million in professional services costs due to the optimization and sale of certain assets within our Apps segment.\nGeneral and administrative\nYear Ended December 31,\n2023 to 2024\n% change\n2022 to 2023\n% change\n2024\n2023\n2022\n(in thousands, except percentages)\nGeneral and administrative\n$\n181,085 \n$\n152,585 \n$\n181,627 \n19 \n%\n(16)\n%\nPercentage of revenue\n4 \n%\n5 \n%\n6 \n%\nGeneral and administrative expenses in 2024 increased by $28.5 million, or 19% compared to 2023. The increase was primarily due to $12.7 million in personnel-related expenses related to an increase in stock-based compensation related payroll costs and an increase of $11.7 million in legal-related costs.\n51\nTable\n of \nContents\nGeneral and administrative expenses in 2023 decreased by $29.0 million, or 16% compared to 2022. The decrease was primarily due to $12.7 million in acquisition-related costs in 2022 and a decrease of $6.7 million in professional services costs primarily associated with acquisition support.\nInterest expense and loss on settlement of debt\nYear Ended December 31,\n2023 to 2024\n% change\n2022 to 2023\n% change\n2024\n2023\n2022\n(in thousands, except percentages)\nInterest expense and loss on settlement of debt\n$\n(318,260)\n$\n(275,665)\n$\n(171,863)\n15 \n%\n60 \n%\nPercentage of revenue\n(7)\n%\n(8)\n%\n(6)\n%\nIn 2024, interest expense and loss on settlement of debt increased by $42.6 million, or 15%, compared to 2023. This increase was due to loss on extinguishment of debt of $28.4 million in the current period. In addition, the prior year period includes a net gain of $15.8 million related to interest rate swaps.\nIn 2023, interest expense and loss on settlement of debt increased by $103.8 million, or 60%, compared to 2022. This increase was primary driven by $99.5 million due to an increase in interest rate and $4.3 million in loss on settlement of debt resulting from a debt refinancing transaction during the period.\nOther income, net\nYear Ended December 31,\n2023 to 2024\n% change\n2022 to 2023\n% change\n2024\n2023\n2022\n(in thousands, except percentages)\nOther income, net\n$\n20,806 \n$\n8,028 \n$\n14,477 \n159 \n%\n(45)\n%\nPercentage of revenue\n— \n%\n— \n%\n1 \n%\nIn 2024, other income, net increased by $12.8 million compared to 2023. The increase was primarily due to the loss on fair value remeasurement of $20.7 million from the impairment of non-marketable equity securities in the prior year period, partially offset by a decrease in interest income of $10.2 million due to a reduction in average cash balances held during the period. \nIn 2023, other income, net decreased by $6.4 million compared to 2022. The decrease was primarily due to the loss on fair value remeasurement of $20.7 million from the impairment of non-marketable equity securities and an expense resulting from a debt refinancing transaction of $11.0 million, offset by an increase in interest income of $23.2 million and an increase in net foreign currency gains and losses of $4.4 million.\nProvision for (benefit from) Income Taxes\nYear Ended December 31,\n2023 to 2024\n% change\n2022 to 2023\n% change\n2024\n2023\n2022\n(in thousands, except percentages)\nProvision for (benefit from) income taxes\n$\n(3,771)\n$\n23,859 \n$\n(12,230)\n(116)\n%\n(295)\n%\nPercentage of revenue\n— \n%\n1 \n%\n— \n%\nIn 2024, tax provision for income taxes decreased by $27.6 million, or 116%, compared to 2023. The decrease in tax provision was primarily driven by an increase of $172.9 million of stock-based compensation benefit, a benefit of $123.2 million due to foreign income taxed at a different rate, an increase of $31.5 million in the research and development credit, offset by an increase of $251.0 million due to higher pre-tax book income of $1.6 billion in 2024 as compared to pre-tax book income of $380.6 million in 2023, and an increase of $34.7 million related to increase in Global Intangible Low-Taxed Income.\nIn 2023, tax provision for income taxes increased by $36.1 million, or 295%, compared to 2022. The increase in tax provision was primarily driven by an increase of $119.0 million due to the tax impact on the pre-tax income of $380.6 million in 2023 as compared to pre-tax loss of $205.2 million in 2022, offset by $65.7 million related to foreign rate differential and income inclusion, an increase of $16.5 million related to increase in Global Intangible Low-Taxed Income offset by an increase in foreign tax credit, an increase of $25.9 million of stock-based compensation benefit, and an increase of $13.3 million in the research and development credit.\n52\nTable\n of \nContents\nComparison of our Segment Results of Operations\nThe following table presents the results for our Advertising and Apps segment adjusted EBITDA for the periods indicated: \nYear Ended December 31,\n2023 to 2024\n% change\n2022 to 2023\n% change\n2024\n2023\n2022\n(in thousands, except percentages)\nAdvertising Adjusted EBITDA\n$\n2,442,597 \n$\n1,275,705 \n$\n808,415 \n91 \n%\n58 \n%\nApps Adjusted EBITDA\n$\n277,008 \n$\n226,953 \n$\n254,795 \n22 \n%\n(11)\n%\nTwelve Months Ended December 31, 2024 Compared to Twelve Months Ended December 31, 2023\nThe $1.2 billion, or 91%, increase in Advertising Adjusted EBITDA for 2024 was primarily driven by an increase in Advertising Revenue of $1.4 billion, partially offset by an increase of $141.3 million in expenses associated with our network infrastructure and an increase of $33.3 million in personnel-related expenses.\nThe $50.1 million, or 22%,\n \nincrease\n \nin Apps Adjusted EBITDA for 2024 was primarily driven by an increase in Apps Revenue of $43.9 million, a $17.9 million decrease in user acquisition costs, and a $7.7 million decrease in third-party payment processing fees paid associated with IAPs, partially offset by an $18.2 million increase in professional services costs related to marketing, development and maintenance of apps by third parties.\nTwelve Months Ended December 31, 2023 Compared to Twelve Months Ended December 31, 2022\nThe $467.3 million, or 58%, increase in Advertising Adjusted EBITDA for 2023 was primarily driven by an increase in Advertising Revenue of $792.6 million, partially offset by an increase of $49.5 million in expenses associated with our network infrastructure and an increase of $46.6 million in personnel-related expenses related to an increase in stock-based compensation expense as a result of an increase in headcount. In addition, Advertising Adjusted EBITDA for 2022 has been adjusted to exclude one-time publisher bonuses of $209.6 million for the year ended December 31, 2022.\nThe $27.8 million, or 11%,\n \ndecrease\n \nin Apps Adjusted EBITDA for 2023 was primarily driven by a decrease in Apps Revenue of $326.6 million, offset by a $126.7 million decrease in user acquisition costs, an $84.1 million decrease in professional services costs related to marketing, development and maintenance of apps by third parties, a $50.0 million decrease in third-party payment processing fees paid associated with IAPs, and a $15.9 million decrease in personnel-related expenses.\nLiquidity and Capital Resources\nAs of December 31, 2024, we had cash and cash equivalents of $741.4 million, consisting primarily of cash on deposit with banks and short-term liquid investments in money market deposit accounts. \nWe\n believe that our existing cash and cash equivalents, cash flows expected to be generated by our operations, and, if necessary, our borrowing capacity under our 2024 Credit Agreement that provides for $1.0 billion of unsecured revolving credit facility, would be sufficient to satisfy our anticipated working capital and capital expenditures needs for at least the next 12 months. Our future capital requirements will depend on many factors, including our revenue growth rate; sales and marketing activities; timing and extent of spending to support our research and development efforts; capital expenditures to purchase hardware and software; our continued need to invest in our IT infrastructure to support our growth; and the volume and timing of our stock repurchases. In addition, we may enter into additional strategic partnerships as well as agreements to acquire or invest in teams and technologies, including intellectual property rights, which could increase our cash requirements. As a result of these and other factors, we may be required to seek additional equity or debt financing sooner than we currently anticipate. See the section titled “Risk Factors—Risks Related to Financial and Accounting Matters” for more information regarding risks related to liquidity and capital resources. \nThe following table summarizes our cash flows for the periods indicated:\nYear Ended December 31,\n2024\n2023\n2022\n(in thousands)\nNet cash provided by operating activities\n$\n2,099,011 \n$\n1,061,510 \n$\n412,773 \nNet cash used in investing activities\n$\n(106,754)\n$\n(77,829)\n$\n(1,371,468)\nNet cash used in financing activities\n$\n(1,749,844)\n$\n(1,562,791)\n$\n(526,848)\nOperating Activities\nNet cash provided by operating activities was $2.1 billion for 2024, primarily consisting of $1.6 billion of net income, adjusted for certain non-cash items, such as $448.7 million of amortization, depreciation and write-offs, $369.4 million of stock-based compensation expense, $28.4 million of loss on settlement of debt, $12.7 million of change in operating right of use asset, partially offset by a net decrease in the operating assets and liabilities of $349.5 million.\nNet cash provided by operating activities was $1.1 billion for 2023, primarily consisting of $356.7 million of net income, adjusted for certain non-cash items, such as $489.0 million of amortization, depreciation and write-offs, $363.1 million of stock-\n53\nTable\n of \nContents\nbased compensation expense, $28.0 million of impairment of non-marketable equity securities, $17.8 million of change in operating right of use asset, and $9.4 million of amortization of debt issuance costs and discount partially offset by a net increase in the operating assets and liabilities of $208.7 million.\nThe improvement in cash flows from operating activities during 2024 compared to 2023 was primarily due to an increase in cash collection from our customers driven by the increase in revenue, partially offset by higher cash operating expenses, primarily related to data center and payroll related costs, as well as higher interest payments due to an increase of debt.\nInvesting Activities\nNet cash used in investing activities was $106.8 million for 2024, primarily consisting of $77.0 million in purchases of non-marketable investments and $25.6 million related to contingent considerations for prior acquisitions and capitalized software development costs.\nNet cash used in investing activities was $77.8 million for 2023, primarily consisting of $63.9 million related to contingent considerations for prior acquisitions and capitalized software development costs, and $17.9 million in purchases of non-marketable investments.\nFinancing Activities\nNet cash used in financing activities was $1.7 billion for 2024, primarily consisting of $4.2 billion of principal repayments of debt, $1.1 billion of payments for withholding taxes related to net share settlement of equity awards, and $981.3 million of stock repurchases, partially offset by $4.6 billion of proceeds from issuance of debt.\nNet cash used in financing activities was $1.6 billion for 2023, primarily consisting of $1.2 billion of stock repurchases, $498.0 million of principal repayments of debt, and $246.4 million of payments for withholding taxes related to net share settlement of equity awards, partially offset by $395.3 million of proceeds from issuance of debt.\nCredit Agreement\nIn December 2024, we entered into an unsecured credit agreement (the \"2024 Credit Agreement\"), which provided for a $1.0 billion unsecured revolving credit facility maturing on December 5, 2029, with the option for two one-year extensions as permitted under the agreement. The 2024 Credit Agreement replaced the existing credit agreement, originally entered into in August 2018 and subsequently amended multiple times. As of December 31, 2024, no amounts had been borrowed under the 2024 Credit Agreement. For additional information on the 2024 Credit Agreement, see Note 9 to our consolidated financial statements included elsewhere in this Annual Report on Form 10-K.\nLong-term Debt\nAs of December 2024, we had outstanding long-term debt in the form of senior unsecured notes for an aggregate principal amount of $3.6 billion. These notes were issued in multiple series, which mature from 2029 to 2035 and bear fixed annual interest rates ranging from 5.125% to 5.950%, with interest payments due semi-annually in arrears on June 1 and December 1 of each year, beginning on June 1, 2025. For additional information, see Note 9 to our consolidated financial statements included elsewhere in this Annual Report on Form 10-K.\nStock Repurchase Program\nDuring 2024, our board of directors authorized increases to our stock repurchase program of an aggregate amount of $3.3 billion, which additional amount may be repurchased from time to time subject to a limitation in any fiscal quarter of the amount of our Free Cash Flow in the preceding fiscal quarter and compliance with applicable law and any contractual restrictions. As of December 31, 2024, $2.3 billion remained available and authorized for repurchases under our stock repurchase program. For additional information on the stock repurchase program, see Note 10 to our consolidated financial statements included elsewhere in this Annual Report on Form 10-K.\nContractual Obligations\nAs of December 31, 2024, we had non-cancellable purchase obligations primarily related to an agreement for third-party cloud computing services of $1.2 billion, with $438.9 million payable within twelve months. For additional information, see Note 5 to our consolidated financial statements included elsewhere in this Annual Report on Form 10-K.\nAs of December 31, 2024, we had non-cancelable payments related to leases of servers and networking equipment of $184.1 million, with $30.5 million payable within twelve months. For additional information, see Note 8 to our consolidated financial statements included elsewhere in this Annual Report on Form 10-K.\nAs of December 31, 2024, we had non-cancellable payments related to leases of office facilities of $51.4 million, with $16.8 million payable within twelve months. For additional information, see Note 8 to our consolidated financial statements included elsewhere in this Annual Report on Form 10-K.\nAs of December 31, 2024, we had unfunded commitments of $21.5 million related to investments in certain private equity funds, which may be called from time to time by the funds. For additional information, see Note 3 to our consolidated financial statements included elsewhere in this Annual Report on Form 10-K.\n54\nTable\n of \nContents\nAs of December 31, 2024, we had a non-cancelable payment related to a third-party intellectual property license of $12.8 million, which was paid in January 2025.\nAs of December 31, 2024, we had certain contingent consideration arrangements related to our prior acquisitions, with payouts contingent on the profit or revenue generated by the relevant Apps. We do not expect these payouts to have a material impact on our cash flows.\nTaxes\nAs of December 31, 2024, we had recorded liabilities of $60.9 million related to uncertain tax positions. Due to uncertainties in the timing of potential tax audits, the timing of the resolution of these positions is uncertain and we are unable to make a reasonable estimate of the timing of payments in individual years particularly beyond 12 months. \nCritical Accounting Estimates\nOur consolidated financial statements are prepared in accordance with GAAP. The preparation of our consolidated financial statements requires us to make estimates and assumptions that affect the reported amounts of assets, liabilities revenue, expenses and related disclosures. On an ongoing basis, we evaluate our estimates based on assumptions that are believed to be reasonable under the circumstances. These estimates are inherently subject to judgment and actual results could differ materially from those estimates. \nAn accounting estimate is considered critical if it involves significant subjectivity and judgment, and if changes in the estimate have had or are reasonably likely to have a material effect on our consolidated financial statements. We believe the following estimates are subject to a greater degree of judgment and complexity and have the greatest potential impact on our consolidated financial statements. For additional information on all of our significant accounting policies, see Note 2 to our consolidated financial statements included elsewhere in this Annual Report on Form 10-K.\nGoodwill and Intangible Assets\nWe assess goodwill for impairment at the reporting unit level annually during the fourth quarter, or more frequently if events or changes in circumstances indicate potential impairment. Similarly, we evaluate intangible assets for impairment at the asset group level whenever indications suggest that their carrying amounts may not be recoverable. These impairment assessments involve both qualitative and quantitative evaluations.\nThe qualitative evaluation considers factors such as financial performance, macroeconomic conditions, industry trends, and other relevant events that may impact an reporting unit or asset group. If qualitative assessments suggest a potential impairment, we proceed with a quantitative assessment, which involves significant estimates and assumptions including projected future cash flows, risk-adjusted discount rates, economic and market conditions, and appropriate market comparables, among others. Additionally, we apply judgment and assumptions in allocating shared assets and liabilities to determine the carrying values of each reporting unit or asset group. Furthermore, we review and reassess the estimated remaining useful lives of intangible assets if significant events or changes in circumstances indicate a need to revise the remaining amortization periods.\nStock-Based Compensation\nWe measure and recognize stock-based compensation expense for share-based awards, primarily including restricted stock units (\"RSUs\"), performance-based RSUs with both service and market-based conditions, stock options and stock purchase rights granted under the Employee Stock Purchase Plan, based on the grant-date fair value of the awards. To estimate the grant-date fair value, we may use different valuation models such as the Black-Scholes option valuation model or the Monte Carlo valuation model that require various assumptions including, among others, the expected stock price volatility, the risk-free interest rate, the expected dividend yield, the discount for awards subject to post-vesting restrictions.\nIncome Taxes\nWe account for income taxes under the asset and liability method, which requires the recognition of deferred tax assets and liabilities for the expected future tax consequences of events that have been included in the financial statements. Under this method, we determine deferred tax assets and liabilities on the basis of the differences between the financial statement and tax bases of assets and liabilities by using enacted tax rates in effect for the year in which the differences are expected to reverse. The effect of a change in tax rates on deferred tax assets and liabilities is recognized in income in the period that includes the enactment date.\nWe recognize deferred tax assets to the extent that these assets are more likely than not to be realized. In making such a determination, we consider all available positive and negative evidence, including future reversals of existing taxable temporary differences, projected future taxable income, tax-planning strategies, and results of recent operations. If we determine that we would be able to realize deferred tax assets in the future in excess of their net recorded amount, an adjustment to the deferred tax asset valuation allowance would be made to reduce the provision for income taxes.\nWe record uncertain tax positions on the basis of a two-step process in which determinations are made (i) whether it is more likely than not that the tax positions will be sustained on the basis of the technical merits of the position and (ii) for those tax positions that meet the more-likely-than-not recognition threshold, we recognize the largest amount of tax benefit that is more than 50% likely to be realized upon ultimate settlement with a tax authority.\n55\nTable\n of \nContents\nWe recognize interest and penalties related to unrecognized tax benefits in the income tax expense line in our consolidated statement of operations. Accrued interest and penalties are included in the other non-current liabilities line in the consolidated balance sheet.\nRecent Accounting Pronouncements\nSee Note 2 to our consolidated financial statements included elsewhere in this Annual Report on Form 10-K for recently adopted accounting pronouncements and recently issued accounting pronouncements not yet adopted as of the dates of the statement of financial position included in this Annual Report on 10-K.",
  "item2": null
}