{
  "source_file": "app-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "ITEM 2. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe following discussion and analysis of our financial condition and results of operations should be read in conjunction with our condensed consolidated financial statements and the related notes included elsewhere in this Quarterly Report on Form 10-Q and in our Annual Report on Form 10-K. This discussion contains forward-looking statements that involve risks and uncertainties. Factors that could cause or contribute to such differences include those identified below and those discussed in the section titled “Risk Factors” and other parts of this Quarterly Report on Form 10-Q. Our historical results are not necessarily indicative of the results that may be expected for any period in the future.\nOverview\nOur mission is to create meaningful connections between companies and their ideal customers. We provide end-to-end software and AI-powered solutions for businesses to reach, monetize and grow their global audience. Our scaled business model is intricately linked to the advertising ecosystem, providing a durable competitive advantage. We generate revenue when our advertisers achieve their return on ad spend targets with our advertising solutions, ensuring that their success directly fuels our growth.\nSince our founding in 2011, we have been focused on building advertising solutions for advertisers to improve the marketing and monetization of their content. Our founders, who were mobile app developers themselves, quickly realized the real impediment to success and growth in the advertising ecosystem was a discovery and monetization problem—breaking through the congested app stores to efficiently find users and successfully grow their business. Their first-hand experience with these challenges led to the development of our infrastructure and advertising solutions.\nFor the three months ended September 30, 2025, our revenue increased 68% year-over-year to $1.4 billion, from $835.2 million in the three months ended September 30, 2024. We generated net income from continuing operations of $835.5 million and $433.1 million for the three months ended September 30, 2025 and 2024, respectively, and net income of $835.5 million and $434.4 million for the three months ended September 30, 2025 and 2024, respectively. We generated Adjusted EBITDA of $1.2 billion and $647.0 million for the three months ended September 30, 2025 and 2024, respectively. Additionally, our net cash provided by operating activities was $2.7 billion and $1.4 billion in the nine months ended September 30, 2025 and 2024, respectively. We generated Free Cash Flow of $2.6 billion and $1.4 billion for the nine months ended September 30, 2025 and 2024, respectively. Cash flows and Free Cash Flow include the cash flows from continuing and discontinued operations. Given our strong financial position, we have been able to reinvest in our expansion and growth, and repurchase and withhold shares of our Class A common stock. See the section titled “Non-GAAP Financial Measures” for a definition of Adjusted EBITDA and a reconciliation of Adjusted EBITDA to net income, the most directly comparable financial measure calculated in accordance with GAAP.\nRecent Developments\nOn May 7, 2025, we, along with our subsidiaries Morocco, Inc. and AppLovin GmbH (collectively, the “Sellers”) entered into a Purchase Agreement (the “Agreement”) with Tripledot and its subsidiaries Eton Games Inc. (\"Eton\") and Tripledot Group Holdings Limited (collectively, with Tripledot, the “Purchasers”) relating to the sale of our Apps Business. On June 30, 2025, we and Tripledot entered into an amendment to the Agreement to provide, among other things, that in lieu of the issuance of a secured promissory note by Eton to us or our designated affiliate at the closing of the transactions contemplated by the Agreement (the “Closing”) to fund a portion of the full Cash Consideration (as defined in the Agreement), Tripledot may elect to pay such amount in cash.\nOn June 30, 2025, we completed the Closing and sold our Apps Business to Tripledot for $400 million in cash, subject to closing adjustments, and equity consideration representing approximately 20% of Tripledot’s fully-diluted equity at the time of closing. No promissory note was issued as part of the transaction. Following the Closing, we operate as a single operating and reportable segment. Results related to our Apps Business are presented as discontinued operations in our condensed consolidated financial statements. See Note 1 – Description of Business and Summary of Significant Accounting Policies and Note 2 – Discontinued Operations of the Notes to condensed consolidated financial statements in Part I, Item 1 of this Quarterly Report on Form 10-Q. \nOur Business Model\nWe primarily generate revenue from fees paid by advertisers who use our advertising solutions to grow and monetize their content. We are able to grow our revenue by improving our various technologies.\n21\nTable of Contents\nAdvertising clients include a wide variety of advertisers, from indie developer studios to some of the largest global internet platforms, such as Facebook and Google. We see multiple opportunities to gain new clients, and to increase spend from existing clients, as we help them grow their businesses and make them more successful. \nOur advertising solutions include Axon Advertising, MAX, Adjust, and Wurl. Clients use Axon Advertising to automate, optimize, and manage their user acquisition investments. They set marketing and user growth goals, and Axon Advertising optimizes their ad spend in an effort to achieve their return on advertising spend targets and other marketing objectives. Axon Advertising comprises the vast majority of revenue. Revenue is generated from our advertisers, typically on a performance basis, and shared with our advertising publishers, typically on a cost per impression model.\nAdvertising clients use MAX to optimize purchases of app advertising inventory. The MAX tool provides insights to manage against key performance indicators, understand the long-term value of users, and help manage profitability. Revenue from MAX is generated based on a percentage of client spend. As more advertising networks move to in-app real-time bidding, we expect growth in the adoption of, and revenue from, MAX.\nAdvertising clients use Adjust's measurement and analytics marketing platform to better understand their users' journey while allowing marketers to make smarter decisions through measurement, attribution and fraud prevention. Revenue from Adjust is primarily generated from an annual software subscription fee.\nAdvertising clients use Wurl's connected TV (\"CTV\") platform to distribute streaming video, maximize revenue, and acquire and retain viewers or subscribers. Revenue from Wurl is primarily generated from content companies, streamers, and advertisers, typically on a usage-based and/or CPM model.\nNon-GAAP Financial Measures\nAdjusted EBITDA and Adjusted EBITDA Margin\nWe define Adjusted EBITDA for a particular period as net income adjusted for loss (income) from discontinued operations, net of income taxes, interest expense, other (income) expense, net (excluding certain recurring items), provision for income taxes, amortization, depreciation and write-offs and as further adjusted for stock-based compensation, transaction-related expense, restructuring costs, and non-operating foreign exchange gain, as well as certain other items that we believe are not reflective of our core operating performance. We define Adjusted EBITDA margin as Adjusted EBITDA divided by revenue for the same period.\nAdjusted EBITDA and Adjusted EBITDA margin are key measures we use to assess our financial performance and are also used for internal planning and forecasting purposes. We believe Adjusted EBITDA and Adjusted EBITDA margin are helpful to investors, analysts, and other interested parties because they can assist in providing a more consistent and comparable overview of our operations across our historical financial periods. In addition, these measures are frequently used by analysts, investors, and other interested parties to evaluate and assess performance. We use Adjusted EBITDA and Adjusted EBITDA margin in conjunction with GAAP measures as part of our overall assessment of our performance, including the preparation of our annual operating budget and quarterly forecasts, to evaluate the effectiveness of our business strategies, and to communicate with our board of directors concerning our financial performance.\nAdjusted EBITDA and Adjusted EBITDA margin are non-GAAP financial measures and are presented for supplemental informational purposes only and should not be considered as alternatives or substitutes to financial information presented in accordance with GAAP. These measures have certain limitations in that they do not include the impact of certain expenses that are reflected in our consolidated statement of operations that are necessary to run our business. Our definitions may differ from the definitions used by other companies and therefore comparability may be limited. In addition, other companies may not publish these or similar metrics. Thus, our Adjusted EBITDA and Adjusted EBITDA margin should be considered in addition to, not as substitutes for, or in isolation from, measures prepared in accordance with GAAP.\n22\nTable of Contents\nThe following table provides our Adjusted EBITDA and Adjusted EBITDA margin for the three and nine months ended September 30, 2025 and 2024, and a reconciliation of net income to Adjusted EBITDA:\nThree Months Ended September 30,\nNine Months Ended September 30,\n2025\n2024\n2025\n2024\n(in thousands, except percentages)\nRevenue\n$\n1,405,045\n$\n835,186\n$\n3,822,773\n$\n2,224,571\nNet income\n835,545\n434,420\n2,231,495\n980,572\nNet margin\n59.5%\n52.0%\n58.4%\n44.1%\nLoss (income) from discontinued operations, net of income taxes\n—\n(1,347)\n99,444\n12,840\nNet income from continuing operations\n835,545\n433,073\n2,330,939\n993,412\nNet margin from continuing operations\n59.5%\n51.9%\n61.0%\n44.7%\nAdjusted as follows:\nInterest expense\n51,429\n74,937\n155,726\n223,280\nOther (income) expense, net\n1\n9,079\n(3,778)\n13,233\n(15,555)\nProvision for income taxes\n185,401\n34,656\n368,617\n83,803\nAmortization, depreciation and write-offs\n34,978\n32,369\n97,988\n94,528\nNon-operating foreign exchange gain\n(570)\n(2,479)\n(2,100)\n(1,068)\nStock-based compensation\n33,767\n77,402\n127,434\n259,905\nTransaction-related expense\n6,565\n26\n16,245\n880\nRestructuring costs\n1,460\n811\n5,691\n2,747\nAdjusted EBITDA\n$\n1,157,654\n$\n647,017\n$\n3,113,773\n$\n1,641,932\nAdjusted EBITDA margin\n82.4%\n77.5%\n81.5%\n73.8%\n1 \nExcludes recurring operational foreign exchange gains and losses.\nFree Cash Flow\nWe define Free Cash Flow as net cash provided by operating activities less purchases of property and equipment and principal payment of finance leases. We use Free Cash Flow to help manage the health of our business, prepare budgets and for capital allocation purposes. We believe Free Cash Flow provides useful supplemental information to help investors understand underlying trends in our business and our liquidity. Free Cash Flow also reflects cash flows from both continuing and discontinued operations. Our definition may differ from the definitions used by other companies and therefore comparability may be limited. In addition, other companies may not publish Free Cash Flow or similar metrics. Thus, our Free Cash Flow should be considered in addition to, not as a substitute for, or in isolation from, measures prepared in accordance with GAAP.\nThe following table provides our Free Cash Flow for the nine months ended September 30, 2025 and 2024, and a reconciliation of net cash provided by operating activities to Free Cash Flow:\nNine Months Ended September 30,\n2025\n2024\n(in thousands)\nNet cash provided by operating activities\n$\n2,657,360 \n$\n1,398,008 \nLess:\nPurchase of property and equipment\n(285)\n(4,286)\nPrincipal payments of finance leases\n(14,282)\n(15,524)\nFree Cash Flow\n$\n2,642,793 \n$\n1,378,198 \nNet cash provided by (used in) investing activities\n$\n359,256 \n$\n(106,387)\nNet cash used in financing activities\n$\n(2,099,854)\n$\n(1,226,687)\nFactors Affecting Our Performance \nWe believe that the future success of our business depends on many factors, including the factors described below. While each of these factors presents significant opportunities for our business, they also pose important \n23\nTable of Contents\nchallenges that we must successfully address in order to continue to grow profitably while maintaining strong cash flow.\nContinue to invest in innovation\nWe have made, and intend to continue to make, significant investments in our advertising solutions to enhance their effectiveness and value proposition for our clients. We expect that these investments will require spending on research and development and acquisitions and partnerships related to technology components and products. We believe investments in our technology, including Axon AI, our advertising recommendation engine, Axon Advertising, Adjust, and MAX, will further improve effectiveness for advertisers. In addition, we plan to continue to invest in the AI-based, self-learning capabilities of our advertising recommendation engine, Axon AI. Our investments will also allow us to enter into and expand into new verticals outside of gaming, such as e-commerce and CTV. While our investments in research and development and acquisitions and partnerships may not result in revenue in the near term, we believe these investments position us to increase our revenue over time.\nRetain and grow existing clients\nWe rely on existing clients for a significant portion of our revenue. As we improve our advertising solutions, we can attract additional spend from these clients. Our clients include indie studio developers and some of the largest advertising platforms in the world. We believe there is significant room for us to further expand our relationships with these clients and increase their usage of our advertising solutions.\nIn the past, our clients have generally increased their usage of our advertising solutions, and as a result, growth from existing clients has been a primary driver of our revenue growth. We must continue to retain our existing clients and expand their spend with us over time to continue to grow our revenue, increase profitability and drive greater cash flow.\nAdd new clients globally\nOur future success depends in part on our ability to acquire new clients. During the three months ended September 30, 2025, 51% of our revenue was generated from outside of the United States. We believe that the global opportunity is significant and will continue to expand as developers and advertisers outside the United States adopt our advertising solutions. We also see opportunities to acquire new clients outside of mobile gaming, as the capabilities of our advertising solutions are relevant to the broader advertising ecosystem, including in areas such as e-commerce. For example, in October 2025 we opened a public referral program to onboard customers to Axon Ads Manager, which we expect to launch more broadly in the first half of 2026. We are investing in direct sales, product development, education, and other capabilities to drive increased awareness and adoption of our advertising solutions, which investments may impact our profitability in the near term as we seek further scale.\nContinued execution of strategic partnerships\nWe continue to explore strategic partnership opportunities related to our advertising solutions and the expansion of the markets it serves and we may from time to time evaluate strategic acquisitions and partnerships opportunistically. We believe our future results of operations will be affected by our ability to continue to identify and execute such strategic transactions that are accretive to our growth and profitability. In April 2025, we provided an indication of interest to the President of the United States to explore a purchase of TikTok in all markets outside of China. This indication of interest is preliminary and there can be no assurance that a transaction involving us will proceed.\nGrowth and structure of the mobile app and advertising ecosystems\nOur business and results of operations are, and will continue to be, impacted by industry factors that drive the overall performance of the mobile app and advertising ecosystems. Mobile app developers rely on third-party platforms, such as the Apple App Store and Google Play Store, among others, to distribute games, collect payments made for IAPs, and target users with relevant advertising. We expect this to continue for the foreseeable future. These third-party platforms have significant market power and discretion to set platform fees, select which apps to promote, and decide how much consumer information to provide to advertising networks that enable our advertising solutions to target users with personalized and relevant advertising and allocate marketing campaigns in an efficient and cost-effective manner. Any changes made to the policies of third-party platforms could drive rapid change across the mobile app and advertising ecosystems. For example, in April 2021, Apple started implementing its application tracking transparency framework that, among other things, requires users' opt-in consent for certain types of tracking. While this transparency framework has not had a significant impact on our overall business, it may do so in the future, including with respect to the effectiveness of our advertising practices. We rely in part on Identifier for Advertisers (\"IDFA\") to provide us with data that helps our advertising solutions better market and \n24\nTable of Contents\nmonetize mobile apps. In light of the IDFA and transparency changes, we made changes to our data collection practices. Additionally, Apple implemented new requirements for consumer disclosures regarding privacy and data processing practices in December 2020, which has resulted in increased compliance requirements. Apple incorporated new SDK privacy controls into iOS 17, which was released in September 2023, including privacy manifests and signatures designed to allow app developers to outline the data practices for SDKs embedded in their apps, manage tracking domains within SDKs, and curb device fingerprinting by requiring app developers to select allowed reasons for using data received through certain APIs. In February 2022, Google announced its Privacy Sandbox initiative for Android, a multi-year effort aimed at reducing cross-app tracking and limiting reliance on user identifiers. However, in October 2025, Google announced its plans to retire several Privacy Sandbox technologies for both Chrome and Android. In January 2024, Google commenced rolling out a Chrome feature, called Tracking Protection, which limits cross-site tracking. In May 2023, Google announced new consent management platform (\"CMP\") requirements for ads served in the European Economic Area (\"EEA\") and UK, which requires, as of January 2024, publishers using Google AdSense, Ad Manager, or AdMob to use a CMP that has been certified by Google and has integrated with the Interactive Advertising Bureau’s (“IAB”) Transparency and Consent Framework when serving ads to users in the EEA or the UK. While to date these third-party platform privacy changes have had some impact on the discoverability of apps across these platforms and have had a relatively muted aggregate impact on our results of operations, the ultimate impact of these or any similar or future changes to the policies of Apple or Google could adversely affect our business, financial condition, and results of operations.\nNew tools for developers, industry standards, and platforms may emerge in the future. We believe our focus on the advertising ecosystem has allowed us to understand the needs of our clients and our relentless innovation has enabled us to quickly adapt to changes in the industry and pioneer new solutions. We must continue to innovate and stay ahead of developments in the advertising and mobile app ecosystems in order for our business to succeed and our results of operations to continue to improve.\nComponents of Results of Operations \nRevenue\nWe generate revenue primarily from fees collected from advertisers spending on Axon Advertising, typically on a performance basis, then shared with our advertising publishers, typically on a cost per impression basis. Revenue also includes fees generated based on a percentage of client spend through MAX and subscription fees for Adjust's measurement and analytics marketing platform. Revenue from other services was not material. Revenue does not include the results of our former Apps Business, which is classified as discontinued operations.\nCost of Revenue and Operating Expenses\nCost of revenue. \nCost of revenue consists primarily of amortization of acquired technology-related intangible assets, amortization of finance lease right-of-use assets related to certain servers and networking equipment, and data center costs related primarily to third-party cloud computing services. We expect our cost of revenue to increase in absolute dollars over the long term as our business and revenue continue to grow. We also expect our cost of revenue as a percentage of revenue to fluctuate period-over-period\n.\nSales and marketing\n. Sales and marketing expenses consist primarily of marketing programs and other advertising expenses, professional services costs, personnel-related expenses including salaries, employee benefits, and stock-based compensation for employees engaged in sales and marketing activities, amortization of acquired user-related intangible assets, travel and allocated facilities and information technology costs.\nWe plan to continue to invest in sales and marketing to grow our advertising customer base and increase brand awareness. We expect sales and marketing expenses to fluctuate period-over-period in absolute dollars and as a percentage of revenue in the near term as we invest to grow our customer base and increase brand awareness, and to decrease as a percentage of revenue over the long term as we benefit from greater scale.\nResearch and development. \nResearch and development expenses consist primarily of product development costs, including personnel-related expenses such as salaries, employee benefits, and stock-based compensation for employees engaged in research and development activities, professional services costs, consulting costs, regulatory compliance costs, and allocated facilities and information technology costs.\nWe plan to continue to invest in research and development to continue to enhance our advertising solutions. We expect our research and development expenses as a percentage of revenue to fluctuate period-over-period in the near term as we invest to enhance our advertising solutions and to decrease over the long term as we benefit from greater scale.\n25\nTable of Contents\nGeneral and administrative\n. General and administrative expenses consist primarily of costs incurred to support our business, including personnel-related expenses such as salaries, employee benefits, and stock-based compensation for employees engaged in finance, accounting, legal, human resources and administration, professional services fees for legal, accounting, recruiting, and administrative services (including acquisition or other transaction-related expenses), insurance, travel, and allocated facilities and information technology costs.\nWe plan to continue to invest in our general and administrative function to support the growth of our business. We expect our general and administrative expenses as a percentage of revenue to fluctuate period-over-period in the near term as we invest to support the growth of our business, and to decrease over the long term as we benefit from greater scale.\nOther Income and Expenses\nInterest expense.\n Interest expense consists primarily of interest expense associated with our outstanding debt, including accretion of debt discount, and issuance costs.\nOther income (expense), net.\n Other income (expense), net, primarily includes interest earned on our cash and cash equivalents, fair value adjustments relating to our non-marketable equity securities, and foreign currency gains and losses.\nProvision for income taxes.\n We are subject to income taxes in the United States and foreign jurisdictions in which we do business. These foreign jurisdictions have different statutory tax rates than those in the United States. Additionally, certain of our foreign earnings may also be taxable in the United States. Accordingly, our effective tax rate will vary depending on the relative proportion of foreign to domestic income, impacts from acquisition restructuring, deduction benefits related to foreign-derived intangible income, future changes in the valuation of our deferred tax assets and liabilities, and changes in tax laws. Additionally, our effective tax rate can vary based on the amount of pre-tax income or loss.\n26\nTable of Contents\nResults of Operations \nIn this section, we discuss the results of our operations for the three and nine months ended September 30, 2025 and 2024.\nThe following tables summarize our historical condensed consolidated statements of operations:\nThree Months Ended September 30,\nNine Months Ended September 30,\n2025\n2024\n2025\n2024\n(in thousands)\nRevenue\n$\n1,405,045 \n$\n835,186 \n$\n3,822,773 \n$\n2,224,571 \nCosts and expenses:\nCost of revenue\n(1)(2)\n174,855 \n120,919 \n481,611 \n367,220 \nSales and marketing\n(1)(2)\n48,575 \n62,984 \n154,875 \n190,859 \nResearch and development\n(1)\n43,852 \n80,776 \n144,290 \n268,847 \nGeneral and administrative\n(1)\n58,756 \n36,208 \n165,326 \n115,023 \nTotal costs and expenses\n326,038 \n300,887 \n946,102 \n941,949 \nIncome from operations\n1,079,007 \n534,299 \n2,876,671 \n1,282,622 \nOther income (expense):\nInterest expense\n(51,429)\n(74,937)\n(155,726)\n(223,280)\nOther income (expense), net\n(6,632)\n8,367 \n(21,389)\n17,873 \nTotal other expense, net\n(58,061)\n(66,570)\n(177,115)\n(205,407)\nIncome before income taxes\n1,020,946 \n467,729 \n2,699,556 \n1,077,215 \nProvision for income taxes\n185,401 \n34,656 \n368,617 \n83,803 \nNet income from continuing operations\n835,545 \n433,073 \n2,330,939 \n993,412 \nIncome (loss) from discontinued operations, net of income taxes\n— \n1,347 \n(99,444)\n(12,840)\nNet income\n$\n835,545 \n$\n434,420 \n$\n2,231,495 \n$\n980,572 \n__________________\n(1) Includes stock-based compensation expense as follows:\nThree Months Ended September 30,\nNine Months Ended September 30,\n2025\n2024\n2025\n2024\n(in thousands)\nCost of revenue\n$\n175 \n$\n1,274 \n$\n1,375 \n$\n3,499 \nSales and marketing\n6,878 \n20,205 \n28,949 \n62,328 \nResearch and development\n15,593 \n45,980 \n60,593 \n160,853 \nGeneral and administrative\n11,121 \n9,943 \n36,517 \n33,225 \nTotal stock-based compensation\n$\n33,767 \n$\n77,402 \n$\n127,434 \n$\n259,905 \n(2) Includes amortization expense related to acquired intangibles as follows:\nThree Months Ended September 30,\nNine Months Ended September 30,\n2025\n2024\n2025\n2024\n(in thousands)\nCost of revenue\n$\n11,730 \n$\n9,596 \n$\n30,589 \n$\n28,726 \nSales and marketing\n13,888 \n13,695 \n41,210 \n41,005 \nTotal amortization expense related to acquired intangibles\n$\n25,618 \n$\n23,291 \n$\n71,799 \n$\n69,731 \n27\nTable of Contents\nThe following table sets forth the components of our condensed consolidated statements of operations for each of the periods presented as a percentage of revenue\n(1)\n:\nThree Months Ended September 30,\nNine Months Ended September 30,\n2025\n2024\n2025\n2024\nRevenue\n100 \n%\n100 \n%\n100 \n%\n100 \n%\nCosts and expenses:\nCost of revenue\n12 \n%\n14 \n%\n13 \n%\n17 \n%\nSales and marketing\n3 \n%\n8 \n%\n4 \n%\n9 \n%\nResearch and development\n3 \n%\n10 \n%\n4 \n%\n12 \n%\nGeneral and administrative\n4 \n%\n4 \n%\n4 \n%\n5 \n%\nTotal costs and expenses\n23 \n%\n36 \n%\n25 \n%\n42 \n%\nIncome from operations\n77 \n%\n64 \n%\n75 \n%\n58 \n%\nOther income (expense):\nInterest expense \n(4)\n%\n(9)\n%\n(4)\n%\n(10)\n%\nOther income (expense), net\n0 \n%\n1 \n%\n(1)\n%\n1 \n%\nTotal other expense, net\n(4)\n%\n(8)\n%\n(5)\n%\n(9)\n%\nIncome before income taxes\n73 \n%\n56 \n%\n71 \n%\n48 \n%\nProvision for income taxes\n13 \n%\n4 \n%\n10 \n%\n4 \n%\nNet income from continuing operations\n59 \n%\n52 \n%\n61 \n%\n45 \n%\nIncome (loss) from discontinued operations, net of income taxes\n0 \n%\n— \n%\n(3)\n%\n(1)\n%\nNet income\n59 \n%\n52 \n%\n58 \n%\n44 \n%\n_________________\n(1) Totals of percentages of revenue may not foot due to rounding.\nComparison of Our Results of Operations for the Three and Nine Months Ended September 30, 2025 and 2024\nRevenue\nThree Months Ended September 30,\n2024 to 2025\n% Change\nNine Months Ended September 30,\n2024 to 2025\n% Change\n2025\n2024\n2025\n2024\n(in thousands, except percentages)\nRevenue\n$\n1,405,045 \n$\n835,186 \n68 \n%\n$\n3,822,773 \n$\n2,224,571 \n72 \n%\nThree Months Ended September 30, 2025 Compared to Three Months Ended September 30, 2024 \nFor the three months ended September 30, 2025, our revenue increased by $569.9 million, or 68%, compared to the same period in the prior year due primarily to improved Axon Advertising performance, where net revenue per installation increased 75%, partially offset by a decrease in the volume of installations of 1%.\nNine Months Ended September 30, 2025 Compared to Nine Months Ended September 30, 2024 \nFor the nine months ended September 30, 2025, our revenue increased by $1.6 billion, or 72%, compared to the same period in the prior year due primarily to improved Axon Advertising performance, where net revenue per installation increased 64% and the volume of installations increased 9%.\nCost of revenue\nThree Months Ended September 30,\n2024 to 2025\n% Change\nNine Months Ended September 30,\n2024 to 2025\n% Change\n2025\n2024\n2025\n2024\n(in thousands, except percentages)\nCost of revenue\n$\n174,855 \n$\n120,919 \n45 \n%\n$\n481,611 \n$\n367,220 \n31 \n%\nPercentage of revenue\n12 \n%\n14 \n%\n13 \n%\n17 \n%\n28\nTable of Contents\nCost of revenue in the three months ended September 30, 2025 increased by $53.9 million, or 45%, compared to the same period in the prior year, due primarily to an increase of $53.1 million in expenses associated with operating our network infrastructure driven by the growth in our operations.\nCost of revenue in the nine months ended September 30, 2025 increased by $114.4 million, or 31%, compared to the same period in the prior year, due primarily to an increase of $120.4 million in expenses associated with operating our network infrastructure driven by the growth in our operations.\nSales and marketing\nThree Months Ended September 30,\n2024 to 2025\n% Change\nNine Months Ended September 30,\n2024 to 2025\n% Change\n2025\n2024\n2025\n2024\n(in thousands, except percentages)\nSales and marketing\n$\n48,575 \n$\n62,984 \n(23)\n%\n$\n154,875 \n$\n190,859 \n(19)\n%\nPercentage of revenue\n3 \n%\n8 \n%\n4 \n%\n9 \n%\nSales and marketing expenses in the three months ended September 30, 2025 decreased by $14.4 million, or 23%, compared to the same period in the prior year, due primarily to a $17.8 million decrease in personnel-related expenses related to a decrease in stock-based compensation expense.\nSales and marketing expenses in the nine months ended September 30, 2025 decreased by $36.0 million, or 19%, compared to the same period in the prior year, due primarily to a $43.4 million decrease in personnel-related expenses related to a decrease in stock-based compensation expense.\nResearch and development\nThree Months Ended September 30,\n2024 to 2025\n% Change\nNine Months Ended September 30,\n2024 to 2025\n% Change\n2025\n2024\n2025\n2024\n(in thousands, except percentages)\nResearch and development\n$\n43,852 \n$\n80,776 \n(46)\n%\n$\n144,290 \n$\n268,847 \n(46)\n%\nPercentage of revenue\n3 \n%\n10 \n%\n4 \n%\n12 \n%\nResearch and development expenses in the three months ended September 30, 2025 decreased by $36.9 million, or 46%, compared to the same period in the prior year, due primarily to a decrease of $38.9 million in personnel-related expenses related to a decrease in stock-based compensation expense.\nResearch and development expenses in the nine months ended September 30, 2025 decreased by $124.6 million, or 46%, compared to the same period in the prior year, due primarily to a decrease of $126.4 million in personnel-related expenses related to a decrease in stock-based compensation expense.\nGeneral and administrative\nThree Months Ended September 30,\n2024 to 2025\n% Change\nNine Months Ended September 30,\n2024 to 2025\n% Change\n2025\n2024\n2025\n2024\n(in thousands, except percentages)\nGeneral and administrative\n$\n58,756 \n$\n36,208 \n62 \n%\n$\n165,326 \n$\n115,023 \n44 \n%\nPercentage of revenue\n4 \n%\n4 \n%\n4 \n%\n5 \n%\nGeneral and administrative expenses in the three months ended September 30, 2025 increased by $22.5 million, or 62%, compared to the same period in the prior year, due to an increase of $11.1 million in bad debt expense primarily related to new initiatives and an increase of $6.8 million in professional services costs.\nGeneral and administrative expenses in the nine months ended September 30, 2025 increased by $50.3 million, or 44%, compared to the same period in the prior year, due to an increase of $23.8 million in bad debt expense primarily related to new initiatives and an increase of $17.7 million in professional services costs.\n29\nTable of Contents\nInterest expense\nThree Months Ended September 30,\n2024 to 2025\n% Change\nNine Months Ended September 30,\n2024 to 2025\n% Change\n2025\n2024\n2025\n2024\n(in thousands, except percentages)\nInterest expense\n$\n(51,429)\n$\n(74,937)\n(31)\n%\n$\n(155,726)\n$\n(223,280)\n(30)\n%\nPercentage of revenue\n(4)\n%\n(9)\n%\n(4)\n%\n(10)\n%\nIn the three months ended September 30, 2025, interest expense decreased by $23.5 million, or 31%, compared to the same period in the prior year, due primarily to a $22.5 million decrease in interest expense as a result of lower interest rates under our senior unsecured notes compared to our prior credit agreement.\nIn the nine months ended September 30, 2025, interest expense decreased by $67.6 million, or 30%, compared to the same period in the prior year, due primarily to a $64.9 million decrease in interest expense as a result of lower interest rates under our senior unsecured notes and our unsecured credit agreement compared to our prior credit agreement.\nOther income (expense), net\nThree Months Ended September 30,\n2024 to 2025\n% Change\nNine Months Ended September 30,\n2024 to 2025\n% Change\n2025\n2024\n2025\n2024\n(in thousands, except percentages)\nOther income (expense), net\n$\n(6,632)\n$\n8,367 \n**\n$\n(21,389)\n$\n17,873 \n**\nPercentage of revenue\n— \n%\n1 \n%\n(1)\n%\n1 \n%\n** Not meaningful\nIn the three months ended September 30, 2025, other income (expense), net decreased by $15.0 million compared to the same period in the prior year, due primarily to a net fair value remeasurement loss of $20.4 million related to our investments in non-marketable equity securities in the current period, partially offset by an increase in interest income of $7.4 million driven by an increase in cash and cash equivalents.\nIn the nine months ended September 30, 2025, other income (expense), net decreased by $39.3 million compared to the same period in the prior year, due primarily to a net fair value remeasurement loss of $42.7 million related to our investments in non-marketable equity securities in the current period and an increase in net foreign currency losses of $10.5 million. This is partially offset by an increase in interest income of $7.3 million driven by an increase in cash and cash equivalents and a decrease in certain third-party costs of $6.6 million incurred in connection with the refinancing of term loans in the prior year period.\nProvision for Income Taxes\nThree Months Ended September 30,\n2024 to 2025\n% Change\nNine Months Ended September 30,\n2024 to 2025\n% Change\n2025\n2024\n2025\n2024\n(in thousands, except percentages)\nProvision for income taxes\n$\n185,401 \n$\n34,656 \n**\n$\n368,617 \n$\n83,803 \n**\nPercentage of revenue\n13 \n%\n4 \n%\n10 \n%\n4 \n%\n** Not meaningful\nIn the three months ended September 30, 2025, the provision for income taxes increased by $150.7 million compared to the same period in the prior year. The increase was primarily driven by higher pre-tax income from business operations during the three months ended September 30, 2025 and global minimum tax, offset by foreign income taxed at different rates.\nIn the nine months ended September 30, 2025, the provision for income taxes increased by $284.8 million compared to the same period in the prior year. The increase was primarily driven by higher pre-tax income from business operations during the nine months ended September 30, 2025 and global minimum tax, offset by higher stock-based compensation benefit and foreign income taxed at different rates.\n30\nTable of Contents\nLiquidity and Capital Resources\nAs of September 30, 2025, we had cash and cash equivalents of $1.7 billion, consisting primarily of cash on deposit with banks and short-term liquid investments in money market deposit accounts. We believe that our existing cash and cash equivalents, cash flows expected to be generated by our operations, and, if necessary, our borrowing capacity under our credit agreement, which provided $1.0 billion of remaining availability as of September 30, 2025, would be sufficient to satisfy our anticipated working capital and capital expenditures needs for at least the next 12 months. Our future capital requirements will depend on many factors, including our revenue growth rate; sales and marketing activities; timing and extent of spending to support our research and development efforts; capital expenditures to purchase hardware and software; our continued need to invest in our IT infrastructure to support our growth; and the volume and timing of our stock repurchases. In addition, we may enter into additional strategic partnerships as well as agreements to acquire or invest in teams and technologies, including intellectual property rights, which could increase our cash requirements. As a result of these and other factors, we may be required to seek additional equity or debt financing sooner than we currently anticipate, or we may opportunistically seek additional financing. See the section titled “Risk Factors—Risks Related to Financial and Accounting Matters” for more information regarding risks related to liquidity and capital resources.\nThe following table summarizes our cash flows for the periods indicated (all periods include cash flows from continuing and discontinued operations):\nNine Months Ended September 30,\n2025\n2024\n(in thousands)\nNet cash provided by operating activities\n$\n2,657,360 \n$\n1,398,008 \nNet cash provided by (used in) investing activities\n$\n359,256 \n$\n(106,387)\nNet cash used in financing activities\n$\n(2,099,854)\n$\n(1,226,687)\nOperating Activities\nNet cash provided by operating activities was $2.7 billion for the nine months ended September 30, 2025, primarily driven by net income of $2.2 billion, adjusted for non-cash items, including $188.9 million of goodwill impairment, $162.0 million of amortization, depreciation, and write-offs, $130.2 million of stock-based compensation expense and $50.0 million of impairment of non-marketable equity securities, which were partially offset by a gain from the divestiture of our Apps Business, net of transaction costs, of $106.2 million and a net decrease in operating assets and liabilities of $29.9 million. \nNet cash provided by operating activities was $1.4 billion for the nine months ended September 30, 2024, primarily driven by net income of $980.6 million, adjusted for non-cash items, including $320.8 million of amortization, depreciation, and write-offs, and $275.5 million of stock-based compensation expense, which were partially offset by a net decrease in operating assets and liabilities of $196.2 million.\nThe improvement in cash flows from operating activities during the nine months ended September 30, 2025 compared to the same period in the prior year was primarily due to an increase in cash collection from our customers driven by revenue growth and a decrease of interest payments on debt as a result of lower interest rates, partially offset by higher cash operating expenses primarily associated with operating our network infrastructure, as well as higher income tax payments due to revenue growth.\nInvesting Activities\nNet cash provided by investing activities was $359.3 million for the nine months ended September 30, 2025, primarily driven by $407.3 million in proceeds from the divestiture of our Apps Business, net of cash divested, which were partially offset by $22.4 million in earn-out payments related to prior acquisitions of intangible assets and $20.2 million in purchases of non-marketable equity securities. \nNet cash used in investing activities was $106.4 million for the nine months ended September 30, 2024, primarily driven by $77.0 million in purchases of non-marketable equity securities and $18.3 million in earn-out payments related to prior acquisitions of intangible assets.\nFinancing Activities\nNet cash used in financing activities was $2.1 billion for the nine months ended September 30, 2025, primarily driven by $1.8 billion in stock repurchases under our share repurchase program and $316.9 million in payments for \n31\nTable of Contents\nwithholding taxes related to the net share settlement of equity awards.\nNet cash used in financing activities was $1.2 billion for the nine months ended September 30, 2024, primarily driven by $980.7 million in stock repurchases under our share repurchase program and $644.4 million in payments for withholding taxes related to the net share settlement of equity awards, which were partially offset by $1.1 billion in proceeds from debt issuances, net of $686.8 million in principal repayments of debt, and $28.8 million in proceeds from exercise of stock options and purchases under our Employee Stock Purchase Plan.\nCredit Agreement\nIn March 2025, we borrowed $200.0 million under our revolving credit facility pursuant to the credit agreement entered in 2024 to fund share repurchases under our repurchase program. We repaid $100.0 million of the outstanding principal amount of borrowings in April 2025 and the remaining $100.0 million of the outstanding principal amount of borrowings in May 2025. As of September 30, 2025, $1.0 billion remained available for borrowing under the facility.\nStock Repurchase Program \nDuring the nine months ended September 30, 2025, we repurchased 4.9 million shares of Class A common stock for an aggregate amount, including commissions and fees, of $1.8 billion. As of September 30, 2025, $492.2 million remained available for repurchases under the program. In February 2025, our Board modified our stock repurchase program such that $500.0 million was immediately available for repurchase of shares of our Class A common stock, notwithstanding the amount that otherwise would have remained available during the quarter under the prior program limitation, and such limit would be increased in future quarters by the amount of free cash flow generated in the preceding fiscal quarter, with such increases to be carried forward and remain available for future repurchases if not used (up to the total authorized amount available for repurchases). In October 2025, our board of directors authorized an increase to the repurchase program of $3.2 billion and removed the limitations and conditions related to free cash flow. Following the increase, an aggregate amount of approximately $3.3 billion remained available for repurchases as of October 31, 2025. Repurchases may be made from time to time through open market purchases or through privately negotiated transactions, subject to market conditions, applicable legal requirements, including surplus and solvency requirements, and other relevant factors. For additional information, see Note 8 – Equity of the Notes to condensed consolidated financial statements in Part I, Item 1 of this Quarterly Report on Form 10-Q.\nContractual Obligations\nExcept for scheduled payments from the ongoing business, there were no other material changes to our commitments under contractual obligations since December 31, 2024. For additional information, see Note 6 – Commitments and Contingencies of the Notes to condensed consolidated financial statements in Part I, Item 1 of this Quarterly Report on Form 10-Q.\nCritical Accounting Estimates\nOur condensed consolidated financial statements are prepared in accordance with GAAP. The preparation of our condensed consolidated financial statements requires us to make estimates and assumptions that affect the reported amounts of assets, liabilities, revenue, expenses, and related disclosures. On an ongoing basis, we evaluate our estimates based on assumptions that are believed to be reasonable under the circumstances. These estimates are inherently subject to judgment and actual results could differ materially from those estimates.\nAn accounting estimate is considered critical if it involves significant subjectivity and judgment, and if changes in the estimate have had or are reasonably likely to have a material effect on our consolidated financial statements. \nThere have been no material changes to our critical accounting estimates during the nine months ended September 30, 2025, as compared to those disclosed in our Management’s Discussion and Analysis of Financial Condition and Results of Operations set forth in our Annual Report on Form 10-K for the year ended December 31, 2024. For additional information on all of our significant accounting policies, see Note 2 to our consolidated financial statements in our Annual Report on Form 10-K for the year ended December 31, 2024.\nRecent Accounting Pronouncements\nSee Note 1 – Description of Business and Summary of Significant Accounting Policies of the Notes to condensed consolidated financial statements in Part I, Item 1 of this Quarterly Report on Form 10-Q.\n32\nTable of Contents"
}