{
  "source_file": "ato-20250930.htm",
  "form_type": "10-K",
  "item1": "ITEM 1.\nBusiness.\nOverview and Strategy\nAtmos Energy Corporation, a natural gas-only distributor, is an S&P 500 company headquartered in Dallas and incorporated in Texas and Virginia. We safely deliver reliable, efficient, and abundant natural gas through regulated sales and transportation arrangements to approximately 3.4 million residential, commercial, public authority, and industrial customers in eight states located primarily in the South. We also operate one of the largest intrastate pipelines in Texas based on miles of pipe.\nAtmos Energy's vision is to be the safest provider of natural gas services. We will be recognized for exceptional customer service, for being a great employer, and for achieving superior financial results.\nOur operating strategy is focused on modernizing our business and infrastructure while reducing regulatory lag. This operating strategy supports continued investment in safety, innovation, environmental sustainability, and our communities.\nOperating Segments\nWe manage and review our consolidated operations through the following reportable segments:\n•\nThe \ndistribution segment\n is comprised of our regulated natural gas distribution and related sales operations in eight states.\n•\nThe \npipeline and storage segment\n is comprised primarily of the regulated pipeline and storage operations of our Atmos Pipeline-Texas division and our natural gas transmission operations in Louisiana.\nDistribution Segment Overview\nThe following table summarizes key information about our six regulated natural gas distribution divisions, presented in order of total rate base. \nDivision\nService Areas\nCommunities Served\nCustomer Meters\nMid-Tex\nTexas, including the Dallas/Fort Worth Metroplex\n550\n1,830,387\nKentucky/Mid-States\nKentucky\n220\n176,494\nTennessee\n163,667\nVirginia\n23,836\nLouisiana\nLouisiana\n270\n360,589\nWest Texas\nAmarillo, Lubbock, Midland\n80\n316,036\nMississippi\nMississippi\n110\n249,562\nColorado-Kansas\nColorado\n170\n130,890\nKansas\n140,542\nWe operate in our service areas under terms of non-exclusive franchise agreements granted by the various cities and towns that we serve. At September 30, 2025, we held 1,010 franchises having terms generally ranging from five to 35 years. A number of our franchises expire each year, which require renewal prior to the end of their terms. Historically, we have successfully renewed these franchises and believe that we will continue to be able to renew our franchises as they expire. \nRevenues in this operating segment are established by regulatory authorities in the states in which we operate. These rates are intended to be sufficient to cover the costs of conducting business, including a reasonable return on invested capital.  In addition, we transport natural gas for others through our distribution systems.\n4\nTable of Contents\nRates established by regulatory authorities often include cost adjustment mechanisms for costs that (i) are subject to significant price fluctuations compared to our other costs, (ii) represent a large component of our cost of service, and (iii) are generally outside our control.\nPurchased gas cost adjustment mechanisms represent a traditional and common form of cost adjustment mechanism. Purchased gas cost adjustment mechanisms provide a method of recovering purchased gas costs on an ongoing basis without filing a rate case because they provide a dollar-for-dollar offset to increases or decreases in the cost of natural gas. Therefore, although substantially all of our distribution operating revenues fluctuate with the cost of gas that we purchase, distribution operating income is generally not affected by fluctuations in the cost of gas.\nAdditionally, some jurisdictions have performance-based ratemaking adjustments to provide incentives to minimize purchased gas costs through improved storage management and use of financial instruments to reduce volatility in gas costs. Under the performance-based ratemaking adjustments, purchased gas costs savings are shared between the Company and its customers.\nOur supply of natural gas is provided by a variety of suppliers, including independent producers, and marketers. The gas is delivered into our systems by various pipeline companies, withdrawals of gas from proprietary and contracted storage assets, and base load and peaking arrangements, as needed.\nSupply arrangements consist of both base load and peaking quantities and are contracted from our suppliers on a firm basis with various terms at market prices. Base load quantities are those that flow at a constant level throughout the month and peaking quantities provide the flexibility to change daily quantities to match increases or decreases in requirements related to weather conditions.\nExcept for local production purchases, we select our natural gas suppliers through a competitive bidding process by periodically requesting proposals from suppliers. We select these suppliers based on their ability to reliably deliver gas supply to our designated firm pipeline receipt points at the lowest reasonable cost. Major suppliers during fiscal 2025 were ARM Energy Management LLC, Cima Energy, LP, ConocoPhillips Company, ECO Energy Natural Gas LLC, EnLink Gas Marketing LP, Sequent Energy Management LLC, Symmetry Energy Solutions, LLC, Targa Gas Marketing LLC, Tenaska Marking Ventures, and Texla Energy Management, Inc.\nThe combination of base load and peaking agreements, coupled with the withdrawal of gas held in storage, allows us the flexibility to adjust to changes in weather, which minimizes our need to enter into long-term firm commitments. We estimate our peak-day availability of natural gas supply to be approximately 5.4 Bcf. The peak-day demand for our distribution operations in fiscal 2025 was on February 19, 2025, when sales to customers reached approximately 4.2 Bcf.\nCurrently, our distribution divisions utilize 33 pipeline transportation companies, both interstate and intrastate, to transport our natural gas. The pipeline transportation agreements are firm and many of them have “pipeline no-notice” storage service, which provides for daily balancing between system requirements and nominated flowing supplies. These agreements have been negotiated with the shortest term necessary while still maintaining our right of first refusal. The natural gas supply for our Mid-Tex Division is delivered primarily by our APT Division.\nTo maintain our deliveries to high priority customers, we have the ability, and have exercised our right, to interrupt or curtail service to certain customers pursuant to contracts and applicable state regulations or statutes. Our customers’ demand on our system is not necessarily indicative of our ability to meet current or anticipated market demands or immediate delivery requirements because of factors such as the physical limitations of gathering, storage and transmission systems, the duration and severity of cold weather, the availability of gas reserves from our suppliers, the ability to purchase additional supplies on a short-term basis, and actions by federal and state regulatory authorities. Interruption and curtailment rights provide us the flexibility to meet the human-needs requirements of our customers on a reliable basis. Priority allocations imposed by federal and state regulatory agencies, as well as other factors beyond our control, may affect our ability to meet the demands of some of our customers.\nPipeline and Storage Segment Overview\nOur pipeline and storage segment consists of the regulated pipeline and storage operations of APT and our natural gas transmission operations in Louisiana. APT is one of the largest intrastate pipeline operations in Texas with a heavy concentration in the established natural gas-producing areas of central, northern, and eastern Texas, extending into or near the major producing areas of the Barnett Shale, the Texas Gulf Coast, and the Permian Basin of West Texas. Through its system, APT provides transportation and storage services to our Mid-Tex Division, other third party local distribution companies, industrial and electric generation customers, marketers, and producers. As part of its pipeline operations, APT owns and operates five underground storage facilities in Texas. \nRevenues earned from transportation and storage services for APT are subject to traditional ratemaking governed by the RRC. Rates are updated through periodic filings made under Texas’ GRIP. GRIP allows us to include in our rate base annually approved capital costs incurred in the prior calendar year provided that we file a complete rate case at least once every five \n5\nTable of Contents\nyears; the most recent of which was completed in December 2023. APT’s existing regulatory mechanisms allow certain transportation and storage services to be provided under market-based rates.\nOur natural gas transmission operations in Louisiana are comprised of a 21-mile pipeline located in the New Orleans, Louisiana area that is primarily used to aggregate gas supply for our distribution division in Louisiana under a long-term contract and, on a more limited basis, to third parties. The demand fee charged to our Louisiana distribution division for these services is subject to regulatory approval by the Louisiana Public Service Commission. We also manage two asset management plans that serve distribution affiliates of the Company, which have been approved by applicable state regulatory commissions. Generally, these asset management plans require us to share with our distribution customers a significant portion of the cost savings earned from these arrangements.\nRatemaking Activity\nOverview\nThe method of determining regulated rates varies among the states in which our regulated businesses operate. The regulatory authorities have the responsibility of ensuring that utilities in their jurisdictions operate in the best interests of customers while providing utility companies the opportunity to earn a reasonable return on their investment. Generally, each regulatory authority reviews rate requests and establishes a rate structure intended to generate revenue sufficient to cover the costs of conducting business, including a reasonable return on invested capital.\nOur rate strategy focuses on reducing or eliminating regulatory lag, obtaining adequate returns, and providing stable, predictable margins, which benefit both our customers and the Company. As a result of our ratemaking efforts and legislative actions in our jurisdictions in recent years, Atmos Energy has:\n•\nFormula rate mechanisms in place in four states that provide for an annual rate review and adjustment to rates.\n•\nInfrastructure programs in place in all of our states that provide for an annual adjustment to rates for qualifying capital expenditures. Through our annual formula rate mechanisms and infrastructure programs, we have the ability to begin recovering approximately 95 percent of our capital expenditures within six months and substantially all of our capital expenditures within twelve months.\n•\nAuthorization in tariffs, statute or commission rules that allows us to defer certain elements of our incurred cost of service such as depreciation, ad valorem taxes, pension costs, and certain safety related expenses, until they are included in rates.\n•\nWNA mechanisms in seven states that serve to minimize the effects of weather on approximately 97 percent of our distribution residential and commercial revenues.\n•\nThe ability to recover the gas cost portion of bad debts in six states which represents approximately 89 percent of our distribution residential and commercial revenues.\n6\nTable of Contents\nThe following tables provides a jurisdictional rate summary for our regulated operations as of September 30, 2025. This information is for regulatory purposes only and may not be representative of our actual financial position.\nDivision\nJurisdiction\nEffective\nDate of Last\nRate/GRIP Action\nRate Base\n(thousands)\n(1)\nAuthorized\nRate of\nReturn\n(1)\nAuthorized Debt/\nEquity Ratio\n(1)\nAuthorized\nReturn\non Equity\n(1)\nAtmos Pipeline — Texas\nTexas\n06/17/2025\n$5,237,614\n8.49%\n40/60\n11.45%\nColorado-Kansas\nColorado\n05/14/2023\n229,565\n7.00%\n42-45/55-58\n9.3% - 9.6%\nColorado SSIR\n01/01/2025\n73,623\n7.00% / 3.97%\n42/58\n(4)\nKansas\n05/09/2023\n295,070\n(4)\n(4)\n(4)\nKansas GSRS\n12/17/2024\n38,932\n(4)\n(4)\n(4)\nKansas SIP\n04/01/2025\n25,707\n(4)\n(4)\n(4)\nKentucky/Mid-States\nKentucky\n05/12/2025\n611,038\n7.15%\n46/54\n9.75%\nKentucky-PRP\n05/29/2025\n67,464\n6.94%\n45/55\n9.45%\nTennessee\n06/01/2025\n611,649\n7.63%\n39/61\n9.80%\nVirginia\n12/01/2023\n71,450\n7.57%\n39/61\n9.90%\nVirginia-SAVE\n10/01/2024\n21,436\n7.57%\n39/61\n9.90%\nLouisiana\nLouisiana\n07/01/2025\n1,352,758\n7.42%\n42/58\n9.80%\nMid-Tex\nMid-Tex Cities\n(5)\n10/01/2024\n7,146,843\n(6)\n7.41%\n42/58\n9.80%\nMid-Tex  ATM Cities\n08/01/2025\n7,953,622\n(6)\n7.59%\n39/61\n9.80%\nMid-Tex Environs\n08/01/2025\n7,953,529\n(6)\n7.59%\n39/61\n9.80%\nMid-Tex — Dallas\n06/01/2025\n7,973,771\n(6)\n7.52%\n40/60\n9.80%\nMississippi\nMississippi\n(7)\n11/04/2024\n592,236\n7.80%\n(4)\n(4)\nMississippi - SIR\n(7)\n11/04/2024\n629,687\n7.80%\n(4)\n(4)\nWest Texas\nWest Texas Systemwide \n(8)\n06/01/2025\n1,231,651\n7.59%\n39/61\n9.80%\n                 \nDivision\nJurisdiction\nBad  Debt\nRider\n(2)\nFormula Rate\nInfrastructure Mechanism \nPerformance Based\nRate Program\n(3)\nWNA Period\nAtmos Pipeline —  Texas\nTexas\nNo\nYes\nYes\nN/A\nN/A\nColorado-Kansas\nColorado\nNo\nNo\nYes\nNo\nN/A\nKansas\nYes\nNo\nYes\nYes\nOctober-May\nKentucky/Mid-States\nKentucky\nYes\nNo\nYes\nYes\nNovember-April\nTennessee\nYes\nYes\nYes\nYes\nOctober-April\nVirginia\nYes\nNo\nYes\nNo\nJanuary-December\nLouisiana\nLouisiana\nNo\nYes\nYes\nNo\nDecember-March\nMid-Tex Cities\nTexas\nYes\nYes\nYes\nNo\nNovember-April\nMid-Tex — Dallas\nTexas\nYes\nYes\nYes\nNo\nNovember-April\nMississippi\nMississippi\nYes\nYes\nYes\nNo\nNovember-April\nWest Texas\nTexas\nYes\nNo\nYes\nNo\nOctober-May\n \n(1)\nThe rate base, authorized rate of return, authorized debt/equity ratio, and authorized return on equity presented in this table are those from the most recent approved regulatory filing for each jurisdiction. These rate bases, rates of return, debt/equity ratios, and returns on equity are not necessarily indicative of current or future rate bases, rates of return or returns on equity.\n(2)\nThe bad debt rider allows us to recover from customers the gas cost portion of customer accounts that have been written off.\n7\nTable of Contents\n(3)\nThe performance-based rate program provides incentives to distribution companies to minimize purchased gas costs by allowing the companies and their customers to share the purchased gas costs savings.\n(4)\nA rate base, rate of return, return on equity, or debt/equity ratio was not included in the respective state commission’s final decision.\n(5)\nThe Mid-Tex Cities approved the Formula Rate Mechanism filing with rates effective October 1, 2025, which included a rate base of $8.3 billion, an authorized return of 7.42%, a debt/equity ratio of 42/58, and an authorized ROE of 9.80%.\n(6)\nThe Mid-Tex rate base represents a “system-wide,” or 100 percent, of the Mid-Tex Division’s rate base.\n(7)\nThe Mississippi SRF and SIR were filed jointly in a general rate case. On November 4, 2025, the Mississippi Public Service Commission issued a rate order in this case. We are required to file tariffs consistent with the final order by November 18, 2025, which we expect will determine the final impact to operating income and rate base. We expect rates to be implemented during the first quarter of fiscal 2026. The final order included an authorized return of 6.80%, a debt/equity ratio of 50/50, and an authorized ROE of 9.40%.\n(8)\nThe West Texas Systemwide Statement of Intent filing included the West Texas RRM and the Amarillo, Lubbock, Dalhart and Channing (ALDC), Environs, and Triangle GRIP filings.\nAlthough substantial progress has been made in recent years to improve rate design and recovery of investment across our service areas, we are continuing to seek improvements in rate design to address cost variations and pursue tariffs that reduce regulatory lag associated with investments. Further, potential changes in federal energy policy, federal safety regulations, and changing\n \neconomic conditions will necessitate continued vigilance by the Company and our regulators in meeting the challenges presented by these external factors.\nRecent Ratemaking Activity\nThe amounts described in the following sections represent the annual operating income that was requested or received in each rate filing, which may not necessarily reflect the stated amount referenced in the final order, as certain operating costs may have changed as a result of the commission's or other governmental authority's final ruling. Our ratemaking outcomes include the refund (return) of excess deferred income taxes (EDIT) resulting from previously enacted tax reform legislation and do not reflect the true economic benefit of the outcomes because they do not include the corresponding income tax benefit.  The following tables summarize the annualized ratemaking outcomes we implemented in each of the last three fiscal years.\nRate Action\nAnnual Increase (Decrease) in Operating Income\nEDIT Impact\nAnnual Increase (Decrease) in Operating Income Excluding EDIT\n \n(In thousands)\n2025 Filings:\nAnnual formula rate mechanisms\n$\n279,724 \n$\n2,255 \n$\n281,979 \nRate case filings\n53,732 \n(12,976)\n40,756 \nOther ratemaking activity\n111 \n— \n111 \nTotal 2025 Filings\n$\n333,567 \n$\n(10,721)\n$\n322,846 \n2024 Filings:\nAnnual formula rate mechanisms\n$\n347,763 \n$\n(31,314)\n$\n316,449 \nRate case filings\n29,458 \n(37,860)\n(8,402)\nOther ratemaking activity\n(971)\n— \n(971)\nTotal 2024 Filings\n$\n376,250 \n$\n(69,174)\n$\n307,076 \n2023 Filings:\nAnnual formula rate mechanisms\n$\n258,824 \n$\n(1,099)\n$\n257,725 \nRate case filings\n2,940 \n6,791 \n9,731 \nOther ratemaking activity\n1,320 \n— \n1,320 \nTotal 2023 Filings\n$\n263,084 \n$\n5,692 \n$\n268,776 \nThe following ratemaking efforts seeking $231.1 million in annual operating income were initiated during fiscal 2025 but had not been completed or implemented as of September 30, 2025:\n8\nTable of Contents\nDivision\nRate Action\nJurisdiction\nOperating Income\nRequested\n(In thousands)\nColorado-Kansas\nRate Case\nKansas\n$\n15,977 \nColorado-Kansas\nInfrastructure Mechanism\nKansas \n(1)\n1,949 \nKentucky/Mid-States\nInfrastructure Mechanism\nVirginia \n(2)\n550 \nKentucky/Mid-States\nInfrastructure Mechanism\nKentucky \n(3)\n7,246 \nMid-Tex\nFormula Rate Mechanism\nMid-Tex Cities \n(4)\n165,027 \nMississippi\nRate Case\nMississippi \n(5)\n40,301 \n$\n231,050 \n(1)     The staff of the Kansas Corporation Commission recommended approval of the GSRS filing on October 17, 2025, subject to commission approval.\n(2)    On August 22, 2025, the State Corporation Commission of Virginia approved a rate increase of $0.5 million effective October 1, 2025.\n(3)    On September 15, 2025, the Kentucky Public Service Commission approved a rate increase of $7.2 million effective October 2, 2025, subject to refund.\n(4)    The Mid-Tex Cities approved a rate increase of $138.5 million. New rates were implemented October 1, 2025. \n(5)    On November 4, 2025, the Mississippi Public Service Commission issued a rate order in this case. We are required to file tariffs consistent with the final order by November 18, 2025, which we expect will determine the final impact to operating income and rate base. We expect rates to be implemented during the first quarter of fiscal 2026.\nOur recent ratemaking activity is discussed in greater detail below.\nAnnual Formula Rate Mechanisms\nAs an instrument to reduce regulatory lag, formula rate mechanisms allow us to refresh our rates on an annual basis without filing a formal rate case. However, these filings still involve discovery by the appropriate regulatory authorities prior to the final determination of rates under these mechanisms. We currently have specific infrastructure programs in all of our distribution divisions with tariffs in place to permit the investment associated with these programs to have their surcharge rate adjusted annually to recover approved capital costs incurred in a prior test-year period. The following table summarizes our annual formula rate mechanisms by state.\nAnnual Formula Rate Mechanisms\nState\nInfrastructure Programs\nFormula Rate Mechanisms\nColorado\nSystem Safety and Integrity Rider (SSIR)\n—\nKansas\nGas System Reliability Surcharge (GSRS), System Integrity Program (SIP)\n—\nKentucky\nPipeline Replacement Program (PRP)\n—\nLouisiana\n(1)\nRate Stabilization Clause (RSC)\nMississippi\nSystem Integrity Rider (SIR)\nStable Rate Filing (SRF)\nTennessee\n(1)\nAnnual Rate Mechanism (ARM)\nTexas\nGas Reliability Infrastructure Program (GRIP), (1)\nDallas Annual Rate Review (DARR), Mid-Tex Rate Review Mechanism (RRM)\nVirginia\nSteps to Advance Virginia Energy (SAVE)\n—\n(1)    Infrastructure mechanisms in Texas, Louisiana, and Tennessee allow for the deferral of all expenses associated with capital expenditures incurred pursuant to these rules, which primarily consists of interest, depreciation, and other taxes (Texas and Tennessee only), until the next rate proceeding (rate case or annual rate filing), at which time investment and costs would be recoverable through base rates.\n9\nTable of Contents\nThe following table summarizes our annual formula rate mechanisms with effective dates during the fiscal years ended September 30, 2025, 2024, and 2023: \nDivision\nJurisdiction\nTest Year\nEnded\nIncrease\nin\nAnnual\nOperating\nIncome\nEDIT Impact\nIncrease (Decrease) in Annual Operating Income Excluding EDIT\nEffective\nDate\n \n \n(In thousands)\n \n2025 Filings:\nLouisiana\nLouisiana\n12/2024\n$\n22,304 \n$\n1,473 \n$\n23,777 \n07/01/2025\nAtmos Pipeline - Texas\nTexas\n12/2024\n77,206 \n— \n77,206 \n06/17/2025\nKentucky/Mid-States\nTennessee ARM\n09/2024\n1,432 \n— \n1,432 \n06/01/2025\nMid-Tex\nDARR\n09/2024\n25,916 \n— \n25,916 \n06/01/2025\nKentucky/Mid-States\nKentucky PRP \n(1)\n09/2025\n3,248 \n— \n3,248 \n05/29/2025\nColorado-Kansas\nKansas SIP\n12/2024\n612 \n— \n612 \n04/01/2025\nColorado-Kansas\nColorado SSIR\n12/2025\n1,907 \n— \n1,907 \n01/01/2025\nColorado-Kansas\nKansas GSRS\n09/2024\n1,998 \n— \n1,998 \n12/17/2024\nMississippi\nMississippi - SIR\n10/2025\n23,995 \n— \n23,995 \n11/04/2024\nMississippi\nMississippi - SRF\n10/2025\n3,800 \n15 \n3,815 \n11/04/2024\nMid-Tex\nMid-Tex Cities RRM\n12/2023\n112,144 \n645 \n112,789 \n10/01/2024\nWest Texas\nWest Texas Cities RRM\n12/2023\n4,414 \n122 \n4,536 \n10/01/2024\nKentucky/Mid-States\nVirginia - SAVE\n09/2025\n748 \n— \n748 \n10/01/2024\nTotal 2025 Filings\n$\n279,724 \n$\n2,255 \n$\n281,979 \n2024 Filings:\nLouisiana\nLouisiana\n12/2023\n$\n35,645 \n$\n(11,785)\n$\n23,860 \n07/01/2024\nMid-Tex\nATM Cities\n12/2023\n17,104 \n— \n17,104 \n06/07/2024\nWest Texas\nAmarillo, Lubbock, Dalhart and Channing\n12/2023\n7,344 \n— \n7,344 \n06/07/2024\nKentucky/Mid-States\nTennessee ARM\n09/2023\n18,570 \n(4,348)\n14,222 \n06/01/2024\nMid-Tex\nDARR\n09/2023\n37,809 \n(14,782)\n23,027 \n06/01/2024\nWest Texas\nTriangle\n12/2023\n1,300 \n— \n1,300 \n06/01/2024\nWest Texas\nEnvirons\n12/2023\n1,379 \n— \n1,379 \n06/01/2024\nMid-Tex\nEnvirons\n12/2023\n8,529 \n— \n8,529 \n06/01/2024\nAtmos Pipeline - Texas\nTexas\n12/2023\n82,440 \n— \n82,440 \n05/14/2024\nColorado-Kansas\nKansas SIP\n12/2023\n708 \n— \n708 \n04/01/2024\nColorado-Kansas\nColorado SSIR\n12/2024\n2,017 \n— \n2,017 \n01/01/2024\nMississippi\nMississippi - SIR\n10/2024\n10,969 \n— \n10,969 \n12/01/2023\nMississippi\nMississippi - SRF\n10/2024\n11,539 \n(472)\n11,067 \n12/01/2023\nColorado-Kansas\nKansas GSRS\n09/2023\n1,752 \n— \n1,752 \n11/02/2023\nKentucky/Mid-States\nKentucky PRP\n09/2024\n2,906 \n— \n2,906 \n10/01/2023\nMid-Tex\nMid-Tex Cities RRM\n12/2022\n98,585 \n185 \n98,770 \n10/01/2023\nWest Texas\nWest Texas Cities RRM\n12/2022\n8,594 \n(112)\n8,482 \n10/01/2023\nKentucky/Mid-States\nVirginia - SAVE\n09/2024\n573 \n— \n573 \n10/01/2023\nTotal 2024 Filings\n$\n347,763 \n$\n(31,314)\n$\n316,449 \n10\nTable of Contents\n2023 Filings:\nLouisiana\nLouisiana\n12/2022\n$\n14,466 \n$\n17 \n$\n14,483 \n07/01/2023\nMid-Tex\nDARR \n(2)\n09/2022\n17,345 \n51 \n17,396 \n06/14/2023\nMid-Tex\nATM Cities\n12/2022\n12,825 \n— \n12,825 \n06/09/2023\nWest Texas\nAmarillo, Lubbock, Dalhart and Channing\n12/2023\n6,938 \n— \n6,938 \n06/09/2023\nWest Texas\nTriangle\n12/2022\n717 \n— \n717 \n06/01/2023\nWest Texas\nEnvirons\n12/2022\n1,332 \n— \n1,332 \n06/01/2023\nMid-Tex\nEnvirons\n12/2022\n5,983 \n— \n5,983 \n06/01/2023\nKentucky/Mid-States\nTennessee ARM\n09/2022\n14 \n(1,509)\n(1,495)\n06/01/2023\nAtmos Pipeline - Texas\nTexas\n12/2022\n84,931 \n— \n84,931 \n05/17/2023\nColorado-Kansas\nKansas SIP\n12/2022\n772 \n— \n772 \n04/01/2023\nColorado-Kansas\nColorado SSIR\n12/2023\n1,971 \n— \n1,971 \n01/01/2023\nMississippi\nMississippi - SIR\n10/2023\n8,560 \n— \n8,560 \n11/01/2022\nMississippi\nMississippi - SRF\n10/2023\n12,188 \n778 \n12,966 \n11/01/2022\nKentucky/Mid-States\nKentucky PRP\n09/2023\n1,588 \n— \n1,588 \n10/02/2022\nMid-Tex\nMid-Tex Cities RRM\n12/2021\n81,402 \n(395)\n81,007 \n10/01/2022\nWest Texas\nWest Texas Cities RRM\n12/2021\n7,315 \n(41)\n7,274 \n10/01/2022\nKentucky/Mid-States\nVirginia - SAVE\n09/2023\n477 \n— \n477 \n10/01/2022\nTotal 2023 Filings\n$\n258,824 \n$\n(1,099)\n$\n257,725 \n(1)    On October 2, 2024, we implemented the PRP rates subject to refund; on May 29, 2025, the Kentucky Public Service Commission issued a final order approving the PRP filing.\n(2)    The rate increase for this filing was approved based on the effective date herein; however, the new rates were implemented beginning September 1, 2023.\nRate Case Filings\nA rate case is a formal request from Atmos Energy to a regulatory authority to increase rates that are charged to customers. Rate cases may also be initiated when the regulatory authorities request us to justify our rates. This process is referred to as a “show cause” action. Adequate rates are intended to provide for recovery of the Company’s costs as well as a reasonable rate of return to our shareholders and ensure that we continue to safely deliver reliable, reasonably priced natural gas service to our customers. \nThe following table summarizes our recent rate case activity during the fiscal years ended September 30, 2025, 2024, and 2023:\n11\nTable of Contents\nDivision\nState\nIncrease in Annual Operating Income\nEDIT Impact\nIncrease (Decrease) in Annual Operating Income Excluding EDIT\nEffective Date\n \n \n(In thousands)\n \n2025 Rate Case Filings:\nMid-Tex ATM Cities\nTexas\n$\n4,439 \n$\n25 \n$\n4,464 \n08/01/2025\nMid-Tex Environs\nTexas\n2,297 \n(174)\n2,123 \n08/01/2025\nWest Texas Systemwide\nTexas\n30,615 \n(4,343)\n26,272 \n06/01/2025\nKentucky/Mid-States\nKentucky \n(1)\n16,381 \n(8,484)\n7,897 \n05/12/2025\nTotal 2025 Rate Case Filings\n$\n53,732 \n$\n(12,976)\n$\n40,756 \n2024 Rate Case Filings:\nAtmos Pipeline - Texas\nTexas\n$\n27,024 \n$\n(36,921)\n$\n(9,897)\n12/13/2023\nKentucky/Mid-States\nVirginia\n2,434 \n(939)\n1,495 \n12/01/2023\nTotal 2024 Rate Case Filings\n$\n29,458 \n$\n(37,860)\n$\n(8,402)\n2023 Rate Case Filings:\nColorado-Kansas\nColorado\n$\n913 \n$\n(54)\n$\n859 \n05/14/2023\nColorado-Kansas\nKansas\n2,027 \n6,845 \n8,872 \n05/09/2023\nTotal 2023 Rate Case Filings\n$\n2,940 \n$\n6,791 \n$\n9,731 \n(1)    On May 12, 2025, we implemented rates subject to refund; on August 11, 2025, the Kentucky Public Service Commission issued a final order.\nOther Regulation\nWe are regulated by various state or local public utility authorities. We are also subject to regulation by the United States Department of Transportation with respect to safety requirements in the operation and maintenance of our transmission and distribution facilities. In addition, our operations are also subject to various state and federal laws regulating environmental matters. From time to time, we receive inquiries regarding various environmental matters. We believe that our properties and operations comply with, and are operated in conformity with, applicable safety and environmental statutes and regulations. There are no administrative or judicial proceedings arising under environmental quality statutes pending or known to be contemplated by governmental agencies which would have a material adverse effect on us or our operations. The Pipeline and Hazardous Materials Safety Administration (PHMSA), within the U.S. Department of Transportation, develops and enforces regulations for the safe, reliable, and environmentally sound operation of the pipeline transportation system. The PHMSA pipeline safety statutes provide for states to assume safety authority over intrastate natural transmission and distribution gas pipelines. State pipeline safety programs are responsible for adopting and enforcing the federal and state pipeline safety regulations for intrastate natural gas transmission and distribution pipelines.\nThe Federal Energy Regulatory Commission (FERC) allows, pursuant to Section 311 of the Natural Gas Policy Act (NGPA), gas transportation services through our APT assets “on behalf of” interstate pipelines or local distribution companies served by interstate pipelines, without subjecting these assets to the jurisdiction of the FERC under the NGPA. Additionally, the FERC has regulatory authority over the use and release of interstate pipeline and storage capacity. The FERC also has authority to detect and prevent market manipulation and to enforce compliance with FERC’s other rules, policies, and orders by companies engaged in the sale, purchase, transportation, or storage of natural gas in interstate commerce. We have taken what we believe are the necessary and appropriate steps to comply with these regulations.\nThe SEC and the Commodities Futures Trading Commission, pursuant to the Dodd–Frank Act, established numerous regulations relating to U.S. financial markets. We enacted procedures and modified existing business practices and contractual arrangements to comply with such regulations.\nCompetition\nAlthough our regulated distribution operations are not currently in significant direct competition with any other distributors of natural gas to residential and commercial customers within our service areas, we do compete with other natural gas suppliers and suppliers of alternative fuels for sales to industrial customers. We compete in all aspects of our business with alternative energy sources, including, in particular, electricity. Electric utilities offer electricity as a rival energy source and compete for the space heating, water heating, and cooking markets. Promotional incentives, improved equipment efficiencies, and promotional rates all contribute to the acceptability of electrical equipment. The principal means to compete against \n12\nTable of Contents\nalternative fuels is lower prices, and natural gas historically has maintained its price advantage in the residential, commercial, and industrial markets.\nOur pipeline and storage operations have historically faced competition from other existing intrastate pipelines seeking to provide or arrange transportation, storage, and other services for customers. In the last few years, several new pipelines have been completed, which has increased the level of competition in this segment of our business.\nEmployees\nThe Corporate Responsibility, Sustainability, and Safety Committee of the Board of Directors oversees matters relating to equal employment opportunities, diversity, and inclusion; human workplace rights; employee health and safety; and the Company’s vision, values, and culture. It oversees the Company's policies, practices, and procedures relating to sustainability to support the alignment of the Company's sustainability strategy with the Company's corporate strategy.\nPart of our vision is to create a culture that respects and appreciates diversity. For this reason, we strive to have a workforce that reflects the communities we serve. At September 30, 2025, we had 5,487 employees. We monitor our workforce data on a calendar year basis. As of December 31, 2024, the last date for which information is available, 62 percent of our employees worked in field roles and 38 percent worked in support/shared services roles. None of our employees have chosen to work under a collective bargaining agreement.\n \n \n \nTo recruit and hire individuals with a variety of skills, talents, backgrounds, and experiences, we value and cultivate our strong relationships with various community and diversity outreach sources. We also target jobs fairs including those focused on minority, veteran, and women candidates and partner with local colleges and universities to identify and recruit qualified applicants in each of the cities and towns we serve. Finally, we believe we offer a competitive benefits program to help retain our employees.\n \n \n \nWe perform succession planning annually to ensure that we develop and sustain a strong bench of talent capable of performing at the highest levels. Not only is talent identified, but potential paths of development are discussed to ensure that employees have an opportunity to build their skills and are well-prepared for future roles. The strength of our succession planning process is evident through our long history of promoting most of our leaders from within the organization. \nAvailable Information\nOur Annual Reports on Form 10-K, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K, and other reports, and amendments to those reports, and other forms that we file with or furnish to the Securities and Exchange Commission (SEC) at their website, \nwww.sec.gov\n, are also available free of charge at our website, \nwww.investors.atmosenergy.com/financials/sec-filings/default.aspx\n, as soon as reasonably practicable, after we electronically file these reports with, or furnish these reports to, the SEC. We will also provide copies of these reports free of charge upon request to Investor Relations at the address and telephone number appearing below:\n13\nTable of Contents\nInvestor Relations\nAtmos Energy Corporation\nP.O. Box 650205\nDallas, Texas 75265-0205\n972-855-3729\nCorporate Governance\nIn accordance with and pursuant to relevant related rules and regulations of the SEC as well as corporate governance-related listing standards of the New York Stock Exchange (NYSE), the Board of Directors of the Company has established and periodically updated our Corporate Governance Guidelines and Code of Conduct, which is applicable to all directors, officers, and employees of the Company. In addition, in accordance with and pursuant to such NYSE listing standards, our Chief Executive Officer during fiscal 2025, John K. Akers, certified to the New York Stock Exchange that he was not aware of any violations by the Company of NYSE corporate governance listing standards. The Board of Directors also annually reviews and updates, if necessary, the charters for each of its Audit, Human Resources, Nominating and Corporate Governance, and Corporate Responsibility, Sustainability, and Safety Committees. All of the foregoing documents are posted on our website at \nwww.atmosenergy.com/company/corporate-responsiblity-reports\n. We will also provide copies of all corporate governance documents free of charge upon request to Investor Relations at the address listed above.",
  "item7": "ITEM 7.\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations.\nINTRODUCTION\nThis section provides management’s discussion of the financial condition, changes in financial condition, and results of operations of Atmos Energy Corporation and its consolidated subsidiaries with specific information on results of operations and liquidity and capital resources. It includes management’s interpretation of our financial results, the factors affecting these results, the major factors expected to affect future operating results, and future investment and financing plans. This discussion should be read in conjunction with our consolidated financial statements and notes thereto.\nSeveral factors exist that could influence our future financial performance, some of which are described in Item 1A above, “Risk Factors”. They should be considered in connection with evaluating forward-looking statements contained in this report or otherwise made by or on behalf of us since these factors could cause actual results and conditions to differ materially from those set out in such forward-looking statements.\nCautionary Statement for the Purposes of the Safe Harbor under the Private Securities Litigation Reform Act of 1995\nThe statements contained in this Annual Report on Form 10-K may contain “forward-looking statements” within the meaning of Section 27A of the Securities Act of 1933 and Section 21E of the Securities Exchange Act of 1934. All statements other than statements of historical fact included in this Report are forward-looking statements made in good faith by us and are intended to qualify for the safe harbor from liability established by the Private Securities Litigation Reform Act of 1995. When used in this Report, or any other of our documents or oral presentations, the words “anticipate”, “believe”, “estimate”, “expect”, “forecast”, “goal”, “intend”, “objective”, “plan”, “projection”, “seek”, “strategy”, or similar words are intended to identify forward-looking statements. Such forward-looking statements are subject to risks and uncertainties that could cause actual results to differ materially from those expressed or implied in the statements relating to our strategy, operations, markets, services, rates, recovery of costs, availability of gas supply, and other factors. These risks and uncertainties include the following: federal, state, and local regulatory and political trends and decisions, including the impact of rate proceedings before various state regulatory commissions; increased federal regulatory oversight and potential penalties; possible increased federal, state, and local regulation of the safety of our operations; possible significant costs and liabilities resulting from pipeline integrity and other similar programs and related repairs; the inherent hazards and risks involved in distributing, transporting, and storing natural gas; the availability and accessibility of contracted gas supplies, interstate pipeline, and/or storage services; increased competition from energy suppliers and alternative forms of energy; failure to attract and retain a qualified workforce; natural disasters, adverse weather, terrorist activities, or other events and other risks and uncertainties discussed herein, all of which are difficult to predict and many of which are beyond our control; failure of technology that affects the Company's business operations; the threat of cyber-attacks or acts of cyber-terrorism that could disrupt our business operations and information technology systems or result in the loss or exposure of confidential or sensitive customer, employee, or Company information; the impact of new cybersecurity compliance requirements; adverse weather conditions; the impact of legislation to \n24\nTable of Contents\nreduce or eliminate greenhouse gas emissions or fossil fuels; the impact of climate change; the capital-intensive nature of our business; our ability to continue to access the credit and capital markets to execute our business strategy; market risks beyond our control affecting our risk management activities, including commodity price volatility, counterparty performance or creditworthiness, and interest rate risk; the concentration of our operations in Texas; the impact of adverse economic conditions on our customers; changes in the availability and price of natural gas; and increased costs of providing health care benefits, along with pension and postretirement health care benefits and increased funding requirements. Accordingly, while we believe these forward-looking statements to be reasonable, there can be no assurance that they will approximate actual experience or that the expectations derived from them will be realized. Further, we undertake no obligation to update or revise any of our forward-looking statements whether as a result of new information, future events or otherwise.\nOVERVIEW\nAtmos Energy's vision is to be the safest provider of natural gas services. Our commitment to this vision requires significant levels of capital spending to modernize our natural gas distribution system and operating costs to deliver natural gas safely and reliably and in compliance with the various safety regulations impacting our business. We have the ability to begin recovering a significant portion of our expenditures timely through rate designs and mechanisms that reduce or eliminate regulatory lag and separate the recovery of our approved rate from customer usage patterns. The execution of our capital spending program, the ability to recover these expenditures timely and our ability to access the capital markets to satisfy our financing needs are the primary drivers that affect our financial performance.\nWe anticipate making significant capital expenditures for the foreseeable future to modernize our distribution and transmission system, to comply with the safety rules and regulations issued by the regulatory authorities responsible for the service areas in which we operate, and to prepare to serve the growing needs of the communities we serve. Between fiscal years 2026 and 2030, we anticipate spending approximately $26 billion, with more than 80 percent dedicated to safety and reliability spending. The magnitude and allocation of these expenditures may be affected by factors such as new policy and regulations, population growth, and increased labor and materials costs. Although we believe these costs are ultimately recoverable through our rates based on the regulatory frameworks currently available to us, full recovery is not assured.\nCRITICAL ACCOUNTING POLICIES\nOur consolidated financial statements were prepared in accordance with accounting principles generally accepted in the United States. Preparation of these financial statements requires us to make estimates and judgments that affect the reported amounts of assets, liabilities, revenues, and expenses and the related disclosures of contingent assets and liabilities. We base our estimates on historical experience and various other assumptions that we believe to be reasonable under the circumstances. Actual results may differ from estimates.\nOur significant accounting policies are discussed in Note 2 to our consolidated financial statements. The accounting policies discussed below are both important to the presentation of our financial condition and results of operations and require management to make difficult, subjective, or complex accounting estimates. Accordingly, these critical accounting policies are reviewed periodically by the Audit Committee of the Board of Directors.\nCritical \nAccounting Policy\nSummary of Policy\nFactors Influencing Application of the Policy\nRegulation\nOur distribution and pipeline operations meet the criteria of a cost-based, rate-regulated entity under accounting principles generally accepted in the United States. Accordingly, the financial results for these operations reflect the effects of the ratemaking and accounting practices and policies of the various regulatory commissions to which we are subject.\nAs a result, certain costs that would normally be expensed under accounting principles generally accepted in the United States are permitted to be capitalized or deferred on the balance sheet because it is probable they can be recovered through rates. Further, regulation may impact the period in which revenues or expenses are recognized. The amounts expected to be recovered or recognized are based upon historical experience and our understanding of the regulations.\nDiscontinuing the application of this method of accounting for regulatory assets and liabilities or changes in the accounting for our various regulatory mechanisms could significantly increase our operating expenses as fewer costs would likely be capitalized or deferred on the balance sheet, which could reduce our net income.\nDecisions of regulatory authorities\nIssuance of new regulations or regulatory mechanisms\nAssessing that the recoverability of deferred costs and utility assets is probable\nContinuing to meet the criteria of a cost-based, rate regulated entity for accounting purposes\n25\nTable of Contents\nCritical \nAccounting Policy\nSummary of Policy\nFactors Influencing Application of the Policy\nPension and other postretirement plans\nPension and other postretirement plan costs and liabilities are determined on an actuarial basis using a September 30 measurement date and are affected by numerous assumptions and estimates including the market value of plan assets, estimates of the expected return on plan assets, assumed discount rates, and current demographic and actuarial mortality data. The assumed discount rate and the expected return are the assumptions that generally have the most significant impact on our pension costs and liabilities. The assumed discount rate, the assumed health care cost trend rate, and assumed rates of retirement generally have the most significant impact on our postretirement plan costs and liabilities.\nThe discount rate is utilized principally in calculating the actuarial present value of our pension and postretirement obligations and net periodic pension and postretirement benefit plan costs. When establishing our discount rate, we consider high quality corporate bond rates based on bonds available in the marketplace that are suitable for settling the obligations, changes in those rates from the prior year, and the implied discount rate that is derived from matching our projected benefit disbursements with currently available high quality corporate bonds.\nThe expected long-term rate of return on assets is utilized in calculating the expected return on plan assets component of our annual pension and postretirement plan costs. We estimate the expected return on plan assets by evaluating expected bond returns, equity risk premiums, asset allocations, the effects of active plan management, the impact of periodic plan asset rebalancing, and historical performance. We also consider the guidance from our investment advisors in making a final determination of our expected rate of return on assets. To the extent the actual rate of return on assets realized over the course of a year is greater than or less than the assumed rate, that year’s annual pension or postretirement plan costs are not affected. Rather, this gain or loss reduces or increases future pension or postretirement plan costs over a period of approximately ten to twelve years.\nThe market-related value of our plan assets represents the fair market value of the plan assets, adjusted to smooth out short-term market fluctuations over a five-year period. The use of this methodology will delay the impact of current market fluctuations on the pension expense for the period.\nWe estimate the assumed health care cost trend rate used in determining our postretirement net expense based upon our actual health care cost experience, the effects of recently enacted legislation and general economic conditions. Our assumed rate of retirement is estimated based upon our annual review of our participant census information as of the measurement date.\nGeneral economic and market conditions\nAssumed investment returns by asset class\nAssumed future salary increases\nAssumed discount rate\nProjected timing of future cash disbursements\nHealth care cost experience trends\nParticipant demographic information\nActuarial mortality  assumptions\nImpact of legislation\nImpact of regulation\nRESULTS OF OPERATIONS\nThe following table details our consolidated net income by segment during the last three fiscal years:\n \nFor the Fiscal Year Ended September 30\n \n2025\n2024\n2023\n \n(In thousands)\nDistribution segment\n$\n746,781 \n$\n671,413 \n$\n580,397 \nPipeline and storage segment\n451,973 \n371,482 \n305,465 \nNet income\n$\n1,198,754 \n$\n1,042,895 \n$\n885,862 \nDuring fiscal 2025, we recorded net income of $1,198.8 million, or $7.46 per diluted share, compared to net income of $1,042.9 million, or $6.83 per diluted share in the prior year. The year-over-year increase in net income of $155.9 million largely reflects positive rate outcomes driven by safety and reliability spending. Additionally, our fiscal 2025 results were \n26\nTable of Contents\nfavorably impacted by $26.2 million as a result of Texas legislation that became effective during the third quarter of fiscal 2025 related to infrastructure spending. These increases were partially offset by higher bad debt expense, increased employee-related costs, depreciation and property tax expenses, and higher spending on safety and compliance related activities.\nDuring the year ended September 30, 2025, we implemented ratemaking regulatory actions which resulted in an increase in annual operating income of $333.6 million. Excluding the impact of the refund of excess deferred income taxes resulting from previously enacted tax reform legislation, our total fiscal 2025 rate outcomes were $322.8 million. Additionally, we had ratemaking efforts in progress at September 30, 2025, seeking a total increase in annual operating income of $231.1 million. \nDuring fiscal year 2025, we refunded $78.8 million in excess deferred tax liabilities to customers. These refunds also reduced our income tax expense, resulting in an immaterial impact to our fiscal 2025 and 2024 results.\nCapital expenditures for fiscal 2025 were $3.6 billion. Approximately 87 percent was invested to improve the safety and reliability of our distribution and transportation systems, with a significant portion of this investment incurred under regulatory mechanisms that reduce regulatory lag to six months or less. \nDuring fiscal 2025, we completed approximately $1.8 billion of long-term debt and equity financing. As of September 30, 2025, our equity capitalization was 60.3 percent. As of September 30, 2025, we had approximately $4.9 billion in total liquidity, consisting of $202.7 million in cash and cash equivalents, $1,558.5 million in funds available through equity forward sales agreements, and $3,094.4 million in undrawn capacity under our credit facilities.\nDistribution Segment\nThe distribution segment is comprised of our regulated natural gas distribution and related sales operations in eight states. The primary factors that impact the results of our distribution operations are our ability to earn our authorized rates of return, competitive factors in the energy industry, and economic conditions in our service areas.\nOur ability to earn our authorized rates is based primarily on our ability to improve the rate design in our various ratemaking jurisdictions to minimize regulatory lag and, ultimately, separate the recovery of our approved rates from customer usage patterns. Improving rate design is a long-term process and is further complicated by the fact that we operate in multiple rate jurisdictions. The “Ratemaking Activity” section of this Form 10-K describes our current rate strategy, progress towards implementing that strategy, and recent ratemaking initiatives in more detail. During fiscal 2025, we completed regulatory proceedings in our distribution segment resulting in a $256.4 million increase in annual operating income. Excluding the impact of the refund of excess deferred income taxes resulting from previously enacted tax reform legislation, our total fiscal 2025 annualized rate outcomes in our distribution segment were $245.6 million.\nOur distribution operations are also affected by the cost of natural gas. We are generally able to pass the cost of gas through to our customers without markup under purchased gas cost adjustment mechanisms; therefore, increases in the cost of gas are offset by a corresponding increase in revenues. Revenues in our Texas and Mississippi service areas include franchise fees and gross receipts taxes, which are calculated as a percentage of revenue (inclusive of gas costs). Therefore, the amount of these taxes included in revenues is influenced by the cost of gas and the level of gas sales volumes. We record the associated tax expense as a component of taxes, other than income.\nThe cost of gas typically does not have a direct impact on our operating income because these costs are recovered through our purchased gas cost adjustment mechanisms. However, higher gas costs may adversely impact our accounts receivable collections, resulting in higher bad debt expense. This risk is currently mitigated by rate design that allows us to collect from our customers the gas cost portion of our bad debt expense on approximately 89 percent of our residential and commercial revenues. Additionally, higher gas costs may require us to increase borrowings under our credit facilities, resulting in higher interest expense. Finally, higher gas costs, as well as competitive factors in the industry and general economic conditions may cause customers to conserve or, in the case of industrial consumers, to use alternative energy sources. \nReview of Financial and Operating Results\nFinancial and operational highlights for our distribution segment for the fiscal years ended September 30, 2025, 2024, and 2023 are presented below.\n27\nTable of Contents\n \nFor the Fiscal Year Ended September 30\n \n2025\n2024\n2023\n2025 vs. 2024\n2024 vs. 2023\n \n(In thousands, unless otherwise noted)\nOperating revenues\n$\n4,425,397 \n$\n3,915,141 \n$\n4,099,690 \n$\n510,256 \n$\n(184,549)\nPurchased gas cost\n1,854,323 \n1,620,515 \n2,061,920 \n233,808 \n(441,405)\nOperating expenses\n1,607,684 \n1,440,192 \n1,345,144 \n167,492 \n95,048 \nOperating income\n963,390 \n854,434 \n692,626 \n108,956 \n161,808 \nOther non-operating income\n33,578 \n30,106 \n24,988 \n3,472 \n5,118 \nInterest charges\n99,226 \n117,086 \n77,185 \n(17,860)\n39,901 \nIncome before income taxes\n897,742 \n767,454 \n640,429 \n130,288 \n127,025 \nIncome tax expense\n150,961 \n96,041 \n60,032 \n54,920 \n36,009 \nNet income\n$\n746,781 \n$\n671,413 \n$\n580,397 \n$\n75,368 \n$\n91,016 \nConsolidated distribution sales volumes — MMcf\n289,065 \n283,977 \n289,948 \n5,088 \n(5,971)\nConsolidated distribution transportation volumes — MMcf\n156,859 \n156,389 \n152,963 \n470 \n3,426 \nTotal consolidated distribution throughput — MMcf\n445,924 \n440,366 \n442,911 \n5,558 \n(2,545)\nConsolidated distribution average cost of gas per Mcf sold\n$\n6.41 \n$\n5.71 \n$\n7.11 \n$\n0.70 \n$\n(1.40)\nFiscal year ended September 30, 2025 compared with fiscal year ended September 30, 2024 \nOperating income for our distribution segment increased 12.8 percent. Key drivers for the change in operating income include:\n•\na $184.1 million increase in rate adjustments, primarily in our Mid-Tex Division.\n•\na $26.7 million increase related to residential customer growth, primarily in our Mid-Tex Division, and increased industrial load.\n•\na $46.3 million decrease in refunds of excess deferred taxes to customers, which is substantially offset in income tax expense.\nPartially offset by:\n•\na $78.0 million increase in depreciation expense and property taxes associated with increased capital investments.\n•\na $32.6 million increase in employee-related costs primarily due to an increase in headcount to support company growth.\n•\nan $18.6 million increase in system monitoring, line locating, and other compliance-related activities.\n•\na $17.8 million increase in bad debt expense due to a regulatory change in Mississippi in the first quarter of fiscal 2024 which significantly reduced bad debt expense in fiscal 2024, as discussed in Note 6 to the consolidated financial statements.\nAdditionally, our distribution segment's fiscal 2025 results were favorably impacted by $18.5 million as a result of Texas legislation that became effective during the third quarter of fiscal 2025 related to infrastructure spending.\nThe fiscal year ended September 30, 2024 compared with fiscal year ended September 30, 2023 for our distribution segment is described in Item 7 \"Management's Discussion and Analysis of Financial Condition and Results of Operations\" of our Annual Report on Form 10-K for the fiscal year ended September 30, 2024.\nThe following table shows our operating income by distribution division, in order of total rate base, for the fiscal years ended September 30, 2025, 2024, and 2023. The presentation of our distribution operating income is included for financial reporting purposes and may not be appropriate for ratemaking purposes.\n28\nTable of Contents\n \nFor the Fiscal Year Ended September 30\n \n2025\n2024\n2023\n2025 vs. 2024\n2024 vs. 2023\n \n(In thousands)\nMid-Tex\n$\n532,570 \n$\n464,616 \n$\n345,545 \n$\n67,954 \n$\n119,071 \nKentucky/Mid-States\n112,894 \n90,601 \n87,258 \n22,293 \n3,343 \nLouisiana\n109,268 \n94,362 \n80,942 \n14,906 \n13,420 \nWest Texas\n73,138 \n72,929 \n62,351 \n209 \n10,578 \nMississippi\n94,654 \n97,512 \n78,517 \n(2,858)\n18,995 \nColorado-Kansas\n37,341 \n42,816 \n40,674 \n(5,475)\n2,142 \nOther\n3,525 \n(8,402)\n(2,661)\n11,927 \n(5,741)\nTotal\n$\n963,390 \n$\n854,434 \n$\n692,626 \n$\n108,956 \n$\n161,808 \nPipeline and Storage Segment\nOur pipeline and storage segment consists of the pipeline and storage operations of our Atmos Pipeline–Texas Division (APT) and our natural gas transmission operations in Louisiana. APT is one of the largest intrastate pipeline operations in Texas with a heavy concentration in the established natural gas producing areas of central, northern, and eastern Texas, extending into or near the major producing areas of the Barnett Shale, the Texas Gulf Coast, and the Permian Basin of West Texas. APT provides transportation and storage services to our Mid-Tex Division, other third-party local distribution companies, industrial, and electric generation customers, as well as marketers and producers. Over 80 percent of this segment's revenues are derived from these APT services. These revenues are subject to traditional ratemaking governed by the Texas Railroad Commission (RRC). As part of its pipeline operations, APT owns and operates five underground storage facilities in Texas.\nOur natural gas transmission operations in Louisiana are comprised of a 21-mile pipeline located in the New Orleans, Louisiana area that is primarily used to aggregate gas supply for our distribution division in Louisiana under a long-term contract and, on a more limited basis, to third parties. The demand fee charged to our Louisiana distribution division for these services is subject to regulatory approval by the Louisiana Public Service Commission. We also manage two asset management plans, which have been approved by applicable state regulatory commissions. Generally, these asset management plans require us to share with our distribution customers a significant portion of the cost savings earned from these arrangements.\nOur pipeline and storage segment is impacted by seasonal weather patterns, competitive factors in the energy industry, and economic conditions in our Texas and Louisiana service areas. Natural gas prices do not directly impact the results of this segment as revenues are derived from the transportation and storage of natural gas. However, natural gas prices and demand for natural gas could influence the level of drilling activity in the supply areas that we serve, which may influence the level of throughput we may be able to transport on our pipelines. Further, natural gas price differences between the various hubs that we serve in Texas could influence the volumes of gas transported for shippers through our Texas pipeline system and rates for such transportation.\nThe results of APT are also significantly impacted by the natural gas requirements of its local distribution company customers. Additionally, its operations may be impacted by the timing of when costs and expenses are incurred and when these costs and expenses are recovered through its tariffs.  \nAPT annually uses GRIP to recover capital costs incurred in the prior calendar year. On February 26, 2025, APT made a GRIP filing that covered changes in net property, plant and equipment investment from January 1, 2024 through December 31, 2024 with a requested increase in operating income of $77.2 million. On June 17, 2025, the Texas Railroad Commission (RRC) approved the Company's GRIP filing.\nThe demand fee our Louisiana natural gas transmission pipeline charges to our Louisiana distribution division increases five percent annually and has been approved by the Louisiana Public Service Commission until September 30, 2027.\nReview of Financial and Operating Results\nFinancial and operational highlights for our pipeline and storage segment for the fiscal years ended September 30, 2025, 2024, and 2023 are presented below.\n29\nTable of Contents\n \nFor the Fiscal Year Ended September 30\n \n2025\n2024\n2023\n2025 vs. 2024\n2024 vs. 2023\n \n(In thousands, unless otherwise noted)\nMid-Tex / Affiliate transportation revenue\n$\n815,628 \n$\n715,117 \n$\n621,987 \n$\n100,511 \n$\n93,130 \nThird-party transportation revenue\n238,667 \n210,568 \n154,018 \n28,099 \n56,550 \nOther revenue\n11,005 \n12,344 \n9,169 \n(1,339)\n3,175 \nTotal operating revenues\n1,065,300 \n938,029 \n785,174 \n127,271 \n152,855 \nTotal purchased gas cost\n(1,346)\n146 \n(1,220)\n(1,492)\n1,366 \nOperating expenses\n470,065 \n436,955 \n411,873 \n33,110 \n25,082 \nOperating income\n596,581 \n500,928 \n374,521 \n95,653 \n126,407 \nOther non-operating income\n56,163 \n40,940 \n44,787 \n15,223 \n(3,847)\nInterest charges\n72,452 \n73,546 \n60,096 \n(1,094)\n13,450 \nIncome before income taxes\n580,292 \n468,322 \n359,212 \n111,970 \n109,110 \nIncome tax expense\n128,319 \n96,840 \n53,747 \n31,479 \n43,093 \nNet income\n$\n451,973 \n$\n371,482 \n$\n305,465 \n$\n80,491 \n$\n66,017 \nGross pipeline transportation volumes — MMcf\n907,536 \n831,534 \n834,847 \n76,002 \n(3,313)\nConsolidated pipeline transportation volumes — MMcf\n709,645 \n635,728 \n635,508 \n73,917 \n220 \nFiscal year ended September 30, 2025 compared with fiscal year ended September 30, 2024\nOperating income for our pipeline and storage segment increased 19.1 percent. Key drivers for the change in operating income include:\n•\nan $89.4 million increase primarily due to rate adjustments from the GRIP filings approved in May 2024 and June 2025, the System Safety and Integrity Rider filing approved in November 2024, and the rate case approved in December 2023.\n•\na $7.7 million increase in APT's through-system activities.\n•\na $9.1 million decrease in refunds of excess deferred taxes to customers, which is substantially offset in income tax expense.\n•\na $16.5 million increase due to higher capacity contracted by tariff-based customers due to their increased peak day demand.\nPartially offset by:\n•\na $23.5 million increase in depreciation expense and property taxes  associated with increased capital investments.\n•\nan $18.9 million increase in expenses recognized as a result of the System Safety and Integrity Rider filing approved in November 2024, which is offset in operating revenues.\nOther non-operating income increased $15.2 million primarily due to higher AFUDC largely as a result of increased capital spending. Additionally, our pipeline and storage segment's fiscal 2025 results were favorably impacted by $7.7 million as a result of Texas legislation that became effective during the third quarter of fiscal 2025 related to infrastructure spending.\nThe fiscal year ended September 30, 2024 compared with fiscal year ended September 30, 2023 for our pipeline and storage segment is described in Item 7 \"Management's Discussion and Analysis of Financial Condition and Results of Operations\" of our Annual Report on Form 10-K for the fiscal year ended September 30, 2024.\n30\nTable of Contents\nLIQUIDITY AND CAPITAL RESOURCES\nThe liquidity required to fund our working capital, capital expenditures, and other cash needs is provided from a combination of internally generated cash flows and external debt and equity financing. Additionally, we have a $1.5 billion commercial paper program and four committed revolving credit facilities with $3.1 billion in total availability from third-party lenders. The commercial paper program and credit facilities provide cost-effective, short-term financing until it can be replaced with a balance of long-term debt and equity financing that achieves the Company's desired capital structure. Additionally, we have various uncommitted trade credit lines with our gas suppliers that we utilize to purchase natural gas on a monthly basis. \nWe have a shelf registration statement on file with the Securities and Exchange Commission (SEC) that allows us to issue up to $8.0 billion in common stock and/or debt securities. As of the date of this report, $5.2 billion\n of securities remained available for issuance under the shelf registration statement, which expires December 3, 2027.\nWe also have an at-the-market (ATM) equity sales program that allows us to issue and sell shares of our common stock up to an aggregate offering price of $1.7 billion (including shares of common stock that may be sold pursuant to forward sale agreements entered into in connection with the ATM equity sales program), which expires December 3, 2027. As of the date of this report, $828.5 million of equity is available for issuance under this ATM equity sales program. Additionally, as of September 30, 2025, we had $1.6 billion in available proceeds from outstanding forward sale agreements issued under the ATM program.\nThe liquidity provided by these sources is expected to be sufficient to fund the Company's working capital needs and capital expenditures program. Additionally, we expect to continue to be able to obtain financing upon reasonable terms as necessary.\nThe following table presents our capitalization as of September 30, 2025 and 2024:\n \nSeptember 30\n \n2025\n2024\n \n(In thousands, except percentages)\nShort-term debt\n$\n— \n— \n%\n$\n— \n— \n%\nLong-term debt \n(1)\n8,918,944 \n39.7 \n%\n7,785,297 \n39.0 \n%\nShareholders’ equity\n13,558,890 \n60.3 \n%\n12,157,669 \n61.0 \n%\nTotal capitalization, including short-term debt\n$\n22,477,834 \n100.0 \n%\n$\n19,942,966 \n100.0 \n%\n(1)\nInclusive of our finance leases, but exclusive of AEK's securitized long-term debt.\nCash Flows\nOur internally generated funds may change in the future due to a number of factors, some of which we cannot control. These factors include regulatory changes, the price for our services, the demand for such products and services, margin requirements resulting from significant changes in commodity prices, operational risks, and other factors.\nCash flows from operating, investing, and financing activities for the years ended September 30, 2025, 2024, and 2023 are presented below.\n \nFor the Fiscal Year Ended September 30\n \n2025\n2024\n2023\n2025 vs. 2024\n2024 vs. 2023\n \n(In thousands)\nTotal cash provided by (used in)\nOperating activities\n$\n2,049,456 \n$\n1,733,746 \n$\n3,459,743 \n$\n315,710 \n$\n(1,725,997)\nInvesting activities\n(3,561,282)\n(2,922,769)\n(2,795,280)\n(638,513)\n(127,489)\nFinancing activities\n1,406,773 \n1,478,631 \n(696,769)\n(71,858)\n2,175,400 \nChange in cash and cash equivalents and restricted cash and cash equivalents\n(105,053)\n289,608 \n(32,306)\n(394,661)\n321,914 \nCash and cash equivalents and restricted cash and cash equivalents at beginning of period\n308,856 \n19,248 \n51,554 \n289,608 \n(32,306)\nCash and cash equivalents and restricted cash and cash equivalents at end of period\n$\n203,803 \n$\n308,856 \n$\n19,248 \n$\n(105,053)\n$\n289,608 \n31\nTable of Contents\nCash flows for the fiscal year ended September 30, 2024 compared with fiscal year ended September 30, 2023 is described in Item 7 \"Management's Discussion and Analysis of Financial Condition and Results of Operations\" of our Annual Report on Form 10-K for the fiscal year ended September 30, 2024.\nCash flows from operating activities\nFor the fiscal year ended September 30, 2025, cash flow provided by operating activities was $2,049.5 million compared with $1,733.7 million in the prior year. The year-over-year increase in operating cash flow primarily reflects the positive effects of successful rate case outcomes achieved in fiscal 2025 and 2024.\nCash flows from investing activities\nOur capital expenditures are primarily used to improve the safety and reliability of our distribution and transmission system through pipeline replacement and system modernization and to enhance and expand our system to meet customer needs. Over the last three fiscal years, approximately 85 percent of our capital spending has been committed to improving the safety and reliability of our system. \nFor the fiscal year ended September 30, 2025, we had $3.6 billion in capital expenditures compared with $2.9 billion for the fiscal year ended September 30, 2024. Capital spending in our distribution segment increased $413.4 million, primarily as a result of increased system modernization and customer growth spending. Capital spending in our pipeline and storage segment increased $210.9 million, primarily due to increased spending for pipeline system safety and reliability in Texas.\nCash flows from financing activities\nOur financing activities provided $1,406.8 million of cash for fiscal year 2025 compared with $1,478.6 million of cash provided by financing activities for fiscal year 2024.\nDuring the fiscal year ended September 30, 2025, we received approximately $1.8 billion in net proceeds from the issuance of long-term debt and equity. We completed a public offering of $650 million of 5.00% senior notes due December 2054, and received net proceeds from the offering, after the underwriting discount and offering expenses, of $639.4 million. We also completed a public offering of $500 million of 5.20% senior notes due August 2035, and received net proceeds from the offering, after the underwriting discount and offering expenses, of $493.7 million. Additionally, during the fiscal year ended September 30, 2025, we settled 5,931,289 shares that had been sold on a forward basis for net proceeds of $698.5 million. The net proceeds were used primarily to support capital spending and for other general corporate purposes. We also received $122.9 million from the settlement of forward starting interest rate swaps related to a debt issuance completed in October 2025. Cash dividends increased due to an 8.1 percent increase in our dividend rate and an increase in shares outstanding.\nDuring the fiscal year ended September 30, 2024, we received approximately $2.0 billion in net proceeds from the issuance of long-term debt and equity. We completed a public offering of $500 million of 6.20% senior notes due November 2053 and $400 million of 5.90% senior notes due November 2033, and received net proceeds from the offering, after the underwriting discount and offering expenses, of $889.4 million. We also completed a public offering of $325 million of 5.90% senior notes due November 2033, and received net proceeds from the offering, after the underwriting discount and offering expenses, of $339.0 million. Additionally, during the year ended September 30, 2024, we settled 6,401,469 shares that had been sold on a forward basis for net proceeds of $750.0 million. The net proceeds were used primarily to support capital spending and for other general corporate purposes. We also received $231.1 million from the settlement of forward starting interest rate swaps related to a debt issuance completed in October 2024. Cash dividends increased due to an 8.8 percent increase in our dividend rate and an increase in shares outstanding.\nThe following table shows the number of shares issued for the fiscal years ended September 30, 2025, 2024, and 2023:\n \nFor the Fiscal Year Ended September 30\n \n2025\n2024\n2023\nShares issued:\nDirect Stock Purchase Plan\n47,422 \n60,756 \n64,871 \nRetirement Savings Plan and Trust\n54,565 \n67,134 \n69,716 \n1998 Long-Term Incentive Plan (LTIP)\n276,263 \n236,703 \n189,337 \nEquity Issuance \n(1)\n5,931,289 \n6,401,469 \n7,272,261 \nTotal shares issued\n6,309,539 \n6,766,062 \n7,596,185 \n(1)\nShare amounts do not include shares issued under forward sale agreements until the shares have been settled.\n32\nTable of Contents\nCredit Ratings\nOur credit ratings directly affect our ability to obtain short-term and long-term financing, in addition to the cost of such financing. In determining our credit ratings, the rating agencies consider a number of quantitative factors, including but not limited to, debt to total capitalization, operating cash flow relative to outstanding debt, operating cash flow coverage of interest, and operating cash flow less dividends to debt. In addition, the rating agencies consider qualitative factors such as consistency of our earnings over time, the risks associated with our business, and the regulatory structures that govern our rates in the states where we operate.\nOur debt is rated by two rating agencies: Standard & Poor’s Corporation (S&P) and Moody’s Investors Service (Moody’s). On April 2, 2025, Moody's reaffirmed its short-term credit ratings, downgraded our long-term credit rating to A2, and placed our ratings under stable outlook. Currently, our outlook and current debt ratings, which are all considered investment grade, are as follows:\n \n  \nS&P\nMoody’s\nSenior unsecured long-term debt\n  \nA-\nA2\nShort-term debt\n  \nA-2\nP-1\nOutlook\nStable\nStable\n A significant degradation in our operating performance or a significant reduction in our liquidity caused by more limited access to the private and public credit markets as a result of deteriorating global or national financial and credit conditions could trigger a negative change in our ratings outlook or even a reduction in our credit ratings by the two credit rating agencies. This would mean more limited access to the private and public credit markets and an increase in the costs of such borrowings.\nA credit rating is not a recommendation to buy, sell or hold securities. The highest investment grade credit rating is AAA for S&P and Aaa for Moody’s. The lowest investment grade credit rating is BBB- for S&P and Baa3 for Moody’s. Our credit ratings may be revised or withdrawn at any time by the rating agencies, and each rating should be evaluated independently of any other rating. There can be no assurance that a rating will remain in effect for any given period of time or that a rating will not be lowered, or withdrawn entirely, by a rating agency if, in its judgment, circumstances so warrant.\nDebt Covenants\nWe were in compliance with all of our debt covenants as of September 30, 2025. Our debt covenants are described in Note 8 to the consolidated financial statements.\nContractual Obligations and Commercial Commitments\nThe following table provides information about contractual obligations and commercial commitments at September 30, 2025.\n \nPayments Due by Period\nTotal\nLess than 1\nyear\n1-3 years    \n3-5 years\nMore than 5\nyears\n \n \n \n(In thousands)\n \n \nContractual Obligations\nLong-term debt \n(1)\n$\n8,935,000 \n$\n10,000 \n$\n650,000 \n$\n500,000 \n$\n7,775,000 \nSecuritized long-term debt\n77,003 \n8,767 \n18,647 \n20,645 \n28,944 \nInterest charges \n(2)\n7,867,907 \n418,219 \n827,500 \n779,125 \n5,843,063 \nInterest charges on securitized long-term debt\n16,841 \n3,860 \n6,343 \n4,345 \n2,293 \nFinance leases \n(3)\n63,067 \n3,502 \n7,203 \n7,485 \n44,877 \nOperating leases \n(4)\n375,802 \n56,546 \n99,453 \n75,059 \n144,744 \nFinancial instrument obligations \n(5)\n6,485 \n6,339 \n146 \n— \n— \nPension and postretirement benefit plan contributions \n(6)\n286,856 \n30,175 \n75,661 \n45,773 \n135,247 \nUncertain tax positions \n(7)\n60,332 \n— \n60,332 \n— \n— \nTotal contractual obligations \n$\n17,689,293 \n$\n537,408 \n$\n1,745,285 \n$\n1,432,432 \n$\n13,974,168 \n \n(1)\nLong-term debt excludes our finance lease obligations, which are separately reported within this table. See Note 8 to the consolidated financial statements for further details. \n33\nTable of Contents\n(2)\nInterest charges were calculated using the coupon rate for each debt issuance through the contractual maturity date.\n(3)\nFinance lease payments shown above include interest totaling $15.8 million. See Note 7 to the consolidated financial statements.\n(4)\nOperating lease payments shown above include interest totaling $68.2 million. S\nee Note \n7 to the consolidated financial statements.\n(5)\nRepresents liabilities for natural gas commodity financial instruments that were valued as of September 30, 2025. The ultimate settlement amounts of these remaining liabilities are unknown because they are subject to continuing market risk until the financial instruments are settled.\n(6)\nRepresents expected contributions to our defined benefit and postretirement benefit plans, which are discussed in Note 11 to the consolidated financial statements.\n(7)\nRepresents liabilities associated with uncertain tax positions claimed or expected to be claimed on tax returns.  The amount does not include interest and penalties that may be applied to these positions. See Note 15 to the consolidated financial statements for further details.\nWe maintain supply contracts with several vendors that generally cover a period of up to one year. Commitments for estimated base gas volumes are established under these contracts on a monthly basis at contractually negotiated prices. Commitments for incremental daily purchases are made as necessary during the month in accordance with the terms of individual contracts. Our Mid-Tex Division also maintains a limited number of long-term supply contracts to ensure a reliable source of gas for our customers in its service area which obligate it to purchase specified volumes at market and fixed prices.  At September 30, 2025, we were committed to purchase 73.4 Bcf within one year and 114.9 Bcf within two to three years under indexed contracts. At September 30, 2025, we were committed to purchase 21.0 Bcf within one year under fixed price contracts with a weighted average price of $2.70 per Mcf. \nRisk Management Activities\nIn our distribution and pipeline and storage segments, we use a combination of physical storage, fixed physical contracts, and fixed financial contracts to reduce our exposure to unusually large winter-period gas price increases. Additionally, we manage interest rate risk by entering into financial instruments to effectively fix the Treasury yield component of the interest cost associated with anticipated financings.\nWe record our financial instruments as a component of risk management assets and liabilities, which are classified as current or noncurrent based upon the anticipated settlement date of the underlying financial instrument. Substantially all of our financial instruments are valued using external market quotes and indices.\nThe following table shows the components of the change in fair value of our financial instruments for the fiscal year ended September 30, 2025 (in thousands):\nFair value of contracts at September 30, 2024\n$\n88,651 \nContracts realized/settled\n(130,755)\nFair value of new contracts\n5,181 \nOther changes in value\n40,335 \nFair value of contracts at September 30, 2025\n3,412 \nNetting of cash collateral\n— \nCash collateral and fair value of contracts at September 30, 2025\n$\n3,412 \nThe fair value of our financial instruments at September 30, 2025, is presented below by time period and fair value source:\n \nFair Value of Contracts at September 30, 2025\n \nMaturity in years\n \nSource of Fair Value\nLess\nthan 1\n1-3\n4-5\nGreater\nthan 5\nTotal\nFair\nValue\n \n(In thousands)\nPrices actively quoted\n$\n(1,036)\n$\n4,448 \n$\n— \n$\n— \n$\n3,412 \nPrices based on models and other valuation methods\n— \n— \n— \n— \n— \nTotal Fair Value\n$\n(1,036)\n$\n4,448 \n$\n— \n$\n— \n$\n3,412 \nRECENT ACCOUNTING DEVELOPMENTS\nRecent accounting developments and their impact on our financial position, results of operations and cash flows are described in Note 2 to the consolidated financial statements.",
  "item2": null
}