{
  "source_file": "avb-20241231.htm",
  "form_type": "10-K",
  "item1": "ITEM 1.    BUSINESS\nGeneral\nAvalonBay Communities, Inc. (the \"Company,\" \"we,\" \"our\" and \"us\" which terms, unless the context otherwise requires, refer to AvalonBay Communities, Inc. together with its subsidiaries), is a Maryland corporation that has elected to be treated as a real estate investment trust (\"REIT\") for federal income tax purposes. We develop, redevelop, acquire, own and operate apartment communities in New England, the New York/New Jersey metro area, the Mid-Atlantic, the Pacific Northwest, and Northern and Southern California, as well as in our expansion regions of Raleigh-Durham and Charlotte, North Carolina, Southeast Florida, Dallas and Austin, Texas, and Denver, Colorado. We focus on leading metropolitan areas that we believe are generally characterized by growing employment in high wage sectors of the economy, higher cost of home ownership and a diverse and vibrant quality of life. We believe these market characteristics have offered, and will continue to offer, the opportunity for superior risk-adjusted returns over the long-term on apartment community investments relative to other markets that do not have these characteristics. \nAt January 31, 2025, we owned or held a direct or indirect ownership interest in:\n•\n284 operating apartment communities containing 86,111 apartment homes in 11 states and the District of Columbia, of which 275 communities containing 83,389 apartment homes were consolidated for financial reporting purposes and nine communities containing 2,722 apartment homes were held by unconsolidated entities in which we hold an ownership interest.\n•\n21 wholly-owned development apartment communities that are under construction or completed and in lease-up and are expected to contain an aggregate of 7,305 apartment homes when completed.\n•\nRights to develop an additional 30 communities that, if developed as expected, will contain 9,336 apartment homes.\nWe generally obtain ownership in an apartment community by developing a new community on either vacant land or land with improvements that we raze, or by acquiring an existing community. In selecting sites for development or acquisition, we favor locations that are near expanding employment centers and convenient to transportation, recreation areas, entertainment, shopping and dining.\nOur principal financial goal is to increase long-term shareholder value through the development, redevelopment, acquisition, ownership, operation and asset management and, when appropriate, disposition of apartment communities in our markets. To help meet this goal, we regularly (i) monitor our investment allocation by geographic market and product type, (ii) develop, redevelop and acquire interests in apartment communities in our selected markets, (iii) efficiently operate our communities to maximize resident satisfaction and shareholder return, (iv) selectively sell apartment communities that no longer meet our long-term strategy or when opportunities are presented to realize a portion of the value created through our investment and redeploy the proceeds from those sales and (v) maintain a capital structure that we believe is aligned with our business risks and allows us to maintain continuous access to cost-effective capital. We also seek to generate additional shareholder value from investments in other real estate-related ventures, including through our Structured Investment Program (\"SIP\"), our platform to provide mezzanine loans or preferred equity to third-party multifamily developers in our existing regions. We undertake our development and redevelopment activities primarily through in-house development and redevelopment teams, and buy and dispose of assets through our in-house investments platform. We believe that our organizational structure, which includes dedicated development and operational teams, and strong culture are key differentiators. We pursue our development, redevelopment, investment and operating activities with the purpose of \"Creating a Better Way to Live.\"\n1\nTable of Contents\nWe seek to be the leading rental housing company in select U.S. markets by delivering distinctive experiences that customers value, creating a workplace where associates thrive, and achieving superior results for shareholders. We focus on markets that are characterized by growing employment in high wage sectors of the economy, higher home prices and a diverse and vibrant quality of life. From an operating perspective, we seek to deliver seamless, personalized experiences for our residents on an efficient and effective basis by our resident-focused on-site associates that are supported by our centralized shared services operating organization and flexible technology platform that incorporates automation and artificial intelligence. We operate our apartment communities under four core brands:\n•\nAvalon, our core \"Avalon\" brand, focuses on upscale apartment living and high end amenities and services;\n•\nAVA targets customers in high energy, transit-served neighborhoods and generally feature smaller apartments, many of which are designed for roommate living, and a variety of active common spaces that encourage socialization;\n•\neaves by Avalon is targeted to the cost conscious, \"value\" segment primarily in suburban areas; and\n•\nKanso is designed to create an apartment living experience that offers simplicity without sacrifice at a more moderate price point, featuring high-quality apartment homes, limited-to-no community amenities and a low-touch, largely self- service operating model that leverages technology and smart access.\nWe believe that this branding differentiation allows us to target our product offerings to multiple customer groups and submarkets within our existing geographic footprint.\nDuring the three years ended December 31, 2024, we: \n•\nacquired 13 apartment communities, excluding unconsolidated investments; \n•\ndisposed of 21 apartment communities, excluding unconsolidated investments;\n•\nrealized our pro rata share of the gain from the sale of three communities owned by unconsolidated real estate entities; and\n•\ncompleted the development of 22 apartment communities, including unconsolidated investments, and the redevelopment of two apartment communities.\nA more detailed description of our unconsolidated real estate entities and the related investment activity can be found in Note 5, \"Investments,\" of the Consolidated Financial Statements in Item 8 of this report and in Item 7. \"Management's Discussion and Analysis of Financial Condition and Results of Operations.\"\nA further discussion of our development, redevelopment, disposition, acquisition, operating and property management and related strategies follows.\nDevelopment Strategy.\n    We select land for development and follow established procedures that we believe minimize both the cost and the risks of development. As one of the largest developers of multifamily rental apartment communities in our selected markets, we maintain regional offices to identify and support development opportunities through local market presence and access to local market information. In addition to our principal executive office in Arlington, Virginia, we also have regional offices, administrative offices or specialty offices, including offices that are in or near the following cities:\n2 \nTable of Contents\n•\nAustin, Texas;\n•\nBellevue, Washington;\n•\nBoston, Massachusetts;\n•\nDurham, North Carolina;\n•\nDenver, Colorado;\n•\nFort Lauderdale, Florida;\n•\nIrvine, California;\n•\nLos Angeles, California;\n•\nNew York, New York;\n•\nSan Antonio, Texas;\n•\nSan Francisco, California;\n•\nSan Jose, California;\n•\nVirginia Beach, Virginia; and\n•\nWestfield, New Jersey.\nAfter selecting a site for development, we usually negotiate for the right to acquire the site either through an option or a long-term conditional contract. Options and long-term conditional contracts generally allow us to acquire an interest in the site after the completion of entitlements and shortly before the start of construction, which reduces development-related risks and preserves capital. However, as a result of competitive market conditions for land suitable for development, we have sometimes acquired and held land prior to construction for extended periods while entitlements are obtained. When acquiring improved land with existing commercial uses prior to development, any rent received in excess of expenses from these operations, which we consider to be incidental, is accounted for as a reduction in our investment in the development pursuit and not as net income. Any expenses relating to these operations, in excess of any rents received, are recognized in net income. In addition, we have previously identified, and may again in the future identify, opportunities to increase value by expanding the density of certain existing operating communities. We have also participated, and may in the future participate, in master planned or other large multi-use developments where we commit to build infrastructure (such as roads) to be used by other participants or commit to act as construction manager or general contractor in building structures or spaces for third parties (such as unimproved ground floor commercial space, municipal garages or parks). Costs we incur in connection with these activities may be accounted for as additional invested capital in the community or we may earn fee income for providing these services. Particularly with large scale, urban in-fill developments, we may engage in significant environmental remediation efforts to prepare a site for construction. For further discussion of our Development Rights, refer to Item 2. \"Properties\" in this report.\nWe generally act as our own development manager, general contractor and construction manager directly (although we may use a wholly-owned subsidiary), and will elect to use a third-party developer or general contractor where we believe it is beneficial to do so, such as in our expansion regions where we may have limited resources or scale. We believe direct involvement in construction enables us to achieve higher construction quality, greater control over construction schedules and cost savings. Our development, property management and construction teams monitor construction progress to ensure quality workmanship and a smooth and timely transition into the leasing and operating phase.\nThroughout this report, the term \"development\" is used to refer to the entire property development cycle, including pursuit of zoning approvals, procurement of architectural and engineering designs and the construction process. References to \"construction\" refer to the actual construction of the property, which is only one element of the development cycle.\nRedevelopment Strategy.\n    When we undertake the redevelopment of a community, our goal is to renovate and/or rebuild an existing community so that our total investment is generally below replacement cost and the community is well positioned in the market to achieve attractive returns on our capital. In addition to large scale redevelopment where a community is classified as a redevelopment, we undertake smaller scale redevelopment activities related to the apartment interiors to enhance the resident experience at our operating communities. We have dedicated redevelopment teams and procedures that are intended to control both the cost and risks of redevelopment. Our redevelopment teams, which include redevelopment, construction and property management personnel, monitor redevelopment progress. \nThroughout this report, the term \"redevelopment\" is used to refer to the entire redevelopment cycle, including planning and procurement of architectural and engineering designs, budgeting and actual renovation work. The actual renovation work is referred to as \"reconstruction,\" which is only one element of the redevelopment cycle.\n3 \nTable of Contents\nDisposition Strategy.\n    We sell assets that no longer meet our long-term strategy or when real estate market conditions are favorable, and we redeploy the proceeds from those sales to develop, redevelop and acquire communities and to rebalance our portfolio across or within geographic regions. This also allows us to realize a portion of the value created through our investments and provides additional liquidity by redeploying the net proceeds from our dispositions in lieu of raising that amount of capital externally. When we decide to sell a community, we generally solicit competing bids from unrelated parties for these individual assets and consider the sales price and other terms of each proposal.\nAcquisition Strategy.\n    Our core competencies in development and redevelopment discussed above allow us to be selective in the acquisitions we target. Acquisitions allow us to achieve rapid penetration into markets in which we desire an increased presence. Acquisitions (and dispositions) also help us achieve our desired product mix or rebalance our portfolio. While we are primarily focused on acquisitions in our expansion regions of Raleigh-Durham and Charlotte, North Carolina, Southeast Florida, Dallas and Austin, Texas, and Denver, Colorado, we may pursue additional investments in our established regions based on market conditions.\nOperating & Property Management Strategy.\n    We seek to increase operating income through innovative, proactive property management that will result in higher revenue from communities while constraining operating expenses. Our principal strategies to maximize operating income include:\n•\nfocusing on associate engagement and resident satisfaction;\n•\nemploying an innovative and continually evolving operating model that combines effective onsite associates with the capabilities of our centralized shared services center, technology platform and digital offerings and various automation technologies including the use of artificial intelligence (\"AI\");\n•\nutilizing data science and our operating experience to optimize Net Operating Income (\"NOI\") from the portfolio, including making operating decisions that reduce customer acquisition, transaction and retention costs; \n•\nstaggering lease terms such that lease expirations are matched with seasonal demand; and\n•\ndelivering high occupancy with premium pricing for various customer segments.\nConstraining growth in operating expenses is another way in which we seek to increase earnings growth. Growth in our portfolio and the resulting increase in revenue allows for fixed operating costs to be spread over a larger volume of revenue, thereby increasing operating margins. We constrain growth in operating expenses in a variety of ways, which include, but are not limited to, the following:\n•\npurchase order controls, including acquiring goods and services from pre-approved vendors;\n•\nnational negotiated contracts and bulk purchases where possible;\n•\nbidding third-party contracts on a volume basis;\n•\nretaining residents through high levels of service, which reduces apartment turnover costs, marketing and vacant apartment utility costs;\n•\nperforming turnover work in-house or hiring third parties, generally considering the most cost-effective approach as well as expertise needed to perform the work;\n•\nregular preventive maintenance to maximize resident safety and satisfaction and property and equipment life; \n•\ncentralization of lease renewal activity, as well as many community administration and support tasks at our shared service center;\n•\npursuing real estate tax appeals; \n•\ninstalling high efficiency lighting and water fixtures, cogeneration systems and solar panels; and\n•\nimplementing technology for resident and prospect services such as package lockers and self-guided or virtual tours.\nOn-site property management teams receive bonuses based largely upon the revenue, expense, NOI, prospect conversion, resident retention and customer service metrics produced at their respective communities. We use and continuously seek ways to improve technology applications to help manage our communities, believing that technology applications can improve the delivery and efficiency of our services and aid in the accurate collection of financial and resident data, which will enable us to maximize revenue and control costs through careful leasing decisions, maintenance decisions and financial management.\nWe generally manage the operation and leasing activity of our communities directly (although we may use a wholly-owned subsidiary) both for ourselves and the joint ventures and partnerships of which we are a member or a partner. From time to time, we may engage a third party to manage leasing and/or maintenance activity at one or more of our communities, such as in our expansion regions where we may have limited resources or scale.\n4 \nTable of Contents\nFrom time to time we also pursue or arrange ancillary services for our residents to provide additional revenue sources or increase resident satisfaction. We provide such non-customary services to residents or share in the revenue or income from such services through a taxable REIT subsidiary (\"TRS\"), which is a subsidiary that is treated as a \"C corporation\" subject to federal income taxes. See \"Tax Matters\" below.\nFinancing Strategy.\n    Our financing strategy is to maintain a capital structure that provides financial flexibility to help ensure we can select cost-effective capital market options that are well matched to our business risks. We estimate that our short-term liquidity needs will be met from cash on hand, borrowings under our $2,250,000,000 revolving variable rate unsecured credit facility (the \"Credit Facility\") and our $500,000,000 unsecured commercial paper (\"CP\") note program (the \"Commercial Paper Program\") which is backstopped by our commitment to maintain available capacity under the Credit Facility for any amounts of CP outstanding, sales of current operating communities and/or issuance of additional debt or equity securities. A determination to engage in an equity or debt offering depends on a variety of factors such as general market and economic conditions, our short and long-term liquidity needs, the relative costs of debt and equity capital and growth opportunities. A summary of debt and equity activity for the last three years is reflected on our Consolidated Statement of Cash Flows of the Consolidated Financial Statements set forth in Item 8 of this report.\nWe have entered into, and may continue in the future to enter into, joint ventures (including limited liability companies or partnerships) through which we would develop and/or own an indirect economic interest of less than 100% of the community or communities owned directly by such joint ventures. Our decision to either hold an apartment community in fee simple or to have an indirect interest in the community through a joint venture is based on a variety of factors and considerations, including: (i) the economic and tax terms required by a seller of land or of a community; (ii) our desire to diversify our portfolio of communities by market, submarket and product type; (iii) our desire at times to preserve our capital resources to maintain liquidity or balance sheet strength; and (iv) our projection, in some circumstances, that we will achieve higher returns on our invested capital or reduce our risk if a joint venture vehicle is used. Investments in joint ventures are not limited to a specified percentage of our assets. Each joint venture agreement is individually negotiated, and our ability to operate and/or dispose of a community in our sole discretion may be limited to varying degrees depending on the terms of the joint venture agreement.\nIn addition, from time to time, we may offer shares of our equity securities, debt securities or options to purchase stock in exchange for property. We may also acquire properties in exchange for properties we currently own.\nOther Strategies and Activities.\n    While we emphasize equity real estate investments in rental apartment communities, we have the ability to invest in other activities and to make non-equity investments, including the following:\n•\nStructured Investment Program\n: while we generally invest in multifamily real estate through fee simple ownership or an equity investment in a joint venture, we operate an investment platform through which we provide mezzanine loans or preferred equity to third-party multifamily developers in our existing regions.\n•\nCommercial space\n: we develop, own and lease commercial space at our communities when either (i) the highest and best use of the space is for commercial (e.g., street level in an urban area); (ii) we believe the commercial space will enhance the attractiveness of the community to residents; or (iii) some component of commercial space is required to obtain entitlements to build apartment homes.\n•\nProperty technology and environmentally focused companies and investment management funds\n: we have also invested, either through a wholly-owned TRS, or in an investment vehicle that has elected to be treated as a TRS, in companies (and in venture funds that invest in companies) that provide technology services to the real estate industry, and we have invested, through a TRS, in environmentally focused companies and investment management funds to further our sustainability efforts and learning.\n•\nFor-sale real estate development\n: we may also develop a property in conjunction with another real estate company that will own and operate the commercial or for-sale residential components of a mixed-use building or project that we help develop. We may from time to time, through a TRS, develop real estate and hold it for sale upon completion if we believe that this will be the best use or disposition opportunity for the property.\nWe have not engaged in trading, underwriting or agency distribution or sale of securities of other issuers and do not intend to do so. At all times we intend to make investments in a manner so as to qualify as a REIT unless, because of circumstances or changes to the Internal Revenue Code of 1986, as amended (the \"Code\") (or the Treasury Regulations thereunder), our Board of Directors determines that it is no longer in our best interest to qualify as a REIT.\n5 \nTable of Contents\nWe conduct many of the administrative functions associated with our property operations (including billing, collections, and response to resident inquiries) through an internally operated shared services center, rather than having on-site associates conduct such activities. We believe this centralized platform allows our on-site associates to focus more on current and prospective resident services, while at the same time enabling us to reduce costs, mitigate risk and increase our availability and responsiveness to our residents. Since mid-2023, we have provided various back-office, financial administrative support services for a third party leveraging the economies of scale at our center to produce an additional revenue stream.\nTax Matters\nWe filed an election with our 1994 federal income tax return to be taxed as a REIT under the Code and intend to maintain our qualification as a REIT in the future. As a REIT, with limited exceptions, such as those described under \"Operating & Property Management Strategy\" above, we will not be taxed under federal and certain state income tax laws at the corporate level on our taxable net income to the extent such taxable net income is distributed to our stockholders. We expect to make sufficient distributions to avoid income tax at the corporate level. While we believe that we are organized and qualified as a REIT and we intend to operate in a manner that will allow us to continue to qualify as a REIT, there can be no assurance that we will be successful in this regard. Qualification as a REIT involves the application of highly technical and complex provisions of the Code for which there are limited judicial and administrative interpretations and involves the determination of a variety of factual matters and circumstances not entirely within our control.\nCompetition\nWe face competition from other real estate investors, including insurance companies, pension and investment funds, REITs both in the multifamily as well as other sectors, and other well capitalized investors, to acquire and develop apartment communities and acquire land for future development. As an owner and operator of apartment communities, we also face competition for prospective residents from other operators whose communities may be perceived to offer a better location or better amenities or whose pricing may be perceived as a better value given the quality, location, terms and amenities that the prospective resident seeks. We also compete against condominiums and single-family homes that are for sale or rent, including those offered through online platforms. Although we often compete against large, sophisticated developers and operators for development opportunities and for prospective residents, real estate developers and operators of any size can provide effective competition for both real estate assets and potential residents.\nRegulatory Matters\nCompliance with various governmental regulations has an impact on our business, including our capital expenditures, earnings and competitive position, which can be material. We incur costs to monitor and take actions to comply with governmental regulations that are applicable to our business, which include, among others, federal securities laws and regulations, applicable stock exchange requirements, REIT and other tax laws and regulations, antitrust laws, privacy laws, environmental and health and safety laws and regulations, local zoning, usage and other regulations relating to real property, the Americans with Disabilities Act of 1990 and related laws and regulations.\nEnvironmental Regulations.\n As a current or prior owner, operator and developer of real estate, we are subject to various federal, state and local environmental laws, regulations and ordinances and also could be liable to third parties resulting from environmental contamination or noncompliance at our communities. For some Development Communities, we undertake extensive environmental remediation to prepare the site for construction, which could be a significant portion of our total construction cost. Environmental remediation efforts could expose us to possible liabilities for accidents or improper handling of contaminated materials during construction.\nRegulations Relating to the Construction, Operation and Leasing of Our Communities\n. The construction, operation and leasing of our communities is subject to federal, state and local laws and regulations, include zoning laws, building codes, requirements that our communities be accessible to persons with disabilities, fair housing laws, and, depending on the jurisdiction, regulations regarding the charging of rents and fees and increases in such amounts upon renewal of leases. Some laws relating to the setting of rents apply broadly, such as in California, where residential rent increases at renewal in communities older than fifteen years are limited to the lesser of 10% or 5% plus local consumer price index (CPI), and in New York, where laws regulate increases on those units that are subject to rent-control or rent-stabilization. In California, the Governor and local governments have the ability to enact (and have in recent years exercised such right, for example, in connection with wildfires) local or statewide states of emergency which limit our ability to increase new and renewal rents to no more than 10% over the rent in place on the date such state of emergency was declared, which has impacted some of our California communities. We have seen an increase in state and local governments in our markets implementing, considering or being urged by various \n6 \nTable of Contents\nconstituencies to consider new or modified rent control regulations, rent stabilization, or other laws that may limit or delay our ability to charge market rents, increase rents, use algorithmic pricing tools, charge ancillary fees, or evict tenants.\nSee Part I, Item 1A. \"Risk Factors\" for a discussion of material risks to us, including, to the extent material, to our competitive position and relating to governmental and environmental regulations, and see Part II, Item 7. \"Management’s Discussion and Analysis of Financial Condition and Results of Operations,\" together with the Consolidated Financial Statements and the accompanying Notes to Consolidated Financial Statements included elsewhere in this report, for a discussion of material information relevant to an assessment of our financial condition and results of operations.\nHuman Capital \nAttracting, motivating, developing, and retaining talented associates is important to our long-term success. We engage with our associates to understand our purpose, \"Creating a Better Way to Live,\" our core values (a commitment to integrity, a spirit of caring and a focus on continuous improvement) and our cultural norms (we collaborate, excel, innovate, act like owners, are thoughtful and thorough, show appreciation, and champion inclusion and diversity).\nAt January 31, 2025, we had 2,988 employees, of which approximately 98% were employed on a full-time basis. Approximately 63% of our associates work on-site at our operating communities and the balance work on other matters. None of our associates are represented by a union.\nWe consider the following aspects of human capital management to be important:\nInclusion and Diversity.\n We value workforce diversity and an inclusive culture and believe that a diverse workplace will produce a variety of perspectives, motivate associates and help us understand and better serve our customers and the communities in which we do business. At January 31, 2025, 36% of our associates self-identified as White, 29% as Hispanic, 17% as Black, 7% as Asian, and 11% as other ethnicities, two or more ethnicities or did not respond. At January 31, 2025, 60% of our associates self-identified as male and 40% as female. \nAssociate Engagement.\n We monitor the engagement of our associates, receive feedback from our associates, and benchmark our performance by having a third party firm conduct anonymous associate perspective surveys each year. The results are discussed and presented both on a company-wide basis and within each functional group.\nSafety. \nWe take workplace safety seriously at our construction sites, our operating communities and our offices. Through our Construction Site Safety Observation program and our dedicated safety team, we monitor project-level safety performance metrics at our construction sites, and elements of compensation for our construction group and our CEO are based on safety compliance performance. Our maintenance associates are required to take monthly safety training on a variety of subjects, and our risk management group monitors incident reports from our offices and communities.\nTraining.\n To help our associates develop the skills they need to advance in their careers and succeed at AvalonBay, we train them in a variety of ways, including providing job aids and quick reference guides, web-based courses and videos, in-person and virtual, instructor-led training and on-the-job learning. Our learning management system, Workday Learning, offers approximately 600 courses providing functional, technical, management, ethics, compliance, cyber-awareness and safety training.\n7 \nTable of Contents\nAvailable Information\nWe file annual, quarterly and current reports, proxy statements and other information with the Securities and Exchange Commission (the \"SEC\"). You may obtain copies of our SEC filings, free of charge, from the SEC's website at www.sec.gov.\nWe maintain a website at www.avalonbay.com. Our annual reports on Form 10-K, quarterly reports on Form 10-Q and current reports on Form 8-K, including exhibits and amendments to those reports, filed or furnished pursuant to the Exchange Act are available free of charge in the \"Investor Relations\" section of our website as soon as reasonably practicable after the reports are filed with or furnished to the SEC. In addition, the charters of our Board's Nominating, Governance and Corporate Responsibility Committee, Audit Committee and Compensation Committee, as well as our Director Independence Standards, Corporate Governance Guidelines, Code of Business Conduct and Ethics, Policy Regarding Shareholder Rights Agreements, Policy Regarding Shareholder Approval of Future Severance Agreements, Senior Officer Stock Ownership Guidelines, Policy on Political Contributions and Government Relations, Compensation Recovery Policy, Insider Trading Policy, AvalonBay Sanctions Compliance and Anti-Corruption Policy and Environmental, Social, and Governance Reports, are available free of charge in that section of our website or by writing to AvalonBay Communities, Inc., 4040 Wilson Blvd., Suite 1000, Arlington, Virginia 22203, Attention: Chief Financial Officer. To the extent required by the rules of the SEC and the New York Stock Exchange (the \"NYSE\"), we will disclose amendments and waivers to the Code of Business Conduct and Ethics, and to the other documents as required by those documents and applicable laws, in the same place on our website. The information posted on our website is not incorporated into this Annual Report on Form 10-K.\n8 \nTable of Contents",
  "item7": "ITEM 7.    MANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nManagement's Discussion and Analysis of Financial Condition and Results of Operations (\"MD&A\") is intended to help provide an understanding of our business, financial condition and results of operations. This MD&A should be read in conjunction with our Consolidated Financial Statements and the accompanying Notes to Consolidated Financial Statements included elsewhere in this report. This report, including the following MD&A, contains forward-looking statements regarding future events or trends that should be read in conjunction with the factors described under \"Forward-Looking Statements\" included in this report. Actual results or developments could differ materially from those projected in such statements as a result of the factors described under \"Forward-Looking Statements\" as well as the risk factors described in Part I, Item 1A. \"Risk Factors\" of this report.\nCapitalized terms used without definition have the meanings provided elsewhere in this Form 10-K.\nExecutive Overview\n2024 Financial Highlights\nNet income attributable to common stockholders for the year ended December 31, 2024 was $1,081,994,000, an increase of $153,169,000, or 16.5%, from the prior year. The increase was primarily attributable to increases in NOI from communities over the prior year, increases in real estate sales and related gains, and increases in income from unconsolidated investments.\nSame Store NOI attributable to our apartment rental operations, including parking and other ancillary residential revenue (\"Residential\"), for the year ended December 31, 2024 was $1,828,266,000, an increase of $48,643,000, or 2.7%, over the prior year. The increase was due to an increase in Same Store Residential revenue of $87,854,000, or 3.4%, partially offset by an increase in Same Store Residential property operating expenses of $39,211,000, or 5.0%, over 2023.\nDuring 2024, excluding the equity capital raised through forward sales of our common shares not yet settled, we raised approximately $1,130,366,000 of gross capital through the sale of wholly-owned real estate and the issuance of unsecured notes. We believe that our current capital structure will continue to provide financial flexibility to access capital on attractive terms.\nWe believe our portfolio management activity through dispositions, development and acquisitions will continue to create long-term value. During 2024, we:\n•\nsold eight wholly-owned communities containing an aggregate of 1,532 apartment homes and 24,000 square feet of commercial space for $726,200,000;\n•\ncompleted the construction of nine wholly-owned communities containing an aggregate of 2,981 apartment homes for an aggregate total capitalized cost of $1,286,000,000;\n•\nstarted the construction of nine wholly-owned communities which in the aggregate are expected to contain 2,921 apartment homes when completed, which are expected to be completed for an estimated total capitalized cost of $1,053,000,000; and\n•\nacquired six wholly-owned communities containing an aggregate of 1,441 apartment homes for an aggregate purchase price of $460,100,000.\nDuring 2024, we issued $400,000,000 principal amount of fixed rate unsecured notes and repaid $300,000,000 principal amount of our fixed rate unsecured notes.\nWe believe that our balance sheet strength, as measured by our current level of indebtedness, our current ability to service interest and other fixed charges, and our current moderate use of financial encumbrances (such as secured financing), provide us with adequate access to liquidity from the capital markets. We expect to be able to meet our reasonably foreseeable liquidity needs, as they arise, through a combination of one or more of the following sources: existing cash on hand; operating cash flows; the settlement of the outstanding equity forwards; borrowings under our Credit Facility and Commercial Paper Program; the issuance of corporate securities (which could include unsecured debt, preferred equity and/or additional common equity after considering the outstanding equity forwards); the sale of apartment communities; secured debt; or through the formation of joint ventures. See the discussion under \"Liquidity and Capital Resources.\"\n36 \nTable of Contents\nCommunities Overview\nAs of December 31, 2024, we owned or held a direct or indirect ownership interest in 306 communities containing 93,518 homes in 12 states and the District of Columbia, of which 17 communities were under development. We have an indirect interest in nine of the 306 communities which were owned by entities that were not consolidated for financial reporting purposes. In addition, we held a direct or indirect ownership interest in Development Rights to develop an additional 28 communities that, if developed as expected, will contain an estimated 8,801 apartment homes.\nOur real estate investments consist primarily of Current Communities, Development communities, Unconsolidated Development communities and Development Rights. Our Current Communities are further classified as Same Store communities, Other Stabilized communities, Redevelopment communities and Unconsolidated communities.\nSame Store communities are consolidated communities that were owned and had stabilized occupancy as of the beginning of the prior year, allowing for a meaningful comparison of operating results between years. Other Stabilized communities are generally all other completed consolidated communities that have stabilized occupancy at the beginning of the current year or were acquired during the year. Redevelopment communities are consolidated communities where substantial redevelopment is in progress or is probable to begin during the current year. Unconsolidated communities are communities in which we have an indirect ownership interest through our investment interest in an unconsolidated joint venture. A more detailed description of our reportable segments and other related operating information can be found in Note 8, \"Segment Reporting,\" of our Consolidated Financial Statements.\nAlthough each of these categories is important to our business, we generally evaluate overall operating, industry and market trends based on the operating results of Same Store communities, for which a detailed discussion can be found in \"Results of Operations\" as part of our discussion of overall operating results. We evaluate our current and future cash needs and future operating potential based on acquisition, disposition, development, redevelopment and financing activities within Other Stabilized, Redevelopment and Development communities. Discussions related to current and future cash needs and financing activities can be found under “Liquidity and Capital Resources.”\nNOI of our current operating communities is one of the financial measures that we use to evaluate the performance of our communities. NOI is affected by the demand and supply dynamics within our markets, our rental rates and occupancy levels and our ability to control operating costs. Our overall financial performance is also impacted by the general availability and cost of capital and the performance of newly developed, redeveloped and acquired apartment communities.\nResults of Operations\nOur results of operations are driven by our operating platform and are primarily affected by both overall and individual geographic market conditions and apartment fundamentals and are reflected in changes in Same Store NOI; NOI derived from acquisitions, development completions and development under construction and in lease-up; loss of NOI related to disposed communities; and capital market and financing activity. See also Part I, Item 1A, \"Risk Factors.\" Discussion of our operating results for 2023 and comparison to 2022 can be found in Part II, Item 7. \"Management's Discussion and Analysis of Financial Condition and Results of Operations\" in the Form 10-K filed with the SEC on February 23, 2024. A comparison of our operating results for 2024 and 2023 follows (dollars in thousands).\n37 \nTable of Contents\nFor the year ended December 31,\nDecember 31, 2024 vs. 2023\n \n2024\n2023\n$ Change\n% Change\nRevenue:\n \n \n \n \nRental and other income\n$\n2,906,676 \n$\n2,760,187 \n$\n146,489 \n5.3 \n%\nManagement, development and other fees\n7,081 \n7,722 \n(641)\n(8.3)\n%\nTotal revenue\n2,913,757 \n2,767,909 \n145,848 \n5.3 \n%\nExpenses:\n \n \n \n \nDirect property operating expenses, excluding property taxes\n576,115 \n539,297 \n36,818 \n6.8 \n%\nProperty taxes\n327,611 \n306,794 \n20,817 \n6.8 \n%\nTotal community operating expenses\n903,726 \n846,091 \n57,635 \n6.8 \n%\nProperty management and other indirect operating expenses\n(169,731)\n(142,041)\n(27,690)\n(19.5)\n%\nExpensed transaction, development and other pursuit costs, net of recoveries\n(18,341)\n(33,479)\n15,138 \n45.2 \n%\nInterest expense, net\n(226,589)\n(205,992)\n(20,597)\n(10.0)\n%\nLoss on extinguishment of debt, net\n— \n(150)\n150 \n100.0 \n%\nDepreciation expense\n(846,853)\n(816,965)\n(29,888)\n(3.7)\n%\nGeneral and administrative expense\n(77,697)\n(76,534)\n(1,163)\n(1.5)\n%\nCasualty and impairment loss\n(2,935)\n(9,118)\n6,183 \n67.8 \n%\nIncome from unconsolidated investments\n50,682 \n13,454 \n37,228 \n276.7 \n%\nGain on sale of communities\n363,300 \n287,424 \n75,876 \n26.4 \n%\nOther real estate activity\n753 \n174 \n579 \n332.8 \n%\nIncome before income taxes\n1,082,620 \n938,591 \n144,029 \n15.3 \n%\nIncome tax expense\n(445)\n(10,153)\n9,708 \n95.6 \n%\nNet income\n1,082,175 \n928,438 \n153,737 \n16.6 \n%\nNet (income) loss attributable to noncontrolling interests\n(181)\n387 \n(568)\nN/A (1)\nNet income attributable to common stockholders\n$\n1,081,994 \n$\n928,825 \n$\n153,169 \n16.5 \n%\n_________________________________\n(1)     Percent change is not meaningful.\nNet income attributable to common stockholders\n increased $153,169,000, or 16.5%, to $1,081,994,000 in 2024 from 2023, primarily due to increases in (i) NOI from communities, (ii) real estate sales and related gains, and (iii) income from unconsolidated investments in the current year. \nNOI.\n  We define NOI as total property revenue less direct property operating expenses (including property taxes), and excluding corporate-level income (including management, development and other fees), property management and other indirect operating expenses, net of corporate income, expensed transaction, development and other pursuit costs, net of recoveries, interest expense, net, loss on extinguishment of debt, net, general and administrative expense, income from unconsolidated investments, depreciation expense, income tax expense (benefit), casualty and impairment loss, gain on sale of communities, other real estate activity and net operating income from real estate assets sold or held for sale. Management considers NOI to be an important and appropriate supplemental performance measure to net income because it helps both investors and management to understand the core operations of a community or communities prior to the allocation of any corporate-level property management overhead or financing-related costs. NOI reflects the operating performance of a community and allows for an easier comparison of the operating performance of individual assets or groups of assets. In addition, because prospective buyers of real estate have different financing and overhead structures, with varying marginal impact to overhead as a result of acquiring real estate, NOI is considered by many in the real estate industry to be a useful measure for determining the value of a real estate asset or group of assets.\nNOI does not represent cash generated from operating activities in accordance with GAAP, and NOI should not be considered an alternative to net income as an indication of our performance. NOI should also not be considered an alternative to net cash flow from operating activities, as determined by GAAP, as a measure of liquidity, nor is NOI indicative of cash available to \n38 \nTable of Contents\nfund cash needs. Residential NOI represents results attributable to our apartment rental operations, including parking and other ancillary residential revenue. Reconciliations of NOI and Residential NOI for the years ended December 31, 2024 and 2023 to net income for each year are as follows (dollars in thousands):\n \nFor the year ended December 31,\n \n2024\n2023\nNet income\n$\n1,082,175 \n$\n928,438 \nProperty management and other indirect operating expenses, net of corporate income\n162,594 \n134,312 \nExpensed transaction, development and other pursuit costs, net of recoveries\n18,341 \n33,479 \nInterest expense, net\n226,589 \n205,992 \nLoss on extinguishment of debt, net\n— \n150 \nGeneral and administrative expense\n77,697 \n76,534 \nIncome from unconsolidated investments\n(50,682)\n(13,454)\nDepreciation expense\n846,853 \n816,965 \nIncome tax expense\n445 \n10,153 \nCasualty and impairment loss\n2,935 \n9,118 \nGain on sale of communities\n(363,300)\n(287,424)\nOther real estate activity\n(753)\n(174)\nNet operating income from real estate assets sold or held for sale\n(28,463)\n(57,646)\n        NOI\n1,974,431 \n1,856,443 \nCommercial NOI (1)\n(33,213)\n(32,654)\nResidential NOI\n$\n1,941,218 \n$\n1,823,789 \n_________________________\n(1)\nRepresents results attributable to the commercial and other non-residential operations at our communities (\"Commercial\").\n \nThe Residential NOI changes for 2024 as compared to 2023 consist of changes in the following categories (dollars in thousands):\nFor the year ended\n \nDecember 31, 2024\nSame Store\n$\n48,643 \nOther Stabilized\n27,392 \nDevelopment / Redevelopment\n41,394 \nTotal\n$\n117,429 \nThe 2.7% increase in our Same Store Residential NOI in 2024 is due to an increase in Residential revenue of $87,854,000, or 3.4%, partially offset by an increase in Residential property operating expenses of $39,211,000, or 5.0%, over 2023.\nIncreases in inflation can result in an increase in our operating costs both at our communities and at the corporate level. Most of our apartment leases are for a term of one year or less. In an inflationary environment, this may allow us to realize increased rents upon renewal of existing leases or the beginning of new leases. Short-term leases generally reduce our risk from the adverse effect of inflation, although these leases also permit residents to leave at the end of their lease term. In addition, inflation could cause our construction costs and cost of other capitalized expenditures to increase, impacting the expected economic return of, and expected operating results for, current and planned development activity.\nRental and other income\n increased $146,489,000, or 5.3%, in 2024 compared to the prior year primarily due to the increased revenue from our Same Store communities, discussed below.\nConsolidated Communities —The weighted average number of occupied apartment homes for consolidated communities increased to 79,240 apartment homes for 2024, compared to 77,667 homes for 2023. The weighted average monthly revenue per occupied apartment home increased to $3,081 for 2024 compared to $2,955 in 2023.\nSame Store Communities — The following table presents the change in Same Store Residential revenue, including the \n39 \nTable of Contents\nattribution of the change between average revenue per occupied home and Economic Occupancy for the year ended December 31, 2024 (dollars in thousands).\nResidential  revenue\nAverage monthly revenue per occupied home\nEconomic Occupancy (1)\n$ Change\n% Change\n% Change\n% Change\nFor the year ended December 31,\n2024\n2023\n2024 to 2023\n2024 to 2023\n2024\n2023\n2024 to 2023\n2024\n2023\n2024 to 2023\nNew England\n$\n356,399 \n$\n341,506 \n$\n14,893 \n4.4 \n%\n$\n3,370 \n$\n3,226 \n4.5 \n%\n96.5 \n%\n96.6 \n%\n(0.1)\n%\nMetro NY/NJ\n534,673 \n516,038 \n18,635 \n3.6 \n%\n3,717 \n3,582 \n3.8 \n%\n95.6 \n%\n95.7 \n%\n(0.1)\n%\nMid-Atlantic\n414,044 \n400,487 \n13,557 \n3.4 \n%\n2,510 \n2,419 \n3.8 \n%\n94.9 \n%\n95.3 \n%\n(0.4)\n%\nSoutheast Florida\n95,809 \n94,070 \n1,739 \n1.8 \n%\n2,897 \n2,852 \n1.6 \n%\n97.1 \n%\n96.9 \n%\n0.2 \n%\nDenver, CO\n40,691 \n40,166 \n525 \n1.3 \n%\n2,329 \n2,265 \n2.8 \n%\n94.6 \n%\n96.0 \n%\n(1.4)\n%\nPacific Northwest\n164,655 \n158,115 \n6,540 \n4.1 \n%\n2,789 \n2,705 \n3.1 \n%\n96.3 \n%\n95.3 \n%\n1.0 \n%\nNorthern California\n425,214 \n418,540 \n6,674 \n1.6 \n%\n3,072 \n3,019 \n1.8 \n%\n95.8 \n%\n96.0 \n%\n(0.2)\n%\nSouthern California\n589,204 \n563,661 \n25,543 \n4.5 \n%\n2,877 \n2,755 \n4.4 \n%\n95.9 \n%\n95.9 \n%\n— \n%\nOther Expansion Regions\n32,727 \n32,979 \n(252)\n(0.8)\n%\n2,101 \n2,094 \n0.3 \n%\n94.0 \n%\n95.0 \n%\n(1.0)\n%\n  Total Same Store\n$\n2,653,416 \n$\n2,565,562 \n$\n87,854 \n3.4 \n%\n$\n3,004 \n$\n2,902 \n3.5 \n%\n95.8 \n%\n95.9 \n%\n(0.1)\n%\n_________________________________\n(1)  Economic Occupancy is defined as gross potential revenue less vacancy loss, as a percentage of gross potential revenue. Gross potential revenue is determined by valuing occupied homes at contract rates and vacant homes at market rents. Vacancy loss is determined by valuing vacant units at market rents. Economic Occupancy considers that apartment homes of different sizes and locations within a community have different economic impacts on a community's gross revenue. \nThe following table details the increase in Same Store Residential revenue by component for the year ended December 31, 2024, compared to the prior year:\nFor the year ended\nDecember 31, 2024\nResidential revenue\nLease rates\n2.2 \n%\nEconomic Occupancy\n(0.1)\n%\nOther rental revenue\n0.9 \n%\nUncollectible lease revenue (excluding rent relief)\n0.5 \n%\nRent relief\n(0.1)\n%\nTotal Residential revenue\n3.4 \n%\nThe increase for Same Store Residential revenue for the year ended December 31, 2024, as compared to the prior year was impacted by uncollectible lease revenue, inclusive of amounts received from government rent relief programs. Same Store uncollectible lease revenue decreased for the year ended December 31, 2024 as compared to the prior year by $10,582,000, resulting in a 0.4% increase in Same Store Residential revenue. Uncollectible lease revenue was impacted by a decrease in government rent relief of $3,967,000 for the year ended December 31, 2024 from the prior year. Adjusting to remove the impact of rent relief, uncollectible lease revenue as a percentage of Same Store Residential revenue decreased to 1.8% in the year ended December 31, 2024 from 2.4% in the year ended December 31, 2023.\nWe use concessions periodically as a means to increase leasing velocity, providing our new and existing residents an upfront incentive to enter into a new lease, or extend an existing lease. During 2024, concessions granted for our Same Store communities increased over the prior year by $562,000 to $17,288,000. We amortize concessions on a straight-line basis over the life of the respective leases (generally one year), reducing the income recognized over the lease term. For the year ended December 31, 2024, amortized concessions increased by $927,000, partially offsetting the increase in revenue as compared to the prior year. The remaining net unamortized balance of Same Store residential concessions as of December 31, 2024 and 2023 was $2,358,000 and $187,000, respectively.\nManagement, development and other fees\n decreased $641,000, or 8.3%, in 2024, compared to the prior year, primarily due to reduced third-party development fees, partially offset by an increase in fees for third-party back-office, financial administrative support services in the current year.\n40 \nTable of Contents\nDirect property operating expenses, excluding property taxes,\n increased $36,818,000, or 6.8%, in 2024 compared to the prior year, primarily due to the addition of newly developed and acquired apartment communities as well as increased Residential operating expenses at our Same Store communities as discussed below, partially offset by dispositions.\nSame Store Residential direct property operating expenses, excluding property taxes, increased $25,326,000, or 5.0%, in 2024 compared to the prior year, primarily due to the implementation of our bulk internet offering, increased trash removal costs, water and sewer costs, and repairs and maintenance costs. \nProperty taxes\n increased $20,817,000, or 6.8%, in 2024 compared to the prior year, primarily due to increases for our Same Store Residential portfolio and the addition of newly developed and acquired apartment communities, partially offset by decreased property taxes from dispositions.\nSame Store Residential property taxes increased $13,885,000, or 4.9%, in 2024 compared to the prior year, primarily due to increased assessments across the portfolio, a higher level of successful appeals in the prior year and the expiration of property tax incentive programs primarily at certain of our properties in New York City. The expiration of property tax incentive programs represents $5,364,000 or 39% of the 4.9% increase in property taxes for the year ended December 31, 2024.\nProperty management and other indirect operating expenses, net of corporate income \nincreased $27,690,000, or 19.5%, in 2024, primarily due to costs related to our shared services model and increased costs related to investments in technology and process related spend for initiatives to improve future efficiency in services for residents and prospects, and increased advocacy costs.\nExpensed transaction, development and other pursuit costs, net of recoveries\n includes costs incurred for write downs and abandonment of Development Rights and development pursuits not yet considered probable for development, as well as costs related to abandoned acquisition and disposition pursuits, offset by any recoveries of costs incurred. In periods of increased acquisition and pursuit activity, periods of economic downturn or when there is limited access to capital, these costs can be volatile and may vary significantly from year to year. In addition, the timing for potential recoveries will not always align with the timing for expensing an abandoned pursuit. Expensed transaction, development and other pursuit costs, net of recoveries, decreased $15,138,000 in 2024 compared to the prior year due to a decrease in write-offs for development rights that we determined are no longer probable. The amount for 2024 includes a write-off of $8,947,000 related to one Development Right in Northern California, and the amount for 2023 includes write-offs of $27,455,000 related to seven Development Rights in Northern and Southern California and the Mid-Atlantic that we determined were no longer probable.\nInterest expense, net\n increased $20,597,000, or 10.0%, in 2024 compared to the prior year. This category includes interest costs adjusted for capitalized interest related to development and redevelopment activity, amortization of premium/discount on debt, deferred hedging gains and losses from qualifying hedges, interest income and any mark-to-market impact from derivatives not in qualifying hedge relationships. The increase in 2024 was primarily due to increases in amounts of unsecured indebtedness and decreases in interest income compared to the prior year due to lower cash amounts invested. The increases in 2024 are also due to decreased capitalized interest compared to the prior year.\nDepreciation expense\n increased $29,888,000, or 3.7%, in 2024 compared to the prior year, primarily due to the addition of newly developed and acquired apartment communities, partially offset by dispositions.\nGeneral and administrative expense\n increased $1,163,000, or 1.5%, in 2024 as compared to the prior year, primarily due to an increase in legal and professional fees, partially offset by decreased compensation expense, including severance.\nCasualty and impairment loss \nfor the year ended December 31, 2024 of $2,935,000 was due to flooding and water damage at communities in California from extensive rainfall and a fire at a community in New Jersey. \nIncome from unconsolidated investments\n increased $37,228,000 in 2024 compared to the prior year, primarily due to realized and unrealized property technology investments gains, partially offset by the recognition of $1,519,000 of our promoted interest associated with the achievement of a threshold return with the U.S. Fund in the prior year. \n41 \nTable of Contents\nGain on sale of communities\n increased in 2024 compared to the prior year. The amount of gain realized in a given period depends on many factors, including the number of communities sold, the size and carrying value of the communities sold, expected operating performance of the communities and the market conditions in the local area. The gains of $363,300,000 and $287,424,000 in 2024 and 2023, respectively, were primarily due to the sale of eight and four wholly-owned communities in 2024 and 2023, respectively.\nIncome tax expense \nof $10,153,000 for 2023 was primarily related to The Park Loggia.\nNon-GAAP Financial Measures — Reconciliation of FFO and Core FFO\nFFO and FFO adjusted for non-core items, or \"Core FFO,\" as defined below, are generally considered by management to be appropriate supplemental measures of our operating and financial performance. \nConsistent with the definition adopted by the Board of Governors of the National Association of Real Estate Investment Trusts® (\"Nareit\"), we calculate Funds from Operations Attributable to Common Stockholders (\"FFO\") as net income or loss attributable to common stockholders computed in accordance with GAAP, adjusted for:\n•\ngains or losses on sales of previously depreciated operating communities;\n•\ncumulative effect of a change in accounting principle;\n•\nimpairment write-downs of depreciable real estate assets;\n•\nwrite-downs of investments in affiliates due to a decrease in the value of depreciable real estate assets held by those affiliates;\n•\ndepreciation of real estate assets; and\n•\nsimilar adjustments for unconsolidated partnerships and joint ventures, including those from a change in control.\nFFO can help with the comparison of the operating and financial performance of a real estate company between periods or as compared to different companies because the adjustments such as (i) gains or losses on sales of previously depreciated property or (ii) real estate depreciation may impact comparability as the amount and timing of these or similar items can vary among owners of identical assets in similar condition based on historical cost accounting and useful life estimates. By further adjusting for items that we do not consider part of our core business operations, Core FFO can help with the comparison of our core operating performance year over year. We believe that, in order to understand our operating results, FFO and Core FFO should be considered in conjunction with net income as presented in the Consolidated Statements of Comprehensive Income included elsewhere in this report.\nWe calculate Core FFO as FFO, adjusted for:\n•\njoint venture gains (if not adjusted through FFO), non-core costs and promoted interests from partnerships;\n•\ncasualty and impairment losses or gains, net on non-depreciable real estate or other investments;\n•\ngains or losses from early extinguishment of consolidated borrowings;\n•\nexpensed transaction, development and other pursuit costs, net of recoveries;\n•\nlegal recoveries, settlement proceeds, and certain legal costs;\n•\nproperty and casualty insurance proceeds;\n•\ngains or losses on sales of assets not subject to depreciation and other investment gains or losses;\n•\nadvocacy contributions, representing payments to promote our business interests;\n•\nhedge ineffectiveness or gains or losses from derivatives not designated as hedges for accounting purposes;\n•\nchanges to expected credit losses associated with the lending commitments under the SIP;\n•\nseverance related costs;\n•\nexecutive transition compensation costs;\n•\nnet for-sale condominium activity, including gains, marketing, operating and administrative costs and imputed carry cost; and\n•\nincome taxes.\nFFO and Core FFO do not represent (i) net income in accordance with GAAP, and therefore should not be considered an alternative to net income, which remains the primary measure, as an indication of our performance, or (ii) cash generated from operating activities in accordance with GAAP, and therefore should not be considered an alternative to net cash flows from operating activities, as determined by GAAP, as a measure of liquidity. In addition, FFO and Core FFO are not necessarily indicative of cash available to fund cash needs and may not be comparable to FFO and Core FFO as calculated by other REITs.\n42 \nTable of Contents\nThe following is a reconciliation of net income attributable to common stockholders to FFO attributable to common stockholders and to Core FFO attributable to common stockholders for the years ended December 31, 2024 and 2023 (dollars in thousands, except per share amounts).\n \nFor the year ended December 31,\n \n2024\n2023\nNet income attributable to common stockholders\n$\n1,081,994 \n$\n928,825 \nDepreciation - real estate assets, including joint venture adjustments\n843,224 \n811,717 \nDistributions to noncontrolling interests\n— \n25 \nGain on sale of previously depreciated real estate\n(363,300)\n(287,424)\nCasualty loss and impairment on real estate\n2,935 \n9,118 \nFFO attributable to common stockholders \n$\n1,564,853 \n$\n1,462,261 \nAdjusting items:\nUnconsolidated entity gains, net (1)\n(33,137)\n(4,161)\nJoint venture promote (2)\n— \n(1,519)\nStructured Investment Program loan reserve (3)\n(1,057)\n1,186 \nLoss on extinguishment of consolidated debt\n— \n150 \nHedge accounting activity\n61 \n566 \nAdvocacy contributions \n19,156 \n1,625 \nExecutive transition compensation costs\n304 \n1,244 \nSeverance related costs\n1,787 \n2,625 \nExpensed transaction, development and other pursuit costs, net of recoveries (4)\n13,649 \n30,583 \nOther real estate activity\n(753)\n(174)\nFor-sale condominium imputed carry cost (5)\n84 \n602 \nLegal settlements and costs (6)\n3,002 \n457 \nIncome tax expense (7)\n445 \n10,153 \nCore FFO attributable to common stockholders \n$\n1,568,394 \n$\n1,505,598 \nWeighted average common shares outstanding - diluted\n142,458,604\n141,643,788\nEarnings per common share - diluted \n$\n7.60 \n$\n6.56 \nFFO per common share - diluted \n$\n10.98 \n$\n10.32 \nCore FFO per common share - diluted \n$\n11.01 \n$\n10.63 \n_________________________________\n(1)    Amounts consist primarily of net unrealized gains on technology investments.\n(2)   Amount is for recognition of our promoted interest in the U.S. Fund.\n(3)  Reflects changes to expected credit losses associated with our lending commitments primarily under the SIP. The timing and amount of actual losses that will be incurred, if any, is to be determined at the maturity of each respective lending agreement.\n(4)  Amounts for 2024 and  2023 include a write-off of $8,947 for one Development Right in Northern California and write-offs of $27,455 related to seven Development Rights in Northern and Southern California and the Mid-Atlantic, respectively, that we determined were no longer probable. \n(5)   Represents the imputed carry cost of for-sale residential condominiums at The Park Loggia. We compute this adjustment by multiplying the total capitalized cost of completed and unsold for-sale residential condominiums by our weighted average unsecured debt effective interest rate.\n(6)  Amount for 2024 includes legal costs associated with various antitrust litigation matters.\n(7)  Amount for 2023 is primarily for the recognition of taxes associated with The Park Loggia.\n43 \nTable of Contents\nLiquidity and Capital Resources\nWe employ a disciplined approach to our liquidity and capital management. When we source capital, we take into account both our view of the most cost-effective alternative available and our desire to maintain a balance sheet that provides us with flexibility. Our principal focus on near-term and intermediate-term liquidity is to ensure we have adequate capital to fund:\n•\ndevelopment and redevelopment activity in which we are currently engaged or in which we plan to engage;\n•\nthe minimum dividend payments on our common stock required to maintain our REIT qualification under the Code;\n•\nregularly scheduled principal and interest payments and principal payments either at maturity or opportunistically before maturity;\n•\nnormal recurring operating and corporate overhead expenses; and\n•\ninvestment in our operating platform, including strategic investments.\nFactors affecting our liquidity and capital resources are our cash flows from operations, financing activities and investing activities (including dispositions) as well as general economic and market conditions. Cash flows from operations are determined by operating activities and factors including but not limited to (i) the number of apartment homes currently owned, (ii) rental rates, (iii) occupancy levels, (iv) uncollectible lease revenue levels or interruptions in collections caused by market conditions and (v) operating expenses with respect to apartment homes. The timing and type of capital markets activity in which we engage is affected by changes in the capital markets environment, such as changes in interest rates or the availability of cost-effective capital. Our plans for development, redevelopment, non-routine capital expenditure, acquisition and disposition activity are affected by market conditions and capital availability. We frequently review our liquidity needs, especially in periods with volatile market conditions, as well as the adequacy of cash flows from operations and other expected liquidity sources to meet these needs.\nWe had cash, cash equivalents and restricted cash of $267,076,000 at December 31, 2024, a decrease of $263,884,000 from $530,960,000 at December 31, 2023. The following discussion relates to changes in cash, cash equivalents and restricted cash due to operating, investing and financing activities. \nA presentation of GAAP based cash flow metrics is as follows (dollars in thousands):\n \nFor the year ended December 31,\n \n2024\n2023\nNet cash provided by operating activities\n$\n1,607,878 \n$\n1,560,029 \nNet cash used in investing activities\n$\n(996,864)\n$\n(928,955)\nNet cash used in financing activities\n$\n(874,898)\n$\n(834,359)\n•\nNet cash provided by operating activities increased primarily due to increases in NOI.\n•\nNet cash used in investing activities was primarily due to (i) the investment of $951,101,000 in the development and redevelopment of communities, (ii) acquisition of six wholly-owned communities for $464,419,000 and (iii) capital expenditures of $198,026,000 for our wholly-owned communities and non-real estate assets. These amounts were partially offset by net proceeds from the disposition of eight wholly-owned communities.\n•\nNet cash used in financing activities was primarily due to (i) payment of cash dividends in the amount of $961,914,000, and (ii) the repayment of the $300,000,000 fixed rate unsecured notes. These amounts were partially offset by the proceeds from the issuance of unsecured notes in the amount of $398,788,000.\n44 \nTable of Contents\nVariable Rate Unsecured Credit Facility\nThe $2,250,000,000 Credit Facility matures in September 2026. The interest rate that would be applicable to borrowings under the Credit Facility is 5.19% at January 31, 2025 and is composed of (i) the Secured Overnight Financing Rate (\"SOFR\"), applicable to the period of borrowing for a particular draw of funds from the facility (e.g., one month to maturity, three months to maturity, etc.), plus (ii) the current borrowing spread to SOFR of 0.805% per annum, which consists of a 0.10% SOFR adjustment plus 0.705% per annum, assuming a daily SOFR borrowing rate. The borrowing spread to SOFR can vary from SOFR plus 0.63% to SOFR plus 1.38% based upon the rating of our unsecured senior notes. There is also an annual facility commitment fee of 0.12% of the borrowing capacity under the facility, which can vary from 0.095% to 0.295% based upon the rating of our unsecured senior notes. The Credit Facility contains a sustainability-linked pricing component which provides for interest rate margin and commitment fee reductions or increases by meeting or missing targets related to environmental sustainability, specifically greenhouse gas emission reductions, with the adjustment determined annually. The annual determination under the sustainability-linked pricing component occurred in July 2024, maintaining reductions of approximately 0.02% to the interest rate margin and 0.005% to the commitment fee due to our achievement of sustainability targets.\nThe availability on the Credit Facility as of January 31, 2025 is as follows (dollars in thousands):\n \nJanuary 31, 2025\nCredit Facility commitment\n$2,250,000\nCredit Facility outstanding\n—\nCommercial paper outstanding\n(170,000)\nLetters of credit outstanding (1)\n(964)\nTotal Credit Facility available\n$\n2,079,036 \n_____________________________________\n(1)\nIn addition, we had $47,592 outstanding in additional letters of credit unrelated to the Credit Facility as of January 31, 2025.\nCommercial Paper Program\nWe have a Commercial Paper Program with the maximum aggregate face or principal amount outstanding at any one time not to exceed $500,000,000. Under the terms of the Commercial Paper Program, we may issue, from time to time, unsecured commercial paper notes with varying maturities of less than one year. The Commercial Paper Program is backstopped by our commitment to maintain available borrowing capacity under the Credit Facility in an amount equal to actual borrowings under the Commercial Paper Program. As of January 31, 2025, we had $170,000,000 outstanding under the Commercial Paper Program at a weighted average contractual interest rate of 4.55%.\nSecured and Unsecured Borrowings— Financial Covenants and Early Repayment Provisions\nWe are subject to financial covenants contained in the Credit Facility and the indentures under which our unsecured notes were issued. The principal financial covenants include the following:\n•\nlimitations on the amount of total and secured debt in relation to our overall capital structure;\n•\nlimitations on the amount of our unsecured debt relative to the undepreciated basis of real estate assets that are not encumbered by property-specific financing; and\n•\nminimum levels of debt service coverage.\nWe were in compliance with these covenants at December 31, 2024.\nIn addition, some of our secured and unsecured borrowings include yield maintenance, defeasance, or prepayment penalty provisions, which could result in us incurring an additional charge in the event of a full or partial prepayment of outstanding principal before the scheduled maturity. These provisions in our borrowings are generally consistent with other similar types of debt instruments issued during the same time period in which our borrowings were issued.\n45 \nTable of Contents\nContinuous Equity Offering Program \nUnder our continuous equity program (the \"CEP\"), we may sell (and/or enter into forward sale agreements for the sale of) up to $1,000,000,000 of our common stock from time to time. Actual sales will depend on a variety of factors to be determined, including market conditions, the trading price of our common stock and our determinations of the appropriate funding sources. We expect that, if entered into, we will physically settle each forward sale agreement on one or more dates prior to the maturity date of that particular forward sale agreement, and to receive aggregate net cash proceeds at settlement equal to the number of shares underlying the particular forward agreement multiplied by the forward sale price. However, we may also elect to cash settle or net share settle a forward sale agreement. In connection with each forward sale agreement, we will pay the forward seller, in the form of a reduced initial forward sale price, a commission of up to 1.5% of the sales prices of all borrowed shares of common stock sold. During 2024 and through January 31, 2025, we entered into forward contracts under the CEP to sell 367,113 shares of common stock for approximate proceeds, net of fees, of $80,687,000, based on the gross weighted average price of $223.27 per share, with settlement of the forward contracts to occur on one or more dates not later than December 31, 2025. The final proceeds will be determined on the date(s) of settlement and are subject to certain customary adjustments for our dividends and a daily interest factor. As of January 31, 2025, we had $623,997,000 remaining authorized for issuance under this program, after consideration of the forward contracts.\nForward Equity Offering\nIn addition to the CEP, during the year ended December 31, 2024, we completed an underwritten public offering of 3,680,000 shares of our common stock at a discount to the closing price of $226.52 per share, net of offering fees, offered in connection with forward contracts entered into with certain financial institutions acting as forward purchasers. Assuming full physical settlement of the forward contracts, which we expect to occur no later than December 31, 2025, we will receive approximate proceeds, net of offering fees and discounts, of $808,606,000, based on the initial forward price. The final proceeds will be determined on the date(s) of settlement and are subject to certain customary adjustments for our dividends and a daily interest factor. \nStock Repurchase Program\nWe have a stock repurchase program under which we may acquire shares of our common stock in open market or negotiated transactions up to an aggregate purchase price of $500,000,000 (the \"Stock Repurchase Program\"). Purchases of common stock under the Stock Repurchase Program may be exercised at our discretion with the timing and number of shares repurchased depending on a variety of factors including price, corporate and regulatory requirements and other corporate liquidity requirements and priorities. The Stock Repurchase Program does not have an expiration date and may be suspended or terminated at any time without prior notice. During the year ended December 31, 2024 through January 31, 2025, we had no repurchases of shares under this program. As of January 31, 2025, we had $314,237,000 remaining authorized for purchase under this program.\nInterest Rate Swap Agreements\nThe following derivative activity occurred during the year ended December 31, 2024:\n•\nIn connection with the issuance of our $400,000,000 unsecured notes in May 2024 maturing in 2034, we terminated $250,000,000 of forward interest rate swap agreements designated as cash flow hedges of the interest rate variability on the issuance of unsecured notes, receiving $16,839,000 which will be recognized over the life of the unsecured notes as a reduction in the effective interest rate. Of the $250,000,000 forward interest rate swap agreements that terminated, $50,000,000 were entered into during 2024. The Company has deferred these gains in accumulated other comprehensive income on the accompanying Consolidated Balance Sheets, and is recognizing the impact as a component of interest expense, net, over the term of the respective hedged debt.\n•\nIn addition to the activity above, we entered into and had outstanding $100,000,000 of forward interest rate swap agreements to reduce the impact of variability in interest rates on a portion of our anticipated future debt issuance activity through December 31, 2025. We expect to cash settle the swaps and either pay or receive cash for the then current fair value. Assuming the Company issues the debt as expected, the hedging impact from these positions will then be recognized over the life of the issued debt as a yield adjustment.\nFuture Financing and Capital Needs—Debt Maturities and Material Obligations\n46 \nTable of Contents\nOne of our principal long-term liquidity needs is the repayment of long-term debt at maturity. For both our unsecured and secured notes, a portion of the principal of these notes may be repaid prior to maturity. Early retirement of our unsecured or secured notes could result in gains or losses on extinguishment. We may use capital from a variety of sources to repay debt at maturity, including proceeds received from the dispositions of our operating communities or other direct and indirect investments in real estate and cash from operations. If we do not have funds on hand sufficient to repay our indebtedness as it becomes due, it will be necessary for us to refinance or otherwise provide liquidity to satisfy the debt at maturity. This refinancing may be accomplished by uncollateralized private or public debt offerings, equity issuances, including through the settlement of the outstanding equity forwards, additional debt financing that is secured by mortgages on individual communities or groups of communities or borrowings under our Credit Facility or Commercial Paper Program. In addition, to the extent we have amounts outstanding under the Commercial Paper Program, we are obligated to repay the short-term indebtedness at maturity through either current cash on hand or by incurring other indebtedness, including by way of borrowing under our Credit Facility. Although we believe we will have the capacity to meet our currently anticipated liquidity needs, we cannot assure you that capital from additional debt financing or debt or equity offerings will be available or, if available, that they will be on terms we consider satisfactory.\nIn May 2024, we issued $400,000,000 principal amount of unsecured notes in a public offering under our existing shelf registration statement for proceeds net of underwriting fees of approximately $396,188,000, before considering the impact of other offering costs. The notes mature in June 2034 and were issued at a 5.35% interest rate, resulting in a 5.05% effective rate including the impact of offering costs and hedging activity.\nThe following table details our consolidated debt obligations, including the effective interest rate and contractual maturity dates, and principal payments for periodic amortization and maturities for the next five years, excluding our Credit Facility and Commercial Paper Program and amounts outstanding related to communities classified as held for sale at December 31, 2024 and 2023 (dollars in thousands). We are not directly or indirectly (as borrower or guarantor) obligated in any material respect to pay principal or interest on the indebtedness of any unconsolidated entities in which we have an equity or other interest, other than as disclosed related to the AVA Arts District construction loan (see \"Unconsolidated Operating Communities\" for further discussion of the construction loan).\n \nEffective\ninterest\nrate (1)\nPrincipal\nmaturity\ndate\nBalance Outstanding (2)\nScheduled Maturities\nDebt\n12/31/2023\n12/31/2024\n2025\n2026\n2027\n2028\n2029\nThereafter\nTax-exempt bonds\nVariable rate \n \n \n \n \n \nAvalon Acton\n4.66 \n%\nJul-2040\n(3)\n$\n45,000 \n$\n45,000 \n$\n— \n$\n— \n$\n— \n$\n— \n$\n— \n$\n45,000 \nAvalon Clinton North\n5.31 \n%\nNov-2038\n(3)\n126,400 \n126,400 \n— \n— \n700 \n2,800 \n3,000 \n119,900 \nAvalon Clinton South\n5.31 \n%\nNov-2038\n(3)\n104,500 \n104,500 \n— \n— \n600 \n2,300 \n2,400 \n99,200 \nAvalon Midtown West\n5.28 \n%\nMay-2029\n(3)\n76,600 \n69,800 \n8,100 \n8,100 \n8,900 \n9,800 \n34,900 \n— \nAvalon San Bruno I\n5.20 \n%\nDec-2037\n(3)\n57,650 \n55,250 \n2,200 \n2,600 \n2,700 \n2,900 \n3,100 \n41,750 \n410,150 \n400,950 \n10,300 \n10,700 \n12,900 \n17,800 \n43,400 \n305,850 \nConventional loans\n \n \n \n \n \nFixed rate\n \n \n \n \n \n$300 million unsecured notes\n— \n%\nNov-2024\n(4)\n300,000 \n— \n— \n— \n— \n— \n— \n— \n$525 million unsecured notes\n3.55 \n%\nJun-2025\n525,000 \n525,000 \n525,000 \n— \n— \n— \n— \n— \n$300 million unsecured notes\n3.62 \n%\nNov-2025\n300,000 \n300,000 \n300,000 \n— \n— \n— \n— \n— \n$475 million unsecured notes\n3.35 \n%\nMay-2026\n475,000 \n475,000 \n— \n475,000 \n— \n— \n— \n— \n$300 million unsecured notes\n3.01 \n%\nOct-2026\n300,000 \n300,000 \n— \n300,000 \n— \n— \n— \n— \n$350 million unsecured notes\n3.95 \n%\nOct-2046\n350,000 \n350,000 \n— \n— \n— \n— \n— \n350,000 \n$400 million unsecured notes\n3.50 \n%\nMay-2027\n400,000 \n400,000 \n— \n— \n400,000 \n— \n— \n— \n$300 million unsecured notes\n4.09 \n%\nJul-2047\n300,000 \n300,000 \n— \n— \n— \n— \n— \n300,000 \n$450 million unsecured notes\n3.32 \n%\nJan-2028\n450,000 \n450,000 \n— \n— \n— \n450,000 \n— \n— \n$300 million unsecured notes\n3.97 \n%\nApr-2048\n300,000 \n300,000 \n— \n— \n— \n— \n— \n300,000 \n$450 million unsecured notes\n3.66 \n%\nJun-2029\n450,000 \n450,000 \n— \n— \n— \n— \n450,000 \n— \n$700 million unsecured notes\n2.69 \n%\nMar-2030\n700,000 \n700,000 \n— \n— \n— \n— \n— \n700,000 \n$600 million unsecured notes\n2.65 \n%\nJan-2031\n600,000 \n600,000 \n— \n— \n— \n— \n— \n600,000 \n$700 million unsecured notes\n2.16 \n%\nJan-2032\n700,000 \n700,000 \n— \n— \n— \n— \n— \n700,000 \n$400 million unsecured notes\n2.03 \n%\nDec-2028\n400,000 \n400,000 \n— \n— \n— \n400,000 \n— \n— \n$350 million unsecured notes\n4.38 \n%\nFeb-2033\n350,000 \n350,000 \n— \n— \n— \n— \n— \n350,000 \n$400 million unsecured notes\n5.19 \n%\nDec-2033\n400,000 \n400,000 \n— \n— \n— \n— \n— \n400,000 \n$400 million unsecured notes\n5.05 \n%\nJun-2034\n— \n400,000 \n— \n— \n— \n— \n— \n400,000 \n47 \nTable of Contents\n \nEffective\ninterest\nrate (1)\nPrincipal\nmaturity\ndate\nBalance Outstanding (2)\nScheduled Maturities\nDebt\n12/31/2023\n12/31/2024\n2025\n2026\n2027\n2028\n2029\nThereafter\nAvalon Walnut Creek\n4.00 \n%\nJul-2066\n4,501 \n4,681 \n— \n— \n— \n— \n— \n4,681 \neaves Los Feliz\n3.68 \n%\nJun-2027\n41,400 \n41,400 \n— \n— \n41,400 \n— \n— \n— \neaves Woodland Hills\n3.67 \n%\nJun-2027\n111,500 \n111,500 \n— \n— \n111,500 \n— \n— \n— \nAvalon Russett\n3.77 \n%\nJun-2027\n32,200 \n32,200 \n— \n— \n32,200 \n— \n— \n— \nAvalon San Bruno III\n2.38 \n%\nMar-2027\n51,000 \n51,000 \n— \n— \n51,000 \n— \n— \n— \nAvalon Cerritos\n3.34 \n%\nAug-2029\n30,250 \n30,250 \n— \n— \n— \n— \n30,250 \n— \nAvalon West Plano\n5.97 \n%\nMay-2029\n63,041 \n62,448 \n1,065 \n1,111 \n1,159 \n1,202 \n57,911 \n— \n7,633,892 \n7,733,479 \n826,065 \n776,111 \n637,259 \n851,202 \n538,161 \n4,104,681 \nTotal indebtedness - excluding Credit Facility and Commercial Paper\n$\n8,044,042 \n$\n8,134,429 \n$\n836,365 \n$\n786,811 \n$\n650,159 \n$\n869,002 \n$\n581,561 \n$\n4,410,531 \n_________________________________\n(1)\nRates are as of December 31, 2024 and include credit enhancement fees, facility fees, trustees' fees, the impact of interest rate hedges, offering costs, mark to market amortization and other fees.\n(2)\nBalances outstanding represent total amounts due at maturity, and exclude deferred financing costs and debt discount for the unsecured notes of $41,216 and $43,848 as of December 31, 2024 and 2023, respectively, deferred financing costs and debt discount associated with secured notes of $15,964 and $18,372 as of December 31, 2024 and 2023, respectively, as reflected on our Consolidated Balance Sheets included elsewhere in this report.\n(3)\nFinanced by variable rate debt, but interest rate is capped through an interest rate protection agreement.\n(4)\nDuring 2024, we repaid this borrowing at par at its scheduled maturity date.\nIn addition to consolidated debt, we have scheduled contractual obligations associated with (i) ground leases for land underlying current operating or development communities and commercial and parking facilities and (ii) office leases for our corporate headquarters and regional offices of $16,433,000 for 2025, $16,843,000 for 2026 and $486,656,000 thereafter. \nFuture Financing and Capital Needs—Portfolio and Capital Markets Activity\nWe invest in various real estate and real estate related investments, which include (i) the acquisition, development and redevelopment of communities both wholly-owned and through the formation of joint ventures, (ii) other indirect investments in real estate through the SIP, all as discussed further below and (iii) investments in other real estate-related ventures through direct and indirect investments in property technology and environmentally focused companies and investment management funds.\nIn 2025, we expect to continue to meet our liquidity needs from one or more of a variety of internal and external sources, which may include (i) settlement of our outstanding equity forward contracts, (ii) real estate dispositions, (iii) cash balances on hand as well as cash generated from our operating activities, (iv) borrowing capacity under the Credit Facility, (v) borrowings under the Commercial Paper Program and (vi) secured and unsecured debt financings. Additional sources of liquidity in 2025 may include the issuance of common and preferred equity, including the issuance of additional shares of our common stock under the CEP. Our ability to obtain additional financing will depend on a variety of factors, such as market conditions, the general availability of credit, the overall availability of credit to the real estate industry, our credit ratings and credit capacity, as well as the perception of lenders regarding our long or short-term financial prospects.\nBefore beginning new construction or reconstruction activity, including activity related to communities owned by unconsolidated joint ventures, we plan to source sufficient capital to complete these undertakings, although we cannot assure you that we will be able to obtain such financing. In the event that financing cannot be obtained, we may abandon Development Rights, write off associated pre-development costs that were capitalized and/or forego reconstruction activity. In such instances, we will not realize the increased revenues and earnings that we expected from such Development Rights or reconstruction activity and significant losses could be incurred.\n48 \nTable of Contents\nFrom time to time, we use joint ventures to hold or develop individual real estate assets. We generally employ joint ventures to mitigate asset concentration or market risk and secondarily as a source of liquidity. We may also use joint ventures related to mixed-use land development opportunities and new markets where our partners bring development and operational expertise and/or experience to the venture. Each joint venture or partnership agreement has been individually negotiated, and our ability to operate and/or dispose of a community in our sole discretion may be limited to varying degrees depending on the terms of the joint venture or partnership agreement. We cannot assure you that we will achieve our objectives through joint ventures.\nIn addition, we may invest, through mezzanine loans or preferred equity investments, in multifamily development projects being undertaken by third parties. In these cases, we do not expect to acquire the underlying real estate but rather to earn a return on our investment (through interest or fixed rate preferred equity returns) and a return of the invested capital generally following completion of construction either on or before a set due date.\nIn evaluating our allocation of capital within our markets, we sell assets that do not meet our long-term investment criteria or when capital and real estate markets allow us to realize a portion of the value created over our ownership periods and redeploy the proceeds from those sales to develop, redevelop and acquire communities. Because the proceeds from the sale of communities may not be immediately redeployed into revenue-generating assets that we develop, redevelop or acquire, the immediate effect of a sale of a community for a gain is to increase net income, but reduce future total revenues, total expenses and NOI until such time as the proceeds have been redeployed into revenue generating assets. We believe that the temporary absence of future cash flows from communities sold will not have a material impact on our ability to fund future liquidity and capital resource needs.\nInvestments\nWe invest in consolidated real estate entities, unconsolidated investments in real estate ventures and direct and indirect investments in property technology and environmentally focused companies through investment management funds. \nConsolidated Investments\nDuring the year ended December 31, 2024, we acquired the following communities (dollars in thousands). See Note 5, \"Investments,\" of the Consolidated Financial Statements included elsewhere in this report for further discussion. \nCommunity name\nLocation\nApartment\nhomes\nPurchase price\nAvalon at Pier 121\nLewisville, TX\n300 \n$\n62,100 \nAvalon Perimeter Park\nMorrisville, NC\n262 \n66,500 \nAvalon Cherry Hills \nEnglewood, CO\n306 \n95,000 \nAVA Balboa Park\nSan Diego, CA\n100 \n51,000 \nAvalon Townhomes at Bee Cave\nBee Cave, TX\n126 \n49,000 \nAvalon Lowry\nDenver, CO\n347 \n136,500 \nTotal acquisitions\n1,441 \n$\n460,100 \nIn 2025, the Company entered into agreements to acquire a total of eight apartment communities in the Company’s Texas expansion market. The communities contain a total of 2,701 apartment homes and will be acquired for an aggregate purchase price of $618,500,000. The consideration will take the form of cash and DownREIT units as described in Note 12, “Subsequent Events,” of the Consolidated Financial Statements included elsewhere in this report for further discussion.\nDuring the year ended December 31, 2024, we sold eight wholly-owned communities containing an aggregate of 1,532 apartment homes (dollars in thousands). See Note 6, \"Real Estate Disposition Activities,\" of the Consolidated Financial Statements included elsewhere in this report for further discussion.\n49 \nTable of Contents\nCommunity name\nLocation\nPeriod\nof sale\nApartment\nhomes\nGross\nsales price\nGain on disposition\nCommercial square feet\nAVA Belltown\nSeattle, WA\nQ2 2024\n100 \n$\n34,000 \n$\n22,673 \n1,000 \nAVA North Hollywood \nLos Angeles, CA\nQ2 2024\n156 \n62,100 \n874 \n11,000 \nAvalon Hackensack at Riverside\nHackensack, NJ\nQ2 2024\n226 \n85,600 \n44,834 \n— \nAVA Theater District\nBoston, MA\nQ3 2024\n398 \n212,000 \n77,254 \n— \nAvalon Darien\nDarien, CT\nQ3 2024\n189 \n120,000 \n95,732 \n— \nAvalon New Canaan\nNew Canaan, CT\nQ4 2024\n104 \n75,000 \n60,302 \n— \nAvalon Berkeley\nBerkeley, CA\nQ4 2024\n94 \n32,000 \n7,420 \n— \nAVA Ballard\nSeattle, WA\nQ4 2024\n265 \n105,500 \n54,119 \n12,000 \nTotal asset sales\n1,532 \n$\n726,200 \n$\n363,208 \n24,000 \nIn January 2025, the Company sold Avalon Wilton on River Road, located in Wilton, CT, containing 102 apartment homes for $65,100,000. This sale marks the Company's exit from the Connecticut market.\nUnconsolidated Operating Communities\nDuring the year ended December 31, 2024, we had the following investments in and activity for our unconsolidated real estate and property technology and environmentally focused investments. See Note 5, \"Investments,\" of the Consolidated Financial Statements included elsewhere in this report for further discussion. \n•\nArts District Joint Venture was formed to develop, own, and operate AVA Arts District, an apartment community located in Los Angeles, CA, which completed construction in 2024 and contains 475 apartment homes and 57,000 square feet of commercial space when completed. We have a 25% ownership interest in the venture. As of December 31, 2024, excluding costs incurred in excess of equity in the underlying net assets of the venture, we have an equity investment of $29,932,000 in the venture. The venture has drawn $155,968,000 of $167,147,000 maximum borrowing capacity of the construction loan as of December 31, 2024. While we guarantee 30% of the venture's construction loan, any amounts payable under the guarantee are obligations of the venture partners in proportion to their ownership interest. \n•\nWe invested $11,196,000 in various property technology and environmentally focused companies directly and indirectly through investment management funds during the year ended December 31, 2024. As of December 31, 2024, we have invested $58,122,000 and have $62,494,000 of remaining equity commitments to contribute to these investment management funds, with the timing and amount for these commitments to be fulfilled dependent on if, and when, investment opportunities are identified by the respective funds. During the year ended December 31, 2024, we recognized realized and unrealized gains of $33,137,000 related to these investments, included as a component of income from unconsolidated investments on the Consolidated Statements of Comprehensive Income. \nStructured Investment Program\nDuring the year ended December 31, 2024, we did not enter into any additional commitments under the SIP. As of January 31, 2025, we had funded $188,605,000 for seven outstanding commitments having an aggregate funding commitment of $191,585,000 under the SIP. As of January 31, 2025, our investment commitments had a weighted average rate of return of 11.5% and a weighted average initial maturity date of December 2026. See Note 5, \"Investments,\" of the Consolidated Financial Statements included elsewhere in this report.\nYou should carefully review Part I, Item 1A. \"Risk Factors\" of this Form 10-K for a discussion of the risks associated with our investment activity.\n50 \nTable of Contents\nForward-Looking Statements\nThis Form 10-K contains \"forward-looking statements\" within the meaning of Section 27A of the Securities Act and Section 21E of the Exchange Act. We intend such forward-looking statements to be covered by the safe harbor provisions for forward-looking statements contained in the Private Securities Litigation Reform Act of 1995. The Company's forward-looking statements generally use the words \"believe,\" \"expect,\" \"anticipate,\" \"intend,\" \"estimate,\" \"assume,\" \"project,\" \"plan,\" \"may,\" \"shall,\" \"will,\" \"pursue\" and other similar expressions that indicate future events and trends and do not report historical matters. These statements, among other things, address the Company's intent, belief or expectations with respect to:\n•\ndevelopment, redevelopment, acquisition or disposition of communities;\n•\nthe timing and cost of completion of communities under development or redevelopment;\n•\nthe timing of lease-up, occupancy and stabilization of communities;\n•\nthe pursuit of land for future development;\n•\nthe anticipated operating performance of our communities;\n•\ncost, yield, revenue, NOI and earnings estimates;\n•\nthe impact of landlord-tenant laws and rent regulations, including rent caps;\n•\nour expansion into new regions;\n•\nour declaration or payment of dividends;\n•\nour joint venture activities;\n•\nour policies regarding investments, indebtedness, acquisitions, dispositions, financings and other matters;\n•\nour qualification as a REIT under the Code;\n•\nthe real estate markets in regions where we operate and in general;\n•\nthe availability of debt and equity financing;\n•\ninterest rates;\n•\ninflation, tariffs and other economic conditions, and their potential impacts; \n•\ntrends affecting our financial condition or results of operations;\n•\nregulatory changes that may affect us; and\n•\nthe impact of legal proceedings.\nWe cannot assure the future results or outcome of the matters described in these statements; rather, these statements merely reflect our current expectations of the outcomes of the matters discussed. We do not undertake a duty to update these forward-looking statements, and therefore they may not represent our estimates and assumptions after the date of this report. You should not rely on forward-looking statements because they involve known and unknown risks, uncertainties and other factors, some of which are beyond our control. These risks, uncertainties and other factors may cause our actual results, performance or achievements to differ materially from the anticipated future results, performance or achievements expressed or implied by these forward-looking statements. You should carefully review the discussion under Part I, Item 1A. \"Risk Factors\" in this Form 10-K for further discussion of risks associated with forward-looking statements.\nSome of the factors that could cause our actual results, performance or achievements to differ materially from those expressed or implied by these forward-looking statements include, but are not limited to, the following:\n•\nwe may fail to secure development opportunities due to an inability to reach agreements with third parties to obtain land at attractive prices or to obtain desired zoning and other local approvals;\n•\nwe may abandon or defer development opportunities for a number of reasons, including changes in local market conditions which make development less desirable, increases in costs of development, increases in the cost of capital or lack of capital availability, resulting in losses;\n•\nconstruction costs of a community may exceed original estimates;\n•\nwe may not complete construction and lease-up of communities under development or redevelopment on schedule, resulting in increased interest costs and construction costs and a decrease in expected rental revenues;\n•\noccupancy rates and market rents may be adversely affected by competition and local economic and market conditions which are beyond our control;\n•\nour cash flows from operations and access to cost-effective capital may be insufficient for the development of our pipeline, which could limit our pursuit of opportunities;\n•\nan outbreak of disease or other public health event may affect the multifamily industry and general economy;\n•\nour cash flows may be insufficient to meet required payments of principal and interest, and we may be unable to refinance existing indebtedness or the terms of such refinancing may not be as favorable as the terms of existing indebtedness;\n•\nwe may be unsuccessful in our management of joint ventures and the REIT vehicles that are used with certain joint ventures; \n51 \nTable of Contents\n•\nwe may experience a casualty loss, natural disaster or severe weather event, including those caused by climate change;\n•\nnew or existing laws and regulations implementing rent control or rent stabilization, or otherwise limiting our ability to increase rents, charge fees or evict tenants, may impact our revenue or increase our costs;\n•\nour expectations, estimates and assumptions as of the date of this filing regarding legal proceedings are subject to change; \n•\nthe possibility that we may choose to pay dividends in our stock instead of cash, which may result in stockholders having to pay taxes with respect to such dividends in excess of the cash received, if any; and\n•\ninvestments made under the SIP may not be repaid as expected or the development may not be completed on schedule, which could require us to engage in litigation, foreclosure actions, and/or first party project completion to recover our investment, which may not be recovered in full or at all in such event.\nCritical Accounting Policies and Estimates\nThe preparation of financial statements in conformity with GAAP requires management to use judgment in the application of accounting policies, including making estimates and assumptions. If our judgment or interpretation of the facts and circumstances relating to various transactions had been different, or different assumptions were made, it is possible that different accounting policies would have been applied, resulting in different financial results or a different presentation of our financial statements. Below is a discussion of the accounting policies that we consider critical to an understanding of our financial condition and operating results that may require complex or significant judgment in their application or require estimates about matters which are inherently uncertain. A discussion of our significant accounting policies, including further discussion of the accounting policies described below, can be found in Note 1, \"Organization, Basis of Presentation and Significant Accounting Policies,\" of our Consolidated Financial Statements.\nCost Capitalization\nWe capitalize costs during the development of assets. Capitalization begins when we determine that development of a future asset is probable and continues until the asset, or a portion of the asset, is delivered and is ready for its intended use. For redevelopment efforts, we capitalize costs either (i) in advance of taking apartment homes out of service when significant renovation of the common area has begun and continue until the redevelopment is completed, or (ii) when an apartment home is taken out of service for redevelopment and continue until the redevelopment is completed and the apartment home is available for a new resident. Rental income and operating expenses incurred during the initial lease-up or post-redevelopment lease-up period are fully recognized in earnings as they accrue. \nDuring the development and redevelopment efforts we capitalize all direct costs and indirect costs which have been incurred as a result of the development and redevelopment activities. These costs include interest and related loan fees, property taxes as well as other direct and indirect costs. Interest is capitalized for any project-specific financing, as well as for general corporate financing to the extent of our aggregate investment in the projects. Indirect project costs, which include personnel and office and administrative costs that are clearly associated with our development and redevelopment efforts, are also capitalized. Capitalized indirect costs associated with our development and redevelopment activities are comprised primarily of compensation related costs for associates dedicated to our development and redevelopment efforts and total $50,343,000 and $50,996,000 for 2024 and 2023, respectively. The estimation of the direct and indirect costs to capitalize as part of our development and redevelopment activities requires judgment and, as such, we believe cost capitalization to be a critical accounting estimate.\nThere may be a change in our operating expenses in the event that there are changes in accounting guidance governing capitalization or changes to our levels of development or redevelopment activity. If changes in the accounting guidance limit our ability to capitalize costs or if we reduce our development and redevelopment activities without a corresponding decrease in indirect project costs, there may be an increase in our operating expenses. \nWe capitalize pre-development costs incurred in pursuit of Development Rights. These costs include legal fees, design fees and related overhead costs. Future development of these pursuits is dependent upon various factors, including zoning and regulatory approval, rental market conditions, construction costs and availability of capital. Pre-development costs incurred for pursuits for which future development is not yet considered probable are expensed as incurred. In addition, if the status of a Development Right changes, making future development no longer probable, any capitalized pre-development costs are written off with a charge to expense.\nDue to the subjectivity in determining whether a pursuit will result in the development of an apartment community, and therefore should be capitalized, the accounting for pursuit costs is a critical accounting estimate. As of December 31, 2024, capitalized pursuit costs associated with Development Rights totaled $43,675,000.\n52 \nTable of Contents\nAbandoned Pursuit Costs & Asset Impairment\nWe evaluate our direct and indirect investments in real estate and other long-lived assets for impairment when potential indicators of impairment exist. If events or circumstances indicate that the carrying amount of a property may not be recoverable, we assess its recoverability by comparing the carrying amount of the property to its estimated undiscounted future cash flows. If the carrying amount exceeds the aggregate undiscounted future cash flows, we recognize an impairment loss to the extent the carrying amount exceeds the estimated fair value of the property. We assess land held for development for impairment if our intent changes with respect to the development of the land. We evaluate our unconsolidated investments for impairment, considering both the carrying value of the investment, estimated expected proceeds that it would receive if the entity were dissolved and the net assets were liquidated, as well as our proportionate share of any impairment of assets held by unconsolidated investments.\nThe assessment of impairment can involve subjectivity in determining if indicators are present and in estimating the future undiscounted cash flows or the fair value of an asset. Estimates of the undiscounted cash flows are sensitive to significant assumptions including future rental revenues, operating expenses, and our intent and ability to hold the related asset, which could be impacted by our expectations about the future.\nWe expense costs related to abandoned pursuits, which include the abandonment of Development Rights and costs related to development pursuits not yet considered probable for development, as well as costs incurred in pursuing the acquisition or disposition of assets for which such acquisition and disposition activity did not occur, of which we expensed $18,341,000, $33,479,000 and $16,565,000 of these costs during the years ended December 31, 2024, 2023 and 2022, respectively. These costs are included in expensed transaction, development and other pursuit costs, net of recoveries on the accompanying Consolidated Statements of Comprehensive Income. These costs can vary greatly, and the costs incurred in any given period may be significantly different in future years. \nOur focus on value creation through real estate development presents an impairment risk in the event of a future deterioration of the real estate and/or capital markets or a decision by us to reduce or cease development. We cannot predict the occurrence of future events that may cause an impairment assessment to be performed, or the likelihood of any future impairment charges, if any. You should also review Item 1A. \"Risk Factors\" in this Form 10-K.\n53 \nTable of Contents",
  "item2": null
}