{
  "source_file": "avgo-20250803.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nThis Management’s Discussion and Analysis of Financial Condition and Results of Operations should be read in conjunction with the unaudited condensed consolidated financial statements and the related notes thereto included elsewhere in this Quarterly Report on Form 10-Q (“Form 10-Q”) and the audited consolidated financial statements and notes thereto and management’s discussion and analysis of financial condition and results of operations for the fiscal year ended November 3, 2024 (“fiscal year 2024”) included in our Annual Report on Form 10-K for fiscal year 2024 (“2024 Annual Report on Form 10-K”). This Form 10-Q contains forward-looking statements within the meaning of federal securities laws. These statements are indicated by words or phrases such as “anticipate,” “expect,” “estimate,” “seek,” “plan,” “believe,” “could,” “intend,” “will,” and similar words or phrases. Forward-looking statements provide current expectations of future events based on certain assumptions and include any statement that does not directly relate to any historical or current fact. These forward-looking statements may include our projected financial results or expectations regarding acquisitions, developments in technology, products and seasonality of our business. Such statements are based on current expectations, estimates, forecasts and projections of our industry performance and macroeconomic conditions, based on management’s judgment, beliefs, current trends and market conditions, and involve risks and uncertainties that may cause actual results to differ materially from those contained in the forward-looking statements. We derive many of our forward-looking statements from our operating budgets and forecasts, which are based upon many detailed assumptions. While we believe that our assumptions are reasonable, we caution that it is very difficult to predict the impact of known factors, and it is impossible for us to anticipate all factors that could affect our actual results. Accordingly, we caution you not to place undue reliance on these statements. Material factors that could cause actual results to differ materially from our expectations include, but are not limited to, those disclosed under “Risk Factors” in Part II, Item 1A of this Form 10-Q, and in other documents we file from time to time with the Securities and Exchange Commission (the “SEC”). We undertake no intent or obligation to publicly update or revise any forward-looking statements for any reason, except as required by law.\nUnless stated otherwise or the context otherwise requires, references to “Broadcom,” “we,” “our,” and “us” mean Broadcom Inc. and its consolidated subsidiaries. \nOverview\nWe are a global technology leader that designs, develops and supplies a broad range of semiconductor and infrastructure software solutions. Our semiconductor solutions include a broad portfolio of complex digital and mixed signal complementary metal oxide semiconductor based devices, analog III-V based products, network interface cards and other modules, switches, subsystems and, in some cases, racks that are used in a wide array of environments, end products and applications such as artificial intelligence (“AI”) and enterprise data centers, servers, networking and connectivity equipment, storage systems, home connectivity devices, set-top boxes, broadband access, telecommunication equipment, smartphones and base stations, factory automation, power generation and alternative energy systems, and electronic displays. Our infrastructure software solutions help enterprises simplify their information technology environments so they can increase business velocity and flexibility, and enable customers to plan, develop, deliver, automate, manage and secure applications across mainframe, distributed, edge, mobile, and private and hybrid cloud platforms. Our portfolio of infrastructure and security software is designed to modernize, optimize, and secure the most complex private and hybrid cloud environments, enabling scalability, agility, automation, insights, resiliency and security making it easy for customers to run their mission-critical workloads. We also offer mission-critical fibre channel storage area networking (“FC SAN”) products and related software in the form of modules, switches and subsystems incorporating multiple semiconductor products. \nWe have two reportable segments: semiconductor solutions and infrastructure software. Our semiconductor solutions segment includes all of our semiconductor-based product lines and intellectual property (“IP”) licensing. Our infrastructure software segment includes our private and hybrid cloud, application development and delivery, software-defined edge, application networking and security, mainframe, distributed and cybersecurity solutions, and our FC SAN business.\nQuarterly Highlights\nHighlights during the fiscal quarter ended August 3, 2025 include the following:\n•\nWe generated $7,166 million of cash from operations. \n•\nWe paid $2,786 million in cash dividends.\n•\nWe issued $6,000 million of senior unsecured notes and used the net proceeds to repay the outstanding balance of our floating rate unsecured term loan. \n25\nTable of Contents\nCritical Accounting Estimates\nThe preparation of financial statements in accordance with generally accepted accounting principles in the United States requires us to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenue and expenses during the reporting period. We base our estimates and assumptions on current facts, historical experience and various other factors that we believe to be reasonable under the circumstances, the results of which form the basis for making judgments about the carrying values of assets and liabilities and the accrual of costs and expenses that are not readily apparent from other sources. Our actual financial results may differ materially and adversely from our estimates. Our critical accounting policies are those that affect our historical financial statements materially and involve difficult, subjective or complex judgments by management. Those policies include revenue recognition, business combinations, valuation of goodwill and long-lived assets, and income taxes.\nThere were no significant changes in our critical accounting estimates during the three fiscal quarters ended August 3, 2025 compared to those previously disclosed in “Critical Accounting Estimates” in “Management’s Discussion and Analysis of Financial Condition and Results of Operations” included in the 2024 Annual Report on Form 10-K. \nMacroeconomic Factors\nWe are subject to risks and exposures from the evolving macroeconomic environment, including uncertainty and volatility in financial markets, efforts of governments to stimulate or stabilize the economy and other unfavorable changes in economic conditions, as well as an increase in trade tensions and related tariffs with U.S. trading partners. While difficult to isolate and quantify, these risks and exposures may cause our net revenue to fluctuate significantly and disrupt supply chain operations, and we continuously monitor the broader impacts of these circumstances on our business, our supply chain and our results of operations.\n26\nTable of Contents\nResults of Operations\nFiscal Quarter and Three Fiscal Quarters Ended August 3, 2025 Compared to Fiscal Quarter and Three Fiscal Quarters Ended August 4, 2024\nThe following tables set forth our results of operations for the periods presented:\nFiscal Quarter Ended\nAugust 3,\n2025\nAugust 4,\n2024\nAugust 3,\n2025\nAugust 4,\n2024\n(In millions)\n(As a percentage of net revenue)\nStatements of Operations Data:\nNet revenue:\nProducts\n$\n9,257 \n$\n7,439 \n58 \n%\n57 \n%\nSubscriptions and services\n6,695 \n5,633 \n42 \n43 \nTotal net revenue\n15,952 \n13,072 \n100 \n100 \nCost of revenue:\nCost of products sold\n3,096 \n2,434 \n19 \n19 \nCost of subscriptions and services\n608 \n699 \n4 \n5 \nAmortization of acquisition-related intangible assets\n1,519 \n1,525 \n10 \n12 \nRestructuring charges\n26 \n58 \n— \n— \nTotal cost of revenue\n5,249 \n4,716 \n33 \n36 \nGross margin\n10,703 \n8,356 \n67 \n64 \nResearch and development\n3,050 \n2,353 \n19 \n18 \nSelling, general and administrative\n1,072 \n1,100 \n7 \n9 \nAmortization of acquisition-related intangible assets\n507 \n812 \n3 \n6 \nRestructuring and other charges\n187 \n303 \n1 \n2 \nTotal operating expenses\n4,816 \n4,568 \n30 \n35 \nOperating income\n$\n5,887 \n$\n3,788 \n37 \n%\n29 \n%\n27\nTable of Contents\nThree Fiscal Quarters Ended\nAugust 3,\n2025\nAugust 4,\n2024\nAugust 3,\n2025\nAugust 4,\n2024\n(In millions)\n(As a percentage of net revenue)\nStatements of Operations Data:\nNet revenue:\nProducts\n$\n25,934 \n$\n22,043 \n57 \n%\n59 \n%\nSubscriptions and services\n19,938 \n15,477 \n43 \n41 \nTotal net revenue\n45,872 \n37,520 \n100 \n100 \nCost of revenue:\nCost of products sold\n8,509 \n7,023 \n18 \n19 \nCost of subscriptions and services\n1,764 \n2,366 \n4 \n6 \nAmortization of acquisition-related intangible assets\n4,486 \n4,421 \n10 \n12 \nRestructuring charges\n68 \n203 \n— \n— \nTotal cost of revenue\n14,827 \n14,013 \n32 \n37 \nGross margin\n31,045 \n23,507 \n68 \n63 \nResearch and development\n7,996 \n7,076 \n18 \n19 \nSelling, general and administrative\n3,104 \n3,949 \n7 \n11 \nAmortization of acquisition-related intangible assets\n1,524 \n2,431 \n3 \n6 \nRestructuring and other charges\n445 \n1,215 \n1 \n3 \nTotal operating expenses\n13,069 \n14,671 \n29 \n39 \nOperating income\n$\n17,976 \n$\n8,836 \n39 \n%\n24 \n%\nNet Revenue\nA relatively small number of customers account for a significant portion of our net revenue. Direct sales to one semiconductor solutions customer, which is a distributor, accounted for 32% and 30% of our net revenue for the fiscal quarter and three fiscal quarters ended August 3, 2025, respectively, and 26% and 27% of our net revenue for the fiscal quarter and three fiscal quarters ended August 4, 2024, respectively.\nWe believe aggregate sales to our top five end customers, through all channels, accounted for approximately 40% of our net revenue for each of the fiscal quarter and three fiscal quarters ended August 3, 2025, and 35% and 40% of our net revenue for the fiscal quarter and three fiscal quarters ended August 4, 2024, respectively. We expect to continue to experience significant customer concentration in future periods. The loss of, or significant decrease in demand from, any of our top five end customers could have a material adverse effect on our business, results of operations and financial condition.\nFrom time to time, some of our key semiconductor customers place large orders or delay orders, causing our quarterly net revenue to fluctuate significantly. This is particularly true of our products used in AI and wireless applications as fluctuations may be magnified by the timing of customer deployments, as well as product launches and seasonal variations for wireless applications. For infrastructure software, the transition to subscription licenses, as well as whether or not a customer has the right to terminate, causes variations in revenue recognized in each period.\n28\nTable of Contents\nThe following tables set forth net revenue by segment for the periods presented:\nFiscal Quarter Ended\nThree Fiscal Quarters Ended\nNet Revenue by Segment\nAugust 3, 2025\nAugust 4, 2024\n$ Change\n% Change\nAugust 3, 2025\nAugust 4, 2024\n$ Change\n% Change\n(Dollars in millions)\nSemiconductor solutions\n$\n9,166 \n$\n7,274 \n$\n1,892 \n26 \n%\n$\n25,786 \n$\n21,866 \n$\n3,920 \n18 \n%\nInfrastructure software\n6,786 \n5,798 \n988 \n17 \n%\n20,086 \n15,654 \n4,432 \n28 \n%\nTotal net revenue\n$\n15,952 \n$\n13,072 \n$\n2,880 \n22 \n%\n$\n45,872 \n$\n37,520 \n$\n8,352 \n22 \n%\nFiscal Quarter Ended\nThree Fiscal Quarters Ended\nNet Revenue by Segment\nAugust 3,\n2025\nAugust 4,\n2024\nAugust 3,\n2025\nAugust 4,\n2024\n(As a percentage of net revenue)\nSemiconductor solutions\n57 \n%\n56 \n%\n56 \n%\n58 \n%\nInfrastructure software\n43 \n44 \n44 \n42 \nTotal net revenue\n100 \n%\n100 \n%\n100 \n%\n100 \n%\nNet revenue from our \nsemiconductor solutions segment increased in the fiscal quarter and \nthree fiscal quarters \nended \nAugust 3, 2025 compared to the prior year fiscal periods due to strong demand for our networking products, primarily custom AI accelerators and AI networking solutions.\nNet revenue from our infrastructure software segment increased \nin the fiscal quarter and \nthree fiscal quarters \nended \nAugust 3, 2025 compared to the prior year fiscal periods primarily due to strong demand for our VMware Cloud Foundation (“VCF”) product, including additional license revenue recognized on contracts where customers do not have the right to terminate and the transition to a subscription license model.  \nGross Margin\nGross margin was $10,703 million for the fiscal quarter ended August 3, 2025 compared to $8,356 million for the fiscal quarter ended August 4, 2024, and $31,045 million for the three fiscal quarters ended August 3, 2025 compared to $23,507 million for the three fiscal quarters ended August 4, 2024. The increases were primarily due to higher software revenue and strong product demand for our AI-related semiconductor solutions.\nAs a percentage of net revenue, gross margin was 67% and 68% of net revenue for the fiscal quarter and three fiscal quarters ended August 3, 2025, respectively, and 64% and 63% for the fiscal quarter and three fiscal quarters ended August 4, 2024, respectively. The increases were primarily due to higher software revenue mix and lower amortization of acquisition-related intangible assets as a percentage of revenue.\nResearch and Development Expense\nResearch and development expense increased $697 million, or 30%, and $920 million, or 13%, for the fiscal quarter and three fiscal quarters ended August 3, 2025, respectively, compared to the prior year fiscal periods. The increases were primarily due to higher stock-based compensation. \nSelling, General and Administrative Expense\nSelling, general and administrative expense decreased $28 million, or 3%, and $845 million, or 21%, for the fiscal quarter and three fiscal quarters ended August 3, 2025, respectively, compared to the prior year fiscal periods. The decreases were primarily due to lower compensation resulting from a decrease in headcount and lower VMware acquisition-related costs. The decrease in the fiscal quarter ended August 3, 2025 compared to the prior year fiscal period was partially offset by higher stock-based compensation.\n29\nTable of Contents\nAmortization of Acquisition-Related Intangible Assets\nAmortization of acquisition-related intangible assets recognized in operating expenses decreased $305 million, or 38%, and $907 million, or 37%, for the fiscal quarter and three fiscal quarters ended August 3, 2025, respectively, compared to the prior year fiscal periods primarily due to full amortization of customer-related intangible assets from previous software acquisitions other than VMware.\nRestructuring and Other Charges\nRestructuring and other charges recognized in operating expenses decreased $116 million, or 38%, and $770 million, or 63%, for the fiscal quarter and three fiscal quarters ended August 3, 2025, respectively, compared to the prior year fiscal periods primarily due to lower employee termination costs associated with the integration of the VMware business. \nStock-Based Compensation Expense\nDuring the fiscal quarter ended May 4, 2025, we granted two-year time- and market-based restricted stock unit awards (the “Two-Year Equity Awards”), in lieu of our annual employee equity awards historically granted in the second quarter of each fiscal year. Each Two-Year Equity Award vests on the same basis as two annual grants with staggered vesting start dates of March 15, 2025 and March 15, 2026 and successive four-year vesting periods. We recognize stock-based compensation expense related to these awards from the grant date through their respective vesting date, ranging from four to five years.\nTotal stock-based compensation expense was $2,322 million and $1,381 million for the fiscal quarters ended August 3, 2025 and August 4, 2024, respectively, and $5,373 million and $4,356 million for the three fiscal quarters ended August 3, 2025 and August 4, 2024, respectively. The increases were due to the Two-Year Equity Awards granted at higher grant-date fair values, partially offset by the full vesting and forfeitures of certain equity awards assumed in the VMware acquisition.\nThe following table sets forth the total unrecognized compensation cost related to unvested stock-based awards outstanding and expected to vest as of August 3, 2025. The remaining weighted-average service period was 3.6 years. \nFiscal Year:\nUnrecognized Compensation Cost, Net of Expected Forfeitures\n(In millions)\n2025 (remainder)\n$\n2,172 \n2026\n8,104 \n2027\n6,925 \n2028\n4,772 \n2029\n2,487 \nThereafter\n597 \nTotal\n$\n25,057 \nSegment Operating Results\nFiscal Quarter Ended\nThree Fiscal Quarters Ended\nOperating Income by Segment\nAugust 3,\n2025\nAugust 4,\n2024\n$ Change\n% Change\nAugust 3,\n2025\nAugust 4,\n2024\n$ Change\n% Change\n(Dollars in millions)\nSemiconductor solutions\n$\n5,217 \n$\n4,042 \n$\n1,175 \n29 \n%\n$\n14,729 \n$\n12,136 \n$\n2,593 \n21 \n%\nInfrastructure software\n5,238 \n3,906 \n1,332 \n34 \n%\n15,347 \n9,789 \n5,558 \n57 \n%\nUnallocated expenses\n(4,568)\n(4,160)\n(408)\n10 \n%\n(12,100)\n(13,089)\n989 \n(8)\n%\nTotal operating income\n$\n5,887 \n$\n3,788 \n$\n2,099 \n55 \n%\n$\n17,976 \n$\n8,836 \n$\n9,140 \n103 \n%\nOperating income from our semiconductor solutions segment increased for the fiscal quarter and three fiscal quarters ended August 3, 2025 compared to the prior year fiscal periods due to strong demand for our networking products, primarily custom AI accelerators and AI networking solutions.\nHigher operating income from our infrastructure software segment in the fiscal quarter and three fiscal quarters ended August 3, 2025 compared to the prior year fiscal periods was primarily due to strong demand for our VCF product, including additional license revenue recognized on contracts where customers do not have the right to terminate and the transition to a subscription license model.\n30\nTable of Contents\nUnallocated expenses include amortization of acquisition-related intangible assets, stock-based compensation expense, restructuring and other charges, acquisition-related costs, and other costs, which are not used in evaluating the results of, or in allocating resources to, our segments. Unallocated expenses increased 10% for the fiscal quarter ended August 3, 2025 compared to the prior year fiscal period primarily due to higher stock-based compensation expense, partially offset by lower amortization of acquisition-related intangible assets, and decreased 8% for the three fiscal quarters ended August 3, 2025 compared to the prior year fiscal period primarily due to lower restructuring and other charges and lower amortization of acquisition-related intangible assets, partially offset by higher stock-based compensation expense.\nNon-Operating Income and Expenses\nInterest expense.\n Interest expense was $807 million and $2,449 million for the fiscal quarter and three fiscal quarters ended August 3, 2025, respectively, and $1,064 million and $3,037 million for the fiscal quarter and three fiscal quarters ended August 4, 2024, respectively. The decreases were primarily from an overall reduction in outstanding debt balances and debt refinancing activities that drove lower effective interest rates compared to the prior year fiscal periods. \nOther income, net.\n Other income, net includes interest income, gains and losses on investments, foreign currency remeasurement and other miscellaneous items. Other income, net, was $205 million and $82 million for the fiscal quarters ended August 3, 2025 and August 4, 2024, respectively. The increase was primarily due to a gain on the sale of a business. Other income, net was $333 million and $354 million for the three fiscal quarters ended August 3, 2025 and August 4, 2024, respectively. The decrease was primarily due to lower interest income as a result of lower interest rates on lower invested balances, partially offset by a gain on the sale of a business.\nProvision for income taxes.\n On July 4, 2025, the United States enacted the One Big Beautiful Bill Act, which allows for the immediate expensing of domestic research and development costs, certain capital expenditures, and changes to the United States taxation of profits derived from foreign operations. As a result, it is no longer more-likely-than-not that we are able to utilize our federal corporate alternative minimum tax (“CAMT”) credits, and we established a $1,058 million valuation allowance against our CAMT credit carryforwards and CAMT credits generated in the current fiscal year. Our policy is to not consider the impact of future years’ CAMT in our valuation allowance assessment for regular deferred tax assets. Most of the provisions are effective beginning in our fiscal years ending November 1, 2026 or October 31, 2027, with immediate expensing of qualifying property being effective in fiscal year 2025. We will continue to evaluate the full impact of these legislative changes as more guidance becomes available.\nThe provision for income taxes was $1,145 million and $1,252 million for the fiscal quarter and three fiscal quarters ended August 3, 2025, respectively, and was primarily due to the impact from a valuation allowance against our CAMT credits, income before income taxes, and the jurisdictional mix of income, partially offset by excess tax benefits from stock-based awards.\nThe provision for income taxes was $4,238 million and $4,190 million for the fiscal quarter and three fiscal quarters ended August 4, 2024, respectively, and was primarily due to an intra-group transfer of certain IP rights during the fiscal quarter ended August 4, 2024 to the United States as a result of supply chain realignment and the resulting shift in the jurisdictional mix of income, partially offset by excess tax benefits from stock-based awards.\nLiquidity and Capital Resources\nThe following section discusses our principal liquidity and capital resources as well as our principal liquidity requirements and uses of cash. Our cash and cash equivalents are maintained in highly liquid investments with remaining maturities of 90 days or less at the time of purchase. We believe our cash equivalents are liquid and accessible.\nOur primary sources of liquidity as of August 3, 2025 consisted of: (i) $10,718 million in cash and cash equivalents, (ii) cash we expect to generate from operations and (iii) available capacity under our $7.5 billion unsecured revolving credit facility. In addition, we may also generate cash from the sale of assets and debt or equity financings from time to time.\nOur short-term and long-term liquidity requirements primarily arise from: (i) business acquisitions and investments we may make from time to time, (ii) working capital requirements, (iii) research and development and capital expenditure needs, (iv) cash dividend payments (if and when declared by our Board of Directors), (v) interest and principal payments related to our $66,257 million of outstanding indebtedness with $1,400 million principal amounts payable within 12 months, (vi) discretionary share repurchases, and (vii) payment of income taxes. Our ability to fund these requirements will depend, in part, on our future cash flows, which are determined by our future operating performance and, therefore, subject to prevailing global macroeconomic conditions and financial, business and other factors, some of which are beyond our control. \nWe believe that our cash and cash equivalents on hand, cash flows from operations and our revolving credit facility will provide sufficient liquidity to operate our business and fund our current obligations for at least the next 12 months. For additional information regarding our cash requirement from contractual obligations and indebtedness, see Note 11. “Commitments and Contingencies” and Note 7. “Borrowings” in Part I, Item 1 of this Form 10-Q.\n31\nTable of Contents\nFrom time to time, we engage in discussions with third parties regarding potential acquisitions of, or investments in, businesses, technologies and product lines. Any such transaction, or evaluation of potential transactions, could require significant use of our cash and cash equivalents, or require us to increase our borrowings to fund such transactions. If we do not have sufficient cash to fund our operations or finance growth opportunities, including acquisitions, or unanticipated capital expenditures, our business and financial condition could suffer. In such circumstances, we may seek to obtain new debt or equity financing. However, we cannot assure you that such additional financing will be available on terms acceptable to us or at all. Our ability to service our outstanding indebtedness and any other indebtedness we may incur will depend on our ability to generate cash in the future. We may also elect to sell additional debt or equity securities for reasons other than those specified above.\nIn addition, we may, at any time and from time to time, seek to retire or purchase our outstanding debt through cash tenders and/or exchanges for equity or debt, in open-market purchases, privately negotiated transactions or otherwise. Such tenders, exchanges or purchases, if any, will be upon such terms and at such prices as we may determine, and will depend on prevailing market conditions, our liquidity requirements, contractual restrictions and other factors. We may also make additional prepayments of our outstanding term loans. The amounts involved may be material.\nWorking Capital\nWorking capital increased to $8,294 million at August 3, 2025 from $2,898 million at November 3, 2024. The increase was primarily attributable to the following:\n•\nCash and cash equivalents increased to $10,718 million at August 3, 2025 from $9,348 million at November 3, 2024, primarily due to $19,834 million in net cash provided by operating activities, partially offset by $8,345 million of dividend payments, $3,860 million of employee withholding tax payments related to net settled equity awards, $3,657 million of net repayments of borrowings, and $2,450 million of common stock repurchases.\n•\nTrade accounts receivable, net increased to $6,494 million at August 3, 2025 from $4,416 million at November 3, 2024 primarily due to higher billings and the timing of collections.\n•\nOther current assets increased to $5,606 million at August 3, 2025 from $4,071 million at November 3, 2024 primarily from higher software contract assets, offset in part by lower prepaid taxes.\nCapital Returns\nThree Fiscal Quarters Ended\nCash Dividends Declared and Paid\nAugust 3,\n2025\nAugust 4,\n2024\n(In millions, except per share data)\nDividends per share to common stockholders\n$\n1.770 \n$\n1.575 \nDividends to common stockholders\n$\n8,345 \n$\n7,330 \nIn April 2025, our Board of Directors authorized a stock repurchase program to repurchase up to $10 billion of our common stock from time to time through December 31, 2025. During the fiscal quarter ended May 4, 2025, we repurchased and retired 16 million shares of our common stock for $2,450 million under this stock repurchase program. As of August 3, 2025, $7,550 million of the authorized amount remained available for repurchases. \nRepurchases under this stock repurchase program may be effected through a variety of methods, including open market or privately negotiated purchases. The timing and amount of shares repurchased will depend on the stock price, business and market conditions, corporate and regulatory requirements, alternative investment opportunities, acquisition opportunities, and other factors. We are not obligated to repurchase any specific amount of shares of common stock, and the stock repurchase program may be suspended or terminated at any time.\nIn December 2021 and May 2022, our Board of Directors authorized stock repurchase programs to repurchase up to an aggregate of $20 billion of our common stock from time to time prior to December 31, 2023. During the fiscal quarter ended February 4, 2024, we repurchased and retired 67 million shares of our common stock for $7,176 million, and all $20 billion of the aggregate authorized amount was utilized prior to expiration on December 31, 2023.\nDuring the three fiscal quarters ended August 3, 2025 and August 4, 2024, we paid $3,860 million and $4,012 million, respectively, in employee withholding taxes due upon the vesting of net settled equity awards. We withheld 17 million and 30 million shares of common stock from employees in connection with such net share settlements during the three fiscal quarters ended August 3, 2025 and August 4, 2024, respectively. Beginning in the fiscal quarter ended August 3, 2025, we settle withholding taxes upon the vesting of employee equity awards using proceeds from the sale of a portion of the vested shares, thereby eliminating our cash outflow for employee withholding taxes on equity award vesting.\n32\nTable of Contents\nCash Flows\nThree Fiscal Quarters Ended\nAugust 3,\n2025\nAugust 4,\n2024\n(In millions)\nNet cash provided by operating activities\n$\n19,834 \n$\n14,358 \nNet cash used in investing activities\n(213)\n(22,938)\nNet cash provided by (used in) financing activities\n(18,251)\n4,343 \nNet change in cash and cash equivalents\n$\n1,370 \n$\n(4,237)\nOperating Activities\nCash flows from operating activities consist of net income adjusted for certain non-cash and other items and changes in assets and liabilities. The $5,476 million increase in cash provided by operations during the three fiscal quarters ended August 3, 2025 compared to the prior year fiscal period was primarily due to $13,037 million higher net income, offset in part by $3,816 million lower non-cash adjustments for deferred taxes and other non-cash taxes, as well as $3,576 million from changes in operating assets and liabilities. \nInvesting Activities\nCash flows from investing activities primarily consist of cash related to acquisitions and divestitures, capital expenditures and proceeds and payments related to investments. The $22,725 million decrease in cash used in investing activities during the three fiscal quarters ended August 3, 2025 compared to the prior year fiscal period was primarily due to $25,416 million cash paid in connection with the acquisition of VMware, net of cash acquired, in the prior year fiscal period, offset in part by $3,185 million lower proceeds from sales of businesses during the three fiscal quarters ended August 3, 2025 compared to the prior year fiscal period.\nFinancing Activities\nCash flows from financing activities primarily consist of proceeds and payments related to our borrowings, dividend payments, employee withholding tax payments related to net settled equity awards and authorized stock repurchases. Cash flows from financing activities during the three fiscal quarters ended August 3, 2025 compared to the prior year fiscal period decreased $22,594 million. The decrease was primarily from the net proceeds from term loans issued in connection with the acquisition of VMware in the prior year fiscal period, debt repayments and higher dividend payments in the current year fiscal period, offset in part by a decrease in stock repurchases."
}