{
  "source_file": "avgo-20241103.htm",
  "form_type": "10-K",
  "item1": "ITEM 1.\nBUSINESS\nOverview\nWe are a global technology leader that designs, develops and supplies a broad range of semiconductor and infrastructure software solutions. Our over 60-year history of innovation dates back to our diverse origins from AT&T/Bell Labs, Lucent and Hewlett-Packard Company, and evolved with LSI Corporation, Broadcom Corporation, Brocade Communications Systems LLC, CA, Inc., Symantec Enterprise Security, and VMware, Inc. (“VMware”). Over the years, we have assembled a large team of semiconductor and software design engineers around the world. We maintain design, product and software development engineering resources at locations in the U.S., Asia, Europe and Israel, providing us with engineering expertise worldwide. We combine global scale, engineering depth, broad product portfolio diversity, superior execution and operational focus to deliver category-leading semiconductor and infrastructure software solutions.\nWe develop semiconductor devices with a focus on complex digital and mixed signal complementary metal oxide semiconductor (“CMOS”) based devices and analog III-V based products. We offer thousands of products that are used in end products such as enterprise and data center networking, including artificial intelligence (“AI”) networking and connectivity, home connectivity, set-top boxes (“STB”), broadband access, telecommunication equipment, smartphones and base stations, data center servers and storage systems, factory automation, power generation and alternative energy systems, and electronic displays. We differentiate ourselves through our high-performance design and integration capabilities and focus on developing semiconductor products for target markets where we believe we can earn attractive margins. \nOur infrastructure software solutions help enterprises simplify their information technology (“IT”) environments so they can increase business velocity and flexibility, and enable customers to plan, develop, deliver, automate, manage, and secure applications across mainframe, distributed, edge, mobile, and private and hybrid cloud platforms. Many of the largest companies in the world, including most of the Fortune 500, and many government agencies rely on our software solutions to help manage and secure their on-premises and hybrid cloud environments, private cloud infrastructure and AI data centers. Our portfolio of industry-leading infrastructure and security software is designed to modernize, optimize, and secure the most complex private and hybrid cloud environments, enabling scalability, agility, automation, insights, resiliency and security, making it easy for customers to run their mission-critical workloads. We also offer mission-critical fibre channel storage area networking (“FC SAN”) products and related software in the form of modules, switches and subsystems incorporating multiple semiconductor products.\nOn November 22, 2023, we acquired VMware in a cash-and-stock transaction (the “VMware Merger”), in which VMware stockholders received, in aggregate, approximately $30.8 billion in cash and 544 million shares of Broadcom common stock (on a split adjusted basis) with a fair value of $53.4 billion. We funded the cash portion of the VMware Merger consideration with net proceeds from the issuance of $30.4 billion in term loans under a credit agreement that we entered into on August 15, 2023, as well as cash on hand. Following the VMware Merger, we sold VMware’s end-user computing business to KKR & Co. Inc. for cash consideration of \n$3.5 billion\n, after working capital adjustments. With the VMware Merger, we have bolstered our infrastructure software solutions and are able to offer our customers a greater capacity to address complex IT infrastructure issues.\nBusiness Strategy\nOur strategy is focused on technology leadership and category-leading semiconductor and infrastructure software solutions delivering a comprehensive suite of innovative infrastructure technology products to the world’s leading business and government customers. We seek to achieve this through strategic acquisitions of businesses and technologies, as well as extensive internal research and development, to ensure our products retain their technology market leadership. This strategy results in a robust business model designed to drive diversified and sustainable operating and financial results.\nProducts and Markets\nSemiconductor Solutions\nSemiconductors are made by imprinting a network of electronic components onto a semiconductor wafer. These devices are designed to perform various functions such as processing, amplifying and selectively filtering electronic signals, controlling electronic system functions and processing, and transmitting and storing data. Our digital and mixed signal products are based on silicon wafers with CMOS transistors offering fast switching speeds and low power consumption, which are both critical design factors for the markets we serve. We also offer analog products, which are based on III-V semiconductor materials that have higher electrical conductivity than silicon, and thus tend to have better performance characteristics in radio frequency (“RF”), and optoelectronic applications. III-V refers to elements from the 3rd and 5th groups in the periodic table of chemical elements. Examples of these materials used in our products are gallium arsenide (“GaAs”) and indium phosphide (“InP”). \n3\nTable of Contents\nOur product portfolio ranges from discrete devices to complex sub-systems that include multiple device types and may also incorporate firmware for interfacing between analog and digital systems. In some cases, our products include mechanical hardware that interfaces with optoelectronic or capacitive sensors. We focus on markets that require high quality, leading technology and integrated performance characteristics of our products. The table below presents our key semiconductor product families and their major end markets and applications.\nMajor End Markets\nMajor Applications\nKey Product Offerings\nNetworking\n•   Data Center, Service Provider, and Enterprise Networking\n•   Ethernet switching and routing silicon\n•   Custom silicon solutions\n•   Optical and copper PHYs\n•   Fiber optic transmitter and receiver components\nWireless\n•   Mobile Device Connectivity\n•   RF front end modules and filters\n•   Wi-Fi, Bluetooth, GPS/GNSS SoCs\n•   Custom touch controllers\n•   Inductive charging ASICs\nStorage\n•   Servers and Storage Systems\n•   SAS and RAID controllers and adapters\n•   PCIe switches\n•   Fibre channel host bus adapters\n•   Ethernet NIC\n•   HDD and SSD\n•   Read channel based SoCs; Custom flash controllers\n•   Preamplifiers\nBroadband\n•   STB and Broadband Access\n•   STB SoCs\n•   DSL/PON gateways\n•   DOCSIS cable modem and networking infrastructure\n•   DSLAM/PON optical line termination\n•   Wi-Fi access point SoCs\nIndustrial\n•   Factory Automation, Renewable Energy and Automotive Electronics\n•   Optocouplers\n•   Industrial fiber optics\n•   Industrial and medical sensors\n•   Motion control encoders and subsystems\n•   Light emitting diodes\n•   Ethernet PHYs, switch ICs and camera microcontrollers\nData Center, Service Provider, and Enterprise Networking Solutions. \nWe provide semiconductor solutions for managing the movement of data in data center, service provider, and enterprise networking applications. Our products offer an enhanced, open, standards-based Ethernet network interface card (“NIC”) and switching solution to resolve connectivity bottlenecks in data centers, particularly in AI data centers where compute bandwidth and cluster sizes grow rapidly.  \n•\nEthernet Switching & Routing:\n Ethernet is a ubiquitous interconnection technology that enables high-performance and cost-effective networking infrastructure. We offer a broad set of Ethernet switching and routing products that are optimized for AI data center, service provider and enterprise networks. In the data center market, our high capacity, low latency, switching silicon supports advanced protocols around virtualization and multi-pathing. Our Ethernet switching fabric technologies provide the ability to build highly scalable flat networks supporting tens of thousands of servers. Our service provider switch portfolio enables carrier networks to support prioritized delivery of data traffic in the wireless backhaul, access, aggregation and core of their networks. For enterprise networks, we offer product families with secure, encrypted switching capabilities and support lower power modes that comply with industry standards around energy efficient Ethernet.\n•\nCustom Silicon Solutions: \nWe provide advanced technology and intellectual property (“IP”) platforms for customers to design and develop application specific integrated circuits (“ASICs”) targeting AI and high-performance computing, networking and storage applications. Our custom silicon provides the platform to integrate embedded logic, memory, serializer/deserializer (“SerDes”) technology, IP cores and processor cores. ASICs are custom products built to individual customers specifications.\n•\nPhysical Layer Devices:\n These devices, also referred to as PHYs, are transceivers that enable the reception and transmission of Ethernet data packets over a physical medium such as copper wire or optical fibers. Our high \n4\nTable of Contents\nperformance Ethernet transceivers are built upon a proprietary digital signal processing communication architecture optimized for high-speed network connections and support the latest standards and advanced features, such as energy efficient Ethernet, data encryption and time synchronization. We also offer a range of automotive Ethernet products, including PHYs, switches and camera microcontrollers, to meet growing consumer demand for in-vehicle connectivity and smart vision.\n•\nFiber Optic Components:\n We supply a wide array of optical components to the Ethernet networking, storage, and access, metro- and long-haul telecommunication markets. Our optical components enable the high speed reception and transmission of data through optical fibers. \nMobile Device Connectivity Solutions. \nWe provide a broad variety of RF semiconductor devices, wireless connectivity solutions, custom touch controllers and inductive charging solutions for the wireless market.\n•\nRF Semiconductor Devices:\n Our RF semiconductor devices selectively filter, as well as amplify and route, RF signals. Filters enable modern wireless communication systems to support a large number of subscribers simultaneously by ensuring that the multiple transmissions and receptions of voice and data streams do not interfere with each other. We were among the first to deliver commercial film bulk acoustic resonator (“FBAR”) filters that offer technological advantages over competing filter technologies, to allow mobile handsets to function more efficiently in today's congested RF spectrum. FBAR technology has a significant market share within the cellular handset market. Our RF products include multi-chip module front-end modules that integrate transmit/receive switching and filtering functions for multiple frequency bands, filter modules and discrete filters, all using our proprietary FBAR technology.\nOur expertise in FBAR technology, amplifier design, and module integration enables us to offer industry-leading performance in cellular RF transceiver applications. \n•\nConnectivity Solutions:\n Our connectivity solutions include discrete and integrated Wi-Fi and Bluetooth solutions, and global positioning system/global navigation satellite system (“GPS/GNSS”) receivers, designed for use in mobile devices including smartphones, tablets and wearable products.\nWi-Fi allows devices on a local area network to communicate wirelessly, adding the convenience of mobility to the utility of high-speed data networks. We offer a family of high performance, low power Wi-Fi chipsets. Bluetooth is a low power technology that enables direct connectivity between devices. We offer Bluetooth silicon and software solutions that enable manufacturers to easily and cost-effectively add Bluetooth functionality. These solutions include combination chips that offer integrated Wi-Fi and Bluetooth functionality, which provides significant performance advantages over discrete solutions.\nWe also offer a family of GPS, assisted-GPS and GNSS semiconductor products, software and data services. These products are part of a broader location platform that leverages a broad range of communications technologies, including Wi-Fi, Bluetooth and GPS, to provide more accurate location and navigation capabilities.\n•\nCustom Touch Controllers:\n Our touch controllers process signals from touch screens in mobile handsets and tablets.\n•\nInductive Charging ASICs:\n Our custom inductive charging ASIC devices offer high efficiency and are highly integrated solutions for mobile and wearable devices.\nServers and Storage System Solutions. \nWe provide semiconductor solutions for enabling secure movement of digital data to and from host machines, such as servers, personal computers and storage systems, to the underlying storage devices, such as hard disk drives (“HDD”) and solid-state drives (“SSD”).\n•\nSAS, RAID & PCIe Products:\n We provide serial attached small computer system interface (SAS) and redundant array of independent disks (RAID) controller and adapter solutions to server and storage system original equipment manufacturers (“OEMs”). These solutions enable secure and high-speed data transmission between a host computer, such as a server, and storage peripheral devices, such as HDD, SSD and optical disk drives and disk and tape-based storage systems. Some of these solutions are delivered as stand-alone semiconductors, typically as a controller. Other solutions are delivered as circuit boards, known as adapter products, which incorporate our semiconductors onto a circuit board with other features. RAID technology is a critical part of our server storage connectivity solutions as it provides protection against the loss of critical data resulting from HDD failures.\nWe also provide interconnect semiconductors that support the peripheral component interconnect express (“PCIe”) communication standards. PCIe is the primary interconnection mechanism inside computing systems today.  \n•\nFibre Channel Products:\n We provide fibre channel host bus adapters, which connect host computers such as servers to FC SANs. \n•\nEthernet NIC Controllers:\n Our Ethernet NIC controllers are designed for high-performance virtualization, intelligent flow processing, secure data center connectivity, and machine learning.\n5\nTable of Contents\n•\nHDD & SSD Solutions:\n We provide read channel-based system-on-chip (“SoC”) and preamplifiers to HDD OEMs. These are the critical chips required to read, write and protect data. An HDD SoC is an integrated circuit (“IC”) that combines the functionality of a read channel, serial interface, memory and a hard disk controller in a small, high-performance, low-power and cost-effective package. Read channels convert analog signals that are generated by reading the stored data on the physical media into digital signals. \nIn addition, we sell preamplifiers, which are complex, high speed, mixed signal devices that enable writing and reading data to and from the HDD heads. The preamplifier interfaces with the SoC to provide the electronics data path in a HDD.\nWe also provide custom flash controllers to SSD OEMs. An SSD stores data in flash memory instead of on a hard disk, providing high speed access to the data. Flash controllers manage the underlying flash memory in SSDs, performing critical functions such as reading and writing data to and from the flash memory and performing error correction, wear leveling and bad block management.\nBroadband Solutions. \nWe provide semiconductor solutions for enabling STBs and broadband access applications.\n•\nSet-Top Box:\n We offer complete SoC platform solutions for cable, satellite, Internet Protocol television, over-the-top and terrestrial STBs. Our products enable global service providers to introduce new and enhanced technologies and services in STBs, including transcoding, digital video recording functionality, higher definition video processing, increased networking capabilities, and more tuners to enable faster channel change and more simultaneous recordings. We are also enabling service providers in deploying High Efficiency Video Coding (“HEVC”), a video compression format that is a successor to the H.264/MPEG-4 format. HEVC enables ultra-high definition (“Ultra HD”) services by effectively doubling the capacity of existing networks to deploy new or existing content. Our families of STB solutions support the complete range of resolutions, from standard definition to high definition to Ultra HD.\n•\nBroadband Access:\n We offer complete SoC platform solutions for digital subscriber line (“DSL”), cable, passive optical networking (“PON”) and wireless local area network for both consumer premise equipment (“CPE”) and central office (“CO”) deployments. Our CPE devices are used in broadband modems, residential gateways and Wi-Fi access points and routers. Our CO devices, including DSL Access Multiplexer (“DSLAM”), cable modem termination systems and PON optical line termination medium access controllers, are empowering modern operator broadband infrastructure. Our products enable global service providers to continue deploying next generation broadband access technologies across multiple standards, including G.fast, Data Over Cable Service Interface Specifications (“DOCSIS”), PON and Wi-Fi to provide more bandwidth and faster speeds to consumers. \nFactory Automation, Renewable Energy and Automotive Electronic Solutions.\n We provide a broad variety of products for the general industrial and automotive markets, including optocouplers, industrial fiber optics, industrial and medical sensors, motion encoders, light emitting diode devices, and Ethernet ICs. Our industrial products are used in a diverse set of applications, spanning industrial automation, power generation and distribution systems, medical systems and equipment, defense and aerospace, and vehicle subsystems including those used in electric vehicle powertrain, infotainment and advanced driver assistance systems.\nInfrastructure Software \nOur infrastructure software solutions offer customers greater choice and flexibility to build, run, manage, connect and protect applications and data at scale across data center and private and hybrid cloud environments.\n6\nTable of Contents\nThe table below presents our software portfolios and their key offerings.\nSoftware Portfolio\nPortfolio Description\nKey Portfolio Offerings\nPrivate Cloud\n•\nCloud infrastructure that is ubiquitous, flexible, and integrated across on-premises, edge, public and partner clouds\n•   VMware Cloud Foundation\n•   VMware Cloud Foundation Edge\n•   VMware vSphere Foundation\n•   Private AI\n•   Live Recovery\n•   Telco Cloud Platform\nTanzu\n•\nComprehensive solutions for application development operations and optimization\n•   Tanzu Platform\n•   Tanzu Data Solutions\n•   Tanzu CloudHealth\n•   Tanzu Labs\nVeloCloud\n•\nComprehensive software-defined network solutions that enable enterprise edge connectivity and performance over Internet, fixed wireless access and satellite while simplifying deployments and reducing costs\n•   SD-WAN and SASE\n•   VeloRAIN\n•   Fixed Wireless Access\nApplication Networking and Security\n•\nComprehensive software-defined solutions featuring lateral security that protects VCF application traffic from malware and ransomware, and application load balancing with the only plug-and-play app delivery and security solution for VCF private cloud\n•   Lateral Security Firewall\n•   Advanced Threat Protection\n•   Advanced Load Balancing\nMainframe Software\n•   DevOps, AIOps, Security, Workload Automation, Data Management, Foundational Software Solutions, and Beyond Code programs\n•   Operational Analytics & Management\n•   Workload Automation\n•   Database & Data Management\n•   Application Development & Testing\n•   Identity & Access Management\n•   Compliance & Data Protection\n•   Security Insights\n•   Beyond Code programs\nDistributed Software\n•  Solutions that optimize the planning, development and delivery of business critical services\n•   ValueOps\n•   DevOps\n•   AIOps\nEnterprise Security\n•   Comprehensive cybersecurity and compliance solutions that secure against threats and compliance risks by protecting users and data on any app, device, or network\n•   Endpoint Security\n•   Network Security\n•   Information Security\n•   Application Security\n•   Identity Security\nFC SAN Management\n•   Solutions that transform current storage networks with autonomous SAN capabilities\n•   Fibre Channel Switch\nPayment Security\n•   Arcot payment authentication network powered by 3-D Secure\n•   Payment Security Suite\nPrivate Cloud Software Portfolio. \nOur private cloud infrastructure software delivers public cloud scale and agility with private cloud security, resilience and performance, and low overall total cost of ownership. Our VMware software supports customers’ digital innovation with faster infrastructure modernization, a unified cloud experience and better platform security and cyber resiliency. The full portfolio is available directly from Broadcom, resellers and distributors, hyperscale cloud providers, value-added OEMs and VMware cloud service provider partners. VMware Cloud Foundation (“VCF”) provides license portability, which enables customers to purchase subscriptions of VCF software and move their VCF environments between on-premises data centers and supported cloud endpoints. Advanced services for Private AI provide customers with the benefits of AI without having to compromise control of data, privacy, and compliance by bringing the AI model to customers’ data.\n•\nVCF:\n VCF delivers integrated, enterprise-class compute, networking, storage, management, and security across any environment. VCF includes native Kubernetes to support both virtual machines and containerized workloads on a single platform, enables advanced AI and machine learning workloads at enterprise scale and offers integrated data services capabilities. Our solutions enhance our customers’ ability to continuously optimize performance and costs, protect the \n7\nTable of Contents\nbusiness from threats and enable the business to focus on outcomes instead of operations through advanced observability and insights.\n•\nVMware Cloud Foundation Edge\n: The edge compute stack designed to deliver frictionless management of edge apps and infrastructure across many sites with limited resources. It efficiently manages infrastructure and applications at dispersed sites.  \n•\nvSphere Foundation IT Infrastructure Optimization:\n vSphere Foundation supports modern IT requirements by boosting operational efficiency, elevating security and supercharging workload performance, all in support of accelerating innovation.\n•\nPrivate AI: \nThis solution enables organizations to use generative AI technologies while addressing privacy and compliance needs of the organization.\n•\nLive Recovery: \nThis solution helps organizations combat the evolving threat landscape through solutions and technologies that enable organizational resilience through rapid recovery of applications, data and critical business services.\n•\nTelco Cloud Platform: \nThis solution supports network operations for telecom operators and communications service providers to modernize their infrastructure and allows them to create monetizable services. The modernization of the telecom infrastructure is critical to enabling operational agility, onboarding and delivering services much faster across domains and simplifying operations with automation.\nTanzu Software Portfolio. \nOur application development, operations and optimization solutions help leading enterprises deliver highly performant applications and best-in-class user experiences.\n•\nTanzu Platform: \nThis cloud native application platform accelerates software delivery, providing platform engineering teams with enhanced governance and operational efficiency while reducing toil and complexity for development teams. Tanzu Platform includes access to content including enterprise-ready curated distributions of open source software technologies used for storing and processing data. It also includes Tanzu AI Solutions, a set of capabilities that help application teams deliver generative AI-powered, intelligent applications quickly, safely, and at scale. Tanzu Platform also offers teams full-stack visibility from applications to infrastructure and efficient modern application lifecycle management across public and private clouds with Cloud Foundry and/or with any conformant Kubernetes.\n•\nTanzu Data: \nA suite of data services that provides advanced analytical data warehouse capabilities and real-time transactions and processing at massive scale with an in-memory data grid with vector database capabilities for AI use cases.\n•\nTanzu CloudHealth: \nThis solution simplifies financial management, streamlines operations, and improves organizational collaboration across the multi-cloud environment. \n•\nTanzu Labs: \nThis service provides hands-on cloud native consulting services to help customers move software to production while strengthening platform engineering skills.\nVeloCloud Portfolio. \nVeloCloud provides networking solutions to connect, secure and optimize workloads across distributed locations. By combining our VeloRAIN (Robust AI Networking) architecture with seamless connectivity and outcome-based quality of service, VeloCloud provides users and devices with compute and connectivity to optimize performance, security and reliability across fixed or mobile environments, while simplifying operations. \n•\nSD-WAN and SASE\n: Our SD-WAN (software-defined wide area network) solution, whether a part of our SASE (secure access service edge) architecture offering or standalone, provides a platform for enterprises to distribute modern applications and advanced AI systems while delivering security and ubiquity of access for distributed applications. Our SD-WAN or SASE solutions bring software-defined networking, security and AIOps together to support ubiquitous access across fiber, cellular and satellite for optimal performance and availability for modern applications.\n•\nVeloRAIN\n: Our architecture uses AI or machine learning to improve the performance and security of distributed workloads.\n•\nFixed Wireless Access\n: This solution provides enterprises with reliable 5G connectivity to businesses and enterprise branches at the edge while optimizing the network through intelligence and network programmability.\nApplication Networking and Security Software Portfolio. \nOur application networking and security software delivers zero-trust lateral security and load balancing solutions enabling global digital organizations to combat malware and ransomware. These software-defined solutions provide distributed and scale-out architectures, deep visibility, plug-and-play operations and self-service consumption. Customers can deploy our solutions at speed and operate them at scale across all their private cloud applications, which can reduce the total cost of ownership.\n8\nTable of Contents\n•\nLateral Security Firewall:\n This solution enables access control for applications, protects against lateral movement of threats and provides security policy recommendations based on the workloads, and enables isolation of sensitive applications for enhanced regulatory compliance. \n•\nAdvanced Threat Prevention:\n This solution integrates multiple threat detection and prevention technologies to deliver comprehensive protection from malware and ransomware attacks, including utilizing behavior-based techniques and advanced correlations to identify lateral threat movement and ransomware threat campaigns.\n•\nAdvanced Load Balancing:\n This solution simplifies and accelerates application deployments and enhances application availability and resiliency to deliver load balancing at the speed of applications, allowing customers to leverage built-in automation to deploy load balancing as code as part of DevOps workflows for rapid infrastructure roll out.\nMainframe Software Portfolio. \nOur mainframe software provides market-leading DevOps, AIOps, Cybersecurity, Workload Automation, Data Management, and Foundational Software solutions which enable customers to embrace open tools and technologies, innovate with their mainframe as part of their hybrid environment, and extend the value of their mainframe investments. Our commitment to partnering with our customers goes beyond products and technology. Through our unique Beyond Code programs we address challenges such as skills development, staffing, change management and cost-saving initiatives that drive greater overall business success with the platform.\n•\nOperational Analytics & Management\n: \nThese solutions combine big data, machine learning and AI with mainframe expertise to deliver meaningful and actionable insights to augment and automate day-to-day operations and deliver exceptional customer experiences.\n•\nWorkload Automation:\n These solutions reduce manual effort by enabling customers to proactively optimize resources and orchestrate automation across enterprise applications and systems.\n•\nDatabases & Data Management\n: \nThese high-performance databases and management tools store, organize, and manage mainframe data to ensure optimal performance, efficient administration, and reliability of critical systems. Customers can also manage their mainframe data storage using modern mainframe solutions that securely store data on any device that customers choose, including the cloud. These software-only solutions are designed to save on costs and maintain confidence in data security.\n•\nApplication Development & Testing\n: \nThese solutions enable customers to accelerate software delivery while increasing code quality through the use of our agile processes and tools, and DevOps solutions. Our open-first strategy helps customers modernize their mainframe environment through the use of open source and open application programming technologies across people, process, tooling and applications, resulting in greater synergy and alignment with their corporate IT environment.\n•\nIdentity & Access Management\n: \nThese solutions manage mainframe access and elevate it with modern practices such as multi-factor authentication and privileged user management, and support all external security managers.\n•\nCompliance & Data Protection\n:\n These solutions protect crucial mainframe data to ensure compliance, identify risk, proactively respond to potential threats, and reduce those risks to lighten the load on security management with automated identification and authorization cleanup.\n•\nSecurity Insights Platform\n: \nThis solution helps ensure a trusted environment for customers and their employees by quickly interpreting and assessing mainframe security posture, identifying risks and developing remediation steps on an ongoing and ad hoc basis. This data is available for use with in-house tools for security information and event management.\n•\nBeyond Code Programs\n:\n These value-added offerings help ensure our customers get the most out of their mainframe investments. These offerings unlock additional value for organizations in areas such as educating and upskilling the workforce, providing expert guidance and support for change events, and uncovering opportunities to improve efficiency and save costs.\nDistributed Software Portfolio. \nOur distributed software solutions enable global enterprises to optimize the planning, development and delivery of software, powering their business-critical digital services. Our solutions are designed to enable customers to innovate, improve customer experience, and drive profitability by aligning business, development, and operational teams. Our products, organized in the domains of ValueOps, DevOps, and AIOps, deliver end-to-end visibility across all stages of the digital lifecycle and help our customers realize better business outcomes and better experiences for their customers. \n9\nTable of Contents\n•\nValueOps\n:\n This solution delivers value stream management capabilities that enable customers to schedule, track, and manage work throughout its lifecycle from investment planning to execution. It aligns business and development teams across the enterprise, increasing transparency, reducing inefficiencies, and improving time to value.\n•\nDevOps: \nThis solution\n \noffers capabilities that empower users of our agile processes and tools to track development progress and deploy releases confidently with assurance of feature completeness, high-quality and reduced risk. Key stakeholders have a single view of key insights into release progress, health, quality, defect trends, and metrics that drive focus, gauge readiness, and help to ensure successful, quality releases.\n•\nAIOps: \nThis solution\n \ncombines application, infrastructure and network monitoring and correlation with intelligent remediation capabilities to help customers create more resilient production environments and improve customer experience.\nEnterprise Security Portfolio. \nOur Enterprise Security solutions help organizations and governments secure against threats and compliance risks by protecting their users and data on any app, device, or network. Our integrated cyber defense approach simplifies cybersecurity with comprehensive solutions designed to secure critical business assets across on-premises and cloud infrastructures. Enterprise Security solutions utilize rich threat intelligence from a global network of security engineers, threat analyst and researchers, as well as advanced AI and machine learning engines, enabling customers to protect data, connect authorized users with trusted applications, and detect and respond to the most advanced targeted attacks. \n•\nEndpoint Security: \nEndpoints are the critical last line of defense against cyber attackers. Our Symantec and Carbon Black endpoint security solutions prevent, detect and respond to emerging threats across all devices and operating systems including laptops, desktops, tablets, mobile phones, servers and cloud workloads through an AI driven security console and single agent.\n•\nNetwork Security: \nEmail and web access are the lifeblood and essential communication means for every modern organization. We have a full array of network security solutions, as well as a shared set of advanced threat protection technologies to stop inbound and outbound threats targeting end users, information and key infrastructure. \n•\nInformation Security: \nInformation protection and compliance is critical to managing risk. We offer integrated information security solutions, based on an efficient, single-policy that can be applied across the entire environment, to help organizations identify and protect risky users, applications and their most sensitive data everywhere across endpoints, on-premises networks, cloud services and private applications.\n•\nApplication Security:\n Applications are increasingly targeted by cyber attackers. Our solutions secure critical systems, prevent unwanted changes, and ensure continuous compliance with regulatory mandates. Carbon Black solutions employ a positive security model that secures often overlooked use cases such as end-of-life operating systems, critical systems, fixed function devices, and air-gapped systems.\n•\nIdentity Security:\n User identities are under attack by cyber criminals hoping to exploit their access and privileges and do harm. Our solution mitigates these attacks by positively identifying legitimate users, enforcing granular access control policies, and streamlining access governance to prevent unauthorized access to sensitive resources and data.\nFC SAN Management.\n We also offer mission-critical FC SAN products designed to help customers reduce the cost and complexity of managing business information within a shared data storage environment, enabling high levels of availability of mission-critical applications in the form of modules, switches and subsystems incorporating multiple semiconductor products. We deliver reliable and simplified management of these FC SAN products through our software-based management tools designed to maximize uptime, dramatically simplify storage area networking deployment and management, and provide high levels of visibility and insight into the storage network. Our Brocade Fibre Channel switch products provide interconnection, bandwidth and high-speed switching between servers and storage devices which are in a FC SAN. \nPayment Security Portfolio.\n Our payment security suite is a software as a service (“SaaS”)-based payment authentication service to help banks and merchants protect against fraud and ensure a hassle-free online shopping experience for their customers.\n10\nTable of Contents\nResearch and Development\nWe are committed to continuous investment in product development and enhancement, with a focus on rapidly introducing new, proprietary products and releases. Many of our products have grown out of our own research and development efforts, and have given us competitive advantages in certain target markets due to performance differentiation. However, we opportunistically seek to enhance our capabilities through the acquisition of engineers with complementary research and development skills and complementary technologies and businesses. We focus our research and development efforts on the development of mission-critical, innovative, sustainable and higher value product platforms and those that improve the quality and stability in our broadly deployed products. We leverage our design capabilities in markets where we believe our innovation and reputation will allow us to earn attractive margins by developing high value-add products.\nWe plan to continue investing in product development, both organically and through acquisitions, to drive growth in our business. We also invest in process development and improvements to product features and functions, as well as fabrication capabilities to optimize processes for devices that are manufactured internally. Our field application engineers, design engineers, and product and software development engineers are located in many places around the world, and in many cases, near our top customers. This enhances our customer reach and our visibility into new product opportunities and, in the case of our semiconductor customers, enables us to support our customers in each stage of their product development cycle, from the early stages of production design to volume manufacturing and future growth. By collaborating with our customers, we have opportunities to develop high value-added, customized products for them that leverage our existing technologies. We anticipate that we will continue to make significant research and development investments in order to maintain our competitive position, and to ensure a continuous flow of innovative and sustainable product platforms.\nCustomers, Sales and Distribution\nWe sell our products through our direct sales force and a select network of distributors and channel partners globally. Distributors and OEMs, or their contract manufacturers, typically account for the substantial majority of our semiconductor sales. A relatively small number of customers account for a significant portion of our net revenue. Sales to distributors accounted for 48% and 57% of our net revenue for fiscal years 2024 and 2023, respectively. We believe aggregate sales to our top five end customers, through all channels, accounted for approximately 40% and 35% of our net revenue for fiscal years 2024 and 2023, respectively. We expect to continue to experience significant customer concentration in future periods. The loss of, or significant decrease in demand from, any of our top five end customers could have a material adverse effect on our business, results of operations and financial condition.\nMany of our semiconductor customers design products in North America or Europe that are then manufactured in Asia. To serve customers around the world, we have strategically developed relationships with large global electronic component distributors, complemented by a number of regional distributors with customer relationships based on their respective product ranges. We also sell our products to a wide variety of OEMs or their contract manufacturers. We have established strong relationships with leading OEM customers across multiple target markets. Our direct sales force focuses on supporting our large OEM customers, and has specialized product and service knowledge that enables us to sell specific offerings at key levels throughout a customer’s organization. Certain customers require us to contract with them directly and with specified intermediaries, such as contract manufacturers. Many of our major customer relationships have been in place for many years and are often the result of years of collaborative product development. This has enabled us to build our extensive IP portfolio and develop critical expertise regarding our customers’ requirements, including substantial system-level knowledge. This collaboration has provided us with key insights into our customers' businesses and has enabled us to be more efficient and productive and to better serve our target markets and customers. Many of our customers and their contract manufacturers often require time critical delivery of our products to multiple locations around the world. With sales offices located in various countries, our primary warehouse in Malaysia, and dedicated regional customer support call centers, where we address customer issues and handle logistics and other order fulfillment requirements, we believe we are well-positioned to support our customers throughout the design, technology transfer and manufacturing stages across all geographies.\nOur software customers generally consist of large enterprises that have computing environments from multiple vendors and are in most major industries worldwide, including banks, insurance companies, other financial services providers, government agencies, global IT service providers, telecommunication providers, transportation companies, manufacturers, technology companies, retailers, educational organizations and health care institutions. Our private cloud infrastructure suite of solutions are available directly from Broadcom, resellers and distributors, hyperscale cloud providers, value-added OEMs and VMware cloud service provider partners. VCF provides license portability, which enables customers to purchase subscriptions of VCF software and move their VCF environments between on-premises data centers and supported cloud endpoints. We remain focused on strengthening relationships and increasing penetration within our existing core, mainframe, VMware, and Symantec endpoint customers and expanding the adoption of our enterprise software offerings with these customers. We believe our enterprise-wide license model will continue to offer our customers reduced complexity, more flexibility and an easier renewal process that will help drive revenue growth.\n11\nTable of Contents\nManufacturing\nWe focus on maintaining an efficient global supply chain and a variable, low-cost operating model. Accordingly, we outsource a majority of our manufacturing operations, utilizing third-party foundry and assembly and test capabilities, as well as some of our corporate infrastructure functions. The majority of our front-end wafer manufacturing operations is outsourced to external foundries, including Taiwan Semiconductor Manufacturing Company Limited (“TSMC”). We use third-party contract manufacturers for a significant majority of our assembly and test operations, including TSMC, Advanced Semiconductor Engineering, Inc., Foxconn Technology Group, Amkor Technology, Inc. and Siliconware Precision Industries Co., Ltd. We use our internal fabrication facilities for products utilizing our innovative and proprietary processes, such as our FBAR filters for wireless communications and our vertical-cavity surface emitting laser and side emitting lasers based on GaAs and InP lasers for fiber optic communications, while outsourcing commodity processes such as standard CMOS. By doing so, we can protect our IP and accelerate time to market for our products. The majority of our internal III-V semiconductor wafer fabrication is done in the U.S. and Singapore. \nWe purchase materials from hundreds of suppliers on a global basis. These purchases are generally on a purchase order basis and some parts are not readily available from alternate suppliers due to their unique design or the length of time and cost necessary for re-design or qualification. To address the potential disruption in our supply chain, we may use a number of techniques, including redesigning products for alternative components, making incremental or “lifetime” purchases, or qualifying more than one source of supply. Our long-term relationships with our suppliers allow us to proactively manage our technology development and product discontinuance plans, and to monitor our suppliers' financial health.\nWe also have a long history of operating in Asia where we manufacture and source the majority of our products and materials. We store the majority of our product inventory in our warehouse in Malaysia and our presence in Asia places us in close proximity to many of our customers’ manufacturing facilities.\nCompetition\nThe markets in which we participate are highly competitive. Our competitors range from large international companies offering a wide range of products to smaller companies specializing in narrow markets. The competitive landscape is changing as a result of a trend toward consolidation within many industries, as some of our competitors have merged with or been acquired by other competitors, while others have begun collaborating with each other. We expect this consolidation trend to continue. We expect competition in the markets in which we participate to continue to increase as existing competitors improve or expand their product offerings and as new companies enter the market. Additionally, our ability to compete effectively depends on a number of factors, including: quality, technical performance, price, product features, product system compatibility, system-level design capability, engineering expertise, responsiveness to customers, new product innovation, product availability, delivery timing and reliability, and customer sales and technical support.\nIn semiconductor solutions, we compete with integrated device manufacturers, fabless semiconductor companies and the internal resources of large integrated OEMs, such as Advanced Micro Devices, Inc., Amlogic Inc., Analog Devices, Inc., Cisco Systems, Inc., Coherent Corp., Hamamatsu Photonics K.K., Heidenhain Corporation, iC-Haus GmbH, Intel Corporation, Lumentum Holdings Inc., MACOM Technology Solutions Holdings, Inc., Marvell Technology, Inc., MaxLinear, Inc., MediaTek Inc., Microchip Technology Incorporated, Mitsubishi Electric Corporation, Murata Manufacturing Co., Ltd., NVIDIA Corporation, NXP Semiconductors N.V., ON Semiconductor Corporation, OSRAM Licht AG, Qorvo, Inc., Qualcomm Inc., Realtek Semiconductor Corp., Renesas Electronics Corporation, Skyworks Solutions, Inc., STMicroelectronics N.V., Sumitomo Corporation, Synaptics Incorporated, Texas Instruments, Inc., TDK-EPC Corporation, Toshiba Corporation, and Wolfspeed, Inc. (f/k/a Cree, Inc.). \nIn infrastructure software, we compete with large enterprise software vendors who continue to expand their product and service offerings and consolidate offerings into broad product lines, and smaller, niche players focused on specific markets, such as Atlassian Corporation, Plc, BeyondTrust Corporation, BMC Software Inc., Cisco Systems, Inc., CrowdStrike Holdings, Inc., CyberArk Software, Ltd., Dino-Software Corporation, Fortinet, Inc., Hewlett Packard Enterprise Company, International Business Machines Corporation, Microsoft Corporation, New Relic, Inc., OpenText Corporation, Oracle Corporation, Palo Alto Networks, Inc., Proofpoint, Inc., Rocket Software, Inc., SailPoint Technologies Holdings, Inc., Salesforce.com, Inc., ServiceNow, Inc., SolarWinds Corporation, Versa Networks, Inc., and Zscaler, Inc. \nIntellectual Property\nOur success depends in part upon our ability to protect our IP. To accomplish this, we rely on a combination of IP rights, including patents, copyrights, trademarks, service marks, trade secrets and similar IP, as well as customary contractual protections with our customers, suppliers, employees and consultants, and through security measures to protect our trade secrets. We believe our current product expertise, key engineering talent and IP portfolio provide us with a strong platform from which to develop application specific products in key target markets.\n12\nTable of Contents\nAs of November 3, 2024, we had 20,870 U.S. and other patents and 2,650 U.S. and other pending patent applications. The expiration dates of our patents range from 2024 to 2043, with a small number of patents expiring in the near future, none of which are expected to be material to our IP portfolio. We are not substantially dependent on any single patent or group of related patents.\nWe focus our patent application program to a greater extent on those inventions and improvements that we believe are likely to be incorporated into our products, as contrasted with more basic research. However, we do not know how many of our pending patent applications will result in the issuance of patents or the extent to which the examination process could require us to narrow our claims.\nWe and our predecessors have also entered into a variety of IP licensing and cross-licensing arrangements that have both benefited our business and enabled some of our competitors. A portion of our revenue comes from IP licensing royalty payments and from litigation settlements relating to such IP. We also license third-party technologies that are incorporated into some elements of our design activities, products and manufacturing processes. Historically, licenses of the third-party technologies used by us have generally been available to us on acceptable terms.\nThe industries in which we compete are characterized by the existence of a large number of patents, copyrights, trademarks and trade secrets and by the vigorous pursuit, protection and enforcement of IP rights, including by patent holding companies that do not make or sell products. Some of our customer agreements require us to indemnify our customers for third-party IP infringement claims arising from our products. Claims of this sort could harm our relationships with our customers and might deter future customers from doing business with us. With respect to any IP rights claims against us or our customers or distributors, we may be required to defend ourselves or our customers or distributors in litigation, cease manufacturing the infringing products, pay damages, expend resources to develop non-infringing technology, seek a license which may not be available on commercially reasonable terms or at all, or relinquish patents or other IP rights.\nIn addition, the proprietary portions of our source code for our infrastructure software products are protected both as a trade secret and as copyrighted works. Except with respect to software components that are subject to open source licenses, our customers do not generally have access to the source code for our products. Rather, on-premises customers typically access only the executable code for our products, and SaaS customers access only the functionality of our SaaS offerings. Under certain contingent circumstances, some of our customers are beneficiaries of a source code escrow arrangement that would enable them to obtain a limited right to access and use our source code if specific conditions are met.\nEmployees\nOur continued success depends on our ability to attract, motivate and retain our workforce in a highly competitive labor market. Specifically, as the source of our technological and product innovations, our engineering and technical personnel are a critical asset.\nWe measure our employees’ engagement by our voluntary attrition rate and employee feedback. Our global voluntary attrition rates in fiscal year 2024 were approximately 2.9% (excluding employees who joined Broadcom as a result of the VMware Merger) and approximately 6.2% (including employees who joined Broadcom as a result of the VMware Merger), which are both below the technology industry benchmark (AON, 2024 Salary Increase and Turnover Study — Second Edition, September 2024).\nWe also track the portion of our workforce in research and development roles. As of November 3, 2024, we had approximately 37,000 employees worldwide, with approximately 55% in research and development roles. By geography, approximately 48% of our employees are located in North America, 36% in Asia, and 16% in Europe, the Middle East and Africa. \nGovernmental Regulation \nWe are subject to numerous regulations and laws in the United States and abroad involving matters central to our business. Many of these laws and regulations are evolving and their applicability and scope, as interpreted by the courts, remain uncertain. \nWe are subject to regulation by the U.S. Occupational Safety and Health Administration and similar health and safety laws in other jurisdictions. We believe that our properties and operations at our facilities comply in all material respects with applicable environmental laws and worker health and safety laws. However, the risk of environmental liabilities cannot be completely eliminated and there can be no assurance that the application of environmental, health and safety laws to our business will not require us to incur significant expenditures.\nIn addition, our business is subject to various import/export regulations, such as the U.S. Export Administration Regulations, and applicable executive orders, and rules of industrial standards bodies, like the International Organization for Standardization, as well as regulation by other agencies, such as the U.S. Federal Trade Commission (“FTC”). These laws, \n13\nTable of Contents\nregulations and orders are complex, may change frequently and with limited notice, have generally and may continue to become more stringent over time. We may incur significant expenditures in future periods as a result. \nOur semiconductor manufacturing operations and research and development involve the use of hazardous substances and are regulated under international, federal, state and local laws governing health, safety and the environment. These regulations include limitations on discharge of pollutants to air, water, and soil; remediation requirements; product chemical content limitations; manufacturing chemical use and handling restrictions; pollution control requirements; waste minimization considerations; and treatment, transport, storage and disposal of solid and hazardous wastes. We are also regulated under a number of international, federal, state and local laws regarding recycling, product packaging and product content requirements, including legislation enacted in the U.S., European Union and China, among a growing number of jurisdictions, which have placed greater restrictions on the use of lead, among other restricted substances, in electronic products, which affects materials composition and semiconductor packaging.\nSeasonality\nHistorically, our net revenue has typically been higher in the second half of the fiscal year than in the first half, primarily due to seasonality in our wireless communications products. These products have historically experienced seasonality due to launches of new mobile devices manufactured by our OEM customers. However, from time to time, typical seasonality and industry cyclicality are overshadowed by other factors such as wider macroeconomic effects, the timing of customer deployments, significant product transitions and launches by large OEMs, particularly with our AI and wireless communications products. We have a diversified business portfolio and we believe that our overall revenue is less susceptible to seasonal variations as a result of this diversification.\nAvailable Information\nOur website is www.broadcom.com. At the “Investor Center” page on this website, we promptly make available free of charge the reports we file or furnish pursuant to Section 13(a) or 15(d) of the Securities Exchange Act of 1934 (the “Exchange Act”) with the Securities and Exchange Commission (the “SEC”), as well as our proxy statements. Such periodic reports, proxy statements and other information are also available at the SEC’s website at www.sec.gov. The information posted on our website is not incorporated into this Annual Report on Form 10-K. \nInformation About Our Executive Officers\nThe following table provides information regarding our executive officers as of December 20, 2024:\n \nName and Title\nAge\nPosition and Offices\nHock E. Tan\n73\nPresident, Chief Executive Officer and Director\nKirsten M. Spears\n60\nChief Financial Officer and Chief Accounting Officer\nMark D. Brazeal\n56\nChief Legal and Corporate Affairs Officer\nCharlie B. Kawwas, Ph.D.\n54\nPresident, Semiconductor Solutions Group\nHock E. Tan has served as our President and Chief Executive Officer since March 2006. He was President and Chief Executive Officer at Integrated Circuit Systems, Inc. (“ICS”), a publicly traded timing solutions IC company, from 1999 until its acquisition by Integrated Device Technology, Inc. in 2005. He also served in a number of executive positions at ICS, including Chief Operating Officer from 1996 to 1999 and Senior Vice President and Chief Financial Officer from 1995 to 1999. He was Vice President of Finance at Commodore International, Ltd. from 1992 to 1994, and held senior management positions at PepsiCo, Inc. and General Motors Corporation. He was also managing director of Pacven Investment, Ltd., a venture capital fund in Singapore, from 1988 to 1992, and was managing director of Hume Industries Ltd. in Malaysia from 1983 to 1988.\nKirsten M. Spears has served as our Chief Financial Officer and Chief Accounting Officer since December 2020. She served as our Principal Accounting Officer from March 2016 to December 2020 and Vice President and Corporate Controller from May 2014 to December 2020. She was Vice President and Corporate Controller at LSI Corporation from 2007 until its acquisition by us in 2014. She held several management positions in accounting and reporting at LSI from 1997 to 2007. She also worked for PriceWaterhouseCoopers prior to joining LSI.\nMark D. Brazeal has served as our Chief Legal and Corporate Affairs Officer since December 2021. He served as our Chief Legal Officer from March 2017 to December 2021. He was Chief Legal Officer and Senior Vice President, IP Licensing for SanDisk Corporation from 2014 until its acquisition by Western Digital Corporation in 2016. He held several senior legal positions at Broadcom Corporation from 2000 to 2014, including Senior Vice President and Senior Deputy General Counsel in charge of all commercial, operational, IP licensing and litigation matters. He was also an attorney in the transactional and IP groups at the law firms of Wilson Sonsini Goodrich & Rosati, Yuasa & Hara and Howrey & Simon prior to joining Broadcom Corporation.\n14\nTable of Contents\nCharlie B. Kawwas has served as our President, Semiconductor Solutions Group since July 2022. He served as our Chief Operating Officer from December 2020 to July 2022, Senior Vice President and Chief Sales Officer from June 2015 to December 2020 and Senior Vice President, Worldwide Sales from May 2014 to June 2015. He was head of worldwide sales at LSI Corporation from 2010 until its acquisition by us in 2014. He held several executive leadership positions at LSI from 2007 to 2010, including Vice President of Sales and Marketing for the networking division and Vice President of Marketing for the networking and storage products group. He was also the leader of Product Line Management for the Optical Ethernet and Multi-service Edge portfolio at Nortel Networks Corporation prior to joining LSI.\n15\nTable of Contents",
  "item7": "ITEM 7.     MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThis Management’s Discussion and Analysis of Financial Condition and Results of Operations should be read in conjunction with our consolidated financial statements and notes thereto, which appear elsewhere in this Annual Report on Form 10-K. This discussion may contain forward-looking statements based upon current expectations that involve risks and uncertainties. Our actual results may differ materially from those anticipated in these forward-looking statements as a result of various factors, including those set forth under the caption “Risk Factors” or in other parts of this Annual Report on Form 10-K.\nThe following section generally discusses our financial condition and results of operations for our fiscal year ended November 3, 2024 (“fiscal year 2024”) compared to our fiscal year ended October 29, 2023 (“fiscal year 2023”). A discussion regarding our financial condition and results of operations for fiscal year 2023 compared to our fiscal year ended October 30, 2022 can be found in Part II, Item 7 of our Annual Report on Form 10-K for fiscal year 2023, filed with the Securities and Exchange Commission (the “SEC”) on December 14, 2023.\nOverview \nWe are a global technology leader that designs, develops and supplies a broad range of semiconductor and infrastructure software solutions. We develop semiconductor devices with a focus on complex digital and mixed signal complementary metal oxide semiconductor based devices and analog III-V based products. We offer thousands of products that are used in end products such as enterprise and data center networking, including artificial intelligence (“AI”) networking and connectivity, home connectivity, set-top boxes, broadband access, telecommunication equipment, smartphones and base stations, data center servers and storage systems, factory automation, power generation and alternative energy systems, and electronic displays. Our infrastructure software solutions help enterprises simplify their information technology environments so they can increase business velocity and flexibility, and enable customers to plan, develop, deliver, automate, manage and secure applications across mainframe, distributed, edge, mobile, and private and hybrid cloud platforms. Our portfolio of infrastructure and security software is designed to modernize, optimize, and secure the most complex private and hybrid cloud environments, enabling scalability, agility, automation, insights, resiliency and security making it easy for customers to run their mission-critical workloads. We also offer mission-critical fibre channel storage area networking (“FC SAN”) products and related software in the form of modules, switches and subsystems incorporating multiple semiconductor products.\nWe have two reportable segments: semiconductor solutions and infrastructure software. Our semiconductor solutions segment includes all of our product lines and intellectual property (“IP”) licensing. Our infrastructure software segment includes our private and hybrid cloud, application development and delivery, software-defined edge, application networking and security, mainframe, distributed and cybersecurity solutions, and our FC SAN business.\nOur fiscal year 2024 was a 53-week fiscal year compared to our fiscal year 2023, which was a 52-week fiscal year. The additional week in the first quarter of fiscal year 2024 resulted in higher net revenue, gross margin dollars, research and development expense, and selling general and administrative expense for fiscal year 2024, compared to the corresponding prior year fiscal period.\nOur strategy is focused on technology leadership and category-leading semiconductor and infrastructure software solutions delivering a comprehensive suite of innovative infrastructure technology products to the world’s leading business and government customers. We seek to achieve this through strategic acquisitions of businesses and technologies, as well as extensive internal research and development, to ensure our products retain their technology market leadership. This strategy results in a robust business model designed to drive diversified and sustainable operating and financial results.\nThe demand for our products has been affected in the past, and is likely to continue to be affected in the future, by various factors, including the following:\n•\ngain or loss of significant customers;\n•\ngeneral economic and market conditions in the industries and markets in which we compete;\n•\nanticipated or actual demand for AI-related products;\n•\nour distributors’ product inventory and end customer demand;\n•\nthe rate at which our present and future customers and end-users adopt our products and technologies in our target markets, including our AI related products, and the rate at which our customers' products that include our technology are accepted in their markets; \n•\nthe shift to cloud-based information technology solutions and services, such as hyperscale computing, which may adversely affect the timing and volume of sales of our products for use in traditional enterprise data centers; and\n•\nthe timing, rescheduling or cancellation of expected customer orders.\n36\nTable of Contents\nFiscal Year Highlights\nHighlights during fiscal year 2024 include the following: \n•\nOn November 22, 2023, we completed the acquisition of VMware, Inc. (“VMware”), for approximately $30.8 billion in cash and 544 million shares of Broadcom common stock (on a split adjusted basis) with a fair value of $53.4 billion.\n•\nWe generated $19,962 million of cash from operations.\n•\nWe paid $9,814 million in cash dividends.\n•\nWe repurchased $7,176 million of common stock.\n•\nWe completed a ten-for-one forward stock split of our common stock. All share, equity award and per share amounts have been retroactively adjusted to reflect the stock split.\nAcquisitions and Divestitures \nAcquisition of VMware and Divestiture of EUC\nOn November 22, 2023, we acquired VMware in a cash-and-stock transaction (the “VMware Merger”). The VMware stockholders received approximately $30,788 million in cash and 544 million shares of Broadcom common stock with a fair value of $53,398 million. In addition, we assumed all outstanding VMware restricted stock unit (“RSU”) awards and performance stock unit awards held by continuing employees. The assumed awards were converted into RSU awards for shares of Broadcom common stock. All outstanding RSU awards held by non-employee directors and in-the-money VMware stock options were accelerated and converted into the right to receive cash and shares of Broadcom common stock, in equal parts. \nWe funded the cash portion of the VMware Merger with the net proceeds from the issuance of the 2023 Term Loans, as defined and discussed in Note 10. “Borrowings” included in Part II, Item 8 of this Annual Report on Form 10-K, as well as cash on hand. We assumed $8,250 million of VMware’s outstanding senior unsecured notes.\nOn July 1, 2024, we sold VMware’s end-user computing (“EUC”) business to KKR & Co. Inc. for cash consideration of \n$3.5 billion\n, after working capital adjustments.\nAcquisition of Seagate’s SoC Operations\nOn April 23, 2024, we acquired certain assets related to the design, development, and manufacture of System-on-Chip (“SoC”) operations of Seagate Technology Holdings plc for \n$600 million\n. \nNet Revenue\nA majority of our net revenue is derived from sales of a broad range of semiconductor devices that are incorporated into electronic products, as well as from modules, switches and subsystems. Net revenue is also generated from the sale of software solutions that enable our customers to plan, develop, deliver, automate, manage, and secure applications across mainframe, distributed, edge, mobile, and private and hybrid cloud platforms. \nOur overall net revenue, as well as the percentage of total net revenue generated by sales in our semiconductor solutions and infrastructure software segments, have varied from quarter to quarter, due largely to fluctuations in end-market demand, including the effects of seasonality, which are discussed in detail in Part I, Item 1. \nBusiness\n under “Seasonality” of this Annual Report on Form 10-K.\nDistributors and original equipment manufacturers (“OEMs”), or their contract manufacturers, typically account for the substantial majority of our semiconductor sales. To serve customers around the world, we have strategically developed relationships with large global electronic component distributors, complemented by a number of regional distributors with customer relationships based on their respective product ranges. We have established strong relationships with leading OEM customers across multiple target markets. Our direct sales force focuses on supporting our large OEM customers and has specialized product and service knowledge that enables us to sell specific offerings at key levels throughout a customer’s organization. Certain customers require us to contract with them directly and with specified intermediaries, such as contract manufacturers. Many of our major customer relationships have been in place for many years and are often the result of years of collaborative product development. This has enabled us to build our extensive IP portfolio and develop critical expertise regarding our customers’ requirements, including substantial system-level knowledge. This collaboration has provided us with key insights into our customers' businesses and has enabled us to be more efficient and productive and to better serve our target markets and customers. We recognize revenue upon the delivery of our products to the distributors, which can cause our quarterly net revenue to fluctuate significantly. Such revenue is reduced for estimated returns and distributor allowances. \n37\nTable of Contents\nOur software customers generally consist of large enterprises that have computing environments from multiple vendors and are highly complex. Our private cloud infrastructure suite of solutions are available directly from Broadcom, resellers and distributors, hyperscale cloud providers, value-added OEMs and VMware cloud service provider partners. VMware Cloud Foundation (“VCF”) provides license portability, which enables customers to purchase subscriptions of VCF software and move their VCF environments between on-premises data centers and supported cloud endpoints. We remain focused on strengthening relationships and increasing penetration within our existing core, mainframe, VMware, and Symantec endpoint customers and expanding the adoption of our enterprise software offerings with these customers. We believe our enterprise-wide license model will continue to offer our customers reduced complexity, more flexibility and an easier renewal process that will help drive revenue growth.\nCosts and Expenses\nCost of products sold.\n  Cost of products sold consists primarily of the costs for semiconductor wafers and other materials, as well as the costs of assembling and testing those products and materials. Such costs include personnel and overhead related to our manufacturing operations, which include stock-based compensation expense, related occupancy, computer services, equipment costs, manufacturing quality, order fulfillment, warranty adjustments, and inventory adjustments including write-downs for inventory obsolescence. \nAlthough we outsource a significant portion of our manufacturing activities, we do have some proprietary semiconductor fabrication facilities. If we are unable to utilize our owned fabrication facilities at a desired level, the fixed costs associated with these facilities will not be fully absorbed, resulting in higher average unit costs and lower gross margins.\nCost of subscriptions and services.\n  Cost of subscriptions and services consists of personnel, project costs associated with professional services or support of our subscriptions and services revenue, and allocated facilities costs and other corporate expenses. Personnel costs include stock-based compensation expense.\nTotal cost of revenue also includes amortization of acquisition-related intangible assets and restructuring charges.\nResearch and development.\n  Research and development expense consists primarily of personnel costs for our engineers engaged in the design and development of our products and technologies, including stock-based compensation expense. These expenses also include project material costs, third-party fees paid to consultants, prototype development expense, allocated facilities costs and other corporate expenses and computer services costs related to supporting computer tools used in the engineering and design process.\nSelling\n, \ngeneral and administrative.\n  Selling expense consists primarily of compensation and associated costs for sales and marketing personnel, including stock-based compensation expense, sales commissions paid to our independent sales representatives, advertising costs, trade shows, corporate marketing, promotion, travel related to our sales and marketing operations, related occupancy and equipment costs, and other marketing costs. General and administrative expense consists primarily of compensation and associated costs for executive management, finance, human resources and other administrative personnel, including stock-based compensation expense, outside professional fees, allocated facilities costs, acquisition-related costs, which include direct transaction costs and integration costs, and other corporate expenses.\nAmortization of acquisition-related intangible assets.\n  In connection with our acquisitions, we recognize intangible assets that are amortized over their estimated useful lives. We also recognize goodwill, which is not amortized, and in-process research and development (“IPR&D”), which is initially capitalized as an indefinite-lived intangible asset, in connection with our acquisitions. Upon completion of each underlying project, IPR&D assets are reclassified as amortizable purchased intangible assets and amortized over their estimated useful lives.\nRestructuring and other charges.  \nRestructuring and other charges consist primarily of non-recurring charges related to compensation costs associated with employee exit programs, IP litigation, alignment of our global manufacturing operations, rationalization of product development program costs, facility and lease abandonments, fixed asset impairment, IPR&D impairment, and other exit costs, including curtailment of service or supply agreements.\nInterest expense. \n Interest expense includes coupon interest, commitment fees, accretion of original issue discount, amortization of debt premiums and debt issuance costs, and expenses related to debt modifications or extinguishments. \nOther income (expense), net.\n  Other income (expense), net includes interest income, gains and losses on investments, foreign currency remeasurement, and other miscellaneous items.\nProvision for income taxes.\n  We benefit from the tax incentives extended to us in various jurisdictions to encourage investment or employment. Our tax incentives from the Singapore Economic Development Board provide that any qualifying income earned in Singapore is subject to tax incentives or reduced rates of Singapore income tax, subject to our compliance with the conditions specified in these incentives and legislative developments. These Singapore tax incentives are scheduled \n38\nTable of Contents\nto expire in November 2030. The corporate income tax rate in Singapore that would otherwise apply to us would be 17%. We also have a tax holiday from our qualifying income earned in Malaysia, which is scheduled to expire in 2028.\nEach tax incentive and tax holiday is subject to our compliance with various operating and other conditions. If we cannot, or elect not to, comply with any such operating conditions specified, we could, in some instances, be required to refund previously realized material tax benefits, or if such tax incentive or tax holiday is terminated prior to its expiration absent a new incentive applying, we will lose the related tax benefits earlier than scheduled. We may elect to modify our operational structure and tax strategy, which may not be as beneficial to us as the benefits provided under the present tax concession arrangements. Before taking into consideration the effects of the U.S. Tax Cuts and Jobs Act and other indirect tax impacts, the effect of these tax incentives and tax holiday decreased the provision for income taxes by approximately $2,261 million and $2,104 million for fiscal years 2024 and 2023, respectively.\nOur interpretations and conclusions regarding the tax incentives are not binding on any taxing authority, and if our assumptions about tax and other laws are incorrect, the benefits of the tax incentives may be adversely affected.\nCritical Accounting Estimates\nThe preparation of financial statements in accordance with generally accepted accounting principles in the United States (“GAAP”) requires us to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenue and expenses during the reporting period. We base our estimates and assumptions on current facts, historical experience and various other factors that we believe to be reasonable under the circumstances, the results of which form the basis for making judgments about the carrying values of assets and liabilities and the accrual of costs and expenses that are not readily apparent from other sources. Our actual financial results may differ materially and adversely from our estimates. Our critical accounting policies are those that affect our financial statements materially and involve difficult, subjective or complex judgments by management. Those policies include revenue recognition, business combinations, valuation of goodwill and long-lived assets, and income taxes. See Note 2. “Summary of Significant Accounting Policies” included in Part II, Item 8 of this Annual Report on Form 10-K for further information on our critical accounting policies and estimates.\nRevenue recognition. \n We account for a contract with a customer when both parties have approved the contract and are committed to perform their respective obligations, each party’s rights can be identified, payment terms can be identified, the contract has commercial substance, and it is probable we will collect substantially all of the consideration we are entitled to. Revenue is recognized when, or as, performance obligations are satisfied by transferring control of a promised product or service to a customer. Our products and services can be broadly categorized as sales of products and subscriptions and services. \nWe recognize products revenue from sales to direct customers and distributors when control transfers to the customer. An allowance for distributor credits covering price adjustments is made based on our estimate of historical experience rates as well as considering economic conditions and contractual terms. To date, actual distributor claims activity has been materially consistent with the provisions we have made based on our historical estimates. However, because of the inherent nature of estimates, there is always a risk that there could be significant differences between actual amounts and our estimates. Different judgments or estimates could result in variances that might be significant to reported operating results. We also record reductions of revenue for rebates in the same period that the related revenue is recorded. We accrue 100% of potential rebates at the time of sale. We reverse the accrual of unclaimed rebate amounts as specific rebate programs contractually end and when we believe unclaimed rebates are no longer subject to payment and will not be paid. Thus, the reversal of unclaimed rebates may have a positive impact on our net revenue and net income in subsequent periods.\nBusiness combinations. \n Accounting for business combinations requires our management to make significant estimates and assumptions, especially at the acquisition date, for intangible assets, contractual obligations assumed, restructuring liabilities, pre-acquisition contingencies, and contingent consideration, where applicable. Although we believe the assumptions and estimates we have made in the past have been reasonable and appropriate, they are based, in part, on historical experience and information obtained from the management of the acquired companies and are inherently uncertain. Critical estimates in valuing certain acquired intangible assets include, the present value of projected cash flows regarding the projected revenues, projected expenses which include cost of revenue, research and development and selling, general and administrative expenses, technology obsolescence rate, contributory asset charges, discount rate and income tax rate for developed technology; the projected revenues, customer retention rate, customer ramp up period, discount rate and income tax rate for the customer contracts and related relationships; the projected revenues, technology obsolescence rate, expected costs to develop IPR&D into commercially viable products, discount rate and income tax rate for the IPR&D; and the projected revenues, brand asset phase-out pattern, brand asset royalty rate, discount rate and the income tax rate for the trade name. Unanticipated events and circumstances may occur which could affect the accuracy or validity of such assumptions, estimates or actual results.\n39\nTable of Contents\nValuation of goodwill and long-lived assets. \n We perform an annual impairment review of our goodwill during the fourth fiscal quarter of each year, and more frequently if we believe indicators of impairment exist. The process of evaluating the potential impairment of goodwill is highly subjective and requires significant judgment. To review for impairment, we first assess qualitative factors to determine whether events or circumstances lead to a determination that it is more likely than not that the fair value of any of our reporting units is less than its carrying amount. Our qualitative assessment of the recoverability of goodwill, whether performed annually or based on specific events or circumstances, considers various macroeconomic, industry-specific and company-specific factors. These factors include: (i) severe adverse industry or economic trends; (ii) significant company-specific actions, including exiting an activity in conjunction with restructuring of operations; (iii) current, historical or projected deterioration of our financial performance; or (iv) a sustained decrease in our market capitalization below our net book value. After assessing the totality of events and circumstances, if we determine that it is not more likely than not that the fair value of any of our reporting units is less than its carrying amount, no further assessment is performed. If we determine that it is more likely than not that the fair value of any of our reporting units is less than its carrying amount, we calculate the fair value of that reporting unit and compare the fair value to the reporting unit’s net book value. \nDetermining the fair value of a reporting unit involves the use of significant estimates and assumptions. Our goodwill impairment test uses both the income approach and the market approach to estimate a reporting unit's fair value. The income approach is based on the discounted cash flow method that uses the reporting unit estimates for forecasted future financial performance, including revenues, operating expenses, and taxes, as well as working capital and capital asset requirements. These estimates are developed as part of our long-term planning process based on assumed market segment growth rates and our assumed market segment share, estimated costs based on historical data and various internal estimates. Projected cash flows are then discounted to a present value employing a discount rate that properly accounts for the estimated market weighted-average cost of capital, as well as any risk unique to the subject cash flows. The market approach is based on weighting the financial multiples of comparable companies and applying a control premium. A reporting unit's carrying value represents the assignment of various assets and liabilities, excluding certain corporate assets and liabilities, such as cash and debt. \nWe assess the impairment of long-lived assets, including purchased IPR&D, property, plant and equipment, right-of-use assets, and intangible assets, whenever events or changes in circumstances indicate that the carrying value of such assets may not be recoverable. Factors we consider important which could trigger an impairment review include: (i) significant under-performance relative to historical or projected future operating results, (ii) significant changes in the manner of our use of the acquired assets or the strategy for our overall business, or (iii) significant negative industry or economic trends. The process of evaluating the potential impairment of long-lived assets under the accounting guidance on property, plant and equipment, and intangible assets is also highly subjective and requires significant judgment. In order to estimate the fair value of long-lived assets, we typically make various assumptions about the future prospects of our business or the part of our business to which the long-lived assets relate. We also consider market factors specific to the business and estimate future cash flows to be generated by the business, which requires significant judgment as it is based on assumptions about market demand for our products over a number of future years. Based on these assumptions and estimates, we determine whether we need to take an impairment charge to reduce the value of the long-lived assets stated on our consolidated balance sheets to reflect their estimated fair value. Assumptions and estimates about future values and remaining useful lives are complex and often subjective. They can be affected by a variety of factors, including external factors, such as the real estate market, industry and economic trends, and internal factors, such as changes in our business strategy and our internal forecasts. Although we believe the assumptions and estimates we have made in the past have been reasonable and appropriate, changes in assumptions and estimates could materially impact our reported financial results.\nIncome taxes.\n  Significant management judgment is required in developing our provision for or benefit from income taxes, including the determination of deferred tax assets and liabilities and any valuation allowances that might be required against the deferred tax assets. We have considered projected future taxable income and ongoing prudent and feasible tax planning strategies in assessing the need for valuation allowances. An adjustment to the valuation allowance will either increase or decrease our provision for or benefit from income taxes in the period such determination is made. In evaluating the exposure associated with various tax filing positions, we accrue an income tax liability when such positions do not meet the more-likely-than-not threshold for recognition.\nThe calculation of our tax liabilities involves dealing with uncertainties in the application of complex tax laws and regulations in a multitude of jurisdictions. We recognize potential liabilities for anticipated tax audit issues in the U.S. and other tax jurisdictions based on our estimate of whether, and the extent to which, additional taxes, interest, and penalties will be due. If our estimate of income tax liabilities proves to be less than the actual amount ultimately assessed, a further charge to tax expense would be required. If the payment of these amounts ultimately proves to be unnecessary, the reversal of the accrued liabilities would result in tax benefits being recognized in the period when we determine the liabilities no longer exist.\n40\nTable of Contents\nFiscal Year Presentation\nWe operate on a 52- or 53-week fiscal year ending on the Sunday closest to October 31. Our fiscal year 2024 was a 53-week fiscal year. Fiscal years 2023 and 2022 each consisted of 52 weeks. \nThe financial statements included in Part II, Item 8 of this Annual Report on Form 10-K are presented in accordance with GAAP and expressed in U.S. dollars.\n41\nTable of Contents\nResults of Operations\nFiscal Year 2024 Compared to Fiscal Year 2023\nThe following table sets forth our results of operations for the periods presented:\n \nFiscal Year Ended\nNovember 3,\n2024\nOctober 29,\n2023\nNovember 3,\n2024\nOctober 29,\n2023\n \n(In millions)\n(As a percentage of net revenue)\nStatements of Operations Data:\n \n \n \n \nNet revenue:\nProducts\n$\n30,359 \n$\n27,891 \n59 \n%\n78 \n%\nSubscriptions and services\n21,215 \n7,928 \n41 \n22 \nTotal net revenue\n51,574 \n35,819 \n100 \n100 \nCost of revenue:\nCost of products sold\n9,797 \n8,636 \n19 \n24 \nCost of subscriptions and services\n2,991 \n636 \n6 \n2 \nAmortization of acquisition-related intangible assets\n6,023 \n1,853 \n12 \n5 \nRestructuring charges\n254 \n4 \n— \n— \nTotal cost of revenue\n19,065 \n11,129 \n37 \n31 \nGross margin\n32,509 \n24,690 \n63 \n69 \nResearch and development\n9,310 \n5,253 \n18 \n15 \nSelling, general and administrative\n4,959 \n1,592 \n10 \n4 \nAmortization of acquisition-related intangible assets\n3,244 \n1,394 \n6 \n4 \nRestructuring and other charges\n1,533 \n244 \n3 \n1 \nTotal operating expenses\n19,046 \n8,483 \n37 \n24 \nOperating income\n$\n13,463 \n$\n16,207 \n26 \n%\n45 \n%\nNet Revenue\nA relatively small number of customers account for a significant portion of our net revenue. Direct sales to one customer, which is a distributor, accounted for 28% and 21% of our net revenue for fiscal years 2024 and 2023, respectively. \nWe believe aggregate sales to our top five end customers, through all channels, accounted for approximately 40% and 35% of our net revenue for fiscal years 2024 and 2023, respectively. We expect to continue to experience significant customer concentration in future periods. The loss of, or significant decrease in demand from, any of our top five end customers could have a material adverse effect on our business, results of operations and financial condition. \nFrom time to time, some of our key semiconductor customers place large orders or delay orders, causing our quarterly net revenue to fluctuate significantly. This is particularly true of our products used in AI and wireless applications as fluctuations may be magnified by the timing of customer deployments and product launches, and seasonal variations in sales. In addition, the macroeconomic environment remains uncertain and may cause our net revenue to fluctuate significantly and impact our results of operations.\nAlthough we recognize revenue for the majority of our products when title and control transfer in Penang, Malaysia, we disclose net revenue by country based primarily on the geographic shipment or delivery location specified by our distributors, OEMs, contract manufacturers, channel partners, or software customers. In fiscal years 2024 and 2023, 20% and 32%, respectively, of our net revenue came from shipments or deliveries to China (including Hong Kong). However, the end customers for either our products or for the end products into which our products are incorporated, are frequently located in countries other than China (including Hong Kong). As a result, we believe that a substantially smaller percentage of our net revenue is ultimately dependent on sales of either our product or our customers’ product incorporating our product, to end customers located in China (including Hong Kong). \n42\nTable of Contents\nThe following tables set forth net revenue by segment for the periods presented:\nFiscal Year Ended\nNet Revenue by Segment\nNovember 3,\n2024\nOctober 29,\n2023\n$ Change\n% Change\n(In millions, except percentages)\nSemiconductor solutions\n$\n30,096 \n$\n28,182 \n$\n1,914 \n7 \n%\nInfrastructure software\n21,478 \n7,637 \n13,841 \n181 \n%\nTotal net revenue\n$\n51,574 \n$\n35,819 \n$\n15,755 \n44 \n%\nFiscal Year Ended\nNet Revenue by Segment\nNovember 3, 2024\nOctober 29, 2023\n(As a percentage of net revenue)\nSemiconductor solutions\n58 \n%\n79 \n%\nInfrastructure software\n42 \n21 \nTotal net revenue\n100 \n%\n100 \n%\nNet revenue from our semiconductor solutions segment increased due to strong product demand for our networking products, primarily AI networking products, partially offset by lower demand for our broadband and server storage products. Net revenue from our infrastructure software segment increased primarily due to contributions from VMware.\nGross Margin\nGross margin was $32,509 million for fiscal year 2024 compared to $24,690 million for fiscal year 2023. The increase was primarily due to contributions from VMware, partially offset by higher amortization of acquisition-related intangible assets from the VMware Merger.\nAs a percentage of net revenue, gross margin was 63% and 69% of net revenue for the fiscal years 2024 and 2023, respectively. The decrease was primarily due to higher amortization of acquisition-related intangible assets from the VMware Merger. In addition, gross margin contributions from our infrastructure software segment were partially offset by less favorable margin within the semiconductor solutions segment driven by product mix.  \nResearch and Development Expense\nResearch and development expense increased $4,057 million, or 77%, in fiscal year 2024, compared to the prior fiscal year. The increase was primarily due to higher compensation, including higher stock-based compensation, as a result of an increase in headcount from the VMware Merger. The increase in stock-based compensation expense was also due to annual employee equity awards granted at higher grant-date fair values.\nSelling, General and Administrative Expense\nSelling, general and administrative expense increased $3,367 million, or 211%, in fiscal year 2024, compared to the prior fiscal year. The increase was primarily due to higher compensation, including higher stock-based compensation, as a result of an increase in headcount from the VMware Merger. The increase in stock-based compensation expense was also due to annual employee equity awards granted at higher grant-date fair values.\nAmortization of Acquisition-Related Intangible Assets\nAmortization of acquisition-related intangible assets recognized in operating expenses increased $1,850 million, or 133%, in fiscal year 2024, compared to the prior fiscal year primarily due to higher amortization of customer-related intangible assets from the VMware Merger.\nRestructuring and Other Charges\nRestructuring and other charges recognized in operating expenses were $1,533 million and $244 million in fiscal years 2024 and 2023, respectively. The fiscal year 2024 charges primarily included employee termination costs from cost reduction activities related to the VMware Merger. The fiscal year 2023 charges primarily included non-recurring charges related to IP litigation.\n43\nTable of Contents\nStock-Based Compensation Expense\nTotal stock-based compensation expense was $5,670 million and $2,171 million for fiscal years 2024 and 2023, respectively. The increase was primarily due to equity awards assumed and granted in connection with the VMware Merger and annual employee equity awards granted at higher grant-date fair values.\nThe following table sets forth the total unrecognized compensation cost related to unvested stock-based awards outstanding and expected to vest as of November 3, 2024. The remaining weighted-average service period was 3.0 years. \nFiscal Year:\nUnrecognized Compensation Cost, Net of Expected Forfeitures\n(In millions)\n2025\n$\n4,429 \n2026\n3,607 \n2027\n2,643 \n2028\n580 \nTotal\n$\n11,259 \nDuring the first quarter of fiscal year ended November 3, 2019 (“fiscal year 2019”), our Compensation Committee approved a broad-based program of multi-year equity grants of time- and market-based RSUs (the “Multi-Year Equity Awards”) in lieu of our annual employee equity awards historically granted on March 15 of each year. Each Multi-Year Equity Award vests on the same basis as four annual grants made on March 15 of each year, beginning in fiscal year 2019, with successive four-year vesting periods. We recognize stock-based compensation expense related to the Multi-Year Equity Awards from the grant date through their respective vesting date, ranging from 4 years to 7 years.\nSegment Operating Results \nFiscal Year Ended\nOperating Income by Segment\nNovember 3, 2024\nOctober 29, 2023\n$ Change\n% Change\n(In millions, except percentages)\nSemiconductor solutions\n$\n16,759 \n$\n16,486 \n$\n273 \n2 \n%\nInfrastructure software\n13,977 \n5,639 \n8,338 \n148 \n%\nUnallocated expenses\n(17,273)\n(5,918)\n(11,355)\n192 \n%\nTotal operating income\n$\n13,463 \n$\n16,207 \n$\n(2,744)\n(17)\n%\nOperating income from our semiconductor solutions segment increased mainly driven by revenue growth from networking products, primarily AI networking products, partially offset by lower net revenue from our broadband and server storage products. Operating income from our infrastructure software segment increased primarily due to contributions from VMware.\nUnallocated expenses include amortization of acquisition-related intangible assets; stock-based compensation expense; restructuring and other charges; acquisition-related costs; and other costs that are not used in evaluating the results of, or in allocating resources to, our segments. Unallocated expenses increased 192% in fiscal year 2024, compared to the prior fiscal year, primarily due to higher amortization of acquisition-related intangible assets, stock-based compensation expense and restructuring and other charges. These increases were primarily due to the VMware Merger. The increase in stock-based compensation expense was also due to \nannual employee equity awards granted at higher grant-date fair values\n.\nNon-Operating Income and Expenses\nInterest expense.\n  Interest expense was $3,953 million and $1,622 million for fiscal years 2024 and 2023, respectively. The increase was primarily due to interest on debt incurred for the VMware Merger.\nOther income (expense), net.  \nOther income (expense), net includes interest income, gains and losses on investments, foreign currency remeasurement and other miscellaneous items. Other income, net, was $406 million and $512 million for fiscal years 2024 and 2023, respectively. The decrease was primarily due to lower interest income as a result of a lower invested balance.\n44\nTable of Contents\nProvision for income taxes.\n  The provision for income taxes was $3,748 million and $1,015 million for fiscal years 2024 and 2023, respectively. The increase was primarily due to the impact of a non-recurring intra-group transfer of certain IP rights to the United States as a result of supply chain realignment and the resulting shift in the jurisdictional mix of income.\nLiquidity and Capital Resources\nThe following section discusses our principal liquidity and capital resources as well as our primary liquidity requirements and uses of cash. Our cash and cash equivalents are maintained in highly liquid investments with remaining maturities of 90 days or less at the time of purchase. We believe our cash equivalents are liquid and accessible. \nOur primary sources of liquidity as of November 3, 2024 consisted of: (i) $9,348 million in cash and cash equivalents, (ii) cash we expect to generate from operations and (iii) available capacity under our $7.5 billion unsecured revolving credit facility. In addition, we may also generate cash from the sale of assets and debt or equity financings from time to time.\nOur short-term and long-term liquidity requirements primarily arise from: (i) business acquisitions and investments we may make from time to time, (ii) working capital requirements, (iii) research and development and capital expenditure needs, (iv) cash dividend payments (if and when declared by our Board of Directors), (v) interest and principal payments related to our $69,847 million of outstanding indebtedness, and (vi) payment of income taxes. Our ability to fund these requirements will depend, in part, on our future cash flows, which are determined by our future operating performance and, therefore, subject to prevailing global macroeconomic conditions and financial, business and other factors, some of which are beyond our control. We expect capital expenditures to be higher in the fiscal year ending November 2, 2025 as compared to fiscal year 2024. Our debt and liquidity needs increased in fiscal year 2024 as a result of completing the VMware Merger. We funded the cash portion of the consideration with net proceeds from the issuance of $30,390 million in term loans (the “2023 Term Loans”), as well as cash on hand. We also assumed $8,250 million of VMware’s outstanding senior unsecured notes. During fiscal year 2024, we made repayments of $16,795 million on our 2023 Term Loans.\nWe believe that our cash and cash equivalents on hand, cash flows from operations and our revolving credit facility will provide sufficient liquidity to operate our business and fund our current and assumed obligations for at least the next 12 months. For additional information regarding our cash requirement from contractual obligations, indebtedness and lease obligations, see Note 14. “Commitments and Contingencies”, Note 10. “Borrowings” and Note 6. “Leases” in Part II, Item 8 of this Annual Report on Form 10-K.\nFrom time to time, we engage in discussions with third parties regarding potential acquisitions of, or investments in, businesses, technologies and product lines. Any such transaction, or evaluation of potential transactions, could require significant use of our cash and cash equivalents, or require us to increase our borrowings to fund such transactions. If we do not have sufficient cash to fund our operations or finance growth opportunities, including acquisitions, or unanticipated capital expenditures, our business and financial condition could suffer. In such circumstances, we may seek to obtain new debt or equity financing. However, we cannot assure you that such additional financing will be available on terms acceptable to us or at all. Our ability to service our senior unsecured notes, the 2023 Term Loans and any other indebtedness we may incur will depend on our ability to generate cash in the future. We may also elect to sell additional debt or equity securities for reasons other than those specified above.\nIn addition, we may, at any time and from time to time, seek to retire or purchase our outstanding debt through cash tenders and/or exchanges for equity or debt, in open-market purchases, privately negotiated transactions or otherwise. Such tenders, exchanges or purchases, if any, will be upon such terms and at such prices as we may determine, and will depend on prevailing market conditions, our liquidity requirements, contractual restrictions and other factors. We may also make additional prepayments of the 2023 Term Loans. The amounts involved may be material. \n45\nTable of Contents\nWorking Capital\nOn November 22, 2023, we completed the VMware Merger. The following table presents the changes in selected balance sheet captions other than assets acquired and liabilities assumed from the VMware Merger during fiscal year 2024.\nBalances at \nOctober 29, \n2023\nBalances Acquired and Assumed from VMware (a)\nBalances at \nNovember 3, \n2024\nNon-VMware Acquisition \nChange\n(In millions)\nTrade accounts receivable, net\n$\n3,154 \n$\n3,571 \n$\n4,416 \n$\n(2,309)\nOther current assets\n$\n1,606 \n$\n1,108 \n$\n4,071 \n$\n1,357 \nAccounts payable\n$\n1,210 \n$\n359 \n$\n1,662 \n$\n93 \nEmployee compensation and benefits\n$\n935 \n$\n848 \n$\n1,971 \n$\n188 \nCurrent portion of long-term debt\n$\n1,608 \n$\n1,264 \n$\n1,271 \n$\n(1,601)\nOther current liabilities\n$\n3,652 \n$\n11,217 \n$\n11,793 \n$\n(3,076)\n_____________________________\n(a)\nExcludes VMware’s EUC assets and liabilities held for sale. \n•\nTrade accounts receivable, net decreased primarily due to strong collections and additional receivables sold through factoring arrangements.\n•\nOther current assets increased from higher contract assets due to the timing of software revenue recognition.\n•\nCurrent portion of long-term debt decreased primarily due to $2,813 million of repayments, offset in part by $1,245 million becoming due within the next twelve months.\n•\nOther current liabilities decreased primarily from lower contract liabilities as software revenue was recognized from previous software contracts. \nCapital Returns\nFiscal Year Ended\nCash Dividends Declared and Paid\nNovember 3, 2024\nOctober 29, 2023\n(In millions, except per share data)\nDividends per share to common stockholders\n$\n2.105 \n$\n1.840 \nDividends to common stockholders\n$\n9,814 \n$\n7,645 \nIn December 2021, our Board of Directors authorized a stock repurchase program to repurchase up to $10 billion of our common stock from time to time through December 31, 2022, which was subsequently extended to December 31, 2023. In May 2022, our Board of Directors authorized another stock repurchase program to repurchase up to an additional $10 billion of our common stock from time to time through December 31, 2023. During fiscal years 2024 and 2023, we repurchased and retired approximately 67 million and 91 million shares of our common stock for $7,176 million and $5,824 million, respectively. All $20 billion of the authorized amount under these stock repurchase programs was utilized prior to expiration on December 31, 2023. \n46\nTable of Contents\nDuring fiscal years 2024 and 2023, we paid approximately $5,216 million and $1,861 million, respectively, in employee withholding taxes due upon the vesting of net settled equity awards. We withheld approximately 38 million and 26 million shares of common stock from employees in connection with such net share settlements during fiscal years 2024 and 2023, respectively.\nCash Flows\n \nFiscal Year Ended\nNovember 3, 2024\nOctober 29, 2023\n(In millions)\nNet cash provided by operating activities\n$\n19,962 \n$\n18,085 \nNet cash used in investing activities\n(23,070)\n(689)\nNet cash used in financing activities\n(1,733)\n(15,623)\nNet change in cash and cash equivalents\n$\n(4,841)\n$\n1,773 \nOperating Activities\nCash flows from operating activities consisted of net income adjusted for certain non-cash and other items and changes in assets and liabilities. The $1,877 million increase in cash provided by operations during fiscal year 2024 compared to fiscal year 2023 was primarily due to contributions from VMware. The $8,187 million decrease in net income was largely driven by $13,058 million higher non-cash adjustments including amortization of intangible assets, stock-based compensation, and deferred taxes and other non-cash taxes related to the VMware Merger. \nInvesting Activities \nCash flows from investing activities primarily consisted of cash used for acquisitions, proceeds from the sale of a business, capital expenditures, and proceeds and payments related to investments. The $22,381 million increase in cash used in investing activities for fiscal year 2024 compared to fiscal year 2023 was primarily due to a $25,925 million increase in cash used for acquisitions due to the VMware Merger and the acquisition of Seagate’s SoC operations, net of cash acquired, offset in part by $3,485 million proceeds from the sale of the EUC business. \nFinancing Activities\nCash flows from financing activities primarily consisted of proceeds and payments related to our long-term borrowings, dividend payments, stock repurchases, and employee withholding tax payments related to net settled equity awards. The $13,890 million increase in cash flows from financing activities for fiscal year 2024 compared to fiscal year 2023 was primarily due to $39,954 million of net proceeds from the 2023 Term Loans and the issuance of senior notes, offset in part by a $19,205 million increase in payments on debt obligations, a $3,355 million increase in employee withholding tax payments related to net settled equity awards, a $2,169 million increase in dividend payments, and a $1,352 million increase in stock repurchases.",
  "item2": null
}