{
  "source_file": "avy-20241228.htm",
  "form_type": "10-K",
  "item1": "Item 1. BUSINESS\nCompany Background\nAvery Dennison Corporation (“Avery Dennison” or the “Company” and generally referred to as “we” or “us”) was incorporated in Delaware in 1977 as Avery International Corporation, the successor corporation to a California corporation of the same name incorporated in 1946. In 1990, we merged one of our subsidiaries into Dennison Manufacturing Company (“Dennison”), as a result of which Dennison became our wholly-owned subsidiary and in connection with which we changed our name to Avery Dennison Corporation. You can learn more about us by visiting our website at www.averydennison.com. Our website is not intended to function as a hyperlink and the information on our website is not, nor should it be considered, part of this report or incorporated by reference into this report. \nBusiness Overview and Reportable Segments\nWe are a global materials science and digital identification solutions company. We are Making Possible\nTM\n products and solutions that help advance the industries we serve, providing branding and information solutions that optimize labor and supply chain efficiency, reduce waste, advance sustainability, circularity and transparency, and better connect brands and consumers. We design and develop labeling and functional materials, radio-frequency identification (\"RFID\") inlays and tags, software applications that connect the physical and digital, and offerings that enhance branded packaging and carry or display information that improves the customer experience. We serve an array of industries worldwide, including home and personal care, apparel, general retail, e-commerce, logistics, food and grocery, pharmaceuticals and automotive.\nWe believe that our exposure to diverse and growing markets, the size and scale of operations, our innovation capabilities, productivity culture, and brand strength across our businesses are the primary advantages in maintaining and further developing our competitive position.\nOur reportable segments for fiscal year 2024 were Materials Group and Solutions Group. In 2024, our Materials Group and Solutions Group reportable segments comprised approximately 69% and 31%, respectively, of our total net sales. \nIn 2024, international operations constituted a substantial majority of our business, representing approximately 70% of our net sales. As of December 28, 2024, we operated over 200 manufacturing and distribution facilities and had locations in more than 50 countries. \nMaterials Group\nOur Materials Group is a leading global provider to the pressure-sensitive label and graphics industries. Our innovative products include label materials, graphics and reflective materials and functional bonding materials, like tapes. Our label materials enhance brands' shelf appeal, inform shoppers, advance circularity, increase transparency, help reduce waste and improve operational supply chain efficiency. Our graphics portfolio offers highly engineered products ranging from vehicle wraps to architectural films. Our tapes portfolio includes bonding and functional materials for applications in various industry sectors such as automotive, building and construction and electronics. We leverage the group's materials science capabilities and process engineering expertise to develop and manufacture Intelligent Labels at scale and drive their further adoption through our converter channel access. \nOur Materials Group manufactures and sells Fasson\n®\n-, JAC\n®\n-, and Avery Dennison\n®\n-brand pressure-sensitive label materials and performance tapes products, Avery Dennison\n®\n- and Mactac\n®\n-brand graphics, and Avery Dennison\n®\n-brand reflective products. Materials Group’s business tends not to be seasonal, except for certain outdoor graphics and reflective products.\nPressure-sensitive materials consist primarily of papers, plastic films and metal foils, which are coated with internally-developed and purchased adhesives, and then laminated with specially-coated backing papers and films. They are then sold in roll or sheet form with either solid or patterned adhesive coatings in a wide range of face materials, sizes, thicknesses and adhesive properties.\nA pressure-sensitive, or self-adhesive, material is one that adheres to a surface by press-on contact. It generally consists of four layers: a face material, which may be paper, metal foil or plastic film; an adhesive, which may be permanent or removable; a release coating; and a backing material to protect the adhesive from premature contact with other surfaces that can also serve as a carrier for supporting and dispensing individual labels. When the products are ready for use, the release coating and protective backing are removed, exposing the adhesive so that the label or other face material may be pressed or rolled into place. Because they are easy to apply without the need for adhesive activation, self-adhesive materials can provide cost savings compared to other materials that require heat- or moisture-activated adhesives, while also offering aesthetic and other advantages over alternative technologies.\nLabel materials are sold worldwide to label converters for labeling, decorating and specialty applications in the food, home and personal care, beer and beverage, durables, pharmaceutical, wine and spirits and logistics market segments. When used in package decoration applications, the visual appeal of self-adhesive materials can help increase sales of the products on which the materials are applied. Self-adhesive materials are also used to convey variable information through \n2\nTable of Contents\nvarious digital triggers, including bar codes, QR codes and RFID inlays, for applications such as shipping labels and weight and price information for packaged meats and other foods. Self-adhesive materials provide consistent and versatile adhesion and are available in a large selection of materials, which can be made into labels of varying sizes and shapes.\nOur graphics and reflective products include a variety of films and other products that are sold to the architectural, commercial sign, digital printing and other related market segments. We also sell durable cast and reflective films to the construction, automotive and fleet transportation market segments and reflective films for traffic and safety applications. We provide sign shops, commercial printers and designers a broad range of pressure-sensitive materials that allow them to create impactful and informative brand and decorative graphics. We offer a wide array of pressure-sensitive vinyl and specialty materials designed for digital imaging, screen printing and sign cutting applications.\nOur performance tapes products include a variety of Fasson\n®\n-brand and Avery Dennison\n®\n-brand tapes and other pressure-sensitive adhesive-based materials and converted products, mechanical fasteners and performance polymers. Our pressure-sensitive adhesive-based materials are available in roll form and in a wide range of face materials, sizes, thicknesses and adhesive properties. These materials and converted products are used in non-mechanical fastening, bonding and sealing systems for various automotive, electronics, building and construction, general industrial, personal care, and medical applications. The mechanical fasteners are primarily precision-extruded and injection-molded plastic devices used in various automotive, general industrial and retail applications.\nOur larger competitors in label materials include UPM Raflatac, a subsidiary of UPM Corporation; Fedrigoni Self-Adhesives; Lintec Corporation; Flexcon Corporation, Inc.; and an array of smaller regional and local companies. For graphics and reflective products, our largest competitors are 3M Company (“3M”) and the Orafol Group. For performance tapes products, our competitors include 3M; Tesa-SE, a subsidiary of Beiersdorf AG; Nitto Denko Corporation; and numerous regional and specialty suppliers. For fastener products, there are a variety of competitors supplying extruded and injection molded fasteners and fastener attaching equipment. We believe that entry of competitors into the field of pressure-sensitive adhesives and materials is limited by technical knowledge and capital requirements. We believe that our technical expertise, size and scale of operations, broad line of quality products, reliable service, product and process innovation, distribution capabilities and brand strength are the primary advantages in maintaining and further developing our competitive position.\nSolutions Group \nOur Solutions Group is a leading provider of information and branding solutions that cover worldwide marketplace needs ranging from digital identification and data management to branding and embellishment, productivity, pricing and retail media. As a large ultra-high-frequency RFID solutions provider, we empower customers across multiple retail and industry segments, including apparel, logistics, food and grocery and general retail, to connect the physical and digital worlds by enabling a digital identity and life on physical items. Our innovation and data management capabilities, global footprint and market access continuously expand our solutions platform.\nThe branding solutions of the Solutions Group include brand embellishments, graphic tickets, tags, and labels, and sustainable packaging. Solutions Group’s information solutions include item-level RFID solutions; visibility and loss prevention solutions; price ticketing and marking; care, content, and country of origin compliance solutions; brand protection and security solutions; and Vestcom\n®\n-brand shelf-edge productivity and media solutions.\nIn the Solutions Group, our primary competitors include Checkpoint Systems, Inc., a subsidiary of CCL Industries Inc.; R-pac International Corporation; SML Group Limited; Arizon RFID Technology Cayman Co Ltd; and Tageos, a subsidiary of Fedrigoni Group. We believe that our product, process and solution innovation, global distribution network, reliable service, product quality and consistency, and ability to serve customers consistently with comprehensive solutions close to where they manufacture, source and sell are the key advantages in maintaining and further developing our competitive position.\nResearch, Development and Innovation \nAs a global leader in materials science, we innovate to develop and introduce new products and solutions that help customers solve some of the most complex problems in the industries we serve. Our vision is to leverage the strengths of our Materials and Solutions groups to continue to drive growth within these businesses and lead at the intersection of the physical and digital worlds. Our decades of experience creating solutions for customers and our core capabilities in materials science, engineering and process technology enable us to drive continuous innovation throughout our industries. Our innovation efforts focus on anticipating market and customer challenges and opportunities, and applying technology to address them. Our investment in innovation aims to accelerate growth by developing new products and solutions, expand margins through material re-engineering, and enable customer success by leveraging scalable innovation platforms and delivering sustainability initiatives and advanced technologies.\nMany of our new products result from our research and development efforts. These efforts are directed primarily toward developing products, solutions and operating techniques and improving productivity, sustainability and product performance, often in close association with our customers or end users. These efforts provide intellectual property that leverages our research and development relating to materials science, such as adhesives, films, inks and release liners, and process engineering technology, such as coating, laminating and printing technologies in Materials Group. We focus on research projects related to RFID, external embellishments, data and digital solutions and printing technologies in Solutions \n3\nTable of Contents\nGroup, in each case for which we have and license a number of patents. Additionally, our research and development efforts include sustainable innovation and design of products that advance the circular economy, reduce materials and waste, use recycled content, and extend product end-of-life or enable product recycling.\nAcquisitions and Venture Investments\nIn addition to our investments to support organic growth, we have pursued complementary and synergistic acquisitions. In 2023, we acquired Silver Crystal Group (\"Silver Crystal\"), a Canada-based provider of sports apparel customization and application solutions across in-venue, direct-to-business and e-commerce platforms; LG Group, Inc. (\"Lion Brothers\"), a Maryland-based designer and manufacturer of apparel brand embellishments; and Thermopatch, Inc. (\"Thermopatch\"), a New York-based manufacturer specializing in labeling, embellishments and transfers for the sports, industrial laundry, workwear and hospitality industries. The aggregate purchase consideration for these acquisitions was approximately $231 million. During 2024, we also made venture investments in three companies developing technological solutions that we believe have the potential to advance our businesses. For information regarding our acquisitions, see Note 2, “Business Acquisitions,” in the Notes to Consolidated Financial Statements. For information regarding our venture investments, see Note 9, “Fair Value Measurements,” in the Notes to Consolidated Financial Statements.\nPatents, Trademarks and Licenses\nThe loss of individual patents or licenses would not be material to us taken as a whole, nor to our operating segments individually. Our principal trademarks are Avery Dennison, our logo, and Fasson. We believe these trademarks are strong in the market segments in which we operate.\nHuman Capital Resources\nOur Global Workforce\nWith approximately 70% of our 2024 net sales originating outside the U.S. and approximately 40% of our net sales originating in emerging markets (Latin America, Eastern Europe, Middle East/Northern Africa, and most countries in Asia Pacific), our employees are located in more than 50 countries to best serve our customers. Approximately 83% of our employees at year-end 2024 were located outside the U.S. and approximately 66% were located in emerging markets.\nThe charts below show our global employee population by region and operational function. Over 19,000 of our approximately 35,000 employees at year-end 2024, representing approximately 58% of our global workforce, were in Asia Pacific, serving our customers in that region. At that time, approximately 65% of our global workforce worked in the operations of our manufacturing facilities or in positions directly supporting them from other locations.\nWorkforce by Region\nAsia Pacific\n58 \n%\nNorth America\n21 \nEurope\n17 \nLatin America\n4 \nWorkforce by Function\nOperations\n65 \n%\nNon-Operations\n35 \nTalent & Development\nAttracting, developing and retaining highly-skilled talent is critical to our ability to continue delivering sustainable growth. We provide ongoing support and professional development resources to our team members worldwide to ensure that their skills evolve with our business needs, industry trends and human capital management best practices, as well as enable increased productivity, peak performance and career growth. We have robust talent review and succession planning processes that provide individually targeted development opportunities for our team members. We emphasize on-the-job development and coaching, and also provide facilitator-led and direct-access online training, leadership opportunities to execute special projects and, in some cases, cross-functional, cross-regional, or cross-divisional work assignments. In 2024, we introduced an enterprise-wide competency model that provides transparency and clarity around what we expect from our leaders, which will serve as the go-forward foundation of all of our talent practices, from talent selection and retention to individual and career development to succession.\n4\nTable of Contents\nCompensation & Benefits\nOur total rewards philosophy is to offer market-based, competitive wages and benefits in the markets where we compete for talent. All of our employees were paid at least the applicable legal minimum wage, and over 99% of our employees were paid above the applicable legal minimum wage, at year-end 2024. Pay is generally positioned around the market median, with variances based on knowledge, skills, years of experience and in line with our pay for performance philosophy. In addition to base wages, our compensation and benefit programs — which vary by region, country and business unit — include short-term incentives (generally paid in cash), long-term incentives (e.g., cash- or stock-based awards), employee benefit and retirement plans, healthcare and insurance benefits, health savings and flexible spending accounts, paid time off, leave of absence and employee assistance programs. We offer the opportunity for flexible work arrangements for most of our office-based workforce to provide them with greater flexibility to balance their work and personal commitments, while ensuring that we meet the needs of our business. Our information technology infrastructure, information security protocols and digital tools support employee efficiency and effectiveness wherever they work.\nPay equity is an important part of our global pay planning and practices. Each year, we engage an independent third party to evaluate pay equity, making merit-based pay adjustments where appropriate. In 2024, we reviewed pay equity (considering total base, annual incentives and long-term incentives) with respect to gender for 93% of our global employee population, and with respect to gender and race/ethnicity for all U.S. employees. We continue to enhance our manager education, tools and processes to provide fair and equitable pay.\nEmployee Engagement\nBecause we believe that an engaged workforce promotes retention and minimizes employee turnover, we annually conduct a global employee engagement survey. With a focus on continuous improvement, in 2023 we launched our survey using a more advanced platform providing real-time access to results, improved analytics and ability to connect data throughout the employee experience, more meaningful comparisons to external benchmarks, and ongoing pulse survey capability. We deployed this same platform in 2024, enabling year-over-year comparability of results. Our business and functional teams use the anonymized results of our survey to identify and implement actions to address potential opportunities for improvement. While employee engagement is the result of many factors, we believe strong, encouraging and open leadership, as well as a continued effort to foster a collaborative, supportive culture, leads to strong workforce engagement.\nWorkforce Health & Safety\nSafety is one of our highest priorities, and we continually work to ensure our manufacturing facilities, distribution centers and administrative offices focus on safety, so that anyone working in or visiting one of our locations feels and remains safe from injury. Our global Recordable Incident Rate of 0.21 in 2024 was significantly lower than the Occupational Safety and Health Administration manufacturing industry average of 2.8 in 2023 (the most recent available industry average).\nWorkplace Culture\nWe aim to foster an environment where our employees with various skills, experiences and backgrounds can grow and be increasingly productive and innovative, allowing us to benefit from a highly engaged team and attract and retain talent for the benefit of our stakeholders. Our global people-focused strategic pillars include enhancing the experience of our manufacturing employees and making merit and transparency even more foundational to our employee experience. We have a global team that helps advance these priorities in coordination with regional councils and our employee resource groups, which are open to all our team members and provide individuals with shared interests a forum in which to identify ways in which we can improve our employee experience.\nManufacturing and Environmental Matters\nWe use various raw materials – primarily paper, plastic films and resins, as well as specialty chemicals purchased from various commercial and industrial sources – that are subject to price fluctuations. Although shortages can occur from time to time, these raw materials are generally available.\nWe produce a majority of our self-adhesive materials using water-based emulsion and hot-melt adhesive technologies. A portion of our manufacturing process for self-adhesive materials utilizes organic solvents, which, unless controlled, could be emitted into the atmosphere or contaminate soil or groundwater. Emissions from these operations contain small amounts of volatile organic compounds, which are regulated by federal, state, local and foreign governments. We continue to evaluate the use of alternative materials and technologies to minimize these emissions. In connection with the maintenance and acquisition of certain manufacturing equipment, we invest in solvent capture and control units to assist in regulating these emissions.\nWe have developed adhesives and adhesive processing systems that minimize the use of solvents. Emulsion adhesives, hot-melt adhesives, and solventless and emulsion silicone systems have been installed in many of our facilities.\n5\nTable of Contents\nBased on current information, we do not believe that the cost of complying with applicable laws regulating the emission or discharge of materials into the environment, or otherwise relating to the protection of the environment, will have a material effect upon our capital expenditures, consolidated financial position, results of operations or competitive position.\nFor information regarding our potential responsibility for cleanup costs at certain hazardous waste sites, see Note 8, “Contingencies,” in the Notes to Consolidated Financial Statements.\nAvailable Information\nOur Annual Reports on Form 10-K, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K and amendments to those reports filed with, or furnished to, the Securities and Exchange Commission (“SEC”) pursuant to Section 13(a) or 15(d) of the Securities Exchange Act of 1934, as amended (the “Exchange Act”), are available free of charge on our investor website at www.investors.averydennison.com as soon as reasonably practicable after they are electronically filed with or furnished to the SEC. This website address is not intended to function as a hyperlink and the information located there is not, nor should it be considered, part of this report or incorporated by reference into this report. We also make available on the investors section of our website under \"Governance Documents\" the following documents as currently in effect: (i) Amended and Restated Certificate of Incorporation, as amended; (ii) Amended and Restated Bylaws; (iii) Corporate Governance Guidelines; (iv) Code of Conduct, which applies to our directors, officers and employees; (v) Code of Ethics for our Chief Executive Officer and Senior Financial Officers; (vi) charters of the Audit, Talent and Compensation, Governance and Finance Committees of our Board of Directors; and (vii) Audit Committee Complaint Procedures for Accounting and Auditing Matters. These documents are also available free of charge upon written request to our Corporate Secretary, Avery Dennison Corporation, 8080 Norton Parkway, Mentor, Ohio 44060.\nReports filed with or furnished to the SEC may be viewed at www.sec.gov.\n6\nTable of Contents",
  "item7": "Item 7. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nORGANIZATION OF INFORMATION \nManagement’s Discussion and Analysis of Financial Condition and Results of Operations, or MD&A, provides management’s views on our financial condition and results of operations, should be read in conjunction with the Consolidated Financial Statements and related notes thereto, and includes the sections shown below. \nNon-GAAP Financial Measures\n22\nOverview and Outlook\n23\nAnalysis of Results of Operations\n25\nResults of Operations by Reportable Segment\n27\nFinancial Condition\n29\nCritical Accounting Estimates\n34\nRecent Accounting Requirements\n37\nNON-GAAP FINANCIAL MEASURES \nWe report our financial results in conformity with accounting principles generally accepted in the United States of America, or GAAP, and also communicate with investors using certain non-GAAP financial measures. These non-GAAP financial measures are not in accordance with, nor are they a substitute for or superior to, the comparable GAAP financial measures. These non-GAAP financial measures are intended to supplement the presentation of our financial results prepared in accordance with GAAP. We use these non-GAAP financial measures internally to evaluate trends in our underlying performance, as well as to facilitate comparison with the results of competitors for quarters and year-to-date periods, as applicable. Based on feedback from investors and financial analysts, we believe that the supplemental non-GAAP financial measures we provide are also useful to their assessments of our performance and operating trends, as well as liquidity. Reconciliations of our non-GAAP financial measures from the most directly comparable GAAP financial measures are provided in accordance with Regulations G and S-K.\nOur non-GAAP financial measures exclude the impact of certain events, activities or strategic decisions. The accounting effects of these events, activities or decisions, which are included in the GAAP financial measures, may make it more difficult to assess our underlying performance in a single period. By excluding the accounting effects, positive or negative, of certain items (e.g., restructuring charges, outcomes of certain legal matters and settlements, certain effects of strategic transactions and related costs, losses from debt extinguishments, gains or losses from curtailment or settlement of pension obligations, gains or losses on sales of certain assets, gains or losses on venture investments, currency adjustments due to highly inflationary economies, and other items), we believe that we are providing meaningful supplemental information that facilitates an understanding of our core operating results and liquidity measures. While some of the items we exclude from GAAP financial measures recur, they tend to be disparate in amount, frequency or timing. \nWe use the non-GAAP financial measures described below in this MD&A. \n•\nSales change ex. currency\n refers to the increase or decrease in net sales, excluding the estimated impact of foreign currency translation, and, where applicable, the currency adjustments for transitional reporting of highly inflationary economies, and the reclassification of sales between segments. Additionally, where applicable, sales change ex. currency is also adjusted for an extra week in our fiscal year and the calendar shift resulting from an extra week in the prior fiscal year. The estimated impact of foreign currency translation is calculated on a constant currency basis, with prior-period results translated at current period average exchange rates to exclude the effect of foreign currency fluctuations. \nOur 2025 fiscal year that began on December 29, 2024 will end on December 31, 2025; fiscal years 2026 and beyond will be coincident with the calendar year beginning on January 1 and ending on December 31.\n•\nOrganic sales change\n refers to sales change ex. currency, excluding the estimated impact of acquisitions and product line divestitures. \nWe believe that sales change ex. currency and organic sales change assist investors in evaluating the sales change from the ongoing activities of our businesses and enhance their ability to evaluate our results from period to period. \n•\nAdjusted free cash flow\n refers to cash flow provided by operating activities, less payments for property, plant and equipment, less payments for software and other deferred charges, plus proceeds from company-owned life insurance policies, plus proceeds from sales of property, plant and equipment, plus (minus) net proceeds from insurance and sales (purchases) of investments, less net cash used for Argentine Blue Chip Swap securities. Where applicable, adjusted free cash flow is also adjusted for certain acquisition-related transaction costs. We believe that adjusted free cash flow assists investors by showing the amount of cash we have available for debt reductions, dividends, share repurchases, and acquisitions. \n22\nTable of Contents\n•\nOperational working capital as a percentage of annualized current quarter net sales \nrefers to trade accounts receivable and inventories, net of accounts payable, and excludes cash and cash equivalents, short-term borrowings, deferred taxes, other current assets and other current liabilities divided by annualized current quarter net sales. We believe that operational working capital as a percentage of annualized current quarter net sales assists investors in assessing our working capital requirements because it excludes the impact of fluctuations attributable to our financing and other activities (which affect cash and cash equivalents, deferred taxes, other current assets and other current liabilities) that tend to be disparate in amount, frequency or timing, and may increase the volatility of working capital as a percentage of sales from period to period. The items excluded from this measure are not significantly influenced by our day-to-day activities managed at the operating level and do not necessarily reflect the underlying trends in our operations. \nOVERVIEW AND OUTLOOK \nFiscal Year \nOur fiscal years have generally consisted of 52 weeks, with every fifth or sixth fiscal year consisting of 53 weeks; our 2024, 2023 and 2022 fiscal years consisted of 52-week periods ending December 28, 2024, December 30, 2023 and December 31, 2022, respectively.\nSubsequent to fiscal year-end 2024, in January 2025, the Audit Committee of our Board of Directors approved a change to our previous 52- or 53-week fiscal year generally ending on the Saturday closest to December 31 to a fiscal year coincident with the calendar year. Our 2025 fiscal year that began on December 29, 2024 will end on December 31, 2025 and fiscal years 2026 and beyond will begin on January 1 and end on December 31.\nNet Sales \nThe factors impacting reported net sales change, as compared to the prior-year period, are shown in the table below. \n2024\n2023\nReported net sales change\n5 \n%\n(8)\n%\nForeign currency translation\n— \n1 \nSales change ex. currency\n(1)\n5 \n%\n(7)\n%\nAcquisitions\n(1)\n(1)\nOrganic sales change\n(1)\n5 \n%\n(8)\n%\n(1) \nTotals may not sum due to rounding. \nIn 2024, net sales increased on an organic basis primarily due to higher volume, partially offset by the impact of raw material deflation-related price reductions. In 2023, net sales decreased on an organic basis primarily due to lower volume, partially offset by pricing actions.\nNet Income \nNet income increased from approximately $503 million in 2023 to approximately $705 million in 2024. The primary factors affecting this increase were: \n•\nHigher volume\n•\nBenefits from productivity initiatives, including temporary cost-saving actions, material re-engineering and savings from restructuring actions, net of transition costs\n•\nThe impact of the accrual for a legacy legal matter in the prior year\n•\nLower restructuring charges\nThese items were partially offset by the following factors: \n•\nHigher employee-related costs\n•\nHigher provision for income taxes\n•\nThe net impact of raw material deflation-related price reductions\nCost Reduction Actions \n2025 Actions\nIn the fourth quarter 2024, we recorded $13.1 million in restructuring charges related to our 2025 actions. These charges consisted of severance and related costs for the reduction of approximately 90 positions, as well as asset impairment charges, at numerous locations across our company, reflecting actions in our Solutions Group reportable segment.\n23\nTable of Contents\n2023 Actions\nDuring 2024, we recorded $28.8 million in restructuring charges, net of reversals, related to our 2023 actions. These charges consisted of severance and related costs for the reduction of approximately 1,280 positions, as well as asset impairment charges, at numerous locations across our company. During 2023, we recorded $49.0 million in restructuring charges, net of reversals, related to these actions. These charges consisted of severance and related costs for the reduction of approximately 1,450 positions, as well as asset impairment charges, at numerous locations across our company.\nIn the third quarter of 2023, we approved a restructuring plan (the \"2023 Plan\") to further optimize the European footprint of our Materials Group reportable segment by reducing operations in a manufacturing facility in Belgium. The cumulative charges associated with the 2023 Plan consisted of severance and related costs for the reduction of approximately 210 positions, as well as asset impairment charges. We recorded $30.4 million in 2023 in restructuring charges related to the 2023 Plan. The activities related to the 2023 Plan are expected to be substantially completed by mid-2025.\nWe realized approximately $63 million and $69 million in savings from restructuring actions, net of transition costs, in 2024 and 2023, respectively, primarily related to our 2023 actions.\nRestructuring charges were included in “Other expense (income), net” in the Consolidated Statements of Income. Refer to Note 13, “Cost Reduction Actions,” to the Consolidated Financial Statements for more information. \nBusiness Acquisitions \n2023 Business Acquisitions\nOn November 23, 2023, we completed our business acquisition of Silver Crystal Group (\"Silver Crystal\"), a Canada-based provider of sports apparel customization and application solutions across in-venue, direct-to-business and e-commerce platforms. On May 22, 2023, we completed our business acquisition of LG Group, Inc. (\"Lion Brothers\"), a Maryland-based designer and manufacturer of apparel brand embellishments. On March 6, 2023, we completed our business acquisition of Thermopatch, Inc. (\"Thermopatch\"), a New York-based manufacturer specializing in labeling, embellishments and transfers for the sports, industrial laundry, workwear and hospitality industries. These acquisitions expanded the product portfolio in our Solutions Group reportable segment. \nThe acquisitions of Silver Crystal, Lion Brothers and Thermopatch are referred to collectively as the \"2023 Acquisitions.\"\nThe aggregate purchase consideration, including purchase consideration payable, for the 2023 Acquisitions was approximately $231 million. We funded the 2023 Acquisitions using cash and commercial paper borrowings. In addition to the cash paid at closing, the sellers in one of these acquisitions are eligible for earn-out payments of up to $5 million, subject to the acquired company achieving certain post-acquisition performance targets. As of the acquisition date, we included an estimate of the fair value of these earn-out payments in the aggregate purchase consideration. \nThe 2023 Acquisitions were not material, individually or in the aggregate, to the Consolidated Financial Statements.\nAccounting Guidance Updates \nRefer to Note 1, “Summary of Significant Accounting Policies,” to the Consolidated Financial Statements for this information. \nCash Flow\n \n(In millions)\n2024\n2023\n2022\nNet cash provided by operating activities\n$\n938.8 \n$\n826.0 \n$\n961.0 \nPurchases of property, plant and equipment\n(208.8)\n(265.3)\n(278.1)\nPurchases of software and other deferred charges\n(31.0)\n(19.8)\n(20.4)\nProceeds from company-owned life insurance policies\n— \n48.1 \n— \nPurchases of Argentine Blue Chip Swap securities\n(34.2)\n— \n— \nProceeds from sales of Argentine Blue Chip Swap securities\n24.0 \n— \n— \nProceeds from sales of property, plant and equipment\n.6 \n1.0 \n2.3 \nProceeds from insurance and sales (purchases) of investments, net\n10.1 \n1.9 \n1.9 \nPayments for certain acquisition-related transaction costs\n— \n— \n.6 \nAdjusted free cash flow\n$\n699.5 \n$\n591.9 \n$\n667.3 \nIn 2024, net cash provided by operating activities increased compared to 2023 primarily due to higher net income, lower incentive compensation payments and lower tax payments, net of refunds, partially offset by changes in operational working capital and the settlement payment for the Adasa legal matter. In 2024, adjusted free cash flow increased compared \n24\nTable of Contents\nto 2023 primarily due to higher net cash provided by operating activities and lower purchases of property, plant and equipment, partially offset by lower proceeds from company-owned life insurance policies.\nOutlook\n \nCertain factors that we believe will contribute to our 2025 results are described below. \n•\nWe anticipate net sales to increase, driven by volume growth in both the Solutions Group and Materials Group reportable segments.\n•\nWe expect an unfavorable impact to our full-year net sales and operating income from foreign currency translation, based on recent rates.\n•\nWe anticipate incremental savings from restructuring actions, net of transition costs.\n•\nWe expect our full-year effective tax rate to be in the mid-twenty percent range.\nANALYSIS OF RESULTS OF OPERATIONS \nIncome before Taxes \n(In millions, except percentages)\n2024\n2023\n2022\nNet sales\n$\n8,755.7 \n$\n8,364.3 \n$\n9,039.3 \nCost of products sold\n6,225.0 \n6,086.8 \n6,635.1 \nGross profit\n2,530.7 \n2,277.5 \n2,404.2 \nMarketing, general and administrative expense\n1,415.3 \n1,313.7 \n1,330.8 \nOther expense (income), net\n71.6 \n180.9 \n(.6)\nInterest expense\n117.0 \n119.0 \n84.1 \nOther non-operating expense (income), net\n(26.7)\n(30.8)\n(9.4)\nIncome before taxes\n$\n953.5 \n$\n694.7 \n$\n999.3 \nGross profit margin\n28.9 \n%\n27.2 \n%\n26.6 \n%\nGross Profit Margin\nGross profit margin in 2024 increased compared to 2023 primarily due to benefits from productivity initiatives, including material re-engineering and savings from restructuring actions, net of transition costs, and higher volume, partially offset by higher employee-related costs.\nGross profit margin in 2023 increased compared to 2022 primarily due to benefits from productivity initiatives, including temporary cost-saving actions, material re-engineering and savings from restructuring actions, net of transition costs, and the net impact of pricing and raw material inputs costs, partially offset by lower volume and higher employee-related costs.\nMarketing, General and Administrative Expense\n \nMarketing, general and administrative expense increased in 2024 compared to 2023 primarily due to higher employee-related costs, partially offset by benefits from productivity initiatives, including savings from restructuring actions, net of transition costs.\nMarketing, general and administrative expense decreased in 2023 compared to 2022 primarily due to benefits from productivity initiatives, including temporary cost-saving actions and savings from restructuring actions, net of transition costs, partially offset by higher employee-related costs and growth investments.\n25\nTable of Contents\nOther Expense (Income), Net\n(In millions)\n2024\n2023\n2022\nOther expense (income), net by type\nRestructuring charges, net of reversals:\nSeverance and related costs, net of reversals\n$\n35.4 \n$\n70.8 \n$\n7.6 \nAsset impairment and lease cancellation charges\n6.5 \n8.6 \n.1 \nOther items:\nLosses from Argentine peso remeasurement and Blue Chip Swap transactions\n16.4 \n29.9 \n— \n(Gain) loss on venture investments\n19.2 \n1.5 \n(13.5)\nOutcomes of legal matters and settlements, net\n(6.2)\n64.3 \n6.3 \nTransaction and related costs\n.3 \n5.3 \n.3 \n(Gain) loss on sales of assets\n— \n.5 \n(1.4)\nOther expense (income), net\n$\n71.6 \n$\n180.9 \n$\n(.6)\nRefer to Note 13, “Cost Reduction Actions,” to the Consolidated Financial Statements for more information regarding restructuring charges, net of reversals. \nRefer to Note 9, “Fair Value Measurements,” to the Consolidated Financial Statements for more information regarding (gain) loss on venture investments. \nRefer to Note 8, \"Contingencies,\" and Note 15, “Segment and Disaggregated Revenue Information,” to the Consolidated Financial Statements for more information regarding outcomes of legal matters and settlements, net.\nInterest Expense\nInterest expense decreased in 2024 compared to 2023 primarily due to a decrease in commercial paper borrowings, partially offset by higher debt balances.\nInterest expense increased in 2023 compared to 2022 primarily as a result of higher interest rates on borrowings and higher debt balances.\nOther Non-Operating Expense (Income), Net\nOther non-operating income decreased in 2024 compared to 2023 due to lower interest income, primarily in Argentina.\nOther non-operating income increased in 2023 compared to 2022 due to higher interest income, primarily in Argentina.\nNet Income and Earnings per Share \n(In millions, except percentages and per share amounts)\n2024\n2023\n2022\nIncome before taxes\n$\n953.5 \n$\n694.7 \n$\n999.3 \nProvision for income taxes\n248.6 \n191.7 \n242.2 \nNet income\n$\n704.9 \n$\n503.0 \n$\n757.1 \nNet income per common share\n$\n8.77 \n$\n6.23 \n$\n9.28 \nNet income per common share, assuming dilution\n8.73 \n6.20 \n9.21 \nEffective tax rate\n26.1 \n%\n27.6 \n%\n24.2 \n%\nProvision for Income Taxes \nOur effective tax rate in 2024 decreased compared to 2023 primarily due to lower non-deductible expenses resulting from the impact of the Argentine peso remeasurement loss and lower tax charges from the recognition of uncertain tax positions in certain foreign jurisdictions, partially offset by higher tax charges from valuation allowances. Our effective tax rate in 2023 increased compared to 2022 primarily due to higher non-deductible expenses resulting from the impact of the Argentine peso remeasurement loss, higher tax charges from the recognition of uncertain tax positions in certain foreign jurisdictions, and lower U.S. federal return-to-provision benefits.\n26\nTable of Contents\nOur effective tax rate can vary from period to period due to a variety of factors, such as changes in our mix of earnings in countries with differing statutory tax rates, changes in our tax reserves, settlements of income tax audits, changes in tax laws and regulations, return-to-provision adjustments, tax impacts related to stock-based payments, and our execution of tax planning strategies. \nRefer to Note 14, “Taxes Based on Income,” to the Consolidated Financial Statements for more information. \nRESULTS OF OPERATIONS BY REPORTABLE SEGMENT \nDuring the fourth quarter of 2024, we modified our segment performance measure to exclude other expense (income), net. These changes align with how our CODM evaluates segment performance and allocates resources. Prior periods have been conformed to the current period presentation. Segment adjusted operating income is defined as income before taxes adjusted for other expense (income), net; interest expense, other non-operating expense (income), net; and other items. \nRefer to Note 15, “Segment and Disaggregated Revenue Information,” to the Consolidated Financial Statements for more information. \nMaterials Group\n(In millions)\n2024\n2023\n2022\nNet sales including intersegment sales\n$\n6,175.8 \n$\n5,968.4 \n$\n6,632.2 \nLess intersegment sales\n(162.8)\n(157.1)\n(137.1)\nNet sales\n$\n6,013.0 \n$\n5,811.3 \n$\n6,495.1 \nSegment adjusted operating income\n(1)\n924.7 \n789.2 \n845.9 \n(1)\n  Segment adjusted operating income excluded charges associated with restructuring actions and related costs in all years, loss on venture investment in 2024, losses from Argentine peso remeasurement and Blue Chip Swap transactions and outcomes of legal matters and settlements, net, in 2024 and 2023, loss on sale of assets in 2023, and gain on venture investment in 2022. These items were included in \"Other expense (income), net.\"\n$\n40.4 \n$\n88.3 \n$\n(13.4)\nNet Sales \nThe factors impacting reported net sales change are shown in the table below. \n2024\n2023\nReported net sales change\n4 \n%\n(11)\n%\nForeign currency translation\n— \n— \nSales change ex. currency\n(1)\n4 \n(10)\nOrganic sales change\n(1)\n4 \n%\n(10)\n%\n(1) \nTotals may not sum due to rounding. \nIn 2024, net sales increased on an organic basis compared to the prior year due to higher volume, partially offset by the impact of raw material deflation-related price reductions. On an organic basis, net sales increased by low single digit rates in North America and Western Europe and a high single digit rate in emerging markets.\nIn 2023, net sales decreased on an organic basis compared to the prior year due to lower volume driven primarily by inventory destocking, partially offset by the impact of pricing actions. On an organic basis, net sales decreased by a low double-digit rate in North America, a high teens rate in Western Europe and a high single digit rate in emerging markets.\nSegment Adjusted Operating Income \nSegment adjusted operating income increased in 2024 compared to the same period in 2023 primarily due to higher volume and benefits from productivity initiatives, including material re-engineering and savings from restructuring actions, net of transition costs, partially offset by higher employee-related costs and the net impact of pricing and raw material input costs.\nSegment adjusted operating income decreased in 2023 compared to the same period in 2022 primarily due to lower volume, partially offset by benefits from productivity initiatives, including temporary cost-saving actions, material re-engineering and savings from restructuring actions, net of transition costs, and the net impact of pricing and raw material input costs.\n27\nTable of Contents\nSolutions Group \n(In millions)\n2024\n2023\n2022\nNet sales including intersegment sales\n$\n2,795.0 \n$\n2,588.5 \n$\n2,581.6 \nLess intersegment sales\n(52.3)\n(35.5)\n(37.4)\nNet sales\n$\n2,742.7 \n$\n2,553.0 \n$\n2,544.2 \nSegment adjusted operating income\n(1)\n289.3 \n252.0 \n310.1 \n(1)\n  Segment adjusted operating income excluded charges associated with restructuring actions, outcomes of legal matters and settlements, net, and transaction and related costs in all years, loss on venture investments in 2024 and 2023, and gain on sales of assets in 2022. These items were included in \"Other expense (income), net.\"\n$\n30.8 \n$\n86.3 \n$\n7.8 \nNet Sales \nThe factors impacting reported net sales change are shown in the table below. \n2024\n2023\nReported net sales change\n7 \n%\n— \n%\nForeign currency translation\n1 \n2 \nSales change ex. currency\n(1)\n8 \n2 \nAcquisitions\n(2)\n(3)\nOrganic sales change\n(1)\n6 \n%\n(1)\n%\n(1)\n Totals may not sum due to rounding. \nIn 2024, on an organic basis, net sales increased by a low single digit rate in high-value categories and a low-double digit rate in the base business compared to the prior year. Company-wide, on an organic basis, sales of intelligent labels increased by a high single digit rate compared to the prior year.\nIn 2023, on an organic basis, net sales increased by a high single digit rate in high-value categories and decreased by a low double-digit rate in the base business compared to the prior year. Company-wide, on an organic basis, sales of intelligent labels increased by a low double-digit rate compared to the prior year.\nSegment Adjusted Operating Income \nSegment adjusted operating income increased in 2024 compared to 2023 primarily due to higher volume and benefits from productivity initiatives, including savings from restructuring actions, net of transition costs, partially offset by higher employee-related costs and growth investments.\nSegment adjusted operating income decreased in 2023 compared to 2022 primarily due to higher employee-related costs, lower volume, growth investments and the impact of unfavorable foreign currency translation, partially offset by benefits from productivity initiatives, including temporary cost-saving actions and savings from restructuring actions, net of transition costs.\n28\nTable of Contents\nFINANCIAL CONDITION \nLiquidity \nOperating Activities \n(In millions)\n2024\n2023\n2022\nNet income\n$\n704.9 \n$\n503.0 \n$\n757.1 \nDepreciation\n197.1 \n187.4 \n177.4 \nAmortization\n115.1 \n111.0 \n113.3 \nProvision for credit losses and sales returns\n47.4 \n49.9 \n50.1 \nStock-based compensation\n28.7 \n22.3 \n47.4 \nDeferred taxes and other non-cash taxes\n(18.5)\n(24.4)\n18.4 \nOther non-cash expense and loss (income and gain), net\n67.2 \n37.1 \n23.5 \nTrade accounts receivable\n(107.3)\n(16.7)\n(22.1)\nInventories\n(90.7)\n111.7 \n(140.7)\nAccounts payable\n106.7 \n(87.6)\n68.2 \nTaxes on income\n40.2 \n(18.7)\n18.9 \nOther assets\n(48.0)\n37.7 \n15.3 \nOther liabilities\n(104.0)\n(86.7)\n(165.8)\nNet cash provided by operating activities\n$\n938.8 \n$\n826.0 \n$\n961.0 \nIn 2024, cash flow provided by operating activities increased compared to 2023 primarily due to higher net income, lower incentive compensation payments and lower tax payments, net of refunds, partially offset by changes in operational working capital and the settlement payment for the Adasa legal matter.\nIn 2023, cash flow provided by operating activities decreased compared to 2022 primarily due to lower net income and higher tax payments, net of refunds, partially offset by changes in operational working capital and lower incentive compensation payments.\nInvesting Activities\n \n(In millions)\n2024\n2023\n2022\nPurchases of property, plant and equipment\n$\n(208.8)\n$\n(265.3)\n$\n(278.1)\nPurchases of software and other deferred charges\n(31.0)\n(19.8)\n(20.4)\nProceeds from company-owned life insurance policies\n— \n48.1 \n— \nPurchases of Argentine Blue Chip Swap securities\n(34.2)\n— \n— \nProceeds from sales of Argentine Blue Chip Swap securities\n24.0 \n— \n— \nProceeds from sales of property, plant and equipment\n.6 \n1.0 \n2.3 \nProceeds from insurance and sales (purchases) of investments, net\n10.1 \n1.9 \n1.9 \nProceeds from sale of venture investment\n— \n— \n1.1 \nPayments for acquisitions, net of cash acquired, and venture investments\n(3.8)\n(224.9)\n(39.5)\nNet cash used in investing activities\n$\n(243.1)\n$\n(459.0)\n$\n(332.7)\n29\nTable of Contents\nPurchases of Property, Plant and Equipment \nIn 2024, in our Solutions Group reportable segment, we primarily invested in buildings and equipment to support growth in certain countries in Asia Pacific, including China and Malaysia, the U.S. and certain countries in Latin America, primarily Mexico; in our Materials Group reportable segment, we primarily invested in buildings and equipment to support growth in the U.S., and certain countries in Europe, primarily France, and Asia Pacific, primarily China. In 2023, in our Solutions Group reportable segment, we primarily invested in buildings and equipment to support growth in certain countries in Asia Pacific, primarily Malaysia, the U.S. and certain countries in Latin America, primarily Mexico; in our Materials Group reportable segment, we primarily invested in buildings and equipment to support growth in the U.S. and certain countries in Europe, primarily France, and Asia Pacific, primarily China. In 2022, in our Solutions Group reportable segment, we primarily invested in buildings and equipment to support growth in certain countries in Asia Pacific, including Malaysia, China and Vietnam, and the U.S.; in our Materials Group reportable segment, we primarily invested in buildings and equipment in the U.S. and certain countries in Europe, primarily France, and Latin America, primarily Brazil.\nPurchases of Software and Other Deferred Charges \nIn 2024, 2023 and 2022, we invested in information technology upgrades worldwide.\nProceeds from Company-Owned Life Insurance Policies\nIn 2023, we utilized approximately $48 million of the cash surrender value available under our company-owned life insurance policies.\nPurchases and Proceeds from Argentine Blue Chip Swap Securities\nIn 2024, we entered into Blue Chip Swap transactions that resulted in losses of approximately $10 million. Refer to Note 16, “Supplemental Financial Information,” to the Consolidated Financial Statements for more information. \nProceeds from Insurance and Sales (Purchases) Investments, net \nIn 2024, we received approximately $8 million of insurance proceeds for losses related to damaged property, plant and equipment.\nPayments for Acquisitions, Net of Cash Acquired, and Venture Investments \nWe paid consideration, net of cash acquired, of approximately $223 million for the 2023 Acquisitions and $30 million for the acquisitions we completed in 2022. We funded the 2023 Acquisitions and the acquisitions we completed in 2022 using cash and commercial paper borrowings. We also made certain venture investments in 2024, 2023 and 2022. \nRefer to Note 2, “Business Acquisitions,” to the Consolidated Financial Statements for more information.\nFinancing Activities \n(In millions)\n2024\n2023\n2022\nNet increase (decrease) in borrowings with maturities of three months or less\n$\n(269.0)\n$\n(36.6)\n$\n34.6 \nAdditional long-term borrowings\n539.2 \n394.9 \n— \nRepayments of long-term debt and finance leases\n(308.1)\n(255.9)\n(6.3)\nDividends paid\n(277.5)\n(256.7)\n(238.9)\nShare repurchases\n(247.5)\n(137.5)\n(379.5)\nNet (tax withholding) proceeds related to stock-based compensation\n(8.4)\n(23.8)\n(25.1)\nOther\n(4.8)\n(1.6)\n— \nNet cash used in financing activities\n$\n(576.1)\n$\n(317.2)\n$\n(615.2)\nBorrowings and Repayment of Debt \nDuring 2024, 2023 and 2022, our commercial paper borrowings funded various activities, including repayments of long-term debt, acquisitions, dividend payments, share repurchases, capital expenditures and other general corporate purposes. \n30\nTable of Contents\nIn November 2024, we issued €500 million of senior notes, due November 4, 2034, which bear an interest rate of 3.750% per year, payable annually in arrears. Our net proceeds from this issuance, after deducting underwriting discounts and offering expenses, were approximately €495 million ($539 million), which we intend to use to repay our €500 million of senior notes maturing in March 2025 and for general corporate purposes.\nIn August 2024, we repaid our $300 million of senior notes at maturity using cash flows from operations and commercial paper borrowings.\nIn March 2023, we issued $400 million of senior notes, due March 15, 2033, which bear an interest rate of 5.750% per year, payable semiannually in arrears. Our net proceeds from this issuance, after deducting underwriting discounts and offering expenses, were $394.9 million, which we used to repay indebtedness under our commercial paper programs and our $250 million of senior notes that matured on April 15, 2023.\nRefer to Note 4, \"Debt\" to the Consolidated Financial Statements for more information. \nDividends Paid \nWe paid dividends per share of $3.45, $3.18 and $2.93 in 2024, 2023 and 2022, respectively. In April 2024, we increased our quarterly dividend rate to $0.88 per share, representing an increase of approximately 9% from our previous quarterly dividend rate of $0.81 per share. In April 2023, we increased our quarterly dividend to $0.81 per share, representing an increase of approximately 8% from our previous dividend rate of $0.75 per share. \nShare Repurchases \nFrom time to time, our Board authorizes the repurchase of shares of our outstanding common stock. Repurchased shares may be reissued under our long-term incentive plan or used for other corporate purposes. In 2024, 2023 and 2022, we repurchased approximately 1.2 million, 0.8 million and 2.2 million shares of our common stock, respectively. \nIn April 2022, our Board authorized the repurchase of shares of our common stock with a fair market value of up to $750 million, excluding any fees, commissions or other expenses related to such purchases and in addition to any amount outstanding under our previous Board authorization. Shares of our common stock in the aggregate amount of $346.9 million remained authorized for repurchase under this Board authorization as of December 28, 2024. Board authorizations remain in effect until shares in the amount authorized thereunder have been repurchased. \nNet (Tax Withholding) Proceeds Related to Stock-Based Compensation \nApproximately 0.1 million stock options were exercised in 2024, resulting in proceeds of approximately $10 million. Refer to Note 12, “Long-Term Incentive Compensation,” to the Consolidated Financial Statements for more information. \nAnalysis of Selected Balance Sheet Accounts \nLong-lived Assets \nProperty, plant and equipment, net, decreased by approximately $39 million to $1.59 billion at year-end 2024, which primarily reflected depreciation expense and the impact of foreign currency translation, partially offset by purchases of property, plant and equipment.\nGoodwill decreased by approximately $37 million to $1.98 billion at year-end 2024, which primarily reflected the impact of foreign currency translation. \nOther intangibles resulting from business acquisitions, net, decreased by approximately $94 million to $755.3 million at year-end 2024, primarily reflecting current year amortization expense.\nRefer to Note 3, “Goodwill and Other Intangibles Resulting from Business Acquisitions,” to the Consolidated Financial Statements for more information. \nOther assets increased by approximately $88 million to $897.3 million at year-end 2024, primarily reflecting higher capitalized implementation costs associated with our cloud computing arrangements and higher operating lease assets.\nLong-term Retirement Benefits and Other Liabilities\nOther long-term retirement benefits and other liabilities decreased by approximately $66 million to $434.6 million at year-end 2024, primarily reflecting the settlement payment for the Adasa legal matter.\nShareholders’ Equity Accounts \nThe balance of our shareholders’ equity increased by approximately $184 million to $2.31 billion at year-end 2024. Refer to Note 11, “Supplemental Equity and Comprehensive Income Information,” to the Consolidated Financial Statements for more information. \n31\nTable of Contents\nImpact of Foreign Currency Translation \n(In millions)\n2024\n2023\nChange in net sales\n$\n(33)\n$\n(58)\nIn 2024, international operations generated approximately 70% of our net sales. Our future results are subject to changes in geopolitical, social and economic conditions in the regions in which we operate and the impact of fluctuations in foreign currency exchange rates. \nThe unfavorable impact of foreign currency translation on net sales in 2024 compared to 2023 was primarily related to sales in China and Brazil, partially offset by the favorable impact of euro-denominated sales. \nEffect of Foreign Currency Transactions \nThe impact on net income from foreign currency transactions is largely mitigated because the costs of our products are generally denominated in the same currencies in which they are sold. In addition, to reduce our income and cash flow exposure to transactions in foreign currencies, we enter into foreign currency exchange forward, option and swap contracts where available and appropriate. Refer to Note 5, “Financial Instruments,” to the Consolidated Financial Statements for more information. \nDuring 2024 and 2023, the Argentine peso devalued significantly compared to the U.S. dollar, resulting in remeasurement losses of approximately $16 million and $30 million, respectively, which was included in \"Other expense (income), net\" in the Consolidated Statements of Income. The 2024 losses included Blue Chip Swap transactions that resulted in losses of approximately $10 million. Refer to Note 16, “Supplemental Financial Information,” to the Consolidated Financial Statements for more information.\nAnalysis of Selected Financial Ratios \nWe utilize the financial ratios discussed below to assess our financial condition and operating performance. We believe this information assists our investors in understanding the factors impacting our cash flow other than net income and capital expenditures. \nOperational Working Capital Ratio \nOperational working capital, as a percentage of annualized current-quarter net sales, is reconciled to working capital below. Our objective is to minimize our investment in operational working capital, as a percentage of annualized current-quarter net sales, to maximize our cash flow and return on investment. Operational working capital, as a percentage of annualized current-quarter net sales, in 2024 was comparable with 2023. Further information regarding the components of operational working capital is provided below. \n(In millions, except percentages)\n2024\n2023\n(A)\nWorking capital\n$\n216.1 \n$\n96.5 \nReconciling items:\nCash and cash equivalents\n(329.1)\n(215.0)\nOther current assets\n(305.3)\n(245.4)\nShort-term borrowings and current portion of long-term debt and finance leases\n592.3 \n622.2 \nCurrent income taxes payable and other current accrued liabilities\n929.6 \n800.2 \n(B)\nOperational working capital\n$\n1,103.6 \n$\n1,058.5 \n(C)\nFourth-quarter net sales, annualized\n$\n8,742.8 \n$\n8,442.0 \nOperational working capital, as a percentage of annualized current-quarter net sales (B) ÷ (C)\n12.6 \n%\n12.5 \n%\nAccounts Receivable Ratio \nThe average number of days sales outstanding was 61 days in both 2024 and 2023, calculated using the accounts receivable balance at year-end divided by the average daily sales in the fourth quarter of 2024 and 2023, respectively. \nInventory Ratio \nAverage inventory turnover was 6.4 in 2024 compared to 6.6 in 2023, calculated using the annualized fourth-quarter cost of products sold in 2024 and 2023, respectively, and divided by the inventory balance at the respective year-end. The decrease in average inventory turnover primarily reflected higher inventory balances, partially offset by the impact of foreign currency translation.\n32\nTable of Contents\nAccounts Payable Ratio \nThe average number of days payable outstanding was 77 days in both 2024 and 2023, calculated using the accounts payable balance at year-end divided by the annualized fourth-quarter cost of products sold in 2024 and 2023, respectively.\nCapital Resources \nCapital resources include cash flows from operations, cash and cash equivalents and debt financing, including access to commercial paper borrowings supported by our revolving credit facility (the \"Revolver\"). We use these resources to fund our operational needs. \nAt year-end 2024, we had cash and cash equivalents of $329.1 million held in accounts at third-party financial institutions in numerous locations throughout the world. At year-end 2024, the majority of our cash and cash equivalents was held by our foreign subsidiaries, primarily in the Asia Pacific region. \nTo meet our U.S. cash requirements, we have several cost-effective liquidity options available. These options include borrowing funds at reasonable rates, including borrowings from our foreign subsidiaries, and repatriating foreign earnings and profits. However, if we were to repatriate foreign earnings and profits, a portion would be subject to cash payments of withholding taxes imposed by foreign tax authorities. Additional U.S. taxes may also result from the impact of foreign currency fluctuations related to these earnings and profits.\nIn June 2024, we entered into a Credit Agreement (the \"Credit Agreement\") related to our Revolver to borrow up to an aggregate of $1.2 billion through its maturity date of June 26, 2029. The Revolver refinanced the prior revolving credit facility under the Fifth Amended and Restated Credit Agreement dated as of February 13, 2020, as amended. Pursuant to the Credit Agreement, the commitments under the Revolver may be increased by up to $600 million, subject to lender approvals and customary requirements. Under certain circumstances, we may request that the commitments under the Revolver be extended for one-year periods in accordance with the terms and conditions of the Credit Agreement. We use the Revolver as a back-up facility for our commercial paper program and for other corporate purposes. \nThe Revolver contains a financial covenant that requires us to maintain a maximum leverage ratio (calculated as a ratio of consolidated debt minus unrestricted cash and cash equivalents in excess of $50 million to consolidated EBITDA as defined in the agreement) of not more than 3.50 to 1.00; provided that, in the event of an acquisition by us that exceeds $250 million, the maximum leverage ratio increases to 4.00 to 1.00 for the fiscal quarter in which the acquisition occurs and the three fiscal quarters immediately following that fiscal quarter. As of December 28, 2024, our ratio was substantially below the maximum ratio allowed by the Revolver. As of December 30, 2023, our ratio was substantially below the maximum rate allowed by our previous revolving credit facility.\nIn addition to the Revolver, we have short-term lines of credit available in various countries of approximately $261 million in the aggregate at December 28, 2024. These lines may be cancelled at any time by us or the issuing banks. Borrowings under our short-term lines of credit were not material as of December 28, 2024 and December 30, 2023.\nWe are exposed to financial market risk resulting from changes in interest and foreign currency exchange rates, and to possible liquidity and credit risks of our counterparties. \nWe currently anticipate using the net proceeds from the €500 million of senior notes we issued in the fourth quarter of 2024, cash flows from operations and commercial paper borrowings to repay €500 million of senior notes, $25 million of medium-term notes and $5 million of medium-term notes maturing in the first, second and third quarters of 2025, respectively.\nCapital from Debt \nThe carrying value of our total debt decreased by approximately $92 million to $3.15 billion at year-end 2024 from year-end 2023, primarily due to the repayment of our $300 million of senior notes that matured in August 2024, a net decrease in commercial paper borrowings and the revaluation of our euro-denominated senior notes, partially offset by our issuance of €500 million of senior notes in November 2024.\nCredit ratings are a significant factor in our ability to raise short- and long-term financing. The credit ratings assigned to our company also impact the interest rates we pay and our access to commercial paper, credit facilities, and other borrowings. A downgrade of our short-term credit ratings could impact our ability to access commercial paper markets. If our access to commercial paper markets were to become limited, the Revolver and our other credit facilities would be available to meet our short-term funding requirements. When determining our credit rating, we believe that rating agencies primarily consider our competitive position, business outlook, consistency of cash flows, debt level and liquidity, geographic footprint and management team. We remain committed to maintaining an investment grade rating. \n33\nTable of Contents\nFair Value of Debt \nThe estimated fair value of our long-term debt is primarily based on the credit spread above U.S. Treasury securities or euro government bond securities, as applicable, on notes with similar rates, credit ratings and remaining maturities. The fair value of short-term borrowings, which includes commercial paper issuances and short-term lines of credit, approximates their carrying value given their short duration. The fair value of our total debt was $3.01 billion at December 28, 2024 and $3.11 billion at December 30, 2023. Fair value amounts were determined based primarily on Level 2 inputs. Refer to Note 1, “Summary of Significant Accounting Policies,” for more information. \nContractual Obligations, Commitments and Off-Balance Sheet Arrangements \nMaterial Cash Requirements at End of Year 2024 \nWe have short- and long-term material cash requirements related to our contractual obligations that arise in the normal course of business. In addition to principal and interest payments on our outstanding debt obligations, our contractual obligations primarily consist of lease payments.\nRefer to Note 4, \"Debt,\" to the Consolidated Financial Statements for a summary of our principal payments for short-term borrowings and long-term debt obligations as of December 28, 2024. Future interest payments for long-term debt as of December 28, 2024 are approximately $106 million in 2025; $97 million in 2026; $97 million in 2027; $97 million in 2028; $73 million in 2029; and $243 million from 2030 through maturity.\nRefer to Note 7, \"Commitments and Leases,\" to the Consolidated Financial Statements for a summary of our lease obligations as of December 28, 2024.\nRefer to Note 6, “Pension and Other Postretirement Benefits,” to the Consolidated Financial Statements for information regarding our defined benefit pension plan contributions and future benefit payments, deferred compensation plan benefit payments and unfunded termination indemnity benefits.\nRefer to Note 12, “Long-term Incentive Compensation,” to the Consolidated Financial Statements for information regarding cash-based awards to employees under one of our long-term incentive compensation plans.\nRefer to Note 14, “Taxes Based on Income,” to the Consolidated Financial Statements for more information regarding our unrecognized tax benefits of approximately $81 million.\nCRITICAL ACCOUNTING ESTIMATES \nThe preparation of financial statements in conformity with GAAP requires our management to make estimates and assumptions for the reporting period and as of the financial statement date. These estimates and assumptions affect our reported amounts of assets and liabilities, disclosure of contingent liabilities, and reported amounts of revenue and expense. Actual results could differ from these estimates. \nCritical accounting estimates are those that are important to our financial condition and results, and which require us to make difficult, subjective and/or complex judgments. Critical accounting estimates cover accounting matters that are inherently uncertain because their future resolution is unknown. We believe our critical accounting estimates include accounting for goodwill, business combinations, pension and postretirement benefits, taxes based on income and long-term incentive compensation. \nGoodwill \nBusiness combinations are accounted for using the acquisition method, with the excess of the acquisition cost over the fair value of acquired net tangible assets and identified intangible assets considered goodwill. As a result, we disclose goodwill separately from other intangible assets. Our reporting units are composed of either a discrete business or an aggregation of businesses with similar economic characteristics. \nWe perform our annual impairment test of goodwill during the fourth quarter. Certain factors may cause us to perform an impairment test prior to the fourth quarter, including significant underperformance of a business relative to expected operating results, significant adverse economic and industry trends, significant decline in our market capitalization for an extended period of time relative to net book value, or a decision to divest a portion of a reporting unit. In performing impairment tests, we have the option to first assess qualitative factors to determine whether it is necessary to perform a quantitative assessment for goodwill impairment. If the qualitative assessment indicates that it is more-likely-than-not that the fair value of a reporting unit is less than its carrying value, we perform a quantitative assessment. \nA quantitative assessment primarily consists of using the present value (discounted cash flow) method to determine the fair value of reporting units with goodwill. We compare the fair value of each reporting unit to its carrying amount, and, to the extent the carrying amount exceeds the unit’s fair value, we recognize an impairment of goodwill for the excess up to the amount of goodwill of that reporting unit.\nIn consultation with outside specialists, we estimate the fair value of our reporting units using various valuation techniques, with the primary technique being a discounted cash flow analysis. A discounted cash flow analysis requires us to make various assumptions, including a reporting unit's forecasted sales, operating margins and growth rates, as well as \n34\nTable of Contents\ndiscount rates. Our assumptions about discount rates are based on the weighted average cost of capital for comparable companies. Our assumptions about sales, operating margins and growth rates are based on our forecasts, business plans, economic projections, anticipated future cash flows, and marketplace data. We also make assumptions for varying perpetual growth rates for periods beyond our long-term business plan period. We base our fair value estimates on projected financial information and assumptions that we believe are reasonable. However, actual future results may differ materially from these estimates and projections. The valuation methodology we use to estimate the fair value of reporting units requires inputs and assumptions that reflect current market conditions, as well as the impact of planned business and operational strategies that require management judgment. The estimated fair value could increase or decrease depending on changes in the inputs and assumptions. \nIn our annual impairment test in the fourth quarter of 2024, the goodwill of all reporting units in our Materials Group and Solutions Group reportable segments were tested utilizing a qualitative assessment. Based on this assessment, we determined that the fair values of these reporting units were more-likely-than-not greater than their respective carrying values. Therefore, the goodwill of our reporting units was not impaired. \nBusiness Combinations\nThe results of acquired businesses are included in our Consolidated Financial Statements from their acquisition date. Assets and liabilities of an acquired business are recorded at their estimated fair values on the acquisition date. We engage third-party valuation specialists to assist us in determining these fair values where necessary. Any excess consideration over the fair value of assets acquired and liabilities assumed is recognized as goodwill. \nThe allocation of purchase price requires management to make significant estimates and assumptions. While we believe our assumptions and estimates are reasonable, they are inherently uncertain and based in part on our experience, market conditions, our projections of future performance, and information obtained from management of the acquired companies. Critical estimates include, but are not limited to, the following: \n•\nFuture revenue and profit margins; \n•\nRoyalty rates; \n•\nDiscount rates; \n•\nCustomer retention rates; \n•\nTechnology migration curves; and \n•\nUseful lives assigned to acquired intangible assets. \nAcquired identifiable finite-lived intangible assets are amortized on a straight-line basis to marketing, general and administrative expense over their respective estimated useful lives. \nPension and Postretirement Benefits \nThe assumptions we use in determining projected benefit obligations and the fair value of plan assets for our defined benefit pension plans and other postretirement benefit plans are evaluated by management in consultation with outside actuaries. In the event that we determine that changes are warranted in the assumptions we use, such as the discount rate, expected long-term rate of return or health care costs, future pension and postretirement benefit expenses could increase or decrease. Due to changes in market conditions or participant population, the actuarial assumptions we use may differ from actual results, which could have a significant impact on our pension and postretirement liabilities and related costs. \nDiscount Rate \nIn consultation with our actuaries, we annually review and determine the discount rates to use in valuing our postretirement obligations. The assumed discount rates for our non-U.S. pension plans reflect market rates for high quality corporate bonds currently available. Our discount rates are determined by evaluating yield curves consisting of large populations of high quality corporate bonds. The projected pension benefit payment streams are then matched with the bond portfolios to determine a rate that reflects the liability duration unique to our pension and postretirement benefit plans. As of December 28, 2024, a 0.25% increase in the discount rates associated with our non-U.S. plans would have decreased our year-end projected benefit obligation by approximately $27 million and would not have a significant impact on expected periodic benefit cost for the coming year. Conversely, a 0.25% decrease in the discount rates associated with our non-U.S. plans would have increased our year-end projected benefit obligation by approximately $27 million and would not have a significant impact on expected periodic benefit cost for the coming year. \nWe use the full yield curve approach to estimate the service and interest cost components of net periodic benefit cost for our pension and other postretirement benefit plans. Using this approach, we apply multiple discount rates from a yield curve composed of the rates of return on several hundred high-quality, fixed income corporate bonds available at the measurement date. We believe this approach provides a more precise measurement of service and interest cost by aligning the timing of plan liability cash flows to the corresponding rates on the yield curve. \n35\nTable of Contents\nLong-term Return on Plan Assets \nWe determine the long-term rate of return assumption for plan assets by reviewing the historical and expected returns of both the equity and fixed income markets, taking into account our asset allocation, the correlation between returns in our asset classes, and our mix of active and passive investments. Additionally, current market conditions, including interest rates, are evaluated and market data is reviewed for reasonableness and appropriateness. An increase or decrease of 0.25% on the long-term return on assets associated with our non-U.S. plans would have decreased or increased our expected periodic benefit cost for the coming year by approximately $2 million. \nTaxes Based on Income \nBecause we are subject to income tax in the U.S. and multiple foreign jurisdictions, judgment is required in evaluating and estimating our worldwide provision for income taxes, accruals for taxes, deferred taxes and tax positions. Our provision for income taxes is determined using the asset and liability approach in accordance with GAAP. Under this approach, deferred tax assets represent amounts available to reduce income taxes payable in future years. These assets arise because of temporary differences between the financial reporting and tax bases of assets and liabilities, as well as from net operating losses and tax credit carryforwards. These amounts are adjusted, as appropriate, to reflect changes in tax rates expected to be in effect when the temporary differences reverse. We evaluate the realizability of these future tax deductions and credits by assessing the period over which recoverability is allowed by law and the adequacy of future expected taxable income from all sources, including reversal of taxable temporary differences, forecasted operating earnings and available tax planning strategies. Our assessment of these sources of income relies heavily on estimates. Our forecasted earnings by jurisdiction are determined by how we operate our business and any changes to our operations may affect our effective tax rate. For example, our future income tax rate could be adversely affected by earnings being lower than anticipated in jurisdictions in which we have significant deferred tax assets that are dependent on such earnings to be realized. We use our historical experience and operating forecasts to evaluate expected future taxable income. To the extent we do not consider it more-likely-than-not that a deferred tax asset will be recovered, a valuation allowance is established in the period we make that determination. \nWe calculate our current and deferred tax provision based on estimates and assumptions that could differ from the actual results reflected in income tax returns filed in subsequent years. Adjustments based on filed returns are recorded when identified. \nTax laws and regulations are complex and subject to different interpretations by taxpayers and governmental taxing authorities. We review our tax positions quarterly and adjust the balances if and as new information becomes available. Significant judgment is required in determining our tax expense and evaluating our tax positions, including evaluating uncertainties. Our estimate of the potential outcome of any uncertain tax issue is subject to our assessment of relevant facts and circumstances existing at the balance sheet date, taking into consideration existing laws, regulations and practices of the governmental taxing authorities exercising jurisdiction over our operations. We recognize and measure our uncertain tax positions following the more-likely-than-not threshold for recognition and measurement for tax positions we take or expect to take on a tax return.\nRefer to Note 14, “Taxes Based on Income,” to the Consolidated Financial Statements for more information. \nLong-Term Incentive Compensation \nValuation of Stock-Based Awards \nWe base our stock-based compensation expense on the fair value of awards, adjusted for estimated forfeitures, amortized on a straight-line basis over the requisite service period for stock options and restricted stock units (“RSUs”). We base compensation expense for performance units (“PUs”) on the fair value of awards, adjusted for estimated forfeitures, and amortized on a straight-line basis as these awards cliff-vest at the end of the requisite performance period. We base compensation expense related to market-leveraged stock units (“MSUs”) on the fair value of awards, adjusted for estimated forfeitures, and amortized on a graded-vesting basis over their respective performance periods. \nCompensation expense for awards with a market condition as a performance objective, which includes PUs and MSUs, is not adjusted if the condition is not met, as long as the requisite service period is met. \nWe determine the fair value of RSUs and the component of PUs that is subject to the achievement of a performance objective based on a financial performance condition based on the fair market value of our common stock as of the date of the grant, adjusted for foregone dividends. Over the performance period of the PUs, the estimated number of shares of our common stock issuable upon vesting is adjusted upward or downward based on the probability of achieving the target performance objectives established for the award. \nWe determine the fair value of stock-based awards that are subject to achievement of performance objectives based on a market condition, which includes MSUs and the other component of PUs, using the Monte-Carlo simulation model, which utilizes multiple input variables, including expected stock price volatility and other assumptions appropriate for determining fair value, to estimate the probability of satisfying the respective target performance objectives established for the award. \n36\nTable of Contents\nForfeiture Rate \nChanges in estimated forfeiture rates are recorded as cumulative adjustments in the period estimates are revised. \nCertain of our assumptions are based on management’s estimates, in consultation with outside specialists. Significant changes in assumptions for future awards and actual forfeiture rates could materially impact our stock-based compensation expense and results of operations. \nValuation of Cash-Based Awards \nCash-based awards consist of long-term incentive units (“LTI Units”) granted to eligible employees. LTI Units are classified as liability awards and remeasured at each quarter-end over the applicable vesting or performance period. In addition to LTI Units with terms and conditions that mirror those of RSUs, we also grant certain employees LTI Units with terms and conditions similar to those of PUs and MSUs. \nRECENT ACCOUNTING REQUIREMENTS \nRefer to Note 1, “Summary of Significant Accounting Policies,” to the Consolidated Financial Statements for this information.",
  "item2": null
}