{
  "item1": "Avery Dennison Corporation (“Avery Dennison” “Company” generally referred “we” “us”) incorporated Delaware 1977 Avery International Corporation, successor corporation California corporation same name incorporated 1946. 1990, merged one subsidiaries into Dennison Manufacturing Company (“Dennison”), result which Dennison became wholly-owned subsidiary connection which changed name Avery Dennison Corporation. can learn more about us visiting website www.averydennison.com. website not intended function hyperlink information website not, nor should considered, part report incorporated reference into report.",
  "item7": "Purchases property, plant equipment Purchases software other deferred charges Proceeds company-owned life insurance policies Purchases Argentine Blue Chip Swap securities Proceeds sales Argentine Blue Chip Swap securities Proceeds sales property, plant equipment Proceeds insurance sales (purchases) investments, net Proceeds sale venture investment Payments acquisitions, net cash acquired, venture investments Net cash used investing activities Purchases Property, Plant Equipment 2024, Solutions Group reportable segment, primarily invested buildings equipment support growth certain countries Asia Pacific, including China Malaysia, U.S. certain countries Latin America, primarily Mexico; Materials Group reportable segment, primarily invested buildings equipment support growth U.S., certain countries Europe, primarily France, Asia Pacific, primarily China. 2023, Solutions Group reportable segment, primarily invested buildings equipment support growth certain countries Asia Pacific, primarily Malaysia, U.S. certain countries Latin America, primarily Mexico; Materials Group reportable segment, primarily invested buildings equipment support growth U.S.",
  "item2": "ITEM 2. MANAGEMENT’S DISCUSSION ANALYSIS FINANCIAL CONDITION RESULTS OPERATIONS Management’s Discussion Analysis Financial Condition Results Operations, MD&A, should read conjunction accompanying unaudited Condensed Consolidated Financial Statements related notes thereto. NON-GAAP FINANCIAL MEASURES report financial results conformity accounting principles generally accepted United States America, GAAP, also communicate investors using certain non-GAAP financial measures. These non-GAAP financial measures not accordance with, nor they substitute superior to, comparable GAAP financial measures."
}