{
  "source_file": "awk-20241231.htm",
  "form_type": "10-K",
  "item1": "ITEM 1.    BUSINESS\nThe Company\nWith a history dating back to 1886, American Water is the largest and most geographically diverse, publicly-traded water and wastewater utility company in the United States, as measured by both operating revenues and population served. A holding company originally incorporated in Delaware in 1936, the Company employs approximately 6,700 professionals who provide drinking water, wastewater and other related services to over 14 million people in 24 states. The Company conducts the majority of its business through regulated utilities that provide water and wastewater services, collectively presented as one reportable segment, referred to as the “Regulated Businesses.” The Company also operates other businesses that provide water and wastewater services to the U.S. government on military installations, as well as municipalities. Individually, these other businesses do not meet the criteria of a reportable segment in accordance with generally accepted accounting principles in the United States (“GAAP”), and are collectively presented throughout this Annual Report on Form 10-K within “Other,” which is consistent with how management assesses the results of these businesses.\nThroughout this Annual Report on Form 10-K, unless the context otherwise requires, references to “we,” “us,” “our,” the “Company,” and “American Water” mean American Water Works Company, Inc. and its subsidiaries, taken together as a whole. References to “parent company” mean American Water Works Company, Inc., without its subsidiaries.\nRegulated Businesses\nThe Company’s primary business involves the ownership of utilities that provide water and wastewater services to residential, commercial, industrial, public authority, fire service and sale for resale customers. The Company’s utilities operate in 14 states in the United States, with 3.5 million active customers in its water and wastewater networks. Services provided by the Company’s utilities are subject to regulation by multiple state utility commissions or other entities engaged in utility regulation, collectively referred to as public utility commissions (“PUCs”). Federal, state and local governments also regulate environmental, health and safety, and water quality and water accountability matters. The Company reports the results of the services provided by its utilities in the Regulated Businesses segment. Operating revenues for the Regulated Businesses were $4,296 million for 2024, $3,920 million for 2023 and $3,505 million for 2022, accounting for 92%, 93% and 92%, respectively, of the Company’s total operating revenues for the same periods.\nPresented in the table below is a geographic summary of the Regulated Businesses’ operating revenues and the number of customers the Company serves, by type of service, for and as of the year ended December 31, 2024:\nOperating Revenues (in millions)\nNumber of Customers (in thousands)\n \nWater (a)\nWastewater\nTotal\n% of Total\nWater\nWastewater\nTotal\n% of Total\nNew Jersey\n$\n990 \n$\n61 \n$\n1,051 \n24.5 \n%\n672 \n70 \n742 \n20.9 \n%\nPennsylvania\n872 \n167 \n1,039 \n24.2 \n%\n688 \n115 \n803 \n22.6 \n%\nMissouri\n487 \n21 \n508 \n11.8 \n%\n485 \n24 \n509 \n14.4 \n%\nIllinois\n359 \n73 \n432 \n10.1 \n%\n300 \n77 \n377 \n10.6 \n%\nCalifornia\n342 \n4 \n346 \n8.1 \n%\n191 \n3 \n194 \n5.5 \n%\nTotal—Top Five States \n(b) \n3,050 \n326 \n3,376 \n78.6 \n%\n2,336 \n289 \n2,625 \n74.0 \n%\nOther \n(c)\n883 \n37 \n920 \n21.4 \n%\n881 \n40 \n921 \n26.0 \n%\nTotal Regulated Businesses\n$\n3,933 \n$\n363 \n$\n4,296 \n100.0 \n%\n3,217 \n329 \n3,546 \n100.0 \n%\n(a)\nIncludes other operating revenues consisting primarily of miscellaneous utility charges, fees and rents.\n(b)\nThe Company’s “Top Five States” are determined based upon operating revenues.\n(c)\nIncludes the Company’s utility operations in the following states: Georgia, Hawaii, Indiana, Iowa, Kentucky, Maryland, Tennessee, Virginia and West Virginia and other revenue attributable collectively to the Regulated Businesses.\nCustomers\nThe Company’s Regulated Businesses have a large and geographically diverse customer base. A customer is defined as a person, business, municipality or any other entity that purchases the Company’s water or wastewater services as of the last business day of a reporting period. One single customer may purchase the Company’s services for use by multiple individuals or businesses. Examples of these customers are homes, apartment complexes, businesses and governmental entities.\n4\nTable of Contents\nThe vast majority of the Company’s regulated water customers are metered, which allows the Company to measure and bill for its customers’ water usage, typically on a monthly basis. The Company employs a variety of methods of customer meter reading to monitor consumption. These methods range from meters with mechanical registers where consumption is manually recorded by meter readers, to meters with electronic registers capable of transmitting consumption data to proximity devices or via radio frequency to mobile or fixed network data collectors. The Company’s wastewater customers are billed either a flat rate or based upon their water consumption.\nResidential customers make up a substantial portion of the Company’s customer base in all of the states in which it operates. The Company also serves (i) commercial customers, such as food and beverage providers, commercial property developers and proprietors, and energy suppliers, (ii) fire service customers, where the Company supplies water through its distribution systems to public fire hydrants for firefighting purposes and to private fire customers for use in fire suppression systems in office buildings and other facilities, (iii) industrial customers, such as large-scale manufacturers, mining and production operations, (iv) public authorities, such as government buildings and other public sector facilities, including schools and universities, and (v) other utilities and community water and wastewater systems in the form of bulk contracts for the supply of water or the treatment of wastewater for their own customers.\nPresented in the table below is a breakout of the Company’s Regulated Businesses’ operating revenue by class of customer, for the years ended December 31, 2024, 2023 and 2022:\n \n2024\n2023\n2022\n(In millions)\nRevenue\nPercentage of Revenue\nRevenue\nPercentage of Revenue\nRevenue\nPercentage of Revenue\nWater services:\nResidential\n$\n2,349 \n55 \n%\n$\n2,143 \n55 \n%\n$\n1,941 \n55 \n%\nCommercial\n885 \n21 \n%\n798 \n20 \n%\n710 \n20 \n%\nFire service\n164 \n4 \n%\n158 \n4 \n%\n147 \n4 \n%\nIndustrial\n184 \n4 \n%\n167 \n4 \n%\n153 \n4 \n%\nPublic and other water (a)\n301 \n7 \n%\n284 \n7 \n%\n267 \n8 \n%\nWastewater\n363 \n8 \n%\n327 \n8 \n%\n242 \n7 \n%\nOther (b)\n50 \n1 \n%\n43 \n2 \n%\n45 \n2 \n%\nTotal\n$\n4,296 \n100 \n%\n$\n3,920 \n100 \n%\n$\n3,505 \n100 \n%\n(a)\nIncludes water revenues from public authorities and other utilities, community water systems under bulk contracts and alternative revenue programs.\n(b)\nIncludes other operating revenues consisting primarily of miscellaneous utility charges, fees and rents.\nPresented in the table below is the number of water and wastewater customers the Company’s Regulated Businesses served by class of customer as of December 31, 2024, 2023 and 2022, which represents approximately 13 million people served as of December 31, 2024:\n \n2024\n2023\n2022\n(In thousands)\nWater\nWastewater\nWater\nWastewater\nWater\nWastewater\nResidential \n2,920 \n307 \n2,893 \n279 \n2,870 \n270 \nCommercial\n222 \n21 \n221 \n18 \n219 \n17 \nFire service\n53 \n— \n52 \n— \n51 \n— \nIndustrial\n4 \n— \n4 \n— \n4 \n— \nPublic and other (a)\n18 \n1 \n18 \n1 \n17 \n1 \nTotal\n3,217 \n329 \n3,188 \n298 \n3,161 \n288 \n(a)\nIncludes public authorities and other utilities and community water and wastewater systems under bulk contracts. Bulk contracts, which are accounted for as a single customer in the table above, generally result in service to multiple customers.\nCustomer growth in the Company’s Regulated Businesses is primarily from (i) adding new customers to its customer base through acquisitions of water and/or wastewater utility systems, (ii) population growth in its authorized service areas, and (iii) sale of water to other water utilities and community water systems.\n5\nTable of Contents\nWater Supply and Wastewater Services\nThe Company’s Regulated Businesses generally own the physical assets used to store, pump, treat and deliver water to its customers and collect, treat, transport and recycle wastewater. Typically, the Company does not own the water. The water the Company treats and delivers is held in public trust and is allocated to the Company through contracts, permits and allocation rights granted by federal and state or multi-state agencies or through the ownership of water rights pursuant to local law. The Company is dependent on defined sources of water supply and obtains its water supply from surface water sources such as reservoirs, lakes, rivers and streams; from groundwater sources, such as wells and aquifers; and water purchased from third-party water suppliers. The level of water treatment the Company applies varies significantly depending upon the quality of the water source and any state requirements that are more restrictive than federal water quality standards. Surface water sources typically require significant treatment, while groundwater sources often require chemical treatment only.\nPresented in the table below are the percentages of water supply by source type for the Company’s Top Five States individually and the Regulated Businesses collectively for the year ended December 31, 2024:\n \nSurface Water\nGround Water\nPurchased Water\nNew Jersey\n74%\n22%\n4%\nPennsylvania\n91%\n7%\n2%\nMissouri\n83%\n16%\n1%\nIllinois\n53%\n35%\n12%\nCalifornia\n—%\n64%\n36%\nRegulated Businesses\n70%\n23%\n7%\nThe Company’s ability to meet the existing and future water demands of its customers depends on an adequate water supply. Drought, governmental restrictions, overuse of sources of water, the protection of threatened species or habitats, contamination or other factors may limit the availability of ground and surface water. The Company employs a variety of measures in an effort to obtain adequate sources of water supply, both in the short-term and over the long-term. The geographic diversity of the Company’s service areas may mitigate some of the economic effects on the water supply associated with weather extremes the Company might encounter in any particular service territory. For example, in any given summer, some areas may experience drier than average weather, which may reduce the amount of source water available, while other areas the Company serves may experience wetter than average weather.\nThe Company evaluates quality, quantity, growth needs and alternate sources of water supply as well as transmission and distribution capacity to provide water service to its customers. Water supply is seasonal in nature and weather conditions can have a pronounced effect on supply. To support the maintenance of adequate water supplies, the Company uses long-term planning processes and maintains contingency plans to minimize the potential impact on service caused by climate variability and a wide range of weather fluctuations. The Company reviews current climate science and global models related to temperature, precipitation and sea level rise on an ongoing basis. Where actionable forecasts are available, the Company will use this information in its comprehensive planning studies and asset management plans. These studies and plans, which are used by the Company to develop its asset management and system reliability strategies, assess the climate risk and resiliency of the Company’s water and wastewater systems over short-, medium- and long-term time horizons, and include evaluations of the availability of water supplies and system capacity against a number of different factors, projections and estimates.\n In connection with supply planning for most surface or groundwater sources, the Company employs models to determine safe yields under different rainfall and drought conditions. Surface and ground water levels are routinely monitored in an effort to predict and mitigate supply capacity deficits through demand management and additional supply development. In California, where the state recently experienced a multi-year drought, the Company utilizes multiple water supply options including numerous ground water wells in multiple aquifers as well as various long-term purchase water agreements with regional water suppliers to optimize supplies while seeking resiliency during dry years. An example of the Company’s use of long-term planning intended to ensure an adequate water supply is Cal Am’s development and support of the Monterey Peninsula Water Supply Project (the “Water Supply Project”) in California. The Water Supply Project includes the construction of a desalination plant, to be owned by Cal Am, and the construction of wells that would supply water to the desalination plant. In addition, the Water Supply Project also includes Cal Am’s purchase of water from a groundwater replenishment project (the “GWR Project”) between Monterey One Water (formerly known as the Monterey Regional Water Pollution Control Agency) and the Monterey Peninsula Water Management District (the “MPWMD”), as well as an expanded aquifer storage and recovery program. The Water Supply Project is intended, among other things, to fulfill obligations of Cal Am to eliminate unauthorized diversions from the Carmel River as required under orders of the California State Water Resources Control Board (the “SWRCB”). For more information, see Item 3—Legal Proceedings—Alternative Water Supply in Lieu of Carmel River Diversions and Note 16—Commitments and Contingencies—Contingencies—Alternative Water Supply in Lieu of Carmel River Diversions, in the Notes to the Consolidated Financial Statements. \n6\nTable of Contents\nWastewater services involve the collection of wastewater from customers’ premises through sewer lines. The wastewater is then transported through a sewer network to a treatment facility, where it is treated to meet required regulatory standards for wastewater before being returned to the environment. The solid waste by-product of the treatment process is disposed of or recycled in accordance with applicable standards and regulations.\nCapital Investment\nThe Company plans to invest between $40 billion and $42 billion over the next 10 years for capital improvements, including acquisitions, to its Regulated Businesses’ water and wastewater infrastructure, largely for pipe replacement and upgrading aging water and wastewater treatment facilities. The Company is proactively improving its pipe renewal rate from a 250-year replacement cycle in 2009 to an approximate 125-year replacement cycle by 2029, which it anticipates will enable the Company to replace nearly 2,000 miles of mains and collection pipes between 2025 and 2029. In addition, from 2025 to 2029, the Company’s capital investment in treatment plants, storage tanks and other key, above-ground facilities is expected to increase, further seeking to address infrastructure renewal, resiliency, water quality, operational efficiency, technology and innovation, and emerging regulatory compliance needs. The Company continues to invest significantly in resiliency projects to address the impacts of climate and weather variability by hardening its assets. \nRegulation and Rate Making\nThe operations of the Company’s Regulated Businesses are generally subject to regulation by PUCs in the states in which they operate, with the primary responsibility of the PUCs being the promotion of the overall public interest by balancing the interest of customers and utility investors. Specific authority might differ from state to state, but in most states, PUCs review and approve rates charged to customers, accounting treatments, long-term financing applications and cost of capital, operation and maintenance (“O&M”) expenses, capital expenditures, taxes, affiliated transactions and relationships, reorganizations, mergers and acquisitions, and dispositions, along with imposing certain penalties or granting certain incentives. Regulatory policies vary from state to state and can change over time. These policies will affect the timing, as well as the extent, of recovery of expenses and the realized return on invested capital.\nPeriodic changes in customer rates generally occur through the filing of a rate case by the utility with the PUC. The timing of rate case filings is typically determined by either periodic requirements in the regulatory jurisdiction or by the utility’s need to increase its revenue requirement to recover capital investment costs, changes in operating revenues, operating costs or other market conditions. The Company attempts to minimize “regulatory lag,” which is the time between the occurrence of an event that triggers a change in the utility’s revenue requirement and the recognition in rates of that change.\nThe Company’s Regulated Businesses support regulatory practices at the PUCs and state legislatures that mitigate the adverse impact of regulatory lag. Presented in the table below are examples of approved regulatory practices:\nRegulatory Practices\nDescription\nStates Allowed\nInfrastructure replacement surcharge mechanisms\nAllows rates to change periodically, outside a general rate case proceeding, to reflect recovery of capital investments made to replace infrastructure necessary to sustain safe and reliable services for the Company’s customers. These mechanisms typically involve periodic filings and reviews to ensure transparency.\nIA, IL, IN, KY, MO, NJ, PA, TN, VA, WV\nFuture test year\nA “test year” is a period used for setting rates, and a future test year describes the first 12 months that new rates are proposed to be effective. The use of a future test year allows current or projected revenues, expenses and capital investments to be collected on a more timely basis.\nCA, HI, IA, IL, IN, KY, PA, TN, VA\nHybrid test year\nA historical test year sets rates using data from a 12-month period that ends prior to a general rate case filing. A hybrid test year allows an update to historical data for “known and measurable” changes that occur subsequent to the historical test year.\nMD, MO, NJ, WV\nUtility plant recovery mechanisms\nAllows recovery of the full return on utility plant costs during the construction period, instead of capitalizing an allowance for funds used during construction (“AFUDC”). In addition, some states allow the utility to seek pre-approval of certain capital projects and associated costs. In this pre-approval process, the PUC may assess the prudency of such projects.\nCA, IL, KY, PA, TN, VA\nExpense mechanisms\nAllows changes in certain operating expenses, which may fluctuate based on conditions beyond the utility’s control, to be recovered outside of a general rate case proceeding or deferred until the next general rate case proceeding.\nCA, HI, IL, IN, MD, MO, NJ, PA, TN, VA\nRevenue stability mechanisms\nAdjusts rates periodically to ensure that a utility recovers the revenues authorized in its general rate case, regardless of sales volume, including recognition of declining sales resulting from reduced consumption, while providing an incentive for customers to use water more efficiently. In California, the ratemaking tool provides partial revenue recovery with a focus on promotion of conservation signals in the pricing structure.\nCA, IL\nConsolidated tariffs\nUse of a unified rate structure for water systems owned and operated by a single utility, which may or may not be physically interconnected. The consolidated tariff pricing structure may be used fully or partially in a state, and is generally used to moderate the price impact of periodic fluctuations in local costs, while lowering administrative costs for customers. Pennsylvania and West Virginia also permit a blending of water and wastewater revenue requirements.\nCA, IA, IL, IN, KY, MD, MO, NJ, PA, VA, WV\nDeferred accounting\nA regulator’s willingness to defer recognition of financial impacts when setting rates for utilities.\nAll\n7\nTable of Contents\nThe Company pursues enhancements to these regulatory practices to facilitate efficient recovery of its costs and capital investments and to continue to provide safe, clean, reliable and affordable services to its customers. The ability to seek regulatory treatment using the regulatory practices described above does not guarantee that the PUCs will accept the Company’s proposal in the context of a particular rate case, and these regulatory practices may reduce, but not eliminate, regulatory lag associated with traditional rate making processes. It is also the Company’s strategy to expand the use of these mechanisms in areas where they may not currently apply and enhance certain mechanisms where they already exist.\nAcquisitions and Strategic Growth\nThe U.S. water and wastewater industries include investor-owned systems as well as municipal systems that are owned and operated by local governments or governmental subdivisions. According to the U.S. Environmental Protection Agency (“EPA”), as of 2024, approximately 84% of the water market is served by municipal systems and, as of 2022, approximately 98% of the country’s wastewater systems are government owned. The EPA also estimates, as of 2024, that there are over 50,000 community water systems and, as of 2022, over 17,000 community wastewater systems in the United States, with approximately 80% of the community water systems serving a population of approximately 3,000 or less.\nA fundamental aspect of the Company’s growth strategy is to pursue acquisitions of water and/or wastewater systems in geographic proximity to areas where the Company operates its Regulated Businesses, see Item 7—Management’s Discussion and Analysis of Financial Condition and Results of Operations for additional information. The Company leverages its collective size and scale to achieve operational efficiencies, prioritize capital investments and utilize employee knowledge to manage acquired systems. Operational efficiencies and investment needs allow the Company to be successful in integrating and managing the systems acquired with its regulated service areas. The Company’s current customer mix of 91% water and 9% wastewater also presents strategic opportunities for wastewater growth and consolidation, allowing the Company to add wastewater customers where it already serves water customers. The Company intends to continue to expand its regulated footprint geographically by acquiring water and wastewater systems in its existing markets and, if appropriate, pursuing acquisition opportunities in certain domestic markets where the Company does not currently operate its Regulated Businesses. Before entering new regulatory jurisdictions (states), the Company will evaluate the regulatory, legislative and business climates for the opportunity to achieve an appropriate rate of return on its investment while maintaining its high standards of services to customers. The Company will also evaluate whether there is a line of sight to grow to sufficient scale in a new regulated market so that it can attain efficiencies and promote customer affordability after entering a new domestic market. Increasingly stringent environmental, health and safety, cybersecurity and water quality and water accountability regulations, the amount of infrastructure in need of significant capital investment, financial challenges and industry legislation are several elements, among others, that may drive more municipalities to consider selling their water and wastewater assets.\nIndustry Legislation\nAmerican Water continues to advocate for constructive policies at the federal level that align with the Company’s strategic priorities and would be beneficial to its customers. These include bi-partisan, bi-cameral legislation to establish a permanent, nationwide, low to moderate income water assistance program, given the expiration of the previous program in 2023; establishing liability exemptions under the Comprehensive Environmental Response, Compensation, and Liability Act of 1980 (“CERCLA”) for certain entities, notably passive receivers of hazardous substances, specifically related to PFAS (such as water and wastewater utilities); and granting investor-owned wastewater utilities the opportunity to access state revolving loan funds. Efforts to advance these legislative priorities will continue in 2025.\nThe Company’s regulated subsidiaries in New Jersey, Indiana and Missouri have versions of water quality or safety accountability acts that require operational or safety and security standards for water and wastewater utilities serving a certain number of customers. In New Jersey, the law imposes requirements in areas such as asset management, water quality reporting, remediation of notices of violation, hydrant and valve maintenance and cybersecurity. In Indiana, the law requires water and wastewater utilities to conduct rate analyses, develop capital asset management plans and conduct cybersecurity and water loss audits. In Missouri, the act requires water and wastewater utilities to create cybersecurity, valve inspection and hydrant inspection programs. \nThe Company’s regulated subsidiaries in California, Illinois, Indiana, Iowa, Kentucky, Maryland, Missouri, New Jersey, Pennsylvania, Tennessee, Virginia and West Virginia have access to utility valuation legislation and regulation for private sector investment in public sector water and wastewater systems. The Company supports full optionality for municipalities, including state legislation that enables the consolidation of the largely fragmented water and wastewater industries through third-party fair market valuations of purchased property. Fair market value assessment of water and wastewater systems is an alternative to the traditional depreciated original cost method of valuation, and allows the Company to offer municipalities a purchase price for their system assets that is reflective of the assets’ fair market value, while providing the Company with increased opportunity to recover the purchase price over the life of the purchased system assets, subject to PUC approval.\n8\nTable of Contents\nConsolidated tariffs use a unified rate structure for systems owned and operated by a single utility, which may or may not be physically interconnected. Consolidated tariff pricing moderates the impact of periodic fluctuations in local costs and promotes a more universal water infrastructure investment in a jurisdiction. As a result, consolidated tariffs can make it easier to incorporate new systems into an existing utility, support economies of scale for even the smallest of systems and prioritize capital needs across the jurisdiction. Overall, the Company believes that consolidated tariffs bring cost-effective, high-quality services to a larger number of customers. Eleven of the Company’s regulated jurisdictions currently have some form of consolidated tariff pricing, including California, Illinois, Indiana, Iowa, Kentucky, Maryland, Missouri, New Jersey, Pennsylvania, Virginia and West Virginia.\nSeasonality\nCustomer demand for the Company’s water service is affected by weather and tends to vary with temperature and amount and frequency of rainfall. Customer demand is generally greater during the warmer months, primarily due to increased outdoor water use, including irrigation systems. As such, the Company typically expects its operating revenues to be the highest in the third quarter of each year. Weather that is warmer and/or drier than average generally increases operating revenues, whereas, weather that is cooler and/or wetter than average generally suppresses customer water demand and can reduce water operating revenues. Two of the Company’s jurisdictions, California and Illinois, have adopted revenue stability mechanisms which permit the Company to collect a portion or all of state PUC-authorized revenue for a given period that is not tied to the volume of water sold during that period, thereby lessening the impact of weather variability. See —Regulation and Rate Making for additional information regarding revenue stability mechanisms.\nAffordability\nAs a water utility, the Company’s water must be safe, reliable and affordable. Through increased efficiency, conservation and affordability support programs and tariffs, on average across the enterprise, the Company achieves water costs that are at or below 1% of median household income. Succeeding in water affordability positively affects the health and safety of the Company’s customers and contributes to the economic prosperity of the communities in which it operates. \nT\nhe Company continues to advocate for federal and state customer affordability support and monitors the number of customers enrolled in its assistance programs to make sure that it is effectively responding to customer needs. In addition, the Company advocates for low income rate discount programs and rate design reform measures in state rate proceedings that will improve the affordability of service specifically for lower income customers.\nCompetition\nThe Company’s Regulated Businesses generally do not face direct competition in their existing markets because (i) the Company operates in those markets pursuant to franchises, charters, certificates of public convenience and necessity or similar authorizations (collectively, “CPCNs”) issued by state PUCs or other authorities, and (ii) the high cost of constructing a new water and wastewater system in an existing market creates a significant barrier to market entry. However, the Company’s Regulated Businesses face competition from governmental agencies, other investor-owned utilities, large industrial customers with the ability to provide their own water supply/treatment process and strategic buyers that are entering new markets and/or making strategic acquisitions. When pursuing acquisitions, the Company’s largest investor-owned competitors, based on a comparison of operating revenues and population served, include Essential Utilities, Inc., American States Water Company and California Water Service Group. From time to time, the Company also faces competition from infrastructure funds, multi-utility companies and others, such as Algonquin Power and Utilities Corp. and Nexus Water Group.\nCondemnation and Eminent Domain\nAll or portions of the Regulated Businesses’ utility assets could be acquired by state, municipal or other government entities through one or more of the following methods: (i) eminent domain (also known as condemnation); (ii) the right of purchase given or reserved by a municipality or political subdivision when the original CPCN was granted; and (iii) the right of purchase given or reserved under the law of the state in which the utility subsidiary was incorporated or from which it received its CPCN. The acquisition consideration related to such a proceeding initiated by a local government may be determined consistent with applicable eminent domain law, or may be negotiated or fixed by appraisers as prescribed by the law of the state or the jurisdiction of the particular CPCN.\nAs such, the Regulated Businesses are periodically subject to condemnation proceedings in the ordinary course of business. For example, the Monterey system assets of Cal Am are the subject of a condemnation lawsuit filed by the MPWMD stemming from a November 2018 public ballot initiative. For more information on this matter, see Item 3—Legal Proceedings—Proposed Acquisition of Monterey System Assets — Potential Condemnation.\n9\nTable of Contents\nFurthermore, the law in certain jurisdictions in which the Regulated Businesses operate provides for eminent domain rights allowing private property owners to file a lawsuit to seek just compensation against a public utility, if a public utility’s infrastructure has been determined to be a substantial cause of damage to that property. In these actions, the plaintiff would not have to prove that the public utility acted negligently. In California, for example, lawsuits have been filed in connection with large-scale natural events such as wildfires. Some of these lawsuits have included allegations that infrastructure of certain utilities triggered the natural event that resulted in damage to the property. In some cases, the PUC has allowed certain costs or losses incurred by the utility to be recovered from customers in rates, but in other cases such recovery in rates has been disallowed. Also, the utility may have obtained insurance that could respond to some or all of such losses, although the utility would be at risk for any losses not ultimately subject to rate or insurance recovery or losses that exceed the limits of such insurance.\nOther\nOther\n primarily includes the MSG business, which \nenters into long-term contracts with the U.S. government to provide water and wastewater services on military installations. The Contract Services Group (“CSG”), also included in Other, has three contracts with municipal customers to operate and manage water and wastewater facilities and provide other related services. Other also includes corporate costs that are not allocated to the Company’s Regulated Businesses, interest income related to the secured seller promissory note from the sale of HOS, income from assets not associated with the Regulated Businesses, eliminations of inter-segment transactions and fair value adjustments related to acquisitions that have not been allocated to the Regulated Businesses segment. The businesses included within\n \nOther are not subject to regulation by state PUCs and the services provided generally do not require significant capital investment by the Company. Operating revenues for Other were $388 million for 2024, $314 million for 2023 and $287 million for 2022, accounting for 8%, 7% and 8%, respectively, of the Company’s total operating revenues for the same periods.\nMilitary Services Group\nMSG operates on 18 military installations under 50-year contracts with the U.S. government as part of its Utilities Privatization Program. The scope of these contracts generally includes the operation and maintenance of the installation’s water and wastewater systems and a capital program focused on asset replacement and, in certain instances, systems expansion. The replacement of assets assumed when a contract is awarded to MSG is completed either through a discrete set of projects executed in the first five years of the contract or through the long-term recapitalization program performed over the life of the contract. Traditionally, both of these programs are funded from the contract fee. At times, new assets are required to support the installation’s mission, and the construction of these assets is funded by the U.S. government as separate modifications or amendments to the contract. The capital for these assets historically has not been funded through the Company’s debt or equity issuances; rather, the Company has used limited working capital for short-term needs under these contracts. The U.S. Army has a requirement that a bidder must offer financing in its proposal for these new capital projects under existing contracts, but the U.S. Army’s implementation of this requirement on existing contracts has limited the need for such financing. However, recent U.S. Army and Navy Utilities Privatization solicitations have included requirements for the successful bidder to finance discrete initial capital projects over either a five- or ten-year period after project completion. Four of MSG’s current contracts require such capital project financing, which the Company is currently addressing through internal sources of liquidity.\nThe contract price for three of MSG’s contracts with the U.S. government is subject to redetermination two years after commencement of operations, and every three years thereafter. Price redetermination is a contract mechanism to periodically adjust the service fee in the next period, to reflect changes in contract obligations and anticipated market conditions. The remaining 15 contracts with the U.S. government are subject to annual price adjustments under a mechanism called “Economic Price Adjustment.” All 18 contracts could be terminated, in whole or in part, prior to the end of the 50-year term for convenience of the U.S. government, or as a result of default or non-performance by the MSG subsidiary performing the contract. In either event, pursuant to termination provisions applicable to all of these contracts, MSG would be entitled to recover allowable costs that it may have incurred under the contract, plus the contract profit margin on incurred costs. MSG’s backlog of revenue associated with its contracts with the U.S. government is approximately $7.4 billion, with an average remaining contract term of 38 years.\nCompetition\nMSG faces competition primarily from American States Water Company.\n10\nTable of Contents\nEnvironmental, Health and Safety, Water Quality and Other Regulation\nThe Company’s water and wastewater operations, including the services provided by its Regulated Businesses, MSG and CSG, are subject to extensive federal, state and local laws and regulations governing the protection of the environment, health and safety, the provision of water and wastewater services, particularly with respect to the quality of water the Company delivers to its customers, and the manner in which it collects, treats, discharges, recycles and disposes of wastewater. In the United States, these regulations are developed under federal legislation including the Safe Drinking Water Act, the Reduction of Lead in Drinking Water Act and the Clean Water Act, and under a variety of applicable state laws. Environmental, health and safety, and water quality regulations are complex and may vary from state to state in those instances where a state has adopted a standard that is more stringent than the federal standard. The Company is also subject to various federal, state, and local laws and regulations governing the storage of hazardous materials, the management and disposal of hazardous and solid wastes, discharges to air and water, the cleanup of contaminated sites, dam safety and other matters relating to the protection of the environment and health and safety. PUCs also set conditions and standards for the water and wastewater services the Company delivers.\nThe Company maintains an environmental program that includes responsible business practices focused on compliance with environmental laws and regulations and the effective use of natural resources, recognizing that drinking water standards have generally, over time, increased in number and become increasingly more stringent. As newer or stricter standards are introduced, the Company’s capital and operating costs needed to comply with them will likely increase. The Company incurs substantial costs associated with compliance with the environmental, health and safety, and water quality standards to which its operations are subject and the Company invests in technology solutions for enhanced detection and monitoring of water quality issues. The Company estimates that it will make capital expenditures of approximately $1.4 billion over the next five years, and $275 million in 2025, to address water quality issues; most of which are focused on compliance with environmental laws and regulations. The Company believes that its operations are materially in compliance with, and in many cases surpass, minimum standards required by applicable environmental laws and regulations.\nThe Company’s operations also involve the use, storage and disposal of hazardous substances and wastes. For example, the Company’s water and wastewater treatment facilities store and use a variety of chemicals, including, for example, gaseous chlorine, that generate waste and require proper handling and disposal under applicable environmental requirements. The Company also could incur remedial costs in connection with any contamination relating to its operations or facilities or its off-site disposal of waste. CERCLA authorizes the EPA, and comparable state laws authorize state environmental authorities, to issue orders and bring enforcement actions to compel responsible parties to investigate and take remedial actions at any site that is determined to present an actual or potential threat to human health or the environment because of an actual or threatened release of one or more hazardous substances. Parties that generated or transported hazardous substances to such sites, as well as current and former owners and operators of such sites, may be deemed liable, without regard to fault, under CERCLA or comparable state laws. Although the Company is not aware of any material cleanup or decontamination obligations, the discovery of contamination or the imposition of such obligations in the future could result in additional costs to the Company. The Company’s facilities and operations are also subject to requirements under the U.S. Occupational Safety and Health Act and inspections thereunder.\nSafe Drinking Water Act\nThe Safe Drinking Water Act and related regulations establish national quality standards for drinking water. The EPA has issued rules governing the levels of numerous, naturally occurring and manufactured chemical and microbial contaminants and radionuclides allowable in drinking water, and continues to propose new rules. These rules also prescribe testing requirements for detecting regulated contaminants, the treatment systems that may be used for removing those contaminants, and other requirements. To date, the EPA has set standards for over 90 contaminants and water quality indicators for drinking water, and there is a process in place to make a regulatory determination on at least five additional compounds every five years.\n The process of developing new drinking water standards is long and complex, but the Company actively participates with the EPA and other water industry groups by sharing research and water quality operational knowledge. See Item 1—Business—Research and Development—Contaminants of Emerging Concern for additional information.\nThe Company is within the EPA’s time frame for compliance with standards and rules developed under the regulation of the Safe Drinking Water Act, which includes sample collection, data analysis, and, in some instances engineering planning and implementation of treatment enhancements. Further, the EPA is actively considering development of a new regulation for perchlorate and updates to the current microbial and disinfection byproduct regulations. The Company does not anticipate that any such regulations, if enacted, will require implementation in 2025.\n11\nTable of Contents\nAlthough it is difficult to project the ultimate costs of complying with the above or other pending or future requirements, the Company expects current cost requirements under the Safe Drinking Water Act and other similar laws to be recoverable through the regulatory process and therefore compliance costs are not expected to have a material impact on its operations or financial condition. In addition, capital expenditures and operating costs to comply with environmental mandates have been traditionally recognized by PUCs as appropriate for inclusion in establishing rates. As a result, the Company expects to recover the operating and capital costs resulting from these pending or future requirements.\nReduction of Potential Lead Exposure in Drinking Water\nOver the last 40 years, there have been numerous federal regulations aimed at reducing the potential exposure of lead from plumbing materials into drinking water. Regulations have addressed both piping system materials and water quality. In 1986, the Safe Drinking Water Act was amended to prohibit the installation of pipe, solder and flux in public water systems and premise plumbing systems that was not lead-free. In 1991, the EPA published the Lead and Copper Rule (“LCR”) to reduce the corrosivity of water and control lead and copper in drinking water. In 2011, the Reduction of Lead in Drinking Water Act was enacted, further limiting the use and introduction into commerce of lead pipes, plumbing fittings for fixtures, solder and flux. Since that time, the EPA has issued several minor revisions (2000, 2004 and 2007) and two major revisions (2021 and 2024) to the LCR.\nWhile these measures have made an impact in reducing potential lead exposure in drinking water in the United States and educating water consumers, the 2021 Lead and Copper Rule Revisions (“LCRR”) and 2024 Lead and Copper Rule Improvements (“LCRI”) rules further advance public health protections by addressing the legacy lead service lines as well as lead plumbing materials, primarily in building plumbing, that still remain in many communities. The 2021 and 2024 revisions are discussed below.\nOn January 15, 2021, the EPA published the final LCRR with a revised final compliance date of October 16, 2024. The LCRR is designed to better identify high levels of lead, improve the reliability of lead tap sampling results, strengthen corrosion control treatment requirements, expand consumer awareness and improve risk communication. On October 30, 2024, the EPA published the LCRI with a “Compliance Date” of November 1, 2027. The LCRI focus includes requirements related to (i) replacing all lead and certain galvanized service lines under a utility’s control by October 30, 2037, 10 years after the Compliance Date; (ii) \nidentifying the materials of all service lines of unknown material;\n (iii) improving tap sampling; (iv) reducing the lead action level; and (v) strengthening protections to reduce exposure to lead. The LCRI also deferred the compliance date of certain requirements of the LCRR to allow for compliance with both new rules.\nThe Infrastructure Investment and Jobs Act was signed into law in November 2021 and provides for up to $15 billion for lead service line replacement through drinking water state revolving funds. The Company will evaluate its service territories and apply for funding for those areas that meet applicable requirements. With regard to future acquisitions, the Company will work with those communities as part of the acquisition process to set lead service lines (“LSLs”) removal goals appropriate for those systems. The prioritization of LSL removal is dependent on several factors, including the Company’s planned water main and service line renewal projects, adjacent projects by municipalities or other utilities, LCRI compliance monitoring results, and cooperation with its customers with respect to replacing the customer-owned portion of the LSL as necessary. In certain cases, these and other factors may result in a shorter or longer time frame for replacement. Because replacing the external LSL in its entirety is advised by several water industry organizations including the U.S. National Drinking Water Advisory Council, the Lead Service Line Replacement Collaborative, and the American Water Works Association, the Company’s preferred approach is to replace the entire external LSL if lead is found on either the Company or customer portion of the service line; full LSL replacement is also consistent with the LCRR and final LCRI. The Lead Service Line Replacement Collaborative is a diverse group of public health, water utility, environmental, labor, consumer and housing organizations from across the country working together to encourage communities to accelerate the full replacement of LSLs through collaborative efforts at the local level.\nAs part of its ongoing water main replacement and service line renewal projects, and in accordance with applicable state regulations and anticipation of updated federal regulation, the Company has been replacing LSLs for many years in accordance with current scientific guidance. Also, the Company utilizes appropriate corrosion control techniques as necessary to comply with current water quality regulatory requirements.\n12\nTable of Contents\nNational Primary Drinking Water Regulations\nOn April 10, 2024, the EPA announced a final National Primary Drinking Water Regulation (“NPDWR”) for six PFAS, including perfluorooctanoic acid (“PFOA”), perfluorooctane sulfonic acid (“PFOS”), perfluorononanoic acid (“PFNA”), hexafluoropropylene oxide dimer acid (“HFPO-DA”, commonly known as “GenX Chemicals”), perfluorohexane sulfonic acid (“PFHxS”), and perfluorobutane sulfonic acid (“PFBS”). The NPDWR for PFAS establishes legally enforceable levels, called Maximum Contaminant Levels (“MCLs”), for PFAS in drinking water. Utilities will be required to complete their initial monitoring for PFAS by 2027, followed by ongoing compliance monitoring. Utilities will be required to comply with the new MCLs by April 2029, implementing solutions to reduce PFAS levels where needed. Beginning in April 2029, utilities that exceed any of the PFAS MCLs will be required to provide notification to the public of the violation.\nThe Company estimates an investment of approximately $1 billion of capital expenditures to install additional treatment facilities in order to comply with the new regulations by April 2029. Additionally, the Company estimates that it will incur annual operating expenses of up to approximately $50 million related to testing and treatment, with the majority of the operating expenses beginning near the April 2029 compliance deadline. The actual level of capital investment and expenses may differ from these estimates and will be dependent upon market dynamics upon implementation of solutions to comply with the NPDWR for PFAS.\nThe Company has entered into a nine-year exclusive contract with a third-party vendor to supply granular activated carbon, equipment and reactivation services to more than 50 of the Company’s treatment sites across 10 states through 2033. The equipment and services provided through the contract will aid the Company in treating drinking water to assist in complying with the NPDWR for PFAS.\nThe Company supports sound policies and compliance with the NPDWR for PFAS by all water utilities, while protecting customers and communities from the costly burden of monitoring and mitigating PFAS contamination in water systems. The Company continues to advocate for policies that hold polluters accountable and is participating in the multi-district litigation and other lawsuits filed against certain PFAS manufacturers seeking damages and reimbursement of costs incurred and continuing to be incurred to address contamination of public water supply systems by PFAS. For more information on the PFAS multi-district litigation, see Item 3—Legal Proceedings—PFAS Multi-District Litigation.\nOn April 19, 2024, the EPA issued a final rule to designate PFOA and PFOS as hazardous substances under CERCLA. The Company, along with a coalition of other water and wastewater organizations, is actively advocating for and supporting bipartisan legislation that would provide PFAS liability protections under CERCLA for water and wastewater systems, as passive receivers of PFAS, and to hold polluters, and not the public or customers, accountable for PFAS-related liability.\nClean Water Act\nThe Clean Water Act regulates discharges from drinking water and wastewater treatment facilities into lakes, rivers, streams and groundwater. In addition to requirements applicable to the Company’s wastewater collection systems, its operations require discharge permits under the National Pollutant Discharge Elimination System (“NPDES”) permit program established under the Clean Water Act, which must be renewed every five years. Pursuant to the NPDES permit program, the EPA and implementing states set maximum discharge limits for wastewater effluents and overflows from wastewater collection systems. Discharges that exceed the limits specified under NPDES permits can lead to the imposition of fines and penalties, and persistent non-compliance could lead to significant fines and penalties and other compliance costs. In addition, the difficulty of obtaining and complying with NPDES permits, and renewing expiring permits, may impose time and cost burdens on the Company’s operations. From time to time, discharge violations occur at the Company’s facilities, some of which result in fines. The Company does not expect any such violations or fines to have a material impact on its results of operations or financial condition. The EPA has identified wastewater discharge permitting and permits for the application of biosolids, or sewage sludge, containing PFAS as areas of focus in its PFAS Strategic Roadmap. Individual states may also take action in these areas. As indicated previously, capital expenditures and operating costs to comply with environmental mandates have been traditionally recognized by PUCs as appropriate for inclusion in establishing rates. As a result, the Company expects to recover the operating and capital costs resulting from any new requirements in these areas.\n13\nTable of Contents\nResearch and Development\nThe Company’s Research and Development Program\nThe Company maintains an industry-leading research and development (“R&D”) program that is designed to enhance its services, support its compliance activities, improve service quality and operational effectiveness, and provide environmental leadership. For more than four decades from its inception, American Water’s R&D program has evolved into an industry-leading effort and has achieved numerous advancements in the science of drinking water, wastewater, and desalination. Through laboratory and industry resources and the team’s expertise, efforts are focused on contaminants of emerging concern, including but not limited to PFAS, Legionella, cyanotoxin-forming algal blooms, a variety of pathogens (for example, Cryptosporidium, Giardia, viruses, and various bacteria), microbial indicators and disinfection byproducts. The Company’s R&D personnel are located at the Company’s corporate headquarters and at two laboratory testing facilities in New Jersey and Illinois, the latter housing its quality control and testing laboratory, which supports the Company’s R&D activities through testing and analysis.\nThe Company continues to leverage its expertise and collaborates with the EPA and state agencies to help establish effective environmental, health and safety, and water quality standards and regulations. This relationship includes sharing of the Company’s research, such as its treatment and distribution system optimization research and its national water quality monitoring data. The Company’s engagement with the EPA provides it with early insight into emerging regulatory issues and initiatives, thereby allowing the Company to anticipate and to accommodate its future compliance requirements. The Company also frequently engages with the Centers for Disease Control and Prevention, other state environmental agencies, and national and international water research foundations. The Company believes that continued R&D activities are critical for providing safe, clean, reliable and affordable services, as well as maintaining its leadership position in the industry, which provides the Company with a competitive advantage as it seeks business and operational growth.\nContaminants of Emerging Concern\nContaminants of emerging concern include numerous chemicals such as PFAS, pharmaceuticals, personal care products, pesticides, herbicides, antibiotic resistant bacteria, antibiotic resistant genes, endocrine disrupting compounds, microplastics and industrial chemicals, as well as certain naturally occurring microbes, such as bacteria, viruses and parasites, which may be detected in drinking water supplies, for which the risk to the public’s health is not fully understood and/or has not been assessed. Technological advances have only recently made it possible to detect many of these contaminants at trace levels. The ability to detect contaminants at trace levels contributes to setting improved water quality goals.\nThe Chemicals Abstract Service Registry contains over 219 million registered chemicals, with an estimated 1,400 species of disease-causing microbes that can affect humans. The Company is continually investigating new substances and contaminants, employing a team of scientists, engineers and public health professionals to identify threats to its water supply, to act on emerging regulations and new health advisories, and to evaluate the benefits of alternative or advanced treatment technologies. The Company utilizes water quality testing equipment and implements new and emerging technologies to help detect potential water supply contamination issues. Examples of the Company’s efforts include:\n•\nmonitoring impacts of environmental pathogen loads and removal through wastewater systems;\n•\ncharacterizing factors that contribute to the formation of potentially carcinogenic disinfection by-products to define best practices for their mitigation;\n•\nadvancing the science on holistic management strategies to improve distribution system water quality further;\n•\nusing its research findings to communicate information to its customers regarding potential actions to limit occurrences of Legionella in their buildings; in this regard, the Centers for Disease Control and Prevention statistics indicate that water-associated disease from Legionella is on the rise, with exposure typically associated with customer-owned plumbing systems in large buildings;\n•\ndefining a framework to support management or possible future regulation of opportunistic pathogens;\n•\ndeveloping expanded monitoring methods for short-chain and fluorinated replacement PFAS;\n•\nsystematically investigating PFAS removal from a variety of water matrices using established and emerging treatment technologies; \n•\nleading a PFAS risk communication strategy for the water sector and sharing utility perspectives with external stakeholders through regional, national and international conferences;\n•\nusing innovative technologies (e.g., satellite imagery) for early detection and response to algal blooms to manage public health impacts and prevent taste and odor events before cyanotoxins get into the water treatment plant;\n14\nTable of Contents\n•\nmonitoring of taste and odor issues that impact customer satisfaction using expanded analytical methods to detect compounds, and evaluating and recommending treatment practices;\n•\nimplementing water source assessment tools, including sensors and data analytics, to evaluate and track chemical storage and aid in the identification of source water contamination events;\n•\ndeveloping methodology and advanced measurement techniques for contaminants of emerging concern to investigate transport, occurrence and treatment; and\n•\nimplementing activated carbon, biofiltration and ion exchange treatment to seek to control contaminants of emerging concern.\nService Company and Security\nAmerican Water Works Service Company, Inc. (“Service Company”) is a wholly owned subsidiary of the Company that provides support and operational services to the Company and its affiliates. These services are predominantly provided to the Company’s Regulated Businesses under contracts that have been approved by PUCs, where necessary, and are also provided to the MSG and CSG businesses as requested or may otherwise be necessary. Services provided by Service Company may include accounting and finance, administration, business development, communications, compliance, education and training, engineering, environmental, health and safety, human resources, information systems, internal audit, investor relations, legal and governance, operations, procurement, R&D, rates and regulatory support, security, risk management and insurance, treasury, and water quality. Service Company also provides customer support to the Company’s Regulated Businesses, which includes call handling, billing, a major accounts program and other related services. Services are provided by Service Company at cost, enabling the Company’s operating subsidiaries to fulfill their responsibilities in a cost-effective manner, while providing them access to in-depth, functional expertise.\nThe Company’s security team, through Service Company, provides oversight and policy guidance on physical, cyber and information security, as well as business continuity, throughout the Company’s operations. The security team is responsible for designing, implementing, monitoring and supporting effective physical and technical security controls for the Company’s physical assets, business systems and operational technologies, as well as for the Company’s executive management and other employees. Risk assessments are conducted periodically to evaluate the effectiveness of existing security controls and serve as the basis for additional safeguards, security controls and measures. For additional information concerning this team and the Company’s cybersecurity program, see Item 1C—Cybersecurity.\nSustainability\nThe Company considers environmental, social responsibility and governance principles fundamental to its corporate sustainability strategy and values. Integration of these principles into the Company’s daily operations emphasizes its belief that “how” a company operates is just as important as “what” a company does. Delivering safe, clean, reliable and affordable water services to customers and treating wastewater has been fundamental to the Company’s business for decades. The Company has an opportunity to make a positive, sustainable impact in thousands of communities by serving them with skilled employees and maintaining the governance and diligence to meet or exceed service expectations.\nDemonstrated Leadership\nThe Company’s values and actions have achieved recognitions for demonstrating its leadership in several areas related to trust, responsibility, sustainability and support of its communities, customers and employees. Among others, these include the following: \n•\nrecognized as one of the \nForbes\n 2025 Most Trusted Companies in America, in addition to being ranked first in the utilities industry category on \nForbes\n America’s Best Large Employers List for 2024;\n•\nrecognized on \nNewsweek\n’s America’s Most Responsible Companies 2025 List;\n•\nranked on \nBarron\n’s 100 Most Sustainable U.S. Companies 2024 List; and\n•\nnamed one of America’s Most JUST companies by JUST Capital and CNBC for its continued commitment to employees, customers, communities and shareholders.\n15\nTable of Contents\nOversight\nManagement Oversight\nThe Company has adopted a cross-functional approach for developing and implementing its sustainability strategy, principles and reporting. The Company’s management function around sustainability involves the direct involvement and participation by a number of its business units, including without limitation, its executive leadership team, as well as environmental, health and safety, human resources, legal, finance, accounting and investor relations. In addition, the Company has developed a steering committee that reports to the Chief Operating Officer and is led by the Director of Sustainability. The committee is designed to foster sustainability governance, strategic planning, performance management and increased visibility of key goals and metrics disclosed through various channels.\nBoard of Directors Oversight\nThe Board of Directors oversees the Company’s strategy and performance related to sustainability through its four standing committees:\n•\nThe Safety, Environmental, Technology and Operations Committee (the “SETO Committee”) has oversight and responsibility with respect to, among other things: water quality and emerging contaminants; operational matters and functions; environmental and climate-related matters; and physical security and cybersecurity\n.\n•\nThe Audit, Finance and Risk Committee has oversight and responsibility with respect to, among other things: the Company’s risk assessment and enterprise risk management; the Company’s financial statements and accounting; the Company’s independent auditor; internal audit and controls; and ethics and compliance matters\n.\n•\nThe Executive Development and Compensation Committee (“ED&CC”) oversees, among other things: the Company’s human capital management; culture and related engagement with employees; and executive development, succession and compensation.\n•\nThe Nominating/Corporate Governance Committee (the “Nominating Committee”) has oversight and responsibility with respect to, among other things: corporate governance; Board and committee membership, leadership and composition; director independence, nominations and succession; and director education.\nReporting, Disclosures and Transparency\nInformation on the performance and management of the Company’s key metrics can be found on the Company’s Investor Relations website at \nhttps://ir.amwater.com/sustainability\n. The Company also discloses on its website its Political Contribution Policy, and, on an annual basis, information related to political contributions, certain payments to tax-exempt organizations and trade associations (including Section 501(c)(4) organizations), and lobbying expenditures. \nHuman Capital Resources\nOverview \nAmerican Water is committed to supporting a high performing workforce. The Company seeks to attract and retain employees who share its purpose and values and understand the needs of the communities they serve. The Company demonstrates this commitment to its employees through its values of safety first; trust, dignity and respect; one team; environmental leadership; and high performance. American Water believes that investing time, energy and resources in its workforce generates new ideas, continuous improvement and high-quality and reliable service for its customers and communities.\nSafety First\nSafety is a core value at American Water and a critical component of its operational focus. The Company’s goal is to achieve zero incidents, injuries and fatalities for its employees and contractors. \n16\nTable of Contents\nAmerican Water believes all employees and contractors deserve to return home from work in the same, or better, condition than when they arrived. The Company’s commitment to employee health and safety includes physical safety, emotional safety and overall well-being. To support its commitment to safety, the Company’s employees completed approximately 126,000 hours of safety training, including physical security and cybersecurity, in 2024. Additionally, the Company focuses on proactive safety programs through collaboration with employees at all levels of the organization. Employees are empowered to demonstrate safety leadership by utilizing a number of safety procedures embedded in the Company’s culture, such as the use of (i) daily and pre-meeting safety messages, (ii) “Stop Work Authority” (the power to stop working immediately and mitigate a hazard whenever an employee believes a task is unsafe) and (iii) pre-job briefings to proactively identify hazards that may be encountered. Notwithstanding the Company’s commitment to a hazard free workplace, even when employees implement all appropriate and effective safety measures and precautions, accidents, injuries and even fatalities can and do occur. In 2024, a third-party vehicle entered a secure work zone striking four Company employees, due to no fault of its employees, which resulted in several serious injuries and one employee fatality. Additionally, in January 2025, a Company employee was fatally injured when struck by a train. For 2024, the Company had an OSHA Recordable Incident Rate (“ORIR”) of 0.40 (25 recordable injuries, and does not include the fatality or injuries, which were determined to be not preventable), which reflects a 54% decrease in recordable injuries compared to 2023, when the ORIR was 0.86 (54 injuries). Also, the number of Days Away Restricted or Transferred (“DART”) injuries decreased by 73% compared to 2023, primarily due to a decrease in strain, sprain and tear injuries, as well as a reduction in slip, trip and fall injuries. For 2024, the Company had a DART rate of 0.14 (9 injuries), compared to 0.52 (33 injuries) in 2023.\nTalent Attraction, Retention and Development\nThe Company’s talent and retention strategy is aimed at building and maintaining a high performing and engaged workforce across all levels of the business. The Company’s performance depends on a highly skilled workforce with the requisite experience in areas including engineering, regulatory, water quality, finance and operations, in order to deliver safe, clean and reliable water and wastewater services to customers. The Company leverages various recruiting channels and partnerships as well as its employer brand to access a broad pool of talent and to hire what the Company believes are the most qualified candidates. In 2024, the Company filled approximately 1,000 positions, 67% of which with external candidates and 33% with internal candidates.\nThe Company has created and implemented programs aimed at developing and retaining talent. The Company collaborates with business leaders to identify the essential behaviors and competencies needed for safe and high performing operations, as well as to achieve its short and long-term business goals. Through the Company’s workforce planning process, the Company evaluates key positions across the organization, identifies potential talent risks, and develops action plans to mitigate those risks. Additionally, the Company has created and implemented programs aimed at attracting, motivating, developing and retaining talent. These programs promote a culture of learning where employees are encouraged to continuously enhance their skills and knowledge through on-the-job experiences, social learning and formal learning opportunities. By committing to achieve 25 hours of learning annually, employees develop skills for their ongoing professional growth. Approximately 84% of active employees hired before October 1, 2024, have completed at least 25 hours of learning, resulting in approximately 262,000 hours of total learning completed during the year.\nDeveloping talent to provide a pathway to executive leadership is a critical priority for the Company. During 2024, the Company enhanced its succession planning process by increasing the number of business impact roles covered by a succession plan. These succession plans support the Company’s business continuity plans and goals, through the identification and development of current and future leaders, and promote employee retention, as well as the Company’s employee culture and talent development priorities.\nIn addition to succession planning for executive and senior leadership roles, during 2024, the Company conducted local and enterprise-wide talent reviews, identifying top and emerging talent with a focus on strengths, gaps and development needs against the critical skills needed for certain roles. Through these talent review processes, business leaders identified a pool of high-potential employees to allow the Company to support their career goals and aspirations, and to promote more effective employee experience and talent retention efforts. The Company also utilizes annual six-month mentoring programs designed to accelerate emerging leaders’ abilities to demonstrate leadership capabilities and relationships, with the guidance of an experienced executive mentor.\nTotal Rewards\nIn order to attract, retain and motivate a skilled and high-performing workforce, American Water provides a comprehensive and highly competitive Total Rewards program, including base pay, Annual Performance Plan (“APP”) for all employees, long-term performance plan compensation for certain leadership positions, and a wide range of benefits consisting of, among others, medical, prescription, dental, vision, life and disability insurance coverage, a retirement savings plan, an employee stock purchase plan, educational assistance, paid time off through holidays and vacation and sick time. The Company’s Total Rewards offerings also include a health and wellness program, paid family leave benefit and a menu of additional voluntary benefits.\n17\nTable of Contents\nAll the Company’s employees, including those who are union-represented, participate in the APP to promote the alignment of performance-based compensation with the achievement of the Company’s short-term performance goals. In addition, the Company regularly reviews its success in achieving fair compensation practices, whereby pay decisions would be based on the responsibilities, talents and skills of its employees, rather than unrelated factors such as gender, race or ethnicity.\nAll employees who average 30 hours or more per week are eligible for full-time benefits. Approximately 89% of all benefit eligible employees are enrolled in the Company’s healthcare benefits. Full-time employees pay approximately 16% of the total premium cost of medical, dental and vision coverage. The Company’s medical benefits include, among others, coverage for applied behavior analysis, autism treatment, transgender service, hearing aids and fertility assistance.\nTrust, Dignity and Respect\nIn 2024, the Company launched the Catalyst for Change framework in support of its values of trust, dignity and respect. The pillar areas of commitment, consistency, clarity, courage and conviction, allow employees to work collectively to build the desired culture. At all levels, the Company strives to understand, value and provide opportunities to each employee, and to foster an environment where all employees are celebrated regardless of their background or life experiences. To achieve the desired state, all leaders are expected to model those behaviors that are consistent with the Catalyst for Change framework.\nThe Company believes that employees are at their best when they can bring their authentic selves to work every day. This belief is the central component of the Company’s “Beautifully Different” philosophy, which recognizes, embraces and celebrates the uniqueness of its employees. The Company also believes that having employees with different ideas, viewpoints, experiences and backgrounds improves its ability to serve its customers. To this end, the Company is committed to attracting and retaining a workforce that understands the needs of the communities in which it serves.\nEmployee Experience \nThe Company has established its weCARE employee value proposition that focuses on employee experience as an influencer of an employee’s opinions and emotional response about the Company as an employer. weCARE is composed of five elements — deeper connections, personal growth, shared purpose, flexibility, and well-being. weCARE represents the Company’s commitment to valuing its employees and building a safe, healthy and inclusive culture where employees know their value and are appreciated for their talents and commitment to supporting the Company’s success. The Company is also committed to improving the employee experience by listening to employees through focus group discussions and employee surveys, among other tools. In 2024, the Company administered two pulse surveys, seeking feedback on employee experience, which had an overall participation rate of 68%.\nWorkforce Data\nAs of December 31, 2024, the Company had approximately 6,700 employees. For 2024, the Company’s annualized employee turnover rate, which the Company defines as the ratio of the number of separated employees to the 12-month average headcount during 2024, was 10.5%, down from 11.5% in 2023. American Water seeks to reduce regrettable employee turnover by assessing the effectiveness of weCARE and through its efforts to foster the Company’s employee experience.\nAs of December 31, 2024, approximately 46% of the Company’s workforce was represented under 75 collective bargaining agreements with 14 different unions. In 2024, the Company renegotiated 26 collective bargaining agreements that were set to expire during the year. During 2025, 25 of the Company’s collective bargaining agreements will expire in accordance with their terms and the Company expects to be able to negotiate these agreements during the year. In addition, the Company’s national benefits agreement, which expires on July 31, 2028, covers approximately 3,000 of the Company’s union-represented employees and their families and provides them with healthcare and other benefits. The Company also collaborates with unions on topics such as safety, customer, technology and employee benefits in forums such as the Joint Healthcare Committee, National Safety Council, Tools Committee and local Labor-Management Committees. The Company continues to work with several local labor unions and the Federal Mediation and Conciliation Service to host discussions among management and union leaders with the goal of supporting and enhancing constructive relationships with these unions.\nBoard Oversight\nThe ED&CC of the Board of Directors establishes and reviews the Company’s overall compensation philosophy and oversees the compensation and benefits plans and programs for its executive officers. The ED&CC oversees the process of planning for executive officer succession. The ED&CC’s charter requires that it oversee the Company’s human capital management, culture and related engagement activities. Further, the ED&CC’s charter requires that the ED&CC have responsibility for reviewing and assessing, at least annually, the Company’s organizational and leadership development plans and programs, and its programs designed to identify, attract and retain high-potential employees.\n18\nTable of Contents\nInformation About Our Executive Officers\nPresented in the table below are the name, age, offices held and business experience for each of the Company’s executive officers, as of February 19, 2025:\nName\nAge\nOffice and Experience\nM. Susan Hardwick\n62\nChief Executive Officer. \nMs. Hardwick served as President and Chief Executive Officer of the Company from February 2, 2022, to August 1, 2024, and has served as Chief Executive Officer of the Company since August 1, 2024. She joined the Company in June 2019 as the Company’s Executive Vice President—Finance and served as the Company’s Chief Financial Officer from July 2019 until May 16, 2022. From December 7, 2021 until January 31, 2022, Ms. Hardwick also served as Interim Chief Executive Officer. Prior to joining the Company, Ms. Hardwick served as the Executive Vice President and Chief Financial Officer of Vectren Corporation (“Vectren”), which was sold to CenterPoint Energy, Inc., an electric and natural gas utility (“CenterPoint”), on February 1, 2019. Ms. Hardwick joined Vectren in January 2000 and served in a variety of positions, including: Vice President, Controller and Assistant Treasurer; Senior Vice President, Finance; Senior Vice President, Chief Financial Officer; and Executive Vice President and Chief Financial Officer. Prior to joining Vectren, Ms. Hardwick was Assistant Corporate Comptroller at Cinergy Corp. She began her career with Arthur Andersen & Co. Ms. Hardwick is a Certified Public Accountant. Since September 2020, Ms. Hardwick has served on the Board of Directors of New Jersey Resources Corporation, a diversified energy services company, where she is currently serving a three-year term expiring in 2027, and since January 1, 2021, she has served as a member of its Audit Committee.\nJohn C. Griffith\n58\nPresident. \nMr. Griffith has served as the Company’s President since August 1, 2024, with responsibility for the day-to-day operations of the Company.  He joined the Company on May 16, 2022, as its Executive Vice President and Chief Financial Officer. Prior to joining the Company, since 2014, Mr. Griffith served as Managing Director, Mergers and Acquisitions, for Bank of America Securities’ Global Regulated Utilities and Renewable Energy practice. Prior to joining Bank of America Securities, from 2008 to 2014, Mr. Griffith served as the Chief Executive Officer of HighWave Energy, a renewable fuels start-up company, and from 1995 to 2008, he served in various capacities of increasing responsibility with Merrill Lynch & Co.\nDavid M. Bowler\n46\nExecutive Vice President and Chief Financial Officer. \nMr. Bowler has served as the Company’s Executive Vice President and Chief Financial Officer since August 1, 2024, and as Senior Vice President, Deputy Chief Financial Officer and Treasurer from October 31, 2022 to August 1, 2024. Mr. Bowler joined the Company in May 2020 as its Senior Vice President of Corporate Tax, Accounting Technology and Regulatory Services, and served as Senior Vice President of Planning, Regulatory and Financial Services from July 2021 to November 2022. Prior to joining the Company, Mr. Bowler served as Director of Finance and Accounting Integration at CenterPoint from February 2019 to April 2020, and in a number of roles of increasing responsibility, most recently as Vice President, Controller and Assistant Treasurer at Vectren from January 2007 to February 2019. Mr. Bowler is a Certified Public Accountant.\nMaureen Duffy\n55\nExecutive Vice President, Communications and External Affairs\n. Ms. Duffy has served as the Company’s Executive Vice President, Communications and External Affairs since October 29, 2024 and has had over 25 years of employment with the Company.  Ms. Duffy served as the Company’s Senior Vice President, Communications and External Affairs from January 2020 until October 29, 2024, as Vice President, Corporate Communications and Federal Affairs from May 2017 through December 2019, and as Vice President, Corporate Communications and External Affairs from September 2011 to May 2017.  She also has held various positions with the Company’s New Jersey subsidiary, including Government Affairs/Media Specialist, Communications Manager and Director of Corporate Communications. Prior to joining American Water, Ms. Duffy reported and produced news for WNJN/WNET-TV.\nMelanie M. Kennedy\n51\nExecutive Vice President, Chief Human Resources Officer. \nMs. Kennedy has served as the Company’s Executive Vice President, Chief Human Resources Officer since December 2021, and as Senior Vice President, Chief Human Resources Officer from December 2020 to December 2021. Prior to that, she served as the Company’s Senior Vice President, Human Resources from March 2017 to December 2020. From August 2014 through February 2017, Ms. Kennedy served as the Company’s Vice President, Human Resources, and from August 2012 to August 2014, she served as Director, Human Resources in the Company’s Northeast Division. Ms. Kennedy initially joined the Company in 2007, and before that time, she practiced law for nine years.\n19\nTable of Contents\nName\nAge\nOffice and Experience\nStacy A. Mitchell\n49\nExecutive Vice President and General Counsel. \nMs. Mitchell has served as the Company’s Executive Vice President and General Counsel since June 5, 2024. Prior to that, she served as the Company’s Senior Vice President and Deputy General Counsel beginning in February 2023.  She joined the Company in August 2019 as Vice President and Chief Regulatory Counsel.  Prior to joining the Company, Ms. Mitchell served as the Vice President of Rates and Regulatory Affairs at South Jersey Industries, Inc. and its gas utility subsidiary. Prior to that time, she practiced litigation, regulatory and environmental law in private practice for 15 years. Ms. Mitchell serves as a member of the American Water Works Association’s Water Utility Council, and as its Treasurer.  \nCheryl Norton\n60\nExecutive Vice President and Chief Operating Officer.\n Ms. Norton has 36 years of employment with the Company serving in various roles, including operational leadership, environmental stewardship, laboratory management, and research. She has been serving as the Company’s Executive Vice President and Chief Operating Officer since March 2021 and served as its Senior Vice President, Chief Environmental Officer from March 2020 to March 2021. She was also the Company’s Senior Vice President, Eastern Division and President of its New Jersey subsidiary from March 2019 to March 2021. Prior to that, Ms. Norton served as President of the Company’s Missouri subsidiary from November 2015 to March 2019, and President of its Kentucky subsidiary from January 2011 until November 2015. In addition, Ms. Norton also serves as a member of the Board of Directors of the Water Research Foundation.\nEach executive officer is elected annually by the Board of Directors and serves until their respective successor has been elected and qualified or their earlier death, resignation or removal.\nAvailable Information\nThe Company maintains a website at \nhttps://amwater.com,\n an Investor Relations website at \nhttps://ir.amwater.com \nand a Sustainability website at \nhttps://ir.amwater.com/sustainability\n. Information contained on the Company’s websites, including its Sustainability Report and other reports or documents, shall not be deemed incorporated into, or to be a part of, this report, and any website references included herein are not intended to be made through active hyperlinks. The Company recognizes its websites as key channels of distribution to reach public investors and as a means of disclosing information to comply with SEC Regulation FD.\nThe Company is subject to the reporting requirements of the Exchange Act. The Company files or furnishes annual, quarterly and current reports, proxy statements and other information with the SEC. Readers may obtain a copy of the Company’s Annual Reports on Form 10-K, its Quarterly Reports on Form 10-Q or its Current Reports on Form 8-K, or any amendments to them, that are filed with or furnished to the SEC, free of charge, from the Company’s Investor Relations website, \nhttps://ir.amwater.com,\n as soon as reasonably practicable after the Company files or furnishes the information to the SEC. \nThe Corporate Governance Guidelines and the charters for each of the standing committees of the Board of Directors, together with the American Water Code of Ethics and additional information regarding the Company’s corporate governance, are available on the Company’s Investor Relations website\n,\n and will be made available, without charge, in print to any shareholder who requests such documents from the Company’s Investor Relations Department in writing by mail at American Water Works Company, Inc., 1 Water Street, Camden, NJ, 08102.\n20\nTable of Contents",
  "item7": "ITEM 7.    MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe following discussion should be read together with the Consolidated Financial Statements and the Notes thereto included elsewhere in this Annual Report on Form 10-K. This discussion contains forward-looking statements that are based on management’s current expectations, estimates and projections about the Company’s business, operations and financial performance. The cautionary statements made in this Form 10-K should be read as applying to all related forward-looking statements whenever they appear in this Form 10-K. The Company’s actual results may differ materially from those currently anticipated and expressed in such forward-looking statements as a result of a number of factors, including those that are discussed under “Forward-Looking Statements,” Item 1A—Risk Factors and elsewhere in this Form 10-K. The Company has a disclosure committee consisting of members of senior management and other key employees involved in the preparation of the Company’s SEC reports. The disclosure committee is actively involved in the review and discussion of the Company’s SEC filings. For a discussion and analysis of the Company’s financial statements for fiscal 2023 compared to fiscal 2022, please refer to Item 7—Management’s Discussion and Analysis of Financial Condition and Results of Operations in the Company’s Annual Report on Form 10-K for the year ended December 31, 2023, filed with the SEC on February 14, 2024.\nOverview\nAmerican Water is the largest and most geographically diverse, publicly-traded water and wastewater utility company in the United States, as measured by both operating revenues and population served. The Company employs approximately 6,700 professionals who provide drinking water, wastewater and other related services to over 14 million people in 24 states. The Company’s primary business involves the ownership of utilities that provide water and wastewater services to residential, commercial, industrial, public authority, fire service and sale for resale customers, collectively presented as the “Regulated Businesses.” The Company’s utilities operate in 14 states in the United States, with 3.5 million active customers with services provided by its water and wastewater networks. Services provided by the Company’s utilities are subject to regulation by PUCs. The Company also operates other businesses not subject to economic regulation by state PUCs that provide water and wastewater services to the U.S. government on military installations, as well as municipalities, collectively presented throughout this Form 10-K within “Other.” See Item 1—Business for additional information.\nSelected Financial Data\nThis selected financial data below should be read in conjunction with the Company’s Consolidated Financial Statements and related Notes in this Annual Report on Form 10-K as well as the remainder of this Item 7—Management’s Discussion and Analysis of Financial Condition and Results of Operations.\n \nFor the Years Ended December 31,\n(In millions, except per share data)\n2024\n2023\n2022\n2021\n2020\nStatement of Operations data:\n \n \n \n \n \nOperating revenues\n$\n4,684 \n$\n4,234 \n$\n3,792 \n$\n3,930 \n$\n3,777 \nNet income attributable to common shareholders\n1,051 \n944 \n820 \n1,263 \n709 \nNet income attributable to common shareholders per basic common share\n5.39 \n4.90 \n4.51 \n6.96 \n3.91 \nNet income attributable to common shareholders per diluted common share\n5.39 \n4.90 \n4.51 \n6.95 \n3.91 \nBalance Sheet data:\n \n \n \n \n \nTotal assets\n$\n32,830 \n$\n30,298 \n$\n27,787 \n$\n26,075 \n$\n24,766 \nLong-term debt and redeemable preferred stock at redemption value\n12,521 \n11,718 \n10,929 \n10,344 \n9,333 \nOther data:\n \n \n \n \n \nCash dividends declared per common share\n$\n3.06 \n$\n2.83 \n$\n2.62 \n$\n2.41 \n$\n2.20 \nNet cash provided by operating activities\n2,045 \n1,874 \n1,108 \n1,441 \n1,426 \nNet cash used in investing activities\n(3,379)\n(2,815)\n(2,127)\n(1,536)\n(2,061)\nNet cash provided by (used in) financing activities\n1,110 \n1,188 \n1,000 \n(345)\n1,120 \nCapital expenditures included in net cash used in investing activities\n(2,856)\n(2,575)\n(2,297)\n(1,764)\n(1,822)\n50\nTable of Contents\nFinancial Results\nFor the years ended December 31, 2024, 2023 and 2022, diluted earnings per share (GAAP) were $5.39, $4.90 and $4.51, respectively. Increased results were driven primarily by the implementation of new rates in the Regulated Businesses from capital and acquisition investments. Results also reflect increased production and employee-related costs, increased depreciation and higher financing costs used to fund the current capital investment plan. Results for 2024 and 2023 reflect the net favorable impact of warmer, drier weather compared to normal, estimated at $0.12 per share, and $0.13 per share, respectively. Results for 2024 include incremental interest income of $0.09 per share, resulting from the early 2024 amendment to the secured seller note from the sale of the former HOS business. \nGrowth Through Capital Investment in Infrastructure and Regulated Acquisitions\nThe Company continues to grow its businesses, with the substantial majority of its growth to be achieved in the Regulated Businesses through (i) continued capital investment in the Company’s infrastructure to provide safe, clean, reliable and affordable water and wastewater services to its customers, (ii) regulated acquisitions to expand the Company’s services to new customers and (iii) organic growth in existing systems. In 2024,\n \nthe Company invested $3.3 billion, in the Regulated Businesses, as discussed below:\n•\n$2.8 billion capital investment in the Regulated Businesses, for infrastructure improvements and replacements; and\n•\n$417 million to fund acquisitions in the Regulated Businesses, which added approximately 69,500 customers during 2024. This includes the acquisitions by the Company’s Pennsylvania subsidiary of the wastewater collection and treatment system assets from the Butler Area Sewer Authority on October 29, 2024, for a cash purchase price of $230 million, which added approximately 15,000 customer connections, and by the Company’s Illinois subsidiary of a wastewater treatment plant and related assets from Granite City on March 11, 2024, for a cash purchase price of $86 million, which added approximately 26,000 wastewater customers, including 15,500 customers indirectly in surrounding communities.\n•\nApproximately 19,400 new customers were added through organic growth in existing systems.\nThe Company expects to invest between $17 billion to $18 billion over the next five years, and between $40 billion to $42 billion over the next 10 years, including $3.3 billion in 2025. The Company’s expected future investments include:\n•\ncapital investment for infrastructure improvements and replacements in the Regulated Businesses of between $15.5 billion to $16 billion over the next five years, and between $36 billion to $37 billion over the next 10 years; and\n•\ngrowth from acquisitions in the Regulated Businesses to expand the Company’s water and wastewater customer base of between $1.5 billion to $2 billion over the next five years, and between $4 billion to $5 billion over the next 10 years.\nThe Company estimates the expected capital investment for infrastructure improvements in its Regulated Businesses over the next ten years will be allocated to the following purposes: infrastructure renewal 68%; resiliency 10%; water quality, including capital expenditures related to PFAS 8%; operational efficiency, technology and innovation 6%; system expansion 5%; other 3%.\nAs of December 31, 2024, the Company had entered into 17 agreements with a total aggregate purchase price of $105 million for pending acquisitions in the Regulated Businesses to add approximately 24,200 additional customers.\nIn December 2020, the Company’s Pennsylvania subsidiary entered into an agreement (an acquisition intended to comply with Act 12 (discussed below)) to acquire the wastewater collection system assets of Brentwood Borough (“Brentwood”) for a purchase price of approximately $19 million. On February 22, 2024, the Pennsylvania Public Utility Commission (the “PaPUC”) denied the Pennsylvania subsidiary’s application to acquire Brentwood. On April 3, 2024, the Pennsylvania subsidiary filed an appeal of the decision with the Pennsylvania Commonwealth Court, asserting, among other things, the PaPUC did not apply the correct legal standard in its decision. The Company cannot currently predict the outcome of this appeal, and the matter remains pending.\nOn July 2, 2024, the PaPUC issued the Final Supplemental Implementation Order (“FSIO”), which makes certain changes to the process by which the PaPUC considers and decides applications to acquire water and wastewater assets under Pennsylvania’s existing utility valuation law, known as Act 12 of 2016 (“Act 12”). The FSIO includes, among other things, a reasonableness review ratio that would be applied to help guide the determination on the overall prudency of the transaction and reasonableness of the purchase price. The provisions of the FSIO are not retroactive and apply to acquisition applications filed after July 2, 2024. The Company cannot currently predict the impact of the FSIO, but the Company intends to continue to support outcomes that allow for consolidation and investment in water and wastewater infrastructure in Pennsylvania and in its other regulated jurisdictions.\n51\nTable of Contents\nOther Matters\nEnvironmental, Health and Safety, and Water Quality Regulation\nOn April 10, 2024, the EPA announced a final NPDWR for six PFAS including PFOA, PFOS, PFNA, HFPO-DA, PFHxS, and PFBS. The NPDWR for PFAS establishes MCLs, for PFAS in drinking water. Utilities will be required to complete their initial monitoring for PFAS by 2027, followed by ongoing compliance monitoring. Utilities will be required to comply with the new MCLs by April 2029, implementing solutions to reduce PFAS levels where needed. Beginning in April 2029, utilities that exceed any of the PFAS MCLs will be required to provide notification to the public of the violation.\nThe Company estimates an investment of approximately $1 billion of capital expenditures to install additional treatment facilities in order to comply with the new regulations by April 2029. Additionally, the Company estimates that it will incur annual operating expenses of up to approximately $50 million related to testing and treatment, with the majority of the operating expenses beginning near the April 2029 compliance deadline. The actual level of capital investment and expenses may differ from these estimates and will be dependent upon market dynamics upon implementation of solutions to comply with the NPDWR for PFAS.\nThe Company has entered into a nine-year exclusive contract with a third-party vendor to supply granular activated carbon, equipment and reactivation services to more than 50 of the Company’s treatment sites across 10 states through 2033. The equipment and services provided through the contract will aid the Company in treating drinking water to assist in complying with the NPDWR for PFAS. \nThe Company supports sound policies and compliance with the NPDWR for PFAS by all water utilities, while protecting customers and communities from the costly burden of monitoring and mitigating PFAS contamination in water systems. The Company continues to advocate for policies that hold polluters accountable and is participating in the multi-district litigation and other lawsuits filed against certain PFAS manufacturers seeking damages and reimbursement of costs incurred and continuing to be incurred to address contamination of public water supply systems by PFAS. For more information on the PFAS multi-district litigation, see Item 3—Legal Proceedings—PFAS Multi-District Litigation.\nOn April 19, 2024, the EPA issued a final rule to designate PFOA and PFOS as hazardous substances under CERCLA. The Company, along with a coalition of other water and wastewater organizations, is actively advocating for and supporting bipartisan legislation that would provide PFAS liability protections under CERCLA for water and wastewater systems, as passive receivers of PFAS, and to hold polluters, and not the public or customers, accountable for PFAS-related liability.\nOn October 30, 2024, the EPA published the LCRI with a “Compliance Date” of November 1, 2027. The LCRI focus includes requirements related to (i) replacing all lead and certain galvanized service lines under a utilities control by October 30, 2037, 10 years from the Compliance Date; (ii) \nidentifying the materials of all service lines of unknown material;\n (iii) improving tap sampling; (iv) lowering the lead action level; and (v) strengthening protections to reduce exposure. The LCRI also deferred the compliance date of certain requirements of the LCRR to allow for compliance with both new rules. The Company is in the process of developing an estimate of capital expenditures and operating costs needed to meet the specific requirements of the LCRI. Capital expenditures and operating costs associated with compliance with federal water quality regulations have been traditionally recognized by PUCs as appropriate for inclusion in establishing rates. \nThe Company continues to comply with the EPA’s existing Lead and Copper Rule requirements by replacing lead service lines in accordance with current scientific guidance and utilizing appropriate corrosion control techniques as necessary to comply with current water quality regulatory requirements. \nThe Company met the LCRR requirements, effective October 16, 2024, identified as enforceable by the EPA. Remaining LCRR requirements are deferred under the LCRI.\nCybersecurity Incident\nOn October 3, 2024, the Company identified unauthorized activity within its information technology computer networks and systems, which was determined to be the result of a cybersecurity incident. Upon identification of this activity, the Company immediately activated its incident response protocols and third-party cybersecurity experts to assist with containment and mitigation activities and to investigate the nature and scope of the incident. The Company also promptly notified law enforcement and has coordinated fully with them. As part of the incident response, and in order to protect its systems and data, the Company disconnected and deactivated certain of its systems, which have since been reconnected and reactivated upon verification that those systems were secure.\n52\nTable of Contents\nAll necessary containment, mitigation and restoration activities related to this incident have been completed. None of the Company’s water or wastewater facilities were impacted by this incident, and the incident did not have a material effect on the Company or its financial condition or results of operations. In addition, a number of putative class action lawsuits have been filed in connection with this cybersecurity incident, primarily alleging claims related to federal and/or state consumer protection and data privacy laws, and while the Company believes the claims are without merit and is vigorously defending itself against these claims, it cannot currently predict the outcome or impact of these lawsuits. See Item 3—Legal Proceedings—Cybersecurity Incident Class Action Lawsuits for more information.\nRegulatory Matters\nGeneral Rate Cases\nThe table below summarizes the annualized incremental revenues, assuming a constant sales volume and customer count, resulting from general rate case authorizations that became effective during 2024. The amounts include reductions for the amortization of the excess accumulated deferred income taxes (“EADIT”) that are generally offset in income tax expense.\n(In millions)\nEffective Date\nAmount\nGeneral rate cases by state:\nKentucky\n(a)\n$\n17 \nNew Jersey\nSeptember 15, 2024\n80 \nPennsylvania\nAugust 7, 2024\n99 \nIndiana, Step Increases\n(b)\n48 \nWest Virginia\nFebruary 25, 2024\n18 \nCalifornia\nJanuary 1, 2024\n21 \nTotal general rate case authorizations\n$\n283 \n(a)\nIn 2024, $6 million was effective November 6 and $11 million was effective May 3.\n(b)\nIn 2024, $23 million was effective May 10 and $25 million was effective February 21.\nThe table below summarizes the annualized incremental revenues, assuming a constant sales volume and customer count, resulting from general rate case authorizations that became effective on or after January 1, 2025. The amounts include reductions for the amortization of EADIT that are generally offset in income tax expense.\n(In millions)\nEffective Date\nAmount\nGeneral rate cases by state:\nTennessee\nJanuary 21, 2025\n$\n1 \nIllinois\nJanuary 1, 2025\n105 \nTotal general rate case authorizations\n$\n106 \nOn January 21, 2025, the Tennessee Public Utility Commission (the “TPUC”) approved a motion authorizing an adjustment of water base rates requested in a rate case filed on May 1, 2024, by the Company’s Tennessee subsidiary. The TPUC approved an increase of $1 million in annualized revenues, excluding previously recovered infrastructure surcharges of $18 million, based on an authorized return on equity of 9.70%, authorized rate base of approximately $300 million, a common equity ratio of 44.19% and a debt ratio of 55.81%. This adjustment took effect on January 21, 2025, and is driven primarily by approximately $173 million in capital investments made and to be made by the Tennessee subsidiary through December 2025.\nOn December 5, 2024, the Illinois Commerce Commission issued a final order approving the adjustment of base rates requested in a rate case originally filed on January 25, 2024, by the Company’s Illinois subsidiary. The general rate case order approved an increase of $105 million in annualized water and wastewater system revenues, excluding previously recovered infrastructure surcharges of $5 million, based on an authorized return on equity of 9.84%, authorized rate base of $2.2 billion, and a capital structure with an equity component of 49.00% and a debt component of 51.00%. The general rate case order denied the second step increase of $16 million. The increase was effective January 1, 2025, and is driven primarily by approximately $557 million in capital investments made and to be made by the Illinois subsidiary from January 2024 through December 2025.\n53\nTable of Contents\nOn December 5, 2024, the CPUC approved a final decision adopting the terms of a partial settlement agreement filed on November 17, 2023, in the Company’s California subsidiary’s general rate case originally filed on July 1, 2022. Incorporating the currently effective return on equity of 10.20%, the decision provides incremental annualized water and wastewater revenues of $21 million in the 2024 test year, and an estimated $16 million in the 2025 escalation year and $16 million in the 2026 attrition year. New rates were implemented retroactively to January 1, 2024. In addition, the CPUC denied the California subsidiary’s proposed Water Resources Sustainability Plan decoupling mechanism but approved continuation of its currently effective Annual Consumption Adjustment Mechanism. On December 12, 2024, the California subsidiary filed an application for rehearing of the CPUC’s denial of the proposed Water Resources Sustainability Plan decoupling mechanism.\nOn May 3, 2024, the Kentucky Public Service Commission (the “KPSC”) issued an order approving the adjustment of base rates requested in a rate case filed on June 30, 2023, by the Company’s Kentucky subsidiary. The general rate case order approved an $11 million annualized increase in water revenues, excluding infrastructure surcharge revenues of $10 million, which continue to be recovered in the Kentucky subsidiary’s approved infrastructure mechanism. The annualized increase is based upon an authorized return on equity of 9.70%, authorized rate base of $489 million, which reflects capital investments through January 31, 2025, and a capital structure with a common equity ratio of 52.22%. Interim rates in this proceeding were effective on February 6, 2024, and the order required that the difference between interim and final approved rates be subject to refund no later than August 26, 2024. On May 16, 2024, the Kentucky subsidiary filed with the KPSC a petition for rehearing of the KPSC’s order, seeking clarification and/or correction of certain computational inconsistencies that the Kentucky subsidiary believes are reflected in the KPSC’s order with respect to the authorized amount of annualized revenues to be received by the Kentucky subsidiary. On November 6, 2024, the KPSC approved a final order (the “Final Order”) providing for a $17 million annualized increase in water revenues, an increase of approximately $6 million from May 3, 2024. New rates provided in the Final Order were effective November 6, 2024.\nOn September 4, 2024, the New Jersey Board of Public Utilities (“NJBPU”) issued an order approving without modification the stipulation of settlement of a general rate case filed on January 19, 2024, by the Company’s New Jersey subsidiary. The general rate case order approved an $80 million annualized increase in the New Jersey subsidiary’s water and wastewater revenues, effective September 15, 2024, based on (i) an authorized return on equity of 9.60%, (ii) an authorized rate base of $5.1 billion, (iii) a common equity ratio of 55.00%, and (iv) a long-term debt ratio of 45.00%. The annualized revenue increase is driven primarily by $1.3 billion of incremental capital investments since the New Jersey subsidiary’s last general rate case. The New Jersey subsidiary will continue to defer as a regulatory asset or liability, as appropriate, until its next general rate case, the difference between its pension expense and other postretirement benefits expense and those amounts included in base rates.\nOn July 22, 2024, the PaPUC released an order approving the adjustment of base rates requested in a general rate case filed by the Company’s Pennsylvania subsidiary on November 8, 2023. The PaPUC approved a $99 million annualized increase in the Pennsylvania subsidiary’s water and wastewater system revenues, excluding previously recovered infrastructure surcharges of $20 million, based on (i) an authorized return on equity of 9.45%, (ii) an authorized rate base of $5.8 billion, which reflects, as requested and included in the general rate case, approximately $1.0 billion in capital investments to be made through mid-2025, (iii) a common equity ratio of 55.30%, and (iv) a long-term debt ratio of 44.70%. Certain acquisitions, including the acquisition of the wastewater collection and treatment system of the Butler Area Sewer Authority, were excluded from authorized base rates. The new rates were effective on August 7, 2024, except that new wastewater rates for two recently acquired systems, including the City of York, will take effect during the first half of 2025 in accordance with the terms of the relevant acquisition agreements. As part of its approval of this rate adjustment, the PaPUC initiated an investigation into certain reported water service and water quality issues in the Pennsylvania subsidiary’s Northeastern service territory, which reports had been provided during public input hearings convened in the general rate case. The PaPUC is expected to conclude the investigation in the second quarter of 2025.\nOn February 23, 2024, the WVPSC issued an order approving the adjustment of base rates requested in a rate case filed on May 1, 2023, by the Company’s West Virginia subsidiary. The general rate case order approved an $18 million annualized increase in water and wastewater system revenues, excluding previously recovered infrastructure surcharges of $7 million, based on an authorized return on equity of 9.80%, authorized rate base of $886 million, which reflects capital investments through February 2024, a common equity ratio of 50.12% and a long-term debt ratio of 49.88%. The increased water and wastewater revenues related to the base rate adjustment are being driven primarily by (i) $220 million of related water and wastewater system capital investments made since the completion of the West Virginia subsidiary’s previous rate case, (ii) higher pension and other postretirement benefit costs, and (iii) increases in production costs, including chemicals, fuel and power costs.\n54\nTable of Contents\nOn February 14, 2024, the Indiana Utility Regulatory Commission (the “IURC”) issued an order approving the adjustment of base rates requested in a rate case filed on March 31, 2023, by the Company’s Indiana subsidiary. The general rate case order approved a $66 million annualized increase in water and wastewater system revenues, excluding previously recovered infrastructure surcharges, based on an authorized return on equity of 9.65%, authorized rate base of $1.8 billion, a common equity ratio of 56.15% and a debt ratio of 43.85%. For purposes of determining rates, the adjustment is based on an equity component of 48.19% due to the regulatory practice in Indiana of including certain zero-cost items or tax credit balances in the capital structure calculation. The annualized revenue increase will include three step increases, with $25 million of the increase to be included in rates in February 2024, $23 million in May 2024, and $18 million in May 2025. The increases are being driven primarily by (i) over $875 million of water and wastewater system capital investments since the completion of the Indiana subsidiary’s last rate case and through April 30, 2025, (ii) higher pension and other postretirement benefit costs, and (iii) increases in production costs, including chemicals, fuel and power costs.\nPending General Rate Case Filings\nOn August 2, 2024, the Company’s Hawaii subsidiary filed a general rate case requesting approximately $2 million in annualized incremental revenues, which is based on a proposed return on equity of 10.67% and a capital structure with an equity component of 52.11% and debt component of 47.89%. The requested annualized incremental revenue is driven primarily by approximately $41 million in capital investments made and to be made by the Hawaii subsidiary through 2025. The Hawaii subsidiary anticipates that the general rate case proceeding will be completed by mid-2025.\nOn July 1, 2024, the Company’s Missouri subsidiary filed a general rate case requesting approximately $148 million in annualized incremental revenues. The request is based on a return on equity of 10.75% and a capital structure with an equity component of 50.54% and a long-term debt component of 49.46%. The requested annualized incremental revenue is driven primarily by $1.5 billion of incremental capital investments completed and planned by the Missouri subsidiary from January 2023 through May 2026. On July 31, 2024, the Missouri Public Service Commission issued an order establishing the test year in this case, which modified the Missouri subsidiary’s original proposal for a future test year through May 2026, and instead reverted to a true-up period through December 31, 2024, with an allowance for proposed discrete adjustments subsequent to this date. On September 6, 2024, the Missouri subsidiary filed supplemental testimony to revise the request to approximately $123 million in annualized incremental revenues and define the specific discrete adjustments proposed through the rate effective period, which lowered the incremental capital investments completed and planned to $1.1 billion through May 2025. The Missouri subsidiary anticipates that the general rate case proceeding will be completed by mid-2025.\nOn May 1, 2024, the Company’s Iowa subsidiary filed a general rate case requesting approximately $21 million in additional annualized revenues, which is based on a proposed return on equity of 10.75% and a capital structure with an equity component of 52.57% and debt component of 47.43%. The requested annualized revenue increase is driven primarily by approximately $157 million in capital investments made and to be made by the Iowa subsidiary through March 2026. Interim rates became effective May 11, 2024, with the difference between interim and final approved rates subject to refund. On August 29, 2024, the Iowa subsidiary submitted supplemental testimony consistent with the procedural schedule, which was subsequently challenged by the parties in the proceeding. On October 4, 2024, the Iowa Utilities Commission issued an order that granted the inclusion of the supplemental filing and extended the procedural schedule in the case beyond the statutory ten-month period. The Iowa subsidiary now expects resolution of this proceeding by May 2025.\nOn December 15, 2023, the Company’s California subsidiary submitted a request to delay by one year its cost of capital filing and maintain its current authorized cost of capital through 2025. On February 2, 2024, the CPUC granted the request for a one-year extension of the cost of capital filing to May 1, 2025, to set its authorized cost of capital beginning January 1, 2026. On December 18, 2024, the California subsidiary submitted a request to further delay by one year its cost of capital filing and maintain the authorized cost of capital through 2026. On January 14, 2025, the CPUC granted the request for a one-year extension of the cost of capital filing to May 1, 2026, to set its authorized cost of capital beginning January 1, 2027.\n55\nTable of Contents\nOn November 1, 2023, the Company’s Virginia subsidiary filed a general rate case requesting $20 million in additional annualized revenues. The request is based on a proposed return on equity of 10.95% and a capital structure with an equity component of 45.67% and a debt and other component of 54.33%. The requested increase is driven by approximately $110 million in capital investments between May 2023 and April 2025. The request also proposed a revenue decoupling mechanism and seeks deferral of certain production cost adjustments. Interim rates became effective May 1, 2024, with the difference between interim and final approved rates subject to refund. On September 20, 2024, the Virginia subsidiary filed with the Virginia State Corporation Commission (the “SCC”) a “black box” stipulation of settlement on key financial terms which agreed to a $15 million annualized increase in the Virginia subsidiary’s revenues. The stipulation of settlement also agreed, solely for purposes of the Virginia subsidiary’s future filings requiring a stated cost of capital and/or capital structure (including its annual information and water and wastewater infrastructure surcharge filings), that its return on equity will be 9.70% and its capital structure will consist of an equity component of 45.67% and a debt and other component of 54.33%. The stipulation of settlement remains subject to SCC review and approval.\nInfrastructure Surcharges\nA number of states have authorized the use of regulatory mechanisms that permit rates to be adjusted outside of a general rate case for certain costs and investments, such as infrastructure surcharge mechanisms that permit recovery of capital investments to replace aging infrastructure. Presented in the table below are annualized incremental revenues, assuming a constant sales volume and customer count, resulting from infrastructure surcharge authorizations that became effective during 2024:\n(In millions)\nEffective Date\nAmount\nInfrastructure surcharges by state:\nMissouri\n(b)\n$\n47 \nPennsylvania\n(c)\n21 \nNew Jersey\nApril 30, 2024\n9 \nIowa\nMarch 1, 2024\n1 \nWest Virginia (a)\nMarch 1, 2024\n7 \nIllinois\nJanuary 1, 2024\n5 \nTotal infrastructure surcharge authorizations\n$\n90 \n(a)\nOn March 5, 2024, the WVPSC directed the Company’s West Virginia subsidiary to interpret the distribution system improvement charge (“DSIC”) Order as having included within the DSIC the three-year amortization of a prior authorized deferral associated with a large treatment plant project. The inclusion of this deferral increased the net incremental revenue by $0.7 million to a total of $6.6 million effective March 1, 2024.\n(b)\nIn 2024, $21 million was effective July 11 and $26 million was effective January 20.\n(c)\nIn 2024, $14 million was effective July 1 and $7 million was effective April 1.\nPresented in the table below are annualized incremental revenues, assuming a constant sales volume and customer count, resulting from infrastructure surcharge authorizations that became effective on or after January 1, 2025:\n(In millions)\nEffective Date\nAmount\nInfrastructure surcharge filings by state:\nMissouri\nFebruary 7, 2025\n$\n17 \nKentucky\nJanuary 1, 2025\n2 \nWest Virginia\nJanuary 1, 2025\n4 \nTotal infrastructure surcharge filings\n$\n23 \n56\nTable of Contents\nOther Regulatory Matters\nIn September 2020, the CPUC released a decision under its Low-Income Rate Payer Assistance program rulemaking that required the Company’s California subsidiary to file a proposal to alter its water revenue adjustment mechanism in its next general rate case filing in 2022, which would have become effective upon receiving an order in the rate case. On October 5, 2020, the Company’s California subsidiary filed an application for rehearing of the decision and following the CPUC’s denial of its rehearing application in September 2021, the Company’s California subsidiary filed a petition for writ of review with the California Supreme Court on October 27, 2021. On May 18, 2022, the California Supreme Court issued a writ of review for the California subsidiary’s petition and the petitions filed by other entities challenging the decision. On July 8, 2024, the California Supreme Court issued a unanimous opinion concluding that the CPUC did not regularly seek to exercise its authority when it prohibited water utilities from proposing to continue their water revenue adjustment mechanisms. Accordingly, the California Supreme Court vacated the portion of the CPUC’s 2020 decision relating to this prohibition against continuation of such water revenue adjustment mechanisms.\nIndependent of the judicial challenge, California passed Senate Bill 1469, which allows the CPUC to consider and authorize the implementation of a mechanism that separates the water corporation’s revenue and its water sales. Legislation was signed by the Governor on September 30, 2022, and became effective on January 1, 2023. In response to the legislation, on January 27, 2023, the Company’s California subsidiary filed an updated application requesting the CPUC to consider a Water Resources Sustainability Plan decoupling mechanism in its 2022 general rate case. On December 5, 2024, the CPUC denied the California subsidiary’s proposed Water Resources Sustainability Plan decoupling mechanism but approved continuation of its currently effective Annual Consumption Adjustment Mechanism. On December 12, 2024, the California subsidiary filed an application for rehearing of the CPUC’s denial of the proposed Water Resources Sustainability Plan decoupling mechanism.\nOn March 2, 2021, an administrative law judge (“ALJ”) in the Office of Administrative Law of New Jersey filed an initial decision with the NJBPU that recommended denial of a petition filed by the Company’s New Jersey subsidiary, which sought approval of acquisition adjustments in rate base of $29 million associated with the acquisitions of Shorelands Water Company, Inc. in 2017 and the Borough of Haddonfield’s water and wastewater systems in 2015. On July 29, 2021, the NJBPU issued an order adopting the ALJ’s initial decision without modification. The Company’s New Jersey subsidiary filed a Notice of Appeal with the New Jersey Appellate Division on September 10, 2021. On December 30, 2024, the New Jersey Appellate Division of the New Jersey Superior Court affirmed the NJBPU decision rejecting the acquisition adjustments. There is no financial impact to the Company as a result of the NJBPU’s order and resulting appeal decision, since the acquisition adjustments are currently recorded as goodwill on the Consolidated Balance Sheets.\n57\nTable of Contents\nConsolidated Results of Operations\nPresented in the table below are the Company’s consolidated results of operations:\n \nFor the Years Ended December 31,\n(In millions)\n2024\n2023\n2022\nOperating revenues\n$\n4,684 \n$\n4,234 \n$\n3,792 \nOperating expenses:\n \n \n \nOperation and maintenance\n1,858 \n1,720 \n1,589 \nDepreciation and amortization\n788 \n704 \n649 \nGeneral taxes\n320 \n307 \n281 \nOther\n— \n(1)\n— \nTotal operating expenses, net\n2,966 \n2,730 \n2,519 \nOperating income\n1,718 \n1,504 \n1,273 \nOther income (expense):\n \n \n \nInterest expense\n(523)\n(460)\n(433)\nInterest Income\n94 \n73 \n52 \nNon-operating benefit costs, net\n28 \n32 \n77 \nGain on sale of businesses\n— \n— \n19 \nOther, net\n42 \n47 \n20 \nTotal other income (expense)\n(359)\n(308)\n(265)\nIncome before income taxes\n1,359 \n1,196 \n1,008 \nProvision for income taxes\n308 \n252 \n188 \nNet income attributable to common shareholders\n$\n1,051 \n$\n944 \n$\n820 \nSegment Results of Operations\nThe Company’s operating segments are comprised of its businesses which generate revenue, incur expense and have separate financial information which is regularly used by the chief operating decision maker to make operating decisions, assess performance and allocate resources. The Company operates its business primarily through one reportable segment, the Regulated Businesses segment. Other primarily includes MSG, which does not meet the criteria of a reportable segment in accordance with GAAP. Other\n also includes corporate costs that are not allocated to the Company’s \nRegulated Businesses\n, i\nnterest income related to the secured seller promissory note from the sale of HOS, income from assets not associated with the Regulated Businesses, eliminations of inter-segment transactions and fair value adjustments related to acquisitions that have not been allocated to the Regulated Businesses segment.\n \nThis presentation is consistent with how management assesses the results of these businesses. For a discussion and analysis of the Company’s financial statements for fiscal 2023 compared to fiscal 2022, please refer to Item 7—Management’s Discussion and Analysis of Financial Condition and Results of Operations in the Company’s Annual Report on Form 10-K for the year ended December 31, 2023, filed with the SEC on February 14, 2024.\nRegulated Businesses Segment\nPresented in the table below is financial information for the Regulated Businesses:\n \nFor the Years Ended December 31,\n(In millions)\n2024\n2023\n2022\nOperating revenues\n$\n4,296 \n$\n3,920 \n$\n3,505 \nOperation and maintenance\n1,517 \n1,441 \n1,345 \nDepreciation and amortization\n772 \n693 \n633 \nGeneral taxes\n301 \n288 \n264 \nOther operating (income) expense\n— \n(1)\n— \nOther income (expense)\n(339)\n(269)\n(220)\nProvision for income taxes\n302 \n259 \n188 \nNet income attributable to common shareholders\n$\n1,065 \n$\n971 \n$\n854 \n58\nTable of Contents\nOperating Revenues\nPresented in the tables below is information regarding the main components of the Regulated Businesses’ operating revenues:\nFor the Years Ended December 31,\n(In millions)\n2024\n2023\n2022\nWater services:\n \n \n \nResidential\n$\n2,349 \n$\n2,143 \n$\n1,941 \nCommercial\n885 \n798 \n710 \nFire service\n164 \n158 \n147 \nIndustrial\n184 \n167 \n153 \nPublic and other\n301 \n284 \n267 \nTotal water services\n3,883 \n3,550 \n3,218 \nWastewater services:\nResidential\n245 \n228 \n174 \nCommercial\n70 \n62 \n45 \nIndustrial\n12 \n8 \n4 \nPublic and other\n36 \n29 \n19 \nTotal wastewater services\n363 \n327 \n242 \nOther \n(a)\n50 \n43 \n45 \nTotal operating revenues\n$\n4,296 \n$\n3,920 \n$\n3,505 \n(a)\nIncludes other operating revenues consisting primarily of miscellaneous utility charges, fees and rents.\n \nFor the Years Ended December 31,\n(Gallons in millions)\n2024\n2023\n2022\nBilled water services volumes:\n \n \n \nResidential\n163,583 \n160,921 \n162,105 \nCommercial\n80,385 \n78,404 \n77,627 \nIndustrial\n37,217 \n36,404 \n37,265 \nFire service, public and other\n54,700 \n54,236 \n51,966 \nTotal billed water services volumes\n335,885 \n329,965 \n328,963 \nIn 2024, as compared to 2023, operating revenues increased $376 million, primarily due to: (i) a $288 million increase from authorized rate increases, including infrastructure surcharges, principally to recover infrastructure investment in various states; (ii) a $41 million increase from water and wastewater acquisitions and organic growth in existing systems; (iii) a $26 million increase from changes in customer demand; and (iv) a $17 million net increase as a result of reduced amortization of EADIT, primarily in the Company’s Missouri subsidiary.\n59\nTable of Contents\nOperation and Maintenance\nPresented in the table below is information regarding the main components of the Regulated Businesses’ operating and maintenance expense:\n \nFor the Years Ended December 31,\n(In millions)\n2024\n2023\n2022\nEmployee-related costs\n$\n543 \n$\n513 \n$\n505 \nProduction costs\n458 \n438 \n387 \nOperating supplies and services\n274 \n255 \n242 \nMaintenance materials and supplies\n97 \n102 \n96 \nCustomer billing and accounting\n72 \n65 \n59 \nOther\n73 \n68 \n56 \nTotal operation and maintenance expense\n$\n1,517 \n$\n1,441 \n$\n1,345 \nEmployee-Related Costs\n \nFor the Years Ended December 31,\n(In millions)\n2024\n2023\n2022\nSalaries and wages\n$\n434 \n$\n413 \n$\n395 \nGroup insurance\n69 \n60 \n59 \nPensions\n7 \n9 \n21 \nOther benefits\n33 \n31 \n30 \nTotal employee-related costs\n$\n543 \n$\n513 \n$\n505 \nIn 2024, as compared to 2023, employee-related costs increased $30 million primarily due to an increase in salaries and wages due to merit increases, which was partially offset by higher capitalized labor and overhead rates.\nProduction Costs\n \nFor the Years Ended December 31,\n(In millions)\n2024\n2023\n2022\nPurchased water\n$\n180 \n$\n161 \n$\n154 \nFuel and power\n112 \n108 \n104 \nChemicals\n107 \n105 \n78 \nWaste disposal\n59 \n64 \n51 \nTotal production costs\n$\n458 \n$\n438 \n$\n387 \nIn 2024, as compared to 2023, production costs increased $20 million primarily from higher purchased water cost and usage.\nOperating Supplies and Services\nIn 2024, as compared to 2023, operating supplies and services increased $19 million primarily due to higher contracted services and software licensing costs as well as an increase in various other operating expenses.\nDepreciation and Amortization\nIn 2024, as compared to 2023, depreciation and amortization increased $79 million primarily due to additional utility plant placed in service from capital infrastructure investments and acquisitions.\nGeneral Taxes\nIn 2024, as compared to 2023, general taxes increased $13 million primarily due to incremental property taxes and New Jersey Gross Receipts Tax.\n60\nTable of Contents\nOther Income (Expense)\nIn 2024, as compared to 2023, other expenses increased $70 million primarily due to higher interest expense from the issuance of incremental long-term debt and a decrease in AFUDC in 2024.\nProvision for Income Taxes\nIn 2024, as compared to 2023, the Regulated Businesses’ provision for income taxes increased $43 million. The Regulated Businesses’ effective income tax rate was 22.1% and 21.1% for the years ended December 31, 2024 and 2023, respectively. The increase was primarily due to the decrease in the amortization of EADIT, pursuant to regulatory orders. The amortization of EADIT is generally offset with reductions in revenue. \nOther \nPresented in the table below is information for Other:\n \nFor the Years Ended December 31,\n(In millions)\n2024\n2023\n2022\nOperating revenues\n$\n388 \n$\n314 \n$\n287 \nOperation and maintenance\n341 \n279 \n244 \nDepreciation and amortization\n16 \n11 \n16 \nGeneral taxes\n19 \n19 \n17 \nInterest expense\n(107)\n(96)\n(119)\nInterest income\n77 \n45 \n50 \nGain on sale of businesses\n— \n— \n19 \nOther income\n10 \n12 \n6 \nProvision for (benefit from) income taxes\n6 \n(7)\n— \nNet loss attributable to common shareholders\n$\n(14)\n$\n(27)\n$\n(34)\nOperating Revenues\nIn 2024, as compared to 2023, operating revenues increased $74 million from an increase in capital projects in MSG, primarily at Naval Station Mayport, and an increase in capital projects in CSG.\nOperation and Maintenance\nPresented in the table below is information regarding the main components of Other’s operating and maintenance expense:\n \nFor the Years Ended December 31,\n(In millions)\n2024\n2023\n2022\nOperating supplies and services\n$\n195 \n$\n150 \n$\n120 \nMaintenance materials and supplies\n27 \n29 \n35 \nEmployee-related costs\n101 \n85 \n73 \nProduction costs\n10 \n9 \n10 \nOther\n8 \n6 \n6 \nTotal operation and maintenance expense\n$\n341 \n$\n279 \n$\n244 \nOperating Supplies and Services\nIn 2024, as compared to 2023, operating supplies and services increased $45 million primarily due to costs associated with the increased capital projects in MSG.\nEmployee-Related Costs\nIn 2024, as compared to 2023, employee-related costs increased $16 million primarily due to an increase in salaries and wages. \n61\nTable of Contents\nInterest Income\nIn 2024, as compared to 2023, interest income increased $32 million primarily due to the increased interest rate and higher principal balance from the February 2024 amendment of the secured seller promissory note from the sale of HOS. See Note 5—Acquisitions and Divestitures—Sale of Homeowner Services Group, in the Notes to Consolidated Financial Statements for additional information.\nTax Matters\nOn August 16, 2022, the Inflation Reduction Act of 2022 (the “IRA”) was signed into law. The IRA contains a 15% CAMT provision on applicable corporations effective January 1, 2023. To determine if a company is considered an applicable corporation subject to CAMT, the company’s average adjusted financial statement income (“AFSI”) for the three consecutive years preceding the tax year must exceed $1.0 billion. An applicable corporation must make several adjustments to net income when determining AFSI. A corporation paying CAMT is eligible for a future tax credit, which can be utilized when regular tax exceeds CAMT. Based on current guidance, the Company is an applicable corporation subject to CAMT beginning in 2024 and expects to owe CAMT in excess of the regular tax liability. On September 12, 2024, the Internal Revenue Service (the “IRS”) and the U.S. Treasury issued Notice 2024-66, allowing corporate taxpayers to exclude amounts attributable to the CAMT liability, without penalty, from estimated tax payments with respect to a taxable year that begins during 2024. The Company will include the CAMT liability in its 2024 extension payment due April 15, 2025. The Company will continue to assess the impacts of the IRA as the U.S. Treasury and the IRS provide further guidance.\nLegislative Updates\nDuring 2024 and 2025, the Company’s regulatory jurisdictions enacted the following legislation that has been approved and is effective as of February 19, 2025:\n•\nNew Jersey passed Assembly Bill 4791, establishing the “Resiliency and Environmental System Investment Charge Program,” which creates a regulatory mechanism that enables water and wastewater utilities to recover the costs of investment in certain non-revenue producing utility system components that enhance water and wastewater system resiliency, environmental compliance such as existing and proposed requirements for PFAS, safety, and public health. Legislation was signed by the Governor and became effective on January 12, 2024.\n•\nIndiana passed Senate Bill 5, which provides access to a property by a water utility to replace lead service lines when a landown\ner does not enroll in the offered lead service line replacement program, does not personally replace the customer owned portion of the lead service line following notice and a 45-day waiting period, or is non-responsive to attempted communication after the 45-day waiting period. Legislation was signed by the Governor and became effective on March 11, 2024. \n•\nIowa passed House File 207, \nwhich modifies property tax assessments to exempt property owned or operated by a public or private utility and is directly and primarily used for furnishing sanitary sewage or storm water drainage disposal by a piped collection system to the public for compensation. Legislation was signed by the Governor and became effective on May 2, 2024.\n•\nWest Virginia passed House Bill 5617, which adopts standards and authorizes the WVPSC to promulgate rules, and also allows for rate recovery, on maintenance, flushing, flow testing and marking of fire hydrants owned by water utilities. Legislation was signed by the Governor and became effective on June 4, 2024.\n•\nIowa passed House File 2101, which increases the threshold amount required for approval by the Iowa Utilities Commission for water and wastewater utility acquisition filings from $0.5 million to $3 million. Legislation was signed by the Governor \nand became effective on July 1, 2024.\n•\nIndiana passed Senate Bill 247, which establishes a 30-day filing with the IURC by a utility for an acquisition of a utility with an appraised value and purchase price of less than $3 million. Legislation was signed by the Governor became effective on July 1, 2024.\n•\nCalifornia passed Senate Bill 219, which amends the Climate Corporate Data Accountability Act and the Climate-Related Financial Risk Act, to allow the California Air Resources Board until July 1, 2025, to issue implementing regulations, including reporting requirements for Scope 3 emissions. Legislation was signed by the Governor on September 27, 2024, and became effective January 1, 2025.\n62\nTable of Contents\nLiquidity and Capital Resources\nThe Company uses its capital resources, including cash, primarily to (i) fund operating and capital requirements, (ii) pay interest and meet debt maturities, (iii) pay dividends, (iv) fund acquisitions, (v) fund pension and postretirement benefit obligations, and (vi) to pay federal income taxes. The Company invests a significant amount of cash on regulated capital projects where it expects to earn a long-term return on investment. Additionally, the Company operates in rate regulated environments in which the amount of new investment recovery may be limited, and where such recovery generally takes place over an extended period of time, and certain capital recovery is also subject to regulatory lag. See Item 1—Business—Regulated Businesses—Regulation and Rate Making for additional information. The Company expects to fund future maturities of long-term debt through a combination of external debt and, to the extent available, cash flows from operations. Since the Company expects its capital investments over the next few years to be greater than its cash flows from operating activities, the Company currently plans to fund the excess of its capital investments over its cash flows from operating activities for the next five years through a combination of long-term debt and equity issuances, in addition to the remaining proceeds from the sale of HOS. The remaining proceeds from the sale of HOS include receipt of payments under a secured seller promissory note, plus interest, see Note 5—Acquisitions and Divestitures —Sale of Homeowner Services Group, in the Notes to Consolidated Financial Statements for additional information. If necessary, the Company may delay certain capital investments or other funding requirements or pursue financing from other sources to preserve liquidity. In this event, the Company believes it can rely upon cash flows from operations to meet its obligations and fund its minimum required capital investments for an extended period of time.\nThe Company regularly evaluates and monitors its cash requirements for capital investments, acquisitions, operations, commitments, debt maturities, interest and dividends. The Company’s business is capital intensive, with a majority of this capital funded by cash flows from operations. The Company also obtains funds from external sources, primarily in the debt markets and through short-term commercial paper borrowings, and may also access the equity capital markets as needed or desired to support capital funding requirements. In order to meet short-term liquidity needs, AWCC issues commercial paper that is supported by its revolving credit facility. The Company’s access to external financing on reasonable terms may depend on, as appropriate, any or all of the following: current business conditions, including that of the utility and water utility industry in general; conditions in the debt or equity capital markets; the Company’s credit ratings; and conditions in the national and international economic and geopolitical arenas. Disruptions in the credit markets may discourage lenders from extending the terms of such commitments or agreeing to new commitments. Market disruptions may also limit the Company’s ability to issue debt and equity securities in the capital markets. \nIf these unfavorable business, market, financial and other conditions deteriorate to the extent that the Company is no longer able to access the commercial paper and/or capital markets on reasonable terms, AWCC has access to an unsecured revolving credit facility. The Company’s revolving credit facility provides $2.75 billion in aggregate total commitments from a diversified group of financial institutions. AWCC’s revolving credit facility is used principally to support its commercial paper program, to provide additional liquidity support, and to provide a sub-limit for the issuance of up to $150 million in letters of credit. The maximum aggregate principal amount of short-term borrowings authorized for issuance under AWCC’s commercial paper program is $2.60 billion. On October 28, 2024, the termination date of the credit agreement with respect to AWCC’s revolving credit facility was extended, as permitted by the terms of the credit agreement, from October 2028 to October 2029. Subject to satisfying certain conditions, the credit agreement also permits AWCC to increase the maximum commitment under the facility by up to an aggregate of $500 million. As of December 31, 2024, AWCC had no outstanding borrowings and $82 million of outstanding letters of credit under its revolving credit facility, with $1.8 billion available to fulfill its short-term liquidity needs and to issue letters of credit. \nThe Company believes that its ability to access the debt and equity capital markets, the revolving credit facility and cash flows from operations will generate sufficient cash to fund the Company’s short-term requirements. The Company believes it has sufficient liquidity and the ability to manage its expenditures, should there be a disruption of the capital and credit markets. However, there can be no assurance that the lenders will be able to meet existing commitments to AWCC under the revolving credit facility, or that AWCC will be able to access the commercial paper or loan markets in the future on acceptable terms or at all.\nCash Flows from Operating Activities\nCash flows from operating activities primarily result from the sale of water and wastewater services and, due to the seasonality of demand, are generally greater during the warmer months. The Company’s future cash flows from operating activities will be affected by, among other things: customers’ ability to pay for service in a timely manner, economic utility regulation, inflation, compliance with environmental, health and safety standards, production costs, maintenance costs, customer growth, declining customer usage of water, employee-related costs, including pension funding, weather and seasonality, taxes and overall economic conditions. The Company’s current liabilities may exceed current assets mainly from debt maturities due within one year and the use of short-term debt as a funding source, primarily to meet scheduled maturities of long-term debt, fund acquisitions and construction projects, as well as cash needs, which can fluctuate significantly due to the seasonality of the business and other factors. The Company addresses cash timing differences primarily through its short-term liquidity funding mechanisms.\n63\nTable of Contents\nPresented in the table below is a summary of the major items affecting the Company’s cash flows from operating activities:\n \nFor the Years Ended December 31,\n(In millions)\n2024\n2023\n2022\nNet income\n$\n1,051 \n$\n944 \n$\n820 \nAdd (less):\n \n \n \nDepreciation and amortization\n788 \n704 \n649 \nDeferred income taxes and amortization of investment tax credits\n156 \n208 \n80 \nOther non-cash activities (a)\n62 \n(9)\n(16)\nChanges in assets and liabilities (b)\n40 \n76 \n(355)\nPension and non-pension postretirement benefit contributions\n(52)\n(49)\n(51)\nGain on sale of businesses\n— \n— \n(19)\nNet cash provided by operating activities\n$\n2,045 \n$\n1,874 \n$\n1,108 \n(a)\nIncludes provision for losses on accounts receivable, pension and non-pension postretirement benefits and other non-cash, net. Details of each component can be found on the Consolidated Statements of Cash Flows.\n(b)\nChanges in assets and liabilities include changes to receivables and unbilled revenues, income tax receivable, accounts payable, accrued liabilities, accrued taxes and other assets and liabilities, net.\nIn 2024, cash flows provided by operating activities increased $171 million, primarily due to an increase in net income and depreciation, partially offset by changes in deferred income taxes.\nThe Company expects to make pension contributions to the plan trusts of $44 million in 2025. Actual amounts contributed could change materially from this estimate as a result of changes in assumptions and actual investment returns, among other factors.\nCash Flows from Investing Activities\nPresented in the table below is a summary of the major items affecting the Company’s cash flows from investing activities:\n \nFor the Years Ended December 31,\n(In millions)\n2024\n2023\n2022\nCapital expenditures\n$\n(2,856)\n$\n(2,575)\n$\n(2,297)\nAcquisitions, net of cash acquired\n(417)\n(81)\n(315)\nProceeds from sale of assets, net of cash on hand\n— \n— \n608 \nRemoval costs from property, plant and equipment retirements, net\n(152)\n(159)\n(123)\nPurchases of available-for-sale fixed-income securities\n(135)\n— \n— \nProceeds from sales and maturities of available-for-sale fixed-income securities\n181 \n— \n— \nNet cash used in investing activities\n$\n(3,379)\n$\n(2,815)\n$\n(2,127)\nIn 2024, cash flows used in investing activities increased $564 million as a result of increased payments for capital expenditures and acquisitions in 2024. The Company continues to invest across all infrastructure categories, mainly replacement and renewal of transmission and distribution and services, meter and fire hydrants infrastructure in the Company’s Regulated Businesses, as discussed below. \nThe Company’s infrastructure investment plan consists of both infrastructure renewal programs, where the Company replaces mains, services, meters, hydrants and valves, as needed, and major capital investment projects, where the Company constructs new water and wastewater treatment and delivery facilities to meet new customer growth, and meet new or updated environmental and water quality regulations. The Company’s projected capital expenditures and other investments are subject to periodic review and revision to reflect changes in economic conditions and other factors.\n64\nTable of Contents\nPresented in the table below is a summary of the Company’s capital expenditures by category:\n \nFor the Years Ended December 31,\n(In millions)\n2024\n2023\n2022\nTransmission and distribution\n$\n882 \n$\n922 \n$\n901 \nTreatment and pumping\n305 \n322 \n190 \nServices, meter and fire hydrants\n805 \n652 \n546 \nGeneral structure and equipment\n425 \n333 \n380 \nSources of supply\n163 \n88 \n95 \nWastewater\n276 \n258 \n185 \nTotal capital expenditures\n$\n2,856 \n$\n2,575 \n$\n2,297 \nIn 2024, the Company’s capital expenditures increased $281 million due to an increase across most infrastructure categories.\nThe Company also grows its business primarily through acquisitions of water and wastewater systems. These acquisitions are generally located in geographic proximity to the Company’s existing Regulated Businesses and support continued geographical diversification and growth of its operations. Generally, acquisitions are funded initially with short-term debt, and later refinanced with long-term financing. During 2024, the Company paid $417 million to fund acquisitions, including deposits for pending acquisitions. The Company closed on 13 acquisitions of various regulated water and wastewater systems during 2024, which added approximately 69,500 water and wastewater customers.\nAs previously noted, over the next five years the Company expects to invest between $17 billion to $18 billion, with $15.5 billion to $16 billion for infrastructure improvements in the Regulated Businesses, and the Company expects to invest between $40 billion to $42 billion over the next 10 years. In 2025, the Company expects to invest $3.3 billion, consisting of infrastructure improvements and acquisitions in the Regulated Businesses.\nCash Flows from Financing Activities\nPresented in the table below is a summary of the major items affecting the Company’s cash flows from financing activities:\nFor the Years Ended December 31,\n(In millions)\n2024\n2023\n2022\nProceeds from long-term debt\n$\n1,437 \n$\n1,264 \n$\n822 \nRepayments of long-term debt\n(475)\n(282)\n(15)\nNet proceeds from common stock financing\n— \n1,688 \n— \nNet short-term borrowings (repayments) with maturities less than three months\n700 \n(996)\n591 \nDebt issuance costs\n(14)\n(16)\n(7)\nDividends paid\n(585)\n(532)\n(467)\nOther financing activities, net \n(a)\n47 \n62 \n76 \nNet cash provided by financing activities\n$\n1,110 \n$\n1,188 \n$\n1,000 \n(a)\nIncludes proceeds from issuances of common stock under various employee stock plans and the Company’s dividend reinvestment and direct stock purchase plan, net of taxes paid, and advances and contributions in aid of construction, net of refunds.\nIn 2024, cash flows provided by financing activities decreased $78 million, primarily due to the repayment of long-term debt in the current period and the proceeds from the common stock financing in March 2023. These decreases were partially offset by a higher issuance of long-term debt and an increase in short-term commercial paper borrowings in the current year.\n65\nTable of Contents\nThe Company’s financing activities are primarily focused on funding regulated infrastructure expenditures, regulated acquisitions and payment of dividends. These activities included the issuance of long-term and short-term debt, primarily through AWCC and equity issuances from parent company. Based on the needs of the Regulated Businesses and the Company, AWCC may borrow funds or issue its debt in the capital markets and then, through intercompany loans, provide those borrowings to the Regulated Businesses and parent company. The Regulated Businesses and parent company are obligated to pay their portion of the respective principal and interest to AWCC, in the amount necessary to enable AWCC to meet its debt service obligations. Parent company’s borrowings are not a source of capital for the Regulated Businesses, therefore, parent company is not able to recover the interest charges on its debt through regulated water and wastewater rates. As of December 31, 2024, AWCC has made long-term fixed rate loans and short-term loans to the Regulated Businesses amounting to $9.6 billion. Additionally, as of December 31, 2024, AWCC has made long-term fixed rate loans and short-term loans to parent company amounting to $3.3 billion.\nOn February 23, 2024, AWCC completed a $1.4 billion debt offering, which included the sale of $700 million aggregate principal amount of its 5.150% Senior Notes due 2034 and $700 million aggregate principal amount of its 5.450% Senior Notes due 2054. At the closing of this offering, AWCC received, after deduction of underwriting discounts and before deduction of offering expenses, net proceeds of approximately $1,381 million. AWCC used the net proceeds of the offering (i) to lend funds to American Water and the Regulated Businesses; (ii) to repay at maturity AWCC’s 3.850% Senior Notes due 2024; (iii) to repay AWCC’s commercial paper obligations; and (iv) for general corporate purposes.\nOn March 3, 2023, the Company completed an underwritten public offering of an aggregate of 12,650,000 shares of parent company common stock. Upon closing of this offering, the Company received, after deduction of the underwriting discount and before deduction of offering expenses, net proceeds of approximately $1,688 million. The Company used the net proceeds of the offering to repay short-term commercial paper obligations of AWCC and for general corporate purposes.\nOn June 29, 2023, AWCC issued, in a private placement, $1,035 million aggregate principal amount of the Notes. AWCC received net proceeds of approximately $1,022 million, after deduction of underwriting discounts and commissions but before deduction of offering expenses payable by AWCC. A portion of the net proceeds was used to repay AWCC’s commercial paper obligations and the remainder was used for general corporate purposes. See Note 11—Long-Term Debt in the Notes to Consolidated Financial Statements for additional information.\nOne of the principal market risks to which the Company is exposed is changes in interest rates. In order to manage the exposure, the Company follows risk management policies and procedures, including the use of derivative contracts such as treasury lock agreements. The Company also reduces exposure to interest rates by managing commercial paper and debt maturities. The Company (through AWCC) does not enter into derivative contracts for speculative purposes and does not use leveraged instruments. The derivative contracts entered into are for periods consistent with the related underlying exposures. The Company is exposed to the risk that counterparties to derivative contracts will fail to meet their contractual obligations. The Company minimizes the counterparty credit risk on these transactions by dealing only with leading, creditworthy financial institutions, having long-term credit ratings of “A” or better.\nDuring the second half of 2024, the Company entered into eight treasury lock agreements, with a term of 10 years or 30 years, with notional amounts totaling $355 million, to reduce interest rate exposure on debt expected to be issued in 2025. These treasury lock agreements terminate in June 2025 and December 2025 and have an average fixed interest rate of 4.03%. In 2025, the Company entered into five additional treasury lock agreements, with a term of 10 years, with notional amounts totaling $275 million, to reduce interest rate exposure on debt expected to be issued in 2025. These treasury lock agreements terminate in March 2025 and have an average fixed interest rate of 4.60%. The Company designated these treasury lock agreements as cash flow hedges, with their fair value recorded in accumulated other comprehensive gain or loss.\nThe Company had entered into 15 treasury lock agreements through February 2024, with notional amounts totaling $825 million. The Company designated these treasury lock agreements as cash flow hedges, with their fair value recorded in accumulated other comprehensive gain or loss. In February 2024, the Company terminated the treasury lock agreements realizing a pre-tax net gain of $14 million, to be amortized through Interest expense over a 10-year period or 30-year period, in accordance with the tenor of the notes issued on February 23, 2024.\nNo ineffectiveness was recognized on hedging instruments for the years ended December 31, 2024, 2023 or 2022.\n66\nTable of Contents\nIn February 2024, parent company and AWCC filed with the SEC a universal shelf registration statement that enables the Company to meet its capital needs through the offer and sale to the public from time to time of an unlimited amount of various types of securities, including American Water common stock, preferred stock, and other equity and hybrid securities, and AWCC debt securities, all subject to market conditions and demand, general economic conditions, and as applicable, rating status. The shelf registration statement will expire in February 2027. During 2024 and 2022, $1.4 billion and $800 million, respectively, of debt securities were issued under this and a predecessor registration statement. During 2023, under the predecessor registration statement, parent company issued 12,650,000 shares of its common stock for aggregate net proceeds of approximately $1,688 million.\nPresented in the table below are the issuances of long-term debt in 2024:\nCompany\nType\nRate\nWeighted Average Rate\nMaturity\nAmount \n(in millions)\nAWCC\n (a)\nSenior notes—fixed rate\n5.15%-5.45%\n5.30%\n2034-2054\n$\n1,400 \nOther American Water subsidiaries\nPrivate activity bonds and government funded debt—fixed rate\n0.00%-1.75%\n0.01%\n2025-2061\n46 \nTotal issuances\n \n \n \n$\n1,446 \n(a)\nThis indebtedness is considered “debt” for purposes of a support agreement between parent company and AWCC, which serves as a functional equivalent of a full and unconditional guarantee by parent company of AWCC’s payment obligations under such indebtedness. See “—Issuer and Guarantor of Senior Notes” below.\nPresented in the table below are the retirements and redemptions of long-term debt in 2024 through sinking fund provisions, optional redemption or payment at maturity:\nCompany\nType\nRate\nWeighted Average Rate\nMaturity\nAmount \n(in millions)\nAWCC\nSenior notes—fixed rate\n3.85%\n3.85%\n2024\n$\n400 \nAWCC\nPrivate activity bonds and government funded debt—fixed rate\n1.79%-2.31%\n2.24%\n2024-2031\n1 \nOther American Water subsidiaries\nPrivate activity bonds and government funded debt—fixed rate\n0.00%-5.50%\n1.53%\n2024-2061\n14 \nOther American Water subsidiaries\nMortgage bonds—fixed rate\n6.99%-7.17%\n7.13%\n2024\n60 \nTotal retirements and redemptions\n \n \n \n$\n475 \nFrom time to time and as market conditions warrant, the Company may engage in long-term debt retirements through make-whole redemptions, tender offers, open market repurchases or other viable alternatives.\nIssuer and Guarantor of Senior Notes\nOutstanding unsecured senior notes issued by AWCC (other than the Notes) have been issued under two indentures, each by and between AWCC and Computershare Trust Company, N.A., as successor to Wells Fargo Bank, National Association, as trustee, providing for the rights and obligations of the parties thereto and the holders of the notes issued thereunder. The Notes were issued under an indenture, by and among AWCC, parent company and U.S. Bank Trust Company, National Association, as trustee, providing for the rights and obligations of the parties thereto and the holders of the Notes. The senior notes and the Notes have been issued with the benefit of a support agreement, as amended, between parent company and AWCC, which serves as the functional equivalent of a full and unconditional guarantee by parent company of AWCC’s payment obligations under such indebtedness. No other subsidiary of parent company provides guarantees for any of such indebtedness. If AWCC is unable to make timely payment of any interest, principal or premium, if any, on such senior notes or the Notes, parent company will provide to AWCC, at its request or the request of any holder thereof, funds to make such payment in full. If AWCC fails or refuses to take timely action to enforce certain rights under the support agreement or if AWCC defaults in the timely payment of any amounts owed to any such holder, when due, the support agreement provides that such holder may proceed directly against parent company to enforce such rights or to obtain payment of the defaulted amounts owed to that holder.\n67\nTable of Contents\nAs a wholly owned finance subsidiary of parent company, AWCC has no significant assets other than obligations of parent company and certain of its subsidiaries in its Regulated Businesses segment to repay certain intercompany loans made to them by AWCC. AWCC’s ability to make payments of amounts owed to holders of the senior notes and the Notes will be dependent upon AWCC’s receipt of sufficient payments of amounts owed pursuant to the terms of such intercompany loans and from its ability to issue indebtedness or otherwise obtain loans in the future, the proceeds of which would be used to fund the repayment of the senior notes and the Notes.\nBecause parent company is a holding company and substantially all of its operations are conducted through its subsidiaries other than AWCC, parent company’s ability to fulfill its obligations under the support agreement will be dependent upon its receipt of sufficient cash dividends or distributions from its operating subsidiaries. See Note 9—Shareholders’ Equity—Dividends and Distributions, in the Notes to the Consolidated Financial Statements for a summary of the limitations on parent company and its subsidiaries to pay dividends or make distributions. Furthermore, parent company’s operating subsidiaries are separate and distinct legal entities and, other than AWCC, have no obligation to make any payments on the senior notes or the Notes or to make available or provide any funds for such payment, other than through their repayment obligations under intercompany loans, if any, with AWCC. Based on the foregoing, parent company’s obligations under the support agreement will be effectively subordinated to all indebtedness and other liabilities, including trade payables, lease commitments and moneys borrowed or other indebtedness incurred or issued by parent company’s subsidiaries other than AWCC.\nCredit Facilities and Short-Term Debt\nInterest rates on advances under the AWCC revolving credit facility are based on a credit spread to the Secured Overnight Financing Rate (“SOFR”) rate (or applicable market replacement rate) or base rate, each determined in accordance with Moody’s Ratings and S&P Global Ratings’ then applicable credit rating on AWCC’s senior unsecured, non-credit enhanced debt. The facility is used principally to support AWCC’s commercial paper program, to provide additional liquidity support and to provide a sub-limit of up to $150 million for letters of credit. Indebtedness under the facility and AWCC’s commercial paper are considered “debt” for purposes of a support agreement between parent company and AWCC, which serves as a functional equivalent of a full and unconditional guarantee by parent company of AWCC’s payment obligations thereunder.\nPresented in the tables below are the aggregate credit facility commitments, commercial paper limit and letter of credit availability under the revolving credit facility, as well as the available capacity for each, as of December 31:\n2024\n(In millions)\nCommercial Paper Limit\nLetters of Credit\nTotal (a)\nTotal availability\n$\n2,600 \n$\n150 \n$\n2,750 \nOutstanding debt\n(880)\n(82)\n(962)\nRemaining availability as of December 31, 2024\n$\n1,720 \n$\n68 \n$\n1,788 \n(a)\nTotal remaining availability of $1.8 billion as of December 31, 2024, was accessible through revolver draws.\n2023\n(In millions)\nCommercial Paper Limit\nLetters of Credit\nTotal (a)\nTotal availability\n$\n2,600 \n$\n150 \n$\n2,750 \nOutstanding debt\n(180)\n(75)\n(255)\nRemaining availability as of December 31, 2023\n$\n2,420 \n$\n75 \n$\n2,495 \n(a)\nTotal remaining availability of $2.5 billion as of December 31, 2023, was accessible through revolver draws.\nPresented in the table below is the Company’s total available liquidity as of December 31, 2024 and 2023:\n(In millions)\nCash and Cash Equivalents\nAvailability on Revolving Credit Facility\nTotal Available Liquidity\nAvailable liquidity as of December 31, 2024\n$\n96 \n$\n1,788 \n$\n1,884 \nAvailable liquidity as of December 31, 2023\n$\n330 \n$\n2,495 \n$\n2,825 \nThe weighted average interest rate on AWCC’s outstanding short-term borrowings was approximately 4.65% and 5.51%, for the years ended December 31, 2024 and 2023, respectively.\n68\nTable of Contents\nCapital Structure\nPresented in the table below is the percentage of the Company’s capitalization represented by the components of its capital structure as of December 31:\n \n2024\n2023\n2022\nTotal common shareholders’ equity\n42.4 \n%\n44.2 \n%\n38.3 \n%\nLong-term debt and redeemable preferred stock at redemption value\n51.4 \n%\n52.9 \n%\n54.4 \n%\nShort-term debt and current portion of long-term debt\n6.2 \n%\n2.9 \n%\n7.3 \n%\nTotal\n100 \n%\n100 \n%\n100 \n%\nThe change in the capital structure mix in 2024 is mainly attributable to the increase in short-term commercial paper borrowings. The use of the proceeds from the common stock issuance on March 3, 2023, and the long-term debt issuance on June 29, 2023, reduced short-term commercial paper borrowings in 2023.\nDebt Covenants\nThe Company’s debt agreements contain financial and non-financial covenants. To the extent that the Company is not in compliance with these covenants, an event of default may occur under one or more debt agreements and the Company, or its subsidiaries, may be restricted in its ability to pay dividends, issue new debt or access the revolving credit facility. The long-term debt indentures contain a number of covenants that, among other things, prohibit or restrict the Company from issuing debt secured by the Company’s assets, subject to certain exceptions. Failure to comply with any of these covenants could accelerate repayment obligations.\nCovenants in certain long-term notes and the revolving credit facility require the Company to maintain a ratio of consolidated debt to consolidated capitalization (as defined in the relevant documents) of not more than 0.70 to 1.00. On December 31, 2024, the Company’s ratio was 0.58 to 1.00 and therefore the Company was in compliance with the covenants.\nSecurity Ratings\nPresented in the table below are long-term and short-term credit ratings and rating outlooks as of February 19, 2025, as issued by Moody’s Ratings on January 23, 2025, and S&P Global Ratings on March 4, 2024:\nSecurities\nMoody’s Ratings\nS&P Global Ratings\nRating outlook\nStable\nStable\nSenior unsecured debt\nBaa1\nA\nCommercial paper\nP-2\nA-1\nA security rating is not a recommendation to buy, sell or hold securities and may be subject to revision or withdrawal at any time by the assigning rating agency, and each rating should be evaluated independently of any other rating. Security ratings are highly dependent upon the ability to generate cash flows in an amount sufficient to service debt and meet investment plans. The Company can provide no assurances that its ability to generate cash flows is sufficient to maintain its existing ratings. The Company does not have any material borrowings that are subject to default or prepayment as a result of the downgrading of these security ratings, although such a downgrading could increase fees and interest charges under its credit facility.\nAs part of its normal course of business, the Company routinely enters into contracts for the purchase and sale of water, power and other fuel, chemicals and other services. These contracts either contain express provisions or otherwise permit the Company and its counterparties to demand adequate assurance of future performance when there are reasonable grounds for doing so. In accordance with the contracts and applicable contract law, if the Company is downgraded by a credit rating agency, especially if such downgrade is to a level below investment grade, it is possible that a counterparty would attempt to rely on such a downgrade as a basis for making a demand for adequate assurance of future performance, which could include a demand that the Company must provide collateral to secure its obligations. The Company does not expect to post any collateral which will have a material adverse impact on the Company’s results of operations, financial position or cash flows.\n69\nTable of Contents\nAccess to the capital markets, including the commercial paper market, and respective financing costs in those markets, may be directly affected by the Company’s securities ratings. The Company primarily accesses the debt capital markets, including the commercial paper market, through AWCC. However, the Company has also issued debt through its regulated subsidiaries, primarily in the form of mortgage bonds and tax exempt securities or borrowings under state revolving funds, to lower the overall cost of debt.\nDividends and Regulatory Restrictions\nFor discussion of the Company’s dividends, dividend restrictions and dividend policy, see Note 9—Shareholders’ Equity in the Notes to Consolidated Financial Statements for additional information.\nInsurance Coverage\nThe Company carries various property, casualty, cyber and financial insurance policies with limits, deductibles and exclusions that it believes are consistent with industry standards. However, insurance coverage may not be adequate or available to cover unanticipated losses or claims. Additionally, annual policy renewals can be impacted by claims experience or adverse insurance market trends which in turn can impact coverage terms and conditions on a going-forward basis. The Company is self-insured to the extent that losses are within the policy deductible or exceed the amount of insurance maintained. Such losses could have a material adverse effect on the Company’s short-term and long-term financial condition and its results of operations and cash flows.\nCritical Accounting Policies and Estimates\nThe preparation of financial statements in conformity with GAAP requires that management apply accounting policies and develop estimates, assumptions and judgments that could affect the Company’s financial condition, results of operations and cash flows. Actual results could differ from these estimates, assumptions and judgments. Management believes that the areas described below require significant judgment in the application of accounting policy or in making estimates and assumptions in matters that are inherently uncertain and that may change in subsequent periods. Accordingly, changes in the estimates, assumptions and judgments applied to these accounting policies could have a significant impact on the Company’s financial condition, results of operations and cash flows, as reflected in the Company’s Consolidated Financial Statements. Management has reviewed the critical accounting polices described below with the Company’s Audit, Finance and Risk Committee, including the estimates, assumptions and judgments used in their application. Additional discussion regarding these critical accounting policies and their application can be found in Note 2—Significant Accounting Policies in the Notes to Consolidated Financial Statements.\nRegulation and Regulatory Accounting\nThe Company’s regulated utilities are subject to regulation by PUCs and, as such, the Company follows the authoritative accounting principles required for rate regulated utilities, which requires the Company to reflect the effects of rate regulation in its Consolidated Financial Statements. Use of this authoritative guidance is applicable to utility operations that meet the following criteria: (i) third-party regulation of rates; (ii) cost-based rates; and (iii) a reasonable assumption that rates will be set to recover the estimated costs of providing service, plus a return on net investment, or rate base. As of December 31, 2024, the Company concluded that the operations of its utilities met the criteria.\nApplication of this authoritative guidance has a further effect on the Company’s financial statements as it pertains to allowable costs used in the ratemaking process. The Company makes significant assumptions and estimates to quantify amounts recorded as regulatory assets and liabilities. Such judgments include, but are not limited to, assets and liabilities related to regulated acquisitions, pension and postretirement benefits, depreciation rates and taxes. Due to timing and other differences in the collection of revenues, these authoritative accounting principles allow a cost that would otherwise be charged as an expense by a non-regulated entity, to be deferred as a regulatory asset if it is probable that such cost is recoverable through future rates. Conversely, the principles require the creation of a regulatory liability for amounts collected in rates to recover costs expected to be incurred in the future, or amounts collected in excess of costs incurred and are refundable to customers.\nFor each regulatory jurisdiction where the Company conducts business, the Company assesses, at the end of each reporting period, whether the regulatory assets continue to meet the criteria for probable future recovery and regulatory liabilities continue to meet the criteria for probable future settlement. This assessment includes consideration of factors such as changes in regulatory environments, recent rate orders (including recent rate orders on recovery of a specific or similar incurred cost to other regulated entities in the same jurisdiction) and the status of any pending or potential legislation. If subsequent events indicate that the regulatory assets or liabilities no longer meet the criteria for probable future recovery or probable future settlement, the Company’s Consolidated Statements of Operations and financial position could be materially affected. In addition, if the Company concludes in a future period that a separable portion of the business no longer meets the criteria, the Company is required to eliminate the financial statement effects of regulation for that part of the business, which would include the elimination of any or all regulatory assets and liabilities that had been recorded in the Consolidated Financial Statements. Failure to meet the criteria of this authoritative guidance could materially impact the Company’s Consolidated Financial Statements.\n70\nTable of Contents\nAs of December 31, 2024 and 2023, the Company’s regulatory asset balance was $1.2 billion and $1.1 billion, respectively, and its regulatory liability balance was $1.4 billion and $1.5 billion, respectively. See Note 3—Regulatory Matters in the Notes to Consolidated Financial Statements for further information regarding the Company’s significant regulatory assets and liabilities.\nAccounting for Income Taxes\nSignificant management judgment is required in determining the provision for income taxes, primarily due to the uncertainty related to tax positions taken, as well as deferred tax assets and liabilities, valuation allowances and the utilization of net operating loss carryforwards.\nIn accordance with applicable authoritative guidance, the Company accounts for uncertain income tax positions using a benefit recognition model with a two-step approach, including a more-likely-than-not recognition threshold and a measurement approach based on the largest amount of tax benefit that is greater than 50% likely of being realized upon ultimate settlement. If it is not more-likely-than-not that the benefit of the tax position will be sustained on its technical merits, no benefit is recorded. Uncertain tax positions that relate only to timing of when an item is included on a tax return are considered to have met the recognition threshold. Management evaluates each position based solely on the technical merits and facts and circumstances of the position, assuming the position will be examined by a taxing authority having full knowledge of all relevant information. Significant judgment is required to determine whether the recognition threshold has been met and, if so, the appropriate amount of unrecognized tax benefit to be recorded in the Consolidated Financial Statements.\nThe Company evaluates the probability of realizing deferred tax assets quarterly by reviewing a forecast of future taxable income and its intent and ability to implement tax planning strategies, if necessary, to realize deferred tax assets. The Company also assesses its ability to utilize tax attributes, including those in the form of carryforwards, for which the benefits have already been reflected in the financial statements. The Company records valuation allowances for deferred tax assets when it concludes that it is more-likely-than-not such benefit will not be realized in future periods.\nUnder GAAP, specifically Accounting Standards Codification (“ASC 740”), \nIncome Taxes\n, the tax effects of changes in tax laws must be recognized in the period in which the law is enacted. ASC 740 also requires deferred tax assets and liabilities to be measured at the enacted tax rate expected to apply when temporary differences are to be realized or settled. For the Company’s regulated entities, the change in deferred taxes are recorded as either an offset to a regulatory asset or a regulatory liability and may be subject to refund to customers. For the Company’s unregulated operations, the change in deferred taxes are recorded as a non-cash re-measurement adjustment to earnings.\nActual income taxes could vary from estimated amounts due to the future impacts of various items, including changes in income tax laws, the Company’s forecasted financial condition and results of operations, failure to successfully implement tax planning strategies and recovery of taxes through the regulatory process for the Regulated Businesses, as well as results of audits and examinations of filed tax returns by taxing authorities. The resulting tax balances as of December 31, 2024 and 2023, are appropriately accounted for in accordance with the applicable authoritative guidance; however, the ultimate outcome of tax matters could result in favorable or unfavorable adjustments to the Consolidated Financial Statements and such adjustments could be material. See Note 14—Income Taxes in the Notes to Consolidated Financial Statements for additional information regarding income taxes.\nAccounting for Pension and Postretirement Benefits\nThe Company maintains noncontributory defined benefit pension plans covering eligible employees of its regulated utility and shared services operations. The Company also maintains other postretirement benefit plans providing medical and life insurance to eligible retirees. See Note 2—Significant Accounting Policies and Note 15—Employee Benefits in the Notes to Consolidated Financial Statements for additional information regarding the description of and accounting for the defined benefit pension plans and postretirement benefit plans.\nThe Company’s pension and postretirement benefit costs are developed from actuarial valuations. Inherent in these valuations are key assumptions provided by the Company to its actuaries, including the discount rate and expected long-term rate of return on plan assets. Material changes in the Company’s pension and postretirement benefit costs may occur in the future due to changes in these assumptions as well as fluctuations in plan assets. The assumptions are selected to represent the average expected experience over time and may differ in any one year from actual experience due to changes in capital markets and the overall economy. These differences will impact the amount of pension and other postretirement benefit expense that the Company recognizes. The primary assumptions are:\n•\nDiscount Rate—The discount rate is used in calculating the present value of benefits, which are based on projections of benefit payments to be made in the future. The objective in selecting the discount rate is to measure the single amount that, if invested at the measurement date in a portfolio of high-quality debt instruments, would provide the necessary future cash flows to pay the accumulated benefits when due.\n71\nTable of Contents\n•\nExpected Return on Plan Assets (“EROA”)—Management projects the future return on plan assets considering prior performance, but primarily based upon the plans’ mix of assets and expectations for the long-term returns on those asset classes. These projected returns reduce the net benefit costs the Company records currently.\n•\nRate of Compensation Increase—Management projects employees’ pay increases, which are used to project employees’ pension benefits at retirement.\n•\nHealth Care Cost Trend Rate—Management projects the expected increases in the cost of health care.\n•\nMortality— Management adopted the Society of Actuaries Pri-2012 base mortality table, the most recent table developed from private pension plan experience, which provides rates of mortality in 2012 and adopted the MP-2021 mortality improvement scale to gradually adjust future mortality rates downward due to increased longevity in each year after 2012.\nThe discount rate assumption, which is determined for the pension and postretirement benefit plans independently, is subject to change each year, consistent with changes in applicable high-quality, long-term corporate bond indices. The Company uses an approach that approximates the process of settlement of obligations tailored to the plans’ expected cash flows by matching the plans’ cash flows to the coupons and expected maturity values of individually selected bonds. For each plan, the discount rate was developed as the level equivalent rate that would yield the same present value as using spot rates aligned with the projected benefit payments. The weighted-average discount rate assumption for determining pension benefit obligations was 5.70%, 5.18% and 5.58% at December 31, 2024, 2023 and 2022, respectively. The weighted-average discount rate assumption for determining other postretirement benefit obligations was 5.69%, 5.22% and 5.60% at December 31, 2024, 2023 and 2022, respectively.\nIn selecting an EROA, the Company considered tax implications, past performance and economic forecasts for the types of investments held by the plans. The weighted-average EROA assumption used in calculating pension cost was 6.73% for 2024, 6.79% for 2023 and 6.50% for 2022. The weighted-average EROA assumption used in calculating other postretirement benefit costs was 5.00% for 2024, 5.00% for 2023 and 3.60% for 2022.\nPresented in the table below are the allocations of the pension plan assets by asset category:\n \n2025 Target Allocation\nPercentage of Plan Assets as of December 31,\nAsset Category\n2024\n2023\nEquity securities\n37 \n%\n44 \n%\n41 \n%\nFixed income\n63 \n%\n56 \n%\n59 \n%\nTotal\n100 \n%\n100 \n%\n100 \n%\nPresented in the table below are the allocations of the other postretirement benefit plan assets by asset category:\n \n2025 Target Allocation (a)\nPercentage of Plan Assets as of December 31,\nAsset Category\n2024\n2023\nEquity securities\n27 \n%\n34 \n%\n32 \n%\nFixed income\n73 \n%\n66 \n%\n68 \n%\nTotal\n100 \n%\n100 \n%\n100 \n%\n(a)\nRefer to Note 15—Employee Benefits in the Notes to Consolidated Financial Statements for additional details on the allocations of assets and the trusts which fund the other postretirement benefit plans\nThe investments of the pension and postretirement welfare plan trusts are invested in a number of separately managed accounts, commingled funds and limited partnerships including equities, fixed income securities, guaranteed annuity contracts with insurance companies, real estate funds and real estate investment trusts. The trustee for the Company’s defined benefit pension and postretirement welfare plans uses an independent valuation firm to calculate the fair value of plan assets.\nIn selecting a rate of compensation increase, the Company considers past experience in light of movements in inflation rates. The Company’s rate of compensation increase was 3.51% for 2024, 2023 and 2022.\nIn selecting health care cost trend rates, the Company considers past performance and forecasts of increases in health care costs. As of \nJanuary 1, \n2024\n,\n the Company’s health care cost trend rate assumption used to calculate the periodic benefit cost was 6.75% in 2024 gradually declining to 5.00% in 2031 and thereafter. As of December 31, 2024, the Company projects that medical inflation will be 6.50% in 2025 gradually declining to 5.00% in 2031 and thereafter.\n72\nTable of Contents\nThe Company will use a weighted-average discount rate and EROA of 5.70% and 6.63%, respectively, for estimating its 2025 pension costs. Additionally, the Company will use a weighted-average discount rate and EROA of 5.69% and 5.00%, respectively, for estimating its 2025 other postretirement benefit costs. A decrease in the discount rate or the EROA would increase the Company’s pension expense. The Company’s 2024 pension and postretirement total net benefit credit was $3 million and the 2023 pension and postretirement total net benefit credit was $6 million. The Company expects to make pension contributions to the plan trusts of $44 million in 2025; however, the actual amounts contributed could change materially from this estimate. The assumptions are reviewed annually and at any interim re-measurement of the plan obligations. The impact of assumption changes is reflected in the recorded pension and postretirement benefit amounts as they occur, or over a period of time if allowed under applicable accounting standards.\nRevenue Recognition\nRevenue from the Company’s Regulated Businesses is generated primarily from water and wastewater services delivered to customers. These contracts contain a single performance obligation, the delivery of water and/or wastewater services, as the promise to transfer the individual good or service is not separately identifiable from other promises within the contracts and, therefore, is not distinct. Revenues are recognized over time, as services are provided. There are generally no significant financing components or variable consideration. Revenues include amounts billed to customers on a cycle basis, and unbilled amounts calculated based on estimated usage from the date of the meter reading associated with the latest customer bill, to the end of the accounting period. The amounts that the Company has a right to invoice are determined by each customer’s actual usage, an indicator that the invoice amount corresponds directly to the value transferred to the customer.\nIncreases or decreases in the volumes delivered to customers and rate mix due to changes in usage patterns in customer classes in the period could be significant to the calculation of unbilled revenue. In addition, changes in the timing of meter reading schedules and the number and type of customers scheduled for each meter reading date would also have an effect on the unbilled revenue calculation. Unbilled revenue for the Company’s regulated utilities as of December 31, 2024 and 2023 was $219 million and $193 million, respectively.\nThe Company also recognizes revenues for certain ratemaking mechanisms that meet the criteria for alternative revenue program accounting. These mechanisms, which include the Company’s revenue stability mechanisms, qualify as alternative revenue programs if they have been authorized for rate recovery, are objectively determinable and probable of recovery, and are expected to be collected within 24 months following the end of the period in which they were recognized. \nThe Company also has long-term, fixed fee contracts to operate and maintain water and wastewater systems for the U.S. government on military installations and facilities owned by municipal customers. Billing and revenue recognition for the fixed fee revenues occurs ratably over the term of the contract, as customers simultaneously receive and consume the benefits provided by the Company. Additionally, these contracts allow the Company to make capital improvements to underlying infrastructure, which are initiated through separate modifications or amendments to the original contract, whereby stand-alone, fixed pricing is separately stated for each improvement. The Company has determined that these capital improvements are separate performance obligations, with revenue recognized over time based on performance completed at the end of each reporting period. Losses on contracts are recognized during the period in which the losses first become probable and estimable. Revenues recognized during the period in excess of billings on construction contracts are recorded as unbilled revenues or other long-term assets, with billings in excess of revenues recorded as other current or long-term liabilities until the recognition criteria are met. Changes in contract performance and related estimated contract profitability may result in revisions to costs and revenues and are recognized in the period in which revisions are determined. Unbilled revenue within Other as of December 31, 2024 and 2023, was $96 million and $109 million, respectively.\nAccounting for Contingencies\nThe Company records loss contingencies when management determines that the outcome of future events is probable of occurring and when the amount of the loss or a range of losses can be reasonably estimated. The determination of a loss contingency is based on management’s judgment and estimates about the likely outcome of the matter, which may include an analysis of different scenarios. Liabilities are recorded or adjusted when events or circumstances cause these judgments or estimates to change. In assessing whether a loss is reasonably possible, management considers many factors, which include, but are not limited to: the nature of the litigation, claim or assessment, review of applicable law, opinions or views of legal counsel and other advisors, and the experience gained from similar cases or situations. The Company provides disclosures for material contingencies when management deems there is a reasonable possibility that a loss or an additional loss may be incurred. The Company provides estimates of reasonably possible losses when such estimates may be reasonably determined, either as a single amount or within a reasonable range.\nActual amounts realized upon settlement or other resolution of loss contingencies may be different than amounts recorded and disclosed and could have a significant impact on the liabilities, revenue and expenses recorded on the Consolidated Financial Statements. See Note 16—Commitments and Contingencies in the Notes to Consolidated Financial Statements for additional information regarding contingencies.\n73\nTable of Contents\nRecent Accounting Standards\nSee Note 2—Significant Accounting Policies in the Notes to Consolidated Financial Statements for a description of recent accounting standards.",
  "item2": null
}