{
  "item1": "Regulated Businesses Company’s ability meet existing future water demands its customers depends adequate water supply. Drought, governmental restrictions, overuse sources water, protection threatened species habitats, contamination other factors may limit availability ground surface water. Company employs variety measures effort obtain adequate sources water supply, both short-term over long-term. geographic diversity Company’s service areas may mitigate some economic effects water supply associated weather extremes Company might encounter any particular service territory.",
  "item7": "2025 Target Allocation (a) Percentage Plan Assets December 31, Refer Note 15—Employee Benefits Notes Consolidated Financial Statements additional details allocations assets trusts which fund other postretirement benefit plans investments pension postretirement welfare plan trusts invested number separately managed accounts, commingled funds limited partnerships including equities, fixed income securities, guaranteed annuity contracts insurance companies, real estate funds real estate investment trusts. trustee Company’s defined benefit pension postretirement welfare plans uses independent valuation firm calculate fair value plan assets. selecting rate compensation increase, Company considers past experience light movements inflation rates. Company’s rate compensation increase 3.51% 2024, 2023 2022.",
  "item2": "Three Months Ended September 30, Nine Months Ended September 30, Operation maintenance Depreciation amortization Provision income taxes Net (loss) income attributable common shareholders three nine months ended September 30, 2025, operating revenues increased $4 million $20 million, respectively, primarily increase capital projects MSG Contract Services Group (“CSG”). Operation Maintenance three months ended September 30, 2025, operation maintenance expense decreased $4 million, primarily due reduced employee-related costs partially offset increased costs associated MSG CSG projects. nine months ended September 30, 2025, operation maintenance expense increased $7 million, primarily due increased costs associated MSG CSG projects partially offset reduced employee-related costs. three nine months ended September 30, 2025, interest expense increased $11 million $20 million, respectively, due higher average commercial paper borrowings."
}