{
  "source_file": "axon-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2. \nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\nThe following discussion and analysis of our financial condition as of September 30, 2025, and results of operations for the three and nine months ended September 30, 2025 and 2024, should be read in conjunction with the unaudited consolidated financial statements and related notes included in this Quarterly Report on Form 10-Q and the audited consolidated financial statements and related notes in our amended 2024 Annual Report on Form 10-K/A for the year ended December 31, 2024, filed with the SEC on May 7, 2025. The discussion includes references to non-GAAP financial measures, such as adjusted gross margin, which supplement our GAAP results by providing additional insight into our financial and operational performance. For definitions and reconciliations of these non-GAAP measures to the most directly comparable GAAP measures, refer to “Non-GAAP Measures” within this Quarterly Report on Form 10-Q. This discussion also contains forward-looking statements that involve risks and uncertainties. Our actual results may differ materially from those anticipated in such forward-looking statements as a result of certain factors, including but not limited to those described under “Part II, Item 1A. Risk Factors.” See also “Special Note Regarding Forward-Looking Statements” on page ii of this Quarterly Report on Form 10-Q.\nOverview\nAxon is a technology leader in global public safety. Our moonshot goal is to cut gun-related deaths between police and the public in the United States in half by 2033. Axon is building the public safety operating system of the future by integrating a suite of hardware devices and cloud software solutions that not only revolutionize modern policing but also cater to federal agencies, corrections, justice and enterprise-level security needs. Axon’s suite includes cloud-hosted digital evidence management solutions, productivity and real-time operations software, body cameras, in-car cameras, TASER energy devices, drone and robotic security, and training solutions. Our financial results are reported in two reportable segments, Connected Devices and Software and Services.\nOur revenues for the three months ended September 30, 2025 were $710.6 million, an increase of $166.4 million, or 30.6%, from the three months ended September 30, 2024. We had loss from operations of $2.1 million, compared to income from operations of $24.1 million for the same period in the prior year. Gross margin dollars increased $\n96.6\n million and decreased as a percentage of revenue to 60.1% from 60.8% compared to the three months ended September 30, 2024. Adjusted gross margin decreased to 62.7% for the three months ended September 30, 2025 compared to 63.2% for the same period in the prior year, primarily driven by global tariffs and a higher mix of Platform Solutions revenue, partially offset by Software and Services. Operating expenses increased by $122.8 million, reflecting increased headcount to support business growth and stock-based compensation expense. Net loss of $2.2 million included a $17.9 million tax provision, net realized and unrealized gains of \n$14.6\n million related to our strategic investments, and a net realized and unrealized gain of $8.3 million related to our marketable securities. Net income of $67.0 million for the three months ended September 30, 2024 included a noncash unrealized gain of $44.0 million on our investment in marketable securities.\nOur revenues for the nine months ended September 30, 2025 were $2.0 billion, an increase of $475.4 million, or 31.5%, from the nine months ended September 30, 2024. We had loss from operations of $12.0 million, compared to income from operations of $74.3 million for the same period in the prior year. Gross margin dollars increased $301.3 million and increased as a percentage of revenue to 60.4% from 59.4% compared to the nine months ended September 30, 2024. The increase was primarily driven by leverage on stock-based compensation expense and intangibles amortization. Adjusted gross margin remained consistent at 63.2%\n for the nine months ended September 30, 2025 compared to the same period in the prior year. Operating expenses increased by $387.6 million, reflecting increased headcount to support business growth and stock-based compensation expense. Net income of $121.9 million included net realized and unrealized gains of $180.6 million related to our strategic investments and a $36.7 million tax benefit, partially offset by a net realized and unrealized loss of 46.0 million related to our marketable securities and inducement expense of $28.7 million associated with the early repurchase of a portion of our 2027 Notes, as discussed further within Note 10. Net income of $241.9 million for the nine months ended September 30, 2024 included a realized gain of $42.3 million related to our acquisition in Fusus, unrealized gains of $76.2 million related to our strategic investments, and a noncash unrealized gain of $73.6 million on our investment in marketable securities.\n33\nTable of Contents\nResults of Operations\nThree Months Ended September 30, 2025 Compared to the Three Months Ended September 30, 2024\nThe following table presents data from our \nconsolidated statements of operations and comprehensive income (loss)\n as well \nas the percentage relationship to total net sales of items included in our consolidated statements of operations and comprehensive income (loss) (dollars in thousands):\nThree Months Ended September 30,\n2025\n2024\nNet sales from products\n$\n405,399\n57.0 \n%\n$\n327,900\n60.2 \n%\nNet sales from services\n305,242\n43.0 \n216,374\n39.8 \nNet sales\n710,641\n100.0 \n544,274\n100.0 \nCost of product sales\n203,173\n28.6 \n156,167\n28.7 \nCost of services sales\n80,120\n11.3 \n57,360\n10.5 \nCost of sales\n283,293\n39.9 \n213,527\n39.2 \nGross margin\n427,348\n60.1 \n330,747\n60.8 \nOperating expenses:\nSelling, general and administrative\n252,803\n35.6 \n192,189\n35.3 \nResearch and development\n176,674\n24.8 \n114,477\n21.0 \nTotal operating expenses\n429,477\n60.4 \n306,666\n56.3 \nIncome (loss) from operations\n(2,129)\n(0.3)\n24,081\n4.5 \nInterest income\n23,941\n3.4 \n12,624\n2.3 \nInterest expense\n(28,912)\n(4.1)\n(1,646)\n(0.3)\nOther income, net\n22,803\n3.2 \n44,510\n8.1 \nIncome before provision for income taxes\n15,703\n2.2 \n79,569\n14.6 \nProvision for (benefit from) income taxes\n17,889\n2.5 \n12,544\n2.3 \nNet income (loss)\n$\n(2,186)\n(0.3)\n%\n$\n67,025\n12.3 \n%\nThe following table presents our revenues disaggregated by geography (dollars in thousands):\nThree Months Ended September 30,\n2025\n2024\nUnited States\n$\n593,939 \n84 \n%\n$\n482,596 \n89 \n%\nOther countries\n116,702 \n16 \n61,678 \n11 \nTotal\n$\n710,641 \n100 \n%\n$\n544,274 \n100 \n%\nInternational revenue increased compared to the prior year September 30, 2024\n \ncomparative period, primarily driven by increased sales in our EMEA region.\n34\nTable of Contents\nNet Sales\nNet sales by product line were as follows (dollars in thousands):\nThree Months Ended September 30,\nDollar\nChange\nPercent\nChange\n2025\n2024\nConnected Devices segment:\nTASER \n(1)\n$\n237,950 \n33.5 \n%\n$\n203,612 \n37.4 \n%\n$\n34,338 \n16.9 \n%\nPersonal Sensors \n(2)\n106,677 \n15.0 \n88,660 \n16.3 \n18,017 \n20.3 \nPlatform Solutions \n(3)\n60,772 \n8.5 \n35,628 \n6.5 \n25,144 \n70.6 \nTotal Connected Devices segment\n405,399 \n57.0 \n327,900 \n60.2 \n77,499 \n23.6 \nTotal Software and Services segment\n305,242 \n43.0 \n216,374 \n39.8 \n88,868 \n41.1 \nTotal net sales\n$\n710,641 \n100.0 \n%\n$\n544,274 \n100.0 \n%\n$\n166,367 \n30.6 \n%\n \n(1)\n'TASER' includes TASER handles, cartridges and related extended warranties.\n(2)\n'Personal Sensors' primarily includes body cameras and accessories, signal sidearm, and related extended warranties.  \n(3)\n'Platform Solutions' primarily includes interview room, fleet in-car video, fixed cameras, drones and counter-drone equipment, virtual reality training hardware, and related extended warranties.\nNet sa\nles for the Connected Devices segment increased 23.6% for the three months ended September 30, 2025 as compared to the three months ended September 30, 2024. The increase of $34.3 million in TASER is primarily driven by higher TASER 10 handle and cartridge volume. Personal Sensors increased $18.0 million on continued adoption of our newest body camera, AB4, and higher warranty revenue from more devices in the field. The $25.1 million increase in Platform Solutions is primarily driven by higher volume for counter-drone equipment, virtual reality training, and fleet systems.\nNet sales for the Software and Services segment increased 41.1% for the three months ended September 30, 2025 as compared to the three months ended September 30, 2024. The increase in the aggregate number of users and growing adoption of our premium add-on features by existing customers drove the majority of the increase of $88.9 million.\nGross Margin\nAs a percentage of net sales, gross margin for the Connected Devices segment decreased to 49.9% from 52.4% for the three months ended September 30, 2025 and 2024, respectively. Adjusted gross margin for the Connected Devices segment, which excludes stock-based compensation expense and acquired intangibles amortization, was 52.1% for the three months ended September 30, 2025, compared to 54.5% for the three months ended September 30, 2024. The decrease is primarily driven by global tariffs and higher mix of Platform Solutions revenue.\nAs a percentage of net sales, gross margin for the Software and Services segment increased to 73.8% from 73.5% for the three months ended September 30, 2025 and 2024, respectively. Adjusted gross margin for the Software and Services segment, which excludes stock-based compensation expense and acquired intangibles amortization, increased to 76.8% for the three months ended September 30, 2025, compared to 76.3% for the three months ended September 30, 2024. The increase was primarily driven by higher software mix. \nSelling, General and Administrative Expenses\nSG&A expenses were comprised as follows (dollars in thousands):\nThree Months Ended September 30,\nDollar\nChange\nPercent\nChange\n2025\n2024\nTotal selling, general and administrative expenses\n$\n252,803 \n$\n192,189 \n$\n60,614 \n31.5 \n%\nAs a percentage of net sales\n35.6%\n35.3%\n \n \nStock-based compensation expense increased $19.8 million in comparison to the prior year \nSeptember 30, 2024\n comparable period, which was primarily related to the 2024 Employee XSP and the 2024 CEO Performance Award that were approved by shareholders in the 2024 Annual Meeting of Shareholders and increased headcount.\n35\nTable of Contents\nSalaries, benefits and bonus expense increased $17.3 million in comparison to the prior year September 30, 2024 comparable period, which was primarily attributable to an increase in headcount and higher wages. \nSales and marketing expense\n increased $5.1 million in comparison to the prior year September 30, 2024 comparable period, which was primarily attributable to increased commissions.\nOther SG&A expenses increased $18.4 million in comparison to the prior year\n September 30, 2024 comparable period\n, primarily driven by an increase in professional and consulting expenses of $12.0 million and an increase in travel expenses of $4.0 million.\nResearch and Development Expenses\nR&D expenses were comprised as follows (dollars in thousands):\nThree Months Ended September 30,\nDollar\nChange\nPercent\nChange\n2025\n2024\nTotal research and development expenses\n$\n176,674\n$\n114,477\n$\n62,197\n54.3 \n%\nAs a percentage of net sales\n24.9 \n%\n21.0 \n%\nStock-based compensation e\nxpense increased $22.0 million in comparison to the prior year September 30, 2024 comparable period, which was primarily related to the 2024 Employee XSP that was approved by shareholders in the 2024 Annual Meeting of Shareholders and increased headcount.\nSalaries, benefits and bonus expense increased $19.1 million in comparison to the prior year September 30, 2024 comparable period, which was primarily attributable to an increase in headcount and higher wages.\nOther R&D expenses increased $\n21.1 \nmillion in comparison to the prior year September 30, 2024 comparable period, partially driven by an increase in professional and consulting expenses of $\n9.2 \nmillion.\nInterest Income (Loss), Net\nInterest income (loss), net, was as follows (in thousands):\nThree Months Ended September 30,\n2025\n2024\nInterest income\n$\n23,941 \n$\n12,624 \nInterest expense \n(1)\n(28,912)\n(1,646)\nTotal interest income (loss), net\n$\n(4,971)\n$\n10,978 \n(1)\nInterest expense increased in comparison to the prior year September 30, 2024 comparable period primarily as a result of the issuance of the Senior Notes in March 2025, as discussed further within Note 10.\n36\nTable of Contents\nOther Income, Net\nOther income, net\n, was as follows (in thousands):\nThree Months Ended September 30,\n2025\n2024\nRealized and unrealized gain on fair value adjustments of strategic investments, net\n$\n14,618 \n$\n449 \nRealized and unrealized gain on marketable securities, net \n(1)\n8,275 \n44,010 \nLoss on foreign currency transactions, net\n(160)\n(233)\nOther, net\n70 \n284 \nOther income, net\n$\n22,803 \n$\n44,510 \n(1)\nReflects the net realized and unrealized gain on marketable securities, during the three months ended September 30, 2025, as discussed within Note 3.\nProvision for Income Taxes\n The effective tax rate was 113.9%, for the three months ended September 30, 2025, compared to 15.8% for the three months ended September 30, 2024.  The increase in tax provision is driven by lower pre-tax book income in the current period, magnifying the impact of permanent and discrete items. The major driver of the increase in rate was the enactment of the OBBBA in the quarter, which resulted in a reduction of our R&D tax credit, partially offset by the net tax benefit related to stock-based compensation.\nProvision for income taxes and effective tax rates were as follows (dollars in thousands):\nThree Months Ended September 30,\n2025\n2024\nChange\nIncome before provision for income taxes\n$\n15,703 \n$\n79,569 \n$\n(63,866)\nProvision for income taxes\n$\n17,889 \n$\n12,544 \n$\n5,345 \nEffective tax rate\n113.9 \n%\n15.8 \n%\nNet Income (Loss)\nWe recorded net loss of $2.2 million for the three months ended September 30, 2025 compared to net income of $67.0 million for the three months ended September 30, 2024. Net income (loss) per basic share was $(0.03) for the three months ended September 30, 2025 compared to $0.89 for the three months ended September 30, 2024. Net income (loss) per diluted share was $(0.03) for the three months ended September 30, 2025 compared to $0.86 for the three months ended September 30, 2024.\n37\nTable of Contents\nNine Months Ended September 30, 2025 Compared to the Nine Months Ended September 30, 2024\nThe following table presents data from our consolidated statements of operations and comprehensive income (loss) as well as the percentage relationship to total net sales of items included in our consolidated statements of operations and comprehensive income (loss) (dollars in thousands):\nNine Months Ended September 30,\n2025\n2024\nNet sales from products\n$\n1,122,655\n56.6 \n%\n$\n891,087\n59.1 \n%\nNet sales from services\n860,157\n43.4 \n616,294\n40.9 \nNet sales\n1,982,812\n100.0 \n1,507,381\n100.0 \nCost of product sales\n566,861\n28.6 \n450,954\n29.9 \nCost of services sales\n219,121\n11.0 \n160,896\n10.7 \nCost of sales\n785,982\n39.6 \n611,850\n40.6 \nGross margin\n1,196,830\n60.4 \n895,531\n59.4 \nOperating expenses:\nSelling, general and administrative\n718,524\n36.2 \n514,228\n34.1 \nResearch and development\n490,264\n24.8 \n307,008\n20.4 \nTotal operating expenses\n1,208,788\n61.0 \n821,236\n54.5 \nIncome (loss) from operations\n(11,958)\n(0.6)\n74,295\n4.9 \nInterest income\n57,798\n2.9 \n36,407\n2.4 \nInterest expense\n(65,419)\n(3.3)\n(5,273)\n(0.3)\nOther income, net\n104,790\n5.3 \n191,510\n12.7 \nIncome before provision for income taxes\n85,211\n4.3 \n296,939\n19.7 \nProvision for (benefit from) income taxes\n(36,700)\n(1.8)\n55,089\n3.7 \nNet income\n$\n121,911\n6.1 \n%\n$\n241,850\n16.0 \n%\nThe following table presents our revenues disaggregated by geography (dollars in thousands):\nNine Months Ended September 30,\n2025\n2024\nUnited States\n$\n1,660,695 \n84 \n%\n$\n1,298,775 \n86 \n%\nOther countries\n322,117 \n16 \n208,606 \n14 \nTotal\n$\n1,982,812 \n100 \n%\n$\n1,507,381 \n100 \n%\nInternational revenue increased compared to the prior year September 30, 2024\n \ncomparative period, primarily driven by increased sales in our Americas region.\n38\nTable of Contents\nNet Sales\nAs a result of the Segment Realignment, we have updated and recast our disaggregated revenue categories. Net sales by product line were as follows (dollars in thousands):\nNine Months Ended September 30,\nDollar\nChange\nPercent\nChange\n2025\n2024\nConnected Devices segment:\nTASER \n(1)\n$\n649,679 \n32.8 \n%\n$\n549,759 \n36.5 \n%\n$\n99,920 \n18.2 \n%\nPersonal Sensors \n(2)\n287,901 \n14.5 \n231,773 \n15.4 \n56,128 \n24.2 \nPlatform Solutions \n(3)\n185,075 \n9.3 \n109,555 \n7.2 \n75,520 \n68.9 \nTotal Connected Devices segment\n1,122,655 \n56.6 \n891,087 \n59.1 \n231,568 \n26.0 \nTotal Software and Services segment\n860,157 \n43.4 \n616,294 \n40.9 \n243,863 \n39.6 \nTotal net sales\n$\n1,982,812 \n100.0 \n%\n$\n1,507,381 \n100.0 \n%\n$\n475,431 \n31.5 \n%\n \n(1)\n'TASER' includes TASER handles, cartridges and related extended warranties.\n(2)\n'Personal Sensors' primarily includes body cameras and accessories, signal sidearm, and related extended warranties.  \n(3)\n'Platform Solutions' primarily includes interview room, fleet in-car video, fixed cameras, drones and counter-drone equipment, virtual reality training hardware, and related extended warranties.\nNet sales for the Connected Devices segment increased 26.0% for the nine months ended September 30, 2025 as compared to the nine months ended September 30, 2024. The increase of $99.9 million in TASER is primarily driven by higher TASER 10 handle and cartridge volume. Personal Sensors increased $56.1 million on continued adoption of our newest body camera, AB4, and higher warranty revenue from more devices in the field. The $75.5 million increase in Platform Solutions is primarily driven by higher volume for counter-drone equipment and virtual reality training.\nNet sales for the Software and Services segment increased 39.6% for the nine months ended September 30, 2025 as compared to the nine months ended September 30, 2024. The increase in the aggregate number of users and growing adoption of our premium add-on features by existing customers drove the majority of the increase of $243.9 million.\nGross Margin \nAs a percentage of net sales, gross margin for the Connected Devices segment increased to 49.5% from 49.4% for the nine months ended September 30, 2025 and 2024, respectively. The increase was primarily due to lower stock-based compensation expense. Adjusted gross margin for the Connected Devices segment, which excludes stock-based compensation expense, acquired intangibles amortization, inventory step-up amortization related to acquisitions and payroll taxes related to 2024 Employee XSP vesting, was 52.0% for the nine months ended September 30, 2025, compared to 54.0% for the nine months ended September 30, 2024. The decrease is primarily driven by global tariffs and higher mix of Platform Solutions revenue.\nAs a percentage of net sales, gross margin for the Software and Services segment increased to 74.5% from 73.9% for the nine months ended September 30, 2025 and 2024, respectively. Adjusted gross margin for the Software and Services segment, which excludes stock-based compensation expense, acquired intangibles amortization and payroll taxes related to 2024 Employee XSP vesting, increased to 77.8% for the nine months ended September 30, 2025, compared to 76.3% for the nine months ended September 30, 2024. The increase was primarily driven by higher software mix. \nSelling, General and Administrative Expenses\nSG&A expenses were comprised as follows (dollars in thousands):\nNine Months Ended September 30,\nDollar\nChange\nPercent\nChange\n2025\n2024\nTotal selling, general and administrative expenses\n$\n718,524 \n$\n514,228 \n$\n204,296 \n39.7 \n%\nAs a percentage of net sales\n36.2%\n34.1%\n39\nTable of Contents\nStock-based compensation ex\npense increased $101.6 million in comparison to the prior year September 30, 2024 comparable period, which was primarily related to the 2024 Employee XSP and the 2024 CEO Performance Award that were approved by shareholders in the 2024 Annual Meeting of Shareholders and increased headcount.\nSalaries, benefits and bonus expense increased $53.1 million in comparison to the prior year September 30, 2024 comparable period, which was primarily attributable to an increase in headcount and higher wages. \nSales and marketing expense increased $14.5 million in comparison to the prior year September 30, 2024 comparable period, which was primarily attributable to increased commissions.\nOther SG&A expenses increased $\n35.1 \nmillion in comparison to the prior year September 30, 2024 comparable period,\n primarily driven by an increase in professional and consulting expenses of \n$\n11.0 million and an increase in travel expenses of \n$\n10.3 million.\nResearch and Development Expenses\nR&D expenses were comprised as follows (dollars in thousands):\nNine Months Ended September 30,\nDollar\nChange\nPercent\nChange\n2025\n2024\nTotal research and development expenses\n$\n490,264\n$\n307,008\n$\n183,256\n59.7 \n%\nAs a percentage of net sales\n24.7 \n%\n20.4 \n%\nStock-based compensa\ntion expense increased $82.4 million in comparison to the prior year September 30, 2024 comparable period, which was primarily related to the 2024 Employee XSP that was approved by shareholders in the 2024 Annual Meeting of Shareholders and increased headcount.\nSalaries, benefits and bonus expense increased $53.8 million in comparison to the prior year September 30, 2024 comparable period, which was primarily attributable to an increase in headcount and higher wages.\nOther R&D expenses increased $\n47.1 \nmillion in comparison to the prior year September 30, 2024 comparable period, partially driven by an increase in professional and consulting expenses of $\n21.5 \nmillion.\nInterest Income (Loss), Net\nInterest income (loss), net, was as follows (in thousands):\nNine Months Ended September 30,\n2025\n2024\nInterest income\n$\n57,798 \n$\n36,407 \nInterest expense\n (1)\n(65,419)\n(5,273)\nTotal interest income (loss), net\n$\n(7,621)\n$\n31,134 \n(1)\nInterest expense increased in comparison to the prior year September 30, 2024 comparable period primarily as a result of the issuance of the Senior Notes in March 2025, as discussed further within Note 10.\n40\nTable of Contents\nOther Income, Net\nOther income, net, was as follows (in thousands):\nNine Months Ended September 30,\n2025\n2024\nRealized and unrealized gain on fair value adjustments of strategic investments, net\n$\n180,642 \n$\n118,538 \nRealized and unrealized gain (loss) on marketable securities, net \n(1)\n(45,994)\n73,620 \nLoss on foreign currency transactions, net\n(1,376)\n(180)\nInduced conversion of convertible debt \n(2)\n(28,666)\n— \nOther, net\n184 \n(468)\nOther income, net\n$\n104,790 \n$\n191,510 \n(1)\nReflects the net realized and unrealized loss on marketable securities during the nine months ended September 30, 2025, as discussed within Note 3.\n(2)\nReflects the inducement expense associated with the early repurchase of a portion of our 2027 Notes in the first quarter of 2025, as discussed further within Note 10.\nProvision for (Benefit from) Income Taxes\n The effective tax rate was (43.1)% for the nine months ended September 30, 2025, compared to 18.6% for the nine months ended September 30, 2024. The change is attributable to the net tax benefit related to stock-based compensation and R&D tax credits. These were partially offset by increased unrecognized tax benefits. The overall change in the effective tax rate also reflects the impact of lower pre-tax book income in the current period, which magnifies the relative effect of permanent and discrete item.\nProvision for (benefit from) income taxes and effective tax rates were as follows (dollars in thousands):\nNine Months Ended September 30,\n2025\n2024\nChange\nIncome before provision for income taxes\n$\n85,211 \n$\n296,939 \n$\n(211,728)\nProvision for (benefit from) income taxes\n$\n(36,700)\n$\n55,089 \n$\n(91,789)\nEffective tax rate\n(43.1)\n%\n18.6 \n%\nNet Income\nWe recorded net income of $121.9 million for the nine months ended September 30, 2025 compared to net income of $241.9 million for the nine months ended September 30, 2024. Net income per basic share was $1.57 for the nine months ended September 30, 2025 compared to $3.20 for the nine months ended September 30, 2024. Net income per diluted share was $1.48 for the nine months ended September 30, 2025 compared to $3.12 for the nine months ended September 30, 2024.\nNon-GAAP Measures\nWe utilize certain non-GAAP financial measures such as EBITDA, adjusted EBITDA, and adjusted gross margin as defined below to enhance understanding of our financial results and related measures. We have adjusted for expenses that we believe are not indicative of our core operating results, including stock-based compensation expense and amortization of acquired intangible assets. To improve comparability, prior periods have been conformed to the current period presentation. Our management uses these non-GAAP financial measures in evaluating our operating performance in comparison to prior periods. We believe that both management and investors benefit from referring to these non-GAAP financial measures in assessing our performance, and when planning and forecasting our future periods. A reconciliation of GAAP to the non-GAAP financial measures is presented below. \n•\nEBITDA (most comparable GAAP measure: Net income) - Earnings before interest expense, investment interest income, income taxes, depreciation and amortization.\n41\nTable of Contents\n•\nAdjusted EBITDA (most comparable GAAP measure: Net income) – Earnings before interest expense; investment interest income; income taxes; depreciation; amortization; noncash stock-based compensation expense; fair value adjustments related to strategic investments, marketable securities, and mark-to-market on our non-qualified deferred compensation liabilities; debt inducement expense associated with the early repurchase of a portion of our 2027 Notes; transaction and integration costs related to strategic investments and acquisitions, including the change in fair value of contingent consideration arrangements; inventory step-up amortization related to acquisitions; costs (or subsequent recoveries of prior costs) related to certain legal or regulatory matters we consider outside of our core operating activities; losses incurred as a result of the disposal, abandonment, and impairment of property, equipment and intangible assets; payroll taxes related to 2024 Employee XSP vesting and 2018 CEO Performance Award option exercises; and other unusual, non-recurring pre-tax items that are not considered representative of our underlying operating performance (listed in the tables below).\n•\nAdjusted gross margin (most comparable GAAP measure: Gross margin) – Gross margin before noncash stock-based compensation expense, amortization of acquired intangible assets, inventory step-up amortization related to acquisitions, and payroll taxes related to 2024 Employee XSP vesting.\nAlthough these non-GAAP financial measures are not consistent with GAAP, management believes investors will benefit by referring to these non-GAAP financial measures when assessing our operating results, as well as when forecasting and analyzing future periods. However, management recognizes that:\n•\nthese non-GAAP financial measures are limited in their usefulness and should be considered only as a supplement to our GAAP financial measures;\n•\nthese non-GAAP financial measures should not be considered in isolation from, or as a substitute for, our GAAP financial measures;\n•\nthese non-GAAP financial measures should not be considered to be superior to our GAAP financial measures; and\n•\nthese non-GAAP financial measures were not prepared in accordance with GAAP and investors should not assume that the non-GAAP financial measures presented in this Quarterly Report on Form 10-Q were prepared under a comprehensive set of rules or principles.\n42\nTable of Contents\nEBITDA and adjusted EBITDA reconcile to net income (loss) as follows (in thousands): \nThree Months Ended September 30,\nNine Months Ended September 30,\n2025\n2024\n2025\n2024\nNet income (loss)\n$\n(2,186)\n$\n67,025\n$\n121,911\n$\n241,850\nDepreciation and amortization\n21,310\n14,762\n59,829\n39,326\nInterest expense\n28,912\n1,646\n65,419\n5,273\nInvestment interest income\n(23,941)\n(12,624)\n(57,798)\n(36,407)\nProvision for (benefit from) income taxes\n17,889\n12,544\n(36,700)\n55,089\nEBITDA\n$\n41,984\n$\n83,353\n$\n152,661\n$\n305,131\nNon-GAAP adjustments:\nStock-based compensation expense\n146,152\n101,780\n425,635\n251,716\nUnrealized and realized losses (gains) on investments and marketable securities, net\n(21,820)\n(44,459)\n(132,013)\n(149,845)\nRealized gains on previously held minority interests acquired in business combinations, net\n—\n—\n—\n(42,313)\nDebt inducement expense\n—\n—\n28,666\n—\nTransaction costs related to strategic investments and acquisitions\n4,774\n2,652\n9,731\n13,145\nLitigation and regulatory costs\n5,490\n—\n8,313\n224\nInventory step-up amortization\n—\n—\n607\n—\nLoss on disposal, abandonment, and impairment of property, equipment and intangible assets, net\n430\n—\n430\n—\nPayroll taxes related to 2024 Employee XSP vesting and 2018 CEO Performance Award option exercises\n—\n1,727\n9,782\n1,727\nAdjusted EBITDA\n$\n177,010\n$\n145,053\n$\n503,812\n$\n379,785\nAs a result of the Segment Realignment, we have recast adjusted gross margin for the three and nine months ended September 30, 2024 to conform to the new presentation. Adjusted gross margin reconciles to gross margin as follows (in thousands):\nThree Months Ended September 30,\n2025\n2024\nConnected Devices\nSoftware and \nServices\nTotal \nConnected Devices\nSoftware and \nServices\nTotal\nGross margin\n$\n202,226\n$\n225,122\n$\n427,348\n$\n171,733\n$\n159,014\n$\n330,747\nStock-based compensation expense\n7,584\n5,119\n12,703\n6,722\n3,401\n10,123\nAmortization of acquired intangible assets\n1,318\n4,081\n5,399\n382\n2,638\n3,020\nAdjusted gross margin\n$\n211,128\n$\n234,322\n$\n445,450\n$\n178,837\n$\n165,053\n$\n343,890\nGross margin %\n49.9 \n%\n73.8 \n%\n60.1 \n%\n52.4 \n%\n73.5 \n%\n60.8 \n%\nAdjusted gross margin %\n52.1 \n%\n76.8 \n%\n62.7 \n%\n54.5 \n%\n76.3 \n%\n63.2 \n%\n43\nTable of Contents\nNine Months Ended September 30,\n2025\n2024\nConnected Devices\nSoftware and \nServices\nTotal\n \nConnected Devices\nSoftware and \nServices\nTotal\nGross margin\n$\n555,794\n$\n641,036\n$\n1,196,830\n$\n440,133\n$\n455,398\n$\n895,531\nStock-based compensation expense\n22,643\n15,508\n38,151\n40,432\n7,803\n48,235\nAmortization of acquired intangible assets\n3,988\n11,560\n15,548\n1,058\n7,240\n8,298\nPayroll taxes related to 2024 Employee XSP vesting\n634\n854\n1,488\n—\n—\n—\nInventory step-up amortization\n607\n—\n607\n—\n—\n—\nAdjusted gross margin\n$\n583,666\n$\n668,958\n$\n1,252,624\n$\n481,623\n$\n470,441\n$\n952,064\nGross margin %\n49.5 \n%\n74.5 \n%\n60.4 \n%\n49.4 \n%\n73.9 \n%\n59.4 \n%\nAdjusted gross margin %\n52.0 \n%\n77.8 \n%\n63.2 \n%\n54.0 \n%\n76.3 \n%\n63.2 \n%\nLiquidity and Capital Resources \nSummary\nSeptember 30, 2025\nDecember 31, 2024\nDollar Change\nCash and cash equivalents\n$\n1,423,871 \n$\n454,844 \n$\n969,027 \nAvailable-for-sale investments\n952,786 \n333,235 \n619,551 \nTotal \n$\n2,376,657 \n$\n788,079 \n$\n1,588,578 \nOur most significant source of liquidity continues to be funds generated by operating activities and available cash and \ncash equivalents and short-term investments. As of September 30, 2025, we had $1.4 billion of cash and cash equivalents, an increase of $969.0 million from December 31, 2024. Refer below for further discussions related to the change in cash and cash equivalents. As of September 30, 2025, we had $952.8 million of available-for-sale investments, an increase of $619.6 million from December 31, 2024 primarily as a result of investment activity following the issuance of the Senior Notes in March 2025. Refer to Note 10 in Part I, Item 1 of this Quarterly Report on Form 10-Q for additional details on the issuance.\nIn additi\non, our Credit Agreement is available for additional working capital needs or investment opportunities. The Credit Agreement provides for a senior unsecured multi-currency revolving credit facility in an aggregate principal amount of up to $300.0 million, $50.0 million of which is available for the issuance of letters of credit. As of September 30, 2025, and December 31, 2024, respectively, no amounts were drawn under the Credit Agreement. Under the terms of the line of credit, available borrowings are reduced by outstanding letters of credit. As of September 30, 2025, we had letters of credit outstanding of approximately $8.9 million under the facility and available borrowing of $291.1 million. Refer to Note 13 in Part I, Item 1 of this Quarterly Report on Form 10-Q for additional details.\nAs of September 30, 2025, we have an aggregate of $1.75 billion of Senior Notes outstanding. As of September 30, 2025, none of our subsidiaries guarantee the Senior Notes. Our non-guarantor subsidiaries accounted for approximately 13% of our total revenue for the nine months ended September 30, 2025, and approximately 9% and 5% of our total consolidated assets and liabilities (excluding the effect of intercompany transactions), respectively, as of September 30, 2025. Refer to Note 10 in Part I, Item 1 of this Quarterly Report on Form 10-Q for additional details.\nFurthermore, during the nine months ended September 30, 2025, we sold approximately 0.5 million shares of our common stock under our ATM. We generated approximately $366.3 million in aggregate gross proceeds from sales under the ATM. We recorded aggregate net proceeds of $362.1 million in additional paid-in capital after deducting related expenses, including commissions to the sales agent and issuance costs of $4.2 million. Refer to Note 12 in Part I, Item 1 of this Quarterly Report on Form 10-Q for additional details.\nSubsequent to the quarter ended September 30, 2025, we \nacquired the remaining outstanding stock of Prepared and we \nentered into a definitive agreement to acquire Carbyne. Refer to Note 18 in Part I, Item 1 of this Quarterly Report on Form 10-Q for additional details.\n44\nTable of Contents\nWe believe we have access to additional fina\nncing. However, there is no assurance that such funding will be available on terms acceptable to us, or at all. We believe that our sources of funding will be sufficient to satisfy our currently anticipated cash requirements, including capital expenditures, working capital requirements, potential acquisitions or investments, income and payroll tax payments for net-settled stock awards, and other liquidity requirements through at least the next 12 months.\nGoing forward, we expect to continue to be an opportunistic issuer of debt securities and may issue new debt securities from time to time to fund our growth or refinance future debt maturities, among other things. In addition, from time to time, we may acquire our debt securities through open market purchases, redemptions, privately negotiated transactions, tender offers, exchange offers or otherwise, upon such terms and at such prices as we may from time to time determine, for cash or other consideration.\nCash Flows\nThe following table summarizes our cash flows from operating, investing and financing activities (in thousands): \nNine Months Ended September 30,\n \nDollar\nChange\n2025\n2024\n \nOperating activities\n$\n(5,896)\n$\n158,146 \n$\n(164,042)\nInvesting activities\n(498,490)\n(48,834)\n(449,656)\nFinancing activities\n1,468,024 \n(12,608)\n1,480,632 \nEffect of exchange rate changes on cash and cash equivalents\n5,741 \n75 \n5,666 \nNet increase (decrease) in cash and cash equivalents and restricted cash\n$\n969,379 \n$\n96,779 \n$\n872,600 \nOperating activities\nNet cash used in operating activities was $5.9 million for the nine months ended September 30, 2025 compared to net cash provided by operating activities of $158.1 million for the \nnine months ended September 30, 2024\n. The net operating cash outflow for the nine months ended September 30, 2025 includes net income of $121.9 million, a net add-back of non-cash income statement items of $346.9 million and a $474.7 million net change in operating assets and liabilities. \nPrimary drivers of the non-cash items include $425.6 million of stock-based compensation expense for employee equity programs, $28.6 million of\n \ndebt inducement expense related to the induced conversion for our 2027 Notes and $56.2 million of depreciation and amortization, partially offset by $134.6 million in fair value adjustments for net realized and unrealized gains and losses on our strategic investments and marketable securities and $53.7 million\n \nfor\n \ndeferred income taxes. The realized and unrealized gains on our strategic investments and related warrants were primarily related to an observable price change and subsequent sale for one of our strategic investments and a liquidation event for a separate strategic investment. The change in deferred income taxes was primarily driven by a reduction and realization of previously unrealized investment gains, partially offset by the deduction of certain previously capitalized R&D costs as a result of OBBBA.\nThe change in operating assets and liabilities includes $366.1 million of receivables and contract assets primarily driven by increased sales and the timing of invoicing and cash collections, $13.4 million of inventory and accounts payable primarily driven by advanced raw material purchases for Axon Body 4 and TASER 10 CEDs to support future sales, $116.7 million of prepaid expenses and other assets primarily driven by supplier prepayments, receivables for income tax, and commissions as bookings continue to grow, and $21.6 million of deferred revenue.\nInvesting activities\nNet cash used in investing activities was $498.5 million for the nine months ended September 30, 2025 compared to $48.8 million for the nine months ended September 30, 2024. The net investing cash outflow is primarily driven by $2.0 billion of investment purchases, including $1.8 billion for short-term investments and $249.1 million for strategic investments, and $74.5 million for purchases of property and equipment. The cash outflow was partially offset by $1.3 billion of proceeds from calls, maturities and sales of available-for-sale and marketable securities investments and $376.7 million of proceeds from the sale and liquidation of strategic investments. The increase in net cash outflow compared to prior period is primarily driven by greater available-for-sale and strategic investment activity in the current period, partially offset by the decrease in cash paid for business acquisitions.\n45\nTable of Contents\nFinancing activities\nNet cash provided by financing activities was $1.5 billion for the nine months ended September 30, 2025 compared to cash used in financing activities of $12.6 million for the nine months ended September 30, 2024. The financing cash inflow was partially driven by gross proceeds of $1.8 billion from the Senior Notes issuance and net proceeds of $362.2 million from our ATM equity offering program. The proceeds were partially offset by $407.5 million of principal payments related to the conversions for our 2027 Notes, $26.9 million of transaction costs related to the induced conversion, debt issuance, and revolver modifications, and payments totaling $209.6 million for income and payroll taxes on behalf of employees who net-settled stock awards during the period. The increase in income and payroll tax payments in the period is largely driven by the vesting of Tranche 1 of the 2024 Employee XSP program.\n46\nTable of Contents\nCritical Accounting Estimates\nOur management’s discussion and analysis of our financial condition and results of operation is based on our consolidated financial statements, which have been prepared in accordance with GAAP. The preparation of these consolidated financial statements requires us to make estimates and assumptions that affect the reported amounts of assets, liabilities, revenue and expenses, and related disclosures. Our estimates are based on historical experience and various other assumptions that we believe to be reasonable under the circumstances, and we evaluate our estimates and assumptions on an ongoing basis. \nWhile we do not believe that a change in these estimates is reasonably likely, there can be no assurance th\nat our actual results will not differ from these estimates.\nOur critical accounting estimates are discussed in our amended 2024 Annual Report on Form 10-K/A for the fiscal year ended December 31, 2024. There have been no significant changes to these critical accounting estimates for the nine months ended September 30, 2025.\n47\nTable of Contents"
}