{
  "source_file": "axp-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "ITEM 2. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS (MD&A)\nBusiness Introduction\nAmerican Express is a global payments and premium lifestyle brand powered by technology. Founded in 1850 and headquartered in New York, American Express’ card-issuing, merchant-acquiring and card network businesses offer products and services to a broad range of customers, including consumers, small businesses, mid-sized companies and large corporations around the world. \nOur range of products and services includes:\n•\nCredit card, charge card, banking and other payment and financing products\n•\nMerchant acquisition and processing, servicing and settlement, fraud prevention, and point-of-sale marketing and information products and services\n•\nNetwork services\n•\nTravel and lifestyle services\n•\nExpense management products and services\n•\nOther services, such as the design and operation of customer loyalty programs\nThese products and services are offered through various channels, including mobile and online applications, affiliate marketing, customer referral programs, third-party service providers and business partners, in-house sales teams, direct mail, telephone and direct response advertising. \nWe compete in the global payments industry with networks, issuers, acquirers and other payment service providers and methods of payment, including paper-based transactions (e.g., cash and checks) and electronic transfers (e.g., wire transfers and Automated Clearing House (ACH)), as well as evolving and growing alternative mechanisms, systems and products that leverage new technologies, business models and customer relationships to create payment, financing or banking solutions. The payments industry continues to undergo changes in response to evolving technologies, business dynamics and competition for premium customers.\nForward-Looking Statements and Non-GAAP Measures\nCertain of the statements in this Form 10-Q are forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. Refer to the “Cautionary Note Regarding Forward-Looking Statements” section. We prepare our Consolidated Financial Statements in accordance with accounting principles generally accepted in the United States of America (GAAP). However, certain information included within this Form 10-Q constitutes non-GAAP financial measures. Our calculations of non-GAAP financial measures may differ from the calculations of similarly titled measures by other companies.\nBeginning in the third quarter of 2025, we ceased reporting Net interest yield on average Card Member loans, a non-GAAP measure that was computed by dividing adjusted net interest income by average Card Member loans, and began reporting (together with prior period comparative information) Net interest yield on average Total loans and Card Member receivables, a GAAP measure that represents net interest income, computed on an annualized basis, divided by average Card Member loans, Card Members loans held for sale (HFS), Other loans and Card Member receivables. We believe that this new net interest yield metric reflects the evolution of our products over time, such as the expansion of lending features on our charge card portfolio. See Table 1 for more information.\nBank Holding Company\nAmerican Express is a bank holding company under the Bank Holding Company Act of 1956 and The Board of Governors of the Federal Reserve System (the Federal Reserve) is our primary federal regulator. As such, we are subject to the Federal Reserve’s regulations, policies and minimum capital standards. We are also subject to evolving and extensive government regulation and supervision in jurisdictions around the world.\n1\nTable of Contents\nTable 1: Summary of Financial Performance\nAs of or for the Three Months Ended\nSeptember 30,\nChange\n2025 vs. 2024\nAs of or for the Nine Months Ended\nSeptember 30,\nChange\n2025 vs. 2024\n(Millions, except percentages, per share amounts and where indicated)\n2025\n2024\n2025\n2024\nSelected Income Statement Data\nTotal revenues net of interest expense\n$\n18,426\n$\n16,636\n$\n1,790 \n11 \n%\n$\n53,249\n$\n48,770\n$\n4,479 \n9 \n%\nTotal revenues net of interest expense (FX-adjusted) \n(a)\n16,674\n1,752 \n11 \n48,734\n4,515 \n9 \nProvisions for credit losses\n1,287\n1,356\n(69)\n(5)\n3,842\n3,893\n(51)\n(1)\nTotal expenses\n13,314\n12,076\n1,238 \n10 \n38,702\n34,738\n3,964 \n11 \nPretax income\n3,825\n3,204\n621 \n19 \n10,705\n10,139\n566 \n6 \nIncome tax provision\n923\n697\n226 \n32 \n2,334\n2,180\n154 \n7 \nNet income\n2,902\n2,507\n395 \n16 \n8,371\n7,959\n412 \n5 \nEarnings per common share — diluted \n(b)\n$\n4.14\n$\n3.49\n$\n0.65 \n19 \n%\n$\n11.85\n$\n10.97\n$\n0.88 \n8 \n%\nSelected Balance Sheet and Common Share Data\nCash and cash equivalents\n$\n54,706\n$\n47,918\n$\n6,788 \n14 \n%\n$\n54,706\n$\n47,918\n$\n6,788 \n14 \n%\nTotal loans and Card Member receivables \n(c)\n216,355\n202,050\n14,305 \n7 \n216,355\n202,050\n14,305 \n7 \nTotal loans and Card Member receivables (FX-adjusted) \n(a)(c)\n201,810\n14,545 \n7 \n201,810\n14,545 \n7 \nCustomer deposits\n149,883\n135,438\n14,445 \n11 \n149,883\n135,438\n14,445 \n11 \nLong-term debt\n$\n57,787\n$\n53,546\n$\n4,241 \n8 \n$\n57,787\n$\n53,546\n$\n4,241 \n8 \nAverage common shares outstanding — diluted\n693\n709\n(16)\n(2)\n698\n716\n(18)\n(3)\nCash dividends declared per common share\n$\n0.82\n$\n0.70\n$\n0.12 \n17 \n%\n$\n2.46\n$\n2.10\n$\n0.36 \n17 \n%\nSelected Metrics and Ratios\nNetwork volumes \n(billions)\n$\n479.2\n$\n441.0\n$\n38 \n9 \n%\n$\n1,390.8\n$\n1,300.8\n$\n90 \n7 \n%\nBilled business \n(billions)\n$\n421.0\n387.3\n34 \n9 \n$\n1,224.7\n1,142.5\n82 \n7 \nBilled business \n(billions)\n (FX-adjusted) \n(a)\n$\n388.1\n$\n33 \n8 \n%\n$\n1,142.7\n$\n82 \n7 \n%\nNet interest yield \n(d)\n8.2%\n8.0%\n8.1\n \n%\n7.9 \n%\nCard Member loans and receivables\nNet write-off rate — principal, interest and fees \n(e)\n2.2\n \n%\n2.2 \n%\n2.3\n \n%\n2.3 \n%\nNet write-off rate — principal only — consumer and small business \n(e)(f)\n1.9\n \n%\n1.9 \n%\n2.0\n \n%\n2.1 \n%\n30+ days past due as a % of total — consumer and small business \n(g)\n1.3\n \n%\n1.3 \n%\n1.3\n \n%\n1.3 \n%\nEffective tax rate\n24.1\n \n%\n21.8 \n%\n21.8\n \n%\n21.5 \n%\nReturn on average equity \n(h)\n35.9\n \n%\n33.9 \n%\n35.4\n \n%\n36.6 \n%\nCommon Equity Tier 1 \n10.5\n \n%\n10.7 \n%\n10.5\n \n%\n10.7 \n%\n(a)\nThe foreign currency adjusted information assumes a constant exchange rate between the periods being compared for purposes of currency conversion into U.S. dollars (i.e., assumes the foreign exchange rates used to determine results for the current period apply to the corresponding prior year period against which such results are being compared). FX-adjusted Total revenues net of interest expense and Total loans and Card Member receivables are non-GAAP measures. We believe the presentation of information on a foreign currency adjusted basis is helpful to investors by making it easier to compare our performance in one period to that of another period without the variability caused by fluctuations in currency exchange rates.\n(b)\nRepresents net income, less (i) earnings allocated to participating share awards of $20 million and $18 million for the three months ended September 30, 2025 and 2024, respectively, and $56 million and $59 million for the nine months ended September 30, 2025 and 2024, respectively, and (ii) dividends on preferred shares of $14 million and $15 million for the three months ended September 30, 2025 and 2024, respectively, and $43 million and $44 million for the nine months ended September 30, 2025 and 2024, respectively.\n(c)\nTotal loans reflects Card Member loans and Other loans.\n(d)\nRepresents net interest income, computed on an annualized basis, divided by average Card Member loans, Card Member loans HFS, Other loans and Card Member receivables.\n(e)\nWe present a net write-off rate based on principal losses only (i.e., excluding interest and/or fees) to be consistent with industry convention. In addition, as our practice is to include uncollectible interest and/or fees as part of our total provision for credit losses, a net write-off rate including principal, interest and/or fees is also presented.\n(f)\nA net write-off rate based on principal losses only is not available for corporate receivables due to system constraints.\n(g)\nFor corporate receivables, delinquency data is tracked based on days past billing status rather than days past due. Refer to Table 11 for 90+ days past billing metrics for corporate receivables.\n(h)\nReturn on average equity (ROE) is calculated by dividing (i) annualized net income for the period by (ii) average shareholders’ equity for the period.\n2\nTable of Contents\nBusiness Performance\nWe delivered strong results for the third quarter of 2025, with record levels of Card Member spending and excellent credit performance. During the quarter, we launched our refreshed U.S. Consumer and Business Platinum Cards with expanded lifestyle and business benefits and have seen strong early demand and engagement. Net income for the third quarter was $2.9 billion, or $4.14 per share, compared with net income of $2.5 billion, or $3.49 per share, a year ago. \nBilled business growth accelerated to 9 percent year-over-year (8 percent on an FX-adjusted basis).\n1\n G&S spend grew 9 percent, driven by strong retail spending, and T&E spend rebounded to 8 percent, primarily reflecting continuing strength in restaurant spend, our largest T&E spend category, as well as improved airline spend. U.S. Consumer Services billed business grew 9 percent, with continued strength in spending by Millennial and Gen-Z Card Members as our products continue to resonate with these cohorts. Commercial Services billed business grew 4 percent, reflecting continued modest growth from U.S. small and mid-sized enterprise (SME) Card Members. International Card Services billed business grew 14 percent (13 percent on an FX-adjusted basis), driven by continued strong growth in spend across all regions and customer types outside the United States.\n1\n Total spend continues to be driven by transaction growth, up 10 percent in the quarter, a good indicator of engagement from our customer base.\nTotal revenues net of interest expense increased 11 percent year-over-year on both a reported and FX-adjusted basis.\n1\n Growth in billed business drove a 7 percent increase in Discount revenue, our largest revenue line. Net card fee revenue growth moderated from the prior quarter due to our previous cycle of product refreshes. In connection with the launch of our updated U.S. Consumer and Business Platinum Cards, we increased the annual card fee, which will be applied for existing Card Members at renewal anniversaries after the applicable effective date and recognized over the annual card membership period. Service fees and other revenue grew at an elevated level, reflecting discrete transactions in the quarter. Net interest income grew 12 percent, primarily reflecting growth in balances and net yield expansion. \nTotal Loans and Card Member receivables increased 7 percent year-over-year, in line with recent trends. Provisions for credit losses decreased, primarily due to a lower reserve build compared to the prior year, partially offset by higher net write-offs. Net write-off and delinquency rates remained stable and best-in-class, supported by our premium global customer base, our strong focus on risk management and disciplined growth strategy. \nCard Member rewards, Card Member services and Business development expenses, which are generally driven by volumes and usage, collectively grew faster than revenues as a result of enhancements to our value propositions, such as the expanded U.S. Platinum benefits, to drive Card Member engagement and acquire more Card Members, and the mix shift towards premium products. Marketing expense increased 9 percent year-over-year, as we continued to invest to acquire high spending, high credit-quality customers. During the third quarter, we acquired 3.2 million proprietary new cards. Operating expense growth continues to reflect our investments in enterprise risk management capabilities and technology to support business growth. We remain focused on driving marketing and operating expense efficiencies over time.\nDuring the third quarter, we maintained our CET1 capital ratio within our target range of 10 to 11 percent and returned $2.9 billion of capital to our shareholders in the form of share repurchases and common stock dividends. We plan to continue to return to shareholders the excess capital we generate while managing our CET1 capital ratio within our target range and supporting balance sheet growth. Our robust capital, funding and liquidity positions provide us with significant flexibility to maintain a strong balance sheet. \nOur strong third quarter performance continues to give us confidence in our Membership-focused business model and proven product refresh strategy as we navigate the evolving competitive landscape. While we recognize the uncertainty of the geopolitical and macroeconomic environment, we believe our differentiated business model, which includes our global premium customer base, spend- and fee-centric revenue mix and operating expense leverage, is resilient and positions us well to navigate a range of economic environments. We continue to manage the company for the long term, focusing on backing our customers and colleagues, exercising disciplined expense management and strategically investing in our business. \nSee “Certain Legislative, Regulatory and Other Developments” for information on legislative and regulatory changes that could have a material adverse effect on our results of operations and financial condition and “Risk Factors” and “Cautionary Note Regarding Forward-Looking Statements” for information on potential impacts of macroeconomic, geopolitical and competitive conditions and certain litigation and regulatory matters on our business.\n1\n \nThe foreign currency adjusted information assumes a constant exchange rate between the periods being compared for purposes of currency conversion into U.S. dollars (i.e., assumes the foreign exchange rates used to determine results for the current period apply to the corresponding prior year period against which such results are being compared). FX-adjusted revenues is a non-GAAP measure. We believe the presentation of information on a foreign currency adjusted basis is helpful to investors by making it easier to compare our performance in one period to that of another period without the variability caused by fluctuations in currency exchange rates.\n3\nTable of Contents\nResults of Operations\nThe discussions in both “Consolidated Results of Operations” and “Business Segment Results of Operations” provide commentary on the variances for the three and nine months ended September 30, 2025 compared to the same periods in the prior year, as presented in the accompanying tables. Our results for the nine months ended September 30, 2024 reflect the sale of Accertify Inc. (Accertify), which closed on May 1, 2024, and resulted in a gain of $531 million ($479 million after tax; $0.66 per share), which was reported as a reduction to Other expense in the second quarter of 2024.\nBeginning in the first quarter of 2025, we made a presentation change to our Consolidated Statements of Income to consolidate Processed revenue within Service fees and other revenue and renamed Processed revenue to Network partnership revenue. Prior period amounts have been recast to conform to the current period presentation; there was no impact to Total non-interest revenues. Refer to Note 12 to the “Consolidated Financial Statements” for additional information.\nConsolidated Results of Operations\nTable 2: Total Revenues Net of Interest Expense Summary\nThree Months Ended\nSeptember 30,\nChange\n2025 vs. 2024\nNine Months Ended\nSeptember 30,\nChange\n2025 vs. 2024\n(Millions, except percentages)\n2025\n2024\n2025\n2024\nDiscount revenue\n$\n9,413\n \n$\n8,780 \n$\n633 \n7 \n%\n$\n27,517\n \n$\n26,015 \n$\n1,502 \n6 \n%\nNet card fees \n2,551\n \n2,170 \n381 \n18 \n7,364\n \n6,204 \n1,160 \n19 \nService fees and other revenue\n1,976\n \n1,680 \n296 \n18 \n5,526\n \n5,046 \n480 \n10 \nTotal non-interest revenues\n13,940\n \n12,630 \n1,310 \n10 \n40,407\n \n37,265 \n3,142 \n8 \nTotal interest income\n6,617\n \n6,149 \n468 \n8 \n19,016\n \n17,718 \n1,298 \n7 \nTotal interest expense\n2,131\n \n2,143 \n(12)\n(1)\n6,174\n \n6,213 \n(39)\n(1)\nNet interest income\n4,486\n \n4,006 \n480 \n12 \n12,842\n \n11,505 \n1,337 \n12 \nTotal revenues net of interest expense\n$\n18,426\n \n$\n16,636 \n$\n1,790 \n11 \n%\n$\n53,249\n \n$\n48,770 \n$\n4,479 \n9 \n%\nTotal Revenues Net of Interest Expense\nDiscount revenue increased for both the three and nine month periods, primarily driven by increases in billed business of 9 percent and 7 percent, respectively. See Tables 5 and 6 for more details on billed business performance.\nNet card fees increased for both the three and nine month periods, primarily driven by growth in our premium card portfolios. See Table 5 for more details on proprietary new card acquisitions, proprietary cards-in-force and average fee per card.\nService fees and other revenue increased for both the three and nine month periods, primarily driven by a gain related to an equity transaction by Global Business Travel Group, Inc., an equity method investee, resulting from its acquisition of CWT Holdings, LLC, as well as increases in foreign exchange-related revenues associated with Card Member cross-currency spending and network partnership revenues. \nInterest income increased for both the three and nine month periods, primarily driven by growth in revolving loan balances, partially offset by lower interest rates.\nInterest expense was relatively flat for both the three and nine month periods, primarily reflecting lower interest rates paid on customer deposits, offset by growth in customer deposits and long-term debt.\n4\nTable of Contents\nTable 3: Provisions for Credit Losses Summary\nThree Months Ended \nSeptember 30,\nChange\n2025 vs. 2024\nNine Months Ended\nSeptember 30,\nChange\n2025 vs. 2024\n(Millions, except percentages)\n2025\n2024\n2025\n2024\nCard Member loans\nNet write-offs\n$\n928\n \n$\n853 \n$\n75 \n9 \n%\n$\n2,861\n \n$\n2,621 \n$\n240 \n9 \n%\nReserve build (release) \n(a)\n102\n \n261 \n(159)\n(61)\n164\n \n477 \n(313)\n(66)\nTotal\n1,030\n \n1,114 \n(84)\n(8)\n3,025\n \n3,098 \n(73)\n(2)\nCard Member receivables\nNet write-offs\n183\n \n187 \n(4)\n(2)\n536\n \n609 \n(73)\n(12)\nReserve build (release) \n(a)\n7\n \n(17)\n24 \n#\n26\n \n(17)\n43 \n#\nTotal\n190\n \n170 \n20 \n12 \n562\n \n592 \n(30)\n(5)\nOther\nNet write-offs — Other loans\n47\n \n46 \n1 \n2 \n153\n \n134 \n19 \n14 \nNet write-offs — Other receivables\n3\n \n6 \n(3)\n(50)\n16\n \n16 \n— \n— \nReserve build (release) — Other loans \n(a)\n15\n \n14 \n1 \n7 \n92\n \n28 \n64 \n#\nReserve (release) build — Other receivables \n(a)\n2\n \n6 \n(4)\n(67)\n(6)\n25 \n(31)\n#\nTotal\n67\n \n72 \n(5)\n(7)\n255\n \n203 \n52 \n26 \nTotal provisions for credit losses\n$\n1,287\n \n$\n1,356 \n$\n(69)\n(5)\n%\n$\n3,842\n \n$\n3,893 \n$\n(51)\n(1)\n%\n# Denotes a variance of 100 percent or more\n(a)\nRefer to the “Glossary of Selected Terminology” for a definition of reserve build (release).\nProvisions for Credit Losses\nCard Member loans provision for credit losses decreased for both the three and nine month periods, primarily due to lower reserve builds in the current periods, partially offset by higher net write-offs. The reserve builds in the current periods were primarily driven by increases in loans outstanding and, for the current nine month period, deterioration in the macroeconomic outlook used in our reserve models, partially offset by the release of a reserve upon the reclassification of a small business cobrand portfolio to Card Member loans HFS from held for investment. The reserve builds in the prior periods were primarily driven by increases in loans outstanding.\nCard Member receivables provision for credit losses increased for the three month period, primarily due to a reserve build in the current period versus a reserve release in the prior period, partially offset by lower net write-offs. Card Member receivables provision for credit losses decreased for the nine month period, primarily due to lower net write-offs, partially offset by a reserve build in the current period versus a reserve release in the prior period. The reserve builds in the current periods were primarily driven by higher delinquencies and, for the current nine month period, deterioration in the macroeconomic outlook used in our reserve models and an increase in receivables outstanding. The reserve releases in the prior periods were primarily driven by decreases in receivables outstanding.\nOther provision for credit losses decreased for the three month period, primarily due to a lower reserve build in the current period and lower net write-offs. Other provision for credit losses increased for the nine month period, primarily due to a higher reserve build in the current period and higher net write-offs. The reserve builds in the current periods were primarily driven by increases in other loans outstanding. The reserve builds in the prior periods were primarily driven by increases in other loans outstanding and, for the prior nine month period, a reserve related to amounts due from a merchant in bankruptcy.\n5\nTable of Contents\nTable 4: Expenses Summary\nThree Months Ended \nSeptember 30,\nChange\n2025 vs. 2024\nNine Months Ended\nSeptember 30,\nChange\n2025 vs. 2024\n(Millions, except percentages)\n2025\n2024\n2025\n2024\nCard Member rewards\n$\n4,608\n \n$\n4,168 \n$\n440 \n11 \n%\n$\n13,604\n \n$\n12,169 \n$\n1,435 \n12 \n%\nBusiness development\n1,611\n \n1,430 \n181 \n13 \n4,729\n \n4,249 \n480 \n11 \nCard Member services\n1,477\n \n1,179 \n298 \n25 \n4,106\n \n3,504 \n602 \n17 \nMarketing\n1,599\n \n1,470 \n129 \n9 \n4,640\n \n4,426 \n214 \n5 \nSalaries and employee benefits\n2,239\n \n2,049 \n190 \n9 \n6,511\n \n6,096 \n415 \n7 \nOther, net\n1,780\n \n1,780 \n— \n— \n5,112\n \n4,294 \n818 \n19 \nTotal expenses\n$\n13,314\n \n$\n12,076 \n$\n1,238 \n10 \n%\n$\n38,702\n \n$\n34,738 \n$\n3,964 \n11 \n%\nExpenses\nCard Member rewards expense increased for both the three and nine month periods, driven by increases in Membership Rewards and cash back rewards expenses, collectively, of $270 million and $1,005 million, and cobrand rewards expense of $169 million and $429 million for the three and nine month periods, respectively, all of which were primarily driven by higher billed business. The increase in Membership Rewards expense was also driven by spend growth on our premium products in categories that earn incremental rewards, and, in the nine month period, by a benefit in the prior year from enhancements to the models that estimate future redemptions of Membership Reward points by U.S. Card Members. The increase in cash back rewards expense also reflected the impact associated with a card product migration. \nThe Membership Rewards Ultimate Redemption Rate (URR) for current program participants was 96 percent (rounded down) at both September 30, 2025 and 2024.\nBusiness development expense increased for both the three and nine month periods, primarily due to increased partner payments and higher client incentives, both of which were driven by higher network volumes.\nCard Member services expense increased for both the three and nine month periods, primarily due to higher usage of Card Member benefits, the introduction of new U.S. Platinum benefits and growth in premium card accounts.\nMarketing expense increased for both the three and nine month periods, primarily due to higher levels of spending on customer acquisition and brand advertising.\nSalaries and employee benefits expense increased for both the three and nine month periods, primarily driven by higher compensation and incentive costs, partially offset by restructuring costs in the prior year.\nOther expenses were flat for the three month period and increased for the nine month period. Both periods reflected higher professional services and technology costs, a prior-year release of a reserve associated with a merchant exposure for Card Member purchases and a one-time fee from a partner in the prior year, all offset by a prior-year increase in legal reserves. The nine month period also reflected the gain recognized in the prior year on the sale of Accertify.\n6\nTable of Contents\nIncome Taxes\nThe effective tax rate was 24.1 percent and 21.8 percent for the three months ended September 30, 2025 and 2024, respectively, and 21.8 percent and 21.5 percent for the nine months ended September 30, 2025 and 2024, respectively. The higher effective tax rate for the three and nine month periods primarily reflected implementation of the global minimum tax and a California tax law change that increased the proportion of income taxable in that state, largely offset for the nine month period by increased discrete tax benefits.\nTable 5: Selected Card-Related Statistical Information\nAs of or for the\nThree Months Ended\nSeptember 30,\nChange\n2025\nvs.\n2024\nAs of or for the\nNine Months Ended\nSeptember 30,\nChange\n2025\nvs.\n2024\n2025\n2024\n2025\n2024\nNetwork volumes \n(billions)\n$\n479.2\n$\n441.0\n9 \n%\n$\n1,390.8\n$\n1,300.8\n7 \n%\nBilled business\n$\n421.0\n$\n387.3\n9 \n$\n1,224.7\n$\n1,142.5\n7 \nCards-in-force \n(millions)\n151.2\n145.5\n4 \n151.2\n145.5\n4 \nProprietary cards-in-force\n86.0\n82.9\n4 \n86.0\n82.9\n4 \nBasic cards-in-force \n(millions)\n127.6\n122.4\n4 \n127.6\n122.4\n4 \nProprietary basic cards-in-force\n66.2\n63.7\n4 \n66.2\n63.7\n4 \nAverage proprietary basic Card Member spending \n(dollars)\n$\n6,387\n$\n6,110\n5 \n$\n18,751\n$\n18,224\n3 \nAverage fee per card \n(dollars) \n(a)\n$\n119\n$\n105\n13 \n%\n$\n116\n$\n101\n15 \n%\nProprietary new cards acquired \n(millions)\n3.2\n3.3\n9.6\n10.0\nDiscount revenue as a % of Billed business\n2.24\n \n%\n2.27 \n%\n2.25\n \n%\n2.28 \n%\n(a)\nAverage fee per card is computed on an annualized basis based on proprietary Net card fees divided by average proprietary total cards-in-force.\nTable 6: Network Volumes-Related Statistical Information\nThree Months Ended\nSeptember 30, 2025\nNine Months Ended\nSeptember 30, 2025\nYear over Year Percentage\nIncrease (Decrease)\nYear over Year Percentage Increase (Decrease) Assuming No Changes in FX Rates \n(a)\nYear over Year Percentage\nIncrease (Decrease)\nYear over Year Percentage Increase (Decrease) Assuming No Changes in FX Rates \n(a)\nNetwork volumes\n9\n \n%\n8\n \n%\n7\n \n%\n7\n \n%\nTotal billed business\n9\n \n8\n \n7\n \n7\n \nU.S. Consumer Services\n9\n \n8\n \nCommercial Services\n4\n \n4\n \n3\n \n3\n \nInternational Card Services\n14\n \n13\n \n13\n \n13\n \nMerchant industry billed business metrics\nG&S spend (73% and 72% of billed business for the three and nine\nmonths ended September 30, 2025, respectively)\n9\n \n9\n \n7\n \n8\n \nT&E spend (27% and 28% of billed business for the three and nine\nmonths ended September 30, 2025, respectively)\n8\n \n%\n8\n \n%\n6\n \n%\n6\n \n%\n(a)\nThe foreign currency adjusted information assumes a constant exchange rate between the periods being compared for purposes of conversion into U.S. dollars (i.e., assumes the foreign exchange rates used to determine results for the current period apply to the corresponding prior year period against which such results are being compared).\n7\nTable of Contents\nTable 7: Selected Credit-Related Statistical Information\nAs of or for the \nThree Months Ended \nSeptember 30,\nChange\n2025\nvs.\n2024\nAs of or for the\nNine Months Ended\nSeptember 30,\nChange\n2025\nvs.\n2024\n(Millions, except percentages)\n2025\n2024\n2025\n2024\nCard Member loans and receivables:\nNet write-off rate — principal, interest and fees \n(a)\n2.2\n \n%\n2.2 \n%\n2.3\n \n%\n2.3 \n%\nNet write-off rate — principal only — consumer and small business \n(a)(b)\n1.9\n \n%\n1.9 \n%\n2.0\n \n%\n2.1 \n%\n30+ days past due as a % of total — consumer and small business \n(c)\n1.3\n \n%\n1.3 \n%\n1.3\n \n%\n1.3 \n%\nCard Member loans:\nCard Member loans\n$\n144,814\n$\n134,548\n8 \n%\n$\n144,814\n$\n134,548\n8 \n%\nCredit loss reserves:\nBeginning balance\n$\n5,767\n$\n5,321\n8 \n$\n5,679\n$\n5,118\n11 \nProvisions — principal, interest and fees\n1,030\n1,114\n(8)\n3,025\n3,098\n(2)\nNet write-offs — principal less recoveries\n(760)\n(701)\n8 \n(2,349)\n(2,159)\n9 \nNet write-offs — interest and fees less recoveries\n(168)\n(152)\n11 \n(512)\n(462)\n11 \nOther \n(d)\n(1)\n6\n#\n25\n(7)\n#\nEnding balance\n$\n5,868\n$\n5,588\n5 \n$\n5,868\n$\n5,588\n5 \n% of loans\n4.1\n \n%\n4.2 \n%\n4.1\n \n%\n4.2 \n%\n% of past due\n286\n \n%\n297 \n%\n286\n \n%\n297 \n%\nAverage loans\n$\n143,974\n$\n132,956\n8 \n$\n141,085\n$\n128,652\n10 \nNet write-off rate — principal, interest and fees \n(a)\n2.6\n \n%\n2.6 \n%\n2.7\n \n%\n2.7 \n%\nNet write-off rate — principal only \n(a)\n2.1\n \n%\n2.1 \n%\n2.2\n \n%\n2.2 \n%\n30+ days past due as a % of total\n1.4\n \n%\n1.4 \n%\n1.4\n \n%\n1.4 \n%\nCard Member receivables:\nCard Member receivables\n$\n61,023\n$\n59,042\n3 \n$\n61,023\n$\n59,042\n3 \nCredit loss reserves:\nBeginning balance\n$\n193\n$\n171\n13 \n$\n171\n$\n174\n(2)\nProvisions — principal and fees\n190\n170\n12 \n562\n592\n(5)\nNet write-offs — principal and fees less recoveries\n(183)\n(187)\n(2)\n(536)\n(609)\n(12)\nOther \n(d)\n—\n2\n#\n3\n(1)\n#\nEnding balance\n$\n200\n$\n156\n28 \n%\n$\n200\n$\n156\n28 \n%\n% of receivables\n0.3\n \n%\n0.3 \n%\n0.3\n \n%\n0.3 \n%\nNet write-off rate — principal and fees \n(a)\n1.2\n \n%\n1.3 \n%\n1.2\n \n%\n1.4 \n%\nNet write-off rate — principal only — consumer and small business \n(a)(b)\n1.3\n \n%\n1.4 \n%\n1.3\n \n%\n1.6 \n%\n30+ days past due as a % of total — consumer and small business \n(c)\n1.0\n \n%\n0.9 \n%\n1.0\n \n%\n0.9 \n%\n# Denotes a variance of 100 percent or more\n(a)\nWe present a net write-off rate based on principal losses only (i.e., excluding interest and/or fees) to be consistent with industry convention. In addition, as our practice is to include uncollectible interest and/or fees as part of our total provision for credit losses, a net write-off rate including principal, interest and/or fees is also presented.\n(b)\nA net write-off rate based on principal losses only is not available for corporate receivables due to system constraints.\n(c)\nFor corporate receivables, delinquency data is tracked based on days past billing status rather than days past due. Refer to Table 11 for 90+ days past billing metrics for corporate receivables.\n(d)\nOther includes foreign currency translation adjustments.\n8\nTable of Contents\nBusiness Segment Results of Operations\nU.S. Consumer Services\nTable 8: USCS Selected Income Statement Data\nThree Months Ended\nSeptember 30,\nChange\nNine Months Ended\nSeptember 30,\nChange\n(Millions, except percentages)\n2025\n2024\n2025 vs. 2024\n2025\n2024\n2025 vs. 2024\nRevenues\nNon-interest revenues\n$\n5,620\n$\n5,028\n$\n592 \n12 \n%\n$\n16,403\n$\n14,823\n$\n1,580 \n11 \n%\nInterest income\n4,025\n3,722\n303 \n8 \n11,583\n10,677\n906 \n8 \nInterest expense\n789\n806\n(17)\n(2)\n2,328\n2,325\n3 \n— \nNet interest income\n3,236\n2,916\n320 \n11 \n9,255\n8,352\n903 \n11 \nTotal revenues net of interest expense\n8,856\n7,944\n912 \n11 \n25,658\n23,175\n2,483 \n11 \nProvisions for credit losses\n734\n812\n(78)\n(10)\n2,194\n2,245\n(51)\n(2)\nTotal revenues net of interest expense after provisions for credit losses\n8,122\n7,132\n990 \n14 \n23,464\n20,930\n2,534 \n12 \nExpenses\nCard Member rewards, business development and Card Member services\n4,145\n3,570\n575 \n16 \n11,994\n10,513\n1,481 \n14 \nMarketing\n825\n755\n70 \n9 \n2,390\n2,238\n152 \n7 \nSalaries and employee benefits and other operating expenses\n1,300\n1,148\n152 \n13 \n3,820\n3,347\n473 \n14 \nTotal expenses\n6,270\n5,473\n797 \n15 \n18,204\n16,098\n2,106 \n13 \nPretax segment income\n$\n1,852\n$\n1,659\n$\n193 \n12 \n%\n$\n5,260\n$\n4,832\n$\n428 \n9 \n%\nU.S. Consumer Services (USCS) issues a wide range of proprietary consumer cards and provides services to U.S. consumers, including travel and lifestyle services as well as banking and non-card financing products. USCS also manages our dining platform that provides digital tools for restaurants and reservation bookings for diners.\nTotal Revenues Net of Interest Expense\nNon-interest revenues increased for both the three and nine month periods, primarily driven by higher Discount revenue and Net card fees.\nDiscount revenue increased 9 percent and 7 percent for the three and nine month periods, respectively, primarily driven by increases in U.S. consumer billed business. See Tables 5, 6 and 9 for more details on billed business performance.\nNet card fees increased 19 percent and 20 percent for the three and nine month periods, respectively, primarily driven by growth in our premium card portfolios.\nService fees and other revenue increased 14 percent and 11 percent for the three and nine month periods, respectively, primarily driven by higher dining platform revenues, cash advance fees and travel commissions and fees from our consumer travel business. The increase in the nine month period was also driven by a discrete revenue adjustment in the current period related to certain cash advance fees from prior years.\nInterest income increased for both the three and nine month periods, primarily driven by growth in revolving loan balances, partially offset by lower interest rates.\nInterest expense was relatively flat for both the three and nine month periods, reflecting a lower cost of funds due to lower interest rates, offset by segment net asset growth.\n9\nTable of Contents\nProvisions for Credit Losses\nCard Member loans provision for credit losses decreased for both the three and nine month periods, primarily due to lower reserve builds in the current periods, partially offset by higher net write-offs. The reserve builds in the current periods were primarily driven by increases in loans outstanding and, for the current nine month period, deterioration in the macroeconomic outlook used in our reserve models. The reserve builds in the prior periods were primarily driven by increases in loans outstanding.\nCard Member receivables provision for credit losses increased for the three month period, primarily due to a reserve build in the current period, versus a reserve release in the prior period, partially offset by lower net-write offs. Card Member receivables provision for credit losses decreased for the current nine month period, primarily due to lower net-write offs, partially offset by a reserve build in the current period, versus a reserve release in the prior period. The reserve builds in the current periods were primarily driven by higher delinquencies. The reserve releases in the prior periods were primarily driven by decreases in receivables outstanding and, for the prior nine month period, lower delinquencies.\nOther provision for credit losses increased for both the three and nine month periods, primarily due to higher net write-offs and higher reserve builds in the current periods. The reserve builds in both current periods were primarily driven by increases in other loans outstanding.\nExpenses\nTotal expenses increased for both the three and nine month periods, primarily driven by higher Card Member rewards, Card Member services and Salaries and employee benefits and other expenses.\nCard Member rewards expense increased for both the three and nine month periods, primarily driven by increases in Membership Rewards, cash back and cobrand rewards expenses, all of which were primarily driven by higher billed business. The increase in Membership Rewards expense was also driven by spend growth on our premium products in categories that earn incremental rewards and, in the nine month period, by the above-mentioned benefit from enhancements to the U.S. URR models made in the prior year. The increase in cash back rewards expense also reflected the impact associated with a card product migration.\nBusiness development expense increased for both the three and nine month periods, primarily due to increased partner payments driven by higher billed business.\nCard Member services expense increased for both the three and nine month periods, primarily due to higher usage of Card Member benefits, the introduction of new U.S. Platinum benefits and growth in premium card accounts.\nMarketing expense increased for both the three and nine month periods, primarily due to higher levels of spending on customer acquisition and brand advertising.\nSalaries and employee benefits and other expenses increased for both the three and nine month periods, primarily due to increases in allocated service costs and higher compensation costs.\n10\nTable of Contents\nTable 9: USCS Selected Statistical Information\nAs of or for the \nThree Months Ended\nSeptember 30,\nChange\n2025\nvs.\n2024\nAs of or for the \nNine Months Ended\nSeptember 30,\nChange\n2025\nvs.\n2024\n(Millions, except percentages and where indicated)\n2025\n2024\n2025\n2024\nBilled business \n(billions)\n$\n177.5\n$\n162.3\n9 \n%\n$\n518.3\n$\n480.8\n8 \n%\nProprietary cards-in-force\n47.8\n45.7\n5 \n47.8\n45.7\n5 \nProprietary basic cards-in-force\n33.7\n32.1\n5 \n33.7\n32.1\n5 \nAverage proprietary basic Card Member spending \n(dollars)\n$\n5,291\n$\n5,091\n4 \n$\n15,634\n$\n15,313\n2 \nTotal segment assets\n$\n115,330\n$\n106,201\n9 \n$\n115,330\n$\n106,201\n9 \nCard Member loans and receivables:\nNet write-off rate — principal, interest and fees \n(a)\n2.3\n \n%\n2.4 \n%\n2.4\n \n%\n2.6 \n%\nNet write-off rate — principal only \n(a)\n1.8\n \n%\n1.9 \n%\n2.0\n \n%\n2.1 \n%\n30+ days past due as a % of total\n1.3\n \n%\n1.3 \n%\n1.3\n \n%\n1.3 \n%\nCard Member loans:\nTotal loans\n$\n94,142\n$\n86,752\n9 \n$\n94,142\n$\n86,752\n9 \nAverage loans\n$\n93,781\n$\n86,223\n9 \n$\n91,772\n$\n83,847\n9 \nNet write-off rate — principal, interest and fees \n(a)\n2.4\n \n%\n2.6 \n%\n2.7\n \n%\n2.8 \n%\nNet write-off rate — principal only \n(a)\n2.0\n \n%\n2.1 \n%\n2.1\n \n%\n2.2 \n%\n30+ days past due as a % of total\n1.4\n \n%\n1.4 \n%\n1.4\n \n%\n1.4 \n%\nCard Member receivables:\nTotal receivables\n$\n12,827\n$\n13,168\n(3)\n%\n$\n12,827\n$\n13,168\n(3)\n%\nNet write-off rate — principal and fees \n(a)\n0.9\n \n%\n1.2 \n%\n0.8\n \n%\n1.3 \n%\nNet write-off rate — principal only \n(a)\n0.8\n \n%\n1.1 \n%\n0.7\n \n%\n1.2 \n%\n30+ days past due as a % of total\n1.0\n \n%\n0.7 \n%\n1.0\n \n%\n0.7 \n%\n(a)\nRefer to Table 7 footnote (a).\n11\nTable of Contents\nCommercial Services\nTable 10: CS Selected Income Statement Data\nThree Months Ended\nSeptember 30,\nChange\n2025 vs. 2024\nNine Months Ended\nSeptember 30,\nChange\n2025 vs. 2024\n(Millions, except percentages)\n2025\n2024\n2025\n2024\nRevenues\nNon-interest revenues\n$\n3,441\n$\n3,304\n$\n137 \n4 \n%\n$\n10,128\n$\n9,831\n$\n297 \n3 \n%\nInterest income\n1,302\n1,142\n160 \n14 \n3,744\n3,198\n546 \n17 \nInterest expense\n462\n448\n14 \n3 \n1,344\n1,292\n52 \n4 \nNet interest income\n840\n694\n146 \n21 \n2,400\n1,906\n494 \n26 \nTotal revenues net of interest expense\n4,281\n3,998\n283 \n7 \n12,528\n11,737\n791 \n7 \nProvisions for credit losses\n332\n374\n(42)\n(11)\n1,021\n1,078\n(57)\n(5)\nTotal revenues net of interest expense after provisions for credit losses\n3,949\n3,624\n325 \n9 \n11,507\n10,659\n848 \n8 \nExpenses\nCard Member rewards, business development and Card Member services\n1,730\n1,627\n103 \n6 \n5,266\n4,753\n513 \n11 \nMarketing\n313\n308\n5 \n2 \n981\n959\n22 \n2 \nSalaries and employee benefits and other operating expenses\n816\n781\n35 \n4 \n2,429\n2,256\n173 \n8 \nTotal expenses\n2,859\n2,716\n143 \n5 \n8,676\n7,968\n708 \n9 \nPretax segment income\n$\n1,090\n$\n908\n$\n182 \n20 \n%\n$\n2,831\n$\n2,691\n$\n140 \n5 \n%\nCommercial Services (CS) issues a wide range of proprietary corporate and small business cards and provides services to U.S. businesses, including payment and expense management, banking and non-card financing products. CS also issues proprietary corporate cards and provides services to select global corporate clients. \nTotal Revenues Net of Interest Expense\nNon-interest revenues increased for both the three and nine month periods, primarily driven by higher Discount revenue and Net card fees.\nDiscount revenue increased 3 percent and 2 percent for the three and nine month periods, respectively, primarily driven by increases in commercial billed business. See Tables 5, 6 and 11 for more details on billed business performance.\nNet card fees increased 10 percent and 11 percent for the three and nine month periods, respectively, primarily driven by growth in our premium card portfolios.\nService fees and other revenue increased 11 percent and 2 percent for the three and nine month periods, respectively, primarily driven by higher foreign exchange-related revenues associated with Card Member cross-currency spending. The increase in three month period was also driven by higher travel commissions and fees.\nInterest income increased for both the three and nine month periods, primarily driven by growth in revolving loan balances.\nInterest expense increased for both the three and nine month periods, primarily driven by segment net asset growth, partially offset by a lower cost of funds due to lower interest rates.\n12\nTable of Contents\nProvisions for Credit Losses\nCard Member loans provision for credit losses decreased for both the three and nine month periods, primarily due to lower reserve builds in the current periods, partially offset by higher net write-offs. The reserve builds in the current periods were primarily driven by increases in loans outstanding and, for the current nine month period, deterioration in the macroeconomic outlook used in our reserve models, partially offset by the release of a reserve upon the reclassification of a small business cobrand portfolio to Card Member loans HFS. The reserve builds in the prior periods were primarily driven by increases in loans outstanding.\nCard Member receivables provision for credit losses decreased for both the three and nine month periods, primarily due to lower net write-offs and reserve releases in the current periods, versus reserve builds in the prior periods. The reserve releases in the current periods were primarily driven by lower delinquencies.\nOther provision for credit losses decreased for the three month period, primarily due to lower net write-offs. Other provision for credit losses increased for the nine month period, primarily due to a reserve build in the current period, versus a reserve release in the prior period, and higher net write-offs. The reserve build in the current nine month period was primarily driven by an increase in other loans outstanding.\nExpenses\nTotal expenses increased for both the three and nine month periods. The increase in the three month period was primarily driven by higher Business development and Card Member rewards expenses. The increase in the nine month period was primarily driven by higher Card Member rewards and Salaries and employee benefits and other expenses. \nCard Member rewards expense increased for both the three and nine month periods, primarily driven by increases in Membership Rewards and cobrand rewards expenses, which were primarily driven by higher billed business. The increase in Membership Rewards expense was also driven by spend growth on our premium products in categories that earn incremental rewards and, in the nine month period, by the above-mentioned benefit from enhancements to the U.S. URR models made in the prior year.\nBusiness development expense increased for both the three and nine month periods, primarily due to higher client incentives and increased partner payments, both of which were driven by higher billed business.\nCard Member services expense increased for both the three and nine month periods, primarily due to growth in premium card accounts, contributing to a higher usage of business services benefits.\nMarketing expense increased for both the three and nine month periods, primarily due to higher levels of spending on brand advertising.\nSalaries and employee benefits and other expenses increased for both the three and nine month periods, primarily due to increases in compensation costs and allocated service costs. The increase in the three month period was partially offset by lower technology costs. The increase in the nine month period was also driven by higher litigation-related expenses.\n13\nTable of Contents\nTable 11: CS Selected Statistical Information\nAs of or for the\nThree Months Ended\nSeptember 30,\nChange \n2025 \nvs \n2024\nAs of or for the\nNine Months Ended\nSeptember 30,\nChange \n2025 \nvs \n2024\n(Millions, except percentages and where indicated)\n2025\n2024\n2025\n2024\nBilled business \n(billions)\n$\n136.3\n$\n131.0\n4 \n%\n$\n401.0\n$\n390.4\n3 \n%\nProprietary cards-in-force\n15.4\n15.5\n(1)\n15.4\n15.5\n(1)\nAverage Card Member spending \n(dollars)\n$\n8,833\n$\n8,474\n4 \n$\n25,996\n$\n25,319\n3 \nTotal segment assets\n$\n64,305\n$\n59,716\n8 \n$\n64,305\n$\n59,716\n8 \nCard Member loans and receivables:\nNet write-off rate — principal, interest and fees \n(a)\n2.2\n \n%\n2.0 \n%\n2.2\n \n%\n2.1 \n%\nNet write-off rate — principal only — small business \n(a)(b)\n2.3\n \n%\n2.1 \n%\n2.3\n \n%\n2.2 \n%\n30+ days past due as a % of total — small business\n1.5\n \n%\n1.4 \n%\n1.5\n \n%\n1.4 \n%\nCard Member loans:\nTotal loans\n$\n30,691\n$\n29,869\n3 \n$\n30,691\n$\n29,869\n3 \nAverage loans\n$\n30,548\n$\n29,428\n4 \n$\n30,705\n$\n27,979\n10 \nNet write-off rate — principal, interest and fees \n(a)\n3.1\n \n%\n2.6 \n%\n3.0\n \n%\n2.7 \n%\nNet write-off rate — principal only \n(a)\n2.6\n \n%\n2.2 \n%\n2.6\n \n%\n2.3 \n%\n30+ days past due as a % of total\n1.6\n \n%\n1.5 \n%\n1.6\n \n%\n1.5 \n%\nCard Member receivables:\nTotal receivables\n$\n26,688\n$\n26,341\n1 \n%\n$\n26,688\n$\n26,341\n1 \n%\nNet write-off rate — principal and fees \n(a)\n1.1\n \n%\n1.3 \n%\n1.2\n \n%\n1.4 \n%\nNet write-off rate — principal only — small business \n(a)(b)\n1.5\n \n%\n1.8 \n%\n1.8\n \n%\n2.0 \n%\n30+ days past due as a % of total — small business\n1.1\n \n%\n1.2 \n%\n1.1\n \n%\n1.2 \n%\n90+ days past billing as a % of total\n \n— corporate \n(b)\n0.4\n \n%\n0.4 \n%\n0.4\n \n%\n0.4 \n%\n(a)\nRefer to Table 7 footnote (a).\n(b)\nFor corporate receivables, delinquency data is tracked based on days past billing status rather than days past due. A Card Member account is considered 90 days past billing if payment has not been received within 90 days of the Card Member’s billing statement date. In addition, if we initiate collection procedures on an account prior to the account becoming 90 days past billing, the associated Card Member receivable balance is classified as 90 days past billing. Corporate receivables delinquency data for periods other than 90+ days past billing and the net write-off rate based on principal losses only are not available due to system constraints.\n14\nTable of Contents\nInternational Card Services\nTable 12: ICS Selected Income Statement Data\nThree Months Ended\nSeptember 30,\nChange\nNine Months Ended\nSeptember 30,\nChange\n(Millions, except percentages)\n2025\n2024\n2025 vs. 2024\n2025\n2024\n2025 vs. 2024\nRevenues\nNon-interest revenues\n$\n3,034\n$\n2,659\n$\n375 \n14 \n%\n$\n8,627\n$\n7,644\n$\n983 \n13 \n%\nInterest income\n652\n588\n64 \n11 \n1,868\n1,748\n120 \n7 \nInterest expense\n350\n311\n39 \n13 \n991\n921\n70 \n8 \nNet interest income\n302\n277\n25 \n9 \n877\n827\n50 \n6 \nTotal revenues net of interest expense\n3,336\n2,936\n400 \n14 \n9,504\n8,471\n1,033 \n12 \nProvisions for credit losses\n218\n158\n60 \n38 \n620\n532\n88 \n17 \nTotal revenues net of interest expense after provisions for credit losses\n3,118\n2,778\n340 \n12 \n8,884\n7,939\n945 \n12 \nExpenses\nCard Member rewards, business development and Card Member services\n1,512\n1,296\n216 \n17 \n4,276\n3,801\n475 \n12 \nMarketing\n350\n287\n63 \n22 \n972\n929\n43 \n5 \nSalaries and employee benefits and other operating expenses\n815\n740\n75 \n10 \n2,349\n2,212\n137 \n6 \nTotal expenses\n2,677\n2,323\n354 \n15 \n7,597\n6,942\n655 \n9 \nPretax segment income\n$\n441\n$\n455\n$\n(14)\n(3)\n%\n$\n1,287\n$\n997\n$\n290 \n29 \n%\nInternational Card Services (ICS) issues a wide range of proprietary consumer, small business and corporate cards outside the United States. ICS also provides services to our international customers, including travel and lifestyle services, and manages certain international joint ventures and our loyalty coalition business.\nTotal Revenues Net of Interest Expense\nNon-interest revenues increased for both the three and nine month periods, primarily driven by higher Discount revenue and Net card fees.\nDiscount revenue increased 12 percent and 11 percent for the three and nine month periods, respectively, primarily reflecting increases in billed business. See Tables 5, 6 and 13 for more details on billed business performance.\nNet card fees increased 19 percent for both the three and nine month periods, primarily driven by growth in our premium card portfolios.\nService fees and other revenue increased 14 percent and 12 percent for the three and nine month periods, respectively (11 percent for both the three and nine month periods on an FX-adjusted basis), primarily driven by increases in foreign exchange related revenues associated with Card Member cross-currency spending, higher loyalty coalition-related fees and higher income from equity method investments primarily related to the partial sale of a card portfolio by one of our joint ventures.\n2\nInterest income increased for both the three and nine month periods, primarily driven by growth in revolving loan balances, partially offset by lower interest rates.\nInterest expense increased for both the three and nine month periods, primarily driven by a higher cost of funds due to segment net asset growth, partially offset by lower interest rates.\n2\n \nRefer to footnote 1 on page 3 for details regarding foreign currency adjusted information.\n15\nTable of Contents\nProvisions for Credit Losses\nCard Member loans provision for credit losses increased for the three month period, primarily due to higher net write-offs and a reserve build in the current period, versus a reserve release in the prior period. Card Member loans provision for credit losses increased for the nine month period, primarily due to higher net write-offs and a higher reserve build in the current period. The reserve builds in the current periods were primarily driven by increases in loans outstanding.\nCard Member receivables provision for credit losses increased for both the three and nine month periods, primarily due to higher net write-offs and reserve builds in the current periods, versus reserve releases in the prior periods. The reserve builds in the current periods were primarily driven by increases in receivables outstanding and, for the current nine month period, higher delinquencies.\nExpenses\nTotal expenses increased for both the three and nine month periods, primarily driven by higher Card Member rewards, Salaries and employee benefits and other expenses and Marketing expenses. The increase in the nine month period was also driven by higher Card Member services expenses. \nCard Member rewards expense increased for both the three and nine month periods, primarily driven by increases in cobrand rewards and Membership Rewards expenses, which were primarily driven by higher billed business.\nBusiness development expense increased for both the three and nine month periods, primarily due to higher loyalty coalition-related costs and increased partner payments driven by higher billed business.\nCard Member services expense increased for both the three and nine month periods, primarily due to growth in premium card accounts, contributing to a higher usage of travel-related benefits.\nMarketing expense increased for both the three and nine month periods, reflecting higher levels of spending on customer acquisition and other growth initiatives.\nSalaries and employee benefits and other expenses increased for both the three and nine month periods, primarily driven by a one-time fee from a partner in the prior year and higher allocated service costs.\n16\nTable of Contents\nTable 13: ICS Selected Statistical Information\nAs of or for the\nThree Months Ended\nSeptember 30,\nChange\n2025\nvs.\n2024\nAs of or for the\nNine Months Ended\nSeptember 30,\nChange\n2025\nvs.\n2024\n(Millions, except percentages and where indicated)\n2025\n2024\n2025\n2024\nBilled business \n(billions)\n$\n106.9\n$\n93.6\n14 \n%\n$\n303.6\n$\n269.2\n13 \n%\nProprietary cards-in-force\n22.8\n21.7\n5 \n22.8\n21.7\n5 \nProprietary basic cards-in-force\n17.0\n16.2\n5 \n17.0\n16.2\n5 \nAverage proprietary basic Card Member spending \n(dollars)\n$\n6,307\n$\n5,829\n8 \n$\n18,136\n$\n16,956\n7 \nTotal segment assets\n$\n47,253\n$\n43,073\n10 \n$\n47,253\n$\n43,073\n10 \nCard Member loans and receivables:\nNet write-off rate — principal, interest and fees \n(a)\n2.0\n \n%\n1.8 \n%\n1.9\n \n%\n2.0 \n%\nNet write-off rate — principal only — consumer and small business \n(a)(b)\n1.8\n \n%\n1.7 \n%\n1.8\n \n%\n1.9 \n%\n30+ days past due as a % of total — consumer and small business\n1.1\n \n%\n1.0 \n%\n1.1\n \n%\n1.0 \n%\nCard Member loans — consumer and small business:\nTotal loans\n$\n19,981\n$\n17,927\n11 \n$\n19,981\n$\n17,927\n11 \nAverage loans\n$\n19,645\n$\n17,305\n14 \n$\n18,608\n$\n16,826\n11 \nNet write-off rate — principal, interest and fees \n(a)\n2.5\n \n%\n2.4 \n%\n2.4\n \n%\n2.5 \n%\nNet write-off rate — principal only \n(a)\n2.1\n \n%\n2.0 \n%\n2.0\n \n%\n2.1 \n%\n30+ days past due as a % of total\n1.2\n \n%\n1.2 \n%\n1.2\n \n%\n1.2 \n%\nCard Member receivables:\nTotal receivables\n$\n21,508\n$\n19,533\n10 \n%\n$\n21,508\n$\n19,533\n10 \n%\nNet write-off rate — principal and fees \n(a)\n1.5\n \n%\n1.3 \n%\n1.4\n \n%\n1.5 \n%\nNet write-off rate — principal only — consumer and small business \n(a)(b)\n1.6\n \n%\n1.4 \n%\n1.5\n \n%\n1.6 \n%\n30+ days past due as a % of total — consumer and small business\n1.0\n \n%\n0.9 \n%\n1.0\n \n%\n0.9 \n%\n90+ days past billing as a % of total — corporate \n(b)\n0.3\n \n%\n0.4 \n%\n0.3\n \n%\n0.4 \n%\n(a)\nRefer to Table 7 footnote (a).\n(b)\nFor corporate receivables, delinquency data is tracked based on days past billing status rather than days past due. A Card Member account is considered 90 days past billing if payment has not been received within 90 days of the Card Member’s billing statement date. In addition, if we initiate collection procedures on an account prior to the account becoming 90 days past billing, the associated Card Member receivable balance is classified as 90 days past billing. Corporate receivables delinquency data for periods other than 90+ days past billing and the net write-off rate based on principal losses only are not available due to system constraints.\n17\nTable of Contents\nGlobal Merchant and Network Services\nTable 14: GMNS Selected Income Statement and Other Data\nThree Months Ended\nSeptember 30,\nChange \n2025 vs. 2024\nNine Months Ended\nSeptember 30,\nChange \n2025 vs. 2024\n(Millions, except percentages and where indicated)\n2025\n2024\n2025\n2024\nRevenues\nNon-interest revenues\n$\n1,782\n$\n1,667\n$\n115 \n7 \n%\n$\n5,200\n$\n5,006\n$\n194 \n4 \n%\nInterest income\n9\n11\n(2)\n(18)\n31\n41\n(10)\n(24)\nInterest expense\n(181)\n(169)\n(12)\n(7)\n(489)\n(543)\n54 \n10 \nNet interest income\n190\n180\n10 \n6 \n520\n584\n(64)\n(11)\nTotal revenues net of interest expense\n1,972\n1,847\n125 \n7 \n5,720\n5,590\n130 \n2 \nProvisions for credit losses\n5\n10\n(5)\n(50)\n8\n36\n(28)\n(78)\nTotal revenues net of interest expense after provisions for credit losses\n1,967\n1,837\n130 \n7 \n5,712\n5,554\n158 \n3 \nExpenses\nBusiness development and Card Member services\n298\n269\n29 \n11 \n869\n826\n43 \n5 \nMarketing\n105\n112\n(7)\n(6)\n277\n281\n(4)\n(1)\nSalaries and employee benefits and other operating expenses\n524\n465\n59 \n13 \n1,482\n902\n580 \n64 \nTotal expenses\n927\n846\n81 \n10 \n2,628\n2,009\n619 \n31 \nPretax segment income\n1,040\n991\n49 \n5 \n3,084\n3,545\n(461)\n(13)\nNetwork volumes \n(billions)\n479.2\n441.0\n$\n38 \n9 \n1,390.8\n1,300.8\n$\n90 \n7 \nTotal segment assets\n$\n18,879\n$\n17,739\n6 \n%\n$\n18,879\n$\n17,739\n6 \n%\nGlobal Merchant and Network Services (GMNS) operates a global payments network that processes and settles card transactions, acquires merchants and provides multi-channel marketing programs and capabilities, services and data analytics, leveraging our global integrated network. GMNS manages our partnership relationships with third-party card issuers, merchant acquirers and a prepaid reloadable and gift card program manager, licensing the American Express brand and extending the reach of the global network.\nTotal Revenues Net of Interest Expense\nNon-interest revenues increased for both the three and nine month periods, primarily driven by higher Discount revenue and Service fees and other revenue.\nDiscount revenue increased 5 percent and 4 percent for the three and nine month periods, respectively, primarily driven by increases in billed business, partially offset by lower average merchant discount rates due to shifts in merchant spend mix. See Tables 5 and 6 for more details on billed business performance.\nService fees and other revenue increased 10 percent and 4 percent for the three and nine month periods, respectively, primarily driven by increases in network partnership revenues and foreign exchange related revenues associated with Card Member cross-currency spending, partially offset in the nine month period by Accertify revenues included in the prior year.\nGMNS receives an interest expense credit relating to internal transfer pricing due to its merchant payables. Net interest income increased for the three month period and decreased for the nine month period. The increase in the three month period was primarily due to a higher interest expense credit, primarily driven by an increase in average merchant payables, partially offset by lower interest rates in international markets. The decrease in the nine month period was primarily due to a lower interest expense credit, primarily driven by lower interest rates in international markets.\n18\nTable of Contents\nExpenses\nTotal expenses increased for both the three and nine month periods, primarily driven by higher Salaries and employee benefits and other expenses. \nBusiness development expense increased for both the three and nine month periods, primarily due to increased partner payments driven by higher volumes. \nMarketing expense decreased for the three month period and was relatively flat for the nine month period, primarily due to management decisions regarding the timing of spend on merchant engagement and other growth initiatives. \nSalaries and employee benefits and other expenses increased for both the three and nine month periods. The increase in the three month period was primarily driven by a prior-year release of a reserve associated with a merchant exposure for Card Member purchases, as well as an increase in legal reserves, partially offset by a decrease in allocated service costs. The increase in the nine month period was primarily driven by the gain in the prior year recognized on the sale of Accertify included in the Other, net component of operating expenses.\n19\nTable of Contents\nCorporate & Other\nCorporate functions and certain other businesses are included in Corporate & Other.\nCorporate & Other pretax loss was $598 million and $809 million for the three months ended September 30, 2025 and 2024, respectively, and $1.8 billion and $1.9 billion for the nine months ended September 30, 2025 and 2024, respectively. The decreases in the pretax loss for both periods were primarily driven by a prior-year increase in legal reserves and the previously-mentioned gain related to an equity transaction by Global Business Travel Group, Inc., an equity method investee, partially offset by increases in the value of deferred compensation liabilities.\nCONSOLIDATED CAPITAL RESOURCES AND LIQUIDITY\nOur balance sheet management objectives are to maintain:\n•\nA solid and flexible equity capital profile;\n•\nA broad, deep and diverse set of funding sources to finance our assets and meet operating requirements; and\n•\nLiquidity programs that enable us to continuously meet expected future financing obligations and business requirements for at least a twelve month period under a variety of adverse circumstances.\nWe continue to see volatility in the capital markets due to a variety of factors and manage our balance sheet to reflect evolving circumstances.\nCapital\nWe believe capital allocated to growing businesses with a return on risk-adjusted equity in excess of our costs will generate shareholder value. Our objective is to retain sufficient levels of capital generated through net income and other sources, such as the issuance of subordinated debt and preferred shares, as well as the exercise of stock options by colleagues, to maintain a strong balance sheet, provide flexibility to support future business growth, and distribute excess capital to shareholders through dividends and share repurchases. See “Dividends and Share Repurchases” below.\nWe seek to maintain capital levels and ratios in excess of our minimum regulatory requirements, specifically within a 10 to 11 percent target range for American Express Company’s Common Equity Tier 1 (CET1) risk-based capital ratio.\nWe maintain certain flexibility to shift capital across our businesses as appropriate. For example, we may infuse additional capital into subsidiaries to maintain capital at targeted levels in consideration of debt ratings and regulatory requirements. These infused amounts can affect the capital and liquidity positions at American Express Company or at our subsidiaries.\nWe report our capital ratios using the Basel III capital definitions and the Basel III standardized approach for calculating risk-weighted assets.\n20\nTable of Contents\nThe following table presents our regulatory risk-based capital and leverage ratios and those of American Express National Bank (AENB), as of September 30, 2025:\nTable 15: Regulatory Risk-Based Capital and Leverage Ratios\nEffective Minimum\n (a)\nRatios as of September 30, 2025\nRisk-Based Capital\nCommon Equity Tier 1\n7.0\n \n%\nAmerican Express Company\n10.5\n \n%\nAmerican Express National Bank\n11.0\n \nTier 1\n8.5\n \nAmerican Express Company\n11.1\n \nAmerican Express National Bank\n11.0\n \nTotal\n10.5\n \nAmerican Express Company\n13.1\n \nAmerican Express National Bank\n13.1\n \nTier 1 Leverage\n4.0\n \nAmerican Express Company\n9.5\n \nAmerican Express National Bank\n8.5\n \nSupplementary Leverage Ratio\n3.0\n \n%\nAmerican Express Company\n8.1\n \nAmerican Express National Bank\n7.2\n \n%\n(a)\nRepresents Basel III minimum requirements and applicable regulatory buffers as defined by the federal banking regulators, which includes the stress capital buffer (SCB) for American Express Company and the capital conservation buffer for AENB.\nThe following table presents American Express Company’s regulatory risk-based capital and risk-weighted assets as of September 30, 2025:\nTable 16: Regulatory Risk-Based Capital Components and Risk-Weighted Assets\nAmerican Express Company\n($ in Millions)\nSeptember 30, 2025\nRisk-Based Capital\nCommon Equity Tier 1\n$\n26,222\n \nTier 1 Capital\n27,848\n \nTier 2 Capital\n4,915\n \nTotal Capital\n32,763\n \nRisk-Weighted Assets\n250,642\n \nAverage Total Assets to calculate the Tier 1 Leverage Ratio\n292,875\n \nTotal Leverage Exposure to calculate the Supplementary Leverage Ratio\n$\n344,532\n \nThe following are definitions for our regulatory risk-based capital and leverage ratios, which are calculated as per standard regulatory guidance:\nRisk-Weighted Assets\n — Assets are weighted for risk according to a formula used by the Federal Reserve to conform to capital adequacy guidelines. On- and off-balance sheet items are risk weighted, with off-balance sheet items converted to balance sheet equivalents, using risk conversion factors, before being assigned a risk weight. Off-balance sheet exposures comprise a minimal part of the total risk-weighted assets.\nCommon Equity Tier 1 Risk-Based Capital Ratio \n— Calculated as CET1 capital, divided by risk-weighted assets. CET1 capital is common shareholders’ equity, adjusted for ineligible goodwill and intangible assets and certain deferred tax assets. \nTier 1 Risk-Based Capital Ratio\n — Calculated as Tier 1 capital divided by risk-weighted assets. Tier 1 capital is the sum of CET1 capital, preferred shares and third-party non-controlling interests in consolidated subsidiaries, adjusted for capital held by insurance subsidiaries. We have $1.6 billion of preferred shares outstanding to help address a portion of the Tier 1 capital requirements in excess of common equity requirements.\n21\nTable of Contents\nTotal Risk-Based Capital Ratio\n — Calculated as the sum of Tier 1 capital and Tier 2 capital, divided by risk-weighted assets. Tier 2 capital is the sum of the allowable allowance for credit losses and $1,750 million of eligible subordinated notes, adjusted for capital held by insurance subsidiaries. The $1,750 million of eligible subordinated notes includes the $500 million subordinated debt issued in April 2024, the $500 million subordinated debt issued in July 2023 and the $750 million subordinated debt issued in May 2022.\nTier 1 Leverage Ratio\n — Calculated as Tier 1 capital divided by average total consolidated assets for the most recent quarter. Average total consolidated assets are net of amounts that are deducted from Tier 1 capital.\nSupplementary Leverage Ratio\n — Calculated as Tier 1 capital divided by total leverage exposure. Total leverage exposure includes total average on-balance sheet assets and certain off-balance sheet exposures, net of amounts that are deducted from Tier 1 capital.\nWe continue to include accumulated other comprehensive income (loss) in regulatory capital.\nWe are subject to an annual supervisory stress test conducted by the Federal Reserve. We submitted our annual capital plan to the Federal Reserve in April 2025. On August 29, 2025, the Federal Reserve confirmed our SCB requirement at 2.5 percent, resulting in a minimum CET1 ratio of 7 percent, effective from October 1, 2025 to September 30, 2026.\nDividends and Share Repurchases\nWe return capital to common shareholders through dividends and share repurchases. The share repurchases reduce common shares outstanding and generally more than offset the issuance of new shares as part of employee compensation plans.\nDuring the three and nine months ended September 30, 2025, we returned $2,906 million and $6,131 million, respectively, to our shareholders in the form of share repurchases of $2,338 million and $4,412 million, respectively, and common stock dividends of $567 million and $1,719 million, respectively. We repurchased 7.3 million common shares at an average price of $315.26 in the third quarter of 2025. These share repurchase and common stock dividend amounts collectively represent approximately 101 percent and 74 percent of net income available to common shareholders during the three and nine month periods, respectively.\nIn addition, during the three and nine months ended September 30, 2025, we paid $14 million and $43 million, respectively, in dividends on non-cumulative perpetual preferred shares outstanding.\nFunding Strategy\nOur principal funding objective is to maintain broad and well-diversified funding sources to allow us to finance our global businesses and to maintain a strong liquidity profile. Our funding strategy and activities are integrated into our asset-liability management activities. We have in place a funding policy covering American Express Company and all of our subsidiaries\n.\nWe aim to satisfy our financing needs with a diverse set of funding sources. The diversity of funding sources by type of instrument, by tenor and by investor base, among other factors, mitigates the impact of disruptions in any one type of instrument, tenor or investor. We seek to achieve diversity and cost efficiency in our funding sources by maintaining scale and market relevance in deposits, unsecured debt and asset securitizations and access to secured borrowing facilities and a committed bank credit facility. In particular, we are focused on continuing to grow our direct deposit program as a funding source.\n22\nTable of Contents\nSummary of Consolidated Debt\nWe had the following customer deposits and consolidated debt outstanding as of September 30, 2025 and December 31, 2024:\nTable 17: Summary of Customer Deposits and Consolidated Debt\n(Billions)\nSeptember 30, 2025\nDecember 31, 2024\nCustomer deposits\n$\n149.9\n \n$\n139.4 \nShort-term borrowings\n1.4\n \n1.4 \nLong-term debt\n57.8\n \n49.7 \nTotal customer deposits and debt\n$\n209.1\n \n$\n190.5 \nWe may redeem from time to time certain debt securities prior to the original contractual maturity dates in accordance with the optional redemption provisions of those debt securities.\nOur funding needs are driven by, among other factors, maturing obligations, our liquidity position and the pace of growth in our loans and receivables balances. Actual funding activities can vary due to various factors, such as future business growth, liquidity needs, the impact of global economic, political and other events on market capacity, demand for securities offered by us, regulatory changes, ability to securitize and sell loans and receivables, and the performance of loans and receivables previously sold in securitization transactions. Many of these factors are beyond our control.\nWe issued $19.5 billion of debt during the nine months ended September 30, 2025, consisting of $13.1 billion of unsecured debt and $6.4 billion of asset-backed securities. The following table presents our debt issuances for the three months ended September 30, 2025:\nTable 18: Debt Issuances\n($ in Billions)\nThree Months Ended\nSeptember 30, 2025\nAmerican Express Company:\nFloating Rate Senior Notes (compounded SOFR\n(a)\n plus 81 basis points)\n$\n0.8\n \nFixed-to-Floating Rate Senior Notes (weighted-average coupon of 4.66% during the fixed rate period and compounded SOFR\n(a)\n plus weighted-average spread of 103 basis points during the floating rate period)\n3.3\n \nAmerican Express Credit Account Master Trust:\nFixed Rate Class A Certificates (weighted-average coupon of 4.38%)\n2.5\n \nTotal\n$\n6.5\n \n(a)\nSecured overnight financing rate (SOFR).\n23\nTable of Contents\nOur equity capital and funding strategies are designed, among other things, to maintain appropriate and stable unsecured debt ratings from the major credit rating agencies: Moody’s Investor Services (Moody’s), Standard & Poor’s (S&P) and Fitch Ratings (Fitch). Such ratings help support our access to cost-effective unsecured funding as part of our overall funding strategy. Our asset securitization activities are rated separately.\nTable 19: Unsecured Debt Ratings\nAmerican Express Entity\nMoody’s\nS&P\nFitch\nAmerican Express Company\nLong Term\nA2\nA-\nA\nShort Term\nN/R\nA-2\nF1\nOutlook\nStable\nStable\nStable\nAmerican Express Travel Related Services Company, Inc.\nLong Term\nA2\nA\nA\nShort Term\nP-1\nA-1\nF1\nOutlook\nStable\nStable\nStable\nAmerican Express National Bank\nLong Term\nA3\nA\nA\nShort Term\nP-1\nA-1\nF1\nOutlook\nStable\nStable\nStable\nAmerican Express Credit Corporation\nLong Term\nA2\nA\nA\nShort Term\nN/R\nN/R\nN/R\nOutlook\nStable\nStable\nStable\nThese ratings are not a recommendation to buy or hold any of our securities and they may be revised or revoked at any time at the sole discretion of the rating organization.\nDowngrades in the ratings of our unsecured debt or asset securitization program securities could result in higher funding costs, as well as higher fees related to borrowings under our unused credit facilities. Declines in credit ratings could also reduce our borrowing capacity in the unsecured debt and asset securitization capital markets. We believe our funding mix, including the proportion of U.S. direct deposits insured by the Federal Deposit Insurance Corporation (FDIC) to total funding, should reduce the impact that credit rating downgrades would have on our funding capacity and costs.\n24\nTable of Contents\nDeposit Programs\nWe offer deposits within our U.S. bank subsidiary, AENB. These funds are currently insured up to an amount that is at least $250,000 per depositor, per ownership category through the FDIC\n; as of September 30, 2025, \napproximately 92 percent of these deposits were insured.\n Our ability to ob\ntain deposit funding and offer competitive interest rates is dependent on, among other factors, the capital level of AENB. The direct deposit program offered by AENB is our primary deposit product channel, which makes FDIC-insured high-yield savings account, certificates of deposit (CDs), business checking and consumer rewards checking account products avail\nable directly to customers. As of September 30, 2025, \nour direct deposit program had approximately 3.8 million accounts. AENB also sources deposits through third-party distribution channels as needed to meet our overall funding objectives. CDs carry stated maturities while high-yield savings account, checking account and third-party sweep deposit products do not. We manage the duration of our maturing obligations, including CDs, to reduce concentration and refinancing risk.\nAs of September 30, 2025 and December 31, 2024, we had $149.9 billion and $139.4 billion, respectively, in deposits. Refer to Note 6 to the “Consolidated Financial Statements” for a further description of these deposits and scheduled maturities of certificates of deposits.\nThe following tables set forth the average interest rates we paid on different types of deposits during the three and nine months ended September 30, 2025 and 2024. The change in the average interest rate we paid on our interest-bearing deposits compared to the prior year was primarily due to the impact of lower market interest rates offered for savings deposits.\nTable 20: Average Interest Rates Paid on Deposits\nThree Months Ended September 30,\n2025\n2024\n(Millions, except percentages)\nAverage Balance\nInterest Expense\nAverage Interest Rate \n(a)\nAverage Balance\nInterest Expense\nAverage Interest Rate \n(a)\nSavings accounts\n$\n113,934\n \n$\n1,003\n \n3.5\n \n%\n$\n103,602 \n$\n1,089 \n4.2 \n%\nChecking accounts\n2,649\n8\n \n1.2\n \n1,731 \n6 \n1.4 \nCertificates of deposit:\nDirect\n4,914\n48\n3.9\n \n4,831\n52\n4.3 \nThird-party (brokered)\n11,875\n132\n4.4\n \n7,899\n83\n4.2 \nSweep accounts — Third-party (brokered)\n15,431\n180\n4.6\n \n15,194\n215\n5.6 \nTotal U.S. interest-bearing deposits\n$\n148,803\n \n$\n1,370\n \n3.7\n \n%\n$\n133,257 \n$\n1,445 \n4.3 \n%\nNine Months Ended September 30,\n2025\n2024\n(Millions, except percentages)\nAverage Balance\nInterest Expense\nAverage Interest Rate \n(a)\nAverage Balance\nInterest Expense\nAverage Interest Rate \n(a)\nSavings accounts\n$\n112,430\n \n$\n3,026\n \n3.6\n \n%\n$\n99,855 \n$\n3,154 \n4.2 \n%\nChecking accounts\n2,417\n \n29\n \n1.6\n \n1,577 \n16 \n1.4 \nCertificates of deposit:\nDirect\n4,577\n136\n4.0\n \n5,114\n162\n4.2 \nThird-party (brokered)\n10,727\n353\n4.4\n \n10,212\n312\n4.1 \nSweep accounts — Third-party (brokered)\n15,414\n536\n4.6\n \n15,395\n651\n5.6 \nTotal U.S. interest-bearing deposits\n$\n145,565\n \n$\n4,080\n \n3.7\n \n%\n$\n132,153 \n$\n4,295 \n4.3 \n%\n(a)\nAverage interest rate reflects interest expense divided by average deposits, computed on an annualized basis.\n25\nTable of Contents\nLiquidity Management\nOur liquidity objective is to maintain access to a diverse set of on- and off-balance sheet liquidity sources. We seek to maintain liquidity sources in amounts sufficient to meet our expected future financial obligations and business requirements for liquidity for a period of at least twelve months under a variety of adverse circumstances. These include, but are not limited to, an event where we are unable to raise new funds under our regular funding programs during a substantial weakening in economic conditions.\nOur liquidity management strategy includes a number of elements, including, but not limited to:\n•\nMaintaining diversified funding sources (refer to “Funding Strategy” above for more details);\n•\nMaintaining unencumbered liquid assets and off-balance sheet liquidity sources;\n•\nProjecting cash inflows and outflows under a variety of economic and market scenarios; and\n•\nEstablishing clear objectives for liquidity risk management, including compliance with regulatory requirements.\nWe seek to maintain access to a diverse set of on-balance sheet and off-balance sheet liquidity sources, including cash and other liquid assets, secured borrowing facilities and a committed bank credit facility. Through our U.S. bank subsidiary, AENB, we have also pledged collateral eligible for use at the Federal Reserve’s discount window.\nThe amount and type of liquidity resources we maintain can vary over time, based upon the results of stress scenarios required under the Dodd-Frank Wall Street Reform and Consumer Protection Act, as well as additional stress scenarios required under our liquidity risk policy. Additionally, we are subject to the regulatory requirements under the liquidity coverage ratio and net stable funding ratio rules, subject to applicable transition periods. See the “Supervision and Regulation — Capital and Liquidity Regulation” section of our Annual Report on Form 10-K for the year ended December 31, 2024 (the 2024 Form 10-K) for more information. We believe that we currently maintain sufficient liquidity to meet all internal and regulatory liquidity requirements.\nAs of September 30, 2025 and December 31, 2024, we had $54.7 billion and $40.6 billion in Cash and cash equivalents, respectively. Refer to the “Cash Flows” section below for a discussion of the major drivers impacting cash flows for the nine months ended September 30, 2025. Depending on the interest rate environment, our funding composition and the amount of liquidity resources we maintain, the level of future net interest income or expense associated with our liquidity resources will vary. During the three months ended September 30, 2025, interest income exceeded the interest expense associated with the liquidity portfolio.\nSecuritized Borrowing Capacity\nAs of September 30, 2025, we maintained committed, revolving, secured borrowing facilities that give us the right to sell up to $3.0 billion face amount of eligible AAA notes from the American Express Issuance Trust II (the Charge Trust) and up to $2.0 billion face amount of eligible AAA certificates from American Express Credit Account Master Trust (the Lending Trust). The Charge Trust facility has a maturity date of July 17, 2028. On September 26, 2025, we extended the Lending Trust facility by two years to mature on September 15, 2028, and decreased the maximum face amount of eligible AAA certificates that can be sold using this facility from $3.0 billion to $2.0 billion. These facilities enhance our contingent funding resources and are also used in the ordinary course of business to fund working capital needs. As of September 30, 2025, no amounts were drawn on the Charge Trust facility or Lending Trust facility.\nCommitted Bank Credit Facility\nAs of September 30, 2025, we maintained a committed syndicated bank credit facility of $6.0 billion. On September 24, 2025, we extended this facility by two years to mature on September 24, 2028, and increased the maximum borrowing capacity from $4.0 billion to $6.0 billion. This facility enhances our contingent funding resources and is also used in the ordinary course of business to fund working capital needs. As of September 30, 2025, no amount was drawn on this facility.\nOther Sources of Liquidity\nIn addition to cash and other liquid assets and the secured borrowing facilities and committed bank credit facility described above, as an insured depository institution, AENB may borrow from the Federal Reserve Bank of San Francisco through the discount window against the U.S. credit card loans and charge card receivables that it pledged. \nAs of September 30, 2025, AENB had available borrowing capacity of $79.0 billion based on the amount and collateral valuation of receivables that were pledged to the Federal Reserve Bank of San Francisco. Whether specific assets will be considered qualifying collateral and the amount that may be borrowed against the collateral remain at the discretion of the Federal Reserve and can change from time to time. Due to regulatory restrictions, liquidity generated by AENB can generally be used only to fund obligations within AENB, and transfers to the parent company or non-bank affiliates may be subject to prior regulatory approval.\n26\nTable of Contents\nUnused Credit Outstanding\nAs of September 30, 2025, we had approximately $505 billion of unused credit available to customers. Total unused credit does not represent potential future cash requirements, as a significant portion of this unused credit will likely not be drawn. Charge card products with no pre-set spending limits are not reflected in unused credit.\nCash Flows\nThe following table summarizes our cash flow activity, followed by a discussion of the major drivers impacting operating, investing and financing cash flows for the nine months ended September 30:\nTable 21: Cash Flows\n(Billions)\n2025\n2024\nTotal cash provided by (used in):\nOperating activities\n$\n15.4\n \n$\n8.3 \nInvesting activities\n(12.9)\n(12.2)\nFinancing activities\n11.4\n \n5.2 \nEffect of foreign currency exchange rates on cash and cash equivalents\n0.3\n \n— \nNet increase in cash and cash equivalents\n$\n14.1\n \n$\n1.3 \nCash Flows from Operating Activities\nOur cash flows from operating activities primarily include net income adjusted for (i) non-cash items included in net income, such as provisions for credit losses, depreciation and amortization, stock-based compensation, deferred taxes and other non-cash items and (ii) changes in the balances of operating assets and liabilities, which can vary significantly in the normal course of business due to the amount and timing of payments.\nIn 2025, the net cash provided by operating activities was driven by cash generated from net income for the period and higher net operating liabilities, primarily driven by higher book overdrafts due to timing differences arising in the ordinary course of business.\nIn 2024, the net cash provided by operating activities was driven by cash generated from net income for the period, partially offset by lower net operating liabilities, primarily driven by lower book overdrafts due to timing differences arising in the ordinary course of business.\nCash Flows from Investing Activities\nOur cash flows from investing activities primarily include changes in loans and Card Member receivables, as well as changes in our available-for-sale investment securities portfolio.\nIn 2025, the net cash used in investing activities was primarily driven by higher loans outstanding and the acquisition of a business.\nIn 2024, the net cash used in investing activities was primarily driven by higher loans outstanding, partially offset by net maturities of investment securities and net proceeds received from the sale of Accertify.\nCash Flows from Financing Activities\nOur cash flows from financing activities primarily include changes in customer deposits, long-term debt and short-term borrowings, as well as dividend payments and share repurchases.\nIn both periods, the net cash provided by financing activities was primarily driven by growth in customer deposits and net proceeds from long-term debt, partially offset by share repurchases and dividend payments.\n27\nTable of Contents\nOTHER MATTERS\nCertain Legislative, Regulatory and Other Developments\nSupervision & Regulation\nWe are subject to evolving and extensive government regulation and supervision in jurisdictions around the world, and the costs of ongoing compliance are substantial. The financial services industry is subject to rigorous scrutiny, high regulatory expectations, a range of regulations and a stringent and unpredictable enforcement environment.\nGovernmental authorities have focused, and we believe will continue to focus, considerable attention on reviewing compliance by financial services firms and payment systems with laws and regulations, and as a result, we continually work to evolve and improve our risk management framework, governance structures, practices and procedures. Reviews by us and governmental authorities to assess compliance with laws and regulations, as well as our own internal reviews to assess compliance with internal policies, including errors or misconduct by colleagues or third parties or control failures, have resulted in, and are likely to continue to result in, changes to our products, practices and procedures, restitution to our customers and increased costs related to regulatory oversight, supervision and examination. We have also been subject to regulatory actions and may continue to be the subject of such actions, including governmental inquiries, investigations, enforcement proceedings and the imposition of fines or civil money penalties, in the event of noncompliance or alleged noncompliance with laws or regulations. For example, as previously disclosed, we have identified certain issues related to our rewards and benefits programs and have taken actions to remediate the issues and enhance our related procedures and controls.\nPlease see the “Supervision and Regulation” and “Risk Factors” sections of the 2024 Form 10-K for further information.\nEnhanced Prudential Standards\nWe are subject to the U.S. federal bank regulatory agencies’ rules that tailor the application of enhanced prudential standards to bank holding companies and depository institutions with $100 billion or more in total consolidated assets. Under these rules, American Express Company became a Category III firm in the third quarter of 2024. Category III firms are subject to heightened capital, liquidity and prudential requirements, single-counterparty credit limits and additional stress tests, which in some cases are subject to a transition period. Please see the “Supervision and Regulation” and “Risk Factors” sections of the 2024 Form 10-K for further information.\nConsumer Financial Products Regulation\nOur consumer-oriented activities are subject to regulation and supervision in the United States and internationally. In the United States, our marketing, sale and servicing of consumer financial products and our compliance with certain federal consumer financial laws are supervised and examined by the Consumer Financial Protection Bureau (CFPB), which has broad rulemaking and enforcement authority over providers of credit, savings and payment services and products and authority to prevent “unfair, deceptive or abusive” acts or practices. In addition, a number of U.S. states and international jurisdictions have significant consumer protection, suitability and other laws (in certain cases more stringent than U.S. federal laws). U.S. federal law also regulates abusive debt collection practices, which, along with bankruptcy and debtor relief laws, can affect our ability to collect amounts owed to us or subject us to regulatory scrutiny.\nFor more information on consumer financial products regulation, as well as the potential impacts on our results of operations and business, please see the “Supervision and Regulation” and “Risk Factors” sections of the 2024 Form 10-K.\nPayments Regulation\nLegislators and regulators in various countries in which we operate have focused on the operation of card networks, including through enforcement actions, legislation and regulations to change certain practices or pricing of card issuers, merchant acquirers and payment networks, and, in some cases, to establish broad regulatory regimes for payment systems.\nPricing for card acceptance, including interchange fees (that is, the fee paid by the bankcard merchant acquirer to the card issuer in payment networks like Visa and Mastercard), has been a focus of legislators and regulators in Australia, Canada, the European Union (EU), the United States and other jurisdictions. Recently, certain states in the United States have passed or are considering laws prohibiting interchange from being charged on all or certain components of transactions, such as sales tax and gratuities. Jurisdictions have also sought to regulate various other aspects of network operations and contract terms and practices governing merchant card acceptance, including information associated with electronic transactions, such as state legislation regarding the use of specific merchant categories codes or limiting the use of transaction data.\n28\nTable of Contents\nRegulation and other governmental actions relating to operations, pricing or practices could affect all networks and/or acquirers directly or indirectly, as well as adversely impact consumers and merchants. Among other things, regulation of bankcard fees has negatively impacted, and may continue to negatively impact, the discount revenue we earn, including as a result of downward pressure on our merchant discount rates from decreases in competitor pricing in connection with caps on interchange fees. In some cases, regulations also extend to certain aspects of our business, such as network and cobrand arrangements or the terms of card acceptance for merchants. For example, we exited our network business in the EU and Australia as a result of regulation in those jurisdictions. In addition, there is uncertainty as to when or how interchange fee caps and other provisions of the EU payments legislation might apply when we work with cobrand partners and agents in the EU. In 2018, the EU Court of Justice (CJEU) confirmed the validity of fee capping and other provisions in circumstances where three-party networks issue cards with a cobrand partner or through an agent, although its ruling provided only limited guidance as to when or how the provisions might apply in such circumstances and remains subject to differing interpretations by regulators and participants in cobrand arrangements. In December 2024, the CJEU held a hearing on questions referred by the Dutch Trade and Industry Appeals Tribunal regarding the interpretation of the application of the interchange fee caps in connection with an administrative proceeding by the Netherlands Authority for Consumers and Markets regarding our cobrand relationship with KLM Royal Dutch Airlines. As a precursor to the CJEU’s final ruling, an advisory opinion was issued by the Advocate General on March 6, 2025, advising the CJEU that our payments to the cobrand partner can be subject to the interchange fee caps but certain payments and services provided by the cobrand partner could potentially be netted against such payments for purposes of determining the capped amount. The advisory opinion is not binding on the CJEU and there can be no assurance as to the outcome of the proceeding. Given differing interpretations by regulators and participants in cobrand arrangements, we are subject to regulatory action, penalties and the possibility we will not be able to maintain our existing cobrand and agent relationships in the EU.\nFor more information on payments regulation, as well as the potential impacts on our results of operations and business, please see the “Supervision and Regulation” and “Risk Factors” sections of the 2024 Form 10-K.\nSurcharging\nIn various countries, such as certain Member States in the EU, Australia and Canada (other than in the Province of Quebec), merchants are permitted by law to surcharge card purchases. In addition, the laws of a number of states in the United States that prohibit surcharging have been overturned and certain states have passed or are considering laws to permit surcharging by merchants. In jurisdictions allowing surcharging, we have seen an increase in merchant surcharging on American Express cards, particularly in certain merchant categories. Surcharging is an adverse customer experience and could have a material adverse effect on us, particularly where it only or disproportionately impacts credit card usage or card usage generally, our Card Members or our business. In addition, we also encounter steering or differential acceptance practices by merchants, which could also have a material adverse effect on us.\nFor more information on the potential impacts of surcharging and other actions that could impair the Card Member experience, please see the “Risk Factors” section of the 2024 Form 10-K.\nAntitrust Litigation\nWe continue to vigorously defend antitrust and other claims initiated by merchants and others. See Note 7 to the “Consolidated Financial Statements” for descriptions of the cases. It is possible that actions impairing the Card Member experience, or the resolution of one or any combination of these cases, could have a material adverse effect on our business. For more information on the potential impacts of an adverse decision in these cases on our business, please see the “Risk Factors” section of the 2024 Form 10-K.\nPrivacy, Data Protection, Data Management, Artificial Intelligence, Resiliency, Information Security and Cybersecurity\nRegulatory and legislative activity in the areas of privacy, data protection, data management, artificial intelligence, resiliency, information security and cybersecurity continues to increase worldwide. We have established, and continue to maintain, policies and a governance framework to comply with applicable laws and requirements, meet evolving customer and industry expectations and support and enable business innovation and growth; however, our policies and governance framework may be insufficient given the size and complexity of our business and heightened regulatory scrutin\ny. \nRegulators and legislators have heightened their focus on the use of artificial intelligence and machine learning through the application of existing laws and regulations as well as by adopting new laws and regulations, which are reshaping how we develop, deploy and manage artificial intelligence systems, including by imposing new obligations related to data use, recordkeeping, transparency and human oversight. \n29\nTable of Contents\nGl\nobal financial institutions like us, as well as our customers, colleagues, regulators, service providers and other third parties, have experienced a significant increase in information security and cybersecurity risk in recent years and will likely continue to be the target of increasingly sophisticated cyberattacks, including computer viruses, malicious or destructive code, ransomware, social engineering attacks (including phishing, impersonation and identity takeover attempts), artificial intelligence-assisted deepfake attacks and disinformation campaigns, corporate espionage, hacking, website defacement, denial-of-service attacks, exploitation of vulnerabilities and other attacks and similar disruptions from the misconfiguration or unauthorized use of or access to computer systems and company accounts. For more information on privacy, data protection and information security and cybersecurity regulation and the potential impacts of a major information security or cybersecurity incident on our results of operations and business, please see the “Supervision and Regulation” and “Risk Factors” sections of the 2024 Form 10-K.\nAnti-Money Laundering, Countering the Financing of Terrorism and Economic Sanctions Compliance\nWe are subject to significant supervision and regulation, and an increasingly stringent enforcement environment, with respect to compliance with anti-money laundering (AML) and countering the financing of terrorism (CFT) laws and regulations.\nAmong other things, these laws and regulations generally require us to establish AML/CFT programs that meet certain standards, including, policies and procedures to collect information from and verify the identities of our customers, and to monitor for and report suspicious transactions, in addition to other information gathering and recordkeeping requirements. Our AML/CFT programs have become the subject of heightened scrutiny and any errors, failures or delays in complying with AML/CFT laws, deficiencies in our AML/CFT programs or association of our business with money laundering, terrorist financing, tax fraud or other illicit activity could give rise to significant supervisory, criminal and civil proceedings and lawsuits, which could result in significant penalties and forfeiture of assets, loss of licenses or restrictions on business activities or other enforcement actions.\nNational governments and international bodies, such as the United Nations and the EU, have imposed economic sanctions against individuals, entities, vessels, governments, regions and countries that endanger their interests or violate international norms of behavior. Sanctions have been used to advance a range of foreign policy goals, including conflict resolution, counterterrorism, counternarcotics and promotion of democracy and human rights, among other national and international interests. We maintain a global sanctions compliance program designed to meet the requirements of applicable sanctions regimes. Failure to comply with such requirements could subject us to serious legal and reputational consequences, including criminal penalties.\nFor more information on AML/CFT laws and regulations and economic sanctions, as well as the potential impacts on our results of operations and business, please see the “Supervision and Regulation” and “Risk Factors” sections of the 2024 Form 10-K.\nRecently Issued Accounting Standards\nRefer to the Recently Issued Accounting Standards section of Note 1 to the “Consolidated Financial Statements.”\n30\nTable of Contents\nGlossary of Selected Terminology\nAllocated service costs \n— Represents salaries and benefits associated with our technology and customer servicing groups, allocated based on activities directly attributable to our reportable operating segments, as well as overhead expenses, which are allocated to our reportable operating segments based on their relative levels of revenue and Card Member loans and receivables.\nAsset securitizations\n — Asset securitization involves the transfer and sale of loans or receivables to a special-purpose entity created for the securitization activity, typically a trust. The trust, in turn, issues securities, commonly referred to as asset-backed securities that are secured by the transferred loans and receivables. The trust uses the proceeds from the sale of such securities to pay the purchase price for the transferred loans or receivables. The securitized loans and receivables of our Lending Trust and Charge Trust (collectively, the Trusts) are reported as assets and the securities issued by the Trusts are reported as liabilities on our Consolidated Balance Sheets.\nBilled business\n (Card Member spending) — Represents transaction volumes (including cash advances) on payment products issued by American Express.\nCapital ratios\n — Represents the minimum standards established by regulatory agencies as a measure to determine whether the regulated entity has sufficient capital to absorb on- and off-balance sheet losses beyond current loss accrual estimates. Refer to the Capital Strategy section under “Consolidated Capital Resources and Liquidity” for further related definitions under Basel III.\nCard Member\n — The individual holder of an issued American Express-branded card.\nCard Member loans\n — Represents balances on our credit card products and revolve-eligible balances on our charge card products.\nCard Member receivables\n — Represents balances on our charge card products that need to be paid in full on or before the Card Member’s payment due date.\nCards-in-force\n — Represents the number of cards that are issued and outstanding by American Express (proprietary cards-in-force) and cards issued and outstanding under network partnership agreements with banks and other institutions, except for retail cobrand cards issued by network partners that had no out-of-store spending activity during the prior twelve months. \nBasic cards-in-force\n excludes supplemental cards issued on consumer accounts. Cards-in-force is useful in understanding the size of our Card Member base.\nCharge cards\n — Represents cards that generally carry no pre-set spending limits and are primarily designed as a method of payment and not as a means of financing purchases. Each transaction on a charge card with no pre-set spending limit is authorized based on its likely economics reflecting a Card Member’s most recent credit information and spend patterns. Charge Card Members must pay the full amount of balances billed each month, with the exception of balances that can be revolved under lending features offered on certain charge cards, such as Pay Over Time and Plan It\n®\n, that allow Card Members to pay for eligible purchases with interest over time.\nCobrand cards\n — Represents cards issued under cobrand agreements with selected commercial partners. Pursuant to the cobrand agreements, we make payments to our cobrand partners, which can be significant, based primarily on the amount of Card Member spending and corresponding rewards earned on such spending and, under certain arrangements, on the number of accounts acquired and retained. The partner is then liable for providing rewards to the Card Member under the cobrand partner’s own loyalty program.\nCredit cards\n — Represents cards that have a range of revolving payment terms, structured payment features (e.g., Plan It, Expanded Buying Power), grace periods, and rate and fee structures.\nDiscount revenue\n — Primarily represents the amount we earn and retain from the merchant payable for facilitating transactions between Card Members and merchants on payment products issued by American Express.\nGoods & Services (G&S) spend\n —\n \nIncludes spend in merchant categories other than T&E-related merchant categories, which includes B2B spending by small and mid-sized enterprise customers in our CS and ICS segments.\nInterest expense\n — Includes interest incurred primarily to fund Card Member loans and receivables, general corporate purposes and liquidity needs. Interest expense is divided principally into two categories: (i) deposits, which primarily relates to interest expense on deposits taken from customers and institutions, and (ii) debt, which primarily relates to interest expense on our long-term financing and short-term borrowings, (e.g., commercial paper, federal funds purchased, bank overdrafts and other short-term borrowings), as well as the realized impact of derivatives hedging interest rate risk on our long-term debt.\nInterest income\n — Includes (i) interest on loans, (ii) interest and dividends on investment securities and (iii) interest income on deposits with banks and other.\n31\nTable of Contents\nInterest on loans\n — Assessed using the average daily balance method for Card Member loans. Unless the loan is classified as non-accrual, interest is recognized based upon the principal amount outstanding in accordance with the terms of the applicable account agreement until the outstanding balance is paid or written off.\nInterest and dividends on investment securities\n — Primarily relates to our performing fixed-income securities. Interest income is recognized using the effective interest method, which adjusts the yield for security premiums and discounts, fees and other payments, so a constant rate of return is recognized on the outstanding balance of the related investment security throughout its term. Amounts are recognized until securities are in default or when it is likely that future interest payments will not be made as scheduled.\nInterest income on deposits with banks and other\n — Primarily relates to the placement of cash in excess of near-term funding requirements in interest-bearing time deposits, overnight sweep accounts, and other interest-bearing demand and call accounts.\nLoyalty coalitions \n— Programs that enable consumers to earn rewards points and use them to save on purchases from a variety of participating merchants through multi-category rewards platforms. Merchants in these programs generally fund the consumer offers and are responsible to us for the cost of rewards points; we earn revenue from operating the loyalty platform and by providing marketing support.\nNet card fees\n — Represents the card membership fees earned during the period recognized as revenue over the covered card membership period (typically one year), net of the provision for projected refunds for Card Membership cancellation and deferred acquisition costs.\nNet interest yield —\n Represents net interest income, computed on an annualized basis, divided by average Card Member loans, Card Member loans HFS, Other loans and Card Member receivables. Reserves and net write-offs related to uncollectible interest are recorded through provision for credit losses and are thus not included in the net interest yield calculation.\nNet write-off rate\n — \nprincipal only\n — Represents the amount of proprietary consumer or small business Card Member loans or receivables written off, consisting of principal (resulting from authorized transactions), less recoveries, as a percentage of the average loan or receivable balance during the period.\nNet write-off rate\n — \nprincipal, interest and fees\n — Includes, in the calculation of the net write-off rate, amounts for interest and fees in addition to principal for Card Member loans, and fees in addition to principal for Card Member receivables.\nNetwork volumes\n — Represents total transaction volumes (including cash advances) on payment products issued by American Express and under network partnership agreements with banks and other institutions, including joint ventures, as well as alternative payment solutions facilitated by American Express.\nOperating expenses\n — Represents salaries and employee benefits, professional services, data processing and equipment, and other expenses.\nOther loan\ns — Represents balances on non-card payment and financing products that are not associated with a Card Member agreement, and instead are governed by a separate borrowing relationship. Other loans consist primarily of consumer installment loans and lines of credit offered to small business customers.\nProprietary new cards acquired\n \n— Represents the number of new cards issued by American Express during the referenced period, net of replacement cards. Proprietary new cards acquired is useful as a measure of the effectiveness of our customer acquisition strategy.\nReserve build (release) \n— Represents the portion of the provisions for credit losses for the period related to increasing or decreasing reserves for credit losses as a result of, among other things, changes in volumes, macroeconomic outlook, portfolio composition and credit quality of portfolios. Reserve build represents the amount by which the provision for credit losses exceeds net write-offs, while reserve release represents the amount by which net write-offs exceed the provision for credit losses.\nT&E spend\n — Represents spend on travel and entertainment, which primarily includes airline, cruise, lodging and dining merchant categories.\n32\nTable of Contents\nCAUTIONARY NOTE REGARDING FORWARD-LOOKING STATEMENTS\nThis report includes forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995, which are subject to risks and uncertainties. The forward-looking statements, which address our current expectations regarding business and financial performance, among other matters, contain words such as “believe,” “expect,” “anticipate,” “intend,” “plan,” “aim,” “will,” “may,” “should,” “could,” “would,” “likely,” “estimate,” “potential,” “continue” and similar expressions. Readers are cautioned not to place undue reliance on these forward-looking statements, which speak only as of the date on which they are made. We undertake no obligation to update or revise any forward-looking statements. Factors that could cause actual results to differ materially from these forward-looking statements, include, but are not limited to, the following:\n•\nour ability to grow earnings per share in the future, which will depend in part on revenue growth, credit performance, credit reserve and expense levels and the effective tax rate remaining consistent with current expectations and our ability to continue investing at high levels in areas that can drive sustainable growth (including our brand, value propositions, coverage, marketing, technology and talent), controlling operating expenses, effectively managing risk and executing our share repurchase program, any of which could be impacted by, among other things, the factors identified in the subsequent paragraphs as well as the following: macroeconomic and geopolitical conditions, including a slowdown in U.S. or global economic growth, changes to consumer and business confidence, higher rates of unemployment, global trade relations and the effects of announced or future tariffs, international tensions, hostilities and instability, changes in interest rates, inflation, supply chain issues, market volatility, energy costs, the duration of the U.S. government shutdown and fiscal and monetary policies; the impact of any future contingencies, including, but not limited to, legal costs and settlements, the imposition of fines or monetary penalties, increases in Card Member remediation, investment gains or losses, restructurings, impairments and changes in reserves; issues impacting brand perceptions and our reputation; changes in the competitive environment; impacts related to acquisitions, cobrand and other partner agreements, portfolio sales, joint ventures and other investments; and the impact of regulation and litigation, which could affect the profitability of our business activities, limit our ability to pursue business opportunities, require changes to business practices or alter our relationships with Card Members, partners and merchants;\n•\nour ability to grow revenues net of interest expense and the sustainability of our future growth, which could be impacted by, among other things, the factors identified above and in the subsequent paragraphs, as well as the following: spending volumes and the spending environment not being consistent with expectations, including spending by U.S. consumer and small & mid-sized business Card Members, such as due to uncertain business and economic conditions; an inability to address competitive pressures, attract and retain customers, invest in and enhance our Membership Model of premium products, differentiated services and partnerships, successfully refresh our card products (including U.S. Consumer and Business Platinum Cards), grow spending and lending with customers across age cohorts (including Millennial and Gen-Z customers) and commercial segments and implement strategies and business initiatives, including within the premium consumer space, commercial payments and the global network; the effects of regulatory initiatives, including pricing and network regulation; merchant coverage growing less than expected or the reduction of merchant acceptance or the perception of coverage; increased surcharging, steering, suppression or other differential acceptance practices with respect to our products; merchant discount rates changing from our expectations; and changes in foreign currency exchange rates;\n•\nnet card fee revenues not performing consistently with expectations, which could be impacted by, among other things, the pace of Card Member acquisition activity and demand for our fee-based products; higher Card Member attrition rates; the success and timing of our refreshes of our card products (including U.S. Consumer and Business Platinum Cards); a decrease in the ability and desire of Card Members to pay card fees, such as due to a deterioration in macroeconomic conditions or as a result of changes in card fees; the competitive environment and the perception of the value provided by premium cards; and our inability to deliver and enhance benefits and services, innovate with respect to our products and develop attractive premium value propositions for new and existing customers;\n•\nnet interest income, the effects of changes in interest rates and the growth of loans and Card Member receivables outstanding and revolving balances, being higher or lower than expectations, which could be impacted by, among other things, the behavior and financial strength of Card Members and their actual spending, borrowing and paydown patterns; the effectiveness of our strategies to enhance Card Member value propositions, grow lending with premium customers and capture a greater share of Card Members’ spending and borrowings and attract new, and retain existing, customers; our ability to effectively introduce and enhance lending features on our products and manage underwriting risk; changes in benchmark interest rates, including where such changes affect our assets or liabilities differently than expected; continued volatility and other changes in capital and credit market conditions and the availability and cost of capital; credit actions, including line size and other adjustments to credit availability; the yield on Card Member loans not remaining consistent with current expectations; and our deposit levels or the interest rates we offer on deposits changing from current expectations; loss or impacts to cobrand relationships; and governmental actions to cap credit card interest rates;\n33\nTable of Contents\n•\nfuture credit performance, the level of future delinquency, reserve and write-off rates and the amount and timing of future reserve builds and releases, which will depend in part on macroeconomic factors such as actual and projected unemployment rates, GDP and the volume of bankruptcies; the ability and willingness of Card Members to pay amounts owed to us; changes in loans and receivables outstanding, such as from the implementation of our strategy to capture spending and borrowings, or from changes in consumer behavior that affect loan and receivable balances (e.g., paydown and revolve rates); changes in the levels of customer acquisitions and the credit profiles of new customers acquired; card portfolio sales; the enrollment in, and effectiveness of, financial relief programs and the performance of accounts as they exit from such programs; the effects of the resumption of student loan repayments; collections capabilities and recoveries of previously written-off loans and receivables; and the impact of the usage of debt settlement companies;\n•\nthe actual amount to be spent on Card Member rewards and services and business development, and the relationship of these variable customer engagement costs to revenues, which could be impacted by continued changes in macroeconomic conditions and Card Member behavior as it relates to their spending patterns (including the level of spend in bonus categories), the redemption of rewards and offers (including travel redemptions) and usage of travel-, lifestyle- and business-related benefits; the costs related to reward point redemptions; investments and enhancements that we make with respect to our rewards programs and product benefits, such as in connection with card refreshes (including U.S. Consumer and Business Platinum Cards), including to make them attractive to Card Members and prospective customers, potentially in a manner that is not cost-effective; levels of Card Member acquisitions on premium card products; changes in our models or assumptions used to estimate these expenses; new and renegotiated contractual obligations with business partners, which may be affected by business partners with greater scale and leverage; our ability to identify and negotiate partner-funded value for Card Members; and the pace and cost of the expansion of our global lounge collection;\n•\nthe actual amount we spend on marketing in the future and the effectiveness and efficiency of our marketing spend, which will be based in part on continued changes in the macroeconomic and competitive environment and business performance, including the levels of demand for our products; our ability to realize marketing efficiencies, such as through the personalization of offers, and balance expense control and investments in the business; management’s decisions regarding the timing of spending on marketing and the effectiveness of management’s investment optimization process; management’s identification and assessment of attractive investment opportunities; management’s ability to develop premium value propositions and drive customer demand, including continued customer spend growth and retention; and the receptivity of Card Members and prospective customers to advertising and customer acquisition initiatives;\n•\nour ability to control operating expenses, including relative to revenue growth, and the actual amount we spend on operating expenses in the future, which could be impacted by, among other things, salary and benefit expenses to attract and retain talent; our ability to realize operational efficiencies, including through increased scale and automation and continued adoption of artificial intelligence technologies; management’s ability to balance expense control and investments in the business and its decisions regarding spending in such areas as technology, business and product development, sales force, premium servicing and digital capabilities; our ability to innovate efficient channels of customer interactions and the willingness of Card Members to self-service and address issues through digital channels; restructuring activity; fraud costs; inflation; supply chain issues and increased technology costs; expenses related to enterprise risk management and compliance and consulting, legal and other professional services fees, including as a result of our growth, litigation and internal and regulatory reviews; the impact of changes in foreign currency exchange rates on costs; regulatory assessments; the level of M&A activity and related expenses; information security or cybersecurity incidents; the payment of fines, penalties, disgorgement, restitution, non-income tax assessments and litigation-related settlements; the performance of Amex Ventures and other of our investments; and impairments of goodwill or other assets;\n•\nour tax rate not remaining consistent with expectations, which could be impacted by, among other things, further changes in tax laws and regulation, the implementation by jurisdictions of the Organization for Economic Cooperation and Development’s global minimum tax guidelines and exemptions to the global minimum tax, our geographic mix of income, unfavorable tax audits, assessments and tax litigation outcomes, and the occurrence or nonoccurrence of other discrete tax items;\n•\nchanges affecting our plans regarding the return of capital to shareholders, which will depend on factors such as our capital levels and regulatory capital ratios; the results of our stress testing and capital planning process and new rulemakings and guidance from the Federal Reserve and other banking regulators, including changes to regulatory capital requirements, such as from the U.S. federal bank regulatory agencies’ Basel III rulemaking; our results of operations and financial condition; our credit ratings and rating agency considerations; and the economic environment and market conditions in any given period;\n34\nTable of Contents\n•\nchanges in the substantial and increasing worldwide competition in the payments industry, including competitive pressure and competitor settlements and transactions that may materially impact the prices charged to merchants that accept American Express cards; merchant acceptance and surcharging, steering and suppression by merchants; the desirability of competitor premium card products and competition for partnerships and premium experiences, services and benefits; competition for new and existing cobrand relationships; competition from new and non-traditional competitors, such as financial technology companies, and with respect to new products, services and technologies, such as the emergence or increase in popularity of agentic commerce, digital payment platforms and currencies and other alternative payment mechanisms; and the success of marketing, promotion, rewards programs, offers and travel-, lifestyle- and business-related benefits (e.g., lounges, dining, entertainment and business tools);\n•\nour ability to sustain our momentum and leadership in the premium consumer space, including with Millennial and Gen-Z consumers, and the success of the refresh of our U.S. Consumer Platinum Card\n®\n, which will be impacted in part by competition, levels of consumer demand for premium card products, brand perceptions (including perceptions related to merchant coverage) and reputation, and our ability to develop and market new benefits, services, experiences and other value propositions, as well as new digital capabilities, that appeal to Card Members and new customers, grow spending with new and younger age cohort Card Members, offer attractive services and rewards programs and build greater customer loyalty, which will depend in part on identifying and funding investment opportunities, addressing changing customer behaviors, new product innovation and development, Card Member acquisition efforts and enrollment processes, including through digital channels, continuing to realize the benefits from strategic partnerships, successfully implementing our dining strategy and evolving our infrastructure to support new products, services and benefits;\n•\nour ability to build on our leadership in commercial payments and the success of the refresh of our U.S. Business Platinum Card\n®\n, which will depend in part on competition, including from financial technology companies; the willingness and ability of companies to use credit and charge cards for procurement and other business expenditures as well as use our other products and services for financing needs; the acceptance of, and economics related to, B2B payment platforms; our ability to offer attractive value propositions and new products to current and potential customers; our ability to enhance and expand our payment, lending, cash flow and expense management solutions, increase customer engagement, and build out a multi-product digital ecosystem to integrate our broad product set, which is dependent on our continued investment in capabilities, features, functionalities, platforms and technologies and the successful integration of, and introduction of capabilities related to, our Center acquisition; and the success of our initiatives to support businesses, such as Small Business Saturday and other Shop Small campaigns;\n•\nour ability to expand merchant coverage globally and our success, as well as the success of third-party merchant acquirers, aggregators and processors, in signing merchants to accept American Express, which will depend on, among other factors, the value propositions offered to merchants and merchant acquirers for card acceptance, the awareness and willingness of Card Members to use American Express cards at merchants, scaling marketing and expanding programs to increase card usage, identifying and growing acceptance in low- and new-to-plastic industries and businesses as they form, working with commercial buyers and suppliers to establish B2B acceptance, executing on our plans to increase coverage in priority international cities, destinations, countries and industry verticals, merchant point-of-sale practices, and continued network investments, including in capabilities that allow for greater digital integration and modernization of our authorization platform;\n•\nour ability to successfully invest in, benefit from and expand the use of technological developments, digital payments, servicing and travel solutions and other technological capabilities, which will depend in part on our success in evolving our products and processes for the digital environment, developing new features in our applications and platforms and enhancing our digital channels, effectively utilizing data and data platforms, building partnerships and executing programs with other companies, effectively utilizing artificial intelligence and machine learning and increasing automation, including to enhance our products and address servicing and other business and customer needs, and supporting the use of our products as a means of payment through online, mobile and other digital channels, all of which will be impacted by investment levels, customer and colleague receptiveness and ability to adopt new technologies, new product innovation and development and the platforms and infrastructure to support new products, services, benefits and partner integrations;\n•\nour ability to grow internationally, which could be impacted by regulation and business practices, such as those capping interchange or other fees, mandating network access or data localization, favoring local competitors or prohibiting or limiting foreign ownership of certain businesses; perceptions of our brand in international jurisdictions; our inability to successfully replicate aspects of our business model internationally and tailor products and services to make them attractive to local customers; competitors with more scale, local experience and established relationships with relevant customers, regulators and industry participants; the success of us and our network partners in acquiring Card Members and/or merchants; and geopolitical and economic instability, hostilities and tensions (such as involving China and the U.S.), and impacts to cross-border trade and travel;\n35\nTable of Contents\n•\nour ability to successfully implement our dining strategy and grow our dining platform, which will depend in part on our ability to grow the number of diners, restaurants and other bookable venues using the platform and transactions on the platform; expand and innovate in the tools and capabilities offered through the platform, including integrating the Tock and Rooam acquisitions and benefiting from their added capabilities, users and/or bookable venues; successfully implement partnerships and compete with other dining platforms and means of booking venues; and effectively utilize our dining platform to provide value to Card Members and merchants and sell our products and services;\n•\na failure in or breach of our operational or security systems, processes or infrastructure, or those of third parties, including as a result of cyberattacks or outages, which could compromise the confidentiality, integrity, privacy and/or security of data, disrupt our operations, reduce the use and acceptance of American Express cards or our digital platforms and lead to regulatory scrutiny, litigation, remediation and response costs and reputational harm;\n•\nchanges in capital and credit market conditions, including those resulting from recent volatility, which may significantly affect our ability to meet our liquidity needs and expectations regarding capital ratios; our access to capital and funding costs; the valuation of our assets; and our credit ratings or those of our subsidiaries;\n•\nour funding plan being implemented in a manner inconsistent with current expectations, which will depend on various factors such as future business growth, liquidity needs, the impact of global economic, political and other events on market capacity, demand for securities we offer, regulatory changes, our ability to securitize and sell loans and receivables and the performance of loans and receivables previously sold in securitization transactions;\n•\nlegal and regulatory developments, which could affect the profitability of our business activities; limit our ability to pursue business opportunities or conduct business in certain jurisdictions; require changes to business practices or governance, or alter our relationships with Card Members, partners, merchants and other third parties, including affecting our network operations and practices governing merchant acceptance, as well as our ability to continue certain cobrand relationships in the EU; impact card fees and rewards programs; exert further pressure on merchant discount rates and our network business, as well as result in an increase in surcharging, steering or other differential acceptance practices; alter the competitive landscape; subject us to heightened regulatory scrutiny and result in increased costs related to regulatory oversight and compliance, litigation-related settlements, judgments or expenses, restitution to Card Members or the imposition of fines or monetary penalties; materially affect capital or liquidity requirements, results of operations or ability to pay dividends; or result in harm to the American Express brand;\n•\nchanges in the financial condition and creditworthiness of our business partners, such as bankruptcies, restructurings or consolidations, including of cobrand partners, merchants that represent a significant portion of our business, network partners or financial institutions that we rely on for routine funding and liquidity, which could materially affect our financial condition or results of operations; and\n•\nfactors beyond our control such as business, economic and geopolitical conditions, consumer and business confidence and spending generally, unemployment rates, market volatility, government shutdowns and other political developments, further escalations or widening of international tensions, regional hostilities and military conflicts (such as in the Middle East and Ukraine), adverse developments affecting third parties, including other financial institutions, merchants or vendors, as well as severe weather conditions and natural disasters (e.g., hurricanes and wildfires), power loss, disruptions in telecommunications, pandemics, terrorism and other catastrophic events, any of which could significantly affect demand for and spending on American Express cards, credit metrics and reserves, loan and receivable balances, deposit levels and other aspects of our business and results of operations or disrupt our global network systems and ability to process transactions.\nA further description of these uncertainties and other risks can be found in the 2024 Form 10-K, the Quarterly Reports on Form 10-Q for the quarters ended March 31 and June 30, 2025 and other reports filed with the Securities and Exchange Commission.\n36\nTable of Contents\nITEM 1. FINANCIAL STATEMENTS\nAMERICAN EXPRESS COMPANY\nCONSOLIDATED STATEMENTS OF INCOME\n(Unaudited)\nThree Months Ended September 30 (Millions, except per share amounts)\n2025\n2024\nRevenues\nNon-interest revenues\nDiscount revenue\n$\n9,413\n \n$\n8,780\n \nNet card fees\n2,551\n \n2,170\n \nService fees and other revenue\n1,976\n \n1,680\n \nTotal non-interest revenues\n13,940\n \n12,630\n \nInterest income\nInterest on loans\n5,970\n \n5,442\n \nInterest and dividends on investment securities\n15\n \n18\n \nDeposits with banks and other\n632\n \n689\n \nTotal interest income\n6,617\n \n6,149\n \nInterest expense\nDeposits\n1,371\n \n1,446\n \nLong-term debt and other\n760\n \n697\n \nTotal interest expense\n2,131\n \n2,143\n \nNet interest income\n4,486\n \n4,006\n \nTotal revenues net of interest expense\n18,426\n \n16,636\n \nProvisions for credit losses\nCard Member receivables\n190\n \n170\n \nCard Member loans\n1,030\n \n1,114\n \nOther\n67\n \n72\n \nTotal provisions for credit losses\n1,287\n \n1,356\n \nTotal revenues net of interest expense after provisions for credit losses\n17,139\n \n15,280\n \nExpenses\nCard Member rewards\n4,608\n \n4,168\n \nBusiness development\n1,611\n \n1,430\n \nCard Member services\n1,477\n \n1,179\n \nMarketing\n1,599\n \n1,470\n \nSalaries and employee benefits\n2,239\n \n2,049\n \nOther, net\n1,780\n \n1,780\n \nTotal expenses\n13,314\n \n12,076\n \nPretax income\n3,825\n \n3,204\n \nIncome tax provision\n923\n \n697\n \nNet income\n$\n2,902\n \n$\n2,507\n \nEarnings per Common Share (Note 14)\n(a)\nBasic\n$\n4.14\n \n$\n3.50\n \nDiluted\n$\n4.14\n \n$\n3.49\n \nAverage common shares outstanding for earnings per common share:\nBasic\n692\n \n708\n \nDiluted\n693\n \n709\n \n(a)\nRepresents net income less (i) earnings allocated to participating share awards of $\n20\n million and $\n18\n million for the three months ended September 30, 2025 and 2024, respectively, and (ii) dividends on preferred shares of $\n14\n million and $\n15\n million for the three months ended September 30, 2025 and 2024, respectively.\nSee Notes to Consolidated Financial Statements.\n37\nTable of Contents\nAMERICAN EXPRESS COMPANY\nCONSOLIDATED STATEMENTS OF INCOME\n(Unaudited)\nNine Months Ended September 30 (Millions, except per share amounts)\n2025\n2024\nRevenues\nNon-interest revenues\nDiscount revenue\n$\n27,517\n \n$\n26,015\n \nNet card fees\n7,364\n \n6,204\n \nService fees and other revenue\n5,526\n \n5,046\n \nTotal non-interest revenues\n40,407\n \n37,265\n \nInterest income\nInterest on loans\n17,170\n \n15,592\n \nInterest and dividends on investment securities\n46\n \n68\n \nDeposits with banks and other\n1,800\n \n2,058\n \nTotal interest income\n19,016\n \n17,718\n \nInterest expense\nDeposits\n4,082\n \n4,298\n \nLong-term debt and other\n2,092\n \n1,915\n \nTotal interest expense\n6,174\n \n6,213\n \nNet interest income\n12,842\n \n11,505\n \nTotal revenues net of interest expense\n53,249\n \n48,770\n \nProvisions for credit losses\nCard Member receivables\n562\n \n592\n \nCard Member loans\n3,025\n \n3,098\n \nOther\n255\n \n203\n \nTotal provisions for credit losses\n3,842\n \n3,893\n \nTotal revenues net of interest expense after provisions for credit losses\n49,407\n \n44,877\n \nExpenses\nCard Member rewards\n13,604\n \n12,169\n \nBusiness development\n4,729\n \n4,249\n \nCard Member services\n4,106\n \n3,504\n \nMarketing\n4,640\n \n4,426\n \nSalaries and employee benefits\n6,511\n \n6,096\n \nOther, net\n5,112\n \n4,294\n \nTotal expenses\n38,702\n \n34,738\n \nPretax income\n10,705\n \n10,139\n \nIncome tax provision\n2,334\n \n2,180\n \nNet income\n$\n8,371\n \n$\n7,959\n \nEarnings per Common Share (Note 14)\n(a)\nBasic\n$\n11.87\n \n$\n10.99\n \nDiluted\n$\n11.85\n \n$\n10.97\n \nAverage common shares outstanding for earnings per common share:\nBasic\n697\n \n715\n \nDiluted\n698\n \n716\n \n(a)\nRepresents net income less (i) earnings allocated to participating share awards of $\n56\n million and $\n59\n million for the nine months ended September 30, 2025 and 2024, respectively, and (ii) dividends on preferred shares of $\n43\n million and $\n44\n million for the nine months ended September 30, 2025 and 2024, respectively.\nSee Notes to Consolidated Financial Statements.\n38\nTable of Contents\nAMERICAN EXPRESS COMPANY\nCONSOLIDATED STATEMENTS OF COMPREHENSIVE INCOME\n(Unaudited)\nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n(Millions)\n2025\n2024\n2025\n2024\nNet income\n$\n2,902\n \n$\n2,507\n \n$\n8,371\n \n$\n7,959\n \nOther comprehensive income (loss):\nNet unrealized debt securities gains (losses), net of tax\n1\n \n4\n \n4\n \n8\n \nForeign currency translation adjustments, net of hedges and tax\n(\n6\n)\n1\n \n126\n \n(\n135\n)\nNet unrealized pension and other postretirement benefits, net of tax\n4\n \n—\n \n16\n \n4\n \nOther comprehensive income (loss)\n(\n1\n)\n5\n \n146\n \n(\n123\n)\nComprehensive income\n$\n2,901\n \n$\n2,512\n \n$\n8,517\n \n$\n7,836\n \nSee Notes to Consolidated Financial Statements.\n39\nTable of Contents\nAMERICAN EXPRESS COMPANY\nCONSOLIDATED BALANCE SHEETS\n(Unaudited)\n(Millions, except share data)\nSeptember 30,\n2025\nDecember 31,\n2024\nAssets\nCash and cash equivalents\nCash and due from banks (includes restricted cash of consolidated variable interest entities: 2025, $\n5\n; 2024, $\n6\n)\n$\n3,234\n \n$\n3,413\n \nInterest-bearing deposits in other banks\n50,201\n \n37,006\n \nShort-term investment securities (includes restricted investments of consolidated variable interest entities: 2025, $\n1,233\n; 2024, $\n82\n)\n1,271\n \n221\n \nTotal cash and cash equivalents (includes restricted cash: 2025, $\n1,330\n; 2024, $\n427\n)\n54,706\n \n40,640\n \nCard Member receivables (includes gross receivables available to settle obligations of a consolidated variable interest entity: 2025, $\n6,710\n; 2024, $\n3,927\n), less reserves for credit losses: 2025, $\n200\n; 2024, $\n171\n60,823\n \n59,240\n \nCard Member loans (includes gross loans available to settle obligations of a consolidated variable interest entity: 2025, $\n26,354\n; 2024, $\n28,278\n), less reserves for credit losses: 2025, $\n5,868\n; 2024, $\n5,679\n138,946\n \n133,995\n \nCard Member loans held for sale\n2,424\n \n758\n \nOther loans, less reserves for credit losses: 2025, $\n287\n; 2024, $\n194\n10,231\n \n9,038\n \nInvestment securities\n1,374\n \n1,240\n \nPremises and equipment, less accumulated depreciation and amortization: 2025, $\n11,754\n; 2024, $\n10,739\n5,861\n \n5,371\n \nOther assets, less reserves for credit losses: 2025, $\n20\n; 2024, $\n27\n23,185\n \n21,179\n \nTotal assets\n$\n297,550\n \n$\n271,461\n \nLiabilities and Shareholders’ Equity\nLiabilities\nCustomer deposits\n$\n149,883\n \n$\n139,413\n \nAccounts payable\n14,708\n \n13,884\n \nShort-term borrowings\n1,446\n \n1,374\n \nLong-term debt (includes debt issued by consolidated variable interest entities: 2025, $\n14,019\n; 2024, $\n13,880\n)\n57,787\n \n49,715\n \nOther liabilities\n41,309\n \n36,811\n \nTotal liabilities\n$\n265,133\n \n$\n241,197\n \nContingencies (Note 7)\nShareholders’ Equity\nPreferred shares, $1.66\n2/3\n par value, authorized \n20\n million shares; issued and outstanding \n1,600\n shares as of September 30, 2025 and December 31, 2024\n—\n \n—\n \nCommon shares, $\n0.20\n par value, authorized \n3.6\n billion shares; issued and outstanding \n689\n million shares as of September 30, 2025 and \n702\n million shares as of December 31, 2024\n138\n \n141\n \nAdditional paid-in capital\n11,059\n \n11,370\n \nRetained earnings\n24,469\n \n22,148\n \nAccumulated other comprehensive income (loss)\n(\n3,249\n)\n(\n3,395\n)\nTotal shareholders’ equity\n32,417\n \n30,264\n \nTotal liabilities and shareholders’ equity\n$\n297,550\n \n$\n271,461\n \nSee Notes to Consolidated Financial Statements.\n40\nTable of Contents\nAMERICAN EXPRESS COMPANY\nCONSOLIDATED STATEMENTS OF CASH FLOWS\n(Unaudited)\nNine Months Ended September 30 \n(Millions)\n2025\n2024\nCash Flows from Operating Activities\nNet income\n$\n8,371\n \n$\n7,959\n \nAdjustments to reconcile net income to net cash provided by operating activities:\nProvisions for credit losses\n3,842\n \n3,893\n \nDepreciation and amortization\n1,315\n \n1,248\n \nStock-based compensation\n410\n \n393\n \nDeferred taxes\n(\n642\n)\n(\n917\n)\nOther items \n(a)\n74\n \n(\n333\n)\nChanges in operating assets and liabilities, net of effects of acquisitions and dispositions:\nOther assets\n(\n1,333\n)\n(\n222\n)\nAccounts payable & other liabilities\n3,324\n \n(\n3,749\n)\nNet cash provided by operating activities\n15,361\n \n8,272\n \nCash Flows from Investing Activities\nSale of investments\n42\n \n35\n \nMaturities and redemptions of investments\n876\n \n1,875\n \nPurchase of investments\n(\n1,314\n)\n(\n1,210\n)\nNet increase in loans and Card Member receivables, including Card Member loans held for sale \n(b)\n(\n10,212\n)\n(\n11,945\n)\nPurchase of premises and equipment, net of sales: 2025, $\n1\n; 2024, $\n4\n(\n1,703\n)\n(\n1,416\n)\nAcquisitions, net of cash acquired\n(\n633\n)\n(\n90\n)\nDispositions, net of cash disposed\n—\n \n594\n \nNet cash used in investing activities\n(\n12,944\n)\n(\n12,157\n)\nCash Flows from Financing Activities\nNet increase in customer deposits\n10,439\n \n6,305\n \nNet increase in short-term borrowings\n1\n \n169\n \nProceeds from long-term debt\n22,375\n \n12,519\n \nPayments of long-term debt\n(\n14,896\n)\n(\n7,358\n)\nIssuance of American Express common shares\n48\n \n49\n \nRepurchase of American Express common shares and other\n(\n4,915\n)\n(\n4,989\n)\nDividends paid\n(\n1,688\n)\n(\n1,489\n)\nNet cash provided by financing activities\n11,364\n \n5,206\n \nEffect of foreign currency exchange rates on cash and cash equivalents\n285\n \n1\n \nNet increase in cash and cash equivalents\n14,066\n \n1,322\n \nCash and cash equivalents at beginning of period\n40,640\n \n46,596\n \nCash and cash equivalents at end of period\n$\n54,706\n \n$\n47,918\n \n(a)\nPrimarily includes gains/losses on fair value hedges, losses on tax credit investments, movements in equity method investments and net gains and losses on Amex Ventures investments. For the period ended on September 30, 2024, also includes the gain recognized on the sale of Accertify (refer to Note 1 for additional information).\n(b)\nIncludes Card Member loans held for sale (HFS) which were previously held for investment within Card Member loans and were reclassified on the Consolidated Balance Sheets effective June 1, 2025 and December 1, 2024. Refer to Note 1 for additional information on Card Member loans HFS recognized effective June 1, 2025.\nSee Notes to Consolidated Financial Statements.\n41\nTable of Contents\nAMERICAN EXPRESS COMPANY\nCONSOLIDATED STATEMENTS OF SHAREHOLDERS’ EQUITY\n(Unaudited)\nThree months ended September 30, 2025\n(Millions, except per share amounts)\nTotal\nPreferred\nShares\nCommon\nShares\nAdditional\nPaid-in\nCapital\nAccumulated\nOther\nComprehensive\nIncome (Loss)\nRetained\nEarnings\nBalances as of June 30, 2025\n$\n32,311\n \n$\n—\n \n$\n140\n \n$\n11,052\n \n$\n(\n3,248\n)\n$\n24,367\n \nNet income\n2,902\n \n—\n \n—\n \n—\n \n—\n \n2,902\n \nOther comprehensive income (loss)\n(\n1\n)\n—\n \n—\n \n—\n \n(\n1\n)\n—\n \nRepurchase of common shares\n(\n2,338\n)\n—\n \n(\n2\n)\n(\n119\n)\n—\n \n(\n2,217\n)\nOther changes\n124\n \n—\n \n—\n \n126\n \n—\n \n(\n2\n)\nCash dividends declared preferred Series D, $\n9,072.22\n per share\n(\n14\n)\n—\n \n—\n \n—\n \n—\n \n(\n14\n)\nCash dividends declared common, $\n0.82\n per share\n(\n567\n)\n—\n \n—\n \n—\n \n—\n \n(\n567\n)\nBalances as of September 30, 2025\n$\n32,417\n \n$\n—\n \n$\n138\n \n$\n11,059\n \n$\n(\n3,249\n)\n$\n24,469\n \nNine months ended September 30, 2025\n(Millions, except per share amounts)\nTotal\nPreferred Shares\nCommon Shares\nAdditional Paid-in Capital\nAccumulated Other Comprehensive Income (Loss)\nRetained Earnings\nBalances as of December 31, 2024\n$\n30,264\n \n$\n—\n \n$\n141\n \n$\n11,370\n \n$\n(\n3,395\n)\n$\n22,148\n \nNet income\n8,371\n \n—\n \n—\n \n—\n \n—\n \n8,371\n \nOther comprehensive income (loss)\n146\n \n—\n \n—\n \n—\n \n146\n \n—\n \nRepurchase of common shares\n(\n4,412\n)\n—\n \n(\n3\n)\n(\n233\n)\n—\n \n(\n4,176\n)\nOther changes\n(\n190\n)\n—\n \n—\n \n(\n78\n)\n—\n \n(\n112\n)\nCash dividends declared preferred Series D, $\n27,019.44\n per share\n(\n43\n)\n—\n \n—\n \n—\n \n—\n \n(\n43\n)\nCash dividends declared common, $\n2.46\n per share\n(\n1,719\n)\n—\n \n—\n \n—\n \n—\n \n(\n1,719\n)\nBalances as of September 30, 2025\n$\n32,417\n \n$\n—\n \n$\n138\n \n$\n11,059\n \n$\n(\n3,249\n)\n$\n24,469\n \nSee Notes to Consolidated Financial Statements.\n42\nTable of Contents\nAMERICAN EXPRESS COMPANY\nCONSOLIDATED STATEMENTS OF SHAREHOLDERS’ EQUITY\n(Unaudited)\nThree months ended September 30, 2024\n(Millions, except per share amounts)\nTotal\nPreferred Shares\nCommon Shares\nAdditional Paid-in Capital\nAccumulated Other Comprehensive Income (Loss)\nRetained Earnings\nBalances as of June 30, 2024\n$\n29,540\n \n$\n—\n \n$\n143\n \n$\n11,332\n \n$\n(\n3,200\n)\n$\n21,265\n \nNet income\n2,507\n \n— \n— \n— \n— \n2,507\n \nOther comprehensive income (loss)\n5\n \n— \n— \n— \n5\n \n—\n \nRepurchase of common shares\n(\n1,919\n)\n— \n(\n2\n)\n(\n121\n)\n— \n(\n1,796\n)\nOther changes\n83\n \n— \n— \n84\n \n— \n(\n1\n)\nCash dividends declared preferred Series D, $\n9,072.22\n per share\n(\n15\n)\n— \n— \n— \n— \n(\n15\n)\nCash dividends declared common, $\n0.70\n per share\n(\n494\n)\n— \n— \n— \n— \n(\n494\n)\nBalances as of September 30, 2024\n$\n29,707\n \n$\n—\n \n$\n141\n \n$\n11,295\n \n$\n(\n3,195\n)\n$\n21,466\n \nNine months ended September 30, 2024\n(Millions, except per share amounts)\nTotal\nPreferred Shares\nCommon Shares\nAdditional Paid-in Capital\nAccumulated Other Comprehensive Income (Loss)\nRetained Earnings\nBalances as of December 31, 2023\n$\n28,057\n \n$\n—\n \n$\n145\n \n$\n11,372\n \n$\n(\n3,072\n)\n$\n19,612\n \nNet income\n7,959\n \n— \n— \n— \n— \n7,959\n \nOther comprehensive income (loss)\n(\n123\n)\n— \n— \n— \n(\n123\n)\n—\n \nRepurchase of common shares\n(\n4,822\n)\n— \n(\n4\n)\n(\n321\n)\n— \n(\n4,497\n)\nOther changes\n184\n \n— \n— \n244\n \n— \n(\n60\n)\nCash dividends declared preferred Series D, $\n27,315.27\n per share\n(\n44\n)\n— \n— \n— \n— \n(\n44\n)\nCash dividends declared common, $\n2.10\n per share\n(\n1,504\n)\n— \n— \n— \n— \n(\n1,504\n)\nBalances as of September 30, 2024\n$\n29,707\n \n$\n—\n \n$\n141\n \n$\n11,295\n \n$\n(\n3,195\n)\n$\n21,466\n \nSee Notes to Consolidated Financial Statements.\n43\nTable of Contents\nAMERICAN EXPRESS COMPANY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n(Unaudited)\n1.  \nBasis of Presentation\nThe Company\nWe are a global payments and premium lifestyle brand powered by technology. Founded in 1850 and headquartered in New York, American Express’ card-issuing, merchant-acquiring and card network businesses offer products and services to a broad range of customers, including consumers, small businesses, mid-sized companies and large corporations around the world. These products and services are offered through various channels, including mobile and online applications, affiliate marketing, customer referral programs, third-party service providers and business partners, in-house sales teams, direct mail, telephone and direct response advertising.\nThe accompanying Consolidated Financial Statements should be read in conjunction with the Consolidated Financial Statements included in our Annual Report on Form 10-K for the year ended December 31, 2024 (the 2024 Form 10-K). If not materially different, certain note disclosures included therein have been omitted from these Consolidated Financial Statements.\nThe interim Consolidated Financial Statements included in this report have not been audited. In the opinion of management, all adjustments, which consist of normal recurring adjustments necessary for a fair statement of the interim Consolidated Financial Statements, have been made. Results of operations reported for interim periods are not necessarily indicative of results for the entire year.\nThe preparation of Consolidated Financial Statements in conformity with accounting principles generally accepted in the United States of America (GAAP) requires management to make estimates and assumptions that affect the reported amounts of assets, liabilities, revenues and expenses, and the disclosures of contingent assets and liabilities. These accounting estimates reflect the best judgment of management, but actual results could differ.\nCertain reclassifications of prior period amounts have been made to conform to the current period presentation.\nBusiness Events\nEffective June 1, 2025, we reclassified $\n1.6\n billion of Card Member loans related to the Amazon small business cobrand portfolio to Card Member loans HFS on the Consolidated Balance Sheets and released $\n144\n million of associated reserve for credit losses, which was recognized within Provisions for credit losses in the Consolidated Statements of Income.\nOn April 16, 2025, we completed the acquisition of Center ID Corp. (Center), an expense management software company. As a result of the acquisition, we recognized $\n590\n million of Goodwill that is reported within our Commercial Services (CS) segment.\nOn May 1, 2024, we completed the sale of fraud prevention solutions provider Accertify, Inc. (Accertify), a wholly owned subsidiary we acquired in 2010, the operations of which were reported within our Global Merchant and Network Services (GMNS) segment. The transaction resulted in a gain of $\n531\n million ($\n479\n million after tax), which was reported as a reduction to Other expense in the second quarter of 2024. Prior to the completion of the transaction, the carrying amount of Accertify’s net assets were not material to our financial position.\nRecently Issued Accounting Standards\nIn December 2023, the Financial Accounting Standards Board issued updated accounting guidance on Disclosures for Income Taxes, effective for annual reporting periods beginning after December 15, 2024, with early adoption permitted. The updated guidance requires additional disclosure and disaggregated information in the Income Tax Rate reconciliation using both percentages and reporting currency amounts, with additional qualitative explanations of individually significant reconciling items. The updated guidance also requires disclosure of the amount of income taxes paid (net of refunds received) disaggregated by jurisdictional categories (federal (national), state and foreign). The updated guidance is not expected to have a material impact to our Consolidated Financial Statements.\nIn November 2024 and as amended in January 2025, the Financial Accounting Standards Board issued updated accounting guidance on the Disaggregation of Income Statement Expenses for annual reporting periods beginning after December 15, 2026 and for interim reporting periods beginning December 15, 2027, with early adoption permitted. The updated guidance includes the requirement for a new tabular disclosure within a Note to the Consolidated Financial Statements, to disaggregate defined expense categories from the expense report lines presented on the Consolidated Statements of Income. We are currently assessing the updated guidance and its impact to our Consolidated Financial Statements.\nIn September 2025, the Financial Accounting Standards Board issued updated guidance on accounting for internal-use software, effective for annual reporting periods beginning after December 15, 2027, with early adoption permitted. The amendments modernize guidance to consider different methods of software development, updating the requirements for capitalization of software costs. We are currently assessing the updated guidance; however, it is not expected to have a material impact to our Consolidated Financial Statements.\n44\nTable of Contents\nAMERICAN EXPRESS COMPANY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n(Unaudited)\n2.  \nLoans and Card Member Receivables\nOur lending and charge payment card products that we offer to consumer, small business and corporate customers result in the generation of Card Member loans and Card Member receivables. We also extend credit to customers through financing products that are not associated with a Card Member agreement, and instead are governed by a separate borrowing relationship, resulting in Other loans.\nCard Member and Other loans as of September 30, 2025 and December 31, 2024 consisted of:\nTable 2.1: Card Member and Other Loans\n(Millions)\n2025\n2024\nConsumer \n(a)\n$\n110,957\n \n$\n107,646\n \nSmall Business\n33,818\n \n31,991\n \nCorporate\n38\n \n37\n \nCard Member loans\n144,814\n \n139,674\n \nLess: Reserves for credit losses\n5,868\n \n5,679\n \nCard Member loans, net\n$\n138,946\n \n$\n133,995\n \nOther loans, net \n(b)\n$\n10,231\n \n$\n9,038\n \n(a)\nIncludes approximately $\n26.4\n billion and $\n28.3\n billion of gross Card Member loans available to settle obligations of a consolidated variable interest entity (VIE) as of September 30, 2025 and December 31, 2024, respectively.\n(b)\nOther loans are presented net of reserves for credit losses of $\n287\n million and $\n194\n million as of September 30, 2025 and December 31, 2024, respectively.\nCard Member receivables as of September 30, 2025 and December 31, 2024 consisted of:\nTable 2.2: Card Member Receivables\n(Millions)\n2025\n2024\nConsumer\n$\n24,446\n \n$\n25,431\n \nSmall Business\n19,189\n \n18,619\n \nCorporate \n(a)\n17,388\n \n15,361\n \nCard Member receivables\n61,023\n \n59,411\n \nLess: Reserves for credit losses\n200\n \n171\n \nCard Member receivables, net\n$\n60,823\n \n$\n59,240\n \n(a)\nIncludes $\n6.7\n billion and $\n3.9\n billion of gross Card Member receivables available to settle obligations of a consolidated VIE as of September 30, 2025 and December 31, 2024, respectively.\n45\nTable of Contents\nAMERICAN EXPRESS COMPANY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n(Unaudited)\nCard Member Loans and Receivables Aging\nGenerally, a Card Member account is considered past due if payment due is not received within \n30\n days after the billing statement date. \nThe following tables present the aging of Card Member loans and receivables as of September 30, 2025 and December 31, 2024:\nTable 2.3: Card Member Loans and Receivables Aging\n2025 (\nMillions\n)\nCurrent\n30-59 \nDays\nPast Due\n60-89\nDays \nPast Due\n90+ \nDays \nPast Due\nTotal\n90+ Days Past Due and Still Accruing Interest \n(a)\nNon-Accruals\n(b)\nCard Member Loans:\nConsumer\n$\n109,430\n \n$\n460\n \n$\n335\n \n$\n732\n \n$\n110,957\n \n$\n470\n \n$\n430\n \nSmall Business\n33,295\n \n168\n \n119\n \n236\n \n33,818\n \n141\n \n143\n \nCorporate \n(c)\n(d)\n(d)\n(d)\n—\n \n38\n \n—\n \n—\n \nCard Member Receivables:\nConsumer\n24,214\n \n63\n \n49\n \n120\n \n24,446\n \n—\n \n—\n \nSmall Business\n$\n18,981\n \n$\n75\n \n$\n45\n \n88\n \n19,189\n \n—\n \n—\n \nCorporate \n(c)\n(d)\n(d)\n(d)\n$\n65\n \n$\n17,388\n \n$\n—\n \n$\n—\n \n2024 (\nMillions\n)\nCurrent\n30-59 \nDays\nPast Due\n60-89\nDays \nPast Due\n90+ \nDays \nPast Due\nTotal\n90+ Days Past Due and Still Accruing Interest \n(a)\nNon-Accruals\n(b)\nCard Member Loans:\nConsumer\n$\n106,155\n \n$\n437\n \n$\n329\n \n$\n725\n \n$\n107,646\n \n$\n435\n \n$\n464\n \nSmall Business\n31,510\n \n151\n \n107\n \n223\n \n31,991\n \n132\n \n135\n \nCorporate \n(c)\n(d)\n(d)\n(d)\n—\n \n37\n \n—\n \n—\n \nCard Member Receivables:\nConsumer\n25,255\n \n58\n \n39\n \n79\n \n25,431\n \n—\n \n—\n \nSmall Business\n$\n18,400\n \n$\n77\n \n$\n54\n \n88\n \n18,619\n \n—\n \n—\n \nCorporate \n(c)\n(d)\n(d)\n(d)\n$\n65\n \n$\n15,361\n \n$\n—\n \n$\n—\n \n(a)\nOur policy is generally to accrue interest through the date of write-off (typically \n180\n days past due). We establish reserves for interest that we believe will not be collected.\n(b)\nNon-accrual loans primarily include certain loans placed with outside collection agencies for which we have ceased accruing interest.\n(c)\nFor corporate accounts, delinquency data is tracked based on days past billing status rather than days past due. A Card Member account is considered 90 days past billing if payment has not been received within 90 days of the Card Member’s billing statement date. In addition, if we initiate collection procedures on an account prior to the account becoming 90 days past billing, the associated Card Member loan or receivable balance is classified as 90 days past billing. These amounts are shown above as 90+ Days Past Due for presentation purposes. See also (d).\n(d)\nDelinquency data for periods other than 90+ days past billing has not historically been available due to system constraints. Therefore, such data has not been a material input for risk management purposes. The balances that are current to 89 days past billing can be derived as the difference between the Total and the 90+ Days Past Due balances.\n46\nTable of Contents\nAMERICAN EXPRESS COMPANY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n(Unaudited)\nOther Loans Aging and Gross Write-Offs by Origination Year\nGenerally, a customer loan is considered past due if payment due is not received within \n30\n days after the payment due date. \nThe following tables present the aging and gross write-offs for other loans by year of origination as of or for the nine months ended September 30, 2025, and as of or for the twelve months ended December 31, 2024:\nTable 2.4: Other Loans Aging and Gross Write-Offs by Origination Year\n2025 (\nMillions\n)\n2025\n2024\n2023\n2022\n2021\nPrior\nRevolving Loans \n(a)\nTotal\nCurrent\n$\n4,513\n \n$\n2,690\n \n$\n686\n \n$\n65\n \n$\n7\n \n$\n58\n \n$\n2,440\n \n$\n10,459\n \n30-59 Days Past Due\n3\n \n7\n \n3\n \n1\n \n—\n \n1\n \n8\n \n23\n \n60-89 Days Past Due\n2\n \n6\n \n3\n \n—\n \n—\n \n—\n \n7\n \n18\n \n90+ Days Past Due\n (b)\n1\n \n5\n \n3\n \n1\n \n—\n \n1\n \n7\n \n18\n \nTotal \n(c)\n$\n4,519\n \n$\n2,708\n \n$\n695\n \n$\n67\n \n$\n7\n \n$\n60\n \n$\n2,462\n \n$\n10,518\n \nGross Write-Offs\n$\n6\n \n$\n56\n \n$\n39\n \n$\n11\n \n$\n1\n \n$\n—\n \n$\n65\n \n$\n178\n \n2024 (\nMillions\n)\n2024\n2023\n2022\n2021\n2020\nPrior\nRevolving Loans \n(a)\nTotal\nCurrent\n$\n4,950\n \n$\n1,578\n \n$\n356\n \n$\n10\n \n$\n14\n \n$\n57\n \n$\n2,209\n \n$\n9,174\n \n30-59 Days Past Due\n5\n \n5\n \n2\n \n—\n \n—\n \n—\n \n10\n \n22\n \n60-89 Days Past Due\n5\n \n4\n \n2\n \n—\n \n—\n \n—\n \n7\n \n18\n \n90+ Days Past Due\n (b)\n4\n \n4\n \n2\n \n—\n \n—\n \n1\n \n7\n \n18\n \nTotal \n(c)\n$\n4,964\n \n$\n1,591\n \n$\n362\n \n$\n10\n \n$\n14\n \n$\n58\n \n$\n2,233\n \n$\n9,232\n \nGross Write-Offs\n$\n13\n \n$\n59\n \n$\n42\n \n$\n6\n \n$\n—\n \n$\n—\n \n$\n87\n \n$\n207\n \n(a)\nRevolving loans consist primarily of lines of credit offered to small business customers.\n(b)\nOver 90 days past due includes $\n7\n million and $\n6\n million as of September 30, 2025 and December 31, 2024, respectively, of loans on which interest is still accruing. Our policy is generally to accrue interest through the date of write-off (typically 120 days past due) except for lines of credit offered to small business customers, where interest ceases to accrue at 90 days past due. We establish reserves for interest that we believe will not be collected.\n(c)\nThis total includes non-accrual loans of $\n19\n million as of both September 30, 2025 and December 31, 2024. Non-accruals for consumer installment loans primarily include certain loans placed with outside collection agencies for which we have ceased accruing interest.\n47\nTable of Contents\nAMERICAN EXPRESS COMPANY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n(Unaudited)\nCredit Quality Indicators for Loans and Card Member Receivables\nThe following table presents the key credit quality indicators as of or for the nine months ended September 30:\nTable 2.5: Credit Quality Indicators for Loans and Card Member Receivables\n2025\n2024\nNet Write-Off Rate\nNet Write-Off Rate\nPrincipal \nOnly \n(a)\nPrincipal, \nInterest & \nFees \n(a)\n30+ Days Past Due as a % of Total\nPrincipal \nOnly \n(a)\nPrincipal, \nInterest & \nFees \n(a)\n30+ Days Past Due as a % of Total\nCard Member Loans:\nConsumer\n2.1\n \n%\n2.6\n \n%\n1.4\n \n%\n2.2\n \n%\n2.8\n \n%\n1.4\n \n%\nSmall Business\n2.5\n \n%\n2.9\n \n%\n1.5\n \n%\n2.2\n \n%\n2.6\n \n%\n1.4\n \n%\nCard Member Receivables:\nConsumer\n1.0\n \n%\n1.1\n \n%\n1.0\n \n%\n1.3\n \n%\n1.4\n \n%\n0.8\n \n%\nSmall Business\n1.8\n \n%\n2.0\n \n%\n1.1\n \n%\n2.0\n \n%\n2.1\n \n%\n1.2\n \n%\nCorporate \n(b)\n0.5\n \n%\n(c)\n(b)\n0.6\n \n%\n(c)\nOther Loans\n2.0\n \n%\n2.1\n \n%\n0.6\n \n%\n2.2\n \n%\n2.3\n \n%\n0.7\n \n%\n(a)\nWe present a net write-off rate based on principal losses only (i.e., excluding interest and/or fees) to be consistent with industry convention. In addition, as our practice is to include uncollectible interest and/or fees as part of our total provision for credit losses, a net write-off rate including principal, interest and/or fees is also presented.\n(b)\nNet write-off rate based on principal losses only is not available due to system constraints.\n(c)\nFor corporate receivables, delinquency data is tracked based on days past billing status rather than days past due. Delinquency data for periods other than 90+ days past billing is not available due to system constraints. 90+ days past billing as a % of total was \n0.4\n% as of both September 30, 2025 and 2024.\nRefer to Note 3 for additional indicators, including external qualitative factors, management considers in its evaluation process for reserves for credit losses.\n48\nTable of Contents\nAMERICAN EXPRESS COMPANY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n(Unaudited)\nLoans and Receivables Restructurings for Borrowers Experiencing Financial Difficulty\nWe evaluate all loans and receivables restructurings according to the accounting guidance for loan refinancing and restructuring to determine whether such loan modification should be accounted for as a new loan or a continuation of the existing loan. Our loans and receivables restructurings for borrowers experiencing financial difficulty are generally accounted for as a continuation of the existing loan, which reflects the ongoing effort to support our customer and recover our investment in the existing loan.\nWe offer several types of loans and receivables modification programs to customers experiencing financial difficulty. In such instances, we may modify loans and receivables with the intention to minimize losses and improve collectability, while providing customers with temporary or permanent financial relief.\nSuch modifications to the loans and receivables primarily include (i) temporary interest rate reductions (reducing interest rates to as low as zero percent, in which case the loan is characterized as non-accrual), and/or (ii) placing the customer on a fixed payment plan not to exceed \n60\n months. Upon entering the modification program, the customer’s ability to make future purchases is limited, canceled or, in certain cases, suspended until the customer successfully exits from the modification program. As of September 30, 2025 and 2024, we had $\n59\n million and $\n70\n million, respectively, of unused credit available to customers with loans and receivables modified during each of the respective nine month periods. In accordance with the modification agreement with the customer, loans and/or receivables may revert to the original contractual terms (including the contractual interest rate where applicable) when the customer exits the modification program, which is either (i) when all payments have been made in accordance with the modification agreement or (ii) when the customer defaults out of the modification program.\n49\nTable of Contents\nAMERICAN EXPRESS COMPANY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n(Unaudited)\nThe following tables provide information relating to loans and receivables modifications for borrowers experiencing financial difficulty during the three and nine months ended September 30, 2025 and 2024: \nTable 2.6: Loans and Receivables Modifications for Borrowers experiencing Financial Difficulty\nThree Months Ended September 30,\n2025\n2024\nAccount Balances\n(\nMillions\n) \n(a)\n% of Total Class of \nFinancing Receivables\nWeighted Average Interest Rate Reduction\n(% points)\nWeighted Average Payment\nTerm Extensions\n(# of months)\nAccount Balances\n(\nMillions\n) \n(a)\n% of Total Class of \nFinancing Receivables\nWeighted Average Interest Rate Reduction\n(% points)\nWeighted Average Payment\nTerm Extensions\n(# of months)\nInterest Rate Reduction\nCard Member Loans\nConsumer\n$\n591\n \n0.5\n \n%\n18.2\n \n%\n(b)\n$\n511\n \n0.5\n \n%\n18.3\n \n%\n(b)\nSmall Business\n221\n \n0.7\n \n%\n17.7\n \n%\n(b)\n185\n \n0.6\n \n%\n17.6\n \n%\n(b)\nCorporate\n—\n \n—\n \n—\n \n(b)\n—\n \n—\n \n—\n \n(b)\nTerm Extension\nCard Member Receivables\nConsumer\n77\n \n0.3\n \n%\n(c)\n33\n89\n \n0.4\n \n%\n(c)\n31\nSmall Business\n111\n \n0.6\n \n%\n(c)\n30\n138\n \n0.7\n \n%\n(c)\n31\nCorporate\n7\n \n0.04\n \n%\n(c)\n9\n9\n \n0.1\n \n%\n(c)\n10\nOther Loans\n9\n \n0.1\n \n%\n—\n \n16\n8\n \n0.1\n \n%\n—\n \n16\nInterest Rate Reduction \nand Term Extension\nOther Loans\n19\n \n0.2\n \n%\n3.4\n \n%\n21\n16\n \n0.2\n \n%\n2.5\n \n%\n20\nTotal\n$\n1,035\n \n$\n956\n \nNine Months Ended September 30,\n2025\n2024\nAccount Balances\n(\nMillions\n) \n(a)\n% of Total Class of \nFinancing Receivables\nWeighted Average Interest Rate Reduction\n(% points)\nWeighted Average Payment\nTerm Extensions\n(# of months)\nAccount Balances\n(\nMillions\n) \n(a)\n% of Total Class of \nFinancing Receivables\nWeighted Average Interest Rate Reduction\n(% points)\nWeighted Average Payment\nTerm Extensions\n(# of months)\nInterest Rate Reduction\nCard Member Loans\nConsumer\n$\n1,482\n \n1.3\n \n%\n18.3\n \n%\n(b)\n$\n1,438\n \n1.4\n \n%\n18.2\n \n%\n(b)\nSmall Business\n582\n \n1.7\n \n%\n17.7\n \n%\n(b)\n514\n \n1.6\n \n%\n17.5\n \n%\n(b)\nCorporate\n—\n \n—\n \n—\n \n(b)\n—\n \n—\n \n—\n \n(b)\nTerm Extension\nCard Member Receivables\nConsumer\n178\n \n0.7\n \n%\n(c)\n32\n232\n \n1.0\n \n%\n(c)\n30\nSmall Business\n287\n \n1.5\n \n%\n(c)\n30\n359\n \n1.9\n \n%\n(c)\n30\nCorporate\n16\n \n0.1\n \n%\n(c)\n10\n15\n \n0.1\n \n%\n(c)\n9\nOther Loans\n25\n \n0.2\n \n%\n—\n \n17\n26\n \n0.3\n \n%\n—\n \n18\nInterest Rate Reduction \nand Term Extension\nOther Loans\n46\n \n0.4\n \n%\n3.3\n \n%\n21\n46\n \n0.5\n \n%\n2.5\n \n%\n20\nTotal\n$\n2,616\n \n$\n2,630\n \n(a)\nRepresents the outstanding balances as of September 30, 2025 and 2024, respectively, of all modifications undertaken in the current and preceding three and nine months for loans and receivables that remain in modification programs as of, or that defaulted on or before, September 30, 2025 and 2024, respectively. The outstanding balances include principal, fees, and accrued interest on loans and principal and fees on receivables. Modifications did not reduce the principal balance.\n(b)\nFor Card Member loans, we generally do not offer payment term extensions.\n(c)\nWe do not offer interest rate reduction programs for Card Member receivables as the receivables are non-interest bearing.\n50\nTable of Contents\nAMERICAN EXPRESS COMPANY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n(Unaudited)\nThe following tables provide information with respect to modified loans and receivables that defaulted during the three and nine months ended September 30, 2025 and 2024, and were modified in the twelve months prior to the payment default. A customer can miss up to three payments before being considered in default, depending on the terms of the modification program.\nTable 2.7: Modified Loans and Receivables that Defaulted within Twelve Months of Modification\nThree Months Ended September 30,\n2025\n2024\nAccount Balance (\nMillions\n) \n(a)\nInterest Rate Reduction\nTerm Extension\nInterest Rate Reduction and Term Extension\nTotal\nInterest Rate Reduction\nTerm Extension\nInterest Rate Reduction and Term Extension\nTotal\nCard Member Loans\nConsumer\n$\n40\n \n(b)\n$\n—\n$\n40\n \n$\n52\n \n(b)\n$\n—\n \n$\n52\n \nSmall Business\n19\n \n(b)\n—\n19\n \n23\n \n(b)\n—\n \n23\n \nCorporate\n—\n \n(b)\n—\n—\n \n—\n \n(b)\n—\n \n—\n \nCard Member Receivables\nConsumer\n(c)\n$\n5\n \n—\n \n5\n \n(c)\n$\n6\n \n—\n \n6\n \nSmall Business\n(c)\n9\n \n—\n \n9\n \n(c)\n12\n \n—\n \n12\n \nCorporate\n(c)\n—\n \n—\n \n—\n \n(c)\n—\n \n—\n \n—\n \nOther Loans\n—\n \n—\n \n1\n \n1\n \n—\n \n—\n \n2\n \n2\n \nTotal\n$\n59\n \n$\n14\n \n$\n1\n \n$\n74\n \n$\n75\n \n$\n18\n \n$\n2\n \n$\n95\n \nNine Months Ended September 30,\n2025\n2024\nAccount Balance (\nMillions\n) \n(a)\nInterest Rate Reduction\nTerm Extension\nInterest Rate Reduction and Term Extension\nTotal\nInterest Rate Reduction\nTerm Extension\nInterest Rate Reduction and Term Extension\nTotal\nCard Member Loans\nConsumer\n$\n65\n \n(b)\n$\n—\n$\n65\n \n$\n75\n \n(b)\n—\n \n$\n75\n \nSmall Business\n31\n \n(b)\n—\n31\n \n33\n \n(b)\n—\n \n33\n \nCorporate\n—\n \n(b)\n—\n—\n \n—\n \n(b)\n—\n \n—\n \nCard Member Receivables\nConsumer\n(c)\n$\n6\n \n—\n \n6\n \n(c)\n$\n8\n \n—\n \n8\n \nSmall Business\n(c)\n13\n \n—\n \n13\n \n(c)\n16\n \n—\n \n16\n \nCorporate\n(c)\n—\n \n—\n \n—\n \n(c)\n—\n \n—\n \n—\n \nOther Loans\n—\n \n—\n \n2\n \n2\n \n—\n \n—\n \n2\n \n2\n \nTotal\n$\n96\n \n$\n19\n \n$\n2\n \n$\n117\n \n$\n108\n \n$\n24\n \n$\n2\n \n$\n134\n \n(a)\nRepresents the outstanding balances as of September 30, 2025 and 2024, respectively, of all modifications that defaulted in the periods presented and were modified in the twelve months prior to payment default. The outstanding balances include principal, fees and accrued interest on loans and principal and fees on receivables.\n(b)\nFor Card Member loans, we generally do not offer payment term extensions.\n(c)\nWe do not offer interest rate reduction programs for Card Member receivables as the receivables are non-interest bearing.\n51\nTable of Contents\nAMERICAN EXPRESS COMPANY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n(Unaudited)\nThe following tables provide information relating to the performance of loans and receivables that were modified during the prior twelve months and that remain in modification programs as of, or that defaulted on or before, September 30, 2025 and 2024:\nTable 2.8: Performance of Modified Loans and Receivables \nAs of September 30, 2025\nAccount Balances (\nMillions\n) \n(a)\nCurrent\n30-89 Days Past Due\n90+ Days Past Due\nCard Member Loans\nConsumer\n$\n1,669\n \n$\n114\n \n$\n42\n \nSmall Business\n631\n \n59\n \n22\n \nCorporate\n—\n \n—\n \n—\n \nCard Member Receivables:\nConsumer\n194\n \n14\n \n5\n \nSmall Business\n306\n \n28\n \n9\n \nCorporate\n11\n \n4\n \n2\n \nOther Loans\n80\n \n5\n \n1\n \nTotal\n$\n2,891\n \n$\n224\n \n$\n81\n \nAs of September 30, 2024\nAccount Balances (\nMillions\n) \n(a)\nCurrent\n30-89 Days Past Due\n90+ Days Past Due\nCard Member Loans\nConsumer\n$\n1,647\n \n$\n124\n \n$\n48\n \nSmall Business\n556\n \n59\n \n23\n \nCorporate\n—\n \n—\n \n—\n \nCard Member Receivables:\nConsumer\n261\n \n19\n \n6\n \nSmall Business\n386\n \n41\n \n14\n \nCorporate\n11\n \n3\n \n2\n \nOther Loans\n78\n \n6\n \n2\n \nTotal\n$\n2,939\n \n$\n252\n \n$\n95\n \n(a)\nThe outstanding balances include principal, fees and accrued interest on loans and principal and fees on receivables.\n52\nTable of Contents\nAMERICAN EXPRESS COMPANY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n(Unaudited)\n3.  \nReserves for Credit Losses\nReserves for credit losses represent our best estimate of the expected credit losses in our outstanding portfolio of Card Member loans and receivables as of the balance sheet date. The Current Expected Credit Loss (CECL) methodology requires us to estimate lifetime expected credit losses by incorporating historical loss experience, as well as current and future economic conditions over a reasonable and supportable period (R&S Period), which is approximately \nthree years\n, beyond the balance sheet date. We make various judgments combined with historical loss experience to determine a reserve rate that is applied to the outstanding loan or receivable balance to produce a reserve for expected credit losses.\nWe use a combination of statistically-based models that incorporate current and future economic conditions throughout the R&S Period. The process of estimating expected credit losses is based on several key models: Probability of Default (PD), Exposure at Default (EAD), and future recoveries for each month of the R&S Period. Beyond the R&S Period, we estimate expected credit losses by immediately reverting to long-term average loss rates.\n•\nPD models are used to estimate the likelihood an account will be written-off. \n•\nEAD models are used to estimate the balance of an account at the time of write-off. This includes balances less expected repayments based on historical payment and revolve behavior, which vary by customer. Due to the nature of revolving loan portfolios, the EAD models are complex and involve assumptions regarding the relationship between future spend and payment behaviors.\n•\nRecovery models are used to estimate amounts that are expected to be received from Card Members after default occurs, typically as a result of collection efforts. Future recoveries are estimated taking into consideration the time of default, time elapsed since default and macroeconomic conditions. \nWe also estimate the likelihood and magnitude of recovery of previously written off accounts considering how long ago the account was written off and future economic conditions, even if such expected recoveries exceed expected losses. Our models are developed using historical loss experience covering the economic cycle and consider the impact of account characteristics on expected losses. This history includes the performance of loans and receivables modifications for borrowers experiencing financial difficulty, including their subsequent defaults.\nFuture economic conditions that are incorporated over the R&S Period include multiple macroeconomic scenarios provided to us by an independent third party. Management reviews these economic scenarios each period and assigns probability weights to each scenario, generally with a consistent initial distribution. At times, due to macroeconomic uncertainty and volatility, management may apply judgment and assign different probability weights to scenarios. These macroeconomic scenarios contain certain variables, including unemployment rates and real gross domestic product (GDP), that are significant to our models.\nWe also evaluate whether to include qualitative reserves to cover losses that are expected but, in our assessment, may not be adequately represented in the quantitative methods or the economic assumptions. We consider whether to adjust the quantitative reserves (higher or lower) to address possible limitations within the models or factors not included within the models, such as external conditions, emerging portfolio trends, the nature and size of the portfolio, portfolio concentrations, the volume and severity of past due accounts, or management risk actions.\nLifetime losses for most of our loans and receivables are evaluated at an appropriate level of granularity, including assessment on a pooled basis where financial assets share similar risk characteristics, such as past spend and remittance behaviors, credit bureau scores where available, delinquency status, tenure of balance outstanding, amongst others. Credit losses on accrued interest are measured and presented as part of Reserves for credit losses on the Consolidated Balance Sheets and within the Provisions for credit losses in the Consolidated Statements of Income, rather than reversing interest income.\nFor Other loans, we use vintage-based historical performance to estimate expected credit losses over the life of the loan, net of recovery estimates.\nLoans and receivable balances are written off when we consider amounts to be uncollectible, which is generally determined by the number of days past due and is typically no later than \n180\n days past due for Card Member loans and receivables and \n120\n days past due for Other loans. Balances in bankruptcy or owed by deceased individuals are generally written off upon notification.\n \n53\nTable of Contents\nAMERICAN EXPRESS COMPANY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n(Unaudited)\nThe following table reflects the range of macroeconomic scenario key variables available to us as of September 30, 2025 and December 31, 2024, respectively, which were used, in conjunction with other inputs, to calculate reserves for credit losses:\nTable 3.1: Key Macroeconomic Variables\nU.S. Unemployment Rate \nU.S. GDP Growth (Contraction) \n(a)\nSeptember 30, 2025\nDecember 31, 2024\nSeptember 30, 2025\nDecember 31, 2024\nThird quarter of 2025\n4\n%\n3\n% - \n8\n%\n1\n%\n3\n% - (\n4\n)%\nFourth quarter of 2025\n4\n% - \n6\n%\n3\n% - \n8\n%\n5\n% - (\n3\n)%\n3\n% - \n1\n%\nFourth quarter of 2026\n4\n% - \n8\n%\n3\n% - \n7\n%\n2\n% - \n1\n%\n2\n%\nFourth quarter of 2027\n4\n% - \n7\n%\n3\n% - \n6\n%\n3\n% - \n2\n%\n4\n% - \n2\n%\n(a)\nReal GDP quarter over quarter percentage change seasonally adjusted to annualized rates.\nChanges in Card Member Loans Reserve for Credit Losses\nCard Member loans reserve for credit losses increased for both the three and nine months ended September 30, 2025, primarily driven by increases in loans outstanding and, for the nine month period, deterioration in the macroeconomic outlook used in our reserve models, partially offset by the release of a reserve upon the previously-mentioned reclassification of a small business cobrand portfolio to Card Member loans HFS.\nCard Member loans reserve for credit losses increased for both the three and nine months ended September 30, 2024, primarily driven by increases in loans outstanding.\nThe following table presents changes in the Card Member loans reserve for credit losses for the three and nine months ended September 30:\nTable 3.2: Changes in Card Member Loans Reserve for Credit Losses\nThree Months Ended September 30,\nNine Months Ended September 30,\n(Millions)\n2025\n2024\n2025\n2024\nBeginning Balance\n$\n5,767\n \n$\n5,321\n \n$\n5,679\n \n$\n5,118\n \nProvisions \n(a)\n1,030\n \n1,114\n \n3,025\n \n3,098\n \nNet write-offs \n(b)\nPrincipal\n(\n760\n)\n(\n701\n)\n(\n2,349\n)\n(\n2,159\n)\nInterest and fees\n(\n168\n)\n(\n152\n)\n(\n512\n)\n(\n462\n)\nOther \n(c)\n(\n1\n)\n6\n \n25\n \n(\n7\n)\nEnding Balance\n$\n5,868\n \n$\n5,588\n \n$\n5,868\n \n$\n5,588\n \n(a)\nProvisions for principal, interest and fee reserve components. Provisions for credit losses includes reserve build (release) and replenishment for net write-offs. In addition, provisions for the nine months ended September 30, 2025 include the reserve release of $\n144\n million upon the previously-mentioned reclassification of a small business cobrand portfolio to Card Member loans HFS in the second quarter of 2025. See Note 1 for additional information.\n(b)\nPrincipal write-offs are presented less recoveries of $\n261\n million and $\n192\n million for the three months ended September 30, 2025 and 2024, respectively, and $\n724\n million and $\n530\n million for the nine months ended September 30, 2025 and 2024, respectively. Recoveries of interest and fees were not significant.\n(c)\nPrimarily includes foreign currency translation adjustments.\n54\nTable of Contents\nAMERICAN EXPRESS COMPANY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n(Unaudited)\nChanges in Card Member Receivables Reserve for Credit Losses\nCard Member receivables reserve for credit losses increased for both the three and nine months ended September 30, 2025, primarily driven by higher delinquencies and, for the nine month period, deterioration in the macroeconomic outlook used in our reserve models and an increase in receivables outstanding.\nCard Member receivables reserve for credit losses decreased for both the three and nine months ended September 30, 2024, primarily driven by decreases in receivables outstanding.\nThe following table presents changes in the Card Member receivables reserve for credit losses for the three and nine months ended September 30:\nTable 3.3: Changes in Card Member Receivables Reserve for Credit Losses\nThree Months Ended September 30,\nNine Months Ended September 30,\n(Millions)\n2025\n2024\n2025\n2024\nBeginning Balance \n$\n193\n \n$\n171\n \n$\n171\n \n$\n174\n \nProvisions \n(a)\n190\n \n170\n \n562\n \n592\n \nNet write-offs \n(b)\n(\n183\n)\n(\n187\n)\n(\n536\n)\n(\n609\n)\nOther \n(c)\n—\n \n2\n \n3\n \n(\n1\n)\nEnding Balance\n$\n200\n \n$\n156\n \n$\n200\n \n$\n156\n \n(a)\nProvisions for principal and fee reserve components. Provisions for credit losses includes reserve build (release) and replenishment for net write-offs. \n(b)\nNet write-offs are presented less recoveries of $\n77\n million and $\n74\n million for the three months ended September 30, 2025 and 2024, respectively, and $\n224\n million and $\n228\n million\n \nfor the nine months ended September 30, 2025 and 2024, respectively.\n(c)\nPrimarily includes foreign currency translation adjustments.\nChanges in Other Loans Reserve for Credit Losses\nOther loans reserve for credit losses increased for both the three and nine months ended September 30, 2025 and 2024, primarily driven by increases in other loans outstanding.\nThe following table presents changes in the Other loans reserve for credit losses for the three and nine months ended September 30:\nTable 3.4: Changes in Other Loans Reserve for Credit Losses\nThree Months Ended September 30,\nNine Months Ended September 30,\n(Millions)\n2025\n2024\n2025\n2024\nBeginning Balance \n$\n272\n \n$\n140\n \n$\n194\n \n$\n126\n \nProvisions \n(a)\n62\n \n60\n \n245\n \n162\n \nNet write-offs \n(b)\nPrincipal\n(\n45\n)\n(\n44\n)\n(\n146\n)\n(\n129\n)\nInterest and Fees\n(\n2\n)\n(\n2\n)\n(\n7\n)\n(\n5\n)\nOther\n—\n \n—\n \n1\n \n—\n \nEnding Balance\n$\n287\n \n$\n154\n \n$\n287\n \n$\n154\n \n(a)\nProvisions for principal, interest and fee reserve components. Provisions for credit losses includes reserve build (release) and replenishment for net write-offs.\n(b)\nPrincipal write-offs are presented less recoveries of $\n10\n million and $\n5\n million for the three months ended September 30, 2025 and 2024, respectively, and $\n25\n million\n \nand\n \n$\n14\n million\n \nfor the nine months ended September 30, 2025 and 2024, respectively. Recoveries of interest and fees were not significant.\n55\nTable of Contents\nAMERICAN EXPRESS COMPANY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n(Unaudited)\n4.  \nInvestment Securities\nInvestment securities principally include available-for-sale (AFS) debt securities carried at fair value on the Consolidated Balance Sheets. Unrealized losses attributable to credit deterioration are recorded in the Consolidated Statements of Income in Other loans Provision for credit losses. Unrealized gains and any portion of a security’s unrealized loss attributable to non-credit losses are recorded in the Consolidated Statements of Comprehensive Income, net of tax. \nWe had accrued interest on our AFS debt securities totaling $\n3\n million as of both September 30, 2025 and December 31, 2024, presented as Other assets on the Consolidated Balance Sheets.\nInvestment securities also include equity securities carried at fair value on the Consolidated Balance Sheets with unrealized gains and losses recorded in the Consolidated Statements of Income as Other, net expense. \nRealized gains and losses are recognized upon disposition of the securities using the specific identification method and recorded in the Consolidated Statements of Income as Other, net expense.\n \nThe following is a summary of investment securities as of September 30, 2025 and December 31, 2024:\nTable 4.1: Investment Securities\n2025\n2024\nDescription of Securities\n(Millions)\nCost\nGross\nUnrealized\nGains\nGross\nUnrealized\nLosses\nEstimated\nFair\nValue\nCost\nGross\nUnrealized\nGains\nGross\nUnrealized\nLosses\nEstimated\nFair\nValue\nAvailable-for-sale debt securities:\nState and municipal obligations\n$\n54\n \n$\n1\n \n$\n(\n7\n)\n$\n48\n \n$\n57\n \n$\n1\n \n$\n(\n9\n)\n$\n49\n \nU.S. Government agency obligations\n4\n \n—\n \n—\n \n3\n \n4\n \n—\n \n—\n \n4\n \nU.S. Government treasury obligations\n277\n \n1\n \n—\n \n278\n \n289\n \n—\n \n(\n2\n)\n287\n \nMortgage-backed securities \n(a)\n10\n \n—\n \n—\n \n9\n \n11\n \n—\n \n(\n1\n)\n10\n \nForeign government bonds and obligations\n908\n \n—\n \n—\n \n908\n \n765\n \n—\n \n—\n \n765\n \nOther \n(b)\n81\n \n—\n \n—\n \n81\n \n77\n \n—\n \n—\n \n77\n \nEquity securities \n(c)\n54\n \n—\n \n(\n8\n)\n46\n \n53\n \n4\n \n(\n9\n)\n48\n \nTotal\n$\n1,388\n \n$\n2\n \n$\n(\n16\n)\n$\n1,374\n \n$\n1,256\n \n$\n5\n \n$\n(\n21\n)\n$\n1,240\n \n(a)\nRepresents mortgage-backed securities guaranteed by Fannie Mae, Freddie Mac or Ginnie Mae.\n(b)\nRepresents investments in debt securities issued by Community Development Financial Institutions.\n(c)\nEquity securities comprise investments in common stock and mutual funds.\n56\nTable of Contents\nAMERICAN EXPRESS COMPANY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n(Unaudited)\nThe following table provides information about our AFS debt securities with gross unrealized losses and the length of time that individual securities have been in a continuous unrealized loss position as of September 30, 2025 and December 31, 2024:\nTable 4.2: AFS Debt Securities with Gross Unrealized Losses by Duration\n2025\n2024\nLess than 12 months\n12 months or more\nLess than 12 months\n12 months or more\nDescription of Securities (\nMillions\n)\nEstimated Fair Value\nGross\nUnrealized\nLosses\nEstimated Fair Value\nGross\nUnrealized\nLosses\nEstimated Fair Value\nGross\nUnrealized\nLosses\nEstimated Fair Value\nGross\nUnrealized\nLosses\nState and municipal obligations\n$\n—\n \n$\n—\n \n$\n25\n \n$\n(\n7\n)\n$\n—\n \n$\n—\n \n$\n22\n \n$\n(\n9\n)\nU.S. Government treasury obligations\n—\n \n—\n \n—\n \n—\n \n—\n \n—\n \n123\n \n(\n2\n)\nMortgage-backed securities\n—\n \n—\n \n—\n \n—\n \n—\n \n—\n \n7\n \n(\n1\n)\nTotal\n$\n—\n \n$\n—\n \n$\n25\n \n$\n(\n7\n)\n$\n—\n \n$\n—\n \n$\n152\n \n$\n(\n12\n)\nThe gross unrealized losses on our AFS debt securities are primarily attributable to an increase in the current benchmark interest rate. Overall, for the AFS debt securities in gross unrealized loss positions, (i) we do not intend to sell the securities, (ii) it is more likely than not that we will not be required to sell the securities before recovery of the unrealized losses, and (iii) we expect that the contractual principal and interest will be received on the securities. We concluded that there was no credit loss attributable to the securities in an unrealized loss position for the periods presented.\nThe following table summarizes the gross unrealized losses for AFS debt securities by ratio of fair value to amortized cost as of September 30, 2025 and December 31, 2024:\n    \nTable 4.3: AFS Gross Unrealized Losses by Ratio of Fair Value to Amortized Cost\nLess than 12 months\n12 months or more\nTotal\nRatio of Fair Value to \nAmortized Cost\n(\nDollars in millions\n)\nNumber of\nSecurities\nEstimated\nFair Value\nGross\nUnrealized\nLosses\nNumber of\nSecurities\nEstimated\nFair Value\nGross\nUnrealized\nLosses\nNumber of\nSecurities\nEstimated\nFair Value\nGross\nUnrealized\nLosses\n2025:\n90–100%\n—\n \n$\n—\n \n$\n—\n \n5\n$\n7\n \n$\n(\n1\n)\n5\n \n$\n7\n \n$\n(\n1\n)\nLess than 90%\n—\n \n$\n—\n \n$\n—\n \n5\n \n$\n18\n \n$\n(\n7\n)\n5\n \n$\n18\n \n$\n(\n7\n)\nTotal as of September 30, 2025\n—\n \n$\n—\n \n$\n—\n \n10\n \n$\n25\n \n$\n(\n7\n)\n10\n \n$\n25\n \n$\n(\n7\n)\n2024:\n90–100%\n—\n \n$\n—\n \n$\n—\n \n30\n \n$\n129\n \n$\n(\n3\n)\n30\n \n$\n129\n \n$\n(\n3\n)\nLess than 90%\n—\n \n$\n—\n \n$\n—\n \n15\n \n$\n23\n \n$\n(\n9\n)\n15\n \n$\n23\n \n$\n(\n9\n)\nTotal as of December 31, 2024\n—\n \n$\n—\n \n$\n—\n \n45\n \n$\n152\n \n$\n(\n12\n)\n45\n \n$\n152\n \n$\n(\n12\n)\nContractual maturities for AFS debt securities with stated maturities as of September 30, 2025 were as follows:\nTable 4.4: Contractual Maturities of AFS Debt Securities\n(Millions)\nCost\nEstimated\nFair Value\nDue within 1 year\n$\n1,139\n \n$\n1,139\n \nDue after 1 year but within 5 years\n143\n \n144\n \nDue after 5 years but within 10 years\n7\n \n7\n \nDue after 10 years\n46\n \n38\n \nTotal\n$\n1,334\n \n$\n1,329\n \nThe expected payments on state and municipal obligations, U.S. Government agency obligations and mortgage-backed securities may not coincide with their contractual maturities because the issuers have the right to call or prepay certain obligations.\n57\nTable of Contents\nAMERICAN EXPRESS COMPANY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n(Unaudited)\n5.  \nAsset Securitizations\nWe periodically securitize Card Member loans and receivables arising from our card businesses through the transfer of those assets to securitization trusts, American Express Credit Account Master Trust (the Lending Trust) and American Express Issuance Trust II (the Charge Trust and together with the Lending Trust, the Trusts). The Trusts then issue debt securities collateralized by the transferred assets to third-party investors.\nThe Trusts are considered VIEs as they have insufficient equity at risk to finance their activities, which are to issue debt securities that are collateralized by the underlying Card Member loans and receivables. We perform the servicing and key decision making for the Trusts, and therefore have the power to direct the activities that most significantly impact the Trusts’ economic performance, which are the collection of the underlying Card Member loans and receivables. In addition, we hold all of the variable interests in both Trusts, with the exception of the debt securities issued to third-party investors.\n Our ownership of variable interests in the Lending Trust was $\n12.5\n billion and $\n14.6\n billion as of September 30, 2025 and December 31, 2024, respectively, and in the Charge Trust was $\n6.7\n billion and $\n3.9\n billion as of September 30, 2025 and December 31, 2024, respectively. \nThese variable interests held by us provide us with the right to receive benefits and the obligation to absorb losses, which could be significant to both the Lending Trust and the Charge Trust. Based on these considerations, we are the primary beneficiary of the Trusts and therefore consolidate the Trusts.\nRestricted cash and cash equivalents held by the Lending Trust was $\n1,238\n million and $\n88\n million as of September 30, 2025 and December 31, 2024, respectively, and by the Charge Trust was \nnil\n as of both September 30, 2025 and December 31, 2024. These amounts relate to collections of Card Member loans and receivables to be used by the Trusts to fund future expenses and obligations, including interest on debt securities, credit losses and upcoming debt maturities.\nUnder the respective terms of the Lending Trust and the Charge Trust agreements, the occurrence of certain triggering events associated with the performance of the assets of each Trust could result in payment of trust expenses, establishment of reserve funds, or, in a worst-case scenario, early amortization of debt securities. During the nine months ended September 30, 2025 and the year ended December 31, 2024, no such triggering events occurred.\n58\nTable of Contents\nAMERICAN EXPRESS COMPANY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n(Unaudited)\n6.  \nCustomer Deposits\nAs of September 30, 2025 and December 31, 2024, customer deposits were categorized as interest-bearing or non-interest-bearing as follows:\nTable 6.1: Interest-bearing and Non-Interest-bearing Customer Deposits\n(Millions)\n2025\n2024\nU.S.:\nInterest-bearing\n$\n148,924\n \n$\n138,433\n \nNon-interest-bearing (includes Card Member credit balances of: 2025, $\n454\n; 2024, $\n513\n)\n521\n \n566\n \nNon-U.S.:\nInterest-bearing\n18\n \n17\n \nNon-interest-bearing (includes Card Member credit balances of: 2025, $\n417\n; 2024, $\n395\n)\n420\n \n397\n \nTotal customer deposits\n$\n149,883\n \n$\n139,413\n \nCustomer deposits by deposit type as of September 30, 2025 and December 31, 2024 were as follows:\nTable 6.2: Customer Deposits by Type\n(Millions)\n2025\n2024\nU.S. interest-bearing deposits:\nSavings accounts\n$\n113,998\n \n$\n108,364\n \nChecking accounts\n2,755\n \n2,045\n \nCertificates of deposit:\nDirect\n5,169\n \n4,303\n \nThird-party (brokered)\n11,437\n \n8,109\n \nSweep accounts – Third-party (brokered)\n15,566\n \n15,612\n \nTotal U.S. interest-bearing deposits\n$\n148,924\n \n$\n138,433\n \nOther deposits\n88\n \n72\n \nCard Member credit balances\n871\n \n908\n \nTotal customer deposits\n$\n149,883\n \n$\n139,413\n \nThe scheduled maturities of certificates of deposit as of September 30, 2025 were as follows:\nTable 6.3: Scheduled Maturities of Certificates of Deposit\n(Millions)\n2025\n2026\n2027\n2028\n2029\nAfter 5 Years\nTotal\nCertificates of deposit \n(a)\n$\n2,409\n \n$\n4,871\n \n$\n4,081\n \n$\n2,724\n \n$\n671\n \n$\n1,861\n \n$\n16,618\n \n(a)\nIncludes $\n12\n million of non-U.S. direct certificates of deposit as of September 30, 2025.\nAs of September 30, 2025 and December 31, 2024, certificates of deposit in denominations that met or exceeded the insured limit were $\n1.7\n billion and $\n1.4\n billion, respectively.\n59\nTable of Contents\nAMERICAN EXPRESS COMPANY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n(Unaudited)\n7.  \nContingencies\nIn the ordinary course of business, we and our subsidiaries are subject to various pending and potential legal actions, arbitration proceedings, claims, investigations, examinations, regulatory proceedings, information gathering requests, subpoenas, inquiries and matters relating to compliance with laws and regulations (collectively, legal proceedings).\nBased on our current knowledge, and taking into consideration our litigation-related liabilities, we do not believe we are a party to, nor are any of our properties the subject of, any legal proceeding that would have a material adverse effect on our consolidated financial condition or liquidity. However, in light of the uncertainties involved in such matters, including the fact that some pending legal proceedings are at preliminary stages or seek an indeterminate amount of damages, penalties or fines, it is possible that the outcome of legal proceedings could have a material impact on our results of operations. Certain legal proceedings involving us or our subsidiaries are described below.\nOn September 30, 2024, we were named as a defendant in a case filed in the United States District Court for the District of Massachusetts, captioned \nPizza Hazel, Inc., et al. v. American Express Co., et al.,\n in which plaintiffs allege that the anti-steering and non-discrimination provisions in our merchant agreements violate federal antitrust law and that the arbitration provision in our merchant agreements violates federal antitrust law to the extent it prevents antitrust challenges to our anti-steering and non-discrimination provisions. Plaintiffs seek, on behalf of themselves and a class of merchants that accept through the OptBlue Program, unspecified damages and an injunction prohibiting us from enforcing our anti-steering and non-discrimination provisions and prohibiting us from enforcing our arbitration provision to the extent the arbitration provision prevents antitrust challenges to our anti-steering and non-discrimination provisions. The court rejected our motion to compel the case to arbitration; we plan to appeal the decision.\nOn March 21, 2024, we were named as a defendant in a case filed in the United States District Court for the District of Rhode Island, captioned \n5-Star General Store aka Bento LLC, et al. v. American Express Co., et al.\n, in which plaintiffs allege that the anti-steering and non-discrimination provisions in our merchant agreements violate federal antitrust law and seek, on behalf of themselves and a class of merchants, an injunction prohibiting us from enforcing our anti-steering and non-discrimination provisions and a declaration that we have violated antitrust laws. The court rejected our motion to compel the case to arbitration; we have appealed the decision to the Court of Appeals for the First Circuit.\nOn January 29, 2019, we were named in a putative class action brought in the United States District Court for the Eastern District of New York, captioned \nDavid Moskowitz, et al. (formerly Oliver) v. American Express Company and American Express Travel Related Services Company Inc.\n, in which the plaintiffs are holders of MasterCard, Visa and/or Discover credit and/or debit cards (but not American Express cards) and allege they paid higher prices as a result of the anti-steering and non-discrimination provisions in our merchant agreements in violation of federal antitrust law and the antitrust and consumer laws of various states. Plaintiffs seek unspecified damages and other forms of relief. The court dismissed plaintiffs’ federal antitrust claim, numerous state antitrust and consumer protection claims and their unjust enrichment claim. For the remaining state antitrust or consumer protection claims, the court certified classes for (i) holders of Visa and MasterCard debit cards in \neight\n states and Washington, D.C.; and (ii) holders of Visa, MasterCard and Discover credit cards that do not offer rewards or charge an annual fee in \ntwo\n states and Washington, D.C. After trial in August 2025, the jury returned a verdict finding in favor of us on all claims except an Illinois consumer law claim for the class of non-rewards credit card holders in Illinois for which the jury awarded $\n12.5\n million in damages. The process for post-trial motions and appeals is ongoing.\nOn March 8, 2016, plaintiffs B&R Supermarket, Inc. d/b/a Milam’s Market and Grove Liquors LLC, on behalf of themselves and others, filed a suit, captioned \nB&R Supermarket, Inc. d/b/a Milam’s Market, et al. v. Visa Inc., et al.\n, for violations of the Sherman Antitrust Act, the Clayton Antitrust Act, California’s Cartwright Act and unjust enrichment in the United States District Court for the Northern District of California, against American Express Company, other credit and charge card networks, other issuing banks and EMVCo, LLC. Plaintiffs allege that the defendants, through EMVCo, conspired to shift liability for fraudulent, faulty and otherwise rejected consumer credit card transactions from themselves to merchants after the implementation of EMV chip payment terminals. Plaintiffs seek damages and injunctive relief. On May 4, 2017, the California court transferred the case to the United States District Court for the Eastern District of New York. On August 28, 2020, the court granted plaintiffs’ motion for class certification. On August 14, 2024, the court granted our motion to compel arbitration as to class members who are subject to our merchant agreements, but did not stay the claims pending arbitration. On November 15, 2024, we appealed to the Court of Appeals for the Second Circuit requesting a stay of all claims against us that are subject to arbitration. On March 31, 2025, we reached an agreement in principle with the class representatives to settle this action, which is subject to negotiation of a complete stipulation of settlement and court approval.\n60\nTable of Contents\nAMERICAN EXPRESS COMPANY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n(Unaudited)\nIn 2006, Mawarid Investments Limited filed a request for confidential arbitration under the 1998 London Court of International Arbitration Rules in connection with certain claims arising under a shareholders agreement between Mawarid and American Express Travel Related Services Company, Inc. relating to a joint venture between the parties, Amex (Middle East) BSC(c) (AEME). In 2008, the tribunal rendered a partial award, including a direction that an audit should take place to verify whether acquirer discount revenue related to transactions occurring with airlines located in the Middle East region had been properly allocated to AEME since its inception in 1992. In September 2021, the tribunal rendered a further partial award regarding the location of transactions through non-physical channels. In May 2022, the tribunal further clarified the 2021 partial award and the discount rate that should apply to transactions through non-physical channels. In December 2024, the tribunal rendered a further partial award providing further clarifications on the allocation of revenue. A final award is expected in 2025.\nWe are being challenged in a number of countries regarding our application of value-added taxes (VAT) to certain of our international transactions, which are in various stages of audit, or are being contested in legal actions. While we believe we have complied with all applicable tax laws, rules and regulations in the relevant jurisdictions, the tax authorities may determine that we owe additional VAT. In certain jurisdictions where we are contesting the assessments, we were required to pay the VAT assessments prior to contesting.\nOur legal proceedings range from cases brought by a single plaintiff to class actions with millions of putative class members to governmental proceedings. These legal proceedings involve various lines of business and a variety of claims (including, but not limited to, common law tort, contract, application of tax laws, antitrust and consumer protection claims), some of which present novel factual allegations and/or unique legal theories. While some matters pending against us specify the damages sought, many seek an unspecified amount of damages or are at very early stages of the legal process. Even when the amount of damages claimed against us are stated, the claimed amount may be exaggerated and/or unsupported. As a result, some matters have not yet progressed sufficiently through discovery and/or development of important factual information and legal issues to enable us to estimate an amount of loss or a range of possible loss, while other matters have progressed sufficiently such that we are able to estimate an amount of loss or a range of possible loss.\nWe have accrued for certain of our outstanding legal proceedings. An accrual is recorded when it is both (a) probable that a loss has occurred and (b) the amount of loss can be reasonably estimated. There may be instances in which an exposure to loss exceeds the accrual. We evaluate, on a quarterly basis, developments in legal proceedings that could cause an increase or decrease in the amount of the accrual that has been previously recorded, or a revision to the disclosed estimated range of possible losses, as applicable.\nFor those disclosed legal proceedings where a loss is reasonably possible in future periods, whether in excess of a recorded accrual for legal or tax contingencies, or where there is no such accrual, and for which we are able to estimate a range of possible loss, the current estimated range is \nzero\n to $\n300\n million in excess of any accruals related to those matters. This range represents management’s estimate based on currently available information and does not represent our maximum loss exposure; actual results may vary significantly. As such legal proceedings evolve, we may need to increase our range of possible loss or recorded accruals. In addition, it is possible that significantly increased merchant steering or other actions impairing the Card Member experience as a result of an adverse resolution in one or any combination of the disclosed merchant cases could have a material adverse effect on our business and results of operations.\n61\nTable of Contents\nAMERICAN EXPRESS COMPANY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n(Unaudited)\n8.  \nDerivatives and Hedging Activities\nWe use derivative financial instruments to manage exposures to various market risks. These instruments derive their value from an underlying variable or multiple variables, including interest rates and foreign exchange rates, and are carried at fair value on the Consolidated Balance Sheets. These instruments enable end users to increase, reduce or alter exposure to various market risks and, for that reason, are an integral component of our market risk management. We do not transact in derivatives for trading purposes.\nA majority of our derivative assets and liabilities as of September 30, 2025 and December 31, 2024 are subject to master netting agreements with our derivative counterparties. Accordingly, where appropriate, we have elected to present derivative assets and liabilities with the same counterparty on a net basis in the Consolidated Balance Sheets.\nIn relation to our credit risk, certain of our bilateral derivative agreements include provisions that allow our counterparties to terminate the relevant agreement in the event of a downgrade of our debt credit rating below investment grade and settle the outstanding net liability position. As of September 30, 2025, these derivatives were not in a material net liability position. Based on our assessment of the credit risk of our derivative counterparties and our own credit risk as of September 30, 2025 and December 31, 2024, \nno\n credit risk adjustment to the derivative portfolio was required.\nThe following table summarizes the total fair value, excluding interest accruals, of derivative assets and liabilities as of September 30, 2025 and December 31, 2024:\nTable 8.1: Fair Value of Derivative Assets and Liabilities\nOther Assets Fair Value\nOther Liabilities Fair Value\n(Millions)\n2025\n2024\n2025\n2024\nDerivatives designated as hedging instruments:\nFair value hedges - Interest rate contracts \n(a)\n$\n—\n \n$\n—\n \n$\n8\n \n$\n23\n \nNet investment hedges - Foreign exchange contracts\n48\n \n340\n \n764\n \n18\n \nTotal derivatives designated as hedging instruments\n48\n \n340\n \n772\n \n41\n \nDerivatives not designated as hedging instruments:\nForeign exchange contracts and other\n279\n \n666\n \n220\n \n90\n \nTotal derivatives, gross\n328\n \n1,006\n \n992\n \n131\n \nDerivative asset and derivative liability netting \n(b)\n(\n151\n)\n(\n91\n)\n(\n151\n)\n(\n91\n)\nCash collateral netting \n(c)\n—\n \n(\n18\n)\n(\n14\n)\n(\n23\n)\nTotal derivatives, net\n$\n177\n \n$\n897\n \n$\n827\n \n$\n17\n \n(a)\nFor our centrally cleared derivatives, variation margin payments are legally characterized as settlement payments as opposed to collateral.\n(b)\nRepresents the amount of netting of derivative assets and derivative liabilities executed with the same counterparty under an enforceable master netting arrangement.\n(c)\nRepresents the offsetting of the fair value of bilateral interest rate contracts and certain foreign exchange contracts with the right to cash collateral held from the counterparty or cash collateral posted with the counterparty.\nWe posted $\n721\n million and $\n368\n million as of September 30, 2025 and December 31, 2024, respectively, as initial margin on our centrally cleared interest rate swaps; such amounts are recorded within Other assets on the Consolidated Balance Sheets and are not netted against the derivative balances.\n62\nTable of Contents\nAMERICAN EXPRESS COMPANY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n(Unaudited)\nFair Value Hedges\nWe are exposed to interest rate risk associated with our fixed-rate debt obligations. At the time of issuance, certain fixed-rate long-term debt obligations are designated in fair value hedging relationships, using interest rate swaps, to economically convert the fixed interest rate to a floating interest rate. We had $\n35.9\n billion and $\n18.9\n billion of fixed-rate debt obligations designated in fair value hedging relationships as of September 30, 2025 and December 31, 2024, respectively.\nThe following table presents the gains and losses recognized in Interest expense on the Consolidated Statements of Income associated with the fair value hedges of our fixed-rate long-term debt for the three and nine months ended September 30:\nTable 8.2: Gains and Losses associated with Fair Value Hedges on Fixed-rate Long Term Debt\nGains (losses)\nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n(Millions)\n2025\n2024\n2025\n2024\nFixed-rate long-term debt \n$\n(\n89\n)\n$\n(\n554\n)\n$\n(\n488\n)\n$\n(\n481\n)\nDerivatives designated as hedging instruments\n89\n \n550\n \n489\n \n476\n \nTotal\n$\n1\n \n$\n(\n4\n)\n$\n1\n \n$\n(\n5\n)\nThe carrying values of the hedged liabilities, recorded within Long-term debt on the Consolidated Balance Sheets, were $\n36.3\n billion and $\n18.9\n billion as of September 30, 2025 and December 31, 2024, respectively, including the cumulative amount of fair value hedging adjustments of $\n516\n million and $\n27\n million for the respective periods.\nWe recognized in Interest expense on Long-term debt net increases of $\n47\n million and $\n82\n million for the three months ended September 30, 2025 and 2024, respectively, and net increases of $\n88\n million and $\n214\n million for the nine months ended September 30, 2025 and 2024, respectively, primarily related to the net settlements including interest accruals on our interest rate derivatives designated as fair value hedges.\nNet Investment Hedges\nA net investment hedge is used to hedge future changes in currency exposure of a net investment in a foreign operation. \nWe primarily designate foreign currency derivatives (typically foreign exchange forwards) and, in certain cases, we also designate foreign currency-denominated debt, as hedging instruments to reduce our exposure to changes in currency exchange rates on net investments in foreign subsidiaries with non-U.S. dollar functional currency.\n \nWe had notional amounts of approximately $\n15.8\n billion and $\n14.3\n billion designated as net investment hedges as of September 30, 2025 and December 31, 2024, respectively. The gain or loss on these net investment hedges, net of taxes, recorded in Accumulated other comprehensive income (loss) (AOCI) as part of the cumulative translation adjustment, was a loss of $\n69\n million and a loss of $\n96\n million for the three months ended September 30, 2025 and 2024, respectively, and a loss of $\n818\n million and a gain of $\n187\n million for the nine months ended September 30, 2025 and 2024, respectively. Net investment hedge reclassifications out of AOCI into the Consolidated Statements of Income were \nno\nt significant for any of the three and the nine months ended September 30, 2025 and 2024.\nDerivatives Not Designated as Hedges\nThe changes in the fair value of derivatives that are not designated as hedges are primarily intended to offset the related foreign exchange gains or losses of the underlying foreign currency exposures.\n We had notional amounts of approximately $\n35.8\n billion and $\n28.8\n billion as of September 30, 2025 and December 31, 2024, respectively. The changes in the fair value of the derivatives and the related underlying foreign currency exposures resulted in net gains of $\n47\n million and $\n24\n million for the three months ended September 30, 2025 and 2024, respectively, and net gains of $\n66\n million and $\n67\n million for the nine months ended September 30, 2025 and 2024, respectively, that are recognized in Other, net expenses in the Consolidated Statements of Income.\nOur embedded derivative related to seller earnout shares granted to us upon the completion of a business combination in the second quarter of 2022 between our equity method investee, American Express Global Business Travel, and Apollo Strategic Growth Capital had a notional amount of $\n78\n million as of both September 30, 2025 and December 31, 2024. The changes in the fair value of the embedded derivative resulted in a gain of $\n8\n million and a gain of $\n5\n million for the three months ended September 30, 2025 and 2024, respectively, and a loss of $\n16\n million and a gain of $\n4\n million for the nine months ended September 30, 2025 and 2024, respectively, which were recognized in Service fees and other revenue in the Consolidated Statements of Income.\n63\nTable of Contents\nAMERICAN EXPRESS COMPANY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n(Unaudited)\n9.  \nFair Values\nFinancial Assets and Financial Liabilities Carried at Fair Value\nThe following table summarizes our financial assets and financial liabilities measured at fair value on a recurring basis, categorized by GAAP’s fair value hierarchy, as of September 30, 2025 and December 31, 2024:\nTable 9.1: Financial Assets and Financial Liabilities measured at Fair Value\n2025\n2024\n(Millions)\nTotal\nLevel 1\nLevel 2\nLevel 3\nTotal\nLevel 1\nLevel 2\nLevel 3\nAssets:\nInvestment securities: \n(a)\nEquity securities\n$\n46\n \n$\n46\n \n$\n—\n \n$\n—\n \n$\n48\n \n$\n48\n \n$\n—\n \n$\n—\n \nDebt securities\n1,329\n \n—\n \n1,248\n \n81\n \n1,192\n \n—\n \n1,115\n \n77\n \nDerivatives, gross \n(a)(b)\n328\n \n—\n \n313\n \n15\n \n1,006\n \n—\n \n975\n \n31\n \nTotal Assets\n1,702\n \n46\n \n1,560\n \n96\n \n2,246\n \n48\n \n2,090\n \n108\n \nLiabilities:\nDerivatives, gross \n(a)\n992\n \n—\n \n992\n \n—\n \n131\n \n—\n \n131\n \n—\n \nTotal Liabilities\n$\n992\n \n$\n—\n \n$\n992\n \n$\n—\n \n$\n131\n \n$\n—\n \n$\n131\n \n$\n—\n \n(a)\nRefer to Note 4 for the fair values of investment securities and to Note 8 for the fair values of derivative assets and liabilities on a further disaggregated basis.\n(b)\nLevel 3 fair value reflects an embedded derivative. Management reviews and applies judgment to the valuation of the embedded derivative that is performed by an independent third party using a Monte Carlo simulation that models a range of probable future stock prices based on implied volatility in a risk neutral framework. Refer to Note 8 for additional information about this embedded derivative.\n \n64\nTable of Contents\nAMERICAN EXPRESS COMPANY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n(Unaudited)\nFinancial Assets and Financial Liabilities Carried at Other Than Fair Value\nThe following tables summarize the estimated fair values of our financial assets and financial liabilities that are measured at amortized cost, and not required to be carried at fair value on a recurring basis, as of September 30, 2025 and December 31, 2024. The fair values of these financial instruments are estimates based upon the market conditions and perceived risks as of September 30, 2025 and December 31, 2024, and require management’s judgment. These figures may not be indicative of future fair values, nor can the fair value of American Express be estimated by aggregating the amounts presented.\nTable 9.2: Fair Value of Financial Assets and Financial Liabilities measured at Amortized Cost\nCarrying\nValue\nCorresponding Fair Value Amount\n2025 (Billions)\nTotal\nLevel 1\nLevel 2\nLevel 3\nFinancial Assets:\nFinancial assets for which carrying values equal or approximate fair value\nCash and cash equivalents \n(a)\n$\n55\n \n$\n55\n \n$\n52\n \n$\n2\n \n$\n—\n \nOther financial assets \n(b)\n65\n \n65\n \n—\n \n65\n \n—\n \nFinancial assets carried at other than fair value\nCard Member and Other loans, less reserves \n(c)\n149\n \n155\n \n—\n \n—\n \n155\n \nCard Member loans HFS\n2\n \n2\n \n—\n \n—\n \n2\n \nFinancial Liabilities:\nFinancial liabilities for which carrying values equal or approximate fair value\n163\n \n163\n \n—\n \n163\n \n—\n \nFinancial liabilities carried at other than fair value\nCertificates of deposit \n(d)\n17\n \n17\n \n—\n \n17\n \n—\n \nLong-term debt \n(c)\n$\n58\n \n$\n59\n \n$\n—\n \n$\n59\n \n$\n—\n \nCarrying\nValue\nCorresponding Fair Value Amount\n2024 (Billions)\nTotal\nLevel 1\nLevel 2\nLevel 3\nFinancial Assets:\nFinancial assets for which carrying values equal or approximate fair value\nCash and cash equivalents \n(a)\n$\n41\n \n$\n41\n \n$\n39\n \n$\n2\n \n$\n—\n \nOther financial assets \n(b)\n63\n \n63\n \n—\n \n63\n \n—\n \nFinancial assets carried at other than fair value\nCard Member and Other loans, less reserves \n(c)\n143\n \n149\n \n—\n \n—\n \n149\n \nCard Member loans HFS\n1\n \n1\n \n—\n \n—\n \n1\n \nFinancial Liabilities:\nFinancial liabilities for which carrying values equal or approximate fair value\n155\n \n155\n \n—\n \n155\n \n—\n \nFinancial liabilities carried at other than fair value\nCertificates of deposit \n(d)\n12\n \n12\n \n—\n \n12\n \n—\n \nLong-term debt \n(c)\n$\n50\n \n$\n50\n \n$\n—\n \n$\n50\n \n$\n—\n \n(a)\nLevel 2 fair value amounts reflect time deposits and short-term investments.\n(b)\nBalances include Card Member receivables (including fair values of Card Member receivables of $\n6.7\n billion and $\n3.9\n billion held by a consolidated VIE as of September 30, 2025 and December 31, 2024, respectively), other receivables and other miscellaneous assets.\n(c)\nBalances include amounts held by a consolidated VIE for which the fair values of Card Member loans were $\n26.5\n billion and $\n28.3\n billion as of September 30, 2025 and December 31, 2024, respectively, and the fair values of Long-term debt were $\n14.3\n billion and $\n14.0\n billion\n \nas of September 30, 2025 and December 31, 2024, respectively.\n(d)\nPresented as a component of Customer deposits on the Consolidated Balance Sheets.\n65\nTable of Contents\nAMERICAN EXPRESS COMPANY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n(Unaudited)\nNonrecurring Fair Value Measurements\nWe have certain assets that are subject to measurement at fair value on a nonrecurring basis. Equity investments without readily determinable fair values, which include investments in our Amex Ventures portfolio, are measured at fair value in periods subsequent to their initial recognition if they are determined to be impaired or where there is an observable price change for an identical or similar investment of the same issuer.\nWe generally estimate the fair value of these investments based on the observed transaction price. In addition, impairments on such investments are recorded to account for the difference between the estimated fair value and carrying value of an investment based on a qualitative assessment of impairment indicators such as business performance, general market conditions and the economic and regulatory environment. When an impairment triggering event occurs, the fair value measurement is generally derived by taking into account all available information, such as share prices of publicly traded peer companies, internal valuations performed by our investees, and other third-party fair value data. The fair value of these investments represents a Level 3 fair value measurement.\nThe carrying value of equity investments without readily determinable fair values totaled $\n1.0\n billion and $\n0.9\n billion as of September 30, 2025 and December 31, 2024, respectively, of which investments subject to nonrecurring Level 3 fair value measurement during the nine months ended September 30, 2025 and the year ended December 31, 2024 totaled $\n0.4\n billion and $\n1\n million, respectively. These amounts are included within Other assets on the Consolidated Balance Sheets.\nWe recorded unrealized gains of $\n0.3\n million and $\n1.0\n million for the three months ended September 30, 2025 and 2024, respectively, and $\n91\n million and $\n68\n million for the nine months ended September 30, 2025 and 2024, respectively. Unrealized losses were $\n2\n million and $\n20\n million for the three months ended September 30, 2025 and 2024, respectively, and $\n40\n million and $\n31\n million for the nine months ended September 30, 2025 and 2024, respectively. Unrealized gains and losses are recorded in Other, net on the Consolidated Statements of Income. Since the adoption of new accounting guidance on the recognition and measurement of financial assets and financial liabilities on January 1, 2018, cumulative unrealized gains and losses for equity investments without readily determinable fair values totaled $\n1.1\n billion and $\n0.5\n billion as of September 30, 2025, respectively.\nIn addition, we also have certain equity investments measured at fair value using the net asset value practical expedient. Such investments were immaterial as of both September 30, 2025 and December 31, 2024.\n66\nTable of Contents\nAMERICAN EXPRESS COMPANY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n(Unaudited)\n10.  \nGuarantees\nThe maximum potential undiscounted future payments and related liability resulting from guarantees and indemnifications provided by us in the ordinary course of business were $\n1\n billion and $\n12\n million, respectively, as of September 30, 2025 and $\n1\n billion and $\n10\n million, respectively, as of December 31, 2024, all of which were primarily related to our real estate arrangements and business dispositions.\nTo date, we have not experienced any significant losses related to guarantees or indemnifications. \nOur recognition of these instruments is at fair value. In addition, we establish reserves when a loss is probable and the amount can be reasonably estimated.\n67\nTable of Contents\nAMERICAN EXPRESS COMPANY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n(Unaudited)\n11.  \nChanges In Accumulated Other Comprehensive Income (Loss)\nAOCI is comprised of items that have not been recognized in earnings but may be recognized in earnings in the future when certain events occur. \nChanges in each component for the three and nine months ended September 30, 2025 and 2024 were as follows:\nTable 11.1: Changes in Accumulated Other Comprehensive Income (Loss)\n(Millions)\n, net of tax\nThree Months Ended,\nSeptember 30, 2025\nNet Change\nJune 30, 2025\nSeptember 30, 2024\nNet Change\nJune 30, 2024\nNet Unrealized Gains (Losses) on Debt Securities\n$\n(\n5\n)\n$\n1\n \n$\n(\n6\n)\n$\n(\n6\n)\n$\n4\n \n$\n(\n10\n)\nForeign Currency Translation Adjustment Gains (Losses), net of hedges \n(a)\n(\n2,798\n)\n(\n6\n)\n(\n2,792\n)\n(\n2,706\n)\n1\n \n(\n2,707\n)\nNet Unrealized Pension and Other Postretirement Benefit Gains (Losses)\n(\n446\n)\n4\n \n(\n450\n)\n(\n483\n)\n—\n \n(\n483\n)\nAccumulated Other Comprehensive Income (Loss)\n$\n(\n3,249\n)\n$\n(\n1\n)\n$\n(\n3,248\n)\n$\n(\n3,195\n)\n$\n5\n \n$\n(\n3,200\n)\n(Millions)\n, net of tax\nNine Months Ended\nSeptember 30, 2025\nNet Change\nDecember 31, 2024\nSeptember 30, 2024\nNet Change\nDecember 31, 2023\nNet Unrealized Gains (Losses) on Debt Securities\n$\n(\n5\n)\n$\n4\n \n$\n(\n9\n)\n$\n(\n6\n)\n$\n8\n \n$\n(\n14\n)\nForeign Currency Translation Adjustment Gains (Losses), net of hedges \n(a)\n(\n2,798\n)\n126\n \n(\n2,924\n)\n(\n2,706\n)\n(\n135\n)\n(\n2,571\n)\nNet Unrealized Pension and Other Postretirement Benefit Gains (Losses)\n(\n446\n)\n16\n \n(\n462\n)\n(\n483\n)\n4\n \n(\n487\n)\nAccumulated Other Comprehensive Income (Loss)\n$\n(\n3,249\n)\n$\n146\n \n$\n(\n3,395\n)\n$\n(\n3,195\n)\n$\n(\n123\n)\n$\n(\n3,072\n)\n(a)\nRefer to Note 8 for additional information on hedging activity.\nThe following table shows the tax impact for the three and nine months ended September 30 for the changes in each component of AOCI presented above:\nTable 11.2: Tax Impact for Changes in Accumulated Other Comprehensive Income (Loss)\nTax expense (benefit)\nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n(Millions)\n2025\n2024\n2025\n2024\nNet unrealized gains on debt securities\n$\n—\n \n$\n—\n \n$\n1\n \n$\n2\n \nForeign currency translation adjustment, net of hedges\n(\n11\n)\n(\n26\n)\n(\n208\n)\n30\n \nPension and other postretirement benefits\n3\n \n(\n7\n)\n(\n4\n)\n(\n5\n)\nTotal tax impact\n$\n(\n8\n)\n$\n(\n33\n)\n$\n(\n212\n)\n$\n27\n \nReclassifications out of AOCI into the Consolidated Statements of Income, net of taxes, for the three and nine months ended September 30, 2025 and 2024 were \nno\nt significant.\n68\nTable of Contents\nAMERICAN EXPRESS COMPANY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n(Unaudited)\n12.  \nService Fees and Other Revenue and Other Expenses\nThe following is a detail of Service fees and other revenue for the three and nine months ended September 30:\nTable 12.1: Components of Service Fees and Other Revenue\nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n(Millions)\n2025\n2024\n2025\n2024\nNetwork partnership revenue \n(a)\n$\n456\n \n$\n413\n \n$\n1,302\n \n$\n1,207\n \nForeign currency-related revenue\n447\n \n401\n \n1,264\n \n1,140\n \nLoyalty coalition, merchant and other service fees\n (b)\n407\n \n370\n \n1,251\n \n1,197\n \nDelinquency fees\n245\n \n236\n \n720\n \n705\n \nTravel commissions and fees\n167\n \n157\n \n450\n \n481\n \nOther fees and revenues\n254\n \n103\n \n539\n \n316\n \nTotal Service fees and other revenue \n(a)\n$\n1,976\n \n$\n1,680\n \n$\n5,526\n \n$\n5,046\n \n(a)\nEffective for the first quarter of 2025, Network partnership revenue, previously reported as Processed revenue on our Consolidated Statements of Income, is consolidated within Service fees and other revenue. Prior period amounts have been recast to conform to the current period presentation.\n(b)\nEffective for the first quarter of 2025, the revenue line previously reported as Service fees was renamed to Loyalty coalition, merchant and other service fees to better reflect its nature and components.\nThe following is a detail of Other expenses for the three and nine months ended September 30:\nTable 12.2: Components of Other Expense\nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n(Millions)\n2025\n2024\n2025\n2024\nData processing and equipment\n$\n751\n \n$\n725\n \n$\n2,176\n \n$\n2,083\n \nProfessional services\n623\n \n579\n \n1,755\n \n1,576\n \nGain on sale of Accertify \n(a)\n—\n \n—\n \n—\n \n(\n531\n)\nOther\n406\n \n476\n \n1,181\n \n1,166\n \nTotal Other expenses\n$\n1,780\n \n$\n1,780\n \n$\n5,112\n \n$\n4,294\n \n(a)\n Refer to Note 1 for additional information.\n69\nTable of Contents\nAMERICAN EXPRESS COMPANY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n(Unaudited)\n13.  \nIncome Taxes\nThe effective tax rate was \n24.1\n percent and \n21.8\n percent for the three months ended September 30, 2025 and 2024, respectively and \n21.8\n percent and \n21.5\n percent for the nine months ended September 30, 2025 and 2024, respectively. The higher effective tax rate for the three and nine month periods primarily reflected implementation of the global minimum tax and a California tax law change that increased the proportion of income taxable in that state, largely offset for the nine month period by increased discrete tax benefits.\nWe are under continuous examination by the Internal Revenue Service (IRS) and tax authorities in other countries and states in which we have significant business operations. The tax years under examination and open for examination vary by jurisdiction. We are currently under examination by the IRS for the 2017 and 2018 tax years.\nIn 2024, we received a Notice of Proposed Adjustment (Notice) from the IRS regarding transfer pricing between our U.S. and foreign subsidiaries for the 2017 and 2018 tax years currently under examination. The Notice proposes an increase to our U.S. taxable income that would result in an additional estimated U.S. federal income tax payment of approximately $\n185\n million for 2017 and 2018, excluding interest and state income taxes, and asserts penalties of approximately $\n50\n million for the same period. Although the Notice only applies to the 2017 and 2018 tax years currently under examination, the IRS may seek similar adjustments for subsequent tax years.\nWe strongly disagree with the IRS’s positions and plan to pursue all available remedies to vigorously contest the adjustments made by the IRS. We believe our income tax reserves are appropriate for all open tax years and that final resolution of this matter will not have a material impact on our results of operations. However, the ultimate outcome of this matter is uncertain, and if we are required to pay the IRS additional U.S. taxes, interest and/or potential penalties, our results of operations could be materially affected for the period in which the matter is resolved.\nWe believe it is reasonably possible that our unrecognized tax benefits could decrease within the next twelve months by as much as $\n129\n million, principally as a result of potential resolutions of prior years’ tax items with various taxing authorities. The prior years’ tax items include unrecognized tax benefits relating to the deductibility of certain expenses or losses and the attribution of taxable income to a particular jurisdiction or jurisdictions. Of the $\n129\n million of unrecognized tax benefits, approximately $\n102\n million relates to amounts that, if recognized, would impact the effective tax rate in a future period.\nTax Credit Investments\nAs of September 30, 2025 and 2024, we had $\n1,719\n million and $\n1,558\n million in tax credit investments, respectively, included in Other assets on the Consolidated Balance Sheets, comprised of Low Income Housing Tax Credit investments and other qualifying investments. We account for such tax credit investments using the Proportional Amortization Method.\nThe following table presents tax credit investment expenses and associated income tax credits and other income tax benefits for the three and nine months ended September 30:\nTable 13.1: Tax Credit Investments Expenses and Credits\nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n(Millions)\n2025\n2024\n2025\n2024\nProportional amortization recognized in tax provision\n$\n60\n \n$\n48\n \n$\n175\n \n$\n143\n \nIncome tax credits and Other income tax benefits \n(a) \nrecognized in tax provision\n65\n \n51\n \n204\n \n164\n \n(a)\nOther income tax benefits are a result of tax deductible expenses generated by our tax credit investments\nIncome tax credits and other income tax benefits associated with our tax credit investments are also recognized in the Consolidated Statements of Cash Flows in the Operating activities section primarily under Accounts payable and other liabilities. Refer to Note 6 to our “Consolidated Financial Statements” in the 2024 Form 10-K for additional information on our tax credit investments for the year ended December 31, 2024.\n70\nTable of Contents\nAMERICAN EXPRESS COMPANY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n(Unaudited)\n14.  \nEarnings Per Common Share (EPS)\nThe computations of basic and diluted EPS for the three and nine months ended September 30 were as follows:\nTable 14.1: Computation of Basic and Diluted Earnings per Share\nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n(Millions, except per share amounts)\n2025\n2024\n2025\n2024\nNumerator:\nBasic and diluted:\nNet income\n$\n2,902\n \n$\n2,507\n \n$\n8,371\n \n$\n7,959\n \nPreferred dividends \n(\n14\n)\n(\n15\n)\n(\n43\n)\n(\n44\n)\nNet income available to common shareholders\n$\n2,888\n \n$\n2,492\n \n$\n8,328\n \n$\n7,915\n \nEarnings allocated to participating share awards \n(a)\n(\n20\n)\n(\n18\n)\n(\n56\n)\n(\n59\n)\nNet income attributable to common shareholders\n$\n2,868\n \n$\n2,474\n \n$\n8,272\n \n$\n7,856\n \nDenominator:\n(a)\nBasic: Weighted-average common stock\n692\n \n708\n \n697\n \n715\n \nAdd: Weighted-average stock options \n(b)\n1\n \n1\n \n1\n \n1\n \nDiluted\n693\n \n709\n \n698\n \n716\n \nBasic EPS\n$\n4.14\n \n$\n3.50\n \n$\n11.87\n \n$\n10.99\n \nDiluted EPS\n$\n4.14\n \n$\n3.49\n \n$\n11.85\n \n$\n10.97\n \n(a)\nOur unvested restricted stock awards, which include the right to receive non-forfeitable dividends or dividend equivalents, are considered participating securities. Calculations of EPS under the two-class method exclude from the numerator any dividends paid or owed on participating securities and any undistributed earnings considered to be attributable to participating securities. The related participating securities are similarly excluded from the denominator.\n(b)\nThe dilutive effect of unexercised stock options excludes from the computation of EPS \n0.1\n million of options for both the three months ended September 30, 2025 and 2024, and \n0.2\n million and \n0.1\n million of options for the nine months ended September 30, 2025 and 2024, respectively, because inclusion of the options would have been anti-dilutive.\n71\nTable of Contents\nAMERICAN EXPRESS COMPANY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n(Unaudited)\n15.  \nReportable Operating Segments\nThe following tables present certain selected financial information for our reportable operating segments and Corporate & Other as of or for the three and nine months ended September 30:\nTable 15.1: Selected Financial Information by Segment\nThree Months Ended September 30, 2025\n(Millions)\nUSCS\nCS\nICS\nGMNS\nCorporate & Other \n(a)\nConsolidated\nTotal non-interest revenues\n$\n5,620\n \n$\n3,441\n \n$\n3,034\n \n$\n1,782\n \n$\n63\n \n$\n13,940\n \nRevenue from contracts with customers \n(b)\n3,925\n \n2,986\n \n1,928\n \n1,586\n \n(\n10\n)\n10,415\n \nInterest income\n4,025\n \n1,302\n \n652\n \n9\n \n629\n \n6,617\n \nInterest expense\n789\n \n462\n \n350\n \n(\n181\n)\n711\n \n2,131\n \nNet interest income\n3,236\n \n840\n \n302\n \n190\n \n(\n82\n)\n4,486\n \nTotal revenues net of interest expense\n8,856\n \n4,281\n \n3,336\n \n1,972\n \n(\n19\n)\n18,426\n \nProvisions for credit losses\n734\n \n332\n \n218\n \n5\n \n(\n2\n)\n1,287\n \nTotal revenues net of interest expense after provisions for credit losses\n8,122\n \n3,949\n \n3,118\n \n1,967\n \n(\n17\n)\n17,139\n \nExpenses\nCard Member rewards, business development and Card Member services \n(c)\n4,145\n \n1,730\n \n1,512\n \n298\n \n11\n \n7,696\n \nMarketing\n825\n \n313\n \n350\n \n105\n \n6\n \n1,599\n \nSalaries and employee benefits and other operating expenses\n1,300\n \n816\n \n815\n \n524\n \n564\n \n4,019\n \nTotal expenses\n6,270\n \n2,859\n \n2,677\n \n927\n \n581\n \n13,314\n \nPretax income (loss)\n$\n1,852\n \n$\n1,090\n \n$\n441\n \n$\n1,040\n \n$\n(\n598\n)\n$\n3,825\n \nTotal assets\n$\n115,330\n \n$\n64,305\n \n$\n47,253\n \n$\n18,879\n \n$\n51,783\n \n$\n297,550\n \nNine Months Ended September 30, 2025\n(Millions)\nUSCS\nCS\nICS\nGMNS\nCorporate & Other \n(a)\nConsolidated\nTotal non-interest revenues\n$\n16,403\n \n$\n10,128\n \n$\n8,627\n \n$\n5,200\n \n$\n49\n \n$\n40,407\n \nRevenue from contracts with customers \n(b)\n11,462\n \n8,789\n \n5,492\n \n4,645\n \n(\n26\n)\n30,362\n \nInterest income\n11,583\n \n3,744\n \n1,868\n \n31\n \n1,790\n \n19,016\n \nInterest expense\n2,328\n \n1,344\n \n991\n \n(\n489\n)\n2,000\n \n6,174\n \nNet interest income\n9,255\n \n2,400\n \n877\n \n520\n \n(\n210\n)\n12,842\n \nTotal revenues net of interest expense\n25,658\n \n12,528\n \n9,504\n \n5,720\n \n(\n161\n)\n53,249\n \nProvisions for credit losses\n2,194\n \n1,021\n \n620\n \n8\n \n(\n1\n)\n3,842\n \nTotal revenues net of interest expense after provisions for credit losses\n23,464\n \n11,507\n \n8,884\n \n5,712\n \n(\n160\n)\n49,407\n \nExpenses\nCard Member rewards, business development and Card Member services \n(c)\n11,994\n \n5,266\n \n4,276\n \n869\n \n34\n \n22,439\n \nMarketing\n2,390\n \n981\n \n972\n \n277\n \n20\n \n4,640\n \nSalaries and employee benefits and other operating expenses\n3,820\n \n2,429\n \n2,349\n \n1,482\n \n1,543\n \n11,623\n \nTotal expenses\n18,204\n \n8,676\n \n7,597\n \n2,628\n \n1,597\n \n38,702\n \nPretax income (loss)\n$\n5,260\n \n$\n2,831\n \n$\n1,287\n \n$\n3,084\n \n$\n(\n1,757\n)\n$\n10,705\n \n72\nTable of Contents\nAMERICAN EXPRESS COMPANY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n(Unaudited)\nThree Months Ended September 30, 2024\n(Millions)\nUSCS\nCS\nICS\nGMNS\nCorporate & Other \n(a)\nConsolidated\nTotal non-interest revenues\n$\n5,028\n \n$\n3,304\n \n$\n2,659\n \n$\n1,667\n \n$\n(\n28\n)\n$\n12,630\n \nRevenue from contracts with customers \n(b)\n3,620\n \n2,886\n \n1,724\n \n1,493\n \n(\n7\n)\n9,716\n \nInterest income\n3,722\n \n1,142\n \n588\n \n11\n \n686\n \n6,149\n \nInterest expense\n806\n \n448\n \n311\n \n(\n169\n)\n747\n \n2,143\n \nNet interest income\n2,916\n \n694\n \n277\n \n180\n \n(\n61\n)\n4,006\n \nTotal revenues net of interest expense\n7,944\n \n3,998\n \n2,936\n \n1,847\n \n(\n89\n)\n16,636\n \nProvisions for credit losses\n812\n \n374\n \n158\n \n10\n \n2\n \n1,356\n \nTotal revenues net of interest expense after provisions for credit losses\n7,132\n \n3,624\n \n2,778\n \n1,837\n \n(\n91\n)\n15,280\n \nExpenses\nCard Member rewards, business development and Card Member services \n(c)\n3,570\n \n1,627\n \n1,296\n \n269\n \n15\n \n6,777\n \nMarketing\n755\n \n308\n \n287\n \n112\n \n8\n \n1,470\n \nSalaries and employee benefits and other operating expenses\n1,148\n \n781\n \n740\n \n465\n \n695\n \n3,829\n \nTotal expenses\n5,473\n \n2,716\n \n2,323\n \n846\n \n718\n \n12,076\n \nPretax income (loss)\n$\n1,659\n \n$\n908\n \n$\n455\n \n$\n991\n \n$\n(\n809\n)\n$\n3,204\n \nTotal assets\n$\n106,201\n \n$\n59,716\n \n$\n43,073\n \n$\n17,739\n \n$\n44,250\n \n$\n270,979\n \nNine Months Ended September 30, 2024\n(Millions)\nUSCS\nCS\nICS\nGMNS\nCorporate & Other \n(a)\nConsolidated\nTotal non-interest revenues\n$\n14,823\n \n$\n9,831\n \n$\n7,644\n \n$\n5,006\n \n$\n(\n39\n)\n$\n37,265\n \nRevenue from contracts with customers \n(b)\n10,785\n \n8,603\n \n4,983\n \n4,505\n \n(\n3\n)\n28,873\n \nInterest income\n10,677\n \n3,198\n \n1,748\n \n41\n \n2,054\n \n17,718\n \nInterest expense\n2,325\n \n1,292\n \n921\n \n(\n543\n)\n2,218\n \n6,213\n \nNet interest income\n8,352\n \n1,906\n \n827\n \n584\n \n(\n164\n)\n11,505\n \nTotal revenues net of interest expense\n23,175\n \n11,737\n \n8,471\n \n5,590\n \n(\n203\n)\n48,770\n \nProvisions for credit losses\n2,245\n \n1,078\n \n532\n \n36\n \n2\n \n3,893\n \nTotal revenues net of interest expense after provisions for credit losses\n20,930\n \n10,659\n \n7,939\n \n5,554\n \n(\n205\n)\n44,877\n \nExpenses\nCard Member rewards, business development and Card Member services \n(c)\n10,513\n \n4,753\n \n3,801\n \n826\n \n29\n \n19,922\n \nMarketing\n2,238\n \n959\n \n929\n \n281\n \n19\n \n4,426\n \nSalaries and employee benefits and other operating expenses\n3,347\n \n2,256\n \n2,212\n \n902\n \n1,673\n \n10,390\n \nTotal expenses\n16,098\n \n7,968\n \n6,942\n \n2,009\n \n1,721\n \n34,738\n \nPretax income (loss)\n$\n4,832\n \n$\n2,691\n \n$\n997\n \n$\n3,545\n \n$\n(\n1,926\n)\n$\n10,139\n \n(a)\nCorporate & Other includes adjustments and eliminations for intersegment activity.\n(b)\nIncludes discount revenue and certain service fees and other revenue from customers.\n(c)\nCard Member rewards, business development and Card Member services expenses are generally correlated to volumes or are variable based on usage.\n73\nTable of Contents"
}