{
  "source_file": "axp-20241231.htm",
  "form_type": "10-K",
  "item1": "ITEM 1.    BUSINESS\nOverview\nAmerican Express is a globally integrated payments company with card-issuing, merchant-acquiring and card network businesses that offer products and services to a broad range of customers, including consumers, small businesses, mid-sized companies and large corporations around the world.\nOur range of products and services includes:\n•\nCredit card, charge card, banking and other payment and financing products\n•\nMerchant acquisition and processing, servicing and settlement, fraud prevention, and point-of-sale marketing and information products and services\n•\nNetwork services\n•\nTravel and lifestyle services\n•\nExpense management products and services\n•\nOther services, such as the design and operation of customer loyalty programs\nThese products and services are offered through various channels, including mobile and online applications, affiliate marketing, customer referral programs, third-party service providers and business partners, in-house sales teams, direct mail, telephone and direct response advertising.\nWe were founded in 1850 as a joint stock association and were incorporated in 1965 as a New York corporation. American Express Company and its principal operating subsidiary, American Express Travel Related Services Company, Inc. (TRS), are bank holding companies under the Bank Holding Company Act of 1956, as amended (the BHC Act), subject to supervision and examination by The Board of Governors of the Federal Reserve System (the Federal Reserve). \nWe principally engage in businesses comprising four reportable operating segments: U.S. Consumer Services (USCS), Commercial Services (CS), International Card Services (ICS) and Global Merchant and Network Services (GMNS). Corporate functions and certain other businesses are included in Corporate & Other. Our businesses function together to form our end-to-end integrated payments platform, which we believe is a differentiator that underpins our business model. For further information about our reportable operating segments, see “Business Segment Results of Operations” under “MD&A.”\n1\nTable of Contents\nOur Integrated Payments Platform and Technology\nThrough our card-issuing, merchant-acquiring and card network businesses, we are able to connect participants and provide differentiated value across the commerce path. We maintain direct relationships with Card Members (as a card issuer) and merchants (as an acquirer), which provides us with access to information at both ends of the card transaction, distinguishing our integrated payments platform from the bankcard networks. Through contractual relationships, we also obtain information from third-party card issuers, merchant acquirers, aggregators and processors with whom we do business.\nOur integrated payments platform and the systems and infrastructure that underlie it provide us with data and analytics, while maintaining our commitment to respect Card Member preferences and protect Card Member and merchant data in compliance with applicable policies and legal requirements. Our models and analytical tools help us reduce fraud and underwrite risk, such as in determinations regarding the extension of credit. We also leverage our technology to provide differentiated value to customers, such as special offers and benefits to Card Members and targeted marketing and other information services for merchants and partners, as well as to develop and improve our service capabilities to continue to deliver a high-quality customer experience.\nCard Issuing Businesses\nWe are a leader in providing general purpose credit and charge cards to consumers, small businesses, mid-sized companies and large corporations. We offer a broad set of card products, rewards and services to this premium consumer and broad commercial customer base, in the United States and internationally, through our USCS, CS and ICS reportable operating segments. We focus on differentiating American Express Membership through premium products, lifestyle services for consumers and business-centric solutions for our commercial customers, and benefits for our Card Members that we co-create and co-fund with our business partners. We believe the many benefits that come with American Express Membership build a strong, emotional connection with our brand across generations and geographies.\nWe acquire and retain high-spending, engaged and creditworthy Card Members by:\n•\nDesigning innovative credit, charge and debit card products and payment and lending solutions that appeal to our target customer base and meet their spending and borrowing needs\n•\nUsing incentives to drive spending on our various card products and increase customer engagement, including our Membership Rewards\n®\n and Amex Offers\n™\n programs, cash-back reward features, statement credits for purchases with partners, interest rates offered on deposits and participation in loyalty programs sponsored by our cobrand and other partners\n•\nProviding digital and mobile services and an array of benefits and experiences across card products, such as lounge access, dining experiences and other travel and lifestyle benefits\n•\nCreating world-class service experiences by delivering exceptional customer care\n•\nDeveloping a wide range of partner relationships, including designing, cobranding and distributing certain of our cards and providing benefits and services to our Card Members\nWe have a number of products that complement our card products, such as our business checking and consumer rewards checking account products, expense management and business-to-business (B2B) payment products and other non-card payment and financing products. Our complementary products also include digital capabilities, such as our Business Blueprint digital cash flow management hub and our Resy\n®\n dining platform, which we are enhancing through our acquisitions in 2024 of Tock, a reservation, table and event management technology provider and Rooam, a technology company that powers systems used by restaurants and entertainment venues.\nWe are focused on enhancing the value propositions of our products to increase engagement with existing customers and attract new customers, including Millennial and Gen Z consumers as well as customers internationally. Jurisdictions that represent a significant portion of our billed business outside of the United States include the United Kingdom (UK), the European Union (EU), Australia, Japan, Canada and Mexico.\nFor the year ended December 31, 2024, worldwide billed business (spending on American Express cards issued by us) was $1,551 billion and as of December 31, 2024, we had 83.6 million proprietary cards-in-force worldwide.\n2\nTable of Contents\nMerchant Acquiring Business\nOur GMNS reportable operating segment builds and manages relationships with millions of merchants around the world that choose to accept American Express cards. This includes signing new merchants to accept our cards, agreeing on the discount rate (a fee charged to the merchant for accepting our cards) and handling servicing for merchants. We also build and maintain relationships with merchant acquirers, aggregators and processors to manage aspects of our merchant services business. For example, through our OptBlue\n®\n merchant-acquiring program, third-party processors contract directly with small merchants for card acceptance on our network and determine merchant pricing. We continue to grow merchant acceptance of American Express cards around the world and work with merchant partners so that our Card Members are warmly welcomed and encouraged to spend in the millions of places where their American Express cards are accepted. We also seek to drive greater usage of the American Express network by deepening merchant engagement and increasing Card Member awareness through initiatives such as our Shop Small\n®\n campaigns and expanding our payment options such as through debit and B2B capabilities.\nGMNS also provides fraud-prevention tools, marketing solutions, data analytics and other programs and services to merchants and other partners that leverage the capabilities of our integrated payments platform.\nCard Network Business\nWe operate a payments network through which we establish and maintain relationships with third-party banks and other institutions in approximately 120 countries and territories, licensing the American Express brand and extending the reach of our global network. These network partners are licensed to issue local currency American Express-branded cards in their countries and/or serve as the merchant acquirer for local merchants on our network.\nFor the year ended December 31, 2024, worldwide network services processed volume (spending on American Express cards issued by third parties) was $213.9 billion and as of December 31, 2024, we had 62.8 million cards-in-force issued by third parties worldwide.\nDiverse Customer Base and Global Footprint\nThe following chart provides a summary of our diverse set of customers and broad geographic footprint based on worldwide network volumes:\n3\nTable of Contents\nPartners and Relationships\nOur integrated payments platform allows us to work with a range of business partners, and our partners in return help drive the scale and relevance of the platform.\nThere are many examples of how we work with partners, including: issuing cards under cobrand arrangements with other corporations and institutions (e.g., Delta Air Lines (Delta), Hilton Worldwide Holdings, Marriott International and British Airways); providing greater value to our Card Members (e.g., Amex Offers and statement credits for purchases with partners); offering innovative ways for our Card Members to earn and use points with our merchants (e.g., Pay with Points at Amazon.com); expanding merchant acceptance with third-party acquirers and processors (e.g., OptBlue partners); operating through joint ventures in certain jurisdictions (e.g., in China, the Middle East and Switzerland); developing new capabilities and features with our digital partners (e.g., PayPal and i2c); enhancing our travel benefits and services (e.g., Fine Hotels and Resorts\n®\n); and providing experiences and entertainment for Card Members (e.g., via Formula 1 and AEG Worldwide). We also have an ownership position in, and commercial arrangements with, Global Business Travel Group, Inc. (GBTG), which provides business travel-related services.\nDelta is our largest strategic partner. Our relationships with, and revenues and expenses related to, Delta are significant and represent an important source of value for our Card Members. We issue cards under cobrand arrangements with Delta and the Delta cobrand portfolio continued to represent approximately 12 percent of worldwide billed business and approximately 21 percent of worldwide Card Member loans as of December 31, 2024. The Delta cobrand portfolio generates fee revenue and interest income from Card Members and discount revenue from Delta and other merchants for spending on Delta cobrand cards. The current Delta cobrand agreement runs through the end of 2029 and we expect to continue to make significant investments in this partnership. Among other things, Delta is also a key participant in our Membership Rewards program, provides travel-related benefits and services, including airport lounge access for certain American Express Card Members, accepts American Express cards as a merchant and is a corporate payments customer.\nWorking with all of our partners, we seek to provide value, choice and unique experiences across our customer base.\nOur Spend-Centric Model and Revenue Mix\nOur “spend-centric” business model focuses on generating revenues primarily by driving spending on our cards and secondarily through finance charges and fees. Spending on our cards, which is higher on average on a per-card basis versus our network competitors, offers superior value to merchants in the form of loyal customers and larger transactions, and attracts partners to provide value to our Card Members and merchants. Because of the revenues generated from having high-spending Card Members and the annual card fees we charge on many of our products, we are able to invest in attractive rewards and other benefits for Card Members, as well as targeted marketing and other programs and investments for merchants. This creates incentives for Card Members to spend more on their cards and positively differentiates American Express cards.\nWe believe our spend-centric model gives us the ability to provide differentiated value to Card Members, merchants and business partners.\nThe American Express Brand and Service Excellence\nOur brand and its attributes—trust, security and service—are key assets. We invest heavily in managing, marketing, promoting and protecting our brand, including through the delivery of our products and services in a manner consistent with our brand promise. The American Express brand is ranked among the most valuable brands in the world. We place significant importance on trademarks, service marks and patents, and seek to secure our intellectual property rights around the world.\nWe aim to provide the world’s best customer experience every day and our reputation for world-class service has been recognized by numerous awards over the years. Our customer care professionals, travel consultants and partners treat servicing interactions as an opportunity to bring the brand to life for our customers, add meaningful value and deepen relationships.\n4\nTable of Contents\nOur Business Strategies\nWe seek to grow our business by focusing on four strategic imperatives:\nFirst, we aim to expand our leadership in the premium consumer space by continuing to deliver membership benefits that span our customers’ everyday spending, borrowing, travel and lifestyle needs, expanding our roster of business partners around the globe and developing a range of experiences that attract high-spending customers.\nSecond, we seek to build on our strong position in commercial payments by evolving our card value propositions, further differentiating our corporate card and accounts payable expense management solutions and designing innovative products and features, including financing, banking and payment solutions for our business customers.\nThird, we are focused on strengthening our global, integrated network by continuing to increase merchant acceptance, providing merchants with fraud protection services, marketing insights and connections to higher-spending Card Members and working with our network partners to offer expanded products and services.\nFinally, we want to continue to build on our unique global position, seeking ways to use our differentiated business model and global presence as we progress against our other strategic imperatives.\nWe have completed the environmental, social and governance goals under our 2021–2024 strategy, other than our continued work in support of Small Business Saturday and other Shop Small campaigns that will progress in 2025 and beyond. We are reviewing our approach on these topics as mandatory reporting requirements evolve globally.\n5\nTable of Contents\nOur Colleagues\nOur colleagues are integral to executing our business strategies and to our overall success. As of December 31, 2024, we employed approximately 75,100 people, whom we refer to as colleagues, with approximately 25,800 colleagues in the United States and approximately 49,300 colleagues outside the United States. As of December 31, 2024, women represented 52.6 percent of our global workforce; Asian, Black/African American and Hispanic/Latino/a people represented 22.4 percent, 14.2 percent and 14.5 percent, respectively, of our U.S. workforce based on preliminary data for our 2024 U.S. EEO-1 submission; and 55 percent of our Executive Committee were women or from diverse races and ethnic backgrounds.\nWe believe that maintaining our strong workplace culture, adhering to our Blue Box values and ensuring that our people feel included, valued, recognized and backed helps us attract, retain and develop the right talent for American Express’ success. We conduct an annual Colleague Experience Survey and in 2024, 90 percent of colleagues who participated in the survey said they would recommend American Express as a great place to work.\nWe strive to offer a compelling colleague value proposition, which represents the many ways in which we support our colleagues to be and deliver their best. In 2024, we continued to invest in our colleagues, building on a wide range of learning and development opportunities and enhancing our competitive benefits in key areas including total compensation and holistic health and wellness.\nWe continuously invest in programs, benefits and resources to foster the personal and professional growth of our colleagues. We start with opportunities for colleagues to learn on the job, build cross-functional skills and grow in their careers through a defined, collaborative process for performance management. Colleagues have access to a wide variety of resources: career coaching, mentoring, professional networking, and rotation opportunities, as well as courses on-demand and with classroom-style instruction. \nWe aim to provide our colleagues with competitive compensation and leading benefits and take a holistic approach to well-being, providing resources that address the physical, financial and mental health of our colleagues. Our financial well-being program, Smart Saving, provides tools and resources to help colleagues build their knowledge and skills for all life stages. We support our colleagues’ physical health and well-being through our corporate wellness program, Healthy Living and we provide resources and support to increase awareness about mental health among our colleagues through our Healthy Minds Program. We also have policies and processes in place to help ensure we compensate colleagues fairly and equitably. We review our compensation practices regularly and have conducted an annual pay equity review since 2017, assessing pay on a statistical basis and considering key factors known to affect compensation, such as role, level, tenure, performance and geography. In 2024, we maintained 100 percent pay equity, meaning no statistical differences in pay, for colleagues across genders globally and across races and ethnicities in the United States.\n6\nTable of Contents\nInformation About Our Executive Officers\nSet forth below, in alphabetical order, is a list of our executive officers as of February 7, 2025, including each executive officer’s principal occupation and employment during the past five years. None of our executive officers has any family relationship with any other executive officer, and none of our executive officers became an officer pursuant to any arrangement or understanding with any other person. Each executive officer has been elected to serve until the next annual election of officers or until his or her successor is elected and qualified. Each officer’s age is indicated by the number in parentheses next to his or her name.\nDOUGLAS E. BUCKMINSTER —\nVice Chairman\nMr. Buckminster (64) has been Vice Chairman since April 2021. Prior thereto, he had been Group President, Global Consumer Services Group since February 2018.\nHOWARD GROSFIELD —\nGroup President, U.S. Consumer Services\nMr. Grosfield (56) has been Group President, U.S. Consumer Services since February 2025. Prior thereto, he had been President, U.S. Consumer Services since May 2022, Executive Vice President and General Manager of U.S. Consumer Marketing and Global Premium Services since February 2021 and Executive Vice President and General Manager of U.S. Consumer Marketing Services from January 2016 to February 2021.\nMONIQUE HERENA —\nChief Colleague Experience Officer\nMs. Herena (53) has been Chief Colleague Experience Officer since April 2019.\nRAYMOND JOABAR —\nGroup President, Global Commercial Services\nMr. Joabar (59) has been Group President, Global Commercial Services since February 2025. Prior thereto, he had been Group President, Global Merchant and Network Services since April 2021 and President, Global Risk and Compliance and Chief Risk Officer since September 2019.\nCHRISTOPHE Y. LE CAILLEC —\nChief Financial Officer\nMr. Le Caillec (59) has been Chief Financial Officer (CFO) since August 2023. Prior thereto, he had been Deputy CFO since December 2021 and Head of Corporate Planning since February 2019.\nRAFAEL MARQUEZ —\nPresident, International Card Services\nMr. Marquez (53) has been President, International Card Services since May 2022. Prior thereto, he had been President, International Consumer Services and Global Loyalty Coalition since September 2019.\nANNA MARRS —\nGroup President, Global Merchant and Network Services\nMs. Marrs (51) has been Group President, Global Merchant and Network Services since February 2025. Prior thereto, she had been Group President, Global Commercial Services and Credit & Fraud Risk since April 2021 and President, Global Commercial Services since September 2018.\nGLENDA MCNEAL —\nChief Partner Officer\nMs. McNeal (64) has been Chief Partner Officer since February 2024. Prior thereto, she had been President, Enterprise Strategic Partnerships since March 2017.\nDENISE PICKETT —\nPresident, Enterprise Shared Services\nMs. Pickett (59) has been President, Enterprise Shared Services since February 2025. Prior thereto, she had been President, Global Services Group since September 2019.\n7\nTable of Contents\nRAVI RADHAKRISHNAN —\nChief Information Officer\nMr. Radhakrishnan (53) has been Chief Information Officer since January 2022. Mr. Radhakrishnan joined American Express from Wells Fargo & Company, where he served as Chief Information Officer for the Commercial Banking and Corporate & Investment Banking businesses since May 2020. Prior thereto, he had been Chief Information Officer, Wholesale, Wealth & Investment Management and Innovation from May 2019 to May 2020.\nELIZABETH RUTLEDGE —\nChief Marketing Officer\nMs. Rutledge (63) has been Chief Marketing Officer since February 2018.\nLAUREEN E. SEEGER —\nChief Legal Officer\nMs. Seeger (63) has been Chief Legal Officer since July 2014.\nJENNIFER SKYLER —\nChief Corporate Affairs Officer\nMs. Skyler (48) has been Chief Corporate Affairs Officer since October 2019.\nSTEPHEN J. SQUERI —\nChairman and Chief Executive Officer\nMr. Squeri (65) has been Chairman and Chief Executive Officer since February 2018.\nDOUGLAS TABISH —\nChief Risk Officer\nMr. Tabish (55) has been Chief Risk Officer since April 2024. Prior thereto, he had been Executive Vice President and General Manager of Global Card & Risk Operations since January 2020.\n8\nTable of Contents\nCOMPETITION\nWe compete in the global payments industry with networks, issuers, acquirers and other payment service providers and methods of payment, including paper-based transactions (e.g., cash and checks) and electronic transfers (e.g., wire transfers and Automated Clearing House (ACH)), as well as evolving and growing alternative mechanisms, systems and products that leverage new technologies, business models and customer relationships to create payment, financing or banking solutions. The payments industry continues to undergo dynamic changes in response to evolving technologies, consumer habits and merchant needs.\nAs a card issuer, we compete with financial institutions that issue general-purpose credit and debit cards, as well as businesses that issue private label cards, operate mobile wallets, provide payment services or extend credit. We face intense competition in the premium space and for cobrand relationships, as both card issuer and network competitors have targeted high-spending customers and key business partners with attractive value propositions. We also face competition for partners and other differentiated offerings, such as lounge space in U.S. and global hub airports, dining and event reservation and operational capabilities and other experiential offerings to customers. Our banking products also face strong competition, such as with respect to the rates offered on deposits.\nOur global card network competes in the global payments industry with other card networks, including, among others, Visa, China UnionPay, Mastercard, JCB, Discover and Diners Club International (which is owned by Discover). We are the fourth largest general-purpose card network globally based on purchase volume, behind Visa, China UnionPay and Mastercard. In addition to such networks, we compete against a range of companies globally, including merchant acquirers, processors and web- and mobile-based payment platforms (e.g., Alipay, PayPal and Shop Pay), as well as regional payment networks (such as the National Payments Corporation of India).\nThe principal competitive factors that affect card-issuing, merchant and network businesses include:\n•\nThe features, value and quality of the products and services, including customer care, rewards programs and offers, partnerships, travel and lifestyle-related benefits (including lounges, dining and other entertainment), banking services and digital and mobile services, as well as the costs associated with providing such features and services\n•\nReputation and brand recognition\n•\nThe number, spending characteristics and credit performance of customers\n•\nThe quantity, diversity and quality of the establishments where the cards can be used\n•\nThe attractiveness of the value proposition to card issuers, merchant acquirers, third-party processors, cardholders, corporate clients, merchants and other payment intermediaries (including the relative cost and ease of using or accepting the products and services, and capabilities such as fraud prevention and data analytics)\n•\nThe number, quality and cost of other cards and other forms of payment and financing available to customers, as well as the integration and connectivity of those products\n•\nThe security of cardholder, merchant and network partner information\n•\nThe success of marketing and promotional campaigns\n•\nThe speed of innovation and investment in systems, technologies and product and service offerings\n•\nThe nature and quality of expense management tools, electronic payment methods and data capture and reporting capabilities, particularly for business customers\nAnother aspect of competition is the dynamic and rapid growth of alternative payment and financing mechanisms, systems and products, which include payment facilitators and aggregators, digital payment, open banking and electronic wallet platforms, point-of-sale lenders and buy now, pay later products, real-time settlement and processing systems, financial technology companies, digital currencies developed by both central banks and the private sector, blockchain and similar distributed ledger technologies, prepaid systems and gift cards, and systems linked to customer accounts or that provide payment solutions. The integration of new or evolving technologies, such as generative artificial intelligence, has the potential to create new or better competitor products, alter the competitive environment and disintermediate our relationship with customers. Additionally, various competitors are integrating more financial services into their product offerings and competitors are seeking to attain the benefits of an integrated payments platform, such as ours.\n9\nTable of Contents\nIn addition to the discussion in this section, see “\nOur operating results may materially suffer because of substantial and increasingly intense competition worldwide in the payments industry\n” under “Risk Factors” for further discussion of the potential impact of competition on our business, and “\nOur business is subject to evolving and comprehensive government regulation and supervision, which could materially adversely affect our results of operations and financial condition\n” and “\nLegal proceedings regarding provisions in our merchant contracts, including non-discrimination and honor-all-cards provisions, could have a material adverse effect on our business and result in additional litigation and/or arbitrations, changes to our merchant agreements and/or business practices, substantial monetary damages and damage to our reputation and brand\n” under “Risk Factors” for a discussion of the potential impact on our ability to compete effectively due to government regulations or if ongoing legal proceedings limit our ability to prevent merchants from engaging in various actions to discriminate against our card products.\n10\nTable of Contents\nSUPERVISION AND REGULATION\nOverview\nWe are subject to evolving and extensive government regulation and supervision in jurisdictions around the world, and the costs of ongoing compliance are substantial. The financial services industry is subject to rigorous scrutiny, high regulatory expectations, a range of regulations and a stringent and unpredictable enforcement environment.\nGovernmental authorities have focused, and we believe will continue to focus, considerable attention on reviewing compliance by financial services firms and payment systems with laws and regulations, and as a result, we continually work to evolve and improve our risk management framework, governance structures, practices and procedures. Reviews by us and governmental authorities to assess compliance with laws and regulations, as well as our own internal reviews to assess compliance with internal policies, including errors or misconduct by colleagues or third parties or control failures, have resulted in, and are likely to continue to result in, changes to our products, practices and procedures, restitution to our customers and increased costs related to regulatory oversight, supervision and examination. We have also been subject to regulatory actions and may continue to be the subject of such actions, including governmental inquiries, investigations, enforcement proceedings and the imposition of fines or civil money penalties, in the event of noncompliance or alleged noncompliance with laws or regulations. For example, as previously disclosed, we entered into agreements to resolve governmental investigations related to historical sales practices for certain U.S. small business customers, which are described in more detail in Note 12 to the “Consolidated Financial Statements.” In addition, various regulatory agencies have announced they are reviewing credit card rewards programs for compliance with consumer protection laws and regulations. We have identified certain issues related to the rewards and benefits we provide including, as previously disclosed, that certain U.S. Card Members were not credited certain Membership Rewards points they had earned. We have taken actions to remediate these issues and enhance our related procedures and controls. We are cooperating with ongoing regulatory inquiries concerning our rewards and benefits programs.\nPolicymakers around the world continue to propose and adopt new and increasingly complex laws and regulations governing a wide variety of issues that may impact our business or change our operating environment in substantial and unpredictable ways. For example, legislators and regulators in various countries in which we operate have focused on the offering of consumer financial products and the operation of payment networks, resulting in changes to certain practices or pricing of card issuers, merchant acquirers and payment networks, and, in some cases, the establishment of broad and ongoing regulatory oversight regimes.\nThe following discussion summarizes elements of the extensive regulatory environment in which we operate; it does not purport to be complete or to describe all of the laws or regulations to which we are subject or all possible or proposed changes in laws or regulations that may become applicable to us. See “Operational and Compliance/Legal Risks” under “Risk Factors” for a discussion of the potential impact that changes in applicable law or regulation, and in their interpretation and application by regulatory agencies and other governmental authorities, may have on our business, results of operations and financial condition.\nBanking Regulation\nAmerican Express entities are subject to banking regulation in the United States and in certain jurisdictions internationally. U.S. federal and state banking laws, regulations and policies extensively regulate the Company, TRS and our U.S. bank subsidiary, American Express National Bank (AENB). For purposes of this Supervision and Regulation section, the “Company” refers only to American Express Company, a bank holding company, and does not include its subsidiaries. Both the Company and TRS are subject to comprehensive consolidated supervision, regulation and examination by the Federal Reserve and AENB is supervised, regulated and examined by the Office of the Comptroller of the Currency (OCC). The Company and its subsidiaries are also subject to the rulemaking, enforcement and examination authority of the Consumer Financial Protection Bureau (CFPB). Banking regulators have broad examination and enforcement powers, including the power to impose substantial fines, limit dividends and other capital distributions, restrict operations and acquisitions and require divestitures, any of which could compromise our competitive position. Many aspects of our business also are subject to rigorous regulation by other U.S. federal and state regulatory agencies and by non-U.S. government agencies and regulatory bodies. For example, non-U.S. regulators supervising our international regulated financial institutions use many of the same principles of regulation and supervision that are used by U.S. federal bank regulators.\n11\nTable of Contents\nActivities\nThe BHC Act generally limits bank holding companies to activities that are considered to be banking activities and certain closely related activities. As noted above, each of the Company and TRS is a bank holding company and each has elected to become a financial holding company, which is authorized to engage in a broader range of financial and related activities. In order to remain eligible for financial holding company status, the Company and TRS must meet certain eligibility requirements. Those requirements include that each of the Company and AENB must be “well capitalized” and “well managed,” and AENB must have received at least a “satisfactory” rating on its most recent assessment under the Community Reinvestment Act of 1977 (the CRA). The Company, TRS and their subsidiaries engage in various activities permissible only for financial holding companies, including, in particular, providing travel agency services, acting as a finder and engaging in certain insurance underwriting and agency services. If the Company fails to meet eligibility requirements for financial holding company status, it and its subsidiaries are likely to be barred from engaging in new types of financial activities or making certain types of acquisitions or investments in reliance on its status as a financial holding company, and ultimately could be required to either discontinue the broader range of activities permitted to financial holding companies or divest AENB. In addition, the Company and its subsidiaries are prohibited by law from engaging in practices that regulatory authorities deem unsafe or unsound (which such authorities generally interpret broadly) and regulatory authorities have discretion in determining whether new or modified activities can be conducted in a safe and sound manner.\nAcquisitions and Investments\nApplicable federal and state laws place limitations on the ability of persons to invest in or acquire control of us without providing notice to or obtaining the approval of one or more of our regulators. In addition, we are subject to banking laws and regulations that limit our investments and acquisitions and, in some cases, subject them to the prior review and approval of our regulators, including the Federal Reserve and the OCC. Federal banking regulators have broad discretion in evaluating proposed acquisitions and investments that are subject to their prior review or approval.\nEnhanced Prudential Standards\nThe Company is subject to the U.S. federal bank regulatory agencies’ rules that tailor the application of enhanced prudential standards to bank holding companies and depository institutions with $100 billion or more in total consolidated assets. Under these rules, each such bank holding company is assigned to one of four categories based on its status as a U.S. global systemically important banking organization and five other risk-based indicators: (i) total assets, (ii) cross-jurisdictional activity, (iii) non-bank assets, (iv) off-balance sheet exposure, and (v) weighted short-term wholesale funding, with the most stringent requirements applying to Category I firms and the least stringent requirements applying to Category IV firms. Under these rules, the Company became a Category III firm in the third quarter of 2024 as a result of the Company’s total consolidated assets exceeding $250 billion, calculated based on a daily average of total consolidated assets for the four quarters ended June 30, 2024. Category III firms are subject to heightened capital, liquidity and prudential requirements, single-counterparty credit limits and additional stress tests, which in some cases are subject to a transition period. AENB, as a depository institution subsidiary of a Category III firm, is also subject to certain enhanced prudential standards under these tailoring rules as described below.\nFurther changes in the levels of risk-based indicators described above, such as if we have $75 billion or more in cross-jurisdictional activity (based on a four-quarter trailing average), could result in the Company becoming a Category II firm and subject to more stringent capital, liquidity and prudential requirements. Our cross-jurisdictional activity was $66 billion as of December 31, 2024, and the four-quarter trailing average was $67 billion.\nCapital and Liquidity Regulation\nCapital Rules\nThe Company and AENB are required to comply with the applicable capital adequacy rules established by federal banking regulators. These rules are intended to ensure that bank holding companies and depository institutions (collectively, banking organizations) have adequate capital given their level of assets and off-balance sheet obligations. The federal banking regulators’ current capital rules (the Capital Rules) implement the Basel Committee on Banking Supervision’s framework for strengthening international capital regulation, known as Basel III. For additional information regarding our capital ratios, see “Consolidated Capital Resources and Liquidity” under “MD&A.”\n12\nTable of Contents\nUnder the Capital Rules, banking organizations are required to maintain minimum ratios for Common Equity Tier 1 (CET1 capital), Tier 1 capital (that is, CET1 capital plus additional Tier 1 capital) and Total capital (that is, Tier 1 capital plus Tier 2 capital) to risk-weighted assets. We report our capital adequacy ratios using risk-weighted assets calculated under the standardized approach. Category III firms such as the Company are not subject to the advanced approaches capital requirements, whereas Category II firms are subject to the advanced approaches capital requirements under current capital rules, which introduce additional complexities in the methodologies used to calculate risk-weighted assets for purposes of determining capital adequacy ratios.\nOn July 27, 2023, the U.S. federal bank regulatory agencies issued a notice of proposed rulemaking that would significantly revise U.S. regulatory capital requirements for large banking organizations, including the Company and AENB. The proposed rules would apply a new expanded risk-based approach to calculating risk-based capital ratios, and large banking organizations would be required to calculate their risk-based capital ratios under both (i) the standardized approach and (ii) the expanded risk-based approach and use the lower of the two ratio calculations to determine binding capital constraints under each risk-based capital ratio. The expanded risk-based approach to calculating risk-weighted assets would apply more granular risk-weighting methodologies for credit risk, include a new standardized methodology for operational risk, include new approaches for calculating market and credit valuation adjustment risk and revise the treatment of equity exposures not subject to market risk capital requirements. The new approach to calculating market risk also would apply to calculations under the standardized approach. The methodology for operational risk would include differential treatment of fee and other non-interest revenues as compared to interest income for purposes of determining operational risk-weighted assets. The proposed rules would also include additional credit risk capital requirements for certain “unconditionally cancellable commitments” such as unused portions of committed lines of credit (e.g., credit cards) and would create a proxy methodology to assign capital requirements to credit exposure on products that carry no pre-set spending limits such as charge cards. The Federal Reserve has issued public statements indicating that it intends to work with other U.S. federal bank regulatory agencies on a revised proposal; however, any future rulemaking with respect to Basel III standards remains uncertain. The ultimate impact of any such rulemaking will depend on a number of factors, including the content of the final rulemaking, future minimum regulatory requirements and management decisions regarding our product constructs, capital distributions and target capital levels, and such rulemaking could result in significantly higher regulatory capital requirements for the Company and AENB.\nThe Company and AENB must each maintain CET1 capital, Tier 1 capital and Total capital ratios of at least 4.5 percent, 6.0 percent and 8.0 percent, respectively. On top of these minimum capital ratios, the Company is subject to a dynamic stress capital buffer (SCB) composed entirely of CET1 capital with a floor of 2.5 percent and AENB is subject to a static 2.5 percent capital conservation buffer (CCB). The SCB equals (i) the difference between a bank holding company’s starting and minimum projected CET1 capital ratios under the supervisory severely adverse scenario under the Federal Reserve’s stress tests described below, plus (ii) one year of planned common stock dividends as a percentage of risk-weighted assets. As a Category III firm, the required minimum capital ratios for the Company may be further increased by a countercyclical capital buffer of up to an additional 2.5 percent of risk-weighted assets, if enacted by the Federal Reserve, which must be held in the form of CET1 capital. The countercyclical capital buffer is currently set at zero percent; however it could change in the future. If the Federal Reserve were to raise the countercyclical capital buffer, covered banking organizations such as the Company would generally have 12 months after the announcement of such increase to meet the increased buffer requirement, unless the Federal Reserve sets an earlier effective date.\nOn August 28, 2024, the Federal Reserve confirmed the SCB for the Company of 2.5 percent, which remained unchanged from the level announced in July 2023. As a result, the effective minimum ratios for the Company (taking into account the SCB requirement) and AENB (taking into account the CCB requirement) are 7.0 percent, 8.5 percent and 10.5 percent for the CET1 capital, Tier 1 capital and Total capital ratios, respectively. Banking organizations with ratios of CET1 capital, Tier 1 capital or Total capital to risk-weighted assets below these effective minimum ratios face constraints on discretionary distributions such as dividends, repurchases and redemptions of capital securities and executive compensation. A bank holding company’s SCB requirement is effective on October 1 of each year and will remain in effect through September 30 of the following year unless it is reset in connection with resubmission of a capital plan, as discussed below.\nThe Company is also required to comply with minimum leverage ratio requirements. The leverage ratio is the ratio of a banking organization’s Tier 1 capital to its average total consolidated assets (as defined for regulatory purposes). The Company is also subject to a minimum supplementary leverage ratio, which is the ratio of Tier 1 capital to an expanded concept of leverage exposure that takes into account both on‐balance sheet assets and certain off‐balance sheet exposures. All banking organizations are required to maintain a leverage ratio of at least 4.0 percent, and Category III banking organizations such as the Company are required to maintain a minimum supplementary leverage ratio of 3.0 percent.\n13\nTable of Contents\nLiquidity Regulation \nThe Company and AENB are subject to two standards for liquidity risk supervision as implemented by the Federal Reserve and OCC: the minimum liquidity coverage ratio (LCR) and the net stable funding ratio (NSFR). The LCR is designed to ensure that a banking entity maintains an adequate level of unencumbered high-quality liquid assets to meet its liquidity needs for a 30-day time horizon under an acute liquidity stress scenario specified by supervisors. The LCR measures the ratio of a firm’s high-quality liquid assets to its projected net outflows. The NSFR requires a minimum amount of longer-term funding sources based on the assets, commitments and derivative exposures of banking entities. As a Category III firm with less than $75 billion in weighted short-term wholesale funding, the Company, and its depository institution subsidiary, AENB, are subject to LCR and NSFR requirements at 85 percent of the full requirements. The Company and AENB are required to calculate the LCR and NSFR on a daily basis and the Company is required to make public disclosures related to its LCR on a quarterly basis and NSFR on a semi-annual basis, in each case, subject to applicable transition periods following the Company becoming a Category III firm. Category II firms and their depository institution subsidiaries are subject to the full requirements of the LCR and NSFR, as well as a requirement to submit a liquidity monitoring report on a daily (rather than monthly) basis.\nIn addition, the Federal Reserve’s enhanced prudential standards rule includes heightened liquidity and risk management requirements. The rule requires the maintenance of a liquidity buffer, consisting of highly liquid assets, that is sufficient to meet projected net outflows for 30 days over a range of liquidity stress scenarios. In contrast to the LCR, which is a standardized approach, the liquidity buffer requirement is calculated based on the Company’s own models.\nProposed Long-Term Debt Requirements\nOn August 29, 2023, the U.S. federal bank regulatory agencies issued a notice of proposed rulemaking that, if adopted as proposed, would require covered bank holding companies such as the Company to issue and maintain minimum amounts of eligible external long-term debt with specific terms for purposes of absorbing losses or recapitalizing the covered bank holding company and its operating subsidiaries. The notice of proposed rulemaking also proposed requiring certain insured depository institutions that have at least $100 billion in consolidated assets, such as AENB, to maintain minimum amounts of eligible internal long-term debt for purposes of absorbing losses or recapitalizing the insured depository institution.\nStress Testing and Capital Planning\nUnder the Federal Reserve’s regulations, the Company is subject to annual supervisory stress testing requirements and biennial company-run stress testing requirements (commonly referred to as Dodd-Frank Act Stress Tests or “DFASTs”) that are designed to evaluate whether a bank holding company has sufficient capital on a total consolidated basis to absorb losses and support operations under adverse economic conditions.\nAs part of the Comprehensive Capital Analysis and Review (CCAR), the Federal Reserve uses pro-forma capital positions and ratios under such stress scenarios to determine the size of the SCB for each CCAR participating firm. As a Category III firm, the Company is required to develop and submit to the Federal Reserve an annual capital plan and stress testing results on or before April 5 of each year. \nThe Company may be required to revise and resubmit its capital plan following certain events or developments, such as a significant acquisition or an event that could result in a material change in its risk profile or financial condition. If the Company is required to resubmit its capital plan, it must receive prior approval from the Federal Reserve for any capital distributions (including common stock dividend payments and share repurchases), other than a capital distribution on a newly issued capital instrument.\n14\nTable of Contents\nDividends and Other Capital Distributions\nThe Company and TRS, as well as AENB and the Company’s insurance and other regulated subsidiaries, are limited in their ability to pay dividends by statutes, regulations and supervisory policy.\nCommon stock dividend payments and share repurchases by the Company are subject to the oversight of the Federal Reserve and the outcome of the annual CCAR stress testing exercise, as described above. The Company will be subject to limitations and restrictions on capital distributions if, among other things, (i) the Company’s regulatory capital ratios do not satisfy applicable minimum requirements and buffers or (ii) the Company is required to resubmit its capital plan.\nIn general, federal laws and regulations prohibit, without first obtaining the OCC’s approval, AENB from making dividend distributions to TRS, if such distributions are not paid out of available recent earnings or would cause AENB to fail to meet capital adequacy standards. In addition to specific limitations on the dividends AENB can pay to TRS, federal banking regulators have authority to prohibit or limit the payment of a dividend if, in the banking regulator’s opinion, payment of a dividend would constitute an unsafe or unsound practice in light of the financial condition of the institution.\nPrompt Corrective Action\nThe Federal Deposit Insurance Act (FDIA) requires, among other things, that federal banking regulators take prompt corrective action in respect of depository institutions insured by the FDIC (such as AENB) that do not meet minimum capital requirements. The FDIA establishes five capital categories for FDIC-insured banks: well capitalized, adequately capitalized, undercapitalized, significantly undercapitalized and critically undercapitalized. The FDIA imposes progressively more restrictive constraints on operations, management and capital distributions, depending on the capital category in which an institution is classified. In order to be considered “well capitalized,” AENB must maintain CET1 capital, Tier 1 capital, Total capital and Tier 1 leverage ratios of 6.5 percent, 8.0 percent, 10.0 percent and 5.0 percent, respectively.\nUnder the FDIA, AENB could be prohibited from accepting brokered deposits (i.e., deposits raised through third-party brokerage networks) or offering interest rates on any deposits significantly higher than the prevailing rate in its normal market area or nationally (depending upon where the deposits are solicited), unless (1) it is well capitalized or (2) it is adequately capitalized and receives a waiver from the FDIC. A portion of our outstanding U.S. retail deposits are considered brokered deposits for bank regulatory purposes. If a federal regulator determines that we are in an unsafe or unsound condition or that we are engaging in unsafe or unsound banking practices, the regulator may reclassify our capital category or otherwise place restrictions on our ability to accept or solicit brokered deposits.\nResolution and Recovery Planning\nCertain bank holding companies are required to submit resolution plans to the Federal Reserve and FDIC providing for the company’s strategy for rapid and orderly resolution in the event of its material financial distress or failure. As a Category III firm, the Company is required to submit a holding company resolution plan every three years, with submissions alternating between a full plan and a plan targeted on certain areas or subjects identified by the Federal Reserve and the FDIC.\n \nThe Company’s next holding company resolution plan is required to be submitted by October 1, 2025. If the Federal Reserve and the FDIC determine that the Company’s plan is not credible and we fail to cure the deficiencies, we may be subject to more stringent capital, leverage or liquidity requirements; may be subject to more restrictions on our growth, activities or operations; or may ultimately be required to divest certain assets or operations to facilitate an orderly resolution.\nAENB continues to be required to prepare and provide a separate resolution plan to the FDIC that would enable the FDIC, as receiver, to effectively resolve AENB under the FDIA in the event of failure. In June 2024, the FDIC issued a final rule revising its resolution plan requirements for insured depository institutions, which requires certain insured depository institutions with $100 billion or more in assets, including AENB, to submit full resolution plans every three years with interim supplements in non-submission years. Under the final rule, resolution plans are subject to more stringent standards with respect to their assumptions and content, as well as enhanced credibility standards for the FDIC’s evaluation of resolution plans and expanded expectations regarding engagement and capabilities testing. AENB will be required to submit its initial resolution plan under the final rule on or before July 1, 2026, with its initial interim supplement due on or before July 1, 2025.\nIn October 2024, the OCC issued final revisions to its recovery planning guidelines, which expand the recovery planning guidelines to apply to insured national banks with $100 billion or more in total consolidated assets, including AENB. The OCC’s recovery planning guidelines require a covered bank to develop, maintain and test a recovery plan that, among other things, identifies a range of options that could be undertaken by the covered bank to restore its financial strength and viability when it experiences considerable financial or operational stress, but has not deteriorated to the point that resolution is imminent. AENB will be required to develop a recovery plan by December 31, 2025 and test it by December 31, 2026, with testing then required periodically (but not less than annually) and following any significant changes to the recovery plan made in response to a material event.\n15\nTable of Contents\nOrderly Liquidation Authority\nThe Company could become subject to the Orderly Liquidation Authority (OLA), a resolution regime under which the Treasury Secretary may appoint the FDIC as receiver to liquidate a systemically important financial institution, if the Company is in danger of default and is determined to present a systemic risk to U.S. financial stability. As under the FDIC resolution model, under the OLA, the FDIC has broad power as receiver. Substantial differences exist, however, between the OLA and the U.S. Bankruptcy Code, including the right of the FDIC under the OLA to disregard the strict priority of creditor claims in limited circumstances, the use of an administrative claims procedure to determine creditor claims (as opposed to the judicial procedure used in bankruptcy proceedings), and the right of the FDIC to transfer claims to a “bridge” entity.\nThe FDIC has developed a strategy under OLA, referred to as the “single point of entry” or “SPOE” strategy, under which the FDIC would resolve a failed financial holding company by transferring its assets (including shares of its operating subsidiaries) and, potentially, very limited liabilities to a “bridge” holding company; utilize the resources of the failed financial holding company to recapitalize the operating subsidiaries; and satisfy the claims of unsecured creditors of the failed financial holding company and other claimants in the receivership by delivering securities of one or more new financial companies that would emerge from the bridge holding company. Under this strategy, management of the failed financial holding company would be replaced and its shareholders and creditors would bear the losses resulting from the failure.\nFDIC Powers upon Insolvency of AENB\nIf the FDIC is appointed the conservator or receiver of AENB, the FDIC has the power to: (1) transfer any of AENB’s assets and liabilities to a new obligor without the approval of AENB’s creditors; (2) enforce the terms of AENB’s contracts pursuant to their terms; or (3) repudiate or disaffirm any contract or lease to which AENB is a party, the performance of which is determined by the FDIC to be burdensome and the disaffirmation or repudiation of which is determined by the FDIC to promote the orderly administration of AENB. In addition, the claims of holders of U.S. deposit liabilities and certain claims for administrative expenses of the FDIC against AENB would be afforded priority over other general unsecured claims against AENB, including claims of debt holders and depositors in non-U.S. offices, in the liquidation or other resolution of AENB. As a result, regardless of whether the FDIC ever sought to repudiate any debt obligations of AENB, the debt holders and depositors in non-U.S. offices would be treated differently from, and could receive substantially less, if anything, than the depositors in the U.S. offices of AENB.\nOther Banking Regulations\nSource of Strength\nThe Company is required to act as a source of financial and managerial strength to its U.S. bank subsidiary, AENB, and may be required to commit capital and financial resources to support AENB. Such support may be required at times when, absent this requirement, the Company otherwise might determine not to provide it. Capital loans by the Company to AENB are subordinate in right of payment to deposits and to certain other indebtedness of AENB. In the event of the Company’s bankruptcy, any commitment by the Company to a federal banking regulator to maintain the capital of AENB will be assumed by the bankruptcy trustee and entitled to a priority of payment.\nTransactions Between AENB and its Affiliates\nCertain transactions (including loans and credit extensions from AENB) between AENB and its affiliates (including the Company, TRS and their other subsidiaries) are subject to quantitative and qualitative limitations, collateral requirements and other restrictions imposed by statute and regulation. Transactions subject to these restrictions are generally required to be made on an arm’s-length basis.\nFDIC Deposit Insurance and Insurance Assessments\nAENB accepts deposits that are insured by the FDIC up to the applicable limits. Under the FDIA, the FDIC may terminate the insurance of an institution’s deposits upon a finding that the institution has engaged in unsafe or unsound practices; is in an unsafe or unsound condition to continue operations; or has violated any applicable law, regulation, rule, order or condition imposed by the FDIC. We do not know of any practice, condition or violation that would lead to termination of deposit insurance at AENB. The FDIC’s deposit insurance fund is funded by assessments on insured depository institutions, including AENB, which are subject to adjustment by the FDIC. \n16\nTable of Contents\nCommunity Reinvestment Act\nAENB is subject to the CRA, which imposes affirmative, ongoing obligations on depository institutions to meet the credit needs of their local communities, including low- and moderate-income neighborhoods, consistent with the safe and sound operation of the institution. AENB is currently designated a “limited purpose bank” under CRA regulations. In October 2023\n, the U.S. federal bank regulatory agencies adopted a final rule that makes extensive revisions to the CRA regulatory framework, including to the definition of “limited purpose bank,” which could impact AENB and alter its CRA compliance obligations. In March 2024, a preliminary injunction was granted postponing the effectiveness of the final rule and the implementation dates until the resolution of litigation challenging the final rule; whether the final rule will ultimately be implemented and any related compliance deadlines remain uncertain.\nClimate Risk Management\nIn October 2023, the U.S. federal bank regulatory agencies issued “Principles for Climate-Related Financial Risk Management for Large Financial Institutions.” The principles apply to financial institutions with more than $100 billion in total consolidated assets, like the Company and AENB, and are broadly designed to provide a high-level framework for the safe and sound management of exposures to climate-related financial risks consistent with existing U.S. federal bank regulatory agencies’ rules and guidance. The principles outline six key aspects of climate-related financial risk management: governance; policies, procedures and limits; strategic planning; risk management; data, risk measurement and reporting; and scenario analysis. In addition, the principles offer risk assessment guidance for incorporating climate-related financial risks in various traditional risk categories.\nConsumer Financial Products Regulation\nOur consumer-oriented activities are subject to regulation and supervision in the United States and internationally. In the United States, our marketing, sale and servicing of consumer financial products and our compliance with certain federal consumer financial laws are supervised and examined by the CFPB, which has broad rulemaking and enforcement authority over providers of credit, savings and payment services and products, and authority to prevent “unfair, deceptive or abusive” acts or practices. The CFPB has the authority to write regulations under federal consumer financial protection laws, to enforce those laws and to examine for compliance. It is also authorized to collect fines and require consumer restitution in the event of violations, engage in consumer financial education, track consumer complaints, request data and promote the availability of financial services to underserved consumers and communities. In addition, a number of U.S. states have significant consumer credit protection, disclosure and other laws (in certain cases more stringent than U.S. federal laws). U.S. federal law also regulates abusive debt collection practices, which, along with bankruptcy and debtor relief laws, can affect our ability to collect amounts owed to us or subject us to regulatory scrutiny.\nThe CFPB and other regulators have recently had a heightened focus on fees, rewards and other practices related to credit cards. For example, in March 2024, the CFPB issued a final rule lowering the safe harbor amount for credit card late fees that would be considered “reasonable and proportional” to the costs incurred by credit card issuers for late payments to eight dollars, eliminating a higher late fee safe harbor amount for subsequent late payments and eliminating the annual inflation adjustment for the safe harbor amount. In May 2024, a preliminary injunction was granted staying the effectiveness of the final rule; however, whether the final rule will ultimately be implemented remains uncertain. In addition, the CFPB and the U.S. Department of Transportation (DOT) have launched inquiries focused on credit card and airline rewards programs, with the CFPB issuing a circular to other agencies in December 2024 addressing the design, marketing and administration of credit card rewards programs.\nIn March 2023, the CFPB adopted a final rule requiring covered financial institutions, such as us, to collect and report data to the CFPB regarding certain small business credit applications. Based on our small business credit transaction volume, we will be required to comply with this rule by July 18, 2025 and begin reporting data to the CFPB by July 1, 2026.\nIn October 2024, the CFPB issued a final rule on personal financial data rights that requires financial institutions, including us, and other financial service providers (collectively referred to as data providers) to provide consumers and consumer-authorized third parties with access to consumers’ financial data in electronic form free of charge. At the earliest, for certain products, we will be required to comply with the rule beginning on April 1, 2026; however, the compliance timeline is subject to change due to the outcome of pending litigation challenging the rule. While the impact of the rule will depend upon a number of factors, including consumer behavior and the actions of data providers and recipients, open banking initiatives like this final rule have the potential to change the competitive landscape, presenting challenges to our business model, such as limiting advantages provided by our integrated payments platform, as well as opportunities since we may also act as an authorized third party and receive data from data providers.\n17\nTable of Contents\nWe are also regulated in the United States under the “money transmitter” or “sale of check” laws in effect in most states. In addition, we are required by the laws of many states to comply with unclaimed and abandoned property laws, under which we must pay to states the face amount of any Travelers Cheque or prepaid card that is uncashed or unredeemed after a period of time depending on the type of product. Additionally, we are regulated under insurance laws in the United States and other countries where we offer insurance services. Our merchant acquiring business, and the third-party merchant acquirers, aggregators and processors with whom we have relationships, are also subject to certain aspects of regulation under consumer protection laws, such as by the Federal Trade Commission.\nIn countries outside the United States, regulators continue to focus on a number of key areas impacting our card-issuing businesses, particularly consumer protection (such as in the European Union (EU), the United Kingdom and Canada) and responsible lending (such as in Australia, Mexico, New Zealand and Singapore), with increasing importance on and attention to customers and outcomes rather than just ensuring compliance with local rules and regulations. For example, the Financial Conduct Authority’s Consumer Duty in the United Kingdom, among other things, requires firms to act to deliver “good outcomes” for retail customers with respect to products and services, price and value, consumer understanding and consumer support. Regulators’ expectations of firms in relation to their compliance, risk and control frameworks continue to increase and regulators are placing significant emphasis on a firm’s systems and controls relating to the identification and resolution of issues.\nPayments Regulation\nLegislators and regulators in various countries in which we operate have focused on the operation of card networks, including through enforcement actions, legislation and regulations to change certain practices or pricing of card issuers, merchant acquirers and payment networks, and, in some cases, to establish broad regulatory regimes for payment systems.\nPricing for card acceptance, including interchange fees (that is, the fee paid by the bankcard merchant acquirer to the card issuer in payment networks like Visa and Mastercard), has been a focus of legislators and regulators in Australia, Canada, the EU, the United States and other jurisdictions. Recently, certain states in the United States have passed or are considering laws prohibiting interchange from being charged on all or certain components of transactions, such as sales tax and gratuities. Jurisdictions have also sought to regulate various other aspects of network operations and contract terms and practices governing merchant card acceptance, including information associated with electronic transactions, such as state legislation regarding the use of specific merchant categories codes or limiting the use of transaction data.\nRegulation and other governmental actions relating to operations, pricing or practices could affect all networks and/or acquirers directly or indirectly, as well as adversely impact consumers and merchants. Among other things, regulation of bankcard fees has negatively impacted, and may continue to negatively impact, the discount revenue we earn, including as a result of downward pressure on our merchant discount rates from decreases in competitor pricing in connection with caps on interchange fees. In some cases, regulations also extend to certain aspects of our business, such as network and cobrand arrangements or the terms of card acceptance for merchants. For example, we exited our network business in the EU and Australia as a result of regulation in those jurisdictions. In addition, there is uncertainty as to when or how interchange fee caps and other provisions of the EU payments legislation might apply when we work with cobrand partners and agents in the EU. In 2018, the EU Court of Justice (CJEU) confirmed the validity of fee capping and other provisions in circumstances where three-party networks issue cards with a cobrand partner or through an agent, although its ruling provided only limited guidance as to when or how the provisions might apply in such circumstances and remains subject to differing interpretations by regulators and participants in cobrand arrangements. In December 2024, the CJEU held a hearing on questions referred by the Dutch Trade and Industry Appeals Tribunal regarding the interpretation of the application of the interchange fee caps in connection with an administrative proceeding by the Netherlands Authority for Consumers and Markets regarding our cobrand relationship with KLM Royal Dutch Airlines; the CJEU has not yet issued a decision. Given differing interpretations by regulators and participants in cobrand arrangements, we are subject to regulatory action, penalties and the possibility we will not be able to maintain our existing cobrand and agent relationships in the EU. See “\nOur business is subject to evolving and comprehensive government regulation and supervision, which could materially adversely affect our results of operations and financial condition\n” under “Risk Factors.”\nIn various countries, such as certain Member States in the EU, Australia and Canada (other than in the Province of Quebec), merchants are permitted by law to surcharge card purchases. In addition, the laws of a number of states in the United States that prohibit surcharging have been overturned and certain states have passed or are considering laws to permit surcharging by merchants. In jurisdictions allowing surcharging, we have seen an increase in merchant surcharging on American Express cards, particularly in certain merchant categories. Surcharging is an adverse customer experience and could have a material adverse effect on us, particularly where it only or disproportionately impacts credit card usage or card usage generally, our Card Members or our business. In addition, we also encounter steering or differential acceptance practices by merchants, which could also have a material adverse effect on us. See “\nSurcharging, steering or other differential acceptance practices by merchants could materially adversely affect our business and results of operations\n” under “Risk Factors.”\n18\nTable of Contents\nIn some countries, governments have established regulatory regimes that require international card networks to be locally licensed and/or to localize aspects of their operations. For example, the Reserve Bank of India, which has broad power under the Payment and Settlement Systems Act, 2007 to regulate the membership and operations of card networks, issued a mandate requiring payment systems operators in India to store certain payments data locally. In 2021, it imposed restrictions on American Express Banking Corp. from engaging in certain card issuing activities in India, which were lifted in 2022 following significant investment in technology, infrastructure and resources to comply with the regulation. The development and enforcement of these and other similar laws, regulations and policies may adversely affect our ability to compete effectively and maintain and extend our global network.\nPrivacy, Data Protection, Data Management, Artificial Intelligence, Resiliency, Information Security and Cybersecurity\nRegulatory and legislative activity in the areas of privacy, data protection, data management, artificial intelligence, resiliency, information security and cybersecurity continues to increase worldwide. We have established, and continue to maintain, policies and a governance framework to comply with applicable privacy, data protection, data management, artificial intelligence, resiliency, information security and cybersecurity laws and requirements, meet evolving customer and industry expectations and support and enable business innovation and growth; however, our policies and governance framework may be insufficient given the size and complexity of our business and heightened regulatory scrutiny.\nOur regulators are increasingly focused on ensuring that our privacy, data protection, data management, artificial intelligence, resiliency and cybersecurity-related policies and practices are adequate to inform customers of our data collection, use, sharing and/or security practices, to provide them with choices, if required, about how we use and share their information, and to appropriately safeguard their personal information and account access. Regulators are also focused on end-to-end management of data, technology infrastructure and architecture, technology operations, resiliency and business continuity, and third-party risk management policies and practices, with regulatory expectations continuing to increase as we grow in size. For example, the EU Digital Operational Resilience Act, which applies as of January 2025, requires EU financial entities to have a comprehensive governance and risk management framework for information and communications technology risk. In addition, regulators and legislators have heightened their focus on the use of artificial intelligence and machine learning through the application of existing laws and regulations as well as by adopting new laws and regulations, such as the EU’s AI Act and state artificial intelligence legislation (e.g., Colorado AI Act). These new and emerging laws and regulations are reshaping how we develop, deploy and manage artificial intelligence systems, including by imposing new obligations related to data use, recordkeeping, transparency and human oversight.\nIn the United States, certain of our businesses are subject to the privacy, disclosure and safeguarding provisions of the Gramm-Leach-Bliley Act (GLBA) and its implementing regulations and guidance. Among other things, GLBA imposes certain limitations on our ability to share consumers’ nonpublic personal information with nonaffiliated third parties and requires us to develop, implement and maintain a written comprehensive information security program containing safeguards that are appropriate to the size and complexity of our business, the nature and scope of our activities and the sensitivity of customer information that we process. We also have expanded privacy-related obligations with respect to California residents who are not covered by GLBA, pursuant to the California Consumer Privacy Act of 2018, as amended by the California Privacy Rights Act of 2020. Various regulators and other U.S. states and territories are considering similar requirements or have adopted laws, rules and regulations pertaining to privacy and/or information security and cybersecurity that may be more stringent and/or expansive than federal requirements.\nWe are also subject to certain privacy, data protection, data management, artificial intelligence, resiliency, information security and cybersecurity laws in other countries in which we operate (including Member States in the EU, Australia, Canada, China, Japan, Hong Kong, India, Indonesia, Mexico, Singapore, Thailand and the United Kingdom), some of which are more stringent and/or expansive than those in the United States and may conflict with each other. Some jurisdictions have instituted or are considering instituting requirements that make it onerous to transfer personal data to other jurisdictions, and certain countries require in-country data processing and/or in-country storage of data. Compliance with such laws results in higher technology, administrative and other costs for us, could limit our ability to optimize the use of our data, and could require use of local technology services. Some of these laws also require us to provide foreign governments and other third parties broader access to our data and intellectual property. Data breach and operational outage notification laws or regulatory activities to encourage such notifications and regulatory activity and laws around resiliency, business continuity and third-party risk management are also becoming more prevalent in jurisdictions outside the United States in which we operate.\n19\nTable of Contents\nThe EU and UK General Data Protection Regulations (GDPR) impose legal and compliance obligations on companies that process personal data of individuals in the EU and UK, irrespective of the geographical location of the company, with the potential for significant fines for non-compliance (up to 4 percent of total annual worldwide revenue). These laws include, among other things, a requirement for prompt notice of data breaches, in certain circumstances, to affected individuals and supervisory authorities and restrictions on the cross-border transfers of EU or UK personal data. We rely on a variety of compliant transfer mechanisms to transfer this personal data, including the use of binding corporate rules and standard contractual clauses. In 2023, the EU and UK regulators approved the EU-U.S. Data Privacy Framework and the UK Data Bridge, enabling easier transfers of EU and UK personal data to participating companies in the United States. We are also subject to certain data protection laws in Member States in the EU, which may be more stringent than the EU GDPR. Our data protection programs have become the subject of heightened scrutiny in certain Member States in the EU and we continue to make changes to our privacy practices and data management to comply with these requirements.\nAnti-Money Laundering, Countering the Financing of Terrorism, Economic Sanctions and Anti-Corruption Compliance\nWe are subject to significant supervision and regulation, and an increasingly stringent enforcement environment, with respect to compliance with anti-money laundering (AML), countering the financing of terrorism (CFT), sanctions and anti-corruption laws and regulations. Failure to maintain and implement adequate programs and policies and procedures for AML/CFT, sanctions and anti-corruption compliance could have material financial, legal and reputational consequences. Additionally, our AML/CFT, sanctions and anti-corruption compliance programs may limit our ability to pursue certain business opportunities or affect our relationships with certain partners, service providers and other third parties.\nAnti-Money Laundering and Countering the Financing of Terrorism\nWe are subject to a significant number of AML/CFT laws and regulations globally. \nIn the United States, the majority of AML/CFT requirements are derived from the Currency and Foreign Transactions Reporting Act and the accompanying regulations issued by the U.S. Department of the Treasury (collectively referred to as the Bank Secrecy Act), as amended by the USA PATRIOT Act of 2001. The Anti-Money Laundering Act of 2020 (the AMLA), enacted in January 2021, amended the Bank Secrecy Act and is intended to comprehensively reform and modernize U.S. AML/CFT laws. Many of the statutory provisions in the AMLA will require additional rulemakings, reports and other measures, and the impact of the AMLA will depend on, among other things, rulemaking and implementation guidance. \nIn Europe, AML/CFT requirements are largely the result of countries transposing the 5th and 6th EU Anti-Money Laundering Directives (and preceding EU Anti-Money Laundering Directives) into local laws and regulations. Numerous other countries have also enacted or proposed new or enhanced AML/CFT legislation and regulations applicable to American Express.\nAmong other things, these laws and regulations generally require us to establish AML/CFT programs that meet certain standards, including policies and procedures to collect information from and verify the identities of our customers, and to monitor for and report suspicious transactions, in addition to other information gathering and recordkeeping requirements. Our AML/CFT programs have become the subject of heightened scrutiny and any errors, failures or delays in complying with AML/CFT laws, deficiencies in our AML/CFT programs or association of our business with money laundering, terrorist financing, tax fraud or other illicit activity can give rise to significant supervisory, criminal and civil proceedings and lawsuits, which could result in significant penalties and forfeiture of assets, loss of licenses or restrictions on business activities, or other enforcement actions.\nEconomic Sanctions\nNational governments and international bodies, such as the United Nations and the EU, have imposed economic sanctions against individuals, entities, vessels, governments, regions and countries that endanger their interests or violate international norms of behavior. Sanctions have been used to advance a range of foreign policy goals, including conflict resolution, counterterrorism, counternarcotics and promotion of democracy and human rights, among other national and international interests. We maintain a global sanctions compliance program designed to meet the requirements of applicable sanctions regimes. Failure to comply with such requirements could subject us to serious legal and reputational consequences, including criminal penalties.\nThe United States has imposed economic sanctions that affect transactions involving targeted jurisdictions, parties or activities. The U.S. Department of the Treasury’s Office of Foreign Assets Control (OFAC) administers most U.S. sanctions. OFAC regulations prohibit U.S. persons from engaging in financial transactions with or relating to, or other dealings involving, a targeted individual, entity, vessel, government or country without a license or other authorization. OFAC regulations require U.S. persons to block property and property interests of parties on OFAC’s Specially Designated Nationals and Blocked Persons List and entities owned 50 percent or more by one or more Specially Designated Nationals. Blocked property (e.g., bank deposits or other financial assets) cannot be paid out, withdrawn, set off or transferred in any manner without a license from OFAC. Regulatory authorities in other international jurisdictions, such as the United Kingdom and Member States in the EU, administer similar programs to U.S. sanction programs.\n20\nTable of Contents\nPursuant to Section 219 of the Iran Threat Reduction and Syria Human Rights Act of 2012, which added Section 13(r) to the Securities Exchange Act of 1934, as amended (the Exchange Act), an issuer is required to disclose in its annual or quarterly reports, as applicable, whether it or any of its affiliates knowingly engaged in certain activities, transactions or dealings relating to Iran or with individuals or entities designated pursuant to certain Executive Orders. Disclosure is generally required even where the activities, transactions or dealings were conducted outside the United States by non-U.S. affiliates in compliance with applicable law and whether or not the activities are sanctionable under U.S. law.\nIn 2024, we became aware that a third-party automated teller machine (ATM) network provider maintained a relationship with an Iranian bank identified on the Specially Designated Nationals and Blocked Persons list. As a result, American Express Card Members had the ability to access ATMs located outside of Iran that were operated by the Iranian bank through our ATM authorization program. We have identified approximately 37 such ATM transactions by Card Members. We had negligible gross revenues and net profits attributable to these transactions. We immediately suspended our relationship with the ATM network provider and do not intend to continue to engage in this activity.\nIn 2024, we also identified approximately 30 consumer accounts of individuals that may be, or may have been, employed by the Government of Iran. We believe the accounts were used only for personal expenses. We had negligible gross revenues and net profits attributable to these accounts. All of the accounts are closed and we do not intend to continue to engage in this activity.\nWe voluntarily reported the above transactions and accounts to OFAC.\nAnti-Corruption\nWe are subject to complex anti-corruption laws and regulations, including the U.S. Foreign Corrupt Practices Act (the FCPA), the UK Bribery Act and other laws that prohibit the making or offering of improper payments. The FCPA makes it illegal to corruptly offer or provide anything of value to foreign government officials, political parties or political party officials for the purpose of obtaining or retaining business or an improper advantage. The FCPA also requires us to strictly comply with certain accounting and internal controls standards. The UK Bribery Act also prohibits commercial bribery and the receipt of a bribe, and makes it a corporate offense to fail to prevent bribery by an associated person, in addition to prohibiting improper payments to foreign government officials. Failure by us or our colleagues, contractors or agents to comply with the FCPA, the UK Bribery Act and other similar laws can expose us and/or individual colleagues to investigation, prosecution and potentially severe criminal and civil penalties.\nCompensation Practices\nOur compensation practices are subject to oversight by the Federal Reserve and the OCC. The federal banking regulators’ guidance on sound incentive compensation practices sets forth three key principles for incentive compensation arrangements that are designed to help ensure that incentive compensation plans do not encourage imprudent risk-taking and are consistent with the safety and soundness of banking organizations. The three principles provide that a banking organization’s incentive compensation arrangements should (1) provide incentives that appropriately balance risk and financial results in a manner that does not encourage employees to expose their organizations to imprudent risks, (2) be compatible with effective internal controls and risk management and (3) be supported by strong corporate governance, including active and effective oversight by the organization’s board of directors. Any deficiencies in our compensation practices that are identified by the banking regulators in connection with their review of our compensation practices may be incorporated into our supervisory ratings, which can affect our ability to make acquisitions or perform other actions. Enforcement actions may be taken against us if our incentive compensation arrangements or related risk-management control or governance processes are determined to pose a risk to our safety and soundness, and we have not taken prompt and effective measures to correct the deficiencies.\nThe Dodd-Frank Act requires U.S. financial regulators, including the Federal Reserve and the Securities and Exchange Commission (SEC), to adopt rules on incentive-based payment arrangements at specified regulated entities having at least $1 billion in total assets. In 2016, the federal banking regulators, the SEC, the Federal Housing Finance Agency and the National Credit Union Administration proposed revised rules on incentive-based compensation practices, which were reproposed by certain of those agencies in 2024, but have not yet been finalized. If these or other regulations are adopted in a form similar to what has been proposed, they will impose limitations on the manner in which we may structure compensation for our colleagues, which could adversely affect our ability to hire, retain and motivate key colleagues.\n21\nTable of Contents\nADDITIONAL INFORMATION\nWe maintain an Investor Relations website at https://ir.americanexpress.com. We make available free of charge, on or through this website, our annual, quarterly and current reports and any amendments to those reports as soon as reasonably practicable following the time they are electronically filed with or furnished to the SEC.\nIn addition, we routinely post financial and other information, some of which could be material to investors, on our Investor Relations website. Information regarding our corporate sustainability initiatives and related disclosures are available on the Corporate Sustainability section of our website at https://go.amex/esg.\nThe content of any of our websites referred to in this report is not incorporated by reference into this report or any other report filed with or furnished to the SEC. We have included such website addresses only as inactive textual references and do not intend them to be active links.\nOur business as a whole has not experienced significant seasonal fluctuations, although billed business tends to be moderately higher in the fourth quarter than in other quarters. As a result, the amount of Card Member loans and receivables outstanding tend to be moderately higher during that quarter. Additionally, we tend to have a higher proportion of retail-related billed business in the fourth quarter, which on average has a slightly lower merchant discount rate.\n22\nTable of Contents",
  "item7": "ITEM 7.    MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS (MD&A)\nEXECUTIVE OVERVIEW\nBUSINESS INTRODUCTION\nWe are a globally integrated payments company with four reportable operating segments: U.S. Consumer Services (USCS), Commercial Services (CS), International Card Services (ICS) and Global Merchant and Network Services (GMNS). Corporate functions and certain other businesses and operations are included in Corporate & Other.\nOur range of products and services includes:\n•\nCredit card, charge card, banking and other payment and financing products\n•\nMerchant acquisition and processing, servicing and settlement, fraud prevention, and point-of-sale marketing and information products and services for merchants\n•\nNetwork services\n•\nTravel and lifestyle services\n•\nExpense management products and services\n•\nOther services, such as the design and operation of customer loyalty programs\nThe following types of revenue are generated from our various products and services:\n•\nDiscount revenue, our largest revenue source, primarily represents the amount we earn and retain from the merchant payable for facilitating transactions between Card Members and merchants on payment products issued by American Express. The amount of fees charged for accepting our cards as payment, or merchant discount, varies with, among other factors, the industry in which the merchant conducts business, the merchant’s overall American Express-related transaction volume, the method of payment, the settlement terms with the merchant, the method of submission of transactions and, in certain instances, the geographic scope for the card acceptance agreement between the merchant and us (e.g., local or global) and the transaction amount. In some instances, an additional flat transaction fee is assessed as part of the merchant discount, and additional fees may be charged such as a variable fee for card-not-present transactions or for transactions using cards issued outside the United States at merchants located in the United States;\n•\nInterest income, principally represents interest earned on outstanding loan balances;\n•\nNet card fees, represent revenue earned from annual card membership fees, which vary based on the type of card and the number of cards for each account;\n•\nService fees and other revenue, primarily represent service fees earned from merchants and other customers, foreign currency-related fees charged to Card Members, Card Member delinquency fees, travel commissions and fees, and income (losses) from our investments in which we have significant influence; and\n•\nProcessed revenue, primarily represents revenues related to network partnership agreements, comprising royalties, fees and amounts earned for facilitating transactions on cards issued by network partners.\nRefer to the “Glossary of Selected Terminology” below for the definitions of certain key terms and related information appearing within this Form 10-K and “Critical Accounting Estimates” below for a discussion of certain of our accounting policies requiring significant management assumptions and judgements.\nNON-GAAP MEASURES\nWe prepare our Consolidated Financial Statements in accordance with accounting principles generally accepted in the United States of America (GAAP). However, certain information included within this report constitutes non-GAAP financial measures. Our calculations of non-GAAP financial measures may differ from the calculations of similarly titled measures by other companies.\n43\nTable of Contents\nTABLE 1: SUMMARY OF FINANCIAL PERFORMANCE\nYears Ended December 31,\nChange\nChange\n(Millions, except percentages, per share amounts and where indicated)\n2024\n2023\n2022\n2024 vs. 2023\n2023 vs. 2022\nSelected Income Statement Data\nTotal revenues net of interest expense\n$\n65,949\n$\n60,515\n$\n52,862\n$\n5,434 \n9 \n%\n$\n7,653 \n14 \n%\nTotal revenues net of interest expense (FX-adjusted) \n(a)\n60,179\n52,833\n5,770 \n10 \n7,682 \n15 \nProvisions for credit losses\n5,185\n4,923\n2,182\n262 \n5 \n2,741 \n#\nTotal expenses\n47,869\n45,079\n41,095\n2,790 \n6 \n3,984 \n10 \nPretax income\n12,895\n10,513\n9,585\n2,382 \n23 \n928 \n10 \nIncome tax provision\n2,766\n2,139\n2,071\n627 \n29 \n68 \n3 \nNet income\n10,129\n8,374\n7,514\n1,755 \n21 \n860 \n11 \nEarnings per common share — diluted \n(b)\n$\n14.01\n$\n11.21\n$\n9.85\n$\n2.80 \n25 \n%\n$\n1.36 \n14 \n%\nSelected Balance Sheet Data\nCash and cash equivalents\n$\n40,640\n$\n46,596\n$\n33,914\n$\n(5,956)\n(13)\n%\n$\n12,682 \n37 \n%\nCard Member receivables\n59,411\n60,411\n57,613\n(1,000)\n(2)\n2,798 \n5 \nCard Member loans\n139,674\n125,995\n107,964\n13,679 \n11 \n18,031 \n17 \nCustomer deposits\n139,413\n129,144\n110,239\n10,269 \n8 \n18,905 \n17 \nLong-term debt\n$\n49,715\n$\n47,866\n$\n42,573\n$\n1,849 \n4 \n%\n$\n5,293 \n12 \n%\nCommon Share Statistics \n(c)\nCash dividends declared per common share\n$\n2.80\n$\n2.40\n$\n2.08\n$\n0.40 \n17 \n%\n$\n0.32 \n15 \n%\nAverage common shares outstanding:\nBasic\n712\n735\n751\n(23)\n(3)\n(16)\n(2)\nDiluted\n713\n736\n752\n(23)\n(3)\n%\n(16)\n(2)\n%\nSelected Metrics and Ratios\nNetwork volumes \n(billions)\n$\n1,764.8\n$\n1,680.1\n$\n1,552.8\n$\n85 \n5 \n%\n$\n127 \n8 \n%\nBilled business \n(billions)\n1,550.9\n1,459.6\n1,338.3\n91 \n6 \n121 \n9 \nTotal loans and Card Member receivables \n(d)\n208,317\n193,492\n170,993\n14,825 \n8 \n22,499 \n13 \nTotal loans and Card Member receivables (FX-adjusted) \n(a)(d)\n$\n190,826\n$\n171,594\n$\n17,491 \n9 \n%\n$\n21,898 \n13 \n%\nCard Member loans and receivables\nNet write-off rate — principal, interest and fees \n(e)\n2.3\n \n%\n2.0 \n%\n1.0 \n%\nNet write-off rate — principal only — consumer and small business \n(e)(f)\n2.0\n \n%\n1.8 \n%\n0.9 \n%\n30+ days past due as a % of total — consumer and small business \n(g)\n1.3\n \n%\n1.3 \n%\n1.1 \n%\nEffective tax rate\n21.5\n \n%\n20.3 \n%\n21.6 \n%\nReturn on average equity \n(h)\n34.6\n \n%\n31.5 \n%\n32.3 \n%\nCommon Equity Tier 1\n10.5\n \n%\n10.5 \n%\n10.3 \n%\n# Denotes a variance of 100 percent or more\n(a)\nThe foreign currency adjusted information assumes a constant exchange rate between the periods being compared for purposes of currency conversion into U.S. dollars (i.e., assumes the foreign exchange rates used to determine results for the current period apply to the corresponding prior year period against which such results are being compared). FX-adjusted Total revenues net of interest expense and Total loans and Card Member receivables are non-GAAP measures. We believe the presentation of information on a foreign currency adjusted basis is helpful to investors by making it easier to compare our performance in one period to that of another period without the variability caused by fluctuations in currency exchange rates.\n(b)\nRepresents net income, less (i) earnings allocated to participating share awards of $76 million, $64 million and $57 million for the years ended December 31, 2024, 2023 and 2022, respectively, and (ii) dividends on preferred shares of $58 million, $58 million and $57 million for the years ended December 31, 2024, 2023 and 2022, respectively. Refer to Note 16 and Note 21 to the “Consolidated Financial Statements” for further details on preferred shares and earnings per common share (EPS), respectively.\n(c)\nOur common stock trades principally on The New York Stock Exchange under the trading symbol AXP.\n(d)\nTotal loans reflects Card Member loans and Other loans.\n(e)\nWe present a net write-off rate based on principal losses only (i.e., excluding interest and/or fees) to be consistent with industry convention. In addition, as our practice is to include uncollectible interest and/or fees as part of our total provision for credit losses, a net write-off rate including principal, interest and/or fees is also presented.\n(f)\nA net write-off rate based on principal losses only is not available for corporate receivables due to system constraints.\n(g)\nFor corporate receivables, delinquency data is tracked based on days past billing status rather than days past due. Refer to Table 12 for 90+ days past billing metrics for corporate receivables.\n(h)\nReturn on average equity (ROE) is calculated by dividing (i) net income for the period by (ii) average shareholders’ equity for the period.\n44\nTable of Contents\nBUSINESS PERFORMANCE\nOur strong results for the year reflect the momentum and earnings power of our business model and our continued investments for growth. We saw record levels of annual Card Member spending, strong new card acquisitions, excellent credit performance and disciplined expense management. Net income for the year was $10.1 billion, or $14.01 per share, compared with net income of $8.4 billion, or $11.21 per share, a year ago. Our full year results reflect the sale of Accertify Inc. (Accertify), which resulted in a gain of $531 million ($479 million after tax or $0.66 per share).\nBilled business grew by 6 percent, reflecting a stable spend environment for most of the year with an acceleration in the fourth quarter. This growth was broad-based across geographies and across both G&S and T&E categories. U.S. Consumer Services billed business grew by 7 percent year-over-year, with continued strength in spending by Millennial and Gen-Z Card Members as our products continue to resonate with these cohorts. Commercial Services billed business grew by 2 percent on a year-over-year basis, reflecting continued modest growth from U.S. small and mid-sized enterprise (SME) Card Members. Spending by existing U.S. SME Card Members declined slightly year-over-year, although we saw an improvement in small business sentiment in the fourth quarter and strong new card acquisitions for the year. International Card Services billed business grew by 11 percent year-over-year (14 percent on an FX-adjusted basis), driven by continued strong growth in spend across all regions and customer types outside the United States.\n1\n The continued global expansion of our merchant network contributed to our growth, as we added millions of new merchant locations globally in 2024 and continued to increase coverage across our top international countries.\nTotal revenues net of interest expense increased 9 percent year-over-year (10 percent on an FX-adjusted basis).\n1\n Growth in billed business drove a 5 percent increase in Discount revenue, our largest revenue line. Net card fees increased 16 percent year-over-year, reflecting high levels of new card acquisitions and Card Member retention, as well as the ongoing execution of our product refresh strategy. Net interest income increased 18 percent versus the prior year, outpacing growth in Total loans and Card Member receivables of 8 percent year-over-year, primarily due to higher growth in our revolving loan balances. The growth in Total loans and Card Member receivables and revolving loan balances both moderated over the course of the year. During the fourth quarter, we reclassified $758 million of Card Member loans related to the Lowe’s small business cobrand portfolio from held for investment to held for sale (HFS).\nProvisions for credit losses increased, primarily driven by higher net write-offs, partially offset by a lower reserve build compared to last year. Net write-off and delinquency rates were relatively stable throughout the year and remain best-in-class supported by our premium global customer base, our strong focus on risk management and disciplined growth strategy.\nCard Member rewards, Card Member services and Business development expenses, which are generally correlated to volumes or are variable based on usage, collectively grew slightly faster than revenues as we continue to enhance our value propositions, drive Card Member engagement and acquire more Card Members on premium products. Marketing expense increased 16 percent year-over-year, as we invested at an elevated level in growth initiatives, including acquiring high spending, high credit-quality customers. During the year we acquired a record 13 million proprietary new cards. Operating expenses decreased 2 percent, primarily reflecting the gain recognized on the sale of Accertify and our continued operating expense discipline. We remain focused on driving marketing and operating expense efficiencies over time.\nDuring the year, we maintained our capital ratios within our current target range of 10 to 11 percent and returned $7.9 billion of capital to our shareholders in the form of share repurchases and common stock dividends. We plan to continue to return to shareholders the excess capital we generate while managing our CET1 capital ratio within our target range and supporting balance sheet growth. We also expect to increase the regular quarterly dividend on common shares outstanding by approximately 17 percent beginning with the first quarter 2025 dividend declaration. Our robust capital, funding and liquidity positions provide us with significant flexibility to maintain a strong balance sheet.\nOur performance continues to give us confidence in our business model and while we recognize the uncertainty of the geopolitical and macroeconomic environment and the evolving regulatory and competitive landscape, we remain committed to executing on our strategy to deliver sustainable and profitable long-term growth.\nSee “Supervision and Regulation” under “Business” for information on legislative and regulatory changes that could have a material adverse effect on our results of operations and financial condition and “Risk Factors” and “Cautionary Note Regarding Forward-Looking Statements” for information on potential impacts of macroeconomic, geopolitical and competitive conditions and certain litigation and regulatory matters on our business.\n1\n \nThe foreign currency adjusted information assumes a constant exchange rate between the periods being compared for purposes of currency conversion into U.S. dollars (i.e., assumes the foreign exchange rates used to determine results for the current period apply to the corresponding prior year period against which such results are being compared). FX-adjusted revenues is a non-GAAP measure. We believe the presentation of information on a foreign currency adjusted basis is helpful to investors by making it easier to compare our performance in one period to that of another period without the variability caused by fluctuations in currency exchange rates.\n45\nTable of Contents\nCONSOLIDATED RESULTS OF OPERATIONS\nThe discussions in both “Consolidated Results of Operations” and “Business Segment Results of Operations” provide commentary on the variances for the year ended December 31, 2024 compared to the year ended December 31, 2023, as presented in the accompanying tables. For a discussion of the financial condition and results of operations for 2023 compared to 2022, please refer to Part II, Item 7. “Management’s Discussion and Analysis of Financial Condition and Results of Operations” in our Annual Report on Form 10-K for the year ended December 31, 2023, filed with the SEC on February 9, 2024. \nTABLE 2: TOTAL REVENUES NET OF INTEREST EXPENSE SUMMARY \nYears Ended December 31,\nChange\nChange\n(Millions, except percentages)\n2024\n2023\n2022\n2024 vs. 2023\n2023 vs. 2022\nDiscount revenue\n$\n35,192\n \n$\n33,416 \n$\n30,739 \n$\n1,776 \n5 \n%\n$\n2,677 \n9 \n%\nNet card fees\n8,449\n \n7,255 \n6,070 \n1,194 \n16 \n1,185 \n20 \nService fees and other revenue\n5,129\n \n5,005 \n4,521 \n124 \n2 \n484 \n11 \nProcessed revenue\n1,636\n \n1,705 \n1,637 \n(69)\n(4)\n68 \n4 \nTotal non-interest revenues\n50,406\n \n47,381 \n42,967 \n3,025 \n6 \n4,414 \n10 \nTotal interest income\n23,795\n \n19,983 \n12,658 \n3,812 \n19 \n7,325 \n58 \nTotal interest expense\n8,252\n \n6,849 \n2,763 \n1,403 \n20 \n4,086 \n#\nNet interest income\n15,543\n \n13,134 \n9,895 \n2,409 \n18 \n3,239 \n33 \nTotal revenues net of interest expense\n$\n65,949\n \n$\n60,515 \n$\n52,862 \n$\n5,434 \n9 \n%\n$\n7,653 \n14 \n%\n# Denotes a variance of 100 percent or more\nTOTAL REVENUES NET OF INTEREST EXPENSE\nDiscount revenue increased, primarily driven by an increase in billed business of 6 percent. See Tables 5 and 6 for more details on billed business performance.\nNet card fees increased, primarily driven by growth in our premium card portfolios. See Table 5 for more details on proprietary new card acquisitions, proprietary cards-in-force and average fee per card.\nService fees and other revenue increased, primarily driven by increases in foreign exchange related revenues associated with Card Member cross-currency spending, loyalty coalition-related fees and merchant service fees, partially offset by Accertify revenues included in the prior year.\nProcessed revenue decreased, and was relatively flat on an FX-adjusted basis.\n2\n See Tables 5 and 6 for more details on processed volume performance.\nInterest income increased, primarily driven by growth in revolving loan balances and higher interest rates.\nInterest expense increased, primarily driven by higher interest rates paid on, and growth in, customer deposits and long-term debt.\n2\n \nRefer to footnote 1 on page 45 for details regarding foreign currency adjusted information.\n46\nTable of Contents\nTABLE 3: PROVISIONS FOR CREDIT LOSSES SUMMARY\nYears Ended December 31,\nChange\nChange\n(Millions, except percentages)\n2024\n2023\n2022\n2024 vs. 2023\n2023 vs. 2022\nCard Member loans\nNet write-offs\n$\n3,515\n \n$\n2,486 \n$\n1,066 \n$\n1,029 \n41 \n%\n$\n1,420 \n#  %\nReserve build (release) \n(a)\n594\n \n1,353 \n448 \n(759)\n(56)\n905 \n#\nTotal\n4,109\n \n3,839 \n1,514 \n270 \n7 \n2,325 \n#\nCard Member receivables\nNet write-offs\n773\n \n937 \n462 \n(164)\n(18)\n475 \n#\nReserve build (release) \n(a)\n1\n \n(57)\n165 \n58 \n#\n(222)\n#\nTotal\n774\n \n880 \n627 \n(106)\n(12)\n253 \n40\nOther\nNet write-offs — Other loans\n187\n \n107 \n22 \n80 \n75 \n85 \n#\nNet write-offs — Other receivables\n44\n \n25 \n15 \n19 \n76 \n10 \n67\nReserve build (release) — Other loans \n(a)\n69\n \n67 \n7 \n2 \n3 \n60 \n#\nReserve build (release) — Other receivables \n(a)\n2\n \n5 \n(3)\n(3)\n(60)\n8 \n#\nTotal\n302\n \n204 \n41 \n98 \n48 \n163 \n#\nTotal provisions for credit losses\n$\n5,185\n \n$\n4,923 \n$\n2,182 \n$\n262 \n5 \n%\n$\n2,741 \n#  %\n# Denotes a variance of 100 percent or more\n(a)\nRefer to the “Glossary of Selected Terminology” below for a definition of reserve build (release).\nPROVISIONS FOR CREDIT LOSSES\nCard Member loans provision for credit losses increased, primarily due to higher net write-offs driven by growth in loans outstanding, partially offset by a lower reserve build in the current year. The reserve build in the current year was primarily driven by an increase in loans outstanding. The reserve build in the prior year was primarily driven by an increase in loans outstanding and higher delinquencies.\nCard Member receivables provision for credit losses decreased, primarily due to lower net write-offs, partially offset by a reserve release in the prior year. The reserve release in the prior year was primarily driven by lower delinquencies, partially offset by an increase in receivables outstanding.\nOther provision for credit losses increased, primarily due to higher net write-offs.\n47\nTable of Contents\nTABLE 4: EXPENSES SUMMARY\nYears Ended December 31,\nChange\nChange\n(Millions, except percentages)\n2024\n2023\n2022\n2024 vs. 2023\n2023 vs. 2022\nCard Member rewards\n$\n16,599\n \n$\n15,367 \n$\n14,002 \n$\n1,232 \n8 \n%\n$\n1,365 \n10 \n%\nBusiness development\n5,886\n \n5,657 \n4,943 \n229 \n4 \n714 \n14 \nCard Member services\n4,782\n \n3,968 \n2,959 \n814 \n21 \n1,009 \n34 \nMarketing\n6,040\n \n5,213 \n5,458 \n827 \n16 \n(245)\n(4)\nSalaries and employee benefits\n8,198\n \n8,067 \n7,252 \n131 \n2 \n815 \n11 \nOther, net\n6,364\n \n6,807 \n6,481 \n(443)\n(7)\n326 \n5 \nTotal expenses\n$\n47,869\n \n$\n45,079 \n$\n41,095 \n$\n2,790 \n6 \n%\n$\n3,984 \n10 \n%\nEXPENSES\nCard Member rewards expense increased, driven by increases in Membership Rewards and cash back rewards expenses, collectively, of $705 million, and cobrand rewards expense of $527 million, all of which were primarily driven by higher billed business. In the second half of the year, the increase in Membership Rewards expense was also driven by an increase in the Ultimate Redemption Rate (URR) and slightly higher redemption costs reflecting a shift in the mix of Card Member redemptions.\nThe Membership Rewards URR for current program participants was 96 percent (rounded down) at both December 31, 2024 and 2023.\nBusiness development expense increased, primarily due to increased partner payments driven by higher network volumes, partially offset by lower client incentives and a prior-year charge related to revenue allocated to a joint venture partner.\nCard Member services expense increased, primarily due to growth in premium card accounts, contributing to a higher usage of travel-related benefits.\nMarketing expense increased, reflecting higher levels of spending on customer acquisition and other growth initiatives.\nSalaries and employee benefits expense increased, primarily driven by higher incentive and compensation costs, partially offset by lower restructuring costs.\nOther expenses decreased, primarily driven by the gain recognized on the sale of Accertify, foreign exchange-related gains and net gains on Amex Ventures investments, partially offset by an increase in legal reserves, higher professional service costs and a charge associated with an increase in international non-income tax reserves.\n48\nTable of Contents\nINCOME TAXES\nThe effective tax rate was 21.5 percent and 20.3 percent for 2024 and 2023, respectively. The increase in the effective tax rate primarily reflected discrete tax benefits in the prior year.\nTABLE 5: SELECTED CARD-RELATED STATISTICAL INFORMATION\nChange\nChange\nYears Ended December 31,\n2024\n2023\n2022\n2024 vs. 2023\n2023 vs. 2022\nNetwork volumes \n(billions)\n$\n1,764.8\n$\n1,680.1\n$\n1,552.8\n5 \n%\n8 \n%\nBilled business\n$\n1,550.9\n$\n1,459.6\n$\n1,338.3\n6 \n9 \nProcessed volumes\n$\n213.9\n$\n220.5\n$\n214.5\n(3)\n3 \nCards-in-force \n(millions)\n146.5\n141.2\n133.3\n4 \n6 \nProprietary cards-in-force\n83.6\n80.2\n76.7\n4 \n5 \nBasic cards-in-force \n(millions)\n123.3\n118.7\n111.5\n4 \n6 \nProprietary basic cards-in-force\n64.3\n61.7\n59.1\n4 \n4 \nAverage proprietary basic Card Member spending \n(dollars)\n$\n24,608\n$\n24,059\n$\n23,496\n2 \n2 \nAverage fee per card \n(dollars) \n(a)\n$\n103\n$\n92\n$\n82\n12 \n%\n12 \n%\nProprietary new cards acquired \n(millions)\n13.0\n12.2\n12.5\nDiscount revenue as a % of Billed business\n2.27%\n2.29%\n2.30%\n(a)\nAverage fee per card is computed on an annualized basis based on proprietary Net card fees divided by average proprietary total cards-in-force.\nTABLE 6: NETWORK VOLUMES-RELATED STATISTICAL INFORMATION \n2024\n2023\nYear over Year Percentage Increase\n(Decrease)\nPercentage Increase (Decrease) Assuming No Changes in FX Rates\n(a)\nYear over Year Percentage Increase\n(Decrease)\nPercentage Increase (Decrease)\nAssuming No Changes in FX Rates\n(a)\nNetwork volumes\n5\n \n%\n6\n \n%\n8 \n%\n9 \n%\nTotal billed business\n6\n \n7\n \n9 \n9 \nU.S. Consumer Services\n7\n \n10 \nCommercial Services\n2\n \n2\n \n3 \n3 \nInternational Card Services\n11\n \n14\n \n17 \n18 \nProcessed volumes\n(3)\n—\n \n3 \n6 \nMerchant industry billed business metrics\nG&S spend (73% and 72% of billed business for 2024 and 2023, respectively)\n7\n \n6\n \n6 \n6 \nT&E spend (27% and 28% of billed business for 2024 and 2023, respectively)\n5\n \n%\n8\n \n%\n19 \n%\n19 \n%\n(a)\nThe foreign currency adjusted information assumes a constant exchange rate between the periods being compared for purposes of conversion into U.S. dollars (i.e., assumes the foreign exchange rates used to determine results for the current year apply to the corresponding prior-year period against which such results are being compared).\n49\nTable of Contents\nTABLE 7: SELECTED CREDIT-RELATED STATISTICAL INFORMATION\nAs of or for the Years Ended December 31,\nChange\nChange\n(Millions, except percentages)\n2024\n2023\n2022\n2024 vs. 2023\n2023 vs. 2022\nCard Member loans and receivables:\nNet write-off rate — principal, interest and fees \n(a)\n2.3\n \n%\n2.0 \n%\n1.0 \n%\nNet write-off rate — principal only — consumer and small business \n(a)(b)\n2.0\n \n%\n1.8 \n%\n0.9 \n%\n30+ days past due as a % of total — consumer and small business \n(c)\n1.3\n \n%\n1.3 \n%\n1.1 \n%\nCard Member loans:\nCard Member loans\n$\n139,674\n \n$\n125,995 \n$\n107,964 \n11 \n%\n17 \n%\nCredit loss reserves:\nBeginning balance \n$\n5,118\n \n$\n3,747 \n$\n3,305 \n37 \n13 \nProvisions — principal, interest and fees\n4,109\n \n3,839 \n1,514 \n7 \n#\nNet write-offs — principal less recoveries\n(2,894)\n(2,043)\n(837)\n42 \n#\nNet write-offs — interest and fees less recoveries\n(621)\n(443)\n(229)\n40 \n93 \nOther \n(d)\n(33)\n18 \n(6)\n#\n#\nEnding balance\n$\n5,679\n \n$\n5,118 \n$\n3,747 \n11 \n37 \n% of loans\n4.1\n \n%\n4.1 \n%\n3.5 \n%\n% of past due\n288\n \n%\n297 \n%\n348 \n%\nAverage loans\n$\n130,758\n \n$\n114,816 \n$\n95,369 \n14 \n20 \nNet write-off rate — principal, interest and fees \n(a)\n2.7\n \n%\n2.2 \n%\n1.1 \n%\nNet write-off rate — principal only \n(a)\n2.2\n \n%\n1.8 \n%\n0.9 \n%\n30+ days past due as a % of total\n1.4\n \n%\n1.4 \n%\n1.0 \n%\nCard Member receivables:\nCard Member receivables\n$\n59,411\n \n$\n60,411 \n$\n57,613 \n(2)\n5 \nCredit loss reserves:\nBeginning balance\n$\n174\n \n$\n229 \n$\n64 \n(24)\n#\nProvisions — principal and fees\n774\n \n880 \n627 \n(12)\n40 \nNet write-offs — principal and fees less recoveries\n(773)\n(937)\n(462)\n(18)\n#\nOther \n(d)\n(4)\n2 \n— \n#\n— \nEnding balance\n$\n171\n \n$\n174 \n$\n229 \n(2)\n%\n(24)\n%\n% of receivables\n0.3\n \n%\n0.3 \n%\n0.4 \n%\nNet write-off rate — principal and fees \n(a)\n1.3\n \n%\n1.6 \n%\n0.8 \n%\nNet write-off rate — principal only — consumer and small business \n(a)(b)\n1.5\n \n%\n1.8 \n%\n0.9 \n%\n30+ days past due as a % of total — consumer and small business \n(c)\n0.9\n \n%\n1.1 \n%\n1.3 \n%\n# Denotes a variance of 100 percent or more\n(a)\nWe present a net write-off rate based on principal losses only (i.e., excluding interest and/or fees) to be consistent with industry convention. In addition, as our practice is to include uncollectible interest and/or fees as part of our total provision for credit losses, a net write-off rate including principal, interest and/or fees is also presented.\n(b)\nA net write-off rate based on principal losses only is not available for corporate receivables due to system constraints.\n(c)\nFor corporate receivables, delinquency data is tracked based on days past billing status rather than days past due. Refer to Table 12 for 90+ days past billing metrics for corporate receivables.\n(d)\nOther includes foreign currency translation adjustments.\n50\nTable of Contents\nTABLE 8: NET INTEREST YIELD ON AVERAGE CARD MEMBER LOANS\nYears Ended December 31,\n(Millions, except percentages)\n2024\n2023\n2022\nNet interest income\n$\n15,543\n \n$\n13,134 \n$\n9,895 \nExclude:\nInterest expense not attributable to our Card Member loan portfolio \n(a)\n3,599\n \n2,943 \n1,268 \nInterest income not attributable to our Card Member loan portfolio \n(b)\n(3,599)\n(2,896)\n(1,023)\nAdjusted net interest income \n(c)\n$\n15,543\n \n$\n13,181 \n$\n10,140 \nAverage Card Member loans including loans held for sale \n(d)\n$\n130,817\n \n$\n114,816 \n$\n95,369 \nNet interest income divided by average Card Member loans\n \n(c)\n11.9\n \n%\n11.4 \n%\n10.4 \n%\nNet interest yield on average Card Member loans \n(c)\n11.9\n \n%\n11.5 \n%\n10.6 \n%\n(a)\nPrimarily represents interest expense attributable to maintaining our corporate liquidity pool and funding Card Member receivables.\n(b)\nPrimarily represents interest income attributable to Other loans, interest-bearing deposits and the fixed income investment portfolios.\n(c)\nAdjusted net interest income and net interest yield on average Card Member loans are non-GAAP measures. Refer to the “Glossary of Selected Terminology” below for the definitions of these terms. We believe adjusted net interest income is useful to investors because it represents the interest expense and interest income attributable to our Card Member loan portfolio and is a component of net interest yield on average Card Member loans, which provides a measure of profitability of our Card Member loan portfolio. Net interest yield on average Card Member loans reflects adjusted net interest income divided by average Card Member loans, computed on an annualized basis. Net interest income divided by average Card Member loans, computed on an annualized basis, a GAAP measure, includes elements of total interest income and total interest expense that are not attributable to the Card Member loan portfolio, and thus is not representative of net interest yield on average Card Member loans.\n(d)\nFor purposes of the calculation of net interest yield on Card Member loans, average loans includes loans held for sale (HFS) as we continue to recognize interest income on these loans until they are sold. Refer to Note 1 to the Consolidated Financial Statements for further information on loans HFS.\n51\nTable of Contents\nBUSINESS SEGMENT RESULTS OF OPERATIONS\nWe consider a combination of factors when evaluating the composition of our reportable operating segments, including the results reviewed by the chief operating decision maker, economic characteristics, products and services offered, classes of customers, product distribution channels, geographic considerations (primarily United States versus outside the United States) and regulatory considerations. Refer to Note 24 to the “Consolidated Financial Statements” and “Business” for additional discussion of products and services that comprise each segment.\nResults of the reportable operating segments generally treat each segment as a stand-alone business. The management reporting process that derives these results allocates revenue and expense using various methodologies as described below.\nTOTAL REVENUES NET OF INTEREST EXPENSE\nWe allocate discount revenue and certain other revenues among segments using a transfer pricing methodology. Within the USCS, CS and ICS segments, discount revenue generally reflects the issuer component of the overall discount revenue generated by each segment’s Card Members; within the GMNS segment, discount revenue generally reflects the network and acquirer component of the overall discount revenue being allocated.\nNet card fees, processed revenue and certain other revenues are directly attributable to the segment in which they are reported.\nInterest and fees on loans and certain investment income is directly attributable to the segment in which it is reported. Interest expense represents an allocated funding cost based on a combination of segment funding requirements and internal funding rates.\nPROVISIONS FOR CREDIT LOSSES\nThe provisions for credit losses are directly attributable to the segment in which they are reported.\nEXPENSES\nCard Member rewards and Card Member services expenses are included in each segment based on the actual expenses incurred. Business development and Marketing expenses are included in each segment based on the actual expenses incurred. Global brand advertising is primarily allocated to the segments based on the relative levels of revenue. \nSalaries and employee benefits and other expenses reflect both costs incurred directly within each segment, as well as allocated expenses. The allocated expenses include service costs, which primarily reflect salaries and benefits associated with our technology and customer servicing groups, and overhead expenses. Service costs are allocated based on activities directly attributable to the segment, and overhead expenses are allocated based on the relative levels of revenue and Card Member loans and receivables. As a proportion of Salaries and employee benefits and other expenses, allocated costs remain relatively consistent from period to period. Increases in expenses year-over-year driven by allocated costs primarily reflect the changes in salaries and employee benefit costs and other costs related to our technology or servicing organizations and the growth in business volume within our operating segments.\n52\nTable of Contents\nU.S. CONSUMER SERVICES\nTABLE 9: USCS SELECTED INCOME STATEMENT DATA\nYears Ended December 31,\nChange\nChange\n(Millions, except percentages)\n2024\n2023\n2022\n2024 vs. 2023\n2023 vs. 2022\nRevenues\nNon-interest revenues\n$\n20,137\n \n$\n18,464 \n$\n16,440 \n$\n1,673 \n9 \n%\n$\n2,024 \n12 \n%\nInterest income\n14,430\n \n12,336 \n8,457 \n2,094 \n17 \n3,879 \n46 \nInterest expense\n3,140\n \n2,684 \n983 \n456 \n17 \n1,701 \n#\nNet interest income\n11,290\n \n9,652 \n7,474 \n1,638 \n17 \n2,178 \n29 \nTotal revenues net of interest expense\n31,427\n \n28,116 \n23,914 \n3,311 \n12 \n4,202 \n18 \nProvisions for credit losses\n3,029\n \n2,855 \n1,021 \n174 \n6\n1,834 \n#\nTotal revenues net of interest expense after provisions for credit losses\n28,398\n \n25,261 \n22,893 \n3,137 \n12 \n2,368 \n10 \nExpenses\nCard Member rewards, business development and Card Member services\n14,329\n \n12,808 \n10,791 \n1,521 \n12 \n2,017 \n19 \nMarketing\n3,051\n \n2,585 \n2,744 \n466 \n18 \n(159)\n(6)\nSalaries and employee benefits and other operating expenses\n4,641\n \n4,435 \n3,958 \n206 \n5 \n477 \n12 \nTotal expenses\n22,021\n \n19,828 \n17,493 \n2,193 \n11 \n2,335 \n13 \nPretax segment income\n$\n6,377\n \n$\n5,433 \n$\n5,400 \n$\n944 \n17 \n%\n$\n33 \n1 \n%\n# Denotes a variance of 100 percent or more\nUSCS issues a wide range of proprietary consumer cards and provides services to U.S. consumers, including travel and lifestyle services as well as banking and non-card financing products. USCS also manages our dining platform that provides digital tools for restaurants and reservation bookings for diners.\nTOTAL REVENUES NET OF INTEREST EXPENSE\nNon-interest revenues increased across all revenue categories, primarily driven by higher Discount revenue and Net card fees.\nDiscount revenue increased 7 percent, primarily driven by an increase in U.S. consumer billed business. See Tables 5, 6 and 10 for more details on billed business performance.\nNet card fees increased 18 percent, primarily driven by growth in our premium card portfolios.\nService fees and other revenue increased 5 percent, primarily driven by revenue from the sale of reward points and higher delinquency fees, partially offset by lower travel commissions and fees from our Amex Travel business.\nInterest income increased, primarily driven by growth in revolving loan balances and higher interest rates.\nInterest expense increased, primarily driven by a higher cost of funds due to segment net asset growth and higher interest rates.\nPROVISIONS FOR CREDIT LOSSES\nCard Member loans provision for credit losses increased, primarily due to higher net write-offs, partially offset by a lower reserve build in the current year. The reserve build in the current year was primarily driven by an increase in loans outstanding. The reserve build in the prior year was primarily driven by an increase in loans outstanding and higher delinquencies.\nCard Member receivables provision for credit losses decreased, primarily due to a higher reserve release and lower net write-offs in the current year. The reserve releases in both the current and prior years were primarily driven by lower delinquencies and a decrease in receivables outstanding. \nOther provision for credit losses increased, primarily due to higher net write-offs and a higher reserve build in the current year. The reserve builds in both the current and prior years were primarily driven by increases in Other loans outstanding.\n53\nTable of Contents\nEXPENSES\nTotal expenses increased, primarily driven by higher Card Member rewards, Card Member services and Marketing expenses.\nCard Member rewards expense increased, primarily driven by higher billed business. In the second half of the year, the increase in Membership Rewards expense was also driven by an increase in the URR and slightly higher redemption costs reflecting a shift in the mix of Card Member redemptions.\nBusiness development expense increased, primarily due to increased partner payments driven by higher billed business.\nCard Member services expense increased, primarily due to growth in premium card accounts, contributing to a higher usage of travel-related benefits.\nMarketing expense increased, reflecting higher levels of spending on customer acquisition and other growth initiatives.\nSalaries and employee benefits and other expenses increased, primarily due to an increase in allocated service costs.\n54\nTable of Contents\nTABLE 10: USCS SELECTED STATISTICAL INFORMATION\nAs of or for the Years Ended December 31,\nChange\nChange\n(Millions, except percentages and where indicated)\n2024\n2023\n2022\n2024 vs. 2023\n2023 vs. 2022\nBilled business \n(billions)\n$\n654.8\n$\n610.8\n$\n553.0\n7 \n%\n10 \n%\nProprietary cards-in-force\n46.3\n43.8\n41.7\n6 \n5 \nProprietary basic cards-in-force\n32.5\n30.7\n29.2\n6 \n5 \nAverage proprietary basic Card Member spending \n(dollars)\n$\n20,707\n$\n20,303\n$\n19,514\n2 \n4 \nTotal segment assets\n$\n114,228\n$\n107,158\n$\n94,444\n7 \n13 \nCard Member loans:\nTotal loans \n$\n92,632\n$\n83,207\n$\n72,660\n11 \n15 \nAverage loans \n$\n85,264\n$\n75,975\n$\n63,720\n12 \n19 \nNet write-off rate — principal, interest and fees \n(a)\n2.7\n \n%\n2.2 \n%\n1.1 \n%\nNet write-off rate — principal only \n(a)\n2.2\n \n%\n1.7 \n%\n0.9 \n%\n30+ days past due as a % of total\n1.4\n \n%\n1.4 \n%\n1.0 \n%\nCalculation of Net Interest Yield on Average Card Member Loans:\nNet interest income\n$\n11,290\n$\n9,652\n$\n7,474\nExclude:\nInterest expense not attributable to our Card Member loan portfolio\n (b)\n198\n192\n139\nInterest income not attributable to our Card Member loan portfolio\n (c)\n(557)\n(386)\n(228)\nAdjusted net interest income\n (d)\n$\n10,931\n$\n9,458\n$\n7,385\nAverage Card Member loans\n \n$\n85,264\n$\n75,975\n$\n63,720\nNet interest income divided by average Card Member loans\n (d)\n13.2\n \n%\n12.7 \n%\n11.7 \n%\nNet interest yield on average Card Member loans\n (d)\n12.8\n \n%\n12.4 \n%\n11.6 \n%\nCard Member receivables:\nTotal receivables\n \n$\n14,419\n$\n14,789\n$\n14,263\n(3)\n%\n4 \n%\nNet write-off rate — principal and fees \n(a)\n1.2\n \n%\n1.3 \n%\n0.6 \n%\nNet write-off rate — principal only \n(a)\n1.1\n \n%\n1.2 \n%\n0.6 \n%\n30+ days past due as a % of total\n0.6\n \n%\n0.8 \n%\n0.9 \n%\n(a)\nRefer to Table 7 footnote (a).\n(b)\nRefer to Table 8 footnote (a).\n(c)\nRefer to Table 8 footnote (b).\n(d)\nRefer to Table 8 footnote (c).\n55\nTable of Contents\nCOMMERCIAL SERVICES\nTABLE 11: CS SELECTED INCOME STATEMENT DATA\nYears Ended December 31,\nChange\nChange\n(Millions, except percentages)\n2024\n2023\n2022\n2024 vs. 2023\n2023 vs. 2022\nRevenues\nNon-interest revenues\n$\n13,219\n \n$\n12,931 \n$\n12,196 \n$\n288 \n2 \n%\n$\n735 \n6 \n%\nInterest income\n4,374\n \n3,328 \n2,070 \n1,046 \n31 \n1,258 \n61 \nInterest expense\n1,734\n \n1,483 \n697 \n251 \n17 \n786 \n#\nNet interest income\n2,640\n \n1,845 \n1,373 \n795 \n43 \n472 \n34 \nTotal revenues net of interest expense\n15,859\n \n14,776 \n13,569 \n1,083 \n7 \n1,207 \n9 \nProvisions for credit losses\n1,389\n \n1,313 \n565 \n76 \n6 \n748 \n#\nTotal revenues net of interest expense after provisions for credit losses\n14,470\n \n13,463 \n13,004 \n1,007 \n7 \n459 \n4 \nExpenses\nCard Member rewards, business development and Card Member services\n6,504\n \n6,332 \n6,116 \n172 \n3 \n216 \n4 \nMarketing\n1,319\n \n1,090 \n1,122 \n229 \n21 \n(32)\n(3)\nSalaries and employee benefits and other operating expenses\n3,142\n \n3,180 \n2,886 \n(38)\n(1)\n294 \n10 \nTotal expenses\n10,965\n \n10,602 \n10,124 \n363 \n3 \n478 \n5 \nPretax segment income\n$\n3,505\n \n$\n2,861 \n$\n2,880 \n$\n644 \n23 \n%\n$\n(19)\n(1)\n%\n# Denotes a variance of 100 percent or more\nCS issues a wide range of proprietary corporate and small business cards and provides services to U.S. businesses, including payment and expense management, banking and non-card financing products. CS also issues proprietary corporate cards and provides services to select global corporate clients.\nTOTAL REVENUES NET OF INTEREST EXPENSE\nNon-interest revenues increased, primarily driven by higher Discount revenue and Net card fees.\nDiscount revenue increased 2 percent, primarily driven by an increase in commercial billed business. See Tables 5, 6 and 12 for more details on billed business performance.\nNet card fees increased 12 percent, primarily driven by growth in our premium card portfolios.\nService fees and other revenue decreased 7 percent, primarily driven by lower travel commissions and fees from our Amex Travel business.\nInterest income increased, primarily driven by growth in revolving loan balances and higher interest rates.\nInterest expense increased, primarily driven by a higher cost of funds due to segment net asset growth and higher interest rates.\nPROVISIONS FOR CREDIT LOSSES\nCard Member loans provision for credit losses increased, primarily due to higher net write-offs, partially offset by a lower reserve build in the current year. The reserve build in the current year was primarily driven by an increase in loans outstanding. The reserve build in the prior year was primarily driven by an increase in loans outstanding and higher delinquencies.\nCard Member receivables provision for credit losses decreased, primarily due to lower net write-offs, partially offset by a reserve release in the prior year. The reserve release in the prior year was primarily driven by lower delinquencies and a decrease in receivables outstanding.\n56\nTable of Contents\nEXPENSES\nTotal expenses increased, primarily driven by higher Marketing and Card Member rewards expenses, partially offset by a decrease in Operating expenses and Business development expense.\nCard Member rewards expense increased, primarily driven by higher billed business and slightly higher redemption costs in the second half of the year, partially offset by a decrease in the Membership Rewards URR.\nBusiness development expense decreased, primarily due to lower client incentives, partially offset by increased partner payments due to higher billed business.\nCard Member services expense increased, primarily due to growth in premium card accounts, contributing to a higher usage of travel-related benefits.\nMarketing expense increased, reflecting higher levels of spending on customer acquisition and other growth initiatives.\nSalaries and employee benefits and other expenses decreased, primarily driven by a decrease in allocated service costs and lower restructuring costs, partially offset by higher compensation.\n57\nTable of Contents\nTABLE 12: CS SELECTED STATISTICAL INFORMATION\nAs of or for the Years Ended December 31,\nChange\nChange\n(Millions, except percentages and where indicated)\n2024\n2023\n2022\n2024 vs. 2023\n2023 vs. 2022\nBilled business \n(billions)\n$\n526.5\n$\n516.0\n$\n499.5\n2 \n%\n3 \n%\nProprietary cards-in-force\n15.4\n15.4\n14.9\n— \n3 \nAverage Card Member spending \n(dollars)\n$\n34,130\n$\n33,745\n$\n35,202\n1 \n(4)\nTotal segment assets\n$\n58,969\n$\n55,361\n$\n51,411\n7 \n8 \nCard Member loans:\nTotal loans\n$\n29,647\n$\n25,838\n$\n21,406\n15 \n21 \nAverage loans\n$\n28,518\n$\n23,877\n$\n19,271\n19 \n24 \nNet write-off rate — principal, interest and fees \n(a)\n2.7\n \n%\n2.0 \n%\n0.8 \n%\nNet write-off rate — principal only \n(a)\n2.3\n \n%\n1.7 \n%\n0.7 \n%\n30+ days past due as a % of total\n1.5\n \n%\n1.4 \n%\n0.9 \n%\nCalculation of Net Interest Yield on Average Card Member Loans:\nNet interest income\n$\n2,640\n$\n1,845\n$\n1,373\nExclude:\nInterest expense not attributable to our Card Member loan portfolio \n(b)\n765\n711\n430\nInterest income not attributable to our Card Member loan portfolio \n(c)\n(325)\n(204)\n(89)\nAdjusted net interest income \n(d)\n$\n3,080\n$\n2,352\n$\n1,714\nAverage Card Member loans including loans held for sale \n(e)\n$\n28,576\n$\n23,877\n$\n19,271\nNet interest income divided by average Card Member loans\n(d)\n9.2\n \n%\n7.7 \n%\n7.1 \n%\nNet interest yield on average Card Member loans\n(d)\n10.8\n \n%\n9.9 \n%\n8.9 \n%\nCard Member receivables:\nTotal receivables\n$\n24,945\n$\n26,222\n$\n26,876\n(5)\n%\n(2)\n%\nNet write-off rate — principal and fees \n(f)\n1.3\n \n%\n1.5 \n%\n0.7 \n%\nNet write-off rate — principal only \n(a) \n— small business\n1.9\n \n%\n2.1 \n%\n0.9 \n%\n30+ days past due as a % of total — small business\n1.3\n \n%\n1.5 \n%\n1.6 \n%\n90+ days past billing as a % of total \n(f) \n— corporate\n0.4\n \n%\n0.4 \n%\n0.6 \n%\n(a)\nRefer to Table 7 footnote (a).\n(b)\nRefer to Table 8 footnote (a).\n(c)\nRefer to Table 8 footnote (b).\n(d)\nRefer to Table 8 footnote (c).\n(e)\nRefer to Table 8 footnote (d).\n(f)\nFor corporate receivables, delinquency data is tracked based on days past billing status rather than days past due. A Card Member account is considered 90 days past billing if payment has not been received within 90 days of the Card Member’s billing statement date. In addition, if we initiate collection procedures on an account prior to the account becoming 90 days past billing, the associated Card Member receivable balance is classified as 90 days past billing. Corporate receivables delinquency data for periods other than 90+ days past billing and the net write-off rate based on principal losses only are not available due to system constraints.\n58\nTable of Contents\nINTERNATIONAL CARD SERVICES\nTABLE 13: ICS SELECTED INCOME STATEMENT DATA\nYears Ended December 31,\nChange\nChange\n(Millions, except percentages)\n2024\n2023\n2022\n2024 vs. 2023\n2023 vs. 2022\nRevenues\nNon-interest revenues\n$\n10,369\n \n$\n9,472 \n$\n8,262 \n$\n897 \n9 \n%\n$\n1,210 \n15 \n%\nInterest income\n2,331\n \n2,076 \n1,453 \n255 \n12 \n623 \n43 \nInterest expense\n1,239\n \n1,118 \n654 \n121 \n11 \n464 \n71 \nNet interest income\n1,092\n \n958 \n799 \n134 \n14 \n159 \n20 \nTotal revenues net of interest expense\n11,461\n \n10,430 \n9,061 \n1,031 \n10 \n1,369 \n15 \nProvisions for credit losses\n726\n \n727 \n584 \n(1)\n— \n143 \n24 \nTotal revenues net of interest expense after provisions for credit losses\n10,735\n \n9,703 \n8,477 \n1,032 \n11 \n1,226 \n14 \nExpenses\nCard Member rewards, business development and Card Member services\n5,243\n \n4,588 \n3,816 \n655 \n14 \n772 \n20 \nMarketing\n1,235\n \n1,081 \n1,146 \n154 \n14 \n(65)\n(6)\nSalaries and employee benefits and other operating expenses\n3,226\n \n3,061 \n2,937 \n165 \n5 \n124 \n4 \nTotal expenses\n9,704\n \n8,730 \n7,899 \n974 \n11 \n831 \n11 \nPretax segment income\n$\n1,031\n \n$\n973 \n$\n578 \n$\n58 \n6 \n%\n$\n395 \n68 \n%\nICS issues a wide range of proprietary consumer, small business and corporate cards outside the United States. ICS also provides services to our international customers, including travel and lifestyle services, and manages certain international joint ventures and our loyalty coalition business.\nTOTAL REVENUES NET OF INTEREST EXPENSE\nNon-interest revenues increased, primarily driven by higher Discount revenue and Net card fees.\nDiscount revenue increased 10 percent (13 percent on an FX-adjusted basis), primarily reflecting an increase in billed business.\n3\n See Tables 5, 6 and 14 for more details on billed business performance.\nNet card fees increased 16 percent (20 percent on an FX-adjusted basis), primarily driven by growth in our premium card portfolios.\n3\nService fees and other revenue increased 2 percent, primarily driven by higher foreign exchange related revenues associated with Card Member cross-currency spending and loyalty coalition-related fees, partially offset by a benefit in the prior year related to a portion of the revenue allocated to a joint venture partner as described in Business development expense below, as well as lower delinquency fees.\nInterest income increased, primarily driven by growth in revolving loan balances, partially offset by lower interest rates.\nInterest expense increased, primarily driven by a higher cost of funds due to segment net asset growth.\nPROVISIONS FOR CREDIT LOSSES\nCard Member loans provision for credit losses increased, primarily due to higher net write-offs, partially offset by a lower reserve build in the current year. The reserve build in the current year was primarily driven by an increase in loans outstanding, partially offset by lower delinquencies. The reserve build in the prior year was primarily driven by an increase in loans outstanding, partially offset by the performance of portfolios in certain international markets.\nCard Member receivables provision for credit losses decreased, primarily due to lower net write-offs, partially offset by a reserve build in the current year versus a reserve release in the prior year. The reserve build in the current year was primarily driven by an increase in receivables outstanding. The reserve release in the prior year was primarily driven by lower delinquencies, partially offset by an increase in receivables outstanding.\n3\n \nRefer to footnote 1 on page 45 for details regarding foreign currency adjusted information.\n59\nTable of Contents\nEXPENSES\nTotal expenses increased, primarily driven by higher Card Member rewards, Card Member services and Operating expenses.\nCard Member rewards expense increased, primarily driven by higher billed business and an increase in the Membership Rewards URR, partially offset by lower redemption costs.\nBusiness development expense increased, primarily due to increased partner payments driven by higher billed business, partially offset by a prior-year charge related to revenue allocated to a joint venture partner.\nCard Member services expense increased, primarily due to growth in premium card accounts, contributing to a higher usage of travel-related benefits.\nMarketing expense increased, reflecting higher levels of spending on customer acquisition and other growth initiatives.\nSalaries and employee benefits and other expenses increased, primarily due to a charge associated with an increase in international non-income tax reserves and higher allocated service costs, partially offset by a one-time fee from a partner.\n60\nTable of Contents\nTABLE 14: ICS SELECTED STATISTICAL INFORMATION\nAs of or for the Years Ended December 31,\nChange\nChange\n(Millions, except percentages and where indicated)\n2024\n2023\n2022\n2024 vs. 2023\n2023 vs. 2022\nBilled business \n(billions)\n$\n366.9\n$\n329.5\n$\n281.6\n11 \n%\n17 \n%\nProprietary cards-in-force\n21.9\n21.0\n20.1\n4 \n4 \nProprietary basic cards-in-force\n16.4\n15.6\n14.9\n5 \n5 \nAverage proprietary basic Card Member spending \n(dollars)\n$\n22,965\n$\n21,550\n$\n19,519\n7 \n10 \nTotal segment assets\n$\n42,879\n$\n42,234\n$\n36,891\n2 \n14 \nCard Member loans - consumer and small business:\nTotal loans\n$\n17,395\n$\n16,950\n$\n13,844\n3 \n22 \nAverage loans\n$\n16,976\n$\n14,964\n$\n12,314\n13 \n22 \nNet write-off rate — principal, interest and fees\n(a)\n2.5\n \n%\n2.5 \n%\n1.4 \n%\nNet write-off rate — principal only\n(a)\n2.1\n \n%\n2.1 \n%\n1.2 \n%\n30+ days past due as a % of total\n1.2\n \n%\n1.3 \n%\n1.2 \n%\nCalculation of Net Interest Yield on Average Card Member Loans:\nNet interest income\n$\n1,092\n$\n958\n$\n799\nExclude:\nInterest expense not attributable to our Card Member loan portfolio\n(b)\n496\n475\n270\nInterest income not attributable to our Card Member loan portfolio\n(c)\n(56)\n(62)\n(28)\nAdjusted net interest income\n(d)\n$\n1,532\n$\n1,371\n$\n1,041\nAverage Card Member loans\n$\n16,976\n$\n14,964\n$\n12,378\nNet interest income divided by average Card Member loans\n(d)\n6.4\n \n%\n6.4 \n%\n6.5 \n%\nNet interest yield on average Card Member loans\n(d)\n9.0\n \n%\n9.2 \n%\n8.4 \n%\nCard Member receivables:\nTotal receivables\n$\n20,047\n$\n19,400\n$\n16,474\n3 \n%\n18 \n%\nNet write-off rate — principal and fees\n(e)\n1.4\n \n%\n2.1 \n%\n1.3 \n%\nNet write-off rate — principal only\n(a) \n— consumer and small business\n1.5\n \n%\n2.2 \n%\n1.4 \n%\n30+ days past due as a % of total — consumer and small business\n0.8\n \n%\n1.0 \n%\n1.3 \n%\n90+ days past billing as a % of total\n(e) \n— corporate\n0.4\n \n%\n0.5 \n%\n0.5 \n%\n(a)\nRefer to Table 7 footnote (a).\n(b)\nRefer to Table 8 footnote (a).\n(c)\nRefer to Table 8 footnote (b).\n(d)\nRefer to Table 8 footnote (c).\n(e)\nFor corporate receivables, delinquency data is tracked based on days past billing status rather than days past due. A Card Member account is considered 90 days past billing if payment has not been received within 90 days of the Card Member’s billing statement date. In addition, if we initiate collection procedures on an account prior to the account becoming 90 days past billing, the associated Card Member receivable balance is classified as 90 days past billing. Corporate receivables delinquency data for periods other than 90+ days past billing and the net write-off rate based on principal losses only are not available due to system constraints.\n61\nTable of Contents\nGLOBAL MERCHANT AND NETWORK SERVICES\nTABLE 15: GMNS SELECTED INCOME STATEMENT AND OTHER DATA\nYears Ended December 31,\nChange\nChange\n(Millions, except percentages and where indicated)\n2024\n2023\n2022\n2024 vs. 2023\n2023 vs. 2022\nRevenues\nNon-interest revenues\n$\n6,729\n \n$\n6,620 \n$\n6,123 \n$\n109 \n2 \n%\n$\n497 \n8 \n%\nInterest income\n52\n \n57 \n23 \n(5)\n(9)\n34 \n#\nInterest expense\n(703)\n(719)\n(329)\n16 \n2 \n(390)\n#\nNet interest income\n755\n \n776 \n352 \n(21)\n(3)\n424 \n#\nTotal revenues net of interest expense\n7,484\n \n7,396 \n6,475 \n88 \n1 \n921 \n14 \nProvisions for credit losses\n42\n \n27 \n7 \n15 \n56 \n20 \n#\nTotal revenues net of interest expense after provisions for credit losses\n7,442\n \n7,369 \n6,468 \n73 \n1 \n901 \n14 \nExpenses\nBusiness development and Card Member services\n1,148\n \n1,218 \n1,192 \n(70)\n(6)\n26 \n2 \nMarketing\n411\n \n437 \n419 \n(26)\n(6)\n18 \n4 \nSalaries and employee benefits and other operating expenses\n1,485\n \n2,058 \n1,903 \n(573)\n(28)\n155 \n8 \nTotal expenses\n3,044\n \n3,713 \n3,514 \n(669)\n(18)\n199 \n6 \nPretax segment income\n4,398\n \n3,656 \n2,954 \n742 \n20 \n702 \n24 \nNetwork volumes\n (billions)\n1,764.8\n \n1,680.1 \n1,552.8 \n$\n85 \n5 \n$\n127 \n8 \nTotal segment assets\n$\n17,712\n \n$\n23,714 \n$\n20,005 \n(25)\n%\n19 \n%\n# Denotes a variance of 100 percent or more\nGMNS operates a global payments network that processes and settles card transactions, acquires merchants and provides multi-channel marketing programs and capabilities, services and data analytics, leveraging our global integrated network. GMNS manages our partnership relationships with third-party card issuers, merchant acquirers and a prepaid reloadable and gift card program manager, licensing the American Express brand and extending the reach of the global network.\nTOTAL REVENUES NET OF INTEREST EXPENSE\nNon-interest revenues increased, primarily driven by higher Discount revenue, partially offset by lower Processed revenue.\nDiscount revenue increased 3 percent, primarily driven by an increase in billed business, partially offset by lower average merchant discount rates. See Tables 5 and 6 for more details on billed business performance.\nService fees and other revenue increased 1 percent, primarily driven by higher merchant service fees and foreign exchange-related revenues associated with Card Member cross-currency spending, largely offset by Accertify revenues included in the prior year.\nProcessed revenue decreased 2 percent and increased 4 percent on an FX-adjusted basis.\n4\nGMNS receives an interest expense credit relating to internal transfer pricing due to its merchant payables. Net interest income decreased, primarily due to a lower interest expense credit, largely driven by a decrease in interest rates in international markets, partially offset by higher average merchant payables.\n4\n \nRefer to footnote 1 on page 45 for details regarding foreign currency adjusted information.\n62\nTable of Contents\nEXPENSES\nTotal expenses decreased, primarily driven by lower Operating expenses.\nBusiness development expense decreased, primarily due to decreased partner payments driven by lower volumes from certain network issuing partners.\nMarketing expense decreased, reflecting lower levels of spending on merchant engagement and other growth initiatives.\nSalaries and employee benefits and other expenses decreased, primarily driven by the gain recognized on the sale of Accertify included in the Other, net component of operating expenses, partially offset by an increase in allocated service costs.\n63\nTable of Contents\nCORPORATE & OTHER\nCorporate functions and certain other businesses are included in Corporate & Other.\nCorporate & Other pretax loss was $2.4 billion in both 2024 and 2023. Increases in foreign exchange gains and net gains on Amex Ventures investments year-over-year were offset largely by an increase in legal reserves.\nCONSOLIDATED CAPITAL RESOURCES AND LIQUIDITY\nOur balance sheet management objectives are to maintain:\n•\nA solid and flexible equity capital profile;\n•\nA broad, deep and diverse set of funding sources to finance our assets and meet operating requirements; and\n•\nLiquidity programs that enable us to continuously meet expected future financing obligations and business requirements for at least a twelve-month period under a variety of adverse circumstances.\nWe continue to see volatility in the capital markets due to a variety of factors and manage our balance sheet to reflect evolving circumstances.\nCAPITAL STRATEGY\nWe believe capital allocated to growing businesses with a return on risk-adjusted equity in excess of our costs will generate shareholder value. Our objective is to retain sufficient levels of capital generated through net income and other sources, such as the issuance of subordinated debt and preferred shares, as well as the exercise of stock options by colleagues, to maintain a strong balance sheet, provide flexibility to support future business growth and distribute excess capital to shareholders through dividends and share repurchases. See “Dividends and Share Repurchases” below.\nThe level and composition of our consolidated capital position are determined through our Internal Capital Adequacy Assessment Process, which takes into account our business activities, as well as marketplace conditions and requirements or expectations of credit rating agencies, regulators and shareholders, among others. As a bank holding company, we are subject to regulatory requirements administered by the U.S. federal bank regulatory agencies. The Federal Reserve has established specific capital adequacy guidelines that involve quantitative measures of assets, liabilities and certain off-balance sheet items. Failure to maintain minimum regulatory capital levels at American Express or our U.S. bank subsidiary, American Express National Bank (AENB), could affect our status as a financial holding company and cause the banking regulators with oversight of American Express or AENB to take actions that could limit our business operations.\nWe seek to maintain capital levels and ratios in excess of our minimum regulatory requirements, specifically within a 10 to 11 percent target range for American Express Company’s Common Equity Tier 1 (CET1) risk-based capital ratio.\nWe maintain certain flexibility to shift capital across our businesses as appropriate. For example, we may infuse additional capital into subsidiaries to maintain capital at targeted levels in consideration of debt ratings and regulatory requirements. These infused amounts can affect the capital and liquidity positions at American Express Company or at our subsidiaries.\nWe report our capital ratios using the Basel III capital definitions and the Basel III standardized approach for calculating risk-weighted assets.\nAs discussed above, we became a Category III firm in the third quarter of 2024 and thus are subject to a CET1 countercyclical capital buffer requirement (if enacted by the Federal Reserve) and a minimum supplementary leverage ratio. See “Supervision and Regulation — Capital and Liquidity Regulation” under “Business” for more information.\n64\nTable of Contents\nThe following table presents our regulatory risk-based capital and leverage ratios and those of AENB, as of December 31, 2024: \nTABLE 16: REGULATORY RISK-BASED CAPITAL AND LEVERAGE RATIOS\nEffective Minimum \n(a)\nRatios as of December 31, 2024\nRisk-Based Capital\nCommon Equity Tier 1\n7.0 \n%\nAmerican Express Company\n10.5 \n%\nAmerican Express National Bank\n11.6\nTier 1\n8.5\nAmerican Express Company\n11.2\nAmerican Express National Bank\n11.6\nTotal\n10.5\nAmerican Express Company\n13.2\nAmerican Express National Bank\n13.2\nTier 1 Leverage\n4.0\nAmerican Express Company\n9.8\nAmerican Express National Bank\n9.6\nSupplementary Leverage Ratio\n3.0 \n%\nAmerican Express Company\n8.3\nAmerican Express National Bank\n8.0 \n%\n(a)\nRepresents Basel III minimum requirements and applicable regulatory buffers as defined by the federal banking regulators, which includes the stress capital buffer (SCB) for American Express Company and the capital conservation buffer for AENB. Refer to “Supervision and Regulation — Capital and Liquidity Regulation” under “Business” and Note 22 to the “Consolidated Financial Statements” for additional information.\nThe following table presents American Express Company’s regulatory risk-based capital and risk-weighted assets as of December 31, 2024:\nTABLE 17: REGULATORY RISK-BASED CAPITAL COMPONENTS AND RISK-WEIGHTED ASSETS\nAmerican Express Company\n($ in Billions)\nDecember 31, 2024\nRisk-Based Capital\nCommon Equity Tier 1\n$\n24.9 \nTier 1 Capital\n26.4 \nTier 2 Capital\n4.7 \nTotal Capital\n31.1 \nRisk-Weighted Assets\n235.8 \nAverage Total Assets to calculate the Tier 1 Leverage Ratio\n268.8 \nTotal Leverage Exposure to calculate the Supplementary Leverage Ratio\n$\n317.0 \nThe following are definitions for our regulatory risk-based capital and leverage ratios, which are calculated as per standard regulatory guidance:\nRisk-Weighted Assets\n — Assets are weighted for risk according to a formula used by the Federal Reserve to conform to capital adequacy guidelines. On- and off-balance sheet items are risk weighted, with off-balance sheet items converted to balance sheet equivalents, using risk conversion factors, before being assigned a risk weight. Off-balance sheet exposures comprise a minimal part of the total risk-weighted assets.\nCommon Equity Tier 1 Risk-Based Capital Ratio\n — Calculated as CET1 capital, divided by risk-weighted assets. CET1 capital is common shareholders’ equity, adjusted for ineligible goodwill and intangible assets and certain deferred tax assets. CET1 capital is also adjusted for the CECL final rules, as described below.\n65\nTable of Contents\nTier 1 Risk-Based Capital Ratio\n — Calculated as Tier 1 capital divided by risk-weighted assets. Tier 1 capital is the sum of CET1 capital, preferred shares and third-party non-controlling interests in consolidated subsidiaries, adjusted for capital held by insurance subsidiaries. We have $1.6 billion of preferred shares outstanding to help address a portion of the Tier 1 capital requirements in excess of common equity requirements. See Note 16 to the “Consolidated Financial Statements” for additional information on our preferred shares.\nTotal Risk-Based Capital Ratio\n — Calculated as the sum of Tier 1 capital and Tier 2 capital divided by risk-weighted assets. Tier 2 capital is the sum of the allowable allowance for credit losses adjusted for the CECL final rules, and $1,750 million of eligible subordinated notes, adjusted for capital held by insurance subsidiaries. The $1,750 million of eligible subordinated notes includes the $500 million subordinated debt issued in April 2024, the $500 million subordinated debt issued in July 2023 and the $750 million subordinated debt issued in May 2022.\nTier 1 Leverage Ratio\n — Calculated as Tier 1 capital divided by average total consolidated assets for the most recent quarter.\nSupplementary Leverage Ratio\n — Calculated as Tier 1 capital divided by total leverage exposure. Total leverage exposure includes total average on-balance sheet assets and certain off-balance sheet exposures, less amounts permitted to be deducted from Tier 1 capital.\nWe elected to delay the recognition of $0.7 billion of reduction in regulatory capital from the adoption of the CECL methodology for two years, followed by a three-year phase-in period at 25 percent once per year beginning January 1, 2022, pursuant to rules issued by federal banking regulators (the CECL final rules). As of January 1, 2025, we have phased in 100 percent of such amount.\nWe continue to include accumulated other comprehensive income (loss) in regulatory capital.\nWe participated in the Federal Reserve’s supervisory stress tests in 2024. We submitted our annual capital plan to the Federal Reserve in April 2024. On August 28, 2024, the Federal Reserve confirmed our SCB of 2.5 percent, which resulted in a minimum CET1 ratio of 7 percent, effective October 1, 2024 to September 30, 2025.\nDIVIDENDS AND SHARE REPURCHASES\nWe return capital to common shareholders through dividends and share repurchases. The share repurchases reduce common shares outstanding and generally more than offset the issuance of new shares as part of employee compensation plans.\nDuring the year ended December 31, 2024, we returned $7.9 billion to our shareholders in the form of share repurchases of $5.9 billion and common stock dividends of $2.0 billion. We repurchased 23.9 million common shares at an average price of $242.65 in 2024. These dividend and share repurchase amounts collectively represent approximately 76 percent of total capital generated during the year.\nWe plan to increase the regular quarterly dividend on our common shares outstanding by 17 percent, from 70 cents to 82 cents per share, beginning with the first quarter 2025 dividend declaration.\nIn addition, during the year ended December 31, 2024, we paid $58 million in dividends on non-cumulative perpetual preferred shares outstanding. Refer to Note 16 to the “Consolidated Financial Statements” for additional information on our preferred shares.\nOur decisions on capital distributions depend on various factors, including: our capital levels and regulatory capital requirements; regulatory guidance or restrictions; actual and forecasted business results; economic and market conditions; revisions to, or revocation of, the Federal Reserve’s authorization of our capital plan; and the supervisory stress test process. We may conduct share repurchases through a variety of methods, including open market purchases, plans intended to satisfy the affirmative defense conditions of Rule 10b5-1(c) under the Exchange Act, privately negotiated transactions or other purchases, including block trades, accelerated share repurchase programs or any combination of such methods as market conditions warrant and at prices we deem appropriate. \n66\nTable of Contents\nFUNDING STRATEGY\nOur principal funding objective is to maintain broad and well-diversified funding sources to allow us to finance our global businesses and to maintain a strong liquidity profile. Our funding strategy and activities are integrated into our asset-liability management activities. We have in place a funding policy covering American Express Company and all of our subsidiaries.\nOur financing needs are in large part a consequence of our proprietary card-issuing businesses, where we generally pay merchants for card transactions prior to reimbursement by Card Members and therefore fund the merchant payments during the period Card Member loans and receivables are outstanding. In addition, we maintain a liquidity position to meet regulatory requirements and support our business activities.\nWe aim to satisfy these financing needs with a diverse set of funding sources. The diversity of funding sources by type of instrument, by tenor and by investor base, among other factors, mitigates the impact of disruptions in any one type of instrument, tenor or investor. We seek to achieve diversity and cost efficiency in our funding sources by maintaining scale and market relevance in deposits, unsecured debt and asset securitizations and access to secured borrowing facilities and a committed bank credit facility. In particular, we are focused on continuing to grow our direct deposit program as a funding source.\nOur funding plan is primarily driven by the size and mix of business asset growth, our liquidity position and choice of funding sources, as well as cash requirements generated by withdrawals of deposits by our customers, the maturities of debt outstanding and related interest payments. In executing our funding plan, we aim to maintain a balanced debt maturity profile with an appropriate mix of short-term and long-term refinancing requirements.\nFUNDING PROGRAMS AND ACTIVITIES\nWe had the following customer deposits and consolidated debt outstanding as of December 31:\nTABLE 18: SUMMARY OF CUSTOMER DEPOSITS AND CONSOLIDATED DEBT\n(Billions)\n2024\n2023\nCustomer deposits\n$\n139.4\n \n$\n129.1 \nShort-term borrowings\n1.4\n \n1.3 \nLong-term debt\n49.7\n \n47.9 \nTotal customer deposits and debt\n$\n190.5\n \n$\n178.3 \nWe may redeem from time to time certain debt securities prior to the original contractual maturity dates in accordance with the optional redemption provisions of those debt securities.\nOur funding plan for the full year 2025 includes, among other sources, approximately $9.0 billion to $13.0 billion of unsecured term debt issuance and approximately $6.0 billion to $10.0 billion of secured term debt issuance. Actual funding activities can vary from our plans due to various factors, such as future business growth, the impact of global economic, political and other events on market capacity and funding needs, demand for securities offered by us, regulatory changes, ability to securitize and sell loans and receivables, and the performance of loans and receivables previously sold in securitization transactions. Many of these factors are beyond our control.\nOur equity capital and funding strategies are designed, among other things, to maintain appropriate and stable unsecured debt ratings from the major credit rating agencies: Moody’s Investor Services (Moody’s), Standard & Poor’s (S&P) and Fitch Ratings (Fitch). Such ratings help support our access to cost-effective unsecured funding as part of our overall funding strategy. Our asset securitization activities are rated separately.\n67\nTable of Contents\nTABLE 19: UNSECURED DEBT RATINGS\nAmerican Express Entity\nMoody’s\nS&P\nFitch\nAmerican Express Company\nLong Term\nA2\nA-\nA\nShort Term\nN/R\nA-2\nF1\nOutlook\nStable\nStable\nStable\nAmerican Express Travel Related Services Company, Inc.\nLong Term\nA2\nA\nA\nShort Term\nP-1\nA-1\nF1\nOutlook\nStable\nStable\nStable\nAmerican Express National Bank\nLong Term\nA3\nA\nA\nShort Term\nP-1\nA-1\nF1\nOutlook\nStable\nStable\nStable\nAmerican Express Credit Corporation\nLong Term\nA2\nA\nA\nShort Term\nN/R\nN/R\nN/R\nOutlook\nStable\nStable\nStable\nThese ratings are not a recommendation to buy or hold any of our securities and they may be revised or revoked at any time at the sole discretion of the rating organization.\nDowngrades in the ratings of our unsecured debt or asset securitization program securities could result in higher funding costs, as well as higher fees related to borrowings under our unused credit facilities. Declines in credit ratings could also reduce our borrowing capacity in the unsecured debt and asset securitization capital markets. We believe our funding mix, including the proportion of U.S. direct deposits insured by the FDIC to total funding, should reduce the impact that credit rating downgrades would have on our funding capacity and costs.\nIn August, 2023, the U.S. federal bank regulatory agencies issued a notice of proposed rulemaking that would require covered bank holding companies such as American Express Company to issue and maintain minimum amounts of eligible external long-term debt and certain insured depository institutions such as AENB to issue and maintain minimum amounts of eligible internal long-term debt. See “Supervision and Regulation — Capital and Liquidity Regulation” under “Business” for more information.\nDEPOSIT PROGRAMS\nWe offer deposits within our U.S. bank subsidiary, AENB. These funds are currently insured up to an amount that is at least $250,000 per depositor, per ownership category through the FDIC; as of December 31, 2024, approximately 92 percent of these deposits were insured. Our ability to obtain deposit funding and offer competitive interest rates is dependent on, among other factors, the capital level of AENB. The direct deposit program offered by AENB is our primary deposit product channel, which makes FDIC-insured high-yield savings account, certificates of deposit (CDs), business checking and consumer rewards checking account products available directly to customers. As of December 31, 2024, our direct deposit program had approximately 3.3 million accounts. AENB also sources deposits through third-party distribution channels as needed to meet our overall funding objectives. CDs carry stated maturities while high-yield savings account, checking account and third-party sweep deposit products do not. We manage the duration of our maturing obligations, including CDs, to reduce concentration and refinancing risk.\nAs of December 31, 2024, we had $139.4 billion in deposits. Refer to Note 7 to the “Consolidated Financial Statements” for a further description of these deposits and scheduled maturities of certificates of deposits.\nThe following table sets forth the average interest rates we paid on different types of deposits during the years ended December 31, 2024, 2023 and 2022. Changes in the average interest rate we paid on our deposits were primarily due to the impact of higher market interest rates offered for retail deposits.\nTABLE 20: AVERAGE INTEREST RATES PAID ON DEPOSITS\nYear ended December 31,\n2024\n2023\n2022\n(Millions, except percentages)\nAverage Balance\nInterest Expense\nAverage Interest Rate\nAverage Balance\nInterest Expense\nAverage Interest Rate\nAverage Balance\nInterest Expense\nAverage Interest Rate\nSavings accounts\n$\n101,705\n \n$\n4,210\n \n4.1\n \n%\n$\n84,913 \n$\n3,320 \n3.9 \n%\n$\n70,990 \n$\n961 \n1.4 \n%\nChecking accounts\n1,677\n29\n1.7\n \n1,189\n37\n3.1 \n468\n6\n1.3 \nCertificates of deposit:\nDirect\n4,978\n211\n4.2\n \n4,407\n159\n3.6 \n1,708\n33\n1.9 \nThird-party (brokered)\n9,718\n397\n4.1\n \n13,945\n518\n3.7 \n7,649\n221\n2.9 \nSweep accounts — Third-party (brokered)\n15,419\n845\n5.5\n \n15,676\n824\n5.3 \n15,039\n301\n2.0 \nTotal U.S. interest-bearing deposits\n$\n133,497\n \n$\n5,692\n \n4.3\n \n%\n$\n120,130 \n$\n4,858 \n4.0 \n%\n$\n95,854 \n$\n1,522 \n1.6 \n%\n68\nTable of Contents\nSHORT-TERM FUNDING PROGRAMS\nShort-term borrowings, such as commercial paper, are defined as any debt with an original maturity of twelve months or less, as well as interest-bearing overdrafts with banks. Our short-term funding programs are used primarily to fund working capital needs, such as managing seasonal variations in receivables balances. The amount of short-term borrowings issued in the future will depend on our funding strategy, our needs and market conditions.\n \nWe had no commercial paper outstanding at any point during 2024. Refer to Note 8 to the “Consolidated Financial Statements” for a further description of these borrowings.\nLONG-TERM DEBT AND ASSET SECURITIZATION PROGRAMS\nAs of December 31, 2024, we had $49.7 billion in long-term debt outstanding, including unsecured debt and asset-backed securities. Refer to Note 8 to the “Consolidated Financial Statements” for a further description of these borrowings and scheduled maturities of long-term debt obligations.\nWe periodically securitize Card Member loans and receivables arising from our U.S. card business, as the securitization market provides us with cost-effective funding. Securitization of Card Member loans and receivables is accomplished through the transfer of those assets to a trust, which in turn issues securities collateralized by the transferred assets to third-party investors. The proceeds from issuance are distributed to us, through our wholly owned subsidiaries, as consideration for the transferred assets. Refer to Note 5 to the “Consolidated Financial Statements” for a further description of our asset securitizations.\nTABLE 21: DEBT ISSUANCES\n(Billions)\n2024\nAmerican Express Company:\nFloating Rate Senior Notes (compounded SOFR\n(a)\n plus weighted-average spread of 90 basis points)\n$\n1.1 \nFixed-to-Floating Rate Senior Notes (weighted-average coupon of 5.31% during the fixed rate period and compounded SOFR\n(a)\n plus weighted-average spread of 106 basis points during the floating rate period)\n7.3 \nFixed-to-Floating Rate Subordinated Notes (coupon of 5.92% during the fixed rate period and compounded SOFR\n(a) \nplus spread of 163 basis points during the floating rate period)\n0.5 \nAmerican Express Credit Account Master Trust:\nFixed Rate Class A Certificates (weighted-average coupon of 5.02%)\n3.2 \nTotal\n$\n12.1 \n(a)\nSecured overnight financing rate (SOFR).\n69\nTable of Contents\nLIQUIDITY MANAGEMENT\nOur liquidity objective is to maintain access to a diverse set of on- and off-balance sheet liquidity sources. We seek to maintain liquidity sources in amounts sufficient to meet our expected future financial obligations and business requirements for liquidity for a period of at least twelve months under a variety of adverse circumstances. These include, but are not limited to, an event where we are unable to raise new funds under our regular funding programs during a substantial weakening in economic conditions.\nOur liquidity management strategy includes a number of elements, including, but not limited to:\n•\nMaintaining diversified funding sources (refer to “Funding Strategy” above for more details);\n•\nMaintaining unencumbered liquid assets and off-balance sheet liquidity sources;\n•\nProjecting cash inflows and outflows under a variety of economic and market scenarios; and\n•\nEstablishing clear objectives for liquidity risk management, including compliance with regulatory requirements.\nWe seek to maintain access to a diverse set of on-balance sheet and off-balance sheet liquidity sources, including cash and other liquid assets, secured borrowing facilities and a committed bank credit facility. Through our U.S. bank subsidiary, AENB, we have also pledged collateral eligible for use at the Federal Reserve’s discount window.\nThe amount and type of liquidity resources we maintain can vary over time, based upon the results of stress scenarios required under the Dodd-Frank Wall Street Reform and Consumer Protection Act, as well as additional stress scenarios required under our liquidity risk policy. These stress scenarios possess distinct characteristics, varying by cash flow assumptions, time horizon and qualifying liquidity sources, among other factors. Scenarios under our liquidity risk policy include market-wide, firm-specific and combined liquidity stresses. Additionally, as discussed above, we became a Category III firm in the third quarter of 2024 and thus are subject to the regulatory requirements under LCR and NSFR rules, subject to applicable transition periods. See “Supervision and Regulation — Enhanced Prudential Standards” under “Business” for more information. We consider other factors in determining the amount and type of liquidity we maintain, such as economic and financial market conditions, seasonality in business operations, growth in our businesses, potential acquisitions or dispositions, the cost and availability of alternative liquidity sources and credit rating agency guidelines and requirements. We believe that we currently maintain sufficient liquidity to meet all internal and regulatory liquidity requirements.\nAs of December 31, 2024 and 2023, we had $40.6 billion and $46.6 billion in Cash and cash equivalents, respectively. The year-over-year decline was primarily due to the deployment of cash to fund the growth of our business. Refer to “Cash Flows” below for a discussion of the major drivers impacting cash flows for the year ended December 31, 2024. Depending on the interest rate environment, our funding composition and the amount of liquidity resources we maintain, the level of future net interest income or expense associated with our liquidity resources will vary. During 2024, interest income exceeded the interest expense associated with the liquidity portfolio. \n70\nTable of Contents\nSecuritized Borrowing Capacity\nAs of December 31, 2024, we maintained our committed, revolving, secured borrowing facility, with a maturity date of July 15, 2026, which gives us the right to sell up to $3.0 billion face amount of eligible AAA notes from the American Express Issuance Trust II (the Charge Trust). We also maintained our committed, revolving, secured borrowing facility, with a maturity date of September 15, 2026, which gives us the right to sell up to $3.0 billion face amount of eligible AAA certificates from the American Express Credit Account Master Trust (the Lending Trust). These facilities enhance our contingent funding resources and are also used in the ordinary course of business to fund working capital needs. As of December 31, 2024, no amounts were drawn on the Charge Trust facility or the Lending Trust facility.\nCommitted Bank Credit Facility\nAs of December 31, 2024, we maintained a committed syndicated bank credit facility of $4.0 billion with a maturity date of October 30, 2026. The availability of the credit facility is subject to our maintenance of a minimum CET1 risk-based capital ratio of 4.5 percent, with certain restrictions in relation to either accessing the facility or distributing capital to common shareholders in the event our CET1 risk-based capital ratio falls between 4.5 percent and 6.5 percent. It does not contain a material adverse change clause, which might otherwise preclude borrowing under the facility, nor is it dependent on our credit rating. As of December 31, 2024, we were in compliance with the covenants contained in the credit facility and no amounts were drawn on this facility. This facility enhances our contingent funding resources and is also used in the ordinary course of business to fund working capital needs. Any undrawn portion of this facility could serve as a backstop for the amount of commercial paper outstanding.\nOther Sources of Liquidity\nIn addition to cash and other liquid assets and the secured borrowing facilities and committed bank credit facility described above, as an insured depository institution, AENB may borrow from the Federal Reserve Bank of San Francisco through the discount window against the U.S. credit card loans and charge card receivables that it pledged.\nAs of December 31, 2024, AENB had available borrowing capacity of $76.9 billion based on the amount and collateral valuation of receivables that were pledged to the Federal Reserve Bank of San Francisco. Whether specific assets will be considered qualifying collateral and the amount that may be borrowed against the collateral remain at the discretion of the Federal Reserve and can change from time to time. Due to regulatory restrictions, liquidity generated by AENB can generally be used only to fund obligations within AENB, and transfers to the parent company or non-bank affiliates may be subject to prior regulatory approval.\nOff-balance Sheet Arrangements\nWe have certain off-balance sheet obligations that include guarantees, indemnifications and certain Card Member and partner arrangements that may have a material current or future effect on our financial condition, changes in financial condition, results of operations, or liquidity and capital resources. For more information on these obligations, refer to Note 12, Note 15 and Note 23 to the “Consolidated Financial Statements.”\n71\nTable of Contents\nCASH FLOWS\nThe following table summarizes our cash flow activity, followed by a discussion of the major drivers impacting operating, investing and financing cash flows for the year ended December 31, 2024 compared to the year ended December 31, 2023:\nTABLE 22: CASH FLOWS\n(Billions)\n2024\n2023\n2022\nTotal cash provided by (used in):\nOperating activities\n$\n14.0\n \n$\n18.5 \n$\n21.1 \nInvesting activities\n(24.4)\n(24.4)\n(33.7)\nFinancing activities\n4.4\n \n18.4 \n24.5 \nEffect of foreign currency exchange rates on cash and cash equivalents\n—\n \n0.2 \n— \nNet (decrease) increase in cash and cash equivalents\n$\n(6.0)\n$\n12.7 \n$\n11.9 \nCash Flows from Operating Activities\nOur cash flows from operating activities primarily include net income adjusted for (i) non-cash items included in net income, such as provisions for credit losses, depreciation and amortization, stock-based compensation, deferred taxes and other non-cash items and (ii) changes in the balances of operating assets and liabilities, which can vary significantly in the normal course of business due to the amount and timing of payments.\nIn 2024, the net cash provided by operating activities was driven by cash generated from net income for the period, partially offset by lower net operating liabilities, primarily driven by lower book overdrafts due to timing differences arising in the ordinary course of business.\nIn 2023, the net cash provided by operating activities was primarily driven by cash generated from net income for the period and higher net operating liabilities, primarily driven by higher book overdrafts due to timing differences arising in the ordinary course of business and higher accounts payable to merchants.\nCash Flows from Investing Activities\nOur cash flows from investing activities primarily include changes in loans and Card Member receivables, as well as changes in our available-for-sale investment securities portfolio.\nIn both 2024 and 2023, the net cash used in investing activities was primarily driven by higher Loans and Card Member receivables outstanding, partially offset by net maturities of investment securities.\nCash Flows from Financing Activities\nOur cash flows from financing activities primarily include changes in customer deposits, long-term debt and short-term borrowings, as well as dividend payments and share repurchases.\nIn both 2024 and 2023, the net cash provided by financing activities was primarily driven by growth in customer deposits and net proceeds from long-term debt, partially offset by share repurchases and dividend payments.\n72\nTable of Contents\nRISK MANAGEMENT\nGOVERNANCE\nRisk management is overseen by our Board of Directors through three Board committees: the Risk Committee, the Audit and Compliance Committee, and the Compensation and Benefits Committee. Each committee consists entirely of independent directors and provides regular reports to the full Board regarding matters reviewed at their committee. The committees meet regularly in private sessions with our Chief Risk Officer, the Chief Compliance Officer, the Chief Audit Executive and other senior management with regard to our risk management processes, risk profile and performance, controls, talent and capabilities. The Board monitors the “tone at the top,” our risk culture, and oversees emerging and strategic risks.\nWe use our comprehensive Enterprise Risk Management (ERM) program to identify, aggregate, monitor, measure, report and manage risks. The program also defines our risk appetite, governance, culture and capabilities. The implementation and execution of the ERM program is headed by our Chief Risk Officer. The Risk Committee reviews and concurs with the appointment, replacement, performance and compensation of our Chief Risk Officer and receives regular updates from the Chief Risk Officer on key risks and exposures.\nThe Risk Committee of our Board of Directors provides oversight of our ERM framework, processes and methodologies. The Risk Committee approves our ERM and select other risk policies. The ERM policy defines and governs risk governance, risk oversight and risk appetite, including credit risk (at both the individual and institutional levels), operational risk (e.g., operations and process, legal, conduct, third-party, information technology, information security, data management, privacy and people risks), compliance risk, reputational risk, market risk, funding and liquidity risk, model risk, strategic and business risk and country risk. The ERM policy also guides the monitoring of emerging risks, as appropriate. Risk appetite defines the authorized risk limits to control exposures within our risk capacity and risk tolerance, including stressed forward-looking scenarios. In addition, it establishes principles for risk taking in the aggregate and for each risk type, and is supported by a comprehensive system for monitoring performance (including limits and escalation triggers) and assessing control programs. On an ongoing basis, the Risk Committee reviews our risk profile against the tolerances specified in the Risk Appetite Framework, including significant risk exposures, risk trends in our portfolios and major risk concentrations.\nThe Risk Committee also provides oversight of our compliance with Regulatory capital and liquidity standards, and our Internal Capital Adequacy Assessment Process, including the CCAR submissions.\nThe Audit and Compliance Committee of our Board of Directors reviews and approves compliance policies, which include our Compliance Risk Tolerance Statement. In addition, the Audit and Compliance Committee reviews the effectiveness of our Corporate-wide Compliance Risk Management Program. More broadly, this committee is responsible for assisting the Board in its oversight responsibilities relating to the integrity of our financial statements and financial reporting process, internal and external auditing, including the qualifications and independence of the independent registered public accounting firm and the performance of our internal audit services function, and the integrity of our systems of internal controls.\nThe Audit and Compliance Committee provides oversight of our Internal Audit Group. The Audit and Compliance Committee reviews and concurs with the appointment, replacement, performance and compensation of our Chief Audit Executive, who reports to the Audit and Compliance Committee, and approves Internal Audit’s annual audit plan, charter, policies, budget and staffing levels, and overall risk assessment methodology. The Audit and Compliance Committee also receives regular updates on the audit plan’s status and results, including significant reports issued by Internal Audit and the status of our corrective actions.\nThe Compensation and Benefits Committee of our Board of Directors works with the Chief Risk Officer to ensure our overall compensation programs, as well as those covering our risk-taking employees, appropriately balance risk with business incentives and that business performance is achieved without taking imprudent or excessive risk. Our Chief Risk Officer is actively involved in setting risk goals for the Company. Our Chief Risk Officer also reviews the risk profiles of each business unit and, in conjunction with the Chief Audit Executive, provides input into performance evaluation through the Risk Performance Program. The Chief Risk Officer meets with the Compensation and Benefits Committee and attests whether performance goals and results have been achieved without taking imprudent risks. The Compensation and Benefits Committee uses a risk-balanced incentive compensation framework to decide on our bonus pools and the compensation of senior executives.\n73\nTable of Contents\nThere are several internal management committees, including the Enterprise Risk Management Committee (ERMC), chaired by our Chief Risk Officer. The ERMC is the highest-level management committee to oversee all firm-wide risks and is responsible for risk governance, risk oversight and risk appetite. It maintains the enterprise-wide risk appetite framework and monitors compliance with limits and escalations defined in it. The ERMC oversees implementation of risk policies Company-wide. The ERMC reviews key risk exposures, trends and concentrations, significant compliance matters, and provides guidance on the steps to monitor, control and report major risks. In addition, the Asset Liability Committee, chaired by our Chief Financial Officer, is responsible for managing our capital, funding and liquidity, investment, market risk and asset/liability activities in accordance with our policies and in compliance with applicable regulatory requirements.\nAs defined in the ERM policy, we follow the “three lines of defense” approach to risk management. The first line of defense comprises functions and management committees directly initiating risk taking. The Chief Executive Officer, business unit presidents and the Chief Financial Officer are part of the first line of defense. The second line comprises independent functions overseeing risk-taking activities of the first line. The Chief Risk Officer, the Chief Compliance Officer, the Chief Operational Risk Officer and certain control groups, both at the enterprise level and within regulated entities, are part of the second line of defense. The global risk oversight team oversees the policies, strategies, frameworks, models, processes and capabilities deployed by the first line teams and provides challenges and independent assessments on how the first line of defense is managing risks. Our Internal Audit Group constitutes the third line of defense and provides independent assessments and effective challenge of the first and second lines of defense.\nCREDIT RISK MANAGEMENT PROCESS\nWe define credit risk as loss due to default or changes in the credit quality of a customer, obligor or security. Our credit risks are divided into two broad categories: individual and institutional. Each has distinct risk management profiles, capabilities, strategies, and tools. Business units that create individual or institutional credit risk exposures of significant importance are supported by dedicated risk management teams, each led by a Chief Credit Officer.\nIndividual Credit Risk\nIndividual credit risk arises from consumer and small business charge cards, credit cards, and term loans. These portfolios consist of millions of customers across multiple geographies, industries and levels of net worth. We benefit from the high-quality profile of our customers, which is driven by our brand, premium customer servicing, product features and risk management capabilities, which span underwriting, customer management and collections. The risk in these portfolios is generally correlated to broad economic trends, such as unemployment rates and gross domestic product (GDP) growth.\nThe business unit leaders and their Chief Credit Officers take the lead in managing the credit risk process. These Chief Credit Officers are guided by the Individual Credit Risk Committee (ICRC), which is responsible for implementation and enforcement of the Individual Credit Risk Management Policy. The ICRC ensures compliance with ERMC guidelines and procedures and escalates to the ERMC as appropriate. \nCredit risk management is supported by sophisticated proprietary scoring and decision-making models that use up-to-date information on prospects and customers, such as spending and payment history and data feeds from credit bureaus. We have developed data-driven economic decision logic for customer interactions to better serve our customers.\nInstitutional Credit Risk\nInstitutional credit risk arises principally within our CS, ICS and GMNS businesses, as well as investment and liquidity management activities. Unlike individual credit risk, institutional credit risk is characterized by a lower loss frequency but higher severity. It is affected both by general economic conditions and by client-specific events. The absence of large losses in any given year or over several years is not necessarily representative of the level of risk of institutional portfolios, given the infrequency of loss events in such portfolios.\n74\nTable of Contents\nSimilar to individual credit risk, business units taking institutional credit risks are supported by Chief Credit Officers. These officers are guided by the Institutional Risk Management Committee (IRMC), which is responsible for implementation and enforcement of the Institutional Credit Risk Management Policy and for providing guidance to the credit officers of each business unit with substantial institutional credit risk exposures. The committee, along with the business unit Chief Credit Officers, makes investment decisions in core risk capabilities, ensures proper implementation of the underwriting standards and contractual rights for risk mitigation, monitors risk exposures, and determines risk mitigation actions. The IRMC formally reviews large institutional risk exposures to ensure compliance with ERMC guidelines and procedures and escalates them to the ERMC as appropriate. At the same time, the IRMC provides guidance to the business unit risk management teams to optimize risk-adjusted returns on capital. A centralized risk rating unit provides risk assessment of our institutional obligors.\nOPERATIONAL RISK MANAGEMENT PROCESS\nWe consider operational risk to be the risk of loss due to, among other things, inadequate or failed processes, people or information systems, or impacts from the external environment, including failures to comply with laws and regulations as well as impacts from relationships with third parties. Operational risk is inherent in all business activities and can impact an organization through direct or indirect financial loss, brand damage, customer dissatisfaction, or legal and regulatory penalties.\nTo appropriately measure and manage operational risk, we have implemented a comprehensive operational risk framework that is defined in the Operational Risk Management Policy approved by the ERMC. The Operational Risk Management Committee (ORMC), chaired by the Chief Operational Risk Officer, coordinates with all control groups on effective risk assessments and controls. It also oversees the preventive, responsive and mitigation efforts by control management teams in the business units and staff groups.\nWe use the operational risk framework to identify, measure, monitor and report inherent and emerging operational risks. The framework includes programs established for risk management activities related to processes and the launch of new products and services. The framework also defines guidelines and risk management requirements for the (a) identification of issues and operational risk events, (b) related control enhancements and (c) reporting of key trends and escalation of risks. Outcomes from the operational risk framework are discussed and escalated to various risk management committees and incorporated within our accountability framework for executive compensation.\nInformation Security and Cybersecurity\nWe define information security and cybersecurity risk as the risk that the confidentiality, integrity or availability of American Express information and information systems are impacted by unauthorized or unintended access, use, disclosure, modification or destruction.\nOur Technology Risk and Information Security (TRIS) program, which is our enterprise information security and cybersecurity program, is designed to (i) ensure the security, confidentiality, integrity and availability of our information and information systems; (ii) protect against any anticipated threats or hazards to the security, confidentiality, integrity or availability of such information; and (iii) protect against unauthorized access to or use of such information that could result in substantial harm or inconvenience to us, our colleagues or our customers. The program is built upon a foundation of advanced security technology, employs a highly trained team of experts, and is designed to operate in alignment with global regulatory requirements. The TRIS program includes controls designed to identify, protect, detect, respond to and recover from information security and cybersecurity incidents. We continue to assess the risks and changes in the cyber environment, invest in enhancements to our cybersecurity capabilities and engage in industry and government forums to promote advancements in our cybersecurity capabilities as well as the broader financial services cybersecurity ecosystem.\nSee “Cybersecurity” and “\nA major information or cybersecurity incident or an increase in fraudulent activity could lead to reputational damage to our brand and material legal, regulatory and financial exposure, and could reduce the use and acceptance of our products and services\n” under “Risk Factors” for additional information.\n75\nTable of Contents\nInformation Technology\nWe define information technology risk as the risk that events or circumstances could compromise the processing, stability, capacity, performance, or resilience of information technology and cause financial, reputational, and/or regulatory impacts.\nWe manage information technology risk through our policies, procedures, governance structure, and control framework to preserve the confidentiality, integrity, and availability of systems and processes across our Company.\nSee “\nThe uninterrupted operation of our information systems is critical to our success and a significant disruption could have a material adverse effect on our business and results of operations\n” under “Risk Factors” for additional information.\nPrivacy \nWe define privacy risk as the risk of financial loss, reputational damage, or regulatory or legal action resulting from decisions related to the violation of applicable laws, rules, regulations, contractual obligations, or the non-adherence to privacy policies, disclosures, or standards that apply to the processing of personal data.\nThe Global Privacy Policy, which establishes the privacy framework and defines the American Express Data Protection & Privacy Principles, governs the way we collect, use, store, share, transmit, delete or otherwise process our customer and colleague personal data globally. Chaired by the Chief Privacy Officer, the Privacy Risk Management Committee, a sub-committee of the ORMC, provides oversight and governance for our privacy program.\nData Management and Governance\nWe define data management and governance risk as the risk of financial, reputational, and/or regulatory impacts due to inadequate data governance and/or data management practices adversely impacting the accuracy, completeness, timeliness, comprehensiveness or usability of data throughout its lifecycle. \nOur Enterprise Data Governance Policy establishes the framework for defining in-scope critical data and the requirements for managing such data effectively throughout its lifecycle as a critical corporate asset. This policy is approved by the ERMC. \nChaired by the Chief Data Officer, our Enterprise Data Committee, a sub-committee of the ERMC, provides governance and oversight for our enterprise-wide data governance and management activities.\nThird Party Risk\nWe define third party risk as the risk that relationships with third parties (including their significant subcontractors) create unexpected outcomes and deviations from expectations or stated obligations. The Third Party Management Policy is approved by the Risk Committee of our Board and the ERMC. It sets forth the procurement, risk management, and contracting framework for managing third-party relationships commensurate with their risk and complexity. Our Third Party Lifecycle Management program sets guidelines for identifying, measuring, monitoring, and reporting the risk associated with third parties through the life cycle of the relationships, which includes planning, due diligence and third-party selection, contracting, ongoing monitoring and termination.\nConduct Risk\nWe define conduct risk as the risk that colleagues, intentionally or unintentionally, fail to fulfill their responsibilities to American Express, our customers, colleagues or stakeholders in a manner consistent with our Code of Conduct, policies and values as well as applicable laws and regulations. Conduct issues also have the potential to increase several other risk types, including reputational risk, which may undermine the integrity and trust upon which our brand is built. \nThe Conduct Risk Management Policy is approved by the ERMC. It establishes the governance framework for conduct risk across the Company. The policy requires annual risk assessments, implementation of detective and preventive controls, colleague training and timely escalations of conduct issues. It also provides guidance on consequence management for any substantiated cases of misconduct. The Conduct Risk Committee oversees conduct risk related topics and escalates such matters to the ERMC, as appropriate.\n76\nTable of Contents\nCOMPLIANCE RISK MANAGEMENT PROCESS\nWe define compliance risk as the risk of legal or reputational harm, fines, monetary penalties and payment of damages or other forms of sanction as a result of non-compliance with applicable laws and/or regulations, internal policies and procedures and related practices, or ethical standards.\nWe view our ability to effectively mitigate compliance risk as an important aspect of our business model. Our Global Compliance and Ethics organization is responsible for establishing and maintaining our corporate-wide Compliance Risk Management Program. Pursuant to this program, we seek to manage and mitigate compliance risk by assessing, controlling, monitoring, measuring and reporting the legal and regulatory risks to which we are exposed. The Compliance Risk Management Committee (CRMC), chaired by the Chief Compliance Officer, is responsible for identifying, evaluating, managing, and escalating compliance risks. The CRMC has a dual reporting relationship to both the Risk Committee (through the ERMC) and the Audit and Compliance Committee.\nAdditionally, we have a comprehensive Anti-Money Laundering program that monitors and reports suspicious activity to the appropriate government authorities. The program includes an independent risk assessment of the rules used by the Anti-Money Laundering team.\nREPUTATIONAL RISK MANAGEMENT PROCESS\nWe define reputational risk as the risk that negative stakeholder reaction to our products, services, client and partner relationships, business activities and policies, management and workplace culture, or our response to unexpected events, could cause sustained critical media coverage, a decline in revenue or investment, talent attrition, litigation, or government or regulatory scrutiny.\nWe view protecting our reputation for excellent customer service, trust, security and high integrity as core to our vision of providing the world’s best customer experience and fundamental to our long-term success.\nOur business leaders are responsible for considering the reputational risk implications of business activities and strategies and ensuring the relevant subject matter experts are engaged as needed. The ERMC is responsible for ensuring reputational risk considerations are included in the scope of appropriate subordinate risk policies and committees and properly reflected in all decisions escalated to the ERMC.\nMARKET RISK MANAGEMENT PROCESS\nWe define market risk as the risk to earnings or asset and liability values resulting from movements in market prices. Our market risk exposures include (i) interest rate risk due to changes in the relationship between the interest rates on our assets (such as loans, receivables and investment securities) and the interest rates on our liabilities (such as debt and deposits) and (ii) foreign exchange risk related to transactions, funding, investments and earnings in currencies other than the U.S. dollar.\nOur risk policies establish the framework that guides and governs market risk management, including quantitative limits and escalation triggers. These policies are approved by the ERMC, Asset Liability Committee or Market Risk Management Committee.\nMarket risk is managed by the Market Risk Management Committee. The Market Risk Oversight Officer provides an independent risk assessment and oversight over the policies and exposure management for market risk and Asset Liability Management activities.\nInterest Rate Risk\nWe analyze a variety of interest rate scenarios to inform us of the potential impacts from interest rate changes on earnings and the value of assets, liabilities and the economic value of equity. Our interest rate exposure can vary over time as a result of, among other things, the proportion of our total funding provided by variable and fixed-rate debt and deposits compared to our Card Member loans and receivables. Interest rate swaps are used from time to time to effectively convert debt issuances to variable-rate from fixed-rate, or vice versa. Refer to Note 13 to the “Consolidated Financial Statements” for further discussion of our derivative financial instruments.\n77\nTable of Contents\nTo measure the sensitivity of net interest income to interest rate changes, we first project net interest income over the following twelve-month time horizon considering forecasted business growth and anticipated future market interest rates. The impact from rate changes is then measured by instantaneously increasing or decreasing the anticipated future interest rates by the amounts set forth in Table 23 below. Our current net interest income sensitivity analysis shows higher interest rates would have a detrimental impact on our net interest income. Our estimated repricing risk assumes that our interest-rate sensitive assets and liabilities that reprice within the twelve-month horizon generally reprice by the same magnitude, subject to applicable interest rate caps or floors, as benchmark rates change. It is further assumed that, within our interest-rate sensitive liabilities, certain deposits reprice at lower magnitudes than benchmark rate movements, and the magnitude of this repricing in turn could depend on, among other factors, the direction of rate movements. These assumptions are consistent with historical deposit repricing experience in the industry and within our own portfolio. Actual changes in our net interest income will depend on many factors, and therefore may differ from our estimated risk to changes in market interest rates.\nTABLE 23: SENSITIVITY ANALYSIS OF INTEREST RATE CHANGES ON ANNUAL NET INTEREST INCOME AS OF DECEMBER 31, 2024\n(Millions)\nInstantaneous Parallel Rate Shocks \n(a)\n+200bps\n+100bps\n-100bps\n-200bps\n$\n(560)\n$\n(224)\n$\n225 \n$\n457 \n(a)\nNegative values represent a reduction in net interest income.\nWe use economic value of equity to inform us of the potential impacts from interest rate changes on the net present value of our assets and liabilities under a variety of interest rate scenarios. Economic value of equity is calculated based on our existing assets, liabilities and derivatives, and does not incorporate projected changes in our balance sheet. Key assumptions used in this calculation include the term structure of interest rates, as well as deposit repricing and liquidation profiles used to inform duration and cash flow schedules. The economic value of equity is calculated under multiple interest rate scenarios, including baseline and immediate upward and immediate downward interest rate shocks, to assess its sensitivity to changes in interest rates. Our current sensitivity profile demonstrates that our economic value of equity generally decreases in a declining interest rate scenario and increases in an increasing interest rate scenario. The level of this sensitivity is managed within board-approved policy limits.\nForeign Exchange Risk\nForeign exchange exposures arise in four principal ways: (1) Card Member spending in currencies that are not the billing currency, (2) cross-currency transactions and balances from our funding activities, (3) cross-currency investing activities, such as in the equity of foreign subsidiaries, and (4) revenues generated and expenses incurred in foreign currencies, which impact earnings.\nThese foreign exchange risks are managed primarily by entering into foreign exchange spot transactions or hedged with foreign exchange forward contracts when the hedge costs are economically justified and in notional amounts designed to offset pretax impacts from currency movements in the period in which they occur. As of December 31, 2024, foreign currency derivative instruments with total notional amounts of approximately $43 billion were outstanding.\nWith respect to Card Member spending and cross-currency transactions, including related foreign exchange forward contracts outstanding, the impact of a hypothetical 10 percent strengthening of the U.S. dollar would have been immaterial to projected earnings as of December 31, 2024. With respect to translation exposure of foreign subsidiary equity balances, including related foreign exchange forward contracts outstanding, a hypothetical 10 percent strengthening of the U.S. dollar would result in an immaterial reduction in other comprehensive income and equity as of December 31, 2024. With respect to anticipated earnings denominated in foreign currencies for the next twelve months, the adverse impact on pretax income of a hypothetical 10 percent strengthening of the U.S. dollar, net of hedges, would be approximately $136 million as of December 31, 2024.\nThe actual impact of interest rate and foreign exchange rate changes will depend on, among other factors, the timing of rate changes, the extent to which different rates do not move in the same direction or in the same direction to the same degree, changes in the cost, volume and mix of our hedging activities and changes in the volume and mix of our businesses.\n78\nTable of Contents\nFUNDING & LIQUIDITY RISK MANAGEMENT PROCESS\nWe define funding and liquidity risk as our inability to meet our ongoing financial and business obligations at a reasonable cost as they become due.\nOur Board-approved Liquidity Risk Policy establishes the framework that guides and governs liquidity risk management.\nFunding and liquidity risk is managed by the Funding and Liquidity Committee. To manage this risk, we seek to maintain access to a diverse set of cash, readily-marketable securities and contingent sources of liquidity, such that we can continuously meet our business requirements and expected future financing obligations for at least a twelve-month period under a variety of adverse circumstances. These include, but are not limited to, an event where we are unable to raise new funds under our regular funding programs during a substantial weakening in economic conditions. We consider the trade-offs between maintaining too much liquidity, which can be costly and limit financial flexibility, and having inadequate liquidity, which may result in financial distress during a liquidity event.\nFunding and liquidity risk is managed at an aggregate consolidated level as well as at certain subsidiaries in order to ensure that sufficient and accessible liquidity resources are maintained. The Funding and Liquidity Committee reviews forecasts of our aggregate and subsidiary cash positions and financing requirements, approves funding plans designed to satisfy those requirements under normal and stressed conditions, establishes guidelines to identify the amount of liquidity resources required and monitors positions and determines any actions to be taken.\nOur liquidity risk management processes are designed in alignment with regulatory guidelines. As a Category III firm under U.S. federal bank regulatory agencies’ rules, we are subject to heightened capital, liquidity and prudential requirements, including more stringent liquidity risk management requirements. See “Supervision and Regulation – Capital and Liquidity Regulation” under “Business” for more information.\nMODEL RISK MANAGEMENT PROCESS\nWe define model risk as the risk of adverse consequences, such as financial loss, poor business and strategic decision making, damage to our reputation or customer harm, from decisions based on incorrect or misused model outputs and outcomes.\nThe Enterprise-Wide Model Risk Policy establishes the comprehensive framework for governing model risk. This policy is approved by the ERMC. The comprehensive risk management and governance framework includes procedures for model development, independent model validation, model risk reporting and change management capabilities that seek to minimize erroneous model methodology, outputs, and misuse. We also assess model performance and model- related issues on an ongoing basis and seek to address deficiencies in a timely manner. In addition, we utilize artificial intelligence and machine learning (AI/ML) models, including Generative AI tools, for a variety of business use cases. We perform extensive reviews and testing to reduce the risk that these AI/ML techniques result in adverse consequences.\nSTRATEGIC AND BUSINESS RISK MANAGEMENT PROCESS\nWe define strategic and business risk as the risk related to our inability to achieve our business objectives due to poor strategic decisions, including decisions related to the launch or modification of products, mergers, acquisitions, and divestitures, poor implementation of strategic decisions or declining demand for our products and services.\nStrategic decisions are reviewed and approved by business leaders and various committees and must be aligned with company policies. We seek to manage strategic and business risks through risk controls embedded in these processes as well as overall risk management oversight over business goals. Launch of key new products as well as existing product performance is reviewed periodically by committees and business leaders to inform business decisions as appropriate. Mergers, acquisitions and divestitures can only be approved following Executive Committee due diligence, a comprehensive risk assessment by operational, market, credit and oversight leaders provided to the Chief Risk Officer and approval by either the Chief Risk Officer or appropriate risk committees. All new and material changes to products and services are reviewed and approved by the New Products Committee and appropriate credit or risk committees.\n79\nTable of Contents\nCOUNTRY RISK MANAGEMENT PROCESS\nWe define country risk as the risk that economic, social, and/or political conditions and events in a country present. They might adversely impact us, primarily as a result of greater credit losses, increased operational or market risk or the inability to repatriate capital.\nWe manage country risk as part of the normal course of business. Policies and procedures establish country risk escalation thresholds to control and limit exposure, driven by processes that enable the monitoring of conditions in countries where we have exposure.\nEMERGING RISKS \nWe also identify, monitor and report on emerging risks through our risk governance framework. Emerging risks arise due to changes in the external environment or internal initiatives and may manifest across multiple risk types. For example, climate-related risk is currently identified as an emerging risk and may manifest as credit risk, operational risk, market risk, liquidity risk or other risk types. Emerging risks are monitored and reported periodically to members of management, as well as to the ERMC and the Risk Committee of our Board of Directors.\n80\nTable of Contents\nCRITICAL ACCOUNTING ESTIMATES\nRefer to Note 1 to the “Consolidated Financial Statements” for a summary of our significant accounting policies. Certain of our accounting policies requiring significant management assumptions and judgments are as follows:\nRESERVES FOR CARD MEMBER CREDIT LOSSES\nReserves for Card Member credit losses represent our best estimate of the expected credit losses in our outstanding portfolio of Card Member loans and receivables as of the balance sheet date. The CECL methodology requires us to estimate lifetime expected credit losses by incorporating historical loss experience, as well as current and future economic conditions over a reasonable and supportable period (R&S Period) beyond the balance sheet date.\nIn estimating expected credit losses, we use a combination of statistically based models and analysis of the results produced by these models to determine the quantitative and qualitative components of our total balance sheet reserves for credit losses. These quantitative and qualitative components entail a significant amount of judgment. The primary areas of judgment used in measuring the quantitative components of our reserves relate to the determination of the appropriate R&S Period, the modeling of the probability of and exposure at default, and the methodology to incorporate current and future economic conditions. We use these models and assumptions, combined with historical loss experience, to determine the reserve rates that are applied to the outstanding loan or receivable balances to produce our reserves for expected credit losses for the R&S Period. The qualitative component is intended to capture expected losses that may not have been fully captured in the quantitative component. Through an established governance structure, we consider certain external and internal factors, including emerging portfolio characteristics and trends, which consequentially may increase or decrease the reserves for Card Member credit losses.\nThe R&S Period, which is approximately three years, represents the maximum time-period beyond the balance sheet date over which we can reasonably estimate expected credit losses, using all available portfolio information, current economic conditions and forecasts of future economic conditions. Card Member loan products do not have a contractual term and balances can revolve if minimum required payments are made, causing some balances to remain outstanding beyond the R&S Period. To determine expected credit losses beyond the R&S Period, we immediately revert to long-term average loss rates. Card Member receivable products are contractually required to be paid in full; therefore, we have assumed the balances will be either paid or written-off no later than 180 days past due.\nWithin the R&S Period, our models use past loss experience and current and future economic conditions to estimate the probability of default, exposure at default and expected recoveries to estimate net losses at default. A significant area of judgment relates to how we apply future Card Member payments to the reporting period balances when determining the exposure at default. The nature of revolving loan products inherently includes a relationship between future payments and spend behavior, which creates complexity in the application of how future payments are either partially or entirely attributable to the existing balance at the end of the reporting period. Using historical customer behavior and other factors, we have assumed that future payments are first allocated to interest and fees associated with the reporting period balance and future spend. We then allocate a portion of the payment to the estimated higher minimum payment amount due because of any future spend. Any remaining portion of the future payment is then allocated to the remaining reporting period balance.\nCECL requires that the R&S Period include an assumption about current and future economic conditions. We incorporate multiple macroeconomic scenarios provided to us by an independent third party. The estimated credit losses calculated from each macroeconomic scenario are reviewed each period and weighted to reflect management’s judgment about uncertainty surrounding these scenarios. These macroeconomic scenarios contain certain variables, including unemployment rates and real GDP, that are significant to our models.\n81\nTable of Contents\nMacroeconomic Sensitivity\nTo demonstrate the sensitivity of estimated credit losses to the macroeconomic scenarios, we compared our modeled estimates under a baseline scenario to that under a pessimistic downside scenario. As of December 31, 2024, for every 10 percentage points change in weighting from the baseline scenario to the pessimistic downside scenario, the estimated credit losses increased by approximately $230 million.\nThe modeled estimates under these scenarios were influenced by the duration, severity and timing of changes in economic variables within each scenario and these macroeconomic scenarios, under different conditions or using different assumptions, could result in significantly different estimated credit losses. It is difficult to estimate how potential changes in specific factors might affect the estimated credit losses, and current results may not be indicative of the potential future impact of macroeconomic forecast changes.\nIn addition, this sensitivity analysis relates only to the modeled credit loss estimates under two scenarios without considering management’s judgment on the relative weighting for those and other scenarios, including the weight that has been placed on the downside scenario at the balance sheet date, or any potential changes in other adjustments to the quantitative reserve component or the impact of management judgment for the qualitative reserve component, which may have a positive or negative effect on the results. Thus, the results of this sensitivity analysis are hypothetical and are not intended to estimate or reflect our expectations of any changes in the overall reserves for credit losses due to changes in the macroeconomic environment.\nRefer to Note 3 to the “Consolidated Financial Statements” for further information on the range of macroeconomic scenario key variables used, in conjunction with other inputs described above, to calculate reserves for Card Member credit losses.\nThe process of estimating these reserves requires a high degree of judgment. To the extent our expected credit loss models are not indicative of future performance, actual losses could differ significantly from our judgments and expectations, resulting in either higher or lower future provisions for credit losses in any period.\n82\nTable of Contents\nLIABILITY FOR MEMBERSHIP REWARDS\nThe Membership Rewards program is our largest card-based rewards program. Card Members can earn points for purchases charged on their enrolled card products. A significant portion of our cards, by their terms, allow Card Members to earn bonus points for purchases at merchants in particular industry categories. Membership Rewards points are redeemable for a broad variety of rewards, including, but not limited to, travel, shopping, gift cards, and statement credits. Points typically do not expire, and there is no limit on the number of points a Card Member may earn. Membership Rewards expense is driven by charge volume on enrolled cards, customer participation in the program and contractual arrangements with redemption partners.\nWe record a Membership Rewards liability that represents our best estimate of the cost of points earned that are expected to be redeemed by Card Members in the future. The Membership Rewards liability is impacted over time by enrollment levels, attrition, the volume of points earned and redeemed, and the associated redemption costs. We estimate the Membership Rewards liability by determining the URR and the weighted average cost (WAC) per point, which are applied to the points of current enrollees. Refer to Note 9 to the “Consolidated Financial Statements” for additional information.\nThe URR assumption is used to estimate the number of points earned by current enrollees that will ultimately be redeemed in future periods. We use statistical and actuarial models to estimate the URR of points earned to date by current Card Members based on redemption trends, card product type, enrollment tenure, card spend levels and credit attributes. The WAC per point assumption is used to estimate future redemption costs and is primarily based on redemption choices made by Card Members, reward offerings by partners, and Membership Rewards program changes. The WAC per point assumption is derived from 12 months of redemptions and is adjusted as appropriate for certain changes in redemption costs that are not representative of future cost expectations and expected developments in redemption patterns.\nWe periodically evaluate our liability estimation process and assumptions based on changes in cost per point redeemed, partner contract changes and developments in redemption patterns, which may be impacted by product refreshes, changes in redemption options and mix of proprietary cards-in-force.\nThe process of estimating the Membership Rewards liability includes a high degree of judgment. Actual redemptions and associated redemption costs could differ significantly from our estimates, resulting in either higher or lower Membership Rewards expense.\nChanges in the Membership Rewards URR and WAC per point have the effect of either increasing or decreasing the liability through the current period Membership Rewards expense by an amount estimated to cover the cost of all points previously earned but not yet redeemed by current enrollees as of the end of the reporting period. As of December 31, 2024, an increase in the estimated URR of current enrollees of 25 basis points would increase the Membership Rewards liability and corresponding rewards expense by approximately $197 million. Similarly, an increase in the WAC per point of 1 basis point would increase the Membership Rewards liability and corresponding rewards expense by approximately $220 million.\nGOODWILL RECOVERABILITY\nGoodwill represents the excess of acquisition cost of an acquired business over the fair value of assets acquired and liabilities assumed. Goodwill is not amortized but is tested for impairment at the reporting unit level annually or when events or circumstances arise, such as adverse changes in the business environment, that would more likely than not reduce the fair value of the reporting unit below its carrying value. Our methodology for conducting this goodwill impairment testing contains both a qualitative and quantitative assessment.\nWe have the option to initially perform an assessment of qualitative factors in order to determine whether it is more likely than not that the fair value of a reporting unit is less than its carrying amount. The qualitative factors may include, but are not limited to, economic conditions, industry and market considerations, cost factors, overall financial performance of the reporting unit and other company and reporting unit-specific events. If we determine that it is more likely than not that the fair value of a reporting unit is less than its carrying amount, we then perform the impairment evaluation using a more detailed quantitative assessment. We could also directly perform this quantitative assessment for any reporting unit, bypassing the qualitative assessment.\n83\nTable of Contents\nOur methodology for conducting the quantitative goodwill impairment testing is fundamentally based on the measurement of fair value for our reporting units, which inherently entails the use of significant management judgment. For valuation, we use a combination of the income approach (discounted cash flows) and market approach (market multiples) in estimating the fair value of our reporting units.\nWhen preparing discounted cash flow models under the income approach, we estimate future cash flows using the reporting unit’s internal multi-year forecast, and a terminal value calculated using a growth rate that we believe is appropriate in light of current and expected future economic conditions. To discount these cash flows we use our expected cost of equity, determined using a capital asset pricing model. When using the market method under the market approach, we apply comparable publicly traded companies’ multiples (e.g., earnings, revenues) to our reporting units’ operating results. The judgment in estimating forecasted cash flows, discount rates and market comparables is significant, and imprecision could materially affect the fair value of our reporting units.\nWe could be exposed to an increased risk of goodwill impairment if future operating results or macroeconomic conditions differ significantly from management’s current assumptions.\nINCOME TAXES\nWe are subject to the income tax laws of the United States, its states and municipalities and those of the foreign jurisdictions in which we operate. These tax laws are complex, and the manner in which they apply to the taxpayer’s facts is sometimes open to interpretation. In establishing a provision for income tax expense, we must make judgments about the application of inherently complex tax laws.\nUnrecognized Tax Benefits\nWe establish a liability for unrecognized tax benefits, which are the differences between a tax position taken or expected to be taken in a tax return and the benefit recognized in the financial statements.\nIn establishing a liability for an unrecognized tax benefit, assumptions may be made in determining whether, and the extent to which, a tax position should be sustained. A tax position is recognized only when it is more likely than not to be sustained upon examination by the relevant taxing authority, based on its technical merits. The amount of tax benefit recognized is the largest benefit that we believe is more likely than not to be realized on ultimate settlement. As new information becomes available, we evaluate our tax positions and adjust our unrecognized tax benefits, as appropriate\n.\nTax benefits ultimately realized can differ from amounts previously recognized due to uncertainties, with any such differences generally impacting the provision for income tax.\nDeferred Tax Asset Realization\nDeferred tax assets and liabilities are determined based on the differences between the financial statement and tax bases of assets and liabilities using the enacted tax rates expected to be in effect for the years in which the differences are expected to reverse.\nSince deferred taxes measure the future tax effects of items recognized in the Consolidated Financial Statements, certain estimates and assumptions are required to determine whether it is more likely than not that all or some portion of the benefit of a deferred tax asset will not be realized. In making this assessment, we analyze and estimate the impact of future taxable income, reversing temporary differences and available tax planning strategies. These assessments are performed quarterly, taking into account any new information.\nChanges in facts or circumstances can lead to changes in the ultimate realization of deferred tax assets due to uncertainties.\n84\nTable of Contents\nOTHER MATTERS\nRECENTLY ADOPTED AND ISSUED ACCOUNTING STANDARDS\nRefer to the Recently Adopted and Issued Accounting Standards section of Note 1 to the “Consolidated Financial Statements.”\nGLOSSARY OF SELECTED TERMINOLOGY\nAdjusted net interest income\n — A non-GAAP measure that represents net interest income attributable to our Card Member loans (which includes, on a GAAP basis, interest that is deemed uncollectible), excluding the impact of interest expense and interest income not attributable to our Card Member loans.\nAllocated service costs \n— Represents salaries and benefits associated with our technology and customer servicing groups, allocated based on activities directly attributable to our reportable operating segments, as well as overhead expenses, which are allocated to our reportable operating segments based on their relative levels of revenue and Card Member loans and receivables.\nAsset securitizations\n — Asset securitization involves the transfer and sale of loans or receivables to a special-purpose entity created for the securitization activity, typically a trust. The trust, in turn, issues securities, commonly referred to as asset-backed securities that are secured by the transferred loans and receivables. The trust uses the proceeds from the sale of such securities to pay the purchase price for the transferred loans or receivables. The securitized loans and receivables of our Lending Trust and Charge Trust (collectively, the Trusts) are reported as assets and the securities issued by the Trusts are reported as liabilities on our Consolidated Balance Sheets.\nBilled business\n (Card Member spending) — Represents transaction volumes (including cash advances) on payment products issued by American Express.\nCapital ratios\n — Represents the minimum standards established by regulatory agencies as a measure to determine whether the regulated entity has sufficient capital to absorb on- and off-balance sheet losses beyond current loss accrual estimates. Refer to “Consolidated Capital Resources and Liquidity — Capital Strategy” above for further related definitions under Basel III.\nCard Member\n — The individual holder of an issued American Express-branded card.\nCard Member loans\n — Represents balances on our credit card products and revolve-eligible balances on our charge card products.\nCard Member receivables\n — Represents balances on our charge card products that need to be paid in full on or before the Card Member’s payment due date.\nCards-in-force\n — Represents the number of cards that are issued and outstanding by American Express (proprietary cards-in-force) and cards issued and outstanding under network partnership agreements with banks and other institutions, except for retail cobrand cards issued by network partners that had no out-of-store spending activity during the prior twelve months. \nBasic cards-in-force\n excludes supplemental cards issued on consumer accounts. Cards-in-force is useful in understanding the size of our Card Member base.\nCharge cards\n — Represents cards that generally carry no pre-set spending limits and are primarily designed as a method of payment and not as a means of financing purchases. Each transaction on a charge card with no pre-set spending limit is authorized based on its likely economics reflecting a Card Member’s most recent credit information and spend patterns. Charge Card Members must pay the full amount of balances billed each month, with the exception of balances that can be revolved under lending features offered on certain charge cards, such as Pay Over Time and Plan It\n®\n, that allow Card Members to pay for eligible purchases with interest over time.\nCobrand cards\n — Represents cards issued under cobrand agreements with selected commercial partners. Pursuant to the cobrand agreements, we make payments to our cobrand partners, which can be significant, based primarily on the amount of Card Member spending and corresponding rewards earned on such spending and, under certain arrangements, on the number of accounts acquired and retained. The partner is then liable for providing rewards to the Card Member under the cobrand partner’s own loyalty program.\n85\nTable of Contents\nCredit cards\n — Represents cards that have a range of revolving payment terms, structured payment features (e.g., Plan It, Expanded Buying Power), grace periods, and rate and fee structures.\nDiscount revenue\n — Primarily represents the amount we earn and retain from the merchant payable for facilitating transactions between Card Members and merchants on payment products issued by American Express.\nGoods & Services (G&S) spend\n — Includes spend in merchant categories other than T&E-related merchant categories, which includes B2B spending by small and mid-sized enterprise customers in our CS and ICS segments.\nInterest expense\n — Includes interest incurred primarily to fund Card Member loans and receivables, general corporate purposes and liquidity needs. Interest expense is divided principally into two categories: (i) deposits, which primarily relates to interest expense on deposits taken from customers and institutions, and (ii) debt, which primarily relates to interest expense on our long-term financing and short-term borrowings, (e.g., commercial paper, federal funds purchased, bank overdrafts and other short-term borrowings), as well as the realized impact of derivatives hedging interest rate risk on our long-term debt.\nInterest income\n — Includes (i) interest on loans, (ii) interest and dividends on investment securities and (iii) interest income on deposits with banks and other.\nInterest on loans\n — Assessed using the average daily balance method for Card Member loans. Unless the loan is classified as non-accrual, interest is recognized based upon the principal amount outstanding in accordance with the terms of the applicable account agreement until the outstanding balance is paid or written off.\nInterest and dividends on investment securities\n — Primarily relates to our performing fixed-income securities. Interest income is recognized using the effective interest method, which adjusts the yield for security premiums and discounts, fees and other payments, so a constant rate of return is recognized on the outstanding balance of the related investment security throughout its term. Amounts are recognized until securities are in default or when it is likely that future interest payments will not be made as scheduled.\nInterest income on deposits with banks and other\n — Primarily relates to the placement of cash in excess of near-term funding requirements in interest-bearing time deposits, overnight sweep accounts, and other interest-bearing demand and call accounts.\nLoyalty coalitions \n— Programs that enable consumers to earn rewards points and use them to save on purchases from a variety of participating merchants through multi-category rewards platforms. Merchants in these programs generally fund the consumer offers and are responsible to us for the cost of rewards points; we earn revenue from operating the loyalty platform and by providing marketing support.\nNet card fees\n — Represents the card membership fees earned during the period recognized as revenue over the covered card membership period (typically one year), net of the provision for projected refunds for Card Membership cancellation and deferred acquisition costs.\nNet interest yield on average Card Member loans —\n A non-GAAP measure that is computed by dividing adjusted net interest income by average Card Member loans, computed on an annualized basis. Reserves and net write-offs related to uncollectible interest are recorded through provision for credit losses and are thus not included in the net interest yield calculation.\nNet write-off rate\n — \nprincipal only\n — Represents the amount of proprietary consumer or small business Card Member loans or receivables written off, consisting of principal (resulting from authorized transactions), less recoveries, as a percentage of the average loan or receivable balance during the period.\nNet write-off rate\n — \nprincipal, interest and fees\n — Includes, in the calculation of the net write-off rate, amounts for interest and fees in addition to principal for Card Member loans, and fees in addition to principal for Card Member receivables.\nNetwork volumes\n — Represents the total of billed business and processed volumes.\nOperating expenses\n — Represents salaries and employee benefits, professional services, data processing and equipment, and other expenses.\nOther loan\ns — Represents balances on non-card payment and financing products that are not associated with a Card Member agreement, and instead are governed by a separate borrowing relationship. Other loans consist primarily of consumer installment loans and lines of credit offered to small business customers.\n86\nTable of Contents\nProcessed revenue\n — Represents revenues related to network partnership agreements, comprising royalties, fees and amounts earned for facilitating transactions on cards issued by network partners. Processed revenue also includes fees earned on alternative payment solutions facilitated by American Express.\nProcessed volumes\n \n— Represents transaction volumes (including cash advances) on cards issued under network partnership agreements with banks and other institutions, including joint ventures, as well as alternative payment solutions facilitated by American Express.\nProprietary new cards acquired\n \n— Represents the number of new cards issued by American Express during the referenced period, net of replacement cards. Proprietary new cards acquired is useful as a measure of the effectiveness of our customer acquisition strategy.\nReserve build (release) \n— Represents the portion of the provisions for credit losses for the period related to increasing or decreasing reserves for credit losses as a result of, among other things, changes in volumes, macroeconomic outlook, portfolio composition and credit quality of portfolios. Reserve build represents the amount by which the provision for credit losses exceeds net write-offs, while reserve release represents the amount by which net write-offs exceed the provision for credit losses.\nT&E spend\n — Represents spend on travel and entertainment, which primarily includes airline, cruise, lodging and dining merchant categories.\n87\nTable of Contents\nCAUTIONARY NOTE REGARDING FORWARD-LOOKING STATEMENTS\nThis report includes forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995, which are subject to risks and uncertainties. The forward-looking statements, which address our current expectations regarding business and financial performance, among other matters, contain words such as “believe,” “expect,” “anticipate,” “intend,” “plan,” “aim,” “will,” “may,” “should,” “could,” “would,” “likely,” “estimate,” “potential,” “continue” and similar expressions. Readers are cautioned not to place undue reliance on these forward-looking statements, which speak only as of the date on which they are made. We undertake no obligation to update or revise any forward-looking statements. Factors that could cause actual results to differ materially from these forward-looking statements, include, but are not limited to, the following:\n•\nour ability to grow earnings per share in the future, which will depend in part on revenue growth, credit performance and the effective tax rate remaining consistent with current expectations and our ability to continue investing at high levels in areas that can drive sustainable growth (including our brand, value propositions, coverage, marketing, technology and talent), controlling operating expenses, effectively managing risk and executing our share repurchase program, any of which could be impacted by, among other things, the factors identified in the subsequent paragraphs as well as the following: macroeconomic conditions, higher rates of unemployment, changes in interest rates, effects of inflation, tariffs, supply chain issues, energy costs and fiscal and monetary policies; geopolitical instability, hostilities and tensions, such as involving China and the United States; the impact of any future contingencies, including, but not limited to, legal costs and settlements, the imposition of fines or monetary penalties, increases in Card Member remediation, investment gains or losses, restructurings, impairments and changes in reserves; issues impacting brand perceptions and our reputation; impacts related to acquisitions, cobrand and other partner agreements, portfolio sales and joint ventures; and the impact of regulation and litigation, which may be heightened due to the uncertain regulatory environment and could affect the profitability of our business activities, limit our ability to pursue business opportunities, require changes to business practices or alter our relationships with Card Members, partners and merchants;\n•\nour ability to grow revenues net of interest expense and the sustainability of our future growth, which could be impacted by, among other things, the factors identified above and in the subsequent paragraphs, as well as the following: spending volumes and the spending environment not being consistent with expectations, including a decline in spending by U.S. small and mid-sized enterprise Card Members or slowdowns in U.S. consumer or international spending volumes; an inability to address competitive pressures, attract and retain customers, invest in and enhance our Membership Model of premium products, differentiated services and partnerships, successfully refresh our card products, grow spending and lending with customers across age cohorts, including Millennial and Gen Z customers, and implement strategies and business initiatives, including within the premium consumer space, commercial payments and the global network; the effects of regulatory initiatives, including pricing and network regulation; merchant coverage growing less than expected or the reduction of merchant acceptance or the perception of coverage; increased surcharging, steering, suppression or differential acceptance of our products; merchant discount rates changing from our expectations; and changes in foreign currency exchange rates;\n•\nnet card fees not performing consistently with expectations, which could be impacted by, among other things, a decrease in the ability and desire of Card Members to pay card fees, such as due to a deterioration in macroeconomic conditions; higher Card Member attrition rates; the pace of Card Member acquisition activity and demand for our fee-based products; and our inability to address competitive pressures, develop attractive premium value propositions and implement our strategy of refreshing card products and realize our anticipated growth from those refreshes, enhancing and delivering benefits and services and continuing to innovate with respect to our products;\n•\nnet interest income, the effects of changes in interest rates and the growth of loans and Card Member receivables outstanding and revolving balances, being higher or lower than expectations, which could be impacted by, among other things, the behavior and financial strength of Card Members and their actual spending, borrowing and paydown patterns; the effectiveness of our strategies to enhance Card Member value propositions, capture a greater share of Card Members’ spending and borrowings and attract new, and retain existing, customers; our ability to effectively manage underwriting risk; changes in benchmark interest rates, including where such changes affect our assets or liabilities differently than expected; changes in capital and credit market conditions and the availability and cost of capital; credit actions, including line size and other adjustments to credit availability; the yield on Card Member loans not remaining consistent with current expectations; and our deposit levels or the interest rates we offer on deposits changing from current expectations; loss or impacts to cobrand relationships; and governmental actions to cap interest rates;\n88\nTable of Contents\n•\nfuture credit performance, the level of future delinquency, reserve and write-off rates and the amount and timing of future reserve builds and releases, which will depend in part on macroeconomic factors such as unemployment rates, GDP and the volume of bankruptcies; the ability and willingness of Card Members to pay amounts owed to us; changes in loans and receivables outstanding, such as from the implementation of our strategy to capture spending and borrowings, or from changes in consumer behavior that affect loan and receivable balances (e.g., paydown and revolve rates); changes in the levels of customer acquisitions and the credit profiles of new customers acquired; the enrollment in, and effectiveness of, financial relief programs and the performance of accounts as they exit from such programs; the impact of the usage of debt settlement companies; and collections capabilities and recoveries of previously written-off loans and receivables;\n•\nthe actual amount to be spent on Card Member rewards and services and business development, and the relationship of these variable customer engagement costs to revenues, which could be impacted by continued changes in macroeconomic conditions and Card Member behavior as it relates to their spending patterns (including the level of spend in bonus categories), the redemption of rewards and offers (including travel redemptions) and usage of travel-related benefits; the costs related to reward point redemptions; further enhancements to our rewards programs and product benefits, including to make them attractive to Card Members and prospective customers, potentially in a manner that is not cost-effective; new and renegotiated contractual obligations with business partners, which may be affected by business partners with greater scale and leverage; our ability to identify and negotiate partner-funded value for Card Members; and the pace and cost of the expansion of our global lounge collection;\n•\nthe actual amount we spend on marketing in the future and the effectiveness and efficiency of our marketing spend, which will be based in part on continued changes in the macroeconomic and competitive environment and business performance, including the levels of demand for our products; management’s decisions regarding the timing of spending on marketing and the effectiveness of management’s investment optimization process, management’s identification and assessment of attractive investment opportunities; management’s ability to develop premium value propositions and drive customer demand, including continued customer spend growth and retention; the receptivity of Card Members and prospective customers to advertising and customer acquisition initiatives; and our ability to realize marketing efficiencies and balance expense control and investments in the business;\n•\nour ability to control operating expenses, including relative to revenue growth, and the actual amount we spend on operating expenses in the future, which could be impacted by, among other things, salary and benefit expenses to attract and retain talent; our ability to realize operational efficiencies, including through increased scale and automation and continued adoption of artificial intelligence technologies; management’s decisions regarding spending in such areas as technology, business and product development, sales force, premium servicing and digital capabilities; our ability to innovate efficient channels of customer interactions and the willingness of Card Members to self-service and address issues through digital channels; restructuring activity; fraud costs; inflation; supply chain issues; expenses related to control management and compliance and consulting, legal and other professional services fees, including as a result of litigation or internal and regulatory reviews; regulatory assessments; the level of M&A activity and related expenses; information security or cybersecurity incidents; the payment of fines, penalties, disgorgement, restitution, non-income tax assessments and litigation-related settlements; the performance of Amex Ventures and other of our investments; impairments of goodwill or other assets; and the impact of changes in foreign currency exchange rates on costs;\n•\nour tax rate not remaining consistent with expectations, which could be impacted by, among other things, further changes in tax laws and regulation (or the expiration of provisions of tax laws or regulations), the implementation of the OECD’s global minimum tax guidelines by jurisdictions, our geographic mix of income, unfavorable tax audits, assessments and tax litigation outcomes;\n•\nchanges affecting our plans regarding the return of capital to shareholders, including increasing the level of the dividend, which will depend on factors such as our capital levels and regulatory capital ratios; the results of our stress testing and capital planning process and new rulemakings and guidance from the Federal Reserve and other banking regulators, including changes to regulatory capital requirements, such as from the U.S. federal bank regulatory agencies’ Basel III rulemaking; our results of operations and financial condition; our credit ratings and rating agency considerations; required company approvals; and the economic environment and market conditions in any given period;\n•\nchanges in the substantial and increasing worldwide competition in the payments industry, including competitive pressure and competitor settlements and mergers that may materially impact the prices charged to merchants that accept American Express cards; surcharging, steering and suppression by merchants and merchant acceptance; the desirability of our premium card products; competition for new and existing cobrand relationships; competition from new and non-traditional competitors, and with respect to new products, services and technologies, such as the emergence or increase in popularity of alternative payment mechanisms; and the success of marketing, promotion and rewards programs;\n89\nTable of Contents\n•\nour ability to expand our leadership in the premium consumer space, including with Millennial and Gen-Z consumers, which will be impacted in part by competition, brand perceptions (including perceptions related to merchant coverage) and reputation, and our ability to develop and market new benefits and value propositions that appeal to Card Members and new customers, grow spending with new and younger age cohort Card Members, offer attractive services and rewards programs and build greater customer loyalty, which will depend in part on identifying and funding investment opportunities, addressing changing customer behaviors, new product innovation and development, Card Member acquisition efforts and enrollment processes, including through digital channels, continuing to realize the benefits from strategic partnerships, successfully implementing our dining strategy and evolving our infrastructure to support new products, services and benefits;\n•\nour ability to build on our leadership in commercial payments, which will depend in part on competition; the willingness and ability of companies to use credit and charge cards for procurement and other business expenditures as well as use our other products and services for financing needs; perceived or actual difficulties and costs related to setting up B2B payment platforms; our ability to offer attractive value propositions and new products to current and potential customers; our ability to enhance and expand our payment, lending and cash flow management solutions, increase customer engagement, and build out a multi-product digital ecosystem to integrate our broad product set, which is dependent on our continued investment in capabilities, features, functionalities, platforms and technologies; and the success of our initiatives to support businesses, such as Small Business Saturday and other Shop Small campaigns;\n•\nour ability to expand merchant coverage globally and our success, as well as the success of third-party merchant acquirers, aggregators and processors, in signing merchants to accept American Express, which will depend on, among other factors, the value propositions offered to merchants and merchant acquirers for card acceptance, the awareness and willingness of Card Members to use American Express cards at merchants, scaling marketing and expanding programs to increase card usage, identifying and growing acceptance in low- and new-to-plastic industries and businesses as they form, working with commercial buyers and suppliers to establish B2B acceptance, executing on our plans to increase coverage in priority international cities, destinations, countries and industry verticals, and continued network investments, including in capabilities that allow for greater digital integration and modernization of our authorization platform;\n•\nour ability to successfully invest in, benefit from and expand the use of technological developments, digital payments, servicing and travel solutions and other technological capabilities, which will depend in part on our success in evolving our products and processes for the digital environment, developing new features in the Amex\n®\n app and enhancing our digital channels, effectively utilizing data and data platforms, building partnerships and executing programs with other companies, effectively utilizing artificial intelligence and machine learning and increasing automation, including to address servicing and other business and customer needs, and supporting the use of our products as a means of payment through online and mobile channels, all of which will be impacted by investment levels, customer and colleague receptiveness and ability to adopt new technologies, new product innovation and development and the platforms and infrastructure to support new products, services, benefits and partner integrations;\n•\nour ability to grow internationally, which could be impacted by regulation and business practices, such as those capping interchange or other fees, mandating network access or data localization, favoring local competitors or prohibiting or limiting foreign ownership of certain businesses; our inability to successfully replicate aspects of our business model internationally and tailor products and services to make them attractive to local customers; competitors with more scale, local experience and established relationships with relevant customers, regulators and industry participants; the success of us and our network partners in acquiring Card Members and/or merchants; and political or economic instability or regional hostilities;\n•\nour ability to successfully implement our dining strategy and grow our dining platform, which will depend in part on our ability to grow the number of diners, restaurants and other bookable venues using the platform and transactions on the platform; expand and innovate in the tools and capabilities offered through the platform, including integrating the Tock and Rooam acquisitions and benefiting from their added capabilities, users and/or bookable venues; successfully compete with other dining platforms and means of booking venues; and effectively utilize our dining platform to provide value to Card Members and merchants and sell our products and services;\n•\na failure in or breach of our operational or security systems, processes or infrastructure, or those of third parties, including as a result of cyberattacks or outages, which could compromise the confidentiality, integrity, privacy and/or security of data, disrupt our operations, reduce the use and acceptance of American Express cards and lead to regulatory scrutiny, litigation, remediation and response costs, and reputational harm;\n•\nchanges in capital and credit market conditions, which may significantly affect our ability to meet our liquidity needs and expectations regarding capital ratios; our access to capital and funding costs; the valuation of our assets; and our credit ratings or those of our subsidiaries;\n90\nTable of Contents\n•\nour funding plan being implemented in a manner inconsistent with current expectations, which will depend on various factors such as future business growth, the impact of global economic, political and other events on market capacity, demand for securities we offer, regulatory changes, our ability to securitize and sell loans and receivables and the performance of loans and receivables previously sold in securitization transactions;\n•\nour ability to achieve our climate-related goals, which depend in part on the amount and efficacy of our investments in emissions reduction projects, the ability of our partners to set and achieve sustainability targets, the success of our supply chain and sustainability initiatives, and colleague programs; customer preferences and behaviors; the cost and availability of renewable energy, carbon removal and carbon offset projects and energy attribute certificates; changes in our real estate, technology and colleague strategies or an inability to execute those strategies; and brand perceptions and reputation;\n•\nlegal and regulatory developments, which could affect the profitability of our business activities; limit our ability to pursue business opportunities or conduct business in certain jurisdictions; require changes to business practices or governance, or alter our relationships with Card Members, partners, merchants and other third parties, including affecting our network operations and practices governing merchant acceptance, as well as our ability to continue certain cobrand relationships in the EU; impact card fees and rewards programs; exert further pressure on merchant discount rates and our network business, as well as result in an increase in surcharging, steering or other differential acceptance practices; alter the competitive landscape; subject us to heightened regulatory scrutiny and result in increased costs related to regulatory oversight and compliance, litigation-related settlements, judgments or expenses, restitution to Card Members or the imposition of fines or monetary penalties; materially affect capital or liquidity requirements, results of operations or ability to pay dividends; or result in harm to the American Express brand;\n•\nchanges in the financial condition and creditworthiness of our business partners, such as bankruptcies, restructurings or consolidations, including of cobrand partners, merchants that represent a significant portion of our business, network partners or financial institutions that we rely on for routine funding and liquidity, which could materially affect our financial condition or results of operations; and\n•\nfactors beyond our control such as global economic and business conditions, consumer and business spending generally, unemployment rates, geopolitical conditions, including resulting from recent political developments or further escalations or widening of ongoing military conflicts and regional hostilities, adverse developments affecting third parties, including other financial institutions, merchants or vendors, as well as severe weather conditions and natural disasters (e.g., hurricanes and wildfires), power loss, disruptions in telecommunications, pandemics, terrorism and other catastrophic events, any of which could significantly affect demand for and spending on American Express cards, delinquency rates, loan and receivable balances, deposit levels, foreign exchange rates and other aspects of our business and results of operations or disrupt our global network systems and ability to process transactions.\nA further description of these uncertainties and other risks can be found in “Risk Factors” and our other reports filed with the SEC.\n91\nTable of Contents",
  "item2": null
}