{
  "item1": "ITEM 1. BUSINESS American Express globally integrated payments company card-issuing, merchant-acquiring card network businesses offer products services broad range customers, including consumers, small businesses, mid-sized companies large corporations around world. range products services includes: Credit card, charge card, banking other payment financing products Merchant acquisition processing, servicing settlement, fraud prevention, point-of-sale marketing information products services Travel lifestyle services Expense management products services Other services, such design operation customer loyalty programs These products services offered through various channels, including mobile online applications, affiliate marketing, customer referral programs, third-party service providers business partners, in-house sales teams, direct mail, telephone direct response advertising. founded 1850 joint stock association incorporated 1965 New York corporation.",
  "item7": "Net (decrease) increase cash cash equivalents Cash Flows Operating Activities cash flows operating activities primarily include net income adjusted (i) non-cash items included net income, such provisions credit losses, depreciation amortization, stock-based compensation, deferred taxes other non-cash items (ii) changes balances operating assets liabilities, which can vary significantly normal course business due amount timing payments. 2024, net cash provided operating activities driven cash generated net income period, partially offset lower net operating liabilities, primarily driven lower book overdrafts due timing differences arising ordinary course business. 2023, net cash provided operating activities primarily driven cash generated net income period higher net operating liabilities, primarily driven higher book overdrafts due timing differences arising ordinary course business higher accounts payable merchants. Cash Flows Investing Activities cash flows investing activities primarily include changes loans Card Member receivables, well changes available-for-sale investment securities portfolio.",
  "item2": "foreign currency adjusted information assumes constant exchange rate between periods being compared purposes currency conversion into U.S. dollars (i.e., assumes foreign exchange rates used determine results current period apply corresponding prior year period against which such results being compared). FX-adjusted Total revenues net interest expense Total loans Card Member receivables non-GAAP measures. believe presentation information foreign currency adjusted basis helpful investors making easier compare performance one period another period without variability caused fluctuations currency exchange rates."
}