{
  "source_file": "ball-20250930x10q.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2.  MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND\n RESULTS OF OPERATIONS\n​\nManagement’s discussion and analysis should be read in conjunction with the unaudited condensed consolidated financial statements (consolidated financial statements) and accompanying notes included in \nItem 1\n of this Quarterly Report on Form 10-Q, which include additional information about our accounting policies, practices and the transactions underlying our financial results. The preparation of our consolidated financial statements in conformity with accounting principles generally accepted in the United States of America (U.S. GAAP) requires us to make estimates and assumptions that affect the reported amounts in our consolidated financial statements and the accompanying notes, including various claims and contingencies related to lawsuits, taxes, environmental and other matters arising during the normal course of business. We apply our best judgment, our knowledge of existing facts and circumstances and actions that we may undertake in the future in determining the estimates that affect our consolidated financial statements. We evaluate our estimates on an ongoing basis using our historical experience, as well as other factors we believe appropriate under the circumstances, such as current economic conditions, and adjust or revise our estimates as circumstances change. As future events and their effects cannot be determined with precision, actual results may differ from these estimates. Ball Corporation and its subsidiaries are referred to collectively as “Ball Corporation,” “Ball,” “the company,” “we” or “our” in the following discussion and analysis.\n​\nOVERVIEW\n​\nBusiness Overview and Industry Trends \n​\nBall Corporation is one of the world’s leading aluminum packaging suppliers. With a growth mindset and by pursuing operational excellence, we lean on our competitive strengths to reach our financial goals. We are focused on maintaining our strong financial position by listening to and partnering with our global customers, delivering operational efficiencies and an innovative product portfolio from our best-in-class manufacturing facilities and returning value to shareholders via share repurchases and dividends. In the aluminum packaging industry, sales and earnings can be increased by reducing costs, increasing prices, developing new products, expanding volume and making strategic acquisitions. \n​\nWe sell our aluminum packaging products mainly to large, multinational beverage, personal care and household products companies with which we have developed long-term relationships. This is evidenced by our high customer retention and our large number of long-term supply contracts. While we have a diversified customer base, we sell a significant portion of our packaging products to major companies and brands, as well as to numerous regional customers. The overall global aluminum packaging industry is growing and is expected to continue to grow in the medium to long term. \n​\nWe purchase our raw materials from relatively few suppliers. We also have exposure to inflation, in particular the rising costs of raw materials, as well as other direct cost inputs. We mitigate our exposure to the changes in the costs of aluminum through the inclusion of provisions in contracts covering the majority of our volume to pass-through aluminum price changes, as well as through the use of derivative instruments. The pass-through provisions generally result in proportional increases or decreases in sales and costs with a greatly reduced impact, if any, on net earnings; however, there may be timing differences of when the costs are passed through. Because of our customer and supplier concentration, our business, financial condition and results of operations could be adversely affected by the loss, insolvency or bankruptcy of a major customer or supplier or a change in a supply agreement with a major customer or supplier, although our contract provisions generally mitigate the risk of customer loss, and our long-term relationships represent a known, stable customer base.\n​\nFrom time to time, we have evaluated and expect to continue to evaluate possible transactions that we believe will benefit the company and our shareholders, which may include strategic acquisitions, divestitures of parts of our company or equity investments. At any time, we may be engaged in discussions or negotiations at various stages of development with respect to one or more possible transactions or may have entered into non-binding letters of intent. As part of any such initiatives, we may participate in processes being run by other companies or leading our own activities. \n​\nRESULTS OF CONSOLIDATED OPERATIONS \n​\nManagement’s discussion and analysis for our results of operations on a consolidated and segment basis include a quantification of factors that had a material impact. Other factors that did not have a material impact, but that are significant to understand the results, are qualitatively described.\n29\n\n\nTable of Contents\n​\nGlobal Economic Environment\n​\nCurrent and future inflationary effects may continue to be impacted by, among other things, supply chain disruptions, governmental stimulus or fiscal and monetary policies, changes in interest rates, tariffs and changing demand for certain goods and services. There is currently significant uncertainty as to the extent and duration of tariffs and the associated impacts on inflation. Furthermore, we cannot predict with any certainty the impact that interest rates, a global or any regional recession, tariffs, or higher inflation may have on our customers or suppliers. Additionally, we are unable to predict the potential effects that any future pandemic, hyperinflationary economies in countries where we operate, or the continuation or escalation of global conflicts, including the conflict between Russia and Ukraine and the instability in the Middle East and Myanmar, and related sanctions or market disruptions, may have on our business. It remains uncertain how long any of these conditions may last or how severe any of them may become.\n​\nConsolidated Sales and Earnings \n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nThree Months Ended September 30,\n​\nNine Months Ended September 30,\n​\n($ in millions)\n    \n2025\n    \n2024\n    \n2025\n    \n2024\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nNet sales\n​\n$\n 3,379\n​\n$\n 3,082\n​\n$\n 9,814\n​\n$\n 8,915\n​\nNet earnings attributable to Ball Corporation\n​\n​\n 321\n​\n​\n 197\n​\n​\n 712\n​\n​\n 4,040\n​\nNet earnings attributable to Ball Corporation as a % of net sales\n​\n​\n 9\n%\n​\n 6\n%\n​\n 7\n%\n​\n 45\n%\n​\nSales in the three months ended September 30, 2025, increased $297 million compared to the same period in 2024 primarily due to increases of $145 million from higher volume, $120 million from price/mix, mainly from higher aluminum prices, and $64 million from currency translation. Sales in the nine months ended September 30, 2025, increased $899 million compared to the same period in 2024 primarily due to increases of $500 million from higher volume, $370 million from price/mix, mainly from higher aluminum prices, and $91 million from currency translation.\n \n​\nNet earnings attributable to Ball Corporation for the three months ended September 30, 2025, increased $124 million compared to the same period in 2024 primarily due to increases of $163 million from business consolidation and other activities and $28 million from the results of the reportable segments discussed below, partially offset by $18 million of higher interest expense and $34 million from a higher provision for income taxes. Net earnings attributable to Ball Corporation for the nine months ended September 30, 2025, decreased $3.33 billion compared to the same period in 2024 primarily due to decreases of $3.61 billion from lower discontinued operations, net of tax, $72 million from a higher provision for income taxes and $35 million from lower \ninterest income in corporate undistributed expenses, net\n, partially offset by increases of $82 million \nfrom lower incremental compensation cost from the successful sale of the aerospace business incurred in 2024,\n $224 million from business consolidation and other activities and $84 million from the results of the reportable segments discussed below.\n​\nWhen analyzing net earnings attributable to Ball Corporation as a percentage of net sales, it is important to note that net earnings attributable to Ball Corporation in 2024 includes discontinued operations, net of tax resulting from the net sales attributable to the historical aerospace reportable segment through the date of the divestiture on February 16, 2024, that are reported as discontinued operations.\n However, net sales attributable to the historical aerospace reportable segment are not included in the 2024 net sales figures in the table above. \n​\nCost of Sales (Excluding Depreciation and Amortization) \n​\nCost of sales, excluding depreciation and amortization, was $2,701 million and $2,425 million for the three months ended September 30, 2025 and 2024, respectively, and $7,884 million and $7,065 million for the nine months ended September 30, 2025 and 2024, respectively. These amounts represented 80 percent and 79 percent of consolidated net sales for the three months ended September 30, 2025 and 2024, respectively, and 80 percent and 79 percent of consolidated net sales for the nine months ended September 30, 2025 and 2024, respectively. The increase for the three months ended September 30, 2025, was primarily due to\n higher raw materials costs of $244 million, driven by higher aluminum prices and higher volume, and other items discussed in the reportable segment sections below. The increase for the nine months ended September 30, 2025, was primarily due to higher raw materials costs of $747 million, driven by higher aluminum prices and higher volume, and other items discussed in the reportable segment sections below.\n​\n30\n\n\nTable of Contents\nDepreciation and Amortization \n​\nDepreciation and amortization expense was $158 million and $150 million for the three months ended September 30, 2025 and 2024, respectively, and $463 million and $460 million for the nine months ended September 30, 2025 and 2024, respectively. These amounts represented 5 percent of consolidated net sales for the three months ended September 30, 2025 and 2024, respectively, and 5 percent of consolidated net sales for the nine months ended September 30, 2025 and 2024, respectively. \nThe increase for the three and nine months ended September 30, 2025, was primarily due to the company’s larger depreciable asset base.\n \n​\nSelling, General and Administrative \n​\nSelling, general and administrative was $130 million and $142 million for the three months ended September 30, 2025 and 2024, respectively, and $416 million and $518 million for the nine months ended September 30, 2025 and 2024, respectively. These amounts represented 4 percent and 5 percent of consolidated net sales for the three months ended September 30, 2025 and 2024, respectively, and 4 percent and 6 percent of consolidated net sales for the nine months ended September 30, 2025 and 2024, respectively\n. The decrease for the three months ended September 30, 2025, was primarily due to decreased costs for professional services of $8 million. The decrease for the nine months ended September 30, 2025, was primarily due to decreases in compensation costs of $67 million, which in 2024 included incremental cash bonuses and stock-based compensation cost from the successful sale of the aerospace business, and costs for professional services of $20 million.\n​\nBusiness Consolidation and Other Activities \n​\nBusiness consolidation and other activities resulted in income of $78 million and charges of $85 million for the three months ended September 30, 2025 and 2024, respectively, and income of $53 million and charges of $171 million for the nine months ended September 30, 2025 and 2024, respectively. The 2025 amounts include the $86 million gain related to the sale of the Saudi Arabian business and costs for previously announced facility closures and a loss related to the aluminum cups business transaction. The charges for the nine months ended September 30, 2025, were partially offset by income from the receipt of insurance proceeds for replacement costs related to the 2023 fire at the company’s Verona, Virginia extruded aluminum slug manufacturing facility. The 2024 amounts primarily included facility shutdown costs. Further details regarding business consolidation and other activities are provided in \nNote 6\n.\n​\nInterest\n \nIncome\n \n​\nInterest income was $8 million and $14 million for the three months ended September 30, 2025 and 2024, respectively, and $20 million and $58 million for the nine months ended September 30, 2025 and 2024, respectively. The decreases in interest income for the three and nine months ended September 30, 2025, were primarily due to the higher amount of cash on hand in 2024 from the sale of the aerospace business.\n​\nInterest Expense \n​\nInterest expense was $85 million and $67 million for the three months ended September 30, 2025 and 2024, respectively, and $236 million and $228 million for the nine months ended September 30, 2025 and 2024, respectively. Interest expense as a percentage of average borrowings was 4.6 percent for the three months ended September 30, 2025 and 2024, and decreased approximately 40 basis points from 4.9 percent for the nine months ended September 30, 2024, to 4.5 percent for the nine months ended September 30, 2025. The interest expense increase for the three months ended September 30, 2025, was primarily driven by an increase of $18 million from a higher amount of weighted average principal outstanding during the quarter. The interest expense increase for the nine months ended September 30, 2025, was primarily driven by an increase of $29 million from a higher amount of weighted average principal outstanding during the year, partially offset by a decrease of $21 million from lower weighted average interest rates on outstanding debt during the year.\n​\nIncome Taxes \n​\nThe effective tax rate for the three and nine months ended September 30, 2025, was 19.4 percent and 21.4 percent, respectively, compared to 18.5 percent and 22.3 percent for the same periods in 2024. The increase of 0.9 percentage points for the three months ended September 30, 2025 was primarily due to lower state and local tax credits, partially \n31\n\n\nTable of Contents\noffset by the sale of the Saudi Arabian business at a lower tax rate.  The decrease of 0.9 percentage points for the nine months ending September 30, 2025 was primarily due to the sale of the Saudi Arabian business at a lower tax rate, and higher federal tax credits, partially offset by the effects of lower state and local tax credits.  Similar impacts may occur in future periods, but given their inherent uncertainty, the company is unable to reasonably estimate their potential future impacts. \n​\nRESULTS OF BUSINESS SEGMENTS\n​\nSegment Results\n​\nBall’s operations are organized and reviewed by management along its product lines and geographical areas, and its operating results are presented in the three reportable segments discussed below. \n​\nBeverage Packaging, North and Central America \n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nThree Months Ended September 30,\n​\nNine Months Ended September 30,\n​\n($ in millions)\n    \n​\n2025\n    \n2024\n    \n2025\n    \n2024\n    \n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nNet sales\n​\n​\n$\n 1,638\n​\n$\n 1,456\n​\n$\n 4,714\n​\n$\n 4,328\n​\nComparable operating earnings\n​\n​\n​\n 210\n​\n​\n 203\n​\n​\n 613\n​\n​\n 605\n​\nComparable operating earnings as a % of segment net sales\n​\n​\n​\n 13\n%\n​\n 14\n%\n​\n 13\n%\n​\n 14\n%\n​\nBall permanently ceased production at its aluminum beverage can manufacturing facility in Kent, Washington, in the first quarter of 2024 and acquired an aluminum beverage can manufacturing facility in Winter Haven, Florida, in the first quarter of 2025 as part of its acquisition of Florida Can Manufacturing. See \nNote 4\n for further details on the acquisition.\n​\nSegment sales for the three and nine months ended September 30, 2025, were $182 million and $386 million higher, respectively, compared to the same periods in 2024. The increase for the three months ended September 30, 2025, was primarily due to increases of $106 million from price/mix, mainly from higher aluminum prices, and $76 million from higher volume. The increase for the nine months ended September 30, 2025, was primarily due to increases of $205 million from price/mix, mainly from higher aluminum prices, and $180 million from higher volume.\n​\nComparable operating earnings for the three and nine months ended September 30, 2025, were $7 million and $8 million higher, respectively, compared to the same periods in 2024. The increase for the three months ended September 30, 2025, was primarily due to an increase of $29 million from higher volume, partially offset by $11 million from price/mix. The increase for the nine months ended September 30, 2025, was primarily due to an increase of $57 million from higher volume, partially offset by a decrease of $34 million from price/mix.\n​\nBeverage Packaging, EMEA \n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nThree Months Ended September 30,\n​\nNine Months Ended September 30,\n​\n($ in millions)\n    \n2025\n    \n2024\n    \n2025\n    \n2024\n    \n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nNet sales\n​\n$\n 1,059\n​\n$\n 950\n​\n$\n 3,012\n​\n$\n 2,640\n​\nComparable operating earnings\n​\n​\n 147\n​\n​\n 128\n​\n​\n 372\n​\n​\n 326\n​\nComparable operating earnings as a % of segment net sales\n​\n​\n 14\n%\n​\n 13\n%\n​\n 12\n%\n​\n 12\n%\n​\nSegment sales for the three and nine months ended September 30, 2025, were $109 million and $372 million higher, respectively, compared to the same periods in 2024. The increase for the three months ended September 30, 2025, was primarily due to $58 million from currency translation and $48 million from higher volume. The increase for the nine months ended September 30, 2025, was primarily due to increases of $175 million from higher volume, $102 million from price/mix, mainly from higher aluminum prices, and $95 million from currency translation.\n \n​\n32\n\n\nTable of Contents\nComparable operating earnings for the three and nine months ended September 30, 2025, were $19 million and $46 million higher, respectively, compared to the same periods in 2024. The increase for the three months ended September 30, 2025, was primarily due to increases of $15 million from higher volume. The increase for the nine months ended September 30, 2025, was primarily due to increases of $49 million from higher volume and $39 million from price/mix, partially offset by a decrease of $53 million from higher costs.\n​\nBeverage Packaging, South America \n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nThree Months Ended September 30,\n​\nNine Months Ended September 30,\n​\n($ in millions)\n    \n2025\n    \n2024\n    \n2025\n    \n2024\n    \n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nNet sales\n​\n$\n 508\n​\n$\n 484\n​\n$\n 1,529\n​\n$\n 1,388\n​\nComparable operating earnings\n​\n​\n 80\n​\n​\n 78\n​\n​\n 200\n​\n​\n 170\n​\nComparable operating earnings as a % of segment net sales\n​\n​\n 16\n%\n​\n 16\n%\n​\n 13\n%\n​\n 12\n%\n​\nSegment sales for the three and nine months ended September 30, 2025, were $24 million and $141 million higher, respectively, compared to the same periods in 2024. The increase for the three months ended September 30, 2025, was primarily due to an increase of $19 million from higher volume. The increase for the nine months ended September 30, 2025, was primarily due to increases of $98 million from higher volume and $42 million from price/mix, mainly from higher aluminum prices.\n​\nComparable operating earnings for the three and nine months ended September 30, 2025, were $2 million and $30 million higher, respectively, compared to the same periods in 2024. The increase for the three months ended September 30, 2025, was primarily due to increases of $8 million from higher volume and $8 million from price/mix, partially offset by a decrease of $12 million from higher costs. The increase for the nine months ended September 30, 2025, was primarily due to increases of $35 million from higher volume and $26 million from price/mix, partially offset by a decrease of $26 million from higher costs.\n​\nManagement Performance Measures\n​\nManagement internally uses various measures to evaluate company financial performance such as comparable operating earnings (earnings before interest expense, taxes and business consolidation and other non-comparable items); comparable net earnings (net earnings attributable to Ball Corporation before business consolidation and other non-comparable items after tax); comparable diluted earnings per share (comparable net earnings divided by diluted weighted average shares outstanding); return on average invested capital (net operating earnings after tax over the relevant performance period divided by average invested capital over the same period); economic value added (EVA®) dollars (net operating earnings after tax less a capital charge on average invested capital employed); earnings before interest expense, taxes, depreciation and amortization (EBITDA); and diluted earnings per share. In addition, management uses operating cash flows, free cash flow (cash flows from operating activities less capital expenditures; and, it may be adjusted for additional items that affect comparability between periods) and adjusted free cash flow (free cash flow adjusted for payments made for income tax liabilities related to the aerospace disposition and other material dispositions) as measures to evaluate the company’s liquidity. We believe this information is also useful to investors as it provides insight into the earnings and cash flow criteria that management uses to make strategic decisions. These financial measures may be adjusted at times for items that affect comparability between periods, including business consolidation and other non-comparable items.\n​\nNonfinancial measures used in the packaging businesses include production efficiency and spoilage rates; quality control figures; environmental, health and safety statistics; production and sales volume data; asset utilization rates and measures of sustainability. References to sales volume data represent units shipped. \n​\nMany of the above noted financial measurements are presented on a non-U.S. GAAP basis and should be considered in connection with the consolidated financial statements included within \nItem 1\n of this report. Non-U.S. GAAP measures should not be considered in isolation and should not be considered superior to, or a substitute for, financial measures calculated in accordance with U.S. GAAP. A presentation of earnings in accordance with U.S. GAAP is available in \nItem 1\n of this report.\n​\n33\n\n\nTable of Contents\nNEW ACCOUNTING PRONOUNCEMENTS\n​\nFor information regarding recent accounting pronouncements, see \nNote 2\n to the consolidated financial statements included within \nItem 1\n of this report on Form 10-Q.\n​\nFINANCIAL CONDITION, LIQUIDITY AND CAPITAL RESOURCES\n​\nCash Flows and Capital Expenditures\n​\nOur primary sources of liquidity are cash provided by operating activities and external borrowings. We believe that cash flows from operating activities and cash provided by short-term, long-term and committed revolver borrowings, when necessary, will be sufficient to meet our ongoing operating requirements, scheduled principal and interest payments on debt, dividend payments, anticipated share repurchases and anticipated capital expenditures. We have limited near-term debt maturities and our senior credit facilities are in place until 2027. The following table summarizes our cash flows:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nNine Months Ended September 30,\n($ in millions)\n    \n2025\n    \n2024\n​\n​\n​\n​\n​\n​\n​\nCash flows provided by (used in) operating activities\n​\n$\n 51\n​\n$\n (385)\nCash flows provided by (used in) investing activities\n​\n​\n (574)\n​\n​\n 5,181\nCash flows provided by (used in) financing activities\n​\n​\n 140\n​\n​\n (3,998)\n​\nCash flows from the historical aerospace reportable segment are presented within each cash flow statement category in the consolidated statement of cash flows for the nine months ended September 30, 2024. Depreciation and amortization, capital expenditures and significant operating and investing noncash items of the aerospace discontinued operation are presented in \nNote 4\n.\n​\nCash flows provided by operating activities were $51 million in 2025, primarily driven by earnings from continuing operations of $715 million and a reconciling adjustment to operating cash flows of $463 million for depreciation and amortization, partially offset by working capital outflows of $909 million. On February 16, 2024, the company completed the sale of the aerospace business. We currently estimate a total cash tax of $840 million for the sale of the aerospace business, of which $766 million was paid in 2024 and $60 million was paid through the third quarter of 2025. The remaining amount is expected to be paid in 2025. See \nNote 4\n for further details. In a dynamic economic environment, payment terms with our customers and vendors become a more important element of total mix of information used to negotiate our contract terms. At September 30, 2025, a change of one day in days sales outstanding will impact cash flows provided by (used in) operating activities by $38 million, a change of one day in days payable outstanding will impact cash flows provided by (used in) operating activities by $30 million and a change of one day in days inventory on hand will impact cash flows provided by (used in) operating activities by $30 million.\n​\nCash flows used in investing activities were $574 million in 2025, primarily driven by capital expenditures of $304 million, $160 million of cash consideration used for the acquisition of Florida Can Manufacturing and $89 million of derivative settlements. See \nNote 4\n for further details on the acquisition.\n​\nCash flows provided by financing activities were $140 million in 2025, primarily driven by a net inflow from long-term and short-term borrowings of $1.43 billion, primarily driven by the issuance of $750 million of 5.50% senior notes due in 2033 and €850 million of 4.25% senior notes due in 2032, partially offset by repurchases of common stock of $1.11 billion and dividends of $166 million. See \nNote 15\n for further details on the company’s borrowings and additional amounts available. \n​\nWe have entered into several regional accounts receivable factoring programs with various financial institutions for certain of our accounts receivable. The programs are accounted for as true sales of the receivables, with limited recourse to Ball, and had combined limits of approximately $1.79 billion and $1.60 billion at September 30, 2025, and December 31, 2024, respectively. A total of $580 million and $428 million were available for sale under these programs as of September 30, 2025, and December 31, 2024, respectively. The company has recorded expense related to its factoring programs of $9 million and $12 million for the three months ended September 30, 2025 and 2024, respectively, and $28 million and $35 million for the nine months ended September 30, 2025 and 2024, respectively, and has presented these amounts in selling, general and administrative in its unaudited condensed consolidated statements of earnings.\n​\n34\n\n\nTable of Contents\nThe amount of obligations outstanding that the company confirmed as valid to the financial institutions under the company's regional supplier finance programs was $276 million and $423 million at September 30, 2025, and December 31, 2024, respectively. These amounts are classified within accounts payable on the unaudited condensed consolidated balance sheets, and the associated payments are reflected in the cash flows from operating activities section of the unaudited condensed consolidated statements of cash flows.\n​\nContributions to the company’s defined benefit pension plans were $36 million in the first nine months of 2025 compared to $24 million in the same period of 2024, and such contributions are expected to be approximately $43 million for the full year of 2025. This estimate may change based on changes in the Pension Protection Act, actual plan asset performance and available company cash flow, among other factors. \n​\nThe company expects that 2025 capital expenditures for property, plant and equipment will likely be in the range of $465 million. Approximately $375 million of capital expenditures for property, plant and equipment were contractually committed as of September 30, 2025, and the company intends to return approximately $220 million to shareholders in the form of dividends for the full year 2025, inclusive of the cash dividend of 20 cents per share, payable December 15, 2025, to shareholders of record as of December 1, 2025.\n​\nAs of September 30, 2025, approximately $556 million of our cash was held outside of the U.S. In the event that we would need to utilize any of the cash held outside of the U.S. for purposes within the U.S., there are no material legal or other economic restrictions regarding the repatriation of cash from any of the countries outside the U.S. where we have cash. The company believes its U.S. operating cash flows and cash on hand, as well as availability under its long-term, revolving credit facilities, uncommitted short-term credit facilities and accounts receivable factoring programs, will be sufficient to meet the cash requirements of the U.S. portion of our ongoing operations, scheduled principal and interest payments on U.S. debt, dividend payments, capital expenditures and other U.S. cash requirements. If non-U.S. funds are needed for our U.S. cash requirements and we are unable to provide the funds through intercompany financing arrangements, we may be required to repatriate funds from non-U.S. locations where the company has previously asserted indefinite reinvestment of funds outside the U.S. \n​\nBased on its indefinite reinvestment assertion, the company has not provided deferred taxes on earnings in certain non-U.S. subsidiaries because such earnings are intended to be indefinitely reinvested in its international operations. It is not practical to estimate the additional taxes that might become payable if these earnings were remitted to the U.S.\n​\nShare Repurchases\n​\nThe company’s share repurchases totaled $1.11 billion during the nine months ended September 30, 2025, compared to $1.06 billion of repurchases during the same period of 2024. The repurchases were completed using cash on hand, cash provided by operating activities and available borrowings. The company plans to continue capital return to shareholders via an estimated $1.3 billion in share repurchases in 2025. \n​\nIn the second quarter of 2025, in a privately negotiated transaction, Ball entered into an accelerated share repurchase agreement to buy $250 million of its common shares using cash on hand and available borrowings. In the third quarter of 2025, Ball settled the agreement and received a total of 4.44 million shares with the average price per share paid of $56.30.\n​\nOn January 29, 2025, the Board of Directors approved the repurchase by the company of up to $4.00 billion in shares of its common stock through the end of 2027. This repurchase authorization replaced all previous authorizations. At September 30, 2025, $3.14 billion remains available to be repurchased. \n​\nDebt Facilities and Other Activities\n​\nGiven our cash flow projections and unused credit facilities that are available until June 2027, our liquidity is expected to meet our ongoing cash and debt service requirements. Total interest-bearing debt of $7.26 billion and $5.69 billion was outstanding at September 30, 2025, and December 31, 2024, respectively. \n​\n​\n35\n\n\nTable of Contents\nIn August 2025, Ball issued $750 million of 5.50% senior notes due in 2033 and repaid the outstanding U.S. dollar revolving credit facility due in 2027 in the amount of $600 million, as well as the outstanding multi-currency revolving credit facility due in 2027 of $100 million.\n​\nIn July 2025, Ball repaid at maturity the outstanding 5.25% senior notes due in the amount of $189 million.\n​\nIn May 2025, Ball issued €850 million of 4.25% senior notes due in 2032 and repaid a portion of the U.S. dollar revolving credit facility due in 2027 in the amount of $500 million, as well as the outstanding multi-currency revolving credit facility due in 2027 of $200 million.\n​\nThe company’s senior credit facilities include a $1.35 billion term loan and long-term, multi-currency revolving facilities that mature in June 2027, which provide the company with up to the U.S. dollar equivalent of $1.75 billion. At September 30, 2025, approximately $1.70 billion was available under the company’s long-term, multi-currency committed revolving credit facilities. The company also had approximately $1.02 billion of short-term uncommitted credit facilities available at September 30, 2025, of which $86 million was outstanding and due on demand. At December 31, 2024, the company had $109 million of committed short-term loans outstanding, a $24 million short-term finance lease outstanding and $37 million outstanding under short-term uncommitted credit facilities.\n​\nWhile ongoing financial and economic conditions in certain areas may raise concerns about credit risk with counterparties to derivative transactions, the company mitigates its exposure by allocating the risk among various counterparties and limiting exposure to any one party. We also monitor the credit ratings of our suppliers, customers, lenders and counterparties on a regular basis.\n​\nWe were in compliance with the leverage ratio requirement at September 30, 2025, and for all prior periods presented, and have met all debt payment obligations. The U.S. note agreements and bank credit agreement contain certain restrictions relating to dividend payments, share repurchases, investments, financial ratios, guarantees and the incurrence of additional indebtedness. The most restrictive of our debt covenants requires us to maintain a leverage ratio (as defined) of no greater than 4.5 times. As of September 30, 2025, the company could borrow an additional $2.39 billion under its long-term multi-currency committed revolving facilities and short-term uncommitted credit facilities. Additional details about our debt are available in \nNote 15\n accompanying the consolidated financial statements within \nItem 1\n of this report. In 2024 and 2025, we entered into and designated net investment hedges against the net assets of our euro denominated operations. See \nNote 20\n for further details.  \n​\nSaudi Arabia\n​\nIn August 2025, the company sold 41 percent of its share in Ball United Arab Can Manufacturing Company, which resulted in deconsolidation upon closing of the transaction. See \nNote 4\n for further details.\n​\nCONTINGENCIES, INDEMNIFICATIONS AND GUARANTEES \n​\nDetails of the company’s contingencies, legal proceedings, indemnifications and guarantees are available in \nNote 21\n and \nNote 22\n accompanying the consolidated financial statements within \nItem 1\n of this report. The company is routinely subject to litigation incidental to operating its businesses and has been designated by various federal, state, and international environmental agencies as a potentially responsible party, along with numerous other companies, for the clean-up of several hazardous waste sites. \n​\nGuaranteed Securities\n​\nThe company’s senior notes are guaranteed on a full and unconditional, joint and several basis by the issuer of the company’s senior notes and the subsidiaries that guarantee the notes (the obligor group). The entities that comprise the obligor group are 100 percent owned by the company. As described in the supplemental indentures governing the company’s existing senior notes, the senior notes are guaranteed by any of the company’s domestic subsidiaries that guarantee any other indebtedness of the company.\n​\n36\n\n\nTable of Contents\nThe following summarized financial information relates to the obligor group as of September 30, 2025, and December 31, 2024. Intercompany transactions, equity investments and other intercompany activity between obligor group subsidiaries have been eliminated from the summarized financial information. Investments in subsidiaries not forming part of the obligor group have also been eliminated. \n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nNine Months Ended\n​\nYear Ended\n($ in millions)\n​\nSeptember 30, 2025\n    \nDecember 31, 2024\n​\n​\n​\n​\n​\n​\n​\nNet sales\n​\n$\n 5,526\n​\n$\n 6,708\nGross profit \n(a)\n​\n​\n 670\n​\n​\n 807\nNet earnings\n​\n​\n 379\n​\n​\n 3,824\nNet earnings attributable to Ball Corporation\n​\n​\n 379\n​\n​\n 3,824\n(a)\nGross profit is shown after depreciation and amortization related to cost of sales of $135 million for the nine months ended September 30, 2025, and $189 million for the year ended December 31, 2024.\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nSeptember 30,\n​\nDecember 31,\n($ in millions)\n    \n2025\n    \n2024\n​\n​\n​\n​\n​\n​\n​\nCurrent assets\n​\n$\n 2,317\n​\n$\n 2,144\nNoncurrent assets\n​\n​\n 13,711\n​\n​\n 14,698\nCurrent liabilities\n​\n​\n 2,740\n​\n​\n 4,096\nNoncurrent liabilities\n​\n​\n 10,091\n​\n​\n 8,415\n​\nIncluded in the amounts disclosed in the table above, at September 30, 2025, and December 31, 2024, the obligor group held receivables due from other subsidiary companies of $497 million and $440 million, respectively, long-term notes receivable due from other subsidiary companies of $9.15 billion and $10.03 billion, respectively, payables due to other subsidiary companies of $243 million and $1.79 billion, respectively, and long-term notes payable due to other subsidiary companies of $2.32 billion and $2.20 billion, respectively. \n​\nFor the nine months ended September 30, 2025, and the year ended December 31, 2024, the obligor group recorded the following transactions with other subsidiary companies: sales to them of $952 million and $1.23 billion, respectively, net credits from them of $49 million and $75 million, respectively, and net interest income from them of $239 million and $336 million, respectively. The obligor group received dividends from other subsidiary companies of $54 million during the year ended December 31, 2024.\n​\nA description of the terms and conditions of the company’s debt guarantees is located in \nNote 22\n of \nItem 1\n of this report.\n​"
}