{
  "source_file": "bax-20241231.htm",
  "form_type": "10-K",
  "item1": "Item 1.    \nBusiness.\nCompany Overview\nBaxter International Inc., through its subsidiaries, provides a broad portfolio of essential healthcare products, including sterile intravenous (IV) solutions; infusion systems and devices; parenteral nutrition therapies; inhaled anesthetics; generic injectable pharmaceuticals; surgical hemostat and sealant products, advanced surgical equipment; smart bed systems; patient monitoring and diagnostic technologies; and respiratory health devices. These products are used by hospitals, nursing homes, rehabilitation centers, ambulatory surgery centers, doctors’ offices, kidney dialysis centers and patients at home under physician supervision. Our global footprint and the critical nature of our products and services play a key role in expanding access to healthcare in emerging and developed countries. As of December 31, 2024, after giving effect to the recent sale of our Kidney Care business (as discussed below), we manufactured products in over 20 countries and sold them in over 100 countries.\nBaxter International Inc. was incorporated under Delaware law in 1931. As used in this report, “Baxter International” means Baxter International Inc. and “we\", \"our” or \"us\" means Baxter International and its consolidated subsidiaries, unless the context otherwise requires.\nRecent Strategic Actions\nIn mid-2022, our Board of Directors authorized a strategic review of our business portfolio, with the goal of increasing stockholder value. As part of that review process, we identified and evaluated a range of potential strategic actions, including opportunities for sales and other separation transactions. In January 2023, following the completion of that review, we announced a number of planned strategic actions, as discussed below, which are intended to enhance our operational effectiveness, accelerate innovation and drive additional stockholder value. We completed the last of these strategic actions on January 31, 2025 in connection with the sale of our Kidney Care business.\nSale of Kidney Care Business\nOn August 12, 2024, we entered into an Equity Purchase Agreement (EPA) with certain affiliates of Carlyle Group Inc. (Carlyle) to sell our Kidney Care business. That business, which is now known as Vantive Health LLC (Vantive) is comprised of our former Kidney Care segment and provides chronic and acute dialysis therapies and services, including peritoneal dialysis, hemodialysis, continuous renal replacement therapies, and other organ support therapies. On January 31, 2025, we completed the sale of our Kidney Care business to Carlyle for an aggregate purchase price of $3.80 billion in cash, subject to certain closing cash, working capital and debt adjustments. After giving effect to certain adjustments, we received approximately $3.71 billion pre-tax cash proceeds at closing of the transaction with the net after tax proceeds currently estimated to be approximately $3.4 billion, subject to certain post-closing adjustments. We determined that our Kidney Care business met the criteria to be classified as held-for-sale in August 2024, and we also concluded that it met the conditions to be reported as a discontinued operation at that time. Accordingly, our Kidney Care business is reported in discontinued operations in the accompanying consolidated financial systems, and our prior period results have been adjusted to reflect discontinued operations presentation. \nImplementation of New Operating Model and Resulting Segment Change\nOur reportable segments were previously comprised of the following geographic segments related to our legacy Baxter business: Americas (North and South America), EMEA (Europe, Middle East and Africa) and APAC (Asia Pacific), and a global segment for the Hill-Rom Holdings, Inc. (Hillrom) business we acquired in December 2021. In the third quarter of 2023, we completed the implementation of a new operating model intended to simplify and streamline our operations and better align our manufacturing and supply chain to our commercial activities. Under this operating model, our business is currently comprised of three reportable segments: Medical Products & Therapies, Healthcare Systems & Technologies, and Pharmaceuticals. Our segment reporting was changed during the third quarter of 2023 to align with our new operating model, and all periods presented are under the new operating model.\n1\nSale of BPS Business\nOn September 29, 2023, we completed the sale of our BioPharma Solutions (BPS) business and received cash proceeds of $3.96 billion from that transaction. The results of operations and cash flows of our BPS business, including the $2.88 billion pre-tax gain ($2.59 billion net of tax) from the sale of that business and the related cash proceeds received, are reported as discontinued operations in the accompanying consolidated financial statements. We used substantially all of the after-tax proceeds from this transaction to repay certain of our debt obligations, including $514 million of commercial paper borrowings and $2.28 billion of long-term debt that we repaid during the fourth quarter of 2023, as well as €750 million of senior notes that we repaid during the second quarter of 2024.\nBusiness Segments and Products\nWe currently manage our global operations based on three reportable segments: Medical Products & Therapies, Healthcare Systems & Technologies and Pharmaceuticals.\nThe Medical Products & Therapies segment includes sales of our sterile IV solutions, infusion systems, administration sets, parenteral nutrition therapies and surgical hemostat, sealant and adhesion prevention products. The Healthcare Systems & Technologies segment includes sales of our connected care solutions and collaboration tools, including smart bed systems, patient monitoring systems and diagnostic technologies, respiratory health devices and advanced equipment for the surgical space, including surgical video technologies, precision positioning devices and other accessories. The Pharmaceuticals segment includes sales of specialty injectable pharmaceuticals, inhaled anesthetics and drug compounding services. \nFor financial information about our segments, see Note 18 in Item 8 of this Annual Report on Form 10-K.\nBusiness Strategy\nOur business strategy is focused on driving sustainable growth and innovation aligned with our mission to save and sustain lives and our vision to transform healthcare with a customer focus to help improve patient outcomes, enhance workflow efficiency, and enable cost-effective care. Our diversified and broad portfolio of medical products that treat acute or chronic conditions and our global presence are core components of our strategy as we work to achieve these objectives. We are focused on key strategic pillars as part of our pursuit of industry leading performance: innovation; operational efficiency; and capital allocation.\nInnovation\nOur innovation strategy, which encompasses both organic and inorganic initiatives, is focused on accelerating our sales growth through the introduction of new connected care and core therapy offerings. Connected care offerings include devices or software that can digitally connect, communicate and/or analyze data to help transform healthcare and improve patient outcomes, and we are continuing to build out our connected care portfolio offerings, which includes smart bed systems, infusion pumps, patient monitoring and diagnostic technologies, respiratory health devices and advanced equipment for the surgical space. Our core therapy product offerings include pharmaceuticals and consumable medical products designed to address essential patient and provider needs across the continuum of care. \nAs part of this strategy, we are prioritizing investments that drive innovation in product areas where we believe we have compelling opportunities to better serve patients and healthcare professionals, particularly in markets with higher growth rates. We are working to accelerate the pace at which we bring these advances to market to support our future growth. We are in the midst of launching (or have recently launched) several new products, geographic expansions and line extensions in areas such as smart pump technology, hospital pharmaceuticals and nutritionals, surgical sealants, smart beds, respiratory vests and more. These comprise a mix of entirely new product offerings and meaningful improvements to existing technologies. \nPortfolio Optimization\nOur strategy also involves active portfolio management in the interest of maximizing value for Baxter stockholders and best positioning Baxter for long-term success.\n \nThe recent Kidney Care sale has given us enhanced flexibility to deploy (or in some cases redeploy) capital toward opportunities that seek to accelerate our growth objectives, \n2\nwhether as a result of innovation or expanding our portfolio geographically or as a result of channel expansion or market development activities. \nOperational Excellence\nAs discussed above under “Recent Strategic Actions,” in the third quarter of 2023, we implemented a new operating model intended to simplify and streamline our operations and better align our manufacturing and supply chain to our commercial activities. We believe these changes will allow us to be a more integrated and nimble organization that can respond more effectively to operational challenges and changes in the macroeconomic environment while enhancing our ability to drive innovation in our product portfolio. We also continue to focus on increasing efficiencies through automation and digitization. We intend to continue to actively manage our cost structure and strive to commit resources to the highest value uses. Such high value activities include supporting innovation, actively managing the portfolio, expanding patient access and accelerating growth for our stockholders.\nMaintaining Disciplined and Balanced Capital Allocation\nSubject to market conditions and our investment grade targets, our capital allocation strategies currently include the following:\n•\ndebt repayments to support our deleveraging commitments; \n•\nactive portfolio management through the identification of attractive acquisition and divestiture transactions, including the recent divestitures of our BPS and Kidney Care businesses; and \n•\nreturning capital to stockholders through dividends, while balancing any returns with other strategic actions we take. We also intend to reinstate share repurchases over the longer term.\nWe paid down $3.65 billion of net debt during 2024 and through February 21, 2025 using proceeds from the sales of our BPS and Kidney Care businesses, and we are committed to retaining our investment grade rating, including taking actions toward achieving a net leverage target of approximately 3.0x by the end of 2025 through ongoing debt repayment and financing activities. During this deleveraging period, we currently intend to continue paying a dividend (which we reduced in November 2024), not make any share repurchases and be highly selective with respect to any potential acquisitions. \nSales and Distribution\nWe have our own direct sales force and also make sales to and through independent distributors, drug wholesalers acting as sales agents and specialty pharmacy or other alternate site providers. In the United States, third parties, such as Cardinal Health, Inc., warehouse and ship a significant portion of our products through their distribution centers. These centers are generally stocked with adequate inventories to facilitate prompt customer service. Sales and distribution methods include frequent contact by sales and customer service representatives, automated communications via various electronic purchasing systems, circulation of catalogs and merchandising bulletins, direct-mail campaigns, trade publication presence and advertising.\nSales are made and products are distributed on a direct basis or through independent distributors or sales agents in more than 100 countries as of December 31, 2024, giving effect to the sale of our Kidney Care business.\nInternational Operations\nA significant portion of our revenues are generated outside of the United States and thoughtful geographic expansion remains a key component of our strategy. Our international presence includes operations in Europe, the Middle East, Africa, Asia-Pacific, Latin America and Canada. We are subject to certain risks inherent in conducting business outside the United States. For more information on these risks, see the information under the captions “Risks Relating to Our Business—We are subject to risks associated with doing business globally” and “—Changes in foreign currency exchange rates and interest rates have had, and may in the future have, an adverse effect on our results of operations, financial condition, cash flows and liquidity” in Item 1A. Risk Factors of this Annual Report on Form 10-K.\nFor financial information about our foreign and domestic revenues and segment information, see Note 18, in Item 8 of this Annual Report on Form 10-K. For more information regarding foreign currency exchange risk, refer to the \n3\ndiscussion under the caption entitled “Financial Instrument Market Risk” in Item 7. Management's Discussion and Analysis of Financial Condition and Results of Operations of this Annual Report on Form 10-K.\nContractual Arrangements\nOur products are sold through contracts with customers, both within and outside the United States. Some of these contracts have terms of more than one year and place limits on our ability to increase prices. In the case of hospitals, governments and other facilities, these contracts may specify minimum quantities of a particular product or categories of products to be purchased by the customer.\nIn keeping with the increased emphasis on cost-effectiveness in healthcare delivery, many hospitals and other customers of medical products in the United States have joined group purchasing organizations (GPOs), or formed integrated delivery networks (IDNs), to enhance purchasing power. GPOs and IDNs negotiate pricing arrangements with manufacturers and distributors and the negotiated prices are made available to members. We have purchasing agreements with several of the major GPOs in the United States, which are subject to renewal from time to time. GPOs may have agreements with more than one supplier for certain products. Accordingly, in these cases, we face competition from other suppliers even where a customer is a member of a GPO under contract with us, which may constrain our ability to secure negotiated price increases. Purchasing power is similarly consolidated in many other countries. For example, public contracting authorities often act as the purchasing entities for the hospitals and other customers of medical products in their region and many hospitals and other customers have joined joint procurement entities and buying consortia. The result is that demand for healthcare products is increasingly concentrated across our markets globally. Additionally, our contractual pricing arrangements with GPOs, IDNs and public contracting authorities can sometimes limit our ability to increase prices in order to offset raw materials or component price increases or otherwise. Some of these agreements contain failure to supply clauses with varying remedies, inclusive of limited termination rights.\nRaw Materials and Component Parts\nRaw materials and component parts essential to our business are purchased from numerous suppliers worldwide in the ordinary course of business. While many of these materials are generally available, we have experienced and may in the future experience shortages of supply. Additionally, certain of these materials are secured from single source suppliers or on a spot basis and not pursuant to a contractual arrangement.  \nIn an effort to manage risk associated with raw materials and component supply, we work closely with our suppliers to help ensure availability and continuity of supply while maintaining high quality and reliability. We also seek to develop new and alternative sources of supply where beneficial to our overall raw materials procurement strategy. Refer to Item 1A. Risk Factors of this Annual Report on Form 10-K for further information regarding risks related to the supply chain, raw materials and component parts (including with respect to the qualification of any new or alternative supplier).\nWe are not always able to recover cost increases for raw materials and component parts through customer pricing due to contractual limits, where applicable, and market forces. For example, during 2022 and 2023, our profit margins were adversely impacted because we were unable to fully offset all related cost increases resulting from the high inflationary environment through customer pricing adjustments or other pricing actions. Additionally, our profit margins were negatively impacted in the fourth quarter of 2024 (and may continue to be negatively impacted in the short term) because we were unable to fully offset the increased supply chain costs associated with our ongoing North Cove recovery efforts (including as a result of importing additional product from outside the United States to support IV solutions demand). We seek to utilize long-term supply contracts with some suppliers to help maintain continuity of supply and manage the risk of price increases. Our ability to do so in the face of limited supply of certain raw materials and component parts and inflationary environment has been and may in the future be limited.\nCompetition and Healthcare Cost Containment\nOur businesses benefit from a number of competitive advantages, including the breadth and depth of our product offerings and our strong relationships with customers, including hospitals and clinics, GPOs, IDNs, physicians and patients, many of whom self-administer home-based therapies that we supply. We also benefit from efficiencies and cost advantages resulting from shared manufacturing facilities and the technological advantages of our products.\n4\nAlthough no single company competes with us in all of our businesses, we face substantial competition in each of our segments from international and domestic healthcare, medical products and pharmaceutical companies and providers of all sizes, and these competitors often differ across our businesses. In addition, global and regional competitors continue to expand their manufacturing capacity and sales and marketing channels. We believe customer purchasing decisions are primarily focused on cost-effectiveness, price, service, product performance and technological innovation. There has been consolidation in our customer base and by our competitors, which has resulted and continues to result in pricing and market pressures.\n1.\nGlobal efforts toward healthcare cost containment continue to exert pressure on product pricing. Governments around the world use various mechanisms to control healthcare expenditures, such as price controls, the formation of public contracting authorities, product formularies (lists of recommended or approved products), and competitive tenders which require the submission of a bid to sell products. Sales of our products are dependent, in part, on the availability of reimbursement by government agencies and healthcare programs, as well as insurance companies and other private payers. In the United States, the federal government and many states have adopted or proposed initiatives relating to Medicaid and other health programs that may limit reimbursement or increase rebates that we and other providers are required to pay to the state. In addition to government regulation, managed care organizations in the United States, which include medical insurance companies, medical plan administrators, health-maintenance organizations, hospital and physician alliances and pharmacy benefit managers, continue to put pressure on the price and usage of healthcare products. Managed care organizations seek to contain healthcare expenditures, and their purchasing strength has been increasing due to their consolidation into fewer, larger organizations and a growing number of enrolled patients. We face similar issues outside of the United States. In Europe and Latin America, for example, the government provides healthcare at low cost to patients, and controls its expenditures by purchasing products through public tenders, collective purchasing, regulating prices, setting reference prices in public tenders or limiting reimbursement or patient access to certain products. Additionally, China has been implementing volume-based procurement policies and a series of centralized reforms on both a national and regional basis which have resulted in significant price cuts for pharmaceuticals and medical consumables. For further discussion, refer to Item 1A. Risk Factors of this Annual Report on Form 10-K.\nIntellectual Property\nPatents and other proprietary rights are essential to our business. We rely on patents, trademarks, copyrights, trade secrets, know-how and confidentiality agreements to develop, maintain and strengthen our competitive position. We own numerous patents and trademarks throughout the world and have entered into license arrangements relating to various third-party patents and technologies. Products manufactured by us are sold primarily under our own trademarks and trade names. Some products distributed by us are sold under our trade names, while others are sold under trade names owned by our suppliers or partners. Trade secret protection of unpatented confidential and proprietary information is also important to us. We maintain certain details about our processes, products and technology as trade secrets and generally require employees, consultants, and business partners to enter into confidentiality agreements. These agreements may be breached and we may not have adequate remedies for any breach. In addition, our trade secrets may otherwise become known or be independently discovered by competitors. To the extent that our employees, consultants, and business partners use intellectual property owned by others in their work for us, disputes may arise as to the rights in related or resulting know-how and inventions.\nOur policy is to protect our products and technology through patents and trademarks on a worldwide basis. This protection is sought in a manner that balances the cost of such protection against obtaining the greatest value for us. We also recognize the need to promote the enforcement of our patents and trademarks and take commercially reasonable steps to enforce our patents and trademarks around the world against potential infringers, including judicial or administrative action where appropriate.\nWe operate in an industry susceptible to significant patent litigation. At any given time, we are involved as either a plaintiff or defendant in a number of patent infringement and other intellectual property-related actions. Such litigation can result in significant royalty or other payments or result in injunctions that can prevent the sale of products. For more information on patent and other litigation, see Note 8 in Item 8 of this Annual Report on Form 10-K.\nResearch and Development\n5\nWe believe our investment in research and development (R&D), consistent with our portfolio optimization and capital allocation strategies, will help fuel our future growth and our ability to remain competitive. Accordingly, we continue to focus our investment on select R&D programs to enhance future growth through clinical differentiation. Expenditures for our R&D activities were $590 million in 2024, $518 million in 2023, and $450 million in 2022. These expenditures include costs associated with R&D activities performed at our R&D centers located around the world, which include facilities in Belgium, India, Italy, Malta and the United States, as well as in-licensing, milestone and reimbursement payments made to partners for R&D work performed at non-Baxter locations. As discussed above in under \"Recent Strategic Actions,\" in the third quarter of 2023, we implemented a new operating model intended to simplify and streamline our operations, including with respect to our R&D activities. We are also working to create a more resilient supply chain and better align our manufacturing footprint and supply chain to our commercial activities. These activities may result in the consolidation of one or more R&D facilities.\nFor more information on our R&D activities, refer to the discussion under the caption entitled “Strategic Objectives” in Item 7. Management's Discussion of Analysis and Financial Condition and Results of Operations of this Annual Report on Form 10-K.\nQuality Management\nOur continued success depends upon the quality of our products. Quality management plays an essential role in determining and meeting customer requirements, helping to prevent defects, facilitating continuing improvement of our processes, products and services, and helping to assure the safety and efficacy of our products. Our quality system enables the design, development, manufacturing, packaging, sterilization, handling, distribution and labeling of our products to help ensure that they conform to customer requirements. In order to consistently improve the effectiveness and efficiency of our quality system, various measurement, monitoring and analysis methods, such as management reviews and internal, external and vendor audits, are employed at local and central levels.\nEach product that we market is required to meet specific quality standards, both in packaging and in product integrity and quality. If any of those is determined to be compromised at any time, we endeavor to take corrective and preventive actions designed to ensure compliance with regulatory requirements and to meet customer expectations. For more information on corrective actions taken by us, refer to the discussion under the caption entitled “Certain Regulatory Matters” in Item 7. Management's Discussion of Analysis and Financial Condition and Results of Operations of this Annual Report on Form 10-K.\nCorporate Responsibility \nDriven by our mission to save and sustain lives, Baxter's corporate responsibility strategy focuses on addressing corporate responsibility matters that affect our patients, customers, employees, communities and other critical stakeholders worldwide. Advancing our corporate responsibility goals contributes to business, social and economic value, including attraction and retention of employees, enhanced operational efficiency and implementation of enterprise risk management strategies, among others.  \nIn 2021, we launched our 2030 Corporate Responsibility Commitment featuring strategic goals for focused action. Our Commitment is anchored by three pillars - Empower our Patients, Protect our Planet and Champion our People and Communities. The 2030 Corporate Responsibility Commitment and Goals highlight Baxter's corporate responsibility focus and help to further advance our corporate responsibility performance. We expect to announce a refreshed Corporate Responsibility commitment and goal set after the issuance of our 2024 Corporate Responsibility Report (to be issued in June 2025), either in a separate announcement or as part of the 2025 Corporate Responsibility Report. This timing should allow for a new, permanent CEO to have the opportunity to review and contribute to our commitment and goals and to reflect recent operational and other developments (including the recent Kidney Care sale). Our progress against our current goals and commitments is published annually in our Corporate Responsibility Report which is available on our website under \"Our Story-Corporate Responsibility.\" The Corporate Responsibility Report is not incorporated by reference into this Annual Report on Form 10-K or any other document filed with the SEC. \nGovernment Regulation\nAs a medical products company, our operations and many of the products manufactured or sold by us are subject to extensive regulation by numerous government agencies, both within and outside the United States. The Food and Drug Administration (FDA) in the United States, the European Medicines Agency (EMA) and the Medicines & \n6\nHealthcare products Regulatory Agency (MHRA) in Europe, the National Medical Products Administration (NMPA) in China and other government agencies, inside and outside of the United States, administer requirements covering the testing, safety, effectiveness, manufacturing, labeling, promotion and advertising, distribution and post-market surveillance of our products. We must obtain specific clearance, approval or other marketing authorization from FDA and non-U.S. regulatory authorities before we can market and sell most of our products in a particular country. Even after we obtain regulatory authorization to market a product, additional regulatory authorization may be necessary to maintain the product in the market, including additional 501(k) clearances, new drug approval (NDA) supplements, and other regulatory submissions. In addition, the raw materials, manufacturing facilities, processes and quality systems used in the manufacture of a product are subject to continued review by FDA and other regulatory authorities globally. State agencies in the United States also regulate our facilities, operations, employees, products and services within their respective states. We, along with our facilities, are subject to periodic inspections and possible administrative and legal actions by FDA and other regulatory agencies inside and outside the United States. Such actions may include warning letters, product recalls or seizures, monetary sanctions, injunctions to halt the manufacture and distribution of products, civil or criminal sanctions, refusal of a government to grant approvals or licenses, restrictions on operations or withdrawal of existing approvals and licenses. As situations require, we take steps to ensure the safety and efficacy of our products, such as removing products from the market that are found not to meet applicable requirements and improving the effectiveness of quality systems. For more information on compliance actions taken by us, refer to the discussion under the caption entitled “Certain Regulatory Matters” in Item 7. Management's Discussion of Analysis and Financial Condition and Results of Operations of this Annual Report on Form 10-K.\nWe are also subject to various laws inside and outside the United States concerning our relationships with healthcare professionals and government officials, price reporting and regulation, the promotion, sales and marketing of our products and services, the importation and exportation of products, the operation of our facilities and the distribution of products. In the United States, we are subject to the oversight of FDA, Office of the Inspector General within the Department of Health and Human Services (OIG), the Center for Medicare/Medicaid Services (CMS), the Department of Justice (DOJ), Environmental Protection Agency, Department of Defense and Customs and Border Protection in addition to others. We supply products and services to healthcare providers that are reimbursed by federally funded programs such as Medicare. As a result, our activities are subject to regulation by CMS and enforcement by OIG and DOJ. In each jurisdiction outside the United States, our activities are subject to regulation by government agencies including the EMA and MHRA in Europe, NMPA in China and other agencies in other jurisdictions. Many of the agencies enforcing these laws have increased their enforcement activities with respect to healthcare companies in recent years. These actions appear to be part of a general trend toward increased enforcement activity globally.\nOur operations involve the use of substances regulated under environmental laws, primarily in manufacturing and sterilization processes. Our environmental policies require compliance with all applicable environmental regulations and contemplate, among other things, appropriate capital expenditures for environmental protection.  \nHuman Capital Management\nAs of December 31, 2024, after giving effect to the Kidney Care sale, we employed approximately 38,000 people globally, with approximately 15,000 employees in the United States and approximately 23,000 employees outside of the United States. Our employees set the foundation for our ability to achieve our strategic objectives. They contribute to our success and are instrumental in driving operational execution and our ability to deliver strong financial performance, advancing innovation and maintaining a strong quality and compliance program across our organization.\nThe success and growth of our business depends in large part on our ability to attract, retain and develop talented and high-performing employees at all levels of our organization with a myriad of backgrounds and experiences, including the individuals who comprise our global workforce as well as executive officers and other key personnel. To succeed in a competitive labor market, we have developed recruitment and retention strategies, objectives and measures that we focus on as part of the overall management of our business. These strategies, objectives and measures form our human capital management framework and are advanced through the following programs, policies and initiatives:\n•\nCompetitive Pay and Benefits.\n Our compensation programs are designed to align the compensation of our employees with our performance and to provide the proper incentives to attract, retain and motivate \n7\nemployees to achieve superior results. The structure of our compensation programs balances incentive earnings for both short-term and long-term performance.\n•\nHealth and Safety.\n Health and safety are firmly rooted across our global footprint. We aim for a zero-harm workplace and prioritize the elimination of risks and incident precursors to drive improvement. In 2024, Baxter focused on employee engagement, hazard identification and accelerated technology deployment to better understand and address top health and safety risk areas. We have continued to mobilize our hazard identification program for our operational workforce, in concert with a centralized corrective action tracking tool. These improvements have enabled us to harvest actionable insights, support ergonomic evaluations and implement safety control technology for improved operation of our powered industrial vehicles.\n•\nRecruitment, Training and Development.\n We use recruitment vehicles to attract talent to our organization and we prioritize learning opportunities that foster a growth mindset. Our formal offerings include a tuition reimbursement program, an e-learning platform known as BaxU and virtual workshops that support our culture, strategy and the development of crucial skills. To assess the impact of the investments we make in our people, and to help us consistently improve our human resources programs, we regularly conduct anonymous surveys of our global workforce to seek feedback on a variety of topics including confidence in our leadership, competitiveness of our compensation and benefits packages, career growth opportunities and improvements on how we can make our company an employer of choice. Administered and analyzed by an independent third-party, the survey results are reviewed by our senior leaders, which include our executive officers. Summaries of select surveys are also provided to our Board of Directors. The results of this engagement survey are also shared with individual managers, who are then tasked with taking action based on their employees’ anonymous feedback. \nAvailable Information\nWe make available free of charge on our website at www.baxter.com our Annual Reports on Form 10-K, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K, and amendments to those reports filed or furnished pursuant to Section 13(a) or 15(d) of the Securities Exchange Act of 1934, as amended (Exchange Act), as soon as reasonably practicable after electronically filing or furnishing such material with the Securities and Exchange Commission. These reports are also available free of charge via EDGAR through the Securities and Exchange Commission website (www.sec.gov).  In addition, our Corporate Governance Guidelines, Code of Conduct, and the charters for the committees of our Board of Directors are available on our website at www.baxter.com under “Our Story — Our Governance.” All the foregoing materials will be made available to stockholders in print upon request by writing to: Corporate Secretary, Baxter International Inc., One Baxter Parkway, Deerfield, Illinois 60015. Information contained on our website shall not be deemed incorporated into, or to be a part of, this Annual Report on Form 10-K.",
  "item7": "Item 7.    \nManagement’s Discussion and Analysis of\n \nFinancial Condition and Results of Operations.\nThe following commentary should be read in conjunction with the consolidated financial statements and accompanying notes included in Item 8 of this Annual Report on Form 10-K. \n34\nEXECUTIVE OVERVIEW\nDescription of the Company, Recent Strategic Actions and Business Segments\nBaxter International Inc. is a global medical technology with approximately 38,000 employees worldwide who are engaged in the development, manufacture and sale of a broad range of products, digital health solutions and therapies used by hospitals, nursing homes, rehabilitation centers, ambulatory surgery centers, doctors’ offices and patients at home under physician supervision. Our global footprint and the critical nature of our products and services, which are sold in over 100 countries as of December 31, 2024, after giving effect to the Kidney Care sale, play a key role in expanding access to healthcare in emerging and developed countries. \nIn mid-2022, our Board of Directors authorized a strategic review of our business portfolio, with the goal of increasing stockholder value. As part of that review process, we identified and evaluated a range of potential strategic actions, including opportunities for sales and other separation transactions. In January 2023, following the completion of that review, we announced a number of planned strategic actions, as discussed below, which are intended to enhance our operational effectiveness, accelerate innovation and drive additional stockholder value. We completed the last of these strategic actions on January 31, 2025 in connection with the sale of our Kidney Care business.\nSale of Kidney Care Business\nOn August 12, 2024, we entered into an Equity Purchase Agreement (EPA ) with certain affiliates of Carlyle Group Inc. (Carlyle) to sell our Kidney Care business, which will be known as Vantive. That business, which is comprised of our Kidney Care segment, provides chronic and acute dialysis therapies and services, including peritoneal dialysis, hemodialysis, continuous renal replacement therapies, and other organ support therapies. On January 31, 2025, we completed the sale of our Kidney Care business to Carlyle for an aggregate purchase price of $3.80 billion in cash, subject to certain closing cash, working capital and debt adjustments. After giving effect to certain adjustments, we received approximately $3.71 billion pre-tax cash proceeds at closing of the transaction with the net after tax proceeds currently estimated to be approximately $3.4 billion, subject to certain post-closing adjustments. As of February 21, 2025, we repaid $3.13 billion of short- and long-term indebtedness primarily with the net after-tax cash proceeds from the sale of our Kidney Care business, and we expect to use substantially all of the remaining net after-tax proceeds to continue to repay indebtedness through the second quarter of 2025.\nWe determined that our Kidney Care business met the criteria to be classified as held-for-sale in August 2024, and we also concluded that it met the conditions to be reported as a discontinued operation at that time. Accordingly, our Kidney Care business is reported in discontinued operations in the accompanying consolidated financial systems, and our prior period results have been adjusted to reflect discontinued operations presentation. The fair value and carrying value of assets held for sale are evaluated each period and a loss on sale is recognized when the fair value less costs to sell are below the carrying value. There has been no loss on sale recognized for the period ending December 31, 2024. We will recognize a gain or loss upon disposition of the business depending on the carrying value at that date, including any tax impacts of the sale, which may be material.\nWe expect to incur dis-synergies following our sale of our Kidney Care business due to the reduced size of our company and, as a result, we have begun to undertake certain actions (and will need to undertake additional actions) to ensure that our cost structure is appropriate to support our remaining businesses. \nSee Notes 2 and 6 in Item 8 of this Annual Report on Form 10-K for additional information. \nImplementation of New Operating Model and Resulting Segment Change\nIn the third quarter of 2023, we completed the implementation of a new operating model intended to simplify and streamline our operations and better align our manufacturing and supply chain to our commercial activities. Under this operating model, our business is currently comprised of three reportable segments: Medical Products & Therapies, Healthcare Systems & Technologies, and Pharmaceuticals. Our segments were changed during the third quarter of 2023 to align with our new operating model. \nThe Medical Products & Therapies segment includes sales of our sterile IV solutions, infusion systems, administration sets, parenteral nutrition therapies and surgical hemostat, sealant and adhesion prevention products. The Healthcare Systems & Technologies segment includes sales of our connected care solutions and collaboration tools, including smart bed systems, patient monitoring systems and diagnostic technologies, respiratory health \n35\ndevices and advanced equipment for the surgical space, including surgical video technologies, precision positioning devices and other accessories. The Pharmaceuticals segment includes sales of specialty injectable pharmaceuticals, inhaled anesthetics and drug compounding services. Other sales not allocated to a segment primarily include sales of products and services provided directly through certain of our manufacturing facilities and royalty income under a business development arrangement that ended in early 2023 when we acquired the related product rights.\nFor financial information about our segments, see Note 18 in Item 8 of this Annual Report on Form 10-K.\nSale of BPS Business\nOn September 29, 2023, we completed the sale of our BPS business and received cash proceeds of $3.96 billion from that transaction. The results of operations and cash flows of our BPS business, including the $2.88 billion pre-tax gain ($2.59 billion net of tax) from the sale of that business and the related cash proceeds received, are reported as discontinued operations in the accompanying consolidated financial statements. We used substantially all of the after-tax proceeds from this transaction to repay certain of our debt obligations, including $514 million of commercial paper borrowings and $2.28 billion of long-term debt that we repaid during the fourth quarter of 2023, as well as €750 million of senior notes that we repaid during the second quarter of 2024.  \nSee Notes 2 and 6 in Item 8 of this Annual Report on Form 10-K for additional information.\nFinancial Results\nOur global net sales totaled $10.64 billion in 2024, an increase of 3% over 2023 on a reported basis and 3% on a constant currency basis. International sales totaled $4.79 billion in 2024, an increase of 5% compared to 2023 on a reported basis and 6% on a constant currency basis. Sales in the United States totaled $5.85 billion in 2024, an increase of 1% compared to 2023. Refer to the Net Sales discussion in the Results of Operations section below for more information related to changes in net sales on a constant currency basis. \nNet income (loss) attributable to Baxter stockholders totaled $(649) million, or $(1.27) per diluted share, in 2024.  Net income (loss) attributable to Baxter stockholders in 2024 included special items which adversely impacted net income (loss) by $2.13 billion, or $4.17 per diluted share. See our special items subsection, in the Results of Operations section below, for information about special items for all periods present.\nNet income (loss) from continuing operations totaled $(326) million, or $(0.64) per diluted share, in 2024. Net income (loss) from continuing operations in 2024 included special items which adversely impacted our results by $1.29 billion, or $2.53 per diluted share. \nOur financial results included research and development (R&D) expenses totaling $590 million in 2024, which reflects our focus on balancing investments to support our new product pipeline with efforts to optimize overall R&D spending (including with respect to the maintenance of our portfolio).\nWhile have faced and may continue to face operational and global macroeconomic challenges, our financial position remains strong, with operating cash flows from continuing operations totaling $819 million in 2024. We have continued to execute on our disciplined capital allocation framework, as discussed in the \"Business Strategy\" section in Item 1. Business of this Annual Report on Form 10-K, which is designed to optimize stockholder value creation through reinvestment in our businesses, dividends and share repurchases, as well as acquisitions and other business development initiatives and debt repayments, consistent with our previously stated commitment to achieve our net leverage targets.\nCapital expenditures totaled $446 million in 2024 as we continued to invest across our businesses to support future growth, including additional investments in support of new and existing product capacity expansions. Our investments in capital expenditures in 2024 were focused on projects that improve production efficiency, enhance our quality systems and optimize manufacturing capabilities to support our business growth.\nWe also continued to return value to our stockholders. During 2024, we paid cash dividends to our stockholders totaling $590 million. \n36\nFACTORS AFFECTING OUR RESULTS OF OPERATIONS\n \nHurricane Helene\nIn September 2024, Hurricane Helene, which brought significant rain and extensive flooding to Western North Carolina, caused damage to certain of our assets at our North Cove facility in Marion, N.C. and disrupted operations at that facility. As we work to fully remediate the facility, we currently expect to incur an estimated $50 million of charges in the first quarter of 2025 primarily consisting of remediation costs, air freight (as we transfer product across our global network in the interest of increasing the availability of intravenous solutions for our customers) and other charges. See Note 1 for further discussion of insurance recoveries related to Hurricane Helene.\nSupply Constraints and Global Economic Conditions\nIn recent years, we have experienced significant challenges to our global supply chain, including production delays and interruptions, increased costs and shortages of raw materials and component parts (including resins and electromechanical devices), higher transportation costs, adverse impacts from significant weather events (including Hurricane Helene and the flooding of our North Cove facility), elevated inflation levels and interest rates, disruptions to certain ports of call and access to shipping ports around the world, the war in Ukraine, the conflict in the Middle East, and other geopolitical events. While we have seen improvements in the availability of component parts and improved pricing in raw materials and on transportation costs, some of these challenges (including certain of those set forth above as we work to fully remediate our North Cove facility) are expected to have a negative impact on our results of operations in the future.\nOur results of operations are also affected by macroeconomic conditions and levels of business confidence. The war in Ukraine, the conflict in the Middle East, other geopolitical events, the sanctions and other measures being imposed in response to these conflicts (and the potential for escalation of these conflicts), recently imposed or future quotas, duties or tariffs and any retaliatory counter measures, and recent political changes to trade policies, have increased the levels of economic and political uncertainty and we continue to closely monitor the developing situations. While we have substantially completed our wind down efforts related to our business in Russia, a significant escalation or expansion of economic disruption or the current scope of the war in Ukraine could have an adverse effect on our operations (including our supply chain) in the region.\nThe existence of high inflation rates in the United States and in many of the countries where we conduct business has resulted in, and may in the future result in, higher interest rates, shipping costs, labor costs, and other costs and expenses. Additionally, adverse changes in foreign currency exchange rates have increased, and could continue to increase, our costs of sourcing certain raw materials in some jurisdictions. We have experienced and may in the future experience inflationary increases in manufacturing costs and operating expenses and we may not be able to pass these cost increases on to our customers in a timely manner or at all, which could have a material adverse impact on our profitability and results of operations. Inflation and general macroeconomic factors have caused certain of our customers to reduce or delay orders for our products and services and could cause them to do so in the future, which could have a material adverse impact on our sales and results of operations.\nAs a medical products company, our operations and many of the products manufactured or sold by us are subject to extensive regulation by numerous government agencies, both within and outside the United States. These regulations (as described in Item 1, Government Regulation, of this Annual Report on Form 10-K) require that we obtain specific approval from FDA or applicable non-U.S. regulatory authorities before we can market and sell most of our products in a particular country. Failure to obtain or maintain those approvals or clearances (including temporary importation authorizations) could have a material adverse impact on our business (including with respect to our ability to compete in the product markets in which we currently operate). Furthermore, FDA in the United States, the EMA and MHRA in Europe, the NMPA in China, and other government agencies, inside and outside of the United States, administer requirements covering the testing, safety, effectiveness, manufacturing, labeling, promotion and advertising, pricing, distribution, and post-market surveillance of our products. Our failure to comply with these requirements may subject us to various actions, including warning letters, product recalls or seizures, monetary sanctions, injunctions to halt the manufacture and distribution of products, civil or criminal sanctions, refusal of a government to grant approvals or licenses, restrictions on operations or withdrawal of existing approvals and licenses, and may have a material adverse impact on our results of operations.\nFor further discussion, please refer to Item 1A. Risk Factors of this Annual Report on Form 10-K.\n37\nRECENT BUSINESS COMBINATIONS AND ASSET ACQUISITIONS\nZosyn\nOn March 22, 2022, we entered into an agreement with a subsidiary of Pfizer Inc. to acquire the rights to Zosyn, a premixed frozen piperacillin-tazobactam product, in the U.S. and Canada. Zosyn is used for the treatment of intra-abdominal infections, nosocomial pneumonia, skin and skin structure infections, female pelvic infections and community-acquired pneumonia. Under the terms of the acquisition, we paid the acquisition price of $122 million and received specified intellectual property, including patent rights, in the first quarter of 2022 and received additional intellectual property, including the product rights to Zosyn, in the first quarter of 2023. Under the arrangement, we received profit sharing payments from sales of Zosyn until the product rights transferred to us in March 2023. Refer to Note 3 in Item 8 of this Annual Report on Form 10-K for additional information regarding our acquisition of the rights to Zosyn.\nHillrom\nIn 2021, we acquired Hillrom. In 2024, 2023 and 2022 our Healthcare Systems & Technologies segment (formerly referred to as our Hillrom segment) generated net sales of $2.95 billion, $3.01 billion, and $2.94 billion, respectively. During 2024, we recorded a $425 million goodwill impairment related to our Front Line Care reporting unit within our Healthcare Systems & Technologies segment. During 2022, we also recognized $2.81 billion of goodwill impairments and $332 million of indefinite-lived intangible asset impairments related to goodwill and trade name intangible assets that arose from the Hillrom acquisition. See Notes 3, 5 and 18 in Item 8 of this Annual Report on Form 10-K for additional information about the Hillrom acquisition, goodwill and intangible asset impairments, and our Healthcare Systems & Technologies segment results, respectively.\nNON-GAAP FINANCIAL MEASURES\nOur presentation of percentage changes in net sales at constant currency rates, which is computed using current period local currency sales at the prior period’s foreign exchange rates, is a non-GAAP financial measure. This measure provides information about growth (or declines) in our net sales as if foreign currency exchange rates had not changed between the prior period and the current period. We believe that the non-GAAP measure of percent change in net sales at constant currency rates, when used in conjunction with the U.S. GAAP measure of percent change in net sales at actual currency rates, may provide a more complete understanding and facilitate a fuller analysis of our results of operations, particularly in evaluating performance from one period to another.\nRESULTS OF OPERATIONS\nCONSOLIDATED NET SALES\nPercent change\nAt actual\ncurrency rates\nAt constant\ncurrency rates \n3\nyears ended December 31 (in millions)\n2024\n2023\n2022\n2024\n2023\n2024\n2023\nUnited States\n$\n5,850 \n$\n5,802 \n$\n5,769 \n1 \n%\n1 \n%\n1 \n%\n1 \n%\nEmerging markets \n1\n1,350 \n1,343 \n1,253 \n1 \n%\n7 \n%\n3 \n%\n8 \n%\nRest of world \n2\n3,436 \n3,215 \n3,035 \n7 \n%\n6 \n%\n7 \n%\n6 \n%\nTotal net sales\n$\n10,636 \n$\n10,360 \n$\n10,057 \n3 \n%\n3 \n%\n3 \n%\n3 \n%\n1\n \nEmerging markets include sales from our operations in Eastern Europe, the Middle East, Africa, Latin America and Asia (except for Japan).\n2\n Rest of world includes sales from our operations in Western Europe, Canada, Japan, Australia and New Zealand.\n3\n Percent change in net sales at constant currency rates is a non-GAAP financial measure. See the section entitled “Non-GAAP Financial Measures” for additional information about our use of that measure.\n38\nAs set forth above, foreign currency had no material impact on net sales during the year ended December 31, 2024, as compared to the prior year period, primarily due to the strengthening of the U.S. Dollar relative to the Turkish Lira, Japanese Yen, Brazilian Real, Mexican Peso, and the Canadian Dollar, offset by the weakening of the U.S. Dollar relative to the British Pound and Colombian Peso. Foreign currency had no material impact on net sales during the year ended December 31, 2023, as compared to the prior year period, primarily due to the strengthening of the U.S. Dollar relative to the Euro, Turkish Lira, Australian Dollar, Japanese Yen and Chinese Renminbi offset by the weakening of the U.S. Dollar relative to the Mexican Peso and Brazilian Real.\nNET SALES BY SEGMENT\nMedical Products & Therapies\nOur Medical Products & Therapies segment includes sales of our sterile IV solutions, infusion systems, administration sets, parenteral nutrition therapies and surgical hemostat, sealant and adhesion prevention products. \nPercent change\nyears ended December 31 (in millions)\n2024\n2023\nAt actual\ncurrency rates\nAt constant\ncurrency rates \n1\nInfusion Therapies & Technologies\n$\n4,103 \n$\n3,960 \n4 \n%\n4 \n%\nAdvanced Surgery\n1,104 \n1,051 \n5 \n%\n6 \n%\nTotal Medical Product & Therapies net sales\n$\n5,207 \n$\n5,011 \n4 \n%\n5 \n%\n1\n Percent change in net sales at constant currency rates is a non-GAAP financial measure. See the section entitled “Non-GAAP Financial Measures” for additional information about our use of that measure.\nMedical Product & Therapies segment net sales increased 4% for the year ended December 31, 2024, as compared to the prior year period. \nInfusion Therapies & Technologies net sales increased 4% for the year ended December 31, 2024, as compared to the prior year period. Sales performance in 2024 primarily reflected growth in Infusion Systems as a result of sales of our Novum IQ large volume infusion and syringe pump in the U.S., and sales of Nutrition product offerings, which was attributable to both pricing initiatives and increased sales volume. In September 2024, Hurricane Helene, which brought significant rain and extensive flooding to Western North Carolina, caused damage to certain of our assets at our North Cove facility in Marion, N.C. and disrupted operations at that facility. This facility, which manufactures IV Solutions primarily for the U.S. market, was not fully operational for most of the fourth quarter. As a consequence, Hurricane Helene had an estimated $110 million adverse impact on sales, which offset price and underlying volume gains during the year.\nAdvanced Surgery net sales increased 5% for the year ended December 31, 2024, as compared to the prior year period, driven by growth in hemostats and sealants and was primarily attributable to increased sales volume. Foreign currency exchange rates adversely impacted net sales by 1% for the year ended December 31, 2024, as compared to the prior year period.\nPercent change\nyears ended December 31 (in millions)\n2023\n2022\nAt actual\ncurrency rates\nAt constant\ncurrency rates \n1\nInfusion Therapies & Technologies\n$\n3,960 \n$\n3,817 \n4 \n%\n4 \n%\nAdvanced Surgery\n1,051 \n998 \n5 \n%\n6 \n%\nTotal Medical Product & Therapies net sales\n$\n5,011 \n$\n4,815 \n4 \n%\n4 \n%\n1\n Percent change in net sales at constant currency rates is a non-GAAP financial measure. See the section entitled “Non-GAAP Financial Measures” for additional information about our use of that measure.\nMedical Product & Therapies segment net sales increased 4% for the year ended December 31, 2023, as compared to the prior year period. \nInfusion Therapies & Technologies net sales increased 4% for the year ended December 31, 2023, as compared to the prior year period. Sales performance in 2023 reflected strong demand for our infusion systems and \n39\nadministration sets, as well as growth in IV solutions and international nutrition compounding, partially offset by lower sales of parenteral nutrition products in the U.S. as compared to the prior year. \nAdvanced Surgery net sales increased 5% for the year ended December 31, 2023, as compared to the prior year period, driven by continued recovery in surgical procedures, partially offset by temporary supply constraints, the exit of a product distribution arrangement and a comparison against prior year periods that benefited from competitor supply constraints. Foreign currency exchange rates adversely impacted net sales by 1% for the year ended December 31, 2023, as compared to the prior year period.\nHealthcare Systems & Technologies\nOur Healthcare Systems & Technologies segment includes sales of our connected care solutions and collaboration tools, including smart bed systems, patient monitoring systems and diagnostic technologies, respiratory health devices and advanced equipment for the surgical space, including surgical video technologies, precision positioning devices and other accessories.\nPercent change\nyears ended December 31 (in millions)\n2024\n2023\nAt actual\ncurrency rates\nAt constant\ncurrency rates \n1\nCare and Connectivity Solutions\n$\n1,814 \n$\n1,800 \n1 \n%\n1 \n%\nFront Line Care\n1,137 \n1,213 \n(6)\n%\n(6)\n%\nTotal Healthcare Systems & Technologies net sales\n$\n2,951 \n$\n3,013 \n(2)\n%\n(2)\n%\n1\n Percent change in net sales at constant currency rates is a non-GAAP financial measure. See the section entitled “Non-GAAP Financial Measures” for additional information about our use of that measure.\nHealthcare Systems & Technologies segment net sales decreased 2% for the year ended December 31, 2024, as compared to the prior year period. \nCare and Connectivity Solutions net sales increased 1% for the year ended December 31, 2024, driven by increased order volume associated with capital spending in the U.S. as compared to the prior year, partially offset by declines in care communication products driven by the shifting of installations to future periods and lower sales outside of the U.S.\nFront Line Care net sales decreased 6% for the year ended December 31, 2024, as compared to the prior year period, primarily driven by a backlog reduction in the prior year period which increased sales in the prior year, reduced demand in the primary care market, lower government orders, certain product exits and select supply constraints impacting product availability. These declines were partially offset by growth in our cardiology products.\nPercent change\nyears ended December 31 (in millions)\n2023\n2022\nAt actual\ncurrency rates\nAt constant\ncurrency rates \n1\nCare and Connectivity Solutions\n$\n1,800 \n$\n1,791 \n1 \n%\n1 \n%\nFront Line Care\n1,213 \n1,148 \n6 \n%\n6 \n%\nTotal Healthcare Systems & Technologies net sales\n$\n3,013 \n$\n2,939 \n3 \n%\n3 \n%\n1\n Percent change in net sales at constant currency rates is a non-GAAP financial measure. See the section entitled “Non-GAAP Financial Measures” for additional information about our use of that measure.\nHealthcare Systems & Technologies segment net sales increased 3% for the year ended December 31, 2023, as compared to the prior year period.  \nCare and Connectivity Solutions net sales increased 1% for the year ended December 31, 2023, as compared to the prior year period, driven by international demand and sales generated from recent product launches in the U.S., partially offset by lower rental revenues and lower capital spending in the U.S. reflecting the macroeconomic environment in 2023.\nFront Line Care net sales increased 6% for the year ended December 31, 2023, as compared to the prior year period, primarily driven by increased demand for our cardiology products, patient monitoring systems and physical assessment tools. Performance in the current year benefited from backlog reductions due to improved availability of component parts used in certain of our products. \n40\nPharmaceuticals\nOur Pharmaceuticals segment includes sales of specialty injectable pharmaceuticals, inhaled anesthetics and drug compounding services.\nPercent change\nyears ended December 31 (in millions)\n2024\n2023\nAt actual\ncurrency rates\nAt constant\ncurrency rates \n1\nInjectables and Anesthesia\n$\n1,373 \n$\n1,347 \n2 \n%\n3 \n%\nDrug Compounding\n1,038 \n902 \n15 \n%\n15 \n%\nTotal Pharmaceuticals net sales\n$\n2,411 \n$\n2,249 \n7 \n%\n7 \n%\n1\n Percent change in net sales at constant currency rates is a non-GAAP financial measure. See the section entitled “Non-GAAP Financial Measures” for additional information about our use of that measure.\nPharmaceuticals segment net sales increased 7% for the year ended December 31, 2024, as compared to the prior year period. \nInjectables and Anesthesia net sales increased 2% for the year ended December 31, 2024, as compared to the prior year period, primarily due to growth in our U.S. specialty injectable products, driven by strong sales volume in our core portfolio and recent product launches, partially offset by declines for inhaled anesthetics. Foreign currency exchange rates adversely impacted net sales by 1% for the year ended December 31, 2024, as compared to the prior year period.\nDrug Compounding net sales increased 15% for the year ended December 31, 2024, as compared to the prior year period, driven by increased demand for our international pharmacy compounding offerings, due in part, to customer capacity constraints that resulted in increased outsourcing of compounding activities. \nPercent change\nyears ended December 31 (in millions)\n2023\n2022\nAt actual\ncurrency rates\nAt constant\ncurrency rates \n1\nInjectables and Anesthesia\n$\n1,347 \n$\n1,305 \n3 \n%\n4 \n%\nDrug Compounding\n902 \n821 \n10 \n%\n12 \n%\nTotal Pharmaceuticals net sales\n$\n2,249 \n$\n2,126 \n6 \n%\n7 \n%\n1\n Percent change in net sales at constant currency rates is a non-GAAP financial measure. See the section entitled “Non-GAAP Financial Measures” for additional information about our use of that measure.\nPharmaceuticals segment net sales increased 6% for the year ended December 31, 2023, as compared to the prior year period. \nInjectables and Anesthesia net sales increased 3% for the year ended December 31, 2023, as compared to the prior year period, primarily due to growth in our U.S. injectable products, driven by our launches of Zosyn, following the transfer of the related product rights to us in April 2023, Bendamustine and Norepinephrine, partially offset by lower sales of inhaled anesthesia products. Foreign currency exchange rates adversely impacted net sales by 1% for the year ended December 31, 2023, as compared to the prior year period.\nDrug Compounding net sales increased 10% for the year ended December 31, 2023, as compared to the prior year period, driven by increased demand for our international pharmacy compounding services. Foreign currency exchange rates adversely impacted net sales by 2% for the year ended December 31, 2023, as compared to the prior year period. \nOther \nDuring the years ended December 31, 2024, 2023 and 2022, we earned $67 million, $87 million and $177 million, respectively, of revenues that were not attributable to our reportable segments. In the current and prior year periods, Other sales primarily represent revenues earned by certain of our manufacturing facilities from contract manufacturing activities. The years ended December 31, 2023 and 2022 also included royalty income under a business development arrangement. The decrease in Other sales for the year ended December 31, 2024 as compared to the prior year period reflects lower contract manufacturing volume. The decrease for the year ended December 31, 2023 as compared to the prior year period was primarily driven by lower contract manufacturing \n41\nvolume and, to a lessor extent, termination of the royalty arrangement following our acquisition of the rights to the underlying product. \nSpecial Items\nManagement believes that providing the separate impact of the following items on our results in accordance with U.S. GAAP may provide a more complete understanding of our operations and can facilitate a fuller analysis of our results of operations, particularly in evaluating performance from one period to another. Intangible asset amortization expense is identified as a special item to facilitate an evaluation of current and past operating performance and is consistent with how management and our Board of Directors assess performance. Additional special items are identified because they are highly variable, difficult to predict and of a size that may substantially impact our reported results of operations for the period. \n42\nThe following table provides a summary of our special items and the related impact by line item on our consolidated results of operations for 2024, 2023 and 2022.\nyears ended December 31 (in millions)\n2024\n2023\n2022\nGross Margin\nIntangible asset amortization expense\n$\n(419)\n$\n(383)\n$\n(392)\nLong-lived asset impairments\n1\n— \n— \n(344)\nBusiness optimization items\n2\n(67)\n(27)\n(16)\nProduct related items\n3\n(15)\n— \n(44)\nAcquisition and integration items\n4\n(1)\n(1)\n(170)\nEuropean medical devices regulation\n5\n(33)\n(41)\n(42)\nHurricane Helene costs\n6\n(110)\n— \n— \nTotal Special Items\n$\n(645)\n$\n(452)\n$\n(1,008)\nImpact on Gross Margin Ratio\n(6.0 pts)\n(4.3 pts)\n(10.0 pts)\nSelling, General and Administrative (SG&A) Expenses\nIntangible asset amortization expense\n$\n206 \n$\n207 \n$\n287 \nBusiness optimization items\n2\n65 \n137 \n174 \nAcquisition and integration items\n4\n22 \n18 \n82 \nLegal matters\n7\n17 \n15 \n— \nTotal Special Items\n$\n310 \n$\n377 \n$\n543 \nImpact on SG&A Expense Ratio\n2.9 pts\n3.6 pts\n5.4 pts\nR&D Expenses\nBusiness optimization items\n2\n$\n30 \n$\n10 \n$\n3 \nLong-lived asset impairments\n1\n50 \n— \n— \nTotal Special Items\n$\n80 \n$\n10 \n$\n3 \nImpact on R&D Expense Ratio\n0.7 pts\n0.1 pts\n0.1 pts\nGoodwill Impairments\nGoodwill impairments\n8\n$\n425 \n$\n— \n$\n2,812 \nTotal Special Items\n$\n425 \n$\n— \n$\n2,812 \nOther Operating Expense (Income), Net\nAcquisition and integration items\n4\n$\n— \n$\n(19)\n$\n(39)\nLegal matters\n7\n— \n(8)\n— \nLoss on product divestiture arrangement\n9\n— \n— \n54 \nLoss on subsidiary liquidation\n10\n— \n— \n21 \nTotal Special Items\n$\n— \n$\n(27)\n$\n36 \nOther (Income) Expense, Net\nPension curtailment\n11\n$\n— \n$\n— \n$\n(11)\nReclassification of cumulative translation loss to earnings\n12\n— \n— \n65 \nInvestment impairments\n13\n— \n31 \n— \nTotal Special Items\n$\n— \n$\n31 \n$\n54 \nIncome Tax Expense (Benefit)\nTax matters\n14\n$\n80 \n$\n65 \n$\n25 \nTax effects of special items\n15\n(248)\n(226)\n(375)\nTotal Special Items\n$\n(168)\n$\n(161)\n$\n(350)\nImpact on Effective Tax Rate\n(30.3) pts\n4.7 pts\n(13.6) pts\n1\nOur results in 2024 included a long-lived asset impairment charge of $50 million to reduce the carrying amount of an IPR&D asset to its fair value. Our results in 2022 included long-lived asset impairment charges related to assets acquired in our December 2021 acquisition of Hillrom, comprised of (i) $332 million of indefinite-lived intangible assets and (ii) $12 million of developed technology intangible asset impairments. Refer to Notes 3 and 5 in Item 8 of this Annual Report on Form 10-K for further information regarding the impairments. Long-lived asset impairments presented within this special item do not include impairments of long-lived assets related to restructuring actions, which are presented within the business optimization special item described in footnote 2 below.\n43\n2\nOur results in 2024, 2023 and 2022 were impacted by costs associated with our execution of programs to optimize our organization and cost structure. In 2024, these restructuring and other business optimization costs included costs primarily related to initiatives to reduce our cost structure following the sale of our Kidney Care segment, initiatives within our Healthcare Systems & Technologies segment including the discontinuance of a product line and rationalization of certain other manufacturing and distribution facilities. In 2023 and 2022, these restructuring and other business optimization costs included actions related to our implementation of a new operating model intended to simplify and streamline our operations and better align our manufacturing and supply chain to our commercial activities, and our ongoing integration of Hillrom. Our results in 2024 and 2023 and 2021 included business optimization charges of $162 million, $174 million, $193 million, respectively. Refer to Note 12 in Item 8 of this Annual Report on Form 10-K for further information regarding these charges and related liabilities. \n3\nOur results in 2024 included charges of $15 million, comprised of (i) $12 million related to warranty and remediation activities arising from field corrective actions on Healthcare Systems & Technologies products and (ii) $3 million related to a revised estimate of warranty and remediation activities arising from a field corrective action on certain of our infusion pumps initially recorded in 2022. Our results in 2022 included charges of $44 million related to warranty and remediation activities arising from two field corrective actions on certain of our infusion pumps. \n4\nOur results in 2024 included $23 million of integration costs which primarily reflected third-party consulting costs related to our integration of Hillrom. Our results in 2023 included $19 million of integration-related costs, primarily related to our integration of Hillrom, offset by a $19 million benefit from changes in the estimated fair values of contingent consideration liabilities. Our results in 2022 included $213 million of acquisition and integration-related items, which reflected $93 million of integration-related costs and $159 million of incremental cost of sales from the fair value step-ups on acquired Hillrom inventory that was sold in 2022, partially offset by a $39 million benefit from changes in the estimated fair value of contingent consideration liabilities. Refer to Note 3 in Item 8 of this Annual Report on Form 10-K for further information regarding business and asset acquisitions. \n5\nOur results in 2024, 2023 and 2022 included $33 million, $41 million and $42 million, respectively, of incremental costs to comply with the European Union's medical device regulations for previously registered products, which primarily consist of contractor costs and other direct third-party costs. We consider the adoption of these regulations to be a significant one-time regulatory charge and believe that the costs of initial compliance for previously registered products over the implementation period are not indicative of our core operating results. \n6\nOur results in 2024 included pre-tax net charges of $110 million related damages caused by Hurricane Helene. This amount consisted of $44 million related to the write-off of damaged inventory and fixed assets, as well as $317 million of remediation, idle facility, air freight and other costs, partially offset by $251 million of insurance recoveries. Refer to Note 1 in Item 8 of this Annual Report on Form 10-K for further information. \n7\nOur results in 2024 included charges of $17 million related to environmental reserves for remediation actions associated with historic operations at certain of our facilities. Our results in 2023 included $7 million of net costs from certain legal matters. These costs included $13 million, including related legal fees, related to matters involving alleged violations of the False Claims Act related to a now-discontinued legacy Hillrom sales line and alleged injury from environmental exposure, partially offset by $6 million of proceeds received, net of related legal fees, from a settlement related to an intellectual property dispute.\n8\nOur results in 2024 included a goodwill impairment charge of $425 million related to the Front Line Care reporting unit within our Health Care Systems & Technologies segment. Our results in 2022 included goodwill impairment charges of $2.81 billion related to reporting units within our Health Care Systems & Technologies segment. Refer to Notes 3 and 5 in Item 8 of this Annual Report on Form 10-K for further information regarding these goodwill impairments.\n9\nOur results in 2022 included a loss of $54 million under an arrangement to divest certain product rights for an amount that is less than our cost of those product rights, which was triggered by U.S. and European Union regulatory approvals of the related products. Refer to Note 3 in Item 8 of this Annual Report on Form 10-K for further information about the related transactions.\n10\nOur results in 2022 included a loss of $21 million related to our deconsolidation of a foreign subsidiary, including the derecognition of a related noncontrolling interest, upon its liquidation in December 2022 that was completed in connection with our legal entity rationalization activities. \n11\nOur results in 2022 included a curtailment gain of $11 million related to an announced change for active non-bargaining participants in our U.S. Hillrom pension plan. Refer to Note 13 in Item 8 of this Annual Report on Form 10-K for further information regarding this curtailment gain.\n12\nOur results in 2022 included a charge of $65 million for cumulative translation adjustments (CTA) reclassified from accumulated other comprehensive income (loss) as a result of the substantial liquidation of our operations in Argentina.\n13\nOur results in 2023 included $31 million of net pre-tax losses from non-marketable investments in several early-stage companies, consisting of $34 million of noncash impairment write-downs, partially offset by a $3 million gain from the sale of an investment.  \n14\nOur results in 2024 included a $80 million net income tax expense consisting of a $28 million valuation allowance recorded to reduce the carrying amount of tax attribute carryforwards in the U.S., $22 million of net income tax costs on internal reorganization transactions related to the sale of our Kidney Care segment, a $17 million income tax expense related to legislative changes under Internal Revenue Code of 1986 (IRC) Section 987 (which is the exchange gain or loss on foreign branch remittances in the U.S., effective in 2024), and a $13 million net revaluation of the Swiss basis step-up deferred tax asset and related valuation allowance that arose from Swiss tax reform legislation in 2019 that was partially offset by a decrease in such valuation allowance to reflect our current estimate of recoverability of the basis step-up deferred tax asset. Our results in 2023 included a $14 million income tax expense from separation related income tax costs associated with the sale of our BPS business, and a $9 million valuation allowance to reduce the carrying amount of a deferred tax asset for a tax basis step-up related to previously enacted Swiss tax reform legislation to reflect our current estimate of its recoverability with the remaining tax expense related to the tax effects of other special items. Our results in 2022 included a $25 million valuation allowance to reduce the carrying amount of a deferred tax asset for a tax basis step-up related to previously enacted Swiss tax reform legislation to reflect our current estimate of its recoverability.\n15\nThis item reflects the income tax impact of the special items identified in this table. The tax effect of each special item is based on the jurisdiction in which the item was incurred and the tax laws in effect for each such jurisdiction.\nCOSTS AND EXPENSES\n44\nGross Margin and Expense Ratios\n2024\n2023\nyears ended December 31\n2024\n% of net sales\n2023\n% of net sales\n2022\n% of net sales\n$ change\n% change\n$ change\n% change\nGross margin\n$\n3,984 \n37.5 \n%\n$\n4,150 \n40.1 \n%\n$\n3,549 \n35.3 \n%\n$\n(166)\n(4.0)\n%\n$\n601 \n16.9 \n%\nSG&A\n$\n2,967 \n27.9 \n%\n$\n2,953 \n28.5 \n%\n$\n3,097 \n30.8 \n%\n$\n14 \n0.5 \n%\n$\n(144)\n(4.6)\n%\nR&D\n$\n590 \n5.5 \n%\n$\n518 \n5.0 \n%\n$\n450 \n4.5 \n%\n$\n72 \n13.9 \n%\n$\n68 \n15.1 \n%\nGross Margin\nThe gross margin ratio was 37.5%, 40.1% and 35.3% for the years ended 2024, 2023 and 2022, respectively. The special items identified earlier in this section had an unfavorable impact on gross margin ratio of 6.0, 4.3, and 10.0\n \npercentage points in 2024. 2023, and 2022, respectively. Refer to the Special Items caption earlier in this section for additional detail.\nExcluding the impact of special items, the gross margin ratio decreased 0.9 percentage points in 2024 compared to 2023 and decreased 0.9 percentage points in 2023 compared to 2022. The decrease in 2024 was driven by an unfavorable product mix, partially offset by initiatives to reduce our manufacturing and supply chain costs. The decrease in 2023 was primarily due to the adverse cost impacts of raw materials inflation driving higher manufacturing costs and higher bonus accruals under our annual employee incentive compensation plans, partially offset by manufacturing initiatives.\nSG&A\nThe SG&A expense ratio was 27.9%, 28.5% and\n \n30.8% for the years ended 2024, 2023 and 2022, respectively. The special items identified earlier in this section had an unfavorable impact on the SG&A expense ratio of 2.9, 3.6 and 5.4 percentage points in 2024, 2023 and 2022, respectively. Refer to the Special Items caption earlier in this section for additional detail.\nExcluding the impact of special items, the SG&A expense ratio increased 0.1 percentage points in 2024 compared to 2023 and decreased 0.5 percentage points in 2023 compared to 2022. The increase in 2024 was primarily due to higher corporate function costs and annual compensation increases, partially offset by lower accruals under our annual employee incentive compensation plans. The decrease in 2023 was primarily due to savings from restructuring actions implemented in recent periods, partially offset by higher bonus accruals under our annual employee incentive compensation plans.\nR&D\nThe R&D expense ratio was 5.5%, 5.0% and 4.5% for the years ended 2024, 2023 and 2022, respectively. The special items identified earlier in this section had an unfavorable impact on the R&D expense ratio of 0.7 percentage points in 2024\n, \nand 0.1 percentage points both in 2023 and 2022. Refer to the Special Items caption earlier in this section for additional detail.\nExcluding the impact of special items, the R&D expense ratio decreased 0.1 percentage points in 2024 compared to 2023 and increased 0.5 basis points in 2023 compared to 2022. The decrease in 2024 was driven by lower bonus accruals under our annual employee incentive compensation plans. The increase in 2023 reflected higher outbound freight costs.\nBusiness Optimization Items\nIn recent years, we have undertaken actions to transform our cost structure and enhance operational efficiency. These efforts include restructuring the organization, optimizing the manufacturing footprint, R&D operations and supply chain network, employing disciplined cost management and centralizing and streamlining certain support functions. The costs of restructuring actions consisted primarily of employee termination costs, contract termination costs and asset impairments. \nWe incurred restructuring charges of $162 million, $174 million and $193 million in 2024, 2023 and 2022, respectively. In 2024, $45 million of the restructuring charges, consisting of employee termination costs, were related to initiatives to reduce our cost structure following the sale of our Kidney Care segment. In addition, $46 \n45\nmillion of the restructuring charges were related to business optimization initiatives within our Healthcare Systems & Technologies segment. These charges included $21 million of long-lived asset impairment charges, $9 million of other asset write-downs related to inventory and $2 million of employee termination costs related to our decision to discontinue a product line. Additionally, these charges included $14 million of employee termination costs related to other business optimization initiatives within this segment. In 2023, $81 million of the restructuring charges, consisting of employee termination costs, were related to the implementation of our new operating model intended to streamline our operations. In 2022, $85 million restructuring charges were related to integration activities for the Hillrom acquisition, consisting of $55 million of employee termination costs, $22 million of contract terminations and other costs and $8 million of asset impairments. \nWe currently expect to incur additional pre-tax cash costs, primarily related to the implementation of business optimization programs, of approximately $4 million through the completion of initiatives that are currently underway. We continue to pursue cost savings initiatives, including those intended to mitigate a portion of the dis-synergies expected to arise as a result of the sale of our Kidney Care business, and to the extent further cost savings opportunities are identified, we would incur additional restructuring charges and costs to implement business optimization programs in future periods. Refer to Note 12 in Item 8 of this Annual Report on Form 10-K for additional information regarding our business optimization programs.\nGoodwill Impairments\nWe assess goodwill and indefinite-lived intangible assets for impairment annually during the fourth quarter or whenever events or changes in circumstances indicate that the carrying amount of such assets may not be recoverable. We recognize a goodwill impairment charge for the amount by which a reporting unit's carrying amount exceeds its fair value.\nIn connection with our annual goodwill impairment assessment in the fourth quarter of 2024, we recorded a $425 million goodwill impairment related to our Front Line Care reporting unit within our Healthcare Systems & Technologies segment. The reduction in value was primarily due to lower forecasted operating results and a lower terminal growth rate utilized in valuing this reporting unit which contributed to reduced expected future cash flows, as well as lower earnings multiples. The fair value of the Front Line Care reporting unit was determined based on a discounted cash flow model (an income approach) and earnings multiples (a market approach) based on the guideline public company method. Significant assumptions used in the determination of the fair values of our reporting units generally include revenue growth rates, forecasted earnings before income, taxes, depreciation and amortization (EBITDA) margins, discount rates, terminal growth rates and earnings multiples. The discounted cash flow model used to determine the fair value of our Front Line Care reporting unit reflected our most recent cash flow projections, a discount rate of 9.5% and a terminal growth rate of 3.25%. Our reporting unit fair value measurements are classified as Level 3 in the fair value hierarchy because they involve significant unobservable inputs. As of December 31, 2024, the carrying amount of goodwill for our Front Line Care reporting unit was $1.99 billion. No goodwill impairments were recorded for our remaining reporting units in connection with our annual goodwill impairment tests because the fair values of those reporting units exceeded their carrying amounts. Refer to Note 5 in Item 8 of this Annual Report on Form 10-K for additional information regarding this goodwill impairment charge.\nWe acquired Hillrom on December 13, 2021 and recognized $6.83 billion of goodwill and $6.03 billion of other intangible assets, including $1.91 billion of indefinite-lived intangible assets, in connection with that acquisition. During the third quarter of 2022, we performed trigger-based impairment tests for each of the reporting units within our Hillrom segment (currently referred to as our Healthcare Systems & Technologies segment), as well as the indefinite-lived intangible assets, consisting primarily of trade names, that we acquired in connection with the Hillrom acquisition. We performed those tests as of September 30, 2022 due to (a) current macroeconomic conditions, including the rising interest rate environment and broad declines in equity valuations, and (b) reduced earnings forecasts for our three Hillrom reporting units, driven primarily by shortages of certain component parts used in our products, raw materials inflation and increased supply chain costs. Those goodwill impairment tests resulted in total pre-tax goodwill impairment charges of $2.79 billion in the third quarter of 2022. In connection with our annual goodwill impairment assessment in the fourth quarter of 2022, we performed quantitative impairment tests for all our reporting units and recorded an additional $27 million goodwill impairment related to our Global Surgical Solutions reporting unit (now combined with our previous Patient Support Systems reporting unit in our Care and Connectivity \n46\nSolutions reporting unit). Refer to Note 3 in Item 8 of this Annual Report on Form 10-K for additional information regarding these goodwill impairment charges.\nFurther adverse changes to macroeconomic conditions or our earnings forecasts could lead to additional goodwill impairment charges in future periods and such charges could be material to our results of operations. For further discussion, refer to Item 1A. Risk Factors of this Annual Report on Form 10-K.\nOther Operating Expense (Income), Net\nOther operating expense (income), net was income of $12 million in 2024, income of $28 million in 2023 and expense of $35 million in 2022. The income in 2024 was comprised of income from transition services arrangements related to the divestiture of our BPS business. In 2023, this amount was comprised of gains from changes in the estimated fair value of contingent consideration arrangements and proceeds from a settlement related to an intellectual property dispute. In 2022, we recognized a loss of $54 million under an arrangement to divest certain product rights for an amount that was less than our cost of those product rights, which was triggered by U.S. and European Union regulatory approvals of the related products. Refer to Note 3 in Item 8 of this Annual Report on Form 10-K for further information about the related transactions. Additionally, we recognized a loss of $21 million related to the deconsolidation of a foreign subsidiary, including the derecognition of a related noncontrolling interest, upon its liquidation in December 2022 that was completed in connection with our legal entity rationalization activities. Those losses were partially offset by gains of $39 million from net decreases in the estimated fair values of contingent consideration liabilities. \nInterest Expense, Net\nInterest expense, net was $341 million, $439 million and $394 million in 2024, 2023 and 2022, respectively. The decrease in 2024 was driven by debt repayments in the fourth quarter of 2023 and, to a lesser extent, higher interest income due to a higher average cash balance and higher interest rates during the current year period. The increase in 2023 was driven by higher interest rates on our floating rate debt, partially offset by net repayments in the current year periods and higher interest income in 2023. \nWe expect that our net interest expense will decrease in future periods as a result of debt repayments during the fourth quarter of 2024 and debt repayments during the first quarter of 2025 using the proceeds we received from the recent sale of our Kidney Care business. Refer to Note 6 in Item 8 of this Annual Report on Form 10-K for a summary of the components of interest expense, net for 2024, 2023 and 2022.\nOther (Income) Expense, Net\nOther (income) expense, net was income of $38 million, expense of $26 million and expense of $9 million in 2024, 2023 and 2022, respectively. The net income in 2024 was primarily driven by pension and other postretirement benefits, partially offset by foreign exchange losses. The net expense in 2023 was primarily driven by foreign exchange losses, non-marketable investment impairments, partially offset by pension and postretirement benefits. The net expense in 2022 was primarily due to the reclassification of a cumulative translation loss from accumulated other comprehensive income (loss) to earnings due to the substantial liquidation of our operations in Argentina, partially offset by pension and OPEB benefits, a pension curtailment gain and net increases in the fair value of marketable equity securities.\nIncome Taxes \nOur effective income tax rate was (12.8)%, 25.2% and 4.2% in 2024, 2023 and 2022, respectively. The special items identified above impacted our effective tax rate by (30.3) percentage points, 4.7 percentage points and (13.6) percentage points in 2024, 2023 and 2022, respectively. Refer to the Special Items caption earlier in this section for additional detail. Our effective income tax rate can differ from the 21% U.S. federal statutory rate due to a number of factors, including tax incentives, foreign rate differences, state income taxes, non-deductible expenses, non-taxable income, increases or decreases in valuation allowances and liabilities for uncertain tax positions, excess tax benefits or shortfalls on stock compensation awards, audit developments and legislative changes.\nFor the year ended December 31, 2024, the difference between our effective income tax rate and the U.S. federal statutory rate was adversely impacted by a non-deductible impairment of goodwill, legislative changes under IRC Section 987 (which is the exchange gain or loss on foreign branch remittances in the U.S., effective in 2024), and a net revaluation of the Swiss basis step-up deferred tax asset and related valuation allowance that arose from Swiss \n47\ntax reform legislation in 2019, partially offset by a favorable geographic earnings mix, a decrease in valuation allowance mainly related to U.S. foreign tax credit carryforward, and a tax benefit related to research and development tax credits.\nFor the year ended December 31, 2023, the difference between our effective income tax rate and the U.S. federal statutory rate was impacted favorably by geographical earnings mix, a $50 million net tax benefit after related valuation allowances from notional interest deductions received by certain wholly-owned foreign subsidiaries that have financed their operations with equity capital and a $17 million tax benefit related to research and development tax credits, partially offset by tax shortfalls on stock compensation awards.\nFor the year ended December 31, 2022, the difference between our effective income tax rate and the U.S. federal statutory rate was primarily attributable to non-deductible impairments of goodwill acquired in the Hillrom acquisition and valuation allowance increases, including the increase described above related to deferred tax assets from a tax basis step-up related to previously enacted Swiss tax legislation in 2019. Those items were partially offset by a $47 million net tax benefit after related valuation allowances from notional interest deductions. \nOur tax provisions for 2024, 2023 and 2022 did not include any significant tax charges related to either the Base Erosion and Anti-Abuse Tax (BEAT) or Global Intangible Low Taxed Income (GILTI) provisions, except for the inability to fully utilize foreign tax credits against such GILTI. Our accounting policy is to recognize any GILTI charge as a period cost.\nThe Organization of Economic Co-operation and Development (OECD) and the G20 Inclusive Framework on Base Erosion and Profit Shifting (the Inclusive Framework) has put forth two proposals—Pillar One and Pillar Two—that (i) revise the existing profit allocation and nexus rules and (ii) ensure a minimal level of taxation, respectively. On December 12, 2022, the EU member states agreed to implement the Inclusive Framework’s global corporate minimum tax rate of 15%, and various countries both within and outside the EU have enacted new laws implementing Pillar Two or have draft legislation proposed for adoption. The OECD continues to release additional guidance on the two-pillar framework, with widespread implementation occurring in 2024. The impact of the Pillar Two legislation on our income tax expense for the year ended December 31, 2024 was $11 million. We are continuing to evaluate the potential impacts of the Inclusive Framework for 2025 and future years, pending legislative adoption by individual countries, which could result in further adverse impacts on our income tax expense and cash flows.\nDiscontinued Operations \nIn August 2024, we entered into a definitive agreement to sell our Kidney Care business and its results have been presented as discontinued operations for the years ended December 31, 2024, 2023 and 2022 in the consolidated financial statements included in Item 8 of this Annual Report on Form 10-K. On September 29, 2023, we completed the sale of our BPS business and its results have been presented as discontinued operations for the years ended December 31, 2023 and 2022 are reported as discontinued operations in the consolidated financial statements included in Item 8 of this Annual Report on Form 10-K.\nIncome (loss) from discontinued operations, net of tax, was $(312) million, $2.48 billion and $692 million in 2024, 2023 and 2022, respectively. The decrease in the current year period was primarily driven by the $2.88 billion pre-tax gain from the sale of the BPS business ($2.59 billion net of tax). Refer to Note 2 in Item 8 of this Annual Report on Form 10-K for additional information.\nNet Income (Loss) and Earnings (Loss) per Diluted Share\nNet income (loss) for the total company, including discontinued operations, was $(638) million in 2024, $2.66 billion in 2023 and $(2.42) billion in 2022. Diluted earnings (loss) per share for the total company, including discontinued operations, was $(1.27) per share in 2024, $5.23 per share in 2023 and $(4.83) per share in 2022. The significant factors and events causing the net changes from 2023 to 2024 and from 2022 to 2023 are discussed above. Additionally, earnings (loss) per share was positively impacted by the repurchase of 0.5 million shares in 2022 through Rule 10b5-1 purchase plans. Refer to Note 9 in Item 8 of this Annual Report on Form 10-K for further information regarding our stock repurchases.\n48\nSEGMENT OPERATING INCOME (LOSS)\nThe following is a summary of operating income (loss) for our reportable segments.\nfor the years ended December 31 (in millions)\n2024\n2023\n2022\nMedical Products & Therapies\n$\n950 \n$\n972 \n$\n962 \n% of Segment Net Sales\n18.2 \n%\n19.4 \n%\n20.0 \n%\nHealthcare Systems & Technologies\n468 \n483 \n494 \n% of Segment Net Sales\n15.9 \n%\n16.0 \n%\n16.8 \n%\nPharmaceuticals\n313 \n401 \n391 \n% of Segment Net Sales\n13.0 \n%\n17.8 \n%\n18.4 \n%\nTotal reportable segment operating income\n1,731 \n1,856 \n1,847 \nOther\n18 \n18 \n77 \nUnallocated corporate costs\n(275)\n(355)\n(367)\nIntangible asset amortization expense\n(625)\n(590)\n(679)\nBusiness optimization items\n(162)\n(174)\n(193)\nEuropean Medical Devices Regulation\n(33)\n(41)\n(42)\nLong-lived asset impairments\n(50)\n— \n(344)\nLegal matters\n(17)\n(7)\n— \nAcquisition and integration items\n(23)\n— \n(213)\nProduct-related items\n(15)\n— \n(44)\nHurricane Helene Costs\n(110)\n— \n— \nLoss on product divestiture arrangement\n— \n— \n(54)\nGoodwill impairments\n(425)\n— \n(2,812)\nLoss on subsidiary liquidation\n— \n— \n(21)\nTotal operating income (loss)\n14 \n707 \n(2,845)\nInterest expense, net\n341 \n439 \n394 \nOther (income) expense, net\n(38)\n26 \n9 \nIncome (loss) from continuing operations before income taxes\n$\n(289)\n$\n242 \n$\n(3,248)\nMedical Products & Therapies\nSegment operating income was $950 million, $972 million and $962 million for the years ended 2024, 2023 and 2022, respectively. Segment operating income decreased in 2024 compared to the prior year due to increased allocations of manufacturing and supply chain overheads, annual compensation increases and higher corporate shared costs, partially offset by higher sales. In addition, we estimate that the North Cove flood resulting from Hurricane Helene had an adverse impact of $60 million on segment operating income in 2024. Segment operating income increased in 2023 compared to the prior year due to the gross profit from higher sales, partially offset by increases in SG&A and R&D expenses.\nHealthcare Systems & Technologies\nSegment operating income was $468 million, $483 million and $494 million for the years ended 2024, 2023 and 2022, respectively. Segment operating income decreased in 2024 primarily due to decreased gross profit from lower sales. Segment operating income decreased in 2023 primarily due to increased R&D expenses, particularly related to the connected care portfolio.\nPharmaceuticals\nSegment operating income was $313 million, $401 million and $391 million for the years ended 2024, 2023 and 2022, respectively. The decreases in segment operating income in 2024 were driven by lower gross margin percentages, primarily driven by the increased cost of certain inventory manufactured by our former BPS business, which includes a third-party mark-up following our divestiture of that business in September 2023, an unfavorable product mix, and increased operating expenses, including marketing-related costs in connection with recent product \n49\nlaunches. Segment operating income increased in 2023 primarily due to income from recent product launches, partially offset by a lower gross margin, primarily driven by raw materials inflation, and increased R&D expense.\nOther\nOther operating income, which represents operating income not attributable to our reportable segments, was $18 million for both the years ended December 31, 2024 and 2023 and $77 million for the year ended December 31, 2022. In the current and prior year periods, other operating income primarily represents income from revenues earned by certain of our manufacturing facilities from contract manufacturing activities. Other operating income in 2022 also included royalty income under a business development arrangement. Other operating income in 2024 was flat as compared to the prior year period. The decrease in 2023 as compared to the prior year period  reflects the termination of the royalty arrangement following our acquisition of the rights to the underlying product, partially offset by improved gross margins from contract manufacturing. \nUnallocated Corporate Costs\nUnder our new operating model, most global functional support costs, overhead costs and other shared costs that benefit our segments are allocated to those segments. Corporate costs that are not allocated to our segments, as well as any differences between actual corporate costs and the amounts allocated to our segments, are presented as unallocated corporate costs. With the results of our Kidney Care segment reported in discontinued operations, corporate costs that had previously been allocated to the Kidney Care segment which will not convey with the Kidney Care segment in the sale, are now presented as unallocated corporate costs. Additionally, intangible asset amortization and other special items are not allocated to our segments. Prior to the implementation of our operating model in the third quarter of 2023, more costs were maintained at corporate and were not allocated to our previous segments. Certain of the costs that were previously maintained at corporate under our prior segment structure that are now allocated to our segments include manufacturing variances and centrally managed supply chain costs, certain R&D costs, product category support costs, stock compensation expense, and certain employee benefit plan costs.\nLIQUIDITY AND CAPITAL RESOURCES\nyears ended December 31 (in millions)\n2024\n2023\n2022\nCash flows from operations - continuing operations\n$\n819 \n$\n1,207 \n$\n528 \nCash flows from investing activities - continuing operations\n(410)\n(410)\n(624)\nCash flows from financing activities\n(1,081)\n(3,489)\n(1,438)\nCash Flows from Operations — Continuing Operations\nIn 2024, 2023 and 2022, cash provided by operating activities from continuing operations was $819 million, $1.21 billion and $528 million, respectively.  \nOperating cash flows from continuing operations in the current year were unfavorably impacted as compared to 2023 due to an increase in our net loss from continuing operations and higher annual payouts under our employee incentive plans, which were determined based on our 2023 performance. \nOperating cash flows from continuing operations increased in 2023 compared to 2022 primarily due to a decrease in our net loss from continuing operations, lower annual payouts under our employee incentive compensation plans, which were based on our 2022 results, the timing of accounts payable payments and lower increases in inventory as compared to the prior year.\nCash Flows from Investing Activities\nIn 2024, cash used for investing activities from continuing operations included capital expenditures of $446 million. In 2023, cash used for investing activities from continuing operations included capital expenditures of $432 million. In 2022, cash used for investing activities from continuing operations included capital expenditures of $377 million \n50\nand payments for acquisitions and investments of $258 million, primarily related to our acquisition of the rights to Zosyn.\nCash Flows from Financing Activities\nIn 2024, cash used in financing activities included debt repayments of $2.66 billion, dividend payments of $590 million, partially offset by proceeds from borrowings on our delayed draw term loan of $1.83 billion, an increase in commercial paper borrowings of $296 million, and proceeds from stock issued under employee benefit plans of $71 million. \nIn 2023, cash used in financing activities included debt repayments of $2.63 billion and dividend payments of $586 million, and a decrease in commercial paper borrowings of $301 million, partially offset by proceeds from stock issued under employee benefit plans of $95 million.\nIn 2022, cash used in financing activities included debt repayments of $954 million and dividend payments of $573 million, partially offset by receipts from stock issued under employee benefit plans of $127 million and a net increase in commercial paper borrowings of $55 million.\nAs authorized by the Board of Directors, we repurchase our stock depending upon our cash flows, net debt levels and market conditions. In July 2012, the Board of Directors authorized a share repurchase program and the related authorization was subsequently increased a number of times. We did not repurchase any shares under this authority in 2024 and had $1.30 billion remaining available under this authorization as of December 31, 2024. \nCredit Facilities, Commercial Paper Program and Access to Capital and Credit Ratings\nCredit Facilities and Commercial Paper Program\nAs of December 31, 2024, we had a U.S. Dollar-denominated term loan credit facility, which had one tranche of term loans outstanding, a U.S. Dollar-denominated revolving credit facility and a Euro-denominated revolving credit facility. \nAs of December 31, 2024, we had $1.64 billion outstanding under our U.S. Dollar-denominated term loan credit facility that matures in 2026. Borrowings under the term loan credit facility bear interest on the principal amount outstanding at either Term SOFR plus an applicable margin plus a credit spread adjustment or a “base rate” plus an applicable margin. The term loan credit facility contains various covenants, including a maximum net leverage ratio. We have the option to prepay outstanding amounts under the term loan credit facility in whole or in part at any time. In February 2025, we repaid $1.00 billion under our $1.64 billion five-year term loan facility maturing in 2026.\nAs of December 31, 2024, our U.S. Dollar-denominated revolving credit facility and Euro-denominated revolving credit facility had a maximum capacity of $2.00 billion and €200 million, respectively, and there were no borrowings under either of these revolving credit facilities as of December, 31, 2024 or December 31, 2023. Our commercial paper borrowing arrangements require us to maintain undrawn borrowing capacity under our revolving credit facilities for an amount at least equal to our outstanding commercial paper borrowings. Each of the revolving credit facilities matures in 2026. The revolving credit facilities enable us to borrow funds on an unsecured basis at variable interest rates, and contain various covenants, including a maximum net leverage ratio. Based on our covenant calculations as of December 31, 2024 we have capacity to draw on the full amounts under our revolving credit facilities, less commercial paper borrowings which were $300 million at year-end. Facility fees under the credit facilities were 0.125% annually as of both December 31, 2024 and 2023 and are based on our credit ratings and the total capacity of the revolving credit facility.  \nOn July 17, 2024, we entered into a credit agreement pursuant to which a group of banks provided us with senior unsecured term loans in an aggregate principal amount of up to $2.05 billion (\"the bridge facility\"). Borrowings under the bridge facility were available in up to three drawings to fund (a) the refinancing of our 1.322% Senior Notes due November 29, 2024, our Floating Rate Notes due November 29, 2024, and certain borrowings under our existing term loan facility and (b) payment of certain U.S. tax liabilities arising from internal reorganization transactions related to the sale of our Kidney Care business. Borrowings under the bridge facility bore interest at a rate based on our long-term debt ratings in effect from time to time and the interest rate on any borrowings outstanding beyond December 31, 2024 would increase by 0.25%.\n \nWe also incurred a ticking fee on undrawn commitments at a rate based on our long-term debt ratings in effect from time to time. The banks' funding commitments under the bridge facility terminated on December 31, 2024. Outstanding borrowings under the bridge facility were scheduled to mature on the earlier of 364 days from the first funding date and November 24, 2025. Additionally, we were required \n51\nto use the net cash proceeds from certain transactions (including from the sale of our Kidney Care business) to repay any outstanding borrowings under the bridge facility. The bridge facility contained financial and other covenants, including a net leverage covenant, and provided for customary events of default. In November 2024, we reduced the bridge facility capacity from $2.05 billion to $1.83 billion. Additionally, during the fourth quarter of 2024 we drew on the bridge facility to repay our 1.322% Senior Notes due November 29, 2024, our Floating Rate Notes due November 29, 2024 and the outstanding balance on our three-year term loan facility. There was $1.83 billion outstanding \nunder this bridge facility as of \nDecember 31, 2024. In January 2025, we used a portion of the approximately $3.4 billion of net after-tax cash proceeds from the sale of our Kidney Care business to repay the $1.83 billion outstanding under the bridge facility, at which time it was terminated.\nIn the first quarter of 2024, we amended the credit agreements governing our U.S. dollar-denominated term loan credit facility and revolving credit facility and the guaranty agreement with respect to our Euro-denominated revolving credit facility to increase the maximum net leverage ratio covenant for the six fiscal quarters ending June 30, 2024, September 30, 2024, December 31, 2024, March 31, 2025, June 30, 2025, and September 30, 2025. In accordance with the terms of the amendment, the capacity under our U.S dollar-denominated revolving credit facility was reduced from $2.50 billion to $2.00 billion on September 30, 2024. As of December 31, 2024, we were in compliance with the financial covenants in these agreements. \nBased on our covenant calculations as of December 31, 2024, we have capacity to draw on the full amounts under our revolving credit facilities, less commercial paper borrowings which were $300 million at year-end. The non-performance of any financial institution supporting either of the revolving credit facilities would reduce the maximum capacity of the revolving credit facilities by the institution’s respective commitment. Additionally, a deterioration in our financial performance may reduce our ability to draw on our revolving credit facilities.\nWe have a commercial paper program that currently enables us to borrow efficiently at short-term interest rates. Upon maturity of any commercial paper borrowings under this program, and to the extent old issuances are not repaid by cash on hand, we are exposed to the rollover risk of not being able to issue new commercial paper. Our commercial paper borrowing arrangements require us to maintain undrawn borrowing capacity under our revolving credit facilities for an amount at least equal to our outstanding commercial paper borrowings. If we were not able to issue new commercial paper, we have the option of drawing on the revolving credit facilities; however, electing to do so would result in higher interest expense. As of December 31, 2024, we had $300 million of commercial paper outstanding, which were repaid in full in January 2025.\nWe also maintain other credit arrangements, as described in Note 6 in Item 8 of this Annual Report on Form 10-K.\nAccess to Capital and Credit Ratings\nWe intend to fund short-term and long-term obligations as they mature through cash on hand, including the proceeds from the recently completed sale of our Kidney Care business, future cash flows from operations, or by issuing additional debt, which could include commercial paper. We had $1.76 billion of cash and cash equivalents as of December 31, 2024, with adequate cash available to meet operating requirements in each jurisdiction in which we operate. We invest our excess cash in money market and other funds and diversify the concentration of cash among different financial institutions. As of December 31, 2024, we had $13.13 billion of long-term debt and finance lease obligations, including current maturities, and short-term debt. As of February 21, 2025, we repaid $3.13 billion of short- and long-term indebtedness primarily with the net after-tax cash proceeds from the sale of our Kidney Care business, and we expect to use substantially all of the remaining net after-tax proceeds to continue to repay indebtedness through the second quarter of 2025. Subject to market conditions, we regularly evaluate opportunities with respect to our capital structure (including with respect to the potential refinancing of our outstanding indebtedness).\nOur ability to generate cash flows from operations, issue debt, including commercial paper, or enter into other financing arrangements on acceptable terms could be adversely affected if there is a material decline in the demand for our products or in the solvency of our customers or suppliers, deterioration in our key financial ratios or credit ratings or other significantly unfavorable changes in conditions. However, we believe we have sufficient financial flexibility to issue debt, enter into other financing arrangements and attract long-term capital on acceptable terms to support our growth objectives and further reduce our debt levels as we take actions consistent with our capital allocation priorities.\n52\nOur credit ratings at December 31, 2024 were as follows:  \nStandard & Poor’s\nMoody’s\nRatings\nSenior debt\nBBB\nBaa2\nShort-term debt\nA2\nP2\nOutlook\nNegative\nStable\nIn May 2024, our contract with Fitch expired. In June 2024, Fitch affirmed and withdrew ratings and coverage on us. As a result they no longer maintain ratings on our senior debt or our short-term debt. \nContractual Obligations \nAs of December 31, 2024, we had contractual obligations, excluding accounts payable and accrued expenses and other current liabilities, payable or maturing in the following periods.\n(in millions)\nTotal\nLess than\none year\nMore than one year\nLong-term debt and finance lease obligations, including current maturities\n$\n13,180 \n$\n2,757 \n$\n10,423 \nInterest on short- and long-term debt and finance lease obligations \n1\n2,348 \n347 \n2,001 \nOperating leases\n361 \n93 \n268 \nOther non-current liabilities\n2\n323 \n— \n323 \nPurchase obligations\n3\n580 \n159 \n421 \nContractual obligations\n2\n$\n16,792 \n$\n3,356 \n$\n13,436 \n1.\nInterest payments on debt and finance lease obligations are calculated for future periods using interest rates in effect at the end of 2024. Certain of these projected interest payments may differ in the future based on foreign currency fluctuations or other factors or events. The projected interest payments only pertain to obligations and agreements outstanding at December 31, 2024. Refer to Note 6 and Note 7, respectively, in Item 8 of this Annual Report on Form 10-K for further discussion regarding our debt instruments outstanding and finance lease obligations at December 31, 2024.\n2.\nThe primary components of other non-current liabilities in our consolidated balance sheet as of December 31, 2024 are pension and other postretirement benefits, deferred tax liabilities, long-term tax liabilities, and litigation and environmental reserves. We projected the timing of the related future cash payments based on contractual maturity dates (where applicable) and estimates of the timing of payments (for liabilities with no contractual maturity dates). The actual timing of payments could differ from our estimates. \nWe contributed $46 million and $27 million\n \nto our defined benefit pension plans in 2024 and 2023, respectively. The timing of funding in future periods is uncertain and is dependent on future movements in interest rates, investment returns, changes in laws and regulations, and other variables. Therefore, the table above excludes cash outflows related to our pension plans. The amount included within other non-current liabilities (and excluded from the table above) related to our pension plan liabilities was $553 million as of December 31, 2024. We have no obligation to fund our principal plans in the United States in 2025. We continually reassess the amount and timing of any discretionary contributions. In 2025, we expect to make contributions of at least $26 million to our Puerto Rico plan and $7 million to our foreign pension plans. We expect to have net cash outflows relating to our OPEB plans of $16 million in 2025. Additionally, we have excluded long-term tax liabilities, which include liabilities for unrecognized tax positions, and deferred tax liabilities from the table above because we are unable to estimate the timing of the related cash outflows. The amounts of long-term tax liabilities and deferred tax liabilities included within other non-current liabilities (and excluded from the table above) were $94 million and $103 million, respectively, as of December 31, 2024.  \n3.\nIncludes our significant contractual unconditional purchase obligations. For cancellable agreements, any penalty due upon cancellation is included. These commitments do not exceed our projected requirements and are in the normal course of business. Examples include firm commitments for raw material and component part purchases, utility agreements and service contracts.\n53\nOff-Balance Sheet Arrangements\nWe periodically enter into off-balance sheet arrangements. Certain contingencies arise in the normal course of business and are not recorded in the consolidated balance sheets in accordance with U.S. GAAP (such as contingent joint development and commercialization arrangement payments). Also, upon resolution of uncertainties, we may incur charges in excess of presently established liabilities for certain matters (such as contractual indemnifications). For a discussion of our significant off-balance sheet arrangements, refer to Note 3 and Note 8 in Item 8 of this Annual Report on Form 10-K for information regarding joint development and commercialization arrangements, indemnifications and legal contingencies.\nFINANCIAL INSTRUMENT MARKET RISK\nWe operate on a global basis and are exposed to the risk that our earnings, cash flows and equity could be adversely impacted by fluctuations in foreign exchange and interest rates. Our hedging policy attempts to manage these risks to an acceptable level based on our judgment of the appropriate trade-off between risk, opportunity and costs. Refer to Note 16 in Item 8 of this Annual Report on Form 10-K for further information regarding our financial instruments and hedging strategies.\nCurrency Risk\nWe are primarily exposed to foreign exchange risk with respect to revenues generated outside of the United States denominated in the Euro, British Pound, Australian Dollar, Canadian Dollar, Chinese Renminbi, Japanese Yen, Mexican Peso, Indian Rupee and Swedish Krona. We manage our foreign currency exposures on a consolidated basis, which allows us to net exposures and take advantage of any natural offsets. In addition, we use derivative and nonderivative financial instruments to further reduce the net exposure to foreign exchange. Gains and losses on the hedging instruments offset losses and gains on the hedged transactions and reduce the earnings and stockholders’ equity volatility relating to foreign exchange. However, we don't hedge our entire foreign exchange exposure and are still subject to earnings and stockholders' equity volatility relating to foreign exchange risk.  Financial market and currency volatility may limit our ability to cost-effectively hedge these exposures.\nWe primarily use forward contracts to hedge the foreign exchange risk to earnings relating to forecasted transactions and recognized assets and liabilities denominated in foreign currencies. The maximum term over which we have cash flow hedge contracts in place related to foreign exchange risk on forecasted transactions as of December 31, 2024 is 11 months. We also enter into derivative instruments to hedge foreign exchange risk on certain intra-company and third-party receivables and payables and debt denominated in foreign currencies.\nAs part of our risk-management program, we perform sensitivity analyses to assess potential changes in the fair value of our foreign exchange instruments relating to hypothetical and reasonably possible near-term movements in foreign exchange rates.\nA sensitivity analysis of changes in the fair value of foreign exchange contracts outstanding as of December 31, 2024, while not predictive in nature, indicated that if the U.S. Dollar uniformly weakened by 10% against all currencies, the net pre-tax asset balance of $5 million with respect to those contracts would change by $5 million. A similar analysis performed with respect to contracts outstanding as of December 31, 2023 indicated that, on a pre-tax basis, the net asset balance of $40 million would change by \n$151 million.\nThe sensitivity analysis model recalculates the fair value of the foreign exchange contracts outstanding as of December 31, 2024 by replacing the actual exchange rates as of December 31, 2024 with exchange rates that are 10% weaker compared to the actual exchange rates for each applicable currency. All other factors are held constant. These sensitivity analyses disregard the possibility that currency exchange rates can move in opposite directions and that gains from one currency may or may not be offset by losses from another currency. The analyses also disregard the offsetting change in value of the underlying hedged transactions and balances.\nIn February 2022, the three-year cumulative inflation rate in Turkey exceeded 100 percent. As a result, on April 1, 2022, we began reporting the results of our subsidiary in that jurisdiction using highly inflationary accounting, which requires that the functional currency of the entity be changed to the reporting currency of its parent. As of December 31, 2024, our subsidiary in Turkey had net monetary assets of $27 million.\n54\nInterest Rate Risk\nWe are also exposed to the risk that our earnings and cash flows could be adversely impacted by fluctuations in interest rates. Our policy is to manage interest costs using the mix of fixed- and floating-rate debt that we believe is appropriate at that time. To manage this mix in a cost-efficient manner, we periodically enter into interest rate swaps in which we agree to exchange, at specified intervals, the difference between fixed and floating interest amounts calculated by reference to an agreed-upon notional amount. We also periodically use forward-starting interest rate swaps and treasury rate locks to hedge the risk to earnings associated with fluctuations in interest rates relating to anticipated issuances of term debt. As of December 31, 2024, there were no interest rate derivative contracts outstanding and we had $3.48 billion of outstanding floating rate debt. A 100 basis point change in interest rates would impact our pre-tax earnings and cash flows by $35 million over a one-year period.\nCHANGES IN ACCOUNTING STANDARDS\nRefer to Note 1 in Item 8 of this Annual Report on Form 10-K for information on recently adopted accounting pronouncements.\nRECENT ACCOUNTING PRONOUNCEMENTS\nRecently issued accounting standards not yet adopted\nIn November 2024, the Financial Accounting Standards Board (FASB) issued Accounting Standards Update (ASU) 2024-03, Income Statement - Reporting Comprehensive Income - Expense Disaggregation Disclosures (Subtopic 220-40): Disaggregation of Income Statement Expenses, which requires disaggregated disclosure of certain expenses on an interim and annual basis in the notes to the financial statements. This standard is effective for annual consolidated financial statements for the year ending December 31, 2027 and for interim periods beginning in 2028. We are currently evaluating the impact of this new standard on our consolidated financial statements.\nIn December 2023, the FASB issued ASU 2023-09, Income Taxes (Topic 740): Improvement to Income Tax Disclosures, which requires (1) disclosure of specific categories in the rate reconciliation and (2) additional information for reconciling items that meet a quantitative threshold. Additionally, the amendment requires disclosure of certain disaggregated information about income taxes paid, income from continuing operations before income tax expense (benefit) and income tax expense (benefit). The standard is effective for our annual consolidated financial statements for the year ending December 31, 2025. We are currently evaluating the impact of this standard on our consolidated financial statements.\nCRITICAL ACCOUNTING POLICIES\nThe preparation of financial statements in accordance with U.S. GAAP requires management to make estimates and judgments that affect the reported amounts of assets, liabilities, revenues and expenses. A summary of our significant accounting policies is included in Note 1 in Item 8 of this Annual Report on Form 10-K. Certain of our accounting policies are considered critical, as these policies are the most important to the depiction of our financial statements and require significant, difficult or complex judgments by us, often employing the use of estimates about the effects of matters that are inherently uncertain. Actual results that differ from our estimates could have an unfavorable effect on our results of operations and financial position. The following is a summary of accounting policies that we consider critical to the consolidated financial statements.\nRevenue Recognition and Related Provisions and Allowances\nRevenues from product sales are recorded at the net sales price (transaction price), which includes estimates of variable consideration primarily related to rebates and distributor chargebacks. These reserves are based on estimates of the amounts earned or to be claimed on the related sales. Our estimates take into consideration historical experience, current contractual and statutory requirements, specific known market events and trends, industry data, and forecasted customer buying and payment patterns. Overall, these reserves reflect our best estimates of the amount of consideration to which we are entitled based on the terms of the contract. The amount of variable consideration included in the net sales price is limited to the amount that is probable not to result in a significant reversal in the amount of the cumulative revenue recognized in a future period.  Additionally, our contracts with customers often include promises to transfer multiple products and services to a customer. \n55\nDetermining whether products and services are considered distinct performance obligations that should be accounted for separately and determining the allocation of the transaction price may require significant judgment.\nPension and OPEB Plans\nWe provide pension and other postretirement benefits to certain of our employees. The service component of employee benefit expenses is reported in the same line items in the consolidated income statements as the applicable employee’s compensation expense. All other components of these employee benefit expenses are reported in other (income) expense, net in our consolidated statements of income (loss). The valuation of the funded status and net periodic benefit cost for the plans is calculated using actuarial assumptions. These assumptions are reviewed annually and revised if appropriate. The significant assumptions include the following:\n•\ninterest rates used to discount pension and OPEB plan liabilities;\n•\nthe long-term rate of return on pension plan assets;\n•\nrates of increase in employee compensation (used in estimating liabilities);\n•\nanticipated future healthcare trend rates (used in estimating the OPEB plan liability); and\n•\nother assumptions involving demographic factors such as retirement, mortality and turnover (used in estimating liabilities).\nSelecting assumptions involves an analysis of both short-term and long-term historical trends and known economic and market conditions at the time of the valuation (also called the measurement date). The use of different assumptions would result in different measures of the funded status and net cost. Actual results in the future could differ from expected results.\nOur key assumptions are listed in Note 13 in Item 8 of this Annual Report on Form 10-K. The most critical assumptions relate to the plans covering U.S. and Puerto Rico employees, because these plans are the most significant to our consolidated financial statements.\nDiscount Rate Assumption\nEffective for the December 31, 2024 measurement date, we utilized discount rates of 5.72% and 5.55%, respectively, to measure the benefit obligations for our most significant pension and OPEB plans, which cover U.S. and Puerto Rico employees. We used a broad population of approximately 200 Aa-rated corporate bonds as of December 31, 2024 to determine the discount rate assumption. All bonds were denominated in U.S. Dollars, with a minimum amount outstanding of $50 million. This population of bonds was narrowed from a broader universe of approximately 700 Moody’s Aa rated, non-callable (or callable with make-whole provisions) bonds by eliminating the top 10th percentile and bottom 40th percentile to adjust for any pricing anomalies and to represent the bonds we would most likely select if we were to actually annuitize our pension and OPEB plan liabilities. This portfolio of bonds was used to generate a yield curve and associated spot rate curve to discount the projected benefit payments for the U.S. and Puerto Rico plans. The discount rate is the single level rate that produces the same result as the spot rate curve.\nFor plans in Canada, Japan, the United Kingdom and other European countries, we use a method essentially the same as that described for the U.S. and Puerto Rico plans. For our other international plans, the discount rate is generally determined by reviewing country- and region-specific government and corporate bond interest rates.\nTo understand the impact of changes in discount rates on pension and OPEB plan cost, we perform a sensitivity analysis. Holding all other assumptions constant, for each 50 basis point increase in the discount rate, global pre-tax pension and OPEB plan cost would decrease by $3 million, and for each 50 basis point decrease in the discount rate, global pre-tax pension and OPEB plan cost would increase by $1 million.\nReturn on Plan Assets Assumption\nIn measuring the net periodic cost for 2024, we used a long-term expected rate of return of 6.75% for our most significant pension plans, which cover U.S. and Puerto Rico employees. This assumption will remain the same in 2025. This assumption is not applicable to our OPEB plan because it is not funded.\n56\nWe establish the long-term asset return assumption based on a review of historical compound average asset returns, both company-specific and relating to the broad market (based on our asset allocation), as well as an analysis of current market and economic information and future expectations. The current asset return assumption is supported by historical market experience for both our actual and targeted asset allocation. In calculating net pension cost, the expected return on assets is applied to a calculated value of plan assets, which recognizes changes in the fair value of plan assets in a systematic manner over five years. The difference between this expected return and the actual return on plan assets is a component of the total net unrecognized gain or loss and is subject to amortization in the future.\nTo understand the impact of changes in the expected asset return assumption on net cost, we perform a sensitivity analysis. Holding all other assumptions constant, for each 50 basis point increase (decrease) in the asset return assumption, global pre-tax pension plan cost would decrease (increase) by approximately $14 million.\nOther Assumptions\nFor the U.S. and Puerto Rico plans, we used the Pri-2012 combined mortality table with improvements projected using the MP-2021 projection scale adjusted to a long-term improvement of 0.8% as of December 31, 2024. For all other pension plans, we utilized country- and region-specific mortality tables to calculate the plans’ benefit obligations. We periodically analyze and update our assumptions concerning demographic factors such as retirement, mortality and turnover, considering historical experience as well as anticipated future trends.\nThe assumptions relating to employee compensation increases and future healthcare costs are based on historical experience, market trends, and anticipated future company actions. \nDeferred Tax Asset Valuation Allowances and Reserves for Uncertain Tax Positions \nWe maintain valuation allowances unless it is more likely than not that all or a portion of the deferred tax asset will be realized. Changes in valuation allowances are included in our tax provision in the period of change. In determining whether a valuation allowance is warranted, we evaluate factors such as prior earnings history, expected future earnings, carryback and carryforward periods, and tax strategies that could potentially enhance the likelihood of realization of a deferred tax asset. The realizability assessments made at a given balance sheet date are subject to change in the future, particularly if earnings of a subsidiary are significantly higher or lower than expected, or if we take operational or tax planning actions that could impact the future taxable earnings of a subsidiary.\nIn the normal course of business, we are audited by federal, state and foreign tax authorities, and are periodically challenged regarding the amount of taxes due. These challenges relate to the timing and amount of deductions and the allocation of income among various tax jurisdictions. We believe our tax positions comply with applicable tax law and we intend to defend our positions. In evaluating the exposure associated with various tax filing positions, we record reserves for uncertain tax positions in accordance with U.S. GAAP based on the technical support for the positions, our past audit experience with similar situations, and potential interest and penalties related to the matters. Our results of operations and effective tax rate in a given period could be impacted if, upon final resolution with taxing authorities, we prevail in positions for which reserves have been established, or we are required to pay amounts in excess of established reserves.\nRealization of our U.S. and foreign operating loss and tax credit carryforwards depends on generating sufficient future earnings. A valuation allowance of $536 million and $584 million was recognized as of December 31, 2024 and 2023, respectively, to reduce the deferred tax assets associated with net operating loss and tax credit carryforwards because we do not believe it is more likely than not that these assets will be fully realized prior to expiration. After evaluating relevant U.S. tax laws, any elections or other opportunities that may be available, and the future expiration of certain U.S. tax provisions that will impact the utilization of our U.S. foreign tax credit carryforwards, management expects to be able to realize some, but not all, of the U.S. foreign tax credit deferred tax assets up to its recurring and non-recurring foreign inclusions. Therefore, a valuation allowance of $131 million and $130 million was recognized with respect to the foreign tax credit carryforwards as of December 31, 2024 and 2023, respectively. We will continue to evaluate the need for additional valuation allowances and, as circumstances change, the valuation allowance may change.\n57\nImpairment of Goodwill and Other Long-Lived Assets\nGoodwill\nGoodwill is initially measured as the excess of the purchase price over the fair value (or other measurement attribute required by U.S. GAAP) of acquired assets and liabilities in a business combination. Management performs an impairment test in the fourth quarter of each year, or whenever events or changes in circumstances indicate that the fair value of the reporting unit is more likely than not below its carrying amount. We have the option to assess goodwill for impairment by initially performing a qualitative assessment to determine whether it is more-likely-than-not that the fair value of a reporting unit is less than its carrying amount. If we determine that it is not more-likely-than-not that the fair value of a reporting unit is less than its carrying amount, then the quantitative goodwill impairment test is not required to be performed. If we determine that it is more-likely-than-not that the fair value of a reporting unit is less than its carrying amount, or if we do not elect the option to perform an initial qualitative assessment, we perform a quantitative goodwill impairment test. In the quantitative impairment test, we calculate the estimated fair value of the reporting unit. If the carrying amount of the reporting unit exceeds the estimated fair value, an impairment charge is recorded for the amount that the reporting unit’s carrying amount, including goodwill, exceeds its fair value, limited to the total amount of goodwill allocated to that reporting unit. \nIn a quantitative goodwill impairment test, the fair values of our reporting units are generally determined based on a discounted cash flow model (an income approach) and earnings multiples (a market approach) based on the guideline public company method. Significant assumptions used in reporting unit fair value measurements generally include revenue growth rates, forecasted EBITDA margins, discount rates, terminal growth rates and earnings multiples. The discounted cash flow models used to determine the fair values of our reporting units during 2024 reflected our most recent cash flow projections, discount rates ranging from 9.0% to 9.5% and terminal growth rates ranging from 3.0% to 3.25%. Each of these inputs can significantly affect the fair values of our reporting units. \nOur operating and reportable segments were changed in the third quarter of 2023 to align with our new operating model: Medical Products & Therapies, Healthcare Systems & Technologies (formerly referred to as our Hillrom segment) and Pharmaceuticals. As a result of this segment change, we reallocated the goodwill from our previous Americas, EMEA and APAC segments to the reporting units within our new Medical Products & Therapies and Pharmaceuticals segments based on the relative fair values of those reporting units. We performed impairment tests both before and after the reporting unit change and determined that no goodwill impairment had occurred. \nIn connection with our annual goodwill impairment assessment in the fourth quarter of 2024, we recorded a $425 million goodwill impairment related to our Front Line Care reporting unit within our Healthcare Systems & Technologies segment. The reduction in value was primarily due to lower forecasted operating results and a lower terminal growth rate utilized in valuing this reporting unit which contributed to reduced expected future cash flows, as well as lower earnings multiples. The fair value of the Front Line Care reporting unit was determined based on a discounted cash flow model (an income approach) and earnings multiples (a market approach) based on the guideline public company method. Significant assumptions used in the determination of the fair values of our reporting units generally include revenue growth rates, forecasted EBITDA margins, discount rates, terminal growth rates and earnings multiples. The discounted cash flow model used to determine the fair value of our Front Line Care reporting unit reflected our most recent cash flow projections, a discount rate of 9.5% and a terminal growth rate of 3.25%. In order to evaluate the sensitivity of the fair value calculations used in the Front Line Care reporting unit goodwill impairment test, we applied a hypothetical 5% decrease to the fair value and compared that hypothetical value to the underlying asset carrying value. The application of a hypothetical 5% decrease in fair value would result in an additional impairment of approximately $200 million. As of December 31, 2024, the carrying amount of goodwill for our Front Line Care reporting unit was $1.99 billion. No goodwill impairments were recorded for our remaining reporting units in connection with our annual goodwill impairment tests because the fair values of those reporting units exceeded their carrying amounts.\nWe acquired Hillrom on December 13, 2021 and recognized $6.83 billion of goodwill and $6.03 billion of other intangible assets, including $1.91 billion of indefinite-lived intangible assets, in connection with that acquisition. In the second half of 2022, we recognized $2.81 of goodwill impairments related to the reporting units within our Hillrom segment (currently referred to as out Healthcare Systems & Technologies segment). As discussed below, we also recognized impairments of indefinite-lived intangible assets related to that business, consisting primarily of trade names. \n58\nOther Long-Lived Assets\nOther long-lived assets are primarily comprised of property, plant and equipment and intangible assets, including both indefinite-lived intangible assets and amortizing intangible assets. \nIndefinite-Lived Intangible Assets\nIndefinite-lived intangible assets, such as IPR&D acquired in business combinations and certain trade names with indefinite lives, are subject to an impairment review annually and whenever indicators of impairment exist. We have the option to assess indefinite-lived intangible assets for impairment by first performing qualitative assessments to determine whether it is more-likely-than-not that the fair values of the indefinite-lived intangible assets are less than the carrying amounts. If we determine that it is more-likely-than-not that an indefinite-lived intangible asset is impaired, or if we elect not to perform an initial qualitative assessment, we then perform the quantitative impairment test by comparing the fair value of the indefinite-lived intangible asset with its carrying amount. If the carrying amount exceeds the fair value of the indefinite-lived intangible asset, we write the carrying amount down to the fair value.\nIn a quantitative indefinite-lived intangible asset impairment test, fair values are generally determined based on a discounted cash flow model. Significant assumptions used in valuations of indefinite-lived intangible assets include the forecasted cash flows, discount rates, the assessment of the asset’s life cycle, the stage in completion (for acquired IPR&D intangible assets), royalty rates, terminal growth rates and contributory asset charges. The relief from royalty models used in the determination of the fair values of our trade name intangible assets during 2024 reflected our most recent revenue projections, a discount rate of 9%, a royalty rate of 5% and a terminal growth rate of 3.0%. Each of these factors and assumptions can significantly affect the value of the intangible asset. We tested our indefinite-lived intangible trade name intangible asset for impairment during the fourth quarter of 2024 and determined that no impairment had occurred.\nIn connection with our annual IPR&D impairment assessment in the fourth quarter of 2024, we recognized a pre-tax impairment charge of $50 million to reduce the carrying amount of an IPR&D asset to its fair value. The reduction in value was primarily due to lower forecasted revenues and margins which contributed to reduced expected future cash flows. The intangible asset impairment charge is classified within research and development expenses in the accompanying consolidated statements of income (loss) for the year ended December 31, 2024. The fair value of the IPR&D asset was determined using the multi-period excess earnings method. Significant assumptions used in the determination of the fair value of the IPR&D asset included forecasted cash flows and the discount rate. The multi-period excess earnings model used in our determination of the fair value of the IPR&D asset reflected our most recent cash flow projections and a discount rate of 11%. \nThe total carrying amount of our indefinite-lived intangible assets was $787 million as of December 31, 2024, comprised of a trade name intangible asset and IPR&D.  \nDuring the fourth quarter of 2023, as a result of an update to our long-term branding strategy, we reclassified two trade name intangible assets with carrying amounts of $870 million and $21 million from indefinite-lived intangible assets to amortizing intangible assets. The estimated useful lives assigned to those assets were 15 years and 5 years, respectively. We performed impairment tests of those intangible assets at the time of the reclassification and determined that no impairment had occurred.\nIntangible Assets with Definite Lives and Property, Plant and Equipment\nWe review the carrying amounts of long-lived assets used in operations, other than goodwill and intangible assets not subject to amortization, for potential impairment when events or changes in circumstances indicate that the carrying amount of an asset may not be recoverable. In evaluating recoverability, we group assets and liabilities at the lowest level such that the identifiable cash flows relating to the group are largely independent of the cash flows of other assets and liabilities. We then compare the carrying amounts of the assets or asset groups with the related estimated undiscounted future cash flows. In the event an asset (or asset group) is not recoverable, an impairment charge is recorded as the amount by which the carrying amount of the asset (or asset group) exceeds its fair value. However, the portion of an impairment loss allocated to an individual long-lived asset within an asset group cannot reduce the carrying amount of that asset below its fair value if its fair value is determinable without undue cost and effort.\n59\nDuring the third quarter of 2022, we recognized pre-tax impairment charges of $332 million to reduce the carrying amounts of certain indefinite-lived intangible assets, which primarily related to the Hillrom and Welch Allyn trade names acquired in the Hillrom acquisition, to their estimated fair values. Additionally, during 2022 we recognized pre-tax impairment charges of $12 million related to developed technology intangible assets due to declines in market expectations for the related products.\n \nLong-Lived Assets Held for Sale\nLong-lived assets are classified as held for sale when certain criteria are met, including when management has committed to sell the asset, the asset is available for sale in its present condition and the sale is probable of being completed within one year of the balance sheet date. Assets held for sale are no longer depreciated or amortized and they are reported at the lower of their carrying amount or fair value less cost to sell.\nOur goodwill and other long-lived asset fair value measurements are classified as Level 3 in the fair value hierarchy because they involve significant unobservable inputs. \nFurther adverse changes to macroeconomic conditions or our earnings forecasts could lead to additional goodwill or other long-lived asset impairment charges in future periods and such charges could be material to our results of operations.\nCERTAIN REGULATORY MATTERS \nIn July 2017, immediately prior to the closing of our acquisition of Claris Injectables Limited (Claris), FDA commenced an inspection of the Claris’ facilities in Ahmedabad, India. FDA completed the inspection and subsequently issued a Warning Letter based on observations identified in the 2017 inspection (2017 Warning Letter).¹ FDA re-inspected the facilities and issued a Form FDA 483 on May 17, 2022. On September 1, 2022, FDA notified us that the inspection had been classified as voluntary action indicated. From January 19, 2023 to January 27, 2023, FDA performed an inspection at the Ahmedabad site, concluding with the issuance of a Form FDA 483. On April 26, 2023, FDA notified us that the inspection had been classified as official action indicated. We received a Warning Letter on July 25, 2023 based on observations identified in the January 2023 inspection (2023 Warning Letter)\n2\n. Since the issuance of the 2017 Warning Letter, we have implemented corrective and preventive actions to address FDA's related observations, as well as other enhancements at the site. We have fully responded to the 2023 Warning Letter, have implemented additional corrective and preventive actions, and continue to engage with FDA regarding the agency's observations. In addition, since the issuance of the 2017 Warning Letter, we have secured other sites in our manufacturing network and have launched and distribute select products from those sites in the U.S.\nRefer to Item 1A. Risk Factors of this Annual Report on Form 10-K for additional discussion of regulatory matters and how they may impact us.\n1 \nAvailable online at https://www.fda.gov/ICECI/EnforcementActions/WarningLetters/ucm613538.htm\n2 \nAvailable online at https://www.fda.gov/inspections-compliance-enforcement-and-criminal-investigations/warning-letters/baxter-healthcare-corporation-654136-07252023\nFORWARD-LOOKING INFORMATION  \nCertain statements contained in this Annual Report may constitute “forward-looking statements,” as defined in the Private Securities Litigation Reform Act of 1995, that involve risks and uncertainties. Forward-looking statements provide current expectations of future events based on certain assumptions and include any statement that does not directly relate to any historical or current fact. These statements by their nature address matters that are uncertain to different degrees. Use of the words “may,” “will,” “would,” “could,” “should,” “believes,” “estimates,” “projects,” “potential,” “expects,” “plans,” “seeks,” “intends,” “evaluates,” “pursues,” “anticipates,” “continues,” “designs,” “impacts,” “affects,” “forecasts,” “target,” “outlook,” “initiative,” “objective,” “designed,” “priorities,” “goal,” or the negative of those words or other similar expressions may identify forward-looking statements, although not all forward-looking statements contain such words. These forward-looking statements may include statements with respect to the anticipated benefits of our recent strategic actions,\n \nour ability to successfully integrate acquisitions, the expected growth rates for our segments, accounting estimates and assumptions (including with respect to goodwill and other intangible asset impairments), global economic conditions, litigation-related matters, future \n60\nregulatory filings (or the withdrawal or resubmission of any pending submissions) and our R&D pipeline (including anticipated product approvals or clearances), sales from new product offerings, credit exposure to foreign governments, the adequacy of cash flows and credit facilities, potential developments with respect to credit ratings, investment of foreign earnings, estimates of liabilities including those related to uncertain tax positions, contingent payments, future pension plan contributions, costs, discount rates and rates of return, our exposure to financial market volatility and foreign currency, interest rate and credit risks, our net interest expense, the impact of inflation on our business, the impact of any significant new tariffs or changes in trade policies and treaties, the impact of competition, future sales growth, business development activities, cost saving initiatives, future capital and R&D expenditures, future debt issuances and refinancings, the adequacy of tax provisions and reserves, the effective income tax rate, the impacts of severe weather events (including Hurricane Helene) and all other statements that do not relate to historical facts.\nThese forward-looking statements are based on certain assumptions and analyses made in light of our experience and perception of historical trends, current conditions, and expected future developments as well as other factors that we believe are appropriate in the circumstances. While these statements represent our judgment on what the future may hold, and we believe these judgments are reasonable, these statements are not guarantees of any events or financial results. Whether actual future results and developments will conform to expectations and predictions is subject to a number of risks and uncertainties, including the following factors, many of which are beyond our control:\n•\nour ability to achieve the intended benefits of our recent strategic actions, including the sale of our Kidney Care business, and cost saving initiatives;\n•\nour ability to successfully integrate acquisitions, including the acquisition of Hillrom, and the related impact on our organization structure, senior leadership, culture, functional alignment, outsourcing and other areas, our management of resulting related personnel capacity constraints and potential institutional knowledge loss, and our ability to achieve anticipated performance or financial targets and maintain our reputation following integration;\n•\nthe impact of global economic conditions (including, among other things, changes in taxation, tariffs, trade policies and treaties, sanctions, embargos, export control restrictions, inflation levels and interest rates, financial market volatility, banking crises, the potential for a recession, the war in Ukraine, the conflict in the Middle East and other geopolitical events and the potential for escalation of these conflicts, the related economic sanctions being imposed globally in response to the conflicts and potential trade wars, global public health crises, pandemics and epidemics, or the anticipation of any of the foregoing, on our operations and our employees, customers, suppliers, and foreign governments in countries in which we operate;\n•\nfailure to accurately forecast or achieve our short-and long-term financial performance and goals, market and category growth rates, and related impacts on our liquidity;\n•\nour ability to execute on our capital allocation plans, including our debt repayment plans, the timing and amount of any dividends, share repurchases and divestiture proceeds;\n•\ndowngrades to our credit ratings or ratings outlooks, or withdrawals by rating agencies from rating us and our indebtedness, and the related impact on our funding costs and liquidity;\n•\nfluctuations in foreign exchange and interest rates;\n•\nthe impact of any goodwill, intangible asset, or other long-lived asset impairments on our operating results;\n•\nour ability to finance and develop new products or services, or enhancements thereto, on commercially acceptable terms or at all;\n•\nproduct development risks, including satisfactory clinical performance and obtaining and maintaining required regulatory approvals (including as a result of evolving regulatory requirements or the withdrawal or resubmission of any pending applications), the ability to manufacture at appropriate scale, and the general unpredictability associated with the product development cycle;\n•\ndemand and market acceptance risks for, and competitive pressures related to, new and existing products and services, challenges with accurately predicting changing customer preferences and future expenditures and inventory levels and with being able to monetize new and existing products and services (and to sustain any related price increases), the impact of those products and services on quality and patient safety concerns, and the need for ongoing training and support for our products and services;\n61\n•\nthe impact of competitive products and pricing, including generic competition, drug reimportation, and disruptive technologies;\n•\nregulatory agency inspections, product quality or patient safety issues leading to product recalls, withdrawals, labeling changes, launch delays, warning letters, import bans, denial of import certifications, sanctions, seizures, litigation, or declining sales, including the focus on evaluating product portfolios for the potential presence or formation of nitrosamines;\n•\nfuture actions of, or failures to act or delays in acting by FDA, the European Medicines Agency, or any other regulatory body or government authority (including the SEC, DOJ, or the Attorney General of any state) that could delay, limit or suspend product development, manufacturing or sale or result in seizures, recalls, injunctions, monetary sanctions or criminal or civil liabilities;\n•\nfailures with respect to our quality, compliance or ethics programs;\n•\nloss of key employees, including senior management, the occurrence of labor disruptions (including as a result of labor disagreements under bargaining agreements or national trade union agreements or disputes with works councils) or the inability to attract, develop, retain and engage employees;\n•\ninability to create additional production capacity in a timely manner or the occurrence of other manufacturing, sterilization, or supply difficulties, including as a result of natural disaster (such as Hurricane Helene), war, terrorism, global public health crises and epidemics/pandemics, regulatory actions, or otherwise; \n•\nfuture actions of third parties, including third-party payors and our customers and distributors (including GPOs and IDNs);\n•\nthe continuity, availability, and pricing of acceptable raw materials and component parts, our ability to pass some or all of these costs to our customers through price increases or otherwise, and the related continuity of our manufacturing and distribution and those of our suppliers;\n•\nbreaches, including by cyber-attack, data leakage, unauthorized access or theft, or failures of or vulnerabilities in, our information technology systems, or products;\n•\nability to effectively develop, integrate or deploy artificial intelligence, machine learning and other emerging technologies into our products, services and operations in a manner that is compliant with existing and emerging regulations;\n•\nthe impact of physical effects of climate change, severe storms (including Hurricane Helene) and storm-related events, including our ability to resume production at our North Cove facility to pre-hurricane levels and to complete the remediation;\n•\nchanges to legislation and regulation and other governmental pressures in the United States and globally, including the cost of compliance and potential penalties for purported noncompliance thereof, including new or amended laws, rules and regulations as well as the impact of healthcare reform and its implementation, suspension, repeal, replacement, amendment, modification and other similar actions undertaken by the United States or foreign governments, including with respect to pricing, reimbursement, taxation and rebate policies; \n•\nability meet evolving and varied corporate responsibility expectations of our stakeholders, including compliance with new and emerging sustainability regulations;\n•\nglobal regulatory, trade, and tax policies, including with respect to climate change and other sustainability matters;\n•\nthe ability to protect or enforce our patents or other proprietary rights (including trademarks, copyrights, trade secrets, and know-how) or where the patents of third parties prevent or restrict our manufacture, sale, or use of affected products or technology;\n•\nany changes in law concerning the taxation of income (whether with respect to current or future tax reform);\n•\nactions by tax authorities in connection with ongoing tax audits;\n•\nthe outcome of pending or future litigation; \n•\nother factors discussed elsewhere in this Annual Report on Form 10-K, including those factors described in Item 1A. Risk Factors, and other filings with the SEC, all of which are available on our website.\n62\nActual results may differ materially from those projected in the forward-looking statements, which are more fully discussed in Item 1A. Risk Factors and Item 7. Management's Discussion and Analysis of Financial Condition and Results of Operations and elsewhere in this Annual Report on Form 10-K. These forward-looking statements are not exclusive and are in addition to other factors discussed elsewhere in this Annual Report on Form 10-K. Further, other unknown or unpredictable factors could also have material adverse effects on future results. Any forward-looking statement in this Annual Report on Form 10-K speaks only as of the date on which it is made. Except as required by law, we assume no obligation, and expressly disclaim any obligation, to update or revise any forward-looking statements, whether as a result of new information or future events.",
  "item2": null
}