{
  "source_file": "bax-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2.    Management’s Discussion and Analysis of Financial Condition and Results of Operations\nRefer to our Annual Report on Form 10-K for the year ended December 31, 2024 (2024 Annual Report) for management’s discussion and analysis of our financial condition and results of operations. The following is management’s discussion and analysis of our financial condition and results of operations for the three and nine months ended September 30, 2025 and 2024.\nCOMPLETED STRATEGIC ACTIONS\nSince January 2023, we have completed several strategic actions, as discussed below. \nSale of Kidney Care Business\nOn August 12, 2024, we entered into an Equity Purchase Agreement (EPA) with certain affiliates of Carlyle Group Inc. (Carlyle) to sell our Kidney Care business. That business, which is now known as Vantive Health LLC (Vantive) is comprised of our former Kidney Care segment and provides chronic and acute dialysis therapies and services, including peritoneal dialysis, hemodialysis, continuous renal replacement therapies, and other organ support therapies. On January 31, 2025, we completed the sale of our Kidney Care business to Carlyle for an aggregate purchase price of $3.80 billion in cash, subject to certain closing cash, working capital and debt adjustments. After giving effect to certain closing adjustments, we received approximately $3.71 billion pre-tax cash proceeds at closing of the transaction with the net after tax proceeds of approximately $3.3 billion, prior to giving effects to certain post-closing adjustments. In the third quarter of 2025, the purchase price was reduced by $99 million for final closing cash, working capital and other post-closing adjustments in accordance with the terms of the EPA, and we expect to make a payment in such amount to Carlyle in the fourth quarter of 2025. As of September 30, 2025, we repaid $3.81 billion of short- and long-term indebtedness primarily with the net after-tax cash proceeds from the sale of our Kidney Care business. \nThe financial position, results of operations and cash flows of our Kidney Care business, including our gain from the sale of that business and the related cash proceeds received, are reported as discontinued operations in the accompanying condensed consolidated financial statements, and our prior period results have been adjusted to reflect discontinued operations. \nWe have incurred and expect to incur additional dis-synergies following our sale of our Kidney Care business due to the reduced size of our company and, as a result, we have begun to undertake certain restructuring actions (and intend to undertake additional actions) to help ensure our cost structuring is appropriate to support our remaining business. \nSee Notes 2 and 5 of this Quarterly Report on Form 10-Q for additional information.\nImplementation of Operating Model and Resulting Segment Change\nIn the third quarter of 2023, we completed the implementation of an operating model intended to simplify and streamline our operations and better align our manufacturing and supply chain to our commercial activities. Under this operating model, our business is currently comprised of three reportable segments: Medical Products & Therapies, Healthcare Systems & Technologies, and Pharmaceuticals (each as discussed below). \nFor financial information about our segments, see Note 16 in Item 1 of this Quarterly Report on Form 10-Q for additional information. \nSale of BioPharma Solutions (BPS) Business\nOn September 29, 2023, we completed the sale of our BioPharma Solutions (BPS) business and received cash proceeds of $3.96 billion from that transaction. We used substantially all of the after-tax proceeds from this transaction to repay certain of our debt obligations, including $514 million of commercial paper borrowings and $2.28 billion of long-term debt that we repaid during the fourth quarter of 2023, as well as €750 million of senior notes that we repaid during the second quarter of 2024. \n35\nFACTORS AFFECTING OUR RESULTS OF OPERATIONS\nHurricane Helene\nIn September 2024, Hurricane Helene, which brought significant rain and extensive flooding to Western North Carolina, caused damage to certain of our assets at our North Cove facility in Marion, North Carolina and disrupted operations at that facility. The facility was fully operational by the end of the first quarter of 2025. In response to Hurricane Helene and the related supply disruption, certain customers have enacted fluid conservation practices which have resulted in, and are currently expected to continue to result in, reduced demand in our intravenous (IV) solutions business. See Note 1 in Item 1 of this Quarterly Report on Form 10-Q for additional information.\nNovum IQ Large Volume Pump (Novum LVP)\nOn April 24, 2025, we initiated a voluntary correction for the Novum LVP due to the potential for under-infusion when the pump is in \"standby mode\" for an extended period of time. On May 20, 2025, the U.S. Food and Drug Administration (FDA) classified this voluntary correction as a Class I recall. In July 2025, we initiated voluntary corrections for the Novum LVP due to the potential for under-infusion when the pump is directed to deliver a bolus infusion or significantly increase the rate of infusion after it has been running at a lower infusion rate and the potential for over- and under-infusion related to set misloading, as well as certain software anomalies. In August 2025, the FDA classified these additional voluntary corrections as Class I recalls. We have implemented certain corrections related to the recalls and are developing additional corrections related to these recalls, some of which will require regulatory approval). In July 2025, we elected to temporarily stop distributing and installing the Novum LVP in the U.S. and Canada, except in the case of medical necessity. While the timing of this continued ship and installation hold remains uncertain, we currently expect it to be in place beyond 2025. Additionally, while we expect no additional sales of Novum LVP while these holds are in effect, our Spectrum IQ large volume pump is generally available as an alternative option for customers with Novum LVPs. We have recorded a reserve for remediation costs associated with these initial Novum LVP corrections in the second quarter that is not material to our financial results. However, these estimates may be subject to change and these and other additional costs (including those associated with any additional corrections) could become material in the future. Additionally, while returns and exchanges of Novum LVP made to date are not material for our financial results, future returns or exchanges (including related costs) could have a material impact on our results in the future. \nSupply Constraints, Tariffs, Global Economic Conditions \nWe have experienced challenges to our global supply chain (some of which have been significant), including, as a result of adverse impacts from significant weather events like Hurricane Helene, as well as adverse impacts as result of other global macroeconomic and geopolitical events, which have had a negative impact on our results of operations and may do so in the future. In addition, announcements regarding changes in U.S. trade policies and practices, including the implementation of global tariffs and proposed further tariffs (including potential pharmaceutical tariffs), and responses from other jurisdictions, have significantly affected financial markets and economic conditions. While we are in the process of implementing select tariff offsets and working to identify additional mitigation opportunities, our results have been adversely affected by these events and we expect for our results to continue to be negatively affected by tariffs. Additionally, continued global macroeconomic uncertainty, including in trade policies and practices, elevated tariffs and operational and policy changes in the governments of the U.S. and other countries (including a prolonged U.S. federal government shutdown), could contribute to further market volatility, deteriorating or prolonged weakened economic conditions and decreased hospital capital spending levels, all of which could adversely affect our business, results of operations or financial condition. Sole source supplier relationships may limit our ability to respond to these tariffs with alternative or lower cost raw materials or component parts.\nOur results of operations are also affected by macroeconomic conditions and levels of business confidence. The aforementioned tariffs and any retaliatory countermeasures, operational and policy changes in the governments of the U.S. and other countries, the war in Ukraine, the conflict in the Middle East, other geopolitical events (and the potential for escalation of these and other conflicts), and recent political changes to trade policies, have increased the levels of economic and political uncertainty and we continue to closely monitor the developing situations and the estimated impact on our business, results of operations, financial condition and cash flows. While we have substantially completed our wind down efforts related to our business in Russia, a significant escalation or expansion of economic disruption or the current scope of the war in Ukraine could have an adverse effect on our operations (including our supply chain) in the region.\n36\nOver the past few years, the existence of high inflation rates in the United States and in many of the countries where we conduct business has resulted in, and may in the future result in, higher interest rates, shipping costs, labor costs, and other costs and expenses. Additionally, adverse changes in foreign currency exchange rates have increased, and could continue to increase, our costs of sourcing certain raw materials in some jurisdictions. We have experienced and are likely in the future to experience inflationary and other increases in manufacturing costs and operating expenses (including as a result of the aforementioned tariffs) and are limited in our ability to pass these cost increases on to our customers in a timely manner or at all due to the longer term nature of our customer contracts and arrangements, which could have a material adverse impact on our profitability and results of operations. Inflation and general macroeconomic factors have caused certain of our customers to reduce or delay orders for our products and services and could cause them to do so in the future, which could have a material adverse impact on our sales and results of operations.\nAs a medical products company, our operations and many of the products manufactured or sold by us are subject to extensive regulation by numerous government agencies, both within and outside the United States. These regulations (as described in Item 1, Government Regulation, of our Annual Report on Form 10-K for the fiscal year ended December 31, 2024) require that we obtain specific approval from FDA or the applicable non-U.S. regulatory authorities before we can market and sell most of our products in a particular country. Failure to obtain or maintain those approvals, clearances (including temporary importation authorizations), licenses or other marketing authorizations could have a material adverse impact on our business (including with respect to our ability to compete in the product markets in which we currently operate). Furthermore, FDA in the United States, the European Medicines Agency in Europe, the China Food and Drug Administration in China, Health Canada and other government agencies, inside and outside of the United States, administer requirements covering the testing, safety, effectiveness, manufacturing, labeling, promotion and advertising, pricing, distribution, and post-market surveillance of our products. Our failure to comply with these requirements have subjected us to and may in the future subject us to various actions. These have included, or may in the future include, warning letters, product recalls or seizures, import bans, adverse regulatory site inspection reports, voluntary or official action indicated classifications, monetary sanctions, injunctions to halt the manufacture or distribution of products, civil or criminal sanctions (which may include corporate integrity agreements or consent decrees), costly litigation, refusal of a government to grant or the government withdrawal approvals, clearances, licenses or other marketing authorizations, or restrictions on our operations or withdrawal of existing approvals and licenses, and may have a material adverse impact on our results of operations (including on our ability to launch new products and demand for those products).\nFor further discussion, please refer to Item 1A, Risk Factors in our Annual Report on Form 10-K for the fiscal year ended December 31, 2024.\nNON-GAAP FINANCIAL MEASURES\nOur presentation of percentage changes in net sales at operational sales growth excludes the impact of the Kidney Care MSA sales not reflected in reportable segments, reflects the previously announced exit of IV solutions in China in our Infusion Therapies & Technologies division, in our Medical Products & Therapies reportable segment, and is calculated at constant currency rates. Constant currency rates are computed using current period local currency sales at the prior period’s foreign exchange rates. Operational sales growth is a non-GAAP financial measure. This measure provides information about growth (or declines) in our net sales as if the Kidney Care MSA and the exit of IV solutions in China had no impact on our sales and foreign currency exchange rates had not changed between the prior period and the current period. We believe that the non-GAAP measure of percent change in net sales at operational sales growth, when used in conjunction with the U.S. GAAP measure of percent change in net sales at actual rates, may provide a more complete understanding and facilitate a fuller analysis of our results of operations, particularly in evaluating performance from one period to another.\nRESULTS OF OPERATIONS\nNet income (loss) attributable to Baxter stockholders for the three months ended September 30, 2025 was $(46) million, or $(0.09) per diluted share, compared to $140 million, or $0.27 per diluted share for the three months ended September 30, 2024. For the three months ended September 30, 2025, our results included special items that adversely impacted net income (loss) attributable to Baxter stockholders by $401 million, or $0.78 per diluted share. For the three months ended September 30, 2024, our results included special items that adversely impacted net income (loss) attributable to Baxter stockholders by $271 million, or $0.53 per diluted share. \n37\nNet income (loss) attributable to Baxter stockholders for the nine months ended September 30, 2025 was $171 million, or $0.33 per diluted share, compared to $(137) million, or $(0.27) per diluted share for the nine months ended September 30, 2024. For the nine months ended September 30, 2025, our results included special items that adversely impacted net income (loss) attributable to Baxter stockholders by $780 million, or $1.52 per diluted share. For the nine months ended September 30, 2024, our results included special items that adversely impacted net income (loss) attributable to Baxter stockholders by $1.22 billion, or $2.40 per diluted share. \nNet income (loss) from continuing operations for the three months ended September 30, 2025 was $(51) million, or $(0.10) per diluted share, compared to $61 million, or $0.12 per diluted share for the three months ended September 30, 2024. Net income (loss) from continuing operations for the three months ended September 30, 2025 included special items that adversely impacted net income (loss) by $404 million, or $0.79 per diluted share. Net income (loss) from continuing operations for the three months ended September 30, 2024 included special items that adversely impacted net income (loss) by $191 million, or $0.37 per diluted share. \nNet income (loss) from continuing operations for the nine months ended September 30, 2025 was $135 million, or $0.26 per diluted share, compared to $162 million, or $0.32 per diluted share for the nine months ended September 30, 2024. Net income (loss) from continuing operations for the nine months ended September 30, 2025 included special items that adversely impacted net income (loss) by $807 million, or $1.57 per diluted share. Net income (loss) from continuing operations for the nine months ended September 30, 2024 included special items that adversely impacted net income (loss) by $507 million, or $0.99 per diluted share. \nSee the subsection entitled “Special Items” for information about special items for all periods presented. \nCONSOLIDATED NET SALES\nThree Months Ended September 30,\nPercent change\n(in millions)\n2025\n2024\nAt actual\nrates\nAt operational sales growth \n1\nUnited States\n$\n1,544 \n$\n1,500 \n3 \n%\n(1)\n%\nEmerging markets\n2\n355 \n347 \n2 \n%\n6 \n%\nRest of world\n3\n936 \n852 \n10 \n%\n5 \n%\nTotal net sales\n$\n2,835 \n$\n2,699 \n5 \n%\n2 \n%\nNine Months Ended September 30,\nPercent change\n(in millions)\n2025\n2024\nAt actual\nrates\nAt operational sales growth \n1\nUnited States\n$\n4,570 \n$\n4,340 \n5 \n%\n2 \n%\nEmerging markets\n2\n996 \n1,001 \n(0)\n%\n4 \n%\nRest of world\n3\n2,704 \n2,542 \n6 \n%\n3 \n%\nTotal net sales\n$\n8,270 \n$\n7,883 \n5 \n%\n2 \n%\n1\n     Percent change in net sales at operational sales growth is a non-GAAP financial measure. See the section entitled “Non-GAAP Financial Measures” for additional information about our use of that measure.\n2\n    Emerging markets includes sales from our operations in Eastern Europe, the Middle East, Africa, Latin America, and Asia (except for Japan).\n3\n    Rest of world includes sales from our operations in Western Europe, Canada, Japan, Australia, and New Zealand.\nIn the third quarter of 2025, the Kidney Care MSA sales favorably impacted sales growth by 3% and the previously announced exit of IV solutions in China adversely impacted sales by 1%. Additionally, in the third quarter of 2025, foreign currency rates favorably impacted net sales growth by 1%. In the first nine months of 2025, the Kidney Care MSA sales favorably impacted sales growth by 3%. The exit of IV solutions in China and foreign currency rates were not meaningful.\n38\nNET SALES BY SEGMENT\nMedical Products & Therapies\nOur Medical Products & Therapies segment includes sales of our sterile IV solutions, infusion systems, administration sets, parenteral nutrition therapies and surgical hemostat, sealant, and adhesion prevention products. \nThree Months Ended September 30,\nPercent change\n(in millions)\n2025\n2024\nAt actual\nrates\nAt operational sales growth \n1\nInfusion Therapies & Technologies\n$\n1,023 \n$\n1,070 \n(4)\n%\n(4)\n%\nAdvanced Surgery\n306 \n272 \n13 \n%\n11 \n%\nTotal Medical Product & Therapies net sales\n$\n1,329 \n$\n1,342 \n(1)\n%\n(1)\n%\nNine Months Ended September 30,\nPercent change\n(in millions)\n2025\n2024\nAt actual\nrates\nAt operational sales growth\n1\nInfusion Therapies & Technologies\n$\n3,041 \n$\n3,081 \n(1)\n%\n0 \n%\nAdvanced Surgery\n870 \n812 \n7 \n%\n7 \n%\nTotal Medical Product & Therapies net sales\n$\n3,911 \n$\n3,893 \n0 \n%\n2 \n%\n1\n     Percent change in net sales at operational sales growth is a non-GAAP financial measure. See the section entitled “Non-GAAP Financial Measures” for additional information about our use of that measure.\nMedical Product & Therapies segment net sales decreased 1% in the third quarter and were flat in the first nine months of 2025, as compared to the prior year periods. \nInfusion Therapies & Technologies net sales decreased 4% in the third quarter and decreased 1% in the first nine months of 2025, as compared to the prior year periods. The decline in the third quarter of 2025 was primarily the lower Novum LVP pump sales as a result of the shipment hold. Sales volumes were further impacted by reduced U.S. demand in our IV Solutions business as hospital customers continued IV fluid conservation practices originally instituted in response to Hurricane Helene. Volume declines in the third quarter were partially offset by price increases and one-time pricing benefits. The previously announced exit of IV solutions in China adversely impacted sales growth by 1% and foreign exchange rates favorably impacted sales growth by 1% for the third quarter of 2025, as compared to the prior year period. Sales performance in the first nine months of 2025 declined, primarily due to lower demand in our IV Solutions business in the U.S. as customers continued the aforementioned fluid conservation practices. This decline was partially offset by one-time pricing benefits and price increases in certain products globally. The previously announced exit of IV solutions in China adversely impacted sales growth by 1% for the first nine months of 2025, as compared to the prior year period. We expect some hospital customers to continue a level of conservation through the remainder of 2025 and potentially beyond with the impact expected to lessen over time. As previously discussed in \"Factors Affecting our Results of Operations\", we elected to temporarily stop distributing and installing the Novum LVP in the U.S. and Canada, except in the case of medical necessity. Although the timing of this continued ship and installation hold remains uncertain, we currently expect it to be in place beyond 2025. As a result, we expect no additional sales of Novum LVP while these holds are in effect, however our Spectrum IQ large volume pump is generally available as an alternative option for customers with Novum LVPs. Additionally, while returns and exchanges of Novum LVP made to date are not material for our financial results, future returns or exchanges could have a material impact on our financial results in the future.\nAdvanced Surgery net sales increased 13% in the third quarter and increased 7% in the first nine months of 2025, as compared to the prior year period. Sales performance was primarily driven by growth in hemostats and sealants and was primarily attributable to increased sales volume globally. Foreign currency exchange rates favorably impacted sales growth by 2% for the third quarter of 2025, as compared to the prior year period.\nHealthcare Systems & Technologies\nOur Healthcare Systems & Technologies segment includes sales of our connected care solutions and collaboration tools, including smart bed systems, patient monitoring systems and diagnostic technologies, respiratory health devices, and advanced equipment for the surgical space, including operating room integration technologies, precision \n39\npositioning devices, and other accessories. \nThree Months Ended September 30,\nPercent change\n(in millions)\n2025\n2024\nAt actual\nrates\nAt operational sales growth \n1\nCare & Connectivity Solutions\n$\n473 \n$\n456 \n4 \n%\n3 \n%\nFront Line Care\n300 \n296 \n1 \n%\n1 \n%\nTotal Healthcare Systems & Technologies net sales\n$\n773 \n$\n752 \n3 \n%\n2 \n%\nNine Months Ended September 30,\nPercent change\n(in millions)\n2025\n2024\nAt actual\nrates\nAt operational sales growth \n1\nCare & Connectivity Solutions\n$\n1,374 \n$\n1,310 \n5 \n%\n4 \n%\nFront Line Care\n870 \n857 \n2 \n%\n2 \n%\nTotal Healthcare Systems & Technologies net sales\n$\n2,244 \n$\n2,167 \n4 \n%\n3 \n%\n1\n     Percent change in net sales at operational sales growth is a non-GAAP financial measure. See the section entitled “Non-GAAP Financial Measures” for additional information about our use of that measure.\nHealthcare Systems & Technologies segment net sales increased 3% in the third quarter and increased 4% in the first nine months of 2025, as compared to the prior year periods.\nCare & Connectivity Solutions net sales increased 4% in the third quarter and increased 5% in the first nine months of 2025, as compared to the prior year periods. Sales performance was primarily driven by increased volume associated with increased capital spending by customers in the U.S., as compared to the prior year periods, as well as higher installations of our care communications products. Foreign currency exchange rates favorably impacted sales growth by 1% for the third quarter and the first nine months of 2025, as compared to the prior year periods.\nFront Line Care net sales increased 1% in the third quarter and increased 2% in the first nine months of 2025, as compared to the prior year periods. Sales performance in both periods was primarily driven by growth in our cardiology products partially offset by a strategic product exit within our respiratory health products business.\nPharmaceuticals\nOur Pharmaceuticals segment includes sales of specialty injectable pharmaceuticals, inhaled anesthesia and drug compounding.\nThree Months Ended September 30,\nPercent change\n(in millions)\n2025\n2024\nAt actual\nrates\nAt operational sales growth \n1\nInjectables & Anesthesia\n$\n333 \n$\n321 \n4 \n%\n3 \n%\nDrug Compounding\n299 \n267 \n12 \n%\n11 \n%\nTotal Pharmaceuticals net sales\n$\n632 \n$\n588 \n7 \n%\n7 \n%\nNine Months Ended September 30,\nPercent change\n(in millions)\n2025\n2024\nAt actual\nrates\nAt operational sales growth \n1\nInjectables & Anesthesia\n$\n1,000 \n$\n990 \n1 \n%\n1 \n%\nDrug Compounding\n825 \n778 \n6 \n%\n6 \n%\nTotal Pharmaceuticals net sales\n$\n1,825 \n$\n1,768 \n3 \n%\n3 \n%\n1\n     Percent change in net sales at operational growth rates is a non-GAAP financial measure. See the section entitled “Non-GAAP Financial Measures” for additional information about our use of that measure.\n40\nPharmaceuticals segment net sales increased 7% in the third quarter and increased 3%\n \nin the first nine months of 2025, as compared to the prior year periods. \nInjectables & Anesthesia net sales increased 4% in the third quarter and increased 1% in the first nine months of 2025, as compared to the prior year periods. Sales performance in the third quarter and first nine months was primarily driven by strong growth in inhaled anesthesia in certain international markets and a favorable comparison in specialty injectables to the prior year periods due to the timing of certain sales and supply constraints impacting international sales. Foreign exchange favorably impacted sales growth by 1% for the third quarter, as compared to the prior year period. \nDrug Compounding net sales increased 12% in the third quarter and increased 6% in the first nine months of 2025, as compared to the prior year periods. Sales performance in the current year periods was driven by improved product mix and increased demand for our international pharmacy compounding offerings. Foreign currency exchange rates favorably impacted sales growth by 1% for the third quarter of 2025, as compared to the prior year period.\nOther \nDuring the three months ended September 30, 2025 and 2024, we earned $101 million and $17 million, and $290 million\n \nand $55 million for the nine months ended September 30, 2025 and 2024, respectively, of revenues that were not attributable to our reportable segments. In the current year periods, Other sales primarily represented revenue recognized under the Kidney Care MSA and to a lesser extent, revenues earned by certain of our manufacturing facilities from contract manufacturing activities. In the prior year periods, Other sales primarily represented revenues earned by certain of our manufacturing facilities from contract manufacturing activities. The increase in Other sales for the third quarter and nine months ended September 30, 2025 as compared to the prior year periods reflects the impact of the Kidney Care MSA entered into upon the sale of our Kidney Care business in January 2025.\n41\nCOSTS AND EXPENSES\nSpecial Items\nThe following table provides a summary of our special items from continuing operations and the related impact by line item on our results for the three and nine months ended September 30, 2025 and 2024.\nThree Months Ended September 30,\nNine Months Ended September 30,\n(in millions)\n2025\n2024\n2025\n2024\nGross Margin\nIntangible asset amortization expense\n$\n(96)\n$\n(108)\n$\n(301)\n$\n(316)\nBusiness optimization items\n1\n(25)\n(2)\n(44)\n(8)\nAcquisition and integration items\n2\n— \n— \n— \n(1)\nEuropean medical devices regulation\n3\n(5)\n(9)\n(15)\n(25)\nSeparation-related costs\n4\n(1)\n— \n(2)\n— \nProduct related items\n5\n(32)\n(3)\n(61)\n(3)\nHurricane Helene costs\n6\n(8)\n(25)\n(123)\n(25)\nLegal matters\n7\n \n— \n— \n(11)\n— \nTotal Special Items\n$\n(167)\n$\n(147)\n$\n(557)\n$\n(378)\nImpact on Gross Margin Ratio\n(5.9)\n pts\n(5.4)\n pts\n(6.7)\n pts\n(4.8)\n pts\nSelling, General and Administrative (SG&A) Expenses\nIntangible asset amortization expense\n$\n51 \n$\n51 \n$\n152 \n$\n155 \nBusiness optimization items\n1\n10 \n16 \n51 \n41 \nAcquisition and integration items\n2\n6 \n5 \n12 \n15 \nSeparation-related costs\n4\n12 \n$\n— \n38 \n— \nLegal matters\n7\n— \n17 \n— \n17 \nTotal Special Items\n$\n79 \n$\n89 \n$\n253 \n$\n228 \nImpact on SG&A Ratio\n2.8 \n pts\n3.3 \n pts\n3.0 \n pts\n2.9 \n pts\nResearch and Development (R&D) Expenses\nBusiness optimization items\n1\n$\n3 \n$\n— \n$\n5 \n$\n— \nTotal Special Items\n$\n3 \n$\n— \n$\n5 \n$\n— \nImpact on R&D Ratio\n0.1 pts\n0.0 pts\n0.0 pts\n0.0 pts\nOther Operating Income, net\nAcquisition and integration items\n2\n$\n2 \n$\n— \n$\n2 \n$\n— \nTotal Special Items\n$\n2 \n$\n— \n$\n2 \n$\n— \nOther (Income) Expense, net\nInvestment impairments\n8\n$\n— \n$\n— \n$\n9 \n$\n— \nAcquisition and integration items\n2\n— \n— \n5 \n— \nTotal Special Items\n$\n— \n$\n— \n$\n14 \n$\n— \nIncome Tax Expense\nTax matters\n9\n$\n213 \n$\n11 \n$\n174 \n$\n45 \nTax effects of special items\n10\n(60)\n(56)\n(198)\n(144)\nTotal Special Items\n$\n153 \n$\n(45)\n$\n(24)\n$\n(99)\nImpact on Effective Tax Rate\n137.0 \npts\n(5.8)\npts\n33.3 \npts\n10.0 \npts\n1\nOur results for third quarter of 2025 and 2024 included business optimization charges of $38 million and $18 million, respectively. Our results for the first nine months of 2025 and 2024 included business optimization charges of $100 million and $49 million, respectively. These restructuring and business optimization charges in the third quarter and first nine months of 2025 included costs primarily related to our initiatives to reduce our cost structure following the sale of our former Kidney Care segment and the exit of a product line at one of our manufacturing facilities. These restructuring and business optimization costs in the third quarter and first nine months of 2024 included costs related to the implementation of a new operating model intended to simplify and streamline our operations and better align our manufacturing and supply \n42\nchain to our commercial activities and initiatives within our Healthcare Systems & Technologies segment. Refer to Note 10 in Item 1 of this Quarterly Report on Form 10-Q for further information regarding these charges and related liabilities. \n2\nOur results for the third quarter of 2025 and 2024 included $8 million and $5 million, respectively, and for the first nine months of 2025 and 2024 included $19 million and $16 million, respectively, of integration costs which primarily reflected third party consulting costs related to our ongoing integration of Hill-Rom Holdings, Inc. (Hillrom). In the first nine months of 2025, those costs also included the recognition of a noncash impairment of properly, plant and equipment related to integration activities.\n3\nOur results for the third quarter of 2025 and 2024 included $5 million and $9 million, respectively, and for the first nine months of 2025 and 2024 included $15 million and $25 million, respectively, of incremental costs to comply with the European Union's medical device regulations for previously registered products, which primarily consist of contractor costs and other direct third-party costs. We consider the adoption of these regulations to be a significant one-time regulatory change and believe that the costs of initial compliance for previously registered products over the implementation period are not indicative of our core operating results. \n4\nOur results for the third quarter and the first nine months of 2025 included $13 million and $40 million, respectively, of separation-related costs primarily reflecting costs of external advisors supporting our activities related to the sale of our former Kidney Care segment.\n5\nOur results for the third quarter and first nine months of 2025 included charges of $32 million and $61 million, respectively, related to estimates of warranty and remediation activities from field corrective actions across our infusion pump category and a revised estimate of warranty and remediation activities arising from a field corrective action on certain of our infusion pumps initially recorded in 2022. Our results for the third quarter and first nine months of 2024 included charges of $3 million related to a revised estimate of warranty and remediation activities arising from a field corrective action on certain of our infusion pumps initially recorded in 2022.\n6\nOur results in the third quarter and first nine months of 2025 included pre-tax charges of $8 million and $123 million, respectively, related to damages caused by Hurricane Helene. This amount consisted of remediation, air freight and other costs. Our results in the third quarter and first nine months of 2024 included net charges of $25 million related to Hurricane Helene. This amount consisted of $44 million related to the write-off of damaged inventory and fixed assets, partially offset by a $19 million benefit related to insurance recoveries as a result of those asset write-offs. Refer to Note 1 in Item 1 of this Quarterly Report on Form 10-Q for further information.\n7\nOur results in the first nine months of 2025 included charges of $11 million related to matters involving alleged injury from environmental exposure. Our results in the  third quarter and first nine months of 2024 included charges of $17 million related to environmental reserves for remediation actions associated with historic operations at certain of our facilities. \n8\nOur results in first nine months of 2025 included $9 million of losses from a noncash impairment write-down in an equity method investment.\n9\nOur results in the third quarter and first nine months of 2025 included $213 million and $174 million of income tax expense primarily related to an increase in reserves for uncertain tax positions and a step-up in Swiss valuation allowances, partially offset by the release of valuation allowances on foreign tax credits. The nine months ended period also included a tax benefit driven by an entity classification election that we made for U.S. tax purposes, which resulted in a capital loss. Our results in the third quarter of 2024, included $11 million of income tax expense consisting of a $26 million valuation allowance recorded to reduce the carrying amount of a tax attribute carryforward in the U.S. related to the sale of our former Kidney Care segment, partially offset by the application of the intraperiod tax allocation between continuing operations and discontinued operations. Our results for the first nine months of 2024, included $45 million of income tax expense consisting of a $26 million valuation allowance recorded to reduce the carrying amount of a tax attribute carryforward in the U.S. and internal reorganization transactions related to the sale of our former Kidney Care segment. \n10\nThis item reflects the income tax impact of the special items identified in this table. The tax effect of each special item is based on the jurisdiction in which the item was incurred and the tax laws in effect for each such jurisdiction.\nGross Margin and Expense Ratios\nThree Months Ended September 30,\n2025\n% of net sales\n2024\n% of net sales\n$ change\n% change\nGross margin\n$\n950 \n33.5 \n%\n$\n1,033 \n38.3 \n%\n$\n(83)\n(8.0)\n%\nSG&A\n$\n708 \n25.0 \n%\n$\n754 \n27.9 \n%\n$\n(46)\n(6.1)\n%\nR&D\n$\n118 \n4.2 \n%\n$\n129 \n4.8 \n%\n$\n(11)\n(8.5)\n%\nNine Months Ended September 30,\n2025\n% of net sales\n2024\n% of net sales\n$ change\n% change\nGross margin\n$\n2,802 \n33.9 \n%\n$\n3,025 \n38.4 \n%\n$\n(223)\n(7.4)\n%\nSG&A\n$\n2,129 \n25.7 \n%\n$\n2,206 \n28.0 \n%\n$\n(77)\n(3.5)\n%\nR&D\n$\n392 \n4.7 \n%\n$\n379 \n4.8 \n%\n$\n13 \n3.4 \n%\nGross Margin\nOur gross margin ratio was 33.5% and 38.3% for the three months ended September 30, 2025 and 2024, respectively. The special items identified earlier in this section had an unfavorable impact of approximately 5.9 and 5.4 percentage points on the gross margin ratio for the three months ended September 30, 2025 and 2024, respectively. Our gross margin ratio was 33.9% and 38.4% for the nine months ended September 30, 2025 and 2024, respectively. The special items identified earlier in this section had an unfavorable impact of approximately 6.7 and 4.8 percentage points on the gross margin ratio for the nine months ended September 30, 2025 and 2024, respectively. Refer to the Special Items caption above for additional detail.\n43\nExcluding the impact of special items, the gross margin ratio decreased by 4.3 and 2.6\n \npercentage points in the third quarter and first nine months of 2025, respectively, compared to the prior year periods. The lower gross margins were driven primarily by the impact of the Kidney Care MSA, product mix and unfavorable manufacturing variances, partially offset by initiatives to reduce our manufacturing and supply chain costs.\nSG&A\nOur SG&A expenses ratio was 25.0% and 27.9% for the three months ended September 30, 2025 and 2024, respectively. The special items identified earlier in this section had an unfavorable impact of approximately 2.8 and 3.3 percentage points on the SG&A expenses ratio for the three months ended September 30, 2025 and 2024, respectively. Our SG&A expenses ratio was 25.7% and 28.0% for the nine months ended September 30, 2025 and 2024, respectively. The special items identified earlier in this section had an unfavorable impact of approximately 3.0 and 2.9 percentage points on the SG&A expenses ratio for the nine months ended September 30, 2025 and 2024, respectively. \nExcluding the impact of special items, the SG&A expenses ratio decreased by 2.4 percentage points in the third quarter and first nine months of 2025 compared to the prior year periods. The decrease primarily reflects an updated estimate of indirect costs previously recorded in SG&A now capitalized into inventory after the separation of our Kidney Care business and lower accruals under our annual employee incentive compensation plans.  \nR&D\nOur R&D expenses ratio was 4.2% and 4.8% for each of the three months ended September 30, 2025 and 2024. The special items identified earlier in this section had an unfavorable impact of 0.1 percentage points and no impact on the R&D expenses ratio for each of the three months ended September 30, 2025 and 2024, respectively. Our R&D expenses ratio was 4.7% and 4.8% for the nine months ended September 30, 2025 and 2024, respectively. The special items identified earlier in this section had no impact on the R&D expenses ratio for each of the nine months ended September 30, 2025 and 2024.\nThe R&D expenses ratio decreased by 0.7 and 0.1 percentage points in the third quarter and first nine months of 2025, respectively, compared to the prior year periods, primarily reflecting a one-time benefit related to the release of a contingent milestone liability. \nBusiness Optimization Items\nIn recent years, we have undertaken actions to transform our cost structure and enhance operational efficiency. These efforts have included restructuring the organization into verticalized segments, optimizing our manufacturing footprint, R&D operations, and supply chain network, employing disciplined cost management, and centralizing and streamlining certain support functions. The related costs of these actions consisted primarily of employee termination costs, implementation costs, contract termination costs, and asset impairments.\nFor the three and nine months ended September 30, 2025, $10 million and $41 million, respectively, of the restructuring charges, consisting of employee termination costs, were related to initiatives to reduce our cost structure following the sale of our Kidney Care segment. For the three months ended September 30, 2025, $21 million of the restructuring charges reflected in the table above, consisting of $8 million of asset impairments, $8 million of contract termination and other costs, and $5 million of employee termination costs, were related to the exit of a product line at one of our manufacturing facilities. For the nine months ended September 30, 2025, $24 million of the restructuring charges reflected in the table above, consisting of $11 million of asset impairments, $8 million of contract termination and other costs, and $5 million of employee termination costs, were related to the exit of a product line at one of our manufacturing facilities.\nWe currently expect to incur additional pre-tax costs, primarily related to the implementation of business optimization programs, of approximately $1 million through the completion of certain initiatives that are currently underway. We continue to pursue cost savings initiatives, including those intended to mitigate a portion of the dis-synergies that arose as a result of the sale of our Kidney Care business, and to the extent further cost savings opportunities are identified, we would incur additional restructuring charges and costs to implement business optimization programs in future periods. Refer to Note 10 in Item 1 of this Quarterly Report on Form 10-Q for additional information regarding our business optimization programs.\n44\nOther Operating Income, Net\nOther operating income, net was $48 million and $5 million in the third quarter of 2025 and 2024, respectively, and $140 million and $9 million for the nine months ended September 30, 2025, and 2024,\n \nrespectively. In the current year periods, this amount was primarily related to the income recognized under the Kidney Care TSA entered into upon the sale of the Kidney Care business in January 2025.\nInterest Expense, Net\nInterest expense, net was $58 million and $87 million in the third quarter of 2025 and 2024,\n \nrespectively, and $180 million and $251 million for the nine months ended September 30, 2025 and 2024,\n \nrespectively. The decrease in 2025, was driven by debt repayments in the first nine months of 2025 and the fourth quarter of 2024. \nOther (Income) Expense, net\nOther (income) expense, net was income of $7 and $1 million in the third quarter of 2025 and 2024,\n \nrespectively. In the current and prior year periods, other (income) expense, net was primarily driven by pension and other postretirement benefits, partially offset by foreign exchange losses. Other (income) expense, net was income of $10 million and $34 million for the nine months ended September 30, 2025 and 2024,\n \nrespectively. In the current year period, other income, net was primarily driven by pension and other postretirement benefits, partially offset by foreign exchange losses and losses from a noncash impairment write-down in an equity method investment. In the prior year period, other income, net was primarily driven by pension and other postretirement benefits, partially offset by foreign exchange losses.\nIncome Taxes\nOur effective income tax rate was 142% and 12% for the three months ended September 30, 2025 and 2024, respectively, and 46% and 30% for the nine months ended September 30, 2025 and 2024, respectively. Our effective income tax rate can differ from the 21% U.S. federal statutory rate due to a number of factors, including foreign rate differences, tax incentives, non-deductible expenses, non-taxable income, increases or decreases in valuation allowances, increases or decreases in liabilities for uncertain tax positions, and excess tax benefits or shortfalls on stock compensation awards.  \nFor the three months ended September 30, 2025, the difference between our effective income tax rate and the U.S. federal statutory rate was primarily driven by an increase in liabilities for uncertain tax positions (as discussed below), partially offset by a reduction in the valuation allowance on foreign tax credits and changes in the treatment of accumulated earnings that are considered indefinitely reinvested as of December 31, 2024.\nFor the nine months ended\n \nSeptember 30, 2025, the difference between our effective income tax rate and the U.S. federal statutory rate was primarily driven by an increase in liabilities for uncertain tax positions (as discussed below), partially offset by a reduction in the valuation allowance on foreign tax credits, changes in the treatment of accumulated earnings that are considered indefinitely reinvested as of December 31, 2024 and a tax benefit drive by an entity classification election that we made for U.S. tax purposes, which resulted in a capital loss.\nFor the three months ended September 30, 2024, the difference between our effective income tax rate and the U.S. federal statutory rate was primarily attributable to a favorable geographic earnings mix, the tax impacts of the write-off of damaged inventory and fixed assets at our North Cove facility caused by Hurricane Helene, and a change in our assertion on the reinvested foreign earnings related to the sale of our Kidney Care segment allocated to continuing operations, partially offset by a $26 million valuation allowance recorded to reduce the carrying amount of a tax attribute carryforward in the U.S. related to the sale of our Kidney Care segment.\nFor the nine months ended September 30, 2024, the difference between our effective income tax rate and the U.S. federal statutory rate was primarily attributable to a $26 million valuation allowance recorded to reduce the carrying amount of a tax attribute carryforward in the U.S. related to the sale of our Kidney Care segment, an increase in a valuation allowance in a foreign jurisdiction resulting from changes in future projected income, an increase in income tax expense resulting from internal reorganization transactions related to the sale of our Kidney Care segment, and an increase in our liabilities for various uncertain tax positions, partially offset by a favorable geographic earnings mix.\nWe are currently under examination by the Internal Revenue Service (IRS) for transfer pricing matters related to transactions with our manufacturing operations in Costa Rica and Puerto Rico for the 2019 and 2020 tax years. While \n45\nwe have not yet received a Notice of Proposed Adjustment (NOPA) from the IRS, the examination is ongoing, and we are in the process of responding to inquiries from, and engaging in ongoing discussions with, the IRS related to certain intercompany transactions between our U.S. entities and these foreign manufacturers. As a result, we have recorded reserves for uncertain tax positions related to these transfer pricing matters for tax years 2019 through 2025. These reserves in aggregate are recorded to expense for approximately $300 million as of September 30, 2025, exclusive of any potential penalties and interest. While we believe that our transfer pricing positions are well documented and properly supported, and adequate amounts have been reserved to account for any adjustments that may ultimately result from this examination, the ultimate outcome of this matter is uncertain (upon the receipt of a NOPA or otherwise). Additionally, if the IRS were to assert we owe additional taxes and prevails in this assertion, such outcome could have a material impact on our financial position, results of operations, and cash flows.\nThere is a reasonable possibility within the next twelve months, we may reach a conclusion that an increase to the valuation allowance is needed on U.S. deferred tax assets. Our current valuation allowance is based on our historical and estimated future earnings. The timing and amount of any potential change in the valuation allowance could vary based on our future earnings (which may vary from current estimates).\nThe Organization of Economic Co-operation and Development (OECD) reached agreement among over 140 countries to implement a minimum 15% tax rate on certain multinational enterprises, commonly referred to as Pillar Two. We currently expect that the impact of the Pillar Two legislation on our income tax expense for the year ending December 31, 2025 is not expected to be material. We will continue to evaluate the impact of legislative changes as additional guidance becomes available.\nOn July 4, 2025, the United States enacted the One Big Beautiful Bill Act (OBBBA), which includes significant tax provisions, including extensions of key provisions from the 2017 Tax Cuts and Jobs Act and modifications to the U.S. international tax framework. The legislation has multiple effective dates, with certain provisions effective in 2025 and others to be implemented through 2027. We currently expect that the impact of the OBBBA legislation on our income tax expense for the year ending December 31, 2025 will not be material. We will continue to monitor regulatory guidance and interpretations as they are issued.\nDiscontinued Operations \nOn January 31, 2025, we completed the sale of our Kidney Care business and its results have been presented as discontinued operations for the three and nine months ended September 30, 2025 and 2024. Income (loss) from discontinued operations, net of tax was $5 million in the third quarter of 2025, compared to $83 million in the third quarter of 2024.The decrease in the current year period was driven by the settlement of certain net working capital adjustments reducing the gain from the sale of our Kidney Care business. For the nine months ended September 30, 2025, income (loss) from discontinued operations, net of tax was $36 million\n \nand $(290) million, respectively. The increase in the current year period was primarily driven by the $115 million pre-tax gain from the sale our Kidney Care business ($54 million net of tax) and the $430 million goodwill impairment recognized in the prior year period related to the Chronic Therapies reporting unit within our former Kidney Care segment. Refer to Note 2 within Item 1 for additional information.\n46\nSEGMENT OPERATING INCOME\nThe following is a summary of our operating income for our reportable segments.\nThree Months Ended September 30,\nNine Months Ended September 30,\n(in millions)\n2025\n2024\n2025\n2024\nMedical Products & Therapies\n$\n273 \n$\n268 \n$\n756 \n$\n733 \n% of Segment Net Sales\n20.5 \n%\n20.0 \n%\n19.3 \n%\n18.8 \n%\nHealthcare Systems & Technologies\n104 \n136 \n315 \n323 \n% of Segment Net Sales\n13.5 \n%\n18.1 \n%\n14.0 \n%\n14.9 \n%\nPharmaceuticals\n56 \n58 \n183 \n211 \n% of Segment Net Sales\n8.9 \n%\n9.9 \n%\n10.0 \n%\n11.9 \n%\nTotal reportable segment operating income\n433 \n462 \n1,254 \n1,267 \nOther\n5 \n2 \n20 \n15 \nUnallocated corporate costs\n(15)\n(73)\n(36)\n(227)\nIntangible asset amortization expense\n(147)\n(159)\n(453)\n(471)\nLegal matters\n— \n(17)\n(11)\n(17)\nBusiness optimization items\n(38)\n(18)\n(100)\n(49)\nAcquisition and integration items\n(8)\n(5)\n(14)\n(16)\nSeparation-related costs\n(13)\n— \n(40)\n— \nEuropean Medical Devices Regulation\n(5)\n(9)\n(15)\n(25)\nProduct-related items\n(32)\n(3)\n(61)\n(3)\nHurricane Helene Costs\n(8)\n(25)\n(123)\n(25)\nTotal operating income\n172 \n155 \n421 \n449 \nInterest expense, net\n58 \n87 \n180 \n251 \nOther (income) expense, net\n(7)\n(1)\n(10)\n(34)\nIncome from continuing operations before income taxes\n$\n121 \n$\n69 \n$\n251 \n$\n232 \nMedical Products & Therapies\nSegment operating income was $273 million and $268 million in the third quarter of 2025 and 2024, and $756 million and $733 million for the nine months ended September 30, 2025 and 2024, respectively. The increase in segment operating income in the third quarter and the nine months ended September 30, 2025 compared to the prior year periods was primarily driven by increased pricing, partially offset by lower sales volume, and increased manufacturing and supply costs. \nHealthcare Systems & Technologies\nSegment operating income was $104 million and $136 million in the third quarter of 2025 and 2024, and $315 million and $323 million for the nine months ended September 30, 2025 and 2024,\n \nrespectively. Segment operating income decreased in the third quarter compared to the prior year period primarily due to the impact of a higher allocation of corporate costs following the sale of our Kidney Care segment, higher accruals under our annual employee incentive compensation plans, and higher costs related to tariffs. The decrease in segment operating income for the nine months ended September 30, 2025 compared to the prior year period was primarily due to the impact of a higher allocation of corporate costs following the sale of our Kidney Care segment, higher accruals under our annual employee incentive compensation plans, and higher costs related to tariffs, partially offset by increased gross profit from higher sales and margin improvement projects.\nPharmaceuticals\nSegment operating income was $56 million and $58 million in the third quarter of 2025 and 2024, and $183 million and $211 million for the nine months ended September 30, 2025 and 2024, respectively. The decrease in segment \n47\noperating income in the third quarter and the nine months ended September 30, 2025 compared to the prior year periods was primarily due to unfavorable product mix and increased costs of goods sold.\nOther\nOther operating income, which represents operating income not attributable to our reportable segments, was $5 million and $2 million in the third quarter of 2025 and 2024, and $20 million and $15 million for the nine months ended September 30, 2025 and 2024 respectively. In the current year periods, other operating income primarily represents income from revenues earned under the Kidney Care MSA. In the prior year periods, other operating income primarily represents income from revenues earned by certain of our manufacturing facilities from contract manufacturing activities. The increase in the current year periods compared to the prior year periods reflects the revenues earned under the Kidney Care MSA following the closing of the sale of the Kidney Care business on January 31, 2025. \nUnallocated Corporate Costs\nUnder our operating model, most global functional support costs, overhead costs and other shared costs that benefit our segments are allocated to those segments. Corporate costs that are not allocated to our segments, as well as any differences between actual corporate costs and the amounts allocated to our segments, are presented as unallocated corporate costs. Additionally, intangible asset amortization and other special items are not allocated to our segments. Certain of the costs that were previously maintained at corporate under our prior segment structure that are now allocated to our segments include manufacturing variances and centrally managed supply chain costs, certain R&D costs, product category support costs, stock compensation expense, and certain employee benefit plan costs.\nLIQUIDITY AND CAPITAL RESOURCES\nThe following table is a summary of the statement of cash flows for the nine-month periods ended September 30, 2025 and 2024.\nNine Months Ended September 30,\n(in millions)\n2025\n2024\nCash flows from (used in) operations - continuing operations\n$\n355 \n$\n376 \nCash flows from (used in) investing activities - continuing operations\n(350)\n$\n(281)\nCash flows from (used in) financing activities\n(4,069)\n$\n(1,222)\nCash Flows from Operations - Continuing Operations \nFor the nine months ended September 30, 2025 operating cash flows from continuing operations were $355 million. For the nine months ended September 30, 2024, operating cash flows from continuing operations were $376 million. Operating cash flows from continuing operations in the current year period were unfavorably impacted by increased inventory levels. \nCash Flows from Investing Activities - Continuing Operations\nFor the nine months ended September 30, 2025, cash used in investing activities from continuing operations primarily included capital expenditures of $373 million. For the nine months ended \nSeptember 30, 2024\n, cash used in investing activities from continuing operations primarily included capital expenditures of $314 million, partially offset by $34 million of proceeds from sales of marketable equity securities. \nCash Flows from Financing Activities \nFor the nine months ended September 30, 2025, cash used in financing activities included debt repayments of $3.51 billion, a decrease in commercial paper borrowings of $300 million, and dividend payments of $261 million, partially offset by proceeds from stock issued under employee benefit plans of $25 million. For the nine months ended \nSeptember 30, 2024\n, cash used in financing activities included debt repayments of $827 million and dividend payments of $443 million, partially offset by proceeds from stock issued under employee benefit plans of $63 million. \nAs authorized by our Board of Directors, we repurchase our stock depending upon our cash flows, net debt levels and market conditions. In July 2012, our Board of Directors authorized a share repurchase program and the related authorization was subsequently increased a number of times. We did not repurchase any shares under this authority \n48\nin the first nine\n \nmonths of 2025. We had $1.30 billion remaining available under this authorization as of September 30, 2025.\nCredit Facilities, Commercial Paper Program and Access to Capital and Credit Ratings\nCredit Facilities and Commercial Paper Program\nAs of September 30, 2025, we had a U.S. Dollar-denominated term loan credit facility and a multicurrency revolving credit facility, as described below.\nOn June 11, 2025, we entered into an amended and restated U.S. Dollar-denominated term loan credit facility (the Term Loan Facility), which amends and restates in its entirety our existing term loan credit facility. As of September 30, 2025, we had $645 million outstanding under the Term Loan Facility, which matures in 2027. Borrowings under the Term Loan Facility bear interest on the principal amount outstanding at either Term SOFR plus an applicable margin or a “base rate” plus an applicable margin. The Term Loan Facility contains various covenants, including a maximum net leverage ratio. In February 2025, we repaid $1.00 billion under our previously existing five-year term loan facility maturing in 2026.\nOn June 11, 2025, we entered into an amended and restated revolving credit facility (the Multicurrency Revolver), which amends and restates in its entirety our existing U.S. Dollar-denominated revolving credit facility and replaces our existing Euro-denominated revolving credit facility. Our Multicurrency Revolver has a maximum capacity of $2.20 billion and matures in 2030. Borrowings under the Multicurrency Revolver bear interest on the principal amount outstanding at either Term SOFR plus an applicable margin or a “base rate” plus an applicable margin. The Multicurrency Revolver contains various covenants, including a maximum net leverage ratio. Borrowings in Euros are subject to a sublimit of $300 million. We may, at our option, seek to increase the aggregate commitment under the Multicurrency Revolver by up to $1.10 billion, which would result in a maximum aggregate commitment of up to $3.30 billion. There were no borrowings outstanding under the Multicurrency Revolver as of September 30, 2025. As of December 31, 2024, there were no borrowings outstanding under our previously existing credit facilities. Our commercial paper borrowing arrangements require us to maintain undrawn borrowing capacity under our credit facilities for an amount at least equal to our outstanding commercial paper borrowings. \nOn July 17, 2024, we entered into a credit agreement in which a group of banks have committed to provide us senior unsecured term loans in an aggregate principal amount of up to $2.05 billion (the bridge facility). Borrowings under the bridge facility were available in up to three drawings to fund (a) the refinancing of our 1.322% Senior Notes due November 29, 2024, our Floating Rate Notes due November 29, 2024, and certain borrowings under our existing term loan facility and (b) payment of certain U.S. tax liabilities arising from internal reorganization transactions related to the sale of our Kidney Care business. Borrowings under the bridge facility bore interest at a rate based on our long-term debt ratings in effect from time to time. The banks’ funding commitments under the bridge facility terminated on December 31, 2024. Outstanding borrowings under the bridge facility were scheduled to mature on the earlier of 364 days from the first funding date and November 24, 2025. Additionally, we are required to use the net cash proceeds from certain transactions (including from the sale of our Kidney Care business) to repay any outstanding borrowings under the bridge facility. There was $1.83 billion outstanding under this bridge facility as of December 31, 2024. In January 2025, we used a portion of the approximately $3.3 billion of net after-tax proceeds from the sale of our Kidney Care business to repay the $1.83 billion outstanding under this bridge facility as of December 31. 2024, at which time it was terminated. \nAs of September 30, 2025, we were in compliance with the financial covenants in these agreements. Based on our covenant calculations as of September 30, 2025, we had capacity to draw $1.10 billion under the Multicurrency Revolver. The non-performance of any financial institution supporting either of the credit facilities would reduce the maximum capacity of these facilities by the institution’s respective commitment. Additionally, a deterioration in our financial performance may further reduce our ability to draw on the Multicurrency Revolver.\nWe have a commercial paper program that currently enables us to borrow efficiently at short-term interest rates. Upon maturity of any commercial paper borrowings under this program, and to the extent old issuances are not repaid by cash on hand, we are exposed to the rollover risk of not being able to issue new commercial paper. Our commercial paper borrowing arrangements require us to maintain undrawn borrowing capacity under our revolving credit facility for an amount at least equal to our outstanding commercial paper borrowings. If we were not able to issue new commercial paper, we have the option of drawing on the Multicurrency Revolver; however, electing to do so would result in higher interest expense. We had no commercial paper borrowings outstanding as of September 30, 2025. As \n49\nof December 31, 2024 we had $300 million of commercial paper outstanding, which was repaid in full in the first quarter of 2025. \nAccess to Capital and Credit Ratings\nWe intend to fund short-term and long-term obligations as they mature through cash on hand, future cash flows from operations, or by issuing additional debt, which could include commercial paper. We had $1.73 billion of cash and cash equivalents as of September 30, 2025, with adequate cash available to meet operating requirements in each jurisdiction in which we operate. We invest our excess cash in money market and other funds and diversify the concentration of cash among different financial institutions. As of September 30, 2025, we had approximately $9.50 billion of long-term debt and finance lease obligations, including current maturities, and short-term debt. During the first nine months of 2025, we repaid $3.81 billion of short-and long-term indebtedness primarily with the net after-tax cash proceeds from the sale of our Kidney Care business. Subject to market conditions, we regularly evaluate opportunities with respect to our capital structure (including with respect to the potential refinancing of our outstanding indebtedness).\nOur ability to generate cash flows from operations, issue debt, including commercial paper, or enter into other financing arrangements on acceptable terms (including with respect to interest and other borrowing costs) could be adversely affected if there is a material decline in the sales of our products or in the solvency of our customers or suppliers, deterioration in our credit ratings (as discussed below), or other significantly unfavorable changes in conditions (including if our key financial ratios do not show sustained improvement). However, we believe we have sufficient financial flexibility to issue debt, enter into other financing arrangements, and attract long-term capital on acceptable terms to support our growth objectives and reduce our debt levels as we take actions consistent with our capital allocation priorities (which may include reductions to our quarterly dividend rate). \nOur credit ratings are subject to ongoing review by the rating agencies, and they consider a number of factors, including our financial strength, performance, prospects and operations as well as factors not under our control. The rating agencies could make adjustments to our ratings at any time, and they provide no assurances that they will maintain our ratings at current level.\n \nDuring the third quarter of 2025, Moody's Ratings (Moody's) revised our senior debt credit rating outlook rating from stable to negative. In November 2025, Moody's placed our senior secured rating and long-term debt rating and our commercial paper rating on review for downgrade. There have been no other changes to our investment grade credit ratings that we disclosed in our 2024 Annual Report. \nCRITICAL ACCOUNTING POLICIES\nThe preparation of financial statements in accordance with U.S. GAAP requires management to make estimates and   judgments that affect the reported amounts of assets, liabilities, revenues, and expenses. A summary of our significant accounting policies is included in Note 1 to our consolidated financial statements in our 2024 Annual Report. Certain of our accounting policies are considered critical, as these policies are the most important to the depiction of our financial statements and require significant, difficult or complex judgments by us, often employing the use of estimates about the effects of matters that are inherently uncertain. Such policies are summarized in the Management’s Discussion and Analysis of Financial Condition and Results of Operations section in our 2024 Annual Report.\nImpairment of Goodwill and Other Long-Lived Assets\nFront Line Care Reporting Unit\nIn connection with our November 1, 2024 annual goodwill impairment tests, we recorded a goodwill impairment\nrelated to our Front Line Care reporting unit within our Healthcare Systems & Technologies segment to reduce the carrying value of the reporting unit to its fair value. While no triggering events were identified during the nine months ended September 30, 2025, we are continuing to closely monitor the performance of this reporting unit (including in light of evolving global macroeconomic conditions and capital spending patterns), and if there is a significant adverse change in our outlook for this business in the future, a goodwill impairment could arise at that time. As of September 30, 2025, the carrying amount of goodwill for our Front Line Care reporting unit was $2.00 billion. \nThere have been no significant changes in the application of our critical accounting policies during the first nine months of 2025.\n50\nRECENT ACCOUNTING PRONOUNCEMENTS\nRecently issued accounting standards not yet adopted\nIn November 2024, the Financial Accounting Standards Board (FASB) issued Accounting Standards Update (ASU) 2024-03, Income Statement - Reporting Comprehensive Income - Expense Disaggregation Disclosures (Subtopic 220-40): Disaggregation of Income Statement Expenses, which requires disaggregated disclosure of certain expenses on an interim and annual basis in the notes to the financial statements. This standard is effective for annual consolidated financial statements for the year ending December 31, 2027 and for interim periods beginning in 2028. We are currently evaluating the impact of this new standard on our consolidated financial statements.\nIn December 2023, the FASB issued ASU 2023-09, Income Taxes (Topic 740): Improvement to Income Tax Disclosures, which requires (1) disclosure of specific categories in the rate reconciliation and (2) additional information for reconciling items that meet a quantitative threshold. Additionally, the amendment requires disclosure of certain disaggregated information about income taxes paid, income from continuing operations before income tax expense (benefit) and income tax expense (benefit). The standard is effective for our annual consolidated financial statements for the year ending December 31, 2025. We are currently evaluating the impact of this standard on our consolidated financial statements.\nLEGAL CONTINGENCIES\nRefer to Note 6 within Item 1 for a discussion of our legal contingencies. Upon resolution of any of these uncertainties, we may incur charges in excess of presently established liabilities. While our liability in connection with certain claims cannot be estimated with any certainty, and although the resolution in any reporting period of one or more of these matters could have a significant impact on our results of operations and cash flows for that period, the outcome of these legal proceedings is not currently expected to have a material adverse effect on our consolidated financial position. While we believe that we have valid defenses in these matters, litigation is inherently uncertain, excessive verdicts do occur, and we may in the future incur material judgments or enter into material settlements of claims.\nCERTAIN REGULATORY MATTERS\nIn July 2017, immediately prior to the closing of our acquisition of Claris Injectables Limited (Claris), FDA commenced an inspection of the Claris’ facilities in Ahmedabad, India. FDA completed the inspection and subsequently issued a Warning Letter based on observations identified in the 2017 inspection¹. FDA completed a re-inspection of the facilities in May 2022, which was subsequently classified as Voluntary Action Indicated (VAI). FDA performed an additional inspection of the facilities in January 2023. In April 2023, the site received an Official Action Indicated, or “OAI”, classification following FDA’s January 2023 inspection. In July 2023, FDA issued a Warning Letter to the site based on the observations from the agency’s January 2023 inspection (2023 Warning Letter)\n2\n. In June 2025, FDA performed another re-inspection of the site. On October 31, 2025, FDA classified the June 2025 inspection as VAI, indicating that the site is in acceptable compliance with FDA’s current Good Manufacturing Practice requirements. Based on the VAI reclassification, Baxter expects that the 2023 Warning Letter will be closed and no additional Warning Letters on the facilities will remain outstanding. \n1\n Available online at https://www.fda.gov/ICECI/EnforcementActions/WarningLetters/ucm613538.htm\n2 \nAvailable online at https://www.fda.gov/inspections-compliance-enforcement-and-criminal-investigations/warning-letters/baxter-healthcare-corporation-654136-07252023\nFORWARD-LOOKING INFORMATION\n \nCertain statements contained in this quarterly report on Form 10-Q may constitute “forward-looking statements,” as defined in the Private Securities Litigation Reform Act of 1995, that involve risks and uncertainties. Forward-looking statements provide current expectations of future events based on certain assumptions and include any statement that does not directly relate to any historical or current fact. These statements by their nature address matters that are uncertain to different degrees. Use of the words “may,” “will,” “would,” “could,” “should,” “believes,” “estimates,” “projects,” “potential,” “expects,” “plans,” “seeks,” “intends,” “evaluates,” “pursues,” “anticipates,” “continues,” “designs,” “impacts,” “affects,” “forecasts,” “target,” “outlook,” “initiative,” “objective,” “designed,” “priorities,” “goal,” or the negative of those words or other similar expressions may identify forward-looking statements, although not all forward-looking statements contain such words. \n51\nThese forward-looking statements are based on certain assumptions and analyses made in light of our experience and perception of historical trends, current conditions, and expected future developments as well as other factors that we believe are appropriate in the circumstances. While these statements represent our judgment on what the future may hold, and we believe these judgments are reasonable, these statements are not guarantees of any events or financial results. Whether actual future results and developments will conform to expectations and predictions is subject to a number of risks and uncertainties, including the following factors, many of which are beyond our control:\n•\nour ability to achieve the intended benefits of our recent strategic actions, including the sale of our Kidney Care business, business strategy and development activities (including the acquisition of Hillrom and completion of related integration activities) and cost saving initiatives, or of future long-term financial improvement goals;\n•\nthe impact of global economic conditions (including, among other things, changes in tariffs, taxation, trade policies and treaties, sanctions, embargos, export control restrictions, the potential for a recession, supply chain disruptions, inflation levels and interest rates, financial market volatility, banking crises, the war in Ukraine, the conflict in the Middle East and other geopolitical events (and the potential for escalation of these and other conflicts), the related economic sanctions being imposed globally in response to the conflicts and potential trade wars, global public health crises, pandemics and epidemics, or the anticipation of any of the foregoing, on our operations and our employees, customers, suppliers, and foreign governments in countries in which we operate) and our ability to identify actions to mitigate the impact of those conditions (or to realize the anticipated benefits of any such mitigating actions);\n•\ndemand and market acceptance risks for, and competitive pressures (including pricing) related to, new and existing products and services (including customer response to recent Novum LVP field actions and the related voluntary ship and installation hold, which may include additional returns or exchanges), challenges and reputational risks associated with converting customers to new or alternative products and challenges with accurately predicting changing customer preferences and future expenditures and inventory levels (including with respect to the impact of the Novum LVP ship and installation hold and what the company believes to be continuing fluid conservation practices) and with being able to monetize new and existing products and services, the impact of those products and services on quality and patient safety concerns, and the need for ongoing training and support for our products and services;\n•\nproduct development risks, including satisfactory clinical performance and obtaining and maintaining required regulatory approvals (including as a result of evolving regulatory requirements or the withdrawal or resubmission of any pending applications), the ability to manufacture at appropriate scale, and the general unpredictability associated with the product development cycle (which may result in monetary penalties owed to our suppliers in the event we do not place orders at levels contemplated in our contractual arrangements);\n•\nfuture actions of, or failures to act or delays in acting by FDA, the European Medicines Agency, or any other regulatory body or government authority (including the SEC, DOJ, Health Canada or the Attorney General of any state), or any product quality or patient safety issues (including those related to the company's infusion pump category) that could delay, limit or suspend product development, manufacturing, or sale or otherwise lead to product recalls (either voluntary or required by governmental authorities), adverse regulatory site inspection reports, voluntary or official action indicated classifications, labeling changes, launch delays, warning letters, import bans, refusal of a government to grant or the government withdrawal of approvals, clearances, licenses or other marketing authorizations, denial of import certifications, sanctions, seizures, injunctions (including to halt manufacture or distribution), monetary sanctions, criminal or civil liabilities or litigation;\n•\nthe continuity, availability, and pricing of acceptable raw materials and component parts, our ability to pass some or all of any increased costs to our customers through price increases or otherwise, and the related continuity of our manufacturing, sterilization, supply and distribution and those of our suppliers;\n•\nfailure to accurately forecast or achieve our short-and long-term financial performance and goals, market and category growth rates, growth rates for our segments, customer demand and related impacts on our liquidity (including with respect to increased inventory levels);\n•\nour ability to execute on our capital allocation plans, including our debt repayment plans, the timing and amount of any dividends, share repurchases and divestiture proceeds;\n52\n•\nany future downgrades to our credit ratings or ratings outlooks (including as a result of the Moody's review), or withdrawals by rating agencies from rating us and our indebtedness, and the related impact on our funding costs and liquidity;\n•\nour ability to finance and develop new products or services, or enhancements thereto, on commercially acceptable terms or at all;\n•\nactions by tax authorities in connection with ongoing tax audits (including with respect to transfer pricing matters and the potential issuance of one or more NOPAs), the outcome of pending or future litigation (including as a result of customer or supplier disputes) and the sufficiency of any related reserves;\n•\nfluctuations in foreign exchange and interest rates;\n•\nthe impact of any accounting estimates and assumptions, including with respect to goodwill, intangible assets, or other long-lived asset impairments on our operating results;\n•\nfailures with respect to our quality, compliance or ethics programs;\n•\nour ability to attract, develop, retain and engage key employees, including as a result of organizational or other corporate changes and strategic initiatives, and the occurrence of labor disruptions resulting from labor disagreements under bargaining agreements or national trade union agreements, disputes with works councils or otherwise;\n•\ninability to create additional production capacity in a timely manner or the occurrence of other manufacturing, sterilization, or supply difficulties, including as a result of natural disaster or severe weather event (such as Hurricane Helene), war, terrorism, global public health crises and epidemics/pandemics, regulatory actions, or otherwise; \n•\nfuture actions of third parties, including third-party payors and our customers and distributors (including group purchasing organizations (GPOs) and integrated delivery networks);\n•\nbreaches and breakdowns affecting our information technology systems or protected information, including by cyber-attack, data leakage, unauthorized access or theft, or failures of or vulnerabilities in our information technology systems or products;\n•\nability to effectively develop, integrate or deploy artificial intelligence, machine learning and other emerging technologies into our products, services and operations in a manner that is compliant with existing and emerging regulations and consistent with evolving customer preferences;\n•\nthe impact of physical effects of climate change, severe storms (including Hurricane Helene) and storm-related events;\n•\nchanges to legislation and regulation and other governmental pressures in the United States and globally, including the cost of compliance and potential penalties for purported noncompliance thereof, including new or amended laws, rules and regulations as well as the impact of healthcare reform and its implementation, suspension, repeal, replacement, amendment, modification and other similar actions undertaken by the United States or foreign governments, including with respect to pricing, reimbursement, taxation (including taxation of income, whether with respect to current or future tax reform) and rebate policies;\n•\nability to meet evolving and varied corporate responsibility expectations of our stakeholders, including compliance with emerging and potentially contradictory global sustainability regulations;\n•\nthe ability to protect or enforce our patents or other proprietary rights (including trademarks, copyrights, trade secrets, and know-how) or where the patents of third parties prevent or restrict our manufacture, sale, or use of affected products or technology; and\n•\nother factors discussed elsewhere in this report and other filings with the SEC, including those factors described in Item 1A of our Annual Report on Form 10-K for the year ended December 31, 2024, all of which are available on our website.\nActual results may differ materially from those projected in the forward-looking statements, which are more fully discussed in Item 1A. Risk Factors and Item 7. Management's Discussion and Analysis of Financial Condition and Results of Operations and elsewhere in our Annual Report on Form 10-K for the year ended December 31, 2024. These forward-looking statements are not exclusive and are in addition to other factors discussed elsewhere in our Annual Report on Form 10-K for the year ended December 31, 2024. Further, other unknown or unpredictable factors could also have material adverse effects on future results. Any forward-looking statement in this Quarterly Report on \n53\nForm 10-Q speaks only as of the date on which it is made. Except as required by law, we assume no obligation, and expressly disclaim any obligation, to update or revise any forward-looking statements, whether as a result of new information or future events.\n54"
}