{
  "source_file": "ben-20250630.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations.\nFORWARD-LOOKING STATEMENTS\nThis Form 10-Q and the documents incorporated by reference herein may include forward-looking statements that reflect our current views with respect to future events, financial performance and market conditions. Such statements are provided under the “safe harbor” protection of the Private Securities Litigation Reform Act of 1995. Forward-looking statements include all statements that do not relate solely to historical or current facts and generally can be identified by words or phrases written in the future tense and/or preceded by words such as “anticipate,” “believe,” “could,” “depends,” “estimate,” “expect,” “intend,” “likely,” “may,” “plan,” “potential,” “seek,” “should,” “will,” “would,” or other similar words or variations thereof, or the negative thereof, but these terms are not the exclusive means of identifying such statements. \nForward-looking statements involve a number of known and unknown risks, uncertainties and other important factors that may cause actual results and outcomes to differ materially from any future results or outcomes expressed or implied by such forward-looking statements, including market and volatility risks, investment performance and reputational risks, global operational risks, competition and distribution risks, third-party risks, technology and security risks, human capital risks, cash management risks, and legal and regulatory risks. The forward-looking statements contained in this Form 10-Q or that are incorporated by reference herein are qualified in their entirety by reference to the risks and uncertainties disclosed in this Form 10-Q and/or discussed under the headings “Risk Factors” and “Quantitative and Qualitative Disclosures About Market Risk” in our Annual Report on Form 10-K for the fiscal year ended September 30, 2024 (“fiscal year 2024”).\nWhile forward-looking statements are our best prediction at the time that they are made, you should not rely on them and are cautioned against doing so. Forward-looking statements are based on our current expectations and assumptions regarding our business, the economy and other possible future conditions. Because forward-looking statements relate to the future, they are subject to inherent uncertainties, risks and changes in circumstances that are difficult to predict. They are neither statements of historical fact nor guarantees or assurances of future performance. Factors or events that could cause our actual results to differ may emerge from time to time, and it is not possible for us to predict all of them. \nThe initiation or unfavorable resolution of legal proceedings or other claims and regulatory and other governmental investigations or inquiries, including the Western Asset Management (“WAM”) investigations described under the heading “Risk Factors” and in “Note 16 - Commitments and Contingencies” to our audited financial statements contained in our Annual Report on Form 10-K for fiscal year 2024, and in “Note 10 - Commitments and Contingencies” to our unaudited interim financial statements contained in this Form 10-Q, may result in additional costs, monetary judgments, settlements or other remedies, including fines, penalties, restitution and/or alterations in our business practices or those of our specialist investment managers. In addition, these matters may cause reputational harm to us or our specialist investment managers and could result in additional expenses and collateral costs, outflows of assets under management or other financial impacts that could materially affect our results of operations and the price of our common stock.\nIf a circumstance occurs after the date of this Form 10-Q that causes any of our forward-looking statements to be inaccurate, whether as a result of new information, future developments or otherwise, we undertake no obligation to announce publicly the change to our expectations, or to make any revision to our forward-looking statements, to reflect any change in assumptions, beliefs or expectations, or any change in events, conditions or circumstances upon which any forward-looking statement is based, unless required by law.\nIn this section, we discuss and analyze the results of operations and financial condition of Franklin Resources, Inc. (“Franklin”) and its subsidiaries (collectively, the “Company”). The following discussion should be read in conjunction with our Annual Report on Form 10-K for fiscal year 2024 filed with the U.S. Securities and Exchange Commission (the “SEC”), and the consolidated financial statements and notes thereto included elsewhere in this Form 10-Q. Words such as “we,” “us,” “our” and similar terms refer to the Company.\n21\nTable of Contents\nOVERVIEW\nFranklin is a holding company with subsidiaries operating under our Franklin Templeton\n®\n and/or subsidiary brand names. We are a global investment management organization that derives operating revenues and net income from providing investment management and related services to investors in jurisdictions worldwide. We deliver our investment capabilities through a variety of investment products, which include our sponsored funds, as well as institutional and high-net-worth separate accounts, retail separately managed account programs, sub-advised products and other investment vehicles. Related services include fund administration, sales and distribution, and shareholder servicing. We may perform services directly or through third parties. We offer our services and products under our various distinct brand names, including, but not limited to, Franklin\n®\n, Templeton\n®\n, Legg Mason\n®\n, Alcentra\n®\n, Benefit Street Partners\n®\n, Brandywine Global Investment Management\n®\n, Canvas\n®\n, Clarion Partners\n®\n, ClearBridge Investments\n®\n, Fiduciary Trust International™, Franklin Mutual Series\n®\n, K2\n®\n, Lexington Partners\n®\n, Martin Currie\n®\n, O’Shaughnessy\n®\n, Putnam\n®\n, \nRoyce\n®\n and Western Asset Management Company\n®\n. We offer a broad product mix of equity, fixed income, alternative, multi-asset and cash management asset classes and solutions that meet a wide variety of specific investment goals and needs for individual and institutional investors. We also provide sub-advisory services to certain investment products sponsored by other companies which may be sold to investors under the brand names of those other companies or on a co-branded basis.\nThe level of our revenues depends largely on the level and relative mix of assets under management (“AUM”). As noted in the “Risk Factors” section of our Annual Report on Form 10-K for fiscal year 2024, the amount and mix of our AUM are subject to significant fluctuations, including as a result of reputational harm, that can negatively impact our revenues and income. The level of our revenues also depends on the fees charged for our services, which are based on contracts with our funds and customers, fund sales, and the number of shareholder transactions and accounts. These arrangements could change in the future.\nDuring our third fiscal quarter, U.S. and global equity markets rebounded, despite significant volatility driven by uncertainty regarding U.S. trade tariffs. The S&P 500 Index and MSCI World Index increased 10.9% and 11.6% for the quarter and 8.8% and 9.7% for the fiscal year to date. Global bond markets provided positive results and the Bloomberg Global Aggregate Index increased 4.5% during the quarter and 1.8% for the fiscal year to date.\nOur total AUM at June 30, 2025 was $1,611.8 billion, 4% lower than at September 30, 2024 and 2% lower than at June 30, 2024. Monthly average AUM (“average AUM”) for both the three and nine months ended June 30, 2025 decreased 4% from the same periods in the prior fiscal year.\nThe business and regulatory environments in which we operate globally remain complex, uncertain and subject to change. We are subject to various laws, rules and regulations globally that impose restrictions, limitations, registration, reporting and disclosure requirements on our business, and add complexity to our global compliance operations.\nUncertainties regarding the global economy remain for the foreseeable future. As we continue to confront the challenges of the current economic and regulatory environments, we remain focused on the investment performance of our products and on providing high quality service to our clients. We continuously perform reviews of our business model. While we remain focused on expense management, we will also seek to attract, retain and develop personnel and invest strategically in systems and technology that will provide a secure and stable environment. We will continue to seek to protect and further our brand recognition while developing and maintaining broker-dealer and client relationships. The success of these and other strategies may be influenced by the factors discussed in the “Risk Factors” section of our Annual Report on Form 10-K for the fiscal year 2024.    \n22\nTable of Contents\nRESULTS OF OPERATIONS\nThree Months Ended \nJune 30,\nPercent\nChange\nNine Months Ended \nJune 30,\nPercent\nChange\n(in millions, except per share data)\n2025\n2024\n2025\n2024\nOperating revenues\n$\n2,064.0\n$\n2,122.9\n(3\n%)\n$\n6,427.0\n$\n6,266.8\n3\n%\nOperating income\n154.1\n222.5\n(31\n%)\n518.7\n558.3\n(7\n%)\nOperating margin\n1\n7.5 \n%\n10.5 \n%\n8.1 \n%\n8.9 \n%\nNet income attributable to Franklin Resources, Inc.\n$\n92.3\n$\n174.0\n(47\n%)\n$\n407.3\n$\n549.5\n(26\n%)\nDiluted earnings per share\n0.15\n0.32\n(53\n%)\n0.70\n1.03\n(32\n%)\nAs adjusted (non-GAAP):\n2\nAdjusted operating income\n$\n377.8\n$\n424.9\n(11\n%)\n$\n1,167.8\n$\n1,261.5\n(7\n%)\nAdjusted operating margin\n23.7 \n%\n25.7 \n%\n23.9 \n%\n26.0 \n%\nAdjusted net income\n$\n263.4\n$\n326.4\n(19\n%)\n$\n838.3\n$\n961.5\n(13\n%)\nAdjusted diluted earnings per share\n0.49\n0.60\n(18\n%)\n1.55\n1.81\n(14\n%)\n_________________\n1\nDefined as operating income divided by operating revenues.\n2\n“Adjusted operating income,” “adjusted operating margin,” “adjusted net income” and “adjusted diluted earnings per share” are based on methodologies other than generally accepted accounting principles. See “Supplemental Non-GAAP Financial Measures” for definitions and reconciliations of these measures.\nASSETS UNDER MANAGEMENT\nAUM by asset class was as follows:\n(in billions)\nJune 30,\n2025\nJune 30,\n2024\nPercent\nChange\nEquity\n$\n656.6 \n$\n595.0 \n10\n%\nFixed Income\n441.7 \n564.5 \n(22\n%)\nAlternative \n258.4 \n254.5 \n2\n%\nMulti-Asset\n183.2 \n168.1 \n9\n%\nCash Management\n71.9 \n64.5 \n11\n%\nTotal\n$\n1,611.8\n \n$\n1,646.6\n \n(2\n%)\nAverage AUM and the mix of average AUM by asset class are shown below.\n(in billions)\nAverage AUM \n1\nPercent\nChange\nMix of Average AUM\nfor the three months ended June 30,\n2025\n2024\n2025\n2024\nEquity\n$\n620.5 \n$\n584.0 \n6\n%\n40\n%\n36\n%\nFixed Income\n441.8 \n564.8 \n(22\n%)\n28\n%\n34\n%\nAlternative\n254.5 \n255.4 \n0\n%\n16\n%\n16\n%\nMulti-Asset\n177.8 \n165.3 \n8\n%\n11\n%\n10\n%\nCash Management\n70.6 \n63.1 \n12\n%\n5\n%\n4\n%\nTotal\n$\n1,565.2\n \n$\n1,632.6\n \n(4\n%)\n100\n%\n100\n%\n_______________\n1\nAverage AUM is calculated as the average of the month-end AUM for the trailing four months.\n23\nTable of Contents\n(in billions)\nAverage AUM \n1\nPercent\nChange\nMix of Average AUM\nfor the nine months ended June 30,\n2025\n2024\n2025\n2024\nEquity\n$\n626.0 \n$\n521.6 \n20\n%\n39\n%\n34\n%\nFixed Income\n474.3 \n534.8 \n(11\n%)\n30\n%\n35\n%\nAlternative\n251.3 \n255.7 \n(2\n%)\n16\n%\n17\n%\nMulti-Asset\n176.9 \n157.3 \n12\n%\n11\n%\n10\n%\nCash Management\n67.9 \n63.7 \n7\n%\n4\n%\n4\n%\nTotal\n$\n1,596.4\n \n$\n1,533.1\n \n4\n%\n100\n%\n100\n%\n_______________\n1\nAverage AUM is calculated as the average of the month-end AUM for the trailing ten months.\nComponents of the change in AUM are shown below. Net market change, distributions and other includes appreciation (depreciation), distributions to investors that represent return on investments and return of capital, and foreign exchange revaluation.\n(in billions)\nThree Months Ended \nJune 30,\nNine Months Ended \nJune 30,\n2025\n2024\n2025 \n1\n2024\nBeginning AUM\n$\n1,540.6 \n$\n1,644.7 \n$\n1,678.6 \n$\n1,374.2 \nLong-term inflows\n75.6 \n82.7 \n259.3 \n236.5 \nLong-term outflows\n(84.9)\n(85.9)\n(344.8)\n(237.8)\nLong-term net flows\n(9.3)\n(3.2)\n(85.5)\n(1.3)\nCash management net flows\n2.7 \n3.0 \n5.4 \n2.9 \nTotal net flows\n(6.6)\n(0.2)\n(80.1)\n1.6 \nDisposition\n(0.2)\n— \n(0.2)\n148.3 \nNet market change, distributions and other\n78.0 \n2.1 \n13.5 \n122.5 \nEnding AUM\n$\n1,611.8\n \n$\n1,646.6\n \n$\n1,611.8\n \n$\n1,646.6\n \n_______________\n1\nOn March 31, 2025, cash management AUM and net flows were updated to include $6.3 billion of AUM and $3.7 billion of net inflows related to two money market mutual fund share classes previously closed to third-party investors.\nComponents of the change in AUM by asset class were as follows:\n(in billions)\nEquity\nFixed Income\nAlternative\nMulti-Asset\nCash\nManagement\nTotal\nfor the three months ended \nJune 30, 2025\nAUM at April 1, 2025\n$\n598.1 \n$\n446.0 \n$\n251.8 \n$\n175.8 \n$\n68.9 \n$\n1,540.6 \nLong-term inflows\n32.0 \n28.2 \n5.6 \n9.8 \n— \n75.6 \nLong-term outflows\n(32.6)\n(41.2)\n(3.1)\n(8.0)\n— \n(84.9)\nLong-term net flows\n(0.6)\n(13.0)\n2.5 \n1.8 \n— \n(9.3)\nCash management net flows\n— \n— \n— \n— \n2.7 \n2.7 \nTotal net flows\n(0.6)\n(13.0)\n2.5 \n1.8 \n2.7 \n(6.6)\nDisposition\n— \n(0.1)\n(0.1)\n— \n— \n(0.2)\nNet market change, distributions and other\n59.1 \n8.8 \n4.2 \n5.6 \n0.3 \n78.0 \nAUM at June 30, 2025\n$\n656.6\n \n$\n441.7\n \n$\n258.4\n \n$\n183.2\n \n$\n71.9\n \n$\n1,611.8\n \n24\nTable of Contents\nAUM increased $71.2 billion, or 5%, during the three months ended June 30, 2025 due to the positive impact of $78.0 billion of net market change, distributions and other, and $2.7 billion of cash management net inflows, partially offset by $9.3 billion of long-term net outflows, inclusive of $17.1 billion of long-term net outflows at WAM and $3.9 billion of long-term reinvested distributions, and $0.2 billion from the disposition of funds. Net market change, distributions and other primarily consists of $76.7 billion of market appreciation, and a $10.9 billion increase from foreign exchange revaluation, partially offset by $9.6 billion of distributions. The market appreciation occurred in all asset classes, most significantly in the equity asset class, and reflected positive returns in the global equity and bond markets. Foreign exchange revaluation from AUM in products that are not U.S. dollar denominated was primarily due to a weaker U.S. dollar compared to the Euro, Canadian Dollar, Australian Dollar and British Pound.\nLong-term inflows decreased 9% to $75.6 billion, compared to the prior year period, driven by lower inflows for WAM institutional separate accounts, partially offset by by higher inflows in alternative and equity private funds and equity exchange traded funds. Long-term outflows decreased 1% to $84.9 billion, due to lower outflows for fixed income and equity institutional separate accounts, equity separately managed accounts, and equity and multi-asset open end funds, partially offset by higher outflows for multiple fixed income vehicles, equity sub-advised mutual funds and exchange traded funds, alternative private funds, and multi-asset separately managed accounts.\n(in billions)\nEquity\nFixed Income\nAlternative\nMulti-Asset\nCash\nManagement\nTotal\nfor the three months ended \nJune 30, 2024\nAUM at April 1, 2024\n$\n592.7 \n$\n571.4 \n$\n255.5 \n$\n163.4 \n$\n61.7 \n$\n1,644.7 \nLong-term inflows\n32.0 \n37.4 \n3.4 \n9.9 \n— \n82.7 \nLong-term outflows\n(33.6)\n(42.2)\n(2.0)\n(8.1)\n— \n(85.9)\nLong-term net flows\n(1.6)\n(4.8)\n1.4 \n1.8 \n— \n(3.2)\nCash management net flows\n— \n— \n— \n— \n3.0 \n3.0 \nTotal net flows\n(1.6)\n(4.8)\n1.4 \n1.8 \n3.0 \n(0.2)\nNet market change, distributions and other\n3.9 \n(2.1)\n(2.4)\n2.9 \n(0.2)\n2.1 \nAUM at June 30, 2024\n$\n595.0\n \n$\n564.5\n \n$\n254.5\n \n$\n168.1\n \n$\n64.5\n \n$\n1,646.6\n \n(in billions)\nEquity\nFixed Income\nAlternative\nMulti-Asset\nCash\nManagement \n1\nTotal\nfor the nine months ended \nJune 30, 2025\nAUM at October 1, 2024\n$\n632.1 \n$\n556.4 \n$\n249.9 \n$\n176.2 \n$\n64.0 \n$\n1,678.6 \nLong-term inflows\n126.8 \n81.1 \n17.5 \n33.9 \n— \n259.3 \nLong-term outflows\n(120.3)\n(191.3)\n(7.8)\n(25.4)\n— \n(344.8)\nLong-term net flows\n6.5 \n(110.2)\n9.7 \n8.5 \n— \n(85.5)\nCash management net flows\n— \n— \n— \n— \n5.4 \n5.4 \nTotal net flows\n6.5 \n(110.2)\n9.7 \n8.5 \n5.4 \n(80.1)\nDisposition\n— \n(0.1)\n(0.1)\n— \n— \n(0.2)\nNet market change, distributions and other\n18.0 \n(4.4)\n(1.1)\n(1.5)\n2.5 \n13.5 \nAUM at June 30, 2025\n$\n656.6\n \n$\n441.7\n \n$\n258.4\n \n$\n183.2\n \n$\n71.9\n \n$\n1,611.8\n \n_______________\n1\nOn March 31, 2025, cash management AUM and net flows were updated to include $6.3 billion of AUM and $3.7 billion of net inflows related to two money market mutual fund share classes previously closed to third-party investors.\nAUM decreased $66.8 billion, or 4%, during the nine months ended June 30, 2025 due to $85.5 billion of long-term net outflows, inclusive of $118.6 billion of long-term net outflows at WAM and $27.3 billion of long-term reinvested distributions, and $0.2 billion from the disposition of funds, partially offset by the positive impact of $13.5 billion of net market change, distributions and other, and $5.4 billion of cash management net inflows. Net market change, distributions and other primarily consists of $60.0 billion of market appreciation and a $1.4 billion increase from foreign exchange revaluation, partially offset by $47.9 billion of distributions, primarily from the equity asset class. The market appreciation occurred in all asset classes, most significantly in the equity asset class, and reflected positive returns in the global equity markets. Foreign exchange revaluation from AUM in products that are not U.S. dollar denominated was primarily due to a weaker U.S. dollar compared to the Euro, partially offset by a stronger U.S. dollar compared to the Australian Dollar, Canadian Dollar and Indian Rupee.\n25\nTable of Contents\nLong-term inflows increased 10% to $259.3 billion, as compared to the prior year period, driven by higher inflows in equity, alternative, and multi-asset open end funds, equity sub-advised mutual funds, equity separately managed accounts and exchange traded funds, and equity and alternative private funds, partially offset by lower inflows for WAM institutional separate accounts and sub-advised mutual funds. Long-term outflows increased 45% to $344.8 billion, substantially due to higher outflows across multiple fixed income vehicles at WAM, and slightly higher outflows in equity open end funds, sub-advised mutual funds, institutional separate accounts, and retail separately managed accounts.\n(in billions)\nEquity\nFixed Income\nAlternative\nMulti-Asset\nCash\nManagement\nTotal\nfor the nine months ended \nJune 30, 2024\nAUM at October 1, 2023\n$\n430.4 \n$\n483.1 \n$\n254.9 \n$\n145.0 \n$\n60.8 \n$\n1,374.2 \nLong-term inflows\n86.5 \n109.5 \n12.7 \n27.8 \n— \n236.5 \nLong-term outflows\n(93.2)\n(114.4)\n(7.6)\n(22.6)\n— \n(237.8)\nLong-term net flows\n(6.7)\n(4.9)\n5.1 \n5.2 \n— \n(1.3)\nCash management net flows\n— \n— \n— \n— \n2.9 \n2.9 \nTotal net flows\n(6.7)\n(4.9)\n5.1 \n5.2 \n2.9 \n1.6 \nAcquisition\n81.3 \n59.3 \n0.7 \n5.8 \n1.2 \n148.3 \nNet market change, distributions and other\n90.0 \n27.0 \n(6.2)\n12.1 \n(0.4)\n122.5 \nAUM at June 30, 2024\n$\n595.0\n \n$\n564.5\n \n$\n254.5\n \n$\n168.1\n \n$\n64.5\n \n$\n1,646.6\n \nAUM by sales region was as follows:\n(in billions)\nJune 30,\n2025\nJune 30,\n2024\nPercent\nChange\nUnited States\n$\n1,114.9 \n$\n1,155.0 \n(3\n%)\nInternational\nEurope, Middle East and Africa\n208.0 \n205.8 \n1\n%\nAsia-Pacific\n168.5 \n174.1 \n(3\n%)\nAmericas, excl. U.S.\n120.4 \n111.7 \n8\n%\nTotal international\n496.9 \n491.6 \n1\n%\nTotal\n$\n1,611.8\n \n$\n1,646.6\n \n(2\n%)\n26\nTable of Contents\nInvestment Performance Overview\nA key driver of our overall success is the long-term investment performance of our investment products. A measure of the performance of these products is the percentage of AUM exceeding peer group medians and benchmarks. We compare the relative performance of our mutual funds against peers, and of our strategy composites against benchmarks.\nThe performance of our mutual fund products against peer group medians and of our strategy composites against benchmarks is presented in the table below.\nPeer Group Comparison\n1\nBenchmark Comparison\n2\n% of Mutual Fund AUM\n in Top Two Peer Group Quartiles\n% of Strategy Composite AUM\n Exceeding Benchmark\nas of June 30, 2025\n1-Year\n3-Year\n5-Year\n10-Year\n1-Year\n3-Year\n5-Year\n10-Year\nEquity\n41\n%\n63\n%\n51\n%\n59\n%\n31\n%\n45\n%\n35\n%\n44\n%\nFixed Income\n65\n%\n72\n%\n68\n%\n61\n%\n65\n%\n74\n%\n82\n%\n86\n%\nTotal AUM\n3\n44\n%\n57\n%\n63\n%\n53\n%\n45\n%\n56\n%\n53\n%\n61\n%\n__________________\n1\nMutual fund performance is sourced from Morningstar and measures the percent of ranked AUM in the top two quartiles versus peers. Total mutual fund AUM measured for the 1-, 3-, 5- and 10-year periods represents 39%, 39%, 38% and 36% of our total AUM as of June 30, 2025.\n2\nStrategy composite performance measures the percent of composite AUM beating its benchmark. The benchmark comparisons are based on each account’s/composite’s (strategy composites may include retail separately managed accounts and mutual fund assets managed as part of the same strategy) return as compared to a market index that has been selected to be generally consistent with the asset class of the account/composite. Total strategy composite AUM measured for the 1-, 3-, 5- and 10-year periods represents 56%, 55%, 55% and 50% of our total AUM as of June 30, 2025.\n3\nTotal mutual fund AUM includes performance of our alternative and multi-asset funds, and total strategy composite AUM includes performance of our alternative composites. Alternative and multi-asset AUM represent 16% and 11% of our total AUM at June 30, 2025.\nMutual fund performance data includes U.S. and cross-border domiciled mutual funds and exchange-traded funds, excludes cash management and fund of funds, and assumes the reinvestment of dividends.\nPast performance is not indicative of future results. For strategy composite AUM included in institutional and retail separately managed accounts and investment funds managed in the same strategy as separate accounts, performance comparisons are based on gross-of-fee performance. For investment funds which are not managed in a separate account format, performance comparisons are based on net-of-fee performance. These performance comparisons do not reflect the actual performance of any specific separate account or investment fund; individual separate account and investment fund performance may differ. The information in this presentation is provided solely for use in connection with this document, and is not directed toward existing or potential clients of Franklin.\nOPERATING REVENUES\nThe table below presents the percentage change in each operating revenue category.\n(in millions)\nThree Months Ended \nJune 30,\nPercent\nChange\nNine Months Ended \nJune 30,\nPercent\nChange\n2025\n2024\n2025\n2024\nInvestment management fees\n$\n1,640.8 \n$\n1,689.9 \n(3\n%)\n$\n5,113.7 \n$\n5,056.0 \n1\n%\nSales and distribution fees\n351.9 \n358.3 \n(2\n%)\n1,092.3 \n1,013.0 \n8\n%\nShareholder servicing fees\n59.9 \n61.8 \n(3\n%)\n185.3 \n162.3 \n14\n%\nOther\n11.4 \n12.9 \n(12\n%)\n35.7 \n35.5 \n1\n%\nTotal Operating Revenues\n$\n2,064.0\n \n$\n2,122.9\n \n(3\n%)\n$\n6,427.0\n \n$\n6,266.8\n \n3\n%\n \n27\nTable of Contents\nInvestment Management Fees\nInvestment management fees decreased $49.1 million for the three months ended June 30, 2025 primarily due to a 4% decrease in average AUM, partially offset by a slight increase in performance fees. The decrease in average AUM for the three months ended June 30, 2025 primarily occurred in the fixed income asset class, partially offset by increases in the equity and multi-asset asset classes. Investment management fees increased $57.7 million for the nine months ended June 30, 2025 primarily due to one additional quarter of revenue earned by Putnam, which was acquired on January 1, 2024, and an increase in average equity and multi-asset AUM, partially offset by the impact of WAM outflows, a decrease in performance fees and catch-up fees recognized in the prior year at the closing of fundraising rounds in a secondary private equity fund, which ended in January 2024. \nOur effective investment management fee rate excluding performance fees (annualized investment management fees excluding performance fees divided by average AUM) was 40.5 basis points for both the three and nine months ended June 30, 2025, as compared to 40.2 and 41.4 basis points for the same period in the prior fiscal year. The increase in the fee rate for the three month period was primarily due to the impact of outflows at WAM, partially offset by significant intra-quarter daily volatility in the current year period that caused an unusual dispersion between simple monthly average AUM and daily average AUM, while the decrease for the nine month period was primarily due to higher AUM in lower fee equity products and catch-up fees recognized in the prior year at the closing of fundraising rounds in a secondary private equity fund, partially offset by the impact of outflows at WAM. \nPerformance fees were $60.6 million and $274.1 million for the three and nine months ended June 30, 2025 as compared to $56.6 million and $308.2 million for the same periods in the prior fiscal year. The increase for the three month period and decrease for the nine month period were primarily due to changes in the amount of performance fees earned by our alternative specialist investment managers.\nSales and Distribution Fees\nSales and distribution fees by revenue driver are presented below.\n(in millions)\nThree Months Ended \nJune 30,\nPercent\nChange\nNine Months Ended \nJune 30,\nPercent\nChange\n2025\n2024\n2025\n2024\nAsset-based fees\n$\n293.9 \n$\n294.6 \n0\n%\n$\n900.2 \n$\n832.1 \n8\n%\nSales-based fees\n58.0 \n63.7 \n(9\n%)\n192.1 \n180.9 \n6\n%\nSales and Distribution Fees\n$\n351.9\n \n$\n358.3\n \n(2\n%)\n$\n1,092.3\n \n$\n1,013.0\n \n8\n%\nAsset-based distribution fees decreased $0.7 million for the three months ended June 30, 2025, primarily due to a higher mix of lower fee assets, partially offset by a slight increase in the related average AUM. Asset-based distribution fees increased $68.1 million for the nine months ended June 30, 2025 primarily due to an increase of 6% in the related average AUM and one additional quarter of asset-based revenue related to Putnam products, partially offset by a higher mix of lower fee assets.\nSales-based fees decreased $5.7 million for the three months ended June 30, 2025, primarily due to a decrease of 12% in commissionable sales, and increased $11.2 million for the nine months ended June 30, 2025, primarily due to an increase of 2% in commissionable sales and one additional quarter of sales-based revenue related to Putnam products.\nShareholder Servicing Fees\nShareholder servicing fees decreased $1.9 million for the three months ended June 30, 2025, primarily due to lower levels of related AUM and increased $23.0 million for the nine months ended June 30, 2025 primarily due to one additional quarter of fees earned by Putnam, partially offset by lower margin-based fees.\n28\nTable of Contents\nOPERATING EXPENSES\nThe table below presents the percentage change in each operating expense category.\n \nThree Months Ended \nJune 30,\nPercent\nChange\nNine Months Ended \nJune 30,\nPercent\nChange\n(in millions)\n2025\n2024\n2025\n2024\nCompensation and benefits\n$\n901.1 \n$\n893.8 \n1\n%\n$\n2,812.5 \n$\n2,890.3 \n(3\n%)\nSales, distribution and marketing\n480.7 \n481.1 \n0\n%\n1,491.1 \n1,366.2 \n9\n%\nInformation systems and technology\n162.7 \n156.6 \n4\n%\n477.4 \n442.7 \n8\n%\nOccupancy\n69.5 \n104.8 \n(34\n%)\n213.9 \n247.7 \n(14\n%)\nAmortization of intangible assets\n112.2 \n84.0 \n34\n%\n337.3 \n254.4 \n33\n%\nImpairment of intangible assets\n— \n— \nNM\n24.4 \n— \nNM\nGeneral, administrative and other\n183.7 \n180.1 \n2\n%\n551.7 \n507.2 \n9\n%\nTotal Operating Expenses\n$\n1,909.9\n \n$\n1,900.4\n \n0\n%\n$\n5,908.3\n \n$\n5,708.5\n \n4\n%\nThe acquisition of Putnam on January 1, 2024 had a significant impact on operating expenses in the nine months ended June 30, 2025, however, due to the ongoing integration of the combined businesses, it is not practicable to separately quantify the impact of the legacy Putnam business.\nCompensation and Benefits\nThe components of compensation and benefits expenses are presented below.\nThree Months Ended \nJune 30,\nPercent\nChange\nNine Months Ended \nJune 30,\nPercent\nChange\n(in millions)\n2025\n2024\n2025\n2024\nSalaries, wages and benefits\n$\n428.2 \n$\n425.0 \n1\n%\n$\n1,297.7 \n$\n1,249.7 \n4\n%\nIncentive compensation\n381.8 \n396.3 \n(4\n%)\n1,208.2 \n1,205.1 \n0\n%\nAcquisition-related retention\n1\n47.9 \n43.7 \n10\n%\n128.4 \n217.3 \n(41\n%)\nAcquisition-related performance fee pass through\n1\n2.1 \n— \nNM\n87.4 \n87.0 \n0\n%\nOther\n1,2\n41.1 \n28.8 \n43\n%\n90.8 \n131.2 \n(31\n%)\nCompensation and Benefits Expenses\n$\n901.1\n \n$\n893.8\n \n1\n%\n$\n2,812.5\n \n$\n2,890.3\n \n(3\n%)\n_______________\n1\nSee “Supplemental Non-GAAP Financial Measures” for additional information.\n2\nIncludes impact of gains and losses on investments related to deferred compensation plans, which is offset in investment and other income (losses), net; minority interests in certain subsidiaries, which is offset in net income (loss) attributable to redeemable noncontrolling interests; and special termination benefits.\nSalaries, wages and benefits increased $3.2 million for the three months ended June 30, 2025, primarily due to annual salary increases and higher employee insurance costs, partially offset by the impact of headcount reductions. Salaries, wages and benefits increased $48.0 million for the nine months ended June 30, 2025, primarily due to annual salary increases and one additional quarter of expenses related to Putnam, partially offset by the impact of headcount reductions.\nIncentive compensation decreased $14.5 million for the three months ended June 30, 2025, primarily due to lower incentive compensation at certain specialist investment managers, partially offset by an increase in expense for deferred compensation awards. Incentive compensation increased $3.1 million for the nine months ended June 30, 2025, primarily due to one additional quarter of expenses related to Putnam, higher sales-related commissions, and higher annual acceleration of deferred compensation expense related to retirement-eligible employees, partially offset by lower incentive compensation at certain specialist investment managers and lower ongoing deferred compensation expense.\nAcquisition-related retention expenses increased $4.2 million for the three months ended June 30, 2025, primarily due to higher compensation associated with performance-based and time-based awards, and decreased $88.9 million for the nine months ended June 30, 2025, primarily due to lower compensation associated with time-based and performance-based awards, and lower costs associated with the acquisition of Putnam.\n29\nTable of Contents\nOther compensation and benefits increased $12.3 million for the three months ended June 30, 2025, primarily due to an increase in special termination benefits and higher compensation expense related to minority interests; and decreased $40.4 million for the nine months ended June 30, 2025, primarily due to lower net market gains on investments related to our deferred compensation plans and a decrease in special termination benefits. Special termination benefits increased $10.2 million for the three months ended June 30, 2025 primarily due to higher costs associated with workforce optimization initiatives in the current year period and decreased $19.1 million for the nine months ended June 30, 2025 primarily due to higher costs associated with such initiatives in the prior year period.\nAt June 30, 2025, our global workforce decreased to approximately 10,100 employees from approximately 10,300 at June 30, 2024.\nSales, Distribution and Marketing\nSales, distribution and marketing expenses by cost driver are presented below.\n \nThree Months Ended \nJune 30,\nPercent\nChange\nNine Months Ended \nJune 30,\nPercent\nChange\n(in millions)\n2025\n2024\n2025\n2024\nAsset-based expenses\n$\n405.6 \n$\n405.9 \n0\n%\n$\n1,245.2 \n$\n1,152.1 \n8\n%\nSales-based expenses\n55.2 \n60.2 \n(8\n%)\n187.0 \n170.8 \n9\n%\nAmortization of deferred sales commissions\n19.9 \n15.0 \n33\n%\n58.9 \n43.3 \n36\n%\nSales, Distribution and Marketing\n$\n480.7\n \n$\n481.1\n \n0\n%\n$\n1,491.1\n \n$\n1,366.2\n \n9\n%\nAsset-based expenses were essentially flat for the three months ended June 30, 2025 and increased $93.1 million for the nine months ended June 30, 2025. The increase for the nine month period was primarily due to one additional quarter of expenses related to Putnam products, an increase of 4% in the related average AUM and higher marketing support fees. Distribution expenses are generally not directly correlated with distribution fee revenues due to certain fee structures that do not provide full recovery of distribution costs.\nSales-based expenses decreased $5.0 million for the three months ended June 30, 2025, primarily due to a decrease of 12% in commissionable sales, and increased $16.2 million for the nine months ended June 30, 2025 primarily due to one additional quarter of expenses related to Putnam products, higher marketing support fees and an increase of 2% in commissionable sales.\nOccupancy\nOccupancy expenses decreased $35.3 million and $33.8 million for the three and nine months ended June 30, 2025. Both the three and nine month periods in the prior year included the impairment of the right of use asset related to office space vacated in connection with the consolidation of our office space in New York City, and the current year three and nine month periods reflect lower costs due to the office space consolidation. The decrease for the nine month period was partially offset by one additional quarter of expenses incurred by Putnam.\nInformation Systems and Technology\nInformation systems and technology expenses increased $6.1 million for the three months ended June 30, 2025, primarily due to higher costs for technology consulting and external data services, and increased $34.7 million for the nine months ended June 30, 2025, primarily due to one additional quarter of expenses incurred by Putnam, and higher technology consulting and software costs, partially offset by lower costs for hardware maintenance and purchases.\nAmortization of Intangible Assets\nAmortization of intangible assets increased $28.2 million and $82.9 million for the three and nine months ended June 30, 2025, primarily due to a reduction in the remaining useful life of definite-lived intangible assets related to WAM. \n30\nTable of Contents\nImpairment of intangible assets\nDuring the nine months ended June 30, 2025, we recognized an impairment charge of $\n24.4\n million related to certain indefinite-lived intangible assets for acquired mutual fund investment management contracts. See Critical Accounting Policies for additional information.\nGeneral, Administrative and Other\nGeneral, administrative and other operating expenses increased $3.6 million and increased $44.5 million for the three and nine months ended June 30, 2025. The increase for the three months ended June 30, 2025 was primarily due to increases of $4.8 million in placement and platform fees, $4.0 million in advertising and promotion costs, and $2.3 million in fund-related expenses, and a $2.9 million net credit recognized in the prior year to reduce the fair value of contingent consideration liabilities. These increases were partially offset by a $10.3 million decrease in legal and other professional fees, inclusive of $18.0 million of insurance recoveries. The increase for the nine months ended June 30, 2025 was primarily due to one additional quarter of expenses incurred by Putnam, and increases of $15.7 million in advertising and promotion costs, $8.0 million in placement and platform fees, and $6.4 million in fund-related expenses. These increases were partially offset by a $15.8 million decrease in acquisition-related costs, primarily related to the acquisition of Putnam, and a $2.7 million decrease in legal and other professional fees, inclusive of $45.6 million of insurance recoveries.\nOTHER INCOME (EXPENSES)\nOther income (expenses) consisted of the following:\nThree Months Ended \nJune 30,\nPercent\nChange\nNine Months Ended \nJune 30,\nPercent\nChange\n(in millions)\n2025\n2024\n2025\n2024\nInvestment and other income, net:\nDividend and interest income\n$\n38.9 \n$\n39.8 \n(2\n%)\n$\n101.4 \n$\n132.6 \n(24\n%)\nGains (losses) on investments, net\n(31.4)\n(24.3)\n29\n%\n(41.7)\n17.3 \nNM\nIncome from investments in equity method investees\n23.0 \n41.0 \n(44\n%)\n38.5 \n122.3 \n(69\n%)\nGains (losses) on derivatives, net\n(8.2)\n3.1 \nNM\n(2.7)\n(11.5)\n(77\n%)\nRental income\n10.7 \n11.1 \n(4\n%)\n32.8 \n32.8 \n0%\nForeign currency exchange (losses) gains, net\n(14.4)\n1.2 \nNM\n(7.4)\n(7.5)\n(1\n%)\nOther, net\n4.8 \n2.6 \n85\n%\n7.1 \n14.2 \n(50\n%)\nInvestment and other income, net\n23.4 \n74.5 \n(69\n%)\n128.0 \n300.2 \n(57\n%)\nInterest expense\n(25.8)\n(25.7)\n0\n%\n(69.7)\n(72.2)\n(3\n%)\nInvestment and other income (losses) of consolidated investment products, net\n35.9 \n37.6 \n(5\n%)\n(14.7)\n103.7 \nNM\nExpenses of consolidated investment products\n(11.0)\n(8.8)\n25\n%\n(29.8)\n(20.6)\n45\n%\nOther Income, Net\n$\n22.5\n \n$\n77.6\n \n(71\n%)\n$\n13.8\n \n$\n311.1\n \n(96\n%)\nDividend and interest income decreased $0.9 million and $31.2 million for the three and nine months ended June 30, 2025. The decrease for the nine months ended June 30, 2025 was primarily due to lower average balances and lower yields.\nInvestments held by the Company generated net losses of $31.4 million and $24.3 million for the three months ended June 30, 2025 and 2024. The net losses in both the current and prior year periods were primarily from investments in nonconsolidated funds and separate accounts and investments measured at cost adjusted for observable price changes. Investments held by the Company generated net losses of $41.7 million, as compared to net gains of $17.3 million for the nine months ended June 30, 2025 and 2024. The net losses in the current year were primarily from investments measured at cost adjusted for observable price changes and investments in nonconsolidated funds and separate accounts, while the net gains in the prior year were primarily from assets invested for deferred compensation plans, partially offset by losses on investments measured at cost adjusted for observable price changes.\nEquity method investees generated income of $23.0 million and $38.5 million for the three and nine months ended June 30, 2025, as compared to income of $41.0 million and $122.3 million in the prior year, largely related to various global alternative funds and global equity funds.\n31\nTable of Contents\nNet foreign currency exchange losses were $14.4 million for the three months ended June 30, 2025, as compared to net gains of $1.2 million in the prior year period. The U.S. dollar weakened in the current year period against the Euro and British Pound, which resulted in net foreign exchange losses on cash and cash equivalents denominated in U.S. dollars held by our European subsidiaries, as compared to net gains in the prior year period.\nInterest expense decreased $2.5 million for the nine months ended June 30, 2025 primarily due to lower accretion on Lexington deferred purchase consideration, partially offset by an increase in interest recognized on tax reserves.\nInvestments held by consolidated investment products (“CIPs”) generated gains of $35.9 million for the three months ended June 30, 2025, largely related to gains on holdings of various equity, fixed income, and multi-asset funds, and losses of $14.7 million for the nine months ended June 30, 2025, largely related to losses on holdings of various equity funds, partially offset by gains on holdings of various alternative, fixed income, and multi-asset funds. Investments held by CIPs generated investment gains and other income of $37.6 million and $103.7 million in the three and nine months ended June 30, 2024, largely related to gains on holdings of various funds.\nExpenses of CIPs increased $2.2 million and $9.2 million for the three and nine months ended June 30, 2025, due to activity of the funds.\nOur cash, cash equivalents and investments portfolio by asset class and accounting classification at June 30, 2025, excluding third-party assets of CIPs, was as follows:\nAccounting Classification\n1\nTotal\n(in millions)\nCash and \nCash \nEquivalents\nInvestments\nat \nFair Value\nEquity \nMethod\nInvestments\nOther Investments\nDirect \nInvestments\nin CIPs\nCash and Cash Equivalents\n$\n3,253.9 \n$\n— \n$\n— \n$\n— \n$\n— \n$\n3,253.9 \nInvestments\nAlternative\n— \n456.8 \n794.9 \n199.7 \n537.5 \n1,988.9 \nEquity\n— \n417.9 \n325.4 \n145.5 \n81.6 \n970.4 \nFixed Income\n— \n156.3 \n26.1 \n36.7 \n187.3 \n406.4 \nMulti-Asset\n— \n49.6 \n11.5 \n— \n122.4 \n183.5 \nTotal investments\n— \n1,080.6 \n1,157.9 \n381.9 \n928.8 \n3,549.2 \nTotal Cash and Cash Equivalents and Investments\n2, 3\n$\n3,253.9\n \n$\n1,080.6\n \n$\n1,157.9\n \n$\n381.9\n \n$\n928.8\n \n$\n6,803.1\n \n \n______________\n1\nSee Note 1 – Significant Accounting Policies in the notes to consolidated financial statements in Item 8 of Part II of our Annual Report on Form 10-K for fiscal year 2024 for information on investment accounting classifications.\n2\nTotal cash and cash equivalents and investments includes $4,514.6 million maintained for operational activities, including investments in sponsored funds and other products, and $449.0 million necessary to comply with regulatory requirements.\n3\nTotal cash and cash equivalents and investments includes approximately $366 million attributable to employee-owned and other third-party investments made through partnerships which are offset in noncontrolling interests, approximately $429 million of investments that are subject to long-term repurchase agreements and other net financing arrangements, and approximately $444 million of cash and investments related to deferred compensation plans.\n32\nTable of Contents\nTAXES ON INCOME\nOur effective income tax rate was 33.9% and 32.3% for the three and nine months ended June 30, 2025, as compared to 22.7% and 23.7% for the three and nine months ended June 30, 2024. The rate increase for the three month period was primarily due to a reduction in foreign rate benefits, valuation allowance on net capital losses, and lower gains of CIPs for which there is no related tax expense. The rate increase for the nine month period was primarily due to losses of CIPs for which there are no related tax benefits and a reduction in foreign rate benefits.\nOn July 4, 2025, the One Big Beautiful Bill Act (the “Act”) was signed into law. While we are in the process of evaluating the impact of the Act on our consolidated financial statements, we do not expect there to be any material impact thereon.\nOur effective income tax rate reflects the relative contributions of earnings in the jurisdictions in which we operate, which have varying tax rates. Changes in our pre-tax income mix, tax rates or tax legislation in such jurisdictions may affect our effective income tax rate and net income. \nSUPPLEMENTAL NON-GAAP FINANCIAL MEASURES\nAs supplemental information, we are providing performance measures for “adjusted operating income,” “adjusted operating margin,” “adjusted net income” and “adjusted diluted earnings per share,” each of which is based on methodologies other than generally accepted accounting principles (“non-GAAP measures”). Management believes these non-GAAP measures are useful indicators of our financial performance and may be helpful to investors in evaluating our relative performance against industry peers.\n“Adjusted operating income,” “adjusted operating margin,” “adjusted net income” and “adjusted diluted earnings per share” are defined below, followed by reconciliations of operating income, operating margin, net income attributable to Franklin Resources, Inc. and diluted earnings per share on a U.S. GAAP basis to these non-GAAP measures. Non-GAAP measures should not be considered in isolation from, or as substitutes for, any financial information prepared in accordance with U.S. GAAP, and may not be comparable to other similarly titled measures of other companies. Additional reconciling items may be added in the future to these non-GAAP measures if deemed appropriate.\nAdjusted Operating Income\nWe define adjusted operating income as operating income adjusted to exclude the following:\n•\nElimination of operating revenues upon consolidation of investment products.\n•\nAcquisition-related items:\n◦\nAcquisition-related retention compensation.\n◦\nOther acquisition-related expenses including professional fees, technology costs and fair value adjustments related to contingent consideration assets and liabilities.\n◦\nAmortization of intangible assets.\n◦\nImpairment of intangible assets and goodwill, if any.\n•\nSpecial termination benefits and other expenses related to workforce optimization initiatives related to past acquisitions and certain initiatives undertaken by the Company.\n•\nImpact on compensation and benefits expense from gains and losses on investments related to deferred compensation plans, which is offset in investment and other income (losses), net.\n•\nImpact on compensation and benefits expense related to minority interests in certain subsidiaries, which is offset in net income (loss) attributable to redeemable noncontrolling interests.\n33\nTable of Contents\nAdjusted Operating Margin\nWe calculate adjusted operating margin as adjusted operating income divided by adjusted operating revenues. We define adjusted operating revenues as operating revenues adjusted to exclude the following:\n•\nElimination of operating revenues upon consolidation of investment products.\n•\nAcquisition-related performance-based investment management fees which are passed through as compensation and benefits expense.\n•\nSales and distribution fees and a portion of investment management fees allocated to cover sales, distribution and marketing expenses paid to the financial advisers and other intermediaries who sell our funds on our behalf. \nAdjusted Net Income and Adjusted Diluted Earnings Per Share\nWe define adjusted net income as net income attributable to Franklin Resources, Inc. adjusted to exclude the following:\n•\nActivities of CIPs.\n•\nAcquisition-related items:\n◦\nAcquisition-related retention compensation.\n◦\nOther acquisition-related expenses including professional fees, technology costs and fair value adjustments related to contingent consideration assets and liabilities.\n◦\nAmortization of intangible assets.\n◦\nImpairment of intangible assets and goodwill, if any.\n◦\nInterest expense for amortization of debt premium from acquisition-date fair value adjustment.\n•\nSpecial termination benefits and other expenses related to workforce optimization initiatives related to past acquisitions and certain initiatives undertaken by the Company.\n•\nNet gains or losses on investments related to deferred compensation plans which are not offset by compensation and benefits expense.\n•\nNet compensation and benefits expense related to minority interests in certain subsidiaries not offset by net income (loss) attributable to redeemable noncontrolling interests.\n•\nUnrealized investment gains and losses.\n•\nNet income tax expense of the above adjustments based on the respective blended rates applicable to the adjustments.\nWe define adjusted diluted earnings per share as diluted earnings per share adjusted to exclude the per share impacts of the adjustments applied to net income in calculating adjusted net income.\nIn calculating our non-GAAP measures, we adjust for the impact of CIPs because it is not considered reflective of our underlying results of operations. Acquisition-related items and special termination benefits are excluded to facilitate comparability to other asset management firms. We adjust for compensation and benefits expense related to funded deferred compensation plans because it is partially offset in other income (expense), net. We adjust for compensation and benefits expense and net income (loss) attributable to redeemable noncontrolling interests to reflect the economics of certain profits interest arrangements. Sales and distribution fees and a portion of investment management fees generally cover sales, distribution and marketing expenses and, therefore, are excluded from adjusted operating revenues. In addition, when calculating adjusted net income and adjusted diluted earnings per share we exclude unrealized investment gains and losses included in investment and other income (losses) because the related investments are generally expected to be held long term.\n34\nTable of Contents\nThe calculations of adjusted operating income, adjusted operating margin, adjusted net income and adjusted diluted earnings per share are as follows:\n(in millions)\nThree Months Ended \nJune 30,\nNine Months Ended \nJune 30,\n2025\n2024\n2025\n2024\nOperating income\n$\n154.1\n \n$\n222.5\n$\n518.7\n$\n558.3\nAdd (subtract):\nElimination of operating revenues upon consolidation of investment products*\n12.0\n12.3\n37.6\n34.7\nAcquisition-related retention\n47.9\n43.7\n128.4\n217.3\nCompensation and benefits expense from gains on deferred compensation, net\n0.1\n1.8\n4.6\n34.8\nOther acquisition-related expenses\n10.5\n33.6\n30.6\n65.6\nAmortization of intangible assets\n112.2\n84.0\n337.3\n254.4\nImpairment of intangible assets\n—\n—\n24.4\n—\nSpecial termination benefits\n26.9\n16.7\n44.7\n63.8\nCompensation and benefits expense related to minority interests in certain subsidiaries\n14.1\n10.3 \n41.5\n32.6\nAdjusted operating income\n$\n377.8\n$\n424.9\n$\n1,167.8\n$\n1,261.5\nTotal operating revenues\n$\n2,064.0\n$\n2,122.9\n$\n6,427.0\n$\n6,266.8\nAdd (subtract):\nAcquisition-related pass through performance fees\n(2.1)\n—\n(87.4)\n(87.0)\nSales and distribution fees\n(351.9)\n(358.3)\n(1,092.3)\n(1,013.2)\nAllocation of investment management fees for sales, distribution and marketing expenses\n(128.8)\n(122.8)\n(398.8)\n(353.0)\nElimination of operating revenues upon consolidation of investment products*\n12.0\n12.3\n37.6\n34.7\nAdjusted operating revenues\n$\n1,593.2\n$\n1,654.1\n$\n4,886.1\n$\n4,848.3\nOperating margin\n7.5%\n10.5%\n8.1%\n8.9%\nAdjusted operating margin\n23.7%\n25.7%\n23.9%\n26.0%\n35\nTable of Contents\n(in millions, except per share data)\nThree Months Ended \nJune 30,\nNine Months Ended \nJune 30,\n2025\n2024\n2025\n2024\nNet income attributable to Franklin Resources, Inc.\n$\n92.3\n \n$\n174.0\n \n$\n407.3\n \n$\n549.5\n \nAdd (subtract):\nNet (income) loss of consolidated investment products*\n3.9 \n(2.4)\n(0.2)\n(1.1)\nAcquisition-related retention\n47.9 \n43.7 \n128.4 \n217.3 \nOther acquisition-related expenses\n13.0 \n34.9 \n38.8 \n75.0 \nAmortization of intangible assets\n112.2 \n84.0 \n337.3 \n254.4 \nImpairment of intangible assets\n— \n— \n24.4 \n— \nSpecial termination benefits\n26.9 \n16.7 \n44.7 \n63.8 \nNet gains on deferred compensation plan investments not offset by compensation and benefits expense\n(2.6)\n(1.1)\n(2.4)\n(11.0)\nUnrealized investment (gains) losses\n11.2 \n31.0 \n(0.2)\n(27.6)\nInterest expense for amortization of debt premium\n(5.0)\n(6.4)\n(14.9)\n(19.2)\nNet compensation and benefits expense related to minority interests in certain subsidiaries not offset by net income attributable to redeemable noncontrolling interests\n7.4 \n2.8 \n18.9 \n1.2 \nNet income tax expense of adjustments\n(43.8)\n(50.8)\n(143.8)\n(140.8)\nAdjusted net income\n$\n263.4\n \n$\n326.4\n \n$\n838.3\n \n$\n961.5\n \nDiluted earnings per share\n$\n0.15\n \n$\n0.32\n \n$\n0.70\n \n$\n1.03\n \nAdjusted diluted earnings per share\n0.49\n \n0.60\n \n1.55\n \n1.81\n \n__________________\n*\nThe impact of CIPs is summarized as follows:\n(in millions)\nThree Months Ended \nJune 30,\nNine Months Ended \nJune 30,\n2025\n2024\n2025\n2024\nElimination of operating revenues upon consolidation\n$\n(12.0)\n$\n(12.3)\n$\n(37.6)\n$\n(34.7)\nOther income (expense), net\n19.9 \n42.0 \n(48.4)\n72.0 \nLess: income (loss) attributable to noncontrolling interests\n11.8 \n27.3 \n(86.2)\n36.2 \nNet income (loss)\n$\n(3.9)\n$\n2.4\n \n$\n0.2\n \n$\n1.1\n \nLIQUIDITY AND CAPITAL RESOURCES\nCash flows were as follows:\n \nNine Months Ended \nJune 30,\n(in millions)\n2025\n2024\nOperating cash flows\n$\n1,086.8 \n$\n413.1 \nInvesting cash flows\n(1,901.3)\n(1,222.7)\nFinancing cash flows\n363.9 \n506.4 \nNet cash provided by operating activities increased during the nine months ended June 30, 2025 primarily due to higher net income adjusted for non-cash items and an increase in accounts payable and accrued expenses, partially offset by higher payments for incentive compensation and income tax payments. Net cash used in investing activities increased primarily due to net purchases of investments as compared to liquidations in the prior year and higher net purchases of investments by collateralized loan obligations (“CLOs”). Net cash provided by financing activities decreased due to lower net proceeds on debt of CIPs and net repayment of debt, partially offset by net proceeds from repurchase agreements.\n36\nTable of Contents\nThe assets and liabilities of CIPs attributable to third-party investors do not impact our liquidity and capital resources. We have no right to the CIPs’ assets, other than our direct equity investment in them and investment management and other fees earned from them. The debt holders of the CIPs have no recourse to our assets beyond the level of our direct investment, therefore we bear no other risks associated with the CIPs’ liabilities. Accordingly, the assets and liabilities of CIPs, other than our direct investments in them, are excluded from the amounts and discussion below.\nOur liquid assets and debt consisted of the following:\n \n(in millions)\nJune 30,\n2025\nSeptember 30,\n2024\nAssets\nCash and cash equivalents\n$\n3,213.4 \n$\n3,261.1 \nReceivables\n1,215.3 \n1,261.6 \nInvestments\n1,216.1 \n1,141.7 \nTotal Liquid Assets\n$\n5,644.8\n \n$\n5,664.4\n \nLiability\nDebt\n$\n2,666.7 \n$\n2,780.3 \nLiquidity\nLiquid assets consist of cash and cash equivalents, receivables and certain investments. Cash and cash equivalents at June 30, 2025 primarily consist of money market funds and deposits with financial institutions. Liquid investments consist of investments in sponsored and other funds, direct investments in redeemable CIPs, other equity and debt securities, and time deposits with maturities greater than three months.\nWe utilize a significant portion of our liquid assets to satisfy operational and regulatory requirements and fund capital contributions to sponsored and other products. Certain of our subsidiaries are required by our internal policy or regulation to maintain minimum levels of cash and/or capital, and may be restricted in their ability to transfer cash to their parent companies. Should we require more capital than is available for use, we could elect to reduce the level of discretionary activities, such as share repurchases or investments in sponsored and other products, we could raise capital through debt or equity issuances, or utilize existing or new credit facilities. These alternatives could result in increased interest expense, decreased dividend or interest income, or other dilution to our earnings.\nCapital Resources\nWe believe that we can meet our present and reasonably foreseeable operating cash needs and future commitments through existing liquid assets, continuing cash flows from operations, amounts available under the credit facility discussed below, the ability to issue debt or equity securities and borrowing capacity under our uncommitted commercial paper private placement program.\nIn prior fiscal years, we issued senior unsecured unsubordinated notes for general corporate purposes and to redeem outstanding notes. At June 30, 2025, Franklin’s outstanding senior notes had an aggregate principal amount due of $1,200.0 million. The notes have fixed interest rates from 1.600% to 2.950% with interest paid semi-annually and have an aggregate carrying value, inclusive of unamortized discounts and debt issuance costs, of $1,488.2 million. At June 30, 2025, Legg Mason’s outstanding senior notes had an aggregate principal amount due of $1,000.0 million. The notes have fixed interest rates from 4.750% to 5.625% with interest paid semi-annually and have an aggregate carrying value, inclusive of unamortized premium, of $1,178.5 million at June 30, 2025. Franklin unconditionally and irrevocably guarantees all of the outstanding notes issued by Legg Mason. The $400.0 million 2.850% senior notes due March 2025 were repaid on March 31, 2025 using existing cash and borrowings from our revolving credit facility.\nThe senior notes contain an optional redemption feature that allows us to redeem each series of notes prior to maturity in whole or in part at any time, at a make-whole redemption price. The indentures governing the senior notes contain limitations on our ability and the ability of our subsidiaries to pledge voting stock or profit participating equity interests in our subsidiaries to secure other debt without similarly securing the notes equally and ratably. In addition, the indentures include requirements that must be met if we consolidate or merge with, or sell all of our assets to, another entity. \n37\nTable of Contents\nOn April 30, 2025, we entered into an Amended and Restated Revolving Credit Agreement (the “Amended and Restated Credit Agreement”) with a five year term and $1.1 billion of aggregate available borrowings. As of April 30, 2025, the $300.0 million of borrowings outstanding under our prior credit facility were transferred to the Amended and Restated Credit Agreement. Interest is payable semi-annually on any outstanding amounts and is based on the Term Secured Overnight Financing Rate (“Term SOFR”) plus a credit spread of 87.5 basis points and a Term SOFR adjustment of 10 basis points. The Amended and Restated Credit Agreement \ncontains a financial performance covenant requiring that the Company maintain a consolidated net leverage ratio, measured as of the last day of each fiscal quarter, of no greater than 3.25 to 1.00.\n \nWe were in compliance with all debt covenants at June 30, 2025. \nAt June 30, 2025, we had $500.0 million of short-term commercial paper available for issuance under an uncommitted private placement program which has been inactive since 2012 and is unrated.\nOur ability to access the capital markets in a timely manner depends on a number of factors, including our credit rating, the condition of the global economy, investors’ willingness to purchase our securities, interest rates, credit spreads and the valuation levels of equity markets. If we are unable to access capital markets in a timely manner, our business could be adversely impacted. \nUses of Capital\nWe expect that our main uses of cash will be to invest in and grow our business including through acquisitions, pay stockholder dividends, invest in our products, pay income taxes and expenses of the business, enhance technology infrastructure and business processes, repurchase shares of our common stock, and repay and service debt. While we expect to continue to repurchase shares to offset dilution from stock-based compensation, and expect to continue to repurchase shares opportunistically from time to time, we will likely spend more of our post-dividend free cash flow investing in our business, including seed capital and acquiring resources to help grow our investment teams and operations. \nWe typically declare cash dividends on a quarterly basis, subject to approval by our Board of Directors. We declared regular dividends of $0.96 per share during the nine months ended June 30, 2025 and $0.93 per share during the nine months ended June 30, 2024. We currently expect to continue paying comparable regular dividends on a quarterly basis to holders of our common stock depending upon earnings and other relevant factors.\nWe maintain a stock repurchase program to manage our equity capital with the objective of maximizing shareholder value. Our stock repurchase program is effected through open-market purchases and private transactions in accordance with applicable laws and regulations, and is not subject to an expiration date. The size and timing of these purchases will depend on business conditions, price, market and other factors, including the terms of any 10b5-1 stock purchase plan that may be in effect at any given time. During the three and nine months ended June 30, 2025, we repurchased 7.3 million and 8.1 million shares of our common stock at a cost of $157.4 million and $173.2 million. During the three and nine months ended June 30, 2024, we repurchased 4.3 million and 7.1 million shares of our common stock at a cost of $101.5 million and $172.0 million. In December 2023, our Board of Directors authorized the repurchase of up to an additional 27.2 million shares of our common stock in either open market or private transactions, for a total of up to 40.0 million shares available for repurchase under the stock repurchase program. At June 30, 2025, 21.9 million shares remained available for repurchase under this authorization.\nOn June 3, 2025, we entered into a definitive agreement to acquire a majority interest in Apera Asset Management for cash consideration of approximately €70.0 million. In addition, we will pay up to €125.0 million in cash through the fifth anniversary of the closing date based on revenue targets.  The cash consideration is expected to be funded from existing cash and sources of liquidity. The acquisition is expected to close during the first quarter of fiscal year 2026.\nWe will pay up to $375.0 million related to our acquisition of Putnam between the third and seventh anniversaries of the closing date related to revenue growth targets from the strategic partnership with Great-West Lifeco, Inc. and its affiliates which will be recognized in operating income.\nThe final deferred cash payment related to our acquisition of Lexington of $100.0 million was paid on April 1, 2025 using existing cash and borrowings from our revolving credit facility.\nThe funds that we manage have their own resources available for purposes of providing liquidity to meet shareholder redemptions, including securities that can be sold or provided to investors as in-kind redemptions, and lines of credit. Increased liquidity risks and redemptions have required, and may continue to require, increased cash in the form of loans or other lines of credit to help settle redemptions and for other related purposes. While we have no legal or contractual obligation to do so, we have in certain instances voluntarily elected to provide the funds with direct or indirect financial support based on our business \n38\nTable of Contents\nobjectives. We did not provide significant financial or other support to our sponsored funds during the nine months ended June 30, 2025.\nCRITICAL ACCOUNTING POLICIES\nOur consolidated financial statements and accompanying notes are prepared in accordance with accounting principles generally accepted in the United States of America, which require the use of estimates, judgments and assumptions that affect the reported amounts of assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the periods presented. These estimates, judgments and assumptions are affected by our application of accounting policies. Further, concerns about the global economic outlook have adversely affected, and may continue to adversely affect, our business, financial condition and results of operations including the estimates and assumptions made by management. Actual results could differ from the estimates. Described below are the updates to our critical accounting policies disclosed in Management’s Discussion and Analysis of Financial Condition and Results of Operations in our Annual Report on Form 10-K for fiscal year 2024. \nConsolidation\nWe consolidate our subsidiaries and investment products in which we have a controlling financial interest. We have a controlling financial interest when we own a majority of the voting interest in a voting interest entity or are the primary beneficiary of a variable interest entity (“VIE”). Our VIEs are primarily investment products and our variable interests consist of our equity ownership interests in and investment management fees earned from these products.\nBusiness Combinations\nBusiness combinations are accounted for by recognizing the acquired assets, including separately identifiable intangible assets, and assumed liabilities at their acquisition-date estimated fair values. Any excess of the purchase consideration over the acquisition-date fair values of these identifiable assets and liabilities is recognized as goodwill. Goodwill and indefinite-lived intangible assets are tested for impairment annually and when an event occurs or circumstances change that more likely than not reduce the fair value of the related reporting unit or indefinite-lived intangible asset below its carrying value. Definite-lived intangible assets are tested for impairment quarterly.\nSubsequent to the annual impairment tests performed as of August 1, 2024, we monitored both macroeconomic and entity-specific factors, including changes in our AUM to determine whether circumstances have changed that would more likely than not reduce the fair value of the reporting unit below its carrying value or indicate that the other indefinite-lived intangible assets might be impaired. We also monitored fluctuations of our common stock per share price to evaluate our market capitalization relative to the reporting unit as a whole. During the nine months ended June 30, 2025, there were no events or circumstances which would indicate that goodwill or definite-lived intangible assets were more likely than not impaired. We performed a quantitative impairment test for certain indefinite-lived assets related to acquired mutual fund investment management contracts due to decreased AUM in related products and recognized an impairment of $24.4 million during the quarter ended March 31, 2025. There were no other impairments of indefinite-lived intangible assets, as no events occurred or circumstances changed that would indicate these assets might be impaired.\nWhile we believe that the assumptions used to estimate fair value in our impairment tests are reasonable and appropriate, future changes in the assumptions could result in recognition of impairment.\nFair Value Measurements\nOur investments are primarily recorded at fair value or amounts that approximate fair value on a recurring basis. We use a three-level fair value hierarchy that prioritizes the inputs to valuation techniques used to measure fair value based on whether the inputs to those valuation techniques are observable or unobservable.\nAs of June 30, 2025, Level 3 assets represented 4% of total assets measured at fair value, which primarily related to CIPs’ investments in equity and debt securities. There were insignificant transfers into and $39.3 million transfers out of Level 3 during the nine months ended June 30, 2025."
}