{
  "source_file": "bfb-20250430.htm",
  "form_type": "10-K",
  "item1": "Item 1. \nBusiness\nOverview\nBrown-Forman Corporation (the “Company,” “Brown-Forman,” “we,” “us,” or “our” below) was incorporated under the laws of the State of Delaware in 1933, successor to a business founded in 1870 as a partnership and later incorporated under the laws of the Commonwealth of Kentucky in 1901. We primarily manufacture, distill, bottle, import, export, market, and sell a wide variety of beverage alcohol products under recognized brands. We employ approximately 5,000 people (excluding individuals who work on a part-time or temporary basis) on six continents, including approximately\n \n2,000 people in the United States (approximately 7% of whom are represented by a union) and\n \n800\n \npeople in Louisville, Kentucky, USA, home of our world headquarters. According to International Wine & Spirit Research (IWSR), we are the largest American-owned spirits and wine company with global reach. We are a “controlled company” under New York Stock Exchange rules because the Brown family owns more than 50% of our voting stock. \nFor a discussion of recent developments, see “Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations – Executive Summary.”\nBrands\nBeginning in 1870 with Old Forester Kentucky Straight Bourbon Whisky – our founding brand – and spanning the generations since, we have built a portfolio of more than 40 spirit, ready-to-drink (RTD) cocktail, and wine brands that includes some of the best-known and most loved trademarks in our industry. The most important and iconic brand in our portfolio is Jack Daniel’s Tennessee Whiskey, the #1 selling American whiskey in the world.\n1\n Within the Jack Daniel’s portfolio, our super-premium offerings, Jack Daniel’s Triple Mash Blended Straight Whiskey and Jack Daniel’s 12 Year Old, received World’s Best Awards from the World Whiskey Awards 2025. Our premium bourbons, Woodford Reserve and Old Forester, were recognized by the San Francisco Spirits Competition in 2025, where Woodford Double Double Oaked won Gold, Old Forester 1920 won Double Gold (the highest honor), and Old Forester 1897 Bottled in Bond won Gold.\n4\nPrincipal Brands\nJack Daniel’s Tennessee Whiskey\n \nel Jimador Tequilas\n4\nJack Daniel’s RTD\n2\nel Jimador New Mix RTD\nJack Daniel’s Tennessee Honey\nHerradura Tequilas\n6\nGentleman Jack Rare Tennessee Whiskey\n \nKorbel California Champagnes\n5\nJack Daniel’s Tennessee Apple\nKorbel California Brandy\n5\nJack Daniel’s Tennessee Fire\nOld Forester Whiskey Row Series\nJack Daniel’s Single Barrel Collection\n3\nOld Forester Kentucky Straight Bourbon Whisky\nJack Daniel’s Sinatra Select\nOld Forester Single Barrel Straight Bourbon Whisky\nJack Daniel’s Bonded Tennessee Whiskey\nDiplomático Rums\n6\nJack Daniel’s Winter Jack\nChambord Liqueur\nJack Daniel’s Bonded Tennessee Rye\nGin Mare\n6\nJack Daniel’s Triple Mash Blended Straight Whiskey\nThe Glendronach Single Malt Scotch Whiskies\n6\nJack Daniel’s American Single Malt\nBenriach Single Malt Scotch Whiskies\n6\nJack Daniel’s 12 Year Old\nGlenglassaugh Single Malt Scotch Whiskies\n6\nWoodford Reserve Kentucky Bourbon\nFords Gin\nWoodford Reserve Double Oaked\nSlane Irish Whiskey\nWoodford Reserve Kentucky Rye Whiskey\nWoodford Reserve Double Double Oaked\nWoodford Reserve Batch Proof\n1\nIWSR 2024 Data.\n2\nJack Daniel’s RTD includes Jack Daniel’s & Coca-Cola RTD, Jack Daniel’s & Cola, Jack Daniel’s Double Jack, Jack Daniel’s Country Cocktails, and other malt- and spirit-based Jack Daniel’s RTDs.\n3\nThe Jack Daniel’s Single Barrel Collection includes Jack Daniel’s Single Barrel Select, Jack Daniel’s Single Barrel Barrel Proof, Jack Daniel’s Single Barrel - Barrel Proof Rye, and other Jack Daniel’s Single Barrel special-release expressions.\n4\nel Jimador Tequilas comprise all full-strength expressions of el Jimador.\n5\nKorbel is not an owned brand and we sell Korbel products under contract in the United States and other select markets. On May 9, 2025, the Company announced the end of the sales, marketing, and distribution relationship, effective June 30, 2025.\n6\nComprises all expressions of this brand.\nSee “Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations – Results of Operations – Fiscal 2025 Brand Highlights” for brand performance details.\nOur vision in marketing is to be the best brand-builder in the industry. We build our brands by investing in platforms that we believe create enduring connections with our consumers. These platforms cover a wide spectrum of activities, including media advertising (TV, radio, print, outdoor, digital, and social), consumer and trade promotions, sponsorships, and visitors’ center programs at our distilleries. We aim to grow our sales and profits by consistently delivering creative, responsible marketing programs that drive brand recognition, brand trial, brand loyalty, and, ultimately, consumer demand around the world.\n5\nMarkets\nWe sell our products in over 170 countries. The United States, our most important market, accounted for 44% of our net sales in fiscal 2025, and the other 56% were outside of the United States. The table below shows the percentage of total reported net sales for our top markets in our three most recent fiscal years:\nPercentage of Total Reported Net Sales by Geographic Area\nYear ended April 30\n2023\n2024\n2025\nUnited States\n47\n \n%\n45\n \n%\n44\n \n%\nMexico\n6\n \n%\n7\n \n%\n7\n \n%\nGermany\n6\n \n%\n6\n \n%\n6\n \n%\nAustralia\n5\n \n%\n5\n \n%\n5\n \n%\nUnited Kingdom\n5\n \n%\n4\n \n%\n4\n \n%\nOther\n31\n \n%\n32\n \n%\n33\n \n%\nTOTAL\n100\n \n%\n100\n \n%\n100\n \n%\nNote: Totals may differ due to rounding\nFor details about net sales in our top markets, see “Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations – Results of Operations – Fiscal 2025 Market Highlights.” For details about our reportable segment and for additional geographic information about net sales and long-lived assets, see Note 20 to the Consolidated Financial Statements in “Item 8. Financial Statements and Supplementary Data.” For details on risks related to our global operations, see “Item 1A. Risk Factors.”\nDistribution Network and Customers\nOur distribution network, or our “route to consumer” (RTC), varies depending on (a) the laws and regulatory framework for trade in beverage alcohol by market, (b) our assessment of a market’s long-term attractiveness and competitive dynamics, (c) the relative profitability of distribution options available to us, (d) the structure of the retail and wholesale trade in a market, and (e) our portfolio’s development stage in a market. As these factors change, we evaluate our RTC strategy and, from time to time, adapt our model.\nIn the United States, which generally prohibits spirits and wine manufacturers from selling their products directly to consumers, we sell our products either to distributors or to state governments (in states that directly control alcohol sales) that then sell to retail customers and consumers.\nOutside the United States, we use a variety of RTC models, which can be grouped into three categories: owned distribution, partner, and government-controlled markets. We own and operate distribution companies for Australia, Belgium and Luxembourg, Brazil, Czechia, France, Germany, Japan, Mexico, Poland, Slovakia, South Korea, Spain, Taiwan, Thailand, Türkiye, and the United Kingdom. Effective May 1, 2025, we launched our own distribution company in Italy. In these owned-distribution markets, and in a large portion of the Travel Retail channel, we sell our products directly to retailers or wholesalers. In many other markets, we rely on third parties to distribute our brands, generally under fixed-term distribution contracts. In Canada, we sell our products to provincial governments.\nWe believe that our customer relationships are good and that our exposure to concentrations of credit risk is limited due to the diverse geographic areas covered by our operations and our thorough evaluation of each customer. In fiscal 2025, our two largest customers accounted for approximately 13% and 11% of consolidated net sales, respectively. No other customer accounted for 10% or more of our consolidated net sales in fiscal 2025.\nSeasonality\nHoliday buying makes the fourth calendar quarter (generally our third fiscal quarter) the peak season for our business. Approximately 27%, 28%, and 29%\n \nof our reported net sales for fiscal 2023, fiscal 2024, and fiscal 2025, respectively, were in the fourth calendar quarter.\n6\nCompetition\nTrade information indicates that we are one of the largest global suppliers of premium spirits. According to IWSR, for calendar year 2024, the ten largest global spirits companies controlled over 20% of the total spirits volume sold around the world. While we believe that the overall market environment offers considerable growth opportunities for us, our industry is, and will remain, highly competitive. We compete against many global, regional, and local brands in a variety of categories of beverage alcohol, but our brands compete primarily in the industry’s premium-and-above price points. Our competitors include major global spirits companies, such as Bacardi Limited, Becle S.A.B. de C.V., Davide Campari-Milano N.V., Diageo PLC, LVMH Moët Hennessy Louis Vuitton SE, Pernod Ricard SA, Rémy Cointreau, and Suntory Global Spirits. In addition, particularly in the United States, we compete with national companies and craft spirit brands, many of which entered the market in the last few years.\nBrand recognition, brand provenance, quality of product and packaging, availability, flavor profile, and price affect consumers’ choices among competing brands in our industry. Other factors also influence consumers, including advertising, promotions, merchandising at the point of sale, expert or celebrity endorsement, social media and word of mouth, and the timing and relevance of new product introductions. Although some competitors have substantially greater resources than we do, we believe that our competitive position is strong, particularly as it relates to brand awareness, quality, availability, and relevance of new product introductions.\nIngredients and Other Supplies\nThe principal raw materials used in manufacturing and packaging our distilled spirits, liqueurs, and RTD products are shown in the table below. \nPrincipal Raw Materials\nDistilled Spirits\nLiqueurs\nRTD Products\nPackaging\nAgave\nFlavorings\nCarbon dioxide\nAluminum cans\nBarley\nNeutral spirits\nFlavorings\nCartons\nCorn\nSugar\nMalt\nClosures\nMalted barley\nWater\nNeutral spirits\nGlass bottles\nMolasses\nWhiskey\nSugar\nLabels\nRye\nWine\nTequila\nPET\n1 \nbottles\nSugar\nWater\nWater\nWhiskey\nWood\n1\nPolyethylene terephthalate (PET) is a polymer used in non-glass containers.\nNone of these raw materials are currently in short supply, but shortages could occur in the future. From time to time, our agricultural ingredients (agave, barley, corn, malted barley, molasses, rye, sugar, and wood) could be adversely affected by weather and other forces out of our control that might constrain supply or reduce our inventory below desired levels for optimum production.\nWhiskeys, certain tequilas, rums, and some other distilled spirits must be aged. Because we must produce these distilled spirits years in advance to meet projected future demand, our inventories of these products may be larger in relation to sales and total assets than in many other businesses.\nFor details on risks related to the unavailability of raw materials and the inherent uncertainty in forecasting supply and demand, see “Item 1A. Risk Factors.”\nIntellectual Property\nOur intellectual property includes trademarks, copyrights, proprietary packaging and trade dress, proprietary manufacturing technologies, know-how, and patents. Our intellectual property, especially our trademarks, is essential to our business. We register our trademarks broadly around the world, focusing primarily on where we sell or expect to sell our products. We protect our intellectual property rights vigorously but fairly. We have licensed some of our trademarks to third parties for use with services or on products other than alcoholic beverages, which we believe enhances the awareness and protection of our brands. Depending on the jurisdiction, trademarks are valid as long as they are in use and/or their registrations are properly maintained. We also have various licenses and distribution agreements for the production, sale, and marketing of our products, and for the sale and marketing of products of others. These licenses and distribution agreements have varying terms and durations.\n7\nFor details on risks related to the protection of our intellectual property, see “Item 1A. Risk Factors.” For details on our most important brands, see “Item 7. Management's Discussion and Analysis of Financial Condition and Results of Operations – Results of Operations – Fiscal 2025 Brand Highlights.”\nRegulatory Environment\nFederal, state, local, and foreign authorities regulate how we produce, store, transport, distribute, market, and sell our products. Some countries and local jurisdictions prohibit or restrict the marketing or sale of distilled spirits in whole or in part.\nIn the United States, at the federal level, the Alcohol and Tobacco Tax and Trade Bureau of the U.S. Department of the Treasury regulates the spirits and wine industry with respect to the production, blending, bottling, labeling, advertising, sales, and transportation of beverage alcohol. Similar regulatory regimes exist at the state level and in most non-U.S. jurisdictions where we sell our products. In addition, beverage alcohol products are subject to customs duties, excise taxes, and/or sales taxes in many countries, including taxation at the federal, state, and local level in the United States.\nMany countries set their own distilling and maturation requirements. For example, under U.S. federal and state regulations, bourbon and Tennessee whiskeys must be aged in new, charred oak barrels; we typically age our whiskeys at least three years. Mexican authorities regulate the production and bottling of tequilas; they mandate minimum aging periods for \nextra\n \nañejo\n (three years), \nañejo\n (one year), and \nreposado\n (two months). Irish whiskey must be matured at least three years in a wood cask, such as oak, on the island of Ireland. Scotch whisky must be matured in oak casks for at least three years in Scotland. We comply with all of the applicable laws and regulations.\nOur operations are also subject to various environmental protection statutes and regulations, and our policy is to comply with them. Complying with these statutes and regulations has not materially impacted our capital expenditures, earnings, or competitive position, and is not expected to have a material impact during fiscal 2026.\n8\nIntegrated Strategy and Performance\nFor more than 150 years, Brown-Forman and the Brown family have been committed to driving sustainable growth and preserving Brown-Forman as a thriving, family-controlled, independent company. The image on the left illustrates our highest ambition, “Nothing Better in the Market,” surrounded by the values that have guided us for decades: integrity, respect, trust, teamwork, and excellence. In addition to these guiding principles, our success depends on several strategic priorities, as illustrated in the image on the right: the quality of our brands within our portfolio, our geographic reach, the talent and diversity of our people, and the return on our investments. Moreover, taking an integrated approach means that many aspects of our company contribute to this value creation and are fundamental to our strategy, including our spirit of commitment to environmental sustainability, alcohol and marketing responsibility, culture and inclusion, and to building communities in which we live and work.\nOver the past five fiscal years, we faced a challenging, volatile environment, including supply chain disruptions and a global pandemic. Our employees’ unique mix of agility, resilience, energy, and collaboration enabled us to succeed despite these challenges. Our values drive our decisions, and our core purpose and our highest ambition continue to guide us as we move forward to a reimagined future with renewed enthusiasm for the opportunities that lie ahead. We believe we are well positioned to navigate the ever-changing landscape. We will make bold moves with a commitment to improve continuously as we work together to deliver sustained long-term growth.\nThis Integrated Annual Report on Form 10-K for the fiscal year ended April 30, 2025, presents not only our financial performance but also our environmental, social, and governance strategies, commitments, and results. It provides a more holistic view of Brown-Forman, our culture, our strategic approach to our business, and how we achieve results.\nPortfolio and Responsibility\nWe seek to build brands and create stockholder value responsibly by delivering strong, sustainable growth, solid margins, and high returns on invested capital. We focus on building brands that can be meaningful for our company and our legal drinking age consumers (consumers) over the longer term. We aim to grow our premium spirits portfolio both organically and through innovation. Opportunistically and thoughtfully, we also consider acquisitions and partnerships that will enhance our capacity to deliver meaningful growth, improve margins, and increase stockholder returns.\nWe strive to grow our brands and enhance consumers’ experience with them. Even as we do so, we remain committed to marketing our brands responsibly and promoting responsible drinking. Regulation of our industry is not new, and external interest from the World Health Organization and other health bodies has grown over time. We uphold high standards of self-regulation by adhering to industry guidelines on responsible marketing and advertising. We promote alcohol responsibility both independently and with industry organizations, such as the International Alliance for Responsible Drinking, the Foundation for Advancing Alcohol Responsibility (responsibility.org) in the United States, the Portman Group in the United Kingdom, DrinkWise in Australia, and FISAC in Mexico.\n9\nThe Jack Daniel’s family of brands, led by Jack Daniel’s Tennessee Whiskey (JDTW), is our most valuable asset – the engine of our overall financial performance and the foundation of our leadership position in the American whiskey category.\n1\n We strive to strengthen the brand’s leadership position continually, and will work steadfastly to keep JDTW relevant to consumers worldwide. We will also pursue opportunities to grow the Jack Daniel’s family of brands across markets, premium-and-above price points, channels, and consumer groups. Product innovation continues to contribute meaningfully to our performance. Different Jack Daniel’s expressions have brought new consumers to the franchise, including Jack Daniel’s Tennessee Honey (2011), Jack Daniel’s Tennessee Fire (2015), Jack Daniel’s Tennessee Apple (2019), Jack Daniel’s 10 Year Old (2021), Jack Daniel’s Bonded Tennessee Whiskey and Triple Mash Blended Straight Whiskey (2022), Jack Daniel’s Bonded Rye - Tennessee Rye Whiskey, Jack Daniel’s American Single Malt, and Jack Daniel’s 12 Year Old (2023), Jack Daniel’s Single Barrel - Barrel Proof Rye (2024), and our most recent launch, Jack Daniel’s 14 Year Old (2025), which individually and collectively add great value to the company and to our consumers the world over.\nIn addition to the leadership of our Jack Daniel’s family of brands, we expect strong worldwide growth from our other whiskey brands, particularly Woodford Reserve and Old Forester. Woodford Reserve is the leading super-premium American whiskey globally,\n1\n growing volumes at a strong double-digit compound annual growth rate since the brand was introduced over 25 years ago. Woodford Reserve sold over 1.8 million nine-liter cases for the fiscal year ended April 30, 2025. We believe the brand is poised for continued growth as the bourbon category continues to grow around the world. Old Forester has continued its return to prominence in the United States and in select international markets. Innovation has played an important role in the premiumization of both of these brands, including the success of high-end expressions such as Woodford Reserve Double Oaked, Woodford Reserve Double Double Oaked, and the Old Forester Whiskey Row Series.\nOutside of our American whiskey brands, we believe our portfolio remains well positioned in other high-growth categories, with meaningful premium brands and a focus on accelerating our super-premium portfolio. Our tequila portfolio is led by two brands steeped in Mexican heritage, Herradura and el Jimador. We remain committed to the growth of our tequila business in the United States and the long-term growth prospects of this business globally. We believe that our Scotch whiskies The Glendronach, Benriach, and Glenglassaugh, and our Irish whiskey, Slane, are well positioned in their respective categories. We expect them all to contribute meaningfully over the longer term. In addition, the acquisitions of Gin Mare (2022) and Diplomático (2023) provide us with leadership positions in the super-premium-and-above gin and rum categories, respectively, and we look to grow these brands globally.\nOur RTD portfolio continues to evolve globally. In June 2022, we jointly announced a global relationship with The Coca-Cola Company to introduce the iconic Jack & Coke cocktail as a branded, ready-to-drink, pre-mixed cocktail. Since the announcement, we have launched the product in over 25 markets, including top RTD markets such as the United States, Japan, the United Kingdom, Mexico, and Germany. Starting in 2021, Jack Daniel’s Country Cocktails in the United States are produced, sold, and distributed under our relationship with the Pabst Brewing Company.\nWe appreciate the power of our brands to enrich the experience of life, and we believe it is our duty to ensure that our products are marketed with deep respect for our consumers. Our mission for alcohol responsibility is to empower mindful choices around beverage alcohol. We launched the Pause campaign in 2019. Pause is Brown-Forman’s driving effort to encourage mindful choices. In 2022, we launched our 2030 Alcohol Responsibility strategy to prioritize strategic programs and partnerships, in-market tools and resources, and to continue empowering our employees and business partners. We execute our 2030 Alcohol Responsibility strategy through the lens of our Pause campaign to showcase the importance of alcohol responsibility and inspire action among our consumers, colleagues, and business partners.\nGeography\nThe United States remains our largest market, and growth there is important to our long-term success. We expect to foster this growth by emphasizing fast-growing spirits categories, continuing product and packaging innovation, and building brands within growing consumer segments. This includes increasing emphasis on inclusive, digital, and integrated marketing and the growth of our e-commerce capabilities to better connect and engage with consumers where they are.\nOutside the United States, our improved routes to consumers continue to increase our competitiveness. Owned distribution enables us to have a more direct connection with customers and consumers, and is an important part of our strategic growth. In May 2025, we established our owned-distribution organization in Italy. \n1\nIWSR 2024 Data\n10\nPeople, Culture, Ethics, and Compliance\nAs we work to increase our brands’ relevance and appeal to diverse consumer groups around the world, we believe a diversity of experiences, perspectives, and mindsets within our own workforce is essential. Our strategy is to embed inclusion into everything we do. We prioritize initiatives that help us build a workforce that reflects our global consumers, create a culture of inclusion, retain and expand our consumer base, and be a good neighbor in our communities. We believe this will make us a better employer, help us build iconic brands, and make us a more sustainable business.\nOne of the main drivers of our inclusive culture is the continued growth and leadership of our ten Employee Resources Groups (ERGs), which are open to all employees. We believe ERGs are instrumental in enriching our company’s culture and our employees’ experience by supporting development and engagement of our diverse workforce; driving cultural awareness and competency across the organization; enabling authentic engagement with our consumers; and creating spaces for our employees and their allies to connect with, support, and advocate for one another.\nOur core values of integrity, respect, trust, teamwork, and excellence form the foundation of our ethics and compliance program. “Values Drive Decisions” is the key theme of this program, and we use it to teach our employees to rely on our values when faced with a difficult decision and to “speak up” if they believe they, a colleague, or a business partner may have violated the law, our Code of Conduct, or company policy. In countries where we operate, we offer a third-party service to employees and others who choose to “speak up” anonymously. As we train our managers, we reinforce our commitment to non-retaliation and maintaining a “speak up” culture.\nWe convey our compliance expectations to employees via our Code of Conduct, and our employees certify annually that they will comply with it and report potential violations. The Code of Conduct details our expectations with respect to different risks scenarios; provides links to Q&As, policies, and training; and gives contact details for subject-matter experts. We refresh our Code of Conduct and certification annually and make it available in 13 languages.\nInvestment and Sustainability\nFor over a century and a half, we have learned that long-term success requires investment and a mindset of sustainability. We understand the need to invest in our brands, global supply chain facilities, homeplace and visitor centers, and aging inventory. We also understand the importance of investing in our people, communities, and the environment. We recognize that climate change is a business issue with risks and opportunities. As such, we are committed to actions that will ensure the long-term health of the planet and our business. In fiscal 2025, we revised our 2030 Sustainability Strategy to account for our current organization and to align our efforts with industry best practices and the most current climate science. Our goals broaden our focus beyond business operations to include our supply chain, where the majority of our environmental footprint resides. With this evolving strategy, we have a roadmap for continued progress over the next quarter-century.\n11\nOur continued investments in renewable energy and resource stewardship underscore our long-term focus:\n•\nRenewable Electricity: \nIn fiscal 2024, we installed a rooftop solar system at our Newbridge bottling plant in Edinburgh, Scotland, in partnership with YLEM Energy.\n•\nByproducts to Energy: \nIn fiscal 2025, construction continued on the anaerobic digester project at the Jack Daniel Distillery that will convert a portion of the distillery byproducts to renewable energy and fertilizer. The project is expected to become operational in fiscal 2026.\n•\nWater Stewardship: \nIn fiscal 2025, we continued our work with Waterplan to improve the measurement of water- related risk at our production facilities and to identify opportunities for water efficiency improvements and water reuse at our Casa Herradura facility. We will expand this collaboration in fiscal 2026 to begin measuring water risk in our supply chain and further enhance our water stewardship program.\n•\nSustainable Agriculture:\n In fiscal 2024, our Woodford Reserve Distillery announced a five-year commitment to purchase the rye grown by Kentucky farmers as part of the Rye in Kentucky research being led by the University of Kentucky. In fiscal 2024, we met our target to engage with 100% of our direct farmers on regenerative agriculture practices and continued engaging with direct farmers in fiscal 2025.\n•\nSustainable Forestry: \nIn fiscal 2024, the Jack Daniel Seed Orchard and our continued relationship with the University of Tennessee celebrated its 25th anniversary. In addition, the Tennessee Forestry Association, supported by Jack Daniel’s, announced that it received a grant from the National Fish and Wildlife Federation to engage with family forest landowners on sustainable management practices to improve Tennessee’s shortleaf pine and white oak forests.\nCommunity\nWe strive to be a responsible and caring corporate citizen and invest in the communities where employees live and work. We encourage employees to participate in philanthropic outreach efforts through company-led volunteer projects and nonprofit board service. This employee engagement, as well as our philanthropic contributions, further promote Brown-Forman’s caring culture and commitment to community.\nWe continue to expand our community engagement in Brown-Forman global office locations, allowing those employees closest to the needs of their communities to decide how to invest their volunteer time and charitable-giving resources. We leverage our key community relations partners to stay informed of collaborative opportunities where we work and live and to shape our charitable-giving strategy to meet the essential needs of the communities that sustain us. We created the Brown-Forman Foundation (the Foundation) in fiscal 2018 to help fund our ongoing philanthropic endeavors, with an emphasis on the communities surrounding Brown-Forman’s headquarters in Louisville, KY. The Foundation’s resources provide a consistent source of support for charitable giving independent of our annual earnings. We work to partner with organizations that support our key focus areas: amplify arts and culture, invest in lifelong learning, and cultivate community. As part of our commitment to be better and do better as neighbors, the Foundation made a 10-year, $50 million commitment to five organizations in west Louisville in fiscal 2022, which is the largest investment in its history. Our partner organizations include AMPED, the \n12\nLouisville Central Community Center, the Louisville Urban League, Simmons College of Kentucky, and the West End School. Together, these organizations will advance educational opportunities from early childhood through adult learning.\nIn summary, we believe that having a long-term-focused, committed, and engaged stockholder base, anchored by the Brown family, gives us a distinct strategic advantage, particularly in a business with multi-generational brands and products that must be aged. We are committed to continually improving our environmental, social, and governance performance and acting upon our deeply held values. Recognizing the strong cash-generating capacity and the capital efficiency of our business, we will continue to pursue top-tier stockholder return through stockholder-friendly capital allocation and socially and environmentally conscious investments to fuel long-term growth.\nHuman Capital Resources\nOverview\n \nWe put our values at the forefront of all our decisions and actions in an effort to make our employees feel respected, safe, and supported so they can make, market, and sell our products with the finest craftsmanship, quality, and care. What enables our success are the approximately 5,000 people (excluding individuals that work on a part-time or temporary basis) we employ in over 45 countries around the world. This includes approximately 3,300 salaried employees and 1,700 hourly employees, with the largest percentage of our employees residing within the United States, Mexico, and the United Kingdom. We believe our employee engagement is high, tenure is above average, and our voluntary turnover rate is low.\nTotal Rewards\nWe pay our employees fairly and competitively. Each fiscal year, we review the compensation for all salaried roles both internally and externally, ensuring every employee is paid fairly compared to the work they do and competitively against the external market. All roles are priced based on external compensation survey data for the market where the employee resides. We refresh our external data annually and monitor pay equity at least annually or when positions become open in a given market.\nTalent Development\nWe continually seek opportunities to develop our employees to ensure we have the capabilities to grow our business. We do this through a combination of succession planning, planned learning, short-term assignments, international opportunities, and thoughtful talent management. Given our low voluntary turnover, we are intentional about moving employees through new roles, ensuring that they have the opportunity to learn new skills. We track all internal movement and believe that we are providing an appropriate level of growth and development for our employees.\nCulture & Inclusion \nWe believe an inclusive organization can attract stronger talent, generate more innovative thinking, and build brands that resonate with a broad spectrum of consumers, ultimately leading to enhanced business performance.\nIn fiscal 2025, we evolved our inclusion strategy while reinforcing our commitment to creating an inclusive culture and ensuring our workforce mirrors our global, dynamic consumer base. To achieve these commitments, we focus our inclusion efforts on four strategic pillars: our colleagues, our culture, our consumers, and our community.\n Workforce Stability\nWe continue to experience low voluntary turnover among our salaried population. We analyze our quantitative and qualitative attrition data regularly, and our voluntary turnover among salaried employees remains consistent with our historical levels. We will continue to monitor our data carefully to ensure that we identify trends related to attraction, retention, and engagement of our workforce globally. \n13\nExecutive Officers\nInformation about Our Executive Officers\nThe following persons served as executive officers as of June 13, 2025:\nName\nAge\nPrincipal Occupation and Business Experience\nLawson E. Whiting\n56\nPresident and Chief Executive Officer since January 2019. Executive Vice President and Chief Operating Officer from October 2017 to December 2018. Executive Vice President and Chief Brands and Strategy Officer from February 2015 to September 2017. Senior Vice President and Chief Brands Officer from January 2013 to January 2015.\nMichael E. Carr, Jr.\n45\nExecutive Vice President, General Counsel and Secretary since May 2024. Vice President, Associate General Counsel - Regional and Corporate Development from October 2022 to April 2024. Vice President, Associate General Counsel - Europe from May 2018 to October 2022. Vice President, Managing Attorney and Assistant Corporate Secretary from September 2013 to May 2018.\nLeanne D. Cunningham\n55\nExecutive Vice President and Chief Financial Officer since March 2023. Senior Vice President and Chief Financial Officer from July 2021 to March 2023. Senior Vice President, Shareholder Relations Officer, Global Commercial Finance, and Financial Planning and Analysis from August 2020 to July 2021. Senior Vice President, Shareholder Relations Officer from August 2019 to July 2020. Senior Vice President, and General Manager - Brown-Forman Brands from May 2015 to July 2019. Vice President, Director of Finance Global Production from October 2013 to April 2015.\nMarshall B. Farrer\n54\nExecutive Vice President, Chief Strategic Growth Officer since March 2024. Executive Vice President, Chief Strategic Growth Officer and President Europe from January 2023 to March 2024. Senior Vice President, President Europe from August 2020 to January 2023. Senior Vice President, Managing Director, Global Travel Retail and Developed APAC Region from August 2018 to July 2020. Senior Vice President, Managing Director, Global Travel Retail from May 2015 to July 2018. Vice President, Managing Director, Jack Daniel’s Tennessee Honey from January 2014 to April 2015.\nChristina M. Graven\n54\nExecutive Vice President, Chief Strategy Office since January 2025. Senior Vice President Director, PSA/Total Rewards/Workplaces from October 2024 to January 2025. Senior Vice President Director People Strategy Analytics and Rewards from May 2023 to October 2024. Vice President Director People Strategy Analytics and Rewards from February 2022 to May 2023. Vice President Director Global Talent Management from May 2019 to February 2022. Vice President Director Global Talent Acquisition and People Development from August 2018 to May 2019. Vice President, Director, People Strategy, Acquisition, and Analytics from July 2016 to August 2018. Vice President, Director People Planning & Analytics from May 2015 to July 2016. Vice President Director Corporate Analytics from May 2012 to May 2015. \nMichael A. Masick\n46\nExecutive Vice President, Americas since January 2025. Executive Vice President, Emerging International from July 2024 to January 2025. Vice President Managing Director, LAR/Africa/Ukraine/CIS/Russia from August 2022 to July 2024. Vice President General Manager, Latin America from August 2020 to August 2022. Vice President Finance Director, Developed Europe and International Strategy from August 2018 to August 2020. Vice President, Director Corporate Strategy and Business Development from February 2015 to August 2018. Vice President, Director Global Business Strategy and Analysis for Jack Daniel’s from January 2013 to February 2015.\nTimothy M. Nall\n54\nExecutive Vice President, Chief Global Supply Chain and Technology Officer since March 2023. Senior Vice President, Chief Global Supply Chain and Technology Officer from March 2022 to March 2023. Senior Vice President, Chief Information and Advanced Analytics Officer from January 2015 to February 2022. Vice President Director Technical Services from May 2013 to December 2014.\nDiane F. Nguyen\n54\nExecutive Vice President Chief People Places and Communications Officer since August 2024. Vice President Human Resources Director - Global Commercial/Corporate Teams from February 2022 to August 2024. Vice President Human Resources Director, Global Commercial Organization from August 2020 to February 2022. Vice President Human Resources Director, Regions from August 2018 to August 2020. Vice President HR Director, North America Region from August 2017 to August 2018. Vice President HR Director, Global Production from January 2013 to August 2017.\nYiannis Pafilis\n54\nExecutive Vice President, Europe/Africa/APAC since January 2025. Executive Vice President and President, Europe from March 2024 to January 2025. Senior Vice President, Managing Director of Germany, Czechia, Poland and Europe Commercial Strategy from September 2023 to February 2024. Vice President, Managing Director of Germany, Czechia, Poland and Europe Strategy from October 2022 to August 2023. Vice President, Managing Director of Germany, Czechia and Europe Commercial Strategy from August 2020 to September 2022. Vice President, General Manager of Germany and Czechia from September 2017 to July 2020. General Manager of Russia from July 2014 to August 2017.\n14\nName\nAge\nPrincipal Occupation and Business Experience\nCrystal L. Peterson\n54\nExecutive Vice President, Chief Inclusion and Global Community Relations Officer since March 2023. Senior Vice President, Chief Inclusion and Global Community Relations Officer from June 2022 to March 2023. Vice President and Chief Diversity Officer from February 2022 to June 2022. Vice President and Human Resources Director - Global Production, Diversity and Inclusion from March 2021 to January 2022. Vice President and Human Resources Director - Global Production from August 2017 to February 2021. Vice President and Human Resources Director - North America Region from May 2015 to July 2017. Human Resources Director - North America Region and Latin America Region from May 2013 to April 2015. \nJeremy J. Shepherd\n50\nExecutive Vice President, Chief Marketing Officer since January 2025. Executive Vice President, President USA & Canada from March 2023 to January 2025. Senior Vice President, President USA & Canada from July 2022 to March 2023. Vice President, General Manager for the United Kingdom & Ireland from January 2018 to July 2022. Vice President Director Midwest Division from May 2015 to December 2017. Portfolio Integration Director from September 2014 to May 2015.\nAvailable Information\nOur website address is www.brown-forman.com. Our annual reports on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K, and any amendments to these reports are available free of charge on our website as soon as reasonably practicable after we electronically file those reports with the Securities and Exchange Commission (SEC). The information provided on our website, and any other website referenced herein, is not part of this report, and is therefore not incorporated by reference into this report or any other filing we make with the SEC, unless that information is otherwise specifically incorporated by reference.\nOn our website, we have posted our Code of Conduct that applies to all our directors and employees, and our Code of Ethics that applies specifically to our senior financial officers. If we amend or waive any of the provisions of our Code of Conduct or our Code of Ethics applicable to our principal executive officer, principal financial officer, or principal accounting officer that relates to any element of the definition of “code of ethics” enumerated in Item 406(b) of Regulation S-K under the Securities Exchange Act of 1934 Act, as amended, we intend to disclose these actions on our website. We have also posted on our website our Corporate Governance Guidelines and the charters of our Audit Committee, Compensation Committee, Corporate Governance and Nominating Committee, and Executive Committee of our Board of Directors. Copies of these materials are available free of charge by writing to our Secretary at 850 Dixie Highway, Louisville, Kentucky 40210 or emailing Secretary@b-f.com.\n15",
  "item7": null,
  "item2": null
}