{
  "source_file": "bfb-20250731.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nYou should read the following discussion and analysis in conjunction with both our unaudited Condensed Consolidated Financial Statements and related notes included in Part I, Item 1 of this Quarterly Report and our Annual Report on Form 10-K for the fiscal year ended April 30, 2025 (2025 Form 10-K). Note that the results of operations for the three months ended July 31, 2025, are not necessarily indicative of future or annual results. In this Item, “we,” “us,” “our,” “Brown-Forman,” and the “Company” refer to Brown-Forman Corporation and its consolidated subsidiaries, collectively.\nPresentation Basis \nNon-GAAP Financial Measures\nWe report our financial results in accordance with U.S. generally accepted accounting principles (GAAP). Additionally, we use some financial measures in this report that are not measures of financial performance under GAAP. These non-GAAP measures, defined below, should be viewed as supplements to (not substitutes for) our results of operations and other measures reported under GAAP. Other companies may define or calculate these non-GAAP measures differently.\n“Organic change” in measures of statements of operations\n.\n \nWe present changes in certain measures, or line items, of the statements of operations that are adjusted to an “organic” basis. We use “organic change” for the following measures: (a) organic net sales; (b) organic cost of sales; (c) organic gross profit; (d) organic advertising expenses; (e) organic selling, general, and administrative (SG&A) expenses; (f) organic other expense (income), net; (g) organic operating expenses\n1\n; and (h) organic operating income. To calculate these measures, we adjust, as applicable, for (1) acquisitions and divestitures, (2) other items, and (3) foreign exchange. We explain these adjustments below.\n•\n“Acquisitions and divestitures.”\n This adjustment removes (a) the gain or loss recognized on sale of divested brands and certain assets, (b) any non-recurring effects related to our acquisitions and divestitures (e.g., transaction, transition, and integration costs), (c) the effects of operating activity related to acquired and divested brands, including certain divested agency brands, for periods not comparable year over year (non-comparable periods), and (d) fair value changes to contingent consideration liabilities. Excluding non-comparable periods allows us to include the effects of acquired and divested brands only to the extent that results are comparable year over year. For the first quarter of fiscal 2026, we had the following acquisitions and divestitures adjustments:\nDuring fiscal 2023, we acquired Gin Mare Brand, S.L.U. and Mareliquid Vantguard, S.L.U., which owned the Gin Mare brand (Gin Mare). This adjustment removes the fair value adjustments to Gin Mare’s contingent consideration liability that is payable in cash no later than July 2027.\nDuring fiscal 2024, we sold our Finlandia vodka and Sonoma-Cutrer wine businesses and entered into related transition services agreements (TSAs) for these businesses. This adjustment removes the net sales, cost of sales, and operating expenses recognized pursuant to the TSAs related to distribution services in certain markets for the non-comparable period, which is activity from the first quarter of fiscal 2025.\nDuring the first quarter of fiscal 2025, we recognized a gain of $12 million on the sale of the Alabama cooperage. This adjustment removes the gain from our other expense (income), net and operating income.\nDuring the first quarter of fiscal 2026, we ended our sales, marketing, and distribution relationship with Korbel Champagne Cellars (Korbel relationship), effective June 30, 2025. This adjustment removes the transaction costs related to ending the relationship and the operating activity for the non-comparable period, which is the month of July of fiscal 2025 and 2026.\n•\n“Other items.” \nOther items include the additional items outlined below.\n“Franchise tax refund.”\n During the first quarter of fiscal 2025, we recognized a $13 million franchise tax refund due to a change in franchise tax calculation methodology for the state of Tennessee. This modification lowered our annual franchise tax obligation and was retroactively applied to franchise taxes paid during fiscal 2020 through fiscal 2023. This adjustment removes the franchise tax refund from our other expense (income), net and operating income.\n“Restructuring initiative.” \nDuring the third quarter of fiscal 2025, our Board of Directors approved a plan to reduce our structural cost base and realign resources toward future sources of growth. This included reducing our workforce by approximately 12% and closing the Louisville-based Brown-Forman Cooperage. We also offered a special, one-time early retirement benefit to qualifying U.S. employees. During the first quarter of fiscal 2026, we incurred $12 million in restructuring and other charges associated with this initiative and completed the sale of the Brown-Forman \n1\nOperating expenses include advertising expense, SG&A expense, restructuring and other charges, and other expense (income), net.\n18\nCooperage facility and related assets. This adjustment removes the restructuring initiative impact from our operating expenses and operating income for the first quarter of fiscal 2026. See Note 6 to the Condensed Consolidated Financial Statements for more information.\n“Substitution drawback claims.” \nDuring the first quarter of fiscal 2026, we recognized a net benefit of $18 million related to the collection of substitution drawback claims filed with the U.S. Government between fiscal 2016 and 2019. As of the first quarter of fiscal 2026, all claims have been collected. This adjustment removes the benefit from our other expense (income), net and operating income. \n•\n“Foreign exchange.”\n We calculate the percentage change in certain line items of the statements of operations in accordance with GAAP and adjust to exclude the cost or benefit of currency fluctuations. Adjusting for foreign exchange allows us to understand our business on a constant-dollar basis, as fluctuations in exchange rates can distort the organic trend both positively and negatively. (In this report, “dollar” means the U.S. dollar unless stated otherwise.) To eliminate the effect of foreign exchange fluctuations when comparing across periods, we translate current-year results at prior-year rates and remove transactional and hedging foreign exchange gains and losses from current- and prior-year periods. \nWe use the non-GAAP measure “organic change,” along with other metrics, to: (a) understand our performance from period to period on a consistent basis; (b) compare our performance to that of our competitors; (c) calculate components of management incentive compensation; (d) plan and forecast; and (e) communicate our financial performance to the Board of Directors, stockholders, and investment community. We provide reconciliations of the “organic change” in certain line items of the statements of operations to their nearest GAAP measures in the tables under “Results of Operations - Fiscal 2026 Year-to-Date Highlights” and “Results of Operations - Year-Over-Year Period Comparisons.” We have consistently applied the adjustments within our reconciliations in arriving at each non-GAAP measure. We believe these non-GAAP measures are useful to readers and investors because they enhance the understanding of our historical financial performance and comparability between periods. When we provide guidance for organic change in certain measures of the statements of operations we do not provide guidance for the corresponding GAAP change, as the GAAP measure will include items that are difficult to quantify or predict with reasonable certainty, such as foreign exchange, which could have a significant impact to our GAAP income statement measures.\nDefinitions\nAggregations\n.\nFrom time to time, to explain our results of operations or to highlight trends and uncertainties affecting our business, we aggregate markets according to stage of economic development as defined by the International Monetary Fund (IMF), and we aggregate brands by beverage alcohol category. Below, we define the geographic and brand aggregations used in this report.\nGeographic Aggregations.\nIn “Results of Operations - Fiscal 2026 Year-to-Date Highlights,” we provide supplemental information for our top markets ranked by percentage of net sales. In addition to markets listed by country name, we include the following aggregations:\n•\n“Developed International” \nmarkets are “advanced economies” as defined by the IMF, excluding the United States. Our top developed international markets were Germany, Australia, the United Kingdom, France, and Canada. This aggregation represents our net sales of branded products to these markets.\n•\n“Emerging” \nmarkets are “emerging and developing economies” as defined by the IMF. Our top emerging markets were Mexico, Poland, Brazil, and Türkiye. This aggregation represents our net sales of branded products to these markets.\n•\n“Brazil” \nincludes Brazil, Paraguay, Uruguay, and certain other surrounding territories.\n•\n“Travel Retail”\n represents our net sales of branded products to global duty-free customers, other travel retail customers, and the U.S. military, regardless of customer location.\n•\n“Non-branded and bulk”\n includes net sales of used barrels, contract bottling services, and non-branded bulk whiskey, regardless of customer location.\nBrand Aggregations.\nIn “Results of Operations - Fiscal 2026 Year-to-Date Highlights,” we provide supplemental information for our top brands ranked by percentage of net sales. In addition to brands listed by name, we include the following aggregations outlined below.\n19\n•\n“Whiskey”\n includes all whiskey spirits and whiskey-based flavored liqueurs. The brands included in this category are the Jack Daniel’s family of brands (excluding the “Ready-to-Drink” products defined below), the Woodford Reserve family of brands (Woodford Reserve), the Old Forester family of brands (Old Forester), The Glendronach, Benriach, Glenglassaugh, and Slane Irish Whiskey. \n•\n“American whiskey”\n includes the Jack Daniel’s family of brands (excluding the “Ready-to-Drink” products defined below), Woodford Reserve, and Old Forester.\n•\n“Super-premium American whiskey”\n includes Woodford Reserve, Gentleman Jack, and other super-premium Jack Daniel’s expressions.\n•\n“Ready-to-Drink”\n includes all ready-to-drink (RTD) and ready-to-pour (RTP) products. The brands included in this category are Jack Daniel’s RTD and RTP products (JD RTD/RTP), New Mix, and other RTD/RTP products.\n•\n“Jack Daniel’s RTD/RTP”\n products include all RTD line extensions of Jack Daniel’s, such as Jack Daniel’s & Coca-Cola RTD, Jack Daniel’s & Cola, Jack Daniel’s Double Jack, Jack Daniel’s Country Cocktails, and other malt- and spirit-based Jack Daniel’s RTDs, along with Jack Daniel’s Winter Jack RTP.\n•\n“Jack Daniel’s & Coca-Cola RTD”\n includes all Jack Daniel’s & Coca-Cola RTD products and Jack Daniel’s bulk whiskey shipments for the production of these products.\n•\n“Tequila”\n includes el Jimador, the Herradura family of brands (Herradura), and other tequilas. \n•\n“Rest of Portfolio”\n includes Korbel California Champagnes\n1\n, Diplomático, Chambord, Gin Mare, Sonoma-Cutrer (which was divested on April 30, 2024), Finlandia Vodka (which was divested on November 1, 2023), Korbel Brandy\n1\n, Fords Gin, and other agency brands (brands we do not own, but sell in certain markets).\n•\n“Non-branded and bulk”\n includes net sales of used barrels, contract bottling services, and non-branded bulk whiskey.\n•\n“Jack Daniel’s family of brands”\n includes Jack Daniel’s Tennessee Whiskey (JDTW), JD RTD/RTP, Jack Daniel’s Tennessee Honey (JDTH), Gentleman Jack, Jack Daniel’s Tennessee Apple (JDTA), Jack Daniel’s Tennessee Fire (JDTF), Jack Daniel’s Tennessee Blackberry (JDTB), Jack Daniel’s Single Barrel Collection (JDSB), Jack Daniel’s Sinatra Select, Jack Daniel’s Bonded Tennessee Whiskey, Jack Daniel’s Bonded Rye Tennessee Whiskey, Jack Daniel’s Triple Mash Blended Straight Whiskey, Jack Daniel’s American Single Malt, Jack Daniel’s 12 Year Old, Jack Daniel’s 14 Year Old, Jack Daniel’s 10 Year Old, and other Jack Daniel’s expressions.\nOther Metrics\n.\n•\n“Shipments.” \nWe generally record revenues when we ship or deliver our products to our customers. In this report, unless otherwise specified, we refer to shipments when discussing volume.\n•\n“Depletions.” \nThis metric is commonly used in the beverage alcohol industry to describe volume. Depending on the context, depletions usually means either (a) where Brown-Forman is the distributor, shipments directly to retail or wholesale customers or (b) where Brown-Forman is not the distributor, shipments from distributor customers to retailers and wholesalers. We believe that depletions measure volume in a way that more closely reflects consumer demand than our shipments to distributor customers do.\n•\n“Consumer takeaway.”\n When discussing trends in the market, we refer to consumer takeaway, a term commonly used in the beverage alcohol industry that refers to the purchase of product by consumers from retail outlets, including products purchased through e-commerce channels, as measured by volume or retail sales value. This information is provided by outside parties, such as Nielsen and the National Alcohol Beverage Control Association (NABCA). Our estimates of market share or changes in market share are derived from consumer takeaway data using the retail sales value metric. We believe consumer takeaway is a leading indicator of consumer demand trends.\n•\n“Estimated net change in distributor inventories.”\n We generally recognize revenue when our products are shipped or delivered to customers. In the United States and certain other markets, our customers are distributors that sell downstream to retailers and consumers. We believe that our distributors’ downstream sales more closely reflect actual consumer demand than do our shipments to distributors. Our shipments increase distributors’ inventories, while distributors’ depletions (as described above) reduce their inventories. Therefore, it is possible that our shipments do not coincide with distributors’ downstream depletions and merely reflect changes in distributors’ inventories. Because changes in \n1\nEnded the Korbel relationship effective June 30, 2025.\n20\ndistributors’ inventories could affect our trends, we believe it is useful for investors to understand those changes in the context of our operating results. \nWe perform the following calculation to determine the “estimated net change in distributor inventories”:\n•\nFor both the current-year period and the comparable prior-year period, we calculate a “depletion-based” amount by (a) dividing the organic dollar amount (e.g. organic net sales) by the corresponding shipment volumes to arrive at a shipment per case amount, and (b) multiplying the resulting shipment per case amount by the corresponding depletion volumes. We subtract the year-over-year percentage change of the “depletion-based” amount from the year-over-year percentage change of the organic amount to calculate the “estimated net change in distributor inventories.”\n•\nA positive difference is interpreted as a net increase in distributors’ inventories, which implies that organic trends could decrease as distributors reduce inventories; whereas, a negative difference is interpreted as a net decrease in distributors’ inventories, which implies that organic trends could increase as distributors rebuild inventories.\nImportant Information on Forward-Looking Statements:\nThis report contains statements, estimates, and projections that are “forward-looking statements” as defined under U.S. federal securities laws. Words such as “aim,” “ambition,” “anticipate,” “aspire,” “believe,” “can,” “continue,” “could,” “envision,” “estimate,” “expect,” “expectation,” “intend,” “may,” “might,” “plan,” “potential,” “project,” “pursue,” “see,” “seek,” “should,” “will,” “would,” and similar words indicate forward-looking statements, which speak only as of the date we make them. Except as required by law, we do not intend to update or revise any forward-looking statement, whether as a result of new information, future events, or otherwise. By their nature, forward-looking statements involve risks, uncertainties, and other factors (many beyond our control) that could cause our actual results to differ materially from those expressed in or implied by the forward-looking statements. These risks and uncertainties include, but are not limited to: \n•\nOur substantial dependence upon the continued growth of the Jack Daniel’s family of brands\n•\nSubstantial competition from new entrants, consolidations by competitors and retailers, and other competitive activities, such as pricing actions (including price reductions, promotions, discounting, couponing, or free goods), marketing, category expansion, product introductions, or entry or expansion in our geographic markets or distribution networks\n•\nDisruption of our distribution network or inventory fluctuations in our products by distributors, wholesalers, or retailers\n•\nRisks from changes to the trade policies, tariffs and import and export regulations of the U.S. or foreign governments and the effectiveness of our actions to mitigate the negative impact on our margins, sales, and/or distributors\n•\nChanges in consumer preferences, consumption, or purchase patterns – particularly away from larger producers in favor of small distilleries or local producers, or away from brown spirits, our premium products, or spirits generally, and our ability to anticipate or react to them; further legalization of marijuana; bar, restaurant, travel, or other on-premise declines; shifts in demographic or health and wellness trends; or unfavorable consumer reaction to new products, line extensions, package changes, product reformulations, or other product innovation\n•\nRoute-to-consumer changes that affect the timing of our sales, temporarily disrupt the marketing or sale of our products, or result in higher fixed costs\n•\nProduction facility, aging warehouse, or supply chain disruption\n•\nImprecision in supply/demand forecasting\n•\nHigher costs, lower quality, or unavailability of energy, water, raw materials, product ingredients, or labor\n•\nRisks associated with acquisitions, dispositions, business partnerships, or investments – such as acquisition integration, termination difficulties or costs, or impairment in recorded value\n•\nUnfavorable global or regional economic conditions and related economic slowdowns or recessions, low consumer confidence, high unemployment, weak credit or capital markets, budget deficits, burdensome government debt, austerity measures, higher interest rates, higher taxes, political instability, higher inflation, deflation, lower returns on pension assets, or lower discount rates for pension obligations\n•\nImpact of health epidemics and pandemics, and the risk of the resulting negative economic impacts and related governmental actions\n•\nProduct recalls or other product liability claims, product tampering, contamination, or quality issues\n•\nNegative publicity related to our company, products, brands, marketing, executive leadership, employees, Board of Directors, family stockholders, operations, business performance, or prospects\n•\nFailure to attract or retain key executive or employee talent\n•\nRisks associated with being a U.S.-based company with a global business, including commercial, political, and financial risks; local labor policies and conditions; compliance with local trade practices and other regulations; terrorism, kidnapping, extortion, or other types of violence; and health pandemics \n•\nFailure to comply with anti-corruption laws, trade sanctions and restrictions, or similar laws or regulations\n21\n•\nFluctuations in foreign currency exchange rates, particularly due to a stronger U.S. dollar\n•\nChanges in laws, regulatory measures, or governmental policies, especially those affecting production, importation, marketing, labeling, pricing, distribution, sale, or consumption of our beverage alcohol products\n•\nTax rate changes (including excise, corporate, sales or value-added taxes, property taxes, payroll taxes, import and export duties, and tariffs) or changes in related reserves, changes in tax rules or accounting standards, and the unpredictability and suddenness with which they can occur\n•\nDecline in the social acceptability of beverage alcohol in significant markets\n•\nSignificant additional labeling or warning requirements or limitations on availability of our beverage alcohol products\n•\nCounterfeiting and inadequate protection of our intellectual property rights\n•\nSignificant legal disputes and proceedings, or government investigations\n•\nCyber breach or failure or corruption of our key information technology systems or those of our suppliers, customers, or direct and indirect business partners, or failure to comply with personal data protection laws\n•\nOur status as a family “controlled company” under New York Stock Exchange rules, and our dual-class share structure\nFor further information on these and other risks, please see the risks and uncertainties described in Part I, Item 1A. Risk Factors of our 2025 Form 10-K, and those described from time to time in our reports on Form 10-Q filed with the SEC.\n22\nOverview\nUnless otherwise indicated, all related commentary is on a reported basis and is for the three months ended July 31, 2025 compared to the same period last year.\nDivestitures\nDuring the fourth quarter of fiscal 2024, we sold the Sonoma-Cutrer wine business and entered into a TSA, which ended in August 2024. The absence of the brand negatively impacted our net sales and operating income, though positively impacted our gross margin for the three months ended July 31, 2025.\nDuring the first quarter of fiscal 2026, we concluded the Korbel relationship, effective June 30, 2025. This had an immaterial impact on our net sales and operating income for the three months ended July 31, 2025, though we expect it to negatively impact our net sales and operating income for the remainder of fiscal 2026.\nRestructuring Initiative\nDuring the third quarter of fiscal 2025, our Board of Directors approved a plan to reduce our structural cost base and realign resources toward future sources of growth. This included reducing our workforce by approximately 12% and closing the Louisville-based Brown-Forman Cooperage. We also offered a special, one-time early retirement benefit to qualifying U.S. employees. During the first quarter of fiscal 2026, we incurred additional restructuring charges associated with this initiative and completed the sale of the Brown-Forman Cooperage facility and related assets. Collectively, these actions negatively impacted our operating expenses and operating income for the three months ended July 31, 2025. See\n \nNote 6 to the Condensed Consolidated Financial Statements for more information.\nUnited States Distributor Evolution\nDuring the first quarter of fiscal 2026, we transitioned our portfolio distribution in the state of California, effective May 1, 2025, and we announced the upcoming transition in 13 additional markets across the United States, effective August 1, 2025. Net sales for the three months ended July 31, 2025 were positively impacted due to a net increase in distributor inventories related to the transition, which we expect to normalize in the remainder of fiscal 2026.\nFiscal 2026 Year-to-Date Highlights\nDuring the three months ended July 31, 2025, the operating environment remained challenging due to ongoing macroeconomic and geopolitical uncertainties, which we believe negatively impacted consumer confidence and reduced discretionary spending in many of our top markets.\n•\nWe delivered net sales of $924 million for the three months ended July 31, 2025, a decrease of 3%. The decrease was driven by the negative effect of acquisitions and divestitures and the negative effect of foreign exchange, partially offset by higher volumes. \n◦\nFrom a brand perspective, net sales declines were led by the Sonoma-Cutrer divestiture, JDTW, and used barrel sales, partially offset by the distributor inventory build in preparation for the launch of JDTB in the United States.\n◦\nFrom a geographic perspective, the declines in net sales in the United States and developed international markets were partially offset by growth in emerging markets and Travel Retail.\n•\nWe delivered gross profit of $552 million for the three months ended July 31, 2025, a decrease of 2%. Gross margin increased 0.4 percentage points to 59.8% from 59.4% in the same period last year. The increase in gross margin was driven by the positive effect of acquisitions and divestitures, partially offset by higher costs, unfavorable price/mix, and the negative effect of foreign exchange.\n•\nWe delivered operating income of $260 million for the three months ended July 31, 2025, a decrease of 7%, driven by (a) the negative effect of foreign exchange, (b) the absence of the prior-year franchise tax refund, (c) the impact of the restructuring initiative, (d) the decline in gross profit, and (e) the negative effect of acquisitions and divestitures. These declines were partially offset by the benefit of the substitution drawback claims and lower SG&A and advertising expenses.\n•\nWe delivered diluted earnings per share of $0.36 for the three months ended July 31, 2025, a decrease of 13% from the $0.41 reported for the same period last year, driven by the decrease in operating income and an increase in non-operating postretirement expense.\n23\nSummary of Operating Performance\nThree Months Ended July 31,\n(Dollars in millions)\n2024\n2025\nReported Change\nOrganic  Change\n1\nNet sales\n$\n951 \n$\n924 \n(3\n%)\n1\n%\nCost of sales\n386 \n372 \n(4\n%)\n5\n%\nGross profit\n565 \n552 \n(2\n%)\n(2\n%)\nAdvertising\n126 \n120 \n(4\n%)\n(3\n%)\nSG&A\n188 \n177 \n(6\n%)\n(7\n%)\nRestructuring and other charges\n— \n12 \nnm\n4\nnm\n4\nOther expense (income), net\n(30)\n(17)\nnm\n4\nnm\n4\nOperating income\n281 \n260 \n(7\n%)\n2\n%\nTotal operating expenses\n2\n$\n284 \n$\n292 \n3\n%\n(5\n%)\nAs a percentage of net sales\n3\nGross profit\n59.4 \n%\n59.8 \n%\n0.4 \npp\nOperating income\n29.6 \n%\n28.2 \n%\n(1.4)\npp\nNon-operating postretirement expense\n$\n— \n$\n19 \nnm\n4\nInterest expense, net\n$\n28 \n$\n21 \n(23\n%)\nEffective tax rate\n23.1 \n%\n22.5 \n%\n(0.6)\npp\nDiluted earnings per share\n$\n0.41 \n$\n0.36 \n(13\n%)\nNote: Totals may differ due to rounding\n1\nSee “Non-GAAP Financial Measures” above for details on our use of “organic change,” including how we calculate these measures and why we believe this information is useful to readers.\n2\nOperating expenses include advertising expense, SG&A expense, restructuring and other charges, and other expense (income), net.\n3\nYear-over-year changes in percentages are reported in percentage points (pp).\n4\nPercentage change is not meaningful.\n24\nResults of Operations – Fiscal 2026 Year-to-Date Highlights\nMarket Highlights\nThe following table provides supplemental information for our largest markets. We discuss results of the markets most affecting our performance below the table. Unless otherwise indicated, all related commentary is on a reported basis and is for the three months ended July 31, 2025 compared to the same period last year.\nTop Markets\nThree months ended July 31, 2025\nNet Sales % Change vs. Prior Year Period\nGeographic area\n1\nReported\nAcquisitions and Divestitures\nForeign Exchange\nOrganic\n2\nUnited States\n(8\n%)\n6\n%\n—\n%\n(2\n%)\nDeveloped International\n(8\n%)\n1\n%\n(1\n%)\n(9\n%)\nGermany\n(10\n%)\n1\n%\n(3\n%)\n(13\n%)\nAustralia\n(4\n%)\n(1\n%)\n3\n%\n(1\n%)\nUnited Kingdom\n(16\n%)\n1\n%\n—\n%\n(16\n%)\nFrance\n(5\n%)\n—\n%\n(3\n%)\n(8\n%)\nCanada\n(62\n%)\n2\n%\n—\n%\n(59\n%)\nRest of Developed International\n1\n%\n1\n%\n(3\n%)\n(2\n%)\nEmerging\n20\n%\n1\n%\n3\n%\n25\n%\nMexico\n14\n%\n—\n%\n9\n%\n22\n%\nPoland\n10\n%\n5\n%\n(10\n%)\n6\n%\nBrazil\n31\n%\n—\n%\n(1\n%)\n30\n%\nTürkiye\n11\n%\n—\n%\n27\n%\n39\n%\nRest of Emerging\n27\n%\n2\n%\n(2\n%)\n26\n%\nTravel Retail\n8\n%\n—\n%\n(2\n%)\n7\n%\nNon-branded and bulk\n(44\n%)\n—\n%\n—\n%\n(44\n%)\nTotal\n(3\n%)\n3\n%\n—\n%\n1\n%\nNote: Results may differ due to rounding\n1\nSee “Definitions” above for definitions of market aggregations presented here.\n2\nSee “Non-GAAP Financial Measures” above for details on our use of “organic change” in net sales, including how we calculate this measure and why we believe this information is useful to readers.\nThe \nUnited States’\n net sales declined 8% driven by the absence of the Sonoma-Cutrer prior-year TSA, lower volumes of JDTW and Herradura, and the end of the Korbel relationship. These declines were partially offset by the distributor inventory build in preparation for both the launch of JDTB and the distributor transitions to occur in the second quarter of fiscal 2026.\nDeveloped International \n•\nIn a challenging economic environment,\n Germany’s\n net sales decreased 10% driven by JDTW declines, partially offset by the positive effect of foreign exchange. \n•\nAustralia’s\n net sales declined 4% driven by the negative effect of foreign exchange.\n•\nThe\n United Kingdom’s\n net sales declined 16% driven by lower volumes of JDTW. The decline reflects soft consumer demand for the whiskey category impacted by macroeconomic and geopolitical uncertainty.\n•\nFrance’s\n net sales declined 5% driven by lower JDTW volumes, partially offset by the positive effect of foreign exchange.\n•\nCanada’s\n net sales decreased 62% driven by volumetric declines of our American whiskey portfolio and JD RTDs due to the removal of American-made alcohol from retail shelves in most of its provinces.\n25\n•\nNet sales in the \nRest of Developed International \nincreased 1% led by the distribution of new agency brands in Japan, the improved net pricing due to the transition to owned distribution in Italy, and the positive effect of foreign exchange. The increases were partially offset by lower volumes of JDTW in Japan, South Korea, and Belgium, as well as an estimated net decrease in distributor inventories related to the transition to owned distribution in Italy.\nEmerging\n•\nMexico’s\n net sales increased 14% driven by growth of New Mix and the distribution of new agency brands. This growth was partially offset by the negative effect of foreign exchange along with lower volumes of our tequilas as consumer preferences shifted to lower-priced products.\n•\nPoland’s\n net sales increased 10% driven by the positive effect of foreign exchange and growth of JDTW due to increased consumer-led demand, partially offset by the divestiture of Finlandia.\n•\nBrazil’s\n net sales increased 31% driven by the growth of JDTW and JDTA,\n \nreflecting continued distribution expansion and an estimated net increase in distributor inventories.\n•\nTürkiye’s\n net sales increased 11%, driven by higher prices across our portfolio, led by JDTW, in response to high inflation, partially offset by the negative effect of foreign exchange.\n•\nNet sales in the \nRest of Emerging\n increased 27%, driven by higher volumes across the rest of Latin America, led by el Jimador; higher volumes of Jack Daniel’s family of brands, led by the United Arab Emirates due to an estimated net increase in distributor inventories; and the positive effect of foreign exchange. \nTravel Retail’s \nnet sales increased 8% due to higher volumes of JDTW and Gin Mare, partially timing related, as well as the positive effect of foreign exchange. \nNon-branded and bulk’s \nnet sales decreased 44% driven by the decline of used barrel sales as demand and pricing adjusted to levels that reflect the current challenging and uncertain operating environment for our industry.\n \n26\nBrand Highlights\nThe following table provides supplemental information for our largest brands. We discuss results of the brands most affecting our performance below the table. Unless otherwise indicated, all related commentary is on a reported basis and is for the three months ended July 31, 2025 compared to the same period last year.\n \nMajor Brands\nThree months ended July 31, 2025\nNet Sales % Change vs. Prior Year Period\nProduct category / brand family / brand\n1\nReported\nAcquisitions and Divestitures\nForeign Exchange\nOrganic\n2\nWhiskey\n—\n%\n—\n%\n—\n%\n—\n%\nJDTW\n(4\n%)\n—\n%\n—\n%\n(4\n%)\nJDTH\n(3\n%)\n—\n%\n(1\n%)\n(4\n%)\nGentleman Jack\n8\n%\n—\n%\n3\n%\n11\n%\nJDTA\n18\n%\n—\n%\n(2\n%)\n16\n%\nJDTF\n(4\n%)\n—\n%\n—\n%\n(4\n%)\nWoodford Reserve\n(2\n%)\n—\n%\n—\n%\n(1\n%)\nOld Forester\n8\n%\n—\n%\n—\n%\n8\n%\nRest of Whiskey\n33\n%\n—\n%\n1\n%\n34\n%\nReady-to-Drink\n6\n%\n—\n%\n3\n%\n9\n%\nJD RTD/RTP\n(2\n%)\n—\n%\n—\n%\n(1\n%)\nNew Mix\n26\n%\n—\n%\n10\n%\n36\n%\nTequila\n(1\n%)\n—\n%\n1\n%\n1\n%\nel Jimador\n14\n%\n—\n%\n1\n%\n16\n%\nHerradura\n(16\n%)\n—\n%\n1\n%\n(15\n%)\nRest of Portfolio\n(27\n%)\n44\n%\n—\n%\n17\n%\nNon-branded and bulk\n(44\n%)\n—\n%\n—\n%\n(44\n%)\nNote: Results may differ due to rounding\n1\nSee “Definitions” above for definitions of brand aggregations presented here. \n2\nSee “Non-GAAP Financial Measures” above for details on our use of “organic change” in net sales, including how we calculate this measure and why we believe this information is useful to readers.\nWhiskey\n \n•\nNet sales for \nJDTW\n declined 4% led by lower volumes in the United States, Germany, and the United Kingdom, partially offset by volumetric growth in Brazil along with higher prices in Türkiye in response to high inflation. An estimated net increase in distributor inventories in our emerging markets, led by the United Arab Emirates, positively impacted net sales.\n•\nNet sales for\n JDTH\n declined 3% driven by lower volumes in developed international markets and the United States, partially offset by higher volumes in emerging markets, led by Chile, and the positive effect of foreign exchange. \n•\nNet sales\n \nfor\n Gentleman Jack\n increased 8% led by higher prices and volumes in Türkiye and volumetric growth in Germany, partially offset by the negative effect of foreign exchange.\n•\nNet sales for \nJDTA \nincreased 18% driven by broad-based growth in emerging markets, led by Brazil, which was partially due to an estimated net increase in distributor inventories, and the positive effect of foreign exchange. These increases were partially offset by declines in South Korea.\n•\nNet sales for \nJDTF\n declined 4% driven by lower volumes in the United States.\n•\nWoodford Reserve’s \nnet sales declined 2% driven by lower volumes in the United States, partially due to the distributor transitions, and the removal of American-made alcohol from retail shelves in most Canadian provinces. These declines were partially offset by favorable mix in the United States.\n27\n•\nOld Forester’s\n net sales increased 8% driven by favorable product mix and higher volumes in the United States, reflecting the distributor inventory build in preparation for the the distributor transitions to occur in the second quarter of fiscal 2026.\n•\nNet sales for \nRest of Whiskey\n increased 33% driven by the distributor inventory build in preparation for the launch of JDTB, partially offset by lower volumes of other super-premium Jack Daniel’s expressions.\nReady-to-Drink\n•\nNet sales for the\n JD RTD/RTP \nbrands declined 2% driven by lower volumes in Canada due to the removal of American-made alcohol from retail shelves in most of its provinces. These declines were partially offset by higher volumes in the United States, along with growth of Jack Daniel’s bulk whiskey shipments for the production of Jack Daniel’s & Coca-Cola RTD products.\n•\nNew Mix \nnet sales increased 26% driven by strong growth in Mexico with market share gains in a growing category, partially offset by the negative effect of foreign exchange.\nTequila\n•\nel Jimador’s \nnet sales increased 14% driven by higher volumes in the United States due to the roll-out of the new bottle design, inventory build ahead of the distributor transitions in 13 states, and the new innovation launch of the Cristalino expression.\n•\nHerradura’s\n net sales declined 16% driven by lower volumes in the United States.\nNet sales for \nRest of Portfolio \ndeclined 27% driven by the absence of Sonoma-Cutrer and Finlandia prior-year TSAs and the net decrease in distributor inventories due to the end of the Korbel relationship. These declines were partially offset by the distribution of new agency brands in Japan and Mexico, along with growth of Gin Mare in Italy partially due to the transition to owned distribution. \nNon-branded and bulk’s \nnet sales decreased 44% driven by the decline of used barrel sales as demand and pricing adjusted to levels that reflect the current challenging and uncertain operating environment for our industry.\n \n28\nYear-Over-Year Period Comparisons\nUnless otherwise indicated, all related commentary is on a reported basis and is for the three months ended July 31, 2025 compared to the same period last year.\nNet Sales\n3 Months\nPercentage change versus the prior year period ended July 31\nVolume\nPrice/mix\nTotal\nChange in reported net sales\n3\n%\n(6\n%)\n(3\n%)\nAcquisitions and divestitures\n3\n%\n—\n%\n3\n%\nForeign exchange\n—\n%\n—\n%\n—\n%\nChange in organic net sales\n6\n%\n(5\n%)\n1\n%\nNote: Results may differ due to rounding\nFor the three months ended July 31, 2025, net sales were $924 million, a decrease of $27 million, or 3%, as unfavorable price/mix was partially offset by higher volumes. Volume increased 3% driven by higher volumes of New Mix as well as the United States distributor inventory build in preparation for both the launch of JDTB and the distributor transitions to occur in the second quarter of fiscal 2026, partially offset by the divestiture of Sonoma-Cutrer and lower volumes of JDTW. Price/mix declined 6% driven by unfavorable portfolio mix from New Mix and lower sales of used barrels, partially offset by the positive portfolio mix impact from JDTB. See “Results of Operations - Fiscal 2026 Year-to-Date Highlights” above for further details on net sales for the three months ended July 31, 2025. \nCost of Sales\n3 Months\nPercentage change versus the prior year period ended July 31\nVolume\nCost/mix\nTotal\nChange in reported cost of sales\n3\n%\n(7\n%)\n(4\n%)\nAcquisitions and divestitures\n3\n%\n6\n%\n9\n%\nForeign exchange\n—\n%\n(1\n%)\n(1\n%)\nChange in organic cost of sales\n6\n%\n(1\n%)\n5\n%\nNote: Results may differ due to rounding\nFor the three months ended July 31, 2025, cost of sales were $372 million, a decrease of $14 million, or 4%, as favorable cost/mix was partially offset by higher volumes.\n \nVolume increased 3% driven by higher volumes of New Mix as well as the United States distributor inventory build in preparation for both the launch of JDTB and the distributor transitions to occur in the second quarter of fiscal 2026, partially offset by the divestiture of Sonoma-Cutrer and lower volumes of JDTW. Cost/mix declined 7% driven by the divestiture of Sonoma-Cutrer and the favorable portfolio mix from New Mix, partially offset by the negative effect of foreign exchange, higher input costs,\n \nand\n \nunfavorable fixed cost absorption related to decreased production of our full-strength portfolio.\n29\nGross Profit\nPercentage change versus the prior year period ended July 31\n3 Months\nChange in reported gross profit\n(2\n%)\nAcquisitions and divestitures\n(1\n%)\nForeign exchange\n1\n%\nChange in organic gross profit\n(2\n%)\nNote: Results may differ due to rounding\nGross Margin\nFor the period ended July 31\n3 Months\nPrior year gross margin\n59.4\n%\nPrice/mix\n(0.5\n%)\nCost\n(0.9\n%)\nAcquisitions and divestitures\n2.4\n%\nForeign exchange\n(0.5\n%)\nChange in gross margin\n0.4 \n%\nCurrent year gross margin\n59.8\n%\nNote: Results may differ due to rounding\n—\nFor the three months ended July 31, 2025, gross profit totaled $552 million, a decrease of $12 million, or 2%. Gross margin increased 0.4 percentage points to 59.8% from 59.4% in the same period last year. The increase in gross margin was driven by the positive effect of acquisitions and divestitures, partially offset by higher costs, unfavorable price/mix, and the negative effect of foreign exchange.\nOperating Expenses\nPercentage change versus the prior year period ended July 31\n3 Months\nReported\nAcquisitions and Divestitures\nOther Items\n1\nForeign Exchange\nOrganic\nAdvertising\n(4\n%)\n2\n%\n—\n%\n(1\n%)\n(3\n%)\nSG&A\n(6\n%)\n—\n%\n(1\n%)\n(1\n%)\n(7\n%)\nTotal operating expenses\n2\n3\n%\n(3\n%)\n(3\n%)\n(2\n%)\n(5\n%)\nNote: Results may differ due to rounding\n1\n“Other items” includes “substitution drawback claims,” “franchise tax refund,” and “restructuring initiative.” See “Non-GAAP Financial Measures” above for additional details.\n2\nOperating expenses include advertising expense, SG&A expense, restructuring and other charges, and other expense (income), net.\nFor the three months ended July 31, 2025, operating expenses totaled $292 million, an increase of $8 million, or 3%. The increase in operating expenses was primarily driven by (a) the absence of the prior-year franchise tax refund, (b) the absence of the prior-year gain on sale of the Alabama cooperage, (c) the impact of the restructuring initiative, and (d) the negative effect of foreign exchange, partially offset by the benefit of the substitution drawback claims and lower SG&A and advertising expenses.\n•\nAdvertising expense decreased 4% for the three months ended July 31, 2025 led by lower JDTW spend and lower spend resulting from the end of the Korbel relationship, partially offset by the negative effect of foreign exchange. \n•\nSG&A expense decreased 6% for the three months ended July 31, 2025 driven by lower compensation-and-benefit-related expenses,\n \npartially offset by the negative effect of foreign exchange and legal fees related to the substitution drawback claims. \n30\nOperating Income\nPercentage change versus the prior year period ended July 31\n3 Months\nChange in reported operating income\n(7\n%)\nAcquisitions and divestitures\n2\n%\nOther items\n1\n3\n%\nForeign exchange\n5\n%\nChange in organic operating income\n2\n%\nNote: Results may differ due to rounding\n1\n“Other items” includes “substitution drawback claims,” “franchise tax refund,” and “restructuring initiative.” See “Non-GAAP Financial Measures” above for additional details.\nFor the three months ended July 31, 2025, operating income totaled $260 million, a decrease of $21 million, or 7%. Operating margin decreased 1.4 percentage points to 28.2% from 29.6% in the same period last year driven by (a) the negative effect of foreign exchange, (b) the absence of the prior-year franchise tax refund, (c) the impact of the restructuring initiative, (d) the decline in gross profit, and (e) the negative effect of acquisitions and divestitures. These declines were partially offset by the benefit of the substitution drawback claims and lower SG&A and advertising expenses.\nThe \neffective tax rate\n for the three months ended July 31, 2025 was 22.5% compared to 23.1% for the same period last year. The decrease in our effective tax rate was driven by the lower impact of state taxes and the absence of the impact of increased valuation allowances in the prior period, partially offset by the unfavorable year-over-year impact of prior fiscal year true-ups.\nDiluted earnings per share \nof $0.36 for the three months ended July 31, 2025, decreased 13% from the $0.41 reported for the same period last year driven by the decrease in operating income and an increase in non-operating postretirement expense. \nFiscal 2026 Outlook\nBelow we discuss our outlook for fiscal 2026, which reflects the trends, developments, and uncertainties (including those described above) that we expect to affect our business.\nWe continue to anticipate the operating environment for fiscal 2026 to be challenging, with low visibility due to macroeconomic and geopolitical volatility as we face headwinds from consumer uncertainty, the potential impact from currently unknown tariffs, and lower non-branded sales of used barrels. We remain focused on building our business for the long term and navigating the current environment at pace with strategic initiatives in fiscal 2026 that we believe will unlock future growth led by the significant evolution of our U.S. distribution, the restructuring initiative, and meaningful new product innovation. Accordingly, we reiterate the following expectation for fiscal 2026:\n•\nOrganic net sales decline in the low-single digit range.\n•\nOrganic operating income decline in the low-single digit range.\n•\nOur effective tax rate to be in the range of approximately 21% to 23%.\n•\nCapital expenditures planned to be in the range of $125 to $135 million.\n31\nLiquidity and Financial Condition\nLiquidity\n. We generate strong cash flows from operations, which enable us to meet current obligations, fund capital expenditures, and return cash to our stockholders through regular dividends and, from time to time, through share repurchases and special dividends. We believe our investment-grade credit ratings (A1 by Moody’s and A- by Standard & Poor’s) provide us with financial flexibility when accessing global debt capital markets and allow us to reserve adequate debt capacity for investment opportunities and unforeseen events.\nOur cash flows from operations are supplemented by our cash and cash equivalent balances, as well as access to other liquidity sources. Cash and cash equivalents were $444 million at April 30, 2025, and $471 million at July 31, 2025. As of \nJuly 31, 2025, approximately 54% of our cash and cash equivalents were held by our foreign subsidiaries whose earnings we expect to reinvest indefinitely outside of the United States. We continue to evaluate our future cash requirements and may decide to repatriate additional cash held by our foreign subsidiaries, which may require us to provide for and pay additional taxes.\nWe have a $\n900 million commercial paper program that we use, together with our cash flows from operations, to fund our short-term operational needs. See Note 8 to the Condensed Consolidated Financial Statements included in Part I, Item 1 of this Quarterly Report for outstanding commercial paper balances, interest rates, and days to maturity at April 30, 2025, and July 31, 2025. The average balances, interest rates, and original maturities during the periods ended July 31, 2024 and 2025, are presented below.\nThree Months Average\nJuly 31,\n(Dollars in millions)\n2024\n2025\nAverage commercial paper (par amount)\n$438\n$288\nAverage interest rate\n5.52%\n4.60%\nAverage days to maturity at issuance\n29\n29\nOur commercial paper program is supported by available commitments under our $900 million bank credit facility that expires on May 26, 2029. Although unlikely, under extreme market conditions, one or more participating banks may not be able to fund its commitments under our credit facility. To manage this counterparty credit risk, we partner with banks that have investment grade credit ratings, limit the amount of exposure we have with each bank, and monitor each bank’s financial conditions.\nOur most significant short-term cash requirements relate primarily to funding our operations (such as expenditures for raw materials, production and distribution, advertising and promotion, and current taxes)\n, repayment of our notes maturing in July 2026\n, dividend payments, and capital investments. We expect to meet our planned short-term liquidity needs through cash generated from operations and borrowings under our commercial paper program. If we have additional liquidity needs, we believe that we could access financing in the capital markets. Our most significant longer-term cash requirements primarily include payments related to our long-term debt, employee benefit obligations, and deferred tax liabilities.\nWe believe our current liquidity position, supplemented by our ability to generate positive cash flows from operations in the future, and our ample debt capacity enabled by our strong short-term and long-term credit ratings, will be sufficient to meet all of our expected future short- and long-term financial commitments.\nCash flows.\n Cash provided by operations of $\n160\n million during the three months ended July 31, 2025, increased $143 million from the same period last year, reflecting lower working capital requirements, offset partially by lower earnings.\nCash provided by investing activities was $\n2\n million during the three months ended July 31, 2025, compared to $\n10\n million provided by investing activities during the same period last year. The $8 million decrease largely reflects an $18 million decrease in proceeds from cooperage asset sales ($51 million from the sale of our Alabama cooperage assets in May 2024; $33 million from the sale of our Brown-Forman Cooperage assets in May 2025), partially offset by a $10 million decline in capital expenditures.\nCash used for financing activities was $138 million during the three months ended July 31, 2025, compared to $51 million in cash used for financing activities during the same prior-year period. The $87 million increase largely reflects an $84 million increase in net repayments of short-term borrowings.\n32\nDividends.\n See Note 9 to the Condensed Consolidated Financial Statements included in Part I, Item 1 of this Quarterly Report for information about cash dividends declared per share on our Class A and Class B common stock during fiscal 2026."
}