{
  "source_file": "bg-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "ITEM 2.\n    \nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThird Quarter 2025 Overview\nYou should refer to \"Item 7, Management’s Discussion and Analysis of Financial Condition and Results of Operations - Factors Affecting Operating Results\" in our Annual Report on Form 10-K for the year ended December 31, 2024, for a discussion of key factors affecting operating results in each of our business segments. In addition, you should refer to \"Item 9A, Controls and Procedures\" in our Annual Report on Form 10-K for the year ended December 31, 2024, and to \"Item 4, Controls and Procedures\" in this Quarterly Report on Form 10-Q for the period ended September 30, 2025, for a discussion of our internal controls over financial reporting.\nViterra Acquisition\nOn July 2, 2025, we completed our previously announced acquisition (the \"Acquisition\") of Viterra Limited (\"Viterra\"). Pursuant to the terms of the business combination agreement, Viterra shareholders received approximately 65.6 million registered shares of Bunge, with an aggregate value of approximately $5.3 billion as of July 2, 2025, and approximately $1.9 billion in cash, in return for 100% of the outstanding equity of Viterra. The Acquisition of Viterra creates a premier global agribusiness solutions company for food, feed and fuel, well positioned to meet the demands of increasingly complex markets and better serve farmers and end-customers. \nThis section is inclusive of the results of operations of Viterra from the date of Acquisition, July 2, 2025. As such, the Acquisition of Viterra is frequently one of the primary drivers of the year-over-year variances discussed throughout this section. \nNon-U.S. GAAP Financial Measures\nTotal earnings before interest and taxes (\"EBIT\") is an operating performance measure used by Bunge’s management to evaluate reportable segment operating activities as well as Corporate and Other results. Bunge also uses Segment EBIT, Corporate and Other EBIT, and Total EBIT to evaluate the operating performance of Bunge’s reportable segments and Total reportable segments together with Corporate and Other activities. Segment EBIT is the aggregate of the EBIT of each of Bunge’s Soybean Processing and Refining, Softseed Processing and Refining, Other Oilseeds Processing and Refining, and Grain Merchandising and Milling reportable segments. Total EBIT is the aggregate of the EBIT of Bunge’s reportable segments, together with Corporate and Other activities. Bunge’s management believes Segment EBIT, Corporate and Other EBIT, and Total EBIT are useful measures of operating profitability since the measures allow for an evaluation of performance without regard to financing methods or capital structure. In addition, EBIT is a financial measure that is widely used by analysts and investors in Bunge’s industry. Total EBIT is a non-U.S. GAAP financial measure and is not intended to replace Net income (loss) attributable to Bunge shareholders, the most directly comparable U.S. GAAP financial measure. Further, Total EBIT excludes EBIT attributable to noncontrolling interests and EBIT attributable to discontinued operations and is not a measure of consolidated operating results under U.S. GAAP and should not be considered as an alternative to Net income (loss) or any other measure of consolidated operating results under U.S. GAAP. See the reconciliation of Net income (loss) attributable to Bunge shareholders to Total EBIT below.\nExecutive Summary\nNet Income (Loss) Attributable to Bunge Shareholders -\n For the three months ended September 30, 2025, Net income attributable to Bunge shareholders was $166 million, a decrease of $55 million compared to $221 million, for the three months ended September 30, 2024. For the nine months ended September 30, 2025, Net income attributable to Bunge was $721 million, an increase of $186 million, compared to $535 million for the nine months ended September 30, 2024. The decrease for the three months ended September 30, 2025, was primarily due to higher net interest expense due to increased debt levels to finance the Acquisition as well as lower Corporate and Other EBIT, partially offset by higher Segment EBIT, as further discussed in the \nSegment Overview & Results of Operations \nsection below. The increase for the nine months ended September 30, 2025 was due to higher Segment EBIT, partially offset by lower EBIT in our Corporate and Other activities, as further discussed in the \nSegment Overview & Results of Operations\n section below, and higher income tax expense as discussed further below.\nNet income (loss) attributable to Bunge shareholders - Earnings per share - Diluted -\n For the three months ended September 30, 2025, Net income attributable to Bunge shareholders - diluted, was $0.84 per share, a decrease of $0.72 per share, compared to $1.56 per share for the three months ended September 30, 2024. For the nine months ended September 30, 2025, Net income attributable to Bunge shareholders - diluted, was $4.60 per share, an increase of $0.87 per share, compared to income of $3.73 per share for the nine months ended September 30, 2024.\n47\nTable of \nContents\nTotal EBIT \n- For the three months ended September 30, 2025, Total EBIT was $403 million, a decrease of $4 million compared to $407 million for the three months ended September 30, 2024. For the nine months ended September 30, 2025, Total EBIT was $1,269 million, an increase of $244 million compared to Total EBIT of $1,025 million for the nine months ended September 30, 2024. The decrease in Total EBIT for the three months ended September 30, 2025, was primarily due to lower Corporate and Other EBIT, resulting from higher SG&A expense, partially offset by higher Segment EBIT, resulting primarily from higher gross profit in both of our Soybean Processing and Refining and Softseed Processing and Refining segments, as further discussed in the \nSegment Overview & Results of Operations\n section below. The increase for the nine months ended September 30, 2025, was primarily due to higher Segment EBIT, resulting primarily from higher gross profit in our Soybean Processing and Refining segment, partially offset by lower Corporate and Other EBIT, resulting from higher SG&A expense, as further discussed in the \nSegment Overview & Results of Operations\n section below. \nIncome Tax (Expense) Benefit - \nIncome tax expense was $86 million for the three months ended September 30, 2025 compared to $89 million for the three months ended September 30, 2024. Income tax expense was $290 million for the nine months ended September 30, 2025 compared to $236 million for the nine months ended September 30, 2024. The decrease for the three months ended September 30, 2025 was primarily due to lower pre-tax income in 2025, while the increase for the nine months ended September 30, 2025, was primarily due to higher pre-tax income in 2025.  \nLiquidity and Capital Resources\n – At September 30, 2025, working capital, which equals Total current assets less Total current liabilities, was $10,622 million, an increase of $2,394 million, compared to working capital of $8,228 million at September 30, 2024, and an increase of $2,099 million, compared to working capital of $8,523 million at December 31, 2024. The increase in working capital at September 30, 2025, compared to September 30, 2024, and December 31, 2024, respectively, was primarily due to higher Inventories and Other current assets, partially offset by higher Short-term debt, as further discussed in \nLiquidity and Capital Resources \nsection below.\nSegment Overview & Results of Operations\nEffective July 1, 2025, we changed our reportable segments to align with our new value chain operational structure as a result of the completion of the Acquisition of Viterra. See \nNote 19 - Segment Information \nto our condensed consolidated financial statements. Further, we enhanced our volume reporting to align with the new segment reporting structure and with the Company's primary income-generating activities. Volumes are now reported as follows:\n•\nSoybean Processing and Refining volumes represent (1) oilseed volumes processed (crushed) during a period, which approximate sales volumes to third parties during the same reporting period (2) merchandised volumes, which represent sales volumes of soybeans to third-party customers during a reporting period and (3) a supplemental refined oil production volume, which will also be provided representing the total refined volume during a reporting period.    \n•\nSoftseed Processing and Refining volumes represent (1) oilseed volumes processed (crushed) during a period, which approximate sales volumes to third parties during the same reporting period (2) merchandised volumes, which represent sales volumes of softseeds to third-party customers during a reporting period and (3) a supplemental refined oil production volume, which will also be provided representing the total refined volume during a reporting period.    \n•\nOther Oilseeds Processing and Refining volumes represent sales volumes to third-party customers. \n•\nGrain Merchandising and Milling volumes represent sales volumes to third-party customers. \nFurther, effective January 1, 2025, Bunge is no longer separately presenting a Sugar & Bioenergy segment, as discussed in \nNote 19 - Segment Information \nto our condensed consolidated financial statements\n, \nnor presenting Core and Non-core segment results. \nCorresponding prior period amounts have been recast to conform to the current period presentations described above. \nTherefore, our operations are now organized, managed and classified into four reportable segments based upon their similar economic characteristics, nature of products and services offered, production processes, types and classes of customer, and distribution methods. Reportable operations comprise our Soybean Processing and Refining, Softseed Processing and Refining, Other Oilseeds Processing and Refining, and Grain Merchandising and Milling reportable segments. \nOur remaining operations are not reportable segments, as defined by the applicable accounting standard, and are classified as Corporate and Other. Corporate and Other includes salaries and overhead for corporate functions, including acquisition and integration costs related to the Viterra Acquisition, that are not allocated to our individual reportable segments because the operating performance of each reportable segment is evaluated by the Company's chief operating \n48\nTable of \nContents\ndecision maker exclusive of these items, as well as certain other activities including Bunge Ventures, the Company's captive insurance activities, accounts receivable securitization activities, and certain income tax assets and liabilities. Corporate and Other also includes historical results of Bunge's previously recognized Sugar & Bioenergy segment as discussed above. \nA reconciliation of Net income (loss) attributable to Bunge shareholders to Total EBIT follows:\nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n(US$ in millions)\n2025\n2024\n2025\n2024\nNet income (loss) attributable to Bunge shareholders\n$\n166\n \n$\n221 \n$\n721\n \n$\n535 \nInterest income\n(57)\n(33)\n(162)\n(112)\nInterest expense\n202\n \n127 \n412\n \n358 \nIncome tax expense (benefit)\n86\n \n89 \n290\n \n236 \nIncome (loss) from discontinued operations, net of tax\n3\n \n— \n3\n \n— \nNoncontrolling interests' share of interest and tax\n3\n \n3 \n5\n \n8 \nTotal EBIT\n$\n403\n \n$\n407 \n$\n1,269\n \n$\n1,025 \nSoybean Processing and Refining\n337\n \n222 \n1,068\n \n463 \nSoftseed Processing and Refining\n236\n \n132 \n337\n \n523 \nOther Oilseeds Processing and Refining\n77\n \n104 \n72\n \n210 \nGrain Merchandising and Milling\n21\n \n79 \n254\n \n231 \nSegment EBIT\n671\n \n537 \n1,731\n \n1,427 \nCorporate and Other EBIT\n(268)\n(130)\n(462)\n(402)\nTotal EBIT\n$\n403\n \n$\n407 \n$\n1,269\n \n$\n1,025 \nReportable Segments\nSoybean Processing and Refining\nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n(US$ in millions, except volumes)\n2025\n2024\n% Change\n2025\n2024\n% Change\nVolumes (in thousand metric tons)\nSoybeans processed\n12,139\n \n9,343 \n30 \n%\n29,553\n \n27,179 \n9 \n%\nSoybeans merchandised\n7,246\n \n3,070 \n136 \n%\n13,577\n \n10,175 \n33 \n%\nRefined oil production\n932\n \n908 \n3 \n%\n2,693\n \n2,620 \n3 \n%\nNet sales\n$\n10,857\n \n$\n7,857 \n38 \n%\n$\n25,268\n \n$\n23,556 \n7 \n%\nCost of goods sold\n(10,359)\n(7,562)\n37 \n%\n(23,877)\n(22,744)\n5 \n%\nGross profit\n498\n \n295 \n69 \n%\n1,391\n \n812 \n71 \n%\nSelling, general and administrative expense\n(143)\n(111)\n29 \n%\n(365)\n(344)\n6 \n%\nForeign exchange (losses) gains – net\n(42)\n15 \n(380)\n%\n9\n \n(58)\n116 \n%\nEBIT attributable to noncontrolling interests\n(3)\n4 \n175 \n%\n(13)\n12 \n(208)\n%\nOther income (expense) – net\n21\n \n50 \n(58)\n%\n27\n \n97 \n(72)\n%\nIncome (loss) from affiliates\n6\n \n(31)\n119 \n%\n19\n \n(56)\n134 \n%\nTotal Soybean Processing and Refining Segment EBIT\n$\n337\n \n$\n222 \n52 \n%\n$\n1,068\n \n$\n463 \n131 \n%\nThree Months Ended September 30, 2025 Compared to Three Months Ended September 30, 2024\n49\nTable of \nContents\nSoybean Processing and Refining segment Net sales increased 38%, to $10,857 million for the three months ended September 30, 2025. The increase was primarily due to Net sales contributions from the Acquisition of Viterra, in addition to higher volumes of oilseeds merchandised in our global soybean distribution business and overall higher prices in Argentina which encouraged farmer selling, partially offset by lower prices in North America and our global soybean distribution business driven by relative price stabilization from a more balanced supply environment as well as slightly lower processed volumes in South America.\nCost of goods sold increased 37%, to $10,359 million for the three months ended September 30, 2025. The net increase was primarily due to higher Net sales as well as more unfavorable mark-to-market results. \nForeign exchange (losses) gains - net decreased 380% to a loss of $42 million for the three months ended September 30, 2025. The net loss in the current period was primarily due to unfavorable hedging results on monetary assets and a reduction of gains year over year resulting from a weaker U.S. dollar on U.S. dollar-denominated loans payable in non-U.S. functional currency operations. \nIncome (loss) from affiliates increased 119% to net income of $6 million for the three months ended September 30, 2025. The increase was primarily due to a $19 million nonrecurring impairment charge in the prior period associated with a minority investment in North America as well as net improved results from our portfolio of equity method investments, particularly in South America and Vietnam. \nSegment EBIT increased 52%, to $337 million for the three months ended September 30, 2025. The net increase was primarily due to higher Gross profit driven by improved margins in our North America and Brazil soybean processing and refining businesses in addition to income from affiliates in the current period compared to losses from affiliates in the prior period. The increase was partially offset by foreign currency losses, as described above.\nNine Months Ended September 30, 2025 Compared to Nine Months Ended September 30, 2024\nSoybean Processing and Refining segment Net sales increased 7%, to $25,268 million for the nine months ended September 30, 2025. The net increase was primarily due to Net sales contributions from the Acquisition of Viterra, in addition to higher volumes of oilseeds merchandised in our global soybean distribution business and overall higher prices in Argentina which encouraged farmer selling. These increases were partially offset by lower prices in almost all other regions driven by relative price stabilization from a more balanced supply environment as well as lower processed volumes in South America.\nCost of goods sold increased 5% to $23,877 million for the nine months ended September 30, 2025. The increase was primarily due to higher Net sales, partially offset by favorable mark-to-market results.\nForeign exchange (losses) gains - net increased 116% to a gain of $9 million for the nine months ended September 30, 2025. The net gain in the current year is primarily the result of a weaker U.S. dollar on U.S. dollar-denominated loans payable in non-U.S. functional currency operations, partially offset by losses resulting from unfavorable hedging and remeasurement results on monetary assets.\nOther income (expense) - net decreased 72% to $27 million for the nine months ended September 30, 2025. The decrease was primarily due to lower gains in Argentina related to foreign currency positioning compared to the prior year.\nIncome (loss) from affiliates was gain of $19 million for the nine months ended September 30, 2025 compared to loss of $56 million for the nine months ended September 30, 2024. The increase was primarily due to improved results from our portfolio of equity method investments, particularly in South America and Vietnam, and a reduction of $19 million from a nonrecurring impairment charge in the prior period associated with a minority investment in North America. \nSegment EBIT increased 131% to $1,068 million for the nine months ended September 30, 2025. The net increase was primarily due to higher Gross profit driven by improved margins across our global soybean processing and refining businesses, foreign currency gains, and income from affiliates in the current period compared to losses from affiliates in the prior period as described above. The increase was partially offset by a decrease in Other income (expense) - net, as further described above. \n50\nTable of \nContents\nSoftseed Processing and Refining\nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n(US$ in millions, except volumes)\n2025\n2024\n% Change\n2025\n2024\n% Change\nVolumes (in thousand metric tons)\nSoftseeds processed\n3,129\n \n2,135 \n47 \n%\n7,270\n \n6,898 \n5 \n%\nSoftseeds merchandised\n1,032\n \n178 \n480 \n%\n1,142\n \n518 \n120 \n%\nRefined oil production\n711\n \n696 \n2 \n%\n2,102\n \n2,136 \n(2)\n%\nNet sales\n$\n3,661\n \n$\n1,589 \n130 \n%\n6,707\n \n5,143 \n30 \n%\nCost of goods sold\n(3,372)\n(1,421)\n137 \n%\n(6,264)\n(4,487)\n40 \n%\nGross profit\n289\n \n168 \n72 \n%\n443\n \n656 \n(32)\n%\nSelling, general and administrative expense\n(58)\n(35)\n66 \n%\n(131)\n(104)\n26 \n%\nForeign exchange (losses) gains – net\n11\n \n3 \n267 \n%\n43\n \n(15)\n387 \n%\nEBIT attributable to noncontrolling interests\n(1)\n— \n(100)\n%\n(2)\n— \n(100)\n%\nOther income (expense) – net\n(5)\n(4)\n25 \n%\n(10)\n(14)\n(29)\n%\nIncome (loss) from affiliates\n—\n \n— \n— \n%\n(6)\n— \n(100)\n%\nTotal Softseed Processing and Refining Segment EBIT\n$\n236\n \n$\n132 \n79 \n%\n$\n337\n \n$\n523 \n(36)\n%\nThree Months Ended September 30, 2025 Compared to Three Months Ended September 30, 2024\nSoftseed Processing and Refining segment Net sales increased 130%, to $3,661 million for the three months ended September 30, 2025. The increase was primarily due to Net sales contributions from the Acquisition of Viterra, in addition to higher average sales prices in our European business resulting from a drought in the region impacting the sunflower seed crop in the current year. The above increases were partially offset by lower volumes for both oilseeds processed and oilseeds merchandised within our legacy European and North American businesses. \n \nCost of goods sold increased 137%, to $3,372 million for the three months ended September 30, 2025. The increase was primarily due to higher Net sales in addition to more unfavorable mark-to-market results. \nSegment EBIT increased 79% to $236 million for the three months ended September 30, 2025. The increase was primarily due to Gross profit contribution from the Viterra acquisition, partially offset by lower results in our North American softseed processing business driven by lower margins.\nNine Months Ended September 30, 2025 Compared to Nine Months Ended September 30, 2024\nSoftseed Processing and Refining segment Net sales increased 30% to $6,707 million for the nine months ended September 30, 2025. The increase was primarily due to Net sales contributions from the Acquisition of Viterra, in addition to higher average sales prices in our European business resulting from a drought in the region impacting the sunflower seed crop in the current year. The above increases were partially offset by lower volumes for both oilseeds processed and oilseeds merchandised within our legacy European and North American businesses.      \nCost of goods sold increased 40% to $6,264 million for the nine months ended September 30, 2025. The increase was primarily due to higher Net sales as well as unfavorable mark-to-market results. \nForeign exchange (losses) gains - net increased by 387% to a $43 million gain for the nine months ended September 30, 2025. The net gain in the current year is primarily the result of a weaker U.S. dollar on U.S. dollar-denominated loans payable in non-U.S. functional currency operations.\nSegment EBIT decreased 36% to $337 million for the nine months ended September 30, 2025. The decrease was due to lower Gross profit in our European and North American businesses as a result of lower margins, partially offset by Gross profit contribution from the Viterra acquisition as well as foreign currency gains as described above. \n51\nTable of \nContents\nOther Oilseeds Processing and Refining\nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n(US$ in millions, except volumes)\n2025\n2024\n% Change\n2025\n2024\n% Change\nVolumes (in thousand metric tons)\n639\n \n665 \n(4)\n%\n1,881\n \n1,912 \n(2)\n%\nNet sales\n$\n1,207\n \n$\n1,064 \n13 \n%\n$\n3,442\n \n$\n3,034 \n13 \n%\nCost of goods sold\n(1,063)\n(875)\n21 \n%\n(3,174)\n(2,576)\n23 \n%\nGross profit\n144\n \n189 \n(24)\n%\n268\n \n458 \n(41)\n%\nSelling, general and administrative expense\n(57)\n(63)\n(10)\n%\n(176)\n(185)\n(5)\n%\nForeign exchange (losses) gains – net\n(2)\n(7)\n71 \n%\n(5)\n(21)\n76 \n%\nEBIT attributable to noncontrolling interests\n(8)\n(13)\n(38)\n%\n(10)\n(30)\n(67)\n%\nOther income (expense) – net\n—\n \n(3)\n(100)\n%\n(5)\n(13)\n(62)\n%\nIncome (loss) from affiliates\n—\n \n1 \n(100)\n%\n—\n \n1 \n(100)\n%\nTotal Other Oilseeds Processing and Refining Segment EBIT\n$\n77\n \n$\n104 \n(26)\n%\n$\n72\n \n$\n210 \n(66)\n%\nThree Months Ended September 30, 2025 Compared to Three Months Ended September 30, 2024\nOther Oilseeds Processing and Refining segment Net sales increased 13%, to $1,207 million for the three months ended September 30, 2025. The increase was primarily due to higher sales prices in our tropical oils business due to higher average commodity prices, partially offset by lower volumes.\nCost of goods sold increased 21%, to $1,063 million for the three months ended September 30, 2025. The increase was primarily due to higher Net sales in addition to less favorable mark-to-market results compared to the prior period.\nSegment EBIT decreased 26%, to $77 million for the three months ended September 30, 2025. The decrease was primarily due to lower Gross profit in our tropical oils business.\nNine Months Ended September 30, 2025 Compared to Nine Months Ended September 30, 2024\nOther Oilseeds Processing and Refining segment Net sales increased 13% to $3,442 million for the nine months ended September 30, 2025. The increase was primarily due to higher sales prices in our tropical oils business due to stronger demand resulting from global biofuel mandates, partially offset by lower volumes.  \nCost of goods sold increased 23% to $3,174 million for the nine months ended September 30, 2025. The increase was primarily due to higher net sales in addition to unfavorable mark-to-market results.\nEBIT attributable to noncontrolling interests decreased\n \n67% to a loss of $10 million resulting from less favorable results attributable to noncontrolling interests in our Loders joint venture primarily due to lower results in the Europe region from the competitive market environment.   \nSegment EBIT decreased 66% to $72 million for the nine months ended September 30, 2025. The decrease was primarily due to lower Gross profit in our tropical oils business in addition to a decrease in EBIT attributable to noncontrolling interests, as described above.\n52\nTable of \nContents\nGrain Merchandising and Milling\nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n(US$ in millions)\n2025\n2024\n% Change\n2025\n2024\n% Change\nVolumes (in thousand metric tons)\n24,080\n \n8,964 \n169 \n%\n40,972\n \n28,316 \n45 \n%\nNet sales\n$\n6,428\n \n$\n2,397 \n168 \n%\n$\n11,146\n \n$\n7,831 \n42 \n%\nCost of goods sold\n(6,285)\n(2,275)\n176 \n%\n(10,845)\n(7,440)\n46 \n%\nGross profit\n143\n \n122 \n17 \n%\n301\n \n391 \n(23)\n%\nSelling, general and administrative expense\n(145)\n(68)\n113 \n%\n(266)\n(203)\n31 \n%\nForeign exchange (losses) gains – net\n(15)\n1 \n(1600)\n%\n(41)\n(10)\n310 \n%\nEBIT attributable to noncontrolling interests\n(1)\n(1)\n— \n%\n(6)\n— \n— \n%\nOther income (expense) – net\n37\n \n21 \n76 \n%\n263\n \n64 \n311 \n%\nIncome (loss) from affiliates\n2\n \n4 \n(50)\n%\n3\n \n(11)\n(127)\n%\nTotal Grain Merchandising and Milling Segment EBIT\n$\n21\n \n$\n79 \n(73)\n%\n$\n254\n \n$\n231 \n10 \n%\nThree Months Ended September 30, 2025 Compared to Three Months Ended September 30, 2024\nGrain Merchandising and Milling segment Net sales increased 168% to $6,428 million for the three months ended September 30, 2025. The increase was primarily due to Net sales contributions from the Acquisition of Viterra, in addition to higher volumes in both our global corn and global wheat businesses driven by increased export demand from North America and increased wheat demand to China, respectively. The increase was partially offset by lower average sales prices in our global wheat business, in addition to the lack of recurring sales from our North American corn milling business that was divested in the second quarter of 2025 (see \nNote 2 - Acquisitions and Dispositions\n to our condensed consolidated financial statements). \nCost of goods sold increased 176% to $6,285 million for the  three months ended September 30, 2025. The increase was primarily due to higher Net sales in addition to unfavorable mark-to-market results.\nSelling, general and administrative expense increased\n \n113% to $145 million primarily due to the Acquisition of Viterra.\nSegment EBIT decreased 73%, to $21 million for the three months ended September 30, 2025. The decrease was primarily due to higher Selling, general and administrative expense in the current period, partially offset by higher Gross profit, driven by contributions from the Acquisition of Viterra.\nNine Months Ended September 30, 2025 Compared to Nine Months Ended September 30, 2024\nGrain Merchandising and Milling segment Net sales increased 42% to $11,146 million for the nine months ended September 30, 2025. The increase was primarily due to Net sales contributions resulting from the Acquisition of Viterra, in addition to higher volumes and higher average sales prices in our global corn business, as a result of higher demand across various regions.\n \nThe above increases were partially offset by lower volumes and lower average sales price in our global wheat business driven by lower demand to China on a year-to-date basis, as well as a lack of recurring sales from Bunge's North America corn milling business that was divested in the second quarter of 2025 (see \nNote 2 - Acquisitions and Dispositions\n \nto our condensed consolidated financial statements). \nCost of goods sold increased 46% to $10,845 million for the  nine months ended September 30, 2025.\n \nThe increase was primarily due to higher Net sales in addition to unfavorable mark-to-market results.\nSelling, general and administrative expenses increased\n \n31% to $266 million for the nine months ended September 30, 2025. The increase was primarily due to the Acquisition of Viterra.\nOther income (expense) - net increased to a gain of $263 million for the nine months ended September 30, 2025. The increase was primarily due to a $155 million gain on the sale of Bunge's North America corn milling business in the second quarter of 2025. \n53\nTable of \nContents\nSegment EBIT increased 10%, to $254 million for the nine months ended September 30, 2025. The increase was primarily due to higher Other income (loss) - net, as described above, partially offset by higher Selling, general and administrative expense and lower Gross profit from losses on our ocean freight and financial services business.\nCorporate and Other\nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n(US$ in millions)\n2025\n2024\n% Change\n2025\n2024\n% Change\nNet sales\n$\n2\n \n$\n1 \n100 \n%\n$\n4\n \n$\n2 \n100 \n%\nCost of goods sold\n(13)\n(3)\n333 \n%\n(9)\n(7)\n29 \n%\nGross profit\n(11)\n(2)\n450 \n%\n(5)\n(5)\n— \n%\nSelling, general and administrative expense\n(275)\n(160)\n72 \n%\n(538)\n(489)\n10 \n%\nForeign exchange (losses) gains – net\n(7)\n2 \n(450)\n%\n8\n \n3 \n167 \n%\nEBIT attributable to noncontrolling interests\n1\n \n1 \n— \n%\n2\n \n3 \n(33)\n%\nOther income (expense) – net\n24\n \n23 \n4 \n%\n71\n \n78 \n(9)\n%\nIncome (loss) from affiliates\n—\n \n6 \n(100)\n%\n—\n \n8 \n(100)\n%\nTotal Corporate and Other EBIT\n$\n(268)\n$\n(130)\n(106)\n%\n$\n(462)\n$\n(402)\n(15)\n%\nThree Months Ended September 30, 2025 Compared to Three Months Ended September 30, 2024\nCorporate and Other EBIT decreased 106%, to a loss of $268 million for the three months ended September 30, 2025. The decrease was primarily driven by an increase in SG&A expense due to the Acquisition of Viterra as well as higher variable compensation expense and higher acquisition and integration costs associated with the Acquisition of Viterra. The Company recognized acquisition and integration costs within Corporate and Other EBIT of $101 million, and $62 million for three months ended September 30, 2025, and 2024, respectively. The decrease was also driven by lower Income from affiliates in the current period due to the 2024 sale of BP Bunge Bioenergia (see \nNote 2 - Acquisitions and Dispositions \nto our condensed consolidated financial statements). \nNine Months Ended September 30, 2025 Compared to Nine Months Ended September 30, 2024\nCorporate and Other EBIT decreased 15% to a loss of $462 million for the nine months ended September 30, 2025. The decrease was primarily driven by an increase in SG&A expense due to the Acquisition of Viterra as well as higher variable compensation expense, partially offset by overall lower acquisition and integration costs associated with the Acquisition of Viterra. The Company recognized acquisition and integration costs within Corporate and Other EBIT of $171 million, and $185 million for the nine months ended September 30, 2025, and 2024, respectively. The above EBIT decrease was also driven by lower income from affiliates in the current period due to the 2024 sale of BP Bunge Bioenergia (see \nNote 2 - Acquisitions and Dispositions \nto our condensed consolidated financial statements).  \nInterest\n - A summary of consolidated interest income and expense follows: \nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n(US$ in millions)\n2025\n2024\n% Change\n2025\n2024\n% Change\nInterest income\n$\n57\n \n$\n33 \n73 \n%\n$\n162\n \n$\n112 \n45 \n%\nInterest expense\n(202)\n(127)\n59 \n%\n(412)\n(358)\n15 \n%\nThree Months Ended September 30, 2025 Compared to Three Months Ended September 30, 2024\nInterest income increased 73%, to $57 million for the three months ended September 30, 2025. Interest expense increased 59%, to $202 million for the three months ended September 30, 2025. Higher Interest income is a result of higher balances in marketable securities and other short-term investments related to funding strategies in Argentina in the current year. Higher Interest expense is a result of higher debt levels, driven by the financing of the Viterra Acquisition. \n54\nTable of \nContents\nNine Months Ended September 30, 2025 Compared to Nine Months Ended September 30, 2024\nInterest income increased 45% to $162 million for the nine months ended September 30, 2025. Interest expense increased 15% to $412 million for the nine months ended September 30, 2025. Higher Interest income is the result of higher average balances in cash and cash equivalents as well as higher balances in marketable securities and other short-term investments related to funding strategies in Argentina in the current year. Higher Interest expense is a result of higher debt levels, driven by the financing of the Viterra Acquisition.  \nLiquidity and Capital Resources\nOur main financial objectives are to prudently manage financial risks, ensure consistent access to liquidity and minimize cost of capital in order to efficiently finance our business and maintain balance sheet strength. We generally finance our ongoing operations with cash flows generated from operations, issuances of commercial paper, borrowings under various bilateral and syndicated revolving credit facilities, term loans, and proceeds from the issuance of senior notes. Acquisitions and long-lived assets are generally financed with a combination of equity and long-term debt.\nWorking Capital \nAs of\n(US$ in millions, except current ratio)\nSeptember 30, 2025\nSeptember 30, 2024\nDecember 31, 2024\nCash and cash equivalents\n$\n1,315\n \n$\n2,836 \n$\n3,311 \nTrade accounts receivable, net\n3,494\n \n2,100 \n2,148 \nInventories\n13,312\n \n7,465 \n6,491 \nOther current assets\n(1)\n8,598\n \n3,518 \n4,008 \nTotal current assets\n$\n26,719\n \n$\n15,919 \n$\n15,958 \nShort-term debt\n$\n4,446\n \n$\n755 \n$\n875 \nCurrent portion of long-term debt\n1,334\n \n663 \n669 \nTrade accounts payable\n4,780\n \n3,211 \n2,777 \nCurrent operating lease obligations\n491\n \n288 \n286 \nOther current liabilities\n(2)\n5,046\n \n2,774 \n2,828 \nTotal current liabilities\n$\n16,097\n \n$\n7,691 \n$\n7,435 \nWorking capital\n(3)\n$\n10,622\n \n$\n8,228 \n$\n8,523 \nCurrent ratio\n(3)\n1.66\n \n2.07 \n2.15 \n(1)\n    Comprises Time deposits under trade structured finance program, Assets held for sale and Other current assets\n(2)\n    Comprises Letter of credit obligations under trade structured finance program, Liabilities held for sale and Other current liabilities\n(3)\n    Working capital is defined as Total current assets less Total current liabilities; Current ratio represents Total current assets divided by Total current liabilities\nWorking capital was $10,622 million at September 30, 2025, an increase of $2,099 million from working capital of $8,523 million at December 31, 2024, and an increase of $2,394 million from working capital of $8,228 million at September 30, 2024.\nCash and Cash Equivalents -\n Cash and cash equivalents were $1,315 million at September 30, 2025, a decrease of $1,996 million from $3,311 million at December 31, 2024, and a decrease of $1,521 million from $2,836 million at September 30, 2024. Cash balances are managed in accordance with our investment policy, the objectives of which are to preserve the principal value of our cash assets, maintain a high degree of liquidity, and deliver competitive returns subject to prevailing market conditions. Cash balances are typically invested in short-term deposits, money market funds, and commercial paper programs with highly-rated institutions and in U.S. government securities. Please refer to the \nCash Flows\n section of this report, below, for further details regarding the factors giving rise to the change in Cash and cash equivalents during the nine months ended September 30, 2025.\n55\nTable of \nContents\nTrade accounts receivable, net\n - Trade accounts receivable, net were $3,494 million at September 30, 2025, an increase of $1,346 million from $2,148 million at December 31, 2024, and an increase of $1,394 million from $2,100 million at September 30, 2024. The increase from December 31, 2024 and September 30, 2024 was primarily due to an increase of receivables outstanding as of September 30, 2025 from the Acquisition of Viterra\n \nand increased Net sales in the current period driven by factors described in the\n Segment Overview & Results of Operation\ns above.\nInventories  -\n  Inventories were $13,312 million at September 30, 2025, an increase of $6,821 million from $6,491 million at December 31, 2024, and an increase of $5,847 million from $7,465 million at September 30, 2024. The increase from December 31, 2024 and September 30, 2024 was primarily due to increased inventory balances from the Acquisition of Viterra. In addition, the increase from December 31, 2024 was due to increased volumes in conjunction with the timing of the South American harvest. The increase from September 30, 2024 was also due to higher volumes, partially offset by certain lower average prices, including soybeans.\nRMI comprise agricultural commodity inventories, such as soybeans, soybean meal, soybean oil, palm oil, corn, and wheat that are readily convertible to cash because of their commodity characteristics, widely available markets and international pricing mechanisms. Total RMI reported at fair value was\n \n$11,514 million, $5,224 million, and $6,195 million at September 30, 2025, December 31, 2024, and September 30, 2024, respectively (see \nNote 5 - Inventories \nto our condensed consolidated financial statements).\nOther current assets\n - Other current assets were $8,598 million at September 30, 2025, an increase of $4,590 million from $4,008 million at December 31, 2024, and an increase of $5,080 million from $3,518 million at September 30, 2024. The increase from December 31, 2024 and  September 30, 2024 was primarily due to an increase of Other current assets as of September 30, 2025 from the Acquisition of Viterra. In addition, the increase from December 31, 2024 was also attributable to an increase in marketable securities and other short term investments as a result of strategic investment opportunities in South America, an increase in prepaid commodity purchase contracts in conjunction with the timing of the South American harvest, higher assets held for sale related to our European margarines and spreads business ( see \nNote 2 - Acquisitions and Dispositions\n to our condensed consolidated financial statements), an increase in margin deposits, and an increase in prepaid expenses. These increases were partially offset by the collection of an insurance recovery receivable related to business interruption resulting from the Ukraine-Russia war (see \nNote 6 - Other Current Assets \nto our condensed consolidated financial statements), and a decrease in disposition receivable reflecting the collection of a deferred payment in connection with the sale of BP Bunge Bioenergia, partially offset by the recognition of a disposition receivable in connection with the sale of 40% of our Spanish operating subsidiary (see \nNote 2 - Acquisitions and Dispositions \nto our condensed consolidated financial statements). The increase from September 30, 2024 was also due to an increase in marketable securities and other short term investments as a result of strategic investment opportunities in South America, higher assets held for sale related to our European margarines and spreads business, higher unrealized gains on derivative contracts as a result of commodity price changes, an increase in secured advances to suppliers as market conditions in Brazil have led to an increase in new advances in the current period, and\n \nthe recognition of a disposition receivable in connection with the sale of 40% of our Spanish operating subsidiary.\nShort-term debt\n - Short-term debt, including the Current portion of long-term debt, was $5,780 million at September 30, 2025, an increase of $4,236 million from $1,544 million at December 31, 2024, and an increase of $4,362 million from $1,418 million at September 30, 2024. The higher short-term debt level at September 30, 2025, compared to December 31, 2024 and September 30, 2024 was due to increased borrowings under the commercial paper program and increased borrowings by operating companies on local bank facilities to fund working capital requirements, which includes additional Short-term debt outstanding as of September 30, 2025 from the Acquisition of Viterra. In addition, increased short-term debt levels at September 30, 2025, compared to December 31, 2024 and September 30, 2024, resulted from an increase in the Current portion of long-term debt associated with two tranches of senior notes maturing in 2026, partially offset by the repayment of $600 million senior notes which matured in the current period. \nTrade accounts payable \n- Trade accounts payable were $4,780 million at September 30, 2025, an increase of $2,003 million from $2,777 million at December 31, 2024, and an increase of $1,569 million from $3,211 million at September 30, 2024. The increase from December 31, 2024 and September 30, 2024 was primarily due to an increase in payables outstanding as of September 30, 2025 from the Acquisition of Viterra, higher inventory volumes, and timing of payments, partially offset by lower average commodity prices. \nOther current liabilities \n- Other current liabilities were $5,046 million at September 30, 2025, an increase of $2,218 million from $2,828 million at December 31, 2024, and an increase of $2,272 million from $2,774 million at September 30, 2024. The increase from December 31, 2024 and September 30, 2024 was primarily due to an increase of Other current liabilities outstanding as of September 30, 2025 from the Acquisition of Viterra. In addition, the increase from December 31, 2024 is due to higher dividends payable (see \nNote 17 - Equity \nto our condensed consolidated financial statements), higher \n56\nTable of \nContents\nliabilities held for sale related to our European margarines and spreads business (see \nNote 2 - Acquisitions and Dispositions \nto our condensed consolidated financial statements), and higher income taxes payable, partially offset by lower advances on sales driven by timing of receipts in North America. The additional increase from September 30, 2024, was due to higher dividends payable, higher liabilities held for sale related to our European margarines and spreads business, and an increase in advances on sales, partially offset by lower unrealized losses on derivative contracts. \nDebt\nAs highlighted in \nNote 13 - Debt \nand discussed further below, we utilize a variety of debt financing structures to maintain financial flexibility to meet our various financial objectives.   \nRevolving Credit Facilities —\n At September 30, 2025, we had $8,665 million unused and available committed borrowing capacity, comprised of committed revolving credit facilities. The following table summarizes these facilities as of the periods presented:\n(US$ in millions)\n \n Committed\nCapacity \nBorrowings Outstanding\nRevolving Credit Facilities\n(1)\nMaturities\nSeptember 30, 2025\nSeptember 30, 2025\nDecember 31, 2024\n$1.1 Billion 364-day Revolving Credit Agreement\n2026\n$\n1,100\n \n$\n—\n \n$\n— \n$3.2 Billion 5-year Revolving Credit Agreement\n2029\n3,200\n \n—\n \n— \n$3.5 Billion 3-year Revolving Facility Agreement \n2026\n3,500\n \n—\n \n— \n$865 Million 5-year Revolving Credit Agreement \n2026\n865\n \n—\n \n— \nTotal Revolving Credit Facilities\n$\n8,665\n \n$\n—\n \n$\n— \n(1)\nSee \nNote 13 - Debt \nto our condensed consolidated financial statements for a description of current period activity related to these facilities, including October 2025 actions resulting in extended maturities and an increase in total committed capacity to $9,665 million.  \nCommercial Paper Program - \nThe following table summarizes the facility as of the periods presented:\n(US$ in millions)\n Program\nCapacity \nBorrowings Outstanding\nCommercial Paper Program\n(1)\nSeptember 30, 2025\nSeptember 30, 2025\nDecember 31, 2024\n$3 Billion Commercial Paper Program\n$\n3,000\n \n$\n2,295\n \n$\n— \n(1)\nThe short-term credit ratings of the commercial paper program require Bunge to keep same day unused committed borrowing capacity under its long-term committed credit facilities in an amount greater or equal to the amount of commercial paper issued and outstanding.\nShort and long-term debt —\nAs of\nUS$ in millions\nSeptember 30, 2025\nSeptember 30, 2024\nDecember 31, 2024\nShort-term debt\n$\n4,446\n \n$\n755 \n$\n875 \nLong-term debt, including current portion\n11,143\n \n5,440 \n5,363 \nTotal debt \n$\n15,589\n \n$\n6,195 \n$\n6,238 \nNine Months Ended September 30, 2025\nNine Months Ended September 30, 2024\nYear Ended\nDecember 31, 2024\nAverage total debt outstanding\n$\n10,025\n \n$\n5,267 \n$\n5,480 \nOur total debt was $15,589 million at September 30, 2025, an increase of $9,351 million from $6,238 million at December 31, 2024, and an increase of $9,394 million from $6,195 million at September 30, 2024. The higher total debt level at September 30, 2025, compared to December 31, 2024 and September 30, 2024 was primarily due to an increase in short-term borrowings as described above and an increase in long-term debt, including current portion, resulting from the \n57\nTable of \nContents\nissuance of  two tranches of senior notes (\"2025 Senior Notes\") for an aggregate principle amount of $1.3 billion in August 2025 and borrowings totaling $2.3 billion on term loans due in 2028 drawn in June 2025 to finance the Acquisition of Viterra. In addition in the third quarter of 2025, Bunge completed exchange offers which resulted in exchanging $1.92 billion of existing senior notes for new notes issued by BLFC and completed the European consent solicitation to become the issuer and guarantor of a 700 million \nEuro \naggregate principal amount of 1.000% senior unsecured note due 2028. These increases were partially offset by the repayment of $600 million senior notes which matured in the current period. See \nNote 13 - Debt \nto our condensed consolidated financial statements for further information.\nFrom time to time, through our financing subsidiaries, we enter into bilateral short-term credit lines as necessary. At September 30, 2025, there were $100 million borrowings outstanding under these bilateral short-term credit lines. \nIn addition, Bunge's operating companies had $2,051 million, $875 million, and $755 million in short-term borrowings outstanding from local bank facilities at September 30, 2025, December 31, 2024 and September 30, 2024, respectively, to support working capital requirements. The outstanding borrowings as of September 30, 2025 include short-term borrowings from local bank facilities from the Acquisition of Viterra.\nAs described in \nNote 13 - Debt \nto our condensed consolidated financial statements, on June 30, 2025, in preparation for closing of the Viterra Acquisition we drew a total of $2.3 billion. The proceeds were used, together with proceeds from other sources and existing Cash and cash equivalents to fund a portion of the cash consideration for Bunge’s Acquisition of Viterra and to repay a portion of certain Viterra debt settled at the closing of the Acquisition, including, in each case, related fees and expenses, and, with any remaining amounts, for general corporate purposes. Further, on August 4, 2025, Bunge completed the sale and issuance of two tranches of senior notes issued by Bunge Limited Finance Corp. (\"BLFC\") for a total aggregate principal amount of $1.3 billion.\nRegistered Senior Notes —\n BLFC, a wholly owned finance subsidiary of Bunge, had the following outstanding debt securities (collectively referred to as the \"BLFC Notes\") registered under the requirements of the Securities Act of 1933, as amended, at September 30, 2025.\n(US$ in millions)\nAggregate Principal Amount Outstanding\nBalance Outstanding\n2.00% Senior Notes due 2026\n$\n580\n \n$\n572\n \n3.25% Senior Notes due 2026\n700\n \n699\n \n4.90% Senior Notes due 2027\n440\n \n443\n \n3.75% Senior Notes due 2027\n600\n \n599\n \n4.10% Senior Notes due 2028\n400\n \n398\n \n4.20% Senior Notes due 2029\n800\n \n794\n \n4.55% Senior Notes due 2030\n650\n \n645\n \n3.20% Senior Notes due 2031\n599\n \n556\n \n2.75% Senior Notes due 2031\n1,000\n \n993\n \n5.25% Senior Notes due 2032\n300\n \n307\n \n4.65% Senior Notes due 2034\n800\n \n791\n \n5.15% Senior Notes due 2035\n650\n \n643\n \nBunge unconditionally guarantees BLFC's obligations with respect to the BLFC Notes. Bunge's guarantees are unsecured and unsubordinated obligations of Bunge and rank equally with all other unsecured and unsubordinated obligations of Bunge. The guarantees provide that in the event of a default in payment of principal of, or interest on, BLFC Notes of a particular series, the holder of such series of senior debt securities may institute legal proceedings directly against Bunge to enforce the applicable guarantee without first proceeding against BLFC.   \n58\nTable of \nContents\nAs a holding company, Bunge is dependent upon dividends, loans, or advances or other intercompany transfers of funds from its subsidiaries to meet its obligations, including its obligations under the guarantee. The ability of certain of its subsidiaries to pay dividends and make other payments to Bunge may be restricted by, among other things, applicable laws, as well as agreements to which those subsidiaries may be party. Therefore, the ability of Bunge to make payments with respect to the guarantee may be limited. The BLFC Notes effectively rank junior to all liabilities of Bunge's subsidiaries (other than BLFC). In the event of a bankruptcy, liquidation, or dissolution of a subsidiary (other than BLFC) and following payment of its liabilities, the subsidiary may not have sufficient assets remaining to make payments to Bunge as a shareholder or otherwise.   \n    Credit Ratings\n \n—\n Bunge’s debt ratings and outlook by major credit rating agencies at September 30, 2025, were as follows:\n \nShort-term Debt\n (1)\nLong-term Debt\nOutlook\nStandard & Poor’s\nA-2\nA-\nStable\nMoody’s\nP-2\nBaa1\nStable\nFitch\n \nF-2\nBBB+\nStable\n(1)    \nShort-term debt rating applies only to the commercial paper program with BLFC as the issuer. \nFollowing the announcement of the Acquisition, all three rating agencies reviewed our credit ratings and published updated credit opinions on us, reflecting their views of the credit profile of the Company both on a standalone basis, and a pro-forma at closing basis. Recent rating agency actions include the following:\n•\nStandard & Poor's upgraded Bunge’s credit rating to A- on July 2, 2025 and removed all outlooks from CreditWatch Positive and assigned a stable outlook;\n•\nStandard & Poor's also assigned a A- issue-level rating to Bunge's newly committed $2 billion unsecured term loan maturing 2028 and Bunge's previously issued $2 billion Senior Notes;\n•\nMoody’s upgraded Bunge’s long-term debt credit rating to Baa1 on August 1, 2024 with stable outlook; and affirmed the rating on July 28, 2025.\n•\nFitch upgraded Bunge’s long-term debt credit rating to BBB+ on September 5, 2024 with stable outlook; and affirmed the rating on July 2, 2025.\nOur debt agreements do not have any credit rating downgrade triggers that would accelerate maturity of our debt. However, credit rating downgrades would increase borrowing costs under our syndicated credit facilities (a credit rating upgrade, on the other hand, would reduce our borrowing cost) and, depending on their severity, could impede our ability to obtain credit facilities or access the capital markets in the future on competitive terms. A significant increase in our borrowing costs could impair our ability to compete effectively in our business relative to competitors with higher credit ratings.\nOur credit facilities and certain senior notes require us to comply with specified financial covenants including minimum current ratio, maximum debt to capitalization ratio and limitations on secured indebtedness. We were in compliance with these covenants as of September 30, 2025.\n59\nTable of \nContents\nEquity\nTotal equity is set forth in the following table:\n(US$ in millions)\nSeptember 30,\n2025\nDecember 31, 2024\nEquity:\n \n \nRegistered shares\n$\n2\n \n$\n1 \nAdditional paid-in capital\n10,871\n \n5,325 \nRetained earnings\n13,053\n \n12,838 \nAccumulated other comprehensive income (loss)\n(6,107)\n(6,702)\nTreasury shares, at cost \n(2,051)\n(1,549)\nTotal Bunge shareholders’ equity\n15,768\n \n9,913 \nNoncontrolling interest\n1,462\n \n1,032 \nTotal equity\n$\n17,230\n \n$\n10,945 \nTotal Bunge shareholders’ equity was $15,768 million at September 30, 2025, compared to $9,913 million at December 31, 2024, an increase of $5,855 million. The increase was primarily due to Bunge stock issued as consideration in the Acquisition of Viterra of $5,340 million, $721 million of Net income (loss) attributable to Bunge, $544 million of income in Other comprehensive income (loss) resulting from favorable foreign exchange translation adjustments, and a $240 million increase resulting from the sale of a redeemable noncontrolling interest in our Spanish operating subsidiary (see \nNote 2 - Acquisitions and Dispositions \nto our condensed consolidated financial statements) impacting both Additional paid-in capital and Accumulated other comprehensive income (loss). These increases were partially offset by share repurchases of $545 million and $502 million\n \nof declared dividends to shareholders, as described in \nNote 17 - Equity\n \n \nto our condensed consolidated financial statements\n. \nNoncontrolling interests increased to $1,462 million at September 30, 2025, compared to $1,032 million at December 31, 2024, an increase of $430 million. The increase is primarily due to acquired Noncontrolling interests of $441 million from the Acquisition of Viterra, $30 million of income in Other comprehensive income (loss) resulting from favorable foreign exchange translation adjustments as well as $30 million in capital contributions received from minority interest shareholders. The increase was partially offset by an $89 million reduction on the acquisition of noncontrolling interest in Terminal de Granéis de Santa Catarina (\"TGSC\") (see N\note 8 - Investment in Affiliates and Variable Interest Entities \nto our condensed consolidated financial statements).\nShare repurchase program \n- As noted in \nNote 17 - Equity \nto our condensed consolidated financial statements, on November 13, 2024, Bunge Global SA's Board of Directors approved the expansion of an existing share repurchase program by an additional $500 million, bringing total authorizations under the program since inception to $2.7 billion. The program continues to have an indefinite term. As of September 30, 2025, a total of 26,340,516 shares were repurchased under the program for $2.4 billion with an aggregate purchase authorization of approximately $255 million remaining outstanding for repurchases under the program. During the three and nine months ended September 30, 2025, Bunge repurchased 6,672,777 shares for $545 million.\n60\nTable of \nContents\nCash Flows\nNine Months Ended\nSeptember 30,\n(US$ in millions)\n2025\n2024\nCash provided by (used for) operating activities\n$\n(503)\n$\n847 \nCash provided by (used for) investing activities\n(5,524)\n(957)\nCash provided by (used for) financing activities\n4,021\n \n376 \nEffect of exchange rate changes on cash and cash equivalents and restricted cash\n3\n \n— \nNet increase (decrease) in cash and cash equivalents and restricted cash\n$\n(2,003)\n$\n266 \nOur cash flows from operations vary depending on, among other items, Net income and the market prices and timing of purchases and sales of our inventories. Generally, during periods when commodity prices are rising, our Agribusiness operations require increased use of cash to support working capital to acquire inventories and fund daily settlement requirements on exchange traded futures that we use to minimize price risk related to purchases and sales of our inventories.\nDuring the nine months ended September 30, 2025, our cash and cash equivalents and restricted cash decreased by $2,003 million, compared to an increase of $266 million during the nine months ended September 30, 2024, as further explained below.\nOperating\n: Cash used for operating activities was $503 million for the nine months ended September 30, 2025, a decrease of $1,350 million, compared to cash provided by operating activities of $847 million for the nine months ended September 30, 2024. The decrease was primarily driven by net changes in working capital, specifically changes in net unrealized (gains) losses on derivative contracts, funds used for secured advances to suppliers, and an increase in receivables outstanding, partially offset by increased trade accounts payable and accrued liabilities, as discussed in \nWorking Capital\n section above.\nCertain of our non-U.S. operating subsidiaries are primarily funded with U.S. dollar-denominated debt, while currency risk is hedged with U.S. dollar-denominated assets. The functional currency of our operating subsidiaries is generally the local currency. The financial statements of our subsidiaries are calculated in the functional currency, and when the local currency is the functional currency, translated into U.S. dollars. U.S. dollar-denominated loans are remeasured into their respective functional currencies at exchange rates at the applicable balance sheet date. Also, certain of our U.S. dollar functional operating subsidiaries outside the U.S. are partially funded with local currency borrowings, while the currency risk is hedged with local currency denominated assets. Local currency loans in U.S. dollar functional currency subsidiaries outside the U.S. are remeasured into U.S. dollars at the exchange rate on the applicable balance sheet date. The resulting gain or loss is included in our condensed consolidated statements of income as Foreign exchange (losses) gains – net. For the nine months ended September 30, 2025, we recorded a foreign currency gain on our debt of $251 million, which was included as an adjustment to reconcile Net income to Cash provided by (used for) operating activities in the line item Foreign exchange (gain) loss on net debt in our condensed consolidated statements of cash flows. These adjustments are required as the gains and losses are non-cash items that arise from financing activities and therefore will have no impact on cash flows from operations.\nInvesting: \nCash used for investing activities was $5,524 million for the nine months ended September 30, 2025, an increase of $4,567 million, compared to cash used for investing activities of $957 million for the nine months ended September 30, 2024. The increase in cash used was primarily due to cash payments for the Acquisition of Viterra, net of cash acquired, of $4,116 million in addition to higher net payments for investments, as a result of certain cash deployment strategies in Argentina, and higher spend on capital projects. The increase was partially offset by the current period receipts of $470 million in proceeds from the sale of Bunge's corn milling business in North America and $457 million, net of cash, related to the EU Oilseeds divestment, both as further described in \nNote 2 - Acquisitions and Dispositions.\nFinancing\n: Cash provided by financing activities was $4,021 million for the nine months ended September 30, 2025, an increase of $3,645 million, compared to cash provided by financing activities of $376 million for the nine months ended September 30, 2024.\n \nThe increase was primarily due to an increase in net cash proceeds of short and long-term debt of $3,425 million resulting from our use of the commercial paper program and draws on long term debt facilities to both fund the Acquisition of Viterra, as well as for current and future working capital requirements. Additionally, the increase was due to $206 million in proceeds received from the sale of redeemable noncontrolling interest related to our Spanish \n61\nTable of \nContents\noperating subsidiary (see \nNote 2 - Acquisitions and Dispositions \nto our condensed consolidated financial statements) in addition to less cash used for share repurchases in the current period compared to the prior period.\n \nThese increases were partially offset by an $18 million payment for the acquisition of noncontrolling interest in TGSC (see \nNote 8 - Investment in Affiliates and Variable Interest Entities \nto our condensed consolidated financial statements). \nOff-Balance Sheet Arrangements\nPlease refer to\n Note 15 - Commitments and Contingencies \nto our condensed consolidated financial statements for\n \ndetails concerning our off-balance sheet arrangements that have or are reasonably likely to have a material current or future effect on our financial condition, changes in financial condition, revenues or expenses, results of operations, liquidity, capital expenditures, or capital resources. \nDividends\nWe paid a regular quarterly cash dividend distribution of $0.70 per share on September 2, 2025, to shareholders of record on August 19, 2025. On May 15, 2025, shareholders of Bunge Global SA approved a cash dividend distribution in the amount of $2.80 per share, payable in four equal quarterly installments of $0.70 per share beginning in the second quarter of fiscal year 2025 and ending in the first quarter of fiscal year 2026. The $0.70 per share dividend distribution represents a $0.02, or 3%, increase from the Company's previously approved quarterly cash dividend declared of $0.68 per share. \nCritical Accounting Policies and Estimates\nCritical accounting policies are defined as those policies that are significant to our financial condition and results of operations and require management to exercise significant judgment. For a complete discussion of our accounting policies, see Note 1 to our Annual Report on Form 10-K for the year ended December 31, 2024, filed with the Securities and Exchange Commission on February 20, 2025. For recent accounting pronouncements refer to \nNote 1 - Basis of Presentation, Principles of Consolidation, And Significant Accounting Policies\n, to the condensed consolidated financial statements in this Quarterly Report on Form 10-Q. \n62\nTable of \nContents"
}