{
  "source_file": "bg-20241231.htm",
  "form_type": "10-K",
  "item1": "Item 1.    \nBusiness\nBusiness Overview\nWe are a leading global agribusiness and food company with integrated operations that stretch from farmer to consumer. We believe we are a leading:\n•\nglobal oilseed processor and producer of vegetable oils and protein meals, based on processing capacity;\n•\nglobal grain processor, based on volume;\n•\nseller of packaged plant-based oils worldwide, based on sales; and\n•\nproducer and seller of wheat flours, bakery mixes, and corn-based products in North and South America, based on volume. \nWe conduct our operations via four reportable segments: Agribusiness, Refined and Specialty Oils, Milling, and Sugar and Bioenergy, organized based upon their similar economic characteristics, products and services offered, production processes, types and classes of customer, and distribution methods. The Company’s remaining operations are not reportable segments and are classified as Corporate and Other.\nWe further organize these reportable segments into Core operations and Non-core operations. Core operations comprise our Agribusiness, Refined and Specialty Oils, and Milling segments.\nOur Agribusiness segment is an integrated, global business principally involved in the purchase, storage, transportation, processing and sale of agricultural commodities and commodity products. Our Agribusiness operations and assets are located in North and South America, Europe, and Asia-Pacific, and we have merchandising and distribution offices throughout the world.\nThe Refined and Specialty Oils segment includes businesses that sell vegetable oils and fats, including cooking oils, shortenings, specialty ingredients, and renewable diesel feedstocks. The operations and assets of our Refined and Specialty Oils segment are primarily located in North and South America, Europe and Asia-Pacific. \nThe Milling segment includes businesses that sell wheat flours, bakery mixes, and corn-based products. The operations and assets of our Milling segment are located in North and South America. During the third quarter of 2022, we completed the sale of our wheat milling business in Mexico.\nNon-core operations includes our Sugar and Bioenergy segment, which was primarily comprised of our previously owned 50% interest in the BP Bunge Bioenergia joint venture. On October 1, 2024, we completed the sale of our 50% interest in BP Bunge Bioenergia to BP Biofuels Brazil Investment Limited (\"BP\").\nPending Business Combination with Viterra Limited  \nOn June 13, 2023, Bunge Limited entered into a definitive business combination agreement (the \"Business Combination Agreement\") with Viterra and its shareholders, including certain affiliates of Glencore PLC (\"Glencore\"), Canada Pension Plan Investment Board (\"CPP Investments\"), and British Columbia Investment Management Corporation (\"BCI\") (collectively, the \"Viterra Shareholder Group\"), to acquire Viterra in a stock and cash transaction (the \"Acquisition\"). Bunge Limited shareholders approved the Acquisition at an extraordinary general meeting held on October 5, 2023. \nViterra operates a leading network of agricultural storage, processing and transport assets connecting producers to consumers with sustainable, traceable and quality-controlled agricultural products. The Acquisition is expected to create an innovative global agribusiness company well-positioned to meet the demands of increasingly complex markets and better serve farmers and end-customers.\nPursuant to the terms of the Business Combination Agreement, the Viterra Shareholder Group are anticipated to receive approximately 65.6 million of registered shares of Bunge, with an aggregate value of approximately $5.1 billion as of December 31, 2024 and receive approximately $2.0 billion in cash (collectively, the \"Transaction Consideration\"), in return for 100% of the outstanding equity of Viterra. The determination of the final value of the Transaction Consideration will depend on the Company’s share price at the time of closing. Upon completion of the transaction, the Viterra Shareholder Group are expected to own approximately 30% of the combined Bunge company on a fully diluted basis, before giving effect to any share repurchases by Bunge occurring after June 13, 2023.\nThe Acquisition is subject to the satisfaction of regulatory approvals and other customary closing conditions. The  Acquisition is expected to receive the remaining regulatory approvals and close in the next few months. The Business \n5\nTable of Contents\nCombination Agreement may be terminated by mutual written consent of the parties and includes certain customary termination rights. If the Business Combination Agreement is terminated in connection with certain circumstances relating to the failure to obtain certain antitrust and competition clearances that are conditions to closing, Bunge would be obligated to pay the Viterra Shareholder Group a fee of $400 million in the aggregate.\nHistory and Corporate Information\nWe trace our history back to 1818 when we were founded as a trading company in Amsterdam, The Netherlands. We are a holding company and substantially all of our operations are conducted through our subsidiaries. \nBunge Global is incorporated under Swiss law as a stock corporation (\nAktiengesellschaft\n) and domiciled in Geneva, Switzerland. The change of the jurisdiction of incorporation of our group holding company from Bermuda to Switzerland was completed on November 1, 2023. In connection with the Redomestication, the shareholders of Bunge Limited became, on a one-for-one basis, the holders of all the issued and outstanding registered shares of Bunge Global. \nBunge Global is recorded in the Commercial Register of the Canton of Geneva with enterprise registration number CHE-318.451.510. Our registered office and principal executive offices are located at Route de Florissant 13, 1206 Geneva, Switzerland. Our corporate headquarters is located at 1391 Timberlake Manor Parkway, Chesterfield, Missouri, 63017, United States of America, and our telephone number is (314) 292-2000.\nCore Segments\nAgribusiness Segment\nOverview\n—Our Agribusiness segment is an integrated, global business involved in purchasing, storing, transporting, processing, and selling agricultural commodities and commodity products while managing risk across various value chains. The principal agricultural commodities that we handle in this segment are oilseeds, primarily soybeans, rapeseed, canola, and sunflower seed, and grains, primarily wheat and corn. We process oilseeds into vegetable oils and protein meals, principally for the food, animal feed and biofuel industries, through a global network of facilities. Our footprint is well balanced, with approximately 31% of our processing capacity located in North America, 27% in South America, 25% in Europe and 17% in Asia-Pacific.\nRecent Acquisitions\n—On October 10, 2023, we entered into a definitive share purchase agreement with CJ CheilJedang Corporation and STIC CJ Global Investment Corporate Partnership Private Equity Fund to acquire 100% of outstanding equity of CJ Latam Participações Ltda. and CJ Selecta S.A. (collectively, \"CJ\"). Operations of CJ primarily consist of an oilseed processing facility located in Brazil. The acquisition is expected to close in early 2025, subject to customary closing conditions.\nCustomers\n—We sell agricultural commodities and processed commodity products to customers throughout the world. The principal purchasers of our oilseeds, grains, and oilseed meal are animal feed manufacturers, livestock producers, wheat and corn millers, and other oilseed processors. As a result, our agribusiness operations generally benefit from global demand for protein, primarily poultry and pork products. The principal purchasers of the unrefined vegetable oils produced in this segment are our own refined and specialty oils businesses, third-party edible oil processors, which use these oils as raw materials in the production of edible oil products for the food service, and the food processor and retail markets, as well as biofuel companies, which use the oil as feedstock for biofuel production.\nDistribution and Logistics\n—We have developed an extensive global logistics network to transport our products, including trucks, railcars, river barges, and ocean freight vessels. Typically, we either lease the transportation assets or contract with third parties for these services. To better serve our customer base and develop our global distribution and logistics capabilities, we own or operate either directly or through joint venture arrangements, various port terminal facilities, including in Brazil, Argentina, the United States, Canada, Latvia, Ukraine, France, Poland, Vietnam, and Australia.\nFinancial Services and Activities\n—We offer various financial services, principally trade structured finance and financial risk management services, to customers and other third parties. Our trade structured finance operations primarily leverage our international trade flows to generate trade finance derived liquidity in emerging markets for third parties. Our financial risk management services include structuring and marketing risk management products to enable agricultural producers and end users of commodities to manage commodity price risk exposures. We also engage in foreign exchange and other financial instrument trading via our financial services business. Additionally, we provide financing services to farmers, primarily in Brazil, from whom we purchase soybeans and other agricultural commodities. Our farmer financing activities are an integral part of our grain and oilseed origination activities as they help assure the annual supply of raw materials for our Brazilian agribusiness operations.\nBiodiesel\n—We own and operate conventional biodiesel facilities in Europe and Brazil\n \nand have equity method investments in conventional biodiesel producers in Europe and Argentina. This business is complementary to our core \n6\nTable of Contents\nAgribusiness operations as in each case we supply some of the raw materials (refined or partially refined vegetable oil) used in their production processes. \nRaw Materials\n—We purchase oilseeds and grains either directly from farmers or indirectly through intermediaries. Although the availability and price of agricultural commodities may, in any given year, be affected by unpredictable factors such as weather, government programs and policies, and farmer planting and selling decisions, our operations in major crop growing regions have enabled us to source adequate raw materials for our operational needs.\nCompetition\n—Due to their commodity nature, markets for our products are highly competitive and subject to product substitution. Competition is principally based on price, quality, product and service offerings, and geographic location. Major competitors include but are not limited to: Archer Daniels Midland Co. (\"ADM\"), Cargill Incorporated (\"Cargill\"), Louis Dreyfus Company B.V., Wilmar International Limited (\"Wilmar\"), and COFCO International.\nRefined and Specialty Oils Segment\nOverview\n—We primarily sell our refined and specialty oil products to food processors, food service companies, renewable diesel producers, and retail outlets. The principal raw materials used in our Refined and Specialty Oils segment are various crude and further processed vegetable oils and fats. These raw materials are mostly agricultural commodities that we either produce or purchase from third parties. We believe that our global integrated business model enables us to realize synergies among our Agribusiness, Refined and Specialty Oils, and Milling segments through raw material procurement, logistics, risk management and the co-location of industrial facilities, enabling us to supply customers with reliable, high-quality products on a global basis. As many of the products we sell in our Refined and Specialty Oils segment are staple foods or ingredients, these businesses generally benefit from global population and income growth rates. Additionally, our businesses that sell vegetable oils as feedstock to the renewable diesel industry generally benefit from increased emphasis on environmental sustainability, including government incentives and mandates aimed at increasing the percentage of fuels stemming from renewable sources, and increased production from the renewable diesel industry.\nRecent Acquisitions\n—In April 2023, Bunge, through our 80% ownership of the Bunge Loders Croklaan (\"Loders\") joint venture with IOI Corporation Berhad, completed our purchase of a port-based refinery located in Avondale, Louisiana in the United States. The facility has multi-oil refining capabilities and provides a scalable, complementary addition to our North America footprint. In 2024, we broke ground on a project to expand the facility’s production capacity.\nProducts\n—Our refined and specialty oil products include packaged and bulk oils and fats, including cooking oils, shortenings, margarines, renewable diesel feedstocks, and other products derived from the vegetable oil refining process. We primarily use soybean, sunflower, rapeseed, and canola oil that we produce in our Agribusiness segment processing operations as raw materials in this business. We also refine and fractionate palm oil, palm kernel oil, coconut oil, and shea butter, and blend and refine olive oil. Additionally, we produce specialty ingredients derived from vegetable oils, such as lecithin, which is used as an emulsifier in a broad range of food products. We are a leading seller of packaged vegetable oils worldwide, based on sales. We have refined and specialty oils refining and packaging facilities in North America, South America, Europe, Asia-Pacific, and Africa. Our refined and specialty oils business comprises our wholly-owned refined oils business in North America, other business to business (\"B2B\") and business to consumer (\"B2C\") refined and specialty oils offerings in South America, Europe and Asia-Pacific, and our 80% ownership interest in our Loders joint venture with IOI Corporation Berhad.\nIn Brazil, our retail edible oil brands include \nSoya\n, the leading consumer packaged vegetable oil brand, as well as \nSalada\n. Further, we are a leading supplier of shortenings to the food processor market.\nIn the United States and Canada, we primarily provide product offerings to food processors and food service companies, and we sell refined vegetable oils as feedstock to the renewable diesel industry. Specifically, we offer food manufacturers, bakeries, confectionaries, and food service operators high-quality solutions to fit their goals, such as delivering desired tastes and textures, or reducing saturated fats in their products. Our products include trans-fat free high-oleic canola oil, which is low in saturated fats, and high-oleic soybean oil, which is highly stable and trans-fat free. We have also developed proprietary fiber addition processes that allow bakery and food processor customers to achieve significant saturated fat reductions in shortenings. We also produce margarines and buttery spreads, including our leading \nCountry Premium \nbrand, for food service, food processor and retail private label customers. \nIn Europe, we are a leader in consumer packaged vegetable oils, which are sold in various geographies under brand names including \nVenusz\n, \nFloriol\n, \nKujawski\n, \nUnisol, Kaliakra\n, \nOleina\n, \nOliwier\n, \nKomili and Kirlangic. \nWe are also a leader in margarines, under brand names including \nSmakowita, Slynne, Maslo Rosline, Masmix, Optima, Finuu, Deli Reform, Keiju, Alentaia, Venusz, Evesol, Carlshamn, Voimix, Eleplant and Beleaf. \nAdditionally, we produce a variety of products for the confectionery and bakery industries. We are also an oils supplier in the Western European food service channel.\nIn Asia, we offer a range of consumer products and offerings, including bakery, culinary, confectionary, and human nutrition products. In India, our consumer brands include \nDalda\n, \nGagan, Fiona\n and \nChambal\n edible oils; \nDalda\n and \nGagan\n \n7\nTable of Contents\nvanaspatis; and \nMasterline\n professional bakery fats.\nCustomers\n—Our customers include baked goods companies, snack food producers, confectioners, restaurant chains, food service operators, human nutrition companies, other food manufacturers who use vegetable oils and shortenings as ingredients in their operations, and renewable diesel producers. Other customers include grocery chains, wholesalers, distributors, and other retailers who sell to consumers either under our own brand names or private labels. These customers include global and national food processors and manufacturers, many of which are leading brand owners in their product categories.\nCompetition\n—Competition is based on a number of factors, including price, raw material procurement, distribution capability, cost structure, brand recognition, product quality, product innovation, technical support, composition and nutritional value, and advertising and promotion. Our products may compete with widely advertised, well-known, branded products, as well as private label and customized products. Our principal competitors in the Refined and Specialty Oils segment include, but are not limited to: ADM, AAK AB, Cargill, Fuji Oil Co. Ltd., and Wilmar, as well as local competitors in each region.\nMilling Segment\nOverview\n—We primarily sell our milling products to three customer types or market channels: food processors, food service companies, and retail outlets. The principal raw materials used in our milling businesses are wheat, corn, and other agricultural commodities sourced from our Agribusiness segment or directly from third parties. Similar to our refined and specialty oils business, we realize synergies among our other segments in areas such as raw material procurement, logistics, risk management, and the co-location of industrial facilities, enabling us to supply customers with reliable, high quality products on a global basis. As many of the products we sell in our Milling segment are staple foods or ingredients, these businesses generally benefit from macro population and income growth rates. Additionally, our Milling segment is focused on capitalizing on growing global consumer food trends, including a desire for less processed, healthier foods, interest in new flavors, and increases in snacking and eating outside the home. \nProducts\n—Our Milling segment activities include the production and sale of a variety of wheat flours and bakery mixes in Brazil, as well as corn-based products derived from both the dry and wet corn milling processes in the United States and Mexico. During the third quarter of 2022, we completed the sale of our wheat milling business in Mexico.\nOur brands in Brazil include \nSuprema, Soberana, Farina,\n \nPredileta, and Bem-fácill\n wheat flours, \nPre-Mescla, BTX, and\n \nBem-fácill \nbakery premixes. Our corn milling products primarily consist of dry-milled corn meals and flours, flaking and brewers' grits, soy-fortified corn meal, corn-soy blends, snack grits and meals, and other similar products. As part of our corn portfolio, we also sell whole grain and fiber ingredients in addition to wet-milled masa flours, some sold under the \nEl Maizal\n brand in the United States. Additionally, we offer organic and non-GMO products in the United States, including corn varieties.  \nCustomers\n—The primary customers for our wheat milling products are food processing, bakery, and food service companies. The primary customers for our corn milling products are companies in the food-processing sector, such as cereal, snack, bakery, brewing, and food service companies; industrial manufacturing companies; and the U.S. Government under its humanitarian assistance programs. \nCompetition\n—Competition is based on a variety of factors, including price, raw material procurement, brand recognition, product quality, nutritional profile, dietary trends, and distribution capabilities. In Brazil, our major competitors are M. Dias Branco, J. Macedo, Moinho Anaconda, and Grande Moinho Cearense, as well as many small regional producers. Our major competitors in North American corn milling include Cargill, Didion Inc., SEMO Milling, LLC, Life Line Foods, LLC, and Gruma S.A.B. de C.V. \nCorporate and Other\nCorporate and Other includes salaries and overhead for corporate functions that are not allocated to our individual reporting segments because the operating performance of such reporting segments is evaluated by our chief operating decision maker exclusive of these items, as well as certain other activities including Bunge Ventures, the Company's captive insurance program, accounts receivable securitization activities, and certain income tax assets and liabilities.\nNon-core Segment\nSugar and Bioenergy Segment\nOur Sugar and Bioenergy segment primarily comprised our 50% interest in BP Bunge Bioenergia, which was our joint venture with BP, as well as minor ethanol distribution sales activity. On October 1, 2024, we completed the sale of our 50% interest in BP Bunge Bioenergia to BP. \n8\nTable of Contents\nThe joint venture was formed to cultivate sugar cane, produce and sell sugar and sugar ethanol, and create power cogeneration activities. The sugar produced at BP Bunge Bioenergia’s mills was sold in both the Brazilian domestic market, primarily in the confectionary and food processing industries, and export markets. The ethanol was sold primarily to customers for use in the Brazilian domestic market to meet demand for fuel, and also exported in the international market. \nBP Bunge Bioenergia operated on a stand-alone basis with a total of 11 mills located across the Southeast, North, and Midwest regions of Brazil. We accounted for our interest in the joint venture under the equity method of accounting. Accordingly, our reported Sugar and Bioenergy results include our share of the net earnings in BP Bunge Bioenergia for the period during which we had an interest in the joint venture. As our long-term goal has been to seek strategic opportunities for our investment in the joint venture, the operations are designated as Non-core in the period prior to the sale. \nRisk Management\nRisk management is a fundamental aspect of our business. Our Board of Directors (\"Board\") oversees management’s approach to risk management, which is designed to support the achievement of our strategic objectives and enhance shareholder value. We regularly review our enterprise level risks, emerging risks and assess our risk tolerance levels and the effectiveness of our risk monitoring and risk management efforts. Our Board has established the Enterprise Risk Management Committee (\"ERMC\") to provide greater focus at the Board level on risk oversight tailored to our business and industries. Our Chief Risk Officer (\"CRO\") is the management lead of the ERMC, and oversees the enterprise risk management process of the Company, including climate-related risks and opportunities and their impacts on our business strategy, operations and investments. Additionally, each of our other Board committees considers risks within its area of responsibility. Bunge also has a Management Risk Committee (\"MRC\") in its enterprise risk management (\"ERM\") framework, responsible for reviewing and monitoring key exposures, emerging risks, and drivers of risk. The MRC serves as the most senior management-level risk governance body and reviews on an ongoing basis key enterprise risks, providing oversight for all risk management activities, including our risk framework. The risks covered by the MRC include but are not limited to commodity price risk; market risk; liquidity, interest rate, and financing risk; credit and counterparty risk; country risk; cybersecurity risk; and risks related to climate change. When considering these risks, three criteria are evaluated: the possibility of occurrence, magnitude of risk, and power to mitigate. These risks are directly linked to the substantive impact understood by Bunge, which include but are not limited to the impact related to the potential loss of customer demand for our products or the ability to supply products in sufficient volumes to meet demand. \nThe primary risks that our company is subject to are discussed under the heading \"Item 1A. Risk Factors\" and we also describe our efforts to hedge and actively manage our market risks, including those associated with our positions in physical and derivative markets for agricultural commodities, energy, inland and ocean freight, foreign currency, and interest rates under the heading \"Item 7A. Quantitative and Qualitative Disclosures About Market Risk.\"\nInsurance\nIn each country in which we conduct business, our operations and assets are subject to varying degrees of risk and uncertainty. We financially insure our businesses and assets in each country in a manner that we deem appropriate for a company of our size and activities, including against certain risks associated with the ongoing Ukraine-Russia war, based on an analysis of the relative risks, costs, and market availability of insurance. We believe that our geographic dispersion of assets helps mitigate the risk to our business from an adverse event affecting a specific facility. However, if we were to incur a significant loss or liability for which we were not insured in full or in part, it could have a materially adverse effect on our business, financial condition, and results of operations.\nOperating Segments and Geographic Areas\nWe have included financial information about our reportable segments and our operations by geographic area in \nNote 26- Segment Information \nto our consolidated financial statements included as part of this Annual Report on Form 10-K.\nResearch and Development, Innovation, Patents, and Licenses\nOur research and development activities are focused on developing products and improving processes that will drive growth or otherwise add value to our core business operations and create value for our customers. In our refined and specialty oils and milling businesses, we have several research and development centers globally to support product development and enhancement, working alongside our key customers. We monitor the latest advancements in our core areas via an external technology scouting program. Additionally, Bunge Ventures, our corporate venture capital and private capital markets principal investing arm, invests in start-ups and other early-stage companies that are developing new technologies relevant to our industries. Additionally, we invest capital and human resources in digital innovations, aimed at using technology, data and analytics to improve how we perform our most important functions across our value chains, including origination, production, \n9\nTable of Contents\nlogistics, and customer experience. \nWe own trademarks, patents, and licenses covering certain of our products and manufacturing processes. However, neither our business as a whole nor any segment is dependent on any specific trademark, patent, or license. \nSeasonality\nIn our Agribusiness segment, while there is a degree of seasonality in the growing season and procurement of our principal raw materials, such as oilseeds and grains, we typically do not experience material fluctuations in volume between the first and second half of the year, since we are geographically diversified between the northern and southern hemispheres, and we sell and distribute products throughout the year. However, the first quarter of the year has generally been our weakest in terms of financial results due to the timing of the North and South American oilseed harvests, as the North American harvest peaks in the third and fourth quarters, and the South American harvest peaks in the second quarter. Our North and South American grain merchandising and oilseed processing activities are, therefore, generally at lower levels during the first quarter.\nIn our Refined and Specialty Oils and Milling segments, demand for certain of our food items may be influenced by holidays and other annual events.\nGovernment Regulation\nIn each of the countries in which we operate, we are subject to a variety of laws and regulations governing various aspects of our business, including general business regulations as well as those governing the manufacturing, production, handling, storage, transport, marketing, and sale of our products. These include laws and regulations relating to facility licensing and permitting, food, and feed safety, the handling and production of regulated substances, nutritional and labeling requirements, global trade compliance and other matters. Our operations and those of our suppliers are also subject to restrictions on land use in certain protected areas, forestry reserve requirements, limitations on water use, as well as other environmental regulations. Additionally, from time-to-time, agricultural production shortfalls in certain regions, and growing demand for agricultural commodities for feed, food, and fuel use have caused prices for relevant agricultural commodities to rise. High commodity prices and regional crop shortfalls have led, and in the future may lead, governments to impose price controls, tariffs, export restrictions and other measures designed to ensure adequate domestic supplies and/or mitigate price increases in their domestic markets, as well as increase the scrutiny of competitive conditions in their markets.\nMany countries use and produce biofuels as alternatives to traditional fossil fuels. Biofuels convert crops, such as sugarcane, corn, soybeans, palm, rapeseed, canola, and other oilseeds, into ethanol, renewable diesel, or biodiesel to extend, enhance or substitute for fossil fuels. Production of biofuels has increased significantly in the last decade in response to both periods of high fossil fuel prices and to government incentives to produce biofuels offered in many countries, including the United States, Brazil, Argentina, and several South-East Asian and European countries. Furthermore, in several countries, governmental authorities are mandating biofuel use in transport fuels at specified levels. As such, the markets for agricultural commodities used in the production of biofuels have become increasingly affected by the growth of the biofuels industry and related legislation.\nWe are subject to various environmental protection and occupational health and safety laws and regulations in the countries in which we operate, and we incur costs to comply with these requirements. Compliance with applicable laws and regulations relating to environmental matters has not had a material financial or competitive effect on our business. However, due to our extensive operations across multiple industries and jurisdictions globally, we are exposed to the risk of claims and liabilities under these laws and regulations. Violations can result in substantial fines, administrative sanctions, criminal penalties, revocations of operating permits and/or shutdowns of our facilities, litigation, and other liabilities, as well as damage to our reputation.\nOur business could also be affected by the regulation or taxation of greenhouse gas (\"GHG\") emissions, policies related to national emission reduction plans, and regulations related to conservation and eliminating deforestation. A number of jurisdictions in which we operate have implemented or are in the process of implementing carbon pricing programs or regulations to reduce GHG emissions or deforestation, including, but not limited to, the Unites States, Canada, Mexico, the European Union and its member states, and China. In addition, the European Union Deforestation Regulation (\"EUDR\") will require companies trading in certain commodities, including palm oil and soy, as well as products derived from these commodities, to ensure these commodities and related products do not result from deforestation, forest degradation, or breaches of local laws after December 31, 2020 in order to sell such products in the European Union. The EUDR was scheduled to become effective in December 2024, but the European Union reached a deal in December 2024 to postpone its implementation by one year to December 2025. We have begun evaluating implementation efforts necessary to fully comply with the EUDR. Also, failure to comply with the EUDR could result in fines, exclusion from public procurement processes and public funding and prohibition from dealing in the EU in these items. Our operations located in countries with effective and applicable carbon pricing and regulatory programs currently meet related existing obligations with no significant impact on our results of \n10\nTable of Contents\noperations and competitive position. We regularly assess the potential impacts to our business resulting from regulation or policies aimed at reducing GHG emissions and deforestation. Potential consequences could include increased energy, transportation and raw material costs, and additional investments to modify our facilities, equipment and processes. \nAs regulators increasingly focus on climate change and other sustainability issues, we expect to become subject to new environmental, social and governance (\"ESG\") disclosure frameworks. Additionally, as a Swiss company, we are also subject to more scrutiny by investors and other stakeholders in Europe related to our ESG disclosures, the actions we are taking and the goals we set. \nWe closely monitor the rules and regulations related to ESG disclosure and their impact on us. For example, in 2022, the European Union adopted the Corporate Sustainability Reporting Directive (\"CSRD\"), which expands the number of companies required to publicly report ESG-related information and defines the ESG-related information that companies are required to report in accordance with European Sustainability Reporting Standards (\"ESRS\"). The CSRD rules may impose increased costs on us related to complying with our reporting obligations and increase risks of non-compliance with ESRS and the CSRD. The CSRD will apply to us for fiscal years beginning after January 1, 2025, with our first report to be published in 2026. We have begun evaluating CSRD disclosures in accordance with ESRS and aim to comply with all applicable in-scope CSRD reporting requirements.   \nAs a publicly traded company incorporated in Switzerland, Bunge is also required under Swiss law to prepare a report covering five non-financial matters, namely environmental matters (in particular climate issues), social issues, employee-related issues (including diversity aspects), respect for human rights, and combating corruption. The report must include (i) a description of our business model, (ii) a description of the policies adopted in relation to these matters, including the due diligence applied, (iii) a presentation of the measures taken to implement these policies and an assessment of the effectiveness of these measures, (iv) a description of the main risks related to these matters and how we are dealing with these risks, and (v) the main performance indicators for the Company’s activities in relation to these matters. We are required to submit a report with respect to the previous fiscal year to our shareholders for approval each year at our Annual General Meeting of Shareholders. In addition, under the Swiss Code of Obligations, certain Bunge subsidiaries in Switzerland must adhere to due diligence and transparency requirements concerning child labor in the supply chain if these subsidiaries offer products or services in relation to which there are reasonable grounds to suspect that they have been manufactured or provided using child labor. We comply with these requirements by adhering to internationally recognized regulations deemed equivalent under Swiss law.  \nFurther, on October 7, 2023, California enacted the Climate-Related Financial Risk Act and the Climate Corporate Data Accountability Act (together, the \"Climate Accountability Package\"). The Climate Accountability Package requires, among other things, all private and public companies with an annual revenue of more than $1 billion and doing business in California to publicly disclose Scope 1 and Scope 2 GHG emissions beginning in 2026 and Scope 3 GHG emissions in 2027. We are assessing the applicability of the Climate Accountability Package to us. \nAlthough, at this time, it is not possible to estimate the likelihood of passage or predict the potential impact of any additional legislation, regulations or agreements, the effects of additional climate change regulatory initiatives could have a materially adverse impact on our business and results of operations. The scope of physical effects of climate change, including shifts in agricultural production areas and climatic volatility, is uncertain, but could in the long-term result in increased adverse incidents of weather-related events that cause disruptions to our operations and may ultimately result in stranded physical assets. We currently believe the breadth and diversification of our global asset network, as well as our participation in the global trade of agricultural commodities, will help to mitigate these risks. \nSustainability\nBunge believes sustainability is critical to our business. While we have consistently incorporated ESG factors into Bunge’s strategy, investments and operations, we have intensified our efforts in light of new consumer trends, risks arising from factors such as climate change, and new growth opportunities defined by low-carbon attributes. We integrate ESG factors into nearly every area of our business, from how we evaluate new growth markets, plan and develop our strategic goals, compensate our employees and operate our facilities, to how we engage with our customers, suppliers, employees, communities, shareholders and other stakeholders. We encourage Bunge leadership around the globe to embrace sustainable decision-making across our value chains built on a foundation of ethical leadership, accountability and environmental stewardship. Our key areas of growth, comprising expansion of our oilseed processing and origination capabilities, production of renewable feedstocks, increasing our plant lipids portfolio and development of new plant-based protein ingredients, are not only central to our business strategy but also a testament to the alignment of sustainability with our corporate vision.\nA key feature of our sustainability strategy is to leverage Bunge’s position in the value chain and its experience delivering sustainable solutions to stakeholders in order to collaboratively promote industry-wide transformation. Bunge has been a \n11\nTable of Contents\nfounder and active member of leading industry associations and platforms to find practical solutions to certain sustainability challenges, such as climate change, land use change, human rights and biodiversity. We have implemented programs and strategies to mitigate against native vegetation conversion and deforestation in our supply chains associated with agricultural commodity production and trade, a commitment that was established in 2015. As of December 31, 2024, we achieved 100% traceability and monitoring of our direct and indirect soy supply chains in the priority regions of Brazil. We intend to build on our shared efforts, working with governments, farmers, and other key stakeholders in our supply chains, to identify opportunities for public-private collaboration focused on eliminating commodity-driven deforestation. \nBunge’s public reporting on ESG conforms with internationally recognized frameworks and standards, the details of which are captured in the annual global sustainability report published in the first half of each year. The 2025 global sustainability report will contain further information on Bunge’s ESG strategy, performance, and other disclosures. This report is not incorporated by reference in this Annual Report. In addition, as described above, as a Swiss corporation, Bunge is also required under Swiss law to establish an annual non-financial matter report covering, among other things, certain ESG matters (which will be submitted to shareholders for approval at the 2025 Annual Meeting), and to publish an annual report on compliance with our child labor diligence obligations. Such reports are not incorporated by reference in this Annual Report. \nGovernance\nBunge’s five Board committees each share responsibility to oversee ESG and sustainability considerations, including among other things, climate change, deforestation and native vegetation conversion, water, biodiversity, human rights, social development and stakeholder engagement related to these matters.\nThe Sustainability and Corporate Responsibility Committee (\"SCRC\") of the Board oversees and provides input on the development of corporate social responsibility governance, policies, strategies, and programs, including, but not limited to: human rights; food safety; environmental matters related to climate change and emissions, water conservation and management, energy consumption and efficiency, product stewardship, and waste disposal; the Company’s public commitments regarding non-deforestation and emissions reduction; corporate sustainability reporting; ESG external trends and public affairs; relationships with stakeholders; assisting the ERMC in fulfilling their risk management oversight responsibility relating to ESG; and philanthropy and community relations. Additionally, the ERMC of the Board evaluates climate related risks and exposures in connection with its periodic review of other enterprise risks and management’s risk mitigation strategies. The Audit Committee evaluates trends, risks, and developments in non-financial reporting practices and requirements that may impact the Company’s regulatory filings, including ESG-related disclosures. The Human Resources and Compensation Committee oversees the Company’s compensation framework, governance guidelines and performance criteria, workforce trends, talent management and succession planning. The Corporate Governance and Nominations Committee oversees the Company’s corporate governance frameworks and board practices, as well as the identification of qualified board candidates with the appropriate skills, diversity and experience to oversee the Company’s business. \nThe Company’s sustainability function is led by the Chief Sustainability Officer and Government Affairs (\"CSO\"), who reports to our Chief Executive Officer (\"CEO\"). The CSO oversees a global team operating across multiple geographies and functions, which regularly engages business leadership to ensure company-wide alignment with sustainability objectives and opportunities.\nStrategy\nWe leverage our leadership, extensive knowledge of the industry, and our deeply rooted relationships with customers at both ends of the value chain to address the sustainability challenges facing the food, feed, and fuel supply chains in which we operate. We intend to address those challenges by, among other things, connecting farmers and our end customers as they seek to establish common approaches to overcome shared sustainability challenges. This means that the decisions we make — from strategy to investments to operations — look at the associated GHG impact and how it will shape our long-term climate ambitions. With a sustainability mindset, we can enhance our focus on decarbonization in both our operations and in our supply chains, continue providing low carbon solutions to our food, feed, and fuel customers, and ensuring climate-related risks are deeply embedded into our governance framework. We have a proud history of accomplishment that we are building on to realize our approach. For example, Bunge is actively engaged in supplying low carbon feedstock for renewable fuels, sourcing and supplying grains planted under regenerative agricultural practices, and supplying certified and verified deforestation-free grains and by-products, among other initiatives. These business objectives are a natural extension of our sustainability efforts and have been partly developed by applying a \"climate lens\" to our strategic decision-making.\n12\nTable of Contents\nRisk Management\nBunge's ERM framework incorporates detailed sustainability risks and risk factors into the ERM process. These include risks emanating from changing climate and weather patterns, water scarcity, deforestation, human rights, farmer productivity, and increasing taxation and regulation on GHG emissions. The ERM process provides Bunge with greater oversight and management of climate-related risks and the potential financial implications, and will help ensure continued short-, medium- and long-term resilience. \nClimate risks are overseen at the Board level by the ERMC, which has responsibility for supervising the quality and integrity of our risk management practices. Enterprise risk management is overseen at the executive level by the CRO, who reports to our CEO, with input from relevant teams and functions. Further, as noted above the MRC reviews climate-related risks, such as adverse weather patterns, current or emerging regulations, reputational hazards, and other sources which are included in this process. The results of these assessments are distributed throughout the executive leadership team and to the Board, and provided to key stakeholders in various internal risk reports. In recent years, new climate risk factors were incorporated into the MRC's assessment process. These data points are in addition to dozens of other sustainability-related factors that are assessed by the MRC and communicated to the ERMC.  \nMetrics and Targets\nWhen setting public commitments, particularly quantifiable targets on GHG emissions and related measures, Bunge’s leadership and employees regularly engage with stakeholders, review market and consumer trends, and consider business risks and opportunities. Where feasible, Bunge also engages in sector-wide discussions to align with value chain partners so that metrics and targets are aligned for maximum impact and transformation. \nBunge established Science Based Targets (\"SBTs\") in 2021, which were verified by the SBTi and cover absolute reductions in GHG emissions across all three Scopes. From a 2020 baseline to a 2030 deadline, the targets call for:\n•\nScopes 1 & 2 - Absolute reduction of 25%\n•\nScope 3 - Absolute reduction of 12.3%\nDue to the nature of Bunge’s business and operations, the vast majority of GHG emissions are found within the value chain (Scope 3), particularly upstream sources. Therefore, a substantial portion of Bunge’s emissions reduction will be achieved by meeting the Company’s 2025 non-deforestation commitment. Additional emissions reduction activities to meet the SBTs include enhancements to the Company’s plants, procurement of zero- or low-carbon electricity sources, and the uptake of certified products and regenerative farming practices. \nAdditional metrics and targets include intensity reductions (per ton of product) by 2026 from a 2016 baseline for water (10% overall and 25% for facilities located in areas of high water stress), waste disposal to landfill (10%), and energy (10%).\nWe track the progress towards these targets and disclose the performance publicly in our annual global sustainability report.\n13\nTable of Contents\nHuman Capital Resources\nAs of December 31, 2024, we employed approximately 23,000 people. Many of our employees are represented by labor unions and their employment is governed by collective bargaining agreements. In general, we consider our employee relations to be positive.\nOur People\nWe care about our people. We listen, empower, develop and reward them with the goal of driving high levels of engagement and commitment to Bunge. From hiring the best talent to creating a culture of belonging, through career development, and total rewards, Bunge strives to create programs and resources that enhance our workplace environment.\n% of Total Headcount\nRegion\nSouth America\n37 \n%\nEMEA (Europe, Middle East, Africa)\n28 \n%\nNorth America\n19 \n%\nAsia\n16 \n%\nTalent Acquisition\nAt Bunge, we aim to attract the best talent for today and in the future. \nInclusion & Belonging\nWe value inclusion and respect the unique viewpoints our employees bring to make Bunge a dynamic and innovative company. As a global organization, we have a workforce with a wide variety of skill sets and backgrounds critical to meeting the changing needs of a growing world. Strongly guided by our values, the expertise of our teams is a competitive advantage in connecting with thousands of people around the globe to serve our purpose to deliver essential food, feed, and fuel. We are committed to supporting our communities and strengthening our efforts to ensure our workforce, programs, and practices enhance our culture of belonging.\nLearning & Development \nWe focus on learning and development that helps employees develop the skills they need both today and in the future. One of the greatest drivers of growth for our people is their own initiative and sense of career ownership. We encourage employees and their leaders to co-create Individual Development Plans and provide employees access to apply for internal career opportunities that match their interests, skills, and business needs.\nSafety\nOur care and concern for people and their families is rooted in always Doing What's Right when it comes to safety. We believe everyone has the right to a safe work environment. Our approach focuses on incident prevention and mitigation, and we are committed to learning and improving through demonstrated safety leadership at all levels. \nAvailable Information\nOur website address is www.bunge.com. Through the \"Investor Center: Financial information: SEC filings\" section of our website, it is possible to access our periodic report filings with the SEC pursuant to Section 13(a) or 15(d) of the Exchange Act, including our Annual Reports on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K, and any amendments to those reports. Also, filings made pursuant to Section 16 of the Exchange Act with the SEC by our executive officers, directors, and other reporting persons with respect to our shares are made available through our website. Our periodic reports and amendments, and the Section 16 filings, are available through our website free of charge as soon as reasonably practicable after such report, amendment or filing is electronically filed with or furnished to the SEC.  \nThrough the \"Investor Center: Governance: Governance documents\" section of our website, it is also possible to access copies of the charters for our Audit Committee, Corporate Governance and Nominations Committee, Enterprise Risk Management Committee, Human Resources and Compensation Committee, and Sustainability and Corporate Responsibility Committee, as well as our Corporate governance principles, Insider trading policy, and Executive compensation recoupment policy. The information contained in or connected to our website is not deemed to be incorporated by reference in this Annual \n14\nTable of Contents\nReport or filed with the SEC.\nIn addition, the SEC maintains a website that contains reports, proxy and information statements, and other information regarding issuers, where you may obtain a copy of all information we file publicly with the SEC. The SEC website address is www.sec.gov.\nInformation About Our Executive Officers and Key Employees\nSet forth below is certain information concerning the executive officers and key employees of the company.\nName\n \nPosition\nGregory Heckman\n \nChief Executive Officer\nRobert Coviello\nChief Sustainability Officer and Government Affairs\nChristos Dimopoulos\nCo-President, Agribusiness\nJulio Garros\n \nCo-President, Agribusiness\nDebra King\nChief Technology Officer\nPierre Mauger\n \nChief Transformation Officer\nJohn Neppl\n \nChief Financial Officer\nJoseph Podwika\nChief Legal Officer\nKellie Sears\nChief Human Resources Officer\nRobert Wagner\nChief Risk Officer\nRuth Ann Wisener\nVice President of Investor Relations\nGregory Heckman, 62\n-Mr. Heckman has served as Chief Executive Officer since January 2019 and as a member of our Board since October 2018. Mr. Heckman has over 30 years of experience in the agriculture, energy and food processing industries. He is the founding partner of Flatwater Partners and served as Chief Executive Officer of The Gavilon Group from 2008 to 2015. Prior to Gavilon, he served as Chief Operating Officer of ConAgra Foods Commercial Products and President and Chief Operating Officer of ConAgra Trade Group. Mr. Heckman serves on the board of the Federal Reserve Bank of St. Louis and as a non-executive director on the board of OCI N.V., a global producer of fertilizer and chemicals. In addition, he serves on the Board Advisory Council of the New York Stock Exchange.\nRobert Coviello, 56\n-Mr. Coviello has served as Chief Sustainability Officer and Government Affairs since May 2019. Mr. Coviello joined Bunge in 2003 and has held a variety of commercial leadership positions in Asia, Europe and the U.S. Prior to joining Bunge, Mr. Coviello served in trading roles at Cargill in the U.S. Mr. Coviello also serves on the Board of Directors of Lamb Weston, a New York Stock Exchange company.\nChristos Dimopoulos, 51\n-Mr. Dimopoulos has served as Co-President, Agribusiness since April 2022. Prior to that, he was President, Global Supply Chains. Mr. Dimopoulos joined Bunge in 2004 as a grain trader and subsequently held a variety of roles of increasing responsibility in the Agribusiness Segment. Prior to Bunge, Mr. Dimopoulos held roles in Europe and the United States with Tradigrain and Intrade Risk Management.\nJulio Garros, 49-\nMr. Garros has served as Co-President, Agribusiness since April 2022. Prior to that, he was President, Agribusiness Development, Operations and Milling. Mr. Garros joined Bunge in 2002 as a Financial Analyst in Argentina and subsequently held a variety of roles of increasing responsibility across finance, commercial and business development in Argentina and Brazil. Prior to joining Bunge, Mr. Garros worked for PriceWaterhouseCoopers and as an auditor for Argentina’s Foreign Affairs Office.\nDebra King, 53\n-Ms. King has served as Chief Technology Officer since joining Bunge in December 2022. Prior to joining Bunge, Ms. King served as Chief Information Officer at Corteva from 2017 to 2021, where she led the IT spin from DowDuPont, built a technology foundation for the new company and founded the enterprise digital transformation program. Previously, she spent 15 years at Pfizer in a range of IT leadership roles across business domains, managing IT organizations and operations at scale, and leading numerous global transformation programs. She started her career in technology consulting before moving into corporate roles. \nPierre Mauger, 52\n-Mr. Mauger has served as Chief Transformation Officer since May 2019. He joined Bunge in 2013 as Chief Development Officer. Prior to Bunge, Mr. Mauger was a partner at McKinsey & Company, where he led the firm's agriculture service line in Europe, the Middle East and Africa from 2009 to 2013. Prior to that, he served as a partner in the firm's consumer goods practice and previously worked as an auditor at Nestlé and KPMG.\n15\nTable of Contents\nJohn Neppl, 59\n-Mr. Neppl has served as Chief Financial Officer since joining Bunge in May 2019. He joined Bunge from Green Plains Inc., where he served as Chief Financial Officer. Prior to Green Plains, Mr. Neppl served as Chief Financial Officer of The Gavilon Group, LLC, an agriculture and energy commodities management firm with an extensive global footprint. Mr. Neppl held senior financial management positions at ConAgra Foods, Inc., including Senior Financial Officer of ConAgra Trade Group and Commercial Products division as well as Assistant Corporate Controller. Prior to ConAgra, Mr. Neppl was Corporate Controller at Guarantee Life Companies. He began his career as an auditor with Deloitte & Touche. He is a member of the Creighton University Heider College of Business Dean’s Advisory Board and also serves on the Advisory Board of Adams Land & Cattle. Mr. Neppl earned his Bachelor of Science degree in business administration with a major in accounting from Creighton University in Omaha, Nebraska. He is also a certified public accountant (inactive status).\nJoseph Podwika, 62-\nMr. Podwika has served as Chief Legal Officer since joining Bunge in November 2019. Mr. Podwika joined Bunge from Nutrien Ltd. where he was Executive Vice President and Chief Legal Officer. He was previously Senior Vice President, General Counsel and Secretary with PotashCorp. Before joining PotashCorp, Mr. Podwika worked in the legal department of International Paper Company and was in private practice with Jaeckle, Fleischmann & Mugel.\nKellie Sears, 55\n-Ms. Sears has served as Chief Human Resources Officer since joining Bunge in January 2023. Ms. Sears joined Bunge from BeautyHealth where she served as Chief Human Resources Officer from January 2022 until her departure. Prior to BeautyHealth, she was Chief Human Resources Officer with Asklepios BioPharmaceutical, Inc. from 2020 to 2022. Previously, she spent eight years at Allergan, where she served as Senior Vice President and Chief Human Resources Officer in 2019, and Pfizer, for more than thirteen years, where she served in a number of leadership roles including serving as Senior Director of Global HR Shared Services where she was responsible for the strategy, design and implementation of a shared services model.\nRobert Wagner, 47-\nMr. Wagner has served as Chief Risk Officer since joining Bunge in June 2019. Prior to joining Bunge, Mr. Wagner was Chief Risk Officer at Tricon International, Ltd. Prior to Tricon, he was Group Chief Risk Officer at COFCO Agri Ltd in Geneva, Switzerland. Prior to COFCO, he was Chief Risk Officer for The Gavilon Group, LLC, where he was member of the firm’s Executive Committee and had responsibility for both the market risk management and credit departments. \nRuth Ann Wisener, 59\n-Ms. Wisener has served as Vice President of Investor Relations since joining Bunge in March 2019. Prior to joining Bunge, Ms. Wisener worked in leadership positions in a variety of legal, finance, and commercial roles at Tyson Foods and ADM, among others.",
  "item7": "Item 7.    \nManagement's Discussion and Analysis of Financial Condition and Results of Operations\nThe following should be read in conjunction with \"Cautionary Statement Regarding Forward Looking Statements\" and our combined consolidated financial statements and notes thereto included in Item 15 of this Annual Report on Form 10-K. \nFor a comparison of results of operations for the fiscal years ended December 31, 2023 and 2022, see Part II, Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations of Bunge Global SA's Annual Report on Form 10-K for the fiscal year ended December 31, 2023, filed with the SEC on February 22, 2024.\nOperating Results\nFactors Affecting Operating Results\nBunge Global SA, a Swiss company, together with its subsidiaries, is a leading global agribusiness and food company with integrated operations that stretch from farmer to consumer. The commodity nature of the Company's principal products, as \n39\nTable of Contents\nwell as regional and global supply and demand variations that occur as an inherent part of the business, make volumes an important operating measure. Accordingly, information is included in \"\nSegment Overview and Results of Operations\n\" that summarizes certain items in our consolidated statements of income and volumes by reportable segment. The common unit of measure for all reported volumes is metric tons. \nAgribusiness\nIn the Agribusiness segment, we purchase, store, transport, process, and sell agricultural commodities and commodity products. Profitability in this segment is affected by the availability and market prices of agricultural commodities and processed commodity products and the availability and costs of energy, transportation, and logistics services. Profitability in our processing operations is also impacted by volumes procured, processed, and sold and by capacity utilization rates. Availability of agricultural commodities is affected by many factors, including weather, farmer planting and selling decisions, plant diseases, governmental policies, and agricultural sector economic conditions. Reported Processing volumes comprise oilseed volumes crushed (processed) during a period, which approximate sales volumes to third parties during the same period. Reported Merchandising volumes represent sales volumes to third-party customers. \nDemand for our purchased and processed Agribusiness products is affected by many factors, including global and regional economic conditions, changes in per capita income, the financial condition of our customers and their access to credit, worldwide consumption of food products, particularly pork and poultry, population growth rates, relative prices of substitute agricultural products, outbreaks of disease associated with livestock and poultry, and demand for renewable fuels produced from agricultural commodities and commodity products.\nWe expect that the factors described above will continue to affect global supply and demand for our Agribusiness products for the foreseeable future. We also expect that, from time to time, imbalances will likely exist between oilseed processing capacity and demand for oilseed products in certain regions, which impacts our decisions regarding whether, when, and where to purchase, store, transport, process or sell these commodities, including whether to change the location of or adjust our own oilseed processing capacity.\nAdditionally, price fluctuations and availability of commodities may cause fluctuations in our working capital, reflected in the level of inventories, accounts receivable, and outstanding borrowings over the course of a given year. For example, increased availability of commodities at harvest times often causes fluctuations in our inventories and borrowings. Increases in agricultural commodity prices will also generally cause our cash flow requirements to increase as our operations require increased use of cash and associated borrowings to acquire inventories and fund daily settlement requirements on exchange-traded futures that we use to hedge our physical inventories.\nRefined and Specialty Oils\nIn the Refined and Specialty Oils segment, our operating results are affected by changes in the prices of raw materials such as crude vegetable oils, the mix of products that we sell, changes in consumer eating habits, changes in per capita income, consumer purchasing power levels, availability of credit to customers, governmental dietary guidelines and policies, changes in regional economic conditions, and the general competitive environment in our markets. Raw material inputs to our production processes in the Refined and Specialty Oils segment are largely sourced at market prices from our Agribusiness segment. Reported volumes in this segment reflect sales volumes to third-party customers. The unit of measure for these volumes is metric tons as these businesses are linked to the commodity raw materials, which are their primary inputs.\nMilling\nIn the Milling segment, our operating results are affected by changes in the prices of raw materials such as grains, the mix of products that we sell, changes in consumer eating habits, changes in per capita income, consumer purchasing power levels, availability of credit to customers, governmental dietary guidelines and policies, changes in regional economic conditions and the general competitive environment in our markets. Raw material inputs to our production processes in the  Milling segment are largely sourced at market prices from our Agribusiness segment. Reported volumes in this segment reflect feedstock ground (processed) during a period, again approximating sales volumes during the same period. The unit of measure for these volumes is metric tons as these businesses are linked to the commodity raw materials, which are their primary inputs.\nViterra\nFollowing the completion of our pending Viterra Acquisition, our operations will be impacted by the integration of Viterra's network of agricultural storage, processing, and transport assets. Viterra businesses operate in similar industries as we do, so we expect the factors that impact Viterra's operations will be broadly consistent with the factors that we have described above that impact each of our segments. \n40\nTable of Contents\nSugar and Bioenergy\nOur Sugar and Bioenergy segment primarily comprised our 50% interest in BP Bunge Bioenergia, a joint venture with BP. On October 1, 2024, we completed the sale of our 50% interest in BP Bunge Bioenergia. See Note 2 - \nAcquisitions and Dispositions \nto our consolidated financial statements for further details. \nBP Bunge Bioenergia operated on a stand-alone basis with a total of 11 mills located across the Southeast, North, and Midwest regions of Brazil. We accounted for our interest in the joint venture under the equity method of accounting. Accordingly, our reported Sugar and Bioenergy results include our share of the net earnings in BP Bunge Bioenergia. \nPrior to the sale of our interest in October 2024, profitability of this segment, the value of our investment, and the timing of distributions we received, if any, were affected by the profitability of the joint venture. In turn, the profitability of the joint venture was affected by the availability and quality of sugarcane, which impacted capacity utilization rates and the amount of sugar that could be extracted from the sugarcane, and by market prices of sugar and ethanol. The availability and quality of sugarcane is affected by many factors, including weather, geographical factors such as soil quality and topography, and agricultural practices. Demand for the joint venture's products was affected by many factors, including changes in global or regional economic conditions, the financial condition of customers and customer access to credit, worldwide consumption of food products, population growth rates, changes in per capita income, and demand for and governmental support of renewable fuels produced from agricultural commodities, including sugarcane.\nIn addition to these industry related factors which impact our business areas, our results of operations in all business areas and segments are affected by the following factors:\nForeign Currency Exchange Rates\nDue to the global nature of our operations, our operating results can be materially impacted by foreign currency exchange rates. Both translation of our foreign subsidiaries' financial statements and foreign currency transactions can affect our results. On a monthly basis, for subsidiaries whose functional currency is a currency other than the U.S. dollar, subsidiary statements of income and cash flows must be translated into U.S. dollars for consolidation purposes based on weighted-average exchange rates in each monthly period. As a result, fluctuations of local currencies compared to the U.S. dollar during each monthly period impact our consolidated statements of income and cash flows for each reported period (per quarter and year-to-date) and also affect comparisons between those reported periods. Subsidiary balance sheets are translated using exchange rates as of the balance sheet date with the resulting translation adjustments reported in our consolidated balance sheets as a component of Accumulated other comprehensive loss.\nAdditionally, we record transaction gains or losses on monetary assets and liabilities that are not denominated in the functional currency of the entity. These amounts are remeasured into their respective functional currencies at exchange rates as of the balance sheet date, with the resulting gains or losses included in the entity's statement of income and, therefore, in our consolidated statements of income as Foreign exchange (losses) gains - net.  \nWe primarily use a combination of equity and intercompany loans to finance our subsidiaries. Intercompany loans that are of a long-term investment nature with no intention of repayment in the foreseeable future are considered permanently invested and as such are treated as analogous to equity for accounting purposes. As a result, any foreign currency translation gains or losses on such permanently invested intercompany loans are reported in Accumulated other comprehensive loss in our consolidated balance sheets. In contrast, foreign currency translation gains or losses on intercompany loans that are not of a permanent nature are recorded in our consolidated statements of income as Foreign exchange (losses) gains - net.\nIncome Taxes\nAs a Swiss corporation, we are subject to corporate income tax at federal, cantonal, and communal levels on our Swiss income. Qualifying net dividend income and net capital gains on the sale of qualifying investments in subsidiaries are effectively exempt from federal, cantonal, and communal corporate income tax. Consequently, we expect dividends from our subsidiaries and capital gains from sales of investments in our subsidiaries to be exempt from Swiss corporate income tax. In addition, our subsidiaries, which operate in multiple tax jurisdictions, are subject to income taxes at various statutory rates ranging from 0% to 35%. The jurisdictions that significantly impact our effective tax rate are Argentina, Brazil, Canada, Switzerland and the United States. Determination of taxable income requires the interpretation of related and often complex tax laws and regulations in each jurisdiction in which we operate, and the use of estimates and assumptions regarding future events.\nNon-U.S. GAAP Financial Measures\nTotal earnings before interest and taxes (\"EBIT\") is an operating performance measure used by Bunge’s management to evaluate reportable segment operating activities as well as Corporate and Other results. Bunge also uses Core Segment EBIT, Non-core Segment EBIT, Corporate and Other EBIT, and Total EBIT to evaluate segment operating performance of Bunge’s \n41\nTable of Contents\nCore reportable segments, Non-core reportable segments, and Total reportable segments together with Corporate and Other. Core Segment EBIT is the aggregate of the EBIT of each of Bunge’s Agribusiness, Refined and Specialty Oils, and Milling reportable segments. Non-core Segment EBIT is the EBIT of Bunge’s Sugar & Bioenergy reportable segment. Total EBIT is the aggregate of the EBIT of Bunge’s Core and Non-core reportable segments, together with Corporate and Other. Bunge’s management believes Core Segment EBIT, Non-core Segment EBIT, Corporate and Other EBIT, and Total EBIT are useful measures of operating profitability since the measures allow for an evaluation of the performance of its segments without regard to financing methods or capital structure. In addition, EBIT is a financial measure that is widely used by analysts and investors in Bunge’s industry. Total EBIT is a non-U.S. GAAP financial measure and is not intended to replace Net income attributable to Bunge, the most directly comparable U.S. GAAP financial measure. Further, Total EBIT excludes EBIT attributable to noncontrolling interests and is not a measure of consolidated operating results under U.S. GAAP and should not be considered as an alternative to Net income or any other measure of consolidated operating results under U.S. GAAP. See the reconciliation of Net income attributable to Bunge to Total EBIT below.\n2024 Overview\nNet Income Attributable to Bunge Shareholders -\n For the year ended December 31, 2024, Net income attributable to Bunge shareholders was $1,137 million, a decrease of $1,106 million compared to a Net income attributable to Bunge shareholders of $2,243 million for the year ended December 31, 2023. The decrease was primarily due to lower Core Segment EBIT, as further discussed in the\n Segment Overview & Results of Operations\n section below, partially offset by lower income tax expense as discussed further below.\nEarnings Per Share - Diluted -\n For the year ended December 31, 2024, Net income attributable to Bunge shareholders - diluted, was $7.99 per share, a decrease of $6.88 per share, compared to $14.87 per share for the year ended December 31, 2023. \nEBIT \n- For the year ended December 31, 2024, Total EBIT was $1,792 million, a decrease of $1,541 million compared to EBIT of $3,333 million for the year ended December 31, 2023. The decrease in Total EBIT for the year ended December 31, 2024 was primarily due to lower Core Segment EBIT, resulting primarily from lower gross profit in our Agribusiness segment, as further discussed in the \nSegment Overview and Results of Operations\n section below, and which also provides a reconciliation of Net income attributable to Bunge shareholders to Total EBIT. \nIncome Tax Expense - \nIncome tax expense was $336 million for the year ended December 31, 2024 compared to income tax expense of $714 million for the year ended December 31, 2023. The decrease in income tax expense for the year ended December 31, 2024 was primarily due to lower pre-tax income and earnings mix.\nLiquidity and Capital Resources\n – At December 31, 2024, working capital, which equals Total current assets less Total current liabilities, was $8,523 million, a decrease of $140 million, compared to working capital of $8,663 million at December 31, 2023. The decrease in working capital was primarily due to a higher Current portion of long-term debt balance, lower Inventories and lower Trade accounts receivables, net, partially offset by lower Trade accounts payable balances and higher Cash and cash equivalents, as further discussed in the Liquidity and Capital Resources section below.\nSegment Overview and Results of Operations\nOur operations are organized, managed, and classified into four reportable segments based upon their similar economic characteristics, nature of products and services offered, production processes, types and classes of customer, and distribution methods. We further organize these reportable segments into Core operations and Non-core operations. Core operations comprise our Agribusiness, Refined and Specialty Oils, and Milling reportable segments. Non-core operations comprise our Sugar & Bioenergy reportable segment, which itself primarily comprised the Company’s 50% interest in the net earnings of BP Bunge Bioenergia, a joint venture with BP p.l.c. See \nNote 2- Acquisitions and Dispositions\n for details regarding Bunge's disposition of its 50% interest in BP Bunge Bioenergia.\nOur remaining operations are not reportable segments, as defined by the applicable accounting standard, and are classified as Corporate and Other. Corporate and Other includes salaries and overhead for corporate functions that are not allocated to our individual reportable segments because the operating performance of each reportable segment is evaluated by the Company's chief operating decision maker exclusive of these items, as well as certain other activities including Bunge Ventures, the Company's captive insurance activities, and trade receivables securitization program, as well as certain income tax assets and liabilities.\n42\nTable of Contents\nA reconciliation of Net income attributable to Bunge shareholders to Total EBIT follows:\n \nYear Ended\nDecember 31,\n(US$ in millions)\n2024\n2023\nNet income attributable to Bunge shareholders\n$\n1,137\n \n$\n2,243 \nInterest income\n(163)\n(148)\nInterest expense\n471\n \n516 \nIncome tax expense\n336\n \n714 \nNoncontrolling interests' share of interest and tax\n11\n \n8 \nTotal EBIT\n$\n1,792\n \n$\n3,333 \nAgribusiness Segment EBIT\n1,301\n \n2,786 \nRefined and Specialty Oils Segment EBIT\n759\n \n865 \nMilling Segment EBIT\n111\n \n66 \nCore Segment EBIT\n2,171\n \n3,717 \nCorporate and Other EBIT\n(594)\n(548)\nSugar and Bioenergy Segment EBIT\n215\n \n164 \nNon-core Segment EBIT\n215\n \n164 \nTotal EBIT\n$\n1,792\n \n$\n3,333 \nCore Segments\nAgribusiness Segment\n \nYear Ended\nDecember 31,\n(US$ in millions)\n2024\n2023\n% Change\nVolumes (in thousand metric tons)\n80,628\n \n76,019 \n6 \n%\nNet sales\n$\n38,598\n \n$\n42,764 \n(10)\n%\nCost of goods sold\n(36,684)\n(39,443)\n(7)\n%\nGross profit\n1,914\n \n3,321 \n(42)\n%\nSelling, general and administrative expense\n(603)\n(592)\n2 \n%\nForeign exchange losses — net\n(171)\n— \n(100)\n%\nEBIT attributable to noncontrolling interests \n(9)\n(70)\n(87)\n%\nOther income  — net\n226\n \n126 \n79 \n%\n(Loss) income from affiliates\n(56)\n1 \n(5,700)\n%\nTotal Agribusiness Segment EBIT\n$\n1,301\n \n$\n2,786 \n(53)\n%\n2024 Compared to 2023\nAgribusiness segment Net sales decreased 10% to $38,598 million for the year ended December 31, 2024. The decrease was due to the following:  \n•\nIn Processing, Net sales decreased 11%, primarily due to lower average sales prices experienced in all regions for our global soybean oilseed processing businesses as well as our Europe softseed businesses, driven by relative price stabilization due to a more balanced supply and demand environment, in addition to overall lower volumes in our global soybean oilseed processing businesses. The above decreases were slightly offset by higher volumes in South America resulting from the non-recurrence of the prior year drought in Argentina along with higher volumes in our  Europe softseed business primarily driven from increased activity at our Ukrainian facilities.\n•\nIn Merchandising, Net sales decreased 7%, primarily due to lower average sales prices in our global corn, wheat, and oil businesses, in addition to lower volumes in our global wheat business. The decrease was partially offset by an \n43\nTable of Contents\nincrease in volumes in our global corn and oils businesses, primarily due to fewer supply constraints compared to the prior period.\nCost of goods sold decreased 7%, to $36,684 million for the year ended December 31, 2024. The decrease was primarily due to the following:\n•\nIn Processing, Cost of goods sold decreased 7%, primarily due to lower Net sales and the non-recurrence of a prior year fixed asset impairment charge in North America. The decrease was also attributable to $5 million in insurance recoveries, related to certain previously damaged property, as well as a business interruption insurance recovery of $38 million related to our Ukrainian operations as a result of the Ukraine-Russia war, both of which were recognized in the current year. The decrease was partially offset by unfavorable mark-to-market results in the current period as well as the absence of mark-to-market gains from the recovery of inventory in Ukraine recognized in the prior period.\n•\nIn Merchandising, Cost of goods sold decreased by 8%, primarily due to lower Net sales, as further described above, and favorable mark-to-market results in the current period. The decrease was also attributable to $1 million in insurance recoveries, related to certain previously damaged property, as well as a business interruption insurance recovery of $14 million related to our Ukrainian operations as a result of the Ukraine-Russia war, both of which were recognized in the current year. The decrease was partially offset by the lack of mark-to-market gains from the recovery of inventory in Ukraine recognized in the prior period.\nForeign exchange losses - net was a loss of $171 million for the year ended December 31, 2024 . The net loss in the current year was the result of losses in our processing business, primarily due to the impact of a stronger U.S. dollar on U.S. dollar-denominated loans payable in non-U.S. dollar functional currency operations. The loss was partially offset by net remeasurement gains on net monetary assets, excluding the impact of loans payable described above, as a result of U.S. dollar exposure in non-U.S. dollar functional currency operations.   \nOther income  - net was income of $226 million for the year ended December 31, 2024, compared to income of $126 million for the year ended December 31, 2023. The increase was primarily due to gains in Argentina related to foreign currency positioning.\n(Loss) income from affiliates was a loss of $56 million for the year ended December 31, 2024, compared to income of $1 million for the year ended December 31, 2023. The decrease was primarily due to unfavorable results from equity method investments in South America, as well as a $19 million impairment charge in the current period associated with a minority investment in North America.  \nSegment EBIT decreased 53% to $1,301 million for the year ended December 31, 2024. The decrease was primarily due to the following:\n•\nIn Processing, a decrease of 62% was primarily due to lower Gross profit across all businesses and regions, foreign exchange losses, and impairment charges incurred in the current year, as described above. This decrease was partially offset by an increase in Other income (expense) - net as highlighted above.\n•\nIn Merchandising, an increase of 20% was primarily due to higher Gross profit, driven by more favorable results in our ocean freight business.\n44\nTable of Contents\nRefined and Specialty Oils Segment\n \n \nYear Ended\nDecember 31,\n(US$ in millions)\n2024\n2023\n% Change\nVolumes (in thousand metric tons)\n9,134\n \n8,908 \n3 \n%\nNet sales\n$\n12,771\n \n$\n14,603 \n(13)\n%\nCost of goods sold\n(11,484)\n(13,234)\n(13)\n%\nGross profit\n1,287\n \n1,369 \n(6)\n%\nSelling, general and administrative expense\n(416)\n(425)\n(2)\n%\nForeign exchange (losses) gains — net\n(20)\n7 \n(386)\n%\nEBIT attributable to noncontrolling interests \n(35)\n(21)\n67 \n%\nOther (expense) — net\n(57)\n(65)\n(12)\n%\nTotal Refined and Specialty Oils Segment EBIT\n$\n759\n \n$\n865 \n(12)\n%\n2024 Compared to 2023\nRefined and Specialty Oils segment Net sales decreased 13%, to $12,771 million for the year ended December 31, 2024, primarily due to lower average sales prices in all regions, driven by a more balanced supply and demand environment and uncertainty related to U.S. biofuel policies, partially offset by increased volumes in Asia due to higher demand for certain products driven by better pricing, as well as increased volumes in North America, primarily due to expanded capacity at our Avondale refinery.  \nCost of goods sold decreased 13%, to $11,484 million for the year ended December 31, 2024. The decrease in Cost of goods sold was primarily due to lower prices in all regions, as described in Net sales above, in addition to favorable mark-to-market results.\nSG&A expenses decreased 2%, to $416 million for the year ended December 31, 2024. The decrease was primarily driven by the lack of recurring prior year accelerated amortization charges, related to the discontinuance of the \nLoders Croklaan\n trademark. \nSegment EBIT decreased 12% to $759 million for the year ended December 31, 2024. The decrease was primarily driven by lower Gross profit driven by overall lower margins, particularly in North America, as well as unfavorable Foreign exchange (losses) gains - net, primarily driven by the devaluation of the Egyptian \npound\n in the first quarter of 2024.\nMilling Segment\n \n \nYear Ended\nDecember 31,\n(US$ in millions)\n2024\n2023\n% Change\nVolumes (in thousand metric tons)\n3,703\n \n3,391 \n9 \n%\nNet sales\n$\n1,555\n \n$\n1,896 \n(18)\n%\nCost of goods sold\n(1,337)\n(1,729)\n(23)\n%\nGross profit\n218\n \n167 \n31 \n%\nSelling, general and administrative expense\n(97)\n(95)\n2 \n%\nForeign exchange (losses) gains — net\n(3)\n1 \n(400)\n%\nEBIT attributable to noncontrolling interests \n—\n \n1 \n(100)\n%\nOther expense — net\n(6)\n(7)\n(14)\n%\nLoss from affiliates\n(1)\n(1)\n— \n%\nTotal Milling Segment EBIT\n$\n111\n \n$\n66 \n68 \n%\n45\nTable of Contents\n2024 Compared to 2023\nMilling segment Net sales decreased 18%, to $1,555 million for the year ended December 31, 2024. The decrease was primarily due to lower sales prices in both our South American wheat milling and North American corn milling businesses. These decreases were partially offset by an increase in volumes across both regions.\nCost of goods sold decreased 23%, to $1,337 million for the year ended December 31, 2024. The decrease was primarily due to lower sales prices, as described for Net sales above, as well as favorable mark-to-market results.\nSegment EBIT increased 68% to $111 million for the year ended December 31, 2024. The increase was primarily due to higher Gross profit in both regions, as described above.\nCorporate and Other\n \nYear Ended\nDecember 31,\n(US$ in millions)\n2024\n2023\n% Change\nNet sales\n$\n54\n \n$\n42 \n29 \n%\nCost of goods sold\n(83)\n(60)\n38 \n%\nGross profit\n(29)\n(18)\n(61)\n%\nSelling, general and administrative expense\n(658)\n(602)\n9 \n%\nForeign exchange gains — net\n5\n \n12 \n(58)\n%\nEBIT attributable to noncontrolling interests \n4\n \n4 \n— \n%\nOther income — net\n83\n \n73 \n14 \n%\nIncome (loss) from affiliates\n1\n \n(17)\n106 \n%\nTotal Corporate and Other EBIT\n$\n(594)\n$\n(548)\n(8)\n%\n2024 Compared to 2023\nCorporate and Other EBIT decreased 8%, to a loss of $594 million for the year ended December 31, 2024. The decrease was primarily driven by an increase in SG&A expense resulting from increased acquisition and integration costs associated with the announced acquisition of Viterra, partially offset by lower variable compensation expense. The company recognized acquisition and integrations costs within Corporate and Other EBIT of $244 million, and $114 million for the years ended December 31, 2024, and 2023, respectively. The decrease described above was partially offset by the absence of recurring prior year impairment charges of $20 million, reported in in Other income - net, related to a long-term investment and $16 million, reported in Income (loss) from affiliates, related to a minority investment in Australian Plant Proteins, a start-up manufacturer of novel protein ingredients.\nNon-core Segment\nSugar and Bioenergy Segment  \n \nYear Ended\nDecember 31,\n(US$ in millions)\n2024\n2023\n% Change\nNet sales\n$\n130\n \n$\n235 \n(45)\n%\nCost of goods sold\n(127)\n(229)\n(45)\n%\nGross profit\n3\n \n6 \n(50)\n%\nSelling, general and administrative expense\n(2)\n(1)\n100 \n%\nOther income — net\n196\n \n2 \n9,700 \n%\nIncome from affiliates\n18\n \n157 \n(89)\n%\nTotal Sugar and Bioenergy Segment EBIT\n$\n215\n \n$\n164 \n31 \n%\n46\nTable of Contents\n2024 Compared to 2023\nSegment EBIT increased 31%, to $215 million for the year ended December 31, 2024. The increase was primarily due to a $195 million gain on the sale of Bunge's 50% ownership share in BP Bunge Bioenergia, recorded in Other income - net. The increase was partially offset by less favorable results from our investment in BP Bunge Bioenergia, primarily resulting from the absence of a tax valuation allowance release in the current period as compared to the prior period, current period foreign exchange losses on U.S. dollar denominated debt at BP Bunge Bioenergia, lower current period gross margins, and lower equity method earnings following the sale. See \nNote 2- Acquisitions and Dispositions\n in the consolidated financial statements for further details regarding the Company's disposition of BP Bunge Bioenergia.\nInterest\n—A summary of consolidated interest income and expense follows:\n \nYear Ended\nDecember 31,\n(US$ in millions)\n2024\n2023\n% Change\nInterest income\n$\n163\n \n$\n148 \n10 \n%\nInterest expense\n(471)\n(516)\n(9)\n%\n2024 Compared to 2023\nInterest income increased 10% to $163 million for the year ended December 31, 2024. Interest expense decreased 9% to $471 million for the year ended December 31, 2024. Higher interest income is the result of higher balances in cash and cash equivalents in the current year. Lower interest expense is the result of lower interest rates.\nLiquidity and Capital Resources\nOur main financial objectives are to prudently manage financial risks, ensure consistent access to liquidity, and minimize cost of capital in order to efficiently finance our business and maintain balance sheet strength. We generally finance our ongoing operations with cash flows generated from operations, issuances of commercial paper, borrowings under various bilateral and syndicated revolving credit facilities, term loans, and proceeds from the issuance of senior notes. Acquisitions and long-lived assets are generally financed with a combination of equity and long-term debt.\nWorking Capital\nAs of December 31,\n(US$ in millions, except current ratio)\n2024\n2023\nCash and cash equivalents\n$\n3,311\n \n$\n2,602 \nTrade accounts receivable, net\n2,148\n \n2,592 \nInventories\n6,491\n \n7,105 \nOther current assets\n4,008\n \n4,051 \nTotal current assets\n$\n15,958\n \n$\n16,350 \nShort-term debt\n$\n875\n \n$\n797 \nCurrent portion of long-term debt\n669\n \n5 \nTrade accounts payable\n2,777\n \n3,664 \nCurrent operating lease obligations\n286\n \n308 \nOther current liabilities\n2,828\n \n2,913 \nTotal current liabilities\n$\n7,435\n \n$\n7,687 \nWorking capital\n(1)\n$\n8,523\n \n$\n8,663 \nCurrent ratio\n(1)\n2.15\n \n2.13 \n(1)\nWorking capital is defined as Total current assets less Total current liabilities; Current ratio represents Total current assets divided by Total current liabilities.\n47\nTable of Contents\nWorking capital was $8,523 million at December 31, 2024, a decrease of $140 million from working capital of $8,663 million at December 31, 2023.\nCash and Cash Equivalents - \nCash and cash equivalents were $3,311 million at December 31, 2024, an increase of $709 million from $2,602 million at December 31, 2023. Cash balances are managed in accordance with our investment policy, the objectives of which are to preserve the principal value of our cash assets, maintain a high degree of liquidity, and deliver competitive returns subject to prevailing market conditions. Cash balances are typically invested in short-term deposits, money market funds, and commercial paper programs with highly-rated financial institutions and in U.S. government securities. Please refer to the\n Cash Flows\n section of this report, below, for details regarding the primary factors giving rise to the change in Cash and cash equivalents during the year ended December 31, 2024.\nTrade accounts receivable, net\n - Trade accounts receivable, net were $2,148 million at December 31, 2024, a decrease of $444 million from $2,592 million at December 31, 2023. The decrease was primarily due to decreased Net sales in the current period driven by factors described in the \nSegment Overview & Results of Operations\n section above. \nInventories -\n Inventories were $6,491 million at December 31, 2024, a decrease of $614 million from $7,105 million at December 31, 2023. The decrease was primarily due to certain lower average commodity prices, including soybeans and wheat, as well as overall lower volumes.\nReadily marketable inventories (\"RMI\") comprise agricultural commodity inventories, such as soybeans, soybean meal, soybean oil, palm oil, corn, and wheat that are readily convertible to cash because of their commodity characteristics, widely available markets and international pricing mechanisms. Total RMI reported at fair value were $5,224 million and $5,837 million at December 31, 2024 and \n2023\n, respectively (see \nNote 5- Inventories, \nto our consolidated financial statements).\nOther current assets\n - Other current assets were $4,008 million at December 31, 2024, a decrease of $43 million from $4,051 million at December 31, 2023. The decrease is primarily due to a decrease in secured advances to supplies, net as market conditions in Brazil have led to a reduction in new advances in the current period, lower unrealized gains on derivative contracts as a result of volatile commodity prices, and a decrease in prepaid expenses due to the changing market environment. These decreases were partially offset by an increase in marketable securities and other short-term investments, a deferred payment recorded in the current year in connection with the sale of BP Bunge Bioenergia that was collected in early 2025, and the recognition of an insurance recovery receivable related to business interruption resulting from the Ukraine-Russia war in the current year (see \nNote 6- Other Current Assets \nto our consolidated financial statements).\nShort-term debt\n - Short-term debt, including the Current portion of long-term debt, was $1,544 million at December 31, 2024, an increase of $742 million from $802 million at December 31, 2023. The higher Short-term debt level at December 31, 2024 compared to December 31, 2023 is primarily due to an increase in the Current portion of long-term debt associated with our 1.63% Senior Notes, due 2025, and higher borrowings by Bunge operating companies on local bank lines of credit. \nTrade accounts payable \n- Trade accounts payable were $2,777 million at December 31, 2024, a decrease of $887 million from $3,664 million at December 31, 2023. The decrease in Trade accounts payable was primarily due to certain lower average commodity prices, including soybeans and wheat, lower volumes, and timing of payments.\nOther current liabilities \n- Other current liabilities were $2,828 million at December 31, 2024, a decrease of $85 million from $2,913 million at December 31, 2023. The decrease was primarily due to lower income tax payable as a result of lower earnings, partially offset by higher unrealized losses on derivative contracts as a result of volatile commodity prices.\n48\nTable of Contents\nDebt\n \nRevolving Credit Facilities\n—At December 31, 2024, we had $5,665 million unused and available committed borrowing capacity comprising committed revolving credit facilities. The following table summarizes these facilities for the years presented:\n \n \nCommitted\nCapacity \nIncremental Commitments\n(2)\nBorrowings\nOutstanding\nRevolving Credit Facilities \n(1)\nMaturities\nDecember 31, 2024\nDecember 31, 2024\nDecember 31, 2023\n$1.1 Billion 364-day Revolving Credit Agreement\n2025\n$\n1,100\n \n$\n—\n \n$\n—\n \n$\n— \n$3.2 Billion 5-year Revolving Credit Agreement\n2029\n1,950\n \n1,250\n \n—\n \n— \n$3.5 Billion 3-year Revolving Facility Agreement \n2026\n1,750\n \n1,750\n \n—\n \n— \n$865 Million 5-year Revolving Credit Facility \n2026\n865\n \n—\n \n—\n \n— \nTotal Revolving Credit Facilities\n$\n5,665\n \n$\n3,000\n \n$\n—\n \n$\n—\n \n(1)\nSee \nNote 17- Debt \nfor further information on these programs. The short-term credit ratings of the commercial paper program require Bunge to keep same day unused committed borrowing capacity under its long-term committed credit facilities in an amount greater or equal to the amount of commercial paper issued and outstanding.\n(2)\nIncremental commitments are available to be drawn following the completion of the Viterra Acquisition subject to the satisfaction of certain conditions.\nShort and long-term debt\n—\nAs of December 31,\nUS$ in millions\n2024\n2023\nShort-term debt\n$\n875\n \n$\n797 \nLong-term debt, including current portion\n5,363\n \n4,085 \nTotal debt \n$\n6,238\n \n$\n4,882 \nYear Ended December 31,\n2024\n2023\nAverage total debt outstanding\n$\n5,480\n \n$\n5,293 \nOur total debt increased by $1,356 million to $6,238 million at December 31, 2024, from $4,882 million at December 31, 2023, primarily due to an increase in Long-term debt, including current portion, resulting from the issuance of three tranches of the September 2024 Senior Notes for an aggregate principal amount of $2.0 billion, partially offset by the prepayment of a $750 million 3-year term loan agreement due in 2025. See \nNote 17- Debt \nfor further information.\nFrom time to time, through our financing subsidiaries, we enter into bilateral short-term credit lines as necessary. At December 31, 2024, there were no borrowings outstanding under these bilateral short-term credit lines.\nIn addition, Bunge's operating companies had $875 million and $797 million in short-term borrowings outstanding from local bank lines of credit at December 31, 2024, and 2023, respectively, to support working capital requirements.\nAs described in \nNote 2- Acquisitions and Dispositions\n, we have secured a total of $8.0 billion in acquisition debt financing (\"Acquisition Financing\"). On September 17, 2024, we completed the sale and issuance of three tranches of Senior Notes for an aggregate principal amount of $2.0 billion. See \nNote 17- Debt \nfor further information. As a result of the Senior Notes issuance, and in accordance with its terms, the Acquisition Financing commitment was reduced by $2.0 billion with $6.0 billion available as of December 31, 2024. Bunge intends to use a portion of the proceeds from the Acquisition Financing and Senior Notes issuance to fund a portion of the cash consideration for Bunge's Acquisition of Viterra and to repay a portion of certain Viterra debt to be assumed in connection with the Acquisition, including, in each case, related fees and expenses, and, with any remaining amounts, for general corporate purposes.  \n49\nTable of Contents\nAlso, in the third quarter of 2024, Bunge's wholly-owned subsidiary, Bunge Limited Finance Corp. (\"BLFC\"), commenced offers (the \"US Exchange Offers\") to exchange all outstanding notes of certain series issued by Viterra Finance B.V. (\"VFBV\") and guaranteed by Viterra and Viterra B.V., for up to $1.95 billion aggregate principal amount of new notes issued by BLFC and guaranteed by Bunge. In addition, in the third quarter of 2024, Viterra commenced a consent solicitation (the \"European Consent Solicitation\") to amend the indenture governing VFBV's outstanding 500 million \nEuro\n aggregate principal amount of 0.375% senior unsecured notes due 2025 and outstanding 700 million \nEuro \naggregate principal amount of 1.000% senior unsecured notes due 2028 to, among other things, substitute the issuer and guarantors of such notes with Bunge Finance Europe B.V. (\"BFE\"), a wholly owned finance subsidiary of Bunge, as issuer, and Bunge as guarantor. See \nNote 17- Debt \nfor further information.  \nThe US Exchange Offers and European Consent Solicitation are conditioned among other things, upon the consummation of the Acquisition. This Annual Report is not intended to and does not constitute an offer to sell or purchase, or the solicitation of an offer to sell or purchase, or the solicitation of any vote of approval or the solicitation of tenders or consents with respect to any security. No offer, solicitation, purchase or sale will be made in any jurisdiction in which such an offer, solicitation, or sale would be unlawful prior to registration or qualification under the securities laws of any such jurisdiction. \nRegistered Senior Notes —\n BLFC, a wholly owned finance subsidiary of Bunge, had the following outstanding debt securities (collectively referred to as the \"BLFC Notes\") registered under the requirements of the Securities Act of 1933, as amended, at December 31, 2024.\n(US$ in millions)\nAggregate Principal Amount Outstanding\nBalance Outstanding\n1.63% Senior Notes due 2025\n$\n600\n \n599\n \n3.25% Senior Notes due 2026\n700\n \n699\n \n3.75% Senior Notes due 2027\n600\n \n598\n \n4.10% Senior Notes due 2028\n400\n \n397\n \n4.20% Senior Notes due 2029\n800\n \n793\n \n2.75% Senior Notes due 2031\n1,000\n \n993\n \n4.65% Senior Notes due 2034\n800\n \n790\n \nBunge unconditionally guarantees BLFC's obligations with respect to the BLFC Notes. Bunge's guarantees are unsecured and unsubordinated obligations of Bunge and rank equally with all other unsecured and unsubordinated obligations of Bunge. The guarantees provide that in the event of a default in payment of principal of, or interest on, BLFC Notes of a particular series, the holder of such series of senior debt securities may institute legal proceedings directly against Bunge to enforce the applicable guarantee without first proceeding against BLFC.   \nAs a holding company, Bunge is dependent upon dividends, loans, or advances or other intercompany transfers of funds from its subsidiaries to meet its obligations, including its obligations under the guarantee. The ability of certain of its subsidiaries to pay dividends and make other payments to Bunge may be restricted by, among other things, applicable laws, as well as agreements to which those subsidiaries may be party. Therefore, the ability of Bunge to make payments with respect to the guarantee may be limited. The BLFC Notes effectively rank junior to all liabilities of Bunge's subsidiaries (other than BLFC). In the event of a bankruptcy, liquidation, or dissolution of a subsidiary (other than BLFC) and following payment of its liabilities, the subsidiary may not have sufficient assets remaining to make payments to Bunge as a shareholder or otherwise. \nCredit Ratings\n—Bunge's debt ratings and outlook by major credit rating agencies at December 31, 2024 were as follows:\n \nShort-term Debt\n(1)\n \nLong-term Debt\n \nOutlook\nStandard & Poor's\nA-2\nBBB+\nCreditWatch Positive\nMoody's\nP-2\nBaa1\nStable\nFitch\nF-2\nBBB+\nStable\n(1)\nShort-term debt rating applies only to the commercial paper program with BLFC as the issuer.\nFollowing the announcement of the Viterra Acquisition and the related financing activity described above, all three rating agencies reviewed our credit ratings and published updated credit opinions on us, reflecting their views of the credit profile of the Company both on a current standalone basis, and a pro-forma at closing basis. As well as with the issuance of Bunge Senior Notes in September 2024, S&P, Moody’s, and Fitch have taken the following actions:\n50\nTable of Contents\n•\nS&P upgraded Bunge’s long-term debt credit rating to BBB+ on June 13, 2023 and further placed the outlook on CreditWatch Positive for an upgrade to A- on September 9, 2024;\n•\nS&P also assigned a preliminary A- issue-level rating to Bunge's newly issued 2024 Senior Notes on September 10, 2024;\n•\nMoody’s upgraded Bunge’s long-term debt credit rating to Baa1 on August 1, 2024 with stable outlook; and\n•\nFitch upgraded Bunge’s long-term debt credit rating to BBB+ on September 5, 2024 with stable outlook.\nWe expect Standard and Poor's to resolve their CreditWatch Positive status at or before the closing date of the Acquisition, based on a variety of factors including but not limited to our operating performance, our financial position and high certainty that the Acquisition will close.\nOur debt agreements do not have any credit rating downgrade triggers that would accelerate maturity of our debt. However, credit rating downgrades would increase borrowing costs under our syndicated credit facilities (a credit rating upgrade, on the other hand, would reduce our borrowing cost) and, depending on their severity, could impede our ability to obtain credit facilities or access the capital markets in the future on competitive terms. A significant increase in our borrowing costs could impair our ability to compete effectively in our business relative to competitors with higher credit ratings.\nOur credit facilities and certain senior notes require us to comply with specified financial covenants, including minimum current ratio, maximum debt to capitalization ratio, and limitations on secured indebtedness. We were in compliance with these covenants as of December 31, 2024.\nTrade Receivable Securitization Program\nBunge and certain of its subsidiaries participate in a trade receivables securitization program (the \"Program\") with a financial institution, as administrative agent, and certain commercial paper conduit purchasers and committed purchasers (collectively, the \"Purchasers\"). The Program is designed to enhance our financial flexibility by providing an additional source of liquidity for our operations. As referenced in \nNote 4 - Trade Accounts Receivable and Trade Receivables Securitization Program\n, the aggregate size of the program is\n \n$1.5 billion, with an accordion feature of $1 billion.\n \nThe Program terminates on May 17, 2031; however, each committed purchaser's commitment to purchase trade receivables under the Program will terminate on December 16, 2025, with a feature that permits us to request 364-day extensions.\n \nUnder the Program's pledge structure, Bunge Securitization B.V. (\"BSBV\"), a consolidated bankruptcy remote special purpose entity, transfers certain trade receivables to the Purchasers in exchange for a cash payment up to the aggregate size of the Program. Bunge also retains ownership of a population of unsold receivables. BSBV agrees to guaranty the collection of sold receivables and grants a lien to the administrative agent on all unsold receivables. Collections on unsold receivables and guarantee payments are classified as operating activities in our consolidated statements of cash flows. Bunge’s risk of loss following the sale of the trade receivables is substantially the same and limited to the assets of BSBV, primarily comprised of unsold receivables pledged to the administrative agent. \nInterest Rate Swap Agreements\nWe may use interest rate swaps in hedge accounting relationships and record the swaps at fair value in the consolidated balance sheets with changes in fair value recorded contemporaneously in earnings. Additionally, the carrying amount of the associated debt is adjusted through earnings for changes in fair value due to changes in benchmark interest rates. See \nNote 16- Derivative Instruments and Hedging Activities\n to our consolidated financial statements.\n51\nTable of Contents\nEquity\nTotal equity is set forth in the following table:\n \nDecember 31,\n(US$ in millions)\n2024\n2023\nRegistered shares\n$\n1\n \n$\n1 \nAdditional paid-in capital \n(1)\n5,325\n \n5,900 \nRetained earnings\n12,838\n \n12,077 \nAccumulated other comprehensive loss\n(6,702)\n(6,054)\nTreasury shares, at cost (2024—21,318,307 and 2023—16,109,804) \n(1)\n(1,549)\n(1,073)\nTotal Bunge shareholders' equity\n9,913\n \n10,851 \nNoncontrolling interests\n1,032\n \n963 \nTotal equity\n$\n10,945\n \n$\n11,814 \n(1)    \nIn the fourth quarter of 2024, Bunge Global SA cancelled 6,146,930 shares held in treasury totaling $572 million.\nTotal Bunge shareholders' equity was $9,913 million at December 31, 2024 compared to $10,851 million at December 31, 2023. The decrease was primarily due to $1,100 million in repurchases of registered shares, as described in \nNote 22- Equity  \nto our consolidated financial statements and in the\n Share repurchase program \nparagraph below\n, \n$648 million of loss in Other comprehensive loss and $373 million of declared dividends to shareholders, as described in \nNote 22- Equity,\n partially offset by $1,137 million of Net income attributable to Bunge shareholders.\nNoncontrolling interests increased to $1,032 million at December 31, 2024 from $963 million at December 31, 2023 primarily due to $52 million of Net income attributable to noncontrolling interests and $53 million of contributions from noncontrolling interests, partially offset by $32 million of loss in Other comprehensive loss.\nShare repurchase program \n- As noted in \nNote 22- Equity,\n on November 13, 2024, Bunge Global SA's Board approved the expansion of an existing program by an additional $500 million bringing total authorizations under the program since inception to $2.7 billion. The program continues to have an indefinite term. As of December 31, 2024, a total of 19,667,739 shares were repurchased under the program for $1.9 billion with an aggregate purchase authorization of approximately $800 million remaining outstanding for repurchases under the program. During the twelve months ended December 31, 2024, Bunge repurchased 12,150,763 shares for $1.1 billion.\nCash Flows\nYear ended December 31, \n(US$ in millions)\n2024\n2023\nCash provided by operating activities\n$\n1,900\n \n$\n3,308 \nCash used for investing activities\n(1,114)\n(1,009)\nCash used for financing activities\n(90)\n(856)\nEffect of exchange rate changes on cash and cash equivalents and restricted cash\n9\n \n28 \nNet increase in cash and cash equivalents and restricted cash\n$\n705\n \n$\n1,471 \nOur cash flows from operations vary depending on, among other items, Net income and the market prices and timing of the purchase and sale of our inventories. Generally, during periods when commodity prices are rising, our Agribusiness operations require increased use of cash to support working capital to acquire inventories and fund daily settlement requirements on exchange traded futures that we use to minimize price risk related to the purchase and sale of our inventories.\n2024 Compared to 2023\nFor the year ended December 31, 2024, our cash and cash equivalents, restricted cash, and cash held for sale increased $705 million, compared to an increase of $1,471 million for the year ended December 31, 2023.\nOperating: \nCash provided by operating activities was $1,900 million for the year ended December 31, 2024, compared to $3,308 million for the year ended December 31, 2023, a decrease of $1,408 million. The decrease was primarily due to lower reported net income during the year ended December 31, 2024 compared to the year ended December 31, 2023 as discussed in \n52\nTable of Contents\nthe \nSegment Overview & Results of Operations\n section above as well as an overall reduction to net changes in working capital driven by the drivers discussed in \nWorking Capital \nsection above. \nCertain of our non-U.S. operating subsidiaries are primarily funded with U.S. dollar-denominated debt, while currency risk is hedged with U.S. dollar-denominated assets. The functional currency of our operating subsidiaries is generally the local currency. The financial statements of our subsidiaries are calculated in the functional currency, and when the local currency is the functional currency, translated into U.S. dollars. U.S. dollar-denominated loans are remeasured into their respective functional currencies at exchange rates at the applicable balance sheet date. Also, certain of our U.S. dollar functional operating subsidiaries outside the U.S. are partially funded with local currency borrowings, while the currency risk is hedged with local currency denominated assets. Local currency loans in U.S. dollar functional currency subsidiaries outside the U.S. are remeasured into U.S. dollars at the exchange rate on the applicable balance sheet date. The resulting gain or loss is included in our consolidated statements of income as Foreign exchange (losses) gains - net. For the year ended December 31, 2024, we recorded a foreign currency loss on net debt of $174 million largely due to the weakening of the Brazilian \nreal\n in the current year versus a foreign currency gain on net debt for the year ended December 31, 2023 of $281 million, which were included as adjustments to reconcile Net income to Cash provided by operating activities in the line item \"Foreign exchange loss (gain) on net debt\" in our consolidated statements of cash flows. This adjustment is required as the gains and losses are non-cash items that arise from financing activities and therefore will have no impact on cash flows from operations.\nInvesting: \nCash used for investing activities was $1,114 million for the year ended December 31, 2024 compared to $1,009 million for the year ended December 31, 2023, an increase of $105 million. The increase was primarily due to higher net payments for investments at Bunge Financial Services, higher spend on capital expenditures related to certain growth and productivity projects in North America, and lower proceeds from the disposal of businesses and property, plant and equipment during the year ended December 31, 2024, as compared to proceeds received on the sale of our Russian operations during the year ended December 31, 2023. These uses of cash were partially offset by proceeds from the sale of our investment in affiliate, BP Bunge Bioenergia, to BP. \nFinancing: \nCash used for financing activities was $90 million for the year ended December 31, 2024 compared to $856 million for the year ended December 31, 2023, a decrease of $766 million. For the year ended December 31, 2024, we received additional net cash proceeds from short-term and long-term debt of $1,186 million as a result of the issuance of three tranches of Senior Notes for an aggregate principal amount of $2.0 billion, partially offset by the prepayment of a $750 million term loan that occurred in 2024, as described above, and repurchased an additional $500 million registered shares compared to the previous period. \nCapital Expenditures\nOur cash payments made for capital expenditures were $1,376 million and $1,122 million for the years ended December 31, 2024 and 2023, respectively. We intend to make capital expenditures in the range of $1.5 billion to $1.7 billion in 2025. Our priorities for 2025 are to maintain the cash generating capacity of our assets through non-discretionary projects, such as maintenance, safety and compliance, as well as discretionary investments in growth and productivity projects, focusing on our strategy to strengthen our oilseeds platform, increase participation in biofuels and plant-based proteins, and grow our value-added oils business. These discretionary and non-discretionary capital investments will also help us achieve certain of our environmental and sustainability related objectives. We intend to fund these capital expenditures primarily with cash flows from operations and cash on hand.\nOff-Balance Sheet Arrangements \nGuarantees and Indemnifications\nPlease refer to \nNote 20- Commitments and Contingencies\n to our consolidated financial statements included as part of this Annual Report on Form 10-K for details concerning our off-balance sheet arrangements related to guarantees and indemnifications. \n53\nTable of Contents\nContractual Obligations\nThe following table summarizes our scheduled contractual obligations and their expected maturities at December 31, 2024, and the effect such obligations are expected to have on our liquidity and cash flows in the future periods indicated.\n \nPayments due by period\n(US$ in millions)\nTotal\n2025\n2026 - 2027\n2028 - 2029\n2030 and thereafter\nShort-term debt\n$\n875\n \n$\n875 \n$\n— \n$\n— \n$\n— \nLong-term debt, including current portion\n(1)\n5,663\n \n690 \n1,627 \n1,464 \n1,882 \nVariable interest rate obligations\n149\n \n33 \n71 \n30 \n15 \nInterest obligations on fixed rate debt\n898\n \n169 \n297 \n205 \n227 \nNon-cancelable lease obligations\n(2)\n1,077\n \n315 \n354 \n143 \n265 \nCapital commitments\n243\n \n243 \n— \n— \n— \nFreight supply agreements\n(3)\n138\n \n138 \n— \n— \n— \nInventory purchase commitments\n188\n \n182 \n3 \n2 \n1 \nPower supply purchase commitments\n77\n \n28 \n27 \n9 \n13 \nOther commitments and obligations\n(4)\n669\n \n310 \n191 \n90 \n78 \nTotal contractual cash obligations\n(5) \n$\n9,977\n \n$\n2,983 \n$\n2,570 \n$\n1,943 \n$\n2,481 \n(1)\nIncludes components of long-term debt attributable to unamortized premiums of $32 million and excludes components of long-term debt attributable to fair value hedge accounting of $269 million.\n(2)\nRepresents future minimum payments under non-cancelable leases with initial terms of one year or more. Minimum lease payments have not been reduced by minimum sublease income receipts of $57 million due in future periods under non-cancelable subleases.\n(3)\nRepresents purchase commitments for time on ocean freight vessels and railroad freight lines for the purpose of transporting agricultural commodities. The ocean freight service agreements are short term contracts with a duration of less than a year. Ocean freight service agreements with terms in excess of one year are included in non-cancelable lease obligations. The railroad freight service agreements require a minimum monthly payment regardless of the actual level of freight services used. The costs of our freight supply agreements are typically passed through to our customers as a component of the prices we charge for our products. However, changes in the market value of such freight services compared to the rates at which we have contracted them may affect margins on the sales of agricultural commodities.\n(4)\nRepresents other purchase commitments and obligations, such as take-or-pay contracts, throughput contracts, and debt commitment fees.\n(5)\nDoes not include estimated payments of liabilities associated with uncertain income tax positions. As of December 31, 2024, Bunge had uncertain income tax liabilities of $75 million, including interest and penalties. At this time, we are unable to make a reasonably reliable estimate of the timing of payments in individual years in connection with these tax liabilities; therefore, such amounts are not included in the above contractual obligations table. See \nNote 14- Income Taxes\n to our consolidated financial statements.\nEmployee Benefit Plans\nWe expect to contribute $14 million to our defined benefit pension plans and $4 million to our postretirement benefit plans in 2025. Further, we expect approximately $508 million in benefit payments related to our defined benefit pension and postretirement benefit plans in 2025. The expected benefit payments in 2025 include $487 million related to the lump sum payments and transfer of all remaining benefits due to the future conversion of the buy-in contract to a buy-out arrangement for one of Bunge's defined benefit U.S. pension plans. See \nNote 18- Employee Benefit Plans \nfor further information.  \n54\nTable of Contents\nCritical Accounting Policies and Estimates\nOur accounting policies are more fully described in \nNote 1- Nature of Business, Basis of Presentation and Significant Accounting Policies \nto our consolidated financial statements included as part of this Annual Report on Form 10-K. As disclosed in Note 1, the preparation of financial statements in conformity with U.S. GAAP requires management to make substantial judgment or estimation in their application that may significantly affect reported amounts in the consolidated financial statements and accompanying notes. Actual results could differ significantly from those estimates. We believe the following discussion addresses our most critical accounting policies, which are those that are most important to the portrayal of our financial condition and results of operations and require management's most difficult, subjective and complex judgments.\nForeign Currency Transactions and Translation of Foreign Currency Financial Statements\nOur reporting currency is the U.S. dollar. The functional currency of the majority of our foreign subsidiaries is their local currency. The determination of functional currency may require significant judgment to identify the currency of the primary economic environment in which a subsidiary operates. This may include an evaluation of a number of economic factors including, cash flow, sales price, sales market, expense, and financing indicators, as well, as the extent of the subsidiary’s intra-entity transactions. However, in accordance with U.S. GAAP, if a foreign entity's economy is determined to be highly inflationary, then such foreign entity's financial statements are remeasured as if the functional currency were the reporting currency.\nMonetary assets and liabilities denominated in currencies other than the functional currency are remeasured into their respective functional currencies at exchange rates in effect at the balance sheet date. The resulting exchange gain or loss is included in our consolidated statements of income as Foreign exchange (losses) gains - net unless the remeasurement gain or loss relates to an intercompany transaction that is of a long-term investment nature and for which settlement is neither planned nor anticipated in the foreseeable future, in which case the remeasurement gain or loss is reported as a component of Accumulated other comprehensive loss in our consolidated balance sheets.\nAt period-end, amounts included in the consolidated statements of income, comprehensive income, cash flows, and changes in equity are translated using average exchange rates during each period. Assets and liabilities are translated at period-end exchange rates and resulting foreign currency translation adjustments are recorded in the consolidated balance sheets as a component of Accumulated other comprehensive loss. \nInventories and Commodity Derivatives\nOur RMI, forward RMI purchase and sale contracts, and exchange-traded futures and options are primarily valued at fair value. RMI are freely-traded, have quoted market prices, may be sold without significant additional processing and have predictable and insignificant disposal costs (see \nNote 5- Inventories\n to our consolidated financial statements for RMI balances as of December 31, 2024). We estimate the fair values of commodity inventories and forward purchase and sale contracts on these inventories based on commodity futures exchange quotations, broker or dealer quotations, or market transactions in either listed or over-the-counter (\"OTC\") markets with appropriate adjustments for differences in local markets where our inventories are located. Certain inventories may utilize significant unobservable data related to local market adjustments to determine fair value. The significant unobservable inputs for RMI and physically-settled forward purchase and sale contracts relate to certain management estimates regarding transportation costs and other local market or location-related adjustments, primarily freight-related adjustments in the interior of Brazil and the lack of market corroborated information in Canada. In both situations, we use proprietary information such as purchase and sale contracts and contracted prices to value freight, premiums, and discounts in our contracts. Counterparty credit and performance risk on forward commodity purchase and sale contracts is included in the determination of fair value. From time to time, we have experienced instances of counterparty non-performance as a result of significant declines in counterparty profitability under these contracts due to movements in commodity prices between the time the contracts were executed and the contractual forward delivery period. However, based on historical experience with our suppliers and customers, our own credit risk, and knowledge of current market conditions, we do not view non-performance risk to be a significant input to fair value for the majority of our forward commodity purchase and sale contracts. \nChanges in the fair values of these inventories and contracts are recognized in our consolidated statements of income as a component of Cost of goods sold. If we used different methods or factors to estimate fair values, amounts reported as Inventories and Unrealized gains and losses on derivative contracts in the consolidated balance sheets and Cost of goods sold in the consolidated statements of income could differ. Additionally, if market conditions change subsequent to year-end, amounts reported in future periods as Inventories, Unrealized gains and losses on derivative contracts, and Cost of goods sold could differ. See \nNote 15- Fair Value Measurements \nto our consolidated financial statements for further details of commodity inventories and forward purchase and sale contracts on these inventories carried at fair value.\n55\nTable of Contents\nDerivatives - Designated Hedging Activities \nWe manage currency risk on certain forecasted purchases, sales and selling, general and administrative expenses with currency forwards designated as cash flow hedges. Assuming normal market conditions, the change in the market value of such derivative instruments has historically been, and is expected to continue to be, highly effective at offsetting changes in price movements of the hedged item. Gains and losses arising from open and closed hedging transactions are deferred in Accumulated other comprehensive loss, net of applicable income taxes, and recognized as a component of earnings in the consolidated statement of income in the same caption as the hedged items when the hedged item is recognized in earnings. If it is determined that the derivative hedging instruments are no longer effective at offsetting changes in the price of the hedged item, then the changes in the market value of the derivative instrument would be recorded immediately in the consolidated statements of income in the same caption as the hedged items. See \nNote 16- Derivative Instruments and Hedging Activities \nto our consolidated financial statements for further details and impacts of cash flow hedges on the consolidated financial statements.\nGoodwill\nWhen we acquire a business, the consideration is first assigned to identifiable assets and liabilities, including intangible assets, based on estimated fair values, with any excess recorded as goodwill. Determining fair value requires significant estimates and assumptions based on an evaluation of a number of factors, including market participants, projected growth rates, the amounts and timing of future cash flows, the discount rates applied to the cash flows, and the determination of useful life of an asset.  \nOur goodwill balance is not amortized to expense. Instead, it is tested for impairment at least annually. We generally perform our annual impairment analysis during the fourth quarter. If events or indicators of impairment occur between annual impairment analyses, we perform an impairment analysis at that date. These events or circumstances could include a significant change in the business climate, legal factors, operating performance indicators, competition, or sale or disposition of a significant asset. In testing for a potential impairment of goodwill, we: (1) determine our reporting units; (2) allocate goodwill to our various reporting units to which the acquired goodwill relates; (3) determine the carrying value, or book value, of our reporting units; (4) estimate the fair value of each reporting unit using a discounted cash flow model and/or a market multiples model based on guideline public companies; (5) compare the fair value of each reporting unit to its carrying value; and (6) if the estimated fair value of a reporting unit is less than the carrying value, we recognize an impairment charge for such amount, but not exceeding the total amount of goodwill allocated to that reporting unit. \nThe process of evaluating the potential impairment of goodwill is subjective and requires significant judgment at many points during the analysis, including the identification of our reporting units, identification and allocation of the assets and liabilities to each of our reporting units, and determination of fair value. In estimating the fair value of a reporting unit for the purposes of our annual or periodic impairment analysis, we make estimates and significant judgments about the future cash flows of that reporting unit aligned with management’s strategic business plans. Changes in judgment related to these assumptions and estimates could result in goodwill impairment charges. We believe the assumptions and estimates used are appropriate based on the information currently available to management. Estimates based on market earnings multiples of peer companies identified for the reporting unit may also be used, where available. Critical estimates in the determination of fair value under the income approach include, but are not limited to, assumptions about variables such as commodity prices, crop and related throughput and production volumes, profitability, future capital expenditures, other expenses, and discount rates, all of which are subject to a high degree of judgment. Critical estimates in the determination of fair value under the market approach include, but are not limited to, determination of the guideline public companies and selection of the market multiples. \nDuring the fourth quarter of 2024, we performed our annual impairment assessment using a discounted cash flow (\"DCF\") method from the income approach and a guideline public companies method (\"GPC\") from the market approach, giving equal emphasis to each. We determined equal emphasis was appropriate as the DCF method captured the growth and margin expectations specific to the reporting units; whereas the GPC method captured market-specific factors using a reasonably similar set of guideline public companies. The results of our annual impairment assessment determined that the estimated fair values of each of our goodwill reporting units exceeded each of their carrying values by a significant amount. See \nNote 8- Goodwill, \nto our consolidated financial statements. \n56\nTable of Contents\nProperty, Plant and Equipment and Other Finite-Lived Intangible Assets\nLong-lived assets include property, plant and equipment and other finite-lived intangible assets. Property, plant and equipment and finite-lived intangible assets are depreciated or amortized over their estimated useful life on a straight line basis. When facts and circumstances indicate the carrying values of these assets may be impaired, an evaluation of recoverability is performed by comparing the carrying value of the assets to the undiscounted projected future cash flows to be generated by such assets from their use and ultimate disposal. If the carrying value of our assets is not recoverable, we recognize an impairment loss in the amount that carrying value exceeds fair value. Impairment is recognized as a charge against results of operations. Our judgments related to the expected useful lives of these assets and our ability to realize undiscounted cash flows in excess of the carrying amount of such assets are affected by factors such as the ongoing maintenance of the assets, changes in economic conditions and changes in operating performance. As we assess the ongoing expected cash flows and carrying amounts of these assets, changes in these factors could cause us to realize material impairment charges. \nInvestments in Affiliates\nWe have investments in various unconsolidated joint ventures accounted for using the equity method, minus impairment. We review our investments annually or when an event or circumstances indicate that a potential decline in value may be other than temporary. We consider various factors in determining whether to recognize an impairment charge, including the length of time the fair value of the investment is expected to be below its carrying value, the financial condition, operating performance and near-term prospects of the affiliate, and our intent and ability to hold the investment for a period of time sufficient to allow for recovery of the fair value. During the third quarter of 2024, certain of the above factors indicated an other than temporary decline in value of one of our minority investments in North America. Critical estimates in the determination of the fair value include, but are not limited to, future expected cash flows, revenue growth, and discount rates. If we used different methods or factors to estimate fair value, the amount of recorded impairment and the carrying value of our investments could differ. Please refer to \nNote 10- Impairments \nand \nNote 11- Investments in Affiliates and Variable Interest Entities\n to our consolidated financial statements for further details. \nContingencies\nWe are a party to a large number of claims and lawsuits, primarily non-income tax and labor claims in Brazil and non-income tax claims in Argentina, and we make provisions for potential liabilities arising from such claims when we deem them probable and reasonably estimable. These estimates of probable loss have been developed in consultation with in-house and outside counsel and are based on an analysis of potential results, assuming a combination of litigation and settlement strategies. Future results of operations for any particular quarterly or annual period could be materially affected by changes in our assumptions or the effectiveness of our strategies relating to these proceedings. For more information on tax and labor claims in Brazil, see \"Item 3. \nLegal Proceedings\n\" and \nNote 20- Commitments and Contingencies\n to our consolidated financial statements.\nIndemnifications \nWe have provided certain indemnifications in connection with our divestitures. In some instances, we have recorded indemnification liabilities upon inception measured at fair value in accordance with ASC 460, \nGuarantees \nand ASC 450, \nContingencies\n. The estimates to determine the fair value prioritize observable inputs in accordance with ASC 820, \nFair Value Measurement\n. Our estimation techniques often employ probability weighting, assigning probabilities to various outcomes and weighting the associated costs accordingly, based on consultations with internal experts. Changes in these assumptions and estimates could impact the recorded liability. During the fourth quarter of 2024, in connection with the sale of our 50% interest in BP Bunge Bioenergia, we agreed to indemnify BP against future losses associated with certain legal claims as defined in the share purchase agreement\n.\n As a consequence, we recognized a liability of $95 million. Refer to \nNote 20- Commitments and Contingencies \nto our consolidated financial statements for further details. \nIncome Taxes\nWe record valuation allowances to reduce our deferred tax assets to the amount that we are likely to realize. We apply a \"more likely than not\" threshold to the recognition and de-recognition of tax benefits. Accordingly, we recognize the amount of tax benefit that has a greater than 50% likelihood of being ultimately realized upon settlement. We consider projections of future taxable income and prudent tax planning strategies to assess the need for and the amount of the valuation allowances. If we determine that we can realize a deferred tax asset in excess of our net recorded amount, we decrease the valuation allowance, thereby decreasing income tax expense. Conversely, if we determine that we are unable to realize all or part of our net deferred tax asset, we increase the valuation allowance, thereby increasing income tax expense. During 2024, we increased valuation allowances by $5 million, primarily attributable to current year operations offset by currency movement in certain jurisdictions.\nThe calculation of our uncertain tax positions involves complexities in the application of intricate tax regulations in a multitude of jurisdictions across our global operations. Future changes in judgment related to the ultimate resolution of \n57\nTable of Contents\nunrecognized tax benefits will affect the earnings in the quarter of such change. At December 31, 2024, we had recorded uncertain tax positions of $75 million in our consolidated balance sheet. For additional information on income taxes, please refer to \nNote 14- Income Taxes\n to our consolidated financial statements.\nRecoverable Taxes\nWe evaluate the collectability of our recoverable taxes and record allowances if we determine that collection is doubtful. Recoverable taxes include value-added taxes paid upon the acquisition of property, plant and equipment, raw materials and taxable services, as well as other transactional taxes, which can be recovered in cash or as compensation against income taxes, or other taxes we may owe, primarily in Brazil and Europe. Management's assumption about the collectability of recoverable taxes requires significant judgment because it involves an assessment of the ability and willingness of the applicable federal or local government to refund the taxes. The balance of these allowances fluctuates depending on the sales activity of existing inventories, purchases of new inventories, percentages of export sales, seasonality, changes in applicable tax rates, cash payments by the applicable government agencies and the offset of outstanding balances against income or certain other taxes owed to the applicable governments, where permissible. At December 31, 2024, the allowance for recoverable taxes was $25 million. W\ne continue to monitor the economic environment and events taking place in the applicable countries and in cases\n where we determine that recovery is doubtful, recoverable taxes are reduced by allowances for the estimated unrecoverable amounts.\nNew Accounting Pronouncements\nSee \nNote 1- Nature of Business, Basis of Presentation and Significant Accounting Policies\n to our consolidated financial statements included as part of this Annual Report on Form 10-K.",
  "item2": null
}