{
  "item1": "additional information sale PRV, please read Note 3, Dispositions , consolidated financial statements included report. DEVELOPMENTS KEY COLLABORATIVE RELATIONSHIPS additional information collaborative other relationships discussed below, please read Note 19, Collaborative Other Relationships, consolidated financial statements included report. Key developments related LEQEMBI U.S. consisted following: January 2025 FDA approved LEQEMBI monthly IV maintenance dosing treatment early Alzheimer's disease.",
  "item7": "following table describes certain patents U.S. Europe currently consider primary importance marketed products, including territory, patent number, general subject matter expected expiration dates. Except otherwise noted, expected expiration dates include any granted patent term extensions issued SPCs. some instances, there may additional later-expiring patents relating products directed to, among other things, particular forms compositions, methods manufacturing use drug treatment particular diseases conditions.",
  "item2": "Other research development costs primarily consist indirect costs incurred support overall research development activities non-specific programs, including activities benefit multiple programs, such management costs, well depreciation, information technology facility-based expenses not allocated specific program stage. Other segment expense includes: amortization impairment acquired intangible assets; collaboration profit sharing/(loss reimbursement); (gain) loss fair value remeasurement contingent consideration; restructuring charges; gain sale priority review voucher, net; other (income) expense, net; income tax (benefit) expense October 2025 entered into license agreement Vanqua acquire worldwide rights Vanqua's preclinical oral C5aR1 antagonist compound. connection closing transaction, expect make upfront payment Vanqua $ million during fourth quarter 2025, which will recognized within acquired in-process research development, upfront milestone expense condensed consolidated statements income. Sale BYOOVIZ OPUVIZ Rights October 2025 completed sale remaining commercial rights two ophthalmology assets Europe: BYOOVIZ, ranibizumab biosimilar referencing LUCENTIS, OPUVIZ, aflibercept biosimilar referencing EYLEA."
}