{
  "source_file": "bkr-20241231.htm",
  "form_type": "10-K",
  "item1": "ITEM 1. BUSINESS\nBaker Hughes Company (\"Baker Hughes,\" \"the Company,\" \"we,\" \"us,\" or \"our\") is an energy technology company with a diversified portfolio of technologies and services that span the energy and industrial value chain. Built on a century of experience and conducting business in over 120 countries, our innovative technologies and services are taking energy forward.\nOUR VISION & STRATEGY\nWith our diverse portfolio, leading technology, and unique partnership models, we are positioned to deliver outcome-based solutions across the energy and industrial markets. By integrating health, safety & environment (\"HSE\") into everything we do, we protect our people, our customers, and the environment.\nThe oil and gas macroeconomic environment continues to be complex. While we believe the world will need hydrocarbons for many decades to come - and therefore oil and gas will continue to remain relevant in meeting global energy demand - we also acknowledge the need to transition to new energy sources. Over the last several years, this transition has progressed, with governments and society focused on a long-term goal of net-zero emissions while trying to balance the \"energy trilemma\" - energy security, sustainability, and affordability. There is a growing consensus the energy transition will likely take longer than many expected due to its inherent complexity overcoming technology, economics, politics, and regulatory challenges.\nWe believe the industry is going through a transformation that requires a change in how work gets done to enable sustainable energy development. Our existing and new customers require new partnerships, commercial models and technology solutions to deliver sustainable productivity improvements and leverage economies of scale, with a lower carbon footprint. That is why our strategy is focused on improving our core competitiveness and delivering higher-productivity solutions today, while positioning to lead the energy transition and solving the energy trilemma. Our unique and diversified portfolio is expected to benefit regardless of how quickly the energy transition develops.\nOur strategy is based on three key pillars:\n•\nTransform the core\n: We are transforming our current business to improve margins and cash flow, which we are achieving through portfolio rationalization, cost improvement, and new business models.\n•\nDriving profitable growth:\n We are driving organic and inorganic growth to build our businesses in high potential markets where we have a strong position, including integrated solutions, mature assets solutions, and enhanced digital solutions.\n•\nDelivering results in new energy:\n We are making strategic investments to drive lower carbon emissions in the energy and industrial sectors, including hydrogen; carbon capture, utilization and storage (\"CCUS\"); geothermal; and clean power solutions (\"clean power\" refers to lower carbon intensity, lower lifecycle emissions, and lower quantity of greenhouse gas emissions resulting directly from fuel combustion, relative to conventional power sources derived from fossil fuels).\nWe expect to benefit from our strategy in the following ways:\n•\nScope and scale:\n We have a global presence and a broad, diversified portfolio. Our products, services, and expertise serve the upstream, midstream/liquefied natural gas (\"LNG\") and downstream sectors of the oil and gas industry, as well as broader chemical and industrial segments across a variety of verticals. We deliver through our two operating segments: Oilfield Services & Equipment (\"OFSE\") and Industrial & Energy Technology (\"IET\") as discussed below under \"Products and Services,\" and each are among the top providers for the majority of the product lines in the markets they serve.\n•\nTechnology:\n \nOur culture is built on a heritage of innovation and invention through research and development, with complementary capabilities. Technology remains a differentiator for us and a key enabler to drive the efficiency and productivity gains our customers require, as well as paving the way for longer term sustainable energy development. We also have a range of technologies that support our customers' \nBaker Hughes Company 2024 Form 10-K | 1\nefforts to reduce their carbon footprint. We remain committed to investing in our products and services to maintain our leadership position across our offerings, including $643 million research and development (\"R&D\") spend and being granted more than 1,600 patents worldwide in 2024.\n•\nEnergy transition solutions:\n We are positioned to support our customers' efforts to reduce their carbon footprint with a range of emissions-abatement products and services, which we refer to as \"new energy.\" This includes turnkey solutions for flare reduction, CCUS, hydrogen production, transportation, storage and distribution, geothermal and clean power solutions. Over the past several years, we have made progress in strategic investments and acquisitions in emerging energy technologies to advance CCUS, hydrogen, clean power and e-fuels, as well as established strategic long-term partnerships with companies such as HIF Global, Air Products and NET Power, among others. We also continue to expand our low to zero-carbon solutions capabilities, helping customers to detect, quantify, and reduce emissions more efficiently and accurately, and complementing our existing solutions.\n•\nDigital capabilities:\n We expect to benefit from the emerging demand for more intelligent operations and the adoption of artificial intelligence (\"AI\") based solutions as part of our customers' digital transformation initiatives. In 2024, we launched CarbonEdge\nTM\n, powered by Cordant\nTM\n, an end-to-end digital solution for CCUS operations. We also signed an agreement with Repsol to collaboratively develop and deploy next-generation AI capabilities through our Leucipa™ automated field production solution.\nPRODUCTS AND SERVICES\nOur two operating segments are organized based on the nature of our markets and customers. We sell to our customers through direct and indirect channels. Our primary sales channel is through our direct sales force, which has a strong regional focus with local teams close to the customer, who are able to draw support from centers of excellence in each of our major product lines. Our products and services are sold in highly competitive markets and the competitive environment varies by product line. See discussion below by segment.\nOilfield Services & Equipment\nThe OFSE segment designs and manufactures products and provides related services and integrated solutions for onshore and offshore oilfield operations across the life cycle of an asset, ranging from exploration, appraisal, and development to production, rejuvenation, and decommissioning.\nBeyond its traditional oilfield concentration, OFSE is also expanding its capabilities and technology portfolio to meet the challenges of the energy transition, including focusing on new energy areas, such as geothermal and CCUS, strengthening its digital architecture, and addressing key energy market themes.\nThe OFSE segment is organized into four product lines.\n•\nWell Construction\n focuses on drilling and includes drilling services (directional drilling, logging-while-drilling, surface logging, and remote operations), drill bits (polycrystalline, roller cone, hybrid, and in-bit sensing), and drilling & completion fluids (emulsion-based, water-based, specialty, drill-in, and completion fluids; and waste management).\n•\nCompletions, Intervention, and Measurements\n encompasses completions (wellbore construction, upper and lower completions, unconventional multistage completions, intelligent production systems, workover systems, and fishing and through-tubing services), pressure pumping (cementing, production enhancement, coiled tubing, and tubular running services), and wireline services (openhole logging services, cased-hole logging services, and perforating and drill stem-testing services).\n•\nProduction Solutions\n \nspans artificial lift systems (electrical submersible pumping systems, surface pumping systems, rigless deployment systems, and sensors and gauges) and oilfield & industrial chemicals (upstream, downstream, and Aquaness\nTM\n wholesale chemicals).\n•\nSubsea & Surface Pressure Systems\n \nincludes subsea projects and services (subsea trees, controls, manifolds, wellheads, premium casing connectors, installation and commissioning, repairs and maintenance, well intervention, life-of-field solutions, and plug and abandonment), flexible pipe systems \nBaker Hughes Company 2024 Form 10-K | 2\n(subsea risers, subsea flowlines and jumpers, onshore reinforced thermoplastic pipe, and rehabilitation), and surface pressure control systems (surface trees and wellheads).\nThese product lines are supported by an OFSE digital group, which combines OFSE's domain expertise with a deep understanding of digital technology to improve operational safety, performance, and sustainability. Reservoir analysis proficiencies are rooted in evaluation technologies, a team of reservoir experts, and software. Together, these capabilities provide customers with a greater understanding of the subsurface, enabling smoother, faster drilling and precise wellbore placement that can lead to improved recovery and project execution driving enhanced economics. OFSE also provides integrated well services and solutions to plan and execute projects ranging from well construction and production through well abandonment, in addition to integrated services and solutions for the subsea environment.\nOFSE customers include large integrated major and super-major oil and natural gas companies; U.S. and international independent oil and natural gas companies; national or state-owned oil and natural gas companies; engineering, procurement, and construction contractors; geothermal companies; and other oilfield services companies. OFSE believes that its principal competitive differentiators in the industries and markets it serves are the technology, quality, efficiency, reliability, and availability of its products and services. A continued commitment to service delivery, HSE standards, technical proficiency, and competitive pricing is also a key factor in its success.\nOFSE products and services are sold in highly competitive markets. While OFSE may have contracts that include multiple well projects and that may extend over a multi-year period, its services and products are generally provided on a well-by-well basis. Most contracts cover pricing of the products and services, along with various limitations on liability, but do not necessarily establish an obligation to use OFSE products and services. OFSE competitors include SLB, Halliburton, NOV, Weatherford, and TechnipFMC.\nIndustrial & Energy Technology\nThe IET segment combines a broad array of domain expertise, technologies, software, and services for energy and industrial customers including on- and offshore, LNG, pipeline and gas storage, refining, petrochemical, distributed gas, nuclear, hydrogen, carbon capture, utilization and storage, clean power, geothermal and renewables. It also provides cutting edge technology for consumers of energy and/or organizations who are reliant on infrastructure integrity across a broad variety of verticals including pulp & paper, food & beverage, industrial heating, automotive and aerospace. IET solutions unlock the ability to transform, transfer, and transport energy efficiently, while capturing and cutting emissions.\nThe IET segment is organized into five product lines.\n•    \nGas Technology Equipment\n delivers highly efficient mechanical and electric-drive compression and power generation technology for projects across the natural gas value chain. The product line's portfolio includes:\n•\nDrivers, which include aero-derivative gas turbines, heavy-duty gas turbines, small- to medium-sized industrial gas turbines, steam turbines, hot gas and turboexpanders, and electric motors.\n•\nDriven equipment, which includes synchronous condensers, generators, reciprocating, centrifugal, and integrated compressors, and centrifugal pumps.\n•\nTurnkey solutions, which include power generation and gas compression modules, waste heat/energy/pressure recovery, energy storage, modularized small and large liquefaction plants, CO\n2\n compression, and storage/use solutions.\n•\nGas Technology Services\n provides advanced aftermarket support and uptime availability in critical environments and through every stage of our customers' equipment and plant life cycle. The product line portfolio includes:\n•\nDesigning, manufacturing, maintaining, and upgrading rotating equipment and combining sophisticated hardware technologies with enterprise-class software products.\n•\nAnalytics to connect customers' assets, providing them with the data, safety and security needed to improve operations reliably and efficiently.\nBaker Hughes Company 2024 Form 10-K | 3\n•\nGenuine spare parts, system upgrades, conversion solutions, digital advanced services, and turnkey solutions to refurbish and improve the output from a single machine up to an entire plant.\n•\nIndustrial Products\n includes a broad portfolio of component products and service offerings that enable industrial safety and productivity across diverse industry verticals. The product line's portfolio includes:\n•\nWaygate Technologies, which comprises non-destructive testing technology, software, and services, including industrial radiography, ultrasonic sensors, testing machines and gauges, non-destructive testing film, and remote visual inspection.\n•\nProcess & Pipeline Services, which comprises pre-commissioning and maintenance services to improve throughput and asset integrity for process facilities and pipelines, as well as inline inspection solutions to support pipeline integrity.\n•\nValves and Gears, which comprises flow technology including industrial valves, regulators, control systems, gears and other flow and process control technologies.\n•\nIndustrial Solutions\n \noffers a unique suite of hardware, software, and edge device solutions that enable asset health, performance and process optimization. Industrial Solutions combines several product lines to leverage our critical equipment hardware capability to migrate to full-plant offerings and through Cordant\nTM\n, a full-stack, edge-to-enterprise solution that encompasses our hardware, software and services offerings. The product line's portfolio includes a number of product brands including:\n•\nCordant Solutions technology includes the Bently Nevada® and System 1® product brands, providing rack-based vibrating monitoring equipment and sensors for both power generation and oil and gas operations, as well as industrial applications. The product line also provides integrated asset performance management.\n•\nPrecision Sensors & Instrumentation device technology, including the Panametrics®, Druck®, and Reuter-Stokes® product brands, provides instrumentation and sensor-based technologies to better detect and analyze pressure, flow, gas, moisture, radiation, and related conditions.\n•\nClimate Technology Solutions (\"CTS\")\n includes CCUS, hydrogen, clean power, geothermal and emissions abatement capabilities to enable energy operators, as well as users of energy in the broader industry, to achieve their emission reduction goals. This product line is the primary driver of the Company's new energy orders and is designed to accelerate the decarbonization of both energy and broader industrial verticals such as hard-to-abate industries, like steel and cement.\nIET customers for the Gas Technology Equipment and Gas Technology Services product lines are industrial, upstream, midstream, and downstream, onshore and offshore, and small-to-large scale. Midstream and downstream customers include LNG plants, pipelines, storage facilities, refineries, and a wide range of industrial and engineering, procurement, and construction companies. Products and services for the remaining IET product lines are primarily sold in a diversified arena to a broad range of customers and across multiple verticals, including aerospace, automotive, nuclear, oil and gas, mining, cement, metals, refinery and petrochemical, food and beverage, pulp & paper, and textile.\nIET differentiates itself from competitors with its diverse portfolio, expertise in technology and project management, local presence, and partnerships, to provide fully integrated solutions for a broad array of industry segments.\nIET competes across a wide range of industries, including oil and gas, power generation, aerospace, and light and heavy industrials. IET main competitors include Siemens Energy, Solar (a Caterpillar company), Mitsubishi Heavy Industry, Chart, Sulzer, Flowserve, and Emerson.\nCONTRACTS\nWe conduct our business under various types of contracts in the upstream, midstream, and downstream sectors of the oil and gas industry, including fixed-fee or turnkey contracts, transactional agreements for products and services, and long-term aftermarket service agreements. We also conduct business in a number of industrial \nBaker Hughes Company 2024 Form 10-K | 4\nmarkets and provide critical equipment hardware capability for full plant offerings, asset performance management and process optimization.\nWe benefit from stable relationships with many of our customers based on long-term project contracts and master service agreements. Several of those contracts require us to commit to a fixed price based on the customer's technical specifications with little or no relief available due to changes in circumstances. In some cases, failure to deliver products or perform services within contractual commitments may lead to liquidated damages claims. We seek to mitigate these exposures through close collaboration with our customers.\nWe strive to negotiate the terms of our customer contracts consistent with what we consider to be industry best practices. In connection with oil and gas operations, our customers typically indemnify us for certain claims arising from: the injury or death of their employees and often their contractors; the loss of or damage to their facility and equipment, and often that of their contractors; pollution originating from their equipment or facility; and all liabilities related to the well and subsurface operations, including loss or damage to the well or reservoir, loss of well control, fire, explosion, or any uncontrolled flow of oil or gas. Conversely, we typically indemnify our customers for certain claims arising from: the injury or death of our employees and often that of our subcontractors; the loss of or damage to our equipment; and surface pollution originating from our equipment while under our control. Where the above indemnities do not apply or are not consistent with industry best practices (e.g., in connection with industrial and/or digital sectors), we typically provide a capped indemnity for damages caused to the customer by our negligence and include an overall limitation of liability clause. It is also our general practice to include a limitation of liability for consequential loss, including loss of profits and loss of revenue, in all customer contracts.\nOur indemnity structure may not protect us in every case. Certain U.S. states have enacted oil and natural gas specific anti-indemnity statutes that can void the allocation of liability agreed to in a contract. Applicable law or the negotiated terms of a customer contract may also limit indemnity obligations in the event of gross negligence or willful misconduct, or in the event of breaches of applicable laws or breach of confidentiality and/or intellectual property rights. We sometimes contract with customers that are not the end user of our products. It is our practice to seek to obtain an indemnity from our customer for any end-user claims, but this is not always possible. Similarly, government agencies and other third parties may make claims in respect of which we are not indemnified and for which responsibility is assessed proportionate to fault. We have an established process to review any risk deviations from our standard contracting practices.\nThe Company maintains a commercial general liability insurance policy program that covers against certain operating hazards, including product liability claims and personal injury claims, as well as certain limited environmental pollution claims for damage to a third party or its property arising out of contact with pollution for which the Company is liable; however, clean up and well control costs are not covered by such program. All of the insurance policies purchased by the Company are subject to deductible and/or self-insured retention amounts for which we are responsible for payment, specific terms, conditions, limitations, and exclusions. There can be no assurance that the nature and amount of Company insurance will be sufficient to fully indemnify us against liabilities related to our business.\nORDERS AND REMAINING PERFORMANCE OBLIGATIONS\nRemaining performance obligations (\"RPO\"), a defined term under U.S. generally accepted accounting principles (\"U.S. GAAP\"), are unfilled customer orders for products and product services excluding any purchase order that provides the customer with the ability to cancel or terminate without incurring a substantive penalty, even if the likelihood of cancellation is remote based on historical experience. For product services, an amount is included for the expected life of the contract.\nWe recognized orders of $28.2 billion, $30.5 billion, and $26.8 billion in 2024, 2023, and 2022, respectively. We recognized OFSE orders of $15.2 billion, $16.3 billion, and $14.1 billion, and IET orders of $13.0 billion, $14.2 billion, and $12.7 billion in 2024, 2023, and 2022, respectively. As of December 31, 2024, the remaining performance obligations totaled $33.1 billion. As of December 31, 2024, OFSE remaining performance obligations totaled $3.0 billion, and IET remaining performance obligations totaled $30.1 billion.\nBaker Hughes Company 2024 Form 10-K | 5\nRESEARCH AND DEVELOPMENT\nWe engage in R&D activities across the business directed toward the development of new products, services, technology, and other solutions, as well as bringing about a significant improvement to existing products and services, and the design of specialized products to meet specific customer needs. We also continue to invest and develop a range of technologies that support our customers' efforts to reduce their carbon footprint. For the year ended December 31, 2024, we incurred $643 million of R&D expense.\nIn OFSE, we continue to fund a range of formation evaluation, drilling, completions, and production capabilities and products. In parallel, and in strong collaboration with the IET technology organization, we are investing in strategic themes that fuel our future product and service portfolios. These include themes such as digital, automation, electrification, chemistry and materials, electronics, CCUS, and geothermal.\nSpecifically for OFSE, in our Well Construction product line, we are improving reliability in high-temperature and high shock and vibration environments (harsh-drilling conditions), through a combination of optimized design, automated operations, and integrated solutions that leverage our drilling tools, drill bits, and drilling fluids technologies. In our Completions, Intervention, and Measurements product line, we are investing in intelligent solutions and advanced measurements while creating a leadership position in the well-intervention domain through the integration of our wireline measurement capabilities with the conveyance and intervention capabilities. In our Production Solutions product line, we are leveraging our artificial lift technologies with our chemical solutions to provide an optimized and automated portfolio of production-enhancing solutions. In our Subsea & Surface Pressure Solutions product line, we continue to develop subsea production systems that improve performance and reduce emissions through lighter design, automated operations, and electrification. Our offshore flexible pipe systems optimized for higher pressure temperature and CO2 content continue to deliver greater sustainability and performance.\nIn IET, we continue to invest in and develop foundational technologies which will enable our journey for the energy transition. Such technologies include advanced materials, advanced manufacturing technologies, novel process technologies, and digital technologies such as advanced sensing & diagnostics, data sciences, and artificial intelligence. Within Gas Technology Equipment and Gas Technology Services product lines, we are focusing on our latest generation of gas turbines for energy efficiency and reduced carbon footprint such as our LM9000\nTM\n and Nova LT\nTM\n products, as well as Allam Cycle turboexpander, CCUS, and hydrogen and geothermal technologies. Within Industrial Technology, we are investing in advanced digital solutions designed to improve the efficiency, reliability, and safety of oil and gas, aerospace, energy, and broader industrial production and operations. This includes our Orbit 60 Bently Nevada product for critical asset monitoring in turbine systems, including wind, hydro, and gas turbines. The IET segment is also enhancing its process and safety valve business bringing new digital applications including analytics to our customers. Investments in Industrial Technology also include technologies to measure, monitor, and minimize carbon emissions, new inspection technologies for nondestructive evaluation of materials and structures as well as solutions for industrial asset management.\nINTELLECTUAL PROPERTY\nOur technology, brands and other intellectual property (\"IP\") rights are important elements of our business. We rely on patent, trademark, copyright, and trade secret laws, as well as non-disclosure and employee invention assignment agreements to protect our IP rights. Many patents and patent applications comprise the Baker Hughes portfolio and are owned by us. Other patents and patent applications applicable to our products and services are licensed to us by GE Aerospace (NYSE: GE) and GE Vernova (NYSE: GEV) and, in some cases, third parties. In particular, we have an IP cross-license agreement with GE Aerospace and GE Vernova that allows all parties to have continued rights to commercially utilize certain IP of the other pursuant to the terms of the agreement. The IP cross-license remains in place following General Electric exiting its ownership position in us. We do not consider any individual patent to be material to our business operations.\nWe follow a policy of seeking patent and trademark protection in numerous countries and regions throughout the world for products and methods that we believe appear to have commercial significance. We believe that maintenance, protection and enforcement of our patents, trademarks, and related IP rights is central to the conduct of our business, and pursue protection of our IP rights against infringement, misappropriation, or other violation worldwide as may be necessary to protect our business. Additionally, we consider the quality and timely delivery of our products, the service we provide to our customers, and the technical knowledge and skills of our personnel to \nBaker Hughes Company 2024 Form 10-K | 6\nbe other important components of the portfolio of capabilities and assets supporting our ability to compete. If we are not able to protect our IP or if those rights are invalidated or circumvented, our business may be adversely affected. We may be subject to litigation and infringement claims, which could cause us to incur significant expenses or prevent us from selling our products or services.\nSEASONALITY\nOur operations can be affected by seasonal events, which can temporarily affect the delivery and performance of our products and services, and our customers' budgetary cycles. Examples of seasonal events that can impact our business are set forth below:\n•\nIn OFSE, adverse weather conditions, such as hurricanes in the Gulf of Mexico or extreme heat in the Middle East during the summer months, may impact our operations or our customers' operations, cause supply disruptions and result in a loss of revenue and/or damage to our equipment and facilities, which may or may not be insured. For more information on seasonal and weather conditions, see the \"Operational Risks\" section of Part 1 of Item 1A herein.\n•\nSevere weather during the winter months normally results in reduced activity levels in the North Sea in OFSE generally in the first quarter and may interrupt or curtail our operations, or our customers' operations, in those areas and result in a loss of revenue.\n•\nMany of our international OFSE customers may increase activity for certain products and services in the fourth quarter as they seek to fully utilize their annual budgets.\n•\nOur broader IET businesses typically experience higher customer activity, as a result of spending patterns in the second half of the year.\nRAW MATERIALS\nWe purchase various raw materials and component parts for use in manufacturing our products and delivering our services. The principal raw materials we use include steel alloys, chromium, nickel, titanium, barite, beryllium, copper, lead, tungsten carbide, synthetic and natural diamonds, gels, sand and other proppants, printed circuit boards and other electronic components, and hydrocarbon-based chemical feed stocks. Raw materials that are essential to our business are normally readily available from multiple sources but may be subject to price volatility. We have seen prices stabilize for ferrous and non-ferrous metals and other raw materials, but availability of nickel based super alloys is constrained. Our procurement teams utilize advanced planning and may enter into strategic agreements with our global suppliers to minimize price impacts and other availability challenges. We anticipate some pricing and fulfillment volatility for certain raw materials, components, and certain logistics lanes to continue through 2025.\nIn addition to raw materials and component parts, we also use the products and services of metal fabricators, machine shops, foundries, forge shops, assembly operations, contract manufacturers, logistics providers, packagers, indirect material providers, and others in order to produce and deliver products to customers. These materials and services are generally available from multiple sources.\nENVIRONMENTAL, SOCIAL AND GOVERNANCE (\"ESG\")\nSustainability\nWe believe we have an important role to play in society as an industry leader and partner. We view ESG as a lever to transform the performance of our Company. In 2019, we made a commitment to reduce Scope 1 and 2 carbon dioxide equivalent emissions from our operations by 50% by 2030 and achieve net-zero emissions by 2050. This goal encompasses emissions from our operations (\"Scope 1 and 2 carbon dioxide equivalent emissions\") in alignment with the Paris Agreement and the specific recommendations of the United Nations (\"UN\") Intergovernmental Panel on Climate Change's Special Report on Global Warming of 1.5\no\nC.\nWe continue to make progress on emissions reductions. We reported in our 2023 Corporate Sustainability Report a 28.3% reduction in our Scope 1 and 2 carbon dioxide equivalent emissions as compared to our 2019 base year. This reduction was primarily due to implementing energy efficiency initiatives, facility consolidation, increasing \nBaker Hughes Company 2024 Form 10-K | 7\nelectric power consumption from renewable energy sources, and improvements in our vehicle fleet, among other reasons. We plan to continue to employ a broad range of emissions reduction initiatives across manufacturing, supply chain, logistics, energy sourcing, and generation. Our latest Corporate Sustainability Report is available on the Company section of our website at \nwww.bakerhughes.com\n. Information contained on or connected to our website is not incorporated by reference into this annual report on Form 10-K for the year ended December 31, 2024 (\"Annual Report\") and should not be considered part of this Annual Report or any other filing we make with the Securities and Exchange Commission (\"SEC\").\nOur sustainability commitments include our formal participation in the UN Global Compact (\"UNGC\") and our commitment to the UNGC's Ten Principles including human rights, labor, environment, and anti-corruption, as well as the UNGC's Sustainable Development Goals. We have annually renewed our commitment to the UNGC since joining in 2019.\nSocial & Human Capital\nAt Baker Hughes, our people are central contributors to our purpose of taking energy forward. As an energy technology company with operations around the world, we believe that a diverse workforce is critical to our success, and we aim to attract the best talent to support the energy transition. We strive to be an inclusive and safe workplace, with opportunities for our employees to grow and develop in their careers, supported by learning and development opportunities, competitive compensation, benefits, health and wellness programs, and by programs that build connections between our employees and their communities.\nAs of December 31, 2024, we had approximately 57,000 employees. More than 45,000 of our employees work outside the U.S. in over 85 different countries with more than 150 nationalities represented. This diversity of global perspectives makes our Company stronger, more resilient, and more responsive to our global customers.\nDiversity, Inclusion and Belonging\nAt our core, we believe that unique ideas and diverse perspectives are the driving forces behind innovation. Our differences make us stronger. We value diversity in all its forms—gender, race, ethnicity, age, gender identity, sexual orientation, ability, cultural background, religion, veteran status, experience, thought, and more—across the globe. We recognize that diverse teams, an equitable workplace, and an inclusive culture are essential for driving innovation and maintaining our competitive edge. These elements are critical to our business success and our mission of advancing energy solutions for our customers and the industry. Our Diversity, Inclusion and Belonging strategic framework empowers us to recruit and retain the best talent, foster an inclusive culture, and strengthen our partnerships with customers and communities. As we continue to prioritize attracting, retaining and developing the best talent, we are dedicated to making meaningful progress across our organization, with a particular focus on inclusivity and belonging. Together, we are building a stronger, more innovative future.\nIn 2024, the percentage of people who identify as women in our workforce, senior leadership positions, and on the Board of Directors (\"the Board\"), was 20%, 19%, and 33%, respectively. Specific to the U.S., 39% of our employees identify as people of color.\nWe work to ensure we have access to and support strengthening our talent pipeline across the globe while prioritizing development and retention. We hold leadership accountable for integrating our Baker Hughes culture and behaviors into their respective parts of the business. Our enterprise-wide talent strategy allows us to measure the outcomes and progress of our efforts, assign goals, develop accountability, and ensure transparency. Our corporate memberships with respected nonprofits, such as Ally Energy, Catalyst, Disability:IN, and the Women's Energy Network, provide partnership and guidance to support our goals. Our talent acquisition efforts as well as our eight global employee resource groups support the engagement, development and retention of talent across the organization.\nTalent Acquisition: \nWe have a number of initiatives to support our global goals of attracting, and retaining, the best talent to Baker Hughes. We are also enabling and expecting fair and respectful treatment for all to ensure we are living out our Baker Hughes values and behaviors.\nBaker Hughes Company 2024 Form 10-K | 8\nAt the beginning of 2024, Baker Hughes launched a rebranded Employee Value Proposition that captures the essence of our company – how it is unique and what it aspires to accomplish, balancing our current strength and the goals to be an employer of choice. Learn more at \nhttps://careers.bakerhughes.com/global/en\n.\nEmployee Resource Groups (\"ERGs\"):\n ERGs consist of employees who have joined together based on shared interests, characteristics, or life experiences. These groups can have a powerful influence on driving change by elevating the conversation and awareness around key issues and engaging with the communities where we operate while also providing opportunities for employee development, education, and professional growth. In 2024, we continued our support of the ERGs in several ways, including the opportunity for ERGs to nominate charitable organizations to receive grants from the Baker Hughes Foundation. We are continuing our culture journey by strengthening our six communities of interest groups, which bring together employees based on shared interests and enable employees to share information and ideas, find opportunities to participate in philanthropy and volunteerism, and learn best practices by engaging with colleagues on a specific topic or area of interest. These efforts have helped strengthen our Baker Hughes culture and have fostered closer connections between employees in communities around the world.\nInclusive Culture: \nWe have several programs and initiatives that cultivate an inclusive culture. The Baker Hughes Culture & Inclusion Council, comprised of executives across the organization, supports the success of our inclusivity and workplace culture ambitions and meets regularly to review progress and discuss ways in which we can continue to advance our efforts.\nCompensation and Benefits\nWe are committed to paying for performance and supporting our employees' wellbeing, as well as the wellbeing of their families, by offering flexible and competitive benefits tailored by location to meet the specific needs of our employees. We regularly assess our total compensation and benefits programs through benchmarking with industry peers and local markets. We strive to ensure that our compensation programs are fair and equitable for all employees. Healthcare plans and life insurance are a core benefit of the Company and are provided in most locations. Baker Hughes offers various leaves of absence options for certain quality-of-life needs, including family care. We also continue to assess and provide programs that support our employees' work arrangements such as flexible schedules, compressed work weeks, hybrid work, remote work, and other options.\nLearning and Development\nLearning and Development is a personal journey at Baker Hughes. We empower our employees to follow their passion for personal knowledge, job related skills, development, and the domain expertise needed for professional and personal growth. In alignment with this, we continued to build upon the progress in our social learning communities, by completing our transition to an improved learning delivery platform. This change in the learning ecosystem simplified the user experience for our learners and enabled rich analytics for the team to continuously make the learning experience more engaging, impactful, and easy.\nOur learning communities \nCORE Values\n, \nCORE Strengths\n and \nJOURNEY\n continue to provide opportunities for all employees to learn, share and practice their learning with their peers no matter where they are in their career. \nCORE Values\n is a curated learning space centered around our Baker Hughes Values: Grow, Care, Collaborate, and Lead, and the behaviors associated with each. \nCORE Strengths\n adds focus to the critical skills (for example Data Analytics, Project Management, Change Management) that will help transform our organization, and \nJOURNEY\n is targeted for people leaders to help them transition into their leadership roles. We continue to offer in-person learning opportunities to complement the robust virtual learning catalog with workshops and team development.\nOur formal leadership development programs play a pivotal role in attracting, retaining, and developing talent and increasing the pipeline of talent into and within the organization. As an example, Aspire is a two-year rotational leadership program for recent graduates and early-career employees to grow functional and leadership skills through challenging assignments, learning plans, and global cross-functional projects.\nHealth, Safety, Environment, and Wellness\nHSE is at the core of our culture as we are committed to doing the right thing to protect our employees, customers, the communities where we live and work, and the environment. We take a risk-based approach with \nBaker Hughes Company 2024 Form 10-K | 9\nproactive and preventive programs to deliver safe, secure, and sustainable operations. We have established a stringent set of standards which meet or exceed global HSE regulatory requirements.\nOur commitment to HSE starts at the highest levels of our Company and is embedded throughout all layers of the organization. We encourage and empower all employees to take an active role in \"owning\" HSE by stopping work when conditions and/or behaviors are unsafe and reporting observations, near misses, and stop-work events through open reporting channels. Our ambition is to ensure each day we operate without serious injuries, accidents, or harm to the environment. Employees are required to complete recurring HSE training to bring awareness to potential hazards, regulatory obligations and performing activities safely. We offer over 225 HSE courses including foundational training required for all employees, workplace and job-specific training, and human-performance leadership training for managers.\nOur commitment to HSE goes beyond safety alone. Occupational health and wellness is a key competency jointly managed within our HSE and Human Resources (\"HR\") teams. The importance of physical health, ergonomics, preventative health care, and mental wellness cannot be overstated in promoting a healthy, engaged, and productive workplace. We work with our health benefit providers and internal teams to offer employees health and wellness programs, telemedicine access, health screenings, immunizations, fitness reimbursements, and virtual wellness tools.\nIn 2024, the mental health and emotional well-being of our employees was a critical priority. We provided resources and tools to our employees and will continue to annually host numerous events with Baker Hughes leaders and external experts. Our Employee Assistance Program provided employees and their family members direct access to professional coaches for in-the-moment counseling or referrals to community experts and extended care providers to navigate daily life and cope with major life events.\nCommunity Involvement\nBaker Hughes seeks to make a positive impact in the communities where we conduct business around the world. Consistent with our purpose and values, we work to advance environmental quality, educational opportunities, health, and wellness. We benefit our communities through financial contributions, in-kind donations of goods and services, and volunteer projects. The Baker Hughes Foundation makes strategic philanthropic contributions, matches Baker Hughes employee charitable contributions, and awards volunteer recognition grants for outstanding employee community service.\nGovernance\nThe Board believes the purpose of corporate governance is to maximize shareholder value in a manner consistent with legal requirements and the highest standards of integrity. The Board has adopted and adheres to corporate governance practices, which the Board and management believe promote this purpose, are sound, and represent best practices. The Board periodically reviews these governance practices, Delaware law (the state in which the Company is incorporated), the rules and listing standards of Nasdaq and SEC regulations, as well as best practices suggested by recognized governance authorities.\nThe Board monitors and provides oversight over our ESG policies, programs, and practices regarding corporate responsibility and sustainability and plays an active role in overseeing our human capital management efforts. Our Human Capital and Compensation Committee provides oversight of our social strategy, policies, programs, and initiatives focusing on Diversity, Inclusion and Belonging as well as pay equity, culture, talent development, succession planning, and executive compensation and benefits. Our Governance and Corporate Responsibility Committee provides oversight of the Company's environmental matters, including monitoring its sustainability strategy and initiatives, the management of employee health, safety, and wellness matters, and oversight of our positions on corporate social responsibilities and public issues of significance, including those related to privacy, digital safety and responsible AI, which affect investors and other key stakeholders. The Audit Committee provides oversight over the Company's risk assessment and risk management policies and processes, including data privacy, AI, and compliance reporting. Our Finance Committee provides oversight of our financial and investment policies and of the Company's principal finance, banking, and treasury matters, including the Company's capital structure (both equity and debt) and the principal terms of related financing transactions and requirements.\nBaker Hughes Company 2024 Form 10-K | 10\nGOVERNMENTAL REGULATION\nEnvironmental Matters\nWe are committed to the health and safety of people, protection of the environment and compliance with environmental laws, regulations and our policies. Our past and present operations include activities that are subject to extensive domestic (including U.S. federal, state and local) and international regulations concerning, among other things, air and water quality, waste management, occupational health and safety, and wildlife and land protection. Environmental regulations continue to evolve, and changes in standards of enforcement of existing regulations, as well as the enactment of new legislation or the issuance of judicial or agency opinions or orders, may require us and our customers to modify, supplement or replace equipment or facilities, obtain new or updated permits to conduct regulated activities, initiate investigatory and/or remedial measures, apply specific HSE criteria addressing employee protection and/or to change or discontinue present methods of operation. Our environmental compliance expenditures and our capital costs for environmental control equipment may change accordingly.\nOngoing environmental compliance costs, such as obtaining environmental permits, installation and maintenance of pollution control equipment and waste disposal, are expensed as incurred. Based upon current information, we believe that our overall environmental regulatory compliance obligations, including investigatory and/or remediation obligations, environmental compliance costs and capital expenditures for environmental control equipment, will not have a material adverse effect on our capital expenditures, earnings or competitive position because we have either established adequate reserves or our compliance cost, based on available information, is not expected to be material to our consolidated financial statements.\nWhile we seek to embed and verify sound environmental practices throughout our business, we are, and may in the future be, involved in investigation and/or remediation projects at current and former properties, typically related to historical operations and operations of our predecessor companies. In some cases, our remediation activities are conducted as specified by a government agency-issued consent decree or agreed order. Remediation costs at these properties are accrued using currently available facts, existing environmental permits, technology and presently enacted laws and regulations. For sites where we have primary responsibility for the remediation, our cost estimates are developed based on internal evaluations and are not discounted. We record accruals when it is probable that we will be obligated to pay amounts for environmental site evaluation, investigation and/or remediation or related activities, and such amounts can be reasonably estimated. Accruals are recorded even if significant uncertainties exist over the ultimate cost of the remediation. Our total accrual for environmental remediation was $54 million and $58 million at December 31, 2024 and 2023, respectively.\nOther Regulatory Matters\nWe are subject to regulation by various U.S. federal regulatory agencies and by the applicable regulatory authorities in countries in which our products are manufactured or sold. Such regulations principally relate to the ingredients, classification, labeling, safety, manufacturing, packaging, transportation, advertising, and marketing of our products. Additionally, as a U.S. entity operating through subsidiaries in non-U.S. jurisdictions, we are subject to foreign exchange control, transfer pricing and customs laws that regulate the import and export of goods as well as the flow of funds between us and our subsidiaries. In particular, the shipment of goods, services and technology across international borders subjects us to extensive trade laws and regulations. Our import activities are governed by the unique customs laws and regulations in each of the countries where we operate. Pursuant to their laws and regulations, governments may impose economic sanctions against certain countries, persons and entities that may restrict or prohibit transactions involving such countries, persons and entities, which may limit or prevent our conduct of business in certain jurisdictions. We are also required to comply with transfer pricing, securities laws, and other statutes and regulations, such as the U.S. Foreign Corrupt Practices Act and other countries’ anti-corruption and anti-bribery regimes.\nAs a result of the conflict between Russia and Ukraine that began in February of 2022, governments in the U.S., United Kingdom (\"U.K.\"), European Union (\"EU\"), and other countries enacted sanctions against Russia and certain Russian interests. As previously announced on March 19, 2022, we suspended any new investments in our Russia operations, but continued to comply with applicable laws and regulations as we fulfilled existing contractual obligations. As a result, we completed a number of actions during the course of 2022 and 2023 including the sale of part of our OFSE Russia business and suspended substantially all of our remaining operational activities in Russia. In 2024, our focus in Russia has been to continue to close local entities within the scope of western sanctions and \nBaker Hughes Company 2024 Form 10-K | 11\nlocal regulation. We are continuing to closely monitor the developments in Ukraine and Russia and changes to sanctions all of which continued to make ongoing operations increasingly complex and significantly more challenging. For further information see \"Note 20. Restructuring, Impairment and Other\" and \"Note 21. Business Dispositions and Acquisitions\" of the Notes to Consolidated Financial Statements in Item 8 herein.\nWe are also subject to laws relating to data privacy and security and consumer credit, protection and fraud. An increasing number of governments worldwide have established laws and regulations, and industry groups also have promoted various standards, regarding data privacy and security, including with respect to the protection and processing of personal data. The legal and regulatory environment related to data privacy and security is increasingly rigorous, with new and constantly changing requirements applicable to our business, and enforcement practices are likely to remain uncertain for the foreseeable future. We are also subject to labor and employment laws, including regulations established by the U.S. Department of Labor and other local regulatory agencies, which sets laws governing working conditions, paid leave, workplace safety, wage and hour standards, and hiring and employment practices.\nWhile there are no current environmental or regulatory matters that we expect to have a material adverse impact on the results of our operations, financial position or cash flows or our capital expenditures, earnings or competitive position, there can be no assurances that existing or future environmental laws and other laws, regulations and standards, judicial or administrative opinions or orders applicable to our operations or products will not lead to such a material adverse impact.\nAVAILABILITY OF INFORMATION FOR STOCKHOLDERS\nOur Annual Reports on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K and amendments to those reports filed or furnished pursuant to Section 13(a) or 15(d) of the Securities Exchange Act of 1934, as amended (\"Exchange Act\"), are made available free of charge on our internet website at \nwww.bakerhughes.com\n as soon as reasonably practicable after these reports have been electronically filed with, or furnished to, the SEC, and can be found at their internet website \nwww.sec.gov\n. In addition, our Corporate Sustainability reports are available on the Company section of our website at \nwww.bakerhughes.com\n. Information contained on or connected to our website is not incorporated by reference into this Annual Report on Form 10-K and should not be considered part of this Annual Report or any other filing we make with the SEC.\nWe have a Code of Conduct to provide guidance to our directors, officers, and employees on matters of business conduct and ethics, including compliance standards and procedures. We also require our principal executive officer, principal financial officer, and principal accounting officer to sign a Code of Ethical Conduct Certification annually.\nThe Code of Conduct, referred to as Our Way: The Baker Hughes Code of Conduct, and the Code of Ethical Conduct Certifications are available on the Investor section of our website at \nwww.bakerhughes.com\n. We will disclose on a current report on Form 8-K or on our website information about any amendment or waiver of these codes for our executive officers and directors. Waiver information disclosed on our website will remain on the website for at least 12 months after the initial disclosure of a waiver. Our Governance Principles and the charters of our Audit Committee, Finance Committee, Human Capital and Compensation Committee, and Governance and Corporate Responsibility Committee of the Board are also available on the Investor section of our website at \nwww.bakerhughes.com\n. In addition, a copy of the Code of Conduct, Code of Ethical Conduct Certifications, Governance Principles, and the charters of the committees referenced above are available in print at no cost to any shareholder who requests them.\nBaker Hughes Company 2024 Form 10-K | 12\nEXECUTIVE OFFICERS OF BAKER HUGHES COMPANY\nThe following table shows, as of February 4, 2025, the name of each of our executive officers, together with his or her age and office presently or previously held. There are no family relationships among our executive officers.\nName\nAge\nPosition and Background\nLorenzo Simonelli\n51\nChairman, President and Chief Executive Officer\nChairman, President and Chief Executive Officer Lorenzo Simonelli has been the Chairman of the Board of Directors of the Company since October 2017, and a Director, President and Chief Executive Officer of the Company since July 2017. Prior to joining the Company in July 2017, Mr. Simonelli was Senior Vice President, GE and President and Chief Executive Officer, GE Oil & Gas from October 2013 to July 2017. Before joining GE Oil & Gas, he was the President and Chief Executive Officer of GE Transportation from July 2008 to October 2013. Mr. Simonelli joined GE in 1994 and held various finance and leadership roles from 1994 to 2008. He also currently serves on the Board of Iveco Group N.V. He is a Business & Economics Graduate from Cardiff University in South Wales.\nNancy Buese\n55\nExecutive Vice President and Chief Financial Officer\nNancy Buese is the Executive Vice President and Chief Financial Officer of the Company. Prior to joining the Company in November 2022, she served as Executive Vice President (\"EVP\") and Chief Financial Officer (\"CFO\") of Newmont Corporation, a gold mining company from October 2016 to October 2022. Prior to her role at Newmont, Ms. Buese spent more than a decade as EVP & CFO of MarkWest Energy Partners, a leader in gathering, processing, and transportation of hydrocarbons, as well as EVP & CFO of MPLX (a subsidiary of Marathon Petroleum) following MPLX's acquisition of MarkWest. She began her career in public accounting, starting with Arthur Andersen and rising to be a partner at Ernst & Young until 2003. She also serves on the Board of Chubb Limited since 2023. She holds a bachelor of science degree in accounting and business administration from the University of Kansas and is a Certified Public Accountant.\nJames E. Apostolides\n47\nSenior Vice President, Enterprise Operational Excellence\nJames E. Apostolides is the Senior Vice President of Enterprise Operational Excellence of the Company and is responsible for leading the Company's global supply chain, HSE, and ESG functions. Mr. Apostolides previously served as Senior Vice President of Enterprise Excellence from February 2020 to September 2022. In July 2017, he was appointed VP of Materials Management, Logistics, and Cash Operations. He began his career in 1999 with GE and held roles of increasing responsibility, including managerial positions in Shop Operations, Materials, Sourcing, and Fulfillment across multiple continents. He holds a bachelor's degree in mechanical engineering from Worcester Polytechnic Institute in the U.S.\nMaria Claudia Borras\n56\nChief Growth & Experience Officer\nMaria Claudia Borras is the Chief Growth & Experience Officer of the Company. Ms. Borras previously served as Executive Vice President, Oilfield Services and Equipment from September 2022 to September 2024 and Executive Vice President, of Oilfield Services from July 2017 to September 2022. Prior to joining the Company, she served as the Chief Commercial Officer of GE Oil & Gas from January 2015 to July 2017. Prior to joining GE Oil & Gas, she held various leadership positions at Baker Hughes Incorporated including President, Latin America from October 2013 to December 2014, President, Europe Region from August 2011 to October 2013, Vice President, Global Marketing from May 2009 to July 2011. She has served on the Board of Tyson Foods Inc. since 2021. She holds a bachelor of science degree in petroleum engineering from Universidad de América, Bogotá-Colombia.\nAmerino Gatti\n54\nExecutive Vice President, Oilfield Services and Equipment\nAmerino Gatti is the Executive Vice President, Oilfield Services and Equipment of the Company. Prior to joining the Company in September 2024, Mr. Gatti served as Chief Executive Officer and Chairman of the Board of TEAM, Inc., a provider of integrated specialty industrial services with operations in over 20 countries, from January 2018 to January 2022. Prior to joining TEAM, Inc. he spent 25 years with oilfield services firm Schlumberger and held various leadership positions, including Executive Officer and President of the Production Group for North America, Vice President and General Manager for Qatar and Yemen, Global Vice President for Sand Management Services and Vice President Marketing for North America. His earlier experience includes field operations, engineering and human resources across North America, South Asia and the Middle East. He earned a degree in mechanical engineering from the University of Alberta, Canada.\nBaker Hughes Company 2024 Form 10-K | 13\nName\nAge\nPosition and Background\nGanesh Ramaswamy\n56\nExecutive Vice President, Industrial & Energy Technology\nGanesh Ramaswamy is the Executive Vice President, Industrial & Energy Technology. Prior to joining the Company in January 2023, Mr. Ramaswamy served as President of Global Services for Johnson Controls, a worldwide provider of technologies and solutions for buildings, from December 2019 to December 2022. Prior to joining Johnson Controls, he served at Danaher Corporation, a diversified manufacturer of life sciences, diagnostics, and industrial products and services, from April 2015 to December 2019 in various executive roles including Group Executive for Marking & Coding; President of Videojet Technologies; and Senior Vice President of High Growth Markets at Beckman Coulter Diagnostics. Prior to his career with Danaher, he held executive roles at Hoya Corporation, a global provider of endoscopic imaging products and solutions, including as President of Pentax Medical, from June 2011 to April 2015. He began his career in product development and general management at GE Global Research and GE Healthcare. He also currently serves on the Board of PACCAR, Inc. He holds a doctorate in mechanical engineering from the University of Pennsylvania, a master's degree in business from the University of Wisconsin-Milwaukee, a master's degree in mechanical engineering from Auburn University, and a bachelor's degree in mechanical engineering from the University of Kerala.\nGeorgia Magno\n46\nChief Legal Officer\nGeorgia Magno is the Chief Legal Officer of the Company. Ms. Magno previously served as Vice President and General Counsel for the IET segment. She joined the Company in 2010, first as General Counsel for the global supply chain and holding subsequent legal roles of increasing complexity and responsibility across commercial, operational, and product line organizations in multiple countries including Italy and the U.S. Prior to joining the Company, she was an international litigator with the law firms of Cleary Gottlieb and Weil, Gotshal & Manges LLP. She holds a J.D. from Università di Bologna and an L.L.M. from Harvard Law School and is admitted to practice law in both Italy and the U.S.",
  "item7": "ITEM 7. MANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nManagement's Discussion and Analysis of Financial Condition and Results of Operations (\"MD&A\") should be read in conjunction with the consolidated financial statements included in Item 8. Financial Statements and Supplementary Data contained herein.\nEXECUTIVE SUMMARY\nMarket Conditions\nWe are an energy technology company with a broad and diversified portfolio of technologies and services that span the energy and industrial value chain. We operate through our two business segments: OFSE and IET. We sell products and services primarily in the global oil and gas markets, within the upstream, midstream and downstream segments, as well as broader industrial and new energy markets.\nDuring 2024, Baker Hughes continued to deliver significant improvement across the company and in our financial results over 2023. We capitalized on market tailwinds to deliver substantial IET revenue growth, navigated an uneven market to deliver modest OFSE revenue growth, and realized widening benefits from our transformation efforts across the company. We also maintained strong order momentum in IET, led by significant growth in new energy and non-LNG equipment orders.\nAs we look to 2025, we see a muted outlook for global upstream spending due to recent oil price volatility and an oil market that looks well supplied in the near term, which might affect activity across our OFSE portfolio. Continued discipline from the world's largest producers and the pace of oil demand growth will remain important factors to monitor. Geopolitics remain another element of uncertainty across the oil and gas markets affecting macroeconomic conditions and upstream spending.\nWe are seeing customer spending trends shift more towards natural gas and low-carbon solutions, and we expect this trend to continue in 2025, which will continue to support strength across our IET portfolio. We remain optimistic on the LNG outlook, supporting the shift towards the development of natural gas and LNG. As a result, the global LNG project pipeline remains strong. Additionally, robust orders over the past few years are set to drive significant growth in our equipment installed base, which will underpin steady growth in Gas Technology Service over the coming years. Continued signs of tightness in the aeroderivative supply chain will remain an important factor to monitor.\nFinancial Results and Key Company Initiatives\nIn 2024, the Company generated revenues of $27.8 billion, compared to $25.5 billion in 2023, increasing $2.3 billion or 9%. The increase in revenue was driven principally by IET. IET revenue increased $2.1 billion, primarily driven by Gas Technology Equipment revenue. OFSE revenue increased $0.3 billion driven by international revenue. Operating income was $3.1 billion compared to $2.3 billion in 2023, increasing $0.8 billion. The increase to operating income was driven by higher volume primarily from higher proportionate growth in Gas Technology Equipment (\"GTE\") and Subsea & Surface Pressure Systems (\"SSPS\") and price in both segments, and structural cost-out initiatives across the company, partially offset by cost inflation.\nAs our journey of transformation continues, we have made progress in our efforts to improve efficiencies and modernize how the business operates. The business has undertaken significant structural changes and we see the operating benefits coming through in the margin performance.\nBaker Hughes remains committed to a flexible capital allocation policy that balances returning cash to shareholders and investing in growth opportunities. We increased our quarterly dividend in the first quarter of 2024 by one cent to $0.21 per share. For the full year of 2024, we returned a total of $1.3 billion to shareholders in the form of dividends and share repurchases.\nBaker Hughes Company 2024 Form 10-K | 33\nOutlook\nOur business is exposed to a number of macro factors, which influence our outlook and expectations given the current volatile conditions in the industry. All of our outlook expectations are purely based on the market as we see it today and are subject to changing conditions in the industry.\n•\nOFSE North America activity: In 2025, we expect a second consecutive year of lower E&P spending due to recent commodity price volatility and E&P consolidation.\n•\nOFSE International activity: We expect spending outside of North America to be at similar or slightly lower levels in 2025 compared to 2024.\n•\nIET outlook: We see continued strength in LNG, Floating Production Storage and Offloading (\"FPSO\"), gas infrastructure, and new energy, as well as increasing opportunities to leverage our versatile portfolio to enhance IET's position across industrial and distributed power markets. \nWe have other businesses in our portfolio that are more correlated with various industrial metrics, including global GDP growth. We also have businesses within our portfolio that are exposed to new energy solutions, specifically focused around reducing carbon emissions of the energy and broader industry, including: hydrogen; geothermal; CCUS; energy storage; clean power; and emissions abatement solutions. We expect to see continued growth in these global businesses as new energy solutions become a more prevalent part of the broader energy mix.\nOverall, we believe our portfolio is well positioned to compete across the energy value chain and deliver comprehensive solutions for our customers. Over time, we believe the world's demand for energy will continue to rise, and that hydrocarbons will play a major role in meeting the world's energy needs for the foreseeable future. As such, we remain focused on delivering innovative, low-emission, and cost-effective solutions that deliver step changes in operating and economic performance for our customers.\nBUSINESS ENVIRONMENT\nThe following discussion and analysis summarize the significant factors affecting our results of operations, financial condition and liquidity position as of and for the years ended December 31, 2024, 2023, and 2022, and should be read in conjunction with our consolidated financial statements and related notes.\nOur revenue is predominately generated from the sale of products and services to major, national, and independent oil and natural gas companies worldwide, and is dependent on spending by our customers for oil and natural gas exploration, field development and production. This spending is driven by a number of factors, including our customers' forecasts of future energy demand and supply, their access to resources to develop and produce oil and natural gas, their ability to fund their capital programs, the impact of new government regulations, and their expectations for oil and natural gas prices as a key driver of their cash flows.\nOil and Natural Gas Prices\nOutside North America, customer spending is influenced by Brent oil prices. In North America, customer spending is influenced by WTI oil prices and natural gas prices are measured by the Henry Hub Natural Gas Spot Price.\nBaker Hughes Company 2024 Form 10-K | 34\nOil and natural gas prices are summarized in the table below as averages of the daily closing prices during each of the periods indicated.\n2024\n2023\n2022\nBrent oil prices ($/Bbl) \n(1)\n$\n80.52 \n$\n82.49 \n$\n100.93 \nWTI oil prices ($/Bbl) \n(2)\n76.63 \n77.58 \n94.90 \nNatural gas prices ($/mmBtu) \n(3)\n2.19 \n2.53 \n6.45 \n(1)\nEnergy Information Administration (\"EIA\") Europe Brent Spot Price per Barrel\n(2)\nEIA Cushing, OK West Texas Intermediate (\"WTI\") spot price\n(3)\nEIA Henry Hub Natural Gas Spot Price per million British Thermal Unit\nRig Count\nRig counts are an important business barometer for the drilling industry and its suppliers. When drilling rigs are active they consume products and services produced by the oil service industry. Therefore, rig counts may act as a leading indicator of market activity and reflect the relative strength of energy prices however, these counts should not be solely relied on as other specific and pervasive conditions may exist that affect overall energy prices and market activity.\nRig counts are compiled weekly for the U.S. and Canada and monthly for all international rigs. Published international rig counts do not include rigs drilling in certain locations such as onshore China because this information is not readily available.\nThe rig counts are summarized in the table below as averages for each of the periods indicated.\n2024\n2023\n2022\nNorth America\n787 \n864 \n898 \nInternational\n947 \n948 \n851 \nWorldwide\n1,734 \n1,812 \n1,749 \nRESULTS OF OPERATIONS\nThe discussions below relating to significant line items from our consolidated statements of income (loss) are based on available information and represent our analysis of significant changes or events that impact the comparability of reported amounts. Where appropriate, we have identified specific events and changes that affect comparability or trends and, where reasonably practicable, have quantified the impact of such items. In addition, the discussions below for revenue and cost of revenue are on a total basis as the business drivers for product sales and services are similar. All dollar amounts in tabulations in this section are in millions of dollars, unless otherwise stated. Certain columns and rows may not add due to the use of rounded numbers.\nOur consolidated statements of income (loss) displays sales and costs of sales in accordance with SEC regulations under which \"goods\" is required to include all sales of tangible products and \"services\" must include all other sales, including other service activities. For the amounts shown below, we distinguish between \"equipment\" and \"product services,\" where product services refer to sales under product services agreements, including sales of both goods (such as spare parts and equipment upgrades) and related services (such as monitoring, maintenance and repairs), which is an important part of our operations. We refer to \"product services\" simply as \"services\" within Management's Discussion and Analysis of Financial Condition and Results of Operations.\nOur results of operations are evaluated by the Chief Executive Officer on a consolidated basis as well as at the segment level. The performance of our operating segments is primarily evaluated based on segment operating income (loss), which is defined as income (loss) before income taxes and before the following: net interest expense, net other non-operating income (loss), unallocated corporate expenses, significant restructuring plans, impairment and other charges, inventory impairments, and certain gains and losses not allocated to the operating segments.\nBaker Hughes Company 2024 Form 10-K | 35\nIn evaluating the performance, we primarily use the following:\nVolume:\n Volume is defined as the increase or decrease in products and/or services sold period-over-period excluding the impact of foreign exchange and price. The volume impact on profit is calculated by multiplying the prior period profit rate by the change in revenue volume between the current and prior period. Volume also includes price, which is defined as the change in sales price for a comparable product or service period-over-period and is calculated as the period-over-period change in sales prices of comparable products and services.\nForeign Exchange (\"FX\"):\n \nFX measures the translational foreign exchange impact, or the translation impact of the period-over-period change on sales and costs directly attributable to change in the foreign exchange rate compared to the U.S. dollar. FX impact is calculated by multiplying the functional currency amounts (revenue or profit) with the period-over-period FX rate variance, using the average exchange rate for the respective period.\n(Inflation)/Deflation:\n (Inflation)/deflation is defined as the increase or decrease in direct and indirect costs of the same type for an equal amount of volume. It is calculated as the year-over-year change in cost (i.e. price paid) of direct material, compensation and benefits, and overhead costs.\nProductivity:\n Productivity is measured by the remaining variance in profit, after adjusting for the period-over-period impact of volume and price, foreign exchange, and (inflation)/deflation as defined above. Improved or lower period-over-period cost productivity is the result of cost efficiencies or inefficiencies, such as cost decreasing or increasing more than volume, or cost increasing or decreasing less than volume, or changes in sales mix among segments. This also includes the period-over-period variance of transactional foreign exchange, aside from those foreign currency devaluations that are reported separately for business evaluation purposes.\nOrders and Remaining Performance Obligations\nSummarized orders information for our segments are shown in the following table.\nYear Ended December 31,\n$ Change\n2024\n2023\n2022\nFrom 2023 to 2024\nFrom 2022 to 2023\nOrders:\nOilfield Services & Equipment\n$\n15,240\n \n$\n16,344\n \n$\n14,089\n \n$\n(1,104)\n$\n2,255\n \nGas Technology Equipment\n5,675 \n7,367 \n6,195 \n(1,692)\n1,172 \nGas Technology Services\n3,141 \n3,004 \n2,961 \n137 \n43 \nTotal Gas Technology\n8,816 \n10,372 \n9,156 \n(1,555)\n1,215 \nIndustrial Products\n2,079 \n2,069 \n1,833 \n10 \n237 \nIndustrial Solutions\n1,151 \n1,085 \n1,025 \n66 \n60 \nControls\n (1)\n— \n66 \n241 \n(66)\n(175)\nTotal Industrial Technology\n3,230 \n3,220 \n3,099 \n10 \n121 \nClimate Technology Solutions \n(2)\n954 \n586 \n425 \n367 \n161 \nIndustrial & Energy Technology\n13,000\n \n14,178\n \n12,680\n \n(1,178)\n1,498\n \nTotal\n$\n28,240\n \n$\n30,522\n \n$\n26,770\n \n$\n(2,282)\n$\n3,752\n \n(1)\nThe sale of our controls business was completed in April 2023.\n(2)\nFor the years ended December 31, 2024, 2023 and 2022, total new energy orders incorporates CTS in IET of $1.0 billion, $0.6 billion, and $0.4 billion, respectively.\nThe RPO relate to the aggregate amount of the transaction price allocated to the unsatisfied (or partially unsatisfied) performance obligations. As of December 31, 2024, RPO totaled $33.1 billion, of which OFSE totaled $3.0 billion and IET totaled $30.1 billion.\nBaker Hughes Company 2024 Form 10-K | 36\nFiscal Year 2024 to Fiscal Year 2023\nRevenue increased $2,323 million, or 9%, to $27.8 billion. OFSE increased $268 million and IET increased $2,055 million.\nSelling, general and administrative cost decreased $153 million, or 6%, to $2,458 million, and our Corporate costs, which are primarily reported within this financial measure, decreased $17 million, or 5%, to $363 million. These decreases were driven primarily by a continued focus on cost optimization, partially offset by inflationary pressure.\nRestructuring, impairment, and other charges were \n$301 million\n in \n2024\n, primarily related to streamlining of the OFSE operating model. In \n2023\n, restructuring, impairment, and other charges were \n$323 million reflecting \ncosts to align the business with the Company's market outlook.\nOperating income increased $763 million, or 33%, to $3,081 million, driven primarily by:\n increased volume primarily from higher proportionate growth in GTE and SSPS, favorable price, cost optimization, and, to a lesser extent, FX, partially offset by inflationary pressure.\nWe recorded other non-operating income of $382 million in 2024, which included a\n net gain\n of $367 million from the change in fair value for certain equity investments. In 2023, we recorded $554 million of other non-operating income. Included in this amount was a net gain of $555 million from the change in fair value for certain equity investments.\nNet interest expense incurred in 2024 was $198 million, which includes interest income of $93 million. Net interest expense decreased $18 million compared to 2023, with higher interest income primarily driven by higher average cash on deposit.\nWe recorded income taxes in 2024 and 2023 of $257 million and $685 million, respectively. The difference between the U.S. statutory tax rate of 21% and the effective tax rate is primarily \nimpacted by the $664 million reversal of a valuation allowance in 2024, with the rate in both years also reflecting \nincome generated in jurisdictions with tax rates higher than in the U.S. and losses with no tax benefit due to valuation allowances. \nThe valuation allowance on the associated deferred tax assets has been released as a result of the U.S. moving into a cumulative three-year profit position, which is supported by an increasing pattern of profitability, recent demonstration of tax credit utilization, and the forecasted continuation of profitability in the U.S.\nBaker Hughes Company 2024 Form 10-K | 37\nSegment Revenues and Segment Operating Income\nOilfield Services & Equipment\nYear Ended December 31,\n$ Change\n2024\n2023\nFrom 2023 to 2024\nRevenue\nWell Construction\n$\n4,145 \n$\n4,387 \n$\n(242)\nCompletions, Intervention, and Measurements\n4,154 \n4,170 \n(16)\nProduction Solutions\n3,860 \n3,854 \n6 \nSubsea & Surface Pressure Systems\n3,470 \n2,950 \n520 \nTotal\n15,628\n \n15,361\n \n268\n \nCost of goods and services sold\n12,448 \n12,282 \n166 \nResearch and development\n260 \n278 \n(18)\nSelling, general and administrative\n932 \n1,055 \n(123)\nOperating income\n$\n1,988\n \n$\n1,746\n \n$\n242\n \nOperating margin\n (1)\n12.7 \n%\n11.4 \n%\n1.3pts\n(1)\nOperating margin is defined as operating income divided by revenue.\nOFSE revenue of $15,628 million increased $268 million, or 2%, in 2024 compared to 2023, driven by SSPS. From a geographical perspective, international revenue was $11,673 million, an increase of $428 million from 2023, primarily driven by the Europe/CIS/Sub-Saharan Africa regions, partially offset by the Latin America and Middle East/Asia regions. North America revenue was $3,955 million in 2024, a decrease of $161 million from 2023.\nOFSE segment operating income was $1,988 million in 2024 compared to $1,746 million in 2023. The improved performance in 2024 was a result of higher price, cost-out initiatives, and, to a lesser extent, volume with higher proportionate growth in SSPS, partially offset by inflationary pressure.\nBaker Hughes Company 2024 Form 10-K | 38\nIndustrial & Energy Technology\nYear Ended December 31,\n$ Change\n2024\n2023\nFrom 2023 to 2024\nRevenue\nGas Technology Equipment\n$\n5,693 \n$\n4,232 \n$\n1,461 \nGas Technology Services\n2,797 \n2,600 \n197 \nTotal Gas Technology\n8,490 \n6,832 \n1,658 \nIndustrial Products\n2,040 \n1,962 \n78 \nIndustrial Solutions\n1,065 \n983 \n81 \nControls\n (1)\n— \n41 \n(41)\nTotal Industrial Technology\n3,105 \n2,987 \n118 \nClimate Technology Solutions\n605 \n326 \n279 \nTotal\n12,201\n \n10,145\n \n2,055\n \nCost of goods and services sold\n8,738 \n7,220 \n1,518 \nResearch and development\n383 \n373 \n10 \nSelling, general and administrative\n1,250 \n1,242 \n8 \nOperating income\n$\n1,830\n \n$\n1,310\n \n$\n520\n \nOperating margin \n(2)\n15.0 \n%\n12.9 \n%\n2.1pts\n(1)\nThe sale of our controls business was completed in April 2023.\n(2)\nOperating margin is defined as operating income divided by revenue.\nIET revenue of $12,201 million increased $2,055 million, or 20%, in 2024 compared to 2023. The increase was primarily in GTE, and, to a lesser extent, in Gas Technology Services, CTS and Industrial Technology.\nIET segment operating income was $1,830 million in 2024 compared to $1,310 million in 2023. The improved performance in 2024 was driven by higher volume primarily from higher proportionate growth in GTE, price, and cost-out initiatives, partially offset by inflationary pressure.\nFiscal Year 2023 to Fiscal Year 2022\nRevenue increased $4,350 million, or 21%, to $25.5 billion. OFSE increased $2,131 million and IET increased $2,219 million.\nSelling, general and administrative cost increased $101 million, or 4%, to $2,611 million, and our Corporate costs, which are primarily reported within this financial measure, decreased $36 million, or 9%, to $380 million. These decreases were driven primarily by cost optimization initiatives, partially offset by inflationary pressure.\nIn \n2023\n, restructuring, impairment, and other charges were \n$323 million\n \nreflecting \ncosts to align the business with the Company's market outlook. In 2022, restructuring, impairment, and other charges were \n$705 million\n primarily associated with the discontinuation of our Russia operations, and costs to facilitate the reorganization into two segments.\nOperating income increased $1,133 million, or 96%, to $2,317 million, driven primarily by: \nincreased volume primarily from higher proportionate growth in GTE and SSPS, favorable price, and continued benefit of cost optimization initiatives, partially offset by inflationary pressure.\nWe recorded other non-operating income of $554 million in 2023, which included a\n net gain\n of $555 million from the change in fair value for certain equity investments. In 2022, we recorded $911 million of other non-operating losses primarily due to the loss of $451 million from the sale of part of the OFSE business in Russia and a loss of \nBaker Hughes Company 2024 Form 10-K | 39\n$265 million from the change in fair value for certain equity investments. Additionally, in December 2022, the Company, Baker Hughes Holdings, LLC (\"BHH LLC\") and GE entered into an agreement which resulted in the termination of the Tax Matters Agreement, and as a result, we incurred a charge of $81 million.\nNet interest expense incurred in 2023 was $216 million, which includes interest income of $84 million. Net interest expense decreased $36 million compared to 2022, primarily driven by higher interest income.\nWe recorded income taxes in 2023 and 2022 of $685 million and $600 million, respectively. The difference between the statutory tax rate and the effective tax rate in both years was impacted by income in jurisdictions with tax rates higher than in the U.S. and losses with no tax benefit due to valuation allowances. In addition, the above noted impact to the effective tax rate in 2023 was partially offset by income subject to U.S. tax at an effective rate less than 21% due to valuation allowances while the effective rate in 2022 was further impacted by restructuring charges for which a majority had no tax benefit.\nSegment Revenues and Segment Operating Income\nOilfield Services & Equipment\nYear Ended December 31,\n$ Change\n2023\n2022\nFrom 2022 to 2023\nRevenue\nWell Construction\n$\n4,387 \n$\n3,854 \n$\n533 \nCompletions, Intervention, and Measurements\n4,170 \n3,559 \n611 \nProduction Solutions\n3,854 \n3,587 \n267 \nSubsea & Surface Pressure Systems\n2,950 \n2,230 \n720 \nTotal\n15,361\n \n13,229\n \n2,131\n \nCost of goods and services sold\n12,282 \n10,789 \n1,492 \nResearch and development\n278 \n228 \n50 \nSelling, general and administrative\n1,055 \n1,011 \n45 \nOperating income\n$\n1,746\n \n$\n1,201\n \n$\n546\n \nOperating margin\n (1)\n11.4 \n%\n9.1 \n%\n2.3pts\n(1)\nOperating margin is defined as operating income divided by revenue.\nOFSE revenue of $15,361 million increased $2,131 million, or 16%, in 2023 compared to 2022, as a result of increased activity as evidenced by an increase in the global rig count. From a geographical perspective, international revenue was $11,245 million, an increase of $1,779 million from 2022, primarily driven by the Middle East/Asia and Latin America regions, partially offset by lower volume due to the discontinuation of our Russia operations that occurred in 2022. North America revenue was $4,116 million in 2023, an increase of $352 million from 2022.\nOFSE segment operating income was $1,746 million in 2023 compared to $1,201 million in 2022. The improved performance in 2023 was primarily driven by higher volume, price and cost-out initiatives, partially offset by inflationary pressure and lower cost productivity.\nBaker Hughes Company 2024 Form 10-K | 40\nIndustrial & Energy Technology\nYear Ended December 31,\n$ Change\n2023\n2022\nFrom 2022 to 2023\nRevenue\nGas Technology Equipment\n$\n4,232 \n$\n2,599 \n$\n1,633 \nGas Technology Services\n2,600 \n2,440 \n160 \nTotal Gas Technology\n6,832 \n5,039 \n1,793 \nIndustrial Products\n1,962 \n1,697 \n265 \nIndustrial Solutions\n983 \n884 \n99 \nControls\n (1)\n41 \n208 \n(167)\nTotal Industrial Technology\n2,987 \n2,789 \n198 \nClimate Technology Solutions\n326 \n98 \n228 \nTotal\n10,145\n \n7,926\n \n2,219\n \nCost of goods and services sold\n7,220 \n5,342 \n1,878 \nResearch and development\n373 \n307 \n66 \nSelling, general and administrative\n1,242 \n1,142 \n100 \nOperating income\n$\n1,310\n \n$\n1,135\n \n$\n175\n \nOperating margin \n(2)\n12.9 \n%\n14.3 \n%\n-1.4pts\n(1)\nThe sale of our controls business was completed in April 2023.\n(2)\nOperating margin is defined as operating income divided by revenue.\nIET revenue of $10,145 million increased $2,219 million, or 28%, in 2023 compared to \n2022\n. The increase was primarily due to higher volume in Gas Technology Equipment and, to a lesser extent, in CTS, Industrial Technology and Gas Technology Services.\nIET segment operating income was $1,310 million in 2023 compared to $1,135 million in \n2022\n. The improved performance in 2023 was driven by \nhigher volume primarily from higher proportionate growth in GTE, price and cost-out initiatives, \npartially offset by un\nfavorable cost productivity, inflationary pressure, and higher research and development costs related to new energy investments\n.\nCOMPLIANCE\nIn the conduct of all of our activities, we are committed to maintaining the core values of our Company, as well as high safety, ethical, and quality standards as also reported in our Quality Management System. We believe such a commitment is integral to running a sound, successful, and sustainable business. We devote significant resources to maintain a comprehensive global ethics and compliance program (\"Compliance Program\") which is designed to prevent, detect, and appropriately respond to any potential violations of the law, the Code of Conduct, and other Company policies and procedures.\nHighlights of our Compliance Program include the following:\n•\nComprehensive internal policies over such areas as anti-bribery; travel, entertainment, gifts and charitable donations to government officials and other parties; payments to commercial sales representatives; and, the use of non-U.S. police or military organizations for security purposes. In addition, there are policies and procedures to address customs requirements, visa processing risks, export and re-export controls, economic sanctions, anti-money laundering and anti-boycott laws.\n•\nGlobal and independent structure of Chief Compliance Officer and other compliance professionals providing compliance advice, customized training and governance, as well as investigating allegations across all regions and countries where we do business.\nBaker Hughes Company 2024 Form 10-K | 41\n•\nComprehensive employee compliance training program that combines instructor-led and web-based training modules tailored to the key risks that employees face on an ongoing basis.\n•\nDue diligence and monitoring procedures for third parties who conduct business on our behalf, including channel partners (sales representatives, distributors, resellers), and administrative service providers.\n•\nDue diligence procedures for acquisition activities.\n•\nSpecifically tailored compliance risk assessments and audits focused on country and third party risk.\n•\nCompliance Review Board comprised of senior officers of the Company that meets quarterly to monitor effectiveness of the Compliance Program, as well as segment compliance review boards that meet quarterly.\n•\nTechnology to monitor and report on compliance matters, including an internal investigations management system, a conflict of interest reporting and management system, a web-based anti-boycott reporting tool, global trade management systems and comprehensive watch list screening.\n•\nData privacy compliance policies and procedures to ensure compliance with applicable data privacy requirements.\n•\nA compliance program designed to create an \"Open Reporting Environment\" where employees are encouraged to report any ethics or compliance matter without fear of retaliation, including a global network of trained employee ombudspersons, and a worldwide, 24-hour business helpline operated by a third party and available in approximately 200 languages.\n•\nCentralized finance organization with company-wide policies.\n•\nAnti-corruption audits of high-risk countries, as well as risk-based compliance audits of third parties.\n•\nWe have region-specific processes and procedures for management of HR related issues, including pre-hire screening of employees; a process to screen existing employees prior to promotion into select roles where they may be exposed to finance and/or corruption-related risks; and implementation of a global new hire training module which includes compliance training for all employees.\nLIQUIDITY AND CAPITAL RESOURCES\nOur objective in financing our business is to maintain sufficient liquidity, adequate financial resources, and financial flexibility in order to fund the requirements of our business. We continue to maintain solid financial strength and sufficient liquidity. At December 31, 2024, we had cash and cash equivalents of $3.4 billion compared to $2.6 billion at December 31, 2023.\nIn the U.S. we held cash and cash equivalents of approximately $0.6 billion as of December 31, 2024 and 2023, and outside the U.S. of approximately $2.8 billion and $2.0 billion as of December 31, 2024 and 2023, respectively. A substantial portion of the cash held outside the U.S. at December 31, 2024 has been reinvested in active non-U.S. business operations. If we decide at a later date to repatriate certain cash to the U.S., we may incur other additional taxes that would not be significant to the total tax provision.\nWe have a $3 billion committed unsecured revolving credit facility (\"the Credit Agreement\") with commercial banks maturing in November 2028. The Credit Agreement contains certain representations and warranties, certain affirmative covenants and negative covenants, in each case we consider customary. No related events of default have occurred. The Credit Agreement is fully and unconditionally guaranteed on a senior unsecured basis by Baker Hughes. At December 31, 2024 and 2023, there were no borrowings under the Credit Agreement.\nCertain Senior Notes contain covenants that restrict our ability to take certain actions. See \"Note 9. Debt\" of the Notes to Consolidated Financial Statements in this Annual Report for further details. At December 31, 2024, we were in compliance with all debt covenants. Our next debt maturity is December 2026.\nWe continuously review our liquidity and capital resources. If market conditions were to change, for instance due to the uncertainty created by geopolitical events, a global pandemic, or a significant decline in oil and gas \nBaker Hughes Company 2024 Form 10-K | 42\nprices, and our revenue was reduced significantly or operating costs were to increase significantly, our cash flows and liquidity could be negatively impacted. Additionally, it could cause the rating agencies to lower our credit ratings. There are no ratings triggers that would accelerate the maturity of any borrowings under our committed credit facility; however, a downgrade in our credit ratings could increase the cost of borrowings under the credit facility. Should this occur, we could seek alternative sources of funding, including borrowing under the credit facility.\nDuring the year ended December 31, 2024, we dispersed cash to fund a variety of activities including certain working capital needs, capital expenditures, the payment of dividends, repayment of long-term debt, and repurchases of our common stock.\nCash Flows\nCash flows provided by (used in) each type of activity were as follows for the years ended December 31:\n(In millions)\n2024\n2023\n2022\nOperating activities\n$\n3,332 \n$\n3,062 \n$\n1,888 \nInvesting activities\n(1,016)\n(817)\n(1,564)\nFinancing activities\n(1,527)\n(2,028)\n(1,592)\nOperating Activities\nCash flows provided by operating activities were $3,332 million, $3,062 million, and $1,888 million for the years ended December 31, 2024, 2023, and 2022, respectively.\nOur largest source of operating cash is payments from customers, of which the largest component is collecting cash related to our sales of products and services, including advance payments or progress collections for work to be performed. The primary use of operating cash is to pay our suppliers, employees, tax authorities, and others for a wide range of goods and services.\nCash from operating activities is primarily generated from net income or loss adjusted for certain noncash items (including depreciation, amortization, gain or loss on equity securities, stock-based compensation cost, deferred tax benefit or provision, and the impairment of certain assets).\nIn 2024, net working capital cash generation was $7 million, mainly due to progress collections mostly offset by an increase in receivables, inventory, and contract assets as the business continues to expand. Included in the cash flows from operating activities in 2024 are payments of $217 million made primarily for employee severance as a result of our restructuring activities.\nIn 2023, net working capital cash generation was $42 million, mainly due to strong progress collections on equipment contracts, mostly offset by an increase in receivables and inventory due to expansion of the business.\nIn 2022, net working capital cash generation was $122 million primarily due to strong progress collections on equipment contracts and an increase in accounts payable, partially offset by the increase in receivables and inventory due to growth of the business.\nInvesting Activities\nCash flows used in investing activities were $1,016 million, $817 million, and $1,564 million for the years ended December 31, 2024, 2023, and 2022, respectively.\nOur principal recurring investing activity is the funding of capital expenditures including property, plant and equipment (\"PP&E\") and software, to support and generate revenue from operations. Expenditures for capital assets were $1,278 million, $1,224 million, and $989 million for 2024, 2023, and 2022, respectively, partially offset by cash flows from the disposal of PP&E of $203 million, $208 million, and $217 million in 2024, 2023, and 2022, respectively. Proceeds from the disposal of assets are primarily related to equipment that was lost-in-hole, predominantly in OFSE, and PP&E no longer used in operations that was sold throughout the period.\nBaker Hughes Company 2024 Form 10-K | 43\nWe had proceeds from the sale of certain equity securities of $92 million, $372 million, and $26 million in 2024, 2023, and 2022, respectively.\nIn 2023, we completed the acquisition of businesses for total cash consideration of $301 million, net of cash acquired, which consisted primarily of the acquisition of Altus Intervention in the OFSE segment. We also completed the sale of businesses and received total cash consideration of $293 million, which consisted primarily of the sale of our Nexus Controls business in the IET segment. In 2022, we completed the acquisition of businesses for total cash consideration of $767 million, net of cash acquired, including BRUSH Power Generation, Quest Integrity, AccessESP, and Mosaic Materials.\nThe Central Bank of Argentina maintains currency controls that limit our ability to access U.S. dollars and remit cash from our Argentine operations. There is an indirect foreign exchange mechanism known as a Blue Chip Swap that enables companies to transfer U.S. dollars out of and into Argentina, effectively at a parallel U.S. dollar exchange rate. In 2024 and 2023, we entered into transactions in order to remit cash from our Argentine operations resulting in a net loss and a net cash outflow of $7 million and $66 million, respectively, which is included in other investing activities.\nFinancing Activities\nCash flows used in financing activities were $1,527 million, $2,028 million, and $1,592 million for the years ended December 31, 2024, 2023, and 2022, respectively.\nIn 2024, we repaid long-term debt of $143 million\n \nprimarily related to debentures that matured in the second quarter of 2024. In 2023, we repaid long-term debt of $651 million primarily related to certain senior notes that matured in December of 2023. Additionally, we increased our quarterly dividend by one cent to $0.21 per share during the first quarter of 2024. We paid dividends of $836 million, $786 million, and $726 million to our Class A stockholders in 2024, 2023, and 2022, respectively.\nWe repurchased and canceled 15.2 million, 16.3 million, and 29.7 million shares of Class A common stock for a total of $484 million, $538 million, and $828 million, for the years ended December 31, 2024, 2023, and 2022, respectively.\nCash Requirements\nWe believe cash on hand, cash flows from operating activities, the available revolving credit facility, access to our uncommitted lines of credit, and availability under our existing shelf registrations of debt will provide us with sufficient capital resources and liquidity in the short-term and long-term to manage our working capital needs, meet contractual obligations, fund capital expenditures and dividends, repay debt, repurchase our common stock, and support the development of our short-term and long-term operating strategies.\nOur capital expenditures can be adjusted and managed by us to match market demand and activity levels. Based on current market conditions, capital expenditures in 2025 will be made at a rate that we estimate would equal up to 5% of annual revenue. The expenditures are expected to be used primarily for normal, recurring items necessary to support our business.\nBased on our current outlook, we anticipate making income tax payments in the range of $1.0 billion to $1.1 billion in 2025.\nContractual Obligations and Commitments\nOur material cash commitments from known contractual and other obligations consist primarily of obligations for long-term debt and related interest, leases for property and equipment, and purchase obligations as part of normal operations. Certain amounts included in our contractual obligations as of December 31, 2024 are based on our estimates and assumptions about these obligations, including their duration, anticipated actions by third parties and other factors.\nBaker Hughes Company 2024 Form 10-K | 44\nSee \"Note 9. Debt\" of the Notes to Consolidated Financial Statements in Item 8 herein for information regarding scheduled maturities of our long-term debt. See \"Note 8. Leases\" of the Notes to Consolidated Financial Statements in Item 8 herein for information regarding scheduled maturities of our operating leases.\nAs of December 31, 2024, we had expected cash payments for estimated interest on our long-term debt and finance lease obligations of $249 million payable within the next twelve months and $2,468 million payable thereafter.\nAs of December 31, 2024, we had purchase obligations of $1,855 million payable within the next twelve months and $679 million payable thereafter. Our purchase obligations include expenditures for capital assets for 2025 as well as agreements to purchase goods or services or licenses that are enforceable and legally binding and that specify all significant terms, including: fixed or minimum quantities to be purchased; fixed, minimum or variable price provisions; and the approximate timing of the transaction.\nDue to the uncertainty with respect to the timing of potential future cash outflows associated with our uncertain tax positions, we are unable to make reasonable estimates of the period of cash settlement, if any, to the respective taxing authorities. Therefore, $602 million in uncertain tax positions, including interest and penalties, have been excluded from the contractual obligations discussed above. See \"Note 11. Income Taxes\" of the Notes to Consolidated Financial Statements in Item 8 herein for further information.\nOther Factors Affecting Liquidity\nRegistration Statement\n: In December 2023, Baker Hughes, together with BHH LLC and Baker Hughes Co-Obligor, Inc. filed a universal automatic shelf registration statement on Form S-3ASR with the SEC to have the ability to sell various types of securities including debt securities, Class A common stock, preferred stock, guarantees of debt securities, purchase contracts and units. The specific terms of any securities to be sold will be described in supplemental filings with the SEC. There were no sales of such securities during the year ended December 31, 2024. The registration statement will expire in December 2026.\nCustomer receivables\n:\n \nIn line with industry practice, we may bill our customers for services provided in arrears dependent upon contractual terms. In a challenging economic environment, we may experience delays in the payment of our invoices due to customers' lower cash flow from operations or their more limited access to credit markets. While historically there have not been material non-payment events, we attempt to mitigate this risk through working with our customers to restructure their debts. With regard to our primary customer in Mexico, there have not historically been any material losses due to uncollectible accounts receivable, nor are any such balances currently in dispute. During 2024, the Company issued credit default swaps (\"CDS\") in the total of $553 million to third-party financial institutions. The CDS relate to borrowings provided by these financial institutions to our primary customer in Mexico who utilized these borrowings to pay certain of the Company's outstanding receivables. The total notional amount remaining on the issued CDS was $412 million as of December 31, 2024, which will reduce each month through September 2026 as the customer repays the borrowings. The fair value of these derivative liabilities is not material.\nA customer's failure or delay in payment could have a material adverse effect on our short-term liquidity and results of operations. As of December 31, 2024, 16% of our gross customer receivables were from customers in the U.S. and 10% were from customers in Mexico. As of December 31, 2023, 19% of our gross customer receivables were from customers in the U.S. and 11% were from customers in Mexico. No other country accounted for more than 10% of our gross customer receivables at this date.\nInternational operations\n:\n \nOur cash that is held outside the U.S. is 82% of the total cash balance as of December 31, 2024. Depending on the jurisdiction or country where this cash is held, we may not be able to use this cash quickly and efficiently due to exchange or cash controls that could make it challenging. As a result, our cash balance may not represent our ability to quickly and efficiently use this cash.\nBaker Hughes Company 2024 Form 10-K | 45\nGuarantor Financial Information\nWe guarantee various senior unsecured notes and senior unsecured debentures (collectively, the \"Debt Securities\") outstanding with an aggregate principal amount of $5,797 million as of December 31, 2024, with maturities ranging from 2026 to 2047. The Debt Securities constitute debt obligations of BHH LLC, an indirect, 100% owned subsidiary and the primary operating company of Baker Hughes, and Baker Hughes Co-Obligor, Inc, a 100% owned finance subsidiary of BHH LLC (together with BHH LLC, the \"Issuers\") that was incorporated for the sole purpose of serving as a corporate co-obligor of debt securities. The Debt Securities are fully and unconditionally guaranteed on a senior unsecured basis by the Company and rank equally in right of payment with all of the Company's other senior and unsecured debt obligations. However, because these obligations are not secured, they would be effectively subordinated to any existing or future secured indebtedness of Baker Hughes and the Issuers.\nAs required under SEC Rule 13-01, we have included summarized financial information for the Issuers because the combined assets, liabilities, and results of operations of the Issuers are materially different than the corresponding amounts in our consolidated financial statements due to the release of a valuation allowance for certain deferred tax assets.\nYear Ended\nDecember 31,\nSummarized Income Statement data \n(In millions)\n2024\nRevenues\n$\n27,829 \nCosts and expenses\n24,747 \nNet income\n2,645 \nNet income attributable to Baker Hughes Company\n2,615 \nDecember 31,\nSummarized Balance Sheet data \n(In millions)\n2024\n2023\nCurrent assets\n$\n17,268 \n$\n16,305 \nNoncurrent assets\n20,912 \n20,716 \nCurrent liabilities\n12,888 \n12,910 \nNoncurrent liabilities\n8,317 \n8,445 \nCRITICAL ACCOUNTING ESTIMATES\nAn accounting policy is deemed to be critical if the nature of the estimate or assumption it incorporates is subject to a material level of judgment related to matters that are highly uncertain and changes in those estimates and assumptions are reasonably likely to materially impact our consolidated financial statements. These estimates reflect our best judgment about current, and for some estimates, future, economic and market conditions and their potential effects based on information available as of the date of these financial statements. If these conditions change from those expected, it is reasonably possible that the judgments and estimates described below could change, which may result in future impairments of goodwill, or the establishment of valuation allowances on deferred tax assets and increased tax liabilities, among other effects. Also, see \"Note 1. Summary of Significant Accounting Policies\" of the Notes to Consolidated Financial Statements in Item 8 herein, which discusses our most significant accounting policies.\nThe Audit Committee of the Board has reviewed our critical accounting estimates and the disclosure presented below. During the past three fiscal years, we have not made any material changes in the methodology used to establish the critical accounting estimates, and we believe that the following are the critical accounting estimates used in the preparation of our consolidated financial statements for the year ended December 31, 2024. There are other items within our consolidated financial statements that require estimation and judgment, but they are not deemed critical as defined above.\nBaker Hughes Company 2024 Form 10-K | 46\nRevenue Recognition on Long-Term Product Services Agreements\nWe have long-term service agreements with our customers, primarily within our IET segment. These agreements typically require us to maintain assets sold to the customer over a defined contract term. These agreements have an average contract term of greater than 10 years. From time to time, these contract terms may be extended through contract modifications or amendments, which may result in revisions to future billing and cost estimates. Revenue recognition on long-term product services agreements requires estimates of both customer payments and the costs to perform required maintenance services over the contract term. We recognize revenue on an over time basis using input methods to measure our progress toward completion at the estimated margin rate of the contract.\nTo develop our billing estimates, we consider the number of billable events that will occur based on estimated utilization of the asset under contract, over the life of the contract term. This estimated utilization will consider both historical and market conditions, asset retirements and new product introductions, if applicable.\nTo develop our cost estimates, we consider the timing and extent of maintenance and overhaul events, including the amount and cost of labor, spare parts and other resources required to perform the services. In developing our cost estimates, we utilize a combination of our historical cost experience and expected cost improvements. Cost improvements are only included in future cost estimates after savings have been observed in actual results or proven effective through an extensive regulatory or engineering approval process.\nWe routinely review the estimates used in our product services agreements and regularly revise them to adjust for changes. These revisions are based on objectively verifiable information that is available at the time of the review. We gain insight into expected future utilization and cost trends, as well as credit risk, through our knowledge of the equipment installed and the close interaction with our customers through supplying critical services and parts over extended periods.\nRevisions to cost or billing estimates may affect a product services agreement's total estimated profitability resulting in an adjustment of earnings; such adjustments generated earnings of $(11) million, $15 million and $20 million for the three years ended December 31, 2024, 2023 and 2022, respectively. We provide for potential losses on any of these agreements when it is probable that we will incur the loss. Cash billings collected on these contracts were approximately $0.6 billion during the years ended December 31, 2024 and 2023. Our contracts (on average) are approximately 11% complete based on costs incurred to date and our estimate of future costs.\nRevenue Recognition on Sale of Customized Equipment\nWe recognize revenue on agreements for sales of equipment manufactured to unique customer specifications including long-term construction projects, on an over time basis utilizing cost inputs as the measurement criteria in assessing the progress toward completion. Our estimation of the total costs required to fulfill our promise to a customer is generally based on our history of manufacturing similar assets for customers. This estimation of cost is critical to our revenue recognition process and is updated routinely to reflect changes in quantity or cost of the inputs. In certain projects, the underlying technology or promise to the customer is unique to what we have historically promised, and reliably estimating the total cost to fulfill the promise to the customer requires a significant level of judgment. We provide for potential losses on any of these agreements when it is probable that we will incur the loss. The total revenue recognized for the sale of equipment on an over time basis during the twelve months ended December 31, 2024, 2023 and 2022 was $8.5 billion, $6.1 billion, and $4.2 billion, respectively.\nGoodwill and Other Long-Lived Assets\nWe perform an annual impairment test of goodwill for each of our reporting units as of July 1, or more frequently when circumstances indicate an impairment may exist at the reporting unit level. When performing the annual impairment test, we have the option of first performing a qualitative assessment to determine the existence of events and circumstances that would lead to a determination that it is more likely than not that the fair value of a reporting unit is greater than its carrying amount. If, after assessing the existence of events and circumstances, we determine it is more likely than not that the fair value of a reporting unit is greater than its carrying amount, there is no need to perform any further testing. However, if we conclude otherwise, we would be required to perform a quantitative impairment assessment of goodwill, which involves the use of significant estimates and assumptions \nBaker Hughes Company 2024 Form 10-K | 47\nand typically requires analysis of discounted cash flows and other market information, such as trading multiples, and comparable transactions.\nOther long-lived assets, including property, plant and equipment and identifiable finite-lived intangible assets, are reviewed for impairment whenever events or changes in circumstances indicate that the carrying amount may not be recoverable, and at least annually for indefinite-lived intangible assets. When testing for impairment, we group our long-lived assets with other assets and liabilities at the lowest level for which identifiable cash flows are largely independent of the cash flows of other assets and liabilities. The determination of recoverability is made based upon the estimated undiscounted future net cash flows, which involves significant estimates and judgments on the part of management.\nThe determination of whether goodwill and other long-lived assets are impaired involves a significant level of judgment and estimation, and changes in our forecasts, business strategy, government regulations, or economic or market conditions, among other things, could significantly impact these judgments, potentially decreasing the fair value of one or more reporting units or long-lived assets. Any resulting impairment charges could have a material impact on our results of operations.\nIncome Taxes\nOur effective tax rate is based on our income, statutory tax rates, and differences between tax laws and U.S. GAAP in various jurisdictions. Tax laws are complex and subject to different interpretations by the taxpayer and respective governmental taxing authorities. Our rate may be further impacted by the repatriation of foreign earnings that are considered indefinitely reinvested to the extent the repatriation would result in additional taxes such as withholding and income taxes. Indefinite reinvestment is determined by management’s judgment and intentions concerning the future operations of the Company. In cases where repatriation would otherwise incur significant withholding or income taxes, these foreign earnings have been indefinitely reinvested in active non-U.S. business operations. Computation of the potential deferred tax liability associated with these undistributed earnings and any other basis differences is not practicable.\nDeferred income tax assets represent amounts available to reduce income taxes payable in future years. We routinely assess the recoverability of such assets, weighing available positive and negative evidence and recording a valuation allowance when it is more likely than not that some portion or all of the assets will not be realized. In undertaking such assessment, we first look to objective and verifiable evidence, the nature and severity of cumulative pretax losses, if any, based on a rolling three-year period, recent earnings history and associated trends or changes, and the nature of temporary differences, including predictability of reversal patterns and duration of carryforward. We then also evaluate other evidence such as projected financial results, sensitivity of such results to external factors or changes in assumptions, and prudent and readily available tax planning strategies that may alter the timing of reversal of the temporary differences. While we consider all available positive and negative evidence, certain objectively verifiable categories of evidence carry more weight in the analysis. For example, concluding that a valuation allowance is not required is difficult when there is significant negative evidence that is objective and verifiable, such as cumulative losses in recent years. While this would not be the sole determinate of the need for a valuation allowance, it does carry greater weight within the broader assessment when alongside other, more subjective evidence, including projections for future growth.\nOur tax filings routinely are subject to audit by the tax authorities in the jurisdictions where we conduct business. These audits may result in assessments of additional taxes that are resolved with the tax authorities or through the courts. We have provided for the amounts we believe will ultimately result from these proceedings, but settlements of issues raised in these audits may affect our tax rate. We have $455 million of gross unrecognized tax benefits, excluding interest and penalties, at December 31, 2024. We are not able to reasonably estimate in which future periods these amounts ultimately will be settled.\nAllowance for Credit Losses\nThe estimation of anticipated credit losses that may be incurred as we work through the invoice collection process with our customers requires us to make judgments and estimates regarding our customers' ability to pay amounts due to us. We monitor our customers' payment history and current creditworthiness to determine that collectability is reasonably assured. We also consider the overall business climate in which our customers operate. \nBaker Hughes Company 2024 Form 10-K | 48\nFor accounts receivable, a loss allowance matrix is utilized to measure lifetime expected credit losses. The matrix contemplates historical credit losses by age of receivables, adjusted for any forward-looking information and management expectations. At December 31, 2024 and 2023, the allowance for credit losses totaled $232 million and $350 million of total gross accounts receivable, respectively. We believe that our allowance for credit losses is adequate to cover the anticipated credit losses under current conditions; however, uncertainties regarding changes in the financial condition of our customers, either adverse or positive, could impact the amount and timing of any additional credit losses that may be required.\nNEW ACCOUNTING STANDARDS TO BE ADOPTED\nSee \"Note 1. Summary of Significant Accounting Policies\" of the Notes to Consolidated Financial Statements in Item 8 herein for further discussion of accounting standards to be adopted.\nRELATED PARTY TRANSACTIONS\nSee \"Note 18. Related Party Transactions\" of the Notes to Consolidated Financial Statements in Item 8 herein for further discussion of related party transactions.\nFORWARD-LOOKING STATEMENTS\nThis Form 10-K, including MD&A and certain statements in the Notes to Consolidated Financial Statements, contains forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Exchange Act of 1934, as amended, (each a \"forward-looking statement\"). All statements, other than historical facts, including statements regarding the presentation of the Company's operations in future reports and any assumptions underlying any of the foregoing, are forward-looking statements. Forward-looking statements concern future circumstances and results and other statements that are not historical facts and are sometimes identified by the words \"may,\" \"will,\" \"should,\" \"potential,\" \"intend,\" \"expect,\" \"would,\" \"seek,\" \"anticipate,\" \"estimate,\" \"overestimate,\" \"underestimate,\" \"believe,\" \"could,\" \"project,\" \"predict,\" \"continue,\" \"target,\" \"goal\" or other similar words or expressions. Forward-looking statements are based upon current plans, estimates and expectations that are subject to risks, uncertainties and assumptions. Should one or more of these risks or uncertainties materialize, or should underlying assumptions prove incorrect, actual results may vary materially from those indicated or anticipated by such forward-looking statements. The inclusion of such statements should not be regarded as a representation that such plans, estimates or expectations will be achieved. Important factors that could cause actual results to differ materially from such plans, estimates or expectations include, among others, the risk factors identified in the \"Risk Factors\" section of Part 1 of Item 1A of this Form 10-K and those set forth from time-to-time in other filings by the Company with the SEC. These documents are available through our website or through the SEC's Electronic Data Gathering and Analysis Retrieval (EDGAR) system at http://www.sec.gov.\nAny forward-looking statements speak only as of this Annual Report. The Company does not undertake any obligation to update any forward-looking statements, whether as a result of new information or developments, future events or otherwise, except as required by law. Readers are cautioned not to place undue reliance on any of these forward-looking statements.",
  "item2": null
}