{
  "source_file": "bldr-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2.\n Management’s Discussion and Analysis of \nFinancial Condition and Results of Operations\n \nThe following discussion of our financial condition and results of operations should be read in conjunction with the Management’s Discussion and Analysis of Financial Condition and Results of Operations and the consolidated financial statements and notes thereto for the year ended December 31, 2024, included in our 2024 Form 10-K. The following discussion and analysis should also be read in conjunction with the unaudited condensed consolidated financial statements appearing elsewhere in this report.\n \nCautionary Statement\n \nStatements in this report and the schedules hereto that are not purely historical facts or that necessarily depend upon future events, including statements about expected market share gains, forecasted financial performance, industry and business outlook or other statements about anticipations, beliefs, expectations, hopes, intentions or strategies for the future, may be forward-looking statements within the meaning of Section 21E of the Securities Exchange Act of 1934, as amended. Readers are cautioned not to place undue reliance on forward-looking statements. In addition, oral statements made by our directors, officers and employees to the investor and analyst communities, media representatives and others, depending upon their nature, may also constitute forward-looking statements. All forward-looking statements are based upon currently available information and the Company’s current assumptions, expectations and projections about future events. Forward-looking statements are by nature inherently uncertain, and actual results or events may differ materially from the results or events described in the forward-looking statements as a result of many factors. The Company undertakes no obligation to publicly update or revise any forward-looking statements, whether as a result of new information, future events or otherwise. Forward-looking statements involve risks and uncertainties, many of which are beyond the Company’s control or may be currently unknown to the Company, that could cause actual events or results to differ materially from the events or results described in the forward-looking statements; such risks or uncertainties include those related to the Company’s growth strategies, including acquisitions, organic growth and digital and technology strategies, including our ability to drive growth by incorporating artificial intelligence and machine learning solutions into our platform, or the dependence of the Company’s revenues and operating results on, among other things, the homebuilding industry and, to a lesser extent, repair and remodel activity, which in each case is dependent on economic conditions, including inflation, interest rates, home size and affordability, consumer confidence, labor and supply shortages, and also lumber and other commodity prices, which may be impacted by changes in tariffs. The Company may not succeed in addressing these and other risks. Further information regarding the risk factors that could affect our financial and other results can be found in the risk factors section of the Company’s 2024 Form 10-K filed with the Securities and Exchange Commission. Consequently, all forward-looking statements in this report are qualified by the factors, risks and uncertainties contained therein.\nCOMPANY OVERVIEW\n \nWe are a leading provider of building materials for professional builders in new residential construction and repair and remodeling. We deliver integrated homebuilding solutions by manufacturing, supplying, and installing a full range of structural and related building products. The Company operates approximately 585 locations in 43 states across the United States, which are internally organized into geographic operating divisions. Due to the similar economic characteristics, categories of products, distribution methods and customers, our operating divisions are aggregated into one reportable segment.\n \nOur leading network of strategically located manufacturing facilities produces factory-built roof and floor trusses, wall panels, vinyl windows, custom millwork and trim, as well as engineered wood that we design and cut specifically for each home. We also assemble interior and exterior doors into pre-hung units for easy installation. Additionally, we distribute a wide range of building products, including lumber, sheet goods, windows, doors, millwork, and specialty items. Our services, which vary by market, include professional installation, turnkey framing, and shell construction. Supported by the latest construction innovations and digital solutions, we help drive greater efficiency across homebuilding.\nRECENT DEVELOPMENTS\nBusiness Combinations\nThrough September 30, 2025, we have completed the acquisitions of Alpine Lumber, Cluss Lumber, Truckee Tahoe, and St. George Truss for an aggregate purchase price of approximately $910.8 million, net of cash acquired. Among other opportunities, these acquisitions further expand our market footprint and provide additional operations in our value-added product categories and allow us to better serve our customers in these markets. These transactions are described in further detail in Note 2 to the condensed consolidated financial statements included in Item 1 of this quarterly report on Form 10-Q.\n \nCompany Shares Repurchases\nOn April 30, 2025, the Company’s board of directors authorized a new repurchase plan of up to $500.0 million of the Company’s outstanding shares of common stock. The new repurchase plan replaced the Company’s prior $1.0 billion share repurchase authorization announced in August 2024, which had approximately $100.0 million remaining under its authorization.\nDuring the nine months ended September 30, 2025, the Company repurchased 3.4 million shares at a weighted average price of $118.65 per share, for a total cost of $403.6 million, inclusive of applicable fees and taxes.\n \nDebt Transactions\nOn May 8, 2025, the Company completed a private offering of $750.0 million in aggregate principal amount of 6.750% senior unsecured notes due 2035, at an issue price equal to 100% of par value. The net proceeds from the offering were used to repay indebtedness outstanding under the Revolving Facility.\n\n\n16\n\n\n\n\n \n\n\nOn May 20, 2025, the Company amended the Revolving Facility to increase the existing revolving commitments of $1.8 billion with the new revolving commitments of $2.2 billion, and to extend the maturity date to May 20, 2030.\nThese transactions are described in Note 8 to the condensed consolidated financial statements included in Item 1 of this quarterly report on Form 10-Q. From time to time, based on market conditions and other factors and subject to compliance with applicable laws and regulations, the Company may repurchase or call its notes, repay debt, repurchase shares of its common stock or otherwise enter into transactions regarding its capital structure.\nMarket Information\nOur common stock is dual listed on the New York Stock Exchange and the NYSE Texas, Inc. (the “NYSE Texas”) under the trading symbol \"BLDR.\" The listing and trading of the common stock on the NYSE Texas commenced on August 12, 2025.\nCURRENT OPERATING CONDITIONS AND OUTLOOK\n \nAs a result of the U.S. federal government shutdown, September 2025 housing starts have not been published as of the date of this quarterly report on Form 10-Q. According to the U.S. Census Bureau, as of August 2025, the seasonally adjusted annual rate (“SAAR”) U.S. total housing starts were 1.3 million and the SAAR U.S. single-family housing starts were 890 thousand, a decrease of 6.0% and 11.7%, respectively, compared to the comparable period of 2024. A composite of third-party sources, including the National Association of Home Builders and John Burns Research and Consulting, are forecasting 1.3 million U.S. total housing starts and 940 thousand U.S single-family housing starts for 2025, which are decreases of 2.5% and 7.4%, respectively from 2024.\nWe believe the housing industry’s long-term outlook is positive and that it remains underbuilt due to growth in the underlying demographics compared to historical new construction levels. However, macroeconomic uncertainty, including fluctuations in interest rates, stock market volatility, impact of changes in tariffs and inflation, may continue to pressure near-term housing industry demand as homes are less affordable for consumers, investors and builders. We believe we are well-positioned to accelerate growth and capture market share as industry conditions improve in the long term. We will continue to focus on working capital by closely monitoring the credit exposure of our customers, maintaining the right level of inventory and by working with our vendors to improve payment terms. We strive to achieve the appropriate balance of short-term expense control while maintaining the expertise and capacity to grow the business.\n \nSEASONALITY AND OTHER FACTORS\n \nOur first and fourth quarters have historically been, and are generally expected to continue to be, adversely affected by weather causing reduced construction activity during these quarters. In addition, quarterly results historically have reflected, and are expected to continue to reflect, fluctuations from period to period arising from the following:\n \n•\nThe cyclical nature of the homebuilding industry; \n•\nGeneral economic conditions in the markets in which we compete; \n•\nThe volatility of lumber prices; \n•\nThe pricing policies of our competitors; \n•\nDisruptions in our supply chain; and\n•\nThe production schedules of our customers. \nThe composition and level of working capital typically change during periods of increasing sales as we carry more inventory and receivables. Working capital levels typically increase in the first and second quarters of the year due to higher sales during the peak residential construction season. These increases may result in negative operating cash flows during this peak season, which historically have been financed through available cash and borrowing availability under credit facilities. Generally, collection of receivables and reduction in inventory levels following the peak building and construction season positively impact cash flow.\n \nRESULTS OF OPERATIONS\n \nThe following table sets forth the percentage relationship to net sales of certain costs, expenses and income items:\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nThree Months Ended\nSeptember 30,\n\n\n \n\n\n \n\n\nNine Months Ended\nSeptember 30,\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n2025\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2025\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n\n\n\n\nNet sales\n\n\n \n\n\n \n\n\n100.0\n\n\n%\n\n\n \n\n\n \n\n\n100.0\n\n\n%\n\n\n \n\n\n \n\n\n100.0\n\n\n%\n\n\n \n\n\n \n\n\n100.0\n\n\n%\n\n\n\n\n\n\nCost of sales\n\n\n \n\n\n \n\n\n69.6\n\n\n%\n\n\n \n\n\n \n\n\n67.2\n\n\n%\n\n\n \n\n\n \n\n\n69.5\n\n\n%\n\n\n \n\n\n \n\n\n67.0\n\n\n%\n\n\n\n\n\n\nGross margin\n\n\n \n\n\n \n\n\n30.4\n\n\n%\n\n\n \n\n\n \n\n\n32.8\n\n\n%\n\n\n \n\n\n \n\n\n30.5\n\n\n%\n\n\n \n\n\n \n\n\n33.0\n\n\n%\n\n\n\n\n\n\nSelling, general and administrative expenses\n\n\n \n\n\n \n\n\n24.6\n\n\n%\n\n\n \n\n\n \n\n\n22.6\n\n\n%\n\n\n \n\n\n \n\n\n24.4\n\n\n%\n\n\n \n\n\n \n\n\n22.7\n\n\n%\n\n\n\n\n\n\nIncome from operations\n\n\n \n\n\n \n\n\n5.8\n\n\n%\n\n\n \n\n\n \n\n\n10.2\n\n\n%\n\n\n \n\n\n \n\n\n6.1\n\n\n%\n\n\n \n\n\n \n\n\n10.3\n\n\n%\n\n\n\n\n\n\nInterest expense, net\n\n\n \n\n\n \n\n\n1.8\n\n\n%\n\n\n \n\n\n \n\n\n1.4\n\n\n%\n\n\n \n\n\n \n\n\n1.7\n\n\n%\n\n\n \n\n\n \n\n\n1.2\n\n\n%\n\n\n\n\n\n\nIncome tax expense\n\n\n \n\n\n \n\n\n0.9\n\n\n%\n\n\n \n\n\n \n\n\n2.1\n\n\n%\n\n\n \n\n\n \n\n\n1.0\n\n\n%\n\n\n \n\n\n \n\n\n2.0\n\n\n%\n\n\n\n\n\n\n        Net income\n\n\n \n\n\n \n\n\n3.1\n\n\n%\n\n\n \n\n\n \n\n\n6.7\n\n\n%\n\n\n \n\n\n \n\n\n3.4\n\n\n%\n\n\n \n\n\n \n\n\n7.1\n\n\n%\n\n\n\n\n \n\n\n17\n\n\n\n\n \n\n\nThree Months Ended September 30, 2025 Compared with the Three Months Ended September 30, 2024\n \nNet Sales. \nNet\n \nsales for the three months ended September 30, 2025, were $3.9 billion, a 6.9% decrease from net sales of $4.2 billion for the three months ended September 30, 2024. Core organic sales decreased net sales by 10.6%, primarily due to decreases in the multi-family and single-family customer segments, while commodity price deflation decreased net sales by another 1.1%. These decreases were partially offset by an increase in net sales from acquisitions of 4.8%.\nThe following table shows net sales classified by product category:\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\nThree Months Ended September 30,\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n2025\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n(in millions)\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\nNet Sales\n\n\n \n\n\n \n\n\n% of Net Sales\n\n\n \n\n\n \n\n\nNet Sales\n\n\n \n\n\n \n\n\n% of Net Sales\n\n\n \n\n\n \n\n\n% Change\n\n\n \n\n\n\n\n\n\nManufactured products (1)\n\n\n$\n\n\n868.4\n\n\n \n\n\n \n\n\n \n\n\n22.0\n\n\n%\n\n\n \n\n\n$\n\n\n1,014.7\n\n\n \n\n\n \n\n\n \n\n\n24.0\n\n\n%\n\n\n \n\n\n \n\n\n(14.4\n\n\n)%\n\n\n\n\n\n\nWindows, doors and millwork (1)\n\n\n \n\n\n989.9\n\n\n \n\n\n \n\n\n \n\n\n25.1\n\n\n%\n\n\n \n\n\n \n\n\n1,087.0\n\n\n \n\n\n \n\n\n \n\n\n25.7\n\n\n%\n\n\n \n\n\n \n\n\n(8.9\n\n\n)%\n\n\n\n\n\n\nSpecialty building products and services\n\n\n \n\n\n1,087.3\n\n\n \n\n\n \n\n\n \n\n\n27.6\n\n\n%\n\n\n \n\n\n \n\n\n1,049.6\n\n\n \n\n\n \n\n\n \n\n\n24.8\n\n\n%\n\n\n \n\n\n \n\n\n3.6\n\n\n%\n\n\n\n\n\n\nLumber and lumber sheet goods\n\n\n \n\n\n995.6\n\n\n \n\n\n \n\n\n \n\n\n25.3\n\n\n%\n\n\n \n\n\n \n\n\n1,081.2\n\n\n \n\n\n \n\n\n \n\n\n25.5\n\n\n%\n\n\n \n\n\n \n\n\n(7.9\n\n\n)%\n\n\n\n\n\n\nNet sales\n\n\n$\n\n\n3,941.2\n\n\n \n\n\n \n\n\n \n\n\n100.0\n\n\n%\n\n\n \n\n\n$\n\n\n4,232.5\n\n\n \n\n\n \n\n\n \n\n\n100.0\n\n\n%\n\n\n \n\n\n \n\n\n(6.9\n\n\n)%\n\n\n\n\n \n(1)\n Manufactured products and windows, doors and millwork are collectively referred to as total value-added products.\n \nWe experienced decreased net sales in our manufactured products category primarily due to decreased single-family activity due to lower housing starts and decreased multi-family activity, partially offset by an increase in net sales from acquisitions. Our windows, doors, and millwork declined primarily due to decreased single-family activity due to lower housing starts. Our lumber and lumber sheet goods category decreased primarily due to lower single-family housing starts and commodity price deflation, partially offset by an increase in net sales from acquisitions. For the comparable period, specialty building products remained relatively consistent.\n \nGross Margin. \nGross margin decreased $0.2 billion to $1.2 billion. Our gross margin percentage decreased to 30.4% in the third quarter of 2025 from 32.8% in the third quarter of 2024, a 2.4% decrease. This decrease was primarily driven by a below-normal starts environment.\n \nSelling, General and Administrative Expenses.\n Selling, general and administrative expenses increased by $12.4 million, or 1.3%, primarily due to additional operating expenses from locations acquired within the last twelve months and our ongoing enterprise resource planning (“ERP”) system implementation, partially offset by lower variable compensation due to decreased sales and the absence of prior year asset write-offs.\n \nAs a percentage of net sales, selling, general and administrative expenses increased to 24.6%, up from 22.6%, for the three months ended September 30, 2025 and 2024, respectively, primarily attributable to reduced operating leverage.\nInterest Expense, Net.\n Interest expense was $69.3 million in the third quarter of 2025, an increase of $15.0 million from the third quarter of 2024. The increase was primarily due to higher average debt balances.\nIncome Tax Expense. \nWe recorded income tax expense of $37.1 million and $89.0 million in the third quarters of 2025 and 2024, respectively. The decrease in the tax expense was primarily driven by a decrease in income before income taxes in the current period. Our effective tax rate was 23.3% in the third quarter of 2025, a decrease from 23.8% in the third quarter of 2024, primarily related to decreased permanent and other differences.\nNine Months ended September 30, 2025 Compared with the Nine Months ended September 30, 2024\n \nNet Sales. \nNet\n \nsales for the nine months ended September 30, 2025, were $11.8 billion, a 5.9% decrease from net sales of $12.6 billion for the nine months ended September 30, 2024. Core organic sales decreased net sales by 9.1%, primarily due to decreases in the multi-family and single-family customer segments, while commodity price deflation and one fewer selling day decreased net sales by another 1.2% and 0.5%, respectively. These decreases were partially offset by increased net sales from acquisitions of 4.9%.\n \n         The following table shows net sales classified by product category:\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\nNine Months Ended September 30,\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n2025\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n(in millions)\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\nNet Sales\n\n\n \n\n\n \n\n\n% of Net Sales\n\n\n \n\n\n \n\n\nNet Sales\n\n\n \n\n\n \n\n\n% of Net Sales\n\n\n \n\n\n \n\n\n% Change\n\n\n \n\n\n\n\n\n\nManufactured products (1)\n\n\n$\n\n\n2,691.5\n\n\n \n\n\n \n\n\n \n\n\n22.7\n\n\n%\n\n\n \n\n\n$\n\n\n3,075.5\n\n\n \n\n\n \n\n\n \n\n\n24.4\n\n\n%\n\n\n \n\n\n \n\n\n(12.5\n\n\n)%\n\n\n\n\n\n\nWindows, doors and millwork (1)\n\n\n \n\n\n2,962.3\n\n\n \n\n\n \n\n\n \n\n\n25.0\n\n\n%\n\n\n \n\n\n \n\n\n3,238.4\n\n\n \n\n\n \n\n\n \n\n\n25.7\n\n\n%\n\n\n \n\n\n \n\n\n(8.5\n\n\n)%\n\n\n\n\n\n\nSpecialty building products & services\n\n\n \n\n\n3,050.0\n\n\n \n\n\n \n\n\n \n\n\n25.9\n\n\n%\n\n\n \n\n\n \n\n\n2,963.8\n\n\n \n\n\n \n\n\n \n\n\n23.6\n\n\n%\n\n\n \n\n\n \n\n\n2.9\n\n\n%\n\n\n\n\n\n\nLumber & lumber sheet goods\n\n\n \n\n\n3,129.0\n\n\n \n\n\n \n\n\n \n\n\n26.4\n\n\n%\n\n\n \n\n\n \n\n\n3,302.5\n\n\n \n\n\n \n\n\n \n\n\n26.3\n\n\n%\n\n\n \n\n\n \n\n\n(5.3\n\n\n)%\n\n\n\n\n\n\nNet sales\n\n\n$\n\n\n11,832.8\n\n\n \n\n\n \n\n\n \n\n\n100.0\n\n\n%\n\n\n \n\n\n$\n\n\n12,580.2\n\n\n \n\n\n \n\n\n \n\n\n100.0\n\n\n%\n\n\n \n\n\n \n\n\n(5.9\n\n\n)%\n\n\n\n\n \n\n\n18\n\n\n\n\n \n\n\n(1)\n Manufactured products and windows, doors and millwork are collectively referred to as total value-added products.\n \nWe experienced decreased net sales in our manufactured products category primarily due to decreased single-family activity due to lower housing starts and decreased multi-family activity, partially offset by an increase in net sales from acquisitions. Our windows, doors, and millwork declined primarily due to decreased single-family activity due to lower housing starts. Our lumber and lumber sheet goods category decreased primarily due to lower single-family housing starts and commodity price deflation, partially offset by an increase in net sales from acquisitions. For the comparable period, specialty building products remained relatively flat.\n \nGross Margin. \nGross margin decreased $0.5 billion to $3.6 billion, and our gross margin percentage decreased to 30.5% for the nine months ended September 30, 2025, from 33.0% in the nine months ended September 30, 2024, a 2.5% decrease. This decrease was primarily attributed to a lower starts environment.\nSelling, General and Administrative Expenses.\n Selling, general and administrative expenses increased $31.5 million, or 1.1%. This increase was primarily due to additional operating expenses from locations acquired within the last twelve months and our ongoing ERP system implementation, partially offset by lower variable compensation due to decreased sales and the absence of prior year asset write-offs.\n \nAs a percentage of net sales, selling, general and administrative expenses increased to 24.4% up from 22.7% for the nine months ended September 30, 2025 and 2024, respectively, primarily attributable to reduced operating leverage.\nInterest Expense, Net.\n Interest expense was $206.1 million in the nine months ended September 30, 2025, an increase of $51.5 million from the nine months ended September 30, 2024. Interest expense increased primarily due to higher average debt balances.\nIncome Tax Expense. \nWe recorded income tax expense of $114.6 million and $248.8 million for the nine months ended September 30, 2025 and 2024, respectively. The decrease in tax expense was primarily driven by a decrease in income before income taxes in the current period. Our effective tax rate was 22.1% in the first nine months ended September 30, 2025, an increase from 21.9% in the first nine months ended September 30, 2024, primarily related to a decrease in our stock-based compensation windfall benefit, partially offset by permanent and other differences.\nLIQUIDITY AND CAPITAL RESOURCES\n \nOur primary capital requirements are to fund working capital needs and operating expenses, meet required interest and principal payments, and to fund capital expenditures and potential future growth opportunities. Our capital resources at September 30, 2025, consist of cash on hand and borrowing availability under our Revolving Facility.\n \nOur Revolving Facility is primarily used for working capital, general corporate purposes and funding capital expenditures and growth opportunities. In addition, we may use borrowings under the Revolving Facility to facilitate debt repayment and consolidation, and to fund share repurchases. Availability under the Revolving Facility is determined by a borrowing base. Our borrowing base consists of accounts receivable, inventory, and qualified cash that all meet specific criteria contained within the credit agreement, minus agent specified reserves. Net excess borrowing availability is equal to the maximum borrowing amount minus outstanding borrowings and letters of credit.\n \nThe following table shows our borrowing base and excess availability as of:\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nSeptember 30,\n2025\n\n\n \n\n\n \n\n\nDecember 31,\n2024\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n(in millions)\n\n\n \n\n\n\n\n\n\nAccounts receivable availability (1)\n\n\n \n\n\n$\n\n\n842.5\n\n\n \n\n\n \n\n\n$\n\n\n773.4\n\n\n \n\n\n\n\n\n\nInventory availability\n\n\n \n\n\n \n\n\n881.8\n\n\n \n\n\n \n\n\n \n\n\n891.7\n\n\n \n\n\n\n\n\n\nGross availability\n\n\n \n\n\n \n\n\n1,724.3\n\n\n \n\n\n \n\n\n \n\n\n1,665.1\n\n\n \n\n\n\n\n\n\nLess:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nAgent reserves\n\n\n \n\n\n \n\n\n(47.3\n\n\n)\n\n\n \n\n\n \n\n\n(39.3\n\n\n)\n\n\n\n\n\n\nPlus:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nCash in qualified accounts\n\n\n \n\n\n \n\n\n192.5\n\n\n \n\n\n \n\n\n \n\n\n88.5\n\n\n \n\n\n\n\n\n\nBorrowing base\n\n\n \n\n\n \n\n\n1,869.5\n\n\n \n\n\n \n\n\n \n\n\n1,714.3\n\n\n \n\n\n\n\n\n\nAggregate revolving commitments\n\n\n \n\n\n \n\n\n2,200.0\n\n\n \n\n\n \n\n\n \n\n\n1,800.0\n\n\n \n\n\n\n\n\n\nMaximum borrowing amount (lesser of borrowing base and \n    aggregate revolving commitments)\n\n\n \n\n\n \n\n\n1,869.5\n\n\n \n\n\n \n\n\n \n\n\n1,714.3\n\n\n \n\n\n\n\n\n\nLess:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nOutstanding borrowings\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n\n\n\n\nLetters of credit\n\n\n \n\n\n \n\n\n(79.6\n\n\n)\n\n\n \n\n\n \n\n\n(83.3\n\n\n)\n\n\n\n\n\n\nNet excess borrowing availability on revolving facility\n\n\n \n\n\n$\n\n\n1,789.9\n\n\n \n\n\n \n\n\n$\n\n\n1,631.0\n\n\n \n\n\n\n\n \n(1)\nThe prior year amounts have been conformed to current period presentation. There is no impact on gross availability or net excess borrowing availability on the Revolving Facility as previously reported.\n \n\n\n19\n\n\n\n\n \n\n\nAs of September 30, 2025, we had no outstanding borrowings under our Revolving Facility, and our net excess borrowing availability was $1.8 billion after being reduced by outstanding letters of credit totaling $79.6 million. Excess availability must equal or exceed a minimum specified amount, currently $187.0 million, or we are required to meet a fixed charge coverage ratio of 1.00 to 1.00. We were not in violation of any covenants or restrictions imposed by any of our debt agreements at September 30, 2025.\n \nLiquidity\n \nOur liquidity at September 30, 2025, was $2.1 billion, which consists of net borrowing availability under the Revolving Facility and cash on hand.\n \nOur level of indebtedness results in significant interest expense and could have the effect of, among other things, reducing our flexibility to respond to changing business and economic conditions. From time to time, based on market conditions and other factors and subject to compliance with applicable laws and regulations, we may repurchase or call our notes, repay, refinance or modify our debt or otherwise enter into transactions regarding our capital structure.\nIf industry conditions deteriorate or if we pursue additional acquisitions, we may be required to raise additional funds through the sale of capital stock or debt in the public capital markets or in privately negotiated transactions. There can be no assurance that any of these financing options would be available on favorable terms, if at all. Alternatives to help supplement our liquidity position could include, but are not limited to, idling or permanently closing additional facilities, adjusting our headcount in response to current business conditions, attempts to renegotiate leases, managing our working capital and/or divesting of non-core businesses. There are no assurances that these steps would prove successful or materially improve our liquidity position.\nConsolidated Cash Flows\n \nCash provided by operating activities was $1.0 billion for the nine months ended September 30, 2025, compared to cash provided by operating activities of $1.5 billion for the nine months ended September 30, 2024. The decrease in cash provided by operating activities was largely the result of lower net income in the first nine months of 2025.\nFor the nine months ended September 30, 2025, cash used in investing activities increased $0.6 billion compared to the nine months ended September 30, 2024, primarily due to using an additional $0.6 billion of cash for acquisitions.\nCash provided by financing activities was $0.3 billion for the nine months ended September 30, 2025, which consisted primarily of a net $0.7 billion received for the issuance of the 6.75% 2035 Notes, offset by $0.4 billion for repurchases of common stock. Cash used in financing activities was $0.7 billion for the nine months ended September 30, 2024, which consisted primarily of $1.2 billion for repurchases of common stock and $0.5 billion in net payments on the Revolving Facility, offset by a net $1.0 billion received for the issuance of the 6.375% 2034 Notes.\n \nCRITICAL ACCOUNTING POLICIES AND ESTIMATES\n \nCritical accounting policies are those that are both important to the accurate portrayal of a company’s financial condition and results, and require subjective or complex judgments, often as a result of the need to make estimates about the effect of matters that are inherently uncertain.\nTo prepare financial statements that conform to generally accepted accounting principles, we make estimates and assumptions that affect the amounts reported in our financial statements and accompanying notes. Certain estimates are particularly sensitive due to their significance to the financial statements and the possibility that future events may be significantly different from our expectations.\nRefer to Part II, “Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations” in our 2024 Form 10-K for a discussion of our critical accounting estimates and assumptions.\n \nRECENT ACCOUNTING PRONOUNCEMENTS\n \nInformation regarding recent accounting pronouncements is discussed in Note 1 to the condensed consolidated financial statements included in Item 1 of this quarterly report on Form 10-Q."
}