{
  "item1": "Acquisitions, Divestitures, Licensing Other Arrangements Products, Intellectual Property Product Exclusivity Research Development Marketing, Distribution Customers Pricing, Price Constraints Market Access Government Regulation Sources Availability Raw Materials Manufacturing Quality Assurance Environmental Regulation Human Capital Management Resources Bristol Myers Squibb Website",
  "item7": "$8.27 decrease GAAP EPS 2024 primarily driven one-time, non-deductible Acquired IPRD charge resulting Karuna asset acquisition SystImmune collaboration, which impacted full-year GAAP EPS approximately $6.28 impact certain specified items, primarily intangible asset impairments. After adjusting specified items, $6.36 decrease non-GAAP EPS primarily due aforementioned Acquired IPRD charges higher interest expense partially offset higher revenues. non-GAAP financial measures, including non-GAAP earnings related EPS information, adjusted exclude specified items represent certain costs, expenses, gains losses other items impacting comparability financial results. detailed listing all specified items further information, reconciliations changes non-GAAP financial measures refer “—Non-GAAP Financial Measures.” Economic Market Factors Governmental Actions regulators continue focus prescription drugs, products facing increased pressures across portfolio.",
  "item2": "Three Months Ended September 30, Nine Months Ended September 30, Dollars millions, except per share data Diluted earnings/(loss) per share GAAP Revenues increased 3% third quarter 2025 decreased 1% year-to-date basis. Demand increased across Growth Portfolio , which offset impact generics across remainder Legacy Portfolio Additionally, year-to-date revenues impacted redesign U.S. Medicare Part D program. $0.48 increase GAAP EPS third quarter 2025 primarily due impact certain specified items, including lower amortization acquired intangible assets, cost savings ongoing strategic productivity initiative 2025, partially offset higher one-time Acquired IPRD charges."
}