{
  "source_file": "br-20250630.htm",
  "form_type": "10-K",
  "item1": "ITEM 1.    Business\nThe Broadridge Business\nBroadridge, a Delaware corporation, is a global financial technology leader powering investing, corporate governance, and communications.\n \nWe deliver technology-driven solutions to banks, broker-dealers, asset and wealth managers, public companies, investors, and mutual funds, that enable our clients to operate, innovate and grow. Our trusted expertise and transformative technology solutions help financial services companies enhance investor engagement, optimize trading and investing, and digitize communications.\nWe operate our business in two reportable segments: Investor Communication Solutions and Global Technology and Operations.\nInvestor Communication Solutions\nOur Regulatory Solutions, Data-Driven Fund Solutions, Corporate Issuer Solutions, and Customer Communications Solutions are provided as part of the Investor Communication Solutions segment. The Investor Communication Solutions segment is the larger of our two business segments and its revenues represented approximately 74% and 75% of our total Revenues in fiscal years 2025 and 2024, respectively, including the foreign exchange impact from revenues generated in currencies other than the United States of America (“U.S.”) dollar. See “Analysis of Reportable Segments — Revenues” under “Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations.” We provide the following services and solutions through our Investor Communication Solutions segment:\nRegulatory Solutions \n \nWe handle the entire proxy materials distribution and voting process for our bank, broker-dealer, corporate issuer and fund clients. We offer electronic and traditional hard copy services for the delivery of proxy materials to investors and collection of consents; maintenance of a rules engine and database that contains the delivery method preferences of our clients’ customers; posting of documents on their websites; email notification to investors alerting them that proxy materials are available; and proxy voting via telephone, online, mobile, or paper. We have the ability to combine shareholder communications for multiple stockholders residing at the same address. We also offer proxy vote solicitation services for the registered clients of fund companies, efficiently managing the entire proxy campaign. \nIn addition, we provide a complete outsourced solution for the processing of all international institutional and retail proxies, including shareholder disclosure management.\nA majority of publicly-traded shares are not registered in companies’ records in the names of their ultimate beneficial owners. Instead, a substantial majority of all public companies’ shares are held in “street name, meaning that they are held of record by broker-dealers or banks through their depositories. Most street name shares are registered in the name “Cede & Co.” the name used by The Depository Trust and Clearing Corporation (“DTC”), which holds shares on behalf of its participant broker-dealers and banks. These participant broker-dealers and banks (which are known as “Nominees” because they hold securities in name only) in turn hold the shares on behalf of their customers, the individual beneficial owners. Nominees, upon request, are required to provide companies with the information of beneficial owners who do not object to having their names, addresses, and shareholdings supplied to companies, so called “non-objecting beneficial owners” (or “NOBOs”). Objecting beneficial owners (or “OBOs”) may be contacted directly only by the broker-dealer or bank. As DTC’s role is only as the custodian, a number of mechanisms have been developed in order to pass the legal rights DTC holds as the record owner (such as the right to vote) to the beneficial owners. The first step in passing voting rights down the chain is the “omnibus proxy,” which DTC executes to transfer its voting rights to its participant Nominees. Under applicable rules, Nominees must deliver proxy materials to beneficial owners and request voting instructions.\n4\nGiven the large number of Nominees involved in the beneficial proxy process resulting from the large number of beneficial shareholders, we play a unique, central, and integral role in ensuring that the beneficial proxy process occurs without issue for Nominees, companies, funds, and investors. A large number of Nominees have contracted out the processes of distributing proxy materials and tabulating voting instructions to us. Nominees accomplish this by entering into agreements with Broadridge and transferring to us, via powers of attorney, the authority to execute a proxy, which authority the Nominee receives from DTC via an omnibus proxy. Through our agreements with Nominees for the provision of beneficial proxy services, we take on the responsibility of ensuring that the account holders of Nominees receive proxy materials on a timely basis digitally or in print, that their voting instructions are conveyed to the companies and funds conducting solicitations and that these services are fulfilled in accordance with the requirements of their particular solicitation. In order for us to provide the beneficial proxy services effectively, we interface and coordinate directly with each company and/or fund to ensure that the services are performed in an accurate and timely manner. As it would increase the costs for companies and funds to work with the Nominees through which their shares are held beneficially on an individual basis, companies and funds work with us for the performance of the tasks and processes necessary to ensure that proxy materials are distributed on a timely basis to all beneficial owners and that their votes are accurately reported.\nThe SEC’s rules require public companies to reimburse Nominees for the expense of distributing stockholder communications to beneficial owners of securities held in street name. The reimbursement rates are set forth in the rules of self-regulatory organizations (“SROs”), including the New York Stock Exchange (“NYSE”). We bill public companies for the proxy services performed, collect the fees, and remit to the Nominee its portion of the fees. In addition, the NYSE rules establish fees for certain services provided by intermediaries, such as Broadridge, in the proxy process. The preparation and delivery of NOBO information is subject to reimbursement by the corporate issuers requesting the information. The reimbursement rates are based on the number of NOBOs produced pursuant to NYSE or other SRO rules. The rules also determine the fees to be paid to third-party intermediaries, such as Broadridge, who compile the NOBO information on behalf of Nominees who need to respond to corporate issuer requests for NOBO information.\nWe provide institutional investors with a suite of services to manage and track the entire proxy voting process, including meeting their reporting needs. ProxyEdge\n® \n(“ProxyEdge”) is our innovative electronic proxy delivery and voting solution for institutional investors and financial advisors that integrates ballots for positions held across multiple custodians and presents them under a single proxy. Voting can be instructed for the entire position, by account vote group, or on an individual account basis either manually or automatically based on the recommendations of participating governance research providers. ProxyEdge also provides for client reporting and regulatory reporting. ProxyEdge can be utilized for meetings of U.S. and Canadian companies and for meetings in many non-North American countries based on the holdings of our global custodian clients. ProxyEdge is offered in several languages and there are currently over 7,000 ProxyEdge users worldwide.\nIn addition to our proxy services, we provide regulatory communications solutions that enable global asset managers to communicate with large audiences of investors efficiently and reliably by centralizing all investor communications through one resource. We provide composition, printing, filing, and distribution services for regulatory reports, prospectuses, and proxy materials, as well as mutual fund proxy solicitation services. We manage the entire communications process with both registered and beneficial stockholders and provide a complete platform for creating and distributing regulatory investor communications across multiple channels, including e-delivery, online, mobile, and print. These services include prospectus delivery and an end-to-end solution to fund administrators and asset managers for composing, filing, and distributing tailored annual and semi-annual shareholder reports, known as Tailored Shareholder Reports, that are ADA-compliant and have embedded XBRL.\nThrough our Fund Communication Solutions business, we provide fund managers with a single, integrated provider to manage data, perform calculations, compose documents, manage regulatory compliance, and disseminate information across multiple jurisdictions. Our solutions help fund managers increase distribution opportunities, comply with both United Kingdom and European Union regulations such as Solvency II and MiFID II, and make information easily accessible for investors in a digital format. We also provide support to fund managers with document and data dissemination in the UK and European markets, enabling the receipt by distributors and investors of information supporting fund sales.\nOur Pass-Through Voting solution supports fund clients in providing individual investors the ability to participate in the proxy voting process, helping them to expand their investor engagement efforts and receive valuable input for important investment decisions. Our solution for institutional investors helps asset managers split the vote in portfolio companies and pass the ability to vote directly to institutional investors on a proportional basis. For retail investors, our solutions allow funds to poll their investors on voting preferences and provide investors the ability to give voting instructions, set standard voting preferences, or cast a vote at pre-determined meetings. \n5\nIn addition to our fund solutions, we also provide a range of other regulatory communications solutions, including reorganization communications notifying investors of U.S. reorganizations or corporate action events, such as tender offers, mergers and acquisitions, bankruptcies, and global class action services for the identification, filing and recovery of class actions and collective redress proceedings involving securities and other financial products.\nWe also provide international corporate governance solutions addressing our clients’ needs within Europe, the Middle East and Africa (“EMEA”) and the Asia-Pacific (“APAC”) region. \nThese solutions include institutional and retail global proxy services, and shareholder disclosure management and analytics for both financial intermediaries and corporate issuers. \nOur international solutions help clients focus on their core businesses while helping them maintain global and local regulatory compliance, reduce costs, improve efficiency and gain data insights.\nData-Driven Fund Solutions\nWe provide a full range of data-driven solutions that help our asset management and retirement service provider clients grow revenue, operate efficiently, and maintain compliance. Our data and analytics solutions provide investment product distribution data, predictive modeling, analytical tools, and insights and research to enable asset managers to optimize product distribution across retail and institutional channels globally. We also provide fiduciary-focused learning and development, software and technology, and data and analytics services to advisors, institutions and asset managers across the retirement and wealth ecosystem.\n \nThrough our Retirement and Workplace Solutions business (“Broadridge Retirement and Workplace”), we provide automated mutual fund and exchange-traded funds trade processing services for financial institutions that submit trades on behalf of their clients, including qualified and non-qualified retirement plans and individual wealth accounts.\n \nOur trust, trading and settlement services are integrated into our product suite, strengthening our role as a provider of insight, technology, and business process outsourcing to the asset management, wealth, and retirement industry. In addition, our marketing and transactional communications solutions provide a content management and omni-channel distribution platform for marketing and sales communications for asset managers, insurance providers and retirement service providers. \nCorporate Issuer Solutions \n \nWe provide a range of corporate issuer solutions that revolve around shareholder meetings and proxy, corporate governance and sustainability, regulatory filings and disclosure, and stock transfer services. Our services provide corporate issuers a single source solution that spans the entire shareholder communications and corporate disclosure lifecycle.\nOur shareholder meetings and proxy services and our corporate governance and sustainability services include a full suite of annual meeting and shareholder engagement solutions:\n•\nProxy services – we provide complete project management for the entire annual meeting process including registered and beneficial proxy materials distribution, vote processing, and tabulation through our ShareLink\n®\n solution.\n•\nVirtual Shareholder Meeting™ – electronic annual meetings via webcast, either on a stand-alone basis, or in conjunction with in-person annual meetings, including shareholder validation and voting services and the ability for shareholders to ask questions and for management to respond during the meetings.\n•\nShareholder engagement tools - we offer tools for corporate issuers to help them better engage with their shareholders and other stakeholders in connection with the annual meeting process as well as on an ongoing basis throughout the year. These services provide aggregated shareholder data and analytics, shareholder delivery preferences, and voting trends. \n•\nSustainability services - we provide consulting in support of issuers and their sustainability initiatives. The services include peer governance and sustainability disclosure benchmarking, sustainability strategy and policy development, greenhouse gas emission assessments, and sustainability data management and reporting. We also offer a Governance and Sustainability dashboard that provides consensus ratings to allow corporate issuers to assess the progress of their Governance and Sustainability ratings and disclosure relative to their selection of peer companies.\nOur regulatory filings and disclosure solutions provide compliance reporting and transactional reporting services for public companies, including the following:\n•\nSecurities and Exchange Commission (“SEC”) Filing Services: proxy and annual report design and digitization, SEC filing, printing, and web hosting services, as well as year-round SEC reporting including document composition, EDGARization and XBRL tagging.\n6\n•\nCapital Markets Transactional Services: typesetting, composition, printing, and SEC filing services for capital markets transactions such as initial public offerings, spin-offs, acquisitions, and securities offerings. In addition, we provide transaction support services such as virtual deal rooms and translation services.\nWe also provide registrar, stock transfer, and record-keeping services through our transfer agency services. Our transfer agency services address the needs public companies have for more efficient and reliable stockholder record maintenance and communication services. In addition, we provide corporate actions services, including acting as the exchange agent, paying agent, or tender agent in support of acquisitions, initial public offerings, and other significant corporate transactions. We also provide abandoned property compliance and reporting services.\nCustomer Communications Solutions \n \nWe support financial services, healthcare, insurance, consumer finance, telecommunications, utilities, and other service industries with omni-channel customer communications management strategies for their transactional communications, including statements and bills, marketing communications, such as personalized microsites and campaigns, and regulatory communications, such as trade confirmations and explanations of benefits. \nThese services include digital and physical delivery of critical communications. Our physical delivery services operate through a network of seven highly automated facilities across North America. The Broadridge Communications Cloud\nSM\n is an omni-channel platform (the “Communications Cloud”) that provides our clients the flexibility to implement only the modules and delivery channels needed to address their specific communication needs. The platform’s open application programming interfaces and self-servicing tools help our clients improve their communications systems’ efficiency and productivity. Through the Communications Cloud, our clients can:\n•\ndevelop transactional, regulatory, and marketing communications with relevant, self-service content that drives customer action;\n•\ndeliver customer communications across print, digital, email, short message service (“SMS”) and emerging channels, such as interactive microsites, with one connection; and\n•\ngain comprehensive reporting and analytics to improve communications and increase engagement based on customer behaviors.\nGlobal Technology and Operations\nTransactions involving securities and other financial market instruments can, for example, originate with an institutional or retail investor who places an order with a broker who in turn routes that order to an appropriate market for execution. At that point, the parties to the transaction coordinate payment and settlement of the transaction through a clearinghouse. The records of the parties involved must then be updated to reflect completion of the transaction. The transaction must comply with tax, custody, accounting, and record-keeping requirements, and the customer’s account information must correctly reflect the transaction. The accurate processing of trading activity from its initial inception and custody activity requires effective automation and information flow across multiple systems and functions within the firm and across the systems of the various parties that participate in the execution of a transaction. \nOur Global Technology and Operations business provides mission-critical, scale infrastructure to the global financial markets. As a leading software as a service (“SaaS”) provider, we offer capital markets and wealth and investment management firms modern technology to enable growth, simplify their technology stacks, and mutualize costs.\n \nOur highly scalable, resilient, component-based platform automates the front-to-back transaction lifecycle of equity, mutual fund, fixed income, foreign exchange and exchange-traded derivatives, from order capture and execution through trade confirmation, margin, cash management, clearing and settlement, reference data management, reconciliations, securities financing and collateral management, asset servicing, compliance and regulatory reporting, portfolio accounting and custody-related services. Our Wealth Management business provides solutions for advisors and investors and streamlines back- and middle-office operations for broker-dealers by providing systems for critical post-trade activities, including books and records, transaction processing, clearance and settlement, and reporting.\n \nOur Investment Management business provides portfolio and order management solutions for traditional and alternative asset managers, which bring insights into trading, portfolio construction, risk, and analytics. Our solutions connect asset managers to a global network of broker-dealers for trade execution and post-trade matching and confirmation. In addition, we provide business process outsourcing services for our buy- and sell-side clients’ businesses. These services combine our technology with our operations expertise to support the entire trade lifecycle, including securities clearing and settlement, reconciliations, record-keeping, wealth management asset servicing, and custody-related functions.\n7\nThe Global Technology and Operations segment’s revenues represented approximately 26% and 25% of our total Revenues in fiscal years 2025 and 2024, respectively, which gives effect to the foreign exchange impact from revenues generated in currencies other than the U.S. dollar. See “Analysis of Reportable Segments — Revenues” under “Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations.” We provide the following services and solutions through our Global Technology and Operations segment:\nCapital Markets Solutions\nOur capital markets platform and solutions deliver simplification and innovation across the trade lifecycle, from order initiation to settlement.  Largely provided on a SaaS basis within large user communities, our technology is a global solution, processing trades, clearance and settlement in over 90 markets.  Our technology enables our clients to meet the requirements of market change such as the T+1 securities settlement cycle. Our solutions enable global capital markets firms to access market liquidity, driving more effective market making and efficient front-to-back trade processing. These services include data management, securities financing, securities-based lending, collateral management, trade and transaction reporting, reconciliations, financial messaging, and asset servicing. Our solutions can be deployed as a complete solution as well as discrete components supporting financial institutions.\nThrough Broadridge Trading and Connectivity Solutions\n, we offer a set of global front-office trade order and execution management systems and connectivity solutions that enable market participants to connect and trade. Our front-office solutions, post-trade product suite and other capital markets capabilities enable our clients to streamline their front-to-back technology platforms and operations and increase straight-through-processing efficiencies, across equities, fixed income, exchange-traded derivatives, and other asset classes. We also provide a set of multi-asset, multi-entity and multi-currency trading, connectivity and post-trade solutions that support processing of securities transactions in equities, options, fixed income securities, foreign exchange, exchange-traded derivatives and mutual funds.\nIn addition, we provide comprehensive fixed income transaction processing capabilities to support clearance, settlement, custody, P&L reporting, and regulatory reporting for domestic and foreign fixed income instruments. Our solution includes extensive support for mortgage-backed securities and other structured products, and is a multi-currency, multi-entity solution that provides position and balance information, in addition to detailed accounting, financing, collateral management, and repurchase agreement functionality. The solution offers straight-through-processing capabilities, enterprise-wide integration, and a robust technology infrastructure - all focused on supporting firms specializing in the fixed income marketplace. We are advancing our capabilities and market offering through distributed ledger technology in repo markets, and leading across capital markets in the application of artificial intelligence (“AI”) as a service.\nWealth and Investment Management Solutions\nOur Wealth Management business delivers front-to-back technology solutions, including digital marketing services to enable full-service, regional, and independent broker-dealers and investment advisors to better engage with their customers and help grow their business. Our wealth solutions are designed to help optimize advisor productivity, improve investor outcomes, digitize operations, reduce friction in investing, increase financial literacy, and deliver more personalized advice and insights.\nWe offer an integrated, modern open-architecture wealth management platform through which we provide enhanced data-centric capabilities, integrating the use of AI, to improve the overall client experience across the entire front-, middle- and back-office wealth management lifecycle, including advisor, investor, and operational workflows. This comprehensive wealth management platform streamlines all aspects of the service model, allowing our clients to digitally onboard customers, manage advisor compensation for multiple products and service models, and seamlessly transfer and service accounts. \nIn addition, we provide data-driven, digital\n \nsolutions to broker-dealers, financial advisors, insurers, and other firms with large, distributed salesforces. Our data aggregation solution helps financial advisors manage and build client relationships by providing customer account data aggregation, performance reporting, household grouping, automated report creation, document storage, and integration with popular financial planning and productivity applications. \nOur digital marketing and content capabilities leverage analytics and machine-learning to enable financial advisors and wealth management firms to grow their businesses and deepen relationships with their customers. Financial advisors and wealth management firms can tap into our digital tools and library of omni-channel content to personalize touchpoints to engage their customers and prospects across digital channels including websites, social media, email, and mobile.\n8\nOur Investment Management business services the global investment management industry with a range of buy-side technology solutions. Our asset management solutions are portfolio management, compliance, fee billing and operational support solutions such as order management, data warehousing, reporting, reference data management, and risk management and portfolio accounting for hedge funds, family offices, alternative asset managers, traditional asset managers, and the providers that service this space including prime brokers, fund administrators, and custodians. The client base for these services includes institutional asset managers, public funds, start-ups, or emerging managers through some of the largest global hedge fund complexes and global fund administrators. \nOur Strategy \nWe earn our clients’ confidence every day by delivering real business value through leading technology-driven solutions that help our clients get ahead of today’s challenges and capitalize on future growth opportunities. Our solutions harness people, technology, and insights to help transform our clients’ businesses by enriching customer engagement, navigating risk, optimizing efficiency, and growing revenue.\nAs financial institutions look to transform and mutualize their mission-critical but non-differentiating operational and support functions, we have the proven technology, scale, innovation, experience and, most importantly, the network to achieve this goal and meet their needs.\n \nOur strategy addresses critical industry needs by utilizing our leading platform capabilities. Specifically, our growth strategy is focused on three key themes: (i) driving democratization and digitization in governance, (ii) simplifying and innovating trading in capital markets, and (iii) modernizing wealth and investment management.\nOur business model\nWe deliver multi-client technology and business process outsourcing services primarily through common SaaS-based operations platforms. We create layers of value for clients by harnessing network benefits, providing deep data and analytics, and offering a comprehensive suite of digital capabilities all on a single platform that enables deeper integration, streamlined onboarding, and better data access. Our SaaS offerings allow our clients to mutualize key functions and thereby reduce their costs. All of this translates into our core value proposition, to be a trusted provider of technology and services across a range of analytical, operational, and reporting functions.\nStrong positions in a large and growing financial services market\nOur technology and associates power the critical infrastructure and services behind investing, investment governance, and investor communications. We make our clients stronger, and through them, we enable better financial lives for investors around the globe. Our deep industry knowledge enables our clients to successfully solve complex technological and operational challenges, while adapting to the latest technology trends, market structure changes, and regulatory standards. While financial services firms have historically kept much of their technology infrastructure work in-house, there are significant trends working in our favor. Specifically, financial services firms globally are spending more on technology, and the budgets allocated for such technology are consistently growing year-over-year. Moreover, these firms are devoting a growing percentage of this spend to third-party technology, operations, and services. As a trusted outside service provider, we can streamline and better integrate our clients’ infrastructure and business processes. We expect the efficiencies that result from such undertakings by Broadridge will lead to growth in the market for our solutions.\nThree attractive growth themes\nOur growth themes address mission-critical client needs as described below. Through our integrated solutions and scalable infrastructure, we believe we are best positioned to address them.\n•\nGovernance\n. We operate an extensive industry network through our governance platform that links broker-dealers, public companies, mutual funds, shareholders, and regulators. Through our platform, we continue to grow our governance solutions by transforming content and delivery and improving e-product capabilities to drive higher investor engagement. We aim to be an integral partner to broker-dealers, asset managers, and retirement service providers by offering data-driven solutions that help them grow revenue, reduce costs, and maintain compliance. We are also helping to simplify the governance process for public companies, offering an expanding suite of capabilities that allows them to better navigate the complexity of reaching shareholders. We continue to be a leading provider of investor communications, and are at the forefront of delivering richer communication experiences, both digitally and through optimized print and mail services.\n9\n•\nCapital Markets. \nGlobal institutions have a strong need to simplify their complex technology environment, and our SaaS-based, global, multi-asset-class technology platforms address this need. As a leader in global trade lifecycle management, we are driving next-generation solutions that simplify our clients’ operations, improve performance and resiliency, evolve to global operating models, adapt to new technologies, and enable our clients to better manage their data. Our acquisition of Itiviti Holding AB, now operating as Broadridge Trading and Connectivity Solutions, for example, expanded our services across the trade lifecycle for equities and exchange-traded derivatives and grew our international reach. We continue to leverage emerging technologies such as blockchain and AI to deliver innovative solutions to our clients.  Our blockchain-enabled Distributed Ledger Repo (“DLR”) platform combines distributed ledger technology with existing market settlement infrastructure to provide clients added flexibility to manage their liquidity needs and execute cross-border intraday repo transactions through our DLR network.  In addition, we have introduced a number of AI-driven solutions such as BondGPT and OpsGPT with agentic capabilities while continuing to develop new AI applications to create a more efficient trading process for our clients. We also continue to develop component solutions that meet the regulatory, risk, data, and analytics needs of our clients, while also helping to drive more efficient liquidity, price discovery, and improved execution for the firms we serve. We plan to continue building on our global platform capabilities, enabling our clients to simplify and improve their global operations across cash, equity securities, and other asset classes.\n•\nWealth and Investment Management. \nWealth and investment management clients, including full-service, regional and independent broker-dealers, investment advisors, insurance companies, and retirement solutions providers are all undergoing unprecedented change. These firms are in need of partners to help them navigate the demographic shift of advisors and investors, create more engaging client experiences, and deliver operational technologies that are essential to their business. These market dynamics are driving the need for more seamlessly integrated technology, as well as data-centric digital wealth and investment management solutions that better service advisors and investors. This can be achieved by simplifying and modernizing their complicated and interwoven legacy systems. To address these demands, we have developed a holistic wealth management platform solution that provides seamless systems and data integration capabilities. Our platform enables firms to improve advisor productivity, provide a more personalized investor experience, and realize operational process efficiencies. Our acquisition of Kyndryl’s Securities Industry Services (“SIS”) business in 2024 has further bolstered our Wealth offerings in Canada by integrating advanced clearing and settlement, account record-keeping, and tax and regulatory reporting capabilities directly into our platform. Our solutions also reduce complexity and capitalize on emerging technology to simplify operations across the trade lifecycle for hedge fund, private asset, and complex asset managers and their asset servicers.\nAcross our growth themes, we continue to expand our global footprint, driving international growth through both strategic investments and organic initiatives. These efforts reinforce our commitment to delivering scalable solutions to a growing and diverse global client base.\nOn-ramp for next-generation technologies\nAcross financial services, the pace of change is only accelerating. Our clients understand that next-generation technology is a key driving force for change and efficiency and that there is a need among our client base to leverage this technology to address their critical business challenges. However, our clients face obstacles in making the necessary investments and, more importantly, in applying the right talent and intellectual capital, which may be focused on their most differentiating functions. This continues to create a differentiated ability for us to support our clients in the areas where we have scale and domain expertise, which includes areas such as AI, blockchain, cloud, digital, and other new technologies. By leveraging our services, firms can benefit from highly skilled, experienced personnel with deep industry expertise, while mutualizing the costs and risks of technology innovation. We approach innovation through three actions: experimenting, partnering, and engaging. In turn, we help our clients stay on the cutting edge and realize the benefits of digital transformation at a quicker pace.\nHigh engagement and client-centric culture\nBroadridge is client-centric and has created and grown multi-entity infrastructures across a variety of functions with high client satisfaction. We conduct a client satisfaction survey for each of our major business units annually, the results of which are a component of all our associates’ compensation because of the importance of client retention to the achievement of our revenue goals.\nWe have built a talent network of engaged and knowledgeable associates dedicated to serving clients well, which in turn creates a real and sustainable advantage for our business. Supporting excellent client delivery takes engaged associates, and we are passionate about creating an environment in which every associate can thrive and build their knowledge and skills. All of this creates a culture that benefits our associates, our clients, and our stockholders.\n10\nClients\nWe serve a large and diverse client base including banks, broker-dealers, mutual funds, retirement service providers, corporate issuers, and wealth and asset management firms. Our clients in the financial services industry include retail and institutional brokerage firms, global banks, mutual funds, asset managers, insurance companies, annuity companies, institutional investors, specialty trading firms, clearing firms, third-party administrators, hedge funds, and financial advisors. Our corporate issuer clients are typically publicly held companies. In addition to financial services firms, we service corporate clients in healthcare, insurance, consumer finance, telecommunications, utilities, and other service industries, supporting their essential communications. We embrace the concept of the Service-Profit Chain, which directly connects employee engagement, client satisfaction, and the creation of shareholder value. \nIn fiscal year 2025, we:    \n•\nmanaged proxy voting for over 900 million equity proxy positions;\n•\nprocessed over 7 billion investor and customer communications through print and digital channels;\n•\nprocessed on average over $15 trillion in equity and fixed income trades per day;\n•\nprovided fixed income trade processing services to 21 of the 25 primary dealers of fixed income securities in the U.S.; and\n•\nprovided services to the 15 largest U.S. wealth providers.\nCompetition\nWe operate in a highly competitive industry. Our Investor Communication Solutions business competes with companies that provide investor communication and corporate governance solutions, as well as our clients’ in-house operations. This includes independent proxy distribution service providers, transfer agents, proxy advisory firms, proxy solicitation firms, firms that process proxy votes, and financial printers. We also face competition from numerous firms in the compiling, printing and electronic distribution of statements, bills and other customer communications. Within our Global Technology and Operations business, our capital markets solutions compete with in-house operations as well as vendors that provide trade processing, back-office record keeping, and sell-side order and execution management systems. Similarly, our wealth management solutions compete with service providers that deliver data, technology solutions, and marketing services to be used by wealth advisors. Finally, our investment management solutions compete with firms that provide portfolio management, compliance, and operational support solutions for asset managers and hedge funds.\nTechnology\nWe provide products and platforms to the financial services industry and have several information processing systems that serve as the core foundation of our technology platform. We are committed to maintaining high levels of quality service through our skilled technical employees and the use of our technology within an environment that seeks continual improvement. \nOur technology strategy is designed to provide high levels of availability, scalability, reliability, and flexibility, leveraging a hybrid model consisting of private and public cloud services as well as traditional data center services. Our technology architecture consists of systems and applications which operate in data centers that employ multiple active power and cooling distribution paths and redundant components. Additionally, these data centers provide infrastructure capacity to permit planned activities without disruption to processing the critical load, and, as a general matter, are designed to sustain at least one worst-case, unplanned failure or event without a significant critical load impact. Our geographically dispersed processing centers also provide disaster recovery and business continuity processing capabilities. Our applications that incorporate cloud technology operate on industry standard enterprise architecture platforms providing significant opportunities for horizontal and vertical scaling. This scalability and redundancy enables us to provide high degrees of system availability for our clients. \nOur technology connects industry participants across the financial services ecosystem, forming a network that includes capital markets firms, broker-dealers, asset managers, public companies, and investors. The data derived through these connections provides value to participants and is at the heart of our approach – which leverages this data to generate insights that drive innovation, address industry-wide challenges, accelerate product development, and support decision making.\nWe conduct annual reviews with many of our clients of our cybersecurity and data security policies, practices and controls, which, together with our ongoing engagement with regulators across the world, helps us keep pace with cybersecurity and data security standards and support our product development and technology decisions. For more information on our information security program, please refer to “Item 1C. Cybersecurity” of this Annual Report on Form 10-K. \n11\nWe have integrated AI capabilities into several of our solutions and provide our associates with access to internal AI tools aimed at transforming our approach to the product development process and enhancing our overall productivity and efficiency. Our multi-pronged approach to AI looks to launch next-generation capabilities while protecting our clients’ and Broadridge’s data privacy and intellectual property.\nProduct Development\n \nWe manage a diverse portfolio of products and services across our core businesses. Our products and services are designed with resiliency, scalability, and flexibility so that we can fully meet our clients’ critical needs. These products and services are built to meet the many complex requirements of our clients in a highly efficient manner. \nOur product organization is committed to helping us grow, scale, and innovate.\n \nWe do so by providing our product managers with the tools, processes, and capabilities to promptly deliver solutions that address key client needs. This empowers product managers with the insights they need to make data-driven decisions and prioritize resources effectively. We further accelerate innovation by entering into strategic relationships with clients and other third parties to accelerate product development or gain access to capabilities complementary to our product development efforts. To cultivate the talent behind these products, we invest heavily in fostering a thriving community of highly skilled product associates. This commitment is reflected in our leadership development programs and ongoing training opportunities. \nWe are also focused on enterprise transformation with a focus on next-generation technologies. Our core strength lies in scalable, reusable platform components that empower developers and accelerate application delivery across the Company. This emphasis on unified product disciplines ensures business units have seamless access to top tier expertise. Furthermore, we leverage AI to unlock new commercial opportunities and enhance overall productivity. To fuel this continuous innovation, we are building a robust foundation with workload-centric hosting optimized for security, scalability, and efficiency. This standardized technology stack, powered by industry-leading enterprise tools, is fundamental to our strategy of delivering best-in-class solutions with improved speed.\nWe continually upgrade, enhance, and expand our existing products and services, taking into account input from clients, industry-wide initiatives and regulatory changes affecting our clients. By focusing on these key areas, we aim to meet the evolving needs of our clients through our product and service offerings.\nIntellectual Property\n \nWe own a portfolio of more than 170 U.S. and non-U.S. patents and patent applications. We also own registered marks for our trade name and own or have applied for trademark registrations for many of our services and products. We regard our products and services as proprietary and utilize internal security practices and confidentiality restrictions in contracts with employees, clients, and others for protection. We believe that we are the owner or in some cases, the licensee, of all intellectual property and other proprietary rights necessary to conduct our business. \nRegulation\nThe securities and financial services industries are subject to extensive regulation in the U.S. and in other jurisdictions. As a matter of public policy, regulatory bodies in the U.S. and the rest of the world are charged with safeguarding the integrity of the securities and other financial markets and with protecting the interests of investors participating in those markets. Due to the nature of our services and the markets we serve, these regulatory bodies impact our businesses in various manners.\nIn the U.S., the securities and financial services industries are subject to regulation under both federal and state laws. At the federal level, the SEC regulates the securities industry, along with the Financial Industry Regulatory Authority, Inc. (“FINRA”), the various stock exchanges, and other SROs. In addition, SEC rules require public companies to reimburse banks and broker-dealers for the expense of distributing certain stockholder communications to beneficial owners of securities held in street name, and those reimbursement rates, as well as fees that can be charged for proxy services are set by the NYSE. The Department of Labor (“DOL”) enforces the Employee Retirement Income Security Act of 1974 (“ERISA”) regulations on plan fiduciaries and organizations that provide services to qualified retirement plans. As a provider of services to financial institutions and issuers of securities, our services, such as our proxy and shareholder report processing and distribution services, are provided in a manner that assist our clients in complying with the laws and regulations to which they are subject. As a result, the services we provide may be required to change as applicable laws and regulations are adopted or revised. We monitor legislative and rulemaking activity by the SEC, FINRA, DOL, and the U.S. Internal Revenue Service (the “IRS”), the stock exchanges and other regulatory bodies that may impact our services. If new laws or regulations are adopted or changes are made to existing laws or regulations that may impact how we provide services or the requirements driving the use of our services, we expect to adapt our business practices and service offerings to continue to assist our clients in fulfilling their obligations under new or modified requirements.\n12\nCertain aspects of our business are subject to regulatory compliance or oversight. As a provider of technology services to financial institutions, certain aspects of our U.S. operations are subject to regulatory examination by the Federal Financial Institutions Examination Council (“FFIEC”), an interagency body of the Federal Deposit Insurance Corporation, the Office of the Comptroller of the Currency, the Board of Governors of the Federal Reserve System, the National Credit Union Administration, and the Consumer Financial Protection Bureau. Periodic examinations by the FFIEC generally include areas such as internal audit, risk management, business continuity planning, information security, systems development, and third-party vendor management to identify potential risks related to our services that could adversely affect our banking and financial services clients. \nIn addition, our business process outsourcing, mutual fund processing, and transfer agency solutions, as well as the entities providing those services, are subject to regulatory oversight. Our business process outsourcing and mutual fund processing services are performed by a broker-dealer, Broadridge Business Process Outsourcing, LLC (“BBPO”). BBPO is registered with the SEC, is a member of FINRA and is required to participate in the Securities Investor Protection Corporation (“SIPC”). Although BBPO’s FINRA membership agreement allows it to engage in clearing and the retailing of corporate securities in addition to mutual fund retailing on a wire order basis, BBPO does not clear customer transactions, process any retail business or carry customer accounts. BBPO is subject to regulations concerning many aspects of its business, including trade practices, capital requirements, record retention, money laundering prevention, the protection of customer funds and customer securities, and the supervision of the conduct of directors, officers, and employees. A failure to comply with any of these laws, rules or regulations could result in censure, fine, the issuance of cease-and-desist orders, or the suspension or revocation of SEC or FINRA authorization granted to allow the operation of its business or disqualification of its directors, officers, or employees. There has been continual regulatory scrutiny of the securities industry, including the outsourcing by firms of their operations or business functions. This oversight could result in the future enactment of more restrictive laws or rules with respect to business process outsourcing. As a registered broker-dealer and member of FINRA, BBPO is subject to the Uniform Net Capital Rule 15c3-1 of the Securities Exchange Act of 1934, as amended, which requires BBPO to maintain a minimum net capital amount.\nMatrix Trust Company (“Matrix Trust”) is a Colorado state chartered, non-depository trust company and National Securities Clearing Corporation trust member, whose primary business is to provide cash agent, custodial, and directed trustee services to institutional customers, and investment management services to its collective investment trust funds (“CITs”). As a result, Matrix Trust is subject to various regulatory capital requirements administered by the Colorado Division of Banking and the Arizona Department of Insurance and Financial Institutions, as well as the National Securities Clearing Corporation. Specific capital guidelines that involve quantitative measures of assets, liabilities, and certain off-balance sheet items, when applicable, must be met. In addition, in connection with the offering of CITs, Matrix Trust acts as a discretionary trustee and an ERISA fiduciary. CITs are subject to regulation by the IRS, SEC, federal and state banking regulators, and the DOL, which impose a number of duties on persons who are fiduciaries under ERISA. Matrix Trust is subject to regulation by the Colorado Division of Banking and the Arizona Department of Insurance and Financial Institutions which regulate CITs pursuant to guidance issued by the Office of the Comptroller of the Currency. Matrix Trust maintains an Identity Theft Prevention Program as required by the Red Flags Rule under the Fair Credit Reporting Act. \nOur transfer agency business, Broadridge Corporate Issuer Solutions, is subject to certain SEC rules and regulations, including regarding annual reporting, examination, internal controls, proper safeguarding of issuer and shareholder funds and securities, maintaining a written Identity Theft Prevention Program, and other obligations relating to its operations. Our transfer agency business is subject to certain NYSE requirements concerning operational standards as a transfer agent or registrar for NYSE-listed companies and is also subject to IRS regulations regarding tax reporting and withholding. In addition, Broadridge Corporate Issuer Solutions complies with all applicable trade control laws and regulations, including country/territory-based sanctions and list-based sanctions maintained by the U.S. and other jurisdictions where we do business. Finally, state laws govern certain services performed by our transfer agency business.\nCertain of our business units are required to comply with anti-money laundering (“AML”) laws and regulations in the U.S., such as the Bank Secrecy Act, as amended by the USA PATRIOT Act of 2001 (collectively, the “BSA”), and the BSA implementing regulations of the Financial Crimes Enforcement Network (“FinCEN”), a bureau of the U.S. Department of the Treasury. A variety of similar AML requirements apply in other countries. These business units are also subject to the relevant aspects of regulations and guidance published by FinCEN (as discussed below), which includes the Know Your Customer (“KYC”) requirements promulgated by FinCEN.\n13\nPrivacy and Information Security Regulations \nThe processing and transfer of personal information is required to provide certain of our services. Privacy laws and regulations in the U.S. and foreign countries apply to the access, collection, transfer, use, storage, and destruction of personal information. In the U.S., our financial institution clients are required to comply with privacy regulations imposed under the Gramm-Leach-Bliley Act (“GLBA”), in addition to other regulations. As a processor of personal information in our role as a provider of services to financial institutions, we comply with the Federal Trade Commission (“FTC”) Safeguards Rule implementing certain provisions of GLBA with respect to maintenance of information security safeguards.\nWe perform services for healthcare companies and are, therefore, subject to compliance with laws and regulations regarding healthcare information, including in the U.S., the Health Insurance Portability and Accountability Act of 1996 (“HIPAA”). We also perform credit-related services and agree to comply with payment card standards, including the Payment Card Industry Data Security Standard. In addition, federal and state privacy and information security laws, and consumer protection laws, which apply to businesses that collect or process personal information, also apply to our businesses.\nPrivacy laws and regulations may require notification to affected individuals, federal and state regulators, and consumer reporting agencies in the event of a security breach that results in unauthorized access to, or disclosure of, certain personal information. Privacy laws outside the U.S. may require different compliance requirements than U.S. laws and regulations, and may impose additional duties on us in the performance of our services.\nWe are subject to privacy laws and regulations such as the California Privacy Rights Act (“CPRA”) and the European Union’s General Data Protection Regulation (“GDPR”). The changing nature of privacy laws in the U.S., the European Union and elsewhere could impact our processing of personal information of our employees and on behalf of our clients.\nWe continually monitor privacy and information security laws and regulations and, while we believe that we are compliant with our regulatory responsibilities, information security threats continue to evolve, resulting in increased risk and exposure. In addition, legislation, regulation, litigation, court rulings, or other events regarding privacy and information security could expose Broadridge to increased costs, liability, and possible damage to our reputation.\nLegal Compliance \nRegulations issued by the Office of Foreign Assets Control (“OFAC”) of the U.S. Department of Treasury place prohibitions and restrictions on all U.S. citizens and entities, including us, with respect to transactions by U.S. persons with specified countries and individuals and entities identified on OFAC's sanctions lists and Specially Designated Nationals and Blocked Persons List, which is a published list of individuals and companies owned or controlled by, or acting for or on behalf of, countries subject to certain economic and trade sanctions, as well as terrorists, terrorist organizations and narcotics traffickers identified by OFAC under programs that are not country specific. Similar requirements apply to transactions and dealings with persons and entities specified in lists maintained in other countries. We have developed procedures and controls that are designed to monitor and address legal and regulatory requirements and developments to protect against having direct business dealings with such restricted and prohibited countries, individuals, or entities.\nCompliance with laws and regulations that are applicable to our businesses with an international reach\n \ncan be complex and may increase our cost of doing business in international jurisdictions. Our international business could expose us to fines and penalties if we fail to comply with these regulations. These laws and regulations include import and export requirements, trade restrictions and embargoes, data privacy requirements, labor laws, tax laws, anti-competition regulations, U.S. laws such as the Foreign Corrupt Practices Act, and local laws prohibiting bribery and other improper payments or inducements, such as the U.K. Bribery Act. Although we have implemented policies, procedures, and training designed to ensure compliance with applicable laws and regulations, there can be no assurance that our employees, contractors, vendors, and agents will not take actions in violation of our policies or applicable laws and regulations, particularly as we expand our operations, including through acquisitions of businesses that were not previously subject to and may not have familiarity with laws and regulations applicable to us or compliance policies similar to ours. Any violations of sanctions or export control regulations or other laws could subject us to civil or criminal penalties, including the imposition of substantial fines and interest or prohibitions on our ability to offer our products and services to one or more countries, and could also damage our reputation, our international expansion efforts and our business, and negatively impact our operating results.\nHuman Capital Management \nAs of June 30, 2025, we had approximately 15,000 full-time associates spanning 21 countries. None of our U.S. employees are represented by a labor union. In some countries outside the U.S., we have works councils, or we are required by local law to enter into and/or comply with industry-wide collective bargaining agreements. We believe that our employee relations are good.\n14\nWe are driven by the success of each of our associates, and we recognize that it is because of their hard work, talent, and commitment that we can continue to deliver outstanding results for our clients. That is why we strive to provide a workplace that fosters a collaborative and supportive culture where everyone feels welcomed, accepted, and empowered to be their best. At the center of our associate engagement efforts is the concept of the Service-Profit Chain, where engaged associates deliver world-class service, which creates satisfied clients and, in turn, produces strong, long-term value for stockholders.\nOur human capital strategies are developed and managed by our Chief Human Resources Officer, who reports to the Chief Executive Officer, and are overseen by the Company’s Board of Directors (the “Board”) and the Compensation Committee of the Board. Our Board believes that human capital management and succession planning are vital to our success. The Board annually reviews the Company’s leadership bench and succession planning. In addition, the Board receives regular updates on talent and other human capital matters. The Compensation Committee’s oversight includes initiatives and programs that concern our culture, talent, recruitment, retention, and associate engagement.\nAssociate Engagement\nWe believe there is a direct connection between associate engagement and the satisfaction of our clients and the creation of stockholder value so we regularly conduct surveys to assess associate engagement and determine if and how perspectives have changed over time. Our surveys allow our associates to share their views on our workplace, the importance of various aspects of work life balance, among other topics. The themes and insights from our associate feedback are shared with our executive leadership and have been instrumental in shaping our workplace. In fiscal year 2025, we received an 81% overall favorable rating in the annual Great Place to Work survey. In addition, 83% of our associates stated that Broadridge is a “great place to work,” and we have received certification from Great Place to Work for our outstanding workplace culture in 16 countries: U.S., Canada, India, the United Kingdom, Ireland, Romania, Poland, Singapore, Japan, Germany, Hong Kong, Sweden, Czechia, France, Australia and the Philippines.\n \nIn addition, we support several Associate Networks, where every associate at Broadridge has the opportunity to find peer support, shape company culture, receive mentorship from senior members, and develop their careers. While our Associate Networks each have a specific focus, membership is open to everyone at Broadridge.\nTalent and Development\nWe believe that our associates are among our most valuable assets and fostering their professional development is a core part of our organizational culture. To support this,\n \nwe provide our associates with an array of\n \nonline courses and both virtual and on-site training programs, known as Broadridge University. Our initiatives include career advancement programs from leading business schools, leadership development and mentoring opportunities, and\n \na tuition reimbursement plan. We also encourage participation in external learning opportunities and events. These resources are designed to provide opportunities for associates at varying levels to expand their networks, and to gain valuable skills and knowledge to excel in their current roles, and enhance their leadership capabilities. We offer our technology associates with resources to supplement their work experience, including our Technology Expert Career Track, a transparent dual career path that allows associates to grow as leaders and experts within our organization. We also empower associates to learn and grow as subject matter experts in areas related to our business, such as financial markets and AI. Our AI Academy offers voluntary learning paths and courses for our associates to establish a robust foundation in AI. In turn, this enables our associates to assist our clients with their expertise and adds value to our associates’ own career development and skill sets. In addition to career-oriented education, we also require all associates to complete a variety of trainings on an annual basis, which focus on our commitment to high ethical standards and a culture of honesty, integrity, and compliance.\nHealth, Safety and Wellness\nWe are committed to providing a safe workplace. We continuously strive to meet or exceed all laws, regulations, and accepted practices pertaining to workplace safety. We have developed extensive safety policies, standards, and procedures to which all associates are required to comply. Our policies are based on both U.S. Occupational Safety and Health Administration standards and site-specific guidelines to ensure that associates work in a safe and healthy environment. At our Edgewood, New York facility, we have an on-site Wellness Center staffed with physicians, nurse practitioners and physician assistants who provide medical services at no cost to our associates.\nIn addition, we are committed to providing competitive health and wellness benefits to our associates. We recognize the importance of work-life balance and have designed our workplace to provide associates with flexible on- and off-site work options. Our other health and wellness benefits include subsidized emergency backup care services for our U.S.-based associates, various educational health and wellness programs and webinars, and an employee assistance program, which provides free counseling and other mental health services.\n15\nAssociate Compensation and Benefits\nWe have demonstrated a history of investing in our workforce by offering competitive salaries and wages. We offer various types of compensation, which vary by associate role and country/region, and which may include annual bonuses, stock awards, and retirement savings plans. Also, a portion of every associate’s incentive compensation is tied to client satisfaction goals, which reinforces our commitment to the Service-Profit Chain and rewards associates for their contributions to Broadridge’s overall client satisfaction performance. In addition we offer the following benefits, which may vary by country/region: healthcare and insurance benefits, tax efficient or savings programs, such as health and dependent care flexible spending accounts, health savings account, pretax commuter benefits or green transport tax savings programs, paid time off, including volunteer time off, paid parental leave, and sick time off, life and disability insurance, business travel accident insurance, charitable gift matching, and tuition assistance, among others.\nAvailable Information\nOur headquarters are located at 5 Dakota Drive, Lake Success, New York 11042, and our telephone number is (516) 472-5400.\nWe maintain an Investor Relations website at www.broadridge-ir.com. We make available free of charge, on or through this website, our annual, quarterly and current reports, and any amendments to those reports as soon as reasonably practicable following the time they are electronically filed with or furnished to the SEC. To access these reports, just click on the “Financials” link found at the top of our Investor Relations page. You can also access our Investor Relations page at www.broadridge-ir.com. Information contained on our website is not incorporated by reference into this Annual Report on Form 10-K or any other report filed with or furnished to the SEC.\nIn addition, the SEC maintains a website (http://www.sec.gov) that contains reports, proxy and information statements, and other information regarding issuers that file electronically with the SEC.\n16",
  "item7": "ITEM 7.    Management’s Discussion and Analysis of Financial Condition and Results of Operations\nThis discussion summarizes the significant factors affecting the results of operations and financial condition of Broadridge during the fiscal years ended June 30, 2025 and 2024, and should be read in conjunction with our Consolidated Financial Statements and accompanying Notes thereto included elsewhere herein. Certain information contained in “Management’s Discussion and Analysis of Financial Condition and Results of Operations” are “forward-looking statements” within the meaning of the Private Securities Litigation Reform Act of 1995. Statements that are not historical in nature and which may be identified by the use of words such as “expects,” “assumes,” “projects,” “anticipates,” “estimates,” “we believe,” “could be,” “on track” and other words of similar meaning, are forward-looking statements. These statements are based on management’s expectations and assumptions and are subject to risks and uncertainties that may cause actual results to differ materially from those expressed. Our actual results, performance or achievements may differ materially from the results discussed in this Item 7. because of various factors, including those set forth elsewhere herein. See “Forward-Looking Statements” and “Risk Factors” included in Part 1 of this Annual Report on Form 10-K.\nThe discussion summarizing the significant factors affecting the results of operations and financial condition of Broadridge during the fiscal year ended June 30, 2024 can be found in Part II, “Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations” of our Annual Report on Form 10-K for the fiscal year 2024 (the “2024 Annual Report”), which was filed with the Securities and Exchange Commission on August 6, 2024.\nDESCRIPTION OF THE COMPANY AND BUSINESS SEGMENTS\nBroadridge, a Delaware corporation, is a global financial technology leader providing investor communications and technology-driven solutions to banks, broker-dealers, asset and wealth managers, public companies, investors, and mutual funds. Our services include investor communications, securities processing, data and analytics, and customer communications solutions. With over 60 years of experience, including over 15 years as an independent public company, we provide integrated solutions and an important infrastructure that powers the financial services industry. Our solutions enable better financial lives by powering investing, governance and communications and help reduce the need for our clients to make significant capital investments in operations infrastructure, thereby allowing them to increase their focus on core business activities. Our businesses operate in two reportable segments: Investor Communication Solutions (“ICS”) and Global Technology and Operations (“GTO”). \nACQUISITIONS\nWe frequently review our businesses to ensure we have the necessary assets to execute our strategy. We expect to acquire businesses when we identify a compelling strategic need, such as a product, service or technology that helps meet client demand, a way to achieve business scale that enables competition and operational efficiency, or similar considerations. The results of operations for acquired businesses are included in our consolidated results from the respective dates of acquisition.\nAcquisitions of Businesses\nIn November 2024, the Company acquired SIS to provide wealth management, capital markets, and information technology solutions in Canada.\n \nSIS is included in the Company’s GTO reportable segment. Our discussions with the Canadian Competition Bureau are ongoing. In July 2024, the Company acquired CompSci, a provider of cloud-based financial technology software for the preparation and processing of SEC filings for public companies and funds. CompSci is included in the Company’s ICS reportable segment. We acquired these businesses for an aggregate purchase price of $193.5 million.\nAnnounced Acquisition\nIn July 2025, Broadridge announced the proposed acquisition of Acolin Group Holdco Limited (“Acolin”). Acolin is a European provider of cross-border fund distribution and regulatory services. The total purchase price is approximately $70 million plus an additional contingent consideration liability. The acquisition is expected to close in the first half of Broadridge’s 2026 fiscal year, subject to customary closing conditions, including regulatory approvals. Acolin will be included in the Company’s ICS reportable segment. \nPlease refer to Note 6, “Acquisitions” to our Consolidated Financial Statements under Item 8. of Part II of this Annual Report on Form 10-K for a more detailed discussion.\n30\nBASIS OF PRESENTATION\nThe Consolidated Financial Statements have been prepared in accordance with U.S. generally accepted accounting principles (“GAAP”) and in accordance with the SEC requirements for Annual Reports on Form 10-K. These financial statements present the consolidated position of the Company and include the entities in which the Company directly or indirectly has a controlling financial interest as well as various entities in which the Company has investments recorded under the equity method of accounting as well as certain marketable and non-marketable securities. Intercompany balances and transactions have been eliminated. Amounts presented may not sum due to rounding. Certain prior period amounts have been reclassified to conform to the current year presentation where applicable.\nIn presenting the Consolidated Financial Statements, management makes estimates and assumptions that affect the amounts reported and related disclosures. Management continually evaluates the accounting policies and estimates used to prepare the Consolidated Financial Statements. The estimates, by their nature, are based on judgment, available information, and historical experience and are believed to be reasonable. However, actual amounts and results could differ from those estimates made by management. In management’s opinion, the Consolidated Financial Statements contain all normal recurring adjustments necessary for a fair presentation of results reported. The results of operations reported for the periods presented are not necessarily indicative of the results of operations for subsequent periods.\nSeasonality\nProcessing and distributing proxy materials and annual reports to investors comprises a large portion of our Investor Communication Solutions business. We process and distribute the greatest number of proxy materials and annual reports during our third and fourth fiscal quarters. The recurring periodic activity of this business is linked to significant filing deadlines imposed by law on public reporting companies. This has caused our revenues, operating income, net earnings, and cash flows from operating activities to be higher in our third and fourth fiscal quarters. The seasonality of our revenues makes it difficult to estimate future operating results based on the results of any specific fiscal quarter and could affect an investor’s ability to compare our financial condition, results of operations, and cash flows on a fiscal quarter-by-quarter basis.\nCRITICAL ACCOUNTING ESTIMATES    \nWe continually evaluate the accounting policies and estimates used to prepare the Consolidated Financial Statements. The estimates, by their nature, are based on judgment, available information, and historical experience and are believed to be reasonable. However, actual amounts and results could differ from these estimates made by management. Certain accounting policies that require significant management estimates and are deemed critical to our results of operations or financial position are discussed below.\nGoodwill\n.\n We review the carrying value of all our Goodwill by comparing the carrying value of our reporting units to their fair values. We are required to perform this comparison at least annually or more frequently if circumstances indicate a possible impairment. When determining fair value of a reporting unit, we utilize the income approach which considers a discounted future cash flow analysis using various assumptions, including projections of revenues based on assumed long-term growth rates, estimated costs and appropriate discount rates based on the particular reporting unit’s weighted-average cost of capital. The principal factors used in the discounted cash flow analysis requiring judgment are the projected future operating cash flows based on forecasted earnings before interest and taxes, and the selection of the terminal value growth rate and discount rate assumptions. The weighted-average cost of capital takes into account the relative weight of each component of our consolidated capital structure (equity and long-term debt). Our estimates of long-term growth and costs are based on historical data, various internal estimates and a variety of external sources, and are developed as part of our routine, long-range planning process. Changes in economic and operating conditions impacting these assumptions could result in goodwill impairments in future periods. If the carrying amount of the reporting unit exceeds its fair value, an impairment loss shall be recognized in an amount equal to that excess, not to exceed the total amount of Goodwill allocated to that reporting unit. We had $3,609.6 million of Goodwill as of June 30, 2025. Given the significance of our Goodwill, an adverse change to the fair value of one of our reporting units could result in an impairment charge, which could be material to our earnings.\nThe Company performs a sensitivity analysis under the goodwill impairment test assuming hypothetical reductions in the fair values of our reporting units. A 10% change in our estimates of projected future operating cash flows, discount rates, or terminal value growth rates used in our calculations of the fair values of the reporting units would not result in an impairment of our Goodwill. \n31\nIncome Taxes\n.\n The objectives of accounting for income taxes are to recognize the amount of taxes payable or refundable for the current year and deferred tax liabilities and assets for the future tax consequences of events that have been recognized in an entity’s financial statements or tax returns. Judgment is required in addressing the future tax consequences of events that have been recognized in our Consolidated Financial Statements or tax returns (e.g., realization of deferred tax assets, changes in tax laws or interpretations thereof). The Company is subject to regular examination of its income tax returns by the U.S. federal, state and foreign tax authorities. A change in the assessment of the outcomes of such matters could materially impact our Consolidated Financial Statements. The Company has estimated foreign net operating loss carryforwards of approximately $48.7 million as of June 30, 2025 of which $6.9 million are subject to expiration in the June 30, 2035 through June 30, 2043 period, and of which $41.7 million has an indefinite utilization period. In addition, the Company has estimated U.S. federal net operating loss carryforwards of approximately $25.0 million of which $9.3 million are subject to expiration in the June 30, 2026 through June 30, 2037 period with the balance of $15.7 million having an indefinite utilization period. U.S. federal net operating loss carryforwards resulting from tax losses beginning with the fiscal year ended June 30, 2019 have an indefinite carryforward under the U.S. Tax Cuts and Jobs Act (the “Tax Act”). The Company did not generate federal net operating losses for the fiscal year ended June 30, 2025. \nValuation allowances are recognized to reduce deferred tax assets when it is more likely than not that the Company will not be able to utilize the deferred tax assets of certain subsidiaries to offset future taxable earnings. The Company has recorded valuation allowances of $11.2 million and $10.8 million at June 30, 2025 and 2024, respectively. The determination as to whether a deferred tax asset will be recognized is made on a jurisdictional basis and is based on the evaluation of historical taxable income or loss, projected future taxable income, carryforward periods, scheduled reversals of deferred tax liabilities and tax planning strategies. Projected future taxable income is based on expected results and assumptions as to the jurisdiction in which the income will be earned. The assumptions used to project future taxable income requires significant judgment and are consistent with the plans and estimates used to manage the underlying businesses.\nShare-based Payments\n.\n Accounting for stock-based compensation requires the measurement of stock-based compensation expense based on the fair value of the award on the date of grant. We determine the fair value of stock options issued by using a binomial option-pricing model. The binomial option-pricing model considers a range of assumptions related to volatility, dividend yield, risk-free interest rate and employee exercise behavior. Expected volatilities utilized in the binomial option-pricing model are based on a combination of implied market volatilities, historical volatility of our stock price and other factors. Similarly, the dividend yield is based on historical experience and expected future changes. The risk-free rate is derived from the U.S. Treasury yield curve in effect at the time of grant. The binomial option-pricing model also incorporates exercise and forfeiture assumptions based on an analysis of historical data. The expected life of the stock option grants is derived from the output of the binomial model and represents the period of time that options granted are expected to be outstanding. Determining these assumptions are subjective and complex, and therefore, a change in the assumptions utilized could impact the calculation of the fair value of our stock options. A hypothetical change of five percentage points applied to the volatility assumption used to determine the fair value of the fiscal year 2025 stock option grants would result in an approximate $2.8 million change in total pre-tax stock-based compensation expense for the fiscal year 2025 grants, which would be amortized over the vesting period. A hypothetical change of one year in the expected life assumption used to determine the fair value of the fiscal year 2025 stock option grants would result in an approximate $1.9 million change in the total pre-tax stock-based compensation expense for the fiscal year 2025 grants, which would be amortized over the vesting period. A hypothetical change of one percentage point in the forfeiture rate assumption used for the fiscal year 2025 stock option grants would result in an approximate $0.2 million change in the total pre-tax stock-based compensation expense for the fiscal year 2025 grants, which would be amortized over the vesting period. A hypothetical one-half percentage point change in the dividend yield assumption used to determine the fair value of the fiscal year 2025 stock option grants would result in an approximate $1.4 million change in the total pre-tax stock-based compensation expense for the fiscal year 2025 grants, which would be amortized over the vesting period.\n32\nKEY PERFORMANCE INDICATORS\nManagement focuses on a variety of key indicators to plan, measure and evaluate the Company’s business and financial performance. These performance indicators include Revenue and Recurring revenue as well as not generally accepted accounting principles measures (“Non-GAAP”) of Adjusted Operating income, Adjusted Net earnings, Adjusted earnings per share, Free Cash flow, Recurring revenue growth constant currency, and Closed sales. In addition, management focuses on select operating metrics specific to Broadridge of Position Growth and Internal Trade Growth, as defined below.\nRefer to the section “Explanation and Reconciliation of the Company’s Use of Non-GAAP Financial Measures” for a reconciliation of Adjusted Operating income, Adjusted Net earnings, Adjusted earnings per share, Free Cash flow, and Recurring revenue growth constant currency to the most directly comparable GAAP measures, and an explanation for why these Non-GAAP metrics provide useful information to investors and how management uses these Non-GAAP metrics for operational and financial decision-making. Refer to the section “Results of Operations” for a description of Closed sales and an explanation of why Closed sales is a useful performance metric for management and investors.\nRevenues\nRevenues are primarily generated from fees for processing and distributing investor communications and fees for technology-enabled services and solutions. The Company monitors revenue in each of our two reportable segments as a key measure of success in addressing our clients’ needs. Revenues from fees are derived from both recurring and event-driven activity. The level of recurring and event-driven activity the Company processes directly impacts distribution revenues. While event-driven activity is highly repeatable, it may not recur on an annual basis. Event-driven revenues are based on the number of special events and corporate transactions the Company processes. Event-driven activity is impacted by financial market conditions and changes in regulatory compliance requirements, resulting in fluctuations in the timing and levels of event-driven revenues. Distribution revenues primarily include revenues related to the physical mailing of proxy materials, interim communications, transaction reporting, customer communications and fulfillment services as well as Broadridge Retirement and Workplace administrative services.\nRecurring revenue growth represents the Company’s total annual revenue growth, less growth from event-driven and distribution revenues. We distinguish recurring revenue growth between organic and acquired:\n•\nOrganic – We define organic revenue as the recurring revenue generated from Net New Business and Internal Growth.\n•\nAcquired – We define acquired revenue as the recurring revenue generated from acquired services in the first twelve months following the date of acquisition. This type of growth comes as a result of our strategy to purchase, integrate, and leverage the value of assets we acquire. \nRevenues and Recurring revenue are useful metrics for investors in understanding how management measures and evaluates the Company’s ongoing operational performance. See “Results of Operations” as well as Note 2, “Summary of Significant Accounting Policies” and Note 3, “Revenue Recognition” to our Consolidated Financial Statements under Item 8. of Part II of this Annual Report on Form 10-K.\nPosition Growth and Internal Trade Growth\nThe Company uses select operating metrics specific to Broadridge of Position Growth and Internal Trade Growth in evaluating its business results and identifying trends affecting its business. Position Growth is comprised of “equity position growth” and “mutual fund/ETF position growth.” Equity position growth measures the estimated annual change in positions eligible for equity proxy materials. Beginning in the fourth quarter of fiscal year 2025, the Company began presenting information on “equity revenue position growth.”  Equity revenue position growth excludes small or fractional equity positions for which the Company does not recognize revenue (“non-revenue positions”). Prior period comparative information for this metric is not available. Mutual fund/ETF position growth measures the estimated change in mutual fund and exchange traded fund positions eligible for interim communications. These metrics are calculated from equity proxy and mutual fund/ETF position data reported to Broadridge for the same issuers or funds in both the current and prior year periods.  \nInternal Trade Growth represents the estimated change in daily average trade volumes for Broadridge securities processing clients whose contracts are linked to trade volumes and who were on Broadridge’s trading platforms in both the current and prior year periods. Position Growth and Internal Trade Growth are useful non-financial metrics for investors in understanding how management measures and evaluates Broadridge’s ongoing operational performance within its Investor Communication Solutions and Global Technology and Operations reportable segments, respectively.\n33\nThe key performance indicators for the fiscal years ended June 30, 2025, and 2024, are as follows:\nSelect Operating Metrics\nYears Ended June 30,\n2025\n2024\nPosition Growth\n   Equity positions\n16 \n%\n6 \n%\n   Equity revenue positions\n12 \n%\nN/A\n   Mutual fund / ETF positions\n7 \n%\n3 \n%\nInternal Trade Growth\n13 \n%\n13 \n%\nRESULTS OF OPERATIONS\nThe following discussions of Analysis of Consolidated Statements of Earnings and Analysis of Reportable Segments refer to the fiscal year ended June 30, 2025 compared to the fiscal year ended June 30, 2024. The Analysis of Consolidated Statements of Earnings should be read in conjunction with the Analysis of Reportable Segments, which provides a more detailed discussion concerning certain components of the Consolidated Statements of Earnings. Discussions of Analysis of Consolidated Statements of Earnings and Analysis of Reportable Segments for the fiscal year ended June 30, 2024 compared to the fiscal year ended June 30, 2023 is disclosed in Part II, “Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations” of the 2024 Annual Report.\nThe following references are utilized in the discussions of Analysis of Consolidated Statements of Earnings and Analysis of Reportable Segments:\n“Amortization of Acquired Intangibles and Purchased Intellectual Property” and “Acquisition and Integration Costs” represent certain non-cash amortization expenses associated with acquired intangible assets and purchased intellectual property assets, as well as certain transaction and integration costs associated with the Company’s acquisition activities, respectively.\n“Restructuring and Other Related Costs” represent costs associated with the Company’s Corporate Restructuring Initiative to exit and/or realign some of our businesses, streamline the Company’s management structure, reallocate work to lower cost locations, and reduce headcount in deprioritized areas, in addition to other restructuring activities.\n“Litigation Settlement Charges” represents reserves established during the third and fourth quarter of 2024 related to the settlement of claims.\n“Net New Business” refers to recurring revenue from Closed sales for the initial twelve-month contract period after which the client goes live with the Company’s service(s), less recurring revenue from client losses. \n“Internal Growth” is a component of recurring revenue and generally reflects year over year changes in existing services to our existing customers’ multi-year contracts beyond the initial twelve-month period in which it was included in Net New Business.\n“Recurring revenue growth constant currency” refers to our Recurring revenue growth presented on a constant currency basis to exclude the impact of foreign currency exchange fluctuations.\nThe following definitions describe the Company’s Revenues:\nRevenues in the Investor Communication Solutions segment are derived from both recurring and event-driven activity, in addition to distribution revenues. The level of recurring and event-driven activity we process directly impacts revenues. While event-driven activity is highly repeatable, it may not recur on an annual basis. The types of services we provide that comprise event-driven activity are:\n•\nMutual Fund Proxy: The proxy and related services we provide to mutual funds when certain events occur requiring a shareholder vote including changes in directors, sub-advisors, fee structures, investment restrictions, and mergers of funds.\n34\n•\nMutual Fund Communications: Mutual fund communications services consist primarily of the distribution on behalf of mutual funds of supplemental information required to be provided to the annual mutual fund prospectus as a result of certain triggering events such as a change in portfolio managers. In addition, mutual fund communications consist of notices and marketing materials such as newsletters.\n•\nEquity Proxy Contests and Specials, Corporate Actions, and Other: The proxy services we provide in connection with shareholder meetings driven by special events such as proxy contests, mergers and acquisitions, and tender/exchange offers.\nEvent-driven revenues are based on the number of special events and corporate transactions we process. Event-driven activity is impacted by financial market conditions and changes in regulatory compliance requirements, resulting in fluctuations in the timing and levels of event-driven revenues. As such, the timing and level of event-driven activity and its potential impact on revenues and earnings are difficult to forecast. \nGenerally, mutual fund proxy activity has been subject to a greater level of volatility than the other components of event-driven activity. During fiscal year 2025, mutual fund proxy revenues were 75% higher than the prior fiscal year. During fiscal year 2024, mutual fund proxy revenues were 66% higher than the prior fiscal year. Although it is difficult to forecast the levels of event-driven activity, we expect that the portion of revenues derived from mutual fund proxy activity may continue to experience volatility in the future.\nDistribution revenues primarily include revenues related to the physical mailing of proxy materials, interim communications, transaction reporting, customer communications and fulfillment services, as well as Broadridge Retirement and Workplace administrative services.\nDistribution cost of revenues consists primarily of postage-related expenses incurred in connection with our Investor Communication Solutions segment, as well as Broadridge Retirement and Workplace administrative services expenses. These costs are reflected in Cost of revenues.\nClosed sales represent an estimate of the expected annual recurring revenue for new client contracts that were signed by Broadridge in the current reporting period. Closed sales does not include event-driven or distribution activity. We consider contract terms, expected client volumes or activity, knowledge of the marketplace and experience with our clients, among other factors, when determining the estimate. Management uses Closed sales to measure the effectiveness of our sales and marketing programs, as an indicator of expected future revenues and as a performance metric in determining incentive compensation. \nClosed sales is not a measure of financial performance under GAAP, and should not be considered in isolation or as a substitute for revenue or other income statement data prepared in accordance with GAAP. Closed sales is a useful metric for investors in understanding how management measures and evaluates our ongoing operational performance.\nThe inherent variability of transaction volumes and activity levels can result in some variability of amounts reported as actual achieved Closed sales. Larger Closed sales can take up to 12 to 24 months or longer to convert to revenues, particularly for the services provided by our Global Technology and Operations segment. For the fiscal years ended June 30, 2025 and June 30, 2024, we reported Closed sales net of a 5.0% allowance adjustment. Consequently, our reported Closed sales amounts will not be adjusted for actual revenues achieved because these adjustments are estimated in the period the sale is reported. We assess this allowance amount at the end of each fiscal year to establish the appropriate allowance for the subsequent year using the trailing five years actual data as the starting point, normalized for outlying factors, if any, to enhance the accuracy of the allowance.\nFor the fiscal years ended June 30, 2025 and 2024, Closed sales were $287.9 million and $341.8 million, respectively. The fiscal years ended June 30, 2025 and 2024, are net of an allowance adjustment of $15.2 million and $18.0 million, respectively.\n35\nANALYSIS OF CONSOLIDATED STATEMENTS OF EARNINGS\nFiscal Year 2025 Compared to Fiscal Year 2024 \nThe table below presents Consolidated Statements of Earnings data for the fiscal years ended June 30, 2025 and 2024, and the dollar and percentage changes between periods:\n \nYears Ended June 30,\n \n2025\n2024\nChange\n \n($)    \n(%)    \n \n(in millions, except for per share amounts)\nRevenues\n$\n6,889.1\n$\n6,506.8\n$\n382.3 \n6 \n  \nCost of revenues\n4,752.3\n4,572.9\n179.5 \n4 \n  \nSelling, general and administrative expenses\n948.2\n916.8\n31.4 \n3 \n  \n       Total operating expenses\n5,700.6\n5,489.7\n210.9 \n4 \nOperating income\n1,188.6\n1,017.1\n171.4 \n17 \nMargin\n17.3\n%\n15.6\n%\n1.7 \npts\nInterest expense, net\n(122.7)\n(138.1)\n15.4 \n(11)\nOther non-operating expenses, net\n(7.1)\n(1.7)\n(5.5)\n318 \nEarnings before income taxes\n1,058.7\n877.4\n181.4 \n21 \n  \nProvision for income taxes\n219.2\n179.3\n40.0 \n22 \n  \nEffective tax rate\n20.7\n%\n20.4\n%\n0.3 \npts\nNet earnings\n$\n839.5\n$\n698.1\n$\n141.4 \n20 \n  \nBasic earnings per share\n$\n7.17\n$\n5.93\n$\n1.24 \n21 \n  \nDiluted earnings per share\n$\n7.10\n$\n5.86\n$\n1.24 \n21 \n  \nWeighted average shares outstanding:\n       Basic\n117.1\n117.7\n       Diluted\n118.3\n119.1\nRevenues\nThe table below presents Consolidated Statements of Earnings data for the fiscal years ended June 30, 2025 and 2024, and the dollar and percentage changes between periods:\n \nYears Ended June 30,\n2025\n2024\nChange\n \n$\n%\n \n($ in millions)\nRecurring revenues\n$\n4,507.9 \n$\n4,222.6 \n$\n285.4 \n7\nEvent-driven revenues\n319.3 \n285.2 \n34.0 \n12\nDistribution revenues\n2,062.0 \n1,999.0 \n63.0 \n3\n       Total\n$\n6,889.1 \n$\n6,506.8 \n$\n382.3 \n6\nPoints of Growth\nNet New Business\nInternal Growth\nAcquisitions\nForeign Exchange\nTotal\nRecurring revenue Growth Drivers\n3pts\n2pts\n2pts\n0pts\n7\n%\nRevenues increased $382.3 million, or 6%, to $6,889.1 million from $6,506.8 million.\n•\nRecurring revenues increased $285.4 million, or 7%, to $4,507.9 million. Recurring revenue growth constant currency (Non-GAAP) was 7%, driven primarily by organic growth in ICS and GTO and acquisitions in GTO.  \n36\n•\nEvent-driven revenues increased $34.0 million, or 12%, driven by a higher volume of mutual fund communications partially offset by a lower level of equity proxy contest activity.\n \n•\nDistribution revenues increased $63.0 million, or 3%, driven by the postage rate increase of approximately \n$114 million partially offset by lower mail volumes\n.\nTotal operating expenses. \nOperating expenses increased $210.9 million, or 4%, to $5,700.6 million from $5,489.7 million:\n•\nCost of revenues - The increase of $179.5 million primarily reflects higher expenses related to the SIS acquisition, the impact of higher postage and distribution costs in our ICS segment of approximately $58 million, and higher expenses related to higher revenues.\n•\nSelling, general and administrative expenses - The increase of $31.4 million was primarily driven by higher technology-related investments.\nInterest expense, net. \nInterest expense, net, was $122.7 million, a decrease of $15.4 million, or 11%, from $138.1 million in the fiscal year ended June 30, 2024. The decrease was primarily due to lower average borrowings rates.\nOther non-operating expenses, net. \nOther non-operating expenses, net for the fiscal year ended June 30, 2025 was $7.1 million, compared to $1.7 million for the fiscal year ended June 30, 2024. \nProvision for income taxes\n. \n•\nEffective tax rate for the fiscal year ended June 30, 2025 - 20.7%.\n•\nEffective tax rate for the fiscal year ended June 30, 2024 - 20.4%.\nThe increase in the effective tax rate for the fiscal year ended June 30, 2025 compared to the fiscal year ended June 30, 2024 was primarily driven by an increase in pre-tax income and lower tax benefits from statutory tax incentives, which was partially offset by an increase in discrete tax benefits.\nANALYSIS OF REPORTABLE SEGMENTS\nBroadridge has two reportable segments: (1) Investor Communication Solutions and (2) Global Technology and Operations. \nThe primary components of “Corporate and Other” are certain gains, losses, centrally managed activities, and non-operating expenses that have not been allocated to the reportable segments, such as interest expense. \nCertain corporate expenses, as well as certain centrally managed expenses, are allocated based upon budgeted amounts in a reasonable manner. Because the Company compensates the management of its various businesses on, among other factors, segment profit, the Company may elect to record certain segment-related operating and non-operating expense items in Corporate and Other rather than reflect such items in segment profit.\nRevenues\n \nYears Ended June 30,\n2025\n2024\nChange\n$\n%\n \n ($ in millions)\nInvestor Communication Solutions\n$\n5,113.0 \n$\n4,857.9 \n$\n255.1 \n5 \nGlobal Technology and Operations\n1,776.1 \n1,648.9 \n127.2 \n8 \n      Total\n$\n6,889.1 \n$\n6,506.8 \n$\n382.3 \n6 \n \n37\nEarnings Before Income Taxes\n \nYears Ended June 30,\n2025\n2024\nChange\n$\n%\n \n ($ in millions)\nInvestor Communication Solutions\n$\n1,054.0 \n$\n950.4 \n$\n103.7 \n11 \nGlobal Technology and Operations\n201.4 \n173.3 \n28.0 \n16 \nCorporate and Other\n(196.7)\n(246.3)\n49.7 \n(20)\n      Total\n$\n1,058.7 \n$\n877.4 \n$\n181.4 \n21 \nThe amount of amortization of acquired intangibles and purchased intellectual property by segment is as follows:\n \nYears Ended June 30,\n2025\n2024\nChange\n$\n%\n \n ($ in millions)\nInvestor Communication Solutions\n$\n42.9 \n$\n45.4 \n$\n(2.5)\n(6)\nGlobal Technology and Operations\n153.7 \n154.9 \n(1.2)\n(1)\n      Total\n$\n196.6 \n$\n200.3 \n$\n(3.6)\n(2)\nInvestor Communication Solutions\nFiscal Year 2025 Compared to Fiscal Year 2024 \nRevenues increased $255.1 million to $5,113.0 million from $4,857.9 million, and earnings before income taxes increased $103.7 million to $1,054.0 million from $950.4 million.\n \nYears Ended June 30,\n2025\n2024\nChange\n$\n%\n ($ in millions)\nRevenues\nRecurring revenues\n$\n2,731.8 \n$\n2,573.6 \n$\n158.2 \n6 \nEvent-driven revenues\n319.3 \n285.2 \n34.0 \n12 \nDistribution revenues\n2,062.0 \n1,999.0 \n63.0 \n3 \n       Total\n$\n5,113.0 \n$\n4,857.9 \n$\n255.1 \n5 \nEarnings before Income Taxes\nEarnings before income taxes\n$\n1,054.0 \n$\n950.4 \n$\n103.7 \n11 \nPre-tax Margin\n20.6\n%\n19.6\n%\nPoints of Growth\nNet New Business\nInternal Growth\nAcquisitions\nForeign Exchange\nTotal\nRecurring revenue Growth Drivers\n5pts\n1pt\n0pts\n0pts\n6\n%\nFor the fiscal year ended June 30, 2025:\n•\nRecurring revenues increased $158.2 million, or 6%, to $2,731.8 million. Recurring revenue growth constant currency (Non-GAAP) was 6%, driven by Net New Business and Internal Growth.\n \n38\n•\nBy product line, Recurring revenue growth and Recurring revenue growth constant currency (Non-GAAP) were as follows:\n◦\nRegulatory rose 7% and 7%, respectively, driven by equity position growth of 16% and mutual fund/ETF position growth of 7%.\n◦\nData-Driven Fund Solutions rose 6% and 5%, respectively, driven primarily by growth in our global distribution insights and retirement and workplace products.\n◦\nIssuer rose 5% and 5%, respectively, driven by growth in shareholder engagement solutions and disclosure solutions products.\n◦\nCustomer Communications rose 5% and 5%, respectively, driven by growth in digital communications and print revenues. \n•\nEvent-driven revenues increased $34.0 million, or 12% driven by a higher volume of mutual fund communications partially offset by a lower level of equity proxy contest activity.\n \n•\nDistribution revenues increased $63.0 million, or 3%, driven by the postage rate increase of approximately $114 \nmillion partially offset by lower mail volumes\n.\n•\nEarnings before income taxes increased $103.7 million, or 11%, primarily from higher Recurring and Event-driven revenues. Operating expenses rose 4%, or $151.5 million, to $4,059.0 million driven by the impact of the postage rate increase and higher volume related expenses. \n•\nPre-tax margins increased by 1.0 percentage points to 20.6% from 19.6%. \nGlobal Technology and Operations\nFiscal Year 2025 Compared to Fiscal Year 2024 \nRevenues increased $127.2 million to $1,776.1 million from $1,648.9 million, and earnings before income taxes increased $28.0 million to $201.4 million from $173.3 million.\n \nYears Ended June 30,\n2025\n2024\nChange\n$\n%\n \n ($ in millions)\nRevenues\nRecurring revenues\n$\n1,776.1 \n$\n1,648.9 \n$\n127.2 \n8 \nEarnings before Income Taxes\nEarnings before income taxes\n$\n201.4 \n$\n173.3 \n$\n28.0 \n16 \nPre-tax Margin\n11.3\n%\n10.5\n%\nPoints of Growth\nNet New Business\nInternal Growth\nAcquisitions\nForeign Exchange\nTotal\nRecurring revenue Growth Drivers\n1pt\n3pts\n4pts\n-1pt\n8\n%\nFor the fiscal year ended June 30, 2025:\n•\nRecurring revenues increased $127.2 million, or 8%, to $1,776.1 million.\n \nRecurring revenue growth constant currency (Non-GAAP) was 8%, driven by 4pts of organic growth and 4pts from the acquisition of SIS. \n•\nBy product line, Recurring revenue growth and Recurring revenue growth constant currency (Non-GAAP) were as follows: \n39\n◦\nCapital markets rose 6% and 6%, respectively, driven by revenue from new sales and Internal Growth. Internal Growth benefited from higher trading volumes.\n◦\nWealth and investment management rose 10% and 12%, respectively, driven by 10pts from the SIS acquisition and 1pt of Organic growth. Organic growth was negatively impacted by 4pts as a result of the loss of a large client during the prior year period.\n•\nEarnings before income taxes increased $28.0 million, as higher revenues more than offset higher expenses, including the impact of the SIS acquisition. \n•\nPre-tax margins increased by 0.8 percentage points to 11.3% from 10.5%.\nCorporate and Other\nLoss before income taxes was $196.7 million for the fiscal year ended June 30, 2025, a decrease of $49.7 million, or 20%, compared to $246.3 million for the fiscal year ended June 30, 2024. The decreased loss before income taxes was due to lower Restructuring and Other Related Costs, a decline in litigation expense of $18.4 million, and a decline in Interest expense, net of $15.4 million.\nExplanation and Reconciliation of the Company’s Use of Non-GAAP Financial Measures \nThe Company’s results in this Annual Report on Form 10-K are presented in accordance with U.S. GAAP except where otherwise noted. In certain circumstances, Non-GAAP results have been presented. These Non-GAAP measures are Adjusted Operating income, Adjusted Operating income margin, Adjusted Net earnings, Adjusted earnings per share, Free cash flow, and Recurring revenue growth constant currency. These Non-GAAP financial measures should be viewed in addition to, and not as a substitute for, the Company’s reported results.\nThe Company believes our Non-GAAP financial measures help investors understand how management plans, measures and evaluates the Company’s business performance. Management believes that Non-GAAP measures provide consistency in its financial reporting and facilitates investors’ understanding of the Company’s operating results and trends by providing an additional basis for comparison. Management uses these Non-GAAP financial measures to, among other things, evaluate our ongoing operations and for internal planning and forecasting purposes. In addition, and as a consequence of the importance of these Non-GAAP financial measures in managing our business, the Company’s Compensation Committee of the Board incorporates Non-GAAP financial measures in the evaluation process for determining management compensation.\nAdjusted Operating Income, Adjusted Operating Income Margin, Adjusted Net Earnings and Adjusted Earnings Per Share\nThese Non-GAAP measures reflect Operating income, Operating income margin, Net earnings, and Diluted earnings per share, as adjusted to exclude the impact of certain costs, expenses, gains and losses and other specified items, the exclusion of which management believes provides insight regarding our ongoing operating performance. Depending on the period presented, these adjusted measures exclude the impact of certain of the following items: \n(i) Amortization of Acquired Intangibles and Purchased Intellectual Property, which represent non-cash amortization expenses associated with the Company’s acquisition activities.\n(ii) Acquisition and Integration Costs, which represent certain transaction and integration costs associated with the Company’s acquisition activities.\n(iii) Restructuring and Other Related Costs, which represent costs associated with the Company’s Corporate Restructuring Initiative to exit and/or realign some of our businesses, streamline the Company’s management structure, reallocate work to lower cost locations, and reduce headcount in deprioritized areas, in addition to other restructuring activities. Refer to Note 13, “Payables and Accrued Expenses” for further details on the Company’s Corporate Restructuring Initiative.\n(iv) Litigation Settlement Charges, which represent reserves established during the third and fourth quarters of fiscal year 2024 related to the settlement of claims. Refer to Note 19, “Contractual Commitments, Contingencies and Off-Balance Sheet Arrangements” for further details.\n40\nWe exclude Acquisition and Integration Costs, Restructuring and Other Related Costs and Litigation Settlement Charges from our Adjusted Operating income (as applicable) and other adjusted earnings measures \nbecause excluding such information provides us with an understanding of the results from the primary operations of our business and enhances comparability across fiscal reporting periods, as these items are not reflective of our underlying operations or performance. \nWe also exclude the impact of Amortization of Acquired Intangibles and Purchased Intellectual Property, as these non-cash amounts are significantly impacted by the timing and size of individual acquisitions and do not factor into the Company's capital allocation decisions, management compensation metrics or multi-year objectives. Furthermore, management believes that this adjustment enables better comparison of our results as Amortization of Acquired Intangibles and Purchased Intellectual Property will not recur in future periods once such intangible assets have been fully amortized. Although we exclude Amortization of Acquired Intangibles and Purchased Intellectual Property from our adjusted earnings measures, our management believes that it is important for investors to understand that these intangible assets contribute to revenue generation. Amortization of intangible assets that relate to past acquisitions will recur in future periods until such intangible assets have been fully amortized. Any future acquisitions may result in the amortization of additional intangible assets.\nFree Cash Flow\nIn addition to the Non-GAAP financial measures discussed above, we provide Free cash flow information because we consider Free cash flow to be a liquidity measure that provides useful information to management and investors about the amount of cash generated that could be used for dividends, share repurchases, strategic acquisitions, other investments, as well as debt servicing. Free cash flow is a Non-GAAP financial measure and is defined by the Company as Net cash flows provided by operating activities less Capital expenditures as well as Software purchases and capitalized internal use software.\nRecurring Revenue Growth Constant Currency\nAs a multi-national company, we are subject to variability of our reported U.S. dollar results due to changes in foreign currency exchange rates. The exclusion of the impact of foreign currency exchange fluctuations from our Recurring revenue growth, or what we refer to as amounts expressed “on a constant currency basis,” is a Non-GAAP measure. We believe that excluding the impact of foreign currency exchange fluctuations from our Recurring revenue growth provides additional information that enables enhanced comparison to prior periods. \nChanges in Recurring revenue growth expressed on a constant currency basis are presented excluding the impact of foreign currency exchange fluctuations. To present this information, current period results for entities reporting in currencies other than the U.S. dollar are translated into U.S. dollars at the average exchange rates in effect during the corresponding period of the comparative year, rather than at the actual average exchange rates in effect during the current fiscal year. \nReconciliation of such Non-GAAP measures to the most directly comparable GAAP measures (unaudited)\n:    \n \nYears ended June 30,\n \n2025\n2024\n \n(in millions)\nOperating income (GAAP)\n$\n1,188.6\n$\n1,017.1\nAdjustments: \nAmortization of Acquired Intangibles and Purchased Intellectual Property\n196.6\n200.3\nAcquisition and Integration Costs\n18.3\n3.9\nRestructuring and Other Related Costs (a)\n7.4\n63.0\nLitigation Settlement Charges\n—\n18.4\nAdjusted Operating income (Non-GAAP)\n$\n1,410.9\n$\n1,302.8\nOperating income margin (GAAP)\n17.3\n%\n15.6\n%\nAdjusted Operating income margin (Non-GAAP)\n20.5\n%\n20.0\n%\n41\n \nYears ended June 30,\n \n2025\n2024\n \n(in millions)\nNet earnings (GAAP)\n$\n839.5 \n$\n698.1 \nAdjustments: \nAmortization of Acquired Intangibles and Purchased Intellectual Property\n196.6 \n200.3 \nAcquisition and Integration Costs\n18.3 \n3.9 \nRestructuring and Other Related Costs (a)\n7.4 \n63.0 \nLitigation Settlement Charges\n— \n18.4 \n      Subtotal of adjustments\n222.3 \n285.6 \nTax impact of adjustments (b)\n(50.4)\n(62.6)\nAdjusted Net earnings (Non-GAAP)\n$\n1,011.5 \n$\n921.2 \n \nYears ended June 30, \n \n2025\n2024\n \nDiluted earnings per share (GAAP)\n$\n7.10 \n$\n5.86 \nAdjustments:\nAmortization of Acquired Intangibles and Purchased Intellectual Property\n1.66 \n1.68 \nAcquisition and Integration Costs\n0.15 \n0.03 \nRestructuring and Other Related Costs (a)\n0.06 \n0.53 \nLitigation Settlement Charges\n— \n0.15 \n      Subtotal of adjustments\n1.88 \n2.40 \nTax impact of adjustments (b)\n(0.43)\n(0.53)\nAdjusted earnings per share (Non-GAAP)\n$\n8.55 \n$\n7.73 \n_________\n(a)\nRestructuring and Other Related Costs for the fiscal year ended June 30, 2025 consists of severance and other costs related to the closure of substantially all operations of a production facility. Costs incurred are not reflected in segment profit and are recorded within Corporate and Other. The total estimated pre-tax costs for actions and associated costs related to the closure are approximately $20 million to $25 million and are expected to be completed by the end of the second quarter of fiscal year 2026. \nRestructuring and Other Related Costs for the fiscal year ended June 30, 2024 includes $56.0 million of severance and professional services costs directly related to the Corporate Restructuring Initiative and a $7.0 million asset impairment charge as a result of the exit of a business in connection with the Corporate Restructuring Initiative. Refer to Note 13, “Payables and Accrued Expenses” to our Consolidated Financial Statements under Item 8. of Part II of this Annual Report on Form 10-K for a more detailed discussion.\n(b)\nCalculated using the GAAP effective tax rate, adjusted to exclude $20.5 million of excess tax benefits (“ETB”) associated with stock-based compensation for the fiscal year ended June 30, 2025, and $12.9 million of ETB associated with stock-based compensation for the fiscal year ended June 30, 2024. For purposes of calculating the Adjusted earnings per share, the same adjustments were made on a per share basis.\n \nYears ended June 30,\n \n2025\n2024\n \n(in millions)\nNet cash flows from operating activities (GAAP)\n$\n1,171.3 \n$\n1,056.2 \nCapital expenditures and Software purchases and capitalized internal use software\n(114.9)\n(113.0)\nFree cash flow (Non-GAAP)\n$\n1,056.4 \n$\n943.2 \n42\nYear Ended June 30, 2025\n \nInvestor Communication Solutions\nRegulatory\nData-Driven Fund Solutions\nIssuer\nCustomer Communications\n \nTotal\nRecurring revenue growth (GAAP)\n7\n%\n6\n%\n5\n%\n5\n%\n6\n%\nImpact of foreign currency exchange\n0\n%\n0\n%\n0\n%\n0\n%\n0\n%\nRecurring revenue growth constant currency (Non-GAAP)\n7\n%\n5\n%\n5\n%\n5\n%\n6\n%\nYear Ended June 30, 2025\n \nGlobal Technology and Operations\nCapital Markets\nWealth and Investment Management\nTotal\nRecurring revenue growth (GAAP)\n6\n%\n10\n%\n8\n%\nImpact of foreign currency exchange\n0\n%\n1\n%\n1\n%\nRecurring revenue growth constant currency (Non-GAAP)\n6\n%\n12\n%\n8\n%\nYear Ended June 30, 2025\nConsolidated\nTotal\nRecurring revenue growth (GAAP)\n7\n%\nImpact of foreign currency exchange\n0\n%\nRecurring revenue growth constant currency (Non-GAAP)\n7\n%\n43\nFINANCIAL CONDITION, LIQUIDITY AND CAPITAL RESOURCES\nCash and cash equivalents consisted of the following:\n \nJune 30,\n \n2025\n2024\n \n(in millions)\nCash and cash equivalents:\nDomestic cash\n$\n326.2 \n$\n78.4 \nCash held by foreign subsidiaries\n174.6 \n177.3 \nCash held by regulated entities\n60.7 \n48.7 \n     Total cash and cash equivalents\n$\n561.5 \n$\n304.4 \nAt June 30, 2025 and 2024, Cash and cash equivalents were $561.5 million and $304.4 million, respectively. Total stockholders’ equity was $2,655.1 million and $2,168.2 million at June 30, 2025 and 2024, respectively. At the current time, and in future periods, we expect cash generated by our operations, together with existing cash, cash equivalents, and borrowings from the capital markets, to be sufficient to cover cash needs for working capital, capital expenditures, strategic acquisitions, dividends and common stock repurchases. \nWe expect existing domestic cash, cash equivalents, cash flows from operations and borrowing capacity to continue to be sufficient to fund our domestic operating activities and cash commitments for investing and financing activities, such as regular quarterly dividends, debt repayment schedules, and material capital expenditures, for at least the next 12 months and thereafter for the foreseeable future. In addition, we expect existing foreign cash, cash equivalents, cash flows from operations and borrowing capacity to continue to be sufficient to fund our foreign operating activities and cash commitments for investing activities, such as material capital expenditures, for at least the next 12 months and thereafter for the foreseeable future. If these funds are needed for our operations in the U.S., we may be required to pay additional foreign taxes to repatriate these funds. However, while we may do so at a future date, the Company does not need to repatriate future foreign earnings to fund U.S. operations.\n44\nOutstanding borrowings and available capacity under the Company’s borrowing arrangements were as follows:\nExpiration\nDate\nPrincipal amount outstanding at June 30, 2025\nCarrying value at June 30, 2025\nCarrying value at June 30, 2024\nUnused\nAvailable\nCapacity\n Fair Value at June 30, 2025\n(in millions)\nCurrent portion of long-term debt\nFiscal 2016 Senior Notes (a)\nJune 2026\n$\n500.0 \n$\n499.3 \n$\n— \n$\n— \n$\n494.1 \nTotal \n$\n500.0 \n$\n499.3 \n$\n— \n$\n— \n$\n494.1 \nLong-term debt, excluding current portion\nFiscal 2025 Revolving Credit Facility:\nU.S. dollar tranche\nDecember 2029\n$\n— \n$\n— \n$\n— \n$\n1,000.0 \n$\n— \nMulticurrency tranche\nDecember 2029\n133.5 \n133.5 \n— \n366.5 \n133.5 \nTotal Revolving Credit Facility\n$\n133.5 \n$\n133.5 \n$\n— \n$\n1,366.5 \n$\n133.5 \nFiscal 2024 Amended Term Loan\nAugust 2026\n$\n880.0 \n$\n879.1 \n$\n1,117.9 \n$\n— \n$\n880.0 \nFiscal 2016 Senior Notes (a)\nJune 2026\n$\n— \n$\n— \n$\n498.7 \n$\n— \n$\n— \nFiscal 2020 Senior Notes\nDecember 2029\n750.0 \n746.0 \n745.1 \n— \n702.8 \nFiscal 2021 Senior Notes\nMay 2031\n1,000.0 \n994.4 \n993.4 \n— \n891.4 \nTotal Senior Notes\n$\n1,750.0 \n$\n1,740.3 \n$\n2,237.2 \n$\n— \n$\n1,594.2 \nTotal long-term debt\n$\n2,763.5 \n$\n2,753.0 \n$\n3,355.1 \n$\n1,366.5 \n$\n2,607.7 \nTotal debt\n$\n3,263.5 \n$\n3,252.3 \n$\n3,355.1 \n$\n1,366.5 \n$\n3,101.8 \n_________\n(a)\n The Fiscal 2016 Senior Notes were reclassified from Long-term debt to Current portion of long-term debt in the fourth quarter of fiscal year 2025 to reflect the remaining maturity of less than one year.\nFuture principal payments on the Company’s outstanding debt are as follows:\nYears ending June 30,\n2026\n2027\n2028\n2029\n2030\nThereafter\nTotal\n(in millions)\n$\n500.0 \n$\n880.0 \n$\n— \n$\n— \n$\n883.5 \n$\n1,000.0 \n$\n3,263.5 \nThe Fiscal 2025 Revolving Credit Facility, Fiscal 2024 Amended Term Loans, Fiscal 2016 Senior Notes, Fiscal 2020 Senior Notes and Fiscal 2021 Senior Notes are senior unsecured obligations of the Company and are ranked equally in right of payment.\nPlease refer to Note 14, “Borrowings” to our Consolidated Financial Statements under Item 8. of Part II of this Annual Report on Form 10-K for a more detailed discussion.\n45\nCash Flows\nFiscal Year 2025 Compared to Fiscal Year 2024 \n \nYears Ended June 30,\n \n2025\n2024\n$ Change\n \n(in millions)\n \nNet cash flows from operating activities\n$\n1,171.3 \n$\n1,056.2 \n$\n115.0 \nNet cash flows from investing activities\n(316.2)\n(148.0)\n(168.2)\nNet cash flows from financing activities\n(600.8)\n(855.5)\n254.8 \nEffect of exchange rate changes on Cash and cash equivalents\n2.8 \n(0.6)\n3.4 \nNet change in Cash and cash equivalents\n$\n257.1 \n$\n52.1 \n$\n205.1 \nFree cash flow:\nNet cash flows from operating activities (GAAP)\n$\n1,171.3 \n$\n1,056.2 \n$\n115.0 \nCapital expenditures and Software purchases and capitalized internal use software\n(114.9)\n(113.0)\n(1.9)\nFree cash flow (Non-GAAP)\n$\n1,056.4 \n$\n943.2 \n$\n113.1 \n \nThe increase in cash from operating activities of $115.0 million for the fiscal year ended June 30, 2025, as compared to the fiscal year ended June 30, 2024, was due to an increase in Net earnings of $141.4 million, an increase in cash provided from Accounts receivable of $69.1 million driven by higher cash collections relative to billings, an increase in the non-cash adjustments of $167.1 million, primarily related to a decrease in Deferred income taxes of $114.5 million and a decrease in cash used for client-related implementation costs of $25.2 million included in Other non-current assets. This was primarily offset by an increase in cash used for Accounts Payable and accrued expenses of $283.1 million, inclusive of an increase in taxes paid.\nThe decrease in cash from investing activities of $168.2 million primarily reflects an increase in cash used for acquisitions of $159.2 million and cash used in software purchases and capitalized internal use software of $15.5 million.\nThe increase in cash from financing activities of $254.8 million primarily reflects a decrease in cash used for stock buybacks of $350.5 million partially offset by a decrease in net borrowings of $44.4 million and an increase in dividends paid of $34.1 million.\nIncome Taxes\nThe Company, headquartered in the U.S., is routinely examined by the IRS and is also routinely examined by the tax authorities in the U.S. states and foreign countries in which it conducts business. The tax years under audit examination vary by tax jurisdiction. The Company regularly considers the likelihood of assessments in each of the jurisdictions resulting from examinations. To the extent the Company determines it has potential tax assessments in particular tax jurisdictions, the Company has established tax reserves which it believes are adequate in relation to the potential assessments. Once established, reserves are adjusted when there is more information available, when an event occurs necessitating a change to the reserves or the statute of limitations for the relevant taxing authority to examine the tax position has expired. The resolution of tax matters should not have a material effect on the financial condition of the Company or on the Company’s Consolidated Statements of Earnings for a particular future period.\nEmployee Benefit Plans\nThe Company sponsors a Supplemental Officer Retirement Plan (the “SORP”), a Supplemental Executive Retirement Plan (the “SERP”), an Executive Retiree Health Insurance Plan, and certain non-US benefits-related plans. Please refer to Note 17, “Employee Benefit Plans” to our Consolidated Financial Statements under Item 8. of Part II of this Annual Report on Form 10-K for a discussion on the Company’s Employee Benefit Plans.\n46\nContractual Obligations    \nThe following table summarizes our contractual obligations to third parties as of June 30, 2025 and the effect such obligations are expected to have on our liquidity and cash flows in future periods:\n \nPayments Due by Period\n \nTotal\nLess than 1\nYear\n1-3 Years\n4-5 Years\nAfter 5\nYears\n \n \n \n(in millions)\n \n \nDebt(1)\n$\n3,263.5 \n$\n500.0 \n$\n880.0 \n$\n883.5 \n$\n1,000.0 \nInterest and facility fee on debt(2)\n352.6 \n121.9 \n115.2 \n93.8 \n21.7 \nFacility and equipment operating leases(3)\n232.7 \n42.7 \n81.1 \n49.7 \n59.3 \nPurchase obligations(4)\n633.7 \n240.7 \n306.8 \n84.5 \n1.7 \nCapital commitment to fund investment(5)\n— \n— \n— \n— \n— \nUncertain tax positions(6)\n— \n— \n— \n— \n— \nTotal(7)\n$\n4,482.6 \n$\n905.3 \n$\n1,383.1 \n$\n1,111.4 \n$\n1,082.7 \n_________\n(1)\nThese amounts represent the principal repayments of Long-term debt and are included on our Consolidated Balance Sheets. See Note 14, “Borrowings” to our Consolidated Financial Statements under Item 8. of Part II of this Annual Report on Form 10-K for additional information about our Borrowings and related matters. \n(2)\nIncludes estimated future interest payments on our long-term debt and interest and facility fee on the revolving credit facility. \n(3)\nWe enter into operating leases in the normal course of business relating to facilities and equipment. The majority of our lease agreements have fixed payment terms based on the passage of time. Certain facility and equipment leases require payment of maintenance, real estate taxes and related executory costs, and contain escalation provisions based on future adjustments in price indices. Our future operating lease obligations could change if we exit certain contracts and if we enter into additional operating lease agreements. See Note 8, “Leases” to our Consolidated Financial Statements under Item 8 of Part II of this Annual Report on Form 10-K for additional information about our Leases and related matters. \n(4)\nPurchase obligations relate to payments to Kyndryl, Inc. related to the Amended IT Services Agreement (as described below) that expires in fiscal year 2027, the Private Cloud Agreement (as described below) that expires in fiscal year 2030, the AWS Cloud Agreement (as described below) that expires in fiscal year 2027, as well as other data center arrangements and software license agreements including hosted software arrangements, and software and hardware maintenance and support agreements, and certain other related arrangements. Purchase obligations also includes $54.6 million of other liabilities recorded on the Company’s Consolidated Balance Sheet as of June 30, 2025. \n(5)\nThe Company has a future commitment to fund $26.0 million to an investee that is not included in the table above due to the uncertainty of the timing of this future payment.\n(6)\nDue to the uncertainty related to the timing of the reversal of uncertain tax positions, only uncertain tax benefits related to certain settlements have been provided in the table above. The Company is unable to make reasonably reliable estimates related to the timing of the remaining gross unrecognized tax benefit liability of \n$100.6 million \n(inclusive of interest). See Note 18, “Income Taxes” to our Consolidated Financial Statements under Item 8. of Part II of this Annual Report on Form 10-K for further detail.\n(7)\nCertain post-employment benefit obligations reported in our Consolidated Balance Sheets in the amount of $83.5 million as of June 30, 2025 were not included in the table above due to the uncertainty of the timing of these future payments. \nPlease refer to Note 19, “Contractual Commitments, Contingencies, and Off-Balance Sheet Arrangements” to our Consolidated Financial Statements under Item 8. of Part II of this Annual Report on Form 10-K for a more detailed discussion of the Company’s contractual obligations.\nRecently Issued Accounting Pronouncements\nPlease refer to Note 2, “Summary of Significant Accounting Policies” to our Consolidated Financial Statements under Item 8. of Part II of this Annual Report on Form 10-K for a discussion on the impact of the adoption of new accounting pronouncements. \n47",
  "item2": null
}