{
  "source_file": "br-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2.    MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe following discussion should be read in conjunction with our Condensed Consolidated Financial Statements and accompanying Notes thereto included elsewhere herein. Certain information contained in “Management’s Discussion and Analysis of Financial Condition and Results of Operations” are “forward-looking statements” within the meaning of the Private Securities Litigation Reform Act of 1995. Statements that are not historical in nature and which may be identified by the use of words such as “expects,” “assumes,” “projects,” “anticipates,” “estimates,” “we believe,” “could be,” “on track” and other words of similar meaning, are forward-looking statements. These statements are based on management’s expectations and assumptions and are subject to risks and uncertainties that may cause actual results to differ materially from those expressed. Our actual results, performance or achievements may differ materially from the results discussed in this Item 2. because of various factors, including those set forth elsewhere herein. See “Note about forward-looking statements” and “Risk Factors” included in this Quarterly Report on Form 10-Q.\nOverview\nBroadridge, a Delaware corporation, is a global financial technology leader providing investor communications and technology-driven solutions to banks, broker-dealers, asset and wealth managers, public companies, investors and mutual funds. Our services include investor communications, securities processing, data and analytics, and customer communications solutions. With over 60 years of experience, including over 15 years as an independent public company, we provide integrated solutions and an important infrastructure that powers the financial services industry. Our solutions enable better financial lives by powering investing, governance and communications and help reduce the need for our clients to make significant capital investments in operations infrastructure, thereby allowing them to increase their focus on core business activities. Our businesses operate in two reportable segments: Investor Communication Solutions (“ICS”) and Global Technology and Operations (“GTO”).\nACQUISITIONS\nWe frequently review our businesses to ensure we have the necessary assets to execute our strategy. We expect to acquire businesses when we identify a compelling strategic need, such as a product, service or technology that helps meet client demand, a way to achieve business scale that enables competition and operational efficiency, or similar considerations. The results of operations for acquired businesses are included in our consolidated results from the respective dates of acquisition.\nAcquisitions of Businesses\nIn September 2025, the Company acquired LDI-MAP, LLC (“iJoin”), \na retirement plan technology provider specializing in participant onboarding, engagement, and analytics solutions for the retirement industry.\n iJoin is included in the Company’s ICS reportable segment.   In August 2025, the Company acquired Signal Agency Ltd. (“Signal”), a UK-based provider of design, technology and consulting services that support omni-channel communications for financial services and other firms. Signal is included in the Company’s ICS reportable segment. We acquired these businesses for an aggregate purchase price of $70.5 million, net of cash acquired.\nAnnounced Acquisition\nIn July 2025, Broadridge announced the proposed acquisition of Acolin Group Holdco Limited (“Acolin”). Acolin is a European provider of cross-border fund distribution and regulatory services. The total purchase price is approximately $70 million plus an additional contingent consideration liability. The acquisition is expected to close in the first half of Broadridge’s 2026 fiscal year, subject to customary closing conditions, including regulatory approvals. Acolin will be included in the Company’s ICS reportable segment. \nInvestor Communication Solutions\nWe provide the following governance and communications solutions through our Investor Communication Solutions business segment: Regulatory Solutions, Data-Driven Fund Solutions, Corporate Issuer Solutions, and Customer Communications Solutions.\n33\nTable of \nContents\nA large portion of our Investor Communication Solutions business involves the processing and distribution of proxy materials to investors in equity securities and mutual funds, as well as the facilitation of related vote processing.  In addition to proxy services, Broadridge also provides regulatory communications solutions that enable global asset managers to communicate with large audiences of investors efficiently and reliably by centralizing all investor communications through one resource. Through its Fund Communication Solutions business, Broadridge provides fund managers with a single, integrated provider to manage data, perform calculations, compose documents, manage regulatory compliance, and disseminate information across multiple jurisdictions. Broadridge also provides a range of other regulatory communications solutions, including reorganization communications notifying investors of U.S. reorganizations or corporate action events such as tender offers, mergers and acquisitions, bankruptcies, and global class action services for the identification, filing and recovery of class actions and collective redress proceedings involving securities and other financial products.\nFor asset managers and retirement service providers, we offer data-driven solutions and an end-to-end platform for content management, composition, and omni-channel distribution of regulatory, marketing, and transactional information. Our data and analytics solutions provide investment product distribution data, analytical tools, insights, and research to enable asset managers to optimize product distribution across retail and institutional channels globally. We also provide fiduciary-focused learning and development, software and technology, and data and analytics services to advisors, institutions and asset managers across the retirement and wealth ecosystem. Through our Retirement and Workplace business (“Broadridge Retirement and Workplace”), we provide automated mutual fund and exchange-traded funds trade processing services for financial institutions who submit trades on behalf of their clients such as qualified and non-qualified retirement plans and individual wealth accounts. In addition, our marketing and transactional communications solutions provide a content management and omni-channel distribution platform for marketing and sales communications for asset managers, insurance providers and retirement service providers.\nIn addition,  we provide a range of corporate solutions that revolve around shareholder meetings and proxy, corporate governance and sustainability, regulatory filings and disclosure, and stock transfer services. Our services provide corporate issuers a single source solution that spans the entire corporate disclosure and shareholder communications and corporate disclosure lifecycle. Our shareholder meetings and proxy services and corporate governance and sustainability governance and communications services include a full suite of annual meeting and shareholder engagement solutions which include proxy services, virtual shareholder meeting services, shareholder engagement, and governance and sustainability services. We also offer regulatory filings and disclosure solutions, including annual SEC filing services and capital markets transaction services, and provides registrar, stock transfer and record-keeping services through its transfer agency services.\nWe provide omni-channel customer communications solutions, that include print and digital solutions, to modernize technology infrastructures, simplify communications processes, accelerate digital adoption and improve the customer experience. \nThrough one point of integration, the Broadridge Communications Cloud\nSM\n platform helps companies create, deliver, and manage their communications and customer engagement. The platform includes data-driven composition tools, identity and preference management, omni-channel optimization and digital communication experience, archive and information management, digital and print delivery, and analytics and reporting tools. \n34\nTable of \nContents\nGlobal Technology and Operations\nOur Global Technology and Operations business provides \nmission-critical, scale infrastructure to the global financial markets. As a leading software as a service (“SaaS”) provider, we offer capital markets, wealth and investment management firms modern technology to enable growth, simplify their technology stacks and mutualize costs. Our highly scalable, resilient, component-based platform automate the front-to-back transaction lifecycle of equity, mutual fund, fixed income, foreign exchange and exchange-traded derivatives, from order capture and execution through trade confirmation, margin, cash management, clearing and settlement, reference data management, reconciliations, securities financing and collateral management, asset servicing, compliance and regulatory reporting, portfolio accounting and custody-related services. Our Wealth Management business provides solutions for advisors and investors and also streamlines back and middle-office operations for broker-dealers by providing systems for critical post-trade activities, including books and records, transaction processing, clearance and settlement, and reporting. Our Investment Management business provides portfolio and order management solutions for traditional and alternative asset managers, which bring insights into trading, portfolio construction, risk and analytics. Our solutions connect asset managers to a global network of broker-dealers for trade execution and post-trade matching and confirmation. In addition, we provide business process outsourcing services for its buy and sell-side clients’ businesses. These services combine Broadridge’s technology with its operations expertise to support the entire trade lifecycle, including securities clearing and settlement, reconciliations, record-keeping, wealth management asset servicing, and custody-related functions.\nFor capital markets firms, we \nprovide a set of multi-asset, multi-entity, and multi-currency \npost-trade and trading and connectivity solutions\n that support processing of securities transactions in equities, options, fixed income securities, foreign exchange, exchange-traded derivatives, and mutual funds\n. Largely provided on a SaaS basis within large user communities, our technology is a global solution, processing trades, clearance and settlement in over 90 markets. Our solutions enable global capital markets firms \nto access market liquidity, drive more effective market making and efficient front-to-back trade processing.\n \nThrough Broadridge Trading and Connectivity Solutions, we offer a set of global front-office trade order and execution management systems and connectivity solutions that enable market participants to connect and trade. The combination of the front-office solutions from the 2021 acquisition of Itiviti Holding AB (“Itiviti”) and our post-trade product suite and other capital markets capabilities enables our clients to streamline their front-to-back technology platforms and operations and increase straight-through-processing efficiencies, across equities, fixed income, exchange-traded derivatives, and other asset classes.\nOur \nWealth Management business delivers front-to-back technology solutions and other capabilities across the entire wealth management lifecycle and streamlines all aspects of wealth management services, including account management, fee management and client on-boarding. The wealth technology solutions enable full-service, regional and independent broker-dealers and investment advisors to better engage with customers through digital marketing and customer communications tools. We also integrate data, content and technology to drive new customer acquisition, support holistic and personalized advice and cross-sell opportunities. Our advisor solutions help advisors optimize their practice management through customer and account data aggregation and reporting. \nOur \nInvestment Management business services the global investment management industry with a range of buy-side technology solutions such as portfolio management, compliance and fee billing and operational support solutions for hedge funds, family offices, alternative asset managers, traditional asset managers and the providers that service this space including prime brokers, fund administrators and custodians.\n \nConsolidation and Basis of Presentation\nThe Condensed Consolidated Financial Statements have been prepared in accordance with generally accepted accounting principles (“GAAP”) in the United States of America (“U.S.”). These Condensed Consolidated Financial Statements present the condensed consolidated position of the Company and include the entities in which the Company directly or indirectly has a controlling financial interest as well as various entities in which the Company has investments recorded under the equity method of accounting as well as certain marketable and non-marketable securities. Intercompany balances and transactions have been eliminated. Amounts presented may not sum due to rounding. \nThe results of operations reported for interim periods are not necessarily indicative of the results of operations for the entire year or any subsequent interim period. These Condensed Consolidated Financial Statements should be read in conjunction with the Company’s Consolidated Financial Statements for the fiscal year ended June 30, 2025 in the 2025 Annual Report.\n35\nTable of \nContents\nCritical Accounting Estimates\nIn presenting the Condensed Consolidated Financial Statements, management makes estimates and assumptions that affect the amounts reported and related disclosures. Management continually evaluates the accounting policies and estimates used to prepare the Condensed Consolidated Financial Statements. The estimates, by their nature, are based on judgment, available information, and historical experience and are believed to be reasonable. However, actual amounts and results could differ from these estimates made by management. In management’s opinion, the Condensed Consolidated Financial Statements contain all normal recurring adjustments necessary for a fair presentation of results reported. The results of operations reported for the periods presented are not necessarily indicative of the results of operations for subsequent periods. Certain accounting policies that require significant management estimates and are deemed critical to our results of operations or financial position are discussed in the “Critical Accounting Policies” section of Part II, Item 7. “Management’s Discussion and Analysis of Financial Condition and Results of Operations” in the 2025 Annual Report.\nKEY PERFORMANCE INDICATORS\nManagement focuses on a variety of key indicators to plan, measure and evaluate the Company’s business and financial performance. These performance indicators include Revenue and Recurring revenue as well as not generally accepted accounting principles measures (“Non-GAAP”) of Adjusted Operating income, Adjusted Net earnings, Adjusted earnings per share, Free Cash flow, Recurring revenue growth constant currency, and Closed sales. In addition, management focuses on select operating metrics specific to Broadridge of Position Growth and Internal Trade Growth, as defined below.\nRefer to the section “Explanation and Reconciliation of the Company’s Use of Non-GAAP Financial Measures” for a reconciliation of Adjusted Operating income, Adjusted Net earnings, Adjusted earnings per share, Free Cash flow and Recurring revenue growth constant currency to the most directly comparable GAAP measures, and an explanation for why these Non-GAAP metrics provide useful information to investors and how management uses these Non-GAAP metrics for operational and financial decision-making. Refer to the section “Results of Operations” for a description of Closed sales and an explanation of why Closed sales is a useful performance metric for management and investors.\nRevenues\nRevenues are primarily generated from fees for processing and distributing investor communications and fees for technology-enabled services and solutions. The Company monitors revenue in each of our two reportable segments as a key measure of success in addressing our clients’ needs. Revenues from fees are derived from both recurring and event-driven activity. The level of recurring and event-driven activity the Company processes directly impacts distribution revenues. While event-driven activity is highly repeatable, it may not recur on an annual basis. Event-driven revenues are based on the number of special events and corporate transactions the Company processes. Event-driven activity is impacted by financial market conditions and changes in regulatory compliance requirements, resulting in fluctuations in the timing and levels of event-driven revenues. Distribution revenues primarily include revenues related to the physical mailing of proxy materials, interim communications, transaction reporting, customer communications and fulfillment services as well as Broadridge Retirement and Workplace administrative services.\nRecurring revenue growth represents the Company’s total annual revenue growth, less growth from event-driven and distribution revenues. We distinguish recurring revenue growth between organic and acquired:\n•\nOrganic – We define organic revenue as the recurring revenue generated from Net New Business and Internal Growth.\n•\nAcquired – We define acquired revenue as the recurring revenue generated from acquired services in the first twelve months following the date of acquisition. This type of growth comes as a result of our strategy to purchase, integrate, and leverage the value of assets we acquire. \nRevenue and Recurring revenue are useful metrics for investors in understanding how management measures and evaluates the Company’s ongoing operational performance. See “Results of Operations” as well as Note 3, “Revenue Recognition” to our Condensed Consolidated Financial Statements in this Form 10-Q.\n36\nTable of \nContents\nPosition Growth and Internal Trade Growth\nThe Company uses select operating metrics specific to Broadridge of Position Growth and Internal Trade Growth in evaluating its business results and identifying trends affecting its business. Position Growth is comprised of “equity position growth” and “mutual fund/ETF position growth.” Equity position growth measures the estimated annual change in positions eligible for equity proxy materials. Beginning in the fourth quarter of fiscal year 2025, the Company began presenting information on “equity revenue position growth.”  Equity revenue position growth excludes small or fractional equity positions for which the Company does not recognize revenue (“non-revenue positions”). Prior period comparative information for this metric is not available. Mutual fund/ETF position growth measures the estimated change in mutual fund and exchange traded fund positions eligible for interim communications. These metrics are calculated from equity proxy and mutual fund/ETF position data reported to Broadridge for the same issuers or funds in both the current and prior year periods.  \nInternal Trade Growth represents the estimated change in daily average trade volumes for Broadridge securities processing clients whose contracts are linked to trade volumes and who were on Broadridge’s trading platforms in both the current and prior year periods. Position Growth and Internal Trade Growth are useful non-financial metrics for investors in understanding how management measures and evaluates Broadridge’s ongoing operational performance within its Investor Communication Solutions and Global Technology and Operations reportable segments, respectively.  \nThe key performance indicators for the three months ended September 30, 2025, and 2024, are as follows:\nSelect Operating Metrics\nThree Months Ended \n September 30,\n2025\n2024\nPosition Growth\n   Equity positions\n12 \n%\n3 \n%\n   Equity revenue positions\n7 \n%\nN/A\n   Mutual fund / ETF positions\n2 \n%\n6 \n%\nInternal Trade Growth\n17 \n%\n10 \n%\nResults of Operations\nThe following discussions of Analysis of Condensed Consolidated Statements of Earnings and Analysis of Reportable Segments refer to the three months ended September 30, 2025 compared to the three months ended September 30, 2024. The Analysis of Condensed Consolidated Statements of Earnings should be read in conjunction with the Analysis of Reportable Segments, which provides a more detailed discussion concerning certain components of the Condensed Consolidated Statements of Earnings.\nThe following references are utilized in the discussions of Analysis of Condensed Consolidated Statements of Earnings and Analysis of Reportable Segments:\n“Amortization of Acquired Intangibles and Purchased Intellectual Property” and “Acquisition and Integration Costs” represent certain non-cash amortization expenses associated with acquired intangible assets and purchased intellectual property assets, as well as certain transaction and integration costs associated with the Company’s acquisition activities, respectively.\n“Restructuring and Other Related Costs” represent costs associated with the Company’s corporate restructuring initiative (the “Corporate Restructuring Initiative”) to exit and/or realign some of our businesses, streamline the Company’s management structure, reallocate work to lower cost locations, and reduce headcount in deprioritized areas, in addition to other restructuring activities.\n“Net New Business” refers to recurring revenue from Closed sales for the initial twelve-month contract period after which the client goes live with the Company’s service(s), less recurring revenue from client losses.\n“Internal Growth” is a component of recurring revenue and generally reflects year over year changes in existing services to our existing customers’ multi-year contracts beyond the initial twelve month period in which it was included in Net New Business.  \n“Recurring revenue growth constant currency” refers to our Recurring revenue growth presented on a constant currency basis to exclude the impact of foreign currency exchange fluctuations.\n37\nTable of \nContents\nThe following definitions describe the Company’s Revenues:\nRevenues in the Investor Communication Solutions segment are derived from both recurring and event-driven activity, in addition to distribution revenues. The level of recurring and event-driven activity we process directly impacts distribution revenues. While event-driven activity is highly repeatable, it may not recur on an annual basis. The types of services we provide that comprise event-driven activity are:\n•\nMutual Fund Proxy: The proxy and related services we provide to mutual funds when certain events occur requiring a shareholder vote including changes in directors, sub-advisors, fee structures, investment restrictions, and mergers of funds.\n•\nMutual Fund Communications: Mutual fund communications services consist primarily of the distribution on behalf of mutual funds of supplemental information required to be provided to the annual mutual fund prospectus as a result of certain triggering events such as a change in portfolio managers. In addition, mutual fund communications consist of notices and marketing materials such as newsletters.\n•\nEquity Proxy Contests and Specials, Corporate Actions, and Other: The proxy services we provide in connection with shareholder meetings driven by special events such as proxy contests, mergers and acquisitions, and tender/exchange offers.\nEvent-driven revenues are based on the number of special events and corporate transactions we process. Event-driven activity is impacted by financial market conditions and changes in regulatory compliance requirements, resulting in fluctuations in the timing and levels of event-driven revenues. As such, the timing and level of event-driven activity and its potential impact on revenues and earnings are difficult to forecast. \nGenerally, mutual fund proxy activity has been subject to a greater level of volatility than the other components of event-driven activity. For the three months ended September 30, 2025, mutual fund proxy revenues were 186% higher compared to the three months ended September 30, 2024. During fiscal year 2025, mutual fund proxy revenues were 75% higher than the prior fiscal year. Although it is difficult to forecast the levels of event-driven activity, we expect that the portion of revenues derived from mutual fund proxy activity may continue to experience volatility in the future.\nDistribution revenues primarily include revenues related to the physical mailing of proxy materials, interim communications, transaction reporting, customer communications and fulfillment services, as well as Broadridge Retirement and Workplace administrative services.\nDistribution cost of revenues consists primarily of postage-related expenses incurred in connection with our Investor Communication Solutions segment, as well as Broadridge Retirement and Workplace administrative services expenses. These costs are reflected in Cost of revenues.\nClosed sales represent an estimate of the expected annual recurring revenue for new client contracts that were signed by Broadridge in the current reporting period. Closed sales does not include event-driven or distribution activity. We consider contract terms, expected client volumes or activity, knowledge of the marketplace and experience with our clients, among other factors, when determining the estimate. Management uses Closed sales to measure the effectiveness of our sales and marketing programs, as an indicator of expected future revenues and as a performance metric in determining incentive compensation. \nClosed sales is not a measure of financial performance under GAAP, and should not be considered in isolation or as a substitute for revenue or other income statement data prepared in accordance with GAAP. Closed sales is a useful metric for investors in understanding how management measures and evaluates our ongoing operational performance.\nThe inherent variability of transaction volumes and activity levels can result in some variability of amounts reported as actual achieved Closed sales. Larger Closed sales can take up to 12 to 24 months or longer to convert to revenues, particularly for the services provided by our Global Technology and Operations segment. For the three months ended September 30, 2025 and for the fiscal year ended June 30, 2025, we reported Closed sales net of a 5.0% allowance adjustment. Consequently, our reported Closed sales amounts will not be adjusted for actual revenues achieved because these adjustments are estimated in the period the sale is reported. We assess this allowance amount at the end of each fiscal year to establish the appropriate allowance for the subsequent year using the trailing five years actual data as the starting point, normalized for outlying factors, if any, to enhance the accuracy of the allowance. \nClosed sales for the three months ended September 30, 2025 were $32.5 million, a decrease of $25.0 million, or 43%, compared to $57.5 million for the three months ended September 30, 2024. Closed sales for the three months ended September 30, 2025 and September 30, 2024 are net of an allowance adjustment of $1.7 million and $3.0 million, respectively.  \n38\nTable of \nContents\n Analysis of Condensed Consolidated Statements of Earnings \nThree Months Ended September 30, 2025 versus Three Months Ended September 30, 2024\nThe table below presents Condensed Consolidated Statements of Earnings data for the three months ended September 30, 2025 and 2024, and the dollar and percentage changes between periods:\nThree Months Ended \n September 30,\nChange\n2025\n2024\n$\n%\n(in millions, except per share amounts)\nRevenues\n$\n1,589.4 \n$\n1,422.9 \n$\n166.6 \n12 \n  Cost of revenues\n1,166.8 \n1,075.0 \n91.7 \n9 \n  Selling, general and administrative expenses\n233.9 \n213.4 \n20.5 \n10 \n       Total operating expenses\n1,400.7 \n1,288.4 \n112.2 \n9 \nOperating income\n188.8 \n134.4 \n54.3 \n40 \nMargin\n11.9\n%\n9.4\n%\nInterest expense, net\n(24.2)\n(32.3)\n8.1 \n(25)\nOther non-operating income (expenses), net\n48.5 \n(1.9)\n50.4 \nNM\nEarnings before income taxes\n213.1 \n100.3 \n112.8 \n112 \nProvision for income taxes\n47.7 \n20.5 \n27.2 \n133 \nEffective tax rate\n22.4\n%\n20.4\n%\nNet earnings\n$\n165.4 \n$\n79.8 \n$\n85.6 \n107 \nBasic earnings per share\n$\n1.41 \n$\n0.68 \n$\n0.73 \n107 \nDiluted earnings per share\n$\n1.40 \n$\n0.68 \n$\n0.72 \n106 \nWeighted-average shares outstanding:\n    Basic\n117.0 \n116.9 \n    Diluted\n118.0 \n118.1 \n_____________\nNM - Not Meaningful\n39\nTable of \nContents\nRevenues \nThe table below presents Condensed Consolidated Statements of Earnings data for the three months ended September 30, 2025 and 2024, and the dollar and percentage changes between periods:\nThree Months Ended \n September 30,\nChange\n2025\n2024\n$\n%\n($ in millions)\nRecurring revenues\n$\n977.5 \n$\n900.3 \n$\n77.2 \n9 \nEvent-driven revenues\n113.8 \n63.0 \n50.8 \n81 \nDistribution revenues\n498.1 \n459.5 \n38.6 \n8 \n       Total\n$\n1,589.4 \n$\n1,422.9 \n$\n166.6 \n12 \nPoints of Growth\nNet New Business\nInternal Growth\nAcquisitions\nForeign Exchange\nTotal\nRecurring revenue Growth Drivers\n3pts\n2pts\n3pts\n1pt\n9 \n%\nRevenues increased $166.6 million, or 12%, to $1,589.4 million from $1,422.9 million.\n•\nRecurring revenues increased $77.2 million, or 9%, to $977.5 million. Recurring revenue growth constant currency (Non-GAAP) was 8%, driven by organic growth and acquisitions in ICS and GTO. \n•\nEvent-driven revenues increased $50.8 million, or 81%, driven by a higher volume of mutual fund proxy communications.\n \n \n•\nDistribution revenues increased $38.6 million, or 8%, driven by the postage rate increase of approximately $25 million and higher event-driven mailings.\nTotal operating expenses\n.\n Operating expenses increased $112.2 million, or 9%, to $1,400.7 million from $1,288.4 million:\n•\nCost of revenues - the increase of $91.7 million primarily reflects higher expenses, including postage and distribution costs, in our ICS segment of approximately $38 million, higher expenses related to the SIS acquisition, and higher revenues.\n•\nSelling, general and administrative expenses - the increase of $20.5 million was primarily driven by higher compensation-related expenses.\nInterest expense, net. \nInterest expense, net was $24.2 million, a decrease of $8.1 million, from $32.3 million for the three months ended September 30, 2024. The decrease of $8.1 million was primarily due to lower average borrowings. \nOther non-operating income (expenses), net.\n Other non-operating income, net for the three months ended September 30, 2025 was $48.5 million, compared to Other non-operating expenses, net $1.9 million for the three months ended September 30, 2024, primarily as a result of an unrealized gain on digital assets of $45.8 million in the current year period.\nProvision for income taxes\n.\n \n•\nEffective tax rate for the three months ended September 30, 2025: 22.4%\n•\nEffective tax rate for the three months ended September 30, 2024: 20.4% \nThe increase in the effective tax rate for the three months ended September 30, 2025 was primarily driven by an increase in pre-tax income relative to total discrete tax benefits.\n40\nTable of \nContents\nAnalysis of Reportable Segments\nBroadridge has two reportable segments: (1) Investor Communication Solutions and (2) Global Technology and Operations.\nThe primary component of “Other” are certain gains, losses, corporate overhead expenses and non-operating expenses that have not been allocated to the reportable segments, such as interest expense.\nCertain corporate expenses, as well as certain centrally managed expenses, are allocated based upon budgeted amounts in a reasonable manner. Because the Company compensates the management of its various businesses on, among other factors, segment profit, the Company may elect to record certain segment-related operating and non-operating expense items in Other rather than reflect such items in segment profit.\nRevenues\nThree Months Ended \n September 30,\nChange\n2025\n2024\n$\n%\n($ in millions)\nInvestor Communication Solutions\n$\n1,130.0 \n$\n1,015.6 \n$\n114.3 \n11 \nGlobal Technology and Operations\n459.5 \n407.2 \n52.3 \n13 \n       Total\n$\n1,589.4 \n$\n1,422.9 \n$\n166.6 \n12 \nEarnings Before Income Taxes\nThree Months Ended \n September 30,\nChange\n2025\n2024\n$\n%\n($ in millions)\nInvestor Communication Solutions\n$\n126.4 \n$\n96.5 \n$\n29.9 \n31 \nGlobal Technology and Operations\n67.3 \n47.4 \n19.9 \n42 \nOther\n19.3 \n(43.7)\n63.0 \n144 \n       Total\n$\n213.1 \n$\n100.3 \n$\n112.8 \n112 \nThe amount of amortization of acquired intangibles and purchased intellectual property by segment is as follows:\nThree Months Ended \n September 30,\nChange\n2025\n2024\n$\n%\n($ in millions)\nInvestor Communication Solutions\n$\n9.8 \n$\n11.6 \n$\n(1.8)\n(16)\nGlobal Technology and Operations\n41.0 \n36.6 \n4.4 \n12 \n       Total\n$\n50.8 \n$\n48.2 \n$\n2.6 \n5 \n41\nTable of \nContents\nInvestor Communication Solutions \nRevenues for the three months ended September 30, 2025 increased $114.3 million to $1,130.0 million from $1,015.6 million, and earnings before income taxes increased $29.9 million to $126.4 million from $96.5 million.\nThree Months Ended \n September 30,\nChange\n2025\n2024\n$\n%\n($ in millions)\nRevenues\nRecurring revenues\n$\n518.0\n$\n493.1\n$\n24.9 \n5 \nEvent-driven revenues\n113.8\n63.0\n50.8 \n81 \nDistribution revenues\n498.1\n459.5\n38.6 \n8 \n       Total\n$\n1,130.0\n$\n1,015.6\n$\n114.3 \n11 \nEarnings Before Income Taxes\nEarnings before income taxes\n$\n126.4\n$\n96.5\n$\n29.9 \n31 \nPre-tax Margin\n11.2 \n%\n9.5 \n%\nThree Months Ended September 30, 2025\nPoints of Growth\nNet New Business\nInternal Growth\nAcquisitions\nForeign Exchange\nTotal\nRecurring revenue Growth Drivers\n4pts\n0pts\n1pt\n0pts\n5 \n%\nFor the three months ended September 30, 2025:\n•\nRecurring revenues increased $24.9 million, or 5%, to $518.0 million. Recurring revenue growth constant currency (Non-GAAP) was 5%, driven by 4pts of Net New Business and 1pt from acquisitions.\n•\nBy product line, Recurring revenue growth and Recurring revenue growth constant currency (Non-GAAP) were as follows:\n◦\nRegulatory rose 4% and 4%, respectively. Equity revenue position growth was 7% and Mutual fund/ETF position growth was 2%.\n◦\nData-driven fund solutions rose 3% and 2%, respectively, driven by growth in retirement and workplace products.\n◦\nIssuer rose 6% and 6%, respectively, driven by growth in disclosure solutions and shareholder engagement solutions.\n◦\nCustomer communications rose 8% and 8%, respectively, driven by organic growth in digital and print revenues, as well as the acquisition of Signal.\n•\nEvent-driven revenues increased $50.8 million, or 81%, driven by a higher volume of mutual fund proxy communications.\n \n•\nDistribution revenues increased $38.6 million, or 8%, primarily driven by the postage rate increase of approximately $25 million and higher Event-driven mailings.\n•\nEarnings before income taxes increased $29.9 million, or 31%, to $126.4 million, driven by higher Recurring and Event-driven revenues. Operating expenses rose 9%, or $84.4 million to $1,003.5 million driven by the impact of the postage rate increase and volume-related expenses.\n•\nPre-tax margins increased by 1.7% to 11.2% from 9.5%.  \n42\nTable of \nContents\nGlobal Technology and Operations\nRevenues for the three months ended September 30, 2025 increased $52.3 million to $459.5 million from $407.2 million, and Earnings before income taxes increased $19.9 million to $67.3 million from $47.4 million.\nThree Months Ended \n September 30,\nChange\n2025\n2024\n$\n%\n($ in millions)\nRevenues\nRecurring revenues\n$\n459.5\n$\n407.2\n$\n52.3 \n13 \nEarnings Before Income Taxes\nEarnings before income taxes\n$\n67.3\n$\n47.4\n$\n19.9 \n42 \nPre-tax Margin\n14.6 \n%\n11.6 \n%\nThree Months Ended September 30, 2025\nPoints of Growth\nNet New Business\nInternal Growth\nAcquisitions\nForeign Exchange\nTotal\nRecurring revenue Growth Drivers\n2pts\n4pts\n6pts\n1pt\n13 \n%\nFor the three months ended September 30, 2025:\n•\nRecurring revenues increased $52.3 million, or 13%, to $459.5 million. Recurring revenue growth constant currency (Non-GAAP) was 12%, driven by 6pts from the acquisition of SIS and 6pts of organic growth.  \n•\nBy product line, Recurring revenue growth and the corresponding Recurring revenue growth constant currency (Non-GAAP) were as follows: \n◦\nCapital Markets rose 8% and 6%, respectively, primarily driven by 5pts of revenue from new sales and 3pts of Internal Growth. Internal Growth included 1pt, or $3.7 million, from digital asset revenues.\n◦\nWealth and Investment Management rose 22% and 22%, respectively, driven by 17pts from the SIS acquisition and 5pts of organic growth.\n•\nEarnings before income taxes increased $19.9 million, or 42%, to $67.3 million, as higher revenues more than offset higher expenses, including the impact of the SIS acquisition. \n•\nPre-tax margins increased by 3.0% to 14.6% from 11.6%. \nOther\n Earnings before income taxes were $19.3 million for the three months ended September 30, 2025, an increase of $63.0 million compared to Loss before income taxes of $43.7 million for the three months ended September 30, 2024. \n•\nThe increased Earnings before income taxes for the three months ended September 30, 2025 was primarily due to an unrealized gain on digital assets of $45.8 million and an $8.1 million decline in Interest expense, net.\nExplanation and Reconciliation of the Company’s Use of Non-GAAP Financial Measures\nThe Company’s results in this Quarterly Report on Form 10-Q are presented in accordance with U.S. GAAP except where otherwise noted. In certain circumstances, Non-GAAP results have been presented. These Non-GAAP measures are Adjusted Operating income, Adjusted Operating income margin, Adjusted Net earnings, Adjusted earnings per share, Free cash flow and Recurring revenue growth constant currency. These Non-GAAP financial measures should be viewed in addition to, and not as a substitute for, the Company’s reported results.\n43\nTable of \nContents\nThe Company believes our Non-GAAP financial measures help investors understand how management plans, measures and evaluates the Company’s business performance. Management believes that Non-GAAP measures provide consistency in its financial reporting and facilitates investors’ understanding of the Company’s operating results and trends by providing an additional basis for comparison. Management uses these Non-GAAP financial measures to, among other things, evaluate our ongoing operations, and for internal planning and forecasting purposes. In addition, and as a consequence of the importance of these Non-GAAP financial measures in managing our business, the Company’s Compensation Committee of the Board of Directors incorporates Non-GAAP financial measures in the evaluation process for determining management compensation.\nAdjusted Operating Income, Adjusted Operating Income Margin, Adjusted Net Earnings and Adjusted Earnings Per Share\nThese Non-GAAP measures are adjusted to exclude the impact of certain costs, expenses, gains and losses and other specified items, the exclusion of which management believes provides insight regarding our ongoing operating performance. Depending on the period presented, these adjusted measures exclude the impact of certain of the following items: \n(i) Amortization of Acquired Intangibles and Purchased Intellectual Property, which represent non-cash amortization expenses associated with the Company’s acquisition activities.\n(ii) Acquisition and Integration Costs, which represent certain transaction and integration costs associated with the Company’s acquisition activities.\n(iii) Restructuring and Other Related Costs, which represent costs associated with the Company’s Corporate Restructuring Initiative to exit and/or realign some of our businesses, streamline the Company’s management structure, reallocate work to lower cost locations, and reduce headcount in deprioritized areas, in addition to other restructuring activities. \n(iv) Unrealized Gains or Losses on Digital Assets, which represents the quarterly mark to market gain or loss recorded to remeasure the Company’s digital asset holdings in the form of Canton Coins to fair market value. Refer to Note 1, “Basis of Presentation” for further details. Refer to Note 7, “Fair Value of Financial Instruments” for details related to realized and unrealized gains or losses.\nWe exclude Acquisition and Integration Costs, Restructuring and Other Related Costs, and Unrealized Gains or Losses on Digital Assets from our Adjusted Operating income (as applicable) and other adjusted earnings measures because excluding such information provides us with an understanding of the results from the primary operations of our business and enhances comparability across fiscal reporting periods, as these items are not reflective of our underlying operations or performance. \nWe also exclude the impact of Amortization of Acquired Intangibles and Purchased Intellectual Property, as these non-cash amounts are significantly impacted by the timing and size of individual acquisitions and do not factor into the Company's capital allocation decisions, management compensation metrics or multi-year objectives. Furthermore, management believes that this adjustment enables better comparison of our results as Amortization of Acquired Intangibles and Purchased Intellectual Property will not recur in future periods once such intangible assets have been fully amortized. Although we exclude Amortization of Acquired Intangibles and Purchased Intellectual Property from our adjusted earnings measures, our management believes that it is important for investors to understand that these intangible assets contribute to revenue generation. Amortization of intangible assets that relate to past acquisitions will recur in future periods until such intangible assets have been fully amortized. Any future acquisitions may result in the amortization of additional intangible assets.\nFree Cash Flow\nIn addition to the Non-GAAP financial measures discussed above, we provide Free cash flow information because we consider Free cash flow to be a liquidity measure that provides useful information to management and investors about the amount of cash generated that could be used for dividends, share repurchases, strategic acquisitions, other investments, as well as debt servicing. Free cash flow is a Non-GAAP financial measure and is defined by the Company as Net cash flows provided by operating activities less Capital expenditures as well as Software purchases and capitalized internal use software.\nRecurring Revenue Growth Constant Currency\nAs a multi-national company, we are subject to variability of our reported U.S. dollar results due to changes in foreign currency exchange rates. The exclusion of the impact of foreign currency exchange fluctuations from our Recurring revenue growth, or what we refer to as amounts expressed “on a constant currency basis,” is a Non-GAAP measure. We believe that excluding the impact of foreign currency exchange fluctuations from our Recurring revenue growth provides additional information that enables enhanced comparison to prior periods.    \nChanges in Recurring revenue growth expressed on a constant currency basis are presented excluding the impact of foreign currency exchange fluctuations. To present this information, current period results for entities reporting in currencies other than the U.S. dollar are translated into U.S. dollars at the average exchange rates in effect during the corresponding period of the comparative year, rather than at the actual average exchange rates in effect during the current fiscal year.             \n44\nTable of \nContents\nReconciliation of Non-GAAP measures to the most directly comparable GAAP measures (unaudited)\nThree Months Ended \n September 30,\n2025\n2024\n(in millions)\nOperating income (GAAP)\n$\n188.8\n$\n134.4\nAdjustments:\nAmortization of Acquired Intangibles and Purchased Intellectual Property\n50.8\n48.2\n       Acquisition and Integration Costs\n7.2\n2.2\n       Restructuring and Other Related Costs (a)\n4.4\n—\nAdjusted Operating income (Non-GAAP)\n$\n251.2\n$\n184.8\nOperating income margin (GAAP)\n11.9\n%\n9.4\n%\nAdjusted Operating income margin (Non-GAAP)\n15.8\n%\n13.0\n%\nThree Months Ended \n September 30,\n2025\n2024\n(in millions)\nNet earnings (GAAP)\n$\n165.4 \n$\n79.8 \nAdjustments:\nAmortization of Acquired Intangibles and Purchased Intellectual Property\n50.8 \n48.2 \n       Acquisition and Integration Costs\n7.2 \n2.2 \n       Restructuring and Other Related Costs (a)\n4.4 \n— \n       Unrealized Gains or Losses on Digital Assets\n(45.8)\n— \n            Subtotal of adjustments\n16.6 \n50.3 \n       Tax impact of adjustments (b)\n(3.9)\n(11.9)\nAdjusted Net earnings (Non-GAAP)\n$\n178.1 \n$\n118.3 \nThree Months Ended \n September 30,\n2025\n2024\nDiluted earnings per share (GAAP)\n$\n1.40 \n$\n0.68 \nAdjustments:\nAmortization of Acquired Intangibles and Purchased Intellectual Property\n0.43 \n0.41 \n       Acquisition and Integration Costs\n0.06 \n0.02 \n       Restructuring and Other Related Costs (a)\n0.04 \n— \n       Unrealized Gains or Losses on Digital Assets\n(0.39)\n— \n            Subtotal of adjustments\n0.14 \n0.43 \n       Tax impact of adjustments (b)\n(0.03)\n(0.10)\nAdjusted earnings per share (Non-GAAP)\n$\n1.51 \n$\n1.00 \n(a) Restructuring and Other Related Costs for the three months ended September 30, 2025 consists of severance and other costs related to the closure of substantially all operations of a production facility. Costs incurred are not reflected in segment profit and are recorded within Corporate and Other. The total estimated pre-tax costs for actions and associated costs related to the closure are approximately $20 million to $25 million and are expected to be completed by the end of the second quarter of fiscal year 2026. \n45\nTable of \nContents\n(b) Calculated using the GAAP effective tax rate, adjusted to exclude $1.9 million and $3.1 million of excess tax benefits associated with stock-based compensation for the three months ended September 30, 2025 and 2024, respectively. For purposes of calculating the Adjusted earnings per share, the same adjustments were made on a per share basis.\nThree Months Ended \n September 30,\n2025\n2024\n(in millions)\nNet cash flows from operating activities (GAAP)\n$\n42.3 \n$\n(125.5)\nCapital expenditures and Software purchases and capitalized internal use software\n(29.6)\n(32.1)\n     Free cash flow (Non-GAAP)\n$\n12.7 \n$\n(157.6)\nThree Months Ended September 30, 2025\n \nInvestor Communication Solutions\nRegulatory \nData-Driven Fund Solutions\nIssuer\nCustomer Communications\n \nTotal\nRecurring revenue growth (GAAP)\n4\n%\n3\n%\n6\n%\n8\n%\n5\n%\nImpact of foreign currency exchange\n0\n%\n(1\n%)\n0\n%\n0\n%\n0\n%\nRecurring revenue growth constant currency (Non-GAAP)\n4\n%\n2\n%\n6\n%\n8\n%\n5\n%\nThree Months Ended September 30, 2025\n \nGlobal Technology and Operations\nCapital Markets\nWealth and Investment Management\nTotal\nRecurring revenue growth (GAAP)\n8\n%\n22\n%\n13\n%\nImpact of foreign currency exchange\n(1\n%)\n0\n%\n(1\n%)\nRecurring revenue growth constant currency (Non-GAAP)\n6\n%\n22\n%\n12\n%\nThree Months Ended September 30, 2025\n \nConsolidated\nTotal\nRecurring revenue growth (GAAP)\n9\n%\nImpact of foreign currency exchange\n(1\n%)\nRecurring revenue growth constant currency (Non-GAAP)\n8\n%\n46\nTable of \nContents\nFinancial Condition, Liquidity and Capital Resources\nCash and cash equivalents consisted of the following:\nSeptember 30, 2025\nJune 30, 2025\n(in millions)\nCash and cash equivalents:\nDomestic cash\n$\n42.4 \n$\n326.2 \nCash held by foreign subsidiaries\n181.4 \n174.6 \nCash held by regulated entities\n67.0 \n60.7 \n     Total cash and cash equivalents\n$\n290.7 \n$\n561.5 \nAt September 30, 2025, Cash and cash equivalents were $290.7 million and Total stockholders’ equity was $2,635.1 million. At the current time, and in future periods, we expect cash generated by our operations, together with existing cash, cash equivalents, and borrowings from the capital markets, to be sufficient to cover cash needs for working capital, capital expenditures, strategic acquisitions, dividends and common stock repurchases. \nWe expect existing domestic cash, cash equivalents, cash flows from operations and borrowing capacity to continue to be sufficient to fund our domestic operating activities and cash commitments for investing and financing activities, such as regular quarterly dividends, debt repayment schedules, and material capital expenditures, for at least the next 12 months and thereafter for the foreseeable future. In addition, we expect existing foreign cash, cash equivalents, cash flows from operations and borrowing capacity to continue to be sufficient to fund our foreign operating activities and cash commitments for investing activities, such as material capital expenditures, for at least the next 12 months and thereafter for the foreseeable future. If these funds are needed for our operations in the U.S., we may be required to pay additional foreign taxes to repatriate these funds. However, while we may do so at a future date, the Company does not need to repatriate future foreign earnings to fund U.S. operations.\n47\nTable of \nContents\nOutstanding borrowings and available capacity under the Company’s borrowing arrangements were as follows:\nExpiration\nDate\nPrincipal amount outstanding at September 30, 2025\nCarrying value at September 30, 2025\nCarrying value at June 30, 2025\nUnused\nAvailable\nCapacity\nFair Value at September 30, 2025\n(in millions)\nCurrent portion of long-term debt\nFiscal 2016 Senior Notes\nJune 2026\n$\n500.0 \n$\n499.5 \n$\n499.3 \n$\n— \n$\n497.5 \n             Total\n$\n500.0 \n$\n499.5 \n$\n499.3 \n$\n— \n$\n497.5 \nLong-term debt, excluding current portion\nFiscal 2025 Revolving Credit Facility:\n       U.S. dollar tranche\nDecember 2029\n$\n160.0 \n$\n160.0 \n$\n— \n$\n840.0 \n$\n160.0 \n       Multicurrency tranche\nDecember 2029\n134.1 \n134.1 \n133.5 \n365.9 \n134.1 \n             Total Revolving Credit Facility\n$\n294.1 \n$\n294.1 \n$\n133.5 \n$\n1,205.9 \n$\n294.1 \nFiscal 2026 Term Loan\nAugust 2030\n$\n750.0 \n$\n746.9 \n$\n879.1 \n$\n— \n$\n750.0 \nFiscal 2020 Senior Notes\nDecember 2029\n750.0 \n746.2 \n746.0 \n— \n708.8 \nFiscal 2021 Senior Notes\nMay 2031\n1,000.0 \n994.6 \n994.4 \n— \n904.2 \n             Total Senior Notes\n$\n1,750.0 \n$\n1,740.8 \n$\n1,740.3 \n$\n— \n$\n1,613.0 \n             Total long-term debt\n$\n2,794.1 \n$\n2,781.8 \n$\n2,753.0 \n$\n1,205.9 \n$\n2,657.0 \n             Total debt\n$\n3,294.1 \n$\n3,281.3 \n$\n3,252.3 \n$\n1,205.9 \n$\n3,154.5 \nFuture principal payments on our outstanding debt are as follows:\nYears ending June 30,\n2026\n2027\n2028\n2029\n2030\nThereafter\nTotal\n(in millions)\n$\n500.0 \n$\n— \n$\n— \n$\n— \n$\n1,044.1 \n$\n1,750.0 \n$\n3,294.1 \nThe Fiscal 2025 Revolving Credit Facility, Fiscal 2026 Term Loan, Fiscal 2016 Senior Notes, Fiscal 2020 Senior Notes and Fiscal 2021 Senior Notes are senior unsecured obligations of the Company and are ranked equally in right of payment.\nPlease refer to Note 11, “Borrowings” to our Condensed Consolidated Financial Statements in Item 1. of Part I of this Quarterly Report on Form 10-Q for a more detailed discussion. \n48\nTable of \nContents\nCash Flows\nThree Months Ended \n September 30,\nChange\n2025\n2024\n$\n(in millions)\nNet cash flows from operating activities\n$\n42.3 \n$\n(125.5)\n$\n167.8 \nNet cash flows from investing activities\n(100.0)\n(40.1)\n(59.9)\nNet cash flows from financing activities\n(214.2)\n151.8 \n(366.0)\nEffect of exchange rate changes on Cash and cash equivalents\n1.1 \n2.1 \n(1.1)\nNet change in Cash and cash equivalents\n$\n(270.8)\n$\n(11.6)\n$\n(259.2)\nFree cash flow:\nNet cash flows from operating activities (GAAP)\n$\n42.3 \n$\n(125.5)\n$\n167.8 \nCapital expenditures and Software purchases and capitalized internal use software\n(29.6)\n(32.1)\n2.5 \n     Free cash flow (Non-GAAP)\n$\n12.7 \n$\n(157.6)\n$\n170.3 \nThe increase in cash from operating activities of $167.8 million in the three months ended September 30, 2025, as compared to the three months ended September 30, 2024, was due to an increase in Net earnings of $85.6 million, a decrease in cash used for Accounts payable, accrued expenses and taxes payable of $141.9 million, all included in the change in Payables and accrued expenses, partially offset by an increase in accounts receivable of $45.0 million. \n \nThe decrease in cash from investing activities of $59.9 million in the three months ended September 30, 2025, as compared to the three months ended September 30, 2024, was primarily driven by increased acquisition spend of $47.8 million and an increase in cash used for other investing activities of $14.6 million.\nThe decrease in cash from financing activities of $366.0 million in the three months ended September 30, 2025, as compared to the three months ended September 30, 2024, primarily reflects a decrease in net borrowings of $202.6 million, an increase in cash used for stock buybacks of $150.2 million, and an increase in dividends paid of $9.7 million.\nSeasonality\nProcessing and distributing proxy materials and annual reports to investors comprises a large portion of our Investor Communication Solutions business. We process and distribute the greatest number of proxy materials and annual reports during our third and fourth fiscal quarters. The recurring periodic activity of this business is linked to significant filing deadlines imposed by law on public reporting companies. This has caused our revenues, operating income, net earnings, and cash flows from operating activities to be higher in our third and fourth fiscal quarters. The seasonality of our revenues makes it difficult to estimate future operating results based on the results of any specific fiscal quarter and could affect an investor’s ability to compare our financial condition, results of operations, and cash flows on a fiscal quarter-by-quarter basis. \nContractual Obligations\nData Center Agreements\nThe Company is a party to an Amended and Restated IT Services Agreement with Kyndryl, Inc. (“Kyndryl”), an entity formed by IBM’s spin-off of its managed infrastructure services business, under which Kyndryl provides certain aspects of the Company’s information technology infrastructure, including supporting its mainframe, midrange, network and data center operations, as well as providing disaster recovery services. The Amended and Restated IT Services Agreement expires on June 30, 2027, however the Company may renew the agreement for up to one additional 12-month period. Fixed minimum commitments remaining under the Amended and Restated IT Services Agreement at September 30, 2025 are $53.3 million through June 30, 2027, the final year of the Amended and Restated IT Services Agreement.\nBroadridge Software Limited, a subsidiary of the Company is party to the SIS Services Agreement with Kyndryl Canada, under which Kyndryl Canada provides infrastructure managed services for the SIS Business. The SIS Services Agreement expires on October 31, 2029. Fixed minimum commitments remaining under the SIS Services Agreement at December 31, 2024 are $129.9 million through October 31, 2029, the final year of the SIS Services Agreement.\n49\nTable of \nContents\nThe Company is a party to an information technology agreement for private cloud services (the “Private Cloud Agreement”) under which Kyndryl operates, manages and supports the Company’s private cloud global distributed platforms and products, and operates and manages certain Company networks. The Private Cloud Agreement expires on March 31, 2030. Fixed minimum commitments remaining under the Private Cloud Agreement at September 30, 2025 are $74.2 million through March 31, 2030, the final year of the contract.\nCloud Services Resale Agreement\nOn December 31, 2021, the Company and Presidio Networked Solutions LLC (“Presidio”), a reseller of services of Amazon Web Services, Inc. and its affiliates (collectively, “AWS”), entered into an Order Form and AWS Private Pricing Addendum, dated December 31, 2021 (the “Order Form”), to the Cloud Services Resale Agreement, dated December 15, 2017, as amended (together with the Order Form, the “AWS Cloud Agreement”), whereby Presidio will resell to the Company certain public cloud infrastructure and related services provided by AWS for the operation, management and support of the Company’s cloud global distributed platforms and products. The AWS Cloud Agreement expires on December 31, 2026. Fixed minimum commitments remaining under the AWS Cloud Agreement at September 30, 2025 are $70.1 million through December 31, 2026.\nOther\nThe Company has an equity method investment that is a variable interest in a variable interest entity. The Company is not the primary beneficiary and therefore does not consolidate the investee. The Company’s potential maximum loss exposure related to its unconsolidated investments in this variable interest entity totaled $28.6 million as of September 30, 2025, which represents the carrying value of the Company's investments. \nIn addition, as of September 30, 2025, the Company has future commitments to fund $16.8 million to the Company’s other investees.\nOther Commercial Agreements\nCertain of the Company’s subsidiaries established unsecured, uncommitted lines of credit with banks. There were no outstanding borrowings under these lines of credit at September 30, 2025.\nOff-balance Sheet Arrangements\nIt is not our business practice to enter into off-balance sheet arrangements. However, we are exposed to market risk from changes in foreign currency exchange rates that could impact our financial position, results of operations, and cash flows. We manage our exposure to these market risks through regular operating and financing activities and, when deemed appropriate, through the use of derivative financial instruments.\nIn January 2022, we executed a series of cross-currency swap derivative contracts with an aggregate notional amount of EUR 880 million which are designated as net investment hedges to hedge a portion of our net investment in our subsidiaries whose functional currency is the Euro. The cross-currency swap derivative contracts are agreements to pay fixed-rate interest in Euros and receive fixed-rate interest in U.S. Dollars, thereby effectively converting a portion of our U.S. Dollar denominated fixed-rate debt into Euro denominated fixed-rate debt. The cross-currency swaps mature in May 2031 to coincide with the maturity of the Fiscal 2021 Senior Notes. Accordingly, foreign currency transaction gains or losses on the qualifying net investment hedge instruments are recorded as foreign currency translation within other comprehensive income (loss), net in the Condensed Consolidated Statements of Comprehensive Income and will remain in Accumulated other comprehensive income (loss) in the Condensed Consolidated Balance Sheets until the sale or complete liquidation of the underlying foreign subsidiary. At September 30, 2025, our position on the cross-currency swaps was a liability of $15.3 million, and is recorded as part of Other non-current liabilities on the Condensed Consolidated Balance Sheets with the offsetting amount recorded as part of Accumulated other comprehensive income (loss), net of tax. We have elected the spot method of accounting whereby the net interest savings from the cross-currency swaps is recognized as a reduction in interest expense in our Condensed Consolidated Statements of Earnings.  \nIn May 2021, we settled a forward treasury lock agreement that was designated as a cash flow hedge, for a pre-tax loss of $11.0 million, after which the final settlement loss is being amortized into Interest expense, net ratably over the ten year term of the Fiscal 2021 Senior Notes.\n \nThe expected amount of the existing loss that will be amortized into earnings before income taxes within the next twelve months is approximately $1.1 million.\nIn the normal course of business, we also enter into contracts in which it makes representations and warranties that relate to the performance of our products and services. We do not expect any material losses related to such representations and warranties, or collateral arrangements.\n50\nTable of \nContents\nRecently-issued Accounting Pronouncements\nPlease refer to Note 2, “New Accounting Pronouncements” to our Condensed Consolidated Financial Statements under Item 1. of Part I of this Quarterly Report on Form 10-Q, for a discussion on the impact of new accounting pronouncements.\n51\nTable of \nContents"
}