{
  "source_file": "brka-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2. Management’s Discussion and Analysis of \nFinancial Condition and Results of Operations\n \nResults of Operations\n \nNet earnings attributable to Berkshire shareholders are disaggregated in the table that follows. Amounts are after deducting income taxes and exclude earnings attributable to noncontrolling interests (in millions).\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\nThird Quarter\n\n\n \n\n\n \n\n\nFirst Nine Months\n\n\n \n\n\n\n\n\n\n \n\n\n2025\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2025\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n\n\n\n\nInsurance – underwriting\n\n\n$\n\n\n2,369\n\n\n \n\n\n \n\n\n$\n\n\n750\n\n\n \n\n\n \n\n\n$\n\n\n5,697\n\n\n \n\n\n \n\n\n$\n\n\n5,611\n\n\n \n\n\n\n\n\n\nInsurance – investment income\n\n\n \n\n\n3,181\n\n\n \n\n\n \n\n\n \n\n\n3,664\n\n\n \n\n\n \n\n\n \n\n\n9,441\n\n\n \n\n\n \n\n\n \n\n\n9,582\n\n\n \n\n\n\n\n\n\nBNSF\n\n\n \n\n\n1,449\n\n\n \n\n\n \n\n\n \n\n\n1,383\n\n\n \n\n\n \n\n\n \n\n\n4,129\n\n\n \n\n\n \n\n\n \n\n\n3,753\n\n\n \n\n\n\n\n\n\nBerkshire Hathaway Energy (“BHE”)\n\n\n \n\n\n1,489\n\n\n \n\n\n \n\n\n \n\n\n1,629\n\n\n \n\n\n \n\n\n \n\n\n3,288\n\n\n \n\n\n \n\n\n \n\n\n3,001\n\n\n \n\n\n\n\n\n\nManufacturing, service and retailing\n\n\n \n\n\n3,616\n\n\n \n\n\n \n\n\n \n\n\n3,342\n\n\n \n\n\n \n\n\n \n\n\n10,277\n\n\n \n\n\n \n\n\n \n\n\n9,810\n\n\n \n\n\n\n\n\n\nInvestment gains (losses)\n\n\n \n\n\n17,311\n\n\n \n\n\n \n\n\n \n\n\n16,161\n\n\n \n\n\n \n\n\n \n\n\n17,243\n\n\n \n\n\n \n\n\n \n\n\n36,391\n\n\n \n\n\n\n\n\n\nOther-than-temporary impairment of investment in Kraft Heinz\n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n(3,760\n\n\n)\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n\n\n\n\nOther\n\n\n \n\n\n1,381\n\n\n \n\n\n \n\n\n \n\n\n(678\n\n\n)\n\n\n \n\n\n \n\n\n1,454\n\n\n \n\n\n \n\n\n \n\n\n1,153\n\n\n \n\n\n\n\n\n\nNet earnings attributable to Berkshire shareholders\n\n\n$\n\n\n30,796\n\n\n \n\n\n \n\n\n$\n\n\n26,251\n\n\n \n\n\n \n\n\n$\n\n\n47,769\n\n\n \n\n\n \n\n\n$\n\n\n69,301\n\n\n \n\n\n\n\nThrough our subsidiaries, we engage in numerous diverse business activities. The business segment data (Note 24 to the accompanying Consolidated Financial Statements and Note 26 to the Consolidated Financial Statements included in Form 10-K for the year ended December 31, 2024) should be read in conjunction with this discussion.\n \nOur periodic operating results may be affected in future periods by the impacts of ongoing macroeconomic and geopolitical conflicts and events, as well as changes in industry or company-specific factors or events. These events, including tensions from developing international trade policies and tariffs, accelerated through the first nine months of 2025. Considerable uncertainty remains as to the ultimate outcome of these events. We are currently unable to reliably predict the ultimate impact on our businesses, whether through changes in the availability of products, supply chain costs and efficiency, and customer demand for our products and services. It is reasonably possible there could be adverse consequences on our operating businesses, as well as on our investments in equity securities, which could significantly affect our future results.\n \nAfter-tax insurance underwriting earnings increased $1.6 billion in the third quarter and $86 million in the first nine months of 2025 compared to the same periods in 2024. The comparative earnings increase in the third quarter was primarily attributable to lower incurred losses from current year significant catastrophe events and from prior accident years’ claims, as well as the impact of accruals in the third quarter of 2024 in connection with a bankruptcy settlement. Underwriting results in the first nine months of 2025 included after-tax losses of approximately $850 million from the Southern California wildfires, which occurred in the first quarter. After-tax earnings from insurance investment income declined $483 million (13.2%) in the third quarter and $141 million (1.5%) in the first nine months of 2025 compared to 2024, primarily attributable to lower interest rates, as well as the impact of capital distributions to Berkshire in the fourth quarter of 2024. The subsequent investment income earned on such distributions is included in “other” earnings in the above table.\n \nAfter-tax earnings of BNSF increased $66 million (4.8%) in the third quarter and $376 million (10.0%) in the first nine months of 2025 compared to 2024, primarily from core pricing gains, improved operating efficiencies and lower effective income tax rates. After-tax earnings of BHE declined $140 million (8.6%) in the third quarter and increased $287 million (9.6%) in the first nine months of 2025 compared to 2024. The earnings in the third quarter of 2025 were lower in the U.S. utilities, natural gas pipelines and other energy businesses, partially offset by lower earnings attributable to noncontrolling interests. Earnings in the first nine months of 2025 included lower wildfire-related and real estate brokerage litigation accruals compared to 2024.\n \nAfter-tax earnings from our manufacturing, service and retailing businesses increased $274 million (8.2%) in the third quarter and $467 million (4.8%) in the first nine months of 2025 compared to 2024. Results among our numerous operations were mixed.\n \nInvestment gains (losses) can include significant unrealized gains and losses from changes in market prices of our investments in equity securities and in foreign currency exchange rates applicable to certain of our investments. We believe that investment gains and losses, whether realized from dispositions or unrealized from changes in market prices and exchange rates, are generally meaningless in understanding our reported periodic results or evaluating our periodic economic performance. These gains and losses have caused and will continue to cause significant volatility in our periodic earnings.\n \n\n\n34\n\n\n\n\n \n\n\nItem 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations\n \nResults of Operations\n \nAfter-tax other earnings include corporate investment income not allocated to operating businesses, earnings from equity method investments (excluding the other-than-temporary impairment loss recognized in the second quarter of 2025 on Berkshire’s investment in Kraft Heinz) and foreign currency exchange rate gains and losses related to Berkshire and BHFC non-U.S. Dollar denominated debt. After-tax corporate investment income increased $533 million in the third quarter and $1.6 billion in the first nine months of 2025 compared to 2024, primarily attributable to the impact of increased investments derived from subsidiary capital distributions to Berkshire. Foreign currency exchange rate changes on the non-U.S. Dollar denominated debt produced after-tax gains of $331 million in the third quarter and after-tax losses of $1.3 billion in the first nine months of 2025 compared to after-tax losses of $1.1 billion in the third quarter and $98 million in the first nine months of 2024.\n \nInsurance—Underwriting\n \nOur periodic underwriting earnings may be subject to considerable volatility from the timing and magnitude of significant property catastrophe loss events. We currently consider consolidated pre-tax losses exceeding $150 million from an event occurring in the current year to be significant. We incurred significant losses from the Southern California wildfires in the first quarter of 2025 and from Hurricane Helene in the third quarter of 2024. Changes in estimates for unpaid losses and loss adjustment expenses, including amounts established for occurrences in prior years, and foreign currency transaction gains and losses arising from the remeasurement of non-U.S. Dollar denominated assets and liabilities can also significantly affect our periodic underwriting results.\n \nWe write primary insurance and reinsurance policies covering property and casualty risks, as well as life and health risks. Our insurance and reinsurance businesses are GEICO, Berkshire Hathaway Primary Group (“BH Primary”) and Berkshire Hathaway Reinsurance Group (“BHRG”). We strive to generate pre-tax underwriting earnings (defined as premiums earned less insurance losses/benefits incurred and underwriting expenses) over the long term in all business categories, except in our retroactive reinsurance and periodic payment annuity businesses. Time-value-of-money concepts are important considerations in establishing premiums for these policies, which are recognized as charges to earnings over the claim settlement periods.\n \nUnderwriting results of our insurance businesses are summarized below (dollars in millions).\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\nThird Quarter\n\n\n \n\n\n \n\n\nFirst Nine Months\n\n\n \n\n\n\n\n\n\n \n\n\n2025\n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2025\n\n\n \n\n\n2024\n\n\n \n\n\n\n\n\n\nPre-tax underwriting earnings:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nGEICO\n\n\n$\n\n\n1,773\n\n\n \n\n\n$\n\n\n2,033\n\n\n \n\n\n \n\n\n$\n\n\n5,767\n\n\n \n\n\n$\n\n\n5,747\n\n\n \n\n\n\n\n\n\nBerkshire Hathaway Primary Group\n\n\n \n\n\n506\n\n\n \n\n\n \n\n\n(689\n\n\n)\n\n\n \n\n\n \n\n\n425\n\n\n \n\n\n \n\n\n76\n\n\n \n\n\n\n\n\n\nBerkshire Hathaway Reinsurance Group\n\n\n \n\n\n884\n\n\n \n\n\n \n\n\n(310\n\n\n)\n\n\n \n\n\n \n\n\n1,227\n\n\n \n\n\n \n\n\n1,384\n\n\n \n\n\n\n\n\n\nPre-tax underwriting earnings\n\n\n \n\n\n3,163\n\n\n \n\n\n \n\n\n1,034\n\n\n \n\n\n \n\n\n \n\n\n7,419\n\n\n \n\n\n \n\n\n7,207\n\n\n \n\n\n\n\n\n\nIncome taxes\n\n\n \n\n\n794\n\n\n \n\n\n \n\n\n284\n\n\n \n\n\n \n\n\n \n\n\n1,722\n\n\n \n\n\n \n\n\n1,596\n\n\n \n\n\n\n\n\n\nNet underwriting earnings\n\n\n$\n\n\n2,369\n\n\n \n\n\n$\n\n\n750\n\n\n \n\n\n \n\n\n$\n\n\n5,697\n\n\n \n\n\n$\n\n\n5,611\n\n\n \n\n\n\n\n\n\nEffective income tax rate\n\n\n \n\n\n25.1\n\n\n%\n\n\n \n\n\n27.5\n\n\n%\n\n\n \n\n\n \n\n\n23.2\n\n\n%\n\n\n \n\n\n22.1\n\n\n%\n\n\n\n\nGEICO\n \nGEICO writes property and casualty insurance policies, primarily private passenger automobile insurance, in all 50 states and the District of Columbia. GEICO offers its policies mainly by direct response methods where most customers apply for insurance coverage directly to the company. GEICO also operates an insurance agency that offers primarily homeowners and renters insurance to its auto policyholders. A summary of GEICO’s underwriting results follows (dollars in millions).\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\nThird Quarter\n\n\n \n\n\n \n\n\nFirst Nine Months\n\n\n \n\n\n\n\n\n\n \n\n\n2025\n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2025\n\n\n \n\n\n2024\n\n\n \n\n\n\n\n\n\n \n\n\nAmount\n\n\n \n\n\n%\n\n\n \n\n\nAmount\n\n\n \n\n\n%\n\n\n \n\n\n \n\n\nAmount\n\n\n \n\n\n%\n\n\n \n\n\nAmount\n\n\n \n\n\n%\n\n\n \n\n\n\n\n\n\nPremiums written\n\n\n$\n\n\n11,744\n\n\n \n\n\n \n\n\n \n\n\n$\n\n\n11,181\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n$\n\n\n34,253\n\n\n \n\n\n \n\n\n \n\n\n$\n\n\n32,435\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nPremiums earned\n\n\n$\n\n\n11,264\n\n\n \n\n\n \n\n\n100.0\n\n\n \n\n\n$\n\n\n10,699\n\n\n \n\n\n \n\n\n100.0\n\n\n \n\n\n \n\n\n$\n\n\n33,080\n\n\n \n\n\n \n\n\n100.0\n\n\n \n\n\n$\n\n\n31,402\n\n\n \n\n\n \n\n\n100.0\n\n\n \n\n\n\n\n\n\nLosses and loss adjustment expenses\n\n\n \n\n\n8,047\n\n\n \n\n\n \n\n\n71.5\n\n\n \n\n\n \n\n\n7,634\n\n\n \n\n\n \n\n\n71.4\n\n\n \n\n\n \n\n\n \n\n\n23,416\n\n\n \n\n\n \n\n\n70.8\n\n\n \n\n\n \n\n\n22,803\n\n\n \n\n\n \n\n\n72.6\n\n\n \n\n\n\n\n\n\nUnderwriting expenses\n\n\n \n\n\n1,444\n\n\n \n\n\n \n\n\n12.8\n\n\n \n\n\n \n\n\n1,032\n\n\n \n\n\n \n\n\n9.6\n\n\n \n\n\n \n\n\n \n\n\n3,897\n\n\n \n\n\n \n\n\n11.8\n\n\n \n\n\n \n\n\n2,852\n\n\n \n\n\n \n\n\n9.1\n\n\n \n\n\n\n\n\n\nTotal losses and expenses\n\n\n \n\n\n9,491\n\n\n \n\n\n \n\n\n84.3\n\n\n \n\n\n \n\n\n8,666\n\n\n \n\n\n \n\n\n81.0\n\n\n \n\n\n \n\n\n \n\n\n27,313\n\n\n \n\n\n \n\n\n82.6\n\n\n \n\n\n \n\n\n25,655\n\n\n \n\n\n \n\n\n81.7\n\n\n \n\n\n\n\n\n\nPre-tax underwriting earnings\n\n\n$\n\n\n1,773\n\n\n \n\n\n \n\n\n \n\n\n$\n\n\n2,033\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n$\n\n\n5,767\n\n\n \n\n\n \n\n\n \n\n\n$\n\n\n5,747\n\n\n \n\n\n \n\n\n \n\n\n\n\n \n\n\n35\n\n\n\n\n \n\n\nItem 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations\n \nInsurance—Underwriting\n \nGEICO\n \nPremiums written increased $563 million (5.0%) in the third quarter and $1.8 billion (5.6%) in the first nine months of 2025 compared to 2024, reflecting an increase in policies-in-force. Premiums earned increased $565 million (5.3%) in the third quarter and $1.7 billion (5.3%) in the first nine months of 2025 compared to 2024.\nLosses and loss adjustment expenses increased $413 million (5.4%) in the third quarter and $613 million (2.7%) in the first nine months of 2025 compared to 2024. GEICO’s loss ratio (losses and loss adjustment expenses to premiums earned) was 71.5% in the third quarter and 70.8% in the first nine months of 2025, an increase of 0.1 percentage points and a decrease of 1.8 percentage points, respectively, compared to the corresponding periods in 2024. The loss ratio decline in the first nine months reflected higher average earned premiums per policy, lower claims frequencies, lower catastrophe losses and more favorable development of prior accident years’ claims estimates, partially offset by increases in average claims severities. Losses and loss adjustment expenses from Hurricane Helene were approximately $260 million in the third quarter and first nine months of 2024.\n \nPrivate passenger automobile claims frequencies declined in the first nine months of 2025 versus 2024 for property damage and collision coverages (two to five percent range), with bodily injury coverage frequency increasing (two to five percent range). Average claims severities in the first nine months of 2025 increased for property damage and collision coverages (two to four percent range) and increased for bodily injury coverage (eleven to thirteen percent range) compared to 2024. Losses and loss adjustment expenses included reductions in the ultimate loss estimates for prior accident years’ claims of $495 million in the first nine months of 2025 compared to $339 million in 2024.\n \nUnderwriting expenses increased $412 million (39.9%) in the third quarter and $1.0 billion (36.6%) in the first nine months of 2025 compared to 2024. GEICO’s expense ratio (underwriting expense to premiums earned) was 11.8% in the first nine months of 2025, an increase of 2.7 percentage points compared to 2024. The increases were attributable to increased policy acquisition-related expenses. The earnings from GEICO’s insurance agency (third-party commissions, net of operating expenses) are included as a reduction of underwriting expenses.\nBerkshire Hathaway Primary Group\n \nBH Primary consists of several independently managed underwriting operations that provide a variety of primarily commercial insurance solutions, including healthcare professional liability, workers’ compensation, automobile, general liability, property and specialty coverages for small, medium and large clients. These operations include Berkshire Hathaway Specialty Insurance (“BHSI”), RSUI Group (“RSUI”), CapSpecialty, Berkshire Hathaway Homestate Companies (“BHHC”), MedPro Group (“MedPro”), GUARD Group (“GUARD”), National Indemnity Company (“NICO Primary”), Berkshire Hathaway Direct (“BH Direct”) and U.S. Liability Insurance Companies (“USLI”).\n \nA summary of BH Primary’s underwriting results follows (dollars in millions).\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\nThird Quarter\n\n\n \n\n\n \n\n\nFirst Nine Months\n\n\n \n\n\n\n\n\n\n \n\n\n2025\n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2025\n\n\n \n\n\n2024\n\n\n \n\n\n\n\n\n\n \n\n\nAmount\n\n\n \n\n\n%\n\n\n \n\n\nAmount\n\n\n \n\n\n%\n\n\n \n\n\n \n\n\nAmount\n\n\n \n\n\n%\n\n\n \n\n\nAmount\n\n\n \n\n\n%\n\n\n \n\n\n\n\n\n\nPremiums written\n\n\n$\n\n\n5,273\n\n\n \n\n\n \n\n\n \n\n\n$\n\n\n5,075\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n$\n\n\n14,516\n\n\n \n\n\n \n\n\n \n\n\n$\n\n\n14,499\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nPremiums earned\n\n\n$\n\n\n4,711\n\n\n \n\n\n \n\n\n100.0\n\n\n \n\n\n$\n\n\n4,685\n\n\n \n\n\n \n\n\n100.0\n\n\n \n\n\n \n\n\n$\n\n\n13,965\n\n\n \n\n\n \n\n\n100.0\n\n\n \n\n\n$\n\n\n13,882\n\n\n \n\n\n \n\n\n100.0\n\n\n \n\n\n\n\n\n\nLosses and loss adjustment expenses\n\n\n \n\n\n2,842\n\n\n \n\n\n \n\n\n60.3\n\n\n \n\n\n \n\n\n4,066\n\n\n \n\n\n \n\n\n86.8\n\n\n \n\n\n \n\n\n \n\n\n9,487\n\n\n \n\n\n \n\n\n67.9\n\n\n \n\n\n \n\n\n9,971\n\n\n \n\n\n \n\n\n71.8\n\n\n \n\n\n\n\n\n\nUnderwriting expenses\n\n\n \n\n\n1,363\n\n\n \n\n\n \n\n\n29.0\n\n\n \n\n\n \n\n\n1,308\n\n\n \n\n\n \n\n\n27.9\n\n\n \n\n\n \n\n\n \n\n\n4,053\n\n\n \n\n\n \n\n\n29.1\n\n\n \n\n\n \n\n\n3,835\n\n\n \n\n\n \n\n\n27.7\n\n\n \n\n\n\n\n\n\nTotal losses and expenses\n\n\n \n\n\n4,205\n\n\n \n\n\n \n\n\n89.3\n\n\n \n\n\n \n\n\n5,374\n\n\n \n\n\n \n\n\n114.7\n\n\n \n\n\n \n\n\n \n\n\n13,540\n\n\n \n\n\n \n\n\n97.0\n\n\n \n\n\n \n\n\n13,806\n\n\n \n\n\n \n\n\n99.5\n\n\n \n\n\n\n\n\n\nPre-tax underwriting earnings (loss)\n\n\n$\n\n\n506\n\n\n \n\n\n \n\n\n \n\n\n$\n\n\n(689\n\n\n)\n\n\n \n\n\n \n\n\n \n\n\n$\n\n\n425\n\n\n \n\n\n \n\n\n \n\n\n$\n\n\n76\n\n\n \n\n\n \n\n\n \n\n\n\n\nPremiums written increased 3.9% in the third quarter and were relatively unchanged in the first nine months of 2025 compared to 2024. Premiums written increased in each period at MedPro (primarily student health business), BHHC and NICO Primary (primarily commercial automobile business), BH Direct and USLI. The year-to-date increase was offset by declines in written premiums at GUARD (34.6%), RSUI and BHSI. The decline at GUARD was primarily due to policy-in-force and volume reductions across multiple product categories by continuing efforts to exit certain unprofitable lines and tightened underwriting standards that began in 2023.\n \n\n\n36\n\n\n\n\n \n\n\nItem 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations\n \nInsurance—Underwriting\n \nBerkshire Hathaway Primary Group\n \nLosses and loss adjustment expenses declined $1.2 billion (30.1%) in the third quarter and $484 million (4.9%) in the first nine months of 2025 compared to 2024, and the loss ratio declined 26.5 percentage points in the third quarter and 3.9 percentage points in the first nine months of 2025 compared to 2024. The comparative decline in the third quarter was primarily due to a reduction in ultimate loss estimates for prior accident years’ claims of $190 million in 2025 compared to an increase in ultimate loss estimates of $789 million in 2024. Prior accident years’ ultimate loss estimates increased $211 million in the first nine months of 2025 compared to $561 million in 2024. A significant portion of the year-to-date increases in 2024 and 2025 related to GUARD. Otherwise, the development of estimated ultimate claim liabilities for prior accident years in the first nine months of 2024 reflected lower-than-expected property, medical professional liability and workers’ compensation losses. Claim costs for liability coverages continue to be negatively impacted by unfavorable social inflation trends, including the impacts of jury awards and litigation costs.\n \nLosses incurred from significant catastrophe events in the first nine months of 2025 were approximately $305 million, attributable to the Southern California wildfires in the first quarter. Significant catastrophe losses in the first nine months of 2024 were approximately $80 million, which derived from Hurricane Helene in the third quarter.\n \nUnderwriting expenses increased $55 million (4.2%) in the third quarter and $218 million (5.7%) in the first nine months of 2025 compared to 2024. The expense ratio increased 1.1 percentage points in the third quarter and 1.4 percentage points in the first nine months of 2025 compared to 2024, which were primarily due to the impact of volume reductions at GUARD and business mix changes.\n \nBerkshire Hathaway Reinsurance Group\n \nThe Berkshire Hathaway Reinsurance Group (“BHRG”) offers excess-of-loss and quota-share reinsurance coverages on property and casualty risks to insurers and reinsurers worldwide through the NICO, General Re and TransRe Groups. We also write life and health reinsurance coverages through the General Re Group and Berkshire Hathaway Life Insurance Company of Nebraska. A summary of BHRG’s pre-tax underwriting results follows (in millions).\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\nThird Quarter\n\n\n \n\n\n \n\n\nFirst Nine Months\n\n\n \n\n\n\n\n\n\n \n\n\n2025\n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2025\n\n\n \n\n\n2024\n\n\n \n\n\n\n\n\n\nProperty/casualty\n\n\n$\n\n\n1,065\n\n\n \n\n\n$\n\n\n161\n\n\n \n\n\n \n\n\n$\n\n\n2,178\n\n\n \n\n\n$\n\n\n2,191\n\n\n \n\n\n\n\n\n\nLife/health\n\n\n \n\n\n50\n\n\n \n\n\n \n\n\n98\n\n\n \n\n\n \n\n\n \n\n\n172\n\n\n \n\n\n \n\n\n279\n\n\n \n\n\n\n\n\n\nRetroactive reinsurance\n\n\n \n\n\n(141\n\n\n)\n\n\n \n\n\n(265\n\n\n)\n\n\n \n\n\n \n\n\n(618\n\n\n)\n\n\n \n\n\n(573\n\n\n)\n\n\n\n\n\n\nPeriodic payment annuity\n\n\n \n\n\n(126\n\n\n)\n\n\n \n\n\n(229\n\n\n)\n\n\n \n\n\n \n\n\n(538\n\n\n)\n\n\n \n\n\n(543\n\n\n)\n\n\n\n\n\n\nVariable annuity\n\n\n \n\n\n36\n\n\n \n\n\n \n\n\n(75\n\n\n)\n\n\n \n\n\n \n\n\n33\n\n\n \n\n\n \n\n\n30\n\n\n \n\n\n\n\n\n\nPre-tax underwriting earnings (loss)\n\n\n$\n\n\n884\n\n\n \n\n\n$\n\n\n(310\n\n\n)\n\n\n \n\n\n$\n\n\n1,227\n\n\n \n\n\n$\n\n\n1,384\n\n\n \n\n\n\n\nProperty/casualty\n \nA summary of property/casualty reinsurance underwriting results follows (dollars in millions).\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\nThird Quarter\n\n\n \n\n\n \n\n\nFirst Nine Months\n\n\n \n\n\n\n\n\n\n \n\n\n2025\n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2025\n\n\n \n\n\n2024\n\n\n \n\n\n\n\n\n\n \n\n\nAmount\n\n\n \n\n\n%\n\n\n \n\n\nAmount\n\n\n \n\n\n%\n\n\n \n\n\n \n\n\nAmount\n\n\n \n\n\n%\n\n\n \n\n\nAmount\n\n\n \n\n\n%\n\n\n \n\n\n\n\n\n\nPremiums written\n\n\n$\n\n\n5,183\n\n\n \n\n\n \n\n\n \n\n\n$\n\n\n5,446\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n$\n\n\n16,340\n\n\n \n\n\n \n\n\n \n\n\n$\n\n\n17,448\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nPremiums earned\n\n\n$\n\n\n5,173\n\n\n \n\n\n \n\n\n100.0\n\n\n \n\n\n$\n\n\n5,453\n\n\n \n\n\n \n\n\n100.0\n\n\n \n\n\n \n\n\n$\n\n\n15,516\n\n\n \n\n\n \n\n\n100.0\n\n\n \n\n\n$\n\n\n16,496\n\n\n \n\n\n \n\n\n100.0\n\n\n \n\n\n\n\n\n\nLosses and loss adjustment expenses\n\n\n \n\n\n2,685\n\n\n \n\n\n \n\n\n51.9\n\n\n \n\n\n \n\n\n3,282\n\n\n \n\n\n \n\n\n60.2\n\n\n \n\n\n \n\n\n \n\n\n9,038\n\n\n \n\n\n \n\n\n58.2\n\n\n \n\n\n \n\n\n9,399\n\n\n \n\n\n \n\n\n57.0\n\n\n \n\n\n\n\n\n\nUnderwriting expenses\n\n\n \n\n\n1,423\n\n\n \n\n\n \n\n\n27.5\n\n\n \n\n\n \n\n\n2,010\n\n\n \n\n\n \n\n\n36.8\n\n\n \n\n\n \n\n\n \n\n\n4,300\n\n\n \n\n\n \n\n\n27.8\n\n\n \n\n\n \n\n\n4,906\n\n\n \n\n\n \n\n\n29.7\n\n\n \n\n\n\n\n\n\nTotal losses and expenses\n\n\n \n\n\n4,108\n\n\n \n\n\n \n\n\n79.4\n\n\n \n\n\n \n\n\n5,292\n\n\n \n\n\n \n\n\n97.0\n\n\n \n\n\n \n\n\n \n\n\n13,338\n\n\n \n\n\n \n\n\n86.0\n\n\n \n\n\n \n\n\n14,305\n\n\n \n\n\n \n\n\n86.7\n\n\n \n\n\n\n\n\n\nPre-tax underwriting earnings\n\n\n$\n\n\n1,065\n\n\n \n\n\n \n\n\n \n\n\n$\n\n\n161\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n$\n\n\n2,178\n\n\n \n\n\n \n\n\n \n\n\n$\n\n\n2,191\n\n\n \n\n\n \n\n\n \n\n\n\n\nPremiums written declined $263 million (4.8%) in the third quarter and $1.1 billion (6.4%) in the first nine months of 2025 compared to 2024, primarily attributable to volume reductions in property business. Premiums earned decreased 5.1% in the third quarter and 5.9% in the first nine months of 2025 compared to 2024.\n \n\n\n37\n\n\n\n\n \n\n\nItem 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations\n \nInsurance—Underwriting\n \nBerkshire Hathaway Reinsurance Group\n \nLosses and loss adjustment expenses declined $597 million (18.2%) in the third quarter and $361 million (3.8%) in the first nine months of 2025 compared to 2024. The loss ratio decreased 8.3 percentage points in the third quarter and increased 1.2 percentage points in the first nine months of 2025 compared to 2024. Losses incurred from significant catastrophe events were approximately $760 million in the first nine months of 2025, attributable to the Southern California wildfires in the first quarter, and were approximately $380 million in the first nine months of 2024 from Hurricane Helene in the third quarter. Additionally, losses and loss adjustment expenses in the first nine months of 2025 were reduced $898 million compared to $1.2 billion in 2024 from reductions of estimated ultimate claim liabilities for prior accident years’ claims. The reductions were mostly attributable to lower-than-expected property losses.\n \nUnderwriting expenses decreased $587 million (29.2%) in the third quarter and $606 million (12.4%) in the first nine months of 2025 compared to 2024. The expense ratio decreased 9.3 percentage points in the third quarter and 1.9 percentage points in the first nine months of 2025 compared to 2024. Underwriting expenses included foreign currency exchange losses from the remeasurement of certain non-U.S. Dollar denominated liabilities of $29 million in the third quarter and $229 million in the first nine months of 2025 and $171 million in the third quarter and $120 million in the first nine months of 2024. Additionally, underwriting expenses in the third quarter and first nine months of 2024 included a $490 million charge in connection with a settlement agreement reached concerning certain non-insurance affiliates that filed voluntary petitions under Chapter 11 of the bankruptcy code in the United States Bankruptcy Court for the District of New Jersey in 2023. See Note 22 to the accompanying Consolidated Financial Statements. Otherwise, underwriting expenses in 2025 increased 3.3% in the third quarter and declined 5.2% in the first nine months from 2024.\n \nLife/health\n \nA summary of our life/health reinsurance underwriting results follows (dollars in millions).\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\nThird Quarter\n\n\n \n\n\n \n\n\nFirst Nine Months\n\n\n \n\n\n\n\n\n\n \n\n\n2025\n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2025\n\n\n \n\n\n2024\n\n\n \n\n\n\n\n\n\n \n\n\nAmount\n\n\n \n\n\n%\n\n\n \n\n\nAmount\n\n\n \n\n\n%\n\n\n \n\n\n \n\n\nAmount\n\n\n \n\n\n%\n\n\n \n\n\nAmount\n\n\n \n\n\n%\n\n\n \n\n\n\n\n\n\nPremiums written\n\n\n$\n\n\n1,300\n\n\n \n\n\n \n\n\n \n\n\n$\n\n\n1,246\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n$\n\n\n3,890\n\n\n \n\n\n \n\n\n \n\n\n$\n\n\n3,703\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nPremiums earned\n\n\n$\n\n\n1,297\n\n\n \n\n\n \n\n\n100.0\n\n\n \n\n\n$\n\n\n1,218\n\n\n \n\n\n \n\n\n100.0\n\n\n \n\n\n \n\n\n$\n\n\n3,883\n\n\n \n\n\n \n\n\n100.0\n\n\n \n\n\n$\n\n\n3,667\n\n\n \n\n\n \n\n\n100.0\n\n\n \n\n\n\n\n\n\nLife and health benefits\n\n\n \n\n\n1,002\n\n\n \n\n\n \n\n\n77.3\n\n\n \n\n\n \n\n\n817\n\n\n \n\n\n \n\n\n67.1\n\n\n \n\n\n \n\n\n \n\n\n3,001\n\n\n \n\n\n \n\n\n77.3\n\n\n \n\n\n \n\n\n2,492\n\n\n \n\n\n \n\n\n68.0\n\n\n \n\n\n\n\n\n\nUnderwriting expenses\n\n\n \n\n\n245\n\n\n \n\n\n \n\n\n18.8\n\n\n \n\n\n \n\n\n303\n\n\n \n\n\n \n\n\n24.9\n\n\n \n\n\n \n\n\n \n\n\n710\n\n\n \n\n\n \n\n\n18.3\n\n\n \n\n\n \n\n\n896\n\n\n \n\n\n \n\n\n24.4\n\n\n \n\n\n\n\n\n\nTotal benefits and expenses\n\n\n \n\n\n1,247\n\n\n \n\n\n \n\n\n96.1\n\n\n \n\n\n \n\n\n1,120\n\n\n \n\n\n \n\n\n92.0\n\n\n \n\n\n \n\n\n \n\n\n3,711\n\n\n \n\n\n \n\n\n95.6\n\n\n \n\n\n \n\n\n3,388\n\n\n \n\n\n \n\n\n92.4\n\n\n \n\n\n\n\n\n\nPre-tax underwriting earnings\n\n\n$\n\n\n50\n\n\n \n\n\n \n\n\n \n\n\n$\n\n\n98\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n$\n\n\n172\n\n\n \n\n\n \n\n\n \n\n\n$\n\n\n279\n\n\n \n\n\n \n\n\n \n\n\n\n\nPremiums earned increased $79 million (6.5%) in the third quarter and $216 million (5.9%) in the first nine months of 2025, primarily due to increases in non-U.S. markets. Pre-tax underwriting earnings in 2025 declined $48 million in the third quarter and $107 million in the first nine months compared to 2024, primarily due to lower earnings from U.S. life business, which included contract commutation gains of $50 million in the first nine months of 2024.\n \nRetroactive reinsurance\n \nWe have not written any significant retroactive reinsurance contracts in recent years. Pre-tax underwriting results derive from changes in the ultimate claim liability estimates and in the related deferred charge assets, as well as from foreign currency exchange gains and losses attributable to non-U.S. Dollar denominated reinsurance contracts. Changes in foreign currency exchange rates produced pre-tax losses of $110 million in the first nine months of 2025 compared to $75 million in the corresponding 2024 period. Pre-tax underwriting losses before foreign currency exchange losses were $508 million in the first nine months of 2025 and $498 million in 2024.\n \nThe liability for unpaid losses and loss adjustment expenses for retroactive reinsurance contracts declined $1.1 billion in the first nine months of 2025 to $31.3 billion at September 30, 2025, primarily due to loss payments. Deferred charge assets on retroactive reinsurance contracts declined $499 million in the first nine months of 2025 to $8.3 billion at September 30, 2025, which will be charged to earnings over the expected remaining claims settlement periods.\n \n\n\n38\n\n\n\n\n \n\n\nItem 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations\n \nInsurance—Underwriting\n \nPeriodic payment annuity\nPremium rates for new periodic payment annuity business continue to be at unacceptable levels. We have not written any new business since 2022. Pre-tax underwriting losses from periodic payment annuity contracts in each period included the accretion of discounted liabilities, including liabilities for contracts without life contingencies, as well as foreign currency exchange gains and losses on non-U.S. Dollar denominated contracts. Changes in foreign currency exchange rates produced pre-tax losses of $110 million in the first nine months of 2025 compared to $96 million in 2024. Pre-tax underwriting losses before foreign currency effects were $428 million in the first nine months of 2025 compared to $447 million in 2024, primarily attributable to recurring discounted liability accretion. Periodic payment annuity liabilities were $14.6 billion at September 30, 2025, which included liabilities of $4.0 billion for contracts without life contingencies, as well as the effects of discount rate changes recorded in accumulated other comprehensive income.\n \nVariable annuity\n \nOur variable annuity guarantee reinsurance contracts produced pre-tax earnings of $33 million in the first nine months of 2025 compared to $30 million in 2024. Earnings are affected by changes in securities markets, interest rates and foreign currency exchange rates. These contracts have been in run-off for many years.\n \nInsurance—Investment Income\n \nA summary of net investment income attributable to our insurance operations follows (dollars in millions).\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\nThird Quarter\n\n\n \n\n\n \n\n\nFirst Nine Months\n\n\n \n\n\n \n\n\nPercentage Change\n\n\n \n\n\n\n\n\n\n \n\n\n2025\n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2025\n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\nThird\nQuarter\n\n\n \n\n\n \n\n\nFirst Nine\nMonths\n\n\n \n\n\n\n\n\n\nInterest and other investment income\n\n\n$\n\n\n2,626\n\n\n \n\n\n$\n\n\n3,502\n\n\n \n\n\n \n\n\n$\n\n\n7,669\n\n\n \n\n\n$\n\n\n8,032\n\n\n \n\n\n \n\n\n \n\n\n(25.0\n\n\n)%\n\n\n \n\n\n \n\n\n(4.5\n\n\n)%\n\n\n\n\n\n\nDividend income\n\n\n \n\n\n1,090\n\n\n \n\n\n \n\n\n1,092\n\n\n \n\n\n \n\n\n \n\n\n3,611\n\n\n \n\n\n \n\n\n3,782\n\n\n \n\n\n \n\n\n \n\n\n(0.2\n\n\n)\n\n\n \n\n\n \n\n\n(4.5\n\n\n)\n\n\n\n\n\n\nPre-tax net investment income\n\n\n \n\n\n3,716\n\n\n \n\n\n \n\n\n4,594\n\n\n \n\n\n \n\n\n \n\n\n11,280\n\n\n \n\n\n \n\n\n11,814\n\n\n \n\n\n \n\n\n \n\n\n(19.1\n\n\n)\n\n\n \n\n\n \n\n\n(4.5\n\n\n)\n\n\n\n\n\n\nIncome taxes\n\n\n \n\n\n535\n\n\n \n\n\n \n\n\n930\n\n\n \n\n\n \n\n\n \n\n\n1,839\n\n\n \n\n\n \n\n\n2,232\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nNet investment income\n\n\n$\n\n\n3,181\n\n\n \n\n\n$\n\n\n3,664\n\n\n \n\n\n \n\n\n$\n\n\n9,441\n\n\n \n\n\n$\n\n\n9,582\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nEffective income tax rate\n\n\n \n\n\n14.4\n\n\n%\n\n\n \n\n\n20.2\n\n\n%\n\n\n \n\n\n \n\n\n16.3\n\n\n%\n\n\n \n\n\n18.9\n\n\n%\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\nInterest and other investment income declined $876 million (25.0%) in the third quarter and $363 million (4.5%) in the first nine months of 2025 compared to 2024. The decrease in the third quarter was primarily attributable to lower short-term interest rates and the impact of capital distributions from insurance subsidiaries to Berkshire in the fourth quarter of 2024. The income earned on the cash and investments distributed to Berkshire is included in other earnings shown on pages 34 and 49. We continue to believe that maintaining ample liquidity is paramount and insist on safety over yield with respect to short-term investments.\n \nDividend income was relatively unchanged in the third quarter and decreased $171 million (4.5%) in the first nine months of 2025 compared to 2024. The year-to-date decline was primarily due to changes within the equity securities portfolio, partially offset by higher dividend rates on certain of our holdings. Dividend income also varies from period to period due to changes in the investment portfolio and the frequency and timing of dividends from certain investees.\n \nInvested assets of our insurance businesses derive from shareholder capital and net liabilities assumed under insurance contracts or “float.” The major components of float are unpaid losses and loss adjustment expenses, including liabilities under retroactive reinsurance contracts, life, annuity and health benefit liabilities, unearned premiums and certain other liabilities, which are reduced by insurance premiums receivable, reinsurance receivables, deferred charges assumed under retroactive reinsurance contracts and deferred policy acquisition costs. The effect of discount rate changes on long-duration insurance contracts, recorded in accumulated other comprehensive income, is excluded from float, as such amounts are not included in earnings in the Consolidated Statements of Earnings.\n \nFloat was approximately $176 billion at September 30, 2025 and $171 billion at December 31, 2024. The cost of float is measured as the ratio of pre-tax underwriting earnings to average float balances. Our combined insurance operations generated pre-tax underwriting gains in the first nine months of 2025 and 2024. Therefore, the cost of float was negative in each period.\n \n\n\n39\n\n\n\n\n \n\n\nItem 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations\n \nInsurance—Investment Income\nA summary of cash and investments held in our insurance businesses follows (in millions).\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\nSeptember 30, \n2025\n\n\n \n\n\nDecember 31,\n2024\n\n\n \n\n\n\n\n\n\nCash, cash equivalents and U.S. Treasury Bills\n\n\n$\n\n\n246,901\n\n\n \n\n\n$\n\n\n212,591\n\n\n \n\n\n\n\n\n\nEquity securities\n\n\n \n\n\n277,238\n\n\n \n\n\n \n\n\n263,366\n\n\n \n\n\n\n\n\n\nFixed maturity securities\n\n\n \n\n\n17,687\n\n\n \n\n\n \n\n\n15,137\n\n\n \n\n\n\n\n\n\nOther, including loans to affiliates\n\n\n \n\n\n5,145\n\n\n \n\n\n \n\n\n5,980\n\n\n \n\n\n\n\n\n\n \n\n\n$\n\n\n546,971\n\n\n \n\n\n$\n\n\n497,074\n\n\n \n\n\n\n\nFixed maturity investments as of September 30, 2025 follows (in millions).\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\nAmortized \nCost\n\n\n \n\n\nUnrealized \nGains (Losses)\n\n\n \n\n\nCarrying \nValue\n\n\n \n\n\n\n\n\n\nU.S. Treasury, U.S. government corporations and agencies\n\n\n$\n\n\n4,412\n\n\n \n\n\n$\n\n\n13\n\n\n \n\n\n$\n\n\n4,425\n\n\n \n\n\n\n\n\n\nForeign governments\n\n\n \n\n\n11,810\n\n\n \n\n\n \n\n\n20\n\n\n \n\n\n \n\n\n11,830\n\n\n \n\n\n\n\n\n\nCorporate and other\n\n\n \n\n\n1,201\n\n\n \n\n\n \n\n\n231\n\n\n \n\n\n \n\n\n1,432\n\n\n \n\n\n\n\n\n\n \n\n\n$\n\n\n17,423\n\n\n \n\n\n$\n\n\n264\n\n\n \n\n\n$\n\n\n17,687\n\n\n \n\n\n\n\nU.S. government obligations are rated AA+ or Aa1 by the major rating agencies. Approximately 95% of our foreign government investments were rated AA or higher by at least one of the major rating agencies. Foreign government securities are issued or unconditionally guaranteed by national or provincial government entities.\n \nBNSF\nBurlington Northern Santa Fe, LLC (“BNSF”) operates one of the largest railroad systems in North America, with over 32,500 route miles of track in 28 states. BNSF also operates in three Canadian provinces. BNSF classifies its major business groups by type of product shipped, including consumer products, agricultural and energy products, industrial products and coal. A summary of BNSF’s earnings follows (dollars in millions).\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nThird Quarter\n\n\n \n\n\n \n\n\nFirst Nine Months\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n2025\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2025\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n\n\n\n\nRailroad operating revenues\n\n\n \n\n\n$\n\n\n5,988\n\n\n \n\n\n \n\n\n$\n\n\n5,881\n\n\n \n\n\n \n\n\n$\n\n\n17,390\n\n\n \n\n\n \n\n\n$\n\n\n17,242\n\n\n \n\n\n\n\n\n\nRailroad operating expenses\n\n\n \n\n\n \n\n\n3,841\n\n\n \n\n\n \n\n\n \n\n\n3,828\n\n\n \n\n\n \n\n\n \n\n\n11,409\n\n\n \n\n\n \n\n\n \n\n\n11,646\n\n\n \n\n\n\n\n\n\nRailroad operating earnings\n\n\n \n\n\n \n\n\n2,147\n\n\n \n\n\n \n\n\n \n\n\n2,053\n\n\n \n\n\n \n\n\n \n\n\n5,981\n\n\n \n\n\n \n\n\n \n\n\n5,596\n\n\n \n\n\n\n\n\n\nOther revenues (expenses), net\n\n\n \n\n\n \n\n\n44\n\n\n \n\n\n \n\n\n \n\n\n68\n\n\n \n\n\n \n\n\n \n\n\n164\n\n\n \n\n\n \n\n\n \n\n\n198\n\n\n \n\n\n\n\n\n\nInterest expense\n\n\n \n\n\n \n\n\n(279\n\n\n)\n\n\n \n\n\n \n\n\n(275\n\n\n)\n\n\n \n\n\n \n\n\n(821\n\n\n)\n\n\n \n\n\n \n\n\n(807\n\n\n)\n\n\n\n\n\n\nPre-tax earnings\n\n\n \n\n\n \n\n\n1,912\n\n\n \n\n\n \n\n\n \n\n\n1,846\n\n\n \n\n\n \n\n\n \n\n\n5,324\n\n\n \n\n\n \n\n\n \n\n\n4,987\n\n\n \n\n\n\n\n\n\nIncome taxes\n\n\n \n\n\n \n\n\n463\n\n\n \n\n\n \n\n\n \n\n\n463\n\n\n \n\n\n \n\n\n \n\n\n1,195\n\n\n \n\n\n \n\n\n \n\n\n1,234\n\n\n \n\n\n\n\n\n\nNet earnings\n\n\n \n\n\n$\n\n\n1,449\n\n\n \n\n\n \n\n\n$\n\n\n1,383\n\n\n \n\n\n \n\n\n$\n\n\n4,129\n\n\n \n\n\n \n\n\n$\n\n\n3,753\n\n\n \n\n\n\n\n\n\nEffective income tax rate\n\n\n \n\n\n \n\n\n24.2\n\n\n%\n\n\n \n\n\n \n\n\n25.1\n\n\n%\n\n\n \n\n\n \n\n\n22.4\n\n\n%\n\n\n \n\n\n \n\n\n24.7\n\n\n%\n\n\n\n\nA summary of BNSF’s railroad freight volumes by business group follows (cars/units in thousands).\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nCars/Units\n\n\n \n\n\n \n\n\nPercentage Change\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\nThird Quarter\n\n\n \n\n\n \n\n\nFirst Nine Months\n\n\n \n\n\n \n\n\nThird\n\n\n \n\n\nFirst Nine\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n2025\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2025\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\nQuarter\n\n\n \n\n\nMonths\n\n\n \n\n\n\n\n\n\nConsumer products\n\n\n \n\n\n \n\n\n1,474\n\n\n \n\n\n \n\n\n \n\n\n1,442\n\n\n \n\n\n \n\n\n \n\n\n4,194\n\n\n \n\n\n \n\n\n \n\n\n4,044\n\n\n \n\n\n \n\n\n \n\n\n2.2\n\n\n%\n\n\n \n\n\n3.7\n\n\n%\n\n\n\n\n\n\nIndustrial products\n\n\n \n\n\n \n\n\n362\n\n\n \n\n\n \n\n\n \n\n\n369\n\n\n \n\n\n \n\n\n \n\n\n1,044\n\n\n \n\n\n \n\n\n \n\n\n1,085\n\n\n \n\n\n \n\n\n \n\n\n(1.9\n\n\n)\n\n\n \n\n\n(3.8\n\n\n)\n\n\n\n\n\n\nAgricultural and energy products\n\n\n \n\n\n \n\n\n350\n\n\n \n\n\n \n\n\n \n\n\n347\n\n\n \n\n\n \n\n\n \n\n\n1,043\n\n\n \n\n\n \n\n\n \n\n\n1,039\n\n\n \n\n\n \n\n\n \n\n\n0.9\n\n\n \n\n\n \n\n\n0.4\n\n\n \n\n\n\n\n\n\nCoal\n\n\n \n\n\n \n\n\n322\n\n\n \n\n\n \n\n\n \n\n\n329\n\n\n \n\n\n \n\n\n \n\n\n911\n\n\n \n\n\n \n\n\n \n\n\n878\n\n\n \n\n\n \n\n\n \n\n\n(2.1\n\n\n)\n\n\n \n\n\n3.8\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n2,508\n\n\n \n\n\n \n\n\n \n\n\n2,487\n\n\n \n\n\n \n\n\n \n\n\n7,192\n\n\n \n\n\n \n\n\n \n\n\n7,046\n\n\n \n\n\n \n\n\n \n\n\n0.8\n\n\n \n\n\n \n\n\n2.1\n\n\n \n\n\n\n\n \n\n\n40\n\n\n\n\n \n\n\nItem 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations\n \nBNSF\nRailroad operating revenues increased slightly in the third quarter and first nine months of 2025 compared to 2024. Car/unit volumes increased 0.8% in the third quarter and 2.1% in the first nine months of 2025 compared to the same periods in 2024. Average revenue per car/unit increased 0.8% in the third quarter and declined 1.4% in the first nine months of 2025 versus 2024, generally attributable to lower fuel surcharge revenue and unfavorable business mix, partially offset by core pricing gains. Pre-tax earnings increased 3.6% in the third quarter and 6.8% in the first nine months of 2025 compared to 2024.\nOperating revenues from consumer products were $2.1 billion in the third quarter of 2025, unchanged from 2024, and $6.1 billion in the first nine months, a decrease of 1.4% from 2024. The revenues in 2025 reflected lower average revenue per car/unit, substantially offset by slightly higher volumes. Volumes increased 2.2% in the third quarter and 3.7% in the first nine months of 2025 compared to 2024. The volume increases were primarily due to higher intermodal shipments resulting from higher West Coast imports and an increase in automotive vehicle volumes.\n \nOperating revenues from industrial products were $1.3 billion in the third quarter of 2025, essentially unchanged from 2024, and $3.8 billion in the first nine months of 2025, a decrease of 1.4% from 2024. Revenues in 2025 reflected lower volumes of 1.9% for the third quarter and 3.8% year-to-date, partially offset by higher average revenue per car/unit. The volume declines were primarily due to lower demand for construction products and lower petroleum products shipments.\nOperating revenues from agricultural and energy products were $1.6 billion in the third quarter and $4.8 billion in the first nine months of 2025, increases of 6.3% and 3.5%, respectively, compared to 2024. The revenue increases were attributable to higher average revenue per car/unit and slightly higher volumes. The volume increases were primarily due to slightly higher grain exports, partially offset by lower domestic grain and feed shipments.\n \nOperating revenues from coal were $795 million in the third quarter of 2025, unchanged from 2024, and $2.2 billion in the first nine months of 2025, an increase of 3.6% from 2024. Revenues in the third quarter of 2025 reflected higher average revenue per car/unit, which was offset by reduced volumes of 2.1% compared to 2024. The revenue increase in the first nine months of 2025 was primarily due to a 3.8% increase in volumes, partially offset by lower average revenue per car/unit. The volume increase in the first nine months of 2025 was primarily due to the competitive effects of higher natural gas prices, while the volume decline in the third quarter was primarily due to mine production challenges.\n \nRailroad operating expenses were $3.8 billion in the third quarter of 2025, essentially unchanged from 2024, and $11.4 billion in the first nine months of 2025, a decrease of $237 million (2.0%) compared to 2024. Fuel expenses declined $27 million (3.4%) in the third quarter and $235 million (9.5%) in the first nine months of 2025 compared to 2024, attributable to lower average fuel prices and improved fuel efficiency. Compensation and benefits expenses in the third quarter and first nine months of 2025 were relatively unchanged compared to 2024, reflecting wage inflation, offset by improved employee productivity. Other railroad operating expenses increased $48 million (3.0%) in the third quarter and decreased $21 million (0.4%) in the first nine months of 2025 compared to 2024. The changes in other railroad operating expenses included increases in purchased services and depreciation and amortization expenses, lower other expenses due to ongoing cost management efforts, as well as the impact of litigation accruals in the first nine months of 2024.\n \nIncome tax expense was unchanged in the third quarter of 2025 and declined $39 million (3.2%) in the first nine months of 2025 compared to 2024. The effective income tax rate in the third quarter and first nine months of 2025 declined versus the same periods in 2024, primarily due to lower state income tax expenses arising from the impact of reductions in enacted rates during the second quarter of 2025.\n \nBHE\n \nBerkshire Hathaway Energy Company (“BHE”) is a holding company with subsidiaries that primarily operate within the energy industry. BHE’s domestic regulated utility interests include PacifiCorp, MidAmerican Energy Company (“MEC”) and NV Energy. BHE’s natural gas pipelines consist of five domestic regulated interstate natural gas pipeline systems and a 75% interest in a liquefied natural gas export, import and storage facility (“Cove Point”). Other energy subsidiaries operate two regulated electricity distribution businesses in Great Britain (“Northern Powergrid”), a regulated electricity transmission-only business in Alberta, Canada, and a diversified portfolio of mostly renewable independent power projects and investments. Another BHE subsidiary, HomeServices of America, Inc. (“HomeServices”), operates a residential real estate brokerage business and a large network of real estate brokerage franchises in the United States.\n \n\n\n41\n\n\n\n\n \n\n\nItem 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations\n \nBHE\n \nThe rates BHE’s regulated utility and energy businesses charge customers for energy and services are largely based on the costs of business operations, including income taxes and a return on capital, and are subject to regulatory approval. To the extent such costs are not allowed in the approved rates, operating results will be adversely affected. A summary of BHE’s net earnings follows (dollars in millions).\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nThird Quarter\n\n\n \n\n\n \n\n\nFirst Nine Months\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n2025\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2025\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n\n\n\n\nRevenues:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nEnergy operating revenues\n\n\n \n\n\n$\n\n\n6,059\n\n\n \n\n\n \n\n\n$\n\n\n6,026\n\n\n \n\n\n \n\n\n$\n\n\n16,695\n\n\n \n\n\n \n\n\n$\n\n\n16,386\n\n\n \n\n\n\n\n\n\nReal estate operating revenues\n\n\n \n\n\n \n\n\n1,185\n\n\n \n\n\n \n\n\n \n\n\n1,179\n\n\n \n\n\n \n\n\n \n\n\n3,309\n\n\n \n\n\n \n\n\n \n\n\n3,334\n\n\n \n\n\n\n\n\n\nOther income\n\n\n \n\n\n \n\n\n60\n\n\n \n\n\n \n\n\n \n\n\n130\n\n\n \n\n\n \n\n\n \n\n\n74\n\n\n \n\n\n \n\n\n \n\n\n384\n\n\n \n\n\n\n\n\n\nTotal revenues\n\n\n \n\n\n \n\n\n7,304\n\n\n \n\n\n \n\n\n \n\n\n7,335\n\n\n \n\n\n \n\n\n \n\n\n20,078\n\n\n \n\n\n \n\n\n \n\n\n20,104\n\n\n \n\n\n\n\n\n\nCosts and expenses:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nEnergy cost of sales\n\n\n \n\n\n \n\n\n1,876\n\n\n \n\n\n \n\n\n \n\n\n1,902\n\n\n \n\n\n \n\n\n \n\n\n4,841\n\n\n \n\n\n \n\n\n \n\n\n5,099\n\n\n \n\n\n\n\n\n\nEnergy operating expenses\n\n\n \n\n\n \n\n\n2,711\n\n\n \n\n\n \n\n\n \n\n\n2,551\n\n\n \n\n\n \n\n\n \n\n\n8,021\n\n\n \n\n\n \n\n\n \n\n\n7,769\n\n\n \n\n\n\n\n\n\nReal estate operating costs and expenses\n\n\n \n\n\n \n\n\n1,146\n\n\n \n\n\n \n\n\n \n\n\n1,151\n\n\n \n\n\n \n\n\n \n\n\n3,227\n\n\n \n\n\n \n\n\n \n\n\n3,477\n\n\n \n\n\n\n\n\n\nInterest expense\n\n\n \n\n\n \n\n\n658\n\n\n \n\n\n \n\n\n \n\n\n630\n\n\n \n\n\n \n\n\n \n\n\n1,968\n\n\n \n\n\n \n\n\n \n\n\n1,900\n\n\n \n\n\n\n\n\n\nTotal costs and expenses\n\n\n \n\n\n \n\n\n6,391\n\n\n \n\n\n \n\n\n \n\n\n6,234\n\n\n \n\n\n \n\n\n \n\n\n18,057\n\n\n \n\n\n \n\n\n \n\n\n18,245\n\n\n \n\n\n\n\n\n\nPre-tax earnings\n\n\n \n\n\n \n\n\n913\n\n\n \n\n\n \n\n\n \n\n\n1,101\n\n\n \n\n\n \n\n\n \n\n\n2,021\n\n\n \n\n\n \n\n\n \n\n\n1,859\n\n\n \n\n\n\n\n\n\nIncome tax benefit\n\n\n \n\n\n \n\n\n(606\n\n\n)\n\n\n \n\n\n \n\n\n(708\n\n\n)\n\n\n \n\n\n \n\n\n(1,385\n\n\n)\n\n\n \n\n\n \n\n\n(1,535\n\n\n)\n\n\n\n\n\n\nNet earnings after income taxes\n\n\n \n\n\n \n\n\n1,519\n\n\n \n\n\n \n\n\n \n\n\n1,809\n\n\n \n\n\n \n\n\n \n\n\n3,406\n\n\n \n\n\n \n\n\n \n\n\n3,394\n\n\n \n\n\n\n\n\n\nNoncontrolling interests of BHE subsidiaries\n\n\n \n\n\n \n\n\n30\n\n\n \n\n\n \n\n\n \n\n\n31\n\n\n \n\n\n \n\n\n \n\n\n115\n\n\n \n\n\n \n\n\n \n\n\n106\n\n\n \n\n\n\n\n\n\nNet earnings attributable to BHE\n\n\n \n\n\n \n\n\n1,489\n\n\n \n\n\n \n\n\n \n\n\n1,778\n\n\n \n\n\n \n\n\n \n\n\n3,291\n\n\n \n\n\n \n\n\n \n\n\n3,288\n\n\n \n\n\n\n\n\n\nNoncontrolling interests and preferred stock dividends\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n149\n\n\n \n\n\n \n\n\n \n\n\n3\n\n\n \n\n\n \n\n\n \n\n\n287\n\n\n \n\n\n\n\n\n\nNet earnings attributable to Berkshire shareholders\n\n\n \n\n\n$\n\n\n1,489\n\n\n \n\n\n \n\n\n$\n\n\n1,629\n\n\n \n\n\n \n\n\n$\n\n\n3,288\n\n\n \n\n\n \n\n\n$\n\n\n3,001\n\n\n \n\n\n\n\n\n\nEffective income tax rate\n\n\n \n\n\n \n\n\n(66.4\n\n\n)%\n\n\n \n\n\n \n\n\n(64.3\n\n\n)%\n\n\n \n\n\n \n\n\n(68.5\n\n\n)%\n\n\n \n\n\n \n\n\n(82.6\n\n\n)%\n\n\n\n\nBHE’s income tax benefit and net earnings include significant production tax credits primarily from wind-powered electricity generation. On July 4, 2025, the One Big Beautiful Bill Act (the “OBBBA”) was enacted, introducing substantial revisions to energy-related U.S. Federal tax policy. Among its provisions, the OBBBA accelerates the phase-out of clean electricity production and investment tax credits and establishes new sourcing requirements applicable to facilities commencing construction after December 31, 2025.\n \nWe are currently evaluating the potential implications of the OBBBA on BHE’s financial results and capital expenditures related to renewable energy, storage and technology neutral projects, including the potential impact on the economics and viability of such projects. These evaluations may be further affected by broader macroeconomic and geopolitical conditions, including changes in international trade policies and tariff regimes. Due to the inherent uncertainties involved, we are unable to estimate the impact on BHE’s energy business at this time.\nThe discussion of BHE’s operating results that follows is based on after-tax earnings, reflecting how the energy businesses are managed and evaluated. A summary of net earnings attributable to BHE follows (dollars in millions).\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nThird Quarter\n\n\n \n\n\n \n\n\nFirst Nine Months\n\n\n \n\n\n \n\n\nPercentage Change\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n2025\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2025\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\nThird\nQuarter\n\n\n \n\n\nFirst Nine\nMonths\n\n\n \n\n\n\n\n\n\nU.S. utilities\n\n\n \n\n\n$\n\n\n850\n\n\n \n\n\n \n\n\n$\n\n\n926\n\n\n \n\n\n \n\n\n$\n\n\n1,712\n\n\n \n\n\n \n\n\n$\n\n\n1,569\n\n\n \n\n\n \n\n\n \n\n\n(8.2\n\n\n)%\n\n\n \n\n\n9.1\n\n\n%\n\n\n\n\n\n\nNatural gas pipelines\n\n\n \n\n\n \n\n\n153\n\n\n \n\n\n \n\n\n \n\n\n194\n\n\n \n\n\n \n\n\n \n\n\n824\n\n\n \n\n\n \n\n\n \n\n\n927\n\n\n \n\n\n \n\n\n \n\n\n(21.1\n\n\n)\n\n\n \n\n\n(11.1\n\n\n)\n\n\n\n\n\n\nOther energy businesses\n\n\n \n\n\n \n\n\n259\n\n\n \n\n\n \n\n\n \n\n\n358\n\n\n \n\n\n \n\n\n \n\n\n909\n\n\n \n\n\n \n\n\n \n\n\n1,019\n\n\n \n\n\n \n\n\n \n\n\n(27.7\n\n\n)\n\n\n \n\n\n(10.8\n\n\n)\n\n\n\n\n\n\nReal estate brokerage\n\n\n \n\n\n \n\n\n33\n\n\n \n\n\n \n\n\n \n\n\n20\n\n\n \n\n\n \n\n\n \n\n\n63\n\n\n \n\n\n \n\n\n \n\n\n(96\n\n\n)\n\n\n \n\n\n \n\n\n65.0\n\n\n \n\n\n*\n\n\n \n\n\n\n\n\n\nCorporate interest and other\n\n\n \n\n\n \n\n\n194\n\n\n \n\n\n \n\n\n \n\n\n280\n\n\n \n\n\n \n\n\n \n\n\n(217\n\n\n)\n\n\n \n\n\n \n\n\n(131\n\n\n)\n\n\n \n\n\n \n\n\n(30.7\n\n\n)\n\n\n \n\n\n(65.6\n\n\n)\n\n\n\n\n\n\n \n\n\n \n\n\n$\n\n\n1,489\n\n\n \n\n\n \n\n\n$\n\n\n1,778\n\n\n \n\n\n \n\n\n$\n\n\n3,291\n\n\n \n\n\n \n\n\n$\n\n\n3,288\n\n\n \n\n\n \n\n\n \n\n\n(16.3\n\n\n)\n\n\n \n\n\n0.1\n\n\n \n\n\n\n\n——————\n* Not meaningful.\n \n\n\n42\n\n\n\n\n \n\n\nItem 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations\n \nBHE\n \nThe U.S. utilities operate independently in several states, including Utah, Oregon, Wyoming and other Western states (PacifiCorp), Iowa and Illinois (MEC) and Nevada (NV Energy). Net earnings decreased $76 million (8.2%) in the third quarter and increased $143 million (9.1%) in the first nine months of 2025 compared to 2024. Pre-tax Wildfire loss accruals, net of expected insurance recoveries, at PacifiCorp were $100 million in the third quarter and first nine months of 2025 and were $251 million in the first nine months of 2024. See Note 22 to the accompanying Consolidated Financial Statements for additional information on the Wildfires. Otherwise, net earnings of the U.S. utilities in the third quarter and the first nine months of 2025 reflected comparative increases in electric utility margin, substantially offset by an increase in energy operating expenses and lower other income and income tax benefits.\n \nThe U.S. utilities’ electric utility margin was $2.6 billion in the third quarter and $6.6 billion in the first nine months of 2025, increases of $163 million (6.8%) and $593 million (9.9%), respectively, compared to 2024. The increases reflected higher retail customer rates in certain territories, higher retail customer volumes and higher wholesale prices and volumes, partially offset by higher energy cost of sales. Retail customer volumes increased 2.7% overall (up 9.8% at MEC, 2.0% at PacifiCorp and down 1.8% at NV Energy) in the first nine months of 2025 compared to 2024, primarily due to higher customer usage and an increase in the average number of customers, partially offset by an overall unfavorable impact of weather. The increase in energy operating expenses was primarily due to higher depreciation and amortization expense, insurance expenses and general and plant maintenance costs.\n \nNet earnings of natural gas pipelines declined $41 million in the third quarter and $103 million in the first nine months of 2025 compared to 2024. The decreases in earnings reflected higher interest expense, largely due to debt issued in January 2025 and debt refinancings in the fourth quarter of 2024 at higher interest rates, an increase in operating expenses, decreased margin on gas sales and lower other income, partially offset by higher transportation and storage revenues.\nNet earnings of other energy businesses decreased $99 million in the third quarter and $110 million in the first nine months of 2025 compared to 2024. The decreases were primarily due to lower earnings at Northern Powergrid, from lower distribution revenues due to lower tariffs from inflation adjustments beginning in the second quarter of 2025, deferred income tax charges related to the March 2025 enactment of a change in the United Kingdom’s Energy Profits Levy income tax and higher operating expenses at the distribution businesses, partially offset by favorable income tax expense from higher utilization of tax losses from upstream gas exploration and production activities.\n \nNet earnings of real estate brokerage increased by $13 million in the third quarter and $159 million in the first nine months of 2025 compared to 2024, primarily attributable to charges in 2024 with respect to the ongoing real estate industry litigation matters. In April 2024, HomeServices agreed to terms with the plaintiffs to settle all claims asserted against HomeServices and certain of its subsidiaries and effectuated a nationwide class settlement. See Note 22 to the accompanying Consolidated Financial Statements. The real estate brokerage business continues to be negatively impacted by the limited availability of homes for sale and high home prices.\n \nCorporate interest and other net earnings include BHE corporate interest expense and unallocated corporate and income tax expenses. Additionally, noncontrolling interests and preferred stock dividends include earnings attributable to non-Berkshire owners of BHE common stock and dividends on preferred stock held by other Berkshire subsidiaries. All remaining noncontrolling interests in BHE common stock were acquired in the second half of 2024 and the preferred stock was redeemed in the first quarter of 2025.\n \n\n\n43\n\n\n\n\n \n\n\nItem 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations\n \nManufacturing, Service and Retailing\n \nA summary of revenues and earnings of our manufacturing, service and retailing businesses follows (dollars in millions).\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\nThird Quarter\n\n\n \n\n\n \n\n\nFirst Nine Months\n\n\n \n\n\nPercentage Change\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\nThird\n\n\n \n\n\nFirst Nine\n\n\n \n\n\n\n\n\n\n \n\n\n2025\n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2025\n\n\n \n\n\n2024\n\n\n \n\n\nQuarter\n\n\n \n\n\nMonths\n\n\n \n\n\n\n\n\n\nRevenues:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nManufacturing\n\n\n$\n\n\n20,047\n\n\n \n\n\n$\n\n\n19,675\n\n\n \n\n\n \n\n\n$\n\n\n58,782\n\n\n \n\n\n$\n\n\n58,044\n\n\n \n\n\n \n\n\n1.9\n\n\n%\n\n\n \n\n\n1.3\n\n\n%\n\n\n\n\n\n\nService and retailing\n\n\n \n\n\n34,666\n\n\n \n\n\n \n\n\n33,195\n\n\n \n\n\n \n\n\n \n\n\n100,806\n\n\n \n\n\n \n\n\n103,280\n\n\n \n\n\n \n\n\n4.4\n\n\n \n\n\n \n\n\n(2.4\n\n\n)\n\n\n\n\n\n\n \n\n\n$\n\n\n54,713\n\n\n \n\n\n$\n\n\n52,870\n\n\n \n\n\n \n\n\n$\n\n\n159,588\n\n\n \n\n\n$\n\n\n161,324\n\n\n \n\n\n \n\n\n3.5\n\n\n \n\n\n \n\n\n(1.1\n\n\n)\n\n\n\n\n\n\nPre-tax earnings:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nManufacturing\n\n\n$\n\n\n3,584\n\n\n \n\n\n$\n\n\n3,135\n\n\n \n\n\n \n\n\n$\n\n\n9,547\n\n\n \n\n\n$\n\n\n9,178\n\n\n \n\n\n \n\n\n14.3\n\n\n%\n\n\n \n\n\n4.0\n\n\n%\n\n\n\n\n\n\nService and retailing\n\n\n \n\n\n1,136\n\n\n \n\n\n \n\n\n1,239\n\n\n \n\n\n \n\n\n \n\n\n3,826\n\n\n \n\n\n \n\n\n3,692\n\n\n \n\n\n \n\n\n(8.3\n\n\n)\n\n\n \n\n\n3.6\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n4,720\n\n\n \n\n\n \n\n\n4,374\n\n\n \n\n\n \n\n\n \n\n\n13,373\n\n\n \n\n\n \n\n\n12,870\n\n\n \n\n\n \n\n\n7.9\n\n\n \n\n\n \n\n\n3.9\n\n\n \n\n\n\n\n\n\nIncome taxes and noncontrolling interests\n\n\n \n\n\n1,104\n\n\n \n\n\n \n\n\n1,032\n\n\n \n\n\n \n\n\n \n\n\n3,096\n\n\n \n\n\n \n\n\n3,060\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nNet earnings*\n\n\n$\n\n\n3,616\n\n\n \n\n\n$\n\n\n3,342\n\n\n \n\n\n \n\n\n$\n\n\n10,277\n\n\n \n\n\n$\n\n\n9,810\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nEffective income tax rate\n\n\n \n\n\n22.7\n\n\n%\n\n\n \n\n\n22.8\n\n\n%\n\n\n \n\n\n \n\n\n22.4\n\n\n%\n\n\n \n\n\n23.1\n\n\n%\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nPre-tax earnings as a percentage of revenues\n\n\n \n\n\n8.6\n\n\n%\n\n\n \n\n\n8.3\n\n\n%\n\n\n \n\n\n \n\n\n8.4\n\n\n%\n\n\n \n\n\n8.0\n\n\n%\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n——————\n* Excludes certain acquisition accounting expenses, which primarily relate to the amortization of intangible assets recorded in connection with certain of our business acquisitions. The after-tax acquisition accounting expenses excluded from earnings were $123 million in the third quarter and $371 million in the first nine months of 2025 and $127 million in the third quarter and $389 million in the first nine months of 2024. These expenses are included in “Other” in the summary of earnings on page 34 and in the “Other” earnings table on page 49.\n \nManufacturing\nOur manufacturing group consists of a variety of industrial, building and consumer products businesses. A summary of revenues and pre-tax earnings of these operations follows (dollars in millions).\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\nThird Quarter\n\n\n \n\n\n \n\n\nFirst Nine Months\n\n\n \n\n\n\n\n\n\n \n\n\n2025\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2025\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n\n\n\n\nRevenues:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nIndustrial products\n\n\n$\n\n\n9,471\n\n\n \n\n\n \n\n\n$\n\n\n8,956\n\n\n \n\n\n \n\n\n$\n\n\n28,072\n\n\n \n\n\n \n\n\n$\n\n\n27,112\n\n\n \n\n\n\n\n\n\nBuilding products\n\n\n \n\n\n7,000\n\n\n \n\n\n \n\n\n \n\n\n6,906\n\n\n \n\n\n \n\n\n \n\n\n20,112\n\n\n \n\n\n \n\n\n \n\n\n19,892\n\n\n \n\n\n\n\n\n\nConsumer products\n\n\n \n\n\n3,576\n\n\n \n\n\n \n\n\n \n\n\n3,813\n\n\n \n\n\n \n\n\n \n\n\n10,598\n\n\n \n\n\n \n\n\n \n\n\n11,040\n\n\n \n\n\n\n\n\n\n \n\n\n$\n\n\n20,047\n\n\n \n\n\n \n\n\n$\n\n\n19,675\n\n\n \n\n\n \n\n\n$\n\n\n58,782\n\n\n \n\n\n \n\n\n$\n\n\n58,044\n\n\n \n\n\n\n\n\n\nPre-tax earnings:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nIndustrial products\n\n\n$\n\n\n1,851\n\n\n \n\n\n \n\n\n$\n\n\n1,489\n\n\n \n\n\n \n\n\n$\n\n\n5,260\n\n\n \n\n\n \n\n\n$\n\n\n4,710\n\n\n \n\n\n\n\n\n\nBuilding products\n\n\n \n\n\n1,151\n\n\n \n\n\n \n\n\n \n\n\n1,070\n\n\n \n\n\n \n\n\n \n\n\n3,078\n\n\n \n\n\n \n\n\n \n\n\n3,154\n\n\n \n\n\n\n\n\n\nConsumer products\n\n\n \n\n\n582\n\n\n \n\n\n \n\n\n \n\n\n576\n\n\n \n\n\n \n\n\n \n\n\n1,209\n\n\n \n\n\n \n\n\n \n\n\n1,314\n\n\n \n\n\n\n\n\n\n \n\n\n$\n\n\n3,584\n\n\n \n\n\n \n\n\n$\n\n\n3,135\n\n\n \n\n\n \n\n\n$\n\n\n9,547\n\n\n \n\n\n \n\n\n$\n\n\n9,178\n\n\n \n\n\n\n\n\n\nPre-tax earnings as a percentage of revenues:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nIndustrial products\n\n\n \n\n\n19.5\n\n\n%\n\n\n \n\n\n \n\n\n16.6\n\n\n%\n\n\n \n\n\n \n\n\n18.7\n\n\n%\n\n\n \n\n\n \n\n\n17.4\n\n\n%\n\n\n\n\n\n\nBuilding products\n\n\n \n\n\n16.4\n\n\n \n\n\n \n\n\n \n\n\n15.5\n\n\n \n\n\n \n\n\n \n\n\n15.3\n\n\n \n\n\n \n\n\n \n\n\n15.9\n\n\n \n\n\n\n\n\n\nConsumer products\n\n\n \n\n\n16.3\n\n\n \n\n\n \n\n\n \n\n\n15.1\n\n\n \n\n\n \n\n\n \n\n\n11.4\n\n\n \n\n\n \n\n\n \n\n\n11.9\n\n\n \n\n\n\n\n \n\n\n44\n\n\n\n\n \n\n\nItem 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations\n \nManufacturing, Service and Retailing\nIndustrial products\n \nThe industrial products group includes complex metal components and products for aerospace, power and general industrial markets (Precision Castparts Corp. (“PCC”)), specialty chemicals (The Lubrizol Corporation (“Lubrizol”)), metal cutting tools/systems (IMC International Metalworking Companies (“IMC”)), and Marmon Holdings, Inc. (“Marmon”), which consists of more than 100 autonomous manufacturing and service businesses, internally aggregated into twelve groups, and includes equipment leasing for the rail, intermodal tank container and mobile crane industries. The industrial products group also includes equipment and systems for the livestock and agricultural industries (CTB International), drag reducing agents for pipelines (LiquidPower Specialty Products), a structural steel fabrication products business (W&W|AFCO) and beginning in August 2025, a manufacturer of rodent control products (Bell Laboratories).\nRevenues of the industrial products group were $9.5 billion in the third quarter and $28.1 billion in the first nine months of 2025, increases of $515 million (5.8%) and $960 million (3.5%), respectively, compared to the same periods in 2024. Pre-tax earnings increased $362 million (24.3%) in the third quarter and $550 million (11.7%) in the first nine months of 2025 compared to 2024. Pre-tax earnings as a percentage of revenues for the group were 18.7% for the first nine months of 2025, an increase of 1.3 percentage points compared to 2024.\n \nPCC’s revenues were $2.7 billion in the third quarter and $8.1 billion in the first nine months of 2025, increases of 4.5% in the third quarter and 4.9% in the first nine months compared to 2024. Revenues from aerospace products in the first nine months of 2025 increased 8.5% from 2024. Revenues from power products in oil and gas markets and general industrial products declined. PCC’s pre-tax earnings increased 35.6% in the third quarter and 37.6% in the first nine months of 2025 compared to 2024. The earnings increases reflected the aerospace sales increases and improved manufacturing and operating efficiencies. Earnings in the third quarter and first nine months of 2025 also included insurance recoveries associated with a fire at a fasteners facility that occurred in the first quarter of 2025, which mitigated the earnings impact from the fire.\n \nLubrizol’s revenues were $1.6 billion in the third quarter and $4.75 billion in the first nine months of 2025, decreases of 1.4% and 3.7%, respectively, compared to the same periods in 2024. The declines were attributable to lower volumes and selling prices across most regions and markets, partially offset by favorable product mix. Lubrizol’s pre-tax earnings declined 2.7% in the third quarter and 13.8% in the first nine months of 2025 compared to 2024. The declines were primarily due to lower selling prices and volumes, higher manufacturing costs and restructuring and non-recurring charges, partially offset by lower raw material costs and selling, general and administrative expenses and favorable product mix.\n \nMarmon’s revenues were $3.2 billion in the third quarter and $9.7 billion in the first nine months of 2025, increases of 4.3% in the third quarter and 4.5% in the first nine months compared to 2024. In the first nine months of 2025, Rail & Leasing group revenues increased 9.5%, attributable to higher average lease rates and higher repair and sales volumes, while revenues increased in the Water Technologies (11.6%) and Transportation Products (5.5%) groups, primarily due to volume increases. Additionally, revenues increased in the Plumbing & Refrigeration group (11.0%) due to higher volumes and copper prices and the Electrical group (4.7%), principally due to higher copper prices. These increases were partially offset by revenue declines in the Metal Services group (8.1%) due to lower demand and the Crane Services group (11.6%), attributable to lower volumes and prices.\n \nMarmon’s pre-tax earnings increased 19.7% in the third quarter and 7.5% in the first nine months of 2025 compared to 2024. The comparative increase in earnings in the third quarter of 2025 was driven by the Rail & Leasing, Transportation Products, Retail Solutions and Plumbing & Refrigeration groups. The Rail & Leasing group’s earnings increase reflected higher lease rates, gains from asset sales and improved operational efficiencies in the repair operations. The third quarter earnings increase in the Transportation Products and Retail Solutions groups were primarily attributable to higher revenues, whereas the earnings increase in the Plumbing & Refrigeration group reflected higher volumes and copper spreads. Operating results among the twelve business groups for the first nine months of 2025 were mixed compared to 2024. The Plumbing & Refrigeration, Transportation Products, Water Technologies, Retail Solutions, Rail & Leasing, Industrial Products and Specialty groups contributed meaningful increases in earnings, due to a combination of higher revenue, copper spreads and operating margins. These increases were partially offset by declines in the Electrical and Metal Services groups. Earnings in the first nine months of 2025 also included income from the reduction and settlement of liabilities in connection with a prior business acquisition.\n\n\n45\n\n\n\n\n \n\n\nItem 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations\n \nManufacturing, Service and Retailing\n \nIMC’s revenues were $1.0 billion in the third quarter and $3.0 billion in the first nine months of 2025, increases of 7.9% and 2.1%, respectively, over the corresponding 2024 periods. The comparative increases in revenues were primarily attributable to price increases due to higher raw materials costs and the impact of business acquisitions, partially offset by lower sales across many regions, attributable to sluggish customer demand. IMC’s pre-tax earnings increased 21.9% in the third quarter, largely attributable to an increase in investment and other income, and declined 5.1% in the first nine months of 2025 compared to 2024. Earnings in the first nine months of 2025 were negatively impacted by lower gross margin rates from higher raw materials costs and unfavorable manufacturing variances and changes in product mix and increased selling, general and administrative expenses, partially offset by higher investment and other income. IMC operates globally, and a large portion of its products are manufactured in Israel. IMC’s operations in Israel have not been significantly impacted by the conflicts in the region.\n \nBuilding products\n \nThe building products group includes manufactured and site-built home construction and related lending and financial services (Clayton Homes). Other building products businesses include: flooring (Shaw), insulation, roofing and engineered products (Johns Manville), bricks and masonry products (Acme Brick), paint and coatings (Benjamin Moore) and residential and commercial construction and engineering products and systems (MiTek).\n \nRevenues of the building products group increased $94 million (1.4%) in the third quarter and $220 million (1.1%) in the first nine months of 2025 compared to 2024. Pre-tax earnings of the group increased $81 million (7.6%) in the third quarter and declined $76 million (2.4%) in the first nine months of 2025 compared to 2024. Certain of our building products businesses are experiencing slowing customer demand, as well as pricing pressures, attributable to prevailing general economic conditions and residential housing markets.\n \nClayton Homes’ revenues increased 2.7% to $3.3 billion in the third quarter and 5.0% to $9.6 billion in the first nine months of 2025 compared to 2024. Revenues from home sales were essentially unchanged in the third quarter and increased $136 million (2.0%) in the first nine months of 2025 compared to the 2024 periods. New home unit sales were flat in the third quarter and increased 1.8% in the first nine months of 2025 compared to 2024. Financial services revenues increased 12.0% in the third quarter and 13.6% in the first nine months of 2025 compared to 2024, primarily due to increased interest income from higher average loan balances and average interest rates. Loan balances, net of allowances for credit losses, were approximately $28.9 billion as of September 30, 2025, an increase of 9.4% since September 30, 2024. Loan portfolio balances are largely funded by borrowings from Berkshire finance affiliates.\n \nPre-tax earnings of Clayton Homes increased $74 million (16.0%) in the third quarter and $40 million (2.8%) in the first nine months of 2025 compared to 2024, primarily attributable to increased earnings from financial services, partially offset by lower earnings from home building activities. The increases in financial services earnings were primarily due to lower insurance claims and higher interest income, partially offset by increases in interest expense on borrowings from Berkshire finance affiliates. Interest expense increased $252 million in the first nine months of 2025 versus 2024, largely attributable to increased borrowings. The corresponding interest income on such borrowings is included in the “Other” earnings section on page 49.\n \nOther building products businesses revenues were $3.7 billion in the third quarter of 2025, relatively unchanged from 2024, and $10.6 billion in the first nine months of 2025, a decline of 2.1% compared to 2024. The year-to-date decline generally reflected lower unit volumes, pricing pressures and the impact of a divesture in 2025. Pre-tax earnings of our other building products businesses increased $7 million (1.2%) in the third quarter and declined $116 million (6.6%) in the first nine months of 2025 compared to 2024. Earnings as a percentage of revenues in the first nine months of 2025 declined 0.7 percentage points versus 2024. The earnings decline in the first nine months of 2025 was primarily attributable to overall lower sales and average gross margin rates, partially offset by lower restructuring and legal expenses compared to 2024.\n \nConsumer products\n \nThe consumer products group includes leisure vehicles (Forest River), several apparel and footwear operations (including Fruit of the Loom, Garan, H.H. Brown Shoe Group and Brooks Sports) and a manufacturer of high-performance alkaline batteries (Duracell). This group also includes a global toy company (Jazwares), jewelry products (Richline) and custom picture framing products (Larson-Juhl).\n \nConsumer products group revenues declined $237 million (6.2%) in the third quarter and $442 million (4.0%) in the first nine months of 2025 compared to 2024. The revenue declines in 2025 were primarily due to Fruit of the Loom, Jazwares and Duracell, largely attributable to lower sales volumes. These declines were partially offset by revenue increases at Brooks Sports, Forest River and Richline, attributable to combinations of higher volumes, changes in sales mix and/or higher prices from higher materials and input costs.\n\n\n46\n\n\n\n\n \n\n\nItem 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations\n \nManufacturing, Service and Retailing\n \nPre-tax earnings of our consumer products group were relatively unchanged in the third quarter and declined $105 million (8.0%) in the first nine months of 2025 compared to 2024. In the third quarter of 2025, Duracell determined certain of its battery product components manufactured in the U.S. were eligible for the refundable advanced manufacturing production income tax credits beginning in the 2023 tax year. Duracell recorded the eligible credits for the 2023, 2024 and first nine months of 2025 periods in the third quarter of 2025. Under U.S. GAAP, these credits are reflected in pre-tax earnings, not as income tax expense. Before the impact of these credits, pre-tax earnings of the consumer products group declined significantly in the third quarter and in the first nine months of 2025 compared to 2024. These declines were primarily attributable to lower earnings from Jazwares, Forest River, Duracell, and Fruit of the Loom, generally reflecting lower gross margins and higher selling, general and administrative expenses, as percentages of revenues and were partially offset by higher earnings from Brooks Sports, attributable to a combination of increased sales and gross margins.\n \nService and retailing\n \nA summary of revenues and pre-tax earnings of our service and retailing businesses follows (dollars in millions).\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\nThird Quarter\n\n\n \n\n\n \n\n\nFirst Nine Months\n\n\n \n\n\n\n\n\n\n \n\n\n2025\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2025\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n\n\n\n\nRevenues:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nService\n\n\n$\n\n\n5,752\n\n\n \n\n\n \n\n\n$\n\n\n5,130\n\n\n \n\n\n \n\n\n$\n\n\n16,922\n\n\n \n\n\n \n\n\n$\n\n\n15,492\n\n\n \n\n\n\n\n\n\nMcLane\n\n\n \n\n\n13,191\n\n\n \n\n\n \n\n\n \n\n\n12,723\n\n\n \n\n\n \n\n\n \n\n\n37,967\n\n\n \n\n\n \n\n\n \n\n\n37,656\n\n\n \n\n\n\n\n\n\nRetailing\n\n\n \n\n\n4,841\n\n\n \n\n\n \n\n\n \n\n\n4,712\n\n\n \n\n\n \n\n\n \n\n\n14,496\n\n\n \n\n\n \n\n\n \n\n\n14,000\n\n\n \n\n\n\n\n\n\nPilot\n\n\n \n\n\n10,882\n\n\n \n\n\n \n\n\n \n\n\n10,630\n\n\n \n\n\n \n\n\n \n\n\n31,421\n\n\n \n\n\n \n\n\n \n\n\n36,132\n\n\n \n\n\n\n\n\n\n \n\n\n$\n\n\n34,666\n\n\n \n\n\n \n\n\n$\n\n\n33,195\n\n\n \n\n\n \n\n\n$\n\n\n100,806\n\n\n \n\n\n \n\n\n$\n\n\n103,280\n\n\n \n\n\n\n\n\n\nPre-tax earnings:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nService\n\n\n$\n\n\n678\n\n\n \n\n\n \n\n\n$\n\n\n569\n\n\n \n\n\n \n\n\n$\n\n\n2,055\n\n\n \n\n\n \n\n\n$\n\n\n1,793\n\n\n \n\n\n\n\n\n\nMcLane\n\n\n \n\n\n173\n\n\n \n\n\n \n\n\n \n\n\n145\n\n\n \n\n\n \n\n\n \n\n\n530\n\n\n \n\n\n \n\n\n \n\n\n452\n\n\n \n\n\n\n\n\n\nRetailing\n\n\n \n\n\n302\n\n\n \n\n\n \n\n\n \n\n\n308\n\n\n \n\n\n \n\n\n \n\n\n971\n\n\n \n\n\n \n\n\n \n\n\n961\n\n\n \n\n\n\n\n\n\nPilot\n\n\n \n\n\n(17\n\n\n)\n\n\n \n\n\n \n\n\n217\n\n\n \n\n\n \n\n\n \n\n\n270\n\n\n \n\n\n \n\n\n \n\n\n486\n\n\n \n\n\n\n\n\n\n \n\n\n$\n\n\n1,136\n\n\n \n\n\n \n\n\n$\n\n\n1,239\n\n\n \n\n\n \n\n\n$\n\n\n3,826\n\n\n \n\n\n \n\n\n$\n\n\n3,692\n\n\n \n\n\n\n\n\n\nPre-tax earnings as a percentage of revenues:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nService\n\n\n \n\n\n11.8\n\n\n%\n\n\n \n\n\n \n\n\n11.1\n\n\n%\n\n\n \n\n\n \n\n\n12.1\n\n\n%\n\n\n \n\n\n \n\n\n11.6\n\n\n%\n\n\n\n\n\n\nMcLane\n\n\n \n\n\n1.3\n\n\n \n\n\n \n\n\n \n\n\n1.1\n\n\n \n\n\n \n\n\n \n\n\n1.4\n\n\n \n\n\n \n\n\n \n\n\n1.2\n\n\n \n\n\n\n\n\n\nRetailing\n\n\n \n\n\n6.2\n\n\n \n\n\n \n\n\n \n\n\n6.5\n\n\n \n\n\n \n\n\n \n\n\n6.7\n\n\n \n\n\n \n\n\n \n\n\n6.9\n\n\n \n\n\n\n\n\n\nPilot\n\n\n \n\n\n(0.2\n\n\n)\n\n\n \n\n\n \n\n\n2.0\n\n\n \n\n\n \n\n\n \n\n\n0.9\n\n\n \n\n\n \n\n\n \n\n\n1.3\n\n\n \n\n\n\n\nService\n \nOur service businesses include NetJets and FlightSafety (aviation services), which offer shared ownership programs for general aviation aircraft and high technology training products and services to operators of aircraft, and TTI, a distributor of electronics components. Our other service businesses franchise and service a network of quick service restaurants (Dairy Queen), lease transportation equipment (XTRA) and furniture (CORT), provide third party logistics services that primarily serve the petroleum and chemical industries (Charter Brokerage), distribute electronic news, multimedia and regulatory filings (Business Wire), provide various facilities engineering and construction management services (IPS-Integrated Project Services, LLC (IPS)) and operate a television station in Miami, Florida (WPLG). McLane, which we view as a service business, is addressed separately, since it is deemed a separate segment for financial reporting purposes.\n \nService group revenues increased $622 million (12.1%) in the third quarter and $1.4 billion (9.2%) in the first nine months of 2025 compared to 2024. The revenue increases in each period were primarily attributable to higher revenues from aviation services (9.7% year-to-date), IPS (23.9% year-to-date) and TTI (7.9% year-to-date). The revenue increases from aviation services reflected increases in the number of aircraft in shared aircraft ownership programs and in-flight hours across NetJets’ various programs and higher average rates. The increases at TTI reflected higher customer demand in certain geographic regions. The increases at IPS were attributable to revenues from life sciences and data center design, construction management and other construction consulting services.\n \n\n\n47\n\n\n\n\n \n\n\nItem 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations\n \nManufacturing, Service and Retailing\n \nService group pre-tax earnings increased $109 million (19.2%) in the third quarter and $262 million (14.6%) in the first nine months of 2025 compared to 2024, primarily attributable to increases from aviation services and TTI. Pre-tax earnings as a percentage of revenues rose 0.5 percentage points in the first nine months of 2025 compared to 2024. The earnings increases from aviation services were primarily attributable to increased revenues, partially offset by higher flight crew and instructor costs and higher maintenance, fuel, and depreciation expenses. TTI’s earnings increases reflected increases in revenues and lower selling general and administrative expenses, as percentages of revenues, partially offset by lower gross margin rates.\nMcLane\n \nMcLane operates wholesale distribution businesses that provide grocery and non-food consumer products to retailers and convenience stores (“retail”) and to restaurants (“restaurant”). McLane also operates businesses that are wholesale distributors of distilled spirits, wine and beer (“beverage”). The retail and restaurant businesses generate high sales and very low profit margins and operate in a highly competitive environment. These businesses have several significant customers and a reduction in purchasing by any of these customers could have an adverse impact on McLane’s revenues and earnings.\n \nMcLane’s revenues increased 3.7% in the third quarter and 0.8% in the first nine months of 2025 compared to 2024. Sales in 2025 generally reflected higher prices due to inventory cost inflation and a comparative increase in restaurant business unit volumes in the third quarter. Pre-tax earnings increased $28 million (19.3%) in the third quarter and $78 million (17.3%) in the first nine months of 2025 compared to 2024, reflecting increases in the overall gross margin rates, partially offset by higher selling, general and administrative expenses.\n \nRetailing\n \nOur retailing businesses include Berkshire Hathaway Automotive, Inc. (“BHA”), which consists of over 80 auto dealerships that sell new and pre-owned automobiles and offer repair services and related products. BHA also offers and insures vehicle service contracts and related insurance products. Our retailing businesses also include four home furnishings businesses (NFM, R.C. Willey, Star Furniture and Jordan’s), which sell furniture, appliances, flooring and electronics. Other retailing businesses include three jewelry businesses (Borsheims, Helzberg and Ben Bridge), See’s Candies (confectionery products), Pampered Chef (high quality kitchen tools), Oriental Trading Company (party supplies, school supplies and toys and novelties) and Detlev Louis Motorrad (“Louis”), a retailer of motorcycle accessories based in Germany. Pilot Travel Centers (“Pilot”), which is primarily a retail business, is addressed separately since it is deemed a separate segment for financial reporting purposes.\n \nRetailing group aggregate revenues increased 2.7% in the third quarter and 3.5% in the first nine months of 2025 compared to 2024. BHA’s revenues, which represented about 71% of our retailing group’s revenues in 2025, increased 4.0% in the third quarter and 5.5% in the first nine months of 2025 as compared to 2024. The increases reflected a 5.7% year-to-date increase in new and pre-owned vehicle sales revenues, primarily due to increased new units sold, higher average prices and changes in sales mix. BHA’s finance/service contract revenues increased 8.8% in the first nine months of 2025, while parts/service/repair operations revenues increased 2.2% compared to 2024. Revenues of the other retailing businesses declined 0.9% in the first nine months of 2025 versus 2024. Several of our other retailing businesses experienced sluggish customer demand in the first nine months of 2025, attributable to a combination of increased competition and the impacts of higher economic uncertainty and changes in consumer confidence.\n \nRetailing group pre-tax earnings declined $6 million (1.9%) in the third quarter and increased $10 million (1.0%) in the first nine months of 2025 compared to 2024. BHA’s pre-tax earnings increased 1.8% in the third quarter and 3.4% in the first nine months of 2025 compared to 2024, attributable to earnings increases from parts/service/repair and finance/service contract operations, partly offset by lower gross profit margins and higher selling, general and administrative expenses. Aggregate pre-tax earnings for the remainder of our retailing group declined $11 million (22.7%) in the third quarter and $15 million (7.4%) in the first nine months of 2025 compared to 2024.\nPilot\n \nPilot operates travel centers, primarily under the names Pilot or Flying J, and fuel-only retail locations. Pilot also operates large wholesale fuel and fuel marketing platforms in the U.S. We acquired the remaining 20% noncontrolling interest in Pilot on January 16, 2024.\n \nPilot’s revenues increased $252 million (2.4%) in the third quarter and declined $4.7 billion (13.0%) in the first nine months of 2025 compared to 2024. The year-to-date decline was primarily attributable to significantly lower volumes from bulk fuel sales and fuel trading activities, as well as lower average fuel prices and wholesale fuel volumes, partially offset by increased retail fuel volumes.\n \n\n\n48\n\n\n\n\n \n\n\nItem 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations\n \nManufacturing, Service and Retailing\n \nPilot’s pre-tax earnings declined $234 million (107.8%) in the third quarter and $216 million (44.4%) in the first nine months of 2025 compared to 2024. Earnings in the third quarter and first nine months of 2025 were negatively impacted by lower wholesale fuel and in-store gross margins and higher selling, general and administrative expenses, primarily due to higher employee compensation and benefits, insurance and maintenance costs, as well as by charges from adjustments to certain fuel-related balance sheet accounts. These effects were partially offset by lower interest expense, primarily attributable to reduced borrowing levels, and gains from asset dispositions in the first quarter. Pilot’s borrowings were $3.9 billion at September 30, 2025, which are currently from certain Berkshire insurance subsidiaries.\n \nInvestment Gains (Losses)\n \nA summary of investment gains (losses) follows (dollars in millions).\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\nThird Quarter\n\n\n \n\n\n \n\n\nFirst Nine Months\n\n\n \n\n\n\n\n\n\n \n\n\n2025\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2025\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n\n\n\n\nInvestment gains (losses)\n\n\n$\n\n\n21,939\n\n\n \n\n\n \n\n\n$\n\n\n20,514\n\n\n \n\n\n \n\n\n$\n\n\n21,868\n\n\n \n\n\n \n\n\n$\n\n\n46,247\n\n\n \n\n\n\n\n\n\nIncome taxes and noncontrolling interests\n\n\n \n\n\n4,628\n\n\n \n\n\n \n\n\n \n\n\n4,353\n\n\n \n\n\n \n\n\n \n\n\n4,625\n\n\n \n\n\n \n\n\n \n\n\n9,856\n\n\n \n\n\n\n\n\n\nNet earnings\n\n\n$\n\n\n17,311\n\n\n \n\n\n \n\n\n$\n\n\n16,161\n\n\n \n\n\n \n\n\n$\n\n\n17,243\n\n\n \n\n\n \n\n\n$\n\n\n36,391\n\n\n \n\n\n\n\n\n\nEffective income tax rate\n\n\n \n\n\n21.1\n\n\n%\n\n\n \n\n\n \n\n\n21.1\n\n\n%\n\n\n \n\n\n \n\n\n21.1\n\n\n%\n\n\n \n\n\n \n\n\n21.2\n\n\n%\n\n\n\n\nUnrealized gains and losses arising from changes in market prices of our investments in equity securities are included in our reported earnings, which significantly increases the volatility of our periodic net earnings due to the magnitude of our equity securities portfolio and the inherent volatility of equity securities prices. Unrealized gains and losses on our investments in equity securities also include the effects of changes in foreign currency exchange rates on investments in equity securities of non-U.S. issuers that are held by our U.S.-based subsidiaries.\n \nPre-tax investment gains and losses included unrealized gains of $20.6 billion in the third quarter and $23.6 billion in the first nine months of 2025 and $18.6 billion in the third quarter and $45.1 billion in the first nine months of 2024, attributable to changes during the period in market prices on equity securities we held at the end of each period. Taxable investment gains and losses on equity securities sold, which is generally the difference between sales proceeds and the original cost basis of the securities sold, were gains of $10.4 billion in the third quarter and $18.7 billion in the first nine months of 2025 compared to gains of $23.4 billion in the third quarter and $97.1 billion in the first nine months of 2024.\n \nWe believe that investment gains and losses, whether realized from sales or unrealized from changes in market prices, are often meaningless in terms of understanding our reported consolidated earnings or evaluating our periodic economic performance. We also continue to believe the investment gains and losses recorded in earnings in any given period has little analytical or predictive value.\n \nOther\n \nA summary of after-tax other earnings (losses) follows (in millions).\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\nThird Quarter\n\n\n \n\n\n \n\n\nFirst Nine Months\n\n\n \n\n\n\n\n\n\n \n\n\n2025\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2025\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n\n\n\n\nInvestment income\n\n\n$\n\n\n904\n\n\n \n\n\n \n\n\n$\n\n\n371\n\n\n \n\n\n \n\n\n$\n\n\n2,639\n\n\n \n\n\n \n\n\n$\n\n\n995\n\n\n \n\n\n\n\n\n\nForeign currency exchange rate gains (losses) on Berkshire \n   and BHFC non-U.S. Dollar senior notes\n\n\n \n\n\n331\n\n\n \n\n\n \n\n\n \n\n\n(1,141\n\n\n)\n\n\n \n\n\n \n\n\n(1,259\n\n\n)\n\n\n \n\n\n \n\n\n(98\n\n\n)\n\n\n\n\n\n\nEquity method earnings\n\n\n \n\n\n276\n\n\n \n\n\n \n\n\n \n\n\n199\n\n\n \n\n\n \n\n\n \n\n\n576\n\n\n \n\n\n*\n\n\n \n\n\n824\n\n\n \n\n\n\n\n\n\nAcquisition accounting expenses\n\n\n \n\n\n(123\n\n\n)\n\n\n \n\n\n \n\n\n(127\n\n\n)\n\n\n \n\n\n \n\n\n(371\n\n\n)\n\n\n \n\n\n \n\n\n(389\n\n\n)\n\n\n\n\n\n\nOther earnings (losses)\n\n\n \n\n\n(7\n\n\n)\n\n\n \n\n\n \n\n\n20\n\n\n \n\n\n \n\n\n \n\n\n(131\n\n\n)\n\n\n \n\n\n \n\n\n(179\n\n\n)\n\n\n\n\n\n\n \n\n\n$\n\n\n1,381\n\n\n \n\n\n \n\n\n$\n\n\n(678\n\n\n)\n\n\n \n\n\n$\n\n\n1,454\n\n\n \n\n\n \n\n\n$\n\n\n1,153\n\n\n \n\n\n\n\n——————\n* Excludes an other-than-temporary impairment charge of $3.76 billion related to Berkshire’s investment in Kraft Heinz. See Note 5 to the Consolidated Financial Statements.\n \nInvestment income includes corporate interest income and dividend income not allocated to operating businesses. After-tax corporate investment income increased $533 million in the third quarter and $1.6 billion in the first nine months of 2025 compared to 2024, primarily due to increased investments in U.S. Treasury Bills, which derived largely from subsidiary dividends.\n \n\n\n49\n\n\n\n\n \n\n\nItem 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nOther\nForeign currency exchange rate gains and losses on Berkshire’s and BHFC’s senior notes represent the effects of changes in foreign currency exchange rates recognized in earnings from the periodic revaluation of non-U.S. Dollar denominated senior note liabilities into U.S. Dollars. The gains and losses recorded in any given period can be significant due to the magnitude of the borrowings and the inherent volatility in foreign currency exchange rates.\n \nEquity method earnings include our proportionate share of earnings of Kraft Heinz, Occidental and Berkadia. Occidental generated lower equity method earnings in the first nine months of 2025 compared to 2024. Additionally, during the second quarter of 2025, we began recording our share of Kraft Heinz’s earnings on a one-quarter lag.\nAcquisition accounting expenses include charges arising from the application of the acquisition method of accounting in connection with certain of Berkshire’s past business acquisitions. These charges are primarily from the amortization of intangible assets recorded in connection with those acquisitions. Other earnings and losses primarily include unallocated general and administrative expenses, interest expense, income tax expense and interest income on certain intercompany loans.\n \nFinancial Condition\n \nOur Consolidated Balance Sheet continues to reflect significant liquidity and a very strong capital base. Berkshire’s shareholders’ equity at September 30, 2025 was $698.2 billion, an increase of $48.8 billion since December 31, 2024. Net earnings attributable to Berkshire shareholders were $47.8 billion for the first nine months of 2025. Investment gains and losses from changes in the market prices of our investments in equity securities usually produce significant volatility in our earnings.\n \nBerkshire’s common stock repurchase program permits Berkshire to repurchase its Class A and Class B shares at prices below Berkshire’s intrinsic value, as conservatively determined by Warren Buffett, Berkshire’s Chairman of the Board and Chief Executive Officer. We are not committed to a minimum or subject to a maximum repurchase amount. We will not repurchase our stock if it reduces our consolidated cash, cash equivalents and U.S. Treasury Bills holdings to below $30 billion. Financial strength and redundant liquidity will always be of paramount importance at Berkshire. There were no share repurchases in the first nine months of 2025.\nAt September 30, 2025, our insurance and other businesses held cash, cash equivalents and U.S. Treasury Bills (net of payables for unsettled purchases) of $354.3 billion. Investments in equity and fixed maturity securities, excluding our equity method investments, were $301.2 billion.\n \nOur consolidated borrowings at September 30, 2025 were $127.2 billion, predominantly issued by Berkshire and BHFC, or by BNSF and BHE and its subsidiaries. Berkshire’s outstanding debt at September 30, 2025 was $22.5 billion, an increase of $1.4 billion since December 31, 2024. In the first nine months of 2025, Berkshire repaid approximately $1.6 billion of maturing debt. In April 2025, Berkshire issued ¥90 billion ($632 million) of senior notes with maturity dates ranging from 2028 to 2055 and a weighted average interest rate of 1.6%. In July 2025, Berkshire issued ¥151.5 billion ($1.0 billion) of senior notes maturing between 2030 and 2040 with a weighted average interest rate of 2.3%. Additionally, the carrying value of Berkshire’s non-U.S. Dollar denominated debt increased $1.3 billion in the first nine months of 2025 due to foreign currency exchange rate losses.\n \nSenior note borrowings of BHFC, a wholly-owned financing subsidiary, were approximately $18.3 billion at September 30, 2025, an increase of $338 million from December 31, 2024, primarily due to foreign currency exchange rate changes. BHFC’s borrowings are used to fund a portion of loans originated and acquired by Clayton Homes and equipment held for lease by Marmon’s railcar leasing business. Berkshire guarantees BHFC’s senior notes for the full and timely payment of principal and interest.\n \nBNSF’s outstanding debt was $23.5 billion as of September 30, 2025, relatively unchanged from December 31, 2024. In the first nine months of 2025, BNSF repaid term debt of approximately $900 million and in June 2025, issued $900 million of 5.8% debentures due in 2056. BHE’s aggregate borrowings were $58.1 billion at September 30, 2025, an increase of $1.7 billion from December 31, 2024. In the first nine months of 2025, BHE subsidiaries issued $3.1 billion of term debt, with a weighted average interest rate of 6.4% and maturity dates ranging from 2035 to 2055, and BHE and its subsidiaries repaid term debt of $2.4 billion and increased short-term borrowings by approximately $600 million. Berkshire does not guarantee the repayment of debt issued by BNSF, BHE or any of their subsidiaries or affiliates.\n \n\n\n50\n\n\n\n\n \n\n\nItem 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nFinancial Condition\n \nIn the first nine months of 2025, our diverse group of businesses generated net operating cash flows of $34.8 billion. Our consolidated capital expenditures for property, plant and equipment and equipment held for lease were $14.7 billion in the first nine months of 2025, which included capital expenditures by BNSF and BHE of $10.1 billion. BNSF and BHE maintain very large investments in capital assets (property, plant and equipment) and regularly make significant capital expenditures in the normal course of business. BHE and BNSF forecast capital expenditures of approximately $4.4 billion over the remainder of 2025.\n \nIn October 2025, Berkshire agreed to acquire the Occidental Petroleum Corporation’s chemicals business for $9.7 billion, subject to customary purchase price adjustments. The acquisition is subject to regulatory approvals and customary closing conditions and expected to close in the fourth quarter of 2025.\n \nContractual Obligations\n \nWe are party to other contracts associated with ongoing business activities, which will result in cash payments to counterparties in future periods. Certain obligations are included in our Consolidated Balance Sheets, such as borrowings, operating lease liabilities and shared aircraft repurchase liabilities.\n \nWe are also obligated to pay claims arising from property and casualty contracts issued by our insurance subsidiaries, including amounts from retroactive reinsurance. However, the timing and amount of the payments under insurance and reinsurance contracts are contingent upon the outcome of future events. Actual payments will likely vary, perhaps materially, from any forecasted payments, as well as from the liabilities recorded in our Consolidated Balance Sheets. We anticipate that these payments will be funded by operating cash flows.\nOther obligations pertaining to the acquisition of goods or services in the future, such as certain purchase obligations, are not currently reflected in the Consolidated Financial Statements and will be recognized in future periods as the goods are delivered or services are provided. Except as otherwise disclosed in this Quarterly Report, our contractual obligations as of September 30, 2025 were, in the aggregate, not materially different from those disclosed in “Management’s Discussion and Analysis of Financial Condition and Results of Operations” contained in Berkshire’s Annual Report on Form 10-K for the year ended December 31, 2024.\n \nCritical Accounting Estimates\n \nCertain accounting policies require us to make estimates and judgments in determining the amounts reflected in our Consolidated Financial Statements. Such estimates and judgments necessarily involve varying and possibly significant degrees of uncertainty. Accordingly, certain amounts currently recorded in our Consolidated Financial Statements will likely be adjusted in the future based on new available information and changes in other facts and circumstances. Reference is made to “Critical Accounting Estimates” discussed in “Management’s Discussion and Analysis of Financial Condition and Results of Operations” included in Berkshire’s Annual Report on Form 10-K for the year ended December 31, 2024.\nOur Consolidated Balance Sheet as of September 30, 2025 included estimated liabilities for unpaid losses and loss adjustment expenses from property and casualty insurance and reinsurance contracts of $151.1 billion. Due to the inherent uncertainties in the processes of establishing these liabilities, the actual ultimate claim amounts will likely differ from the currently recorded amounts. A very small percentage change in estimates of this magnitude can result in a material effect on periodic earnings. The effects from changes in these estimates are recorded as a component of insurance losses and loss adjustment expenses in the period of the change.\nOur Consolidated Balance Sheet as of September 30, 2025 included goodwill of acquired businesses of $84.5 billion and indefinite-lived intangible assets of $19.0 billion. In connection with the annual goodwill impairment review conducted in the fourth quarter of 2024, our estimated fair values of seven reporting units did not exceed our carrying values by at least 20%, as disclosed in our Annual Report on Form 10-K for the year ended December 31, 2024. Our estimated aggregate fair value of these units at that time was approximately $65.6 billion, which exceeded our aggregate carrying value of approximately $57.4 billion. Goodwill of these reporting units totaled approximately $18.6 billion.\n \nGoodwill and indefinite-lived intangible asset impairment reviews include determining the estimated fair values of the reporting units and of the indefinite-lived intangible assets. Several methods and inputs may be used to estimate fair values, and significant judgments are required in making such estimates. Due to the inherent subjectivity and uncertainty in forecasting future cash flows and earnings over long periods of time, actual results may differ materially from the forecasts.\n \n\n\n51\n\n\n\n\n \n\n\nItem 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations\n \nCritical Accounting Estimates\n \nAs of September 30, 2025, we concluded it was more likely than not that goodwill and other indefinite-lived intangible assets recorded in our Consolidated Balance Sheet were not impaired. However, the fair value estimates of the reporting units and assets are subject to change based on changes in market and economic conditions and events affecting our businesses, which we cannot reliably predict. It is reasonably possible that adverse changes in such conditions or events could result in the recognition of impairment losses in our Consolidated Financial Statements in the future.\n \nInformation concerning accounting pronouncements to be adopted in the future is included in Note 2 to the accompanying Consolidated Financial Statements.\n \nForward-Looking Statements\nInvestors are cautioned that certain statements contained in this document as well as some statements in periodic press releases and some oral statements of Berkshire officials during presentations about Berkshire or its subsidiaries are “forward-looking” statements within the meaning of the Private Securities Litigation Reform Act of 1995 (the “Act”). Forward-looking statements include statements which are predictive in nature, which depend upon or refer to future events or conditions, or which include words such as “expects,” “anticipates,” “intends,” “plans,” “believes,” “estimates” or similar expressions. In addition, any statements concerning future financial performance (including future revenues, earnings or growth rates), ongoing business strategies or prospects and possible future Berkshire actions, which may be provided by management, are also forward-looking statements as defined by the Act. Forward-looking statements are based on current expectations and projections about future events and are subject to risks, uncertainties and assumptions about Berkshire and its subsidiaries, economic and market factors and the industries in which we do business, among other things. These statements are not guarantees of future performance and we have no specific intention to update these statements.\n \nActual events and results may differ materially from those expressed or forecasted in forward-looking statements due to a number of factors. The principal risk factors that could cause our actual performance and future events and actions to differ materially from such forward-looking statements include, but are not limited to, changes in market prices of our investments in equity securities; the occurrence of one or more catastrophic events, such as an earthquake, hurricane, geopolitical conflict, act of terrorism or cyber-attack that causes losses insured by our insurance subsidiaries and/or losses to our business operations; the frequency and severity of epidemics, pandemics or other outbreaks, and other events that negatively affect our operating results and restrict our access to borrowed funds through the capital markets at reasonable rates; changes in laws or regulations affecting our insurance, railroad, utilities and energy and finance subsidiaries; changes in federal income tax laws; and changes in general economic and market factors that affect the prices of securities or the industries in which we do business.\n \n\n\n52"
}