{
  "source_file": "brka-20241231.htm",
  "form_type": "10-K",
  "item1": null,
  "item7": "Item 7. Management’s Discussion and Analysis of \nFinancial Condition and Results of Operations\n \n\n\nResults of Operations\n \n\n\nNet earnings (loss) attributable to Berkshire shareholders for each of the past three years are disaggregated in the table that follows. Amounts are after deducting income taxes and exclude earnings attributable to noncontrolling interests (in millions).\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n \n\n\n2022\n\n\n \n\n\n\n\n\n\nInsurance – underwriting\n\n\n$\n\n\n9,020\n\n\n \n\n\n \n\n\n$\n\n\n5,428\n\n\n \n\n\n \n\n\n$\n\n\n(30\n\n\n)\n\n\n\n\n\n\nInsurance – investment income\n\n\n \n\n\n13,670\n\n\n \n\n\n \n\n\n \n\n\n9,567\n\n\n \n\n\n \n\n\n \n\n\n6,484\n\n\n \n\n\n\n\n\n\nBNSF\n\n\n \n\n\n5,031\n\n\n \n\n\n \n\n\n \n\n\n5,087\n\n\n \n\n\n \n\n\n \n\n\n5,946\n\n\n \n\n\n\n\n\n\nBerkshire Hathaway Energy (“BHE”)\n\n\n \n\n\n3,730\n\n\n \n\n\n \n\n\n \n\n\n2,331\n\n\n \n\n\n \n\n\n \n\n\n3,904\n\n\n \n\n\n\n\n\n\nManufacturing, service and retailing\n\n\n \n\n\n13,072\n\n\n \n\n\n \n\n\n \n\n\n13,362\n\n\n \n\n\n \n\n\n \n\n\n12,512\n\n\n \n\n\n\n\n\n\nNon-controlled businesses*\n\n\n \n\n\n1,519\n\n\n \n\n\n \n\n\n \n\n\n1,750\n\n\n \n\n\n \n\n\n \n\n\n1,528\n\n\n \n\n\n\n\n\n\nInvestment gains (losses)\n\n\n \n\n\n41,558\n\n\n \n\n\n \n\n\n \n\n\n58,873\n\n\n \n\n\n \n\n\n \n\n\n(53,612\n\n\n)\n\n\n\n\n\n\nOther\n\n\n \n\n\n1,395\n\n\n \n\n\n \n\n\n \n\n\n(175\n\n\n)\n\n\n \n\n\n \n\n\n509\n\n\n \n\n\n\n\n\n\nNet earnings (loss) attributable to Berkshire shareholders\n\n\n$\n\n\n88,995\n\n\n \n\n\n \n\n\n$\n\n\n96,223\n\n\n \n\n\n \n\n\n$\n\n\n(22,759\n\n\n)\n\n\n\n\n\n\n \n\n\n——————\n\n\n* Includes certain businesses in which Berkshire had between a 20% and 50% ownership interest.\n \n\n\nThrough our subsidiaries, we engage in numerous diverse business activities. The business segment data (Note 26 to the accompanying Consolidated Financial Statements) should be referenced in conjunction with this discussion.\n \n\n\nOur periodic operating results may be affected in future periods due to impacts of ongoing macroeconomic and geopolitical events, as well as changes in industry or company-specific factors or events. We cannot reliably predict the future economic effects of these factors or events on our businesses.\n \n\n\nInsurance underwriting generated after-tax earnings of $9.0 billion in 2024 and $5.4 billion in 2023 and losses of $30 million in 2022. Earnings in 2024 and 2023 benefited from significantly improved operating results at GEICO, which generated a significant loss in 2022. Underwriting results in 2024 also included estimated claims from Hurricanes Helene and Milton ($1.2 billion after-tax) and accruals in connection with a bankruptcy settlement agreement related to a non-insurance affiliate. Underwriting results in 2023 and 2022 included after-tax losses from significant catastrophe events of approximately $725 million and $2.4 billion, respectively. After-tax earnings from insurance investment income increased $4.1 billion in 2024 and $3.1 billion in 2023 compared to corresponding prior years, driven by higher interest income from short-term investments.\n \n\n\nAfter-tax earnings of BNSF declined 1.1% in 2024 compared to 2023 and 14.4% in 2023 compared to 2022. Earnings in 2024 benefited from higher unit volume, improvements in employee productivity and lower other operating costs, and were negatively impacted by charges related to a labor agreement in the fourth quarter of 2024 and litigation charges related to an ongoing legal case. The decrease in 2023 was primarily attributable to lower overall freight volumes and higher non-fuel operating costs, partially offset by lower fuel costs.\n \n\n\nAfter-tax earnings of our utilities and energy business increased $1.4 billion in 2024 compared to 2023 and declined $1.6 billion in 2023 compared to 2022. The earnings increase in 2024 reflected lower estimated wildfire loss accruals at PacifiCorp and higher earnings from natural gas pipelines, primarily due to reductions in earnings attributable to noncontrolling interests, and other energy businesses. The earnings decline in 2023 reflected increased estimated wildfire loss accruals, as well as lower earnings from other energy and real estate brokerage businesses compared to 2022.\n \n\n\nEarnings from our manufacturing, service and retailing businesses decreased 2.2% in 2024 compared to 2023 and increased 6.8% in 2023 compared to 2022. The earnings decline in 2024 reflected lower earnings from our service and retailing businesses, partially offset by earnings increases at several of our manufacturing businesses. The earnings increase in 2023 reflected increases at certain industrial products manufacturers and service businesses, the full year impact of Alleghany’s non-insurance businesses acquired in 2022 and earnings from Pilot Travel Centers for the eleven months ending December 31, 2023, partially offset by lower earnings at several of our other manufacturing businesses and at certain of our service and retailing businesses.\n \n\n\nK-\n33\n\n\n\n\n \n\n\nManagement’s Discussion and Analysis\n \n\n\nResults of Operations\n \n\n\nInvestment gains (losses) predominantly derive from our investments in equity securities and include significant unrealized gains and losses from changes in market prices and foreign currency exchange rates applicable to certain of our investments. We believe that investment gains and losses, whether realized from dispositions or unrealized from changes in market prices, are generally meaningless in understanding our reported periodic results or evaluating the economic performance of our operating businesses. These gains and losses have caused and will continue to cause significant volatility in our periodic earnings. Investment gains in 2023 also included an after-tax non-cash remeasurement gain of approximately $2.4 billion related to our previously held 38.6% interest in Pilot through the application of the acquisition accounting method.\n\n\nOther earnings included after-tax foreign currency exchange rate gains of $1.1 billion in 2024, $211 million in 2023 and $1.3 billion in 2022 related to the non-U.S. Dollar denominated debt issued by Berkshire and Berkshire Hathaway Finance Corporation (“BHFC”).\n \n\n\nInsurance—Underwriting\n \n\n\nOur periodic underwriting earnings may be subject to considerable volatility from the timing and magnitude of significant property catastrophe loss events. Further, we generally do not retrocede the risks we assume. We currently consider consolidated pre-tax losses exceeding $150 million from an event occurring in the current year to be significant. Significant events in 2024 included Hurricanes Milton and Helene, while significant events in 2023 included a cyclone and floods in New Zealand and a hailstorm in Italy. In 2022, significant events were Hurricane Ian and floods in Australia. In January 2025, several wildfires broke out in Southern California resulting in thousands of destroyed or damaged structures. We preliminarily estimate our insurance group could incur pre-tax losses of approximately $1.3 billion from these wildfires. Changes in estimates for unpaid losses and loss adjustment expenses, including amounts established for occurrences in prior years, and foreign currency transaction gains and losses arising from the changes in the valuation of non-U.S. Dollar denominated assets and liabilities can also significantly affect our periodic underwriting results.\n \n\n\nWe write primary insurance and reinsurance policies covering property and casualty risks, as well as life and health risks. Our insurance and reinsurance businesses are GEICO, Berkshire Hathaway Primary Group (“BH Primary”) and Berkshire Hathaway Reinsurance Group (“BHRG”). We strive to generate pre-tax underwriting earnings (defined as premiums earned less insurance losses/benefits incurred and underwriting expenses) over the long term in all business categories, except in our retroactive reinsurance and periodic payment annuity businesses. Time-value-of-money is an important consideration in establishing premiums for these policies, which we normally receive at the contract inception date. Claim and benefit payments can extend for decades and are expected to exceed premiums, producing underwriting losses over the claim settlement periods through changes in deferred charge assets established on retroactive reinsurance contracts and accretion of discounted annuity liabilities, as well as changes in the estimated ultimate liabilities.\n\n\nUnderwriting results of our insurance businesses are summarized below (dollars in millions).\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n \n\n\n2022\n\n\n \n\n\n\n\n\n\nPre-tax underwriting earnings (loss):\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nGEICO\n\n\n$\n\n\n7,813\n\n\n \n\n\n \n\n\n$\n\n\n3,635\n\n\n \n\n\n \n\n\n$\n\n\n(1,880\n\n\n)\n\n\n\n\n\n\nBerkshire Hathaway Primary Group\n\n\n \n\n\n855\n\n\n \n\n\n \n\n\n \n\n\n1,374\n\n\n \n\n\n \n\n\n \n\n\n393\n\n\n \n\n\n\n\n\n\nBerkshire Hathaway Reinsurance Group\n\n\n \n\n\n2,737\n\n\n \n\n\n \n\n\n \n\n\n1,904\n\n\n \n\n\n \n\n\n \n\n\n1,465\n\n\n \n\n\n\n\n\n\nPre-tax underwriting earnings (loss)\n\n\n \n\n\n11,405\n\n\n \n\n\n \n\n\n \n\n\n6,913\n\n\n \n\n\n \n\n\n \n\n\n(22\n\n\n)\n\n\n\n\n\n\nIncome taxes and noncontrolling interests\n\n\n \n\n\n2,385\n\n\n \n\n\n \n\n\n \n\n\n1,485\n\n\n \n\n\n \n\n\n \n\n\n8\n\n\n \n\n\n\n\n\n\nNet underwriting earnings (loss)\n\n\n$\n\n\n9,020\n\n\n \n\n\n \n\n\n$\n\n\n5,428\n\n\n \n\n\n \n\n\n$\n\n\n(30\n\n\n)\n\n\n\n\n\n\nEffective income tax rate\n\n\n \n\n\n20.9\n\n\n%\n\n\n \n\n\n \n\n\n21.5\n\n\n%\n\n\n \n\n\n*\n\n\n \n\n\n\n\n\n\n——————\n\n\n* Not meaningful.\n \n\n\nK-\n34\n\n\n\n\n \n\n\nManagement’s Discussion and Analysis\n \n\n\nInsurance—Underwriting\n \n\n\nGEICO\n \n\n\nGEICO writes property and casualty policies, primarily private passenger automobile insurance, in all 50 states and the District of Columbia. GEICO markets its policies mainly by direct response methods where most customers apply for coverage directly to the company via the Internet or over the telephone. GEICO also operates an insurance agency that offers primarily homeowners and renters insurance to its auto policyholders. A summary of GEICO’s underwriting results follows (dollars in millions).\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n \n\n\n2022\n\n\n \n\n\n\n\n\n\n \n\n\nAmount\n\n\n \n\n\n \n\n\n%\n\n\n \n\n\n \n\n\nAmount\n\n\n \n\n\n \n\n\n%\n\n\n \n\n\n \n\n\nAmount\n\n\n \n\n\n \n\n\n%\n\n\n \n\n\n\n\n\n\nPremiums written\n\n\n$\n\n\n42,916\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n$\n\n\n39,837\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n$\n\n\n39,107\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nPremiums earned\n\n\n$\n\n\n42,252\n\n\n \n\n\n \n\n\n \n\n\n100.0\n\n\n \n\n\n \n\n\n$\n\n\n39,264\n\n\n \n\n\n \n\n\n \n\n\n100.0\n\n\n \n\n\n \n\n\n$\n\n\n38,984\n\n\n \n\n\n \n\n\n \n\n\n100.0\n\n\n \n\n\n\n\n\n\nLosses and loss adjustment expenses\n\n\n \n\n\n30,331\n\n\n \n\n\n \n\n\n \n\n\n71.8\n\n\n \n\n\n \n\n\n \n\n\n31,814\n\n\n \n\n\n \n\n\n \n\n\n81.0\n\n\n \n\n\n \n\n\n \n\n\n36,297\n\n\n \n\n\n \n\n\n \n\n\n93.1\n\n\n \n\n\n\n\n\n\nUnderwriting expenses\n\n\n \n\n\n4,108\n\n\n \n\n\n \n\n\n \n\n\n9.7\n\n\n \n\n\n \n\n\n \n\n\n3,815\n\n\n \n\n\n \n\n\n \n\n\n9.7\n\n\n \n\n\n \n\n\n \n\n\n4,567\n\n\n \n\n\n \n\n\n \n\n\n11.7\n\n\n \n\n\n\n\n\n\nTotal losses and expenses\n\n\n \n\n\n34,439\n\n\n \n\n\n \n\n\n \n\n\n81.5\n\n\n \n\n\n \n\n\n \n\n\n35,629\n\n\n \n\n\n \n\n\n \n\n\n90.7\n\n\n \n\n\n \n\n\n \n\n\n40,864\n\n\n \n\n\n \n\n\n \n\n\n104.8\n\n\n \n\n\n\n\n\n\nPre-tax underwriting earnings (loss)\n\n\n$\n\n\n7,813\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n$\n\n\n3,635\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n$\n\n\n(1,880\n\n\n)\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n2024 versus 2023\n\n\nGEICO’s pre-tax underwriting earnings increase in 2024 compared to 2023 reflected higher average premiums per auto policy, lower claims frequencies and improved operating efficiencies. These effects were partially offset by less favorable development of prior accident years’ claims estimates, increases in average claims severities and losses from catastrophe events.\n \n\n\nPremiums written increased $3.1 billion (7.7%) in 2024 compared to 2023, reflecting an increase in average written premiums per auto policy of 7.8%, primarily attributable to rate increases, partially offset by a 0.5% decrease in policies-in-force over the past year. The rate of decline in policies-in-force slowed in the first half of 2024, with growth experienced in the second half of the year. Premiums earned in 2024 increased $3.0 billion (7.6%) compared to 2023.\n \n\n\nLosses and loss adjustment expenses decreased $1.5 billion (4.7%) in 2024 compared to 2023. GEICO’s loss ratio (losses and loss adjustment expenses to premiums earned) was 71.8% in 2024 and 81.0% in 2023. The loss ratio decline reflected the impact of higher average earned premiums per auto policy and lower claims frequencies, partially offset by increases in average claims severities and less favorable development of prior accident years’ claims estimates.\n \n\n\nClaims frequencies declined in 2024 versus 2023 for property damage (two to three percent range) and collision (eight to nine percent range) coverages, with bodily injury down slightly. Average claims severities increased in 2024 for property damage and collision (two to five percent range) and bodily injury coverages (eight to ten percent range) compared to 2023. Losses and loss adjustment expenses incurred in 2024 from Hurricanes Helene and Milton were approximately $360 million. Reductions in the ultimate loss estimates for prior accident years’ claims were $550 million in 2024 compared to $1.5 billion in 2023.\n \n\n\nUnderwriting expenses increased 7.7% in 2024 compared to 2023. GEICO’s expense ratio (underwriting expense to premiums earned) was 9.7% in 2024, unchanged from 2023, as improved operating efficiencies and increased operating leverage were offset by increased advertising expenses. The earnings from GEICO’s insurance agency (third-party commissions, net of operating expenses) are included as a reduction of underwriting expenses.\n \n\n\n2023 versus 2022\n\n\nGEICO’s pre-tax underwriting earnings increase in 2023 reflected higher average premiums per auto policy, lower claims frequencies, more favorable development of prior accident years’ claims estimates and lower advertising costs. However, average claims severities increased in 2023 due to higher auto repair parts prices, labor costs and medical inflation. GEICO sought rate increases in numerous states in 2022 and 2023 in response to accelerating claims costs.\n\n\nK-\n35\n\n\n\n\n \n\n\nManagement’s Discussion and Analysis\n \n\n\nInsurance—Underwriting\n \n\n\nGEICO\n \n\n\nPremiums written increased $730 million (1.9%) in 2023 compared to 2022, reflecting higher average premiums per auto policy (16.8%) due to rate increases, partially offset by a 9.8% decrease in policies-in-force. Premiums earned increased $280 million (0.7%) in 2023 compared to 2022. Reductions in advertising expenditures in 2022 and 2023 contributed to reductions of policies-in-force.\n \n\n\nLosses and loss adjustment expenses decreased $4.5 billion (12.4%) in 2023. GEICO’s loss ratio declined 12.1 percentage points compared to 2022, reflecting the impact of higher average premiums per auto policy, lower property damage and collision claims frequencies and increased favorable development of prior accident years’ claims estimates, partially offset by increases in average claims severities across all significant coverages. Average claim severities increased for property damage (fourteen to sixteen percent range), collision (four to six percent range) and bodily injury (five to seven percent range). Losses and loss adjustment expenses included reductions in the ultimate loss estimates for prior accident years’ claims of $1.5 billion in 2023 and $653 million in 2022.\n \n\n\nUnderwriting expenses decreased $752 million (16.5%) in 2023 compared to 2022. The expense ratio in 2023 was 9.7%, a decrease of 2.0 percentage points compared to 2022, attributable to reduced advertising expenses and improved operating leverage.\n \n\n\nBerkshire Hathaway Primary Group\n \n\n\nBH Primary consists of several independently managed businesses that provide a variety of primarily commercial insurance solutions, including healthcare professional liability, workers’ compensation, automobile, general liability, property and specialty coverages for small, medium and large clients. BH Primary’s insurers include Berkshire Hathaway Specialty Insurance (“BHSI”), RSUI Group Inc. and CapSpecialty, Inc. (“RSUI and CapSpecialty,” acquired in October 2022), Berkshire Hathaway Homestate companies (“BHHC”), MedPro Group, GUARD Insurance group of companies (“GUARD”), National Indemnity Company (“NICO Primary”), Berkshire Hathaway Direct (“BH Direct”) and U.S. Liability Insurance companies (“USLI”).\n \n\n\nA summary of BH Primary’s underwriting results follows (dollars in millions).\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n \n\n\n2022\n\n\n \n\n\n\n\n\n\n \n\n\nAmount\n\n\n \n\n\n \n\n\n%\n\n\n \n\n\n \n\n\nAmount\n\n\n \n\n\n \n\n\n%\n\n\n \n\n\n \n\n\nAmount\n\n\n \n\n\n \n\n\n%\n\n\n \n\n\n\n\n\n\nPremiums written\n\n\n$\n\n\n18,836\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n$\n\n\n18,142\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n$\n\n\n14,619\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nPremiums earned\n\n\n$\n\n\n18,733\n\n\n \n\n\n \n\n\n \n\n\n100.0\n\n\n \n\n\n \n\n\n$\n\n\n17,129\n\n\n \n\n\n \n\n\n \n\n\n100.0\n\n\n \n\n\n \n\n\n$\n\n\n13,746\n\n\n \n\n\n \n\n\n \n\n\n100.0\n\n\n \n\n\n\n\n\n\nLosses and loss adjustment expenses\n\n\n \n\n\n12,666\n\n\n \n\n\n \n\n\n \n\n\n67.6\n\n\n \n\n\n \n\n\n \n\n\n11,224\n\n\n \n\n\n \n\n\n \n\n\n65.5\n\n\n \n\n\n \n\n\n \n\n\n9,889\n\n\n \n\n\n \n\n\n \n\n\n71.9\n\n\n \n\n\n\n\n\n\nUnderwriting expenses\n\n\n \n\n\n5,212\n\n\n \n\n\n \n\n\n \n\n\n27.8\n\n\n \n\n\n \n\n\n \n\n\n4,531\n\n\n \n\n\n \n\n\n \n\n\n26.5\n\n\n \n\n\n \n\n\n \n\n\n3,464\n\n\n \n\n\n \n\n\n \n\n\n25.2\n\n\n \n\n\n\n\n\n\nTotal losses and expenses\n\n\n \n\n\n17,878\n\n\n \n\n\n \n\n\n \n\n\n95.4\n\n\n \n\n\n \n\n\n \n\n\n15,755\n\n\n \n\n\n \n\n\n \n\n\n92.0\n\n\n \n\n\n \n\n\n \n\n\n13,353\n\n\n \n\n\n \n\n\n \n\n\n97.1\n\n\n \n\n\n\n\n\n\nPre-tax underwriting earnings\n\n\n$\n\n\n855\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n$\n\n\n1,374\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n$\n\n\n393\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n2024 versus 2023\n\n\nPremiums written increased $694 million (3.8%) in 2024 compared to 2023, primarily due to increases at NICO Primary, BH Direct and BHHC, partially offset by a 16.3% reduction at GUARD. The increases at NICO Primary and BHHC were primarily attributable to commercial auto coverage, while the increase at BH Direct reflected growth across several product lines. The decline at GUARD resulted from management’s decision to exit admitted homeowners’ insurance and to tighten underwriting guidelines in other lines of business.\n \n\n\nLosses and loss adjustment expenses increased $1.4 billion (12.8%) and the loss ratio increased 2.1 percentage points in 2024 compared to 2023. Losses incurred included reductions of estimated ultimate losses for prior accident years’ claims of $52 million in 2024 and $537 million in 2023. The comparative decline reflected a significant increase in loss estimates at GUARD and lower reductions in estimated losses across several of our other businesses that write medical professional liability and commercial liability coverages, partially offset by increased reductions of property loss estimates. During 2024, due to deteriorating loss experience, management at GUARD performed a comprehensive review of claims and significantly increased estimated ultimate claim liabilities. The reduction of favorable development of prior years’ liability claims estimates across our other businesses was attributable to unfavorable social inflation trends, including the impacts of jury awards and litigation costs. Losses incurred from significant catastrophe events were approximately $350 million in 2024 and were minimal in 2023.\n \n\n\nK-\n36\n\n\n\n\n \n\n\nManagement’s Discussion and Analysis\n \n\n\nInsurance—Underwriting\n \n\n\nBerkshire Hathaway Primary Group\n \n\n\nUnderwriting expenses increased $681 million (15.0%) and the expense ratio increased 1.3 percentage points to 27.8% in 2024 compared to 2023. The increase in the expense ratio was primarily attributable to BH Specialty from changes in business mix and GUARD due to increased expenses and lower premiums earned.\n \n\n\n2023 versus 2022\n\n\nPremiums written increased $3.5 billion (24.1%) in 2023 compared to 2022. The increase was primarily due to the acquisition of RSUI and CapSpecialty ($2.1 billion), as well as comparative increases from BHSI and BH Direct, and, to a lesser extent, the other businesses. Losses and loss adjustment expenses increased $1.3 billion (13.5%) in 2023 compared to 2022, attributable to the acquisition of RSUI and CapSpecialty and changes in business mix, partially offset by a decline in significant catastrophe losses of approximately $600 million. Net reductions in estimated ultimate liabilities for prior years’ loss events were $537 million in 2023 and $428 million in 2022.\n \n\n\nUnderwriting expenses increased $1.1 billion (30.8%) in 2023 compared to 2022. The increase was primarily attributable to the increases in premiums earned and changes in business mix, including the full year effects in 2023 of the acquisition of RSUI and CapSpecialty.\n \n\n\nBerkshire Hathaway Reinsurance Group\n \n\n\nThe Berkshire Hathaway Reinsurance Group offers excess-of-loss and quota-share reinsurance coverages on property and casualty risks to insurers and reinsurers worldwide through several subsidiaries, led by National Indemnity Company (“NICO”), General Reinsurance Corporation, General Reinsurance AG and Transatlantic Reinsurance Company (“TransRe Group,” acquired in October 2022). We also write life and health reinsurance coverages through General Re Life Corporation, General Reinsurance AG and Berkshire Hathaway Life Insurance Company of Nebraska (“BHLN”). A summary of BHRG’s pre-tax underwriting results follows (in millions).\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\nPre-tax underwriting earnings (loss)\n\n\n \n\n\n\n\n\n\n \n\n\n2024\n\n\n \n\n\n2023\n\n\n \n\n\n2022\n\n\n \n\n\n\n\n\n\nProperty/casualty\n\n\n$\n\n\n3,800\n\n\n \n\n\n$\n\n\n3,508\n\n\n \n\n\n$\n\n\n2,180\n\n\n \n\n\n\n\n\n\nLife/health\n\n\n \n\n\n223\n\n\n \n\n\n \n\n\n354\n\n\n \n\n\n \n\n\n109\n\n\n \n\n\n\n\n\n\nRetroactive reinsurance\n\n\n \n\n\n(846\n\n\n)\n\n\n \n\n\n(1,541\n\n\n)\n\n\n \n\n\n(668\n\n\n)\n\n\n\n\n\n\nPeriodic payment annuity\n\n\n \n\n\n(597\n\n\n)\n\n\n \n\n\n(650\n\n\n)\n\n\n \n\n\n(623\n\n\n)\n\n\n\n\n\n\nVariable annuity\n\n\n \n\n\n157\n\n\n \n\n\n \n\n\n233\n\n\n \n\n\n \n\n\n467\n\n\n \n\n\n\n\n\n\n \n\n\n$\n\n\n2,737\n\n\n \n\n\n$\n\n\n1,904\n\n\n \n\n\n$\n\n\n1,465\n\n\n \n\n\n\n\n\n\nProperty/casualty\n \n\n\nA summary of property/casualty reinsurance underwriting results follows (dollars in millions).\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n \n\n\n2022\n\n\n \n\n\n\n\n\n\n \n\n\nAmount\n\n\n \n\n\n \n\n\n%\n\n\n \n\n\n \n\n\nAmount\n\n\n \n\n\n \n\n\n%\n\n\n \n\n\n \n\n\nAmount\n\n\n \n\n\n \n\n\n%\n\n\n \n\n\n\n\n\n\nPremiums written\n\n\n$\n\n\n21,899\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n$\n\n\n22,360\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n$\n\n\n16,962\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nPremiums earned\n\n\n$\n\n\n22,239\n\n\n \n\n\n \n\n\n \n\n\n100.0\n\n\n \n\n\n \n\n\n$\n\n\n21,938\n\n\n \n\n\n \n\n\n \n\n\n100.0\n\n\n \n\n\n \n\n\n$\n\n\n16,040\n\n\n \n\n\n \n\n\n \n\n\n100.0\n\n\n \n\n\n\n\n\n\nLosses and loss adjustment expenses\n\n\n \n\n\n12,244\n\n\n \n\n\n \n\n\n \n\n\n55.1\n\n\n \n\n\n \n\n\n \n\n\n12,664\n\n\n \n\n\n \n\n\n \n\n\n57.7\n\n\n \n\n\n \n\n\n \n\n\n10,605\n\n\n \n\n\n \n\n\n \n\n\n66.1\n\n\n \n\n\n\n\n\n\nUnderwriting expenses\n\n\n \n\n\n6,195\n\n\n \n\n\n \n\n\n \n\n\n27.8\n\n\n \n\n\n \n\n\n \n\n\n5,766\n\n\n \n\n\n \n\n\n \n\n\n26.3\n\n\n \n\n\n \n\n\n \n\n\n3,255\n\n\n \n\n\n \n\n\n \n\n\n20.3\n\n\n \n\n\n\n\n\n\nTotal losses and expenses\n\n\n \n\n\n18,439\n\n\n \n\n\n \n\n\n \n\n\n82.9\n\n\n \n\n\n \n\n\n \n\n\n18,430\n\n\n \n\n\n \n\n\n \n\n\n84.0\n\n\n \n\n\n \n\n\n \n\n\n13,860\n\n\n \n\n\n \n\n\n \n\n\n86.4\n\n\n \n\n\n\n\n\n\nPre-tax underwriting earnings\n\n\n$\n\n\n3,800\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n$\n\n\n3,508\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n$\n\n\n2,180\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n2024 versus 2023\n\n\nPremiums written in 2024 declined $461 million (2.1%) versus 2023, attributable to lower overall property volumes, partly offset by generally higher rates, new business and increased participations in certain casualty lines. Premiums earned in 2024 increased 1.4% compared to 2023.\n \n\n\nK-\n37\n\n\n\n\n \n\n\nManagement’s Discussion and Analysis\n \n\n\nInsurance—Underwriting\n \n\n\nBerkshire Hathaway Reinsurance Group\n \n\n\nLosses and loss adjustment expenses decreased $420 million (3.3%) and the loss ratio decreased 2.6 percentage points in 2024 compared to 2023. Losses incurred from significant catastrophe events were approximately $800 million in 2024 and $900 million in 2023. Estimated ultimate liabilities for losses occurring in prior accident years were reduced $1.7 billion in 2024 and $1.4 billion in 2023, mostly attributable to lower-than-expected property losses.\n \n\n\nUnderwriting expenses increased $429 million (7.4%) and the expense ratio increased 1.5 percentage points in 2024 compared to 2023. In 2024, NICO recorded a pre-tax charge in underwriting expenses of $490 million in connection with a settlement agreement reached concerning certain non-insurance affiliates that filed voluntary petitions under Chapter 11 of the bankruptcy code in the United States Bankruptcy Court for the District of New Jersey in 2023. See Note 27 to the accompanying Consolidated Financial Statements. Underwriting expenses also included pre-tax foreign currency exchange gains from the remeasurement of certain non-U.S. Dollar denominated liabilities of $121 million in 2024 and losses of $189 million in 2023. Before these items, underwriting expenses increased $249 million (4.5%) in 2024 compared to 2023.\n \n\n\n2023 versus 2022\n\n\nPremiums written in 2023 increased 31.8% over 2022, reflecting the impact of the TransRe Group acquisition ($4.3 billion), net increases in new property business and higher rates. Losses and loss adjustment expenses increased $2.1 billion in 2023 versus 2022. The increase in 2023 reflected the TransRe Group acquisition ($2.6 billion), as well as a comparative reduction in losses from significant catastrophe events of $1.1 billion. Estimated ultimate liabilities for prior accident years were reduced $1.4 billion in 2023 and $1.6 billion in 2022.\n \n\n\nUnderwriting expenses increased $2.5 billion in 2023 versus 2022, reflecting the impact of the TransRe Group acquisition. The expense ratio increased 6.0 percentage points compared to 2022. Underwriting expenses also included pre-tax foreign currency exchange losses of $189 million in 2023 compared to gains of $371 million in 2022.\n \n\n\nLife/health\n \n\n\nA summary of our life/health reinsurance underwriting results follows (dollars in millions).\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n \n\n\n2022\n\n\n \n\n\n\n\n\n\n \n\n\nAmount\n\n\n \n\n\n \n\n\n%\n\n\n \n\n\n \n\n\nAmount\n\n\n \n\n\n \n\n\n%\n\n\n \n\n\n \n\n\nAmount\n\n\n \n\n\n \n\n\n%\n\n\n \n\n\n\n\n\n\nPremiums written\n\n\n$\n\n\n5,007\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n$\n\n\n5,093\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n$\n\n\n5,185\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nPremiums earned\n\n\n$\n\n\n4,998\n\n\n \n\n\n \n\n\n \n\n\n100.0\n\n\n \n\n\n \n\n\n$\n\n\n5,072\n\n\n \n\n\n \n\n\n \n\n\n100.0\n\n\n \n\n\n \n\n\n$\n\n\n5,224\n\n\n \n\n\n \n\n\n \n\n\n100.0\n\n\n \n\n\n\n\n\n\nLife and health benefits\n\n\n \n\n\n3,415\n\n\n \n\n\n \n\n\n \n\n\n68.3\n\n\n \n\n\n \n\n\n \n\n\n3,593\n\n\n \n\n\n \n\n\n \n\n\n70.8\n\n\n \n\n\n \n\n\n \n\n\n4,112\n\n\n \n\n\n \n\n\n \n\n\n78.7\n\n\n \n\n\n\n\n\n\nUnderwriting expenses\n\n\n \n\n\n1,360\n\n\n \n\n\n \n\n\n \n\n\n27.2\n\n\n \n\n\n \n\n\n \n\n\n1,125\n\n\n \n\n\n \n\n\n \n\n\n22.2\n\n\n \n\n\n \n\n\n \n\n\n1,003\n\n\n \n\n\n \n\n\n \n\n\n19.2\n\n\n \n\n\n\n\n\n\nTotal benefits and expenses\n\n\n \n\n\n4,775\n\n\n \n\n\n \n\n\n \n\n\n95.5\n\n\n \n\n\n \n\n\n \n\n\n4,718\n\n\n \n\n\n \n\n\n \n\n\n93.0\n\n\n \n\n\n \n\n\n \n\n\n5,115\n\n\n \n\n\n \n\n\n \n\n\n97.9\n\n\n \n\n\n\n\n\n\nPre-tax underwriting earnings\n\n\n$\n\n\n223\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n$\n\n\n354\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n$\n\n\n109\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nPremiums earned in 2024 declined $74 million compared to 2023, which included a reduction of $161 million attributable to the commutations of several U.S. life contracts in the first quarter of 2023. Otherwise, premiums earned declined $235 million (4.5%) in 2024 compared to 2023, primarily attributable to reductions in non-U.S. life business, and were substantially unchanged in 2023 versus 2022.\n\n\nPre-tax underwriting earnings decreased $131 million in 2024 compared to 2023, which increased $245 million over 2022. Earnings included gains from life contract commutations of $53 million in 2024 and $134 million in 2023. Otherwise, underwriting earnings in 2024 decreased $50 million compared to 2023, reflecting decreased earnings from non-U.S. life business and increased losses from the U.S. long-term care business in run-off, partly offset by increased earnings from U.S. life business.\n \n\n\nRetroactive reinsurance\n \n\n\nPre-tax underwriting results from retroactive reinsurance derive from changes in the ultimate claim liability estimates and changes in the related deferred charge assets, as well as from foreign currency exchange gains and losses attributable to non-U.S. Dollar denominated contracts. Changes in foreign currency exchange rates produced pre-tax gains of $52 million in 2024, losses of $57 million in 2023 and gains of $168 million in 2022. Pre-tax underwriting losses before foreign currency exchange gains and losses were $898 million in 2024, $1.5 billion in 2023 and $836 million in 2022.\n \n\n\nK-\n38\n\n\n\n\n \n\n\nManagement’s Discussion and Analysis\n \n\n\nInsurance—Underwriting\n \n\n\nBerkshire Hathaway Reinsurance Group\n \n\n\nEstimated ultimate claim liabilities for prior years’ contracts increased $196 million in 2024, $1.1 billion in 2023 and $86 million in 2022. The increase in 2023 was derived from higher estimates for asbestos, environmental and other casualty claims, which net of changes in deferred charges, produced a pre-tax loss of $650 million in 2023. The net effects of the increases in ultimate claim liabilities in 2024 and 2022 were relatively insignificant.\n \n\n\nUnpaid losses and loss adjustment expenses for retroactive reinsurance contracts declined $2.2 billion in 2024 to $32.4 billion on December 31, 2024, primarily due to loss payments. Deferred charge assets on retroactive reinsurance contracts declined $698 million in 2024 to $8.8 billion at December 31, 2024. Deferred charge balances will be charged to earnings over the expected remaining claims settlement periods.\n \n\n\nPeriodic payment annuity\n \n\n\nPeriodic payment annuity business is price and demand sensitive and the supply of available business is affected by the timing of underlying legal claim settlements. In 2023 and 2024, premium rates for new business were at unacceptable levels and we wrote no new business in either year.\n\n\nPre-tax underwriting losses from periodic payment annuity contracts in each period included the accretion of discounted liabilities, including liabilities for contracts without life contingencies, and foreign currency exchange gains and losses on non-U.S. Dollar denominated contracts. Changes in foreign currency exchange rates were insignificant in 2024 and produced pre-tax losses of $60 million in 2023 and pre-tax gains of $71 million in 2022. Pre-tax underwriting losses before foreign currency effects were $596 million in 2024, $590 million in 2023 and $694 million in 2022. Pre-tax losses included a loss of approximately $130 million in 2022 from the settlement of a terminated reinsurance contract. Periodic payment annuity liabilities were $14.3 billion at December 31, 2024, including liabilities of $4.0 billion for contracts without life contingencies, and excluding the effects of discount rate changes recorded in accumulated other comprehensive income.\n\n\nVariable annuity\n \n\n\nOur variable annuity guarantee reinsurance contracts produced pre-tax earnings of $157 million in 2024, $233 million in 2023 and $467 million in 2022. Earnings are affected by changes in securities markets, interest rates and foreign currency exchange rates. These contracts have been in run-off for many years.\n\n\nInsurance—Investment Income\n \n\n\nA summary of net investment income attributable to our insurance operations follows (dollars in millions).\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\nPercentage change\n\n\n \n\n\n\n\n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n \n\n\n2022\n\n\n \n\n\n2024 vs 2023\n\n\n \n\n\n2023 vs 2022\n\n\n \n\n\n\n\n\n\nInterest and other investment income\n\n\n$\n\n\n11,550\n\n\n \n\n\n \n\n\n$\n\n\n6,081\n\n\n \n\n\n \n\n\n$\n\n\n1,685\n\n\n \n\n\n \n\n\n89.9\n\n\n%\n\n\n*\n\n\n \n\n\n\n\n\n\nDividend income\n\n\n \n\n\n5,198\n\n\n \n\n\n \n\n\n \n\n\n5,500\n\n\n \n\n\n \n\n\n \n\n\n6,039\n\n\n \n\n\n \n\n\n(5.5\n\n\n)\n\n\n \n\n\n(8.9\n\n\n)\n\n\n\n\n\n\nPre-tax net investment income\n\n\n \n\n\n16,748\n\n\n \n\n\n \n\n\n \n\n\n11,581\n\n\n \n\n\n \n\n\n \n\n\n7,724\n\n\n \n\n\n \n\n\n44.6\n\n\n \n\n\n \n\n\n49.9\n\n\n \n\n\n\n\n\n\nIncome taxes and noncontrolling interests\n\n\n \n\n\n3,078\n\n\n \n\n\n \n\n\n \n\n\n2,014\n\n\n \n\n\n \n\n\n \n\n\n1,240\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nNet investment income\n\n\n$\n\n\n13,670\n\n\n \n\n\n \n\n\n$\n\n\n9,567\n\n\n \n\n\n \n\n\n$\n\n\n6,484\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nEffective income tax rate\n\n\n \n\n\n18.4\n\n\n%\n\n\n \n\n\n \n\n\n17.4\n\n\n%\n\n\n \n\n\n \n\n\n16.0\n\n\n%\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n——————\n\n\n* Not meaningful.\n \n\n\nInterest and other investment income increased $5.5 billion in 2024 compared to 2023, which increased $4.4 billion compared to 2022. The increase in 2024 was primarily attributable to increases in U.S. Treasury Bill and short-term investment balances. The increase in 2023 over 2022 was due to increased short-term investment balances and higher interest rates, as well as the impact of income earned from Alleghany’s insurance subsidiary assets acquired in October 2022. We continue to believe that maintaining ample liquidity is paramount and we insist on safety over yield with respect to short-term investments.\n\n\nK-\n39\n\n\n\n\n \n\n\nManagement’s Discussion and Analysis\n \n\n\nInsurance—Investment Income\n \n\n\nDividend income declined $302 million (5.5%) in 2024 compared to 2023, which declined $539 million (8.9%) compared to 2022. The decreases reflected the impact of net reductions in our equity security holdings, partially offset by higher dividend rates on certain of our holdings. Dividend income varies from period to period due to changes in the investment portfolio and the frequency and timing of dividends from certain investees.\n \n\n\nInvested assets of our insurance businesses derive from shareholder capital and net liabilities assumed under insurance contracts or “float.” The major components of float are unpaid losses and loss adjustment expenses, including liabilities under retroactive reinsurance contracts, life, annuity and health benefit liabilities, unearned premiums and certain other liabilities, which are reduced by insurance premiums receivable, reinsurance receivables, deferred charges assumed under retroactive reinsurance contracts and deferred policy acquisition costs. The effect of discount rate changes on long-duration insurance contracts, recorded in accumulated other comprehensive income, are excluded from float, as such amounts are not included in earnings in the Consolidated Statements of Earnings.\n \n\n\nFloat was approximately $171 billion at December 31, 2024, $169 billion at December 31, 2023 and $164 billion at December 31, 2022. The cost of float is measured as the ratio of pre-tax underwriting earnings to float balances. Our combined insurance operations generated pre-tax underwriting gains in 2024 and 2023, and the average cost of float was negative in each year. The cost of float in 2022 was nominal.\n \n\n\nA summary of cash and investments held in our insurance businesses as of December 31, 2024 and 2023 follows (in millions).\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\nDecember 31,\n\n\n \n\n\n\n\n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n\n\n\n\nCash, cash equivalents and U.S. Treasury Bills\n\n\n$\n\n\n212,591\n\n\n \n\n\n \n\n\n$\n\n\n121,845\n\n\n \n\n\n\n\n\n\nEquity securities\n\n\n \n\n\n263,366\n\n\n \n\n\n \n\n\n \n\n\n345,653\n\n\n \n\n\n\n\n\n\nFixed maturity securities\n\n\n \n\n\n15,137\n\n\n \n\n\n \n\n\n \n\n\n23,617\n\n\n \n\n\n\n\n\n\nOther, includes loans to affiliates\n\n\n \n\n\n5,980\n\n\n \n\n\n \n\n\n \n\n\n1,188\n\n\n \n\n\n\n\n\n\n \n\n\n$\n\n\n497,074\n\n\n \n\n\n \n\n\n$\n\n\n492,303\n\n\n \n\n\n\n\n\n\n \n\n\nFixed maturity investments as of December 31, 2024 were as follows (in millions).\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\nAmortized\nCost\n\n\n \n\n\n \n\n\nUnrealized\nGains (Losses)\n\n\n \n\n\n \n\n\nCarrying\nValue\n\n\n \n\n\n\n\n\n\nU.S. Treasury, U.S. government corporations and agencies\n\n\n$\n\n\n4,267\n\n\n \n\n\n \n\n\n$\n\n\n11\n\n\n \n\n\n \n\n\n$\n\n\n4,278\n\n\n \n\n\n\n\n\n\nForeign governments\n\n\n \n\n\n9,430\n\n\n \n\n\n \n\n\n \n\n\n(81\n\n\n)\n\n\n \n\n\n \n\n\n9,349\n\n\n \n\n\n\n\n\n\nCorporate and other\n\n\n \n\n\n1,293\n\n\n \n\n\n \n\n\n \n\n\n217\n\n\n \n\n\n \n\n\n \n\n\n1,510\n\n\n \n\n\n\n\n\n\n \n\n\n$\n\n\n14,990\n\n\n \n\n\n \n\n\n$\n\n\n147\n\n\n \n\n\n \n\n\n$\n\n\n15,137\n\n\n \n\n\n\n\n\n\n \n\n\nU.S. government obligations are rated AA+ or Aaa by the major rating agencies. Approximately 94% of our foreign government obligations were rated AA or higher by at least one of the major rating agencies. Foreign government securities include obligations issued or unconditionally guaranteed by national or provincial government entities.\n \n\n\nK-\n40\n\n\n\n\n \n\n\nManagement’s Discussion and Analysis\n\n\nBurlington Northern Santa Fe\n \n\n\nBurlington Northern Santa Fe, LLC (“BNSF”) operates one of the largest railroad systems in North America, with over 32,500 route miles of track in 28 states. BNSF also operates in three Canadian provinces. BNSF classifies its major business groups by type of product shipped, including consumer products, industrial products, agricultural products and coal. A summary of BNSF’s earnings follows (dollars in millions).\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\nPercentage Change\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n2023\n\n\n \n\n\n2022\n\n\n \n\n\n2024 vs 2023\n\n\n \n\n\n2023 vs 2022\n\n\n \n\n\n\n\n\n\nRailroad operating revenues\n\n\n \n\n\n$\n\n\n23,355\n\n\n \n\n\n$\n\n\n23,474\n\n\n \n\n\n$\n\n\n25,203\n\n\n \n\n\n \n\n\n(0.5\n\n\n)%\n\n\n \n\n\n(6.9\n\n\n)%\n\n\n\n\n\n\nRailroad operating expenses\n\n\n \n\n\n \n\n\n15,886\n\n\n \n\n\n \n\n\n16,059\n\n\n \n\n\n \n\n\n16,600\n\n\n \n\n\n \n\n\n(1.1\n\n\n)\n\n\n \n\n\n(3.3\n\n\n)\n\n\n\n\n\n\nRailroad operating earnings\n\n\n \n\n\n \n\n\n7,469\n\n\n \n\n\n \n\n\n7,415\n\n\n \n\n\n \n\n\n8,603\n\n\n \n\n\n \n\n\n0.7\n\n\n \n\n\n \n\n\n(13.8\n\n\n)\n\n\n\n\n\n\nOther revenues (expenses), net\n\n\n \n\n\n \n\n\n257\n\n\n \n\n\n \n\n\n247\n\n\n \n\n\n \n\n\n130\n\n\n \n\n\n \n\n\n4.0\n\n\n \n\n\n \n\n\n90.0\n\n\n \n\n\n\n\n\n\nInterest expense\n\n\n \n\n\n \n\n\n(1,078\n\n\n)\n\n\n \n\n\n(1,048\n\n\n)\n\n\n \n\n\n(1,025\n\n\n)\n\n\n \n\n\n2.9\n\n\n \n\n\n \n\n\n2.2\n\n\n \n\n\n\n\n\n\nPre-tax earnings\n\n\n \n\n\n \n\n\n6,648\n\n\n \n\n\n \n\n\n6,614\n\n\n \n\n\n \n\n\n7,708\n\n\n \n\n\n \n\n\n0.5\n\n\n \n\n\n \n\n\n(14.2\n\n\n)\n\n\n\n\n\n\nIncome taxes\n\n\n \n\n\n \n\n\n1,617\n\n\n \n\n\n \n\n\n1,527\n\n\n \n\n\n \n\n\n1,762\n\n\n \n\n\n \n\n\n5.9\n\n\n \n\n\n \n\n\n(13.3\n\n\n)\n\n\n\n\n\n\nNet earnings\n\n\n \n\n\n$\n\n\n5,031\n\n\n \n\n\n$\n\n\n5,087\n\n\n \n\n\n$\n\n\n5,946\n\n\n \n\n\n \n\n\n(1.1\n\n\n)\n\n\n \n\n\n(14.4\n\n\n)\n\n\n\n\n\n\nEffective income tax rate\n\n\n \n\n\n \n\n\n24.3\n\n\n%\n\n\n \n\n\n23.1\n\n\n%\n\n\n \n\n\n22.9\n\n\n%\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\nA summary of BNSF’s railroad freight volumes by business group follows (cars/units in thousands).\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nCars/Units\n\n\n \n\n\nPercentage Change\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n2023\n\n\n \n\n\n2022\n\n\n \n\n\n2024 vs 2023\n\n\n \n\n\n2023 vs 2022\n\n\n \n\n\n\n\n\n\nConsumer products\n\n\n \n\n\n \n\n\n5,537\n\n\n \n\n\n \n\n\n4,765\n\n\n \n\n\n \n\n\n5,202\n\n\n \n\n\n \n\n\n16.2\n\n\n%\n\n\n \n\n\n(8.4\n\n\n)%\n\n\n\n\n\n\nIndustrial products\n\n\n \n\n\n \n\n\n1,596\n\n\n \n\n\n \n\n\n1,605\n\n\n \n\n\n \n\n\n1,618\n\n\n \n\n\n \n\n\n(0.6\n\n\n)\n\n\n \n\n\n(0.8\n\n\n)\n\n\n\n\n\n\nAgricultural products\n\n\n \n\n\n \n\n\n1,251\n\n\n \n\n\n \n\n\n1,165\n\n\n \n\n\n \n\n\n1,200\n\n\n \n\n\n \n\n\n7.4\n\n\n \n\n\n \n\n\n(2.9\n\n\n)\n\n\n\n\n\n\nCoal\n\n\n \n\n\n \n\n\n1,205\n\n\n \n\n\n \n\n\n1,468\n\n\n \n\n\n \n\n\n1,529\n\n\n \n\n\n \n\n\n(17.9\n\n\n)\n\n\n \n\n\n(4.0\n\n\n)\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n9,589\n\n\n \n\n\n \n\n\n9,003\n\n\n \n\n\n \n\n\n9,549\n\n\n \n\n\n \n\n\n6.5\n\n\n \n\n\n \n\n\n(5.7\n\n\n)\n\n\n\n\n\n\n \n\n\n2024 versus 2023\n\n\nRailroad operating revenues declined 0.5% in 2024 compared to 2023, reflecting lower average revenue per car/unit of 6.6%, primarily attributable to lower fuel surcharge revenue and business mix changes, partially offset by a net volume increase of 6.5%. Pre-tax earnings were $6.6 billion in 2024, a slight increase from 2023. Railroad operating earnings in 2024 increased due to volume growth and lower operating costs from improved productivity, partially offset by a $290 million charge related to a labor agreement that was finalized in the fourth quarter of 2024 and by increased litigation accruals.\n \n\n\nOperating revenues from consumer products increased 7.1% in 2024 to $8.4 billion compared to 2023, reflecting a volume increase of 16.2% and lower average revenue per car/unit. The volume increase was primarily due to higher intermodal shipments from west coast imports and volumes from a new intermodal customer.\n \n\n\nOperating revenues from industrial products declined 1.2% in 2024 to $5.6 billion from 2023, reflecting slight declines in volume and average revenue per car/unit. The volume decline was primarily due to lower aggregates, taconite, minerals and waste shipments, substantially offset by higher plastics and petroleum products volumes.\n\n\nK-\n41\n\n\n\n\n \n\n\nManagement’s Discussion and Analysis\n \n\n\nBurlington Northern Santa Fe\n \n\n\nOperating revenues from agricultural products increased 4.5% to $5.8 billion in 2024 compared to 2023, attributable to a volume increase of 7.4%, partially offset by lower average revenue per car/unit. The volume increase was primarily due to higher grain, renewable fuels and fertilizer shipments.\n\n\nOperating revenues from coal decreased 22.5% to $2.9 billion in 2024 compared to 2023. The decrease was attributable to a volume decrease of 17.9% and lower average revenue per car/unit. The volume decline was primarily due to lower natural gas prices.\n \n\n\nRailroad operating expenses were $15.9 billion in 2024, a decrease of $173 million (1.1%) compared to 2023. The ratio of railroad operating expenses to railroad operating revenues declined 0.4 percentage points to 68.0% in 2024 versus 2023. Railroad compensation and benefits expenses increased $356 million (6.5%) in 2024 compared to 2023, primarily due to a $290 million charge related to a one-time payment included in the agreement with the SMART-TD labor union that was finalized in December 2024. This agreement allows BNSF the ability to redeploy brakepersons to conductors and engineers, which will allow BNSF to meet short-term hiring demands. Fuel expenses declined $417 million (11.3%) compared to 2023, primarily due to lower average fuel prices, partially offset by higher volumes. Railroad purchased services, equipment rents, materials and other expenses declined $126 million (3.0%), primarily due to cost reductions across numerous spend categories and lower property taxes, partially offset by a litigation charge in 2024 related to a judgment in an ongoing legal case with the Swinomish Tribe, which BNSF has appealed.\n \n\n\n2023 versus 2022\n\n\nRailroad operating revenues declined 6.9% in 2023 compared to 2022, reflecting lower overall volumes (5.7%) and average revenue per car/unit (0.6%), which was primarily attributable to lower fuel surcharge revenue, partially offset by favorable price and mix. Pre-tax earnings were $6.6 billion in 2023, a decline of 14.2% from 2022, reflecting lower volumes and higher non-fuel operating costs, partially offset by lower fuel costs.\n \n\n\nOperating revenues from consumer products declined 14.7% in 2023 to $7.9 billion compared to 2022, reflecting a volume decrease of 8.4% and lower average revenue per car/unit. The volume decrease was primarily due to lower intermodal shipments resulting from reduced West Coast imports, the loss of an intermodal customer and competition from lower spot rates in the domestic trucking market, which negatively impacted demand. These declines were partially offset by an increase in automotive volume.\n \n\n\nOperating revenues from industrial products were $5.7 billion in 2023, an increase of 1.8% from 2022, reflecting higher average revenue per car/unit, partially offset by a volume decrease of 0.8%. The volume decline was primarily due to lower demand for chemicals, plastics, minerals, paper and lumber, partially offset by increased shipments of steel and aggregates.\n \n\n\nOperating revenues from agricultural products decreased 2.8% to $5.6 billion in 2023 compared to 2022, attributable to a volume decrease of 2.9%, partially offset by slightly higher average revenue per car/unit. The volume decrease was primarily due to lower grain exports, partially offset by higher volumes of domestic grains and feedstocks and renewable diesel.\n \n\n\nOperating revenues from coal declined 3.4% to $3.8 billion in 2023 compared to 2022. The revenue decrease was attributable to a volume decrease of 4.0%, partially offset by higher average revenue per car/unit. The volume decline reflected moderating demand attributable to lower natural gas prices.\n\n\nRailroad operating expenses were $16.1 billion in 2023, a decline of $541 million (3.3%) compared to 2022. The ratio of railroad operating expenses to railroad operating revenues increased 2.5 percentage points to 68.4% in 2023 versus 2022. Fuel expenses declined $897 million (19.6%) compared to 2022, reflecting lower average fuel prices, lower volumes and improved efficiency. Railroad compensation and benefits expenses increased $247 million (4.7%) in 2023 compared to 2022, primarily due to higher headcount and wage inflation. Other revenues (expenses), net increased 90% compared to 2022, primarily due to an increase in interest income driven by higher interest rates.\n\n\nK-\n42\n\n\n\n\n \n\n\nManagement’s Discussion and Analysis\n \n\n\nBerkshire Hathaway Energy\n \n\n\nBerkshire Hathaway Energy Company (“BHE”) is a holding company with subsidiaries that primarily operate within the energy industry. BHE’s domestic regulated utility interests include PacifiCorp, MidAmerican Energy Company (“MEC”) and NV Energy. BHE’s natural gas pipelines consist of five domestic regulated interstate natural gas pipeline systems and a 75% interest in a liquefied natural gas export, import and storage facility (“Cove Point”). Other energy subsidiaries operate two regulated electricity distribution businesses in Great Britain (“Northern Powergrid”), a regulated electricity transmission-only business in Alberta, Canada, and a diversified portfolio of mostly renewable independent power projects and investments. Another BHE subsidiary, HomeServices of America, Inc. (“HomeServices”), operates a residential real estate brokerage business and a large network of real estate brokerage franchises in the United States.\n \n\n\nThe rates BHE’s regulated businesses charge customers for energy and services are largely based on the costs of business operations, including income taxes and a return on capital, and are subject to regulatory approval. To the extent such costs are not allowed in the approved rates, operating results will be adversely affected. A summary of BHE’s net earnings follows (dollars in millions).\n \n\n\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n2024\n\n\n \n\n\n2023\n\n\n \n\n\n2022\n\n\n \n\n\n\n\n\n\nRevenues:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nEnergy operating revenue\n\n\n$\n\n\n21,566\n\n\n \n\n\n$\n\n\n21,280\n\n\n \n\n\n$\n\n\n21,069\n\n\n \n\n\n\n\n\n\nReal estate operating revenue\n\n\n \n\n\n4,354\n\n\n \n\n\n \n\n\n4,322\n\n\n \n\n\n \n\n\n5,268\n\n\n \n\n\n\n\n\n\nOther income\n\n\n \n\n\n428\n\n\n \n\n\n \n\n\n406\n\n\n \n\n\n \n\n\n56\n\n\n \n\n\n\n\n\n\nTotal revenue\n\n\n \n\n\n26,348\n\n\n \n\n\n \n\n\n26,008\n\n\n \n\n\n \n\n\n26,393\n\n\n \n\n\n\n\n\n\nCosts and expenses:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nEnergy cost of sales\n\n\n \n\n\n6,616\n\n\n \n\n\n \n\n\n7,057\n\n\n \n\n\n \n\n\n6,757\n\n\n \n\n\n\n\n\n\nEnergy operating expenses\n\n\n \n\n\n10,403\n\n\n \n\n\n \n\n\n11,412\n\n\n \n\n\n \n\n\n9,233\n\n\n \n\n\n\n\n\n\nReal estate operating costs and expenses\n\n\n \n\n\n4,509\n\n\n \n\n\n \n\n\n4,316\n\n\n \n\n\n \n\n\n5,117\n\n\n \n\n\n\n\n\n\nInterest expense\n\n\n \n\n\n2,528\n\n\n \n\n\n \n\n\n2,283\n\n\n \n\n\n \n\n\n2,140\n\n\n \n\n\n\n\n\n\nTotal costs and expenses\n\n\n \n\n\n24,056\n\n\n \n\n\n \n\n\n25,068\n\n\n \n\n\n \n\n\n23,247\n\n\n \n\n\n\n\n\n\nPre-tax earnings\n\n\n \n\n\n2,292\n\n\n \n\n\n \n\n\n940\n\n\n \n\n\n \n\n\n3,146\n\n\n \n\n\n\n\n\n\nIncome tax benefit*\n\n\n \n\n\n(1,871\n\n\n)\n\n\n \n\n\n(2,022\n\n\n)\n\n\n \n\n\n(1,629\n\n\n)\n\n\n\n\n\n\nNet earnings after income taxes\n\n\n \n\n\n4,163\n\n\n \n\n\n \n\n\n2,962\n\n\n \n\n\n \n\n\n4,775\n\n\n \n\n\n\n\n\n\nNoncontrolling interests of BHE subsidiaries\n\n\n \n\n\n137\n\n\n \n\n\n \n\n\n352\n\n\n \n\n\n \n\n\n423\n\n\n \n\n\n\n\n\n\nNet earnings attributable to BHE\n\n\n \n\n\n4,026\n\n\n \n\n\n \n\n\n2,610\n\n\n \n\n\n \n\n\n4,352\n\n\n \n\n\n\n\n\n\nNoncontrolling interests and preferred stock dividends\n\n\n \n\n\n296\n\n\n \n\n\n \n\n\n279\n\n\n \n\n\n \n\n\n448\n\n\n \n\n\n\n\n\n\nNet earnings attributable to Berkshire shareholders\n\n\n$\n\n\n3,730\n\n\n \n\n\n$\n\n\n2,331\n\n\n \n\n\n$\n\n\n3,904\n\n\n \n\n\n\n\n\n\nEffective income tax rate\n\n\n \n\n\n(81.6\n\n\n)%\n\n\n \n\n\n(215.1\n\n\n)%\n\n\n \n\n\n(51.8\n\n\n)%\n\n\n\n\n\n\n \n\n\n——————\n\n\n* Includes significant production tax credits primarily from wind-powered electricity generation.\n\n\nThe discussion of BHE’s operating results that follows is based on after-tax earnings, reflecting how the energy businesses are managed and evaluated. A summary of net earnings attributable to BHE (“net earnings”) follows (dollars in millions).\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\nPercentage Change\n\n\n \n\n\n\n\n\n\n \n\n\n2024\n\n\n \n\n\n2023\n\n\n \n\n\n2022\n\n\n \n\n\n2024 vs 2023\n\n\n \n\n\n2023 vs 2022\n\n\n \n\n\n\n\n\n\nU.S. utilities\n\n\n$\n\n\n1,961\n\n\n \n\n\n$\n\n\n906\n\n\n \n\n\n$\n\n\n2,295\n\n\n \n\n\n \n\n\n116.4\n\n\n%\n\n\n \n\n\n(60.5\n\n\n)%\n\n\n\n\n\n\nNatural gas pipelines\n\n\n \n\n\n1,232\n\n\n \n\n\n \n\n\n1,079\n\n\n \n\n\n \n\n\n1,040\n\n\n \n\n\n \n\n\n14.2\n\n\n \n\n\n \n\n\n3.8\n\n\n \n\n\n\n\n\n\nOther energy businesses\n\n\n \n\n\n1,334\n\n\n \n\n\n \n\n\n1,024\n\n\n \n\n\n \n\n\n1,356\n\n\n \n\n\n \n\n\n30.3\n\n\n \n\n\n \n\n\n(24.5\n\n\n)\n\n\n\n\n\n\nReal estate brokerage\n\n\n \n\n\n(107\n\n\n)\n\n\n \n\n\n13\n\n\n \n\n\n \n\n\n100\n\n\n \n\n\n**\n\n\n \n\n\n \n\n\n(87.0\n\n\n)\n\n\n\n\n\n\nCorporate interest and other\n\n\n \n\n\n(394\n\n\n)\n\n\n \n\n\n(412\n\n\n)\n\n\n \n\n\n(439\n\n\n)\n\n\n \n\n\n(4.4\n\n\n)\n\n\n \n\n\n(6.2\n\n\n)\n\n\n\n\n\n\n \n\n\n$\n\n\n4,026\n\n\n \n\n\n$\n\n\n2,610\n\n\n \n\n\n$\n\n\n4,352\n\n\n \n\n\n \n\n\n54.3\n\n\n \n\n\n \n\n\n(40.0\n\n\n)\n\n\n\n\n\n\n——————\n\n\n** Not meaningful.\n\n\nK-\n43\n\n\n\n\n \n\n\nManagement’s Discussion and Analysis\n \n\n\nBerkshire Hathaway Energy\n \n\n\n2024 versus 2023\n\n\nOur U.S. utilities operate independently in several states, including Utah, Oregon, Wyoming and other Western states (PacifiCorp), Iowa and Illinois (MEC) and Nevada (NV Energy). Net earnings increased $1.1 billion (116.4%) in 2024 compared to 2023. Pre-tax loss accruals, net of expected insurance recoveries, for the Wildfires were $346 million in 2024 and $1.7 billion in 2023. See Note 27 to the accompanying Consolidated Financial Statements for additional information on the Wildfires.\n \n\n\nAdditionally, net earnings of U.S. utilities in 2024 reflected comparative increases in electric utility margin (operating revenue less cost of sales), income tax benefits from recognized wind production tax credits ($157 million) and other income, partially offset by increases in other energy operating expenses and interest expense.\n \n\n\nThe U.S. utilities’ electric utility margin was $7.8 billion in 2024, an increase of $274 million (3.6%) compared to 2023. The increase reflected higher retail customer rates in certain territories and higher retail customer volumes, partially offset by higher energy costs and lower wholesale volumes and prices. Retail customer volumes increased 3.6% overall (up 6.5% at NV Energy, 3.1% at PacifiCorp and 1.2% at MEC) in 2024 compared to 2023, primarily due to increases in customer usage and the average number of customers, partially offset by an overall unfavorable impact of weather. The increase in other energy operating expenses was primarily due to higher vegetation management and other wildfire mitigation costs, insurance expenses and general and plant maintenance costs. Interest expense increased $314 million in 2024 over 2023, largely due to increased borrowings, including $4.4 billion of subsidiary term debt issued in January 2024 with a weighted average interest rate of 5.5%.\n \n\n\nNet earnings of natural gas pipelines increased $153 million in 2024 compared to 2023. The increase in earnings reflected reductions in earnings attributable to noncontrolling interests, partially offset by the impact of a higher effective income tax rate, due to the acquisition of an additional 50% limited partner interest in Cove Point on September 1, 2023. Pre-tax earnings of the natural gas pipelines in 2024 were unchanged from 2023.\n\n\nNet earnings of other energy businesses increased $310 million in 2024 compared to 2023. The increase was primarily due to higher earnings at Northern Powergrid, partially offset by lower earnings from the renewable energy business. The increase at Northern Powergrid was attributable to higher distribution revenue due to higher tariffs from inflation adjustments and lower income tax expense attributable to charges recognized in 2023 for the U.K. Energy Profits Levy and a group relief tax benefit recognized in 2024, partially offset by unfavorable results from the upstream gas exploration and production business and higher operating expenses. Earnings from the renewable energy business decreased mainly due to lower earnings from wind tax equity investments in 2024 and debt extinguishment gains recognized in 2023.\n\n\nNet earnings of real estate brokerage decreased $120 million 2024 compared to 2023, primarily attributable to charges in connection with the ongoing real estate industry litigation matters. In April 2024, HomeServices agreed to terms with the plaintiffs to settle all claims asserted against HomeServices and certain of its subsidiaries and effectuate a nationwide class settlement. See Note 27 to the accompanying Consolidated Financial Statements for additional information. The real estate brokerage business continues to be negatively impacted by the availability of homes for sale and high home prices.\n \n\n\nCorporate interest and other after-tax earnings include BHE corporate interest expense and unallocated corporate and income tax expenses. Noncontrolling interests and preferred stock dividends include earnings attributable to non-Berkshire owners of BHE common stock and dividends on preferred stock held by other Berkshire subsidiaries. All remaining noncontrolling interests in BHE common stock were acquired in 2024 and the preferred stock is expected to be redeemed in 2025.\n \n\n\n2023 versus 2022\n\n\nNet earnings of the U.S. utilities declined $1.4 billion in 2023 compared to 2022. The decline reflected an increase in energy operating expenses, including an increase in pre-tax loss accruals, net of expected insurance recoveries, of $1.6 billion for the Wildfires. The decline in earnings also reflected higher interest expense and lower electric utility margin. These items were partially offset by increases in other income and lower depreciation and amortization expense.\n \n\n\nThe U.S. utilities’ electric utility margin was $7.5 billion in 2023, a decrease of $170 million (2.2%) versus 2022. The decline reflected lower volumes and wholesale rates, as well as increased energy costs, partially offset by an increase in retail customer rates in certain territories. Retail customer volumes decreased 0.8% overall (down 0.8% at PacifiCorp and 2.6% at NV Energy and up 1.3% at MEC) in 2023 compared to 2022, primarily due to an overall unfavorable impact of weather, partially offset by increases in customer usage and the average number of customers.\n\n\nK-\n44\n\n\n\n\n \n\n\nManagement’s Discussion and Analysis\n \n\n\nBerkshire Hathaway Energy\n\n\nNet earnings of natural gas pipelines increased $39 million in 2023 compared to 2022. The increase reflected higher regulated transportation and storage services revenues from certain general rate cases and decreased earnings attributable to noncontrolling interests in Cove Point, partially offset by higher operating expenses.\n\n\nNet earnings of other energy businesses decreased $332 million in 2023 compared to 2022. The decline reflected lower earnings at Northern Powergrid due to unfavorable results from the upstream gas exploration and production business, including the write-off of capitalized exploration costs and lower gas production volumes and prices, as well as from higher deferred income tax expense related to the enactment of the U.K. Energy Profits Levy. The earnings decline was also attributable to lower earnings from the renewable energy businesses, primarily due to lower income tax benefits, higher operating expenses and lower solar and wind generation from owned projects, partially offset by debt extinguishment gains in 2023.\n\n\nNet earnings of real estate brokerage decreased $87 million in 2023 compared to 2022. The decrease reflected lower brokerage services revenues and margins, primarily due to a 19% reduction in closed brokerage transaction volumes, as well as lower mortgage services revenues and margins from a 28% decrease in closed transaction volumes.\n \n\n\nManufacturing, Service and Retailing\n \n\n\nA summary of revenues and earnings of our manufacturing, service and retailing businesses follows (dollars in millions).\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\nPercentage change\n\n\n \n\n\n\n\n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n \n\n\n2022\n\n\n \n\n\n \n\n\n2024 vs 2023\n\n\n \n\n\n \n\n\n2023 vs 2022\n\n\n \n\n\n\n\n\n\nRevenues\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nManufacturing\n\n\n$\n\n\n77,231\n\n\n \n\n\n \n\n\n$\n\n\n75,405\n\n\n \n\n\n \n\n\n$\n\n\n75,781\n\n\n \n\n\n \n\n\n \n\n\n2.4\n\n\n%\n\n\n \n\n\n \n\n\n(0.5\n\n\n)%\n\n\n\n\n\n\nService and retailing\n\n\n \n\n\n138,672\n\n\n \n\n\n \n\n\n \n\n\n144,342\n\n\n \n\n\n \n\n\n \n\n\n91,512\n\n\n \n\n\n \n\n\n \n\n\n(3.9\n\n\n)\n\n\n \n\n\n \n\n\n57.7\n\n\n \n\n\n\n\n\n\n \n\n\n$\n\n\n215,903\n\n\n \n\n\n \n\n\n$\n\n\n219,747\n\n\n \n\n\n \n\n\n$\n\n\n167,293\n\n\n \n\n\n \n\n\n \n\n\n(1.7\n\n\n)\n\n\n \n\n\n \n\n\n31.4\n\n\n \n\n\n\n\n\n\nPre-tax earnings\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nManufacturing\n\n\n$\n\n\n11,895\n\n\n \n\n\n \n\n\n$\n\n\n11,445\n\n\n \n\n\n \n\n\n$\n\n\n11,177\n\n\n \n\n\n \n\n\n \n\n\n3.9\n\n\n%\n\n\n \n\n\n \n\n\n2.4\n\n\n%\n\n\n\n\n\n\nService and retailing\n\n\n \n\n\n4,948\n\n\n \n\n\n \n\n\n \n\n\n6,144\n\n\n \n\n\n \n\n\n \n\n\n5,042\n\n\n \n\n\n \n\n\n \n\n\n(19.5\n\n\n)\n\n\n \n\n\n \n\n\n21.9\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n16,843\n\n\n \n\n\n \n\n\n \n\n\n17,589\n\n\n \n\n\n \n\n\n \n\n\n16,219\n\n\n \n\n\n \n\n\n \n\n\n(4.2\n\n\n)\n\n\n \n\n\n \n\n\n8.4\n\n\n \n\n\n\n\n\n\nIncome taxes and noncontrolling interests\n\n\n \n\n\n3,771\n\n\n \n\n\n \n\n\n \n\n\n4,227\n\n\n \n\n\n \n\n\n \n\n\n3,707\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nNet earnings*\n\n\n$\n\n\n13,072\n\n\n \n\n\n \n\n\n$\n\n\n13,362\n\n\n \n\n\n \n\n\n$\n\n\n12,512\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nEffective income tax rate\n\n\n \n\n\n21.7\n\n\n%\n\n\n \n\n\n \n\n\n22.2\n\n\n%\n\n\n \n\n\n \n\n\n22.2\n\n\n%\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nPre-tax earnings as a percentage of revenues\n\n\n \n\n\n7.8\n\n\n%\n\n\n \n\n\n \n\n\n8.0\n\n\n%\n\n\n \n\n\n \n\n\n9.7\n\n\n%\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n——————\n\n\n* Excludes certain acquisition accounting expenses, which primarily relates to the amortization of intangible assets recorded in connection with certain of our business acquisitions. The after-tax acquisition accounting expenses excluded from earnings were $531 million in 2024, $693 million in 2023 and $681 million in 2022. These expenses are included in “Other” in the summary of earnings on page K-33 and in the “Other” earnings table on page K-54.\n \n\n\nK-\n45\n\n\n\n\n \n\n\nManagement’s Discussion and Analysis\n \n\n\nManufacturing, Service and Retailing\n \n\n\nManufacturing\n \n\n\nOur manufacturing group includes a variety of industrial, building and consumer products businesses. A summary of revenues and pre-tax earnings of our manufacturing operations follows (dollars in millions).\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\nPercentage change\n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n \n\n\n2022\n\n\n \n\n\n \n\n\n2024 vs 2023\n\n\n \n\n\n \n\n\n2023 vs 2022\n\n\n \n\n\n \n\n\n\n\n\n\nRevenues\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nIndustrial products\n\n\n$\n\n\n35,833\n\n\n \n\n\n \n\n\n$\n\n\n34,884\n\n\n \n\n\n \n\n\n$\n\n\n30,824\n\n\n \n\n\n \n\n\n \n\n\n2.7\n\n\n%\n\n\n \n\n\n \n\n\n13.2\n\n\n%\n\n\n \n\n\n\n\n\n\nBuilding products\n\n\n \n\n\n26,525\n\n\n \n\n\n \n\n\n \n\n\n25,965\n\n\n \n\n\n \n\n\n \n\n\n28,896\n\n\n \n\n\n \n\n\n \n\n\n2.2\n\n\n \n\n\n \n\n\n \n\n\n(10.1\n\n\n)\n\n\n \n\n\n\n\n\n\nConsumer products\n\n\n \n\n\n14,873\n\n\n \n\n\n \n\n\n \n\n\n14,556\n\n\n \n\n\n \n\n\n \n\n\n16,061\n\n\n \n\n\n \n\n\n \n\n\n2.2\n\n\n \n\n\n \n\n\n \n\n\n(9.4\n\n\n)\n\n\n \n\n\n\n\n\n\n \n\n\n$\n\n\n77,231\n\n\n \n\n\n \n\n\n$\n\n\n75,405\n\n\n \n\n\n \n\n\n$\n\n\n75,781\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nPre-tax earnings\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nIndustrial products\n\n\n$\n\n\n6,017\n\n\n \n\n\n \n\n\n$\n\n\n5,686\n\n\n \n\n\n \n\n\n$\n\n\n4,862\n\n\n \n\n\n \n\n\n \n\n\n5.8\n\n\n%\n\n\n \n\n\n \n\n\n16.9\n\n\n%\n\n\n \n\n\n\n\n\n\nBuilding products\n\n\n \n\n\n4,134\n\n\n \n\n\n \n\n\n \n\n\n4,187\n\n\n \n\n\n \n\n\n \n\n\n4,789\n\n\n \n\n\n \n\n\n \n\n\n(1.3\n\n\n)\n\n\n \n\n\n \n\n\n(12.6\n\n\n)\n\n\n \n\n\n\n\n\n\nConsumer products\n\n\n \n\n\n1,744\n\n\n \n\n\n \n\n\n \n\n\n1,572\n\n\n \n\n\n \n\n\n \n\n\n1,526\n\n\n \n\n\n \n\n\n \n\n\n10.9\n\n\n \n\n\n \n\n\n \n\n\n3.0\n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n$\n\n\n11,895\n\n\n \n\n\n \n\n\n$\n\n\n11,445\n\n\n \n\n\n \n\n\n$\n\n\n11,177\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nPre-tax earnings as a percentage of revenues\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nIndustrial products\n\n\n \n\n\n16.8\n\n\n%\n\n\n \n\n\n \n\n\n16.3\n\n\n%\n\n\n \n\n\n \n\n\n15.8\n\n\n%\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nBuilding products\n\n\n \n\n\n15.6\n\n\n%\n\n\n \n\n\n \n\n\n16.1\n\n\n%\n\n\n \n\n\n \n\n\n16.6\n\n\n%\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nConsumer products\n\n\n \n\n\n11.7\n\n\n%\n\n\n \n\n\n \n\n\n10.8\n\n\n%\n\n\n \n\n\n \n\n\n9.5\n\n\n%\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\nIndustrial products\n \n\n\nThe industrial products group includes metal products for aerospace, power and general industrial markets (Precision Castparts Corp. (“PCC”)), specialty chemicals (The Lubrizol Corporation (“Lubrizol”)), metal cutting tools/systems (IMC International Metalworking Companies (“IMC”)), and Marmon, which consists of more than 100 autonomous manufacturing and service businesses, internally aggregated into eleven groups, and includes equipment leasing for the rail, intermodal tank container and mobile crane industries. Marmon also includes the Scott Fetzer group businesses. The industrial products group also includes equipment and systems for the livestock and agricultural industries (CTB International), a leader in drag reducing agents for pipelines (LiquidPower Specialty Products) and a structural steel fabrication products business (W&W|AFCO).\n \n\n\n2024 versus 2023\n\n\nRevenues of the industrial products group in 2024 increased $949 million (2.7%) and pre-tax earnings increased $331 million (5.8%) compared to 2023. Pre-tax earnings as a percentage of revenues in 2024 were 16.8%, an increase of 0.5 percentage points compared to 2023.\n\n\nPCC’s revenues were $10.4 billion in 2024, an increase of 12.0% compared to 2023. The revenue increase was primarily attributable to higher demand for aerospace products, and to a lesser degree, power generation products. Long-term industry forecasts continue to show growth and considerable demand for air travel and aerospace products. PCC’s pre-tax earnings increased 24.4% in 2024 compared to 2023, primarily attributable to sales increases and improved manufacturing and operating efficiencies. Continued growth in revenues and earnings will be predicated on PCC’s ability to successfully increase production levels to match the expected growth in aerospace products, as well as from improvements in industry supply chains and labor relations, which have been constraining commercial aircraft production at original equipment manufacturers.\n\n\nLubrizol’s revenues were $6.4 billion in 2024, relatively unchanged compared to 2023, as higher volumes were essentially offset by lower selling prices and unfavorable product mix. Sales volumes in 2024 increased 4% compared to 2023, reflecting higher volumes in both the additives and advanced materials businesses. Lubrizol’s pre-tax earnings increased 30.7% in 2024, primarily attributable to lower raw material costs, higher sales volumes and lower manufacturing costs, partially offset by the impact of lower selling prices and higher selling, general and administrative expenses.\n \n\n\nK-\n46\n\n\n\n\n \n\n\nManagement’s Discussion and Analysis\n \n\n\nManufacturing, Service and Retailing\n \n\n\nMarmon’s revenues were $12.2 billion in 2024, a decline of 1.7% compared to 2023. The largest revenue declines were experienced by the Transportation Products group (18.2%), attributable to volume declines in the truck, trailer, and aftermarket automotive markets, as well as the Metal Services group (13.9%) and Retail Solutions group (9.4%), primarily due to reduced volume and changes in sales mix. Conversely, Electrical group revenues increased 6.0% due to higher copper prices and increased volumes. The Rail & Leasing group revenues increased 10.5% due to higher average lease renewal rates and increased railcar repair prices and volumes.\n \n\n\nMarmon’s pre-tax earnings declined 8.7% in 2024 compared to 2023, reflecting lower earnings from the Transportation Products, Metals Services and Retail Solutions groups due to the revenue declines, as well as lower earnings from the Crane Services group, attributable to lower revenues and higher costs, and the Electrical group, reflecting higher materials costs and unfavorable business mix changes. These declines were partially offset by higher earnings in the Rail & Leasing, Medical, Water Technologies and Foodservice Technologies groups.\n \n\n\nIMC’s revenues were approximately $3.9 billion in 2024, a decrease of 2.2% compared to 2023. The decline reflected lower organic sales attributable to sluggish customer demand across all major regions, and unfavorable foreign currency translation from a stronger U.S. Dollar, partially offset by the impact of business acquisitions and higher investment income. The decline in organic sales was attributable to weaker general economic conditions and ongoing geopolitical conflicts. IMC’s pre-tax earnings declined 7.8% in 2024 compared to 2023, primarily attributable to lower sales and gross margin rates and increased selling, general and administrative expenses, partially offset by higher investment and other income. IMC operates globally and a large portion of its products are manufactured in Israel. IMC’s operations in Israel have not been significantly impacted by the conflicts in the region.\n \n\n\n2023 versus 2022\n\n\nRevenues of the industrial products group in 2023 increased $4.1 billion (13.2%) and pre-tax earnings increased $824 million (16.9%) compared to 2022. Pre-tax earnings as a percentage of revenues in 2023 increased 0.5 percentage points to 16.3%.\n \n\n\nPCC’s revenues were $9.3 billion in 2023, an increase of $1.7 billion (22.7%) compared to 2022. The revenue increase in 2023 was primarily attributable to higher demand for aerospace products, and, to a lesser degree, power generation products. PCC’s pre-tax earnings were $1.5 billion in 2023, an increase of 30.0% compared to 2022 attributable to increases in sales and manufacturing and operating efficiencies in aerospace businesses, partially offset by operating losses in energy products businesses.\n \n\n\nLubrizol’s revenues were $6.4 billion in 2023, a decline of 4.0% compared to 2022. The revenue decline was primarily due to a 7.9% decline in volumes and unfavorable foreign currency effects, partially offset by higher selling prices. Lubrizol’s pre-tax earnings in 2023 were relatively unchanged compared to 2022. Earnings included insurance recoveries of $11 million in 2023 and $242 million in 2022 in connection with fires at the Rockton, Illinois facility in 2021 and the Rouen, France facility in 2019. Excluding insurance recoveries, earnings in 2023 increased due to the favorable impacts of higher selling prices, favorable changes in product mix and lower raw material costs, partially offset by the impact of lower sales volumes, unfavorable foreign currency translation effects and higher operating expenses.\n \n\n\nMarmon’s revenues were $12.5 billion in 2023, an increase of $1.2 billion (11.0%) compared to 2022. Business acquisitions represented substantially all of the comparative revenue increase. In addition, the Rail & Leasing, Water Technologies, Medical, Metal Services and Crane Services groups generated higher revenues, primarily due to higher volumes and pricing improvements. Revenues in 2023 of the Electrical group’s building wire business and the Metal Services and Plumbing & Refrigeration groups were negatively impacted by lower metals prices, while revenues of the Transportation Products group reflected declining demand, particularly in the second half of the year.\n \n\n\nMarmon’s pre-tax earnings increased 13.1% in 2023 compared to 2022. The earnings increase in 2023 reflected the impacts from business acquisitions ($90 million) and losses of $90 million in 2022 from the shutdown of the Rail & Leasing group business in Russia. The Rail & Leasing, Water Technologies and Plumbing & Refrigeration groups generated higher organic earnings in 2023, which were offset by lower earnings from the Electrical group’s building wire business and from the Metals Services and Medical groups.\n \n\n\nK-\n47\n\n\n\n\n \n\n\nManagement’s Discussion and Analysis\n \n\n\nManufacturing, Service and Retailing\n \n\n\nIMC’s revenues increased 8.0% to $4.0 billion in 2023 compared to 2022. The increase reflected the impact of business acquisitions, organic sales growth in North America and other regions and higher interest income due to higher interest rates, partially offset by lower revenues in the Asia-Pacific region, unfavorable foreign currency translation from a stronger U.S. Dollar and the impact of ongoing geopolitical conflicts. IMC’s pre-tax earnings increased 6.9% in 2023 compared to 2022, primarily attributable to higher interest income. The impact of the revenue increase was largely offset by higher raw material costs, changes in sales mix and the adverse effects of geopolitical conflicts.\n\n\nBuilding products\n \n\n\nThe building products group includes manufactured and site-built home construction and related lending and financial services (Clayton Homes), flooring (Shaw), insulation, roofing and engineered products (Johns Manville), bricks and masonry products (Acme Building Brands), paint and coatings (Benjamin Moore) and residential and commercial construction and engineering products and systems (MiTek).\n\n\n2024 versus 2023\n\n\nRevenues of the building products group increased $560 million (2.2%) in 2024 compared to 2023. Pre-tax earnings decreased $53 million (1.3%) in 2024 compared to 2023.\n \n\n\nClayton Homes’ revenues increased 8.5% in 2024 to $12.4 billion compared to 2023. Revenues from home sales increased $565 million (6.4%) in 2024, reflecting higher new home unit sales of 11.5%, partially offset by changes in sales mix and lower average selling prices. Also, financial services revenues increased 15.5% in 2024 compared to 2023, primarily due to increased interest income from higher average loan balances. Loan balances, net of allowances for credit losses, were approximately $27.2 billion as of December 31, 2024, an increase of 14.0% since December 31, 2023. Loan portfolio balances are largely funded by borrowings from Berkshire finance affiliates.\n \n\n\nClayton Homes’ pre-tax earnings declined $115 million (5.6%) in 2024 compared to 2023, attributable to lower earnings from financial services (4.4%) and manufacturing activities (9.4%). The decline in financial services earnings reflected increased losses from homeowner property insurance claims, increased expected loan loss provisions due to higher loan originations, higher interest expense on borrowings from Berkshire finance affiliates. Interest expense increased $203 million (38%) in 2024 versus 2023, as borrowings from affiliates increased $6.6 billion in 2024 to $24.3 billion at December 31, 2024. The corresponding interest income on such borrowings is included in the “Other” earnings section on page K-54. The decline in manufacturing earnings was largely attributable to lower gross margin rates due to the increased cost of building homes to the Department of Energy’s Zero Energy Ready Home Program requirements (such incremental costs are partially offset by income tax credits).\n \n\n\nOur other building products businesses generated revenues of approximately $14.1 billion in 2024, a decline of $413 million (2.8%) versus 2023. Sales volumes in 2024 increased at Johns Manville and declined at the other businesses in the group, while average selling prices were lower at Johns Manville and MiTek and slightly higher at our other businesses.\n\n\nPre-tax earnings of our other building products businesses increased $61 million (2.9%) in 2024 compared to 2023. Earnings as a percentage of revenues increased 0.9 percentage points in 2024 to 15.6% compared to 2023. Earnings increased in 2024 from higher average gross margin rates arising from lower raw material costs and improved manufacturing efficiencies at certain of the businesses, partially offset by higher selling, general and administrative expenses and the impact of lower sales. Selling, general and administrative expenses in each year included losses from business restructuring activities and divestitures, as well as legal settlements and accruals.\n \n\n\n2023 versus 2022\n\n\nRevenues of the building products group decreased $2.9 billion (10.1%) and pre-tax earnings decreased $602 million (12.6%) in 2023 compared to 2022. The effects of significant increases in home mortgage interest rates in the U.S. slowed demand for our home building businesses and our other building products businesses.\n \n\n\nClayton Homes’ revenues were approximately $11.4 billion in 2023, a decrease of $1.3 billion (10.3%) compared to 2022. Revenues from home sales decreased $1.6 billion (15.3%) in 2023 to approximately $8.8 billion, primarily due to lower unit sales and changes in product mix. New home unit sales declined 13.7% in 2023, reflecting lower factory-built and site-built homes. Financial services revenues increased 12.2% in 2023 compared to 2022, primarily due to increased interest income on higher average loan balances.\n \n\n\nK-\n48\n\n\n\n\n \n\n\nManagement’s Discussion and Analysis\n \n\n\nManufacturing, Service and Retailing\n \n\n\nPre-tax earnings of Clayton Homes were approximately $2.0 billion in 2023, a decrease of $326 million (13.8%) compared to 2022. Earnings in 2023 reflected lower earnings from the home building businesses, partially offset by increased earnings from financial services. The decline in earnings from the home building businesses reflected the reduction in sales, a lower overall gross sales margin rate and higher operating expenses relative to sales. The increase in earnings from financial services was primarily attributable to increased net interest income, partially offset by increased expected loan loss provisions and higher insurance claims.\n\n\nAggregate revenues of our other building products businesses were approximately $14.5 billion in 2023, a decrease of 10.0% versus 2022. The decline in revenues reflected overall lower sales volumes and changes in product mix, partly offset by higher average selling prices. Pre-tax earnings of the other building products businesses were approximately $2.1 billion in 2023, a decrease of 11.4% compared to 2022. Pre-tax earnings as a percentage of revenues were 14.7% in 2023, a 0.3 percentage point decrease compared to 2022. The earnings decline in 2023 was driven by lower sales volumes, reduced manufacturing efficiencies and losses from restructurings, plant closures and divestitures in 2023, partially offset by lower raw material costs and energy costs as well as reduced freight, shipping and utilities expenses.\n \n\n\nConsumer products\n \n\n\nThe consumer products group includes leisure vehicles (Forest River), several apparel and footwear operations (including Fruit of the Loom, Garan, H.H. Brown Shoe Group and Brooks Sports) and a manufacturer of high-performance alkaline batteries (Duracell). This group also includes a global toy company (Jazwares), jewelry products (Richline) and custom picture framing products (Larson-Juhl).\n \n\n\n2024 versus 2023\n\n\nConsumer products group revenues were $14.9 billion in 2024, an increase of 2.2% compared to 2023. The increase was primarily attributable to higher revenues from Forest River, Brooks Sports and Duracell, partially offset by lower revenues from Fruit of the Loom, Garan and Richline. Forest River revenues increased 6.4% in 2024, reflecting a 7.9% increase in unit sales, which included the impact of business acquisitions in 2024 and 2023. Average selling prices for recreational vehicles declined and increased for bus and commercial vehicles, primarily attributable to changes in product mix. Brooks Sports and Duracell revenues increased 9.1% and 2.5%, respectively, in 2024 versus 2023. The revenue reductions at Fruit of the Loom and Richline were attributable to lower sales volumes, whereas the decline at Garan was attributable to lower average selling prices.\n\n\nConsumer products group pre-tax earnings increased $172 million (10.9%) in 2024 versus 2023. The increase was primarily attributable to higher earnings from our apparel and footwear businesses and Duracell, partially offset by lower earnings from Jazwares. Apparel and footwear earnings increased 37.0% in 2024 from 2023, primarily due to gross sales margin rate increases from lower sales markdowns, lower manufacturing costs and increased gains on asset sales, as well as from the favorable effects of past restructuring and cost management efforts. The earnings increase at Duracell was attributable to increased gross sales margins and lower selling, general and administrative expenses, including lower restructuring costs. The decline in earnings from Jazwares in 2024 was primarily due to increased amortization expense, as well as reduced orders from retailers during the fourth quarter.\n \n\n\n2023 versus 2022\n\n\nConsumer products group revenues declined $1.5 billion (9.4%) in 2023 versus 2022. The decline reflected lower revenues at Forest River and our apparel and footwear operations, partially offset by the impact of the Jazwares acquisition, which contributed revenues of $1.3 billion in 2023 and $240 million in 2022.\n\n\nForest River revenues declined 26.2% in 2023 compared to 2022, reflecting a 29.3% decline in unit sales and changes in sales mix. Forest River experienced strong recreational vehicle unit sales through the first half of 2022. Through most of 2023, sales of recreational vehicles declined significantly, attributable in part to the impact of rising interest rates, inflation and other macroeconomic conditions. The decline in recreational vehicle sales was partially offset by increased sales of bus and commercial vehicles.\n \n\n\nRevenues of our apparel and footwear businesses declined $452 million (9.4%) in 2023 compared to 2022. The decline was primarily due to reduced apparel revenues, attributable to lower unit volumes, partially offset by higher average selling prices. Duracell’s revenues in 2023 were relatively flat versus 2022.\n \n\n\nK-\n49\n\n\n\n\n \n\n\nManagement’s Discussion and Analysis\n \n\n\nManufacturing, Service and Retailing\n \n\n\nPre-tax earnings of the consumer products group increased $46 million (3.0%) in 2023 compared to 2022. Pre-tax earnings in 2023 reflected the impact of the Jazwares acquisition and higher earnings from the apparel and footwear businesses, partially offset by lower earnings from Forest River and Duracell. Certain of our apparel and footwear businesses took actions in 2023 to reduce inventories and right-size operations. The Forest River earnings decline in 2023 was primarily due to the impact of lower sales volumes, while the decline at Duracell was primarily attributable to higher restructuring costs.\n \n\n\nService and retailing\n \n\n\nA summary of revenues and pre-tax earnings of our service and retailing businesses follows (dollars in millions).\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\nPercentage change\n\n\n \n\n\n\n\n\n\n \n\n\n2024\n\n\n \n\n\n2023\n\n\n \n\n\n2022\n\n\n \n\n\n2024 vs 2023\n\n\n \n\n\n2023 vs 2022\n\n\n \n\n\n\n\n\n\nRevenues\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nService\n\n\n$\n\n\n20,697\n\n\n \n\n\n$\n\n\n20,588\n\n\n \n\n\n$\n\n\n19,006\n\n\n \n\n\n \n\n\n0.5\n\n\n%\n\n\n \n\n\n8.3\n\n\n%\n\n\n\n\n\n\nRetailing\n\n\n \n\n\n19,177\n\n\n \n\n\n \n\n\n19,408\n\n\n \n\n\n \n\n\n19,297\n\n\n \n\n\n \n\n\n(1.2\n\n\n)\n\n\n \n\n\n0.6\n\n\n \n\n\n\n\n\n\nPilot\n\n\n \n\n\n46,891\n\n\n \n\n\n \n\n\n51,739\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n(9.4\n\n\n)\n\n\n \n\n\n \n\n\n\n\n\n\nMcLane\n\n\n \n\n\n51,907\n\n\n \n\n\n \n\n\n52,607\n\n\n \n\n\n \n\n\n53,209\n\n\n \n\n\n \n\n\n(1.3\n\n\n)\n\n\n \n\n\n(1.1\n\n\n)\n\n\n\n\n\n\n \n\n\n$\n\n\n138,672\n\n\n \n\n\n$\n\n\n144,342\n\n\n \n\n\n$\n\n\n91,512\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nPre-tax earnings\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nService\n\n\n$\n\n\n2,305\n\n\n \n\n\n$\n\n\n2,995\n\n\n \n\n\n$\n\n\n3,047\n\n\n \n\n\n \n\n\n(23.0\n\n\n)%\n\n\n \n\n\n(1.7\n\n\n)%\n\n\n\n\n\n\nRetailing\n\n\n \n\n\n1,395\n\n\n \n\n\n \n\n\n1,726\n\n\n \n\n\n \n\n\n1,724\n\n\n \n\n\n \n\n\n(19.2\n\n\n)\n\n\n \n\n\n0.1\n\n\n \n\n\n\n\n\n\nPilot\n\n\n \n\n\n614\n\n\n \n\n\n \n\n\n968\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n(36.6\n\n\n)\n\n\n \n\n\n \n\n\n\n\n\n\nMcLane\n\n\n \n\n\n634\n\n\n \n\n\n \n\n\n455\n\n\n \n\n\n \n\n\n271\n\n\n \n\n\n \n\n\n39.3\n\n\n \n\n\n \n\n\n67.9\n\n\n \n\n\n\n\n\n\n \n\n\n$\n\n\n4,948\n\n\n \n\n\n$\n\n\n6,144\n\n\n \n\n\n$\n\n\n5,042\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nPre-tax earnings as a percentage of revenues\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nService\n\n\n \n\n\n11.1\n\n\n%\n\n\n \n\n\n14.5\n\n\n%\n\n\n \n\n\n16.0\n\n\n%\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nRetailing\n\n\n \n\n\n7.3\n\n\n%\n\n\n \n\n\n8.9\n\n\n%\n\n\n \n\n\n8.9\n\n\n%\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nPilot\n\n\n \n\n\n1.3\n\n\n%\n\n\n \n\n\n1.9\n\n\n%\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nMcLane\n\n\n \n\n\n1.2\n\n\n%\n\n\n \n\n\n0.9\n\n\n%\n\n\n \n\n\n0.5\n\n\n%\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nService\n \n\n\nOur service group consists of several businesses. The largest of these businesses are NetJets and FlightSafety (aviation services), which offer shared ownership programs for general aviation aircraft and high technology training products and services to operators of aircraft, and TTI, a distributor of electronics components. Our other service businesses franchise and service a network of quick service restaurants (Dairy Queen), lease transportation equipment (XTRA) and furniture (CORT), provide third party logistics services that primarily serve the petroleum and chemical industries (Charter Brokerage), distribute electronic news, multimedia and regulatory filings (Business Wire), provide various facilities construction management services (IPS-Integrated Project Services, LLC (IPS)) and operate a television station in Miami, Florida (WPLG). McLane, which we view as a service business, is addressed separately since it is deemed a separate segment for financial reporting purposes.\n \n\n\n2024 versus 2023\n\n\nService group revenues were $20.7 billion in 2024, a slight increase compared to 2023, reflecting revenue increases from aviation services businesses and IPS, partially offset by lower revenues from TTI and XTRA. Aviation services revenues increased 9.1% in 2024, while IPS revenues increased 14.4%. The aviation services increase was primarily due to an increase in the number of aircraft in shared aircraft ownership programs and increases in flight hours across NetJets’ various programs. The increase at IPS was primarily due to increased project volume.\n \n\n\nK-\n50\n\n\n\n\n \n\n\nManagement’s Discussion and Analysis\n \n\n\nManufacturing, Service and Retailing\n \n\n\nTTI revenues declined 10.0% in 2024 compared to 2023. Sales in 2024 declined across most regions, markets and product lines, attributable to excess inventory levels within supply chains, which contributed to lower sales volumes and pricing pressures. The decline at XTRA was due to fewer units on lease.\n \n\n\nService group pre-tax earnings declined 23.0% in 2024 compared to 2023, primarily attributable to TTI, the aviation services businesses and XTRA. Pre-tax earnings as a percentage of revenues fell 3.4 percentage points in 2024 to 11.1% compared to 2023. Earnings from TTI declined 51.0% in 2024 compared to 2023, reflecting the impact of lower sales and price competition, which contributed to reduced gross sales margin rates, and higher selling, general and administrative expenses. Earnings from aviation services declined 10.9% in 2024 versus 2023, primarily attributable to increased costs of services and leasing, driven by higher flight crew, maintenance, fuel costs and depreciation expense, as well as increased impairment charges. The decline at XTRA was primarily due to lower revenues and increased costs.\n \n\n\n2023 versus 2022\n\n\nRevenues of the service group increased $1.6 billion (8.3%) in 2023 compared to 2022. IPS produced revenues of $1.3 billion in 2023 and $358 million for the post-acquisition period in 2022. Revenues from aviation services increased 11.5% in 2023 compared to 2022, primarily due to increases in the number of aircraft in shared aircraft ownership programs and in flight hours across NetJets’ various programs, as well as higher average rates.\n \n\n\nRevenues from TTI declined 2.7% in 2023 compared to 2022. Excluding the effects of business acquisitions in 2022 and 2023 and favorable foreign currency translation effects, revenues declined 5.2% in 2023 versus 2022. Customer orders slowed throughout 2023 in several regions, particularly in the Asia-Pacific region, attributable to elevated customer inventory levels and increasing price competition.\n \n\n\nPre-tax earnings of the service group decreased $52 million (1.7%) in 2023 to $3.0 billion. Pre-tax earnings as a percentage of revenues declined 1.5 percentage points in 2023 compared to 2022. The earnings decline reflected lower earnings from TTI and certain of our other service businesses, partially offset by increased earnings from aviation services and the impact of the IPS acquisition. Earnings from TTI declined 17.3% in 2023, attributable to reduced sales and gross margin rates and higher operating expenses, partly offset by the impact of foreign currency exchange gains in 2023. The increase in earnings from aviation services was primarily attributable to a 14.4% increase in average aircraft within NetJets’ programs and higher rates.\n\n\nRetailing\n \n\n\nOur largest retailing business is Berkshire Hathaway Automotive, Inc. (“BHA”), which represented 69% of our retailing group revenue in 2024. BHA consists of over 80 auto dealerships that sell new and pre-owned automobiles and offer repair services and related products. BHA also offers and insures vehicle service contracts and related insurance products. Our retailing businesses also include four home furnishings businesses (Nebraska Furniture Mart, R.C. Willey, Star Furniture and Jordan’s), which sell furniture, appliances, flooring and electronics. The home furnishings group represented 17% of the retailing group revenues in 2024.\n \n\n\nOther retailing businesses include three jewelry businesses (Borsheims, Helzberg and Ben Bridge), See’s Candies (confectionery products), Pampered Chef (high quality kitchen tools), Oriental Trading Company (party supplies, school supplies and toys and novelties) and Detlev Louis Motorrad (“Louis”), a retailer of motorcycle accessories based in Germany. Pilot, which is primarily a retail business, is addressed separately since it is deemed a segment for financial reporting purposes.\n \n\n\n2024 versus 2023\n\n\nRetailing group revenues declined 1.2% to $19.2 billion in 2024 compared to 2023. Except for BHA and Louis, each of our other retailing businesses experienced revenue declines in 2024 compared to 2023. BHA vehicle sales revenues increased 0.5% in 2024 versus 2023. New vehicle unit sales increased 7.9% and pre-owned unit sales declined 2.0% in 2024 versus 2023. Further, average vehicle selling prices were lower in 2024 versus 2023, attributable to increased inventory availability and product mix changes. Revenues of the home furnishings businesses declined 6.4% in 2024 versus 2023, primarily attributable to lower sales volumes and price competition. Also, combined revenues of our other retail businesses declined 5.8% in 2024 compared to 2023, attributable to increased competition and sluggish consumer demand.\n \n\n\nK-\n51\n\n\n\n\n \n\n\nManagement’s Discussion and Analysis\n \n\n\nManufacturing, Service and Retailing\n\n\nRetailing group pre-tax earnings declined $331 million (19.2%) in 2024 compared to 2023. BHA’s pre-tax earnings declined 7.9% in 2024 compared to 2023, primarily due to lower vehicle gross profit margins, partially offset by higher earnings from finance/service contract and parts/service/repair operations, as well as lower selling, general and administrative expenses. Aggregate pre-tax earnings for the remainder of our retailing group declined $242 million (40.2%) in 2024 compared to 2023. Most of these other retailers generated significantly lower earnings in 2024 compared to 2023, reflecting lower sales and gross sales margin rates and higher selling, general and administrative expenses as percentages of sales.\n \n\n\n2023 versus 2022\n\n\nRetailing group revenues increased $111 million (0.6%) in 2023 compared to 2022, reflecting an increase at BHA, partially offset by lower revenues from our other retailers. BHA’s revenues increased 3.9% in 2023 compared to 2022. Revenues from new vehicle sales increased 12.6% in 2023 compared to 2022, while revenues from pre-owned retail vehicle sales declined 9.4%. Retail unit sales increased 2.7%, reflecting an 11.7% increase in new vehicles sold and a 4.7% decrease in pre-owned vehicles sold. Revenues from BHA’s parts/service/repair operations increased 6.6% in 2023 versus 2022. Revenues of our other retailing businesses declined 5.6% in the aggregate versus 2022, due primarily to an 8.6% decline at our home furnishings businesses.\n \n\n\nRetailing group pre-tax earnings were $1.7 billion in 2023, unchanged from 2022. BHA’s pre-tax earnings increased 17.7%, primarily due to earnings increases from the parts/service/repair and finance/service contract operations, as well as from higher investment income and lower selling, general and administrative and other expenses, partially offset by lower vehicle gross profit margin rates and higher floor plan interest expense. BHA’s comparative vehicle gross profit margin rates peaked in mid-2022 and declined through 2023. Aggregate pre-tax earnings for the remainder of our retailing group declined $168 million (21.8%) in 2023 compared to 2022, primarily due to a 28.3% decrease in home furnishings businesses earnings and the impact of a gain in 2022 from the divestiture of certain jewelry stores.\n \n\n\nPilot Travel Centers\n\n\nPilot Travel Centers (“Pilot”) operates travel centers, primarily under the names Pilot or Flying J, and fuel-only retail locations. Pilot also operates large wholesale fuel and fuel marketing platforms in the U.S.\n \n\n\nThrough January 31, 2023, we owned a 38.6% interest in Pilot, which we accounted for under the equity method. Our 38.6% proportionate share of Pilot’s net earnings for the month ending January 31, 2023 was included in equity method earnings in the accompanying Consolidated Statements of Earnings.\n \n\n\nOn January 31, 2023, we acquired an additional 41.4% interest in Pilot and owned an 80% controlling financial interest as of that date. Thus, we began consolidating Pilot’s results of operations in our Consolidated Statements of Earnings on February 1, 2023. We acquired the remaining 20% noncontrolling interest in Pilot on January 16, 2024.\n \n\n\nPilot’s earnings for the year ending December 31, 2024, the eleven months ending December 31, 2023 and the full year of 2023 are summarized below (in millions). Revenues, costs and expenses for January 2023 were not included in our Consolidated Financial Statements.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\nEleven Months\nEnding\nDecember 31,\n2023\n\n\n \n\n\n \n\n\n \n\n\nTwelve Months\nEnding\nDecember 31,\n2023\n\n\n \n\n\n\n\n\n\nRevenues\n\n\n$\n\n\n46,891\n\n\n \n\n\n \n\n\n$\n\n\n51,739\n\n\n \n\n\n \n\n\n \n\n\n$\n\n\n56,756\n\n\n \n\n\n\n\n\n\nCost of sales\n\n\n \n\n\n42,591\n\n\n \n\n\n \n\n\n \n\n\n47,505\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n52,196\n\n\n \n\n\n\n\n\n\nSelling, general and administrative expenses\n\n\n \n\n\n3,384\n\n\n \n\n\n \n\n\n \n\n\n2,852\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n3,067\n\n\n \n\n\n\n\n\n\nInterest expense\n\n\n \n\n\n302\n\n\n \n\n\n \n\n\n \n\n\n414\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n437\n\n\n \n\n\n\n\n\n\nPre-tax earnings\n\n\n$\n\n\n614\n\n\n \n\n\n \n\n\n$\n\n\n968\n\n\n \n\n\n \n\n\n \n\n\n$\n\n\n1,056\n\n\n \n\n\n\n\n\n\n \n\n\nK-\n52\n\n\n\n\n \n\n\nManagement’s Discussion and Analysis\n \n\n\nManufacturing, Service and Retailing\n \n\n\n2024 versus 2023\n\n\nPilot’s revenues declined $9.9 billion (17.4%) in 2024 compared to the full year 2023. The decline was primarily attributable to lower average fuel prices and a decline in volumes from non-core fuel activities.\n\n\nPilot’s pre-tax earnings declined $442 million (41.9%) in 2024 compared to the full year 2023. Gross sales margins declined 4.3% in 2024 compared to the full year 2023, attributable to lower diesel margins from lower price volatility. Selling, general and administrative expenses increased 10.3% in 2024 compared to the full year 2023, reflecting increased depreciation and amortization expenses, as well as labor, marketing and maintenance costs. Interest expense declined 30.9% in 2024 compared to the full year 2023, attributable to reduced borrowings and lower rates. In March 2024, Pilot borrowed $5.7 billion from certain Berkshire insurance subsidiaries and repaid its third-party borrowings. Pilot subsequently repaid $1.0 billion of the affiliate borrowings in 2024. The interest on Pilot’s borrowings from affiliates is included in insurance investment income on page K-39.\n\n\nMcLane\n\n\nMcLane Company, Inc. (“McLane”) operates a wholesale distribution business that provides grocery and non-food consumer products to retailers and convenience stores (“retail”) and to restaurants (“restaurant”). McLane also operates businesses that are wholesale distributors of distilled spirits, wine and beer (“beverage”). The retail and restaurant businesses generate high sales and very low profit margins. The retail business sales represented 63% of McLane’s consolidated sales in 2024 with the restaurant business generating most of the remainder. These businesses have several significant customers and a reduction in purchasing by any of these customers could have an adverse impact on McLane’s revenues and earnings.\n \n\n\n2024 versus 2023\n\n\nRevenues declined 1.3% in 2024 compared to 2023, reflecting lower restaurant business sales (5.7%) and increased retail business sales (1.0%) in 2024 compared to 2023. The decline in restaurant sales reflected lower unit sales attributable to changing consumer preferences for dining at restaurants and quick-service restaurants versus meals-at-home, partially offset by impacts of price inflation. Pre-tax earnings increased $179 million (39.3%) in 2024 compared to 2023 reflecting an increase in gross sales margin rates, which more than offset the impacts of lower sales and higher selling, general and administrative expenses.\n \n\n\n2023 versus 2022\n\n\nRevenues were $52.6 billion in 2023, a decline of $602 million (1.1%) compared to 2022. Revenues from the retail and restaurant businesses declined 0.8% and 2.2%, respectively, while revenues from the beverage business increased 1.9% compared to 2022. Retail and the restaurant business revenues were negatively affected in 2023 by lower unit volumes. Pre-tax earnings increased $184 million (67.9%) in 2023 compared to 2022. The increase reflected a slight increase in overall gross sales margin rates, increased other income and lower fuel expenses, partly offset by higher personnel expenses.\n \n\n\nNon-Controlled Businesses\n\n\nAfter-tax earnings of our non-controlled businesses include our proportionate share of earnings from our investments in Kraft Heinz, Occidental Petroleum (“Occidental”), Berkadia and Pilot through January 31, 2023. Earnings also included our 38.6% share of Pilot’s earnings for 2022 and for the month of January 2023.\n \n\n\nAfter-tax earnings attributable to these businesses declined $231 million in 2024 compared to 2023, primarily due to lower earnings from Kraft Heinz ($137 million) and the inclusion of Pilot in January 2023 ($83 million). Earnings of non-controlled businesses increased $222 million in 2023 compared to 2022. The comparative increase was primarily due to increased earnings from Occidental, on which we adopted the equity method on August 4, 2022, and Kraft Heinz ($240 million), partially offset by decreased earnings from Pilot ($559 million). As of January 31, 2023, we discontinued using the equity method for our pre-existing 38.6% interest in Pilot upon acquiring a controlling interest in Pilot. In each year, our earnings from Kraft Heinz included the impacts of goodwill and intangible asset impairments recorded by Kraft Heinz.\n\n\nK-\n53\n\n\n\n\n \n\n\nManagement’s Discussion and Analysis\n \n\n\nInvestment Gains (Losses)\n \n\n\nA summary of investment gains (losses) follows (dollars in millions).\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n \n\n\n2022\n\n\n \n\n\n\n\n\n\nInvestment gains (losses)\n\n\n \n\n\n$\n\n\n52,799\n\n\n \n\n\n \n\n\n$\n\n\n74,855\n\n\n \n\n\n \n\n\n$\n\n\n(67,623\n\n\n)\n\n\n\n\n\n\nOther\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n(276\n\n\n)\n\n\n\n\n\n\nGains (losses) before income taxes and noncontrolling interests\n\n\n \n\n\n \n\n\n52,799\n\n\n \n\n\n \n\n\n \n\n\n74,855\n\n\n \n\n\n \n\n\n \n\n\n(67,899\n\n\n)\n\n\n\n\n\n\nIncome taxes and noncontrolling interests\n\n\n \n\n\n \n\n\n11,241\n\n\n \n\n\n \n\n\n \n\n\n15,982\n\n\n \n\n\n \n\n\n \n\n\n(14,287\n\n\n)\n\n\n\n\n\n\nNet earnings (loss)\n\n\n \n\n\n$\n\n\n41,558\n\n\n \n\n\n \n\n\n$\n\n\n58,873\n\n\n \n\n\n \n\n\n$\n\n\n(53,612\n\n\n)\n\n\n\n\n\n\nEffective income tax rate\n\n\n \n\n\n \n\n\n21.2\n\n\n%\n\n\n \n\n\n \n\n\n21.3\n\n\n%\n\n\n \n\n\n \n\n\n20.9\n\n\n%\n\n\n\n\n\n\n \n\n\nUnrealized gains and losses arising from changes in market prices of our investments in equity securities are included in our reported earnings, which significantly increases the volatility of our periodic net earnings due to the magnitude of our equity securities portfolio and the inherent volatility of equity securities prices. Unrealized gains and losses on our investments in equity securities also include the effects of changes in foreign currency exchange rates on investments in non-U.S. issuers that are held by our U.S.-based subsidiaries.\n \n\n\nPre-tax investment gains and losses included net unrealized gains of $49.3 billion in 2024 and $69.1 billion in 2023 and net losses of $63.1 billion in 2022, attributable to changes in market prices during each year on equity securities we held at the end of each year. We also recorded pre-tax gains and losses from market value changes during each year on equity securities sold during the year, including net gains of $3.5 billion in 2024 and $2.7 billion in 2023 and net losses of $3.9 billion in 2022. Taxable investment gains on equity securities sold, which is generally the difference between sales proceeds and the original cost basis of the securities sold, were $101.1 billion in 2024, $5.0 billion in 2023 and $769 million in 2022. Investment gains in 2023 included a non-cash pre-tax gain of approximately $3.0 billion related to the remeasurement of our pre-existing interest in Pilot to fair value through the application of acquisition accounting upon attaining control of Pilot for financial reporting purposes.\n\n\nWe believe that investment gains and losses, whether realized from sales or unrealized from changes in market prices, are often meaningless in terms of understanding our reported consolidated earnings or evaluating our periodic economic performance. We continue to believe the investment gains and losses recorded in earnings in any given period has little analytical or predictive value.\n \n\n\nOther\n \n\n\nA summary of after-tax other earnings follows (in millions).\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n \n\n\n2022\n\n\n \n\n\n\n\n\n\nAcquisition accounting expenses\n\n\n$\n\n\n(531\n\n\n)\n\n\n \n\n\n$\n\n\n(693\n\n\n)\n\n\n \n\n\n$\n\n\n(681\n\n\n)\n\n\n\n\n\n\nCorporate interest expense, before foreign currency effects\n\n\n \n\n\n(242\n\n\n)\n\n\n \n\n\n \n\n\n(226\n\n\n)\n\n\n \n\n\n \n\n\n(269\n\n\n)\n\n\n\n\n\n\nForeign currency exchange rate gains on Berkshire \n   and BHFC non-U.S. Dollar senior notes\n\n\n \n\n\n1,151\n\n\n \n\n\n \n\n\n \n\n\n211\n\n\n \n\n\n \n\n\n \n\n\n1,263\n\n\n \n\n\n\n\n\n\nOther earnings\n\n\n \n\n\n1,017\n\n\n \n\n\n \n\n\n \n\n\n533\n\n\n \n\n\n \n\n\n \n\n\n196\n\n\n \n\n\n\n\n\n\n \n\n\n$\n\n\n1,395\n\n\n \n\n\n \n\n\n$\n\n\n(175\n\n\n)\n\n\n \n\n\n$\n\n\n509\n\n\n \n\n\n\n\n\n\n \n\n\nAfter-tax acquisition accounting expenses include charges arising from the application of the acquisition method in connection with certain of Berkshire’s past business acquisitions. These charges arise primarily from the amortization of intangible assets recorded in connection with those acquisitions.\n \n\n\nForeign currency exchange rate gains pertain to Berkshire’s and BHFC’s Euro, Great Britain Pound and Japanese Yen denominated debt. Changes in foreign currency exchange rates produce gains and losses from the periodic revaluation of these liabilities into U.S. Dollars. In each year, we recorded foreign currency exchange rate gains due to strengthening of the U.S. Dollar, which reduced the U.S. Dollar carrying value of the debt. The gains and losses recorded in any given period can be significant due to the magnitude of the borrowings and the inherent volatility in foreign currency exchange rates. Other earnings consist primarily of Berkshire parent company investment income, intercompany interest income when the related expense is included in earnings of the operating subsidiaries, corporate expenses and unallocated income taxes. Other earnings increased by $484 million in 2024 compared to 2023 and $337 million in 2023 compared to 2022, primarily due to increased interest income, including interest earned on intercompany loans to operating subsidiaries.\n\n\nK-\n54\n\n\n\n\n \n\n\nManagement’s Discussion and Analysis\n \n\n\nFinancial Condition\n \n\n\nOur Consolidated Balance Sheet continues to reflect significant liquidity and a very strong capital base. Berkshire’s shareholders’ equity at December 31, 2024 was $649.4 billion, an increase of $88.1 billion since December 31, 2023. Net earnings attributable to Berkshire shareholders were $89.0 billion for 2024 and included after-tax investment gains of approximately $41.6 billion. Investment gains and losses from changes in the market prices of our investments in equity securities usually produce significant volatility in our earnings.\n \n\n\nBerkshire’s common stock repurchase program, as amended, permits Berkshire to repurchase its Class A and Class B shares at prices below Berkshire’s intrinsic value, as conservatively determined by Warren Buffett, Berkshire’s Chairman of the Board and Chief Executive Officer. We are not committed to a minimum or subject to a maximum repurchase amount. We will not repurchase our stock if it reduces our consolidated cash, cash equivalents and U.S. Treasury Bills holdings to below $30 billion. Financial strength and redundant liquidity will always be of paramount importance at Berkshire. Berkshire paid $2.9 billion in 2024 to repurchase its common stock.\n\n\nAt December 31, 2024, our insurance and other businesses held cash, cash equivalents and U.S. Treasury Bills (net of payables for unsettled purchases) of $318.0 billion. Investments in equity and fixed maturity securities, excluding our investments in Kraft Heinz and Occidental common stock, were $287.0 billion. During 2024, we paid $9.2 billion to acquire equity securities and we received $143.4 billion from sales of equity securities.\n \n\n\nOn January 16, 2024, we acquired the remaining 20% noncontrolling ownership interest in Pilot for $2.6 billion. On September 30, 2024, BHE repurchased shares of its common stock held by certain noncontrolling BHE shareholders for $2.9 billion.\n\n\nOur consolidated borrowings at December 31, 2024 were $124.8 billion, of which over 95% were issued by the Berkshire parent company and BHFC, or by BNSF and BHE and its subsidiaries. Berkshire parent company debt outstanding at December 31, 2024 was $21.1 billion, an increase of $2.3 billion from December 31, 2023. At various dates in 2024, Berkshire issued approximately ¥837.4 billion (approximately $5.5 billion) of senior note issuances and term loan agreements. The borrowings have interest rates ranging from 0.974% to 2.625% and maturity dates ranging from 2027 to 2054. In 2024, senior note maturities were $1.9 billion. Additionally, the carrying value of Berkshire parent company non-U.S. Dollar denominated debt declined $1.4 billion in 2024 due to changes in foreign currency exchange rates.\n\n\nSenior note borrowings of BHFC, a wholly-owned financing subsidiary, were approximately $17.9 billion at December 31, 2024, relatively unchanged from December 31, 2023. BHFC’s borrowings are used to fund a portion of loans originated and acquired by Clayton Homes and equipment held for lease by our railcar leasing business. Berkshire guarantees BHFC’s senior notes for the full and timely payment of principal and interest.\n \n\n\nBNSF’s outstanding debt was $23.5 billion as of December 31, 2024, relatively unchanged from December 31, 2023. In 2024, BNSF issued $1.3 billion of 5.5% debentures due in 2055 and repaid approximately $1.3 billion of debentures. BHE’s aggregate borrowings were approximately $56.4 billion at December 31, 2024, relatively unchanged from December 31, 2023. In 2024, BHE subsidiaries issued $6.4 billion of term debt with a weighted average interest rate of 5.4% and maturity dates ranging from 2029 to 2055 and BHE and its subsidiaries repaid term debt and short-term borrowings aggregating approximately $5.9 billion. In 2025, BHE subsidiaries issued term debt of $1.5 billion, with maturities ranging from 2035 to 2055 and a weighted average interest rate of 6.0%. Berkshire does not guarantee the repayment of debt issued by BNSF, BHE or any of their subsidiaries or affiliates.\n \n\n\nIn 2024, our diverse group of businesses generated net operating cash flows of $30.6 billion, which was net of income tax payments of $28.5 billion. Income tax payments in 2024 included significant U.S. Federal income tax payments derived from taxable gains on sales of equity securities. The gross proceeds from such sales were included in cash flows from investing activities.\n \n\n\nOur consolidated capital expenditures for property, plant and equipment and equipment held for lease were $19.0 billion in 2024, which included capital expenditures by BNSF and BHE of $12.7 billion. BNSF and BHE maintain very large investments in capital assets (property, plant and equipment) and regularly make significant capital expenditures in the normal course of business. BHE and BNSF forecast capital expenditures in 2025 of approximately $14.0 billion.\n \n\n\nK-\n55\n\n\n\n\n \n\n\nManagement’s Discussion and Analysis\n \n\n\nContractual Obligations\n \n\n\nWe are party to other contracts associated with ongoing business activities, which will result in cash payments to counterparties in future periods. Our annual debt maturities for the next five years are summarized in Note 19 to the Consolidated Financial Statements. We also currently expect to pay interest on our debt ranging from $4.7 billion in 2025 to $4.1 billion in 2029 based on borrowings outstanding at December 31, 2024. Certain other obligations are included in our Consolidated Balance Sheets, such as operating lease liabilities and shared aircraft repurchase liabilities of NetJets. Estimated payments of these liabilities in each of the next five years are as follows (in billions): $2.0 in 2025; $1.8 in 2026; $2.0 in 2027; $2.2 in 2028; and $1.9 in 2029.\n\n\nWe are also obligated to pay claims arising from our property and casualty insurance companies. Such liabilities, including amounts from retroactive reinsurance, were approximately $148 billion at December 31, 2024. We currently forecast claim payments in 2025 of approximately $38 billion with respect to claims occurring prior to 2025. However, the timing and amount of the payments under insurance and reinsurance contracts are contingent upon the outcome of future events and can be highly uncertain. Actual payments will likely vary, perhaps materially, from forecasted payments. We anticipate that claims payments will be funded by operating cash flows.\n\n\nOther obligations pertaining to the acquisition of goods or services in the future, such as certain purchase obligations, are not currently reflected in the Consolidated Financial Statements and will be recognized in future periods as the goods are delivered or services are provided. As of December 31, 2024, the largest categories of our long-term contractual obligations primarily related to fuel, capacity, transmission and maintenance contracts and capital expenditure commitments of BHE and BNSF, aircraft purchase commitments of NetJets and purchase commitments of certain materials. We currently estimate future payments associated with these contracts over the next five years will approximate $30 billion, including $12 billion in 2025.\n \n\n\nCritical Accounting Estimates\n \n\n\nCertain accounting policies require us to make estimates and judgments in determining the amounts reflected in our Consolidated Financial Statements. Such estimates and judgments necessarily involve varying and significant degrees of uncertainty. Accordingly, certain amounts currently recorded in our Consolidated Financial Statements will likely be adjusted in the future based on new available information and changes in other facts and circumstances. A discussion of our principal accounting policies that required the application of significant judgments as of December 31, 2024 follows.\n \n\n\nProperty and casualty insurance unpaid losses\n \n\n\nWe record liabilities for unpaid losses and loss adjustment expenses (also referred to as “gross unpaid losses” or “claim liabilities”) based upon estimates of the ultimate amounts payable for loss events occurring on or before the balance sheet date. The timing and amount of ultimate loss payments are contingent upon, among other things, the timing of claim reporting from insureds and ceding companies and the final determination of the loss amount through the loss adjustment and settlement process.\n \n\n\nAs of the balance sheet date, recorded claim liabilities include estimates for reported claims and for incurred-but-not-reported (“IBNR”) claims. The period between the loss occurrence date and loss settlement date is the “claim-tail.” Property claims typically have relatively short claim-tails, while casualty claims usually have longer claim-tails, occasionally extending for decades. Casualty claims are more susceptible to litigation and the impact of changing contract interpretations. The legal environment and judicial process further contribute to extending claim-tails.\n \n\n\nOur consolidated claim liabilities, including liabilities from retroactive reinsurance contracts, as of December 31, 2024 were approximately $147.6 billion, of which 74% related to GEICO and the Berkshire Hathaway Reinsurance Group. Additional information regarding significant uncertainties inherent in the processes and techniques for estimating unpaid losses of these businesses follows.\n \n\n\nK-\n56\n\n\n\n\n \n\n\nManagement’s Discussion and Analysis\n \n\n\nCritical Accounting Estimates\n\n\nProperty and casualty insurance unpaid losses\n \n\n\nGEICO\n \n\n\nGEICO predominantly writes private passenger automobile insurance. As of December 31, 2024, GEICO’s gross claim liabilities were $24.8 billion and were $23.9 billion, net of reinsurance. GEICO’s claim reserving methodologies produce liability estimates based upon the individual claims. The key assumptions affecting our liability estimates include projections of ultimate claim counts (“frequency”) and average loss per claim (“severity”). A combination of several actuarial estimation methods, including Bornhuetter-Ferguson and chain-ladder methodologies.\n \n\n\nClaim liability estimates for liability coverages (such as bodily injury (“BI”), uninsured motorists and personal injury protection) are more uncertain due to the longer claim-tails, so we establish additional case development estimates. As of December 31, 2024, case development liabilities averaged approximately 31% of reported reserves. Case development factors are selected through analysis of the overall adequacy of historical case liabilities.\n \n\n\nThe adequacy of the aggregate claim liabilities is tested using one or more actuarial projections based on claim closure models and paid and incurred loss triangles. Each type of projection analyzes loss occurrence data for claims occurring in a given period and projects the ultimate cost.\n \n\n\nThe aggregate claim liability estimates recorded at the end of 2023 were reduced by $550 million during 2024, which produced a corresponding increase to pre-tax earnings. The assumptions used to estimate liabilities at December 31, 2024 reflect the most recent frequency and severity estimates. Future development of recorded liabilities will depend on whether actual frequency and severity of claims are more or less than anticipated.\n \n\n\nWith respect to liabilities for BI claims, we believe it is reasonably possible that average claims severities will change by at least one percentage point from the projected severities used in establishing the recorded liabilities at December 31, 2024. A one percentage point increase or decrease in BI severities could produce a $220 million increase or decrease in recorded liabilities, with a corresponding decrease or increase in pre-tax earnings. Many of the economic forces that would likely cause BI severity to differ from expectations would likely also cause severities for other injury coverages to differ in the same direction.\n \n\n\nBerkshire Hathaway Reinsurance Group\n \n\n\nBHRG’s property and casualty claims arise from a diverse portfolio of reinsurance contracts underwritten across multiple entities through the NICO, General Re and TransRe Groups. A summary of BHRG’s property and casualty unpaid losses and loss adjustment expenses, other than retroactive reinsurance losses and loss adjustment expenses, as of December 31, 2024 follows (in millions).\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\nProperty\n\n\n \n\n\n \n\n\nCasualty\n\n\n \n\n\n \n\n\nTotal\n\n\n \n\n\n\n\n\n\nCase liabilities\n\n\n$\n\n\n7,563\n\n\n \n\n\n \n\n\n$\n\n\n11,675\n\n\n \n\n\n \n\n\n$\n\n\n19,238\n\n\n \n\n\n\n\n\n\nIBNR liabilities\n\n\n \n\n\n9,007\n\n\n \n\n\n \n\n\n \n\n\n23,391\n\n\n \n\n\n \n\n\n \n\n\n32,398\n\n\n \n\n\n\n\n\n\nGross unpaid losses and loss adjustment expenses\n\n\n \n\n\n16,570\n\n\n \n\n\n \n\n\n \n\n\n35,066\n\n\n \n\n\n \n\n\n \n\n\n51,636\n\n\n \n\n\n\n\n\n\nReinsurance recoverable\n\n\n \n\n\n634\n\n\n \n\n\n \n\n\n \n\n\n1,369\n\n\n \n\n\n \n\n\n \n\n\n2,003\n\n\n \n\n\n\n\n\n\nNet unpaid losses and loss adjustment expenses\n\n\n$\n\n\n15,936\n\n\n \n\n\n \n\n\n$\n\n\n33,697\n\n\n \n\n\n \n\n\n$\n\n\n49,633\n\n\n \n\n\n\n\n\n\n \n\n\nGross unpaid losses and loss adjustment expenses consist primarily of traditional property and casualty coverages written under excess-of-loss and quota-share treaties. Under certain contracts, coverage can apply to multiple lines of business written and the ceding company may not report loss data by such lines consistently, if at all. In those instances, we judgmentally allocate losses to property and casualty coverages based on internal estimates.\n \n\n\nThe nature, extent, timing and perceived reliability of loss information received from ceding companies varies widely depending on the type of coverage and the contractual reporting terms. Reinsurance contract (or policy) terms, conditions and coverages also tend to lack standardization and may evolve more rapidly than primary insurance policies.\n \n\n\nK-\n57\n\n\n\n\n \n\n\nManagement’s Discussion and Analysis\n \n\n\nCritical Accounting Estimates\n\n\nProperty and casualty insurance unpaid losses\n \n\n\nThe loss information provided under many facultative (individual risk) or per occurrence excess-of-loss contracts may be comparable to the information received under a primary insurance contract. However, loss information with respect to aggregate excess-of-loss and quota-share contracts is often in a summary form rather than on an individual claim basis. Loss data includes currently recoverable paid losses, as well as case loss estimates. Ceding companies infrequently provide reliable IBNR loss estimates.\n \n\n\nLoss reporting to reinsurers is typically slower than primary insurers. Client reporting of claims information is required based on the terms of the contract at intervals ranging from 30 to 180 days after the end of the quarterly or annual period, reporting practices can vary by jurisdiction. To the extent that reinsurers assume and cede underlying risks from other reinsurers, further delays in claims reporting may occur. The relative impact of reporting delays depends on the type of coverage, contractual reporting terms, or the magnitude of the claim relative to the attachment point of the reinsurance coverage.\n \n\n\nThe premium and loss data BHRG receives is at least one level removed from the underlying claimant, so there is a risk that the loss data reported is incomplete, inaccurate or the claim is outside the coverage terms. We maintain internal procedures to determine that the information is complete and in compliance with the contract terms. Generally, our reinsurance contracts permit us to audit the ceding company’s records with respect to the subject business for compliance with the terms of the policy. Disputes occasionally arise concerning whether claims are covered by our reinsurance policies, which are normally resolved through negotiation. If disputes cannot be resolved, our contracts generally provide arbitration or alternative dispute resolution processes. We believe there are no coverage disputes at this time for which an adverse resolution would likely have a material impact on our consolidated results of operations or financial condition.\n \n\n\nEstablishing claim liability estimates for reinsurance requires evaluation of loss information received from our clients. While we generally rely on the ceding companies’ reported case loss estimates, we may perform our own evaluations certain reported case losses and if deemed appropriate, use our own case liability estimate. As of December 31, 2024, our case loss estimates exceeded ceding company estimates by approximately $1.7 billion. We also periodically conduct detailed reviews of individual client claims, which may cause us to adjust our case estimates.\n \n\n\nAlthough liabilities for losses are initially determined based on pricing and underwriting analysis, we use a variety of actuarial methodologies that place reliance on the extrapolation of historical data, loss development patterns, industry data and other benchmarks. The estimate of the IBNR liabilities also requires judgment by actuaries and management to reflect the impact of additional factors like change in business mix, volume, claim reporting and handling practices, inflation, social and legal environment and the terms and conditions of the contracts. The methodologies generally fall into or are hybrids of one or more of the following categories:\n\n\nPaid and incurred loss development methods\n consider the expected case loss emergence and development patterns, together with expected loss ratios by year. Factors affecting loss development analysis include, but are not limited to, changes in the following: client claims reporting and settlement practices, the frequency of client company claim reviews, policy terms and coverage (such as loss retention levels and occurrence and aggregate policy limits), loss trends and legal trends that result in unanticipated losses. Collectively, these factors influence our selections of expected case loss emergence patterns.\n\n\nIncurred and paid loss Bornhuetter-Ferguson methods\n consider actual paid and incurred losses and expected reporting patterns of paid and incurred losses, taking the initial expected ultimate losses into account to determine an estimate of the expected unpaid or unreported losses.\n\n\nK-\n58\n\n\n\n\n \n\n\nManagement’s Discussion and Analysis\n \n\n\nCritical Accounting Estimates\n\n\nProperty and casualty insurance unpaid losses\n \n\n\nFrequency and severity methods\n commonly focus on a review of the number of anticipated claims and the anticipated claims severity and may also rely on development patterns to derive such estimates. However, our processes and techniques for estimating liabilities in such analyses generally rely more on a per-policy assessment of the ultimate cost associated with the individual loss rather than with an analysis of historical development patterns of past losses.\n\n\nAdditional analysis\n – In some cases we have established reinsurance claim liabilities on a contract-by-contract basis, determined from case loss estimates reported by the ceding company and IBNR liabilities that are primarily a function of an anticipated loss ratio for the contract and the reported case loss estimate. Liabilities are adjusted upward or downward over time to reflect case losses reported versus expected case losses, which we use to form revised judgment on the adequacy of the expected loss ratio and the level of IBNR liabilities required for unreported claims. Anticipated loss ratios are also revised to include estimates of known major catastrophe events.\n \n\n\nOur claim liability estimation process for short-tail lines, primarily property exposures, utilizes a combination of the paid and incurred loss development methods and the incurred and paid loss Bornhuetter-Ferguson methods. Certain property, individual risk and aviation excess-of-loss contracts tend to generate low frequency/high severity losses. Our processes and techniques for estimating liabilities under such contracts generally rely more on a per contract assessment of the ultimate cost associated with the individual loss event rather than with an analysis of the historical development patterns of past losses.\n \n\n\nFor our long-tail lines, primarily casualty exposures, we may rely on different methods depending on the maturity of the business, with estimates for the most recent years being based on priced loss expectations and more mature years reflecting the paid or incurred development pattern indications.\n\n\nIn 2024, we reduced estimated ultimate pre-2024 accident years’ claim liabilities by $1.7 billion, of which $1.6 billion was attributable to lower-than-expected reported property losses. In 2024, we also reduced estimated ultimate casualty claim liabilities for pre-2024 accident years by approximately $100 million. These reductions produced corresponding increases in pre-tax earnings.\n \n\n\nThe portfolios of contracts within the three BHRG Groups vary considerably, covering multiple lines of business within diverse geographic areas and legal environments, which requires us to vary the application of actuarial methods and weighting of assumptions to determine the appropriate ultimate claims estimates. Given the heterogeneity of the groups of contracts and actuarial methods and assumptions applied, we believe it is not possible to reasonably quantify the impact of changes in any single or limited group of assumptions to the entire portfolio. Moreover, changes in certain assumptions often create iterative impacts on other actuarial assumptions. Accordingly, we believe it is impracticable to provide meaningful quantification of the impact of changes to any limited number of chosen assumptions.\n\n\nBHRG’s property and casualty unpaid loss and loss adjustment expenses could be materially higher or lower than the liabilities as of December 31, 2024 due to the inherent uncertainty of determining ultimate claims costs for claims that have occurred or will be deemed to have occurred as of the balance sheet date. We currently believe, however, that significant upward revisions to claims estimates are more likely for casualty claims, given longer claims tails and evolving inflation, legal, judicial and mass tort risks, including the manifestation of new forms of claims that were not contemplated when the policies were written. We believe a five percent increase in BHRG’s casualty claim liabilities over time is reasonably possible, although this should not be viewed as a worst-case scenario given the risks identified. An increase of this magnitude to our gross liabilities for casualty claims at December 31, 2024 could produce an increase in casualty liabilities of $1.75 billion, with a corresponding decrease to pre-tax earnings.\n \n\n\nRetroactive reinsurance\n \n\n\nOur retroactive reinsurance contracts indemnify insurance losses from events occurring before the contract inception dates. Claim liabilities associated with these contracts predominately pertain to casualty or liability exposures and we expect the claim-tails will be very long. At December 31, 2024, gross unpaid losses were $32.4 billion.\n \n\n\nOur contracts are generally subject to maximum limits of indemnification and, as such, we currently expect that the aggregate remaining losses payable under our policies will not exceed $47 billion. While ultimate claims will be affected by judicial and legislative changes affecting asbestos, environmental or mass tort exposures, we currently believe it unlikely that losses will increase to the maximum or decline by more than 15% of our estimated gross claims liability as of December 31, 2024.\n \n\n\nK-\n59\n\n\n\n\n \n\n\nManagement’s Discussion and Analysis\n \n\n\nCritical Accounting Estimates\n\n\nProperty and casualty insurance unpaid losses\n \n\n\nWe establish liability estimates by individual contract, considering exposure and development trends, historical aggregate loss payment patterns and project expected ultimate losses under various scenarios. We apply judgmental probability factors to these scenarios to determine an expected outcome. We also monitor subsequent loss payment activity and ceding company reports and other available information. We re-estimate ultimate losses when significant events or significant deviations from expectations are revealed.\n \n\n\nCertain of our contracts include asbestos and environmental, as well as other mass tort exposures. Our estimated liabilities for asbestos and environmental exposures were approximately $11.9 billion at December 31, 2024. Ceding companies do not consistently provide reliable and detailed underlying claims data, particularly with respect to multi-line or aggregate excess-of-loss policies. When possible, we conduct detailed analyses of the underlying loss data in making an estimate of ultimate remaining claims liabilities. When detailed loss information is unavailable, we may apply recent industry trends and projections to aggregate client data. Judgments in these areas necessarily consider the stability of the legal and regulatory environment under which we expect claims will be adjudicated. Legal reform and legislation and judicial rulings could also have a significant impact on our ultimate liabilities.\n \n\n\nDeferred charges for retroactive reinsurance contracts, which at the inception dates of the contracts, represent the excess of the estimated ultimate liability for unpaid losses over premiums received. Deferred charges are subsequently adjusted based on the changes to expected ultimate liabilities and the timing of actual and expected future loss payments. Deferred charge assets were $8.8 billion at December 31, 2024. We estimate that deferred charge assets will decline $830 million in 2025, producing a corresponding charge to pre-tax earnings.\n \n\n\nOverall, we increased estimated ultimate liabilities for prior year retroactive reinsurance contracts by $196 million in 2024, primarily for asbestos, environmental and other casualty exposures. This increase, net of the related changes in deferred charge assets had an insignificant impact on underwriting results.\n \n\n\nOther Critical Accounting Estimates\n \n\n\nOur Consolidated Balance Sheet at December 31, 2024 includes goodwill of acquired businesses of $83.9 billion and indefinite-lived other intangible assets of $18.9 billion. We evaluate these assets for impairment annually in the fourth quarter and on an interim basis if the facts and circumstances lead us to believe that more likely than not there has been an impairment.\n \n\n\nGoodwill and indefinite-lived intangible asset impairment reviews include determining the estimated fair values of our reporting units and of indefinite-lived intangible assets. Several methods may be used to estimate fair values, including market quotations, multiples of earnings and other valuation techniques, such as discounted projected future earnings or cash flow methods. The key assumptions and inputs used in fair value determinations may include forecasting revenues and expenses, cash flows and capital expenditures, as well as an appropriate discount rate and other inputs.\n \n\n\nSignificant judgment by management is required in estimating the fair value of a reporting unit and in performing impairment reviews. Due to the inherent subjectivity and uncertainty in forecasting future cash flows and earnings over long periods of time, actual results may differ materially from the forecasts. Reasonable estimates of the fair value of a business enterprise may range widely.\n \n\n\nIf the carrying value of a reporting unit exceeds the estimated fair value of the reporting unit, then the excess, limited to the carrying amount of goodwill, is charged to earnings as an impairment loss. If the carrying value of the indefinite-lived intangible asset exceeds fair value, the excess is charged to earnings as an impairment loss.\n \n\n\nAs of December 31, 2024, we concluded that more-likely-than not, the goodwill recorded in our Consolidated Balance Sheet was not impaired. However, the fair value estimates of the reporting units and assets are subject to change based on market and economic conditions, as well as events affecting our businesses or the industries in which they operate, which we cannot reliably predict. It is reasonably possible that adverse changes in such conditions or events could result in the recognition of impairment losses in our Consolidated Financial Statements.\n\n\nK-\n60\n\n\n\n\n \n\n\nManagement’s Discussion and Analysis\n \n\n\nCritical Accounting Estimates\n\n\nOther Critical Accounting Estimates\n \n\n\nIn connection with the annual goodwill impairment review conducted in the fourth quarter of 2024, our estimated fair values of seven reporting units did not exceed our carrying values by at least 20%. These reporting units included PCC, as well as three reporting units acquired in late 2022 and early 2023. Our estimated fair value of PCC’s equity exceeded the carrying value of $28.5 billion, which included goodwill of approximately $7.5 billion, by nearly 20%. Of the three units acquired in 2022 and 2023, the largest was Pilot, which had an estimated fair value of approximately $20.3 billion and a carrying value of $18.3 billion, including goodwill of $6.5 billion. The remaining five other reporting units had an aggregate estimated fair value of approximately $11.7 billion, which exceeded our aggregate carrying value by approximately 12%. The carrying value of these units included goodwill of approximately $4.6 billion.\n \n\n\nMarket Risk Disclosures\n \n\n\nOur Consolidated Balance Sheets include substantial amounts of assets and liabilities whose fair values are subject to market risks. Our significant market risks are primarily associated with equity prices, interest rates, foreign currency exchange rates and commodity prices. The fair values of our investment portfolios remain subject to considerable volatility. The following sections address the significant market risks associated with our business activities.\n\n\nEquity Price Risk\n \n\n\nInvestments in equity securities represent the most significant portion of our consolidated investment portfolio. Strategically, we strive to invest in businesses that possess excellent economics and management, and we prefer to invest a meaningful amount in each company. Historically, our investments have been concentrated in relatively few issuers. At December 31, 2024, approximately 71% of the aggregate fair value of our investments in equity securities was concentrated in five companies.\n \n\n\nWe often hold our investments for long periods and short-term price volatility has occurred in the past and will occur in the future. We also maintain significant levels of shareholder capital and ample liquidity to provide a margin of safety against short-term price volatility.\n \n\n\nThe following table summarizes our investments in equity securities, excluding our investments in Kraft Heinz and Occidental common stocks that are accounted for under the equity method, and the estimated effects of a hypothetical 30% increase and a 30% decrease in market prices as December 31, 2024 and 2023. The selected 30% hypothetical increase and decrease does not represent the best or worst case scenario. Indeed, results from declines could be far worse due both to the nature of equity markets and the concentrations existing in our investment portfolio. Dollar amounts are in millions.\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nFair Value\n\n\n \n\n\n \n\n\nHypothetical\nPrice Change\n\n\n \n\n\nEstimated\nFair\n \nValue After\nHypothetical\nChange in Prices\n\n\n \n\n\n \n\n\nEstimated\nIncrease\n(Decrease)\nin Net Earnings \n(1)\n\n\n \n\n\n\n\n\n\nDecember 31, 2024\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nInvestments in equity securities\n\n\n \n\n\n$\n\n\n271,588\n\n\n \n\n\n \n\n\n30% increase\n\n\n \n\n\n$\n\n\n351,020\n\n\n \n\n\n \n\n\n$\n\n\n62,615\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n30% decrease\n\n\n \n\n\n \n\n\n192,323\n\n\n \n\n\n \n\n\n \n\n\n(62,483\n\n\n)\n\n\n\n\n\n\nDecember 31, 2023\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nInvestments in equity securities\n\n\n \n\n\n$\n\n\n353,842\n\n\n \n\n\n \n\n\n30% increase\n\n\n \n\n\n$\n\n\n457,993\n\n\n \n\n\n \n\n\n$\n\n\n82,281\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n30% decrease\n\n\n \n\n\n \n\n\n249,885\n\n\n \n\n\n \n\n\n \n\n\n(82,129\n\n\n)\n\n\n\n\n\n\n \n\n\n(1)\nThe estimated increase (decrease) is after income taxes. \n\n\nK-\n61\n\n\n\n\n \n\n\nManagement’s Discussion and Analysis\n \n\n\nInterest Rate Risk\n \n\n\nWe also invest in bonds, loans or other interest rate sensitive instruments. Our strategy is to acquire or originate such instruments at prices or with interest rates considered appropriate relative to the perceived credit risk. We also issue debt in the ordinary course of business to fund business operations and for general purposes. We attempt to maintain high credit ratings to minimize the cost of our debt. We generally do not utilize derivative products, such as interest rate swaps, to manage interest rate risks and we do not attempt to match maturities of assets and liabilities.\n\n\nThe fair values of our fixed maturity investments, loans and finance receivables and notes payable and other borrowings will fluctuate in response to changes in market interest rates. Increases and decreases in interest rates generally translate into decreases and increases in fair values of these instruments. Additionally, fair values of interest rate sensitive instruments may be affected by the perceived credit risk, prepayment options, liquidity and other factors, as well as general market conditions.\n \n\n\nThe following table summarizes the estimated effects of hypothetical changes in interest rates on our significant assets and liabilities that are subject to significant interest rate risk. We assumed that the interest rate changes occur immediately and uniformly to each category of instrument and that there were no significant changes to other factors used to determine the value of the instrument. The hypothetical changes in interest rates do not reflect the best or worst case scenarios. Actual results may differ from those reflected in the table. Dollars are in millions.\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\nEstimated Fair Value After Hypothetical Change in\nInterest Rates (bp=basis points)\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\nFair\nValue\n\n\n \n\n\n \n\n\n100 bp\ndecrease\n\n\n \n\n\n \n\n\n100 bp\nincrease\n\n\n \n\n\n \n\n\n200 bp\nincrease\n\n\n \n\n\n \n\n\n300 bp\nincrease\n\n\n \n\n\n\n\n\n\nDecember 31, 2024\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nAssets:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nInvestments in fixed maturity securities\n\n\n \n\n\n$\n\n\n15,364\n\n\n \n\n\n \n\n\n$\n\n\n15,503\n\n\n \n\n\n \n\n\n$\n\n\n15,220\n\n\n \n\n\n \n\n\n$\n\n\n15,086\n\n\n \n\n\n \n\n\n$\n\n\n14,958\n\n\n \n\n\n\n\n\n\nInvestments in equity securities\n*\n\n\n \n\n\n \n\n\n8,429\n\n\n \n\n\n \n\n\n \n\n\n8,743\n\n\n \n\n\n \n\n\n \n\n\n8,142\n\n\n \n\n\n \n\n\n \n\n\n7,864\n\n\n \n\n\n \n\n\n \n\n\n7,597\n\n\n \n\n\n\n\n\n\nLoans and finance receivables\n\n\n \n\n\n \n\n\n27,579\n\n\n \n\n\n \n\n\n \n\n\n28,774\n\n\n \n\n\n \n\n\n \n\n\n26,476\n\n\n \n\n\n \n\n\n \n\n\n25,455\n\n\n \n\n\n \n\n\n \n\n\n24,508\n\n\n \n\n\n\n\n\n\nLiabilities:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nNotes payable and other borrowings:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nInsurance and other\n\n\n \n\n\n \n\n\n40,181\n\n\n \n\n\n \n\n\n \n\n\n43,345\n\n\n \n\n\n \n\n\n \n\n\n37,467\n\n\n \n\n\n \n\n\n \n\n\n35,122\n\n\n \n\n\n \n\n\n \n\n\n33,082\n\n\n \n\n\n\n\n\n\nRailroad, utilities and energy\n\n\n \n\n\n \n\n\n72,506\n\n\n \n\n\n \n\n\n \n\n\n80,339\n\n\n \n\n\n \n\n\n \n\n\n65,916\n\n\n \n\n\n \n\n\n \n\n\n60,332\n\n\n \n\n\n \n\n\n \n\n\n55,565\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nDecember 31, 2023\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nAssets:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nInvestments in fixed maturity securities\n\n\n \n\n\n$\n\n\n23,758\n\n\n \n\n\n \n\n\n$\n\n\n23,937\n\n\n \n\n\n \n\n\n$\n\n\n23,585\n\n\n \n\n\n \n\n\n$\n\n\n23,419\n\n\n \n\n\n \n\n\n$\n\n\n23,258\n\n\n \n\n\n\n\n\n\nInvestments in equity securities*\n\n\n \n\n\n \n\n\n8,688\n\n\n \n\n\n \n\n\n \n\n\n9,069\n\n\n \n\n\n \n\n\n \n\n\n8,329\n\n\n \n\n\n \n\n\n \n\n\n7,990\n\n\n \n\n\n \n\n\n \n\n\n7,670\n\n\n \n\n\n\n\n\n\nLoans and finance receivables\n\n\n \n\n\n \n\n\n24,190\n\n\n \n\n\n \n\n\n \n\n\n25,187\n\n\n \n\n\n \n\n\n \n\n\n23,266\n\n\n \n\n\n \n\n\n \n\n\n22,409\n\n\n \n\n\n \n\n\n \n\n\n21,612\n\n\n \n\n\n\n\n\n\nLiabilities:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nNotes payable and other borrowings:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nInsurance and other\n\n\n \n\n\n \n\n\n44,981\n\n\n \n\n\n \n\n\n \n\n\n48,547\n\n\n \n\n\n \n\n\n \n\n\n41,958\n\n\n \n\n\n \n\n\n \n\n\n39,378\n\n\n \n\n\n \n\n\n \n\n\n37,158\n\n\n \n\n\n\n\n\n\nRailroad, utilities and energy\n\n\n \n\n\n \n\n\n75,239\n\n\n \n\n\n \n\n\n \n\n\n83,118\n\n\n \n\n\n \n\n\n \n\n\n68,582\n\n\n \n\n\n \n\n\n \n\n\n62,995\n\n\n \n\n\n \n\n\n \n\n\n58,246\n\n\n \n\n\n\n\n\n\n \n\n\n* \nIncludes Cumulative Perpetual Preferred Stocks\n\n\nForeign Currency Risk\n \n\n\nCertain of our subsidiaries operate in foreign jurisdictions and we transact business in foreign currencies. In addition, we hold investments in common stocks of major multinational companies, who have significant foreign business and foreign currency risk of their own. In most instances, we do not attempt to match assets and liabilities by currency or use derivative contracts to manage foreign currency risks in a meaningful way.\n \n\n\nK-\n62\n\n\n\n\n \n\n\nManagement’s Discussion and Analysis\n \n\n\nForeign Currency Risk\n \n\n\nOur net assets subject to financial statement translation into U.S. Dollars are primarily in our insurance, utilities and energy and certain manufacturing subsidiaries. A portion of our financial statement translation-related impact from changes in foreign currency rates is recorded in other comprehensive income. In addition, we include gains or losses from changes in foreign currency exchange rates in net earnings related to non-U.S. Dollar denominated assets and liabilities of Berkshire and its U.S.-based subsidiaries. A summary of these gains (losses), after-tax, for each of the years ending December 31, 2024 and 2023 follows (in millions).\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n\n\n\n\nNon-U.S. Dollar denominated debt included in net earnings\n\n\n \n\n\n$\n\n\n1,151\n\n\n \n\n\n \n\n\n$\n\n\n211\n\n\n \n\n\n\n\n\n\nNet liabilities under certain reinsurance contracts included in net earnings\n\n\n \n\n\n \n\n\n136\n\n\n \n\n\n \n\n\n \n\n\n(241\n\n\n)\n\n\n\n\n\n\nForeign currency translation included in other comprehensive income\n\n\n \n\n\n \n\n\n(1,646\n\n\n)\n\n\n \n\n\n \n\n\n749\n\n\n \n\n\n\n\n\n\nCommodity Price Risk\n \n\n\nOur subsidiaries use commodities in various ways in manufacturing and providing services. As such, we are subject to price risks related to various commodities. In most instances, we attempt to manage these risks through the pricing of our products and services to customers. To the extent that we are unable to sustain price increases in response to commodity price increases, our operating results will likely be adversely affected. We generally do not utilize derivative contracts to manage commodity price risks to any significant degree.",
  "item2": null
}