{
  "source_file": "bsx-20241231.htm",
  "form_type": "10-K",
  "item1": "ITEM 1. BUSINESS\nOur Company\nBoston Scientific Corporation is a global developer, manufacturer and marketer of medical devices that are used in a broad range of interventional medical specialties. Our mission is to transform lives through innovative medical solutions that improve the health of patients around the world. As a medical technology leader for more than 45 years, we have advanced the practice of less-invasive medicine by helping physicians and other medical professionals diagnose and treat a wide range of diseases and medical conditions and improve patients’ quality of life by providing alternatives to surgery and other medical procedures that are typically traumatic to the body. We advance science for life by providing a broad range of high-performance solutions to address unmet patient needs and reduce the cost of health care. When used in this report, the terms \"we,\" \"us,\" \"our\" and \"the Company\" mean Boston Scientific Corporation and its divisions and subsidiaries. \nBusiness Strategy\nWe operate pursuant to five strategic imperatives. We aim to: Strengthen Category Leadership, Expand into High Growth Adjacencies, Drive Global Expansion, Fund the Journey to Fuel Growth and Develop Key Capabilities. We believe that our execution of these strategic imperatives will help us deliver on our mission, drive innovation and increase value for our customers and employees, while strengthening our leadership position in the medical device industry and delivering profitable revenue growth. \nWe expect to continue to invest in our core businesses and pursue opportunities to diversify and further expand our presence in strategic, high-growth adjacencies and new global markets, including growth within the countries we define as emerging markets. Maintaining and expanding our international presence is an important component of our long-term growth strategy. Through our international presence, we seek to increase net sales and market share, leverage our relationships with leading physicians and their clinical research programs, accelerate the time to bring new products to market and gain access to worldwide technological developments that we can implement across our product lines. Our research and development efforts are focused largely on the development of next-generation and novel technology offerings across multiple programs and all divisions. In the past several years, we have completed numerous acquisitions in support of our growth strategy, both strengthening our core businesses and expanding into high growth adjacent markets. We continue to develop digital tools and technologies that enable us to compete more effectively and deliver first class remote physician education, drive deeper patient engagement and increase digitally-enabled sales force productivity. \nWe have a firm commitment to corporate social responsibility and living our values as a global business and global corporate citizen. This includes taking actions to advance diversity and inclusion, including through financial support of equity initiatives in the communities where we live and work, protecting the environment, investing in our employees' health and well-being, and many other initiatives that we believe ultimately help us create value responsibly. Refer to discussion of \nCommunity Outreach \nand \nCorporate Responsibility \nbelow for additional information regarding measures we are undertaking.\nProduct Offerings\nOur core businesses are organized into two reportable segments: MedSurg and Cardiovascular. The following describes our key product offerings and new product innovations by reportable segment and business unit.\nMedSurg\nEndoscopy\nOur Endoscopy business unit develops and manufactures devices to diagnose and treat a broad range of gastrointestinal (GI) conditions with innovative, less-invasive technologies. Our product offerings include the following:\n•\nResolution 360™ Clips, Resolution 360™ ULTRA Clips and MANTIS™ Clips, hemostatic clipping technology designed to stop and help prevent bleeding during endoscopic procedures, \n•\nWallFlex™ Biliary Stent Systems, used for relieving biliary obstructions by providing bile drainage in both malignant and benign strictures,\n3\n•\nAXIOS™ Stents and Electrocautery Enhanced Delivery Systems, the first, and currently only stent systems in the U.S. indicated for endoscopic drainage of pancreatic pseudocysts and used to facilitate endoscopic drainage of the gallbladder for patients with acute cholecystitis,\n•\nSpyGlass™ DS II Direct Visualization Systems and SpyGlass™ Discover Digital Catheters, the first single-use scopes to enable physicians to take a single-stage approach to diagnostic and therapeutic procedures in the pancreaticobiliary system, including treating patients with bile duct stones,\n•\nEXALT™ Model D Single-Use Duodenoscopes for use in endoscopic retrograde cholangiopancreatography (ERCP) procedures, the first U.S. Food and Drug Administration (FDA)-cleared single-use (disposable) duodenoscopes on the market,\n•\nour endoluminal surgery portfolio, including our OverStitch™ Endoscopic Suturing System, used to close gastrointestinal defects and our endobariatric portfolio, including our Orbera™ Intragastric Balloon System used to aid in weight loss for patients suffering from obesity and\n•\nour infection prevention portfolio, designed to minimize the risk of infection transmission and improve operational efficiencies by streamlining manual cleaning or eliminating the need for cleaning and tracking.\nUrology\nOur Urology business unit develops and manufactures devices to treat various urological conditions for both male and female anatomies, including kidney stones, benign prostatic hyperplasia (BPH), prostate cancer, erectile dysfunction and incontinence. Our product offerings include the following:\n•\na comprehensive line of stone management products, including ureteral stents, catheters, baskets, guidewires, sheaths and balloons,\n•\nLithoVue™ Single-Use Digital Flexible Ureteroscopes, which deliver detailed high-resolution digital images for high-quality visualization and seamless navigation, \n•\nLumenis Pulse™ Holmium Laser Systems with \nMOSES\n™ \nTechnology, complemented by a\n full line of laser fibers and accessories used in urology procedures,\n•\nour prosthetic urology portfolio, which includes our AMS 700™ penile implant with the TENACIO™ pump to treat erectile dysfunction and our AMS 800™ Artificial Urinary Sphincter to treat male urinary incontinence,\n•\nGreenLight XPS™ Laser System and Rezūm™ Systems for treatment of BPH and \n•\nSpaceOAR™ Hydrogel Systems which help reduce side effects that men may experience after receiving radiotherapy to treat prostate cancer, together with our SpaceOAR VUE™ Hydrogel, providing clinicians with enhanced product visualization.\nIn the fourth quarter of 2024, we completed the acquisition of Axonics, Inc. (Axonics), a publicly traded medical technology company primarily focused on the development and commercialization of devices to treat urinary and bowel dysfunction. The Axonics product portfolio includes the Axonics R20™ and Axonics F15™ Systems used to deliver sacral neuromodulation (SNM) therapy for the treatment of over-active bladder and fecal incontinence. \nNeuromodulation\nOur Neuromodulation business unit develops and manufactures devices to treat various neurological movement disorders and manage chronic pain. Our product offerings include the following:\n•\nWaveWriter Alpha™\n \nSpinal Cord Stimulator (SCS) System, designed to provide improved pain relief to a wide range of patients who suffer from chronic pain, with proprietary features such as Multiple Independent Current Control, our Illumina 3D™ Proprietary Programming Software and FAST™ Therapy for profound parathesia-free pain relief in minutes, used by physicians to target specific areas of pain and customize stimulation of nerve fibers more precisely,\n•\nour G4™ Generator and consumable portfolio in Radiofrequency Ablation (RFA) for pain management used by physicians to treat patients with chronic pain,\n•\nSuperion™ Indirect Decompression Systems, minimally-invasive devices used to improve physical function and reduce pain in patients with moderate lumbar spinal stenosis (LSS),\n•\nour Intracept™ Intraosseous Nerve Ablation System, the only FDA-cleared system to treat vertebrogenic pain, a form of chronic low back pain and\n•\nVercise Genus™ Deep Brain Stimulation (DBS) System for the treatment of Parkinson's disease, tremor and intractable primary and secondary dystonia, a neurological movement disorder characterized by involuntary muscle contractions, utilizing Stimview™ XT, our proprietary DBS visualization software developed in collaboration with Brainlab AG, providing clinicians with real-time, 3D visualization and stimulation of brain anatomy.\n4\nIn the first quarter of 2024, we received FDA approval for an expanded indication of the WaveWriter™ SCS Systems for the treatment of chronic low back and leg pain in people who have not had prior back surgery.\nCardiovascular\nCardiology\nInterventional Cardiology Therapies (ICTx)\nOur Interventional Cardiology Therapies business unit develops and manufactures technologies for diagnosing and treating coronary artery disease and aortic valve conditions. Our product offerings include the following:\n•\nOptiCross™ Intravascular Ultrasound (IVUS) Imaging Catheters,\n•\niLab™ Ultrasound Imaging Systems with Polaris Software, designed to enhance the diagnosis and treatment of blocked vessels and other heart disorders, compatible with our full line of imaging catheters,\n•\nAVVIGO™+ Multi-Modality Guidance System, incorporating high-definition IVUS all in a mobile or integrated platform, \n•\nROTAPRO™ Rotational Atherectomy Systems, designed to treat coronary calcification in lesions by regulating the flow of air to the advancer, controlling burr rotation speed, and also monitoring and displaying burr rotation speed and rotational atherectomy procedural time,\n•\nSYNERGY™, SYNERGY MEGATRON™ and SYNERGY™ XD Everolimus-Eluting Platinum Chromium Coronary Stent Systems, featuring an ultra-thin abluminal (outer) bioabsorbable polymer coating,\n•\nSafari2™ Pre-Shaped Guidewires, intended to facilitate the introduction and placement of interventional devices within the heart,\n•\nWOLVERINE™ Coronary Cutting Balloon™, a cutting balloon angioplasty device with a unique mechanism of action that enables precise vessel preparation across a wide range of resistant lesions,\n•\nAGENT™ Drug-Coated Balloon, which is designed to provide a targeted, therapeutic dose of anti-proliferative paclitaxel to the coronary lesion and minimize downstream particulates, \n•\nACURATE \nneo2\n™ and ACURATE Prime™ Aortic Valve Systems for use in transcatheter aortic valve replacement (TAVR) procedures and \n•\nSENTINEL™ Cerebral Embolic Protection Systems, used to reduce the risk of stroke in TAVR procedures and is clinically proven to decrease cerebral embolization and its associated neurological effects.\nIn the first quarter of 2024, we received FDA approval of the AGENT™ Drug-Coated Balloon, the first drug-coated coronary balloon in the U.S., which is indicated to treat in-stent restenosis in patients with coronary artery disease and in the second quarter of 2024, initiated the U.S. launch.\nIn addition, in the third quarter of 2024, we received CE Mark and initiated the European launch of the ACURATE™ Prime™ Aortic Valve System, the company's next-generation transcatheter aortic valve replacement technology designed to treat severe aortic stenosis in patients across all surgical risk levels while also expanding the treatment range to patients with a larger anatomy.\nWatchman\nOur WATCHMAN FLX™ and WATCHMAN FLX™ Pro Left Atrial Appendage Closure (LAAC) Devices are designed to close the left atrial appendage in patients with non-valvular atrial fibrillation who are at risk for ischemic stroke and eligible for anticoagulation therapy. WATCHMAN™ is the first device to offer a non-pharmacologic alternative to oral anti-coagulants that has been studied in a randomized clinical trial and is the leading device in percutaneous LAAC globally. In the first quarter of 2024, we received FDA clearance and initiated the U.S. launch of the WATCHMAN TruSteer™ Access System, a steerable sheath designed to improve implant success of the WATCHMAN FLX™ Pro and WATCHMAN FLX™ LAAC Devices.\nCardiac Rhythm Management\nOur Cardiac Rhythm Management (CRM) business unit develops and manufactures a variety of implantable devices that monitor the heart and deliver electricity to treat cardiac abnormalities. Our product offerings include the following: \n5\n•\nthe RESONATE™ family of implantable cardioverter defibrillators (ICD) and implantable cardiac resynchronization therapy defibrillators (CRT-D), including our proprietary HeartLogic™ Heart Failure (HF) Diagnostic and SmartCRT™ Technology with Multisite pacing in CRT-D, \n•\nEMBLEM™ MRI S-ICD Systems, the world's first commercially available subcutaneous implantable cardiac defibrillators (S-ICD), which provides physicians the ability to treat patients who are at risk for sudden cardiac arrest without touching the heart,\n•\nACCOLADE™ family of pacemakers and implantable cardiac resynchronization therapy pacemakers (CRT-P),\n•\nACUITY™ X4 Quadripolar LV Leads, RELIANCE™ family of ICD Leads and our INGEVITY™ Pacing Leads,\n•\nLATITUDE™ Remote Patient Management Systems, which allow for more frequent monitoring and better guided treatment decisions by enabling physicians to monitor implantable system performance remotely,\n•\nLUX-Dx™ II+™ Insertable Cardiac Monitor (ICM) System, a long-term diagnostic device implanted in patients to detect arrhythmias associated with conditions such as atrial fibrillation (AF), cryptogenic stroke and syncope and \n•\nBodyGuardian™ Remote Cardiac Monitoring Systems provide a full range of mobile health solutions and remote monitoring services, ranging from ambulatory cardiac monitors – including short and long-term holter monitors – to cardiac event monitors and mobile cardiac telemetry.\nIn the third quarter of 2024, we received CE Mark for the LUX-Dx II/II+™ ICM system for long-term monitoring of arrhythmias. In addition, in the third quarter of 2024, we received FDA approval to expand the indication for the current-generation INGEVITY™+ Pacing Leads to include conduction system pacing and sensing of the left bundle branch area of the heart when connected to a single-or dual-chamber pacemaker.\nElectrophysiology\nOur Electrophysiology business unit develops and manufactures less-invasive medical technologies used in the diagnosis and treatment of rate and rhythm disorders of the heart, including a broad portfolio of therapeutic and diagnostic catheters and a variety of equipment used in the Electrophysiology lab. Our product offerings include the following:\n•\nFARAPULSE™ Pulsed Field Ablation (PFA) System for the treatment of AF,\n•\nPOLARx™ Cryoablation Systems for the treatment of AF,\n•\nVersaCross Connect™ Access Solutions for our WATCHMAN FXD Curve™ Sheath, Polarsheath™ and Faradrive™ Steerable Sheath providing safe and efficient access to the left side of the heart,\n•\nOPAL HDx™ Mapping System, catheter-based, 3-D cardiac mapping and navigation solutions designed to help diagnose and guide treatment of a variety of arrhythmias,\n•\na portfolio of radiofrequency (RF) cardiac ablation catheters, including our INTELLANAV STABLEPOINT™ catheter, which also includes DIRECTSENSE™ Software for monitoring RF energy during ablations and\n•\nIntellaMap Orion™ Mapping Catheters, for use with our OPAL HDx™ Mapping System to provide high-density, high-resolution maps of the heart.\nIn the first quarter of 2024, we commenced the U.S. launch of the FARAPULSE™ PFA System. We received National Medical Products Administration (NMPA) approval in China and Pharmaceuticals and Medical Device Agency (PMDA) approval in Japan in the second and third quarter of 2024, respectively. In addition, in the third quarter of 2024, we received FDA approval for the navigation-enabled FARAWAVE™ NAV Ablation Catheter for the treatment of paroxysmal AF and FDA 510(k) clearance for the new FARAVIEW™ Software, which combine to provide visualization for cardiac ablation procedures with the OPAL HDx™ Mapping System.\nSince the launch of the FARAPULSE™ PFA System, we have observed rapid conversion from legacy treatment modalities to PFA. It is now the predominant component of our Electrophysiology business unit and revenue.\nPeripheral Interventions\nOur Peripheral Interventions business unit develops and manufactures products to diagnose and treat peripheral arterial and venous diseases, as well as products to diagnose, treat and ease various forms of cancer. Our broad peripheral portfolio includes stent systems, balloon catheters, guidewires, atherectomy and thrombectomy systems, embolization devices, radioactive microspheres, radiofrequency and cryotherapy ablation systems, microcatheters, drainage catheters and transcarotid artery revascularization. \n6\nOur peripheral arterial product offerings include:\n•\nEluvia™ Drug Eluting Vascular Stent Systems, innovative stents built on the Innova stent platform, designed to deliver a sustained dosage of paclitaxel during the time when restenosis is most likely to occur, in addition to the Eluvia™ line extension, the longest-length stent available for treatment of patients with peripheral artery disease (PAD) in the superficial femoral artery,\n•\nMustang™, Coyote™ and Sterling™ PTA Balloon Catheters designed for a wide variety of peripheral angioplasty procedures and\n•\nRanger™ Drug-Coated Balloons, innovative balloons built on the Sterling balloon platform, featuring a low-dose of paclitaxel. \nOur venous disease product offerings include the following:\n•\nAngioJet™ Thrombectomy Systems, used in endovascular procedures to remove blood clots from blocked arteries and veins and our AngioJet\n \nZelante DVT™\n \nThrombectomy Catheters to treat deep vein thrombosis,\n•\nEKOS™ Ultrasound Assisted Thrombolysis systems used to treat pulmonary embolisms and\n•\nVarithena™ Polidocanol Injectable Foam used to improve the symptoms of superficial venous incompetence and the appearance of visible varicosities.\nOur interventional oncology and embolization product offerings include the following:\n•\nTheraSphere™ Y-90 radioactive glass microspheres used in the treatment of hepatocellular carcinoma (HCC), the most common type of liver cancer, \n•\nRenegade™ HI-FLO™ Microcatheter and Fathom™ Guidewire System and Interlock™ - 35 Fibered IDC™ and Interlock™ - 18 Fibered IDC™ Occlusion System for peripheral embolization,\n•\nEMBOLD™ Detachable Coil System, used for arterial and venous embolizations in the peripheral vasculature and\n•\nICEFX™ and Visual ICE™ Cryoablation Systems for destruction of tissue, using image-guided needles to enable cryoablation visualization for optimal tumor coverage\n.\nIn the third quarter of 2024, we completed our acquisition of Silk Road Medical, Inc. (Silk Road Medical), a publicly traded medical device company that has developed an innovative platform of products to prevent stroke in patients with carotid artery disease through a minimally-invasive procedure called transcarotid artery revascularization.\nMarkets\nCompetition\nWe encounter significant competition across our product lines and in each market in which we sell our products and solutions, some from companies that may have greater financial, sales and marketing resources than we do. Our primary competitors include large manufacturers with multiple lines of business and competing products, as well as a wide range of medical device companies that sell a single or limited number of competitive products or participate in only a specific market segment. In certain countries, and particularly in China, we also face competition from domestic medical device companies that may benefit from their status as local suppliers. We also face competition from non-medical device companies, which may offer alternative therapies for disease states that could also be treated using our products, or from companies offering technologies that could augment or replace procedures using our products. \nWe believe that our products and solutions compete primarily on their ability to deliver both differentiated clinical and economic outcomes for our customers by enabling physicians to perform diagnostic and therapeutic procedures safely and effectively often in a less-invasive and cost effective manner. We also compete on ease of use, comparative effectiveness, reliability and physician familiarity. In the current environment of managed care, with economically motivated buyers, consolidation among health care providers, increasing prevalence and importance of regional and national tenders, increased competition and declining reimbursement rates, we are also required to compete on the basis of price, value, reliability and efficiency. We recognize that our continued competitive success will depend upon our ability to: \n•\noffer products and solutions that provide differentiated clinical and economic outcomes,\n•\ncreate or acquire innovative, scientifically advanced technologies,\n•\napply our technology and solutions cost-effectively and with superior quality across product lines and markets,\n•\ndevelop or acquire proprietary products and solutions,\n•\nattract and retain qualified personnel, \n7\n•\nobtain patent or other protection for our products,\n•\nobtain required regulatory and reimbursement approvals,\n•\ncontinually provide quality products and enhance our quality systems and\n•\nsupply sufficient inventory at competitive prices to meet customer demand.\nResearch and Development \nOur investment in research and development is critical to driving our future growth. Our investment in research and development supports the following:\n•\ninternal research and development programs, regulatory design and clinical science, as well as other programs obtained through our strategic acquisitions and alliances and\n•\nengineering efforts that incorporate customer feedback into continuous improvement efforts for currently marketed and next-generation products.\nWe have directed our development efforts toward innovative technologies designed to expand current markets or enter adjacent markets. We continue to transform how we conduct research and development by identifying best practices, driving efficiencies and optimizing our cost structure, which we believe will enable increased development activity and faster concept-to-market timelines. Focused, cross-functional teams take a formal approach to new product design and development, helping us to manufacture and offer innovative products consistently and efficiently. Involving cross-functional teams early in the process is the cornerstone of our product development cycle. We believe this collaboration allows our teams to concentrate resources on the most viable and clinically relevant new products and technologies and to maximize cost and time savings as we bring them to market.\nIn addition to internal development, we work with leading research institutions, universities and clinicians around the world to develop, evaluate and clinically test our products. We continue to expand our collaborations to include research and development teams in our emerging market countries; these teams will focus on both global and local market requirements at a lower cost of development. We believe that these efforts will play a significant role in our future success.\nMarketing and Sales\nWe market our products and solutions to hospitals, clinics, outpatient facilities and medical offices in 127 countries worldwide. In addition, large group purchasing organizations, hospital networks and other buying groups are important to our business and represent a substantial portion of our net sales. Each of our businesses maintains dedicated sales forces and marketing teams focused on physicians who specialize in the diagnosis and treatment of different medical conditions, as well as on key hospital service line administrators. \nThe majority of our net sales are derived from countries in which we have direct sales organizations. We also have a network of distributors and dealers who offer our products in certain countries and markets. We expect to continue to leverage our infrastructure in markets where commercially appropriate and use third party distributors in those markets where it is not economical or strategic to establish or maintain a direct presence. \nResources\nManufacturing and Raw Materials\nWe are focused on continuously improving our supply chain effectiveness, strengthening our manufacturing processes and increasing operational efficiencies within our organization worldwide. In doing so, we seek to focus our internal resources on the development and commercial launch of new products and the enhancement of existing products. We also drive continuous improvement in product quality through process controls and validations, supplier and distribution controls and training and tools for our operations team. In addition, we remain focused on examining our operations and general business activities to enhance our operational effectiveness by identifying cost-improvement opportunities. \nWe remain committed to maintaining appropriate investments to ensure supply chain stability. We have an ongoing supplier resiliency program which identifies and mitigates risk and have taken measures to mitigate the impact of challenges within the global supply chain in recent years. We consistently monitor our inventory levels, manufacturing, sterilization and distribution capabilities and partnerships and maintain recovery plans to address potential disruptions. Many components used in the manufacturing of our products are readily fabricated from commonly available raw materials or off-the-shelf items available from multiple supply sources; however, certain items are custom made to meet our specifications. \n8\nOn an on-going basis, we track supplier status and inventory in risk areas and take action to prevent shortages, monitoring safety stock levels and building up product supplies as warranted, and mitigating risk of technology and material shortages by identifying new vendors.\nPredictability in the supply of certain raw materials and components used in the manufacturing of our products has improved but continues to be a risk for certain materials and vendors. While we continue to believe we will have access to the raw materials and components that we need, these supply chain dynamics could result in increased costs to us or an inability to fully meet customer demand for certain of our products. \nProprietary Rights and Patent Litigation\nWe rely on a combination of patents, trademarks, trade secrets and other forms of intellectual property to protect our proprietary rights. We generally file patent applications in the U.S. and other countries where patent protection for our technology is appropriate and available. We hold patents worldwide that cover various aspects of our technology. In addition, we hold exclusive and non-exclusive licenses to a variety of third-party technologies covered by patents and patent applications. In the aggregate, these intellectual property assets and licenses are of material importance to our business; however, we believe that no single patent, trade secret, trademark, intellectual property asset or license is material in relation to our business as a whole.\nWe rely on non-disclosure and non-competition agreements with employees, consultants and other parties to protect, in part, trade secrets and other proprietary technology. There has been substantial litigation regarding patent and other intellectual property rights in the medical device industry, particularly in the areas in which we compete. We continue to defend ourselves against claims and legal actions alleging infringement of the patent rights of others. Additionally, we may find it necessary to initiate litigation to enforce our patent rights, to protect our trade secrets or know-how and to determine the scope and validity of the proprietary rights of others. Accordingly, we may seek to settle some or all of our pending litigation, particularly to manage risk over time. Settlement may include cross licensing of the patents that are the subject of the litigation as well as our other intellectual property and may involve monetary payments to or from third parties. \nWe maintain insurance policies providing limited coverage against securities claims. We are substantially self-insured with respect to product liability claims and fully self-insured with respect to intellectual property infringement claims. The absence of significant third-party insurance coverage increases our potential exposure to unanticipated claims or adverse decisions. See \nNote I – Commitments and Contingencies\n to our 2024 consolidated financial statements included in Item 8. Financial Statements and Supplementary Data of this Annual Report on Form 10-K for a discussion of intellectual property, product liability and other litigation and proceedings in which we are involved. \nRegulatory Environment\nMedical Device Regulatory Approvals\nThe medical devices that we manufacture, market and commercialize are subject to regulation by numerous worldwide regulatory bodies, including the FDA and comparable international regulatory agencies. These agencies require manufacturers of medical devices to comply with applicable laws and regulations governing development, testing, manufacturing, labeling, marketing and distribution. Medical devices are also generally subject to varying levels of regulatory control based on risk level of the device. \nIn the U.S., authorization to distribute a new device can generally be met in one of two ways. The first process requires that a premarket notification (510(k)) be made to the FDA to demonstrate that the device is as safe and effective as, or substantially equivalent to, a legally marketed device (the “predicate” device). Applicants must submit performance data to establish substantial equivalence. In some instances, data from human clinical trials must also be submitted in support of a 510(k) premarket notification. If so, these data must be collected in a manner that conforms to the applicable Investigational Device Exemption (IDE) regulations. The FDA must issue a decision finding substantial equivalence before commercial distribution can occur. Changes to cleared devices that could not significantly affect the safety or effectiveness of the device can generally be made without additional 510(k) premarket notifications; otherwise, a new 510(k) is required.\nThe second process requires the submission of a premarket approval (PMA) application to the FDA to demonstrate that the device is safe and effective for its intended use. This approval process applies to most Class III devices and generally requires clinical data to support the safety and effectiveness of the device, obtained in adherence with IDE requirements. The FDA will approve the PMA application if it finds that there is a reasonable assurance that the device is safe and effective for its intended purpose and that the proposed manufacturing is in compliance with the Quality System Regulation (QSR). For novel \n9\ntechnologies, the FDA may seek input from an advisory panel of medical experts and seek their views on the safety, effectiveness and benefit-risk of the device. The PMA process is generally more detailed, lengthier and more expensive than the 510(k) process.\nIn the European Union (EU), we are required to comply with the Medical Device Regulation (MDR or EU MDR) effective May 2021, which superseded the existing Medical Device and Active Implantable Medical Device Directives. Medical devices that have a valid CE Certificate to the Directives issued before May 2021 can continue to be sold during the applicable transition period or until the CE Certificate expires, whichever comes first, providing there are no significant changes to the design or intended use. The CE Mark, which is required to sell medical devices in the EU is affixed following a Conformity Assessment and either approval from the appointed independent Notified Body or through self-certification by the manufacturer. The selected pathway to CE marking is based on device risk classification. CE marking indicates conformity to the applicable General Safety and Performance Requirements (GSPRs) for the MDR. The MDR changes multiple aspects of the regulatory framework for CE marking, such as increased clinical evidence requirements, changes to labelling, and new requirements, including Unique Device Identification (UDI), and many new post-market reporting obligations. MDR also modifies and increases the compliance requirements for the medical device industry and has required significant investment and will continue to require ongoing investment over the next few years to transition all products. The CE mark continues to be a prerequisite for successful registration in many other global geographies.\n \nIn addition,\n \nother EU countries continue to impose significant local registration requirements despite the implementation of MDR, and the United Kingdom has introduced new requirements following its exit from the EU.\nWe are also required to comply with the regulations of every other country where we commercialize products before we can launch or maintain new products on the market, including regulations that have been introduced in many countries in the Middle East and Southeast Asia that previously did not have medical device regulations, or had minimal regulations. In China, we are required to comply with NMPA regulations. In Japan, we are required to comply with Japan’s Ministry of Health, Labor and Welfare (MHLW) regulations. In conjunction with the MHLW, the Pharmaceutical and Medical Device Agency is an independent agency that is responsible for reviewing drug and medical device applications and works with the MHLW to assess new product safety, develop comprehensive regulations, and monitor post-market safety.\nThe FDA and other worldwide regulatory agencies and competent authorities actively monitor compliance to local laws and regulations through review and inspection of design and manufacturing practices, record-keeping, reporting of adverse events, labeling and promotional practices. The FDA can ban certain medical devices, detain or seize adulterated or misbranded medical devices, order recall or market withdrawal of these devices and require notification of health professionals and others with regard to medical devices that present unreasonable risks of substantial harm to the public health. The FDA may also enjoin and restrain a company for certain violations of the Food, Drug and Cosmetic Act and the Safe Medical Devices Act, pertaining to medical devices, or initiate action for criminal prosecution of such violations. Regulatory agencies and authorities in the countries where we do business can halt production in or distribution within their respective country or otherwise take action in accordance with local laws and regulations.\nInternational sales of medical devices manufactured in the U.S. that are not approved by the FDA for use in the U.S., or that are banned or deviate from lawful performance standards, are subject to FDA export requirements. Additionally, exported devices are subject to the regulatory requirements of each country to which the device is exported.\nOur quality system is designed to enable us to satisfy various international quality system regulations, including those of the FDA with respect to products sold in the U.S. The International Standards Organization (ISO) established the ISO 13485 quality system standard, which includes requirements for an implemented quality system that applies to component quality, supplier control, product design and manufacturing operations. All of our medical device manufacturing facilities and key distribution sites are certified under the ISO 13485 quality system standard.\nHealth Care Policies and Reimbursement\nPolitical, economic, technological and regulatory influences around the world continue to subject the health care industry to potential fundamental changes that could substantially affect our results of operations. We maintain a global Government Affairs presence, headquartered in Washington, D.C., to actively monitor and advocate on myriad legislation and policies that may potentially impact us, both on a domestic and an international front. The Government Affairs office works closely with members of Congress and committee staff, the White House and administration offices, state governors, legislatures and regulatory agencies, embassies and global governments on issues affecting our business. The Government Affairs office also \n10\nadvocates for public policy that benefits our employees and the patients we serve and supports the communities in which we live. \nOur products are purchased principally by hospitals, physicians and other health care providers around the world that typically bill various third-party payers, including government programs (e.g., Medicare and Medicaid in the U.S.) and private insurance payers, for the items and services provided to their patients. Government and private sector initiatives related to limiting the growth of health care costs (including price regulation), coverage and payment policies, comparative effectiveness reviews of therapies, technology assessments, price transparency and health care delivery and payment structure reforms, are continuing in many countries where we do business. We believe that these changes are causing the marketplace to place increased emphasis on the delivery of treatments that can reduce costs, improve efficiencies and/or increase patient access. Although we believe our products and technologies generate favorable clinical outcomes, value and cost efficiency, while also being less invasive than alternatives, the resources necessary to demonstrate value to our customers, patients, payers and other stakeholders are significant and new therapies may take significantly longer periods of time to gain widespread adoption.\nImplementation of cost containment initiatives and health care reforms in significant markets such as the U.S., China, Australia, and other markets may limit the price of, or the level at which reimbursement is provided for, our products or procedures using our products, which in turn may make it less likely that a hospital or physician will select our products to treat patients.\nEnvironmental Regulation and Management\nWe are subject to various environmental laws, directives and regulations both in the U.S. and abroad. Our operations involve the use of substances regulated under environmental laws, primarily in manufacturing and sterilization processes. We are focused on continuous improvement in environmental metrics with a goal of reducing pollution, minimizing depletion of natural resources and reducing our overall environmental footprint. We have obtained ISO14001:2015, Environmental Management Standard certification for 18 of our key locations and ISO50001, Energy Management Standard certification for 13 of our key locations. Specifically, we are working to optimize energy and resource usage, ultimately reducing greenhouse gas emissions and waste.\nHuman Capital\nAt Boston Scientific, our work is guided by core values and behaviors that define our culture and empower our employees, including Caring, Diversity, Global Collaboration, High Performance, Meaningful Innovation and Winning Spirit. As of December 31, 2024, we had approximately 53,000 employees, of which approximately 60 percent were outside the U.S. We believe the collective talent of our employees and our shared corporate culture, values and behaviors give us a competitive advantage.\nAttracting, developing and retaining talented employees are key parts of our strategy and are critical to our success. We strive to do this by fostering a diverse, equitable and inclusive workplace, providing competitive pay and benefits and flexible work conditions, offering ongoing employee growth and development opportunities and cultivating a culture that prioritizes employee health, safety and well-being. \nWorkforce Development\nWe do our best work to advance health care when we have a diverse range of perspectives and experience on our team. Innovation thrives in a culture of engagement and inclusion. The society in which we live and the customers and patients we serve are diverse and we aim for our employees at all levels of the organization to reflect this diversity. In recent years, we have made steady progress to improve the diversity of our workforce. \nWe continue to focus on improving workforce development through intentional actions to drive meaningful change. We listen to our employees and use that feedback to complement and expand our existing programs to emphasize initiatives aimed at developing our pipeline of talent and fostering an inclusive workplace for all. Additionally, our Executive Committee and our Board of Directors oversee our policies and strategies related to diversity and inclusion, employee engagement, talent recruitment and development, pay equity and company culture.\nIn addition, our ten Employee Resource Groups (ERGs) are at the heart of our inclusion strategy. ERGs are voluntary, company sponsored employee groups open to all employees that foster and celebrate our diverse workforce and inclusive work environment. They provide forums for us to learn from one another, celebrate our uniqueness and develop inclusive leadership skills. We support each ERG by designating global and local executive sponsors and providing financial resources. Our ERG chapters around the world collaborate across the business at all levels and are powerful drivers of change in the Company.\n11\nAdditionally, our approach to supplier selection involves building inclusive practices throughout the Boston Scientific supplier network. We are committed to the sustained support of a broad spectrum of businesses that share our dedication to improving the quality of patient care.\nCompensation and Benefits\nWe offer competitive, performance-based compensation programs, recognizing that employee well-being, safety, culture, engagement and recognition are all critical to a healthy work environment and productive workforce. We offer programs that acknowledge, respect and support an individual’s life and work choices. Our holistic programs are guided by overall workforce health, focusing on physical, financial and emotional well-being as well as a healthy work environment. We believe that investing in employee well-being leads to improved performance for the individual and the organization. \nAs part of our broader rewards portfolio, we offer competitive pay and benefits that are flexible and affordable to meet the individual needs of our employees. In addition to cash-based salaries, our rewards portfolio includes cash bonus programs, sales incentives, stock awards, recognition awards, health insurance, paid time off and family leave, retirement savings plans, childcare and employee assistance programs that encourage overall well-being, including help with finances, inclusive family planning and support, elder/childcare, legal support and mental health resources.\nEqual pay for equal work is rooted in our values and foundational to fostering an inclusive environment. Pay equity is an important part of our long-standing global compensation planning practices. Sustaining pay equity requires constant measurement and attention, so we regularly conduct comprehensive audits, internal and external analyses and company-wide benchmarking of salaries to identify and mitigate disparities. In addition, we periodically contract with an independent, third party to assess pay equity across all positions. Our most recent pay equity study, completed in 2023, reported no statistically significant pay disparity for more than 99 percent of our employees across gender globally and for multicultural talent in the U.S. and Puerto Rico. We continue to educate and train our people, update policies and expand benefits to decrease bias, ensure our employee base represents the patients, health systems and communities we serve, and foster a culture where all employees feel valued and included.\nEmployee Health and Safety\nWe take a global approach to prioritizing and monitoring employee health and safety and we strive to foster a safety-oriented culture in all of our offices and facilities. We set health and safety goals which measure the number of injuries per 100 employees for the global organization. Our Employee Health & Safety Global and Regional Councils review performance monthly to discuss trends and risks, as well as opportunities for improvement. We have obtained ISO 45001:2018 Occupational Health and Safety Management System at 17 of our key global locations. This is a globally recognized standard for employee Occupational Health and Safety, established by the International Standards Organization, which provides a voluntary framework to identify key occupational health and safety aspects associated with our business helping to deliver continuous improvement. We have established a company-wide safety goal of 0.25 or fewer injuries per 100 employees by 2030, cutting our year-over-year incident rate by approximately 50 percent from a base year of 2019. As of December 31, 2024, we have achieved a safety level of 0.36 per 100 employees.\nEmployee Growth and Development\nDeveloping our people professionally is one of the most important things we do. We have robust succession planning to ensure our future leaders are ready to assume roles as they become available. At every level of the Company, employees have access to training and tools they can use to advance their skills and expertise and create greater possibilities for their careers. We offer professional and technical courses, including on-the-job training, skills-based learning, mentoring opportunities and leadership development programs for all employees.\nEmployee Engagement\nWe seek ongoing feedback from our employees to better understand what we are doing well and, conversely, how we can improve their experience. In addition to encouraging ongoing communication and feedback between employees and their managers, we conduct periodic employee engagement surveys to ensure all employees have an opportunity to share their insights and we take appropriate action in response.\n12\nCommunity Outreach\nWe are united by a goal to make a difference in the lives of the over 44 million patients we serve annually. The Boston Scientific Caring value guides us in the work we do each day including how we invest in the well-being of communities.\n \nWe focus on ensuring our employees drive meaningful, long-lasting change in our communities. Our community work connects the talents, resources and skills of our employees to charitable organizations that are cultivating healthier communities across the globe. In 2024, we focused on providing aid to those impacted by natural and humanitarian disasters and addressing the basic needs of underserved populations in communities where we live and work. Our global community programs empower employees to participate in and influence the way we care for local communities through volunteerism and personal donations. Many employees choose to support their communities and causes they are passionate about through the use of the Employee Matching Gifts program.\nAligned with the Boston Scientific mission to improve patient lives, we also collaborate with non-profit community organizations to decrease health disparities and reduce the risk for chronic disease for the underserved. We provide grants that support education and development for health care workers and support chronic disease screenings in vulnerable communities worldwide. In 2024, we provided approximately $1 million in these grants to organizations working in the U.S., Mexico, Peru and India. We also continue our long-term Close the Gap initiative, which focuses on raising awareness and empowering health care providers to reach more patients of color, fight longstanding inequities, and address barriers to care. Through Close the Gap, hospitals and health systems are provided with zip code level data that highlight the disease prevalence and disparities occurring in their communities. The information, along with our health equity resources, allows health care administrators and providers to focus on improving care to underserved populations within their communities.\nWe are also passionate about inspiring young learners to see themselves in a Science, Technology, Engineering and Mathematics (STEM) role in the future. Employees on our global STEM teams work with underrepresented K-12 students to share their passion for STEM by providing interactive product demos, development programs, and hands-on activities for young learners in their communities. In 2024, more than 58,000 students were reached through our STEM activities and events.\nCorporate Responsibility\nOur sustainable environmental, social and governance (ESG) practices underpin all aspects of our global business. Our approach is aligned with the United Nations Sustainable Development Goals and our material topics and practices are informed by a broad range of internal and external stakeholders – locally, nationally and globally. Our employees around the world work with suppliers and other organizations that share our commitment to these practices that help address issues related to health inequity, economic disparity, climate change and environmental protection. Our ESG team works closely with subject matter experts and key advisors from across the business to implement our ESG practices and determine how we measure and share progress. \nWe also continue to focus on making measurable progress toward shaping a better future for our planet by proactively addressing our energy consumption, carbon emissions and waste management. We are focused on a “C3” strategy: Cutting energy use, Converting to renewable energy sources and Compensating with carbon offset projects where needed.\nSeasonality\nOur net sales are influenced by many factors, including product launches, acquisitions, regulatory and reimbursement approvals, patient, physician and employee holiday schedules and other macro-economic conditions. While our consolidated net sales do not reflect any significant degree of seasonality, customer purchases of our medical devices have historically been lower in the first and third quarters of the year. \nAvailable Information\nCopies of our Annual Report on Form 10-K, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K and amendments to those reports filed or furnished pursuant to Section 13(a) or 15(d) of the Securities Exchange Act of 1934, as amended (the Exchange Act), are available free of charge on our website (www.bostonscientific.com) as soon as reasonably practicable after we electronically file the material with or furnish it to the U.S. Securities and Exchange Commission (SEC). Additionally, the SEC maintains an internet site (www.sec.gov) that contains reports, proxy and information statements, and other information regarding issuers that file electronically with the SEC. Information on our website or linked to our website is not incorporated by reference into this Annual Report on Form 10-K.\n13\nSafe Harbor for Forward-Looking Statements\nCertain statements that we may make from time to time, including statements contained in this Annual Report on Form 10-K and information incorporated by reference herein, constitute “forward-looking statements” within the meaning of Section 27A of the Securities Act of 1933 and Section 21E of the Securities Exchange Act of 1934. Forward-looking statements may be identified by words like “anticipate,” “expect,” “project,” “believe,” “plan,” “estimate,” “intend,” “aim,” \"goal,\" \"target,\" \"continue,\" \"hope,\" \"may\" and similar words. These forward-looking statements are based on our beliefs, assumptions and estimates using information available to us at the time and are not intended to be guarantees of future events or performance. If our underlying assumptions turn out to be incorrect, or if certain risks or uncertainties materialize, actual results could vary materially from the expectations and projections expressed or implied by our forward-looking statements.\nThe forward-looking statements in this Annual Report on Form 10-K are based on certain risks and uncertainties, including the risk factors described in Item 1A under the heading “Risk Factors” and the specific risk factors discussed herein and in connection with forward-looking statements throughout this Annual Report on Form 10-K, which could cause actual results to vary materially from the expectations and projections expressed or implied by our forward-looking statements. These risks and uncertainties, in some cases, have affected and in the future could affect our ability to implement our business strategy and may cause actual results to differ materially from those contemplated by the statements expressed in this Annual Report on Form 10-K. As a result, readers are cautioned not to place undue reliance on any of our forward-looking statements. Risks and uncertainties that may cause such differences include, among other things: economic conditions, including the impact of foreign currency fluctuations, future U.S. and global political, competitive, reimbursement and regulatory conditions; geopolitical events; manufacturing, distribution and supply chain disruptions and cost increases; disruptions caused by cybersecurity events; disruptions caused by public health emergencies or extreme weather or other climate change-related events; labor shortages and increases in labor costs; variations in outcomes of ongoing and future clinical trials and market studies; new product introductions and the market acceptance of those products; market competition for our products; expected pricing environment; expected procedural volumes; the closing and integration of acquisitions; demographic trends; intellectual property rights; litigation; financial market conditions; the execution and effect of our restructuring program; the execution and effect of our business strategy, including our cost-savings and growth initiatives; our ability to achieve ESG goals; and future business decisions made by us and our competitors. New risks and uncertainties may arise from time to time and are difficult to predict. All of these factors are difficult or impossible to predict accurately and many of them are beyond our control. For a further list and description of these and other important risks and uncertainties that may affect our future operations, see Part I, Item 1A. Risk Factors contained within this Annual Report on Form 10-K filed with the SEC, which we may update in Part II, Item 1A. Risk Factors in subsequent Quarterly Reports on Form 10-Q that we will file hereafter. We disclaim any intention or obligation to publicly update or revise any forward-looking statement to reflect any change in our expectations or in events, conditions, or circumstances on which those expectations may be based, or that may affect the likelihood that actual results will differ from those contained in the forward-looking statements, except as required by law. This cautionary statement is applicable to all forward-looking statements contained in this Annual Report on Form 10-K.\nThe following are some of the important risk factors that could cause our actual results to differ materially from our expectations in any forward-looking statements. For further discussion of these and other risk factors, see Item 1A. Risk Factors. \nOur Business\n•\nRisks associated with uncertain domestic or international economic conditions, including those related to inflationary pressures, interest rates, monetary and tax policy, supply chain disruptions and constraints, currency devaluations or economies entering into periods of recession,\n•\nThe impact of disruptions in the supply of the materials and components used in manufacturing our products or the sterilization of our products,\n•\nLabor shortages and the impact of inflation on the cost of raw materials and wage costs,\n•\nThe impact of pandemics or other public health crises on worldwide economies, financial markets, manufacturing and distribution systems and business operations,\n•\nThe impact of natural disasters, climate change or other catastrophic events on our ability to manufacture, distribute and sell our products,\n14\n•\nThe impact of competitive offerings, value-based procurement practices, government-imposed payback provisions and changes in reimbursement practices and policies on average selling prices for our products,\n•\nThe ongoing impact on our business of physician alignment to hospitals, governmental investigations and audits of hospitals and other market and economic conditions on the overall number of procedures performed,\n•\nThe performance of, and physician and patient confidence in, our products and technologies or those of our competitors,\n•\nThe impact and outcome of ongoing and future clinical trials and market studies undertaken by us, our competitors or other third parties or perceived product performance of our or our competitors' products,\n \n•\nVariations in clinical results, reliability or product performance of our and our competitors' products, \n•\nOur ability to acquire or develop, launch and supply new or next-generation products and technologies worldwide and in line with our commercialization strategies in a timely and successful manner and with respect to our recent acquisitions,\n•\nThe effect of consolidation and competition in the markets in which we do business or plan to do business,\n•\nOur ability to achieve our projected level or mix of product sales, as some of our products are more profitable than others,\n•\nOur ability to attract and retain talent, including key personnel associated with acquisitions, and to maintain our corporate culture in a hybrid work environment,\n•\nRisks associated with changes made or expected to be made to our organizational and operational structure, pursuant to our restructuring plans as well as any further restructuring or optimization plans we may undertake in the future or any divestitures of assets or businesses, and our ability to recognize benefits and cost reductions from such actions, \n•\nThe impact of enhanced requirements to obtain and maintain regulatory approval in the U.S. and around the world, including EU MDR and the associated timing and cost of product approval, \n \n•\nThe impact of increased pressure on the availability and rate of third-party reimbursement for our products and procedures in the U.S. and around the world, including with respect to the timing and costs of creating and expanding markets for new products and technologies, \n•\nThe issuance of new or revised accounting standards by the Financial Accounting Standards Board or the Securities and Exchange Commission, and\n•\nThe impact of potential goodwill and intangible asset impairment charges on our results of operations.\nRegulatory Compliance, Litigation and Data Protection\n•\nThe impact of health care policy changes and legislative or regulatory efforts in the U.S., the EU and around the world to modify product approval or reimbursement processes, including a trend toward demonstrating clinical outcomes, comparative effectiveness and cost efficiency, as well as the impact of other health care reform legislation,\n•\nRisks associated with our regulatory compliance and quality systems and activities in the U.S., the EU and around the world, including meeting regulatory standards applicable to manufacturing and quality processes,\n•\nOur ability to minimize or avoid future field actions or FDA warning letters, or similar actions by regulatory agencies around the world, relating to our products and processes and the ongoing inherent risk of potential physician advisories related to our or our competitors' products,\n•\nThe impact of increased scrutiny of and heightened global regulatory enforcement facing the medical device industry arising from political and regulatory changes, economic pressures or otherwise, including under U.S. Anti-Kickback Statute, U.S. False Claims Act and similar laws in other jurisdictions, U.S. Foreign Corrupt Practices Act (FCPA) and similar laws in other jurisdictions, and U.S. and foreign export control, trade embargo and customs laws,\n15\n•\nThe effect of global legal, regulatory or market responses to climate change and sustainability matters, including increased compliance burdens and costs to meet regulatory obligations,\n•\nCosts and risks associated with current and future asserted litigation,\n•\nThe effect of our litigation and risk management practices, including self-insurance and compliance activities on our loss contingencies, legal provisions and cash flows,\n \n•\nThe impact of, diversion of management attention as a result of, and costs to cooperate with, litigate and/or resolve governmental investigations and our product liability, contract and other legal proceedings,\n•\nThe possibility of failure to protect our intellectual property rights and the outcome of patent litigation, and\n•\nOur ability to secure our information technology and operational technology systems that support our business operations and protect our data integrity and products from a cyber-attack, other breach or other malicious actors that may have a material adverse effect on our business, reputation or results of operations including increased risks as an indirect result of the ongoing Russia/Ukraine war and conflicts in the Middle East.\nInnovation and Certain Growth Initiatives\n•\nThe timing, size and nature of our strategic growth initiatives and market opportunities, including with respect to our internal research and development platforms and externally available research and development platforms and technologies and the ultimate cost and success of those initiatives and opportunities,\n•\nOur ability to complete planned clinical trials successfully, obtain regulatory approvals and launch new and next generation products in a timely manner consistent with cost estimates, including the successful completion of projects from in-process research and development,\n•\nOur ability to identify and prioritize our internal research and development project portfolio and our external investment portfolio on profitable net sales growth opportunities as well as to maintain the estimated timing and costs of such projects and expected revenue levels for the resulting products and technologies,\n•\nOur ability to develop, manufacture and market new products and technologies successfully and in a timely manner and the ability of our competitors and other third parties to develop products or technologies that render our products or technologies noncompetitive or obsolete, \n•\nOur ability to execute appropriate decisions to discontinue, write-down or reduce the funding of any of our research and development projects, including projects from in-process research and development from our acquisitions, in our growth adjacencies or otherwise,\n•\nOur dependence on acquisitions, alliances or investments to introduce new products or technologies and to enter new or adjacent growth markets and our ability to fund them or to fund contingent payments with respect to those acquisitions, alliances and investments, and\n•\nThe potential failure to successfully integrate, collaborate or realize the expected benefits, including cost synergies, from strategic acquisitions, alliances and investments we have consummated or may consummate in the future.\nInternational Markets\n•\nOur dependency on international net sales to achieve growth, and our ability to maintain or expand our worldwide market positions in the various markets in which we compete or seek to compete, including through investments in China and other Emerging Markets countries,\n•\nThe timing and collectability of customer payments, as well as our ability to continue factoring customer receivables where we have factoring arrangements, or to enter new factoring arrangements with favorable terms, \n16\n•\nThe impact on pricing due to national and regional tenders, including value-based procurement practices and government-imposed payback provisions,\n•\nGeopolitical and economic conditions, including civil unrest, terrorist activity, governmental changes, restrictions on the ability to transfer capital across borders, tariffs and other protectionist measures,\n•\nThe impact of the Russia/Ukraine war, conflicts in the Middle East, and tension in the Taiwan strait, and related, downstream effects thereof, including disruptions to operations or the impact of sanctions on U.S. manufacturers doing business in these regions,\n•\nProtection of our intellectual property, \n•\nOur ability to comply with established and developing U.S. and foreign legal and regulatory requirements, including FCPA, EU MDR and similar laws in other jurisdictions,\n•\nOur ability to comply with U.S. and foreign export control, trade embargo and customs laws,\n•\nThe impact of significant developments or uncertainties stemming from changes in the U.S. government following the 2024 presidential and congressional elections, including changes in U.S. trade policies, tariffs and the reaction of other countries thereto, and\n•\nThe potential effect of foreign currency fluctuations and interest rate fluctuations on our net sales, operating expenses and resulting profit margins.\nLiquidity\n•\nOur ability to generate sufficient cash flow to fund operations, capital expenditures, global expansion initiatives, any litigation settlements and judgments, share repurchases and strategic investments and acquisitions as well as maintaining our investment grade ratings and managing our debt levels and financial covenant compliance,\n•\nOur ability to access the public and private capital markets when desired and to issue debt or equity securities on terms reasonably acceptable to us,\n•\nThe unfavorable resolution of open tax matters, exposure to additional tax liabilities and the impact of changes in U.S. and international tax laws,\n•\nThe unfavorable resolution of open litigation matters, exposure to additional loss contingencies and legal provisions,\n•\nThe impact of examinations and assessments by domestic and international taxing authorities on our tax provisions, financial condition or results of operations,\n•\nThe possibility of counterparty default on our derivative financial instruments, and\n•\nOur ability to collect outstanding and future receivables and/or sell receivables under our factoring programs.\n17",
  "item7": "ITEM 7. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS \nThe following discussion and analysis provides information management believes to be relevant to understanding the financial condition and results of operations of Boston Scientific Corporation and its subsidiaries for the years ended December 31, 2024 and 2023. For a full understanding of our financial condition and results of operations, this discussion should be read in conjunction with our consolidated financial statements and accompanying notes included in Item 8. Financial Statements and Supplementary Data of this Annual Report on Form 10-K.\nFor additional information on our financial condition and results of operations for the year ended December 31, 2022, refer to Item 7. Management's Discussion and Analysis of Financial Condition and Results of Operations in our previously filed Annual Report on Form 10-K.\nExecutive Summary\nFinancial Highlights and Trends\nIn 2024, our net sales were $16.747 billion, compared to $14.240 billion in 2023. This increase of $2.507 billion, or 17.6 percent, included operational\n1\n net sales growth of 18.5 percent and the negative impact of 90 basis points from foreign currency fluctuations.\n \nOperational net sales growth included organic\n2\n net sales growth of 16.4 percent in 2024 and the positive impact of 210 basis points driven by our acquisitions and divestitures during the period for which there is less than a full period of comparable net sales. In 2023, relevant acquisitions and divestitures included our majority stake investment in Acotec Scientific Holdings Limited (Acotec) and the acquisitions of Apollo Endosurgery, Inc. (Apollo) and Relievant Medsystems, Inc. (Relievant) during the first, second and fourth quarters of 2023, respectively, as well as the divestiture of our pathology business during the second quarter of 2023. In 2024, relevant acquisitions included the endoluminal vacuum therapy portfolio of B. Braun Medical Inc. (Braun), Silk Road Medical, Inc. (Silk Road Medical) and Axonics, Inc. (Axonics) during the first, third and fourth quarters of 2024, respectively. The increase in our net sales was primarily driven by strong commercial execution across our businesses, particularly in our Electrophysiology business unit, which was led by the rapid adoption of our Farapulse™ Pulsed Field Ablation System which launched in 2024. Refer to the \nBusiness and Market Overview\n section for a discussion of our net sales by business.\n \nOur reported net income attributable to Boston Scientific common stockholders in 2024 was $1.853 billion, or $1.25 per diluted share. Our reported results for 2024 included certain charges and/or credits which are excluded by management for purposes of assessing operating performance, totaling $1.872 billion (after-tax), or $1.26 per diluted share. Excluding these items, adjusted net income attributable to Boston Scientific common stockholders\n3\n for 2024 was $3.725 billion, or $2.51 per diluted share.\nOur reported net income attributable to Boston Scientific common stockholders in 2023 was $1.570 billion, or $1.07 per diluted share. Our reported results for 2023 included certain charges and/or credits which are excluded by management for purposes of assessing operating performance, totaling $1.429 billion (after-tax), or $0.98 per diluted share. Excluding these items, adjusted net income attributable to Boston Scientific common stockholders\n3\n for 2023 was $2.999 billion, or $2.05 per diluted share.\n1\nOperational net sales growth excludes the impact of foreign currency fluctuations.\n2\nOrganic net sales growth excludes the impact of foreign currency fluctuations and net sales attributable to acquisitions and divestitures for \nwhich there are less than a full period of comparable net sales.\n3\nAdjusted measures, including operational and organic net sales growth and adjusted net income attributable to Boston Scientific common stockholders, exclude certain items required by generally accepted accounting principles in the United States (GAAP), are not prepared in accordance with GAAP and should not be considered in isolation from, or as a replacement for, the most directly comparable GAAP measure. Refer to \nAdditional Information\n for a discussion of management’s use of these non-GAAP financial measures. \n38\nThe following is a reconciliation of our results of operations prepared in accordance with GAAP to those adjusted results considered by management. Refer to \nResults of Operations\n and \nAdditional Information\n for a discussion of each reconciling item:\nYear Ended December 31, 2024\n(in millions, except per share data)\nIncome (Loss) Before Income Taxes\nIncome Tax Expense (Benefit)\nNet Income (Loss)\nPreferred Stock Dividends\nNet Income (Loss) Attributable to Noncontrolling Interests\nNet Income (Loss) Attributable to Boston Scientific Common Stockholders\nImpact per Share\nReported\n$\n2,282\n \n$\n436\n \n$\n1,846\n \n$\n—\n \n$\n(8)\n$\n1,853\n \n$\n1.25\n \nNon-GAAP adjustments:\nAmortization expense\n856 \n113 \n743 \n— \n9 \n734 \n0.49 \nGoodwill and other intangible asset impairment charges\n386 \n48 \n339 \n— \n— \n339 \n0.23 \nAcquisition/divestiture-related net charges (credits)\n403 \n28 \n375 \n— \n— \n375 \n0.25 \nRestructuring and restructuring-related net charges (credits)\n229 \n30 \n199 \n— \n— \n199 \n0.13 \nLitigation-related net charges (credits)\n— \n0 \n(0)\n— \n— \n(0)\n(0.00)\nInvestment portfolio net losses (gains) and impairments\n20 \n1 \n19 \n— \n— \n19 \n0.01 \nEuropean Union (EU) Medical device regulation (MDR) implementation costs\n52 \n7 \n45 \n— \n— \n45 \n0.03 \nDeferred tax expenses (benefits)\n— \n(165)\n165 \n— \n— \n165 \n0.11 \nDiscrete tax items\n— \n4 \n(4)\n— \n— \n(4)\n(0.00)\nAdjusted\n$\n4,229\n \n$\n502\n \n$\n3,726\n \n$\n—\n \n$\n1\n \n$\n3,725\n \n$\n2.51\n \n \nYear Ended December 31, 2023\n(in millions, except per share data)\nIncome (Loss) Before Income Taxes\nIncome Tax Expense (Benefit)\nNet Income (Loss)\nPreferred Stock Dividends\nNet Income (Loss) Attributable to Noncontrolling Interests\nNet Income (Loss) Attributable to Boston Scientific Common Stockholders\nImpact per Share\n(4)\nReported\n$\n1,985\n \n$\n393\n \n$\n1,592\n \n$\n(23)\n$\n(1)\n$\n1,570\n \n$\n1.07\n \nNon-GAAP adjustments:\nAmortization expense\n828 \n115 \n713 \n— \n4 \n709 \n0.48 \nGoodwill and other intangible asset impairment charges\n58 \n4 \n54 \n— \n— \n54 \n0.04 \nAcquisition/divestiture-related net charges (credits)\n373 \n21 \n352 \n— \n— \n352 \n0.24 \nRestructuring and restructuring-related net charges (credits)\n185 \n29 \n156 \n— \n— \n156 \n0.11 \nLitigation-related net charges (credits)\n(111)\n(23)\n(88)\n— \n— \n(88)\n(0.06)\nInvestment portfolio net losses (gains) and impairments\n21 \n(3)\n24 \n— \n— \n24 \n0.02 \nEU MDR implementation costs\n69 \n10 \n59 \n— \n— \n59 \n0.04 \nDeferred tax expenses (benefits)\n— \n(155)\n155 \n— \n— \n155 \n0.11 \nDiscrete tax items\n— \n(8)\n8 \n— \n— \n8 \n0.01 \nAdjusted\n$\n3,407\n \n$\n382\n \n$\n3,025\n \n$\n(23)\n$\n4\n \n$\n2,999\n \n$\n2.05\n \n(4)\nFor 2023, the effect of assuming the conversion of our 5.50% Mandatory Convertible Preferred Stock, Series A (MCPS) into shares of common stock was anti-dilutive, and therefore excluded from the calculation of \nNet income (loss) per common share — diluted\n (EPS). Accordingly, GAAP \nNet income (loss)\n and Adjusted net income were reduced by cumulative \nPreferred stock dividends\n, as presented in our consolidated statements of operations, for purposes of calculating GAAP \nNet income (loss) attributable to Boston Scientific common stockholders\n. On June 1, 2023, all outstanding shares of our MCPS automatically converted into shares of common stock.\n39\nBusiness and Market Overview\nThe following section describes our net sales and results of operations by reportable segment and business. For additional information on our businesses and product offerings, refer to Item 1. Business of this Annual Report on Form 10-K. \nMedSurg\nEndoscopy\nOur Endoscopy business develops and manufactures devices to diagnose and treat a broad range of gastrointestinal (GI) conditions with innovative, less-invasive technologies. Net sales of Endoscopy products of $2.687 billion represented 16 percent of our consolidated net sales in 2024. Endoscopy net sales increased $205 million, or 8.3 percent, in 2024 compared to 2023. This increase included operational net sales growth of 8.9 percent and the negative impact of 60 basis points from foreign currency fluctuations. Operational net sales growth included organic net sales growth of 8.0 percent in 2024, and the positive impact of 100 basis points from our acquisition of Apollo and the divestiture of our pathology business in the second quarter of 2023, and our acquisition of the endoluminal vacuum therapy portfolio of Braun in the first quarter of 2024. \nOrganic net sales growth was primarily driven by our endoluminal surgery franchise, our single-use imaging franchise led by our EXALT™ Model D Single-Use Duodenoscope and our biliary franchise led by our AXIOS™\n \nStent and Delivery System.\nUrology\nOur Urology business develops and manufactures devices to treat various urological conditions for both male and female anatomies, including kidney stones, benign prostatic hyperplasia (BPH), prostate cancer, erectile dysfunction and incontinence. Net sales of Urology products of $2.200 billion represented 13 percent of our consolidated net sales in 2024. Urology net sales increased $236 million, or 12.0 percent, in 2024 compared to 2023. This increase included operational net sales growth of 12.5 percent and the negative impact of 50 basis points from foreign currency fluctuations. Operational net sales growth included organic net sales growth of 9.3 percent in 2024, and the positive impact of 330 basis points from our acquisition of Axonics in the fourth quarter of 2024.\nOrganic net sales growth was primarily driven by our stone management, led by our Lumenis Pulse™ Holmium Laser Systems with MOSES™ Technology, and prosthetic urology franchises and our prostate health franchise led by our Rezūm™ Systems.\nNeuromodulation\nOur Neuromodulation business develops and manufactures devices to treat various neurological movement disorders and manage chronic pain. Net sales of Neuromodulation products of $1.106 billion represented 7 percent of our consolidated net sales in 2024. Neuromodulation net sales increased $130 million, or 13.3 percent, in 2024 compared to 2023. This increase included operational net sales growth of 13.7 percent and the negative impact of 40 basis points from foreign currency fluctuations. Operational net sales growth included organic net sales growth of 2.7 percent in 2024, and the positive impact of 1,100 basis points from our acquisition of Relievant in the fourth quarter of 2023.\nOrganic net sales growth was primarily driven by our deep brain stimulation franchise and our radiofrequency ablation portfolio.\n40\nCardiovascular\nCardiology\nOur Cardiology business develops and manufactures devices and medical technologies for diagnosing and treating a variety of diseases and abnormalities of the heart. Net sales of Cardiology products of $8.344 billion represented 50 percent of our consolidated net sales in 2024. Cardiology net sales increased $1.636 billion, or 24.4 percent in 2024 compared to 2023. This increase included operational net sales growth of 25.4 percent and the negative impact of 100 basis points from foreign currency fluctuations.\nOperational net sales growth was primarily driven by growth of our Electrophysiology business unit, led by our Farapulse™ Pulsed Field Ablation System and our access solutions portfolio, continued market penetration of Left Atrial Appendage Closure (LAAC) procedures with our WATCHMAN FLX™ LAAC Device and our WATCHMAN FLX™ Pro LAAC Device, as well as our percutaneous coronary intervention guidance franchise.\nPeripheral Interventions \nOur Peripheral Interventions business develops and manufactures products to diagnose and treat peripheral arterial and venous diseases, as well as products to diagnose, treat and ease various forms of cancer. Net sales of Peripheral Interventions products of $2.410 billion represented 14 percent of our consolidated net sales in 2024. Peripheral Interventions net sales increased $300 million, or 14.2 percent in 2024 compared to 2023. This increase included operational net sales growth of 15.5 percent and the negative impact of 120 basis points from foreign currency fluctuations. Operational net sales growth included organic net sales growth of 10.9 percent, and the positive impact of 460 basis points from our majority stake investment in Acotec which we acquired in the first quarter of 2023 and our acquisition of Silk Road Medical during the third quarter of 2024. \nOrganic net sales growth was primarily driven by our interventional oncology franchise led by our EMBOLD™ Fibered Coil and Therasphere™ Y-90 Radioactive Glass Microspheres, as well as our drug-eluting portfolio within our vascular franchise led by our Ranger™ Drug Coated Balloon.\nEmerging Markets\nAs part of our strategic imperative to drive global expansion, we are seeking to grow net sales and market share by expanding our global presence, including in Emerging Markets. Periodically, we assess our list of Emerging Markets countries, and effective January 1, 2023, modified our list to include all countries except the United States, Western and Central Europe, Japan, Australia, New Zealand and Canada.\nOur Emerging Markets' net sales represented 16 percent of our consolidated net sales in 2024 and 2023. In 2024, our Emerging Markets net sales grew 16.1 percent on a reported basis including operational net sales growth of 19.6 percent and the negative impact of 360 basis points from foreign currency fluctuations, compared to 2023. Operational net sales growth was primarily driven by growth in China, fueled by the breadth of our portfolio and focus on innovation and strong commercial execution. \nEconomic Environment\nAs a global developer, manufacturer and marketer of medical devices, our business is subject to local and international macroeconomic trends as well as geopolitical factors. While global supply chain disruptions continued to improve in 2024, we have experienced, and may continue to experience, increases in cost and limited availability of certain raw materials, components, and other inputs necessary to manufacture and distribute our products due to constraints and inflation within the global supply chain, as well as increases in wage costs and the cost and time to distribute our products. Uncertainty around inflationary pressures, interest rates, monetary policy, trade policies, foreign currency fluctuations and changes in tax laws, as well as actions by governments in response thereto, could create additional economic challenges which could negatively impact our business operations and results. Geopolitical developments, including related to various ongoing global conflicts and tensions, may create economic, supply chain, transportation, energy, and other challenges, including disruptions to business operations, which could negatively impact our business and results of operations. Further, sanctions, tariffs, or other measures that restrict international trade, as well as instability resulting from global conflicts, could negatively affect our business operations and results.\n41\nResults of Operations\nNet Sales\nThe following table provides our net sales by reportable segment and business, and the relative change in growth on a reported basis:\nYear Ended December 31,\n2024 versus 2023\n2023 versus 2022\n(in millions)\n2024\n2023\n2022\nEndoscopy\n$\n2,687 \n$\n2,482 \n$\n2,221 \n8.3%\n11.7%\nUrology\n2,200 \n1,964 \n1,773 \n12.0%\n10.8%\nNeuromodulation\n1,106 \n976 \n917 \n13.3%\n6.4%\nMedSurg\n5,993\n \n5,422\n \n4,911\n \n10.5%\n10.4%\nCardiology\n8,344 \n6,709 \n5,932 \n24.4%\n13.1%\nPeripheral Interventions\n2,410 \n2,110 \n1,899 \n14.2%\n11.1%\nCardiovascular\n10,755\n \n8,819\n \n7,831\n \n22.0%\n12.6%\n16,747 \n14,240 \n12,742 \n17.6%\n11.8%\nOther\n(1)\n— \n— \n(60)\n0.0%\n(100.0)%\nNet Sales\n$\n16,747\n \n$\n14,240\n \n$\n12,682\n \n17.6%\n12.3%\n(1)\nIn 2022, amounts reflect sales reserves established for Italian government payback provisions, not allocated to reportable segments, which are being disputed in the Italian court system.\nRefer to \nExecutive Summary \nfor further discussion of our net sales and a comparison of our 2024 and 2023 net sales.\nIn 2023, we generated net sales of $14.240 billion compared to $12.682 billion in 2022. This increase of $1.558 billion, or 12.3 percent, included operational growth of 13.1 percent and the negative impact of 80 basis points from foreign currency fluctuations. Operational net sales growth included organic net sales growth of 12.3 percent in 2023 and the positive impact of 80 basis points driven by our majority stake investment in Acotec and the acquisitions of Apollo and Relievant during the first, second and fourth quarters of 2023, respectively, as well as the divestiture of our pathology business during the second quarter of 2023 and our acquisition of Baylis Medical Company, Inc. (Baylis Medical) during the first quarter of 2022, for which there were less than a full prior period of comparable net sales. The increase in our 2023 net sales was primarily driven by acquisitions as well as the strength and diversity of our product portfolio coupled with growth in the underlying markets in which we compete and strong commercial execution. \nGross Profit\nOur gross profit was $11.490 billion in 2024 and $9.896 billion in 2023. The following is a reconciliation of our gross profit margins and a description of the drivers of the change from period to period:\nGross Profit Margin\nYear Ended December 31, 2022\n68.8%\nManufacturing and supply costs\n1.7%\nSales pricing, volume and mix\n1.9%\nNet impact of foreign currency fluctuations\n(2.2)%\nAll other, including inventory charges and other period expenses\n(0.7)%\nYear Ended December 31, 2023\n69.5%\nSales pricing, volume and mix\n0.7%\nAll other, including inventory charges and other period expenses\n(1.6)%\nYear Ended December 31, 2024\n68.6%\nThe primary factors contributing to the decrease in our gross profit margin for 2024 compared to 2023 were inventory charges, including related to the POLARx™ cryoablation system given the strong commercial adoption of our Farapulse™ Pulsed Field \n42\nAblation System, strategic manufacturing capacity investments and other period expenses, partially offset by increased sales of higher margin products.\nThe primary factors contributing to the increase in our gross profit margin for 2023 compared to 2022 were increased sales of higher margin products, as well as improvements in manufacturing, raw material and component, and freight costs, partially offset by the unfavorable impact of foreign currency and period expenses. \nEU MDR Implementation Costs \nThe EU MDR replaced the existing European Medical Devices Directive (MDD) and Active Implantable Medical Device Directive (AIMDD) regulatory frameworks, and manufacturers of medical devices were required to comply with EU MDR beginning in May 2021 for new products and by May 2024 for medical devices that have a valid CE Certificate to the Directives issued before May 2021. In 2023, updates to the legislative text of the EU MDR were adopted by the European Parliament and the Council of the European Union, including an extension of the transitional period to 2027 for certain high risk class devices and 2028 for lower risk class medical devices that have a valid CE Certificate to the Directives issued before May 2021.\nWe began our EU MDR implementation efforts in late 2019 and have incurred cumulative expenses of $408 million through December 31, 2024, which are primarily being recorded within\n Cost of product sold\n. We expect to incur total expenses of approximately $450 million to $500 million over the transition period. \nOperating Expenses\nThe following table provides a summary of our key operating expenses:\nYear Ended December 31,\n \n2024\n2023\n2022\n(in millions)\n$\n% of Net Sales\n$\n% of Net Sales\n$\n% of Net Sales\nSelling, general and administrative expenses\n$\n5,984 \n35.7 \n%\n$\n5,190 \n36.4 \n%\n$\n4,520 \n35.6 \n%\nResearch and development expenses\n1,615 \n9.6 \n%\n1,414 \n9.9 \n%\n1,323 \n10.4 \n%\nSelling, General and Administrative (SG&A) Expenses\nIn 2024, our \nSG&A expenses\n increased $794 million, or 15 percent compared to 2023 and were 70 basis points lower as a percentage of net sales. The increase in \nSG&A expenses\n was due primarily to higher selling costs driven by higher global net sales and costs to support product launches, including the Farapulse™ Pulsed Field Ablation System in our Electrophysiology business unit.\nIn 2023, our \nSG&A expenses\n increased $670 million, or 15 percent compared to 2022 and were 80 basis points higher as a percentage of net sales. The increase in \nSG&A expenses\n was primarily due to higher selling costs driven by higher global net sales, costs to support new and planned product launches, including the Farapulse™ Pulsed Field Ablation System in our Electrophysiology business unit and comparatively higher acquisition-related and restructuring-related expenses.\nResearch and Development (R&D) Expenses\nWe remain committed to advancing medical technologies and investing in meaningful research and development projects across our businesses. In 2024, our \nR&D expenses\n increased $201 million, or 14 percent compared to 2023, and were 30 basis points lower as a percentage of net sales. In 2023, our \nR&D expenses\n increased $91 million, or 7 percent compared to 2022, and were 50 basis points lower as a percentage of net sales. \nR&D expenses\n increased in both periods as a result of investments across our businesses in order to maintain a pipeline of new products that we believe will contribute to profitable sales growth. \nOther Operating Expenses\nThe following provides a summary of certain of our other operating expenses, which are excluded by management for purposes of evaluating operating performance; refer to \nAdditional Information\n for a further description.\n43\nAmortization Expense\nWe recorded \nAmortization expense\n of $856 million in 2024 and $828 million in 2023 related to intangible assets acquired in a business combination or asset acquisition, as well as internally-developed patents. In 2024, \nAmortization expense\n increased $28 million, or 3 percent, as compared to 2023. In 2023, \nAmortization expense\n increased $25 million, or 3 percent, as compared to 2022. The increase in both periods was primarily driven by the addition of amortizable intangible assets associated with acquisitions.\nIntangible Asset Impairment Charges\nWe recorded \nIntangible asset impairment charges\n of $386 million in 2024 and $58 million in 2023. The impairment charges recorded in 2024 were primarily associated with amortizable intangible assets established in connection with our acquisitions of Cryterion Medical, Inc. (Cryterion) and Devoro Medical, Inc. (Devoro), which were integrated into our Electrophysiology and Peripheral Interventions business units, respectively. Intangible assets acquired from Cryterion were impaired due to strong commercial adoption of our Farapulse™ Pulsed Field Ablation System in our Electrophysiology business unit and the resulting lower revenue projections and cannibalization of our cryoablation business. Intangible assets acquired from Devoro were impaired following management's decision to cancel the related program in the second quarter of 2024. The impairment charges recorded in 2023 were primarily associated with the cancellation of an in-process research and development (IPR&D) program due to the incremental time and cost to complete the program and bring the technology to market. Refer to \nCritical Accounting Estimates\n for a discussion of key assumptions used in our intangible asset impairment testing and future events that could have a negative impact on the recoverability of our intangible assets.\nContingent Consideration Net Expense (Benefit)\nYear Ended December 31,\n(in millions)\n2024\n2023\n2022\nNet charges (benefit)\n$\n(5)\n$\n58 \n$\n35 \nPayments for prior acquisitions following the achievement of associated milestones\n232 \n76 \n371 \nTo recognize changes in the fair value of our contingent consideration liability, we recorded a net benefit of $5 million in 2024 and net charges of $58 million in 2023. In addition, we made payments of $232 million and $76 million associated with prior acquisitions during 2024 and 2023, respectively, following the achievement of revenue-based earnouts. Refer to \nNote B – Acquisitions and Strategic Investments\n to our consolidated financial statements included in Item 8. Financial Statements and Supplementary Data of this Annual Report on Form 10-K for additional details related to our contingent consideration arrangements.\nRestructuring and Restructuring-related Net Charges \nOn February 22, 2023, our Board of Directors approved, and we committed to, a new global restructuring program (the 2023 Restructuring Plan). \nFor additional information, refer to \"2023 Restructuring Plan\" under the heading Liquidity and Capital Resources below.\nPursuant to the 2023 Restructuring Plan, we recorded the following restructuring and restructuring-related charges:\nYear Ended December 31, \n(in millions)\n2024\n2023\n2022\nRestructuring charges\n(1)\n$\n16 \n$\n69 \n$\n24 \nRestructuring-related charges\n(2)\n212 \n115 \n86 \n(1)\nThese charges are recorded in accordance with Financial Accounting Standards Board (FASB) Accounting Standards Codification (ASC) Topic 420, \nExit or Disposal Cost Obligations.\n(2)\nThese charges are primarily recorded within \nCost of products sold, SG&A Expenses\n \nand\n \nR&D Expenses\n.\nThe following table presents our restructuring reserve balance:\nAs of December 31,\n(in millions)\n2024\n2023\nRestructuring reserve balance\n$\n26 \n$\n41 \n44\nLitigation-related Net Charges (Credits)\nWe record certain legal and product liability charges, credits and costs of defense, which we consider to be unusual or infrequent and significant as \nLitigation-related net charges (credits)\n within our consolidated financial statements. We did not record any litigation-related net charges (credits) in 2024. We recorded litigation-related net credits of $111 million in 2023, primarily related to the settlement of offensive patent litigation. All other legal and product liability charges, credits and costs are recorded within \nSG&A expenses\n.\nWe continue to assess certain litigation and claims to determine the amounts, if any, that management believes will be paid as a result of such claims and litigation, and therefore, additional losses may be accrued and paid in the future, which could materially adversely impact our operating results, cash flows and/or our ability to comply with the financial covenant required by our credit arrangements. Refer to \nNote I – Commitments and Contingencies\n to our consolidated financial statements included in Item 8. Financial Statements and Supplementary Data of this Annual Report on Form 10-K for additional discussion of our material legal proceedings.\nInterest Expense \nThe following table provides a summary of our \nInterest expense \nand average borrowing rate:\nYear Ended December 31,\n2024\n2023\n2022\nInterest expense \n(in millions)\n$\n(305)\n$\n(265)\n$\n(470)\nAverage borrowing rate\n2.8 \n%\n2.8 \n%\n5.0 \n%\nInterest expense\n increased in 2024, compared to the prior year, primarily due to increased debt from the registered public offering of €2.000 billion in aggregate principal amount of euro-denominated senior notes (the 2024 Eurobonds) during the first quarter of 2024. \nInterest expense\n decreased in 2023, compared to 2022, primarily due to $194 million of charges associated with the early extinguishment of $3.275 billion of certain of our senior notes, including payment of tender premiums and the acceleration of unamortized debt issuance costs, as well as the issuance of euro-denominated senior notes during the first quarter of 2022. Our average borrowing rate remained flat in 2024 compared to 2023 and decreased in 2023 compared to 2022. Refer to \nLiquidity and Capital Resources,\n as well as\n Note E – Contractual Obligations and Commitments\n to our consolidated financial statements included in Item 8. Financial Statements and Supplementary Data of this Annual Report on Form 10-K for information regarding our debt obligations.\nOther, net\nThe following are the components of \nOther, net\n:\n \nYear Ended December 31,\n(in millions)\n2024\n2023\n2022\nInterest income\n$\n107 \n$\n22 \n$\n10 \nNet foreign currency gain (loss)\n(16)\n(41)\n(31)\nNet gains (losses) on investments\n(1)\n(79)\n(59)\n(1)\nOther income (expense), net\n(29)\n(14)\n(16)\n \n$\n(16)\n$\n(93)\n$\n(38)\n(1)\nNet gains (losses) on investments include investment portfolio net losses (gains) and impairments as well as the impact of recording our share of the earnings or losses of equity method investees.\nInterest income increased during 2024, compared to prior periods, primarily due to higher average cash balances invested in each period as a result of the registered public offering of the 2024 Eurobonds during the first quarter of 2024. Net proceeds from the offering were primarily used to fund a portion of the purchase price of our Axonics acquisition which was initially expected to close in the first half of 2024 and ultimately closed in the fourth quarter of 2024.\n45\nTax Rate\nThe following table provides a reconciliation of our reported tax rate to the rate from continuing operations:\nYear Ended December 31,\n \n2024\n2023\n2022\nReported tax rate\n19.1 \n%\n19.8 \n%\n38.9 \n%\nImpact of certain receipts/charges\n(1)\n(1.1)\n%\n(0.2)\n%\n(19.1)\n%\nRate from continuing operations\n18.0 \n%\n19.6 \n%\n19.8 \n%\n(1)\n    These receipts/charges are taxed at different rates than our rate from continuing operations.\nOur reported tax rate is affected by recurring items such as the amount of our earnings subject to differing tax rates in foreign jurisdictions and the impact of certain receipts and charges that are taxed at rates that differ from our rate from continuing operations.\nIn 2024, the principal reasons for the difference between the rate from continuing operations and our reported tax rate relate to certain acquisition-related net charges and impairment charges as well as certain discrete tax benefits primarily related to stock-based compensation and changes in valuation allowance.\nIn 2023, the principal reasons for the difference between the rate from continuing operations and our reported tax rate relate to receipts for litigation, certain acquisition-related net charges and restructuring-related net charges as well as certain discrete tax benefits primarily related to unrecognized tax benefits for the conclusion of the 2017-2018 IRS audit, provision-to-return adjustments, and stock-based compensation.\nIn 2022, the principal reasons for the difference between the rate from continuing operations and our reported tax rate relate to litigation-related net charges, acquisition-related net charges, impairment charges, and debt extinguishment net charges as well as certain discrete tax benefits primarily related to stock-based compensation, changes in valuation allowance as well as charges for unrecognized tax benefits.\nEffective January 1, 2024, many countries where we do business adopted a global minimum effective tax rate of 15% based on the Pillar Two framework issued by the Organization for Economic Cooperation and Development (OECD). Other countries where we do business are also considering adopting the framework or are in various stages of enacting the framework into their country’s laws. The impact of the Pillar Two global minimum tax on our 2024 tax rate from continuing operations was immaterial, and we expect a similar impact in 2025 based on the countries that have adopted the Pillar Two rules, and the guidance issued to date. \nThe Company continues to monitor further legislative adoption of the Pillar Two rules by country. The United States has not enacted the Pillar Two global minimum tax, and the current administration recently announced its intention to effectively withdraw from the OECD Inclusive Framework as well as its intention to enact retaliatory measures against countries who assert extraterritorial taxes against U.S. taxpayers. In addition, significant uncertainty exists regarding the interpretation of the detailed Pillar Two rules, whether such rules will be implemented consistently across taxing jurisdictions, how such rules interact with existing national tax laws and whether such rules are consistent with existing tax treaty obligations. Developments related to these uncertainties could impact our expectations regarding the impact of the Pillar Two global minimum tax on our tax rate from continuing operations in 2025.\nSee \nNote H – Income Taxes\n to our consolidated financial statements included in Item 8. Financial Statements and Supplementary Data of this Annual Report on Form 10-K for additional details on our tax rate.\n46\nLiquidity and Capital Resources\nBased on our current business plan, we believe our existing balance of \nCash and cash equivalents\n, future cash generated from operations, access to capital markets and existing credit facilities will be sufficient to fund our operations, invest in our infrastructure, pay our legal-related liabilities, pay taxes due, service and repay our existing debt and fund possible acquisitions for the next 12 months and for the foreseeable future. Please refer to \nContractual Obligations and Commitments\n below for additional details on our future payment obligations and commitments. \nAs of December 31, 2024, we had $414 million of unrestricted \nCash and cash equivalents\n on hand, including approximately $50 million held by Acotec, a less than wholly owned entity of which we acquired a majority stake investment during the first quarter of 2023. The balance is comprised of $50 million invested in money market funds and time deposits and $364 million in interest bearing and non-interest-bearing bank accounts. We invest excess cash on hand in short-term financial instruments that earn at market interest rates while mitigating principal risk through instrument and counterparty diversification, as well as what we believe to be prudent instrument selection. We limit our direct exposure to securities in any one industry or issuer. \nIn 2021, we entered into our $2.750 billion revolving credit facility (as amended, supplemented or otherwise modified from time to time, the 2021 Revolving Credit Facility) with a global syndicate of commercial banks. On May 10, 2024, we entered into a third amendment to the 2021 Revolving Credit Facility credit agreement, which provided for, among other things, an extension of the scheduled maturity date to May 10, 2029, an amendment of the Ratings based pricing grid of the Applicable Margin, each as defined in the credit agreement, and reset the applicable date for purposes of determining the amounts of restructuring charges and restructuring-related expenses that may be excluded from consolidated Earnings Before Interest, Taxes, Depreciation and Amortization (EBITDA), as defined by the credit agreement, for purposes of our maximum leverage ratio covenant, from December 31, 2022 to March 31, 2024, as further discussed under \nFinancial Covenant\n below. This facility provides backing for our commercial paper program, and outstanding commercial paper directly reduces borrowing capacity under the 2021 Revolving Credit Facility. There was $191 million outstanding under our commercial paper program as of December 31, 2024. There were no amounts outstanding under the 2021 Revolving Credit Facility as of December 31, 2024, resulting in an additional $2.559 billion of available liquidity.\nFor additional details related to our debt obligations, including our financial covenant requirement, refer to \nNote E – Contractual Obligations and Commitments\n to our consolidated financial statements included in Item 8. Financial Statements and Supplementary Data of this Annual Report on Form 10-K.\nThe following provides a summary and description of our net cash inflows (outflows):\nYear Ended December 31,\n(in millions)\n2024\n2023\n2022\nCash provided by (used for) operating activities\n$\n3,435 \n$\n2,503 \n$\n1,526 \nCash provided by (used for) investing activities\n(5,687)\n(2,574)\n(2,011)\nCash provided by (used for) financing activities\n1,814 \n5 \n(548)\nOperating Activities\nIn 2024, cash provided by (used for) operating activities increased $932 million as compared to 2023, primarily due to higher net sales and operating income, slower inventory buildup due to improved macroeconomic supply chain conditions, as well as increases in employee related accruals, accrued commissions and accrued rebates, partially offset by higher prepaid expenses and income tax receivables. In 2023, cash provided by (used for) operating activities increased $977 million compared to 2022, primarily due to comparatively higher net sales and operating income, lower non-recurring tax payments compared to prior year, as well as timing of employee related accruals and prepaid expenses. This increase was partially offset by the use of cash associated with an increase in inventory purchases as a result of higher sales and ensuring continuity of supply to meet procedural volume demand.\n47\nInvesting Activities\nIn 2024, cash provided by (used for) investing activities included cash payments of $4.640 billion for the acquisitions of businesses, net of cash acquired, primarily related to the acquisitions of Axonics and Silk Road Medical, and \npurchases of property, plant and equipment and internal use software \nof $790 million. For more information on our acquisitions, refer to \nNote B – Acquisitions and Strategic Investments\n to our consolidated financial statements included in Item 8. Financial Statements and Supplementary Data of this Annual Report on Form 10-K. In 2023, cash provided by (used for) investing activities included cash payments of $1.811 billion, net of cash acquired, for the acquisitions of Apollo, Relievant and our majority stake investment in Acotec, as well as p\nurchases of property, plant and equipment and internal use software \nof $711 million.\nFinancing Activities\nIn 2024, cash provided by (used for) financing activities included proceeds from the registered public offering of the 2024 Eurobonds. The offering resulted in cash proceeds of $2.145 billion, net of investor discounts and issuance costs. We primarily used the net proceeds from the offering to fund a portion of the purchase price of our acquisition of Axonics and to pay related fees and expenses, and for general corporate purposes. We also used the net proceeds to fund the repayment at maturity of our 3.450% Senior Notes due March 2024 and to pay accrued and unpaid interest with respect to such notes. For more information, refer to \nNote E – Contractual Obligations and Commitments\n to our consolidated financial statements included in Item 8. Financial Statements and Supplementary Data of this Annual Report on Form 10-K. In 2024, cash provided by (used for) financing activities also included \nproceeds from the issuances of common stock pursuant to employee stock compensation and purchase plans \nof $230 million and \nnet proceeds from the issuance of commercial paper\n of $187 million, partially offset by \npayments of contingent consideration previously established in purchase accounting\n of $131 million. In 2023, cash provided by (used for) financing activities included \nproceeds from issuances of common stock pursuant to employee stock compensation and purchase plans\n of $182 million partially offset by \ncash used to net share settle employee equity awards \nof $56 million, \npayments for royalty rights\n of $50 million and \npayments of contingent consideration previously established in purchase accounting\n of $39 million.\n \nOur liquidity plans are subject to a number of risks and uncertainties, including those described in Item 1A. Risk Factors of this Annual Report on Form 10-K, some of which are outside our control. These and other risks and uncertainties could limit our ability to successfully execute our business plans and adversely affect our liquidity plans.\nFinancial Covenant\nAs of December 31, 2024, we were in compliance with the financial covenant required by the 2021 Revolving Credit Facility. \n \nCovenant Requirement\nas of December 31, 2024\n \nActual\nas of December 31, 2024\nMaximum permitted leverage ratio\n(1)\n4.75 times\n \n2.26 times\n(1)\n Ratio of total debt to deemed consolidated EBITDA, as defined by the 2021 Revolving Credit Facility credit agreement.\nThe 2021 Revolving Credit Facility includes the financial covenant requirement for all of our credit arrangements that we maintain the maximum permitted leverage ratio of 3.75 times for the remaining term. The credit agreement provides for higher leverage ratios, at our election, for the period following a Qualified Acquisition, as defined by the agreement, for which consideration exceeds $1.000 billion. In the event of such an acquisition, for the four succeeding quarters immediately following, including the quarter in which the acquisition occurs, the maximum permitted leverage ratio is 4.75 times. It steps down for the fifth, sixth and seventh succeeding quarters to 4.50 times, 4.25 times and 4.00 times, respectively. Thereafter, a maximum leverage ratio of 3.75 times is required through the remaining term of the 2021 Revolving Credit Facility. On November 15, 2024, we announced the closing of our acquisition of Axonics, which we had previously designated as a Qualified Acquisition under the credit agreement, increasing the maximum permitted leverage ratio to 4.75 times as of December 31, 2024. We believe that we have the ability to comply with the financial covenant for the next 12 months.\nThe financial covenant requirement, as amended on May 10, 2024, provides for an exclusion from the calculation of consolidated EBITDA through maturity, of certain charges and expenses. The credit agreement amendment reset the starting date for purposes of calculating such permitted exclusions related to restructuring charges and restructuring-related expenses from December 31, 2022 to March 31, 2024. Permitted exclusions include up to $500 million in cash and non-cash restructuring charges and restructuring-related expenses associated with our current or future restructuring plans. As of December 31, 2024, we had $322 million of the restructuring charge exclusion remaining. In addition, any cash litigation \n48\npayments (net of any cash litigation receipts), as defined by the agreement, are excluded from the calculation of consolidated EBITDA, provided that the sum of any excluded net cash litigation payments do not exceed $1.000 billion plus all accrued legal liabilities as of December 31, 2022. As of December 31, 2024, we had $1.435 billion of the litigation exclusion remaining.\nDebt\nThe following table presents the current and long-term portions of our total debt:\n \nAs of\n(in millions)\nDecember 31, 2024\nDecember 31, 2023\nCurrent debt obligations\n$\n1,778 \n$\n531 \nLong-term debt\n8,968 \n$\n8,571 \nTotal debt\n$\n10,746\n \n$\n9,102\n \nThe following table presents the portions of our total debt that are comprised of fixed and variable rate debt instruments, which are presented on an amortized cost basis:\n \nAs of\n(in millions)\nDecember 31, 2024\nDecember 31, 2023\nFixed-rate debt instruments\n$\n10,507 \n$\n9,070 \nVariable rate debt instruments\n239 \n32 \nTotal debt\n$\n10,746\n \n$\n9,102\n \nFor additional details related to our debt obligations, including our financial covenant requirements, refer to \nNote E – Contractual Obligations and Commitments\n to our consolidated financial statements included in Item 8. Financial Statements and Supplementary Data of this Annual Report on Form 10-K.\nEquity\nIn 2024, we received $230 million in proceeds from stock issuances related to our stock option and employee stock purchase plans, compared to $182 million in 2023. Proceeds from the exercise of employee stock options and employee stock purchases vary from period to period based upon, among other factors, fluctuations in the trading price of our common stock and in the exercise and stock purchase patterns of our employees. Stock-based compensation expense related to our stock ownership plans was $266 million in 2024 and $233 million in 2023. Stock-based compensation expense varies from period to period based upon, among other factors, the timing, number and fair value of awards granted during the period, forfeiture levels related to unvested awards and employee contributions to our employee stock purchase plan, as well as the retirement eligibility of stock award recipients.\nOn June 1, 2023, in accordance with the terms of our MCPS, all outstanding shares of MCPS automatically converted into shares of common stock. No action by the holders of the MCPS was required in connection with the mandatory conversion. The conversion rate for each share of MCPS was 2.3834 shares of common stock. Cash was paid in lieu of fractional shares in accordance with the terms of the MCPS. An aggregate of approximately 24 million shares of common stock, including shares of common stock issued to holders of MCPS that elected to convert prior to the mandatory conversion date, were issued upon conversion of the MCPS. Following the mandatory conversion of the MCPS, there were no outstanding shares of MCPS, resulting in the retirement of the annualized approximately $55 million cash dividend payment on the MCPS.\nOn December 14, 2020, our Board of Directors approved a stock repurchase program authorizing the repurchase of up to $1.000 billion of our common stock. We did not repurchase any shares of our common stock in 2024 or 2023, and had the full amount available under the authorization as of December 31, 2024. There were approximately 263 million shares in treasury as of December 31, 2024 and 2023.\n49\nContractual Obligations and Commitments\n(in millions)\n2025\n2026\n2027\n2028\n2029\nThereafter\nTotal\nDebt obligations\n(1)\n$\n1,730 \n$\n255 \n$\n935 \n$\n1,123 \n$\n1,051 \n$\n5,547 \n$\n10,642 \nInterest payments\n(2)\n288 \n270 \n266 \n253 \n234 \n1,385 \n2,695 \nLease obligations\n(3)\n94 \n84 \n64 \n52 \n43 \n227 \n564 \nPurchase obligations\n(2)\n881 \n220 \n125 \n108 \n21 \n159 \n1,514 \nLegal reserves\n(4)\n177 \n— \n— \n— \n— \n— \n177 \nOne-time transition tax\n147 \n— \n— \n— \n— \n— \n147 \n$\n3,316\n \n$\n829\n \n$\n1,390\n \n$\n1,536\n \n$\n1,349\n \n$\n7,318\n \n$\n15,739\n \n(1)\nDebt obligations are comprised of our senior notes outstanding as of December 31, 2024. This does not include unamortized debt issuance \ndiscounts, deferred financing costs and gains on fair value hedges or finance lease obligations. Refer to \nNote E – Contractual Obligations and Commitments\n to our consolidated financial statements included in Item 8. Financial Statements and Supplementary Data of this Annual Report on Form 10-K for additional information.\n(2)\nIn accordance with U.S. GAAP, these obligations relate primarily to expenses associated with future periods and, with the exception of accrued interest, are not reflected in our consolidated balance sheet as of December 31, 2024. Interest payments included above are calculated based on rates and required fees applicable to our outstanding debt obligations as of December 31, 2024 described in \nNote E – Contractual Obligations and Commitments\n to our consolidated financial statements included in Item 8. Financial Statements and Supplementary Data of this Annual Report on Form 10-K.\n(3)\nLease obligations include minimum lease payments under our operating lease agreements. Refer to \nNote F – Leases\n to our consolidated financial statements included in Item 8. Financial Statements and Supplementary Data of this Annual Report on Form 10-K for more information.\n(4)\nTiming of payment for our long-term liability for legal matters that are probable and estimable as of December 31, 2024 is uncertain and as such it is excluded from the table above. Refer to \nNote I – Commitments and Contingencies\n to our consolidated financial statements included in Item 8. Financial Statements and Supplementary Data of this Annual Report on Form 10-K for more information.\nThe amounts in the table above with respect to purchase obligations relate primarily to non-cancellable inventory commitments and capital expenditures entered in the normal course of business. The table above does not include:\n•\nAny future obligations to make payments of contingent consideration pursuant to certain of our acquisition agreements, due to the exact amount and timing of payments being uncertain. Refer to \nNote B – Acquisitions and Strategic Investments\n to our consolidated financial statements included in Item 8. Financial Statements and Supplementary Data of this Annual Report on Form 10-K for more information;\n•\nUnrecognized tax benefits, accrued interest and penalties and other related items because the timing of their future cash settlement is uncertain. Refer to \nNote H – Income Taxes\n to our consolidated financial statements included in Item 8. Financial Statements and Supplementary Data of this Annual Report on Form 10-K for more information;\n•\nAcquired IPR&D projects that require future funding to complete. We estimate that the total remaining cost to complete acquired IPR&D projects is between $125 million and $135 million. Net cash inflows from the projects currently in development are expected to continue through 2042, following the respective launches of these technologies in the U.S. and Europe. See \nNote C – Goodwill and Other Intangible Assets\n to our consolidated financial statements included in Item 8. Financial Statements and Supplementary Data of this Annual Report on Form 10-K for more information;\n•\nA previously executed finance lease for additional office and warehouse space which commenced in December 2024. Total estimated undiscounted future lease payments are approximately $240 million. This lease has a noncancellable lease term of 25 years. See \nNote F – Leases\n to our consolidated financial statements included in Item 8. Financial Statements and Supplementary Data of this Annual Report on Form 10-K for more information;\n•\nOne lease we have entered into as of December 31, 2024 for additional office and lab space which has not yet commenced as the facility is currently under construction. We do not control the building during construction and are thus not deemed to be the owner during construction. Total estimated undiscounted future lease payments are approximately $250 million, which includes a buyout option exercisable once construction is complete which we are reasonably certain to exercise. The lease is expected to commence in the second half of 2025 with a noncancellable lease term of 20 years; \n50\n•\nThe January 24, 2025 acquisition of Cortex Inc., consisting of an upfront cash payment of $248 million, net of cash acquired, and up to approximately $50 million in future payments upon achievement of certain regulatory milestones;\n•\nThe definitive agreement, entered into on January 8, 2025, to acquire Bolt Medical, Inc. (Bolt Medical). We have been an investor in Bolt Medical since 2019 and currently hold an equity stake of approximately 26 percent. The transaction price to acquire the remaining stake is expected to result in an upfront cash payment of approximately $443 million upon closing and up to approximately $221 million in future payments upon achievement of certain regulatory milestones. The transaction is expected to close during the first half of 2025, subject to customary closing conditions. We plan to fund the acquisition through a mix of cash on hand and commercial paper; and\n•\nThe definitive agreement, entered into on November 25, 2024, to acquire Intera Oncology® Inc., for approximately $175 million, which is expected to close during the first half of 2025, subject to customary closing conditions. We plan to fund the acquisition through a mix of cash on hand and commercial paper.\n51\n2023 Restructuring Plan\nOn February 22, 2023, our Board of Directors approved, and we committed to, a new global restructuring program (the 2023 Restructuring Plan). The 2023 Restructuring Plan is helping to advance our Global Supply Chain Optimization strategy, which is intended to simplify our manufacturing and distribution network by transferring certain production lines among facilities and drive operational efficiencies and resiliency. Key activities under the 2023 Restructuring Plan also include optimizing certain functional capabilities to achieve cost synergies and better support business growth. These activities were initiated in the first quarter of 2023 and are expected to be substantially complete by the end of 2025.\nWhile we expect limited role reductions as a result of these restructuring activities, we anticipate that our overall employee base will remain relatively unchanged upon completion of the 2023 Restructuring Plan as new jobs are created in areas of growth and resources are deployed to support an expanding portfolio and growing global market needs.\nThe implementation of the 2023 Restructuring Plan is estimated to result in total pre-tax charges of approximately $450 million to $550 million, of which approximately $350 million to $450 million is expected to result in cash outlays, and reduce gross annual pre-tax expenses by approximately $225 million to $275 million as program benefits are realized. We expect to reinvest a substantial portion of the savings in strategic growth initiatives. The following table provides a summary of our range of estimates of total pre-tax charges associated with the 2023 Restructuring Plan by major type of cost:\nType of Cost \n(in millions)\nTotal Estimated Amount Expected to be Incurred\nRestructuring charges:\nTermination benefits\n(1)\n$\n60 \n-\n$\n80 \nOther\n(2)\n20 \n-\n40 \nRestructuring-related expenses:\nTransfer costs\n(3)\n300 \n-\n330 \nOther\n(4)\n70 \n-\n100 \n \n$\n450\n \n-\n$\n550\n \n(1)\nPlans detailing specific employee impacts will be developed for each affected region and business, working with employee representative bodies where required under local laws.\n(2)\nConsists primarily of consulting fees and costs associated with contractual cancellations.\n(3)\nRepresents costs to transfer product and manufacturing lines between geographically dispersed facilities.\n(4)\nComprised of other costs directly related to the restructuring program, including program management, accelerated depreciation and fixed asset write-offs.\nLegal Matters\nFor a discussion of our material legal proceedings, see \nNote I – Commitments and Contingencies\n to our consolidated financial statements included in Item 8. Financial Statements and Supplementary Data of this Annual Report on Form 10-K.\nCritical Accounting Policies and Estimates\nOur financial results are affected by the selection and application of accounting policies and methods. We have adopted accounting policies to prepare our consolidated financial statements in conformity with U.S. GAAP. \nTo prepare our consolidated financial statements in accordance with U.S. GAAP, management makes estimates and assumptions that may affect the reported amounts of our assets and liabilities, including our contingent liabilities, as of the date of our financial statements and the reported amounts of our revenues and expenses during the reporting periods. Our actual results may differ from these estimates. We consider estimates to be critical (i) if we are required to make assumptions about material matters that are uncertain at the time of estimation or (ii) if materially different estimates could have been made or it is reasonably likely that the accounting estimate will change from period to period. The following are areas considered to be critical and require management’s judgment: Revenue Recognition, Inventory Provisions, Valuation of Intangible Assets and Contingent Consideration Liabilities, Goodwill Valuation, Legal and Product Liability Accruals and Income Taxes.\n52\nSee \nNote A – Significant Accounting Policies\n to our consolidated financial statements included in Item 8. Financial Statements and Supplementary Data of this Annual Report on Form 10-K for additional information related to our accounting policies and our consideration of these critical accounting areas. \nRevenue Recognition\n \nDeferred Revenue\nWe record a contract liability, or deferred revenue, when we have an obligation to provide a product or service to the customer and payment is received or due in advance of our performance. When we sell a device with a future service obligation, we defer revenue on the unfulfilled performance obligation and recognize this revenue over the related service period. Generally, we do not have observable evidence of the standalone selling price related to our future service obligations; therefore, we estimate the selling price using an expected cost plus a margin approach. We allocate the transaction price using the relative standalone selling price method. The use of alternative estimates could result in a different amount of revenue deferral.\nOur contract liabilities are primarily composed of deferred revenue related to the LATITUDE™ Patient Management System within our Cardiology business, for which revenue is recognized over the average service period based on device and patient longevity. Our contract liabilities also include deferred revenue related to the LUX-Dx™ Insertable Cardiac Monitor system, also within our Cardiology business, for which revenue is recognized over the average service period based on device longevity and usage. The use of alternative assumptions could impact the period over which revenue is recognized.\nVariable Consideration\nWe generally allow our customers to return defective, damaged and, in certain cases, expired products for credit. We base our estimate for sales returns upon historical trends and record the amount as a reduction to revenue when we sell the initial product. In addition, we may allow customers to return previously purchased products for next-generation product offerings. For these transactions, we defer recognition of revenue on the sale of the earlier generation product based upon an estimate of the amount of product to be returned when the next-generation products are shipped to the customer. Uncertain timing of next-generation product approvals, variability in product launch strategies, product recalls and variation in product utilization all affect our estimates related to sales returns and could cause actual returns to differ from these estimates.\nWe also offer sales rebates and discounts to certain customers and record these as a reduction of revenue and classify the corresponding liability as current. We estimate rebates for products where there is sufficient historical information available to predict the volume of expected future rebates. If we are unable to reasonably estimate the expected rebates, we record a liability for the maximum rebate percentage offered.\nPost-Implant Services\nWe provide non-contractual services to customers to ensure the safe and effective use of certain implanted devices. We forward accrue the costs to provide these services at the time the devices are sold by estimating the amount of time spent by our representatives performing these services and their compensation throughout the device life to determine the service cost. Changes to our business practice or the use of alternative estimates could result in a different amount of accrued cost. \nInventory Provisions\nWe base our provisions for excess, expired and obsolete inventory primarily on our estimates of forecasted net sales. A significant change in the timing or level of demand for our products as compared to forecasted amounts may result in recording additional provisions for excess, expired and obsolete inventory in the future. Further, the industry in which we participate is characterized by rapid product development and frequent new product introductions. Uncertain timing of next-generation product approvals, variability in product launch strategies, product recalls and variation in product utilization all affect our estimates related to excess, expired and obsolete inventory.\n53\nValuation of Intangible Assets and Contingent Consideration Liabilities\nWe base the fair value of identifiable intangible assets acquired in a business combination, including IPR&D, on detailed valuations that use information and assumptions provided by management, which consider management’s best estimates of inputs and assumptions that a market participant would use. Further, for those arrangements that involve potential future contingent consideration, we record on the date of acquisition a liability equal to the fair value of the estimated additional consideration we may be obligated to pay in the future. We re-measure this liability each reporting period and record changes in the fair value through a separate line item within our consolidated statements of operations. Increases or decreases in the fair value of the contingent consideration liability can result from changes in discount rates, periods, timing and amount of projected revenue or timing or likelihood of achieving regulatory, revenue or commercialization-based milestones. The use of alternative valuation assumptions, including estimated revenue projections, growth rates, cash flows, discount rates, useful life or probability of achieving clinical, regulatory or revenue-based milestones could result in different purchase price allocations and recognized amortization expense and contingent consideration expense or benefit in current and future periods.\nWe review intangible assets subject to amortization quarterly to determine if any adverse conditions exist or a change in circumstances has occurred that would indicate impairment or adjustment to the remaining useful life. If we determine it is more likely than not that the asset is impaired based on our qualitative assessment of impairment indicators, we test the intangible asset for recoverability. If the carrying value of the intangible asset is determined not recoverable\n, \nwe will write the carrying value down to fair value in the period the impairment is identified. We calculate fair value of our intangible assets as the present value of estimated future cash flows we expect to generate from the asset using a risk-adjusted discount rate. The use of alternative assumptions, including estimated cash flows, discount rates and alternative estimated remaining useful lives could result in different calculations of impairment.\nIn addition, we test our indefinite-lived intangible assets at least annually for impairment and reassess their classification as indefinite-lived assets, or more frequently if indicators exist. We assess qualitative factors to determine whether the existence of events and circumstances indicate that it is more likely than not that our indefinite-lived intangible assets are impaired. If we conclude that it is more likely than not that the asset is impaired, we then determine the fair value of the intangible asset and perform the quantitative impairment test by comparing the fair value with the carrying value\n. \nIf the carrying value exceeds the fair value of the indefinite-lived intangible asset, we write the carrying value down to fair value. The use of alternative valuation assumptions, including estimated revenue projections, growth rates, cash flows and discount rates could result in different fair value estimates. \nGoodwill Valuation\n \nWe allocate any excess purchase price over the fair value of the net tangible and identifiable intangible assets acquired in a business combination to goodwill. We test our goodwill balances, utilizing both the qualitative and quantitative approach described in FASB ASC Topic 350, \nIntangibles - Goodwill and Other \n(FASB ASC Topic 350), in the second quarter of each year as of April 1 for impairment, or more frequently if impairment indicators are present or changes in circumstances suggest an impairment may exist.\nWe assess goodwill for impairment at the reporting unit level, which is defined as an operating segment or one level below an operating segment, referred to as a component. For our 2024 annual impairment assessment, we identified the following reporting units for purposes of our annual goodwill impairment test: Interventional Cardiology, Rhythm Management, Peripheral Interventions, Endoscopy, Urology and Neuromodulation. Based on the criteria prescribed in FASB ASC Topic 350, we aggregated the Interventional Cardiology Therapies and Watchman components of our Cardiology operating segment into a single Interventional Cardiology reporting unit and aggregated the Cardiac Rhythm Management and Electrophysiology components into a single Rhythm Management reporting unit.\nIn performing annual impairment assessments, when a quantitative test is performed, we typically use the income approach, specifically the Discounted Cash Flow method, to derive the fair value of each of our reporting units in preparing our goodwill impairment assessments. We historically selected this method as being the most meaningful in preparing our goodwill assessments because we believe the income approach most appropriately measures the fair value of our income producing assets. We have considered using the market approach and cost approach but concluded they are not appropriate in valuing our reporting units given the lack of relevant market comparisons available for application of the market approach and the inability to replicate the value of the specific technology-based assets within our reporting units for application of the cost approach. \nIn applying the income approach, we make assumptions about the amount and timing of future expected cash flows, terminal value growth rates and appropriate discount rates. The amount and timing of future cash flows within our Discounted Cash Flow analysis is based on our most recent operational budgets, long range strategic plans and other estimates. The terminal \n54\nvalue growth rate reflects our best estimates for stable, perpetual growth of our reporting units. We use estimates of market-participant risk-adjusted weighted average cost of capital as a basis for determining the discount rates to apply to our reporting units’ future expected cash flows.\nAlthough we use consistent methodologies in developing the assumptions and estimates underlying the fair value calculations used in our impairment tests, these estimates are uncertain by nature and can vary from actual results. The use of alternative valuation assumptions, including estimated revenue projections, growth rates, cash flows and discount rates could result in different fair value estimates.\nFuture events that could have a negative impact on the levels of excess fair value over carrying value of our reporting units include, but are not limited to, the following: \n•\ndecreases in estimated market sizes or market growth rates due to greater-than-expected declines in procedural volumes, inclusive of those resulting from macroeconomic conditions, including inflationary pricing pressures and reductions in reimbursement levels, \n•\ndeclines in our market share and penetration assumptions due to increased competition, an inability to develop or launch new and next-generation products and technology features in line with our commercialization strategies and market and/or regulatory conditions that may cause significant launch delays or product actions, \n•\ndecreases in our forecasted profitability due to an inability to implement successfully and achieve timely and sustainable cost improvement measures consistent with our expectations, \n•\nnegative developments in intellectual property litigation that may impact our ability to market certain products or increase our costs to sell certain products, \n•\nthe level of success of ongoing and future research and development efforts, including those related to acquisitions and increases in the research and development costs necessary to obtain regulatory approvals and launch new products, \n•\nthe level of success in managing the growth of acquired companies, achieving sustained profitability consistent with our expectations, establishing government and third-party payer reimbursement, supplying the market and increases in the costs and time necessary to integrate acquired businesses into our operations successfully, \n•\nchanges in our reporting units or in the structure of our business as a result of future reorganizations, acquisitions or divestitures of assets or businesses and \n•\nincreases in our market-participant risk-adjusted weighted average cost of capital and increases in our market-participant tax rate and/or changes in tax laws or macroeconomic conditions.\nNegative changes in one or more of these factors, among others, could result in future impairment charges.\nLegal and Product Liability Accruals\nWe are involved in various legal and regulatory proceedings, including intellectual property, breach of contract, securities litigation and product liability suits. In some cases, the claimants seek damages, as well as other relief, which, if granted, could require significant expenditures or impact our ability to sell our products. We are also the subject of certain governmental investigations, which could result in substantial fines, penalties and administrative remedies. We accrue anticipated costs of settlement, damages, losses for product liability claims and, under certain conditions, costs of defense, based on historical experience or to the extent specific losses are probable and estimable. Otherwise, we expense these costs as incurred. If the estimate of a probable loss is a range and no amount within the range is more likely, we accrue the minimum amount of the range. Litigation and product liability matters are inherently uncertain, and the outcomes of individual matters are difficult to predict and quantify. As such, significant judgment is required in determining our legal and product liability accruals. Our estimates related to our legal and product liability accruals may change as additional information becomes available to us, including information related to the nature or existence of claims against us, trial court or appellate proceedings, and mediation, arbitration or settlement proceedings.\n55\nIncome Taxes\nWe reduce our deferred tax assets by a valuation allowance if, based upon the weight of available evidence, it is more likely than not that we will not realize some portion or all the deferred tax assets. We consider relevant evidence, both positive and negative, to determine the need for a valuation allowance. Information evaluated includes our financial position and results of operations for the current and preceding years, the availability of deferred tax liabilities and tax carrybacks, as well as estimates of the impact of future taxable income and available prudent and feasible tax-planning strategies. The realizability assessments made at a given balance sheet date are subject to change, particularly if earnings of a subsidiary are inconsistent with expectations, or if we take operational or tax planning actions that could impact the future taxable earnings of a subsidiary. Each reporting period, we monitor the need for valuation allowances for each filing group in each jurisdiction where we are subject to tax. Based on currently available information, we believe that it is more likely than not that our deferred tax assets, net of valuation allowances, will be realized. \nWe establish reserves when we believe that certain positions are likely to be challenged despite our belief that our tax return positions are fully supportable. The calculation of our tax liabilities involves significant judgment based on individual facts, circumstances, and information available in addition to applying complex tax regulations across our global operations. To recognize an uncertain tax benefit in the consolidated financial statements, the taxpayer must determine if it is more likely than not that the position will be sustained, with the measurement of the resulting benefit calculated as the largest amount more than 50 percent likely to be realized upon resolution of the benefit. We review these tax uncertainties each reporting period to consider changing facts and circumstances, such as the progress of tax audits, and adjust them accordingly. Upon final resolution with tax authorities, we may prevail in positions for which reserves have been established, or we may be required to pay amounts more than established reserves. Although we believe that we have adequately provided for liabilities resulting from tax assessments by taxing authorities, positions taken by these tax authorities could have a material impact on our effective tax rate, results of operations, financial position and/or cash flows.\nNew Accounting Pronouncements\nRefer to \nNote P – New Accounting Pronouncements\n to our consolidated financial statements included in Item 8. Financial Statements and Supplementary Data of this Annual Report on Form 10-K for additional information on standards implemented during 2024 and standards to be implemented in future periods.\nAdditional Information\nUse of Non-GAAP Financial Measures\nTo supplement our consolidated financial statements presented on a GAAP basis, we disclose certain non-GAAP financial measures, including adjusted net income (loss), adjusted net income (loss) attributable to common stockholders and adjusted net income (loss) per share (EPS) that exclude certain charges (credits); operational net sales, which exclude the impact of foreign currency fluctuations; and organic net sales, which exclude the impact of foreign currency fluctuations as well as the impact of certain acquisitions and divestitures with less than a full period of comparable net sales. These non-GAAP financial measures are not in accordance with U.S. GAAP and should not be considered in isolation from or as a replacement for the most directly comparable GAAP financial measures. Further, other companies may calculate these non-GAAP financial measures differently than we do, which may limit the usefulness of those measures for comparative purposes.\nTo calculate adjusted net income (loss), adjusted net income (loss) attributable to common stockholders and adjusted net income (loss) per share we exclude certain charges (credits) from GAAP net income and GAAP net income attributable to common stockholders, which include amortization expense, goodwill and other intangible asset impairment charges, acquisition/divestiture-related net charges (credits), investment portfolio net losses (gains) and impairments, restructuring and restructuring-related net charges (credits), certain litigation-related net charges (credits), EU MDR implementation costs, debt extinguishment net charges, deferred tax expenses (benefits) and certain discrete tax items. Amounts are presented after-tax using our effective tax rate, unless the amount is a significant unusual or infrequently occurring item in accordance with FASB ASC Topic 740-270-30, \"General Methodology and Use of Estimated Annual Effective Tax Rate.\"\nThe GAAP financial measure most directly comparable to adjusted net income (loss), adjusted net income (loss) attributable to common stockholders and adjusted net income (loss) per share are GAAP net income (loss), GAAP net income (loss) attributable to common stockholders and GAAP net income (loss) per common share - assuming dilution, respectively.\n56\nTo calculate operational net sales growth rates, which exclude the impact of foreign currency fluctuations, we convert actual net sales from local currency to U.S. dollars using constant foreign currency exchange rates in the current and prior periods. To calculate organic net sales growth rates, we also remove the impact of acquisitions and divestitures with less than a full period of comparable net sales. The GAAP financial measure most directly comparable to operational net sales and organic net sales is net sales reported on a GAAP basis. \nReconciliations of each of these non-GAAP financial measures to the corresponding GAAP financial measure are included under \nExecutive Summary\n above.\nManagement uses these supplemental non-GAAP financial measures to evaluate performance period over period, to analyze the underlying trends in our business, to assess our performance relative to our competitors and to establish operational goals and forecasts that are used in allocating resources. In addition, management uses these non-GAAP financial measures to further its understanding of the performance of our operating segments. The adjustments excluded from our non-GAAP financial measures are consistent with those excluded from our operating segments’ measures of net sales and profit or loss. These adjustments are excluded from the segment measures reported to our chief operating decision maker that are used to make operating decisions and assess performance.\nWe believe that presenting adjusted net income (loss), adjusted net income (loss) attributable to common stockholders adjusted net income (loss) per share, operational and organic net sales growth rates, in addition to the corresponding GAAP financial measures, provides investors greater transparency to the information used by management for its operational decision-making and allows investors to see our results “through the eyes” of management. We further believe that providing this information assists our investors in understanding our operating performance and the methodology used by management to evaluate and measure such performance.\nThe following is an explanation of each of the adjustments that management excluded as part of these non-GAAP financial measures as well as reasons for excluding each of these individual items. In each case, management has excluded the item for purposes of calculating the relevant non-GAAP financial measure to facilitate an evaluation of our current operating performance and a comparison to our past operating performance:\nAdjusted Net Income (loss), Adjusted Net Income (loss) Attributable to Common Stockholders and Adjusted Net Income (loss) per Share\n•\nAmortization expense - We record intangible assets acquired in a business combination or asset acquisition, as well as internally-developed patents at historical cost and amortize them over their estimated useful lives. Amortization expense is excluded from management's assessment of operating performance due to its non-cash nature and from our operating segments' measures of profit and loss used for making operating decisions and assessing performance,\n•\nGoodwill and other intangible asset impairment charges - These amounts represent write-downs of certain goodwill and/or other intangible asset balances. We review intangible assets subject to amortization quarterly to determine if any adverse conditions exist or a change in circumstances has occurred that would indicate impairment and test our other indefinite-lived intangible assets at least annually for impairment. Similarly, we test our goodwill on an annual basis in the second quarter of each year and monitor for indicators of impairment during the remaining quarters. If we determine the carrying value of the amortizable intangible asset is not recoverable, goodwill of a reporting unit is impaired or it is more likely than not that the indefinite-lived asset is impaired\n, \nwe will write the carrying value down to fair value in the period identified. Impairment charges are excluded from management's assessment of operating performance and from our operating segments' measures of profit and loss used for making operating decisions and assessing performance,\n•\nAcquisition/divestiture-related net charges (credits) - These adjustments may consist of (a) contingent consideration fair value adjustments; (b) gains on previously held investments; (c) due diligence, deal fees and other fees and costs related to our acquisition and divestiture transactions; (d) inventory step-up amortization and accelerated compensation expense; (e) integration and exit costs; and (f) separation costs and gains or losses primarily associated with the sale of a business or portion of a business. The contingent consideration fair value adjustments represent accounting adjustments to state contingent consideration liabilities at their estimated fair value. These adjustments can be highly variable depending on the assessed likelihood and amount of future contingent consideration. Gains on previously held investments, due diligence, deal fees and other fees and costs, inventory step-up amortization, accelerated compensation expense, and other expenses and gains or losses associated with divestitures or acquisitions can be highly variable and not representative of ongoing operations. Integration, separation and exit costs include contract cancellations, severance and other compensation-related charges and costs, \n57\nproject management fees and costs, and other direct costs associated with the integration of our acquisitions or separation of our divested businesses. These integration, separation and exit activities take place over a defined timeframe and have distinct project timelines, are incremental to activities and costs that arise in the ordinary course of our business and are not considered part of our core, ongoing operations. These acquisition/divestiture-related net charges (credits) are excluded from management's assessment of operating performance and from our operating segments' measures of profit and loss used for making operating decisions and assessing performance,\n•\nRestructuring and restructuring-related net charges (credits) - These adjustments primarily represent severance and other compensation-related charges, fixed asset write-offs, contract cancellations, project management fees, facility shut down costs, costs to transfer manufacturing lines between geographically dispersed facilities and other direct costs associated with our restructuring plans. These restructuring plans each consist of distinct initiatives that are fundamentally different from our ongoing, core cost reduction initiatives in terms of, among other things, the frequency with which each action is performed and the required planning, resourcing, cost and timing. Examples of such initiatives include the movement of business activities, facility consolidations and closures and the transfer of product lines between manufacturing facilities, which, due to the highly regulated nature of our industry, requires a significant investment in time and cost to create duplicate manufacturing lines, run product validations and seek regulatory approvals. Restructuring initiatives take place over a defined timeframe and have a distinct project timeline that requires, and begins subsequent to, approval by our Board of Directors. In contrast to our ongoing cost reduction initiatives, restructuring initiatives typically result in duplicative cost and exit costs over the defined timeframe and are not considered part of our core, ongoing operations. These restructuring plans are incremental to the core activities that arise in the ordinary course of our business. Restructuring and restructuring-related net charges (credits) are excluded from management's assessment of operating performance and from our operating segments' measures of profit and loss used for making operating decisions and assessing performance,\n•\nLitigation-related net charges (credits) - These adjustments include certain product liability and other litigation-related charges and credits. We record these charges and credits, which we consider to be unusual or infrequent and significant, within the litigation-related charges (credits) line in our consolidated statements of operations; all other legal and product liability charges, credits and costs are recorded within selling, general and administrative expenses. Certain litigation-related net charges (credits) are excluded from management's assessment of operating performance and from our operating segments' measures of profit and loss used for making operating decisions and assessing performance,\n•\nEU MDR implementation costs - These adjustments represent certain incremental costs specific to complying with new regulatory requirements in the EU. EU MDR replaced the existing MDD regulatory framework, and manufacturers of medical devices were required to comply with EU MDR beginning in May 2021 for new products and by May 2024 for medical devices which have a valid CE Certificate to the Directives issued before May 2021. In 2023, updates to the legislative text of the EU MDR were adopted by the European Parliament and the Council of the European Union, including an extension of the transitional period to 2027 for certain high risk class devices and 2028 for lower risk class medical devices that have a valid CE Certificate to the Directives issued before May 2021. We expect to incur significant expenditures in connection with the adoption of the EU MDR requirements and we consider the adoption of EU MDR to be a significant change to a regulatory framework, and therefore, these expenditures are not considered to be ordinary course expenditures in connection with regulatory matters. As such, certain of these costs are excluded from management's assessment of operating performance and from our operating segments' measures of profit and loss used for making operating decisions and assessing performance,\n•\nDebt extinguishment net charges - These amounts relate to the early extinguishment of certain outstanding principal amounts of our senior notes. Certain debt extinguishment net charges are excluded from management's assessment of operating performance used for making operating decisions and assessing performance,\n•\nInvestment portfolio net losses (gains) and impairments - These amounts represent write-downs or fair value remeasurement gains and losses related to our investment portfolio. Each reporting period, we evaluate our investments without a readily determinable fair value to determine if there are any events or circumstances that are likely to have a significant adverse effect on the fair value of the investment. If we identify an impairment indicator, we will estimate the fair value of the investment and compare it to its carrying value and determine if the impairment is other-than-temporary, and recognize an impairment loss. In addition, for those investments accounted for under the measurement alternative method of accounting, we record gains and losses to remeasure the carrying value of the investments to their fair values based on observable market prices or implied market values. Investment impairment charges and fair value remeasurements can be highly variable dependent on external market factors and conditions \n58\nrelative to the underlying investee, which are generally outside of the control of management, as such these amounts are excluded from management's assessment of performance,\n•\nDeferred tax expenses (benefits) - This adjustment relates to a significant non-cash tax benefit arising from an intra-entity asset transfer of intellectual property completed in the fourth quarter of 2019 which resulted in our recording a $4.102 billion net deferred tax asset. The deferred tax benefit associated with the establishment of the net deferred tax asset as well as any deferred tax expense resulting from the reversal of the deferred tax asset are excluded from management's assessment of operating performance used for making operating decisions and assessing performance, and\n•\nDiscrete tax items - These items represent adjustments for certain tax charges (credits) including those which (a) are related to the indirect consequences of non-GAAP charges (credits) on limitations that impact certain tax benefits or incentives in the current period or (b) are related to the tax consequences of a non-GAAP adjustment item booked in a prior period. These discrete tax items are excluded from management's assessment of operating performance used for making operating decisions and assessing performance.\nOperational Net Sales\n•\nThe impact of foreign currency fluctuations is highly variable and difficult to predict. Accordingly, management excludes the impact of foreign currency fluctuations for purposes of reviewing net sales and growth rates to facilitate an evaluation of our current operating performance and a comparison to our past operating performance.\nOrganic Net Sales\n•\nOrganic net sales growth excludes the impact of foreign currency fluctuations and net sales attributable to acquisitions and divestitures for which there are less than a full period of comparable net sales.\n59\nManagement’s Annual Report on Internal Control over Financial Reporting\nAs the management of Boston Scientific Corporation, we are responsible for establishing and maintaining adequate internal control over financial reporting. We designed our internal control process to provide reasonable assurance to management and the Board of Directors regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles.\nWe assessed the effectiveness of our internal control over financial reporting as of December 31, 2024. In making this assessment, we used the criteria set forth by the Committee of Sponsoring Organizations of the Treadway Commission in Internal Control–Integrated Framework (2013 framework). Based on our assessment, we believe that, as of December 31, 2024, our internal control over financial reporting is effective at a reasonable assurance level based on these criteria.\nIn accordance with the SEC Staff's interpretive guidance for newly acquired businesses, we are permitted to omit an assessment of an acquired business's internal control over financial reporting from our assessment of internal control for up to one year from the acquisition date. As such, we have excluded our acquisitions of Silk Road Medical, Inc. and Axonics, Inc., each acquired during 2024, from our annual assessment of internal controls over financial reporting as of December 31, 2024. These businesses represented approximately one percent of total assets as of December 31, 2024 and approximately one percent of net sales for the year then ended.\nErnst & Young LLP, an independent registered public accounting firm, has issued an audit report on the effectiveness of our internal control over financial reporting. This report, in which they expressed an unqualified opinion, is included below.\n \n/s/ Michael F. Mahoney\n \n/s/ Daniel J. Brennan\n \n \n \n \n \n \nMichael F. Mahoney\n \n \nDaniel J. Brennan\n \n \nPresident and Chief Executive Officer\n \n \nExecutive Vice President and Chief\nFinancial Officer\n \n60\nReport of Independent Registered Public Accounting Firm\nTo the Stockholders and the Board of Directors of\nBoston Scientific Corporation\nOpinion on Internal Control Over Financial Reporting\nWe have audited Boston Scientific Corporation and subsidiaries’ internal control over financial reporting as of December 31, 2024, based on criteria established in Internal Control—Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework) (the COSO criteria). In our opinion, Boston Scientific Corporation and subsidiaries (the Company) maintained, in all material respects, effective internal control over financial reporting as of December 31, 2024, based on the COSO criteria.\nAs indicated in the accompanying Management’s Annual Report on Internal Control over Financial Reporting, management’s assessment of and conclusion on the effectiveness of internal control over financial reporting did not include the internal controls of Silk Road Medical, Inc. and Axonics, Inc., which are included in the 2024 consolidated financial statements of the Company and constituted approximately one percent of total assets as of December 31, 2024 and approximately one percent of revenues for the year then ended. Our audit of internal control over financial reporting of the Company also did not include an evaluation of the internal control over financial reporting of Silk Road Medical, Inc. and Axonics, Inc.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the 2024 consolidated financial statements of the Company and our report dated February 18, 2025 expressed an unqualified opinion thereon.\nBasis for Opinion \nThe Company’s management is responsible for maintaining effective internal control over financial reporting and for its assessment of the effectiveness of internal control over financial reporting included in the accompanying Management’s Annual Report on Internal Control over Financial Reporting. Our responsibility is to express an opinion on the Company’s internal control over financial reporting based on our audit. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether effective internal control over financial reporting was maintained in all material respects.\nOur audit included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, testing and evaluating the design and operating effectiveness of internal control based on the assessed risk, and performing such other procedures as we considered necessary in the circumstances. We believe that our audit provides a reasonable basis for our opinion.\nDefinition and Limitations of Internal Control Over Financial Reporting\nA company’s internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A company’s internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company’s assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\n61\n/s/ Ernst & Young LLP\nBoston, Massachusetts\nFebruary 18, 2025 \n62",
  "item2": null
}