{
  "source_file": "tmb-20250525x10k.htm",
  "form_type": "10-K",
  "item1": "ITEM 1. BUSINESS\nGeneral Development of Business\nConagra Brands, Inc. (the “Company”, “Conagra Brands”, “we”, “us”, or “our”), headquartered in Chicago, is one of North America’s leading branded food companies. \nWe combine a 100-year history of making quality food with agility and a relentless focus on collaboration and innovation. The company’s portfolio is continuously evolving to satisfy consumers’ ever-changing food preferences.\n Conagra’s brands include \nBirds Eye\n®\n, \nDuncan Hines\n®\n, \nHealthy Choice\n®\n, \nMarie Callender’s\n®\n, \nReddi-wip\n®\n, \nSlim Jim\n®\n, \nAngie’s\n®\n BOOMCHICKAPOP\n®\n, and many more.\nWe began as a Midwestern flour-milling company and entered other commodity-based businesses throughout our history. We were initially incorporated as a Nebraska corporation in 1919 and reincorporated as a Delaware corporation in 1976. Over time, we transformed into the branded, pure-play consumer packaged goods food company we are today. Growing our food businesses has also been fueled by innovation, organic growth of our brands, and expansion into adjacent categories, including through acquisitions. We are focused on delivering sustainable, profitable growth with strong and improving returns on our invested capital.\nNarrative Description of Business\nWe compete throughout the food industry and focus on adding value for our customers who operate in the retail food and foodservice channels.\nOur operations, including our reporting segments, are described below. Our locations, including manufacturing facilities, within each reporting segment, are described in Item 2, \nProperties\n.\nReporting Segments\nOur reporting segments are as follows:\nGrocery & Snacks\nThe Grocery & Snacks reporting segment principally includes branded, shelf-stable food products sold in various retail channels in the United States.\nRefrigerated & Frozen\nThe Refrigerated & Frozen reporting segment principally includes branded, temperature-controlled food products sold in various retail channels in the United States.\nInternational\nThe International reporting segment principally includes branded food products, in various temperature states, sold in various retail and foodservice channels outside of the United States.\nFoodservice\nThe Foodservice reporting segment includes branded and customized food products, including meals, entrees, sauces, and a variety of custom-manufactured culinary products packaged for sale to restaurants and other foodservice establishments primarily in the United States.\n1\n\n\nTable of Contents\nUnconsolidated Equity Investments\nWe have two unconsolidated equity investments. Our most significant equity method investment is our joint venture with respect to Ardent Mills, a milling business.\nGeneral\nThe following discussion pertains to all of our reporting segments.\nConagra Brands is a branded consumer packaged goods food company that operates in many sectors of the food industry, with a significant focus on the sale of branded, value-added consumer food products, as well as foodservice items and ingredients. \nRaw Materials and Packaging\nWe use many different raw materials, most of which are commodities, to make and package our products. The prices paid for raw materials used in making our food generally reflect factors such as global economic conditions, trade barriers or restrictions, supply and demand, weather, commodity market fluctuations, currency fluctuations, tariffs, and the effects of governmental agricultural programs, and may be impacted by supply chain disruptions including disruptions caused by pandemics, epidemics, and disease, in humans and animals, such as the avian flu. Although the prices of raw materials can be expected to fluctuate as a result of these factors, we believe such raw materials to be in adequate supply and generally available from numerous sources. From time to time, we have faced increased costs for many of our significant raw materials, packaging, and energy inputs. We seek to mitigate higher input costs through productivity and pricing initiatives and the use of derivative instruments to economically hedge a portion of forecasted future consumption.\nCompetition\nWe experience intense competition for sales of our food items in our major markets. Our food items compete with widely advertised, well-known, branded food, as well as private branded and customized food items. Some of our competitors are larger and have greater resources than we have. We compete primarily on the basis of quality, product innovation, value, customer service, brand recognition, and brand loyalty.\nSeasonality\nDemand for certain of our food items may be influenced by holidays, changes in seasons, or other annual events. For example, sales of frozen foods tend to be marginally higher during the winter months, pie sales are highest in November and December due to holidays, and production of certain of our products occurs seasonally, during or immediately following the purchase of agricultural crops.\nTrademarks and Intellectual Property\nOur intellectual property rights, including our trademarks, licensing agreements, trade secrets, patents, and copyrights are of material importance to our business, and we attempt to protect such rights by pursuing remedies available to us under trademark, copyright, trade secret, and patent laws, as well as entering into licensing, third-party nondisclosure and assignment agreements, and policing of third-party misuses of our intellectual property. Some of our products are sold under licensing arrangements with others, including our licensing arrangement with Dolly Parton and our licenses of the \nP.F. Chang\n’\ns\n®\n, \nBertolli\n®\n, \nWendy’s\n®\n, and \nLibby\n’\ns\n®\n trademarks. We also own certain intellectual property rights that are licensed to third parties, such as the \nAlexia\n®\n and \nMarie Callender’s\n®\n \ntrademarks. While many of these licensing arrangements are perpetual in nature, others must be periodically renegotiated or renewed pursuant to their terms. We also actively develop and maintain a portfolio of patents, although no single patent is considered material to the business as a whole. We have proprietary trade secrets, technology, know-how, processes, and other intellectual property rights that are not registered.\nGovernment Regulation\nThe manufacture and sale of consumer food is highly regulated. Our operations, our products, and our practices are subject to various federal, state, local, and international laws and regulations and related regulatory oversight by various government agencies, including the United States Department of Agriculture, the Federal Food and Drug Administration, the Federal Trade Commission, the Consumer Product Safety Commission, the Occupational Safety and Health Administration, the Environmental Protection Agency, the \n2\n\n\nTable of Contents\nDepartment of Labor, and various other federal, state, local, and international authorities (including government authorities in Canada and Mexico). In particular, the processing, packaging, transportation, storage, distribution, advertising, labeling, quality, and safety of food products, the health and safety of our employees, and the protection of the environment are each subject to governmental regulation. Additionally, we are subject to data privacy and security regulations, anticorruption, anti-bribery, trade sanction and export, tax, and securities laws and regulations, accounting and reporting standards, and other financial laws and regulations. We\n \nrely\n \non\n our procedures, policies, and \ncompliance\n \nprograms,\n \nas\n \nwell\n \nas\n legal advice from \nin-house\n \nand\n \noutside\n \ncounsel,\n to align our operations, products, and practices\n with applicable laws and regulations.  We believe that we are in compliance with such laws and regulations in all material respects and do not expect that continued compliance with such regulations will have a material effect upon capital expenditures, earnings, or our competitive position.\nCustomers\nOur products are sold, directly and through distributors, to chain, wholesale, value, cooperative, club, and independent grocery, pharmacy and drug, convenience and other store operators; and foodservice customers, including restaurants and bars, travel and leisure customers, schools, health care facilities, and government customers. Our products are also sold online through various e-commerce platforms and retailers. Our largest customer, Walmart, Inc. and its affiliates, accounted for approximately 29% of consolidated net sales for fiscal 2025 and 28% for fiscal 2024 and 2023.\nHuman Capital Resources\nAt Conagra, through our caring and performance-driven culture, we seek to motivate employees to contribute their best and to recognize and reward them based on their achievements and contributions toward our business success.  Leveraging diversity of thought, skills, and lived experiences helps us to maintain a competitive advantage and strengthens our portfolio and capabilities, fueling Conagra’s success today and in the future.  By taking this approach, we achieve a high sense of belonging, where all of our employees feel valued, respected, and supported. \nWe leverage our six timeless values, which form the framework of our Company culture, to guide our approach to human capital management:\n●\nIntegrity: Do the right things and do things right\n●\nExternal Focus: Center on the consumer, customer, competitor, and investor\n●\nBroad-Mindedness: Seek out and respect varied perspectives; embrace collaboration and assume positive intent\n●\nAgility: Convert insights into action with the speed of an entrepreneur\n●\nLeadership: Simplify, make decisions, inspire others, and act like an owner\n●\nResults: Leverage a “refuse-to-lose” obsession with impact and value creation\nAs of May 25, 2025, we had approximately 18,300 employees, primarily in the United States. Approximately 44% of our employees are parties to collective bargaining agreements. We believe our relationships with employees and their representative organizations are good.\nSafety and Health\nThe health and safety of our employees is our top priority. We are focused on maintaining a strong culture of safety, in which all employees strive to protect themselves and their colleagues by being proactive towards risk identification and mitigation for people and our food products. Our health and safety team audits each of our facilities every 2-5 years, depending on risk profile, to review compliance with Conagra’s safety management system. This audit includes examination of leadership, accountability, defect loss identification processes, inspections, training, safety regulation adherence and compliance with corporate policies. The team documents the audit results and tracks corrective actions to ensure progress and create accountability for providing a safe work environment. Any workplace injury, illness, or fatality (an “incident”), including any “significant near miss” or an incident with the potential to have resulted in workplace injury, illness or fatality, requires a thorough investigation to identify and address the root cause. \nDuring fiscal 2025, our Occupational Safety and Health Administration Incident Rate was 1.32 incidents per 100 full-time workers, as compared to 1.40 incidents per 100 full-time workers in fiscal 2024 and 1.58 incidents per 100 full-time workers in fiscal \n3\n\n\nTable of Contents\n2023. There were no incidents of fatalities involving Conagra employees in fiscal 2025, 2024, and 2023. We compare our incident rate to that of the average for companies in the food manufacturing sector, as published by the Bureau of Labor Statistics. In each of the last three fiscal years, our incident rate has been below the industry average.\nHuman Capital Management \nWe have implemented key recruitment, development, engagement, and retention strategies and objectives to guide our human capital management approach. These strategies and objectives are advanced through a number of programs, policies, and initiatives. \nRecruitment:\nWe believe Conagra offers one of the most impactful, energized and inclusive cultures in the food industry and provides a comprehensive employee experience for a long and prosperous career. \nOur team is driven by collaboration, innovation, and a desire to grow and we support our employees with the tools they need to succeed and thrive in their careers.\nConagra has made differential investments in our recruitment tools and our talent acquisition programs to help us continue to attract the right candidates.\n●\nWe utilize technology to enhance our recruiting efforts while also simplifying the application process for prospective candidates.\n●\nWe design our marketing materials to capture and communicate the employee value proposition Conagra offers.\n●\nWe maintain sufficient resources and utilize processes seeking to streamline recruiting and on-boarding at our manufacturing facilities.\n●\nWe leverage data and key metrics to drive priorities and strategically focus recruiting efforts and talent acquisition resources across the enterprise.\nDevelopment:\nThe Conagra Promise to our employees is to provide every employee with tools and programs to help them reach their full potential. By providing employees with growth opportunities, we empower them to build knowledge and skills and make an impact through their work at Conagra. We believe that by enabling employee growth and development, we better position Conagra to meet current and future business needs while driving employee retention.\nWe leverage a variety of tools and processes to promote a culture of employee learning and development at Conagra:\n●\nJob profiles are aligned to a Conagra-specific skills framework that defines and prioritizes the top skills desired for each role. Employees’ skills are assessed against the framework and the data is leveraged to provide tailored learning opportunities for each employee as well as drive programs to enhance organizational capabilities.\n●\nEmployees have access to numerous development opportunities, including functional development programs, on-demand learning content, and targeted leadership programs. Our cross-functional Opportunity Marketplace allows employees to become involved in initiatives beyond their day-to-day job responsibilities, providing on-the-job learning and opportunities for exploring their intellectual curiosity.\n●\nWe use multiple levers to promote a learning culture such as expecting leaders to consistently coach, teach and mentor colleagues across the organization and our “Invest in You” program that encourages employees to set aside at least one-hour per workweek focused on learning.\nEmployees also have access to coaching, feedback, and leadership support; employees are encouraged to establish mentoring relationships across the enterprise.\n4\n\n\nTable of Contents\nEngagement:\nWe believe our focus on broad-mindedness, one of our timeless values, fosters a culture of collaboration and engagement. We encourage our employees to engage with leaders, managers, and peers and to share their individual perspectives. We maintain a structured employee survey program to better understand employee engagement and how employees experience our culture.\nOur eight employee-led Employee Resource Groups (ERGs) contribute to an engaged and inclusive culture at Conagra. Our ERGs provide our employees with an opportunity to express their views, facilitate learning on cultural and business topics, and support our employees’ personal growth, professional development, and community impact. All of our ERGs are open to all salaried employees in the U.S. and, where indicated below, in Canada and Mexico. As of May 25, 2025, our ERGs and their stated goals consisted of:\n●\nASIAN ERG: Working to expand awareness through the celebration of Asian culture and heritage across Conagra.\n●\nBLACK ERG: Supporting the African American community through personal and professional development, community involvement, and supporting all aspects of Conagra’s mission, vision, and values.\n●\nDISABILITY + ALLY ERG: Seeking to lead with a cross-disability perspective and prioritizing the fulfillment of access needs of group members.\n●\nLATINX ERG: Striving to be a catalyst for Hispanic and Latinx professional development, business growth, and community impact.\n●\nLGBTQ+ ALLY ERG: Influencing, engaging, and promoting LGBTQ+ inclusion at Conagra – supporting a work environment where everyone can be comfortable bringing their full selves to work every day.\n●\nVETERANS ERG: Supporting, promoting, and assisting veterans in professional development and career growth at Conagra, while supporting Conagra’s initiatives that are directly related to veterans and the military.\n●\nWOMEN ERG: Empowering women professionally by supporting development opportunities, building strong networks and allyship across Conagra, giving back to the community, and advocating around issues that are impactful to women.  This ERG includes employees in the U.S., Canada, and Mexico.\n●\nYOUNG PROFESSIONALS ERG: Working to leverage their unique capabilities as engaged, enthusiastic, and business driven young professionals to strengthen Conagra’s culture and talent.  This ERG includes employees from the U.S. and Canada.\nCompensation, Benefits, and Wellness:\nWe offer competitive compensation and benefits to attract and retain the best talent and to support the overall well-being of our employees. Our compensation program, which includes equity-based compensation for our employees at director level and above, aims to align our leaders’ interest with our shareholders and is designed to incentivize strong company and individual performance.\nAdditionally, through our holistic approach to benefits and wellness, we provide our employees with resources to help them thrive. We offer a wide range of benefits across areas such as health, family, finance, community, and time away, including healthcare and wellness benefits such as employee assistance programs supporting mental health, adoption assistance, family care resources, a 401(k) plan, family leave, and paid time off.\n5\n\n\nTable of Contents\nInformation About Our Executive Officers\nThe names, ages, and positions of our executive officers, as of July 10, 2025, are listed below:\nName\n    \nTitle & Capacity\n    \nAge\n    \nYear First\nAppointed an\nExecutive\nOfficer\nSean M. Connolly\n​\nPresident and Chief Executive Officer\n​\n59\n​\n2015\nDavid S. Marberger\n​\nExecutive Vice President and Chief Financial Officer\n​\n60\n​\n2016\nCarey L. Bartell\n​\nExecutive Vice President, General Counsel and Corporate Secretary\n​\n51\n​\n2022\nCharisse Brock\n​\nExecutive Vice President, Chief Human Resources Officer\n​\n63\n​\n2015\nAlexandre O. Eboli\n​\nExecutive Vice President, Chief Supply Chain Officer\n​\n53\n​\n2021\nThomas M. McGough\n​\nExecutive Vice President and Chief Operating Officer\n​\n60\n​\n2013\nNoelle O’Mara\n​\nExecutive Vice President and President New Platforms and Acquisitions\n​\n46\n​\n2024\nWilliam E. Johnson\n​\nSenior Vice President and Corporate Controller\n​\n43\n​\n2023\n​\nSean M. Connolly has served as our President and Chief Executive Officer and a member of the Board since April 6, 2015. Prior to that, he served as President and Chief Executive Officer and a director of The Hillshire Brands Company (a branded food products company) from June 2012 to August 2014, Executive Vice President of Sara Lee Corporation (a branded food products company and the predecessor to Hillshire), and Chief Executive Officer, Sara Lee North American Retail and Foodservice, from January 2012 to June 2012. Prior to joining Sara Lee in anticipation of the spin-off of Hillshire, Mr. Connolly served as President of Campbell North America, the largest division of Campbell Soup Company (a branded food products company), from October 2010 to December 2011, President, Campbell USA from 2008 to 2010, and President, North American Foodservice for Campbell from 2007 to 2008. Before joining Campbell in 2002, he served in various marketing and brand management roles at The Procter & Gamble Company (a consumer packaged goods company).\nDavid S. Marberger has served as Executive Vice President and Chief Financial Officer since August 2016. Prior to joining Conagra Brands, he served as Chief Financial Officer of Prestige Brands Holdings, Inc. (a provider of over-the-counter healthcare products) from October 2015 until July 2016. Prior to that, Mr. Marberger served as the Senior Vice President and Chief Financial Officer of Godiva Chocolatier, Inc. (a global manufacturer and supplier of premium chocolates) from 2008 until October 2015. Prior to that, Mr. Marberger served Tasty Baking Company (a manufacturer and supplier of baked goods) as Executive Vice President and Chief Financial Officer from 2006 to 2008 and as Senior Vice President and Chief Financial Officer from 2003 to 2006. From 1993 until 2003, he served in various roles at Campbell Soup Company (a branded food products company), where he last held the position of Vice President, Finance, Food and Beverage Division.\nCarey L. Bartell has served as Executive Vice President, General Counsel and Corporate Secretary since June 2022. In this role, Ms. Bartell oversees all legal and governmental affairs activity for the company. Previously, Ms. Bartell served as Vice President and Chief Counsel leading the company’s litigation efforts and compliance programs. Ms. Bartell joined Conagra in 2016. Prior to Conagra, Ms. Bartell worked for eight years at Hospira, Inc., a global pharmaceutical and medical device company, as Senior Counsel and then Vice President, Legal. In this role, she oversaw the company’s litigation, labor, employment, and immigration law, and advised senior management and the board of directors regarding diverse legal and business risks. Ms. Bartell began her career in private practice at a Chicago law firm, first as an Associate and then Partner, where she practiced primarily in the areas of litigation and labor & employment law.\nCharisse Brock has served as Executive Vice President and Chief Human Resources Officer since November 2015 and previously served as Senior Vice President and Interim Chief Human Resources Officer from August 2015 until November 2015. Prior to serving in these roles, Ms. Brock served as Vice President of Human Resources for the Consumer Foods segment of Conagra Brands from September 2010 until August 2015. Ms. Brock joined Conagra Brands in 2004 as Director of Human Resources, supporting the Refrigerated Foods Group. Prior to joining Conagra Brands, she served for 15 years at The Quaker Oats Company (a branded food products company) (which was acquired by PepsiCo during her tenure) in its Consumer Foods Division.\nAlexandre “Ale” O. Eboli has served as Executive Vice President and Chief Supply Chain Officer for Conagra Brands since August 2021. Mr. Eboli has end-to-end supply chain responsibilities for the company, overseeing the manufacturing, procurement, environment, health and safety, plant quality, logistics, and transportation and warehousing teams. Mr. Eboli joined Conagra Brands with 25 years of experience of global end-to-end supply chain leadership within the consumer packaged goods industry and has held a variety of roles in finance, planning, distribution, logistics and manufacturing. Prior to Conagra, Mr. Eboli served as the Head of Supply Chain, North America for The Unilever Group, where he was responsible for overseeing manufacturing facilities and contract \n6\n\n\nTable of Contents\nmanufacturers producing personal care, food and ice cream products as well as the related planning, procurement, manufacturing, engineering, logistics, quality, manufacturing excellence and customer service functions.\nThomas M. McGough has served as Executive Vice President and Chief Operating Officer since May 2024. He served as the Company’s Executive Vice President and Co-Chief Operating Officer from October 2018 until May 2024; as the Company’s President, Operating Segments from May 2017 until October 2018 and as the Company’s President of Consumer Foods from May 2013 until May 2017. Mr. McGough also served as the Company’s President, Grocery Products from 2011 until May 2013 and as Vice President in the Company’s Consumer Foods organization from 2007 to 2011. Prior to joining the Company, he served in various roles at H.J. Heinz (a food processing company), where he began his career in 1990.\nNoelle O’Mara has served as Executive Vice President and President, New Platforms and Acquisitions since May 2024. Prior to joining Conagra, she served as Group President and Chief Marketing Officer at Tyson Foods, from August 2019 to November 2022, where she was responsible for their prepared foods business unit. Prior to joining Tyson in 2016, Ms. O'Mara spent over a decade at Kraft Foods Group leading various brands and portfolios.\nWilliam E. Johnson has served as Senior Vice President and Corporate Controller since June 2023. He joined the Company as Assistant Controller in September 2019 and, prior to that, he was Director of Internal Audit at Kiewit Corporation, a North American construction and engineering organization, from June 2018 to August 2019. Mr. Johnson began his career at KPMG, spending more than 12 years in positions of increasing responsibility from 2005 to 2018.\nForeign Operations\nForeign operations information is set forth in Note 20, \n“Business Segments and Related Information”\n, to the Consolidated Financial Statements contained in this report.\nAvailable Information\nWe make available, free of charge through the “Investors—Financial Reports & Filings” link on our website at http://www.conagrabrands.com, our annual report on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K, and amendments to those reports filed or furnished pursuant to Section 13(a) or 15(d) of the Securities Exchange Act of 1934, as amended, as soon as reasonably practicable after such material is electronically filed with or furnished to the Securities and Exchange Commission (the “SEC”). We use our website, through the “Investors” link, as a channel for routine distribution of important information, including news releases, presentations, and financial information. The information on our website is not, and will not be deemed to be, a part of this annual report on Form 10-K or incorporated into any of our other filings with the SEC.\nWe have also posted on our website our (1) Corporate Governance Principles, (2) Code of Conduct, (3) Code of Ethics for Senior Corporate Officers, and (4) Charters for the Audit/Finance Committee, Nominating and Corporate Governance Committee, and Human Resources Committee. Stockholders may also obtain copies of these items at no charge by writing to: Corporate Secretary, Conagra Brands, Inc., 222 Merchandise Mart Plaza, Suite 1300, Chicago, IL, 60654.",
  "item7": "ITEM 7. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe following discussion and analysis is intended to provide a summary of significant factors relevant to our financial performance and condition. The discussion and analysis should be read together with our consolidated financial statements and related notes in Item 8, Financial Statements and Supplementary Data. Results for the fiscal year ended May 25, 2025 are not necessarily indicative of results that may be attained in the future.\nFORWARD-LOOKING STATEMENTS\nThe information contained in this report includes forward-looking statements within the meaning of the federal securities laws. Examples of forward-looking statements include statements regarding our expected future financial performance or position, results of operations, business strategy, plans and objectives of management for future operations, and other statements that are not historical facts. You can identify forward-looking statements by their use of forward-looking words, such as “may”, “will”, “anticipate”, “expect”, “believe”, “estimate”, “intend”, “plan”, “should”, “seek”, or comparable terms.\nReaders of this report should understand that these forward-looking statements are not guarantees of performance or results. Forward-looking statements provide our current expectations and beliefs concerning future events and are subject to risks, uncertainties, and factors relating to our business and operations, all of which are difficult to predict and could cause our actual results to differ materially from the expectations expressed in or implied by such forward-looking statements. These risks, uncertainties, and factors include: risks associated with general economic and industry conditions, including inflation, reduced consumer confidence and spending, declining benefits or increased limitations under government food assistance programs for consumers, rising unemployment, recessions, increased energy costs, supply chain challenges, increased tariffs and taxes, labor cost increases or shortages, currency rate fluctuations, actual or threatened hostilities or war, and or other geopolitical conflicts; risks related to the availability and prices of commodities and other supply chain resources, including raw materials, packaging, energy, and transportation, weather conditions, health pandemics or outbreaks of disease, or other geopolitical uncertainty; disruptions or inefficiencies in our supply chain and/or operations; risks related to the effectiveness of our hedging activities and ability to respond to volatility in commodities; risks related to the ultimate impact of, including reputational harm caused by, any product recalls and product liability or labeling litigation, including litigation related to lead-based paint and pigment and cooking spray; risks related to our ability to execute operating and value creation plans and achieve returns on our investments and targeted operating efficiencies from cost-saving initiatives, and to benefit from trade optimization programs; risks related to our ability to deleverage on currently anticipated timelines, and to continue to access capital on acceptable terms or at all; risks related to the Company’s competitive environment, cost structure, and related market conditions; risks related to our ability to respond to changing consumer preferences including health and wellness perceptions and the success of our innovation and marketing investments; risks associated with actions by our customers, including changes in distribution and purchasing terms; risks related to the seasonality of our business; risks associated with our contract manufacturing arrangements and other third-party service provider dependencies; risks associated with actions of governments and regulatory bodies that affect our businesses, including the ultimate impact of new or revised regulations or interpretations including to address climate change; risks related to the Company’s ability to execute on its strategies or achieve expectations related to environmental, social, and governance matters, including as a result of evolving legal, regulatory, and other standards, processes, and assumptions, the pace of scientific and technological developments, increased costs, the availability of requisite financing, and changes in carbon pricing or carbon taxes; risks related to a material failure in or breach of our or our vendors’ information technology systems and other cybersecurity incidents; risks related to our ability to identify, attract, hire, train, retain and develop qualified personnel; risk of increased pension, labor or people-related expenses; risks and uncertainties associated with intangible assets, including any future goodwill or intangible assets impairment charges; risks relating to \n24\n\n\nTable of Contents\nour ability to protect our intellectual property rights; risks relating to acquisition, divestiture, joint venture or investment activities; the amount and timing of future dividends, which remain subject to Board approval and depend on market and other conditions; the amount and timing of future stock repurchases; and other risks described in our reports filed from time to time with the U.S. Securities and Exchange Commission (the “SEC”). We caution readers not to place undue reliance on any forward-looking statements included in this report, which speak only as of the date of this report. We undertake no responsibility to update these statements, except as required by law. \nThe discussion that follows should be read together with the consolidated financial statements and related notes contained in this report. Results for fiscal 2025 are not necessarily indicative of results that may be attained in the future.\nEXECUTIVE OVERVIEW\nConagra Brands, Inc. (the “Company”, “Conagra Brands”, “we”, “us”, or “our”), headquartered in Chicago, is one of North America’s leading branded food companies. \nWe combine a 100-year history of making quality food with agility and a relentless focus on collaboration and innovation. The company’s portfolio is continuously evolving to satisfy consumers’ ever-changing food preferences.\n Conagra’s brands include \nBirds Eye\n®\n, \nDuncan Hines\n®\n, \nHealthy Choice\n®\n, \nMarie Callender’s\n®\n, \nReddi-wip\n®\n, \nSlim Jim\n®\n, \nAngie’s\n®\n BOOMCHICKAPOP\n®\n, and many more.\nFiscal 2025 Results\nFiscal 2025 performance compared to fiscal 2024 reflected a decrease in net sales, with organic (excludes the impacts of foreign exchange, acquisitions, and divestitures) decreases in our Grocery & Snacks, Refrigerated & Frozen, and Foodservice segments, partially offset by an increase in our International segment. Overall gross profit decreased primarily as a result of lower net sales, input cost inflation, and unfavorable operating leverage, partially offset by productivity. Excluding items impacting comparability, overall segment operating profit decreased in all of our segments compared to the prior year. Corporate expenses and selling, general and administrative (“SG&A”) expenses were higher primarily due to items impacting comparability, as discussed below, partially offset by lower incentive compensation expense. We recognized higher equity method investment earnings, lower interest expense, and lower income tax expense, in each case compared to fiscal 2024. Excluding items impacting comparability, our effective tax rate was lower compared to fiscal 2024.\nDiluted earnings per share were $2.40 and $0.72 in fiscal 2025 and 2024, respectively. The increase in diluted earnings per share reflected higher net income. See \n“Items Impacting Comparability”\n below as several significant items affected the comparability of year-over-year results.\nTrends Impacting our Business\nOur industry continues to be impacted by shifting consumer behavior, commodity cost fluctuations, exchange rate volatility, labor cost inflation, input cost inflation, supply chain pressures, and other global macroeconomic challenges. Although rapidly changing trade policies and announcements of potential tariff increases caused increased uncertainty in the second half of fiscal 2025, we saw little impact to our results in fiscal 2025 due to delayed implementation or effect of the announced tariffs. Throughout fiscal 2025, we experienced an elevated amount of input cost inflation and negative impacts from foreign exchange rates, which we were able to partially offset through our on-going productivity initiatives. \nOur industry is anticipating increased supply chain challenges, commodity cost volatility, and consumer and economic uncertainty due to rapid changes in global trade policies including increasing or fluctuating tariffs. We expect inflation and tariffs to negatively impact our \ncosts of goods sold in fiscal 2026. We expect consumer trends to continue to evolve and our volumes to improve over time; however, in the near-term, we expect economic pressures on consumers, including the challenges of high inflation and the impact of increased or fluctuating tariffs, and related price increases, to continue to negatively impact our volumes throughout fiscal 2026. \nWe also expect foreign exchange rates to continue to negatively impact our earnings through fiscal 2026. \nWe will continue to evaluate the evolving macroeconomic environment to take action to mitigate the impact on our business, consolidated results of operations, and financial condition.\n25\n\n\nTable of Contents\nItems Impacting Comparability\nItems of note impacting comparability of results for fiscal 2025 included the following:\n●\nincome tax benefits of $253.5 million associated with the release of valuation allowances on certain deferred tax assets based primarily on interactions with the taxing authorities,\n●\ncharges totaling $101.7 million ($77.0 million after-tax) in connection with our restructuring plans,\n●\nnet charges totaling $88.7 million ($67.0 million after-tax) related to legacy legal matters,\n●\ncharges of $72.1 million ($55.4 million after-tax) related to the impairments of certain brand intangible assets,\n●\ncharges totaling $29.5 million ($24.4 million after-tax) primarily related to the impairment of a business held for sale,\n●\na gain of $17.0 million ($12.8 million after-tax) associated with insurance proceeds from the previous fire that occurred at one of our manufacturing facilities,\n●\na non-cash settlement gain of $13.0 million ($9.8 million after-tax) associated with a partial transfer of our U.S. defined benefit pension plan obligation to a third-party insurance provider through the purchase of an annuity contract, and\n●\ncharges of $7.2 million ($5.5 million after-tax) related to restructuring activities of the Ardent Mills joint venture.\nItems of note impacting comparability of results for fiscal 2024 included the following:\n●\ncharges totaling $956.7 million ($847.7 million after-tax) related to the impairments of goodwill and certain brand intangible assets,\n●\ncharges totaling $66.6 million ($49.9 million after-tax) in connection with our restructuring plans,\n●\ncharges totaling $36.4 million ($36.0 million after-tax) related to the impairment of a business held for sale,\n●\nnet charges totaling $34.8 million ($26.2 million after-tax) related to legacy legal matters,\n●\na benefit of $11.5 million ($8.7 million after-tax) related primarily to our year-end remeasurement of an hourly pension plan liability, and\n●\na net gain of $8.7 million ($6.6 million after-tax) primarily associated with insurance proceeds from the previous fire that occurred at one of our manufacturing facilities.\nSegment presentation of gains and losses from derivatives used for economic hedging of anticipated commodity input costs and economic hedging of foreign currency exchange rate risks of anticipated transactions are discussed in the segment review below.\nSEGMENT REVIEW\nWe reflect our results of operations in four reporting segments: Grocery & Snacks, Refrigerated & Frozen, International, and Foodservice.\nGrocery & Snacks\nThe Grocery & Snacks reporting segment principally includes branded, shelf-stable food products sold in various retail channels in the United States.\n26\n\n\nTable of Contents\nRefrigerated & Frozen\nThe Refrigerated & Frozen reporting segment principally includes branded, temperature-controlled food products sold in various retail channels in the United States.\nInternational\nThe International reporting segment principally includes branded food products, in various temperature states, sold in various retail and foodservice channels outside of the United States.\nFoodservice\nThe Foodservice reporting segment includes branded and customized food products, including meals, entrees, sauces, and a variety of custom-manufactured culinary products that are packaged for sale to restaurants and other foodservice establishments primarily in the United States.\nPresentation of Derivative Gains (Losses) from Economic Hedges of Forecasted Cash Flows in Segment Results\nDerivatives used to manage commodity price risk and foreign currency risk are not designated for hedge accounting treatment. We believe these derivatives provide economic hedges of certain forecasted transactions. As such, these derivatives are generally recognized at fair market value with realized and unrealized gains and losses recognized in general corporate expenses. The gains and losses are subsequently recognized in the operating results of the reporting segments in the period in which the underlying transaction being economically hedged is included in earnings. In the event that management determines a particular derivative entered into as an economic hedge of a forecasted commodity purchase has ceased to function as an economic hedge, we cease recognizing further gains and losses on such derivatives in corporate expense and begin recognizing such gains and losses within segment operating results, immediately. See Note 17, \n“Derivative Financial Instruments”\n, to the Consolidated Financial Statements contained in this report for further discussion.\nPresentation of Information\nBelow is a detailed discussion and comparison of our results of operations for the fiscal years ended May 25, 2025 and May 26, 2024. For a discussion of changes from the fiscal year ended May 28, 2023 to the fiscal year ended May 26, 2024, refer to Part II, Item 7, \nManagement\n’\ns Discussion and Analysis of Financial Condition and Results of Operations\n, of our Annual Report on Form 10-K for the fiscal year ended May 26, 2024 (filed July 11, 2024).\nFiscal 2025 compared to Fiscal 2024\nNet Sales\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n($ in millions)\n​\nFiscal 2025\n​\nFiscal 2024\n​\n% Inc\n​\nReporting Segment\n    \nNet Sales\n    \nNet Sales\n    \n(Dec)\n​\nGrocery & Snacks\n​\n$\n 4,899.3\n​\n$\n 4,958.7\n​\n(1.2)%\n​\nRefrigerated & Frozen\n​\n​\n 4,662.3\n​\n​\n 4,865.5\n​\n(4.2)%\n​\nInternational\n​\n​\n 956.5\n​\n​\n 1,078.3\n​\n(11.3)%\n​\nFoodservice\n​\n​\n 1,094.7\n​\n​\n 1,148.4\n​\n(4.7)%\n​\nTotal\n​\n$\n 11,612.8\n​\n$\n 12,050.9\n​\n(3.6)%\n​\n​\nNet sales for fiscal 2025 in our Grocery & Snacks segment included a decrease in organic volumes and price/mix of 1.1% and 0.9%, respectively, when compared to fiscal 2024. Price/mix was impacted by an increase in strategic trade investments. The acquisitions of Sweetwood Smoke & Co. in August 2024 and an existing contract manufacturer of our cooking spray products in July 2024 contributed $38.0 million to our Grocery & Snacks segment net sales during fiscal 2025. \nNet sales for fiscal 2025 in our Refrigerated & Frozen segment included a decrease in price/mix of 3.5% compared to fiscal 2024, primarily attributable to an increase in strategic trade investments. Volume decreased by 0.7% compared to fiscal 2024. During fiscal 2025, the largest impact to our volumes was a result of supply constraints impacting the company’s frozen meals containing chicken and frozen vegetable products. Additionally, we estimate that net sales during fiscal 2025 were impacted by approximately $24 million due to temporary manufacturing disruptions in our \nHebrew National\n® \nbusiness during the key grilling season.\n27\n\n\nTable of Contents\nNet sales for fiscal 2025 in our International segment reflected a 5.7% decrease due to unfavorable foreign exchange rates, a 3.9% increase in organic price/mix, and a 3.4% decrease in organic volume, in each case compared to fiscal 2024. The unfavorable foreign exchange rates were primarily due to the devaluation of the Mexican Peso relative to the US dollar. Fiscal 2025 and 2024 included $23.6 million and $93.2 million, respectively, of net sales related to our ownership stake in Agro Tech Foods Limited (“ATFL”), which was sold in the first quarter of fiscal 2025.\nNet sales for fiscal 2025 in our Foodservice segment included a decrease in organic volume of 8.1% compared to fiscal 2024, driven by the ongoing softness in restaurant traffic and the impact of lost business from the prior year. Organic price/mix increased by 3.3% compared to fiscal 2024, reflecting inflation-driven pricing. Additionally, we estimate that net sales in our Foodservice segment during fiscal 2025 were impacted by approximately $3 million due to the temporary manufacturing disruptions in our \nHebrew National\n® \nbusiness.\nSG&A Expenses (Includes general corporate expenses)\nSG&A expenses totaled $1.54 billion for fiscal 2025, an increase of $49.8 million compared to fiscal 2024. SG&A expenses for fiscal 2025 reflected the following:\nItems impacting comparability of earnings\n●\nnet charges of $91.1 million in connection with our restructuring plans and\n●\nnet charges totaling $88.7 million related to legacy legal matters.\nOther changes in expenses compared to fiscal 2024\n●\na decrease in short-term incentive expense of $43.9 million primarily due to a decrease in the estimated level of achievement of certain performance targets,\n●\na decrease in advertising and promotion expense of $26.4 million,\n●\nan increase in salary, wage, and fringe benefit expense of $18.4 million due to merit and employee insurance costs,\n●\na decrease in consulting and professional fees of $11.8 million, partially due to the implementation of a new enterprise resource planning software system in Mexico in the prior year, and\n●\nan increase in share-based payment expense of $10.5 million.\nSG&A expenses for fiscal 2024 included the following items impacting the comparability of earnings:\n●\nnet charges of $47.5 million in connection with our restructuring plans,\n●\nnet charges of $34.8 million related to legacy legal matters, and\n●\na net gain of $8.1 million primarily associated with insurance proceeds from the previous fire that occurred at one of our manufacturing facilities.\nSegment Operating Profit\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n($ in millions)\n​\nFiscal 2025\n​\nFiscal 2024\n​\n% Inc\n​\nReporting Segment\n    \nOperating Profit\n    \nOperating Profit\n    \n(Dec)\n​\nGrocery & Snacks\n​\n$\n  1,017.0\n​\n$\n  1,100.3\n​\n(7.6)%\n​\nRefrigerated & Frozen\n​\n​\n  651.7\n​\n​\n  815.9\n​\n(20.1)%\n​\nInternational\n​\n​\n  143.9\n​\n​\n  155.1\n​\n(7.1)%\n​\nFoodservice\n​\n​\n  131.0\n​\n​\n  151.3\n​\n(13.4)%\n​\n​\nSegment operating profit in our Grocery & Snacks segment for fiscal 2025 reflected a decrease in gross profits of $86.6 million compared to fiscal 2024. The decrease in gross profit was driven by the decrease in net sales discussed above, the impacts of input cost \n28\n\n\nTable of Contents\ninflation, and unfavorable operating leverage, partially offset by productivity. In addition, we recognized a benefit of $11.3 million and $14.4 million in fiscal 2025 and 2024, respectively, related to insurance proceeds for lost sales from our fiscal 2023 brand recall on \nArmour Star\n®\n. The decrease in gross profits was partially offset by lower SG&A expenses compared to fiscal 2024.  \nSegment operating profit in our Refrigerated & Frozen segment for fiscal 2025 reflected a decrease in gross profits of $211.3 million compared to fiscal 2024. The decrease was driven by the net sales decline discussed above, impacts of input cost inflation, and unfavorable operating leverage, partially offset by productivity. In fiscal 2025, we also experienced manufacturing challenges at the primary facility that prepares and cooks chicken used in our frozen meals. This resulted in increased product costs from utilizing third-party manufacturers, as well as abnormal inventory costs while we temporarily stopped production. In addition, we estimate that gross profits during fiscal 2025 were negatively impacted by approximately $10 million, primarily due to lost profits, abnormal manufacturing variances, and certain inventory write-offs resulting from the temporary manufacturing disruptions in our \nHebrew National\n® \nbusiness. The decrease in gross profits was partially offset by lower SG&A expenses compared to fiscal 2024, which included a decrease of $20.9 million in advertising and promotion expenses.\nSegment operating profit in our International segment for fiscal 2025 reflected a decrease in gross profits of $29.9 million compared to fiscal 2024. The decrease was driven by a reduction in profit associated with the sale of our ownership stake in ATFL, the impacts of input cost inflation, and unfavorable foreign exchange rates, partially offset by productivity. The decrease in gross profits was partially offset by lower SG&A expenses, including a decrease of $5.1 million in advertising and promotion expenses due primarily to the sale of our ownership stake in ATFL.\nSegment operating profit in our Foodservice segment for fiscal 2025 reflected a decrease in gross profits of $19.1 million compared to fiscal 2024. The decrease in gross profits was driven by the net sales declines discussed above, the impacts of input cost inflation, and unfavorable operating leverage, partially offset by productivity. \nPension and Postretirement Non-service Income\nIn fiscal 2025, pension and postretirement non-service income was $25.9 million, an increase of $15.6 million compared to fiscal 2024. Fiscal 2025 reflected lower interest costs and a non-cash settlement gain of $13.0 million associated with a partial transfer of our U.S. defined benefit pension plan obligation to a third-party insurance provider through the purchase of an annuity contract. Fiscal 2024 included a benefit of $11.5 million related primarily to our annual remeasurement of an hourly pension plan liability.\nInterest Expense, Net\nIn fiscal 2025, net interest expense was $416.7 million, a decrease of $13.8 million, or 3.2%, from fiscal 2024. The decrease was driven by an overall reduction of our debt balances. See Note 4, \n“Long-Term Debt”\n, to the Consolidated Financial Statements contained in this report for further discussion.\nEquity Method Investment Earnings\nWe include our share of the earnings of certain affiliates based on our economic ownership interest in the affiliates. Our most significant affiliate is the Ardent Mills joint venture. Our share of earnings from our equity method investment earnings were $182.4 million and $177.6 million for fiscal 2025 and 2024, respectively. Ardent Mills earnings for fiscal 2025 reflected improved commodity revenue, partially offset by continued lower volume trends as seen throughout the industry. Results for fiscal 2025 included charges of $7.2 million related to Ardent Mills restructuring activities.\nIncome Taxes\nOur income tax expense was $3.7 million and $262.5 million in fiscal 2025 and 2024, respectively. The decrease in our income tax expense was principally related to a release of a valuation allowance from a federal audit settlement that gave rise to a $225.8 million tax benefit in fiscal 2025. The effective tax rate (calculated as the ratio of income tax expense to pre-tax income, inclusive of equity method investment earnings) was approximately 0.3% and 43.0% for fiscal 2025 and 2024, respectively. See Note 14, \n“Pre-Tax Income and Income Taxes”\n, to the Consolidated Financial Statements contained in this report for a further discussion on the change in effective tax rates.\nWe expect our effective tax rate in fiscal 2026, exclusive of any unusual transactions or tax events, to be approximately 23%.\n29\n\n\nTable of Contents\nEarnings Per Share\nDiluted earnings per share in fiscal 2025 and 2024 were $2.40 and $0.72, respectively. The increase in diluted earnings per share reflected higher net income. See \n“Items Impacting Comparability”\n above as several significant items affected the comparability of year-over-year results of operations.\nLIQUIDITY AND CAPITAL RESOURCES\nSources of Liquidity and Capital\nThe primary objective of our financing strategy is to maintain a prudent capital structure that provides us flexibility to pursue our growth objectives. We use a combination of equity and short- and long-term debt. We use short-term debt principally to finance ongoing operations, including our seasonal requirements for working capital (accounts receivable, prepaid expenses and other current assets, and inventories, less accounts and other payables, accrued payroll, and other accrued liabilities). We strive to maintain solid investment grade credit ratings.\nManagement believes that existing cash balances, cash flows from operations, existing credit facilities, our commercial paper program, and access to capital markets will provide sufficient liquidity to meet our debt obligations, including any repayment of debt or refinancing of debt, working capital needs, planned capital expenditures, other contractual obligations, and payment of anticipated quarterly dividends for at least the next twelve months and the foreseeable future thereafter.\nBorrowing Facilities and Long-Term Debt\nAt May 25, 2025, we had a revolving credit facility (the “Revolving Credit Facility”) with a syndicate of financial institutions providing for a maximum aggregate principal amount outstanding at any one time of $2.0 billion (subject to increase to a maximum aggregate principal amount of $2.5 billion with the consent of the lenders). The Revolving Credit Facility matures on August 26, 2027 and is unsecured. The Company may request the term of the Revolving Credit Facility be extended for additional one-year or two-year periods from the then-applicable maturity date on an annual basis. We have historically used a credit facility principally as a back-up for our commercial paper program. As of May 25, 2025, there were no outstanding borrowings under the Revolving Credit Facility. On June 27, 2025, subsequent to our fiscal year end, we terminated and replaced our existing revolving credit facility by entering into an amendment which extends the maturity date to June 27, 2030. \nWe had $259.0 million outstanding under our commercial paper program as of May 25, 2025 and $586.0 million outstanding as of May 26, 2024. The highest level of borrowings during fiscal 2025 was $1.0 billion.\nDuring the fourth quarter of fiscal 2025, we entered into an unsecured Term Loan with a financial institution and borrowed the full principal amount, $200.0 million, available thereunder (the “2025 Term Loan”). The net proceeds were used to repay outstanding borrowings under our commercial paper program. On June 4, 2025, subsequent to our fiscal year end, we repaid $100.0 million of the $200.0 million aggregate principal amount outstanding under the 2025 Term Loan with a portion of the proceeds received in connection with the sale of our \nChef Boyardee\n®\n business. The 2025 Term Loan matures on October 29, 2025.\nDuring the fourth quarter of fiscal 2024, we entered into an unsecured Term Loan with a financial institution and borrowed the full principal amount, $300.0 million, available thereunder (the “2024 Term Loan”). During the fourth quarter of fiscal 2025, we entered into a letter agreement extending the maturity date of the 2024 Term Loan to October 29, 2025. On June 4, 2025, subsequent to our fiscal year end, we repaid $150.0 million of the $300.0 million aggregate principal amount outstanding under the 2024 Term Loan with a portion of the proceeds received in connection with the sale of our \nChef Boyardee\n®\n business.\nDuring the second quarter of fiscal 2025, we repaid the remaining $250.0 million aggregate principal amount outstanding under our unsecured Term Loan Agreement, dated August 26, 2023 (the “2023 Term Loan”). The repayment was primarily funded by operating cash flows.\nSee Note 4, \n“Long-Term Debt” \nand Note 5,\n “Credit Facilities and Borrowings”\n, to the Consolidated Financial Statements contained in this report for additional information on our debt transactions. The weighted-average coupon interest rate of the long-term debt obligations outstanding as of May 25, 2025, was approximately 4.9%.\nWe expect to maintain or have access to sufficient liquidity to retire or refinance long-term debt at maturity or otherwise, from operating cash flows, our commercial paper program, access to the capital markets, and our Revolving Credit Facility. \nWe have $1.0 \n30\n\n\nTable of Contents\nbillion aggregate principal amount of 4.6% senior notes maturing in November 2025 that we expect to pay and/or refinance using available sources which may include the investment grade note market, bank loans, commercial paper, and cash on hand. \nWe continuously evaluate opportunities to refinance our debt; however, any refinancing is subject to market conditions and other factors, including financing options that may be available to us from time to time, and there can be no assurance that we will be able to successfully refinance any debt on commercially acceptable terms at all.\nAs of the end of fiscal 2025, our senior long-term debt ratings were all investment grade. A significant downgrade in our credit ratings would not affect our ability to borrow amounts under the Revolving Credit Facility, although borrowing costs would increase. A downgrade of our short-term credit ratings would impact our ability to borrow under our commercial paper program by negatively impacting borrowing costs and causing shorter durations, as well as making access to commercial paper more difficult, or impossible.\nOur most restrictive debt agreement (the Revolving Credit Facility) generally requires our ratio of earnings before interest, taxes, depreciation and amortization (“EBITDA”) to interest expense not be less than 3.0 to 1.0 and our ratio of funded debt to EBITDA not to exceed 4.5 to 1.0. Each ratio is to be calculated on a rolling four-quarter basis. As of May 25, 2025, we were in compliance with all financial covenants.\nEquity and Dividends\nWe repurchase shares of our common stock from time to time after considering market conditions and in accordance with repurchase limits authorized by our Board. Under our current share repurchase authorization, we may repurchase our shares periodically over several years, depending on market conditions and other factors, and may do so in open market purchases or privately negotiated transactions. The share repurchase authorization has no expiration date. During fiscal 2025, we repurchased 2.1 million shares of our common stock under this authorization for an aggregate of $64.0 million. The Company’s total remaining share repurchase authorization as of May 25, 2025 was $852.6 million.\nOn April 2, 2025, we announced that our Board had authorized a quarterly dividend payment of $0.35 per share, which was paid on May 29, 2025, to stockholders of record as of the close of business on April 28, 2025. Subsequent to our fiscal year end, on July 9, 2025, we announced that our Board had authorized a quarterly dividend of $0.35 per share to be paid on August 28, 2025 to stockholders of record as of the close of business on July 30, 2025. \nContractual Obligations\nAs part of our ongoing operations, we enter into contractual arrangements that obligate us to make future cash payments. These obligations impact our liquidity and capital resource needs. In addition to principal and interest payments on our outstanding long-term debt and notes payable balances, discussed above, our contractual obligations primarily consist of lease payments, income taxes, pension and postretirement benefits, and unconditional purchase obligations.\nA summary of our operating and finance lease obligations as of May 25, 2025 can be found in Note 15, \n“Leases”\n, to the Consolidated Financial Statements contained in this report.\nThe liability for gross unrecognized tax benefits related to uncertain tax positions was $11.0 million as of May 25, 2025. See Note 14, \n“Pre-Tax Income and Income Taxes”\n, to the Consolidated Financial Statements contained in this report for information related to income taxes.\nAs of May 25, 2025, we had an aggregate funded pension asset of $253.0 million and an aggregate unfunded postretirement benefit obligation totaling $48.3 million. We expect to make payments totaling approximately $11.0 million and $6.6 million in fiscal 2026 to fund our pension and postretirement plans, respectively. See Note 18, \n“Pension and Postretirement Benefits”\n, to the Consolidated Financial Statements and \n“Critical Accounting Estimates – Employee-Related Benefits”\n contained in this report for further discussion of our pension obligation and factors that could affect estimates of these obligations.\nAs of May 25, 2025, our unconditional purchase obligations (i.e., obligations to transfer funds in the future for fixed or minimum quantities of goods or services at fixed or minimum prices, such as “take-or-pay” contracts) totaled approximately $2.89 billion. Approximately $1.73 billion of this balance is due in fiscal 2026. Included in this amount are open purchase orders and other supply agreements totaling approximately $1.37 billion, which are generally settleable in the ordinary course of business in less than one year. Warehousing service agreements totaling approximately $916 million make up a majority of our remaining unconditional purchase obligations with various terms of up to 10 years.\n31\n\n\nTable of Contents\nWe expect to have sufficient cash flows from the above cited sources to meet the material cash requirements of these contractual obligations as they become settleable in the ordinary course of business.\nCapital Expenditures\nWe continue to make investments in our business and operating facilities. Our preliminary estimate of capital expenditures for fiscal 2026 is approximately $450 million.\nCash Flows\nIn fiscal 2025, we used $11.0 million of cash, which was the net result of $1.69 billion generated from operating activities, $542.2 million used in investing activities, $1.16 billion used in financing activities, and a decrease of $2.4 million due to the effects of changes in foreign currency exchange rates.\nCash generated from operating activities totaled $1.69 billion in fiscal 2025, as compared to $2.02 billion generated in fiscal 2024. The decrease in operating cash flows for fiscal 2025 compared to fiscal 2024 was primarily driven by lower operating profits, lower dividend payments received from one of our equity method investments, and higher inventory balances. These decreases were partially offset by the accelerated receipt of our outstanding receivables in exchange for a slightly higher prompt pay discount, which increased our cash flow from operations by approximately $140 million. Operating cash flows in fiscal 2025 also benefited from lower tax payments as a result of lower taxable income and recent interactions with the U.S. Internal Revenue Service (“IRS”) allowing for additional tax deductions. \nCash used in investing activities totaled $542.2 million in fiscal 2025 compared to $375.0 million in fiscal 2024. Investing activities in fiscal 2025 consisted primarily of capital expenditures totaling $389.3 million, and the purchases of an existing contract manufacturer and Sweetwood Smoke & Co. for a total of $230.6 million, net of cash acquired, which were partially offset by net proceeds totaling $76.8 million from the sale of our ownership stake in ATFL. Investing activities in fiscal 2024 consisted primarily of capital expenditures totaling $388.1 million.\nCash used in financing activities totaled $1.16 billion in fiscal 2025 compared to $1.66 billion in fiscal 2024. Financing activities in fiscal 2025 principally reflected repayments of long-term debt of $281.3 million, net short-term borrowing repayments of $125.6 million, cash dividends paid of $669.2 million, and common stock repurchases of $64.0 million. Financing activities in fiscal 2024 principally reflected repayments of long-term debt of $1.77 billion, the issuance of long-term debt totaling $500.0 million, net short-term borrowing issuances of $290.6 million, and cash dividends paid of $659.3 million.\nCash Held by International Subsidiaries\nThe Company had cash and cash equivalents of $68.0 million at May 25, 2025 and $77.7 million at May 26, 2024, of which $61.6 million at May 25, 2025 and $66.7 million at May 26, 2024 was held in foreign countries. A deferred tax liability is provided for certain undistributed foreign earnings that are not considered to be indefinitely reinvested or cannot be remitted in a tax-neutral transaction. Other undistributed foreign earnings are invested indefinitely and therefore we have not provided deferred taxes on those earnings.\nCRITICAL ACCOUNTING ESTIMATES\nThe process of preparing financial statements requires the use of estimates on the part of management. The estimates used by management are based on our historical experiences combined with management’s understanding of current facts and circumstances. Certain of our accounting estimates are considered critical as they are both important to the portrayal of our financial condition and results and require significant or complex judgment on the part of management. The following is a summary of certain accounting estimates considered critical by management.\nOur Audit/Finance Committee has reviewed management’s development, selection, and disclosure of the critical accounting estimates.\nMarketing Costs\n—We offer various forms of advertising, trade promotions, and consumer incentives which are primarily recorded as a reduction in revenue. Advertising costs are expensed as incurred and recorded in SG&A expenses. \n32\n\n\nTable of Contents\nThe methodologies for determining trade promotions and consumer incentives are dependent on local customer pricing practices, which range from contractually fixed percentage price reductions to provisions based on actual occurrence or performance. Our promotional activities are conducted either through the retail trade or directly with consumers and include activities such as in-store displays and events, feature price discounts, consumer coupons, and loyalty programs. The costs of these activities are recognized as a reduction of revenue at the time the related revenue is recorded, which normally precedes the actual cash expenditure. The recognition of these costs therefore requires management judgment regarding the volume of promotional offers that will be redeemed by either the retail trade or consumer. These estimates are made using various techniques including historical data on performance of similar promotional programs. Differences between estimated expense and actual redemptions are recognized as a change in management estimate in a subsequent period.\nWe have recognized trade promotion and advertising liabilities of $131.5 million as of May 25, 2025. Changes in the assumptions used in estimating the cost of any individual customer marketing program would not result in a material change in our results of operations or cash flows.\nIncome Taxes\n—Our income tax expense is based on our income, statutory tax rates, and tax planning opportunities available in the various jurisdictions in which we operate. Tax laws are complex and subject to different interpretations by the taxpayer and respective governmental taxing authorities. Significant judgment is required in determining our income tax expense and in evaluating our tax positions, including evaluating uncertainties. Management reviews tax positions at least quarterly and adjusts the balances as new information becomes available. Deferred income tax assets represent amounts available to reduce income taxes payable on taxable income in future years. Such assets arise because of temporary differences between the tax bases of assets and liabilities and their carrying amounts in our consolidated balance sheets, as well as from net operating loss and tax credit carryforwards. Management evaluates the recoverability of these future tax deductions by assessing the adequacy of future expected taxable income from all sources, including reversal of taxable temporary differences, forecasted operating earnings, and available tax planning strategies. These estimates of future taxable income inherently require significant judgment. Management uses historical experience and short and long-range business forecasts to develop such estimates. Further, we employ various prudent and feasible tax planning strategies to facilitate the recoverability of future deductions. To the extent management does not consider it more likely than not that a deferred tax asset will be recovered, a valuation allowance is established.\nFurther information on income taxes is provided in Note 14, \n“Pre-tax Income and Income Taxes”\n, to the Consolidated Financial Statements contained in this report.\nEmployee-Related Benefits\n—We incur certain employment-related expenses associated with our pension plans. In order to measure the annual expense associated with these pension benefits, management must make a variety of estimates including discount rates used to measure the present value of certain liabilities, assumed rates of return on assets set aside to fund these expenses, and anticipated mortality rates. The estimates used by management are based on our historical experience as well as current facts and circumstances. We use third-party specialists to assist management in appropriately measuring the expense associated with these pension benefits. Different estimates used by management could result in us recognizing different amounts of expense over different periods of time.\nThe Company uses a split discount rate (the “spot-rate approach”) for the U.S. plans and certain foreign plans. The spot-rate approach applies separate discount rates for each projected benefit payment in the calculation of pension service and interest cost.\nWe have recognized a pension liability of $89.8 million and $95.9 million as of the end of fiscal 2025 and 2024, respectively. We also have recognized a pension asset of $342.8 million and $260.1 million as of the end of fiscal 2025 and 2024, respectively, as certain individual plans of the Company had a positive funded status.\nWe recognize cumulative changes in the fair value of pension plan assets and net actuarial gains or losses in excess of 10% of the greater of the fair value of plan assets or the plan’s projected benefit obligation (“the corridor”) in current period expense annually as of our measurement date, which is our fiscal year-end, or when measurement is required otherwise under accounting principles generally accepted in the United States of America.\nWe recognized a pension benefit from Company plans of $19.6 million, $0.6 million, and $13.9 million in fiscal 2025, 2024, and 2023, respectively. Such amounts reflect the year-end write-off of actuarial losses (gains) in excess of 10% of our pension liability of $(3.5) million, $(12.5) million, and $0.1 million in fiscal 2025, 2024, and 2023, respectively. This also reflected expected returns on plan assets of $146.3 million, $141.3 million, and $145.9 million in fiscal 2025, 2024, and 2023, respectively. We contributed $11.9 million, $12.2 million, and $12.5 million to our pension plans in fiscal 2025, 2024, and 2023, respectively. We anticipate contributing approximately $11.0 million to our pension plans in fiscal 2026.\n33\n\n\nTable of Contents\nOne significant assumption for pension plan accounting is the discount rate. We use a spot-rate approach, discussed above. This approach focuses on measuring the service cost and interest cost components of net periodic benefit cost by using individual spot rates derived from a high-quality corporate bond yield curve and matched with separate cash flows for each future year instead of a single weighted-average discount rate approach.\nBased on this information, the weighted-average discount rate selected by us for determination of the interest cost component of our pension expense was 5.51% for fiscal 2025, 5.41% for fiscal 2024, and 4.09% for fiscal 2023. The weighted-average discount rate selected by us for determination of the service cost component of our pension expense was 5.72% for fiscal 2025, 5.60% for fiscal 2024, and 4.74% for fiscal 2023. We selected a weighted-average discount rate of 6.17% and 5.41% for determination of service and interest expense, respectively, for fiscal 2026. A 50-basis point increase in our discount rate assumption as of the end of fiscal 2025 would increase our annual pension expense for our pension plans by $3.2 million. A 50-basis point decrease in our discount rate assumption as of the end of fiscal 2025 would decrease our annual pension expense for our pension plans by $3.6 million. For our year-end pension obligation determination, we selected discount rates of 5.91% and 5.58% for fiscal years 2025 and 2024, respectively.\nAnother significant assumption used to account for our pension plans is the expected long-term rate of return on plan assets. In developing the assumed long-term rate of return on plan assets for determining pension expense, we consider long-term historical returns (arithmetic average) of the plan’s investments, the asset allocation among types of investments, estimated long-term returns by investment type from external sources, and the current economic environment. Based on this information, we selected a weighted-average expected long-term rate of return on plan assets of 5.53% and 5.89% for determining our fiscal 2025 and 2026 pension expense, respectively. A 50-basis point increase/decrease in our expected long-term rate of return assumption as of the beginning of fiscal 2026 would decrease/increase annual pension expense for our pension plans by $9.4 million.\nBusiness Combinations, Impairment of Long-Lived Assets (including property, plant and equipment), Identifiable Intangible Assets, and Goodwill\n—We use the acquisition method in accounting for acquired businesses. Under the acquisition method, our financial statements reflect the operations of an acquired business starting from the closing of the acquisition. The assets acquired and liabilities assumed are recorded at their respective estimated fair values at the date of the acquisition. Any excess of the purchase price over the estimated fair values of the identifiable net assets acquired is recorded as goodwill. Significant judgment is often required in estimating the fair value of assets acquired, particularly intangible assets. As a result, in the case of significant acquisitions we normally obtain the assistance of a third-party valuation specialist in estimating fair values of tangible and intangible assets. The fair value estimates are based on available historical information and on expectations and assumptions about the future, considering the perspective of marketplace participants. While management believes those expectations and assumptions are reasonable, they are inherently uncertain. Unanticipated market or macroeconomic events and circumstances may occur, which could affect the accuracy or validity of the estimates and assumptions.\nWe reduce the carrying amounts of long-lived assets to their fair values when their carrying amount is determined to not be recoverable. We generally compare undiscounted estimated future cash flows of an asset or asset group to the carrying values of the asset or asset group for property, plant and equipment. If the undiscounted estimated future cash flows exceed the carrying values of the asset or asset group, no impairment is recognized. If the undiscounted estimated future cash flows are less than the carrying values of the asset or asset group, we write-down the asset or assets to their estimated fair values. The estimates of fair value are generally in the form of appraisal, or by discounting estimated future cash flows of the asset or asset group.\nDetermining the useful lives of intangible assets also requires management judgment. Certain brand intangibles are expected to have indefinite lives based on their history and our plans to continue to support and build the acquired brands, while other acquired intangible assets (e.g., customer relationships) are expected to have determinable useful lives. Our estimates of the useful lives of definite-lived intangible assets are primarily based upon historical experience, the competitive and macroeconomic environment, and our operating plans. The costs of definite-lived intangibles are amortized to expense over their estimated life.\nWe reduce the carrying amounts of indefinite-lived intangible assets, and goodwill to their fair values when the fair value of such assets is determined to be less than their carrying amounts (i.e., assets are deemed to be impaired). Fair value is estimated using a “relief from royalty” methodology for our indefinite-lived intangible assets and is typically estimated using a discounted cash flow method for our goodwill, which requires us to estimate the future cash flows anticipated to be generated by the particular reporting unit being tested for impairment as well as to select a discount rate to measure the present value of the anticipated cash flows. In certain circumstances, we also utilize a guideline public company method which is based on market multiples and our estimated EBITDA that considers public companies that are comparable to our reporting units. When determining future cash flow estimates under the guideline public company method or discounted cash flow method, we consider historical results adjusted to reflect current and anticipated operating conditions. Estimating future cash flows requires significant judgment by management in such areas as future economic conditions, industry-specific conditions, product pricing, and necessary capital expenditures. The use of different assumptions or \n34\n\n\nTable of Contents\nestimates for selected EBITDA multiples and future cash flows could produce different impairment amounts (or none at all) for goodwill and indefinite-lived intangible assets. For further information on our indefinite-lived intangible assets and goodwill, see Note 1, “\nSummary of Significant Accounting Policies\n”, to the Consolidated Financial Statements contained in this report.\nAs of May 25, 2025, we have goodwill of $10.50 billion, indefinite-lived intangibles of $1.80 billion and definite-lived intangibles of $620.6 million. Historically, we have experienced material impairments in brand intangibles and goodwill as a result of declining sales, reductions to our assumed royalty rates due to lower-than-expected profit margins, and other economic conditions such as increases to interest rates. \nIn fiscal 2025, 2024, and 2023, we recorded total indefinite-lived intangibles impairments of $72.1 million, $430.2 million, and $589.2 million, respectively, primarily related to brands acquired as part of the Pinnacle acquisition that were recorded at fair value in fiscal 2019. We continue to be susceptible to impairment charges in the future if our long-term sales forecasts, royalty rates, and other assumptions change as a result of lower than expected performance or other economic conditions. We will monitor these assumptions as management continues to achieve gross margin improvement and long-term sales growth. Discount rates, long-term growth rates, and royalty rates used to estimate the fair value of our domestic retail brands with 10% or less excess fair value over carrying amount as of the fiscal 2025 annual impairment test were as follows:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nDiscount Rate\n​\n​\nLong-Term Growth Rate\n​\nRoyalty Rate\n​\n​\nCarrying Amount\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n    \n (in billions)\n    \n​\nMinimum\n    \n​\nMaximum\n    \n​\nMinimum\n    \n​\nMaximum\n    \nMinimum\n    \nMaximum\nBrands (<10% cushion)\n​\n$\n 1.1\n​\n​\n8.25%\n​\n​\n12.50%\n​\n​\n0.0%\n​\n​\n2.0%\n​\n1.0%\n​\n11.0%\n​\nAssumptions used in impairment testing are made at a point in time and require significant judgment; therefore, they are subject to change based upon the facts and circumstances present at each annual impairment test date. Additionally, these assumptions are generally interdependent and do not change in isolation. However, as it is reasonably possible that changes in assumptions could occur, as a sensitivity measure, we have presented the estimated effects of isolated changes in discount rates, long-term growth rates, and royalty rates on the fair value of our reporting unit and brands with 10% or less excess fair value over carrying amount. These estimated changes in fair value are not necessarily representative of the actual impairment that would be recorded in the event of a fair value decline.\nIf we had changed the assumptions used to estimate the fair value of our brands with 10% or less excess fair value over carrying amount as of the fiscal 2025 annual impairment test, these isolated changes, which are reasonably possible to occur, would have led to the following increase/(decrease) in the aggregate fair value of certain brands (in millions):\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nDiscount Rate\n​\nLong-Term Growth Rate\n​\nRoyalty Rate\n​\n​\n​\n​\n​\n50-Basis-Point\n​\n25-Basis-Point\n​\n100-Basis-Point\n​\n​\n​\n​\n    \nIncrease\n    \nDecrease\n    \nIncrease\n    \nDecrease\n    \nIncrease\n    \nDecrease\nBrands (<10% cushion)\n​\n​\n​\n​\n​\n (70.9)\n​\n​\n 81.1\n​\n​\n 28.4\n​\n​\n (23.5)\n​\n 253.5\n​\n (247.9)\n​\n​\n​\n​\nRECENTLY ISSUED ACCOUNTING PRONOUNCEMENTS\nIn December 2023, the FASB issued ASU 2023-09, \nImprovements to Income Tax Disclosures\n, to provide more detailed income tax disclosure requirements. The guidance requires entities to disclose disaggregated information about their effective tax rate reconciliation as well as information on income taxes paid. The disclosure requirements will be applied on a prospective basis, with the option to apply it retrospectively. The effective date for the standard is for fiscal years beginning after December 15, 2024. Early adoption is permitted. We are in the process of analyzing the impact of the ASU on our related disclosures. We will adopt this guidance in the fourth quarter of fiscal 2026, when it becomes effective.\nIn November 2024, the FASB issued ASU 2024-03, \nDisaggregation of Income Statement Expenses\n, to provide disaggregated disclosures of specific expense categories underlying certain income statement expense line items on an annual and interim basis. The disclosure requirements will be applied on a prospective basis, with the option to apply it retrospectively. The effective date for the standard is for fiscal years beginning after December 15, 2026 and interim periods within fiscal years beginning after December 15, 2027. Early adoption is permitted. We are in the process of analyzing the impact of the ASU on our related disclosures.",
  "item2": null
}