{
  "source_file": "tmb-20250824x10q.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "ITEM 2. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nFORWARD-LOOKING STATEMENTS\nThe information contained in this report includes forward-looking statements within the meaning of the federal securities laws. Examples of forward-looking statements include statements regarding our expected future financial performance or position, results of operations, business strategy, plans and objectives of management for future operations, and other statements that are not historical facts. You can identify forward-looking statements by their use of forward-looking words, such as “may”, “will”, “anticipate”, “expect”, “believe”, “estimate”, “intend”, “plan”, “should”, “seek”, or comparable terms.\nReaders of this report should understand that these forward-looking statements are not guarantees of performance or results. Forward-looking statements provide our current expectations and beliefs concerning future events and are subject to risks, uncertainties, and factors relating to our business and operations, all of which are difficult to predict and could cause our actual results to differ materially from the expectations expressed in or implied by such forward-looking statements. These risks, uncertainties, and factors include: risks associated with general economic and industry conditions, including inflation, reduced consumer confidence and spending, declining benefits or increased limitations under government food assistance programs for consumers, rising unemployment, recessions, increased energy costs, supply chain challenges, increased tariffs and taxes, labor cost increases or shortages, currency rate fluctuations, actual or threatened hostilities or war, and or other geopolitical conflicts; risks related to the availability and prices of commodities and other supply chain resources, including raw materials, packaging, energy, and transportation, weather conditions, health pandemics or outbreaks of disease, or other geopolitical uncertainty; disruptions or inefficiencies in our supply chain and/or operations; risks related to the effectiveness of our hedging activities and ability to respond to volatility in commodities; risks related to the ultimate impact of, including reputational harm caused by, any product recalls and product liability or labeling litigation, including litigation related to lead-based paint and pigment and cooking spray; risks related to our ability to execute operating and value creation plans and achieve returns on our investments and targeted operating efficiencies from cost-saving initiatives, and to benefit from trade optimization programs; risks related to our ability to deleverage on currently anticipated timelines, and to continue to access capital on acceptable terms or at all; risks related to the Company’s competitive environment, cost structure, and related market conditions; risks related to our ability to respond to changing consumer preferences including health and wellness perceptions and the success of our innovation and marketing investments; risks associated with actions by our customers, including changes in distribution and purchasing terms; risks related to the seasonality of our business; risks associated with our contract manufacturing arrangements and other third-party service provider dependencies; risks associated with actions of governments and regulatory bodies that affect our businesses, including the ultimate impact of new or revised regulations or interpretations including to address climate change; risks related to the Company’s ability to execute on its strategies or achieve expectations related to environmental, social, and governance matters, including as a result of evolving legal, regulatory, and other standards, processes, and assumptions, the pace of scientific and technological developments, increased costs, the availability of requisite financing, and changes in carbon pricing or carbon taxes; risks related to a material failure in or breach of our or our vendors’ information technology systems and other cybersecurity incidents; risks related to our ability to identify, attract, hire, train, retain and develop qualified personnel; risk of increased pension, labor or people-related expenses; risks and uncertainties associated with intangible assets, including any future goodwill or intangible assets impairment charges; risks relating to our ability to protect our intellectual property rights; risks relating to acquisition, divestiture, joint venture or investment activities; the amount and timing of future dividends, which remain subject to Board approval and depend on market and other conditions; the amount and timing of future stock repurchases; and other risks described in our reports filed from time to time with the U.S. Securities and Exchange Commission (the “SEC”). We caution readers not to place undue reliance on any forward-looking statements included in this report, which speak only as of the date of this report. We undertake no responsibility to update these statements, except as required by law.\nThe discussion that follows should be read together with the unaudited Condensed Consolidated Financial Statements and related notes contained in this report and with the financial statements, related notes, and Management’s Discussion and Analysis of Financial Condition and Results of Operations contained in our Annual Report on Form 10-K for the fiscal year ended May 25, 2025 and subsequent filings with the SEC. Results for the first quarter of fiscal 2026 are not necessarily indicative of results that may be attained in the future.\nEXECUTIVE OVERVIEW\nConagra Brands, Inc. (the “Company”, “Conagra Brands”, “we”, “us”, or “our”), headquartered in Chicago, is one of North America’s leading branded food companies. We combine a 100-year history of making quality food with agility and a relentless focus on collaboration and innovation. The Company’s portfolio is continuously evolving to satisfy consumers’ ever-changing food preferences. Conagra’s brands include \nBirds Eye\n®\n, \nDuncan Hines\n®\n, \nHealthy Choice\n®\n, \nMarie Callender’s\n®\n, \nReddi-wip\n®\n, \nSlim Jim\n®\n, \nAngie’s\n®\n BOOMCHICKAPOP\n®\n, and many more.\n19\n\n\nTable of Contents\nFiscal 2026 First Quarter Results\nIn the first quarter of fiscal 2026, results reflected a decrease in net sales, with organic (excludes the impact of acquisitions, divestitures, and foreign exchange) decreases in our Grocery & Snacks and International segments, partially offset by increases in our Refrigerated & Frozen and Foodservice segments, in each case compared to the first quarter of fiscal 2025. Overall gross profit decreased primarily due to the impacts of lower net sales, input cost inflation, and a reduction in profit from divested businesses, partially offset by productivity. Excluding items impacting comparability, overall segment operating profit decreased in our Grocery & Snacks, Refrigerated & Frozen, and Foodservice segments, slightly offset by an increase in our International segment compared to the first quarter of fiscal 2025. Corporate expenses and selling, general and administrative (“SG&A”) expenses were nearly flat compared to the prior year. We recognized lower interest expense and higher income tax expense, in each case compared to the first quarter of fiscal 2025. Excluding items impacting comparability, our effective tax rate was higher than the first quarter of fiscal 2025.\nDiluted earnings per share in the first quarter of fiscal 2026 and 2025 was $0.34 and $0.97, respectively. Diluted earnings per share was affected by lower net income in the first quarter of fiscal 2026 compared to the first quarter of fiscal 2025. See \n“Items Impacting Comparability” \nbelow as several items affected the comparability of year-over-year results.\nTrends Impacting Our Business\nOur industry continues to be impacted by shifting consumer behavior, commodity cost fluctuations, labor cost inflation, input cost inflation, supply chain pressures, exchange rate volatility, and other global macroeconomic challenges. In the first quarter of fiscal 2026, we saw a modest impact to our financial results due to increased costs resulting from recent changes to trade policies, which we largely mitigated. In addition, we continued to experience an elevated amount of input cost inflation, which we were able to partially offset through our on-going productivity initiatives.\nWe expect inflation and tariffs to negatively impact our \ncosts of goods sold in fiscal 2026. While we continue to expect consumer trends to improve over time, in the near-term, we expect weak consumer sentiment to continue to negatively impact our volumes during fiscal 2026. We will continue to evaluate the evolving macroeconomic environment and take action to mitigate negative impacts on our business, consolidated results of operations, and financial condition.\nItems Impacting Comparability\nSegment presentation of gains and losses from derivatives used for economic hedging of anticipated commodity input costs and foreign currency exchange rate risks of anticipated transactions is discussed in further detail in Note 8, \n“Derivative Financial Instruments”\n, to the Condensed Consolidated Financial Statements contained in this report. We had $2.2 million and $1.3 million of derivative losses in the first quarter of fiscal 2026 and 2025, respectively, which were included in general corporate expenses and reflected as items impacting comparability.\nOther items of note impacting comparability for the first quarter of fiscal 2026 included the following:\n●\nA net gain of $42.4 million ($20.4 million after-tax loss) associated with the divestiture of our \nChef Boyardee\n®\n and frozen fish businesses and\n●\ncharges totaling $4.4 million ($3.3 million after-tax) in connection with our restructuring plans.\nItems of note impacting comparability for the first quarter of fiscal 2025 included the following:\n●\nan income tax benefit of $211.4 million primarily associated with the release of valuation allowances on certain deferred tax assets based upon interactions with the taxing authorities,\n●\na gain of $17.0 million ($12.8 million after-tax) associated with insurance proceeds from the previous fire that occurred at one of our manufacturing facilities,\n●\ncharges totaling $4.3 million ($3.2 million after-tax) in connection with our restructuring plans, and\n●\nnet charges totaling $3.4 million ($2.6 million after-tax) related to legacy legal matters.\nSEGMENT REVIEW\nWe reflect our results of operations in four reporting segments: Grocery & Snacks, Refrigerated & Frozen, International, and Foodservice.\n20\n\n\nTable of Contents\nGrocery & Snacks\nThe Grocery & Snacks reporting segment principally includes branded, shelf-stable food products sold in various retail channels in the United States.\nRefrigerated & Frozen\nThe Refrigerated & Frozen reporting segment principally includes branded, temperature-controlled food products sold in various retail channels in the United States.\nInternational\nThe International reporting segment principally includes branded food products, in various temperature states, sold in various retail and foodservice channels outside of the United States.\nFoodservice\nThe Foodservice reporting segment includes branded and customized food products, including meals, entrees, sauces, and a variety of custom-manufactured culinary products that are packaged for sale to restaurants and other foodservice establishments primarily in the United States.\nNet Sales\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nNet Sales\n($ in millions)\n​\nThirteen Weeks Ended\nReporting Segment\n    \nAugust 24, 2025\n    \nAugust 25, 2024\n    \n% Inc (Dec)\nGrocery & Snacks\n​\n$\n 1,079.6\n​\n$\n 1,182.7\n​\n(8.7)%\nRefrigerated & Frozen\n​\n​\n 1,076.2\n​\n​\n 1,086.4\n​\n(0.9)%\nInternational\n​\n​\n 212.3\n​\n​\n 259.1\n​\n(18.0)%\nFoodservice\n​\n​\n 264.5\n​\n​\n 266.7\n​\n(0.8)%\nTotal\n​\n$\n 2,632.6\n​\n$\n 2,794.9\n​\n(5.8)%\n​\nNet sales for the first quarter of fiscal 2026 in our Grocery & Snacks segment included a decrease in organic volume of 1.6% when compared to the first quarter of fiscal 2025 driven by continued lower consumption trends which were seen throughout the industry. Organic price/mix increased by 0.6% for the first quarter of 2026 when compared to the first quarter of 2025. The first quarter of fiscal 2026 and 2025 included $7.0 million and $110.1 million, respectively, of net sales related to our \nChef Boyardee\n®\n \nbusiness, which was sold in the first quarter of fiscal 2026. The first quarter of fiscal 2026 included inorganic net sales of $10.6 million associated with the acquisitions of Sweetwood Smoke & Co. in August 2024 and a contract manufacturer in July 2024 through the respective one-year anniversary of each acquisition.\nNet sales for the first quarter of fiscal 2026 in our Refrigerated & Frozen segment reflected an increase in organic volume of 0.5%, when compared to the first quarter of fiscal 2025. Organic price/mix decreased by 0.3% for the first quarter of fiscal 2026, when compared to the first quarter of fiscal 2025. The first quarter of fiscal 2026 and 2025 included $4.9 million and $17.4 million, respectively, of net sales related to our frozen fish business, which was sold in the first quarter of fiscal 2026. Additionally, we estimate that net sales during the first quarter of fiscal 2025 were impacted by approximately $24 million due to temporary manufacturing disruptions in our \nHebrew National\n® \nbusiness during the key grilling season.\nNet sales for the first quarter of fiscal 2026 in our International segment reflected a 5.2% decrease in organic volumes, a 1.7% increase in organic price/mix, and a 1.3% decrease due to unfavorable foreign exchange rates, in each case compared to the first quarter of fiscal 2025. The decrease in volume was driven by lower consumption trends which were seen in our regions. The unfavorable foreign exchange rates were primarily due to the strength of the US dollar relative to the Mexican Peso in comparison to the first quarter of fiscal 2025. The first quarter of fiscal 2025 included $23.6 million of net sales related to our ownership stake in Agro Tech Foods Limited (“ATFL”), which was sold in the first quarter of fiscal 2025. In addition, the first quarter of fiscal 2026 and 2025 included $1.1 million and $13.6 million, respectively, of net sales related to our \nChef Boyardee\n®\n \nbusiness.\nNet sales for the first quarter of fiscal 2026 in our Foodservice segment reflected an increase in organic price/mix of 3.8%, when compared to the first quarter of fiscal 2025. Organic volume decreased by 3.6%, compared to the first quarter of fiscal 2025, reflecting ongoing soft yet stabilizing trends in commercial traffic. The first quarter of fiscal 2025 included $3.6 million of net sales related to our \nChef Boyardee\n®\n \nand frozen fish businesses. \n \nAdditionally, we estimate that net sales in our Foodservice segment during the first quarter of fiscal 2025 were impacted by approximately $3 million due to the temporary manufacturing disruptions in our \nHebrew National\n® \nbusiness.\n21\n\n\nTable of Contents\nSG&A Expenses (includes general corporate expenses)\nSG&A expenses totaled $335.6 million for the first quarter of fiscal 2026, an increase of $0.2 million, as compared to the first quarter of fiscal 2025. SG&A expenses for the first quarter of fiscal 2026 reflected the following:\nItems impacting comparability of earnings\n●\nnet charges of $3.7 million in connection with our restructuring plans and\n●\na net benefit of $2.4 million related to legacy legal matters. \nOther changes in expenses compared to the first quarter of fiscal 2025\n●\nan increase in short-term incentive expense of $9.3 million,\n●\na gain of $5.4 million related to the sale of certain corporate parcels of land,\n●\nan increase in salary, wage, and fringe benefit expense of $5.2 million, and\n●\na decrease in consulting and professional fees of $4.8 million.\nSG&A expenses for the first quarter of fiscal 2025 included the following items impacting comparability of earnings:\n●\ncharges of $3.4 million related to legacy legal matters and\n●\nnet charges of $2.2 million in connection with our restructuring plans.\nSegment Operating Profit\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nOperating Profit\n($ in millions)\n    \nThirteen Weeks Ended\nReporting Segment\n​\nAugust 24, 2025\n    \nAugust 25, 2024\n    \n% Inc (Dec)\nGrocery & Snacks\n​\n$\n 220.8\n​\n$\n 253.3\n​\n(12.9)%\nRefrigerated & Frozen\n​\n​\n 114.4\n​\n​\n 159.1\n​\n(28.1)%\nInternational\n​\n​\n 37.7\n​\n​\n 35.8\n​\n5.3%\nFoodservice\n​\n​\n 27.7\n​\n​\n 35.1\n​\n(21.1)%\n​\nSegment operating profit in our Grocery & Snacks segment for the first quarter of fiscal 2026 reflected a decrease in gross profits of $27.8 million compared to the first quarter of fiscal 2025. The decrease in gross profit was driven by the decrease in net sales discussed above, the impacts of input cost inflation, and a reduction in profit associated with the sale of our \nChef Boyardee\n®\n \nbusiness, partially offset by productivity. In addition, we recognized a benefit of $3.3 million in the first quarter fiscal 2025 related to insurance proceeds for lost sales from our fiscal 2023 brand recall on \nArmour Star\n®\n. The decrease in operating profit also included an increase in SG&A expenses primarily related to incentive compensation. \nSegment operating profit in our Refrigerated & Frozen segment for the first quarter fiscal 2026 reflected a decrease in gross profits of $42.4 million compared to the first quarter fiscal 2025. The decrease was driven by the impacts of input cost inflation, unfavorable operating leverage, and a reduction in profit associated with the sale of our frozen fish business, partially offset by productivity. In addition, we estimate that gross profits during the first quarter of fiscal 2025 were negatively impacted by approximately $10 million, primarily due to lost profits, abnormal manufacturing variances, and certain inventory write-offs resulting from the temporary manufacturing disruptions in our \nHebrew National\n® \nbusiness. \nSegment operating profit in our International segment for the first quarter of fiscal 2026 reflected a decrease in gross profits of $5.4 million when compared to the first quarter of fiscal 2025. The decrease was driven by a reduction in profit associated with the sale of our ownership stake in ATFL and the impacts of input cost inflation, partially offset by productivity. The decrease in gross profits was more than offset by lower SG&A expenses and favorable foreign exchange rates.\nSegment operating profit in our Foodservice segment for the first quarter of fiscal 2026 reflected a decrease in gross profits of $6.6 million when compared to the first quarter of fiscal 2025. The decrease in gross profits was driven by the impacts of input cost inflation, unfavorable operating leverage, and a reduction in profit from divested businesses, partially offset by productivity.\n22\n\n\nTable of Contents\nPension and Postretirement Non-service Income (Expense)\nIn the first quarter of fiscal 2026 and 2025, pension and postretirement non-service income was $6.1 million and $3.1 million, respectively. The first quarter of fiscal 2026 reflected lower interest costs as a result of the partial transfer of our U.S. defined benefit pension plan obligation to a third-party insurance provider through the purchase of an annuity contract in the fourth quarter of fiscal 2025.\nInterest Expense, Net\nNet interest expense was $93.8 million and $105.8 million for the first quarter of fiscal 2026 and 2025, respectively. The decrease was driven by an overall reduction of our debt balances. See Note 5, \n“Debt and Revolving Credit Facility”\n, to the Condensed Consolidated Financial Statements contained in this report for further discussion.\nEquity Method Investment Earnings\nEquity method investment earnings were $29.4 million and $29.1 million for the first quarter of fiscal 2026 and 2025, respectively. \nIncome Taxes\nIn the first quarter of fiscal 2026 and 2025, we recognized income tax expense of $124.6 million and an income tax benefit of $138.9 million, respectively. The effective tax rate (calculated as the ratio of income tax expense to pre-tax income, inclusive of equity method investment earnings) was approximately 43.1% and (42.4)% for the first quarter of fiscal 2026 and 2025, respectively. See Note 12, \n“Income Taxes”\n, to the Condensed Consolidated Financial Statements contained in this report for a discussion on the change in effective tax rates.\nEarnings Per Share\nDiluted earnings per share in the first quarter of fiscal 2026 and 2025 was $0.34 and $0.97, respectively. The decrease reflected lower net income. See \n“Items Impacting Comparability” \nabove as several items affected the comparability of year-over-year results of operations.\nLIQUIDITY AND CAPITAL RESOURCES\nSources of Liquidity and Capital\nThe primary objective of our financing strategy is to maintain a prudent capital structure that provides us flexibility to pursue our growth objectives. We use a combination of equity and short- and long-term debt. We use short-term debt principally to finance ongoing operations, including our seasonal requirements for working capital (accounts receivable, prepaid expenses and other current assets, and inventories, less accounts and other payables, accrued payroll, and other accrued liabilities). We strive to maintain solid investment grade credit ratings.\nManagement believes that existing cash balances, cash flows from operations, existing credit facilities, our commercial paper program, and access to capital markets will provide sufficient liquidity to meet our debt obligations, including any repayment of debt or refinancing of debt, working capital needs, planned capital expenditures, other contractual obligations, and payment of anticipated quarterly dividends for at least the next twelve months and the foreseeable future thereafter.\nBorrowing Facilities and Long-Term Debt\nAt August 24, 2025, we had a revolving credit facility (the “Revolving Credit Facility”) with a syndicate of financial institutions providing for a maximum aggregate principal amount outstanding at any one time of $2.0 billion (subject to increase to a maximum aggregate principal amount of $2.5 billion with the consent of the lenders). The Revolving Credit Facility terminated and replaced our prior revolving credit facility in the first quarter of fiscal 2026. The Revolving Credit Facility matures on June 27, 2030 and is unsecured. The Company may request the term of the Revolving Credit Facility be extended for additional one-year or two-year periods from the then-applicable maturity date on an annual basis. We have historically used a credit facility principally as a back-up for our commercial paper program. As of August 24, 2025, there were no outstanding borrowings under the Revolving Credit Facility.\nAs of August 24, 2025, we had no outstanding borrowings under our commercial paper program. The highest level of borrowings outstanding during the first quarter of fiscal 2026 was $445.0 million. We had $259.0 million outstanding under our commercial paper program as of May 25, 2025.\n23\n\n\nTable of Contents\nDuring the first quarter of fiscal 2026, we issued $500.0 million aggregate principal amount of 5.00% senior unsecured notes due August 1, 2030 and $500.0 million aggregate principal amount of 5.75% senior unsecured notes due August 1, 2035 (collectively, the “Senior Notes”). The proceeds were partially used to repay the $300.0 million and $200.0 million aggregate principal amount outstanding under the unsecured term loan agreements dated April 29, 2024, as amended by a letter agreement dated April 29, 2025, (the “2024 Term Loan”) and April 29, 2025 (the “2025 Term Loan”), respectively, as well as outstanding borrowings under our commercial paper program. The 2024 Term Loan and 2025 Term Loan repayments were also partially funded by the proceeds received in connection with the sale of our \nChef Boyardee\n®\n business. \nWe have $1.0 billion aggregate principal amount of 4.60% senior unsecured notes maturing on November 1, 2025 that we expect to pay using the remaining proceeds from the Senior Notes, cash on hand, and the issuance of commercial paper. \nFor additional information on our debt transactions, refer to Note 5, \n“Debt and Revolving Credit Facility”\n, to the Condensed Consolidated Financial Statements contained in this report and Note 4, \n“Long-Term Debt”\n, and Note 5, \n“Credit Facilities and Borrowings”\n, to the Consolidated Financial Statements contained in the Company’s Annual Report on Form 10-K for the fiscal year ended May 25, 2025. The weighted average coupon interest rate of long-term debt obligations outstanding as of August 24, 2025 was approximately 4.9%.\nWe expect to maintain or have access to sufficient liquidity to retire or refinance long-term debt at maturity or otherwise, from operating cash flows, our commercial paper program, access to the capital markets, and our Revolving Credit Facility. We continuously evaluate opportunities to refinance our debt; however, any refinancing is subject to market conditions and other factors, including financing options that may be available to us from time to time, and there can be no assurance that we will be able to successfully refinance any debt on commercially acceptable terms at all.\nAs of the end of the first quarter of fiscal 2026, our senior long-term debt ratings were all investment grade. A significant downgrade in our credit ratings would not affect our ability to borrow amounts under the Revolving Credit Facility, although borrowing costs would increase. A downgrade of our short-term credit ratings would impact our ability to borrow under our commercial paper program by negatively impacting borrowing costs and causing shorter durations, as well as making access to commercial paper more difficult, or impossible.\nOur most restrictive debt agreement (the Revolving Credit Facility) generally requires our ratio of earnings before interest, taxes, depreciation and amortization (“EBITDA”) to interest expense not be less than 3.0 to 1.0 and our ratio of funded net debt to EBITDA not to exceed 4.5 to 1.0. Each ratio is to be calculated on a rolling four-quarter basis. As of August 24, 2025, we were in compliance with these financial covenants.\nEquity and Dividends\nWe repurchase shares of our common stock from time to time after considering market conditions and in accordance with repurchase limits authorized by our Board. Under our current share repurchase authorization, we may repurchase our shares periodically over several years, depending on market conditions and other factors, and may do so in open market purchases or privately negotiated transactions. The share repurchase authorization has no expiration date. During the first quarter of fiscal 2026, we repurchased 0.8 million shares of our common stock under this authorization for an aggregate of $15.0 million. The Company’s total remaining share repurchase authorization as of August 24, 2025 was $837.6 million.\nOn August 28, 2025, the Company paid a quarterly cash dividend on shares of its common stock of $0.35 per share to stockholders of record as of close of business on July 30, 2025. On September 30, 2025, we announced that our Board had authorized a quarterly dividend of $0.35 per share to be paid on November 26, 2025 to stockholders of record as of the close of business on October 30, 2025.\nContractual Obligations\nAs part of our ongoing operations, we enter into contractual arrangements that obligate us to make future cash payments. These obligations impact our liquidity and capital resource needs. In addition to principal and interest payments on our outstanding long-term debt and notes payable balances, discussed above, our contractual obligations primarily consist of lease payments, income taxes, pension and postretirement benefits, and unconditional purchase obligations. There were no material changes to our contractual obligations from those disclosed in the Company’s Annual Report on Form 10-K for the fiscal year ended May 25, 2025.\nCapital Expenditures\nWe continue to make investments in our business and operating facilities. Our estimate of capital expenditures for fiscal 2026 is approximately $450 million.\n24\n\n\nTable of Contents\nCash Flows\nDuring the first quarter of fiscal 2026, we generated $630.1 million of cash, which was the net result of $120.6 million generated from operating activities, $502.0 million generated from investing activities, $7.2 million generated from financing activities, and an increase of $0.3 million due to the effects of changes in foreign currency exchange rates.\nCash generated from operating activities totaled $120.6 million and $268.6 million in the first quarter of fiscal 2026 and 2025, respectively. The decrease in operating cash flows for the first quarter of fiscal 2026 compared to the first quarter of fiscal 2025 was primarily driven by lower operating profits and higher inventory balances. The higher inventory balances were largely due to inflationary input costs in addition to rebuilding some inventory due to previous supply chain constraints. \nCash generated from investing activities totaled $502.0 million in the first quarter of fiscal 2026 compared to cash used in investing activities of $286.3 million in the first quarter of fiscal 2025. Investing activities in the first quarter of fiscal 2026 consisted primarily of proceeds totaling $643.6 million from the sale of our \nChef Boyardee\n®\n and frozen fish businesses, which were partially offset by capital expenditures totaling $146.8 million. Investing activities in the first quarter of fiscal 2025 consisted primarily of capital expenditures totaling $133.0 million and the purchases of an existing contract manufacturer and Sweetwood Smoke & Co. for a total of $230.4 million, net of cash acquired, which were partially offset by net proceeds totaling $76.8 million from the sale of our ownership stake in ATFL.\nCash generated from financing activities totaled $7.2 million and $70.1 million in the first quarter of fiscal 2026 and 2025, respectively. Financing activities in the first quarter of fiscal 2026 principally reflected the issuance of long-term debt totaling $1.0 billion, net short-term borrowing repayments of $763.2 million, cash dividends paid of $167.1 million, and common stock repurchases of $15.0 million. Financing activities in the first quarter of fiscal 2025 principally reflected net short-term borrowing issuances of $336.2 million, partially offset by cash dividends paid of $167.3 million and common stock repurchases of $64.0 million.\nCash Held by International Subsidiaries\nThe Company had cash and cash equivalents of $698.1 million at August 24, 2025 and $68.0 million at May 25, 2025, of which $38.3 million at August 24, 2025 and $61.6 million at May 25, 2025 was held in foreign countries. A deferred tax liability is provided for certain undistributed foreign earnings that are not considered to be indefinitely reinvested or cannot be remitted in a tax-neutral transaction. Other undistributed foreign earnings are invested indefinitely and therefore we have not provided deferred taxes on those earnings.\nCRITICAL ACCOUNTING ESTIMATES\nFor further discussion of our critical accounting estimates, please refer to the \n“Management’s Discussion and Analysis of Financial Condition and Results of Operations”\n section in Part II, Item 7, of our Annual Report on Form 10-K for the fiscal year ended May 25, 2025.\n​"
}