{
  "source_file": "carr-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2.    Management’s Discussion and Analysis of Financial Condition and Results of Operations\nBUSINESS OVERVIEW\nBusiness Summary\nCarrier Global Corporation (\"we\" or \"our\") is a global leader in intelligent climate and energy solutions with a focus on providing differentiated, digitally-enabled lifecycle solutions to our customers. Our portfolio includes industry-leading brands such as Carrier, Viessmann, Toshiba, Automated Logic and Carrier Transicold that offer innovative heating, ventilating, air conditioning (\"HVAC\") and cold chain transportation solutions to enhance the lives we live and the world we share. We also provide a broad array of related building services, including audit, design, installation, system integration, repair, maintenance and monitoring. Our operations are classified into four segments: Climate Solutions Americas, Climate Solutions Europe, Climate Solutions Asia Pacific, Middle East & Africa and Climate Solutions Transportation.\nThrough our performance-driven culture, we anticipate creating long-term shareowner value by investing strategically to strengthen our product position in homes, buildings and across the cold chain in order to drive profitable growth. We believe our business segments are well positioned to benefit from favorable secular trends, including the mega-trends of urbanization, population growth and demographic shifts, food security and safety, digitalization, global connectivity and energy efficiency. Coupled with our industry-leading brands and track record of innovation, we continue to provide market-leading solutions for our customers.\nOur worldwide operations are affected by global and regional industrial, economic and political factors, trade policies and trends. They are also affected by changes in the general level of economic activity, such as changes in business and consumer spending, construction and shipping activity as well as short-term economic factors such as currency fluctuations, commodity price volatility and supply disruptions. We continue to invest in our business, take pricing actions to mitigate supply chain and inflationary pressures, develop new products and services in order to remain competitive in our markets and use risk management strategies to mitigate various exposures.\nWe continue to actively monitor evolving macroeconomic conditions and recent trade policy announcements. Based on our updated analysis, we expect to fully mitigate our expected 2025 impact from tariffs announced to date through supply chain and productivity actions as well as approximately $200 million of incremental product pricing actions. To date, tariffs have not had a material impact on our business and we are deploying additional strategies, including cost containment measures, to limit future exposure in this current market environment.\nRecent Developments\nPortfolio Transformation\nDuring 2024, we completed several activities designed to simplify our business portfolio, transforming it into a pure-play climate and energy solutions provider. On January 2, 2024, we acquired the climate solutions business (the \"VCS Business\") of Viessmann Group GmbH & Co. KG (together with its affiliates, “Viessmann”). The VCS Business, primarily reported in the Climate Solutions Europe segment, is a premier residential and light commercial HVAC provider in Europe that expanded our portfolio to offer a global, comprehensive suite of sustainable and innovative building and cold-chain solutions. In addition, we divested our Commercial and Residential Fire, Access Solutions and Industrial Fire businesses which were historically reported in our Fire & Security segment. The transactions represented a single disposal plan to separately divest multiple businesses over different reporting periods and met the criteria to be presented as discontinued operations. We also divested our Commercial Refrigeration business (“CCR”) during 2024. CCR, which was historically reported in the Climate Solutions Transportation segment (previously named Refrigeration), did not meet the criteria to be presented as discontinued operations.\n32\nSegment Reorganization\nAs a result of our portfolio transformation, we revised our reportable segments during the first quarter of 2025 to better reflect our business strategy, align our management reporting and increase transparency for investors. Under the revised segment structure, we have three new regional HVAC operating segments. Combined with the existing Climate Solutions Transportation operating segment, the four operating segments also serve as our reportable segments. This model is designed to create a simplified, more focused and customer-centric organization across the globe. Each segment reports through separate management teams which regularly review their operating results with our Chief Operating Decision Maker (the \"CODM\") determined in accordance with applicable accounting guidance. In connection with the revised structure, the CODM changed the measure used to evaluate segment profitability from \nOperating profit\n to \nSegment operating profit.\n All prior period comparative information has been recast to reflect the revised segment structure.\nCRITICAL ACCOUNTING ESTIMATES\nPreparation of our financial statements requires management to make estimates and assumptions that affect the reported amounts of assets, liabilities, sales and expenses. We believe that the most complex and sensitive judgments, because of their potential significance to the accompanying Unaudited Condensed \nConsolidated\n Financial Statements, result primarily from the need to make estimates about the effects of matters that are inherently uncertain. In \"\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\"\n of our 2024 Form 10-K, \nwe \ndescribe the significant accounting estimates and policies used in the preparation of the accompanying Unaudited Condensed \nConsolidated\n Financial Statements. There have been no significant changes in our critical accounting estimates.\nRESULTS OF OPERATIONS\nThree Months Ended September 30, 2025 Compared with the Three Months Ended September 30, 2024\nThe following represents our consolidated net sales and operating results:\nThree Months Ended September 30,\n(In millions)\n2025\n2024\nPeriod Change\n% Change\nNet sales\n$\n5,579 \n$\n5,984 \n$\n(405)\n(7)\n%\nCost of products and services sold\n(4,130)\n(4,307)\n177 \n(4)\n%\nGross margin\n1,449 \n1,677 \n(228)\n(14)\n%\nOperating expenses\n(910)\n(914)\n4 \n— \n%\nOperating profit\n539 \n763 \n(224)\n(29)\n%\nNon-operating income (expense), net\n(106)\n7 \n(113)\n(1614)\n%\nEarnings (loss) before income taxes\n433 \n770 \n(337)\n(44)\n%\nIncome tax expense\n1 \n(172)\n173 \n(101)\n%\nEarnings (loss) from continuing operations\n434 \n598 \n(164)\n(27)\n%\nDiscontinued operations, net of income taxes\n21 \n(117)\n138 \n(118)\n%\nNet earnings (loss)\n455 \n481 \n(26)\n(5)\n%\nLess: Non-controlling interest in subsidiaries' earnings from operations\n27 \n34 \n(7)\n(21)\n%\nNet earnings (loss) attributable to common shareowners\n$\n428\n \n$\n447\n \n$\n(19)\n(4)\n%\n33\nNet Sales\nFor the three months ended September 30, 2025, \nNet sales\n were $5.6 billion, a 7% decrease compared with the same period of 2024. The components of the year-over-year change were as follows:\nThree Months Ended\n September 30,\nOrganic\n(4)\n%\nForeign currency translation\n1 \n%\nAcquisitions and divestitures, net\n(4)\n%\nTotal % change\n(7)\n%\nOrganic sales for the three months ended September 30, 2025, decreased by 4% compared with the same period of 2024. The organic decrease was primarily due to our Climate Solutions Americas segment as reduced end-market demand and distributor destocking in our residential business impacted the segment. In addition, lower end-market demand in both our Climate Solutions Europe and Climate Solutions Asia Pacific, Middle East & Africa segments further impacted overall results. These results were partially offset by improved end-market demand in Climate Solutions Transportation. Refer to \"Segment Review\" below for a discussion of \nNet sales \nby segment. \nGross Margin\nFor the three months ended September 30, 2025, gross margin was $1.4 billion, a 14% decrease compared with the same period of 2024. The components were as follows: \nThree Months Ended\n September 30,\n(In millions)\n2025\n2024\nNet sales\n$\n5,579 \n$\n5,984 \nCost of products and services sold\n(4,130)\n(4,307)\nGross margin\n$\n1,449\n \n$\n1,677\n \nPercentage of net sales\n26.0 \n%\n28.0 \n%\nGross margin decreased by $228 million compared with the three months ended September 30, 2024 primarily due to lower volumes in certain end-markets. As a result, gross margin as a percentage of \nNet sales\n decreased by 200 basis points compared with the same period of 2024. The prior period included inventory step-up and backlog amortization resulting from the recognition of acquired assets of the VCS Business at fair value which are now fully amortized. These costs had a 50 basis point unfavorable impact on the prior period gross margin as a percentage of \nNet sales\n. The decrease was partially offset by ongoing customer demand in certain end-markets and our continued focus on productivity initiatives.\n34\nOperating Expenses\nFor the three months ended September 30, 2025, operating expenses, including\n Equity method investment net earnings\n, were $910 million, flat compared with the same period of 2024. The components\n were as follows:\nThree Months Ended\n September 30,\n(In millions)\n2025\n2024\nSelling, general and administrative\n$\n(803)\n$\n(799)\nResearch and development\n(151)\n(172)\nEquity method investment net earnings\n60 \n66 \nOther income (expense), net\n(16)\n(9)\nTotal operating expenses\n$\n(910)\n$\n(914)\nPercentage of net sales\n16.3 \n%\n15.3 \n%\nFor the three months ended September 30, 2025, \nSelling, general and administrative\n expenses were $803 million, a 1% increase compared with the same period of 2024. The increase primarily relates to foreign currency translation. In addition, employee-related costs associated with our portfolio transformation further impacted results. These costs were partially offset by lower compensation costs and synergies associated with the integration of the VCS Business. The current period also included $13 million of acquisition and divestiture-related costs compared with $15 million during the three months ended September 30, 2024.\nResearch and development\n costs relate to new product development and new technology innovation. Due to the variable nature of program development schedules, year-over-year spending levels can fluctuate. In addition, we continue to invest to prepare for future product innovations and digital controls technologies.\nInvestments over which we do not exercise control, but have significant influence, are accounted for using the equity method of accounting. For the three months ended September 30, 2025, \nEquity method investment net earnings\n were $60 million, a 9% decrease compared with the same period of 2024. The decrease was primarily driven by lower earnings in joint ventures within Climate Solutions Americas. \nOther income (expense), net\n primarily includes the impact of gains and losses related to the sale of businesses or interests in our equity method investments, foreign currency gains and losses on transactions that are denominated in a currency other than an entity's functional currency and hedging-related activities. \nNon-Operating Income (Expense), net\nFor the three months ended September 30, 2025, \nNon-operating income (expense), net\n was $106 million, a 1,614% decrease compared with the same period of 2024. The components were as follows:\nThree Months Ended\n September 30,\n(In millions)\n2025\n2024\nNon-service pension (expense) benefit\n$\n(9)\n$\n(1)\nInterest expense\n$\n(116)\n$\n(131)\nInterest income\n19 \n139 \nInterest (expense) income, net\n$\n(97)\n$\n8\n \nNon-operating income (expense), net\n$\n(106)\n$\n7\n \n35\nNon-operating income (expense), net\n includes the results from activities other than normal business operations such as interest expense, interest income and the non-service components of pension and post-retirement obligations. Interest expense is affected by the amount of debt outstanding and the interest rates on that debt. For the three months ended September 30, 2025, \nInterest expense \nwas $116 million, an 11% decrease compared with the same period of 2024. Consistent with our capital allocation strategy, we reduced our outstanding debt by approximately $3 billion over the course of 2024 and repaid an additional $1.2 billion in 2025. During the \nthree months ended September 30, 2024, our debt repayments resulted in an $11 million write off of unamortized deferred financing costs in \nInterest expense\n and recognition of a net gain of $97 million in \nInterest income\n.\nIncome Taxes\n \nThree Months Ended\n September 30,\n \n2025\n2024\nEffective tax rate\n(0.2)\n%\n22.3 \n%\nWe account for income tax expense in accordance with ASC 740, which requires an estimate of the annual effective income tax rate for the full year to be applied to the respective interim period, taking into account year-to-date amounts and projected results for the full year. \nThe effective tax rate for the three months ended September 30, 2025, was a 0.2% benefit compared with 22.3% for the three months ended September 30, 2024. The effective tax rate for the three months ended September 30, 2025, was lower than the effective tax rate for the three months ended September 30, 2024, primarily due to a net tax benefit of \n$64 million from\n changes to the German effective rate and a statutory reduction to the German corporate tax rate enacted during the current period and a tax benefit of \n$49 million from the re-organization of a Japanese subsidiary.\nAdjusted Operating Profit\nWe report our financial results in accordance with accounting principles generally accepted in the United States (\"GAAP\"). In addition, we supplement the reporting of our financial information determined under GAAP with certain non-GAAP financial information. Adjusted operating profit is a non-GAAP measure and defined as consolidated operating profit (a GAAP measure), excluding restructuring costs, amortization of acquired intangibles and other significant items of a nonoperational nature. This measure is useful to investors because it is how management assesses the operating performance of the business. A reconciliation of the amounts prepared in accordance with GAAP to the corresponding non-GAAP measure appears below and provides additional information as to the items and amounts that have been excluded from the adjusted measure.\nThree Months Ended\n September 30,\n(In millions)\n2025\n2024\nReconciliation to Adjusted operating profit\nOperating profit\n$\n539 \n$\n763 \nRestructuring costs\n50 \n60 \nAmortization of acquired intangibles\n221 \n175 \nAcquisition step-up amortization\n— \n31 \nAcquisition/divestiture-related costs\n13 \n15 \nAdjusted operating profit\n$\n823\n \n$\n1,044\n \nAdjusted operating profit may not be comparable to similarly-titled measures used by other companies and should not be considered a substitute for Operating profit in accordance with GAAP. The non-GAAP information presented provides investors with additional useful information, but should not be considered in isolation or as a substitute for the related GAAP measure. Moreover, other companies may define non-GAAP measures differently, which limits the usefulness of these measures for comparisons with such other companies. We encourage investors to review our financial statements and publicly filed reports in their entirety and not to rely on any single financial measure.\n36\nNine Months Ended September 30, 2025 Compared with the Nine Months Ended September 30, 2024\nThe following represents our consolidated net sales and operating results:\nNine Months Ended September 30,\n(In millions)\n2025\n2024\nPeriod Change\n% Change\nNet sales\n$\n16,910 \n$\n17,338 \n$\n(428)\n(2)\n%\nCost of products and services sold\n(12,247)\n(12,701)\n454 \n(4)\n%\nGross margin\n4,663 \n4,637 \n26 \n1 \n%\nOperating expenses\n(2,592)\n(2,765)\n173 \n(6)\n%\nOperating profit\n2,071 \n1,872 \n199 \n11 \n%\nNon-operating income (expense), net\n(278)\n(291)\n13 \n(4)\n%\nEarnings (loss) before income taxes\n1,793 \n1,581 \n212 \n13 \n%\nIncome tax expense\n(272)\n(339)\n67 \n(20)\n%\nEarnings (loss) from continuing operations\n1,521 \n1,242 \n279 \n22 \n%\nDiscontinued operations, net of income taxes\n4 \n1,897 \n(1,893)\n(100)\n%\nNet earnings (loss)\n1,525 \n3,139 \n(1,614)\n(51)\n%\nLess: Non-controlling interest in subsidiaries' earnings from operations\n94 \n86 \n8 \n9 \n%\nNet earnings (loss) attributable to common shareowners\n$\n1,431\n \n$\n3,053\n \n$\n(1,622)\n(53)\n%\nNet Sales\nFor the nine months ended September 30, 2025, \nNet sales\n were $16.9 billion, a 2% decrease compared with the same period of 2024. The components of the year-over-year change were as follows:\nNine Months Ended\nSeptember 30,\nOrganic\n1 \n%\nForeign currency translation\n1 \n%\nAcquisitions and divestitures, net\n(4)\n%\nTotal % change\n(2)\n%\nOrganic sales for the nine months ended September 30, 2025 increased by 1% compared with the same period of 2024. The organic increase was primarily due to our Climate Solutions Americas segment as ongoing demand in certain end-markets continued to drive higher volumes. In addition, improved end-market demand in our Climate Solutions Transportation segment further benefited results. These amounts were partially offset by lower end-market demand in both Climate Solutions Europe and Climate Solutions Asia Pacific, Middle East & Africa. Refer to \"Segment Review\" below for a discussion of \nNet sales \nby segment. \n37\nGross Margin\nFor the nine months ended September 30, 2025, gross\n \nmargin was $4.7 billion, a 1% increase compared with the same period of 2024. \nThe components were as follows:\nNine Months Ended\nSeptember 30,\n(In millions)\n2025\n2024\nNet sales\n$\n16,910 \n$\n17,338 \nCost of products and services sold\n(12,247)\n(12,701)\nGross margin\n$\n4,663\n \n$\n4,637\n \nPercentage of net sales\n27.6\n \n%\n26.7\n \n%\nGross margin increased by $26 million compared with the nine months ended September 30, 2024 primarily due to higher volumes in certain end-markets and our continued focus on productivity initiatives. As a result, gross margin as a percentage of \nNet sales\n increased by 90 basis points compared with the same period of 2024. The prior period included inventory step-up and backlog amortization resulting from the recognition of acquired assets of the VCS Business at fair value which are now fully amortized. These costs had a 150 basis point unfavorable impact on the prior period gross margin as a percentage of \nNet sales\n. \nOperating Expenses\nFor the nine months ended September 30, 2025, operating expenses, including \nEquity method investment net earning\ns, were $2.6 billion, a 6% decrease compared with the same period of 2024. Th\ne components were as follows:\nNine Months Ended\nSeptember 30,\n(In millions)\n2025\n2024\nSelling, general and administrative\n$\n(2,345)\n$\n(2,394)\nResearch and development\n(465)\n(524)\nEquity method investment net earnings\n182 \n187 \nOther income (expense), net\n36 \n(34)\nTotal operating expenses\n$\n(2,592)\n$\n(2,765)\nPercentage of net sales\n15.3\n \n%\n15.9\n \n%\nFor the nine months ended September 30, 2025, \nSelling, general and administrative expenses\n were $2.3 billion, a 2% decrease compared with the same period of 2024. The decrease relates to productivity initiatives associated with our portfolio transformation and synergies associated with the integration of the VCS Business. These benefits were partially offset by higher foreign currency translation, compensation and other employee-related costs. In addition, the current period also included $33 million of acquisition and divestiture-related costs compared with $87 million during the nine months ended September 30, 2024.\nResearch and development\n costs relate to new product development and new technology innovation. Due to the variable nature of program development schedules, year-over-year spending levels can fluctuate. In addition, we continue to invest to prepare for future product innovations and digital controls technologies.\nInvestments over which we do not exercise control, but have significant influence, are accounted for using the equity method of accounting. For the nine months ended September 30, 2025, \nEquity method investment net earnings\n were $182 million, a 3% decrease compared with the same period of 2024. The decrease was primarily driven by lower earnings in joint ventures within Climate Solutions Americas.\n38\nOther income (expense), net\n primarily includes the impact of gains and losses related to the sale of businesses or interests in our equity method investments, foreign currency gains and losses on transactions that are denominated in a currency other than an entity's functional currency and hedging-related activities. During the nine months ended September 30, 2025, we finalized the working capital and other adjustments provided in the stock purchase agreement governing the sale of CCR. In connection with the acquisition of the VCS Business, we recognized an $86 million loss during the nine months ended September 30, 2024, on the mark-to-market valuation of our window forward contracts associated with the expected cash outflows of the Euro-denominated purchase price of the VCS Business. In addition, we recognized a $46 million gain associated with the TMA and UTC's conclusion of certain income tax matters from their 2017 and 2018 tax audit with the Internal Revenue Service (\"IRS\").\nNon-Operating Income (Expense), net\nFor the nine months ended September 30, 2025\n, \nNon-operating income (expense), net\n was $278 million, a 5% decrease compared with the same period of 2024. The components were as follows: \nNine Months Ended\nSeptember 30,\n(In millions)\n2025\n2024\nNon-service pension (expense) benefit\n$\n(8)\n$\n(1)\nInterest expense\n$\n(343)\n$\n(462)\nInterest income\n73 \n172 \nInterest (expense) income, net\n$\n(270)\n$\n(290)\nNon-operating income (expense), net\n$\n(278)\n$\n(291)\nNon-operating income (expense), net\n includes the results from activities other than normal business operations such as interest expense, interest income and the non-service components of pension and post-retirement obligations. Interest expense is affected by the amount of debt outstanding and the interest rates on that debt. For the nine months ended September 30, 2025, \nInterest expense \nwas $343 million, a 26% decrease compared with the same period of 2024. Consistent with our capital allocation strategy, we reduced our outstanding debt by approximately $3 billion over the course of 2024 and repaid an additional $1.2 billion during 2025. During the nine months ended September 30, 2024\n, our debt repayments resulted in a make-whole premium of $8 million in \nInterest expense\n, an $11 million write off of unamortized deferred financing costs in \nInterest expense\n and recognition of a net gain of $97 million in \nInterest income\n.\nIncome Taxes\n \nNine Months Ended\nSeptember 30,\n \n2025\n2024\nEffective tax rate\n15.2 \n%\n21.4 \n%\nWe account for income tax expense in accordance with ASC 740, which requires an estimate of the annual effective income tax rate for the full year to be applied to the respective interim period, taking into account year-to-date amounts and projected results for the full year. \nThe effective tax rate was \n15.2%\n for the \nnine months ended September 30, 2025,\n compared with \n21.4%\n for the \nnine months ended September 30, 2024\n. The year-over-year \ndecrease\n was primarily driven by a net tax benefit of \n$64 million from changes to the German effective rate and a statutory reduction to the German corporate tax rate enacted during the current period\n, a tax benefit of \n$49 million from the re-organization of a Japanese subsidiary and\n a \n$16 million tax benefit generated by\n the purchase of investment tax credits \nfrom a third-party. These amounts were partially offset\n by the absence of a \n$21 million tax benefit \nassociated with the TMA and UTC's conclusion of certain income tax matters from their 2017 and 2018 tax audit with the IRS recognized during the \nnine months ended September 30, 2024.\n39\nAdjusted Operating Profit\nWe report our financial results in accordance with accounting principles generally accepted in the United States (\"GAAP\"). In addition, we supplement the reporting of our financial information determined under GAAP with certain non-GAAP financial information. Adjusted operating profit is a non-GAAP measure and defined as consolidated operating profit (a GAAP measure), excluding restructuring costs, amortization of acquired intangibles and other significant items of a nonoperational nature. This measure is useful to investors because it is how management assesses the operating performance of the business. A reconciliation of the amounts prepared in accordance with GAAP to the corresponding non-GAAP measure appears below and provides additional information as to the items and amounts that have been excluded from the adjusted measure.\nNine Months Ended\nSeptember 30,\n(In millions)\n2025\n2024\nReconciliation to Adjusted operating profit\nOperating profit\n$\n2,071 \n$\n1,872 \nRestructuring costs\n105 \n97 \nAmortization of acquired intangibles\n636 \n517 \nAcquisition step-up amortization\n— \n251 \nAcquisition/divestiture-related costs\n32 \n87 \nCCR gain\n(7)\n— \nViessmann-related hedges\n— \n86 \nGain on liability adjustment \n— \n(46)\nAdjusted operating profit\n$\n2,837\n \n$\n2,864\n \nAdjusted operating profit may not be comparable to similarly-titled measures used by other companies and should not be considered a substitute for Operating profit in accordance with GAAP. The non-GAAP information presented provides investors with additional useful information, but should not be considered in isolation or as a substitute for the related GAAP measure. Moreover, other companies may define non-GAAP measures differently, which limits the usefulness of these measures for comparisons with such other companies. We encourage investors to review our financial statements and publicly filed reports in their entirety and not to rely on any single financial measure.\n40\nSEGMENT REVIEW\nWe have four operating segments: \n•\nClimate Solutions Americas provides products, controls, services and solutions to meet the heating, cooling and ventilation needs of residential and commercial customers in North and South America while enhancing building performance, health, energy efficiency and sustainability.\n•\nClimate Solutions Europe provides products, controls, services and solutions to meet the heating, cooling and ventilation needs of residential and commercial customers in Europe while enhancing building performance, health, energy efficiency and sustainability.\n•\nClimate Solutions Asia Pacific, Middle East & Africa provides products, controls, services and solutions to meet the heating, cooling and ventilation needs of residential and commercial customers in Asia Pacific, the Middle East and Africa while enhancing building performance, health, energy efficiency and sustainability.\n•\nClimate Solutions Transportation includes global transport refrigeration and monitoring products, services and digital solutions for trucks, trailers, shipping containers, intermodal and rail.\nSegment operating profit\n is the measure of profit and loss that our CODM uses to evaluate the financial performance of the business and as the basis for resource allocation, performance reviews and compensation. It represents operating profit (a GAAP measure) adjusted to exclude restructuring costs, amortization of acquired intangible assets and other significant items of a nonoperational nature.\nThree Months Ended September 30, 2025 Compared with Three Months Ended September 30, 2024\nSummary performance for each of our segments is as follows:\n \nNet sales\nSegment operating profit\nSegment operating profit margin\nThree Months Ended\n September 30,\nThree Months Ended\n September 30,\nThree Months Ended\n September 30,\n(In millions)\n2025\n2024\n2025\n2024\n2025\n2024\nClimate Solutions Americas\n$\n2,711 \n$\n2,961 \n$\n533 \n$\n750 \n19.7 \n%\n25.3 \n%\nClimate Solutions Europe\n1,290 \n1,246 \n120 \n129 \n9.3 \n%\n10.4 \n%\nClimate Solutions Asia Pacific, Middle East & Africa\n833 \n840 \n97 \n106 \n11.6 \n%\n12.6 \n%\nClimate Solutions Transportation\n745 \n937 \n115 \n137 \n15.4 \n%\n14.6 \n%\nTotal segment\n$\n5,579\n \n$\n5,984\n \n$\n865\n \n$\n1,122\n \n15.5\n \n%\n18.8\n \n%\nA reconciliation of \nSegment operating profit\n to Adjusted operating profit is as follows:\nThree Months Ended\n September 30,\n(In millions)\n2025\n2024\nSegment operating profit\n$\n865 \n$\n1,122 \nCorporate and other\n(42)\n(78)\nAdjusted operating profit\n$\n823\n \n$\n1,044\n \n41\nClimate Solutions Americas\nFor the three months ended September 30, 2025, \nNet sales\n were $2.7 billion, an 8% decrease compared with the same period of 2024. The components of the year-over-year change were as follows:\nNet sales\nOrganic \n(8)\n%\nForeign currency translation\n— \n%\nTotal % change in Net sales\n(8)\n%\nThe organic decrease in \nNet sales \nof 8% was driven by volume reductions within certain end-markets compared with the prior year. Growth in our commercial business (up 28%) was primarily driven by ongoing customer demand and improved price. These results were more than offset by lower volume in our residential business (down 30%) primarily due to reduced end-market demand and distributor destocking. These amounts were partially offset by favorable mix and improved price. In addition, lower volume in our light commercial business (down 4%) further impacted segment results.\nFor the three months ended September 30, 2025, \nSegment operating profit\n was $533 million, a 29% decrease compared with the same period of 2024. The components of the year-over-year change were as follows:\nSegment operating profit\nOperational\n(29)\n%\nForeign currency translation\n— \n%\nTotal % change in Segment operating profit\n(29)\n%\nThe segment operational profit decrease of 29% was primarily attributable to volume reductions in certain end-markets compared with the prior year. In addition, unfavorable productivity, higher selling, general and administrative expenses and lower earnings from equity method investments further impacted the segment. These amounts were partially offset by favorable mix and improved price.\nClimate Solutions Europe\nFor the three months ended September 30, 2025, \nNet sales\n were $1.3 billion, a 4% increase compared with the same period of 2024. The components of the year-over-year change were as follows:\nNet sales\nOrganic \n(3)\n%\nForeign currency translation\n7 \n%\nTotal % change in Net sales\n4\n \n%\nThe organic decrease in \nNet sales \nof 3% was driven by volume reductions in each of the segment's businesses compared with the prior year. Results in our commercial business were down (down 4%) due to lower volumes across the region, partially offset by improved price. In addition, results in our residential and light commercial business were down (down 2%) due to lower volumes across the region as economic conditions, inflationary cost pressures and regulatory uncertainty impacted end-market demand.\n42\nFor the three months ended September 30, 2025, \nSegment operating profit\n was $120 million, a 7% decrease compared with the same period of 2024. The components of the year-over-year change were as follows:\nSegment operating profit\nOperational\n(11)\n%\nForeign currency translation\n4 \n%\nTotal % change in Segment operating profit\n(7)\n%\nThe segment operational profit decrease of 11% was primarily attributable to volume reductions in each of the segment's businesses compared with the prior year. In addition, unfavorable product and geographical mix further impacted the segment. These amounts were partially offset by integration synergies associated with the acquisition of the VCS Business and lower selling, general and administrative costs. \nClimate Solutions Asia Pacific, Middle East & Africa\nFor the three months ended September 30, 2025, \nNet sales\n were $833 million, a 1% decrease compared with the same period of 2024. The components of the year-over-year change were as follows:\nNet sales\nOrganic \n(2)\n%\nForeign currency translation\n1 \n%\nTotal % change in Net sales\n(1)\n%\nThe organic decrease in \nNet sales \nof 2% was driven by volume reductions within certain end-markets compared with the prior year. Results in China decreased (down 8%) as residential end-markets experienced economic challenges impacting both demand and price. These results were partially offset by growth within commercial end-markets in China. In addition, ongoing end-market demand and improved price in the region's remaining geographies further benefitted the segment.\nFor the three months ended September 30, 2025, \nSegment operating profit\n was $97 million, an 8% decrease compared with the same period of 2024. The components of the year-over-year change were as follows:\nSegment operating profit\nOperational\n(13)\n%\nForeign currency translation\n4 \n%\nAcquisitions and divestitures, net\n1 \n%\nTotal % change in Segment operating profit\n(8)\n%\nThe segment operational profit decrease of 13% was primarily attributable to volume reductions in certain end-markets compared with the prior year. In addition, unfavorable price and product mix further impacted segment results. These reductions were partially offset by favorable productivity initiatives, lower selling, general and administrative expenses and higher earnings from equity method investments.\n43\nClimate Solutions Transportation\nFor the three months ended September 30, 2025, \nNet sales\n were $745 million, a 20% decrease compared to the same period of 2024. The components of the year-over-year change were as follows:\nNet sales\nOrganic\n6 \n%\nForeign currency translation\n2 \n%\nAcquisitions and divestitures, net\n(28)\n%\nTotal % change in Net sales\n(20)\n%\nThe organic\n \nincrease in \nNet sales\n of 6% was primarily driven by volume growth within certain end-markets compared with the prior year. Container results increased (up 50%) due to ongoing end-market demand and improved price. These results were partially offset by lower volume in our global truck and trailer business (down 4%) primarily due to reduced end-market demand.\nFor the three months ended September 30, 2025,\n Segment operating profit\n was $115 million, a 16% decrease compared with the same period of 2024. The components of the year-over-year change were as follows:\nSegment operating profit\nOperational\n(12)\n%\nForeign currency translation\n2 \n%\nAcquisitions and divestitures, net\n(6)\n%\nTotal % change in Segment operating profit\n(16)\n%\nThe segment operational profit decrease of 12% was primarily driven by lower volumes in certain end-markets compared with the prior year. In addition, costs associated with warranty-related issues further impacted the segment. These amounts were partially offset by favorable productivity initiatives, lower selling, general and administrative costs and higher volumes in certain end-markets. However, the higher volumes led to an unfavorable mix in the segment. \n44\nNine Months Ended September 30, 2025 Compared with Nine Months Ended September 30, 2024\nSummary performance for each of our segments is as follows:\nNet sales\nSegment operating profit\nSegment operating profit margin\nNine Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n(In millions)\n2025\n2024\n2025\n2024\n2025\n2024\nClimate Solutions Americas\n$\n8,535 \n$\n8,186 \n$\n1,982 \n$\n1,888 \n23.2 \n%\n23.1 \n%\nClimate Solutions Europe\n3,712 \n3,732 \n324 \n389 \n8.7 \n%\n10.4 \n%\nClimate Solutions Asia Pacific, Middle East & Africa\n2,541 \n2,626 \n353 \n371 \n13.9 \n%\n14.1 \n%\nClimate Solutions Transportation\n2,122 \n2,794 \n340 \n388 \n16.0 \n%\n13.9 \n%\nTotal segment\n$\n16,910\n \n$\n17,338\n \n$\n2,999\n \n$\n3,036\n \n17.7\n \n%\n17.5\n \n%\nA reconciliation of \nSegment operating profit\n to Adjusted operating profit is as follows:\nNine Months Ended\nSeptember 30,\n(In millions)\n2025\n2024\nSegment operating profit\n$\n2,999 \n$\n3,036 \nCorporate and other\n(162)\n(172)\nAdjusted operating profit\n$\n2,837\n \n$\n2,864\n \nClimate Solutions Americas\nFor the nine months ended September 30, 2025, \nNet sales\n were $8.5 billion, a 4% increase compared with the same period of 2024. The components of the year-over-year change were as follows:\nNet sales\nOrganic \n4 \n%\nForeign currency translation\n— \n%\nTotal % change in Net sales\n4\n \n%\nThe organic increase in \nNet sales \nof 4% was driven by volume growth within certain end-markets compared with the prior year. Growth in our commercial business (up 27%) was primarily driven by ongoing customer demand and improved price. These results were partially offset by lower volume in our residential business (down 2%) primarily due to reduced end-market demand and distributor destocking during the current quarter. These amounts were partially offset by favorable mix and improved price. In addition, lower volume in our light commercial business (down 21%) further impacted segment results.\nFor the nine months ended September 30, 2025, \nSegment operating profit\n was $1,982 million, a 5% increase compared with the same period of 2024. The components of the year-over-year change were as follows:\nSegment operating profit\nOperational\n6 \n%\nForeign currency translation\n(1)\n%\nTotal % change in Operating profit\n5\n \n%\n45\nThe segment operational profit increase of 6% was primarily attributable to ongoing customer demand in certain end-markets compared with the prior year. In addition, favorable productivity initiatives, pricing improvements and product mix further benefited segment results. These benefits were partially offset by volume reductions in certain end-markets, lower earnings from equity method investments and higher selling, general and administrative expenses.\nClimate Solutions Europe\nFor the nine months ended September 30, 2025, \nNet sales\n were $3.7 billion, a 1% decrease compared with the same period of 2024. The components of the year-over-year change were as follows:\nNet sales\nOrganic \n(3)\n%\nForeign currency translation\n2 \n%\nTotal % change in Net sales\n(1)\n%\nThe organic decrease in \nNet sales \nof 3% was driven by ongoing challenges in certain end-markets compared with the prior year. Results in our residential and light commercial business decreased (down 5%) due to lower volumes across the region as economic conditions, inflationary cost pressures and regulatory uncertainty impacted end-market demand. These results were partially offset by growth in our commercial business (up 1%) as a result of end-market demand and improved price.\nFor the nine months ended September 30, 2025, \nSegment operating profit\n was $324 million, a 17% decrease compared with the same period of 2024. The components of the year-over-year change were as follows:\nSegment operating profit\nOperational\n(18)\n%\nForeign currency translation\n1 \n%\nTotal % change in Operating profit\n(17)\n%\nThe segment operational profit decrease of 18% was primarily attributable to volume reductions in certain end-markets compared with the prior year. In addition, unfavorable product mix and geographical mix further impacted the segment. These amounts were partially offset by favorable productivity initiatives and business integration synergies associated with the acquisition of the VCS Business. \nClimate Solutions Asia Pacific, Middle East & Africa\nFor the nine months ended September 30, 2025, \nNet sales\n were $2.5 billion, a 3% decrease compared with the same period of 2024. The components of the year-over-year change were as follows:\nNet sales\nOrganic \n(4)\n%\nForeign currency translation\n1 \n%\nTotal % change in Net sales\n(3)\n%\nThe organic decrease in \nNet sales \nof 4% was driven by volume reductions within certain end-markets compared with the prior year. Results in China decreased (down 10%) as residential end-markets experienced economic challenges impacting both demand and price. These results were partially offset by growth within commercial end-markets in China. In addition, ongoing end-market demand and improved price in the region's remaining geographies further benefited the segment.\n46\nFor the nine months ended September 30, 2025, \nSegment operating profit\n was $353 million, a 5% decrease compared with the same period of 2024. The components of the year-over-year change were as follows:\nSegment operating profit\nOperational\n(8)\n%\nForeign currency translation\n3 \n%\nTotal % change in Operating profit\n(5)\n%\nThe segment operational profit decrease of 8% was primarily attributable to volume reductions within certain end-markets compared with the prior year. In addition, unfavorable price and product mix further impacted segment results. These reductions were partially offset by favorable productivity initiatives and lower selling, general and administrative expenses.\nClimate Solutions Transportation\nFor the nine months ended September 30, 2025, \nNet sales\n were $2,122 million, a 24% decrease compared to the same period of 2024. The components of the year-over-year change were as follows:\nNet sales\nOrganic\n2 \n%\nForeign currency translation\n1 \n%\nAcquisitions and divestitures, net\n(27)\n%\nTotal % change in Net sales\n(24)\n%\nThe organic increase in \nNet sales\n of 2% was primarily driven by volume growth within certain end-markets compared with the prior year. Container results increased (up 25%) due to ongoing end-market demand and improved price. These results were partially offset by our global truck and trailer business (down 4%) as lower end-market demand in Asia and Europe more than offset flat results in North America.\nFor the nine months ended September 30, 2025, \nSegment operating profit\n was $340 million, a 12% decrease compared with the same period of 2024. The components of the year-over-year change were as follows:\nSegment operating profit\nOperational\n(10)\n%\nForeign currency translation\n1 \n%\nAcquisitions and divestitures, net\n(3)\n%\nTotal % change in Operating profit\n(12)\n%\nThe decrease in segment operational profit of 10% was primarily driven by volume reductions in certain end-markets. In addition, costs associated with warranty-related issues further impacted the segment. These amounts were partially offset by favorable productivity initiatives, lower selling, general and administrative costs and higher volumes in certain end-markets. However, the higher volumes led to an unfavorable mix in the segment.\n47\nLIQUIDITY AND FINANCIAL CONDITION\nWe assess liquidity in terms of our ability to generate adequate amounts of cash necessary to fund our current and future cash requirements to support our business and strategic initiatives. In doing so, we review and analyze our cash on hand, working capital, debt service requirements and capital expenditures. We rely on operating cash flows as our primary source of liquidity. In addition, we have access to other sources of capital to finance our strategic initiatives and fund growth.\nAs of September 30, 2025, we had cash and cash equivalents of $1.4 billion, of which approximately 94% was held by our foreign subsidiaries. We manage our worldwide cash requirements by reviewing available funds and the cost effectiveness with which we can access funds held by foreign subsidiaries. On occasion, we are required to maintain cash deposits in connection with contractual obligations related to acquisitions, divestitures or other legal obligations. As of September 30, 2025 and December 31, 2024, the amount of such restricted cash was approximately $3 million and $3 million, respectively.\nWe continue to actively manage and strengthen our business portfolio to meet the current and future needs of our customers. This is accomplished through research and development activities with a focus on new product development and new technology innovation as well as sustaining activities with a focus on improving existing products and reducing production costs. We also pursue potential acquisitions to complement existing products and services to enhance our product portfolio. In addition, we routinely conduct discussions, evaluate targets and enter into agreements regarding possible acquisitions, divestitures, joint ventures and equity investments to manage our business portfolio.\nWe believe that our available cash and operating cash flows will be sufficient to meet our future operating cash needs. Our committed credit facilities and access to the debt and equity markets provide additional sources of short-term and long-term capital to fund current operations, debt maturities and future investment opportunities. Although we believe that the arrangements currently in place permit us to finance our operations on acceptable terms and conditions, our access to and the availability of financing on acceptable terms and conditions in the future will be impacted by many factors, including: (1) our credit ratings or absence of credit ratings, (2) the level of our existing indebtedness, (3) the restrictions under our debt agreements, (4) the liquidity of the overall capital markets and (5) the state of the economy. There can be no assurance that we will be able to obtain additional financing on terms favorable to us, if at all.\nThe following table contains several key measures of our financial condition and liquidity:\n(In millions)\nSeptember 30,\n2025\nDecember 31,\n2024\nCash and cash equivalents\n$\n1,423 \n$\n3,969 \nTotal debt\n11,916 \n12,362 \nTotal equity\n14,839 \n14,395 \nNet debt (total debt less cash and cash equivalents)\n10,493 \n8,393 \nTotal capitalization (total debt plus total equity)\n26,755 \n26,757 \nNet capitalization (total debt plus total equity less cash and cash equivalents)\n25,332 \n22,788 \nTotal debt to total capitalization\n45 \n%\n46 \n%\nNet debt to net capitalization\n41 \n%\n37 \n%\nBorrowings and Lines of Credit\nWe maintain a $2.0 billion USD-denominated facility and a $500 million Euro-denominated facility as part of an unsecured, unsubordinated commercial paper program which we can use for general corporate purposes, including the funding of working capital and potential acquisitions. \nIn addition, we maintain a \n$2.5 billion revolving credit agreement with various banks (the \"Revolving Credit Facility\") \nthat matures in \nDecember 2029\n \nwhich supports our commercial paper borrowing program and can be used for general corporate purposes. A ratings-based commitment fee is charged on unused commitments. \nAs of \nSeptember 30, 2025, we had $415 million and zero borrowings outstanding under our commercial paper program and our Revolving Credit Facility, respectively.\n48\nOur short-term obligations primarily consist of current maturities of long-term debt. Our long-term obligations primarily consist of long-term notes with maturity dates ranging between 2027 and 2054. Interest payments related to long-term notes are expected to approximate $407 million per year, reflecting an approximate weighted-average interest rate of 3.64%. Any borrowings from the Revolving Credit Facility are subject to variable interest rates. See Note 5 – Borrowings and Lines of Credit in the Notes to the accompanying Unaudited Condensed Consolidated Financial Statements for additional information regarding the terms of our long-term debt obligations.\nOur credit ratings are periodically reviewed by the major independent debt-rating agencies. As of September 30, 2025, Standards & Poor's Global Inc. and Moody’s Investor Service Inc. have ratings on our debt set forth in the table below:\nRating Agency\nLong-term Rating \nShort-term Rating\nOutlook\nStandards & Poor's Global Inc.\nBBB+\nA2\nStable\nMoody's Investors Service Inc. \nBaa1\nP-2\nPositive\nPortfolio Transformation\nOn June 2, 2024, we completed the divestiture of our Access Solutions business for cash proceeds of $5.0 billion. On July 1, 2024, we completed the divestiture of our Industrial Fire business for cash proceeds of $1.4 billion. On October 1, 2024, we completed the divestiture of CCR for cash proceeds of $679 million. On December 2, 2024, we completed the divestiture of the Commercial and Residential Fire business for cash proceeds of $2.9 billion. Consistent with our capital allocation strategy, the net proceeds were used to fund repayment of debt, invest in organic and inorganic growth initiatives, capital returns to shareowners as well as for general corporate purposes.\nShare Repurchase Program\nWe may repurchase our outstanding common stock from time to time subject to market conditions and at our discretion. Repurchases occur in the open market or through one or more other public or private transactions pursuant to plans complying with Rules 10b5-1 and 10b-18 under the Exchange Act. Since the initial authorization in February 2021, our Board of Directors authorized the repurchase of up to $7.1 billion of our outstanding common stock. \nDuring the nine months ended September 30, 2025, we repurchased 36.3 million shares of common stock for an aggregate purchase price of $2.4 billion, which included shares repurchased from Viessmann. As a result, we had approximately $811 million remaining under the current authorization at September 30, 2025. In October 2025, our Board of Directors approved a $5 billion increase to our existing share repurchase program.\nDividends\nWe paid dividends on common stock during the nine months ended September 30, 2025, totaling $583 million. In October 2025, the Board of Directors declared a dividend of $0.225 per share of common stock payable on November 18, 2025, to shareowners of record at the close of business on October 29, 2025.\nDiscussion of Cash Flows\nThe following table reflects the major categories of cash flows for the following periods:\nNine Months Ended\nSeptember 30,\n(In millions)\n2025\n2024\nNet cash flows provided by (used in):\nContinuing operating activities\n$\n1,076 \n$\n1,208 \nContinuing investing activities\n(232)\n(11,331)\nContinuing financing activities\n(3,885)\n(2,939)\n49\nCash flows from continuing operating activities primarily represent inflows and outflows associated with our continuing operations. Primary activities include net earnings from continuing operations adjusted for non-cash transactions, working capital changes and changes in other assets and liabilities. The year-over-year decrease in net cash provided by continuing operating activities was primarily driven by an increase in working capital balances compared with the prior period. Higher accounts receivable and inventory balances were partially offset by higher accounts payable balances.\nCash flows from continuing investing activities primarily represent inflows and outflows associated with long-term assets. Primary activities include capital expenditures, acquisitions, divestitures and proceeds from the sale of fixed assets. During the nine months ended September 30, 2025, net cash used in continuing investing activities was $232 million. The primary driver of the outflow related to $261 million of capital expenditures which was partially offset by $120 million of cash inflow related to settlement of derivatives. During the nine months ended September 30, 2024, net cash used in continuing investing activities was $11.3 billion. The primary driver of the outflow related to the acquisition of the VCS Business, which totaled $10.8 billion, net of cash acquired. Additional investing outflows include $187 million related to settlement of derivatives and $302 million of capital expenditures.\nCash flows from continuing financing activities primarily represent inflows and outflows associated with equity or borrowings. During the nine months ended September 30, 2025, net cash used in continuing financing activities was $3.9 billion. The primary driver of the outflow was related to repurchases of our common stock totaling $2.4 billion. In addition, we made long-term debt repayments of $1.2 billion and payments of $583 million in dividends to our common shareowners. During the nine months ended September 30, 2024, net cash used in continuing financing activities was $2.9 billion. The primary driver of the outflow is due to repayment of long-term debt totaling $4.5 billion. In addition, we made dividend payments of $514 million and share repurchases of $431 million. These outflows were partially offset by the proceeds of long-term debt used to fund the cash portion of the acquisition of the VCS Business."
}