{
  "item1": "ITEM 1. BUSINESS Carrier Global Corporation (\"we\" \"our\" \"Company\") global leader intelligent climate energy solutions focus providing differentiated, digitally-enabled lifecycle solutions customers. portfolio includes industry-leading brands such Carrier, Viessmann, Toshiba, Automated Logic Carrier Transicold offer innovative heating, ventilating air conditioning (\"HVAC\"), refrigeration cold chain transportation solutions help make world safer more comfortable. also provide broad array related building services, including audit, design, installation, system integration, repair, maintenance monitoring.",
  "item7": "present after performing step zero, would perform quantitative impairment analysis estimate fair value. 2024 goodwill indefinite-lived intangible assets impairment tests, elected perform qualitative step zero assessments all tests (except one) determine if more likely than not fair values reporting units indefinite-lived intangible assets below carrying value. considered macroeconomic factors including global economic growth, general macroeconomic trends markets which reporting units operate where intangible assets utilized forecasted growth global industrial products industry. addition these macroeconomic factors, among other things, considered reporting units’ current results forecasts, changes nature each business, any significant legal, regulatory, contractual, political other business climate factors, changes industry competitive environment, changes composition carrying amount net assets any intention sell dispose reporting unit cease use any indefinite-lived intangible assets.",
  "item2": "Item 2. Management’s Discussion Analysis Financial Condition Results Operations BUSINESS OVERVIEW Carrier Global Corporation (\"we\" \"our\") global leader intelligent climate energy solutions focus providing differentiated, digitally-enabled lifecycle solutions customers. portfolio includes industry-leading brands such Carrier, Viessmann, Toshiba, Automated Logic Carrier Transicold offer innovative heating, ventilating, air conditioning (\"HVAC\") cold chain transportation solutions enhance lives live world share. also provide broad array related building services, including audit, design, installation, system integration, repair, maintenance monitoring."
}