{
  "source_file": "cat-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2.  Management’s Discussion and Analysis of Financial Condition and Results of Operations\nThe following Management’s Discussion and Analysis of Financial Condition and Results of Operations (MD&A) is intended to provide information that will assist the reader in understanding the company’s Consolidated Financial Statements, the changes in certain key items in those financial statements between select periods and the primary factors that accounted for those changes. In addition, we discuss how certain accounting principles, policies and critical estimates affect our Consolidated Financial Statements. Our discussion also contains certain forward-looking statements related to future events and expectations as well as a discussion of the many factors that we believe may have an impact on our business on an ongoing basis. This MD&A should be read in conjunction with our discussion of cautionary statements and significant risks to the company’s business under Part I, Item 1A. Risk Factors of the \n2024 Form 10-K\n. \nHighlights for the third quarter of 2025 include:\n•\nTotal sales and revenues for the third quarter of 2025 were $17.638 billion, an increase of $1.532 billion, or 10 percent, compared with $16.106 billion in the third quarter of 2024. Sales were higher across the three primary segments.\n•\nOperating profit margin was 17.3 percent for the third quarter of 2025, compared with 19.5 percent for the third quarter of 2024. \nAdjusted operating profit margin\n was 17.5 percent for the third quarter of 2025, compared with 20.0 percent for the third quarter of 2024.\n•\nThird-quarter 2025 profit per share was $4.88, and excluding the items in the table below, \nadjusted profit per share\n was $4.95. Third-quarter 2024 profit per share was $5.06, and excluding the items in the table below, adjusted profit per share was $5.17.\n•\nCaterpillar ended the third quarter of 2025 with $7.5 billion of enterprise cash. \nHighlights for the nine months ended September 30, 2025, include:\n•\nTotal sales and revenues were $48.456 billion for the nine months ended September 30, 2025, a decrease of $138 million,  compared with $48.594 billion for the nine months ended September 30, 2024.\n•\nOperating profit margin was 17.5 percent for the nine months ended September 30, 2025, compared with 20.9 percent for the nine months ended September 30, 2024. Adjusted operating profit margin was 17.8 percent for the nine months ended September 30, 2025, compared with 21.5 percent for the nine months ended September 30, 2024.\n•\nProfit per share for the nine months ended September 30, 2025, was $13.69, and excluding the items in the table below, adjusted profit per share was $13.91. Profit per share for the nine months ended September 30, 2024, was $16.27, and excluding the items in the table below, adjusted profit per share was $16.75.\n•\nEnterprise operating cash flow was $8.1 billion for the nine months ended September 30, 2025.\nIn order for our results to be more meaningful to our readers, we have separately quantified the impact of significant items. \nThree Months Ended September 30, 2025\nThree Months Ended September 30, 2024\nNine Months Ended September 30, 2025\nNine Months Ended September 30, 2024\n(Dollars in millions except per share data)\nProfit Before Taxes\nProfit \nPer Share\nProfit Before Taxes\nProfit \nPer Share\nProfit Before Taxes\nProfit \nPer Share\nProfit Before Taxes\nProfit \nPer Share\nProfit\n$\n3,127\n \n$\n4.88\n \n$\n3,098\n \n$\n5.06\n \n$\n8,515\n \n$\n13.69\n \n$\n10,130\n \n$\n16.27\n \nOther restructuring (income) costs\n37 \n0.07 \n70 \n0.11 \n126 \n0.22 \n158 \n0.26 \nRestructuring (income) costs - divestitures of certain non-U.S. entities\n— \n— \n— \n— \n— \n— \n164 \n0.22 \nAdjusted profit\n$\n3,164 \n$\n4.95 \n$\n3,168 \n$\n5.17 \n$\n8,641 \n$\n13.91 \n$\n10,452 \n$\n16.75 \nA detailed reconciliation of GAAP to non-GAAP financial measures is included on pages \n68\n-\n70\n.\nOverview\nTotal sales and revenues for the third quarter of 2025 were $17.638 billion, an increase of $1.532 billion, or 10 percent, compared with $16.106 billion in the third quarter of 2024. The increase was primarily due to higher \nsales volume\n of $1.554 billion. The increase in sales volume was mainly driven by higher sales of equipment to end users. \nThird-quarter 2025 profit per share was $4.88, compared with $5.06 profit per share in the third quarter of 2024. In the third quarter of 2025 and 2024, profit per share included restructuring costs. Profit for the third quarter of 2025 was $2.300 billion, a decrease of $164 million, or 7 percent, compared with $2.464 billion for the third quarter of 2024. The decrease was mainly due to unfavorable manufacturing costs, unfavorable price realization and higher selling, general and administrative (SG&A) and \n49\nTable of Contents\nresearch and development (R&D) expenses. This was partially offset by the profit impact of higher sales volume, favorable other operating income/expense and lower restructuring costs. \nTrends and Economic Conditions\nOutlook for Key End Markets\nIn \nConstruction Industries\n, we are encouraged by another quarter of growth in sales of equipment to end users and strong order rates across many of our regions. Customers continue to be responsive to the attractive rates through our merchandising programs with Cat Financial. We continue to anticipate growth in Construction Industries’ sales of equipment to end users in 2025 despite softness in the global industry. In North America, overall construction spending remains at healthy levels and infrastructure projects funded by the Infrastructure Investment and Jobs Act (IIJA) continue to be awarded. We continue to expect growth for sales of equipment to end users. Dealer rental revenues are also expected to grow in 2025, and dealer rental fleet loading is expected to increase in the fourth quarter of 2025 as compared to the fourth quarter of 2024. In Asia Pacific, sales of equipment to end users are expected to be about flat in 2025. China has shown positive momentum to start the year, and we expect growth in the above-10-ton excavator industry in 2025, but from a very low level of activity. In Asia Pacific, outside of China, we expect economic conditions to be soft. In \nEAME\n, we expect growth for the year, driven by healthy construction activity in Africa and the Middle East and improving economic conditions in Europe. With ongoing weaker construction activity in \nLatin America\n, we now expect to be about flat in 2025.\nIn \nResource Industries\n, we anticipate lower sales of equipment to end users in 2025 as compared to 2024, as customers continue to display capital discipline. However, we see positive momentum with healthy orders for large mining trucks, articulated trucks and large track type tractors. Although most key commodities remain above investment thresholds, declining coal prices have caused an increase in the number of parked trucks. As a result, we continue to expect slightly lower rebuild activity in 2025 as compared to 2024. Overall, customer product utilization remains high, and the age of the fleet remains elevated. We also continue to see growing demand and customer acceptance of our autonomous solutions.\nIn \nEnergy & Transportation\n, we expect strong growth in sales for Power Generation in 2025 as compared to 2024. Demand remains robust, driven by data center growth related to cloud computing and generative Artificial Intelligence (AI). Orders for prime power applications are healthy. In Oil and Gas, we expect moderate growth in 2025. For reciprocating engines and \nservices\n, we continue to expect softness in well servicing due to ongoing capital discipline, industry consolidation and efficiency improvements in our customers’ operations. We see positive momentum in demand for reciprocating engines used in gas compression applications. For turbines and turbine-related services used in Oil and Gas applications, backlog remains strong, and we see healthy order and inquiry activity. Demand for products in Industrial applications is improving from previous low levels, with order growth being driven by engines sold into electric power applications. Transportation is expected to remain stable.\nFull-Year 2025 Company Trends and Expectations\nWe are optimistic about our sales and revenues momentum supported by healthy demand signals including a robust backlog and growth in sales of equipment to end users. \nFor 2025, we expect sales and revenues to increase modestly compared to 2024. Services revenues are expected to be about flat for 2025 as compared to 2024.\nTariff and trade negotiations remain fluid. We are continuously evaluating options to further reduce the impact of incremental tariffs, and we fully intend to implement longer-term actions once there is sufficient certainty. We remain confident that we will manage the impact of tariffs over time. \nBased on the incremental tariffs announced in 2025 and in place by November 1, 2025, we expect the impact from incremental tariffs for 2025 will be around $1.6 billion to $1.75 billion, net of some mitigating actions and cost controls. This assumes that the net incremental impact of tariffs will be greater in the fourth quarter of 2025 than the third quarter of 2025, primarily due to the timing of tariff rate changes.\nIn 2025, we continue to expect restructuring costs of approximately $300 million to $350 million and capital expenditures of around $2.5 billion. We anticipate our 2025 estimated annual effective tax rate to be 24.0 percent, excluding discrete items.\n50\nTable of Contents\nFourth-Quarter 2025 Company Trends and Expectations\nIn the fourth quarter of 2025 as compared to the fourth quarter of 2024, we anticipate strong sales and revenues growth, primarily driven by higher sales volume across all three primary segments. We expect machine dealer inventory to decline slightly in the fourth quarter of 2025, compared to a $1.6 billion decrease in the fourth quarter of 2024. We expect \nprice realization\n to be roughly flat in the fourth quarter of 2025 as compared to the fourth quarter of 2024. \nIn the fourth quarter of 2025 as compared to the fourth quarter of 2024, in Construction Industries, we expect a strong sales increase, primarily driven by higher sales volume. We expect higher sales volume to be mainly driven by the impact from changes in dealer inventories. We also expect higher sales of equipment to end users. We anticipate price realization for the fourth quarter of 2025 to be about neutral as compared to the fourth quarter of 2024. In Resource Industries, we expect stronger sales in the fourth quarter of 2025 as compared to the fourth quarter of 2024, primarily driven by higher sales volume, partially offset by unfavorable price realization. We expect higher sales volume to be mainly driven by the impact from changes in dealer inventories. We expect lower sales of equipment to end users. The unfavorable impact of price realization in the fourth quarter of 2025 as compared to the fourth quarter of 2024 is expected to be slightly less than the impact in the third quarter of 2025 as compared to the third quarter of 2024. In Energy & Transportation, we anticipate strong sales growth in the fourth quarter of 2025 as compared to the fourth quarter of 2024, primarily driven by continued strength in Power Generation. We also expect higher sales in Oil and Gas, driven by turbines and turbine-related services. Price realization should remain favorable as well. The sales growth rate for Energy & Transportation in the fourth quarter of 2025, as compared to the third quarter of 2025, is expected to be slightly lower than the growth rate in the fourth quarter of 2024 as compared to the third quarter of 2024.\nIn the fourth quarter of 2025 as compared to the fourth quarter of 2024, excluding the net impact from incremental tariffs, we expect the profit impact of higher sales volume will be partially offset by unfavorable manufacturing costs. \nIn the fourth quarter of 2025, we anticipate a net incremental tariff impact of about $650 million to $800 million.\nIn the fourth quarter of 2025 as compared to the fourth quarter of 2024, in Construction Industries, excluding the net impact from incremental tariffs, we expect a profit impact of higher sales volume, which we anticipate will include a partial offset from an unfavorable mix of products. We expect about 55 percent of the net incremental tariff impact will be incurred in Construction Industries. In Resource Industries, excluding the net impact from incremental tariffs, we anticipate the profit impact from higher sales volume will be partially offset by unfavorable price realization. We expect about 20 percent of the net incremental tariff impact will be incurred in Resource Industries. In Energy & Transportation, excluding the net impact from incremental tariffs, we anticipate the profit impact from higher sales volume and favorable price realization will be partially offset by unfavorable manufacturing costs. We expect about 25 percent of the fourth quarter net incremental tariff impact will be incurred in Energy & Transportation. We anticipate incremental tariffs to have a minimal impact to \nCorporate Items and Eliminations\n in the fourth quarter of 2025 as our current assumptions are based on tariffs announced and in place by November 1, 2025.\nGlobal Business Conditions\nWe continue to monitor a variety of external factors around the world, such as supply chain disruptions, inflationary cost, labor pressures and the impact of trade policies. Areas of particular focus include transportation, certain components and raw materials. We continue to work to minimize supply chain challenges that may impact our ability to meet customer demand. We continue to assess the environment to determine if additional actions need to be taken.\nRisk Factors\nRisk factors are disclosed within Item 1A. Risk Factors of the 2024 Form 10-K.\nNotes:\n•\nGlossary of terms is included on pages \n62\n-\n64\n; first occurrence of terms shown in bold italics.\n•\nInformation on non-GAAP financial measures is included on pages \n68\n-\n70\n.\n•\nCertain amounts may not add due to rounding. \n51\nTable of Contents\nConsolidated Results of Operations\n \nTHREE MONTHS ENDED SEPTEMBER 30, 2025, COMPARED WITH THREE MONTHS ENDED SEPTEMBER 30, 2024\nCONSOLIDATED SALES AND REVENUES\nThe chart above graphically illustrates reasons for the change in consolidated sales and revenues between the third quarter of 2024 (at left) and the third quarter of 2025 (at right). Caterpillar management utilizes these charts internally to visually communicate with the company’s board of directors and employees.\nTotal sales and revenues for the third quarter of 2025 were $17.638 billion, an increase of $1.532 billion, or 10 percent, compared with $16.106 billion in the third quarter of 2024. The increase was primarily due to higher sales volume of $1.554 billion. The increase in sales volume was mainly driven by higher sales of equipment to end users.\nSales were higher across the three primary segments.\nNorth America sales increased 14 percent primarily due to higher sales volume. The increase in sales volume was mainly driven by higher sales of equipment to end users.\nSales increased 10 percent in Latin America mainly due to higher sales volume. The increase in sales volume was mainly driven by higher sales of equipment to end users.\nEAME sales increased 1 percent due to favorable currency impacts primarily related to the euro, partially offset by unfavorable price realization and lower sales volume. Lower sales volume was mainly driven by the impact from changes in dealer inventories. Dealer inventory increased less during the third quarter of 2025 than during the third quarter of 2024.\nAsia/Pacific sales increased 7 percent mainly due to higher sales volume. Higher sales volume was mainly driven by the impact from changes in dealer inventories. Dealer inventory decreased less during the third quarter of 2025 than during the third quarter of 2024.\nTotal dealer inventory increased $600 million during the third quarter of 2025, compared with an increase of $400 million during the third quarter of 2024. Machine dealer inventory increased $300 million during the third quarter of 2025, compared with an increase of $100 million in the third quarter of 2024. Dealers are independent, and the reasons for changes in their inventory levels vary, including their expectations of future demand and product delivery times. Dealers’ demand expectations take into account seasonal changes, macroeconomic conditions, machine rentals and other factors. Delivery times can vary based on availability of product from Caterpillar factories and product distribution centers.\n52\nTable of Contents\nSales and Revenues by Segment\n(Millions of dollars)\nThird Quarter 2024\nSales\nVolume\nPrice\nRealization\nCurrency\nInter-Segment / Other\nThird Quarter 2025\n$\nChange\n%\nChange\nConstruction Industries\n$\n6,345 \n$\n568 \n$\n(262)\n$\n69 \n$\n40 \n$\n6,760 \n$\n415 \n7\n%\nResource Industries\n3,048 \n138 \n(61)\n4 \n(19)\n3,110 \n62 \n2\n%\nEnergy & Transportation\n7,187 \n870 \n132 \n52 \n156 \n8,397 \n1,210 \n17\n%\nAll Other Segment\n72 \n2 \n— \n— \n(1)\n73 \n1 \n1\n%\nCorporate Items and Eliminations\n(1,421)\n(24)\n— \n7 \n(176)\n(1,614)\n(193)\n \nMachinery, Energy & Transportation\n Sales\n15,231 \n1,554 \n(191)\n132 \n— \n16,726 \n1,495 \n10\n%\nFinancial Products Segment\n1,034 \n— \n— \n— \n42 \n1,076 \n42 \n4\n%\nCorporate Items and Eliminations\n(159)\n— \n— \n— \n(5)\n(164)\n(5)\n \nFinancial Products Revenues\n875 \n— \n— \n— \n37 \n912 \n37 \n4\n%\nConsolidated Sales and Revenues\n$\n16,106 \n$\n1,554 \n$\n(191)\n$\n132 \n$\n37 \n$\n17,638 \n$\n1,532 \n10\n%\nSales and Revenues by Geographic Region\nNorth America\nLatin America\nEAME\nAsia/Pacific\nExternal Sales and Revenues\nInter-Segment\nTotal Sales and Revenues\n(Millions of dollars)\n$\n% Chg\n$\n% Chg\n$\n% Chg\n$\n% Chg\n$\n% Chg\n$\n% Chg\n$\n% Chg\nThird Quarter 2025\n \n \n \n \n \n \n \n \n \n \nConstruction Industries\n$\n3,912 \n8\n%\n$\n654 \n(1\n%)\n$\n1,217 \n6\n%\n$\n904 \n3\n%\n$\n6,687 \n6\n%\n$\n73 \n121\n%\n$\n6,760 \n7\n%\nResource Industries\n1,152 \n1\n%\n543 \n9\n%\n541 \n22\n%\n799 \n(8\n%)\n3,035 \n3\n%\n75 \n(20\n%)\n3,110 \n2\n%\nEnergy & Transportation\n4,045 \n26\n%\n559 \n24\n%\n1,367 \n(8\n%)\n1,088 \n27\n%\n7,059 \n18\n%\n1,338 \n13\n%\n8,397 \n17\n%\nAll Other Segment\n5 \n400\n%\n— \n100\n%\n2 \n100\n%\n3 \n(57\n%)\n10 \n25\n%\n63 \n(2\n%)\n73 \n1\n%\nCorporate Items and Eliminations\n(59)\n2 \n(3)\n(5)\n(65)\n(1,549)\n(1,614)\nMachinery, Energy & Transportation Sales\n9,055 \n14\n%\n1,758 \n10\n%\n3,124 \n1\n%\n2,789 \n7\n%\n16,726 \n10\n%\n— \n— \n%\n16,726 \n10\n%\nFinancial Products Segment\n722 \n4\n%\n118 \n22\n%\n130 \n—\n%\n106 \n(5\n%)\n1,076 \n1\n4\n%\n— \n— \n%\n1,076 \n4\n%\nCorporate Items and Eliminations\n(96)\n(26)\n(23)\n(19)\n(164)\n— \n(164)\nFinancial Products Revenues\n626 \n4\n%\n92 \n21\n%\n107 \n(2\n%)\n87 \n(1\n%)\n912 \n4\n%\n— \n— \n%\n912 \n4\n%\nConsolidated Sales and Revenues\n$\n9,681 \n13\n%\n$\n1,850 \n10\n%\n$\n3,231 \n1\n%\n$\n2,876 \n7\n%\n$\n17,638 \n10\n%\n$\n— \n— \n%\n$\n17,638 \n10\n%\nThird Quarter 2024\n \n \n \n \n \n \n \n \n \n \n \n \n \n \nConstruction Industries\n$\n3,629 \n$\n658 \n$\n1,150 \n$\n875 \n \n$\n6,312 \n$\n33 \n \n$\n6,345 \nResource Industries\n1,141 \n499 \n444 \n870 \n \n2,954 \n94 \n \n3,048 \nEnergy & Transportation\n3,214 \n449 \n1,486 \n856 \n \n6,005 \n1,182 \n \n7,187 \nAll Other Segment\n1 \n(1)\n1 \n7 \n \n8 \n64 \n \n72 \nCorporate Items and Eliminations\n(42)\n(3)\n9 \n(12)\n(48)\n(1,373)\n(1,421)\nMachinery, Energy & Transportation Sales\n7,943 \n \n1,602 \n \n3,090 \n \n2,596 \n \n15,231 \n \n— \n \n15,231 \n \nFinancial Products Segment\n695 \n97 \n130 \n112 \n \n1,034 \n1\n— \n \n1,034 \nCorporate Items and Eliminations\n(93)\n(21)\n(21)\n(24)\n \n(159)\n— \n \n(159)\nFinancial Products Revenues\n602 \n \n76 \n \n109 \n \n88 \n \n875 \n \n— \n \n875 \n \nConsolidated Sales and Revenues\n$\n8,545 \n \n$\n1,678 \n \n$\n3,199 \n \n$\n2,684 \n \n$\n16,106 \n \n$\n— \n \n$\n16,106 \n \n1\n Includes revenues from Machinery, Energy & Transportation o\nf $187 m\nillion and $190 million in the \nthird\n quarter of \n2025\n and \n2024\n, respectively.\n53\nTable of Contents\nCONSOLIDATED OPERATING PROFIT\nThe chart above graphically illustrates reasons for the change in consolidated operating profit between the third quarter of 2024 (at left) and the third quarter of 2025 (at right). Caterpillar management utilizes these charts internally to visually communicate with the company’s board of directors and employees. The bar titled Other includes \nconsolidating adjustments\n and \nMachinery, Energy & Transportation other operating (income) expenses\n.\nOperating profit for the third quarter of 2025 was $3.052 billion, a decrease of $95 million, or 3 percent, compared with $3.147 billion in the third quarter of 2024. The decrease was mainly due to unfavorable \nmanufacturing costs\n of $686 million, unfavorable price realization of $191 million and higher SG&A/R&D expenses of $129 million. This was partially offset by the profit impact of higher sales volume of $700 million, favorable other operating income/expense of $180 million and lower restructuring costs of $33 million. Unfavorable manufacturing costs largely reflected the impact of higher tariffs. The increase in SG&A/R&D expenses was primarily driven by higher compensation expenses, including higher short-term incentive compensation expense. Favorable other operating income/expense included proceeds from an insurance claim.\nOperating profit margin was 17.3 percent for the third quarter of 2025, compared with 19.5 percent for the third quarter of 2024.\nProfit (Loss) by Segment\n(Millions of dollars)\nThird Quarter 2025\nThird Quarter 2024\n$\nChange\n%\n \nChange\nConstruction Industries\n$\n1,377 \n$\n1,486 \n$\n(109)\n(7\n%)\nResource Industries\n499 \n619 \n(120)\n(19\n%)\nEnergy & Transportation\n1,678 \n1,433 \n245 \n17\n%\nAll Other Segment\n(6)\n(13)\n7 \n54\n%\nCorporate Items and Eliminations\n(546)\n(427)\n(119)\n \nMachinery, Energy & Transportation\n3,002 \n3,098 \n(96)\n(3\n%)\nFinancial Products Segment\n241 \n246 \n(5)\n(2\n%)\nCorporate Items and Eliminations\n(38)\n(30)\n(8)\n \nFinancial Products\n203 \n216 \n(13)\n(6\n%)\nConsolidating Adjustments\n(153)\n(167)\n14 \n \nConsolidated Operating Profit\n$\n3,052 \n$\n3,147 \n$\n(95)\n(3\n%)\n54\nTable of Contents\nOther \nProfit/Loss and Tax Items\n•\nInterest expense excluding Financial Products in the third quarter of 2025 was $133 million, compared with $125 million in the third quarter of 2024. The increase was due to higher average debt outstanding, partially offset by lower average borrowing rates.\n•\nOther income (expense) in the third quarter of 2025 was income of $208 million, compared with income of $76 million in the third quarter of 2024. The change was primarily driven by favorable foreign \ncurrency\n impacts.\n•\nThe effective tax rate for the third quarter of 2025 was 26.7 percent compared to 20.7 percent for the third quarter of 2024. Excluding the discrete items discussed below, the third-quarter 2025 estimated annual effective tax rate was 24.0 percent compared with 22.5 percent for the third quarter of 2024.\nThe company recorded a $54 million charge in the third quarter of 2025 for an increase in the estimated annual tax rate through the first six months, primarily due to a change in tax incentives driven by U.S. tax legislation enacted on July 4, 2025, which reinstated 100 percent bonus depreciation and full expensing of U.S. research and development expenditures.  \nThe company also recorded a discrete tax charge of $41 million in the third quarter of 2025, compared to discrete tax benefits of $47 million in the third quarter of 2024, to reflect changes in estimates related to prior years. In addition, a discrete tax benefit of $10 million was recorded in the third quarter of 2025, compared with a $7 million benefit in the third quarter of 2024, for the settlement of stock-based compensation awards with associated tax deductions in excess of cumulative U.S. GAAP compensation expense.\nPlease see a reconciliation of GAAP to non-GAAP financial measures on pages \n68\n-\n70\n.\nConstruction Industries\nConstruction Industries’ total sales were $6.760 billion in the third quarter of 2025, an increase of $415 million, or 7 percent, compared with $6.345 billion in the third quarter of 2024. The increase was primarily due to higher sales volume of $568 million and favorable currency impacts of $69 million, primarily related to the euro, partially offset by unfavorable price realization of $262 million. Higher sales volume was primarily driven by higher sales of equipment to end users.\n•\nIn North America, sales increased due to higher sales volume, partially offset by unfavorable price realization. Higher sales volume was mainly driven by higher sales of equipment to end users.\n•\nSales decreased in Latin America due to unfavorable price realization, partially offset by higher sales volume and favorable currency impacts primarily related to the Brazilian real. Higher sales volume was mainly driven by higher sales of equipment to end users.\n•\nIn EAME, sales increased mainly due to higher sales volume and favorable currency impacts primarily related to the euro, partially offset by unfavorable price realization. Higher sales volume was primarily driven by higher sales of equipment to end users. \n•\nSales increased in Asia/Pacific mainly due to higher sales volume and favorable currency impacts primarily related to the Japanese yen. Higher sales volume was mainly driven by the impact from changes in \ndealer inventories\n. Dealer inventory increased during the third quarter of 2025, compared with a decrease during the third quarter of 2024. \nConstruction Industries’ segment profit was $1.377 billion in the third quarter of 2025, a decrease of $109 million, or 7 percent, compared with $1.486 billion in the third quarter of 2024. The decrease was primarily due to unfavorable price realization of $262 million and unfavorable manufacturing costs of $174 million, partially offset by the profit impact of higher sales volume of $313 million. Unfavorable manufacturing costs largely reflected the impact of higher tariffs.\nConstruction Industries’ segment profit as a percent of total sales was 20.4 percent in the third quarter of 2025, compared with 23.4 percent in the third quarter of 2024.\nResource Industries\nResource Industries’ total sales were $3.110 billion in the third quarter of 2025, an increase of $62 million, or 2 percent, compared with $3.048 billion in the third quarter of 2024. The increase was primarily due to higher sales volume of $138 million, partially offset by unfavorable price realization of $61 million. The increase in sales volume was mainly driven by higher sales of equipment to end users.\nResource Industries’ segment profit was $499 million in the third quarter of 2025, a decrease of $120 million, or 19 percent, compared with $619 million in the third quarter of 2024. The decrease was mainly due to unfavorable manufacturing costs of $92 million and unfavorable price realization of $61 million, partially offset by the profit impact of higher sales volume of $49 million. Unfavorable manufacturing costs largely reflected the impact of higher tariffs.\n55\nTable of Contents\nResource Industries’ segment profit as a percent of total sales was 16.0 percent in the third quarter of 2025, compared with 20.3 percent in the third quarter of 2024.\nEnergy & Transportation\nSales by Application\n(Millions of dollars)\nThird Quarter 2025\nThird Quarter 2024\n$\nChange\n%\n \nChange\nOil and Gas\n$\n1,979 \n$\n1,656 \n$\n323 \n20\n%\nPower Generation\n2,634 \n2,011 \n623 \n31\n%\nIndustrial\n1,077 \n1,028 \n49 \n5\n%\nTransportation\n1,369 \n1,310 \n59 \n5\n%\nExternal Sales\n7,059 \n6,005 \n1,054 \n18\n%\nInter-segment\n1,338 \n1,182 \n156 \n13\n%\nTotal Sales\n$\n8,397 \n$\n7,187 \n$\n1,210 \n17\n%\nEnergy & Transportation’s total sales were $8.397 billion in the third quarter of 2025, an increase of $1.210 billion, or 17 percent, compared with $7.187 billion in the third quarter of 2024. The increase was primarily due to higher sales volume of $870 million and higher inter-segment sales of $156 million. \n•\nOil and Gas – Sales increased for turbines and turbine-related services. Sales also increased in reciprocating engines used in gas compression applications.\n•\nPower Generation – Sales increased in large reciprocating engines, primarily data center applications.\n•\nIndustrial – Sales increased in EAME, partially offset by decreased sales in Asia/Pacific.\n•\nTransportation – Sales increased in rail services.\nEnergy & Transportation’s segment profit was $1.678 billion in the third quarter of 2025, an increase of $245 million, or 17 percent, compared with $1.433 billion in the third quarter of 2024. The increase was primarily due to the profit impact of higher sales volume of $357 million and favorable price realization of $132 million, partially offset by unfavorable manufacturing costs of $287 million. Unfavorable manufacturing costs primarily reflected the impact of higher tariffs.\nEnergy & Transportation’s segment profit as a percent of total sales was 20.0 percent in the third quarter of 2025, compared with 19.9 percent in the third quarter of 2024.\nFinancial Products Segment\nFinancial Products’ segment revenues were $1.076 billion in the third quarter of 2025, an increase of $42 million, or 4 percent, compared with $1.034 billion in the third quarter of 2024. The increase was primarily due to a favorable impact from higher average \nearning assets\n of $56 million driven by North America, partially offset by an unfavorable impact from lower average financing rates of $15 million across all regions except Latin America.\nFinancial Products’ segment profit was $241 million in the third quarter of 2025, a decrease of $5 million, or 2 percent, compared with $246 million in the third quarter of 2024. The decrease was mainly due to a higher provision for credit losses at Cat Financial of $15 million, higher SG&A expenses of $7 million and an unfavorable impact from equity securities at Insurance Services of $6 million, partially offset by a favorable impact from higher average earning assets of $23 million.\nAt the end of the third quarter of 2025, past dues at Cat Financial were 1.47 percent, compared with 1.74 percent at the end of the third quarter of 2024. Write-offs, net of recoveries, were $40 million for the third quarter of 2025, compared with $27 million for the third quarter of 2024. As of September 30, 2025, Cat Financial's allowance for credit losses totaled $283 million, or 0.89 percent of finance receivables, compared with $290 million, or 0.94 percent of finance receivables at June 30, 2025. The allowance for credit losses at year-end 2024 was $267 million, or 0.91 percent of finance receivables.\nCorporate Items and Eliminations\nExpense for corporate items and eliminations was $584 million in the third quarter of 2025, an increase of $127 million from the third quarter of 2024, primarily driven by higher corporate costs, including higher short-term incentive compensation expense, and increased expenses due to timing differences, partially offset by proceeds from an insurance claim and favorable impacts of segment reporting methodology differences.\n56\nTable of Contents\nNINE MONTHS ENDED SEPTEMBER 30, 2025, COMPARED WITH NINE MONTHS ENDED SEPTEMBER 30, 2024\nCONSOLIDATED SALES AND REVENUES\nThe chart above graphically illustrates reasons for the change in consolidated sales and revenues between the nine months ended September 30, 2024 (at left) and the nine months ended September 30, 2025 (at right). Caterpillar management utilizes these charts internally to visually communicate with the company’s board of directors and employees.\nTotal sales and revenues were $48.456 billion for the nine months ended September 30, 2025, a decrease of $138 million, compared with $48.594 billion for the nine months ended September 30, 2024. Unfavorable price realization of $855 million and unfavorable currency impacts of $79 million, primarily related to the Brazilian real, were offset by higher sales volume of $681 million and higher Financial Products' revenues of $115 million. The increase in sales volume was mainly driven by higher sales of equipment to end users.\nIn the three primary segments, sales were higher in Energy & Transportation and lower in Construction Industries and Resource Industries.\nNorth America sales were about flat. Higher sales volume was offset by unfavorable price realization. The increase in sales volume was mainly driven by higher sales of equipment to end users.\nSales increased 1 percent in Latin America mainly due to higher sales volume and favorable price realization, partially offset by unfavorable currency impacts primarily related to the Brazilian real. The increase in sales volume was mainly driven by higher sales of equipment to end users. \nEAME sales decreased 2 percent primarily due to unfavorable price realization, partially offset by favorable currency impacts primarily related to the euro. \nSales decreased 2 percent in Asia/Pacific mainly due to unfavorable price realization and unfavorable currency impacts primarily related to the Australian dollar.\nDealer inventory increased about $900 million during the nine months ended September 30, 2025, compared with an increase of about $1.7 billion during the nine months ended September 30, 2024. Machine dealer inventory was about flat during the nine months ended September 30, 2025, compared with an increase of $900 million during the nine months ended September 30, 2024. Dealers are independent, and the reasons for changes in their inventory levels vary, including their expectations of future demand and product delivery times. Dealers’ demand expectations take into account seasonal changes, macroeconomic conditions, machine rentals and other factors. Delivery times can vary based on availability of product from Caterpillar factories and product distribution centers.\n57\nTable of Contents\nSales and Revenues by Segment\n(Millions of dollars)\nNine Months Ended September 30, 2024\nSales\nVolume\nPrice\nRealization\nCurrency\nInter-Segment / Other\nNine Months Ended September 30, 2025\n$\nChange\n%\nChange\nConstruction Industries\n$\n19,452 \n$\n(335)\n$\n(1,076)\n$\n(20)\n$\n113 \n$\n18,134 \n$\n(1,318)\n(7\n%)\nResource Industries\n9,491 \n(56)\n(205)\n(53)\n(56)\n9,121 \n(370)\n(4\n%)\nEnergy & Transportation\n21,205 \n1,021 \n426 \n(2)\n151 \n22,801 \n1,596 \n8\n%\nAll Other Segment\n246 \n8 \n(1)\n(1)\n(24)\n228 \n(18)\n(7\n%)\nCorporate Items and Eliminations\n(4,363)\n43 \n1 \n(3)\n(184)\n(4,506)\n(143)\n \nMachinery, Energy & Transportation Sales\n46,031 \n681 \n(855)\n(79)\n— \n45,778 \n(253)\n(1\n%)\nFinancial Products Segment\n3,029 \n— \n— \n— \n96 \n3,125 \n96 \n3\n%\nCorporate Items and Eliminations\n(466)\n— \n— \n— \n19 \n(447)\n19 \n \nFinancial Products Revenues\n2,563 \n— \n— \n— \n115 \n2,678 \n115 \n4\n%\nConsolidated Sales and Revenues\n$\n48,594 \n$\n681 \n$\n(855)\n$\n(79)\n$\n115 \n$\n48,456 \n$\n(138)\n—\n%\nSales and Revenues by Geographic Region\nNorth America\nLatin America\nEAME\nAsia/Pacific\nExternal Sales and Revenues\nInter-Segment\nTotal Sales and Revenues\n(Millions of dollars)\n$\n% Chg\n$\n% Chg\n$\n% Chg\n$\n% Chg\n$\n% Chg\n$\n% Chg\n$\n% Chg\nNine Months Ended September 30, 2025\n \n \n \n \n \n \n \n \n \n \nConstruction Industries\n$\n10,185 \n(11\n%)\n$\n1,698 \n(12\n%)\n$\n3,269 \n2\n%\n$\n2,802 \n(1\n%)\n$\n17,954 \n(7\n%)\n$\n180 \n169\n%\n$\n18,134 \n(7\n%)\nResource Industries\n3,363 \n(7\n%)\n1,645 \n10\n%\n1,451 \n7\n%\n2,442 \n(11\n%)\n8,901 \n(3\n%)\n220 \n(20\n%)\n9,121 \n(4\n%)\nEnergy & Transportation\n10,963 \n16\n%\n1,422 \n10\n%\n3,883 \n(8\n%)\n2,749 \n6\n%\n19,017 \n8\n%\n3,784 \n4\n%\n22,801 \n8\n%\nAll Other Segment\n19 \n46\n%\n— \n100\n%\n4 \n(33\n%)\n11 \n—\n%\n34 \n21\n%\n194 \n(11\n%)\n228 \n(7\n%)\nCorporate Items and Eliminations\n(103)\n(1)\n(8)\n(16)\n(128)\n(4,378)\n(4,506)\nMachinery, Energy & Transportation Sales\n24,427 \n—\n%\n4,764 \n1\n%\n8,599 \n(2\n%)\n7,988 \n(2\n%)\n45,778 \n(1\n%)\n— \n—\n%\n45,778 \n(1\n%)\nFinancial Products Segment\n2,107 \n4\n%\n322 \n8\n%\n378 \n—\n%\n318 \n(4\n%)\n3,125 \n1\n3\n%\n— \n—\n%\n3,125 \n3\n%\nCorporate Items and Eliminations\n(264)\n(65)\n(60)\n(58)\n(447)\n— \n(447)\nFinancial Products Revenues\n1,843 \n6\n%\n257 \n8\n%\n318 \n—\n%\n260 \n—\n%\n2,678 \n4\n%\n— \n—\n%\n2,678 \n4\n%\nConsolidated Sales and Revenues\n$\n26,270 \n—\n%\n$\n5,021 \n1\n%\n$\n8,917 \n(1\n%)\n$\n8,248 \n(2\n%)\n$\n48,456 \n—\n%\n$\n— \n—\n%\n$\n48,456 \n—\n%\nNine Months Ended September 30, 2024\n \n \n \n \n \n \n \n \n \n \n \n \n \n \nConstruction Industries\n$\n11,419 \n$\n1,930 \n$\n3,193 \n$\n2,843 \n \n$\n19,385 \n$\n67 \n \n$\n19,452 \nResource Industries\n3,630 \n1,499 \n1,354 \n2,732 \n \n9,215 \n276 \n \n9,491 \nEnergy & Transportation\n9,473 \n1,296 \n4,201 \n2,602 \n \n17,572 \n3,633 \n \n21,205 \nAll Other Segment\n13 \n(2)\n6 \n11 \n \n28 \n218 \n \n246 \nCorporate Items and Eliminations\n(120)\n(6)\n(23)\n(20)\n(169)\n(4,194)\n(4,363)\nMachinery, Energy & Transportation Sales\n24,415 \n \n4,717 \n \n8,731 \n \n8,168 \n \n46,031 \n \n— \n \n46,031 \n \nFinancial Products Segment\n2,022 \n299 \n377 \n331 \n \n3,029 \n1\n— \n \n3,029 \nCorporate Items and Eliminations\n(276)\n(60)\n(60)\n(70)\n \n(466)\n— \n \n(466)\nFinancial Products Revenues\n1,746 \n \n239 \n \n317 \n \n261 \n \n2,563 \n \n— \n \n2,563 \n \nConsolidated Sales and Revenues\n$\n26,161 \n \n$\n4,956 \n \n$\n9,048 \n \n$\n8,429 \n \n$\n48,594 \n \n$\n— \n \n$\n48,594 \n \n1\n Includes revenues from Machinery, Energy & Transportation of $522 million and $547 million in the nine months ended September 30, 2025 and 2024, respectively.\n58\nTable of Contents\nCONSOLIDATED OPERATING PROFIT\nThe chart above graphically illustrates reasons for the change in consolidated operating profit between the nine months ended September 30, 2024 (at left) and the nine months ended September 30, 2025 (at right). Caterpillar management utilizes these charts internally to visually communicate with the company’s board of directors and employees. The bar titled Other includes consolidating adjustments and Machinery, Energy & Transportation’s other operating (income) expenses.\nOperating profit for the nine months ended September 30, 2025, was $8.491 billion, a decrease of $1.657 billion, or 16 percent, compared with $10.148 billion for the nine months ended September 30, 2024. The decrease was primarily due to unfavorable manufacturing costs of $1.118 billion and unfavorable price realization of $855 million. Unfavorable manufacturing costs largely reflected the impact of higher tariffs.\nOperating profit margin was 17.5 percent for the nine months ended September 30, 2025, compared with 20.9 percent for the nine months ended September 30, 2024.\nProfit (Loss) by Segment\n(Millions of dollars)\nNine Months Ended September 30, 2025\nNine Months Ended September 30, 2024\n$\nChange\n%\n \nChange\nConstruction Industries\n$\n3,645 \n$\n4,991 \n$\n(1,346)\n(27\n%)\nResource Industries\n1,628 \n2,067 \n(439)\n(21\n%)\nEnergy & Transportation\n4,577 \n4,259 \n318 \n7\n%\nAll Other Segment\n(25)\n32 \n(57)\n(178\n%)\nCorporate Items and Eliminations\n(1,513)\n(1,186)\n(327)\n \nMachinery, Energy & Transportation\n8,312 \n10,163 \n(1,851)\n(18\n%)\nFinancial Products Segment\n704 \n766 \n(62)\n(8\n%)\nCorporate Items and Eliminations\n(88)\n(298)\n210 \n \nFinancial Products\n616 \n468 \n148 \n32\n%\nConsolidating Adjustments\n(437)\n(483)\n46 \n \nConsolidated Operating Profit\n$\n8,491 \n$\n10,148 \n$\n(1,657)\n(16\n%)\n59\nTable of Contents\nOther Profit/Loss and Tax Items\n•\nInterest expense excluding Financial Products for the nine months ended September 30, 2025, was $375 million, compared with $405 million for the nine months ended September 30, 2024. The decrease was due to lower average borrowing rates and lower average debt outstanding.\n•\nOther income (expense) for the nine months ended September 30, 2025, was income of $399 million, compared with income of $387 million for the nine months ended September 30, 2024. \n•\nThe effective tax rate for the nine months ended September 30, 2025, was 24.1 percent compared to 21.4 percent for the nine months ended September 30, 2024. Excluding the discrete items discussed below, the estimated annual effective tax rate for the nine months ended September 30, 2025, was 24.0 percent compared with 22.5 percent for the nine months ended September 30, 2024. The increase was primarily due to a change in tax incentives driven by U.S. tax legislation enacted on July 4, 2025, which reinstated 100 percent bonus depreciation and full expensing of U.S. research and development expenditures.\nThe company also recorded a discrete tax charge of $41 million in the nine months ended September 30, 2025, compared to discrete tax benefits of $47 million in the nine months ended September 30, 2024, to reflect changes in estimates related to prior years. A discrete tax benefit of $28 million was recorded in the nine months ended September 30, 2025, for the settlement of stock-based compensation awards with associated tax deductions in excess of cumulative U.S. GAAP compensation expense, compared with $49 million for the nine months ended September 30, 2024. In addition, the 2024 estimated annual effective tax rate excluded the impact of year-to-date losses of $164 million for the divestitures of certain non-U.S. entities with related tax benefits of $54 million.\nPlease see a reconciliation of GAAP to non-GAAP financial measures on pages \n68\n-\n70\n.\nConstruction Industries\nConstruction Industries’ total sales were $18.134 billion for the nine months ended September 30, 2025, a decrease of $1.318 billion, or 7 percent, compared with $19.452 billion for the nine months ended September 30, 2024. The decrease was primarily due to unfavorable price realization. \n•\nIn North America, sales decreased due to unfavorable price realization and lower sales volume. Lower sales volume was mainly driven by the impact from changes in dealer inventories. Dealer inventory decreased during the nine months ended September 30, 2025, compared with an increase during the nine months ended September 30, 2024.\n•\nSales decreased in Latin America due to lower sales volume, unfavorable currency impacts primary related to the Brazilian real and unfavorable price realization. Lower sales volume was mainly driven by the impact from changes in dealer inventories. Dealer inventory decreased during the nine months ended September 30, 2025, compared with an increase during the nine months ended September 30, 2024.\n•\nIn EAME, sales increased due to higher sales volume and favorable currency impacts primarily related to the euro, partially offset by unfavorable price realization. Higher sales volume was primarily due to higher sales of equipment to end users.\n•\nSales decreased in Asia/Pacific due to unfavorable price realization and unfavorable currency impacts primarily related to the Australian dollar, partially offset by higher sales volume. Higher sales volume was mainly driven by the impact from changes in dealer inventories. Dealer inventory increased during the nine months ended September 30, 2025, compared with a decrease during the nine months ended September 30, 2024.\nConstruction Industries’ profit was $3.645 billion for the nine months ended September 30, 2025, a decrease of $1.346 billion, or 27 percent, compared with $4.991 billion for the nine months ended September 30, 2024. The decrease was mainly due to unfavorable price realization of $1.076 billion and unfavorable manufacturing costs of $251 million. Unfavorable manufacturing costs largely reflected the impact of higher tariffs.\nConstruction Industries’ profit as a percent of total sales was 20.1 percent for the nine months ended September 30, 2025, compared with 25.7 percent for the nine months ended September 30, 2024.\n60\nTable of Contents\nResource Industries\nResource Industries’ total sales were $9.121 billion for the nine months ended September 30, 2025, a decrease of $370 million, or 4 percent, compared with $9.491 billion for the nine months ended September 30, 2024. The decrease was primarily due to unfavorable price realization of $205 million and lower sales volume of $56 million. The decrease in sales volume was mainly due to lower sales of equipment to end users.\nResource Industries’ profit was $1.628 billion for the nine months ended September 30, 2025, a decrease of $439 million, or 21 percent, compared with $2.067 billion for the nine months ended September 30, 2024. The decrease was mainly due to unfavorable price realization of $205 million, the profit impact of lower sales volume of $100 million, including an unfavorable mix of products, and unfavorable manufacturing costs of $98 million. Unfavorable manufacturing costs largely reflected the impact of higher tariffs.\nResource Industries’ profit as a percent of total sales was 17.8 percent for the nine months ended September 30, 2025, compared with 21.8 percent for the nine months ended September 30, 2024.\nEnergy & Transportation\nSales by Application\n(Millions of dollars)\nNine Months Ended September 30, 2025\nNine Months Ended September 30, 2024\n$\nChange\n%\n Change\nOil and Gas\n$\n5,104 \n$\n5,053 \n$\n51 \n1\n%\nPower Generation\n7,037 \n5,514 \n1,523 \n28\n%\nIndustrial\n3,104 \n3,062 \n42 \n1\n%\nTransportation\n3,772 \n3,943 \n(171)\n(4\n%)\nExternal Sales\n19,017 \n17,572 \n1,445 \n8\n%\nInter-Segment\n3,784 \n3,633 \n151 \n4\n%\nTotal Sales\n$\n22,801 \n$\n21,205 \n$\n1,596 \n8\n%\nEnergy & Transportation’s total sales were $22.801 billion for the nine months ended September 30, 2025, an increase of $1.596 billion, or 8 percent, compared with $21.205 billion for the nine months ended September 30, 2024. The increase was primarily due to higher sales volume of $1.021 billion and favorable price realization of $426 million.\n•\nOil and Gas – Sales increased in turbines and turbine-related services. The increase was partially offset by lower sales of reciprocating engines, primarily engines used in gas compression applications.  \n•\nPower Generation – Sales increased in large reciprocating engines, primarily data center applications.\n•\nIndustrial – Sales increased in EAME, partially offset by decreased sales in North America and Asia/Pacific. \n•\nTransportation – Sales decreased in marine. \nEnergy & Transportation’s profit was $4.577 billion for the nine months ended September 30, 2025, an increase of $318 million, or 7 percent, compared with $4.259 billion for the nine months ended September 30, 2024. The increase was mainly due to favorable price realization of $426 million and the profit impact of higher sales volume of $306 million, partially offset by unfavorable manufacturing costs of $481 million. Unfavorable manufacturing costs largely reflected the impact of higher tariffs.\nEnergy & Transportation’s profit as a percent of total sales was 20.1 percent for the nine months ended September 30, 2025 and for the nine months ended September 30, 2024.\nFinancial Products Segment\nFinancial Products’ segment revenues were $3.125 billion for the nine months ended September 30, 2025, an increase of $96 million, or 3 percent, compared with $3.029 billion for the nine months ended September 30, 2024. The increase was primarily due to a favorable impact from higher average earning assets of $133 million driven by North America, partially offset by an unfavorable impact from lower average financing rates of $50 million mainly in North America.\nFinancial Products’ segment profit was $704 million for the nine months ended September 30, 2025, a decrease of $62 million, or 8 percent, compared with $766 million for the nine months ended September 30, 2024. The decrease was mainly due to higher provision for credit losses at Cat Financial of $50 million, the absence of an insurance settlement of $33 million in 2024, \n61\nTable of Contents\nand an unfavorable impact from lower net yield on average earning assets of $21 million, partially offset by a favorable impact from higher average earning assets of $54 million.\nCorporate Items and Eliminations\nExpense for corporate items and eliminations was $1.601 billion for the nine months ended September 30, 2025, an increase of $117 million from the nine months ended September 30, 2024, mainly driven by increased expenses due to timing differences, higher corporate costs and unfavorable impacts of segment reporting methodology differences, partially offset by favorable \nrestructuring income/costs\n.\nRESTRUCTURING COSTS\nIn 2025, we expect to incur about $300 million to $350 million of restructuring costs.  We expect that prior restructuring actions will result in an incremental benefit to operating costs, primarily Cost of goods sold and SG&A expenses, of about $30 million in 2025 compared with 2024. \nAdditional information related to restructuring costs is included in Note 20 – \"Restructuring income/costs\" of Part I, Item 1 \"Financial Statements.\" \nGLOSSARY OF TERMS\n1.\nAdjusted Operating Profit Margin\n – Operating profit excluding restructuring income/costs as a percentage of sales and revenues.\n2.\nAdjusted Profit Per Share\n – Profit per share excluding restructuring income/costs.\n3.\nAll Other Segment\n – Primarily includes activities such as: business strategy; product management and development; parts distribution; integrated logistics solutions; electronics and control systems; distribution services responsible for dealer development and administration, including a wholly owned dealer in Japan; dealer portfolio management and ensuring the most efficient and effective distribution of machines, engines and parts; brand management and marketing strategy; research and development for automation, electronics and software for machines and engines and digital investments for new customer and dealer solutions that integrate data analytics with state-of-the-art digital technologies while transforming the buying experience.\n4.\nConsolidating Adjustments\n – Elimination of transactions between Machinery, Energy & Transportation and Financial Products.\n5.\nConstruction Industries\n – A segment primarily responsible for supporting customers using machinery in infrastructure and building construction applications. Responsibilities include business strategy, product design, product management and development, manufacturing, marketing and sales and product support. The product portfolio includes asphalt pavers; backhoe loaders; cold planers; compactors; compact track loaders; forestry machines; material handlers; motor graders; pipelayers; road reclaimers; skid steer loaders; telehandlers; track-type loaders; track-type tractors (small, medium); track excavators (mini, small, medium, large); wheel excavators; wheel loaders (compact, small, medium); and related parts and work tools.\n6.\nCorporate Items and Eliminations\n – Includes corporate-level expenses, timing differences (as some expenses are reported in segment profit on a cash basis), methodology differences between segment and consolidated external reporting, certain restructuring costs and inter-segment eliminations.\n7.\nCurrency\n – With respect to sales and revenues, currency represents the translation impact on sales resulting from changes in foreign currency exchange rates versus the U.S. dollar. With respect to operating profit, currency represents the net translation impact on sales and operating costs resulting from changes in foreign currency exchange rates versus the U.S. dollar. Currency only includes the impact on sales and operating profit for the Machinery, Energy & Transportation line of business; currency impacts on Financial Products revenues and operating profit are included in the Financial Products portions of the respective analyses. With respect to other income/expense, currency represents the effects of forward and option contracts entered into by the company to reduce the risk of fluctuations in exchange rates (hedging) and the net effect of changes in foreign currency exchange rates on our foreign currency assets and liabilities for consolidated results (translation).\n8.\nDealer Inventories\n – Represents dealer machine and engine inventories, excluding aftermarket parts.\n9.\nEAME\n – A geographic region including Europe, Africa, the Middle East and Eurasia.\n62\nTable of Contents\n10.\nEarning Assets\n – Assets consisting primarily of total finance receivables net of unearned income, plus equipment on operating leases net of accumulated depreciation at Cat Financial.\n11.\nEnergy & Transportation\n – A segment primarily responsible for supporting customers using reciprocating engines, turbines, diesel-electric locomotives and related services across industries serving Oil and Gas, Power Generation, Industrial and Transportation applications, including marine- and rail-related businesses as well as product support of on-highway engines. Responsibilities include business strategy, product design, product management, development and testing, manufacturing, marketing and sales and product support. The product and services portfolio includes turbines, centrifugal gas compressors, and turbine-related services; reciprocating engine-powered generator sets; integrated systems and solutions used in the electric power generation industry; reciprocating engines, drivetrain and integrated systems and solutions for the marine and oil and gas industries; reciprocating engines, drivetrain and integrated systems and solutions supplied to the industrial industry as well as Caterpillar machines; electrified powertrain and zero-emission power sources and service solutions development; and diesel-electric and hybrid locomotives and components and other rail-related products and services, including remanufacturing and leasing. Responsibilities also include the remanufacturing of Caterpillar reciprocating engines and components and remanufacturing services for other companies.\n12.\nFinancial Products\n – The company defines Financial Products as our finance and insurance subsidiaries, primarily Caterpillar Financial Services Corporation (Cat Financial) and Caterpillar Insurance Holdings Inc. (Insurance Services). Financial Products’ information relates to the financing to customers and dealers for the purchase and lease of Caterpillar and other equipment.\n13.\nFinancial Products Segment\n – Provides financing alternatives to customers and dealers around the world for Caterpillar products and services, as well as financing for power generation facilities that, in most cases, incorporate Caterpillar products. Financing plans include operating and finance leases, revolving charge accounts, installment sale contracts, repair/rebuild financing, working capital loans and wholesale financing plans. The segment also provides insurance and risk management products and services that help customers and dealers manage their business risk. Insurance and risk management products offered include physical damage insurance, inventory protection plans, extended service coverage and maintenance plans for machines and engines, and dealer property and casualty insurance. The various forms of financing, insurance and risk management products offered to customers and dealers help support the purchase and lease of Caterpillar equipment. The segment also earns revenues from Machinery, Energy & Transportation, but the related costs are not allocated to operating segments. Financial Products’ segment profit is determined on a pretax basis and includes other income/expense items.\n14.\nLatin America\n – A geographic region including Central and South American countries and Mexico.\n15.\nMachinery, Energy & Transportation (ME&T) \n– The company defines ME&T as Caterpillar Inc. and its subsidiaries, excluding Financial Products. ME&T’s information relates to the design, manufacturing and marketing of its products. \n16.\nMachinery, Energy & Transportation Other Operating (Income) Expenses\n – \nComprised primarily of gains/losses on disposal of long-lived assets, gains/losses on divestitures and legal settlements and accruals.\n17.\nManufacturing Costs\n – Manufacturing costs exclude the impacts of currency and represent the volume-adjusted change for variable costs and the absolute dollar change for period manufacturing costs. Variable manufacturing costs are defined as having a direct relationship with the volume of production. This includes material costs, direct labor and other costs that vary directly with production volume, such as freight, power to operate machines and supplies that are consumed in the manufacturing process. Period manufacturing costs support production but are defined as generally not having a direct relationship to short-term changes in volume. Examples include machinery and equipment repair, depreciation on manufacturing assets, facility support, procurement, factory scheduling, manufacturing planning and operations management.\n18.\nMark-to-market gains/losses\n – Represents the net gain or loss of actual results differing from the company’s assumptions and the effects of changing assumptions for our defined benefit pension and OPEB plans. These gains and losses are immediately recognized through earnings upon the annual remeasurement in the fourth quarter, or on an interim basis as triggering events warrant remeasurement.\n19.\nPension and Other Postemployment Benefits (OPEB)\n – The company’s defined-benefit pension and postretirement benefit plans.\n20.\nPrice Realization\n – The impact of net price changes excluding currency and new product introductions. Price realization includes geographic mix of sales, which is the impact of changes in the relative weighting of sales prices between geographic regions.\n63\nTable of Contents\n21.\nResource Industries\n – A segment primarily responsible for supporting customers using machinery in mining, heavy construction and quarry and aggregates. Responsibilities include business strategy, product design, product management and development, manufacturing, marketing and sales and product support. The product portfolio includes large track-type tractors; large mining trucks; hard rock vehicles; electric rope shovels; draglines; hydraulic shovels; rotary drills; large wheel loaders; off-highway trucks; articulated trucks; wheel tractor scrapers; wheel dozers; landfill compactors; soil compactors; wide-body trucks; select work tools; machinery components; wear and maintenance components and related parts. In addition to equipment, Resource Industries also sells technology products and services to provide customers fleet management, equipment management analytics, autonomous machine capabilities, safety services and mining performance solutions. Resource Industries also manages areas that provide services to other parts of the company, including strategic procurement, lean center of excellence, integrated component design and manufacturing and research and development for hydraulic systems and cabs.\n22.\nRestructuring income/costs\n – May include costs for employee separation, long-lived asset impairments, contract terminations and (gains)/losses on divestitures. These costs are included in Other operating (income) expenses except for defined-benefit plan curtailment losses and special termination benefits, which are included in Other income (expense). Restructuring costs also include other exit-related costs, which may consist of accelerated depreciation, inventory write-downs, building demolition, equipment relocation and project management costs and LIFO inventory decrement benefits from inventory liquidations at closed facilities, all of which are primarily included in Cost of goods sold.\n23.\nSales Volume\n – With respect to sales and revenues, sales volume represents the impact of changes in the quantities sold for Machinery, Energy & Transportation as well as the incremental sales impact of new product introductions, including emissions-related product updates. With respect to operating profit, sales volume represents the impact of changes in the quantities sold for Machinery, Energy & Transportation combined with product mix as well as the net operating profit impact of new product introductions, including emissions-related product updates. Product mix represents the net operating profit impact of changes in the relative weighting of Machinery, Energy & Transportation sales with respect to total sales. The impact of sales volume on segment profit includes inter-segment sales.\n24.\nServices\n – Machinery, Energy & Transportation services revenues include, but are not limited to, aftermarket parts and other service-related revenues and exclude most Financial Products revenues, discontinued products and captive dealer services.\nLIQUIDITY AND CAPITAL RESOURCES\n \nSources of funds\n \nWe generate significant capital resources from operating activities, which are the primary source of funding for our ME&T operations. Funding for these businesses is also available from commercial paper and long-term debt issuances. Financial Products’ operations are funded primarily from commercial paper, term debt issuances and collections from its existing portfolio. On a consolidated basis, we had positive operating cash flow in the first nine months of 2025 and ended the third quarter with $7.538 billion of cash, an increase of $649 million from year-end 2024. In addition, ME&T invests in available-for-sale debt securities and bank time deposits that are considered highly liquid and are available for current operations. These ME&T securities were $1.223 billion as of September 30, 2025 and are included in Prepaid expenses and other current assets and Other assets in the Consolidated Statement of Financial Position.  We intend to maintain a strong cash and liquidity position. \nConsolidated operating cash flow for the first nine months of 2025 was $8.148 billion, down $494 million compared to the same period a year ago. The decrease was primarily due to lower profit before taxes adjusted for non-cash items partially offset by lower cash taxes paid and lower working capital requirements, excluding the impact of changes in accrued wages, salaries, and employee benefits. Within working capital, changes in accounts payable and customer advances favorably impacted cash flow, partially offset by changes in inventories and receivables.\nTotal debt as of September 30, 2025 was $41.534 billion, an increase of $3.125 billion from year-end 2024. Debt related to ME&T increased $2.154 billion in the first nine months of 2025 primarily due to the issuance of new debt in the second quarter of 2025. ME&T issued $1.700 billion of ten-year bonds at 5.2 percent and $300 million of thirty-year bonds at 5.5 percent. The proceeds from the offering will be used for general corporate purposes, which may include the repayment of existing indebtedness. Debt related to Financial Products increased $2.034 billion, of which $1.000 billion is related to intercompany borrowings with ME&T.\nAs of September 30, 2025, we had three global credit facilities with a syndicate of banks totaling $11.500 billion (Credit Facility) available in the aggregate to both Caterpillar and Cat Financial for general liquidity purposes. Based on management’s \n64\nTable of Contents\nallocation decision, which can be revised from time to time, the portion of the Credit Facility available to ME&T as of September 30, 2025 was $2.875 billion. Information on our Credit Facility is as follows:\n•\nIn August 2025, we entered into a new 364-day facility of $3.500 billion (of which $875 million is available to ME&T), which expires in August 2026.\n•\nIn August 2025, we amended and extended the three-year facility (as amended and restated, the \"three-year facility\"). The three-year facility of $3.000 billion (of which $750 million is available to ME&T) expires in August 2028.\n•\nIn August 2025, we amended and extended the five-year facility (as amended and restated, the \"five-year facility\"). The five-year facility of $5.000 billion (of which $1.250 billion is available to ME&T) expires in August 2030.\nAt September 30, 2025, Caterpillar’s consolidated net worth was $20.722 billion, which was above the $9.000 billion required under the Credit Facility. The consolidated net worth is defined in the Credit Facility as Caterpillar's consolidated shareholders’ equity including preferred stock but excluding the pension and other postretirement benefits balance within Accumulated other comprehensive income (loss).\nAt September 30, 2025, Cat Financial’s covenant interest coverage ratio was 1.50 to 1. This was above the 1.15 to 1 minimum ratio calculated as (1) profit excluding income taxes, interest expense and net gain (loss) from interest rate derivatives to (2) interest expense calculated at the end of each fiscal quarter for the prior four consecutive fiscal quarter periods, required by the Credit Facility.\nIn addition, at September 30, 2025, Cat Financial’s six-month covenant leverage ratio was 7.16 to 1. This was below the maximum ratio of debt to net worth of 10 to 1, calculated (1) on a monthly basis as the average of the leverage ratios determined on the last day of each of the six preceding calendar months and (2) at each December 31, required by the Credit Facility.\nIn the event Caterpillar or Cat Financial does not meet one or more of their respective financial covenants under the Credit Facility in the future (and are unable to obtain a consent or waiver), the syndicate of banks may terminate the commitments allocated to the party that does not meet its covenants. Additionally, in such event, certain of Cat Financial’s other lenders under other loan agreements where similar financial covenants or cross default provisions are applicable may, at their election, choose to pursue remedies under those loan agreements, including accelerating the repayment of outstanding borrowings. At September 30, 2025, there were no borrowings under the Credit Facility. \nThe aforementioned financial covenants are being reported as calculated under the Credit Facility and not pursuant to U.S. GAAP. Please refer to the credit agreements governing the Credit Facility filed as an exhibit to our periodic reports for further information related to the calculation thereof. For risks related to our indebtedness and compliance with these covenants, please refer to the risk factor \"Restrictive covenants in our debt agreements could limit our financial and operating flexibility\" set forth in Part I, Item 1A of our most recent annual report on Form 10-K.\nOur total credit commitments and available credit as of September 30, 2025 were:\n \nSeptember 30, 2025\n(Millions of dollars)\nConsolidated\nMachinery,\nEnergy &\nTransportation\nFinancial\nProducts\nCredit lines available:\n \n \n \nGlobal credit facilities\n$\n11,500 \n$\n2,875 \n$\n8,625 \nOther external\n4,394 \n894 \n3,500 \nTotal credit lines available\n15,894 \n3,769 \n12,125 \nLess: Commercial paper outstanding\n(4,341)\n— \n(4,341)\nLess: Utilized credit\n(766)\n— \n(766)\nAvailable credit\n$\n10,787 \n$\n3,769 \n$\n7,018 \nThe other external consolidated credit lines with banks as of September 30, 2025 totaled $4.394 billion. These committed and uncommitted credit lines, which may be eligible for renewal at various future dates or have no specified expiration date, are used primarily by our subsidiaries for local funding requirements. Caterpillar or Cat Financial may guarantee subsidiary borrowings under these lines.\n65\nTable of Contents\nWe receive debt ratings from the major credit rating agencies. Fitch maintains a \"high-A\" debt rating, while Moody’s and S&P maintain a “mid-A” debt rating. A downgrade of our credit ratings by any of the major credit rating agencies could result in increased borrowing costs and could make access to certain credit markets more difficult. In the event economic conditions deteriorate such that access to debt markets becomes unavailable, ME&T’s operations would rely on cash flow from operations, use of existing cash balances, borrowings from Cat Financial and access to our committed credit facilities. Our Financial Products’ operations would rely on cash flow from its existing portfolio, existing cash balances, access to our committed credit facilities and other credit line facilities of Cat Financial, and borrowings from Caterpillar. In addition, we maintain a support agreement with Cat Financial, which requires Caterpillar to remain the sole owner of Cat Financial and may, under certain circumstances, require Caterpillar to make payments to Cat Financial should Cat Financial fail to maintain certain financial ratios.\nWe facilitate voluntary supplier finance programs (the “Programs”) through participating financial institutions.  We account for the payments made under the Programs, the same as other accounts payable, as a reduction to our cash flows from operations. We do not believe that changes in the availability of the programs will have a significant impact on our liquidity. Additional information related to the programs is included in Note 21 – \"Supplier finance programs\" of Part I, Item 1 \"Financial Statements.\"\nMachinery, Energy & Transportation\nNet cash provided by operating activities was $7.745 billion in the first nine months of 2025, compared with net cash provided of $7.726 billion for the same period in 2024. The increase was primarily due to lower working capital requirements; excluding the impact of changes in accrued wages, salaries, and employee benefits; and lower cash taxes paid. These increases were partially offset by lower profit before taxes, adjusted for non-cash items. Within working capital, changes in customer advances and accounts payable favorably impacted cash flow but were partially offset by changes in inventories and in receivables.\nNet cash used by investing activities in the first nine months of 2025 was $2.112 billion, compared with net cash provided of $1.009 billion in the first nine months of 2024. The change was primarily due to lower proceeds from maturities and sale of securities, primarily due to time deposit maturities in 2024; increased activity related to intercompany lending with Financial Products; and an increase in capital expenditures.\nNet cash used for financing activities during the first nine months of 2025 was $5.128 billion, compared with net cash used of $10.044 billion in the same period of 2024. The change was primarily due to lower payments to purchase common stock, higher proceeds from debt issued and lower payments on debt in the first nine months of 2025 compared to the same period in 2024. \nWhile our short-term priorities for the use of cash may vary from time to time as business needs and conditions dictate, our long-term cash deployment strategy is focused on the following priorities. Our top priority is to maintain a strong financial position in support of a mid-A rating. Next, we intend to fund operational requirements and commitments. Then, we intend to fund priorities that profitably grow the company and return capital to shareholders through dividend growth and share repurchases. Additional information on cash deployment is as follows:\nStrong financial position\n –\n Our top priority is to maintain a strong financial position in support of a mid-A rating. We track a diverse group of financial metrics that focus on liquidity, leverage, cash flow and margins which align with our cash deployment actions and the various methodologies used by the major credit rating agencies.\nOperational excellence and commitments\n –\n Capital expenditures were $1.944 billion during the first nine months of 2025, compared to $1.284 billion for the same period in 2024. We expect ME&T’s capital expenditures in 2025 to be about $2.5 billion. We made $323 million of contributions to our pension and other postretirement benefit plans during the first nine months of 2025. We currently anticipate full-year 2025 contributions of approximately $354 million. In comparison, we made $221 million of contributions to our pension and other postretirement benefit plans during the first nine months of 2024.\nFund strategic growth initiatives and return capital to shareholders\n – \nWe intend to utilize our liquidity and debt capacity to fund targeted investments that drive long-term profitable growth focused in the areas of expanded offerings, services and sustainability, including acquisitions. \n66\nTable of Contents\nAs part of our capital allocation strategy, ME&T free cash flow is a liquidity measure we use to determine the cash generated and available for financing activities including debt repayments, dividends and share repurchases. We define ME&T free cash flow as cash from ME&T operations less capital expenditures, excluding discretionary pension and other postretirement benefit plan contributions. A goal of our capital allocation strategy is to return substantially all ME&T free cash flow to shareholders over time in the form of dividends and share repurchases, while maintaining our mid-A rating.\nEach quarter, our Board of Directors reviews the company’s dividend for the applicable quarter. The Board evaluates the financial condition of the company and considers corporate cash flow, the company’s liquidity needs, the economic outlook, and the health and stability of global credit markets to determine whether to maintain or change the quarterly dividend. In October 2025, the Board of Directors approved maintaining our quarterly dividend representing $1.51 per share, and we continue to expect our strong financial position to support the dividend. Dividends paid totaled $2.043 billion in the first nine months of 2025.\nOur share repurchase plans are subject to the company’s cash deployment priorities and are evaluated on an ongoing basis considering the financial condition of the company, corporate cash flow, the company’s liquidity needs, the economic outlook, and the health and stability of global credit markets. The timing and amount of future repurchases may vary depending on market conditions and investing priorities. In May 2022, the Board approved a share repurchase authorization (the 2022 Authorization) of up to $15.0 billion of Caterpillar common stock effective August 1, 2022, with no expiration. In June 2024, the Board approved an additional share repurchase authorization (the 2024 Authorization) of up to $20.0 billion of Caterpillar common stock, effective June 12, 2024, with no expiration. In the first nine months of 2025, we repurchased $4.850 billion of Caterpillar common stock. As of September 30, 2025, the 2022 Authorization was fully utilized and $15.280 billion remained available under the 2024 Authorization. Our basic shares outstanding as of September 30, 2025 were approximately 468 million. \nFinancial Products\nNet cash provided by operating activities was $894 million in the first nine months of 2025, compared with $1.018 billion for the same period in 2024. Net cash used for investing activities was $2.150 billion in the first nine months of 2025, compared with $1.900 billion for the same period in 2024. The change was primarily due to portfolio related activity, partially offset by the 2024 divestiture of a non-U.S. subsidiary. Net cash provided by financing activities was $1.422 billion in the first nine months of 2025, compared with $890 million for the same period in 2024. The change was primarily due to increased intercompany borrowings from ME&T, partially offset by decreased external borrowings.\nRECENT ACCOUNTING PRONOUNCEMENTS\nFor a discussion of recent accounting pronouncements, see Note 2 – “New accounting guidance” of Part I, Item 1 \"Financial Statements.\"\nCRITICAL ACCOUNTING ESTIMATES\n \nFor a discussion of the company’s critical accounting estimates, see Part II, Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations in our 2024 Annual Report on Form 10-K. There have been no significant changes to our critical accounting estimates since our 2024 Annual Report on Form 10-K.\nOTHER MATTERS\n \nInformation related to legal proceedings appears in Note 14 – \"Environmental and legal matters\" of Part I, Item 1 “Financial Statements.”\nRetirement Benefits\nWe recognize \nmark-to-market gains and losses\n immediately through earnings upon the remeasurement of our pension and OPEB plans. Mark-to-market gains and losses represent the effects of actual results differing from our assumptions and the effects of changing assumptions. We will record the annual mark-to-market adjustment as of the measurement date, December 31, 2025. It is difficult to predict the December 31, 2025 adjustment amount, as it will be dependent primarily on changes in discount rates during 2025, and actual returns on plan assets differing from our expected returns for 2025. \n67\nTable of Contents\nOrder Backlog\nAt the end of the third quarter of 2025, the dollar amount of backlog believed to be firm was approximately $39.8 billion, about $2.4 billion higher than the second quarter of 2025 due to increases in the Energy & Transportation segment. Of the total backlog at September 30, 2025, approximately $12.5 billion was not expected to be filled in the following twelve months.\nNON-GAAP FINANCIAL MEASURES\nWe provide the following definitions for the non-GAAP financial measures used in this report. These non-GAAP financial measures have no standardized meaning prescribed by U.S. GAAP and therefore are unlikely to be comparable to the calculation of similar measures for other companies. Management does not intend these items to be considered in isolation or as a substitute for the related GAAP measures.\nWe believe it is important to separately quantify the profit impact of two significant items in order for the company’s results to be meaningful to our readers. These items consist of (i) other restructuring income/costs and (ii) restructuring income/costs related to the divestitures of certain non-U.S. entities in 2024. We do not consider these items indicative of earnings from ongoing business activities and believe the non-GAAP measure provides investors with useful perspective on underlying business results and trends and aids with assessing the company’s period-over-period results. \nReconciliations of adjusted results to the most directly comparable GAAP measures are as follows:\n(Dollars in millions except per share data)\nOperating Profit\nOperating Profit Margin\nProfit Before Taxes\nProvision (Benefit) for Income Taxes\nProfit\nProfit per Share\nThree Months Ended September 30, 2025 - U.S. GAAP\n$\n3,052\n \n17.3\n \n%\n$\n3,127\n \n$\n836\n \n$\n2,300\n \n$\n4.88\n \nOther restructuring (income) costs\n37 \n0.2 \n%\n37 \n9 \n28 \n0.07 \nThree Months Ended September 30, 2025 - Adjusted\n$\n3,089 \n17.5 \n%\n$\n3,164 \n$\n845 \n$\n2,328 \n$\n4.95 \nThree Months Ended September 30, 2024 - U.S. GAAP\n$\n3,147\n \n19.5\n \n%\n$\n3,098\n \n$\n642\n \n$\n2,464\n \n$\n5.06\n \nOther restructuring (income) costs\n70 \n0.5 \n%\n70 \n16 \n54 \n0.11 \nThree Months Ended September 30, 2024 - Adjusted\n$\n3,217 \n20.0 \n%\n$\n3,168 \n$\n658 \n$\n2,518 \n$\n5.17 \nNine Months Ended September 30, 2025 - U.S. GAAP\n$\n8,491\n \n17.5\n \n%\n$\n8,515\n \n$\n2,056\n \n$\n6,482\n \n$\n13.69\n \nOther restructuring (income) costs\n125 \n0.3 \n%\n126 \n29 \n100 \n0.22 \nNine Months Ended September 30, 2025 - Adjusted\n$\n8,616 \n17.8 \n%\n$\n8,641 \n$\n2,085 \n$\n6,582 \n$\n13.91 \nNine Months Ended September 30, 2024 - U.S. GAAP\n$\n10,148\n \n20.9\n \n%\n$\n10,130\n \n$\n2,166\n \n$\n8,001\n \n$\n16.27\n \nRestructuring (income) costs - divestitures of certain non-U.S. entities\n164 \n0.3 \n%\n164 \n54 \n110 \n0.22 \nOther restructuring (income) costs\n158 \n0.3 \n%\n158 \n36 \n122 \n0.26 \nNine Months Ended September 30, 2024 - Adjusted\n$\n10,470 \n21.5 \n%\n$\n10,452 \n$\n2,256 \n$\n8,233 \n$\n16.75 \nWe believe it is important to separately disclose our annual effective tax rate, excluding discrete items for our results to be meaningful to our readers. The annual effective tax rate is discussed using non-GAAP financial measures that exclude the effects of amounts associated with discrete items recorded fully in the quarter they occur. These items consist of (i) the increase in the annual effective tax rate in 2025, (ii) the impact of changes in estimates related to prior years (iii) the settlement of stock-based compensation awards with associated tax deductions in excess of cumulative U.S. GAAP compensation expense and (iv) restructuring costs related to the divestitures of certain non-U.S. entities in 2024. We believe the non-GAAP measures will provide investors with useful perspective on underlying business results and trends and aids with assessing the company's period-over-period results.\n68\nTable of Contents\nA reconciliation of our effective tax rate to annual effective tax rate, excluding discrete items is below:\n(Millions of dollars)\nProfit Before Taxes\nProvision (Benefit) for Income Taxes\nEffective Tax Rate\nThree Months Ended September 30, 2025 - U.S. GAAP\n$\n3,127\n \n$\n836\n \n26.7\n \n%\nIncrease in annual effective tax rate\n— \n(54)\nChanges in estimates related to prior years\n— \n(41)\nExcess stock-based compensation\n— \n10 \nAnnual effective tax rate, excluding discrete items\n3,127 \n751 \n24.0 \n%\nIncrease in annual effective tax rate\n— \n54 \nChanges in estimates related to prior years\n— \n41 \nExcess stock-based compensation\n— \n(10)\nOther restructuring (income) costs\n37 \n9 \nThree Months Ended September 30, 2025 - Adjusted\n$\n3,164 \n$\n845 \nThree Months Ended September 30, 2024 - U.S. GAAP\n$\n3,098\n \n$\n642\n \n20.7\n \n%\nChanges in estimates related to prior years\n— \n47 \nExcess stock-based compensation\n— \n7 \nAnnual effective tax rate, excluding discrete items\n3,098 \n696 \n22.5 \n%\nChanges in estimates related to prior years\n— \n(47)\nExcess stock-based compensation\n— \n(7)\nOther restructuring (income) costs\n70 \n16 \nThree Months Ended September 30, 2024 - Adjusted\n$\n3,168 \n$\n658 \nNine Months Ended September 30, 2025 - U.S. GAAP\n$\n8,515\n \n$\n2,056\n \n24.1\n \n%\nChanges in estimates related to prior years\n— \n(41)\nExcess stock-based compensation\n— \n28 \nAnnual effective tax rate, excluding discrete items\n8,515 \n2,043 \n24.0 \n%\nChanges in estimates related to prior years\n— \n41 \nExcess stock-based compensation\n— \n(28)\nOther restructuring (income) costs\n126 \n29 \nNine Months Ended September 30, 2025 - Adjusted\n$\n8,641 \n$\n2,085 \nNine Months Ended September 30, 2024 - U.S. GAAP\n$\n10,130\n \n$\n2,166\n \n21.4\n \n%\nRestructuring (income) costs - divestitures of certain non-U.S. entities\n164 \n54 \nChanges in estimates related to prior years\n— \n47 \nExcess stock-based compensation\n— \n49 \nAnnual effective tax rate, excluding discrete items\n10,294 \n2,316 \n22.5 \n%\nChanges in estimates related to prior years\n— \n(47)\nExcess stock-based compensation\n— \n(49)\nOther restructuring (income) costs\n158 \n36 \nNine Months Ended September 30, 2024 - Adjusted\n$\n10,452 \n$\n2,256 \nIn addition, we provide a calculation of ME&T free cash flow as we believe it is an important measure for investors to determine the cash generation available for financing activities including debt repayments, dividends and share repurchases. \n69\nTable of Contents\nReconciliations of ME&T free cash flow to the most directly comparable GAAP measure, net cash provided by operating activities are as follows:\n(Millions of dollars)\nNine Months Ended September 30,\n2025\n2024\nME&T net cash provided by operating activities \n1\n$\n7,745 \n$\n7,726 \nME&T capital expenditures\n(1,944)\n(1,284)\nME&T free cash flow\n$\n5,801 \n$\n6,442 \n1 \nSee reconciliation of ME&T net cash provided by operating activities to consolidated net cash provided by operating activities on pages \n77\n-\n78\n. \n  Supplemental Consolidating Data\n \nWe are providing supplemental consolidating data for the purpose of additional analysis.  The data has been grouped as follows:\n \nConsolidated –\n Caterpillar Inc. and its subsidiaries.\n \nMachinery, Energy & Transportation –\n We define ME&T as it is presented in the supplemental data as Caterpillar Inc. and its subsidiaries, excluding Financial Products. ME&T’s information relates to the design, manufacturing and marketing of our products.\n \nFinancial Products –\n We define Financial Products as it is presented in the supplemental data as our finance and insurance subsidiaries, primarily Caterpillar Financial Services Corporation (Cat Financial) and Caterpillar Insurance Holdings Inc. (Insurance Services).  Financial Products’ information relates to the financing to customers and dealers for the purchase and lease of Caterpillar and other equipment.\n \nConsolidating Adjustments –\n Eliminations of transactions between ME&T and Financial Products.\n \nThe nature of the ME&T and Financial Products businesses is different, especially with regard to the financial position and cash flow items. Caterpillar management utilizes this presentation internally to highlight these differences. We believe this presentation will assist readers in understanding our business.\nPages \n71\n-\n78\n reconcile ME&T and Financial Products to Caterpillar Inc. consolidated financial information. \n70\nTable of Contents\nCaterpillar Inc.\nSupplemental Data for Results of Operations\nFor the Three Months Ended September 30, 2025 \n(Unaudited)\n(Millions of dollars)\n \n \nSupplemental Consolidating Data\n \nConsolidated\nMachinery,\nEnergy &\nTransportation \nFinancial\nProducts\nConsolidating\nAdjustments\nSales and revenues:\n \n \n \n \nSales of Machinery, Energy & Transportation\n$\n16,726 \n$\n16,726 \n$\n— \n$\n— \nRevenues of Financial Products\n912 \n— \n1,115 \n(203)\n1\nTotal sales and revenues\n17,638 \n16,726 \n1,115 \n(203)\nOperating costs:\n \n \n \n \nCost of goods sold\n11,673 \n11,675 \n— \n(2)\n2\nSelling, general and administrative expenses\n1,822 \n1,608 \n218 \n(4)\n2\nResearch and development expenses\n555 \n555 \n— \n— \nInterest expense of Financial Products\n346 \n— \n358 \n(12)\n2\nOther operating (income) expenses\n190 \n(114)\n336 \n(32)\n2\nTotal operating costs\n14,586 \n13,724 \n912 \n(50)\nOperating profit\n3,052 \n3,002 \n203 \n(153)\nInterest expense excluding Financial Products\n133 \n136 \n— \n(3)\n3\nOther income (expense)\n208 \n25 \n33 \n150 \n4\nConsolidated profit before taxes\n3,127 \n2,891 \n236 \n— \nProvision (benefit) for income taxes\n836 \n773 \n63 \n— \nProfit of consolidated companies\n2,291 \n2,118 \n173 \n— \nEquity in profit (loss) of unconsolidated affiliated companies\n8 \n8 \n— \n— \nProfit of consolidated and affiliated companies\n2,299 \n2,126 \n173 \n— \nLess: Profit (loss) attributable to noncontrolling interests\n(1)\n(1)\n— \n— \nProfit\n \n5\n$\n2,300 \n$\n2,127 \n$\n173 \n$\n— \n \n1\nElimination of Financial Products’ revenues earned from ME&T.\n2\nElimination of net expenses recorded between ME&T and Financial Products.\n3\nElimination of interest expense recorded between Financial Products and ME&T.\n4\nElimination of discount recorded by ME&T on receivables sold to Financial Products and of interest earned between ME&T and Financial Products as well as dividends paid by Financial Products to ME&T.\n5\nProfit attributable to common shareholders.\n71\nTable of Contents\nCaterpillar Inc.\nSupplemental Data for Results of Operations\nFor the Nine Months Ended September 30, 2025 \n(Unaudited)\n(Millions of dollars)\n \n \n \nSupplemental Consolidating Data\n \nConsolidated\nMachinery, Energy & Transportation \nFinancial\nProducts\nConsolidating\nAdjustments\nSales and revenues:\n \n \n \n \nSales of Machinery, Energy & Transportation\n$\n45,778 \n$\n45,778 \n$\n— \n$\n— \nRevenues of Financial Products\n2,678 \n— \n3,244 \n(566)\n1\nTotal sales and revenues\n48,456 \n45,778 \n3,244 \n(566)\nOperating costs:\n \n \n \n \nCost of goods sold\n31,445 \n31,451 \n— \n(6)\n2\nSelling, general and administrative expenses\n5,109 \n4,513 \n623 \n(27)\n2\nResearch and development expenses\n1,586 \n1,586 \n— \n— \nInterest expense of Financial Products\n1,008 \n— \n1,026 \n(18)\n2\nOther operating (income) expenses\n817 \n(84)\n979 \n(78)\n2\nTotal operating costs\n39,965 \n37,466 \n2,628 \n(129)\nOperating profit\n8,491 \n8,312 \n616 \n(437)\nInterest expense excluding Financial Products\n375 \n385 \n— \n(10)\n3\nOther income (expense)\n399 \n(121)\n93 \n427 \n4\nConsolidated profit before taxes\n8,515 \n7,806 \n709 \n— \nProvision (benefit) for income taxes\n2,056 \n1,878 \n178 \n— \nProfit of consolidated companies\n6,459 \n5,928 \n531 \n— \nEquity in profit (loss) of unconsolidated affiliated companies\n22 \n22 \n— \n— \nProfit of consolidated and affiliated companies\n6,481 \n5,950 \n531 \n— \nLess: Profit (loss) attributable to noncontrolling interests\n(1)\n(2)\n1 \n— \nProfit\n \n5\n$\n6,482 \n$\n5,952 \n$\n530 \n$\n— \n \n1\nElimination of Financial Products’ revenues earned from ME&T.\n2\nElimination of net expenses recorded between ME&T and Financial Products.\n3\nElimination of interest expense recorded between Financial Products and ME&T.\n4\nElimination of discount recorded by ME&T on receivables sold to Financial Products and of interest earned between ME&T and Financial Products as well as dividends paid by Financial Products to ME&T.\n5\nProfit attributable to common shareholders.\n72\nTable of Contents\nCaterpillar Inc.\nSupplemental Data for Results of Operations\nFor the Three Months Ended September 30, 2024 \n(Unaudited)\n(Millions of dollars)\n \n \nSupplemental Consolidating Data\n \nConsolidated\nMachinery,\nEnergy &\nTransportation\nFinancial\nProducts\nConsolidating\nAdjustments\nSales and revenues:\n \n \n \n \nSales of Machinery, Energy & Transportation\n$\n15,231 \n$\n15,231 \n$\n— \n$\n— \nRevenues of Financial Products\n875 \n— \n1,078 \n(203)\n1\nTotal sales and revenues\n16,106 \n15,231 \n1,078 \n(203)\nOperating costs:\n \n \n \n \nCost of goods sold\n10,066 \n10,067 \n— \n(1)\n2\nSelling, general and administrative expenses\n1,669 \n1,484 \n197 \n(12)\n2\nResearch and development expenses\n533 \n533 \n— \n— \nInterest expense of Financial Products\n336 \n— \n336 \n— \nOther operating (income) expenses\n355 \n49 \n329 \n(23)\n2\nTotal operating costs\n12,959 \n12,133 \n862 \n(36)\nOperating profit\n3,147 \n3,098 \n216 \n(167)\nInterest expense excluding Financial Products\n125 \n127 \n— \n(2)\nOther income (expense)\n76 \n(122)\n33 \n165 \n3\nConsolidated profit before taxes\n3,098 \n2,849 \n249 \n— \nProvision (benefit) for income taxes\n642 \n582 \n60 \n— \nProfit of consolidated companies\n2,456 \n2,267 \n189 \n— \nEquity in profit (loss) of unconsolidated affiliated companies\n7 \n7 \n— \n— \nProfit of consolidated and affiliated companies\n2,463 \n2,274 \n189 \n— \nLess: Profit (loss) attributable to noncontrolling interests\n(1)\n(1)\n— \n— \nProfit\n 4\n$\n2,464 \n$\n2,275 \n$\n189 \n$\n— \n \n1\nElimination of Financial Products’ revenues earned from ME&T.\n2\nElimination of net expenses recorded by ME&T paid to Financial Products.\n3\nElimination of discount recorded by ME&T on receivables sold to Financial Products and of interest earned between ME&T and Financial Products as well as dividends paid by Financial Products to ME&T.\n4\nProfit attributable to common shareholders.\n \n73\nTable of Contents\nCaterpillar Inc.\nSupplemental Data for Results of Operations\nFor the Nine Months Ended September 30, 2024 \n(Unaudited)\n(Millions of dollars)\n \n \nSupplemental Consolidating Data\n \nConsolidated\nMachinery,\nEnergy &\nTransportation\nFinancial\nProducts\nConsolidating\nAdjustments\nSales and revenues:\n \n \n \n \nSales of Machinery, Energy & Transportation\n$\n46,031 \n$\n46,031 \n$\n— \n$\n— \nRevenues of Financial Products\n2,563 \n— \n3,150 \n(587)\n1\nTotal sales and revenues\n48,594 \n46,031 \n3,150 \n(587)\nOperating costs:\n \n \n \n \nCost of goods sold\n29,878 \n29,883 \n— \n(5)\n2\nSelling, general and administrative expenses\n4,898 \n4,346 \n560 \n(8)\n2\nResearch and development expenses\n1,588 \n1,588 \n— \n— \nInterest expense of Financial Products\n948 \n— \n948 \n— \nOther operating (income) expenses\n1,134 \n51 \n1,174 \n(91)\n2\nTotal operating costs\n38,446 \n35,868 \n2,682 \n(104)\nOperating profit\n10,148 \n10,163 \n468 \n(483)\nInterest expense excluding Financial Products\n405 \n407 \n— \n(2)\nOther income (expense)\n387 \n(163)\n69 \n481 \n3\nConsolidated profit before taxes\n10,130 \n9,593 \n537 \n— \nProvision (benefit) for income taxes\n2,166 \n1,983 \n183 \n— \nProfit of consolidated companies\n7,964 \n7,610 \n354 \n— \nEquity in profit (loss) of unconsolidated affiliated companies\n34 \n34 \n— \n— \nProfit of consolidated and affiliated companies\n7,998 \n7,644 \n354 \n— \nLess: Profit (loss) attributable to noncontrolling interests\n(3)\n(4)\n1 \n— \nProfit\n 4\n$\n8,001 \n$\n7,648 \n$\n353 \n$\n— \n \n1\nElimination of Financial Products’ revenues earned from ME&T.\n2\nElimination of net expenses recorded between ME&T and Financial Products.\n3\nElimination of discount recorded by ME&T on receivables sold to Financial Products and of interest earned between ME&T and Financial Products as well as dividends paid by Financial Products to ME&T.\n4\nProfit attributable to common shareholders.\n74\nTable of Contents\nCaterpillar Inc.\nSupplemental Data for Financial Position\nAt September 30, 2025 \n(Unaudited)\n(Millions of dollars)\n \n \nSupplemental Consolidating Data\n \nConsolidated\nMachinery,\nEnergy &\nTransportation\nFinancial\nProducts\nConsolidating\nAdjustments\nAssets\n \n \n \n \nCurrent assets:\n \n \n \n \nCash and cash equivalents\n$\n7,538 \n$\n6,633 \n$\n905 \n$\n— \nReceivables – trade and other\n10,146 \n3,531 \n542 \n6,073 \n1,2\nReceivables – finance\n10,315 \n— \n16,665 \n(6,350)\n2\nPrepaid expenses and other current assets\n2,861 \n2,659 \n440 \n(238)\n3\nInventories\n18,958 \n18,958 \n— \n— \nTotal current assets\n49,818 \n31,781 \n18,552 \n(515)\nProperty, plant and equipment – net\n14,310 \n10,348 \n3,962 \n— \nLong-term receivables – trade and other\n1,618 \n1,712 \n166 \n(260)\n1,2\nLong-term receivables – finance\n13,985 \n— \n14,948 \n(963)\n2\nNoncurrent deferred and refundable income taxes\n3,000 \n3,264 \n130 \n(394)\n4\nIntangible assets\n281 \n281 \n— \n— \nGoodwill\n5,329 \n5,329 \n— \n— \nOther assets\n5,381 \n3,923 \n2,468 \n(1,010)\n5\nTotal assets\n$\n93,722 \n$\n56,638 \n$\n40,226 \n$\n(3,142)\nLiabilities\n \n \n \n \nCurrent liabilities:\n \n \n \n \nShort-term borrowings\n$\n4,509 \n$\n— \n$\n4,509 \n$\n— \nAccounts payable\n8,729 \n8,636 \n391 \n(298)\n6,7\nAccrued expenses\n5,187 \n4,558 \n629 \n— \nAccrued wages, salaries and employee benefits\n2,126 \n2,081 \n45 \n— \nCustomer advances\n3,391 \n3,359 \n3 \n29 \n7\nDividends payable\n— \n— \n— \n— \nOther current liabilities\n2,760 \n2,209 \n806 \n(255)\n4,5,8\nLong-term debt due within one year\n9,289 \n32 \n9,257 \n— \nTotal current liabilities\n35,991 \n20,875 \n15,640 \n(524)\nLong-term debt due after one year\n27,736 \n10,899 \n18,067 \n(1,230)\n7,9\nLiability for postemployment benefits\n3,664 \n3,663 \n1 \n— \nOther liabilities\n5,672 \n4,679 \n1,407 \n(414)\n4,5\nTotal liabilities\n73,063 \n40,116 \n35,115 \n(2,168)\nCommitments and contingencies\n \n \n \n \nShareholders’ equity\n \n \n \n \nCommon stock\n6,223 \n6,223 \n905 \n(905)\n10\nTreasury stock\n(48,302)\n(48,302)\n— \n— \nProfit employed in the business\n64,460 \n59,365 \n5,085 \n10 \n10\nAccumulated other comprehensive income (loss)\n(1,723)\n(768)\n(955)\n— \nNoncontrolling interests\n1 \n4 \n76 \n(79)\n10\nTotal shareholders’ equity\n20,659 \n16,522 \n5,111 \n(974)\nTotal liabilities and shareholders’ equity\n$\n93,722 \n$\n56,638 \n$\n40,226 \n$\n(3,142)\n1     \nElimination of receivables between ME&T and Financial Products.\n2     \nReclassification of ME&T’s trade receivables purchased by Financial Products and Financial Products’ wholesale inventory receivables.\n3     \nElimination of ME&T’s insurance premiums that are prepaid to Financial Products.\n4     \nReclassification reflecting required netting of deferred tax assets/liabilities by taxing jurisdiction.\n5     \nElimination of other intercompany assets and liabilities between ME&T and Financial Products.\n6     \nElimination of payables between ME&T and Financial Products.\n7     \nReclassification of Financial Products' payables to customer advances.\n8     \nElimination of prepaid insurance in Financial Products’ other liabilities.\n9     \nElimination of debt between ME&T and Financial Products.\n10     \nEliminations associated with ME&T’s investments in Financial Products’ subsidiaries.\n75\nTable of Contents\nCaterpillar Inc.\nSupplemental Data for Financial Position\nAt December 31, 2024 \n(Unaudited)\n(Millions of dollars)\n \n \nSupplemental Consolidating Data\n \nConsolidated\nMachinery,\nEnergy &\nTransportation\nFinancial\nProducts\nConsolidating\nAdjustments\nAssets\n \n \n \n \nCurrent assets:\n \n \n \n \nCash and cash equivalents\n$\n6,889 \n$\n6,165 \n$\n724 \n$\n— \nReceivables – trade and other\n9,282 \n3,463 \n688 \n5,131 \n1,2\nReceivables – finance\n9,565 \n— \n14,957 \n(5,392)\n2\nPrepaid expenses and other current assets\n3,119 \n2,872 \n401 \n(154)\n3\nInventories\n16,827 \n16,827 \n— \n— \nTotal current assets\n45,682 \n29,327 \n16,770 \n(415)\nProperty, plant and equipment – net\n13,361 \n9,531 \n3,830 \n— \nLong-term receivables – trade and other\n1,225 \n500 \n86 \n639 \n1,2\nLong-term receivables – finance\n13,242 \n— \n14,048 \n(806)\n2\nNoncurrent deferred and refundable income taxes\n3,312 \n3,594 \n118 \n(400)\n4\nIntangible assets\n399 \n399 \n— \n— \nGoodwill\n5,241 \n5,241 \n— \n— \nOther assets\n5,302 \n4,050 \n2,277 \n(1,025)\n5\nTotal assets\n$\n87,764 \n$\n52,642 \n$\n37,129 \n$\n(2,007)\nLiabilities\n \n \n \n \nCurrent liabilities:\n \n \n \n \nShort-term borrowings\n$\n4,393 \n$\n— \n$\n4,393 \n$\n— \nAccounts payable\n7,675 \n7,619 \n331 \n(275)\n6,7\nAccrued expenses\n5,243 \n4,589 \n654 \n— \nAccrued wages, salaries and employee benefits\n2,391 \n2,335 \n56 \n— \nCustomer advances\n2,322 \n2,305 \n3 \n14 \n7\nDividends payable\n674 \n674 \n— \n— \nOther current liabilities\n2,909 \n2,388 \n696 \n(175)\n4,8\nLong-term debt due within one year\n6,665 \n46 \n6,619 \n— \nTotal current liabilities\n32,272 \n19,956 \n12,752 \n(436)\nLong-term debt due after one year\n27,351 \n8,731 \n18,787 \n(167)\n9\nLiability for postemployment benefits\n3,757 \n3,757 \n— \n— \nOther liabilities\n4,890 \n3,977 \n1,344 \n(431)\n4\nTotal liabilities\n68,270 \n36,421 \n32,883 \n(1,034)\nCommitments and contingencies\n \n \n \n \nShareholders’ equity\n \n \n \n \nCommon stock\n6,941 \n6,941 \n905 \n(905)\n10\nTreasury stock\n(44,331)\n(44,331)\n— \n— \nProfit employed in the business\n59,352 \n54,787 \n4,555 \n10 \n10\nAccumulated other comprehensive income (loss)\n(2,471)\n(1,182)\n(1,289)\n— \nNoncontrolling interests\n3 \n6 \n75 \n(78)\n10\nTotal shareholders’ equity\n19,494 \n16,221 \n4,246 \n(973)\nTotal liabilities and shareholders’ equity\n$\n87,764 \n$\n52,642 \n$\n37,129 \n$\n(2,007)\n \n1     \nElimination of receivables between ME&T and Financial Products.\n2     \nReclassification of ME&T’s trade receivables purchased by Financial Products and Financial Products’ wholesale inventory receivables.\n3     \nElimination of ME&T’s insurance premiums that are prepaid to Financial Products.\n4     \nReclassification reflecting required netting of deferred tax assets/liabilities by taxing jurisdiction.\n5    \n Elimination of other intercompany assets between ME&T and Financial Products.\n6    \n Elimination of payables between ME&T and Financial Products.\n7     \nReclassification of Financial Products' payables to customer advances.\n8     \nElimination of prepaid insurance in Financial Products' other liabilities.\n9     \nElimination of debt between ME&T and Financial Products.\n10     \nEliminations associated with ME&T’s investments in Financial Products’ subsidiaries. \n76\nTable of Contents\nCaterpillar Inc.\nSupplemental Data for Cash Flow\nFor the Nine Months Ended September 30, 2025 \n(Unaudited)\n(Millions of dollars)\n \n \nSupplemental Consolidating Data\n \nConsolidated\nMachinery,\nEnergy &\nTransportation\nFinancial\nProducts\nConsolidating\nAdjustments\nCash flow from operating activities:\n \n \n \n \nProfit of consolidated and affiliated companies\n$\n6,481 \n$\n5,950 \n$\n531 \n$\n— \nAdjustments to reconcile profit to net cash provided by operating activities:\n \n \n \n \nDepreciation and amortization\n1,664 \n1,096 \n568 \n— \nProvision (benefit) for deferred income taxes\n300 \n308 \n(8)\n— \nOther\n509 \n431 \n(412)\n490 \n1\nChanges in assets and liabilities, net of acquisitions and divestitures:\nReceivables – trade and other\n(788)\n89 \n102 \n(979)\n1,2\nInventories\n(2,015)\n(2,012)\n— \n(3)\n1\nAccounts payable\n1,086 \n1,051 \n44 \n(9)\n1\nAccrued expenses\n51 \n161 \n(110)\n— \nAccrued wages, salaries and employee benefits\n(296)\n(284)\n(12)\n— \nCustomer advances\n1,649 \n1,649 \n— \n— \nOther assets – net\n(138)\n(219)\n15 \n66 \n1\nOther liabilities – net\n(355)\n(475)\n176 \n(56)\n1\nNet cash provided by (used for) operating activities\n8,148 \n7,745 \n894 \n(491)\nCash flow from investing activities:\n \n \n \n \nCapital expenditures – excluding equipment leased to others\n(1,923)\n(1,920)\n(33)\n30 \n1\nExpenditures for equipment leased to others\n(1,021)\n(24)\n(1,004)\n7 \n1\nProceeds from disposals of leased assets and property, plant and equipment\n544 \n54 \n524 \n(34)\n1\nAdditions to finance receivables\n(10,964)\n— \n(12,668)\n1,704 \n2\nCollections of finance receivables\n9,890 \n— \n11,347 \n(1,457)\n2\nNet intercompany purchased receivables\n— \n— \n(241)\n241 \n2\nProceeds from sale of finance receivables\n26 \n— \n26 \n— \nAdditions to intercompany receivables (original maturities greater than three months)\n— \n(1,000)\n— \n1,000 \n3\nCollections of intercompany receivables (original maturities greater than three months)\n— \n— \n56 \n(56)\n3\nInvestments and acquisitions (net of cash acquired)\n(26)\n(26)\n— \n— \nProceeds from sale of businesses and investments (net of cash sold)\n12 \n12 \n— \n— \nProceeds from maturities and sale of securities\n1,945 \n1,259 \n686 \n— \nInvestments in securities\n(1,291)\n(510)\n(781)\n— \nOther – net\n(19)\n43 \n(62)\n— \nNet cash provided by (used for) investing activities\n(2,827)\n(2,112)\n(2,150)\n1,435 \nCash flow from financing activities:\n \n \n \n \nDividends paid\n(2,043)\n(2,043)\n— \n— \nCommon stock issued, and other stock compensation transactions, net\n(39)\n(39)\n— \n— \nPayments to purchase common stock\n(4,850)\n(4,850)\n— \n— \nExcise tax paid on purchases of common stock \n(73)\n(73)\n— \n— \nProceeds from intercompany borrowings (original maturities greater than three months)\n— \n— \n1,000 \n(1,000)\n3\nPayments on intercompany borrowings (original maturities greater than three months)\n— \n(56)\n— \n56 \n3\nProceeds from debt issued (original maturities greater than three months)\n8,454 \n1,976 \n6,478 \n— \nPayments on debt (original maturities greater than three months)\n(6,205)\n(43)\n(6,162)\n— \nShort-term borrowings – net (original maturities three months or less)\n106 \n— \n106 \n— \nNet cash provided by (used for) financing activities\n(4,650)\n(5,128)\n1,422 \n(944)\nEffect of exchange rate changes on cash\n(23)\n(39)\n16 \n— \nIncrease (decrease) in cash, cash equivalents and restricted cash\n648 \n466 \n182 \n— \nCash, cash equivalents and restricted cash at beginning of period\n6,896 \n6,170 \n726 \n— \nCash, cash equivalents and restricted cash at end of period\n$\n7,544 \n$\n6,636 \n$\n908 \n$\n— \n1    \nElimination of non-cash adjustments and changes in assets and liabilities related to consolidated reporting.\n2    \nReclassification of Financial Products’ cash flow activity from investing to operating for receivables that arose from the sale of inventory.\n3    \nElimination of proceeds and payments to/from ME&T and Financial Products.\n77\nTable of Contents\nCaterpillar Inc.\nSupplemental Data for Cash Flow\nFor the Nine Months Ended September 30, 2024 \n(Unaudited)\n(Millions of dollars)\n \n \nSupplemental Consolidating Data\n \nConsolidated\nMachinery,\nEnergy &\nTransportation\nFinancial\nProducts\nConsolidating\nAdjustments\nCash flow from operating activities:\n \n \n \n \nProfit of consolidated and affiliated companies\n$\n7,998 \n$\n7,644 \n$\n354 \n$\n— \nAdjustments to reconcile profit to net cash provided by operating activities:\n \n \n \n \nDepreciation and amortization\n1,598 \n1,010 \n588 \n— \nProvision (benefit) for deferred income taxes\n(329)\n(277)\n(52)\n— \n(Gain) loss on divestiture\n164 \n(46)\n210 \n— \nOther\n221 \n236 \n(447)\n432 \n1\nChanges in assets and liabilities, net of acquisitions and divestitures:\nReceivables – trade and other\n(30)\n554 \n(17)\n(567)\n1.2\nInventories\n(781)\n(770)\n— \n(11)\n1\nAccounts payable\n(96)\n(79)\n(40)\n23 \n1\nAccrued expenses\n9 \n— \n9 \n— \nAccrued wages, salaries and employee benefits\n(671)\n(660)\n(11)\n— \nCustomer advances\n476 \n475 \n1 \n— \nOther assets – net\n120 \n(226)\n191 \n155 \n1\nOther liabilities – net\n(37)\n(135)\n232 \n(134)\n1\nNet cash provided by (used for) operating activities\n8,642 \n7,726 \n1,018 \n(102)\nCash flow from investing activities:\n \n \n \n \nCapital expenditures – excluding equipment leased to others\n(1,285)\n(1,264)\n(25)\n4 \n1\nExpenditures for equipment leased to others\n(893)\n(20)\n(889)\n16 \n1\nProceeds from disposals of leased assets and property, plant and equipment\n541 \n25 \n525 \n(9)\n1\nAdditions to finance receivables\n(11,457)\n— \n(12,271)\n814 \n2\nCollections of finance receivables\n10,234 \n— \n10,889 \n(655)\n2\nNet intercompany purchased receivables\n— \n— \n68 \n(68)\n2\nProceeds from sale of finance receivables\n69 \n— \n69 \n— \nNet intercompany borrowings\n— \n— \n15 \n(15)\n3\nInvestments and acquisitions (net of cash acquired)\n(32)\n(32)\n— \n— \nProceeds from sale of businesses and investments (net of cash sold)\n(67)\n86 \n(153)\n— \nProceeds from maturities and sale of securities\n2,841 \n2,565 \n276 \n— \nInvestments in securities\n(892)\n(469)\n(423)\n— \nOther – net\n137 \n118 \n19 \n— \nNet cash provided by (used for) investing activities\n(804)\n1,009 \n(1,900)\n87 \nCash flow from financing activities:\n \n \n \n \nDividends paid\n(1,966)\n(1,966)\n— \n— \nCommon stock issued, including treasury shares reissued\n15 \n15 \n— \n— \nPayments to purchase common stock\n(7,057)\n(7,057)\n— \n— \nNet intercompany borrowings\n— \n(15)\n— \n15 \n3\nProceeds from debt issued (original maturities greater than three months)\n7,579 \n— \n7,579 \n— \nPayments on debt (original maturities greater than three months)\n(6,862)\n(1,021)\n(5,841)\n— \nShort-term borrowings – net (original maturities three months or less)\n(848)\n— \n(848)\n— \nNet cash provided by (used for) financing activities\n(9,139)\n(10,044)\n890 \n15 \nEffect of exchange rate changes on cash\n(39)\n(37)\n(2)\n— \nIncrease (decrease) in cash, cash equivalents and restricted cash\n(1,340)\n(1,346)\n6 \n— \nCash, cash equivalents and restricted cash at beginning of period\n6,985 \n6,111 \n874 \n— \nCash, cash equivalents and restricted cash at end of period\n$\n5,645 \n$\n4,765 \n$\n880 \n$\n— \n1    \nElimination of non-cash adjustments and changes in assets and liabilities related to consolidated reporting.\n2    \nReclassification of Financial Products’ cash flow activity from investing to operating for receivables that arose from the sale of inventory.\n3    \nElimination of net proceeds and payments to/from ME&T and Financial Products.\n78\nTable of Contents\nForward-looking Statements\nCertain statements in this Form 10-Q relate to future events and expectations and are forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. Words such as “believe,” “estimate,” “will be,” “will,” “would,” “expect,” “anticipate,” “plan,” “forecast,” “target,” “guide,” “project,” “intend,” “could,” “should” or other similar words or expressions often identify forward-looking statements. All statements other than statements of historical fact are forward-looking statements, including, without limitation, statements regarding our outlook, projections, forecasts or trend descriptions. These statements do not guarantee future performance and speak only as of the date they are made, and we do not undertake to update our forward-looking statements.\nCaterpillar’s actual results may differ materially from those described or implied in our forward-looking statements based on a number of factors, including, but not limited to: (i) global and regional economic conditions and economic conditions in the industries we serve; (ii) commodity price changes, material price increases, fluctuations in demand for our products or significant shortages of material; (iii) government monetary or fiscal policies; (iv) political and economic risks, commercial instability and events beyond our control in the countries in which we operate; (v) international trade policies and their impact on demand for our products and our competitive position, including the imposition of new tariffs or changes in existing tariff rates; (vi) our ability to develop, produce and market quality products that meet our customers’ needs; (vii) the impact of the highly competitive environment in which we operate on our sales and pricing; (viii) information technology security threats and computer crime; (ix) inventory management decisions and sourcing practices of our dealers and our OEM customers; (x) a failure to realize, or a delay in realizing, all of the anticipated benefits of our acquisitions, joint ventures or divestitures; (xi) union disputes or other employee relations issues; (xii) adverse effects of unexpected events; (xiii) disruptions or volatility in global financial markets limiting our sources of liquidity or the liquidity of our customers, dealers and suppliers; (xiv) failure to maintain our credit ratings and potential resulting increases to our cost of borrowing and adverse effects on our cost of funds, liquidity, competitive position and access to capital markets; (xv) our Financial Products segment’s risks associated with the financial services industry; (xvi) changes in interest rates or market liquidity conditions; (xvii) an increase in delinquencies, repossessions or net losses of Cat Financial’s customers; (xviii) currency fluctuations; (xix) our or Cat Financial’s compliance with financial and other restrictive covenants in debt agreements; (xx) increased pension plan funding obligations; (xxi) alleged or actual violations of trade or anti-corruption laws and regulations; (xxii) additional tax expense or exposure, including the impact of U.S. tax reform; (xxiii) significant legal proceedings, claims, lawsuits or government investigations; (xxiv) new regulations or changes in financial services regulations; (xxv) compliance with environmental laws and regulations; (xxvi) catastrophic events, including global pandemics such as the COVID-19 pandemic; and (xxvii) other factors described in more detail under the section entitled \"Part I - Item 1A. Risk Factors\" of Caterpillar's Annual Report on Form 10-K for the fiscal year ended December 31, 2024, as such factors may be updated from time to time in Caterpillar's periodic filings with the Securities and Exchange Commission."
}