{
  "item1": "competitive environment reciprocating engines marine, oil gas, industrial electric power generation systems along turbines oil gas electric power generation consists few larger global competitors compete variety markets Caterpillar serves, substantial number smaller companies compete limited-size product range, geographic region and/or application. Principal global competitors include Cummins Inc., Deutz AG, Rolls-Royce Power Systems AG Siemens Energy AG. Other competitors, such Volvo Penta AB, FPT Industrial SpA (Iveco Group), INNIO Group, GE Vernova Inc., Kawasaki Heavy Industries Ltd., MAN Energy Solutions SE (VW), Weichai Power Co., Ltd., other emerging market competitors compete certain markets which Caterpillar competes. additional set competitors, including Aggreko plc, Generac Holdings Inc., Rehlko Energy, Baker Hughes Co., others, primarily packagers who source engines and/or other components domestic international suppliers market products regionally internationally through variety distribution channels.",
  "item7": "Energy & Transportation’s total sales $28.854 billion 2024, increase $853 million, 3 percent, compared $28.001 billion 2023. increase primarily due favorable price realization. Oil Gas – Sales about flat. Decreased sales reciprocating engines used well servicing applications offset increased sales reciprocating engines used gas compression applications increased sales turbines turbine-related services.",
  "item2": "Item 2. Management’s Discussion Analysis Financial Condition Results Operations following Management’s Discussion Analysis Financial Condition Results Operations (MD&A) intended provide information will assist reader understanding company’s Consolidated Financial Statements, changes certain key items those financial statements between select periods primary factors accounted those changes. addition, discuss how certain accounting principles, policies critical estimates affect Consolidated Financial Statements. discussion also contains certain forward-looking statements related future events expectations well discussion many factors believe may impact business ongoing basis."
}