{
  "source_file": "cat-20241231.htm",
  "form_type": "10-K",
  "item1": "Item 1.\nBusiness.\nGeneral\n \nOriginally organized as Caterpillar Tractor Co. in 1925 in the State of California, our company was reorganized as Caterpillar Inc. in 1986 in the State of Delaware.  As used herein, the term “Caterpillar,” “we,” “us,” “our” or “the company” refers to Caterpillar Inc. and its subsidiaries unless designated or identified otherwise.\n \nOverview\n \nWith 2024 sales and revenues of $64.809 billion, Caterpillar is the world’s leading manufacturer of construction and mining equipment, off-highway diesel and natural gas engines, industrial gas turbines and diesel-electric locomotives.  The company principally operates through its three primary segments - Construction Industries, Resource Industries and Energy & Transportation - and also provides financing and related services through its Financial Products segment.  Caterpillar is also a leading U.S. exporter.  Through a global network of independent dealers and direct sales of certain products, Caterpillar builds long-term relationships with customers around the world.\n \nEnterprise Strategy\n \nOur company strategy, rolled out in 2017, reflects our legacy and our continuing commitment to meet the needs of our customers and the communities in which we live and work. United by our Values, Caterpillar employees around the world share a focused view of our business through the Operating & Execution Model, through which we are making strategic choices today to create long-term profitable growth. Since 2017, we focused on three strategic areas: Expanded Offerings, Operational Excellence and Services. In 2022, we updated our strategy to also include Sustainability as a strategic area. For nearly 100 years, our longstanding commitment to sustainability has inspired us to set and achieve meaningful environmental, social and governance goals. It’s also allowed us to develop innovative products, technologies and services to support our customers on their sustainability journey. The addition of sustainability as a strategic area, together with operational excellence, expanded offerings and services, highlights our work to help customers build a better, more sustainable world.\nCurrently, we have five operating segments, of which four are reportable segments and are described below. \n \nCategories of Business Organization\n \n1.\nMachinery, Energy & Transportation\n —  Caterpillar Inc. and its subsidiaries, excluding Financial Products.  Machinery, Energy & Transportation information relates to the design, manufacturing and marketing of our products. \n2.\nFinancial Products \n— Our finance and insurance subsidiaries, primarily Caterpillar Financial Services Corporation (Cat Financial) and Caterpillar Insurance Holdings Inc. (Insurance Services). Financial Products information relates to the financing to customers and dealers for the purchase and lease of Caterpillar and other equipment.\n \nOther information about our operations in 2024, including certain risks associated with our operations, is included in Part II, Item 7 “Management’s Discussion and Analysis of Financial Condition and Results of Operations.”\n \nConstruction Industries\n \nOur Construction Industries segment is primarily responsible for supporting customers using machinery in infrastructure and building construction applications.  The majority of machine sales in this segment are made in the heavy and general construction, rental, quarry and aggregates and mining industries.   \nThe nature of customer demand for construction machinery varies around the world.  Customers in developing economies often prioritize purchase price in making their investment decisions, while customers in developed economies generally weigh productivity and other performance criteria that contribute to lower owning and operating costs over the lifetime of the machine.  To meet customer expectations in developing economies, Caterpillar developed differentiated product offerings that target customers in those regions, including our SEM brand machines.  We believe that these customer-driven product innovations enable us to compete more effectively in developing economies.  The majority of Construction Industries' research and development spending in 2024 focused on the next generation of construction machines.\n1\nTable of Contents\n \nThe competitive environment for construction machinery is characterized by some global competitors and many regional and specialized local competitors.\n \nExamples of global competitors include CASE (part of CNH Industrial N.V.), Deere Construction & Forestry (part of Deere & Company), Doosan Bobcat (Part of Doosan Group), Hitachi Construction Machinery Co., Ltd., Hyundai Construction Equipment Co., Ltd., Hyundai Doosan Infracore Co., Ltd. (both part of Hyundai Heavy Industries Group), J.C. Bamford Excavators Ltd., Kobelco Construction Machinery (part of Kobe Steel, Ltd), Komatsu Ltd., Kubota Farm & Industrial Machinery (part of Kubota Corporation), Sany Heavy Industry Co., Ltd., and Volvo Construction Equipment (part of the Volvo Group).\n \nAs an example of regional and local competitors, our competitors in China also include Guangxi LiuGong Machinery Co., Ltd., Longking Holdings Ltd., Sany Heavy Industry Co, XCMG Construction Machinery Co., Ltd., Shandong Lingong Construction Machinery Co., Ltd. (SDLG, JV with Volvo Construction Equipment) and Shantui Construction Machinery Co., Ltd., (part of Shandong Heavy Industry Group Co.).\n \nEach of these companies has varying product lines that compete with Caterpillar products, and each has varying degrees of regional focus.\n The Construction Industries portfolio includes the following product families as well as related parts and work tools:\n· asphalt pavers\n· motor graders\n· track-type tractors (small, medium)\n· backhoe loaders\n· pipelayers\n· track excavators (mini, small\n· cold planers\n· road reclaimers\n   medium, large)\n· compactors\n· skid steer loaders\n· wheel excavators\n· compact track loaders\n· telehandlers\n· wheel loaders (compact, small,\n· forestry machines\n· track-type loaders\n    medium)\n· material handlers\nResource Industries\n \nThe Resource Industries segment is primarily responsible for supporting customers using machinery in mining, heavy construction and quarry and aggregates.  Caterpillar offers a broad product range and services to deliver comprehensive solutions for our customers. We develop and manufacture high productivity equipment for both surface and underground mining operations around the world, as well as provide hydraulic systems, electronics and software for Caterpillar machines and engines.\n \nOur equipment is used to extract and haul copper, iron ore, coal, oil sands, aggregates, gold and other minerals and ores, as well as a variety of heavy construction applications.\n \nIn addition to equipment, Resource Industries also develops and sells technology products and services to provide customers fleet management systems, equipment management analytics and autonomous machine capabilities.  \nCustomers in most markets place an emphasis on equipment that is highly productive, reliable and provides the lowest total cost of ownership over the life of the equipment.\n \nIn some developing markets, customers often prioritize purchase price in making their investment decisions.  We believe our ability to control the integration and design of key machine components and innovative technologies represents a competitive advantage. Our research and development efforts remain focused on providing customers the lowest total cost of ownership enabled through the highest quality, most productive products and services in the industry.\nThe competitive environment for Resource Industries consists of a few larger global competitors that compete in several of the markets that we serve and a substantial number of smaller companies that compete in a more limited range of products, applications, and regional markets.  Our global surface competitors include Deere Construction & Forestry (part of Deere & Company), Epiroc AB, Hitachi Construction Machinery Co., Ltd., Komatsu Ltd., Liebherr-International AG, Sandvik AB, and Volvo Construction Equipment.  Our global underground competitors include Epiroc AB, Komatsu Ltd., and Sandvik AB.\nThe Resource Industries product portfolio includes the following machines and related parts and services:\n·\n                 \n electric rope shovels\n·\n                 \n large wheel loaders\n·\n                 \n landfill compactors\n·\n                 \n draglines\n·\n                 \n off-highway trucks\n·\n                 \n soil compactors\n·\n                 \n hydraulic shovels\n·\n                 \n wide-body trucks\n·\n               \n  machinery components\n·\n                 \n rotary drills\n·\n                 \n articulated trucks\n·\n                 \n autonomous ready vehicles and solutions\n·\n                 \n hard rock vehicles\n·\n                 \n wheel tractor scrapers\n·\n                 \n select work tools\n·\n                 \n large track-type tractors\n·\n                 \n wheel dozers\n·\n                 \n safety services and mining performance\n·\n                 \n large mining trucks\n·\n                 \n fleet management\n                    \n solutions\n \n2\nTable of Contents\nEnergy & Transportation\n \nOur Energy & Transportation segment supports customers in oil and gas, power generation, marine, rail and industrial applications, including Caterpillar machines. The product and services portfolio includes reciprocating engines, generator sets, integrated systems and solutions, turbines and turbine-related services, electrified powertrain and zero-emission power sources and service solutions development, the remanufacturing of Caterpillar engines and components, remanufacturing services for other companies, diesel-electric locomotives and other rail-related products and services as well as product support of on-highway engines.\nRegulatory emissions standards require us to continue to make investments as new products and new regulations are introduced.  Ongoing compliance with these regulations remains a focus.  Emissions compliance in developing markets is complex due to rapidly evolving and unique requirements where enforcement processes can often vary.  We employ robust product development, manufacturing processes and testing to help us comply with these regulations.  \n \nThe competitive environment for reciprocating engines in marine, oil and gas, industrial and electric power generation systems along with turbines in oil and gas and electric power generation consists of a few larger global competitors that compete in a variety of markets that Caterpillar serves, and a substantial number of smaller companies that compete in a limited-size product range, geographic region and/or application.  Principal global competitors include Cummins Inc., Deutz AG, Rolls-Royce Power Systems AG and Siemens Energy AG.  Other competitors, such as Volvo Penta AB, FPT Industrial SpA (Iveco Group), INNIO Group, GE Vernova Inc., Kawasaki Heavy Industries Ltd., MAN Energy Solutions SE (VW), Weichai Power Co., Ltd., and other emerging market competitors compete in certain markets in which Caterpillar competes. An additional set of competitors, including Aggreko plc, Generac Holdings Inc., Rehlko Energy, Baker Hughes Co., and others, are primarily packagers who source engines and/or other components from domestic and international suppliers and market products regionally and internationally through a variety of distribution channels.  In rail-related businesses, our global competitors include Wabtec Corp, Greenbrier Companies, Inc., Voestalpine AG, Vossloh AG, Alstom SA, and Siemens Mobility A/S.  We also compete with other companies on a more limited range of products, services and/or geographic regions.\nThe Energy & Transportation portfolio includes the following products and related parts:\n•\nReciprocating engine powered generator sets\n•\nReciprocating engines, drivetrain and integrated systems and solutions supplied to the industrial industry as well as Caterpillar machinery\n•\nIntegrated systems and solutions used in the electric power generation industry\n•\nTurbines, centrifugal gas compressors and related services\n•\nReciprocating engines, drivetrain and integrated systems and solutions for the marine and oil and gas industries\n•\nDiesel-electric locomotives and components and other rail-related products and services\nFinancial Products Segment\n \nThe business of our Financial Products Segment is primarily conducted by Cat Financial, Insurance Services and their respective subsidiaries and affiliates.  Cat Financial is a wholly owned finance subsidiary of Caterpillar Inc., and it provides retail and wholesale financing alternatives to customers and dealers around the world for Caterpillar products and services, as well as financing for power generation facilities that, in most cases, incorporate Caterpillar products.  Retail financing is primarily comprised of installment sale contracts and other equipment-related loans, working capital loans, finance leases, operating leases, and revolving charge accounts. Wholesale financing to Caterpillar dealers consists primarily of inventory and rental fleet financing.  In addition, Cat Financial purchases short-term wholesale trade receivables from Caterpillar. The various financing plans offered by Cat Financial are designed to support sales of Caterpillar products and services and generate financing income for Cat Financial.  A significant portion of our activity is conducted in North America, and we have additional offices and subsidiaries in Latin America, Asia/Pacific, Europe and Africa.  \nFor over 40 years, Cat Financial has been providing financing for Caterpillar products, contributing to our knowledge of asset values, industry trends, financing structures and customer needs.\n \nIn certain instances, Cat Financial’s operations are subject to supervision and regulation by state, federal and various foreign governmental authorities, and may be subject to various laws and judicial and administrative decisions imposing various requirements and restrictions which, among other things, (i) regulate credit granting activities and the administration of loans, (ii) establish maximum interest rates, finance charges and other charges, (iii) require disclosures to customers, (iv) govern secured transactions, (v) set collection, foreclosure, repossession and other trade practices and (vi) regulate the use and reporting of information related to a borrower’s credit experience.  Cat Financial’s ability to comply with these and other governmental and legal requirements and restrictions affects its operations.\n3\nTable of Contents\nCat Financial’s retail loans include:\n     \n•\nLoans that allow customers and dealers to use their Caterpillar equipment or other assets as collateral to obtain financing.\n•\nInstallment sale contracts, which are equipment loans that enable customers to purchase equipment with structured payments over time.\nCat Financial's retail leases include:\n \n•\nFinance (non-tax) leases, where the lessee for tax purposes is considered to be the owner of the equipment during the term of the lease, that either require or allow the customer to purchase the equipment for a fixed price at the end of the term.\n•\nTax leases that are classified as either operating or finance leases for financial accounting purposes, depending on the characteristics of the lease.  For tax purposes, we are considered the owner of the equipment.\nCat Financial also purchases short-term receivables from Caterpillar.\n \nCat Financial’s wholesale loans and leases include inventory/rental programs, which provide assistance to dealers by financing their new Caterpillar inventory and rental fleets.\nCat Financial operates in a highly competitive environment, with financing for users of Caterpillar equipment and services available through a variety of sources, principally commercial banks and finance and leasing companies.  Our competitors include Wells Fargo Equipment Finance Inc., Banc of America Leasing & Capital LLC, BNP Paribas Leasing Solutions Limited, Australia and New Zealand Banking Group Limited, Société Générale S.A. and various other banks and finance companies.  In addition, many of the manufacturers that compete with Caterpillar also own financial subsidiaries, such as John Deere Capital Corporation, Komatsu Financial L.P., Volvo Financial Services and Kubota Credit Corporation, which utilize many below-market interest rate programs (funded by the manufacturer) to support machine sales.  Cat Financial works with the broader Caterpillar organization to provide a broad array of financial merchandising programs to compete around the world.\nThe financial results of Cat Financial are largely dependent upon the ability of Caterpillar dealers to sell equipment and customers’ willingness to enter into financing or leasing agreements.  Cat Financial is also affected by, among other things, the availability of funds from its financing sources, its cost of funds relative to its competitors and general economic conditions such as inflation and market interest rates.\n \nCat Financial has a match-funding policy that addresses interest rate risk by aligning the interest rate profile (fixed or floating rate and duration) of its debt portfolio with the interest rate profile of its receivables portfolio within predetermined ranges on an ongoing basis.  In connection with that policy, Cat Financial uses interest rate derivative instruments to modify the debt structure to match assets within the receivables portfolio. This matched funding reduces the volatility of margins between interest-bearing assets and interest-bearing liabilities, regardless of which direction interest rates move.  For more information regarding match funding, please see Note 4 — “Derivative financial instruments and risk management” of Part II, Item 8 \"Financial Statements and Supplementary Data.\"  See also the risk factors associated with our financial products business included in Item 1A. of this Form 10-K. \nIn managing foreign currency risk for Cat Financial’s operations, the objective is to minimize earnings volatility resulting from conversion and the remeasurement of net foreign currency balance sheet positions, and future transactions denominated in foreign currencies.  This policy allows the use of foreign currency forward, option and cross currency contracts to offset the risk of currency mismatch between the assets and liabilities, and exchange rate risk associated with future transactions denominated in foreign currencies.\n \nCat Financial provides financing only when certain criteria are met. Credit decisions are based on a variety of credit quality factors including prior payment experience, customer financial information, credit ratings, loan-to-value ratios and other internal metrics.  Cat Financial typically maintains a security interest in retail-financed equipment and generally requires physical damage insurance coverage on financed equipment.  Cat Financial finances a significant portion of Caterpillar dealers’ sales and inventory of Caterpillar equipment throughout the world.  Cat Financial’s competitive position is improved by marketing programs offered in conjunction with Caterpillar and/or Caterpillar dealers.  Under these programs, Caterpillar, or the dealer, funds an amount at the outset of the transaction, which Cat Financial then recognizes as revenue over the term of the financing.  We believe that these marketing programs provide Cat Financial a significant competitive advantage in financing Caterpillar products.\n4\nTable of Contents\n \nCaterpillar Insurance Company, a wholly owned subsidiary of Caterpillar Insurance Holdings Inc., is a U.S. insurance company domiciled in Missouri and primarily regulated by the Missouri Department of Insurance.  Caterpillar Insurance Company is licensed to conduct property and casualty insurance business in 50 states, the District of Columbia and Guam and, as such, is also regulated in those jurisdictions.  The State of Missouri acts as the lead regulatory authority and monitors Caterpillar Insurance Company’s financial status to ensure that it is in compliance with minimum solvency requirements, as well as other financial ratios prescribed by the National Association of Insurance Commissioners.  Caterpillar Insurance Company is also licensed to conduct insurance business through a branch in Zurich, Switzerland and, as such, is regulated by the Swiss Financial Market Supervisory Authority.\n \nCaterpillar Life Insurance Company, a wholly owned subsidiary of Caterpillar, is a U.S. insurance company domiciled in Missouri and primarily regulated by the Missouri Department of Insurance.  Caterpillar Life Insurance Company is licensed to conduct life and accident and health insurance business in 26 states and the District of Columbia and, as such, is also regulated in those jurisdictions. The State of Missouri acts as the lead regulatory authority, and it monitors the financial status to ensure that it is in compliance with minimum solvency requirements, as well as other financial ratios prescribed by the National Association of Insurance Commissioners.  Caterpillar Life Insurance Company provides reinsurance coverage to Caterpillar Insurance Company. Specifically, Caterpillar Life Insurance Company has entered into a reinsurance agreement with Caterpillar Insurance Company, assuming 100% of the risk of an Accident and Health Stop Loss Insurance Policy to cover a Caterpillar Voluntary Employees' Benefits Association (VEBA) Trust for medical losses sustained by a select group of Caterpillar retirees and dependents.\n \nCaterpillar Insurance Co. Ltd., a wholly owned subsidiary of Caterpillar Insurance Holdings Inc., is a captive insurance company domiciled in Bermuda and regulated by the Bermuda Monetary Authority.  Caterpillar Insurance Co. Ltd. is registered as a Class 2 (General Business) and Class B (Long-Term) insurer with the Bermuda Monetary Authority.  Under its Class 2 insurance license, Caterpillar Insurance Co. Ltd. insures its parent and affiliates for general liability, property, auto liability and cargo.  It also provides reinsurance to Caterpillar Insurance Company under a quota share reinsurance agreement for its contractual liability and contractors’ equipment programs in the United States. In addition, Caterpillar Insurance Co. Ltd. reinsures 100% of the international employee benefit plans of Caterpillar Inc. through retrocession agreements with other insurers.  The employee benefits coverages include medical and accident coverages, which are reported under its Class 2 insurance license, and life and disability coverages, which are reported under its Class B insurance license.  The Bermuda Monetary Authority is responsible for monitoring compliance with solvency requirements and requires an Annual Financial Filing for this purpose.\n \nCaterpillar Insurance Services Corporation, a wholly owned subsidiary of Caterpillar Insurance Holdings Inc., is a Tennessee insurance agency licensed in all 50 states, the District of Columbia and Guam. It provides brokerage and insurance services for all property and casualty and life and health lines of business.\n \nCaterpillar’s insurance group provides protection and service for claims under the following programs:\n \n•\nContractual Liability Insurance to insure certain service contract obligations of Caterpillar and its affiliates, Caterpillar dealers and original equipment manufacturers (OEMs).\n•\nCargo reinsurance for the worldwide cargo risks of Caterpillar products.\n•\nContractors’ Equipment Physical Damage Insurance for equipment manufactured by Caterpillar or OEMs, which is leased, rented or sold by third party dealers to customers.\n•\nGeneral liability, employer’s liability, auto liability and property insurance for Caterpillar.\n•\nLife, disability, medical and accident reinsurance for Caterpillar's international employee benefits program (non-U.S.).\n•\nReinsurance to cover VEBA Trust for medical claims of certain Caterpillar retirees and dependents.\n•\nBrokerage and insurance services for property and casualty and life and health business.\n5\nTable of Contents\nCompetitive Environment\n \nCaterpillar products and services are sold worldwide into a variety of highly competitive markets.  In all markets, we compete on the basis of product performance, customer service, quality and price.  From time to time, the intensity of competition results in price discounting in a particular industry or region.  Such price discounting puts pressure on margins and can negatively impact operating profit. Outside the United States, certain competitors enjoy competitive advantages inherent to operating in their home countries or regions.\n \nRaw Materials and Component Products\n \nWe source our raw materials and manufactured components from suppliers both domestically and internationally. These purchases include unformed materials and rough and finished parts.  Unformed materials include a variety of steel products, which are then cut or formed to shape and machined in our facilities. Rough parts include various sized steel and iron castings and forgings, which are machined to final specification levels inside our facilities. Finished parts are ready to assemble components, which are made either to Caterpillar specifications or to supplier developed specifications.  We machine and assemble some of the components used in our machines, engines and power generation units and to support our after-market dealer parts sales. We also purchase various goods and services used in production, logistics, offices and product development processes.  We maintain global strategic sourcing models to meet our global facilities’ production needs while building long-term supplier relationships and leveraging enterprise spend.  We expect our suppliers to maintain, at all times, industry-leading levels of quality and the ability to timely deliver raw materials and component products for our machine and engine products. However, in some cases, increases in demand or supply chain disruptions have led to parts and components constraints across some products. We use a variety of agreements with suppliers to protect our intellectual property and processes to monitor and mitigate risks of the supply base causing a business disruption.  The risks monitored include supplier financial viability, the ability to increase or decrease production levels, business continuity, quality and delivery.\n \nPatents and Trademarks\n \nWe own a number of patents and trademarks, which have been obtained over a period of years and relate to the products we manufacture and the services we provide. These patents and trademarks are generally considered beneficial to our business. We do not regard our business as being dependent upon any single patent or group of patents.\nOrder Backlog\n \nThe dollar amount of backlog believed to be firm was approximately $30.0 billion at December 31, 2024 and $27.5 billion at December 31, 2023. Compared with year-end 2023, the order backlog increased in Energy & Transportation, while Construction Industries and Resource Industries decreased. Of the total backlog at December 31, 2024, approximately $8.0 billion was not expected to be filled in 2025. \nDealers and Distributors\n \nWe distribute our machines principally through a worldwide organization of dealers (dealer network), 41 located in the United States and 111 located outside the United States, serving 187 countries.  We sell reciprocating engines principally through the dealer network and to other manufacturers for use in products. We also sell some of the reciprocating engines manufactured by our subsidiary Perkins Engines Company Limited through its worldwide network of 88 distributors covering 185 countries.  We sell the FG Wilson branded electric power generation systems through its worldwide network of 108 distributors covering 158 countries.\n \nOur dealers do not deal exclusively with our products; however, in most cases sales and servicing of our products are the dealers’ principal business.  We sell some products, primarily turbines and locomotives, directly to end customers through sales forces employed by the company.  At times, these employees are assisted by independent sales representatives.  \nWhile the large majority of our worldwide dealers are independently owned and operated, we own and operate a dealership in Japan that covers approximately 80% of the Japanese market:  Nippon Caterpillar Division.  We are currently operating this Japanese dealer directly and we report its results in the All Other Segment.  There are also three independent dealers in the Southern Region of Japan.\n \nFor Caterpillar-branded products, the company’s relationship with each of its independent dealers is memorialized in standard sales and service agreements.  Pursuant to these agreements, the company grants the dealer the right to purchase and sell its products and to service the products in a specified geographic service territory.  The company establishes prices to dealers after \n6\nTable of Contents\nreceiving input from dealers on transactional pricing in the marketplace.  The company also agrees to defend its intellectual property and to provide warranty and technical support to the dealer.  The agreement further grants the dealer a non-exclusive license to use the company’s trademarks, service marks and brand names.  In some instances, a separate trademark agreement exists between the company and a dealer.\n \nIn exchange for these rights, the agreement obligates the dealer to develop and promote the sale of the company’s products to current and prospective customers in the dealer’s service territory.  Each dealer agrees to employ adequate sales and support personnel to market, sell and promote the company’s products, demonstrate and exhibit the products, perform the company’s product improvement programs, inform the company concerning any features that might affect the safe operation of any of the company’s products and maintain detailed books and records of the dealer’s financial condition, sales and inventories and make these books and records available at the company’s reasonable request.\n \nThese sales and service agreements are terminable at will by either party primarily upon 90 days written notice.\n \nHuman Capital\nCore Values\nCaterpillar’s global workforce is united by Our Values In Action, Caterpillar’s Code of Conduct. Integrity, Excellence, Teamwork, Commitment and Sustainability provide the foundation for our values-based culture. Our human capital management principles are embedded in our values. Our values unite us, and reflect our diverse cultures, languages, geographies, and businesses, as one Caterpillar team.\nHealth and Safety\nThe health and safety of our employees is an important focus at Caterpillar.  Our safety driven strategy is focused on preventing serious injuries and learning from those closest to the work. In 2024, the Company achieved a recordable injury frequency rate of 0.43, compared to the 2023 recordable injury frequency rate of 0.40. We strive to continually reduce our recordable injuries utilizing programs that amplify our safety culture globally.\nTalent and Leadership Development\nIn addition to our focus on values and safety, we strive to continually attract, develop, engage, and retain a high-performing global team that executes our enterprise strategy of long-term profitable growth. We are committed to fostering an inclusive environment and a workforce that is representative of the diverse customers and communities we serve around the globe. Our Values In Action enable every individual to achieve their fullest potential and every team to help drive business success. These principles guide us in our daily operating rhythm. In addition, we make on-going investments in our team to develop employees and help individuals reach their full potential.\nOur leadership development programs focus on encouraging a variety of experiences to help employees broaden understanding and increase perspective. Our leadership curriculums include building resilient and high performing teams as core development principles. Additionally, skill-based programs to upskill our manufacturing employees are developed locally and tailored to the specific needs of the business.  All employees have access to mentoring programs that connect participants with senior leaders and peers who can support their career goals and development.\nOur global internships, engineering co-ops, and career programs for engineering, marketing, and manufacturing provide development opportunities for early career employees. We also have a continual focus on strengthening technical, professional and leadership capabilities at every level using contemporary learning strategies to foster high performance. Strategic talent reviews and succession planning occur at a minimum, annually, across our businesses.  Mentoring programs connect participants with senior leaders and peers who can support their career goals and development.\nOur 14 Employee Resource Groups (ERGs), which are sponsored and supported by leadership, help ensure different voices and perspectives contribute to our strategy for long-term profitable growth. They also engage our employees, helping contribute to development and retention. Our ERGs provide many contributions to help further our business strategy including partnerships with recruiters and early career and professional organizations that can assist in strengthening the talent pipeline and programs that educate and inform on the richness of the global cultures that we share. \n7\nTable of Contents\nCompensation, Benefits and Employee Insights\nProviding competitive benefits and compensation underpins our commitment to our engaged and productive employees. Our pay-for-performance philosophy aligns employee’s individual contributions, behaviors and business results with individual rewards. Our comprehensive Total Health programs focus on purpose, as well as physical and mental health, emotional and social support, and financial wellness. The annual Employee Insights Survey provides all employees the opportunity to confidentially share their perspectives and engages leaders to listen, learn and respond to employee feedback to help foster a positive work environment.\nEmployment\nManagement aligns employment levels with the needs of the business. We believe we have the appropriate human capital resources to successfully operate and deliver our enterprise strategy. As of December 31, 2024, we employed about 112,900 full-time persons of whom approximately 61,400 were located outside the United States.  In the United States, we employed approximately 51,500 full-time persons, most of whom are at-will employees and, therefore, not subject to any type of employment contract or agreement.  At select business units, we have hired certain highly specialized employees under employment contracts that specify a term of employment, pay and other benefits.\n \nFull-Time Employees at Year-End\n \n2024\n2023\nInside U.S.\n51,500\n50,800\nOutside U.S.\n61,400\n62,400\nTotal\n112,900\n113,200\nBy Region:\n \n \nNorth America\n52,000\n51,200\nEAME\n15,900\n16,600\nLatin America\n19,700\n20,300\nAsia/Pacific\n25,300\n25,100\nTotal\n112,900\n113,200\nAs of December 31, 2024, there were 7,386 hourly production employees in the United States who were covered by collective bargaining agreements with various labor unions, including The United Automobile, Aerospace and Agricultural Implement Workers of America (UAW), The International Association of Machinists and The United Steelworkers. Outside the United States, the company enters into employment contracts and agreements in those countries in which such relationships are mandatory or customary. The provisions of these agreements generally correspond in each case with the required or customary terms in the subject jurisdiction.\n \nEnvironmental Matters\n \nThe company is regulated by federal, state and international environmental laws governing our use, transport and disposal of substances and control of emissions. In addition to governing our manufacturing and other operations, these laws often impact the development of our products, including, but not limited to, required compliance with air emissions standards applicable to internal combustion engines. We have made, and will continue to make, significant research and development and capital expenditures to comply with these emissions standards.\n \nWe are engaged in remedial activities at a number of locations, often with other companies, pursuant to federal and state laws.  When it is probable we will pay remedial costs at a site, and those costs can be reasonably estimated, the investigation, remediation, and operating and maintenance costs of the remedial action are accrued against our earnings.  Costs are accrued based on consideration of currently available data and information with respect to each individual site, including available technologies, current applicable laws and regulations, and prior remediation experience.  Where no amount within a range of estimates is more likely, we accrue the minimum.  Where multiple potentially responsible parties are involved, we consider our proportionate share of the probable costs.  In formulating the estimate of probable costs, we do not consider amounts expected \n8\nto be recovered from insurance companies or others.  We reassess these accrued amounts on a quarterly basis.  The amount recorded for environmental remediation is not material and is included in the line item \"Accrued expenses\" in Statement 3 — \"Consolidated Financial Position at December 31\" of Part II, Item 8 \"Financial Statements and Supplementary Data.\"  There is no more than a remote chance that a material amount for remedial activities at any individual site, or at all the sites in the aggregate, will be required.  \nAvailable Information\nThe company files electronically with the Securities and Exchange Commission (SEC) required reports on Form 8-K, Form 10-Q, Form 10-K and Form 11-K; proxy materials; ownership reports for insiders as required by Section 16 of the Securities Exchange Act of 1934 (Exchange Act); registration statements on Forms S-3 and S-8, as necessary; and other forms or reports as required.  The SEC maintains a website (www.sec.gov) that contains reports, proxy and information statements, and other information regarding issuers that file electronically with the SEC. The company maintains a website (www.Caterpillar.com) and copies of our annual report on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K and any amendments to these reports filed or furnished with the SEC are available free of charge through our website (www.Caterpillar.com/secfilings) as soon as reasonably practicable after filing with the SEC.  Copies of our board committee charters, our board’s Guidelines on Corporate Governance Issues, Worldwide Code of Conduct and other corporate governance information are available on our website (www.Caterpillar.com/governance) and are also available free of charge.  The information contained on the company’s website is not included in, or incorporated by reference into, this annual report on Form 10-K. \n \nAdditional company information may be obtained as follows:\n \nCurrent information -\n \n•\nview additional financial information on-line at www.Caterpillar.com/en/investors/financial-information.html\n•\nrequest, view or download materials on-line or register for email alerts at www.Caterpillar.com/materialsrequest\n \nHistorical information -\n \n•\nview/download on-line at www.Caterpillar.com/historical",
  "item7": "Item 7.\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations.\n \nThe following Management’s Discussion and Analysis of Financial Condition and Results of Operations (MD&A) is intended to provide information that will assist the reader in understanding the company’s Consolidated Financial Statements, the changes in certain key items in those financial statements between select periods and the primary factors that accounted for those changes. In addition, we discuss how certain accounting principles, policies and critical estimates affect our Consolidated Financial Statements. Our discussion also contains certain forward-looking statements related to future events and expectations. This MD&A should be read in conjunction with our discussion of cautionary statements and significant risks to the company’s business under Item 1A. Risk Factors of the 2024 Form 10-K.\nHighlights for the full-year 2024 include:\n•\nSales and revenues for 2024 were $64.809 billion, a decrease of $2.251 billion, or 3 percent, compared with $67.060 billion for 2023. In the three primary segments, sales were lower in \nConstruction Industries\n and\n Resource Industries\n and higher in \nEnergy & Transportation\n.\n•\nOperating profit as a percent of sales and revenues was 20.2 percent in 2024, compared with 19.3 percent in 2023. \nAdjusted operating profit margin\n was 20.7 percent in 2024, compared with 20.5 percent in 2023.\n•\nProfit per share for 2024 was $22.05, and excluding the items in the table below, \nadjusted profit per share\n was $21.90. Profit per share for 2023 was $20.12, and excluding the items in the table below, adjusted profit per share was $21.21. \n•\nIn order for our results to be more meaningful to our readers, we have separately quantified the impact of several significant items. A detailed reconciliation of GAAP to non-GAAP financial measures is included on pages 47 - 48.\nFull Year 2024\nFull Year 2023\n(Dollars in millions except per share data)\nProfit Before Taxes\nProfit \nPer Share\nProfit Before Taxes\nProfit \nPer Share\nProfit\n$\n13,373\n \n$\n22.05\n \n$\n13,050\n \n$\n20.12\n \nRestructuring (income) costs \n- divestitures of certain non-U.S. entities\n164 \n0.22 \n— \n— \nOther\n \nrestructuring (income) costs\n195 \n0.32 \n194 \n0.30 \nPension/OPEB\n mark-to-market (gains) losses\n(154)\n(0.23)\n(97)\n(0.14)\nTax law change related to \ncurrency\n translation\n— \n(0.46)\n— \n— \nRestructuring costs - Longwall divestiture\n— \n— \n586 \n1.14 \nDeferred tax valuation allowance adjustments\n— \n— \n— \n(0.21)\nAdjusted profit\n$\n13,578 \n$\n21.90 \n$\n13,733 \n$\n21.21 \n•\nEnterprise operating cash flow was $12.0 billion in 2024. Caterpillar ended 2024 with $6.9 billion of enterprise cash.\nOVERVIEW\nTotal sales and revenues for 2024 were $64.809 billion, a decrease of $2.251 billion, or 3 percent, compared with $67.060 billion for 2023. The decrease reflected lower \nsales volume\n, partially offset by favorable \nprice realization\n. Lower sales volume was primarily driven by lower sales of equipment to end users.\n \nProfit per share was $22.05 in 2024, compared with profit per share of $20.12 in 2023. Profit was $10.792 billion in 2024, compared with $10.335 billion in 2023. The profit impact of lower sales volume was more than offset by favorable price realization and the absence of the impact of the divestiture of the company's Longwall business in 2023. \nTrends and Economic Conditions\nOutlook for Key End Markets \nOur results continue to reflect the benefit of the diversity of our end markets.\nIn Construction Industries, we expect moderately lower sales of equipment to end users in North America in 2025 compared to 2024. Construction spend in North America remains healthy, primarily driven by large, multi-year projects and government-related infrastructure investments supported by funding from the Infrastructure Investment and Jobs Act (IIJA). Although we anticipate the combined non-residential and residential construction spend in 2025 to remain similar to 2024 levels, our current planning assumptions reflect lower demand for new equipment in 2025 as compared to 2024. We also expect lower dealer rental fleet loading in 2025 compared to 2024, although dealer rental revenue is expected to grow. We remain positive about the medium- and long-term outlook in North America. In Asia Pacific, outside of China, we expect soft economic conditions to \n27\nTable of Contents\ncontinue into 2025. We anticipate China to remain at relatively low levels for the excavator industry above 10-tons. In \nEAME\n, we anticipate that weak economic conditions in Europe will continue, and we anticipate a healthy level of construction activity in Africa and in the Middle East in 2025. Construction activity in \nLatin America\n is expected to moderately decline in 2025 as compared to 2024. We also anticipate the ongoing benefit of our \nservices\n initiatives will positively impact Construction Industries in 2025.\nIn Resource Industries, we anticipate lower sales of equipment to end users in 2025 compared to 2024, partially offset by higher services revenues, including robust rebuild activity. Customers continue to display capital discipline, although key commodities remain above investment thresholds. Customer product utilization remains high, the number of parked trucks remains relatively low, the age of the fleet remains elevated, and our autonomous solutions continue to see strong customer acceptance. We continue to believe the energy transition will support increased commodity demand over time, expanding our total addressable market and providing further opportunities for long-term profitable growth.\nIn Energy & Transportation, demand is expected to remain strong in Power Generation, as we expect growth for both reciprocating engines and turbines and turbine-related services in 2025 as compared to 2024. Overall strength in Power Generation, for both prime and backup power applications, continues to be driven by increasing energy demands to support data center growth related to cloud computing and generative artificial intelligence (AI). Through continued focus on improving manufacturing efficiencies, along with initial stages of our investment to increase large engine output capability, we expect growth in reciprocating engines for Power Generation in 2025. We also expect growth in turbines and turbine-related services for Power Generation, driven by increased customer demand. For Oil and Gas, we expect moderate growth in 2025 as compared to 2024. We expect reciprocating engines and services to be slightly down in 2025 due to continuing capital discipline by our customers, industry consolidation and efficiency improvements in our customers’ operations. We expect growth for turbines and turbine-related services in Oil & Gas in 2025 as compared to 2024. For turbines and turbine-related services used in Oil & Gas applications, backlog remains strong, and we see continued healthy order and inquiry activity. Demand for products in Industrial applications in 2025 is expected to remain at a relatively low level, similar to 2024. In Transportation, we anticipate growth in 2025, driven by rail services.\nFull-Year 2025 Company Trends and Expectations \nFor the full-year 2025, we anticipate sales and revenues will be slightly lower compared to 2024, primarily driven by lower sales volume and unfavorable price realization. We expect lower sales in Construction Industries and Resource Industries to be partially offset by higher sales in Energy & Transportation. Currently, we do not anticipate a significant change in machine \ndealer inventories\n in 2025. Services revenues increased in 2024, and we expect services revenues to grow across all three primary segments in 2025. \nFor Construction Industries, we expect lower sales, including unfavorable price realization. In Resource Industries, we anticipate slightly lower sales, driven by unfavorable price realization and slightly lower sales volume. In Energy and Transportation, we expect an increase in sales driven by higher sales volume and favorable price realization.\nIn 2025, we anticipate unfavorable price realization and higher depreciation costs. We expect Other income (expense) to be unfavorable in 2025 as compared to 2024, primarily due to lower interest income as well as the absence of favorable foreign currency impacts. We do not anticipate translation movements in our expectations. In 2025, we expect restructuring costs of approximately $150 million to $200 million and expect capital expenditures of about $2.5 billion. We anticipate the annual effective tax rate, excluding discrete items, to be 23.0 percent in 2025.\nFirst-Quarter 2025 Company Trends and Expectations \nIn the first quarter of 2025, we expect lower sales and revenues as compared to the first quarter of 2024, primarily due to the unfavorable impact from changes in machine dealer inventories and unfavorable machine price realization. We expect machine dealer inventory to increase less during the first quarter of 2025 as compared to the $1.1 billion increase in the first quarter of 2024.\nIn a typical year, we see our lowest sales of the year in the first quarter. In 2025, we anticipate that trend to continue but be more pronounced as sales in the first quarter should account for a lower percentage of full year sales than is typical, mainly due to our expectations for changes in dealer inventories and price realization for machines. In Energy & Transportation, we expect normal seasonality with sales growing throughout the year.\nIn the first quarter of 2025 as compared to the first quarter of 2024, we anticipate lower sales in Construction Industries primarily due to lower sales of equipment to end users, an unfavorable impact from changes in dealer inventories and unfavorable price realization. In Resource Industries, we expect lower sales primarily due to lower sales volume and unfavorable price realization. In Energy & Transportation, we anticipate similar sales in the first quarter of 2025 as compared to the first quarter of 2024, as continued strength in Power Generation is expected to be offset by lower sales in Oil & Gas and in Transportation. We expect favorable price realization for Energy & Transportation in the first quarter of 2025.\n28\nTable of Contents\nIn the first quarter of 2025, we expect the profit impact from lower machine sales volume and unfavorable machine price realization to be partially offset by favorable price realization in Energy & Transportation. In Construction Industries and in Resource Industries, we expect an unfavorable profit impact from lower sales volume and unfavorable price realization in the first quarter of 2025 as compared to the first quarter of 2024. In Energy & Transportation, we expect unfavorable \nmanufacturing costs\n and the impact of an unfavorable mix of products to be partially offset by favorable price realization.\nGlobal Business Conditions\nWe continue to monitor a variety of external factors around the world, such as supply chain disruptions, inflationary cost and labor pressures. Areas of particular focus include transportation, certain components and raw materials. We continue to work to minimize supply chain challenges that may impact our ability to meet customer demand. We continue to assess the environment to determine if additional actions need to be taken.\nRisk Factors \nRisk factors are disclosed within Item 1A. Risk Factors of the 2024 Form 10-K.\nNotes:\n•\nGlossary of terms included on pages 35 - 37; first occurrence of terms shown in bold italics.\n•\nInformation on non-GAAP financial measures is included on pages 47 - 48.\n•\nSome amounts within this report are rounded to the millions or billions and may not add. In addition, the sum of the components reported across periods may not equal the total amount reported year-to-date due to rounding. \n29\nTable of Contents\n2024 COMPARED WITH 2023 \nCONSOLIDATED SALES AND REVENUES\nThe chart above graphically illustrates reasons for the change in consolidated sales and revenues between 2023 (at left) and 2024 (at right). Caterpillar management utilizes these charts internally to visually communicate with the company’s board of directors and employees.\nTotal sales and revenues for 2024 were $64.809 billion, a decrease of $2.251 billion, or 3 percent, compared with $67.060 billion in 2023. The decrease was primarily driven by lower sales volume of $3.543 billion, partially offset by favorable price realization of $1.238 billion. The decrease in sales volume was mainly driven by lower sales of equipment to end users. In addition, changes in dealer inventories had an unfavorable impact to sales volume. Dealer inventory increased less during 2024 than during 2023.\nIn the three primary segments, sales were lower in Construction Industries and Resource Industries and higher in Energy & Transportation.\nNorth America sales decreased 1 percent primarily due to lower sales volume, partially offset by favorable price realization. The decrease in sales volume was mainly due to the impact from changes in dealer inventories. Dealer inventory increased less during 2024 than during 2023.\nSales increased 1 percent in Latin America. Unfavorable currency impacts related to the Brazilian real were more than offset by higher sales volume and favorable price realization. The increase in sales volume was primarily due to the impact from changes in dealer inventories. Dealer inventory increased during 2024, compared to a decrease during 2023.\nEAME sales decreased 10 percent primarily due lower sales volume. The decrease in sales volume was mainly driven by lower sales of equipment to end users. \nAsia/Pacific sales decreased 6 percent primarily due to lower sales volume. The decrease in sales volume was mainly driven by the impact from changes in dealer inventories. Dealer inventory decreased in 2024, compared to an increase in 2023.\nTotal dealer inventory increased about $400 million during 2024, compared to an increase of about $2.1 billion during 2023. Machine dealer inventory decreased about $700 million during 2024, compared to an increase of $700 million during 2023. Dealers are independent, and the reasons for changes in their inventory levels vary, including their expectations of future demand and product delivery times. Dealers’ demand expectations take into account seasonal changes, macroeconomic conditions, machine rental rates and other factors. Delivery times can vary based on availability of product from Caterpillar factories and product distribution centers. We do not expect a significant change in machine dealer inventories in 2025.\n30\nTable of Contents\nSales and Revenues by Segment\n(Millions of dollars)\n2023\nSales\nVolume\nPrice\nRealization\nCurrency\nInter-Segment/Other\n2024\n$\nChange\n%\nChange\nConstruction Industries\n$\n27,418 \n$\n(1,737)\n$\n(70)\n$\n(143)\n$\n(13)\n$\n25,455 \n$\n(1,963)\n(7 \n%)\nResource Industries\n13,583 \n(1,603)\n405 \n(28)\n32 \n12,389 \n(1,194)\n(9 \n%)\nEnergy & Transportation\n28,001 \n(142)\n900 \n(25)\n120 \n28,854 \n853 \n3 \n%\nAll Other Segment\n449 \n(17)\n5 \n(1)\n(11)\n425 \n(24)\n(5 \n%)\nCorporate Items and Eliminations\n(5,582)\n(44)\n(2)\n(4)\n(128)\n(5,760)\n(178)\n \nMachinery, Energy & Transportation\n63,869 \n(3,543)\n1,238 \n(201)\n— \n61,363 \n(2,506)\n(4 \n%)\nFinancial Products Segment\n3,785 \n— \n— \n— \n268 \n4,053 \n268 \n7 \n%\nCorporate Items and Eliminations\n(594)\n— \n— \n— \n(13)\n(607)\n(13)\n \nFinancial Products\n Revenues\n3,191 \n— \n— \n— \n255 \n3,446 \n255 \n8 \n%\nConsolidated Sales and Revenues\n$\n67,060 \n$\n(3,543)\n$\n1,238 \n$\n(201)\n$\n255 \n$\n64,809 \n$\n(2,251)\n(3 \n%)\nSales and Revenues by Geographic Region\nNorth America\nLatin America\nEAME\nAsia/Pacific\nExternal Sales and Revenues\nInter-Segment\nTotal Sales and Revenues\n(Millions of dollars)\n$\n% Chg\n$\n% Chg\n$\n% Chg\n$\n% Chg\n$\n% Chg\n$\n% Chg\n$\n% Chg\n2024\n \n \n \n \n \n \n \n \n \n \nConstruction Industries\n$\n14,576 \n(5%)\n$\n2,553 \n11%\n$\n4,315 \n(18%)\n$\n3,900 \n(11%)\n$\n25,344 \n(7%)\n$\n111 \n(10%)\n$\n25,455 \n(7 \n%)\nResource Industries\n4,561 \n(13%)\n2,077 \n2%\n1,804 \n(13%)\n3,576 \n(8%)\n12,018 \n(9%)\n371 \n9%\n12,389 \n(9 \n%)\nEnergy & Transportation\n13,005 \n9%\n1,763 \n(11%)\n5,787 \n(2%)\n3,533 \n2%\n24,088 \n3%\n4,766 \n3%\n28,854 \n3 \n%\nAll Other Segment\n56 \n(14%)\n— \n100%\n12 \n(33%)\n50 \n2%\n118 \n(10%)\n307 \n(3%)\n425 \n(5 \n%)\nCorporate Items and Eliminations\n(150)\n(6)\n(25)\n(24)\n(205)\n(5,555)\n(5,760)\nMachinery, Energy & Transportation \n32,048 \n(1%)\n6,387 \n1%\n11,893 \n(10%)\n11,035 \n(6%)\n61,363 \n(4%)\n— \n—%\n61,363 \n(4 \n%)\nFinancial Products Segment\n2,702 \n11%\n402 \n(3%)\n505 \n3%\n444 \n1%\n4,053 \n1\n7%\n— \n—%\n4,053 \n7 \n%\nCorporate Items and Eliminations\n(353)\n(81)\n(82)\n(91)\n(607)\n— \n(607)\nFinancial Products Revenues\n2,349 \n12%\n321 \n(5%)\n423 \n4%\n353 \n1%\n3,446 \n8%\n— \n—%\n3,446 \n8 \n%\nConsolidated Sales and Revenues\n$\n34,397 \n(1%)\n$\n6,708 \n1%\n$\n12,316 \n(10%)\n$\n11,388 \n(6%)\n$\n64,809 \n(3%)\n$\n— \n—%\n$\n64,809 \n(3 \n%)\n2023\n \n \n \n \n \n \n \n \n \n \nConstruction Industries\n$\n15,343 \n$\n2,307 \n$\n5,254 \n$\n4,390 \n$\n27,294 \n \n$\n124 \n$\n27,418 \nResource Industries\n5,256 \n2,040 \n2,069 \n3,879 \n13,244 \n \n339 \n13,583 \nEnergy & Transportation\n11,982 \n1,983 \n5,929 \n3,461 \n23,355 \n \n4,646 \n28,001 \nAll Other Segment\n65 \n(1)\n18 \n49 \n131 \n \n318 \n449 \nCorporate Items and Eliminations\n(133)\n(3)\n(5)\n(14)\n(155)\n \n(5,427)\n(5,582)\nMachinery, Energy & Transportation\n32,513 \n6,326 \n13,265 \n11,765 \n63,869 \n \n— \n63,869 \n \nFinancial Products Segment\n2,440 \n416 \n491 \n438 \n3,785 \n1\n \n— \n3,785 \nCorporate Items and Eliminations\n(347)\n(77)\n(83)\n(87)\n(594)\n \n— \n(594)\nFinancial Products Revenues\n2,093 \n339 \n408 \n351 \n3,191 \n \n— \n3,191 \n \nConsolidated Sales and Revenues\n$\n34,606 \n$\n6,665 \n$\n13,673 \n$\n12,116 \n$\n67,060 \n \n$\n— \n$\n67,060 \n1\n Includes revenues from Machinery, Energy & Transportation of $711 million and $690 million in 2024 and 2023, respectively.\n31\nTable of Contents\nCONSOLIDATED OPERATING PROFIT\nThe chart above graphically illustrates reasons for the change in consolidated operating profit between 2023 (at left) and 2024 (at right). Caterpillar management utilizes these charts internally to visually communicate with the company’s board of directors and employees. The bar entitled Other includes \nconsolidating adjustments\n and \nMachinery, Energy & Transportation other operating (income) expenses\n.\nOperating profit was $13.072 billion in 2024, an increase of $106 million, or 1 percent, compared with $12.966 billion in 2023. The profit impact of lower sales volume of $1.298 billion, higher selling, general and administrative (SG&A) and research and development (R&D) expenses of $201 million, and higher restructuring costs of $165 million were more than offset by favorable price realization of $1.238 billion, the absence of the impact of the divestiture of the company's Longwall business in 2023 of $586 million and favorable manufacturing costs of $246 million. The increase in SG&A/R&D expenses was primarily driven by investments aligned with strategic initiatives. Favorable manufacturing costs largely reflected lower freight. \nFor the twelve months ended December 31, 2024, restructuring costs increased primarily due to the divestitures of certain non-U.S. entities.\nOperating profit margin was 20.2 percent in 2024, compared with 19.3 percent in 2023.\nProfit (Loss) by Segment\n(Millions of dollars)\n2024\n2023\n$\nChange\n%\nChange\nConstruction Industries\n$\n6,165 \n$\n6,975 \n$\n(810)\n(12 \n%)\nResource Industries\n2,533 \n2,834 \n(301)\n(11 \n%)\nEnergy & Transportation \n5,736 \n4,936 \n800 \n16 \n%\nAll Other Segment\n48 \n18 \n30 \n167 \n%\nCorporate Items and Eliminations\n(1,384)\n(2,104)\n720 \n \nMachinery, Energy & Transportation\n13,098 \n12,659 \n439 \n3 \n%\nFinancial Products Segment\n932 \n909 \n23 \n3 \n%\nCorporate Items and Eliminations\n(327)\n14 \n(341)\n \nFinancial Products\n605 \n923 \n(318)\n(34 \n%)\nConsolidating Adjustments\n(631)\n(616)\n(15)\n \nConsolidated Operating Profit\n$\n13,072 \n$\n12,966 \n$\n106 \n1 \n%\n32\nTable of Contents\nOther Profit/Loss and Tax Items\n•\nInterest expense excluding Financial Products in 2024 was $512 million, compared with $511 million in 2023.\n•\nOther income (expense) in 2024 was income of $813 million, compared with income of $595 million in 2023. The change was primarily driven by favorable foreign currency impacts, favorable impacts from \npension and other postemployment benefit (OPEB)\n plan costs and higher mark-to-market gains for remeasurement of pension and OPEB plans.\n•\nThe effective tax rate for 2024 was 19.7 percent compared to 21.3 percent for 2023. Excluding the discrete items discussed below, the annual effective tax rate was 22.2 percent for 2024 compared to 21.4 percent for 2023. The increase from 2023 was primarily related to changes in the geographic mix of profits from a tax perspective.\nIn 2024, the company recorded a discrete tax benefit of $224 million for a tax law change related to currency translation.  The 2024 annual effective tax rate excludes the impact of losses of $164 million for the divestitures of certain non-U.S. entities with related tax benefits of $54 million. The 2023 annual effective tax rate excludes the impact of the nondeductible loss of $586 million related to the divestiture of the company’s Longwall business. The company also recorded a tax charge of $43 million related to $154 million of mark-to-market gains for remeasurement of pension and OPEB plans in 2024, compared to a tax charge of $26 million related to $97 million of mark-to-market gains in 2023. In 2024, the company recorded discrete tax benefits of $47 million to reflect changes in estimates related to prior years. In addition, a discrete tax benefit of $57 million was recorded in 2024 and 2023 for the settlement of stock-based compensation awards with associated tax deductions in excess of cumulative U.S. GAAP compensation expense. In 2023, the company recorded a discrete tax benefit of $88 million due to a change in the valuation allowance for certain non-U.S. deferred tax assets.\nConstruction Industries\nConstruction Industries’ total sales were $25.455 billion in 2024, a decrease of $1.963 billion, or 7 percent, compared with $27.418 billion in 2023. The decrease was primarily due to lower sales volume. The decrease in sales volume was mainly driven by lower sales of equipment to end users. \n•\nIn North America, sales decreased due to lower sales volume. Lower sales volume was primarily driven by the impact from changes in dealer inventories. Dealer inventory increased less during 2024 than during 2023.\n•\nSales increased in Latin America primarily due to higher sales volume, partially offset by unfavorable price realization and unfavorable currency impacts primarily related to the Brazilian real. Higher sales volume was mainly driven by the impact from changes in dealer inventories. Dealer inventory increased during 2024, compared with a decrease during 2023.\n•\nIn EAME, sales decreased primarily due to lower sales volume. Lower sales volume was mainly due to lower sales of equipment to end users. \n•\nSales decreased in Asia/Pacific primarily due to lower sales volume and unfavorable currency impacts, primarily related to the Japanese yen. Lower sales volume was mainly driven by the impact from changes in dealer inventories. Dealer inventory decreased during 2024, compared with an increase during 2023.\nConstruction Industries’ profit was $6.165 billion in 2024, a decrease of $810 million, or 12 percent, compared with $6.975 billion in 2023. The decrease was mainly due to the profit impact of lower sales volume.\nConstruction Industries’ profit as a percent of total sales was 24.2 percent in 2024, compared with 25.4 percent in 2023.\nResource Industries\nResource Industries’ total sales were $12.389 billion in 2024, a decrease of $1.194 billion, or 9 percent, compared with $13.583 billion in 2023. The decrease was primarily due to lower sales volume, partially offset by favorable price realization. Sales volume decreased primarily due to lower sales of equipment to end users.\nResource Industries’ profit was $2.533 billion in 2024, a decrease of $301 million, or 11 percent, compared with $2.834 billion in 2023. The decrease was mainly due to the profit impact of lower sales volume of $655 million, partially offset by favorable price realization of $405 million. \nResource Industries’ profit as a percent of total sales was 20.4 percent for 2024, compared with 20.9 percent for 2023.\n33\nTable of Contents\nEnergy & Transportation\nSales by Application\n(Millions of dollars)\n2024\n2023\n$\nChange\n%\n \nChange\nOil and Gas\n$\n6,980 \n$\n6,988 \n$\n(8)\n— \n%\nPower Generation\n7,756 \n6,362 \n1,394 \n22 \n%\nIndustrial\n3,990 \n4,871 \n(881)\n(18 \n%)\nTransportation\n5,362 \n5,134 \n228 \n4 \n%\nExternal Sales\n24,088 \n23,355 \n733 \n3 \n%\nInter-Segment\n4,766 \n4,646 \n120 \n3 \n%\nTotal Sales\n$\n28,854 \n$\n28,001 \n$\n853 \n3 \n%\nEnergy & Transportation’s total sales were $28.854 billion in 2024, an increase of $853 million, or 3 percent, compared with $28.001 billion in 2023. The increase was primarily due to favorable price realization.\n•\nOil and Gas – Sales were about flat. Decreased sales in reciprocating engines used in well servicing applications were offset by increased sales in reciprocating engines used in gas compression applications and increased sales for turbines and turbine-related services.\n•\nPower Generation – Sales increased in large reciprocating engines, primarily data center applications. Turbines and turbine-related services increased as well.\n•\nIndustrial – Sales decreased in EAME and North America.\n•\nTransportation – Sales increased in marine and rail services, partially offset by lower sales of reciprocating engine aftermarket parts.\nEnergy & Transportation’s profit was $5.736 billion in 2024, an increase of $800 million, or 16 percent, compared with $4.936 billion in 2023. The increase was mainly due to favorable price realization.\nEnergy & Transportation’s profit as a percent of total sales was 19.9 percent in 2024, compared with 17.6 percent in 2023.\nFinancial Products Segment\nFinancial Products’ segment revenues were $4.053 billion in 2024, an increase of $268 million, or 7 percent, compared with $3.785 billion in 2023. The increase was primarily due to a favorable impact from higher average financing rates across all regions of $153 million and a favorable impact from higher average \nearning assets\n of $127 million driven by North America.\nFinancial Products’ segment profit was $932 million in 2024, an increase of $23 million, or 3 percent, compared with $909 million in 2023. The increase was mainly due to a favorable impact from higher average earning assets of $54 million, an insurance settlement of $33 million, and a favorable impact from equity securities of $32 million. These favorable impacts were partially offset by an increase in SG&A expenses of $54 million and an unfavorable impact from returned or repossessed equipment of $34 million.\nCorporate Items and Eliminations\nExpense for corporate items and eliminations was $1.711 billion in 2024, a decrease of $379 million from 2023, primarily driven by the absence of the divestiture of the company's Longwall business in 2023, partially offset by unfavorable impacts of segment reporting methodology differences.\n2023 COMPARED WITH 2022 \nFor discussions related to the consolidated sales and revenue and consolidated operating profit between 2023 and 2022, refer to Part II, Item 7. Management's Discussion and Analysis of Financial Condition and Results of Operations of the Company's Annual Report on Form 10-K for the fiscal year ended December 31, 2023, which was filed with the United States Securities and Exchange Commission on February 16, 2024 and hereby incorporated by reference. \n34\nTable of Contents\nRESTRUCTURING COSTS\nIn 2025, we expect to incur about $150 million to $200 million of restructuring costs. We expect that prior restructuring actions will result in an incremental benefit to operating costs, primarily Costs of goods sold and SG&A expenses, of about $25 million in 2025 compared with 2024. \nAdditional information related to restructuring costs is included in Note 24 — \"Restructuring income/costs\" of Part II, Item 8 \"Financial Statements and Supplemental Data.\"\nGLOSSARY OF TERMS\n1.\nAdjusted Operating Profit Margin\n – Operating profit excluding restructuring income/costs as a percent of sales and revenues.\n2.\nAdjusted Profit Per Share\n – Profit per share excluding restructuring income/costs, a discrete tax benefit for a tax law change related to currency translation, pension and OPEB mark-to-market gains/losses and certain deferred tax valuation allowance adjustments in 2023.\n3.\nAll Other Segment\n – Primarily includes activities such as: business strategy; product management and development; manufacturing and sourcing of wear and maintenance components primarily for Cat® products; parts distribution; integrated logistics solutions; distribution services responsible for dealer development and administration, including a wholly owned dealer in Japan; dealer portfolio management and ensuring the most efficient and effective distribution of machines, engines and parts; brand management and marketing strategy; and digital investments for new customer and dealer solutions that integrate data analytics with state-of-the-art digital technologies while transforming the buying experience.\n4.\nConsolidating Adjustments\n – Elimination of transactions between Machinery, Energy & Transportation and Financial Products.\n5.\nConstruction Industries\n – A segment primarily responsible for supporting customers using machinery in infrastructure and building construction applications. Responsibilities include business strategy, product design, product management and development, manufacturing, marketing and sales and product support. The product portfolio includes asphalt pavers; backhoe loaders; cold planers; compactors; compact track loaders; forestry machines; material handlers; motor graders; pipelayers; road reclaimers; skid steer loaders; telehandlers; track-type loaders; track-type tractors (small, medium); track excavators (mini, small, medium, large); wheel excavators; wheel loaders (compact, small, medium); and related parts and work tools.\n6.\nCorporate Items and Eliminations\n – Includes corporate-level expenses, timing differences (as some expenses are reported in segment profit on a cash basis), methodology differences between segment and consolidated external reporting, certain restructuring costs and inter-segment eliminations.\n7.\nCurrency\n – With respect to sales and revenues, currency represents the translation impact on sales resulting from changes in foreign currency exchange rates versus the U.S. dollar. With respect to operating profit, currency represents the net translation impact on sales and operating costs resulting from changes in foreign currency exchange rates versus the U.S. dollar. Currency only includes the impact on sales and operating profit for the Machinery, Energy & Transportation line of business; currency impacts on Financial Products revenues and operating profit are included in the Financial Products portions of the respective analyses. With respect to other income/expense, currency represents the effects of forward and option contracts entered into by the company to reduce the risk of fluctuations in exchange rates (hedging) and the net effect of changes in foreign currency exchange rates on our foreign currency assets and liabilities for consolidated results (translation).\n8.\nDealer Inventories\n – Represents dealer machine and engine inventories, excluding aftermarket parts.\n9.\nEAME\n – A geographic region including Europe, Africa, the Middle East and Eurasia.\n10.\nEarning Assets\n – Assets consisting primarily of total finance receivables net of unearned income, plus equipment on operating leases net of accumulated depreciation at Cat Financial.\n11.\nEnergy & Transportation\n – A segment primarily responsible for supporting customers using reciprocating engines, turbines, diesel-electric locomotives and related services across industries serving Oil and Gas, Power Generation, Industrial and Transportation applications, including marine- and rail-related businesses as well as product support of on-highway engines. Responsibilities include business strategy, product design, product management, development and testing, manufacturing, marketing and sales and product support. The product and services portfolio includes turbines, centrifugal gas compressors, and turbine-related services; reciprocating engine-powered generator sets; integrated systems \n35\nTable of Contents\nand solutions used in the electric power generation industry; reciprocating engines, drivetrain and integrated systems and solutions for the marine and oil and gas industries; reciprocating engines, drivetrain and integrated systems and solutions supplied to the industrial industry as well as Caterpillar machines; electrified powertrain and zero-emission power sources and service solutions development; and diesel-electric locomotives and components and other rail-related products and services, including remanufacturing and leasing. Responsibilities also include the remanufacturing of Caterpillar reciprocating engines and components and remanufacturing services for other companies.\n12.\nFinancial Products\n – The company defines Financial Products as our finance and insurance subsidiaries, primarily Caterpillar Financial Services Corporation (Cat Financial) and Caterpillar Insurance Holdings Inc. (Insurance Services). Financial Products’ information relates to the financing to customers and dealers for the purchase and lease of Caterpillar and other equipment.\n13.\nFinancial Products Segment\n – Provides financing alternatives to customers and dealers around the world for Caterpillar products and services, as well as financing for power generation facilities that, in most cases, incorporate Caterpillar products. Financing plans include operating and finance leases, revolving charge accounts, installment sale contracts, repair/rebuild financing, working capital loans and wholesale financing plans. The segment also provides insurance and risk management products and services that help customers and dealers manage their business risk. Insurance and risk management products offered include physical damage insurance, inventory protection plans, extended service coverage and maintenance plans for machines and engines, and dealer property and casualty insurance. The various forms of financing, insurance and risk management products offered to customers and dealers help support the purchase and lease of Caterpillar equipment. The segment also earns revenues from Machinery, Energy & Transportation, but the related costs are not allocated to operating segments. Financial Products’ segment profit is determined on a pretax basis and includes other income/expense items.\n14.\nLatin America\n – A geographic region including Central and South American countries and Mexico.\n15.\nMachinery, Energy & Transportation (ME&T)\n – The company defines ME&T as Caterpillar Inc. and its subsidiaries, excluding Financial Products. ME&T’s information relates to the design, manufacturing and marketing of its products. \n16.\nMachinery, Energy & Transportation Other Operating (Income) Expenses\n – Comprised primarily of gains/losses on disposal of long-lived assets, gains/losses on divestitures and legal settlements and accruals.\n17.\nManufacturing Costs\n – Manufacturing costs exclude the impacts of currency and represent the volume-adjusted change for variable costs and the absolute dollar change for period manufacturing costs. Variable manufacturing costs are defined as having a direct relationship with the volume of production. This includes material costs, direct labor and other costs that vary directly with production volume, such as freight, power to operate machines and supplies that are consumed in the manufacturing process. Period manufacturing costs support production but are defined as generally not having a direct relationship to short-term changes in volume. Examples include machinery and equipment repair, depreciation on manufacturing assets, facility support, procurement, factory scheduling, manufacturing planning and operations management.\n18.\nMark-to-market gains/losses\n – Represents the net gain or loss of actual results differing from the company’s assumptions and the effects of changing assumptions for our defined benefit pension and OPEB plans. These gains and losses are immediately recognized through earnings upon the annual remeasurement in the fourth quarter, or on an interim basis as triggering events warrant remeasurement.\n19.\nPension and Other Postemployment Benefits (OPEB)\n – The company’s defined-benefit pension and postretirement benefit plans.\n20.\nPrice Realization\n – The impact of net price changes excluding currency and new product introductions. Price realization includes geographic mix of sales, which is the impact of changes in the relative weighting of sales prices between geographic regions.\n21.\nResource Industries\n – A segment primarily responsible for supporting customers using machinery in mining, heavy construction and quarry and aggregates. Responsibilities include business strategy, product design, product management and development, manufacturing, marketing and sales and product support. The product portfolio includes large track-type tractors; large mining trucks; hard rock vehicles; electric rope shovels; draglines; hydraulic shovels; rotary drills; large wheel loaders; off-highway trucks; articulated trucks; wheel tractor scrapers; wheel dozers; landfill compactors; soil compactors; wide-body trucks; select work tools; machinery components; electronics and control systems and related parts. In addition to equipment, Resource Industries also develops and sells technology products and services to provide customers fleet management, equipment management analytics, autonomous machine capabilities, safety services and mining performance solutions. Resource Industries also manages areas that provide services to other parts of the company, including strategic procurement, lean center of excellence, integrated manufacturing, research and development for hydraulic systems, automation, electronics and software for Caterpillar machines and engines.\n36\nTable of Contents\n22.\nRestructuring income/costs\n – May include costs for employee separation, long-lived asset impairments, contract terminations and (gains)/losses on divestitures. These costs are included in Other operating (income) expenses except for defined-benefit plan curtailment losses and special termination benefits, which are included in Other income (expense). Restructuring costs also include other exit-related costs, which may consist of accelerated depreciation, inventory write-downs, building demolition, equipment relocation and project management costs and LIFO inventory decrement benefits from inventory liquidations at closed facilities, all of which are primarily included in Cost of goods sold.\n23.\nSales Volume\n – With respect to sales and revenues, sales volume represents the impact of changes in the quantities sold for Machinery, Energy & Transportation as well as the incremental sales impact of new product introductions, including emissions-related product updates. With respect to operating profit, sales volume represents the impact of changes in the quantities sold for Machinery, Energy & Transportation combined with product mix as well as the net operating profit impact of new product introductions, including emissions-related product updates. Product mix represents the net operating profit impact of changes in the relative weighting of Machinery, Energy & Transportation sales with respect to total sales. The impact of sales volume on segment profit includes inter-segment sales.\n24.\nServices\n – Machinery, Energy & Transportation services revenues include, but are not limited to, aftermarket parts and other service-related revenues and exclude most Financial Products revenues, discontinued products and captive dealer services.\nLIQUIDITY AND CAPITAL RESOURCES\n \nSources of funds\n \nWe generate significant capital resources from operating activities, which are the primary source of funding for our ME&T operations. Funding for these businesses is also available from commercial paper and long-term debt issuances. Financial Products’ operations are funded primarily from commercial paper, term debt issuances and collections from its existing portfolio. During 2024, we had positive operating cash flow within both our ME&T and Financial Products' operations. On a consolidated basis, we ended 2024 with $6.89 billion of cash, a decrease of $89 million from year-end 2023. In addition, ME&T invests in available-for-sale debt securities and bank time deposits that are considered highly liquid and are available for current operations. These ME&T securities were $1.98 billion as of December 31, 2024 and are included in Prepaid expenses and other current assets and Other assets in the Consolidated Statement of Financial Position. We intend to maintain a strong cash and liquidity position.\n \nConsolidated operating cash flow for 2024 was $12.04 billion, down $850 million compared to 2023. The decrease was primarily due to changes in accrued wages, salaries, and employee benefits, and higher cash taxes paid. These were partially offset by lower working capital requirements. Within working capital, changes in accounts payable, customer advances, and receivables favorably impacted cash flow, partially offset by changes in accrued expenses.  \nTotal debt as of December 31, 2024 was $38.41 billion, an increase of $531 million from year-end 2023. Debt related to ME&T decreased $893 million in 2024. Debt related to Financial Products increased by $1.54 billion due to portfolio funding requirements. \n \nAs of December 31, 2024, we had three global credit facilities with a syndicate of banks totaling $10.50 billion (Credit Facility) available in the aggregate to both Caterpillar and Cat Financial for general liquidity purposes. Based on management’s allocation decision, which can be revised from time to time, the portion of the Credit Facility available to ME&T as of December 31, 2024 was $2.75 billion. Information on our Credit Facility is as follows:\n•\nIn August 2024, we entered into a new 364-day facility. The 364-day facility of $3.15 billion (of which $825 million is available to ME&T) expires in August 2025.\n•\nIn August 2024, we amended and extended the three-year facility (as amended and restated, the \"three-year facility\"). The three-year facility of $2.73 billion (of which $715 million is available to ME&T) expires in August 2027.\n•\nIn August 2024, we amended and extended the five-year facility (as amended and restated, the \"five-year facility\"). The five-year facility of $4.62 billion (of which $1.21 billion is available to ME&T) expires in August 2029.\nAt December 31, 2024, Caterpillar’s consolidated net worth was $19.56 billion, which was above the $9.00 billion required under the Credit Facility.  The consolidated net worth is defined as the consolidated shareholders' equity including preferred stock but excluding the pension and other postretirement benefits balance within AOCI.\n37\nTable of Contents\nAt December 31, 2024, Cat Financial’s covenant interest coverage ratio was 1.41 to 1.  This was above the 1.15 to 1 minimum ratio, calculated as (1) profit excluding income taxes, interest expense and net gain/(loss) from interest rate derivatives to (2) interest expense calculated at the end of each fiscal quarter for the prior four consecutive fiscal quarter period, required by the Credit Facility.\nIn addition, at December 31, 2024, Cat Financial’s six-month covenant leverage ratio was 7.25 to 1 and year-end covenant leverage ratio was 7.37 to 1.  This was below the maximum ratio of debt to net worth of 10 to 1, calculated (1) on a monthly basis as the average of the leverage ratios determined on the last day of each of the six preceding calendar months and (2) at each December 31, required by the Credit Facility.\nIn the event Caterpillar or Cat Financial does not meet one or more of their respective financial covenants under the Credit Facility in the future (and are unable to obtain a consent or waiver), the syndicate of banks may terminate the commitments allocated to the party that does not meet its covenants. Additionally, in such event, certain of Cat Financial's other lenders under other loan agreements where similar financial covenants or cross default provisions are applicable may, at their election, choose to pursue remedies under those loan agreements, including accelerating the repayment of outstanding borrowings.  At December 31, 2024, there were no borrowings under the Credit Facility.\nThe aforementioned financial covenants are being reported as calculated under the Credit Facility and not pursuant to U.S. GAAP. Please refer to the credit agreements governing the Credit Facility filed as an exhibit to our periodic reports for further information related to the calculation thereof. For risks related to our indebtedness and compliance with these covenants, please refer to the risk factor \"Restrictive covenants in our debt agreements could limit our financial and operating flexibility\" set forth in Part I, Item 1A of this Form 10-K.\nOur total credit commitments and available credit as of December 31, 2024 were:\n \nDecember 31, 2024\n(Millions of dollars)\nConsolidated\nMachinery,\nEnergy & \nTransportation\nFinancial\nProducts\nCredit lines available:\n \n \n \nGlobal credit facilities\n$\n10,500\n \n$\n2,750\n \n$\n7,750\n \nOther external\n4,062\n \n610\n \n3,452\n \nTotal credit lines available\n14,562\n \n3,360\n \n11,202\n \nLess: Commercial paper outstanding\n(3,946)\n—\n \n(3,946)\nLess: Utilized credit\n(687)\n—\n \n(687)\nAvailable credit\n$\n9,929\n \n$\n3,360\n \n$\n6,569\n \n \nThe other consolidated credit lines with banks as of December 31, 2024 totaled $4.06 billion. These committed and uncommitted credit lines, which may be eligible for renewal at various future dates or have no specified expiration date, are used primarily by our subsidiaries for local funding requirements.  Caterpillar or Cat Financial may guarantee subsidiary borrowings under these lines. \n \nWe receive debt ratings from the major credit rating agencies. Fitch maintains a \"high-A\" debt rating, while Moody’s and S&P maintain a “mid-A” debt rating. A downgrade of our credit ratings by any of the major credit rating agencies could result in increased borrowing costs and could make access to certain credit markets more difficult. In the event economic conditions deteriorate such that access to debt markets becomes unavailable, ME&T’s operations would rely on cash flow from operations, use of existing cash balances, borrowings from Cat Financial and access to our committed credit facilities. Our Financial Products’ operations would rely on cash flow from its existing portfolio, existing cash balances, access to our committed credit facilities and other credit line facilities of Cat Financial, and potential borrowings from Caterpillar. In addition, we maintain a support agreement with Cat Financial, which requires Caterpillar to remain the sole owner of Cat Financial and may, under certain circumstances, require Caterpillar to make payments to Cat Financial should Cat Financial fail to maintain certain financial ratios.\n38\nTable of Contents\nWe facilitate voluntary supplier finance programs (the “Programs”) through participating financial institutions. We account for the payments made under the Programs, the same as our other accounts payable, as a reduction to our cash flows from operations. We do not believe that changes in the availability of the Programs will have a significant impact on our liquidity. Additional information related to the Programs is included in Note 19 — \"Supplier finance programs\" of Part II, Item 8 \"Financial Statements and Supplementary Data\".\nMaterial cash requirements for contractual obligations\nWe believe our balances of cash and cash equivalents of $6.89 billion and available-for-sale debt securities of $1.98 billion as of December 31, 2024, along with cash generated by ongoing operations and continued access to debt markets, will be sufficient to satisfy our cash requirements over the next 12 months and beyond.\nWe have committed cash outflows related to postretirement benefit obligations, long-term debt and operating lease agreements. See Notes 12, 14 and 20, respectively, of Part II, Item 8 “Financial Statements and Supplementary Data” for additional information.\nWe have short-term obligations related to the purchase of goods and services made in the ordinary course of business. These consist of invoices received and recorded as liabilities as of December 31, 2024, but scheduled for payment in 2025 of $7.68 billion.  In addition, we have contractual obligations for material and services on order at December 31, 2024, but not yet invoiced or delivered, of $6.69 billion.\nWe also have long-term contractual obligations primarily for logistics services agreements; systems support, software licenses and development contracts; information technology consulting contracts; outsourcing contracts for benefit plan administration and long-term commitments entered into with key suppliers for minimum purchase quantities. These obligations total $1.63 billion, with $762 million due in the next 12 months.\nMachinery, Energy & Transportation\n \nNet cash provided by operating activities was $11.44 billion in 2024, compared with $11.69 billion in 2023. The decrease was primarily due to changes in accrued wages, salaries, and employee benefits, higher cash taxes paid, and changes in other liabilities. These were partially offset by decreased working capital requirements. Within working capital, changes in receivables, accounts payable, and customer advances favorably impacted cash flow partially offset by changes in accrued expenses.  \nNet cash provided by investing activities in 2024 was $133 million, compared with net cash used of $3.92 billion in 2023. The change was due to lower new investments in securities and higher proceeds from maturities and sale of securities, primarily due to time deposit maturities in 2024. \nNet cash used for financing activities during 2024 was $11.42 billion, compared with $7.65 billion in 2023. The change was primarily due to higher payments to repurchase shares and debt repayments in 2024.\n \nWhile our short-term priorities for the use of cash may vary from time to time as business needs and conditions dictate, our long-term cash deployment strategy is focused on the following priorities. Our top priority is to maintain a strong financial position in support of a mid-A rating. Next, we intend to fund operational requirements and commitments. Then, we intend to fund priorities that profitably grow the company and return capital to shareholders through dividend growth and share repurchases.  Additional information on cash deployment is as follows:\n \nStrong financial position\n \n—\n Our top priority is to maintain a strong financial position in support of a mid-A rating. We track a diverse group of financial metrics that focus on liquidity, leverage, cash flow and margins which align with our cash deployment actions and the various methodologies used by the major credit rating agencies.\nOperational excellence and commitments\n \n—\n Capital expenditures were $1.99 billion during 2024, compared to $1.66 billion in 2023. We expect ME&T’s capital expenditures in 2025 to be about $2.5 billion. We made $271 million of contributions to our pension and OPEB plans during 2024. In comparison, we made $361 million of contributions to our pension and OPEB plans in 2023. We expect to make approximately $354 million of contributions to our pension and OPEB plans in 2025. \n \n39\nTable of Contents\nFund strategic growth initiatives and return capital to shareholders\n \n—\n We intend to utilize our liquidity and debt capacity to fund targeted investments that drive long-term profitable growth focused in the areas of expanded offerings,  services and sustainability, including acquisitions. \nAs part of our capital allocation strategy, ME&T free cash flow is a liquidity measure we use to determine the cash generated and available for financing activities including debt repayments, dividends and share repurchases. We define ME&T free cash flow as cash from ME&T operations less capital expenditures, excluding discretionary pension and other postretirement benefit plan contributions. A goal of our capital allocation strategy is to return substantially all ME&T free cash flow to shareholders over time in the form of dividends and share repurchases, while maintaining our mid-A rating. \nEach quarter, our Board of Directors reviews the company's dividend for the applicable quarter. The Board evaluates the financial condition of the company and considers corporate cash flow, the company's liquidity needs, the economic outlook, and the health and stability of global credit markets to determine whether to maintain or change the quarterly dividend. In December 2024, the Board of Directors approved maintaining our quarterly dividend representing $1.41 per share, and we continue to expect our strong financial position to support the dividend. Dividends paid totaled $2.65 billion in 2024.\nOur share repurchase plans are subject to the company’s cash deployment priorities and are evaluated on an ongoing basis considering the financial condition of the company, corporate cash flow, the company's liquidity needs, the economic outlook, and the health and stability of global credit markets. The timing and amount of future repurchases may vary depending on market conditions and investing priorities. In May 2022, the Board approved a share repurchase authorization (the 2022 Authorization) of up to $15.0 billion of Caterpillar common stock effective August 1, 2022 with no expiration.  In June 2024, the Board approved an additional share repurchase authorization (the 2024 Authorization) of up to $20.0 billion of Caterpillar common stock, effective June 12, 2024, with no expiration. In 2024, we repurchased $7.7 billion of Caterpillar common stock, with $20.1 billion remaining under the 2022 and 2024 Authorizations as of December 31, 2024. Caterpillar's basic shares outstanding as of December 31, 2024 were approximately 478 million. \nFinancial Products\n \nNet cash provided by operating activities was $1.45 billion in 2024, compared with $1.11 billion in 2023. Net cash used for investing activities was $2.79 billion in 2024, compared with $1.42 billion used in 2023. The change was primarily due to portfolio related activity and the divestiture of a non-U.S. entity. Net cash provided by financing activities was $1.21 billion in 2024, compared with net cash provided of $278 million in 2023. The change was primarily due to higher net inflows from external borrowings partially offset by higher dividends paid to Caterpillar in 2024.\nOff-balance sheet arrangements\nWe are a party to certain off-balance sheet arrangements, primarily in the form of guarantees.  Information related to guarantees appears in Note 21 — “Guarantees and product warranty” of Part II, Item 8 “Financial Statements and Supplementary Data.”\nRECENT ACCOUNTING PRONOUNCEMENTS\nFor a discussion of recent accounting pronouncements, see Note 1J — “New accounting guidance” of Part II, Item 8 “Financial Statements and Supplementary Data.” \nCRITICAL ACCOUNTING ESTIMATES\n \nThe preparation of financial statements in conformity with generally accepted accounting principles requires management to make estimates and assumptions that affect reported amounts. The more significant estimates include: residual values for leased assets, fair values for goodwill impairment tests, warranty liability, reserves for product liability and insurance losses, postretirement benefits, post-sale discounts, credit losses and income taxes. We have incorporated many years of data into the determination of each of these estimates and we have not historically experienced significant adjustments. We review these assumptions at least annually with the Audit Committee of the Board of Directors. Following are the methods and assumptions used in determining our estimates and an indication of the risks inherent in each.\n \nResidual values for leased assets\n — We determine the residual value of Cat Financial’s leased equipment based on its estimated end-of-term market value.  We estimate the residual value of leased equipment at the inception of the lease based on a number of factors, including historical wholesale market sales prices, past remarketing experience and any known significant \n40\nTable of Contents\nmarket/product trends.  We also consider the following critical factors in our residual value estimates: lease term, market size and demand, total expected hours of usage, machine configuration, application, location, model changes, quantities, third-party residual guarantees and contractual customer purchase options. \nUpon termination of the lease, the equipment is either purchased by the lessee or sold to a third-party, in which case we may record a gain or a loss for the difference between the estimated residual value and the sale proceeds.\nDuring the term of our leases, we monitor residual values.  For operating leases, we record adjustments to depreciation expense reflecting changes in residual value estimates prospectively on a straight-line basis.  For finance leases, we recognize residual value adjustments through a reduction of finance revenue over the remaining lease term.\nWe evaluate the carrying value of equipment on operating leases for potential impairment when we determine a triggering event has occurred.  When a triggering event occurs, we perform a test for recoverability by comparing projected undiscounted future cash flows to the carrying value of the equipment on operating leases.  If the test for recoverability identifies a possible impairment, we measure the fair value of the equipment on operating leases in accordance with the fair value measurement framework.  We recognize an impairment charge for the amount by which the carrying value of the equipment on operating leases exceeds its estimated fair value.\nAt December 31, 2024, the aggregate residual value of equipment on operating leases was $1.55 billion.  Without consideration of other factors such as third-party residual guarantees or contractual customer purchase options, a 10 percent non-temporary decrease in the market value of our equipment subject to operating leases would reduce residual value estimates and result in the recognition of approximately $70 million of additional annual depreciation expense.\nFair values for goodwill impairment tests —\n We test goodwill for impairment annually, at the reporting unit level, and whenever events or circumstances make it more likely than not that an impairment may have occurred, such as a significant adverse change in the business climate or a decision to sell all or a portion of a reporting unit.  We perform our annual goodwill impairment test as of October 1 and monitor for interim triggering events on an ongoing basis.\nWe review goodwill for impairment utilizing either a qualitative assessment or a quantitative goodwill impairment test.  If we choose to perform a qualitative assessment and determine the fair value more likely than not exceeds the carrying value, no further evaluation is necessary.  For reporting units where we perform the quantitative goodwill impairment test, we compare the fair value of each reporting unit, which we primarily determine using an income approach based on the present value of discounted cash flows, to the respective carrying value, which includes goodwill.  If the fair value of the reporting unit exceeds its carrying value, we do not consider the goodwill impaired.  If the carrying value is higher than the fair value, we recognize the difference as an impairment loss. \nFor reporting units where we perform a quantitative goodwill impairment test, the process requires valuation of the respective reporting unit, which we primarily determine using an income approach based on a discounted five year forecasted cash flow with a year-five residual value.  We compute the residual value using the constant growth method, which values the forecasted cash flows in perpetuity.  The assumptions about future cash flows and growth rates are based on each reporting unit's long-term forecast and are subject to review and approval by senior management.  A reporting unit’s discount rate is a risk-adjusted weighted average cost of capital, which we believe approximates the rate from a market participant’s perspective.  The estimated fair value could be impacted by changes in market conditions, interest rates, growth rates, tax rates, costs, pricing and capital expenditures.  We categorize the fair value determination as Level 3 in the fair value hierarchy due to its use of internal projections and unobservable measurement inputs.\nWe completed our annual assessment of goodwill in the fourth quarter of 2024 and determined that there was no impairment of goodwill. Caterpillar's market capitalization has remained significantly above the net book value of the Company. \nAn unfavorable change in our expectations for the financial performance of our reporting units, particularly long-term growth and profitability, would reduce the fair value of our reporting units.  The demand for our equipment and related parts is highly cyclical and significantly impacted by commodity prices, although the impact may vary by reporting unit.  The energy and mining industries are major users of our products, including the mineral extraction, oil and natural gas industries.  Decisions to purchase our products are dependent upon the performance of those industries, which in turn are dependent in part on commodity prices.  Lower commodity prices or industry specific circumstances that have a negative impact to the valuation assumptions may reduce the fair value of our reporting units.  Should such events occur and it becomes more likely than not that a reporting unit’s fair value has fallen below its carrying value, we will perform an interim goodwill impairment test(s), in addition to the annual impairment test.  Future impairment tests may result in a goodwill impairment, depending on the outcome of the quantitative impairment test.  We would report a goodwill impairment as a non-cash charge to earnings.\n41\nTable of Contents\n \nProduct warranty liability\n — At the time we recognize a sale, we record estimated future warranty costs.  We determine the product warranty liability by applying historical claim rate experience to the current field population and dealer inventory.  Generally, we base historical claim rates on actual warranty experience for each product by machine model/engine size by customer or dealer location (inside or outside North America).  We develop specific rates for each product shipment month and update them monthly based on actual warranty claim experience.  Warranty costs may differ from those estimated if actual claim rates are higher or lower than our historical rates.\n \nProduct liability and insurance loss reserve\n — We determine these reserves based upon reported claims in process of settlement and actuarial estimates for losses incurred but not reported. Loss reserves, including incurred but not reported reserves, are based on estimates, and ultimate settlements may vary significantly from such estimates due to increased claims frequency or severity over historical levels. The amount of these reserves totaled $1.5 billion and $1.4 billion at December 31, 2024 and 2023, respectively.  The majority of the balance in both 2024 and 2023 consisted of unearned insurance premiums.\n \n \nPostretirement benefits\n — We sponsor defined benefit pension plans and/or other postretirement benefit plans (retirement healthcare and life insurance) to employees in many of our locations throughout the world.  There are assumptions used in the accounting for these defined benefit plans that include discount rate, expected return on plan assets, expected rate of compensation increase, the future health care trend rate, mortality and other economic and demographic assumptions.  The actuarial assumptions we use may change or differ significantly from actual results, which may result in a material impact to our consolidated financial statements.\nThe effects of actual results differing from our assumptions and the effects of changing assumptions are considered actuarial gains or losses. We utilize a mark-to-market approach in recognizing actuarial gains or losses immediately through earnings upon the annual remeasurement in the fourth quarter, or on an interim basis as triggering events warrant remeasurement.\nPrimary actuarial assumptions were determined as follows:\n•\nWe use the assumed discount rate to discount future benefit obligations back to today’s dollars.  The U.S. discount rate is based on a benefit cash flow-matching approach and represents the rate at which our benefit obligations could effectively be settled as of our measurement date, December 31.  The benefit cash flow-matching approach involves analyzing Caterpillar’s projected cash flows against a high quality bond yield curve, calculated using a wide population of corporate Aa bonds available on the measurement date.  We use a similar approach to determine the assumed discount rate for our most significant non-U.S. plans.  In estimating the service and interest cost components of net periodic benefit cost, we utilize a full yield curve approach in determining a discount rate.  This approach applies the specific spot rates along the yield curve used in the determination of the benefit obligation to the relevant projected cash flows. Discount rates are sensitive to changes in interest rates.  \n•\nThe expected long-term rate of return on plan assets is based on our estimate of long-term returns for equities and fixed income securities weighted by the allocation of our plan assets.  This rate is impacted by changes in general market conditions, but because it represents a long-term rate, it is not significantly impacted by short-term market swings.  Changes in our allocation of plan assets would also impact this rate.  For example, a shift to more fixed income securities would lower the rate.  The expected return on plan assets is based on the fair value of plan asset allocations as of our measurement date, December 31.  \n•\nWe use the expected rate of compensation increase to develop benefit obligations using projected pay at retirement.  It represents average long-term salary increases.  This rate is influenced by our long-term compensation policies.  \n•\nThe assumed health care trend rate represents the rate at which health care costs are assumed to increase and is based on historical and expected experience.  Changes in our projections of future health care costs due to general economic conditions and those specific to health care (e.g., technology driven cost changes) will impact this trend rate.  \n•\nWe use the mortality assumption to estimate the life expectancy of plan participants.  \n42\nTable of Contents\nPostretirement Benefit Plan Actuarial Assumptions Sensitivity\n \nThe effects of a one percentage-point change in certain actuarial assumptions on 2024 pension and OPEB costs and obligations are as follows:\n \n \n2024 Benefit Cost Increase (Decrease)\nYear-end Benefit Obligation Increase (Decrease)\n(Millions of dollars)\nOne percentage-\npoint increase\nOne percentage-\npoint decrease\nOne percentage-\npoint increase\nOne percentage-\npoint decrease\nU.S. Pension Benefits: \n1\n \n \n \n \nAssumed discount rate\n$\n56\n \n$\n(70)\n$\n(1,011)\n$\n1,187\n \nExpected long-term rate of return on plan assets\n(123)\n123\n \n—\n \n—\n \nNon-U.S. Pension Benefits:\nAssumed discount rate\n8\n \n(11)\n(315)\n387\n \nExpected rate of compensation increase\n4\n \n(4)\n28\n \n(24)\nExpected long-term rate of return on plan assets\n(32)\n32\n \n—\n \n—\n \nOther Postretirement Benefits:\n \n \n \n \nAssumed discount rate\n5\n \n(6)\n(184)\n213\n \nExpected rate of compensation increase\n—\n \n—\n \n1\n \n(1)\nExpected long-term rate of return on plan assets\n(1)\n1\n \n—\n \n—\n \n1   \nEffective December 31, 2019, all U.S. pension benefits were frozen, and accordingly the expected rate of compensation increase assumption is no longer applicable.  \n \nActuarial Assumptions\n \nU.S. Pension Benefits\nNon-U.S. Pension Benefits\nOther Postretirement Benefits\n \n2024\n2023\n2022\n2024\n2023\n2022\n2024\n2023\n2022\nWeighted-average assumptions used to determine benefit obligation, end of year:\n \n \n \n \n \n \n \n \n \nDiscount rate\n5.6\n \n%\n5.0 \n%\n5.4 \n%\n4.1\n \n%\n3.9 \n%\n4.3 \n%\n5.6\n \n%\n5.1 \n%\n5.4 \n%\nRate of compensation increase \n1\n—\n \n%\n— \n%\n— \n%\n2.2\n \n%\n2.3 \n%\n2.3 \n%\n4.0\n \n%\n4.0 \n%\n4.0 \n%\nWeighted-average assumptions used to determine net periodic benefit cost:\n \n \n \nDiscount rate used to measure service cost \n1\n—\n \n%\n— \n%\n— \n%\n3.6\n \n%\n3.8 \n%\n1.7 \n%\n5.1\n \n%\n5.4 \n%\n2.8 \n%\nDiscount rate used to measure interest cost\n5.0\n \n%\n5.2 \n%\n2.3 \n%\n3.9\n \n%\n4.2 \n%\n1.7 \n%\n5.0\n \n%\n5.3 \n%\n2.2 \n%\nExpected rate of return on plan assets\n5.7\n \n%\n5.8 \n%\n4.0 \n%\n5.1\n \n%\n5.2 \n%\n3.1 \n%\n7.4\n \n%\n7.4 \n%\n6.9 \n%\nRate of compensation increase \n1\n—\n \n%\n— \n%\n— \n%\n2.3\n \n%\n2.3 \n%\n2.0 \n%\n4.0\n \n%\n4.0 \n%\n4.0 \n%\nHealth care cost trend rates at year-end:\n \n \n \n \n \n \n \nHealth care trend rate assumed for next year\n6.0\n \n%\n6.2 \n%\n6.5 \n%\nRate that the cost trend rate gradually declines to\n4.7\n \n%\n4.7 \n%\n4.7 \n%\nYear that the cost trend rate reaches ultimate rate\n2030\n2030\n2030\n1   \nEffective December 31, 2019, all U.S. pension benefits were frozen, and accordingly this assumption is no longer applicable.  \nSee Note 12 — “Postemployment benefit plans” of Part II, Item 8 “Financial Statement and Supplemental Data” for further information regarding the accounting for postretirement benefits.\n \n43\nTable of Contents\nPost-sale discount reserve\n — We provide discounts to dealers through merchandising programs.  We have numerous programs that are designed to promote the sale of our products.  The most common dealer programs provide a discount when the dealer sells a product to a targeted end user.  The amount of accrued post-sale discounts was $2.2 billion and $2.1 billion at December 31, 2024 and 2023, respectively.  The reserve represents discounts that we expect to pay on previously sold units and is reviewed at least quarterly.  We adjust the reserve if discounts paid differ from those estimated.  Historically, those adjustments have not been material.\n \nAllowance for credit losses — \nThe allowance for credit losses is management’s estimate of expected losses over the life of our finance receivable portfolio calculated using loss forecast models that take into consideration historical credit loss experience, current economic conditions and forecasts and scenarios that capture country and industry-specific economic factors. In addition, we consider qualitative factors not able to be fully captured in our loss forecast models, including borrower-specific and company-specific factors. These qualitative factors are subjective and require a degree of management judgment.\nWe measure the allowance for credit losses on a collective (pool) basis when similar risk characteristics exist and on an individual basis when we determine that similar risk characteristics do not exist. We identify finance receivables for individual evaluation based on past due status and information available about the customer, such as financial statements, news reports and published credit ratings, as well as general information regarding industry trends and the economic environment in which our customers operate.  The allowance for credit losses attributable to finance receivables that are individually evaluated is based on the present value of expected future cash flows discounted at the receivables' effective interest rate, the fair value of the collateral for collateral-dependent receivables or the observable market price of the receivable.  In determining collateral value, we estimate the current fair market value of the collateral less selling costs.  We also consider credit enhancements such as additional collateral and contractual third-party guarantees. \nWhile management believes it has exercised prudent judgment and applied reasonable assumptions, there can be no assurance that in the future, changes in economic conditions or other factors would not cause changes in the financial health of our customers. If the financial health of our customers deteriorates, the timing and level of payments received could be impacted and therefore, could result in a change to our estimated losses.\nIncome taxes\n — We are subject to the income tax laws of the many jurisdictions in which we operate.  These tax laws are complex, and the manner in which they apply to our facts is sometimes open to interpretation.  In establishing the provision for income taxes, we must make judgments about the application of these inherently complex tax laws.  Our income tax positions and analysis are based on currently enacted tax law.  Future changes in tax law or related interpretations could significantly impact the provision for income taxes, the amount of taxes payable, and the deferred tax asset and liability balances.  Changes in tax law are reflected in the period of enactment with related interpretations considered in the period received.  \nDespite our belief that our tax return positions are consistent with applicable tax laws, we believe that taxing authorities could challenge certain positions. Settlement of any challenge can result in no change, a complete disallowance, or some partial adjustment reached through negotiations or litigation. We record tax benefits for uncertain tax positions based upon management’s evaluation of the information available at the reporting date.  To be recognized in the financial statements, a tax benefit must be at least more likely than not of being sustained based on technical merits.  The benefit for positions meeting the recognition threshold is measured as the largest benefit more likely than not of being realized upon ultimate settlement with a taxing authority that has full knowledge of all relevant information.  Significant judgment is required in making these determinations and adjustments to unrecognized tax benefits may be necessary to reflect actual taxes payable upon settlement.  Adjustments related to positions impacting the effective tax rate affect the provision for income taxes.  Adjustments related to positions impacting the timing of deductions impact deferred tax assets and liabilities.  \nDeferred tax assets generally represent tax benefits for tax deductions or credits available in future tax returns.  Certain estimates and assumptions are required to determine whether it is more likely than not that all or some portion of the benefit of a deferred tax asset will not be realized.  In making this assessment, management analyzes the trend of U.S. GAAP earnings and estimates the impact of future taxable income, reversing temporary differences and available prudent and feasible tax planning strategies.  We give less weight in this analysis to mark-to-market adjustments to remeasure our pension and OPEB plans as we do not consider these adjustments indicative of ongoing earnings trends. Should a change in facts or circumstances lead to a change in judgment about the ultimate realizability of a deferred tax asset, we record or adjust the related valuation allowance in the period that the change in facts and circumstances occurs, along with a corresponding increase or decrease in the provision for income taxes. \nAdditional information related to income taxes is included in Note 6 — “Income taxes” of Part II, Item 8 “Financial statements and Supplementary Data.” \n44\nTable of Contents\nOTHER MATTERS\n \nInformation related to legal proceedings appears in Note 22 — \"Environmental and legal matters\" of Part II, Item 8 “Financial Statements and Supplementary Data.” \nRETIREMENT BENEFITS\nWe recognize mark-to-market gains and losses immediately through earnings upon the remeasurement of our pension and OPEB plans.  Mark-to-market gains and losses represent the effects of actual results differing from our assumptions and the effects of changing assumptions.  Changes in discount rates and differences between the actual return on plan assets and the expected return on plan assets generally have the largest impact on mark-to-market gains and losses. \nThe table below summarizes the amounts of net periodic benefit cost recognized for 2024, 2023 and 2022, respectively, and includes expected cost for 2025. \n(Millions of dollars)\n2025 Expected\n2024\n2023\n2022\nU.S. Pension Benefits\n$\n(108)\n$\n(74)\n$\n(33)\n$\n(268)\nNon-U.S. Pension Benefits\n(2)\n(4)\n2 \n(10)\nOther Postretirement Benefits\n173\n \n177\n \n188 \n161 \nMark-to-market loss (gain)\n—\n \n1\n(154)\n(97)\n(606)\nTotal net periodic benefit cost (benefit)\n$\n63\n \n$\n(55)\n$\n60 \n$\n(723)\n1\n Expected net periodic benefit cost (benefit) does not include an estimate for mark-to-market gains or losses.\n•\nExpected decrease in expense in 2025 compared to 2024\n — Excluding the impact of mark-to-market gains and losses, our net periodic benefit cost is expected to decrease $36 million in 2025.  This expected decrease is primarily due to lower interest cost in 2025 as a result of higher discount rates at the end of 2024 creating a lower obligation base (U.S. pension plans year-end 2024 obligation was $12.2 billion compared to a year-end 2023 obligation of $13.1 billion) and a higher expected return on assets in 2025 (U.S. pension plans expected rate of return on plans assets is 6.3 percent for 2025 compared to 5.7 percent for 2024; however, this increase is muted due to a lower asset base at year-end 2024 of $11.9 billion compared to $12.7 billion at year-end 2023).\n•\nDecrease in expense in 2024 compared to 2023 —\n Primarily due to higher mark-to-market gains in 2024 compared to 2023, lower interest cost in 2024 as a result of lower discount rates at year-end 2023 and a higher expected return on plan assets due to a higher asset base at year-end 2023 compared to year-end 2022.  \n•\nIncrease in expense in 2023 compared to 2022 —\n Primarily due to lower mark-to-market gains in 2023 compared to 2022 and higher interest cost in 2023 as a result of higher discount rates at year-end 2022.   \nThe primary factors that resulted in mark-to-market losses (gains) for 2024, 2023 and 2022 are described below.  We include the net mark-to-market losses (gains) in Other income (expense) in the Results of Operations.\n•\n2024 net mark-to-market gain of $154 million\n — Primarily due to higher discount rates at the end of 2024 compared to the end of 2023.  This was partially offset by a lower actual return on plan assets compared to the expected return on plan assets (U.S. pension plans had an actual rate of return of 0.7 percent compared to an expected rate of return of 5.7 percent).\n•\n2023 net mark-to-market gain of $97 million\n — Primarily due to higher actual return on plan assets compared to the expected return on plan assets (U.S. pension plans had an actual rate of return of 10.4 percent compared to an expected rate of return of 5.8 percent) and favorable claims experience related to our other postretirement benefit plans.  This was partially offset by lower discount rates at the end of 2023 compared to the end of 2022.\n•\n2022 net mark-to-market gain of $606 million\n — Primarily due to higher discount rates at the end of 2022 compared to the end of 2021.  This was partially offset by a lower actual return on plan assets compared to the expected return on plan assets (U.S. pension plans had an actual loss rate of (22.6) percent compared to an expected rate of return of 4.0 percent).\n45\nTable of Contents\nSENSITIVITY\n \nForeign Exchange Rate Sensitivity\n \nME&T operations use foreign currency forward and option contracts to manage unmatched foreign currency cash inflow and outflow.  Our objective is to minimize the risk of exchange rate movements that would reduce the U.S. dollar value of our foreign currency cash flow.  Our policy allows for managing anticipated foreign currency cash flow for up to approximately five years.  Based on the anticipated and firmly committed cash inflow and outflow for our ME&T operations for the next 12 months and the foreign currency derivative instruments in place at year-end, a hypothetical 10 percent weakening of the U.S. dollar relative to all other currencies would adversely affect our expected 2025 cash flow for our ME&T operations by approximately $77 million.  Last year, similar assumptions and calculations yielded a potential $200 million adverse impact on 2024 cash flow.  We determine our net exposures by calculating the difference in cash inflow and outflow by currency and adding or subtracting outstanding foreign currency derivative instruments.  We multiply these net amounts by 10 percent to determine the sensitivity.\n \nIn managing foreign currency risk for our Financial Products operations, our objective is to minimize earnings volatility resulting from conversion and the remeasurement of net foreign currency balance sheet positions and future transactions denominated in foreign currencies. Since our policy allows the use of foreign currency forward, option and cross currency contracts to offset the risk of currency mismatch between our assets and liabilities and exchange rate risk associated with future transactions denominated in foreign currencies, a 10 percent change in the value of the U.S. dollar relative to all other currencies would not have a material effect on our consolidated financial position, results of operations or cash flow.  Neither our policy nor the effect of a 10 percent change in the value of the U.S. dollar has changed from that reported at the end of last year.\nThe effect of the hypothetical change in exchange rates ignores the effect this movement may have on other variables, including competitive risk.  If it were possible to quantify this competitive impact, the results would probably be different from the sensitivity effects shown above.  In addition, it is unlikely that all currencies would uniformly strengthen or weaken relative to the U.S. dollar.  In reality, some currencies may weaken while others may strengthen.  Our primary exposure (excluding competitive risk) is to exchange rate movements in the Australian dollar, Chinese yuan, Euro, Indian rupee and Mexican peso.\n \nInterest Rate Sensitivity\n \nFor our ME&T operations, we have the option to use interest rate contracts to lower the cost of borrowed funds by attaching fixed-to-floating interest rate contracts to fixed-rate debt, and by entering into forward rate agreements on future debt issuances.  A hypothetical 100 basis point adverse move in interest rates along the entire interest rate yield curve would have a minimal impact to the 2025 pre-tax earnings of ME&T.  Last year, similar assumptions and calculations yielded a minimal impact to 2024 pre-tax earnings. \n \nFor our Financial Products operations, we use interest rate derivative instruments primarily to meet our match-funding objectives and strategies.  We have a match-funding policy that addresses the interest rate risk by aligning the interest rate profile (fixed or floating rate and duration) of our debt portfolio with the interest rate profile of our finance receivable portfolio within a predetermined range on an ongoing basis.  In connection with that policy, we use interest rate derivative instruments to modify the debt structure to match assets within the finance receivable portfolio.  Match funding reduces the volatility of margins between interest-bearing assets and interest-bearing liabilities, regardless of which direction interest rates move.\n \nIn order to properly manage sensitivity to changes in interest rates, Financial Products measures the potential impact of different interest rate assumptions on pre-tax earnings.  All on-balance sheet positions, including derivative financial instruments, are included in the analysis.  The primary assumptions included in the analysis are that there are no new fixed rate assets or liabilities, the proportion of fixed rate debt to fixed rate assets remains unchanged and the level of floating rate assets and debt remain constant.  An analysis of the December 31, 2024 balance sheet, using these assumptions, estimates the impact of a 100 basis point immediate and sustained adverse change in interest rates to have a minimal impact on 2025 pre-tax earnings.  Last year, similar assumptions and calculations yielded a minimal impact to 2024 pre-tax earnings.\n \nThis analysis does not necessarily represent our current outlook of future market interest rate movement, nor does it consider any actions management could undertake in response to changes in interest rates.  Accordingly, no assurance can be given that actual results would be consistent with the results of our estimate.\n46\nTable of Contents\nNON-GAAP FINANCIAL MEASURES\nWe provide the following definitions for the non-GAAP financial measures used in this report.  These non-GAAP financial measures have no standardized meaning prescribed by U.S. GAAP and therefore are unlikely to be comparable to the calculation of similar measures for other companies.  Management does not intend these items to be considered in isolation or as a substitute for the related GAAP measures.\nWe believe it is important to separately quantify the profit impact of six significant items in order for our results to be meaningful to our readers. These items consist of (i) restructuring income/costs related to the divestitures of certain non-U.S. entities in 2024, (ii) other restructuring income/costs, (iii) pension and OPEB\n \nmark-to-market gains/losses resulting from plan remeasurements, (iv) a discrete tax benefit for a tax law change related to currency translation in 2024, (v) restructuring costs related to the divestiture of the company's Longwall business in 2023 and (vi) certain deferred tax valuation allowance adjustments in 2023. We do not consider these items indicative of earnings from ongoing business activities and believe the non-GAAP measures will provide investors with useful perspective on underlying business results and trends and aids with assessing our period-over-period results. \nReconciliations of adjusted results to the most directly comparable GAAP measures are as follows:\n(Dollars in millions except per share data)\nOperating Profit\nOperating Profit Margin\nProfit Before Taxes\nProvision (Benefit) for Income Taxes\nProfit\nProfit per Share\nTwelve Months Ended December 31, 2024 - U.S. GAAP\n$\n13,072\n \n20.2\n \n%\n$\n13,373\n \n$\n2,629\n \n$\n10,792\n \n$\n22.05\n \nRestructuring (income) costs - divestitures of certain non-U.S. entities\n164 \n0.2 \n%\n164 \n54 \n110 \n0.22 \nOther restructuring (income) costs\n195 \n0.3 \n%\n195 \n46 \n149 \n0.32 \nPension/OPEB mark-to-market (gains) losses\n— \n— \n%\n(154)\n(43)\n(111)\n(0.23)\nTax law change related to currency translation\n— \n— \n%\n— \n224 \n(224)\n(0.46)\nTwelve Months Ended December 31, 2024 - Adjusted\n$\n13,431 \n20.7 \n%\n$\n13,578 \n$\n2,910 \n$\n10,716 \n$\n21.90 \nTwelve Months Ended December 31, 2023 - U.S. GAAP\n$\n12,966\n \n19.3\n \n%\n$\n13,050\n \n$\n2,781\n \n$\n10,335\n \n$\n20.12\n \nRestructuring costs - Longwall divestiture\n586 \n0.9 \n%\n586 \n— \n586 \n1.14 \nOther restructuring (income) costs\n194 \n0.3 \n%\n194 \n48 \n146 \n0.30 \nPension/OPEB mark-to-market (gains) losses\n— \n— \n%\n(97)\n(26)\n(71)\n(0.14)\nDeferred tax valuation allowance adjustments\n— \n— \n%\n— \n106 \n(106)\n(0.21)\nTwelve Months Ended December 31, 2023 - Adjusted\n$\n13,746 \n20.5 \n%\n$\n13,733 \n$\n2,909 \n$\n10,890 \n$\n21.21 \nWe believe it is important to separately disclose our annual effective tax rate, excluding discrete items for our results to be meaningful to our readers. The annual effective tax rate is discussed using non-GAAP financial measures that exclude the effects of amounts associated with discrete items recorded fully in the quarter they occur. These items consist of (i) restructuring income/costs related to the divestitures of certain non-U.S. entities in 2024, (ii) pension and OPEB mark-to-market gains/losses resulting from plan remeasurements, (iii) a discrete tax benefit for a tax law change related to currency translation in 2024, (iv) the impact of changes in estimates related to prior years in 2024, (v) a settlement of stock-based compensation awards with associated tax deductions in excess of cumulative U.S. GAAP compensation expense, (vi) restructuring costs related to divestiture of the company's Longwall business in 2023 and (vii) deferred tax valuation allowance adjustments in 2023. We believe the non-GAAP measures will provide investors with useful perspective on underlying business results and trends and aids with assessing the company's period-over-period results.\nA reconciliation of our effective tax rate to annual effective tax rate, excluding discrete items is below:\n47\nTable of Contents\n(Millions of dollars)\nProfit Before Taxes\nProvision (Benefit) for Income Taxes\nEffective Tax Rate\nTwelve Months Ended December 31, 2024 - U.S. GAAP\n$\n13,373\n \n$\n2,629\n \n19.7\n \n%\nRestructuring (income) costs - divestitures of certain non-U.S. entities\n164 \n54 \nPension/OPEB mark-to-market (gains) losses\n(154)\n(43)\nTax law change related to currency translation\n— \n224 \nChanges in estimates related to prior years\n— \n47 \nExcess stock-based compensation\n— \n57 \nAnnual effective tax rate, excluding discrete items\n$\n13,383 \n$\n2,968 \n22.2 \n%\nChanges in estimates related to prior years\n— \n(47)\nExcess stock-based compensation\n— \n(57)\nOther restructuring (income) costs\n195 \n46 \nTwelve Months Ended December 31, 2024 - Adjusted\n$\n13,578 \n$\n2,910 \nTwelve Months Ended December 31, 2023 - U.S. GAAP\n$\n13,050\n \n$\n2,781\n \n21.3\n \n%\nRestructuring costs - Longwall divestiture\n586 \n— \nPension/OPEB mark-to-market (gains) losses\n(97)\n(26)\nDeferred tax valuation allowance adjustments\n— \n88 \nExcess stock-based compensation\n— \n57 \nAnnual effective tax rate, excluding discrete items\n$\n13,539 \n$\n2,900 \n21.4 \n%\nDeferred tax valuation allowance adjustments\n— \n18 \nExcess stock-based compensation\n— \n(57)\nOther restructuring (income) costs\n194 \n48 \nTwelve Months Ended December 31, 2023 - Adjusted\n$\n13,733 \n$\n2,909 \nIn addition, we provide a calculation of ME&T free cash flow as we believe it is an important measure for investors to determine the cash generation available for financing activities including debt repayments, dividends and share repurchases. \nReconciliations of ME&T free cash flow to the most directly comparable GAAP measure, net cash provided by operating activities are as follows:\nMillions of dollars\nTwelve Months Ended December 31,\n2024\n2023\nME&T net cash provided by operating activities \n1\n$\n11,437\n \n$\n11,688 \nME&T capital expenditures\n(1,988)\n(1,663)\nME&T free cash flow\n$\n9,449\n \n$\n10,025 \n1 \nSee reconciliation of ME&T net cash provided by operating activities to consolidated net cash provided by operating activities on page 52. \n48\nTable of Contents\nSupplemental Consolidating Data\n \nWe are providing supplemental consolidating data for the purpose of additional analysis. We have grouped the data as follows:\n \nConsolidated – \nCaterpillar Inc. and its subsidiaries.\n \nMachinery, Energy & Transportation – \nWe define ME&T as it is presented in the supplemental data as Caterpillar Inc. and its subsidiaries, excluding Financial Products. ME&T's information relates to the design, manufacturing and marketing of our products. \n \nFinancial Products –\n We define Financial Products as it is presented in the supplemental data as our finance and insurance subsidiaries, primarily Caterpillar Financial Services Corporation (Cat Financial) and Cat Insurance Holdings Inc. (Insurance Services). Financial Products’ information relates to the financing to customers and dealers for the purchase and lease of Caterpillar and other equipment. \n \nConsolidating Adjustments – \nEliminations of transactions between ME&T and Financial Products.\nThe nature of the ME&T and Financial Products businesses is different, especially with regard to the financial position and cash flow items.  Caterpillar management utilizes this presentation internally to highlight these differences. We believe this presentation will assist readers in understanding our business. \nPages 50 to 52 reconcile ME&T and Financial Products to Caterpillar Inc. consolidated financial information. \n49\nTable of Contents\nSupplemental Data for Results of Operations\nFor The Years Ended December 31,\n \n \nSupplemental consolidating data\n \n \nConsolidated\nMachinery,\nEnergy & Transportation \nFinancial\nProducts\nConsolidating\nAdjustments\n \n(Millions of dollars)\n2024\n2023\n2022\n2024\n2023\n2022\n2024\n2023\n2022\n2024\n \n2023\n \n2022\n \nSales and revenues:\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nSales of Machinery, Energy & Transportation\n$\n61,363\n \n$\n63,869 \n$\n56,574 \n$\n61,363\n \n$\n63,869 \n$\n56,574 \n$\n—\n \n$\n— \n$\n— \n$\n—\n \n \n$\n— \n$\n— \n \nRevenues of Financial Products\n3,446\n \n3,191 \n2,853 \n—\n \n— \n— \n4,212\n \n3,927 \n3,376 \n(766)\n1\n(736)\n1\n(523)\n1\nTotal sales and revenues\n64,809\n \n67,060 \n59,427 \n61,363\n \n63,869 \n56,574 \n4,212\n \n3,927 \n3,376 \n(766)\n(736)\n(523)\nOperating costs:\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nCost of goods sold\n40,199\n \n42,767 \n41,350 \n40,206\n \n42,776 \n41,356 \n—\n \n— \n— \n(7)\n2\n(9)\n2\n(6)\n2\nSelling, general and administrative expenses\n6,667\n \n6,371 \n5,651 \n5,881\n \n5,696 \n4,999 \n786\n \n704 \n672 \n—\n \n(29)\n2\n(20)\n2\nResearch and development expenses\n2,107\n \n2,108 \n1,814 \n2,107\n \n2,108 \n1,814 \n—\n \n— \n— \n—\n \n \n— \n— \n \nInterest expense of Financial Products\n1,286\n \n1,030 \n565 \n—\n \n— \n— \n1,286\n \n1,032 \n565 \n—\n \n(2)\n2\n— \nGoodwill impairment charge\n—\n \n— \n925 \n—\n \n— \n925 \n—\n \n— \n— \n—\n \n— \n— \nOther operating (income) expenses\n1,478\n \n1,818 \n1,218 \n71\n \n630 \n47 \n1,535\n \n1,268 \n1,249 \n(128)\n2\n(80)\n2\n(78)\n2\nTotal operating costs\n51,737\n \n54,094 \n51,523 \n48,265\n \n51,210 \n49,141 \n3,607\n \n3,004 \n2,486 \n(135)\n(120)\n(104)\nOperating profit\n13,072\n \n12,966 \n7,904 \n13,098\n \n12,659 \n7,433 \n605\n \n923 \n890 \n(631)\n(616)\n(419)\nInterest expense excluding Financial Products\n512\n \n511 \n443 \n518\n \n511 \n444 \n—\n \n— \n— \n(6)\n3\n— \n(1)\n3\nOther income (expense)\n813\n \n595 \n1,291 \n728\n \n340 \n1,374 \n85\n \n(16)\n(26)\n—\n \n271 \n4\n(57)\n4\nConsolidated profit before taxes\n13,373\n \n13,050 \n8,752 \n13,308\n \n12,488 \n8,363 \n690\n \n907 \n864 \n(625)\n \n(345)\n \n(475)\n \nProvision (benefit) for income taxes\n2,629\n \n2,781 \n2,067 \n2,663\n \n2,560 \n1,858 \n(34)\n221 \n209 \n—\n \n \n— \n \n— \n \nProfit of consolidated companies\n10,744\n \n10,269 \n6,685 \n10,645\n \n9,928 \n6,505 \n724\n \n686 \n655 \n(625)\n \n(345)\n \n(475)\n \nEquity in profit (loss) of unconsolidated affiliated companies\n44\n \n63 \n19 \n44\n \n67 \n26 \n—\n \n— \n— \n—\n \n(4)\n5\n(7)\n5\nProfit of consolidated and affiliated companies\n10,788\n \n10,332 \n6,704 \n10,689\n \n9,995 \n6,531 \n724\n \n686 \n655 \n(625)\n(349)\n(482)\nLess: Profit (loss) attributable to noncontrolling interests\n(4)\n(3)\n(1)\n(5)\n(4)\n(1)\n1\n \n5 \n7 \n—\n \n(4)\n6\n(7)\n6\nProfit\n \n7\n \n$\n10,792\n \n$\n10,335 \n$\n6,705 \n$\n10,694\n \n$\n9,999 \n$\n6,532 \n$\n723\n \n$\n681 \n$\n648 \n$\n(625)\n$\n(345)\n$\n(475)\n1\nElimination of Financial Products' revenues earned from ME&T.\n2\nElimination of net expenses recorded between ME&T and Financial Products.\n3\nElimination of interest expense recorded between Financial Products and ME&T.\n4\nElimination of discount recorded by ME&T on receivables sold to Financial Products and of interest earned between ME&T and Financial Products as well as dividends paid by Financial Products to ME&T.\n5\nElimination of equity profit (loss) earned from Financial Products’ subsidiaries partially owned by ME&T subsidiaries.\n6\nElimination of noncontrolling interest profit (loss) recorded by Financial Products for subsidiaries partially owned by ME&T subsidiaries.\n7\nProfit attributable to common shareholders.\n50\nTable of Contents\nSupplemental Data for Financial Position\nAt December 31,\nSupplemental consolidating data\n \nConsolidated\nMachinery,\nEnergy & Transportation \nFinancial\nProducts\nConsolidating\nAdjustments\n \n(Millions of dollars)\n2024\n2023\n2024\n2023\n2024\n2023\n2024\n \n2023\n \nAssets\n \n \n \n \n \n \n \n \n \n \nCurrent assets:\n \n \n \n \n \n \n \n \n \n \nCash and cash equivalents\n$\n6,889\n \n$\n6,978 \n$\n6,165\n \n$\n6,106 \n$\n724\n \n$\n872 \n$\n—\n \n \n$\n— \n \nReceivables - trade and other\n9,282\n \n9,310 \n3,463\n \n3,971 \n688\n \n570 \n5,131\n \n1,2\n4,769 \n1,2\nReceivables - finance\n9,565\n \n9,510 \n—\n \n— \n14,957\n \n14,499 \n(5,392)\n2\n(4,989)\n2\nPrepaid expenses and other current assets\n3,119\n \n4,586 \n2,872\n \n4,327 \n401\n \n341 \n(154)\n3\n(82)\n3\nInventories\n16,827\n \n16,565 \n16,827\n \n16,565 \n—\n \n— \n—\n \n \n— \n \nTotal current assets\n45,682\n \n46,949 \n29,327\n \n30,969 \n16,770\n \n16,282 \n(415)\n(302)\nProperty, plant and equipment - net\n13,361\n \n12,680 \n9,531\n \n8,694 \n3,830\n \n3,986 \n—\n \n \n— \n \nLong-term receivables - trade and other\n1,225\n \n1,238 \n500\n \n565 \n86\n \n85 \n639\n \n1,2\n588 \n1,2\nLong-term receivables - finance\n13,242\n \n12,664 \n—\n \n— \n14,048\n \n13,299 \n(806)\n2\n(635)\n2\nNoncurrent deferred and refundable income taxes\n3,312\n \n2,816 \n3,594\n \n3,360 \n118\n \n148 \n(400)\n4\n(692)\n4\nIntangible assets\n399\n \n564 \n399\n \n564 \n—\n \n— \n—\n \n \n— \n \nGoodwill\n5,241\n \n5,308 \n5,241\n \n5,308 \n—\n \n— \n—\n \n \n— \n \nOther assets\n5,302\n \n5,257 \n4,050\n \n4,218 \n2,277\n \n2,082 \n(1,025)\n5\n(1,043)\n5\nTotal assets\n$\n87,764\n \n$\n87,476 \n$\n52,642\n \n$\n53,678 \n$\n37,129\n \n$\n35,882 \n$\n(2,007)\n$\n(2,084)\nLiabilities\n \n \n \n \n \n \n \n \n \n \nCurrent liabilities:\n \n \n \n \n \n \n \n \n \n \nShort-term borrowings\n$\n4,393\n \n$\n4,643 \n$\n—\n \n$\n— \n$\n4,393\n \n$\n4,643 \n$\n—\n \n$\n— \nAccounts payable\n7,675\n \n7,906 \n7,619\n \n7,827 \n331\n \n314 \n(275)\n6,7\n(235)\n6,7\nAccrued expenses\n5,243\n \n4,958 \n4,589\n \n4,361 \n654\n \n597 \n—\n \n— \nAccrued wages, salaries and employee benefits\n2,391\n \n2,757 \n2,335\n \n2,696 \n56\n \n61 \n—\n \n— \n \nCustomer advances\n2,322\n \n1,929 \n2,305\n \n1,912 \n3\n \n2 \n14\n \n7\n15 \n7\nDividends payable\n674\n \n649 \n674\n \n649 \n—\n \n— \n—\n \n— \n \nOther current liabilities\n2,909\n \n3,123 \n2,388\n \n2,583 \n696\n \n647 \n(175)\n4,8\n(107)\n4,8\nLong-term debt due within one year\n6,665\n \n8,763 \n46\n \n1,044 \n6,619\n \n7,719 \n—\n \n— \n \nTotal current liabilities\n32,272\n \n34,728 \n19,956\n \n21,072 \n12,752\n \n13,983 \n(436)\n(327)\nLong-term debt due after one year\n27,351\n \n24,472 \n8,731\n \n8,626 \n18,787\n \n15,893 \n(167)\n9\n(47)\n9\nLiability for postemployment benefits\n3,757\n \n4,098 \n3,757\n \n4,098 \n—\n \n— \n—\n \n— \n \nOther liabilities\n4,890\n \n4,675 \n3,977\n \n3,806 \n1,344\n \n1,607 \n(431)\n4\n(738)\n4\nTotal liabilities\n68,270\n \n67,973 \n36,421\n \n37,602 \n32,883\n \n31,483 \n(1,034)\n(1,112)\nCommitments and contingencies\n \n \n \n \n \n \n \n \n \nShareholders’ equity\n \n \n \n \n \n \n \n \n \nCommon stock\n6,941\n \n6,403 \n6,941\n \n6,403 \n905\n \n905 \n(905)\n10\n(905)\n10\nTreasury stock\n(44,331)\n(36,339)\n(44,331)\n(36,339)\n—\n \n— \n—\n \n— \n \nProfit employed in the business\n59,352\n \n51,250 \n54,787\n \n46,783 \n4,555\n \n4,457 \n10\n \n10\n10 \n10\nAccumulated other comprehensive income (loss)\n(2,471)\n(1,820)\n(1,182)\n(783)\n(1,289)\n(1,037)\n—\n \n— \nNoncontrolling interests\n3\n \n9 \n6\n \n12 \n75\n \n74 \n(78)\n10\n(77)\n10\nTotal shareholders’ equity\n19,494\n \n19,503 \n16,221\n \n16,076 \n4,246\n \n4,399 \n(973)\n(972)\nTotal liabilities and shareholders’ equity\n$\n87,764\n \n$\n87,476 \n$\n52,642\n \n$\n53,678 \n$\n37,129\n \n$\n35,882 \n$\n(2,007)\n$\n(2,084)\n1\nElimination of receivables between ME&T and Financial Products.\n2\nReclassification of ME&T’s trade receivables purchased by Financial Products and Financial Products’ wholesale inventory receivables.\n3\nElimination of ME&T's insurance premiums that are prepaid to Financial Products.\n4\nReclassification reflecting required netting of deferred tax assets/liabilities by taxing jurisdiction.\n5\nElimination of other intercompany assets and liabilities between ME&T and Financial Products.\n6\nElimination of payables between ME&T and Financial Products.\n7\nReclassification of Financial Products’ payables to customer advances.\n8\nElimination of prepaid insurance in Financial Products’ other liabilities.\n9\nElimination of debt between ME&T and Financial Products.\n10\nEliminations associated with ME&T’s investments in Financial Products’ subsidiaries.\n51\nTable of Contents\nSupplemental Data for Statement of Cash Flow\nFor the Years Ended December 31,\n \nSupplemental consolidating data\n \n \nConsolidated\nMachinery,\nEnergy & Transportation\nFinancial\nProducts\nConsolidating\nAdjustments\n \n(Millions of dollars)\n2024\n2023\n2024\n2023\n2024\n2023\n2024\n \n2023\n \nCash flow from operating activities:\n \n \n \n \n \n \n \n \n \n \nProfit of consolidated and affiliated companies\n$\n10,788\n \n$\n10,332 \n$\n10,689\n \n$\n9,995 \n$\n724\n \n$\n686 \n$\n(625)\n1,5\n$\n(349)\n1,5\nAdjustments to reconcile profit to net cash provided by operating activities:\n \n \n \n \nDepreciation and amortization\n2,153\n \n2,144 \n1,368\n \n1,361 \n785\n \n783 \n—\n \n \n— \n \nActuarial (gain) loss on pension and postretirement benefits\n(154)\n(97)\n(154)\n(97)\n—\n \n— \n—\n \n— \nProvision (benefit) for deferred income taxes\n(621)\n(592)\n(327)\n(576)\n(294)\n(16)\n—\n \n— \n(Gain) loss on divestiture\n164\n \n572 \n(46)\n572 \n210\n \n— \n—\n \n— \nOther\n564\n \n375 \n355\n \n444 \n(388)\n(577)\n597\n \n2\n508 \n2\nChanges in assets and liabilities, net of acquisitions and divestitures:\n \n \nReceivables - trade and other\n(160)\n(437)\n413\n \n(367)\n207\n \n61 \n(780)\n2,3\n(131)\n2,3\nInventories\n(414)\n(364)\n(400)\n(360)\n—\n \n— \n(14)\n2\n(4)\n2\nAccounts payable\n(282)\n(754)\n(200)\n(836)\n(41)\n41 \n(41)\n2\n41 \n2\nAccrued expenses\n191\n \n796 \n78\n \n690 \n113\n \n106 \n—\n \n— \nAccrued wages, salaries and employee benefits\n(363)\n486 \n(358)\n474 \n(5)\n12 \n—\n \n \n— \n \nCustomer advances\n370\n \n80 \n369\n \n78 \n1\n \n2 \n—\n \n— \nOther assets—net\n(97)\n(95)\n(188)\n94 \n48\n \n(110)\n43\n \n2\n(79)\n2\nOther liabilities—net\n(104)\n439 \n(162)\n216 \n85\n \n118 \n(27)\n2\n105 \n2\nNet cash provided by (used for) operating activities\n12,035\n \n12,885 \n11,437\n \n11,688 \n1,445\n \n1,106 \n(847)\n91 \nCash flow from investing activities:\n \n \n \n \n \n \nCapital expenditures—excluding equipment leased to others\n(1,988)\n(1,597)\n(1,952)\n(1,624)\n(41)\n(22)\n5\n \n2\n49 \n2\nExpenditures for equipment leased to others\n(1,227)\n(1,495)\n(36)\n(39)\n(1,211)\n(1,466)\n20\n \n2\n10 \n2\nProceeds from disposals of leased assets and property, plant and equipment\n722\n \n781 \n35\n \n55 \n698\n \n781 \n(11)\n2\n(55)\n2\nAdditions to finance receivables\n(15,409)\n(15,161)\n—\n \n— \n(16,845)\n(17,321)\n1,436\n \n3\n2,160 \n3\nCollections of finance receivables\n13,608\n \n14,034 \n—\n \n— \n14,707\n \n15,634 \n(1,099)\n3\n(1,600)\n3\nNet intercompany purchased receivables\n—\n \n— \n—\n \n— \n129\n \n1,080 \n(129)\n3\n(1,080)\n3\nProceeds from sale of finance receivables\n83\n \n63 \n—\n \n— \n83\n \n63 \n—\n \n— \nNet intercompany borrowings\n—\n \n— \n—\n \n— \n21\n \n10 \n(21)\n4\n(10)\n4\nInvestments and acquisitions (net of cash acquired)\n(34)\n(75)\n(34)\n(75)\n—\n \n— \n—\n \n— \nProceeds from sale of businesses and investments (net of cash sold)\n(61)\n(4)\n92\n \n(4)\n(153)\n— \n—\n \n— \nProceeds from maturities and sale of securities\n3,155\n \n1,891 \n2,795\n \n1,642 \n360\n \n249 \n—\n \n \n— \n \nInvestments in securities\n(1,495)\n(4,405)\n(909)\n(3,982)\n(586)\n(423)\n—\n \n \n— \n \nOther—net\n193\n \n97 \n142\n \n106 \n51\n \n(9)\n—\n \n— \nNet cash provided by (used for) investing activities\n(2,453)\n(5,871)\n133\n \n(3,921)\n(2,787)\n(1,424)\n201\n \n \n(526)\n \nCash flow from financing activities:\n \n \n \n \n \n \n \nDividends paid\n(2,646)\n(2,563)\n(2,646)\n(2,563)\n(625)\n(425)\n625\n \n5\n425 \n5\nCommon stock issued, including treasury shares reissued\n20\n \n12 \n20\n \n12 \n—\n \n— \n—\n \n— \nPayments to purchase common stock\n(7,697)\n(4,975)\n(7,697)\n(4,975)\n—\n \n— \n—\n \n— \nExcise tax paid on purchases of common stock\n(40)\n— \n(40)\n— \n—\n \n— \n—\n \n— \nNet intercompany borrowings\n—\n \n— \n(21)\n(10)\n—\n \n— \n21\n \n4\n10 \n4\nProceeds from debt issued (original maturities greater than three months)\n10,283\n \n8,257 \n—\n \n— \n10,283\n \n8,257 \n—\n \n \n— \n \nPayments on debt (original maturities greater than three months)\n(9,316)\n(6,318)\n(1,032)\n(106)\n(8,284)\n(6,212)\n—\n \n \n— \n \nShort-term borrowings - net (original maturities three months or less)\n(168)\n(1,345)\n—\n \n(3)\n(168)\n(1,342)\n—\n \n \n— \n \nOther—net\n(1)\n— \n(1)\n— \n—\n \n— \n—\n \n \n— \nNet cash provided by (used for) financing activities\n(9,565)\n(6,932)\n(11,417)\n(7,645)\n1,206\n \n278 \n646\n \n435 \nEffect of exchange rate changes on cash\n(106)\n(110)\n(94)\n(60)\n(12)\n(50)\n—\n \n \n— \n \nIncrease (decrease) in cash, cash equivalents and restricted cash\n(89)\n(28)\n59\n \n62 \n(148)\n(90)\n—\n \n \n— \n \nCash, cash equivalents and restricted cash at beginning of period\n6,985\n \n7,013 \n6,111\n \n6,049\n \n874\n \n964 \n—\n \n \n— \n \nCash, cash equivalents and restricted cash at end of period\n$\n6,896\n \n$\n6,985 \n$\n6,170\n \n$\n6,111 \n$\n726\n \n$\n874 \n$\n—\n \n \n$\n— \n \n1\nElimination of equity profit earned from Financial Products’ subsidiaries partially owned by ME&T subsidiaries.\n2\nElimination of non-cash adjustments and changes in assets and liabilities related to consolidated reporting.\n3\nReclassification of Financial Products’ cash flow activity from investing to operating for receivables that arose from the sale of inventory.\n4\nElimination of net proceeds and payments to/from ME&T and Financial Products.\n5\nElimination of dividend activity between Financial Products and ME&T.\n52\nTable of Contents",
  "item2": null
}