{
  "item1": "NPE), wholesale specialty division Chubb Bermuda (5 percent segment’s 2024 NPE), high excess retail division Products Distribution Commercial Insurance operations provide broad range P&C, financial lines, A&H products targeted U.S Canadian-based middle market customers variety industries, while Small Commercial operations provide broad range P&C, workers' compensation, small commercial management professional liability small businesses based U.S. Commercial Insurance products services offered include traditional P&C lines business, including Package, which combines property general liability, workers' compensation, automobile, umbrella; financial lines business, including professional liability, management liability cyber risk coverage; other lines including environmental, A&H, international coverages. Commercial Insurance distributes its insurance products through North American network independent retail agents regional, multinational digital brokers. Generally, customers purchase insurance through single retail agent broker, do not employ risk management department, do not retain significant risk through self-insured retentions.",
  "item7": "Net valuation allowance uncollectible reinsurance. estimate liabilities includes provisions claims been reported but unpaid balance sheet date (case reserves) obligations claims been incurred but not reported (IBNR) balance sheet date. IBNR may also include provisions account possibility reported claims may settle amounts differ established case reserves. Loss reserves also include estimate expenses associated processing settling unpaid claims (loss expenses).",
  "item2": "Refer Note 8 Consolidated Financial Statements detail prior period development. Net premiums written increased $163 million, 2.9 percent, three months ended September 30, 2025, includes 3.4 percentage point unfavorable impact two non-recurring items benefited prior year quarter. Middle market small commercial grew 3.6 percent, including 3.3 percentage point unfavorable impact lower workers’ compensation annual payroll-related audit premium adjustments, which made third quarter every year. Major accounts specialty up 2.5 percent, includes 3.4 percent unfavorable impact one-off structured transaction which occurred 2024, E&S up 6.6 percent."
}