{
  "source_file": "cboe-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nThe following discussion should be read in conjunction with the accompanying unaudited condensed consolidated financial statements and the notes thereto, included in Item 1 in this Quarterly Report on Form 10-Q, and the audited consolidated financial statements in the Company’s Annual Report on Form 10-K for the year ended December 31, 2024, and as contained in that report, the information under the heading “Management’s Discussion and Analysis of Financial Condition and Results of Operations.” This discussion contains forward-looking information. Please see “Forward-Looking Statements” for a discussion of the uncertainties, risks and assumptions associated with these statements.\nOverview\nCboe Global Markets, Inc., the world’s leading derivatives and securities exchange network, delivers cutting-edge trading, clearing and investment solutions to people around the world. Cboe provides trading solutions and products in multiple asset classes, including equities, derivatives, and FX, across North America, Europe, and Asia Pacific. Above all, the Company is committed to building a trusted, inclusive global marketplace that enables people to pursue a sustainable financial future.\nCboe’s subsidiaries include the largest options exchange and the third largest equities exchange operator in the U.S. In addition, the Company operates Cboe Europe, one of the largest equities exchanges by value traded in Europe, and owns Cboe Clear Europe, a leading pan-European equities and derivatives clearinghouse, BIDS Holdings, which owns a leading block-trading ATS by volume in the U.S., and provides block-trading services with Cboe market operators in Europe and Canada, Cboe Australia, an operator of trading venues in Australia, Cboe Japan, formerly an operator of trading venues in Japan, Cboe Clear U.S., an operator of a regulated clearinghouse, and Cboe Canada, a recognized Canadian securities exchange. Cboe subsidiaries also serve collectively as a leading market globally for exchange-traded products (“ETPs”) listings and trading. \nOn July 23, 2025, the Company announced its decision to wind down Cboe's Japanese equities business, including the operations of its Cboe Japan proprietary trading system and Cboe BIDS Japan block trading platform. The Company suspended operations for these businesses on August 29, 2025 and expects to formally close the businesses subject to consultation with regulators.\nThe Company is headquartered in Chicago with offices in Amsterdam, Belfast, Hong Kong, Kansas City, London, Manila, New York, San Francisco, Sarasota Springs, Singapore, Sydney, Tokyo, and Toronto.\nExecutive Transitions\nOn May 1, 2025, the Company announced that its Board of Directors appointed longtime global financial markets executive Craig S. Donohue as the Company's new Chief Executive Officer and a member of the Board, effective May 7, 2025. Mr. Donohue succeeded Fredric J. Tomczyk who, as previously announced, has stepped down as Chief Executive Officer and will remain on the Board.\nOn May 28, 2025, the Company announced that Dave Howson, Executive Vice President and Global President, resigned from the Company, with his employment terminating at the end of the day on August 1, 2025. In connection with Mr. Howson's resignation, the Board appointed Mr. Donohue, Chief Executive Officer of the Company, as President of the Company, effective following August 1, 2025.\nOn September 30, 2025, the Company announced the appointment of two industry veterans to lead its Derivatives and Data Vantage businesses. Effective October 1, 2025, Rob Hocking rejoined as Executive Vice President, Global Head of Derivatives, and Brian McElligott joined as Senior Vice President, Global Head of Cboe Data Vantage. Mr. Hocking succeeded Cathy Clay who departed the company for a new opportunity.\nBusiness Segments\nThe Company previously operated six reportable business segments as of December 31, 2024. As of January 1, 2025, the Company operates five reportable business segments: Options, North American Equities, Europe and Asia Pacific, Futures, and Global FX, which is reflective of how the Company's CODM reviews and operates the business, as discussed in Note 1 (“Organization and Basis of Presentation”). The Company's reportable business segments represent strategic business units that offer different products and services across different geographic areas. The Company's CODM is the chief executive officer. The CODM function is supported by business segment management and leadership personnel who lead the day-to-day operations of each reportable business segment.\nSegment performance is primarily evaluated on operating income (loss). The CODM uses segment operating income (loss) to allocate resources, including but not limited to employees, financial, and capital resources. The Company's CODM \n48\nTable of Contents\ndoes not assess assets or income and expenses below operating income (loss) at the segment-level as key performance metrics. The Company has aggregated all of its corporate costs, as well as other business ventures, within the Corporate Items and Eliminations totals based on the decision that those activities should not be used to evaluate the operating performance of the segments; however, operating expenses that relate to activities of a specific segment have been allocated to that segment. The Company's CODM primarily reviews operating expenses at the consolidated level for purposes of evaluating actual results versus budgets.\nOn April 25, 2024, the Company announced plans to refocus the digital asset business to leverage its core strengths in derivatives, technology, and product innovation. Effective May 31, 2024, the Cboe Digital spot market closed for all participant and trading purposes. The Company has brought Cboe Clear U.S. under unified leadership with the Global Head of Clearing and continues to facilitate the clearing of cash-settled margin Bitcoin and Ether futures contracts. The Company retained and presented Digital as a reportable segment through December 31, 2024. As of January 1, 2025, the Company prospectively reorganized the Digital operating segment results into the Futures reporting segment as the Company expected to transition its cash-settled margin Bitcoin and Ether futures contracts, formerly available for trading on the Cboe Digital Exchange to CFE, which was completed on June 9, 2025. Cboe Digital Exchange no longer lists or trades any products. Comparative-period results have not been recast as the historic results of the Digital segment were not material, nor do they materially impact the financial results, trends, or forecasts of the Futures segment. As a result, for the three and nine months ended September 30, 2025, operating results included within the Digital operating segment are presented within the Futures reporting segment. See Note 1 (“Organization and Basis of Presentation”) and Note 14 (“Segment Reporting”) for more information. \nOptions.\n The Options segment includes options on market indices (“index options”), as well as on the stocks of individual corporations (“equity options”) and on ETPs such as exchange-traded funds (“ETFs”) and exchange-traded notes (“ETNs”), which are “multi-listed” options and listed on a non-exclusive basis. These options are eligible to trade, as applicable, on Cboe Options, C2, BZX, EDGX, and/or other U.S. national security exchanges. Cboe Options is the Company’s primary options market and offers trading in listed options through a single system that integrates electronic trading and traditional open outcry trading on the Cboe Options trading floor in Chicago. C2 Options, BZX Options, and EDGX Options are all-electronic options exchanges, and typically operate with different market models and fee structures than Cboe Options. The Options segment also includes applicable market data fees revenues generated from the consolidated tape plans, the licensing of proprietary options market data, index licensing, routing services, and access and capacity services.\nNorth American Equities.\n The North American Equities segment includes U.S. equities and ETP transaction services that occur on fully electronic exchanges owned and operated by BZX, BYX, EDGX, and EDGA, equities transactions that occur on the BIDS Trading platform in the U.S. and Canada, and Canadian equities and other transaction services that occur on or through Cboe Canada’s order books. The North American Equities segment also includes corporate listing services on Cboe Canada, ETP listings on BZX, the Cboe Global Markets, Inc. common stock listing, and applicable market data fees revenues generated from the consolidated tape plans, the licensing of proprietary equities market data, routing services, and access and capacity services.\nEurope and Asia Pacific.\n The Europe and Asia Pacific segment includes the pan-European listed equities and derivatives transaction services, ETPs, including exchange traded funds, exchange traded notes, and exchange traded commodities, and international depository receipts that are hosted on MTFs operated by Cboe Europe Equities (Cboe Europe and Cboe NL equities exchanges) and Cboe Europe Derivatives (“CEDX”). It also includes the ETP listings business on RMs and clearing activities of Cboe Clear Europe, as well as the equities transaction services of Cboe Australia and formerly, Cboe Japan, operators of trading venues in Australia and Japan, respectively, along with equities transactions that occurred on the BIDS Trading platform in Japan. Cboe Europe operates lit and dark books, a periodic auctions book, a closing cross book, and two BIDS orderbooks; a Large-in-Scale (“LIS”) trading negotiation facility and - predominantly for UK and Swiss symbols - a volume-weighted average price (“VWAP”) trajectory crossing facility. Cboe NL, based in Amsterdam, operates similar business functionality to that offered by Cboe Europe (with the exception of Trajectory Crossing), and provides for trading only in European Economic Area (“EEA”) symbols. Cboe Europe Derivatives, a pan-European derivatives platform, offers futures and options based on Cboe Europe equity indices and single stock options. Cboe Clear Europe offers the clearing of equity and equity-like instruments for Cboe-operated and other regulated trading venues, the clearing of derivative transactions executed on CEDX, and has recently introduced a service to clear SFT. This segment also includes Cboe Europe, Cboe NL, CEDX, Cboe Australia and, formerly, Cboe Japan revenue generated from the licensing of proprietary market data and from access and capacity services.\nFutures.\n The Futures segment includes transaction services provided by CFE, a fully electronic futures exchange, which includes offerings for trading VIX futures and other futures products, the licensing of proprietary market data, as well as access and capacity services. As of January 1, 2025, the Futures segment prospectively includes all Digital operating activity, which includes Cboe Digital Exchange, a regulated futures exchange, and Cboe Clear U.S., a regulated clearinghouse, as well as revenue generated from the licensing of proprietary market data and from access and capacity services. The Company completed the migration of the Cboe Digital Exchange futures offerings to CFE on June 9, 2025. Cboe Digital Exchange no longer lists or trades any products.\n49\nTable of Contents\nComparative-period results have been presented for historical purposes but have not been recast as the historic results of the Digital segment were not material, nor do they materially impact the financial results, trends, or forecasts of the Futures segment. As a result, for the three and nine months ended September 30, 2025, operating results included within the Digital operating segment are presented within the Futures reporting segment. See Note 1 (“Organization and Basis of Presentation”) and Note 14 (“Segment Reporting”) for more information. \nGlobal FX.\n The Global FX segment includes institutional FX trading services that occur on the Cboe FX fully electronic trading platform, non-deliverable forward FX transactions (“NDFs”) offered for execution on Cboe SEF, as well as revenue generated from the licensing of proprietary market data and from access and capacity services. The segment includes transaction services for U.S. government securities executed on the Cboe Fixed Income fully electronic trading platform.\nGeneral Factors Affecting Results of Operations\nIn broad terms, our business performance is impacted by a number of drivers, including macroeconomic events affecting the risk and return of financial assets, investor sentiment, the regulatory environment for capital markets, geopolitical events, tax policies, central bank policies and changing technology, particularly in the financial services industry. We believe our future revenues and net income will continue to be influenced by a number of domestic and international economic trends, including:\n•\ntrading volumes on our proprietary products such as VIX options and futures and SPX options;\n•\ntrading volumes in listed equity securities, options, futures, and ETPs in North America, Europe, and Asia Pacific, clearing volumes in listed equity securities, options, futures, and ETPs in Europe, and volumes in institutional FX trading; \n•\nthe demand for and pricing structure of the U.S. tape plan market data distributed by the Securities Information Processors (“SIPs”), which determines the pool size of the industry market data fees we receive based on our market share;\n•\nconsolidation and expansion of our customers and competitors in the industry; \n•\nthe potential introduction of new or competing financial products or services by competitors in the industry, including those enabled by new technologies; \n•\nthe demand for information about, or access to, our markets and products, which is dependent on the products we trade, our importance as a liquidity center, quality and integrity of our proprietary indices, and the quality and pricing of our data and access and capacity services;\n•\nimplementation of the SEC's reduced equity access fee cap may lead to decreased exchange trading, and reduced transaction fee revenue; \n•\ncontinuing pressure in transaction fee pricing due to intense competition in the North American, European, and Asia Pacific markets;\n•\nsignificant fluctuations in foreign currency translation rates or weakened value of currencies;\n•\nongoing costs and uncertainties related to the historical, current, and future funding of the implementation and operation of the CAT, litigation and regulatory developments related to CAT, and the ability to collect on the promissory notes related to the funding of CAT; and\n•\nregulatory changes and obligations relating to market structure, increased capital or margin requirements, and those which affect certain types of instruments, transactions, products, pricing structures, capital market participants, or reporting or compliance requirements.\nA number of significant structural, political, monetary issues, and global conflicts continue to confront the global economy, and instability could continue, resulting in an increased or subdued level of inflation, market volatility, potential recession, supply chain constraints and costs, trading volumes, uncertainty, expenses, costs due to potential new tariffs or changes to existing tariffs, may have an adverse effect on our financial results.\nComponents of Revenues\nCash and Spot Markets\nRevenue aggregated into cash and spot markets includes associated transaction and clearing fees, the portion of market data fees relating to associated U.S. tape plan market data fees, associated regulatory fees, and associated other revenue from the Company’s North American Equities, Europe and Asia Pacific, and Global FX segments.\nData Vantage\nRevenue aggregated into Data Vantage includes access and capacity fees, proprietary market data fees, and associated other revenue across the Company’s five segments. \n50\nTable of Contents\nDerivatives Markets\nRevenue aggregated into derivatives markets includes associated transaction and clearing fees, the portion of market data fees relating to associated U.S. tape plan market data fees, associated regulatory fees, and associated other fees from the Company’s Options, Futures, and Europe and Asia Pacific segments.\nComponents of Cost of Revenues\nLiquidity Payments\nLiquidity payments are primarily correlated to the trading volume on our markets. As stated above, we record the liquidity rebates paid to market participants providing liquidity, in the case of Cboe Options, C2, BZX, EDGX, Cboe Europe Equities and Derivatives, Cboe Clear U.S., Cboe Digital Exchange, and CFE as cost of revenue. BYX offers an inverted pricing model where we rebate liquidity takers for executing against an order resting on our book, which is also recorded as a cost of revenues. EDGA offers a maker-taker fee model, effective November 1, 2024, under which liquidity providers receive a rebate, while liquidity takers pay a fee, all within a pricing model that does not include volume-based tiers.\nRouting and Clearing\nVarious rules require that U.S. options and equities trade executions occur at the National Best Bid and Offer displayed by any exchange. Linkage order routing consists of the cost incurred to provide a service whereby Cboe equities and options exchanges deliver orders to other execution venues when there is a potential for obtaining a better execution price or when instructed to directly route an order to another venue by the order provider. The service affords exchange order flow providers an opportunity to obtain the best available execution price and may also result in cost benefits to those clients. Such an offering improves our competitive position and provides an opportunity to attract orders which would otherwise bypass our exchanges. We utilize third-party brokers or our broker-dealer, Cboe Trading, to facilitate such delivery. Also included within routing and clearing are the Order Management System (“OMS”) and Execution Management System (“EMS”) fees incurred for U.S. Equities Off-Exchange order execution, as well as settlement costs incurred for the settlement processes executed by Cboe Clear Europe and Cboe Clear U.S.\nSection 31 Fees\nExchanges under the authority of the SEC (Cboe Options, C2, BZX, BYX, EDGX, and EDGA as well as CFE to the extent that CFE offers trading in security futures products) are assessed fees pursuant to the Exchange Act designed to recover the costs to the U.S. government of supervision and regulation of securities markets and securities professionals. We treat these fees as a pass-through charge to customers executing eligible listed equities and listed equity options trades. Accordingly, we recognize the amount that we are charged under Section 31 as a cost of revenues and the corresponding amount that we charge our customers as regulatory transaction fees revenue. Since the regulatory transaction fees recorded in revenues are equal to the Section 31 fees recorded in cost of revenues, there is no impact on our operating income. Cboe Trading, Cboe Europe, Cboe NL, BIDS, Cboe FX, Cboe Australia, Cboe Japan, Cboe Clear U.S., and Cboe Canada are not U.S. national securities exchanges and, accordingly, are not charged Section 31 fees.\nRoyalty Fees and Other Cost of Revenues\nRoyalty fees primarily consist of license fees paid by us for the use of underlying indices in our proprietary products, usually based on contracts traded. The Company has licenses with the owners of the S&P 500 Index, S&P 100 Index and certain other S&P indices, FTSE Russell indices, the DJIA, MSCI, and certain other index products. This category also includes fees related to the dissemination of market data related to S&P indices and other products through Cboe Global Indices Feed.\nOther cost of revenues primarily consists of interest expense from clearing operations, electronic access permit fees, and other miscellaneous costs associated with other revenue.\nComponents of Operating Expenses\nCompensation and Benefits\nCompensation and benefits represent our largest expense category and tend to be driven by our staffing requirements, financial performance, and the general dynamics of the employment market. Stock-based compensation is a non-cash expense related to employee equity awards. Stock-based compensation can vary depending on the quantity and fair value of the award on the grant date and the related service period.\n51\nTable of Contents\nDepreciation and Amortization\nDepreciation and amortization expense results from the depreciation of long-lived assets purchased, the amortization of purchased and internally developed software, and the amortization of intangible assets.\nTechnology Support Services\nTechnology support services consist primarily of costs related to the maintenance of computer equipment supporting our system architecture, circuits supporting our wide area network, support for production software, operating system license and support fees, fees paid to information vendors for displaying data, and off-site system hosting fees.\nProfessional Fees and Outside Services\nProfessional fees and outside services consist primarily of consulting services, which include supplemental staff activities primarily related to systems development and maintenance, legal, regulatory, audit, and tax advisory services, as well as compensation paid to non-employee directors, including stock-based compensation and deferred compensation.\nTravel and Promotional Expenses\nTravel and promotional expenses primarily consist of advertising, costs for special events, sponsorship of industry conferences, options education seminars, and travel-related expenses.\nFacilities Costs\nFacilities costs primarily consist of expenses related to leased properties including rent, maintenance, utilities, real estate taxes, and telecommunications costs.\nAcquisition-Related Costs\nAcquisition-related costs relate to acquisitions and other strategic opportunities. The acquisition-related costs include fees for investment banking advisors, lawyers, accountants, tax advisors, public relations firms, severance and retention costs, and other external costs directly related to mergers and acquisitions.\nImpairment of Assets\nImpairment of assets consists of charges to impair indefinite or long-lived assets if the carrying value exceeds the fair value.\nOther Expenses\nOther expenses represent costs necessary to support our operations that are not already included in the above categories, including, but not limited to, bad debt provisions and changes in contingent consideration. \nNon-Operating Income (Expenses)\nIncome and expenses incurred through activities outside of our core operations are considered non-operating and are classified as other income (expenses). These activities primarily include interest earned on the investing of excess cash, commitment fees and interest expense related to outstanding debt facilities, income and unrealized gains and losses related to investments held in a trust for the Company’s non-qualified retirement and benefit plans, including non-employee director deferred compensation, unrealized and realized gains and losses related to the Company’s minority investments, income or losses earned related to the Company’s minority investments, and equity earnings or losses from our investments in other business ventures.\n52\nTable of Contents\nFinancial Summary\nThe following are summaries of changes in financial performance and include certain non-GAAP financial measures. Management uses these non-GAAP measures internally in conjunction with GAAP measures to help evaluate our performance and to help make financial and operational decisions. These non-GAAP financial measures assist management in comparing our performance on a consistent basis for purposes of business decision making by removing the impact of certain items management believes do not reflect our underlying operations.\nWe believe our presentation of these measures provides investors with greater transparency into financial measures used by management and is useful to investors for period-to-period comparisons of our ongoing operating performance.\nThese non-GAAP financial measures are not presented in accordance with, or as an alternative to, GAAP financial measures and may be calculated differently from non-GAAP measures used by other companies, which reduces their usefulness as comparative measures. We encourage analysts, investors and other interested parties to use these non-GAAP measures as supplemental information to the GAAP financial measures included herein, including our condensed consolidated financial statements, to enhance their analysis and understanding of our performance and in making comparisons. Please see the footnotes below for definitions, additional information, and reconciliations from the closest GAAP measure.\n53\nTable of Contents\nThe following summarizes changes in financial performance for the three and nine months ended September 30, 2025, compared to the three and nine months ended September 30, 2024. “YTD” represents the nine month periods ended September 30, 2025 and 2024, respectively:\n(1)\nThese are Non-GAAP figures for which reconciliations are provided below (in millions, except percentages, earnings per share, and as noted below).\nThree Months Ended September 30,\nIncrease/\n(Decrease) \nPercent\nChange \nNine Months Ended September 30,\nIncrease/\n(Decrease) \nPercent\nChange \n2025\n2024\n2025\n2024\nTotal revenues\n$\n1,141.7 \n$\n1,055.7 \n$\n86.0 \n8 \n%\n$\n3,510.2 \n$\n2,986.9 \n$\n523.3 \n18 \n%\nTotal cost of revenues\n536.2 \n523.7 \n12.5 \n2 \n%\n1,752.2 \n1,439.0 \n313.2 \n22 \n%\nRevenues less cost of revenues\n605.5 \n532.0 \n73.5 \n14 \n%\n1,758.0 \n1,547.9 \n210.1 \n14 \n%\nTotal operating expenses\n235.2 \n224.6 \n10.6 \n5 \n%\n694.7 \n748.0 \n(53.3)\n(7)\n%\nOperating income\n370.3 \n307.4 \n62.9 \n20 \n%\n1,063.3 \n799.9 \n263.4 \n33 \n%\nOperating margin\n61.2 \n%\n57.8 \n%\n3.4 \n%\n*\n60.5 \n%\n51.7 \n%\n8.8 \n%\n*\nIncome before income tax provision\n$\n430.1 \n$\n309.0 \n$\n121.1 \n39 \n%\n$\n1,114.9 \n$\n804.1 \n$\n310.8 \n39 \n%\nIncome tax provision\n129.3 \n90.5 \n38.8 \n43 \n%\n328.4 \n235.7 \n92.7 \n39 \n%\nNet income\n$\n300.8 \n$\n218.5 \n$\n82.3 \n38 \n%\n$\n786.5 \n$\n568.4 \n$\n218.1 \n38 \n%\nBasic earnings per share\n$\n2.86 \n$\n2.08 \n$\n0.78 \n38 \n%\n$\n7.47 \n$\n5.38 \n$\n2.09 \n39 \n%\nDiluted earnings per share\n2.85 \n2.07 \n0.78 \n38 \n%\n7.45 \n5.36 \n2.09 \n39 \n%\nAdjusted operating income (1)\n395.3 \n328.0 \n67.3 \n21 \n%\n1,142.1 \n952.9 \n189.2 \n20 \n%\nAdjusted operating margin (2)\n65.3 \n%\n61.7 \n%\n3.6 \n%\n*\n65.0 \n%\n61.6 \n%\n3.4 \n%\n*\nOperating EBITDA (1)\n$\n401.2 \n$\n339.2 \n$\n62.0 \n18 \n%\n$\n1,154.4 \n$\n900.8 \n$\n253.6 \n28 \n%\nOperating EBITDA margin (3)\n66.3 \n%\n63.8 \n%\n2.5 \n%\n*\n65.7 \n%\n58.2 \n%\n7.5 \n%\n*\nAdjusted operating EBITDA (1)\n$\n409.0 \n$\n339.1 \n$\n69.9 \n21 \n%\n$\n1,180.4 \n$\n985.7 \n$\n194.7 \n20 \n%\nAdjusted operating EBITDA margin (4)\n67.5 \n%\n63.7 \n%\n3.8 \n%\n*\n67.1 \n%\n63.7 \n%\n3.4 \n%\n*\nEBITDA (1)\n$\n458.5 \n$\n341.1 \n$\n117.4 \n34 \n%\n$\n1,207.1 \n$\n920.5 \n$\n286.6 \n31 \n%\nEBITDA margin (5)\n75.7 \n%\n64.1 \n%\n11.6 \n%\n*\n68.7 \n%\n59.5 \n%\n9.2 \n%\n*\nAdjusted EBITDA (1)\n$\n415.3 \n$\n342.0 \n$\n73.3 \n21 \n%\n$\n1,181.4 \n$\n1,020.0 \n$\n161.4 \n16 \n%\nAdjusted EBITDA margin (6)\n68.6 \n%\n64.3 \n%\n4.3 \n%\n*\n67.2 \n%\n65.9 \n%\n1.3 \n%\n*\nAdjusted earnings (7)\n$\n279.8 \n$\n232.9 \n$\n46.9 \n20 \n%\n$\n800.7 \n$\n686.8 \n$\n113.9 \n17 \n%\nDiluted weighted average shares outstanding\n104.9 \n105.1 \n(0.2)\n(0)\n%\n105.1 \n105.6 \n(0.5)\n(0)\n%\nAdjusted diluted earnings per share (8)\n$\n2.67 \n$\n2.22 \n$\n0.45 \n20 \n%\n$\n7.62 \n$\n6.52 \n$\n1.10 \n17 \n%\n___________________________\n*Not meaningful\n54\nTable of Contents\n(1)\nAdjusted operating income is defined as operating income before relevant adjustments. Operating EBITDA is defined as operating income before depreciation and amortization. EBITDA is defined as income before interest, net, income taxes, and depreciation and amortization. Adjusted EBITDA is defined as EBITDA before relevant adjustments. Adjusted operating EBITDA is calculated by adding back to Operating EBITDA relevant adjustments. Relevant adjustments are detailed in the reconciliations that follow. Operating EBITDA, operating EBITDA margin, EBITDA, EBITDA margin, adjusted EBITDA, adjusted EBITDA margin, adjusted operating income, adjusted operating margin, adjusted operating EBITDA, and adjusted operating EBITDA margin do not represent, and should not be considered as, alternatives to net income as determined in accordance with GAAP. We have presented operating EBITDA, operating EBITDA margin, EBITDA, EBITDA margin, adjusted EBITDA, adjusted EBITDA margin, adjusted operating income, adjusted operating margin, adjusted operating EBITDA, and adjusted operating EBITDA margin because we consider them important supplemental measures of our performance and believe that they are frequently used by analysts, investors, and other interested parties in the evaluation of companies. In addition, we use adjusted EBITDA as a measure of operating performance for preparation of our forecasts and evaluating our leverage ratio for the debt to earnings covenant included in our outstanding credit facility. Other companies may calculate operating EBITDA, operating EBITDA margin, EBITDA, EBITDA margin, adjusted EBITDA, adjusted EBITDA margin, adjusted operating income, adjusted operating margin, adjusted operating EBITDA, and adjusted operating EBITDA margin differently than we do. Operating EBITDA, operating EBITDA margin, EBITDA, EBITDA margin, adjusted EBITDA, adjusted EBITDA margin, adjusted operating income, adjusted operating margin, adjusted operating EBITDA, and adjusted operating EBITDA margin have limitations as analytical tools, and you should not consider them in isolation or as substitutes for analysis of our results as reported under GAAP. \n(2)\nAdjusted operating margin represents adjusted operating income divided by revenues less cost of revenues.\n(3)\nOperating EBITDA margin represents operating EBITDA divided by revenues less cost of revenues.\n(4)\nAdjusted operating EBITDA margin represents adjusted operating EBITDA divided by revenues less cost of revenues.\n(5)\nEBITDA margin represents EBITDA divided by revenues less cost of revenues.\n(6)\nAdjusted EBITDA margin represents adjusted EBITDA divided by revenues less cost of revenues. \n(7)\nAdjusted earnings is defined as net income before relevant adjustments. Relevant adjustments are detailed in the reconciliation that follows. Adjusted earnings does not represent, and should not be considered as, an alternative to net income or loss, as determined in accordance with GAAP. We have presented adjusted earnings because we consider it an important supplemental measure of our performance and we use it as the basis for monitoring our own core operating financial performance relative to other operators of exchanges. We also believe that it is frequently used by analysts, investors, and other interested parties in the evaluation of companies. We believe that investors may find this non-GAAP measure useful in evaluating our performance compared to that of peer companies in our industry. Other companies may calculate adjusted earnings differently than we do. Adjusted earnings has limitations as an analytical tool, and you should not consider it in isolation or as a substitute for analysis of our results as reported under GAAP. \n(8)\nAdjusted diluted earnings per share represents adjusted earnings divided by diluted weighted average shares outstanding.\n55\nTable of Contents\nThe following is a reconciliation of operating income to adjusted operating income (in millions) for the three and nine months ended September 30, 2025 and 2024, respectively:\nThree Months Ended September 30,\nNine Months Ended September 30,\n2025\n2024\n2025\n2024\nOperating income\n$\n370.3 \n$\n307.4 \n$\n1,063.3 \n$\n799.9 \nAcquisition-related costs\n0.2 \n— \n0.4 \n1.2 \nAmortization of acquired intangible assets\n17.2 \n20.7 \n52.8 \n68.1 \nCboe Digital syndication wind down\n— \n— \n— \n(1.0)\nChange in contingent consideration\n— \n(0.9)\n— \n2.1 \nCosts related to Cboe Digital wind down\n0.1 \n0.8 \n0.6 \n1.6 \nCosts related to Cboe Japan wind down\n2.4 \n— \n2.4 \n— \nExecutive compensation adjustment\n0.6 \n— \n1.0 \n— \nImpairment of assets\n4.5 \n— \n21.6 \n81.0 \nAdjusted operating income\n$\n395.3 \n$\n328.0 \n$\n1,142.1 \n$\n952.9 \nThe following is a reconciliation of operating income to operating EBITDA and adjusted operating EBITDA (in millions) for the three and nine months ended September 30, 2025 and 2024, respectively:\nThree Months Ended September 30,\nNine Months Ended September 30,\n2025\n2024\n2025\n2024\nOperating income\n$\n370.3 \n$\n307.4 \n$\n1,063.3 \n$\n799.9 \nDepreciation and amortization\n30.9 \n31.8 \n91.1 \n100.9 \nOperating EBITDA\n401.2 \n339.2 \n1,154.4 \n900.8 \nAcquisition-related costs\n0.2 \n— \n0.4 \n1.2 \nCboe Digital syndication wind down\n— \n— \n— \n(1.0)\nChange in contingent consideration\n— \n(0.9)\n— \n2.1 \nCosts related to Cboe Digital wind down\n0.1 \n0.8 \n0.6 \n1.6 \nCosts related to Cboe Japan wind down\n2.4 \n— \n2.4 \n— \nExecutive compensation adjustment\n0.6 \n— \n1.0 \n— \nImpairment of assets\n4.5 \n— \n21.6 \n81.0 \nAdjusted operating EBITDA\n$\n409.0 \n$\n339.1 \n$\n1,180.4 \n$\n985.7 \n56\nTable of Contents\nThe following is a reconciliation of net income (loss) allocated to common stockholders to EBITDA and adjusted EBITDA (in millions) for the three months ended September 30, 2025 and 2024, respectively:\nThree Months Ended September 30,\n2025\nOptions\nNorth American Equities\nEurope and Asia Pacific\nFutures\nGlobal FX\nDigital (1)\nCorporate\nTotal\nNet income (loss) allocated to common stockholders\n$\n273.5 \n$\n53.7 \n$\n16.1 \n$\n17.3 \n$\n11.4 \n$\n— \n$\n(72.7)\n$\n299.3 \nInterest (income) expense, net\n(0.2)\n(0.9)\n1.3 \n(0.6)\n— \n— \n(0.6)\n(1.0)\nIncome tax provision\n— \n1.0 \n0.3 \n— \n— \n— \n128.0 \n129.3 \nDepreciation and amortization\n7.6 \n11.7 \n8.2 \n0.6 \n2.8 \n— \n— \n30.9 \nEBITDA\n280.9 \n65.5 \n25.9 \n17.3 \n14.2 \n— \n54.7 \n458.5 \nAcquisition-related costs\n— \n0.1 \n— \n— \n— \n— \n0.1 \n0.2 \nCosts related to Cboe Digital wind down\n— \n— \n— \n0.1 \n— \n— \n— \n0.1 \nCosts related to Cboe Japan wind down\n— \n— \n2.4 \n— \n— \n— \n— \n2.4 \nEarnings on investments adjustments\n— \n(0.4)\n— \n— \n— \n— \n(50.6)\n(51.0)\nExecutive compensation adjustment\n— \n— \n— \n— \n— \n— \n0.6 \n0.6 \nImpairment of assets\n— \n— \n4.5 \n— \n— \n— \n— \n4.5 \nAdjusted EBITDA\n$\n280.9 \n$\n65.2 \n$\n32.8 \n$\n17.4 \n$\n14.2 \n$\n— \n$\n4.8 \n$\n415.3 \nThree Months Ended September 30,\n2024\nOptions\nNorth American Equities\nEurope and Asia Pacific\nFutures\nGlobal FX\nDigital (1)\nCorporate\nTotal\nNet income (loss) allocated to common stockholders\n$\n220.0 \n$\n43.9 \n$\n11.3 \n$\n29.3 \n$\n9.2 \n$\n(5.2)\n$\n(91.1)\n$\n217.4 \nInterest (income) expense, net\n(0.1)\n(0.7)\n0.8 \n— \n— \n(0.9)\n2.3 \n1.4 \nIncome tax provision (benefit)\n— \n0.7 \n(0.6)\n— \n— \n— \n90.4 \n90.5 \nDepreciation and amortization\n6.6 \n14.1 \n7.2 \n0.6 \n3.1 \n0.1 \n0.1 \n31.8 \nEBITDA\n226.5 \n58.0 \n18.7 \n29.9 \n12.3 \n(6.0)\n1.7 \n341.1 \nAcquisition-related costs\n— \n0.1 \n— \n— \n— \n(0.1)\n— \n— \nChange in contingent consideration\n— \n(1.0)\n— \n— \n— \n— \n0.1 \n(0.9)\nCosts related to Cboe Digital wind down\n— \n— \n— \n— \n— \n0.8 \n— \n0.8 \nLoss on investments adjustments\n— \n— \n— \n— \n— \n— \n1.0 \n1.0 \nAdjusted EBITDA\n$\n226.5 \n$\n57.1 \n$\n18.7 \n$\n29.9 \n$\n12.3 \n$\n(5.3)\n$\n2.8 \n$\n342.0 \n57\nTable of Contents\nThe following is a reconciliation of net income (loss) allocated to common stockholders to EBITDA and adjusted EBITDA (in millions) for the nine months ended September 30, 2025 and 2024, respectively:\nNine Months Ended September 30,\n2025\nOptions\nNorth American Equities\nEurope and Asia Pacific\nFutures\nGlobal FX\nDigital (1)\nCorporate\nTotal\nNet income (loss) allocated to common stockholders\n$\n787.6 \n$\n144.3 \n$\n39.8 \n$\n56.0 \n$\n34.4 \n$\n— \n$\n(279.5)\n$\n782.6 \nInterest (income) expense, net\n(0.6)\n(2.5)\n3.0 \n(1.8)\n(0.1)\n— \n7.0 \n5.0 \nIncome tax provision (benefit)\n0.1 \n2.7 \n1.3 \n— \n(0.1)\n— \n324.4 \n328.4 \nDepreciation and amortization\n21.5 \n35.2 \n24.2 \n1.7 \n8.4 \n— \n0.1 \n91.1 \nEBITDA\n808.6 \n179.7 \n68.3 \n55.9 \n42.6 \n— \n52.0 \n1,207.1 \nAcquisition-related costs\n— \n0.3 \n— \n(0.1)\n— \n— \n0.2 \n0.4 \nCosts related to Cboe Digital wind down\n— \n— \n— \n0.6 \n— \n— \n— \n0.6 \nCosts related to Cboe Japan wind down\n— \n— \n2.4 \n— \n— \n— \n— \n2.4 \nEarnings on investments adjustments\n— \n(1.0)\n— \n— \n— \n— \n(50.7)\n(51.7)\nExecutive compensation adjustment\n— \n— \n— \n— \n— \n— \n1.0 \n1.0 \nImpairment of assets\n— \n— \n21.6 \n— \n— \n— \n— \n21.6 \nAdjusted EBITDA\n$\n808.6 \n$\n179.0 \n$\n92.3 \n$\n56.4 \n$\n42.6 \n$\n— \n$\n2.5 \n$\n1,181.4 \nNine Months Ended September 30,\n2024\nOptions\nNorth American Equities\nEurope and Asia Pacific\nFutures\nGlobal FX\nDigital (1)\nCorporate\nTotal\nNet income (loss) allocated to common stockholders\n$\n650.9 \n$\n126.0 \n$\n29.7 \n$\n77.5 \n$\n24.9 \n$\n(101.5)\n$\n(242.1)\n$\n565.4 \nInterest (income) expense, net\n(0.2)\n(1.5)\n2.9 \n— \n— \n(3.1)\n20.4 \n18.5 \nIncome tax provision (benefit)\n— \n2.4 \n(2.2)\n— \n— \n— \n235.5 \n235.7 \nDepreciation and amortization\n20.1 \n44.2 \n21.7 \n1.8 \n10.4 \n2.6 \n0.1 \n100.9 \nEBITDA\n670.8 \n171.1 \n52.1 \n79.3 \n35.3 \n(102.0)\n13.9 \n920.5 \nAcquisition-related costs\n— \n0.3 \n0.3 \n— \n— \n0.1 \n0.5 \n1.2 \nCboe Digital syndication wind down\n— \n— \n— \n— \n— \n(1.0)\n— \n(1.0)\nChange in contingent consideration\n— \n(1.0)\n— \n— \n— \n— \n3.1 \n2.1 \nCosts related to Cboe Digital wind down\n— \n— \n— \n— \n— \n1.6 \n— \n1.6 \nGain on Cboe Digital non-recourse notes and warrants wind down\n— \n— \n— \n— \n— \n(1.4)\n— \n(1.4)\nGain on sale of property held for sale\n(1.0)\n— \n— \n— \n— \n— \n— \n(1.0)\nImpairment of assets\n— \n— \n— \n— \n— \n81.0 \n— \n81.0 \nLoss on investments adjustments\n— \n— \n— \n— \n— \n— \n17.0 \n17.0 \nAdjusted EBITDA\n$\n669.8 \n$\n170.4 \n$\n52.4 \n$\n79.3 \n$\n35.3 \n$\n(21.7)\n$\n34.5 \n$\n1,020.0 \n___________________________\n(1)\nThe Digital segment results are prospectively included in the Futures segment beginning in the first quarter of 2025. Digital results from 2024 have been retained in the former Digital segment for comparative purposes. See Note 1 (“Organization and Basis of Presentation”) for additional information.\n58\nTable of Contents\nThe following is a reconciliation of net income allocated to common stockholders to adjusted earnings (in millions):\nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n2025\n2024\n2025\n2024\nNet income allocated to common stockholders\n$\n299.3 \n$\n217.4 \n$\n782.6 \n$\n565.4 \nAmortization of acquired intangible assets\n17.2 \n20.7 \n52.8 \n68.1 \nAcquisition-related costs\n0.2 \n— \n0.4 \n1.2 \nChange in contingent consideration\n— \n(0.9)\n— \n2.1 \nCboe Digital syndication wind down\n— \n— \n— \n(1.0)\nCosts related to Cboe Digital wind down\n0.1 \n0.8 \n0.6 \n1.6 \nCosts related to Cboe Japan wind down\n2.4 \n— \n2.4 \n— \n(Earnings) loss on investments adjustments\n(51.0)\n1.0 \n(51.7)\n17.0 \nExecutive compensation adjustment\n0.6 \n— \n1.0 \n— \nGain on Cboe Digital non-recourse notes and warrants wind down\n— \n— \n— \n(1.4)\nGain on sale of property held for sale\n— \n— \n— \n(1.0)\nImpairment of assets\n4.5 \n— \n21.6 \n81.0 \nTax effect of adjustments\n6.5 \n(4.7)\n(7.7)\n(44.3)\nIncrease of tax reserves\n— \n(1.6)\n— \n(5.6)\nDeferred tax re-measurements\n— \n— \n(1.0)\n— \nValuation allowances\n— \n0.3 \n— \n4.4 \nNet income allocated to participating securities\n— \n(0.1)\n(0.3)\n(0.7)\nAdjusted earnings\n$\n279.8 \n$\n232.9 \n$\n800.7 \n$\n686.8 \n59\nTable of Contents\nThe following summarizes changes in certain operational and financial metrics for the nine months ended September 30, 2025, compared to the nine months ended September 30, 2024:\n60\nTable of Contents\nThe following summarizes changes in certain operational and financial metrics for the nine months ended September 30, 2025, compared to the nine months ended September 30, 2024 (continued fro\nm previous page):\n \n \n61\nTable of Contents\nThe following table includes operational and financial metrics for our Options, North American Equities, Europe and Asia Pacific, Futures, and Global FX segments. The following summarizes changes in certain operational and financial metrics for the three and nine months ended September 30, 2025 compared to the three and nine months ended September 30, 2024:\nThree Months Ended September 30,\nIncrease/\n(Decrease)\nPercent\nChange\nNine Months Ended September 30,\nIncrease/\n(Decrease)\nPercent\nChange\n2025\n2024\n2025\n2024\n(in millions, except percentages, trading days, and as noted below)\n(in millions, except percentages, trading days, and as noted below)\nOptions:\nAverage daily volume (ADV) (in millions of contracts):\nMarket ADV\n60.8 \n48.7 \n12.1 \n25 \n%\n58.8 \n47.4 \n11.4 \n24 \n%\nTotal touched contracts (1)\n18.8 \n14.9 \n3.9 \n26 \n%\n18.1 \n14.7 \n3.4 \n23 \n%\nMulti-listed contract ADV\n13.9 \n10.7 \n3.2 \n31 \n%\n13.3 \n10.6 \n2.7 \n26 \n%\nIndex contract ADV\n4.9 \n4.2 \n0.7 \n15 \n%\n4.8 \n4.1 \n0.7 \n16 \n%\nTrading days\n64 \n64 \n— \n— \n%\n186 \n188 \n(2)\n(1)\n%\nTotal Options revenue per contract (RPC) (2)\n$\n0.281 \n$\n0.298 \n$\n(0.017)\n(6)\n%\n$\n0.289 \n$\n0.298 \n$\n(0.009)\n(3)\n%\nMulti-listed options RPC (2)\n$\n0.055 \n$\n0.063 \n$\n(0.008)\n(13)\n%\n$\n0.063 \n$\n0.063 \n$\n— \n(0)\n%\nIndex options RPC (2)\n$\n0.926 \n$\n0.892 \n$\n0.034 \n4 \n%\n$\n0.919 \n$\n0.901 \n$\n0.018 \n2 \n%\nTotal Options market share\n30.9 \n%\n30.5 \n%\n0.4 \n%\n*\n30.7 \n%\n31.0 \n%\n(0.3)\n%\n*\nMulti-listed options market share\n24.9 \n%\n24.0 \n%\n0.9 \n%\n*\n24.7 \n%\n24.5 \n%\n0.2 \n%\n*\nNorth American Equities:\nU.S. Equities:\nU.S. Equities - Exchange:\nADV:\nTotal matched shares (in billions) (5)\n1.7 \n1.3 \n0.4 \n36 \n%\n1.8 \n1.4 \n0.4 \n29 \n%\nMarket ADV (in billions)\n17.6 \n11.5 \n6.1 \n53 \n%\n17.2 \n11.7 \n5.5 \n48 \n%\nMarket share\n9.8 \n%\n10.9 \n%\n(1.1)\n%\n*\n10.2 \n%\n11.7 \n%\n(1.5)\n%\n*\nU.S. Equities - Exchange (net capture per one hundred touched shares) (3)\n$\n0.015 \n$\n0.024 \n$\n(0.009)\n(37)\n%\n$\n0.014 \n$\n0.023 \n$\n(0.009)\n(40)\n%\nU.S. ETPs: launches (number of launches)\n93 \n84 \n9 \n11 \n%\n236 \n182 \n54 \n30 \n%\nU.S. ETPs: listings (number of listings)\n1,032 \n826 \n206 \n25 \n%\n1,032 \n826 \n206 \n25 \n%\nU.S. Equities - Off-Exchange:\nADV (touched shares, in millions) (1)\n202.3 \n79.3 \n123.0 \n155 \n%\n140.7 \n78.7 \n62.0 \n79 \n%\nU.S. Equities - Off-Exchange (net capture per one hundred touched shares) (4)\n$\n0.064 \n$\n0.135 \n$\n(0.071)\n(52)\n%\n$\n0.081 \n$\n0.135 \n$\n(0.054)\n(40)\n%\nTrading days\n64 \n64 \n— \n— \n%\n186 \n188 \n(2)\n(1)\n%\nCanadian Equities:\nADV (matched shares, in millions) (5)\n163.8 \n135.9 \n27.9 \n20 \n%\n158.0 \n144.3 \n13.7 \n9 \n%\nTrading days\n63 \n63 \n— \n— \n%\n188 \n189 \n(1)\n(1)\n%\nNet capture (per 10,000 touched shares, in Canadian dollars) (6)\n$\n4.142 \n$\n4.240 \n$\n(0.098)\n(2)\n%\n$\n4.204 \n$\n4.091 \n$\n0.113 \n3 \n%\nEurope and Asia Pacific:\nEuropean Equities:\nADNV:\nMatched ADNV (Euros - in billions) (7)\n€\n11.7 \n€\n9.3 \n€\n2.4 \n26 \n%\n€\n13.0 \n€\n9.6 \n€\n3.4 \n36 \n%\nMarket ADNV (in billions)\n€\n46.1 \n€\n38.9 \n€\n7.2 \n19 \n%\n€\n52.0 \n€\n41.0 \n€\n11.0 \n27 \n%\nTrading days\n66 \n66 \n— \n— \n%\n192 \n193 \n(1)\n(1)\n%\nMarket share\n25.4 \n%\n23.8 \n%\n1.6 \n%\n*\n25.1 \n%\n23.3 \n%\n1.8 \n%\n*\nNet capture (per matched notional value (bps), in Euros) (8)\n€\n0.287 \n€\n0.257 \n€\n0.030 \n12 \n%\n€\n0.266 \n€\n0.252 \n€\n0.014 \n5 \n%\nCboe Clear Europe:\nTrades cleared, in millions (9)\n329.3 \n306.9 \n22.4 \n7 \n%\n1,142.3 \n900.2 \n242.1 \n27 \n%\nFee per trade cleared (10)\n€\n0.010 \n€\n0.008 \n€\n0.002 \n18 \n%\n€\n0.008 \n€\n0.008 \n€\n— \n4 \n%\nEuropean equities market share cleared (11)\n39.6 \n%\n38.3 \n%\n1.3 \n%\n*\n39.4 \n%\n37.1 \n%\n2.3 \n%\n*\nNet settlement volume, in millions (12)\n3.5 \n2.9 \n0.6 \n20 \n%\n10.0 \n8.2 \n1.8 \n22 \n%\nNet fee per settlement (13)\n€\n1.015 \n€\n1.026 \n€\n(0.011)\n(1)\n%\n€\n0.975 \n€\n1.044 \n€\n(0.069)\n(7)\n%\nAustralian Equities:\nADNV (Australian dollars - in billions)\n$\n1.0 \n$\n0.8 \n$\n0.2 \n18 \n%\n$\n0.9 \n$\n0.8 \n$\n0.1 \n17 \n%\nTrading days\n66 \n66 \n— \n— \n%\n189 \n190 \n(1)\n(1)\n%\nMarket share - Continuous\n20.6 \n%\n20.8 \n%\n(0.2)\n%\n*\n20.0 \n%\n20.7 \n%\n(0.7)\n%\n*\nNet capture (per matched notional value (bps), in Australian dollars) (14)\n$\n0.206 \n$\n0.156 \n$\n0.050 \n32 \n%\n$\n0.176 \n$\n0.155 \n$\n0.021 \n13 \n%\nFutures:\nADV (in thousands)\n200.7 \n273.7 \n(73.0)\n(27)\n%\n223.0 \n249.6 \n(26.6)\n(11)\n%\nTrading days\n64 \n64 \n— \n— \n%\n186 \n188 \n(2)\n(1)\n%\nRPC\n$\n1.745 \n$\n1.767 \n$\n(0.022)\n(1)\n%\n$\n1.725 \n$\n1.759 \n$\n(0.034)\n(2)\n%\nGlobal FX:\nADNV ($ - in billions)\n$\n49.9 \n$\n48.3 \n$\n1.6 \n3 \n%\n$\n52.6 \n$\n47.1 \n$\n5.5 \n12 \n%\nTrading days\n66 \n66 \n— \n— \n%\n194 \n195 \n(1)\n(1)\n%\nNet capture (per one million dollars traded) (15)\n$\n2.89 \n$\n2.66 \n$\n0.23 \n9 \n%\n$\n2.82 \n$\n2.66 \n$\n0.16 \n6 \n%\nAverage British pound/U.S. dollar exchange rate\n$\n1.348 \n$\n1.301 \n$\n0.047 \n4 \n%\n$\n1.314 \n$\n1.277 \n$\n0.037 \n3 \n%\nAverage Canadian dollar/U.S. dollar exchange rate\n$\n0.726 \n$\n0.733 \n$\n(0.007)\n(1)\n%\n$\n0.715 \n$\n0.735 \n$\n(0.020)\n(3)\n%\nAverage Euro/U.S. dollar exchange rate\n$\n1.169 \n$\n1.099 \n$\n0.070 \n6 \n%\n$\n1.118 \n$\n1.087 \n$\n0.031 \n3 \n%\nAverage Euro/British pound exchange rate\n£\n0.867 \n£\n0.845 \n£\n0.022 \n3 \n%\n£\n0.851 \n£\n0.851 \n£\n— \n(0)\n%\nAverage Australian dollar/U.S. dollar exchange rate\n$\n0.654 \n$\n0.670 \n$\n(0.016)\n(2)\n%\n$\n0.641 \n$\n0.662 \n$\n(0.021)\n(3)\n%\n_____________________________________\n*Not meaningful\nNote, the percent change listed represents the change in the unrounded metrics figures.\nNote, in the third quarter of 2025, the Company replaced U.S. Equities - Exchange total touched shares with total matched shares for each period presented, aligning the metric with externally reported volume summaries. The impact of this change is immaterial.\nNote, the Digital segment is not included as results were not material for the three and nine month periods ended September 30, 2024. In the second quarter of 2025, Digital futures products were transitioned to Cboe Futures Exchange. Futures metrics prior to the second quarter of 2025 exclude Digital futures products.\nNote, as of January 2025, European equities market share cleared excludes market volume not cleared within the Cboe Clear Europe pan-European equities market space. Prior periods have been restated in accordance with this methodology.\n62\nTable of Contents\n(1)\nTouched volume represents the total number of shares of equity securities and ETFs internally matched on our exchanges or routed to and executed on an external market center.\n(2)\nAverage revenue per contract, for options and futures, represents total net transaction fees recognized for the period divided by total contracts traded during the period.\n(3)\nNet capture per one hundred touched shares refers to transaction fees less liquidity payments and routing and clearing costs divided by the product of one-hundredth ADV of touched shares on BZX, BYX, EDGX, and EDGA and the number of trading days.\n(4)\nNet capture per one hundred touched shares refers to transaction fees less order and execution management system (OMS/EMS) fees and clearing costs divided by the product of one-hundredth ADV of touched shares on BIDS Trading and the number of trading days for the period.\n(5)\nMatched volume represents the total number of shares of equity securities and ETFs activity executed on our exchanges. \n(6)\nNet capture per 10,000 touched shares refers to transaction fees divided by the product of one-ten thousandth ADV of shares of Cboe Canada and the number of trading days.\n(7)\nMatched ADNV represents the average daily notional value of shares or contracts executed on our exchanges.\n(8)\nNet capture per matched notional value refers to transaction fees less liquidity payments in British pounds divided by the product of ADNV in British pounds of shares matched on Cboe Europe Equities and the number of trading days.\n(9)\nTrades cleared refers to the total number of non-interoperable trades cleared.\n(10)\nFee per trade cleared refers to clearing fees divided by number of non-interoperable trades cleared.\n(11)\nEuropean Equities market share cleared represents Cboe Clear Europe’s client volume cleared divided by the total volume of the publicly reported European venues.\n(12)\nNet settlement volume refers to the total number of settlements executed after netting.\n(13)\nNet fee per settlement refers to settlement fees less direct costs incurred to settle divided by the number of settlements executed after netting.\n(14)\nNet capture per matched notional value refers to transaction fees less liquidity payments in Australian dollars divided by the product of ADNV in Australian dollars of shares matched on Cboe Australia and the number of Australian Equities trading days.\n(15)\nNet capture per one million dollars traded refers to net transaction fees less liquidity payments, if any, divided by the Spot and SEF products of one-thousandth of ADNV traded on the Cboe FX Markets and the number of trading days, divided by two, which represents the buyer and seller that are both charged on the transaction.\n63\nTable of Contents\nRevenues \nTotal revenues for the three months ended September 30, 2025 increased $86.0 million, or 8%, compared to the same period in 2024 primarily due to an increase in derivatives markets revenue, driven by an increase in transaction and clearing fees as a result of increased volumes traded on the Cboe options exchanges. Total revenues for the nine months ended September 30, 2025 increased $523.3 million, or 18%, compared to the same period in 2024 primarily due to increases in derivatives markets and cash and spot markets revenue, driven by an increase in transaction and clearing fees as a result of increased volumes traded on the Cboe options, Cboe U.S. equities, and Cboe European equities exchanges.\nThe following summarizes changes in revenues for the three and nine months ended September 30, 2025 compared to the three and nine months ended September 30, 2024 (in millions, except percentages):\nThree Months Ended\nSeptember 30,\nIncrease/\n(Decrease)\nPercent\nChange\n \nNine Months Ended\nSeptember 30,\nIncrease/\n(Decrease)\nPercent\nChange\n \n2025\n2024\n2025\n2024\nCash and spot markets\n$\n415.0 \n$\n434.1 \n$\n(19.1)\n(4)\n%\n$\n1,403.5 \n$\n1,201.4 \n$\n202.1 \n17 \n%\nData Vantage\n162.1 \n145.6 \n16.5 \n11 \n%\n472.9 \n427.9 \n45.0 \n11 \n%\nDerivatives markets\n564.6 \n476.0 \n88.6 \n19 \n%\n1,633.8 \n1,357.6 \n276.2 \n20 \n%\nTotal revenues\n$\n1,141.7 \n$\n1,055.7 \n$\n86.0 \n8 \n%\n$\n3,510.2 \n$\n2,986.9 \n$\n523.3 \n18 \n%\nCash and Spot Markets \nCash and spot markets revenue decreased for the three months ended September 30, 2025 compared to the same period in 2024 primarily due to a decrease in regulatory fees, partially offset by an increase in transaction and clearing fees. Regulatory fees decreased primarily due to a 100% decrease in the Section 31 fee rate, from an average of $27.80 per million dollars of covered sales for the three months ended September 30, 2024 to an average rate of $0 per million dollars of covered sales for the three months ended September 30, 2025, following a rate change effective May 2025 to $0 per million dollars of covered sales due to the SEC having collected its entire 2025 appropriated amount. Regulatory fees revenue related to Section 31 fees is directly offset by Section 31 fees cost of revenues. Transaction and clearing fees increased primarily due to a 36% increase in total touched shares on the Company's U.S. equities exchanges (BZX, BYX, EDGX, and EDGA, collectively, the \"Cboe U.S. equity exchanges\") and a 26% increase in Cboe European equities exchanges matched ADNV.\nCash and spot markets revenue increased for the nine months ended September 30, 2025 compared to the same period in 2024 primarily due to increases in transaction and clearing fees. Transaction and clearing fees increased primarily due to a 29% increase in total matched shares on the Cboe U.S. equity exchanges and a 36% increase in Cboe European equities exchanges matched ADNV.\nData Vantage \nData Vantage revenue increased for the three and nine months ended September 30, 2025 compared to the same periods in 2024 primarily due to increases in access and capacity fees and proprietary market data fees. Access and capacity fees increased primarily due to increases in logical port fees in the Options, North American Equities, and Europe and Asia Pacific segments, driven by increased customer demand. Proprietary market data fees increased primarily due to increases in proprietary market data fees in the Options, Europe and Asia Pacific segments, and North American Equities segments.\nDerivatives Markets \nDerivatives markets revenue increased for the three months ended September 30, 2025 compared to the same period in 2024 primarily due to an increase in transaction and clearing fees, partially offset by a decrease in regulatory fees. Transaction and clearing fees increased primarily due to a 31% increase in multi-listed options ADV and a 15% increase in index options ADV. Regulatory fees decreased primarily due to a 100% decrease in the Section 31 fee rate, from an average of $27.80 per million dollars of covered sales for the three months ended September 30, 2024 to an average rate of $0 per million dollars of covered sales for the three months ended September 30, 2025, following a rate change effective May 2025 to $0 per million dollars of covered sales due to the SEC having collected its entire 2025 appropriated amount. Regulatory fees revenue related to Section 31 fees is directly offset by Section 31 fees cost of revenues.\nDerivatives markets revenue increased for the nine months ended September 30, 2025 compared to the same period in 2024 primarily due to an increase in transaction and clearing fees. Transaction and clearing fees increased primarily due to a 26% increase in multi-listed options ADV and a 16% increase in index options ADV.\n64\nTable of Contents\nCost of Revenues\nThe following tables reconcile the disaggregated cost of revenues captions presented on the condensed consolidated statements of income to the net revenue captions presented on the condensed consolidated statements of income for the three and nine months ended September 30, 2025 and 2024, respectively (in millions): \nThree Months Ended September 30, 2025\nCash and\nSpot Markets\nData Vantage\nDerivatives\nMarkets\nTotal\nLiquidity payments\n$\n274.0 \n$\n— \n$\n179.3 \n$\n453.3 \nRouting and clearing fees\n15.2 \n— \n4.8 \n20.0 \nSection 31 fees\n— \n— \n— \n— \nRoyalty fees and other cost of revenues\n8.5 \n3.2 \n51.2 \n62.9 \nTotal cost of revenues\n$\n297.7 \n$\n3.2 \n$\n235.3 \n$\n536.2 \nThree Months Ended September 30, 2024\nCash and\nSpot Markets\nData Vantage\nDerivatives\nMarkets\nTotal\nLiquidity payments\n$\n198.9 \n$\n— \n$\n118.7 \n$\n317.6 \nRouting and clearing fees\n12.7 \n— \n4.7 \n17.4 \nSection 31 fees\n106.4 \n— \n23.1 \n129.5 \nRoyalty fees and other cost of revenues\n12.8 \n3.1 \n43.3 \n59.2 \nTotal cost of revenues\n$\n330.8 \n$\n3.1 \n$\n189.8 \n$\n523.7 \nNine Months Ended September 30, 2025\nCash and\nSpot Markets\nData Vantage\nDerivatives\nMarkets\nTotal\nLiquidity payments\n$\n792.8 \n$\n— \n$\n473.3 \n$\n1,266.1 \nRouting and clearing fees\n47.2 \n— \n13.1 \n60.3 \nSection 31 fees\n191.3 \n— \n47.1 \n238.4 \nRoyalty fees and other cost of revenues\n32.6 \n9.5 \n145.3 \n187.4 \nTotal cost of revenues\n$\n1,063.9 \n$\n9.5 \n$\n678.8 \n$\n1,752.2 \nNine Months Ended September 30, 2024\nCash and\nSpot Markets\nData Vantage\nDerivatives\nMarkets\nTotal\nLiquidity payments\n$\n613.8 \n$\n— \n$\n349.6 \n$\n963.4 \nRouting and clearing fees\n37.1 \n— \n12.9 \n50.0 \nSection 31 fees\n204.2 \n— \n45.1 \n249.3 \nRoyalty fees and other cost of revenues\n42.0 \n8.1 \n126.2 \n176.3 \nTotal cost of revenues\n$\n897.1 \n$\n8.1 \n$\n533.8 \n$\n1,439.0 \nTotal cost of revenues increased for the three months ended September 30, 2025 compared to the same period in 2024 primarily due to an increase in liquidity payments as a result of volume increases in U.S. equities and multi-listed options, partially offset by a decrease in Section 31 fees.\nTotal cost of revenues increased for the nine months ended September 30, 2025 compared to the same period in 2024 primarily due to an increase in liquidity payments as a result of volume increases in U.S. equities and multi-listed options.\n65\nTable of Contents\nThe following summarizes changes in the disaggregated cost of revenues for the three and nine months ended September 30, 2025 compared to the three and nine months ended September 30, 2024 (in millions, except percentages):\nThree Months Ended\nSeptember 30,\nIncrease/\n(Decrease)\nPercent\nChange\n \nNine Months Ended\nSeptember 30,\nIncrease/\n(Decrease)\nPercent\nChange\n \n2025\n2024\n2025\n2024\nLiquidity payments\n$\n453.3 \n$\n317.6 \n$\n135.7 \n43 \n%\n$\n1,266.1 \n$\n963.4 \n$\n302.7 \n31 \n%\nRouting and clearing\n20.0 \n17.4 \n2.6 \n15 \n%\n60.3 \n50.0 \n10.3 \n21 \n%\nSection 31 fees\n— \n129.5 \n(129.5)\n(100)\n%\n238.4 \n249.3 \n(10.9)\n(4)\n%\nRoyalty fees and other cost of revenues\n62.9 \n59.2 \n3.7 \n6 \n%\n187.4 \n176.3 \n11.1 \n6 \n%\nTotal cost of revenues\n$\n536.2 \n$\n523.7 \n$\n12.5 \n2 \n%\n$\n1,752.2 \n$\n1,439.0 \n$\n313.2 \n22 \n%\nLiquidity Payments\nLiquidity payments increased for the three months ended September 30, 2025 compared to the same period in 2024 primarily due to an increase in liquidity payments on the Cboe U.S. equity exchanges as a result of a 36% increase in total touched shares, coupled with an increase in liquidity payments on the Cboe options exchanges as a result of a 31% increase in multi-listed options ADV. Liquidity payments increased for the nine months ended September 30, 2025 compared to the same period in 2024 primarily due to an increase in liquidity payments on the Cboe U.S. equity exchanges as a result of a 29% increase in total matched shares, coupled with an increase in liquidity payments on the Cboe options exchanges as a result of a 26% increase in multi-listed options ADV. \nRouting and Clearing \nRouting and clearing fees increased for the three and nine months ended September 30, 2025 compared to the same periods in 2024 primarily due to an increase in routed trades on the Cboe U.S. equity exchanges and Cboe Clear Europe settlement fees.\nSection 31 Fees\nSection 31 fees decreased for the three months ended September 30, 2025 compared to the same period in 2024 primarily due to a 100% decrease in the Section 31 fee rate, from an average rate of $27.80 per million dollars of covered sales for the three months ended September 30, 2024 to an average rate of $0 per million dollars of covered sales for the three months ended September 30, 2025, following a rate change effective May 2025 to $0 per million dollars of covered sales due to the SEC having collected its entire 2025 appropriated amount. Section 31 fees decreased for the nine months ended September 30, 2025 compared to the same period in 2024 primarily due to a 22% decrease in the Section 31 fee rate, from an average rate of $17.50 per million dollars of covered sales for the nine months ended September 30, 2024 to an average rate of $13.68 per million dollars of covered sales for the nine months ended September 30, 2025, following a rate change effective May 2025 to $0 per million dollars of covered sales due to the SEC having collected its entire 2025 appropriated amount. Section 31 fees cost of revenues is directly offset by Section 31 regulatory fees revenue. \nRoyalty Fees and Other Cost of Revenues \nRoyalty fees and other cost of revenues increased for the three and nine months ended September 30, 2025 compared to the same periods in 2024 primarily due to an increase in trading volumes of licensed products in the Options segment, partially offset by a decrease in operating interest expense attributable to Cboe Clear Europe as a result of the changing interest rate environment and changes in the business.\nRevenues Less Cost of Revenues \nRevenues less cost of revenues increased $73.5 million, or 14%, and $210.1 million, or 14%, for the three and nine months ended September 30, 2025, respectively, compared to the same periods in 2024 primarily due to an increase in derivatives markets revenues less cost of revenues driven by an increase in volumes traded on the Cboe options exchanges, coupled with an increase in Data Vantage revenues less cost of revenues as a result of increased access and capacity fees and proprietary market data across segments and an increase in cash and spot markets revenues less cost of revenues driven by an increase in volumes traded on the Cboe European equities exchanges.\n66\nTable of Contents\nThe following summarizes the components of revenues less cost of revenues for the three and nine months ended September 30, 2025 compared to the three and nine months ended September 30, 2024 (in millions, except percentages):\nThree Months Ended\nSeptember 30,\nIncrease/\n(Decrease)\nPercent\nChange\n \nNine Months Ended\nSeptember 30,\nIncrease/\n(Decrease)\nPercent\nChange\n \n2025\n2024\n2025\n2024\nCash and spot markets\n$\n117.3 \n$\n103.3 \n$\n14.0 \n14 \n%\n$\n339.6 \n$\n304.3 \n$\n35.3 \n12 \n%\nData Vantage\n158.9 \n142.5 \n16.4 \n12 \n%\n463.4 \n419.8 \n43.6 \n10 \n%\nDerivatives markets\n329.3 \n286.2 \n43.1 \n15 \n%\n955.0 \n823.8 \n131.2 \n16 \n%\nTotal revenues less cost of revenues\n$\n605.5 \n$\n532.0 \n$\n73.5 \n14 \n%\n$\n1,758.0 \n$\n1,547.9 \n$\n210.1 \n14 \n%\nCash and Spot Markets\nCash and spot markets revenues less cost of revenues increased for the three months ended September 30, 2025 compared to the same period in 2024 primarily due to increases in transaction and clearing fees less liquidity payments and routing and clearing costs (“net transaction and clearing fees”) in the Europe and Asia Pacific and Global FX segments. Net transaction and clearing fees increased primarily due to a 26% increase in Cboe European equities matched ADNV, a 9% increase in Global FX net capture, and a 20% increase in Cboe Clear Europe net settlement volumes.\nCash and spot markets revenues less cost of revenues increased for the nine months ended September 30, 2025 compared to the same period in 2024 primarily due to increases in net transaction and clearing fees in the Europe and Asia Pacific and Global FX segments. Net transaction and clearing fees increased primarily due to a 36% increase in Cboe European equities matched ADNV, a 12% increase in Global FX ADNV, and a 22% increase in Cboe Clear Europe net settlement volumes, partially offset by a decrease in net transaction and clearing fees in the North American equities segment primarily due to a 40% decrease in U.S. Equities net capture.\nData Vantage \nData Vantage revenues less cost of revenues increased for the three and nine months ended September 30, 2025 compared to the same periods in 2024 primarily due to increases in access and capacity fees and proprietary market data fees. Access and capacity fees increased primarily due to increases in logical port fees and physical port fees in the Options, North American Equities, and Europe and Asia Pacific segments, driven by increased customer demand. Proprietary market data fees increased primarily due to increases in proprietary market data fees in the Options, Europe and Asia Pacific, and North American Equities segments.\nDerivatives Markets \nDerivatives markets revenues less cost of revenues increased for the three months ended September 30, 2025 compared to the same periods in 2024 primarily due to an increase in net transaction and clearing fees driven by a 31% increase in multi-listed options ADV and a 15% increase in index options ADV, partially offset by a decrease in net transaction and clearing fees in the Futures segment primarily due to a 27% decrease in ADV.\nDerivatives markets revenues less cost of revenues increased for the nine months ended September 30, 2025 compared to the same periods in 2024 primarily due to an increase in net transaction and clearing fees driven by a 26% increase in multi-listed options ADV and a 16% increase in index options ADV, partially offset by a decrease in net transaction and clearing fees in the Futures segment primarily due to an 11% decrease in ADV.\nOperating Expenses\nTotal operating expenses for the three months ended September 30, 2025 compared to the same period in 2024 increased $10.6 million, or 5%, primarily due to an increase in compensation and benefits. Total operating expenses for the nine months ended September 30, 2025 compared to the same period in 2024 decreased $53.3 million, or 7%, primarily due to the impairment of assets charge recorded to the Digital segment in the second quarter of 2024, coupled with a decrease in depreciation and amortization and other expenses, partially offset by an increase in compensation and benefits and the impairment of assets recorded related to the wind down of Cboe's Japanese equities business.\n67\nTable of Contents\nThe following summarizes changes in operating expenses for the three and nine months ended September 30, 2025 compared to the three and nine months ended September 30, 2024 (in millions, except percentages):\nThree Months Ended\nSeptember 30,\nIncrease/\n(Decrease)\nPercent\nChange\nNine Months Ended\nSeptember 30,\nIncrease/\n(Decrease)\nPercent\nChange\n2025\n2024\n2025\n2024\nCompensation and benefits\n$\n129.2 \n$\n119.1 \n$\n10.1 \n8 \n%\n$\n373.3 \n$\n350.5 \n$\n22.8 \n7 \n%\nDepreciation and amortization\n30.9 \n31.8 \n(0.9)\n(3)\n%\n91.1 \n100.9 \n(9.8)\n(10)\n%\nTechnology support services\n26.6 \n25.5 \n1.1 \n4 \n%\n78.9 \n74.3 \n4.6 \n6 \n%\nProfessional fees and outside services\n21.6 \n21.9 \n(0.3)\n(1)\n%\n67.2 \n69.2 \n(2.0)\n(3)\n%\nTravel and promotional expenses\n12.0 \n12.6 \n(0.6)\n(5)\n%\n26.6 \n29.4 \n(2.8)\n(10)\n%\nFacilities costs\n6.4 \n5.9 \n0.5 \n8 \n%\n19.6 \n18.5 \n1.1 \n6 \n%\nAcquisition-related costs\n0.2 \n— \n0.2 \n100 \n%\n0.4 \n1.2 \n(0.8)\n(67)\n%\nImpairment of assets\n4.5 \n— \n4.5 \n100 \n%\n21.6 \n81.0 \n(59.4)\n(73)\n%\nOther expenses\n3.8 \n7.8 \n(4.0)\n(51)\n%\n16.0 \n23.0 \n(7.0)\n(30)\n%\nTotal operating expenses\n$\n235.2 \n$\n224.6 \n$\n10.6 \n5 \n%\n$\n694.7 \n$\n748.0 \n$\n(53.3)\n(7)\n%\nCompensation and Benefits\nCompensation and benefits increased for the three months ended September 30, 2025 compared to the same period in 2024 primarily due to a $5.6 million increase in accrued bonuses as a result of strong Company performance, a $2.7 million increase in salaries and wages primarily due to merit increases, and a $1.2 million increase in equity compensation related to executive transitions, partially offset by a $1.6 million increase in capitalized wages as a result of an increase in internally developed software.\nCompensation and benefits increased for the nine months ended September 30, 2025 compared to the same period in 2024 primarily due to a $10.5 million increase in accrued bonuses as a result of strong Company performance, an $8.0 million increase in salaries and wages primarily due to merit increases, a $3.8 million increase in equity compensation related to executive transitions and a $2.6 million increase in benefits, partially offset by a $6.6 million increase in capitalized wages as a result of an increase in internally developed software.\nDepreciation and Amortization\nDepreciation and amortization decreased for the three and nine months ended September 30, 2025 compared to the same periods in 2024 primarily due to declines in amortization under the discounted cash flow method for the intangibles acquired in the Merger and monthly amortization for developed and existing technology ending or written down to zero since the third quarter of 2024.\nTechnology Support Services\nTechnology support services increased for the three and nine months ended September 30, 2025 compared to the same periods in 2024 due to increases in cloud services, data center hosting, market data, and hardware maintenance, partially offset by a decrease in purchased hardware.\nProfessional Fees and Outside Services\nProfessional fees and outside services decreased for the three months ended September 30, 2025 compared to the same period in 2024 primarily due to decreases in regulatory costs related to CAT expenses and consulting fees, partially offset by increases in legal fees and accounting fees.\nProfessional fees and outside services decreased for the nine months ended September 30, 2025 compared to the same period in 2024 primarily due to decreases in consulting fees and contract services, partially offset by increases in regulatory costs related to CAT expenses and accounting fees.\n68\nTable of Contents\nTravel and Promotional Expenses\nTravel and promotional expenses decreased for the three and nine months ended September 30, 2025 compared to the same periods in 2024 primarily due to decreases in marketing and advertising expenses related to the timing of the spend in the prior year versus the current year.\nFacilities Costs\nFacilities costs increased for the three and nine months ended September 30, 2025 compared to the same periods in 2024 primarily due to an increase in repairs and maintenance, partially offset by decreases in cleaning costs and services costs.\nAcquisition-Related Costs\nAcquisition-related costs increased for the three months ended September 30, 2025 compared to the same period in 2024 primarily due to increases in professional fees.\nAcquisition-related costs decreased for the nine months ended September 30, 2025 compared to the same period in 2024 primarily due to decreases in retention-related compensation costs associated with prior acquisitions and professional fees.\nImpairment of Assets\nImpairment of assets increased for the three months ended September 30, 2025 compared to the same period in 2024 primarily due to the impairment of Cboe Japan's assets of $4.5 million during the three months ended September 30, 2025 as a result of the wind down of the Company's Japanese equities business.\nImpairment of assets decreased for the nine months ended September 30, 2025, compared to the same period in 2024 primarily due to the impairment of assets of $81.0 million recognized in the former Digital segment during the nine months ended September 2024, partially offset by the impairment of Cboe Japan's assets of $21.6 million during the nine months ended September 30, 2025 as a result of the wind down of the Company's Japanese equities business.\nOther Expenses\nOther expenses decreased for the three months ended September 30, 2025 compared to the same period in 2024 primarily due to a decrease in bad debt expense. \nOther expenses decreased for the nine months ended September 30, 2025 compared to the same period in 2024 primarily due to a decrease in bad debt expense and a change in contingent consideration related to prior acquisitions recorded in 2024, which did not recur in 2025.\nOperating Income \nAs a result of the items above, operating income for the three months ended September 30, 2025 was $370.3 million, compared to operating income of $307.4 million for the three months ended September 30, 2024, an increase of $62.9 million. \nAs a result of the items above, operating income for the nine months ended September 30, 2025 was $1,063.3 million, compared to operating income of $799.9 million for the nine months ended September 30, 2024, an increase of $263.4 million.\nInterest Expense\nInterest expense increased for the three and nine months ended September 30, 2025 compared to the same periods in 2024 primarily due to an increase in Cboe Clear Europe commitment fees.\nInterest Income\nInterest income increased for the three months ended September 30, 2025 compared to the same period in 2024 primarily due to income from U.S. treasury bills as a result of additional investments of cash and cash equivalents.\n69\nTable of Contents\nInterest income increased for the nine months ended September 30, 2025 compared to the same period in 2024 primarily due to income from U.S. treasury bills as a result of additional investments of cash and cash equivalents coupled with increases in interest earned on higher cash and cash equivalents balances.\nEarnings on Investments, Net\nEarnings on investments, net increased for the three and nine months ended September 30, 2025 compared to the same periods in 2024 primarily due to a $45.6 million gain on the Company’s investment in 7Ridge Fund (which owns Trading Technologies) recorded in 2025 as a result of Trading Technologies' announcement of an investment transaction that would result in its sale to a third party, which is expected to close in the fourth quarter of 2025.\nOther Income (Expense), Net\nOther income (expense), net increased for the three months ended September 30, 2025 compared to the same period in 2024 primarily due to a $1.9 million increase in dividend income from the Company's minority ownership of Vest Group, Inc., coupled with a $1.2 million impairment charge for the Company's minority investment in StratiFi Technologies Inc. recorded in 2024, which did not recur in 2025.\nOther income (expense), net increased for the nine months ended September 30, 2025, compared to the same period in 2024 primarily due to a $16.0 million impairment recorded on the Company's minority investment in Globacap Technology Limited recorded in 2024, which did not recur in 2025.\nIncome Before Income Tax Provision\nAs a result of the above, income before income tax provision for the three months ended September 30, 2025 was $430.1 million, compared to income before income tax provision of $309.0 million for the three months ended September 30, 2024, an increase of $121.1 million.\nAs a result of the above, income before income tax provision for the nine months ended September 30, 2025 was $1,114.9 million, compared to income before income tax provision of $804.1 million for the nine months ended September 30, 2024, an increase of $310.8 million.\nIncome Tax Provision\nThe effective tax rate from continuing operations was 30.1% and 29.3% for the three months ended September 30, 2025 and 2024, respectively, and 29.5% and 29.3% for the nine months ended September 30, 2025 and 2024, respectively. The higher effective tax rate for each of the three and nine months ended September 30, 2025 was primarily due to the recognition of uncertain tax positions.\nNet Income\nAs a result of the items above, net income for the three months ended September 30, 2025 was $300.8 million, compared to net income of $218.5 million for the three months ended September 30, 2024, an increase of $82.3 million.\nAs a result of the items above, net income for the nine months ended September 30, 2025 was $786.5 million, compared to net income of $568.4 million for the nine months ended September 30, 2024, an increase of $218.1 million.\n70\nTable of Contents\nSegment Operating Results\nThe Company previously operated six reportable business segments as of December 31, 2024. As of January 1, 2025, we report results from our five segments: Options, North American Equities, Europe and Asia Pacific, Futures, and Global FX. Segment performance is primarily based on operating income. We have aggregated all corporate costs, as well as other business ventures, within Corporate Items and Eliminations as those activities should not be used to evaluate a segment’s operating performance. All operating expenses that relate to activities of a specific segment have been allocated to that segment.\nThe following summarizes our total revenues by segment (in millions, except percentages):\nNote, the chart excludes Digital revenues of $(0.2) million for the nine months ended September 30, 2024.\nThree Months Ended\nSeptember 30,\nPercent\nChange\nPercentage\nof Total\nRevenues\nNine Months Ended\nSeptember 30,\nPercent\nChange\nPercentage\nof Total\nRevenues\nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n2025\n2024\n2025\n2024\n2025\n2024\n2025\n2024\nOptions\n$\n616.0 \n$\n510.3 \n21 \n%\n54 \n%\n48 \n%\n$\n1,776.4 \n$\n1,470.0 \n21 \n%\n51 \n%\n49 \n%\nNorth American Equities\n377.8 \n403.6 \n(6)\n%\n33 \n%\n38 \n%\n1,279.7 \n1,106.5 \n16 \n%\n36 \n%\n37 \n%\nEurope and Asia Pacific\n92.8 \n81.1 \n14 \n%\n8 \n%\n8 \n%\n284.9 \n243.4 \n17 \n%\n8 \n%\n8 \n%\nFutures\n32.0 \n39.9 \n(20)\n%\n3 \n%\n4 \n%\n99.8 \n107.2 \n(7)\n%\n3 \n%\n4 \n%\nGlobal FX\n23.1 \n20.7 \n12 \n%\n2 \n%\n2 \n%\n69.4 \n60.0 \n16 \n%\n2 \n%\n2 \n%\nDigital (1)\n— \n0.1 \n(100)\n%\n— \n%\n*%\n— \n(0.2)\n100 \n%\n— \n%\n*%\nTotal revenues\n$\n1,141.7 \n$\n1,055.7 \n8 \n%\n100 \n%\n100 \n%\n$\n3,510.2 \n$\n2,986.9 \n18 \n%\n100 \n%\n100 \n%\n___________________________\n*Not meaningful\n(1)\nThe Digital segment results are prospectively included in the Futures segment beginning in the first quarter of 2025. Digital results from 2024 have been retained in the former Digital segment for comparative purposes. See Note 1 (“Organization and Basis of Presentation”) for additional information.\n71\nTable of Contents\nThe following summarizes our revenues less cost of revenues by segment (in millions, except percentages):\nNote, the chart excludes Digital revenues less cost of revenues of $(1.5) million for the nine months ended September 30, 2024.\nPercent\nChange\nPercentage of\nTotal Revenues \nLess Cost of Revenues\nPercent\nChange\nPercentage of \nTotal Revenues \nLess Cost of Revenues\nThree Months Ended\nSeptember 30,\nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n2025\n2024\n2025\n2024\n2025\n2024\n2025\n2024\nOptions\n$\n380.8 \n$\n320.9 \n19 \n%\n63 \n%\n60 \n%\n$\n1,098.0 \n$\n935.0 \n17 \n%\n62 \n%\n60 \n%\nNorth American Equities\n103.5 \n98.0 \n6 \n%\n17 \n%\n18 \n%\n296.5 \n288.9 \n3 \n%\n17 \n%\n19 \n%\nEurope and Asia Pacific\n69.1 \n55.6 \n24 \n%\n11 \n%\n11 \n%\n203.6 \n164.0 \n24 \n%\n12 \n%\n10 \n%\nFutures\n29.6 \n38.0 \n(22)\n%\n5 \n%\n7 \n%\n92.5 \n103.3 \n(10)\n%\n5 \n%\n7 \n%\nGlobal FX\n22.5 \n20.0 \n13 \n%\n4 \n%\n4 \n%\n67.4 \n58.2 \n16 \n%\n4 \n%\n4 \n%\nDigital (1)\n— \n(0.5)\n100 \n%\n— \n%\n*%\n— \n(1.5)\n100 \n%\n— \n%\n*%\nTotal revenues less cost of revenues\n$\n605.5 \n$\n532.0 \n14 \n%\n100 \n%\n100 \n%\n$\n1,758.0 \n$\n1,547.9 \n14 \n%\n100 \n%\n100 \n%\n___________________________\n*Not meaningful\n(1)\nThe Digital segment results are prospectively included in the Futures segment beginning in the first quarter of 2025. Digital results from 2024 have been retained in the former Digital segment for comparative purposes. See Note 1 (“Organization and Basis of Presentation”) for additional information.\n72\nTable of Contents\nOptions\nThe following summarizes revenues less cost of revenues, operating expenses, operating income, operating margin, EBITDA, and EBITDA margin for our Options segment (in millions, except percentages):\nThree Months Ended\nSeptember 30,\nPercent\nChange\nPercentage \nof Total \nRevenues\nNine Months Ended\nSeptember 30,\nPercent\nChange\nPercentage\nof Total\nRevenues\nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n2025\n2024\n2025\n2024\n2025\n2024\n2025\n2024\nRevenues less cost of revenues\n$\n380.8 \n$\n320.9 \n19 \n%\n62 \n%\n63 \n%\n$\n1,098.0 \n$\n935.0 \n17 \n%\n62 \n%\n64 \n%\nOperating expenses\n106.4 \n99.7 \n7 \n%\n17 \n%\n20 \n%\n305.8 \n281.4 \n9 \n%\n17 \n%\n19 \n%\nOperating income\n$\n274.4 \n$\n221.2 \n24 \n%\n45 \n%\n43 \n%\n$\n792.2 \n$\n653.6 \n21 \n%\n45 \n%\n44 \n%\nOperating margin\n72.1 \n%\n68.9 \n%\n*\n*\n*\n72.1 \n%\n69.9 \n%\n*\n*\n*\nEBITDA (1)\n$\n280.9 \n$\n226.5 \n24 \n%\n46 \n%\n44 \n%\n$\n808.6 \n$\n670.8 \n21 \n%\n46 \n%\n46 \n%\nEBITDA margin (2)\n73.8 \n%\n70.6 \n%\n*\n*\n*\n73.6 \n%\n71.7 \n%\n*\n*\n*\n___________________________\n*Not meaningful\n(1)\nSee footnote (1) to the table under “Financial Summary” above for a reconciliation of net income to EBITDA, and management’s reasons for using such non-GAAP measures.\n(2)\nEBITDA margin represents EBITDA divided by revenues less cost of revenues.\nRevenues less cost of revenues increased $59.9 million for the three months ended September 30, 2025 compared to the three months ended September 30, 2024 primarily due to an increase in net transaction and clearing fees driven by a 31% increase in multi-listed options ADV and a 15% increase in index options ADV. For the three months ended September 30, 2025, operating income for the Options segment increased $53.2 million compared to the three months ended September 30, 2024 primarily due to an increase in revenues less cost of revenues, partially offset by an increase in operating expenses. Operating expenses increased $6.7 million for the three months ended September 30, 2025 compared to the three months ended September 30, 2024 primarily due to an increase in compensation and benefits.\nRevenues less cost of revenues increased $163.0 million for the nine months ended September 30, 2025 compared to the nine months ended September 30, 2024 primarily due to an increase in net transaction and clearing fees driven by a 26% increase in multi-listed options ADV and a 16% increase in index options ADV. For the nine months ended September 30, 2025, operating income for the Options segment increased $138.6 million compared to the nine months ended September 30, 2024 primarily due to an increase in revenues less cost of revenues, partially offset by an increase in operating expenses. Operating expenses increased $24.4 million for the nine months ended September 30, 2025 compared to the nine months ended September 30, 2024 primarily due to increases in compensation and benefits and technology support services.\nNorth American Equities\nThe following summarizes revenues less cost of revenues, operating expenses, operating income, operating margin, EBITDA, and EBITDA margin for our North American Equities segment (in millions, except percentages):\nThree Months Ended\nSeptember 30,\nPercent\nChange\nPercentage \nof Total \nRevenues\nNine Months Ended\nSeptember 30,\nPercent\nChange\nPercentage \nof Total \nRevenues\nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n2025\n2024\n2025\n2024\n2025\n2024\n2025\n2024\nRevenues less cost of revenues\n$\n103.5 \n$\n98.0 \n6 \n%\n27 \n%\n24 \n%\n$\n296.5 \n$\n288.9 \n3 \n%\n23 \n%\n26 \n%\nOperating expenses\n50.0 \n53.9 \n(7)\n%\n13 \n%\n13 \n%\n151.3 \n161.5 \n(6)\n%\n12 \n%\n15 \n%\nOperating income\n$\n53.5 \n$\n44.1 \n21 \n%\n14 \n%\n11 \n%\n$\n145.2 \n$\n127.4 \n14 \n%\n11 \n%\n12 \n%\nOperating margin\n51.7 \n%\n45.0 \n%\n*\n*\n*\n49.0 \n%\n44.1 \n%\n*\n*\n*\nEBITDA (1)\n$\n65.5 \n$\n58.0 \n13 \n%\n17 \n%\n14 \n%\n$\n179.7 \n$\n171.1 \n5 \n%\n14 \n%\n15 \n%\nEBITDA margin (2)\n63.3 \n%\n59.2 \n%\n*\n*\n*\n60.6 \n%\n59.2 \n%\n*\n*\n*\n___________________________\n*Not meaningful\n(1)\nSee footnote (1) to the table under “Financial Summary” above for a reconciliation of net income to EBITDA, and management’s reasons for using such non-GAAP measures.\n(2)\nEBITDA margin represents EBITDA divided by revenues less cost of revenues.\nRevenues less cost of revenues increased $5.5 million for the three months ended September 30, 2025 compared to the three months ended September 30, 2024 primarily due to an increase in access and capacity fees and market data revenue. For the three months ended September 30, 2025, operating income for the North American Equities segment increased $9.4 million compared to the three months ended September 30, 2024 primarily due to an increase in revenues \n73\nTable of Contents\nless cost of revenues, coupled with a decrease in operating expenses. Operating expenses decreased $3.9 million for the three months ended September 30, 2025 compared to the three months ended September 30, 2024 primarily due to decreases in depreciation and amortization and technology support services.\nRevenues less cost of revenues increased $7.6 million for the nine months ended September 30, 2025 compared to the nine months ended September 30, 2024 primarily due to an increase in access and capacity fees and market data revenue, partially offset by a decrease in net transaction and clearing fees driven by a 40% decrease in U.S. Equities net capture. For the nine months ended September 30, 2025, operating income for the North American Equities segment increased $17.8 million compared to the nine months ended September 30, 2024 primarily due to a decrease in operating expenses, coupled with an increase in revenues less cost of revenues. Operating expenses decreased $10.2 million for the nine months ended September 30, 2025 compared to the nine months ended September 30, 2024 primarily due to a decrease in depreciation and amortization.\nEurope and Asia Pacific\nThe following summarizes revenues less cost of revenues, operating expenses, operating income, operating margin, EBITDA, and EBITDA margin for our Europe and Asia Pacific segment (in millions, except percentages):\nThree Months Ended\nSeptember 30,\nPercent\nChange\nPercentage\nof Total\nRevenues\nNine Months Ended\nSeptember 30,\nPercent\nChange\nPercentage\nof Total \nRevenues\nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n2025\n2024\n2025\n2024\n2025\n2024\n2025\n2024\nRevenues less cost of revenues\n$\n69.1 \n$\n55.6 \n24 \n%\n74 \n%\n69 \n%\n$\n203.6 \n$\n164.0 \n24 \n%\n71 \n%\n67 \n%\nOperating expenses\n52.7 \n44.3 \n19 \n%\n57 \n%\n55 \n%\n160.4 \n133.3 \n20 \n%\n56 \n%\n55 \n%\nOperating income\n$\n16.4 \n$\n11.3 \n45 \n%\n18 \n%\n14 \n%\n$\n43.2 \n$\n30.7 \n41 \n%\n15 \n%\n13 \n%\nOperating margin\n23.7 \n%\n20.3 \n%\n*\n*\n*\n21.2 \n%\n18.7 \n%\n*\n*\n*\nEBITDA (1)\n$\n25.9 \n$\n18.7 \n39 \n%\n28 \n%\n23 \n%\n$\n68.3 \n$\n52.1 \n31 \n%\n24 \n%\n21 \n%\nEBITDA margin (2)\n37.5 \n%\n33.6 \n%\n*\n*\n*\n33.5 \n%\n31.8 \n%\n*\n*\n*\n___________________________\n*Not meaningful\n(1)\nSee footnote (1) to the table under “Financial Summary” above for a reconciliation of net income to EBITDA, and management’s reasons for using such non-GAAP measures.\n(2)\nEBITDA margin represents EBITDA divided by revenues less cost of revenues.\nRevenues less cost of revenues increased $13.5 million for the three months ended September 30, 2025 compared to the three months ended September 30, 2024 primarily due to an increase in net transaction and clearing fees driven by a 26% increase in Cboe European Equities matched ADNV, coupled with a 20% increase in Cboe Clear Europe net settlement volumes. For the three months ended September 30, 2025, operating income for the Europe and Asia Pacific segment increased $5.1 million compared to the three months ended September 30, 2024 primarily due to an increase in revenues less cost of revenues, partially offset by an increase in operating expenses. Operating expenses increased $8.4 million for the three months ended September 30, 2025 compared to the three months ended September 30, 2024 primarily due to increases in impairment of Cboe Japan's assets, and compensation and benefits.\nRevenues less cost of revenues increased $39.6 million for the nine months ended September 30, 2025 compared to the nine months ended September 30, 2024 primarily due to an increase in net transaction and clearing fees driven by a 36% increase in Cboe European Equities matched ADNV, coupled with a 22% increase in Cboe Clear Europe net settlement volumes. For the nine months ended September 30, 2025, operating income for the Europe and Asia Pacific segment increased $12.5 million compared to the nine months ended September 30, 2024 primarily due to an increase in revenues less cost of revenues, partially offset by an increase in operating expenses. Operating expenses increased $27.1 million for the nine months ended September 30, 2025 compared to the nine months ended September 30, 2024 primarily due to increases in impairment of Cboe Japan's assets, and compensation and benefits.\n74\nTable of Contents\nFutures\nThe following summarizes revenues less cost of revenues, operating expenses, operating income, operating margin, EBITDA, and EBITDA margin for our Futures segment (in millions, except percentages):\nThree Months Ended\nSeptember 30,\nPercent\nChange\nPercentage\nof Total\nRevenues\nNine Months Ended\nSeptember 30,\nPercent\nChange\nPercentage\nof Total\nRevenues\nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n2025\n2024\n2025\n2024\n2025\n2024\n2025\n2024\nRevenues less cost of revenues\n$\n29.6 \n$\n38.0 \n(22)\n%\n93 \n%\n95 \n%\n$\n92.5 \n$\n103.3 \n(10)\n%\n93 \n%\n96 \n%\nOperating expenses\n12.8 \n8.6 \n49 \n%\n40 \n%\n22 \n%\n38.0 \n25.5 \n49 \n%\n38 \n%\n24 \n%\nOperating income\n$\n16.8 \n$\n29.4 \n(43)\n%\n53 \n%\n74 \n%\n$\n54.5 \n$\n77.8 \n(30)\n%\n55 \n%\n73 \n%\nOperating margin\n56.8 \n%\n77.4 \n%\n*\n*\n*\n58.9 \n%\n75.3 \n%\n*\n*\n*\nEBITDA (1)\n$\n17.3 \n$\n29.9 \n(42)\n%\n54 \n%\n75 \n%\n$\n55.9 \n$\n79.3 \n(30)\n%\n56 \n%\n74 \n%\nEBITDA margin (2)\n58.4 \n%\n78.7 \n%\n*\n*\n*\n60.4 \n%\n76.8 \n%\n*\n*\n*\n___________________________\n*Not meaningful\n(1)\nSee footnote (1) to the table under “Financial Summary” above for a reconciliation of net income to EBITDA, and management’s reasons for using such non-GAAP measures.\n(2)\nEBITDA margin represents EBITDA divided by revenues less cost of revenues.\nRevenues less cost of revenues decreased $8.4 million for the three months ended September 30, 2025 compared to the three months ended September 30, 2024 primarily due to a decrease in net transaction and clearing fees as a result of a 27% decrease in ADV. For the three months ended September 30, 2025, operating income for the Futures segment decreased $12.6 million compared to the three months ended September 30, 2024 primarily due to a decrease in revenues less cost of revenues, coupled with an increase in operating expenses. Operating expenses increased $4.2 million for the three months ended September 30, 2025 compared to the three months ended September 30, 2024 primarily due to increases in compensation and benefits, professional fees and outside services, and travel and promotional expenses, due, in part, to the Digital results being prospectively included in the Futures segment beginning in the first quarter of 2025.\nRevenues less cost of revenues decreased $10.8 million for the nine months ended September 30, 2025 compared to the nine months ended September 30, 2024 primarily due to a decrease in net transaction and clearing fees as a result of an 11% decrease in ADV. For the nine months ended September 30, 2025, operating income for the Futures segment decreased $23.3 million compared to the nine months ended September 30, 2024 primarily due to an increase in operating expenses, coupled with a decrease in revenues less cost of revenues. Operating expenses increased $12.5 million for the nine months ended September 30, 2025 compared to the nine months ended September 30, 2024 primarily due to increases in compensation and benefits, professional fees and outside services, and technology support services, due, in part, to the Digital results being prospectively included in the Futures segment beginning in the first quarter of 2025.\nGlobal FX\nThe following summarizes revenues less cost of revenues, operating expenses, operating income, operating margin, EBITDA, and EBITDA margin for our Global FX segment (in millions, except percentages):\nThree Months Ended\nSeptember 30,\nPercent\nChange\nPercentage\nof Total\nRevenues\nNine Months Ended\nSeptember 30,\nPercent\nChange\nPercentage\nof Total\nRevenues\nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n2025\n2024\n2025\n2024\n2025\n2024\n2025\n2024\nRevenues less cost of revenues\n$\n22.5 \n$\n20.0 \n13 \n%\n97 \n%\n97 \n%\n$\n67.4 \n$\n58.2 \n16 \n%\n97 \n%\n97 \n%\nOperating expenses\n11.0 \n10.8 \n2 \n%\n48 \n%\n52 \n%\n33.1 \n33.2 \n0 \n%\n48 \n%\n55 \n%\nOperating income\n$\n11.5 \n$\n9.2 \n25 \n%\n50 \n%\n44 \n%\n$\n34.3 \n$\n25.0 \n37 \n%\n49 \n%\n42 \n%\nOperating margin\n51.1 \n%\n46.0 \n%\n*\n*\n*\n50.9 \n%\n43.0 \n%\n*\n*\n*\nEBITDA (1)\n$\n14.2 \n$\n12.3 \n15 \n%\n61 \n%\n59 \n%\n$\n42.6 \n$\n35.3 \n21 \n%\n61 \n%\n59 \n%\nEBITDA margin (2)\n63.1 \n%\n61.5 \n%\n*\n*\n*\n63.2 \n%\n60.7 \n%\n*\n*\n*\n___________________________\n*Not meaningful\n(1)\nSee footnote (1) to the table under “Financial Summary” above for a reconciliation of net income to EBITDA, and management’s reasons for using such non-GAAP measures.\n(2)\nEBITDA margin represents EBITDA divided by revenues less cost of revenues.\nRevenues less cost of revenues increased $2.5 million for the three months ended September 30, 2025 compared to the three months ended September 30, 2024 primarily due to an increase in net transaction and clearing fees driven by a 9% increase in net capture. For the three months ended September 30, 2025, operating income for the Global FX segment \n75\nTable of Contents\nincreased $2.3 million compared to the three months ended September 30, 2024 primarily due to an increase in revenues less cost of revenues, partially offset by an increase in operating expenses. Operating expenses increased $0.2 million for the three months ended September 30, 2025 compared to the three months ended September 30, 2024 primarily due to an increase in compensation and benefits, partially offset by a decrease in depreciation and amortization.\nRevenues less cost of revenues increased $9.2 million for the nine months ended September 30, 2025 compared to the nine months ended September 30, 2024 primarily due to an increase in net transaction and clearing fees driven by a 12% increase in ADNV. For the nine months ended September 30, 2025, operating income for the Global FX segment increased $9.3 million compared to the nine months ended September 30, 2024 primarily due to an increase in revenues less cost of revenues, coupled with a decrease in operating expenses. Operating expenses decreased $0.1 million for the nine months ended September 30, 2025 compared to the nine months ended September 30, 2024 primarily due to a decrease in depreciation and amortization, partially offset by an increase in compensation and benefits.\nDigital\nThe following summarizes revenues less cost of revenues, operating expenses, operating loss, operating margin, EBITDA, and EBITDA margin for the former Digital segment for the three and nine months ended September 30, 2024 (in millions, except percentages) for the purposes of providing comparative information. The Digital segment results are prospectively included in the Futures segment beginning in the first quarter of 2025. See Note 1 (“Organization and Basis of Presentation”) for additional information:\nThree Months Ended\nSeptember 30,\nPercent\nChange\nPercentage\nof Total\nRevenues\nNine Months Ended\nSeptember 30,\nPercent\nChange\nPercentage\nof Total\nRevenues\nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n2025\n2024\n2025\n2024\n2025\n2024\n2025\n2024\nRevenues less cost of revenues\n$\n— \n$\n(0.5)\n*%\n*%\n*%\n$\n— \n$\n(1.5)\n*%\n*%\n*%\nOperating expenses\n— \n5.7 \n*%\n*%\n*%\n— \n105.2 \n*%\n*%\n*%\nOperating loss\n$\n— \n$\n(6.2)\n*%\n*%\n*%\n$\n— \n$\n(106.7)\n*%\n*%\n*%\nOperating margin\n— \n%\n*%\n*\n*\n*\n— \n%\n*%\n*\n*\n*\nEBITDA (1)\n$\n— \n$\n(6.0)\n*%\n*%\n*%\n$\n— \n$\n(102.0)\n*%\n*%\n*%\nEBITDA margin (2)\n— \n%\n*%\n*\n*\n*\n— \n%\n*%\n*\n*\n*\n___________________________\n*Not meaningful\n(1)\nSee footnote (1) to the table under “Financial Summary” above for a reconciliation of net income to EBITDA, and management’s reasons for using such non-GAAP measures.\n(2)\nEBITDA margin represents EBITDA divided by revenues less cost of revenues.\n76\nTable of Contents\nLiquidity and Capital Resources\nBelow are charts that reflect elements of our capital allocation. “YTD” represents the nine month periods ended September 30, 2025 and 2024, respectively:\nWe expect our cash on hand at September 30, 2025 and other available resources, including cash generated from operations, to be sufficient to continue to meet our cash requirements for the foreseeable future. In the near term, we expect that our cash from operations and availability under the Revolving Credit Facility and potentially participating in future financing transactions to obtain additional capital will meet our cash needs to fund our operations, capital expenditures, interest payments on debt, any dividends, potential strategic acquisitions, to cover any adjustments arising from tax examinations, and opportunities for common stock repurchases under the previously announced program. See Note 10 (“Debt”) of the condensed consolidated financial statements for further information.\nCboe Clear Europe also has a €1.20 billion committed syndicated multicurrency revolving and swingline credit facility agreement with Cboe Clear Europe as borrower and the Company as guarantor of scheduled interest and fees on borrowings (but not the principal amount of any borrowings) (the “Facility”). The Facility is available to be drawn by Cboe Clear Europe towards (a) financing unsettled amounts in connection with the settlement of transactions in securities and other items processed through Cboe Clear Europe’s clearing system and (b) financing any other liability or liquidity requirement of Cboe Clear Europe incurred in the operation of its clearing system. Borrowings under the Facility are secured by cash, eligible bonds and eligible equity assets deposited by Cboe Clear Europe into secured accounts. As a result, should the Facility be drawn by Cboe Clear Europe it could potentially impact Cboe Clear Europe’s liquidity, and we can give no assurance that this Facility will be sufficient to meet all of such obligations or sufficiently mitigate Cboe Clear Europe’s liquidity risk to meet its payment obligations when due. Additionally, a default of the Facility may allow lenders, under certain circumstances, to accelerate any related drawn amounts and may result in the acceleration of the Company’s other outstanding debt to which a cross-acceleration or cross-default provision applies, which may limit the Company’s liquidity, business, and financing activities. The Facility is expected to terminate on June 26, 2026 and we may not be able to enter into a replacement facility on commercially reasonable terms, or at all. Please refer to Note 10 (“Debt”) for further information.\nOur long-term cash needs will depend on many factors, including an introduction of new products, enhancements of current products, capital needs of our subsidiaries, the geographic mix of our business and any potential acquisitions. We believe our cash from operations and the availability under our Revolving Credit Facility will meet any long-term needs unless a significant acquisition or acquisitions are identified, in which case we expect that we would be able to borrow the necessary funds and/or issue additional shares of our common stock to complete such acquisition(s).\nCash and cash equivalents includes cash in banks and all non-restricted, highly liquid investments, including short-term repurchase agreements and money market funds, with original maturities of three months or less at the time of purchase. Cash and cash equivalents as of September 30, 2025 increased $576.4 million from December 31, 2024 primarily due to inflows from the results of operations and the net proceeds from available-for-sale financial investments, partially offset by \n77\nTable of Contents\ncash dividends on common stock, the change in Section 31 fees payable, and purchases of available-for-sale financial investments. See “Cash Flow” below for further discussion.\nOur cash and cash equivalents held outside of the United States in various foreign subsidiaries totaled $274.1 million as of September 30, 2025. The remaining balance was held in the United States and totaled $1,222.6 million as of September 30, 2025. The majority of cash held outside the United States is available for repatriation, but under current law, could subject us to additional United States and foreign income taxes, less applicable foreign tax credits.\nOur financial investments include deferred compensation plan assets, as well as investments with original or acquired maturities longer than three months, that mature in less than one year from the balance sheet date and are recorded at fair value. As of September 30, 2025 and December 31, 2024, financial investments primarily consisted of U.S. Treasury securities and deferred compensation plan assets. \nCash Flow \nThe following table summarizes our cash flow data for the nine months ended September 30, 2025 and 2024, respectively (in millions):\nNine Months Ended\nSeptember 30,\n2025\n2024\nNet cash provided by operating activities\n$\n1,400.5 \n$\n1,811.0 \nNet cash provided by (used in) investing activities\n30.9 \n(15.0)\nNet cash used in financing activities\n(294.1)\n(424.3)\nEffect of foreign currency exchange rate changes on cash, cash equivalents, and restricted cash and cash equivalents\n266.9 \n33.4 \nIncrease in cash, cash equivalents, and restricted cash and cash equivalents\n$\n1,404.2 \n$\n1,405.1 \nAs of September 30,\n2025\n2024\nReconciliation of cash, cash equivalents, and restricted cash and cash equivalents:\nCash and cash equivalents\n$\n1,496.7 \n$\n757.8 \nRestricted cash and cash equivalents (included in margin deposits, clearing funds, and interoperability funds)\n1,639.8 \n2,033.5 \nRestricted cash and cash equivalents (included in other current assets)\n32.5 \n— \nRestricted cash and cash equivalents (included in cash and cash equivalents)\n— \n5.4 \nCustomer bank deposits (included in margin deposits, clearing funds, and interoperability funds)\n1.0 \n5.5 \nTotal\n$\n3,170.0 \n$\n2,802.2 \nNet Cash Flows Provided by Operating Activities\nDuring the nine months ended September 30, 2025, net cash provided by operating activities was $614.0 million higher than net income. The variance is primarily attributable to the change in margin deposits, clearing funds, and interoperability funds related to Cboe Clear Europe of $554.2 million, depreciation and amortization of $91.1 million, the change in unrecognized tax benefits of $60.4 million, the change in income taxes receivable of $40.3 million, and stock-based compensation expense of $38.7 million, partially offset by the change in the Section 31 fees payable of $181.8 million for the nine months ended September 30, 2025.\nNet cash flows provided by operating activities were $1,400.5 million and $1,811.0 million for the nine months ended September 30, 2025 and 2024, respectively. The change in net cash flows provided by operating activities was primarily due to the change in the margin deposits, clearing funds, and interoperability funds related to Cboe Clear Europe, the change in Section 31 fees payable, and the change in impairment of assets, partially offset by an increase in net income, the change in \n78\nTable of Contents\naccounts payable and accrued liabilities, and the change in accounts receivable for the nine months ended September 30, 2025 compared to the nine months ended September 30, 2024.\nNet Cash Flows Provided by (Used in) Investing Activities\nNet cash flows provided by (used in) investing activities were $30.9 million and $(15.0) million for the nine months ended September 30, 2025 and 2024, respectively. The variance is primarily due to an increase in the proceeds from maturities of available-for-sale financial investments, partially offset by increases in the purchases of available-for-sale financial investments and the purchases of property and equipment and leasehold improvements, net for the nine months ended September 30, 2025 compared to the nine months ended September 30, 2024.\nNet Cash Flows Used in Financing Activities\nNet cash flows used in financing activities were $294.1 million and $424.3 million for the nine months ended September 30, 2025 and 2024, respectively. \nThe variance is primarily attributable to decreases in purchases of common stock and payments of contingent consideration related to prior acquisitions, partially offset by the increase in cash dividends on common stock for the \nnine months ended September 30, 2025\n compared to the \nnine months ended September 30, 2024. \nFinancial Assets\nThe following summarizes our financial assets, excluding margin deposits, clearing funds, and interoperability funds as of September 30, 2025 and December 31, 2024 (in millions):\nSeptember 30,\n2025\nDecember 31,\n2024\nCash and cash equivalents\n$\n1,496.7 \n$\n920.3 \nFinancial investments\n34.2 \n110.3 \nLess deferred compensation plan assets\n(33.9)\n(40.3)\nLess cash collected for Section 31 fees\n— \n(110.8)\nAdjusted cash (1)\n$\n1,497.0 \n$\n879.5 \n___________________________\n(1)\nAdjusted cash is a non-GAAP measure and represents cash and cash equivalents plus financial investments, minus deferred compensation plan assets and cash collected for Section 31 fees. We have presented adjusted cash because we consider it an important supplemental measure of our liquidity and believe that it is frequently used by analysts, investors, and other interested parties in the evaluation of companies.\nDebt \nThe following summarizes our debt obligations as of September 30, 2025 and December 31, 2024 (in millions):\nSeptember 30,\n2025\nDecember 31,\n2024\n3.650% Senior Notes\n$\n650.0 \n$\n650.0 \n1.625% Senior Notes\n500.0 \n500.0 \n3.000% Senior Notes\n300.0 \n300.0 \nRevolving Credit Agreement\n— \n— \nCboe Clear Europe Credit Facility\n— \n— \nLess unamortized discount and debt issuance costs\n(7.6)\n(9.0)\nTotal debt\n$\n1,442.4 \n$\n1,441.0 \nAs of September 30, 2025 and December 31, 2024, the Company was in compliance with the covenants of our debt agreements.\nIn addition to the debt outstanding, as of September 30, 2025, we had an additional $400.0 million available through our revolving credit facility, with the ability to borrow another $200.0 million by increasing the commitments under the facility, subject to the agreement of the applicable lenders. Together with adjusted cash, we had approximately $1.9 billion available to fund our operations, capital expenditures, potential acquisitions, debt repayments, and any dividends, net of minimum regulatory capital requirements of $195.2 million as of September 30, 2025, which are subject to potential applicable regulatory restrictions and approvals and potential associated tax costs.\n79\nTable of Contents\nDividends\nThe Company’s expectation is to continue to pay dividends. The decision to pay a dividend, however, remains within the discretion of the Company's Board of Directors and may be affected by various factors, including our earnings, financial condition, capital requirements, level of indebtedness, and other considerations our Board of Directors deems relevant. Future debt obligations and statutory provisions, among other things, may limit, or in some cases prohibit, our ability to pay dividends. \nShare Repurchase Program \nIn 2011, the Board of Directors approved an initial authorization for the Company to repurchase shares of its outstanding common stock of $100 million and subsequently approved additional authorizations for a total authorization of $2.3 billion. The program permits the Company to purchase shares through a variety of methods, including in the open market or through privately negotiated transactions, in accordance with applicable securities laws. It does not obligate the Company to make any repurchases at any specific time or situation. Share repurchases are repurchased to the Company’s treasury stock and ultimately retired or they are available to be redistributed.\nThe Company did not repurchase shares under the Company's share repurchase program during the three months ended September 30, 2025. Since inception of the program through September 30, 2025, the Company has repurchased 21,063,700 shares of common stock at an average cost per share of $80.02, for a total value of $1.7 billion.\nAs of September 30, 2025, the Company had $614.5 million of availability remaining under its existing share repurchase authorizations. \nCommercial Commitments and Contractual Obligations\nAs of September 30, 2025, our commercial commitments and contractual obligations included operating leases, data and telecommunications agreements, equipment leases, our long-term debt outstanding, contingent considerations, software development activities and other obligations. See Note 21 (“Commitments, Contingencies, and Guarantees”) to the condensed consolidated financial statements for a discussion of commitments and contingencies, Note 10 (“Debt”) for a discussion of the outstanding debt, Note 12 (“Clearing Operations”) for information on Cboe Clear Europe's and Cboe Clear U.S.’s clearinghouse exposure guarantees, and Note 22 (“Leases”) for discussion on operating leases and equipment leases.\nGuarantees\nWe use Wedbush and Morgan Stanley to clear our routed equities transactions for the Cboe U.S. equity exchanges. Wedbush and Morgan Stanley guarantee the trade until the trade has been submitted to and validated by the National Securities Clearing Corporation (“NSCC”), after which time NSCC provides a guarantee until the trade settles. Thus, Cboe Trading is potentially exposed to credit risk to the counterparty to an equity trade routed to another market center until the trade has been processed and validated by the NSCC on the trade date. The BIDS Trading ATS platform delivers matched trades to BofA Securities, Inc. (“BOA”), which delivers the matched trades to the NSCC. BOA guarantees the trade until one day after the trade date, after which time the NSCC provides a guarantee until the trade settles. In the case of failure to perform on the part of Wedbush or Morgan Stanley on routed transactions for the Cboe U.S. equity exchanges, we provide the guarantee to the counterparty to the trader. In the case of failure to perform on the part of BOA on transactions for the BIDS Trading ATS platform, BIDS has obligations to the counterparties to satisfy the trades. \nOCC acts as a central counterparty on all transactions in listed equity options in our Options segment, and as such, guarantees clearance and settlement of all of our options transactions. We believe that any potential requirement for us to make payments under these guarantees is remote and accordingly, have not recorded any liability in the condensed consolidated financial statements for these guarantees. Similarly, with respect to trades in U.S. listed equity options occurring on Cboe Options, C2, BZX, and EDGX, and to trades in CFE futures products cleared by OCC, we deliver matched trades of our customers to the OCC, which acts as a central counterparty for these transactions and, as such, guarantees clearance and settlement of these matched options and futures trades. With respect to U.S. government securities transactions executed on Cboe Fixed Income, we use Mirae Asset Securities (USA) Inc. to deliver matched trades to the Fixed Income Clearing Corporation (\"FICC\") Government Securities Division (\"GSD\"), which acts as a central counterparty on all transactions occurring on Cboe Fixed Income and, as such, guarantees clearance and settlement of all of those matched trades. \nWith respect to Canadian equities, we deliver matched trades of our customers to The Canadian Depository for Securities, which acts as a central counterparty on all transactions occurring on Cboe Canada and, as such, guarantees clearance and settlement of all of our matched Canadian equities trades. With respect to trades in options and futures occurring on Cboe Europe Derivatives, we deliver matched trades of our customers to Cboe Clear Europe, which acts as a \n80\nTable of Contents\ncentral counterparty on all transactions occurring on Cboe Europe Derivatives and, as such, guarantees clearance and settlement of all of those matched options and futures trades. With respect to Australian equities and derivatives, we deliver matched trades of our customers to ASX Clear Pty Ltd and ASX Settlement Pty Ltd. ASX Clear Pty Ltd acts as a central counterparty on all transactions occurring on Cboe Australia and, as such, guarantees clearance and settlement on all of our matched trades in Australia. With respect to Japanese equities, we formerly delivered matched trades of our customers to the Japanese Securities Clearing Corporation, which acted as a central counterparty on all transactions formerly occurring on Cboe Japan and, as such, guaranteed clearance and settlement on all of our matched trades in Japan. \nWith respect to trades on CFE in digital asset futures (previously traded on Cboe Digital Exchange), we deliver matched trades of our customers to Cboe Clear U.S., which acts as a central counterparty on these digital asset futures transactions. As the central counterparty, Cboe Clear U.S. guarantees clearance and settlement of all matched digital asset futures trades in digital asset futures previously listed on Cboe Digital Exchange, and now, listed on CFE.\nCritical Accounting Estimates \nThe preparation of condensed consolidated financial statements in conformity with U.S. GAAP requires our management to make estimates and assumptions that affect the reported amounts of assets and liabilities, disclosure of the amounts of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the reporting period. Actual results could differ materially from those estimates. On an ongoing basis, the Company evaluates its estimates, including those related to areas that require a significant level of judgment or are otherwise subject to an inherent degree of uncertainty. The Company bases its estimates on historical experience, observation of trends in particular areas, information available from outside sources and various other assumptions that are believed to be reasonable under the circumstances. Information from these sources form the basis for making judgments about the carrying values of assets and liabilities that may not be readily apparent from other sources.\nIn the nine months ended September 30, 2025, there were no significant changes to our critical accounting estimates from those disclosed in the “Management’s Discussion and Analysis of Financial Condition and Results of Operations” in our 2024 Annual Report on Form 10-K, with the exception of Goodwill and Other Intangible Assets, as described below. \nGoodwill and Other Intangible Assets\nDescription\nOur various acquisitions resulted in the recording of goodwill and other intangible assets. In accordance with ASC 350 – Intangibles – Goodwill and Other and ASC 360 – Property, Plant, and Equipment, we test the carrying values of goodwill and indefinite-lived intangible assets for impairment at least annually or more frequently when events or changes in circumstances signal indicators of impairment are present, and for long-lived intangible assets if indicators of impairment exist.\nJudgments and Uncertainties\nThe estimated fair values of our reporting units are based on the market approach and the income approach (using discounted estimated future cash flows). The estimated fair values of the long-lived intangibles used the income approach. The discounted estimated future cash flow analysis requires judgments about the discount rate, forecasted revenue growth rate, and operating expenses, that are inherent in these fair value estimates over the estimated remaining operating period. Additionally, the analysis contains uncertainty surrounding future events. As such, actual results may differ from these estimates and lead to a revaluation of our goodwill, indefinite-lived, and long-lived intangible assets.\nEffect if Actual Results Differ from Assumptions\nIf updated estimates indicate that the fair value of goodwill or any indefinite-lived or long-lived intangible assets is less than the carrying value of the asset, an impairment charge is expected to be recorded in the condensed consolidated statements of income in the period of the change in estimate, which could result in a material change to the condensed consolidated financial statements. However, due to the results of our impairment analyses completed in 2024, in which all reporting units estimated fair value exceeded their carrying value, we do not consider our goodwill, indefinite-lived or long-lived intangible assets to have a significant risk of impairment, except as noted below. \nIn the second quarter of 2025, Cboe Japan experienced declines in its market share as a result of increased market competition. The decline in market share was evaluated as a potential indication of impairment and the Company performed an interim impairment test for the long-lived intangible assets recognized in the Europe and Asia Pacific reporting unit. The Company concluded that the carrying value of Cboe Japan’s customer relationships long-lived intangible assets exceeded their estimated fair value, as their projected future cash flows did not support their valuation, and recorded an impairment charge of $17.1 million in the condensed consolidated statements of income for the three and six months ended June 30, \n81\nTable of Contents\n2025. The Company also evaluated the indefinite-lived intangible assets and goodwill of the Europe and Asia Pacific reporting unit and, based on the results of the assessments, determined there was no additional impairment required for the three and six months ended June 30, 2025 as the fair values exceeded the carrying values, respectively.\nOn July 23, 2025, the Company announced its decision to wind down Cboe’s Japanese equities business, including the operations of its Cboe Japan proprietary trading system and Cboe BIDS Japan block trading platform. The Company suspended operations for these businesses on August 29, 2025 and expects to formally close the businesses subject to consultation with regulators. As a result, the Company recorded an impairment charge of $4.5 million and $21.6 million related to indefinite-lived intangible assets and technology-related software for the three and nine months ended September 30, 2025, respectively."
}