{
  "source_file": "cci-20241231.htm",
  "form_type": "10-K",
  "item1": "Item 1.    \nBusiness\nOverview\nWe own, operate and lease shared communications infrastructure that is geographically dispersed throughout the U.S., including (1) more than 40,000 towers and other structures, such as rooftops (collectively, \"towers\"), (2) approximately 105,000 small cell nodes either currently generating revenue or under contract and (3) approximately 90,000 route miles of fiber primarily supporting small cells and fiber solutions. We refer to our towers, small cells and fiber assets collectively as \"communications infrastructure,\" and, at times, to our customers on our communications infrastructure as \"tenants.\" Our operating segments consist of (1) Towers and (2) Fiber, which includes both small cells and fiber solutions. \nOn March 13, 2025, management signed a definitive agreement (\"Strategic Fiber Agreement\") to sell our Fiber segment, together with certain supporting assets and personnel (\"Fiber Business\"), with Zayo Group Holdings Inc. (\"Zayo\") acquiring the fiber solutions business and EQT Active Core Infrastructure fund (\"EQT\") acquiring the small cell business (\"Strategic Fiber Transaction\"). Under the agreement, we will receive $8.5 billion in aggregate, subject to certain closing adjustments.  The Strategic Fiber Transaction is expected to close in the first half of 2026, subject to certain closing conditions and regulatory approvals.\nThe Fiber Business did not meet the criteria for assets held for sale as of December 31, 2024, and therefore remains presented as a component of continuing operations.\n \nAs a result, this document, unless otherwise noted, does not contemplate the planned sale of the Fiber Business. Following the announcement of the Strategic Fiber Transaction and beginning with the Company's filing of Form 10-Q for the quarter ended March 31, 2025, the Fiber Business will be presented as a discontinued operation, and its net assets will be classified as held for sale and comparable prior periods will be recast to reflect this change. Upon classification as held for sale, we expect to recognize a loss of between $700 and $800 million, inclusive of estimated transaction fees.\nOur core business is providing access, including space or capacity, to our shared communications infrastructure via long-term contracts in various forms, including lease, license, sublease and service agreements (collectively, \"tenant contracts\"). We seek to increase our site rental revenues by adding more tenants on our shared communications infrastructure, which we expect to result in significant incremental cash flows due to our low incremental operating costs. We operate as a REIT for U.S. federal income tax purposes. See \n\"Item 1. Business—REIT Status\" \nand notes 2 and 9 to our consolidated financial statements.\nOver nearly three decades, we have assembled a leading portfolio of towers predominately through acquisitions from large wireless carriers or their predecessors. More recently, we have extended our communications infrastructure presence by investing significantly in our Fiber segment. Through our product offerings of towers and small cells, we seek to provide a comprehensive solution to enable our wireless tenants to expand coverage and capacity for their wireless networks. Furthermore, within our Fiber segment, we seek to generate cash flow growth and stockholder return by deploying our fiber for both small cells' and fiber solutions' tenants.\nApproximately 56% and 71% of our towers are located in the 50 and 100 largest U.S. basic trading areas (\"BTAs\"), respectively. Our towers have a significant presence in each of the top 100 BTAs. We derive approximately 40% of our towers site rental gross margin from towers located on land that we own, including through fee interests and perpetual easements, and we derive approximately 60% of our towers site rental gross margin from towers located on land that we lease, sublease, manage or license. The contracts for the land under our towers have an average total remaining life of approximately 35 years (including all renewal terms exercisable at our option), weighted based on towers site rental gross margin. The majority of our small cells and fiber assets are located in major metropolitan areas, including a presence in most major U.S. markets. The vast majority of our fiber assets are located on public rights-of-way. \nOur largest tenants are T-Mobile, AT&T and Verizon Wireless, which collectively accounted for approximately three-fourths of our 2024 consolidated site rental revenues. See note 14 to our consolidated financial statements for further information regarding our largest tenants. Site rental revenues represented 97% of our 2024 consolidated net revenues, of which 67% and 33% were from our Towers segment and Fiber segment, respectively. Within our Fiber segment, 66% and 34% of our 2024 site rental revenues related to fiber solutions and small cells, respectively. The vast majority of our site rental revenues are of a recurring nature and are derived from long-term tenant contracts. See \"\nItem 1. Business—The Company\n\" for further information. As of December 31, 2024, exclusive of renewals exercisable at the tenants' option, our tenant contracts had a weighted-average remaining life of approximately six years and represented $35.9 billion of expected future cash inflows. \n4\nAs part of our effort to provide comprehensive communications infrastructure solutions, as an ancillary business, we also offer certain services primarily relating to our Towers segment, predominately consisting of pre-construction site development services relating to existing or new tenant equipment installations, including: site acquisition, architectural and engineering, or zoning and permitting (collectively, \"site development services\"). \nSee note 16 to our consolidated financial statements for a discussion of the July 2023 restructuring (\"2023 Restructuring Plan\"), which included discontinuing tenant equipment installations and subsequent augmentations (collectively, \"installation services\") as a Towers product offering and (2) the June 2024 restructuring plan (\"2024 Restructuring Plan,\" and together with the 2023 Restructuring Plan, \"Restructuring Plans\").\nStrategy\nAs a leading provider of shared communications infrastructure in the U.S., our strategy is to create long-term stockholder value via a combination of (1) growing cash flows generated from our existing portfolio of communications infrastructure, (2) returning a meaningful portion of our cash generated by operating activities to our common stockholders in the form of dividends and (3) investing capital efficiently to grow cash flows and long-term dividends per share. Our strategy is based, in part, on our belief that the U.S. is the most attractive market for shared communications infrastructure investment with the greatest long-term growth potential. We measure our efforts to create \"long-term stockholder value\" by the combined payment of dividends to stockholders and growth in our per-share results. The key elements of our strategy are to:\n•\nGrow cash flows from our existing communications infrastructure. \nWe are focused on maximizing the recurring site rental cash flows generated from providing our tenants with long-term access to our shared infrastructure assets, which we believe is the core driver of value for our stockholders. Tenant additions or modifications of existing tenant equipment (collectively, \"tenant additions\") enable our tenants to expand coverage and capacity in order to meet increasing demand for data while generating high incremental returns for our business. We believe our product offerings of towers and small cells through our shared communications infrastructure model provide a comprehensive, efficient and cost-effective solution for our wireless tenants' growing networks. Additionally, we believe our ability to share our fiber assets across multiple tenants to both deploy small cells and offer fiber solutions allows us to generate cash flows and increase stockholder return.\n•\nReturn cash generated by operating activities to common stockholders in the form of dividends\n. We believe that distributing a meaningful portion of our cash generated by operating activities appropriately provides common stockholders with increased certainty for a portion of expected long-term stockholder value while still allowing us to retain sufficient flexibility to invest in our business and deliver growth. We believe this decision reflects the translation of the high-quality, long-term contractual cash flows of our business into stable capital returns to common stockholders.\n•\nInvest capital efficiently to grow cash flows and long-term dividends per share.\n In addition to adding tenants to existing communications infrastructure, we seek to invest our available capital, including the net cash generated by our operating activities and external financing sources, in a manner that will increase long-term stockholder value on a risk-adjusted basis. These investments include constructing and acquiring new communications infrastructure that we expect will generate future cash flow growth and attractive long-term returns by adding tenants to those assets over time. Our historical investments have included the following (in no particular order):\n◦\nconstruction of towers, fiber and small cells; \n◦\nacquisitions of towers, fiber and small cells; \n◦\nacquisitions of land interests (which primarily relate to land assets under towers); \n◦\nimprovements and structural enhancements to our existing communications infrastructure; \n◦\npurchases of shares of our common stock from time to time; and \n◦\npurchases, repayments or redemptions of our debt. \nOur strategy to create long-term stockholder value is based on our belief that there will be considerable future demand for our communications infrastructure based on the location of our assets and the rapid and continuing growth in the demand for data. We believe that such demand for our communications infrastructure will continue, will result in growth of our cash flows due to tenant additions on our existing communications infrastructure, and will create other growth opportunities for us, such as demand for newly constructed or acquired communications infrastructure, as described above. Further, we seek to augment the long-term value creation associated with growing our recurring site rental cash flows by offering certain ancillary site development services within our Towers segment.\n5\nREIT Status\nWe operate as a REIT for U.S. federal income tax purposes. As a REIT, we are generally entitled to a deduction for dividends that we pay and, therefore, are not subject to U.S. federal corporate income tax on our net taxable income that is currently distributed to our stockholders. We may be subject to certain federal, state, local and foreign taxes on our income or assets, including (1) taxes on any undistributed income, (2) taxes related to our taxable REIT subsidiaries (\"TRSs\"), (3) franchise taxes, (4) property taxes and (5) transfer taxes. In addition, we could, under certain circumstances, be required to pay an excise or penalty tax, which could be significant in amount, in order to utilize one or more relief provisions under the Internal Revenue Code of 1986, as amended (\"Code\"), to maintain qualification for taxation as a REIT. For taxable years beginning before 2026, qualified REIT dividends (within the meaning of Section 199A(e)(3) of the Code) constitute a part of a non-corporate taxpayer's \"qualified business income amount\" and thus our non-corporate U.S. stockholders may be eligible to take a qualified business income deduction in an amount equal to 20% of such dividends received from us. Without further legislative action, the 20% deduction applicable to qualified REIT dividends will expire on January 1, 2026.\nThe vast majority of our assets and revenues are in the REIT. See notes 2 and 9 to our consolidated financial statements. Additionally, we have included in TRSs certain other assets and operations. Those TRS assets and operations will continue to be subject, as applicable, to federal and state corporate income taxes or to foreign taxes in the jurisdictions in which such assets and operations are located.\nOur foreign assets and operations (including our tower operations in Puerto Rico) most likely will be subject to foreign income taxes in the jurisdictions in which such assets and operations are located, regardless of whether or not they are included in a TRS.\nTo remain qualified and be taxed as a REIT, we are generally required to annually distribute to our stockholders at least 90% of our REIT taxable income, after the utilization of our net operating loss carryforwards \"NOLs\" (determined without regard to the dividends paid deduction and excluding net capital gain) (see notes 2 and 9 to our consolidated financial statements). Our quarterly common stock dividend will delay the utilization of our NOLs and may cause certain of the NOLs to expire without utilization. See \n\"Item 1A. Risk Factors\" \nfor risks associated with our REIT status. \nIndustry Overview\nConsumer demand for data continues to grow due to increases in data consumption and increased penetration of bandwidth-intensive devices. This increase in data consumption is driven by factors such as growth in (1) mobile entertainment (such as mobile video, mobile applications and social networking), (2) mobile internet usage (supporting web browsing and trends in telehealth, remote working, online learning and other remote communications), (3) machine-to-machine applications or the \"Internet of Things\" (such as connected cars and wearables), and (4) the adoption of other bandwidth-intensive applications (such as cloud services, artificial intelligence and video communications). As a result, consumer wireless devices are trending toward bandwidth-intensive devices, including smartphones, laptops, tablets and other emerging and embedded devices, and U.S. wireless carriers are among the first carriers in the world to offer commercial 5th Generation (\"5G\") mobile cellular communications services to further support such growth.\nWe expect the following factors to contribute to potential demand for our communications infrastructure:\n•\nconsumers' growing wireless data consumption leading major wireless carriers to upgrade and enhance their networks through the efficient use of both towers and small cells, including in connection with 5G deployments, in an effort to improve network quality and capacity and customer retention or satisfaction;\n•\nprior and future potential spectrum auctioned, licensed or made available by the Federal Communications Commission (\"FCC\") enabling additional wireless carrier network development; \n•\nnext-generation technologies and new uses for wireless communications may potentially result in new entrants or increased demand in the wireless industry, which may include companies involved in the continued evolution and deployment of the Internet of Things; \n•\nthe continued adoption of bandwidth-intensive applications, including artificial intelligence, could result in demand for high-capacity, multi-location, fiber-based network solutions; and\n•\nincreased government initiatives to expand broadband infrastructure to support connectivity throughout the U.S.\nThe Company\nVirtually all of our operations in both our Towers and Fiber operating segments are located in the U.S. For more information about our operating segments, see \n\"Item 7. MD&A—Results of Operations\" \nand note 14 to our consolidated financial statements. Our core business is providing access, including space or capacity, to our shared communications infrastructure via long-term tenant contracts in the U.S. We believe our communications infrastructure is integral to our tenants' networks and organizations. See \n\"Item 1. Business—Strategy.\"\n6\nTowers Segment.\n We believe towers are the most efficient and cost-effective solution for providing coverage and capacity for wireless carrier network deployments. We acquired ownership interests or exclusive rights to the majority of our towers directly or indirectly from the largest U.S. wireless carriers (or their predecessors) through transactions consummated since 1999, including towers from (1) AT&T in 2013, (2) T-Mobile in 2012, (3) companies now part of T-Mobile in 2007, (4) companies now part of Verizon Wireless in 1999 and 2000 and (5) companies now part of AT&T in 1999 and 2000.\nWe generally receive monthly rental payments and, in some cases, upfront payments, from our Towers tenants pursuant to long-term tenant contracts with (1) initial contract terms generally between five to 15 years, (2) multiple renewal periods generally between five to 10 years each, exercisable at the option of the tenant, (3) limited termination rights for our tenants and (4) contractual escalations of the rental price. We strive to negotiate with our existing tenant base for longer contractual terms, which often contain fixed escalation rates.\nOur Towers tenant contracts, while amended and re-negotiated over time, have historically led to a long-term relationship with tenants on our towers, resulting in a retention rate generally between 98% and 99% each year. In general, each renewable tenant contract automatically renews at the end of its term unless (1) the tenant provides prior notice of its intent not to renew or (2) the contract is amended or re-negotiated. See \n\"Item 1A. Risk Factors\" \nfor additional information regarding higher non-renewals (which we define as the reduction in site rental revenues as a result of tenant churn, terminations and, in limited circumstances, reductions of existing lease rates) expected as a result of the T-Mobile and Sprint network consolidation. See note 3 to our consolidated financial statements for a tabular presentation of the minimum rental payments due to us by tenants pursuant to tenant contracts without consideration of tenant renewal options as of December 31, 2024.\nThe average monthly rental payment from a new tenant added to towers can vary based on (1) aggregate tenant volume, (2) the location of the tower, or (3) the amount of tower and ground space leased to a tenant, which can be influenced by the quantity, size, and weight of the tenant's antenna installation or related equipment. When possible, we seek to receive rental payment increases in connection with tenant contract amendments, pursuant to which our tenants add antennas or other equipment to our towers or ground space on which they already have equipment pursuant to preexisting tenant contracts. Our Towers tenant contracts and pricing are not influenced by whether or not we perform the site development services.\nAs of December 31, 2024, the average number of tenants (calculated as a unique license together with any related amendments thereto) per tower was approximately 2.4.\nFiber Segment. \nOur Fiber segment consists of communications infrastructure offerings of small cells and fiber solutions. \n•\nOur small cells offload data traffic from towers and bolster our tenants' network capacity where data demand is the greatest and are typically attached to public right-of-way infrastructure, including utility poles and street lights.\n•\nWe offer fiber solutions to large wireless carriers and organizations with high-bandwidth and multi-location demands. Our fiber solutions provide essential connectivity resources needed to create integrated networks and support organizations. \nMost of our fiber assets were acquired through transactions dating back to 2012, with the largest transactions occurring in 2017. Our fiber assets include those we acquired from LTS Group Holdings LLC, Inc., Wilcon Holdings LLC and FPL FiberNet Holdings, LLC and certain other subsidiaries of NextEra Energy in 2017, Quanta Fiber Networks, Inc. in 2015, and NextG Networks, Inc. in 2012.\nWe generally receive monthly recurring payments and, in some cases, upfront payments, from our Fiber tenants pursuant to tenant contracts with initial terms that generally vary between one to 20 years. The average monthly rental payment from a new tenant can vary based on the amount or cost of (1) construction for initial and subsequent tenants, (2) fiber strand requirements and supply, (3) equipment at the site, (4) the market in the U.S. where the fiber is located and the competition thereof and (5) any upfront payment received.\nAdditional Site Rental Information. \nFor both our Towers and Fiber segments, we have existing master agreements with our largest tenants, including T-Mobile, AT&T and Verizon Wireless. Such agreements provide certain terms (including economic terms) that govern underlying contracts (entered into during the term of the master agreements) regarding the right to use our communications infrastructure by such tenants.\nApproximately 40% of our site rental costs of operations consists of Towers ground lease expenses, and the remainder primarily includes fiber access expenses (primarily leases of fiber assets and other access agreements to facilitate our communications infrastructure), repairs and maintenance, employee compensation or related benefit costs, property taxes, and utilities. Assuming current leasing activity levels, our cash operating expenses generally tend to escalate at approximately the rate of inflation. We seek to add tenants to our existing communications infrastructure at a low incremental operating cost, \n7\ndelivering high incremental returns to our business. Once constructed, our communications infrastructure requires minimal sustaining capital expenditures, including maintenance or other non-discretionary capital expenditures, which are typically between 1% and 2% of net revenues. See note 13 to our consolidated financial statements for a tabular presentation of the rental payments we owe to landlords pursuant to our operating lease agreements.\nServices.\n As part of our effort to provide comprehensive communications infrastructure solutions, as an ancillary business, we also offer certain services primarily relating to pre-construction site development services in our Towers segment. See note 16 to our consolidated financial statements for a discussion of the July 2023 restructuring plan, which included discontinuing installation services as a Towers product offering.  In 2024, our services and other revenues primarily related to site development services. We seek to grow our services revenues by capitalizing on (1) increased leasing volumes that may result from carrier network upgrades, (2) promoting site development services, (3) expanding the scope of our services, and (4) focusing on tenant service and deployment speed. We do not always provide the site development services for our tenants on our communications infrastructure as other service providers also provide these services (see also \n\"—Competition\" \nbelow). Typically, our site development services are non-recurring and are billed on a fixed fee basis, and the terms and pricing of site development services are negotiated separately from our tenant contracts.\nCustomers.\n Our Towers customers are primarily comprised of large wireless carriers that operate national networks.\nOur Fiber customers generally consist of large wireless carriers and organizations with high-bandwidth and multi-location demands, such as enterprise (including healthcare and financial), wholesale, government and education institutions.\nOur three largest tenants are T-Mobile, AT&T and Verizon Wireless. Collectively, these three tenants accounted for approximately three-fourths of our 2024 site rental revenues. See \n\"Item 1A. Risk Factors\" \nfor risks associated with our dependence on a small number of customers and note 14 to our consolidated financial statements. For 2024, our site rental revenues by tenant were as follows:\nSales and Marketing.\n Our sales organization markets our communications infrastructure with the objective of contracting access with tenants to existing communications infrastructure or to new communications infrastructure prior to construction. We seek to become the critical partner and preferred independent communications infrastructure provider for our tenants and increase tenant satisfaction relative to our peers by leveraging our (1) existing unique communications infrastructure footprint, (2) tenant relationships, (3) process-centric approach, (4) technological tools and (5) construction capabilities and expertise relative to the Fiber segment.\nOur sales team is organized based on a variety of factors, including tenant type (such as large wireless carriers, vertical customers and organizations), product offering and geography. A team of national account directors maintains our relationships with our largest tenants. These directors work to develop new business opportunities, as well as to ensure that tenants' communications infrastructure needs are efficiently translated into new contracts for our communications infrastructure. Sales personnel in our local offices develop and maintain relationships with our tenants that are expanding their networks, entering new markets, seeking new or additional communication infrastructure offerings, bringing new technologies to market or requiring maintenance or add-on business. In addition to our full-time sales or marketing staff, a number of senior-level employees spend a significant portion of their time on sales and marketing activities and call on existing or prospective tenants.\n8\nCompetition.\n We face competition for site rental tenants from various sources, including (1) other independent communications infrastructure owners or operators, including competitors that own, operate, or manage towers, rooftops, broadcast or transmission towers, utility poles, fiber (including non-traditional competitors, such as cable providers) or small cells, (2) tenants who elect to self-perform or (3) new alternative deployment methods for communications infrastructure.\nSome of our largest competitors in the Towers segment are American Tower Corporation and SBA Communications Corporation. Our Fiber segment business competitors can vary significantly based on geography. Some of the larger competitors in the Fiber segment include other owners of fiber, tenants who elect to self-perform and recent and potential entrants into small cells and the fiber solutions business. We believe that location, existing communications infrastructure footprint, deployment speed, quality of service, expertise, reputation, capacity and price have been and will continue to be the most significant competitive factors affecting our businesses. See \n\"Item 1A. Risk Factors\" \nfor a discussion of competition in our industry.\nCompetitors to our services offering can include site acquisition consultants, zoning consultants, real estate firms, right-of-way consulting firms, construction companies, tower owners or managers, radio frequency engineering consultants, our tenants' internal staff or contractors, or telecommunications equipment vendors who can provide turnkey site development services through multiple subcontractors. We believe that our tenants base their decisions on the outsourcing of services on criteria such as a company's experience, record of accomplishment, reputation, price and time for completion of a project.\nEnvironmental, Social and Governance (\"ESG\")\nOur shared communications infrastructure model results in the use of fewer resources, including water, energy, metals and other materials, than would otherwise be needed to construct and maintain communications infrastructure under a single-tenant infrastructure model. We are committed to operating responsibly and ethically and considering social and environmental impacts as we make business decisions. We currently maintain annual sustainability targets in our senior unsecured credit facility. Further, we have a goal to be carbon neutral for 2025 in Scope 1 and 2 emissions by continuing to invest in energy reduction initiatives, sourcing renewable energy, and, to a lesser extent, utilizing carbon credits or offsets. We plan to continue investing in projects that are both good for our business and good for the environment.\nThe Nominating, Environmental, Social and Governance Committee assists the board of directors with ESG oversight. Our executive management team and senior management keep our board of directors apprised of our ESG priorities, goals and initiatives. Together, our board of directors and executive management team define our strategic approach to managing actual and potential impacts of significant ESG risks and opportunities.\nAdditional information regarding our sustainability initiatives and progress is also available through the Investors section of our website at https://investor.crowncastle.com. The information on our website, including our ESG Reports, is not, and shall not be deemed to be, incorporated by reference into this 2024 Form 10-K or any other filings with the SEC unless expressly noted in any such other filings.\nHuman Capital\nThe people who work for Crown Castle are essential to our ability to execute on our strategy. As of January 31, 2025, we employed approximately 3,900 people, all of whom were based in the U.S. From time to time, we also add contingent workers to support our business.\nWe believe attracting, developing and retaining talented employees is paramount to serving our customers and our communities and creating value for our stockholders.  We also periodically conduct company-wide employee surveys to help us understand how they feel about working at our company and track the results to inform our human capital strategies.  We focus on building and retaining a strong and innovative workforce with a variety of backgrounds, experiences and points of view.\nThe well-being of our employees is a crucial element of our safety culture, employee engagement and productivity. We offer a comprehensive total rewards package which includes market-based pay, performance-based annual incentive awards, healthcare and retirement benefits, mental health benefits, parental and family leave, holiday and paid time off and tuition assistance. We further invest in our employees' professional growth and development by providing resources and opportunities to hone their skills and expand their subject-matter expertise, which empowers them to advance their careers and enables our business to prosper. \nWe are not a party to any collective bargaining agreements and have not experienced any strikes or work stoppages.  See \n\"Item 1A. Risk Factors\"\n and note 16 to our consolidated financial statements for further discussion of our Restructuring Plans, which resulted in a reduction of total employee headcount.\n9\nRegulatory and Environmental Matters\nWe are required to comply with a variety of federal, state and local regulations and laws in the U.S., including FCC and Federal Aviation Administration (\"FAA\") regulations and those discussed under \n\"—Environmental\"\n below. To date, we have not incurred any material fines or penalties or experienced any material adverse effects to our business as a result of any domestic or international regulations, including any environmental regulations. The summary below is based on regulations currently in effect, and such regulations are subject to review or modification by the applicable governmental authority from time to time. If we fail to comply with applicable laws and regulations, we may be fined or lose our rights to conduct some of our business.\nFederal Regulations.\n Both the FCC and the FAA regulate towers used for wireless communications, radio, or television broadcasting. Such regulations control the siting, construction, modification, lighting, and marking of towers and may, depending on the characteristics of particular towers, require the registration of tower facilities with the FCC and the issuance of determinations confirming no hazard to air traffic. Wireless communications devices operating on towers are separately regulated and independently licensed based upon the particular frequency used. In addition, the FCC and the FAA have developed standards to consider proposals for new or modified tower or antenna structures based upon the height or location, including proximity to airports. Proposals to construct or to modify existing tower or antenna structures above certain heights are reviewed by the FAA to ensure the structure will not present a hazard to aviation, which determination may be conditioned upon compliance with lighting or marking requirements. The FCC requires its licensees to operate communications devices only on towers that comply with FAA rules and are registered with the FCC, if required by its regulations. Where tower lighting is required by FAA regulation, tower owners bear the responsibility of notifying the FAA of any tower lighting outage and ensuring the timely restoration of such outages.\nState and Local Regulations.\n The U.S. Telecommunications Act of 1996 amended the Communications Act of 1934 to preserve state and local zoning authorities' jurisdiction over the siting of communications towers and small cells. The law, however, limits state and local zoning authority by prohibiting actions by such authorities that discriminate between different service providers of wireless communications or prohibit altogether (actually or effectively) the provision of wireless communications. Additionally, the law prohibits state and local restrictions based on the environmental effects of radio frequency emissions to the extent the facilities comply with FCC regulations.\nLocal regulations include city and other local ordinances (including subdivision and zoning ordinances), approvals for construction, modification and removal of towers and small cells, and restrictive covenants imposed by community developers. These regulations vary greatly, but typically require us to obtain prior approval from local officials. Local zoning authorities may render decisions that prevent the construction or modification of towers or small cells, or place conditions on such construction or modifications that are responsive to community residents' concerns regarding the height, visibility, or other characteristics of such infrastructure. Over the last several years, the FCC has adopted regulations and 32 states have passed legislation intended to expedite and streamline the deployment of wireless networks, including establishing presumptively reasonable timeframes for reviews by local and state governments. Notwithstanding such developments, decisions of local regulatory authorities and utilities in certain jurisdictions may continue to adversely affect deployment timing and cost. \nCertain of our subsidiaries hold state authorizations, including authorizations to act as competitive local exchange carriers (\"CLECs\"), to provide intrastate telecommunication services in addition to FCC authorization to provide domestic interstate telecommunication services. State authorizations may help promote access to public rights-of-way, which is beneficial to the timely deployment of fiber and small cells, and often allow us to deploy such infrastructure in locations where zoning restrictions might otherwise delay, restrict, or prevent building or expanding traditional wireless tower and rooftop sites. See \n\"Item 1A. Risk Factors\"\n for additional information regarding rights to our infrastructure.\nEnvironmental. \nWe are required to comply with a variety of federal, state and local environmental laws and regulations protecting environmental quality, including air and water quality, and wildlife. To date, we have not incurred any material fines or penalties or experienced any material adverse effects to our business as a result of any domestic or international environmental regulations or matters. See \n\"Item 1A. Risk Factors\" \nfor additional information regarding compliance with laws and regulations.\nThe construction of new towers and small cells or, in some cases, their modification in the U.S. may be subject to environmental review under the National Environmental Policy Act of 1969, as amended (\"NEPA\"), which requires federal agencies to evaluate the environmental impact of major federal actions. NEPA regulations require applicants to investigate the potential environmental impact of the proposed tower or small cells construction. If the FCC determines that the proposed tower or small cells construction or modification presents a significant environmental impact, the FCC is required to prepare an environmental impact statement, which is subject to public comment. Such determination could significantly delay the FCC's approval of the construction or modification.\n10\nOur operations are also subject to federal, state and local laws and regulations relating to the management, use, storage, disposal, emission, or remediation of, or exposure to, hazardous or non-hazardous substances, materials, or wastes. As an owner, lessee, or operator of real property, we are subject to certain environmental laws that impose strict, joint-and-several liability for the cleanup of on-site or off-site contamination relating to existing or historical operations; or we could also be subject to personal injury or property damage claims relating to such contamination. In general, our tenant contracts prohibit our tenants from using or storing any hazardous substances on our communications infrastructure sites in violation of applicable environmental laws and require our tenants to provide notice of certain environmental conditions caused by them.\nWe are subject to Occupational Safety and Health Administration and similar guidelines regarding employee protection from radio frequency exposure. In recent years, the scientific community has extensively studied low-level radio frequency emissions to determine whether they have any connection to certain negative health effects, such as cancer.\nWe have compliance programs and monitoring projects designed to promote compliance with applicable environmental laws and regulations. Nevertheless, there can be no assurance that the costs of compliance with existing or future environmental laws will not have a material adverse effect on us.\nAvailable Information\nWe maintain a website at www.crowncastle.com. Our annual reports on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K (and any amendments to those reports filed or furnished pursuant to Section 13(a) or 15(d) of the Securities Exchange Act of 1934, as amended (\"Exchange Act\")), proxy statements and other information about us are made available, free of charge, through the Investors section of our website at https://investor.crowncastle.com and at the SEC's website at http://sec.gov as soon as reasonably practicable after we electronically file such material with, or furnish it to, the SEC. \nIn addition, our Corporate Governance Guidelines, Proper Business Practices and Ethics Policy, Financial Code of Ethics, and the charters of our Audit Committee, Compensation and Human Capital Committee and Nominating, Environmental, Social and Governance Committee are available through the Investors section of our website at https://investor.crowncastle.com, and such information is also available in print to any stockholder who requests it. We intend to post to our website any amendments to or waivers from each of the Business Practices and Ethics Policy and Financial Code of Ethics applicable to our Chief Executive Officer, Chief Financial Officer and Controller that are required to be disclosed.\n11",
  "item7": "Item 7.     \nManagement's Discussion and Analysis of Financial Condition and Results of Operations\nGeneral Overview\nOverview\nWe own, operate and lease shared communications infrastructure. See \n\"Item 1. Business\"\n for a further discussion of our business, including our long-term strategy, our REIT status, certain key terms of our tenant contracts and growth trends in the demand for data. \nOn March 13, 2025, management signed the Strategic Fiber Agreement to sell our Fiber Business, with Zayo acquiring the fiber solutions business and EQT acquiring the small cell business. Under the Strategic Fiber Agreement, we will receive $8.5 billion in aggregate, subject to certain closing adjustments.  The Strategic Fiber Transaction is expected to close in the first half of 2026, subject to certain closing conditions and regulatory approvals.  See \n\"Item 1. Business—Overview\"\n for further discussion of the pending sale of the Fiber Business. \nThe Fiber Business did not meet the criteria for assets held for sale as of December 31, 2024, and therefore remains presented as a component of continuing operations.  As a result, this document, unless otherwise noted, does not contemplate the planned sale of the Fiber Business.\nHighlights of Business Fundamentals and Results\n•\nSite rental revenues represented 97% of our 2024 consolidated net revenues. The vast majority of our site rental revenues is of a recurring nature and has been contracted for in prior years.\n•\nWe operate as a REIT for U.S. federal income tax purposes (see \n\"Item 1. Business—REIT Status\" \nand notes 2 and 9 to our consolidated financial statements)\n•\nPotential growth resulting from the increasing demand for data \n◦\nWe expect existing and potential new tenant demand for our communications infrastructure will result from (1) new technologies, (2) increased usage of mobile entertainment, mobile internet, and machine-to-machine applications, (3) adoption of other emerging and embedded wireless devices (including smartphones, laptops, tablets, wearables and other devices), (4) increasing smartphone penetration, (5) wireless carrier focus on expanding both network quality and capacity, including the use of both towers and small cells, (6) the adoption of other bandwidth-intensive applications (such as cloud services, artificial intelligence and video communications), (7) the availability of additional spectrum and (8) increased government initiatives to support connectivity throughout the U.S.\n◦\nWe expect U.S. wireless carriers will continue to focus on improving network quality and expanding capacity (including through 5G initiatives) by utilizing a combination of towers and small cells. We believe our product offerings of towers and small cells provide a comprehensive solution to our wireless tenants' growing communications infrastructure needs. \n◦\nWe expect organizations will continue to increase the usage of high-bandwidth applications that will require the utilization of more fiber infrastructure and fiber solutions, such as those we provide. \n◦\nWithin our Fiber segment, we are able to generate growth and returns for our stockholders by deploying our fiber for both small cells and fiber solutions tenants. \n◦\nTenant additions on our existing communications infrastructure are achieved at a low incremental operating cost, delivering high incremental returns. \n◦\nSubstantially all of our communications infrastructure can accommodate additional tenancy, either as currently constructed or with appropriate modifications.\n•\nReturning cash flows provided by operations to stockholders in the form of dividends (see also \n\"Item 1. Business—Strategy\"\n)\n◦\nDuring 2024, we paid common stock dividends totaling approximately $2.7 billion. \n•\nInvesting capital efficiently to grow long-term dividends per share \n◦\nWe had discretionary capital expenditures of $1.1 billion for the \nyear\n ended December 31, 2024, predominately resulting from the construction of new communications infrastructure and improvements to existing communications infrastructure in order to support additional tenants. \n◦\nWe expect to continue to construct and acquire new communications infrastructure based on our tenants' needs and generate attractive long-term returns by adding additional tenants over time. See note 16 to our consolidated financial statements for a discussion of the 2024 Restructuring Plan, which resulted in, among other things, an \n34\nincrease in return thresholds on new growth opportunities in the Fiber segment and a reduction in Fiber segment capital expenditures for the year ended December 31, 2024.\n•\nSite rental revenues under long-term tenant contracts\n◦\nOur wireless tenant contracts have initial terms generally between five to 15 years with contractual escalators and multiple renewal periods generally between five to 10 years each, exercisable at the option of the tenant. \n◦\nOur fiber solutions tenant contracts' initial terms generally vary between one to 20 years. \n◦\nAs of December 31, 2024, our weighted-average remaining term was approximately six years, exclusive of renewals exercisable at the tenants' option, currently representing approximately $35.9 billion of expected future cash inflows.\n•\nMajority of our revenues from large wireless carriers \n◦\nFor the year ended December 31, 2024, approximately three-fourths of our site rental revenues were derived from T-Mobile, AT&T and Verizon Wireless. See \n\"Item 1A. Risk Factors\"\n and note 14 to our consolidated financial statements for a further discussion of our largest customers.\n•\nMajority of land under our towers under long-term control \n◦\nFor the year ended December 31, 2024, approximately 90% of our towers site rental gross margin and approximately 80% of our towers site rental gross margin was derived from towers located on land that we own or control for greater than 10 and 20 years, respectively. The aforementioned percentages include towers located on land that is owned, including through fee interests and perpetual easements, which represented approximately  40% of our towers site rental gross margin.\n•\nMajority of our fiber assets are located in major metropolitan areas and are on public rights-of-way \n•\nMinimal sustaining capital expenditure requirements \n◦\nFor the year ended December 31, 2024, sustaining capital expenditures represented approximately 1% of net revenues. \n•\nDebt portfolio with long-dated maturities extended over multiple years, with the vast majority of such debt having a fixed rate (see note 7 to our consolidated financial statements and \n\"Item 7A. Quantitative and Qualitative Disclosures About Market Risk\"\n for a further discussion of our debt)\n◦\nAs of December 31, 2024, our outstanding debt had a weighted average interest rate of 3.9% and weighted average maturity of approximately eight years (assuming anticipated repayment dates on certain debt).\n◦\nAs of December 31, 2024, 90% of our debt has fixed rate coupons.\n◦\nOur debt service coverage and leverage ratios are within their respective financial maintenance covenants. See \n\"Item 7. MD&A—Liquidity and Capital Resources—Debt Covenants\"\n for a further discussion of our debt covenants.\n•\nDuring 2024, we refinanced and extended the maturities of certain of our debt (see note 7 to our consolidated financial statements and \n\"Item 7. MD&A—Liquidity and Capital Resources—Financing Activities\" \nfor further discussion of our debt transactions)\n•\nSignificant cash flows from operations \n◦\nNet cash provided by operating activities was $2.9 billion for the \nyear\n ended December 31, 2024.\n◦\nIn addition to the positive impact of contractual escalators, we expect to grow our core business of providing access to our communications infrastructure as a result of future anticipated additional demand for our communications infrastructure. \n•\nWhen compared to full year 2023, full year 2024 results were impacted by a reduction of the small cell and fiber solutions lease cancellations (\"Sprint Cancellations\") related to the previously disclosed T-Mobile and Sprint network consolidation. For full year 2024, there was a reduction in cash payments related to Sprint Cancellations of $165 million to satisfy the remaining rental obligations. Additionally, $59 million in accelerated amortization of prepaid rent from the remaining deferred revenues was recognized for the year ended December 31, 2023 that did not recur for the year ended December 31, 2024.\n•\nRestructuring Plan\n◦\nIn July 2023, we initiated the 2023 Restructuring Plan as part of our efforts to reduce costs to better align our operational needs with lower tower activity.   See note 16 to our consolidated financial statements and \"\nItem 2. MD&A—Results of Operations\n\" for further discussion of the 2023 Restructuring Plan.\n◦\nIn June 2024, we initiated the 2024 Restructuring Plan as part of our efforts to drive operational efficiencies, enhance returns by increasing return thresholds on new growth opportunities and reduce operating costs and capital expenditures, with a primary focus on our Fiber segment. See note 16 to our consolidated financial statements and \"\nItem 2. MD&A—Results of Operations\n\" for further discussion of the 2024 Restructuring Plan.\n•\nIn December 2023, we announced a strategic and operating review of our Fiber business, and in the second quarter of 2024, we concluded our operating review and implemented changes to our operating plans and strategy based on the findings. Additionally, in March 2025, we concluded the strategic review following the announcement of the Strategic Fiber Transaction, as discussed above. See note 16 to our consolidated financial statements and \"\nItem 2. \n35\nMD&A—Results of Operations\n\" for further discussion of the 2024 Restructuring Plan and \"\nItem 1. Business—Overview\" \nfor further discussion of the pending sale of the Fiber Business.\n◦\nAs part of the announced plans to enhance returns in the Fiber segment, during the fourth quarter of 2024 we completed discussions with certain of our tenants regarding approximately 7,000 previously-identified greenfield small cell nodes in our contracted backlog that we mutually agreed to cancel.   We wrote off property and equipment deemed to have no alternative future use, and as a result, recognized approximately $106 million as \"Asset write-down charges\" on our consolidated statement of operations and comprehensive income (loss) for the year ended December 31, 2024.\n•\nGoodwill Impairment \n◦\nManagement performed its annual goodwill impairment test in the fourth quarter of 2024.  The quantitative impairment test indicated that the carrying amount of our Fiber reporting unit exceeded its estimated fair value. As such, management recorded a goodwill impairment charge of $5.0 billion for the year ended December 31, 2024, resulting in no goodwill remaining for the Fiber reporting unit. See \n\"Item 7. MD&A—Accounting and Reporting Matters—Critical Accounting Policies and Estimates\" \nand note 5 to our consolidated financial statements.\nCommon Stock Dividend\nDuring each of the quarters in the year ended 2024, we paid a common stock dividend of $1.565 per share, totaling approximately $2.7 billion.  We are updating our capital allocation framework to focus more on free cash flow generation and financial flexibility, which we currently expect to result in a reduction to our dividend, beginning with our expected second quarter 2025 dividend. As we grow cash flows thereafter, we expect to increase our dividend per share. Whether dividends are to be declared and the amount and timing thereof remain subject to the discretion of our board of directors. See notes 10 and 17 to our consolidated financial statements.\nOutlook Highlights\nThe following are certain highlights of our outlook that impact our business fundamentals described above.\n•\nBeginning in the first quarter 2025, the Fiber Business will be presented as a discontinued operation, and its net assets will be classified as held for sale and comparable prior periods will be recast to reflect this change. Upon classification as held for sale in the first quarter of 2025, we expect to recognize a loss of between $700 and $800 million, inclusive of estimated transaction fees.\n•\nWe expect a year over year reduction in site rental revenues in our Towers segment related to (1) higher Towers non-renewals in 2025, which are expected to reduce site rental revenues by approximately $200 million as a result of the T-Mobile US, Inc. and Sprint network consolidation and (2) a decline in long-term deferred revenue amortization.\n•\nAs part of the aforementioned 2024 Restructuring Plan:\n◦\nWe expect to realize approximately $100 million annualized run-rate labor and facilities cost savings, of which approximately $65 million was realized in 2024. The remaining savings of approximately $35 million are expected to be realized in 2025, with $30 million expected in selling, general and administrative and $5 million in site rental costs of operations. See \n\"Item 1A. Risk Factors\" \nfor a discussion of risks related to our restructuring activities.\n•\nNotwithstanding the plan to sell our Fiber Business, we expect to continue to invest a significant amount of our available capital in the form of discretionary capital expenditures until the closing of the Strategic Fiber Transaction.\n•\nWe also expect sustaining capital expenditures of approximately 1-2% of net revenues, including with respect to the Fiber Business, for full year 2025, relatively consistent with historical annual levels.\n36\nResults of Operations\nThe following discussion of our results of operations for 2024 compared to 2023 should be read in conjunction with \n\"Item 1. Business,\" \"Item 7. MD&A—Liquidity and Capital Resources\"\n and our consolidated financial statements. For a discussion of our results of operations and financial condition for 2023 compared to 2022 that is not included in this 2024 Form 10-K, see \n\"Part II, Item 7. Management's Discussion and Analysis of Financial Condition and Results of Operations\"\n in our Annual Report on Form 10-K for the year ended December 31, 2023, which was filed with the SEC on February 23, 2024.\nThe following discussion of our results of operations is based on our consolidated financial statements prepared in accordance with GAAP, which requires us to make estimates and judgments that affect the reported amounts (see \n\"Item 7. MD&A—Accounting and Reporting Matters—Critical Accounting Policies and Estimates\"\n and note 2 to our consolidated financial statements). See \n\"Item 7. MD&A—Accounting and Reporting Matters—Non-GAAP and Segment Financial Measures\" \nfor a discussion of our use of (1) segment operating profit (loss), including its definition, (2) Segment Adjusted Site Rental Gross Margin and (3) Segment Adjusted Services and Other Gross Margin, including their respective definitions and reconciliations to segment operating profit (loss) and (4) Adjusted EBITDA, including its definition and a reconciliation to net income (loss).\nOur operating segments consist of (1) Towers and (2) Fiber. See note 14 to our consolidated financial statements for further discussion of our operating segments.\nHighlights of our results of operations for 2024, 2023 and 2022 are depicted below:\n \n \nYears Ended December 31,\nPercent Change\n(In millions of dollars)\n2024\n2023\n2022\n2024 vs. 2023\n2023 vs. 2022\nSite rental revenues:\nTowers site rental revenues\n$\n4,266 \n$\n4,313 \n$\n4,322 \n(1)\n%\n— \n%\nFiber site rental revenues\n2,092 \n2,219 \n1,967 \n(6)\n%\n13 \n%\nTotal site rental revenues\n6,358 \n6,532 \n6,289 \n(3)\n%\n4 \n%\nAdjusted Site Rental Gross Margin\n(a)\n:\nTowers Adjusted Site Rental Gross Margin\n3,307 \n3,370 \n3,404 \n(2)\n%\n(1)\n%\nFiber Adjusted Site Rental Gross Margin\n1,358 \n1,533 \n1,317 \n(11)\n%\n16 \n%\nAdjusted Services and Other Gross Margin\n(a)\n:\nTowers Adjusted Services and Other Gross Margin\n91 \n127 \n238 \n(28)\n%\n(47)\n%\nFiber Adjusted Services and Other Gross Margin\n6 \n16 \n3 \n(63)\n%\n433 \n%\nSegment operating profit (loss)\n(b)\n:\nTowers operating profit (loss)\n3,322 \n3,393 \n3,527 \n(2)\n%\n(4)\n%\nFiber operating profit (loss)\n1,188 \n1,355 \n1,130 \n(12)\n%\n20 \n%\nNet income (loss)\n(3,903)\n1,502 \n1,675 \n(360)\n%\n(10)\n%\nAdjusted EBITDA\n(c)\n4,161 \n4,415 \n4,340 \n(6)\n%\n2 \n%\n \n(a)\nSee reconciliations of these non-GAAP financial measures to segment operating profit (loss) and definitions included in \n\"Item 7. MD&A—Accounting and Reporting Matters—Non-GAAP.\n(b)\nSee \n\"Item 7. MD&A—Accounting and Reporting Matters—Non-GAAP and Segment Financial Measures\" \nand note 14 to our consolidated financial statements for our definition of segment operating profit.\n(c)\nSee reconciliation of this non-GAAP financial measure to net income (loss) and definition included in \n\"Item 7. MD&A—Accounting and Reporting Matters—Non-GAAP and Segment Financial Measures.\"\n37\n2024 and 2023\n \nTotal site rental revenues for 2024 decreased by $174 million, or 3%, from 2023. This decrease was predominately comprised of the factors depicted in the chart below: \n(In millions of dollars)\n \n(a)\nRepresents site rental revenues growth from tenant additions across our entire portfolio and renewals or extensions of tenant contracts, exclusive of the impacts from both straight-line accounting and amortization of prepaid rent in accordance with GAAP and change in payments for Sprint Cancellations.\n(b)\nIncludes $9 million of non-renewals associated with Sprint Cancellations. \n(c)\nRepresents $170 million of payments associated with Sprint Cancellations received in 2023 and not recurring in 2024, which were partially offset by approximately $5 million of payments associated with Sprint Cancellations received in 2024.\n(d)\nPrepaid rent amortization includes amortization of upfront payments received from long-term tenants and other deferred credits. Prepaid rent amortization includes $59 million of accelerated prepaid rent amortization associated with the Sprint Cancellations that was recognized in 2023 that did not recur in 2024.\nTowers site rental revenues and Towers Adjusted Site Rental Gross Margin for 2024 were $4.3 billion and $3.3 billion, respectively, compared to $4.3 billion and $3.4 billion, respectively, from 2023. The decrease of $47 million and $63 million in Towers site rental revenue and Towers Adjusted Site Rental Gross Margin, respectively, was primarily due to a decrease in prepaid rent amortization, as new leasing activity and contractual cash escalators were substantially offset by a decline in the associated straight-line accounting adjustment.  \nFiber site rental revenues and Fiber Adjusted Site Rental Gross Margin for 2024 were $2.1 billion and $1.4 billion, respectively, and decreased by $127 million and $175 million, respectively, from 2023. Both Fiber site rental revenues and Fiber Adjusted Site Rental Gross Margin were predominately impacted by a $165 million reduction in site rental revenues and an absence of $59 million of accelerated prepaid rent amortization, both related to Sprint Cancellations, which were partially offset by increased demand for small cells and fiber solutions.\nTowers Adjusted Services and Other Gross Margin was $91 million for 2024 and decreased by $36 million from $127 million from 2023, which is a reflection of (1) the lower volume of activity from carriers' network enhancements, (2) the volume and mix of services and other work and (3) the discontinuation of installation services as a Towers product offering. Our services and other offerings are of a variable nature as these revenues are not under long-term tenant contracts. See note 16 to our consolidated financial statements for a discussion of the 2023 Restructuring Plan, which included discontinuing installation services as a Towers product offering.\nFiber Adjusted Services and Other Gross Margin was $6 million for 2024 and decreased by $10 million from $16 million from 2023 primarily as a result of the absence of payments received for site abandonment fees associated with the Sprint Cancellations that were received during 2023.\n38\nSelling, general and administrative expenses for 2024 were $706 million and decreased by $53 million, or 7%, from $759 million from 2023. The decrease in selling, general and administrative expenses was primarily related to a decrease in employee- and facility-related costs as a result of our aforementioned restructuring activities, which was partially offset by an increase in advisory fees, mostly stemming from our recent proxy contest and the Fiber strategic review.\nAsset write-down charges for 2024 increased by $115 million, or 348% from 2023.  The increase was primarily related to the $106 million charge due to the cancellation of approximately 7,000 greenfield small cell nodes in our contracted backlog, as was mutually agreed upon with certain of our tenants. See \n\"Item 7. MD&A—General Overview\" \nfor additional information.\nTowers operating profit (loss) for 2024 decreased by $71 million, or 2%, from 2023. The decrease in Towers operating profit (loss) was primarily related to the previously-mentioned decreases in both Towers Adjusted Site Rental Gross Margin and Towers Adjusted Services and Other Gross Margin, which were partially offset by a decrease in Towers selling, general and administrative expenses as a result of the 2023 Restructuring Plan.\nFiber operating profit (loss) for 2024 decreased by $167 million, or 12%, from 2023. The decrease in Fiber operating profit (loss) was primarily related to the previously-mentioned decreases in both Fiber Adjusted Site Rental Gross Margin and Fiber Adjusted Services and Other Gross Margin, which were partially offset by a decrease in Fiber selling, general and administrative expenses following the 2024 Restructuring Plan.\nDepreciation, amortization and accretion was approximately $1.7 billion for 2024 and decreased by $16 million, or 1%, from 2023. This decrease predominately resulted from certain site rental contracts and tenant relationships intangible assets becoming fully amortized.\nRestructuring charges in connection with the Restructuring Plans for 2024 were $109 million and increased by $24 million, or 28%, from $85 million in 2023. This increase primarily resulted from an increase in office closure or consolidation costs in connection with the 2024 Restructuring Plan, when compared to the 2023 Restructuring Plan. This increase was partially offset by lower employee headcount reduction charges in connection with the 2024 Restructuring Plan, when compared to the 2023 Restructuring Plan. See note 16 to our consolidated financial statements for further discussion of our Restructuring Plans.\nGoodwill impairment charges of $5.0 billion were recorded for our Fiber reporting unit for 2024.  See \n\"Item 7. MD&A—Accounting and Reporting Matters—Critical Accounting Policies and Estimates\"\n and note 5 to our consolidated financial statements.\nInterest expense and amortization of deferred financing costs, net was $932 million for 2024 and increased by $82 million, or 10%, from $850 million during 2023. The increase predominately resulted from an increase in our outstanding indebtedness due to the financing of our discretionary capital expenditures. See note 7 to our consolidated financial statements, \n\"Item 1A. Risk Factors\"\n and \n\"Item 7A. Quantitative and Qualitative Disclosures About Market Risk\"\n for a further discussion of our debt and interest rate exposure.\nThe provisions for income taxes for 2024 and 2023 were $24 million and $26 million, respectively. For both 2024 and 2023, the effective tax rate differs from the federal statutory rate predominately due to our REIT status, including the dividends paid deduction. See \n\"Item 1. Business—REIT Status,\" \"Item 7. MD&A—Accounting and Reporting Matters—Critical Accounting Policies and Estimates\"\n and note 9 to our consolidated financial statements. \nNet income (loss) was $(3.9) billion during 2024 compared to $1.5 billion during 2023. The decrease was related to the previously-mentioned decreases in Towers and Fiber operating profits, the previously-mentioned increases in goodwill impairment charges, asset write-down charges and interest expense and amortization of deferred financing costs, net, while being partially offset by a decrease in selling, general and administrative expenses.\nAdjusted EBITDA decreased by $254 million, or 6%, from 2023 to 2024, reflecting the previously mentioned decreases in Towers and Fiber operating profits.\n39\nLiquidity and Capital Resources\nOverview\nGeneral. \nOur core business generates revenues under long-term tenant contracts (see \n\"Item 1. Business—Overview\" \nand\n \"Item 7. MD&A—General Overview—Overview\"\n) from (1) the largest U.S. wireless carriers and (2) other towers and fiber solutions tenants. As a leading provider of shared communications infrastructure in the U.S., our strategy is to create long-term stockholder value via a combination of (1) growing cash flows generated from our portfolio of communications infrastructure, (2) returning a meaningful portion of our cash generated by operating activities to our stockholders in the form of dividends, and (3) investing capital efficiently to grow cash flows and long-term dividends per share. Our strategy is based, in part, on our belief that the U.S. is the most attractive market for shared communications infrastructure investment with the greatest long-term growth potential. We measure our efforts to create \"long-term stockholder value\" by the combined payment of dividends to stockholders and growth in our per share results. See \n\"Item 1. Business—Strategy\"\n for a further discussion of our strategy. \nWe have engaged, and expect to continue to engage, in discretionary investments that we believe will maximize long-term stockholder value. Our historical discretionary investments include (in no particular order): constructing communications infrastructure, acquiring communications infrastructure, acquiring land interests (which primarily relate to land assets under towers), improving and structurally enhancing our existing communications infrastructure, purchasing shares of our common stock, and purchasing, repaying, or redeeming our debt. We have recently spent, and expect to continue to spend, a significant percentage of our discretionary investments on the construction of small cells and fiber through the closing of the sale of the Fiber Business.  See \"\nItem 1. Business—Overview\n\" for further detail. See note 16 to our consolidated financial statements and \"\nItem 2. MD&A—Results of Operations\n\" for further discussion of the 2024 Restructuring Plan, which resulted in, among other things, an increase in return thresholds on new growth opportunities in the Fiber segment and a reduction in Fiber segment capital expenditures for full year 2024. We seek to fund our discretionary investments with both cash generated by operating activities and cash available from financing capacity, such as the use of our availability under our 2016 Revolver, issuances under our CP Program, debt financings and issuances of equity or equity-related securities, including under our 2024 ATM Program or any similar successor program. \nWe seek to maintain a capital structure that we believe drives long-term stockholder value and optimizes our weighted-average cost of capital. Additionally, we expect to maintain an investment grade credit profile.  Our contractual debt maturities over the next 12 months, consist of (1) Commercial Paper Notes, of which we had $1.1 billion outstanding as of March 12, 2025, (2) the 1.350% senior unsecured notes due July 2025 (\"1.350% Senior Notes\") and (3) principal payments on certain outstanding debt. We currently expect to refinance $700 million of Tower Revenue Notes, Series 2015-2 on or prior to the anticipated repayment date on May 15, 2025. Amounts available under our CP Program may be repaid and re-issued from time to time and we intend to maintain available commitments under our 2016 Revolver in an amount at least equal to the amount of Commercial Paper Notes outstanding.\nWe operate as a REIT for U.S. federal income tax purposes. We expect to continue to pay minimal cash income taxes as a result of our REIT status and our NOLs. See \n\"Item 1. Business—REIT Status,\" \"Item 7. MD&A—General Overview\"\n and note 9 to our consolidated financial statements.\nLiquidity Position.\n The following is a summary of our capitalization and liquidity position as of December 31, 2024. See \n\"Item 7A. Quantitative and Qualitative Disclosures About Market Risk\" \nand note 7 to our consolidated financial statements for additional information regarding our debt as well as note 10 to our consolidated financial statements for additional information regarding our 2024 ATM Program.\n(In millions of dollars)\nCash and cash equivalents and restricted cash and cash equivalents\n(a)\n$\n295 \nUndrawn 2016 Revolver availability\n(b)\n6,961 \nTotal debt and other obligations (current and non-current)\n24,081 \nTotal deficit\n(133)\n \n \n(a)\nInclusive of $5 million included within \"Other assets, net\" on our consolidated balance sheet.\n(b)\nAvailability at any point in time is subject to certain restrictions based on the maintenance of financial covenants contained in our 2016 Credit Facility. At any point in time, we intend to maintain available commitments under our 2016 Revolver in an amount at least equal to the amount of outstanding Commercial Paper Notes. See note 7 to our consolidated financial statements.\nOver the next 12 months: \n•\nOur liquidity sources may include (1) cash on hand, (2) cash generated by our operating activities, (3) availability under our 2016 Revolver, (4) issuances under our CP Program, and (5) issuances of equity pursuant to our 2024 ATM \n40\nProgram or any similar successor program. Our liquidity uses over the next 12 months are expected to include (1) debt obligations of $2.0 billion (consisting of Commercial Paper Notes, the 1.350% Senior Notes and principal payments on certain outstanding debt), (2) common stock dividend payments, subject to declaration by our board of directors (see \n\"Item 7. MD&A—General Overview—Common Stock Dividend\"\n), and (3) capital expenditures. We currently expect to refinance the Tower Revenue Notes, Series 2015-2 on or prior to the anticipated repayment date of May 15, 2025, see \"",
  "item2": null
}