{
  "item1": "core business providing access, including space capacity, shared communications infrastructure via long-term contracts various forms, including lease, license, sublease service agreements (collectively, \"tenant contracts\"). seek increase site rental revenues adding more tenants shared communications infrastructure, which expect result significant incremental cash flows due low incremental operating costs. operate REIT U.S. federal income tax purposes.",
  "item7": "Represents site rental revenues growth tenant additions across entire portfolio renewals extensions tenant contracts, exclusive impacts both straight-line accounting amortization prepaid rent accordance GAAP change payments Sprint Cancellations. Includes $9 million non-renewals associated Sprint Cancellations. Represents $170 million payments associated Sprint Cancellations received 2023 not recurring 2024, which partially offset approximately $5 million payments associated Sprint Cancellations received 2024. Prepaid rent amortization includes amortization upfront payments received long-term tenants other deferred credits.",
  "item2": "own, operate lease shared communications infrastructure geographically dispersed throughout U.S., including (1) approximately 40,000 towers other structures, such rooftops (collectively, \"towers\"), (2) approximately 105,000 small cell nodes either currently generating revenue under contract (3) approximately 90,000 route miles fiber primarily supporting small cells fiber solutions. towers, small cells fiber solutions assets collectively referred herein \"communications infrastructure,\" Company's customers its communications infrastructure referred herein \"tenants.\" Company provides access, including space capacity, its communications infrastructure via long-term contracts various forms, including lease, license, sublease service agreements (collectively, \"tenant contracts\"). towers significant presence each top 100 basic trading areas, majority small cells fiber assets located major metropolitan areas, including presence most major U.S. markets."
}