{
  "source_file": "cci-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "ITEM 2.\nMANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS \nThe following discussion should be read in conjunction with the response to Part I, Item 1 of this report and the consolidated financial statements of the Company including the related notes and \n\"Item 7. Management's Discussion and Analysis of Financial Condition and Results of Operations\"\n (\"MD&A\")\n \nincluded in the 2024 Form 10-K.\nGeneral Overview \nOverview \nWe own, operate and lease shared communications infrastructure that is geographically dispersed throughout the U.S., including (1) approximately 40,000 towers and other structures, such as rooftops (collectively, \"towers\"), (2) approximately 105,000 small cell nodes either currently generating revenue or under contract and (3) approximately 90,000 route miles of fiber primarily supporting small cells and fiber solutions. Our towers, small cells and fiber solutions assets are collectively referred to herein as \"communications infrastructure,\" and the Company's customers on its communications infrastructure are referred to herein as \"tenants.\"  The Company provides access, including space or capacity, to its communications infrastructure via long-term contracts in various forms, including lease, license, sublease and service agreements (collectively, \"tenant contracts\").\nOur towers have a significant presence in each of the top 100 basic trading areas, and the majority of our small cells and fiber assets are located in major metropolitan areas, including a presence in most major U.S. markets. \nOn March 13, 2025, management signed a definitive agreement (\"Strategic Fiber Agreement\") to sell our small cells and fiber solutions businesses, together with certain supporting assets and personnel (\"Fiber Business\"), with Zayo Group Holdings Inc. (\"Zayo\") acquiring the fiber solutions business and EQT Active Core Infrastructure fund (\"EQT\") acquiring the small cells business (\"Strategic Fiber Transaction\"). Under the Strategic Fiber Agreement, we will receive $8.5 billion in aggregate cash proceeds, subject to certain closing adjustments.\nAs the Strategic Fiber Transaction represents a material strategic shift for the Company, the Fiber Business' results and net assets are presented herein as discontinued operations and comparable prior periods have been recast to reflect this change.  Related to the classification of the Fiber Business as \"held for sale\", the Company recognized a loss from disposal of discontinued operations of $231 million and $1.3 billion, inclusive of estimated transaction fees, for the three and nine months ended September 30, 2025, respectively.  The Strategic Fiber Transaction is expected to close in the first half of 2026, subject to certain closing conditions and required government and regulatory approvals. Pending the closing of the Strategic Fiber Transaction, we will continue to operate the Fiber Business in accordance with the Strategic Fiber Agreement.\nFollowing the classification of the Fiber Business as discontinued operations, the Company has one reportable segment that constitutes consolidated results consisting of its towers operations.  Unless otherwise noted, all activities and amounts reported below relate to the continuing operations of the Company and exclude activities and amounts related to discontinued operations. See notes 3 and 11 to our condensed consolidated financial statements for a discussion of discontinued operations and our operating segment.\nSite rental revenues represented 94% of our third quarter 2025 consolidated net revenues.  The vast majority of our site rental revenues are of a recurring nature and are derived from long-term tenant contracts. \nStrategy\nAs a leading provider of towers in the U.S., our strategy is to create long-term stockholder value via a combination of (1) growing cash flows generated from our existing portfolio of towers, (2) returning a meaningful portion of our cash generated by operating activities to our common stockholders in the form of dividends and share repurchases and (3) investing capital efficiently to grow cash flows. Our strategy is based, in part, on our belief that the U.S. is the most attractive market in the world for towers. We measure our efforts to create \"long-term stockholder value\" by the combined payments of dividends to stockholders and growth in our per-share results. The key elements of our strategy are to:\n•\nGrow cash flows from our existing towers. \nWe are focused on maximizing the recurring site rental cash flows generated from providing our tenants with long-term access to our towers, which we believe is the core driver of value for our stockholders. Tenant additions or modifications of existing tenant equipment (collectively, \"tenant additions\") enable our tenants to expand coverage and capacity in order to meet increasing demand for data while generating high incremental returns for our business. We believe our towers provide an efficient and cost-effective \n20\nsolution for our wireless tenants' growing networks that provides an opportunity to generate cash flows and increase stockholder return.\n•\nReturn cash generated by operating activities to stockholders in the form of dividends and share repurchases\n. We believe that distributing a meaningful portion of our cash generated by operating activities appropriately provides stockholders with increased certainty for a portion of expected long-term stockholder value while still allowing us to retain sufficient flexibility to invest in our business and deliver growth. We believe this decision reflects the translation of the high-quality, long-term contractual cash flows of our business into stable capital returns to stockholders.\n•\nInvest capital efficiently to grow cash flows.\n In addition to adding tenants to our existing towers, we seek to invest our available capital, including the net cash generated by our operating activities and external financing sources, in a manner that will increase long-term stockholder value. These investments include acquisition of land interests, making improvements and structural enhancements to our existing towers, and constructing and acquiring new towers that we expect will generate future cash flow growth and attractive long-term returns by adding tenants to those assets over time.\nOur strategy to create long-term stockholder value is based on our belief that there will be considerable future demand for our towers based on the location of our assets and the rapid and continuing growth in the demand for data. We believe that such demand for our towers will continue, will result in growth of our cash flows due to tenant additions on our existing towers, and will create other growth opportunities for us, such as demand for newly constructed or acquired towers, as described above. Further, we seek to augment the long-term value creation associated with growing our recurring site rental cash flows by offering certain ancillary site development services. \nHighlights of Business Fundamentals and Results\n•\nWe operate as a REIT for U.S. federal income tax purposes\n◦\nAs a REIT, we are generally entitled to a deduction for dividends that we pay and, therefore, are not subject to U.S. federal corporate income tax on our net taxable income that is currently distributed to our stockholders.\n◦\nTo remain qualified and be taxed as a REIT, we are generally required to annually distribute to our stockholders at least 90% of our REIT taxable income, after the utilization of our net operating loss carryforwards (\"NOLs\") (determined without regard to the dividends paid deduction and excluding net capital gain).\n◦\nSee note 7 to our condensed consolidated financial statements for further discussion of our REIT status.\n•\nPotential growth resulting from the increasing demand for data\n◦\nWe expect existing and potential new tenant demand for our towers will result from (1) new technologies, (2) increased usage of mobile entertainment, mobile internet, and machine-to-machine applications, (3) adoption of other emerging and embedded wireless devices (including smartphones, laptops, tablets, wearables and other devices), (4) increasing smartphone penetration, (5) wireless carrier focus on expanding both network quality and capacity, (6) the adoption of other bandwidth-intensive applications (such as cloud services, artificial intelligence and video communications), (7) the availability of additional spectrum and (8) increased government initiatives to support connectivity throughout the U.S.\n◦\nWe expect U.S. wireless carriers will continue to focus on improving network quality and expanding capacity (including through 5G initiatives). We believe our towers provide an efficient and cost-effective solution to our wireless tenants' growing infrastructure needs. \n◦\nTenant additions on our towers are achieved at a low incremental operating cost, delivering high incremental returns. \n•\nSubstantially all of our towers can accommodate additional tenancy, either as currently constructed or with appropriate modifications. \n•\nInvesting capital efficiently to grow cash flows (see also \n\"Item 2. MD&A—General Overview—Strategy\"\n)\n◦\nWe had discretionary capital expenditures of $104 million for the nine months ended September 30, 2025. The capital expenditures predominately related to improvements to existing towers in order to support additional tenants and purchases of land underneath our towers. \n◦\nWe expect to continue to construct and acquire new towers based on our tenants' needs and generate attractive long-term returns by adding additional tenants over time.\n•\nSite rental revenues under long-term tenant contracts \n◦\nOur tenant contracts have initial terms generally between five to 15 years, with contractual escalators and multiple renewal periods generally between five to 10 years each, exercisable at the option of the tenant. \n21\n◦\nAs of September 30, 2025, our weighted-average remaining term was approximately six years, exclusive of renewals exercisable at the tenants' option, currently representing approximately $28.1 billion of expected future cash inflows. \n•\nMajority of our revenues from large wireless carriers \n◦\nFor the nine months ended September 30, 2025, approximately 89% of our site rental revenues were derived from T-Mobile, AT&T and Verizon Wireless. \n•\nMajority of land under our towers under long-term control \n◦\nFor the nine months ended September 30, 2025, approximately 90% of our towers site rental gross margin and approximately 80% of our towers site rental gross margin was derived from towers located on land that we own or control for greater than 10 and 20 years, respectively. The aforementioned percentages include towers located on land that is owned, including through fee interests and perpetual easements, which represented approximately 40% of our towers site rental gross margin.\n•\nMinimal sustaining capital expenditure requirements \n◦\nFor the nine months ended September 30, 2025, sustaining capital expenditures represented less than 1% of net revenues. \n•\nDebt portfolio with long-dated maturities extended over multiple years, with the vast majority of such debt having a fixed rate (see note 5 to our condensed consolidated financial statements and \n\"Item 3. Quantitative and Qualitative Disclosures About Market Risk\"\n for a further discussion of our debt) \n◦\nAs of September 30, 2025, our outstanding debt had a weighted-average interest rate of 4.0% and weighted-average maturity of approximately six years (assuming the anticipated repayment date on the $750 million aggregate principal amount of 4.241% senior secured tower revenue notes (\"Tower Revenue Notes, Series 2018-2\"). \n◦\nAs of September 30, 2025, 84% of our debt had fixed rate coupons.\n◦\nOur debt service coverage and leverage ratios are within their respective financial maintenance covenants. \n•\nDuring 2025, we completed the following financing activities (see note 5 to our condensed consolidated financial statements)\n◦\nIn May 2025, we paid in full the previously outstanding Tower Revenue Notes, Series 2015-2 on the anticipated repayment date.\n◦\nIn July 2025, we repaid in full the $500 million aggregate principal amount of 1.350% senior unsecured notes on the contractual maturity date.\n•\nSignificant cash flows from operations \n◦\nNet cash provided by operating activities was $2.2 billion for the nine months ended September 30, 2025.\n◦\nIn addition to the positive impact of contractual escalators, we expect to grow our core business of providing access to our towers as a result of future anticipated additional demand. \n•\nReturning cash flows provided by operations to stockholders in the form of dividends and share repurchases.\n◦\nDuring the first quarter of 2025, we paid a common stock dividend of $1.565 and during the second and third quarters of 2025, we paid common stock dividends of $1.0625 per share, totaling approximately $1.6 billion for the nine months ended September 30, 2025.\n◦\nWe updated our capital allocation framework to focus more on free cash flow generation and financial flexibility, which resulted in a reduction to our dividend, beginning in the second quarter 2025.  As we grow cash flows, we expect to increase our dividend per share. See note 10 to our condensed consolidated financial statements for further information regarding our common stock and dividends.\n•\nRestructuring Plans\n◦\nIn July 2023, we initiated a restructuring plan (\"2023 Restructuring Plan\") as part of our efforts to reduce costs to better align our operational needs with lower tower activity. See note 13 to our condensed consolidated financial statements for further discussion of the 2023 Restructuring Plan.\n◦\nIn June 2024, we initiated a restructuring plan (\"2024 Restructuring Plan,\" and together with 2023 Restructuring Plan, \"Restructuring Plans\") with a primary focus on our small cells and fiber solutions businesses, as part of our efforts to drive operational efficiencies, enhance returns by increasing return thresholds on new growth opportunities and reduce operating costs and capital expenditures. See note 13 to our condensed consolidated financial statements and \n\"Item 2. MD&A—Results of Operations\"\n for further discussion of the 2024 Restructuring Plan.\n•\nIn December 2023, we announced a strategic and operating review of our Fiber Business, and in the second quarter of 2024, we concluded our operating review and implemented changes to our operating plans based on the findings. Additionally, in March 2025, we concluded the strategic review following the announcement of the Strategic Fiber Transaction, as discussed above. See note 13 to our condensed consolidated financial statements for further \n22\ndiscussion of the 2024 Restructuring Plan.  In addition, see note 3 to our condensed consolidated financial statements and \n\"Item 2. MD&A—Overview\" \nfor further discussion of the pending sale of the Fiber Business.\nOutlook Highlights\nWe expect a year over year reduction in site rental revenues related to (1) higher towers non-renewals in 2025, which are expected to reduce site rental revenues by approximately $200 million, as a result of the T-Mobile US, Inc. and Sprint network consolidation (\"Sprint Cancellations\") and (2) a decline in long-term prepaid rent amortization.\nResults of Operations \nThe following discussion of our results of operations should be read in conjunction with our condensed consolidated financial statements and the 2024 Form 10-K.\nThe following discussion of our results of operations is based on our condensed consolidated financial statements prepared in accordance with GAAP, which requires us to make estimates and judgments that affect the reported amounts (see \n\"Item 2. MD&A—Accounting and Reporting Matters—Critical Accounting Policies and Estimates\" \nand note 2 to our consolidated financial statements in the 2024 Form 10-K). See \n\"Item 2. MD&A—Accounting and Reporting Matters—Non-GAAP Financial Measures\"\n for a discussion of our use of (1)  Adjusted EBITDA, (2) Adjusted Site Rental Gross Margin and (3) Adjusted Services and Other Gross Margin, including their respective definitions and reconciliations to net income (loss).\nThe Fiber Business is predominately comprised of the assets that we previously reported under the historic Fiber segment. Following the classification of the Fiber Business as discontinued operations, we have one reportable segment that constitutes consolidated results consisting of our towers operations. Following the execution of the Strategic Fiber Agreement, the Fiber Business is treated as discontinued operations for all periods presented, because the anticipated disposal represents a strategic shift that will have a material impact on our operating results.  As such, we recast results for all periods presented to reflect the Fiber Business as discontinued operations. See note 11 to our condensed consolidated financial statements for further discussion of our operating segment.\nHighlights of our results of operations for the three months ended September 30, 2025 and 2024 are depicted below.\n(In millions of dollars)\nThree Months Ended September 30,\n2025\n2024\n$ Change\n% Change\nSite rental revenues\n$1,012\n$1,066\n$(54)\n(5)%\nIncome (loss) from continuing operations\n277\n294\n(17)\n(6)%\nNet income (loss)\n323\n303\n20\n7%\nAdjusted Site Rental Gross Margin\n(a)\n767\n823\n(56)\n(7)%\nAdjusted Services and Other Gross Margin\n(a)\n31\n29\n2\n7%\nAdjusted EBITDA\n(a)\n$718\n$777\n$(59)\n(8)%\n(a)\nSee reconciliations of these non-GAAP financial measures to Net income (loss) and definitions included in \n\"Item 2. MD&A—Accounting and Reporting Matters—Non-GAAP Financial Measures.\"\n23\nSite rental revenues decreased $54 million, or 5%, for the three months ended September 30, 2025 compared to the three months ended September 30, 2024. This decrease was predominately comprised of the factors depicted in the chart below:\n(In millions of dollars)\n(a)\nRepresents site rental revenues growth from tenant additions and renewals or extensions of tenant contracts, exclusive of the impacts from both straight-line accounting and amortization of prepaid rent, in accordance with GAAP.\n(b)\nIncludes $51 million of towers non-renewals related to Sprint Cancellations.\n(c)\nIncludes the growth or reduction in site rental revenues as a result of non-recurring contractual billings and adjustments, expense recoveries, sales credits and other amounts not captured in core leasing activity.\n(d)\nPrepaid rent amortization includes amortization of upfront payments received from long-term tenants and other deferred credits.\nSite rental revenues and Adjusted Site Rental Gross Margin for the third quarter of 2025 were $1.0 billion and $767 million, respectively, compared to $1.1 billion and $823 million, respectively, in the same period in the prior year. The decrease of $54 million and $56 million in site rental revenue and Adjusted Site Rental Gross Margin, respectively, was primarily due to higher towers non-renewals as a result of the Sprint Cancellations, as well as a decrease in prepaid rent amortization, as new leasing activity and contractual cash escalators were substantially offset by a decline in the associated straight-line accounting adjustment.\nAdjusted Services and Other Gross Margin was $31 million for the third quarter of 2025 and increased by $2 million from $29 million during the same period in the prior year, which is a reflection of the volume of activity from carriers' network enhancements and the volume and mix of services and other work. Our services and other offerings are of a variable nature as these revenues are not under long-term tenant contracts.\nSelling, general and administrative expenses for the third quarter of 2025 were $97 million and increased by $4 million, or 4%, from $93 million during the same period in the prior year, primarily related to certain variable employee-related costs.\nDepreciation, amortization and accretion was $167 million for third quarter of 2025 and decreased by $14 million, or 8%, from the same period in the prior year. This decrease predominately resulted from certain fixed assets becoming fully depreciated.\nThere were no restructuring charges recorded in the third quarter of 2025 compared to $38 million recorded during the same period in the prior year relating to the Restructuring Plans.  See note 13 to our condensed consolidated financial statements.\nInterest expense and amortization of deferred financing costs, net were $247 million for the third quarter of 2025 and increased by $11 million, or 5%, from $236 million during the same period in the prior year. The increase predominately \n24\nresulted from an increase in our outstanding indebtedness due to the financing of our discretionary capital expenditures, including those presented within discontinued operations. See note 5 to our condensed consolidated financial statements for a further discussion of our debt and \"Item 3. Quantitative and Qualitative Disclosures About Market Risk\" for a further discussion of our interest rate exposure.\nThe provision for income taxes was $4 million for the third quarter of 2025 and increased by $1 million, or 33%, from $3 million during the same period in the prior year.  For the third quarter 2025 and 2024, the effective tax rate differs from the federal statutory rate predominately due to our REIT status, including the dividends paid deduction. See note 7 to our condensed consolidated financial statements and also note 9 to our consolidated financial statements in the 2024 Form 10-K. \nIncome (loss) from continuing operations was $277 million for the third quarter of 2025 and decreased by $17 million, or 6%, from $294 million during the same period in the prior year. This decrease was due primarily to the aforementioned decrease in Adjusted Site Rental Gross Margin and increase in interest expense and amortization of deferred financing costs, net, being partially offset by the aforementioned decrease in depreciation, amortization, and accretion expense and the absence of restructuring charges during the three months ended September 30, 2025.\nIncome (loss) from discontinued operations before gain (loss) from disposal, net of tax, was $277 million for the third quarter of 2025 compared to $9 million during the third quarter of 2024. The increase was primarily related to a $250 million decrease in depreciation, amortization and accretion related to the ceasing of depreciation and amortization of the Fiber Business long-lived assets classified as \"held for sale.\"  In addition, an increase in revenue and an absence of restructuring charges in the third quarter of 2025 compared to the same period in 2024 further contributed to the increase period over period.\nGain (loss) from disposal of discontinued operations, was $231 million for the third quarter of 2025. The loss recorded for the third quarter of 2025, which primarily represents the excess of the carrying value of the Fiber Business over the purchase price, less estimated costs to sell, is predominately attributable to additional investment in the Fiber Business.\nNet income (loss) was $323 million for the third quarter of 2025 compared to $303 million during the third quarter of 2024. The increase was primarily due to the income (loss) from discontinued operations, net of tax being partially offset by the income (loss) from continuing operations, both of which are discussed above.\nAdjusted EBITDA decreased by $59 million, or 8%, from the third quarter of 2024 to the third quarter of 2025, reflecting the aforementioned decrease in Adjusted Site Rental Gross Margin.\nHighlights of our results of operations for the nine months ended September 30, 2025 and 2024 are depicted below. \n(In millions of dollars)\nNine Months Ended September 30,\n2025\n2024\n$ Change\n% Change\nSite rental revenues\n$3,031\n$3,198\n$(167)\n(5)%\nIncome (loss) from continuing operations\n826\n853\n(27)\n(3)%\nNet income (loss)\n150\n865\n(715)\n(83)%\nAdjusted Site Rental Gross Margin\n(a)\n2,304\n2,473\n(169)\n(7)%\nAdjusted Services and Other Gross Margin\n(a)\n82\n67\n15\n22%\nAdjusted EBITDA\n(a)\n$2,145\n2,258\n$(113)\n(5)%\n(a)\nSee reconciliations of these non-GAAP financial measures to net income (loss) and definition included in \n\"Item 2. MD&A—Accounting and Reporting Matters—Non-GAAP and Segment Financial Measures.\"\n25\nSite rental revenues decreased $167 million, or 5%, for the nine months ended September 30, 2025 compared to the nine months ended September 30, 2024. This decrease was predominately comprised of the factors depicted in the chart below:\n(In millions of dollars)\n(a)\nRepresents site rental revenues growth from tenant additions across our towers and renewals or extensions of tenant contracts, exclusive of the impacts from both straight-line accounting and amortization of prepaid rent in accordance with GAAP.\n(b)\nIncludes $153 million of towers non-renewals associated with Sprint Cancellations.\n(c)\nIncludes the growth or reduction in site rental revenues as a result of non-recurring contractual billings and adjustments, expense recoveries, sales credits and other amounts not captured in core leasing activity.\n(d)\nPrepaid rent amortization includes amortization of upfront payments received from long-term tenants and other deferred credits.\nSite rental revenues and Adjusted Site Rental Gross Margin for the first nine months of 2025 were $3.0 billion and $2.3 billion, respectively, compared to $3.2 billion and $2.5 billion, respectively, in the same period in the prior year. The decreases of $167 million and $169 million in site rental revenue and Adjusted Site Rental Gross Margin, respectively, were primarily due to higher towers non-renewals as a result of the Sprint Cancellations as well as a decrease in prepaid rent amortization, as new leasing activity and contractual cash escalators were partially offset by a decline in the associated straight-line accounting adjustment.\nAdjusted Services and Other Gross Margin was $82 million for the first nine months of 2025 and increased by $15 million from $67 million during the same period in the prior year, which is a reflection of the volume of activity from carriers' network enhancements and the volume and mix of services and other work. Our services and other offerings are of a variable nature as these revenues are not under long-term tenant contracts.\nSelling, general and administrative expenses for the first nine months of 2025 were $289 million and decreased by $54 million, or 16%, from $343 million during the same period in the prior year. This decrease was primarily related to the absence of advisory fees related to the proxy contest that occurred during 2024 and a decrease in employee- and facility-related costs as a result of our aforementioned restructuring activities.\nDepreciation, amortization and accretion was $520 million for the first nine months of 2025 and decreased by $32 million, or 6%, from the same period in the prior year. This decrease predominately resulted from (1) certain site rental contracts and tenant relationships intangible assets becoming fully amortized and (2) certain fixed assets becoming fully depreciated.\nThere were no restructuring charges recorded in the first nine months of 2025 compared to $67 million recorded during the same period in the prior year relating to the Restructuring Plans.  See note 13 to our condensed consolidated financial statements.\n26\nInterest expense and amortization of deferred financing costs, net were $726 million for the first nine months of 2025 and increased by $34 million, or 5%, from $692 million during the same period in the prior year. The increase predominately resulted from an increase in our outstanding indebtedness due to the financing of our discretionary capital expenditures, including those presented within discontinued operations. See note 5 to our condensed consolidated financial statements for a further discussion of our debt and \"Item 3. Quantitative and Qualitative Disclosures About Market Risk\" for a further discussion of our interest rate exposure.\nThe provision for income taxes was $13 million for the first nine months of 2025 and decreased by $1 million or 7%, from $14 million during the same period in the prior year  For both periods, the effective tax rate differs from the federal statutory rate predominately due to our REIT status, including the dividends paid deduction. See note 7 to our condensed consolidated financial statements and also note 9 to our consolidated financial statements in the 2024 Form 10-K. \nIncome (loss) from continuing operations was $826 million for the first nine months of 2025 compared to $853 million during the same period in the prior year. The decrease was primarily related to the aforementioned decrease in Adjusted Site Rental Gross Margin and increase in interest expense and amortization of deferred financing costs, net, which was partially offset by the absence of restructuring charges during the first nine months of 2025, aforementioned decreases in selling, general and administrative expenses and depreciation, amortization and accretion, as well as an increase in Adjusted Services and Other Gross Margin.\nIncome (loss) from discontinued operations before gain (loss) from disposal, net of tax, was $637 million for the first nine months of 2025 compared to $12 million during the same period in the prior year. The increase was primarily related to a $541 million decrease in depreciation, amortization and accretion related to the ceasing of depreciation and amortization of the Fiber Business long-lived assets classified as \"held for sale.\"  In addition, an increase in revenue and the absence of restructuring charges in the first nine months of 2025 further contributed to the increase period over period.  See note 13 to our condensed consolidated financial statements.\nGain (loss) from disposal of discontinued operations was $(1.3) billion for the first nine months of 2025. The loss was primarily related to the classification during the first quarter of 2025 of the Fiber Business as \"held for sale\" and the additional investment in the Fiber Business during the second and third quarter of 2025.  The loss represents the excess of the carrying value of the Fiber Business over the purchase price, less estimated costs to sell.\nNet income (loss) was $150 million for the first nine months of 2025 compared to $865 million during the first nine months of 2024. The decrease was primarily due to the change in income (loss) from discontinued operations, net of tax.\nAdjusted EBITDA decreased by $113 million, or 5%, from the first nine months of 2024 to the first nine months of 2025,  reflecting the aforementioned decrease in Adjusted Site Rental Gross Margin, partially offset by the aforementioned decrease in selling, general and administrative expenses.\nLiquidity and Capital Resources \nOverview \nGeneral. \nOur core business generates revenues under long-term tenant contracts (see \n\"Item 2. MD&A—General Overview—Overview\"\n) from the largest U.S. wireless carriers and other tenants. As a leading provider of towers in the U.S., our strategy is to create long-term stockholder value via a combination of (1) growing cash flows generated from our existing towers, (2) returning a meaningful portion of our cash generated by operating activities to our stockholders in the form of dividends and share repurchases, and (3) investing capital efficiently to grow cash flows. Our strategy is based, in part, on our belief that the U.S. is the most attractive market for towers investment with the greatest long-term growth potential. We measure our efforts to create \"long-term stockholder value\" by the growth in our per share results.\nWe have engaged, and expect to continue to engage, in discretionary investments that we believe will maximize long-term stockholder value. These investments include the acquisition of land interests, making improvements and structural enhancements to our existing towers, and constructing and acquiring new towers that we expect will generate future cash flow growth and attractive long-term returns by adding tenants to those assets over time. We have recently spent, and expect to continue to spend, a significant percentage of our discretionary investments on the construction of small cells and fiber until the closing of the sale of the Fiber Business. See note 3 to our condensed consolidated financial statements and \n\"Item 2. MD&A—General Overview\" \nfor further discussion of the pending sale of the Fiber Business.  Also, see note 13 to our condensed consolidated financial statements and \n\"Item 2. MD&A—Highlights of Business Fundamentals and Results\"\n for a discussion of the 2024 Restructuring Plan, which resulted in, among other things, an increase in return thresholds on new growth opportunities in our small cells and fiber solutions businesses. We seek to fund our discretionary investments with both cash \n27\ngenerated by operating activities and cash available from financing capacity, such as the use of our availability under our senior unsecured revolving credit facility (\"2016 Revolver\"), issuances under our commercial paper program (\"CP Program\"), debt financings and issuances of equity or equity-related securities, including under our 2024 ATM Program. \nWe seek to maintain a capital structure that we believe drives long-term stockholder value and optimizes our weighted-average cost of capital, and we expect to maintain an investment grade credit profile. As of September 30, 2025, our contractual debt maturities over the next 12 months, consist of (1) short-term, unsecured commercial paper notes (\"Commercial Paper Notes\"), of which we had $1.9 billion outstanding as of November 4, 2025, (2) the 4.450% senior unsecured notes due February 2026 (\"4.450% Senior Notes\"), (3) the 3.700% senior unsecured notes due June 2026 (\"3.700% Senior Notes\"), (4) the 1.050% senior unsecured notes due July 2026 (\"1.050% Senior Notes\") and (5) principal payments on certain outstanding debt. Amounts available under our CP Program may be repaid and re-issued from time to time and we intend to maintain available commitments under our 2016 Revolver in an amount at least equal to the amount of Commercial Paper Notes outstanding.\nWe operate as a REIT for U.S. federal income tax purposes. We expect to continue to pay minimal cash income taxes as a result of our REIT status and our NOLs. See note 7 to our condensed consolidated financial statements and also the 2024 Form 10-K.\nLiquidity Position. \nThe following is a summary of our capitalization and liquidity position as of September 30, 2025. See \n\"Item 3. Quantitative and Qualitative Disclosures About Market Risk\"\n and note 5 to our condensed consolidated financial statements for additional information regarding our debt as well as note 10 to our condensed consolidated financial statements for additional information regarding our 2024 ATM Program. \n(In millions of dollars)\nCash and cash equivalents and restricted cash and cash equivalents\n(a)\n$\n238 \nUndrawn 2016 Revolver availability\n(b)\n6,061 \nDebt and other long-term obligations (current and non-current)\n24,319 \nTotal equity (deficit)\n(1,493)\n(a)\nInclusive of $5 million included within \"Other assets, net\" on our condensed consolidated balance sheet.\n(b)\nAvailability at any point in time is subject to certain restrictions based on the maintenance of financial covenants contained in our 2016 Credit Facility. See the\n \n2024 Form 10-K. At any point in time, we intend to maintain available commitments under our 2016 Revolver in an amount at least equal to the amount of outstanding Commercial Paper Notes. See note 5 to our condensed consolidated financial statements.\nAs of September 30, 2025, over the next 12 months: \n•\nOur liquidity sources may include (1) cash on hand, (2) cash generated by our operating activities, (3) availability under our 2016 Revolver, (4) issuances under our CP Program, and (5) issuances of equity pursuant to our 2024 ATM Program. Our liquidity uses over the next 12 months, are expected to include (1) debt obligations of $4.7 billion (consisting of Commercial Paper Notes, the 4.450% Senior Notes, the 3.700% Senior Notes, the 1.050% Senior Notes and principal payments on certain outstanding debt), (2) common stock dividend payments,  (3) capital expenditures and (4) purchase shares of our common stock. \n•\nAmounts available under our CP Program may be repaid and re-issued from time to time and we intend to maintain available commitments under our 2016 Revolver in an amount at least equal to the amount of Commercial Paper Notes outstanding.  \n•\nSee \n\"Item 3. Quantitative and Qualitative Disclosures About Market Risk\"\n for a discussion of interest rate risk and note 5 to our condensed consolidated financial statements for a tabular presentation of our debt maturities and a discussion of anticipated repayment dates. \n•\nUpon the closing of the Strategic Fiber Transaction, which is expected to occur in the first half of 2026, the Company expects to use a portion of the cash proceeds to repay existing indebtedness and fund anticipated share repurchases.\n•\nDuring the next 12 months, while our liquidity uses are expected to exceed our cash generated by operating activities, we expect that our liquidity sources described above should be sufficient to cover our expected uses. Historically, from time to time, we have accessed the capital markets to issue debt and equity.\n28\nSummary Cash Flow Information\nNine Months Ended September 30,\n(In millions of dollars)\n2025\n2024\nChange\nNet cash provided by (used for):\nOperating activities\n$\n2,187 \n$\n2,066 \n$\n121 \nInvesting activities\n(805)\n(947)\n142 \nFinancing activities\n(1,422)\n(1,028)\n(394)\nNet increase (decrease) in cash and cash equivalents and restricted cash and cash equivalents\n(a)\n$\n(40)\n$\n91 \n$\n(131)\n(a)\nInclusive of cash and cash equivalents and restricted cash and cash equivalents included in discontinued operations.\nOperating Activities\nNet cash provided by operating activities of $2.2 billion for the first nine months of 2025 increased by $121 million, or 6%, compared to the first nine months of 2024, due primarily to a net increase from changes in working capital. Changes in working capital contribute to variability in net cash provided by operating activities, largely due to the timing of advanced payments by us and advanced receipts from tenants. We expect to grow our net cash provided by operating activities in the future (exclusive of changes in working capital) if we realize expected growth in our core business.\nInvesting Activities\nNet cash used for investing activities of $805 million for the first nine months of 2025 decreased by $142 million, or 15%, from the first nine months of 2024 primarily as a result of a decrease in discretionary capital expenditures related to discontinued operations.\nOur capital expenditures are categorized as discretionary or sustaining as described below. \n•\nDiscretionary capital expenditures relating to continuing operations are those made with respect to activities which we believe exhibit sufficient potential to enhance long-term stockholder value. Discretionary capital expenditures, including with respect to discontinued operations, primarily consist of expansion or development of our communications infrastructure (including capital expenditures related to (1) enhancing communications infrastructure in order to add new tenants for the first time or support subsequent tenant equipment augmentations or (2) modifying the structure of a communications infrastructure asset to accommodate additional tenants) and construction of new communications infrastructure. Discretionary capital expenditures also include purchases of land interests (which primarily relate to land assets under towers as we seek to manage our interests in the land beneath our towers), certain technology-related investments necessary to support and scale future customer demand for our communications infrastructure, and other capital projects. The expansion or development of existing communications infrastructure to accommodate new leasing typically varies based on, among other factors: (1) the type of communications infrastructure, (2) the scope, volume, and mix of work performed on the communications infrastructure, (3) existing capacity prior to installation, or (4) changes in structural engineering regulations and standards. Currently, construction of new communications infrastructure is predominately comprised of the construction of small cells and fiber (including certain construction projects that may take 18 to 36 months to complete). Our decisions regarding discretionary capital expenditures are influenced by the availability and cost of capital and expected returns on alternative uses of cash, such as payments of dividends and investments. \n•\nSustaining capital expenditures consist of those capital expenditures (including with respect to discontinued operations) not otherwise categorized as discretionary capital expenditures, such as (1) maintenance capital expenditures on our communications infrastructure assets that enable our tenants' ongoing quiet enjoyment of the communications infrastructure and (2) ordinary corporate capital expenditures.\n29\nA summary of our capital expenditures for continuing operations for the nine months ended September 30, 2025 and 2024 is as follows:\nFor the Nine Months Ended\n(In millions of dollars)\nSeptember 30, 2025\nSeptember 30, 2024\nDiscretionary:\nTower improvements and other capital projects\n(a)\n$\n54 \n$\n64 \nPurchases of land interests\n50 \n38 \nSustaining\n19 \n22 \nTotal\n$\n123 \n$\n124 \n(a)\nIncludes $5 million and $10 million of capital expenditures incurred during the nine months ended September 30, 2025 and 2024, respectively, in connection with tenant installations and upgrades on our towers.\nThe reduction in discretionary capital expenditures for our discontinued operations during the first nine months of 2025 compared to the same period in 2024 was primarily related to the higher return thresholds on new growth opportunities as a result of the review of the Fiber Business completed in the third quarter of 2024. The discretionary capital expenditures for our continuing operations were relatively stable as tower investments related to tenant activity were offset by an increase in land purchases under our towers. \nFinancing Activities\nWe seek to allocate cash generated by our operations in a manner that will enhance long-term stockholder value, which may include various financing activities such as (in no particular order): (1) paying dividends on our common stock, (2) purchasing our common stock or (3) purchasing, repaying, or redeeming our debt. See notes 5 and 10 to our condensed consolidated financial statements.\nNet cash used for financing activities of $1.4 billion for the first nine months of 2025 increased by $394 million from the first nine months of 2024 as a result of the net impact from our issuances and repayments of debt (including with respect to our 2016 Credit Facility and CP Program), offset by a decline in dividends paid. See \"\nItem 2. MD&A—General Overview—Highlights of Business Fundamentals and Results\"\n and notes 5 and 10 to our condensed consolidated financial statements for further information.\nCredit Facility. \nThe proceeds from our 2016 Revolver may be used for general corporate purposes, which may include the financing of capital expenditures, acquisitions, the repayment or repurchase of any outstanding indebtedness and purchases of our common stock. As of November 4, 2025, we had an outstanding balance of $730 million and $6.2 billion in undrawn availability under our 2016 Revolver. At any point in time, we intend to maintain available commitments under our 2016 Revolver in an amount at least equal to the amount of outstanding Commercial Paper Notes. See note 5 to our condensed consolidated financial statements for additional information regarding our 2016 Credit Facility.\nCommercial Paper Program\n. The proceeds from our Commercial Paper Notes may be used for general corporate purposes, which may include the financing of capital expenditures, acquisitions, the repayment or repurchase of any outstanding indebtedness and purchases of our common stock. As of November 4, 2025, there was $1.9 billion outstanding under our CP Program. See note 5 to our condensed consolidated financial statements for further information regarding our CP Program.\nIncurrence, Purchases, and Repayments of Debt. \nSee \n\"Item 7. MD&A—General Overview\",\n \"\nMD&A—Liquidity and Capital Resources—Overview—Liquidity Position\" \nand note 7 of our consolidated financial statements in the 2024 Form 10-K for further discussion of our recent issuances, purchases, redemptions and repayments of debt.\nCommon Stock Activity. \nSee note 10 to our condensed consolidated financial statements for further information regarding our common stock and dividends.\n30\nATM Program. \nIn March 2024, we established the 2024 ATM Program through which we may issue and sell shares of our common stock having an aggregate gross sales price of up to $750 million. Sales under the 2024 ATM Program may be made by means of ordinary brokers' transactions on the New York Stock Exchange (\"NYSE\") or otherwise at market prices prevailing at the time of sale, at prices related to prevailing market prices or, subject to our specific instructions, at negotiated prices. We intend to use the net proceeds from any sales under the 2024 ATM Program for general corporate purposes, which may include (1) the funding of future acquisitions or investments or (2) the repayment or repurchase of any outstanding indebtedness. We have not sold any shares of common stock under the 2024 ATM Program.\nDebt Covenants. \nOur 2016 Credit Agreement contains financial maintenance covenants. We are currently in compliance with these financial maintenance covenants and, based upon our current expectations, we believe we will continue to comply with our financial maintenance covenants. In addition, certain of our debt agreements contain restrictive covenants that place restrictions on us and may limit our ability to, among other things, incur additional debt and liens, purchase our securities, make capital expenditures, dispose of assets, undertake transactions with affiliates, make other investments, pay dividends or distribute excess cash flow. See the 2024 Form 10-K for a further discussion of our debt covenants, certain restrictive covenants and factors that are likely to determine our subsidiaries' ability to comply with current and future debt covenants.\nAccounting and Reporting Matters \nCritical Accounting Policies and Estimates \nOur critical accounting policies and estimates are those that we believe (1) are most important to the portrayal of our financial condition and results of operations or (2) require our most difficult, subjective or complex judgments, often as a result of the need to make estimates about the effect of matters that are inherently uncertain. In many cases, the accounting treatment of a particular transaction is specifically prescribed by GAAP. In other cases, management is required to exercise judgment in the application of accounting principles with respect to particular transactions. Accordingly, actual results could differ materially from our estimates. Our critical accounting policies and estimates as of December 31, 2024 are described in \n\"Item 7. MD&A—Accounting and Reporting Matters\"\n and in note 2 of our consolidated financial statements in the 2024 Form 10-K. \nAccounting Pronouncements\nRecently Adopted Accounting Pronouncements. \nSee note 2 to our condensed consolidated financial statements.\nRecent Accounting Pronouncements Not Yet Adopted. \nSee note 2 to our condensed consolidated financial statements.\nNon-GAAP Financial Measures \nWe define earnings before interest, taxes, depreciation, amortization and accretion, as adjusted (\"Adjusted EBITDA\") as net income (loss) plus restructuring charges (credits), asset write-down charges, goodwill impairment, acquisition and integration costs, depreciation, amortization and accretion, amortization of prepaid lease purchase price adjustments, interest expense and amortization of deferred financing costs, net, (gains) losses on retirement of long-term obligations, net (gain) loss on interest rate swaps, (gains) losses on foreign currency swaps, impairment of available-for-sale securities, interest income, other (income) expense, (benefit) provision for income taxes, (income) loss from discontinued operations, net of tax, cumulative effect of a change in accounting principle and stock-based compensation expense, net. \nWe use Adjusted EBITDA, which is a non-GAAP financial measure, as an indicator of consolidated financial performance. Our measure of Adjusted EBITDA may not be comparable to similarly titled measures of other companies, including companies in the towers sector or other REITs, and is not a measure of performance calculated in accordance with GAAP. Adjusted EBITDA should not be considered in isolation or as a substitute for operating income (loss), net income (loss), net cash provided by (used for) operating, investing and financing activities or other income statement or cash flow statement data prepared in accordance with GAAP and should be considered only as a supplement to net income (loss) computed in accordance with GAAP as a measure of our performance. There are material limitations to using a measure such as Adjusted EBITDA, including the difficulty associated with comparing results among more than one company, including our competitors, and the inability to analyze certain significant items, including depreciation and interest expense, that directly affect our net income (loss). Management compensates for these limitations by considering the economic effect of the excluded expense items independently as well as in connection with their analysis of net income (loss). The reconciliation of Adjusted EBITDA to our net income (loss) is set forth below: \n31\n(In millions of dollars; components may not sum to totals due to rounding)\nThree Months Ended September 30,\nNine Months Ended September 30,\n2025\n2024\n2025\n2024\nNet income (loss)\n$\n323 \n$\n303 \n$\n150 \n$\n865 \nAdjustments to increase (decrease) net income (loss):\nAsset write-down charges\n3 \n2 \n7 \n10 \nDepreciation, amortization and accretion\n167 \n181 \n520 \n552 \nRestructuring charges\n— \n38 \n— \n67 \nAmortization of prepaid lease purchase price adjustments\n4 \n4 \n11 \n12 \nInterest expense and amortization of deferred financing costs, net\n247 \n236 \n726 \n692 \nInterest income\n(3)\n(6)\n(10)\n(14)\nOther (income) expense\n— \n5 \n(3)\n3 \n(Benefit) provision for income taxes\n4 \n3 \n13 \n14 \nStock-based compensation expense, net\n19 \n19 \n55 \n69 \n(Income) loss from discontinued operations, net of tax\n(46)\n(9)\n676 \n(12)\nAdjusted EBITDA\n(a)\n$\n718 \n$\n777 \n$\n2,145 \n$\n2,258 \n(a)\nThe above reconciliation excludes the items included in our Adjusted EBITDA definition which are not applicable to the periods shown.\nWe believe Adjusted EBITDA is useful to investors or other interested parties in evaluating our financial performance because: \n•\nit is frequently used by our management (1) to evaluate the economic productivity of our operations and (2) for purposes of making decisions about allocating resources to, and assessing the performance of, our operations; \n•\nalthough specific definitions may vary, it is widely used by investors or other interested parties in evaluation of the communications infrastructure sector and other REITs to measure financial performance without regard to items such as depreciation, amortization and accretion, which can vary depending upon accounting methods and the book value of assets; \n•\nwe believe it helps investors and other interested parties meaningfully evaluate and compare the results of our operations (1) from period to period and (2) to our competitors by removing the impact of our capital structure (primarily interest charges from our outstanding debt) and asset base (primarily depreciation, amortization and accretion) from our financial results; and \n•\nit is similar to the measure of current financial performance generally used in our debt covenant calculations. \nOur management uses Adjusted EBITDA: \n•\nas a component in the employee annual incentive compensation calculation; \n•\nas a measurement of financial performance because it assists us in comparing our financial performance on a consistent basis as it removes the impact of our capital structure (primarily interest charges from our outstanding debt) and asset base (primarily depreciation, amortization and accretion) from our operating results; \n•\nin presentations to our board of directors to enable it to have the same measurement of financial performance used by management; \n•\nfor planning purposes, including preparation of our annual operating budget; \n•\nas a valuation measure in strategic analyses in connection with the purchase and sale of assets; \n•\nin determining self-imposed limits on our debt levels, including the evaluation of our leverage ratio; and \n•\nwith respect to compliance with our debt covenants, which require us to maintain certain financial ratios that incorporate concepts such as, or similar to, Adjusted EBITDA. \n32\nWe define Adjusted Site Rental Gross Margin as net income (loss) plus services and other costs of operations, selling, general and administrative expenses, restructuring charges (credits), asset write-down charges, goodwill impairment, acquisition and integration costs, depreciation, amortization and accretion, amortization of prepaid lease purchase price adjustments, interest expense and amortization of deferred financing costs, net, (gains) losses on retirement of long-term obligations, net (gain) loss on interest rate swaps, (gains) losses on foreign currency swaps, impairment of available-for-sale securities, interest income, other (income) expense, (benefit) provision for income taxes, (income) loss from discontinued operations, net of tax, cumulative effect of a change in accounting principle and stock-based compensation expense, net, recorded in consolidated site rental costs of operations, less services and other revenues. \nWe define Adjusted Services and Other Gross Margin as net income (loss) plus site rental costs of operations, selling, general and administrative expenses, restructuring charges (credits), asset write-down charges, goodwill impairment, acquisition and integration costs, depreciation, amortization and accretion, interest expense and amortization of deferred financing costs, net, (gains) losses on retirement of long-term obligations, net (gain) loss on interest rate swaps, (gains) losses on foreign currency swaps, impairment of available-for-sale securities, interest income, other (income) expense, (benefit) provision for income taxes, (income) loss from discontinued operations, net of tax, cumulative effect of a change in accounting principle and stock-based compensation expense, net, recorded in consolidated services and other costs of operations, less site rental revenues.\nWe use Adjusted Site Rental Gross Margin and Adjusted Services and Other Gross Margin, which are non-GAAP financial measures, as indicators of financial performance. Our measures of Adjusted Site Rental Gross Margin and Adjusted Services and Other Gross Margin may not be comparable to similarly titled measures of other companies, including companies in the towers sector or other REITs, and are not measures of performance calculated in accordance with GAAP. There are material limitations to using measures such as Adjusted Site Rental Gross Margin and Adjusted Services and Other Gross Margin, including the difficulty associated with comparing results among more than one company, including our competitors, and the inability to analyze certain significant items, including selling, general and administrative expenses and depreciation, amortization, and accretion, that directly affect our net income (loss). Management compensates for these limitations by considering the economic effect of the excluded expense items independently as well as in connection with their analysis of net income (loss).  The reconciliations of Adjusted Site Rental Gross Margin and Adjusted Services and Other Gross Margin to our net income (loss) are set forth below:\n33\nThree Months Ended September 30,\nNine Months Ended September 30,\n(In millions of dollars; components may not sum to totals due to rounding)\n2025\n2024\n2025\n2024\nNet income (loss)\n$\n323 \n$\n303 \n$\n150 \n$\n865 \nAdjustments to increase (decrease) net income (loss):\nServices and other revenues\n(60)\n(54)\n(162)\n(143)\nServices and other costs of operations\n30 \n27 \n84 \n81 \nSelling, general and administrative expenses\n97 \n93 \n289 \n343 \nAsset write-down charges\n3 \n2 \n7 \n10 \nDepreciation, amortization and accretion\n167 \n181 \n520 \n552 \nRestructuring charges\n— \n38 \n— \n67 \nAmortization of prepaid lease purchase price adjustments\n4 \n4 \n11 \n12 \nInterest expense and amortization of deferred financing costs, net\n247 \n236 \n726 \n692 \nInterest income\n(3)\n(6)\n(10)\n(14)\nOther (income) expense\n— \n5 \n(3)\n3 \n(Benefit) provision for income taxes\n4 \n3 \n13 \n14 \nStock-based compensation expense, net recorded in site rental costs of operations\n1 \n1 \n3 \n3 \n(Income) loss from discontinued operations, net of tax\n(46)\n(9)\n676 \n(12)\nAdjusted Site Rental Gross Margin\n$\n767 \n$\n823 \n$\n2,304 \n$\n2,473 \nThree Months Ended September 30,\nNine Months Ended September 30,\n(In millions of dollars; components may not sum to totals due to rounding)\n2025\n2024\n2025\n2024\nNet income (loss)\n$\n323 \n$\n303 \n$\n150 \n$\n865 \nAdjustments to increase (decrease) net income (loss):\nSite rental revenues\n(1,012)\n(1,066)\n(3,031)\n(3,198)\nSite rental costs of operations\n(a)\n250 \n247 \n741 \n740 \nSelling, general and administrative expenses\n97 \n93 \n289 \n343 \nAsset write-down charges\n3 \n2 \n7 \n10 \nDepreciation, amortization and accretion\n167 \n181 \n520 \n552 \nRestructuring charges\n— \n38 \n— \n67 \nInterest expense and amortization of deferred financing costs, net\n247 \n236 \n726 \n692 \nInterest income\n(3)\n(6)\n(10)\n(14)\nOther (income) expense\n— \n5 \n(3)\n3 \n(Benefit) provision for income taxes\n4 \n3 \n13 \n14 \nStock-based compensation expense, net recorded in services and other costs of operations\n1 \n2 \n4 \n5 \n(Income) loss from discontinued operations, net of tax\n(46)\n(9)\n676 \n(12)\nAdjusted Services and Other Gross Margin\n$\n31 \n$\n29 \n$\n82 \n$\n67 \n \n(a)\nExclusive of depreciation, amortization and accretion, shown separately.\nWe believe Adjusted Site Rental Gross Margin and Adjusted Services and Other Gross Margin are useful to investors or other interested parties in evaluating our financial performance because:\n•\nthey are measures used by our management (1) to evaluate the economic productivity of our business, (2) to identify underlying business trends that are impacting our performance, and (3) for purposes of making decisions about allocating resources to, and assessing the performance of, our business; and\n•\nwe believe it helps investors and other interested parties meaningfully evaluate and compare the results of our operations from period to period. \nOur management uses Adjusted Site Rental Gross Margin and Adjusted Services and Other Gross Margin:\n•\nas a measurement of financial performance because it assists us in comparing our financial performance excluding the impact of certain non-cash items such as stock-based compensation expense, net and amortization of prepaid lease purchase price adjustments and asset base (primarily depreciation, amortization and accretion) from our operating results and before consideration of selling, general and administrative expenses; \n•\nin the evaluation of pricing of new projects and new tenant agreements; and\n•\nfor planning purposes, including preparation of our annual operating budget.\n34"
}