{
  "source_file": "cdns-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nThe following discussion should be read in conjunction with the condensed consolidated financial statements and notes thereto included in this Quarterly Report on Form 10-Q (this “Quarterly Report”) and in conjunction with our Annual Report on Form 10-K for the fiscal year ended December 31, 2024 (our “Annual Report”)\n.\n This Quarterly Report contains statements that are not historical in nature, are predictive, or that depend upon or refer to future events or conditions or contain other forward-looking statements. Statements including, but not limited to, statements regarding the extent, timing and mix of future revenues and customer demand; the deployment of our products and services; the impact of the macroeconomic and geopolitical environment, including but not limited to, expanded trade controls, tariffs, conflicts around the world, volatility in foreign currency exchange rates, inflation and changes in interest rates; the impact of government actions; future costs, expenses, tax rates and uses of cash; legal, administrative and tax proceedings, including our settlements with BIS and the DOJ and ongoing obligations; restructuring actions and associated charges and benefits; pending acquisitions, the accounting for acquisitions and integration of acquired businesses; and other statements using words such as “anticipates,” “believes,” “could,” “estimates,” “expects,” “forecasts,” “intends,” “may,” “plans,” “projects,” “should,” “targets,” “will” and “would,” and words of similar import and the negatives thereof, constitute forward-looking statements. These statements are predictions based upon our current expectations about future events. Actual results could vary materially as a result of certain factors, including, but not limited to, those expressed in these statements. We refer you to the “Results of Operations,” “Quantitative and Qualitative Disclosures About Market Risk,” and “Liquidity and Capital Resources” sections contained in this Quarterly Report, the \"Risk Factors\" section contained in our Annual Report and this Quarterly Report, and the risks discussed in our other Securities and Exchange Commission (“SEC”) filings, which identify important risks and uncertainties that could cause actual results to differ materially from those contained in the forward-looking statements.\nWe urge you to consider these factors carefully in evaluating the forward-looking statements contained in this Quarterly Report. All subsequent written or oral forward-looking statements attributable to our company or persons acting on our behalf are expressly qualified in their entirety by these cautionary statements. The forward-looking statements included in this Quarterly Report are made only as of the date of this Quarterly Report. We disclaim any obligation to update these forward-looking statements, except as required by law.\nAs used in this Quarterly Report on Form 10-Q, “we,” “us,” “our company” and \"Cadence” mean Cadence Design Systems, Inc. and our subsidiaries, unless the context indicates or requires otherwise.\nBusiness Overview\nCadence\n®\n is a global market leader that develops computational, AI-driven software, accelerated hardware, and intellectual property (“IP”) solutions for engineers and scientists to bring new and innovative products to life. Many of the world’s most innovative technology companies use our solutions and services to deliver transformational products to multiple industries that drive the global economy. The products these companies develop are some of the most complex systems in the world. Since our inception, we have been at the forefront of technology innovation. We work closely with our customers, helping them solve their most complex challenges in the semiconductor and electronic systems industries to unlock limitless opportunities.\nOur customers include semiconductor companies that design and manufacture semiconductor devices and systems companies that design and manufacture products containing many different types of semiconductors, which they either make themselves or buy from a semiconductor company. Semiconductors, also referred to as integrated circuits (“ICs”), or chips, are at the heart of almost every major industry. Semiconductors are the catalyst for innovation in many industries including automotive, aerospace, biotech, hyperscale and cloud computing, data centers, telecommunications, medical technology, industrial internet of things (“IIoT”), and AI. They are found in a wide variety of consumer products such as cell phones, automobiles, computers, home appliances, home security, drones, and home entertainment systems.\nOur Intelligent System Design™ (“ISD”) strategy allows us to deliver solutions to our customers to solve their most complex product development challenges. Our industry-leading computational software, accelerated hardware, and IP enable us to adapt to our customers' dynamic design requirements, allowing them to meet their critical business and environmental concerns including time-to-market and sustainability. The creation of even the most seemingly simple electronic systems and products typically includes a complex design process and requires highly trained engineers with various areas of specialized knowledge and skill sets. Our ability to deliver innovative products that keep up with increasing complexity allows our customers to be successful in meeting their business goals and objectives.\nIn alignment with our ISD strategy, we group our solutions in three product categories: Core EDA, Semiconductor IP, and System Design and Analysis. Core EDA includes our software, hardware, and services used to design and verify a wide variety of semiconductors. Our Semiconductor IP portfolio includes silicon subsystems, software, and services that are used in semiconductor design. The System Design and Analysis category includes our software and services used to design and verify a wide variety of physical electronic systems. Leveraging our AI and computational software expertise, we have integrated the multiphysics domain (also known as “computational fluid dynamics,” or “CFD”) with our EDA solutions to provide customers with complete system-level design and analysis solutions. These categories are tightly integrated to provide complete design solutions for our customers. \n24\nFor additional information about our products, see the discussion in Item 1, “Business,” under the heading “Product Categories,” in our Annual Report.\nManagement uses certain performance indicators to manage our business, including revenue, certain elements of operating expenses and cash flow from operations, and we describe these items further below under the headings “Results of Operations” and “Liquidity and Capital Resources.”\nAcquisitions\nAs part of our ISD strategy, we invest in and acquire complementary businesses, joint ventures, services and technologies and IP rights. The size and timing of these investments and acquisitions may affect comparability of revenue, expenses and cash flows between fiscal periods.\nDuring the second quarter of fiscal 2024, we completed our acquisition of BETA CAE Systems International AG (“BETA CAE”), a system analysis platform provider of multi-domain, engineering simulation solutions. For the three and nine months ended September 30, 2025, revenue associated with contracts assumed with our acquisition of BETA CAE was primarily classified as product and maintenance revenue in our System Design and Analysis product category, and cost of revenue associated with these contracts was primarily classified as cost of product and maintenance in our condensed consolidated income statements.\nDuring the second quarter of fiscal 2025, we completed our acquisition of a holding company containing the VLAB Works business (“VLAB Works”). VLAB Works is a leader in virtual models for hardware verification and software development. Additionally, during the third quarter of fiscal 2025, we acquired the Artisan foundation IP business from Arm Limited. The acquisition of Artisan foundation IP furthers our comprehensive IP strategy by expanding our design IP offerings with standard cell libraries, memory compilers, and general purpose I/Os (“GPIOs”) optimized for advanced process nodes at leading foundries. For the three and nine months ended September 30, 2025, revenue associated with contracts assumed with our acquisition of VLAB Works was primarily classified as product and maintenance revenue in our Core EDA product category. For the three and nine months ended September 30, 2025, revenue associated with contracts assumed with our acquisition of the Artisan foundation IP business was primarily classified as product and maintenance revenue in our IP product category. The cost of revenue associated with these contracts was primarily classified as cost of product and maintenance in our condensed consolidated income statements.\nOn September 4, 2025, we entered into a definitive agreement with Hexagon Smart Solutions AB (“Hexagon”) to acquire Hexagon’s design and engineering business. This acquisition is expected to accelerate our Intelligent System Design™ strategy by expanding our System Design & Analysis portfolio, building upon our acquisition of BETA CAE in fiscal 2024. The acquisition includes substantially all of the subsidiaries and related assets comprising Hexagon's design and engineering business. Among other conditions, closing is conditioned on the expiration or termination of the applicable waiting period under the Hart-Scott Rodino Antitrust Improvements Act of 1976, as amended, and receipt of other required approvals under antitrust and foreign direct investment laws of certain other jurisdictions.\nMacroeconomic and Geopolitical Environment\nBecause we operate globally, our business is subject to the effects of economic downturns or recessions in the regions in which we do business, volatility in foreign currency exchange rates relative to the U.S. dollar, inflation, changing interest rates, expanded trade control laws and regulations, imposition of new or higher tariffs and geopolitical conflicts.\nTrade control laws and regulations have expanded over the past several years, including through the imposition of certain export control restrictions concerning advanced node IC production in China, the inclusion of additional Chinese technology companies on the Bureau of Industry and Security (“BIS”) “Entity List” and the issuance of new regulations governing the sale of certain technologies. In furtherance of these regulations, effective September 29, 2025, BIS issued an interim final rule that extended the export restrictions imposed on entities identified on the Entity List or the Military End-User List and other certain sanctioned parties, to entities that are 50% or more owned by one or more such entities. While we are still evaluating the potential impact of this interim final rule on our business, we expect the impact of these expanded trade control laws and regulations on our business to be limited.\nAs previously reported, on May 23, 2025, BIS informed us that a license was required for the export, re-export or in-country transfer of EDA software and technology classified under Export Control Classification Numbers (ECCNs) 3D991 and 3E991 on the Commerce Control List (“EDA Software and Technology”), when a party to the transaction is located in China or is a Chinese “military end user” wherever located. On July 2, 2025, BIS informed us that the license requirements set forth in the May 23, 2025 letter from BIS were rescinded effective immediately. During this period, our revenue in China decreased primarily due to reduced deliveries of software offerings to our customers in China due to these license requirements. Following the rescission, we have restored access to EDA Software and Technology for affected customers in accordance with these updated U.S. export regulations. However, in light of continued negotiations between the U.S. and China, the United States may consider reimposing these or additional restrictions on the export, re-export or in-country transfer of EDA Software and Technology or our other products and services in China in the future. \n25\nAs previously disclosed, on July 27, 2025, we reached a settlement with each of BIS and the U.S. Department of Justice (“DOJ”) that resolved matters relating to export control violations that occurred between 2015 and 2021 primarily involving sales initiated by a Cadence subsidiary of products and services valued at $45.3 million in total over that period to a customer in China, as well as the subsequent transfer of technology involved in those sales to a third party in China, without the requisite authorization from BIS. These settlement agreements include ongoing audit, compliance and other obligations. \nIn addition, U.S. President Trump has made a series of announcements regarding the imposition of new and higher U.S. tariffs on imports from many countries, including China and Mexico. In response, China and other countries, as well as the European Union, have announced retaliatory tariffs on imports of U.S. goods and other countermeasures. We are monitoring these actions, including any pauses, escalations, exemptions or removal of exemptions, with respect to the threatened or imposed tariffs, and will continue to assess their potential impact on our business either directly, such as on our hardware business, or due to downstream effects.\nWe also continuously monitor geopolitical conflicts around the world, including the ongoing conflict between Russia and Ukraine and conflicts in the Middle East, and assess their impact on our business. To date, these conflicts have not materially limited our ability to develop or support our products and have not had a material impact on our results of operations, financial condition, liquidity or cash flows.\nWhile our business model provides some resilience against these factors, we will continue to monitor the direct and indirect impacts of these or similar circumstances on our business and financial results. For additional information on the potential impact of macroeconomic and geopolitical conditions on our business, see the “Risk Factors” section in our Annual Report and this Quarterly Report. For additional information on the potential impact of foreign currency exchange rates and interest rates on our business, see the “Quantitative and Qualitative Disclosures About Market Risk” section of this Quarterly Report. \nCritical Accounting Estimates\nIn preparing our condensed consolidated financial statements, we make assumptions, judgments and estimates that can have a significant impact on our revenue, operating income and net income, as well as on the value of certain assets and liabilities on our condensed consolidated balance sheets. We base our assumptions, judgments and estimates on historical experience and various other factors that we believe to be reasonable under the circumstances. Actual results could differ materially from these estimates under different assumptions or conditions. At least quarterly, we evaluate our assumptions, judgments and estimates, and make changes as deemed necessary.\nFor additional information about our critical accounting estimates, see the discussion in Item 7, “Management’s Discussion and Analysis of Financial Condition and Results of Operations,” under the heading “Critical Accounting Estimates” in our Annual Report.\nNew Accounting Standards\nFor additional information about the adoption of new accounting standards, see Note 1 in the notes to condensed consolidated financial statements.\nResults of Operations\nOur financial results reflect the following for the three and nine months ended September 30, 2025 compared to the three and nine months ended September 30, 2024 (unless otherwise stated):\n•\nGrowth in revenue from our hardware, software and IP offerings, including revenue from our recent acquisitions; \n•\nIncreases in operating expenses related to marketing, sales and research and development activities from continued investment in research and development and technical sales support, including additional headcount from acquisitions;\n•\nA loss related to a contingent liability recognized during the nine months ended September 30, 2025; and\n•\nIncreased interest expense from our outstanding indebtedness.\nRevenue\nWe primarily generate revenue from licensing our software and IP, selling or leasing our hardware products, providing maintenance for our software, hardware and IP, providing engineering services and earning royalties generated from the use of our IP. The timing of our revenue is significantly affected by the mix of software, hardware and IP products generating revenue in any given period and whether the revenue is recognized over time or at a point in time, upon completion of delivery.\nRecurring revenue includes revenue recognized over time from certain of our software licensing arrangements, services, royalties, maintenance on IP licenses and hardware, and operating leases of hardware. Other recurring revenue includes revenue recognized at a point in time for certain short-term software arrangements that are typically renewed at least annually and revenue recognized at varying points in time over the term of other arrangements with non-cancelable commitments, whereby the customer commits to a fixed dollar amount over a specified period of time that can be used to purchase from a list of products. Arrangements that require future decisions on the performance obligations to be delivered do not meet the definition of a revenue contract until the customer executes a separate selection form to identify the products and services that they are purchasing. Each separate selection form under the arrangement is treated as an individual contract and accounted for based on the respective performance obligations.\n26\nThe remainder of our revenue is recognized at a point in time and is characterized as up-front revenue. Up-front revenue is primarily generated by our sales of hardware products, individual IP licenses and certain software licenses with a term greater than one year. The percentage of our recurring and up-front revenue and fluctuations in revenue within our geographies in any single fiscal period are primarily impacted by delivery of hardware and IP products to our customers.\nThe following table shows the percentage of our revenue that is classified as recurring or up-front for the three and nine months ended September 30, 2025 and September 30, 2024: \n \nThree Months Ended \nNine Months Ended\n \nSeptember 30,\n2025\nSeptember 30,\n2024\nSeptember 30,\n2025\nSeptember 30,\n2024\nRevenue recognized over time\n78 \n%\n79 \n%\n76 \n%\n83 \n%\nOther recurring revenue\n4 \n%\n4 \n%\n5 \n%\n4 \n%\nRecurring revenue\n82 \n%\n83 \n%\n81 \n%\n87 \n%\nUp-front revenue\n18 \n%\n17 \n%\n19 \n%\n13 \n%\nTotal revenue\n100 \n%\n100 \n%\n100 \n%\n100 \n%\nThe percentage of revenue characterized as recurring compared to revenue characterized as up-front may vary between fiscal quarters. During fiscal 2025, as compared to prior years, we expect the percentage of our annual up-front revenue to increase as growth in our product offerings for which revenue is recognized up-front is expected to be greater than the growth of our product offerings for which revenue is recognized over time. \nThe following table shows the percentage of recurring revenue for the twelve-month periods ending concurrently with our five most recent fiscal quarters:\n \nTrailing Twelve Months Ended \n \nSeptember 30,\n2025\nJune 30,\n2025\nMarch 31,\n2025\nDecember 31,\n2024\nSeptember 30,\n2024\nRecurring revenue\n80 \n%\n80 \n%\n82 \n%\n84 \n%\n87 \n%\nUp-front revenue\n20 \n%\n20 \n%\n18 \n%\n16 \n%\n13 \n%\nTotal\n100 \n%\n100 \n%\n100 \n%\n100 \n%\n100 \n%\nRevenue by Period\nThe following table shows our revenue for the three months ended September 30, 2025 and September 30, 2024 and the change in revenue between periods:\n \nThree Months Ended \nChange\n \nSeptember 30,\n2025\nSeptember 30,\n2024\nAmount\nPercentage\n \n(In millions, except percentages)\nProduct and maintenance\n$\n1,207.7 \n$\n1,100.4 \n$\n107.3 \n10 \n%\nServices\n131.1 \n115.1 \n16.0 \n14 \n%\nTotal revenue\n$\n1,338.8 \n$\n1,215.5 \n$\n123.3 \n10 \n%\nThe following table shows our revenue for the nine months ended September 30, 2025 and September 30, 2024 and the change in revenue between periods:\n \nNine Months Ended\nChange\n \nSeptember 30,\n2025\nSeptember 30,\n2024\nAmount\nPercentage\n \n(In millions, except percentages)\nProduct and maintenance\n$\n3,489.0 \n$\n2,974.2 \n$\n514.8 \n17 \n%\nServices\n367.6 \n311.1 \n56.5 \n18 \n%\nTotal revenue\n$\n3,856.6 \n$\n3,285.3 \n$\n571.3 \n17 \n%\nProduct and maintenance revenue increased during the three and nine months ended September 30, 2025, as compared to the three and nine months ended September 30, 2024, primarily due to growth in revenue from our software, hardware and IP product offerings as a result of existing customers' continued investment in complex designs for their products. \n27\nServices revenue increased during the three and nine months ended September 30, 2025, as compared to the three and nine months ended September 30, 2024, primarily due to increased revenue from our IP service offerings. Services revenue may fluctuate from period to period based on the timing of fulfillment of our services and IP performance obligations.\nNo single customer accounted for 10% or more of total revenue during the three and nine months ended September 30, 2025 or September 30, 2024.\nRevenue by Product Category\nThe following table shows the percentage of revenue contributed by each of our product categories for the past five consecutive quarters:\n \nThree Months Ended \n \nSeptember 30,\n2025\nJune 30,\n2025\nMarch 31,\n2025\nDecember 31,\n2024\nSeptember 30,\n2024\nCore EDA\n71 \n%\n71 \n%\n71 \n%\n68 \n%\n70 \n%\nSemiconductor IP\n14 \n%\n13 \n%\n14 \n%\n13 \n%\n14 \n%\nSystem Design and Analysis\n15 \n%\n16 \n%\n15 \n%\n19 \n%\n16 \n%\nTotal\n100 \n%\n100 \n%\n100 \n%\n100 \n%\n100 \n%\nRevenue from any one product category as a percentage of total revenue may fluctuate from period to period based on the mix of products and services sold in a given period and the timing of revenue recognition, particularly for our hardware, IP and certain software products. \nCertain of our licensing arrangements allow customers the ability to remix among software products. Additionally, we have arrangements with customers that include a combination of our products, with the actual product selection and number of licensed users to be determined at a later date. For these arrangements, we estimate the allocation of the revenue to product categories based upon the expected usage of our products. The actual usage of our products by these customers may differ, in which case the revenue allocation in the table above would differ.\nRevenue by Geography\n \nThree Months Ended \nChange\n \nSeptember 30,\n2025\nSeptember 30,\n2024\nAmount\nPercentage\n \n(In millions, except percentages)\nUnited States\n$\n532.1 \n$\n580.5 \n$\n(48.4)\n(8)\n%\nOther Americas\n43.0 \n24.9 \n18.1 \n73 \n%\nChina\n245.0 \n156.7 \n88.3 \n56 \n%\nOther Asia\n242.7 \n211.1 \n31.6 \n15 \n%\nEurope, Middle East and Africa (“EMEA”)\n189.6 \n174.6 \n15.0 \n9 \n%\nJapan\n86.4 \n67.7 \n18.7 \n28 \n%\nTotal revenue\n$\n1,338.8 \n$\n1,215.5 \n$\n123.3 \n10 \n%\nDuring the three months ended September 30, 2025, as compared to the three months ended September 30, 2024, United States revenue decreased primarily due to a shift in fulfillment toward meeting demand for hardware and IP offerings from certain international customers, who generally operate with longer lead times. This decline was partially offset by continued growth in software product revenue driven by strong customer demand.\nInternational revenue increased due to higher demand for software offerings and increased hardware deliveries across Other Americas, China, Other Asia, and Japan. China revenue also benefited from the rescission by BIS in July 2025 of certain license requirements applicable to the export, re-export, or in-country transfer of EDA Software and Technology, which enabled additional hardware deliveries that were prevented during the quarter ended June 30, 2025.\n28\n \nNine Months Ended\nChange\n \nSeptember 30,\n2025\nSeptember 30,\n2024\nAmount\nPercentage\n \n(In millions, except percentages)\nUnited States\n$\n1,692.3 \n$\n1,523.2 \n$\n169.1 \n11 \n%\nOther Americas\n111.7 \n63.9 \n47.8 \n75 \n%\nChina\n505.1 \n401.7 \n103.4 \n26 \n%\nOther Asia\n721.5 \n617.6 \n103.9 \n17 \n%\nEurope, Middle East and Africa (“EMEA”)\n585.5 \n496.2 \n89.3 \n18 \n%\nJapan\n240.5 \n182.7 \n57.8 \n32 \n%\nTotal revenue\n$\n3,856.6 \n$\n3,285.3 \n$\n571.3 \n17 \n%\nDuring the nine months ended September 30, 2025, as compared to the nine months ended September 30, 2024, revenue in each of our six geographies increased primarily due to continued demand for our software, hardware and IP product offerings.\nRevenue by Geography as a Percent of Total Revenue:\n \nThree Months Ended \nNine Months Ended\n \nSeptember 30,\n2025\nSeptember 30,\n2024\nSeptember 30,\n2025\nSeptember 30,\n2024\nUnited States\n40 \n%\n48 \n%\n44 \n%\n46 \n%\nOther Americas\n3 \n%\n2 \n%\n3 \n%\n2 \n%\nChina\n18 \n%\n13 \n%\n13 \n%\n12 \n%\nOther Asia\n18 \n%\n17 \n%\n19 \n%\n19 \n%\nEMEA\n14 \n%\n14 \n%\n15 \n%\n15 \n%\nJapan\n7 \n%\n6 \n%\n6 \n%\n6 \n%\nTotal\n100 \n%\n100 \n%\n100 \n%\n100 \n%\nMost of our revenue is transacted in the U.S. dollar. However, certain revenue transactions are denominated in foreign currencies. For an additional description of how changes in foreign exchange rates affect our condensed consolidated financial statements, see the discussion under Item 3, “Quantitative and Qualitative Disclosures About Market Risk – Foreign Currency Risk.”\nCost of Revenue\n \nThree Months Ended \nChange\n \nSeptember 30,\n2025\nSeptember 30,\n2024\nAmount\nPercentage\n \n(In millions, except percentages)\nCost of product and maintenance\n$\n118.7 \n$\n109.6 \n$\n9.1 \n8 \n%\nCost of services\n63.5 \n53.5 \n10.0 \n19 \n%\n \nNine Months Ended\nChange\n \nSeptember 30,\n2025\nSeptember 30,\n2024\nAmount\nPercentage\n \n(In millions, except percentages)\nCost of product and maintenance\n$\n374.7 \n$\n279.4 \n$\n95.3 \n34 \n%\nCost of services\n158.8 \n148.2 \n10.6 \n7 \n%\n29\nCost of Product and Maintenance\nCost of product and maintenance includes costs associated with the sale and lease of our hardware products and licensing of our software and IP products, certain employee salary and benefits and other employee-related costs, cost of our customer support services, amortization of technology-related acquired intangibles, costs of technical documentation and royalties payable to third-party vendors. Cost of product and maintenance depends primarily on our hardware product sales in any given period, but is also affected by employee salary and benefits and other employee-related costs, reserves for inventory, and the timing and extent to which we acquire intangible assets, license third-party technology or IP, and sell our products that include such acquired or licensed assets, technology or IP.\nA summary of cost of product and maintenance is as follows:\n \nThree Months Ended \nChange\n \nSeptember 30,\n2025\nSeptember 30,\n2024\nAmount\nPercentage\n \n(In millions, except percentages)\nProduct and maintenance-related costs\n$\n102.9 \n$\n92.0 \n$\n10.9 \n12 \n%\nAmortization of acquired intangibles\n15.8 \n17.6 \n(1.8)\n(10)\n%\nTotal cost of product and maintenance\n$\n118.7 \n$\n109.6 \n$\n9.1 \n8 \n%\n \nNine Months Ended\nChange\n \nSeptember 30,\n2025\nSeptember 30,\n2024\nAmount\nPercentage\n \n(In millions, except percentages)\nProduct and maintenance-related costs\n$\n328.0 \n$\n236.9 \n$\n91.1 \n38 \n%\nAmortization of acquired intangibles\n46.7 \n42.5 \n4.2 \n10 \n%\nTotal cost of product and maintenance\n$\n374.7 \n$\n279.4 \n$\n95.3 \n34 \n%\nThe changes in product and maintenance-related costs for the three and nine months ended September 30, 2025, as compared to the three and nine months ended September 30, 2024, were due to the following:\n \nChange\n \nThree Months Ended \nNine Months Ended\n(In millions)\nHardware product costs\n$\n8.6 \n$\n75.6 \nSalary, benefits and other employee-related costs\n0.1 \n9.5 \nOther items\n2.2 \n6.0 \nTotal change in product and maintenance-related costs\n$\n10.9 \n$\n91.1 \nCosts associated with our hardware products include components, assembly, testing, applicable reserves and overhead. These costs make our cost of hardware products higher, as a percentage of revenue, than our cost of software and IP products. Hardware product costs increased during the three and nine months ended September 30, 2025, as compared to the three and nine months ended September 30, 2024, primarily due to increased installations of our hardware products.\nAmortization of acquired intangibles included in cost of product and maintenance may fluctuate from period to period depending on the timing of newly acquired assets relative to assets becoming fully amortized in any given period. \nCost of Services\nCost of services primarily includes employee salary, benefits and other employee-related costs to perform work on revenue-generating projects, costs to maintain the infrastructure necessary to manage a services organization, and direct costs associated with certain design services. Cost of services may fluctuate from period to period based on our utilization of design services engineers on revenue-generating projects rather than internal development projects and the timing of design service projects being completed. \n30\nOperating Expenses\nOur operating expenses include marketing and sales, research and development, and general and administrative expenses. Factors that tend to cause our operating expenses to fluctuate include changes in the number of employees due to hiring and acquisitions, industry trends for salary and other employee benefits, the timing and nature of restricted stock grants, foreign exchange rate movements, acquisition-related costs, and volatility in variable compensation programs that are driven by operating results.\nMany of our operating expenses are transacted in various foreign currencies. We recognize lower expenses in periods when the U.S. dollar strengthens in value against other currencies and we recognize higher expenses when the U.S. dollar weakens against other currencies. For an additional description of how changes in foreign exchange rates affect our condensed consolidated financial statements, see the discussion in Item 3, “Quantitative and Qualitative Disclosures About Market Risk – Foreign Currency Risk.”\nOur operating expenses for the three and nine months ended September 30, 2025 and September 30, 2024 were as follows:\n \nThree Months Ended \nChange\n \nSeptember 30,\n2025\nSeptember 30,\n2024\nAmount\nPercentage\n \n(In millions, except percentages)\nMarketing and sales\n$\n192.6 \n$\n189.8 \n$\n2.8 \n1 \n%\nResearch and development\n423.0 \n407.4 \n15.6 \n4 \n%\nGeneral and administrative\n78.0 \n71.6 \n6.4 \n9 \n%\nTotal operating expenses\n$\n693.6 \n$\n668.8 \n$\n24.8 \n4 \n%\n \nNine Months Ended\nChange\n \nSeptember 30,\n2025\nSeptember 30,\n2024\nAmount\nPercentage\n \n(In millions, except percentages)\nMarketing and sales\n$\n595.9 \n$\n557.1 \n$\n38.8 \n7 \n%\nResearch and development\n1,304.2 \n1,157.1 \n147.1 \n13 \n%\nGeneral and administrative\n210.2 \n203.7 \n6.5 \n3 \n%\nTotal operating expenses\n$\n2,110.3 \n$\n1,917.9 \n$\n192.4 \n10 \n%\nOur operating expenses, as a percentage of total revenue, for the three and nine months ended September 30, 2025 and September 30, 2024 were as follows:\n \nThree Months Ended \nNine Months Ended\n \nSeptember 30,\n2025\nSeptember 30,\n2024\nSeptember 30,\n2025\nSeptember 30,\n2024\nMarketing and sales\n14 \n%\n16 \n%\n15 \n%\n17 \n%\nResearch and development\n32 \n%\n33 \n%\n35 \n%\n35 \n%\nGeneral and administrative\n6 \n%\n6 \n%\n5 \n%\n6 \n%\nTotal operating expenses\n52 \n%\n55 \n%\n55 \n%\n58 \n%\n31\nMarketing and Sales\nThe increase in marketing and sales expense for the three and nine months ended September 30, 2025, as compared to the three and nine months ended September 30, 2024, was due to the following:\n \nChange\n \nThree Months Ended \nNine Months Ended\n \n(In millions)\nSalary, benefits and other employee-related costs\n$\n1.2 \n$\n24.4 \nStock-based compensation\n0.1 \n10.7 \nOther items\n1.5 \n3.7 \nTotal change in marketing and sales expense\n$\n2.8 \n$\n38.8 \nSalary, benefits and other employee-related costs and stock-based compensation included in marketing and sales expense increased during the three and nine months ended September 30, 2025, as compared to the three and nine months ended September 30, 2024, primarily due to our continued investment in attracting and retaining talent dedicated to technical sales support, including additional headcount from acquisitions. We expect to continue attracting and retaining talent dedicated to technical sales support through hiring and acquisitions.\nResearch and Development\nThe increase in research and development expense for the three and nine months ended September 30, 2025, as compared to the three and nine months ended September 30, 2024, was due to the following:\n \nChange\n \nThree Months Ended \nNine Months Ended\n \n(In millions)\nSalary, benefits and other employee-related costs\n$\n11.2 \n$\n97.6 \nStock-based compensation\n2.3 \n34.5 \nFacilities and other infrastructure costs\n3.6 \n12.6 \nOther items\n(1.5)\n2.4 \nTotal change in research and development expense\n$\n15.6 \n$\n147.1 \nSalary, benefits and other employee-related costs and stock-based compensation included in research and development expense increased during the three and nine months ended September 30, 2025, as compared to the three and nine months ended September 30, 2024, primarily due to our continued investment in attracting and retaining talent for research and development activities, including additional headcount from acquisitions. Stock-based compensation also increased due to incremental expense from market-based equity awards granted to certain members of senior management.\nFacilities and other infrastructure costs included in research and development expense increased during the three and nine months ended September 30, 2025, as compared to the three and nine months ended September 30, 2024, primarily due to our growing workforce. We expect to continue attracting and retaining talent dedicated to research and development activities through hiring and acquisitions.\n32\nGeneral and Administrative\nThe changes in general and administrative expense for the three and nine months ended September 30, 2025, as compared to the three and nine months ended September 30, 2024, were due to the following:\n \nChange\n \nThree Months Ended \nNine Months Ended\n \n(In millions)\nStock-based compensation\n$\n4.5 \n$\n8.7 \nSalary, benefits and other employee-related costs\n(3.0)\n4.1 \nProfessional services\n10.5 \n1.0 \nGovernment subsidies\n(4.5)\n(4.5)\nOther items\n(1.1)\n(2.8)\nTotal change in general and administrative expense\n$\n6.4 \n$\n6.5 \nStock-based compensation included in general and administrative expense increased during the three and nine months ended September 30, 2025, as compared to the three and nine months ended September 30, 2024, primarily due to incremental expense from market-based equity awards granted to certain members of senior management.\nSalary, benefits and other employee-related costs included in general and administrative expense decreased during the three and nine months ended September 30, 2025, as compared to the three and nine months ended September 30, 2024, primarily due to a decrease in variable compensation.\nProfessional services increased during the three and nine months ended September 30, 2025, as compared to the three and nine months ended September 30, 2024, primarily due to increased legal and consulting services associated with acquisition-related activities, particularly during the third quarter of fiscal 2025. \nLoss Related to Contingent Liability\nDuring the nine months ended September 30, 2025, we recognized a loss related to a contingent liability. For additional information relating to this matter, see Note 16 in the notes to condensed consolidated financial statements.\nRestructuring\nWe have initiated restructuring plans in recent years, most recently in September 2025, to better align our resources with our business strategy. Restructuring charges and related benefits are derived from management's estimates during the formulation of the restructuring plans, based on then-currently available information. As a result, our restructuring plans may not achieve the benefits anticipated on the timetable or at the level contemplated. Additional actions, including further restructuring of our operations, may be required in the future. For additional information relating to our restructuring plans, see Note 10 in the notes to condensed consolidated financial statements.\nOperating Margin\nOperating margin represents income from operations as a percentage of total revenue. Our operating margin for the three and nine months ended September 30, 2025 and the three and nine months ended September 30, 2024 was as follows:\nThree Months Ended \nNine Months Ended\nSeptember 30,\n2025\nSeptember 30,\n2024\nSeptember 30,\n2025\nSeptember 30,\n2024\nOperating margin\n32 \n%\n29 \n%\n27 \n%\n27 \n%\nOur operating margin may vary from period to period depending on the mix of products and services sold during each period. During the three months ended September 30, 2025, our operating margin increased, as compared to the three months ended September 30, 2024, primarily due to revenue growth and a decrease in variable compensation. \n33\nInterest Expense\n \nThree Months Ended \nNine Months Ended\n \nSeptember 30,\n2025\nSeptember 30,\n2024\nSeptember 30,\n2025\nSeptember 30,\n2024\n \n(In millions)\nContractual cash interest expense:\nSenior Notes\n$\n27.8 \n$\n10.0 \n$\n83.3 \n$\n17.6 \nTerm Loans\n— \n12.5 \n— \n25.9 \nRevolving Credit Facility\n0.3 \n0.1 \n0.7 \n0.5 \nAmortization of debt discount and debt issuance costs:\nSenior Notes\n1.2 \n0.5 \n3.6 \n0.9 \nTerm Loans\n— \n1.1 \n— \n1.2 \nRevolving Credit Facility\n0.1 \n0.3 \n0.2 \n0.3 \nOther\n(0.4)\n— \n(0.7)\n(0.3)\nTotal interest expense\n$\n29.0 \n$\n24.5 \n$\n87.1 \n$\n46.1 \nAs of September 30, 2024, our indebtedness was comprised of $350.0 million aggregate principal amount of senior notes that were due October 15, 2024 (the “2024 Notes”).\nIn September 2024, we issued $2.5 billion aggregate principal amount of senior notes, consisting of $500.0 million aggregate principal amount of senior notes due 2027 (the “2027 Notes”), $1.0 billion aggregate principal amount of senior notes due 2029 (the “2029 Notes”) and $1.0 billion aggregate principal amount of senior notes due 2034 (the “2034 Notes” and together with the 2027 Notes and the 2029 Notes, the “New Senior Notes”).\nIn September 2024, we used a portion of the net proceeds from the New Senior Notes to fully prepay the outstanding principal and accrued interest of outstanding term loans. In October 2024, we settled the outstanding principal of $350.0 million and accrued interest on the 2024 Notes.\nInterest expense increased during the three and nine months ended September 30, 2025, as compared to the three and nine months ended September 30, 2024, primarily due to contractual interest from our New Senior Notes, which were issued in September of 2024, limiting the impact of the New Senior Notes on interest expense during the three and nine months ended September 30, 2024. For additional information relating to our debt arrangements, see Note 4 in the notes to condensed consolidated financial statements.\nOther Income (Expense), Net\nOther income (expense), net consists primarily of interest earned on cash, cash equivalents and investments in debt securities, realized and unrealized gains and losses from our investments in equity securities of other companies, gains and losses from investments held in the Nonqualified Deferred Compensation (“NQDC”) trust and foreign exchange gains and losses. \nOther income (expense), net decreased during the three months ended September 30, 2025, as compared to the three months ended September 30, 2024, primarily due to losses recognized from foreign currency forward exchange contracts, partially offset by an increase in interest earned on cash and cash equivalents. \nOther income (expense), net also decreased during the nine months ended September 30, 2025, as compared to the nine months ended September 30, 2024, primarily due to a net decrease of gains from our investments in equity securities of publicly held companies and losses recognized from foreign currency forward exchange contracts. These factors were partially offset by an increase in interest earned on cash and cash equivalents and gains on the sale of IP and other assets. \nFor additional information about other income (expense), net, see Note 11 in the notes to condensed consolidated financial statements.\n34\nIncome Taxes\nThe following table presents the provision for income taxes and the effective tax rate for the three and nine months ended September 30, 2025 and September 30, 2024:\n \nThree Months Ended \nNine Months Ended\n \nSeptember 30,\n2025\nSeptember 30,\n2024\nSeptember 30,\n2025\nSeptember 30,\n2024\n \n(In millions, except percentages)\nProvision for income taxes\n$\n105.7 \n$\n95.3 \n$\n308.3 \n$\n243.9 \nEffective tax rate\n26.9 \n%\n28.6 \n%\n30.0 \n%\n25.4 \n%\nOur provision for income taxes for the three and nine months ended September 30, 2025 was primarily attributable to federal, state and foreign income taxes on our anticipated fiscal 2025 income. We also recognized tax benefits of $15.1 million and $36.6 million related to stock-based compensation that vested or was exercised during the respective periods. The increase in our provision for income taxes during the three and nine months ended September 30, 2025, as compared to the three and nine months ended September 30, 2024, was primarily attributable to an increase in our earnings and nondeductible expenses.\nOn July 4, 2025, the One Big Beautiful Bill Act (“OBBBA”) was enacted in the United States. The OBBBA includes significant provisions, such as the permanent extension of certain expiring provisions of the Tax Cuts and Jobs Act, modifications to the international tax framework and the restoration of favorable tax treatment for certain business provisions including the immediate expensing of United States research and development expenditures. The legislation has multiple effective dates, with certain provisions effective in fiscal 2025 and others effective from fiscal 2026. We recognized the fiscal 2025 tax effects of the OBBBA in our provision for income taxes for the three months ended September 30, 2025, in accordance with ASC 740, Income Taxes. The OBBBA did not materially impact our estimated fiscal 2025 effective tax rate.\nIn 2021, the Organisation for Economic Co-operation and Development (“OECD”) announced Pillar Two Model Rules which call for the taxation of large multinational corporations, such as Cadence, at a global minimum tax rate of 15%. The currently enacted Pillar Two Model Rules did not have a material impact to our provision for income taxes for the three and nine months ended September 30, 2025.\nOur provision for income taxes for the three and nine months ended September 30, 2024 was primarily attributable to federal, state and foreign income taxes on our then anticipated fiscal 2024 income. We also recognized tax benefits of $12.6 million and $40.8 million related to stock-based compensation that vested or was exercised during the respective periods. \nOur future effective tax rates may also be materially impacted by tax amounts associated with our foreign earnings at rates different from the United States federal statutory rate, research credits, the tax impact of stock-based compensation, accounting for uncertain tax positions, business combinations, closure of statutes of limitations or settlement of tax audits and changes in tax law. A significant amount of our foreign earnings is generated by our subsidiaries organized in Ireland and Hungary. Our future effective tax rates may be adversely affected if our earnings were to be lower in countries where we have lower statutory tax rates relative to earnings in countries where we have higher statutory tax rates. We currently expect that our fiscal 2025 effective tax rate will be approximately 29%. We expect that our quarterly effective tax rates will vary from our fiscal 2025 effective tax rate as a result of recognizing the income tax effects of stock-based awards in the quarterly periods that the awards vest or are settled and other items that we cannot anticipate. For additional discussion about how our effective tax rate could be affected by various risks, see Part I, Item 1A, “Risk Factors,” in our Annual Report.\nLiquidity and Capital Resources\n \nAs of\n \n \nSeptember 30,\n2025\nDecember 31,\n2024\nChange\n \n(In millions)\nCash and cash equivalents\n$\n2,753.2 \n$\n2,644.0 \n$\n109.2 \nNet working capital\n2,880.5 \n2,646.0 \n234.5 \nCash and Cash Equivalents\nAs of September 30, 2025, our principal sources of liquidity consisted of $2,753.2 million of cash and cash equivalents as compared to $2,644.0 million as of December 31, 2024.\nOur primary sources of cash and cash equivalents during the nine months ended September 30, 2025 were cash generated from operations and proceeds from the issuance of common stock resulting from stock purchases under our employee stock purchase plan and stock options exercised during the period.\n35\nOur primary uses of cash and cash equivalents during the nine months ended September 30, 2025 were payments related to repurchases of our common stock, business combinations, payment of employee taxes on vesting of restricted stock, purchases of property, plant and equipment and purchases of investments.\nApproximately 39% of our cash and cash equivalents was held by our foreign subsidiaries as of September 30, 2025. Our cash and cash equivalents held by our foreign subsidiaries may vary from period to period due to the timing of collections and repatriation of foreign earnings. We expect that current cash and cash equivalent balances and cash flows that are generated from operations and financing activities will be sufficient to meet the needs of our domestic and international operating activities and other capital and liquidity requirements, including acquisitions, investments and share repurchases, for at least the next 12 months and thereafter for the foreseeable future.\nNet Working Capital\nNet working capital is comprised of current assets less current liabilities, as shown on our condensed consolidated balance sheets. Our net working capital varies from period to period due to changes in operating assets and liabilities and the timing of investing and financing activities.\nCash Flows from Operating Activities\nCash flows provided by operating activities during the nine months ended September 30, 2025 and September 30, 2024 were as follows:\n \nNine Months Ended\n \nSeptember 30,\n2025\nSeptember 30,\n2024\nChange\n(In millions)\nCash provided by operating activities\n$\n1,175.3 \n$\n819.2 \n$\n356.1 \nCash flows provided by operating activities include net income, adjusted for certain non-cash items, as well as changes in the balances of certain assets and liabilities. Our cash flows from operating activities are significantly influenced by business levels and the payment terms set forth in our customer agreements. The increase in cash flows from operating activities for the nine months ended September 30, 2025, as compared to the nine months ended September 30, 2024, was primarily due to increased business levels, the timing of cash receipts from customers, the timing of cash disbursements for operating assets and liabilities and cash paid for income taxes. \nThe increase in cash provided by operating activities was partially offset by settlement payments to BIS and the DOJ during the nine months ended September 30, 2025. For information relating to our settlement with BIS and the DOJ, see Note 16 in the notes to condensed consolidated financial statements.\nCash Flows Used for Investing Activities\nCash flows used for investing activities during the nine months ended September 30, 2025 and September 30, 2024 were as follows:\n \nNine Months Ended\n \nSeptember 30,\n2025\nSeptember 30,\n2024\nChange\n(In millions)\nCash used for investing activities\n$\n(371.7)\n$\n(797.1)\n$\n425.4 \nCash used for investing activities decreased during the nine months ended September 30, 2025, as compared to the nine months ended September 30, 2024, primarily due to a decrease in payments for business combinations, partially offset by an increase in purchases of investments. We expect to continue our investing activities, including purchasing property, plant and equipment, purchasing intangible assets, acquiring other companies and businesses, and making investments.\n36\nCash Flows From (Used for) Financing Activities\nCash flows from (used for) financing activities during the nine months ended September 30, 2025 and September 30, 2024 were as follows:\n \nNine Months Ended\n \nSeptember 30,\n2025\nSeptember 30,\n2024\nChange\n(In millions)\nCash provided by (used for) financing activities\n$\n(735.1)\n$\n1,750.4 \n$\n(2,485.5)\nCash flows from financing activities decreased during the nine months ended September 30, 2025, as compared to the nine months ended September 30, 2024, primarily due to a decrease in proceeds from the issuance of debt, an increase in repurchases of common stock and decreased proceeds from the issuance of common stock resulting from stock purchases under our employee stock purchase plan and stock options exercised during the period. These factors were partially offset by a decrease in payments of employee taxes on vesting of restricted stock.\nOther Factors Affecting Liquidity and Capital Resources\nSenior Notes\nIn September 2024, we issued $2.5 billion aggregate principal amount of senior notes, consisting of $500.0 million aggregate principal amount of 4.200% Senior Notes due 2027 (the “2027 Notes”), $1.0 billion aggregate principal amount of 4.300% Senior Notes due 2029 (the “2029 Notes”) and $1.0 billion aggregate principal amount of 4.700% Senior Notes due 2034 (the “2034 Notes” and together with the 2027 Notes and the 2029 Notes, the “New Senior Notes”). Interest on the New Senior Notes is payable semi-annually in arrears in March and September of each year. As of September 30, 2025, we were in compliance with all covenants associated with the New Senior Notes.\nRevolving Credit Facility\nIn August 2024, we terminated our existing revolving credit facility, dated June 30, 2021, and amended in September 2022, and entered into a five-year senior unsecured revolving credit facility with a group of lenders led by Bank of America, N.A., as administrative agent (the “2024 Credit Facility”). The 2024 Credit Facility provides for borrowings up to $1.25 billion, with the right to request increased capacity up to an additional $500.0 million upon receipt of lender commitments, for total maximum borrowings of $1.75 billion. The 2024 Credit Facility expires on August 14, 2029. Any outstanding loans drawn under the 2024 Credit Facility are due at maturity on August 14, 2029, subject to an option to extend the maturity date. Outstanding borrowings may be repaid at any time prior to maturity. Interest rates associated with the 2024 Credit Facility are variable, so interest expense is impacted by changes in the interest rates, particularly for periods when there are outstanding borrowings under the revolving credit facility. Interest is payable quarterly. As of September 30, 2025, there were no borrowings outstanding under the 2024 Credit Facility, and we were in compliance with all covenants associated with such credit facility.\nFor additional information relating to our debt arrangements, see Note 4 in the notes to condensed consolidated financial statements.\nStock Repurchase Program\nWe are authorized to repurchase shares of our common stock under a publicly announced program. In May 2025, our Board of Directors increased the prior authorization to repurchase shares of our common stock by authorizing an additional $1.5 billion. The actual timing and amount of repurchases are subject to business and market conditions, corporate and regulatory requirements, stock price, acquisition opportunities and other factors. Our repurchase authorization does not obligate us to acquire a minimum number of shares, does not have an expiration date and may be modified, suspended or terminated without prior notice. As of September 30, 2025, $1.6 billion of the share repurchase authorization remained available to repurchase shares of our common stock. See Part II, Item 2, “Unregistered Sales of Equity Securities and Use of Proceeds” for additional information on share repurchases.\nCash Payments for Income Taxes\nOn July 4, 2025, the OBBBA was enacted in the United States. The OBBBA included the restoration of the immediate expensing of United States research and development costs starting in fiscal 2025. We currently estimate that the legislation will decrease our remaining fiscal 2025 cash tax payments by approximately $134 million.\nPending Acquisition of Hexagon Design and Engineering Business\nOn September 4, 2025, we entered into a definitive agreement (the “purchase agreement”) with Hexagon Smart Solutions AB (“Hexagon”) to acquire Hexagon’s design and engineering business. Under the terms of the purchase agreement, we will pay Hexagon aggregate consideration of approximately €2.70 billion. Approximately €1.89 billion of the aggregate consideration will be paid in the form of cash, subject to customary purchase price adjustments in accordance with the purchase agreement, with the remaining consideration payable in the form of newly issued shares of Cadence’s common stock. We intend to fund the cash consideration through a combination of cash on hand and borrowings under existing debt facilities. Closing is expected to occur in the first quarter of 2026.\n37\nThe purchase agreement also provides for customary termination rights for the parties, including the right to terminate the purchase agreement due to the failure to obtain required regulatory approvals on or prior to September 4, 2026 (subject to two three-month extensions, at our election, until March 4, 2027) or if a governmental authority has issued a final and non-appealable order or injunction prohibiting closing. Under the purchase agreement, we will be required to pay a reverse termination fee of up to €175 million if the purchase agreement is terminated due to the failure to obtain required regulatory approvals on or prior to March 4, 2027, or following an injunction arising from certain antitrust or foreign investment laws. For information relating to our acquisitions, see Note 5 in the notes to condensed consolidated financial statements.\nOther Liquidity Requirements\nDuring the nine months ended September 30, 2025, there were no material changes to our other liquidity requirements as reported in Item 7, “Management’s Discussion and Analysis of Financial Condition and Results of Operations,” in our Annual Report."
}