{
  "source_file": "cdw-20241231.htm",
  "form_type": "10-K",
  "item1": "Item 1. Business\nOur Company\nCDW Corporation (together with its subsidiaries, the “Company,” “CDW” or “we”), a Fortune 500 company and member of the S&P 500 Index, is a leading multi-brand provider of information technology (“IT”) solutions to business, government, education and healthcare customers in the United States (“US”), the United Kingdom (“UK”) and Canada. Our broad array of offerings ranges from discrete hardware and software products to integrated IT solutions and services that include on-premise and cloud capabilities across hybrid infrastructure, digital experience and security.\nWe are vendor, technology and consumption model unbiased, offering a broad selection of products and multi-branded IT solutions. Our solutions are delivered in physical, virtual and cloud-based environments through approximately 10,900 customer-facing coworkers, including sellers, highly-skilled specialists and engineers. We are a leading sales channel partner for many original equipment manufacturers (“OEMs”), software publishers, cloud providers (collectively, our “vendor partners”) and wholesale distributors, whose products we sell or include in the solutions we offer. We provide our vendor partners with a cost-effective way to reach customers and deliver a consistent brand experience through our established end-market coverage, technical expertise and extensive customer access.\nWe simplify the complexities of technology solutions across design, selection, procurement, integration and management for our customers. Our goal is to have our customers, regardless of their size, view us as a trusted adviser and extension of their IT workforce. Our multi-brand offering approach across our vendor partners enables us to provide the solutions and services that best address each customer’s specific requirements to enable their desired business outcomes.\nWe have capabilities to provide integrated IT solutions in approximately 150 countries for customers with primary locations in the US, UK and Canada, which are large and growing markets. These are highly fragmented markets served by thousands of IT resellers and solutions providers. We believe that demand for IT will outpace general economic growth in the markets we serve, fueled by new technologies, including hybrid and cloud computing and artificial intelligence, as well as growing end-user demand for security, efficiency and productivity.\nValue Proposition \nWe are positioned in the middle of the IT ecosystem where we procure products from OEMs, software publishers, cloud providers and wholesale distributors and provide added value to our customers by helping them navigate through complex options and implement the best solution for their business. In this role, we believe we provide unique value to both our vendor partners and our customers.\nOur value proposition to our customers\nOur value proposition to our vendor partners\n●\nBroad selection of products and multi-branded IT solutions\n●\nAccess to over 250,000 customers \n●\nValue-added services with integration capabilities\n●\nLarge and established customer channels\n●\nHighly-skilled specialists and engineers\n●\nStrong distribution and implementation capabilities\n●\nSolutions across IT lifecycle\n●\nCustomer relationships driving insight into technology roadmaps\nCustomers\nWe provide integrated IT solutions to over 250,000 business, government, education and healthcare customers throughout the US, UK and Canada.\nWe serve our customers through sales teams focused on customer end-markets that are supported by highly-skilled specialists and engineers. Our market segmentation allows us to customize our offerings and to provide enhanced expertise in designing and implementing IT solutions that meet our customer’s specific needs.\nWe have three reportable segments: Corporate, Small Business and Public. Our Corporate segment primarily serves US private sector business customers with more than 250 employees. Our Small Business segment primarily serves US private sector business customers with up to 250 employees. Our Public segment is comprised of government agencies and education and healthcare institutions in the US. We also have two other operating segments: CDW UK and CDW Canada, each of which do not meet the reportable segment quantitative thresholds and, accordingly, are included in an all other category (“Other”).\n4\nTable of Contents\nIn our US business, which represents approximately 90% of our Net sales, we currently have five dedicated customer channels: corporate, small business, government, education and healthcare, each of which generated $1.5 billion or greater in Net sales in 2024. Net sales to customers in the UK and Canada combined generated $2.5 billion in 2024. We believe this diversity of customer end-markets provides us with multiple avenues for growth and has been a key factor in our ability to weather economic and technology cycles and gain market share.\nPartners\nWe offer more than 100,000 products and services from more than 1,000 vendor partners, including well-established companies such as Adobe, APC, Apple, Amazon Web Services, Broadcom Inc., Cisco, Dell Technologies, Google, Hewlett Packard Enterprise, HP Inc., IBM, Intel, Lenovo, Microsoft, NetApp, Nutanix, Palo Alto Networks, Pure Storage and Samsung, as well as from emerging technology companies. This broad portfolio of vendor partners and technologies enables us to offer customers significant options and meet customer demand for the products and solutions that best meet their needs. We believe our value proposition to vendor partners enables us to evolve our offering as new technologies emerge and new companies seek us as a channel partner.\nIn 2024, we generated $2.0 billion of Net sales from each of our three largest vendor partners. We have received the highest level of certification from major vendor partners such as Broadcom Inc., Cisco, Dell Technologies, Hewlett Packard Enterprise, IBM, Lenovo, Microsoft, NetApp, Nutanix, Palo Alto Networks and Samsung which reflects the extensive product and solution knowledge and capabilities that we bring to our customers. These certifications also provide us with access to favorable pricing, tools and resources, including vendor incentive programs, which we use to provide additional value to our customers. Our vendor partners also regularly recognize us with top awards and select us to develop and grow new customer solutions.\nProduct Procurement\nWe may purchase all or only some of the products our vendor partners offer for resale to our customers or for inclusion in the solutions we offer. Each vendor partner agreement provides for specific terms and conditions, which may include one or more of the following: product return privileges, price protection policies, purchase discounts and vendor incentive programs, such as purchase or sales rebates and cooperative advertising reimbursements. We also purchase software from major software publishers and cloud providers for resale to our customers or for inclusion in the solutions we offer. Our agreements allow us to resell cloud based solutions, software or other licensed products to the end-user customer.\nIn addition to purchasing products directly from our vendor partners, we purchase products from wholesale distributors for resale to our customers or for inclusion in the solutions we offer. These wholesale distributors provide logistics management and supply-chain services for us, as well as for our vendor partners.\nInventory Management\nWe operate two distribution centers in North America and one distribution center in the UK, which combined provide more than 1 million square feet in size. Leveraging our distribution and logistics capabilities, we handle and ship approximately 26 million units annually on an aggregate basis from our distribution centers.\nWe also have drop-shipment arrangements with many of our OEMs and wholesale distributors, which permit us to offer products to our customers without having to take physical delivery at our distribution centers. These arrangements represented approximately 54% of total North America Net sales in 2024.\nWe believe that the location of our distribution centers allows us to efficiently ship products to our customers and provide timely access to our principal distributors. We believe that our logistics and configuration capabilities delivered by our highly-skilled and certified team enable us to customize technology for our customers to meet their unique needs.\nWe believe competitive sources of supply are available in substantially all of the product categories that we offer.\nCompetition\nThe market for technology products, solutions and services is highly competitive and subject to economic conditions and rapid technological changes. This competitive environment includes the ability to tailor solutions to customer needs, the quality and breadth of product and service offerings, knowledge and expertise of sales force, customer service, price, product availability, speed of delivery and credit availability. We face competition from resellers, manufacturers who sell directly to customers, large service providers and system integrators, cloud providers, e-commerce companies, and office supply retailers, among others. Smaller, local or regional value-added resellers typically focus on a single solution suite or portfolio of solutions from one or two vendor partners.\n5\nTable of Contents\nWe believe we are well positioned to compete within this marketplace due to our competitive advantages. We expect the competitive landscape to continue to evolve as new technologies and consumption models emerge, such as cloud-based and other “as a service” solutions, hyper-converged infrastructure, embedded software solutions and solutions that incorporate artificial intelligence. While innovation can help our business as it creates new offerings for us to sell, it can also disrupt our business model and create new and stronger competitors. For additional information on the risks associated with competition, see “Item 1A. Risk Factors.”\nWe believe we have sustainable competitive advantages that differentiate us in the marketplace. We focus on providing high quality service to gain new customers and retain existing customers. We have built a strong sales organization and deep services and solutions capabilities over time and expect to continue to invest to enhance these capabilities. We believe the combination of our competitive advantages of scale, performance-driven culture and enhanced capabilities will help drive sustainable, profitable growth for us today and in the future. Our scale enables us to have a national and international footprint, as well as invest in resources to meet specific customer end-market needs. Our sellers are organized around unique customer end-markets that are both vertically and geographically focused. Our scale enables our ability to invest in specialists and engineers who work directly with our sellers to help customers implement complex IT solutions. We have cross-border relationships that enable us to serve the needs of our US, UK and Canadian-based customers in approximately 150 countries. Our strong, execution-oriented culture is underpinned by our compensation system.\nOur Offerings\nOur offerings range from discrete hardware and software products and services to complex integrated solutions including one or more of these elements. We believe our customers increasingly view technology purchases as integrated solutions vital to their strategies, business outcomes and missions rather than discrete product and services categories. Our hardware category includes notebooks/mobile devices (including tablets), network communications (“netcomm products”), collaboration hardware, data storage and servers, desktop computers and other hardware. Our software category includes cloud solutions, software assurance, application suites, security, virtualization, collaboration and productivity applications, operating systems and network management. Our services include advisory and design, software development, implementation, managed services and warranties.\nIT is important to both critical business operations and to drive greater growth and productivity. To help our customers accomplish this, we have built a robust portfolio of solutions across hybrid infrastructure, digital experience, security, digital velocity and services that we provide in on-premise, hybrid or cloud-based environments.\nWe provide customers with technology solutions and services on the public cloud, which reside off-premise on a public (shared) infrastructure, private cloud solutions, which reside on customer premises and hybrid cloud solutions that deliver the benefits of both public and private options. Our migration, integration and managed services help our customers simplify cloud adoption and management, across the entire IT lifecycle. Engineers work with our customers to design cloud solutions meeting their organizational, technology and financial objectives.\nWe offer a broad portfolio of integrated solutions that include the following on-premise, hybrid and cloud capabilities:\n•\nHybrid Infrastructure\n: We assess our customers application infrastructure need, design flexible, resilient and efficient solutions and manage the solution throughout its lifecycle. Our broad portfolio of hardware and software products, encompassing both on and off-premise solutions, enables us to provide well-integrated solutions, including converged and hyper-converged infrastructure, physical and virtualized servers, software defined automation and orchestration solutions, hybrid storage, energy-efficient power and cooling, and data center networking.\n•\nDigital Experience\n: We build end-to-end solutions that deliver access to applications that improve our customers’ productivity regardless of device or location. We connect our customers’ physical devices, including laptops, desktops, IP Phones, mobile devices and print systems. We utilize collaboration solutions to unite applications via the integration of products that facilitate the use of multiple enterprise communication methods including email, persistent chat, social media, voice and video. We also host cloud-based collaboration solutions. We enable our customers with artificial intelligence (“AI”) solutions that empower their end users and drive efficiency in business-critical functions. Our solutions provide the tools that allow our customers’ employees to share knowledge, ideas and information among each other and with clients and partners effectively, securely and quickly.\n•\nSecurity\n: We assess our customers’ security needs and provide them with tools and services to help effectively manage risk, increase business continuity and operational efficiency, and improve their end user experience. We are a security solutions integrator that combines our expertise in advisory, design, solution architecture and implementation services. Our customer solutions can take the form of hardware, software or Software as a Service across a multitude of categories such as: endpoint security, email security, web security, intrusion prevention, identity and access \n6\nTable of Contents\nmanagement, next-generation firewall, security service edge, security information and event management, exposure and threat management, governance, risk and compliance, data security and governance, cloud infrastructure entitlement management, virtual private network services, network access control and physical security. Security consulting engagements include security maturity assessments, policy and procedure gap analysis, security roadmaps and health checks.\n•\nDigital Velocity:\n We deliver advanced digital transformation solutions that enable organizations to modernize their IT infrastructure, applications and operations. Leveraging expertise in cloud-native deployment, DevOps, artificial intelligence and automation, we help customers improve business outcomes through scalable and secure technology implementations. We enable specific customer business needs through customer software engineering engagements, providing custom application development, modernization and integration services, as well as talent orchestration solutions that give our customers access to technical resources that supplement their workforce for project-based engagements and periods of peak demand. \nFor each of the solutions areas above, we provide services that help organizations plan, design, configure, orchestrate and manage technology for their unique needs. Our offerings demonstrate our expertise in the most critical technology areas for our customers. Our highly-skilled specialists and engineers have expertise in integrated cloud, collaboration, data center, mobility and security business technology, from the physical to the application layer. We leverage best-in-class partner technology platforms to seamlessly architect and manage disparate IT platforms into integrated business technology solutions.\nAlthough we believe customers increasingly view technology purchases as solutions rather than discrete product and service categories, our Net sales by major category, based upon our internal category classifications, was as follows:\nYear Ended December 31, \n2024\n2023\n2022\n(dollars in millions)\nNet Sales\nPercentage\nof Total Net Sales\nNet Sales\nPercentage\nof Total Net Sales\nNet Sales\nPercentage\nof Total Net Sales\nHardware:\nNotebooks/Mobile Devices\n$\n5,089.9 \n24.2 \n%\n$\n4,690.5 \n21.9 \n%\n$\n6,179.7 \n26.0 \n%\nNetcomm Products\n2,538.2 \n12.1 \n3,185.4 \n14.9 \n2,729.7 \n11.5 \nCollaboration\n1,770.6 \n8.4 \n1,909.7 \n8.9 \n2,394.8 \n10.1 \nData Storage and Servers\n2,133.8 \n10.2 \n2,240.7 \n10.5 \n2,479.0 \n10.4 \nDesktops\n1,111.2 \n5.3 \n1,069.1 \n5.0 \n1,284.9 \n5.4 \nOther Hardware\n2,575.4 \n12.3 \n2,607.2 \n12.3 \n3,022.9 \n12.7 \nTotal Hardware\n15,219.1 \n72.5 \n15,702.6 \n73.5 \n18,091.0 \n76.1 \nSoftware\n(1)\n3,804.4 \n18.1 \n3,799.3 \n17.8 \n3,684.9 \n15.5 \nServices\n(1)\n1,867.3 \n8.9 \n1,761.3 \n8.2 \n1,842.0 \n7.8 \nOther\n(2)\n107.9 \n0.5 \n112.8 \n0.5 \n130.8 \n0.6 \nTotal Net sales\n$\n20,998.7 \n100.0 \n%\n$\n21,376.0 \n100.0 \n%\n$\n23,748.7 \n100.0 \n%\n(1)\nCertain software and services revenue is recorded on a net basis for accounting purposes. As a result, the category percentage of Net sales is not representative of the category percentage of gross profits.\n(2)\nIncludes items such as delivery charges to customers.\n7\nTable of Contents\nOur Internal Capabilities\nHuman Capital Management\nOur long-standing values and philosophies of success are based on fostering a welcoming, respectful, accountable and fair culture where coworkers have the opportunity to thrive. This culture, along with strong training and development, competitive compensation and opportunities for meaningful careers, drives business results and competitive advantage.\nWe have approximately 15,100 coworkers across the globe, with 11,500 coworkers in the US and 3,600 coworkers in international locations. More than 50% of our US Net sales are generated by account managers who have more than seven years of tenure with CDW. Our coworker relations are strong, and none of our coworkers are represented by a labor union or covered by a collective bargaining agreement.\nOne CDW\nOne CDW reflects the work we do to find, attract and retain top talent, encourage a welcoming and respectful culture, create meaningful partnerships across teams, and ensure coworkers have the tools and opportunities to grow and help the business succeed. \nCoworker Engagement\nWe strive to create a culture of collaboration, respect and individual growth and reward. Our coworker engagement strategy utilizes periodic surveys as well as virtual listening groups to gain a real-time understanding of the coworker experience at CDW. As a result of our coworkers’ consistent engagement, we have garnered meaningful feedback and recommendations, which have led to measurable and impactful results.\nTraining & Development\nWe focus on skills enhancement, leadership development, innovation excellence and professional growth throughout our coworkers’ careers. Our programs include, but are not limited to leadership development trainings, unique developmental opportunities for our high-potential emerging leaders, a robust training program for new sales coworkers, technical skill development training, a 12-month apprentice-style program for aspiring engineers and coworker access to over 20,000 on-demand educational modules with new content updated frequently. \nTotal Rewards\n \nOur total rewards philosophy provides market competitive compensation and benefits designed to attract, retain and motivate our coworkers. We pay for performance through our compensation programs which are aligned to both individual and company performance. Our sellers’ compensation is aligned to their individual performance and provides substantially uncapped commission opportunity. We provide a comprehensive benefits package to our coworkers, including healthcare, retirement plans with profit sharing and match, tuition assistance, parental leave policies, adoption assistance, paid time off, paid volunteer hours and philanthropic match programs based upon eligibility and location.\nHealth and Safety\nWe are committed to prioritizing the health and well-being of our coworkers. We dedicate time and resources to identify safety hazards of all types, mitigate safety risk and routinely train our coworkers using industry best-practices as our standard, as well as provide increased access to mental health resources.\nOversight and Management\nOur Coworker Success organization is responsible for the strategy and management of coworker-related matters, working in concert with all our leaders. Our Board understands the importance of our respectful, performance-driven culture to our ongoing success and is actively engaged with our Chair and Chief Executive Officer and our Chief Human Resources Officer across a broad range of human capital management topics.\nMarketing\nWe market the CDW brand to US, UK and Canadian audiences through various channels, including mass media, digital, print, social media and other emerging channels. We target current and prospective customers through integrated marketing programs including email, display ads, paid search, social media, events and sponsorships. These programs are supported by integrated communication efforts targeting technology decision-makers, influencers and the general public using a combination of expert technology articles, videos, case studies, media interviews and speaking events.\n8\nTable of Contents\nAs a result of our relationships with vendor partners, a significant portion of our advertising and marketing expenses is reimbursed through cooperative advertising programs. These programs are at the discretion of our vendor partners and are typically tied to sales or other commitments to be met by us within a specified period. We believe that our results and analytical techniques for measuring marketing efficacy differentiates us from our competitors.\nInformation Technology Systems\nWe maintain customized IT and unified communication systems that enhance our ability to provide prompt, efficient and expert service to our customers. In addition, these systems enable centralized management of key functions, including purchasing, inventory management, billing and collection of accounts receivable, sales, distribution and financial accounting and reporting. Our systems provide us with thorough and detailed information regarding key aspects of our business. These capabilities help us to continuously enhance productivity, ship customer orders quickly and efficiently, respond appropriately to industry changes and provide high quality customer service. We believe our websites and software tools, which provide electronic order processing and advanced features, such as order tracking, reporting and asset management, make it easy for customers to transact business with us and ultimately strengthen our customer relationships. We are in the process of implementing a new enterprise resource planning (“ERP”) system, along with other system transformation initiatives, that will enable us to streamline processes and enhance visibility in our key business processes. The significant system transformation initiatives, including ERP, are anticipated to be released in 2025 with incremental system transformation releases continuing in 2026.\nAvailable Information\nWe maintain a website at www.cdw.com. You may access our Annual Reports on Form 10-K, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K and amendments to those reports filed or furnished pursuant to Section 13(a) or 15(d) of the Securities Exchange Act of 1934 with the SEC free of charge at our website as soon as reasonably practicable after such material is electronically filed with, or furnished to, the SEC. Our website and the information contained on that site, or connected to that site, are not incorporated into and are not a part of this report.\nInformation about our Executive Officers\nThe following table lists the name, age as of February 21, 2025 and positions of each executive officer of the Company.\nName\nAge\nPosition\nChristine A. Leahy\n60\nChair of our Board of Directors since January 2023; President and Chief Executive Officer and member of our Board of Directors since January 2019; Chief Revenue Officer from July 2017 to December 2018.\nSona Chawla\n57\nChief Growth and Innovation Officer since January 2020; President, Kohl’s Corporation (an omnichannel retailer) from May 2018 to October 2019 and Chief Operating Officer, Kohl’s Corporation from November 2015 to May 2018.\nElizabeth H. Connelly\n59\nChief Commercial Officer since October 2024; Senior Vice President, Vertical Markets, from January 2024 to October 2024; Senior Vice President, Healthcare from September 2022 to December 2023; Chief Human Resources Officer and Senior Vice President, Coworker Services from December 2018 to September 2022.\nFrederick J. Kulevich\n59\nSenior Vice President, General Counsel and Corporate Secretary since October 2017 and Interim Chief People Officer from November 2023 to September 2024.\nAlbert J. Miralles\n55\nChief Financial Officer and Senior Vice President, Enterprise Business Operations since January 2025; Senior Vice President and Chief Financial Officer from September 2021 to January 2025; Executive Vice President and Chief Financial Officer, CNA Financial Corporation (a commercial property and casualty insurance company) from February 2020 to September 2021; President, CNA Warranty from October 2019 to September 2021; Executive Vice President and Chief Risk Officer of the CNA Insurance Companies from January 2018 to October 2019.\nKatherine E. Sanderson\n49\nSenior Vice President, Coworker Success and Chief Human Resources Officer since September 2024; Executive Vice President and Chief Human Resources Officer, R1 RCM (a healthcare technology and services company) from November 2018 to September 2024.\n9\nTable of Contents",
  "item7": "Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nUnless otherwise indicated or the context otherwise requires, as used in this “Management’s Discussion and Analysis of Financial Condition and Results of Operations,” the terms “we,” “us,” “the Company,” “our,” “CDW” and similar terms refer to CDW Corporation and its subsidiaries. “Management’s Discussion and Analysis of Financial Condition and Results of Operations” should be read in conjunction with the Consolidated Financial Statements and the related notes included elsewhere in this report. This discussion contains forward-looking statements that are subject to numerous risks and uncertainties. Actual results may differ materially from those contained in any forward-looking statements. See “Forward-Looking Statements” above.\nOverview\nCDW Corporation (“Parent”), a Fortune 500 company and member of the S&P 500 Index, is a leading multi-brand provider of information technology (“IT”) solutions to business, government, education and healthcare customers in the United States (“US”), the United Kingdom (“UK”) and Canada. Our broad array of offerings ranges from discrete hardware and software products to integrated IT solutions and services that include on-premise and cloud capabilities across hybrid infrastructure, digital experience and security.\nWe have three reportable segments: Corporate, Small Business and Public. Our Corporate segment primarily serves US private sector business customers with more than 250 employees. Our Small Business segment primarily serves US private sector business customers with up to 250 employees. Our Public segment is comprised of government agencies and education and healthcare institutions in the US. We also have two other operating segments: CDW UK and CDW Canada, each of which do not meet the reportable segment quantitative thresholds and, accordingly, are included in an all other category (“Other”). \nWe are vendor, technology and consumption model unbiased, with a solutions portfolio including more than 100,000 products and services from more than 1,000 leading and emerging brands. Our solutions are delivered in physical, virtual and cloud-based environments through approximately 10,900 customer-facing coworkers, including sellers, highly-skilled specialists and engineers. We are a leading sales channel partner for many original equipment manufacturers, software publishers, cloud providers (collectively, our “vendor partners”) and wholesale distributors, whose products we sell or include in the solutions we offer. We provide our vendor partners with a cost-effective way to reach customers and deliver a consistent brand experience through our established end-market coverage, technical expertise and extensive customer access.\nWe may sell all or only select products that our vendor partners offer. Each vendor partner agreement provides for specific terms and conditions, which may include one or more of the following: product return privileges, price protection policies, purchase discounts and vendor incentive programs, such as purchase or sales rebates and cooperative advertising reimbursements. We also resell software for major software publishers. Our agreements with software publishers allow the end-user customer to acquire software or licensed products and services. In addition to helping our customers determine the best software solutions for their needs, we help them manage their software agreements, including warranties and renewals. A significant portion of our advertising and marketing expenses are reimbursed through cooperative advertising programs with our vendor partners. These programs are at the discretion of our vendor partners and are typically tied to sales or other commitments to be met by us within a specified period of time.\nFor a discussion of results for the year ended December 31, 2023, see “Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations” of our Annual Report on Form 10-K for the year ended December 31, 2023, filed with the Securities and Exchange Commission on February 26, 2024.\nTrends and Key Factors Affecting our Financial Performance\nWe believe the following key factors may have a meaningful impact on our business performance, influencing our ability to generate sales and achieve our targeted financial and operating results:\n•\nGeneral economic conditions are a key factor affecting our results as they can impact our customers’ willingness and ability to spend on information technology. Macroeconomic uncertainty persists as a result of the inflationary environment and the corresponding level of interest rates driven by monetary policy. The uncertainty in the current economic environment resulted in, and may continue to result in, a delay, pause or reduction of investments in technology by our customers. \n•\nCustomers are evaluating the complex technology landscape in order to balance priorities and focus on solutions that lead to business optimization, cost management and security risk management, resulting in a more measured approach to their IT spending. We have orchestrated solutions by leveraging security, software and hybrid and cloud offerings to help customers achieve their objectives.\n25\nTable of Contents\n•\nChanges and uncertainty related to spending policies, budget priorities, timing and funding levels, including stimulus packages, are key factors influencing the purchasing levels of government, healthcare and education customers. As the duration and ongoing impact of current economic conditions remain uncertain, current and future budget priorities and funding levels for government, healthcare and education customers may be adversely affected, leading to lower IT spend.\n•\nTechnology trends drive customer purchasing behaviors in the market. Current technology trends are focused on delivering greater flexibility and efficiency, as well as designing and managing IT securely. These trends are driving customer adoption of cloud, artificial intelligence, software defined architectures and hybrid on-premise and off-premise combinations. The trends are further driven by the evolution of the IT consumption model to more “as a service” offerings, including software as a service and infrastructure as a service, in addition to ongoing managed and professional service arrangements. Technology trends are likely to evolve as customers prioritize spend that will produce the most important outcomes for their business.\nKey Business Metrics\nWe monitor a number of financial and non-financial measures and ratios on a regular basis in order to track the progress of our business and make adjustments as necessary. Financial measures include both US GAAP, the accounting principles generally accepted in the United States of America, and Non-GAAP, which excludes or includes amounts that are not normally included or excluded in the most directly comparable measure calculated and presented in accordance with US GAAP. We believe that the most important of these measures and ratios include Gross profit, Gross profit margin, Operating income, Operating income margin, Non-GAAP operating income, Non-GAAP operating income margin, Net income, Non-GAAP net income, Net income per diluted share, Non-GAAP net income per diluted share, Average daily sales, Net cash provided by operating activities, Adjusted free cash flow, Cash conversion cycle and Net debt. These measures and ratios are closely monitored by management, so that actions can be taken, as necessary, in order to achieve financial objectives.\nFor the definitions, discussion of management’s use of Non-GAAP measures and reconciliations to the most directly comparable US GAAP measure, see “Results of Operations - Non-GAAP Financial Measure Reconciliations.”\nThe results of certain key business metrics for the comparative periods are as follows:\nYear Ended December 31,\n(dollars in millions, except per share amounts)\n2024\n2023\nNet sales\n$\n20,998.7 \n$\n21,376.0 \nGross profit\n$\n4,602.4 \n$\n4,652.4 \nGross profit margin\n21.9 \n%\n21.8 \n%\nOperating income\n$\n1,651.3 \n$\n1,680.9 \nOperating income margin\n7.9 \n%\n7.9 \n%\nNon-GAAP operating income\n$\n1,947.0 \n$\n2,039.1 \nNon-GAAP operating income margin\n9.3 \n%\n9.5 \n%\nNet income\n$\n1,077.8 \n$\n1,104.3 \nNon-GAAP net income\n$\n1,287.2 \n$\n1,346.2 \nNet income per diluted share\n$\n7.97 \n$\n8.10 \nNon-GAAP net income per diluted share\n$\n9.52 \n$\n9.88 \nAverage daily sales\n(1)\n$\n82.7 \n$\n84.2 \nNet debt\n(2)\n$\n5,125.1 \n$\n5,056.2 \nCash conversion cycle (in days)\n(3)\n18 \n17 \nNet cash provided by operating activities\n$\n1,277.3 \n$\n1,598.7 \nAdjusted free cash flow\n(4)\n$\n1,079.0 \n$\n1,426.8 \n(1)\nDefined as Net sales divided by the number of selling days. There were 254 selling days for both the years ended December 31, 2024 and 2023.\n(2)\nDefined as Total debt minus Cash and cash equivalents and Short-term investments.\n(3)\nDefined as days of sales outstanding related to the current portion of Accounts receivable and certain receivables due from vendors, plus days of supply in Merchandise inventory, minus days of purchases outstanding related to the current portion of Accounts payable and Accounts payable-\n26\nTable of Contents\ninventory financing, based on a rolling three-month average.\n(4)\nDefined as Net cash provided by operating activities less capital expenditures, adjusted to include cash flows from financing activities that relate to the purchase of inventory. \nResults of Operations\nResults of operations, including Gross profit margin and Operating income margin, expressed as Gross profit and Operating income as a percentage of Net sales, respectively, for the years ended December 31, 2024 and 2023 are below. For additional information on Net sales, Gross profit and Operating income by segment, see the “Segment Results of Operations.”\nYear Ended December 31,\n(dollars in millions)\n2024\n2023\nPercent Change\nNet sales\n$\n20,998.7 \n$\n21,376.0 \n(1.8)\n%\nCost of sales\n16,396.3 \n16,723.6 \n(2.0)\nGross profit\n4,602.4 \n4,652.4 \n(1.1)\nGross profit margin\n21.9%\n21.8%\nSelling and administrative expenses\n2,951.1 \n2,971.5 \n(0.7)\nOperating income\n1,651.3 \n1,680.9 \n(1.8)\nOperating income margin\n7.9%\n7.9%\nInterest expense, net\n(214.5)\n(226.6)\n(5.3)\nOther expense, net\n(1.4)\n(4.1)\n*nm\nIncome before income taxes\n1,435.4 \n1,450.2 \n(1.0)\nIncome tax expense\n(357.6)\n(345.9)\n3.4 \nNet income\n$\n1,077.8 \n$\n1,104.3 \n(2.4)\n%\n*nm - Not meaningful\nThe year ended December 31, 2024 compared with the year ended December 31, 2023\nNet sales decreased $377 million, or 1.8%, with lower Net sales across all operating segments. The decrease was primarily due to a decrease in netcomm, partially offset by an increase in notebooks/mobile devices. Continued economic uncertainty and the complex technology landscape has led customers to be cautious and measured in their approach to technology spending, leading to a decline in Net sales.\nGross profit decreased $50 million, or 1.1%, primarily due to lower Net sales across all operating segments. Gross profit margin, expressed as a percentage of Net sales, increased 10 basis points to 21.9% primarily driven by a higher contribution of netted down revenue, primarily software as a service, partially offset by lower product margin due to mix and rate in notebooks/mobile devices.\nSelling and administrative expenses decreased $20 million, or 0.7%, primarily due to lower performance-based compensation, including equity-based compensation, consistent with lower attainment against certain financial measures, and lower workforce optimization costs, partially offset by a higher provision for expected credit losses and transformation and other related costs in the current year.\nOperating income decreased $30 million, or 1.8%, to $1,651 million for the year ended December 31, 2024, compared to $1,681 million for the year ended December 31, 2023. \nInterest expense, net decreased $12 million, or 5.3%, primarily due to increased interest income earned on higher average cash balances.\nIncome tax expense was $358 million for the year ended December 31, 2024, compared to $346 million for the year ended December 31, 2023. The effective income tax rate, expressed by calculating income tax expense as a percentage of Income before income taxes, was 24.9% and 23.9% for 2024 and 2023, respectively. The higher effective income tax rate for the year ended December 31, 2024 as compared to the prior year was primarily attributable to lower excess tax benefits on equity-based compensation.\n27\nTable of Contents\nSegment Results of Operations\nNet sales by segment, in dollars and as a percentage of total Net sales, and the year-over-year dollar and percentage change in Net sales by segment are as follows:\nYear Ended December 31,\n2024\n2023\n(dollars in millions)\nNet Sales\nPercentage\nof Total Net Sales\nNet Sales\nPercentage\nof Total Net Sales\nDollar\nChange\nPercent\nChange\n(1)\nCorporate\n$\n8,837.2 \n42.1 \n%\n$\n8,960.8 \n41.9 \n%\n$\n(123.6)\n(1.4)\n%\nSmall Business\n1,523.5 \n7.3 \n1,556.0 \n7.3 \n(32.5)\n(2.1)\nPublic:\nGovernment\n2,486.9 \n11.8 \n2,669.1 \n12.5 \n(182.2)\n(6.8)\nEducation\n3,167.3 \n15.1 \n3,298.3 \n15.4 \n(131.0)\n(4.0)\nHealthcare\n2,503.5 \n11.9 \n2,338.3 \n10.9 \n165.2 \n7.1 \nTotal Public\n8,157.7 \n38.8 \n8,305.7 \n38.8 \n(148.0)\n(1.8)\nOther\n2,480.3 \n11.8 \n2,553.5 \n12.0 \n(73.2)\n(2.9)\nTotal Net sales\n$\n20,998.7 \n100.0 \n%\n$\n21,376.0 \n100.0 \n%\n$\n(377.3)\n(1.8)\n%\n(1)\nThere were 254 selling days for both the years ended December 31, 2024 and 2023. Average daily sales is defined as Net sales divided by the number of selling days.\nGross profit by segment, in dollars and Gross profit margin by segment, defined as Gross profit dollars as a percentage of Net sales by segment, and the year-over-year percentage change are as follows:\nYear Ended December 31,\n2024\n2023\n(dollars in millions)\nGross Profit\nGross Profit Margin\nGross Profit\nGross Profit Margin\nGross Profit Dollar Change\nPercent Change\nin Gross Profit\nSegments:\nCorporate\n$\n2,099.5 \n23.8 \n%\n$\n2,127.8 \n23.7 \n%\n$\n(28.3)\n(1.3)\n%\nSmall Business\n352.9 \n23.2 \n361.7 \n23.2 \n(8.8)\n(2.4)\nPublic\n1,659.2 \n20.3 \n1,667.5 \n20.1 \n(8.3)\n(0.5)\nOther\n(1)\n490.8 \n19.8 \n495.4 \n19.4 \n(4.6)\n(0.9)\nTotal Gross profit\n$\n4,602.4 \n21.9 \n%\n$\n4,652.4 \n21.8 \n%\n$\n(50.0)\n(1.1)\n%\n(1)\nIncludes the financial results for our other operating segments, CDW UK and CDW Canada, which do not meet the reportable segment quantitative thresholds.\nOperating income by segment, in dollars and as a percentage of Net sales by segment, and the year-over-year percentage change are as follows:\nYear Ended December 31,\n2024\n2023\n(dollars in millions)\nOperating Income\nOperating Income Margin\nOperating Income\nOperating Income Margin\nOperating Income Dollar Change\nPercent Change\nin Operating Income\nSegments:\n(1)\nCorporate\n$\n879.5 \n10.0 \n%\n$\n846.8 \n9.5 \n%\n$\n32.7 \n3.9 \n%\nSmall Business\n181.0 \n11.9 \n177.3 \n11.4 \n3.7 \n2.1 \nPublic\n745.9 \n9.1 \n735.0 \n8.8 \n10.9 \n1.5 \nOther\n(2)\n112.1 \n4.5 \n142.1 \n5.6 \n(30.0)\n(21.1)\nHeadquarters\n(3)\n(267.2)\nnm*\n(220.3)\nnm*\n(46.9)\n21.3 \nTotal Operating income\n$\n1,651.3 \n7.9 \n%\n$\n1,680.9 \n7.9 \n%\n$\n(29.6)\n(1.8)\n%\n*nm - Not meaningful\n28\nTable of Contents\n(1)\nSegment operating income includes the segment’s direct operating income, allocations for certain Headquarters’ costs, allocations for income and expenses from logistics services, certain inventory adjustments and volume rebates and cooperative advertising from vendors.\n(2)\nIncludes the financial results for our other operating segments, CDW UK and CDW Canada, which do not meet the reportable segment quantitative thresholds.\n(3)\nIncludes Headquarters’ function costs that are not allocated to the segments.\nThe year ended December 31, 2024 compared with the year ended December 31, 2023\nCorporate segment Net sales decreased $124 million, or 1.4%, primarily due to a decrease in netcomm products, partially offset by an increase in notebooks/mobile devices and software. \nCorporate segment Gross profit dollars decreased $28 million, or 1.3%, although partially offset by increased netted down revenue. Gross profit margin remained relatively consistent at 23.8%.\nCorporate segment Operating income increased $33 million, or 3.9%, primarily due to lower performance-based compensation, including equity-based compensation, consistent with lower attainment against certain financial measures, and lower payroll expenses.\nSmall Business segment Net sales decreased $33 million, or 2.1%, primarily due to a decline across all hardware categories, partially offset by an increase in services. \nSmall Business segment Gross profit dollars decreased $9 million, or 2.4%. Gross profit margin remained consistent at 23.2%.\nSmall Business segment Operating income increased $4 million, or 2.1%, as Gross profit dollars declined but were more than offset by a decrease across various selling and administrative expenses.\nPublic segment Net sales decreased $148 million, or 1.8%, primarily due to a decrease across various hardware categories. Most notably netcomm products decreased across all sales channels and collaboration products decreased within the Education sales channel, partially offset by an increase in notebooks/mobile devices across all channels. \nPublic segment Gross profit dollars decreased $8 million, or 0.5%. Gross profit margin increased 20 bps, to 20.3%, primarily due to increased netted down revenue.\nPublic segment Operating income increased $11 million, or 1.5%, primarily due to decreased acquisition and integration costs.\nNet sales in Other, which is comprised of results from our UK and Canadian operations, decreased $73 million, or 2.9%, primarily due to a decrease in software related to the UK operations. \nOther Gross profit dollars decreased $5 million, or 0.9%. Gross profit margin increased 40 bps, to 19.8%, due to increased netted down revenue.\nOther Operating income decreased $30 million, or 21.1%, primarily due to increased transformation initiative expense, lower Gross profit dollars and increased bad debt expense for expected credit losses. \nNon-GAAP Financial Measure Reconciliations\nGenerally, a non-GAAP financial measure is a numerical measure of a company’s performance or financial condition that either excludes or includes amounts that are not normally included or excluded in the most directly comparable measure calculated and presented in accordance with US GAAP. Non-GAAP measures used by management may differ from similar measures used by other companies, even when similar terms are used to identify such measures. \nOur non-GAAP performance measures include Non-GAAP operating income, Non-GAAP operating income margin, Non-GAAP net income, Non-GAAP net income per diluted share and Net sales on a constant currency basis, and our non-GAAP financial condition measures include Free cash flow and Adjusted free cash flow. These non-GAAP performance measures and non-GAAP financial condition measures are collectively referred to as “non-GAAP financial measures.”\nNon-GAAP operating income excludes, among other things, charges related to the amortization of acquisition-related intangible assets, equity-based compensation and the associated payroll taxes, acquisition and integration expenses, transformation initiatives and workplace optimization. Non-GAAP operating income margin is defined as Non-GAAP operating income as a percentage of Net sales. Non-GAAP net income and Non-GAAP net income per diluted share exclude, among other things, charges related to the amortization of acquisition-related intangible assets, equity-based compensation and the associated payroll taxes, acquisition and integration expenses, transformation initiatives, workplace optimization and their associated income tax effects. Net sales on a constant currency basis is defined as Net sales excluding the impact of foreign currency \n29\nTable of Contents\ntranslation on Net sales. Free cash flow is defined as Net cash provided by operating activities less capital expenditures. Adjusted free cash flow is defined as Free cash flow adjusted to include certain cash flows from financing activities incurred in the normal course of operations or as capital expenditures. \nWe believe our non-GAAP performance measures provide analysts, investors and management with useful information regarding the underlying operating performance of our business, as they remove the impact of items that management believes are not reflective of underlying operating performance. Management uses these measures to evaluate period-over-period performance as management believes they provide a more comparable measure of the underlying business. We also present non-GAAP financial condition measures as we believe they provide analysts, investors and management with more information regarding our liquidity and capital resources. Certain non-GAAP financial measures are also used to determine certain components of performance-based compensation.\nWe have included reconciliations of our non-GAAP financial measures to the most comparable US GAAP financial measures for the years ended December 31, 2024 and 2023 below.\nNon-GAAP operating income and Non-GAAP operating income margin\nYear Ended December 31,\n(dollars in millions)\n2024\nPercentage of Net Sales\n2023\nPercentage of Net Sales\nPercent Change \nOperating income, as reported\n$\n1,651.3 \n7.9 \n%\n$\n1,680.9 \n7.9 \n%\n(1.8)\n%\nAmortization of intangibles\n(1)\n150.9 \n154.4 \nEquity-based compensation\n64.7 \n93.7 \nTransformation initiatives\n(2)\n34.8 \n27.1 \nAcquisition and integration expenses\n12.2 \n30.0 \nWorkplace optimization\n(3)\n25.4 \n47.7 \nOther adjustments\n7.7 \n5.3 \nNon-GAAP operating income\n$\n1,947.0 \n9.3 \n%\n$\n2,039.1 \n9.5 \n%\n(4.5)\n%\n(1)\nIncludes amortization expense for acquisition-related intangible assets, primarily customer relationships, customer contracts and trade names.\n(2)\nIncludes costs related to strategic transformation initiatives focused on optimizing various operations and systems.\n(3)\nIncludes costs related to workforce reductions and charges related to the reduction of our real estate lease portfolio.\nNon-GAAP net income and Non-GAAP net income per diluted share \nYear Ended December 31, 2024\nYear Ended December 31, 2023\n(dollars and shares in millions, except per share amounts)\nIncome before income taxes\nIncome tax\nexpense\n(1)\nNet income\nIncome before income taxes\nIncome tax\nexpense\n(1)\nNet income\nNet Income Percent Change\nUS GAAP, as reported\n$\n1,435.4 \n$\n(357.6)\n$\n1,077.8 \n$\n1,450.2 \n$\n(345.9)\n$\n1,104.3 \n(2.4)\n%\nAmortization of intangibles\n(2)\n150.9 \n(39.2)\n111.7 \n154.4 \n(40.2)\n114.2 \nEquity-based compensation\n64.7 \n(26.7)\n38.0 \n93.7 \n(47.6)\n46.1 \nTransformation initiatives\n(3)\n34.8 \n(9.1)\n25.7 \n27.1 \n(7.1)\n20.0 \nAcquisition and integration expenses\n12.2 \n(2.1)\n10.1 \n30.0 \n(7.8)\n22.2 \nWorkplace optimization\n(4)\n25.4 \n(6.6)\n18.8 \n47.7 \n(12.4)\n35.3 \nOther adjustments\n6.9 \n(1.8)\n5.1 \n5.3 \n(1.2)\n4.1 \nNon-GAAP\n$\n1,730.3 \n$\n(443.1)\n$\n1,287.2 \n$\n1,808.4 \n$\n(462.2)\n$\n1,346.2 \n(4.4)\n%\nNet income per diluted share, as reported\n$\n7.97 \n$\n8.10 \nNon-GAAP net income per diluted share\n$\n9.52 \n$\n9.88 \nShares used in computing US GAAP and Non-GAAP net income per diluted share\n135.2 \n136.3 \n(1)\nIncome tax on non-GAAP adjustments includes excess tax benefits associated with equity-based compensation.\n(2)\nIncludes amortization expense for acquisition-related intangible assets, primarily customer relationships, customer contracts and trade names.\n(3)\nIncludes cost related to strategic transformation initiatives focused on optimizing various operations and systems.\n30\nTable of Contents\n(4)\nIncludes costs related to workforce reductions and charges related to the reduction of our real estate lease portfolio.\nNet sales on a constant currency basis\nYear Ended December 31,\n(dollars in millions)\n2024\n2023\nPercent Change\n(1)\nNet sales, as reported\n$\n20,998.7 \n$\n21,376.0 \n(1.8)\n%\nForeign currency translation\n(2)\n— \n32.5 \nNet sales, on a constant currency basis\n$\n20,998.7 \n$\n21,408.5 \n(1.9)\n%\n(1)\nThere were 254 selling days for both the years ended December 31, 2024 and 2023. Average daily sales is defined as Net sales divided by the number of selling days.\n(2)\nRepresents the effect of translating Net sales for the year ended December 31, 2023 of CDW UK and CDW Canada at the average exchange rates applicable in 2024.\nFree cash flow and Adjusted free cash flow\nYear Ended December 31,\n(dollars in millions)\n2024\n2023\nNet cash provided by operating activities\n$\n1,277.3 \n$\n1,598.7 \nCapital expenditures\n(122.6)\n(148.2)\nFree cash flow\n1,154.7 \n1,450.5 \nNet change in accounts payable - inventory financing\n(75.7)\n(23.7)\nAdjusted free cash flow\n(1)\n$\n1,079.0 \n$\n1,426.8 \n(1)\nDefined as Net cash provided by operating activities less capital expenditures, adjusted to include cash flows from financing activities that relate to the purchase of inventory.\nSeasonality\nWhile we have not historically experienced seasonality throughout the year, sales in our Public segment have historically been higher in the second and third quarter than in other quarters primarily due to the buying patterns of education and government customers. \nLiquidity and Capital Resources\nOverview\nWe finance our operations and capital expenditures with cash from operations and borrowings under our variable rate senior unsecured revolving loan facility (the “Revolving Loan Facility”). As of December 31, 2024, we had $1.2 billion of availability for borrowings under our Revolving Loan Facility. Our liquidity and borrowing plans are established to align with our financial and strategic planning processes and ensure we have the nece\nssary funding to meet our operating commitments, which primarily include the purchase of inventory, payroll and general expenses. We also take into consideration our overall capital allocation strategy, which includes dividend payments, assessment of debt levels, acquisitions and share repurchases. We believe we have adequate sources of liquidity and funding available for at least the next year; however, there are a number of factors that may negatively impact our av\nailable sources of funds. The amount of cash generated from operations will be dependent upon factors such as the successful execution of our business plan, general economic conditions and working capital management.\nOur material contractual obligations consist of debt and related interest payments and operating leases. For additional information regarding future maturities of debt and operating leases, see Note 8 (Debt) and Note 11 (Leases), respectively, to the accompanying Consolidated Financial Statements included in Part II, Item 8 of this report.\nLong-Term Debt and Financing Arrangements\nDuring the third quarter of 2024, we completed the issuance of $600 million aggregate principal amount of 5.100% Senior Notes due 2030 and $600 million aggregate principal amount of 5.550% Senior Notes due 2034 (collectively, the “Notes”). Concurrent with the Notes issuance, we completed a cash tender offer for $391 million and $389 million of the outstanding aggregate principal amounts under the 5.500% Senior Notes due 2024 and the 4.125% Senior Notes due 2025, respectively, \n31\nTable of Contents\nplus accrued and unpaid interest, fees and expenses. During the fourth quarter of 2024, we redeemed the remaining outstanding 5.500% Senior Notes due 2024, which were scheduled to mature on December 1, 2024, at par for $184 million.\nAs of December 31, 2024, we had total unsecured indebtedness of $5.8 billion, and we were in compliance with the covenants under our credit agreements and indentures.\nWe may from time to time repurchase one or more series of our outstanding unsecured senior notes, depending on market conditions, contractual commitments, our capital needs and other factors. Repurchases of our senior notes may be made by open market or privately negotiated transactions and may be pursuant to Rule 10b5-1 plans or otherwise.\nFor additional information regarding our debt and refinancing activities, see Note 8 (Debt) to the accompanying Consolidated Financial Statements included in Part II, Item 8 of this report.\nInventory Financing Agreements\nWe have entered into agreements with certain financial intermediaries to facilitate the purchase of inventory from various suppliers under certain terms and conditions to enhance working capital. These amounts are classified separately as Accounts payable-inventory financing on the Consolidated Balance Sheets. We do not incur any interest expense or other incremental expenses associated with these agreements as balances are paid when they are due. For additional information, see Note 7 (Inventory Financing Agreements) to the accompanying Consolidated Financial Statements included in Part II, Item 8 of this report.\nShare Repurchase Program\nDuring 2024, we repurchased 2.4 million shares of our common stock for $500 million under the previously announced share repurchase program. For additional information about our share repurchase program, refer to Note 12 (Stockholders’ Equity) to the accompanying Consolidated Financial Statements included in Part II, Item 8 of this report.\nDividends\nA summary of 2024 dividend activity for our common stock is as follows:\nDividend Amount\nDeclaration Date\nRecord Date\n Payment Date\n$\n0.620 \nFebruary 6, 2024\nFebruary 26, 2024\nMarch 12, 2024\n0.620 \nApril 30, 2024\nMay 24, 2024\nJune 11, 2024\n0.620 \nJuly 30, 2024\nAugust 26, 2024\nSeptember 10, 2024\n0.625 \nOctober 29, 2024\nNovember 25, 2024\nDecember 10, 2024\n$\n2.485 \nO\nn February 5, 2025, we announced that our Board of Directors declared a quarterly cash dividend on our common stock of $0.625 per share. The dividend will be paid on March 11, 2025 to all stockholders of record as of the close of business on February 25, 2025.\nThe payment of any future dividends will be at the discretion of our Board of Directors and will depend upon our results of operations, financial condition, business prospects, capital requirements, contractual restrictions (including in current or future agreements governing our indebtedness), restrictions imposed by applicable law, tax considerations and other factors that our Board of Directors deems relevant.\n32\nTable of Contents\nCash Flows\nCash flows from operating, investing and financing activities are as follows:\nYear Ended December 31,\n(dollars in millions)\n2024\n2023\nNet cash provided by operating activities\n$\n1,277.3 \n$\n1,598.7 \nInvesting Activities:\nCapital expenditures\n(122.6)\n(148.2)\nPurchases of short-term investments\n(211.1)\n— \nAcquisitions of businesses, net of cash acquired\n(323.9)\n(76.4)\nOther\n(1.6)\n(5.0)\nCash flows used in investing activities\n(659.2)\n(229.6)\nFinancing Activities:\nNet change in accounts payable - inventory financing\n(75.7)\n(23.7)\nOther cash flows from financing activities\n(611.2)\n(1,075.0)\nCash flows used in financing activities\n(686.9)\n(1,098.7)\nEffect of exchange rate changes on cash, cash equivalents and restricted cash\n(12.2)\n3.1 \nNet (decrease) increase in cash, cash equivalents and restricted cash\n$\n(81.0)\n$\n273.5 \nOperating Activities\nCash flows from operating activities are as follows:\nYear Ended December 31,\n(dollars in millions)\n2024\n2023\nChange\nNet income\n$\n1,077.8 \n$\n1,104.3 \n$\n(26.5)\nAdjustments for the impact of non-cash items\n(1)\n362.2 \n375.6 \n(13.4)\nNet income adjusted for the impact of non-cash items\n1,440.0 \n1,479.9 \n(39.9)\nChanges in assets and liabilities:\nAccounts receivable\n(2)\n(559.4)\n(54.5)\n(504.9)\nMerchandise inventory\n(3)\n61.1 \n139.0 \n(77.9)\nAccounts payable-trade\n(4)\n443.8 \n(55.4)\n499.2 \nOther\n(5)\n(108.2)\n89.7 \n(197.9)\nNet cash provided by operating activities\n$\n1,277.3 \n$\n1,598.7 \n$\n(321.4)\n(1)\nIncludes items such as depreciation and amortization, deferred income taxes, provision for credit losses and equity-based compensation expense. \n(2)\nThe change is primarily due to timing of collections, including multi-year transactions. \n(3)\nThe change is primarily due to customer-driven stocking positions. \n(4)\nThe change is primarily due to timing of payments, including multi-year transactions. \n(5)\nThe change is primarily due to higher Miscellaneous receivables and Prepaid expenses and other in 2024.\n33\nTable of Contents\nIn order to manage our working capital and operating cash needs, we monitor our cash conversion cycle, defined as days of sales outstanding in accounts receivable plus days of supply in inventory minus days of purchases outstanding in accounts payable, based on a rolling three-month average. Components of our cash conversion cycle are as follows:\nDecember 31,\n(in days)\n2024\n2023\nDays of sales outstanding (DSO)\n(1)\n84 \n77 \nDays of supply in inventory (DIO)\n(2)\n13 \n13 \nDays of purchases outstanding (DPO)\n(3)\n(79)\n(73)\nCash conversion cycle\n18 \n17 \n(1)\nRepresents the rolling three-month average of the balance of the current portion of Accounts receivable, net at the end of the period, divided by average daily Net sales for the same three-month period. Also incorporates components of other miscellaneous receivables.\n(2)\nRepresents the rolling three-month average of the balance of Merchandise inventory at the end of the period divided by average daily Cost of sales for the same three-month period.\n(3)\nRepresents the rolling three-month average of the combined balance of the current portion of Accounts payable-trade, excluding cash overdrafts, and Accounts payable-inventory financing at the end of the period divided by average daily Cost of sales for the same three-month period.\nThe cash conversion cycle increased to 18 days at December 31, 2024, compared to 17 days at December 31, 2023. The overall increase was primarily driven by an increase in DSO due to multi-year transactions and timing of collections. This was partially offset by an increase in DPO due to multi-year transactions and timing of payments. If customers continue to shift their software purchases to multi-year arrangements, unbilled receivables will continue to grow, which is offset by the growth in accounts payable to match the timing of collections due from customers with the payments due to vendors. Netted down revenue results in an increase in both DSO and DPO as the corresponding receivables and payables reflect the gross amounts due from customers and due to vendors while the corresponding sales and cost of sales are reflected on a net basis within Net sales. \nInvesting Activities\nNet cash used in investing activities increased $430 million in 2024 compared to 2023. This increase was primarily due to the acquisition of Mission Cloud Services, Inc. and purchases of short-term investments in 2024.\nFinancing Activities\nNet cash used in financing activities decreased $412 million in 2024 compared to 2023. The decrease was primarily driven by the Notes issuance in 2024, partially offset by the repayments of long-term debt. For additional information regarding the inventory financing and debt, see Note 7 (Inventory Financing Agreements) and Note 8 (Debt) to the accompanying Consolidated Financial Statements included in Part II, Item 8 of this report.\nOff-Balance Sheet Arrangements\nWe have no off-balance sheet arrangements that have or are reasonably likely to have a material current or future effect on our financial condition, results of operations or liquidity.\nIssuers and Guarantors of Debt Securities\nEach series of our outstanding unsecured senior notes (collectively, the “Notes”) are issued by CDW LLC and CDW Finance Corporation (the “Issuers”) and are guaranteed by Parent and certain of CDW LLC’s direct and indirect, 100% owned, domestic subsidiaries (the “Guarantor Subsidiaries” and, together with Parent, the “Guarantors”). All guarantees by Parent and the Guarantor Subsidiaries are joint and several, and full and unconditional; provided that guarantees by the Guarantor Subsidiaries are subject to certain customary release provisions contained in the indentures governing the Notes. \nThe Notes and the related guarantees are the Issuers’ and the Guarantors’ senior unsecured obligations and are:\n•\nstructurally subordinated to all existing and future indebtedness and other liabilities of our non-guarantor subsidiaries and\n•\nrank equal in right of payment with all of the Issuers’ and the Guarantors’ existing and future unsecured senior debt.\n34\nTable of Contents\nThe following tables set forth Balance Sheet information as of December 31, 2024 and December 31, 2023, and Statement of Operations information for the years ended December 31, 2024 and 2023 for the accounts of the Issuers and the accounts of the Guarantors (the “Obligor Group”). The financial information of the Obligor Group is presented on a combined basis and the intercompany balances and transactions between the Obligor Group have been eliminated.\nBalance Sheet Information\nDecember 31,\n(dollars in millions)\n2024\n2023\nCurrent assets\n$\n6,395.9 \n$\n5,770.0 \n   Goodwill\n4,158.3 \n3,939.7 \n   Other assets\n2,502.1 \n1,978.4 \nTotal Non-current assets\n$\n6,660.4 \n$\n5,918.1 \nCurrent liabilities\n$\n4,990.6 \n$\n4,975.4 \n   Long-term debt\n5,606.8 \n5,031.4 \n   Other liabilities\n1,166.1 \n697.7 \nTotal Long-term liabilities\n$\n6,772.9 \n$\n5,729.1 \nStatements of Operations Information\nYear Ended December 31,\n(dollars in millions)\n2024\n2023\nNet sales\n$\n18,494.0 \n$\n18,759.4 \nGross profit\n4,116.9 \n4,106.4 \nOperating income\n1,560.5 \n1,507.3 \nNet income\n1,014.1 \n945.6 \nCommitments and Contingencies\nThe information set forth in Note 16 (Commitments and Contingencies) to the accompanying Consolidated Financial Statements included in Part II, Item 8 of this report.\nCritical Accounting Policies and Estimates\nThe preparation of the Consolidated Financial Statements in accordance with US GAAP requires management to make use of certain estimates and assumptions that affect the reported amounts of assets, liabilities, revenues and expenses, as well as related disclosure of contingent assets and liabilities in the Consolidated Financial Statements and accompanying notes. We base our estimates on historical experience and on various other assumptions that we believe are reasonable under the circumstances. Historically, we have not made significant changes to the methods for determining these estimates as our actual results have not differed materially from our estimates. We do not believe it is reasonably likely that the estimates and related assumptions will change materially in the foreseeable future; however, actual results could differ from those estimates under different assumptions, judgments or conditions.\nCritical accounting policies and estimates are those that are most important to the portrayal of our financial condition and results of operations, and which require us to make our most difficult and subjective judgments, often as a result of the need to make estimates of matters that are inherently uncertain. Based on this definition, we have identified the critical accounting policies and estimates addressed below. For additional information related to significant accounting policies used in the preparation of our Consolidated Financial Statements, see Note 1 (Description of Business and Summary of Significant Accounting Policies) to the accompanying Consolidated Financial Statements included in Part II, Item 8 of this report.\nRevenue Recognition\nWe sell some of our products and services as part of bundled contract arrangements containing multiple performance obligations, which may include a combination of different products and services. Significant judgment may be required when \n35\nTable of Contents\ndetermining whether products and services are considered distinct performance obligations that should be accounted for separately versus together.\nFor contracts consisting of multiple performance obligations, the total transaction price is allocated to each performance obligation based upon its standalone selling price. Judgment is required to determine the standalone selling price for each distinct performance obligation. For certain types of performance obligations, we use a combination of methods to estimate the standalone selling price based on recent transactions. When evidence from recent transactions is not available to confirm that the prices are representative of the standalone selling price, an expected cost plus margin approach is used.\nAdditional judgment is required in determining whether we are the principal, and report revenues on a gross basis, or agent, and report revenues on a net basis. For each identified performance obligation in a transaction, we evaluate the facts and circumstances present to determine whether or not we control the specified good or service prior to transfer to the customer. This evaluation includes, but is not limited to, assessing indicators such as whether: (i) we are primarily responsible for fulfilling the promise to provide the specified goods or service, (ii) we have inventory risk before the specified good or service has been transferred to a customer and (iii) we have discretion in establishing the price for the specified good or service. When the evaluation indicates we control the specified good or service prior to transfer to the customer, we are acting as a principal. When the evaluation indicates we do not control the specified good or service prior transfer to the customer, we are acting as an agent.\nThe nature of our contracts give rise to variable consideration, primarily in the form of volume rebates and sales returns and allowances. We estimate variable consideration at the most likely amount to which we expect to be entitled. The estimates of variable consideration and determination of whether to include estimated amounts in the transaction price are based on an assessment of our anticipated performance and all information that is reasonably available.\nWe recognize revenue from performance obligations when, or as, the customer obtains control over the specified good or service. That is, when the customer has the ability to direct the use of and obtain substantially all of the benefits from the good or service. For the sale of hardware, this is generally upon delivery to the customer. As a result, we perform an analysis to estimate the amount of Net sales in-transit at the end of the period and adjust revenue and the related costs to reflect only what has been delivered to the customer. This analysis requires judgment whereby we perform an analysis of the estimated number of days of sales in-transit to customers at the end of each reporting period based on a weighted-average analysis of commercial delivery terms that include drop-shipment arrangements. Changes in delivery patterns may result in a different number of business days estimated to make this adjustment. For the sale of professional services, we recognize the revenue over time given that our customers simultaneously receive and consume the benefits from these services as they are performed. Depending on the arrangement, revenues from fixed fee contracts on professional services are recognized using an input method, which requires management to make estimates regarding the amount of resources required for each engagement in order to satisfy the performance obligation.\nGoodwill\nGoodwill is allocated to reporting units expected to benefit from the business combination. Goodwill is subject to periodic testing for impairment at the reporting unit level on an annual basis during the fourth quarter, or more frequently if events or changes in circumstances indicate that the asset may be impaired. These events or circumstances could include a significant change in the business climate, legal factors, operating performance indicators, competition or sale or disposition of a significant portion of a reporting unit.\nWe may elect to utilize a qualitative assessment to determine whether it is more likely than not that the fair value of a reporting unit is less than its carrying value. As part of our qualitative assessment, judgment is required in weighing the effect of various positive and negative factors that may affect the fair value. We consider various factors, including the excess of fair value over carrying value from the last quantitative test, macroeconomic conditions, industry and market considerations, the projected financial performance and actual financial performance compared to prior year projected financial performance.\nIf we elect to bypass the qualitative assessment, or if indicators of impairment exist, a quantitative impairment test is performed. As part of the quantitative assessment, application of the goodwill impairment test requires judgment, including the identification of reporting units, assignment of assets and liabilities to reporting units and determination of the fair value of each reporting unit. Fair value of a reporting unit is determined by using a weighted combination of an income approach and a market approach, as this combination is considered the most indicative of our fair value in an orderly transaction between market participants. This analysis requires significant judgments, including estimation of future cash flows, which is dependent on internal forecasts, estimation of the long-term rate of growth for our business, estimation of the useful life over which cash flows will occur, determination of our weighted average cost of capital, future market conditions and profitability of future business strategies. The estimates used to calculate the fair value of a reporting unit change from year to year based on operating results, market conditions and other factors. Changes in these estimates and assumptions could materially affect the \n36\nTable of Contents\ndetermination of fair value and goodwill impairment for each reporting unit. However, since our last quantitative analysis, our past estimates of fair value would not have indicated an impairment when revised to include subsequent years’ actual results.\nWe completed our annual impairment analysis during the fourth quarter of 2024. We performed a qualitative analysis for all reporting units and concluded that it was more likely than not that the fair values of all reporting units exceeded their respective carrying values and, therefore, did not result in an impairment. The last quantitative analysis was performed in the fourth quarter of 2023, and it was determined that the fair values of each reporting unit substantially exceeded their carrying values, resulting in no goodwill impairment.\nBusiness combinations\nWe allocate purchase price consideration to the assets acquired and liabilities assumed based on their fair values as of the acquisition date. Determining the fair value of these assets and liabilities requires the use of significant estimates, particularly in valuing acquired intangible assets and goodwill. \nPurchased intangible assets other than goodwill are initially recognized at fair value and amortized over their useful lives. We determine the fair value of purchased intangible assets using an income approach on an individual asset basis. The fair value measurements were primarily based on significant inputs that are not observable, which are categorized as a Level 3 measurement in the fair value hierarchy. The values assigned to consideration transferred, assets acquired and liabilities assumed may be adjusted during the measurement period as new information arises that existed as of the acquisition date.\nWe use the multi-period excess earnings method to determine the fair value of customer relationships. This method identifies the portion of revenue expected to be generated through repeat customers existing as of the valuation date and includes an attrition rate to account for the loss of customers over time. Critical estimates utilized in valuing customer relationships include estimated forecasted future revenue and EBITDA margin growth rates, customer attrition rates and market-participant discount rates. The assumptions we apply in forecasting future revenue and customer attrition rates is based on analysis of historical data, assessment of current and anticipated market conditions, estimated growth rates, and management plans.\nRecent Accounting Pronouncements\nSee the information set forth in Note 2 (Recent Accounting Pronouncements) to the accompanying Consolidated Financial Statements included in Part II, Item 8 of this report.",
  "item2": null
}