{
  "item1": "ERCOT Capacity Expiring (MWs) Customer-Facing Business one nation’s largest energy suppliers. Through integrated business operations, sell electricity, natural gas, other energy-related products sustainable solutions various types customers, including distribution utilities, municipalities, cooperatives, commercial, industrial, public sector, residential customers markets across multiple geographic regions. serve approximately 1.5 million total customers, including three-fourths Fortune 100 companies, approximately 1.2 million residential customers. leader electric power supply, serving approximately 202 TWhs 2024 through sales retail customers wholesale load auctions geographically diverse customer base.",
  "item7": "MANAGEMENT’S DISCUSSION ANALYSIS FINANCIAL CONDITION RESULTS OPERATIONS (Dollars millions, unless otherwise noted) producer carbon-free energy supplier energy products services. generating capacity includes primarily nuclear, wind, solar, natural gas, hydroelectric assets. Through integrated business operations, sell electricity, natural gas, other energy-related products sustainable solutions various types customers, including distribution utilities, municipalities, cooperatives, commercial, Significant Transactions Developments Proposed Acquisition Calpine Corporation January 10, 2025, entered agreement plan merger (Merger Agreement) Calpine Corporation (Calpine) under which will acquire all outstanding equity interests Calpine cash stock transaction. Calpine owns operates generation fleet natural gas, geothermal, battery storage, solar assets over 27 GWs generation capacity, addition competitive retail electric supplier platform serving approximately 2.5 million customers 60 TWhs load annually.",
  "item2": "MANAGEMENT’S DISCUSSION ANALYSIS FINANCIAL CONDITION RESULTS OPERATIONS (Dollars millions except per share data, unless otherwise noted) nation's largest producer carbon-free energy supplier energy products services. generating capacity includes primarily nuclear, wind, solar, natural gas, hydroelectric assets. Through integrated business operations, sell electricity, natural gas, other energy-related products sustainable solutions various types customers, including distribution utilities, municipalities, cooperatives, commercial, industrial, public sector, residential customers markets across multiple geographic regions. five reportable segments: Mid-Atlantic, Midwest, New York, ERCOT, Other Power Regions."
}