{
  "source_file": "ceg-20241231.htm",
  "form_type": "10-K",
  "item1": "ITEM 1.\n BUSINESS\nGeneral\nOn February 21, 2021, the Board of Directors of Exelon Corporation (“Exelon”) authorized management to pursue a plan to separate its competitive generation and customer-facing energy businesses, conducted through Constellation Energy Generation, LLC (“Constellation”, formerly Exelon Generation Company, LLC) and its subsidiaries, into an independent, publicly traded company. Constellation Energy Corporation (“CEG Parent” or the “Company”), a Pennsylvania corporation and a direct, wholly owned subsidiary of Exelon, was newly formed for the purpose of separation and had not engaged in any activities except in preparation for the distribution. On February 1, 2022, Exelon completed the separation by distributing all the outstanding shares of the Company’s common stock, on a pro rata basis to the holders of Exelon’s common stock, with the Company holding all the interests in Constellation previously held by Exelon (the \"Separation\"). As of 2002, Constellation has been an individual registrant since the registration of their public debt securities under the Securities Act. As an individual registrant, Constellation has historically filed consolidated financial statements to reflect their financial position and operating results as a stand-alone, wholly owned subsidiary of Exelon.\nUnless otherwise indicated or the context otherwise requires, references herein to the terms \"we,\" \"our,\" \"us\" and \"the Company\" refer collectively to CEG Parent and Constellation. See Glossary for defined terms.\nOur Business\nWe are the nation’s largest producer of reliable, emissions-free energy and a leading energy supplier to businesses, homes and public sector customers nationwide, including three-fourths of Fortune 100 companies. Our nuclear, hydro, wind, and solar generation facilities have the generating capacity to power the equivalent of 16 million homes, providing about 10 percent of the nation's clean energy in the United States. Our fleet is helping to accelerate the nation’s transition to a carbon-free future with more than 31,676 megawatts of capacity and an annual output that is nearly 90 percent carbon-free. We are committed to investing in innovative technologies to drive the transition to a reliable, sustainable and secure energy future. Our customer-facing business is one of the nation's largest competitive energy suppliers, offering innovative solutions to meet our customers' needs. We employ approximately 14,264 people, and do business in 48 states, the District of Columbia, Canada, and the United Kingdom.\nOur Operations\nWe operate the largest carbon-free generation fleet in the nation and are one of the largest competitive electric generation companies in the nation, as measured by owned and contracted MWs. Collectively, the combined fleet is the cleanest large generation portfolio in the country (nearly 90% carbon-free based on generation output of electricity) according to the 2024 Ceres Benchmarking Air Emissions of the 100 Largest Electric Power Producers in the United States.\n6\nTable of Contents\nAt December 31, 2024, our owned generating resources total capacity of 31,676 MWs consisted of the following:\n__________\n(a)\nNet generation capacity is stated at proportionate ownership share. See ITEM 2. PROPERTIES for additional information.\n(b)\nIncludes wind, hydroelectric, and solar generating assets.\nIn addition to the owned generating resources above, at December 31, 2024 we have contracted generation with a total capacity of 4,774 MWs, which represents electric supply procured under unit-specific agreements.\nThe following map illustrates the locations of our owned generation facilities as of December 31, 2024:\nOur Owned Generation Fleet Map\n(a)(b)\nOwned Assets\n__________\n(a)\nOne symbol is included per location. Some locations may have multiple generating units. Locations in tight geographic proximity may appear as one symbol. Units that are not currently operational are not captured.\n(b)\nDoes not reflect Grand Prairie Generating Station (Gas/Other), located in Alberta, Canada.\n7\nTable of Contents\nWe have five reportable segments, as described in the table below, representing the different geographic regions in which our owned generating resources are located and our customer-facing activities are conducted.\nSegment\n(a)\nNet Generation Capacity (MWs)\n(b)\n% of Net Generation Capacity\nGeographic Regions\nMid-Atlantic\n10,387 \n33 \n%\nEastern half of PJM, which includes New Jersey, Maryland, Virginia, West Virginia, Delaware, the District of Columbia, and parts of Pennsylvania and North Carolina\nMidwest\n11,608 \n37 \n%\nWestern half of PJM and the United States footprint of MISO, excluding MISO’s Southern Region\nNew York\n3,093 \n10 \n%\nNYISO\nERCOT\n4,740 \n15 \n%\nElectric Reliability Council of Texas\nOther Power Regions\n1,848 \n5 \n%\nNew England, South, West, and Canada\nTotal\n31,676 \n100 \n%\n__________\n(a)\nSee Note 5 — Segment Information of the Combined Notes to Consolidated Financial Statements for additional information on reportable segments.\n(b)\nNet generation capacity is stated at proportionate ownership share as of December 31, 2024. See ITEM 2. PROPERTIES for additional information.\nThe following table shows our total owned sources of electric supply of 208,434 GWhs and 202,474 GWhs for 2024 and 2023, respectively, which includes the proportionate share of output where we have an undivided ownership interest in jointly-owned generating plants.\n_________\n(a)\nIncludes wind, hydroelectric, and solar generating assets.\nIn addition to the owned generation above, we also had purchased power from the spot energy markets that are administered by the RTOs/ISOs and bilateral transactions of 60,983 GWhs and 67,215 GWhs for the years ended December 31, 2024 and 2023, respectively. See ITEM 7. MANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS for additional information on electric supply sources.\n8\nTable of Contents\nNuclear Facilities\nOur nuclear fleet is the nation’s largest, with current generating capacity of approximately 22 GWs, producing 182 TWhs of zero-emissions electricity during 2024 – enough to power 16 million homes and avoid more than 122 million metric tons of carbon emissions according to the EPA GHG Equivalencies Calculator. We have ownership interests in 14 nuclear generating stations currently in service, consisting of 25 units. As of December 31, 2024, we wholly own all our nuclear generating stations, except for undivided ownership interests in five jointly-owned nuclear stations: Quad Cities (75% ownership), Peach Bottom (50% ownership), Salem (42.59% ownership), NMP Unit 2 (82% ownership), and STP (44% ownership), that are reflected in our consolidated financial statements relative to our proportionate ownership interest in each unit. See ITEM 2. PROPERTIES for additional information on our nuclear facilities.\nIn September 2024, we executed a 20-year PPA with Microsoft that will support the restart of Three Mile Island Unit 1, renamed as the Crane Clean Energy Center, which was retired in 2019 for economic reasons. Under the agreement, Microsoft will purchase the output generated from the renewed plant which includes energy, capacity and carbon-free attributes as part of its goal to help power its data centers in PJM with clean energy. The site, which is expected to be online in 2028, will have approximately 835 MWs of carbon-free capacity. The restart is subject to certain regulatory approvals, permitting, and obtaining a renewed operating license.\nIn November 2023, we acquired NRG South Texas LP, which owns a 44% undivided ownership interest in the jointly-owned STP. Other owners include City Public Service Board of San Antonio (CPS, 40%) and the City of Austin, Texas (Austin Energy, 16%). In May 2024, we executed a settlement agreement with CPS/City of San Antonio, Austin, and NRG Energy, Inc., the terms of which require we sell a 2% ownership interest in STP to CPS. See Note 2 — Mergers, Acquisitions, and Dispositions of the Combined Notes to Consolidated Financial Statements for additional information regarding the acquisition of STP.\nWe operate all of our nuclear generating stations, except for the units at Salem and STP, which are operated by PSEG Nuclear, LLC (an indirect, wholly owned subsidiary of PSEG) and STPNOC, respectively. We have consistently operated our nuclear plants at best-in-class levels. During 2024, 2023, and 2022, our nuclear generating facilities achieved capacity factors\n(a)\n of 94.6%, 94.4%, and 94.8%, respectively, at ownership percentage. The nuclear capacity factor has been approximately four percentage points better than the industry average annually since 2013.\nCapacity factors, which are significantly affected by the number and duration of refueling and non-refueling outages, can have a material impact on our results of operations. In 2024, we achieved an average refueling outage duration of 19 days for units we operate. We achieved an average refueling outage duration of 21 days in both 2023 and 2022, respectively, against industry averages of 38 and 40 days, respectively.\nWe manage our scheduled refueling outages to minimize their duration and to maintain high nuclear generating capacity factors, resulting in a stable supply position for our wholesale and retail power marketing activities. In 2024, 2023, and 2022, electric supply (in GWhs) generated from our nuclear generating facilities was 67%, 65%, and 64%, respectively, of our total electric supply.\nDuring scheduled refueling outages, we perform maintenance and equipment upgrades in order to maintain safe, reliable operations and to minimize the occurrence of unplanned outages. In addition to the maintenance and equipment upgrades performed by us during scheduled refueling outages, we have extensive operating and security procedures in place to ensure the safe operation of our nuclear units. We also have extensive safety systems in place to protect the plant, personnel, and surrounding area in the unlikely event of an accident or other incident.\n__________\n(a)\nCapacity factor is defined as the ratio of the actual output of a unit (or combination of units) over a period of time to its output if the unit had operated at net monthly mean capacity for that time period. See ITEM 7. MANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS — Financial Results of Operations for additional information.\n9\nTable of Contents\nWe have original 40-year operating licenses from the NRC for each of our nuclear units and have received 20-year operating license renewals from the NRC for all our nuclear units except Clinton. PSEG and STPNOC have also received 20-year operating license renewals for the Salem and STP units, respectively. Peach Bottom has previously received a second 20-year license renewal from the NRC for Units 2 and 3, for a total 80-year term. See Note 3 — Regulatory Matters of the Combined Notes to Consolidated Financial Statements for additional information on the status of Peach Bottom's license renewal.\nThe following table summarizes the current license expiration dates for our nuclear facilities currently in service:\nStation\nUnit\nIn-Service\nDate\n(a)\nCurrent License\nExpiration\nBraidwood\n1 \n1988\n2046\n2 \n1988\n2047\nByron\n1 \n1985\n2044\n2 \n1987\n2046\nCalvert Cliffs\n1 \n1975\n2034\n2 \n1977\n2036\nClinton\n(b)\n1 \n1987\n2027\nDresden\n(b)\n2 \n1970\n2029\n3 \n1971\n2031\nFitzPatrick\n1 \n1975\n2034\nLaSalle\n1 \n1984\n2042\n2 \n1984\n2043\nLimerick\n1 \n1986\n2044\n2 \n1990\n2049\nNMP\n1 \n1969\n2029\n2 \n1988\n2046\nPeach Bottom\n(c)\n2 \n1974\n2033\n3 \n1974\n2034\nQuad Cities\n1 \n1973\n2032\n2 \n1973\n2032\nGinna\n1 \n1970\n2029\nSalem\n1 \n1977\n2036\n2 \n1981\n2040\nSTP\n1 \n1988\n2047\n2 \n1989\n2048\n__________\n(a)\nDenotes year in which nuclear unit began commercial operations.\n(b)\nWe are currently seeking license renewals for Clinton and Dresden Units 2 and 3 to extend the operating licenses by an additional 20 years.\n(c)\nIn February 2022, the NRC issued an order related to its review of our subsequent license renewal application for Peach Bottom and the NRC directed its staff to change the expiration dates for the licenses back to 2033 and 2034. We expect that the license expiration dates will be restored to 2053 and 2054, respectively. See Note 3 — Regulatory Matters of the Combined Notes to Consolidated Financial Statements for additional information.\nThe operating license renewal process takes approximately four years from commencement, which includes approximately two years for us to develop the application and approximately two additional years for the NRC to review the application. Depreciation provisions are based on the estimated useful lives of the stations, which generally include expectations for an additional 20-year term beyond current license expiration, except for Calvert Cliffs, FitzPatrick, Limerick, NMP Unit 2, Salem, and STP, where depreciation provisions correspond with the expiration of the current NRC operating license denoted in the table above. See Note 3 — Regulatory \n10\nTable of Contents\nMatters and Note 8 — Property, Plant, and Equipment of the Combined Notes to Consolidated Financial Statements for additional information.\nNatural Gas, Oil and Renewable Facilities (including Hydroelectric)\nWe operate approximately 10 GWs of natural gas, oil, hydroelectric, wind, and solar generation assets, which provide a mix of baseload, intermediate, and peak power generation. We wholly own all our natural gas, oil, and renewable generating stations, except for: (1) Wyman 4; (2) certain wind project entities; and (3) CRP. We operate all of these facilities, except for Wyman 4, which is operated by the principal owner, NextEra Energy Resources LLC, a subsidiary of NextEra Energy, Inc. See ITEM 2. PROPERTIES for additional information regarding these generating facilities and Note 21 — Variable Interest Entities of the Combined Notes to Consolidated Financial Statements for additional information regarding CRP, which is a VIE.\nIn 2024, 2023, and 2022, electric supply (in GWhs) generated from our owned natural gas, oil, and renewable generating facilities was 10%, 11%, and 10%, respectively, of our total electric supply.  Our natural gas, oil and renewable fleet has similarly demonstrated a track record of strong performance with a Dispatch Match\n(a)\n of 97.4%, 98.5%, and 98.2% and Renewables Energy Capture\n(b)\n of 96.1%, 96.4%, and 96.5% in 2024, 2023, and 2022, respectively.\nNatural gas, oil, wind and solar generation plants are generally not licensed, and therefore, the decision on when to retire plants is, fundamentally, a commercial one. FERC has the exclusive authority to license most non-federal hydropower projects located on navigable waterways or federal lands, or connected to the interstate electric grid, which include our Conowingo Hydroelectric Project (Conowingo) and Muddy Run Pumped Storage Facility Project (Muddy Run). Muddy Run's license expires on December 1, 2055 and is currently being depreciated over an estimated useful life that corresponds with the available license term. In March 2021, FERC issued a new 50-year license for Conowingo, which was subsequently vacated in December 2022; however, depreciation provisions continue to assume an estimated useful life through 2071 in anticipation of the license expiration date being restored. See Note 3 — Regulatory Matters of the Combined Notes to Consolidated Financial Statements for additional information on the status of Conowingo's license.\n__________\n(a)\nDispatch Match is used to measure the responsiveness of a unit to the market, expressed as the total actual energy revenue net of fuel cost relative to the total desired energy revenue net of fuel cost. Factors having an adverse effect on Dispatch Match include forced outages, derates, and failure to operate to the desired generation signal. Beginning in 2023, Dispatch Match reflects a change to remove the Conowingo run-of-river hydroelectric operational performance. Dispatch Match for 2022 was previously reported as 98.4%.\n(b)\nRenewable Energy Capture is an indicator of how efficiently the installed assets capture the natural energy available from the wind, the sun, and water. Renewable Energy Capture represents an energy-based fraction, the numerator of which is the energy produced by the sum of the wind turbines, solar panels, and run-of-river hydroelectric operations in the year, and the denominator of which is the total expected energy to be produced during the year, with adjustments made for certain events that are considered non-controllable, such as force majeure events, serial design-manufacturing equipment failures, and transmission curtailments. Renewable Energy Capture for the combined wind, solar, and run-of-river hydroelectric fleet is weighted by the relative site projected pre-tax variable revenue. Beginning in 2023, Renewable Energy Capture reflects a change to include the Conowingo run-of-river hydroelectric operational performance. Renewable Energy Capture for 2022 was previously reported as 95.8%.\n11\nTable of Contents\nContracted Generation\nIn addition to energy produced by owned generation assets, we source electricity from generators we do not own under long-term contracts. The following tables summarize our long-term contracts to purchase unit-specific physical power with an original term in excess of one year in duration, by region, in effect as of December 31, 2024:\nRegion\nNumber of\nAgreements\nExpiration \nDates\nCapacity (MWs)\nMid-Atlantic\n \n17 \n2025 - 2039\n446 \nMidwest\n7 \n2026 - 2044\n805 \nERCOT\n8 \n2025 - 2035\n1,121 \nOther Power Regions\n16 \n2025 - 2037\n2,402 \nTotal\n48 \n4,774 \n2025\n2026\n2027\n2028\n2029\n2030 and thereafter\nTotal\nCapacity Expiring (MWs)\n501 \n398 \n5 \n75 \n98 \n3,697 \n4,774 \nCustomer-Facing Business\nWe are one of the nation’s largest energy suppliers. Through our integrated business operations, we sell electricity, natural gas, and other energy-related products and sustainable solutions to various types of customers, including distribution utilities, municipalities, cooperatives, and commercial, industrial, public sector, and residential customers in markets across multiple geographic regions. We serve approximately 1.5 million total customers, including three-fourths of Fortune 100 companies, and approximately 1.2 million residential customers.\nWe are a leader in electric power supply, serving approximately 202 TWhs in 2024 through sales to retail customers and wholesale load auctions to a geographically diverse customer base. The following table illustrates these volumes across our five reportable segments:\n2024 Electric Power Supply (TWhs) Served\n(a\n)\n__________\n(a)\nIncludes retail load and wholesale load auction volumes only. Electric generation in excess of our total retail and wholesale load would be sold in the respective RTO or ISO in which our facility is located. Other includes New England, South, and West.\n12\nTable of Contents\nWe are active in all domestic wholesale power and gas markets that span the entire lower 48 states and have complementary retail activity across many of those states. We typically obtain power supply from the market to meet our wholesale and retail obligations; our market risk is mitigated by our owned and contracted generation located in multiple geographic regions. The commodity risks associated with the output from owned and contracted generation are managed using various commodity transactions including sales to retail customers, trades on commodity exchanges, bilateral contracts, and sales to wholesale counterparties in accordance with our hedging program. See further discussion of the hedging program in the Price and Supply Risk Management section below. The main objective is to obtain low-cost energy supply to meet physical delivery obligations to both our wholesale and retail customers.\nRetail Market\nRetail competition in states across the U.S. range from full competition of energy suppliers for all retail customers (commercial, industrial, public sector, and residential) to partial retail competition available up to a capped amount for C&I customers only. We are a leader in retail markets, serving approximately 144 TWhs of electric power retail load and approximately 800 Bcf of gas in 2024, primarily to C&I customers across multiple geographic regions in the U.S.\nDiverse Geographic Footprint in Retail Market\nStrong customer relationships are a key part of our customer-facing business strategy, as demonstrated by our high renewal rates. Retail customer renewal rates have been strong over the last nine years across C&I power customer groups with average contract terms of approximately two years and customer duration of approximately five years, with many customers well beyond these metrics. Specifically, we enjoyed renewal rates of 78% for C&I power customers and 88% for C&I gas customers in 2024, owing to both our competitive pricing as well as our strong customer relationships. Our consistently high renewal rates are driven by our ability to provide customized solutions and deliver focused attention to our customers’ needs, resulting in an industry-leading C&I customer-service business ranking in the DNV 2024 Energy Blueprint: Sales Strategies report. We are also successful at acquiring new customers by offering innovative services and products that meet their needs. In addition to our high customer renewal rates, we have produced consistently high new win rates within C&I power \n13\nTable of Contents\nas well, acquiring nearly one out of every three new customers who have chosen to shop with us over the past six years.\nHigh customer satisfaction levels, market expertise, stability, and scale driven growth have resulted in a historically proven business with consistent margins. While providing customers with a competitive price is a key focus, we leverage our broad suite of electric and gas product structures, oftentimes customized, to provide customers with the commodity solution and information that best fits their needs. It is this attention to the customer that creates the durable and repeatable value highlighted in these statistics.\nConsumer purchasing strategies have trended from direct supply relationships to third-party relationships with a number of customers looking to third-party consultants and brokers to find suppliers like us to reduce costs and evaluate the increasing number of options available for expanding energy solutions beyond the commodity. In response, we have expanded our third-party capabilities, created scale through a comprehensive support structure, and enhanced digital applications providing tools, tracking, and measurement, as well as the ability to extend the reach of our sustainability solutions to drive additional market share. While this trend of customers using third parties to find suppliers has slowed in recent years, we have remained the market leader in direct C&I sales with over 32% of the C&I market share of direct customer business driven by our highly experienced and long-tenor direct sales team.\nWholesale Market\nOur wholesale channel-to-market involves the sale of electricity among electric utilities and electricity marketers before it is eventually sold to end-use consumers. In 2024, we served approximately 58 TWhs of power load across competitive utility load procurement and bilateral sales to municipalities, co-ops, and other wholesale entities. Complementary to our national customer portfolio, we have several decades of relationships with wholesale counterparties across all domestic power markets as a means of both monetizing our own generation, as well as sourcing contracted generation to meet customer and portfolio needs. With increased customer demand for sustainability, our ability to source contracted generation has provided a capital-light way for us to provide customers with long-term sustainable solutions they are demanding to support a cleaner energy ecosystem. This creates durable customer relationships and repeatable business through the ability to respond to customer and marketplace trends. Similarly, this contracting acumen provides the ability to supplement our native generation with other non-renewable assets to meet changing portfolio needs in a financially efficient manner. \nIn our wholesale gas business, we participate across all parts of the gas value chain, including trading, transport and storage, and physical supply.\nEnergy Solutions\nAs one of the largest customer-facing platforms in the U.S., we benefit from significant economies of scale, that allow us to provide our customers with competitively priced energy and to structure highly tailored solutions targeted to a customer’s unique power needs and clean energy goals. Our CORe+ product serves C&I customers' sustainability needs by matching contracted, third-party new-build renewable generation with customer desire to add additional carbon-free generation to the grid with a preference to be located within the same region as their load. In 2024, we continued to see growing demand for our Hourly Carbon-Free Energy (CFE) product and platform, as we have closed a number of additional Hourly CFE transactions with a strong pipeline of interested prospects. Achieving 100% carbon-free power is a key sustainability goal for many organizations. As customers make the transition to 100% hourly carbon-free power, many are looking to bridge the gap between their real-time electricity demand and available sources of carbon-free power. Our Hourly CFE platform and associated products match carbon-free generation every hour with a customer’s load, along with appropriate tracking and retirement of hourly attributes in the applicable registry. Many existing CORe+ customers are converting to 100% Hourly CFE with existing nuclear filling in the gaps of the hours renewable generation is not producing. In addition to larger-scale CORe+ offerings and Hourly CFE, we offer a range of sustainability solutions to customers (e.g., RECs, CORe+, EFECs, RINs, RNG, carbon offsets, etc.) as well as offers for carbon-free generation attributes to support their needs during the transition to a carbon-free energy ecosystem.\nWe also partner with our customers to provide energy efficiency options to meet their carbon-free energy goals. Our energy efficiency products provide the ability to optimize performance and maximize efficiency across customer facilities and operations through contract structures that include implementation of energy efficiency upgrades and behind-the-meter solutions with no upfront capital requirements. Additionally, these service \n14\nTable of Contents\nofferings provide scalable solutions to meet sustainability goals through investment across the life of the facility or operations and allow for greater budget certainty. The ongoing ability to optimize energy consumption for customers allows us to support customer demands with the right combination of technology and efficiency program options.\nIn addition to sustainability solutions, data and analytics have also become increasingly important for our customers. We recently launched Constellation Navigator, which delivers customized paths and sustainable solutions for customers to set and meet their environmental and operational goals. Driven by advanced technology platforms and experienced advisors, it provides strategies to help organizations understand their baseline emissions and reduce their carbon footprints. Constellation Navigator helps businesses solve challenges across the energy lifecycle including utility bill management, carbon accounting, rebate administration and sustainability advisory services. These platforms and services provide new avenues for incremental growth by coupling the opportunities for customer usage optimization with accompanying products and sustainable solutions that we can provide to customers. These types of data and analytical services allow us to grow our customer base in previously inaccessible regulated markets by offering non-commodity energy-related products and services.\nWe continue to look for new and innovative products and solutions to bring to our customers. Constellation Technology Ventures (CTV) is our venture investing business, focused on driving innovation and scaling breakthrough technologies. CTV invests in a broad range of hardware and software solutions that accelerate the transition to a sustainable, low-carbon economy. Our portfolio spans diverse areas, including, generation technologies, sustainability monitoring tools, distributed energy resources, financing solutions, and more. By collaborating closely with our portfolio companies, we help commercialize their products and technologies across our expansive customer base, creating value for both our partners and us.\nPrice and Supply Risk Management\nWe leverage a combination of wholesale and retail customer load sales, federal and state programs, as well as non-derivative and derivative contracts, all with credit-approved counterparties, to hedge the commodity price risk of our generation portfolio.\nBeginning in 2024, our existing nuclear fleet is eligible for the nuclear PTC provided by the IRA, an important tool in managing commodity price risk for each nuclear unit not already receiving state support. The nuclear PTC provides increasing levels of support as unit revenues decline below levels established in the IRA and is further adjusted for inflation after 2024 through the duration of the program based on the GDP price deflator for the preceding calendar year. See Note 3 — Regulatory Matters and Note 6 — Government Assistance of the Combined Notes to Consolidated Financial Statements for additional information on the nuclear PTC.\nIn locations and periods where our load serving activities do not naturally offset existing generation portfolio risk, remaining commodity price exposure is managed through portfolio hedging activities. Portfolio hedging activities are generally concentrated in the prompt three years, when customer demand and market liquidity enable effective price risk mitigation. During this prompt three-year period, we seek to mitigate price risk associated with our load serving contracts, non-nuclear generation, and any residual price risk for our nuclear generation that the nuclear PTC and state programs may not fully mitigate. We also enter transactions that further optimize the economic benefits of our overall portfolio.\nA portion of our hedging strategy may be implemented using fuel products based on assumed correlations between power and fuel prices. Our risk management group monitors the financial risks of the wholesale and retail power marketing activities. We also use financial and commodity contracts for proprietary trading purposes, but this activity accounts for only a small portion of our efforts and is not material to our results. The proprietary trading portfolio is subject to a risk management policy that includes stringent risk management limits. See ITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK for additional information.\nThe cycle of production and utilization of nuclear fuel includes the mining and milling of uranium ore into uranium concentrates, the conversion of uranium concentrates to uranium hexafluoride, the enrichment of the uranium hexafluoride, and the fabrication of fuel assemblies. Nuclear fuel is obtained predominantly through long-term contracts for uranium concentrates, conversion services, enrichment services, (or a combination thereof) and fabrication services, including contracts sourced from Russia. We have inventory in various forms and engage a diverse set of domestic and international suppliers to secure the nuclear fuel needed to continue to operate our \n15\nTable of Contents\nnuclear fleet. We manage various risks around our nuclear fuel requirements in accordance with our fuel procurement policy limiting our transactions with each supplier to mitigate concentration of risk. The size of our inventory holdings and forward contractual coverage considers our refueling needs across multiple years to protect against supply disruptions and near-term price volatility, while allowing for capital flexibility. Our fuel procurement activities comply with all U.S. and international trade laws and we continue to take advantage of all available avenues to ensure continuity in our nuclear fuel supply, including working with the U.S. Government and our diverse set of suppliers to secure the nuclear fuel needed to continue to operate our nuclear fleet long-term. See ITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK for additional information.\nNatural gas is procured through long-term and short-term contracts, as well as spot-market purchases. Fuel oil inventories are managed so that in the winter months sufficient volumes of fuel are available in the event of extreme weather conditions and during the remaining months to take advantage of favorable market pricing. \nSee ITEM 1A. RISK FACTORS, ITEM 7. MANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS, Critical Accounting Policies and Estimates and Note 15 — Derivative Financial Instruments of the Combined Notes to Consolidated Financial Statements for additional information regarding derivative financial instruments.\nSeasonality \nOur operations are affected by weather, which affects demand for electricity and natural gas. The market price for electricity is also affected by changes in the demand for electricity and the available supply of electricity.  With respect to the electric business, very warm weather in summer months and, with respect to the electric and natural gas businesses, very cold weather in winter months is generally referred to as “favorable weather conditions” because those weather conditions result in increased deliveries of electricity and natural gas. Conversely, mild weather reduces demand. As a result, our operating results in the future may fluctuate substantially on a seasonal basis, especially when more severe weather conditions such as heat waves or extreme winter weather make such fluctuations more pronounced. The pattern of this fluctuation may change depending on the type and location of the facilities owned, the wholesale and retail load served and the terms of contracts to purchase or sell electricity. See ITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK for additional information.\nWeather can also impact our operating conditions. See ITEM 1A RISK FACTORS for additional information regarding risks related to operational factors. To mitigate the potential for weather to impact our operations, we conduct seasonal readiness reviews at our power plants to ensure availability of fuel supplies and equipment performance before entering the summer and winter seasons.  We also consider and review national climate assessments to inform our longer-term planning. Our nuclear fleet is resilient to weather extremes and is capable of generating emissions-free electricity 24 hours a day, even during unexpectedly cold winter events and hot summer events.\nInsurance\nWe are subject to liability, property damage, and other risks associated with major incidents at our generating stations. We have reduced our financial exposure to these risks through insurance, both property damage and liability, and other industry risk-sharing provisions. We also maintain business interruption insurance for certain of our renewable assets, but not for our other generating stations unless required by contract or financing agreements. We are self-insured to the extent that any losses may exceed the amount of insurance maintained or are within the policy deductible for our insured losses. \nSee Note 18 — Commitments and Contingencies of the Combined Notes to Consolidated Financial Statements for insurance specific to our nuclear facilities.\nRegulation\nCEG Parent's subsidiaries include public utilities as defined under the Federal Power Act that are subject to FERC’s exclusive ratemaking jurisdiction over wholesale sales of electricity and the transmission of electricity in interstate commerce. Under the Federal Power Act, FERC has the authority to grant or deny market-based rates for sales of energy, capacity, and ancillary services to ensure that such sales are just and reasonable. FERC’s \n16\nTable of Contents\njurisdiction over ratemaking includes the authority to suspend the market-based rates of utilities and set cost-based rates should FERC find that its previous grant of market-based rates authority is no longer just and reasonable. Other matters subject to FERC jurisdiction include, but are not limited to, certain third-party financings; review of certain mergers involving public utilities; certain dispositions of jurisdictional facilities and acquisitions of securities of another public utility or an existing operational generating facility; certain affiliate transactions; certain intercompany financings and cash management arrangements; certain internal corporate reorganizations; and certain holding company acquisitions of public utility and holding company securities.\nRTOs and ISOs are FERC-regulated entities that exist in several regions to provide transmission service across multiple transmission systems. FERC has approved PJM, MISO, ISO-NE, and SPP as RTOs and CAISO and NYISO as ISOs. These entities are responsible for regional planning, managing transmission congestion, developing wholesale markets for energy and capacity, maintaining reliability, market monitoring, and the scheduling of physical power transactions in the region. ERCOT is not subject to regulation by FERC but performs a similar function in Texas to that performed by RTOs and ISOs in markets regulated by FERC.\nWe are subject to the jurisdiction of the NRC with respect to the operation of our nuclear generating facilities, including the licensing for operation of each unit. The NRC subjects nuclear generating stations to continuing review and regulation covering, among other things, operations, maintenance, emergency planning, security, and environmental and radiological aspects of those stations. As part of its Reactor Oversight Process, the NRC continuously assesses unit performance indicators and inspection results and communicates its assessment on a semi-annual basis. The NRC may modify, suspend, or revoke operating licenses and impose violations and/or civil penalties for failure to comply with the Atomic Energy Act, NRC regulations, or the terms of the operating licenses or orders. Changes in requirements by the NRC may require a substantial increase in capital expenditures and/or operating costs for our nuclear generating facilities. NRC regulations also require that licensees of nuclear generating facilities demonstrate reasonable assurance that funds will be available in specified minimum amounts at the end of the life of the facility to decommission the facility. We meet the ultimate decommissioning funding obligation through the use of dedicated NDT funds. See ITEM 7. MANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS \n— \nLiquidity and Capital Resources; Critical Accounting Policies and Estimates \n— \nNuclear Decommissioning Asset Retirement Obligations; and Note 10 — Asset Retirement Obligations and Note 17 — Fair Value of Financial Assets and Liabilities of the Combined Notes to Consolidated Financial statements for additional information regarding our NDT funds and decommissioning obligations.\nOur operations are also subject to the jurisdiction of various other federal, state, regional, and local agencies, and federal and state environmental protection agencies. Additionally, we are subject to NERC mandatory reliability standards, which protect the nation’s bulk power system against potential disruptions from cyber and physical security breaches.\nConstellation's Strategy and Outlook\nStrategy\nWe believe shareholder value is built on a foundation of operational excellence and the pairing of our majority carbon-free energy fleet with our customer-facing platform. We are committed to maintaining investment grade credit ratings. We focus on optimizing cash returns through a disciplined approach to safe and efficient operations and cost management, underpinned by stable and durable margins from our customer-facing business and coupled with distinct payments to our generation plants for the clean energy attributes. We may pursue future growth opportunities that provide additional value building on our core businesses, or expanding our competitive advantages. We are committed to maintaining a strong balance sheet, returning value to our shareholders, and investing in energy and sustainable solutions to meet customer needs. \nThe demand for reliable, carbon-free energy and sustainability solutions continues to grow across the country. We are committed to a clean energy future and aim to meet the growing energy needs of all our customers. We continue to serve as a partner to businesses and public entities that are setting ambitious sustainability goals and seeking long-term solutions to ensure reliability and maintain affordability. \nThe principles of our business strategy demonstrate our commitment to a carbon-free future while maintaining a strong balance sheet, advancing our sustainability and community initiatives, and investing in clean energy solutions:\n17\nTable of Contents\n•\nPower America's Clean Energy Future\n•\nExpand America's Largest Fleet of Clean Energy Centers\n•\nUplift and Strengthen our Communities\n•\nProvide Energy and Sustainability Solutions for Customers\nWe are committed to maintaining sufficient financial liquidity and an appropriate capital structure to support safe, secure and reliable operations, even in volatile market conditions. We believe our investment grade credit rating is a competitive advantage and we intend to maintain our credit position and best-in-class balance sheet. In line with that commitment, available cash flow will first be used to meet investment grade credit targets, with incremental capital allocated towards disciplined growth and shareholder return. We will build upon a strong compliance and risk management foundation and recognize the critical role this serves in maximizing operational results. We will continue to manage cash flow volatility through prudent risk management strategies across our business.\nGrowth Opportunities. \nWe continually evaluate growth opportunities aligned with our businesses, assets, and markets leveraging our expertise in those areas and offering durable returns. We may pursue growth opportunities that optimize our core business or expand upon our strengths, including, but not limited to the following:\n•\nOpportunistic energy acquisitions with a focus on reliability,\n•\nCreate new value from the existing fleet through nuclear uprates and license extensions, repowering of renewables, co-location of data centers, production of clean hydrogen, and other opportunities,\n•\nGrow sustainability solutions for our customers focused on clean energy, efficiency, storage and electrification; help our C&I customers develop and meet sustainability targets,\n•\nEngagement with the technology and innovation ecosystem through continued partnerships with national labs, universities, startups, and research institutions, and\n•\nContinue to monitor opportunities to participate in advanced nuclear to maintain our leadership position as stewards of a carbon-free energy future.\nWe will employ a disciplined approach to acquisitions that grow future cash flow and support strategic initiatives. In further pursuit of our strategy, on January 10, 2025 we announced an agreement to acquire Calpine Corporation (Calpine), a combination that would couple the largest producer of clean, carbon-free energy with the reliable, dispatchable natural gas assets of Calpine, and also create the nation’s leading competitive retail electric supplier, providing increased scale, diversification and complementary capabilities that will enable us to meet growing demand with a broader array of energy and sustainability products. See Note 2 — Mergers, Acquisitions, and Dispositions of the Combined Notes to Consolidated Financial Statements for additional information on the proposed transaction.\nVarious market, financial, regulatory, legislative and operational factors could affect our success in pursuing these strategies.  We continue to assess infrastructure, operational, policy, and legal solutions to these issues.  See ITEM 1A. RISK FACTORS for additional information.\nOutlook\nThe U.S. energy sector is experiencing unprecedented changes that we believe will increase the demand for reliable, clean power generation and benefit our business. We believe our generation fleet, including our nuclear assets, is well-positioned to deliver reliable and carbon-free power and benefit from growing demand for such electricity. Key drivers of increased demand include:\n•\nGovernmental and corporate policies designed to accelerate the decarbonization of the economy, \n•\nPolicy support for nuclear energy sources that also enable energy security, reliability and diversification,\n•\nNew technologies requiring reliable energy, and \n18\nTable of Contents\n•\nEvolving customer preferences favoring clean energy, choice and digitization. \nPolicy Support for Decarbonization and Emerging Carbon-Free Technologies.\n Many governments, corporations, and investors have been advocating for the reduction of GHG emissions across all sectors of the economy, with reduction of GHG emissions by the energy sector being a key focus. These include state mandates requiring increasingly stringent policies that require the reduction of GHG emissions over time. For example, many large corporations have adopted targets to reduce the carbon emissions in their business operations, spurred in part by demand from investors and customers for sustainable, environment-friendly business practices. These governmental and corporate policies support the retention and expansion of carbon-free generation and developments in emerging technologies like advanced nuclear power, carbon capture and sequestration, energy storage, advanced geothermal and hydrogen. We are focused on a clean energy future and we believe our business is well-positioned to benefit from policy support for decarbonization as our generation fleet is essential to helping meet sustainability goals.\nPolicy Support for Nuclear Energy. \nWe expect our generation fleet will continue to play a critical role in meeting baseload power needs. Nuclear energy is currently the largest source of zero-emissions electricity in the U.S., accounting for over 50% of the nation’s carbon-free power and our nuclear plants are meaningful contributors to the clean energy mix in the states in which they operate. Through enactment of the nuclear PTC in the IRA, federal policymakers have recognized the need to ensure the continued operation of the nation’s nuclear power plants. Actions taken by states recognize that existing nuclear generation facilities are essential to meeting their policy objectives to reduce GHG emissions, with three states currently considering bills to add nuclear energy to clean energy targets and four states, including Connecticut, Michigan, North Carolina and Tennessee, finalizing such legislation since 2023. In addition, nuclear energy generation supports jobs and regional economies, and helps to ensure reliability and security of the electrical grid. As such, we plan to file applications to extend the licenses of our nuclear fleet to 80 years for our units that receive continued policy support for their long-term operation.\nNew Technologies Requiring Reliable Energy. \nMany news reports indicate the rapid expansion of data centers and the need for increased energy supply to meet future demand. Significant planned investments from hyperscalers such as Microsoft, Google, and Amazon in artificial intelligence (AI) technology and infrastructure are further contributing to unprecedented demand for reliable, around-the-clock energy in the U.S and abroad. According to the DOE, data centers are one of the most energy-intensive building types, consuming 10 to 50 times the energy per floor space of a typical commercial office building. Efforts to reduce GHG emissions could lead to further electrification of the U.S. economy, including electrification of transportation, industrial operations, heating and cooling, and appliances, which could materially increase demand for electricity. For companies like us whose core competency is safely generating and serving electricity and related products to our customers, the increasing demand provides natural growth opportunities.\nEvolving Customer Preferences. \nConsumers are increasingly purpose-driven and knowledgeable of services that drive decarbonization, leading them to value the ability to be connected to and trace the source of their clean energy choices. Growing awareness of climate change and green energy helps drive customer interest in value-add services and products around their energy usage, such as solar, behind-the-meter storage, EV charging, and the ability to choose 100 percent clean power 24 hours a day, 365 days a year in competitive retail energy markets. Continuing innovation in the digitization of the broader economy will facilitate greater control and opportunities for customers and businesses to more frequently engage with their energy providers and become more knowledgeable of their energy choices, including the products and solutions we provide.\nEnvironmental Matters and Regulation\nWe are subject to comprehensive and complex environmental legislation and regulation at the federal, state, and local levels, including requirements relating to climate change, air and water quality, solid and hazardous waste, and impacts on species and habitats.\nOur Board of Directors is responsible for overseeing the management of environmental matters. We have a management team to address environmental compliance and strategy, including the CEO, and other members of senior management. Performance of those individuals directly involved in environmental compliance and strategy is reviewed and affects compensation as part of the annual individual performance review process. Our Board of Directors has delegated to its Nuclear Oversight Committee and the Corporate Governance Committee the authority to oversee our compliance with health, environmental, and safety laws and regulations and its \n19\nTable of Contents\nstrategies and efforts to protect and improve the quality of the environment, including our internal climate change and sustainability policies and programs, as discussed in further detail below. \nClimate \nMany governments, corporations, and investors have advocated for the reduction of GHG emissions across all sectors of the economy, with reduction of GHG emissions by the energy sector being a key focus. These include state mandates requiring increasingly stringent policies that require the reduction of GHG emissions over time. For example, many large corporations have adopted targets to reduce the carbon emissions in their business operations, spurred in part by demand from investors and customers for sustainable, environment-friendly business practices. Emerging technologies like battery storage, carbon capture and sequestration, and clean hydrogen production are also helping to advance decarbonization.\nWe believe our business is well-positioned to benefit from policy for decarbonization. However, we also face climate mitigation and transition risks as well as adaptation risks. Mitigation and transition risks include changes to the energy systems as a result of new technologies, changing customer expectations, and/or voluntary GHG reduction goals, as well as local, state, or federal regulatory requirements intended to reduce GHG emissions. Adaptation risk refers to risks to our facilities or operations that may result from changes in the physical climate, such as changes to temperatures, weather patterns, and sea level rise. See ITEM 1A. RISK FACTORS for additional information.\nGHG Mitigation and Transition\nWe currently are subject to, and may become subject to additional, federal and/or state legislation and/or regulations addressing GHG emissions. We are deliberately positioned as a low-carbon generation company. We have minimized GHG emitting assets in our portfolio and maximized carbon-free electric production. Our Scope 1 and 2 market-based GHG emissions in 2023 were 10 million metric tons carbon dioxide equivalent, of which 9.3 million metric tons were from our natural gas and oil-fueled generation fleet, significantly less than our peers with similar volume of power generation. Even with our proposed acquisition of Calpine, we would continue to have the lowest carbon intensity of any large generator in the U.S.\nWe produce electricity predominantly from low and carbon-free generating facilities (such as nuclear, hydroelectric, natural gas, wind, and solar) and neither own nor operate any coal-fueled generating assets. Our natural gas and oil generating plants produce some GHG emissions, most notably CO2. We have made investments in developing carbon capture technologies to reduce GHG emissions from carbon emitting generating plants. In addition, we sell natural gas through our customer-facing business; and consumers’ use of such natural gas produces GHG emissions. However, our owned-asset emission intensity, or rate of carbon dioxide equivalent (CO2e) emitted per unit of electricity generated, is among the lowest in the industry. In 2024, we achieved a 94.6% percent capacity factor across our nuclear fleet and our ownership of 22 GWs of carbon-free generation capacity at 25 nuclear units produced 182 TWhs of electricity in 2024.  \nThe electric sector plays a key role in lowering GHG emissions across the rest of the economy. Electriﬁcation of other sectors such as transportation and buildings coupled with simultaneous decarbonization of electric generation is a key lever for emissions reductions. To support this transition, we are advocating for public policy supportive of vehicle electrification, investing in enabling infrastructure and technology, and supporting customer education and adoption. We also continue to explore other decarbonization opportunities, supporting pilots of emerging energy technologies and development of clean fuels.\nInternational Climate Agreements.  \nAt the international level, the United States is a party to the United Nations Framework Convention on Climate Change (UNFCCC). The Parties to the UNFCCC adopted the Paris Agreement at the 21st session of the UNFCCC Conference of the Parties (COP 21) in December 2015. Under the Agreement, which became effective in November 2016, the parties committed to limit the global average temperature increase and to develop national GHG reduction commitments. The United States has set an economy-wide target of reducing its net GHG emissions by 50-52% below 2005 levels by 2030. UNFCC Conference of Parties (COP) sessions occur annually and we monitor developments in these international meetings for their impact on the U.S. energy policy. In January 2025, President Trump issued an executive order to withdraw the United States from the Paris Agreement.\n20\nTable of Contents\nFederal Climate Policy.\n The reelection of President Donald Trump has altered the landscape of federal climate policy.  In the short time since his inauguration, President Trump has taken several actions that pare back climate and sustainability initiatives from prior administrations and called for the repeal of several Biden-era energy tax-support and related initiatives. It is not yet clear what impact, if any, these actions may have on us. President Trump has also emphasized the importance of reliable, affordable electricity to grow the economy and protect national security, and has specifically cited nuclear energy as an important technology. \nRegulation of GHGs from Power Plants under the Clean Air Act.\n In April 2024, EPA issued a final rule that regulates greenhouse gases from existing coal, new natural gas-fired power plants, and existing oil/gas steam generators under Clean Air Act section 111. The applicable standards are subcategorized by retirement date for existing coal and capacity factor for existing gas. We are evaluating market impacts of this rule, which will be affected by upcoming state implementation and ongoing litigation. EPA has solicited comment on approaches for regulating GHGs from existing gas plants in a docket that closed in May 2024. In October 2024, the U.S. Supreme Court rejected a request to temporarily block implementation of EPA's GHG standards for existing coal, new gas, and existing oil/gas steam generators. The rule is currently being litigated in the DC Circuit. Under the Unleashing American Energy Executive Order, issued on January 20, 2025, agencies are directed to revisit regulations that “impose an undue burden” on the use of domestic energy resources, including coal, natural gas, and oil. In February 2025, EPA filed a motion to hold the D.C. Circuit litigation in abeyance.\nState Climate Legislation and Regulation.\n Many states in which we operate have state and regional programs to reduce GHG emissions and renewable and other portfolio standards, which impact the power sector and other sectors as well. 25 states and the District of Columbia have 100% clean energy targets, deep GHG reductions, or both, encompassing 55% of U.S. residential electricity customers. See discussion below for additional information on renewable and other portfolio standards. As the nation’s largest generator of carbon-free electricity, our fleet supports these efforts to produce safe, reliable electricity with minimal GHGs.  \nIn 2019, New York enacted the Climate Leadership and Community Protection Act, which commits the state to achieving net-zero emissions by 2050, with interim emission reduction and renewable energy requirements in 2030 and 2040. New Jersey’s Energy Master Plan provides a comprehensive roadmap for achieving the state’s goal of a 100% clean energy economy by 2050. The state's Global Warming Response Act stated GHG emissions reductions of 80% below 2006 levels by 2050 which was subsequently accelerated by Executive Order 315 targeting 100% clean energy by 2035. In September 2021, Illinois Public Act 102-0662 was signed into law by the Governor of Illinois. The Clean Energy Law is designed to achieve 100% carbon-free power by 2045 to enable the state’s transition to a clean energy economy. The Clean Energy Law establishes decarbonization requirements for Illinois as well as programs to support the retention and development of emissions-free sources of electricity.\nOur nuclear plants are meaningful contributors to the clean energy mix in the states in which they operate. States may not be able to meet their zero-carbon goals without our nuclear plants, as our plants provide a significant portion of the current carbon-free power. Several states in which our nuclear facilities operate have established policies to support nuclear generation. The supportive policies are driven by several factors, including recognition by governments and policy makers that existing nuclear generation facilities are essential to meeting policy objectives on reduction of GHG emissions, the desire to support jobs and regional economies, and the need to ensure reliability and security of the electrical grid through resource diversity. These state-specific policies preserve the environmental attributes of our nuclear facilities, and include the following:\nPolicy Name\nYear Enacted\nNuclear Facilities Impacted\nType of Program\nYear of Expiration\nNew York Clean Energy Standard\n2016\nFitzPatrick, Ginna, and NMP\nZEC\n2029\nIllinois Zero Emission Standard\n2016\nClinton and Quad Cities\nZEC\n2027\nNew Jersey Clean Energy Legislation\n2018\nSalem\nZEC\n2025\n(a)\nIllinois Clean Energy Law\n2021\nByron, Braidwood, and Dresden\nCMC\n2027\n__________\n(a)\nThe New Jersey Clean Energy Legislation program ends May 2025.\n21\nTable of Contents\nRegional Greenhouse Gas Initiative (RGGI).\n The RGGI program requires most fossil fuel-fired power plants in the region to hold allowances, sold at auction or on the secondary market, for each ton of CO2 emissions. Non-emitting resources do not have to purchase or hold these allowances. The following states are currently participants in RGGI; Connecticut, Delaware, Maine, Maryland, Massachusetts, New Hampshire, New Jersey, New York, Rhode Island, and Vermont. Pennsylvania’s participation in RGGI is currently being litigated at the Pennsylvania Supreme Court.\nRenewable and Clean Energy Standards.\n \nAccording to the U.S. Energy Information Administration, 35 states and the District of Columbia, including most of the states where we operate, have adopted some form of renewable or clean energy procurement requirement. Of these 35 states, seven states have non-enforceable renewable energy goals. These standards impose varying levels of mandates for procurement of renewable or clean electricity (the definition of which varies by state) and/or energy efficiency. These are generally expressed as a percentage of annual electric load, often increasing by year. Load serving entities comply with these various requirements through purchasing qualifying renewables, acquiring sufficient certificates (e.g., RECs), paying an alternative compliance payment, and/or a combination of these compliance alternatives.\nWhile we cannot predict the nature of future regulations or how such regulations might impact future financial statements, we have a low-emission portfolio and GHG restrictions would likely benefit our zero- and low-emission generating units relative to other higher-emission fossil fuel-fired generating units.\nCorporate Clean Energy Targets.\n \nCorporations are facing increasing pressure from their customers and investors to align their businesses with environmental and sustainability objectives, including supporting goals to reduce GHG emissions in their business operations. Leading institutional investors and money managers are increasingly considering sustainability as a key factor in investment decisions and are increasingly advocating for more transparency in disclosure on climate-related matters and pledging to align proxy voting to climate-rated proposals with its fiduciary duty. An increasing number of corporations are also proactively making commitments to reducing their GHG emissions footprint, either through procuring increasing amounts of clean energy, such as RECs, EFECs, or emissions offsets, to offset their carbon footprint over time. The execution of the PPA with Microsoft that will support the restart of Crane is a recent example. As the nation’s largest producer of carbon-free energy, we support addressing climate concerns and continue leadership in both emerging technologies and existing clean infrastructure that together will power the future. \nEmerging Clean Technologies. \nThe need for new clean, reliable sources of power that can scale, decarbonize the system, and meet new load requirements is leading to rapid advancements in emerging technologies like advanced nuclear power, carbon capture and sequestration, energy storage, advanced geothermal and hydrogen. The improvements in advanced nuclear including Small Modular Reactors (SMR), growing state and federal support, and the potential to rapidly reduce costs with scaled deployment create a potential path to market for new nuclear within the next decade. Carbon capture and sequestration is similarly experiencing substantial investment and a heightened focus that could impact deployment earlier within the next decade. On a nearer term time horizon, it is expected that energy storage will continue to see high levels of investment driven by lower costs, state-directed mandates, a backlog of storage projects in the interconnection queue, and utilities seeking large-scale storage capacity to support higher renewables penetration, and innovations in battery chemistries and technologies. Advanced geothermal and clean hydrogen have similar opportunities to scale supply with early deployments de-risking the technologies. Clean hydrogen, in particular, has the potential to drive decarbonization downstream across hard to decarbonize demand sectors, like long-haul transportation, steel, chemicals, heating, agriculture, and long-term power storage. Nuclear power can be used to produce clean hydrogen, and our nuclear fleet positions us well to explore this emerging space. Collectively, advanced nuclear, carbon sequestration, energy storage, geothermal, and clean hydrogen are expected to help support carbon reduction goals.\nOther Environmental Regulation\nAir Quality\nGood Neighbor Rule. \nIn June 2023, the EPA published a final rule called “Federal 'Good Neighbor Plan' for the 2015 Ozone National Ambient Air Quality Standards” also known as the \"Transport Rule\". The rule, among other things, establishes nitrogen oxides emissions budgets requiring fossil fuel-fired power plants in 23 states to participate in an allowance-based ozone season trading program beginning in 2023. In February 2023, EPA disapproved state implementation plans submitted by 21 states for failure to address their obligations under the \n22\nTable of Contents\n\"good neighbor\" provisions of the Clean Air Act. However, several Regional Courts of Appeals issued orders staying, pending judicial review, EPA's disapproval of several state plans (including Texas). In June 2024, the Supreme Court stayed EPA's rule for the duration of the litigation. In November 2024, the EPA issued an administrative stay of the rule. The rule is currently under review on the merits before the D.C. Circuit. In February 2025, EPA filed a motion to hold the D.C. Circuit litigation in abeyance.\nWater Quality\nUnder the federal Clean Water Act, NPDES permits for discharges into waterways are required to be obtained from the EPA or from the state environmental agency to which the permit program has been delegated, and permits must be renewed periodically. Certain of our facilities discharge water into waterways and are therefore, subject to these regulations and operate under NPDES permits.\nClean Water Act Section 316(b) is implemented through the NDPES program and requires that the cooling water intake structures at facilities that withdraw more than 2 million gallons of water per day for cooling reflect the best technology available to minimize adverse environmental impacts. Our power generation facilities with cooling water intake systems are subject to the EPA’s Section 316(b) regulations finalized in 2014; the regulation’s requirements have been or will be addressed through renewal of these facilities’ NPDES permits. We have completed all required studies and have submitted recommendations for compliance as part of the NPDES/SPDES renewal process. We have submitted the NPDES/SPDES renewal timely for all our owned and operated nuclear stations. Six of the twelve stations we operate and STP have been deemed compliant with the 316(b) rule using existing technology. Until the compliance requirements are determined by the applicable state permitting director for each of the six remaining nuclear stations, on a site-specific basis for each plant, we cannot estimate the effect that compliance with the EPA’s 2014 rule will have on the operation of our generating facilities and our consolidated financial statements. As a result, in some instances, such as Peach Bottom, the permit expiration dates have lapsed and have been administratively extended. Should a state permitting director determine that a facility must install cooling towers to comply with the rule, that facility’s economic viability could be called into question. However, the final rule does not mandate cooling towers and allows state permitting directors to require alternative, less costly technologies and/or operational measures, based on a site-specific assessment of the feasibility, costs, and benefits of available options. There is no regulatory established timeline for NPDES permit renewals.\nIn July 2016, the NJDEP issued a final permit for Salem requiring 316(b) studies and deferring the Agency's selection of a final compliance technology. The permit allows Salem to continue to operate utilizing the existing cooling water intake system with certain required modifications. However, the permit is being challenged by an environmental organization, and if successful, could result in additional costs for Clean Water Act compliance. Potential cooling water system modification costs could be material and could adversely impact the economic competitiveness of this facility.\nUnder Clean Water Act Section 404 and state laws and regulations, we may be required to obtain permits for projects involving dredge or fill activities in Waters of the United States.\nOur hydroelectric and nuclear facilities are required to secure a federal license or permit for activities that may result in a discharge to covered waters. We are required to obtain a state water quality certification for those facilities under Clean Water Act section 401. See Note 3 — Regulatory Matters of the Combined Notes to Consolidated Financial Statements for additional information on the status of the 401 Certification from MDE for Conowingo.\nWe are also subject to the jurisdiction of the Delaware River Basin Commission and the Susquehanna River Basin Commission, regional agencies that primarily regulate water usage.\nSolid and Hazardous Waste and Environmental Remediation\nCERCLA authorizes response to releases or threatened releases of hazardous substances into the environment. CERCLA authorities complement those of the RCRA, which primarily regulates ongoing hazardous waste handling and disposal. Under CERCLA, generators and transporters of hazardous substances, as well as past and present owners and operators of hazardous waste sites, are strictly, jointly and severally liable for the cleanup costs of hazardous substances at sites, many of which are listed by the EPA on the National Priorities List. These PRPs can be ordered to perform a cleanup, can be sued for costs associated with an EPA-directed \n23\nTable of Contents\ncleanup, may voluntarily settle with the EPA concerning their liability for cleanup costs, or may voluntarily begin a site investigation and site remediation under state oversight. Most states have also enacted statutes that contain provisions substantially like CERCLA. Such statutes apply in many states where we currently own or operate, or previously owned or operated facilities. In addition, RCRA governs treatment, storage, and disposal of solid and hazardous waste and cleanup of sites where such activities were conducted.\nOur operations have in the past, and may in the future, require substantial expenditures to comply with these federal and state environmental laws. Under these laws, we may be liable for the costs of remediating environmental contamination of property now or formerly owned by us and of property contaminated by hazardous substances generated or transported by us. We own or lease several real estate parcels, including parcels on which our operations or the operations of others may have resulted in contamination by substances that are considered hazardous under environmental laws. We are, or could become in the future, parties to proceedings initiated by the EPA, state agencies, and/or other responsible parties under CERCLA and RCRA or similar state laws with respect to several sites, or may undertake to investigate and remediate sites for which we may be subject to enforcement actions by an agency or third party.\nWe have established appropriate contingent liabilities for environmental remediation requirements. In addition, we may be required to make significant additional expenditures not presently determinable for other environmental remediation costs. See Note 18 — Commitments and Contingencies of the Combined Notes to Consolidated Financial Statements for additional information regarding our environmental matters, remediation efforts, and related impacts to our consolidated financial statements.\nNuclear Waste Storage and Disposal\nThere are no facilities for the reprocessing or permanent disposal of SNF currently in operation in the United States, nor has the NRC licensed any such facilities. We currently store all SNF generated by our nuclear generating facilities on-site in storage pools or in dry cask storage facilities. Since our SNF storage pools generally do not have sufficient storage capacity for the life of the respective plant, we have developed dry cask storage facilities to support operations.\nAs of December 31, 2024, we had approximately 95,800\n \nSNF assemblies (23,400 tons) stored on-site in SNF pools or dry cask storage. All our nuclear sites have on-site dry cask storage. On-site dry cask storage in concert with on-site storage pools can meet all current and future SNF storage requirements at each of our sites, including Crane, for the duration of both current and subsequent license periods of all stations and through decommissioning. For a discussion of matters associated with our contracts with the DOE for the disposal of SNF, see Note 18 — Commitments and Contingencies of the Combined Notes to Consolidated Financial Statements.\nAs a by-product of their operations, nuclear generating units produce LLRW. LLRW is accumulated at each generating station and permanently disposed of at licensed disposal facilities. The Federal Low-Level Radioactive Waste Policy Act of 1980 provides that states may enter agreements to provide regional disposal facilities for LLRW and restrict use of those facilities to waste generated within the region. Illinois and Kentucky have entered into such an agreement, although neither state currently has an operational site, and none is anticipated to be operational for the next ten years. We ship our Class A LLRW, which represents 93% of LLRW generated at our stations, to disposal facilities in Utah and South Carolina, which have enough storage capacity to store all Class A LLRW for the duration of both current and subsequent license periods for all the stations in our nuclear fleet. The disposal facility in South Carolina at present is only receiving LLRW from LLRW generators in South Carolina, New Jersey (which includes Salem), and Connecticut.\nWe utilize on-site storage capacity at all our stations to store and stage for shipping Class B and Class C LLRW. We have a contract through 2040 to ship Class B and Class C LLRW to a disposal facility in Texas. The agreement provides for disposal of all Class B and Class C LLRW currently stored at each station as well as the Class B and Class C LLRW generated during the term of the agreement. However, because the production of LLRW from our nuclear fleet will exceed the capacity at the Texas site (3.9 million curies through 2027, with applications submitted by the facility for a 10-year extension and an increase in storage capacity), we will still be required to utilize on-site storage at our stations for Class B and Class C LLRW. We currently have enough storage capacity to store all Class B and Class C LLRW for the duration of both current and subsequent license periods for of all the stations in our nuclear fleet and, we continue to pursue alternative disposal strategies for LLRW, including an LLRW reduction program to minimize on-site storage and cost impacts.\n24\nTable of Contents\nEmployees\nEngaged Workforce\nOur employees are our greatest strength. We strive to create a workplace that is inclusive, innovative, and safe for our employees. In order to provide the services and products that our customers expect, we focus on creating the best teams to foster teamwork, mutual respect and the empowerment of employees to be their authentic selves. We strive to attract highly qualified talent and review our hiring, development and promotion practices to maintain equal opportunity and non-discriminatory processes. \nWe develop our future highly skilled workforce by focusing on three main areas: (1) elevating career awareness by promoting STEM and energy career pathways; (2) fostering equal opportunities for all individuals; and (3) advancing the skills of workers by investing in training, reskilling, and upskilling programs.\nWe conducted an employee engagement survey during 2024 to gain insight into engagement and job satisfaction within our workforce. We will use this and future surveys to help identify our successes and opportunities for growth. The survey results are shared with leaders at all levels and they are also part of action planning to increase engagement. A robust action planning process is implemented that integrates both centralized action for organization-wide issues and leader-led action for areas unique to their own work groups and/or business areas.\nCareer Development\nWe strive to prepare our workforce for the future and help our employees develop competencies to progress in their careers. We work to continuously enhance the knowledge and skills of our workforce through formal assessments, feedback, coaching, mentoring, training, leadership development programs and development programs.\nWell-Being and Benefits\nWe help our employees maintain and improve their overall well-being, and we offer a wide range of benefits that support physical, mental, financial, and family health. Our comprehensive benefits help our employees care for themselves and their families, now and in the future.\nCommunity\nWe actively invest in community development through philanthropic giving and employee volunteerism. We work to build a future in which all our employees, customers, business associates and communities benefit from social, environmental and economic progress. We provide opportunities for company-sponsored volunteerism and charitable matching gifts programs. Our employees donated more than $5.3 million to non-profit organizations of their choice and provided more than 116,500 volunteer service hours in 2024.\nNext Generation of Talent\nWe aim to attract, retain and advance a world-class workforce that effectively serves our customers and communities. We work toward this objective by sourcing from and developing a broad talent pipeline and cultivating an inclusive and respectful culture where all individuals can develop to reach their full potential. In 2024, we hired over 1,400 employees.\nThrough our talent acquisition strategy, we work with universities and organizations to attract and recruit STEM-focused students and professionals. Through these collaborations, we participate in mentoring programs, conferences, career fairs and industry events to identify highly skilled talent who may be interested in applying for employment. \nWorkforce\nWe provide training and review hiring and promotion processes and perform pay equity analyses. These actions help to create an environment where all employees can thrive and advance based on merit.\n25\nTable of Contents\nThe following table shows total number of employees, management, and executives as of December 31, 2024: \nMetric\nAll Employees\nFull-Time\n14,215 \nPart-Time\n49 \nTotal Employees\n14,264 \nMetric\nAll Employees\nRegular\n(a)\n14,219 \nTemporary\n(b)\n45 \nTotal Employees\n14,264 \n__________\n(a)\nRegular employees hold a position where employment is for an indeterminate period and the position is expected to continue on an ongoing basis.\n(b)\nTemporary employees hold a position (with or without a contract) for a limited period with an expected end date, typically based on completion of a specific assignment, project, or event.\nTurnover Rates\nAs turnover is inherent, management succession planning is performed and tracked for executives enterprise-wide. Management frequently reviews succession planning to be prepared when positions become available.\nThe table below shows the turnover rate for regular employees for the year ended December 31, 2024:\nInvoluntary Termination\n1.50 \n%\nRetirement\n(a)\n2.40 \n%\nVoluntary Resignation\n3.50 \n%\n__________\n(a)\nFor reporting purposes, reflects employees who were at least 55 years of age and had at least 10 years of service at the time they ended employment.\nCollective Bargaining Agreements\nApproximately 25% of all employees participate in CBAs. The following table presents employee information, including information about CBAs, as of December 31, 2024:\nTotal Employees Covered by CBAs\nTotal Number of CBAs\nNew and Renewed CBAs in 2024\n(a)\nTotal Employees Under New and Renewed CBAs in 2024\n3,333 \n21 \n8 \n726 \n__________\n(a)\nDoes not include CBAs that expired in 2024 but are operating under interim extension agreements while negotiations are ongoing for renewal.",
  "item7": "Item 7.\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\n(Dollars in millions, unless otherwise noted)\nExecutive Overview\nWe are a producer of carbon-free energy and a supplier of energy products and services. Our generating capacity includes primarily nuclear, wind, solar, natural gas, and hydroelectric assets. Through our integrated business operations, we sell electricity, natural gas, and other energy-related products and sustainable solutions to various types of customers, including distribution utilities, municipalities, cooperatives, and commercial, \n49\nTable of Contents\nindustrial, public sector, and residential customers in markets across multiple geographic regions. We have five reportable segments: Mid-Atlantic, Midwest, New York, ERCOT and Other Power Regions. The following Management’s Discussion and Analysis of Financial Condition and Results of Operations summarizes results for the year ended December 31, 2024 compared to the year ended December 31, 2023. For discussion of the year ended December 31, 2023 compared to the year ended December 31, 2022, refer to ITEM 7. MANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS in the 2023 Form 10-K, which was filed with the SEC on February 27, 2024.\nSignificant Transactions and Developments\nProposed Acquisition of Calpine Corporation\nOn January 10, 2025, we entered an agreement and plan of merger (Merger Agreement) with Calpine Corporation (Calpine) under which we will acquire all the outstanding equity interests of Calpine in a cash and stock transaction. Calpine owns and operates a generation fleet of natural gas, geothermal, battery storage, and solar assets with over 27 GWs of generation capacity, in addition to a competitive retail electric supplier platform serving approximately 2.5 million customers with 60 TWhs of load annually. \nThis acquisition is complementary to and aligns strategically with our existing business operations and provides both increased scale and meaningful market diversification. We will couple the largest producer of clean, carbon-free energy with the reliable, dispatchable natural gas assets of Calpine, and also create the nation’s leading competitive retail electric supplier, providing increased scale, diversification and complementary capabilities that will enable us to meet growing demand with a broader array of energy and sustainability products. The addition of Calpine will strengthen our essential role in providing clean, reliable, and affordable energy as the nation seeks to transition to a more sustainable future, and will better position us to pursue investments in new and existing technologies to meet growing demand. \nCompletion of the transaction is conditioned upon review of the transaction by the DOJ, and approval by the FERC, NYPSC, and PUCT, in addition to other regulatory bodies, and is also subject to other customary closing conditions. See Note 2 — Mergers, Acquisitions, and Dispositions of the Combined Notes to Consolidated Financial Statements for additional information.\nCrane Clean Energy Center\nDuring the third quarter of 2024, we executed a 20-year PPA with Microsoft that will support the restart of Three Mile Island Unit 1, renamed as the Crane Clean Energy Center, which was retired in 2019 for economic reasons. Under the agreement, Microsoft will purchase the output generated from the renewed plant as part of its goal to help power its data centers in PJM with clean energy. We expect Crane will also be eligible for the technology-neutral clean electricity PTC (45Y) provided for by the IRA for its first 10 years of operations. We estimate the project will require approximately $1.6 billion of cash from operations for capital expenditures necessary to restart the plant, with an estimated in-service date of 2028. The restart of the plant and delivery of electricity under the PPA is subject to certain regulatory approvals, including the NRC comprehensive safety and environmental review, as well as permits from relevant state and local agencies. Additionally, through a separate request, we will pursue obtaining a renewed license that will extend operations at the plant to at least 2054.\nNuclear PTC\nBeginning in 2024, our existing nuclear units are eligible for a PTC extending through 2032. The nuclear PTC (45U) provides a transferable credit up to $15 per MWh (a base credit of $3 per MWh with a five times multiplier provided certain prevailing wage requirements are met) and is subject to phase-out when annual gross receipts are between $25.00 per MWh and $43.75 per MWh. We have evaluated and expect to meet the annual prevailing wage requirements at all our nuclear units and are eligible for the five times multiplier. Both the amount of the PTC and the gross receipts thresholds adjust for inflation after 2024 through the duration of the program based on the GDP price deflator for the preceding calendar year. The benefits of the PTC may be realized through a credit against our federal income taxes or transferred via sale to an unrelated party. For the year ended December 31, 2024, our Consolidated Statements of Operations and Comprehensive Income include a nuclear PTC benefit of approximately $2,080 million in Operating revenues. See Note 6 — Government Assistance of the Combined Notes to Consolidated Financial Statements for additional information.\n50\nTable of Contents\nShare Repurchase Program\nAs part of our capital allocation plan, our Board of Directors has authorized up to $3 billion of share repurchases of our outstanding common stock to-date, of which $991 million has yet to be exercised. See Note 19 — Shareholders' Equity of the Combined Notes to Consolidated Financial Statements for additional information. \nOther Key Business Drivers \nRussia and Ukraine Conflict\nWe are closely monitoring developments of the ongoing Russia and Ukraine conflict, including United States, United Kingdom, European Union, and Canadian sanctions, and legislation that may impact exports and imports of Russian nuclear fuel supply and enrichment activities, as well as the potential for Russia to limit fuel deliveries. The U.S. “Prohibiting Russian Uranium Imports Act” became effective in August 2024, banning the import of low-enriched uranium into the U.S. that is produced in Russia or by Russian entities, absent a waiver from the DOE. Under a corollary bill, the Department of Energy has begun the process of distributing billions of dollars that were previously appropriated to support expansion of the domestic nuclear fuel cycle within the United States to improve carbon-free energy security. In November 2024, the Russian government issued a decree imposing temporary restrictions on the export of enriched uranium from Russia to the U.S. but allowing for a special Russian export license to be issued for individual shipments. Our nuclear fuel is obtained predominantly through long-term uranium supply and service contracts. We work with a diverse set of domestic and international suppliers years in advance to procure our nuclear fuel to support our refueling needs regardless of the risk to Russian nuclear fuel supply. Recognizing the potential for the continuing conflict to impact our longer-term security and cost of supply, we have entered into contracts to increase the size of our nuclear fuel inventory. Our fuel procurement activities comply with all U.S. and international trade laws and we continue to take advantage of all available avenues to maintain continuity in our nuclear fuel supply, including working with the U.S. Government and our diverse set of suppliers to secure the nuclear fuel needed to continue to operate our nuclear fleet long-term.\nCritical Accounting Policies and Estimates\nThe preparation of financial statements in conformity with GAAP requires that management apply accounting policies and make estimates and assumptions that affect results of operations and the amounts of assets and liabilities reported in the consolidated financial statements. Management believes that the accounting policies described below require significant judgment in their application or incorporate estimates and assumptions that are inherently uncertain and that may change in subsequent periods. Additional information on the application of these accounting policies can be found in the Combined Notes to Consolidated Financial Statements.\nNuclear Decommissioning Asset Retirement Obligations\nThe AROs associated with decommissioning our nuclear un\nits were \n$12.2 billion\n at\n December 31, 2024. The authoritative guidance requires that we estimate our obligation for the future decommissioning of our nuclear generating plants. To estimate that liability, we use an internally-developed, probability-weighted, discounted cash flow model which, on a unit-by-unit basis, considers multiple decommissioning outcome scenarios.\nOver the past decade, nuclear operators and third-party service providers have continued to obtain more information about costs associated with decommissioning activities. At the same time, regulators are gaining more information about decommissioning activities which could result in changes to existing decommissioning requirements. In addition, over time, it is possible that technological advances will be identified that could create efficiencies and lead to a reduction in decommissioning costs. The amount of NDT funds could also impact the timing of the decommissioning activities. Additionally, certain factors such as changes in regulatory requirements during plant operations or the profitability of a nuclear plant could impact the timing of plant retirements. These factors could result in material changes to our current estimates as more information becomes available and could change the timing of plant retirements and the probability assigned to the decommissioning outcome scenarios.\nThe nuclear decommissioning obligation is adjusted on a regular basis due to the passage of time and revisions to the key assumptions for the expected timing and/or estimated amounts of the future undiscounted cash flows \n51\nTable of Contents\nrequired to decommission the nuclear plants, based upon the following methodologies and significant estimates and assumptions:\nDecommissioning Cost Studies.  \nWe use unit-by-unit decommissioning cost studies to provide a marketplace assessment of the expected costs (in current year dollars) and timing of decommissioning activities, which are validated by comparison to current decommissioning projects within the industry and other estimates. Decommissioning cost studies are updated, on a rotational basis, for each of our nuclear units at least every five years, unless circumstances warrant more frequent updates. As part of the annual cost study update process, we evaluate newly assumed costs or substantive changes in previously assumed costs to determine if the cost estimate impacts are sufficiently material to warrant application of the updated estimates to the AROs across the nuclear fleet outside of the normal five-year rotating cost study update cycle.\nCost Escalation Factors.  \nWe use cost escalation factors to escalate the decommissioning costs from the decommissioning cost studies discussed above through the assumed decommissioning period for each of the units. Cost escalation studies, updated on an annual basis, are used to determine escalation factors, and are based on inflation indices for labor, equipment and materials, energy, LLRW disposal, and other costs. All the nuclear AROs are adjusted each year for updated cost escalation factors.\nProbabilistic Cash Flow Models.  \nOur probabilistic cash flow models include the assignment of probabilities to various scenarios for decommissioning cost levels, decommissioning approaches, and timing of plant shutdown on a unit-by-unit basis. Probabilities assigned to cost levels include an assessment of the likelihood of costs 20% higher (high-cost scenario) or 15% lower (low-cost scenario) than the base-cost scenario. The assumed decommissioning scenarios generally include the following three alternatives: (1) DECON, which assumes major decommissioning activities begin shortly after the cessation of operation, (2) Shortened SAFSTOR, which generally assumes a 30-year delay prior to onset of major decommissioning activities, and (3) SAFSTOR, which assumes the nuclear facility is placed and maintained in such condition during decommissioning, so that the nuclear facility can be safely stored and subsequently decontaminated within 60 years after cessation of operations. In each decommissioning scenario, spent fuel is transferred to dry cask storage as soon as possible until DOE acceptance for disposal.\nThe actual decommissioning approach selected will be determined at the time of shutdown and may be influenced by multiple factors including the funding status of the NDT funds at the time of shutdown and regulatory or other commitments.\nThe plant shutdown timing scenarios consider four alternatives: (1) the probability of early plant retirement, (2) the probability of operating through the original 40-year nuclear license term, (3) the probability of operating through an initial 20-year license renewal term, and (4) the probability of a second 20-year license renewal term. As power market and regulatory environment developments occur, we evaluate and incorporate, as necessary, the impacts of such developments into our nuclear ARO assumptions and estimates.\nOur probabilistic cash flow models also include an assessment of the timing of DOE acceptance of SNF for disposal. We currently assume DOE will begin accepting SNF from the industry in 2040. The SNF acceptance date assumption is based on management’s estimates of the amount of time required for DOE to select a site location and develop the necessary infrastructure for long-term SNF storage. For additional information regarding SNF, see Note 18 — Commitments and Contingencies of the Combined Notes to Consolidated Financial Statements.\nDiscount Rates. \nThe probability-weighted estimated future cash flows for the various assumed scenarios are discounted using our specific credit-adjusted, risk-free rates (CARFR) or a AAA-rated U.S. company proxy CARFR for the units that maintain the ability to collect decommissioning costs from utility customers (former PECO and STP units). We initially recognize an ARO at fair value and subsequently adjust it for changes to estimated costs, timing of future cash flows and modifications to decommissioning assumptions. The ARO is not required or permitted to be re-measured for changes in the CARFR that occur in isolation. Increases in the ARO due to upward revisions in estimated undiscounted cash flows are considered new obligations and are measured using a current CARFR as the increase creates a new cost layer within the ARO. Any decrease in the estimated undiscounted future cash flows relating to the ARO are treated as a modification of an existing ARO cost layer and, therefore, are measured using the average historical CARFR rates used in creating the initial ARO cost layers. If all our future nominal cash flows associated with the ARO were to be discounted at the current prevailing CARFR, the obligation would decrease from approximately $12.2 billion to approximately $11.2 billion.\n52\nTable of Contents\nThe following table illustrates the significant impact that changes in the CARFR, when combined with changes in projected amounts and expected timing of cash flows, can have on the valuation of the ARO:\nChange in the CARFR applied to the annual ARO update\nIncrease (Decrease) to ARO as of December 31, 2024\n2023 CARFR rather than the 2024 CARFR\n$\n(300)\n2024 CARFR increased by 50 basis points\n(790)\n2024 CARFR decreased by 50 basis points\n990 \nARO Sensitivities. \nChanges in the assumptions underlying the ARO could materially affect the decommissioning obligation. The impact of a change in any one of these assumptions to the ARO is highly dependent on how the other assumptions may correspondingly change.\nThe following table illustrates the effects of changing certain ARO assumptions while holding all other assumptions constant:\nChange in ARO Assumption\nIncrease (Decrease) to ARO as of December 31, 2024\nCost escalation studies\nUniform increase in escalation rates of 50 basis points\n$\n2,290 \nProbabilistic cash flow models\nIncrease the estimated costs to decommission the nuclear plants by 10 percent\n770 \nIncrease the likelihood of the DECON scenario by 10 percent and decrease the likelihood of the SAFSTOR scenario by 10 percent\n(a)\n130 \nShorten each unit's probability-weighted operating life assumption by 10 percent\n(b)\n430 \nExtend the estimated date for DOE acceptance of SNF to 2045\n(40)\n__________\n(a)\nExcludes any sites in which management has committed to a specific decommissioning approach. \n(b)\nExcludes Crane and Zion.\nSee Note 1 — Basis of Presentation and Note 10 — Asset Retirement Obligations of the Combined Notes to Consolidated Financial Statements for additional information regarding accounting for nuclear AROs.\nPurchase Accounting\nIn accordance with authoritative guidance, the assets acquired and liabilities assumed in an acquired business are recorded at their estimated fair values on the date of acquisition. Determining the fair value of assets acquired and liabilities assumed requires management’s judgment, often utilizes independent valuation experts and involves the use of significant estimates and assumptions with respect to the timing and amounts of future cash inflows and outflows, discount rates, market prices and asset lives, among other items. Changes to these estimates and assumptions could result in material changes to the fair value of assets and liabilities as of the acquisition date. The judgments made in the determination of the estimated fair value assigned to the assets acquired and liabilities assumed, as well as the estimated useful life of each asset and the duration of each liability, could significantly impact the financial statements in periods after acquisition, such as through depreciation and amortization expense. Authoritative guidance provides that the allocation of the purchase price may be modified up to one year after the acquisition date as more information is obtained about the fair value of assets acquired and liabilities assumed. See Note 2 — Mergers, Acquisitions, and Dispositions of the Combined Notes to Consolidated Financial Statements for additional information.\nThe difference between the purchase price amount and the net fair value of assets acquired and liabilities assumed is recognized as goodwill on the balance sheet if the purchase price exceeds the estimated net fair value, or as a bargain purchase gain on the income statement if the purchase price is less than the estimated net fair value.  Goodwill is assigned to reporting units that are expected to benefit from the acquisition. Goodwill is not amortized, instead it is subject to an impairment assessment at least annually to consider whether the reporting unit fair value is more likely than not less than the carrying amount. See Note 1 — Basis of Presentation, Note 2 — Mergers, Acquisitions, and Dispositions, and Note 12 — Intangible Assets of the Combined Notes to Consolidated Financial Statements for additional information.\n53\nTable of Contents\nGoodwill\nWe perform an assessment for impairment of goodwill at least annually or more frequently if an event occurs or circumstances change that would more likely than not reduce the fair value of the reporting units below their carrying amount. A reporting unit is an operating segment or one level below an operating segment (known as a component) and is the level at which goodwill is tested for impairment. Our operating segments and reporting units are Mid-Atlantic, Midwest, New York, ERCOT, and Other Power Regions. See Note 5 — Segment Information of the Combined Notes to Consolidated Financial Statements for additional information on our segments. Goodwill is primarily reported within our ERCOT segment. See Note 12 — Intangible Assets of the Combined Notes to Consolidated Financial Statements for additional information.\nWe first perform a qualitative assessment to determine whether a quantitative assessment is necessary. As part of the qualitative assessment, we evaluate, among other things, management’s best estimate of projected operating and capital cash flows for the reporting units and changes in certain market conditions, including the discount rate. Significant assumptions used in these fair value analyses include discount and growth rates, energy prices, and projected operating and capital cash flows.\nWhile the 2024 annual assessments indicated no impairments, certain assumptions used in the assessment are highly sensitive to changes. Adverse regulatory actions or changes in significant assumptions could potentially result in future impairments of our goodwill, which could be material.\nSee Note 1 — Basis of Presentation, Note 2 — Mergers, Acquisitions, and Dispositions, and Note 12 — Intangible Assets of the Combined Notes to Consolidated Financial Statements for additional information.\nUnamortized Energy Contract Assets and Liabilities\nUnamortized energy contract assets and liabilities represent the remaining unamortized balances of non-derivative energy contracts and fuel contracts that we have acquired. The initial amount recorded represents the difference between the fair value of the contracts at the time of acquisition and the contract value based on the terms of each contract. The unamortized energy contract assets and liabilities are amortized over the life of the contract in relation to the expected realization of the underlying cash flows. Amortization of the unamortized energy and fuel contract assets and liabilities are recorded through Operating revenues or Purchased power and fuel expense, depending on the nature of the underlying contract. See Note 12 — Intangible Assets of the Combined Notes to Consolidated Financial Statements for additional information.\nImpairment of Long-Lived Assets\nWe regularly monitor and evaluate the carrying value of long-lived assets or asset groups for recoverability whenever events or changes in circumstances indicate that the carrying value of those assets may not be recoverable. Indicators of potential impairment may include a deteriorating business climate, including, but not limited to, declines in energy prices, condition of the asset, or plans to dispose of a long-lived asset significantly before the end of its useful life.\nThe review of long-lived assets or asset groups for impairment utilizes significant assumptions about operating strategies and estimates of future cash flows, which require assessments of current and projected market conditions. Forecasting future cash flows requires assumptions regarding forecasted commodity prices for the sale of power and purchases of fuel and the expected operations of assets. A variation in the assumptions used could lead to a different conclusion regarding the recoverability of an asset or asset group and, thus, could potentially result in material future impairments. An impairment evaluation is based on an undiscounted cash flow analysis at the lowest level at which cash flows of the long-lived assets or asset groups are largely independent of the cash flows of other assets and liabilities. The lowest level of independent cash flows is determined by the evaluation of several factors, including the geographic dispatch of the generating units and the hedging strategies related to those units. The cash flows from our generating units are generally evaluated at a regional portfolio level (asset group), given the interdependency of cash flows generated from the customer supply and risk management activities within each region. In certain cases, our generating assets may be evaluated on an individual basis where those assets are contracted on a long-term basis with a third party and operations are independent of other generating assets (typically contracted renewable generation).\n54\nTable of Contents\nOn a quarterly basis, we assess our long-lived assets or asset groups for indicators of potential impairment. If indicators are present for a long-lived asset or asset group, a comparison of the undiscounted expected future cash flows to the carrying value is performed. When the undiscounted cash flow analysis indicates the carrying value of a long-lived asset or asset group may not be recoverable, the amount of the impairment loss is determined by measuring the excess of the carrying amount of the long-lived asset or asset group over its fair value. The fair value of the long-lived asset or asset group is dependent upon a market participant’s view of the exit price of the asset or asset groups. This includes significant assumptions of the estimated future cash flows generated by the asset or asset groups and market discount rates. Events and circumstances often do not occur as expected, resulting in differences between prospective financial information and actual results, which may be material. The determination of fair value is driven by both internal assumptions that include significant unobservable inputs, such as revenue and generation forecasts, projected capital, maintenance expenditures, and discount rates, as well as information from various public, financial and industry sources.\nDepreciable Lives of Property, Plant, and Equipment\nWe have significant investments in electric generating assets. These assets are generally depreciated on a straight-line basis, using the group, composite or unitary methods of depreciation. The group approach is typically for groups of similar assets that have approximately the same useful lives and the composite approach is used for heterogeneous assets that have different lives. Under both methods, a reporting entity depreciates the assets over the average life of the assets in the group. The estimation of asset useful lives requires management judgment, supported by formal depreciation studies of historical asset retirement experience. Depreciation studies are generally conducted periodically if an event, regulatory action, or change in retirement patterns indicate an update is necessary.\nAlong with depreciation study results, management considers expected future energy market conditions and generation plant operating costs and capital investment requirements in determining the estimated useful lives of our generating facilities and reassesses the reasonableness of estimated useful lives whenever events or changes in circumstances warrant. When a determination has been made that an asset will be retired before the end of its current estimated useful life, depreciation provisions will be accelerated to reflect the shortened estimated useful life, which could have a material unfavorable impact on future results of operations.\nChanges in estimated useful lives of electric generating assets could have a significant impact on future results of operations. See Note 1 — Basis of Presentation and Note 8 — Property, Plant, and Equipment of the Combined Notes to Consolidated Financial Statements for information regarding depreciation and estimated useful lives of the property, plant and equipment.\nAccounting for Derivative Instruments\nWe use derivative instruments to manage commodity price risk, foreign currency exchange risk and interest rate risk related to ongoing business operations. Our derivative activities are in accordance with our RMP. See Note 15 — Derivative Financial Instruments of the Combined Notes to Consolidated Financial Statements for additional information.\nWe account for derivative financial instruments under the applicable authoritative guidance. Determining whether a contract qualifies as a derivative requires that management exercise significant judgment, including assessing market liquidity as well as determining whether a contract has one or more underlying and one or more notional quantities. Changes in management’s assessment of contracts and the liquidity of their markets, and changes in authoritative guidance, could result in previously excluded contracts becoming in scope of new authoritative guidance.\nAll derivatives are recognized on the balance sheet at their fair value, except for certain derivatives that qualify for, and are elected under, NPNS. Derivatives entered for economic hedging and for proprietary trading purposes are recorded at fair value through earnings. NPNS transactions are not required to be recorded at fair value, but rather on an accrual basis of accounting. Determining whether a contract qualifies for NPNS requires judgment on whether the contract will physically deliver and requires that management ensure compliance with all associated qualification and documentation requirements.\n55\nTable of Contents\nCommodity Contracts.  \nIdentification of a commodity contract as an economic hedge requires us to determine that the contract is in accordance with the RMP. We reassess our economic hedges on a regular basis to determine if they continue to be within the guidelines of the RMP.\nAs a part of the authoritative guidance, we make estimates and assumptions concerning future commodity prices, load requirements, interest rates, the timing of future transactions and their probable cash flows, the fair value of contracts and the expected changes in the fair value in deciding whether to enter derivative transactions, and in determining the initial accounting treatment for derivative transactions. Under the authoritative guidance for fair value measurements, we categorize these derivatives under a fair value hierarchy that prioritizes the inputs to valuation techniques used to measure fair value.\nDerivative contracts are traded in both exchange-based and non-exchange-based markets. Exchange-based derivatives that are valued using unadjusted quoted prices in active markets are generally categorized in Level 1 in the fair value hierarchy.\nCertain derivative pricing is verified using indicative price quotations available through brokers or over-the-counter, online exchanges. The price quotations reflect the average of the mid-point of the bid-ask spread from observable markets that we believe provide the most liquid market for the commodity. The price quotations are reviewed and corroborated to ensure the prices are observable and representative of an orderly transaction between market participants. Our derivatives are traded predominantly at liquid trading points. The remaining derivative contracts are valued using models that consider inputs such as contract terms, including maturity, and market parameters, and assumptions of the future prices of commodities, interest rates, volatility, credit worthiness and credit spread. For derivatives that trade in liquid markets, such as generic forwards, swaps, and options, the model inputs are generally observable. Such instruments are categorized in Level 2.\nFor derivatives that trade in less liquid markets with limited pricing information, the model inputs generally would include both observable and unobservable inputs and are categorized in Level 3.\nWe consider non-performance risk, including credit risk in the valuation of derivative contracts, and both historical and current market data in our assessment of non-performance risk. The impacts of non-performance and credit risk to date have not been material to the consolidated financial statements.\nSee ITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK and Note 15 — Derivative Financial Instruments and Note 17 — Fair Value of Financial Assets and Liabilities of the Combined Notes to Consolidated Financial Statements for additional information regarding derivative instruments.\nDefined Benefit Pension and Other Postretirement Employee Benefits\nThe majority of our employees participate in defined benefit pension and OPEB plans we sponsor. Measuring plan obligations and costs involves various factors, including valuation assumptions and inputs and accounting policy elections. When developing the required assumptions, we consider historical information as well as future expectations. The measurement of these benefit obligations and costs is affected by several assumptions including the discount rate, the long-term expected rate of return on plan assets, the anticipated rate of increase of health care costs, our contributions, the rate of compensation increases, and the long-term expected investment rate credited to employees of certain plans, among others. The assumptions are updated annually and during any interim remeasurement.\nPension and OPEB plan assets include U.S. and international equity securities, fixed income securities, and alternative investments such as real assets, private equity, private credit, and hedge funds.\nExpected Rate of Return on Plan Assets.  \nTo determine the EROA, we consider forecasted future long-term capital market performance, weighted by our target asset class allocations. We calculate the expected return on pension and OPEB plan assets by multiplying the EROA by the MRV of plan assets at the beginning of the year, considering anticipated contributions and benefit payments to be made during the year. The MRV for pension and OPEB plan assets is based on either fair value or a calculated value that systematically and rationally recognizes changes in fair value over multiple years. For the majority of pension plan assets, we use a calculated value that adjusts for 20% of the difference between fair value and expected MRV, resulting in less volatile expected asset returns to be recognized as a component of pension cost from year to year. For OPEB plan assets and certain pension plan assets, we use fair value to calculate the MRV.\n56\nTable of Contents\nDiscount Rate.  \nDiscount rates are determined by developing a spot rate curve based on the yield to maturity of high-quality non-callable (or callable with make-whole provisions) bonds with similar maturities to the pension and OPEB obligations. These spot rates discount the estimated future benefit distribution amounts for the pension and OPEB plans. The discount rate is the single level rate that matches the spot rate curve. We utilize an analytical tool developed by our actuaries to determine these rates.\nMortality.  \nThe mortality assumption includes a base table for the current expectation of life expectancy of the population adjusted by an improvement scale that attempts to anticipate future improvements in life expectancy. Upon remeasurement as of December 31, 2023 and 2024, we utilized the mortality tables and projection scales released by the SOA.\nSensitivity to Changes in Key Assumptions.  \nThe following table illustrates the effects of changing certain of the actuarial assumptions reflected above and as discussed in Note 14 — Retirement Benefits of the Combined Notes to Consolidated Financial Statements, while holding all other assumptions constant:\nActual Assumption\nPension\nOPEB\nAssumption\nIncrease / (Decrease)\nActuarial Assumption\nPension\nOPEB\nTotal\nChange in 2025 cost:\nDiscount rate\n(a)\n5.66 \n%\n5.63 \n%\n0.5 \n%\n$\n(13)\n$\n(1)\n$\n(14)\n5.66 \n%\n5.63 \n%\n(0.5)\n%\n17 \n1 \n18 \nEROA\n6.50 \n%\n6.00 \n%\n0.5 \n%\n(38)\n(3)\n(41)\n6.50 \n%\n6.00 \n%\n(0.5)\n%\n38 \n3 \n41 \nChange in benefit obligation as of December 31, 2024:\nDiscount rate\n(a)\n5.66 \n%\n5.63 \n%\n0.5 \n%\n(319)\n(59)\n(378)\n5.66 \n%\n5.63 \n%\n(0.5)\n%\n346 \n64 \n410 \n__________\n(a)\nGenerally, the discount rate will have a larger impact on the pension and OPEB cost and obligation as the rate moves closer to 0%. Therefore, the sensitivities above cannot be extrapolated for larger changes in the discount rate. Additionally, our liability-driven hedging investment strategy for our pension asset portfolio is not reflected in the sensitivities shown, which do not account for the offsetting impact that discount rate changes may have on pension asset returns.\nSee Note 1 — Basis of Presentation and Note 14 — Retirement Benefits of the Combined Notes to Consolidated Financial Statements for additional information regarding the accounting for the defined benefit pension and OPEB plans.\nTaxation\nSignificant management judgment is required in determining our provision for income taxes, primarily due to the uncertainty related to tax positions taken, as well as deferred tax assets and liabilities and valuation allowances. We account for uncertain income tax positions using a benefit recognition model with a two-step approach, including a more-likely-than-not recognition threshold and a measurement approach based on the largest amount of tax benefit that is greater than 50% likely of being realized upon ultimate settlement. Management evaluates each position based on the technical merits and facts and circumstances of the position, assuming the position will be examined by a taxing authority having full knowledge of all relevant information. Significant judgment is required to determine whether the recognition threshold has been met and, if so, the appropriate amount of tax benefits to be recorded in the consolidated financial statements.\nWe evaluate quarterly the probability of realizing deferred tax assets by reviewing a forecast of future taxable income and our intent and ability to implement tax planning strategies, if necessary, to realize deferred tax assets. We also assess negative evidence, such as the expiration of historical operating loss or tax credit carryforwards, that could indicate our inability to realize our deferred tax assets. Based on the combined assessment, we record valuation allowances for deferred tax assets when it is more-likely-than-not such benefit will not be realized in future periods.\n57\nTable of Contents\nActual income taxes could vary from estimated amounts due to the future impacts of various items, including future changes in income tax laws, our forecasted financial condition and results of operations, failure to successfully implement tax planning strategies, as well as results of audits and examinations of filed tax returns by taxing authorities. See Note 13 — Income Taxes of the Combined Notes to Consolidated Financial Statements for additional information.\nAccounting for Loss Contingencies\nIn the preparation of our financial statements, we make judgments regarding the future outcome of contingent events and record liabilities for loss contingencies that are probable and can be reasonably estimated based upon available information. The amount recorded may differ from the actual expense incurred when the uncertainty is resolved and may have a material impact to our consolidated financial statements.\nEnvironmental Costs.  \nEnvironmental investigation and remediation liabilities are based upon estimates with respect to the number of sites for which we will be responsible, the scope, and cost of work to be performed at each site, the portion of costs that will be shared with other parties, the timing of the remediation work, regulations, and the requirements of local governmental authorities. These matters, if resolved in a manner different from the estimate, could have a material impact to our consolidated financial statements. See Note 18 — Commitments and Contingencies of the Combined Notes to Consolidated Financial Statements for additional information.\nOther, Including Personal Injury Claims.  \nFor accidents we maintain insurance coverage for general liability, automotive liability, workers’ compensation, and personal injury claims and are self-insured to the extent that losses are within policy deductibles or exceed the amount of insurance maintained. We have reserves for both open claims asserted, and an estimate of claims incurred but not reported (IBNR). The IBNR reserve is estimated based on actuarial assumptions and analysis and is updated annually. Future events, such as the number of new claims to be filed each year, the average cost of disposing of claims, as well as the numerous uncertainties surrounding litigation and possible state and national legislative measures could cause the actual costs to be higher or lower than estimated. Accordingly, these claims, if resolved in a manner different from the estimate, could have a material impact to the consolidated financial statements.\nRevenue Recognition\nSources of Revenue and Determination of Accounting Treatment.  \nWe earn revenue from various business activities including competitive sales of power, natural gas, and other energy-related products and sustainable solutions.\nThe accounting treatment for revenue recognition is based on the nature of the underlying transaction and applicable authoritative guidance. We primarily apply the Revenue from Contracts with Customer, Government Assistance, and Derivatives and Hedging guidance to recognize revenue, as discussed in more detail below.\nRevenue from Contracts with Customers.\n  We recognize revenues in the period in which the performance obligations within contracts with customers are satisfied, which generally occurs when power, natural gas and other energy-related products and services are provided to the customer. Transactions within the scope of Revenue from Contracts with Customers generally include non-derivative agreements, contracts that are designated as NPNS and spot-market energy commodity sales, including settlements with RTOs and ISOs.\nThe determination of our retail power and natural gas sales to individual customers is based on systematic readings of customer meters, generally monthly. Energy delivered to customers that has not yet been billed as of the reporting period is estimated and corresponding unbilled revenue is recorded. The measurement of unbilled revenue is based upon individual customer meter readings, forecasted volumes, and applicable rates.  See Note 1 — Basis of Presentation and Note 4 — Revenue from Contracts with Customers of the Combined Notes to Consolidated Financial Statements for additional information.\nGovernment Assistance.  \nOur existing nuclear plants are eligible for federal government incentives including transferable tax credits for qualifying electric production volumes. The nuclear PTC is subject to legislative and regulatory changes, which can affect the availability and amount of credits. Repeal or significant reduction or modification of the PTC could have a material impact on our financial performance depending on gross receipts received by our nuclear units each year.  Further, the nuclear PTC continues to be the subject of additional \n58\nTable of Contents\nguidance expected to be issued from the U.S. Treasury and IRS that may materially impact the total amount of benefits we receive. Absence of prescriptive guidance requires the application of judgement in determining annual gross receipts, a primary component in the determination of the credit. We closely monitor developments in relevant tax laws and regulations to anticipate and mitigate potential risks. Given that the nuclear PTC is a function of annual gross receipts, quarterly results rely on forecasted gross receipts for the fiscal year. Energy prices are volatile and are impacted by various factors beyond our control. Significant deviations in market prices from those we’ve forecasted could materially impact our quarterly recognition of nuclear PTC revenues as we progress through the calendar year. See ITEM 1. BUSINESS – Price and Supply Risk Management for additional information on how we mitigate market price risk. \nSee Note 6 — Government Assistance of the Combined Notes to the Consolidated Financial Statements for additional information regarding nuclear PTC.\nDerivative Revenues.  \nWe record revenues and expenses using the fair value method of accounting, also referred to as mark-to-market method of accounting for transactions that are accounted for as derivatives. These derivative transactions primarily relate to commodity price risk management activities. Mark-to-market revenues and expenses include inception gains or losses on new transactions where the fair value is observable, unrealized gains and losses from changes in the fair value of open contracts, and realized gains and losses.\nFinancial Results of Operations\nGAAP Results of Operations.  \nThe following table sets forth our consolidated GAAP Net Income (Loss) Attributable to Common Shareholders for the year ended December 31, 2024 compared to the same period in 2023. For additional information regarding the financial results for the years ended December 31, 2024 and 2023, see the discussions of Results of Operations below.\nFor the Years Ended December 31,\n$ Change\n2024\n2023\nGAAP Net Income (Loss) Attributable to Common Shareholders\n$\n3,749 \n$\n1,623 \n$\n2,126 \nAdjusted (non-GAAP) Operating Earnings.  \nWe utilize Adjusted (non-GAAP) Operating Earnings (and/or its per share equivalent) in our internal analysis, and in communications with investors and analysts, as a consistent measure for comparing our financial performance and discussing the factors and trends affecting our business. The presentation of Adjusted (non-GAAP) Operating Earnings is intended to complement and should not be considered an alternative to, nor more useful than, the presentation of GAAP Net Income.\n59\nTable of Contents\nThe table below provides a reconciliation of GAAP Net Income to Adjusted (non-GAAP) Operating Earnings. Adjusted (non-GAAP) Operating Earnings is not a standardized financial measure and may not be comparable to other companies’ presentations of similarly titled measures.\nUnless otherwise noted, the income tax impact of each reconciling adjustment between GAAP Net Income (Loss) Attributable to Common Shareholders and Adjusted (non-GAAP) Operating Earnings is based on the marginal statutory federal and state income tax rates, taking into account whether the income or expense item is taxable or deductible, respectively, in whole or in part. For all adjustments except the NDT fund investment returns, which are included in decommissioning-related activities, the marginal statutory income tax rate was 25.5% and 25.1%\n \nfor the years ended December 31, 2024 and 2023, respectively. Under IRS regulations, NDT fund investment returns are taxed at different rates for investments if they are in qualified or non-qualified funds. The effective tax rates for the unrealized and realized gains and losses related to NDT funds were 54.8% and 52.4% for the years ended December 31, 2024 and 2023, respectively\n. \nThe following table provides a reconciliation between GAAP Net Income (Loss) Attributable to Common Shareholders and Adjusted (non-GAAP) Operating Earnings for the year ended December 31, 2024 compared to the same period in 2023.\nFor the Years Ended December 31,\n2024\n2023\nEarnings Per Share\n(a)\nEarnings Per Share\n(a)\nGAAP Net Income (Loss) Attributable to Common Shareholders\n$\n3,749 \n$\n11.89 \n$\n1,623 \n$\n5.01 \nUnrealized (Gain) Loss on Fair Value Adjustments (net of taxes $346 and $169, respectively)\n(b)\n(1,026)\n(3.25)\n506 \n1.56 \nPlant Retirements and Divestitures (net of taxes $9 and $2, respectively)\n28 \n0.09 \n(7)\n(0.02)\nDecommissioning-Related Activities (net of taxes $244 and $339, respectively)\n(c)\n(50)\n(0.16)\n(183)\n(0.56)\nPension & OPEB Non-Service (Credits) Costs (net of taxes $2 and $14, respectively)\n5 \n0.02 \n(41)\n(0.13)\nSeparation Costs (net of taxes $3 and $21, respectively)\n(d)\n9 \n0.03 \n62 \n0.19 \nERP System Implementation Costs (net of taxes $3 and $6, respectively)\n8 \n0.02 \n19 \n0.06 \nChange in Environmental Liabilities (net of taxes $22 and $11, respectively)\n65 \n0.21 \n33 \n0.10 \nIncome Tax-Related Adjustments\n(e)\n(52)\n(0.17)\n(9)\n(0.03)\nAcquisition-Related Costs (net of taxes $2 and $3, respectively)\n6 \n0.02 \n9 \n0.03 \nAsset Impairments (net of taxes $— and $9, respectively)\n— \n— \n62 \n0.19 \nNoncontrolling Interests\n(f)\n(7)\n(0.02)\n(40)\n(0.12)\nAdjusted (non-GAAP) Operating Earnings\n$\n2,735 \n$\n8.67 \n$\n2,034 \n$\n6.28 \n__________\n(a)\nAmounts may not sum due to rounding. Earnings per share amount is based on average diluted common shares outstanding of 315 million and 324 million for the years ended December 31, 2024 and 2023, respectively.\n(b)\nIncludes mark-to-market on economic hedges, interest rate swaps, and fair value adjustments related to gas imbalances and equity investments.\n(c)\nReflects all gains and losses associated with NDTs, ARO accretion, ARC depreciation, ARO remeasurement, and impacts of contractual offset for Regulatory Agreement Units.\n(d)\nRepresents certain incremental costs related to the separation (system-related costs, third-party costs paid to advisors, consultants, lawyers, and other experts assisting in the separation), including a portion of the amounts billed to us pursuant to the TSA. See Note 1 — Basis of Presentation of the Combined Notes to Consolidated Financial Statements for additional information.\n(e)\nIn 2024, primarily reflects the adjustment to deferred income taxes due to changes in forecasted apportionment.\n(f)\nRepresents elimination of the noncontrolling interest portion of certain adjustments included above.\n60\nTable of Contents\nResults of Operations\n2024\n2023\n$ Change\nOperating revenues\n$\n23,568 \n$\n24,918 \n$\n(1,350)\nOperating expenses\nPurchased power and fuel\n11,419 \n16,001 \n(4,582)\nOperating and maintenance\n6,159 \n5,685 \n474 \nDepreciation and amortization\n1,123 \n1,096 \n27 \nTaxes other than income taxes\n586 \n553 \n33 \nTotal operating expenses\n19,287 \n23,335 \n(4,048)\nGain (loss) on sales of assets and businesses\n71 \n27 \n44 \nOperating income (loss)\n4,352 \n1,610 \n2,742 \nOther income and (deductions)\nInterest expense, net\n(506)\n(431)\n(75)\nOther, net\n670 \n1,268 \n(598)\nTotal other income and (deductions)\n164 \n837 \n(673)\nIncome (loss) before income taxes \n4,516 \n2,447 \n2,069 \nIncome tax (benefit) expense\n774 \n859 \n(85)\nEquity in income (losses) of unconsolidated affiliates\n(4)\n(11)\n7 \nNet income (loss)\n3,738 \n1,577 \n2,161 \nNet income (loss) attributable to noncontrolling interests\n(11)\n(46)\n35 \nNet income (loss) attributable to common shareholders\n$\n3,749 \n$\n1,623 \n$\n2,126 \nYear Ended December 31, 2024 Compared to Year Ended December 31, 2023.  \nThe variance in Net income (loss) attributable to common shareholders\n \nwas favorable by $2,126 million primarily due to:\n•\nFavorable net mark-to-market activity and other fair value adjustments;\n•\nFavorable nuclear PTC activity related to the IRA beginning in 2024; and\n•\nFavorable market and portfolio conditions primarily driven by higher realized margins on load contracts and generation-to-load optimization.\nThe favorable items were partially offset by:\n•\nHigher labor (inclusive of incentives), contracting, and materials;\n•\nLower unrealized gains resulting from an investment that became a publicly traded company in the second quarter of 2023;\n•\nUnfavorable net realized and unrealized NDT activity; and\n•\nLower revenue recognized for ZECs delivered under the Illinois ZEC program in prior planning years.\nOperating revenues.  \nOur five reportable segments are Mid-Atlantic, Midwest, New York, ERCOT, and Other Power Regions. See Note 5\n — \nSegment Information of the Combined Notes to Consolidated Financial Statements for additional information on these reportable segments.\nWholesale and retail sales of natural gas, as well as sales of other energy-related products and sustainable solutions and other miscellaneous business activities that are not significant to overall results of operations are reported under Other and not allocated to a region. \n61\nTable of Contents\nFor the year ended December 31, 2024 compared to 2023, Operating revenues were as follows:\n2024 vs. 2023\n2024\n2023\n$ Change\n% Change\n(a)\nMid-Atlantic\n$\n5,522 \n$\n5,138 \n$\n384 \n7.5 \n%\nMidwest\n4,805 \n4,658 \n147 \n3.2 \n%\nNew York\n2,050 \n2,021 \n29 \n1.4 \n%\nERCOT\n1,550 \n1,346 \n204 \n15.2 \n%\nOther Power Regions\n5,506 \n5,851 \n(345)\n(5.9)\n%\nTotal reportable segment electric revenues\n19,433 \n19,014 \n419 \n2.2 \n%\nOther\n3,819 \n4,505 \n(686)\n(15.2)\n%\nMark-to-market gains\n316 \n1,399 \n(1,083)\nTotal Operating revenues\n$\n23,568 \n$\n24,918 \n$\n(1,350)\n(5.4)\n%\n__________\n(a)\n% Change in mark-to-market is not a meaningful measure.\nSales and Supply Sources.  \nOur sales and supply sources by region are summarized below:\n2024 vs. 2023\n(GWhs)\n2024\n2023\nChange\n% Change\nNuclear Generation\n(a)\nMid-Atlantic\n52,898 \n53,012 \n(114)\n(0.2)\n%\nMidwest\n95,321 \n93,768 \n1,553 \n1.7 \n%\nNew York\n25,134 \n25,546 \n(412)\n(1.6)\n%\nERCOT\n8,358 \n1,721 \n6,637 \n385.6 \n%\nTotal Nuclear Generation\n181,711 \n174,047 \n7,664 \n4.4 \n%\nNatural Gas, Oil and Renewables\n(a)\nMid-Atlantic\n2,137 \n2,014 \n123 \n6.1 \n%\nMidwest\n1,116 \n1,024 \n92 \n9.0 \n%\nERCOT\n14,778 \n16,877 \n(2,099)\n(12.4)\n%\nOther Power Regions\n8,692 \n8,512 \n180 \n2.1 \n%\nTotal Natural Gas, Oil and Renewables\n26,723 \n28,427 \n(1,704)\n(6.0)\n%\nPurchased Power\nMid-Atlantic\n \n15,729 \n16,509 \n(780)\n(4.7)\n%\nMidwest\n928 \n984 \n(56)\n(5.7)\n%\nERCOT\n3,249 \n5,530 \n(2,281)\n(41.2)\n%\nOther Power Regions\n41,077 \n44,192 \n(3,115)\n(7.0)\n%\nTotal Purchased Power\n60,983 \n67,215 \n(6,232)\n(9.3)\n%\nTotal Supply/Sales by Region\nMid-Atlantic\n70,764 \n71,535 \n(771)\n(1.1)\n%\nMidwest\n97,365 \n95,776 \n1,589 \n1.7 \n%\nNew York\n25,134 \n25,546 \n(412)\n(1.6)\n%\nERCOT\n26,385 \n24,128 \n2,257 \n9.4 \n%\nOther Power Regions\n49,769 \n52,704 \n(2,935)\n(5.6)\n%\nTotal Supply/Sales by Region\n269,417 \n269,689 \n(272)\n(0.1)\n%\n__________\n(a)\nIncludes the proportionate share of output where we have an undivided ownership interest in jointly-owned generating plants.\n62\nTable of Contents\nNuclear Fleet Capacity Factor.  \nThe following table presents nuclear fleet operating data for our plants that reflects our ownership percentage for stations operated by us and excludes Salem and STP, which are operated by PSEG and STPNOC, respectively. The nuclear fleet capacity factor presented in the table is defined as the ratio of the actual output of a unit (or combination of units) over a period of time to its output if the unit had operated at net monthly mean capacity for that time period. We consider capacity factor to be a useful measure to analyze the nuclear fleet performance between periods. We have included the analysis below as a complement to the financial information provided in accordance with GAAP. However, these measures are not a presentation defined under GAAP and may not be comparable to other companies’ presentations or be more useful than the GAAP information provided elsewhere in this report.\n2024\n2023\nNuclear fleet capacity factor\n94.6 \n%\n94.4 \n%\nRefueling outage days\n230 \n256 \nNon-refueling outage days\n36 \n51 \nNuclear PTC.  \nBeginning in 2024, our existing nuclear units are eligible for a PTC extending through 2032. The nuclear PTC provides a transferable credit up to $15 per MWh (a base credit of $3 per MWh with a five times multiplier provided certain prevailing wage requirements are met) and is subject to phase-out when annual gross receipts are between $25.00 per MWh and $43.75 per MWh. We have evaluated and expect to meet the annual prevailing wage requirements at all our nuclear units and are eligible for the five times multiplier. Both the amount of the PTC and the gross receipts thresholds adjust for inflation after 2024 through the duration of the program based on the GDP price deflator for the preceding calendar year. The benefits of the PTC may be realized through a credit against our federal income taxes or transferred via sale to an unrelated party.\nMany of the state-sponsored programs (i.e., ZECs and CMCs) providing compensation for the emissions-free attributes of generation from certain of our nuclear units include contractual or other provisions that require us to refund that compensation up to the amount of the nuclear PTC received or pass through the entirety of the nuclear PTC received. See Note 6 — Government Assistance of the Combined Notes to Consolidated Financial Statements for additional information on the nuclear PTC.\nZEC Prices.  \nWe are compensated through state programs for the carbon-free attributes of our nuclear generation. The following table includes the average ZEC reference prices ($/MWh) for each of our major regions in which state programs have been enacted. Gross prices reflect the weighted average price for the various delivery periods within the years ended December 31, 2024 and 2023 and may not necessarily reflect prices we ultimately realize as a result of interaction with the nuclear PTC discussed above.\n2024 vs. 2023\nState (Region)\n(a)\n2024\n2023\n$ Change\n% Change\nNew Jersey (Mid-Atlantic)\n(b)\n$\n9.98 \n$\n9.92 \n$\n0.06 \n0.6 \n%\nIllinois (Midwest)\n(c)\n5.60 \n5.18 \n0.42 \n8.1 \n%\nNew York (New York)\n18.27 \n19.05 \n(0.78)\n(4.1)\n%\n__________\n(a)\nSee ITEM 1. BUSINESS, Environmental Matters for additional information on the plants receiving payments through state programs.\n(b)\nThe ZEC price is expected to be $10.00/MWh for each delivery period and is subject to an annual update once full year generation is known. Following the latest annual update in August 2024, the ZEC price for the delivery period beginning June 2023 through May 2024 was calculated to be $9.95.\n(c)\nSee Note 4 — Revenue from Contracts with Customers of the Combined Notes to Consolidated Financial Statements for additional information on the Illinois ZEC program.\nIllinois CMC Price.  \nThe price received (paid) for each CMC is determined by the IPA monthly and is based on the accepted CMC bid, less the sum of (a) monthly weighted average PJM Busbar price, (b) ComEd zone capacity price and (c) any federal tax credit or subsidy received by each qualifying plant and is subject to a customer protection cap ($30.30 per MWh for initial delivery period June 2022 through May 2023, $32.50 per MWh for the period June 2023 through May 2024 and $33.43 per MWh for the period June 2024 through May 2025). If the monthly CMC price per MWh calculation results in a net positive value, ComEd will multiply that value by the delivered quantity and pay the total to us. If the CMC price per MWh calculation results in a net negative value, we will multiply this value by the delivered quantity and pay the net value to ComEd. The average \n63\nTable of Contents\nCMC prices per MWh were $8.05 and $4.13 for the years ended December 31, 2024 and 2023, respectively. The average CMC prices may not necessarily reflect prices we ultimately realize as a result of interaction with the nuclear PTC discussed above.\nCapacity Prices.  \nWe participate in capacity auctions in each of our major regions, except ERCOT which does not have a capacity market. We also incur capacity costs associated with load served, which are factored into customer sales prices. Capacity prices have a material impact on our \noperating revenues\n and purchased power and fuel expense. We report capacity on a net monthly basis within each region in either Operating revenues or Purchased power and fuel expense, depending on our net monthly position. The following table presents the average capacity prices ($/MW Day) for each of our major regions. Prices reflect the weighted average prices for the various auction periods within the years ended December 31, 2024 and 2023.\n2024 vs. 2023\nLocation (Region)\n2024\n2023\n$ Change\n% Change\nEastern Mid-Atlantic Area Council (Mid-Atlantic)\n$\n51.89 \n$\n69.64 \n$\n(17.75)\n(25.5)\n%\nComEd (Midwest)\n31.09 \n48.64 \n(17.55)\n(36.1)\n%\nRest of State (New York)\n106.44 \n137.88 \n(31.44)\n(22.8)\n%\nSoutheast New England (Other)\n581.69 \n91.67 \n490.02 \n534.5 \n%\nElectricity Prices.  \nAs a producer and supplier of electricity, the price of electricity has a significant impact on our operating revenues and purchased power cost. We report the sale and purchase of electricity in the spot market on a net hourly basis in either Operating revenues or Purchased power and fuel expense within each region, depending on our net hourly position. The price of electricity is impacted by several variables, including but not limited to, the price of fuels, generation resources in the region, weather, ongoing competition, emerging technologies, as well as macroeconomic and regulatory factors. The following table presents an average day-ahead around-the-clock reference price ($/MWh) for the periods presented for each of our major regions and does not necessarily reflect prices we ultimately realized.\n2024 vs. 2023\nLocation (Region)\n2024\n2023\n$ Change\n% Change\nPJM West (Mid-Atlantic)\n$\n33.74 \n$\n33.06 \n$\n0.68 \n2.1 \n%\nComEd (Midwest)\n25.50 \n26.64 \n(1.14)\n(4.3)\n%\nCentral (New York)\n34.12 \n26.97 \n7.15 \n26.5 \n%\nNorth (ERCOT)\n26.97 \n55.15 \n(28.18)\n(51.1)\n%\nSoutheast Massachusetts (Other)\n(a)\n41.70 \n37.35 \n4.35 \n11.6 \n%\n__________\n(a)\nReflects New England, which comprises the majority of the activity in the Other region.\nFor the year ended December 31, 2024 compared to 2023, changes in \nOperating revenues\n by region were approximately as follows:\n2024 vs. 2023\n$ Change\n% Change\n(a)\nDescription\nMid-Atlantic\n$\n384 \n7.5 \n%\n• favorable estimated nuclear PTC revenue of $515\n• favorable retail load revenue of $135 primarily due to\nhigher contracted energy prices; partially offset by\n• unfavorable wholesale load revenue of ($100) primarily due to lower volumes\n• unfavorable net ZEC program revenue of ($80) due to estimated refund associated with Nuclear PTC\n• unfavorable settled economic hedges of ($60) due to\nsettled prices relative to hedged prices\n64\nTable of Contents\n2024 vs. 2023\n$ Change\n% Change\n(a)\nDescription\nMidwest\n147 \n3.2 \n%\n• favorable estimated nuclear PTC revenue of $1,300; \npartially offset by\n• unfavorable net ZEC and CMC program revenue of ($750) due to decrease in ZEC revenue realized and estimated pass through associated with nuclear PTC\n• unfavorable settled economic hedges of ($205) due to\nsettled prices relative to hedged prices\n• unfavorable net generation and wholesale load revenue of ($85) primarily due to lower load volumes \n• unfavorable PJM performance bonuses of ($70) due to absence of favorable adjustment in 2023 associated with the December 2022 weather event \nNew York\n29 \n1.4 \n%\n• favorable retail load revenue of $155 primarily due to higher load volumes and contracted energy prices\n• favorable estimated nuclear PTC revenue of $150; partially offset by\n• unfavorable net ZEC program revenue of ($180) due to estimated refund associated with nuclear PTC and decrease in ZEC price in current planning year\n• unfavorable settled economic hedges of ($120) due to\nsettled prices relative to hedged prices\nERCOT\n204 \n15.2 \n%\n• favorable settled economic hedges of $150 due to settled prices relative to hedged prices \n• favorable estimated nuclear PTC revenue of $110; partially offset by\n• unfavorable retail load revenue of ($100) primarily due to lower contracted energy prices\nOther Power Regions\n(345)\n(5.9)\n%\n• unfavorable wholesale load revenue of ($515) primarily due to lower contracted prices and load volumes; partially offset by\n• favorable retail load revenue of $200 primarily due to\nhigher contracted energy prices\nOther\n(686)\n(15.2)\n%\n• unfavorable gas revenue, inclusive of settled economic hedges, of ($555) primarily due to lower gas prices\n• no other individually significant items to note\nMark-to-market\n(b)\n(1,083)\n• gains on economic hedging activities of $316 in 2024 compared to gains of $1,399 in 2023\nTotal\n$\n(1,350)\n(5.4)\n%\n__________\n(a)\n% Change in mark-to-market is not a meaningful measure.\n(b)\nSee Note 15 — Derivative Financial Instruments of the Combined Notes to Consolidated Financial Statements for additional information on mark-to-market gains and losses.\n65\nTable of Contents\nPurchased power and fuel.  \nSee Operating revenues above for discussion of our reportable segments and hedging strategies and for supplemental statistical data, including sales and supply sources by region, nuclear fleet capacity factor, capacity prices, and electricity prices.\nWholesale and retail natural gas activity, as well as other miscellaneous business activities that are not significant to overall results of operations are reported under Other and are not allocated to a region.\nFor the year ended December 31, 2024 compared to 2023, Purchased power and fuel expense were as follows:\n2024 vs. 2023\n2024\n2023\n$ Change\n% Change\n(a)\nMid-Atlantic\n$\n2,442 \n$\n2,214 \n$\n228 \n10.3 \n%\nMidwest\n1,603 \n1,403 \n200 \n14.3 \n%\nNew York\n597 \n770 \n(173)\n(22.5)\n%\nERCOT\n503 \n764 \n(261)\n(34.2)\n%\nOther Power Regions\n4,238 \n4,611 \n(373)\n(8.1)\n%\nTotal electric purchased power and fuel\n9,383 \n9,762 \n(379)\n(3.9)\n%\nOther\n2,997 \n3,868 \n(871)\n(22.5)\n%\nMark-to-market losses (gains) \n(961)\n2,371 \n(3,332)\nTotal purchased power and fuel\n$\n11,419 \n$\n16,001 \n$\n(4,582)\n(28.6)\n%\n__________\n(a)\n% Change in mark-to-market is not a meaningful measure.\nFor the year ended December 31, 2024 compared to 2023, changes in \nPurchased power and fuel\n expense by region were approximately as follows:\n2024 vs. 2023\n$ Change\n% Change\n(a)\nDescription\nMid-Atlantic\n$\n228 \n10.3 \n%\n• unfavorable cost of ($100) associated with purchased power to supply load relative to generation volumes primarily driven by higher prices during peak load periods and higher net transmission costs\n• unfavorable settlement of economic hedges of ($75) due to settled prices relative to hedged prices\nMidwest\n200 \n14.3 \n%\n• unfavorable cost of ($170) associated with purchased power to supply load relative to generation volumes primarily driven by higher net transmission costs\n• unfavorable nuclear fuel cost of ($55) primarily due to higher amortization rates related to the reversal of the previous decision in 2020 to retire certain sites\nNew York\n(173)\n(22.5)\n%\n• favorable settlement of economic hedges of $230 due to settled prices relative to hedged prices\nERCOT\n(261)\n(34.2)\n%\n• favorable cost of $245 associated with purchased power to supply load relative to generation volumes primarily due to higher generation volumes\n• favorable settlement of economic hedges of $70 due to settled prices relative to hedged prices\nOther Power Regions\n(373)\n(8.1)\n%\n• favorable purchased power and fuel of $390 primarily due to lower energy prices and load served, partially offset by the expiration of the Mystic COS\n66\nTable of Contents\n2024 vs. 2023\n$ Change\n% Change\n(a)\nDescription\nOther\n(871)\n(22.5)\n%\n• favorable net gas purchases, inclusive of settled economic hedges, of $730 primarily due to lower gas\nprices\n• favorable purchases in the United Kingdom, inclusive of settled economic hedges, of $95 primarily due to lower energy prices\nMark-to-market\n(b)\n(3,332)\n• gains on economic hedging activities of $961 in 2024 compared to losses of ($2,371) in 2023\nTotal\n$\n(4,582)\n(28.6)\n%\n__________\n(a)\n% Change in mark-to-market is not a meaningful measure.\n(b)\nSee Note 15 — Derivative Financial Instruments of the Combined Notes to Consolidated Financial Statements for additional information on mark-to-market gains and losses.\nThe changes in \nOperating and maintenance expense\n consisted of the following:\n2024 vs. 2023\nIncrease (Decrease) \nLabor, other benefits, contracting, and materials\n(a)\n$\n495 \nPlant retirements and divestitures\n47 \nChange in environmental liabilities\n43 \nDecommissioning-related activities\n37 \nNuclear refueling outage costs\n(b)\n6 \nAsset impairments\n(71)\nSeparation costs\n(90)\nOther\n7 \nTotal increase\n$\n474 \n__________\n(a)\nPrimarily reflects increased employee incentive program costs, driven by stock compensation expense and Company performance exceeding relative metrics, increased headcount, and the acquisition of STP in November 2023.\n(b)\nIncludes the co-owned Salem and STP generating units.\nOther, net\n was unfavorable for the year ended December 31, 2024 compared to the same period in 2023, due to activity described in the table below:\nIncome (Deductions)\nFor the Years Ended December 31,\n2024\n2023\nDecommissioning-related activities\n(a)\n$\n567 \n$\n803 \nNon-service net periodic benefit credit (cost)\n(8)\n54 \nNet realized and unrealized gains (losses) from equity investments\n11 \n307 \nOther\n100 \n104 \nOther, net\n$\n670 \n$\n1,268 \n__________\n(a)\nIncludes net realized and net unrealized gains (losses) on NDT fund investments, the elimination of decommissioning-related activities, and the elimination of income taxes related to all NDT fund activity for the Regulatory Agreement Units. See Note 10 — Asset Retirement Obligations\n \nand Note 22 — Supplemental Financial Information of the Combined Notes to Consolidated Financial Statements for additional information.\n67\nTable of Contents\nEffective income tax rates\n \nwere 17.1%\n \nand\n \n35.1% for the years ended December 31, 2024 and\n \n2023, respectively. The change in effective tax rate in 2024 compared 2023 is primarily attributable to the inclusion of nuclear PTCs which are non-taxable. See Note 13 — Income Taxes of the Combined Notes to Consolidated Financial Statements for additional information.\nLiquidity and Capital Resources\nFor discussion of the year ended December 31, 2023 compared to the year ended December 31, 2022, refer to Liquidity and Capital Resources of MANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS in the 2023 Form 10-K which was filed with the SEC on February 27, 2024.\nAll results included throughout the liquidity and capital resources section are presented on a GAAP basis.\nOur operating and capital expenditures requirements are provided by internally generated cash flows from operations, the sale of certain receivables, as well as funds from external sources in the capital markets and through bank borrowings. Our business is capital intensive and requires considerable capital resources. We annually evaluate our financing plan and credit line sizing, focusing on maintaining our investment grade ratings while meeting our cash needs to fund capital requirements, including construction expenditures, retire debt, pay dividends, fund pension and OPEB obligations, and invest in new and existing ventures. A broad spectrum of financing alternatives beyond the core financing options can be used to meet our needs and fund growth, including monetizing assets in the portfolio via project financing, asset sales, and the use of other financing structures (e.g., joint ventures, minority partners, etc.). Our access to external financing on reasonable terms depends on our credit ratings and current overall capital market business conditions. If these conditions deteriorate to the extent that we no longer have access to the capital markets at reasonable terms, we have access to credit facilities with aggregate bank commitments of $9 billion. We utilize our credit facilities to support our commercial paper programs, provide for other short-term borrowings and to issue letters of credit. See the “Credit Matters and Cash Requirements” section below for additional information. We expect cash flows to be sufficient to meet operating expenses, financing costs, and capital expenditure requirements. See Note 16 — Debt and Credit Agreements of the Combined Notes to Consolidated Financial Statements for additional information.\nCash Flows from Operating Activities\nOur cash flows from operating activities include the sale of energy, energy-related products, and sustainable solutions, as well as sales of nuclear PTCs. Our future cash flows from operating activities may be affected by future demand for, and market prices of, energy and our ability to continue to produce and supply power at competitive costs, as well as to obtain collections from customers. \nThe following table provides a summary of the change in cash flows from operating activities for the years ended December 31, 2024 and 2023:\nFor the Years Ended December 31, \nCash flows from operating activities\n2024\n2023\n$ Change\nNet income (loss)\n$\n3,738 \n$\n1,577 \n$\n2,161 \nAdjustments to reconcile net income (loss) to cash:\nCollateral received (posted), net\n1,803 \n(1,491)\n3,294 \nOption premiums received (paid), net\n216 \n26 \n190 \nPension and non-pension postretirement benefit contributions\n(184)\n(54)\n(130)\nChanges in working capital and other noncurrent assets and liabilities\n(a)\n(9,168)\n(8,355)\n(813)\nTotal non-cash operating activities\n(b)\n1,131 \n2,996 \n(1,865)\nNet cash flows provided by (used in) operating activities\n$\n(2,464)\n$\n(5,301)\n$\n2,837 \n68\nTable of Contents\n__________\n(a)\nIncludes changes in Accounts receivable, Inventories, Accounts payable and accrued expenses, Income taxes, and Other assets and liabilities.\n(b)\nSee the Consolidated Statements of Cash Flows for details of non-cash operating activities, includes Depreciation, amortization, and accretion, Asset impairments, Gain on sale of assets and businesses, Deferred income taxes and amortization of ITCs, Net fair value changes related to derivatives, and Net realized and unrealized activity associated with NDTs and equity investments. See Note 22 — Supplemental Financial Information of the Combined Notes to Consolidated Financial Statements for additional information on the Other non-cash operating activities line.\nChanges in our cash flows from operations were generally consistent with changes in results of operations, as adjusted by changes in working capital in the normal course of business, except as discussed below. Significant operating cash flow impacts for 2024 and 2023 were as follows:\n•\nIn 2024, $1,570 million of cash was received related to the sale of nuclear PTCs. See Note 6 — Government Assistance of the Combined Notes to Consolidated Financial Statements for additional information.\n•\nDepending upon whether we are in a net mark-to-market liability or asset position, \ncollateral \nmay be required to be posted with or collected from our counterparties, respectively. In addition, the collateral posting and collection requirements differ depending on whether the transactions are on an exchange or in the over-the-counter markets. See Note 15 — Derivative Financial Instruments of the Combined Notes to Consolidated Financial Statements for additional information on collateral.\n•\nOption premiums received (paid), net\n relate to options contracts that we purchase and sell as part of our established policies and procedures to manage risks associated with market fluctuations in commodity prices. Note 15 — Derivative Financial Instruments of the Combined Notes to Consolidated Financial Statements for additional information on derivative contracts.\n•\nIncrease in cash outflows for \npension and non-pension postretirement benefit contributions\n is primarily due to our annual qualified pension contribution of $161 million and $21 million made in February 2024 and July 2023, respectively. See Note 14 — Retirement Benefits of the Combined Notes to Consolidated Financial Statements for additional information on pension and non-pension postretirement benefit plans.\n•\nA net increase in cash outflows for \nchanges in working capital and other noncurrent assets and liabilities\n primarily driven by an increase in cash collections applied to the Deferred Purchase Price (DPP) partially offset by an increase in liabilities associated with state-sponsored programs requiring refund or pass through of the nuclear PTC, as well as price changes related to natural gas purchases in 2024. See Note 7 — Accounts Receivable of the Combined Notes to Consolidated Financial Statements for additional information on the sales of customer accounts receivable.\nCash Flows from Investing Activities\nThe following table provides a summary of the change in cash flows from investing activities for the years ended December 31, 2024 and 2023:\nFor the Years Ended December 31,\nCash flows from investing activities\n2024\n2023\n$ Change\nCollection of DPP, net\n$\n10,217 \n$\n7,340 \n$\n2,877 \nAcquisitions of assets and businesses\n(32)\n(1,690)\n1,658 \nInvestment in NDT funds, net\n(277)\n(228)\n(49)\nCapital expenditures\n(2,565)\n(2,422)\n(143)\nOther investing activities\n85 \n31 \n54 \nNet cash flows provided by (used in) investing activities\n$\n7,428 \n$\n3,031 \n$\n4,397 \n69\nTable of Contents\nSignificant investing cash flow impacts for 2024 and 2023 were as follows: \n•\nCollection of DPP, net\n increased primarily due to the increased cash collections applied to DPP as a result of a decrease in the drawn Facility balance in 2024 compared to 2023. In addition, more cash collections were reinvested in the Facility in 2024. See Note 7 — Accounts Receivable of the Combined Notes to Consolidated Financial Statements for additional information.\n•\nSee Note 2 — Mergers, Acquisitions, and Dispositions of the Combined Notes to Consolidated Financial Statements for additional information related to the STP \nacquisition \nin November 2023.\n•\nVariances in \ncapital expenditures\n are primarily due to the timing of cash payments for capital projects. See the \"Credit Matters and Cash Requirements\" section below for additional information on projected capital expenditure spending.\nCash Flows from Financing Activities\nThe following table provides a summary of the change in cash flows from financing activities for the years ended December 31, 2024 and 2023:\nFor the Years Ended December 31,\nCash flows from financing activities\n2024\n2023\n$ Change\nLong-term debt, net\n$\n799 \n$\n3,027 \n$\n(2,228)\nChanges in short-term borrowings, net\n(1,644)\n485 \n(2,129)\nDividends paid on common stock\n(444)\n(366)\n(78)\nRepurchases of common stock\n(999)\n(992)\n(7)\nOther financing activities\n(1)\n42 \n(43)\nNet cash flows provided by (used in) financing activities\n$\n(2,289)\n$\n2,196 \n$\n(4,485)\nSignificant financing cash flow impacts for 2024 and 2023 were as follows:\n•\nLong-term debt, net\n varies due to debt issuances and redemptions each year. Refer to the Debt Issuances and Redemptions tables below for additional information.\n•\nChanges in short-term borrowings, net\n is driven by repayments on and issuances of notes due in less than 365 days. Refer to Note 16 — Debt and Credit Agreements of the Combined Notes to Consolidated Financial Statements for additional information. \n•\nRefer to ITEM 5. — MARKET FOR REGISTRANT'S COMMON EQUITY, RELATED STOCKHOLDER MATTERS AND ISSUER PURCHASES OF EQUITY SECURITIES for additional information on dividends. See below for quarterly\n dividends\n declared.\n•\nRepurchases of common stock\n is related to our share repurchase program that commenced in March 2023. See Note 19 — Shareholders' Equity of the Combined Notes to Consolidated Financial Statements for additional information.\n70\nTable of Contents\nDebt Issuances and Redemptions\nSee Note 16 — Debt and Credit Agreements of the Combined Notes to Consolidated Financial Statements for additional information on our long-term debt. Debt activity for 2024 and 2023 was as follows:\nDuring 2024, the following long-term debt was issued (redeemed):\nType\nInterest Rate\nMaturity\nAmount\nGreen Senior Notes\n(a)\n5.75 \n%\nMarch 2054\n$\n900 \nEnergy Efficiency Project Financing\n(b)\n2.20% - 5.51%\nMarch 2025 - April 2028\n21 \nCR Nonrecourse Debt\n3-month SOFR + 2.25% \n(c)\nDecember 2027\n(22)\nContinental Wind Nonrecourse Debt\n6.00 \n%\nFebruary 2033\n(28)\nWest Medway II Nonrecourse Debt\n1-month SOFR + 3.225%\nMarch 2026\n(36)\nAntelope Valley DOE Nonrecourse Debt\n2.29% - 3.56%\nJanuary 2037\n(26)\nRPG Nonrecourse Debt\n4.11 \n%\nMarch 2035\n(9)\nTotal long-term debt issued (redeemed)\n$\n800 \n__________\n(a)\nThe Green Senior Notes were issued to finance or refinance, in whole or in part, one or more new or existing Eligible Projects. Eligible Projects are defined as investments and expenditures made by us in the 24 months prior to or after the issuance of the notes within the following eligible green categories: clean generation fleet, clean hydrogen, energy storage, and clean commercial offerings.\n(b)\nEnergy Efficiency Project Financing represents funding to install energy conservation measures. The maturity dates represent the expected date of project completion, upon which the respective customer assumes the outstanding debt. \n(c)\nThe interest rate for long-term debt redemptions prior to July 2024 were based on SOFR + 2.76%. Beginning in July 2024 these redemptions are based on SOFR + 2.25%.\nDuring 2023, the following long-term debt was issued (redeemed):\nType\nInterest Rate\nMaturity\nAmount \n2053 Senior Notes\n6.50 \n%\nOctober 2053\n$\n900 \n2028 Senior Notes\n5.60 \n%\nMarch 2028\n750 \n2033 Senior Notes\n5.80 \n%\nMarch 2033\n600 \n2034 Senior Notes\n6.13 \n%\nJanuary 2034\n500 \nTax-Exempt Notes Reoffering\n4.10% - 4.45%\n2025 - 2053\n(a)\n435 \nEnergy Efficiency Project Financing\n(b)\n2.20% - 4.96%\nMarch 2024 - June 2024\n11 \nEnergy Efficiency Project Financing\n2.44% - 6.96%\nMay 2023 - March 2024\n(44)\nCR Nonrecourse Debt\n3-month SOFR + 2.76%\n(c)\nDecember 2027\n(39)\nWest Medway II Nonrecourse Debt\n1-month SOFR + 2.975% - 3.225%\n(d)(e)\nMarch 2026\n(26)\nContinental Wind Nonrecourse Debt\n6.00 \n%\nFebruary 2033\n(25)\nAntelope Valley DOE Nonrecourse Debt\n2.29% - 3.56%\nJanuary 2037\n(25)\nRPG Nonrecourse Debt\n4.11 \n%\nMarch 2035\n(9)\nTotal long-term debt issued (redeemed)\n$\n3,028 \n__________\n(a)\nThe Tax-exempt notes have a maturity date of March 2025 - April 2053, and a mandatory purchase date that ranges from March 2025 - June 2029.\n(b)\nFor Energy Efficiency Project Financing, the maturity dates represent the expected date of project completion, upon which the respective customer assumes the outstanding debt. \n71\nTable of Contents\n(c)\nThe interest rate for long-term debt redemptions prior to June 2023 were based on LIBOR + 2.50%. Beginning in June 2023, these redemptions are based on SOFR + 2.76%. See Note 16 — Debt and Credit Agreements of the Combined Notes to Consolidated Financial Statements for additional information on the CR nonrecourse debt.\n(d)\nThe interest rate for long-term debt redemptions prior to May 2023 were based on LIBOR + 2.875%. Beginning in May 2023, these redemptions are based on SOFR + the variable interest rate of 2.975% - 3.225%.  See Note 16 — Debt and Credit Agreements of the Combined Notes to Consolidated Financial Statements for additional information on the West Medway II nonrecourse debt.\n(e)\nThe nonrecourse debt has an average blended interest rate.\nDividends\nQuarterly dividends declared by our Board of Directors during 2024 and for the first quarter of 2025 were as follows:\nPeriod\nDeclaration Date\nShareholder of Record Date\nDividend Payable Date\nCash per Share\nFirst Quarter of 2024\nFebruary 26, 2024\nMarch 8, 2024\nMarch 19, 2024\n$\n0.3525 \nSecond Quarter of 2024\nMay 1, 2024\nMay 29, 2024\nJune 10, 2024\n$\n0.3525 \nThird Quarter of 2024\nJuly 30, 2024\nAugust 12, 2024\nSeptember 6, 2024\n$\n0.3525 \nFourth Quarter of 2024\nNovember 1, 2024\nNovember 15, 2024\nDecember 6, 2024\n$\n0.3525 \nFirst Quarter of 2025\nFebruary 18, 2025\nMarch 7, 2025\nMarch 18, 2025\n$\n0.3878 \nCredit Matters and Cash Requirements\nWe fund liquidity needs for capital expenditures, working capital, energy hedging and other financial commitments through cash flows from operations, public debt offerings, commercial paper markets and large, diversified credit facilities. As of December 31, 2024, we have access to facilities with aggregate bank commitments of $9 billion. We had access to the commercial paper markets and had availability under our revolving credit facilities during 2024 to fund our short-term liquidity needs, when necessary. We routinely review the sufficiency of our liquidity position, including appropriate sizing of credit facility commitments, by performing various stress test scenarios, such as commodity price movements, increases in margin-related transactions, changes in hedging levels, and the impacts of hypothetical credit downgrades. We closely monitor events in the financial markets and the financial institutions associated with the credit facilities, including monitoring credit ratings and outlooks, credit default swap levels, capital raising, and merger activity. See PART I, ITEM 1A. RISK FACTORS for additional information regarding the effects of uncertainty in the capital and credit markets.\nWe believe our cash flow from operating activities, access to credit markets and our credit facilities provide sufficient liquidity to support the estimated future cash requirements discussed below, including the cash consideration necessary to close on our proposed acquisition of Calpine. See Note 2 — Mergers, Acquisitions, and Dispositions of the Combined Notes to Consolidated Financial Statements for additional information.\nSecurity Ratings\nOur access to the capital markets, including the commercial paper market, and our financing costs in those markets, may depend on our securities ratings. A loss of investment grade credit rating would have required a three-notch downgrade by S&P or Moody's from their current levels as of December 31, 2024 of BBB+ and Baa1, to BB+ and Ba1 or below, respectively. As of December 31, 2024, we had $6.7 billion of available capacity under our credit facilities and $3 billion of cash on hand. In the event of a credit downgrade below investment grade and a resulting requirement to provide incremental collateral exceeding available capacity under our credit facilities and cash on hand, we would be required to access additional liquidity through the capital markets. Our borrowings are not subject to default or prepayment as a result of a downgrade of our securities, although such a downgrade could increase fees and interest charges under our credit agreements. Our credit ratings were affirmed following the announcement of our proposed acquisition of Calpine.\nIf we had lost our investment grade credit ratings as of December 31, 2024, we would have been required to provide incremental collateral estimated to be approximately $1.9 billion to meet collateral obligations for derivatives, non-derivatives, NPNS, and applicable payables and receivables, net of the contractual right of offset under master netting agreements. \n72\nTable of Contents\nSee Note 15 — Derivative Financial Instruments and Note 16 — Debt and Credit Agreements of the Combined Notes to Consolidated Financial Statements for additional information.\nCapital Expenditures\nOur most recent estimate of capital expenditures is approximately $3 billion and $3.5 billion for 2025 and 2026, respectively. Approximately 35% of projected capital expenditures are for the acquisition of nuclear fuel, which includes additional nuclear fuel to increase inventory levels in response to the potential for the continuing Russia and Ukraine conflict to impact our long-term nuclear fuel supply. Additionally, the above estimates of capital expenditures includes $1.7 billion of growth capital expenditures, including our planned restart of Crane, nuclear uprates, behind-the-meter infrastructure, and license renewals. The remaining amounts primarily reflect additions and upgrades to existing generation facilities (including material condition improvements during nuclear refueling outages). See ITEM 7. MANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS, Other Key Business Drivers for more information on the Russia and Ukraine conflict.\nPlanned additions and upgrades and other investments are subject to periodic review and revision to reflect changes in economic conditions impacting our generating assets and other factors, including, but not limited to, market power prices, results of capacity auctions, potential legislative and regulatory actions, impacts of inflation, changes in the cost of materials and labor, and financing costs.\nWe anticipate funding these capital expenditures with a combination of internally generated funds and borrowings.\nPension and Other Postretirement Benefits\nWe consider various factors when making qualified pension funding decisions, including actuarially determined minimum contribution requirements under ERISA, contributions required to avoid benefit restrictions and at-risk status as defined by the Pension Protection Act, and management of the pension obligation. The Pension Protection Act requires the attainment of certain funding levels to avoid benefit restrictions (such as an inability to pay lump sums or to accrue benefits prospectively) and at-risk status (which triggers higher minimum contribution requirements and participant notification). The contributions in the table below reflect a funding strategy to make levelized annual contributions to offset the growth of the liability. Unlike the qualified pension plans, our non-qualified pension plans are not subject to statutory minimum contribution requirements.\nOPEB plans are also not subject to statutory minimum contribution requirements, though we have funded a portion of our plans. Annually, we evaluate whether additional funding for those plans is needed.\nExpected contributions in 2025 or future years could be affected by adjustments in our pension and OPEB funding strategy, market conditions, or pension regulation changes. See Note 14 — Retirement Benefits of the Combined Notes to Consolidated Financial Statements for additional information on pension and OPEB contributions.\n73\nTable of Contents\nCash Requirements for Other Financial Commitments\n \nThe following table summarizes our projected cash payments as of December 31, 2024 under existing financial commitments with fixed or minimum payments required: \n2025\nBeyond 2025\nTotal\nTime Period\nLong-term debt\n$\n1,028 \n$\n7,446 \n$\n8,474 \n2025 - 2054\nInterest payments on long-term debt\n(a)\n438 \n5,805 \n6,243 \n2025 - 2054\nOperating leases\n(b)\n58 \n409 \n467 \n2025 - 2056\nPurchase power obligations\n(c)\n891 \n1,056 \n1,947 \n2025 - 2036\nFuel purchase agreements\n(d)\n1,381 \n8,630 \n10,011 \n2025 - 2040\nOther purchase obligations\n(e)\n1,400 \n1,992 \n3,392 \n2025 - 2057\nSNF obligation\n— \n1,366 \n1,366 \n2025 - 2040\nPension contributions\n(f)\n163 \n701 \n864 \n2025 - 2030\nTotal cash requirements\n$\n5,359 \n$\n27,405 \n$\n32,764 \n__________\n(a)\nInterest payments are estimated based on final maturity dates of debt securities outstanding at December 31, 2024 and do not reflect anticipated future refinancing, early redemptions, or debt issuances. Variable rate interest obligations are estimated based on rates as of December 31, 2024.\n(b)\nCapacity payments associated with contracted generation lease agreements are net of sublease and capacity offsets of $47 million and $230 million for 2025 and beyond 2025, respectively and $277 million in total.\n(c)\nPurchase power obligations primarily include expected payments for REC purchases and capacity payments associated with contracted generation agreements, which may be reduced based on plant availability. Expected payments exclude payments on renewable generation contracts that are contingent in nature.\n(d)\nRepresents commitments to purchase nuclear fuel and related services and natural gas-related transportation and capacity.\n(e)\nRepresents the future estimated value at December 31, 2024 of the cash flows associated with all contracts, both cancellable and non-cancellable, entered into with third parties for the provision of services and materials, entered into in the normal course of business not specifically reflected elsewhere in this table. These estimates are subject to significant variability from period to period. \n(f)\nThese amounts represent our expected contributions to our qualified pension plans.\nSee Note 18 — Commitments and Contingencies of the Combined Notes to Consolidated Financial Statements for additional information of our other commitments potentially triggered by future events. Additionally, see below for where to find additional information regarding the financial commitments in the table above in the Combined Notes to Consolidated Financial Statements.\nItem\nLocation within Combined Notes to Consolidated Financial Statements\nLong-term debt\nNote 16 — Debt and Credit Agreements\nInterest payments on long-term debt\nNote 16 — Debt and Credit Agreements\nOperating leases\nNote 11 — Leases\nSNF obligation\nNote 18 — Commitments and Contingencies\nPension contributions\nNote 14 — Retirement Benefits\nSales of Customer Accounts Receivable\nWe had an accounts receivable financing facility with a number of financial institutions and a commercial paper conduit to sell certain receivables. The facility was amended effective December 31, 2024 resulting in an increased funding limit secured by certain receivables. See Note 7 — Accounts Receivable and Note 16 — Debt and Credit Agreements\n \nof the Combined Notes to Consolidated Financial Statements for additional information.\nProject Financing\nProject financing is based upon a nonrecourse financial structure, in which project debt is paid back from the cash generated by a specific asset or portfolio of assets. Borrowings under these agreements are secured by the assets and equity of each respective project. Lenders do not have recourse against us in the event of a default. If \n74\nTable of Contents\na project financing entity does not maintain compliance with its specific debt covenants, there could be a requirement to accelerate repayment of the associated debt or other project-related borrowings earlier than the stated maturity dates. In these instances, if such repayment were not satisfied, or restructured, the lenders or security holders would generally have rights to foreclose against the project-specific assets and related collateral. The potential requirement to repay the debt or other borrowings earlier than otherwise anticipated could lead to impairments due to a higher likelihood of disposing of the respective project-specific assets significantly before the end of their useful lives. See Note 16 — Debt and Credit Agreements of the Combined Notes to Consolidated Financial Statements for additional information on project finance credit facilities and nonrecourse debt.\nCredit Facilities\nWe meet our short-term liquidity requirements primarily through the issuance of commercial paper. We may use our credit facilities for general corporate purposes, including meeting short-term funding requirements and the issuance of letters of credit. See Note 16 — Debt and Credit Agreements of the Combined Notes to Consolidated Financial Statements for additional information on our credit facilities.\nCapital Structure\n \nAt December 31, 2024, our capital structure consisted of the following:\nPercentage of Capital Structure\nLong-term debt\n38 \n%\nMember’s equity\n62 \n%\nNRC Minimum Funding Requirements\nNRC regulations require that licensees of nuclear generating facilities demonstrate reasonable assurance that sufficient funds will be available in certain minimum amounts for radiological decommissioning of the facility. These NRC minimum funding levels are typically based upon the assumption that decommissioning activities will commence after the end of the current licensed life of each unit. If a unit fails the NRC minimum funding test, then the plant’s owners or parent companies would be required to take steps, such as providing financial guarantees through surety bonds, letters of credit, or parent company guarantees or making additional cash contributions to the NDT fund to ensure sufficient funds are available. See Note 10 — Asset Retirement Obligations of the Combined Notes to Consolidated Financial Statements for additional information.\nIf a nuclear plant were to retire before the end of its licensed life, there is a risk that it will no longer meet the NRC minimum funding requirements due to the earlier commencement of decommissioning activities and a shorter time period over which the NDT funds could appreciate in value. A shortfall could require that we address the shortfall by providing additional financial assurances, such as surety bonds, letters of credit, or parent company guarantees for our share of the funding assurance. However, the amount of any assurance will ultimately depend on the decommissioning approach, the associated level of costs, and the NDT fund investment performance going forward. No later than two years after shutting down a plant, we must submit a Post-shutdown Decommissioning Activities Report (PSDAR) to the NRC that includes the planned option for decommissioning the site. \nUpon issuance of any additional financial assurance mechanisms to address a decommissioning funding shortfall, subject to satisfying various regulatory preconditions, each site would be able to utilize the respective NDT funds for radiological decommissioning costs, which represent the majority of the total expected decommissioning costs. However, under the regulations, the NRC must approve an exemption in order for us to utilize the NDT funds to pay for non-radiological decommissioning costs (i.e., spent fuel management and site restoration costs, if applicable). Any amounts not covered by an exemption would be borne by us without reimbursement. \nAs of December 31, 2024, the Crane NDT is fully funded under the SAFSTOR scenario that was the planned decommissioning option, as described in the Crane PSDAR filed with the NRC in April 2019. We will continue to file Crane's decommissioning funding status with the NRC annually until restart, at which point we will file decommissioning funding status reports in accordance with applicable NRC requirements. Additionally, as of December 31, 2024, we have adequate NDT funds for the remaining radiological decommissioning cost at Zion \n75\nTable of Contents\nStation related to the Independent Spent Fuel Storage Installation. Decommissioning costs other than radiological may require funding from us. See Note 10 — Asset Retirement Obligations of the Combined Notes to Consolidated Financial Statements for additional information.",
  "item2": null
}