{
  "source_file": "cf-20241231.htm",
  "form_type": "10-K",
  "item1": "ITEM 1.    BUSINESS.\n \nOur Company\nAll references to “CF Holdings,” “we,” “us,” “our” and “the Company,” refer to CF Industries Holdings, Inc. and its subsidiaries, except where the context makes clear that the reference is to CF Industries Holdings, Inc. only and not its subsidiaries. All references to “CF Industries” refer to CF Industries, Inc., a 100% owned subsidiary of CF Industries Holdings, Inc. References to tons refer to short tons. Notes referenced throughout this document refer to consolidated financial statement note disclosures that are found in Item 8. Financial Statements and Supplementary Data—Notes to Consolidated Financial Statements.\nOur mission is to provide clean energy to feed and fuel the world sustainably. With our employees focused on safe and reliable operations, environmental stewardship, and disciplined capital and corporate management, we are on a path to decarbonize our ammonia production network – the world’s largest – to enable low-carbon hydrogen and nitrogen products for energy, fertilizer, emissions abatement and other industrial activities. Our manufacturing complexes in the United States, Canada and the United Kingdom, an extensive storage, transportation and distribution network in North America, and logistics capabilities enabling a global reach underpin our strategy to leverage our unique capabilities to accelerate the world’s transition to clean energy. Our principal customers are cooperatives, retailers, independent fertilizer distributors, traders, wholesalers and industrial users. Our core product is anhydrous ammonia (ammonia), which contains 82% nitrogen and 18% hydrogen. Products derived from ammonia that are most often used as nitrogen fertilizers include granular urea, urea ammonium nitrate solution (UAN) and ammonium nitrate (AN). AN is also used extensively by the commercial explosives industry as a component of explosives. Products derived from ammonia that are sold primarily to industrial customers include diesel exhaust fluid (DEF), urea liquor, nitric acid and aqua ammonia. \nOur principal assets as of December 31, 2024 include:\n•\nsix U.S. manufacturing facilities, located in Donaldsonville, Louisiana (the largest ammonia production complex in the world); Sergeant Bluff, Iowa (our Port Neal complex); Yazoo City, Mississippi; Claremore, Oklahoma (our Verdigris complex); Woodward, Oklahoma; and Waggaman, Louisiana. The Waggaman facility is wholly owned by us, and the other five U.S. manufacturing facilities are wholly owned directly or indirectly by CF Industries Nitrogen, LLC (CFN), of which we own approximately 89% and CHS Inc. (CHS) owns the remainder;\n•\ntwo Canadian manufacturing facilities, located in Medicine Hat, Alberta (the largest ammonia production complex in Canada) and Courtright, Ontario; \n•\na United Kingdom manufacturing facility located in Billingham;\n•\nan extensive system of terminals and associated transportation equipment located primarily in the Midwestern United States; and\n•\na 50% interest in Point Lisas Nitrogen Limited (PLNL), an ammonia production joint venture located in Trinidad and Tobago (Trinidad) that we account for under the equity method.\nWe have a strategic venture with CHS under which CHS owns an equity interest in CFN, a subsidiary of CF Holdings, which represents approximately 11% of the membership interests of CFN. We own the remaining membership interests. CHS also receives deliveries pursuant to a supply agreement under which CHS has the right to purchase annually from CFN up to approximately 1.1 million tons of granular urea and 580,000 tons of UAN at market prices. As a result of its minority equity interest in CFN, CHS is entitled to semi-annual cash distributions from CFN. We are also entitled to semi-annual cash distributions from CFN. See Note 19—Noncontrolling Interest for additional information on our strategic venture with CHS.\nFor the years ended December 31, 2024, 2023 and 2022, we sold 18.9 million, 19.1 million and 18.3 million product tons generating net sales of $5.94 billion, $6.63 billion and $11.19 billion, respectively.\nOur principal executive offices are located outside of Chicago, Illinois, at 2375 Waterview Drive, Northbrook, Illinois 60062, and our telephone number is 847-405-2400. Our Internet website address is \nwww.cfindustries.com.\n Information made available on our website does not constitute part of this Annual Report on Form 10-K.\nWe make available free of charge on or through our Internet website, \nwww.cfindustries.com\n, all of our reports on Forms 10-K, 10-Q and 8-K and all amendments to those reports as soon as reasonably practicable after such material is filed electronically with, or furnished to, the Securities and Exchange Commission (SEC). Copies of our Corporate Governance \n1\nTable of Contents\nCF INDUSTRIES HOLDINGS, INC.\nGuidelines, Code of Corporate Conduct and charters for the Audit Committee, Compensation and Management Development Committee, Corporate Governance and Nominating Committee, and Environmental Sustainability and Community Committee of our Board of Directors (the Board) are also available on our Internet website. We will provide electronic or paper copies of these documents free of charge upon request. The SEC also maintains a website at \nwww.sec.gov\n that contains reports, proxy and information statements and other information that we file electronically with the SEC.\nOur Strategy \nAt our core, CF Industries is a producer of ammonia. We use the Haber-Bosch process to fix atmospheric nitrogen with hydrogen from natural gas to produce anhydrous ammonia, whose chemical composition is NH\n3\n. We sell the ammonia itself or upgrade it to products such as granular urea, UAN and DEF. A majority of the ammonia and ammonia-derived products we manufacture are used as fertilizer, as the nitrogen content provides energy essential for crop growth. Other important uses of our products include emissions control.\nOur strategy is to leverage our unique capabilities to accelerate the world’s transition to clean energy. We believe this strategy builds upon our leadership in ammonia production to capture emerging opportunities to produce ammonia with a lower carbon intensity (“low-carbon ammonia”) than that of ammonia produced through traditional processes. These opportunities include traditional applications in agriculture to help reduce the carbon footprint of food production and the life cycle carbon intensity of ethanol production, enabling production of sustainable aviation fuel, among other purposes. These opportunities also include new growth opportunities from energy-intensive industries, such as power generation and marine shipping, as ammonia represents an efficient mechanism to both ship and store hydrogen, as well as a clean energy fuel source in its own right as ammonia does not contain or emit carbon when combusted. Our strategy also strengthens our existing business.\nWe execute our strategy across four dimensions: \n•\ndecarbonizing our existing network to accelerate the availability of low-carbon ammonia and upgraded nitrogen products for traditional agricultural and industrial applications; \n•\nevaluating new low-carbon ammonia capacity growth to supply emerging opportunities from power generation and marine shipping, among others; \n•\nforging partnerships to accelerate our timeline, reducing risks and bridging gaps in areas where we do not have expertise; and \n•\ncollaborating to build understanding of ammonia’s clean energy capability, safety track record and regulatory environment.\nAt our Donaldsonville and Yazoo City complexes, our decarbonization projects are leveraging carbon capture and sequestration (CCS) to enable us to convert a portion of our existing ammonia production to low-carbon ammonia. CCS requires the construction of carbon dioxide (CO\n2\n) dehydration and compression units to enable process CO\n2\n captured from the ammonia production process to be transported and sequestered, which prevents approximately 60% of the CO\n2\n generated by ammonia production from being emitted to the atmosphere. Construction of the dehydration and compression unit at our Donaldsonville complex is in advanced stages, with an estimated total cost of approximately $200 million over the life of the project. Construction of the dehydration and compression unit at our Yazoo City complex is expected to cost approximately $100 million over the life of the project. For each facility we have contracted with ExxonMobil to transport and sequester the captured CO\n2 \nin permanent geologic storage. At Donaldsonville, CCS is expected to commence in 2025 and annually will sequester up to approximately 2 million metric tons of CO\n2 \nthat would otherwise have been emitted to the atmosphere. At Yazoo City, CCS is expected to commence in 2028 and annually will sequester up to approximately 500,000 metric tons of CO\n2\n that would otherwise have been emitted to the atmosphere.\n \nEach project is expected to qualify under Section 45Q of the Internal Revenue Code for tax credits per metric ton of sequestered CO\n2\n.\nDecarbonization projects in our existing network also include our electrolyzer project at our Donaldsonville complex to produce ammonia with hydrogen sourced from an electrolysis process that produces no CO\n2\n emissions. Commissioning of the 20-megawatt alkaline water electrolysis plant to produce hydrogen was suspended due to an issue experienced in the fourth quarter of 2024. Upon identification and remediation of the issue, we expect to resume commissioning activities. At full electrolyzer capacity, we will be able to produce approximately 20,000 tons of low-carbon ammonia per year.\nOur decarbonization projects also include front-end engineering and design (FEED) studies to inform our evaluation of whether, and how best, to invest in export-oriented, low-carbon ammonia capacity at our Blue Point complex in Ascension Parish, Louisiana, to supply developing clean energy markets and traditional ammonia markets where demand for low-carbon product is emerging. \n2\nTable of Contents\nCF INDUSTRIES HOLDINGS, INC.\nIn the fourth quarter of 2024, we received results from a FEED study evaluating the use of autothermal reforming (ATR) ammonia production technology alongside CCS to enable the production of low-carbon ammonia. ATR technology, when combined with CCS to capture and sequester process CO\n2 \nemissions, is expected to reduce CO\n2 \nemissions from the ammonia production process by more than 90% compared to conventional ammonia plants. The FEED study results estimate the costs of a project with these attributes to be approximately $4 billion for the approximately 1.4 million metric ton capacity greenfield ATR ammonia facility and CCS technologies. Additionally, we estimate approximately $500 million would be required for the scalable common infrastructure for our Blue Point complex, such as ammonia storage and a vessel loading dock. \nWe have entered into joint development agreements (JDAs) with two potential partners, Mitsui & Co., Ltd. and JERA Co., Inc. for the development of the greenfield low-carbon ammonia capacity. Our evaluation includes assessing whether the ammonia production technology under consideration will satisfy carbon intensity and other requirements for potential end users. Should a positive final investment decision (FID) be reached to construct greenfield low-carbon ammonia capacity at our Blue Point complex, construction and commissioning is expected to take approximately four years from a positive FID. \nIn addition to discussions with existing customers who have interest in using low-carbon ammonia for traditional applications, we are engaged in discussions regarding the supply of low-carbon ammonia for new applications. We are evaluating and are in various stages of discussions with other companies for long-term offtake and/or potential joint investments related to new and traditional applications for low-carbon ammonia. These discussions continue to advance as we gain greater clarity regarding demand for low-carbon ammonia, including associated carbon intensity requirements, government incentives and regulatory developments.  \nCompany History\nWe were founded in 1946 as Central Farmers Fertilizer Company, and were owned by a group of regional agriculture cooperatives for the first 59 years of our existence. Central Farmers became CF Industries in 1970. \nOriginally established as a fertilizer brokerage company, we expanded owning and operating fertilizer manufacturing and distribution facilities in the early 1950s with a principal objective of assured supply for our owners. At various times in our history, we manufactured and/or distributed nitrogen, phosphate and potash fertilizers.\nWe operated as a traditional manufacturing and supply cooperative until 2002, when we adopted a new business model that established financial performance as our principal objective, rather than assured supply for our owners. A critical aspect of the new business model was to establish a more economically driven approach to the marketplace.\nIn August 2005, we completed the initial public offering (IPO) of our common stock, which is listed on the New York Stock Exchange. In connection with the IPO, we consummated a reorganization transaction whereby we ceased to be a cooperative and our pre-IPO owners’ equity interests in CF Industries were cancelled in exchange for all of the proceeds of the offering and shares of our common stock. At the time of the IPO, our assets consisted of one wholly owned nitrogen manufacturing facility in Louisiana, United States; a joint venture nitrogen manufacturing facility in Alberta, Canada, of which we owned 66 percent; a phosphate mining and manufacturing operation in Florida, United States; and distribution facilities throughout North America.\nIn April 2010, we acquired Terra Industries Inc. (Terra), a leading North American producer and marketer of nitrogen fertilizer products for a purchase price of $4.6 billion, which was paid in cash and shares of our common stock. As a result of the Terra acquisition, we acquired five nitrogen fertilizer manufacturing facilities; an approximately 75.3% interest in Terra Nitrogen Company, L.P. (TNCLP), a publicly traded limited partnership; and certain joint venture interests.\nPrior to April 30, 2013, we owned 66 percent of Canadian Fertilizers Limited (CFL), a joint venture nitrogen manufacturing facility in Alberta, Canada. On April 30, 2013, CF Industries acquired all of the outstanding interests in CFL that it did not already own and CFL became our wholly owned subsidiary.\nIn March 2014, we exited our phosphate mining and manufacturing business, which was located in Florida, through a sale to The Mosaic Company. As a result, we became focused solely on nitrogen manufacturing and distribution.\nIn July 2015, we acquired the remaining 50% equity interest in CF Fertilisers UK Group Limited (formerly known as GrowHow UK Group Limited) (CF Fertilisers UK) not previously owned by us, and CF Fertilisers UK became wholly owned by us. This transaction added CF Fertilisers UK’s nitrogen manufacturing complexes in Ince, United Kingdom and Billingham, United Kingdom to our consolidated manufacturing capacity. Due to the substantial increase in the cost of natural gas in the United Kingdom, in 2022, we closed the Ince facility, and in 2023, we ceased operations of the ammonia plant at the Billingham facility, which was idled in September 2022. Since that time, we have imported ammonia for upgrade into AN and other nitrogen products at the Billingham facility.\n3\nTable of Contents\nCF INDUSTRIES HOLDINGS, INC.\nIn February 2016, our strategic venture with CHS commenced, at which time CHS made a capital contribution of $2.8 billion to CFN in exchange for membership interests in CFN, which represented approximately 11% of the total membership interests of CFN.\nIn late 2015 and 2016, we completed capacity expansion projects at our Donaldsonville complex in Louisiana and our Port Neal complex in Iowa. These projects, originally announced in 2012, included the construction of new ammonia, urea, and UAN plants at our Donaldsonville complex and new ammonia and urea plants at our Port Neal complex. These plants increased our overall production capacity by approximately 25%, improved our product mix flexibility at Donaldsonville, and improved our ability to serve upper-Midwest urea customers from our Port Neal location. The total capital cost of the capacity expansion projects was $5.2 billion.\nPrior to April 2, 2018, Terra Nitrogen, Limited Partnership, which owns and operates our Verdigris nitrogen manufacturing facility in Oklahoma, was a subsidiary of TNCLP. On April 2, 2018, Terra Nitrogen GP Inc., the sole general partner of TNCLP and an indirect wholly owned subsidiary of CF Holdings, completed its purchase of all of the publicly traded common units of TNCLP (the Purchase). Upon completion of the Purchase, CF Holdings owned, through its subsidiaries, 100 percent of the general and limited partnership interests of TNCLP. \nOn December 1, 2023, we acquired an ammonia production facility located in Waggaman, Louisiana from Dyno Nobel Louisiana Ammonia, LLC (DNLA), a U.S. subsidiary of Australia-based Incitec Pivot Limited (IPL), pursuant to an asset purchase agreement with DNLA and IPL. The facility has a nameplate capacity of 880,000 tons of ammonia annually. In connection with the closing of the acquisition on December 1, 2023, we entered into a long-term ammonia offtake agreement providing for us to supply up to 200,000 tons of ammonia per year to IPL’s Dyno Nobel, Inc. subsidiary. Under the terms of the asset purchase agreement, $425 million of the $1.675 billion purchase price, subject to adjustment, was allocated by the parties to the ammonia offtake agreement. We funded the balance of the final purchase price, after adjustment, with $1.221 billion of cash on hand.  \nProduct Tons and Nutrient Tons\nUnless otherwise stated, we measure our production and sales volume in this Annual Report on Form 10-K in product tons, which represents the weight of the product measured in short tons (one short ton is equal to 2,000 pounds). References to UAN product tons assume a 32% nitrogen content basis for production volume.  \nWe also provide certain supplementary volume information measured in nutrient tons. Nutrient tons represent the weight of the product’s nitrogen content, which varies by product. Ammonia represents 82% nitrogen content, granular urea represents 46% nitrogen content, UAN represents between 28% and 32% nitrogen content and AN represents between 29% and 35% nitrogen content.  \nReportable Segments\nOur reportable segments consist of the following segments: Ammonia, Granular Urea, UAN, AN and Other. These segments are differentiated by products. We use gross margin to evaluate segment performance and allocate resources. Total other operating costs and expenses (consisting primarily of selling, general and administrative expenses and other operating—net) and non-operating expenses (consisting primarily of interest and income taxes), are centrally managed and are not included in the measurement of segment profitability reviewed by management. See Note 22—Segment Disclosures for additional information.\n4\nTable of Contents\nCF INDUSTRIES HOLDINGS, INC.\nOur Products\n \nOur primary products are ammonia, granular urea, UAN and AN. Our historical sales by segment are shown in the following table. Net sales do not reflect amounts used internally, such as ammonia, in the manufacture of other products. \n \n2024\n2023\n2022\n \nSales Volume (tons)\nNet Sales\nSales Volume (tons)\nNet Sales\nSales Volume (tons)\nNet Sales\n \n(tons in thousands; dollars in millions)\nAmmonia\n4,085 \n$\n1,736 \n3,546 \n$\n1,679 \n3,300 \n$\n3,090 \nGranular Urea\n4,522 \n1,600 \n4,570 \n1,823 \n4,572 \n2,892 \nUAN\n6,771 \n1,678 \n7,237 \n2,068 \n6,788 \n3,572 \nAN\n1,464 \n419 \n1,571 \n497 \n1,594 \n845 \nOther\n(1)\n2,101 \n503 \n2,206 \n564 \n2,077 \n787 \nTotal\n18,943 \n$\n5,936 \n19,130 \n$\n6,631 \n18,331 \n$\n11,186 \n_______________________________________________________________________________\n(1)\nOther segment products primarily include DEF, urea liquor, nitric acid and aqua ammonia.\nGross margin was $2.06 billion, $2.55 billion and $5.86 billion for the years ended December 31, 2024, 2023 and 2022, respectively.\nWe own and operate eight manufacturing facilities in North America, including six manufacturing facilities in the United States, and two in Canada. As of December 31, 2024, the combined production capacity of these eight facilities represented approximately 40%, 40%, 44% and 19% of North American ammonia, granular urea, UAN and AN production capacity, respectively. Each of our manufacturing facilities in North America has on-site storage to provide flexibility to manage the flow of outbound shipments without impacting production. Our United Kingdom manufacturing facility produces AN and primarily serves the agricultural and industrial markets in the United Kingdom.\nThe following table shows the production capacities as of December 31, 2024 at each of our manufacturing facilities: \n \nAverage Annual Capacity\n(1)\n \nGross\nAmmonia\n(2)\nNet\nAmmonia\n(2)\nUAN\n(3)\nUrea\n(4)\nAN\n(5)\nOther\n(6)\n \n(tons in thousands)\nDonaldsonville (Louisiana)\n(7)(8)\n4,335 \n1,390 \n3,255 \n2,635 \n— \n445 \nMedicine Hat (Alberta)\n1,230 \n770 \n— \n810 \n— \n— \nPort Neal (Iowa)\n1,230 \n65 \n800 \n1,350 \n— \n290 \nVerdigris (Oklahoma)\n(8)\n1,210 \n430 \n1,955 \n— \n— \n— \nWaggaman (Louisiana)\n880 \n880 \n— \n— \n— \n— \nWoodward (Oklahoma)\n480 \n130 \n810 \n— \n— \n115 \nYazoo City (Mississippi)\n(8)(9)\n570 \n— \n160 \n— \n1,035 \n125 \nCourtright (Ontario)\n(8)(10)\n500 \n265 \n345 \n— \n— \n400 \nBillingham (U.K.)\n(8)\n— \n— \n— \n— \n595 \n410 \n10,435 \n3,930 \n7,325 \n4,795 \n1,630 \n1,785 \nUnconsolidated Affiliate\n \n \n \n \n \n \nPLNL (Trinidad)\n(11)\n360 \n360 \n— \n— \n— \n— \nTotal\n10,795 \n4,290 \n7,325 \n4,795 \n1,630 \n1,785 \n_______________________________________________________________________________\n(1)\nAverage annual capacity includes allowance for normal outages and planned maintenance shutdowns.\n(2)\nGross ammonia capacity includes ammonia used to produce upgraded products. Net ammonia capacity is gross ammonia capacity less ammonia used to produce upgraded products based on the product mix shown in the table.\n(3)\nMeasured in tons of UAN containing 32% nitrogen by weight.\n(4)\nReflects granular urea capacity from the Donaldsonville, Medicine Hat, and Port Neal facilities. Urea liquor and DEF production capacities are included in Other.\n(5)\nAN includes prilled products (Amtrate and industrial-grade AN, or IGAN) and AN solution produced for sale.\n(6)\nIncludes product tons of: urea liquor and DEF from the Donaldsonville, Port Neal, Woodward, Yazoo City, and Courtright facilities; and nitric acid from the Billingham facility. Production of DEF can be increased by reducing urea and/or UAN production.\n5\nTable of Contents\nCF INDUSTRIES HOLDINGS, INC.\n(7)\nThe Donaldsonville facility capacities present an estimated production mix. This facility is capable of producing between 2.4 million and 3.3 million tons of granular urea and between 1.2 million and 4.3 million tons of UAN annually. The facility is also capable of producing up to 1.2 million product tons of 32.5% DEF.\n(8)\nReduction of UAN or AN production at the Yazoo City, Courtright, Verdigris, Donaldsonville and Billingham facilities can allow more merchant nitric acid to be made available for sale.\n(9)\nThe Yazoo City facility’s production capacity depends on product mix. With the facility maximizing the production of AN products, 160,000 tons of UAN can be produced. UAN production can be increased to 450,000 tons by reducing the production of AN to 900,000 tons.\n(10)\nProduction of urea liquor and DEF at the Courtright facility can be increased by reducing UAN production.\n(11)\nRepresents our 50% interest in the capacity of PLNL.\nThe following table summarizes our production volume for the last three years: \n \nDecember 31,\n \n2024\n2023\n2022\n \n(tons in thousands)\nAmmonia\n(1)\n9,800 \n9,496 \n9,807 \nGranular urea\n4,404 \n4,544 \n4,561 \nUAN (32%)\n6,753 \n6,852 \n6,706 \nAN\n1,392 \n1,520 \n1,517 \n_______________________________________________________________________________\n(1)\nGross ammonia production, including amounts subsequently upgraded on-site into granular urea, UAN or AN.\nManufacturing Facilities\nDonaldsonville, Louisiana\nThe Donaldsonville facility is the world’s largest and most flexible ammonia production complex. It has six ammonia plants, five urea plants, four nitric acid plants, three UAN plants, and one DEF plant. The complex, which is located on the Mississippi River, includes deep-water docking facilities, access to an ammonia pipeline, and truck and railroad loading capabilities. The complex has on-site storage for 139,000 tons of ammonia, 202,000 tons of UAN (measured on a 32% nitrogen content basis) and 130,000 tons of granular urea.\nMedicine Hat, Alberta, Canada\nThe Medicine Hat facility, located in southeast Alberta, is the largest ammonia production complex in Canada. It has two ammonia plants and one urea plant. The complex has on-site storage for 55,000 tons of ammonia and 55,000 tons of granular urea.\nSergeant Bluff, Iowa (the Port Neal facility)\nThe Port Neal facility is located approximately 12 miles south of Sioux City, Iowa, on the Missouri River in Sergeant Bluff, Iowa. The facility consists of two ammonia plants, three urea plants, two nitric acid plants and one UAN plant. The location has on-site storage for 82,000 tons of ammonia, 130,000 tons of granular urea, and 100,000 tons of 32% UAN.\nClaremore, Oklahoma (the Verdigris facility) \nThe Verdigris facility is located northeast of Tulsa, Oklahoma, near the Verdigris River, in Claremore, Oklahoma. It is the second largest UAN production facility in North America. The facility consists of two ammonia plants, two nitric acid plants, two UAN plants and a port terminal. We lease the port terminal from the Tulsa-Rogers County Port Authority. The complex has on-site storage for 57,000 tons of ammonia and 102,000 tons of 32% UAN.\nWaggaman, Louisiana\nThe Waggaman facility is located near New Orleans, Louisiana on the Mississippi River approximately 60 miles southeast of the Donaldsonville facility. The facility consists of one ammonia plant, has access to an ammonia pipeline, and has on-site storage for approximately 39,000 tons of ammonia. \n6\nTable of Contents\nCF INDUSTRIES HOLDINGS, INC.\nWoodward, Oklahoma\nThe Woodward facility is located in rural northwest Oklahoma and consists of one ammonia plant, two nitric acid plants, two urea plants and two UAN plants. The facility has on-site storage for 34,000 tons of ammonia and 84,000 tons of 32% UAN.\nYazoo City, Mississippi\nThe Yazoo City facility is located in central Mississippi and includes one ammonia plant, four nitric acid plants, one AN plant, two urea plants, one UAN plant and a dinitrogen tetroxide production and storage facility. The site has on-site storage for 48,000 tons of ammonia, 47,000 tons of 32% UAN and 10,000 tons of AN and related products.\nCourtright, Ontario, Canada\nThe Courtright facility is located south of Sarnia, Ontario near the St. Clair River. The facility consists of an ammonia plant, a UAN plant, a nitric acid plant and a urea plant. The location has on-site storage for 61,000 tons of ammonia and 16,000 tons of 32% UAN.\nBillingham, United Kingdom\nThe Billingham facility, located in the Teesside chemical area in northeastern England, is geographically split among three primary locations: the main site, which contains three nitric acid plants; the Portrack site, approximately two miles away, which contains one AN fertilizer plant; and the North Tees site, approximately seven miles away, which contains an ammonia storage area. These locations collectively have on-site storage for 37,000 tons of ammonia and 138,000 tons of AN. In addition, we previously operated an ammonia plant at the main site of the Billingham facility. However, in September 2022, we idled ammonia production at the facility. Since that time, we have imported ammonia for upgrade at the facility into AN and other nitrogen products. In the third quarter of 2023, we approved our plan to permanently close the ammonia plant at the Billingham facility.\nPoint Lisas, Trinidad\nThe Point Lisas facility in Trinidad is owned jointly through a 50/50 venture with Koch Fertilizer LLC. This facility has the capacity to produce 720,000 tons of ammonia annually from natural gas supplied under a contract with The National Gas Company of Trinidad and Tobago Limited (NGC).\nNitrogen Product Raw Materials\nNatural gas is the principal raw material and primary fuel source used in the ammonia production process at our nitrogen manufacturing facilities. In 2024, natural gas accounted for approximately 28% of our total production costs for nitrogen products. Our nitrogen manufacturing facilities have access to abundant, competitively-priced natural gas through a reliable network of pipelines that are connected to major natural gas trading hubs. Our facilities utilize the following natural gas hubs: Henry Hub in Louisiana, SONAT and TETCO ELA in Mississippi; ONEOK in Oklahoma; AECO in Alberta; Ventura in Iowa; Demarcation in Kansas; Welcome in Minnesota; Dawn and Parkway in Ontario; and the National Balancing Point (NBP) in the United Kingdom.\nIn 2024, our manufacturing facilities consumed, in the aggregate, approximately 345 million MMBtus of natural gas. We employ a combination of daily spot and term purchases from a variety of quality suppliers to maintain a reliable, competitively-priced supply of natural gas. We also use certain financial instruments to hedge natural gas prices. See Note 17—Derivative Financial Instruments for additional information about our natural gas hedging activities.\nNitrogen Product Distribution\nThe safe, efficient and economical distribution of nitrogen products is critical for successful operations. Our nitrogen production facilities have access to multiple transportation modes by which we ship products to terminals, warehouses and customers. Each of our production facilities has a unique distribution pattern based on its production capacity and location.\nOur North American nitrogen production facilities can ship products via truck and rail to customers and to our storage facilities in the U.S. and Canada, with access to our leased railcar fleet of approximately 4,800 tank and hopper cars, as well as railcars provided by rail carriers. Our United Kingdom nitrogen production facility mainly ships products via truck. \nThe North American waterway system is also used extensively to ship products from our Donaldsonville, Verdigris and Yazoo City facilities. To ship ammonia and UAN, we employ a fleet of up to eleven tow boats and thirty-six river barges, which are primarily leased. We also utilize contract marine services to move granular urea and AN. We can also export nitrogen products via seagoing vessels from our Donaldsonville and Billingham manufacturing facilities.\n7\nTable of Contents\nCF INDUSTRIES HOLDINGS, INC.\nThe Donaldsonville and Waggaman facilities are connected to the 2,000-mile long Sunoco ammonia pipeline through which we have the ability to transport ammonia to ten Company-owned terminals and additional shipping points in the Midwestern U.S. corn belt.\nStorage Facilities and Other Properties\nAs of December 31, 2024, we owned or leased space at 41 in-market storage terminals and warehouses located in a 19-state region of the United States, Canada and the United Kingdom. Including storage at our production facilities, we have an aggregate storage capacity for approximately 2.8 million tons of product. Our storage capabilities are summarized in the following table: \n \nAmmonia\nGranular Urea\nUAN\n(1)\nAN\n \nNumber of\nFacilities\nCapacity\n(000 Tons)\nNumber of\nFacilities\nCapacity\n(000 Tons)\nNumber of\nFacilities\nCapacity\n(000 Tons)\nNumber of\nFacilities\nCapacity\n(000 Tons)\nPlants\n9 \n552 \n3 \n315 \n6 \n551 \n2 \n148 \nTerminal and Warehouse Locations\nOwned\n(2)\n21 \n735 \n— \n— \n9 \n236 \n— \n— \nLeased\n(3)\n5 \n69 \n3 \n23 \n13 \n188 \n— \n— \nTotal In-Market\n26 \n804 \n3 \n23 \n22 \n424 \n— \n— \nTotal Storage Capacity\n1,356 \n338 \n975 \n148 \n_______________________________________________________________________________\n(1)\nCapacity is expressed as the equivalent volume of UAN measured on a 32% nitrogen content basis.\n(2)\nThe owned facilities that store UAN also can store ammonia.\n(3)\nOur lease agreements are typically for periods of one to four years and commonly contain provisions for automatic renewal that can extend the lease term unless cancelled by either party.\nCustomers\nThe principal customers for our nitrogen products are cooperatives, retailers, independent fertilizer distributors, traders, wholesalers and industrial users. Sales are generated by our internal marketing and sales force. CHS was our largest customer in 2024 and accounted for approximately 12% of our consolidated net sales. We have a strategic venture with CHS under which CHS has a minority equity interest in CFN. See Note 19—Noncontrolling Interest for additional information on our strategic venture with CHS. \nCompetition\nOur markets are global and intensely competitive, based primarily on delivered price and, to a lesser extent, on reliability, customer service and product quality. During the peak demand periods, product availability and delivery time also play a role in the buying decisions of customers. \nOur primary competitors with North American operations include Nutrien Ltd., Koch Fertilizer LLC, LSB Industries, CVR Partners, LP and Yara International. There is also significant competition from products sourced from other regions of the world, including some with lower natural gas or other feedstock costs, which may include the benefit of government subsidies. Because ammonia, urea and UAN are widely-traded fertilizer products and there are limited barriers to entry, we experience competition from foreign-sourced products continuously. Producers of nitrogen-based fertilizers located in the Middle East, Trinidad, Africa and Russia have been major exporters to North America in recent years.\nOur primary United Kingdom competition comes from imported products supplied by companies including Yara International, Origin Fertilisers, Ameropa and Thomas Bell & Sons Ltd. Urea and UAN are not produced in the United Kingdom, but along with AN are widely-traded fertilizer products with limited barriers to entry. \nSeasonality\nThe fertilizer business is seasonal. The degree of seasonality of our business can change significantly from year to year due to weather conditions in the agricultural industry and other factors. The strongest demand for our products in North America occurs during the spring planting season, with a second period of strong demand following the fall harvest. However, we and other fertilizer producers generally manufacture and distribute products throughout the year. As a result, we and/or our customers generally build inventories during the low demand periods of the year to ensure timely product availability during the peak sales seasons. Seasonality is greatest for ammonia due to the short application season and the limited ability of our \n8\nTable of Contents\nCF INDUSTRIES HOLDINGS, INC.\ncustomers and their customers to store significant quantities of this product. The seasonality of fertilizer demand generally results in our sales volumes and net sales being the highest during the spring and our working capital requirements being the highest just prior to the start of the spring planting season. Our quarterly financial results can vary significantly from one year to the next due to weather-related shifts in planting and application schedules and purchasing patterns as well as import timing, import and distribution costs and logistical limitations, such as river conditions.\nEnvironmental, Health and Safety\nWe are subject to numerous environmental, health and safety laws and regulations in the United States, Canada, the United Kingdom, Trinidad and other locations, including laws and regulations relating to the generation, handling and disposal of hazardous substances and wastes; the cleanup of hazardous substance releases; the discharge of regulated substances to air or water; and the demolition of existing plant sites upon permanent closure. In the United States, these laws include the Clean Air Act, the Clean Water Act, the Resource Conservation and Recovery Act (RCRA), the Comprehensive Environmental Response, Compensation, and Liability Act (CERCLA), the Toxic Substances Control Act (TSCA), the Occupational Safety and Health Act (OSHA) and various other federal, state and local statutes. Violations of environmental, health and safety laws can result in substantial penalties, court orders to install pollution-control equipment, civil and criminal sanctions, permit revocations and facility shutdowns. In addition, environmental, health and safety laws and regulations may impose joint and several liability, without regard to fault, for cleanup costs on potentially responsible parties who have released or disposed of hazardous substances into the environment or who own or operate property where hazardous substances have been released or disposed of by other parties. We may be subject to more stringent enforcement of existing or new environmental, health and safety laws in the future. In addition, we are also subject to certain environmental, health and safety laws of jurisdictions where we introduce products, chemicals, or substances into a market. \nEnvironmental, Health and Safety Expenditures \nOur environmental, health and safety capital expenditures in 2024 totaled approximately $30 million. We estimate that we will have approximately $49 million of environmental, health and safety capital expenditures in 2025. In addition, to support safe and reliable operations at our continuous process manufacturing facilities, we conduct scheduled inspections, replacements and overhauls of our plant machinery and equipment, which are referred to as turnarounds or outages. A further description of turnaround activities is included in Note 8—Property, Plant and Equipment—Net in the notes to consolidated financial statements included in Item 8 of this report. Environmental, health and safety laws and regulations are complex and change frequently. We expect that continued government and public emphasis on environmental issues will result in increased future expenditures for environmental controls at our manufacturing and distribution facilities. Such expenditures could have a material adverse effect on our business, financial condition, results of operations and cash flows. Additionally, future environmental, health and safety laws and regulations or reinterpretation of current laws and regulations may require us to make substantial expenditures. Our costs to comply with, or any liabilities under, these laws and regulations could have a material adverse effect on our business, financial condition, results of operations and cash flows.\nCERCLA/Remediation Matters \nFrom time to time, we receive notices from governmental agencies or third parties alleging that we are a potentially responsible party at certain cleanup sites under CERCLA or other environmental cleanup laws. In 2011, we received a notice from the Idaho Department of Environmental Quality (IDEQ) that alleged that we were a potentially responsible party for the cleanup of a former phosphate mine site we owned in the late 1950s and early 1960s located in Georgetown Canyon, Idaho. The current owner of the property and a former mining contractor received similar notices for the site. In 2014, we and the current property owner entered into a Consent Order with IDEQ and the U.S. Forest Service to conduct a remedial investigation and feasibility study of the site. The remedial investigation was submitted to the agencies in 2021. The next step will be a risk assessment, followed by a feasibility study, and then a decision on remediation at the site. In 2015, we and several other parties received a notice that the U.S. Department of the Interior and other trustees intended to undertake a natural resource damage assessment for 18 former phosphate mines and three former processing facilities in southeast Idaho. The Georgetown Canyon former mine and processing facility was included in the group of former mines and processing facilities identified by the trustees. In June 2021, we received another notice from the U.S. Department of the Interior that the natural resource damage trustees were commencing a ‘subsequent’ phase of the natural resource damage assessment, but no further details were provided with respect to said assessment. Because the former Georgetown Canyon mine site is still in the risk assessment and feasibility study stage, we are not able to estimate at this time our potential liability, if any, with respect to the cleanup of the site or a possible claim for natural resource damages. However, based on the results of the site investigation conducted to date, we do not expect the remedial or financial obligations to which we may be subject involving this or other cleanup sites will have a material adverse effect on our consolidated financial position, results of operations or cash flows. \n9\nTable of Contents\nCF INDUSTRIES HOLDINGS, INC.\nRegulation of Greenhouse Gases \nOur production facilities emit greenhouse gases (GHGs), such as carbon dioxide (CO\n2\n) and nitrous oxide. Natural gas, a fossil fuel, is a primary raw material used in our nitrogen production process. We are subject to GHG regulations in the United Kingdom, Canada and the United States.\nOur U.K. manufacturing plant is required to report GHG emissions annually to the United Kingdom Environment Agency pursuant to its site Environmental Permits and Climate Change Agreement, which specifies energy efficiency targets. Failure to meet efficiency targets may require the plant to purchase CO\n2\n emissions allowances. Our U.K. manufacturing plant is subject to the UK Emissions Trading Scheme (UK ETS), which generally requires us to hold or obtain emission allowances to offset GHG emissions from those aspects of our operations that are subject to regulation under this program.\nIn Canada, we are required to conduct an annual review of our operations with respect to compliance with Environment Canada’s National Pollutant Release Inventory, Ontario’s Mandatory Monitoring and Reporting Regulation, and the GHG Reporting Regulation. In addition, our manufacturing plants in Alberta and Ontario are subject to provincial or federal laws that impose a price on excess GHG emissions. Each of these laws establishes carbon dioxide equivalent (CO\n2\ne) emissions standards applicable to our facilities in terms of emissions per unit of production, with the provincial laws and the federal law using different formulas for establishing the intensity-based limits and the reductions in these limits over time. The federal law is the Greenhouse Gas Pollution Pricing Act, which came into effect in 2018 and is intended to function only as a backstop to the provincial programs if such programs do not meet minimum federal criteria. In 2022, the federal government found that both the Alberta and Ontario programs for 2023-2030 met such minimum criteria, and therefore, the provincial laws apply. Effective January 1, 2023, these provincial regulations increased in stringency from 2022 levels, and we expect that the regulations will continue to increase in stringency going forward as Canada continues to work toward its stated goal of net zero GHG emissions by 2050. If a facility’s CO\n2\ne emissions exceed the applicable limit, the excess emissions must be offset, either through obtaining qualifying emission credits or by making a payment for each ton of excess emissions. For calendar year 2025, the excess emissions fee under the federal, Alberta and Ontario regulatory programs is CAD $95 per metric ton, which fee will increase by CAD $15 per metric ton per year, reaching CAD $170 per metric ton by 2030.\nIn the United States, GHG regulation is evolving at state, regional and federal levels, although some of the more significant developments to date, including efforts of the United States Environmental Protection Agency (EPA) to regulate GHG emissions from fossil fuel-fired power plants, do not directly impose obligations on our facilities. Pursuant to an EPA GHG reporting rule, all of our U.S. manufacturing facilities, which are considered large emitters of GHGs, are required to monitor GHG emissions and report the previous year’s emissions annually. In addition, if we seek to modify or expand any of our major facilities and as a result, are required to obtain a Prevention of Significant Deterioration (PSD) construction permit applicable to such facilities, we could be subject to pollution control requirements applicable to GHGs in addition to requirements applicable to conventional air pollutants. Such requirements may result in increased costs or delays in completing such projects. Other than the states’ implementation of this permitting requirement, none of the states where our U.S. production facilities are located – Iowa, Louisiana, Mississippi and Oklahoma – has proposed control regulations limiting GHG emissions.\nIncreasing concern over the impacts of climate change is driving countries to establish ever more ambitious GHG reduction targets. Approximately 200 countries, including the United States, Canada, the United Kingdom and the members of the EU have joined the Paris Agreement, an international agreement intended to provide a framework pursuant to which the parties to the agreement will attempt to hold the increase in global average temperatures to below 2°C above pre-industrial levels and to pursue efforts to limit the temperature increase to 1.5°C above pre-industrial levels. Each signatory is required to develop its own national plan to attain this objective. In December 2020, the United Kingdom announced a target to reduce GHG emissions 68% from the baseline year of 1990 by 2030. Canada has increased its emissions reduction target under the Paris Agreement to 40-45% below 2005 levels by 2030, up from 30%. While the United States has previously been a party to the Paris Agreement and as recently as April 2021 increased its goal to reduce GHG emissions to 50-52% below 2005 levels by 2030, the  Trump Administration issued executive orders on January 20, 2025 that seek to undo many of the preceding administration’s climate-focused initiatives and to expand the use of fossil energy, including ordering the withdrawal of the United States from the Paris Agreement, revoking prior climate-focused executive orders, directing the EPA to submit a report on the “legality and continuing applicability” of its 2009 endangerment finding related to GHGs under the Clean Air Act and to issue guidance on the social cost of carbon, including whether it should be eliminated, and pausing clean energy disbursement under the Inflation Reduction Act of 2022. There exists significant uncertainty with respect to how climate policy and GHG regulation will develop in the United States in the coming years.\n10\nTable of Contents\nCF INDUSTRIES HOLDINGS, INC.\nRegulatory Permits and Approvals\nWe hold numerous environmental and other governmental permits and approvals authorizing operations at each of our facilities. A decision by a government agency to deny or delay issuing a new or renewed regulatory material permit or approval, or to revoke or substantially modify an existing material permit or approval, could have a material adverse effect on our ability to continue operations at the affected facility. Any future expansion of our existing operations is also predicated upon securing the necessary environmental or other permits or approvals. More stringent environmental standards may impact our ability to obtain such permits. \nHuman Capital Resources\n \nOur long-term success depends on our people. We are dedicated to creating a workplace where employees are proud to work and grow and where everyone feels empowered to do their best work. We do this by investing in extensive recruitment, training and professional development opportunities for our employees and fostering a culture of inclusion and engagement.  \nEmployee Population.  \nWe employed approximately 2,800 employees at December 31, 2024, of which 79% were located in the United States, 15% in Canada, and 6% in the United Kingdom. As of December 31, 2024, approximately 10% of our employees have worked for the Company more than 20 years, 25% of our employees have worked for the Company between 11 and 20 years, 22% of our employees have worked for the Company between 6 and 10 years, and 43% of our employees have worked at the Company for less than 6 years. Full-time employees represented nearly 100% of our workforce as of December 31, 2024 and approximately 6% were covered by collective bargaining agreements. We supplement our workforce with contractors with specialized skill sets during periods of peak activity, such as during turnarounds and maintenance events.\nWorkforce Health and Safety.\n  Operating in a safe and responsible manner is a core value and an integral part of what sets the Company apart. We believe that focusing on leading indicators — such as the behavioral safety practices we have incorporated into our annual incentive plan — to drive and measure activities that prevent safety incidents, results in our industry-leading safety record. As of December 31, 2024, our employee 12-month rolling average recordable incident rate (RIR) was 0.31 incidents per 200,000 work hours, and during the year ended December 31, 2024, our total recordable injury/illness count was nine, including one fatality. For the year ended December 31, 2024, our days away, restricted or transferred (DART) incident rate was 0.17 injuries per 200,000 work hours, and our lost time incident rate was 0.07 injuries per 200,000 work hours.  \n11\nTable of Contents\nCF INDUSTRIES HOLDINGS, INC.",
  "item7": "ITEM 7.    MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS.\nYou should read the following discussion and analysis in conjunction with the consolidated financial statements and related notes included in Item 8. Financial Statements and Supplementary Data. All references to “CF Holdings,” “we,” “us,” “our” and “the Company” refer to CF Industries Holdings, Inc. and its subsidiaries, except where the context makes clear that the reference is to CF Industries Holdings, Inc. only and not its subsidiaries. All references to “CF Industries” refer to CF Industries, Inc., a 100% owned subsidiary of CF Industries Holdings, Inc. References to tons refer to short tons. Notes referenced in this discussion and analysis refer to the notes to consolidated financial statements that are found in Item 8. Financial Statements and Supplementary Data—Notes to Consolidated Financial Statements. For a discussion and analysis of the year ended December 31, 2023 compared to the year ended December 31, 2022, see Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations in our 2023 Annual Report on Form 10-K filed with the Securities and Exchange Commission (SEC) on February 22, 2024. The following is an outline of the discussion and analysis included herein:\n•\nOverview of CF Holdings\n•\nMarket Conditions\n•\nFinancial Executive Summary\n•\nAcquisition of Waggaman Ammonia Production Facility\n•\nItems Affecting Comparability of Results\n•\nConsolidated Results of Operations\n•\nOperating Results by Business Segment\n•\nLiquidity and Capital Resources\n•\nCritical Accounting \nEstimates\n•\nRecent Accounting Pronouncements\nOverview of CF Holdings \nOur Company\nOur mission is to provide clean energy to feed and fuel the world sustainably. With our employees focused on safe and reliable operations, environmental stewardship, and disciplined capital and corporate management, we are on a path to decarbonize our ammonia production network – the world’s largest – to enable low-carbon hydrogen and nitrogen products for energy, fertilizer, emissions abatement, and other industrial activities. Our manufacturing complexes in the United States, Canada and the United Kingdom, an extensive storage, transportation and distribution network in North America, and logistics capabilities enabling a global reach underpin our strategy to leverage our unique capabilities to accelerate the world’s transition to clean energy. Our principal customers are cooperatives, retailers, independent fertilizer distributors, traders, wholesalers and industrial users. Our core product is anhydrous ammonia (ammonia), which contains 82% nitrogen and 18% hydrogen. Products derived from ammonia that are most often used as nitrogen fertilizers include granular urea, urea ammonium nitrate solution (UAN) and ammonium nitrate (AN). AN is also used extensively by the commercial explosives industry as a component of explosives. Products derived from ammonia that are sold primarily to industrial customers include diesel exhaust fluid (DEF), urea liquor, nitric acid and aqua ammonia. \nOur principal assets as of December 31, 2024 include:\n•\nsix U.S. manufacturing facilities, located in Donaldsonville, Louisiana (the largest ammonia production complex in the world); Sergeant Bluff, Iowa (our Port Neal complex); Yazoo City, Mississippi; Claremore, Oklahoma (our Verdigris complex); Woodward, Oklahoma; and Waggaman, Louisiana. The Waggaman facility is wholly owned by us, and the other five U.S. manufacturing facilities are wholly owned directly or indirectly by CF Industries Nitrogen, LLC (CFN), of which we own approximately 89% and CHS Inc. (CHS) owns the remainder (see Note 19—Noncontrolling Interest for additional information on our strategic venture with CHS);\n•\ntwo Canadian manufacturing facilities, located in Medicine Hat, Alberta (the largest ammonia production complex in Canada) and Courtright, Ontario;\n•\na United Kingdom manufacturing facility located in Billingham;\n•\nan extensive system of terminals and associated transportation equipment located primarily in the Midwestern United States; and\n30\nTable of Contents\nCF INDUSTRIES HOLDINGS, INC.\n•\na 50% interest in Point Lisas Nitrogen Limited (PLNL), an ammonia production joint venture located in Trinidad and Tobago (Trinidad) that we account for under the equity method.\nOur Strategy \nAt our core, CF Industries is a producer of ammonia. We use the Haber-Bosch process to fix atmospheric nitrogen with hydrogen from natural gas to produce anhydrous ammonia, whose chemical composition is NH\n3\n. We sell the ammonia itself or upgrade it to products such as granular urea, UAN and DEF. A majority of the ammonia and ammonia-derived products we manufacture are used as fertilizer, as the nitrogen content provides energy essential for crop growth. Other important uses of our products include emissions control.\nOur strategy is to leverage our unique capabilities to accelerate the world’s transition to clean energy. We believe this strategy builds upon our leadership in ammonia production to capture emerging opportunities to produce ammonia with a lower carbon intensity (“low-carbon ammonia”) than that of ammonia produced through traditional processes. These opportunities include traditional applications in agriculture to help reduce the carbon footprint of food production and the life cycle carbon intensity of ethanol production, enabling production of sustainable aviation fuel, among other purposes. These opportunities also include new growth opportunities from energy-intensive industries, such as power generation and marine shipping, as ammonia represents an efficient mechanism to both ship and store hydrogen, as well as a clean energy fuel source in its own right as ammonia does not contain or emit carbon when combusted. Our strategy also strengthens our existing business.\nWe execute our strategy across four dimensions: \n•\ndecarbonizing our existing network to accelerate the availability of low-carbon ammonia and upgraded nitrogen products for traditional agricultural and industrial applications; \n•\nevaluating new low-carbon ammonia capacity growth to supply emerging opportunities from power generation and marine shipping, among others; \n•\nforging partnerships to accelerate our timeline, reducing risks and bridging gaps in areas where we do not have expertise; and \n•\ncollaborating to build understanding of ammonia’s clean energy capability, safety track record and regulatory environment.\nAt our Donaldsonville and Yazoo City complexes, our decarbonization projects are leveraging carbon capture and sequestration (CCS) to enable us to convert a portion of our existing ammonia production to low-carbon ammonia. CCS requires the construction of carbon dioxide (CO\n2\n) dehydration and compression units to enable process CO\n2\n captured from the ammonia production process to be transported and sequestered, which prevents approximately 60% of the CO\n2\n generated by ammonia production from being emitted to the atmosphere. Construction of the dehydration and compression unit at our Donaldsonville complex is in advanced stages, with an estimated total cost of approximately $200 million over the life of the project. Construction of the dehydration and compression unit at our Yazoo City complex is expected to cost approximately $100 million over the life of the project. For each facility we have contracted with ExxonMobil to transport and sequester the captured CO\n2 \nin permanent geologic storage. At Donaldsonville, CCS is expected to commence in 2025 and annually will sequester up to approximately 2 million metric tons of CO\n2 \nthat would otherwise have been emitted to the atmosphere. At Yazoo City, CCS is expected to commence in 2028 and annually will sequester up to approximately 500,000 metric tons of CO\n2 \nthat would otherwise have been emitted to the atmosphere.\n \nEach project is expected to qualify under Section 45Q of the Internal Revenue Code for tax credits per metric ton of sequestered CO\n2\n.\nDecarbonization projects in our existing network also include our electrolyzer project at our Donaldsonville complex to produce ammonia with hydrogen sourced from an electrolysis process that produces no CO\n2\n emissions. Commissioning of the 20-megawatt alkaline water electrolysis plant to produce hydrogen was suspended due to an issue experienced in the fourth quarter of 2024. Upon identification and remediation of the issue, we expect to resume commissioning activities. At full electrolyzer capacity, we will be able to produce approximately 20,000 tons of low-carbon ammonia per year.\nOur decarbonization projects also include front-end engineering and design (FEED) studies to inform our evaluation of whether, and how best, to invest in export-oriented, low-carbon ammonia capacity at our Blue Point complex in Ascension Parish, Louisiana, to supply developing clean energy markets and traditional ammonia markets where demand for low-carbon product is emerging. \nIn the fourth quarter of 2024, we received results from a FEED study evaluating the use of autothermal reforming (ATR) ammonia production technology alongside CCS to enable the production of low-carbon ammonia. ATR technology, when combined with CCS to capture and sequester process CO\n2 \nemissions, is expected to reduce CO\n2 \nemissions from the ammonia \n31\nTable of Contents\nCF INDUSTRIES HOLDINGS, INC.\nproduction process by more than 90% compared to conventional ammonia plants. The FEED study results estimate the costs of a project with these attributes to be approximately $4 billion for the approximately 1.4 million metric ton capacity greenfield ATR ammonia facility and CCS technologies. Additionally, we estimate approximately $500 million would be required for the scalable common infrastructure for our Blue Point complex, such as ammonia storage and a vessel loading dock. \nWe have entered into joint development agreements (JDAs) with two potential partners, Mitsui & Co., Ltd. and JERA Co., Inc. for the development of the greenfield low-carbon ammonia capacity. Our evaluation includes assessing whether the ammonia production technology under consideration will satisfy carbon intensity and other requirements for potential end users. Should a positive final investment decision (FID) be reached to construct greenfield low-carbon ammonia capacity at our Blue Point complex, construction and commissioning is expected to take approximately four years from a positive FID. \nIn addition to discussions with existing customers who have interest in using low-carbon ammonia for traditional applications, we are engaged in discussions regarding the supply of low-carbon ammonia for new applications. We are evaluating and are in various stages of discussions with other companies for long-term offtake and/or potential joint investments related to new and traditional applications for low-carbon ammonia. These discussions continue to advance as we gain greater clarity regarding demand for low-carbon ammonia, including associated carbon intensity requirements, government incentives and regulatory developments.  \nIndustry Factors \nWe operate in a highly competitive, global industry. Our operating results are influenced by a broad range of factors, including those outlined below.\nGlobal Supply and Demand Factors\nOur products are global commodities or derived from global commodities and are subject to price competition. The customers for our products make their purchasing decisions principally on the basis of delivered price and, to a lesser extent, on reliability, customer service and product quality. The selling prices of our products fluctuate in response to global market conditions, changes in supply and demand and cost factors.\nHistorically, global fertilizer demand has been driven primarily by population growth, gross domestic product growth, changes in dietary habits, planted acreage, and application rates, among other things. We expect these key variables to continue to have major impacts on long-term fertilizer demand for the foreseeable future. Short-term fertilizer demand growth may depend on global economic conditions, farm sector income, weather patterns, the level of global grain stocks relative to consumption, fertilizer application rates, and governmental regulations, including fertilizer subsidies or requirements mandating increased use of bio-fuels or industrial nitrogen products, such as DEF. Geopolitical factors such as temporary disruptions in fertilizer trade related to government intervention, shipping delays and/or cost increases resulting from regional conflicts or changes in the buying/selling patterns of key exporting/consuming countries, including China, India, Russia and Brazil, among others, often play a major role in shaping near-term market fundamentals. The economics of nitrogen-based fertilizer manufacturing play a key role in decisions to increase or reduce production capacity. Supply of fertilizers is generally driven by available capacity and operating rates, raw material costs and availability, government policies and global trade. Raw materials are dependent on energy sources such as natural gas or coal; therefore, supply costs are affected by the supply of and demand for those commodities. \nGlobal Trade in Fertilizer\nProfitability of our products within a particular geographic region is determined not only by the relationship between global supply and demand, but also by the supply/demand balance within that region. Regional supply and demand can be influenced significantly by factors affecting trade within regions. Some of these factors include the relative cost to produce and deliver product, relative currency values, the availability of credit, agricultural supply and demand, industrial product demand and policies such as emissions abatement, government support for manufacturers or purchasers and governmental nitrogen product trade policies, including the imposition of duties, tariffs or quotas, that affect foreign trade or investment. Government energy or carbon policies may also affect regional nitrogen supply and demand. The development of additional natural gas reserves in North America has decreased natural gas costs in North America relative to the rest of the world, making North American nitrogen fertilizer producers more competitive. Changes in currency values may also alter our cost competitiveness relative to producers in other regions of the world.\nThe North American nitrogen fertilizer market for certain products is dependent on imports to balance supply and demand, and imports traditionally account for a significant portion of nitrogen fertilizer products consumed in North America. Producers of nitrogen-based fertilizers located in the Middle East, Trinidad, Africa and Russia have been major exporters to North America in recent years. \n32\nTable of Contents\nCF INDUSTRIES HOLDINGS, INC.\nFarmers’ Economics\nThe demand for fertilizer is affected by the aggregate crop planting decisions and fertilizer application rate decisions of individual farmers. Individual farmers make planting decisions based largely on prospective profitability of a harvest, while the specific varieties and amounts of fertilizer they apply depend on factors like their current liquidity, soil conditions, weather patterns, crop and fertilizer prices, fertilizer products used and timing of applications, expected yields and the types of crops planted.\nMarket Conditions\nNitrogen Selling Prices and Sales Volume\nOur nitrogen products are globally traded commodities with selling prices that fluctuate in response to global market conditions, changes in supply and demand, and other cost factors including domestic and local conditions. Intense global competition—reflected in import volumes and prices—strongly influences delivered prices for nitrogen fertilizers. In general, the prevailing global prices for nitrogen products must be at a level to incent the high-cost marginal producer to produce product at a breakeven or above price, or else they would cease production and leave a portion of global demand unsatisfied. \nAverage selling prices for all of our major products were lower in 2024 than in 2023, as lower global energy costs reduced the global market clearing price required to meet global demand. The average selling price for our products was $313 per ton in 2024 compared to $347 per ton in 2023. The 10% decrease in the average selling price for our products in 2024 compared to 2023 resulted in a year-over-year decrease in net sales of approximately $716 million. \nOur total sales volume was 1% lower in 2024 than in 2023, due primarily to lower sales volume in our UAN, AN and Other segments, partially offset by higher sales volume in our Ammonia segment as a result of the Waggaman acquisition on December 1, 2023. We shipped 18.9 million tons of product in 2024 compared to 19.1 million tons in 2023.  \nIn January 2024, a winter storm produced extremely cold temperatures that impacted our operations, including the temporary shut-down and lost production at certain of our plants. Due to the impact of plant downtime resulting from the adverse weather and additional plant maintenance activity in the first quarter of 2024, we purchased and resold approximately 62,000 tons of ammonia and 48,000 tons of granular urea at near breakeven margins in order to fulfill sales commitments. The plant downtime led to approximately $75 million of additional costs in the first quarter of 2024 for maintenance, repairs and certain unabsorbed fixed costs.\nThe acquisition of the Waggaman ammonia production facility closed on December 1, 2023, and therefore provided incremental net sales in the first eleven months of 2024. As a result, the Waggaman acquisition increased our 2024 sales volume by 644,000 tons and increased our net sales by $249 million due to the incremental eleven months of ownership compared to 2023.\nSales volume for our products in 2024, 2023 and 2022 is shown in the table below. \n \n2024\n2023\n2022\n \nSales Volume (tons)\nNet Sales\nSales Volume (tons)\nNet Sales\nSales Volume (tons)\nNet Sales\n \n(tons in thousands; dollars in millions)\nAmmonia\n4,085 \n$\n1,736 \n3,546 \n$\n1,679 \n3,300 \n$\n3,090 \nGranular Urea\n4,522 \n1,600 \n4,570 \n1,823 \n4,572 \n2,892 \nUAN\n6,771 \n1,678 \n7,237 \n2,068 \n6,788 \n3,572 \nAN\n1,464 \n419 \n1,571 \n497 \n1,594 \n845 \nOther\n(1)\n2,101 \n503 \n2,206 \n564 \n2,077 \n787 \nTotal\n18,943 \n$\n5,936 \n19,130 \n$\n6,631 \n18,331 \n$\n11,186 \n_______________________________________________________________________________\n(1)\nOther segment products primarily include DEF, urea liquor, nitric acid and aqua ammonia.\nNatural Gas \nNatural gas is the principal raw material used to produce our nitrogen products. Natural gas is both a chemical feedstock and a fuel used to produce nitrogen products. Natural gas is a significant cost component of our manufactured nitrogen products, representing approximately 28% and 40%, respectively, of our production costs in 2024 and 2023. Most of our \n33\nTable of Contents\nCF INDUSTRIES HOLDINGS, INC.\nmanufacturing facilities are located in the United States and Canada. As a result, the price of natural gas in North America directly impacts a substantial portion of our operating expenses.\nIn the first quarter of 2024, warmer-than-normal average temperatures in North America drove lower heating demand for natural gas, in spite of a short-lived period of extremely cold temperatures in January 2024 that affected most of North America. North American natural gas supply remained strong through the quarter, with a decline in supply occurring near the end of the quarter as producers responded to a weaker price environment. In addition, although the higher cost for natural gas outside of North America incentivized liquefaction facilities in the United States to export domestic natural gas during the first quarter of 2024, an outage at the Freeport liquefied natural gas facility limited total gas exports, supporting domestic supply. \nDuring the second quarter of 2024, there was a decline in natural gas supply as producers responded to a weaker price environment, limiting the domestic supply available to be injected into storage during the quarter. In addition, natural gas demand for power generation reached record levels in the second quarter of 2024 as higher-than-normal temperatures drove increased cooling demand. \nIn the third quarter of 2024, the decline in natural gas supply continued as producers curtailed production in response to low natural gas prices. Natural gas demand from the power generation sector set records despite increased solar and wind generation, as low natural gas prices increased demand for gas-fired power. Liquefied natural gas exports were steady through the quarter as delays on commissioning of new facilities and maintenance activities at existing plants held exports at levels reached during the second quarter of 2024. Natural gas in storage remained above historical levels despite continued below-average injections into storage during the third quarter.\nDuring the fourth quarter of 2024, natural gas supply increased as producers responded to higher prices by restarting previously curtailed production. After a warm start to the quarter, December temperatures turned colder-than-normal, raising demand for heat and power generation. Liquefied natural gas exports increased to the highest level of the year due to strong global demand for natural gas and the startup of a new liquefaction facility in the U.S. Gulf. The higher demand decreased the storage surplus compared to historical levels. The average daily market price of natural gas at the Henry Hub, the most heavily-traded natural gas pricing point in North America, was $4.25 per MMBtu for the period from January 1, 2025 through February 14, 2025.\nThe following table presents the average daily market price of natural gas at the Henry Hub for the years ended December 31, 2024, 2023 and 2022: \n \nYear ended December 31,\n \n2024\n2023\n2022\n2024 v. 2023\n2023 v. 2022\nAverage daily market price of natural gas Henry Hub (Louisiana)\n$\n2.25 \n$\n2.53 \n$\n6.38 \n$\n(0.28)\n(11)\n%\n$\n(3.85)\n(60)\n%\nThe total cost of natural gas used for production at our manufacturing facilities, which includes the impact of realized natural gas derivatives, decreased 35% to $2.40 per MMBtu in 2024 from $3.67 per MMBtu in 2023. The decrease in natural gas costs in 2024 as compared to 2023 resulted in an increase in gross margin of approximately $436 million, excluding the impact of the Waggaman acquisition. \nFinancial Executive Summary\nWe reported net earnings attributable to common stockholders of $1.22 billion in 2024 compared to $1.53 billion in 2023, a decrease in net earnings of 20%, or $307 million. The decrease in net earnings primarily reflects a decrease in gross margin partially offset by a lower income tax provision and a decrease in net earnings attributable to the noncontrolling interest.\nGross margin decreased by $489 million, or 19%, to $2.06 billion for the year ended December 31, 2024 compared to $2.55 billion for the year ended December 31, 2023. The decrease in gross margin was due primarily to a 10% decrease in average selling prices to $313 per ton in 2024 from $347 per ton in 2023, which decreased gross margin by $716 million, excluding the impact of the Waggaman acquisition, and a decrease in sales volume, which decreased gross margin by $123 million, excluding the impact of the Waggaman acquisition. These factors that decreased gross margin were partially offset by (i) lower natural gas costs, which increased gross margin by $436 million, excluding the impact of the Waggaman acquisition, and (ii) the impact of the Waggaman acquisition completed on December 1, 2023, which increased our 2024 gross margin by $57 million due to the incremental eleven months of ownership compared to 2023.\nLower gross margin was partially offset by a decrease in the income tax provision of $125 million due primarily to lower pre-tax earnings in 2024 and a decrease of $54 million in net earnings attributable to the noncontrolling interest.\n34\nTable of Contents\nCF INDUSTRIES HOLDINGS, INC.\nDiluted net earnings per share attributable to common stockholders decreased $1.13 per share, to $6.74 per share in 2024 compared to $7.87 per share in 2023 due primarily to lower net earnings, partially offset by lower weighted-average common shares outstanding as a result of shares repurchased under our share repurchase programs. Diluted weighted-average common shares outstanding were 180.7 million shares for the year ended December 31, 2024, a decrease of 7% compared to diluted weighted-average common shares outstanding of 193.8 million shares for the year ended December 31, 2023. \nAcquisition of Waggaman Ammonia Production Facility\nOn December 1, 2023, we acquired an ammonia production facility located in Waggaman, Louisiana from Dyno Nobel Louisiana Ammonia, LLC (DNLA), a U.S. subsidiary of Australia-based Incitec Pivot Limited (IPL), pursuant to an asset purchase agreement with DNLA and IPL. The facility has a nameplate production capacity of 880,000 tons of ammonia annually. Our acquisition of the Waggaman facility expanded our ammonia manufacturing and distribution capacity.\nIn connection with the acquisition, we entered into a long-term ammonia offtake agreement providing for us to supply up to 200,000 tons of ammonia per year to IPL’s Dyno Nobel, Inc. subsidiary. Under the terms of the asset purchase agreement, $425 million of the purchase price of $1.675 billion, subject to adjustment, was allocated by the parties to the ammonia offtake agreement. We funded the balance of the initial purchase price on the acquisition date with $1.223 billion of cash on hand.\nThe consideration transferred on the acquisition date reflected an estimated net working capital adjustment and other adjustments to the purchase price, which was subject to further adjustment pursuant to the terms of the asset purchase agreement. The purchase price adjustments required under the asset purchase agreement were finalized in the second quarter of 2024, which resulted in a $2 million reduction in the purchase price with a corresponding reduction in goodwill. As a result, the final purchase price was $1.221 billion.\nIn connection with recording the acquisition, we recognized, among other items, goodwill, intangible assets and a supply contract liability. See Note 6—Acquisition of Waggaman Ammonia Production Facility for additional information.\nItems Affecting Comparability of Results\n During the years ended December 31, 2024 and 2023, we reported net earnings attributable to common stockholders of $1.22 billion and $1.53 billion, respectively. In addition to the impact of market conditions and the acquisition of the Waggaman ammonia production facility discussed above, certain items affected the comparability of our financial results during the years ended December 31, 2024 and 2023. The following table and related discussion outline these items and their impact on the comparability of our financial results for these periods. The descriptions of items below that refer to amounts in the table refer to the pre-tax amounts unless otherwise noted. \n2024\n2023\nPre-Tax\nAfter-Tax\n(1)\nPre-Tax\nAfter-Tax\n(1)\n(in millions)\nUnrealized net mark-to-market gain on natural gas derivatives\n(2)\n$\n(35)\n$\n(27)\n$\n(39)\n$\n(30)\nImpact of employee benefit plan policy change\n(3)\n(16)\n(13)\n— \n— \nU.K. operations restructuring\n— \n— \n10 \n8 \nAcquisition and integration costs\n4 \n3 \n39 \n29 \nImpairment of equity method investment in PLNL\n(4)\n— \n— \n43 \n32 \nCanada Revenue Agency Competent Authority Matter:\nInterest expense (income)—net\n(5)\n(39)\n(38)\n— \n— \n______________________________________________________________________________\n(1)\nThe tax impact is calculated utilizing a marginal effective rate of 23.6% and 23.5% in 2024 and 2023, respectively, except for acquisition and integration costs related to the Waggaman acquisition, which reflects a 24.0% and 26.2% marginal effective rate in 2024 and 2023, respectively. \n(2)\nIncluded in cost of sales in our consolidated statements of operations.\n(3)\nIncluded in cost of sales and selling, general and administrative expenses in our consolidated statement of operations.\n(4)\nIncluded in equity in earnings (loss) of operating affiliate in our consolidated statement of operations.\n(5)\nIncluded in interest expense and interest income in our consolidated statement of operations.\n35\nTable of Contents\nCF INDUSTRIES HOLDINGS, INC.\nUnrealized net mark-to-market gain on natural gas derivatives\nNatural gas is the largest and most volatile single component of the manufacturing cost for our nitrogen-based products. At certain times, we have managed the risk of changes in natural gas prices through the use of derivative financial instruments. The derivatives that we use for this purpose are primarily natural gas fixed price swaps, basis swaps and options. We use natural gas derivatives as an economic hedge of natural gas price risk, but without the application of hedge accounting. This can result in volatility in reported earnings due to the unrealized mark-to-market adjustments that occur from changes in the value of the derivatives, which are reflected in cost of sales in our consolidated statements of operations. In 2024 and 2023, we recognized unrealized net mark-to-market gains on natural gas derivatives of $35 million and $39 million, respectively.\nImpact of employee benefit plan policy change\nIn 2024, we recognized income of $16 million pertaining to a policy change to an employee benefit plan that is included in both cost of sales and selling, general and administrative expenses in our consolidated statement of operations.\nU.K. operations restructuring\nIn 2023, we recognized total charges of $10 million, consisting primarily of the recognition of an asset retirement obligation and post-employment benefits related to contractual and statutory obligations due to employees as a result of our approved plan to permanently close the ammonia plant at our Billingham complex.\nAcquisition and integration costs\nOn December 1, 2023, we acquired an ammonia production facility located in Waggaman, Louisiana, as described above under “Acquisition of Waggaman Ammonia Production Facility.” In 2024, we incurred approximately $4 million of integration costs related to the Waggaman acquisition. In 2023, we incurred $36 million of acquisition-related costs and $3 million of integration costs related to the Waggaman acquisition. These costs are included in acquisition and integration costs in our consolidated statements of operations.\nImpairment of equity method investment in PLNL\nPLNL, our joint venture in Trinidad, operates an ammonia plant that relies on natural gas supplied, under a gas sales contract (the NGC Contract), by The National Gas Company of Trinidad and Tobago Limited (NGC). The NGC Contract had an expiration date of September 2023. In the third quarter of 2023, PLNL entered into a new gas sales contract with NGC (the New NGC Contract), which is effective October 2023 through December 2025. \nIn the third quarter of 2023 and due to the terms of the New NGC Contract, we assessed our investment in PLNL for impairment and determined that the carrying value of our equity method investment in PLNL exceeded its fair value. As a result, we recorded an impairment of our equity method investment in PLNL of $43 million, which is reflected in equity in earnings (loss) of operating affiliate in our consolidated statement of operations for the year ended December 31, 2023.\nCanada Revenue Agency Competent Authority Matter\n \nIn the second half of 2022, as a result of the conclusion of arbitration proceedings and the settlement provisions between the United States and Canadian competent authorities related to tax years 2006 through 2011, we paid additional income taxes and related interest of $124 million and $100 million, respectively, to the Canada Revenue Agency (CRA) and Alberta Tax and Revenue Administration (Alberta TRA). In the third quarter of 2024, we were informed that the CRA granted us discretionary interest relief for certain tax years from 2006 through 2011. In the fourth quarter of 2024, we received the CRA portion of the interest relief consisting of interest refunds of $21 million and related interest of $2 million. The interest relief from the Alberta TRA is estimated to be approximately $16 million, consisting of interest refunds of $15 million and related interest of $1 million, based on current estimates and foreign currency exchange rates as of December 31, 2024. As a result, in our consolidated statement of operations for the year ended December 31, 2024, we recognized $39 million of income consisting of a $36 million reduction in interest expense and $3 million of interest income.\n36\nTable of Contents\nCF INDUSTRIES HOLDINGS, INC.\nConsolidated Results of Operations\nThe following table presents our consolidated results of operations and certain supplemental data for the years ended December 31, 2024, 2023 and 2022: \n \nYear ended December 31,\n \n2024\n2023\n2022\n2024 v. 2023\n2023 v. 2022\n \n(in millions, except as noted)\nNet sales \n$\n5,936 \n$\n6,631 \n$\n11,186 \n$\n(695)\n(10)\n%\n$\n(4,555)\n(41)\n%\nCost of sales (COS)\n3,880 \n4,086 \n5,325 \n(206)\n(5)\n%\n(1,239)\n(23)\n%\nGross margin\n2,056 \n2,545 \n5,861 \n(489)\n(19)\n%\n(3,316)\n(57)\n%\nGross margin percentage\n34.6 \n%\n38.4 \n%\n52.4 \n%\n(3.8)\n%\n(14.0)\n%\nSelling, general and administrative expenses\n320 \n289 \n290 \n31 \n11 \n%\n(1)\n— \n%\nU.K. long-lived and intangible asset impairment\n— \n— \n239 \n— \n— \n%\n(239)\n(100)\n%\nU.K. operations restructuring\n— \n10 \n19 \n(10)\n(100)\n%\n(9)\n(47)\n%\nAcquisition and integration costs\n4 \n39 \n— \n(35)\n(90)\n%\n39 \nN/M\nOther operating—net\n(10)\n(31)\n10 \n21 \n68 \n%\n(41)\nN/M\nTotal other operating costs and expenses\n314 \n307 \n558 \n7 \n2 \n%\n(251)\n(45)\n%\nEquity in earnings (loss) of operating affiliate\n4 \n(8)\n94 \n12 \nN/M\n(102)\nN/M\nOperating earnings\n1,746 \n2,230 \n5,397 \n(484)\n(22)\n%\n(3,167)\n(59)\n%\nInterest expense\n121 \n150 \n344 \n(29)\n(19)\n%\n(194)\n(56)\n%\nInterest income\n(123)\n(158)\n(65)\n35 \n22 \n%\n(93)\n(143)\n%\nLoss on debt extinguishment\n— \n— \n8 \n— \n— \n%\n(8)\n(100)\n%\nOther non-operating—net\n(14)\n(10)\n15 \n(4)\n(40)\n%\n(25)\nN/M\nEarnings before income taxes\n1,762 \n2,248 \n5,095 \n(486)\n(22)\n%\n(2,847)\n(56)\n%\nIncome tax provision \n285 \n410 \n1,158 \n(125)\n(30)\n%\n(748)\n(65)\n%\nNet earnings\n1,477 \n1,838 \n3,937 \n(361)\n(20)\n%\n(2,099)\n(53)\n%\nLess: Net earnings attributable to noncontrolling interest\n259 \n313 \n591 \n(54)\n(17)\n%\n(278)\n(47)\n%\nNet earnings attributable to common stockholders \n$\n1,218 \n$\n1,525 \n$\n3,346 \n$\n(307)\n(20)\n%\n$\n(1,821)\n(54)\n%\nDiluted net earnings per share attributable to common stockholders \n$\n6.74 \n$\n7.87 \n$\n16.38 \n$\n(1.13)\n(14)\n%\n$\n(8.51)\n(52)\n%\nDiluted weighted-average common shares outstanding\n180.7 \n193.8 \n204.2 \n(13.1)\n(7)\n%\n(10.4)\n(5)\n%\nDividends declared per common share\n$\n2.00 \n$\n1.60 \n$\n1.50 \n$\n0.40 \n25 \n%\n$\n0.10 \n7 \n%\nNatural gas supplemental data (per MMBtu)\nNatural gas costs in COS\n(1)\n$\n2.28 \n$\n3.26 \n$\n7.16 \n$\n(0.98)\n(30)\n%\n$\n(3.90)\n(54)\n%\nRealized derivatives loss in COS\n(2)\n0.12 \n0.41 \n0.02 \n(0.29)\n(71)\n%\n0.39 \nN/M\nCost of natural gas used for production in COS\n$\n2.40 \n$\n3.67 \n$\n7.18 \n$\n(1.27)\n(35)\n%\n$\n(3.51)\n(49)\n%\nAverage daily market price of natural gas Henry Hub (Louisiana)\n$\n2.25 \n$\n2.53 \n$\n6.38 \n$\n(0.28)\n(11)\n%\n$\n(3.85)\n(60)\n%\nUnrealized net mark-to-market (gain) loss on natural gas derivatives\n$\n(35)\n$\n(39)\n$\n41 \n$\n4 \n10 \n%\n$\n(80)\nN/M\nDepreciation and amortization\n$\n925 \n$\n869 \n$\n850 \n$\n56 \n6 \n%\n$\n19 \n2 \n%\nCapital expenditures \n$\n518 \n$\n499 \n$\n453 \n$\n19 \n4 \n%\n$\n46 \n10 \n%\nSales volume by product tons (000s)\n18,943 \n19,130 \n18,331 \n(187)\n(1)\n%\n799 \n4 \n%\nProduction volume by product tons (000s): \nAmmonia\n(3)\n9,800 \n9,496 \n9,807 \n304 \n3 \n%\n(311)\n(3)\n%\nGranular urea\n4,404 \n4,544 \n4,561 \n(140)\n(3)\n%\n(17)\n— \n%\nUAN (32%)\n(4)\n6,753 \n6,852 \n6,706 \n(99)\n(1)\n%\n146 \n2 \n%\nAN\n1,392 \n1,520 \n1,517 \n(128)\n(8)\n%\n3 \n— \n%\n37\nTable of Contents\nCF INDUSTRIES HOLDINGS, INC.\n______________________________________________________________________________\nN/M—Not Meaningful\n(1)\nIncludes the cost of natural gas used for production and related transportation that is included in cost of sales during the period under the first-in, first-out inventory cost method. \n(2)\nIncludes realized gains and losses on natural gas derivatives settled during the period. Excludes unrealized mark-to-market gains and losses on natural gas derivatives.\n(3)\nGross ammonia production, including amounts subsequently upgraded on-site into granular urea, UAN, or AN.\n(4)\nUAN product tons assume a 32% nitrogen content basis for production volume.\nThe following is a discussion and analysis of our consolidated results of operations for the year ended December 31, 2024, compared to the year ended December 31, 2023. For a discussion and analysis of our consolidated results of operations for the year ended December 31, 2023 compared to the year ended December 31, 2022, see Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations in our 2023 Annual Report on Form 10-K filed with the SEC on February 22, 2024.\nNet Sales\nOur net sales are derived primarily from the sale of nitrogen products and are determined by the quantities of nitrogen products we sell and the selling prices we realize. The volumes, mix and selling prices we realize are determined to a great extent by a combination of global and regional supply and demand factors. Net sales also include shipping and handling costs that are billed to our customers. Sales incentives are reported as a reduction in net sales.\nOur total net sales decreased $695 million, or 10%, to $5.94 billion in 2024 compared to $6.63 billion in 2023. The change in our net sales reflects (i) the impact of the Waggaman acquisition completed on December 1, 2023, which increased our net sales by $249 million, and (ii) a $944 million, or 14%, decline in our net sales excluding the impact of the Waggaman acquisition, due to a 10% decrease in average selling prices and a 4% decrease in sales volume.\nOur average selling price was $313 per ton in 2024 compared to $347 per ton in 2023, a decrease of 10%, due to lower average selling prices across all of our segments, as lower global energy costs reduced the global market clearing price required to meet global demand. The impact of lower average selling prices, excluding the impact of the Waggaman acquisition, was a decrease in net sales of approximately $716 million for 2024 compared to 2023. \nOur total sales volume of 18.9 million product tons in 2024 was 1% lower compared to 19.1 million product tons in 2023, due primarily to lower sales volume in our UAN, AN and Other segments, partially offset by higher sales volume in our Ammonia segment driven by the impact of the Waggaman acquisition, which increased our 2024 sales volume by 644,000 tons due to the incremental eleven months of ownership compared to 2023. Excluding the impact of the Waggaman acquisition, the impact of lower sales volume was a decrease in net sales of approximately $228 million.\nGross ammonia production for 2024 increased to approximately 9.8 million tons compared to 9.5 million tons in 2023. We expect gross ammonia production for 2025 will be approximately 10 million tons. \nCost of Sales\nOur cost of sales includes manufacturing costs, purchased product costs, distribution and storage costs, and freight. Manufacturing costs, the most significant element of cost of sales, consist primarily of raw materials, realized and unrealized gains and losses on natural gas derivatives, maintenance, direct labor, depreciation and other plant overhead expenses. Purchased product costs primarily include the cost to purchase nitrogen fertilizers to augment or replace production at our facilities. Distribution costs consist of the cost of freight required to transport finished products from our manufacturing facilities to our distribution facilities, which are recognized in cost of sales when the product is sold to our customers. Storage costs consist of costs incurred prior to final shipment to customers. Freight consists of shipping and handling costs incurred by us to deliver the product to our customer’s intended destination.\nOur total cost of sales decreased $206 million, or 5%, to $3.88 billion in 2024 as compared to $4.09 billion in 2023. The decrease in our cost of sales primarily reflects lower realized natural gas costs, including the impact of realized derivatives. The impact of lower realized natural gas costs decreased cost of sales by $436 million, excluding the impact of the Waggaman acquisition. The impact of lower realized natural gas costs was partially offset by higher costs for planned and unplanned maintenance and repair activities in 2024, including the impact of the adverse weather in January 2024, as discussed above under “Nitrogen Selling Prices and Sales Volume,” and the impact of the Waggaman acquisition, which increased our cost of sales by $192 million due to the incremental eleven months of ownership compared to 2023. \nCost of sales also includes the impact of a $35 million unrealized net mark-to-market gain on natural gas derivatives in 2024 compared to a $39 million gain in 2023. \n38\nTable of Contents\nCF INDUSTRIES HOLDINGS, INC.\nCost of sales averaged $204 per ton in 2024, a 5% decrease from $214 per ton in 2023. Our cost of natural gas, including the impact of realized derivatives, decreased 35% to $2.40 per MMBtu in 2024 from $3.67 per MMBtu in 2023. \nSelling, General and Administrative Expenses\nOur selling, general and administrative expenses consist primarily of corporate office expenses such as salaries and other payroll-related costs for our executive, administrative, legal, financial, IT, and sales functions, as well as certain taxes and insurance and other professional service fees, including those for corporate initiatives, and amortization of definite-lived intangible assets.\nSelling, general and administrative expenses increased $31 million to $320 million in 2024 compared to $289 million in 2023. The increase was due primarily to an increase of $21 million in amortization expense related to the customer relationships recognized in conjunction with the Waggaman acquisition on December 1, 2023, and an increase in costs related to certain corporate initiatives.  \nU.K. Operations Restructuring\nIn 2023, related to our U.K. operations, we recognized total charges of $10 million, consisting primarily of the recognition of an asset retirement obligation and post-employment benefits related to contractual and statutory obligations due to employees as a result of our approved plan to permanently close the ammonia plant at our Billingham complex. See Note 7—United Kingdom Operations Restructuring and Impairment Charges for further discussion of the Billingham ammonia plant closure.\nAcquisition and Integration Costs\nOn December 1, 2023, we acquired an ammonia production facility located in Waggaman, Louisiana, as described above under “Acquisition of Waggaman Ammonia Production Facility.” In 2024, we incurred $4 million of integration costs related to the Waggaman acquisition. In 2023, we incurred $36 million of acquisition-related costs and $3 million of integration costs. \nOther Operating—Net\nOther operating—net includes administrative costs that do not relate directly to our central operations and can include foreign currency transaction gains and losses, unrealized gains and losses on foreign currency derivatives, litigation expenses, gains and losses on the disposal of fixed assets and FEED study costs related to our clean energy initiatives.\nOther operating—net was $10 million of income in 2024 compared to $31 million of income in 2023. In both 2024 and 2023, the income recognized consists primarily of gains on sales of emission credits, partially offset by FEED study costs for our clean energy initiatives. See “Our Strategy,” above, for additional information related to our clean energy initiatives.\nEquity in Earnings (Loss) of Operating Affiliate\nEquity in earnings (loss) of operating affiliate consists of our 50% ownership interest in PLNL. We include our share of the net earnings from our equity method investment in PLNL as an element of earnings from operations because this investment provides additional production and is integrated with our other supply chain and sales activities. \nEquity in earnings (loss) of operating affiliate was $4 million of earnings in 2024 compared to an $8 million loss in 2023, which includes an impairment of our equity method investment in PLNL of $43 million recognized in the third quarter of 2023. See “Items Affecting Comparability of Results—Impairment of equity method investment in PLNL,” above, for further discussion. Lower equity in earnings of operating affiliate in 2024 compared to 2023, excluding the impact from the impairment charge, primarily reflects a decrease in the operating results of PLNL as a result of a plant turnaround in the second quarter of 2024 at the PLNL facility in Trinidad, lower ammonia selling prices, higher natural gas costs and lower operating rates at PLNL due to lower availability of natural gas.\nInterest Expense\nInterest expense includes interest on our long-term debt, amortization of the related fees required to execute financing agreements, annual fees pursuant to our revolving credit agreement and interest on tax liabilities. Capitalized interest relating to the construction of major capital projects reduces interest expense as the interest is capitalized and amortized over the estimated useful lives of the related assets. \nInterest expense was $121 million in 2024 compared to $150 million in 2023. The decrease of $29 million was due primarily to a reduction in interest on tax liabilities driven by a $36 million reduction in interest expense recognized in 2024 related to discretionary interest relief granted to us by Canadian taxing authorities that is further described above under “Items Affecting Comparability of Results—Canada Revenue Agency Competent Authority Matter.” \n39\nTable of Contents\nCF INDUSTRIES HOLDINGS, INC.\nInterest Income\nInterest income includes amounts earned on our cash, cash equivalents, and investments and any interest earned related to income tax refunds.\nInterest income was $123 million in 2024 compared to $158 million in 2023. The decrease of $35 million was due primarily to a $52 million decrease in interest income on short-term investments in 2024, partially offset by $3 million of interest income in 2024 related to discretionary interest relief that is further described above under “Items Affecting Comparability of Results—Canada Revenue Agency Competent Authority Matter.”\nIncome Tax Provision \nOur income tax provision for 2024 was $285 million on pre-tax income of $1.76 billion, or an effective tax rate of 16.2%, compared to an income tax provision of $410 million on pre-tax income of $2.25 billion, or an effective tax rate of 18.3%, in 2023.\nOur effective tax rate is impacted by earnings attributable to the noncontrolling interest in CFN, as our consolidated income tax provision does not include a tax provision on the earnings attributable to the noncontrolling interest. Our effective tax rate for 2024 of 16.2%, which is based on pre-tax income of $1.76 billion, would be 2.8 percentage points higher, or 19.0%, if based on pre-tax income exclusive of the earnings attributable to the noncontrolling interest of $259 million. Our effective tax rate for 2023 of 18.3%, which is based on pre-tax income of $2.25 billion, would be 2.9 percentage points higher, or 21.2%, if based on pre-tax income exclusive of the earnings attributable to the noncontrolling interest of $313 million.\nBoth 2024 and 2023 were impacted by additional discrete tax items. See Note 12—Income Taxes for additional information.\nNet Earnings Attributable to Noncontrolling Interest\nNet earnings attributable to noncontrolling interest includes the net earnings attributable to the approximately 11% CHS minority equity interest in CFN, a subsidiary of CF Holdings. \nNet earnings attributable to noncontrolling interest decreased $54 million, or 17%, to $259 million in 2024 compared to $313 million in 2023 due to lower earnings of CFN driven by lower average selling prices as described above under “Net Sales,” partially offset by lower natural gas costs.\nDiluted Net Earnings Per Share Attributable to Common Stockholders\nNet earnings per share attributable to common stockholders decreased 14% to $6.74 per diluted share in 2024 from $7.87 per diluted share in 2023. This decrease was due primarily to a decrease in gross margin, driven by lower average selling prices, partially offset by lower natural gas costs. Lower gross margin was partially offset by a decrease in the income tax provision resulting from lower profitability and a decrease in net earnings attributable to the noncontrolling interest. Additionally, diluted weighted-average common shares outstanding declined 7% from 193.8 million shares for 2023 to 180.7 million shares for 2024, due primarily to repurchases of common shares under our share repurchase programs.\n40\nTable of Contents\nCF INDUSTRIES HOLDINGS, INC.\nOperating Results by Business Segment \n \nOur reportable segment structure reflects how our chief operating decision maker, as defined in accounting principles generally accepted in the United States (U.S. GAAP), assesses the performance of our reportable segments and makes decisions about resource allocation. These segments are differentiated by products. Our management uses gross margin to evaluate segment performance and allocate resources. Total other operating costs and expenses (consisting primarily of selling, general and administrative expenses and other operating—net) and non-operating expenses (consisting primarily of interest and income taxes), are centrally managed and are not included in the measurement of segment profitability reviewed by management. The following table presents summary operating results by business segment: \n \nAmmonia\n(1)\nGranular Urea\n(2)\nUAN\n(2)\nAN\n(2)\nOther\n(2)\nConsolidated\n \n(in millions)\nYear ended December 31, 2024\nNet sales\n$\n1,736 \n$\n1,600 \n$\n1,678 \n$\n419 \n$\n503 \n$\n5,936 \nCost of sales\n1,243 \n926 \n1,069 \n340 \n302 \n3,880 \nGross margin\n$\n493 \n$\n674 \n$\n609 \n$\n79 \n$\n201 \n$\n2,056 \nGross margin percentage\n28.4 \n%\n42.1 \n%\n36.3 \n%\n18.9 \n%\n40.0 \n%\n34.6 \n%\nYear ended December 31, 2023\nNet sales\n$\n1,679 \n$\n1,823 \n$\n2,068 \n$\n497 \n$\n564 \n$\n6,631 \nCost of sales\n1,138 \n1,010 \n1,251 \n359 \n328 \n4,086 \nGross margin\n$\n541 \n$\n813 \n$\n817 \n$\n138 \n$\n236 \n$\n2,545 \nGross margin percentage\n32.2 \n%\n44.6 \n%\n39.5 \n%\n27.8 \n%\n41.8 \n%\n38.4 \n%\nYear ended December 31, 2022\nNet sales\n$\n3,090 \n$\n2,892 \n$\n3,572 \n$\n845 \n$\n787 \n$\n11,186 \nCost of sales\n1,491 \n1,328 \n1,489 \n597 \n420 \n5,325 \nGross margin\n$\n1,599 \n$\n1,564 \n$\n2,083 \n$\n248 \n$\n367 \n$\n5,861 \nGross margin percentage\n51.7 \n%\n54.1 \n%\n58.3 \n%\n29.3 \n%\n46.6 \n%\n52.4 \n%\n_______________________________________________________________________________\n(1)\nThe financial results of the Waggaman facility are included in the Ammonia segment from the Waggaman acquisition date of December 1, 2023. See “Acquisition of Waggaman Ammonia Production Facility” for additional information.\n(2)\nThe cost of ammonia and other products that are upgraded in the production of Granular Urea, UAN, AN and Other products is transferred at cost into the results of those products.\nThe following is a discussion and analysis of our operating results by business segment for the year ended December 31, 2024 compared to the year ended December 31, 2023. For a discussion and analysis of our operating results by business segment for the year ended December 31, 2023 compared to the year ended December 31, 2022, see Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations in our 2023 Annual Report on Form 10-K filed with the SEC on February 22, 2024. \n41\nTable of Contents\nCF INDUSTRIES HOLDINGS, INC.\nAmmonia Segment \nOur Ammonia segment produces anhydrous ammonia (ammonia), which is the base product that we manufacture, containing 82% nitrogen and 18% hydrogen. The results of our Ammonia segment consist of sales of ammonia to external customers for its nitrogen content as a fertilizer, in emissions control and in other industrial applications. In addition, we upgrade ammonia into other nitrogen products such as granular urea, UAN and AN. \nThe following table presents summary operating data for our Ammonia segment: \n \nYear ended December 31,\n \n2024\n(1)\n2023\n(1)\n2022\n2024 v. 2023\n2023 v. 2022\n \n(in millions, except as noted)\nNet sales\n$\n1,736 \n$\n1,679 \n$\n3,090 \n$\n57 \n3 \n%\n$\n(1,411)\n(46)\n%\nCost of sales\n1,243 \n1,138 \n1,491 \n105 \n9 \n%\n(353)\n(24)\n%\nGross margin\n$\n493 \n$\n541 \n$\n1,599 \n$\n(48)\n(9)\n%\n$\n(1,058)\n(66)\n%\nGross margin percentage\n28.4 \n%\n32.2 \n%\n51.7 \n%\n(3.8)\n%\n(19.5)\n%\nSales volume by product tons (000s)\n4,085 \n3,546 \n3,300 \n539 \n15 \n%\n246 \n7 \n%\nSales volume by nutrient tons (000s)\n(2)\n3,349 \n2,908 \n2,707 \n441 \n15 \n%\n201 \n7 \n%\nAverage selling price per product ton\n$\n425 \n$\n473 \n$\n936 \n$\n(48)\n(10)\n%\n$\n(463)\n(49)\n%\nAverage selling price per nutrient ton\n(2)\n$\n518 \n$\n577 \n$\n1,141 \n$\n(59)\n(10)\n%\n$\n(564)\n(49)\n%\nGross margin per product ton\n$\n121 \n$\n153 \n$\n485 \n$\n(32)\n(21)\n%\n$\n(332)\n(68)\n%\nGross margin per nutrient ton\n(2)\n$\n147 \n$\n186 \n$\n591 \n$\n(39)\n(21)\n%\n$\n(405)\n(69)\n%\nDepreciation and amortization\n$\n239 \n$\n171 \n$\n166 \n$\n68 \n40 \n%\n$\n5 \n3 \n%\nUnrealized net mark-to-market (gain) loss on natural gas derivatives\n$\n(13)\n$\n(11)\n$\n13 \n$\n(2)\n(18)\n%\n$\n(24)\nN/M\n_______________________________________________________________________________\nN/M—Not Meaningful\n(1)\nThe financial results of the Waggaman facility are included in the Ammonia segment from the Waggaman acquisition date of December 1, 2023. See “Acquisition of Waggaman Ammonia Production Facility” for additional information.\n(2)\nAmmonia represents 82% nitrogen content. Nutrient tons represent the tons of nitrogen within the product tons.\nYear Ended December 31, 2024 Compared to Year Ended December 31, 2023 \nNet Sales.\n  Net sales in our Ammonia segment increased by $57 million, or 3%, to $1.74 billion in 2024 from $1.68 billion in 2023. The increase in our net sales reflects a 15% increase in sales volume, including the impact of the Waggaman acquisition completed on December 1, 2023, partially offset by a 10% decrease in average selling prices. Average selling prices decreased to $425 per ton in 2024 compared to $473 per ton in 2023 as lower global energy costs reduced the global market clearing price required to meet global demand. \nIn January 2024, a winter storm produced extremely cold temperatures that impacted our operations, including the temporary shut-down of certain of our plants. As a result of the adverse weather, we incurred additional maintenance costs in the first quarter of 2024. Due to the impact of plant downtime resulting from the adverse weather and additional plant maintenance activity in the first quarter of 2024, we purchased and resold 62,000 tons of ammonia at near breakeven margins in order to fulfill sales commitments.\nAmmonia sales volume in 2024 was 4.1 million tons, an increase of 15% compared to 3.5 million tons in 2023. The increase in sales volume reflects both the impact of the Waggaman acquisition completed on December 1, 2023, which increased our ammonia sales volume in 2024 by 644,000 tons due to the incremental eleven months of ownership compared to 2023, and 62,000 tons of ammonia purchased and resold as described above, partially offset by lower demand due to lower spring ammonia applications in North America compared to the prior year as a result of unfavorable weather.\nCost of Sales.\n  Cost of sales in our Ammonia segment averaged $304 per ton in 2024, a 5% decrease from $320 per ton in 2023. The decrease was due primarily to lower realized natural gas costs, including the impact of realized derivatives, partially offset by higher costs for maintenance, repairs and certain unabsorbed fixed costs as a result of plant downtime, including the impact of the adverse weather in January 2024 as discussed above. The impact of the Waggaman acquisition on our cost of sales per ton in our Ammonia segment was not material. \n42\nTable of Contents\nCF INDUSTRIES HOLDINGS, INC.\nGross Margin\n.  Gross margin in our Ammonia segment decreased by $48 million, or 9%, to $493 million in 2024 from $541 million in 2023, and our gross margin percentage was 28.4% in 2024 compared to 32.2% in 2023. The decrease in gross margin was due primarily to a 10% decrease in average selling prices, which decreased gross margin by $160 million, a net increase in manufacturing, maintenance and other costs, which decreased gross margin by $121 million, and, excluding the impact of the Waggaman acquisition, a decrease in sales volume, which decreased gross margin by $8 million. These factors that decreased gross margin were partially offset by the impact of a decrease in realized natural gas costs, including the impact of realized derivatives, which increased gross margin by $182 million, and the impact of the Waggaman acquisition, which increased gross margin by $57 million. Gross margin also includes the impact of a $13 million unrealized net mark-to-market gain on natural gas derivatives in 2024 compared to an $11 million gain in 2023. \nGranular Urea Segment\nOur Granular Urea segment produces granular urea, which contains 46% nitrogen. Produced from ammonia and carbon dioxide, it has the highest nitrogen content of any of our solid nitrogen fertilizers. Granular urea is produced at our Donaldsonville, Port Neal and Medicine Hat complexes.\nThe following table presents summary operating data for our Granular Urea segment:  \n \nYear ended December 31,\n \n2024\n2023\n2022\n2024 v. 2023\n2023 v. 2022\n \n(in millions, except as noted)\nNet sales\n$\n1,600 \n$\n1,823 \n$\n2,892 \n$\n(223)\n(12)\n%\n$\n(1,069)\n(37)\n%\nCost of sales\n926 \n1,010 \n1,328 \n(84)\n(8)\n%\n(318)\n(24)\n%\nGross margin\n$\n674 \n$\n813 \n$\n1,564 \n$\n(139)\n(17)\n%\n$\n(751)\n(48)\n%\nGross margin percentage\n42.1 \n%\n44.6 \n%\n54.1 \n%\n(2.5)\n%\n(9.5)\n%\nSales volume by product tons (000s)\n4,522 \n4,570 \n4,572 \n(48)\n(1)\n%\n(2)\n— \n%\nSales volume by nutrient tons (000s)\n(1)\n2,080 \n2,102 \n2,103 \n(22)\n(1)\n%\n(1)\n— \n%\nAverage selling price per product ton\n$\n354 \n$\n399 \n$\n633 \n$\n(45)\n(11)\n%\n$\n(234)\n(37)\n%\nAverage selling price per nutrient ton\n(1)\n$\n769 \n$\n867 \n$\n1,375 \n$\n(98)\n(11)\n%\n$\n(508)\n(37)\n%\nGross margin per product ton\n$\n149 \n$\n178 \n$\n342 \n$\n(29)\n(16)\n%\n$\n(164)\n(48)\n%\nGross margin per nutrient ton\n(1)\n$\n324 \n$\n387 \n$\n744 \n$\n(63)\n(16)\n%\n$\n(357)\n(48)\n%\nDepreciation and amortization\n$\n284 \n$\n285 \n$\n272 \n$\n(1)\n— \n%\n$\n13 \n5 \n%\nUnrealized net mark-to-market (gain) loss on natural gas derivatives\n$\n(9)\n$\n(11)\n$\n13 \n$\n2 \n18 \n%\n$\n(24)\nN/M\n______________________________________________________________________________\nN/M—Not Meaningful\n(1)\nGranular urea represents 46% nitrogen content. Nutrient tons represent the tons of nitrogen within the product tons. \nYear Ended December 31, 2024 Compared to Year Ended December 31, 2023 \nNet Sales.\n  Net sales in our Granular Urea segment decreased $223 million, or 12%, to $1.60 billion in 2024 compared to $1.82 billion in 2023 due primarily to an 11% decrease in average selling prices. Average selling prices decreased to $354 per ton in 2024 compared to $399 per ton in 2023 as lower global energy costs reduced the global market clearing price required to meet global demand. Sales volume in 2024 was 4.5 million tons, a decrease of 1% compared to 4.6 million tons in 2023. Lower sales volume in the first quarter of 2024, which was due primarily to a reduction in ammonia available for upgrade and lower supply availability from the impact of severe weather that caused urea plant outages, was largely offset by higher sales volume in the second and third quarters of 2024 due primarily to a production mix that favored granular urea production. Sales volume in 2024 includes the impact of 48,000 tons of granular urea purchased and resold in the first quarter of 2024 due to the impact of the severe weather described above.\nCost of Sales.\n  Cost of sales in our Granular Urea segment averaged $205 per ton in 2024, a 7% decrease from $221 per ton in 2023, due primarily to lower realized natural gas costs, including the impact of realized derivatives, partially offset by higher costs associated with maintenance activity in 2024. \nGross Margin\n.  Gross margin in our Granular Urea segment decreased by $139 million, or 17%, to $674 million in 2024 from $813 million in 2023, and our gross margin percentage was 42.1% in 2024 compared to 44.6% in 2023. The \n43\nTable of Contents\nCF INDUSTRIES HOLDINGS, INC.\ndecrease in gross margin was driven by an 11% decrease in average selling prices, which decreased gross margin by approximately $185 million, a net increase in manufacturing, maintenance and other costs, which decreased gross margin by $37 million, and a 1% decrease in sales volume, which decreased gross margin by $21 million. These factors that decreased gross margin were partially offset by lower realized natural gas costs, including the impact of realized derivatives, which increased gross margin by $106 million. Gross margin also includes the impact of a $9 million unrealized net mark-to-market gain on natural gas derivatives in 2024 compared to an $11 million gain in 2023.\nUAN Segment\nOur UAN segment produces urea ammonium nitrate solution (UAN). UAN, a liquid fertilizer product with a nitrogen content that typically ranges from 28% to 32%, is produced by combining urea and ammonium nitrate. UAN is produced at our Courtright, Donaldsonville, Port Neal, Verdigris, Woodward, and Yazoo City complexes.\nThe following table presents summary operating data for our UAN segment:  \n \nYear ended December 31,\n \n2024\n2023\n2022\n2024 v. 2023\n2023 v. 2022\n \n(in millions, except as noted)\nNet sales\n$\n1,678 \n$\n2,068 \n$\n3,572 \n$\n(390)\n(19)\n%\n$\n(1,504)\n(42)\n%\nCost of sales\n1,069 \n1,251 \n1,489 \n(182)\n(15)\n%\n(238)\n(16)\n%\nGross margin\n$\n609 \n$\n817 \n$\n2,083 \n$\n(208)\n(25)\n%\n$\n(1,266)\n(61)\n%\nGross margin percentage\n36.3 \n%\n39.5 \n%\n58.3 \n%\n(3.2)\n%\n(18.8)\n%\nSales volume by product tons (000s)\n6,771 \n7,237 \n6,788 \n(466)\n(6)\n%\n449 \n7 \n%\nSales volume by nutrient tons (000s)\n(1)\n2,142 \n2,283 \n2,148 \n(141)\n(6)\n%\n135 \n6 \n%\nAverage selling price per product ton\n$\n248 \n$\n286 \n$\n526 \n$\n(38)\n(13)\n%\n$\n(240)\n(46)\n%\nAverage selling price per nutrient ton\n(1)\n$\n783 \n$\n906 \n$\n1,663 \n$\n(123)\n(14)\n%\n$\n(757)\n(46)\n%\nGross margin per product ton\n$\n90 \n$\n113 \n$\n307 \n$\n(23)\n(20)\n%\n$\n(194)\n(63)\n%\nGross margin per nutrient ton\n(1)\n$\n284 \n$\n358 \n$\n970 \n$\n(74)\n(21)\n%\n$\n(612)\n(63)\n%\nDepreciation and amortization\n$\n268 \n$\n288 \n$\n269 \n$\n(20)\n(7)\n%\n$\n19 \n7 \n%\nUnrealized net mark-to-market (gain) loss on natural gas derivatives\n$\n(10)\n$\n(11)\n$\n14 \n$\n1 \n9 \n%\n$\n(25)\nN/M\n______________________________________________________________________________\nN/M—Not Meaningful\n(1)\nUAN represents between 28% and 32% of nitrogen content, depending on the concentration specified by the customer. Nutrient tons represent the tons of nitrogen within the product tons. \nYear Ended December 31, 2024 Compared to Year Ended December 31, 2023 \nNet Sales.\n  Net sales in our UAN segment decreased $390 million, or 19%, to $1.68 billion in 2024 compared to $2.07 billion in 2023 due primarily to a 13% decrease in average selling prices and a 6% decrease in sales volume. Average selling prices decreased to $248 per ton in 2024 compared to $286 per ton in 2023 due primarily to lower global energy costs reducing the global market clearing price required to meet global demand. The decrease in sales volume was due primarily to lower supply availability resulting from lower beginning inventory entering 2024 and the impact of a production mix that favored granular urea production. \nCost of Sales.\n  Cost of sales in our UAN segment averaged $158 per ton in 2024, a 9% decrease from $173 per ton in 2023, due primarily to the impact of lower realized natural gas costs, including the impact of realized derivatives.\nGross Margin.\n  Gross margin in our UAN segment decreased by $208 million, or 25%, to $609 million in 2024 from $817 million in 2023, and our gross margin percentage was 36.3% in 2024 compared to 39.5% in 2023. The decrease in gross margin was due primarily to a 13% decrease in average selling prices, which decreased gross margin by $274 million, and a 6% decrease in sales volume, which decreased gross margin by $57 million. These factors that decreased gross margin were partially offset by a decrease in realized natural gas costs, including the impact of realized derivatives, which increased gross margin by $113 million, and a net decrease in manufacturing, maintenance and other costs, which increased gross margin by $11 million. Gross margin also includes the impact of a $10 million unrealized net mark-to-market gain on natural gas derivatives in 2024 compared to an $11 million gain in 2023. \n44\nTable of Contents\nCF INDUSTRIES HOLDINGS, INC.\nAN Segment\nOur AN segment produces ammonium nitrate (AN). AN, which has a nitrogen content between 29% and 35%, is produced by combining anhydrous ammonia and nitric acid. AN is used as nitrogen fertilizer and is also used extensively by the commercial explosives industry as a component of explosives. AN is produced at our Yazoo City and Billingham complexes.\nThe following table presents summary operating data for our AN segment:  \n \nYear ended December 31,\n \n2024\n2023\n2022\n2024 v. 2023\n2023 v. 2022\n \n(in millions, except as noted)\nNet sales\n$\n419 \n$\n497 \n$\n845 \n$\n(78)\n(16)\n%\n$\n(348)\n(41)\n%\nCost of sales\n340 \n359 \n597 \n(19)\n(5)\n%\n(238)\n(40)\n%\nGross margin\n$\n79 \n$\n138 \n$\n248 \n$\n(59)\n(43)\n%\n$\n(110)\n(44)\n%\nGross margin percentage\n18.9 \n%\n27.8 \n%\n29.3 \n%\n(8.9)\n%\n(1.5)\n%\nSales volume by product tons (000s)\n1,464 \n1,571 \n1,594 \n(107)\n(7)\n%\n(23)\n(1)\n%\nSales volume by nutrient tons (000s)\n(1)\n501 \n538 \n545 \n(37)\n(7)\n%\n(7)\n(1)\n%\nAverage selling price per product ton\n$\n286 \n$\n316 \n$\n530 \n$\n(30)\n(9)\n%\n$\n(214)\n(40)\n%\nAverage selling price per nutrient ton\n(1)\n$\n836 \n$\n924 \n$\n1,550 \n$\n(88)\n(10)\n%\n$\n(626)\n(40)\n%\nGross margin per product ton\n$\n54 \n$\n88 \n$\n156 \n$\n(34)\n(39)\n%\n$\n(68)\n(44)\n%\nGross margin per nutrient ton\n(1)\n$\n158 \n$\n257 \n$\n455 \n$\n(99)\n(39)\n%\n$\n(198)\n(44)\n%\nDepreciation and amortization\n$\n39 \n$\n48 \n$\n61 \n$\n(9)\n(19)\n%\n$\n(13)\n(21)\n%\nUnrealized net mark-to-market gain on natural gas derivatives\n$\n(1)\n$\n(2)\n$\n(2)\n$\n1 \n50 \n%\n$\n— \n— \n%\n_______________________________________________________________________________\n(1)\nAN represents between 29% and 35% of nitrogen content. Nutrient tons represent the tons of nitrogen within the product tons.\nYear Ended December 31, 2024 Compared to Year Ended December 31, 2023  \nNet Sales.  \nNet sales in our AN segment decreased $78 million, or 16%, to $419 million in 2024 from $497 million in 2023 due primarily to a 9% decrease in average selling prices and a 7% decrease in sales volume. Average selling prices decreased to $286 per ton in 2024 compared to $316 per ton in 2023 as lower global energy costs reduced the global market clearing price required to meet global demand. Sales volume declined due primarily to lower supply availability resulting from lower production in 2024.\nCost of Sales.  \nCost of sales in our AN segment averaged $232 per ton in 2024, a 2% increase from $228 per ton in 2023. The increase was due primarily to higher costs for maintenance activity in North America, which was partially offset by the impact of lower realized natural gas costs, including the impact of realized derivatives, and, for our United Kingdom operations, a lower cost per ton for purchased ammonia used for upgrading into AN. \nGross Margin\n.  Gross margin in our AN segment decreased by $59 million, or 43%, to $79 million in 2024 from $138 million in 2023, and our gross margin percentage was 18.9% in 2024 compared to 27.8% in 2023. The decrease in gross margin was due primarily to a 9% decrease in average selling prices, which decreased gross margin by $65 million, and a 7% decrease in sales volume, which decreased gross margin by $14 million. These factors that decreased gross margin were partially offset by a decrease in realized natural gas costs, including the impact of realized derivatives, which increased gross margin by $12 million, and a net decrease in manufacturing, maintenance and other costs, which increased gross margin by $9 million. The net decrease in manufacturing, maintenance and other costs primarily reflects lower costs for purchased ammonia in the United Kingdom, partially offset by higher costs for maintenance activity in North America. Gross margin also includes the impact of a $1 million unrealized net mark-to-market gain on natural gas derivatives in 2024 compared to a $2 million gain in 2023.\n45\nTable of Contents\nCF INDUSTRIES HOLDINGS, INC.\nOther Segment\nOur Other segment primarily includes the following products:\n•\ndiesel exhaust fluid (DEF), an aqueous urea solution typically made with 32.5% or 50% high-purity urea and the remainder deionized water;\n•\nurea liquor, a liquid product that we sell in concentrations of 40%, 50% and 70% high-purity urea as a chemical intermediate; and \n•\nnitric acid, a nitrogen-based mineral acid that is used in the production of nitrate-based fertilizers, nylon precursors and other specialty chemicals. \nThe following table presents summary operating data for our Other segment: \n \nYear ended December 31,\n \n2024\n2023\n2022\n2024 v. 2023\n2023 v. 2022\n \n(in millions, except as noted)\nNet sales\n$\n503 \n$\n564 \n$\n787 \n$\n(61)\n(11)\n%\n$\n(223)\n(28)\n%\nCost of sales\n302 \n328 \n420 \n(26)\n(8)\n%\n(92)\n(22)\n%\nGross margin\n$\n201 \n$\n236 \n$\n367 \n$\n(35)\n(15)\n%\n$\n(131)\n(36)\n%\nGross margin percentage\n40.0 \n%\n41.8 \n%\n46.6 \n%\n(1.8)\n%\n(4.8)\n%\nSales volume by product tons (000s)\n2,101 \n2,206 \n2,077 \n(105)\n(5)\n%\n129 \n6 \n%\nSales volume by nutrient tons (000s)\n(1)\n411 \n434 \n408 \n(23)\n(5)\n%\n26 \n6 \n%\nAverage selling price per product ton\n$\n239 \n$\n256 \n$\n379 \n$\n(17)\n(7)\n%\n$\n(123)\n(32)\n%\nAverage selling price per nutrient ton\n(1)\n$\n1,224 \n$\n1,300 \n$\n1,929 \n$\n(76)\n(6)\n%\n$\n(629)\n(33)\n%\nGross margin per product ton\n$\n96 \n$\n107 \n$\n177 \n$\n(11)\n(10)\n%\n$\n(70)\n(40)\n%\nGross margin per nutrient ton\n(1)\n$\n489 \n$\n544 \n$\n900 \n$\n(55)\n(10)\n%\n$\n(356)\n(40)\n%\nDepreciation and amortization\n$\n61 \n$\n64 \n$\n67 \n$\n(3)\n(5)\n%\n$\n(3)\n(4)\n%\nUnrealized net mark-to-market (gain) loss on natural gas derivatives\n$\n(2)\n$\n(4)\n$\n3 \n$\n2 \n50 \n%\n$\n(7)\nN/M\n_______________________________________________________________________________\nN/M—Not Meaningful\n(1)\nNutrient tons represent the tons of nitrogen within the product tons.\nYear Ended December 31, 2024 Compared to Year Ended December 31, 2023 \nNet Sales.\n  Net sales in our Other segment decreased $61 million, or 11%, to $503 million in 2024 from $564 million in 2023 due to a 7% decrease in average selling prices and a 5% decrease in sales volume. Average selling prices decreased to $239 per ton in 2024 compared to $256 per ton in 2023 as lower global energy costs reduced the global market clearing price required to meet global demand. The decrease in sales volume was due primarily to lower DEF sales volume, partially offset by higher nitric acid sales volume.\nCost of Sales.\n  Cost of sales in our Other segment averaged $143 per ton in 2024, a 4% decrease from $149 per ton in 2023, due primarily to the impact of lower realized natural gas costs, including the impact of realized derivatives, partially offset by higher costs for maintenance activity.\nGross Margin\n.  Gross margin in our Other segment decreased by $35 million, or 15%, to $201 million in 2024 from $236 million in 2023, and our gross margin percentage was 40.0% in 2024 compared to 41.8% in 2023. The decrease in gross margin was due primarily to a 7% decrease in average selling prices, which decreased gross margin by $32 million, a 5% decrease in sales volume, which decreased gross margin by $23 million, and a net increase in manufacturing, maintenance and other costs, which decreased gross margin by $1 million. These factors that decreased gross margin were partially offset by a decrease in realized natural gas costs, including the impact of realized derivatives, which increased gross margin by $23 million. Gross margin includes the impact of a $2 million unrealized net mark-to-market gain on natural gas derivatives in 2024 compared to a $4 million gain in 2023.\n46\nTable of Contents\nCF INDUSTRIES HOLDINGS, INC.\nLiquidity and Capital Resources\nOur primary uses of cash are generally for operating costs, working capital, capital expenditures, debt service, investments, taxes, share repurchases, dividends, and our clean energy initiatives. Our working capital requirements are affected by several factors, including demand for our products, selling prices, raw material costs, freight costs and seasonal factors inherent in the business. We may also utilize our cash to fund acquisitions. In addition, we may from time to time seek to retire or purchase our outstanding debt through cash purchases, in open market or privately negotiated transactions or otherwise. Such repurchases, if any, will depend on prevailing market conditions, our liquidity requirements, contractual restrictions and other factors. The amounts involved may be material.\nGenerally, our primary source of cash is cash from operations, which includes cash generated by customer advances. We may also from time to time access the capital markets or engage in borrowings under our revolving credit agreement.  \nAs of December 31, 2024, our cash and cash equivalents balance was $1.61 billion, a decrease of $418 million from $2.03 billion at December 31, 2023. At December 31, 2024, we were in compliance with all applicable covenant requirements under our revolving credit agreement and senior notes, and unused borrowing capacity under our revolving credit agreement was $750 million. \nIn each of the quarters of 2024, quarterly dividends of $0.50 per common share were declared and paid, representing a 25% increase from the quarterly dividends of $0.40 per common share that were declared and paid in each of the quarters of 2023.\nCash Equivalents\nCash equivalents include highly liquid investments that are readily convertible to known amounts of cash with original maturities of three months or less. Under our short-term investment policy, we may invest our cash balances, either directly or through mutual funds, in several types of investment-grade securities, including notes and bonds issued by governmental entities or corporations. Securities issued by governmental entities include those issued directly by the U.S. and Canadian federal governments; those issued by state, local or other governmental entities; and those guaranteed by entities affiliated with governmental entities.\nCapital Spending \nWe make capital expenditures to sustain our asset base, increase our capacity or capabilities, improve plant efficiency, comply with various environmental, health and safety requirements, and invest in our clean energy strategy. Capital expenditures totaled $518 million in 2024 compared to $499 million in 2023. \nCapital expenditures in 2025 are estimated to be in the range of $500 million to $550 million. Planned capital expenditures are generally subject to change due to delays in regulatory approvals or permitting, unanticipated increases in cost, changes in scope and completion time, performance of third parties, delays in the receipt of equipment, adverse weather, defects in materials and workmanship, labor or material shortages, transportation constraints, acceleration or delays in the timing of the work and other unforeseen difficulties. Any of these changes in planned capital expenditures, individually or in the aggregate, could have a material impact on our results of operations and cash flows.\nIn addition, our decarbonization projects include FEED studies to inform our evaluation of whether, and how best, to invest in an export-oriented, low-carbon ammonia capacity at our Blue Point complex in Ascension Parish, Louisiana, to supply developing energy markets and traditional ammonia markets where demand for low-carbon product is emerging. Our estimated capital expenditures for 2025, which are described above, exclude any amounts that would be required in connection with this project, and such amounts could be significant. See “Overview of CF Holdings—Our Strategy,” above, for additional information on our clean energy initiatives.\nAcquisition of Waggaman Ammonia Production Facility\nOn December 1, 2023, we acquired an ammonia production facility located in Waggaman, Louisiana from Dyno Nobel Louisiana Ammonia, LLC (DNLA), a U.S. subsidiary of Australia-based Incitec Pivot Limited (IPL), pursuant to an asset purchase agreement with DNLA and IPL. In connection with the acquisition, we entered into a long-term ammonia offtake agreement providing for us to supply up to 200,000 tons of ammonia per year to IPL’s Dyno Nobel, Inc. subsidiary. Under the terms of the asset purchase agreement, $425 million of the purchase price of $1.675 billion, subject to adjustment, was allocated by the parties to the ammonia offtake agreement. We funded the balance of the initial purchase price on the acquisition date with $1.223 billion of cash on hand. \n47\nTable of Contents\nCF INDUSTRIES HOLDINGS, INC.\nThe consideration transferred on the acquisition date reflected an estimated net working capital adjustment and other adjustments to the purchase price, which was subject to further adjustment pursuant to the terms of the asset purchase agreement. The purchase price adjustments required under the asset purchase agreement were finalized in the second quarter of 2024, which resulted in a $2 million reduction in the purchase price. As a result, the final purchase price was $1.221 billion.\nShare Repurchase Programs\nOn November 3, 2021, our Board of Directors (the Board) authorized the repurchase of up to $1.5 billion of CF Holdings common stock through December 31, 2024 (the 2021 Share Repurchase Program). The 2021 Share Repurchase Program was completed in the second quarter of 2023. On November 2, 2022, the Board authorized the repurchase of up to $3 billion of CF Holdings common stock commencing upon completion of the 2021 Share Repurchase Program and effective through December 31, 2025 (the 2022 Share Repurchase Program). Repurchases under our share repurchase programs may be made from time to time in the open market, through privately negotiated transactions, through block transactions, through accelerated share repurchase programs, or otherwise. The manner, timing and amount of repurchases will be determined by our management based on the evaluation of market conditions, stock price, and other factors. \nThe following table summarizes the share repurchases under the 2022 Share Repurchase Program.\nShares\nAmounts\n(1)\n(in millions)\nShares repurchased in 2023:\nSecond quarter\n0.8 \n$\n50 \nThird quarter\n1.9 \n150 \nFourth quarter\n2.9 \n225 \nTotal shares repurchased in 2023\n5.6 \n$\n425 \nShares repurchased in 2024:\nFirst quarter\n4.3 \n$\n347 \nSecond quarter\n4.0 \n305 \nThird quarter\n6.1 \n476 \nFourth quarter\n4.4 \n385 \nTotal shares repurchased in 2024\n18.8 \n$\n1,513 \nShares repurchased as of December 31, 2024\n24.4 \n$\n1,938 \n______________________________________________________________________________\n(1)\nAs defined in the 2022 Share Repurchase Program, amounts reflect the price paid for the shares of common stock repurchased, excluding commissions paid to brokers and excise taxes.\n In 2024, we repurchased approximately 18.8 million shares under the 2022 Share Repurchase Program for approximately $1.51 billion, of which $10 million was accrued and unpaid as of December 31, 2024. In 2024, we retired approximately 18.7 million shares of repurchased stock, and we held approximately 0.4 million shares of treasury stock as of December 31, 2024.\nIn 2023, we completed the 2021 Share Repurchase Program with the repurchase of approximately 2.3 million shares for $155 million, and we repurchased 5.6 million shares under the 2022 Share Repurchase Program for $425 million.\nGovernment Policies\nThe policies or laws of governments around the world can result in the imposition of taxes, duties, tariffs or other restrictions or regulatory requirements on imports and exports of raw materials, finished goods or services from a particular country or region of the world. The policies and laws of governments can also impact the subsidization of natural gas prices, and subsidies or quotas applied to domestic producers or farmers. Due to the critical role that fertilizers play in food production, the construction and operation of fertilizer plants often are influenced by economic, political and social objectives. Additionally, the import or export of fertilizer can be subject to local taxes imposed by governments which can have the effect of either encouraging or discouraging import and export activity. The impact of changes in governmental policies or laws or the political or social objectives of a country could have a material impact on fertilizer demand and selling prices and therefore could impact our liquidity. In addition, changing political leadership, including the new U.S. presidential administration and regulatory leadership, have proposed, and may propose further, policy, regulatory, and enforcement changes, which are and may continue to be subject to administrative and judicial challenges, that create additional uncertainty for our business.\n48\nTable of Contents\nCF INDUSTRIES HOLDINGS, INC.\nCanada Revenue Agency Competent Authority Matter\nIn connection with the matter described above under “Items Affecting Comparability of Results—Canada Revenue Agency Competent Authority Matter,” in the third quarter of 2024, we were informed that the CRA granted us discretionary interest relief for certain tax years from 2006 through 2011. In the fourth quarter of 2024, we received interest relief from the CRA consisting of interest refunds of $21 million and related interest of $2 million. In addition, interest relief from the Alberta TRA is estimated to be approximately $16 million, consisting of interest refunds of $15 million and related interest of $1 million, based on current estimates and foreign currency exchange rates as of December 31, 2024. We expect to receive the interest refunds from the Alberta TRA in the first half of 2025.\nRepatriation of Foreign Earnings and Income Taxes \nWe have operations in Canada, the United Kingdom and a 50% interest in a joint venture in Trinidad. Historically, the estimated additional U.S. and foreign income taxes due upon repatriation of the earnings of these foreign operations to the United States were recognized in our consolidated financial statements as the earnings were recognized, unless the earnings were considered to be permanently reinvested based upon our then current plans. However, the cash payment of the income tax liabilities associated with repatriation of earnings from foreign operations occurred at the time of the repatriation. As a result, the recognition of income tax expense related to foreign earnings, as applicable, and the payment of taxes resulting from repatriation of those earnings could occur in different periods. \nIn light of changes made by the Tax Cuts and Jobs Act, commencing with the 2018 tax year, the United States no longer taxes earnings of foreign subsidiaries even when such earnings are earned or repatriated to the United States, unless such earnings are subject to U.S. rules on passive income or certain anti-abuse provisions. Foreign subsidiary earnings may still be subject to withholding taxes when repatriated to the United States.\nCash balances held by our joint venture are maintained at sufficient levels to fund local operations as accumulated earnings are repatriated from the joint venture on a periodic basis.\nAs of December 31, 2024, approximately $346 million of our consolidated cash and cash equivalents balance of $1.61 billion was held by our Canadian and United Kingdom subsidiaries. As of December 31, 2024, we recorded a deferred tax liability of $14 million on the undistributed earnings of our Canadian subsidiaries for which the Company does not have an indefinite reinvestment assertion. We have not provided for deferred taxes on the remainder of undistributed earnings from our foreign subsidiaries because such earnings would not give rise to additional tax liabilities upon repatriation.\nDebt\nRevolving Credit Agreement \nWe have a senior unsecured revolving credit agreement (the Revolving Credit Agreement), which provides for a revolving credit facility of up to $750 million with a maturity of October 26, 2028 and includes a letter of credit sub-limit of $125 million. Borrowings under the Revolving Credit Agreement may be used for working capital, capital expenditures, acquisitions, share repurchases and other general corporate purposes. CF Industries is the lead borrower, and CF Holdings is the sole guarantor, under the Revolving Credit Agreement.\nBorrowings under the Revolving Credit Agreement can be denominated in U.S. dollars, Canadian dollars, euros and British pounds. Borrowings in U.S. dollars bear interest at a per annum rate equal to, at our option, an applicable adjusted term Secured Overnight Financing Rate or base rate plus, in either case, a specified margin. We are required to pay an undrawn commitment fee on the undrawn portion of the commitments under the Revolving Credit Agreement and customary letter of credit fees. The specified margin and the amount of the commitment fee depend on CF Holdings’ credit rating at the time.\nThe Revolving Credit Agreement contains representations and warranties and affirmative and negative covenants, including one financial covenant. The financial covenant requires that the total net leverage ratio (as defined in the Revolving Credit Agreement) be not greater than 3.75:1.00 (the Maximum Total Net Leverage Ratio) as of the last day of each fiscal quarter, provided that, if any borrower or subsidiary consummates a material acquisition during any fiscal quarter, CF Industries may elect to increase the Maximum Total Net Leverage Ratio to 4.25:1.00 for the period of four consecutive fiscal quarters commencing with such fiscal quarter (and no further such election may be made unless and until the Maximum Total Net Leverage Ratio is less than or equal to 3.75:1.00 as of the end of two consecutive fiscal quarters after the end of such period).\nAs of December 31, 2024, we were in compliance with all covenants under the Revolving Credit Agreement. \n49\nTable of Contents\nCF INDUSTRIES HOLDINGS, INC.\nThe Revolving Credit Agreement contains events of default (with notice requirements and cure periods, as applicable) customary for a financing of this type, including, but not limited to, non-payment of principal, interest or fees; inaccuracy of representations and warranties in any material respect; and failure to comply with specified covenants. Upon the occurrence and during the continuance of an event of default under the Revolving Credit Agreement and after any applicable cure period, subject to specified exceptions, the administrative agent may, and at the request of the requisite lenders is required to, accelerate the loans under the Revolving Credit Agreement or terminate the lenders’ commitments under the Revolving Credit Agreement.\nAs of December 31, 2024, we had unused borrowing capacity under the Revolving Credit Agreement of $750 million and no outstanding letters of credit under the Revolving Credit Agreement. As of December 31, 2024 and 2023, and during the years then ended, there were no borrowings outstanding under the Revolving Credit Agreement. \nLetters of Credit Under Bilateral Agreement\nWe are party to a bilateral agreement providing for the issuance of up to $425 million of letters of credit. As of December 31, 2024, approximately $324 million of letters of credit were outstanding under this agreement.\nSenior Notes\nLong-term debt presented on our consolidated balance sheets as of December 31, 2024 and 2023 consisted of the following debt securities issued by CF Industries:  \n \nEffective Interest Rate\nDecember 31, 2024\nDecember 31, 2023\nPrincipal Outstanding\nCarrying Amount\n(1)\nPrincipal Outstanding\nCarrying Amount\n(1)\n \n(in millions)\nPublic Senior Notes:\n5.150% due March 2034\n5.293%\n$\n750 \n$\n742 \n$\n750 \n$\n741 \n4.950% due June 2043\n5.040%\n750 \n742 \n750 \n742 \n5.375% due March 2044\n5.478%\n750 \n741 \n750 \n741 \nSenior Secured Notes:\n4.500% due December 2026\n(2)\n4.783%\n750 \n746 \n750 \n744 \nTotal long-term debt\n$\n3,000 \n$\n2,971 \n$\n3,000 \n$\n2,968 \n_______________________________________________________________________________\n(1)\nCarrying amount is net of unamortized debt discount and deferred debt issuance costs. Total unamortized debt discount was $6 million and $7 million as of December 31, 2024 and 2023, respectively, and total deferred debt issuance costs were $23 million and $25 million as of December 31, 2024 and 2023, respectively.    \n(2)\nEffective August 23, 2021, these notes are no longer secured, in accordance with the terms of the applicable indenture.\nPublic Senior Notes\nUnder the indentures (including the applicable supplemental indentures) governing our senior notes due 2034, 2043 and 2044 identified in the table above (the Public Senior Notes), each series of Public Senior Notes is guaranteed by CF Holdings. Interest on the Public Senior Notes is payable semiannually, and the Public Senior Notes are redeemable at our option, in whole at any time or in part from time to time, at specified make-whole redemption prices. \nThe indentures governing the Public Senior Notes contain covenants that limit, among other things, the ability of CF Holdings and its subsidiaries, including CF Industries, to incur liens on certain assets to secure debt, to engage in sale and leaseback transactions, to merge or consolidate with other entities and to sell, lease or transfer all or substantially all of the assets of CF Holdings and its subsidiaries to another entity. Each of the indentures governing the Public Senior Notes provides for customary events of default, which include (subject in certain cases to customary grace and cure periods), among others, nonpayment of principal or interest on the applicable Public Senior Notes; failure to comply with other covenants or agreements under the indenture; certain defaults on other indebtedness; the failure of CF Holdings’ guarantee of the applicable Public Senior Notes to be enforceable; and specified events of bankruptcy or insolvency. Under each indenture governing the Public Senior Notes, in the case of an event of default arising from one of the specified events of bankruptcy or insolvency, the applicable Public Senior Notes would become due and payable immediately, and, in the case of any other event of default (other than an event of default related to CF Industries’ and CF Holdings’ reporting obligations), the trustee or the holders of at least 25% in aggregate principal amount of the applicable Public Senior Notes then outstanding may declare all of such Public Senior Notes to be due and payable immediately.\n50\nTable of Contents\nCF INDUSTRIES HOLDINGS, INC.\nUnder each of the indentures governing the Public Senior Notes, specified changes of control involving CF Holdings or CF Industries, when accompanied by a ratings downgrade, as defined with respect to the applicable series of Public Senior Notes, constitute change of control repurchase events. Upon the occurrence of a change of control repurchase event with respect to a series of Public Senior Notes, unless CF Industries has exercised its option to redeem such Public Senior Notes, CF Industries will be required to offer to repurchase them at a price equal to 101% of the principal amount thereof, plus accrued and unpaid interest, if any, to, but not including, the date of repurchase.\nSenior Secured Notes\nUnder the terms of the indenture governing the 4.500% senior secured notes due 2026 (the 2026 Notes), the 2026 Notes are guaranteed by CF Holdings. Interest on the 2026 Notes is payable semiannually, and the 2026 Notes are redeemable at our option, in whole at any time or in part from time to time, at specified make-whole redemption prices.\nUnder the indenture governing the 2026 Notes, specified changes of control involving CF Holdings or CF Industries, when accompanied by a ratings downgrade, as defined with respect to the 2026 Notes, constitute change of control repurchase events. Upon the occurrence of a change of control repurchase event with respect to the 2026 Notes, unless CF Industries has exercised its option to redeem such notes, CF Industries will be required to offer to repurchase them at a price equal to 101% of the principal amount thereof, plus accrued and unpaid interest, if any, to, but not including, the date of repurchase.\nThe indenture governing the 2026 Notes contains covenants that limit, among other things, the ability of CF Holdings and its subsidiaries, including CF Industries, to incur liens on certain assets to secure debt, to engage in sale and leaseback transactions, to merge or consolidate with other entities and to sell, lease or transfer all or substantially all of the assets of CF Holdings and its subsidiaries to another entity. The indenture governing the 2026 Notes provides for customary events of default, which include (subject in certain cases to customary grace and cure periods), among others, nonpayment of principal or interest of the 2026 Notes; failure to comply with other covenants or agreements under the indenture; certain defaults on other indebtedness; the failure of CF Holdings’ guarantee of the 2026 Notes to be enforceable; and specified events of bankruptcy or insolvency. Under the indenture governing the 2026 Notes, in the case of an event of default arising from one of the specified events of bankruptcy or insolvency, the 2026 Notes would become due and payable immediately, and, in the case of any other event of default (other than an event of default related to CF Industries’ and CF Holdings’ reporting obligations), the trustee or the holders of at least 25% in aggregate principal amount of the 2026 Notes then outstanding may declare all of such notes to be due and payable immediately.\nForward Sales and Customer Advances\nWe offer our customers the opportunity to purchase products from us on a forward basis at prices and on delivery dates we propose. Therefore, our reported fertilizer selling prices and margins may differ from market spot prices and margins available at the time of shipment.  \nCustomer advances, which typically represent a portion of the contract’s value, are received shortly after the contract is executed, with any remaining unpaid amount generally being collected by the time control transfers to the customer, thereby reducing or eliminating the accounts receivable related to such sales. Any cash payments received in advance from customers in connection with forward sales contracts are reflected on our consolidated balance sheets as a current liability until control transfers and revenue is recognized. As of December 31, 2024 and 2023, we had $118 million and $130 million, respectively, in customer advances on our consolidated balance sheets.\nWhile customer advances are generally a significant source of liquidity, the level of forward sales contracts is affected by many factors, including current market conditions, our customers’ outlook of future market fundamentals and seasonality. During periods of declining prices, customers tend to delay purchasing fertilizer in anticipation that prices in the future will be lower than the current prices. If the level of sales under our forward sales programs were to decrease in the future, our cash received from customer advances would likely decrease and our accounts receivable balances would likely increase. Additionally, borrowing under the Revolving Credit Agreement could become necessary. Due to the volatility inherent in our business and changing customer expectations, we cannot estimate the amount of future forward sales activity.\nUnder our forward sales programs, a customer may delay delivery of an order due to weather conditions or other factors. These delays generally subject the customer to potential charges for storage or may be grounds for termination of the contract by us. Such a delay in scheduled shipment or termination of a forward sales contract due to a customer’s inability or unwillingness to perform may negatively impact our reported sales.\n51\nTable of Contents\nCF INDUSTRIES HOLDINGS, INC.\nNatural Gas\nNatural gas is the principal raw material used to produce our nitrogen products. We use natural gas both as a chemical feedstock and as a fuel to produce ammonia, granular urea, UAN, AN and other products. Expenditures on natural gas are a significant portion of our production costs, representing approximately 28% of our total production costs in 2024. As a result of these factors, natural gas prices have a significant impact on our operating expenses and can thus affect our liquidity. Natural gas costs in our cost of sales, including the impact of realized natural gas derivatives, decreased 35% to $2.40 per MMBtu in 2024 from $3.67 per MMBtu in 2023. \nWe enter into agreements for a portion of our future natural gas supply and related transportation. As of December 31, 2024, our natural gas purchase agreements have remaining terms that range from five months to five years and a total minimum commitment of approximately $2.64 billion, and our natural gas transportation agreements have terms that range from one to eight years and a total minimum commitment of approximately $62 million. Our minimum commitments to purchase and transport natural gas are based on prevailing market-based forward prices excluding reductions for plant maintenance and turnaround activities.  \nMost of our nitrogen manufacturing facilities are located in the United States and Canada. As a result, the price of natural gas in North America directly impacts a substantial portion of our operating expenses. During the three-year period ended December 31, 2024, the daily closing price at the Henry Hub, the most heavily-traded natural gas pricing point in North America, reached a low of $1.23 per MMBtu on four consecutive days in November 2024 and a high of $12.97 per MMBtu on four consecutive days in January 2024.\nDerivative Financial Instruments\nWe use derivative financial instruments to reduce our exposure to changes in prices for natural gas that will be purchased in the future. Natural gas is the largest and most volatile component of our manufacturing cost for nitrogen-based products. From time to time, we may also use derivative financial instruments to reduce our exposure to changes in foreign currency exchange rates. Volatility in reported quarterly earnings can result from the unrealized mark-to-market adjustments in the value of the derivatives. In 2024 and 2023, we recognized unrealized net mark-to-market gains on natural gas derivatives of $35 million and $39 million, respectively, which is reflected in cost of sales in our consolidated statements of operations.\nDerivatives expose us to counterparties and the risks associated with their ability to meet the terms of the contracts. For derivatives that are in net asset positions, we are exposed to credit loss from nonperformance by the counterparties. We control our credit risk through the use of multiple counterparties that are multinational commercial banks, other major financial institutions or large energy companies, and the use of International Swaps and Derivatives Association (ISDA) master netting arrangements. The ISDA agreements are master netting arrangements commonly used for over-the-counter derivatives that mitigate exposure to counterparty credit risk, in part, by creating contractual rights of netting and setoff, the specifics of which vary from agreement to agreement.\nThe ISDA agreements for most of our derivative instruments contain credit-risk-related contingent features, such as cross default provisions. In the event of certain defaults or termination events, our counterparties may request early termination and net settlement of certain derivative trades or may require us to collateralize derivatives in a net liability position. As of December 31, 2024 and 2023, the aggregate fair value of the derivative instruments with credit-risk-related contingent features in net liability positions was zero and $34 million, respectively, which also approximates the fair value of the assets that may be needed to settle the obligations if the credit-risk-related contingent features were triggered at the reporting dates. \nAs of December 31, 2024, our open natural gas derivative contracts consisted of natural gas fixed price swaps and basis swaps for 16.0 million MMBtus. As of December 31, 2023, our open natural gas derivative contracts consisted of natural gas fixed price swaps, basis swaps and options for 49.0 million MMBtus. At both December 31, 2024 and 2023, we had no cash collateral on deposit with counterparties for derivative contracts. The credit support documents executed in connection with certain of our ISDA agreements generally provide us and our counterparties the right to set off collateral against amounts owing under the ISDA agreements upon the occurrence of a default or a specified termination event.\nDefined Benefit Pension Plans\nWe made cash contributions of $22 million to our pension plans in 2024. We expect to contribute approximately $6 million in total to our U.S. and U.K. pension plans in 2025, and, as currently agreed with the plans’ trustees, approximately $13 million to our U.K. pension plans in 2026.\n52\nTable of Contents\nCF INDUSTRIES HOLDINGS, INC.\nDistributions to Noncontrolling Interest in CFN \nThe CFN Board of Managers approved semi-annual distribution payments for the years ended December 31, 2024, 2023 and 2022, in accordance with CFN’s limited liability company agreement, as follows:  \nApproved and paid\nDistribution Period\nDistribution Amount \n(in millions)\nFirst quarter of 2025\nSix months ended December 31, 2024\n$\n129 \nThird quarter of 2024\nSix months ended June 30, 2024\n164 \nFirst quarter of 2024\nSix months ended December 31, 2023\n144 \nThird quarter of 2023\nSix months ended June 30, 2023\n204 \nFirst quarter of 2023\nSix months ended December 31, 2022\n255 \nThird quarter of 2022\nSix months ended June 30, 2022\n372 \nCash Flows\nNet cash provided by operating activities in 2024 was $2.27 billion, a decrease of $486 million compared to $2.76 billion in 2023. The decrease in cash flow from operations was due primarily to lower net earnings. Net earnings in 2024 was $1.48 billion, a decrease of $361 million compared to $1.84 billion in 2023. The decrease in net earnings was due primarily to a decrease in gross margin, driven by lower average selling prices, partially offset by lower natural gas costs, a lower income tax provision and a decrease in net earnings attributable to noncontrolling interest. During 2024, net changes in working capital also impacted cash flow from operations by contributing $63 million more toward net cash from operations in 2024 than in 2023. These changes primarily occurred in changes in accounts payable, accrued expenses and customer advances, partially offset by changes in inventories.\nNet cash used in investing activities was $469 million in 2024 compared to $1.68 billion in 2023, or a decrease of $1.21 billion. The decrease was due primarily to the consideration paid of $1.223 billion for the Waggaman acquisition in 2023. See “Acquisition of Waggaman Ammonia Production Facility,” above for additional information. During 2024, capital expenditures totaled $518 million compared to $499 million in 2023. \nNet cash used in financing activities was $2.21 billion in 2024 compared to $1.37 billion in 2023. The increase was due primarily to an increase in share repurchases and dividends paid, partially offset by a decrease in distributions to the noncontrolling interest. In 2024, we paid $1.51 billion for share repurchases compared to $580 million for share repurchases in 2023. In 2024, dividends paid on common stock were $364 million compared to $311 million in 2023. The increase in dividends paid on common stock reflects quarterly dividends of $0.50 per common share declared and paid in 2024, compared to quarterly dividends of $0.40 per common share that were declared and paid in 2023. In 2024, distributions to the noncontrolling interest were $308 million compared to $459 million in 2023 due to lower earnings of CFN. \nCritical Accounting Estimates \nOur discussion and analysis of our financial condition, results of operations, liquidity and capital resources is based upon our consolidated financial statements, which have been prepared in accordance with U.S. GAAP. U.S. GAAP requires that we select policies and make estimates and judgments that affect the reported amounts of assets, liabilities, revenues, expenses and related disclosure of contingent assets and liabilities. On an ongoing basis, we evaluate our estimates. We base our estimates on historical experience, technological assessment, opinions of appropriate outside experts, and the most recent information available to us. Actual results may differ from these estimates. Changes in estimates that may have a material impact on our results are discussed in the context of the underlying financial statements to which they relate. The following discussion presents information about our most critical accounting estimates.\nRecoverability of Long-Lived Assets, Goodwill and Investment in Unconsolidated Affiliate\nWe review the carrying values of our property, plant and equipment and other long-lived assets, including our finite-lived intangible assets, goodwill and our investment in an unconsolidated affiliate in accordance with U.S. GAAP in order to assess recoverability. Factors that we must estimate when performing impairment tests include production and sales volumes, selling prices, raw material costs, operating rates, operating expenses, inflation, discount rates, exchange rates, tax rates, capital spending and the impact that future market dynamics and geopolitical events could have on these factors. Judgment is involved in estimating each of these factors, which include inherent uncertainties. The factors we use are consistent with those used in our internal planning process. The recoverability of the values associated with our goodwill, long-lived assets and our investment in an unconsolidated affiliate is dependent upon future operating performance of the specific businesses to which \n53\nTable of Contents\nCF INDUSTRIES HOLDINGS, INC.\nthey are attributed. Certain of the operating assumptions are particularly sensitive to the cyclical nature of the fertilizer industry. Adverse changes in demand for our products, increases in supply and the availability and costs of key raw materials could significantly affect the results of our review. \nThe recoverability and impairment tests of long-lived assets are required only when conditions exist that indicate the carrying value may not be recoverable. For goodwill, impairment tests are required at least annually, or more frequently whenever events or circumstances indicate that the carrying value may not be recoverable. Our investment in an unconsolidated affiliate is reviewed for impairment whenever events or circumstances indicate that its carrying value may not be recoverable. When circumstances indicate that the fair value of our investment is less than its carrying value, and the reduction in value is other than temporary, the reduction in value would be recognized immediately in earnings.\nWe evaluate goodwill for impairment in the fourth quarter at the reporting unit level. Our evaluation generally begins with a qualitative assessment of the factors that could impact the significant inputs used to estimate fair value. If after performing the qualitative assessment, we determine that it is not more likely than not that the fair value of a reporting unit is less than its carrying amount, including goodwill, then no further analysis is necessary. However, if it is unclear based on the results of the qualitative test, we perform a quantitative test, which involves comparing the fair value of a reporting unit with its carrying amount, including goodwill. We use an income-based valuation method, determining the present value of future cash flows, to estimate the fair value of a reporting unit. If the fair value of a reporting unit exceeds its carrying amount, no further testing is necessary. If the fair value of the reporting unit is less than its carrying amount, goodwill impairment would be recognized equal to the amount of the carrying value in excess of the reporting unit’s fair value, limited to the total amount of goodwill allocated to the reporting unit.\nWe review property, plant and equipment and other long-lived assets at the asset group level in order to assess recoverability based on expected future undiscounted cash flows. If the sum of the expected future net undiscounted cash flows is less than the carrying value, an impairment loss would be recognized. The impairment loss is measured as the amount by which the carrying value exceeds the fair value of the long-lived assets.\nPLNL is our joint venture investment in Trinidad and operates an ammonia plant that relies on natural gas supplied, under a gas sales contract, by the National Gas Company of Trinidad and Tobago Limited (NGC). The joint venture is accounted for under the equity method. The joint venture experienced past curtailments in the supply of natural gas from NGC, which reduced the ammonia production at PLNL. The prior gas sales contract had an expiration date of September 2023. In the third quarter of 2023, PLNL entered into a new gas sales contract with NGC (the New NGC Contract), which is effective October 2023 through December 2025. In the third quarter of 2023 and due to the terms of the New NGC Contract, we assessed our investment in PLNL for impairment and determined that the carrying value of our equity method investment in PLNL exceeded its fair value. As a result, we recorded an impairment of our equity method investment in PLNL of $43 million, which is reflected in equity in earnings (loss) of operating affiliate in our consolidated statement of operations for the year ended December 31, 2023.\nAny NGC commitment to supply gas beyond December 2025 will be based on new agreements. If NGC does not make sufficient quantities of natural gas available to PLNL at prices that permit profitable operations, PLNL may cease operating its facility and we would write off the remaining investment in PLNL. The carrying value of our equity method investment in PLNL at December 31, 2024 was $29 million. \nProjected Benefit Obligations\nThe projected benefit obligations (PBOs) for our defined benefit pension plans are affected by plan design, actuarial estimates and discount rates. Key assumptions that affect our PBO are discount rates and, in addition for our United Kingdom plans, inflation rates, including an adjusted U.K. retail price index (RPI).  \nThe December 31, 2024 PBO was computed based on a weighted-average discount rate of 5.2% for our North America plans and 5.5% for our United Kingdom plans, which were based on yields for high-quality (AA rated or better) fixed income debt securities that match the timing and amounts of expected benefit payments as of the measurement date of December 31, 2024. Declines in comparable bond yields would increase our PBO. For our United Kingdom plans, the 3.1% RPI used to calculate our PBO is developed using a U.K. government gilt prices only retail price inflation curve, which is based on the difference between yields on fixed interest government bonds and index-linked government bonds.\nFor North America qualified pension plans, our PBO was $278 million as of December 31, 2024, which was $21 million lower than pension plan assets. For our United Kingdom pension plans, our PBO was $317 million as of December 31, 2024, which was $28 million lower than pension plan assets. The table below estimates the impact of a 50 basis point increase or decrease in the key assumptions on our December 31, 2024 PBO: \n54\nTable of Contents\nCF INDUSTRIES HOLDINGS, INC.\nIncrease/(Decrease) in December 31, 2024 PBO\nNorth America Plans\nUnited Kingdom Plans\nAssumption\n+50 bps\n-50 bps\n+50 bps\n-50 bps\n(in millions)\nDiscount Rate\n$\n(15)\n$\n17 \n$\n(16)\n$\n17 \nRPI\nn/a\nn/a\n9 \n(9)\n_______________________________________________________________________________\nn/a—not applicable\nSee Note 13—Pension and Other Postretirement Benefits for further discussion of our pension plans.\nIncome Taxes\nWe are subject to the income tax laws of the many jurisdictions in which we operate, and we recognize expense, assets and liabilities based on estimates of amounts that ultimately will be determined to be taxable or deductible in tax returns filed in various jurisdictions. These tax laws are complex, and how they apply to our facts is sometimes open to interpretation. We recognize the effect of income tax positions only if sustaining those positions is more likely than not. Tax positions that meet the more likely than not recognition threshold but are not highly certain are measured based on the largest amount of benefit that is greater than 50% likely of being realized upon settlement with the taxing authority. Differences in interpretation of the tax laws and regulations, including negotiations with taxing authorities in various jurisdictions and resolution of disputes arising from federal, state and international tax audits, can result in differences in taxes paid, which may be higher or lower than our estimates. The judgments made at a point in time may change from previous conclusions based on the outcome of tax audits, as well as changes to, or further interpretations of, tax laws and regulations, and these changes could significantly impact the provision for income taxes, the amount of taxes payable and the deferred tax asset and liability balances. We adjust our income tax provision in the period in which these changes occur. As of December 31, 2024, we have recorded a reserve for unrecognized tax benefits, including penalties and interest, of $285 million.\nWe also engage in a significant amount of cross border transactions. The taxability of cross border transactions has received an increasing level of scrutiny among regulators across the globe, including the jurisdictions in which we operate. The tax rules and regulations of the various jurisdictions in which we operate are complex, and in many cases, there is not symmetry between the rules of the various jurisdictions. As a result, there are instances where regulators within the jurisdictions involved in a cross-border transaction may reach different conclusions regarding the taxability of the transaction in their respective jurisdictions based on the same set of facts and circumstances. We work closely with regulators to reach a common understanding and conclusion regarding the taxability of cross border transactions. \nRecent Accounting Pronouncements\nSee Note 3—New Accounting Standards for a discussion of recent accounting pronouncements.\n55\nTable of Contents\nCF INDUSTRIES HOLDINGS, INC.",
  "item2": null
}