{
  "source_file": "cfg-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "ITEM 2. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nPage\nForward-Looking Statements\n \n6\nIntroduction\n \n7\nExecutive Summary\n7\nResults of Operations\n9\nAnalysis of Financial Condition\n14\nBusiness Segments\n20\nRisk Management\n21\nCredit Risk\n22\nMarket Risk\n22\nLiquidity Risk\n25\nOperational Risk\n28\nCompliance Risk\n29\nCapital\n29\nCritical Accounting Estimates\n32\nAccounting and Reporting Developments\n34\nNon-GAAP Financial Measures\n35\nCitizens Financial Group, Inc. | 5\nFORWARD-LOOKING STATEMENTS\nThis document contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. Any statement that does not describe historical or current facts is a forward-looking statement. These statements often include the words “believes,” “expects,” “anticipates,” “estimates,” “intends,” “plans,” “goals,” “targets,” “initiatives,” “potentially,” “probably,” “projects,” “outlook,” “guidance” or similar expressions or future conditional verbs such as “may,” “will,” “likely,” “should,” “would,” and “could.” \nForward-looking statements are based upon the current beliefs and expectations of management, and on information currently available to management. Our statements speak as of the date hereof, and we do not assume any obligation to update these statements or to update the reasons why actual results could differ from those contained in such statements in light of new information or future events. We caution you, therefore, against relying on any of these forward-looking statements. They are neither statements of historical fact nor guarantees or assurances of future performance. While there is no assurance that any list of risks and uncertainties or risk factors is complete, important factors that could cause actual results to differ materially from those in the forward-looking statements include the following, without limitation: \n•\nNegative economic, business, and political conditions, including as a result of the interest rate environment, supply chain disruptions, tariffs, inflationary pressures, and labor shortages that adversely affect the general economy, housing prices, the job market, consumer confidence, and spending habits; \n•\nThe general state of the economy and employment, as well as general business and economic conditions, and changes in the competitive environment; \n•\nOur capital and liquidity requirements under regulatory standards and our ability to generate capital and liquidity on favorable terms;\n•\nThe effect of changes in our credit ratings on our cost of funding, access to capital markets, ability to market our securities, and overall liquidity position;\n•\nThe effect of changes in the level of commercial and consumer deposits on our funding costs and net interest margin;\n•\nOur ability to execute on our strategic business initiatives and achieve our financial performance goals across our Consumer and Commercial businesses, including our Private Bank;\n•\nThe effects of geopolitical instability, including the wars in Ukraine and the Middle East, on economic and market conditions, inflationary pressures and the interest rate environment, commodity price and foreign exchange rate volatility, and heightened cybersecurity risks;\n•\nOur ability to comply with heightened supervisory requirements and expectations as well as new or amended regulations; \n•\nLiabilities and business restrictions resulting from litigation and regulatory investigations; \n•\nThe effect of changes in interest rates on our net interest income, net interest margin, mortgage originations, mortgage servicing rights, and mortgages held for sale; \n•\nChanges in interest rates and market liquidity, as well as the magnitude of such changes, which may reduce interest margins, impact funding sources, and affect the ability to originate and distribute financial products in the primary and secondary markets; \n•\nFinancial services reform and other current, pending, or future legislation or regulation that could have a negative effect on our revenue and businesses; \n•\nEnvironmental risks, such as physical or transition risks associated with climate change, and social and governance risks that could adversely affect our reputation, operations, business, and customers; \n•\nA failure in, or breach of, our compliance with laws, as well as operational or security systems or infrastructure, or those of our third-party vendors or other service providers, including as a result of cyberattacks; and \n•\nManagement’s ability to identify and manage these and other risks. \nCitizens Financial Group, Inc. | 6\nIn addition to the above factors, we also caution that the actual amounts and timing of any future common stock dividends or share repurchases will be subject to various factors, including our capital position, financial performance, balance sheet growth, market conditions, and regulatory considerations, as well as any other factors that our Board of Directors deems relevant in making such a determination. Therefore, there can be no assurance that we will repurchase shares from, or pay any dividends to, holders of our common stock, or as to the amount of any such repurchases or dividends.\nMore information about factors that could cause actual results to differ materially from those described in the forward-looking statements can be found in the “Risk Factors” section in Part I, Item 1A of our 2024 Form 10-K.\nINTRODUCTION\nCitizens Financial Group, Inc. is one of the nation’s oldest and largest financial institutions, with $222.7 billion in assets as of September 30, 2025. Headquartered in Providence, Rhode Island, we offer a broad range of retail and commercial banking products and services to individuals, small businesses, middle-market companies, large corporations, and institutions. We help our customers reach their potential by listening to them and by understanding their needs in order to offer tailored advice, ideas, and solutions. In Consumer Banking, we provide an integrated experience that includes mobile and online banking, a full-service customer contact center, and the convenience of approximately 3,100 ATMs and approximately 1,000 branches in 14 states and the District of Columbia. Consumer Banking products and services include a full range of banking, lending, savings, wealth management, and small business offerings. In Commercial Banking, we offer a broad complement of financial products and solutions, including lending and leasing, deposit and treasury management services, foreign exchange, interest rate and commodity risk management solutions, as well as loan syndication, corporate finance, merger and acquisition, and debt and equity capital markets capabilities. \nThe following MD&A is intended to assist readers in their analysis of the accompanying unaudited interim Consolidated Financial Statements and supplemental financial information. It should be read in conjunction with the unaudited interim Consolidated Financial Statements and Notes to Consolidated Financial Statements in Part I, Item 1, as well as other information contained in this document and our 2024 Form 10-K.\nEXECUTIVE SUMMARY\nThis summary highlights select financial information of the Company as well as information regarding certain significant events and transactions occurring during the nine months ended September 30, 2025. This summary should be read in conjunction with this entire document for a more complete understanding of trends, events, commitments, uncertainties, liquidity, capital resources, and critical accounting policies and estimates. Each of these items, taken individually or collectively, could have an impact on the Company’s financial condition, results of operations, and cash flows. For additional information regarding our financial performance and condition, see “Results of Operations” and “Analysis of Financial Condition.”\nKey Financial Highlights\n•\nNet income of $494 million and $1.3 billion for the three and nine months ended September 30, 2025, respectively, increased $112 million and $195 million, with earnings per diluted common share up $0.28 to $1.05 and up $0.54 to $2.74, compared to the same periods in 2024.\n•\nNet interest income of $1.5 billion and $4.3 billion for the three and nine months ended September 30, 2025, respectively, increased $119 million and $95 million compared to the same periods in 2024, driven by higher net interest margin reflecting lower funding costs, the time-based benefits of the Non-Core portfolio runoff, terminated swap impacts, and fixed-rate asset repricing benefits. \n•\nNet interest margin on an FTE basis of 3.00% and 2.95% for the three and nine months ended September 30, 2025, respectively, increased 23 basis points and 10 basis points compared to the same periods in 2024, driven by lower funding costs, the time-based benefits of the Non-Core portfolio runoff, terminated swap impacts, and fixed-rate asset repricing benefits.\n•\nNoninterest income of $630 million and $1.8 billion for the three and nine months ended September 30, 2025, respectively, increased $98 million and $172 million compared to the same periods in 2024, primarily driven by higher wealth, mortgage banking, capital markets, and service charge fees. \nCitizens Financial Group, Inc. | 7\n•\nNoninterest expense of $1.3 billion and $4.0 billion for the three and nine months ended September 30, 2025, respectively, increased $76 million and $50 million compared to the same periods in 2024, driven by salaries and employee benefits reflecting hiring related to the Private Bank and Private Wealth build-out, strong capital markets fee performance, and increased medical benefit costs. The increase during the nine-month period was partially offset by a decline in other operating expense primarily driven by lower FDIC deposit insurance costs.\n•\nProvision expense of $154 million and $471 million for the three and nine months ended September 30, 2025, respectively, decreased $18 million and $54 million compared to the same periods in 2024, reflecting runoff of the Non-Core portfolio and improving loan mix. \n•\nThe efficiency ratio of 63.03% and 65.16% for the three and nine months ended September 30, 2025, respectively, compared to 66.23% and 67.28% for the same periods in 2024.\n•\nROTCE of 11.75% and 10.84% for the three and nine months ended September 30, 2025, respectively, compared to 9.45% and 9.63% for the same periods in 2024.\n•\nTangible book value per common share of $36.73 increased 14% from December 31, 2024, driven by a decrease in common shares outstanding of nine million and a net increase in tangible common equity of $1.6 billion. The increase in tangible common equity is primarily attributable to increases in AOCI of $1.3 billion and retained earnings of $644 million, including net income of $1.3 billion for the nine months ended September 30, 2025.\nSee “Non-GAAP Financial Measures” for more information regarding the ROTCE and tangible book value per common share non-GAAP financial measures presented herein.\nSale of Education Loans\nDuring the first quarter of 2025, we entered into an agreement to sell $1.9 billion of Non-Core education loans and subsequently reclassified these loans to LHFS. Upon reclassification to LHFS, a charge-off of $25 million was recognized, which was covered by existing reserves. This transaction will settle ratably each quarter throughout 2025, of which approximately $1.4 billion has settled to date, with the remaining $500 million scheduled to settle during the fourth quarter of 2025. \nShare Repurchases\nOn June 13, 2025, we announced that our Board of Directors increased the capacity of our common share repurchase program to $1.5 billion, an increase of $1.2 billion above the $300 million of capacity remaining under the prior June 2024 authorization. During the three and nine months ended September 30, 2025, the Parent Company repurchased $75 million and $475 million, respectively, of its outstanding common stock. See Note 10 and Item 2 for additional information on share repurchase activity.\nPreferred Stock \nOn July 31, 2025, we issued $400 million, or 400,000 shares, of 6.500% fixed-rate reset non-cumulative perpetual Series I Preferred Stock, par value of $25 per share with a liquidation preference of $1,000 per share. Holders of Series I Preferred Stock will be entitled to receive dividend payments only when, as, and if declared by our Board of Directors. Any such dividends will be payable quarterly in arrears on January 6, April 6, July 6, and October 6 of each year, beginning on January 6, 2026 (long first dividend period).\nThe net proceeds from the issuance of the Series I Preferred Stock were used to redeem all of the outstanding shares of our 5.650% fixed-rate reset non-cumulative perpetual Series F Preferred Stock on the dividend payment and earliest available redemption date of October 6, 2025.\nFor more information regarding our Series I Preferred Stock issuance and Series F Preferred Stock redemption, see Note 10.\nCommon Stock Dividend\nOn October 15, 2025, we announced that our Board of Directors declared a quarterly common stock dividend of $0.46 per share, a $0.04, or 9.5%, increase compared to the prior quarter. The dividend is payable on November 12, 2025 to shareholders of record at the close of business on October 29, 2025.\nCitizens Financial Group, Inc. | 8\nOther Developments\nOn March 27, 2025, the SEC voted to end its defense of several court challenges of its climate disclosure rule. The rule requires companies to disclose certain climate-related matters, including risks, activities to mitigate or adapt to such risks, governance, financial effects of severe weather events, and audited measurements of certain greenhouse gas emissions. The SEC paused implementation of the rule last year while federal courts considered various legal challenges brought by states, businesses, and business groups, which were consolidated in the U.S. Court of Appeals for the Eighth Circuit. With the SEC withdrawing from the lawsuit, litigation is expected to continue with the court ultimately deciding whether the rule will remain in effect as adopted. The rule remains stayed until the litigation is resolved. For additional information regarding the SEC’s climate-related rule and other climate-related laws and regulations that we may be subject to, see “Regulation and Supervision” in our  2024 Form 10-K.\nOn July 4, 2025, H.R. 1, entitled the \nOne Big Beautiful Bill Act,\n was signed into law\n.\n This bill includes a broad range of tax reform provisions affecting individuals and businesses, including extending and modifying certain key Tax Cuts & Jobs Act provisions, extending certain Inflation Reduction Act energy incentives while accelerating the phase-out of others, and implementing various other tax cuts and spending measures. We have completed our initial evaluation of the bill and do not expect it to have a material impact on our Consolidated Financial Statements. \nOn July 16, 2025, the FDIC, FRB, and OCC issued a joint notice of proposed rulemaking (“NPR”) to rescind the Community Reinvestment Act (“CRA”) final rule issued in October 2023 and replace it with the prior CRA regulations adopted by the agencies in 1995, with certain technical amendments. The NPR is intended to restore certainty in the CRA regulatory framework for stakeholders and limit regulatory burden on financial institutions. For additional information regarding the CRA, see “Regulation and Supervision” in our 2024 Form 10-K.\nWe will continue to monitor these regulatory and legislative developments and evaluate their associated impact on us.\nRESULTS OF OPERATIONS\nNet Interest Income\nNet interest income is our largest source of revenue and is the difference between the interest earned on interest-earning assets (generally loans and investment securities) and the interest expense incurred in connection with interest-bearing liabilities (generally deposits and borrowed funds). The level of net interest income is primarily a function of the difference between the effective yield on our average interest-earning assets and the effective cost of our interest-bearing liabilities. Factors that influence our net interest income include, but are not limited to, the pricing and mix of interest-earning assets and interest-bearing liabilities which, in turn, are impacted by external factors such as economic conditions, competition for loans and deposits, the monetary policy of the FRB, and market interest rates. For further discussion, refer to the “Market Risk” and “Risk Governance” sections of our 2024 Form 10-K.\nCitizens Financial Group, Inc. | 9\nThe following tables present the major components of our net interest income. Average balance represents amortized cost, excluding the unamortized basis adjustments related to the transfer of certain HTM securities from AFS. The yield/rate is based on annualized interest income or expense for the periods presented and includes the impact of hedging activities associated with the respective asset and liability categories. \nTable 1: Major Components of Net Interest Income\nThree Months Ended September 30,\n2025\n2024\nChange\n(dollars in millions)\nAverage\nBalance\nIncome/\nExpense\nYield/\nRate\nAverage\nBalance\nIncome/\nExpense\nYield/\nRate\nAverage\nBalance\nYield/\nRate (bps)\nAssets\nInterest-bearing cash and due from banks and deposits in banks\n$9,015 \n$97 \n4.24 \n%\n$8,896 \n$121 \n5.30 \n%\n$119 \n(106) bps\nTaxable investment securities\n46,452 \n433 \n3.71 \n45,083 \n423 \n3.75 \n1,369 \n(4)\nNon-taxable investment securities\n1 \n— \n2.60 \n1 \n— \n2.60 \n— \n— \nTotal investment securities\n46,453 \n433 \n3.71 \n45,084 \n423 \n3.75 \n1,369 \n(4)\nCommercial and industrial\n46,351 \n581 \n4.91 \n44,071 \n556 \n4.95 \n2,280 \n(4)\nCommercial real estate\n25,799 \n380 \n5.76 \n28,209 \n452 \n6.26 \n(2,410)\n(50)\nTotal commercial\n72,150 \n961 \n5.21 \n72,280 \n1,008 \n5.46 \n(130)\n(25)\nResidential mortgages\n34,134 \n339 \n3.98 \n32,117 \n301 \n3.75 \n2,017 \n23 \nHome equity\n18,027 \n322 \n7.07 \n15,733 \n317 \n8.02 \n2,294 \n(95)\nAutomobile\n3,096 \n35 \n4.44 \n5,942 \n64 \n4.28 \n(2,846)\n16 \nEducation\n8,513 \n129 \n5.98 \n11,155 \n153 \n5.45 \n(2,642)\n53 \nOther retail\n4,091 \n111 \n10.92 \n4,776 \n133 \n11.04 \n(685)\n(12)\nTotal retail\n67,861 \n936 \n5.49 \n69,723 \n968 \n5.53 \n(1,862)\n(4)\nTotal loans and leases\n140,011 \n1,897 \n5.35 \n142,003 \n1,976 \n5.50 \n(1,992)\n(15)\nLoans held for sale\n2,119 \n31 \n5.73 \n1,181 \n19 \n6.26 \n938 \n(53)\nInterest-earning assets\n197,598 \n2,458 \n4.92 \n197,164 \n2,539 \n5.09 \n434 \n(17)\nNoninterest-earning assets\n21,519 \n21,414 \n105 \nTotal assets\n$219,117 \n$218,578 \n$539 \nLiabilities and Stockholders’ Equity\nChecking with interest\n$34,748 \n$134 \n1.54 \n%\n$33,090 \n$131 \n1.58 \n%\n$1,658 \n(4)\nSavings\n25,001 \n86 \n1.36 \n26,868 \n128 \n1.89 \n(1,867)\n(53)\nMoney market\n57,783 \n411 \n2.82 \n53,152 \n444 \n3.32 \n4,631 \n(50)\nTime\n20,355 \n185 \n3.61 \n24,705 \n287 \n4.65 \n(4,350)\n(104)\nTotal interest-bearing deposits\n137,887 \n816 \n2.35 \n137,815 \n990 \n2.86 \n72 \n(51)\nShort-term borrowed funds\n589 \n5 \n2.91 \n150 \n3 \n6.06 \n439 \n(315)\nLong-term borrowed funds\n11,643 \n149 \n5.11 \n13,690 \n177 \n5.20 \n(2,047)\n(9)\nTotal borrowed funds\n12,232 \n154 \n5.01 \n13,840 \n180 \n5.21 \n(1,608)\n(20)\nTotal interest-bearing liabilities\n150,119 \n970 \n2.56 \n151,655 \n1,170 \n3.07 \n(1,536)\n(51)\nNoninterest-bearing demand deposits\n38,070 \n36,236 \n1,834 \nOther noninterest-bearing liabilities\n5,387 \n6,194 \n(807)\nTotal liabilities\n193,576 \n194,085 \n(509)\nStockholders’ equity\n25,541 \n24,493 \n1,048 \nTotal liabilities and stockholders’ equity\n$219,117 \n$218,578 \n$539 \nInterest rate spread\n2.36 \n%\n2.02 \n%\n34 \nNet interest income and net interest margin\n$1,488 \n2.99 \n%\n$1,369 \n2.76 \n%\n23 \nNet interest income and net interest margin, FTE\n(1)\n$1,492 \n3.00 \n%\n$1,373 \n2.77 \n%\n23 \nMemo: Total deposits (interest-bearing and noninterest-bearing demand)\n$175,957 \n$816 \n1.84 \n%\n$174,051 \n$990 \n2.26 \n%\n$1,906 \n(42)\n bps\nCitizens Financial Group, Inc. | 10\nNine Months Ended September 30,\n2025\n2024\nChange\n(dollars in millions)\nAverage\nBalance\nIncome/\nExpense\nYield/\nRate\nAverage\nBalance\nIncome/\nExpense\nYield/\nRate\nAverage\nBalance\nYield/\nRate (bps)\nAssets:\nInterest-bearing cash and due from banks and deposits in banks\n$8,445 \n$278 \n4.35 \n%\n$9,602 \n$391 \n5.35 \n%\n($1,157)\n(100) bps\nTaxable investment securities\n46,354 \n1,279 \n3.68 \n44,561 \n1,239 \n3.71 \n1,793 \n(3)\nNon-taxable investment securities\n1 \n— \n2.60 \n1 \n— \n2.60 \n— \n— \nTotal investment securities\n46,355 \n1,279 \n3.68 \n44,562 \n1,239 \n3.71 \n1,793 \n(3)\nCommercial and industrial\n44,972 \n1,645 \n4.83 \n44,342 \n1,795 \n5.32 \n630 \n(49)\nCommercial real estate\n26,429 \n1,151 \n5.74 \n28,681 \n1,376 \n6.30 \n(2,252)\n(56)\nTotal commercial\n71,401 \n2,796 \n5.16 \n73,023 \n3,171 \n5.71 \n(1,622)\n(55)\nResidential mortgages\n33,480 \n984 \n3.92 \n31,713 \n874 \n3.68 \n1,767 \n24 \nHome equity\n17,338 \n923 \n7.11 \n15,387 \n920 \n7.99 \n1,951 \n(88)\nAutomobile\n3,727 \n123 \n4.41 \n6,832 \n218 \n4.27 \n(3,105)\n14 \nEducation\n9,280 \n405 \n5.83 \n11,472 \n463 \n5.39 \n(2,192)\n44 \nOther retail \n4,285 \n346 \n10.83 \n4,866 \n392 \n10.76 \n(581)\n7 \nTotal retail\n68,110 \n2,781 \n5.45 \n70,270 \n2,867 \n5.45 \n(2,160)\n— \nTotal loans and leases\n139,511 \n5,577 \n5.31 \n143,293 \n6,038 \n5.58 \n(3,782)\n(27)\nLoans held for sale\n2,023 \n83 \n5.45 \n1,104 \n56 \n6.71 \n919 \n(126)\nInterest-earning assets\n196,334 \n7,217 \n4.88 \n198,561 \n7,724 \n5.15 \n(2,227)\n(27)\nNoninterest-earning assets\n21,372 \n20,959 \n413 \nTotal assets\n$217,706 \n$219,520 \n($1,814)\nLiabilities and Stockholders’ Equity:\nChecking with interest\n$33,770 \n$367 \n1.45 \n%\n$33,017 \n$368 \n1.49 \n%\n$753 \n(4)\nSavings\n25,430 \n260 \n1.36 \n27,389 \n369 \n1.80 \n(1,959)\n(44)\nMoney market\n55,656 \n1,144 \n2.75 \n52,552 \n1,320 \n3.35 \n3,104 \n(60)\nTime\n22,093 \n642 \n3.89 \n25,274 \n885 \n4.68 \n(3,181)\n(79)\nTotal interest-bearing deposits\n136,949 \n2,413 \n2.36 \n138,232 \n2,942 \n2.84 \n(1,283)\n(48)\nShort-term borrowed funds\n729 \n22 \n3.85 \n324 \n14 \n5.64 \n405 \n(179)\nLong-term borrowed funds\n12,263 \n466 \n5.07 \n14,147 \n547 \n5.15 \n(1,884)\n(8)\nTotal borrowed funds\n12,992 \n488 \n5.00 \n14,471 \n561 \n5.16 \n(1,479)\n(16)\nTotal interest-bearing liabilities\n149,941 \n2,901 \n2.58 \n152,703 \n3,503 \n3.06 \n(2,762)\n(48)\nNoninterest-bearing demand deposits\n37,326 \n36,374 \n952 \nOther noninterest-bearing liabilities\n5,618 \n6,544 \n(926)\nTotal liabilities\n192,885 \n195,621 \n(2,736)\nStockholders’ equity\n24,821 \n23,899 \n922 \nTotal liabilities and stockholders’ equity\n$217,706 \n$219,520 \n($1,814)\nInterest rate spread\n2.30 \n%\n2.09 \n%\n21 \nNet interest income and net interest margin\n$4,316 \n2.94 \n%\n$4,221 \n2.84 \n%\n10 \nNet interest income and net interest margin, FTE\n(1)\n$4,328 \n2.95 \n%\n$4,234 \n2.85 \n%\n10 \nMemo: Total deposits (interest-bearing and noninterest-bearing demand)\n$174,275 \n$2,413 \n1.85 \n%\n$174,606 \n$2,942 \n2.25 \n%\n($331)\n(40)\n bps\n(1)\n Net interest income and net interest margin on an FTE basis are non-GAAP financial measures. See “Non-GAAP Financial Measures” for more information.\nNet interest income increased $119 million, or 9%, and increased $95 million, or 2%, for the three and nine months ended September 30, 2025, respectively, compared to the same periods in 2024, driven by higher net interest margin reflecting lower funding costs, the time-based benefits of the Non-Core portfolio runoff, terminated swap impacts, and fixed-rate asset repricing benefits.\nNet interest margin on an FTE basis increased 23 basis points and 10 basis points for the three and nine months ended September 30, 2025, respectively, compared to the same periods in 2024, driven by lower funding costs, the time-based benefits of the Non-Core portfolio runoff, terminated swap impacts, and fixed-rate asset repricing benefits.\nAverage interest-earning assets increased $434 million for the three months ended September 30, 2025, compared to the same period in 2024, driven by an increase in investment securities and loans held for sale, partially offset by a decline in total loans and leases. For the nine months ended September 30, 2025, average interest-earnings assets decreased $2.2 billion compared to the same period in 2024, driven by a decline in total loans and leases and cash held in interest-bearing deposits, partially offset by an increase in investment securities and loans held for sale.\nCitizens Financial Group, Inc. | 11\nAverage deposits increased $1.9 billion for the three months ended September 30, 2025 and were stable for the nine months ended September 30, 2025, compared to the same periods in 2024. The increase during the three-month period was driven by growth in the Private Bank, partially offset by a reduction in higher-cost brokered deposits.\nAverage total borrowed funds decreased $1.6 billion and\n \n$1.5 billion for the three and nine months ended September 30, 2025, respectively, compared to the same periods in 2024, driven primarily by a decline in auto collateralized borrowings given runoff of the Non-Core portfolio. A decline in FHLB advances is also a driver during the nine-month period.\nNoninterest Income\nThe following table presents the components of noninterest income:\nTable 2: Noninterest Income\nThree Months Ended September 30,\nNine Months Ended September 30,\n(dollars in millions)\n2025\n2024\nChange\nPercent\n2025\n2024\nChange\nPercent\nService charges and fees\n$112 \n$109 \n$3 \n3\n%\n$332 \n$311 \n$21 \n7\n%\nCapital markets fees\n166 \n94 \n72 \n77\n371 \n346 \n25 \n7\nCard fees\n87 \n93 \n(6)\n(6)\n260 \n271 \n(11)\n(4)\nWealth fees\n93 \n76 \n17 \n22 \n262 \n219 \n43 \n20 \nMortgage banking fees\n49 \n46 \n3 \n7\n181 \n149 \n32 \n21\nForeign exchange and derivative products\n42 \n36 \n6 \n17 \n122 \n111 \n11 \n10 \nLetter of credit and loan fees\n48 \n45 \n3 \n7 \n137 \n130 \n7 \n5 \nSecurities gains, net\n2 \n9 \n(7)\n(78)\n14 \n14 \n— \n— \nOther income\n(1)\n31 \n24 \n7 \n29 \n95 \n51 \n44 \n86 \nNoninterest income\n$630 \n$532 \n$98 \n18\n%\n$1,774 \n$1,602 \n$172 \n11\n%\n(1)\n Includes bank-owned life insurance income and other income for all periods presented. \nThe primary drivers for the change in noninterest income for the three and nine months ended September 30, 2025, compared to the same periods in 2024, are described below:\n•\nWealth fees increased reflecting growth in assets under management, primarily from the Private Bank;\n•\nMortgage banking fees increased driven by higher MSR valuation, net of hedging;\n•\nCapital markets fees increased driven by higher M&A, loan syndication, and equity underwriting fees during the three-month period, and by higher loan syndication and equity underwriting fees during the nine-month period; and\n•\nService charges and fees increased driven primarily by higher overdraft and cash management fees.\nCitizens Financial Group, Inc. | 12\nNoninterest Expense\nThe following table presents the components of noninterest expense:\nTable 3: Noninterest Expense\nThree Months Ended September 30,\nNine Months Ended September 30,\n(dollars in millions)\n2025\n2024\nChange\nPercent\n2025\n2024\nChange\nPercent\nSalaries and employee benefits\n$705 \n$647 \n$58 \n9\n%\n$2,082 \n$1,983 \n$99 \n5\n%\nEquipment and software\n197 \n194 \n3 \n2 \n584 \n576 \n8 \n1 \nOutside services\n161 \n146 \n15 \n10 \n485 \n469 \n16 \n3 \nOccupancy\n106 \n108 \n(2)\n(2)\n326 \n335 \n(9)\n(3)\nOther operating expense\n166 \n164 \n2 \n1 \n491 \n555 \n(64)\n(12)\nNoninterest expense\n$1,335 \n$1,259 \n$76 \n6\n%\n$3,968 \n$3,918 \n$50 \n1\n%\nThe primary drivers for the change in noninterest expense for the three and nine months ended September 30, 2025, compared to the same periods in 2024, are described below:\n•\nSalaries and employee benefits increased reflecting hiring related to the Private Bank and Private Wealth build-out, strong Capital Markets fee performance, and increased medical benefit costs; and\n•\nThe decline in Other operating expense during the nine-month period was driven primarily by lower FDIC deposit insurance, reflecting CBNA’s special assessment of $40 million recognized in 2024, and lower fraud losses, partially offset by higher travel and marketing-related costs.\nFor more information regarding CBNA’s special assessment, see “Regulation and Supervision - Deposit Insurance” in our 2024 Form 10-K.\nProvision for Credit Losses\nThe provision for credit losses is the result of a detailed analysis performed to estimate our ACL. The total provision for credit losses includes the provision for loan and lease losses and the provision for unfunded commitments. Refer to “Analysis of Financial Condition — Credit Quality” for more information.\nProvision expense of $154 million and $471 million for the three and nine months ended September 30, 2025, respectively, compared with a provision of $172 million and $525 million for the same periods in 2024, reflecting runoff of the Non-Core portfolio and improving loan mix.\nIncome Tax Expense\nIncome tax expense of $135 million and $348 million increased $47 million and $76 million for the three and nine months ended September 30, 2025, respectively, compared to the same periods in 2024. The effective income tax rate of 21.4% and 21.1% for the three and nine months ended September 30, 2025, respectively, increased from 18.6% and 19.7% compared to the same periods in 2024. These increases are primarily driven by higher pre-tax income and a reduced benefit from tax-advantaged investments. Provision for income taxes is calculated by applying the estimated annual effective tax rate to year-to-date pre-tax income, adjusting for discrete items that occurred during the period.\nCitizens Financial Group, Inc. | 13\nANALYSIS OF FINANCIAL CONDITION\nSecurities\nThe following table presents the major components of securities at amortized cost and fair value:\nTable 4: Amortized Cost and Fair Value of Securities\nSeptember 30, 2025\nDecember 31, 2024\n(dollars in millions)\nAmortized \nCost\n(1)\nFair Value \nAmortized \nCost\n(1)\nFair Value\nU.S. Treasury and other\n$4,563 \n$4,514 \n$3,631 \n$3,525 \nState and political subdivisions\n1 \n1 \n1 \n1 \nMortgage-backed securities:\nFederal agencies and U.S. government sponsored entities\n31,865 \n30,551 \n30,897 \n28,795 \nOther/non-agency\n268 \n263 \n273 \n260 \nTotal mortgage-backed securities\n32,133 \n30,814 \n31,170 \n29,055 \nCollateralized loan obligations\n90 \n90 \n184 \n184 \n   Total debt securities available for sale\n$36,787 \n$35,419 \n$34,986 \n$32,765 \nMortgage-backed securities:\nFederal agencies and U.S. government sponsored entities\n$7,767 \n$6,938 \n$8,187 \n$7,136 \nTotal mortgage-backed securities\n7,767 \n6,938 \n8,187 \n7,136 \nAsset-backed securities\n357 \n357 \n412 \n404 \n   Total debt securities held to maturity\n$8,124 \n$7,295 \n$8,599 \n$7,540 \n   Total debt securities available for sale and held to maturity\n$44,911 \n$42,714 \n$43,585 \n$40,305 \nEquity securities, at cost\n(2)\n$710 \n$710 \n$710 \n$710 \nEquity securities, at fair value\n(2)\n286 \n286 \n220 \n220 \n(1)\n Excludes portfolio level basis adjustments of $37 million and $(75) million, respectively, for securities designated in active fair value hedge relationships under the portfolio layer method at September 30, 2025 and December 31, 2024.\n(2)\n Included in Other assets in the Consolidated Balance Sheets.\nThe primary objective of our securities portfolio is to provide a readily available source of liquidity. The portfolio primarily includes high-quality and highly liquid investments that reflect our ongoing commitment to maintain strong contingent liquidity levels and pledging capacity.\nAs of September 30, 2025, U.S. Treasuries and mortgage-backed securities issued by GNMA and GSEs represented 98% of the fair value of our debt securities portfolio, with approximately $38.8 billion of unencumbered high-quality liquid securities serving as potential collateral for borrowings from the FHLB, FRB discount window, and the Fixed Income Clearing Corporation bilateral repurchase agreement market.\nFor further discussion of the use of our securities as liquidity collateral see the “Liquidity Risk” section in this report. For further discussion of liquidity requirements, see “Regulation and Supervision — Liquidity Requirements” in our 2024 Form 10-K.\nWe manage our securities portfolio duration and convexity risk through asset selection and securities structure, and maintain duration levels within our risk appetite in the context of our broader interest rate risk framework and limits. As of September 30, 2025, the portfolio’s average effective duration, including hedging actions to reduce duration, was 3.6 years compared with 3.7 years as of December 31, 2024.\nCitizens Financial Group, Inc. | 14\nLoans and Leases\nThe following table presents loans and leases, excluding LHFS:     \nTable 5: Composition of Loans and Leases, Excluding LHFS\n(dollars in millions)\nSeptember 30, 2025\nDecember 31, 2024\nChange\n Percent\nCommercial and industrial\n$46,953 \n$42,551 \n$4,402 \n10 \n%\nCommercial real estate\n25,540 \n27,225 \n(1,685)\n(6)\nTotal commercial\n72,493 \n69,776 \n2,717 \n4 \nResidential mortgages\n34,477 \n32,726 \n1,751 \n5 \nHome equity\n18,415 \n16,495 \n1,920 \n12 \nAutomobile\n2,816 \n4,744 \n(1,928)\n(41)\nEducation\n8,556 \n10,812 \n(2,256)\n(21)\nOther retail\n4,113 \n4,650 \n(537)\n(12)\nTotal retail\n68,377 \n69,427 \n(1,050)\n(2)\nTotal loans and leases\n$140,870 \n$139,203 \n$1,667 \n1 \n%\nThe increase in total loans and leases as of September 30, 2025 compared to December 31, 2024 reflects a $2.7 billion increase in commercial driven by higher line of credit utilization, partially offset by CRE paydowns. Retail reflects a $1.1 billion decrease driven by an agreement entered into during the first quarter to sell $1.9 billion of Non-Core education loans. The decrease in retail is also attributable to runoff of the Non-Core portfolio, partially offset by growth in home equity and mortgage, including the Private Bank.\nCredit Quality\nThe ACL is maintained at a level the Company believes to be appropriate to absorb expected lifetime credit losses over the contractual life of a loan or lease and on unfunded lending commitments, inclusive of recoveries. For additional information regarding the ACL, see “Critical Accounting Estimates — Allowance for Credit Losses” and Note 4 in this report, and “Credit Quality” and Note 6 in our 2024 Form 10-K.\nThe following table presents the ACL and associated coverage ratio for our loan and lease portfolios:\nTable 6: ACL and Related Coverage Ratios by Portfolio\nSeptember 30, 2025\nDecember 31, 2024\n(dollars in millions)\nLoans and Leases\nAllowance\nCoverage Ratio\nLoans and Leases\nAllowance\nCoverage Ratio\nAllowance for Loan and Lease Losses\nCommercial and industrial\n$46,953 \n$486 \n1.04 \n%\n$42,551 \n$480 \n1.13 \n%\nCommercial real estate\n25,540 \n597 \n2.34 \n27,225 \n660 \n2.42 \nTotal commercial\n72,493 \n1,083 \n1.49 \n69,776 \n1,140 \n1.63 \nResidential mortgages\n34,477 \n211 \n0.61 \n32,726 \n194 \n0.59 \nHome equity\n18,415 \n121 \n0.66 \n16,495 \n112 \n0.68 \nAutomobile\n2,816 \n13 \n0.45 \n4,744 \n24 \n0.51 \nEducation\n8,556 \n268 \n3.13 \n10,812 \n292 \n2.70 \nOther retail\n4,113 \n276 \n6.72 \n4,650 \n299 \n6.44 \nTotal retail\n68,377 \n889 \n1.30 \n69,427 \n921 \n1.33 \nTotal loans and leases\n$140,870 \n$1,972 \n1.40 \n%\n$139,203 \n$2,061 \n1.48 \n%\nAllowance for Unfunded Lending Commitments\nCommercial\n(1)\n$182 \n1.74 \n%\n$155 \n1.86 \n%\nRetail\n(2)\n47 \n1.37 \n43 \n1.39 \n     Total allowance for unfunded lending commitments\n229 \n198 \nAllowance for credit losses\n$140,870 \n$2,201 \n1.56 \n%\n$139,203 \n$2,259 \n1.62 \n%\n(1) \nCoverage ratio includes total commercial allowance for unfunded lending commitments and total commercial allowance for loan and lease losses in the numerator and total commercial loans and leases in the denominator.\n(2)\n Coverage ratio includes total retail allowance for unfunded lending commitments and total retail allowance for loan losses in the numerator and total retail loans in the denominator.\nThe ACL as of September 30, 2025 compared to December 31, 2024 decreased $58 million, driven by a $28 million decrease in retail, given the benefit of runoff of the Non-Core portfolio and improving loan mix, and a $30 million decrease in commercial.\nCitizens Financial Group, Inc. | 15\nThe following table presents nonaccrual loans and leases:\nTable 7: Nonaccrual Loans and Leases\n(dollars in millions)\nSeptember 30, 2025\nDecember 31, 2024\nChange \nPercent\nCommercial and industrial\n$230 \n$241 \n($11)\n(5\n%)\nCommercial real estate\n703 \n776 \n(73)\n(9)\nTotal commercial\n933 \n1,017 \n(84)\n(8)\nResidential mortgages\n188 \n192 \n(4)\n(2)\nHome equity\n297 \n283 \n14 \n5\nAutomobile\n31 \n48 \n(17)\n(35)\nEducation\n20 \n56 \n(36)\n(64)\nOther retail\n49 \n68 \n(19)\n(28)\nTotal retail\n585 \n647 \n(62)\n(10)\nNonaccrual loans and leases\n$1,518 \n$1,664 \n($146)\n(9\n%)\nNonaccrual loans and leases to total loans and leases\n1.08\n%\n1.20\n%\n(12\n bps)\nAllowance for loan and lease losses to nonaccrual loans and leases\n130\n124\n6\n%\nAllowance for credit losses to nonaccrual loans and leases\n145\n136\n9\n%\nThe decline in nonaccrual loans and leases as of September 30, 2025 compared to December 31, 2024 reflects a decrease in commercial primarily driven by the general office segment of CRE, and a decrease in retail driven by the sale of Non-Core education loans and continued runoff of the auto portfolio. See “Executive Summary” for more information regarding the sale of education loans.\nThe following tables present the net charge-off ratio for our loan and lease portfolios:\nTable 8: Ratio of Net Charge-Offs to Average Loans and Leases\nThree Months Ended September 30,\n2025\n2024\n(dollars in millions)\nNet Charge-Offs\nAverage Balance\nRatio\nNet Charge-Offs\nAverage Balance\nRatio\nCommercial and industrial\n$30 \n$46,351 \n0.26 \n%\n$54 \n$44,071 \n0.49 \n%\nCommercial real estate\n55 \n25,799 \n0.85 \n44 \n28,209 \n0.62 \nTotal commercial \n85 \n72,150 \n0.47 \n98 \n72,280 \n0.54 \nResidential mortgages\n— \n34,134 \n— \n— \n32,117 \n— \nHome equity\n(3)\n18,027 \n(0.06)\n(1)\n15,733 \n(0.03)\nAutomobile\n4 \n3,096 \n0.43 \n13 \n5,942 \n0.81 \nEducation\n20 \n8,513 \n0.92 \n24 \n11,155 \n0.85 \nOther retail\n56 \n4,091 \n5.45 \n58 \n4,776 \n4.93 \nTotal retail\n77 \n67,861 \n0.45 \n94 \n69,723 \n0.54 \nTotal loans and leases\n$162 \n$140,011 \n0.46 \n%\n$192 \n$142,003 \n0.54 \n%\nNine Months Ended September 30,\n2025\n2024\n(dollars in millions)\nNet Charge-Offs\nAverage Balance\nRatio\nNet Charge-Offs\nAverage Balance\nRatio\nCommercial and industrial\n$99 \n$44,972 \n0.30 \n%\n$61 \n$44,342 \n0.18 \n%\nCommercial real estate\n159 \n26,429 \n0.81 \n218 \n28,681 \n1.02 \nTotal commercial\n258 \n71,401 \n0.48 \n279 \n73,023 \n0.51 \nResidential mortgages\n— \n33,480 \n— \n1 \n31,713 \n— \nHome equity\n(5)\n17,338 \n(0.04)\n(6)\n15,387 \n(0.05)\nAutomobile\n15 \n3,727 \n0.52 \n31 \n6,832 \n0.60 \nEducation\n89 \n9,280 \n1.28 \n77 \n11,472 \n0.90 \nOther retail\n172 \n4,285 \n5.38 \n175 \n4,866 \n4.82 \nTotal retail\n271 \n68,110 \n0.53 \n278 \n70,270 \n0.53 \nTotal loans and leases\n$529 \n$139,511 \n0.51 \n%\n$557 \n$143,293 \n0.52 \n%\nCitizens Financial Group, Inc. | 16\nFor the three and nine months ended September 30, 2025, net charge-offs decreased $30 million and decreased $28 million, respectively, compared to the same periods in 2024. The net charge-off ratio decreased 8 basis points and decreased 1 basis point, respectively, compared to the same periods in 2024. The nine-month period ended September 30, 2025 includes a $25 million charge-off resulting from the sale of Non-Core education loans. See “Executive Summary” for more information regarding the sale of education loans.\nCommercial Loan Asset Quality\nOur commercial portfolio consists of traditional commercial and industrial loans, commercial leases, and commercial real estate loans. As discussed in our 2024 Form 10-K, we utilize internal risk ratings to monitor credit quality for commercial loans and leases.\nTotal commercial criticized balances of $6.6 billion at September 30, 2025 decreased $523 million compared to December 31, 2024. \nCommercial and industrial criticized balances of $2.6 billion at September 30, 2025 remained stable compared to December 31, 2024.\nCommercial real estate criticized balances of $4.0 billion at September 30, 2025 decreased from $4.5 billion at December 31, 2024, attributable to office, multifamily, and industrial loan upgrades driven by improved leasing and operating performance, credit-enhanced extensions, pending sales, and refinancing activity, along with net charge-offs in the general office portfolio. Approximately 97% of commercial real estate loans remain current on payments as of September 30, 2025.\nFor more information on the distribution of commercial loans by vintage date and regulatory classification rating, see Note 4.\nThe following table presents our commercial and industrial loan portfolio by industry sector:\nTable 9: Commercial and Industrial Loans by Industry Sector\nSeptember 30, 2025\nDecember 31, 2024\n(dollars in millions)\nBalance\n% of \nTotal Loans and Leases\nBalance\n% of \nTotal Loans and Leases\nIndustry sector\nFinance and insurance\nCapital call facilities\n$8,349 \n6 \n%\n$6,070 \n4 \n%\nSecured private credit finance\n3,310 \n2 \n2,908 \n2 \nOther finance and insurance\n4,139 \n3 \n3,538 \n3 \nOther manufacturing\n3,676 \n3 \n3,491 \n3 \nTechnology\n2,868 \n2 \n2,818 \n2 \nAccommodation and food services\n2,070 \n1 \n2,599 \n2 \nHealth, pharma, and social assistance\n2,334 \n2 \n2,322 \n2 \nProfessional, scientific, and technical services\n2,628 \n2 \n2,313 \n2 \nEnergy and related\n1,934 \n1 \n2,085 \n1 \nOther services\n2,280 \n1 \n2,061 \n1 \nWholesale trade\n2,393 \n2 \n2,010 \n1 \nRetail trade\n1,959 \n1 \n2,000 \n1 \nArts, entertainment, and recreation\n1,660 \n1 \n1,509 \n1 \nAdministrative and waste management\n1,217 \n1 \n1,352 \n1 \nAutomotive\n1,180 \n1 \n1,026 \n1 \nRental and leasing\n1,181 \n1 \n923 \n1 \nConsumer products manufacturing\n783 \n1 \n710 \n1 \nOther\n2,992 \n2 \n2,816 \n2 \nTotal commercial and industrial\n$46,953 \n33 \n%\n$42,551 \n31 \n%\nCitizens Financial Group, Inc. | 17\nThe following table presents our commercial real estate loan portfolio by property type and state:\nTable 10: Commercial Real Estate by Property Type and State\nSeptember 30, 2025\nDecember 31, 2024\n(dollars in millions)\nBalance\n% of \nTotal Loans and Leases\nBalance\n% of \nTotal Loans and Leases\nProperty type\nMultifamily\n$9,592 \n7 \n%\n$9,791 \n7 \n%\nOffice\nCredit tenant lease and life sciences\n(1)\n2,095 \n1 \n2,135 \n2 \nOther general office\n2,522 \n2 \n2,930 \n2 \nIndustrial\n2,596 \n2 \n3,575 \n3 \nRetail\n2,875 \n2 \n2,940 \n2 \nCo-op\n1,791 \n1 \n1,802 \n1 \nData center\n875 \n1 \n1,024 \n1 \nHospitality\n368 \n— \n418 \n— \nOther\n2,826 \n2 \n2,610 \n2 \nTotal commercial real estate\n$25,540 \n18 \n%\n$27,225 \n20 \n%\nState\nNew York\n$6,437 \n4 \n%\n$6,643 \n5 \n%\nNew Jersey\n3,001 \n2 \n3,370 \n2 \nPennsylvania\n2,266 \n2 \n2,594 \n2 \nCalifornia\n2,588 \n2 \n2,398 \n2 \nMassachusetts\n1,601 \n1 \n1,682 \n1 \nTexas\n1,512 \n1 \n1,571 \n1 \nFlorida\n1,030 \n1 \n1,123 \n1 \nOther Southeast\n(2)\n2,533 \n2 \n2,789 \n2 \nOther\n4,572 \n3 \n5,055 \n4 \nTotal commercial real estate\n$25,540 \n18 \n%\n$27,225 \n20 \n%\n(1)\n Credit tenant lease includes loans to nationally recognized tenants with high credit ratings and life sciences includes loans to provide lab and office space for tenants involved in the study and development of scientific discoveries.\n(2)\n Includes Georgia, Maryland, North Carolina, South Carolina, and Virginia.\nRetail Loan Asset Quality \nWe utilize credit scores provided by FICO, which are generally refreshed on a quarterly basis, and payment and delinquency status, among other data points, to monitor credit quality for retail loans. FICO credit scores represent current and historical national industry-wide consumer level credit performance data, which management believes are the strongest indicator of potential credit losses over the contractual life of the loan and a good predictor of a borrower’s future payment performance.\nThe following table presents an aging analysis of accruing and nonaccrual loans for our retail loan portfolio: \nTable 11: Retail Loan Portfolio Analysis\nSeptember 30, 2025\nDecember 31, 2024\nDays Past Due and Accruing\nDays Past Due and Accruing\nCurrent\n30-59\n60-89\n90+\nNonaccrual\nCurrent\n30-59\n60-89\n90+\nNonaccrual\nResidential mortgages\n98.77 \n%\n0.23 \n%\n0.12 \n%\n0.33 \n%\n0.55 \n%\n97.81 \n%\n0.77 \n%\n0.28 \n%\n0.55 \n%\n0.59 \n%\nHome equity\n97.79 \n0.45 \n0.15 \n— \n1.61 \n97.59 \n0.53 \n0.16 \n— \n1.72 \nAutomobile\n95.95 \n2.20 \n0.75 \n— \n1.10 \n96.18 \n2.11 \n0.70 \n— \n1.01 \nEducation\n99.14 \n0.40 \n0.21 \n0.02 \n0.23 \n98.83 \n0.42 \n0.21 \n0.02 \n0.52 \nOther retail\n97.50 \n0.78 \n0.53 \n— \n1.19 \n96.86 \n0.99 \n0.67 \n0.02 \n1.46 \nTotal retail\n98.35 \n%\n0.43 \n%\n0.19 \n%\n0.17 \n%\n0.86 \n%\n97.75 \n%\n0.76 \n%\n0.30 \n%\n0.26 \n%\n0.93 \n%\nCitizens Financial Group, Inc. | 18\nThe following table presents certain asset quality metrics for our retail loan portfolio:\nTable 12: Retail Asset Quality Metrics\nSeptember 30, 2025\nDecember 31, 2024\nAverage refreshed FICO for total portfolio\n776 \n775 \nCLTV ratio for secured real estate\n(1)\n49 \n%\n50 \n%\n(1)\n The real estate secured portfolio CLTV is calculated as the mortgage and second lien loan balance divided by the most recently available value of the property.\nFor more information on the aging of accruing and nonaccrual retail loans and the distribution of retail loans by vintage date and FICO score, see Note 4.\nDeposits\nThe following table presents the composition of deposits:\nTable 13: Composition of Deposits\n(dollars in millions)\nSeptember 30, 2025\n% of Total Deposits\nDecember 31, 2024\n% of Total Deposits\nNoninterest-bearing demand\n$39,472 \n22\n%\n$36,920 \n21\n%\nChecking with interest\n35,219 \n19\n33,246 \n19\nSavings\n24,759 \n14\n25,976 \n15\nMoney market\n59,709 \n33\n55,321 \n32\nTime\n20,852 \n12\n23,313 \n13\nTotal deposits\n$180,011 \n100\n%\n$174,776 \n100\n%\nTotal deposits as of September 30, 2025 increased compared to December 31, 2024, reflecting growth in the Private Bank, partially offset by a decline in time deposits given elevated retail maturities and continued reduction in higher-cost Treasury brokered deposits.\nThe following table presents an analysis of estimated insured/secured deposits as a percentage of total deposits:\nTable 14: Uninsured and Insured/Secured Deposits\n(dollars in millions)\nSeptember 30, 2025\nDecember 31, 2024\nTotal deposits\n$180,011 \n$174,776 \nEstimated uninsured deposits\n(1)\n82,202 \n76,764 \nLess: Uninsured affiliate deposits eliminated in consolidation\n11,288 \n12,705 \nLess: Preferred deposits\n(1)(2)\n6,445 \n6,902 \nCFG adjusted estimated uninsured deposits, excluding preferred deposits\n64,469 \n57,157 \nTotal estimated insured/secured deposits\n$115,542 \n$117,619 \nInsured/secured deposits to total deposits\n64\n%\n67\n%\n(1)\n As reported on CBNA’s Call Report.\n(2)\n Represents uninsured deposits of states and political subdivisions that are secured or collateralized as required under state law.\nBorrowed Funds\nTotal borrowed funds of $10.7 billion as of September 30, 2025 decreased $1.7 billion compared to December 31, 2024, driven by a decline in secured borrowings collateralized by loans and senior debt. For more information regarding our borrowed funds, see “Liquidity Risk” and Note 7.\nCitizens Financial Group, Inc. | 19\nBUSINESS SEGMENTS\n \nWe have three reportable business segments: Consumer Banking, Commercial Banking, and Non-Core. The business segments are determined based on the products and services provided, or the type of customer served. Each business segment has a segment head that reports directly to the Chief Executive Officer, who has final authority over resource allocation decisions and performance assessment. The business segments reflect this management structure and the manner in which financial information is currently evaluated by the Chief Executive Officer. See Note 16 for more information regarding our business segments.\nThe following tables present certain financial data of our reportable business segments. Total business segment financial results differ from total consolidated financial results. These differences are reflected in Other non-segment operations, consisting primarily of treasury and community development, and include assets, liabilities, capital, revenues, provision (benefit) for credit losses, expenses, and income tax expense (benefit) not attributed to the Company’s reportable business segments.\nTable 15: Selected Financial Data for Business Segments\nThree Months Ended September 30,\nConsumer Banking\nCommercial Banking\nNon-Core\n(dollars in millions)\n2025\n2024\n2025\n2024\n2025\n2024\nNet interest income\n$1,262 \n$1,156 \n$448 \n$478 \n($7)\n($28)\nNoninterest income\n311 \n285 \n286 \n207 \n4 \n— \nTotal revenue\n1,573 \n1,441 \n734 \n685 \n(3)\n(28)\nNoninterest expense\n979 \n916 \n333 \n300 \n12 \n23 \nProfit (loss) before credit losses\n594 \n525 \n401 \n385 \n(15)\n(51)\nNet charge-offs\n81 \n84 \n78 \n91 \n4 \n17 \nIncome (loss) before income tax expense (benefit)\n513 \n441 \n323 \n294 \n(19)\n(68)\nIncome tax expense (benefit)\n130 \n114 \n75 \n63 \n(5)\n(17)\nNet income (loss)\n$383 \n$327 \n$248 \n$231 \n($14)\n($51)\nAverage Balances: \nTotal assets\n$80,729 \n$75,392 \n$66,134 \n$68,092 \n$4,000 \n$8,389 \nTotal loans and leases\n(1)\n74,274 \n69,021 \n62,905 \n64,974 \n3,976 \n8,352 \nDeposits\n128,547 \n121,899 \n44,482 \n44,190 \n— \n— \nInterest-earning assets\n74,870 \n69,608 \n63,719 \n65,550 \n3,976 \n8,352 \nNine Months Ended September 30,\nConsumer Banking\nCommercial Banking\nNon-Core\n(dollars in millions)\n2025\n2024\n2025\n2024\n2025\n2024\nNet interest income\n$3,673 \n$3,369 \n$1,328 \n$1,486 \n($27)\n($96)\nNoninterest income\n937 \n820 \n733 \n676 \n7 \n— \nTotal revenue\n4,610 \n4,189 \n2,061 \n2,162 \n(20)\n(96)\nNoninterest expense\n2,896 \n2,734 \n977 \n928 \n43 \n74 \nProfit (loss) before credit losses\n1,714 \n1,455 \n1,084 \n1,234 \n(63)\n(170)\nNet charge-offs\n248 \n249 \n239 \n262 \n43 \n46 \nIncome (loss) before income tax expense (benefit)\n1,466 \n1,206 \n845 \n972 \n(106)\n(216)\nIncome tax expense (benefit)\n371 \n311 \n195 \n223 \n(27)\n(55)\nNet income (loss)\n$1,095 \n$895 \n$650 \n$749 \n($79)\n($161)\nAverage Balances: \nTotal assets\n$79,040 \n$74,510 \n$65,931 \n$69,046 \n$5,241 \n$9,450 \nTotal loans and leases\n(1)\n72,588 \n68,146 \n62,801 \n66,048 \n5,217 \n9,408 \nDeposits\n127,193 \n120,803 \n43,056 \n44,766 \n— \n— \nInterest-earning assets\n73,176 \n68,740 \n63,485 \n66,507 \n5,217 \n9,408 \n(1)  \nIncludes LHFS.\nConsumer Banking \nNet interest income increased $106 million and $304 million for the three and nine months ended September 30, 2025, respectively, compared to the same periods in 2024, driven by higher net interest margin and growth in average interest-earning assets.\nCitizens Financial Group, Inc. | 20\nNoninterest income increased $26 million and $117 million for the three and nine months ended September 30, 2025, respectively, compared to the same periods in 2024, driven by wealth fees, mortgage banking fees, and service charges and fees, reflecting growth in assets under management, primarily from the Private Bank, higher MSR valuation, net of hedging, and higher overdraft and cash management fees.\nNoninterest expense increased $63 million and $162 million for the three and nine months ended September 30, 2025, respectively, compared to the same periods in 2024, driven primarily by salaries and benefits reflecting hiring related to the Private Bank and Private Wealth build-out, as well as an increase in medical benefit costs, and outside services given investments across the enterprise. \nNet charge-offs were stable for the three and nine months ended September 30, 2025 compared to the same periods in 2024.\nCommercial Banking \nNet interest income decreased $30 million and $158 million for the three and nine months ended September 30, 2025, respectively, compared to the same periods in 2024, driven by lower net interest margin and a decline in average interest-earning assets.\nNoninterest income increased $79 million and $57 million for the three and nine months ended September 30, 2025, respectively, compared to the same periods in 2024, driven by capital markets fees reflecting higher M&A, loan syndication, and equity underwriting fees during the three-month period, and by higher loan syndication and equity underwriting fees during the nine-month period.\nNoninterest expense increased $33 million and $49 million for the three and nine months ended September 30, 2025, respectively, compared to the same periods in 2024, driven primarily by salaries and benefits given strong Capital Markets fee performance and increased medical benefit costs, and outside services given investments across the enterprise.\nNet charge-offs decreased $23 million for the nine months ended September 30, 2025 compared to the same period in 2024, driven by CRE, partially offset by an increase in commercial and industrial.\nNon-Core\nNet interest income increased $69 million for the nine months ended September 30, 2025, compared to the same period in 2024, driven by a decline in funding costs relative to the highest-cost marginal funding sources during 2025, including secured borrowings collateralized by auto loans and FHLB advances.\nNet charge-offs were stable for the nine months ended September 30, 2025 compared to the same period in 2024.\nAverage loans and leases decreased $4.4 billion and $4.2 billion for the three and nine months ended September 30, 2025, respectively, compared to the same periods in 2024, driven by expected runoff of the Non-Core portfolio.\nRISK MANAGEMENT \nWe are committed to maintaining a strong, integrated, and proactive approach to the management of all risks to which we are exposed in pursuit of our business objectives. A key aspect of our Board’s responsibility as the main decision-making body is setting our risk appetite to ensure that the level of risk that we are willing to accept in the attainment of our strategic business and financial objectives is clearly understood. \nTo enable our Board to carry out its objectives, it has delegated authority for risk management activities, as well as governance and oversight of those activities, to a number of Board and executive management level risk committees. The Executive Risk Committee, chaired by the Chief Risk Officer, is responsible for oversight of risk across the enterprise and actively considers our inherent material risks, analyzes our overall risk profile, and seeks confirmation that the risks are being appropriately identified, assessed, and mitigated. Reporting to the Executive Risk Committee are the following committees covering specific areas of risk: Compliance and Operational Risk, Model Risk, Credit Policy, Asset Liability, Business Initiatives Review, and Conduct and Ethics. \nThere have been no significant changes in our risk management practices, risk framework, risk appetite, or credit risk management as described in “Risk Governance” in our 2024 Form 10-K.\nCitizens Financial Group, Inc. | 21\nCredit Risk\nCredit risk represents the potential for loss arising from the failure of a customer, counterparty, or issuer to perform in accordance with the contractual terms of an obligation. While the majority of our credit risk is associated with lending activities, we do engage with other financial counterparties for a variety of purposes including investing, asset and liability management, and trading activities. Given the financial impact of credit risk on our earnings and balance sheet, the assessment, approval, and management of credit risk represents a significant part of our overall risk-management responsibility.\nOur independent Credit Risk Function is responsible for reviewing and approving the credit risk appetite across all lines of business and credit products, approving larger and higher-risk credit transactions, monitoring portfolio performance, identifying problem credit exposures, and ensuring remedial management. Credit Risk actively monitors and manages concentrations of loan limits, loan types, industries, and geographies to ensure that our risk appetite is well balanced to achieve our goals.\nWe employ a comprehensive and integrated risk control program to proactively identify, measure, monitor, and mitigate existing and emerging credit risks across the credit life cycle including origination, account/portfolio management, and loss mitigation and recovery. For more information regarding our credit risk management practices, see “Credit Risk Management” in our 2024 Form 10-K.\nFor more information regarding credit quality, see “Credit Quality” in Item 2.\nMarket Risk\nMarket risk refers to potential losses arising from changes in interest rates, foreign exchange rates, equity prices, commodity prices, and/or other relevant market rates or prices. Modest market risk arises from trading activities that serve customer needs, including the hedging of interest rate and foreign exchange risks. As described below, the market risk arising from our non-trading banking activities, such as the origination of loans and deposit gathering, is more significant. We have established enterprise-wide policies and methodologies to identify, measure, monitor, and report market risk. We actively manage market risk for both non-trading and trading activities. \nNon-Trading Risk\n \nOur non-trading banking activities expose us to market risk. This market risk is composed of interest rate risk, as we have no commodity risk and de minimis direct currency and equity risk. We also have market risk related to capital markets loan originations, as well as the valuation of our MSRs. There have been no significant changes in our sources of interest rate risk, interest rate risk practices, risk framework, metrics, or assumptions as described in “Market Risk — Non-Trading Risk” in our 2024 Form 10-K. \nCitizens Financial Group, Inc. | 22\nThe table below presents the sensitivity of net interest income to various parallel yield curve shifts from the market implied forward yield curve. Our policies involve measuring exposures as a percentage change in net interest income over the next year due to either instantaneous or gradual parallel changes in rates relative to the market implied forward yield curve. As the following table illustrates, our balance sheet is slightly asset sensitive; net interest income would benefit from an increase in interest rates, while exposure to a decline in interest rates is within limits established and monitored by senior management. While an instantaneous and severe shift in interest rates is included in this analysis, we believe that any actual shift in interest rates would be more gradual and, therefore, have a more modest impact.\nTable 16: Sensitivity of Net Interest Income\nEstimated % Change in Net Interest Income over 12 Months\nBasis points\nSeptember 30, 2025\nDecember 31, 2024\nGradual Change in Interest Rates\n+200\n2.4 \n%\n2.2 \n%\n+100\n1.2 \n1.0 \n-100\n(1.2)\n(0.9)\n-200\n(2.5)\n(1.8)\nInstantaneous Change in Interest Rates\n \n \n+200\n2.3 \n%\n1.8 \n%\n+100\n1.5 \n1.1 \n-100\n(1.9)\n(1.3)\n-200\n(4.6)\n(3.3)\nWe continue to manage asset sensitivity within the scope of our policy, changing market conditions, and changes in our balance sheet. The Company’s base case net interest income assumes the forward-rate path implied by the period-end yield curve is realized. The rate risk exposure is then measured based on assumed changes from that base case rate path.\nOur risk position is slightly asset sensitive to a gradual change in rates as of September 30, 2025, consistent with our position as of December 31, 2024. Our interest rate sensitivity incorporates the impact of changes in our balance sheet mix, including securities, loans, deposits, borrowed funds, and hedge activity. Receive-fixed swaps that offset our naturally asset-sensitive balance sheet represent the primary hedging tool utilized to manage overall asset sensitivity. Pay-fixed swaps against our securities portfolio are also utilized to protect capital by reducing AOCI volatility.\nWe use a valuation measure of exposure to structural interest rate risk, EVE, as a supplement to net interest income simulations. EVE complements net interest income simulation analysis as it estimates risk exposure over a long-term horizon. EVE measures the extent to which the economic value of assets, liabilities, and off-balance sheet instruments may change in response to fluctuations in interest rates. This analysis is highly dependent upon assumptions applied to assets and liabilities with non-contractual maturities. We employ sophisticated models for prepayments and deposit pricing and attrition, which provide a granular view of cash flows based on the unique characteristics of the underlying products and customer segments. The change in value is expressed as a percentage of regulatory capital.\nWe use interest rate derivative contracts as part of our ALM strategy to manage exposure to the variability in the interest cash flows on our floating-rate assets and wholesale funding, the variability in the fair value of AFS securities, and to hedge market risk on fixed-rate capital markets debt issuances.\nCitizens Financial Group, Inc. | 23\nThe following table presents interest rate derivative contracts that we have entered into as of September 30, 2025 and December 31, 2024:\nTable 17: Interest Rate Hedges Used to Manage Non-Trading Interest Rate Exposure\nSeptember 30, 2025\nDecember 31, 2024\nWeighted Average\nWeighted Average\n(dollars in millions)\nNotional Amount\nMaturity (Years)\nFixed Rate\nReset Rate \nNotional Amount\nMaturity (Years)\nFixed Rate\nReset Rate\nFair value hedges:\nAsset conversion swaps:\nAFS securities:\nPay fixed/receive SOFR\n$8,253 \n4.1 \n3.8 \n%\n4.2 \n%\n$7,827 \n4.7 \n3.8 \n%\n4.5 \n%\nLiability conversion swaps:\nLong-term borrowed funds:\nReceive fixed/pay SOFR\n500 \n0.1 \n2.6 \n4.5 \n500 \n0.9 \n2.6 \n4.8 \nTotal fair value hedges\n8,753 \n8,327 \nCash flow hedges:\nAsset conversion swaps:\nLoans:\nSwaps\nReceive fixed/pay SOFR\n30,750 \n1.1 \n3.3 \n4.2 \n26,250 \n1.7 \n3.1 \n4.5 \nReceive fixed/pay SOFR - forward-starting\n18,500 \n3.4 \n3.7 \n3.4 \n20,000 \n3.5 \n3.7 \n4.0 \nPay fixed/receive SOFR - forward-starting\n434 \n3.1 \n3.7 \n3.9 \n— \n— \n— \n— \nBasis swaps\nReceive SOFR/pay 1-month term SOFR\n13,000 \n1.0 \n— \n4.2/4.1\n11,500 \n1.6 \n— \n4.5/4.3\nReceive SOFR/pay 1-month term SOFR - forward-starting\n1,000 \n1.3 \n— \n3.8/3.7\n3,000 \n2.4 \n— \n4.0/4.0\nTotal cash flow hedges\n63,684 \n60,750 \nTotal hedges\n$72,437 \n$69,077 \nIncluded in AOCI is a net loss from terminated swaps of $376 million that will reduce net interest income by $103 million in the fourth quarter of 2025. The remaining $273 million will reduce net interest income by $230 million in 2026 and $43 million after 2026.\nCapital Markets\nA key component of our capital markets activities is the underwriting and distribution of corporate credit facilities to finance M&A transactions for our clients. We have a rigorous risk management process around these activities, including a limit structure capping our underwriting risk, potential loss, and sub-limits for specific asset classes. Further, the ability to approve underwriting exposure is delegated only to senior level individuals in the credit risk management and capital markets organizations with each transaction reviewed by the Loan Underwriting Approval Committee.\nMortgage Servicing Rights\n    \nWe have market risk associated with the value of residential MSRs, which are impacted by various types of inherent risks, including duration, basis, convexity, volatility, and yield curve. \nAs part of our overall risk management strategy we enter into various freestanding derivatives, such as interest rate swaps, interest rate swaptions, interest rate futures, and forward contracts to purchase mortgage-backed securities to economically hedge the changes in fair value of our MSRs. For more information regarding the fair value of our MSRs and associated derivatives see Note 5 and Note 8.\nAs with our traded market risk-based activities, earnings at risk excludes the impact of MSRs. MSRs are captured under our single price risk management framework that is used for calculating a management VaR consistent with the definition used by banking regulators.\nCitizens Financial Group, Inc. | 24\nTrading Risk\n \nWe are exposed to market risk primarily through client facilitation activities from certain derivative and foreign exchange products as well as underwriting and market making activities. Market risk exposure arises from fluctuations in interest rates, basis spreads, volatility, foreign exchange rates, equity prices, and credit spreads across various financial instruments. Securities underwriting and trading activities are conducted through CBNA and Citizens JMP Securities, LLC.\n \nThere have been no significant changes in our market risk governance, market risk measurement, or market risk practices including VaR, stressed VaR, sensitivity analysis, stress testing, VaR model review and validation, or VaR backtesting as described in “Market Risk — Trading Risk” in our 2024 Form 10-K.\nMarket Risk Regulatory Capital\n \nThe U.S. banking regulators’ “Market Risk Rule” covers the calculation of market risk capital. Under this rule, all of our client facing trades and associated hedges maintain a low net risk and qualify as “covered positions.” The internal management VaR measure is calculated based on the same population of trades that is utilized for regulatory VaR. \nTable 18: Results of Modeled and Non-Modeled Measures for Regulatory Capital Calculations\n(dollars in millions)\nFor the Three Months Ended September 30, 2025\nFor the Three Months Ended September 30, 2024\nMarket Risk Category\n \nPeriod End\nAverage\nHigh\nLow\nPeriod End\nAverage\nHigh\nLow\nInterest Rate\n$1 \n$1 \n$2 \n$1 \n$2 \n$2 \n$4 \n$1 \nForeign Exchange Currency Rate\n— \n— \n21 \n— \n— \n— \n— \n— \nCredit Spread\n1 \n1 \n2 \n— \n1 \n2 \n3 \n— \nCommodity\n— \n— \n— \n— \n— \n— \n— \n— \nGeneral VaR\n2 \n2 \n2 \n2 \n2 \n3 \n4 \n1 \nSpecific Risk VaR\n— \n— \n— \n— \n— \n— \n— \n— \nTotal VaR\n$2 \n$2 \n$2 \n$2 \n$2 \n$3 \n$4 \n$1 \nStressed General VaR\n$9 \n$7 \n$12 \n$5 \n$6 \n$7 \n$14 \n$2 \nStressed Specific Risk VaR\n— \n— \n— \n— \n— \n— \n— \n— \nTotal Stressed VaR\n$9 \n$7 \n$12 \n$5 \n$6 \n$7 \n$14 \n$2 \nMarket Risk Regulatory Capital\n$28 \n$29 \nSpecific Risk Not Modeled Add-on\n31 \n23 \nde Minimis Exposure Add-on\n2 \n1 \nTotal Market Risk Regulatory Capital\n$61 \n$53 \nMarket Risk-Weighted Assets\n$760 \n$662 \nLiquidity Risk \nWe consider the effective and prudent management of liquidity fundamental to our safety and soundness. We define liquidity as our ability to meet our obligations when they come due. As a financial institution, we must maintain operating liquidity to meet expected daily and forecasted cash flow requirements, as well as contingent liquidity to meet unexpected (stress scenario) funding requirements. Reflecting the importance of meeting all unexpected and stress-scenario funding requirements, we identify and manage contingent liquidity, consisting of cash balances at the FRB, unencumbered high-quality liquid securities, and unused FHLB borrowing capacity. Separately, we also identify and manage asset liquidity as a subset of contingent liquidity, consisting of cash balances at the FRB and unencumbered high-quality liquid securities. We maintain additional secured borrowing capacity at the FRB discount window, but do not view this as a primary means of funding, but rather a potential source in a stressed environment or during a market disruption. We manage liquidity at the consolidated enterprise level and at each material legal entity. \nLiquidity risk is the risk arising from the inability to meet our obligations when they come due. We must maintain adequate funding to meet current and future obligations, including customer loan requests, deposit maturities and withdrawals, debt service, leases, and other cash commitments, under both normal operating conditions and periods of company-specific and/or market stress.\nCitizens Financial Group, Inc. | 25\nLiquidity risk is measured and managed by the Funding and Liquidity unit within our Treasury group in accordance with policy guidelines promulgated by our Board and the Asset Liability Committee. The Funding and Liquidity unit is responsible for maintaining a liquidity management framework that effectively manages liquidity risk. Processes within this framework include, but are not limited to, regular and comprehensive reporting, including current levels versus threshold limits for a broad set of liquidity metrics and early warning indicators, explanatory commentary relating to emerging risk trends and, as appropriate, recommended remedial strategies, liquidity stress testing, contingency funding plans, and collateral management. \nOur Funding and Liquidity unit’s primary goals are to deliver and maintain prudent levels of operating liquidity to support expected and projected funding requirements; contingent liquidity to support unexpected funding requirements resulting from idiosyncratic, systemic, and combination stress events; and regulatory liquidity requirements in a timely manner from stable and cost-efficient funding sources. We seek to accomplish these goals by funding loans with stable deposits, by prudently controlling dependence on wholesale funding, particularly short-term unsecured funding, and by maintaining ample available liquidity, including a contingent liquidity buffer of unencumbered high-quality loans and securities.\nThe Funding and Liquidity unit monitors a variety of liquidity and funding metrics and early warning indicators, including specific risk thresholds limits. These monitoring tools are broadly classified as follows: \n•\nCurrent liquidity sources and capacities, including cash balances at the FRB, free and liquid securities, and secured borrowing capacity at the FHLB and FRB discount window; \n•\nLiquidity stress sources, including idiosyncratic, systemic, and combined stresses, in addition to evolving regulatory requirements; and\n•\nCurrent and prospective exposures, including secured and unsecured wholesale funding, and spot and cumulative cash-flow gaps across a variety of horizons.\nFurther, certain of these metrics are monitored individually for CBNA and for our consolidated enterprise on a daily basis, including cash position, unencumbered securities, asset liquidity, and available FHLB borrowing capacity. In order to identify emerging trends and risks and inform funding decisions, specific metrics are also forecasted over a one-year horizon.\nWe rely on customer deposits to be our primary stable and low-cost source of funding. Our funding sources also include our ability to securitize loans in secondary markets, raise funds in the debt and equity capital markets, pledge loans and/or securities for borrowing from the FHLB, pledge securities as collateral for borrowing under repurchase agreements, and sell AFS securities. In addition, we maintain a contingency funding plan designed to ensure that liquidity sources are sufficient to meet ongoing obligations and commitments, particularly in a stressed environment or during a market disruption. The plan identifies members of the liquidity contingency team and provides a framework for management to follow, including notification and escalation of potential liquidity stress events.\nAs of September 30, 2025:\n•\nOrganically generated deposits continue to be our primary source of funding, resulting in a consolidated period-end loan-to-deposit ratio, excluding LHFS, of 78.3%;\n◦\nEstimated insured/secured deposits comprise 64% of our consolidated deposit base of $180.0 billion;\n•\nOur total available liquidity, comprised of contingent liquidity and available discount window capacity, was approximately $88.0 billion;\n◦\nContingent liquidity was $73.1 billion, consisting of unencumbered high-quality liquid securities of $38.8 billion, unused FHLB capacity of $24.3 billion, and cash balances at the FRB of $10.0 billion; and\n◦\nAvailable discount window capacity was $14.9 billion, defined as available total borrowing capacity from the FRB based on identified collateral, which is primarily secured by non-mortgage commercial and retail loans.\nFor a summary of our sources and uses of cash by type of activity for the nine months ended September 30, 2025 and 2024, see the Consolidated Statements of Cash Flows in Item 1.\nCitizens Financial Group, Inc. | 26\nParent Company Liquidity\n \nOur Parent Company’s primary sources of cash are dividends and interest received from CBNA resulting from investing in bank equity and subordinated debt as well as externally issued preferred stock, senior debt, and subordinated debt. Uses of cash include the routine cash flow requirements as a bank holding company, including periodic share repurchases and payments of dividends, interest, and expenses; the needs of subsidiaries, including CBNA for additional equity and, as required, its need for debt financing; and the support for extraordinary funding requirements when necessary. To the extent the Parent Company relies on wholesale borrowings, uses also include payments of related principal and interest.\nDuring the nine months ended September 30, 2025, the Parent Company completed the following transactions:\n•\nIssued $750 million of 5.253% fixed-to-floating rate senior notes due 2031;\n•\nIssued 400,000 shares of 6.500% fixed-rate reset non-cumulative perpetual Series I Preferred Stock at an aggregate offering price of $400 million; and\n•\nIssued a notice to redeem all outstanding shares of the 5.650% fixed-rate reset non-cumulative perpetual Series F Preferred Stock, which was redeemed on October 6, 2025.\nOur Parent Company’s cash and cash equivalents represent a source of liquidity that can be used to meet various needs and totaled $3.2 billion and $2.7 billion as of September 30, 2025 and December 31, 2024, respectively.\nDuring the three months ended September 30, 2025 and 2024, the Parent Company declared dividends on common stock of $184 million and $190 million, respectively, and declared dividends on preferred stock of $32 million and $38 million, respectively.\nDuring the nine months ended September 30, 2025 and 2024, the Parent Company declared dividends on common stock of $555 million and $581 million, respectively, and declared dividends on preferred stock of $99 million and $103 million, respectively.\nDuring the three months ended September 30, 2025 and 2024, the Parent Company repurchased $75 million and $325 million, respectively, of its outstanding common stock, and repurchased $475 million and $825 million, respectively, during the nine months ended September 30, 2025 and 2024.\nCBNA Liquidity\nAs CBNA’s primary business involves taking deposits and making loans, a key role of liquidity management is to ensure that customers have timely access to funds. Liquidity management also involves maintaining sufficient liquidity to repay wholesale borrowings, pay operating expenses, and support extraordinary funding requirements when necessary. In the ordinary course of business, the liquidity of CBNA is managed by matching sources and uses of cash. The primary sources of bank liquidity include deposits from our consumer and commercial customers; payments of principal and interest on loans and debt securities; and wholesale borrowings, as needed. The primary uses of bank liquidity include withdrawals and maturities of deposits; payment of interest on deposits; funding of loans and related commitments; and funding of securities purchases. To the extent that CBNA relies on wholesale borrowings, uses also include payments of related principal and interest. For further information on CBNA’s outstanding debt see Note 7.\nDuring the nine months ended September 30, 2025, CBNA redeemed $350 million of 5.284% fixed-to-floating rate senior notes due 2026.\nCitizens Financial Group, Inc. | 27\nCredit Ratings\nCredit ratings assigned by agencies such as Moody’s, Standard and Poor’s, and Fitch impact our access to unsecured wholesale market funds and to large uninsured customer deposits and are presented in the table below. We currently have a “stable” outlook at Standard & Poor’s, a “stable” outlook at Moody’s, and a “positive” outlook at Fitch. Changes in our public credit ratings could affect both the cost and availability of our wholesale funding.\nTable 19: Credit Ratings\n \nSeptember 30, 2025\n \nMoody’s\n  \nStandard &\nPoor’s\nFitch\n  \nCitizens Financial Group, Inc.:\n \n \n \nLong-term issuer\nBaa1\nBBB+\nBBB+\nShort-term issuer\nNR\nA-2\nF1\nSubordinated debt\nBaa1\nBBB\nBBB\nPreferred Stock\nBaa3\nBB+\nBB\nCitizens Bank, National Association:\nLong-term issuer\nA3\nA-\nBBB+\nShort-term issuer\n(P) P-2\nA-2\nF1\nLong-term deposits\nA1\nNR\nA-\nShort-term deposits\nP-1\nNR\nF1\n \nNR = Not rated\nExisting and evolving regulatory liquidity requirements represent another key driver of systemic liquidity conditions and liquidity management practices. The FRB and OCC regularly evaluate our liquidity as part of the overall supervisory process. In addition, we are subject to existing and evolving regulatory liquidity requirements, some of which are subject to further rulemaking, guidance, and interpretation by the applicable federal regulators. For further discussion, see the “Liquidity Requirements” section under “Regulation and Supervision” in our 2024 Form 10-K.\nOff-Balance Sheet Arrangements\nWe engage in a variety of activities that are not reflected in our Consolidated Balance Sheets that are generally referred to as “off-balance sheet arrangements.” For more information on these types of activities, see Note 11.\nOperational Risk\nOperational risk is the risk of loss due to human error, third-party performance failures, or inadequate or failed internal systems and controls and includes certain risks such as fraud, legal, and natural disasters. To mitigate these risks, we maintain a comprehensive system of internal controls designed to identify, assess, and monitor potential threats to our operations. Our risk management framework includes regular audits, employee training, cybersecurity measures, and business continuity planning. We continuously evaluate and enhance these controls to adapt to evolving risks and regulatory requirements, ensuring the integrity, reliability, and efficiency of our operations.\nCybersecurity\nThe Company’s Cybersecurity Program (“CSP”) drives an end-to-end, continuous process that protects our customers, colleagues, assets, premises, systems, and information (electronic and non-electronic), and is designed to ensure compliance with current and emerging federal and state laws and regulations. The CSP is designed to ensure the effective implementation of the Corporate Security and Resilience Operating Model across all business lines of the Company and is under the supervision of the Chief Security Officer. \nThe CSP is designed to assess and mitigate threats and risks to the Company. New and emerging threats are assessed through an intelligence lifecycle, which includes threat modeling. In addition, risk assessment processes drive risk identification and measurement related to security. Once risks are identified and measured, the Company’s Enterprise Risk Management Governance Framework is leveraged to track and mitigate them. Control testing is utilized to demonstrate that risks are managed effectively, identify gaps in expected control operation, and develop appropriate remediation plans, in order to manage risk to the Company within tolerable limits.\nCitizens Financial Group, Inc. | 28\nThe Company regularly reviews the nature of its business activities and modifies the CSP as appropriate. Many of the elements of the CSP are related to cyber defense and are in place to reduce our risk to a wide range of potential cyber threats that may target our assets and information daily. The effectiveness of the CSP is assessed and measured periodically by various lines of defense within the Company and is conducted primarily through risk assessments, assurance testing, and an independent audit. External organizations are also routinely engaged to assess our CSP and test our perimeter defenses. The effectiveness of the CSP is reported periodically to the appropriate governance committees. For more information regarding our cybersecurity risk management practices and governance, see Item 1C in our 2024 Form 10-K.\nCompliance Risk\nFinancial institutions are subject to many laws, rules, and regulations at both the federal and state levels. These broad-based laws, rules, and regulations include, but are not limited to, expectations relating to anti-money laundering, lending limits, client privacy, fair lending, prohibitions against unfair, deceptive, or abusive acts or practices, protections for military members as they enter active duty, and community reinvestment. Adherence to the increasing volume and complexity of regulatory changes can increase our overall compliance risk. As such, we utilize various resources to help ensure expectations are met, including a team of compliance experts dedicated to ensuring our conformance with all applicable laws, rules, and regulations. Our colleagues receive training for several broad-based laws and regulations including, but not limited to, anti-money laundering and customer privacy. Colleagues engaged in lending activities also receive training for laws and regulations related to flood disaster protection, equal credit opportunity, fair lending, and/or other courses related to the extension of credit. We hold ourselves to a high standard for adherence to compliance management and seek to continuously enhance our performance.\nCAPITAL\nAs a bank and financial holding company, we are subject to regulation and supervision by the FRB. Our banking subsidiary, CBNA, is a national banking association primarily regulated by the OCC. Our regulation and supervision continues to evolve as the legal and regulatory frameworks governing our operations continue to change. See “Regulation and Supervision” in our 2024 Form 10-K for more information.\nCapital Adequacy Process\nOur assessment of capital adequacy begins with our Board-approved risk appetite and risk management framework. This framework provides for the identification, measurement, and management of material risks. There have been no significant changes to our capital adequacy risk appetite and risk management framework as described in “Capital and Regulatory Matters” in our 2024 Form 10-K.\nThe FRB regularly supervises and evaluates our capital adequacy and capital planning processes, including the submission of an annual capital plan approved by our Board of Directors or one of its committees. Under the FRB’s capital requirements, we must maintain capital ratios above the sum of the regulatory minimum and SCB requirement to avoid restrictions on capital distributions and discretionary bonus payments. The FRB utilizes the supervisory stress test to determine our SCB, which is re-calibrated with each biennial supervisory stress test and updated annually to reflect our planned common stock dividends. As an institution subject to Category IV standards, we are subject to biennial supervisory stress testing in even-numbered years. Our SCB associated with the 2024 supervisory stress test is 4.5%, effective through September 30, 2025. In August 2025, the FRB provided us with our updated SCB requirement, which will remain at 4.5% and is effective from October 1, 2025 to September 30, 2026.\nRegulations relating to capital planning, regulatory reporting, stress testing, and capital buffer requirements applicable to firms like us are presently subject to rulemaking and potential further guidance and interpretation by the applicable federal regulators. We will continue to evaluate the impact of these and any other regulatory changes, including their potential resultant changes in our regulatory and compliance costs.\nFor more information on our capital adequacy process, see “Capital and Regulatory Matters” in our 2024 Form 10-K.\nCitizens Financial Group, Inc. | 29\nRegulatory Capital Ratios and Capital Composition\nUnder the current U.S. Basel III capital framework, we, and our banking subsidiary, CBNA, must meet the following specific minimum requirements: CET1 capital ratio of 4.5%, Tier 1 capital ratio of 6.0%, Total capital ratio of 8.0%, and Tier 1 leverage ratio of 4.0%. As a bank holding company, our SCB of 4.5% is imposed on top of the three minimum risk-based capital ratios listed above and a CCB of 2.5% is imposed on top of the three minimum risk-based capital ratios listed above for CBNA. \nFor additional discussion of the U.S. Basel III capital framework and its related application, see “Regulation and Supervision” in our 2024 Form 10-K. The table below presents the regulatory capital ratios for CFG and CBNA under the U.S. Basel III Standardized rules:\nTable 20: Regulatory Capital Ratios Under the U.S. Basel III Standardized Rules\nSeptember 30, 2025\nDecember 31, 2024\n(dollars in millions)\nAmount\nRatio\nAmount\nRatio\nRequired Minimum Capital Ratio\n(1)\nCET1 capital\nCFG\n$18,046 \n10.7 \n%\n$17,900 \n10.8 \n%\n9.0 \n%\nCBNA\n20,823 \n12.4 \n20,250 \n12.3 \n7.0 \nTier 1 capital\nCFG\n20,157 \n11.9 \n20,013 \n12.1 \n10.5 \nCBNA\n20,823 \n12.4 \n20,250 \n12.3 \n8.5 \nTotal capital\nCFG\n23,455 \n13.9 \n23,232 \n14.0 \n12.5 \nCBNA\n24,009 \n14.3 \n23,362 \n14.2 \n10.5 \nTier 1 leverage\nCFG\n20,157 \n9.4 \n20,013 \n9.4 \n4.0 \nCBNA\n20,823 \n9.8 \n20,250 \n9.6 \n4.0 \nRisk-weighted assets\nCFG\n168,932 \n165,699 \nCBNA\n167,767 \n164,986 \nQuarterly adjusted average assets\n(2)\nCFG\n213,536 \n212,555 \nCBNA\n212,585 \n211,849 \n(1) \nRepresents minimum requirement under the current capital framework plus the SCB of 4.5% and CCB of 2.5% for CFG and CBNA, respectively. The SCB and CCB are not applicable to the Tier 1 leverage ratio.\n(2) \nRepresents total average assets less certain amounts deducted from Tier 1 capital.\nAt September 30, 2025, CFG’s CET1, Tier 1, and Total capital ratios decreased compared to December 31, 2024. Dividends, common share repurchases, a $3.2 billion increase in RWA, and the full phase-in of the modified CECL transition amount was partially offset by net income. Higher commercial and industrial loans was the key driver for the increase in RWA.\nAt September 30, 2025, CBNA’s CET1, Tier 1, and Total capital ratios increased compared to December 31, 2024. Net income was partially offset by dividend payments to the Parent Company, a $2.8 billion increase in RWA, and the full phase-in of the modified CECL transition amount. Higher commercial and industrial loans was the key driver for the increase in RWA.\nAt September 30, 2025, CFG’s Tier 1 leverage ratio was stable and CBNA’s Tier 1 leverage ratio increased compared to December 31, 2024, reflecting an increase in quarterly adjusted average assets and their respective changes in Tier 1 capital described above.\nCitizens Financial Group, Inc. | 30\nThe following table presents the components of our regulatory capital under the U.S. Basel III capital framework:\nTable 21: Capital Composition Under the U.S. Basel III Capital Framework\n(dollars in millions)\nSeptember 30, 2025\nDecember 31, 2024\nTotal common stockholders' equity\n$23,718 \n$22,141 \nExclusions:\nModified CECL transitional amount\n— \n96 \nNet unrealized (gains)/losses recorded in AOCI, net of tax:\nDebt securities\n1,760 \n2,369 \nDerivatives\n213 \n925 \nUnamortized net periodic benefit costs\n294 \n301 \nDeductions:\nGoodwill, net of deferred tax liability\n(7,762)\n(7,768)\nOther intangible assets, net of deferred tax liability\n(110)\n(128)\nDeferred tax assets that arise from tax loss and credit carryforwards\n(67)\n(36)\nTotal CET1 capital\n18,046 \n17,900 \nQualifying preferred stock \n2,111 \n2,113 \nTotal Tier 1 capital\n20,157 \n20,013 \nQualifying subordinated debt\n(1)\n1,237 \n1,232 \nAllowance for credit losses\n2,201 \n2,259 \nExclusions from Tier 2 capital:\nModified AACL transitional amount\n— \n(125)\nAllowance on PCD assets\n(140)\n(147)\nAdjusted allowance for credit losses\n2,061 \n1,987 \n    Total capital\n$23,455 \n$23,232 \n(1) \nAs of September 30, 2025 and December 31, 2024, the amount of non-qualifying subordinated debt excluded from regulatory capital was $336 million and $469 million, respectively. See Note 7 for more details on our outstanding subordinated debt.\nCapital Transactions\nWe completed the following capital transactions during the nine months ended September 30, 2025:\n•\nRepurchased $475 million of our outstanding common stock;\n•\nIssued 400,000 shares of 6.500% fixed-rate reset non-cumulative perpetual Series I Preferred Stock at an aggregate offering price of $400 million;\n•\nIssued a notice to redeem all outstanding shares of the 5.650% fixed-rate reset non-cumulative perpetual Series F Preferred Stock, which was redeemed on October 6, 2025;\n•\nDeclared quarterly common stock dividends of $0.42 per share, aggregating to $555 million; and \n•\nDeclared preferred stock dividends aggregating to $99 million.\nFor additional detail regarding our common and preferred stock dividends see Note 10.\nOn June 13, 2025, we announced that our Board of Directors increased the capacity of our common share repurchase program to $1.5 billion, an increase of $1.2 billion above the $300 million of capacity remaining under the prior June 2024 authorization. All future capital distributions are subject to consideration and approval by our Board of Directors prior to execution. The timing and amount of future dividends and share repurchases will depend on various factors, including our capital position, financial performance, balance sheet growth, market conditions, and regulatory considerations.\nAOCI Impact on Regulatory Capital\nUnder the current applicable regulatory capital rules we have made the AOCI opt-out election, which enables us to exclude components of AOCI from regulatory capital. As noted in the “Capital and Stress Testing Requirements” section of “Regulation and Supervision” in our 2024 Form 10-K, the regulatory agencies are considering the inclusion of AOCI components in regulatory capital for Category IV firms like us, notably the AOCI relative to securities and pension.\nCitizens Financial Group, Inc. | 31\nIn light of this potential change, the Company considers capital ratios including the AOCI impact from securities and pension when evaluating capital utilization and adequacy, in addition to capital ratios defined by the regulatory agencies. These capital ratios are intended to complement our regulatory capital ratios and are viewed by management as useful measures reflective of the level of capital available to withstand unexpected market conditions. See “Non-GAAP Financial Measures” for more information.\nThe following table presents our regulatory capital ratios including the AOCI impact from securities and pension: \nTable 22: AOCI Impact on Regulatory Capital\nSeptember 30, 2025\nCFG\nCBNA\n(dollars in millions)\nCET1\nTier 1\nTotal\nCET1\nTier 1\nTotal\nRegulatory capital, including AOCI impact:\nRegulatory capital\n$18,046 \n$20,157 \n$23,455 \n$20,823 \n$20,823 \n$24,009 \nUnrealized gains (losses) on securities and pension\n(2,054)\n(2,054)\n(2,054)\n(2,036)\n(2,036)\n(2,036)\nDeferred tax assets - securities and pension AOCI\n(34)\n(34)\n(34)\n(38)\n(38)\n(38)\nRegulatory capital, including AOCI impact (non-GAAP)\n$15,958 \n$18,069 \n$21,367 \n$18,749 \n$18,749 \n$21,935 \nRisk-weighted assets, including AOCI impact:\nRegulatory risk-weighted assets\n$168,932 \n$168,932 \n$168,932 \n$167,767 \n$167,767 \n$167,767 \nUnrealized gains (losses) on securities and pension\n(582)\n(582)\n(582)\n(564)\n(564)\n(564)\nDeferred tax assets - securities and pension AOCI\n1,682 \n1,682 \n1,682 \n1,656 \n1,656 \n1,656 \nRisk-weighted assets, including AOCI impact (non-GAAP)\n$170,032 \n$170,032 \n$170,032 \n$168,859 \n$168,859 \n$168,859 \nRatio:\nRegulatory capital ratio\n10.7 \n%\n11.9 \n%\n13.9 \n%\n12.4 \n%\n12.4 \n%\n14.3 \n%\nRegulatory capital ratio, including AOCI impact (non-GAAP)\n9.4 \n%\n10.6 \n%\n12.6 \n%\n11.1 \n%\n11.1 \n%\n13.0 \n%\nCRITICAL ACCOUNTING ESTIMATES\nOur Consolidated Financial Statements included in this Report are prepared in accordance with GAAP, requiring us to establish accounting policies and make estimates and assumptions that affect reported amounts.\nAn accounting estimate requires assumptions and judgments about uncertain matters that could have a material effect on our Consolidated Financial Statements. Estimates are made using facts and circumstances known at a point in time. Changes in those facts and circumstances could produce results substantially different from those estimates. Our most significant accounting policies and estimates include the ACL, fair value measurements, and the evaluation and measurement of goodwill impairment. For additional information regarding fair value measurements and goodwill, see “Critical Accounting Estimates” in our 2024 Form 10-K. \nAllowance for Credit Losses\nThe ACL of $2.2 billion at September 30, 2025 decreased $58 million compared to December 31, 2024 given improving loan mix, reflecting the reduction of the Non-Core portfolio, reduced CRE, and lower loss-content originations.\nAs of September 30, 2025, our ACL economic forecast over a two-year reasonable and supportable period reflects the economy going into a shallow two quarter contraction inclusive of uncertainties related to the implementation of tariffs and protectionist trade policies, inflationary pressures, and geopolitical tensions. This forecast is generally applied to the retail and commercial and industrial portfolios and projects peak unemployment of approximately 5.2% and a start-to-trough real GDP decline of approximately 0.5%, compared to peak unemployment of approximately 5.1% and a start-to-trough real GDP decline of approximately 0.4% at December 31, 2024. More severe economic scenarios are applied within the CRE portfolio, such as general office, with peak unemployment of approximately 9.4% and a start-to-trough real GDP decline of approximately 4.4%, compared to peak unemployment of approximately 9.3% and a start-to-trough real GDP decline of approximately 4.4% at December 31, 2024. \nCitizens Financial Group, Inc. | 32\nOur determination of the ACL is sensitive to changes in forecasted macroeconomic conditions during the reasonable and supportable forecast period. To illustrate this sensitivity, we applied a more pessimistic scenario than that described above which reflects deeper real GDP contraction across our two-year reasonable and supportable forecast period with peak unemployment of approximately 6.7% and a start-to-trough real GDP decline of approximately 2.0%. Excluding consideration of qualitative adjustments, this scenario would result in a quantitative lifetime loss estimate of approximately 1.4x our modeled period-end ACL, or an increase of approximately $700 million. This analysis relates only to the modeled credit loss estimate and not to the overall period-end ACL, which includes qualitative adjustments.\nBecause several quantitative and qualitative factors are considered in determining the ACL, this sensitivity analysis does not necessarily reflect the nature and extent of future changes in the ACL or even what the ACL would be under these economic circumstances. The sensitivity analysis is intended to provide insights into the impact of adverse changes in the macroeconomic environment and the corresponding impact to modeled loss estimates. The hypothetical determination does not incorporate the impact of management judgment or other qualitative factors that could be applied in the actual estimation of the ACL and does not imply any expectation of future deterioration in our loss rates.\nIt remains difficult to estimate how changes in economic forecasts might affect our ACL because such forecasts consider a wide variety of variables and inputs, and changes in the variables and inputs may not occur at the same time or in the same direction, and such changes may have differing impacts by product type. The variables and inputs may be idiosyncratically affected by risks to the economy, including changing monetary and fiscal policies, impacts from the recent stress on the banking industry, and inflationary trends. Changes in one or multiple of the key macroeconomic variables may have a material impact on our estimation of expected credit losses.\nFor additional information regarding the ACL, see Note 4 and “Critical Accounting Estimates - Allowance for Credit Losses” and Note 6 in our 2024 Form 10-K.\nCitizens Financial Group, Inc. | 33\nACCOUNTING AND REPORTING DEVELOPMENTS\nAccounting standards issued but not adopted as of September 30, 2025\nPronouncement\nSummary of Guidance\nEffects on Financial Statements\nImprovements to Income Tax Disclosures\nIssued December 2023\n•\nRequires a tabular income tax rate reconciliation that includes specific categories and other significant categories, disaggregated by nature, that exceed 5% of income tax expense at the statutory tax rate\n•\nRequires disclosure of income taxes paid, net of refunds received, disaggregated by federal, state, and foreign taxes, and further disaggregated by individual jurisdictions that exceed 5% of total income taxes paid, net of refunds received\n•\nRequires disclosure of pre-tax income disaggregated between domestic and foreign, and income tax expense disaggregated by federal, state, and foreign\n•\nThe amendments should be applied on a prospective basis but retrospective application is permitted\n•\nRequired effective date: Annual financial statements for the year ending December 31, 2025. We do not intend to early adopt.\n•\nWe expect to provide additional disaggregated income tax disclosures in accordance with this ASU.\nDisaggregation of Income Statement Expenses   \nIssued November 2024\n•\nRequires tabular disclosure of certain expense types, including employee compensation, depreciation, intangible asset amortization, and selling expenses \n•\nRequires a qualitative description of the amounts remaining in relevant expense captions that are not separately disaggregated quantitatively\n•\nAllows for adoption on either a prospective or retrospective basis\n•\nRequired effective date: Annual financial statements for the year ending December 31, 2027, and interim reporting periods thereafter. Early adoption is permitted.\n•\nWe are currently evaluating the impact of this ASU on our required expense disclosures in the Consolidated Financial Statements.\nTargeted Improvements to the Accounting for Internal-Use Software\nIssued September 2025\n•\nEliminates all references to software project development stages and, as a result, requires entities to start capitalizing software costs when both of the following occur: 1) Management has authorized and committed to funding the software project, and 2) It is probable the project will be completed and the software will be used to perform the function intended\n•\nRequires software costs to be expensed as incurred prior to meeting the capitalization requirements noted above\n•\nAllows for adoption on a prospective, modified transition, or retrospective basis\n•\nRequired effective date: January 1, 2028. Early adoption is permitted.\n•\nWe are currently evaluating the impact of this ASU on our Consolidated Financial Statements.\nCitizens Financial Group, Inc. | 34\nNON-GAAP FINANCIAL MEASURES\nThis document contains non-GAAP financial measures that we believe provide useful information to investors to understand our results of operations or financial condition. We caution investors not to place undue reliance on such non-GAAP financial measures, but to consider them with the most directly comparable GAAP financial measures. Non-GAAP financial measures have limitations as analytical tools and should not be considered in isolation or as a substitute for our results reported under GAAP.\nThe following tables present the computation of non-GAAP financial measures used in the MD&A, as well as the reconciliation to the comparable GAAP financial measure, as applicable:\nTable 23: Reconciliation of Tangible Book Value per Common Share (non-GAAP)\n(dollars in millions, except per share data)\nSeptember 30, 2025\nDecember 31, 2024\nBook value per common share\n(1)\n$54.97 \n$50.26 \nTangible book value per common share:\nCommon stockholders' equity\n$23,718 \n$22,141 \nLess: Goodwill\n8,187 \n8,187 \nLess: Other intangible assets\n123 \n146 \nAdd: Deferred tax liabilities related to goodwill and other intangible assets\n440 \n438 \nTangible common equity (non-GAAP)\n(2)\n$15,848 \n$14,246 \nCommon shares outstanding at period end\n431,453,142 \n440,543,381 \nTangible book value per common share (non-GAAP)\n(3)\n$36.73 \n$32.34 \n(1) \nRepresents the most directly comparable GAAP financial measure to tangible book value per common share and is calculated based on common stockholders’ equity divided by common shares outstanding at period end.\n(2) \nTangible common equity is a non-GAAP financial measure that excludes the impact of intangible assets, net of deferred taxes.\n(3) \nTangible book value per common share is a non-GAAP financial measure and is calculated based on tangible common equity divided by common shares outstanding at period end. We believe this non-GAAP financial measure serves as a useful tool to help evaluate the strength and discipline of a company’s capital management strategies and as a conservative measure of total company value.\nTable 24: Reconciliation of Return on Average Tangible Common Equity (non-GAAP)\n \nThree Months Ended September 30,\nNine Months Ended September 30,\n(dollars in millions)\n2025\n2024\n2025\n2024\nReturn on average common equity\n(1)\n7.77 \n%\n6.12 \n%\n7.07 \n%\n6.15 \n%\nNet income available to common stockholders\n$457 \n$344 \n$1,199 \n$1,005 \nNet income available to common stockholders (annualized)\n1,811 \n1,369 \n1,602 \n1,342 \nReturn on average tangible common equity:\nAverage common equity\n$23,288 \n$22,380 \n$22,661 \n$21,838 \nLess: Average goodwill\n8,187 \n8,187 \n8,187 \n8,187 \nLess: Average other intangibles\n126 \n140 \n134 \n146 \nAdd: Average deferred tax liabilities related to goodwill and other intangible assets\n440 \n435 \n439 \n433 \nAverage tangible common equity (non-GAAP)\n(2)\n$15,415 \n$14,488 \n$14,779 \n$13,938 \nReturn on average tangible common equity (non-GAAP)\n(3)\n11.75 \n%\n9.45 \n%\n10.84 \n%\n9.63 \n%\n(1) \nRepresents the most directly comparable GAAP financial measure to return on average tangible common equity and is calculated based on annualized net income available to common stockholders divided by average common equity.\n(2) \nAverage tangible common equity is a non-GAAP financial measure that excludes the impact of intangible assets, net of deferred taxes.\n(3) \nReturn on average tangible common equity is a non-GAAP financial measure and is calculated based on annualized net income available to common stockholders divided by average tangible common equity. We believe this non-GAAP financial measure serves as a useful tool to compare the profitability of financial institutions and assess the efficiency of their capital utilization without the impact of intangible assets, net of deferred taxes.\nCitizens Financial Group, Inc. | 35\nTable 25: Reconciliation of Net Interest Income and Net Interest Margin on an FTE Basis (non-GAAP)\n \nThree Months Ended September 30,\nNine Months Ended September 30,\n(dollars in millions)\n2025\n2024\n2025\n2024\nNet interest income (annualized)\n$5,902 \n$5,447 \n$5,771 \n$5,638 \nAverage interest-earning assets\n197,598 \n197,164 \n196,334 \n198,561 \nNet interest margin\n(1)\n2.99 \n%\n2.76 \n%\n2.94 \n%\n2.84 \n%\nNet interest income\n$1,488 \n$1,369 \n$4,316 \n$4,221 \nFTE adjustment\n4 \n4 \n12 \n13 \nNet interest income on an FTE basis (non-GAAP)\n(2)\n$1,492 \n$1,373 \n$4,328 \n$4,234 \nNet interest income on an FTE basis (annualized) (non-GAAP)\n(2)\n5,919 \n5,465 \n5,787 \n5,656 \nNet interest margin on an FTE basis (non-GAAP)\n(2)(3)\n3.00 \n%\n2.77 \n%\n2.95 \n%\n2.85 \n%\n(1) \nRepresents the most directly comparable GAAP financial measure to net interest margin on an FTE basis and is calculated based on annualized net interest income divided by average interest-earnings assets.\n(2) \nFTE basis financial measures and ratios are adjusted for the tax-exempt status of income from certain assets held by the Company using the federal statutory tax rate of 21% and are considered non-GAAP financial measures. We believe this allows management to better assess the comparability of revenue from both taxable and tax-exempt sources.\n(3) \nCalculated based on annualized net interest income on an FTE basis divided by average interest-earnings assets.\nCitizens Financial Group, Inc. | 36\nITEM 1. FINANCIAL STATEMENTS (UNAUDITED)\nPage\nConsolidated Balance Sheets\n38\nConsolidated Statements of Operations\n39\nConsolidated Statements of Comprehensive Income\n40\nConsolidated Statements of Changes in Stockholders’ Equity\n41\nConsolidated Statements of Cash Flows\n43\nNotes to Consolidated Financial Statements\n44\nNote 1 - Significant Accounting Policies\n44\nNote 2 - Securities\n44\nNote 3 - Loans and Leases\n47\nNote 4 - Credit Quality and the Allowance for Credit Losses\n47\nNote 5 - Mortgage Banking and Other Serviced Loans\n59\nNote 6 - Variable Interest Entities\n61\nNote 7 - Borrowed Funds\n63\nNote 8 - Derivatives\n64\nNote 9 - Accumulated Other Comprehensive Income (Loss)\n68\nNote 10 - Stockholders’ Equity\n69\nNote 11 - Commitments and Contingencies\n71\nNote 12 - Fair Value Measurements\n72\nNote 13 - Noninterest Income\n76\nNote 14 - Other Operating Expense\n77\nNote 15 - Earnings Per Share\n78\nNote 16 - Business Segments\n78\nCitizens Financial Group, Inc. | 37\nCONSOLIDATED BALANCE SHEETS (UNAUDITED)\n(dollars in millions, except par value)\nSeptember 30, 2025\nDecember 31, 2024\nASSETS:\nCash and due from banks\n$\n1,254\n \n$\n1,409\n \nInterest-bearing cash and due from banks\n10,396\n \n9,192\n \nInterest-bearing deposits in banks\n(1)\n694\n \n635\n \nDebt securities available for sale, at fair value (including $\n115\n and $\n152\n pledged to creditors, respectively)\n(2)\n35,419\n \n32,765\n \nDebt securities held to maturity (fair value of $\n7,295\n and $\n7,540\n, respectively, and including $\n68\n and $\n83\n pledged to creditors, respectively)\n(2)\n8,124\n \n8,599\n \nLoans held for sale (includes $\n768\n and $\n825\n, respectively, measured at fair value)\n1,334\n \n858\n \nLoans and leases\n140,870\n \n139,203\n \nLess: Allowance for loan and lease losses\n(\n1,972\n)\n(\n2,061\n)\nNet loans and leases\n(1)\n138,898\n \n137,142\n \nDerivative assets\n721\n \n408\n \nPremises and equipment, net\n857\n \n875\n \nBank-owned life insurance\n3,422\n \n3,364\n \nGoodwill\n8,187\n \n8,187\n \nOther intangible assets\n(3)\n123\n \n146\n \nOther assets\n(1)\n13,318\n \n13,941\n \nTOTAL ASSETS\n$\n222,747\n \n$\n217,521\n \nLIABILITIES AND STOCKHOLDERS’ EQUITY:\nLIABILITIES:\nDeposits:\nNoninterest-bearing\n$\n39,472\n \n$\n36,920\n \nInterest-bearing\n140,539\n \n137,856\n \n          Total deposits\n180,011\n \n174,776\n \nShort-term borrowed funds\n214\n \n—\n \nLong-term borrowed funds\n(1)\n10,441\n \n12,401\n \nDerivative liabilities\n738\n \n1,220\n \nOther liabilities\n(1)\n5,514\n \n4,870\n \nTOTAL LIABILITIES\n196,918\n \n193,267\n \nCommitments and Contingencies (refer to Note 11)\nSTOCKHOLDERS’ EQUITY:\nPreferred stock:\n$\n25.00\n par value,\n100,000,000\n shares authorized; \n2,150,000\n shares issued and outstanding at September 30, 2025 and December 31, 2024\n2,111\n \n2,113\n \nCommon stock:\n$\n0.01\n par value, \n1,000,000,000\n shares authorized; \n652,107,285\n shares issued and \n431,453,142\n shares outstanding at September 30, 2025 and \n650,068,324\n shares issued and \n440,543,381\n shares outstanding at December 31, 2024\n7\n \n7\n \nAdditional paid-in capital\n22,448\n \n22,364\n \nRetained earnings\n11,056\n \n10,412\n \nTreasury stock, at cost, \n220,654,143\n and \n209,524,943\n shares at September 30, 2025 and December 31, 2024, respectively\n(\n7,526\n)\n(\n7,047\n)\nAccumulated other comprehensive income (loss)\n(\n2,267\n)\n(\n3,595\n)\nTOTAL STOCKHOLDERS’ EQUITY\n25,829\n \n24,254\n \nTOTAL LIABILITIES AND STOCKHOLDERS’ EQUITY\n$\n222,747\n \n$\n217,521\n \n(1)\n \nIncludes amounts in consolidated VIEs. See Note 6 for additional information.\n(2)\n \nIncludes only collateral pledged by the Company where counterparties have the right to sell or pledge the collateral.\n(3)\n \nExcludes MSRs, which are reported in Other assets.\nThe accompanying Notes to Consolidated Financial Statements are an integral part of these statements.\nCitizens Financial Group, Inc. | 38\nCONSOLIDATED STATEMENTS OF OPERATIONS (UNAUDITED)\nThree Months Ended September 30,\nNine Months Ended September 30,\n (dollars in millions, except per share data)\n2025\n2024\n2025\n2024\nINTEREST INCOME:\nInterest and fees on loans and leases\n$\n1,897\n \n$\n1,976\n \n$\n5,577\n \n$\n6,038\n \nInterest and fees on loans held for sale\n31\n \n19\n \n83\n \n56\n \nInvestment securities \n433\n \n423\n \n1,279\n \n1,239\n \nInterest-bearing deposits in banks \n97\n \n121\n \n278\n \n391\n \nTotal interest income\n2,458\n \n2,539\n \n7,217\n \n7,724\n \nINTEREST EXPENSE:\nDeposits \n816\n \n990\n \n2,413\n \n2,942\n \nShort-term borrowed funds\n5\n \n3\n \n22\n \n14\n \nLong-term borrowed funds\n149\n \n177\n \n466\n \n547\n \nTotal interest expense\n970\n \n1,170\n \n2,901\n \n3,503\n \nNet interest income\n1,488\n \n1,369\n \n4,316\n \n4,221\n \nProvision (benefit) for credit losses\n154\n \n172\n \n471\n \n525\n \nNet interest income after provision (benefit) for credit losses\n1,334\n \n1,197\n \n3,845\n \n3,696\n \nNONINTEREST INCOME:\nService charges and fees\n112\n \n109\n \n332\n \n311\n \nCapital markets fees\n166\n \n94\n \n371\n \n346\n \nCard fees\n87\n \n93\n \n260\n \n271\n \nWealth fees\n93\n \n76\n \n262\n \n219\n \nMortgage banking fees\n49\n \n46\n \n181\n \n149\n \nForeign exchange and derivative products\n42\n \n36\n \n122\n \n111\n \nLetter of credit and loan fees\n48\n \n45\n \n137\n \n130\n \nSecurities gains, net\n2\n \n9\n \n14\n \n14\n \nOther income\n31\n \n24\n \n95\n \n51\n \nTotal noninterest income\n630\n \n532\n \n1,774\n \n1,602\n \nNONINTEREST EXPENSE:\nSalaries and employee benefits\n705\n \n647\n \n2,082\n \n1,983\n \nEquipment and software\n197\n \n194\n \n584\n \n576\n \nOutside services\n161\n \n146\n \n485\n \n469\n \nOccupancy\n106\n \n108\n \n326\n \n335\n \nOther operating expense\n166\n \n164\n \n491\n \n555\n \nTotal noninterest expense\n1,335\n \n1,259\n \n3,968\n \n3,918\n \nIncome before income tax expense \n629\n \n470\n \n1,651\n \n1,380\n \nIncome tax expense\n135\n \n88\n \n348\n \n272\n \nNET INCOME\n$\n494\n \n$\n382\n \n$\n1,303\n \n$\n1,108\n \nNet income available to common stockholders\n$\n457\n \n$\n344\n \n$\n1,199\n \n$\n1,005\n \nWeighted-average common shares outstanding:\nBasic\n431,365,552\n \n446,561,996\n \n434,416,696\n \n453,993,833\n \nDiluted\n435,472,350\n \n449,913,467\n \n437,915,596\n \n456,461,330\n \nPer common share information:\nBasic earnings \n$\n1.06\n \n$\n0.77\n \n$\n2.76\n \n$\n2.21\n \nDiluted earnings \n1.05\n \n0.77\n \n2.74\n \n2.20\n \nThe accompanying Notes to Consolidated Financial Statements are an integral part of these statements.\nCitizens Financial Group, Inc. | 39\nCONSOLIDATED STATEMENTS OF COMPREHENSIVE INCOME (UNAUDITED)\nThree Months Ended September 30,\nNine Months Ended September 30,\n(dollars in millions)\n2025\n2024\n2025\n2024\nNet income\n$\n494\n \n$\n382\n \n$\n1,303\n \n$\n1,108\n \nOther comprehensive income (loss), net of tax:\nCash flow hedges:\nNet unrealized gains (losses) arising during the period\n(\n16\n)\n450\n \n275\n \n(\n84\n)\nReclassification of net (gains) losses to earnings\n144\n \n203\n \n437\n \n522\n \nInvestment securities:\nNet unrealized gains (losses) on AFS securities arising during the period\n223\n \n541\n \n561\n \n339\n \nReclassification of net (gains) losses to earnings\n18\n \n13\n \n48\n \n42\n \nDefined benefit plans:\nNet actuarial gain (loss) arising during the period\n—\n \n—\n \n—\n \n4\n \nAmortization of actuarial (gain) loss to earnings\n3\n \n2\n \n7\n \n9\n \nTotal other comprehensive income (loss), net of tax\n372\n \n1,209\n \n1,328\n \n832\n \nTotal comprehensive income (loss)\n$\n866\n \n$\n1,591\n \n$\n2,631\n \n$\n1,940\n \nThe accompanying Notes to Consolidated Financial Statements are an integral part of these statements.\nCitizens Financial Group, Inc. | 40\nCONSOLIDATED STATEMENTS OF CHANGES IN STOCKHOLDERS’ EQUITY (UNAUDITED)\nPreferred\n Stock\nCommon\n Stock\nAdditional Paid-in Capital\nRetained Earnings\nTreasury Stock, at Cost\nAccumulated Other Comprehensive Income (Loss)\nTotal\n(dollars and shares in millions)\nShares\nAmount\nShares\nAmount\nBalance at July 1, 2024\n2\n \n$\n2,112\n \n453\n \n$\n6\n \n$\n22,299\n \n$\n10,079\n \n($\n6,492\n)\n($\n4,135\n)\n$\n23,869\n \nDividends declared - common stock\n— \n— \n— \n— \n— \n(\n190\n)\n— \n— \n(\n190\n)\nDividends declared - preferred stock\n— \n— \n— \n— \n— \n(\n38\n)\n— \n— \n(\n38\n)\nTreasury stock purchased\n— \n— \n(\n8\n)\n— \n— \n— \n(\n325\n)\n— \n(\n325\n)\nShare repurchase excise tax\n— \n— \n— \n— \n— \n— \n(\n3\n)\n— \n(\n3\n)\nShare-based compensation plans\n— \n— \n— \n— \n21\n \n— \n— \n— \n21\n \nEmployee stock purchase plan\n— \n— \n— \n— \n7\n \n— \n— \n— \n7\n \nTotal comprehensive income (loss):\nNet income\n— \n— \n— \n— \n— \n382\n \n— \n— \n382\n \nOther comprehensive income (loss)\n— \n— \n— \n— \n— \n— \n— \n1,209\n \n1,209\n \nTotal comprehensive income (loss)\n— \n— \n— \n— \n— \n382\n \n— \n1,209\n \n1,591\n \nBalance at September 30, 2024\n2\n \n$\n2,112\n \n445\n \n$\n6\n \n$\n22,327\n \n$\n10,233\n \n($\n6,820\n)\n($\n2,926\n)\n$\n24,932\n \nBalance at July 1, 2025\n2\n \n$\n2,113\n \n433\n \n$\n7\n \n$\n22,420\n \n$\n10,783\n \n($\n7,450\n)\n($\n2,639\n)\n$\n25,234\n \nDividends declared - common stock\n— \n— \n— \n— \n— \n(\n184\n)\n— \n— \n(\n184\n)\nDividends declared - preferred stock\n— \n— \n— \n— \n— \n(\n32\n)\n— \n— \n(\n32\n)\nPreferred stock issued\n— \n393\n \n— \n— \n— \n— \n— \n— \n393\n \nPreferred stock redemption\n— \n(\n395\n)\n— \n— \n— \n(\n5\n)\n— \n— \n(\n400\n)\nTreasury stock purchased\n— \n— \n(\n2\n)\n— \n— \n— \n(\n75\n)\n— \n(\n75\n)\nShare repurchase excise tax\n— \n— \n— \n— \n— \n— \n(\n1\n)\n— \n(\n1\n)\nShare-based compensation plans\n— \n— \n— \n— \n21\n \n— \n— \n— \n21\n \nEmployee stock purchase plan \n— \n— \n— \n— \n7\n \n— \n— \n— \n7\n \nTotal comprehensive income (loss):\nNet income\n— \n— \n— \n— \n— \n494\n \n— \n— \n494\n \nOther comprehensive income (loss)\n— \n— \n— \n— \n— \n— \n— \n372\n \n372\n \nTotal comprehensive income (loss)\n— \n— \n— \n— \n— \n494\n \n— \n372\n \n866\n \nBalance at September 30, 2025\n2\n \n$\n2,111\n \n431\n \n$\n7\n \n$\n22,448\n \n$\n11,056\n \n($\n7,526\n)\n($\n2,267\n)\n$\n25,829\n \nThe accompanying Notes to Consolidated Financial Statements are an integral part of these statements.\nCitizens Financial Group, Inc. | 41\nCONSOLIDATED STATEMENTS OF CHANGES IN STOCKHOLDERS’ EQUITY (UNAUDITED)\nPreferred\n Stock\nCommon\n Stock\nAdditional Paid-in Capital\nRetained Earnings\nTreasury Stock, at Cost\nAccumulated Other Comprehensive Income (Loss)\nTotal\n(dollars and shares in millions)\nShares\nAmount\nShares\nAmount\nBalance at January 1, 2024\n2\n \n$\n2,014\n \n466\n \n$\n6\n \n$\n22,250\n \n$\n9,816\n \n($\n5,986\n)\n($\n3,758\n)\n$\n24,342\n \nDividends declared - common stock\n— \n— \n— \n— \n— \n(\n581\n)\n— \n— \n(\n581\n)\nDividends declared - preferred stock\n— \n— \n— \n— \n— \n(\n103\n)\n— \n— \n(\n103\n)\nPreferred stock issued\n— \n391\n \n— \n— \n— \n— \n— \n— \n391\n \nPreferred stock redemption\n— \n(\n293\n)\n— \n— \n— \n(\n7\n)\n— \n— \n(\n300\n)\nTreasury stock purchased\n— \n— \n(\n23\n)\n— \n— \n— \n(\n825\n)\n— \n(\n825\n)\nShare repurchase excise tax\n— \n— \n— \n— \n— \n— \n(\n9\n)\n— \n(\n9\n)\nShare-based compensation plans\n— \n— \n2\n \n— \n57\n \n— \n— \n— \n57\n \nEmployee stock purchase plan\n— \n— \n— \n— \n20\n \n— \n— \n— \n20\n \nTotal comprehensive income (loss):\nNet income\n— \n— \n— \n— \n— \n1,108\n \n— \n— \n1,108\n \nOther comprehensive income (loss)\n— \n— \n— \n— \n— \n— \n— \n832\n \n832\n \nTotal comprehensive income (loss)\n— \n— \n— \n— \n— \n1,108\n \n— \n832\n \n1,940\n \nBalance at September 30, 2024\n2\n \n$\n2,112\n \n445\n \n$\n6\n \n$\n22,327\n \n$\n10,233\n \n($\n6,820\n)\n($\n2,926\n)\n$\n24,932\n \nBalance at January 1, 2025\n2\n \n$\n2,113\n \n441\n \n$\n7\n \n$\n22,364\n \n$\n10,412\n \n($\n7,047\n)\n($\n3,595\n)\n$\n24,254\n \nDividends declared - common stock\n— \n— \n— \n— \n— \n(\n555\n)\n— \n— \n(\n555\n)\nDividends declared - preferred stock\n— \n— \n— \n— \n— \n(\n99\n)\n— \n— \n(\n99\n)\nPreferred stock issued\n— \n393\n \n— \n— \n— \n— \n— \n— \n393\n \nPreferred stock redemption\n— \n(\n395\n)\n— \n— \n— \n(\n5\n)\n— \n— \n(\n400\n)\nTreasury stock purchased\n— \n— \n(\n12\n)\n— \n— \n— \n(\n475\n)\n— \n(\n475\n)\nShare repurchase excise tax\n— \n— \n— \n— \n— \n— \n(\n4\n)\n— \n(\n4\n)\nShare-based compensation plans\n— \n— \n2\n \n— \n62\n \n— \n— \n— \n62\n \nEmployee stock purchase plan \n— \n— \n— \n— \n22\n \n— \n— \n— \n22\n \nTotal comprehensive income (loss):\nNet income\n— \n— \n— \n— \n— \n1,303\n \n— \n— \n1,303\n \nOther comprehensive income (loss)\n— \n— \n— \n— \n— \n— \n— \n1,328\n \n1,328\n \nTotal comprehensive income (loss)\n— \n— \n— \n— \n— \n1,303\n \n— \n1,328\n \n2,631\n \nBalance at September 30, 2025\n2\n \n$\n2,111\n \n431\n \n$\n7\n \n$\n22,448\n \n$\n11,056\n \n($\n7,526\n)\n($\n2,267\n)\n$\n25,829\n \nThe accompanying Notes to Consolidated Financial Statements are an integral part of these statements.\nCitizens Financial Group, Inc. | 42\nCONSOLIDATED STATEMENTS OF CASH FLOWS (UNAUDITED)\nNine Months Ended September 30,\n(dollars in millions)\n2025\n2024\nOPERATING ACTIVITIES\nNet income\n$\n1,303\n \n$\n1,108\n \nAdjustments to reconcile net income to net change due to operating activities:\nProvision (benefit) for credit losses\n471\n \n525\n \nNet change in Loans held for sale\n(\n81\n)\n62\n \nDepreciation, amortization, and accretion\n366\n \n374\n \nDeferred income tax expense (benefit)\n(\n93\n)\n(\n50\n)\nShare-based compensation\n97\n \n76\n \nNet gain on sale of assets\n(\n16\n)\n(\n14\n)\nNet (increase) decrease in Other assets\n357\n \n(\n14\n)\nNet increase (decrease) in Other liabilities\n(\n35\n)\n(\n549\n)\nNet change due to operating activities\n2,369\n \n1,518\n \nINVESTING ACTIVITIES\nInvestment securities:\nPurchases of debt securities available for sale\n(\n5,545\n)\n(\n6,497\n)\nProceeds from maturities and paydowns of debt securities available for sale\n2,770\n \n2,112\n \nProceeds from sales of debt securities available for sale\n1,218\n \n2,080\n \nProceeds from maturities and paydowns of debt securities held to maturity\n537\n \n501\n \nNet (increase) decrease in Interest-bearing deposits in banks\n(\n59\n)\n(\n243\n)\nPurchases of loans\n(\n642\n)\n(\n517\n)\nSales of loans\n1,428\n \n186\n \nNet (increase) decrease in Loans and leases\n(\n3,475\n)\n3,860\n \nCapital expenditures, net\n(\n82\n)\n(\n74\n)\nOther\n(\n183\n)\n(\n29\n)\nNet change due to investing activities\n(\n4,033\n)\n1,379\n \nFINANCING ACTIVITIES\nNet increase (decrease) in Deposits\n5,235\n \n(\n2,154\n)\nNet increase (decrease) in Short-term borrowed funds\n214\n \n(\n490\n)\nProceeds from issuance of long-term borrowed funds\n6,534\n \n13,185\n \nRepayments of long-term borrowed funds\n(\n8,520\n)\n(\n12,741\n)\nTreasury stock purchased\n(\n475\n)\n(\n825\n)\nNet proceeds from issuance of preferred stock\n393\n \n391\n \nRedemption of preferred stock\n—\n \n(\n300\n)\nDividends paid to common stockholders\n(\n555\n)\n(\n581\n)\nDividends paid to preferred stockholders\n(\n100\n)\n(\n96\n)\nOther\n(\n13\n)\n1\n \nNet change due to financing activities\n2,713\n \n(\n3,610\n)\nNet change in cash and cash equivalents\n(1)\n1,049\n \n(\n713\n)\nCash and cash equivalents at beginning of period\n(1)\n10,601\n \n11,628\n \nCash and cash equivalents at end of period\n(1)\n$\n11,650\n \n$\n10,915\n \nNon-cash items:\nTransfer of loans from loans held for investment to LHFS\n$\n1,939\n \n$\n249\n \nLoans securitized and transferred to AFS securities\n87\n \n181\n \n(1)\n \nCash and cash equivalents include Cash and due from banks and Interest-bearing cash and due from banks as reflected on the Consolidated Balance Sheets.\n \nThe accompanying Notes to Consolidated Financial Statements are an integral part of these statements.\nCitizens Financial Group, Inc. | 43\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (UNAUDITED)\nNOTE 1 - SIGNIFICANT ACCOUNTING POLICIES \nBasis of Presentation\nThe accompanying unaudited interim Consolidated Financial Statements and Notes have been prepared in accordance with the instructions for Form 10-Q and, therefore, certain information and footnote disclosures required for annual financial statements prepared in accordance with GAAP are omitted. In the opinion of management, the Consolidated Financial Statements include all adjustments, consisting of normal recurring adjustments, necessary to fairly present the Company’s interim period results. These unaudited interim financial statements and notes should be read in conjunction with the audited Consolidated Financial Statements and Notes included in the Company’s 2024 Form 10-K. The results of operations for interim periods are not necessarily indicative of the results that may be expected for the full year.\nThe unaudited interim Consolidated Financial Statements include the accounts of the Parent Company and its consolidated subsidiaries, including VIEs in which the Company is a primary beneficiary. \nInvestments in VIEs in which the Company does not have the ability to exercise significant influence are not consolidated. \nAll intercompany transactions and balances have been eliminated in consolidation.\nUse of Estimates\nThe preparation of financial statements in conformity with GAAP requires management to make estimates and assumptions that affect the amounts reported in the financial statements and accompanying notes. Actual results could differ from those estimates. Material estimates that are particularly susceptible to significant change include the determination of the ACL, fair value measurements, and the evaluation and measurement of goodwill impairment.\n \nSignificant Accounting Policies\nFor further information regarding the Company’s significant accounting policies, see Note 1 in the Company’s 2024 Form 10-K.\nNOTE 2 - SECURITIES \nThe following table presents the major components of securities at amortized cost and fair value:\nSeptember 30, 2025\nDecember 31, 2024\n(dollars in millions)\nAmortized Cost\n(1)\nGross Unrealized Gains\nGross Unrealized Losses\nFair Value\nAmortized Cost\n(1)\nGross Unrealized Gains\nGross Unrealized Losses\nFair Value\nU.S. Treasury and other\n$\n4,563\n \n$\n23\n \n($\n72\n)\n$\n4,514\n \n$\n3,631\n \n$\n3\n \n($\n109\n)\n$\n3,525\n \nState and political subdivisions\n1\n \n—\n \n—\n \n1\n \n1\n \n—\n \n—\n \n1\n \nMortgage-backed securities:\nFederal agencies and U.S. government sponsored entities\n31,865\n \n160\n \n(\n1,474\n)\n30,551\n \n30,897\n \n33\n \n(\n2,135\n)\n28,795\n \nOther/non-agency\n268\n \n—\n \n(\n5\n)\n263\n \n273\n \n—\n \n(\n13\n)\n260\n \nTotal mortgage-backed securities\n32,133\n \n160\n \n(\n1,479\n)\n30,814\n \n31,170\n \n33\n \n(\n2,148\n)\n29,055\n \nCollateralized loan obligations\n90\n \n—\n \n—\n \n90\n \n184\n \n—\n \n—\n \n184\n \nTotal debt securities available for sale, at fair value\n$\n36,787\n \n$\n183\n \n($\n1,551\n)\n$\n35,419\n \n$\n34,986\n \n$\n36\n \n($\n2,257\n)\n$\n32,765\n \nMortgage-backed securities:\nFederal agencies and U.S. government sponsored entities\n$\n7,767\n \n$\n1\n \n($\n830\n)\n$\n6,938\n \n$\n8,187\n \n$\n—\n \n($\n1,051\n)\n$\n7,136\n \nTotal mortgage-backed securities\n7,767\n \n1\n \n(\n830\n)\n6,938\n \n8,187\n \n—\n \n(\n1,051\n)\n7,136\n \nAsset-backed securities\n357\n \n—\n \n—\n \n357\n \n412\n \n1\n \n(\n9\n)\n404\n \nTotal debt securities held to maturity\n$\n8,124\n \n$\n1\n \n($\n830\n)\n$\n7,295\n \n$\n8,599\n \n$\n1\n \n($\n1,060\n)\n$\n7,540\n \nEquity securities, at cost\n(2)\n$\n710\n \n$— \n$— \n$\n710\n \n$\n710\n \n$— \n$— \n$\n710\n \nEquity securities, at fair value\n(2)\n286\n \n— \n— \n286\n \n220\n \n— \n— \n220\n \n(1)\n Excludes portfolio level basis adjustments of $\n37\n million and $(\n75\n) million, respectively, for securities designated in active fair value hedge relationships under the portfolio layer method at September 30, 2025 and December 31, 2024.\n(2)\n Included in Other assets in the Consolidated Balance Sheets.\nCitizens Financial Group, Inc. | 44\nAccrued interest receivable on debt securities totaled $\n135\n million and $\n125\n million as of September 30, 2025 and December 31, 2024, respectively, and is included in Other assets in the Consolidated Balance Sheets. \nThe following table presents the amortized cost and fair value of debt securities by contractual maturity as of September 30, 2025. Expected maturities may differ from contractual maturities because issuers may have the right to call or prepay obligations with or without incurring penalties.\nDistribution of Maturities\n(dollars in millions)\n1 Year                or Less\nAfter 1 Year through 5 Years\nAfter 5 Years through 10 Years\nAfter 10       Years\nTotal\nAmortized cost:\nU.S. Treasury and other\n$\n—\n \n$\n3,380\n \n$\n1,183\n \n$\n—\n \n$\n4,563\n \nState and political subdivisions\n—\n \n—\n \n—\n \n1\n \n1\n \nMortgage-backed securities:\nFederal agencies and U.S. government sponsored entities\n100\n \n2,274\n \n1,120\n \n28,371\n \n31,865\n \nOther/non-agency\n—\n \n—\n \n—\n \n268\n \n268\n \nCollateralized loan obligations\n—\n \n—\n \n90\n \n—\n \n90\n \nTotal debt securities available for sale\n100\n \n5,654\n \n2,393\n \n28,640\n \n36,787\n \nMortgage-backed securities:\nFederal agencies and U.S. government sponsored entities\n—\n \n—\n \n—\n \n7,767\n \n7,767\n \nAsset-backed securities\n—\n \n357\n \n—\n \n—\n \n357\n \nTotal debt securities held to maturity\n—\n \n357\n \n—\n \n7,767\n \n8,124\n \nTotal amortized cost of debt securities\n$\n100\n \n$\n6,011\n \n$\n2,393\n \n$\n36,407\n \n$\n44,911\n \nFair value:\nU.S. Treasury and other\n$\n—\n \n$\n3,311\n \n$\n1,203\n \n$\n—\n \n$\n4,514\n \nState and political subdivisions\n—\n \n—\n \n—\n \n1\n \n1\n \nMortgage-backed securities:\nFederal agencies and U.S. government sponsored entities\n99\n \n2,235\n \n1,073\n \n27,144\n \n30,551\n \nOther/non-agency\n—\n \n—\n \n—\n \n263\n \n263\n \nCollateralized loan obligations\n—\n \n—\n \n90\n \n—\n \n90\n \nTotal debt securities available for sale\n99\n \n5,546\n \n2,366\n \n27,408\n \n35,419\n \nMortgage-backed securities:\nFederal agencies and U.S. government sponsored entities\n—\n \n—\n \n—\n \n6,938\n \n6,938\n \nAsset-backed securities\n—\n \n357\n \n—\n \n—\n \n357\n \nTotal debt securities held to maturity\n—\n \n357\n \n—\n \n6,938\n \n7,295\n \nTotal fair value of debt securities\n$\n99\n \n$\n5,903\n \n$\n2,366\n \n$\n34,346\n \n$\n42,714\n \nTaxable interest income from investment securities as presented in the Consolidated Statements of Operations was $\n433\n million and $\n423\n million for the three months ended September 30, 2025 and 2024, respectively, and $\n1.3\n billion and $\n1.2\n billion for the nine months ended September 30, 2025 and 2024, respectively.\nThe following table presents realized gains and losses on the sale of securities:\nThree Months Ended September 30,\nNine Months Ended September 30,\n(dollars in millions)\n2025\n2024\n2025\n2024\nGains\n$\n2\n \n$\n9\n \n$\n14\n \n$\n14\n \nLosses\n—\n \n—\n \n—\n \n—\n \nSecurities gains, net\n$\n2\n \n$\n9\n \n$\n14\n \n$\n14\n \nAt September 30, 2025 and December 31, 2024, debt securities with a carrying value of $\n3.6\n billion and $\n4.0\n billion, respectively, were pledged to secure public deposits, trust funds, FHLB borrowing capacity, repurchase agreements, and derivative contracts, and for other purposes as required or permitted by law.\nRetained interests from the sale and securitization of originated mortgage loans totaled $\n87\n million during the three and nine months ended September 30, 2025. Retained interests from the sale and securitization of originated mortgage loans totaled $\n48\n million and $\n181\n million, respectively, during the three and nine months ended September 30, 2024. The debt securities received from the issuers, FNMA and FHLMC, include a substantive guarantee and are classified as Debt securities available for sale in the Consolidated Balance Sheets.\nCitizens Financial Group, Inc. | 45\nImpairment\nThe Company evaluated its existing HTM portfolio as of September 30, 2025 and concluded that \n96\n% of HTM securities met the zero expected credit loss criteria and, therefore, \nno\n ACL was recognized. Lifetime expected credit losses on the remainder of the HTM portfolio were determined to be insignificant based on the modeling of the Company’s credit loss position in the securities. The Company monitors the credit exposure through the use of credit quality indicators. For these securities, the Company uses external credit ratings or an internally derived credit rating when an external rating is not available. All securities were determined to be investment grade at September 30, 2025.\nThe following tables present AFS debt securities with fair values below their respective carrying values, disclosed by the length of time the individual securities have been in a continuous unrealized loss position:\nSeptember 30, 2025\nLess than 12 Months\n12 Months or Longer\nTotal\n(dollars in millions)\nFair Value\nGross Unrealized Losses\nFair Value\nGross Unrealized Losses\nFair Value\nGross Unrealized Losses\nU.S. Treasury and other\n$\n—\n \n$\n—\n \n$\n2,613\n \n($\n72\n)\n$\n2,613\n \n($\n72\n)\nMortgage-backed securities:\nFederal agencies and U.S. government sponsored entities\n4,760\n \n(\n171\n)\n13,230\n \n(\n1,303\n)\n17,990\n \n(\n1,474\n)\nOther/non-agency\n—\n \n—\n \n263\n \n(\n5\n)\n263\n \n(\n5\n)\nTotal mortgage-backed securities\n4,760\n \n(\n171\n)\n13,493\n \n(\n1,308\n)\n18,253\n \n(\n1,479\n)\nTotal\n$\n4,760\n \n($\n171\n)\n$\n16,106\n \n($\n1,380\n)\n$\n20,866\n \n($\n1,551\n)\nDecember 31, 2024\nLess than 12 Months\n12 Months or Longer\nTotal\n(dollars in millions)\nFair Value\nGross Unrealized Losses\nFair Value\nGross Unrealized Losses\nFair Value\nGross Unrealized Losses\nU.S. Treasury and other\n$\n—\n \n$\n—\n \n$\n2,544\n \n($\n109\n)\n$\n2,544\n \n($\n109\n)\nMortgage-backed securities:\nFederal agencies and U.S. government sponsored entities\n9,560\n \n(\n265\n)\n14,304\n \n(\n1,870\n)\n23,864\n \n(\n2,135\n)\nOther/non-agency\n—\n \n—\n \n260\n \n(\n13\n)\n260\n \n(\n13\n)\nTotal mortgage-backed securities\n9,560\n \n(\n265\n)\n14,564\n \n(\n1,883\n)\n24,124\n \n(\n2,148\n)\nTotal\n$\n9,560\n \n($\n265\n)\n$\n17,108\n \n($\n1,992\n)\n$\n26,668\n \n($\n2,257\n)\nThe Company does not currently have the intent to sell these AFS debt securities, and it is not more likely than not that the Company will be required to sell them prior to recovery of their amortized cost bases. The Company determined that credit losses are not expected to be incurred on the AFS debt securities identified with unrealized losses as of September 30, 2025. The unrealized losses on these AFS debt securities reflect non-credit-related factors driven by changes in interest rates. Therefore, the Company determined that these AFS debt securities are not impaired.\n \nCitizens Financial Group, Inc. | 46\nNOTE 3 - LOANS AND LEASES \nLoans held for investment are reported at the amount of their outstanding principal, net of charge-offs, unearned income, deferred loan origination fees and costs, and unamortized premiums or discounts on purchased loans. \nThe following table presents loans and leases, excluding LHFS:\n(dollars in millions)\nSeptember 30, 2025\nDecember 31, 2024\nCommercial and industrial\n$\n46,953\n \n$\n42,551\n \nCommercial real estate\n25,540\n \n27,225\n \nTotal commercial\n72,493\n \n69,776\n \nResidential mortgages\n34,477\n \n32,726\n \nHome equity\n18,415\n \n16,495\n \nAutomobile\n2,816\n \n4,744\n \nEducation\n8,556\n \n10,812\n \nOther retail\n4,113\n \n4,650\n \nTotal retail\n68,377\n \n69,427\n \nTotal loans and leases\n$\n140,870\n \n$\n139,203\n \nAccrued interest receivable on loans and leases held for investment totaled $\n857\n million and $\n816\n million as of September 30, 2025 and December 31, 2024, respectively, and is included in Other assets in the Consolidated Balance Sheets.\nLoans pledged as collateral for FHLB borrowing capacity, primarily residential mortgages and home equity products, totaled $\n40.6\n billion and $\n37.5\n billion at September 30, 2025 and December 31, 2024, respectively. Loans pledged as collateral to support the contingent ability to borrow at the FRB discount window, if necessary, were primarily comprised of education, commercial and industrial, and commercial real estate loans, and totaled $\n20.0\n billion and $\n22.9\n billion at September 30, 2025 and December 31, 2024, respectively.\nInterest income on direct financing and sales-type leases for the three months ended September 30, 2025 and 2024 was $\n11\n million and is reported within Interest and fees on loans and leases in the Consolidated Statements of Operations. For the nine months ended September 30, 2025 and 2024, this interest income was $\n33\n million and $\n31\n million, respectively.\nThe following table presents the composition of LHFS:\nSeptember 30, 2025\nDecember 31, 2024\n(dollars in millions)\nResidential Mortgages\n(1)\nOther retail\n(2)\nCommercial\n(3)\nTotal\nResidential Mortgages\n(1)\nCommercial\n(3)\nTotal\nLoans held for sale at fair value\n$\n592\n \n$\n—\n \n$\n176\n \n$\n768\n \n$\n633\n \n$\n192\n \n$\n825\n \nOther loans held for sale\n—\n \n466\n \n100\n \n566\n \n—\n \n33\n \n33\n \nTotal loans held for sale\n$\n592\n \n$\n466\n \n$\n276\n \n$\n1,334\n \n$\n633\n \n$\n225\n \n$\n858\n \n(1)\n Residential mortgage LHFS at fair value are originated for sale.\n(2)\n Other retail LHFS consist of education loans.\n(3) \nCommercial LHFS at fair value consist of loans managed by the Company’s commercial secondary loan desk.\n Other commercial LHFS primarily consist of loans associated with the Company’s syndication business.\nNOTE 4 - CREDIT QUALITY AND THE ALLOWANCE FOR CREDIT LOSSES \nAllowance for Credit Losses\n    \nThe Company’s estimate of expected credit losses in its loan and lease portfolios is recorded in the ACL and considers extensive historical loss experience, including the impact of loss mitigation and restructuring programs that the Company offers to borrowers experiencing financial difficulty, as well as projected loss severity as a result of loan default. \nFor a detailed discussion of the ACL reserve methodology and estimation techniques as of December 31, 2024, see Note 6 in the Company’s 2024 Form 10-K. There were no significant changes to the ACL reserve methodology during the nine months ended September 30, 2025.\nCitizens Financial Group, Inc. | 47\nThe following table presents a summary of changes in the ACL for the three and nine months ended September 30, 2025:\nThree Months Ended September 30, 2025\nNine Months Ended September 30, 2025\n(dollars in millions)\nCommercial\nRetail\nTotal\nCommercial\nRetail\nTotal\nAllowance for loan and lease losses, beginning of period\n$\n1,106\n \n$\n902\n \n$\n2,008\n \n$\n1,140\n \n$\n921\n \n$\n2,061\n \nCharge-offs\n(\n91\n)\n(\n104\n)\n(\n195\n)\n(\n269\n)\n(\n361\n)\n(\n630\n)\nRecoveries\n6\n \n27\n \n33\n \n11\n \n90\n \n101\n \nNet charge-offs\n(\n85\n)\n(\n77\n)\n(\n162\n)\n(\n258\n)\n(\n271\n)\n(\n529\n)\nProvision expense (benefit) for loans and leases\n62\n \n64\n \n126\n \n201\n \n239\n \n440\n \nAllowance for loan and lease losses, end of period\n1,083\n \n889\n \n1,972\n \n1,083\n \n889\n \n1,972\n \nAllowance for unfunded lending commitments, beginning of period\n163\n \n38\n \n201\n \n155\n \n43\n \n198\n \nProvision expense (benefit) for unfunded lending commitments\n19\n \n9\n \n28\n \n27\n \n4\n \n31\n \nAllowance for unfunded lending commitments, end of period\n182\n \n47\n \n229\n \n182\n \n47\n \n229\n \nTotal allowance for credit losses, end of period\n$\n1,265\n \n$\n936\n \n$\n2,201\n \n$\n1,265\n \n$\n936\n \n$\n2,201\n \nDuring the nine months ended September 30, 2025, net charge-offs of $\n529\n million and a provision for expected credit losses of $\n471\n million resulted in a decrease of $\n58\n million to the ACL.\nDuring the first quarter of 2025, the Company entered into an agreement to sell $\n1.9\n billion of Non-Core education loans and subsequently reclassified these loans to LHFS. Upon reclassification to LHFS, a $\n25\n million charge-off was recognized. This transaction will settle ratably each quarter throughout 2025, of which approximately $\n1.4\n billion has settled to date, with the remaining $\n500\n million scheduled to settle during the fourth quarter of 2025.\nAs of September 30, 2025, the Company’s ACL economic forecast over a two-year reasonable and supportable period reflects the economy going into a shallow two quarter contraction inclusive of uncertainties related to the implementation of tariffs and protectionist trade policies, inflationary pressures, and geopolitical tensions. This forecast is generally applied to the retail and commercial and industrial portfolios and projects peak unemployment of approximately 5.2% and a start-to-trough real GDP decline of approximately 0.5%, compared to peak unemployment of approximately 5.1% and a start-to-trough real GDP decline of approximately 0.4% at December 31, 2024. More severe economic scenarios are applied within the CRE portfolio, such as general office, with peak unemployment of approximately 9.4% and a start-to-trough real GDP decline of approximately 4.4%, compared to peak unemployment of approximately 9.3% and a start-to-trough real GDP decline of approximately 4.4% at December 31, 2024.\nCitizens Financial Group, Inc. | 48\nThe following table presents a summary of changes in the ACL for the three and nine months ended September 30, 2024:\nThree Months Ended September 30, 2024\nNine Months Ended September 30, 2024\n(dollars in millions)\nCommercial\nRetail\nTotal\nCommercial\nRetail\nTotal\nAllowance for loan and lease losses, beginning of period\n$\n1,282\n \n$\n843\n \n$\n2,125\n \n$\n1,250\n \n$\n848\n \n$\n2,098\n \nCharge-offs\n(\n106\n)\n(\n125\n)\n(\n231\n)\n(\n308\n)\n(\n377\n)\n(\n685\n)\nRecoveries\n8\n \n31\n \n39\n \n29\n \n99\n \n128\n \nNet charge-offs\n(\n98\n)\n(\n94\n)\n(\n192\n)\n(\n279\n)\n(\n278\n)\n(\n557\n)\nProvision expense (benefit) for loans and leases\n3\n \n143\n \n146\n \n216\n \n322\n \n538\n \nAllowance for loan and lease losses, end of period\n1,187\n \n892\n \n2,079\n \n1,187\n \n892\n \n2,079\n \nAllowance for unfunded lending commitments, beginning of period\n147\n \n34\n \n181\n \n175\n \n45\n \n220\n \nProvision expense (benefit) for unfunded lending commitments\n17\n \n9\n \n26\n \n(\n11\n)\n(\n2\n)\n(\n13\n)\nAllowance for unfunded lending commitments, end of period\n164\n \n43\n \n207\n \n164\n \n43\n \n207\n \nTotal allowance for credit losses, end of period\n$\n1,351\n \n$\n935\n \n$\n2,286\n \n$\n1,351\n \n$\n935\n \n$\n2,286\n \nCredit Quality Indicators\nThe Company presents loan and lease portfolio segments and classes by credit quality indicator and vintage year and defines the vintage date for the purpose of this disclosure as the date of the most recent credit decision. Renewals are categorized as new credit decisions and reflect the renewal date as the vintage date, except for renewals of loans modified for borrowers experiencing financial difficulty, or FDMs, which are presented in the original vintage.\nThe Company utilizes internal risk ratings to monitor credit quality for commercial loans and leases. For more information on these ratings see Note 6 in the Company’s 2024 Form 10-K.\nThe following table presents the amortized cost basis of commercial loans and leases by vintage date and internal risk rating as of September 30, 2025:\nTerm Loans and Leases by Origination Year\nRevolving Loans\n(dollars in millions)\n2025\n2024\n2023\n2022\n2021\nPrior to 2021\nWithin the Revolving Period\nConverted to Term\nTotal\nCommercial and industrial\nPass\n$\n5,670\n \n$\n4,526\n \n$\n1,631\n \n$\n2,948\n \n$\n1,433\n \n$\n2,220\n \n$\n25,906\n \n$\n57\n \n$\n44,391\n \nSpecial Mention\n—\n \n9\n \n38\n \n122\n \n179\n \n117\n \n232\n \n—\n \n697\n \nSubstandard Accrual\n13\n \n12\n \n105\n \n143\n \n162\n \n271\n \n911\n \n18\n \n1,635\n \nNonaccrual\n—\n \n6\n \n15\n \n60\n \n23\n \n76\n \n45\n \n5\n \n230\n \nTotal commercial and industrial\n5,683\n \n4,553\n \n1,789\n \n3,273\n \n1,797\n \n2,684\n \n27,094\n \n80\n \n46,953\n \nCommercial real estate\nPass\n3,215\n \n2,079\n \n918\n \n4,484\n \n4,193\n \n5,180\n \n1,454\n \n4\n \n21,527\n \nSpecial Mention\n—\n \n2\n \n4\n \n716\n \n384\n \n154\n \n73\n \n—\n \n1,333\n \nSubstandard Accrual\n—\n \n—\n \n94\n \n576\n \n165\n \n1,006\n \n23\n \n113\n \n1,977\n \nNonaccrual\n—\n \n—\n \n3\n \n94\n \n58\n \n535\n \n9\n \n4\n \n703\n \nTotal commercial real estate\n3,215\n \n2,081\n \n1,019\n \n5,870\n \n4,800\n \n6,875\n \n1,559\n \n121\n \n25,540\n \nTotal commercial\nPass\n8,885\n \n6,605\n \n2,549\n \n7,432\n \n5,626\n \n7,400\n \n27,360\n \n61\n \n65,918\n \nSpecial Mention\n—\n \n11\n \n42\n \n838\n \n563\n \n271\n \n305\n \n—\n \n2,030\n \nSubstandard Accrual\n13\n \n12\n \n199\n \n719\n \n327\n \n1,277\n \n934\n \n131\n \n3,612\n \nNonaccrual\n—\n \n6\n \n18\n \n154\n \n81\n \n611\n \n54\n \n9\n \n933\n \nTotal commercial\n$\n8,898\n \n$\n6,634\n \n$\n2,808\n \n$\n9,143\n \n$\n6,597\n \n$\n9,559\n \n$\n28,653\n \n$\n201\n \n$\n72,493\n \nCitizens Financial Group, Inc. | 49\nThe following table presents the amortized cost basis of commercial loans and leases by vintage date and internal risk rating as of December 31, 2024:\nTerm Loans and Leases by Origination Year\nRevolving Loans\n(dollars in millions)\n2024\n2023\n2022\n2021\n2020\nPrior to 2020\nWithin the Revolving Period\nConverted to Term\nTotal\nCommercial and industrial\nPass\n$\n5,945\n \n$\n2,525\n \n$\n4,194\n \n$\n2,923\n \n$\n895\n \n$\n2,066\n \n$\n21,323\n \n$\n66\n \n$\n39,937\n \nSpecial Mention\n2\n \n79\n \n98\n \n236\n \n48\n \n48\n \n211\n \n—\n \n722\n \nSubstandard Accrual\n9\n \n64\n \n207\n \n269\n \n139\n \n253\n \n697\n \n13\n \n1,651\n \nNonaccrual\n—\n \n11\n \n68\n \n62\n \n5\n \n55\n \n34\n \n6\n \n241\n \nTotal commercial and industrial\n5,956\n \n2,679\n \n4,567\n \n3,490\n \n1,087\n \n2,422\n \n22,265\n \n85\n \n42,551\n \nCommercial real estate\nPass\n2,720\n \n1,305\n \n5,748\n \n5,412\n \n1,919\n \n4,199\n \n1,434\n \n4\n \n22,741\n \nSpecial Mention\n1\n \n—\n \n911\n \n362\n \n175\n \n257\n \n80\n \n6\n \n1,792\n \nSubstandard Accrual\n3\n \n22\n \n359\n \n253\n \n275\n \n875\n \n9\n \n120\n \n1,916\n \nNonaccrual\n—\n \n67\n \n89\n \n58\n \n90\n \n470\n \n2\n \n—\n \n776\n \nTotal commercial real estate\n2,724\n \n1,394\n \n7,107\n \n6,085\n \n2,459\n \n5,801\n \n1,525\n \n130\n \n27,225\n \nTotal commercial\nPass\n8,665\n \n3,830\n \n9,942\n \n8,335\n \n2,814\n \n6,265\n \n22,757\n \n70\n \n62,678\n \nSpecial Mention\n3\n \n79\n \n1,009\n \n598\n \n223\n \n305\n \n291\n \n6\n \n2,514\n \nSubstandard Accrual\n12\n \n86\n \n566\n \n522\n \n414\n \n1,128\n \n706\n \n133\n \n3,567\n \nNonaccrual\n—\n \n78\n \n157\n \n120\n \n95\n \n525\n \n36\n \n6\n \n1,017\n \nTotal commercial\n$\n8,680\n \n$\n4,073\n \n$\n11,674\n \n$\n9,575\n \n$\n3,546\n \n$\n8,223\n \n$\n23,790\n \n$\n215\n \n$\n69,776\n \nFor retail loans, the Company utilizes FICO credit scores and the loan’s payment and delinquency status to monitor credit quality. Management believes FICO scores are the strongest indicator of credit losses over the contractual life of the loan and assist management in predicting the borrower’s future payment performance. Scores are based on current and historical national industry-wide consumer level credit performance data.\n \nCitizens Financial Group, Inc. | 50\nThe following table presents the amortized cost basis of retail loans by vintage date and current FICO score as of September 30, 2025:\nTerm Loans by Origination Year\nRevolving Loans\n(dollars in millions)\n2025\n2024\n2023\n2022\n2021\nPrior to 2021\nWithin the Revolving Period\nConverted to Term\nTotal\nResidential mortgages\n800+\n$\n1,450\n \n$\n1,775\n \n$\n1,314\n \n$\n3,238\n \n$\n4,996\n \n$\n6,253\n \n$\n—\n \n$\n—\n \n$\n19,026\n \n740-799\n1,762\n \n1,056\n \n761\n \n1,486\n \n2,041\n \n2,888\n \n—\n \n—\n \n9,994\n \n680-739\n423\n \n346\n \n256\n \n501\n \n673\n \n1,141\n \n—\n \n—\n \n3,340\n \n620-679\n41\n \n62\n \n76\n \n161\n \n178\n \n504\n \n—\n \n—\n \n1,022\n \n<620\n6\n \n20\n \n136\n \n123\n \n176\n \n619\n \n—\n \n—\n \n1,080\n \nNo FICO available\n(1)\n—\n \n—\n \n—\n \n3\n \n1\n \n11\n \n—\n \n—\n \n15\n \nTotal residential mortgages\n3,682\n \n3,259\n \n2,543\n \n5,512\n \n8,065\n \n11,416\n \n—\n \n—\n \n34,477\n \nHome equity\n800+\n—\n \n2\n \n2\n \n5\n \n5\n \n68\n \n6,401\n \n186\n \n6,669\n \n740-799\n—\n \n1\n \n3\n \n4\n \n3\n \n49\n \n5,904\n \n209\n \n6,173\n \n680-739\n—\n \n2\n \n3\n \n3\n \n1\n \n38\n \n3,363\n \n184\n \n3,594\n \n620-679\n—\n \n—\n \n1\n \n2\n \n2\n \n15\n \n867\n \n169\n \n1,056\n \n<620\n—\n \n—\n \n3\n \n1\n \n2\n \n13\n \n559\n \n338\n \n916\n \nNo FICO available\n(1)\n—\n \n—\n \n1\n \n1\n \n—\n \n2\n \n3\n \n—\n \n7\n \nTotal home equity\n—\n \n5\n \n13\n \n16\n \n13\n \n185\n \n17,097\n \n1,086\n \n18,415\n \nAutomobile\n800+\n—\n \n—\n \n52\n \n260\n \n392\n \n92\n \n—\n \n—\n \n796\n \n740-799\n—\n \n—\n \n66\n \n274\n \n329\n \n88\n \n—\n \n—\n \n757\n \n680-739\n—\n \n—\n \n61\n \n211\n \n215\n \n59\n \n—\n \n—\n \n546\n \n620-679\n—\n \n—\n \n35\n \n123\n \n120\n \n36\n \n—\n \n—\n \n314\n \n<620\n—\n \n—\n \n43\n \n155\n \n157\n \n48\n \n—\n \n—\n \n403\n \nNo FICO available\n(1)\n—\n \n—\n \n—\n \n—\n \n—\n \n—\n \n—\n \n—\n \n—\n \nTotal automobile\n—\n \n—\n \n257\n \n1,023\n \n1,213\n \n323\n \n—\n \n—\n \n2,816\n \nEducation\n800+\n225\n \n276\n \n324\n \n529\n \n1,034\n \n1,904\n \n—\n \n—\n \n4,292\n \n740-799\n292\n \n286\n \n283\n \n406\n \n490\n \n930\n \n—\n \n—\n \n2,687\n \n680-739\n122\n \n132\n \n127\n \n169\n \n170\n \n352\n \n—\n \n—\n \n1,072\n \n620-679\n17\n \n41\n \n43\n \n48\n \n46\n \n122\n \n—\n \n—\n \n317\n \n<620\n4\n \n12\n \n18\n \n27\n \n26\n \n70\n \n—\n \n—\n \n157\n \nNo FICO available\n(1)\n4\n \n—\n \n—\n \n—\n \n—\n \n27\n \n—\n \n—\n \n31\n \nTotal education\n664\n \n747\n \n795\n \n1,179\n \n1,766\n \n3,405\n \n—\n \n—\n \n8,556\n \nOther retail\n800+\n104\n \n105\n \n35\n \n33\n \n9\n \n11\n \n462\n \n—\n \n759\n \n740-799\n110\n \n127\n \n50\n \n34\n \n11\n \n21\n \n782\n \n—\n \n1,135\n \n680-739\n75\n \n91\n \n44\n \n32\n \n9\n \n21\n \n739\n \n1\n \n1,012\n \n620-679\n37\n \n45\n \n24\n \n24\n \n6\n \n12\n \n282\n \n1\n \n431\n \n<620\n10\n \n28\n \n20\n \n30\n \n8\n \n11\n \n207\n \n—\n \n314\n \nNo FICO available\n(1)\n13\n \n1\n \n—\n \n—\n \n—\n \n1\n \n447\n \n—\n \n462\n \nTotal other retail\n349\n \n397\n \n173\n \n153\n \n43\n \n77\n \n2,919\n \n2\n \n4,113\n \nTotal retail\n800+\n1,779\n \n2,158\n \n1,727\n \n4,065\n \n6,436\n \n8,328\n \n6,863\n \n186\n \n31,542\n \n740-799\n2,164\n \n1,470\n \n1,163\n \n2,204\n \n2,874\n \n3,976\n \n6,686\n \n209\n \n20,746\n \n680-739\n620\n \n571\n \n491\n \n916\n \n1,068\n \n1,611\n \n4,102\n \n185\n \n9,564\n \n620-679\n95\n \n148\n \n179\n \n358\n \n352\n \n689\n \n1,149\n \n170\n \n3,140\n \n<620\n20\n \n60\n \n220\n \n336\n \n369\n \n761\n \n766\n \n338\n \n2,870\n \nNo FICO available\n(1)\n17\n \n1\n \n1\n \n4\n \n1\n \n41\n \n450\n \n—\n \n515\n \nTotal retail\n$\n4,695\n \n$\n4,408\n \n$\n3,781\n \n$\n7,883\n \n$\n11,100\n \n$\n15,406\n \n$\n20,016\n \n$\n1,088\n \n$\n68,377\n \n(1)\n Represents loans for which an updated FICO score was unavailable (e.g., due to recent profile changes).\nCitizens Financial Group, Inc. | 51\nThe following table presents the amortized cost basis of retail loans by vintage date and current FICO score as of December 31, 2024:\nTerm Loans by Origination Year\nRevolving Loans\n(dollars in millions)\n2024\n2023\n2022\n2021\n2020\nPrior to 2020\nWithin the Revolving Period\nConverted to Term\nTotal\nResidential mortgages\n800+\n$\n1,230\n \n$\n1,302\n \n$\n3,299\n \n$\n5,109\n \n$\n2,919\n \n$\n3,869\n \n$\n—\n \n$\n—\n \n$\n17,728\n \n740-799\n1,757\n \n873\n \n1,568\n \n2,213\n \n1,338\n \n1,923\n \n—\n \n—\n \n9,672\n \n680-739\n425\n \n281\n \n552\n \n697\n \n385\n \n938\n \n—\n \n—\n \n3,278\n \n620-679\n31\n \n61\n \n126\n \n151\n \n101\n \n494\n \n—\n \n—\n \n964\n \n<620\n15\n \n37\n \n76\n \n147\n \n89\n \n703\n \n—\n \n—\n \n1,067\n \nNo FICO available\n(1)\n1\n \n—\n \n—\n \n1\n \n1\n \n14\n \n—\n \n—\n \n17\n \nTotal residential mortgages\n3,459\n \n2,554\n \n5,621\n \n8,318\n \n4,833\n \n7,941\n \n—\n \n—\n \n32,726\n \nHome equity\n800+\n1\n \n—\n \n3\n \n4\n \n1\n \n76\n \n5,634\n \n200\n \n5,919\n \n740-799\n—\n \n—\n \n1\n \n2\n \n1\n \n65\n \n5,275\n \n224\n \n5,568\n \n680-739\n—\n \n—\n \n1\n \n—\n \n1\n \n76\n \n2,995\n \n183\n \n3,256\n \n620-679\n—\n \n1\n \n4\n \n3\n \n2\n \n60\n \n752\n \n141\n \n963\n \n<620\n—\n \n2\n \n6\n \n3\n \n1\n \n59\n \n459\n \n259\n \n789\n \nNo FICO available\n(1)\n—\n \n—\n \n—\n \n—\n \n—\n \n—\n \n—\n \n—\n \n—\n \nTotal home equity\n1\n \n3\n \n15\n \n12\n \n6\n \n336\n \n15,115\n \n1,007\n \n16,495\n \nAutomobile\n800+\n—\n \n65\n \n380\n \n665\n \n183\n \n58\n \n—\n \n—\n \n1,351\n \n740-799\n—\n \n92\n \n430\n \n581\n \n176\n \n61\n \n—\n \n—\n \n1,340\n \n680-739\n—\n \n91\n \n338\n \n385\n \n115\n \n45\n \n—\n \n—\n \n974\n \n620-679\n—\n \n51\n \n189\n \n194\n \n56\n \n29\n \n—\n \n—\n \n519\n \n<620\n—\n \n47\n \n197\n \n216\n \n62\n \n38\n \n—\n \n—\n \n560\n \nNo FICO available\n(1)\n—\n \n—\n \n—\n \n—\n \n—\n \n—\n \n—\n \n—\n \n—\n \nTotal automobile\n—\n \n346\n \n1,534\n \n2,041\n \n592\n \n231\n \n—\n \n—\n \n4,744\n \nEducation\n800+\n227\n \n373\n \n657\n \n1,517\n \n1,256\n \n1,475\n \n—\n \n—\n \n5,505\n \n740-799\n290\n \n359\n \n571\n \n804\n \n637\n \n811\n \n—\n \n—\n \n3,472\n \n680-739\n110\n \n150\n \n229\n \n261\n \n211\n \n337\n \n—\n \n—\n \n1,298\n \n620-679\n27\n \n48\n \n55\n \n58\n \n51\n \n111\n \n—\n \n—\n \n350\n \n<620\n5\n \n12\n \n21\n \n28\n \n25\n \n60\n \n—\n \n—\n \n151\n \nNo FICO available\n(1)\n5\n \n—\n \n—\n \n—\n \n—\n \n31\n \n—\n \n—\n \n36\n \nTotal education\n664\n \n942\n \n1,533\n \n2,668\n \n2,180\n \n2,825\n \n—\n \n—\n \n10,812\n \nOther retail\n800+\n186\n \n65\n \n36\n \n15\n \n11\n \n10\n \n512\n \n—\n \n835\n \n740-799\n259\n \n96\n \n46\n \n18\n \n13\n \n11\n \n895\n \n1\n \n1,339\n \n680-739\n201\n \n87\n \n39\n \n15\n \n11\n \n7\n \n845\n \n1\n \n1,206\n \n620-679\n97\n \n47\n \n27\n \n10\n \n6\n \n3\n \n335\n \n1\n \n526\n \n<620\n32\n \n31\n \n34\n \n15\n \n7\n \n3\n \n234\n \n1\n \n357\n \nNo FICO available\n(1)\n5\n \n—\n \n—\n \n—\n \n—\n \n—\n \n382\n \n—\n \n387\n \nTotal other retail\n780\n \n326\n \n182\n \n73\n \n48\n \n34\n \n3,203\n \n4\n \n4,650\n \nTotal retail\n800+\n1,644\n \n1,805\n \n4,375\n \n7,310\n \n4,370\n \n5,488\n \n6,146\n \n200\n \n31,338\n \n740-799\n2,306\n \n1,420\n \n2,616\n \n3,618\n \n2,165\n \n2,871\n \n6,170\n \n225\n \n21,391\n \n680-739\n736\n \n609\n \n1,159\n \n1,358\n \n723\n \n1,403\n \n3,840\n \n184\n \n10,012\n \n620-679\n155\n \n208\n \n401\n \n416\n \n216\n \n697\n \n1,087\n \n142\n \n3,322\n \n<620\n52\n \n129\n \n334\n \n409\n \n184\n \n863\n \n693\n \n260\n \n2,924\n \nNo FICO available\n(1)\n11\n \n—\n \n—\n \n1\n \n1\n \n45\n \n382\n \n—\n \n440\n \nTotal retail\n$\n4,904\n \n$\n4,171\n \n$\n8,885\n \n$\n13,112\n \n$\n7,659\n \n$\n11,367\n \n$\n18,318\n \n$\n1,011\n \n$\n69,427\n \n(1)\n Represents loans for which an updated FICO score was unavailable (e.g., due to recent profile changes).\nCitizens Financial Group, Inc. | 52\nThe following tables present gross charge-offs by vintage date for the Company’s loan and lease portfolios:\nNine Months Ended September 30, 2025\nTerm Loans and Leases by Origination Year\nRevolving Loans\n(dollars in millions)\n2025\n2024\n2023\n2022\n2021\nPrior to 2021\nWithin the Revolving Period\nConverted to Term\nTotal\nCommercial and industrial\n$\n—\n \n$\n—\n \n$\n2\n \n$\n51\n \n$\n22\n \n$\n5\n \n$\n26\n \n$\n—\n \n$\n106\n \nCommercial real estate\n—\n \n1\n \n3\n \n21\n \n12\n \n126\n \n—\n \n—\n \n163\n \nTotal commercial\n—\n \n1\n \n5\n \n72\n \n34\n \n131\n \n26\n \n—\n \n269\n \nResidential mortgages\n—\n \n—\n \n—\n \n—\n \n—\n \n2\n \n—\n \n—\n \n2\n \nHome equity\n—\n \n—\n \n—\n \n1\n \n—\n \n2\n \n9\n \n—\n \n12\n \nAutomobile\n—\n \n—\n \n4\n \n20\n \n16\n \n7\n \n—\n \n—\n \n47\n \nEducation\n—\n \n3\n \n6\n \n14\n \n22\n \n62\n \n—\n \n—\n \n107\n \nOther retail\n29\n \n27\n \n16\n \n9\n \n4\n \n7\n \n101\n \n—\n \n193\n \nTotal retail\n29\n \n30\n \n26\n \n44\n \n42\n \n80\n \n110\n \n—\n \n361\n \nTotal loans and leases\n$\n29\n \n$\n31\n \n$\n31\n \n$\n116\n \n$\n76\n \n$\n211\n \n$\n136\n \n$\n—\n \n$\n630\n \nNine Months Ended September 30, 2024\nTerm Loans and Leases by Origination Year\nRevolving Loans\n(dollars in millions)\n2024\n2023\n2022\n2021\n2020\nPrior to 2020\nWithin the Revolving Period\nConverted to Term\nTotal\nCommercial and industrial\n$\n—\n \n$\n—\n \n$\n15\n \n$\n22\n \n$\n1\n \n$\n15\n \n$\n32\n \n$\n—\n \n$\n85\n \nCommercial real estate\n—\n \n—\n \n1\n \n22\n \n98\n \n102\n \n—\n \n—\n \n223\n \nTotal commercial\n—\n \n—\n \n16\n \n44\n \n99\n \n117\n \n32\n \n—\n \n308\n \nResidential mortgages\n—\n \n—\n \n—\n \n—\n \n—\n \n4\n \n—\n \n—\n \n4\n \nHome equity\n—\n \n—\n \n—\n \n—\n \n—\n \n3\n \n8\n \n1\n \n12\n \nAutomobile\n—\n \n5\n \n23\n \n23\n \n7\n \n4\n \n9\n \n1\n \n72\n \nEducation\n—\n \n2\n \n6\n \n18\n \n21\n \n46\n \n—\n \n—\n \n93\n \nOther retail\n25\n \n10\n \n7\n \n12\n \n2\n \n8\n \n132\n \n—\n \n196\n \nTotal retail\n25\n \n17\n \n36\n \n53\n \n30\n \n65\n \n149\n \n2\n \n377\n \nTotal loans and leases\n$\n25\n \n$\n17\n \n$\n52\n \n$\n97\n \n$\n129\n \n$\n182\n \n$\n181\n \n$\n2\n \n$\n685\n \nCitizens Financial Group, Inc. | 53\nNonaccrual and Past Due Assets\nThe following tables present an aging analysis of accruing and nonaccrual loans and leases:\nSeptember 30, 2025\nDays Past Due and Accruing\n(dollars in millions)\nCurrent\n30-59\n60-89\n 90+\nNonaccrual\n Total\nNonaccrual with no related ACL\nCommercial and industrial\n$\n46,624\n \n$\n52\n \n$\n8\n \n$\n39\n \n$\n230\n \n$\n46,953\n \n$\n24\n \nCommercial real estate\n24,668\n \n90\n \n72\n \n7\n \n703\n \n25,540\n \n25\n \nTotal commercial\n71,292\n \n142\n \n80\n \n46\n \n933\n \n72,493\n \n49\n \nResidential mortgages\n34,052\n \n80\n \n43\n \n114\n \n188\n \n34,477\n \n150\n \nHome equity\n18,007\n \n83\n \n28\n \n—\n \n297\n \n18,415\n \n206\n \nAutomobile\n2,702\n \n62\n \n21\n \n—\n \n31\n \n2,816\n \n4\n \nEducation\n8,482\n \n34\n \n18\n \n2\n \n20\n \n8,556\n \n2\n \nOther retail\n4,010\n \n32\n \n22\n \n—\n \n49\n \n4,113\n \n1\n \nTotal retail\n67,253\n \n291\n \n132\n \n116\n \n585\n \n68,377\n \n363\n \nTotal\n$\n138,545\n \n$\n433\n \n$\n212\n \n$\n162\n \n$\n1,518\n \n$\n140,870\n \n$\n412\n \nGuaranteed residential mortgages\n(1)\n$\n795\n \n$\n44\n \n$\n23\n \n$\n114\n \n$\n—\n \n$\n976\n \n$\n—\n \nDecember 31, 2024\nDays Past Due and Accruing\n(dollars in millions)\nCurrent\n30-59\n60-89\n90+\nNonaccrual\n Total\nNonaccrual with no related ACL\nCommercial and industrial\n$\n42,247\n \n$\n35\n \n$\n20\n \n$\n8\n \n$\n241\n \n$\n42,551\n \n$\n31\n \nCommercial real estate\n26,212\n \n204\n \n27\n \n6\n \n776\n \n27,225\n \n32\n \nTotal commercial\n68,459\n \n239\n \n47\n \n14\n \n1,017\n \n69,776\n \n63\n \nResidential mortgages\n32,011\n \n251\n \n93\n \n179\n \n192\n \n32,726\n \n142\n \nHome equity\n16,097\n \n88\n \n27\n \n—\n \n283\n \n16,495\n \n182\n \nAutomobile\n4,563\n \n100\n \n33\n \n—\n \n48\n \n4,744\n \n6\n \nEducation\n10,686\n \n45\n \n23\n \n2\n \n56\n \n10,812\n \n4\n \nOther retail\n4,504\n \n46\n \n31\n \n1\n \n68\n \n4,650\n \n1\n \nTotal retail\n67,861\n \n530\n \n207\n \n182\n \n647\n \n69,427\n \n335\n \nTotal\n$\n136,320\n \n$\n769\n \n$\n254\n \n$\n196\n \n$\n1,664\n \n$\n139,203\n \n$\n398\n \nGuaranteed residential mortgages\n(1)\n$\n696\n \n$\n119\n \n$\n55\n \n$\n172\n \n$\n—\n \n$\n1,042\n \n$\n—\n \n(1) \nGuaranteed residential mortgages represent loans fully or partially guaranteed by the FHA, VA, and USDA, and are included in the amounts presented for Residential mortgages.\n \nAt September 30, 2025 and December 31, 2024, the Company had collateral-dependent residential mortgage and home equity loans totaling $\n427\n million and $\n372\n million, respectively, and collateral-dependent commercial\n \nloans totaling $\n250\n million and $\n607\n million, respectively.\nThe amortized cost basis of mortgage loans collateralized by residential real estate for which formal foreclosure proceedings were in-process was $\n299\n million and $\n295\n million as of September 30, 2025 and December 31, 2024, respectively.\nLoan Modifications to Borrowers Experiencing Financial Difficulty\nThe Company offers loan modifications, characterized as FDMs, to retail and commercial borrowers experiencing financial difficulty as a result of its loss mitigation activities that may result in a payment delay, interest rate reduction, term extension, principal forgiveness, or combination thereof. Payment delays consist of modifications that result in a delay of contractual amounts due greater than three months over a rolling 12-month period. Term extensions consist of modifications that result in an extension of the contractual maturity date greater than three months or a significant deferral of principal payments relative to the total outstanding principal balance of the loan.\nCitizens Financial Group, Inc. | 54\nCommercial loan modifications are offered on a case-by-case basis and generally include a payment delay, term extension, and/or interest rate reduction. The Company does not typically offer principal forgiveness for commercial loans. Retail loan modifications are offered through structured loan modification programs, which are summarized below:\n•\nForbearance programs provide borrowers experiencing some form of hardship a period of time during which their contractual payment obligations are suspended, resulting in a payment delay and/or term extension;\n•\nOther repayment plans are offered due to hardship and include an interest rate reduction and/or term extension designed to enable the borrower to return the loan to current status in an expeditious manner;\n•\nSettlement agreements may be executed with borrowers experiencing a long-term hardship or who are delinquent, resulting in principal forgiveness. Upon fulfillment of the terms of the settlement agreement, the unpaid principal amount is forgiven resulting in a charge-off of the outstanding principal balance; and\n•\nCertain reorganization bankruptcy judgments may result in any one of the four modification types or some combination thereof.\nThe following tables present the period-end amortized cost of loans to borrowers experiencing financial difficulty that were modified during the three and nine months ended September 30, 2025 and 2024, disaggregated by class of financing receivable and modification type. The modification type reflects the cumulative effect of all FDMs received during the indicated period.\nThree Months Ended September 30, 2025\n(dollars in millions)\nInterest Rate Reduction\nTerm Extension\nPayment Delay\nInterest Rate Reduction and Term Extension\nTerm Extension and Payment Delay\nInterest Rate Reduction, Term Extension and Payment Delay\nTotal\nTotal as a % of Loan Class\n(1)\nCommercial and industrial\n$\n1\n \n$\n151\n \n$\n—\n \n$\n2\n \n$\n—\n \n$\n1\n \n$\n155\n \n0.33\n \n%\nCommercial real estate\n—\n \n388\n \n22\n \n—\n \n102\n \n—\n \n512\n \n2.00\n \nTotal commercial\n1\n \n539\n \n22\n \n2\n \n102\n \n1\n \n667\n \n0.92\n \nResidential mortgages\n1\n \n18\n \n6\n \n5\n \n—\n \n1\n \n31\n \n0.09\n \nHome equity\n2\n \n1\n \n6\n \n3\n \n—\n \n—\n \n12\n \n0.07\n \nEducation\n3\n \n—\n \n—\n \n—\n \n—\n \n—\n \n3\n \n0.04\n \nOther retail\n5\n \n—\n \n—\n \n—\n \n—\n \n—\n \n5\n \n0.12\n \nTotal retail\n11\n \n19\n \n12\n \n8\n \n—\n \n1\n \n51\n \n0.07\n \nTotal\n$\n12\n \n$\n558\n \n$\n34\n \n$\n10\n \n$\n102\n \n$\n2\n \n$\n718\n \n0.51\n \n%\nThree Months Ended September 30, 2024\n(dollars in millions)\nInterest Rate Reduction\nTerm Extension\nPayment Delay\nInterest Rate Reduction and Term Extension\nTerm Extension and Payment Delay\nTotal\nTotal as a % of Loan Class\n(1)\nCommercial and industrial\n$\n—\n \n$\n75\n \n$\n25\n \n$\n1\n \n$\n3\n \n$\n104\n \n0.24\n \n%\nCommercial real estate\n—\n \n156\n \n23\n \n67\n \n94\n \n340\n \n1.22\n \nTotal commercial\n—\n \n231\n \n48\n \n68\n \n97\n \n444\n \n0.62\n \nResidential mortgages\n1\n \n15\n \n1\n \n4\n \n1\n \n22\n \n0.07\n \nHome equity\n2\n \n1\n \n—\n \n4\n \n—\n \n7\n \n0.04\n \nEducation\n3\n \n1\n \n16\n \n—\n \n—\n \n20\n \n0.18\n \nOther retail\n5\n \n—\n \n—\n \n—\n \n—\n \n5\n \n0.10\n \nTotal retail\n11\n \n17\n \n17\n \n8\n \n1\n \n54\n \n0.08\n \nTotal\n$\n11\n \n$\n248\n \n$\n65\n \n$\n76\n \n$\n98\n \n$\n498\n \n0.35\n \n%\nCitizens Financial Group, Inc. | 55\nNine Months Ended September 30, 2025\n(dollars in millions)\nInterest Rate Reduction\nTerm Extension\nPayment Delay\nInterest Rate Reduction and Term Extension\nTerm Extension and Payment Delay\nInterest Rate Reduction, Term Extension, and Payment Delay\nTotal\nTotal as a % of Loan Class\n(1)\nCommercial and industrial\n$\n16\n \n$\n322\n \n$\n2\n \n$\n5\n \n$\n1\n \n$\n4\n \n$\n350\n \n0.75\n \n%\nCommercial real estate\n28\n \n707\n \n66\n \n29\n \n103\n \n—\n \n933\n \n3.65\n \nTotal commercial\n44\n \n1,029\n \n68\n \n34\n \n104\n \n4\n \n1,283\n \n1.77\n \nResidential mortgages\n3\n \n42\n \n13\n \n9\n \n1\n \n2\n \n70\n \n0.20\n \nHome equity\n5\n \n1\n \n11\n \n5\n \n—\n \n—\n \n22\n \n0.12\n \nEducation\n8\n \n—\n \n—\n \n—\n \n—\n \n—\n \n8\n \n0.09\n \nOther retail\n13\n \n—\n \n—\n \n—\n \n—\n \n—\n \n13\n \n0.32\n \nTotal retail\n29\n \n43\n \n24\n \n14\n \n1\n \n2\n \n113\n \n0.17\n \nTotal\n$\n73\n \n$\n1,072\n \n$\n92\n \n$\n48\n \n$\n105\n \n$\n6\n \n$\n1,396\n \n0.99\n \n%\nNine Months Ended September 30, 2024\n(dollars in millions)\nInterest Rate Reduction\nTerm Extension\nPayment Delay\nInterest Rate Reduction and Term Extension\nTerm Extension and Payment Delay\nInterest Rate Reduction, Term Extension, and Payment Delay\nTotal\nTotal as a % of Loan Class\n(1)\nCommercial and industrial\n$\n—\n \n$\n179\n \n$\n86\n \n$\n1\n \n$\n23\n \n$\n—\n \n$\n289\n \n0.66\n \n%\nCommercial real estate\n—\n \n505\n \n100\n \n130\n \n144\n \n—\n \n879\n \n3.14\n \nTotal commercial\n—\n \n684\n \n186\n \n131\n \n167\n \n—\n \n1,168\n \n1.63\n \nResidential mortgages\n4\n \n63\n \n9\n \n8\n \n1\n \n1\n \n86\n \n0.27\n \nHome equity\n3\n \n2\n \n—\n \n9\n \n—\n \n—\n \n14\n \n0.09\n \nEducation\n9\n \n2\n \n39\n \n—\n \n—\n \n—\n \n50\n \n0.45\n \nOther retail\n13\n \n—\n \n—\n \n—\n \n—\n \n—\n \n13\n \n0.27\n \nTotal retail\n29\n \n67\n \n48\n \n17\n \n1\n \n1\n \n163\n \n0.23\n \nTotal\n$\n29\n \n$\n751\n \n$\n234\n \n$\n148\n \n$\n168\n \n$\n1\n \n$\n1,331\n \n0.94\n \n%\n(1)\n Represents the total amortized cost as of period-end divided by the period-end amortized cost of the corresponding loan class. Accrued interest receivable is excluded from amortized cost and is immaterial.\nThe following tables present the financial effect of loans to borrowers experiencing financial difficulty that were modified during the three and nine months ended September 30, 2025 and 2024, disaggregated by class of financing receivable:\nThree Months Ended September 30, 2025\n(dollars in millions)\nWeighted-Average Interest Rate Reduction\n(1)\nWeighted-Average Term Extension (in Months)\n(1)\nWeighted-Average Payment Deferral\n(1)\nAmount of Principal Forgiven\n(2)\nCommercial and industrial\n2.18\n \n%\n20\n$\n—\n \n$\n—\n \nCommercial real estate\n—\n \n12\n5\n \n—\n \nResidential mortgages\n1.40\n \n107\n—\n \n—\n \nHome equity\n3.01\n \n143\n—\n \n—\n \nEducation\n5.22\n \n— \n—\n \n—\n \nOther retail\n19.89\n \n— \n—\n \n6\n \nCitizens Financial Group, Inc. | 56\nThree Months Ended September 30, 2024\n(dollars in millions)\nWeighted-Average Interest Rate Reduction\n(1)\nWeighted-Average Term Extension (in Months)\n(1)\nWeighted-Average Payment Deferral\n(1)\nAmount of Principal Forgiven\n(2)\nCommercial and industrial\n3.62\n \n%\n14\n$\n11\n \n$\n—\n \nCommercial real estate\n4.31\n \n9\n1\n \n—\n \nResidential mortgages\n1.52\n \n94\n—\n \n—\n \nHome equity\n4.32\n \n51\n—\n \n—\n \nEducation\n4.44\n \n24\n—\n \n—\n \nOther retail\n20.79\n \n— \n—\n \n1\n \nNine Months Ended September 30, 2025\n(dollars in millions)\nWeighted-Average Interest Rate Reduction\n(1)\nWeighted-Average Term Extension (in Months)\n(1)\nWeighted-Average Payment Deferral\n(1)\nAmount of Principal Forgiven\n(2)\nCommercial and industrial\n1.52\n \n%\n18\n$\n—\n \n$\n—\n \nCommercial real estate\n0.83\n \n12\n5\n \n—\n \nResidential mortgages\n1.27\n \n110\n—\n \n—\n \nHome equity\n3.41\n \n121\n—\n \n—\n \nEducation\n4.71\n \n— \n—\n \n—\n \nOther retail\n19.86\n \n— \n—\n \n12\n \nNine Months Ended September 30, 2024\n(dollars in millions)\nWeighted-Average Interest Rate Reduction\n(1)\nWeighted-Average Term Extension (in Months)\n(1)\nWeighted-Average Payment Deferral\n(1)\nAmount of Principal Forgiven\n(2)\nCommercial and industrial\n3.72\n \n%\n15\n$\n3\n \n$\n—\n \nCommercial real estate\n2.83\n \n17\n1\n \n—\n \nResidential mortgages\n1.59\n \n92\n—\n \n—\n \nHome equity\n4.03\n \n75\n—\n \n—\n \nEducation\n4.42\n \n24\n—\n \n—\n \nOther retail\n20.23\n \n— \n—\n \n5\n \n(1) \nWeighted based on period-end amortized cost. \n(2)\n Amounts are recorded as charge-offs.\nThe following tables present an aging analysis of the period-end amortized cost of loans to borrowers experiencing financial difficulty that were modified during the twelve month period ending September 30, 2025 and 2024, disaggregated by class of financing receivable. A loan in a forbearance or repayment plan is reported as past due according to its contractual terms until contractually modified. Subsequent to modification, it is reported as past due based on its restructured terms.\nSeptember 30, 2025\nDays Past Due and Accruing\n(dollars in millions)\nCurrent\n30-59\n60-89\n 90+\nNonaccrual\n Total\nCommercial and industrial\n$\n348\n \n$\n1\n \n$\n—\n \n$\n35\n \n$\n61\n \n$\n445\n \nCommercial real estate\n733\n \n83\n \n2\n \n4\n \n293\n \n1,115\n \nTotal commercial\n1,081\n \n84\n \n2\n \n39\n \n354\n \n1,560\n \nResidential mortgages\n49\n \n7\n \n6\n \n16\n \n19\n \n97\n \nHome equity\n8\n \n—\n \n—\n \n—\n \n22\n \n30\n \nEducation\n8\n \n—\n \n—\n \n—\n \n2\n \n10\n \nOther retail\n13\n \n2\n \n1\n \n—\n \n1\n \n17\n \nTotal retail\n78\n \n9\n \n7\n \n16\n \n44\n \n154\n \nTotal\n$\n1,159\n \n$\n93\n \n$\n9\n \n$\n55\n \n$\n398\n \n$\n1,714\n \nCitizens Financial Group, Inc. | 57\nSeptember 30, 2024\nDays Past Due and Accruing\n(dollars in millions)\nCurrent\n30-59\n60-89\n 90+\nNonaccrual\n Total\nCommercial and industrial\n$\n211\n \n$\n35\n \n$\n1\n \n$\n—\n \n$\n54\n \n$\n301\n \nCommercial real estate\n590\n \n30\n \n63\n \n—\n \n287\n \n970\n \nTotal commercial\n801\n \n65\n \n64\n \n—\n \n341\n \n1,271\n \nResidential mortgages\n73\n \n6\n \n4\n \n16\n \n12\n \n111\n \nHome equity\n11\n \n—\n \n—\n \n—\n \n8\n \n19\n \nEducation\n34\n \n1\n \n—\n \n—\n \n35\n \n70\n \nOther retail\n12\n \n1\n \n1\n \n—\n \n1\n \n15\n \nTotal retail\n130\n \n8\n \n5\n \n16\n \n56\n \n215\n \nTotal\n$\n931\n \n$\n73\n \n$\n69\n \n$\n16\n \n$\n397\n \n$\n1,486\n \nThe following tables present the period-end amortized cost of loans to borrowers experiencing financial difficulty that defaulted during the period presented and were modified within the previous 12 months preceding the default, disaggregated by class of financing receivable and modification type. The modification type reflects the cumulative effect of all FDMs at the time of default. A loan is considered to be in default if, subsequent to modification, it becomes 90 or more days past due or is placed on nonaccrual status.\nThree Months Ended September 30, 2025\n(dollars in millions)\nInterest Rate Reduction\nTerm Extension\nPayment Delay\nInterest Rate Reduction and Term Extension\nTerm Extension and Payment Delay\nTotal\nCommercial and industrial\n$\n—\n \n$\n36\n \n$\n—\n \n$\n—\n \n$\n—\n \n$\n36\n \nCommercial real estate\n—\n \n4\n \n—\n \n—\n \n—\n \n4\n \nTotal commercial\n—\n \n40\n \n—\n \n—\n \n—\n \n40\n \nResidential mortgages\n1\n \n8\n \n4\n \n3\n \n—\n \n16\n \nHome equity\n—\n \n—\n \n—\n \n—\n \n—\n \n—\n \nEducation\n1\n \n—\n \n—\n \n—\n \n—\n \n1\n \nOther retail\n1\n \n—\n \n—\n \n—\n \n—\n \n1\n \nTotal retail\n3\n \n8\n \n4\n \n3\n \n—\n \n18\n \nTotal\n$\n3\n \n$\n48\n \n$\n4\n \n$\n3\n \n$\n—\n \n$\n58\n \nThree Months Ended September 30, 2024\n(dollars in millions)\nInterest Rate Reduction\nTerm Extension\nPayment Delay\nTerm Extension and Payment Delay\nTotal\nCommercial and industrial\n$\n1\n \n$\n3\n \n$\n—\n \n$\n15\n \n$\n19\n \nCommercial real estate\n—\n \n75\n \n21\n \n—\n \n96\n \nTotal commercial\n1\n \n78\n \n21\n \n15\n \n115\n \nResidential mortgages\n—\n \n11\n \n—\n \n—\n \n11\n \nHome equity\n—\n \n—\n \n—\n \n—\n \n—\n \nEducation\n1\n \n—\n \n—\n \n—\n \n1\n \nOther retail\n1\n \n—\n \n—\n \n—\n \n1\n \nTotal retail\n2\n \n11\n \n—\n \n—\n \n13\n \nTotal\n$\n3\n \n$\n89\n \n$\n21\n \n$\n15\n \n$\n128\n \nCitizens Financial Group, Inc. | 58\nNine Months Ended September 30, 2025\n(dollars in millions)\nInterest Rate Reduction\nTerm Extension\nPayment Delay\nInterest Rate Reduction and Term Extension\nTerm Extension and Payment Delay\nTotal\nCommercial and industrial\n$\n—\n \n$\n48\n \n$\n—\n \n$\n—\n \n$\n—\n \n$\n48\n \nCommercial real estate\n—\n \n72\n \n2\n \n—\n \n—\n \n74\n \nTotal commercial\n—\n \n120\n \n2\n \n—\n \n—\n \n122\n \nResidential mortgages\n1\n \n20\n \n5\n \n6\n \n1\n \n33\n \nHome equity\n1\n \n—\n \n1\n \n1\n \n—\n \n3\n \nEducation\n1\n \n—\n \n—\n \n—\n \n—\n \n1\n \nOther retail\n1\n \n—\n \n—\n \n—\n \n—\n \n1\n \nTotal retail\n4\n \n20\n \n6\n \n7\n \n1\n \n38\n \nTotal\n$\n4\n \n$\n140\n \n$\n8\n \n$\n7\n \n$\n1\n \n$\n160\n \nNine Months Ended September 30, 2024\n(dollars in millions)\nInterest Rate Reduction\nTerm Extension\nPayment Delay\nInterest Rate Reduction and Term Extension\nTerm Extension and Payment Delay\nTotal\nCommercial and industrial\n$\n1\n \n$\n3\n \n$\n—\n \n$\n—\n \n$\n15\n \n$\n19\n \nCommercial real estate\n—\n \n141\n \n21\n \n—\n \n—\n \n162\n \nTotal commercial\n1\n \n144\n \n21\n \n—\n \n15\n \n181\n \nResidential mortgages\n—\n \n22\n \n1\n \n1\n \n1\n \n25\n \nHome equity\n—\n \n—\n \n—\n \n1\n \n—\n \n1\n \nEducation\n4\n \n—\n \n12\n \n—\n \n—\n \n16\n \nOther retail\n1\n \n—\n \n—\n \n—\n \n—\n \n1\n \nTotal retail\n5\n \n22\n \n13\n \n2\n \n1\n \n43\n \nTotal\n$\n6\n \n$\n166\n \n$\n34\n \n$\n2\n \n$\n16\n \n$\n224\n \nUnfunded commitments related to loans modified during the nine months ended September 30, 2025 were $\n342\n million at September 30, 2025. Unfunded commitments related to loans modified during the year ended December 31, 2024 were $\n206\n million at December 31, 2024.\nNOTE 5 - MORTGAGE BANKING AND OTHER SERVICED LOANS \nMortgage Banking\nThe Company sells residential mortgages in the secondary market and does not retain a beneficial interest in these sales but may retain the servicing rights for the loans sold. The Company may exercise its option to repurchase eligible government guaranteed residential mortgages or may be obligated to subsequently repurchase a loan if the purchaser discovers a representation or warranty violation, such as noncompliance with eligibility or servicing requirements or customer fraud that should have been identified in a loan file review.\nThe following table summarizes activity related to residential mortgage loans sold with servicing rights retained:\nThree Months Ended September 30,\nNine Months Ended September 30,\n(dollars in millions)\n2025\n2024\n2025\n2024\nCash proceeds from residential mortgage loans sold with servicing retained\n$\n2,528\n \n$\n2,137\n \n$\n6,920\n \n$\n5,432\n \nGain on sales\n(1)\n19\n \n17\n \n56\n \n47\n \nContractually specified servicing, late, and other ancillary fees\n(1)\n70\n \n79\n \n209\n \n235\n \n(1)\n Reported in Mortgage banking fees in the Consolidated Statements of Operations.\nThe unpaid principal balance of residential mortgage loans related to our MSRs was $\n95.2\n billion and $\n95.6\n billion at September 30, 2025 and December 31, 2024, respectively. The Company manages the risk associated with changes in the fair value of the MSRs with an active economic hedging strategy, which includes the purchase of freestanding derivatives.\nCitizens Financial Group, Inc. | 59\nThe following table summarizes changes in MSRs recorded using the fair value method:\nAs of and for the Three Months Ended September 30,\nAs of and for the Nine Months Ended September 30,\n(dollars in millions)\n2025\n2024\n2025\n2024\nFair value as of beginning of the period\n$\n1,426\n \n$\n1,568\n \n$\n1,491\n \n$\n1,552\n \nAmounts capitalized\n42\n \n28\n \n117\n \n71\n \nSales\n(1)\n—\n \n—\n \n(\n72\n)\n—\n \nChanges in unpaid principal balance\n(2)\n(\n41\n)\n(\n46\n)\n(\n120\n)\n(\n135\n)\nChanges in fair value\n(3)\n3\n \n(\n49\n)\n14\n \n13\n \nFair value at end of the period\n$\n1,430\n \n$\n1,501\n \n$\n1,430\n \n$\n1,501\n \n(1)\n For the nine months ended September 30, 2025, represents the sale of the excess servicing yield on MSRs related to certain FNMA mortgages with a total unpaid principal balance of $\n10.5\n billion at the time of sale.\n(2)\n Represents changes in value of the MSRs due to i) the passage of time including the impact from both regularly scheduled loan principal payments and partial\n    paydowns, and ii) loans that paid off during the period. \n(3)\n Represents changes in fair value primarily driven by market conditions. These changes are recorded in Mortgage banking fees in the Consolidated Statements of Operations.\nThe fair value of MSRs is estimated by using the present value of estimated future net servicing cash flows, taking into consideration actual and expected mortgage loan prepayment rates, discount rates, contractual servicing fee income, servicing costs, default rates, ancillary income, and other economic factors determined based on current market interest rates. The valuation does not attempt to forecast or predict the future direction of interest rates.\nThe sensitivity analysis below presents the impact of an immediate \n10\n% and \n20\n% adverse change in key economic assumptions to the current fair value of MSRs. These sensitivities are hypothetical, with the effect of a variation in a particular assumption on the fair value of the MSRs calculated independently without changing any other assumption. Changes in one factor may result in changes in another (e.g., changes in interest rates that drive changes in prepayment rates could result in changes in discount rates) and may amplify or counteract the sensitivities. The primary risk inherent in the Company’s MSRs is an increase in prepayments of the underlying mortgage loans serviced, which is largely dependent upon movements in market interest rates.\n(dollars in millions)\nSeptember 30, 2025\nDecember 31, 2024\nFair value\n$\n1,430\n$\n1,491\nWeighted average life (years)\n8.0\n8.7\nWeighted average constant prepayment rate\n7.1\n%\n6.7\n%\nDecline in fair value from \n10\n% adverse change\n$\n39\n$\n35\nDecline in fair value from \n20\n% adverse change\n$\n72\n$\n67\nWeighted average option adjusted spread\n608\n bps\n632\n bps\nDecline in fair value from \n10\n% adverse change\n$\n40\n$\n42\nDecline in fair value from \n20\n% adverse change\n$\n80\n$\n84\nThe Company has mortgage banking derivatives that include commitments to originate mortgages held for sale, certain loan sale agreements, and other financial instruments that meet the definition of a derivative. Refer to Note 8 for additional information.\nOther Serviced Loans\nThe Company engages in other servicing relationships from time to time. \nThe following table presents the unpaid principal balance of other serviced loans:\n(dollars in millions)\nSeptember 30, 2025\nDecember 31, 2024\nEducation\n$\n358\n \n$\n420\n \nCommercial and industrial\n(1)\n88\n \n92\n \n(1) \nRepresents the government guaranteed portion of SBA loans sold to outside investors\n.\nCitizens Financial Group, Inc. | 60\nNOTE 6 - VARIABLE INTEREST ENTITIES \nThe Company, in the normal course of business, engages in a variety of activities with entities that are considered VIEs, as defined by GAAP, with its variable interest arising from contractual, ownership, or other monetary interests in the entity. A VIE typically does not have sufficient equity at risk to finance its activities without additional subordinated financial support from other parties.\nFor more details regarding the Company’s involvement with VIEs see Note 11 in the Company’s 2024 Form 10-K.\nConsolidated VIEs\nThe Company has consolidated VIEs related to secured borrowings collateralized by auto loans. \nThe following table summarizes the carrying amount of assets and liabilities for the Company’s consolidated VIEs:\n(dollars in millions)\nSeptember 30, 2025\nDecember 31, 2024\nAssets:\nInterest-bearing deposits in banks\n$\n169\n \n$\n209\n \nNet loans and leases\n2,353\n \n3,843\n \nOther assets\n15\n \n21\n \nTotal assets\n$\n2,537\n \n$\n4,073\n \nLiabilities:\nLong-term borrowed funds\n$\n1,982\n \n$\n3,375\n \nOther liabilities\n5\n \n8\n \nTotal liabilities\n$\n1,987\n \n$\n3,383\n \nSecured Borrowings\nThe Company utilizes a portion of its auto loan portfolio to support certain secured borrowing arrangements, which provide a source of funding for the Company and involves the transfer of auto loans to bankruptcy remote SPEs. These SPEs then issue asset-backed notes to third parties collateralized by the transferred loans.\nThe assets of a particular VIE are the primary source of funds to settle its obligations. Creditors of these VIEs do not have recourse to the general credit of the Company. The performance of the loans transferred is the most significant driver impacting the economic performance of the VIEs.\nUnconsolidated VIEs\nThe Company is involved with various VIEs that are not consolidated including lending to SPEs, investments in asset-backed securities, and investments in entities that sponsor affordable housing, renewable energy, and economic development projects. The Company’s maximum exposure to loss resulting from its involvement with these entities is limited to the balance sheet carrying amount of its investments, unfunded commitments, and the outstanding principal balance of loans to SPEs.\nThe following table provides a summary of the assets and liabilities included in the Consolidated Balance Sheets related to unconsolidated VIEs that the Company holds an interest in, but is not the primary beneficiary of:\n(dollars in millions)\nSeptember 30, 2025\nDecember 31, 2024\nLending to SPEs included in Loans and leases\n$\n4,893\n \n$\n4,215\n \nLIHTC investments included in Other assets\n2,698\n \n2,631\n \nLIHTC unfunded commitments included in Other liabilities\n1,065\n \n1,109\n \nAsset-backed investments included in HTM securities \n357\n \n412\n \nRenewable energy investments included in Other assets\n217\n \n269\n \nNMTC investments included in Other assets\n1\n \n2\n \nCitizens Financial Group, Inc. | 61\nLending to Special Purpose Entities\nThe Company provides lending facilities to third-party sponsored SPEs within its Capital Markets business. The SPEs are primarily funded through these lending facilities or a syndication in which the Company participates. The principal risk of these lending facilities is the credit risk related to the underlying assets in the SPE, in which the Company generally holds a priority position. As of September 30, 2025 and December 31, 2024, the lending facilities had undrawn commitments to extend credit of $\n3.2\n billion and $\n2.8\n billion, respectively. For more information on commitments to extend credit see Note 11.\nLow Income Housing Tax Credit Partnerships\n \nThe Company makes certain equity investments in various limited partnerships that sponsor affordable housing projects utilizing federal tax incentives pursuant to Section 42 of the Internal Revenue Code. The objective of these investments is to generate a satisfactory return on capital, encourage the development and investment in projects that serve affordable housing product offerings, and further the goals of the Community Reinvestment Act. The principal activities of the limited partnerships include the identification, development, and operation of multifamily housing properties leased to qualifying residential tenants. Funding for these investments is generally provided through a combination of debt and equity.\nAsset-backed securities\nThe Company’s investments in asset-backed securities are collateralized by education loans sold to a third-party sponsored VIE. The Company acts as the primary servicer for the sold loans and receives a servicing fee. A third-party servicer is responsible for all loans that become significantly delinquent.\nRenewable Energy Entities\nThe Company’s investments in certain renewable energy entities provide benefits from government incentives and other tax attributes (e.g., tax depreciation).\nContingent commitments related to the Company’s renewable energy investments were $\n43\n million at September 30, 2025, and are expected to be paid in varying amounts through 2027. These payments are contingent upon the level of electricity production attained by the renewable energy entity relative to its targeted threshold, changes in the production tax credit rates set by the Internal Revenue Service, and the achievement of commercial operation for a certain renewable energy project under its power purchase agreement.\nNew Markets Tax Credit Program\nThe Company participates in the NMTC program which provides a tax incentive for private sector investment into economic development projects and businesses located in low-income communities.\nThe following table summarizes the impact to the Consolidated Statements of Operations relative to the Company’s tax credit programs for which it has elected to apply the proportional amortization method of accounting:\nThree Months Ended September 30,\nNine Months Ended September 30,\n(dollars in millions)\n2025\n2024\n2025\n2024\nTax credits recognized\n$\n99\n \n$\n99\n \n$\n309\n \n$\n290\n \nOther tax benefits recognized\n24\n \n21\n \n73\n \n68\n \nAmortization\n(\n98\n)\n(\n88\n)\n(\n304\n)\n(\n276\n)\nNet benefit (expense) included in Income tax expense\n25\n \n32\n \n78\n \n82\n \nOther income\n1\n \n1\n \n5\n \n4\n \nAllocated income (loss) on investments\n(\n3\n)\n(\n3\n)\n(\n10\n)\n(\n9\n)\nNet benefit (expense) included in Noninterest income\n(\n2\n)\n(\n2\n)\n(\n5\n)\n(\n5\n)\nNet benefit (expense) included in the Consolidated Statements of Operations\n(1)\n$\n23\n \n$\n30\n \n$\n73\n \n$\n77\n \n(1) \nIncludes the impact of tax credit investments when the election to apply the proportional amortization method was in effect during the periods presented. For 2025 and 2024, this includes LIHTC, renewable energy, and NMTC investments.\nThe Company did not recognize impairment losses resulting from the forfeiture or ineligibility of income tax credits or other circumstances during the three and nine months ended September 30, 2025 and 2024.\nCitizens Financial Group, Inc. | 62\nNOTE 7 - BORROWED FUNDS \nShort-term borrowed funds\nBorrowings with original maturities of one year or less are classified as short-term and were comprised of the following:\n(dollars in millions)\nSeptember 30, 2025\nDecember 31, 2024\nOther short-term borrowed funds\n(1)\n$\n214\n \n$\n—\n \nTotal short-term borrowed funds\n$\n214\n \n$\n—\n \n(1) \nConsists primarily of short positions held by the Company’s commercial broker dealer. See Note 8 for additional information regarding forward purchase contracts entered into to economically hedge these short positions.\n \nLong-term borrowed funds\nThe following table presents a summary of the Company’s long-term borrowed funds:\n(dollars in millions)\nSeptember 30, 2025\nDecember 31, 2024\nParent Company:\n4.350\n% fixed-rate subordinated debt, due August 2025\n$\n—\n \n$\n133\n \n4.300\n% fixed-rate subordinated debt, due December 2025\n336\n \n336\n \n2.850\n% fixed-rate senior unsecured notes, due July 2026\n500\n \n499\n \n5.841\n% fixed/floating-rate senior unsecured notes, due January 2030\n1,246\n \n1,245\n \n2.500\n% fixed-rate senior unsecured notes, due February 2030\n299\n \n299\n \n3.250\n% fixed-rate senior unsecured notes, due April 2030\n747\n \n747\n \n3.750\n% fixed-rate reset subordinated debt, due February 2031\n69\n \n69\n \n4.300\n% fixed-rate reset subordinated debt, due February 2031\n135\n \n135\n \n4.350\n% fixed-rate reset subordinated debt, due February 2031\n60\n \n60\n \n5.253\n% fixed/floating-rate senior unsecured notes, due March 2031\n746\n \n—\n \n5.718\n% fixed/floating-rate senior unsecured notes, due July 2032\n1,244\n \n1,243\n \n2.638\n% fixed-rate subordinated debt, due September 2032\n575\n \n570\n \n6.645\n% fixed/floating-rate senior unsecured notes, due April 2035\n746\n \n745\n \n5.641\n% fixed-rate reset subordinated debt, due May 2037\n398\n \n398\n \nCBNA’s Global Note Program:\n2.250\n% senior unsecured notes, due April 2025\n—\n \n750\n \n5.284\n% fixed/floating-rate senior unsecured notes, due January 2026\n(1)\n—\n \n350\n \n3.750\n% senior unsecured notes, due February 2026\n499\n \n492\n \n4.575\n% fixed/floating-rate senior unsecured notes, due August 2028\n799\n \n798\n \nAdditional Borrowings by CBNA and Other Subsidiaries:\nFederal Home Loan Bank advances, \n2.196\n% weighted average rate, due through 2045\n(2)\n13\n \n53\n \nSecured borrowings, \n5.536\n% weighted average rate, due through 2031\n(2)(3)\n2,009\n \n3,461\n \nOther\n20\n \n18\n \nTotal long-term borrowed funds\n$\n10,441\n \n$\n12,401\n \n(1) \nNotes were redeemed on January 27, 2025. \n(2) \nRate disclosed reflects the weighted average rate as of September 30, 2025.\n(3) \nCollateralized by loans. See Note 6 for additional information.\nAt September 30, 2025, the Company’s long-term borrowed funds include principal balances of $\n10.5\n billion, unamortized debt issuance costs and discounts of $\n75\n million, and hedging basis adjustments of ($\n1\n) million. At December 31, 2024, the Company’s long-term borrowed funds include principal balances of $\n12.5\n billion, unamortized debt issuance costs and discounts of $\n85\n million, and hedging basis adjustments of ($\n8\n) million. See Note 8 for further information about the Company’s hedging of certain long-term borrowed funds.\nAdvances, lines of credit, and letters of credit from the FHLB are collateralized primarily by residential mortgages and home equity products sufficient to satisfy the collateral maintenance level established by the FHLB. The utilized FHLB borrowing capacity, primarily for advances and letters of credit, was $\n4.9\n billion and $\n4.6\n billion at September 30, 2025 and December 31, 2024, respectively. The Company’s available FHLB borrowing capacity was $\n24.3\n billion and $\n21.1\n billion at September 30, 2025 and December 31, 2024, respectively. The Company can also borrow from the FRB discount window to meet short-term liquidity requirements. Collateral, including certain loans, is pledged to support this borrowing capacity. At September 30, 2025, the Company’s unused secured borrowing capacity was approximately $\n78.0\n billion, which includes unencumbered securities, FHLB borrowing capacity, and FRB discount window capacity.\nCitizens Financial Group, Inc. | 63\nNOTE 8 - DERIVATIVES \nIn the normal course of business, the Company enters into derivative transactions to meet the financing and hedging needs of its customers and reduce its own exposure to fluctuations in interest rates and foreign currency exchange rates. These transactions include interest rate swap contracts, interest rate options, foreign exchange contracts, residential loan commitment rate locks, interest rate future contracts, swaptions, certain commodities, forward commitments to sell TBAs, forward purchase and sale contracts, and purchase options. The Company does not use derivatives for speculative purposes. Information regarding the valuation methodology and inputs used to estimate the fair value of the Company’s derivative instruments is described in Note 20 in the Company’s 2024 Form 10-K.\nThe following table presents derivative instruments included in the Consolidated Balance Sheets:\nSeptember 30, 2025\nDecember 31, 2024\n(dollars in millions)\nNotional Amount\nDerivative Assets\nDerivative Liabilities\nNotional Amount\nDerivative Assets\nDerivative Liabilities\nDerivatives designated as hedging instruments:\nInterest rate contracts\n$\n72,437\n \n$\n303\n \n$\n2\n \n$\n69,077\n \n$\n402\n \n$\n5\n \nDerivatives not designated as hedging instruments:\nInterest rate contracts\n183,555\n \n189\n \n487\n \n171,193\n \n160\n \n905\n \nForeign exchange contracts\n42,050\n \n563\n \n399\n \n34,749\n \n472\n \n411\n \nCommodities contracts\n1,213\n \n438\n \n381\n \n1,136\n \n429\n \n379\n \nTBA contracts\n5,034\n \n7\n \n13\n \n2,714\n \n10\n \n8\n \nOther contracts\n1,221\n \n23\n \n4\n \n615\n \n3\n \n2\n \nTotal derivatives not designated as hedging instruments\n233,073\n \n1,220\n \n1,284\n \n210,407\n \n1,074\n \n1,705\n \nTotal gross derivatives\n305,510\n \n1,523\n \n1,286\n \n279,484\n \n1,476\n \n1,710\n \nLess: Gross amounts offset in the Consolidated Balance Sheets\n(1)\n(\n379\n)\n(\n379\n)\n(\n391\n)\n(\n391\n)\nLess: Cash collateral applied\n(1)\n(\n423\n)\n(\n169\n)\n(\n677\n)\n(\n99\n)\nTotal net derivatives presented in the Consolidated Balance Sheets\n$\n721\n \n$\n738\n \n$\n408\n \n$\n1,220\n \n(1) \nAmounts represent the impact of enforceable master netting agreements that allow the Company to net settle positive and negative positions, as well as collateral paid and received.\nThe Company’s derivative transactions are internally divided into three sub-groups: institutional, customer facilitation, and residential loan. Certain derivative transactions within these sub-groups are designated as fair value or cash flow hedges, as described below:\nDerivatives Designated As Hedging Instruments\nThe Company’s institutional derivatives qualify for hedge accounting treatment. The net interest accruals on interest rate swaps designated in a fair value or cash flow hedge relationship are treated as an adjustment to interest income or interest expense of the hedged item. All hedging relationships are formally documented at inception, as well as risk management objectives and strategies for undertaking various accounting hedges. In addition, the effectiveness of hedge relationships is monitored during the duration of the hedge period. The methods utilized to assess hedge effectiveness vary based on the hedge relationship, with each relationship monitored to ensure that management’s initial intent continues to be satisfied. Hedge accounting treatment is discontinued when the derivative is terminated or when it is determined that a derivative is not expected to be, or has ceased to be, an effective hedge. Changes in the fair value of a derivative are reflected in earnings after termination of the hedge relationship.\nCitizens Financial Group, Inc. | 64\nFair Value Hedges\nIn a fair value hedge, changes in the fair value of both the derivative instrument and the hedged asset or liability attributable to the risk being hedged are recognized in the same income statement line item in the Consolidated Statements of Operations when the changes in fair value occur. At September 30, 2025 and December 31, 2024, the Company has designated $\n4.7\n billion of interest rate swaps as fair value hedges of its fixed-rate prepayable AFS securities using the portfolio layer method. This approach allows the Company to designate as the hedged item a stated amount of the assets that are not expected to be affected by prepayments, defaults, and other factors affecting the timing and amount of cash flows. At September 30, 2025 and December 31, 2024, the Company has also designated $\n3.6\n billion and $\n3.1\n billion, respectively, of interest rate swaps as fair value hedges to manage interest rate risk within its nonprepayable fixed-rate AFS securities portfolio.\nThe following table presents the effect of fair value hedges on the Consolidated Statements of Operations and the respective line items affected for each hedged item:\nLocation and Amount of Gains (Losses) Recognized\nInterest Income\nInterest Expense\n(dollars in millions)\nInvestment Securities\nLong-Term Borrowed Funds\nThree Months Ended September 30, 2025\nGains (losses) on fair value hedges recognized on:\nHedged items\n$\n12\n \n($\n3\n)\nDerivatives\n(\n12\n)\n3\n \nAmounts related to interest settlements on derivatives\n14\n \n(\n3\n)\nTotal net interest income recognized on fair value hedges\n$\n14\n \n($\n3\n)\nThree Months Ended September 30, 2024\nGains (losses) on fair value hedges recognized on:\nHedged items\n$\n302\n \n($\n8\n)\nDerivatives\n(\n306\n)\n8\n \nAmounts related to interest settlements on derivatives\n34\n \n(\n4\n)\nTotal net interest income recognized on fair value hedges\n$\n30\n \n($\n4\n)\nNine Months Ended September 30, 2025\nGains (losses) on fair value hedges recognized on:\nHedged items\n$\n178\n \n($\n7\n)\nDerivatives\n(\n180\n)\n7\n \nAmounts related to interest settlements on derivatives\n38\n \n(\n8\n)\nTotal net interest income recognized on fair value hedges\n$\n36\n \n($\n8\n)\nNine Months Ended September 30, 2024\nGains (losses) on fair value hedges recognized on:\nHedged items\n$\n128\n \n($\n8\n)\nDerivatives\n(\n127\n)\n8\n \nAmounts related to interest settlements on derivatives\n87\n \n(\n11\n)\nTotal net interest income recognized on fair value hedges\n$\n88\n \n($\n11\n)\nThe following table reflects amounts recorded in the Consolidated Balance Sheets related to cumulative basis adjustments for fair value hedges:\n    \n(dollars in millions)\nSeptember 30, 2025\nDecember 31, 2024\nDebt securities available for sale\n(1)\nLong-term borrowed funds\nDebt securities available for sale\n(1)\nLong-term borrowed funds\nCarrying amount of hedged assets\n(2)\n$\n9,728\n \n$— \n$\n9,557\n \n$— \nCarrying amount of hedged liabilities\n— \n499\n \n— \n491\n \nCumulative amount of fair value hedging adjustments included in the carrying amount of the hedged items\n83\n \n(\n1\n)\n(\n97\n)\n(\n8\n)\n(1)  \nIncludes the amortized cost basis of closed portfolios used to designate hedging relationships under the portfolio layer method. The hedged item is a layer of the closed portfolio which is expected to be remaining at the end of the hedging relationship. As of September 30, 2025 and December 31, 2024, the amortized cost basis of the closed portfolios used in these hedging relationships was $\n6.0\n billion and $\n6.4\n billion, respectively, including associated cumulative basis adjustments of $\n37\n million and $(\n75\n) million, respectively. The amount of the designated hedging instruments was $\n4.7\n billion at September 30, 2025 and December 31, 2024.\n(2)  \nCarrying amount represents amortized cost.\nCitizens Financial Group, Inc. | 65\nCash Flow Hedges\nIn a cash flow hedge the entire change in the fair value of the interest rate swap included in the assessment of hedge effectiveness is initially recorded in OCI and is subsequently reclassified from AOCI into earnings in the period during which the hedged item affects earnings.\nThe Company enters into interest rate swap agreements designed primarily to hedge a portion of its floating-rate assets and liabilities. All of these swaps are deemed highly effective cash flow hedges. From time to time, the Company may also enter into certain interest rate option agreements that utilize interest rate floors and/or caps. Option premiums paid and received are excluded from the assessment of hedge effectiveness and are amortized over the life of the instruments.\nDuring the first quarter of 2025, the Company entered into a cash flow hedge with a notional amount of $\n1.5\n billion to manage the variability in cash flows related to the sale of Non-Core education loans, which will settle ratably each quarter throughout 2025. During the third quarter of 2025, the Company terminated $\n466\n million of this cash flow hedge in conjunction with the quarterly settlement of the education loan sale. \nThe following table presents the pre-tax net gains (losses) recorded in the Consolidated Statements of Operations and in the Consolidated Statements of Comprehensive Income related to derivative instruments designated as cash flow hedges:\nThree Months Ended September 30,\nNine Months Ended September 30,\n(dollars in millions)\n2025\n2024\n2025\n2024\nPre-tax net gains (losses) recognized in OCI\n($\n21\n)\n$\n613\n \n$\n376\n \n($\n114\n)\nPre-tax net gains (losses) reclassified from AOCI into interest income\n(\n193\n)\n(\n276\n)\n(\n591\n)\n(\n711\n)\nPre-tax net gains (losses) reclassified from AOCI into noninterest income\n(\n4\n)\n—\n \n(\n5\n)\n—\n \nPre-tax net gains (losses) reclassified from AOCI into interest expense\n—\n \n—\n \n(\n1\n)\n—\n \nUsing the September 30, 2025 interest rate curve, the Company estimates that $\n396\n million in pre-tax net losses related to cash flow hedge strategies will be reclassified from AOCI to earnings over the next 12 months. These losses could differ from amounts recognized due to changes in interest rates, hedge de-designations, or the addition of other hedges after September 30, 2025.\nDerivatives Not Designated As Hedging Instruments\nThe Company offers derivatives to customers in connection with their risk management needs consisting primarily of interest rate, foreign exchange, and commodity contracts. Market risk exposure from customer transactions is primarily managed by entering into a variety of hedging transactions with third-party dealers. Gains and losses on customer-related derivatives are reported in Foreign exchange and derivatives products in the Consolidated Statements of Operations.\nDuring the second quarter of 2025, the Company entered into at-the-market equity offering programs to facilitate capital market activities for customers. These programs involve the concurrent short sale of an equity security and the execution of a forward purchase contract for the same equity security. The forward purchase contract economically hedges the Company’s short sale position and will be closed against such position when a program concludes. Changes in fair value related to the forward purchase contracts are reported in Capital markets fees in the Consolidated Statements of Operations. \nResidential mortgage loans that will be sold in the secondary market and the related loan commitments, which are considered derivatives, are accounted for at fair value. Forward contracts to sell mortgage-backed securities are utilized to hedge the fair value of the loans and related commitments. Gains and losses on the loans and related commitments, and the derivatives used to economically hedge them, are reported in Mortgage banking fees in the Consolidated Statements of Operations.\nResidential MSRs are accounted for at fair value. Derivatives utilized to hedge the fair value of residential MSRs include interest rate futures, swaps, options, and forward contracts to purchase mortgage-backed securities. Gains and losses on residential MSRs and the related derivatives are reported in Mortgage banking fees in the Consolidated Statements of Operations.\nCitizens Financial Group, Inc. | 66\nThe following table presents the effect of economic hedges on noninterest income:\nAmounts Recognized in \nNoninterest Income for the\nThree Months Ended September 30,\nNine Months Ended September 30,\nAffected Line Item in the Consolidated Statements of Operations\n(dollars in millions)\n2025\n2024\n2025\n2024\nEconomic hedge type:\nCustomer interest rate contracts\n($\n17\n)\n$\n474\n \n$\n218\n \n($\n209\n)\nForeign exchange and derivative products\nDerivatives hedging interest rate risk\n29\n \n(\n467\n)\n(\n190\n)\n233\n \nForeign exchange and derivative products\nCustomer foreign exchange contracts\n(\n72\n)\n151\n \n345\n \n18\n \nForeign exchange and derivative products\nDerivatives hedging foreign exchange risk\n107\n \n(\n195\n)\n(\n423\n)\n(\n13\n)\nForeign exchange and derivative products\nCustomer commodity contracts\n(\n122\n)\n(\n193\n)\n(\n81\n)\n(\n126\n)\nForeign exchange and derivative products\nDerivatives hedging commodity price risk\n125\n \n198\n \n96\n \n141\n \nForeign exchange and derivative products\nResidential loan commitments\n4\n \n9\n \n13\n \n2\n \nMortgage banking fees\nDerivatives hedging residential loan commitments and mortgage loans held for sale, at fair value\n(\n14\n)\n(\n24\n)\n(\n28\n)\n(\n15\n)\nMortgage banking fees\nDerivative contracts used to hedge residential MSRs\n(\n1\n)\n47\n \n26\n \n(\n9\n)\nMortgage banking fees\nDerivative contracts used to hedge equity price risk\n4\n \n—\n \n15\n \n—\n \nCapital markets fees\nTotal\n$\n43\n \n$\n—\n \n($\n9\n)\n$\n22\n \nCitizens Financial Group, Inc. | 67\nNOTE 9 - ACCUMULATED OTHER COMPREHENSIVE INCOME (LOSS) \nThe following table summarizes the components of the Company’s OCI:\n(dollars in millions)\nPre-tax\nTax Effect\nAfter-tax\nThree Months Ended September 30, 2025\nNet unrealized gains (losses) on cash flow hedges arising during the period\n($\n21\n)\n$\n5\n \n($\n16\n)\nReclassification of net (gains) losses on cash flow hedges to earnings\n197\n \n(\n53\n)\n144\n \nNet unrealized gains (losses) on cash flow hedges\n176\n \n(\n48\n)\n128\n \nNet unrealized gains (losses) on AFS securities arising during the period\n300\n \n(\n77\n)\n223\n \nReclassification of net (gains) losses on investment securities to earnings\n24\n \n(\n6\n)\n18\n \nNet unrealized gains (losses) on investment securities\n324\n \n(\n83\n)\n241\n \nNet actuarial gain (loss) arising during the period\n—\n \n—\n \n—\n \nAmortization of actuarial (gain) loss to earnings\n4\n \n(\n1\n)\n3\n \nDefined benefit plans\n4\n \n(\n1\n)\n3\n \nTotal other comprehensive income (loss)\n$\n504\n \n($\n132\n)\n$\n372\n \nThree Months Ended September 30, 2024\nNet unrealized gains (losses) on cash flow hedges arising during the period\n$\n613\n \n($\n163\n)\n$\n450\n \nReclassification of net (gains) losses on cash flow hedges to earnings\n276\n \n(\n73\n)\n203\n \nNet unrealized gains (losses) on cash flow hedges\n889\n \n(\n236\n)\n653\n \nNet unrealized gains (losses) on AFS securities arising during the period\n720\n \n(\n179\n)\n541\n \nReclassification of net (gains) losses on investment securities to earnings\n18\n \n(\n5\n)\n13\n \nNet unrealized gains (losses) on investment securities\n738\n \n(\n184\n)\n554\n \nNet actuarial gain (loss) arising during the period\n—\n \n—\n \n—\n \nAmortization of actuarial (gain) loss to earnings\n3\n \n(\n1\n)\n2\n \nDefined benefit plans\n3\n \n(\n1\n)\n2\n \nTotal other comprehensive income (loss)\n$\n1,630\n \n($\n421\n)\n$\n1,209\n \nNine Months Ended September 30, 2025\nNet unrealized gains (losses) on cash flow hedges arising during the period\n$\n376\n \n($\n101\n)\n$\n275\n \nReclassification of net (gains) losses on cash flow hedges to earnings\n597\n \n(\n160\n)\n437\n \nNet unrealized gains (losses) on cash flow hedges\n973\n \n(\n261\n)\n712\n \nNet unrealized gains (losses) on AFS securities arising during the period\n753\n \n(\n192\n)\n561\n \nReclassification of net (gains) losses on investment securities to earnings\n64\n \n(\n16\n)\n48\n \nNet unrealized gains (losses) on investment securities\n817\n \n(\n208\n)\n609\n \nNet actuarial gain (loss) arising during the period\n—\n \n—\n \n—\n \nAmortization of actuarial (gain) loss to earnings\n10\n \n(\n3\n)\n7\n \nDefined benefit plans\n10\n \n(\n3\n)\n7\n \nTotal other comprehensive income (loss)\n$\n1,800\n \n($\n472\n)\n$\n1,328\n \nNine Months Ended September 30, 2024\nNet unrealized gains (losses) on cash flow hedges arising during the period\n($\n114\n)\n$\n30\n \n($\n84\n)\nReclassification of net (gains) losses on cash flow hedges to earnings\n711\n \n(\n189\n)\n522\n \nNet unrealized gains (losses) on cash flow hedges\n597\n \n(\n159\n)\n438\n \nNet unrealized gains (losses) on AFS securities arising during the period\n453\n \n(\n114\n)\n339\n \nReclassification of net (gains) losses on investment securities to earnings\n56\n \n(\n14\n)\n42\n \nNet unrealized gains (losses) on investment securities\n509\n \n(\n128\n)\n381\n \nNet actuarial gain (loss) arising during the period\n5\n \n(\n1\n)\n4\n \nAmortization of actuarial (gain) loss to earnings\n12\n \n(\n3\n)\n9\n \nDefined benefit plans\n17\n \n(\n4\n)\n13\n \nTotal other comprehensive income (loss)\n$\n1,123\n \n($\n291\n)\n$\n832\n \nCitizens Financial Group, Inc. | 68\nThe following table summarizes the activity in each component of AOCI, net of income taxes:\n(dollars in millions)\nNet Unrealized Gains (Losses) on Cash Flow Hedges\nNet Unrealized Gains (Losses) on Investment Securities\nDefined Benefit Plans\nTotal AOCI\nThree Months Ended September 30, 2025\nBalance at July 1, 2025\n($\n341\n)\n($\n2,001\n)\n($\n297\n)\n($\n2,639\n)\nOther comprehensive income (loss) before reclassifications\n(\n16\n)\n223\n \n—\n \n207\n \nAmounts reclassified from AOCI to earnings\n144\n \n18\n \n3\n \n165\n \nTotal other comprehensive income (loss)\n128\n \n241\n \n3\n \n372\n \nBalance at September 30, 2025\n($\n213\n)\n($\n1,760\n)\n($\n294\n)\n($\n2,267\n)\nThree Months Ended September 30, 2024\nBalance at July 1, 2024\n($\n1,302\n)\n($\n2,511\n)\n($\n322\n)\n($\n4,135\n)\nOther comprehensive income (loss) before reclassifications\n450\n \n541\n \n—\n \n991\n \nAmounts reclassified from AOCI to earnings\n203\n \n13\n \n2\n \n218\n \nTotal other comprehensive income (loss)\n653\n \n554\n \n2\n \n1,209\n \nBalance at September 30, 2024\n($\n649\n)\n($\n1,957\n)\n($\n320\n)\n($\n2,926\n)\nNine Months Ended September 30, 2025\nBalance at January 1, 2025\n($\n925\n)\n($\n2,369\n)\n($\n301\n)\n($\n3,595\n)\nOther comprehensive income (loss) before reclassifications\n275\n \n561\n \n—\n \n836\n \nAmounts reclassified from AOCI to earnings\n437\n \n48\n \n7\n \n492\n \nTotal other comprehensive income (loss)\n712\n \n609\n \n7\n \n1,328\n \nBalance at September 30, 2025\n($\n213\n)\n($\n1,760\n)\n($\n294\n)\n($\n2,267\n)\nNine Months Ended September 30, 2024\nBalance at January 1, 2024\n($\n1,087\n)\n($\n2,338\n)\n($\n333\n)\n($\n3,758\n)\nOther comprehensive income (loss) before reclassifications\n(\n84\n)\n339\n \n4\n \n259\n \nAmounts reclassified from AOCI to earnings\n522\n \n42\n \n9\n \n573\n \nTotal other comprehensive income (loss)\n438\n \n381\n \n13\n \n832\n \nBalance at September 30, 2024\n($\n649\n)\n($\n1,957\n)\n($\n320\n)\n($\n2,926\n)\nPrimary location in the Consolidated Statements of Operations of amounts reclassified from AOCI\nNet interest income\nSecurities gains, net and Net interest income\nOther operating expense\nNOTE 10 - STOCKHOLDERS’ EQUITY \nPreferred Stock\nThe following table summarizes the Company’s preferred stock:\n \nSeptember 30, 2025\nDecember 31, 2024\n(dollars in millions, except per share data)\nLiquidation value per share\nPreferred Shares\nCarrying Amount\nPreferred Shares\nCarrying Amount\nAuthorized ($\n25\n par value per share)\n100,000,000\n \n100,000,000\n \nIssued and outstanding:\nSeries B\n$\n1,000\n \n300,000\n \n$\n296\n \n300,000\n \n$\n296\n \nSeries C\n1,000\n \n300,000\n \n297\n \n300,000\n \n297\n \nSeries E\n1,000\n \n(1)\n450,000\n \n(2)\n437\n \n450,000\n \n437\n \nSeries F\n1,000\n \n—\n \n—\n \n400,000\n \n395\n \nSeries G\n1,000\n \n300,000\n \n296\n \n300,000\n \n296\n \nSeries H\n1,000\n \n(1)\n400,000\n \n(3)\n392\n \n400,000\n \n392\n \nSeries I\n1,000\n \n(1)\n400,000\n \n(4)\n393\n \n—\n \n—\n \nTotal\n2,150,000\n \n$\n2,111\n \n2,150,000\n \n$\n2,113\n \n(1) \nEquivalent to $\n25\n per depositary share.\n(2) \nRepresented by \n18,000,000\n depositary shares each representing a 1/40th interest in the Series E Preferred Stock.\n(3) \nRepresented by \n16,000,000\n depositary shares each representing a 1/40th interest in the Series H Preferred Stock.\n(4) \nRepresented by \n16,000,000\n depositary shares each representing a 1/40th interest in the Series I Preferred Stock.\nCitizens Financial Group, Inc. | 69\nOn July 31, 2025, the Company issued $\n400\n million, or \n400,000\n shares, of \n6.500\n% fixed-rate reset non-cumulative perpetual Series I Preferred Stock, par value of $\n25\n per share with a liquidation preference of $\n1,000\n per share (the “Series I Preferred Stock”). As a result of this issuance, the Company received net proceeds of $\n393\n million after underwriting fees and other expenses. The Series I Preferred Stock has no stated maturity and will not be subject to any sinking fund or other obligation of the Company. The Series I Preferred Stock is redeemable at the Company’s option, in whole or in part, on any dividend payment date on or after October 6, 2030 or, in whole but not in part, at any time within the \n90\n days following a regulatory capital treatment event at a redemption price equal to $\n1,000\n per share, plus any declared and unpaid dividends. The Company may not redeem shares of the Series I Preferred Stock without the prior approval of the FRB or other appropriate federal banking agency as required under applicable capital rules. Except in limited circumstances or otherwise required by law, holders of the Series I Preferred Stock do not have any voting rights.\nIn September 2025, the Company provided notice of its intent to redeem all outstanding shares of the \n5.650\n% fixed-rate reset non-cumulative perpetual Series F Preferred Stock on October 6, 2025. Upon providing notice, the Series F Preferred Stock was reclassified from Preferred stock to Other liabilities in the Consolidated Balance Sheets. On October 6, 2025, the Company redeemed all outstanding shares of the Series F Preferred Stock at a redemption price of $\n1,000\n per share.\n \nFor further detail regarding the terms and conditions of the Company’s preferred stock, see Note 17 in the Company’s 2024 Form 10-K.\nDividends\nThe following tables summarize the Company’s common and preferred stock dividend activity:\nThree Months Ended September 30, 2025\nThree Months Ended September 30, 2024\n(dollars in millions, except per share data)\nDividends Declared per Share\nDividends Declared\nDividends Paid\nDividends Declared per Share\nDividends Declared\nDividends Paid\nCommon stock\n$\n0.42\n \n$\n184\n \n$\n184\n \n$\n0.42\n \n$\n190\n \n$\n190\n \nPreferred stock\nSeries B\n$\n19.07\n \n$\n5\n \n$\n5\n \n$\n21.68\n \n$\n6\n \n$\n7\n \nSeries C\n19.46\n \n5\n \n6\n \n22.07\n \n6\n \n6\n \nSeries D\n—\n \n—\n \n—\n \n—\n \n—\n \n7\n \nSeries E\n12.50\n \n6\n \n6\n \n12.50\n \n6\n \n6\n \nSeries F\n14.13\n \n6\n \n6\n \n14.13\n \n6\n \n6\n \nSeries G\n10.00\n \n3\n \n3\n \n10.00\n \n3\n \n3\n \nSeries H\n18.43\n \n7\n \n7\n \n27.25\n \n11\n \n—\n \nTotal preferred stock\n$\n32\n \n$\n33\n \n$\n38\n \n$\n35\n \nNine Months Ended September 30, 2025\nNine Months Ended September 30, 2024\n(dollars in millions, except per share data)\nDividends Declared per Share\nDividends Declared\nDividends Paid\nDividends Declared per Share\nDividends Declared\nDividends Paid\nCommon stock\n$\n1.26\n \n$\n555\n \n$\n555\n \n$\n1.26\n \n$\n581\n \n$\n581\n \nPreferred stock\nSeries B\n$\n57.26\n \n$\n17\n \n$\n17\n \n$\n65.06\n \n$\n19\n \n$\n20\n \nSeries C\n58.43\n \n17\n \n18\n \n60.54\n \n18\n \n16\n \nSeries D\n—\n \n—\n \n—\n \n39.66\n \n12\n \n17\n \nSeries E\n37.50\n \n17\n \n17\n \n37.50\n \n17\n \n17\n \nSeries F\n42.38\n \n17\n \n17\n \n42.38\n \n17\n \n17\n \nSeries G\n30.00\n \n9\n \n9\n \n30.00\n \n9\n \n9\n \nSeries H\n55.31\n \n22\n \n22\n \n27.25\n \n11\n \n—\n \nTotal preferred stock\n$\n99\n \n$\n100\n \n$\n103\n \n$\n96\n \nTreasury Stock\nDuring the nine months ended September 30, 2025 and 2024, the Company repurchased $\n475\n million, or \n11,129,200\n shares, and $\n825\n million, or \n23,006,560\n shares, respectively, of its outstanding common stock, which are held in treasury stock.\nCitizens Financial Group, Inc. | 70\nNOTE 11 - COMMITMENTS AND CONTINGENCIES \nA summary of outstanding off-balance sheet arrangements is presented below. For more information on these arrangements, see Note 19 in the Company’s 2024 Form 10-K. \n(dollars in millions)\nSeptember 30, 2025\nDecember 31, 2024\nCommitments to extend credit\n$\n100,650\n \n$\n93,460\n \nLetters of credit\n1,901\n \n1,845\n \nLoans sold with recourse\n89\n \n93\n \nRisk participation agreements\n29\n \n1\n \nOther commitments\n11\n \n14\n \nTotal\n$\n102,680\n \n$\n95,413\n \nCommitments to Extend Credit\nCommitments to extend credit are agreements to lend to customers in accordance with conditions contractually agreed upon in advance. These commitments generally have fixed expiration dates or termination clauses and may require payment of a fee. Since many of these commitments are expected to expire without being drawn upon, the contract amounts are not necessarily indicative of future cash requirements.\nLetters of Credit\n \nLetters of credit in the table above reflect commercial, standby financial, and standby performance letters of credit. Financial and performance standby letters of credit are issued by the Company for the benefit of its customers. They are used as conditional guarantees of payment to a third party in the event the customer either fails to make specific payments (financial) or fails to complete a specific project (performance). The Company’s exposure to credit loss in the event of counterparty nonperformance in connection with the above instruments is represented by the contractual amount of those instruments. Letters of credit are generally secured, with collateral including, but not limited to, cash, accounts receivable, inventory, or investment securities. Credit risk associated with letters of credit is considered in determining the appropriate amount of the allowance for unfunded commitments. Standby and commercial letters of credit are issued for terms of up to \ntwo years\n and \none year\n, respectively. \nLoans Sold with Recourse\nThe Company is an originator and servicer of residential mortgages and routinely sells such mortgage loans in the secondary market and to GSEs. In the context of such sales, the Company makes certain representations and warranties regarding the characteristics of the underlying loans and, as a result, may be contractually required to repurchase such loans or indemnify certain parties against losses for certain breaches of those representations and warranties. The Company also sells the government guaranteed portion of certain SBA loans to outside investors, for which it retains the servicing rights.\nRisk Participation Agreements\nRPAs are guarantees issued by the Company to other parties for a fee, whereby the Company agrees to participate in the credit risk of a derivative customer of the other party. The current amount of credit exposure is spread out over multiple counterparties. At September 30, 2025, the remaining terms on these RPAs ranged from less than \none year\n to \nten years\n.\nContingencies\nThe Company operates in a legal and regulatory environment that exposes it to potentially significant risks. A certain amount of litigation ordinarily results from the nature of the Company’s banking and other businesses. The Company is a party to legal proceedings, including class actions. The Company is also the subject of investigations, reviews, subpoenas, and regulatory matters arising out of its normal business operations which, in some instances, relate to concerns about fair lending, unfair and/or deceptive practices, and mortgage-related issues. In addition, the Company engages in discussions with relevant governmental and regulatory authorities on a regular and ongoing basis regarding various issues, and any issues discussed or identified may result in investigatory or other action being taken. Litigation and regulatory matters may result in settlements, damages, fines, penalties, public or private censure, increased costs, required remediation, restrictions on business activities, or other impacts on the Company.\nCitizens Financial Group, Inc. | 71\nIn these disputes and proceedings, the Company contests liability and the amount of damages as appropriate. Given their complex nature, and based on the Company's experience, it may be years before some of these matters are resolved. Moreover, before liability can be reasonably estimated for a claim, numerous legal and factual issues may need to be examined, including through potentially lengthy discovery and determination of important factual matters, and by addressing novel or unsettled legal issues relevant to the proceedings in question. The Company cannot predict with certainty if, how, or when such claims will be resolved or what the eventual settlement, fine, penalty, or other relief, if any, may be, particularly for claims that are at an early stage in their development or where claimants seek substantial or indeterminate damages. The Company recognizes a provision for a claim when, in the opinion of management after seeking legal advice, it is probable that a liability exists and the amount of loss can be reasonably estimated. In many proceedings, however, it is not possible to determine whether any loss is probable or to estimate the amount of any loss. \nBased on information currently available, the advice of legal counsel and other advisers, and established reserves, management believes that the aggregate liabilities, if any, potentially arising from these proceedings will not have a materially adverse effect on the Company’s unaudited interim Consolidated Financial Statements.\nNOTE 12 - FAIR VALUE MEASUREMENTS \nThe Company measures or monitors many of its assets and liabilities on a fair value basis. Fair value is used on a recurring basis for assets and liabilities for which fair value is the required or elected measurement basis of accounting. Fair value is also used on a nonrecurring basis to evaluate assets for impairment or for disclosure purposes. Nonrecurring fair value adjustments typically involve the application of lower of cost or market accounting or write-downs of individual assets. Fair value measurement guidance is also applied to disclosures in this Note related to assets and liabilities that are not required to be reported at fair value in the financial statements.\nFor more information on the measurement of fair value for the Company’s assets and liabilities, including the election of the fair value option and valuation techniques utilized to measure fair value on a recurring and nonrecurring basis, see Note 20 in the Company’s 2024 Form 10-K.\nFair Value Option\n \nThe Company has elected to account for residential mortgage LHFS and certain commercial LHFS at fair value. \nThe following table presents the difference between the aggregate fair value and the aggregate unpaid principal balance of LHFS measured at fair value:\nSeptember 30, 2025\nDecember 31, 2024\n(dollars in millions)\nAggregate Fair Value\nAggregate Unpaid Principal\nAggregate Fair Value Greater (Less) Than Aggregate Unpaid Principal\nAggregate Fair Value\nAggregate Unpaid Principal\nAggregate Fair Value Greater (Less) Than Aggregate Unpaid Principal\nResidential mortgage loans held for sale\n$\n592\n \n$\n573\n \n$\n19\n \n$\n633\n \n$\n625\n \n$\n8\n \nCommercial loans held for sale\n176\n \n186\n \n(\n10\n)\n192\n \n199\n \n(\n7\n)\nCitizens Financial Group, Inc. | 72\nRecurring Fair Value Measurements\nThe Company utilizes a variety of valuation techniques to measure its assets and liabilities at fair value on a recurring basis. \nThe following table presents assets and liabilities measured at fair value, including gross derivative assets and liabilities, on a recurring basis at September 30, 2025:\n(dollars in millions)\nTotal\nLevel 1\nLevel 2\nLevel 3\nDebt securities available for sale:\nMortgage-backed securities\n$\n30,814\n \n$\n—\n \n$\n30,814\n \n$\n—\n \nCollateralized loan obligations\n90\n \n—\n \n90\n \n—\n \nState and political subdivisions\n1\n \n—\n \n1\n \n—\n \nU.S. Treasury and other\n4,514\n \n4,514\n \n—\n \n—\n \nTotal debt securities available for sale\n35,419\n \n4,514\n \n30,905\n \n—\n \nLoans held for sale:\nResidential loans held for sale\n592\n \n—\n \n592\n \n—\n \nCommercial loans held for sale\n176\n \n—\n \n176\n \n—\n \nTotal loans held for sale, at fair value\n768\n \n—\n \n768\n \n—\n \nMortgage servicing rights\n1,430\n \n—\n \n—\n \n1,430\n \nDerivative assets:\nInterest rate contracts\n492\n \n—\n \n492\n \n—\n \nForeign exchange contracts\n563\n \n—\n \n563\n \n—\n \nCommodities contracts\n438\n \n—\n \n438\n \n—\n \nTBA contracts\n7\n \n—\n \n7\n \n—\n \nOther contracts\n23\n \n—\n \n15\n \n8\n \nTotal derivative assets\n1,523\n \n—\n \n1,515\n \n8\n \nEquity securities, at fair value\n(1)\n224\n \n224\n \n—\n \n—\n \nShort-term investments\n73\n \n30\n \n43\n \n—\n \nTotal assets\n$\n39,437\n \n$\n4,768\n \n$\n33,231\n \n$\n1,438\n \nDerivative liabilities:\nInterest rate contracts\n$\n489\n \n$\n—\n \n$\n489\n \n$\n—\n \nForeign exchange contracts\n399\n \n—\n \n399\n \n—\n \nCommodities contracts\n381\n \n—\n \n381\n \n—\n \nTBA contracts\n13\n \n—\n \n13\n \n—\n \nOther contracts\n4\n \n—\n \n—\n \n4\n \nTotal derivative liabilities\n1,286\n \n—\n \n1,282\n \n4\n \nShort-term borrowed funds\n213\n \n203\n \n10\n \n—\n \nOther liabilities\n162\n \n—\n \n162\n \n—\n \nTotal liabilities\n$\n1,661\n \n$\n203\n \n$\n1,454\n \n$\n4\n \n(1)\n Excludes investments of $\n62\n million included in Other assets in the Consolidated Balance Sheets that are measured at fair value using the net asset value per share (or its equivalent) practical expedient. These investments include capital contributions to private investment funds and have unfunded capital commitments of $\n17\n million at September 30, 2025, which may be called at any time during prescribed time periods. The credit exposure is generally limited to the carrying amount of investments made and unfunded capital commitments.\nCitizens Financial Group, Inc. | 73\nThe following table presents assets and liabilities measured at fair value, including gross derivative assets and liabilities, on a recurring basis at December 31, 2024:\n(dollars in millions)\nTotal\nLevel 1\nLevel 2\nLevel 3\nDebt securities available for sale:\nMortgage-backed securities\n$\n29,055\n \n$\n—\n \n$\n29,055\n \n$\n—\n \nCollateralized loan obligations\n184\n \n—\n \n184\n \n—\n \nState and political subdivisions\n1\n \n—\n \n1\n \n—\n \nU.S. Treasury and other\n3,525\n \n3,525\n \n—\n \n—\n \nTotal debt securities available for sale\n32,765\n \n3,525\n \n29,240\n \n—\n \nLoans held for sale:\nResidential loans held for sale\n633\n \n—\n \n633\n \n—\n \nCommercial loans held for sale\n192\n \n—\n \n192\n \n—\n \nTotal loans held for sale, at fair value\n825\n \n—\n \n825\n \n—\n \nMortgage servicing rights\n1,491\n \n—\n \n—\n \n1,491\n \nDerivative assets:\nInterest rate contracts\n562\n \n—\n \n562\n \n—\n \nForeign exchange contracts\n472\n \n—\n \n472\n \n—\n \nCommodities contracts\n429\n \n—\n \n429\n \n—\n \nTBA contracts\n10\n \n—\n \n10\n \n—\n \nOther contracts\n3\n \n—\n \n—\n \n3\n \nTotal derivative assets\n1,476\n \n—\n \n1,473\n \n3\n \nEquity securities, at fair value\n(1)\n162\n \n162\n \n—\n \n—\n \nShort-term investments\n53\n \n40\n \n13\n \n—\n \nTotal assets\n$\n36,772\n \n$\n3,727\n \n$\n31,551\n \n$\n1,494\n \nDerivative liabilities:\nInterest rate contracts\n$\n910\n \n$\n—\n \n$\n910\n \n$\n—\n \nForeign exchange contracts\n411\n \n—\n \n411\n \n—\n \nCommodities contracts\n379\n \n—\n \n379\n \n—\n \nTBA contracts\n8\n \n—\n \n8\n \n—\n \nOther contracts\n2\n \n—\n \n—\n \n2\n \nTotal derivative liabilities\n1,710\n \n—\n \n1,708\n \n2\n \nShort-term borrowed funds\n—\n \n—\n \n—\n \n—\n \nOther liabilities\n101\n \n—\n \n101\n \n—\n \nTotal liabilities\n$\n1,811\n \n$\n—\n \n$\n1,809\n \n$\n2\n \n(1)\n Excludes investments of $\n58\n million included in Other assets in the Consolidated Balance Sheets that are measured at fair value using the net asset value per share (or its equivalent) practical expedient. These investments include capital contributions to private investment funds and have unfunded capital commitments of $\n24\n million at December 31, 2024, which may be called at any time during prescribed time periods. The credit exposure is generally limited to the carrying amount of investments made and unfunded capital commitments.\nCitizens Financial Group, Inc. | 74\nThe following tables present a roll forward of assets and liabilities measured at fair value on a recurring basis and classified as Level 3: \nThree Months Ended September 30, 2025\nNine Months Ended September 30, 2025\n(dollars in millions)\nMortgage Servicing Rights\nOther Derivative Contracts\nMortgage Servicing Rights\nOther Derivative Contracts\nBeginning balance\n$\n1,426\n \n$\n15\n \n$\n1,491\n \n$\n1\n \nIssuances\n42\n \n21\n \n117\n \n55\n \nSales\n(1)\n—\n \n—\n \n(\n72\n)\n—\n \nSettlements\n(2)\n(\n41\n)\n(\n33\n)\n(\n120\n)\n(\n60\n)\nChanges in fair value recognized in earnings\n(3)\n3\n \n1\n \n14\n \n8\n \nEnding balance\n$\n1,430\n \n$\n4\n \n$\n1,430\n \n$\n4\n \nThree Months Ended September 30, 2024\nNine Months Ended September 30, 2024\n(dollars in millions)\nMortgage Servicing Rights\nOther Derivative Contracts\nMortgage Servicing Rights\nOther Derivative Contracts\nBeginning balance\n$\n1,568\n \n$\n6\n \n$\n1,552\n \n$\n7\n \nIssuances\n28\n \n18\n \n71\n \n47\n \nSettlements\n(2)\n(\n46\n)\n(\n27\n)\n(\n135\n)\n(\n50\n)\nChanges in fair value recognized in earnings\n(3)\n(\n49\n)\n—\n \n13\n \n(\n7\n)\nEnding balance\n$\n1,501\n \n($\n3\n)\n$\n1,501\n \n($\n3\n)\n(1)\n For MSRs, represents the sale of the excess servicing yield on MSRs.\n(2)\n For MSRs, represents changes in value of the MSRs due to i) the passage of time including the impact from both regularly scheduled loan principal payments and partial paydowns, and ii) loans that paid off during the period. For other derivative contracts, represents the closeout of interest rate lock commitments and other cash payments.\n(3)\n Represents changes in fair value primarily driven by market conditions. These changes are recorded in Mortgage banking fees and Other income in the Consolidated Statements of Operations.\nThe following table presents quantitative information about significant unobservable inputs utilized to measure the fair value of Level 3 assets and liabilities:\nSeptember 30, 2025\nDecember 31, 2024\nFinancial Instrument\n(1)\nValuation Technique\nUnobservable Input\nRange (Weighted Average)\nRange (Weighted Average)\nMortgage servicing rights\nDiscounted Cash Flow\nConstant prepayment rate\n5.86\n-\n14.80\n% CPR (\n7.10\n% CPR)\n5.08\n-\n16.32\n% CPR (\n6.70\n% CPR)\nOption adjusted spread\n398\n-\n1,058\n bps (\n608\n bps)\n398\n-\n1,058\n bps (\n632\n bps)\nOther derivative contracts\nInternal Model\nPull through rate\n8.15\n-\n99.89\n% (\n83.07\n%)\n5.09\n-\n99.90\n% (\n83.06\n%)\nMSR value\n42.30\n-\n171.00\n bps (\n124.76\n bps)\n23.91\n-\n171.64\n bps (\n121.23\n bps)\n(1)\n Disclosures related to the fair value measurement of financial instruments deemed immaterial are not included.\n \nNonrecurring Fair Value Measurements\nFair value is also used on a nonrecurring basis to evaluate certain assets for impairment or for disclosure purposes. \nThe following table presents losses on assets measured at fair value on a nonrecurring basis and recorded in earnings:\nThree Months Ended September 30,\nNine Months Ended September 30,\n(dollars in millions)\n2025\n2024\n2025\n2024\nCollateral-dependent loans \n($\n39\n)\n($\n36\n)\n($\n124\n)\n($\n156\n)\nThe following table presents assets measured at fair value on a nonrecurring basis:\nSeptember 30, 2025\nDecember 31, 2024\n(dollars in millions)\nTotal\nLevel 1\nLevel 2\nLevel 3\nTotal\nLevel 1\nLevel 2\nLevel 3\nCollateral-dependent loans \n$\n677\n \n$\n—\n \n$\n677\n \n$\n—\n \n$\n979\n \n$\n—\n \n$\n979\n \n$\n—\n \nCitizens Financial Group, Inc. | 75\nFair Value of Financial Instruments\nThe following tables present the estimated fair value for financial instruments not recorded at fair value in the Consolidated Financial Statements. The carrying amounts are recorded in the Consolidated Balance Sheets under the indicated captions.\nSeptember 30, 2025\nTotal\nLevel 1\nLevel 2\nLevel 3\n(dollars in millions)\nCarrying Value\nEstimated Fair Value\nCarrying Value\nEstimated Fair Value\nCarrying Value\nEstimated Fair Value\nCarrying Value\nEstimated Fair Value\nFinancial assets\n(1)\n:\nDebt securities held to maturity\n$\n8,124\n \n$\n7,295\n \n$\n—\n \n$\n—\n \n$\n7,767\n \n$\n6,938\n \n$\n357\n \n$\n357\n \nLoans held for sale\n566\n \n566\n \n—\n \n—\n \n—\n \n—\n \n566\n \n566\n \nNet loans and leases\n138,898\n \n138,627\n \n—\n \n—\n \n677\n \n677\n \n138,221\n \n137,950\n \nOther assets\n710\n \n710\n \n—\n \n—\n \n689\n \n689\n \n21\n \n21\n \nFinancial liabilities:\nDeposits\n180,011\n \n179,967\n \n—\n \n—\n \n180,011\n \n179,967\n \n—\n \n—\n \nShort-term borrowed funds\n1\n \n1\n \n—\n \n—\n \n1\n \n1\n \n—\n \n—\n \nLong-term borrowed funds\n10,441\n \n10,649\n \n—\n \n—\n \n10,441\n \n10,649\n \n—\n \n—\n \nDecember 31, 2024\nTotal\nLevel 1\nLevel 2\nLevel 3\n(dollars in millions)\nCarrying Value\nEstimated Fair Value\nCarrying Value\nEstimated Fair Value\nCarrying Value\nEstimated Fair Value\nCarrying Value\nEstimated Fair Value\nFinancial assets\n(1)\n:\nDebt securities held to maturity \n$\n8,599\n \n$\n7,540\n \n$\n—\n \n$\n—\n \n$\n8,187\n \n$\n7,136\n \n$\n412\n \n$\n404\n \nLoans held for sale\n33\n \n33\n \n—\n \n—\n \n—\n \n—\n \n33\n \n33\n \nNet loans and leases\n137,142\n \n136,293\n \n—\n \n—\n \n979\n \n979\n \n136,163\n \n135,314\n \nOther assets\n710\n \n710\n \n—\n \n—\n \n689\n \n689\n \n21\n \n21\n \nFinancial liabilities:\nDeposits\n174,776\n \n174,651\n \n—\n \n—\n \n174,776\n \n174,651\n \n—\n \n—\n \nLong-term borrowed funds\n12,401\n \n12,247\n \n—\n \n—\n \n12,401\n \n12,247\n \n—\n \n—\n \n(1)\n Excludes cash-related financial instruments not recorded at fair value in the Consolidated Balance Sheets with a carrying value and estimated fair value of $\n12.3\n billion and $\n11.2\n billion at September 30, 2025 and December 31, 2024, respectively.\nNOTE 13 - NONINTEREST INCOME \nA portion of the Company’s noninterest income relates to certain fee-based revenue earned from contracts with customers based on the amount of consideration expected to be received upon the transfer of control of a good or service. For a description of the components of revenue from contracts with customers and how each component is recognized for the principal products and services of the Company’s business segments, see Note 21 in the Company’s 2024 Form 10-K.\nThe following tables present noninterest income segregated by revenue from contracts with customers and revenue from other sources, disaggregated by business segment. Revenue from other sources primarily includes income from letter of credit and loan fees, foreign exchange and derivative products, and mortgage banking fees.\nThree Months Ended September 30, 2025\n(dollars in millions)\nConsumer Banking\nCommercial Banking\nNon-Core\nOther\nConsolidated\nService charges and fees\n$\n78\n \n$\n33\n \n$\n—\n \n$\n—\n \n$\n111\n \nCard fees\n73\n \n12\n \n—\n \n—\n \n85\n \nCapital markets fees\n—\n \n158\n \n—\n \n—\n \n158\n \nWealth fees\n93\n \n—\n \n—\n \n—\n \n93\n \nOther banking fees\n1\n \n4\n \n—\n \n—\n \n5\n \nTotal revenue from contracts with customers\n$\n245\n \n$\n207\n \n$\n—\n \n$\n—\n \n$\n452\n \nTotal revenue from other sources\n(1)\n66\n \n79\n \n4\n \n29\n \n178\n \nTotal noninterest income\n$\n311\n \n$\n286\n \n$\n4\n \n$\n29\n \n$\n630\n \nCitizens Financial Group, Inc. | 76\nThree Months Ended September 30, 2024\n(dollars in millions)\nConsumer Banking\nCommercial Banking\nNon-Core\nOther\nConsolidated\n \nService charges and fees\n$\n75\n \n$\n34\n \n$\n—\n \n$\n—\n \n$\n109\n \nCard fees\n73\n \n12\n \n—\n \n6\n \n91\n \nCapital markets fees\n—\n \n88\n \n—\n \n—\n \n88\n \nWealth fees\n76\n \n—\n \n—\n \n—\n \n76\n \nOther banking fees\n1\n \n2\n \n—\n \n—\n \n3\n \nTotal revenue from contracts with customers\n$\n225\n \n$\n136\n \n$\n—\n \n$\n6\n \n$\n367\n \nTotal revenue from other sources\n(1)\n60\n \n71\n \n—\n \n34\n \n165\n \nTotal noninterest income\n$\n285\n \n$\n207\n \n$\n—\n \n$\n40\n \n$\n532\n \nNine Months Ended September 30, 2025\n(dollars in millions)\nConsumer Banking\nCommercial Banking\nNon-Core\nOther\nConsolidated\nService charges and fees\n$\n229\n \n$\n101\n \n$\n—\n \n$\n—\n \n$\n330\n \nCard fees\n214\n \n38\n \n—\n \n—\n \n252\n \nCapital markets fees\n—\n \n348\n \n—\n \n—\n \n348\n \nWealth fees\n262\n \n—\n \n—\n \n—\n \n262\n \nOther banking fees\n2\n \n8\n \n—\n \n—\n \n10\n \nTotal revenue from contracts with customers\n$\n707\n \n$\n495\n \n$\n—\n \n$\n—\n \n$\n1,202\n \nTotal revenue from other sources\n(1)\n230\n \n238\n \n7\n \n97\n \n572\n \nTotal noninterest income\n$\n937\n \n$\n733\n \n$\n7\n \n$\n97\n \n$\n1,774\n \nNine Months Ended September 30, 2024\n(dollars in millions)\nConsumer Banking\nCommercial Banking\nNon-Core\nOther\nConsolidated\nService charges and fees\n$\n213\n \n$\n97\n \n$\n—\n \n$\n—\n \n$\n310\n \nCard fees\n213\n \n40\n \n—\n \n13\n \n266\n \nCapital markets fees\n—\n \n330\n \n—\n \n—\n \n330\n \nWealth fees\n219\n \n—\n \n—\n \n—\n \n219\n \nOther banking fees\n2\n \n8\n \n—\n \n1\n \n11\n \nTotal revenue from contracts with customers\n$\n647\n \n$\n475\n \n$\n—\n \n$\n14\n \n$\n1,136\n \nTotal revenue from other sources\n(1)\n173\n \n201\n \n—\n \n92\n \n466\n \nTotal noninterest income\n$\n820\n \n$\n676\n \n$\n—\n \n$\n106\n \n$\n1,602\n \n(1)\n Includes bank-owned life insurance income of $\n30\n million and $\n26\n million for the three months ended September 30, 2025 and 2024, respectively, and $\n85\n million and $\n80\n million for the nine months ended September 30, 2025 and 2024, respectively.\nFor the three months ended September 30, 2025 and 2024, the Company recognized trailing commissions of $\n4\n million related to previous investment sales. For the nine months ended September 30, 2025 and 2024, the Company recognized $\n12\n million and $\n11\n million, respectively.\nNOTE 14 - OTHER OPERATING EXPENSE \nThe following table presents the details of Other operating expense:\nThree Months Ended September 30,\nNine Months Ended September 30,\n(dollars in millions)\n2025\n2024\n2025\n2024\nMarketing\n$\n44\n \n$\n40\n \n$\n129\n \n$\n124\n \nDeposit insurance\n(1)\n32\n \n40\n \n108\n \n162\n \nOther\n90\n \n84\n \n254\n \n269\n \nOther operating expense\n$\n166\n \n$\n164\n \n$\n491\n \n$\n555\n \n(1)\n Includes an industry-wide FDIC special assessment of $\n40\n million for the nine months ended September 30, 2024.\nCitizens Financial Group, Inc. | 77\nNOTE 15 - EARNINGS PER SHARE\nBasic EPS is the amount of earnings, adjusted for preferred stock dividends and the impact of issuance costs associated with preferred stock redemptions, available to each share of common stock outstanding during the reporting period. Diluted EPS is the amount of earnings available to each share of common stock outstanding during the reporting period adjusted to include the effect of potentially dilutive common shares, which include incremental shares issued for share-based payment awards. Potentially dilutive common shares are excluded from the computation of diluted EPS in periods in which the effect would be antidilutive.\nThe following table presents the calculation of basic and diluted EPS:\nThree Months Ended September 30,\nNine Months Ended September 30,\n(dollars in millions, except per share data)\n2025\n2024\n2025\n2024\nNumerator (basic and diluted):\nNet income\n$\n494\n \n$\n382\n \n$\n1,303\n \n$\n1,108\n \nLess: Preferred stock dividends\n32\n \n38\n \n99\n \n103\n \nLess: Impact of preferred stock redemption\n5\n \n—\n \n5\n \n—\n \nNet income available to common stockholders\n$\n457\n \n$\n344\n \n$\n1,199\n \n$\n1,005\n \nDenominator:\nWeighted-average common shares outstanding - basic\n431,365,552\n \n446,561,996\n \n434,416,696\n \n453,993,833\n \nDilutive common shares: share-based awards\n4,106,798\n \n3,351,471\n \n3,498,900\n \n2,467,497\n \nWeighted-average common shares outstanding - diluted\n435,472,350\n \n449,913,467\n \n437,915,596\n \n456,461,330\n \nEarnings per common share:\nBasic\n$\n1.06\n \n$\n0.77\n \n$\n2.76\n \n$\n2.21\n \nDiluted\n(1)\n1.05\n \n0.77\n \n2.74\n \n2.20\n \n(1)\n Excluded from the computation of diluted EPS were weighted-average antidilutive shares totaling \n3,454\n and \n141,698\n for the three months ended September 30, 2025 and 2024, respectively, and \n16,910\n and \n409,167\n for the nine months ended September 30, 2025 and 2024, respectively.\nNOTE 16 - BUSINESS SEGMENTS \nThe Company is managed by its CODM, the Chief Executive Officer, on a segment basis. The Company’s \nthree\n reportable business segments are Consumer Banking, Commercial Banking, and Non-Core. The business segments are determined based on the products and services provided, or the type of customer served. Each business segment has a segment head that reports directly to the Chief Executive Officer, who has final authority over resource allocation decisions and performance assessment. The business segments reflect this management structure and the manner in which financial information is currently evaluated by the Chief Executive Officer.\nThe CODM utilizes segment pretax profit or loss as the primary measure to allocate resources to the Company’s business segments during the annual budgeting and forecasting process. This measure is also used to assess the performance of each segment, with a focus on monitoring net interest income, noninterest income, and noninterest expense. To ensure effective oversight, the CODM participates in monthly business review meetings, where budget- and forecast-to-actual variances for pretax profit or loss and its components are analyzed. These evaluations inform the CODM’s decisions regarding the allocation of capital and resources across the business segments, ensuring alignment with the Company’s strategic objectives.\nDeveloping and applying methodologies used to allocate items among the business segments is a dynamic process. Accordingly, financial results may be revised periodically as management systems are enhanced, methods of evaluating performance or product lines are updated, or organizational structure changes occur.\nFor more information on the Company’s business segments, as well as Other non-segment operations, see Note 26 in the Company’s 2024 Form 10-K.\nCitizens Financial Group, Inc. | 78\nThe following tables present certain financial data of the Company’s business segments:\nThree Months Ended September 30, 2025\n(dollars in millions)\nConsumer Banking\nCommercial Banking\nNon-Core\nOther\nConsolidated\nNet interest income\n$\n1,262\n \n$\n448\n \n($\n7\n)\n($\n215\n)\n$\n1,488\n \nNoninterest income\n311\n \n286\n \n4\n \n29\n \n630\n \nTotal revenue\n1,573\n \n734\n \n(\n3\n)\n(\n186\n)\n2,118\n \nDirect expenses\n(1)(2)\n692\n \n223\n \n1\n \n419\n \n1,335\n \nIndirect expenses\n(3)\n287\n \n110\n \n11\n \n(\n408\n)\n—\n \nNoninterest expense\n979\n \n333\n \n12\n \n11\n \n1,335\n \nProfit (loss) before provision (benefit) for credit losses\n594\n \n401\n \n(\n15\n)\n(\n197\n)\n783\n \nProvision (benefit) for credit losses\n81\n \n78\n \n4\n \n(\n9\n)\n154\n \nIncome (loss) before income tax expense (benefit)\n513\n \n323\n \n(\n19\n)\n(\n188\n)\n629\n \nIncome tax expense (benefit)\n130\n \n75\n \n(\n5\n)\n(\n65\n)\n135\n \nNet income (loss)\n$\n383\n \n$\n248\n \n($\n14\n)\n($\n123\n)\n$\n494\n \nTotal average assets\n$\n80,729\n \n$\n66,134\n \n$\n4,000\n \n$\n68,254\n \n$\n219,117\n \n(1)\n Represents operating expenses incurred by the business segments and primarily includes salaries and employee benefits, equipment and software, outside services, and occupancy.\n(2)\n Includes depreciation and amortization of $\n30\n million, $\n5\n million, and $\n77\n million, respectively, for the Consumer Banking, Commercial Banking and Other business segments.\n(3)\n Represents allocated corporate overhead from support functions such as information technology, finance, risk, and human resources.\nThree Months Ended September 30, 2024\n(dollars in millions)\nConsumer Banking\nCommercial Banking\nNon-Core\nOther\nConsolidated\nNet interest income\n$\n1,156\n \n$\n478\n \n($\n28\n)\n($\n237\n)\n$\n1,369\n \nNoninterest income\n285\n \n207\n \n—\n \n40\n \n532\n \nTotal revenue \n1,441\n \n685\n \n(\n28\n)\n(\n197\n)\n1,901\n \nDirect expenses\n(1)(2)\n586\n \n205\n \n1\n \n467\n \n1,259\n \nIndirect expenses\n(3)\n330\n \n95\n \n22\n \n(\n447\n)\n—\n \nNoninterest expense\n916\n \n300\n \n23\n \n20\n \n1,259\n \nProfit (loss) before provision (benefit) for credit losses\n525\n \n385\n \n(\n51\n)\n(\n217\n)\n642\n \nProvision (benefit) for credit losses\n84\n \n91\n \n17\n \n(\n20\n)\n172\n \nIncome (loss) before income tax expense (benefit)\n441\n \n294\n \n(\n68\n)\n(\n197\n)\n470\n \nIncome tax expense (benefit)\n114\n \n63\n \n(\n17\n)\n(\n72\n)\n88\n \nNet income (loss)\n$\n327\n \n$\n231\n \n($\n51\n)\n($\n125\n)\n$\n382\n \nTotal average assets \n$\n75,392\n \n$\n68,092\n \n$\n8,389\n \n$\n66,705\n \n$\n218,578\n \n(1)\n Represents operating expenses incurred by the business segments and primarily includes salaries and employee benefits, equipment and software, outside services, and occupancy.\n(2)\n Includes depreciation and amortization of $\n29\n million, $\n6\n million, and $\n79\n million, respectively, for the Consumer Banking, Commercial Banking and Other business segments.\n(3)\n Represents allocated corporate overhead from support functions such as information technology, finance, risk, and human resources.\nCitizens Financial Group, Inc. | 79\nNine Months Ended September 30, 2025\n(dollars in millions)\nConsumer Banking\nCommercial Banking\nNon-Core\nOther\nConsolidated\nNet interest income\n$\n3,673\n \n$\n1,328\n \n($\n27\n)\n($\n658\n)\n$\n4,316\n \nNoninterest income\n937\n \n733\n \n7\n \n97\n \n1,774\n \nTotal revenue\n4,610\n \n2,061\n \n(\n20\n)\n(\n561\n)\n6,090\n \nDirect expenses\n(1)(2)\n2,040\n \n660\n \n2\n \n1,266\n \n3,968\n \nIndirect expenses\n(3)\n856\n \n317\n \n41\n \n(\n1,214\n)\n—\n \nNoninterest expense\n2,896\n \n977\n \n43\n \n52\n \n3,968\n \nProfit (loss) before provision (benefit) for credit losses\n1,714\n \n1,084\n \n(\n63\n)\n(\n613\n)\n2,122\n \nProvision (benefit) for credit losses\n248\n \n239\n \n43\n \n(\n59\n)\n471\n \nIncome (loss) before income tax expense (benefit)\n1,466\n \n845\n \n(\n106\n)\n(\n554\n)\n1,651\n \nIncome tax expense (benefit)\n371\n \n195\n \n(\n27\n)\n(\n191\n)\n348\n \nNet income (loss)\n$\n1,095\n \n$\n650\n \n($\n79\n)\n($\n363\n)\n$\n1,303\n \nTotal average assets\n$\n79,040\n \n$\n65,931\n \n$\n5,241\n \n$\n67,494\n \n$\n217,706\n \n(1)\n Represents operating expenses incurred by the business segments and primarily includes salaries and employee benefits, equipment and software, outside services, and occupancy.\n(2)\n Includes depreciation and amortization of $\n92\n million, $\n15\n million, and $\n230\n million, respectively, for the Consumer Banking, Commercial Banking and Other business segments.\n(3)\n Represents allocated corporate overhead from support functions such as information technology, finance, risk, and human resources.\nNine Months Ended September 30, 2024\n(dollars in millions)\nConsumer Banking\nCommercial Banking\nNon-Core\nOther\nConsolidated\nNet interest income\n$\n3,369\n \n$\n1,486\n \n($\n96\n)\n($\n538\n)\n$\n4,221\n \nNoninterest income\n820\n \n676\n \n—\n \n106\n \n1,602\n \nTotal revenue \n4,189\n \n2,162\n \n(\n96\n)\n(\n432\n)\n5,823\n \nDirect expenses\n(1)(2)\n1,728\n \n626\n \n3\n \n1,561\n \n3,918\n \nIndirect expenses\n(3)\n1,006\n \n302\n \n71\n \n(\n1,379\n)\n—\n \nNoninterest expense\n2,734\n \n928\n \n74\n \n182\n \n3,918\n \nProfit (loss) before provision (benefit) for credit losses\n1,455\n \n1,234\n \n(\n170\n)\n(\n614\n)\n1,905\n \nProvision (benefit) for credit losses\n249\n \n262\n \n46\n \n(\n32\n)\n525\n \nIncome (loss) before income tax expense (benefit)\n1,206\n \n972\n \n(\n216\n)\n(\n582\n)\n1,380\n \nIncome tax expense (benefit)\n311\n \n223\n \n(\n55\n)\n(\n207\n)\n272\n \nNet income (loss)\n$\n895\n \n$\n749\n \n($\n161\n)\n($\n375\n)\n$\n1,108\n \nTotal average assets \n$\n74,510\n \n$\n69,046\n \n$\n9,450\n \n$\n66,514\n \n$\n219,520\n \n(1)\n Represents operating expenses incurred by the business segments and primarily includes salaries and employee benefits, equipment and software, outside services, and occupancy.\n(2)\n Includes depreciation and amortization of $\n84\n million, $\n21\n million, and $\n233\n million, respectively, for the Consumer Banking, Commercial Banking and Other business segments.\n(3)\n Represents allocated corporate overhead from support functions such as information technology, finance, risk, and human resources."
}