{
  "item1": "promise deliver exceptional customer success, using expertise, scale tailored solutions help customers navigate increasingly complex global supply chains. Operating throughout North America, Europe, Asia, Oceania, South America, Middle East, help ensure seamless delivery goods across industries continents. global suite multimodal logistics services brings together expertise people custom technology differentiated one largest datasets shipments, routings, carriers world. Robinson Operating Model foundation strategy, execution, accountability throughout organization.",
  "item7": "Adjusted gross profit margin percentage Total adjusted gross profit margin ________________________________ Adjusted gross profit margin non-GAAP financial measure explained above. following discussion analysis Results Operations Liquidity Capital Resources includes comparison twelve months ended December 31, 2024, twelve months ended December 31, 2023. similar discussion analysis compares twelve months ended December 31, 2023, twelve months ended December 31, 2022, can Management’s Discussion Analysis Financial Condition Results Operations, reconciliation reportable segments consolidated results can found Note 8, Consolidated Results Operations—Twelve Months Ended December 31, 2024 Compared Twelve Months Ended December 31, 2023 Total revenues direct costs. Total revenues direct costs essentially flat prior year significant offsetting impacts ocean truckload services.",
  "item2": "reconciliation gross profits adjusted gross profits gross profit margin adjusted gross profit margin presented below (dollars thousands): Three Months Ended September 30, Nine Months Ended September 30, Purchased transportation related services Purchased products sourced resale Direct internally developed software amortization Gross profits / Gross profit margin Plus: Direct internally developed software amortization Adjusted gross profits / Adjusted gross profit margin adjusted operating margin non-GAAP financial measure calculated operating income divided adjusted gross profits. believe adjusted operating margin useful measure profitability comparison adjusted gross profits, which consider primary performance metric discussed above. reconciliation operating margin adjusted operating margin presented below (dollars thousands) Three Months Ended September 30, Nine Months Ended September 30, Income operations Adjusted gross profits Income operations Adjusted operating margin MARKET TRENDS North American surface transportation market continues exhibit imbalance carrier capacity exceeding industry freight volumes. These conditions commonly referred soft market."
}