{
  "source_file": "chrw-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "ITEM 2. MANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe following discussion of our financial condition and results of operations should be read in conjunction with our condensed consolidated financial statements and related notes.\nFORWARD-LOOKING INFORMATION \nOur Quarterly Report on Form 10-Q, including this discussion and analysis of our financial condition and results of operations and our disclosures about market risk, contains certain “forward-looking statements.” These forward-looking statements are subject to certain risks and uncertainties that could cause actual results to differ materially from our historical experience or our present expectations, including, but not limited to, factors such as changes in economic conditions, including uncertain consumer demand; changes in market demand and pressures on the pricing for our services; fuel price increases or decreases, or fuel shortages; competition and growth rates within the global logistics industry that could adversely impact our profitability and ability to achieve our long-term growth targets; freight levels and increasing costs and availability of truck capacity or alternative means of transporting freight; risks associated with seasonal changes or significant disruptions in the transportation industry; risks associated with identifying and completing suitable acquisitions; our dependence upon and changes in relationships with existing contracted truck, rail, ocean, and air carriers; risks associated with the loss of significant customers; risks associated with reliance on technology to operate our business; cybersecurity related risks; our ability to staff and retain employees; risks associated with operations outside of the United States; our ability to successfully integrate the operations of acquired companies with our historic operations or efficiently manage divestitures; climate change related risks; risks associated with our indebtedness; risks associated with interest rates; risks associated with litigation, including contingent auto liability and insurance coverage; risks associated with the potential impact of changes in government regulations including environmental-related regulations; risks associated with the changes to income tax regulations; risks associated with the produce industry, including food safety and contamination issues; the impact of changes in political and governmental conditions; changes to our capital structure; changes due to catastrophic events; risks associated with the usage of artificial intelligence technologies; risks associated with cybersecurity events; and other risks and uncertainties, including those described in Item 1A. Risk Factors of our Annual Report on Form 10-K for the year ended December 31, 2024, filed with the Securities and Exchange Commission on February 14, 2025, as well as the updates to these risk factors included in Part II—“Item 1A, Risk Factors,” herein.\nAny forward-looking statement speaks only as of the date on which such statement is made, and we undertake no obligation to update such statement to reflect events or circumstances arising after such date.\nOVERVIEW\nC.H. Robinson Worldwide, Inc. (“C.H. Robinson,” “the company,” “we,” “us,” or “our”) is one of the largest global logistics providers in the world. We deliver logistics like no one else. Companies around the world look to us to reimagine supply chains, advance freight technology, and solve logistics challenges—from the simple to the most complex. We are grounded in our promise to deliver exceptional customer success, using our expertise, scale, and tailored solutions to help customers navigate increasingly complex global supply chains.\nOur adjusted gross profits and adjusted gross profit margin are non-GAAP financial measures. Adjusted gross profits are calculated as gross profits excluding amortization of internally developed software utilized to directly serve our customers and contracted carriers. Adjusted gross profit margin is calculated as adjusted gross profits divided by total revenues. We believe adjusted gross profits and adjusted gross profit margin are useful measures of our ability to source, add value, and sell services and products that are provided by third parties, and we consider adjusted gross profits to be a primary performance measurement. Accordingly, the discussion of our results of operations often focuses on the changes in our adjusted gross profits and adjusted gross profit margin. \n27\nTable of Contents\n \nThe reconciliation of gross profits to adjusted gross profits and gross profit margin to adjusted gross profit margin is presented below (dollars in thousands):\nThree Months Ended September 30,\nNine Months Ended September 30,\n2025\n2024\n2025\n2024\nRevenues:\nTransportation\n$\n3,783,535 \n$\n4,278,300 \n$\n11,252,110 \n$\n12,482,818 \nSourcing\n353,311 \n366,341 \n1,068,019 \n1,057,482 \nTotal revenues\n4,136,846 \n4,644,641 \n12,320,129 \n13,540,300 \nCosts and expenses:\nPurchased transportation and related services\n3,112,683 \n3,575,983 \n9,286,694 \n10,501,362 \nPurchased products sourced for resale\n318,086 \n333,405 \n961,039 \n958,547 \nDirect internally developed software amortization\n14,420 \n11,441 \n43,767 \n32,546 \nTotal direct costs\n3,445,189 \n3,920,829 \n10,291,500 \n11,492,455 \nGross profits / Gross profit margin\n691,657 \n16.7%\n723,812 \n15.6%\n2,028,629 \n16.5%\n2,047,845 \n15.1%\nPlus: Direct internally developed software amortization\n14,420 \n11,441 \n43,767 \n32,546 \nAdjusted gross profits / Adjusted gross profit margin\n$\n706,077 \n17.1%\n$\n735,253 \n15.8%\n$\n2,072,396 \n16.8%\n$\n2,080,391 \n15.4%\nOur adjusted operating margin is a non-GAAP financial measure calculated as operating income divided by adjusted gross profits. We believe adjusted operating margin is a useful measure of our profitability in comparison to our adjusted gross profits, which we consider a primary performance metric as discussed above. The reconciliation of operating margin to adjusted operating margin is presented below \n(dollars in thousands)\n:\nThree Months Ended September 30,\nNine Months Ended September 30,\n2025\n2024\n2025\n2024\nTotal revenues\n$\n4,136,846 \n$\n4,644,641 \n$\n12,320,129 \n$\n13,540,300 \nIncome from operations\n220,836 \n180,119 \n613,608 \n485,342 \nOperating margin\n5.3%\n3.9%\n5.0%\n3.6%\nAdjusted gross profits\n$\n706,077 \n$\n735,253 \n$\n2,072,396 \n$\n2,080,391 \nIncome from operations\n220,836 \n180,119 \n613,608 \n485,342 \nAdjusted operating margin\n31.3%\n24.5%\n29.6%\n23.3%\nMARKET TRENDS\nThe North American surface transportation market continues to exhibit an imbalance with carrier capacity exceeding industry freight volumes. These conditions are commonly referred to as a soft market. Market conditions further softened in the third quarter of 2025, which continued a multi-year trend of declining freight volumes and transportation rates. This followed a brief period of improvement driven by seasonal produce and beverage demand that led to temporary regional rate spikes. Despite carriers continuing to exit the market, the level of attrition has not held pace with the decline in industry freight volumes. Industry volumes, as measured by the Cass Freight Index, declined approximately 7.0 percent in the third quarter of 2025 compared to the third quarter of 2024, adding to the oversupply of capacity and contributing to the sustained downward pressure on transportation rates. One of the key metrics we use to measure market conditions is the truckload routing guide depth from our Managed Solutions business. This metric measures the average number of carriers contacted before securing a transportation provider. Routing guide depth of 1 would be perfect performance and 2 would be extremely poor. In the third quarter of 2025, the average routing guide depth returned to 1.2 which is consistent with levels observed throughout 2023 and 2024 following a temporary increase to 1.3 in the second quarter of 2025. \n28\nTable of Contents\n \nThe global forwarding market remained highly volatile throughout the third quarter of 2025, influenced by shifting tariff policies, softening demand, and carriers' strategic use of blank sailings to stabilize market conditions. Early in the quarter, the market experienced a brief rebound in freight volumes and a temporary surge in pricing, as shippers accelerated activity ahead of the expiration of the U.S. and China 90-day tariff pause. While the tariff landscape continues to evolve, market conditions have largely stabilized although pricing has rapidly declined across many trade lanes, driven by excess capacity and weak consumer sentiment. The air freight market has also stabilized at lower levels of pricing, as the excess capacity resulting from the end of the de minimis threshold has largely been rationalized. Depressed ocean freight rates and weak consumer demand have prompted more shippers to accept longer transit times by opting for the cost-efficiency of ocean freight. While shifting tariff policies, seasonal impacts, and other volatile market conditions can be expected to create ongoing volatility, freight pricing is likely to remain depressed until industry freight volumes show meaningful improvement.   \nBUSINESS TRENDS\nOur surface transportation business continued to navigate the soft market conditions discussed in the market trends section during the third quarter of 2025. Our average truckload linehaul cost per mile, excluding fuel surcharges, decreased approximately 1.5 percent during the third quarter of 2025 compared to the third quarter of 2024, reflecting the downward pressure from market rates. Our average truckload linehaul rate charged to our customers, excluding fuel surcharges, also decreased approximately 1.5 percent during the third quarter of 2025 resulting in our truckload adjusted gross profit per transaction in the third quarter of 2025 holding consistent compared to the same period in 2024. Our less than truckload (“LTL”) adjusted gross profits per transaction showed strong improvement driven by the continued advancement of our dynamic pricing and costing capabilities. Despite the challenging soft market conditions, our combined North American Surface Transportation (“NAST”) truckload and LTL volume significantly outperformed the Cass Freight Index, increasing 3.0 percent in the third quarter of 2025 compared to the third quarter of 2024. \nOur global forwarding results in the third quarter of 2025 reflected the continued impact of the volatile market conditions and shifting trade policies outlined in the market trends section above. Our ocean freight shipments decreased 7.0 percent compared to the third quarter of 2024, as elevated inventory levels and weak consumer sentiment contributed to sluggish demand across many trade lanes. While the beginning of the period saw a brief rebound in ocean freight volumes and pricing ahead of the expiration of the U.S. and China 90-day tariff pause it was short-lived, and volume and pricing fell rapidly during the remainder of the third quarter of 2025. Adjusted gross profit per ocean shipment declined 27.5 percent compared to the elevated levels in the third quarter of 2024, driven by excess capacity and depressed pricing across many trade lanes. Our air freight results also reflected these market dynamics as air freight volumes declined, with overall tonnage down 10.0 percent compared to the third quarter of 2024. \nAs part of our enterprise strategy to drive focus on profitable growth in our four core modes—North American truckload and LTL and global ocean and air—as engines to ignite growth and create the most value for our stakeholders we divested our Europe Surface Transportation business. The sale closed effective February 1, 2025. Europe Surface Transportation provided transportation and logistics services, including truckload and LTL transportation services across Europe, and represented the majority of our Other Surface Transportation operations included in All Other and Corporate. \nSELECTED OPERATING PERFORMANCE AND OTHER SIGNIFICANT ITEMS\nThe following summarizes select third quarter 2025 year-over-year operating comparisons to the third quarter 2024:\n•\nTotal revenues decreased 10.9 percent to $4.1 billion, primarily driven by lower pricing and volume in our ocean services, the divestiture of our Europe Surface Transportation business, and lower pricing in our truckload services. This was partially offset by higher volume in our truckload services.\n•\nGross profits decreased 4.4 percent to $691.7 million. Adjusted gross profits decreased 4.0 percent to $706.1 million, primarily driven by lower adjusted gross profit per transaction and volume in our ocean services and the divestiture of our Europe Surface Transportation business. This was partially offset by higher adjusted gross profit per transaction in our LTL and customs services and higher volume in our truckload services.\n•\nPersonnel expenses decreased 3.4 percent to $349.3 million, primarily due to the divestiture of our Europe Surface Transportation business, cost optimization efforts and productivity improvements. This was partially offset by higher restructuring charges related to workforce reductions. Average employee headcount decreased 10.8 percent.\n•\nOther selling, general, and administrative (“SG&A”) expenses decreased 29.8 percent to $135.9 million primarily due to a $57.0 million loss in the prior year related to the divestiture of our Europe Surface Transportation business.\n•\nIncome from operations increased 22.6 percent to $220.8 million, due to the decrease in operating expenses, partially offset by the decrease in adjusted gross profit.\n29\nTable of Contents\n \n•\nAdjusted operating margin of 31.3 percent increased 680 basis points.\n•\nInterest and other income/expense, net totaled $15.6 million of expense, consisting primarily of $15.8 million of interest expense, which decreased $6.3 million compared to last year due to a lower average debt balance and lower variable interest rates.\n•\nThe effective tax rate in the quarter was 20.6 percent compared to 32.4 percent in the third quarter last year.\n•\nNet income totaled $163.0 million, an increase of 67.6 percent from a year ago.\n•\nDiluted earnings per share increased 67.5 percent to $1.34. \n•\nCash flow from operations increased $368.0 million in the nine months ended September 30, 2025, primarily driven by an increase in net income and rapidly declining ocean freight rates.\nCONSOLIDATED RESULTS OF OPERATIONS\nThe following table summarizes our results of operations (dollars in thousands, except per share data):\nThree Months Ended September 30,\nNine Months Ended September 30,\n2025\n2024\n% change\n2025\n2024\n% change\nRevenues:\nTransportation\n$\n3,783,535\n$\n4,278,300\n(11.6)\n%\n$\n11,252,110\n$\n12,482,818\n(9.9)\n%\nSourcing\n353,311\n366,341\n(3.6)\n%\n1,068,019\n1,057,482\n1.0 \n%\nTotal revenues\n4,136,846\n4,644,641\n(10.9)\n%\n12,320,129\n13,540,300\n(9.0)\n%\nCosts and expenses:\nPurchased transportation and related services\n3,112,683\n3,575,983\n(13.0)\n%\n9,286,694\n10,501,362\n(11.6)\n%\nPurchased products sourced for resale\n318,086\n333,405\n(4.6)\n%\n961,039\n958,547\n0.3 \n%\nPersonnel expenses\n349,302\n361,559\n(3.4)\n%\n1,033,177\n1,101,868\n(6.2)\n%\nOther selling, general, and administrative expenses\n135,939\n193,575\n(29.8)\n%\n425,611\n493,181\n(13.7)\n%\nTotal costs and expenses\n3,916,010\n4,464,522\n(12.3)\n%\n11,706,521\n13,054,958\n(10.3)\n%\nIncome from operations\n220,836\n180,119\n22.6 \n%\n613,608\n485,342\n26.4 \n%\nInterest and other income/expense, net\n(15,602)\n(36,282)\n(57.0)\n%\n(57,679)\n(74,587)\n(22.7)\n%\nIncome before provision for income taxes\n205,234\n143,837\n42.7 \n%\n555,929\n410,755\n35.3 \n%\nProvision for income taxes\n42,247\n46,608\n(9.4)\n%\n105,169\n94,371\n11.4 \n%\nNet income\n$\n162,987\n$\n97,229\n67.6 \n%\n$\n450,760\n$\n316,384\n42.5 \n%\nDiluted net income per share\n$\n1.34 \n$\n0.80 \n67.5 \n%\n$\n3.71\n$\n2.63\n41.1 \n%\nAverage employee headcount\n12,559 \n14,085 \n(10.8)\n%\n12,953\n14,537\n(10.9)\n%\nAdjusted gross profit margin percentage\n(1)\nTransportation\n17.7 \n%\n16.4 \n%\n130 bps\n17.5 \n%\n15.9 \n%\n160 bps\nSourcing\n10.0 \n%\n9.0 \n%\n100 bps\n10.0 \n%\n9.4 \n%\n60 bps\nTotal adjusted gross profit margin\n17.1 \n%\n15.8 \n%\n130 bps\n16.8 \n%\n15.4 \n%\n140 bps\n________________________________ \n(1)\n Adjusted gross profit margin is a non-GAAP financial measure explained above. \nA reconciliation of our reportable segments to our consolidated results can be found in Note 8, \nSegment Reporting, \nin Part I, Financial Information of this Quarterly Report on Form 10-Q.\n30\nTable of Contents\n \nConsolidated Results of Operations—Three Months Ended September 30, 2025, Compared to the Three Months Ended September 30, 2024\nTotal revenues and direct costs.\n Total transportation revenues and direct costs decreased primarily due to lower pricing and volume in ocean services, the divestiture of our Europe Surface Transportation business, and lower pricing in truckload services driven by the continued soft market conditions. In the third quarter of 2024, ocean freight rates were elevated due to the volatile market conditions driven by re-routing and extended transit times caused by the Red Sea conflict. These disruptions were compounded by port worker strikes, equipment shortages, and worsening port congestion. The combination of these factors, along with traditional peak season volumes and severe weather events, significantly elevated ocean freight rates and purchased transportation costs in the third quarter of 2024. Market conditions in the third quarter of 2025 continued to be volatile driven by the evolving tariff landscape. Despite this volatility, market conditions have largely stabilized driven by excess capacity and weak consumer sentiment contributing to sluggish ocean freight volumes driving ocean freight rates significantly lower in the third quarter of 2025.  \nGross profits and adjusted gross profits.\n Our transportation adjusted gross profits decreased, driven primarily by lower adjusted gross profit per transaction in our ocean services and the divestiture of our Europe Surface Transportation business.  The decline in ocean services was driven by the significant reduction in market pricing in the third quarter of 2025 compared to the third quarter of 2024 discussed above. These declines were partially offset by higher adjusted gross profit per transaction in LTL and customs, as well as higher volume in our truckload services. The improvement in LTL was driven by the continued advancement of our dynamic pricing and costing capabilities. In our customs services, higher adjusted gross profits were largely attributable to increased duty advance fees, reflecting elevated global tariff rates. Sourcing adjusted gross profits increased, driven by an increase in integrated supply chain solutions for foodservice customers. \nOperating expenses.\n Personnel expenses decreased primarily due to the divestiture of our Europe Surface Transportation business and cost optimization efforts and productivity improvements, including lower average employee headcount. Other SG&A expenses decreased primarily due to a $57.0 million loss in the prior year related to the divestiture of our Europe Surface Transportation business.\nIn addition to the above, our personnel expenses in the third quarter of 2025 included $9.7 million of severance and related personnel expenses associated with our 2025 Restructuring Program.\nOur personnel expenses for the third quarter of 2024 included $2.9 million of severance and related personnel expenses. We also incurred $1.6 million of restructuring related other SG&A expenses in the third quarter of 2024. These expenses were both primarily associated with our 2024 Restructuring Program. Our other SG&A expenses in the third quarter of 2024 also included a $57.0 million loss related to the divestiture of our Europe Transportation business. Refer to Note 13, \nRestructuring\n, and\n \nNote 14, \nDivestitures\n, for further discussion related to our restructuring programs and the divestiture of our Europe Surface Transportation business. \nInterest and other income/expense, net.\n Interest and other income/expense, net primarily consisted of interest expense of $15.8 million which decreased $6.3 million during the third quarter of 2025, due to a lower average debt balance and lower variable interest rates. The third quarter of 2024 included a $15.1 million net loss from foreign currency revaluation and realized foreign currency gains and losses.\nProvision for income taxes.\n Our effective income tax rate was 20.6 percent for the third quarter of 2025 compared to 32.4 percent for the third quarter of 2024. The effective income tax rate for the third quarter of 2025 was lower than the statutory federal income tax rate primarily due to the impact of share-based payment awards and foreign tax credits, which decreased the effective income tax rate by 3.8 percentage points and 2.0 percentage points, respectively. These impacts were partially offset by state income tax expense, net of federal benefit, which increased the effective tax rate by 2.4 percentage points during the third quarter of 2025. The effective income tax rate for the third quarter of 2024 was higher than the statutory federal income tax rate primarily due to the tax impact of foreign tax credits and business divestitures, which increased the effective tax rate by 13.7 percentage points and 7.9 percentage points, respectively. These impacts were partially offset by U.S. tax credits and incentives and a lower tax rate on foreign earnings which decreased the effective income tax rate by 5.1 percentage points and 4.5 percentage points, respectively.\n31\nTable of Contents\n \nConsolidated Results of Operations—Nine Months Ended September 30, 2025, Compared to the Nine Months Ended September 30, 2024\nTotal revenues and direct costs.\n Total revenues and direct costs decreased primarily due to the divestiture of our Europe Surface Transportation business, along with lower pricing and purchased transportation costs in addition to lower volume in ocean services, and lower fuel surcharges in our truckload services. During the nine months ended September 30, 2024, ocean freight rates were elevated as a result of ongoing disruptions, including the Red Sea conflict, which strained capacity and increased ocean freight rates. While similar capacity constraints persisted during the nine months ended September 30, 2025, the period also experienced significant shifts in demand driven by tariff and macroeconomic uncertainty. These dynamics resulted in lower pricing and purchased transportation costs compared to the prior year. The decline in truckload fuel surcharges was attributable to a year-over-year reduction in diesel fuel prices. Our sourcing total revenue and direct costs increased driven by higher volumes from retail and foodservice customers.\nGross profits and adjusted gross profits.\n Our transportation adjusted gross profits decreased, primarily driven by lower adjusted gross profit per transaction in our ocean services and the divestiture of our Europe Surface Transportation business. These impacts were partially offset by increased adjusted gross profit per transaction in our truckload and LTL services. The decline in ocean services was largely attributable to the significant reduction in market pricing during the nine months ended September 30, 2025 compared to the same period in 2024 discussed above. Conversely, the increase in adjusted gross profit per transaction in truckload and LTL services reflects the continued advancement of our dynamic pricing and costing capabilities. These advancements have allowed us to respond more rapidly to market fluctuations through more frequent and precise pricing discovery. Sourcing adjusted gross profits increased due to an increase in integrated supply chain solutions for retail and foodservice customers.\nOperating expenses.\n Personnel expenses decreased primarily due to cost optimization efforts, including lower average employee headcount, and the divestiture of our Europe Surface Transportation business. These decreases were partially offset by higher incentive compensation reflecting our improved results compared to the prior year. Other SG&A expenses decreased primarily due to the divestiture of our Europe Surface Transportation business and declines across several categories.\nIn addition to the above, our personnel expenses for the nine months ended September 30, 2025 included $14.8 million of severance and related personnel expenses. We also incurred $7.9 million in other SG&A expenses in the nine months ended September 30, 2025 primarily resulting from a $6.3 million impairment charge on our Kansas City regional center lease resulting from the execution of a sublease agreement on a portion of the building. In addition, other SG&A expenses in the nine months ended September 30, 2025 included $1.6 million of expenses associated with our 2025 Restructuring Program and the divestiture of our Europe Surface Transportation business. \nOur personnel expenses for the nine months ended September 30, 2024 included $20.2 million of severance and related personnel expenses. We also incurred $69.4 million of other SG&A expenses in the nine months ended September 30, 2024. These expenses were associated with our 2024 Restructuring Program and a $57.0 million loss related to the divestiture of our Europe Surface Transportation business.\nInterest and other income/expense, net.\n Interest and other income/expense, net primarily consisted of interest expense of $49.4 million, which decreased $17.6 million driven by a lower average debt balance and lower variable interest rates compared to the prior year. The nine months ended September 30, 2025 included an $8.3 million net loss from foreign currency revaluation and realized foreign currency gains and losses, compared to a $10.7 million net loss in the prior year.\nProvision for income taxes.\n Our effective income tax rate was 18.9 percent for the nine months ended September 30, 2025 and 23.0 percent for the nine months ended September 30, 2024. The effective income tax rate for the nine months ended September 30, 2025 was lower than the statutory federal income tax rate primarily due to the tax benefit of share-based payment awards and foreign tax credits, which decreased the effective tax rate by 3.3 percentage points and 2.0 percentage points, respectively. These impacts were partially offset by state income tax expense, net of federal benefit which increased the effective tax rate by 2.3 percentage points. The effective income tax rate for the nine months ended September 30, 2024 was higher than the statutory federal income tax rate primarily due to the tax impact of foreign tax credits, the tax impact of business divestitures, and state income tax expense, net of federal benefit, which increased the effective tax rate by 3.8 percentage points, 2.8 percentage points, and 2.7 percentage points, respectively. These impacts were partially offset by the tax impact of U.S. tax credits and incentives, which decreased the effective income tax rate by 5.8 percentage points. \n32\nTable of Contents\n \nNAST Segment Results of Operations\nThree Months Ended September 30,\nNine Months Ended September 30,\n(dollars in thousands)\n2025\n2024\n% change\n2025\n2024\n% change\nTotal revenues\n$\n2,965,694 \n$\n2,934,617 \n1.1 \n%\n$\n8,752,341 \n$\n8,924,839 \n(1.9)\n%\nCosts and expenses:\nPurchased transportation and related services\n2,521,555 \n2,513,953 \n0.3 \n%\n7,457,630 \n7,687,408 \n(3.0)\n%\nPersonnel expenses\n162,086 \n164,122 \n(1.2)\n%\n483,070 \n510,110 \n(5.3)\n%\nOther selling, general, and administrative expenses\n109,175 \n107,775 \n1.3 \n%\n331,101 \n328,557 \n0.8 \n%\nTotal costs and expenses\n2,792,816 \n2,785,850 \n0.3 \n%\n8,271,801 \n8,526,075 \n(3.0)\n%\nIncome from operations\n$\n172,878 \n$\n148,767 \n16.2 \n%\n$\n480,540 \n$\n398,764 \n20.5 \n%\nThree Months Ended September 30,\nNine Months Ended September 30,\n2025\n2024\n% change\n2025\n2024\n% change\nAverage employee headcount\n5,187 \n5,595 \n(7.3)\n%\n5,234 \n5,800 \n(9.8)\n%\nService line volume statistics\nTruckload\n3.0 \n%\n(0.5)\n%\nLTL\n2.5 \n%\n2.0 \n%\nAdjusted gross profits\n(1)\nTruckload\n$\n267,442 \n$\n259,961 \n2.9 \n%\n$\n780,940 \n$\n750,516 \n4.1 \n%\nLTL\n156,909 \n141,412 \n11.0 \n%\n453,768 \n425,050 \n6.8 \n%\nOther \n19,788 \n19,291 \n2.6 \n%\n60,003 \n61,865 \n(3.0)\n%\nTotal adjusted gross profits\n$\n444,139 \n$\n420,664 \n5.6 \n%\n$\n1,294,711 \n$\n1,237,431 \n4.6 \n%\n________________________________ \n(1)\n Adjusted gross profit margin is a non-GAAP financial measure explained above. \nThree Months Ended September 30, 2025, Compared to the Three Months Ended September 30, 2024 \nTotal revenues and direct costs.\n NAST total revenues and direct costs increased primarily due to higher truckload and LTL volumes. This increase was largely offset by a decline in transportation rates and fuel surcharges within our truckload services, driven by the continued soft market conditions and decline in diesel fuel prices in the third quarter of 2025. Our average truckload linehaul rate per mile charged to customers, which excludes fuel surcharges, decreased approximately 1.5 percent in the third quarter of 2025 compared to the third quarter of 2024. Our truckload linehaul cost per mile, excluding fuel surcharges, also decreased approximately 1.5 percent in the third quarter of 2025 compared to the third quarter of 2024. \nGross profits and adjusted gross profits. \nNAST adjusted gross profits increased driven by higher adjusted gross profit per transaction in LTL services and increased volume in both LTL and truckload services. The improvement in LTL adjusted gross profit per transaction reflects the continued advancement of our dynamic pricing and costing capabilities. We continued to drive volume growth in our portfolio across several key industries including retail, energy, automotive, and healthcare. \nOperating expenses.\n NAST personnel expenses decreased driven by cost optimization efforts and productivity improvements, including lower average employee headcount. NAST other SG&A expenses increased primarily due to higher allocated corporate expenses, partially offset by lower claims expense. \nIn addition to the above, NAST personnel expenses in the third quarter of 2025 included $1.2 million of severance and related personnel expenses related to our 2025 Restructuring Program. The third quarter of 2024 included $1.2 million of severance and related personnel expenses. We also incurred $0.6 million of restructuring related other SG&A expenses in the third quarter of 2024. These expenses were both associated with our 2024 Restructuring Program. Refer to Note 13, \nRestructuring,\n for further discussion related to our restructuring programs. \n33\nTable of Contents\n \nThe operating expenses of NAST and all other segments include allocated corporate expenses. Allocated personnel expenses consist primarily of stock-based compensation allocated based upon segment participation levels in our equity plans. Remaining corporate allocations, including corporate functions and technology related expenses, are included within each segment’s other SG&A expenses, and are allocated based upon relevant segment operating metrics.\nNine Months Ended September 30, 2025, Compared to the Nine Months Ended September 30, 2024 \nTotal revenues and direct costs.\n NAST total revenues and direct costs decreased primarily due to lower fuel surcharges and lower volume in our truckload services. The decrease in fuel surcharges was driven by a year-over-year decrease in diesel fuel prices. These declines were partially offset by increased LTL volumes and a modest increase in transportation rates during the first half of 2025. Our average truckload linehaul rate per mile charged to our customers, which excludes fuel surcharges, increased approximately 1.0 percent. Our truckload linehaul cost per mile, excluding fuel surcharges, increased approximately 0.5 percent.\nGross profits and adjusted gross profits. \nNAST adjusted gross profits increased driven by higher adjusted gross profit per transaction in both truckload and LTL services. The improvement was driven by the continued advancement of our dynamic pricing and costing capabilities. These advancements have allowed us to respond more rapidly to market fluctuations through more frequent and precise pricing discovery. \nOperating expenses.\n NAST personnel expense decreased driven by cost optimization efforts and productivity improvements, including lower average employee headcount. NAST other SG&A expenses increased primarily due to higher allocated corporate expenses. These increases were partially offset by lower expenditures on purchased services, including contingent worker expenses, and lower occupancy expense.  \nIn addition to the above, NAST personnel expenses in the nine months ended September 30, 2025 included $1.9 million of severance and related personnel expenses related to our 2025 Restructuring Program. We also incurred $9.0 million of severance and related personnel expenses and $6.2 million of restructuring related other SG&A expenses in the nine months ended September 30, 2024. These expenses were both associated with our 2024 Restructuring Program. \n34\nTable of Contents\n \nGlobal Forwarding Segment Results of Operations\nThree Months Ended September 30,\nNine Months Ended September 30,\n(dollars in thousands)\n2025\n2024\n% change\n2025\n2024\n% change\nTotal revenues\n$\n786,347 \n$\n1,141,190 \n(31.1)\n%\n$\n2,359,035 \n$\n2,921,050 \n(19.2)\n%\nCosts and expenses:\nPurchased transportation and related services\n594,592 \n906,554 \n(34.4)\n%\n1,795,071 \n2,322,302 \n(22.7)\n%\nPersonnel expenses\n92,507 \n92,419 \n0.1 \n%\n268,295 \n279,077 \n(3.9)\n%\nOther selling, general, and administrative expenses\n50,227 \n54,102 \n(7.2)\n%\n152,375 \n159,022 \n(4.2)\n%\nTotal costs and expenses\n737,326 \n1,053,075 \n(30.0)\n%\n2,215,741 \n2,760,401 \n(19.7)\n%\nIncome from operations\n$\n49,021 \n$\n88,115 \n(44.4)\n%\n$\n143,294 \n$\n160,649 \n(10.8)\n%\nThree Months Ended September 30,\nNine Months Ended September 30,\n2025\n2024\n% change\n2025\n2024\n% change\nAverage employee headcount\n4,245\n4,552\n(6.7)\n%\n4,380\n4,714\n(7.1)\n%\nService line volume statistics\nOcean\n(7.0)\n%\n(3.5)\n%\nAir\n(10.0)\n%\n(11.0)\n%\nCustoms\n(1.5)\n%\n— \n%\nAdjusted gross profits\n(1)\nOcean\n$\n110,276 \n$\n163,272 \n(32.5)\n%\n$\n333,436 \n$\n392,757 \n(15.1)\n%\nAir\n34,941 \n33,143 \n5.4 \n%\n101,229 \n93,790 \n7.9 \n%\nCustoms\n36,364 \n28,266 \n28.6 \n%\n98,398 \n81,015 \n21.5 \n%\nOther \n10,174 \n9,955 \n2.2 \n%\n30,901 \n31,186 \n(0.9)\n%\nTotal adjusted gross profits\n$\n191,755 \n$\n234,636 \n(18.3)\n%\n$\n563,964 \n$\n598,748 \n(5.8)\n%\n________________________________ \n(1) \nAdjusted gross profit margin is a non-GAAP financial measure explained above. \nThree Months Ended September 30, 2025, Compared to the Three Months Ended September 30, 2024 \nTotal revenues and direct costs. \nGlobal Forwarding total revenues and direct costs decreased significantly in the third quarter of 2025 compared to the third quarter of 2024. This decrease was primarily attributable to significantly lower pricing and purchased transportation costs in ocean services, along with reduced volumes in all services. In the third quarter of 2024, ocean freight rates were elevated due to the volatile market conditions driven by re-routing and extended transit times caused by the Red Sea conflict, along with increasing challenges related to port worker strikes, equipment shortages, and worsening port congestion. These issues combined with traditional peak season volumes and severe weather events, significantly elevated ocean freight rates and purchased transportation costs in the third quarter of 2024. Market conditions in the third quarter of 2025 continued to be volatile driven by the evolving tariff landscape. Despite this volatility, market conditions have largely stabilized driven by excess capacity and weak consumer sentiment contributing to sluggish ocean freight volumes driving ocean freight rates significantly lower in the third quarter of 2025.\nGross profits and adjusted gross profits.\n Global Forwarding adjusted gross profits decreased in the third quarter of 2025 driven by significantly lower adjusted gross profit per shipment in ocean freight services, along with reduced volumes in all services. The decrease in adjusted gross profit per shipment in ocean services was driven by the significant reduction in market pricing in the third quarter of 2025 compared to the third quarter of 2024. This decrease was partially offset by an increase in customs driven by higher duty advance fees, reflecting elevated global tariff rates.\nOperating expenses.\n Personnel expenses increased slightly driven by an increase in severance and related personnel expenses related to our 2025 Restructuring Program which were offset by decreases from cost optimization efforts and productivity improvements, including lower average employee headcount, in addition to lower incentive compensation. Global Forwarding other SG&A expenses decreased driven by lower claims expense. \n35\nTable of Contents\n \nIn addition to the above, Global Forwarding personnel expenses for the third quarter of 2025 included $8.4 million of severance and related personnel expenses. We also incurred $0.1 million in other SG&A expenses the third quarter of 2025. These expenses were both associated with our 2025 Restructuring Program. Personnel expenses for the third quarter of 2024 included $0.5 million of severance and related personnel expenses. We also incurred $0.9 million in other SG&A expenses in the third quarter of 2024. These expenses were both associated with our 2024 Restructuring Program. Refer to Note 13, \nRestructuring\n, for further discussion related to our restructuring programs.\nNine Months Ended September 30, 2025, Compared to the Nine Months Ended September 30, 2024\nTotal revenues and direct costs. \nGlobal Forwarding total revenues and direct costs decreased, driven by significantly lower pricing and purchased transportation costs in ocean services, as well as volume declines in both ocean and air freight services. In the nine months ended September 30, 2024, ocean freight rates were elevated driven by persistent market disruptions, including the Red Sea conflict, which strained capacity and led to re-routing and extended transit times. These conditions along with port worker strikes, equipment shortages, worsening port congestion, and severe weather events all contributed to elevated ocean freight rates in the nine months ended September 30, 2024. While similar capacity constraints persisted during the nine months ended September 30, 2025, the period has also experienced volatility driven by the evolving tariff landscape. This volatility led to short-lived spikes in demand and pricing although elevated capacity levels and weak consumer sentiment have ultimately driven down ocean freight rates and purchased transportation costs in the nine months ended September 30, 2025. \nGross profits and adjusted gross profits.\n Global Forwarding adjusted gross profits decreased driven by lower adjusted gross profit per shipment in ocean services and reduced volumes in both ocean and air freight services. The decline in adjusted gross profit per shipment in ocean services was driven by excess capacity and weak consumer sentiment, which contributed to sluggish industry volumes in the nine months ended September 30, 2025. This compared to elevated adjusted gross profit per shipment in the nine months ended September 30, 2024 due to the disruptions facing the global forwarding market in the prior year. Partially offsetting the decline was an increase in customs adjusted gross profits driven by higher duty advance fees reflecting elevated global tariff rates in the nine months ended September 30, 2025.\nOperating expenses.\n Personnel expenses decreased driven by cost optimization efforts and productivity improvements, including lower average employee headcount, in addition to lower incentive compensation. Other SG&A expenses decreased with reductions across several expense categories, most notably lower claims expense.\nIn addition to the above, Global Forwarding personnel expenses for the nine months ended September 30, 2025 included $11.0 million of severance and related personnel expenses. We also incurred $0.1 million in other SG&A expenses the nine months ended September 30, 2025. These expenses were both associated with our 2025 Restructuring Program. Personnel expenses for the nine months ended September 30, 2024 included $5.9 million of severance and related personnel expenses. We also incurred $2.4 million of other SG&A expenses in the nine months ended September 30, 2024. These expenses were both associated with our 2024 Restructuring Program.\nAll Other and Corporate Segment Results of Operations\nAll Other and Corporate includes our Robinson Fresh and Managed Solutions segments, as well as Other Surface Transportation outside of North America and other miscellaneous revenues and unallocated corporate expenses. \nThree Months Ended September 30,\nNine Months Ended September 30,\n(dollars in thousands)\n2025\n2024\n% change\n2025\n2024\n% change\nTotal revenues\n$\n384,805 \n$\n568,834 \n(32.4)\n%\n$\n1,208,753 \n$\n1,694,411 \n(28.7)\n%\nLoss from operations\n(1,063)\n(56,763)\n(98.1)\n%\n(10,226)\n(74,071)\n(86.2)\n%\nAdjusted gross profits\n(1)\nRobinson Fresh\n40,195 \n36,708 \n9.5 \n%\n122,243 \n110,327 \n10.8 \n%\nManaged Solutions\n29,988 \n27,949 \n7.3 \n%\n86,841 \n85,637 \n1.4 \n%\nOther Surface Transportation\n— \n15,296 \n(100.0)\n%\n4,637 \n48,248 \n(90.4)\n%\nTotal adjusted gross profits\n$\n70,183 \n$\n79,953 \n(12.2)\n%\n$\n213,721 \n$\n244,212 \n(12.5)\n%\n________________________________ \n(1)\n Adjusted gross profit margin is a non-GAAP financial measure explained above. \n36\nTable of Contents\n \nThree Months Ended September 30, 2025, Compared to the Three Months Ended September 30, 2024\n \nTotal revenues and direct costs. \nTotal revenues and direct costs decreased driven by the divestiture of our Europe Surface Transportation business on February 1, 2025. Refer to Note 14, \nDivestitures\n, for further discussion related to the divestiture of our Europe Surface Transportation business. Additionally, total revenues and direct costs in our Robinson Fresh business decreased driven by lower average pricing with our retail customers. \nGross profits and adjusted gross profits.\n Robinson Fresh adjusted gross profits increased due to an increase in integrated supply chain solutions for foodservice customers. Managed Solutions adjusted gross profits increased due to an increase in freight under management. Other Surface Transportation adjusted gross profits decreased as a result of the divestiture of our Europe Surface Transportation business.\nRestructuring, lease impairment charge, and divestiture expenses.\n All Other and Corporate personnel expenses in the third quarter of 2025 included $0.1 million of severance and related personnel expenses associated with our 2025 Restructuring Program. Other SG&A expenses also included net favorable post-closing working capital adjustments of $0.2 million resulting from the divestiture of our Europe Surface Transportation business. \nPersonnel expenses in the third quarter of 2024 included $1.2 million of severance and related personnel expenses primarily associated with our 2024 Restructuring Program. We also incurred $57.1 million of other SG&A expenses in the third quarter of 2024 that included a $57.0 million loss related to the divestiture of our Europe Surface Transportation business. Refer to Note 13,\n Restructuring,\n for further discussion related to our 2025 and 2024 Restructuring Programs. Refer to Note 14, \nDivestitures\n, for further discussion related to the divestiture of our Europe Surface Transportation business.\nNine Months Ended September 30, 2025, Compared to the Nine Months Ended September 30, 2024 \nTotal revenues and direct costs. \nTotal revenues and direct costs decreased driven by the divestiture of our Europe Surface Transportation business on February 1, 2025. Partially offsetting this decrease in total revenues was an increase in total revenues in our Robinson Fresh business driven by higher volumes from retail and foodservice customers.\nGross profits and adjusted gross profits.\n Robinson Fresh adjusted gross profits increased due to an increase in integrated supply chain solutions for retail and foodservice customers. Managed Solutions adjusted gross profits increased driven by an increase in freight under management. Other Surface Transportation adjusted gross profits decreased as a result of the divestiture of our Europe Surface Transportation business. \nRestructuring, lease impairment charge, and divestiture expenses.\n Personnel expenses in the nine months ended September 30, 2025, included $1.9 million of severance and related personnel expenses associated with the divestiture of our Europe Surface Transportation business and our 2025 Restructuring Programs. We incurred $1.4 million in other SG&A expenses in the nine months ended September 30, 2025 related to the divestiture of our Europe Surface Transportation business. We also incurred $6.3 million of other SG&A expenses in the nine months ended September 30, 2025 resulting from an impairment charge on our Kansas City regional center lease resulting from the execution of a sublease agreement on a portion of the building. \nPersonnel expenses in the nine months ended September 30, 2024, included $5.4 million of severance and related personnel expenses associated with our 2024 Restructuring Program. We also incurred $60.6 million of other SG&A expenses in the nine months ended September 30, 2024, that included a $57.0 million loss related to the divestiture of our Europe Surface Transportation business.\n37\nTable of Contents\n \nLIQUIDITY AND CAPITAL RESOURCES\nWe have historically generated substantial cash from operations, which has enabled us to fund our organic growth while paying cash dividends and repurchasing stock. In addition, we maintain the following debt facilities as described in Note 4, \nFinancing Arrangements\n (in thousands):\nDescription\nCarrying Value as of September 30, 2025\nBorrowing Capacity\nMaturity\nRevolving credit facility\n$\n— \n$\n1,000,000 \nNovember 2027\nSenior Notes, Series B\n150,000 \n150,000 \nAugust 2028\nSenior Notes, Series C\n175,000 \n175,000 \nAugust 2033\nReceivables Securitization Facility\n(1)\n260,599 \n500,000 \nAugust 2027\nSenior Notes\n(1)\n597,551 \n600,000 \nApril 2028\nTotal debt\n$\n1,183,150 \n$\n2,425,000 \n______________________________________________\n(1) \nNet of unamortized discounts and issuance costs.\nWe expect to use our current debt facilities and potentially other indebtedness incurred in the future to assist us in continuing to fund working capital, capital expenditures, possible acquisitions, dividends, share repurchases or other investments.\nCash and cash equivalents totaled $136.8 million as of September 30, 2025, and $145.8 million as of December 31, 2024. Cash and cash equivalents held outside the United States totaled $135.3 million as of September 30, 2025, and $134.0 million as of December 31, 2024. \nWe prioritize our investments to grow our market share and expand globally in key industries, trade lanes, and geographies, and to digitize our customer, carrier, and internal tools to support our organic growth. We are continually looking for acquisitions, but those acquisitions must fit our culture and enhance our growth opportunities.\nThe following table summarizes our major sources and uses of cash and cash equivalents (dollars in thousands):\nNine Months Ended September 30,\n2025\n2024\nSources (uses) of cash:\nCash provided by operating activities\n$\n609,105 \n$\n241,154 \nCapital expenditures\n(54,861)\n(59,099)\nProceeds from divestiture\n27,737 \n— \nCash used for investing activities\n(27,124)\n(59,099)\nRepurchase of common stock\n(240,257)\n— \nCash dividends\n(227,053)\n(220,256)\nNet payments on debt\n(195,000)\n(20,000)\nOther financing activities\n54,094 \n56,012 \nCash used for financing activities\n(608,216)\n(184,244)\nEffect of exchange rates on cash and cash equivalents\n6,534 \n(653)\nNet change in cash and cash equivalents, including cash and cash equivalents classified within assets held for sale\n$\n(19,701)\n$\n(2,842)\nCash flows from operating activities.\n In the prior year, cash flows from operating activities were negatively impacted by increasing ocean freight rates resulting in a significant increase in net operating working capital. In the current year, our improved net income and rapidly declining ocean freight rates drove a significant improvement in cash flows provided by operating activities in the nine months ended September 30, 2025, compared to the nine months ended September 30, 2024. We continue to closely monitor credit and collections activities and the quality of our accounts receivable balance to minimize risk as well as work with our customers to facilitate the movement of goods across their supply chains while also ensuring timely payment. \n38\nTable of Contents\n \nCash flows from investing activities.\n Capital expenditures consisted primarily of investments in software, which are intended to develop and deliver scalable solutions by transforming our processes, accelerate the pace of development and prioritizing data integrity, improve our customer and carrier experience, and increase efficiency to help expand our adjusted operating margins and grow the business.\nThe sale of our Europe Surface Transportation business closed during the first quarter of 2025. We received $27.7 million of consideration at closing with the remaining consideration due in fixed equal installments on the 12-month and 18-month anniversary of the closing date subject to post-closing working capital adjustments. The remaining consideration due is collateralized by all current and future accounts receivable of the Europe Surface Transportation business. \nCash flows from financing activities.\n Net cash used for financing activities increased significantly in the nine months ended September 30, 2025 compared to the nine months ended September 30, 2024, driven by an increase in cash returned to shareholders and payments on outstanding borrowings. In the nine months ended September 30, 2025 we resumed share repurchases under our board authorization and increased our annual dividend to shareholders. Despite the increase in cash returned to shareholders our strong cash flow from operations allowed us to reduce our outstanding borrowings on debt. \nThe number of shares we repurchase, if any, during future periods will vary based on our cash position, other potential uses of our cash, and market conditions. Over the long term, we remain committed to our quarterly dividend and share repurchases to enhance shareholder value. On October 28, 2025, the Board of Directors approved an additional $2.0 billion of authorization under the company’s share repurchase program. The stock repurchase program does not obligate the company to acquire any amount of common stock and shall expire or terminate at the Board's discretion; however, the company currently expects to execute the share repurchase program over a period of approximately three years. Such repurchases, if any, will depend on prevailing market conditions, our liquidity requirements, contractual restrictions, and other factors. . \nWe may seek to retire or purchase our outstanding Senior Notes through open market cash purchases, privately negotiated transactions or otherwise.\nWe believe that, assuming no change in our current business plan, our available cash, together with expected future cash generated from operations, the amount available under our credit facilities, and credit available in the market, will be sufficient to satisfy our anticipated needs for working capital, capital expenditures, and cash dividends for at least the next 12 months and the foreseeable future. We also believe we could obtain funds under lines of credit or other forms of indebtedness on short notice, if needed.\nAs of September 30, 2025, we were in compliance with all of the covenants under our debt agreements.\nRECENTLY ISSUED ACCOUNTING PRONOUNCEMENTS \nRefer to Note 1, \nBasis of Presentation\n, contained in this Quarterly Report for a discussion of recently issued accounting pronouncements.\nCRITICAL ACCOUNTING POLICIES AND ESTIMATES\nRefer to the company's 2024 Annual Report on Form 10-K for a complete discussion regarding our critical accounting policies and estimates. As of September 30, 2025, there were no material changes to our critical accounting policies and estimates."
}