{
  "source_file": "chtr-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2.\n \n    \nManagement’s Discussion and Analysis of Financial Condition and Results of Operations.\n \nGeneral\nCharter Communications, Inc. (together with its controlled subsidiaries, “Charter”) is a leading broadband connectivity company with services available to 58 million homes and small to large businesses across 41 states through our Spectrum brand. Founded in 1993, we have evolved from providing cable TV to streaming, and from high-speed Internet to a converged broadband, WiFi and mobile experience. Over the Spectrum Fiber Broadband Network and supported by our 100% U.S.-based employees, we offer Seamless Connectivity and Entertainment with Spectrum Internet, Mobile, TV and Voice products.  \nCharter is a holding company whose principal asset is a controlling equity interest in Charter Communications Holdings, LLC (“Charter Holdings”), an indirect owner of Charter Communications Operating, LLC (“Charter Operating”) under which substantially all of the operations reside. All significant intercompany accounts and transactions among consolidated entities have been eliminated.\nThe Cox\n \nTransactions\nOn May 16, 2025, Charter, Charter Holdings, and Cox Enterprises, Inc. (“Cox Enterprises”) entered into a Transaction Agreement (the “Transaction Agreement”) pursuant to which (i) Cox Enterprises will sell and transfer to Charter 100% of the equity interests of certain subsidiaries of Cox Communications, Inc. (“Cox Communications”) that conduct Cox Communications’ commercial fiber and managed IT and cloud services businesses (the “Equity Sale”), (ii) Cox Enterprises will contribute the equity interests of Cox Communications and certain other assets (other than certain excluded assets) primarily related to Cox Communications’ residential cable business to Charter Holdings (the “Contribution”), and (iii) Cox Enterprises will pay $1.00 to Charter (collectively, the “Cox Transactions”).  Under the Transaction Agreement, Charter and Cox Enterprises may designate one or more wholly owned subsidiaries to take actions with respect to Charter and Cox Enterprises, respectively.\nPursuant to the Transaction Agreement, at the closing of the Cox Transactions (the “Closing”):\n•\nin consideration of the Equity Sale, Charter will pay $3.5 billion in cash to Cox Enterprises;\n•\nin consideration of the Contribution, Charter Holdings will (i) pay to Cox Enterprises $500 million in cash and (ii) issue to Cox Enterprises convertible preferred units of Charter Holdings with an aggregate liquidation preference of $6.0 billion, which will pay a 6.875% dividend per annum, and approximately 33.6 million Charter Holdings common units. The Charter Holdings convertible preferred units will be convertible into Charter Holdings common units, with an initial conversion price of $477.41, subject to certain adjustments. The Charter Holdings common units will be exchangeable by the holder, in certain circumstances, for cash or, at the election of Charter, Charter Class A common stock on a one-for-one basis, subject to certain adjustments; and\n•\nin consideration of the $1.00 payment from Cox Enterprises to Charter, Charter will issue to Cox Enterprises one share of the newly created Charter Class C common stock. The Charter Class C common stock will be equivalent, economically, to the outstanding Charter Class A common stock and the Charter Class B common stock but will have a number of votes per share that reflect the voting power of the Charter Holdings common units and the Charter Holdings convertible preferred units held by Cox Enterprises on an as-converted, as-exchanged basis.\nThe combined entity will assume Cox Communications’ approximately $12.4 billion in outstanding net debt and finance leases.\nOverview\nDuring the third quarter of 2025, we added 493,000 mobile lines and video losses improved as compared to the prior year period.  Internet losses remained relatively flat as compared to the prior year period.  Sales were challenged by the competitive environment offset by lower customer churn.  However, we remain focused on improving customer results through our pricing and packaging strategy launched in September 2024 and our brand platform, Life Unlimited.  Life Unlimited emphasizes the power of our advanced network and cutting-edge connectivity products and services, and our simplified pricing and packaging strategy better utilizes our seamless connectivity and entertainment products to offer lower promotional and persistent bundled pricing to drive growth.  Our Internet and mobile product bundles provide a differentiated connectivity experience by bringing together Spectrum Internet, Advanced WiFi and Unlimited Spectrum Mobile to offer consumers fast, reliable and secure online connections on their favorite devices at home and on the go in high-value packages.  We have completed deals with every \n15\n \nmajor programmer to deliver better flexibility and greater value to our customers by including seamless entertainment applications with our Spectrum TV services at no additional cost.  In July 2025, we began launching the sale of these seamless entertainment applications to customers à la carte and just recently launched the Spectrum App Store, a digital storefront that helps customers activate, upgrade, buy and manage their streaming applications in one place.  We also continue to evolve other elements of our video product and are deploying Xumo stream boxes to new video customers.  \nOur new customer commitments focus on reliable connectivity, transparency, exceptional service and always improving.  By continually improving our product set and offering consumers the opportunity to save money by switching to our services, we believe we can continue to penetrate our expanding footprint and sell additional products to our existing customers.  We see operational benefits from the targeted investments we made in employee wages and benefits to build employee skill sets and tenure, as well as the continued investments in digitization of our customer service platforms, all with the goal of improving the customer experience, reducing transactions and driving customer growth and retention.  \nWe spent $582 million and $1.6 billion on our subsidized rural construction initiative during the three and nine months ended September 30, 2025 and activated approximately 124,000 and 336,000 subsidized rural passings, respectively.  And we are upgrading our network to deliver symmetrical and multi-gigabit speeds across our footprint as part of our network evolution initiative.  \nWe realized revenue, Adjusted EBITDA and income from operations during the periods presented as follows (in millions; all percentages are calculated using whole numbers; minor differences may exist due to rounding):\nThree Months Ended September 30,\nNine Months Ended September 30,\n2025\n2024\n% Change\n2025\n2024\n% Change\nRevenues\n$\n13,672 \n$\n13,795 \n(0.9)\n%\n$\n41,173 \n$\n41,159 \n0.0 \n%\nAdjusted EBITDA\n$\n5,561 \n$\n5,647 \n(1.5)\n%\n$\n17,017 \n$\n16,809 \n1.2 \n%\nIncome from operations\n$\n3,131 \n$\n3,335 \n(6.1)\n%\n$\n9,647 \n$\n9,729 \n(0.8)\n%\nAdjusted EBITDA is defined as net income attributable to Charter shareholders plus net income attributable to noncontrolling interest, interest expense, net, income taxes, depreciation and amortization, stock compensation expense, other income (expenses), net and other operating (income) expenses, net, such as special charges, merger and acquisition costs and (gain) loss on sale or retirement of assets.  See “Use of Adjusted EBITDA and Free Cash Flow” for further information on Adjusted EBITDA and free cash flow.  \nTotal revenues decreased slightly during the three months ended September 30, 2025 and remained relatively constant during the nine months ended September 30, 2025 compared to the corresponding periods in 2024 primarily due to lower customers and lower advertising sales offset by mobile line growth and higher average revenue per customer.  Adjusted EBITDA and income from operations were also impacted by an increase in marketing and residential sales expense.\n16\n \nThe following table summarizes our customer statistics for Internet, mobile, video and voice as of September 30, 2025 and 2024 (in thousands except per customer data and footnotes).  \nApproximate as of\nSeptember 30,\n2025 \n(a)\n2024 \n(a)\nCustomer Relationships \n(b)\nResidential \n28,860 \n29,465 \nSmall Business\n2,198 \n2,223 \nTotal Customer Relationships\n31,058 \n31,688 \nMonthly Residential Revenue per Residential Customer \n(c)\n$\n122.63 \n$\n121.47 \nMonthly Small Business Revenue per Small Business Customer \n(d)\n$\n164.61 \n$\n164.38 \nInternet \nResidential\n27,760 \n28,205 \nSmall Business\n2,034 \n2,052 \nTotal Internet Customers\n29,794 \n30,257 \nMobile Lines \n (e)\nResidential\n11,015 \n9,057 \nSmall Business\n375 \n297 \nTotal Mobile Lines\n11,390 \n9,354 \nVideo\nResidential\n12,023 \n12,437 \nSmall Business\n538 \n578 \nTotal Video Customers\n12,561 \n13,015 \nVoice\nResidential\n4,967 \n5,895 \nSmall Business\n1,219 \n1,263 \nTotal Voice Customers\n6,186 \n7,158 \nMid-Market & Large Business Primary Service Units (\"PSUs\") \n(f)\n336\n315 \n(a)\nWe calculate the aging of customer accounts based on the monthly billing cycle for each account in accordance with our collection policies.  On that basis, as of September 30, 2025 and 2024, customers include approximately 87,100 and 127,300 customers, respectively, whose accounts were over 60 days past due, approximately 10,500 and 11,900 customers, respectively, whose accounts were over 90 days past due and approximately 13,200 and 11,800 customers, respectively, whose accounts were over 120 days past due.  Past due totals as of September 30, 2025 reflect in part certain revisions to customer account balances generated by changes to our collection procedures initiated in the third quarter of 2025, which were made to better align with industry practices.          \n(b)\nCustomer relationships include the number of customers that receive one or more levels of service, encompassing Internet, mobile, video and voice services, without regard to which service(s) such customers receive.  Customers who reside in residential multiple dwelling units (“MDUs”) and that are billed under bulk contracts are counted based on the number of billed units within each bulk MDU.  Total customer relationships exclude mid-market & large business and mobile-only customer relationships.  \n(c)\nMonthly residential revenue per residential customer is calculated as total residential quarterly revenue divided by three divided by average residential customer relationships during the respective quarter and excludes mobile-only customers.\n(d)\nMonthly small business revenue per small business customer is calculated as total small business quarterly revenue divided by three divided by average small business customer relationships during the respective quarter and excludes mobile-only customers.\n(e)\nMobile lines include phones and tablets which require one of our standard rate plans (e.g., \"Unlimited\" or \"By the Gig\").  Mobile lines exclude wearables and other devices that do not require standard phone rate plans.\n17\n \n(f)\nMid-market & large business PSUs represent the aggregate number of fiber service offerings counting each separate service offering at each customer location as an individual PSU.\nCritical Accounting Policies and Estimates\n \nFor a discussion of our critical accounting policies and the means by which we develop estimates, see “Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations” in our 2024 Annual Report on Form 10-K.  There have been no material changes from the critical accounting policies described in our Form 10-K.\nResults of Operations\n \nThe following table sets forth the consolidated statements of operations for the periods presented (dollars in millions, except per share data): \nThree Months Ended September 30,\nNine Months Ended September 30,\n2025\n2024\n2025\n2024\nRevenues\n$\n13,672 \n$\n13,795 \n$\n41,173 \n$\n41,159 \nCosts and Expenses:\nOperating costs and expenses (exclusive of items shown separately below)\n8,262 \n8,294 \n24,686 \n24,863 \nDepreciation and amortization\n2,160 \n2,145 \n6,517 \n6,505 \nOther operating expenses, net\n119 \n21 \n323 \n62 \n10,541 \n10,460 \n31,526 \n31,430 \nIncome from operations\n3,131 \n3,335 \n9,647 \n9,729 \nOther Income (Expenses):\nInterest expense, net\n(1,268)\n(1,311)\n(3,772)\n(3,955)\nOther expenses, net\n(129)\n(144)\n(378)\n(318)\n(1,397)\n(1,455)\n(4,150)\n(4,273)\nIncome before income taxes\n1,734 \n1,880 \n5,497 \n5,456 \nIncome tax expense\n(418)\n(406)\n(1,277)\n(1,279)\nConsolidated net income \n1,316 \n1,474 \n4,220 \n4,177 \nLess: Net income attributable to noncontrolling interests\n(179)\n(194)\n(565)\n(560)\nNet income attributable to Charter shareholders\n$\n1,137 \n$\n1,280 \n$\n3,655 \n$\n3,617 \nEARNINGS PER COMMON SHARE ATTRIBUTABLE TO CHARTER SHAREHOLDERS:\nBasic\n$\n8.50 \n$\n8.99 \n$\n26.52 \n$\n25.23 \nDiluted\n$\n8.34 \n$\n8.82 \n$\n25.95 \n$\n24.86 \nWeighted average common shares outstanding, basic\n133,763,886 \n142,308,740 \n137,825,025 \n143,379,041 \nWeighted average common shares outstanding, diluted\n136,395,133 \n145,059,470 \n140,826,301 \n145,489,370 \nRevenues.\n \n Total revenues decreased $123 million during the three months ended September 30, 2025 and remained relatively constant during the nine months ended September 30, 2025 compared to the corresponding periods in 2024.  The decrease during the three months ended September 30, 2025 was primarily due to lower customers and lower advertising sales, partly offset by growth in mobile lines and average revenue per customer.\n \n18\n \nRevenues by service offering were as follows (dollars in millions; all percentages are calculated using whole numbers; minor differences may exist due to rounding): \nThree Months Ended September 30,\nNine Months Ended September 30,\n2025\n2024\n% Change\n2025\n2024\n% Change\nInternet\n$\n5,971 \n$\n5,872 \n1.7 \n%\n$\n17,870 \n$\n17,504 \n2.1 \n%\nMobile service\n954 \n801 \n19.2 \n%\n2,789 \n2,223 \n25.5 \n%\nConnectivity\n6,925 \n6,673 \n3.8 \n%\n20,659 \n19,727 \n4.7 \n%\nVideo\n3,388 \n3,735 \n(9.3)\n%\n10,452 \n11,510 \n(9.2)\n%\nVoice\n332 \n360 \n(7.9)\n%\n1,034 \n1,084 \n(4.6)\n%\nResidential revenue\n10,645 \n10,768 \n(1.1)\n%\n32,145 \n32,321 \n(0.5)\n%\nSmall business\n1,086 \n1,096 \n(0.9)\n%\n3,266 \n3,285 \n(0.6)\n%\nMid-market & large business\n749 \n723 \n3.6 \n%\n2,227 \n2,152 \n3.5 \n%\nCommercial revenue\n1,835 \n1,819 \n0.9 \n%\n5,493 \n5,437 \n1.0 \n%\nAdvertising sales\n356 \n452 \n(21.3)\n%\n1,067 \n1,240 \n(14.0)\n%\nOther\n836 \n756 \n10.7 \n%\n2,468 \n2,161 \n14.2 \n%\n$\n13,672 \n$\n13,795 \n(0.9)\n%\n$\n41,173 \n$\n41,159 \n0.0 \n%\nThe increase in Internet revenues from our residential customers is attributable to the following (dollars in millions):\nThree months ended \nSeptember 30, 2025\ncompared to \nthree months ended \nSeptember 30, 2024\nNine months ended \nSeptember 30, 2025\ncompared to \nnine months ended \nSeptember 30, 2024\nIncrease related to rate and product mix changes\n$\n193 \n$\n663 \nDecrease in average residential Internet customers\n(94)\n(297)\n$\n99 \n$\n366 \nThe increase related to rate and product mix was primarily due to promotional rate step-ups, rate adjustments, and a favorable change in bundled revenue allocation.  Residential Internet customers decreased by 445,000 customers from September 30, 2024 to September 30, 2025.        \nThe increase in mobile service revenues from our residential customers is attributable to the following (dollars in millions):\nThree months ended \nSeptember 30, 2025\ncompared to \nthree months ended \nSeptember 30, 2024\nNine months ended \nSeptember 30, 2025\ncompared to \nnine months ended \nSeptember 30, 2024\nIncrease in average residential mobile lines\n$\n180 \n$\n545 \nIncrease (decrease) related to rate \n(27)\n21 \n$\n153 \n$\n566 \nResidential mobile lines increased by 2.0 million mobile lines from September 30, 2024 to September 30, 2025.  \n19\n \nVideo revenues consist primarily of revenues from video services provided to our residential customers, as well as franchise fees, equipment service fees and video installation revenue.  The decrease in video revenues is attributable to the following (dollars in millions):\nThree months ended \nSeptember 30, 2025\ncompared to \nthree months ended \nSeptember 30, 2024\nNine months ended \nSeptember 30, 2025\ncompared to \nnine months ended \nSeptember 30, 2024\nDecrease in average residential video customers\n$\n(154)\n$\n(713)\nDecrease related to rate and product mix changes\n(112)\n(151)\nIncrease in seamless entertainment allocation\n(81)\n(194)\n$\n(347)\n$\n(1,058)\nResidential video customers decreased by 414,000 from September 30, 2024 to September 30, 2025. The decrease related to rate and product mix was primarily due to a higher mix of lower priced video packages within our video customer base and more unfavorable bundled revenue allocation, partly offset by promotional rate step-ups and video rate adjustments that pass-through programming rate increases.  Seamless entertainment allocation represents programming costs netted within video revenue.  The growth is due to more seamless entertainment applications and higher activations.\nThe decrease in voice revenues from our residential customers is attributable to the following (dollars in millions):\nThree months ended \nSeptember 30, 2025\ncompared to \nthree months ended \nSeptember 30, 2024\nNine months ended \nSeptember 30, 2025\ncompared to \nnine months ended \nSeptember 30, 2024\nDecrease in average residential voice customers\n$\n(58)\n$\n(177)\nIncrease related to rate adjustments\n30 \n127 \n$\n(28)\n$\n(50)\nResidential wireline voice customers decreased by 928,000 customers from September 30, 2024 to September 30, 2025.     \nThe decrease in small business revenues is attributable to the following (dollars in millions):\nThree months ended \nSeptember 30, 2025\ncompared to \nthree months ended \nSeptember 30, 2024\nNine months ended \nSeptember 30, 2025\ncompared to \nnine months ended \nSeptember 30, 2024\nDecrease in average small business customers\n$\n(11)\n$\n(23)\nIncrease related to rate and product mix changes\n1 \n4 \n$\n(10)\n$\n(19)\nSmall business customers decreased by 25,000 from September 30, 2024 to September 30, 2025.  \nMid-market & large business revenues increased $26 million and $75 million during the three and nine months ended September 30, 2025, respectively, compared to the corresponding periods in 2024 primarily due to an increase in Internet PSUs.  Mid-market & large business PSUs increased 21,000 from September 30, 2024 to September 30, 2025. \nAdvertising sales revenues consist primarily of revenues from commercial advertising customers, programmers and other vendors, as well as local cable and advertising on regional sports and news channels.  Advertising sales revenues decreased $96 million and $173 million during the three and nine months ended September 30, 2025, respectively, as compared to the corresponding periods in 2024 primarily due to a decrease in political, national and local ad revenue partly offset by higher enterprise advanced advertising.   \n20\n \nOther revenues consist of revenue from mobile and video device sales, processing fees, regional sports and news channels (excluding intercompany charges or advertising sales on those channels), Rural Development Opportunity Fund (“RDOF”) subsidy revenue, home shopping, wire maintenance fees and other miscellaneous revenues.  Other revenues increased $80 million and $307 million during the three and nine months ended September 30, 2025, respectively, compared to the corresponding periods in 2024 primarily due to higher mobile device sales.   \nOperating costs and expenses\n.\n  The change in our operating costs and expenses, exclusive of items shown separately in the consolidated statements of operations, are attributable to the following (dollars in millions):\nThree months ended \nSeptember 30, 2025\ncompared to \nthree months ended \nSeptember 30, 2024\nNine months ended \nSeptember 30, 2025\ncompared to \nnine months ended \nSeptember 30, 2024\nProgramming\n$\n(152)\n$\n(639)\nOther costs of revenue\n73 \n312 \nField and technology operations\n3 \n48 \nCustomer operations\n(19)\n(33)\nMarketing and residential sales\n50 \n194 \nOther\n13 \n(59)\n$\n(32)\n$\n(177)\nProgramming costs were approximately $2.2 billion and $2.3 billion for the three months ended September 30, 2025 and 2024, representing 26% and 28% of total operating costs and expenses, respectively, and $6.7 billion and $7.4 billion for the nine months ended September 30, 2025 and 2024, representing 27% and 30% of total operating costs and expenses, respectively.  Programming costs consist primarily of costs paid to programmers for basic, premium, video on demand, and pay-per-view programming. Programming costs decreased as a result of fewer video customers and a higher mix of lower cost video packages within our video customer base as well as costs allocated to seamless entertainment applications and netted within video revenue, partly offset by contractual rate adjustments, including renewals and increases in amounts paid for retransmission consent.  \nOther costs of revenue increased $73 million and $312 million during the three and nine months ended September 30, 2025, respectively, compared to the corresponding periods in 2024 primarily due to higher mobile service direct costs and mobile device sales due to an increase in mobile lines.  \nField and technology operations increased $3 million and $48 million during the three and nine months ended September 30, 2025, respectively, compared to the corresponding periods in 2024 primarily due to higher network utilities and pole rent expense.\nCustomer operations decreased $19 million during the three months ended September 30, 2025 compared to the corresponding period in 2024 primarily due to lower bad debt expense.  Customer operations decreased $33 million during the nine months ended September 30, 2025 compared to the corresponding period in 2024 primarily due to lower labor costs, partly offset by higher bad debt expense.\nMarketing and residential sales increased $50 million and $194 million during the three and nine months ended September 30, 2025, respectively, compared to the corresponding periods in 2024 primarily due to a change in sales mix to higher cost sales channels.\nOther expense increased $13 million and decreased $59 million during the three and nine months ended September 30, 2025, respectively, compared to the corresponding periods in 2024.  The decrease during the nine months ended September 30, 2025 compared to the corresponding period in 2024 is primarily due to one-time favorable adjustments of $75 million.  \nDepreciation and amortization.\n \nDepreciation and amortization expense increased $15 million and $12 million during the three and nine months ended September 30, 2025, respectively, compared to the corresponding periods in 2024.  \n21\n \nOther operating expenses, net.  \nThe change in other operating expenses, net is attributable to the following (dollars in millions):\nThree months ended \nSeptember 30, 2025\ncompared to \nthree months ended \nSeptember 30, 2024\nNine months ended \nSeptember 30, 2025\ncompared to \nnine months ended \nSeptember 30, 2024\nSpecial charges, net\n$\n73 \n$\n44 \nMerger and acquisition costs\n21 \n65 \n(Gain) loss on disposal of assets, net\n4 \n152 \n$\n98 \n$\n261 \nSee Note 10 to the accompanying consolidated financial statements contained in “Item 1. Financial Statements” for more information.\nInterest expense, net. \n \nNet interest expense decreased by $43 million and $183 million for the three and nine months ended September 30, 2025, respectively, compared to the corresponding periods in 2024 primarily due to a decrease in weighted average interest rates and debt. \nOther expenses, net.  \nThe change in other expenses, net is attributable to the following (dollars in millions):\nThree months ended \nSeptember 30, 2025\ncompared to \nthree months ended \nSeptember 30, 2024\nNine months ended \nSeptember 30, 2025\ncompared to \nnine months ended \nSeptember 30, 2024\nLoss on equity investments, net\n$\n(11)\n$\n(48)\nLoss on financial instruments, net (see Note 8)\n44 \n17 \nGain (loss) on extinguishment of debt (see Note 4)\n(28)\n(37)\nNet periodic pension benefit\n10 \n8 \n$\n15 \n$\n(60)\nSee Note 10 and the Notes referenced above to the accompanying consolidated financial statements contained in “Item 1. Financial Statements” for more information.\nIncome tax expense.\n \nWe recognized income tax expense of $418 million and $1.3 billion for the three and nine months ended September 30, 2025, respectively, and $406 million and $1.3 billion for the three and nine months ended September 30, 2024, respectively.    \nNet income attributable to noncontrolling interest.\n  Net income attributable to noncontrolling interest for financial reporting purposes represents Advance/Newhouse Partnership's (“A/N”) portion of Charter Holdings’ net income based on its effective common unit ownership interest.  For more information, see Note 7 to the accompanying consolidated financial statements contained in “Item 1. Financial Statements.”\nNet income attributable to Charter shareholders.\n Net income attributable to Charter shareholders decreased $143 million and increased $38 million during the three and nine months ended September 30, 2025, respectively, compared to the corresponding periods in 2024 primarily as a result of the factors described above.  \nUse of Adjusted EBITDA\n \nand Free Cash Flow\nWe use certain measures that are not defined by U.S. generally accepted accounting principles (“GAAP”) to evaluate various aspects of our business. Adjusted EBITDA and free cash flow are non-GAAP financial measures and should be considered in addition to, not as a substitute for, net income attributable to Charter shareholders and net cash flows from operating activities reported in accordance with GAAP. These terms, as defined by us, may not be comparable to similarly titled measures used by \n22\n \nother companies. Adjusted EBITDA and free cash flow are reconciled to net income attributable to Charter shareholders and net cash flows from operating activities, respectively, below.\nAdjusted EBITDA eliminates the significant non-cash depreciation and amortization expense that results from the capital-intensive nature of our businesses as well as other non-cash or special items, and is unaffected by our capital structure or investment activities. However, this measure is limited in that it does not reflect the periodic costs of certain capitalized tangible and intangible assets used in generating revenues and our cash cost of financing. These costs are evaluated through other financial measures.    \nFree cash flow is defined as net cash flows from operating activities, less capital expenditures and changes in accrued expenses related to capital expenditures.\nManagement and Charter’s board of directors use Adjusted EBITDA and free cash flow to assess our performance and our ability to service our debt, fund operations and make additional investments with internally generated funds. In addition, Adjusted EBITDA generally correlates to the leverage ratio calculation under our credit facilities or outstanding notes to determine compliance with the covenants contained in the facilities and notes (all such documents have been previously filed with the Securities and Exchange Commission (the “SEC”)). For the purpose of calculating compliance with leverage covenants, we use Adjusted EBITDA, as presented, excluding certain expenses paid by our operating subsidiaries to other Charter entities. Our debt covenants refer to these expenses as management fees, which were $350 million and $1.1 billion for the three and nine months ended September 30, 2025, respectively, and $373 million and $1.1 billion for the three and nine months ended September 30, 2024, respectively.\nA reconciliation of Adjusted EBITDA and free cash flow to net income attributable to Charter shareholders and net cash flows from operating activities, respectively, is as follows (dollars in millions): \nThree Months Ended September 30,\nNine Months Ended September 30,\n2025\n2024\n2025\n2024\nNet income attributable to Charter shareholders\n$\n1,137 \n$\n1,280 \n$\n3,655 \n$\n3,617 \nPlus:  Net income attributable to noncontrolling interest\n179 \n194 \n565 \n560 \nInterest expense, net\n1,268 \n1,311 \n3,772 \n3,955 \nIncome tax expense\n418 \n406 \n1,277 \n1,279 \nDepreciation and amortization\n2,160 \n2,145 \n6,517 \n6,505 \nStock compensation expense\n151 \n146 \n530 \n513 \nOther, net\n248 \n165 \n701 \n380 \nAdjusted EBITDA\n$\n5,561 \n$\n5,647 \n$\n17,017 \n$\n16,809 \nNet cash flows from operating activities\n$\n4,480 \n$\n3,905 \n$\n12,316 \n$\n10,970 \nLess:  Purchases of property, plant and equipment\n(3,051)\n(2,563)\n(8,324)\n(8,207)\nChange in accrued expenses related to capital expenditures\n192 \n277 \n239 \n510 \nFree cash flow\n$\n1,621 \n$\n1,619 \n$\n4,231 \n$\n3,273 \nLiquidity and Capital Resources\n \nOverview \nWe have significant amounts of debt and require significant cash to fund principal and interest payments on our debt. The principal amount of our debt as of September 30, 2025 was $95.0 billion, consisting of $12.4 billion of credit facility debt, $55.4 billion of investment grade senior secured notes and $27.3 billion of high-yield senior unsecured notes.  Our split credit rating allows us to access both the investment grade debt and the high yield debt markets.  Additionally, our bankruptcy remote special purpose vehicle is the borrower of a senior secured revolving credit facility to finance the purchase of equipment installment plan receivables with a number of financial institutions (the “EIP Financing Facility”).  As of September 30, 2025, \n23\n \nthe carrying value of the EIP Financing Facility was $1.4 billion.  For more information on the EIP Financing Facility, see Note 5 to the accompanying consolidated financial statements contained in “Item 1. Financial Statements.” \nOur projected cash needs and projected sources of liquidity depend upon, among other things, our actual results, and the timing and amount of our expenditures.  Free cash flow was $1.6 billion and $4.2 billion for the three and nine months ended September 30, 2025, respectively, and $1.6 billion and $3.3 billion for the three and nine months ended September 30, 2024, respectively.  See the table below for factors impacting free cash flow during the three and nine months ended September 30, 2025 compared to the corresponding prior periods.  As of September 30, 2025, the amount available under our credit facilities was approximately $4.0 billion and cash on hand was approximately $464 million.  We expect to utilize free cash flow, cash on hand and availability under our credit facilities as well as future refinancing transactions to further extend the maturities of our obligations. The timing and terms of any refinancing transactions will be subject to market conditions among other considerations. Additionally, we may, from time to time, and depending on market conditions and other factors, use cash on hand and the proceeds from securities offerings or other borrowings to retire our debt through open market purchases, privately negotiated purchases, tender offers or redemption provisions. We believe we have sufficient liquidity from cash on hand, free cash flow and Charter Operating’s revolving credit facility as well as access to the capital markets to fund our projected cash needs.\nWe continue to evaluate the deployment of our cash on hand and anticipated future free cash flow, including investing in our business growth and other strategic opportunities, including expanding the capacity of our network, the expansion of our network through our rural broadband construction initiative, the build-out and deployment of our CBRS spectrum, and mergers and acquisitions as well as stock repurchases and dividends.  Charter's leverage ratio of net debt to the last twelve months Adjusted EBITDA was 4.2 times as of September 30, 2025.  Charter plans to maintain a leverage ratio, pro forma for the closing of the Liberty Broadband Corporation (“Liberty Broadband”) Combination near the midpoint of its stated range of 4 to 4.5 times Adjusted EBITDA in the period leading up to the Closing, and up to 3.5 times Adjusted EBITDA at the Charter Operating first lien level.  Charter plans to adjust its long-term target leverage range after the Closing to 3.5 to 4.0 times Adjusted EBITDA but will still have a significant amount of debt.  As Adjusted EBITDA grows, we expect to increase the total amount of our indebtedness to maintain leverage within Charter's target leverage range.  \nExcluding purchases from Liberty Broadband discussed below, during the three and nine months ended September 30, 2025, Charter purchased in the public market approximately 6.4 million and 10.6 million shares of Charter Class A common stock for approximately $1.8 billion and $3.4 billion, respectively, and during the three and nine months ended September 30, 2024, Charter purchased in the public market approximately 0.3 million and 2.7 million shares of Charter Class A common stock for approximately $108 million and $822 million, respectively.  Since the beginning of its buyback program in September 2016 through September 30, 2025, Charter has purchased approximately 176.8 million shares of Class A common stock and Charter Holdings common units for approximately $78.0 billion, including purchases from Liberty Broadband and A/N discussed below.  \nOn November 12, 2024, Charter, Liberty Broadband, Fusion Merger Sub 1, LLC, a wholly owned subsidiary of Charter, and Fusion Merger Sub 2, Inc., a wholly owned subsidiary of Fusion Merger Sub 1, LLC, entered into an Agreement and Plan of Merger (as it may be amended or supplemented from time to time, the “Merger Agreement”), pursuant to which, subject to the terms and conditions set forth therein, Charter will acquire Liberty Broadband through the merger of Fusion Merger Sub 2, Inc. with and into Liberty Broadband (the “Merger”), with Liberty Broadband surviving the Merger and becoming an indirect wholly owned subsidiary of Charter.  Immediately following the Merger, Liberty Broadband, as the surviving corporation of the Merger, will merge with and into Fusion Merger Sub 1, LLC (the “Upstream Merger” and together with the Merger, the “Liberty Broadband Combination”), with Fusion Merger Sub 1, LLC surviving the Upstream Merger as a wholly owned subsidiary of Charter. \nOn November 12, 2024, Charter and Liberty Broadband also entered into Amendment No. 1 to the Second Amended and Restated Stockholders Agreement and the Letter Agreement (the “Stockholders and Letter Agreement Amendment”). The Stockholders and Letter Agreement Amendment sets forth, among other things, the terms of Liberty Broadband’s participation in Charter’s share repurchases during the period between the execution of the Merger Agreement and the effective time of the Merger.  Pursuant to the Stockholders and Letter Agreement Amendment, each month during the pendency of the proposed transaction, Charter will repurchase shares of Charter Class A common stock from Liberty Broadband in an amount equal to the greater of (i) $100 million and (ii) the Liberty Broadband minimum liquidity threshold as set forth in the Stockholders and Letter Agreement Amendment, provided that if any repurchase would reduce Liberty Broadband’s equity interest in Charter below 25.25% after giving effect to such repurchase or if all or a portion of such repurchase is not permitted under applicable law, then Charter shall instead loan to Liberty Broadband an amount equal to the lesser of (x) the repurchase amount that cannot be repurchased and (y) the Liberty Broadband minimum liquidity threshold as set forth in the Stockholders and Letter \n24\n \nAgreement Amendment less the repurchase amount that is repurchased, with such loan on the terms set forth in the Stockholders and Letter Agreement Amendment.  From and after the date Liberty Broadband’s exchangeable debentures are no longer outstanding, the amount of monthly repurchases will be the lesser of (i) $100 million and (ii) an amount equal to the sum of (x) the amount needed, in the reasonable judgment of Charter, to maintain an unrestricted cash balance of Liberty Broadband and its subsidiaries (other than GCI Holdings, LLC, GCI Spinco (as defined in the Merger Agreement) and their respective subsidiaries) of $50 million plus (y) the aggregate outstanding principal amount of the Liberty Broadband margin loan.  The purchase price payable by Charter to Liberty Broadband in connection with such monthly repurchases will equal (i) the average price paid by Charter for shares of Charter Class A common stock repurchased during the immediately preceding calendar month (excluding shares repurchased from A/N and certain other excluded repurchases) or (ii) if Charter has not engaged in any repurchases of shares of Charter Class A common stock during the immediately preceding calendar month (other than any repurchases from A/N and certain other excluded repurchases), a purchase price based on a Bloomberg volume-weighted average price methodology proposed by Charter and reasonably acceptable to Liberty Broadband. Liberty Broadband will apply the proceeds from any such repurchases or borrowings from Charter to repay certain of its outstanding indebtedness in accordance with the Stockholders and Letter Agreement Amendment. The Stockholders and Letter Agreement Amendment provides that Liberty Broadband will be exempt from the standstill restrictions and the ownership cap under the Second Amended and Restated Stockholders Agreement among Charter, Liberty Broadband and A/N, dated as of May 23, 2015 to the extent its ownership in Charter exceeds such ownership cap solely as a result of the repurchase provisions in the Stockholders and Letter Agreement Amendment. During the three and nine months ended September 30, 2025, Charter purchased from Liberty Broadband 0.9 million and 2.5 million shares of Charter Class A common stock for approximately $300 million and $900 million, respectively, and during the three and nine months ended September 30, 2024, Charter purchased from Liberty Broadband 0.4 million and 0.7 million shares of Charter Class A common stock for approximately $110 million and $226 million, respectively.  \nIn December 2016, Charter and A/N entered into a letter agreement, as amended in December 2017 (the “Existing A/N Letter Agreement”), that requires A/N to sell to Charter or to Charter Holdings, on a monthly basis, a number of shares of Charter Class A common stock or Charter Holdings common units that represents a pro rata participation by A/N and its affiliates in any repurchases of shares of Charter Class A common stock from persons other than A/N effected by Charter during the immediately preceding calendar month, at a purchase price equal to the average price paid by Charter for the shares repurchased from persons other than A/N during such immediately preceding calendar month. In connection with the Cox Transactions, Charter, Charter Holdings and A/N entered into an amendment to the Existing A/N Repurchase Letter, dated as of May 16, 2025 (the “A/N Repurchase Letter Amendment”) which sets forth, among other things, the updated terms of A/N’s participation in Charter’s share repurchases going forward.  The right to participate pro rata in repurchases on the terms and conditions set forth in the A/N Repurchase Letter Amendment is effective only from the earlier of the Closing and, in the event the Transaction Agreement is terminated in accordance with its terms, the date of such termination (such earlier date, the “Trigger Date”). Prior to the Trigger Date, the Existing A/N Letter Agreement will remain in full force and continue to govern A/N’s participation in Charter’s share repurchases, except for certain specific amendments set forth in the A/N Repurchase Letter Amendment which became effective upon execution of the A/N Repurchase Letter Amendment, including, in certain circumstances, where A/N elects not to participate in redemptions by Charter Holdings because such participation would cause A/N’s equity interest in Charter to be less than 11% prior to the Trigger Date, A/N may, subject to certain conditions, elect to receive a tax loan from Charter Holdings on the terms set forth in the A/N Repurchase Letter Amendment and in definitive documents in form and substance reasonably satisfactory to Charter and A/N.  During the three and nine months ended September 30, 2025, Charter Holdings purchased from A/N 0.3 million and 1.0 million Charter Holdings common units for approximately $121 million and $373 million, respectively, and during the three and nine months ended September 30, 2024, Charter Holdings purchased from A/N 0.1 million and 0.6 million Charter Holdings common units for approximately $44 million and $185 million, respectively.\nOn August 4, 2025, Charter received a notice from A/N pursuant to the Existing Letter Agreement, whereby A/N notified Charter that A/N was suspending the standing share repurchase agreement between A/N and Charter (the “Suspension”). The Suspension took effect immediately after the first repurchase closing date under the Existing Letter Agreement to occur following the date of the notice.  In the notice, A/N informed Charter that it intends for the Suspension to continue through the consummation of the closing of the Cox Transactions or the termination thereof, but reserved the right to end such Suspension before or after such time.\nAs of September 30, 2025, Charter had remaining board authority to purchase an additional $252 million of Charter’s Class A common stock and/or Charter Holdings common units, excluding purchases from Liberty Broadband.  Although Charter expects to continue to buy back its common stock consistent with its leverage target range, Charter is not obligated to acquire any particular amount of common stock, and the timing of any purchases that may occur cannot be predicted and will largely \n25\n \ndepend on market conditions and other potential uses of capital.\n \nPurchases may include open market purchases, tender offers or negotiated transactions.\nAs possible acquisitions, swaps or dispositions arise, we actively review them against our objectives including, among other considerations, improving the operational efficiency, geographic clustering of assets, product development or technology capabilities of our business and achieving appropriate return targets, and we may participate to the extent we believe these possibilities present attractive opportunities. However, there can be no assurance that we will actually complete any acquisitions, including the Cox Transactions, dispositions or system swaps, or that any such transactions will be material to our operations or results.\nNew Tax Legislation\nOn July 4, 2025, the One Big Beautiful Bill Act (“OBBBA”) was enacted into law.  The OBBBA contains numerous business tax provisions, including business extenders made permanent such as restoration of 100% bonus depreciation, IRC Section 174 expensing for US-based research, and the EBITDA-based business interest expense limitation under IRC Section 163(j).  The OBBBA reduced cash paid for taxes during the three and nine months ended September 30, 2025.\nRecent Events\nIn July 2025, Charter Operating and Charter Communications Operating Capital Corp. paid in full all of their outstanding 4.908% senior secured notes due 2025 at maturity.\nIn September 2025, Charter Operating and Charter Communications Operating Capital Corp. jointly issued $1.25 billion of 5.850% senior secured notes due December 2035 at a price of 99.932% of the aggregate principal amount and $750 million of 6.700% senior secured notes due December 2055 at a price of 99.832% of the aggregate principal amount.  The net proceeds were used for general corporate purposes, including to repay certain indebtedness, including Charter Operating’s 6.150% senior secured notes due 2026, to fund potential buybacks of Charter Class A common stock and Charter Holdings common units, and to pay related fees and expenses. \nFree Cash Flow\nFree cash flow increased $2 million and $958 million during the three and nine months ended September 30, 2025, respectively, compared to the corresponding prior periods in 2024 due to the following (dollars in millions):\nThree months ended \nSeptember 30, 2025\ncompared to \nthree months ended \nSeptember 30, 2024\nNine months ended \nSeptember 30, 2025\ncompared to \nnine months ended \nSeptember 30, 2024\nDecrease in cash paid for taxes, net\n$\n402 \n$\n347 \nChanges in working capital, mobile devices\n154 \n287 \nIncrease (decrease) in Adjusted EBITDA\n(86)\n208 \nDecrease in cash paid for interest, net\n46 \n204 \nIncrease in capital expenditures\n(488)\n(117)\nChanges in working capital, excluding mobile devices\n68 \n(48)\nOther, net\n(94)\n77 \n$\n2 \n$\n958 \nOther, net primarily included the payment of a litigation settlement during the nine months ended September 30, 2024 compared to the corresponding period in 2025.\nLimitations on Distributions\nDistributions by our subsidiaries to a parent company for payment of principal on parent company notes are restricted under CCO Holdings indentures governing CCO Holdings' indebtedness, unless there is no default under the applicable indenture, and unless CCO Holdings' leverage ratio test is met at the time of such distribution.  As of September 30, 2025, there was no default \n26\n \nunder any of these indentures, and CCO Holdings met its leverage ratio test based on September 30, 2025 financial results. There can be no assurance that CCO Holdings will satisfy its leverage ratio test at the time of the contemplated distribution.   \nIn addition to the limitation on distributions under the various indentures, distributions by our subsidiaries may be limited by applicable law, including the Delaware Limited Liability Company Act, under which our subsidiaries may only make distributions if they have “surplus” as defined in the act.   \nHistorical Operating, Investing, and Financing Activities\n \nCash and Cash Equivalents.  \nWe held $464 million and $459 million in cash and cash equivalents as of September 30, 2025 and December 31, 2024, respectively.  In addition, we held $57 million and $47 million in restricted cash included in prepaid and other current assets in our consolidated balance sheets as of September 30, 2025 and December 31, 2024, respectively.\nOperating Activities.\n \n Net cash provided by operating activities increased $1.3 billion during the nine months ended September 30, 2025 compared to the nine months ended September 30, 2024 primarily due to a decrease in cash paid for taxes and interest, increase in Adjusted EBITDA and the payment of litigation settlements in 2024. \nInvesting Activities.\n \nNet cash used in investing activities was $8.6 billion and $8.1 billion for the nine months ended September 30, 2025 and 2024, respectively.  The increase in cash used was primarily due to an increase in capital expenditures and changes in accrued expenses related to capital expenditures.\nFinancing Activities.\n \nNet cash used in financing activities increased $865 million during the nine months ended September 30, 2025 compared to the nine months ended September 30, 2024 primarily due to an increase in the purchase of treasury stock and decrease in borrowings under the EIP Financing Facility, partly offset by an increase in the amount by which borrowings of long-term debt exceeded repayments.\nCapital Expenditures\n \nWe have significant ongoing capital expenditure requirements.  Capital expenditures were $3.1 billion and $8.3 billion for the three and nine months ended September 30, 2025, respectively, and $2.6 billion and $8.2 billion for the three and nine months ended September 30, 2024, respectively.  The increase during the three and nine months ended September 30, 2025 compared to the corresponding periods in 2024 was primarily driven by timing of customer premise equipment spend, higher spend on network evolution and an increase in scalable infrastructure spend, partly offset by a decrease in line extensions.  See the table below for more details.\n  \nWe currently expect full year 2025 capital expenditures to total approximately $11.5 billion.  The actual amount of capital expenditures in 2025 will depend on a number of factors including, but not limited to, the pace of our network evolution and expansion initiatives, supply chain timing and residential and business customer growth rates.\nOur capital expenditures are funded primarily from cash flows from operating activities and borrowings on our credit facility.  In addition, our accrued expenses related to capital expenditures increased by $239 million and $510 million for the nine months ended September 30, 2025 and 2024, respectively.\n27\n \nThe following tables present our major capital expenditures categories in accordance with National Cable and Telecommunications Association (“NCTA”) disclosure guidelines for the three and nine months ended September 30, 2025 and 2024.  These disclosure guidelines are not required disclosures under GAAP, nor do they impact our accounting for capital expenditures under GAAP (dollars in millions):\nThree Months Ended September 30,\nNine Months Ended September 30,\n2025\n2024\n2025\n2024\nCustomer premise equipment\n (a)\n$\n656 \n$\n400 \n$\n1,722 \n$\n1,597 \nScalable infrastructure \n(b)\n425 \n321 \n1,089 \n1,011 \nUpgrade/rebuild \n(c)\n484 \n358 \n1,336 \n1,228 \nSupport capital \n(d)\n449 \n403 \n1,234 \n1,212 \nCapital expenditures, excluding line extensions\n2,014 \n1,482 \n5,381 \n5,048 \nSubsidized rural construction line extensions\n580 \n577 \n1,590 \n1,569 \nOther line extensions\n457 \n504 \n1,353 \n1,590 \nTotal line extensions \n(e)\n1,037 \n1,081 \n2,943 \n3,159 \nTotal capital expenditures \n$\n3,051 \n$\n2,563 \n$\n8,324 \n$\n8,207 \nOf which:  \nCommercial services\n$\n336 \n$\n346 \n$\n933 \n$\n1,103 \nSubsidized rural construction initiative \n(f)\n$\n582 \n$\n581 \n$\n1,595 \n$\n1,575 \nMobile\n$\n77 \n$\n58 \n$\n189 \n$\n181 \n(a)\nCustomer premise equipment includes equipment and devices located at the customer's premise used to deliver our Internet, video and voice services (e.g., modems, routers and set-top boxes), as well as installation costs.\n(b)\nScalable infrastructure includes costs, not related to customer premise equipment or our network, to secure growth of new customers or provide service enhancements (e.g., headend equipment).\n(c)\nUpgrade/rebuild includes costs to modify or replace existing fiber/coaxial cable networks, including our network evolution initiative.\n(d)\nSupport capital includes costs associated with the replacement or enhancement of non-network assets (e.g., back-office systems, non-network equipment, land and buildings, vehicles, tools and test equipment).\n(e)\nLine extensions include network costs associated with entering new service areas (e.g., fiber/coaxial cable, amplifiers, electronic equipment, make-ready and design engineering). \n(f)\nThe subsidized rural construction initiative subcategory includes projects for which we are receiving subsidies from federal, state and local governments, excluding customer premise equipment and installation.\nRecently Issued Accounting Standards\nSee Note 14 to the accompanying consolidated financial statements contained in “Item 1. Financial Statements” and Note 21 to the Annual Report on Form 10-K for the year ended December 31, 2024 for a discussion of recently issued accounting standards.  There have been no material changes from the recently issued accounting standards described in our Form 10-K."
}