{
  "item1": "offer clinical programs help clients, including third-party administrators, drive better whole-person health outcomes through Care Delivery (MD Live Evernorth (\"MD Live\") virtual care, in-home care physical primary care) Care Management (EviCore Evernorth (\"EviCore\"), benefits management, behavioral health services, network services health coaching capabilities) offerings. Clients Customers provide products services Evernorth Health Services segment clients customers, described below. provide services managed care organizations, health insurers, third-party administrators, employers, union-sponsored benefit plans, workers' compensation plans, government health programs, providers, clinics, hospitals others. provide services majority clients Cigna Healthcare segment.",
  "item7": "million $9,855 million December 31, 2024 December 31, 2023, respectively. See Notes 11A 12 Consolidated Financial Statements discussion fair value measurements, procedures performed management determine amounts represent appropriate estimates accounting policy regarding unrealized appreciation debt securities. Effect if Different Assumptions Used. If derived market rates used calculate fair value increased 100 basis points, fair value total debt security portfolio $9.4 billion would decrease approximately $0.5 billion, resulting after-tax decrease shareholders' equity approximately $0.4 billion December 31, 2024.",
  "item2": "MANAGEMENT'S DISCUSSION ANALYSIS FINANCIAL CONDITION RESULTS OPERATIONS MD&A, consolidated measures \"adjusted income operations,\" earnings per share same basis \"adjusted revenues\" not determined accordance GAAP should not viewed substitutes most directly comparable GAAP measures \"shareholders' net income,\" \"earnings per share\" \"total revenues.\" also use pre-tax adjusted income (loss) operations adjusted revenues measure results segments. Company uses \"pre-tax adjusted income (loss) operations\" \"adjusted revenues\" its principal financial measures segment operating performance because management believes these metrics reflect underlying results business operations facilitate analysis trends underlying revenue, expenses profitability. define adjusted income (loss) operations shareholders' net income (or income (loss) before income taxes less pre-tax income (loss) attributable noncontrolling interests segment metric) excluding net investment gains/losses, amortization acquired intangible assets special items. Cigna Group's share certain investment results its joint ventures reported Cigna Healthcare segment using equity method accounting also excluded."
}