{
  "source_file": "ci-20241231.htm",
  "form_type": "10-K",
  "item1": "Item 1. BUSINESS\nOVERVIEW\nThe Cigna Group\nSM\n, together with its subsidiaries (either individually or collectively referred to as the \"Company,\" \"we,\" \"us\" or \"our\"), is a global health company. \nOur Purpose and Mission\n \nThe Cigna Group is a global health company committed to creating a better future for every individual and every community. We relentlessly challenge ourselves to partner and innovate solutions for better health. Powered by our people and our brands, we advance our mission to improve the health and vitality of those we serve.\n \nOur Pathways to Growth\nTo deliver differentiated value to our customers, patients, clients, communities and investors, we will continue to cultivate our portfolio of businesses to provide sustained foundational and accelerated growth through cross-enterprise leverage - today and in the future.\nOur Differentiated Approach\n•\nClinical expertise and longitudinal data provide enhanced care and value.\n•\nRelentless focus on value and affordability improves the cost of care for our clients and customers.\n•\nCulture of innovation and partnership brings new services and capabilities to market.\nAt The Cigna Group, we relentlessly challenge ourselves to partner and innovate solutions for better health. Our global workforce of approximately 73,500 colleagues strives to fulfill our mission to improve the health and vitality of approximately 182 million customer and patient relationships in more than 30 countries and jurisdictions (as of December 31, 2024).\nWe have two growth platforms: Evernorth Health Services\n® \nand Cigna Healthcare\n®\n. Evernorth Health Services, through our Pharmacy Benefit Services and Specialty and Care Services operating segments, provides independent and coordinated health solutions and capabilities to enable the health care system to work better and help people live richer, healthier lives. In addition to serving a wide variety of clients, Evernorth Health Services also enables us to deepen existing relationships across our entire book of business. Cigna Healthcare is the health benefits segment of The Cigna Group and serves customers and clients for our U.S. Healthcare and International Health operating segments. \nTogether, Evernorth Health Services and Cigna Healthcare provide a strong and diverse foundation that allows us to capitalize on growth opportunities by leading with our strengths – pharmacy and medical solutions – and then expanding those relationships by addressing additional client needs and innovating and delivering new services and solutions. When considering our broad portfolio of businesses, we have strong foundational businesses that we expect to continue to grow. These businesses often serve as the key entry point for clients with either a pharmacy relationship, a medical relationship or both. We also have accelerated growth businesses, both scaled and emerging, which build upon our foundational relationships or provide exposure to adjacent high-growth areas. \nEvernorth Health Services and Cigna Healthcare work together to enable cross-enterprise leverage by uniquely using the depth and breadth of our wide-ranging capabilities across the enterprise to efficiently move from ideation to solution creation to meet clients' evolving needs while creating more value, expanding our reach and driving growth. \nInformation about Segments\nWe present the financial results of our businesses in the following segments (see \"Executive Overview\" section of Management's Discussion and Analysis of Financial Condition and Results of Operations\n \n(\"MD&A\") located in Part II, Item 7 of this Form 10-K for a financial summary):\nEvernorth Health Services \nincludes our Pharmacy Benefit Services and Specialty and Care Services operating segments, which provide independent and coordinated health solutions and capabilities to enable the health care system to work better and help people live richer, healthier lives.\n1\nCigna Healthcare\n includes the U.S. Healthcare and International Health operating segments, which provide comprehensive medical plan services and coordinated solutions to clients and customers.\nOther Operations\n comprises the remainder of our business operations, which includes certain continuing, run-off and other non-strategic businesses.\nCorporate \nreflects amounts not allocated to operating segments, including net interest expense (defined as interest on corporate financing less net investment income on investments not supporting segment and other operations), certain litigation matters, expense associated with our frozen pension plans, charitable contributions, operating severance, certain overhead and enterprise-wide project costs, and eliminations for products and services sold between segments.\nSee the \"Executive Overview - Key Transactions and Business Developments\" section of our MD&A located in Part II, Item 7 of this Form 10-K for discussion of key developments impacting the segments.\nOther Information\nThe Cigna Group, through its predecessor companies, was incorporated in Delaware in 1981. \nThe financial information included in this Form 10-K for the fiscal year ended December 31, 2024 is presented in conformity with accounting principles generally accepted in the United States of America (\"GAAP\") unless otherwise indicated. Industry rankings and percentages set forth herein are for the year ended December 31, 2024, unless otherwise indicated. In addition, statements set forth in this document concerning our rank or position in an industry or particular line of business have been developed internally based on publicly available information unless otherwise noted.\nYou can access our website at http://www.thecignagroup.com to learn more about our company. We make annual, quarterly and current reports and proxy statements and amendments to those reports available, free of charge, through our website as soon as reasonably practicable after we electronically file these materials with, or furnish them to, the Securities and Exchange Commission (\"SEC\"). We also use our website as a means of disclosing material information and for complying with our disclosure obligations under the SEC's Regulation FD (Fair Disclosure). Important information, including news releases, analyst presentations and financial information regarding The Cigna Group is routinely posted on our website. Accordingly, investors should monitor the Investor Relations portion of our website, in addition to following our press releases, SEC filings, and public conference calls and webcasts. The information contained on, or that may be accessed through, our website is neither incorporated by reference into nor a part of this report. See also \"Code of Ethics and Other Corporate Governance Disclosures\" in Part III, Item 10 of this Form 10-K for additional information regarding the availability of our Codes of Ethics on our website.\nEVERNORTH HEALTH SERVICES\nEvernorth Health Services\n \nincludes our Pharmacy Benefit Services and Specialty and Care Services operating segments, which provide independent and coordinated health solutions and capabilities to enable the health care system to work better and help people live richer, healthier lives. Within Evernorth Health Services, Pharmacy Benefit Services is a foundational growth business, and Specialty and Care Services is an accelerated growth business. \nEvernorth Health Services offers a full suite of products and services that both (a) enables our customers to combine our products and services to create a comprehensive benefit offering designed to manage prescription drugs and provide independent and coordinated health solutions and capabilities and (b) addresses the needs of a shared customer base across both operating segments of Evernorth Health Services. Our ability to deliver this broad array of health care services on both a standalone or combined basis between its two operating segments enables us to drive incremental growth. Additionally, many Evernorth Health Services offerings are available within Cigna Healthcare solutions to drive cross-enterprise leverage.\n2\nHow We Deliver\n•\nDeep clinical expertise \nin evaluating medicines, digital therapeutics and other health solutions for efficacy and value to assist clients in selecting a cost-effective formulary as well as in leveraging evidence-based guidelines to ensure patients receive the most medically appropriate treatments.\n•\nAffordable solutions \nthat provide more value and align incentives between the patient, health care professional and plan sponsor.\n•\nModular portfolio \ntailored to client needs, using the combined strengths and capabilities of Evernorth Health Services, as well as strategic partnerships, to deliver better, more efficient care for patients; better experiences for clients, providers and customers; and enhanced choices for clients and customers through our open architecture model.\n•\nTalented, experienced and caring people who operate in a culture of innovation and partnership \nto solve complex problems across a fragmented health care ecosystem, fueled by data and expertise that drives purposeful innovation.\nPrincipal Products and Services\nPharmacy Benefit Services\n•\nPharmacy Benefits.\n \nWe drive high-quality, cost-effective pharmacy care through a range of services. We adjudicate drug claims from retail network participants and provide retail pharmacy network administration, benefit design consultation, drug utilization review, drug formulary management and other services.\n◦\nRetail Pharmacy Network Administration.\n We contract with retail pharmacies to provide prescription drugs to customers of the pharmacy benefit plans our clients offer. We negotiate with pharmacies throughout the United States to discount drug prices and offer national and regional network options responsive to client preferences related to cost containment, convenience of access for customers and network performance.\n◦\nBenefits Design Consultation.\n We consult with our clients on how best to structure and leverage the pharmacy benefit to meet plan objectives for affordable and sustainable access to the prescription medications customers need to stay healthy and to ensure the safe and effective use of those medications.\n◦\nDrug Utilization Review.\n When pharmacies submit claims for prescription drugs to us, we review them in real time for health and safety. If issues are detected, we then alert the dispensing pharmacy. Clients may also choose to enroll in programs that result in communications about potential therapy concerns being sent to prescribers after the initial claim submission.\n◦\nDrug Formulary Management.\n▪\nFormularies are lists of drugs with designations that may be used to determine drug coverage and customer out-of-pocket costs as well as communicate plan preferences in competitive drug categories. Our formulary management\n \nservices support clients in establishing formularies that assist customers and physicians in choosing clinically appropriate, cost-effective drugs and prioritize access, safety and affordability. \n▪\nWe administer specific formularies for our clients, including standard formularies developed by Express Scripts by Evernorth\n®\n (\"Express Scripts\") and custom formularies in which we play a more limited role. Many of our clients select standard formularies, governed by both internal and independent committees that make recommendations for formularies that first consider clinical results separate from price considerations.\n▪\nOne of the ways we manage our drug formulary is through negotiating to secure additional affordability for the benefit of our clients based on the utilization of certain prescription drugs and supplies which can be paid to us in the form of a rebate. With respect to our clients' rebate arrangements, most choose to receive the greater of a minimum rebate guarantee or a contractually agreed-upon percentage of rebates. In some rebate arrangements, Express Scripts takes on the risk of securing the rebate value necessary to meet the value guaranteed to its client. The actual amount of value secured by Express Scripts is dependent upon the result of its negotiations for rebates. In 2024, for clients covered under our pharmacy benefit contracts, Express Scripts shared over 95% of the drug formulary management rebates it received with its integrated clients, and more than two-thirds of clients received 100% of rebates. \n◦\nMedical Drug Management.\n We offer a comprehensive range of services with guaranteed savings for managing medically billed specialty drugs. Our solutions apply utilization management, site of care management and claims prepayment review to help ensure patient safety and healthier outcomes and reduce wasteful spend.\n◦\nAdministration of Group Purchasing Organizations.\n We participate in various group purchasing organizations that negotiate pricing for the purchase of pharmaceuticals or formulary rebates with pharmaceutical manufacturers on behalf of their participants.\n◦\nValue-Based Programs.\n We offer a variety of solutions aimed at helping clients reduce costs and enhance clinical outcomes. These programs include SafeGuardRx\n®\n, Express Scripts Copay Assurance\nSM\n, Express Scripts Patient Assurance\n®\n and Evernorth EncircleRx\nSM\n.\n3\n◦\nEvernorth Wholesale Marketplace.\n Evernorth Wholesale Marketplace\n®\n offers a suite of flexible, private label pharmacy benefit manager solutions including but not limited to a pharmacy rebate program, a retail network program, value-based solutions, a medical rebate program and utilization management policies. These offerings are captured under either our drug formulary administrative service arrangements or our formulary processing arrangements.\n•\nHome Delivery Pharmacy.\n \nOur Express Scripts Pharmacy by Evernorth\n®\n (\"Express Scripts Pharmacy\") offers free standard shipping of medications nationwide, usually in a 90-day supply, directly to the customer's home and allows for automatic refills on eligible medications and unrestricted telephone access to customer care advocates and specially trained pharmacists. The Home Delivery Pharmacy operations consist of 13 licensed pharmacies, including 4 fulfillment pharmacies. Our fulfillment pharmacies are located in Arizona, Indiana, Missouri and New Jersey.\nSpecialty and Care Services\n•\nSpecialty Pharmacy.\n Specialty medications are primarily characterized as high-cost medications for the treatment of complex and rare diseases. These medications broadly include those with frequent dosing adjustments, intensive clinical monitoring, the need for customer training, specialized product administration requirements or medications limited to certain specialty pharmacy networks by manufacturers. The front-end of our pharmacy, anchored by Accredo by Evernorth\n®\n (\"Accredo\"), is organized into Therapeutic Resource Centers, where pharmacists focus their practice of pharmacy by condition. Accredo provides support for customers through our specially trained clinicians, network of in-home nursing services, nationwide footprint, drug reimbursement services and highly tailored clinical care programs. Our Specialty Pharmacy operations consist of 35 licensed pharmacies.\n•\nSpecialty Distribution.\n \nCuraScript SD by Evernorth\n®\n is a specialty distributor of pharmaceuticals and medical supplies (including injectable and infusible pharmaceuticals and medications to treat specialty and rare or orphan diseases) directly to health care providers, clinics and hospitals in the United States for office or clinic administration. We provide distribution services primarily to health care providers who treat customers with chronic diseases and regularly order costly specialty pharmaceuticals. This business operates three distribution centers and ships most products overnight within the United States. It is a contracted supplier with most major group purchasing organizations and leverages its distribution platform to operate as a third-party logistics provider for several pharmaceutical companies.\n•\nCare Services.\n \nWe offer clinical programs to help our clients, including third-party administrators, drive better whole-person health outcomes through our Care Delivery (MD Live by Evernorth\n®\n (\"MD Live\") virtual care, in-home care and physical primary care) and Care Management (EviCore by Evernorth\n®\n (\"EviCore\"), benefits management, behavioral health services, network services and health coaching capabilities) offerings. \nClients and Customers\nWe provide products and services in the Evernorth Health Services segment to clients and customers, as described below. \n•\nClients.\n We provide services to managed care organizations, health insurers, third-party administrators, employers, union-sponsored benefit plans, workers' compensation plans, government health programs, providers, clinics, hospitals and others. We provide services to a majority of clients in our Cigna Healthcare segment.\n•\nCustomers.\n Prescription drugs are dispensed to patients connected to the service offerings we provide to clients. Prescription drugs are dispensed primarily through networks of retail pharmacies under nonexclusive contracts with us and via home delivery pharmacies, including Express Scripts Pharmacy, and specialty pharmacies, including Accredo.\nEvernorth Health Services has three clients that each drive significant revenues for the segment:\n•\nExpress Scripts and Centene Corporation (\"Centene\") have a multi-year agreement, which began January 1, 2024, to manage pharmacy benefit services for Centene's customers, providing them with access to the extensive Express Scripts national network of retail pharmacies.\n•\nExpress Scripts and Prime Therapeutics LLC (\"Prime\") have an agreement to deliver improved choice and affordability for Prime's clients and customers by enhancing retail pharmacy networks, providing access to Accredo and Express Scripts Pharmacy, and providing pharmaceutical manufacturer value.\n•\nThe Department of Defense (\"DoD\") TRICARE\n®\n is the military health care program available to active-duty service members, active-duty family members, National Guard and Reserve members and their family members, retirees and retiree family members, survivors and certain former spouses. \nCompetition\nThe primary competitive factors in the industry include the ability to negotiate with retail pharmacies to ensure retail pharmacy networks meet the needs of clients and customers; provide home delivery and specialty pharmacy services; negotiate pricing of \n4\nprescription drugs with drug manufacturers; manage cost and quality of specialty drugs; specialize in claim adjudication and benefit administration; improve access, outcomes, and efficiencies within the health care ecosystem; deliver quality primary and behavioral care in virtual-led hybrid settings, in the workplace and in home-based settings; navigate the complexities of government-reimbursed business including Medicare, Medicaid and the public exchanges; and use the information obtained about drug, behavioral and medical utilization patterns and consumer behavior to reduce costs for clients and customers and assess the level of service provided. \nOur focus on improving the health and vitality of those we serve will allow us to further differentiate ourselves from our primary competitors. Our primary competitors include independent and managed care pharmacy benefit managers; retail, home delivery and specialty pharmacies; specialty drug distributors; health plans; third-party benefit administrators; group purchasing organizations; clinical solutions companies, health care data analytics companies; and care services providers.\nSuppliers\nWe maintain an inventory of brand-name and generic pharmaceuticals in our home delivery pharmacies, specialty pharmacies and specialty distributor. Our specialty pharmacies and specialty distributor also carry biopharmaceutical products to meet the needs of our customers, including pharmaceuticals for the treatment of rare or chronic diseases; if a drug is not in our inventory, we can generally obtain it from a supplier within a reasonable amount of time.\nWe purchase pharmaceuticals either directly from manufacturers or through authorized wholesalers. Evernorth Health Services uses one wholesaler for approximately half of our pharmaceutical purchases, but holds contracts with other wholesalers if needs for an alternate source arise. Generic pharmaceuticals are generally purchased directly from manufacturers.\nCIGNA HEALTHCARE\nCigna Healthcare includes the U.S. Healthcare and International Health operating segments, which provide comprehensive medical plan services and coordinated solutions to clients and customers. Excluding the businesses pending divestiture to Health Care Service Corporation (\"HCSC\"), Cigna Healthcare is predominately comprised of foundational growth businesses.\nHow We Deliver\n•\nMultifaceted approach to affordability\n with a focus on high-quality care to lower costs and drive better outcomes through deep collaborative partnerships with high-performing providers and superior clinical expertise and analytics to guide customers to the highest quality, most affordable sites of care.\n•\nTalented and experienced people\n who bring a highly consultative orientation to market and partner with clients to understand their business and goals to address the unique health needs of their population.\n•\nModular portfolio of products, services and funding options\n that provides choice and enables us to build and tailor a unique combination to meet the specific needs of each client.\n•\nPartnering with Evernorth to drive cross-enterprise leverage\n to deliver a spectrum of integrated solutions that create value and savings for our customers, clients and partners.\nWe offer administrative services only (\"ASO\") and insurance funding solutions to employers, groups and individuals along with other \nhealth care benefits and solutions to improve the quality of care, lower costs and help customers achieve better health outcomes. Funding solutions, referring to the entity assuming financial risk, are described in the Premiums and Fees section below.\nPrincipal Products and Services\nU.S. Healthcare Medical Plans\n•\nEmployer Medical Plans\n include health maintenance organizations (\"HMOs\"), LocalPlus\n®\n, Network and Open Access Plus offered through our insurance companies, and third-party administrators (\"TPAs\"). These plans use cost-sharing incentives to encourage the use of \"in-network\" rather than \"out-of-network\" health care providers. Preferred Provider Organization (\"PPO\") plan offerings feature broader provider access than the other plans, do not require referrals and typically have a higher cost-share for out-of-network services. Plans are offered nationwide, and our funding solutions include ASO\n (self-funded),\n insured guaranteed cost (\"GC\") and insured experience rated (\"ER\").\n◦\nConsumer-Driven Products\n are paired with employer medical plans and offer customers a tax-advantaged way to pay for eligible health care expenses. Health savings accounts, health reimbursement accounts and flexible spending accounts encourage customers to play an active role in managing their health and health care costs.\n5\n•\nIndividual and Family Plans (\"IFPs\")\n are Patient Protection and Affordable Care Act (\"ACA\") compliant exclusive provider organizations (\"EPOs\") or HMO plans marketed to individuals under age 65 without access to health care coverage through an employer or government program such as Medicare or Medicaid. Customers receive comprehensive health care benefits and have access to a local network of health care providers who have been selected with cost and quality in mind. Plans are currently offered in 11 states with a GC funding solution.\nHeld for Sale\nIn January 2024, the Company entered into a definitive agreement to sell the Medicare Advantage, Medicare Individual Stand-Alone Prescription Drug Plans, Medicare and Other Supplemental Benefits, and CareAllies businesses within the U.S. Healthcare operating segment to HCSC subject to applicable regulatory approvals and other customary closing conditions, including adjustments to align with the final balance sheet of the divested businesses (the \"HCSC transaction\"). See Note 5 to the Consolidated Financial Statements for further information.\n•\nMedicare Advantage Plans\n allow Medicare-eligible customers to receive health care benefits, including prescription drugs, through a managed care health plan. Our plans include HMO and PPO plans with a GC funding solution marketed to individuals and qualified employer groups in 29 states and the District of Columbia.\n•\nMedicare Individual Stand-Alone Prescription Drug (\"Part D\") Plans\n provide a number of prescription drug plan options, as well as service and information support to Medicare-eligible individuals. Our stand-alone plans offer the coverage of Medicare combined with the flexibility to select a product that provides enhanced benefits and a formulary that aligns with the individual's needs. Plans are offered nationwide with a GC funding\n solution\n.\n•\nMedicare Supplement Plans\n provide Medicare-eligible customers with federally standardized Medigap plans. Customers may select among the various Center for Medicare and Medicaid Services (\"CMS\") standardized plan designs to meet their unique needs and may visit any health care provider or facility that accepts Medicare throughout the United States without the need for a referral. Plans are offered in 48 states and the District of Columbia with a GC funding solution.\nU.S. Healthcare Benefits and Solutions\nThe following benefits and solutions are offered nationwide with various funding solutions to enhance the benefits from our health care medical plans.\n•\nBehavioral Health\n solutions consist of a broad national network of providers, including one of the largest virtual networks in the United States, specialty case and utilization management, a 24/7-accessible crisis intervention phone line, employee assistance programs, and work/life programs.\n•\nConsumer Health Engagement\n solutions include an array of health management, disease management and wellness programs to improve customers' health and well-being.\n•\nCost Containment Programs\n are designed to reduce the cost of covered health care services and supplies by reducing out-of-network costs, protecting customers from balance billing and educating customers regarding the availability of lower cost in-network services. We negotiate discounts with out-of-network providers, review provider bills and recover overpayments.\n•\nDental\n solutions include HMO plans, PPO plans, EPO plans, traditional indemnity plans and a discount program. Employers and other groups may purchase our products as standalone products or in conjunction with medical products. IFP standalone dental PPO plans are available in 49 states and sold to individuals under age 65 and retirees without access to dental coverage through an employer or a government program.\n•\nPharmacy Management\n solutions and benefits may be combined with our medical and behavioral health offerings by leveraging the capabilities of Evernorth Health Services.\n•\nStop-Loss\n insurance coverage is offered to self-funded clients whose group health plans are administered by Cigna Healthcare. Stop-loss insurance provides reimbursement for claims in excess of a predetermined amount for individuals, the entire group or both.\nInternational Health\n•\nGlobal Health Care\n offerings include medical, dental, pharmacy, vision, life, accidental death and dismemberment, and disability risks. We provide products and services that meet the needs of multinational employers, intergovernmental and nongovernmental organizations, and globally mobile individuals with a focus on keeping employees healthy and productive. Products and services are offered worldwide except as limited by applicable law and include ASO, GC and ER funding solutions.\n•\nLocal Health Care\n offerings include medical, dental, pharmacy and vision as well as life coverage. Customers include employers and individuals located in specific geographies (China, Singapore, Hong Kong, Spain and India, along with various countries in the Middle East) where the products and services are purchased. Offerings include ASO, GC and ER funding solutions.\n6\nPremiums and Fees\n•\nASO. \nPlan sponsors (i.e., employers, unions and other groups) create self-funded group health plans to fund all claims and may purchase stop-loss insurance to limit exposure. We earn fees for providing access to our participating provider networks, claims administration services, and other benefits and solutions. ASO arrangements represent approximately 26% of segment revenues and 74% of Cigna Healthcare medical customers.\n•\nInsured.\nGC and ER.\n Individual and group insurance premium rates generally must be approved by the applicable state regulatory agency, and state or federal laws may restrict or limit the use of rating methods. Premium rates are established at the beginning of a policy period and may be based in whole or in part on prior experience and include estimates of future claims costs over the fixed contract period. With the exception of ER policies, we generally cannot adjust premium rates to reflect actual claims experience until the next policy period, and the policyholder does not share in actual claim experience. We retain any margin if costs are less than the premium charged (subject to minimum medical loss ratio (\"MLR\") rebate requirements) and bear the risk for costs in excess of the premium charged. \nMedicare Advantage\n (held for sale). We receiv\ne fixed monthly payments from CMS for each plan customer based on customer demographic data and actual customer health risk factors and may earn additional revenue from CMS related to quality performance measures (\"Star Ratings\"). Premiums may be charged to customers when the plan premium exceeds the revenue determined by CMS. \nThe ACA subjects individual and small group policy rate increases above an identified threshold to review by the United States Department of Health and Human Services (\"HHS\"), and our U.S. Healthcare medical plans are subject to minimum MLR requirements. The MLR represents the percentage of premiums used to pay claims and expenses for activities that improve the quality of care. If we do not satisfy the prescribed MLR, statutes require premium refunds to policyholders or to CMS.\nGC and ER insured arrangements, including Medicare Advantage, represent approximately 74% of segment revenues and 26% of Cigna Healthcare medical customers.\nSee the \"Business – Regulation\" section of this Form 10-K for additional information about MLR requirements, Star Ratings and risk adjustment programs.\nMarket Segments\nCigna Healthcare\n medical customers are comprised of the following market segments:\n•\nNational Accounts.\n Employers with 3,000 or more eligible employees.\n•\nMiddle Market.\n Employers with 500 to 2,999 eligible employees, solutions for third-party payors, Taft-Hartley plans and other groups.\n•\nSelect.\n Employers with 51 to 499 eligible employees.\n•\nSmall.\n Employers with 2 to 50 eligible employees\n.\n•\nIFPs.\n \nIndividual health insurance coverage both on and off the public exchanges and individual dental plans for customers across various distribution channels.\n•\nMedicare Advantage\n (held for sale)\n.\n Includes individuals who are Medicare-eligible, as well as employer group-sponsored post-65 retirees. Revenues from CMS are significant to the market segment.\n•\nInternational Health.\n \nIncludes multinational employers and globally mobile individuals, and employers and individuals in specific countries outside of the United States.\nClients and Customers\nWe provide clients and customers with access to a mix of medical and other health care benefits and solutions.\n•\nClients.\n Employers, TPAs, union-sponsored benefit plans, government health programs and other groups.\n•\nCustomers.\n Individuals who access our offerings through an employer-sponsored plan, government-sponsored plan, individual plan or other insured group.\nPrimary Distribution Channels\n•\nBrokers and Consultants.\n Sales representatives distribute our products and solutions to a broad group of brokerage and consulting firms as well as individuals.\n7\n•\nDirect.\n Cigna Healthcare sales representatives distribute our products and solutions directly to employers, unions, and other groups or individuals. Various products may also be sold directly to insurance companies, HMOs and TPAs. \n•\nPrivate Exchanges.\n We partner with select private exchanges that provide employees of participating clients access to health insurance, targeting participation to those models that best align with our mission and value proposition.\n•\nPublic Exchanges.\n Cigna Healthcare offers individual ACA-compliant policies through public health insurance exchanges in select geographies.\nCompetition\nThe primary competitive factors affecting our business are quality of care and cost-effectiveness of service and provider networks, effectiveness of medical care management, products that meet the needs of our clients and customers, total cost management, technology, and effectiveness of marketing and sales. Financial strength, as indicated by ratings issued by nationally recognized rating agencies, is also a competitive factor. Our health advocacy capabilities, holistic approach to consumer engagement, breadth of product offerings, and clinical care and health management capabilities along with an array of product funding solutions are competitive advantages. Our primary competitors include national insurers, local health plans, TPAs, dental insurers, independent and managed care pharmacy benefit managers, global insurers, and local non-U.S. insurers.\nProvider Networks and Partnerships\n•\nParticipating Provider Networks.\n We provide our customers with a national network of participating health care providers, hospitals, and other facilities, pharmacies and providers of health care services and supplies. Our U.S. network has approximately 1.8 million physicians, including specialists, and over 6,000 hospitals. We have strategic alliances with several regional managed care organizations to gain access to their provider networks and discounts.\n•\nNetwork Strength and Stability.\n We successfully maintain a broad provider network with high levels of provider retention to ensure our customers have access to high-quality care at affordable, competitive rates.\n•\nProvider Partnerships.\n We partner with a variety of provider groups in value-based payment arrangements to continuously improve the quality of care for those we serve. With more than 200 arrangements with primary care groups, our flagship program is the Cigna Collaborative Accountable Care program, which rewards providers for improving quality outcomes and medical cost performance. We have approximately 100 arrangements with specialist groups across six different disciplines that include incentives for enhanced care coordination or reimbursements for meeting cost and quality goals. We also have contracts with more than 200 hospital systems, involving more than 800 hospitals, with reimbursements tied to quality metrics.\n•\nSite of Care Optimization.\n We encourage the use of clinically appropriate settings to reduce the cost of care while ensuring high-quality care and service through our clinical programs and partnership with EviCore. We expand access, reduce the cost of care and offer flexibility while supporting the patient/provider relationship by providing access to virtual care services, including MD Live.\nOTHER OPERATIONS\nOther Operations comprises the remainder of our business operations, which includes certain continuing, run-off and other non-strategic businesses. Other Operations also included the international life, accident and supplemental benefits businesses and our interest in a joint venture in Türkiye prior to the divestiture of these businesses in 2022. \nContinuing Business\nCorporate-Owned Life Insurance. \nThe principal products of the corporate-owned life insurance (\"COLI\") business are permanent insurance contracts sold to corporations to provide coverage on the lives of certain employees for financing employer-paid future benefit obligations. Permanent life insurance provides coverage that, when adequately funded, does not expire after a term of years. The contracts are primarily nonparticipating universal life policies. Fees for universal life insurance products consist primarily of mortality and administrative charges assessed against the policyholder's fund balance. Interest credited and mortality charges for \n8\nuniversal life and mortality charges on variable universal life may be adjusted prospectively to reflect expected interest and mortality experience. To reduce our exposure to large individual losses, we purchase reinsurance from unaffiliated reinsurers.\nRun-off Businesses\nSettlement Annuity Business. \nOur settlement annuity business is a closed, run-off block of single premium annuity contracts. These contracts are primarily liability settlements, with approximately 12% of the liabilities associated with guaranteed payments not contingent on survivorship. Non-guaranteed payments are contingent on the survival of one or more parties involved in the settlement.\nReinsurance. \nOur reinsurance operations are an inactive business in run-off. In February 2013, we effectively exited the variable annuity reinsurance business by reinsuring 100% of our future exposures, net of retrocessional arrangements in place at that time, up to a specified limit. For additional information regarding this reinsurance transaction and the arrangements that secure our reinsurance recoverables, see Note 10 to the Consolidated Financial Statements.\nIndividual Life Insurance and Annuity and Retirement Benefits Businesses. \nThe individual life insurance and annuity business and the retirement benefits business were sold through reinsurance agreements in 1998 and 2004, respectively. For more information regarding the arrangements that secure our reinsurance recoverables for the retirement benefits business, see Note 10 to the Consolidated Financial Statements.\nMISCELLANEOUS\n•\nRevenues from a single pharmacy benefit client were approximately 16% of consolidated revenues for the year ended December 31, 2024. These amounts were reported in the Evernorth Health Services segment.\n•\nRevenues from U.S. Federal Government agencies, under a number of contracts, were approximately 11%, 15% and 14% of consolidated revenues for the years ended December 31, 2024, 2023 and 2022, respectively. These amounts were reported in the Evernorth Health Services and Cigna Healthcare segments. \n•\nThe Company does not rely on business from one or a few brokers or agents. \nINVESTMENT MANAGEMENT\nOur investment operations provide investment management and related services for our various businesses, including the insurance-related invested assets. For additional information about invested assets, see the \"Investment Assets\" section of the MD&A and Notes 11 and 12 to the Consolidated Financial Statements.\nWe manage our investment portfolios to reflect the underlying characteristics of related insurance and contractholder liabilities and capital requirements, as well as regulatory and tax considerations pertaining to those liabilities and state investment laws. Insurance and contractholder liabilities range from short-duration health care products to longer-term obligations associated with COLI products and the run-off settlement annuity business. Assets supporting these liabilities are managed in segregated investment portfolios to facilitate matching of asset durations and cash flows to those of corresponding liabilities. Investment results are affected by the amount and timing of cash available for investment, economic and market conditions and asset allocation decisions. We routinely monitor and evaluate the status of our investments, obtaining and analyzing relevant investment-specific information and assessing current economic conditions, trends in capital markets and other factors, such as industry-sector, geographic and property-specific information.\nThe Cigna Group Ventures. \nIn addition to the core insurance and operating investment portfolios described above, The Cigna Group has committed $700 million in aggregate since the formation of The Cigna Group Ventures, our strategic corporate venture fund that invests in promising startups and growth-stage companies making groundbreaking progress in three strategic areas: data and technology, digital health, and care delivery. Through these partnerships, we collaborate, innovate and develop new solutions to improve the health and vitality of those we serve. \nDIGITAL, DATA AND TECHNOLOGY\nThe Cigna Group investments in digital, data and technology are focused on cultivating robust digital-first capabilities to better engage with customers and stakeholders. \n9\nInnovation. \nCustomer-centric, digital-first, virtual-led vision for health care remains at the forefront of our priorities. The advancement of our internal innovative capabilities and strategic partnerships continues to produce new and more effective ways to engage with our customers to help close gaps in care, optimize treatment and improve outcomes. \nAt The Cigna Group, we use artificial intelligence (\"AI\") to support health care transformation by helping to enable the next generation of accessible, effective, affordable and enhanced health care solutions. AI models can facilitate personalized solutions for individuals, inform earlier interventions and simplify health care experiences. We do not view AI as a replacement for expert decisions made by physicians or employees at The Cigna Group. Given this, we consider most of the AI models we use as augmented intelligence, providing information to human experts for further consideration, in combination with many other factors evaluated in care and benefit administration decisions.\nTo ensure our practices and solutions are consistent with our commitment to health equity and to facilitate compliance with applicable laws and regulations, we have a dedicated team and governance structure in place, known as Enterprise Model Governance (\"EMG\"). Our EMG team oversees the development, deployment and monitoring of AI models - driven by our Responsible AI Principles: validity and reliability; safety; privacy; fairness; transparency; and accountability. EMG is governed by the EMG Board, comprised of senior leaders from across the company, with representation from business, clinical, privacy, legal, internal audit, information protection and other departments. The EMG Board oversees an enterprise-wide model approval and governance process for review of AI models in use or in development across the enterprise. \nWe also have established comprehensive governance processes for new capabilities, such as generative AI (\"Gen AI\"). Our AI Center of Enablement (\"AI COE\") expands on EMG and brings together individuals from across our technology, privacy, data governance, security, legal, compliance, marketing and other teams to evaluate and approve Gen AI use cases. The AI COE ensures these use cases align with our Responsible AI Principles and adhere to health care privacy and security requirements.\nData and Analytics. \nWe conduct timely, rigorous and objective research and analysis that informs evidence-based medical and pharmacy benefit management decisions and evaluates the clinical, economic and individual impact of enhanced benefit designs and programs, ultimately resulting in rich, integrated data that helps to provide differentiated outcomes. The combination of our predictive analytics, and our machine learning (\"ML\") and deep learning capabilities create actionable intelligence that informs decision-making of our health care professionals, improves operational efficiency and enables greater innovation. Our data-driven approach to behavioral health provides personalized and customized care across the entire continuum for the populations we serve. These solutions predict emerging health needs, close gaps in care and drive cost savings, all while empowering whole-person and whole-family health.\nDigital. \nOur digital health focus has shown value across the enterprise by imagining the future of health care and creating engaging experiences that give customers the right information at the right time. We deliver resource-efficient products and features at scale and on time with a commitment to security, resiliency and compliance. At its core, digital is a connected ecosystem that serves customers, clients and providers, and it paves the way to direct-to-consumer relationships and new growth opportunities. Our digital strategy focuses on the drive from analog to digital, which complements the growth strategy of The Cigna Group, creates efficiency and amplifies the value of existing offerings, as well as creates option value with industry-leading personalization and precision to drive better health and business outcomes. Cybersecurity protections continue to be a top priority across The Cigna Group digital offerings to further strengthen our security posture and grow the trust of those we serve. See Part I. Item 1C - \"Cybersecurity\" of this Form 10-K for additional information regarding our cybersecurity practices and governance.\nTechnology Operations. \nOur technology team supports the various information systems essential to our operations, including the health benefit claims processing systems and specialty and home delivery pharmacy systems. Uninterrupted point-of-sale electronic retail pharmacy claims processing is a significant operational requirement for our business. We believe we have substantial capacity for growth in our U.S. pharmacy claims processing facilities. Our pharmacy technology platform allows us to safely, rapidly and accurately adjudicate over two billion adjusted prescriptions annually. Our technology helps retail pharmacies focus on patient care, and our real-time safety checks help avoid medication errors. The Cigna Group companies hold over 480 U.S. patents. We use these patents to protect our proprietary technological advances and to differentiate ourselves in the market. We are not substantially dependent on any single patent or group of related patents. We are not aware of any facts that could materially impact the continuing use of our intellectual property.\n10\nHUMAN CAPITAL MANAGEMENT\nThe mission of The Cigna Group is to improve the health and vitality of those we serve. A healthy and diverse global workforce is essential to achieving our mission and our business growth strategies. We continually invest in our global workforce to support our employees' health and vitality, provide fair and market-competitive pay, and foster growth and development for every employee. As of the end of 2024, we had approximately 73,500 employees, with approximately 90% of our employees based in the United States. Approximately 97% of our employees are full-time.\n \nThe Cigna Group has a long-standing and deep commitment to fair opportunity for all, regardless of gender, race or ethnicity. As of the end of 2024, our global workforce was approximately 70% women and 30% men. Approximately 41% of our employees in the United States were ethnic minorities. \nHealth, Vitality and Other Benefits. \nTending to our employees' health and vitality is a critical business imperative for our company and one of the most important investments in our enterprise that we make each year. We believe that when we support our employees' health and well-being, they are more productive and engaged in driving our mission and business strategy forward, thereby creating shareholder value. In 2024, The Cigna Group invested approximately 19% of total payroll in health, well-being and other benefits, including life and disability programs, 401(k) contributions, and retirement-related benefits for our employees in the United States.\nIn addition to traditional medical and pharmacy benefits, we provide multidimensional wellness programming to support the physical, mental, financial, and social health as well as overall vitality of employees. Additionally, we encourage employees to self-report additional demographic information, including whether they are a military veteran or living with a disability, so that we can better support the health and vitality of every employee in light of their unique background, experiences and perspectives.\nTalent Acquisition, Development and Retention. \nOur talent acquisition and rewards strategies are designed to attract and retain skilled employees who are engaged in our mission. We are committed to attracting and recruiting key talent from all backgrounds into positions at all levels of the enterprise, including underrepresented groups in various leadership roles across the business. Our compensation program, rooted in our pay-for-performance philosophy, aims to provide market-competitive base salaries and incentives that reward contributions that advance the Company's strategy and mission. In 2024, the voluntary turnover rate was approximately 9% for all employees.\nOur compensation practices, rooted in our pay-for-performance philosophy, promote fair and competitive pay through measures such as benchmarking compensation by role, eliminating inquiries regarding applicants' compensation history from the hiring process and monitoring for potential disparities. Our most recent pay equity analysis among our U.S. employees, conducted in 2025, illustrated that female employees of The Cigna Group earn more than 99 cents for every dollar earned by similarly situated male employees, and ethnic minority employees (which includes Black/African American, Hispanic or Latino/a, Pacific Islander. and American Indian/Alaskan employees) earn more than 99 cents for every dollar earned by similarly situated white employees. We also analyzed gender pay on a global basis and found that across the entire Company, female employees at The Cigna Group earn more than 99 cents for every dollar earned by similarly situated male employees.\nOur online learning platform and career development tools, including a career portal and career planning tool, offer a broad range of training, education and development resources to all employees. In 2024, based on internal data, employees on average engaged in 37 hours of learning through these resources. Our agile leadership development strategy, anchored by The Cigna Group Leader Profile and aligned with our mission and enterprise goals, serves to cultivate leadership capabilities for people leaders and critical segments across our organization through innovative programs and resources. The Cigna Group also offers an education reimbursement program for both full- and part-time employees who meet the continuing education criteria. We believe these strategies and programs contribute to employee engagement and retention and prepare our employees to meet our needs now and in the future. \nENVIRONMENTAL, SOCIAL AND GOVERNANCE\nThe Cigna Group environmental, social and governance framework is structured around four connected pillars that underscore our enterprise mission to improve the health and vitality of those we serve. We drive action through this framework to deliver on our purpose and performance vision: to transform the ecosystem of health into one that is well-functioning, sustainable, accessible and equitable - advancing better health for all. Our commitment to this vision guides us in our multidimensional value-creation strategy as we strive to meet the needs of our many stakeholders. The four pillars of this framework are as follows:\n11\nHealthy Society. \nWe are committed to understanding and addressing social determinants of health and improving medical quality and access while lowering health risks, promoting preventive health interventions and coordinating all aspects of care. We drive progress by aligning our products and services with value-based care models, leveraging integrated benefits, managing drug costs through innovation, expanding digital offerings and reviewing coverage policies for health equity. \nHealthy Workforce. \nWe believe that employers play a vital role in the health care system, and we strive to be a model for others by prioritizing and investing in the health and vitality of employees within our own company. We aim to cultivate a purpose- and performance-driven workforce that is equipped and empowered to drive growth and innovation across our diverse businesses. See further discussion of this pillar within Part I, Item 1 \"Human Capital Management\" section above. \nHealthy Environment. \nWe believe that responsible environmental stewardship can improve health and vitality and also makes sound business sense. We strive to identify new efficiencies and make strategic investments that reduce our environmental impacts and our operating costs. \nHealthy Company. \nWe have a deep and long-held commitment to strong governance as well as ethical and resilient business practices. This includes protecting the sensitive data of our clients and customers by ensuring cybersecurity incident response preparedness, supporting a responsible supply chain and committing to increasing our annual diverse supplier spend.\nREGULATION\nWe are regulated by federal, state and international legislative and executive bodies and agencies, which generally have discretion to issue regulations and interpret and enforce laws and rules. These regulations can vary significantly from jurisdiction to jurisdiction, and the regulations and interpretations thereof may also change periodically. We expect continued legislative and regulatory debate of issues related to our businesses, and executive, judicial or legislative intervention could further impact the regulatory landscape for the health services industry. Our international subsidiaries face an increasingly complex regulatory dynamic, including as a result of rigorous regulations and the impact of geopolitical developments or tensions.\nMany aspects of our business are directly regulated by federal and state laws and administrative agencies, such as HHS, CMS, the Internal Revenue Service (\"IRS\"), the U.S. Departments of Labor (\"DOL\") and Treasury, the Office of Personnel Management (\"OPM\"), the Federal Trade Commission (\"FTC\"), the SEC, the Office of the National Coordinator for Health Information Technology, state departments of insurance and state boards of pharmacy. Our business practices may also be shaped by enforcement actions of federal agencies, such as the Department of Justice (\"DOJ\"), state agencies and judicial decisions.\nIn addition, aspects of our business are subject to indirect regulation. The self-funded benefit plans sponsored by our U.S. employer clients are regulated under federal law. These self-funded clients expect us to administer their plans in compliance with the regulatory requirements applicable to them.\nOur business operations and the books and records of our regulated businesses are routinely subject to regulatory examination and audit at regular intervals by state insurance and HMO regulatory agencies, state boards of pharmacy, CMS, DOL and OPM to assess compliance with applicable laws and regulations. Our operations are also subject to nonroutine examinations, audits and investigations by various state and federal regulatory agencies, generally as the result of a complaint. In addition, we may be implicated in investigations of our clients whose group benefit plans we administer on their behalf. As a result, we routinely receive subpoenas and other demands or requests for information from various state insurance and HMO regulatory agencies, state attorneys general, the HHS Office of Inspector General (\"HHS-OIG\"), the DOJ, the FTC, the DOL, and other state, federal and international authorities. We may also be called upon by members of the U.S. Congress to provide information regarding certain of our business practices. If The Cigna Group is determined to have failed to comply with applicable laws or regulations, these examinations, audits, investigations, reviews, subpoenas and demands may (a) result in fines, penalties, injunctions, consent orders or other settlement agreements (such as corporate integrity agreements or loss of licensure); (b) suspend or exclude us from participation in government programs or limit our ability to sell or market our products; (c) require changes in business practices; (d) damage relationships with the agencies that regulate us and affect our ability to secure regulatory approvals necessary for the operation of our business; or (e) damage our brand and reputation.\nEven where we believe that we are in compliance with the various laws and regulations, any enforcement actions by federal, state or international government officials alleging noncompliance with these rules and regulations could subject us to penalties or restructuring or reorganization of our business. For a discussion of the risks related to our compliance with these laws and regulations, please see the \"Risk Factors\" section located in Part I, Item 1A of this Form 10-K. \n12\nConsolidated Appropriations Act, 2023\nThe Consolidated Appropriations Act, 2023, ended federal medical assistance percentage increases that were in effect during the COVID-19 Public Health Emergency (\"PHE\"), which were tied to continuous coverage requirements for Medicaid enrollees during the PHE, and enabled states to restart Medicaid eligibility renewals and terminations for ineligible individuals. As a result, states resumed Medicaid redeterminations in April 2023 for the first time since the PHE began. Under the redeterminations, many beneficiaries are no longer eligible for Medicaid. As a result, some of the beneficiaries determined to be ineligible for Medicaid sought alternate coverage in the individual marketplace.\nThe Patient Protection and Affordable Care Act\nThe Patient Protection and Affordable Care Act and amendments to the law (collectively, \"ACA\") mandated broad changes to the U.S. health care system that affect insured and self-insured health benefit plans and pharmacy benefit managers (\"PBMs\"). Our business model is impacted by the ACA and may be impacted by additional, future changes to the ACA, including our relationships with current and future producers and health care providers, products, service providers and technologies. The ACA imposed, among other things, certain assessments on health insurers, created health insurance exchanges for individuals and small group employers to purchase insurance coverage, and implemented minimum MLRs for our Cigna Healthcare business. The ACA allows states to adopt MLR requirements that are more stringent than those established by the ACA. Other provisions of the ACA in effect include reduced Medicare Advantage payment rates, the requirement to cover preventive services with no enrollee cost-sharing, a ban on the use of lifetime and annual limits on the dollar amount of essential health benefits, increased restrictions on rescinding coverage, extended coverage of dependents up to age 26, restrictions on differential pricing, and certain pharmacy benefit transparency requirements. In 2021, in response to the COVID-19 pandemic, the federal government temporarily expanded eligibility for ACA subsidies to higher-income people who did not otherwise qualify and increased ACA subsidies for lower-income people who already qualified in 2021 and 2022, among other actions. The Inflation Reduction Act of 2022 extended the increased premium tax credits for individuals enrolled in ACA-qualified health plans through December 31, 2025.\n \nMedicare and Medicaid Regulations\nThrough our subsidiaries, we offer individual and group Medicare Advantage, Medicare Prescription Drug and Medicare Supplement products. We also provide Medicare Part D-related products and services to other Medicare Part D sponsors, Medicare Advantage Prescription Drug Plans, and employers and clients offering Medicare Part D benefits to Medicare Part D eligible beneficiaries, including those dually eligible for Medicare and Medicaid benefits (\"dual-eligible\"). As part of our Medicare Advantage and Medicare Part D business, we contract with CMS to provide services to Medicare beneficiaries. We offer dual-eligible products and participate in state Medicaid programs directly or indirectly through our clients that are Medicaid managed care contractors. We also perform certain Medicaid subrogation services and certain delegated services for clients, including utilization management, which are regulated by federal and state laws. \nOur products and our participation in government-sponsored health care programs are regulated by CMS, state Medicaid agencies, HHS-OIG, DOJ, and other federal and state agencies, and we are subject to risks associated with audits of our performance and audits to determine compliance with contracts and regulations. Our ability to obtain payment (and the determination of the amount of such payments), market to, enroll and retain customers, and expand into new service areas is subject to compliance with CMS' numerous and complex regulations and requirements that are subject to administrative discretion, review and enforcement. For example, contracts with CMS for coverage of prescription drugs under Medicare Part D contain provisions for risk sharing, which affect our ultimate payments from CMS. Variances exceeding certain thresholds may require us to refund to CMS a portion of the payments we received. We expect federal and state agencies and third-party contractors, such as recovery audit contractors, to closely scrutinize our compliance with program and contractual requirements. Program terms and requirements may change because of rulemaking or enforcement activities, which could result in disruption in the marketplace. Noncompliance with these laws and regulations may result in significant consequences, including fines and penalties, enrollment sanctions, exclusion from the Medicare and Medicaid programs, limitations on expansion, restrictions on marketing our plans, corrections of improper payments and criminal penalties. \nCMS evaluates Medicare Advantage plans and Part D plans under its \"Star Rating\" system, which considers various measures adopted by CMS, including quality of care, preventive services, chronic illness management, coverage determinations and appeals, and customer satisfaction. Plans that perform very well are able to offer enhanced benefits, market more effectively and for longer periods of time than other plans, and obtain quality-bonus payments, with Medicare Advantage plans receiving a rating of four or more stars eligible for such payments. The Star Rating system is subject to change annually by CMS, which may make it more difficult to achieve and maintain four stars or greater. \nCMS provides risk-adjusted premium payments for Medicare Advantage plans based on our customer demographics and medical diagnoses, which may change based on the underlying health of our customers. Under the risk adjustment methodology, Medicare Advantage plans must collect and submit the necessary diagnosis code information from providers to CMS. We generally rely on \n13\nproviders to appropriately document their claims and other submissions with appropriate diagnoses from which we extract hierarchical condition codes to submit to CMS as the basis for our payments. CMS conducts audits to validate the risk adjustment data submitted by health plans. \nIn 2023, CMS issued a final rule (\"Final Rule\") on its audit methodology and related policies for Risk Adjustment Data Validation (\"RADV\"), which is currently being challenged in federal court. The Final Rule codifies that CMS will use a statistically valid method for sampling and extrapolation of error rates and a decision not to apply a fee for service adjuster when determining RADV audit findings. Audits for payment years prior to 2018 are not subject to extrapolation. RADV audits for our contract years 2011 through 2015 are currently awaiting CMS finalization. The Company is not currently subject to RADV audits for 2018 and subsequent payment years. The DOJ is currently conducting industry-wide investigations of the risk adjustment data submission practices and business processes of several Medicare Advantage organizations. The Cigna Group was a party to such an investigation, which was settled during the third quarter of 2023 and is subject to a related Corporate Integrity Agreement (the \"CIA\").\nIn January 2024, the Company entered into a definitive agreement to sell the Medicare Advantage, Medicare Individual Stand-Alone Prescription Drug Plans, Medicare and Other Supplemental Benefits, and CareAllies businesses within the U.S. Healthcare operating segment to HCSC. See Note 5 to the Consolidated Financial Statements for further information.\nHealth Care Fraud and Abuse Laws\nOur products and services are subject to health care fraud, waste and abuse laws, including the federal False Claims Act (\"False Claims Act\"), state false claims acts, federal and state anti-kickback laws, and the federal Civil Monetary Penalties Law. These laws and related regulations prohibit a wide range of activities, including kickbacks in return for customer referrals, billing for unnecessary medical services, beneficiary inducement, upcoding and improper marketing. The regulations and contractual requirements in this area are complex, frequently modified, and subject to administrative discretion and judicial interpretation.\nNoncompliance with such laws may result in enforcement and other actions, including civil and criminal penalties, substantial financial liabilities (including treble damages under the False Claims Act), and exclusion from participation in federal and state health care programs. Additionally, private individuals have brought and may bring \nqui tam\n, or \"whistleblower,\" suits under the False Claims Act, which authorizes the payment of a portion of any recovery to the individual bringing suit. Any changes to such laws, and the implementation of any regulations that would eliminate the anti-kickback regulatory safe harbors on which we rely, may impact our ability to engage in certain arrangements, such as price concessions, including rebates, that are offered by pharmaceutical manufacturers to plan sponsors or PBMs under the Medicare Part D program. \nGovernment Procurement Regulations\nWe have a contract with the U.S. DoD that subjects us to applicable Federal Acquisition Regulations (\"FAR\") and the DoD FAR Supplement, which govern federal government contracts. Further, there are other federal and state laws applicable to our DoD arrangement and our arrangements with other clients that may be subject to government procurement regulations. In addition, certain of our clients participate as contracting carriers in the Federal Employees Health Benefits Program administered by the OPM, which includes various pharmacy benefit management standards.\nEmployee Retirement Income Security Act\nOur domestic subsidiaries sell most of their products and services to sponsors of employee benefit plans that are governed by the Employee Retirement Income Security Act (\"ERISA\"). ERISA is a complex set of federal laws and regulations enforced by the IRS and the DOL, as well as the courts. ERISA regulates certain aspects of the relationship between us, the employers that maintain employee welfare benefit plans subject to ERISA and the participants in such plans. Certain of our domestic subsidiaries are also subject to requirements imposed by ERISA affecting claim payment and appeals procedures for individual health insurance and insured and self-insured group health plans and for the insured plans we administer. \nPrivacy, Security and Data Standards Regulations\nOn the federal level, we are subject to a number of sector-specific regulations related to the creation, collection, dissemination, receipt, maintenance, protection, use, transmission, disclosure, privacy, confidentiality, security, availability, integrity, processing and disposal of protected health information (\"PHI\") and other personally identifiable information (\"PII\"). The federal Health Insurance Portability and Accountability Act of 1996, as amended, and the regulations that implement such laws (collectively, \"HIPAA\") impose requirements on covered entities and business associates (and we are both) that address the privacy and security of PHI, regulate permissible uses and disclosures of PHI, and impose breach notification requirements. Violations of HIPAA may result in enforcement actions, civil and criminal penalties and settlement, resolution and monitoring agreements. State attorneys general may also bring civil actions seeking injunctions or damages in response to violations of HIPAA that threaten the privacy of state residents. We may also be held liable under HIPAA for violations by our vendors. There can be no assurance that we will not be the subject of an investigation, \n14\naudit or compliance review regarding our compliance with HIPAA. HIPAA does not preempt more stringent state health privacy laws and regulations, which may protect the health information of certain individuals, such as minors, and certain types of sensitive health information, such as transgender care, HIV/AIDS status, reproductive health information, genetic information, and mental and behavioral health.\nOther U.S. federal and state consumer privacy laws typically exempt data and/or entities subject to HIPAA, but several states, such as Washington, Nevada and Connecticut, have recently enacted privacy laws to protect consumer health data and require consent for the collection, use and sharing of consumer health data. These laws apply to data that is collected outside the scope of HIPAA. In addition, the California Consumer Privacy Act, as amended by the California Privacy Act (\"CCPA\"), became effective on January 1, 2020, and applies to data that is collected outside the scope of HIPAA (e.g., employee and business contact information). The CCPA increased the privacy protections afforded to California residents with respect to PII that falls outside the scope of HIPAA, including by providing such residents certain rights with respect to their PII and limiting how we may collect and process such residents' PII. All 50 U.S. states have laws requiring companies to notify individuals and state regulatory authorities in the event of certain data breaches. These laws and others may impact our businesses and practices.\nThe federal government has also enacted final regulations on interoperability and information blocking to support the seamless and secure access, exchange and use of electronic health information by and between patients, enrollees and entities, such as payors and health care providers. The regulations impact how industry participants, including us, comply with disclosure requirements and share information with individuals and other health care organizations.\nThe federal Gramm-Leach-Bliley Act and its implementing regulations generally place restrictions on the disclosure of nonpublic information to nonaffiliated third parties and requires financial institutions, including insurers, to provide customers with notice regarding how their nonpublic personal information is used, including an opportunity to \"opt out\" of certain disclosures. State departments of insurance and certain federal agencies adopted implementing regulations as required by federal law. \nAdditionally, under Section 5 of the Federal Trade Commission Act (\"FTC Act\"), the FTC has jurisdiction over certain privacy and security practices deemed unfair and deceptive acts and practices in or affecting commerce, which includes unfair and deceptive practices with respect to consumer privacy rights and safeguarding of PHI and PII. In addition to the FTC Act, the FTC also enforces other federal laws relating to consumers' privacy and security. The FTC has also been active with respect to companies' use of big data and AI, specifically ensuring fair and equitable use of these tools, and the FTC has named AI as an area of enforcement focus. U.S. state legislatures and regulators are similarly interested in the use of AI, particularly as it is used in modeling, and a handful of states have either passed legislation or issued regulatory guidance concerning AI. Additionally, the National Association of Insurance Commissioners (\"NAIC\"), an organization of state insurance regulators, recently established the Innovation, Cybersecurity and Technology Committee to provide a forum for regulators to learn about, monitor and confer on emerging technology issues, including, among others, cybersecurity and AI. State Departments of Insurance and other state government agencies and legislatures are increasingly aware and active in providing guidance in the AI space.\nThe Cybersecurity Information Sharing Act of 2015 encouraged organizations to share cyber threat indicators with the federal government and, among other things, directed HHS to develop a set of voluntary cybersecurity best practices for organizations in the health care industry. States have also begun to issue regulations specifically related to cybersecurity, which may differ or conflict from state to state. In October 2017, the NAIC adopted the Insurance Data Security Model Law, which creates rules for insurers and other covered entities addressing data security, investigation and notification of breaches. This includes maintaining an information security program based on ongoing risk assessment, overseeing third-party service providers, investigating data breaches and notifying regulators of a cybersecurity event. As the model law is intended to serve as model legislation only, states will need to enact legislation for the model law to become mandatory and enforceable. To date, 21 states have enacted some form of the model law.\nOver the past several years, the federal government has increasingly focused on the cybersecurity requirements applicable to government contractors, including enhanced guidance and regulation. These include compliance with the Privacy Act of 1974, the Defense Federal Acquisition Regulation Supplement cybersecurity requirements, the Cybersecurity Maturity Model Certification (going into effect over the next four years and based on the National Institute of Standards and Technology (\"NIST\") standards), the Federal Information Security Modernization Act and the White House's 2021 Executive Order on Improving the Nation's Cybersecurity.\nIn addition, we are or may become subject to international laws, rules and regulations governing privacy, data protection, information security, AI and wider data regulation, such as the European Union's General Data Protection Regulation (\"GDPR\"), Artificial Intelligence Act and Digital Operational Resilience Act, which can be more stringent than those in the United States. Complying with these laws may increase our compliance costs or necessitate changes to our business activities, and any failure to comply could result in regulatory investigations, fines or other penalties. Some non-U.S. jurisdictions are also instituting data residency regulations requiring that data be maintained within the respective jurisdiction or otherwise restricting transfer of personal data across borders unless specified regulatory requirements are met.\n15\nConsumer Protection Laws\nWe engage in direct-to-consumer activities and are therefore subject to federal and state regulations applicable to electronic communications and other consumer protection laws and regulations, such as the Telephone Consumer Protection Act and the CAN-SPAM Act. We face increased risk under such laws and may be subject to consumer or other lawsuits, penalties, enforcement actions and sanctions. The FTC and state attorneys general are also increasingly exercising their regulatory and enforcement authorities in the areas of consumer privacy and data security.\nState and federal policymakers have taken actions intended to increase transparency and predictability of health care costs for consumers. For example, the Transparency in Coverage rule issued by the HHS, the DOL and the Department of the Treasury now requires most group health plans and health insurance issuers in the individual and group markets to publicly disclose price and cost-sharing information for all items and services to participants and enrollees. \nCongress also passed the No Surprises Act, which prohibits health care providers, in certain situations, from balance billing the patient and requires that they work directly with insurers to agree on out-of-network reimbursement, including utilizing an independent dispute resolution process outlined in the act. Many states already have addressed balance billing or surprise medical bills. These laws and regulations vary in their approach, resulting in different impacts on the health care system as a whole. \nAdditionally, most states have consumer protection laws that have been the basis for investigations and multistate settlements relating to financial incentives provided by drug manufacturers to retail pharmacies in connection with product conversion programs. Such statutes have also been cited as the basis for claims or investigations by state attorneys general relative to privacy and data security.\nOffice of Foreign Assets Control Sanctions and Anti-Money Laundering\nWe are also subject to regulation by the Office of Foreign Assets Control of the U.S. Department of the Treasury, which administers and enforces economic and trade sanctions against targeted foreign jurisdictions and regimes based on U.S. foreign policy and national security goals. Certain of our products are subject to the Department of the Treasury anti-money laundering regulations under the Bank Secrecy Act. In addition, we are subject to similar regulations in non-U.S. jurisdictions in which we operate.\nCorporate Practice of Medicine and Other Laws\nMany states in which our subsidiaries operate limit the practice of medicine to licensed individuals or professional organizations comprised of licensed individuals, and business corporations generally may not exercise control over the medical decisions of physicians. Statutes, regulations, and judicial and regulatory interpretations relating to the practice of medicine, fee-splitting between physicians, and referral sources and similar issues vary widely from state to state and are subject to change and varying interpretations. We believe that our health services operations comply with applicable state statutes regarding corporate practice of medicine, fee-splitting and similar issues. However, any enforcement actions by governmental officials alleging noncompliance with these statutes could subject us to penalties or restructuring or reorganization of our business.\nLaws and Legislation Affecting Pharmacy Benefit Plan Design, Administration and Pharmacy Network Access\nSome states have enacted laws that prohibit plan sponsors from implementing certain restrictive benefit plan design features, and many states have laws or have introduced legislation to regulate various aspects of plans, including provisions relating to the pharmacy benefit. Some states have also enacted legislation that can negatively impact the use of cost-saving network configurations for plan sponsors, such as limiting the implementation of pharmacy benefit designs and reimbursement structures that leverage affiliate pharmacies to reduce costs. CMS and some states have issued laws, guidance and regulations that impose restrictions that generate additional costs and limit our ability to maximize efficiencies, such as those that could otherwise be gained through certain prescription and refill processes. Some states mandate or have proposed to mandate coverage of certain benefits, conditions and U.S. Food and Drug Administration (\"FDA\")-approved drugs and to restrict certain therapeutic interventions.\nAdditionally, Medicare Part D and most states now have laws, regulations or some form of legislation affecting our ability, or our clients' ability, to limit access to a pharmacy provider network or remove a provider from a network. Certain states have laws prohibiting certain pharmacy benefit management clients from imposing additional copayments, deductibles, limitations on benefits or other conditions on covered individuals utilizing a retail pharmacy when the same conditions are not otherwise imposed on covered individuals utilizing home delivery pharmacies. However, the laws require the retail pharmacy to agree to the same reimbursement amounts and terms and conditions as are imposed on the home delivery pharmacies. An increase in the number of prescriptions filled at retail pharmacies may have a negative impact on the number of prescriptions filled through home delivery.\n16\nPharmacy Benefit Manager and Drug Pricing Regulation\nOur pharmacy benefit management services are subject to numerous laws and regulations that govern, and proposed legislation and regulations that may govern, critical practices, including disclosure, receipt and retention of rebates and other payments received from pharmaceutical manufacturers; certain pharmacy contracting practices, including disclosure of cost information to customers; pharmacy reimbursement mandates; the receipt and retention of transmission fees from contracted pharmacies; performance-based price concessions; pharmacy price concessions to drug prices at the point of sale; audits of contracted pharmacies; use of, administration of or changes to drug formularies, the use and disclosure of maximum allowable cost (\"MAC\") pricing, or clinical programs; \"most favored nation\" pricing, which provides that a pharmacy participating in a specific government program must give the program the best price the pharmacy makes available to any third-party plan; disclosure of data to third parties; drug utilization management practices; the level of duty a pharmacy benefit manager owes its clients or customers; configuration of pharmacy networks; the operations of our subsidiary pharmacies; referrals to affiliated pharmacies; disclosure of negotiated provider reimbursement rates; disclosure of negotiated drug rebates; calculation of certain customer cost-share for prescription drug claims; pricing that includes differential or spread (i.e., a difference between the drug price charged to the plan sponsor by a pharmacy benefit manager and the price paid by the manager to the dispensing provider); disclosure of fees associated with administrative service agreements and patient care programs that are attributable to customers' drug utilization; utilization management; and registration or licensing of pharmacy benefit managers.\nWe expect federal and state governments to continue to prioritize means of addressing vertical integration and out-of-pocket costs for consumers, particularly related to prescription drug costs. Recently enacted legislation, such as the Inflation Reduction Act and other policy proposals and regulations, including proposed legislation aimed at providing transparency with respect to pharmacy benefit managers, vary broadly in their approaches to achieve that goal. Additionally, proposals at the federal and state levels consider increased regulation of pharmacy benefit managers and health plans as a means to limit consumer out-of-pocket costs. The NAIC has also proposed laws intended to protect consumer drug benefits and has examined regulatory approaches to pharmacy benefit manager business practices.\nSome states have enacted statutes referred to as \"MAC Transparency Laws\" regulating the use of MAC pricing. MAC Transparency Laws generally require pharmacy benefit managers to disclose specific information related to MAC pricing to pharmacies and provide certain appeal rights for pharmacies. MAC Transparency Laws also restrict the application of MAC and may require operational changes to maintain compliance with the law. Some states have also enacted laws regulating pharmacy pricing and protecting the profitability of pharmacies for dispensing certain MAC-priced drugs. Some states have enacted laws requiring that the customer cost-share for a prescription drug claim not exceed certain price points, such as the pharmacy's usual and customary charge or its contracted reimbursement for the drug. In a recent Supreme Court decision, the Court found that certain MAC Transparency Laws may be applied by states to ERISA plans in addition to health plans regulated by the applicable state. Following this decision, state legislatures and regulators have sought to extend their oversight authority of self-funded ERISA plans to pharmacy benefit management functions and pharmacy benefit plan designs beyond MAC pricing. \nPharmacy Regulation\nWe are licensed to do business as a pharmacy in the states in which our pharmacies are located, and the health care professionals who we employ are also licensed by, and subject to, the laws and regulations of state boards of pharmacy and other governmental authorities. Participation in Medicare and Medicaid programs requires our pharmacies to comply with the applicable Medicare and Medicaid provider rules and regulations and exposes the pharmacies to reimbursement, claims submission, pricing and other changes. In addition to the health care fraud and abuse laws and the privacy and security laws described above, our home delivery and specialty pharmacy operations are also subject to extensive federal and state laws and regulations that govern the labeling, packaging, repackaging, compounding, storing, holding, disposal, distribution, advertising, misbranding, adulteration, transfer, handling and security of prescription drugs and the dispensing of prescription, over-the-counter, hazardous and controlled substances, as well as laws enforced by the U.S. Drug Enforcement Administration, the FDA, state-controlled substance authorities, the FTC and the United States Postal Service. Violations of pharmacy laws and regulations may result in warning letters, civil and criminal penalties, seizures, suspension, termination or revocation of licenses and registrations, restrictions on facilities or operations, and other enforcement actions.\nFinancial Reporting, Internal Control and \nCorporate\n Governance\nState regulators closely monitor the financial condition of licensed insurance companies and HMOs. States regulate the form and content of statutory financial statements, the type and concentration of permitted investments, and corporate governance over financial reporting. Our insurance and HMO subsidiaries are required to file periodic financial reports and schedules with regulators in most of the jurisdictions in which they do business as well as annual financial statements audited by independent registered public accounting firms. Certain insurance and HMO subsidiaries are required to file an annual report of internal control over financial reporting with \n17\nmost jurisdictions in which they do business. Insurance and HMO subsidiaries' operations and financial statements are subject to examination by regulators. Many states have expanded regulations relating to corporate governance and internal control activities of insurance and HMO subsidiaries as a result of model regulations adopted by the NAIC with elements similar to corporate governance and risk oversight disclosure requirements under federal securities laws.\nGuaranty Associations, Indemnity Funds, Risk Pools and Administrative Funds\nMost states and certain non-U.S. jurisdictions require insurance companies to support guaranty associations or indemnity funds that are established to pay claims on behalf of insolvent insurance companies. Some states have similar laws relating to HMOs and other payors, such as consumer operated and oriented plans (co-ops) established under the ACA. In the United States, these associations levy assessments on member insurers licensed in a particular state to pay such claims. Certain states require HMOs to participate in guaranty funds, special risk pools and administrative funds. \nAdditionally, certain states continue to require health insurers and HMOs to participate in assigned risk plans, joint underwriting authorities, pools or other residual market mechanisms to cover risks not acceptable under normal underwriting standards, although some states have eliminated these requirements as a result of the ACA.\nSolvency and Capital Requirements\nMany states have adopted some form of the NAIC model solvency-related laws and risk-based capital (\"RBC\") rules for life and health insurance companies and HMOs. The RBC rules recommend a minimum level of capital depending on the types and quality of investments held, the types of business written and the types of liabilities incurred. If the ratio of the insurer's adjusted surplus to its RBC falls below statutorily required minimums, the insurer could be subject to regulatory actions ranging from increased scrutiny to conservatorship.\nIn addition, various non-U.S. jurisdictions prescribe minimum surplus requirements that are based upon solvency, liquidity and reserve coverage measures. Our HMOs and life and health insurance subsidiaries, as well as non-U.S. insurance subsidiaries, are compliant with applicable RBC and non-U.S. surplus rules.\nHolding Company Laws\nOur domestic insurance companies and certain of our HMOs are subject to state laws regulating subsidiaries of insurance holding companies. Under such laws, certain dividends, distributions and other transactions between an insurance company or an HMO subsidiary and its affiliates may require notification to, or approval by, one or more state insurance commissioners. In addition, the holding company acts of states in which our subsidiaries are domiciled restrict the ability of any person to obtain control of an insurance company or HMO subsidiary without prior regulatory approval. \nMarketing, Advertising and Products\nIn most states, our insurance companies and HMO subsidiaries are required to certify compliance with applicable advertising regulations on an annual basis and comply with certain federal and state marketing, advertising and communications laws and regulations. In April 2023, CMS issued a final rule revising regulations governing marketing by Medicare Advantage and Medicare Part D plans, which requires, among other things, enrollees to be notified of their ability to opt out of phone calls regarding Medicare Advantage and Part D marketing, requires agents to explain the effect of an enrollee's enrollment choice on their current coverage, simplifies plan comparisons by requiring medical benefits to be listed in a specific order at the top of a plan's Summary of Benefits, requires Medicare Advantage organizations and Part D sponsors to have an oversight plan that monitors activities of agents and brokers and to report noncompliance to CMS, and limits the time a potential enrollee may be contacted about Medicare plan options to 12 months after the enrollee first asked for information.\nLicensing, Registration and Utilization Management Requirements\nOur insurance companies and HMO subsidiaries must be licensed by the jurisdictions in which they conduct business, and our international subsidiaries are often required to be licensed when entering new markets or starting new operations in certain jurisdictions. Additionally, certain subsidiaries contract to provide claim administration, utilization management and other related services for the administration of self-insured benefit plans and may be subject to state third-party administration and other licensing requirements and regulation, as well as URAC and other third-party accreditation requirements.\nCertain states have adopted pharmacy benefit management registration, licensure or disclosure laws, which may mandate disclosure of various aspects of our financial practices, including those concerning pharmaceutical company revenue, prescribing processes, and client and provider audit terms. States have begun to enact laws exempting certain providers from pre-authorization requirements of insurers; laws standardizing the process for, and restricting the use of, utilization management rules; and laws shortening the time \n18\nframes within which prescription drug prior authorization determinations must be made. The inability to apply pre-authorization requirements could lead to increased costs to plan sponsors and issuers by way of the provision of unnecessary services. The licensure requirements for our insurance companies and subsidiaries vary by jurisdiction and are subject to change.\nInternational Regulations\nOur operations outside of the United States expose us to laws of multiple jurisdictions and the rules and regulations of various governing bodies and regulators, including those related to the provision of insurance, financial and other disclosures, the provision of health care-related services, corporate governance, privacy, data protection, data mining, data transfer, intellectual property, labor and employment, consumer protection, direct-to-consumer communications activities, tax, anti-corruption and anti-money laundering. Foreign laws and rules may include requirements that are different from, or more stringent than, similar requirements in the United States.\nOur operations in countries outside of the United States are subject to local regulations of the jurisdictions where we operate; in some cases, they are subject to regulations in the jurisdictions where customers reside; and in all cases, they are subject to the Foreign Corrupt Practices Act (\"FCPA\").\nThe FCPA prohibits offering, promising, providing or authorizing others to give anything of value to a foreign government official or employee to obtain or retain business or otherwise secure a business advantage. Outside of the United States, we may interact with government officials in several different capacities: as regulators of our insurance business; as clients or partners who are state-owned or partially state-owned; as health care providers who are employed by the government; as hospitals that are state-owned; and as officials issuing permits in connection with real estate transactions. Violations of the FCPA and other anti-corruption laws may result in severe criminal and civil sanctions as well as other penalties. Countries in which we do business also have anti-corruption laws to which we are subject, such as the UK Bribery Act of 2010. As international regulators often share information, any voluntary disclosures of violations may be shared with authorities in other countries, thus potentially exposing companies to liability and potential penalties in multiple jurisdictions.\nAnti-money laundering requirements in countries where we do business also may impose obligations to collect certain information about each customer at time of sale or to risk rank each customer to determine possible future money laundering risk.",
  "item7": "Item 7. \nMANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nManagement's Discussion and Analysis of Financial Condition and Results of Operations (\"MD&A\") is intended to provide information to assist you in better understanding and evaluating the financial condition of The Cigna Group as of December 31, 2024 compared with December 31, 2023 and our results of operations for 2024 compared with 2023 and 2022 and is intended to help you understand the ongoing trends in our business. For comparisons of our results of operations for 2023 compared with 2022, please refer to the previously filed MD&A included in Part II, Item 7 of our Form 10-K for the year ended December 31, 2023. We encourage you to read this MD&A in conjunction with our Consolidated Financial Statements included in Part II, Item 8 of this Annual Report on Form 10-K (\"Form 10-K\") and the \"Risk Factors\" contained in Part I, Item 1A of this Form 10-K. \nUnless otherwise indicated, financial information in this MD&A is presented in accordance with accounting principles generally accepted in the United States of America (\"GAAP\"). See Note 2 to the Consolidated Financial Statements in this Form 10-K for additional information regarding the Company's significant accounting policies. In some of our financial tables in this MD&A, we present either percentage changes or \"N/M\" when those changes are so large as to become not meaningful. Changes in percentages are expressed in basis points (\"bps\").\nIn this MD&A, our consolidated measures \"adjusted income from operations,\" earnings per share on that same basis and \"adjusted revenues\" are not determined in accordance with GAAP and should not be viewed as substitutes for the most directly comparable GAAP measures of \"shareholders' net income,\" \"earnings per share\" and \"total revenues.\" We also use pre-tax adjusted income (loss) from operations and adjusted revenues to measure the results of our segments.\nThe Company uses \"pre-tax adjusted income (loss) from operations\" and \"adjusted revenues\" as its principal financial measures of segment operating performance because management believes these metrics reflect the underlying results of business operations and facilitate analysis of trends in underlying revenue, expenses and profitability. We define adjusted income (loss) from operations as shareholders' net income (or income (loss) before income taxes less pre-tax income (loss) attributable to noncontrolling interests for the segment metric) excluding net investment gains/losses, amortization of acquired intangible assets and special items. The Cigna Group's share of certain investment results of its joint ventures reported in the Cigna Healthcare segment using the equity method of accounting are also excluded. Special items are matters that management believes are not representative of the underlying results of operations due to their nature or size. Adjusted income (loss) from operations is measured on an after-tax basis for consolidated results and on a pre-tax basis for segment results. Consolidated adjusted income (loss) from operations is not determined in accordance with GAAP and should not be viewed as a substitute for the most directly comparable GAAP measure, shareholders' net income. See the below Financial Highlights section for a reconciliation of consolidated adjusted income from operations to shareholders' net income. \nThe Company defines adjusted revenues as total revenues excluding the following adjustments: special items and The Cigna Group's share of certain investment results of its joint ventures reported in the Cigna Healthcare segment using the equity method of accounting. Special items are matters that management believes are not representative of the underlying results of operations due to their nature or size. We exclude these items from this measure because management believes they are not indicative of past or future underlying performance of the business. Adjusted revenues is not determined in accordance with GAAP and should not be viewed as a substitute for the most directly comparable GAAP measure, total revenues. See the below Financial Highlights section for a reconciliation of consolidated adjusted revenues to total revenues.\nEXECUTIVE OVERVIEW\nThe Cigna Group, together with its subsidiaries (either individually or collectively referred to as the \"Company,\" \"we,\" \"us\" or \"our\"), is a global health company committed to creating a better future for every individual and every community. Our subsidiaries offer a differentiated set of pharmacy, medical, behavioral, dental, and related products and services. For further information on our business and strategy, see Part I, Item 1 \"Business\" of this Form 10-K. \n38\nFinancial Highlights\nConsolidated Results of Operations (GAAP basis)\nFor the Years Ended December 31,\nChange\nChange\n(Dollars in millions)\n2024\n2023\n2022\n2024 vs. 2023\n2023 vs. 2022\nPharmacy revenues\n$\n185,362\n \n$\n137,243 \n$\n128,566 \n$\n48,119 \n35 \n%\n$\n8,677 \n7 \n%\nPremiums\n45,996\n \n44,237 \n39,916 \n1,759 \n4 \n4,321 \n11 \nFees and other revenues\n14,790\n \n12,619 \n10,881 \n2,171 \n17 \n1,738 \n16 \nNet investment income\n973\n \n1,166 \n1,155 \n(193)\n(17)\n11 \n1 \nTotal revenues\n247,121\n \n195,265 \n180,518 \n51,856 \n27 \n14,747 \n8 \nPharmacy and other service costs\n182,509\n \n133,801 \n124,834 \n48,708 \n36 \n8,967 \n7 \nMedical costs and other benefit expenses\n38,648\n \n36,287 \n32,184 \n2,361 \n7 \n4,103 \n13 \nSelling, general and administrative expenses\n14,844\n \n14,822 \n13,174 \n22 \n— \n1,648 \n13 \nAmortization of acquired intangible assets\n1,703\n \n1,819 \n1,876 \n(116)\n(6)\n(57)\n(3)\nTotal benefits and expenses\n237,704\n \n186,729 \n172,068 \n50,975 \n27 \n14,661 \n9 \nIncome from operations\n9,417\n \n8,536 \n8,450 \n881 \n10 \n86 \n1 \nInterest expense and other\n(1,435)\n(1,446)\n(1,228)\n11 \n(1)\n(218)\n18 \nNet gain (loss) on sale of businesses\n24\n \n(1,499)\n1,662 \n1,523 \nN/M\n(3,161)\nN/M\nNet investment losses\n(2,737)\n(78)\n(487)\n(2,659)\nN/M\n409 \n(84)\nIncome before income taxes\n5,269\n \n5,513 \n8,397 \n(244)\n(4)\n(2,884)\n(34)\nTotal income taxes\n1,491\n \n141 \n1,615 \n1,350 \nN/M\n(1,474)\n(91)\nNet income\n3,778\n \n5,372 \n6,782 \n(1,594)\n(30)\n(1,410)\n(21)\nLess: Net income attributable to noncontrolling interests\n344\n \n208 \n78 \n136 \n65 \n130 \n167 \nShareholders' net income\n$\n3,434\n \n$\n5,164 \n$\n6,704 \n$\n(1,730)\n(34)\n%\n$\n(1,540)\n(23)\n%\nConsolidated effective tax rate\n28.3\n \n%\n2.6 \n%\n19.2 \n%\n2,570 \nbps\n(1,660)\n \nbps\nMedical customers (in thousands)\n19,147\n \n19,780 \n18,004 \n(633)\n(3)\n%\n1,776 \n10 \n%\n39\nReconciliation of Shareholders' Net Income (GAAP) to Adjusted Income from Operations\nFor the Years Ended December 31,\n2024\n2023\n2022\n(In millions)\nPre-tax\nAfter-tax\nPre-tax\nAfter-tax\nPre-tax\nAfter-tax\nShareholders' net income\n$\n3,434\n \n$\n5,164 \n$\n6,704 \nAdjustments to reconcile to adjusted income from operations\nNet investment losses \n(1)\n$\n2,533\n \n2,529\n \n$\n135 \n114 \n$\n613 \n496 \nAmortization of acquired intangible assets\n1,703\n \n1,347\n \n1,819 \n1,413 \n1,876 \n1,345 \nSpecial items\nIntegration and transaction-related costs\n275\n \n211\n \n45 \n35 \n135 \n103 \nImpairment of dividend receivable \n182\n \n138\n \n— \n— \n— \n— \nDeferred tax expenses (benefits), net\n—\n \n84\n \n— \n(1,071)\n— \n— \nNet (gain) loss on sale of businesses \n(24)\n(2)\n1,499 \n1,429 \n(1,662)\n(1,332)\nCharge for organizational efficiency plan\n—\n \n—\n \n252 \n193 \n22 \n17 \nCharges (benefits) associated with litigation matters\n—\n \n—\n \n201 \n171 \n(28)\n(20)\nTotal special items\n$\n433\n \n431\n \n$\n1,997 \n757 \n$\n(1,533)\n(1,232)\nAdjusted income from operations\n$\n7,741\n \n$\n7,448 \n$\n7,313 \n(1)\nIncludes Net investment gains/losses as presented in our Consolidated Statements of Income, as well as the Company's share of certain investment results of its joint ventures reported in the Cigna Healthcare segment using the equity method of accounting, which are presented within Fees and other revenues in our Consolidated Statements of Income.\nReconciliation of Shareholders' Net Income (GAAP) to Adjusted Income from Operations\nFor the Years Ended December 31,\n2024\n2023\n2022\n(Diluted earnings per share)\nPre-tax\nAfter-tax\nPre-tax\nAfter-tax\nPre-tax\nAfter-tax\nShareholders' net income\n$\n12.12\n \n$\n17.39 \n$\n21.41 \nAdjustments to reconcile to adjusted income from operations\nNet investment losses \n(1)\n$\n8.95\n \n8.93\n \n$\n0.45 \n0.38 \n$\n1.96 \n1.59 \nAmortization of acquired intangible assets\n6.01\n \n4.76\n \n6.13 \n4.77 \n5.99 \n4.30 \nSpecial items\nIntegration and transaction-related costs\n0.97\n \n0.75\n \n0.15 \n0.12 \n0.43 \n0.33 \nImpairment of dividend receivable \n0.64\n \n0.49\n \n— \n— \n— \n— \nDeferred tax expenses (benefits), net\n—\n \n0.30\n \n— \n(3.61)\n— \n— \nNet (gain) loss on sale of businesses \n(0.08)\n(0.02)\n5.05 \n4.81 \n(5.31)\n(4.26)\nCharge for organizational efficiency plan\n—\n \n—\n \n0.85 \n0.65 \n0.07 \n0.05 \nCharges (benefits) associated with litigation matters\n—\n \n—\n \n0.68 \n0.58 \n(0.09)\n(0.06)\nTotal special items\n$\n1.53\n \n1.52\n \n$\n6.73 \n2.55 \n$\n(4.90)\n(3.94)\nAdjusted income from operations\n$\n27.33\n \n$\n25.09 \n$\n23.36 \n(1)\nIncludes Net investment gains/losses as presented in our Consolidated Statements of Income, as well as the Company's share of certain investment results of its joint ventures reported in the Cigna Healthcare segment using the equity method of accounting, which are presented within Fees and other revenues in our Consolidated Statements of Income.\n40\nFinancial highlights by segment\nFor the Years Ended December 31,\nChange\nChange\n(Dollars in millions, except per share amounts)\n2024\n2023\n2022\n2024 vs. 2023\n2023 vs. 2022\nRevenues\nAdjusted revenues by segment\nEvernorth Health Services\n$\n202,155\n \n$\n153,499 \n$\n140,335 \n32 \n%\n9 \n%\nCigna Healthcare\n52,914\n \n51,205 \n45,037 \n3 \n14 \nOther Operations\n828\n \n596 \n2,263 \n39 \n(74)\nCorporate, net of eliminations\n(8,798)\n(9,978)\n(6,991)\n(12)\n43 \nAdjusted revenues\n247,099\n \n195,322 \n180,644 \n27 \n8 \nNet investment results from certain equity method investments\n204\n \n(57)\n(126)\nN/M\n(55)\nSpecial item related to impairment of dividend receivable\n(182)\n— \n— \nN/M\nN/M\nTotal revenues\n$\n247,121\n \n$\n195,265 \n$\n180,518 \n27 \n%\n8 \n%\nShareholders' net income\n$\n3,434\n \n$\n5,164 \n$\n6,704 \n(34)\n%\n(23)\n%\nAdjusted income from operations\n$\n7,741\n \n$\n7,448 \n$\n7,313 \n4 \n%\n2 \n%\nEarnings per share (diluted)\nShareholders' net income\n$\n12.12\n \n$\n17.39 \n$\n21.41 \n(30)\n%\n(19)\n%\nAdjusted income from operations\n$\n27.33\n \n$\n25.09 \n$\n23.36 \n9 \n%\n7 \n%\nPre-tax adjusted income (loss) from operations by segment\nEvernorth Health Services\n$\n7,001\n \n$\n6,442 \n$\n6,127 \n9 \n%\n5 \n%\nCigna Healthcare\n4,229\n \n4,478 \n4,099 \n(6)\n9 \nOther Operations\n(9)\n96 \n509 \nN/M\n(81)\nCorporate, net of eliminations\n(1,688)\n(1,698)\n(1,466)\n(1)\n16 \nConsolidated pre-tax adjusted income from operations\n9,533\n \n9,318 \n9,269 \n2 \n1 \nIncome attributable to noncontrolling interests\n405\n \n146 \n84 \n177 \n74 \nNet investment (losses) \n(1)\n(2,533)\n(135)\n(613)\nN/M\n(78)\nAmortization of acquired intangible assets\n(1,703)\n(1,819)\n(1,876)\n(6)\n(3)\nSpecial items\n(433)\n(1,997)\n1,533 \n(78)\nN/M\nIncome before income taxes\n$\n5,269\n \n$\n5,513 \n$\n8,397 \n(4)\n%\n(34)\n%\n(1)\nIncludes Net investment gains/losses as presented in our Consolidated Statements of Income, as well as the Company's share of certain investment results of its joint ventures reported in the Cigna Healthcare segment using the equity method of accounting, which are presented within Fees and other revenues in our Consolidated Statements of Income.\nFor further analysis and explanation of each segment's results, see the \"Segment Reporting\" section of this MD&A.\nCommentary: 2024 versus 2023\nThe commentary presented below, and the segment commentaries that follow, compare results for the year ended December 31, 2024 with results for the year ended December 31, 2023. Commentary regarding percentage changes (or bps) and dollar variances represents the driver's impact on the overall category.\nShareholders' net income \ndecreased 34%, or $1,730 million, primarily reflecting increased net investment losses (-$2,415 million) driven by the impairment of VillageMD equity securities, as well as the absence of the foreign deferred tax benefits recorded in 2023 (-$1,155 million). These unfavorable items were partially offset by lower net losses on sale of businesses (+$1,431 million) and higher adjusted income from operations (+$293 million). See further discussion of these drivers below.\nAdjusted income from operations\n increased 4%, primarily reflecting higher earnings in Evernorth Health Services, partially offset by lower earnings in Cigna Healthcare.\nMedical customers\n decreased 3%, primarily reflecting a decrease in Individual and Family Plans (\"IFP\") customers.\nPharmacy revenues \nincreased 35%, primarily reflecting higher utilization of prescription drugs from customer growth in Evernorth Health Services.\nPremiums\n increased 4%, primarily reflecting higher premium rates in our U.S. Healthcare operating segment.\n41\nFees and other revenues \nincreased 17%, primarily reflecting growth in affordability services within our Pharmacy Benefit Services operating segment.\nNet investment income\n decreased 17%, primarily due to a $182 million impairment of dividend receivable in the third quarter of 2024 related to VillageMD accrued dividends.\nPharmacy and other service costs \nincreased 36%, primarily reflecting higher utilization of prescription drugs from customer growth in Evernorth Health Services.\nMedical costs and other benefit expenses \nincreased 7%, primarily reflecting higher medical costs in our U.S. Healthcare operating segment.\nSelling, general and administrative (\"SG&A\") expenses\n were flat, primarily reflecting increases in strategic investments to support both business growth and continued advancement of our digital capabilities and solutions (3%), offset by the absence of costs reported in 2023 for an organizational efficiency plan (-2%) and litigation settlements (-1%).\nNet gain (loss) on sale of businesses. \nThe gain reported in 2024 reflects the sale of a portion of an equity method investment, partially offset by an estimated loss on sale (primarily goodwill impairment) related to the HCSC transaction (defined below). The loss reported in 2023 primarily reflects a goodwill impairment related to the HCSC transaction. See Note 5 and Note 14 to the Consolidated Financial Statements for further discussion of the HCSC transaction and the equity method investment sale, respectively.\nInvestment results\n primarily reflect the impairment of VillageMD equity securities in 2024. See Note 11 to the Consolidated Financial Statements for further discussion of the impairment of VillageMD equity securities.\nThe effective tax rate\n increased, primarily driven by the absence of foreign deferred tax benefits recorded in 2023 and a valuation allowance related to the impairment of VillageMD equity securities, partially offset by the absence of the impact of the valuation allowance resulting from the HCSC transaction recorded in 2023. See Note 20 to the Consolidated Financial Statements for further discussion of these matters. \nKey Transactions and Business Developments\nSale of Medicare Advantage and Related Businesses\nIn January 2024, the Company entered into a definitive agreement to sell the Medicare Advantage, Medicare Individual Stand-Alone Prescription Drug Plans, Medicare and Other Supplemental Benefits, and CareAllies businesses within the U.S. Healthcare operating segment to Health Care Service Corporation (\"HCSC\") (\"HCSC transaction\"). The initial $3.3 billion purchase price is anticipated to increase at closing, reflecting higher statutory surplus for the legal entities that will convey to HCSC. The transaction is expected to close in the first quarter of 2025. See Note 5 to the Consolidated Financial Statements for further information. \nLIQUIDITY AND CAPITAL RESOURCES\nLiquidity\nWe maintain liquidity at two levels: the subsidiary level and the parent company level.\nSubsidiary Level. \nCash requirements at the subsidiary level generally consist of pharmacy, medical costs and other benefit payments; expense requirements, primarily for employee compensation and benefits, information technology and facilities costs; income taxes; and debt service. \nOur subsidiaries normally meet their liquidity requirements by maintaining appropriate levels of cash, cash equivalents and short-term investments; using cash flows from operating activities; matching durations of investments to estimated durations for the related insurance and contractholder liabilities; selling investments; and borrowing from affiliates, subject to applicable regulatory limits.\nParent Level. \nCash requirements at the parent company level generally consist of debt service; payment of declared dividends to shareholders; lending to subsidiaries as needed; and pension plan funding.\nThe parent company normally meets its liquidity requirements by maintaining appropriate levels of cash and various types of marketable investments; collecting dividends from its subsidiaries; using proceeds from issuing debt and common stock; and borrowing from its subsidiaries, subject to applicable regulatory limits.\n42\nRegulatory Restrictions. \nDividends from our insurance, Health Maintenance Organization (\"HMO\") and certain foreign subsidiaries are subject to regulatory restrictions. See Note 19 to the Consolidated Financial Statements in this Form 10-K for additional information regarding these restrictions. Most of the Evernorth Health Services segment operations are not subject to regulatory restrictions regarding dividends and therefore provide significant financial flexibility to The Cigna Group.\nInvestment Portfolio. \nWe support the liquidity needs of our businesses by managing the duration of invested assets to be consistent with the duration of liabilities. We manage the portfolio to both optimize returns in the current economic environment and meet our liquidity needs.\nCash flows for the years ended December 31 were as follows:\nFor the Years Ended December 31,\n(In millions)\n2024\n2023\n2022\nOperating activities\n$\n10,363\n \n$\n11,813 \n$\n8,656 \nInvesting activities\n$\n(2,102)\n$\n(5,174)\n$\n3,098 \nFinancing activities\n$\n(7,647)\n$\n(4,294)\n$\n(11,240)\nThe following discussion explains variances in the various categories of cash flows for the year ended December 31, 2024 compared with the same period in 2023. \nOperating Activities. \nCash flows from operating activities consist principally of cash receipts and disbursements for pharmacy revenues and costs, premiums, fees, investment income, taxes, benefit costs and other expenses.\nOperating cash flows decreased for the year ended December 31, 2024 due to higher insurance claims and related payments as well as higher accounts receivable as a result of organic business growth and timing. These decreases were partially offset by the favorable net cash flow impacts of new clients in Evernorth Health Services, higher pharmacy and service costs payable, and lower income tax payments.\nInvesting Activities. \nThe decrease in cash used in investing activities during the year ended December 31, 2024 was primarily due to lower purchases of equity securities.\nFinancing Activities. \nThe Company had higher share repurchases, including the completed ASR Agreements (described below), partially offset by net cash provided by debt financing activities in 2024.\nCapital Resources\nOur capital resources consist primarily of cash, cash equivalents and investments maintained at regulated subsidiaries required to underwrite insurance risks, cash flows from operating activities, our commercial paper program, credit agreements and the issuance of long-term debt and equity securities. Our businesses generate significant cash flows from operations, some of which is subject to regulatory restrictions relative to the amount and timing of dividend payments to the parent company. Dividends received from U.S.- regulated subsidiaries were $2.4 billion for the year ended December 31, 2024 and $1.2 billion for the year ended December 31, 2023. Non-regulated subsidiaries also generate significant cash flows from operating activities, which is typically available immediately to the parent company for general corporate purposes. \nWe prioritize our use of capital resources to (i) invest in capital expenditures (primarily related to technology to support innovative solutions for our clients and customers), provide the capital necessary to maintain or improve the financial strength ratings of subsidiaries, and to repay debt and fund pension obligations if necessary; (ii) pay dividends to shareholders; (iii) consider acquisitions and investments that are strategically and economically advantageous; and (iv) return capital to shareholders through share repurchases.\nFunds Available\nCommercial Paper Program\n.\n The commercial paper program had approximately $0.9 billion outstanding at December 31, 2024. \nRevolving Credit Agreements. \nOur revolving credit agreements provide us with the ability to borrow amounts for general corporate purposes, including for the purpose of providing liquidity support if necessary under our commercial paper program discussed above. See Note 7 to the Consolidated Financial Statements for further information on our credit agreements and commercial paper program. \nAs of December 31, 2024, we had $6.5 billion of undrawn committed capacity under our revolving credit agreements (these amounts are available for general corporate purposes, including providing liquidity support for our commercial paper program), $5.6 billion of \n43\nremaining capacity under our commercial paper program and $7.6 billion in cash and short-term investments, approximately $0.8 billion of which was held by the parent company or certain nonregulated subsidiaries.\nOur debt-to-capitalization ratio (calculated as Short-term debt and Long-term debt (\"Total debt\") as a percentage of Total shareholders' equity and Total debt (\"Total capitalization\")) was 43.8% and 40.1% at December 31, 2024 and 2023, respectively. We actively monitor our debt obligations and engage in issuance or redemption activities as needed in accordance with our capital management strategy.\nSubsidiary Borrowings. \nIn addition to the sources of liquidity discussed above, the parent company can borrow an additional $1.8 billion from its subsidiaries without further approvals as of December 31, 2024.\nUse of Capital Resources\nCapital Expenditures\n.\n Capital expenditures for property, equipment and computer software were $1.4 billion in 2024 compared to $1.6 billion in the year ended December 31, 2023. We expect to deploy approximately $1.4 billion in capital expenditures in 2025, which will be funded primarily from operating cash flows.\nDividends\n.\n The Company currently intends to pay regular quarterly dividends, with future declarations subject to approval by its Board of Directors and the Board's determination that the declaration of dividends remains in the best interests of The Cigna Group and its shareholders. See Note 8 to the Consolidated Financial Statements for further information regarding the dividend payments declared and paid during 2024, as well as the first quarter 2025 declared cash dividend. \nShare Repurchases\n.\n The Company maintains a share repurchase program authorized by the Board of Directors, under which it may repurchase shares of its common stock from time to time. The timing and actual number of shares repurchased will depend on a variety of factors, including price, general business and market conditions, and alternate uses of capital. The share repurchase program may be effected through open market purchases in compliance with Rule 10b-18 under the Securities Exchange Act of 1934, as amended (the \"Exchange Act\"), including through Rule 10b5-1 trading plans or privately negotiated transactions. The program may be suspended or discontinued at any time. \nIncluding the Accelerated Share Repurchase agreements (discussed further in Note 8 to the Consolidated Financial Statements) (the \"ASR Agreements\"), we repurchased 20.9 million shares for approximately $7.0 billion during the year ended December 31, 2024, compared to 7.8 million shares for approximately $2.3 billion during the year ended December 31, 2023. In December 2024, the Board of Directors approved an increase of $6.0 billion in incremental share repurchase authorization, bringing the company's total share repurchase authority to $10.3 billion as of December 31, 2024. From January 1, 2025 through February 26, 2025, we repurchased 3.0 million shares for approximately $901 million. Share repurchase authority was $9.4 billion as of February 26, 2025.\nOther Sources of Funds and Uses of Capital Resources\nDivestiture. \nAs discussed in the \"Key Transactions and Business Developments\" section above, the HCSC transaction is expected to close in the first quarter of 2025. We anticipate use of the proceeds in alignment with our capital deployment priorities, with the majority allocated to share repurchases.\nRisks to Liquidity and Capital Resources\nRisks to our liquidity and capital resources outlook include cash projections that may not be realized, and the demand for funds could exceed available cash if our ongoing businesses experience unexpected shortfalls in earnings or we experience material adverse effects from one or more risks or uncertainties described more fully in the \"Risk Factors\" section of this Form 10-K. \nGuarantees and Contractual Obligations\n \nWe are contingently liable for various contractual obligations and financial and other guarantees entered into in the ordinary course of business. See Note 21 to the Consolidated Financial Statements for discussion of various guarantees. \nOn Balance Sheet\n:\nLong-Term Debt. \nTotal scheduled payments on long-term debt are $48.5 billion (of which $3.5 billion relate to the fiscal year ending December 31, 2025), which include scheduled interest payments and maturities of long-term debt. See Note 7 to the Consolidated Financial Statements for information regarding principal maturities of long-term debt.\n44\nOther Non-Current Liabilities. \nThese include other long-term liabilities reflected in our Consolidated Balance Sheets as of December 31, 2024, including obligations associated with other postretirement and postemployment benefit obligations, reinsurance liabilities, supplemental and deferred compensation plans, and interest rate and foreign currency swap contracts. \nUncertain Tax Positions. \nIn the event we are unable to sustain all of our $1.5 billion of uncertain tax positions, it could result in future tax payments of approximately $1.0 billion. We are adequately reserved for such positions. As a result, there is minimal direct risk to earnings should we fail to sustain our positions. We cannot reasonably estimate the timing of such future payments. See Note 20 to the Consolidated Financial Statements for additional information on uncertain tax positions.\nOff-Balance Sheet\n: \nPurchase Obligations. \nThese include agreements to purchase goods or services that are enforceable and legally binding. Purchase obligations exclude contracts that are cancellable without penalty and those that do not contractually require minimum levels of goods or services to be purchased. As of December 31, 2024, purchase obligations consisted of a total of $4.2 billion of estimated payments required under contractual arrangements (of which we expect $1.6 billion of purchase obligations to be paid within the next 12 months beginning January 1, 2025). This includes the following:\n•\n$2.7 billion of investment commitments (of which we expect $0.9 billion of the committed amounts to be disbursed in 2025). See Note 11 of the Consolidated Financial Statements for additional information on investment commitments.\n•\n$1.5 billion of future service commitments (of which we expect $0.7 billion of the committed amounts to be disbursed in 2025), primarily comprised of contracts for certain outsourced business processes and information technology maintenance and support.\nCRITICAL ACCOUNTING ESTIMATES\nThe preparation of Consolidated Financial Statements in accordance with GAAP requires management to make estimates and assumptions that affect reported amounts and related disclosures in the Consolidated Financial Statements. Management considers an accounting estimate to be critical if:\n•\nit requires assumptions to be made that were uncertain at the time the estimate was made; and\n•\nchanges in the estimate or different estimates that could have been selected could have a material effect on our consolidated results of operations or financial condition.\nManagement has discussed how critical accounting estimates are developed and selected with the Audit Committee of our Board of Directors, and the Audit Committee has reviewed the disclosures presented in this Form 10-K. We regularly evaluate items that may impact critical accounting estimates.\nIn addition to the estimates described below, the Notes to the Consolidated Financial Statements describe other estimates that management has made in preparation of the financial statements. Management believes the current assumptions used to estimate amounts reflected in our Consolidated Financial Statements are appropriate. However, if actual experience significantly differs from the assumptions used in estimating amounts reflected in our Consolidated Financial Statements, the resulting changes could have a material adverse effect on our consolidated results of operations and, in certain situations, could have a material adverse effect on liquidity and our financial condition. The information below presents the adverse impacts of certain possible changes in assumptions. The effect of assumption changes in the opposite direction would be a positive impact to our consolidated results of operations, liquidity or financial condition, except for assessing impairment of goodwill.\nGoodwill and Other Intangible Assets\nNature of Critical Accounting Estimate. \nGoodwill represents the excess of the cost of businesses acquired over the fair value of their net assets at the acquisition date. Intangible assets primarily reflect the value of customer relationships and other intangibles acquired in business combinations.\nFair values of reporting units are estimated based on discounted cash flow analysis and market approach models using assumptions that we believe a hypothetical market participant would use to determine a current transaction price. The significant assumptions and estimates used in determining fair value primarily include the discount rate and future cash flows. A discount rate is selected to correspond with each reporting unit's weighted average cost of capital, consistent with that used for investment decisions considering the specific and detailed operating plans and strategies within each reporting unit. Projections of future cash flows differ by reporting unit and are consistent with our ongoing strategic projections. Future cash flows for the Evernorth Health Services reporting units are primarily driven by the forecasted gross margins of the business, as well as operating expenses and long-term growth rates. Future cash flows for our other reporting units are primarily driven by forecasted revenues, benefit expenses, operating expenses and long-\n45\nterm growth rates.\nThe fair value of intangibles and the amortization method were determined using an income approach that relies on projected future cash flows, including key assumptions for customer attrition and discount rates. Management revises amortization periods if it believes there has been a change in the length of time that an intangible asset will continue to have value.\nThe Company conducts its quantitative evaluation for goodwill impairment at least annually during the third quarter at the reporting unit level and performs qualitative impairment assessments on a quarterly basis to determine if events or changes in circumstances indicate that it is more likely than not that the carrying value of a reporting unit exceeds its estimated fair value. \nExcluding amounts classified as held for sale, Goodwill and other intangibles as of December 31, 2024 were $44,370 million and\n \n$29,417 million, respectively, and as of December 31, 2023, were $44,259 million and $30,863 million, respectively. See Note 18 to the Consolidated Financial Statements for additional discussion of our goodwill and other intangible assets.\n \nEffect if Different Assumptions Used. \nWe completed our normal annual evaluations for impairment of goodwill and intangible assets during the third quarter of 2024. The evaluations support that as of December 31, 2024, the fair value estimates of our reporting units exceed their carrying values by substantial margins. Changes in assumptions concerning future financial results or other underlying assumptions, including macroeconomic factors, government legislation, changes in the competitive landscape or other market conditions, could impact our ability to achieve profitability projections. If we consistently do not achieve our earnings and cash flow projections or our cost of capital rises significantly, the assumptions and estimates underlying the goodwill and intangible asset impairment evaluations could be adversely affected and result in future impairment charges that would negatively impact our operating results and financial position. \nIncome Taxes - Uncertain Tax Positions\nNature of Critical Accounting Estimate. \nWe evaluate tax positions to determine whether the benefits are more likely than not to be sustained on audit based on their technical merits. The Company establishes a liability if the probability that the position will be sustained is 50% or less. For uncertain positions that management believes are more likely than not to be sustained, the Company recognizes a liability based upon management's estimate of the most likely settlement outcome with the taxing authority. These amounts primarily relate to federal and state uncertain positions of the value and timing of deductions and uncertain positions of attributing taxable income to states.\nBalances that are included in the Consolidated Balance Sheets within Accrued expenses and other liabilities were $1,477 million and $1,399 million as of December 31, 2024 and\n \nDecember 31, 2023, respectively. See Note 20 to the Consolidated Financial Statements for additional discussion around uncertain tax positions and the Liquidity and Capital Resources section of this MD&A for a discussion of their potential impact on liquidity. \nEffect if Different Assumptions Used. \nThe factors that could impact our estimates of uncertain tax positions include the likelihood of sustaining our tax position (and related assumed interest and penalties) under audit. If our positions are upheld upon audit, our net income would increase.\nIncome Taxes - Valuation Allowance\nNature of Critical Accounting Estimate. \nDeferred income taxes in the Consolidated Balance Sheets reflect differences between the financial and income tax reporting bases of the Company's underlying assets and liabilities, and are established based upon enacted tax rates and laws. Deferred income tax assets are recognized when available evidence indicates that realization is more likely than not and a valuation allowance is established to the extent this standard is not met. It is possible that the realization of deferred tax assets may be impacted by changes in forecasted future earnings in various foreign jurisdictions or the Company's ability to generate future capital gains.\nValuation allowances that are included in the Consolidated Balance Sheets within Deferred tax liabilities, net were $2,332 million and $1,498 million as of December 31, 2024 and\n \nDecember 31, 2023, respectively. See Note 20 to the Consolidated Financial Statements for additional discussion around valuation allowances.\nEffect if Different Assumptions Used. \nThe factors that could impact our estimates of valuation allowances include changes in forecasted future earnings in foreign jurisdictions, potential international tax reform as a result of Organization for Economic Cooperation and Development initiatives, and the Company's future ability to generate capital gains. Decreases in our valuation allowance would increase net income, while increases in our valuation allowance would decrease net income.\n46\nUnpaid Claims and Claims Expenses - Cigna Healthcare\nNature of Critical Accounting Estimate. \nUnpaid claims and claim expenses reflect estimates of the ultimate cost of claims that have been incurred but not reported, expected development on reported claims, claims that have been reported but not yet paid (reported claims in process) and other medical care expenses and services payable that are primarily comprised of accruals for incentives and other amounts payable to health care professionals and facilities. \nUnpaid claims and claim expenses in Cigna Healthcare are primarily impacted by assumptions related to completion factors and medical cost trend. Variation of actual results from either assumption could impact the unpaid claims balance as noted below. A large number of factors may cause the medical cost trend to vary from the Company's estimates, including changes in health management practices, changes in the level and mix of benefits offered and services utilized, and changes in medical practices. Completion factors may be affected if actual claims submission rates from providers differ from estimates (that can be influenced by a number of factors, including provider mix and electronic versus manual submissions), or if changes to the Company's internal claims processing patterns occur. \nUnpaid claims and claim expenses for the Cigna Healthcare segment, both gross and net of reinsurance and other recoverables, as of December 31, 2024 were $5,018 million gross and $4,859 million net and as of December 31, 2023 were $5,092 million gross and $4,856 million net. See Note 9 to the Consolidated Financial Statements for additional information regarding assumptions and methods used to estimate this liability.\nEffect if Different Assumptions Used. \nBased on studies of our claim experience, it is reasonably possible that a 100 basis point change in the medical cost trend and a 50 basis point change in completion factors could occur in the near term. A 100 basis point increase in the medical cost trend rate would increase this liability by approximately $110 million, resulting in a decrease in net income of approximately $85 million after-tax, and a 50 basis point decrease in completion factors would increase this liability by approximately $185 million, resulting in a decrease in net income of approximately $145 million after-tax.\nValuation of Debt Security Investments\nNature of Critical Accounting Estimate. \nMost debt securities are classified as available for sale and are carried at fair value with changes in fair value recorded in Accumulated other comprehensive loss within Shareholders' equity. Fair value is defined as the price at which an asset could be exchanged in an orderly transaction between market participants at the balance sheet date.\nDetermining fair value for a financial instrument requires management judgment. The degree of judgment involved generally correlates to the level of pricing readily observable in the markets. Financial instruments with quoted prices in active markets or with market-observable inputs to determine fair value, such as public securities, generally require less judgment. Conversely, private placements including more complex securities that are traded infrequently are typically measured using pricing models that require more judgment as to the inputs and assumptions used to estimate fair value. There may be a number of alternative inputs to select based on an understanding of the issuer, the structure of the security and overall market conditions. In addition, these factors are inherently variable in nature as they change frequently in response to market conditions. Approximately 60% of our debt securities are public securities and approximately 40% are private placement securities.\nTypically, the most significant input in the measurement of fair value is the market interest rate used to discount the estimated future cash flows of the instrument. Such market rates are derived by calculating the appropriate spreads over comparable U.S. Treasury securities, based on the credit quality, industry and structure of the asset.\nBalances that are included in the Consolidated Balance Sheets within Investments and Long-term investments, inclusive of amounts held for sale, were $9,423\n \nmillion and $9,855 million as of December 31, 2024 and December 31, 2023, respectively. See Notes 11A and 12 to the Consolidated Financial Statements for a discussion of our fair value measurements, the procedures performed by management to determine that the amounts represent appropriate estimates and our accounting policy regarding unrealized appreciation on debt securities.\nEffect if Different Assumptions Used. \nIf the derived market rates used to calculate fair value increased by 100 basis points, the fair value of the total debt security portfolio of $9.4 billion would decrease by approximately $0.5 billion, resulting in an after-tax decrease to shareholders' equity of approximately $0.4 billion as of December 31, 2024.\n47\nSEGMENT REPORTING\nThe following section of this MD&A discusses the results of each of our segments. See Note 1 to the Consolidated Financial Statements for further description of our segments.\nIn segment discussions, we present \"adjusted revenues\" and \"pre-tax adjusted income (loss) from operations,\" defined as income (loss) before income taxes excluding pre-tax income (loss) attributable to noncontrolling interests, net investment gains/losses, amortization of acquired intangible assets and special items. The Company uses \"pre-tax adjusted income (loss) from operations\" and \"adjusted revenues\" as its principal financial measures of segment operating performance because management believes these metrics reflect the underlying results of business operations and facilitate analysis of trends in underlying revenue, expenses and profitability. The Cigna Group share of certain investment results of its joint ventures reported in the Cigna Healthcare segment using the equity method of accounting are also excluded. Special items are matters that management, including the chief operating decision maker, believes are not representative of the underlying results of operations due to their nature or size. Ratios presented in this segment discussion exclude the same items as adjusted revenues and pre-tax adjusted income (loss) from operations. See Note 22 to the Consolidated Financial Statements for additional discussion of these metrics and a reconciliation of income (loss) before income taxes to pre-tax adjusted income (loss) from operations, as well as a reconciliation of Total revenues to adjusted revenues. Note 22 to the Consolidated Financial Statements also explains that segment revenues include both external revenues and sales between segments that are eliminated in Corporate. \nIn these segment discussions, we also present \"pre-tax margin,\" calculated as pre-tax adjusted income (loss) from operations divided by adjusted revenues.\nSee the \"Executive Overview\" section of this MD&A for summarized financial results of each of our segments.\nEvernorth Health Services Segment\nEvernorth Health Services includes a broad range of coordinated and point solution health services and capabilities, as well as those from partners across the health care system, within our Pharmacy Benefit Services and Specialty and Care Services operating segments. As described in the introduction to Segment Reporting, Evernorth Health Services' performance is measured using adjusted revenues and pre-tax adjusted income (loss) from operations.\nKey Factors Affecting Segment Performance\nThe key factors that impact the performance of Evernorth Health Services Pharmacy Benefit Services and Specialty and Care Services revenues and income from operations are volume, mix of claims, price and contract affordability services. Specialty and Care Services revenues are also impacted by specialty distribution customer growth and client growth. These key factors are discussed further below. Certain of the key factors impact both operating segments as services are offered through an integrated client contract. See Note 2 to the Consolidated Financial Statements included in this Form 10-K for additional information on revenue and cost recognition policies for this segment.\nKey factors that impact both Pharmacy Benefit Services and Specialty and Care Services:\n•\nPharmacy claim volume (also referred to as utilization) relates to processing prescription claims filled by retail pharmacies in our network and dispensing prescription claims from our home delivery and specialty pharmacies, along with other claims. Pharmacy claim volume (utilization) is impacted by new clients or organic customer growth through the expansion of existing clients.\n•\nThe mix of claims generally considers the type of drug and distribution method used for dispensing and fulfilling. In addition to the types of drugs, the mix of generic or biosimilar claims also impacts our results. Generally, a higher mix of generic and biosimilar drugs reduces revenues and increases income from operations, as generic and biosimilar drugs are typically priced lower than the branded drugs they replace, providing positive impacts or our clients, our customers and us. \n•\nPharmaceutical manufacturer inflation also impacts our pricing because most of our contracts provide that we bill clients and pay pharmacies based on a generally recognized price index for pharmaceuticals. Therefore, the rate of inflation for prescription drugs and our efforts to manage this inflation for our clients continue to be significant drivers of our revenues and cost of revenues in the current environment.\n•\nOur client contract pricing is impacted by our ongoing ability to negotiate favorable contracts for pharmacy network, pharmaceutical and wholesaler purchasing and manufacturer rebates on our clients' behalf (also referred to as affordability improvements). Through these affordability services, we seek to improve the effectiveness of our integrated and fee-for-service solutions, for the benefit of our new and existing clients, by continuously innovating, improving affordability and implementing drug purchasing contract initiatives. Our continued affordability improvements further reduce drug costs for the benefit of our consumers and clients, and we share in the value delivered, which generally results in a favorable impact on our income from operations.\n48\nKey factors that impact Specialty and Care Services:\n•\nCustomer growth generally results in increased revenues and income from operations. This generally includes both organic customer growth through the expansion of existing business and new business, as well as higher volume in our specialty distribution services where we deliver pharmaceuticals and medical supplies directly to health care providers, clinics and hospitals, primarily to physicians who regularly order costly specialty pharmaceuticals. This business provides competitive pricing on pharmaceuticals and medical supplies and leverages our distribution platform to improve our results.\n•\nClient growth, both organic and new business, in our Care Services business generally results in increased revenues and income from operations. This includes client movement in our virtual care, in-home care, physical primary care, benefits management and behavioral health services as we expand our businesses and build upon our cross-enterprise leverage.\nResults of Operations\nFinancial Summary\nFor the Years Ended December 31,\nChange\nChange\n(Dollars in millions)\n2024\n2023\n2022\n2024 vs. 2023\n2023 vs. 2022\nAdjusted revenues \n(1)\n$\n202,155\n \n$\n153,499 \n$\n140,335 \n$\n48,656 \n32 \n%\n$\n13,164 \n9 \n%\nPre-tax adjusted income from operations \n(1)\n$\n7,001\n \n$\n6,442 \n$\n6,127 \n$\n559 \n9 \n%\n$\n315 \n5 \n%\nPre-tax margin \n(1)(2)\n3.5\n \n%\n4.2 \n%\n4.4 \n%\n(70)\nbps\n(20)\n \nbps\nSG&A expense ratio \n(3)\n1.9\n \n%\n2.2 \n%\n2.0 \n%\n(30)\nbps\n20 \n \nbps\n(1)\nSee Note 22 to the Consolidated Financial Statements for reconciliation of adjusted revenues and pre-tax adjusted income from operations to Total revenues and Income before income taxes, respectively.\n(2)\nPre-tax margin is calculated as pre-tax adjusted income from operations divided by adjusted revenues. \n(3)\nSG&A expense ratio is calculated as segment selling, general and administrative expenses divided by adjusted revenues. See Note 22 to the Consolidated Financial Statements for further details.\nIn this selected financial information, we present adjusted revenues and pre-tax income from operations by our two operating segments, Pharmacy Benefit Services and Specialty and Care Services. \nSelected Financial Information\nFor the Years Ended December 31,\nChange\nChange\n(Dollars and adjusted scripts in millions)\n2024\n2023\n2022\n2024 vs. 2023\n2023 vs. 2022\nTotal adjusted revenues\nPharmacy Benefit Services\n$\n111,822\n \n$\n76,792 \n$\n75,801 \n46 \n%\n1 \n%\nSpecialty and Care Services\n90,333\n \n76,707 \n64,534 \n18 \n19 \nTotal adjusted revenues\n$\n202,155\n \n$\n153,499 \n$\n140,335 \n32 \n%\n9 \n%\nPre-tax adjusted income from operations\nPharmacy Benefit Services\n$\n3,577\n \n$\n3,469 \n$\n3,616 \n3 \n%\n(4)\n%\nSpecialty and Care Services\n3,424\n \n2,973 \n2,511 \n15 \n18 \nTotal pre-tax adjusted income from operations\n$\n7,001\n \n$\n6,442 \n$\n6,127 \n9 \n%\n5 \n%\nPharmacy claim volume \n(1)\n2,120\n \n1,585 \n1,575 \n34 \n%\n1 \n%\n(1)\nNon-specialty network prescriptions filled through 90-day programs and home delivery prescriptions are counted as three claims. All other network and specialty prescriptions are counted as one claim.\n2024 versus 2023\nCommentary in parentheses regarding percentage changes represents the driver's impact on the overall category.\nAdjusted revenues\n increased 32%, primarily reflecting higher utilization of prescription drugs from customer growth in both Pharmacy Benefit Services (+24%) and Specialty and Care Services (+7%).\nPre-tax adjusted income from operations\n increased 9%, primarily reflecting customer growth in Specialty and Care Services (+10%) and continued affordability improvements in Pharmacy Benefit Services (+5%). These increases were partially offset by strategic investments to support business growth and continued advancement of our capabilities and solutions (-3% in Specialty and Care Services and -2% in Pharmacy Benefit Services).\nThe\n \nSG&A expense ratio\n \ndecreased 30 bps, primarily reflecting higher adjusted revenues as discussed above.\n49\nCigna Healthcare Segment\nCigna Healthcare includes the U.S. Healthcare and International Health businesses, which provide comprehensive medical and coordinated solutions to clients and customers. As described in the introduction to Segment Reporting, performance of the Cigna Healthcare segment is measured using adjusted revenues and pre-tax adjusted income from operations.\nIn January 2024, the Company entered into a definitive agreement to sell the Medicare Advantage, Medicare Individual Stand-Alone Prescription Drug Plans, Medicare and Other Supplemental Benefits, and CareAllies businesses within the U.S. Healthcare operating segment. See \"Key Transactions and Business Developments\" for further discussion. \nKey Factors Affecting Segment Performance \nThe key factors that impact Cigna Healthcare revenues and income from operations include revenue growth, customer growth, medical cost trend, percentage of Medicare Advantage customers in plans eligible for quality bonus payments, the medical care ratio (\"MCR\") and the SG&A expense ratio. These key factors are discussed further below. See Note 2 to the Consolidated Financial Statements included in this Form 10-K for additional information on revenue and cost-recognition policies for this segment.\n•\nRevenue growth includes increases to premium rates in consideration of anticipated medical cost increases, customer growth driven by new clients and customers, and increased fee revenue from the expansion of products and services to existing clients and customers, including solutions provided by Evernorth Health Services.\n•\nHigher medical costs (also referred to as higher medical cost trend) is impacted by utilization (the quantity of medical services consumed by our customers), unit costs (the cost per medical service) and mix of services. \n•\nPrior to the divestiture of our Medicare Advantage and related businesses to HCSC, the percentage of Medicare Advantage customers in bonus-eligible plans impacts the amount of quality bonus payments we receive. \n•\nMCR represents medical costs as a percentage of premiums for our segment's insured businesses, and it is impacted by medical cost trend and premium rates. Affordability initiatives that serve to mitigate medical cost inflation also impact the MCR. \n•\nThe SG&A expense ratio represents the segment's selling, general and administrative expenses divided by adjusted revenues.\nResults of Operations\nFinancial Summary\nFor the Years Ended December 31,\nChange\nChange\n(Dollars in millions)\n2024\n2023\n2022\n2024 vs. 2023\n2023 vs. 2022\nAdjusted revenues \n(1)\n$\n52,914\n \n$\n51,205 \n$\n45,037 \n$\n1,709 \n3 \n%\n$\n6,168 \n14 \n%\nPre-tax adjusted income from operations \n(1)\n$\n4,229\n \n$\n4,478 \n$\n4,099 \n$\n(249)\n(6)\n%\n$\n379 \n9 \n%\nPre-tax margin\n (1)(2)\n8.0\n \n%\n8.7 \n%\n9.1 \n%\n(70)\nbps\n(40)\nbps\nMedical care ratio\n83.2\n \n%\n81.3 \n%\n81.7 \n%\n190 \nbps\n(40)\nbps\nSG&A expense ratio \n(3)\n20.4\n \n%\n21.6 \n%\n21.8 \n%\n(120)\nbps\n(20)\nbps\n(1)\nSee Note 22 to the Consolidated Financial Statements for reconciliation of adjusted revenues and pre-tax adjusted income from operations to Total revenues and Income before income taxes, respectively. \n(2)\nPre-tax margin is calculated as pre-tax adjusted income from operations divided by adjusted revenues.\n(3)\nSG&A expense ratio is calculated as segment selling, general and administrative expenses divided by adjusted revenues. See Note 22 to the Consolidated Financial Statements for further details.\n50\n2024 versus 2023\nCommentary regarding percentage changes (or bps) and dollar variances represents the driver's impact on the overall category.\nAdjusted revenues \nincreased 3%, or $1,709 million, primarily due to higher premiums within employer insured (+$1,086 million), stop loss (+$601 million) and Medicare Part D (+$595 million), reflecting premium rate increases across those businesses, partially offset by lower premiums within IFP (-$1,137 million), reflecting a decrease in customers.\nPre-tax adjusted income from operations \ndecreased 6%, or $249 million, primarily due to higher medical costs (-$2,209 million), partially offset by higher adjusted revenues (+$1,709 million) and lower SG&A expenses (+$250 million), primarily reflecting ongoing efficiencies. The impact of higher premiums in adjusted revenues and medical costs are reflected in the medical care ratio calculation.\nThe \nmedical care ratio\n increased 190 bps for the year ended and 570 bps for the three months ended December 31, 2024. The increases for both periods were primarily due to higher stop loss medical costs.\nThe \nSG&A expense ratio\n decreased 120 bps, primarily due to revenue growth outpacing volume-related expenses (-60 bps), as well as ongoing efficiencies (-30 bps).\nMedical Customers\nA medical customer is defined as a person meeting any one of the following criteria:\n•\nis covered under a medical insurance policy, managed care arrangement or administrative services agreement issued by us;\n•\nhas access to our provider network for covered services under their medical plan; or\n•\nhas medical claims that are administered by us.\nCigna Healthcare Medical Customers\nAs of December 31,\nChange\nChange\n(In thousands)\n2024\n2023\n2022\n2024 vs. 2023\n2023 vs. 2022\nU.S. Healthcare\n3,853\n \n4,280 \n3,587 \n(427)\n(10)\n693 \n19 \nInternational Health \n(1)\n1,211\n \n1,184 \n1,169 \n27 \n2 \n15 \n1 \nInsured\n5,064\n \n5,464 \n4,756 \n(400)\n(7)\n%\n708 \n15 \n%\nU.S. Healthcare\n13,649\n \n13,890 \n12,619 \n(241)\n(2)\n1,271 \n10 \nInternational Health \n(1)\n434\n \n426 \n629 \n8 \n2 \n(203)\n(32)\nAdministrative services only\n14,083\n \n14,316 \n13,248 \n(233)\n(2)\n1,068 \n8 \nTotal\n19,147\n \n19,780 \n18,004 \n(633)\n(3)\n%\n1,776 \n10 \n%\n(1)\nInternational Health excludes medical customers served by less than 100%-owned subsidiaries, as well as certain customers served by our third-party administrator.\nTotal medical customers decreased 3%, primarily due to a decline in IFP customers. See Part I, Item 1 of this Form 10-K for definitions of Cigna Healthcare market segments. \nUnpaid Claims and Claim Expenses\nAs of December 31,\nChange\nChange\n(In millions)\n2024\n2023\n2022\n2024 vs. 2023\n2023 vs. 2022\nUnpaid claims and claim expenses\n$\n5,018\n \n$\n5,092 \n$\n4,176 \n$\n(74)\n(1)\n%\n$\n916 \n22 \n%\nOur unpaid claims and claim expenses liability decreased 1%, driven by a decrease in IFP customers (-$300 million), partially offset by an increase related to the Medicare businesses (+$175 million).\n51\nOther Operations\nOther Operations includes corporate-owned life insurance (\"COLI\"), the Company's run-off operations and other non-strategic businesses. As described in the introduction of Segment Reporting, performance of Other Operations is measured using adjusted revenues and pre-tax adjusted income from operations. \nResults of Operations\nFinancial Summary\nFor the Years Ended December 31,\nChange\nChange\n(Dollars in millions)\n2024\n2023\n2022\n2024 vs. 2023\n2023 vs. 2022\nAdjusted revenues\n$\n828\n \n$\n596 \n$\n2,263 \n$\n232 \n39 \n%\n$\n(1,667)\n(74)\n%\nPre-tax adjusted (loss) income from operations\n$\n(9)\n$\n96 \n$\n509 \n$\n(105)\nN/M\n%\n$\n(413)\n(81)\n%\nPre-tax margin\n(1.1)\n%\n16.1 \n%\n22.5 \n%\n(1,720)\nbps\n(640)\nbps\n2024 versus 2023\nAdjusted revenues \nprimarily reflect premiums and net investment income associated with COLI and our run-off operations and revenues from other non-strategic businesses.\nPre-tax adjusted (loss) income from operations \ndecreased primarily driven by unfavorable margins in our non-strategic businesses.\nCorporate\nCorporate reflects amounts not allocated to operating segments, including net interest expense (defined as interest on corporate financing less net investment income on investments not supporting segment and other operations), certain litigation matters, expense associated with our frozen pension plans, charitable contributions, operating severance, certain overhead and enterprise-wide project costs, and eliminations for products and services sold between segments.\nFinancial Summary\nFor the Years Ended December 31,\nChange\nChange\n(In millions)\n2024\n2023\n2022\n2024 vs. 2023\n2023 vs. 2022\nPre-tax adjusted loss from operations\n$\n(1,688)\n$\n(1,698)\n$\n(1,466)\n$\n10 \n(1)\n%\n$\n(232)\n16 \n%\n2024 versus 2023\nCommentary regarding percentage changes represents the driver's impact on the overall category. \nPre-tax adjusted loss from operations\n decreased 1%, primarily due to lower pension and operating costs (-7%), partially offset by higher interest rates on our indebtedness (+6%).\nINVESTMENT ASSETS\nInformation regarding our investment assets is included in Notes 11, 12, 13 and 15 to the Consolidated Financial Statements. \nInvestment Outlook\nFuture realized and unrealized investment results will be driven largely by market conditions, and these future conditions are not reasonably predictable. We believe that the vast majority of our investments will continue to perform under their contractual terms. We manage the portfolio for long-term economics and therefore we expect to hold a significant portion of these assets for the long term. Although future declines in investment fair values remain possible due to interest rate movements and credit deterioration due to both investment-specific uncertainties and global economic uncertainties as discussed below, we do not expect these losses to have a material unfavorable effect on our financial condition or liquidity. The below discussion addresses the strategies and risks associated with our various classes of investment assets. See Item 1A \"Risk Factors\" for additional information regarding risks associated with our investment portfolio.\n52\nDebt Securities\nThe carrying value of our debt securities portfolio decreased from $9.9 billion as of December 31, 2023 to $9.4 billion as of December 31, 2024, primarily \nreflecting net sales activity\n. Our portfolio remains in a net unrealized depreciation position due to generally increasing interest rates over the past few years. \nAs of December 31, 2024, $8.1 billion, or 86%, of the debt securities in our investment portfolio were investment grade (Baa and above, or equivalent) and the remaining $1.3 billion were below investment grade. The majority of the bonds that are below investment grade were rated at the higher end of the non-investment grade spectrum. These quality characteristics have not materially changed since the prior year and remain consistent with our investment strategy. \nInvestments in debt securities are diversified by issuer, geography and industry. On an aggregate basis, the debt securities portfolio continues to perform according to original expectations, which includes a long-term economic investment strategy. Primary risks facing many of the issuers in our portfolio include ongoing geopolitical events and economic conditions, including expectations for a longer period of higher inflation and interest rates. To date, most issuers have been successful in managing these issues without a meaningful change in credit quality. We continue to monitor the economic environment and its effect on our portfolio; we also continue to consider the impact of various factors in determining the allowance for credit losses on debt securities, which is discussed in Note 11 to the Consolidated Financial Statements.\nCommercial Mortgage Loans\nAs of December 31, 2024, our $1.4 billion commercial mortgage loan portfolio consisted of approximately 45 fixed-rate loans, diversified by property type, location and borrower. These loans are carried in our Consolidated Balance Sheets at their unpaid principal balance, net of an allowance for expected credit losses. As a result of increasing market interest rates since the majority of these loans were made, the carrying value exceeds the market value of these loans as of December 31, 2024. Given the quality and diversity of the underlying real estate, positive debt service coverage and significant borrower cash invested in the property generally ranging between 30 and 40%, we remain confident that the vast majority of borrowers will continue to perform as expected under their contract terms. For further discussion of the results and changes in key credit quality indicators, see Note 11 to the Consolidated Financial Statements.\nOffice sector fundamentals have been and continue to be weak, and values are experiencing stress due to multiple headwinds: expanded work-from-home flexibility, shorter term leases, elevated tenant improvement allowances and corporate migration to lower cost states. Additionally, the current macroeconomic headwinds are impacting capital markets and reducing investor appetite for capital-intensive assets (e.g., offices and regional shopping malls). Our commercial mortgage loan portfolio has no exposure to regional shopping malls and approximately 25% exposure to office properties. Although future losses remain possible due to further credit deterioration, we do not expect these losses to have a material unfavorable effect on our results of operations, financial condition or liquidity.\nOther Long-Term Investments\nOther long-term investments of $4.6 billion as of December 31, 2024 included investments in securities limited partnerships and real estate limited partnerships, direct investments in real estate joint ventures and other deposit activity that is required to support various insurance and health services businesses. These limited partnership entities typically invest in mezzanine debt or equity of privately held companies and equity real estate. Given our subordinate position in the capital structure of these underlying entities, we assume a higher level of risk for higher expected returns. To mitigate risk, these investments are diversified by industry sector or property type and geographic region. No single partnership investment exceeded 3% of our securities and real estate limited partnership portfolio.\nWe expect continued volatility in private equity and real estate fund performance going forward as fair market valuations are adjusted to reflect market and portfolio transactions. Less than 4% of our other long-term investments are exposed to real estate in the office sector.\nUnconsolidated Subsidiary Investments Portfolio\nWe participate in an insurance joint venture in China with a 50% ownership interest. We account for this joint venture under the equity method of accounting. Our 50% share of the investment portfolio supporting the joint venture's liabilities was approximately $15.6 billion as of December 31, 2024. These investments were comprised of approximately 75% debt securities, including government and corporate debt diversified by issuer, industry and geography; 15% equities, including mutual funds, equity securities and private equity partnerships; and 10% long-term deposits and policy loans. We continuously review the joint venture's investment strategy and its execution. There were no investments with a material unrealized loss as of December 31, 2024. See Note 14 to the Consolidated Financial Statements for additional information regarding unconsolidated subsidiaries.\n53\nMARKET RISK\nOur assets and liabilities include financial instruments subject to the risk of potential losses from adverse changes in market rates and prices. Our primary market risk exposure from financial instruments is our interest-rate risk exposure to fixed-rate, medium-term instruments. Changes in market interest rates affect the value of instruments that promise a fixed return. \nConsistent with disclosure requirements, the following items have been excluded from this consideration of market risk for financial instruments: changes in the fair values of insurance-related assets and liabilities as disclosed in Note 9 to the Consolidated Financial Statements (because their primary risks are insurance rather than market risk); changes in the fair values of investments recorded using the equity method of accounting and liabilities for pension and other postretirement and postemployment benefit plans (and related assets); and changes in the fair values of other significant assets and liabilities, such as goodwill, taxes and various accrued liabilities (because they are not financial instruments, their primary risks are other than market risks).\nOur Management of Market Risks\nWe predominantly rely on two techniques to manage our exposure to market risk:\n•\nInvestment/liability matching.\n We generally select investment assets with characteristics (such as duration, yield, currency and liquidity) that correspond to the underlying characteristics of our related insurance and contractholder liabilities so that we can match the investments to our obligations. Shorter-term investments generally support shorter-term life and health liabilities. Medium-term, fixed-rate investments support interest-sensitive and medium-term health liabilities. Longer-term investments generally support products with longer payout periods such as annuities.\n•\nUse of derivatives.\n We use derivative financial instruments to reduce our primary market risks. See Note 11 to the Consolidated Financial Statements for additional information about derivative financial instruments.\nEffect of Market Fluctuations\nWe determine the sensitivity of market risk for our fixed income financial instruments, including debt securities and commercial mortgage loans, by estimating the present value of future cash flows using duration modeling and applying a 100 basis point increase in interest rates. The effect of these hypothetical changes in market rates or prices on the fair value of certain noninsurance financial instruments would have been as follows:\nMarket scenario for certain noninsurance financial instruments\nLoss in Fair Value\n(in billions)\nDecember 31, 2024\nDecember 31, 2023\n100 basis point increase in interest rates (excluding the Company's long-term debt)\n$\n0.6\n \n$\n0.7 \nIn the event of a hypothetical 100 basis point increase in interest rates, the fair value of the Company's long-term debt would decrease approximately $1.8 billion at both December 31, 2024 and December 31, 2023. Changes in the fair value of our long-term debt do not impact our financial position or operating results since long-term debt is not required to be recorded at fair value. See Note 7 to the Consolidated Financial Statements for additional information about the Company's debt.",
  "item2": null
}