{
  "source_file": "ci-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2. \nMANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nManagement's Discussion and Analysis of Financial Condition and Results of Operations (\"MD&A\") is intended to provide information to assist you in better understanding and evaluating our financial condition as of September 30, 2025 compared with December 31, 2024 and our results of operations for the three and nine months ended September 30, 2025 compared with the same periods last year, and is intended to help you understand the ongoing trends in our business. We encourage you to read this MD&A in conjunction with our Consolidated Financial Statements included in Part I, Item 1 in this Form 10-Q and our Annual Report on Form 10-K for the year ended December 31, 2024 (\"2024 Form 10-K\"). In particular, we encourage you to refer to the \"Risk Factors\" contained in Part I, Item 1A of our 2024 Form 10-K.\nUnless otherwise indicated, financial information in this MD&A is presented in accordance with accounting principles generally accepted in the United States of America (\"GAAP\"). See Note 2 to the Consolidated Financial Statements in our 2024 Form 10-K for \n34\nadditional information regarding the Company's significant accounting policies and see Note 2 to the Consolidated Financial Statements in this Form 10-Q for updates to those policies resulting from adopting new accounting guidance, if any. The preparation of interim consolidated financial statements necessarily relies heavily on estimates. This and certain other factors call for caution in estimating full-year results based on interim results of operations. In some of our financial tables in this MD&A, we present either percentage changes or \"N/M\" when those changes are so large as to become not meaningful. Changes in percentages are expressed in basis points (\"bps\").\nIn this MD&A, our consolidated measures \"adjusted income from operations,\" earnings per share on that same basis and \"adjusted revenues\" are not determined in accordance with GAAP and should not be viewed as substitutes for the most directly comparable GAAP measures of \"shareholders' net income,\" \"earnings per share\" and \"total revenues.\" We also use pre-tax adjusted income (loss) from operations and adjusted revenues to measure the results of our segments.\nThe Company uses \"pre-tax adjusted income (loss) from operations\" and \"adjusted revenues\" as its principal financial measures of segment operating performance because management believes these metrics reflect the underlying results of business operations and facilitate analysis of trends in underlying revenue, expenses and profitability. We define adjusted income (loss) from operations as shareholders' net income (or income (loss) before income taxes less pre-tax income (loss) attributable to noncontrolling interests for the segment metric) excluding net investment gains/losses, amortization of acquired intangible assets and special items. The Cigna Group's share of certain investment results of its joint ventures reported in the Cigna Healthcare segment using the equity method of accounting are also excluded. Special items are matters that management believes are not representative of the underlying results of operations due to their nature or size. Adjusted income (loss) from operations is measured on an after-tax basis for consolidated results and on a pre-tax basis for segment results. Consolidated adjusted income (loss) from operations is not determined in accordance with GAAP and should not be viewed as a substitute for the most directly comparable GAAP measure, shareholders' net income. See the below Financial Highlights section for a reconciliation of consolidated adjusted income from operations to shareholders' net income. \nThe Company defines adjusted revenues as total revenues excluding the following adjustments: special items and The Cigna Group's share of certain investment results of its joint ventures reported in the Cigna Healthcare segment using the equity method of accounting. Special items are matters that management believes are not representative of the underlying results of operations due to their nature or size. We exclude these items from this measure because management believes they are not indicative of past or future underlying performance of the business. Adjusted revenues is not determined in accordance with GAAP and should not be viewed as a substitute for the most directly comparable GAAP measure, total revenues. See the below Financial Highlights section for a reconciliation of consolidated adjusted revenues to total revenues.\nCAUTIONARY NOTE REGARDING FORWARD-LOOKING STATEMENTS\nThis Quarterly Report on Form 10-Q contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. Forward-looking statements are based on The Cigna Group's current expectations and projections about future trends, events and uncertainties. These statements are not historical facts. Forward-looking statements may include, among others, statements concerning future financial or operating performance, including our ability to improve the health and vitality of those we serve; future growth, business strategy, and strategic or operational initiatives; economic, regulatory or competitive environments, particularly with respect to the pace and extent of change in these areas and the impact of developing inflationary and interest rate pressures; financing or capital deployment plans and amounts available for future deployment; our prospects for growth in the coming years; strategic transactions and their expected benefits; and other statements regarding The Cigna Group's future beliefs, expectations, plans, intentions, liquidity, cash flows, financial condition or performance. You may identify forward-looking statements by the use of words such as \"believe,\" \"expect,\" \"project,\" \"plan,\" \"intend,\" \"anticipate,\" \"estimate,\" \"predict,\" \"potential,\" \"may,\" \"should,\" \"will\" or other words or expressions of similar meaning, although not all forward-looking statements contain such terms.\nForward-looking statements are subject to risks and uncertainties, both known and unknown, that could cause actual results to differ materially from those expressed or implied in forward-looking statements. Such risks and uncertainties include, but are not limited to: our ability to achieve our strategic and operational initiatives; our ability to adapt to changes in an evolving and rapidly changing industry; our ability to compete effectively, differentiate our products and services from those of our competitors, and maintain or increase market share; price competition, inflation and other pressures that could compress our margins or result in premiums that are insufficient to cover the cost of services delivered to our customers; the potential for actual claims to exceed our estimates related to expected medical claims; our ability to develop and maintain satisfactory relationships with health care payors, physicians, hospitals, other health service providers and with producers and consultants; our ability to maintain relationships with one or more key pharmaceutical manufacturers or if payments made or discounts provided decline; changes in the pharmacy provider marketplace or pharmacy networks; changes in drug pricing or industry pricing benchmarks; our ability to invest in and properly maintain our information technology and other business systems; our ability to prevent or contain effects of a potential cyberattack or other privacy or data security incident; risks related to our use of artificial intelligence and machine learning; political, legal, operational, regulatory, economic and other risks that could affect our multinational operations, including currency exchange rates; risks related to strategic \n35\ntransactions and realization of the expected benefits of such transactions, as well as integration or separation difficulties or underperformance relative to expectations, which could lead to an impairment charge; dependence on success of relationships with third parties; risk of significant disruption within our operations or among key suppliers or third parties; potential liability in connection with managing medical practices and operating pharmacies, onsite clinics and other types of medical facilities; the substantial level of government regulation over our business and the potential effects of new laws or regulations or changes in existing laws, regulations or government guidance; uncertainties surrounding participation in government-sponsored programs and providing services to payors who participate in government-sponsored programs; the outcome of litigation, regulatory audits and investigations; compliance with applicable privacy, security and data laws, regulations and standards; potential failure of our prevention, detection and control systems; unfavorable economic and market conditions, the risk of a recession or other economic downturn and resulting impact on employment metrics, stock market or changes in interest rates; risks related to a downgrade in financial strength ratings of our insurance subsidiaries; the impact of our significant indebtedness and the potential for further indebtedness in the future; credit risk related to our reinsurers; as well as more specific risks and uncertainties discussed in Part I, Item 1A - \"Risk Factors\" in our 2024 Form 10-K, discussed in Part II, Item 7 - \"Management's Discussion and Analysis of Financial Condition and Results of Operations\" in our 2024 Form 10-K, and as described from time to time in our future reports filed with the Securities and Exchange Commission.\nYou should not place undue reliance on forward-looking statements, which speak only as of the date they are made, are not guarantees of future performance or results, and are subject to risks, uncertainties and assumptions that are difficult to predict or quantify. The Cigna Group undertakes no obligation to update or revise any forward-looking statement, whether as a result of new information, future events or otherwise, except as may be required by law.\nEXECUTIVE OVERVIEW\nThe Cigna Group, together with its subsidiaries (either individually or collectively referred to as the \"Company,\" \"we,\" \"us\" or \"our\"), is a global health company committed to creating a better future for every individual and every community. Our subsidiaries offer a differentiated set of pharmacy, medical, behavioral, dental, and related products and services. For further information on our business and strategy, see Part I, Item 1 - \"Business\" in our 2024 Form 10-K. \nFinancial Highlights\nConsolidated Results of Operations (GAAP basis)\nThree Months Ended September 30,\nNine Months Ended September 30,\n(Dollars in millions)\n2025\n2024\nChange\n2025\n2024\nChange\nPharmacy revenues\n$\n56,054\n \n$\n48,284 \n16 \n%\n$\n158,336\n \n$\n135,421 \n17 \n%\nPremiums\n9,081\n \n11,436 \n(21)\n30,973\n \n34,493 \n(10)\nFees and other revenues\n4,380\n \n3,889 \n13 \n12,412\n \n10,862 \n14 \nNet investment income\n233\n \n85 \n174 \n707\n \n696 \n2 \nTotal revenues\n69,748\n \n63,694 \n10 \n202,428\n \n181,472 \n12 \nPharmacy and other service costs\n55,530\n \n47,565 \n17 \n157,196\n \n133,488 \n18 \nMedical costs and other benefit expenses\n7,842\n \n9,527 \n(18)\n26,089\n \n28,482 \n(8)\nSelling, general and administrative expenses\n3,362\n \n3,590 \n(6)\n11,008\n \n10,979 \n— \nAmortization of acquired intangible assets\n436\n \n436 \n— \n1,280\n \n1,279 \n— \nTotal benefits and expenses\n67,170\n \n61,118 \n10 \n195,573\n \n174,228 \n12 \nIncome from operations\n2,578\n \n2,576 \n— \n6,855\n \n7,244 \n(5)\nInterest expense and other\n(347)\n(376)\n(8)\n(1,046)\n(1,073)\n(3)\nGain (loss) on sale of businesses\n38\n \n(87)\nN/M\n79\n \n(106)\nN/M\nNet investment gains (losses)\n26\n \n(921)\nN/M\n76\n \n(2,805)\nN/M\nIncome before income taxes\n2,295\n \n1,192 \n93 \n5,964\n \n3,260 \n83 \nTotal income taxes\n322\n \n367 \n(12)\n950\n \n1,018 \n(7)\nNet income\n1,973\n \n825 \n139 \n5,014\n \n2,242 \n124 \nLess: Net income attributable to noncontrolling interests\n105\n \n86 \n22 \n291\n \n232 \n25 \nShareholders' net income\n$\n1,868\n \n$\n739 \n153 \n%\n$\n4,723\n \n$\n2,010 \n135 \n%\nConsolidated effective tax rate\n14.0\n \n%\n30.8 \n%\n(1,680)\nbps\n15.9\n \n%\n31.2 \n%\n(1,530)\nbps\nMedical customers (in thousands)\n18,059\n \n19,048 \n(5)\n%\n36\nReconciliation of Shareholders' Net Income (GAAP) to Adjusted Income from Operations\nThree Months Ended September 30,\nNine Months Ended September 30,\n2025\n2024\n2025\n2024\n(In millions)\nPre-tax\nAfter-tax\nPre-tax\nAfter-tax\nPre-tax\nAfter-tax\nPre-tax\nAfter-tax\nShareholders' net income\n$\n1,868\n \n$\n739 \n$\n4,723\n \n$\n2,010 \nAdjustments to reconcile to adjusted income from operations\nNet investment (gains) losses \n(1)\n$\n(204)\n(43)\n$\n744 \n740 \n$\n(348)\n(194)\n$\n2,567 \n2,547 \nAmortization of acquired intangible assets\n436\n \n332\n \n436 \n333 \n1,280\n \n998\n \n1,279 \n972 \nSpecial items\nStrategic optimization program\n222\n \n168\n \n— \n— \n566\n \n429\n \n— \n— \nIntegration and transaction-related costs\n7\n \n6\n \n77 \n59 \n297\n \n226\n \n177 \n135 \n(Gain) loss on sale of businesses \n(38)\n(241)\n87 \n62 \n(79)\n(356)\n106 \n19 \n(Benefits) associated with litigation matters\n(17)\n(13)\n— \n— \n(17)\n(13)\n— \n— \nDeferred tax expenses, net \n(2)\n—\n \n19\n \n— \n41 \n—\n \n53\n \n— \n75 \nImpairment of dividend receivable \n—\n \n—\n \n182 \n138 \n—\n \n—\n \n182 \n138 \nTotal special items\n$\n174\n \n(61)\n$\n346 \n300 \n$\n767\n \n339\n \n$\n465 \n367 \nAdjusted income from operations\n$\n2,096\n \n$\n2,112 \n$\n5,866\n \n$\n5,896 \n(1)\nIncludes Net investment gains/losses as presented in our Consolidated Statements of Income, as well as the Company's share of certain investment results of its joint ventures reported in the Cigna Healthcare segment using the equity method of accounting, which are presented within Fees and other revenues in our Consolidated Statements of Income.\n(2)\nRepresents amortization of a foreign tax attribute. See Note 20 to the Consolidated Financial Statements in our 2024 Form 10-K for additional details.\nReconciliation of Shareholders' Net Income (GAAP) to Adjusted Income from Operations\nThree Months Ended September 30,\nNine Months Ended September 30,\n2025\n2024\n2025\n2024\n(Diluted earnings per share)\nPre-tax\nAfter-tax\nPre-tax\nAfter-tax\nPre-tax\nAfter-tax\nPre-tax\nAfter-tax\nShareholders' net income\n$\n6.98\n \n$\n2.63 \n$\n17.52\n \n$\n7.05 \nAdjustments to reconcile to adjusted income from operations\nNet investment (gains) losses \n(1)\n$\n(0.76)\n(0.16)\n$\n2.64 \n2.63 \n$\n(1.29)\n(0.72)\n$\n9.00 \n8.93 \nAmortization of acquired intangible assets\n1.63\n \n1.24\n \n1.55 \n1.18 \n4.74\n \n3.70\n \n4.49 \n3.41 \nSpecial items\nStrategic optimization program\n0.82\n \n0.63\n \n— \n— \n2.10\n \n1.59\n \n— \n— \nIntegration and transaction-related costs\n0.03\n \n0.02\n \n0.27 \n0.21 \n1.10\n \n0.84\n \n0.62 \n0.48 \n(Gain) loss on sale of businesses \n(0.14)\n(0.90)\n0.31 \n0.22 \n(0.29)\n(1.32)\n0.37 \n0.07 \n(Benefits) associated with litigation matters\n(0.06)\n(0.05)\n— \n— \n(0.06)\n(0.05)\n— \n— \nDeferred tax expenses, net \n(2)\n—\n \n0.07\n \n— \n0.15 \n—\n \n0.20\n \n— \n0.26 \nImpairment of dividend receivable \n—\n \n—\n \n0.65 \n0.49 \n—\n \n—\n \n0.64 \n0.48 \nTotal special items\n$\n0.65\n \n(0.23)\n$\n1.23 \n1.07 \n$\n2.85\n \n1.26\n \n$\n1.63 \n1.29 \nAdjusted income from operations\n$\n7.83\n \n$\n7.51 \n$\n21.76\n \n$\n20.68 \n(1)\n Includes Net investment gains/losses as presented in our Consolidated Statements of Income, as well as the Company's share of certain investment results of its joint ventures reported in the Cigna Healthcare segment using the equity method of accounting, which are presented within Fees and other revenues in our Consolidated Statements of Income.\n(2)\n Represents amortization of a foreign tax attribute. See Note 20 to the Consolidated Financial Statements in our 2024 Form 10-K for additional details.\n37\nFinancial highlights by segment\nThree Months Ended September 30,\nNine Months Ended September 30,\n(Dollars in millions, except per share amounts)\n2025\n2024\nChange\n2025\n2024\nChange\nRevenues\nAdjusted revenues by segment\nEvernorth Health Services\n$\n60,391\n \n$\n52,637 \n15 \n%\n$\n171,897\n \n$\n148,411 \n16 \n%\nCigna Healthcare\n10,755\n \n13,163 \n(18)\n35,991\n \n39,583 \n(9)\nOther Operations\n162\n \n234 \n(31)\n521\n \n627 \n(17)\nCorporate, net of eliminations\n(1,738)\n(2,335)\n(26)\n(6,253)\n(7,205)\n(13)\nAdjusted revenues\n69,570\n \n63,699 \n9 \n202,156\n \n181,416 \n11 \nNet investment results from certain equity method investments\n178\n \n177 \n1 \n272\n \n238 \n14 \nSpecial item related to impairment of dividend receivable\n—\n \n(182)\nN/M\n—\n \n(182)\nN/M\nTotal revenues\n$\n69,748\n \n$\n63,694 \n10 \n%\n$\n202,428\n \n$\n181,472 \n12 \n%\nShareholders' net income\n$\n1,868\n \n$\n739 \n153 \n%\n$\n4,723\n \n$\n2,010 \n135 \n%\nAdjusted income from operations\n$\n2,096\n \n$\n2,112 \n(1)\n%\n$\n5,866\n \n$\n5,896 \n(1)\n%\nEarnings per share (diluted)\nShareholders' net income\n$\n6.98\n \n$\n2.63 \n165 \n%\n$\n17.52\n \n$\n7.05 \n149 \n%\nAdjusted income from operations\n$\n7.83\n \n$\n7.51 \n4 \n%\n$\n21.76\n \n$\n20.68 \n5 \n%\nPre-tax adjusted income (loss) from operations by segment\nEvernorth Health Services\n$\n1,903\n \n$\n1,876 \n1 \n%\n$\n5,033\n \n$\n4,855 \n4 \n%\nCigna Healthcare\n1,038\n \n1,174 \n(12)\n3,419\n \n3,718 \n(8)\nOther Operations\n36\n \n(6)\nN/M\n61\n \n(4)\nN/M\nCorporate, net of eliminations\n(399)\n(425)\n(6)\n(1,192)\n(1,269)\n(6)\nConsolidated pre-tax adjusted income from operations\n2,578\n \n2,619 \n(2)\n7,321\n \n7,300 \n— \nIncome attributable to noncontrolling interests\n123\n \n99 \n24 \n342\n \n271 \n26 \nNet investment income (losses) \n(1)\n204\n \n(744)\nN/M\n348\n \n(2,567)\nN/M\nAmortization of acquired intangible assets\n(436)\n(436)\n— \n(1,280)\n(1,279)\n— \nSpecial items\n(174)\n(346)\n(50)\n(767)\n(465)\n65 \nIncome before income taxes\n$\n2,295\n \n$\n1,192 \n93 \n%\n$\n5,964\n \n$\n3,260 \n83 \n%\n(1)\nIncludes Net investment gains/losses as presented in our Consolidated Statements of Income, as well as the Company's share of certain investment results of its joint ventures reported in the Cigna Healthcare segment using the equity method of accounting, which are presented within Fees and other revenues in our Consolidated Statements of Income.\nFor further analysis and explanation of each segment's results, see the \"Segment Reporting\" section in this MD&A. \nCommentary: Three and Nine Months Ended September 30, 2025 versus Three and Nine Months Ended September 30, 2024\nThe commentary presented below, and the segment commentaries that follow, compare results for the three and nine months ended September 30, 2025 with results for the three and nine months ended September 30, 2024. Commentary regarding percentage changes (or bps) and dollar variances represents the driver's impact on the overall category.\nShareholders' net income \nfor the three and nine months ended increased 153% and 135%, primarily reflecting the absence of the impairment of VillageMD equity securities that was recorded in 2024.\nAdjusted income from operations. \nSee discussion of segment results in the \"Segment Reporting\" section.\n \nMedical customers\n decreased 5%, primarily reflecting the closing of the HCSC transaction (defined below) in the three months ended March 31, 2025.\nPharmacy revenues \nincreased 16% and 17%, primarily reflecting higher utilization of prescription drugs from customer growth in Evernorth Health Services.\nPremiums\n decreased 21% and 10%, primarily driven by the impact of the HCSC transaction (-25% and -15%, respectively), partially offset by higher premium rates within our ongoing U.S. Healthcare businesses (+4% in both periods).\nFees and other revenues \nincreased 13% and 14%, primarily reflecting growth in affordability services (defined in the \"Segment Reporting\" section) within our Pharmacy Benefit Services operating segment.\n38\nNet investment income\n increased 174% and 2%, primarily due to the absence of the $182 million impairment of the dividend receivable in the third quarter of 2024 related to VillageMD accrued dividends. For the nine months ended, this impact was offset by lower average assets, due in part to the impact of the HCSC transaction.\nPharmacy and other service costs \nincreased 17% and 18%, primarily reflecting higher utilization of prescription drugs from customer growth in Evernorth Health Services.\nMedical costs and other benefit expenses \ndecreased 18% and 8%, primarily driven by the impact of the HCSC transaction (-26% and -16%, respectively), partially offset by higher medical costs within our ongoing U.S. Healthcare businesses (+8% in both periods).\nSelling, general and administrative (\"SG&A\") expenses\n decreased 6% for the three months ended and was flat for the nine months ended. Both periods were primarily impacted by the HCSC transaction (-16% and -8%, respectively), partially offset by the strategic optimization program (+5% and +4%, respectively) and supporting business growth (+3% and +4%, respectively). See Note 14 to the Consolidated Financial Statements for further discussion of the strategic optimization program.\nGain (loss) on sale of businesses \nprimarily reflects the HCSC transaction for the three and nine months ended. See the \"Divestiture of Medicare Advantage and Related Businesses\" section below and Note 5 to the Consolidated Financial Statements for further discussion of the HCSC transaction.\nInvestment results\n for the three and nine months ended increased, reflecting the absence of the impairment of VillageMD equity securities that was recorded in the three and nine months periods in 2024.\nThe effective tax rate\n decreased for the three and nine months ended, primarily driven by the absence of a valuation allowance related to the impairment of equity securities recorded in 2024 (-18% in both periods), partially offset by the absence of state tax benefits recorded in 2024 (+3% and +5%, respectively). See Note 15 to the Consolidated Financial Statements for further discussion of these matters.\nDevelopments\nDivestiture of Medicare Advantage and Related Businesses\nOn March 19, 2025, the Company completed the sale of our Medicare Advantage, Medicare Individual Stand-Alone Prescription Drug Plans, Medicare and Other Supplemental Benefits, and CareAllies businesses within the U.S. Healthcare operating segment to Health Care Service Corporation (\"HCSC,\" and such transaction, the \"HCSC transaction\"). The purchase price increased from $3.3 billion to $4.9 billion, reflecting higher statutory surplus for the legal entities when conveyed to HCSC and post-closing contractual adjustments. The Company received approximately $4.2 billion cash proceeds at closing. We expect receipt of the remaining approximately $0.6 billion in the fourth quarter of 2025 upon HCSC's collection of amounts due from the Centers for Medicare and Medicaid Services (\"CMS\") and completion of post-closing contractual adjustments. See Note 5 to the Consolidated Financial Statements for further information. \nLIQUIDITY AND CAPITAL RESOURCES\nLiquidity\nWe maintain liquidity at two levels: the subsidiary level and the parent company level.\nSubsidiary Level. \nCash requirements at the subsidiary level generally consist of pharmacy, medical costs and other benefit payments; expense requirements, primarily for employee compensation and benefits, information technology, and facilities costs; income taxes; and debt service. \nOur subsidiaries normally meet their liquidity requirements by maintaining appropriate levels of cash, cash equivalents and short-term investments; using cash flows from operating activities; matching durations of investments to estimated durations for the related insurance and contractholder liabilities; selling investments; and borrowing from affiliates, subject to applicable regulatory limits.\nParent Company Level. \nCash requirements at the parent company level generally consist of debt service, payment of declared dividends to shareholders, lending to subsidiaries as needed and pension plan funding.\nThe parent company normally meets its liquidity requirements by maintaining appropriate levels of cash and various types of marketable investments; collecting dividends from its subsidiaries; using proceeds from issuing debt and common stock; and borrowing from its subsidiaries, subject to applicable regulatory limits.\n39\nRegulatory Restrictions. \nDividends from our insurance, Health Maintenance Organization (\"HMO\") and certain foreign subsidiaries are subject to regulatory restrictions. See Note 19 to the Consolidated Financial Statements in our 2024 Form 10-K for additional information regarding these restrictions. Most of the Evernorth Health Services segment operations are not subject to regulatory restrictions regarding dividends and therefore provide significant financial flexibility to The Cigna Group.\nInvestment Portfolio. \nWe support the liquidity needs of our businesses by managing the duration of invested assets to be consistent with the duration of liabilities. We manage the portfolio to both optimize returns in the current economic environment and meet our liquidity needs.\nCash flows for the nine months ended September 30 were as follows:\nNine Months Ended September 30,\n(In millions)\n2025\n2024\nOperating activities\n$\n3,452\n \n$\n5,151 \nInvesting activities\n$\n(3,987)\n$\n(1,911)\nFinancing activities\n$\n(2,355)\n$\n(4,399)\nThe following discussion explains variances in the various categories of cash flows for the nine months ended September 30, 2025 compared with the same period in 2024. \nOperating Activities. \nCash flows from operating activities consist principally of cash receipts and disbursements for pharmacy revenues and costs, premiums and medical costs, fees, investment income, taxes, and other expenses.\nOperating cash flows decreased for the nine months ended September 30, 2025 primarily due to the absence of the favorable net cash flow impacts from onboarding significant new clients in 2024 and the unfavorable impact of pharmacy and services costs payments, as well as timing of settlements related to the accounts receivable factoring facility. This decrease is partially offset by higher insurance liabilities and the favorable impact of accrued liabilities.\nInvesting Activities. \nThe increase in cash used in investing activities reflects higher investment purchases, partially offset by the net proceeds on the HCSC transaction.\nFinancing Activities. \nThe decrease in net cash used in financing activities in 2025 is primarily driven by lower share repurchases.\nCapital Resources\nOur capital resources consist primarily of cash, cash equivalents and investments maintained at regulated subsidiaries required to underwrite insurance risks, cash flows from operating activities, our commercial paper program, revolving credit facility, and the issuance of long-term debt and equity securities. Our businesses generate significant cash flows from operations, some of which is subject to regulatory restrictions relative to the amount and timing of dividend payments to the parent company. Dividends received from U.S.-regulated subsidiaries were $0.6 billion for the nine months ended September 30, 2025 and $1.7 billion for the nine months ended September 30, 2024. Non-regulated subsidiaries also generate significant cash flows from operating activities, which are typically available immediately to the parent company for general corporate purposes. \nWe prioritize our use of capital resources to (i) invest in capital expenditures (primarily related to technology to support innovative solutions for our clients and customers), provide the capital necessary to maintain or improve the financial strength ratings of subsidiaries, and to repay debt and fund pension obligations if necessary; (ii) pay dividends to shareholders; (iii) consider acquisitions and investments that are strategically and economically advantageous; and (iv) return capital to shareholders through share repurchases.\nFunds Available\nCommercial Paper Program\n.\n There was no commercial paper outstanding balance as of September 30, 2025. \nRevolving Credit Agreement. \nOur revolving credit agreement provides us with the ability to borrow amounts for general corporate purposes, including for the purpose of providing liquidity support if necessary under our commercial paper program discussed above. In April 2025, the Company replaced its previous revolving credit agreements and entered into a $6.5 billion, five-year revolving credit and letter of credit agreement that will mature in April 2030. See Note 7 to the Consolidated Financial Statements for further information on our credit agreement and commercial paper program. \n40\nAs of September 30, 2025, we had $6.5 billion of undrawn committed capacity under our revolving credit agreement (these amounts are available for general corporate purposes, including providing liquidity support for our commercial paper program), $6.5 billion of remaining capacity under our commercial paper program, and $6.3 billion in cash and short-term investments, approximately $0.8 billion of which was held by the parent company or certain non-regulated subsidiaries.\nOur debt-to-capitalization ratio (calculated as Short-term debt and Long-term debt (\"Total debt\") as a percentage of Total shareholders' equity and Total debt (\"Total capitalization\")) was 44.9% and 43.3% as of September 30, 2025 and June 30, 2025, respectively. \nWe actively monitor our debt obligations and engage in issuance or redemption activities as needed in accordance with our capital management strategy.\nDebt Issuance and Term Loan\n: In September 2025, we issued $4.5 billion of new senior notes. The proceeds from this debt were used to repay the $2.0 billion of loans outstanding under the Term Loan Facility, dated August 2025, the proceeds of which were used to fund an investment in Shields Health Solutions, a leading specialty pharmacy management company. We used the remainder for general corporate purposes, including investments and repayment of indebtedness. See Note 7 to the Consolidated Financial Statements for further information regarding our debt issuance and the Term Loan Facility. \nSubsidiary Borrowings. \nIn addition to the sources of liquidity discussed above, the parent company can borrow an additional $1.2 billion from its subsidiaries without further approvals as of September 30, 2025.\nUse of Capital Resources\nShort-Term and Long-Term Debt. \nDuring the three months ended March 31, 2025, the Company redeemed at par its $700 million 5.685% senior notes that were due March 2026. In April 2025, $900 million of 3.250% senior notes were repaid at maturity. The Company may, from time to time, repay or repurchase debt in advance of maturities when it deems appropriate.\nCapital Expenditures\n.\n Capital expenditures for property, equipment and computer software were $0.9 billion in the nine months ended September 30, 2025 compared with $1.1 billion in the nine months ended September 30, 2024.\n \nDividends\n.\n The Company currently intends to pay regular quarterly dividends, with future declarations subject to approval by its Board of Directors and the Board's determination that the declaration of dividends remains in the best interests of The Cigna Group and its shareholders. See Note 8 to the Consolidated Financial Statements for further information regarding dividend payments and declarations.\nShare Repurchases\n.\n The Company maintains a share repurchase program authorized by the Board of Directors, under which it may repurchase shares of its common stock from time to time. The timing and actual number of shares repurchased will depend on a variety of factors, including price, general business and market conditions, and alternate uses of capital. The share repurchase program may be effected through open market purchases in compliance with Rule 10b-18 under the Securities Exchange Act of 1934, as amended (the \"Exchange Act\"), including through Rule 10b5-1 trading plans or privately negotiated transactions. The program may be suspended or discontinued at any time. \nWe repurchased 8.2 million shares for approximately $2.6 billion during the nine months ended September 30, 2025, compared with 14.7 million shares for approximately $5.0 billion during the nine months ended September 30, 2024. \nOther Sources of Funds and Uses of Capital Resources\nDivestiture. \nAs discussed in the \"Developments\" section above, the HCSC transaction was completed on March 19, 2025. We used the proceeds in alignment with our capital deployment priorities, with the majority allocated to share repurchases.\nRisks to Liquidity and Capital Resources\nRisks to our liquidity and capital resources outlook include cash projections that may not be realized, and the demand for funds could exceed available cash if our ongoing businesses experience unexpected shortfalls in earnings or we experience material adverse effects from one or more risks or uncertainties described more fully in the \"Risk Factors\" section in our 2024 Form 10-K. \nGuarantees and Contractual Obligations\n \nWe are contingently liable for various contractual obligations and financial and other guarantees entered into in the ordinary course of business. See Note 16 to the Consolidated Financial Statements for discussion of various guarantees. \n41\nDue to the issuance, redemption and maturity of senior notes in the nine months ended September 30, 2025, our long-term debt obligations as of September 30, 2025 have been updated compared to those previously provided in our 2024 Form 10-K. See Note 7 to the Consolidated Financial Statements for further discussion. Ex\ncept for the item listed below, there have been no material changes to other information presented in our guarantees and contractual obligations set forth in our 2024 Form 10-K.\nLong-Term Debt. \nTotal scheduled payments on long-term debt are $53.0 billion through January 2056 (of which $1.5 billion relate to the remainder of 2025), which include scheduled interest payments and maturities of long-term debt. \nCRITICAL ACCOUNTING ESTIMATES\nThe preparation of Consolidated Financial Statements in accordance with GAAP requires management to make estimates and assumptions that affect reported amounts and related disclosures in the Consolidated Financial Statements. Management considers an accounting estimate to be critical if:\n•\nit requires assumptions to be made that were uncertain at the time the estimate was made; and\n•\nchanges in the estimate or different estimates that could have been selected could have a material effect on our consolidated results of operations or financial condition.\nManagement has discussed how critical accounting estimates are developed and selected with the Audit Committee of our Board of Directors, and the Audit Committee has reviewed the disclosures presented in our 2024 Form 10-K. We regularly evaluate items that may impact critical accounting estimates.\nOur most critical accounting estimates, as well as the effect of hypothetical changes in material assumptions used to develop each estimate, are described in our 2024 Form 10-K. As of September 30, 2025, there were no significant changes to the critical accounting estimates from what was reported in our 2024 Form 10-K.\nGoodwill and Other intangible assets\nOur annual evaluations of goodwill and other intangible assets for impairments were completed during the third quarter of 2025. These evaluations were performed at the reporting unit level, based on discounted cash flow analyses or market data. The estimated fair value of each of our reporting units exceeded their carrying values by substantial margins.\nManagement believes the current assumptions used to estimate amounts reflected in our Consolidated Financial Statements are appropriate. However, if actual experience significantly differs from the assumptions used in estimating amounts reflected in our Consolidated Financial Statements, the resulting changes could have a material adverse effect on our consolidated results of operations and, in certain situations, could have a material adverse effect on liquidity and our financial condition.\nSEGMENT REPORTING\nThe following section in this MD&A discusses the results of each of our segments. See Note 1 to the Consolidated Financial Statements for further description of our segments.\nIn segment discussions, we present \"adjusted revenues\" and \"pre-tax adjusted income (loss) from operations,\" defined as income (loss) before income taxes excluding pre-tax income (loss) attributable to noncontrolling interests, net investment gains/losses, amortization of acquired intangible assets and special items. The Company uses \"pre-tax adjusted income (loss) from operations\" and \"adjusted revenues\" as its principal financial measures of segment operating performance because management believes these metrics reflect the underlying results of business operations and facilitate analysis of trends in underlying revenue, expenses and profitability. The Cigna Group share of certain investment results of its joint ventures reported in the Cigna Healthcare segment using the equity method of accounting are also excluded. Special items are matters that management, including the chief operating decision maker, believes are not representative of the underlying results of operations due to their nature or size. Ratios presented in this segment discussion exclude the same items as adjusted revenues and pre-tax adjusted income (loss) from operations. See Note 17 to the Consolidated Financial Statements for additional discussion of these metrics and a reconciliation of income (loss) before income taxes to pre-tax adjusted income (loss) from operations, as well as a reconciliation of Total revenues to adjusted revenues. Note 17 to the Consolidated Financial Statements also explains that segment revenues include both external revenues and sales between segments that are eliminated in Corporate. \nIn these segment discussions, we also present \"pre-tax margin,\" calculated as pre-tax adjusted income (loss) from operations divided by adjusted revenues.\nSee the \"Executive Overview\" section in this MD&A for summarized financial results of each of our segments.\n42\nEvernorth Health Services Segment\nEvernorth Health Services includes a broad range of coordinated and point solution health services and capabilities within our Pharmacy Benefit Services and Specialty and Care Services operating segments. As described in the introduction to Segment Reporting, the performance of Evernorth Health Services is measured using adjusted revenues and pre-tax adjusted income (loss) from operations.\nIn 2025, the Company renewed or extended contracts with the business’s largest clients through the end of the decade. Additionally, to further deliver value for the benefit of those we serve and to build a more sustainable model for health care, the Company will incur investment and transition costs to support its recently announced transformational rebate-free model for pharmacy benefits, designed to lower medication costs, improve transparency and support local pharmacies. As a result, we expect these efforts to impact pre-tax adjusted income from operations for Evernorth Health Services over the short term.\nKey Factors Affecting Segment Performance\nThe key factors that impact the segment's revenues and income from operations are claims utilization, claims composition and contract affordability services. Specialty and Care Services revenues are also impacted by customer and client growth. These key factors are discussed further below. See Note 2 to the Consolidated Financial Statements included in our 2024 Form 10-K for additional information on revenue and cost recognition policies for this segment.\nKey factors that impact both Pharmacy Benefit Services and Specialty and Care Services:\n•\nPharmacy claim volume (also referred to as \"utilization\") relates to processing prescription claims filled by retail pharmacies in our network and dispensing prescription claims from our home delivery and specialty pharmacies, along with other claims. Pharmacy claim volume is impacted by new clients or organic customer growth through the expansion of existing clients or through the loss of customers and business.\n•\nThe composition of claims generally considers the types of drugs, including the mix of claims among branded and higher priced specialty drugs compared to generic or biosimilar alternatives. We manage pharmaceutical manufacturer increases in prices through programs designed to reduce drug spend, providing positive impacts on our clients, our customers and us. Changes to claims mix, including types of drugs, distribution methods, pharmaceutical manufacturer prices, and alternative uses of drugs within our formularies continue to be a significant driver of our revenues and income from operations in the current environment. \n•\nOur client contract pricing is impacted by our ongoing ability to negotiate favorable contracts for pharmacy network, pharmaceutical and wholesaler purchasing, and manufacturer rebates (also referred to as \"affordability improvements\" or \"affordability services\"). Through these affordability improvements, we seek to improve the effectiveness of our combined and standalone solutions for our clients by continuously innovating, improving affordability and implementing drug purchasing contract initiatives. Our continued affordability improvements further reduce drug costs for our customers and clients, and we share in the value delivered, which generally results in a favorable impact on our income from operations.\nKey factors that impact Specialty and Care Services:\n•\nCustomer and client growth, both organic and new business, and key relationships in our Specialty and Care Services business generally results in increased revenues and income from operations. This includes client movement in our specialty pharmacy, specialty distribution services, virtual care, physical primary care, benefits management and behavioral health services as we expand our businesses and build upon our cross-enterprise leverage.\nResults of Operations\nFinancial Summary\nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n(Dollars in millions)\n2025\n2024\nChange\n2025\n2024\nChange\nAdjusted revenues \n(1)\n$\n60,391\n \n$\n52,637 \n15\n%\n$\n171,897\n \n$\n148,411 \n16 \n%\nPre-tax adjusted income from operations \n(1)\n$\n1,903\n \n$\n1,876 \n1\n%\n$\n5,033\n \n$\n4,855 \n4 \n%\nPre-tax margin \n(1)(2)\n3.2\n \n%\n3.6 \n%\n(40)\nbps\n2.9\n \n%\n3.3 \n%\n(40)\nbps\nSG&A expense ratio \n(3)\n1.7\n \n%\n1.7 \n%\n— \nbps\n1.8\n \n%\n1.9 \n%\n(10)\nbps\n(1)\nSee Note 17 to the Consolidated Financial Statements for reconciliation of adjusted revenues and pre-tax adjusted income from operations to Total revenues and Income before income taxes, respectively. \n(2)\nPre-tax margin is calculated as pre-tax adjusted income from operations divided by adjusted revenues.\n(3)\nSG&A expense ratio is calculated as segment selling, general and administrative expenses divided by adjusted revenues. See Note 17 to the Consolidated Financial Statements for further details.\n43\nIn this selected financial information, we present adjusted revenues and pre-tax income from operations by our two operating segments, Pharmacy Benefit Services and Specialty and Care Services. \nSelected Financial Information\nThree Months Ended\nSeptember 30,\nChange\nNine Months Ended\nSeptember 30,\nChange\n(Dollars and adjusted scripts in millions)\n2025\n2024\n2025\n2024\nTotal adjusted revenues\nPharmacy Benefit Services\n$\n34,091\n \n$\n28,812 \n18 \n%\n$\n95,787\n \n$\n81,549 \n17 \n%\nSpecialty and Care Services\n26,300\n \n23,825 \n10 \n76,110\n \n66,862 \n14 \nTotal adjusted revenues\n$\n60,391\n \n$\n52,637 \n15 \n%\n$\n171,897\n \n$\n148,411 \n16 \n%\nPre-tax adjusted income from operations\nPharmacy Benefit Services\n$\n975\n \n$\n1,038 \n(6)\n%\n$\n2,352\n \n$\n2,379 \n(1)\n%\nSpecialty and Care Services\n928\n \n838 \n11 \n2,681\n \n2,476 \n8 \nTotal pre-tax adjusted income from operations\n$\n1,903\n \n$\n1,876 \n1 \n%\n$\n5,033\n \n$\n4,855 \n4 \n%\nPharmacy claim volume \n(1)\n558\n \n531 \n5 \n%\n1,645\n \n1,577 \n4 \n%\n(1)\nNon-specialty network prescriptions filled through 90-day programs and home delivery prescriptions are counted as three claims. All other network and specialty prescriptions are counted as one claim.\nThree and Nine Months Ended September 30, 2025 versus Three and Nine Months Ended September 30, 2024\nCommentary in parentheses regarding percentage changes (or bps) represents the driver's impact on the overall category.\nAdjusted revenues\n increased 15% and 16% for the three and nine months ended, respectively, primarily reflecting higher utilization of prescription drugs from customer growth in Pharmacy Benefit Services (+7% and +6%, respectively) and Specialty and Care Services (+5% and +6%, respectively) and an increase due to claims composition in Pharmacy Benefit Services (+3% and +4%, respectively). \nPre-tax adjusted income from operations \nincreased 1% and 4% for the three and nine months ended, respectively, primarily reflecting specialty pharmacy growth in Specialty and Care Services (+6% and +6%, respectively), and contract affordability improvements and customer growth in Pharmacy Benefit Services (+2% for the nine months ended), partially offset by strategic investments and initiatives to support business growth in Pharmacy and Benefit Services (-4% and -2%, respectively) and Specialty and Care Services (-1% and -2%, respectively).\nThe\n \nSG&A expense ratio\n was flat for the three months ended and decreased 10 bps for the nine months ended, primarily reflecting higher adjusted revenues as discussed above, offset by strategic investments and initiatives to support business growth.\nCigna Healthcare Segment\nCigna Healthcare includes the U.S. Healthcare and International Health businesses, which provide comprehensive medical and coordinated solutions to clients and customers. As described in the introduction to Segment Reporting, performance of the Cigna Healthcare segment is measured using adjusted revenues and pre-tax adjusted income from operations.\nOn March 19, 2025, the Company completed the sale of our Medicare Advantage, Medicare Individual Stand-Alone Prescription Drug Plans, Medicare and Other Supplemental Benefits, and CareAllies businesses within the U.S. Healthcare operating segment. See \"Developments\" for further discussion. \nKey Factors Affecting Segment Performance \nThe key factors that impact the segment's revenues and income from operations include revenue growth, customer growth, medical cost trend, percentage of Medicare Advantage customers in plans eligible for quality bonus payments, the medical care ratio (\"MCR\") and the SG&A expense ratio. These key factors are discussed further below. See Note 2 to the Consolidated Financial Statements included in our 2024 Form 10-K for additional information on revenue and cost recognition policies for this segment.\n•\nRevenue growth includes increases to premium rates in consideration of anticipated medical cost increases, customer growth driven by new clients and customers, and increased fee revenue from the expansion of products and services to existing clients and customers, including solutions provided by Evernorth Health Services.\n•\nHigher medical costs (also referred to as higher medical cost trend) are impacted by utilization (the quantity of medical services consumed by our customers), unit costs (the cost per medical service) and mix of services. \n44\n•\nPrior to the divestiture of our Medicare Advantage and related businesses to HCSC, the percentage of Medicare Advantage customers in bonus-eligible plans impacted the amount of quality bonus payments we receive. \n•\nMCR represents medical costs as a percentage of premiums for our segment's insured businesses, and it is impacted by medical cost trend and premium rates. Affordability initiatives that serve to mitigate medical cost inflation also impact the MCR. \n•\nThe SG&A expense ratio represents the segment's selling, general and administrative expenses divided by adjusted revenues.\nResults of Operations\nFinancial Summary\nThree Months Ended\nSeptember 30,\nChange\nNine Months Ended\nSeptember 30,\nChange\n(Dollars in millions)\n2025\n2024\n2025\n2024\nAdjusted revenues \n(1)\n$\n10,755\n \n$\n13,163 \n(18)\n%\n$\n35,991\n \n$\n39,583 \n(9)\n%\nPre-tax adjusted income from operations \n(1)\n$\n1,038\n \n$\n1,174 \n(12)\n%\n$\n3,419\n \n$\n3,718 \n(8)\n%\nPre-tax margin\n (1)(2)\n9.7\n \n%\n8.9 \n%\n80 \nbps\n9.5\n \n%\n9.4 \n%\n10 \nbps\nMedical care ratio\n84.8\n \n%\n82.8 \n%\n200 \nbps\n83.3\n \n%\n81.7 \n%\n160 \nbps\nSG&A expense ratio \n(3)\n19.9\n \n%\n20.0 \n%\n(10)\nbps\n19.8\n \n%\n20.2 \n%\n(40)\nbps\n(1)\nSee Note 17 to the Consolidated Financial Statements for reconciliation of adjusted revenues and pre-tax adjusted income from operations to Total revenues and Income before income taxes, respectively. \n(2)\nPre-tax margin is calculated as pre-tax adjusted income from operations divided by adjusted revenues.\n(3)\nSG&A expense ratio is calculated as segment selling, general and administrative expenses divided by adjusted revenues. See Note 17 to the Consolidated Financial Statements for further details.\nThree and Nine Months Ended September 30, 2025 versus Three and Nine Months Ended September 30, 2024\nCommentary regarding percentage changes (or bps) and dollar variances represents the driver's impact on the overall category.\nAdjusted revenues \ndecreased 18%, or $2,408 million, and\n \n9%, or $3,592 million, primarily due to the impact of the HCSC transaction (-$2,998 million and -$5,524 million, respectively), partially offset by higher premiums within employer insured (+$323 million and  +$952 million, respectively) and stop loss (+$219 million and +$633 million, respectively), primarily reflecting premium rate increases.\nPre-tax adjusted income from operations \ndecreased 12%, or $136 million, and\n \n8%, or $299 million, primarily due to a higher MCR.\nThe \nmedical care ratio \nincreased 200 bps for the three months ended, primarily due to relatively equal contributions from our Individual and Family Plans business and higher expected stop loss medical costs. The \nmedical care ratio \nincreased 160 bps for the nine months ended, primarily due to higher expected stop loss medical costs.\nThe \nSG&A expense ratio \ndecreased 10 bps and 40 bps, primarily due to revenue growth outpacing volume-related expenses within the ongoing businesses (-60 bps and -50 bps, respectively), partially offset by the impact of the HCSC transaction (+60 bps and +20 bps, respectively).\n45\nMedical Customers\nMedical customers include individuals who meet any of the following criteria: (i) are covered under a medical insurance policy, managed care arrangement or administrative services agreement issued by Cigna Healthcare; (ii) have access to the Cigna Healthcare provider network for covered services under their medical plan; or (iii) have medical claims that are administered by Cigna Healthcare.\nCigna Healthcare Medical Customers\nAs of September 30,\n(In thousands)\n2025\n2024\nChange\nU.S. Healthcare\n2,562\n \n3,833 \n(33)\n%\nInternational Health \n(1)\n1,268\n \n1,209 \n5 \nInsured\n3,830\n \n5,042 \n(24)\n%\nU.S. Healthcare\n13,790\n \n13,573 \n2 \n%\nInternational Health \n(1)\n439\n \n433 \n1 \nAdministrative services only\n14,229\n \n14,006 \n2 \n%\nTotal\n18,059\n \n19,048 \n(5)\n%\n(1)\nInternational Health excludes medical customers served by less than 100%-owned subsidiaries, as well as certain customers served by our third-party administrator.\nTotal medical customers decreased 5%, primarily due to the HCSC transaction.\nUnpaid Claims and Claim Expenses\nAs of \nSeptember 30,\nAs of\nDecember 31,\n(In millions)\n2025\n2024\nChange\nUnpaid claims and claim expenses\n$\n4,676\n \n$\n5,018 \n(7)\n%\nOur unpaid claims and claim expenses liability decreased 7%, driven by the HCSC transaction (-$983 million), partially offset by an increase in stop loss reserves (+$620 million), primarily due to seasonality.\nOther Operations\nOther Operations includes corporate-owned life insurance (\"COLI\"), the Company's run-off operations and other non-strategic businesses. As described in the introduction of Segment Reporting, performance of Other Operations is measured using adjusted revenues and pre-tax adjusted income from operations. \nResults of Operations\nFinancial Summary\nThree Months Ended September 30,\nChange\nNine Months Ended\nSeptember 30,\nChange\n(Dollars in millions)\n2025\n2024\n2025\n2024\nAdjusted revenues\n$\n162\n \n$\n234 \n(31)\n%\n$\n521\n \n$\n627 \n(17)\n%\nPre-tax adjusted income (loss) from operations\n$\n36\n \n$\n(6)\nN/M\n%\n$\n61\n \n$\n(4)\nN/M\n%\nPre-tax margin\n22.2\n \n%\n(2.6)\n%\n2,480 \nbps\n11.7\n \n%\n(0.6)\n%\n1,230 \nbps\nThree and Nine Months Ended September 30, 2025 versus Three and Nine Months Ended September 30, 2024\nAdjusted revenues \nprimarily reflects premiums and net investment income associated with COLI and our run-off operations, as well as revenues from other non-strategic businesses.\nPre-tax adjusted income (loss) from operations \nincreased for both periods, primarily driven by the decision to discontinue certain small non-strategic businesses.\n46\nCorporate\nCorporate reflects amounts not allocated to operating segments, including net interest expense (defined as interest on corporate financing less net investment income on investments not supporting segment and other operations), certain litigation matters, expense associated with our frozen pension plans, charitable contributions, operating severance, certain overhead and enterprise-wide project costs, and eliminations for products and services sold between segments.\nFinancial Summary\nThree Months Ended September 30,\nChange\nNine Months Ended\nSeptember 30,\nChange\n(In millions)\n2025\n2024\n2025\n2024\nPre-tax adjusted loss from operations\n$\n(399)\n$\n(425)\n(6)\n%\n$\n(1,192)\n$\n(1,269)\n(6)\n%\nThree and Nine Months Ended September 30, 2025 versus Three and Nine Months Ended September 30, 2024\nPre-tax adjusted loss from operations\n decreased for both periods, primarily due to lower interest expense.\nINVESTMENT ASSETS\nInformation regarding our investment assets is included in Notes 11, 12 and 13 to the Consolidated Financial Statements. \nInvestment Outlook\nFuture realized and unrealized investment results will be driven largely by market conditions, and these future conditions are not reasonably predictable. We believe that the vast majority of our investments will continue to perform under their contractual terms. We manage the portfolio for long-term economics; therefore, we expect to hold a significant portion of these assets for the long term. Although future declines in investment fair values remain possible due to interest rate movements and credit deterioration due to both investment-specific uncertainties and global economic uncertainties as discussed below, we do not expect these losses to have a material unfavorable effect on our financial condition or liquidity. The below discussion addresses the strategies and risks associated with our various classes of investment assets. See Part I, Item 1A - \"Risk Factors\" in our 2024 Form 10-K for additional information regarding risks associated with our investment portfolio.\nDebt Securities\nThe carrying value of our debt securities portfolio decreased from $9.4 billion as of December 31, 2024 to $8.4 billion as of September 30, 2025, primarily \nreflecting the \nHCSC transaction\n. \nSee Note 5 to the Consolidated Financial Statements for further information. Our portfolio remains in a net unrealized depreciation position due to generally increasing interest rates over the past few years. \nAs of September 30, 2025, $7.3 billion, or 87%, of the debt securities in our investment portfolio were investment grade (Baa and above, or equivalent) and the remaining $1.1 billion were below investment grade. The majority of the bonds that are below investment grade were rated at the higher end of the non-investment-grade spectrum. These quality characteristics have not materially changed since the prior year and remain consistent with our investment strategy. \nInvestments in debt securities are diversified by issuer, geography and industry. On an aggregate basis, the debt securities portfolio continues to perform according to original expectations, which includes a long-term economic investment strategy. Primary risks facing many of the issuers in our portfolio include ongoing geopolitical events and economic conditions. To date, most issuers have been successful in managing these issues without a meaningful change in credit quality. We continue to monitor the economic environment and its effect on our portfolio; we also continue to consider the impact of various factors in determining the allowance for credit losses on debt securities, which is discussed in Note 11 to the Consolidated Financial Statements.\nCommercial Mortgage Loans\nAs of September 30, 2025, our $1.3 billion commercial mortgage loan portfolio consisted of approximately 40 fixed-rate loans, diversified by property type, location and borrower. These loans are carried in our Consolidated Balance Sheets at their unpaid principal balance, net of an allowance for expected credit losses. As a result of increasing market interest rates since the majority of these loans were made, the carrying value exceeds the market value of these loans as of September 30, 2025. Given the quality and diversity of the underlying real estate, positive debt service coverage, and significant borrower cash invested in the property generally ranging between 30% and 40%, we remain confident that the vast majority of borrowers will continue to perform as expected under \n47\ntheir contract terms. For further discussion of the results and changes in key credit quality indicators, see Note 11 to the Consolidated Financial Statements.\nOffice sector fundamentals are weak but have begun to stabilize for higher-quality assets. Lower-quality assets will likely continue to experience value erosion due to weak tenant demand and low investor interest. Additionally, the current macroeconomic headwinds are impacting capital markets and reducing investor appetite for capital-intensive assets (e.g., offices and regional shopping malls). Our commercial mortgage loan portfolio has no exposure to regional shopping malls and less than 25% exposure to office properties. Although future losses remain possible due to further credit deterioration, we do not expect these losses to have a material unfavorable effect on our results of operations, financial condition or liquidity.\nOther Long-Term Investments\nOther long-term investments of $4.9 billion as of September 30, 2025 included investments in securities limited partnerships and real estate limited partnerships, direct investments in real estate joint ventures, and other deposit activity that is required to support various insurance and health services businesses. These limited partnership entities typically invest in mezzanine debt or equity of privately held companies and equity real estate. Given our subordinate position in the capital structure of these underlying entities, we assume a higher level of risk for higher expected returns. To mitigate risk, these investments are diversified by industry sector or property type and geographic region. No single partnership investment exceeded 3% of our securities and real estate limited partnership portfolio.\nWe expect continued volatility in private equity and real estate fund performance going forward as fair market valuations are adjusted to reflect market and portfolio transactions. Less than 4% of our other long-term investments are exposed to real estate in the office sector.\nUnconsolidated Subsidiary Investments Portfolio\nWe participate in an insurance joint venture in China with a 50% ownership interest. We account for this joint venture under the equity method of accounting. Our 50% share of the investment portfolio supporting the joint venture's liabilities was approximately $17.4 billion as of September 30, 2025. These investments were comprised of approximately 70% debt securities, including government and corporate debt diversified by issuer, industry and geography; 20% equities, including mutual funds, equity securities and private equity partnerships; and 10% long-term deposits and policy loans. We continuously review the joint venture's investment strategy and its execution. There were no investments with a material unrealized loss as of September 30, 2025. See Note 14 to the Consolidated Financial Statements in our 2024 Form 10-K for additional information regarding unconsolidated subsidiaries.\nMARKET RISK\nFinancial Instruments\nOur assets and liabilities include financial instruments subject to the risk of potential losses from adverse changes in market rates and prices. Our primary market risk exposure is interest rate risk. We encourage you to read this in conjunction with \"Market Risk – Financial Instruments\" included in the MD&A section in our 2024 Form 10-K. \nAs of September 30, 2025, there was no material change in our risk exposure as reported in our 2024 Form 10-K."
}