{
  "source_file": "cinf-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2.    Management’s Discussion and Analysis of Financial Condition and \n        Results of Operations\nThe following discussion highlights significant factors influencing the condensed consolidated results of operations and financial position of Cincinnati Financial Corporation. It should be read in conjunction with the consolidated financial statements and related notes included in our 2024 Annual Report on Form 10-K. Unless otherwise noted, the industry data is prepared by A.M. Best Co., a leading insurance industry statistical, analytical and financial strength rating organization. Information from A.M. Best is presented on a statutory basis for insurance company regulation in the United States of America. When we provide our results on a comparable statutory basis, we label it as such; all other company data is presented in accordance with accounting principles generally accepted in the United States of America (GAAP).\n \nWe present per share data on a diluted basis unless otherwise noted, adjusting those amounts for all stock splits and dividends. Dollar amounts are rounded to millions; calculations of percent changes are based on dollar amounts rounded to the nearest million. Certain percentage changes are identified as not meaningful (nm).\n \nSAFE HARBOR STATEMENT\n    \nOur business is subject to certain risks and uncertainties that may cause actual results to differ materially from those suggested by forward-looking statements. Any forward-looking statements contained herein, are based upon our current estimates, assumptions and plans that are subject to uncertainty. These statements are made subject to the safe-harbor provisions of the Private Securities Litigation Reform Act of 1995. Forward-looking statements can be identified by words like “seek,” “expect,” “will,” “should,” “could,” “might,” “anticipate,” “believe,” “estimate,” “intend,” “likely,” “future,” or other similar expressions. Forward-looking statements speak only as of the date they were made; we assume no obligation to update such statements. Factors that could cause actual results to differ materially from those expressed in, or implied by, the forward-looking statements include, but are not limited to:\nInsurance-Related Risks\n•\nRisks and uncertainties associated with our loss reserves or actual claim costs exceeding reserves\n•\nIncreased frequency and/or severity of claims or development of claims that are unforeseen at the time of policy issuance\n•\nUnusually high levels of catastrophe losses due to risk concentrations or changes in weather patterns, environmental events, war or political unrest, terrorism incidents, cyberattacks, civil unrest or other causes; and our ability to manage catastrophe risk\n•\nRisks associated with analytical models in key areas such as underwriting, pricing, capital management, reserving, investments, reinsurance, and catastrophe risk management\n•\nInadequate estimates or assumptions, or reliance on third-party data used for critical accounting estimates\n•\nEvents or conditions that could weaken or harm our relationships with our independent agencies and hamper opportunities to add new agencies, resulting in limitations on our opportunities for growth\n•\nMergers, acquisitions, and other consolidations of agencies that result in a concentration of a significant amount of premium in one agency or agency group and/or alter our competitive advantages\n•\nOur inability to manage business opportunities, growth prospects, and expenses for our ongoing operations\n•\nChanging consumer insurance-buying habits \n•\nThe inability to obtain adequate ceded reinsurance on acceptable terms, for acceptable amounts, and from financially strong reinsurers; and the potential for nonpayment or delay in payment by reinsurers\nCincinnati Financial Corporation Third-Quarter 2025 10-Q\nPage 33\nTable of Contents\n•\nDomestic and global events, such as the wars in Ukraine and in the Middle East, future pandemics, inflationary trends, changes in U.S. trade and tariff policy, and disruptions in the banking and financial services industry, resulting in insurance losses, capital market or credit market uncertainty, followed by prolonged periods of economic instability or recession, that lead to:\n◦\nSecurities market disruption or volatility and related effects such as decreased economic activity and continued supply chain disruptions that affect our investment portfolio and book value\n◦\nSignificant or prolonged decline in the fair value of securities and impairment of the assets\n◦\nSignificant decline in investment income due to reduced or eliminated dividend payouts from securities\n◦\nSignificant rise in losses from surety or director and officer policies written for financial institutions or other insured entities or in losses from policies written by Cincinnati Re or Cincinnati Global\n◦\nAn unusually high level of claims in our insurance or reinsurance operations that increase litigation-related expenses\n◦\nDecreased premium revenue and cash flow from disruption to our distribution channel of independent agents, consumer self-isolation, travel limitations, business restrictions and decreased economic activity\n◦\nThe inability of our workforce, agencies, or vendors to perform necessary business functions\nFinancial, Economic, and Investment Risks\n \n•\nDeclines in overall stock market values negatively affecting our equity portfolio and book value \n•\nDowngrades in our financial strength ratings \n•\nInterest rate fluctuations or other factors that could significantly affect: \n◦\nOur ability to generate growth in investment income \n◦\nValues of our fixed-maturity investments and accounts in which we hold bank-owned life insurance contract assets \n◦\nOur traditional life policy reserves \n•\nEconomic volatility and illiquidity associated with our alternative investments in private equity, private credit, real property, and limited partnerships \n•\nFailure to comply with covenants and other requirements under our credit facilities, senior debt, and other debt obligations \n•\nRecession, prolonged elevated inflation, or other economic conditions resulting in lower demand for insurance products or increased payment delinquencies \n•\nThe inability of our subsidiaries to pay dividends consistent with current or past levels impacting our ability to pay shareholder dividends or repurchase shares\nGeneral Business, Technology, and Operational Risks\n \n•\nIneffective information technology systems or failing to develop and implement improvements in technology \n•\nDifficulties with technology or data security breaches, including cyberattacks, could negatively affect our, or our agents’, ability to conduct business; disrupt our relationships with agents, policyholders, and others; cause reputational damage, mitigation expenses, data loss, and expose us to liability  \n•\nDifficulties with our operations and technology that may negatively impact our ability to conduct business, including cloud-based data information storage, data security, remote working capabilities, and/or outsourcing relationships and third-party operations and data security \n•\nDisruption of the insurance market caused by technology innovations - such as driverless cars - that could decrease consumer demand for insurance products \n•\nDelays, inadequate data developed internally or from third parties, or performance inadequacies from ongoing development and implementation of underwriting and pricing models and methods, including usage-based insurance methods, automation, artificial intelligence, or technology projects and enhancements expected to increase our efficiency, pricing accuracy, underwriting profit, and competitiveness \nCincinnati Financial Corporation Third-Quarter 2025 10-Q\nPage 34\nTable of Contents\n•\nIntense competition, and the impact of innovation, emerging technologies, artificial intelligence and changing customer preferences on the insurance industry and the markets in which we operate, could harm our ability to maintain or increase our business volumes and profitability \n•\nInability to defer policy acquisition costs for any business segment if pricing and loss trends would lead management to conclude that the segment could not achieve sustainable profitability \n•\nUnforeseen departure of certain executive officers or other key employees that could interrupt progress toward important strategic goals or diminish the effectiveness of certain longstanding relationships with insurance agents and others \n•\nOur inability, or the inability of our independent agents, to attract and retain personnel \n•\nEvents, such as a pandemic, an epidemic, natural catastrophe, or terrorism, which could hamper our ability to assemble our workforce, work effectively in a remote environment, or other failures of business continuity or disaster recovery programs\nRegulatory, Compliance, and Legal Risks\n \n•\nActions of insurance departments, state attorneys general or other regulatory agencies, including a change to a federal system of regulation from a state-based system, that: \n◦\nImpose new obligations on us that increase our expenses or change the assumptions underlying our critical accounting estimates \n◦\nPlace the insurance industry under greater regulatory scrutiny or result in new statutes, rules, and regulations  \n◦\nRestrict our ability to exit or reduce writings of unprofitable coverages or lines of business \n◦\nIncrease assessments for guaranty funds, other insurance‑related assessments, or mandatory reinsurance arrangements; or that impair our ability to recover such assessments through future surcharges or other rate changes \n◦\nIncrease our provision for federal income taxes due to changes in tax laws, regulations, or interpretations \n◦\nIncrease other expenses \n◦\nLimit our ability to set fair, adequate, and reasonable rates \n◦\nRestrict our ability to cancel policies \n◦\nImpose new underwriting standards\n◦\nPlace us at a disadvantage in the marketplace  \n◦\nRestrict our ability to execute our business model, including the way we compensate agents \n•\nAdverse outcomes from litigation, environmental claims, mass torts or administrative proceedings, including effects of social inflation and third-party litigation funding on the size and frequency of litigation awards \n•\nEvents or actions, including unauthorized intentional circumvention of controls, which reduce our future ability to maintain effective internal control over financial reporting under the Sarbanes-Oxley Act of 2002 \n•\nEffects of changing social, global, economic, and regulatory environments \n•\nAdditional measures affecting corporate financial reporting and governance that can affect the market value of our common stock\nRisks and uncertainties are further discussed in other filings with the Securities and Exchange Commission, including our 2024 Annual Report on Form 10-K, Item 1A, Risk Factors, Page 30.  \nCincinnati Financial Corporation Third-Quarter 2025 10-Q\nPage 35\nTable of Contents\nCORPORATE FINANCIAL HIGHLIGHTS\n \nNet Income and Comprehensive Income Data\n(Dollars in millions, except per share data)\nThree months ended September 30,\nNine months ended September 30,\n2025\n2024\n% Change\n2025\n2024\n% Change\nEarned premiums\n$\n2,567\n \n$\n2,297 \n12 \n$\n7,391\n \n$\n6,524 \n13 \nInvestment income, net of expenses (pretax)\n295\n \n258 \n14 \n860\n \n745 \n15 \nInvestment gains and losses, net (pretax)\n853\n \n758 \n13 \n1,259\n \n1,507 \n(16)\nTotal revenues\n3,726\n \n3,320 \n12 \n9,540\n \n8,799 \n8 \nNet income \n1,122\n \n820 \n37 \n1,717\n \n1,887 \n(9)\nComprehensive income \n1,287\n \n1,140 \n13 \n1,942\n \n2,172 \n(11)\nNet income per share—diluted\n7.11\n \n5.20 \n37 \n10.88\n \n11.97 \n(9)\nCash dividends declared per share\n0.87\n \n0.81 \n7 \n2.61\n \n2.43 \n7 \nDiluted weighted average shares outstanding\n157.8\n \n157.7 \n0 \n157.8\n \n157.7 \n0 \nTotal revenues increased $406 million for the third quarter of 2025, compared with the third quarter of 2024, including higher earned premiums, net investment gains and investment income. For the first nine months of 2025, compared with the same period of 2024, total revenues increased $741 million, primarily due to higher earned premiums and investment income offset by a decrease in net investment gains. Premium and investment revenue trends are discussed further in the respective sections of Financial Results.\nInvestment gains and losses are recognized on the sales of investments, on certain changes in fair values of securities even though we continue to hold the securities or as otherwise required by GAAP. We have substantial discretion in the timing of investment sales, and that timing generally is independent of the insurance underwriting process. The change in fair value of securities is also generally independent of the insurance underwriting process.\nNet income for the third quarter of 2025, compared with the third quarter of 2024, increased $302 million, including increases of $77 million in after-tax net investment gains and losses, $182 million in after-tax property casualty underwriting profit and $30 million in after-tax investment income. Catastrophe losses for the third quarter of 2025, mostly weather related, were $152 million lower after taxes and contributed favorably to both net income and property casualty underwriting profit. Life insurance segment results increased by $7 million on a pretax basis.\nFor the first nine months of 2025, net income decreased $170 million, compared with the first nine months of 2024,\nincluding decreases of $193 million in after-tax investment gains and losses and $83 million in after-tax property casualty underwriting income, partially offset by an increase of $92 million in after-tax investment income. The property casualty underwriting income decrease included an unfavorable $248 million after-tax effect from higher catastrophe losses. Life insurance segment results increased by $3 million on a pretax basis.\nPerformance by segment is discussed below in Financial Results. As discussed in our 2024 Annual Report on Form 10-K, Item 7, Executive Summary, Page 46, there are several reasons why our performance during 2025 may ultimately be below our long-term targets. \n \nThe board of directors is committed to rewarding shareholders directly through cash dividends and through share repurchase authorizations. Through 2024, the company had increased the annual cash dividend rate for 64 consecutive years, a record we believe is matched by only seven other U.S. publicly traded companies. In January 2025, the board of directors increased the regular quarterly dividend to 87 cents per share, setting the stage for our 65\nth\n consecutive year of increasing cash dividends. During the first nine months of 2025, cash dividends declared by the company increased 7% compared with the same period of 2024. Our board regularly evaluates relevant factors in decisions related to dividends and share repurchases. The 2025 dividend increase reflected our strong operating performance and signaled management's and the board's positive outlook and confidence in our outstanding capital, liquidity and financial flexibility.\nCincinnati Financial Corporation Third-Quarter 2025 10-Q\nPage 36\nTable of Contents\nBalance Sheet Data and Performance Measures\n(Dollars in millions, except share data)\nAt September 30,\nAt December 31,\n2025\n2024\nTotal investments\n$\n31,099\n \n$\n28,378 \nTotal assets\n40,567\n \n36,501 \nShort-term debt\n25\n \n25 \nLong-term debt\n790\n \n790 \nShareholders' equity\n15,406\n \n13,935 \nBook value per share\n98.76\n \n89.11 \nDebt-to-total-capital ratio\n5.0\n \n%\n5.5 \n%\nTotal assets at September 30, 2025, increased 11% compared with year-end 2024, and included an increase of 10% in total investments that reflected net purchases and higher fair values for many securities in our equity portfolio. Shareholders' equity increased 11% and book value per share also increased 11% during the first nine months of 2025. Our debt-to-total-capital ratio (capital is the sum of debt plus shareholders' equity) decreased slightly compared with year-end 2024. \nOur value creation ratio is our primary performance metric. As shown in the tables below, that ratio was 13.8% for the first nine months of 2025, compared with 17.8% for the same period in 2024. The decrease was primarily due to a reduction in overall net gains from our investment portfolio. Book value per share increased $9.65 during the first nine months of 2025 and contributed 10.9 percentage points to the value creation ratio, while dividends declared at $2.61 per share contributed 2.9 points. Value creation ratio major contributors and in total, along with calculations from per-share amounts, are shown in the tables below.\n \nThree months ended September 30,\nNine months ended September 30,\n2025\n2024\n2025\n2024\nValue creation ratio major contributors:\n \n \n \n \nNet income before investment gains\n3.1\n \n%\n1.7 \n%\n5.2\n \n%\n5.8 \n%\nChange in fixed-maturity securities, realized and unrealized gains\n1.3\n \n2.5 \n1.8\n \n1.6 \nChange in equity securities, investment gains\n4.7\n \n5.2 \n7.1\n \n10.4 \nOther\n(0.2)\n(0.4)\n(0.3)\n0.0 \n     Value creation ratio\n8.9\n \n%\n9.0 \n%\n13.8\n \n%\n17.8 \n%\n \nCincinnati Financial Corporation Third-Quarter 2025 10-Q\nPage 37\nTable of Contents\n(Dollars are per share)\nThree months ended September 30,\nNine months ended September 30,\n2025\n2024\n2025\n2024\nValue creation ratio:\n \n \n \n \nEnd of period book value*\n$\n98.76\n \n$\n88.32 \n$\n98.76\n \n$\n88.32 \nLess beginning of period book value \n91.46\n \n81.79 \n89.11\n \n77.06 \nChange in book value \n7.30\n \n6.53 \n9.65\n \n11.26 \nDividend declared to shareholders\n0.87\n \n0.81 \n2.61\n \n2.43 \nTotal value creation \n$\n8.17\n \n$\n7.34 \n$\n12.26\n \n$\n13.69 \nValue creation ratio from change in book value**\n8.0\n \n%\n8.0 \n%\n10.9\n \n%\n14.6 \n%\nValue creation ratio from dividends declared to shareholders***\n0.9\n \n1.0 \n2.9\n \n3.2 \nValue creation ratio\n8.9\n \n%\n9.0 \n%\n13.8\n \n%\n17.8 \n%\n    * Book value per share is calculated by dividing end of period total shareholders' equity by end of period shares outstanding\n  ** Change in book value divided by the beginning of period book value \n*** Dividend declared to shareholders divided by beginning of period book value\nDRIVERS OF LONG-TERM VALUE CREATION\nOperating through The Cincinnati Insurance Company, Cincinnati Financial Corporation is one of the 25 largest property casualty insurers in the nation, based on 2024 net written premiums for approximately 2,000 U.S. stock and mutual insurer groups. We market our insurance products through a select group of independent insurance agencies as discussed in our 2024 Annual Report on Form 10-K, Item 1, Our Business and Our Strategy, Page 6. At September 30, 2025, we actively marketed through 2,275 agencies located in 46 states. We maintain a long-term perspective that guides us in addressing immediate challenges or opportunities while focusing on the major decisions that best position our company for success through all market cycles.\nTo measure our long-term progress in creating shareholder value, our value creation ratio is our primary financial performance target. As discussed in our 2024 Annual Report on Form 10-K, Item 7, Executive Summary, Page 46, management believes this measure is a meaningful indicator of our long-term progress in creating shareholder value and has three primary performance drivers:\n•\nPremium growth – We believe our agency relationships and initiatives can lead to a property casualty written premium growth rate over any five-year period that exceeds the industry average. For the first nine months of 2025, our consolidated property casualty net written premium year-over-year growth was 10%, comparing favorably with the industry's 6% growth rate reported by A.M. Best for the first six months of 2025. For the five-year period 2020 through 2024, our growth rate exceeded that of the industry. The industry's growth rate excludes its mortgage and financial guaranty lines of business. \n•\nCombined ratio – We believe our underwriting philosophy and initiatives can generate an average GAAP combined ratio over any five-year period that is consistently within the range of 92% to 98%. For the first nine months of 2025, our GAAP combined ratio was 98.4%, including 14.2 percentage points of current accident year catastrophe losses partially offset by 2.5 percentage points of favorable loss reserve development on prior accident years. Our statutory combined ratio was 97.7% for the first nine months of 2025, comparing unfavorably with the industry's 96.4% reported by A.M. Best for the first six months of 2025. The industry's ratio again excludes its mortgage and financial guaranty lines of business.\n•\nInvestment contribution – We believe our investment philosophy and initiatives can drive investment income growth and lead to a total return on our equity investment portfolio over a five-year period that exceeds the five-year return of the Standard & Poor's 500 Index. For the first nine months of 2025, pretax investment income was $860 million, up 15% compared with the same period in 2024. We believe our investment portfolio mix provides an appropriate balance of income stability and growth with capital appreciation potential. \nCincinnati Financial Corporation Third-Quarter 2025 10-Q\nPage 38\nTable of Contents\nFinancial Strength\nAn important part of our long-term strategy is financial strength, which is described in our 2024 Annual Report on Form 10-K, Item 1, Our Business and Our Strategy, Financial Strength, Page 8. One aspect of our financial strength is prudent use of reinsurance ceded to help manage financial performance variability due to catastrophe loss experience. A description of how we use reinsurance ceded is included in our 2024 Annual Report on Form 10-K, Item 7, Liquidity and Capital Resources, 2025 Reinsurance Ceded Programs, Page 105. Another aspect of our financial strength is our investment portfolio, which remains well-diversified as discussed in this quarterly report in Item 3, Quantitative and Qualitative Disclosures About Market Risk. Our strong parent-company liquidity and financial strength increase our flexibility to maintain a cash dividend through all periods and to continue to invest in and expand our insurance operations. \nAt September 30, 2025, we held $5.579 billion of our cash and cash equivalents and invested assets at the parent-company level, of which $5.052 billion, or 90.6%, was invested in common stocks, and $249 million, or 4.5%, was cash or cash equivalents. Our debt-to-total-capital ratio was 5.0% at September 30, 2025. Another important indicator of financial strength is our ratio of property casualty net written premiums to statutory surplus, which was 1.0-to-1 for the 12 months ended September 30, 2025, matching year-end 2024. \nFinancial strength ratings assigned to us by independent rating firms also are important. In addition to rating our parent company's senior debt, four firms award insurer financial strength ratings to one or more of our insurance subsidiary companies based on their quantitative and qualitative analyses. These ratings primarily assess an insurer's ability to meet financial obligations to policyholders and do not necessarily address all of the matters that may be important to investors. Ratings are under continuous review and subject to change or withdrawal at any time by the rating agency. Each rating should be evaluated independently of any other rating; please see each rating agency's website for its most recent report on our ratings.\nAt October 24, 2025, our insurance subsidiaries continued to be highly rated.\nInsurer Financial Strength Ratings\nRating\nagency\nStandard market property casualty insurance subsidiaries\nLife insurance\n subsidiary\nExcess and surplus lines insurance subsidiary\nOutlook\n \n \nRating\ntier\n \nRating\ntier\n \nRating\ntier\n \nA.M. Best Co.\n \nambest.com\nA+\nSuperior\n2 of 16\nA+\nSuperior\n2 of 16\nA+\nSuperior\n2 of 16\nStable\nFitch Ratings  \n \nfitchratings.com\nAA-\nVery Strong\n4 of 21\nAA-\nVery Strong\n4 of 21\n-\n-\n-\nStable\nMoody's Investors  Service \n \nmoodys.com\nA1\nGood\n5 of 21\n-\n-\n-\n-\n-\n-\nStable\nS&P Global  Ratings \n \nspratings.com\nA+\nStrong\n5 of 21\nA+\nStrong\n5 of 21\n-\n-\n-\nStable\n \nCincinnati Financial Corporation Third-Quarter 2025 10-Q\nPage 39\nTable of Contents\nCONSOLIDATED PROPERTY CASUALTY INSURANCE HIGHLIGHTS\nConsolidated property casualty insurance results include premiums and expenses for our standard market insurance segments (commercial lines and personal lines), our excess and surplus lines segment, Cincinnati Re\n® \nand our London-based global specialty underwriter Cincinnati Global Underwriting Ltd.\nSM\n (Cincinnati Global).\n(Dollars in millions)\nThree months ended September 30,\nNine months ended September 30,\n2025\n2024\n% Change\n2025\n2024\n% Change\nEarned premiums\n$\n2,484\n$\n2,217\n12 \n$\n7,145\n$\n6,284\n14 \nFee revenues\n4\n3\n33 \n11\n9\n22 \nTotal revenues\n2,488\n2,220\n12 \n7,156\n6,293\n14 \nLoss and loss expenses from:\n \n \n \n \n \n \nCurrent accident year before catastrophe losses\n1,375\n1,264\n9 \n4,099\n3,683\n11 \nCurrent accident year catastrophe losses\n111\n306\n(64)\n1,015\n709\n43 \nPrior accident years before catastrophe losses\n(6)\n(53)\n89 \n(113)\n(140)\n19 \nPrior accident years catastrophe losses\n(16)\n(18)\n11 \n(63)\n(71)\n11 \nLoss and loss expenses\n1,464\n1,499\n(2)\n4,938\n4,181\n18 \nUnderwriting expenses\n731\n659\n11 \n2,095\n1,884\n11 \nUnderwriting profit \n$\n293\n$\n62\n373 \n$\n123\n$\n228\n(46)\nRatios as a percent of earned premiums:\n \n \nPt. Change\n \n \nPt. Change\n    Current accident year before catastrophe losses\n55.4\n \n%\n57.0 \n%\n(1.6)\n57.4\n \n%\n58.6 \n%\n(1.2)\n    Current accident year catastrophe losses\n4.4\n \n13.8 \n(9.4)\n14.2\n \n11.2 \n3.0 \n    Prior accident years before catastrophe losses\n(0.2)\n(2.4)\n2.2 \n(1.6)\n(2.2)\n0.6 \n    Prior accident years catastrophe losses\n(0.7)\n(0.8)\n0.1 \n(0.9)\n(1.1)\n0.2 \nLoss and loss expenses\n58.9\n \n67.6 \n(8.7)\n69.1\n \n66.5 \n2.6 \nUnderwriting expenses\n29.3\n \n29.8 \n(0.5)\n29.3\n \n30.0 \n(0.7)\nCombined ratio\n88.2\n \n%\n97.4 \n%\n(9.2)\n98.4\n \n%\n96.5 \n%\n1.9 \nCombined ratio\n88.2\n \n%\n97.4 \n%\n(9.2)\n98.4\n \n%\n96.5 \n%\n1.9 \nContribution from catastrophe losses and prior years reserve development\n3.5\n \n10.6 \n(7.1)\n11.7\n \n7.9 \n3.8 \nCombined ratio before catastrophe losses and prior years reserve development\n84.7\n \n%\n86.8 \n%\n(2.1)\n86.7\n \n%\n88.6 \n%\n(1.9)\n \nOur consolidated property casualty insurance operations generated an underwriting profit of $293 million for the third quarter and $123 million for the first nine months of 2025. The third-quarter 2025 underwriting profit increase of $231 million, compared with third-quarter 2024, included a favorable decrease of $193 million in losses from catastrophes, mostly caused by severe weather, partially offset by a lower amount of total favorable reserve development on prior accident years. The change in underwriting profitability for the third quarter of 2025 also included a favorable effect from higher current accident year loss and loss expenses before catastrophe losses that grew slower than earned premiums. The nine-month underwriting profit of $123 million, compared with an underwriting profit of $228 million for the first nine months of 2024, included an unfavorable increase of $306 million in current accident year catastrophe losses, mostly caused by the January 2025 wildfires in southern California, and a lower amount of total favorable reserve development on prior accident years. For the first nine months of 2025, the combined ratio before catastrophe losses and prior years reserve development improved by 1.9 percentage points compared with the same period of 2024.\nCincinnati Financial Corporation Third-Quarter 2025 10-Q\nPage 40\nTable of Contents\nUnderwriting results for the third quarter and first nine months of 2025 included improved current accident year loss experience before catastrophe losses, as price increases have helped to offset recent-year elevated paid losses reflecting economic or other forms of inflation. Elevated inflation was a driver of higher losses and loss expenses in recent years as costs have increased significantly to repair damaged autos or other property that we insure. We also experienced higher losses for liability coverages for some of our lines of business. Due to increased uncertainty regarding ultimate losses, we intend to remain prudent in reserving for estimated ultimate losses until longer-term loss cost trends become more clear. The higher loss experience is discussed in Financial Results by property casualty insurance segment. We believe future property casualty underwriting results will continue to benefit from price increases and our ongoing initiatives to improve pricing precision and loss experience related to claims and loss control practices.\nFor all property casualty lines of business in aggregate, net loss and loss expense reserves at September 30, 2025, were $1.076 billion, or 11%, higher than at year-end 2024, including an increase of $900 million for the incurred but not reported (IBNR) portion.\nWe measure and analyze property casualty underwriting results primarily by the combined ratio and its component ratios. The GAAP-basis combined ratio is the percentage of incurred losses plus all expenses per each earned premium dollar – the lower the ratio, the better the performance. An underwriting profit results when the combined ratio is below 100%. A combined ratio above 100% indicates that an insurance company's losses and expenses exceeded premiums.\nOur consolidated property casualty combined ratio for the third quarter of 2025 decreased by 9.2 percentage points, compared with the same period of 2024, including a decrease of 9.3 points from catastrophe losses and loss expenses. For the first nine months of 2025, compared with the 2024 nine-month period, our combined ratio increased by 1.9 percentage points, including an increase of 3.2 points from catastrophe losses and loss expenses. Other combined ratio components that changed are discussed below and in further detail in Financial Results by property casualty insurance segment.\n \nThe combined ratio can be affected significantly by natural catastrophe losses and other large losses as discussed in detail below. The combined ratio can also be affected by updated estimates of loss and loss expense reserves established for claims that occurred in prior periods, referred to as prior accident years. Net favorable development on prior accident year reserves, including reserves for catastrophe losses, benefited the combined ratio by 2.5 percentage points in the first nine months of 2025, compared with 3.3 percentage points in the same period of 2024. Net favorable development is discussed in further detail in Financial Results by property casualty insurance segment.\n \nThe ratio for current accident year loss and loss expenses before catastrophe losses improved in the first nine months of 2025. That 57.4% ratio was 1.2 percentage points lower, compared with the 58.6% accident year 2024 ratio measured as of September 30, 2024, including an increase of 0.2 points in the ratio for large losses of $2 million or more per claim, discussed below. The ratio improvement of 1.2 percentage points included an increase of 1.0 points for the IBNR portion and a decrease of 2.2 points for the case incurred portion. It also included an unfavorable 0.4 points for the net effect of $49 million for reinsurance treaty reinstatement premiums related to the January 2025 wildfires in southern California.\n \nThe underwriting expense ratio decreased for the third quarter and first nine months of 2025, compared with the same periods a year ago. The decreases were primarily due to premium growth outpacing growth in various expenses. The nine-month 2025 ratio also included an unfavorable 0.2 points for the effect of reinstatement premiums. The ratio for both periods also included ongoing expense management efforts.\nCincinnati Financial Corporation Third-Quarter 2025 10-Q\nPage 41\nTable of Contents\nConsolidated Property Casualty Insurance Premiums\n(Dollars in millions)\nThree months ended September 30,\nNine months ended September 30,\n2025\n2024\n% Change\n2025\n2024\n% Change\nAgency renewal written premiums\n$\n2,037\n \n$\n1,795 \n13 \n$\n6,084\n \n$\n5,321 \n14 \nAgency new business written premiums\n356\n \n406 \n(12)\n1,143\n \n1,159 \n(1)\nOther written premiums\n100\n \n92 \n9 \n494\n \n520 \n(5)\nNet written premiums\n2,493\n \n2,293 \n9 \n7,721\n \n7,000 \n10 \nUnearned premium change\n(9)\n(76)\n88 \n(576)\n(716)\n20 \nEarned premiums\n$\n2,484\n \n$\n2,217 \n12 \n$\n7,145\n \n$\n6,284 \n14 \n \nThe trends in net written premiums and earned premiums summarized in the table above include the effects of price increases. Price change trends that heavily influence renewal written premium increases or decreases, along with other premium growth drivers for 2025, are discussed in more detail by segment below in Financial Results. \n \nConsolidated property casualty net written premiums for the third quarter and nine months ended September 30, 2025, grew $200 million and $721 million compared with the same periods of 2024. Our premium growth initiatives from prior years have provided an ongoing favorable effect on growth during the current year, particularly as newer agency relationships mature over time. \nConsolidated property casualty agency new business written premiums decreased by $50 million for the third quarter and $16 million for the first nine months of 2025, compared with the same periods of 2024, largely driven by the personal lines segment. Consolidated property casualty new business written premiums for third-quarter 2025 decreased 12% compared with a 30% increase in the third quarter of 2024. New agency appointments during 2025 and 2024 produced a $72 million increase in standard lines new business for the first nine months of 2025 compared with the same period of 2024. As we appoint new agencies that choose to move accounts to us, we report these accounts as new business. While this business is new to us, in many cases it is not new to the agent. We believe these seasoned accounts tend to be priced more accurately than business that may be less familiar to our agent upon obtaining it from a competing agent.\nNet written premiums for Cincinnati Re, included in other written premiums, decreased by $2 million in the third quarter and increased $7 million for the nine months ended September 30, 2025, compared with the same periods of 2024, to $87 million and $505 million, respectively. Cincinnati Re assumes risks through reinsurance treaties and in some cases cedes part of the risk and related premiums to one or more unaffiliated reinsurance companies through transactions known as retrocessions. \n \nCincinnati Global is also included in other written premiums. Net written premiums for Cincinnati Global increased by $5 million in the third quarter and $29 million for the nine months ended September 30, 2025, to $82 million and $255 million, respectively, compared with the same periods of 2024.\nCincinnati Financial Corporation Third-Quarter 2025 10-Q\nPage 42\nTable of Contents\nOther written premiums include premiums ceded to reinsurers as part of our reinsurance ceded program. A decrease in ceded premiums increased net written premiums by $6 million for the third quarter and an increase in ceded premiums decreased net written premiums by $69 million for the first nine months of 2025, compared with the same periods of 2024. Other written premiums for the first nine months of 2025 included a net unfavorable amount of $49 million for reinsurance treaty reinstatement premiums related to the California wildfires, including a favorable $14 million for Cincinnati Re and an unfavorable $63 million for our personal lines insurance segment. \nCatastrophe losses and loss expenses typically have a material effect on property casualty results and can vary significantly from period to period. Losses from catastrophes contributed 3.7 and 13.3 percentage points to the combined ratio in the third quarter and first nine months of 2025, compared with 13.0 and 10.1 percentage points in the same periods of 2024. During the third quarter of 2025, there were no material changes to our estimates of ultimate losses related to the California wildfires.\nNet losses from catastrophes for the first nine months of 2025 included recoveries from reinsurers that participate in our primary property catastrophe reinsurance treaty. There were no material changes during the third quarter to the estimated recovery of $429 million as of March 31, 2025, related to the California wildfires.\nEffective July 1, 2025, we purchased an additional layer on our property catastrophe reinsurance treaty with a limit of $300 million, increasing the total limit from $1.500 billion to $1.800 billion. We retain 57.2% of losses between $1.500 billion and $1.800 billion. The provisions of this additional layer are similar to those included in the other layers. The annual ceded premiums for this additional coverage are estimated to be less than $5 million.\nEffective June 1, 2025, we renewed the reinsurance program for Cincinnati Re only, which provides retrocession coverages with various triggers, exclusions and unique features. The program includes property catastrophe excess of loss coverage in excess of $90 million per occurrence with a total available limit of $73 million per occurrence. Ceded premiums for the one-year renewal period of coverage from the program are estimated to be approximately $16 million. There were no material changes during the third quarter to the estimated recovery of $38 million as of March 31, 2025, related to the California wildfires for the Cincinnati Re only program effective June 1, 2024, which expired during the second quarter.\nCincinnati Financial Corporation Third-Quarter 2025 10-Q\nPage 43\nTable of Contents\nThe following table shows consolidated property casualty insurance catastrophe losses and loss expenses incurred, net of reinsurance, as well as the effect of loss development on prior period catastrophe events. We individually list declared catastrophe events for which our incurred losses reached or exceeded $25 million. \nConsolidated Property Casualty Insurance Catastrophe Losses and Loss Expenses Incurred\n(Dollars in millions, net of reinsurance)\nThree months ended September 30,\nNine months ended September 30,\n \n \nComm.\nPers.\nE&S\n \nComm.\nPers.\nE&S\n \nDates\nRegion\nlines\nlines\nlines\nOther\nTotal\nlines\nlines\nlines\nOther\nTotal\n2025\n \n \n \n \n \nJan. 7-28\nWest\n$\n—\n \n$\n1\n \n$\n—\n \n$\n—\n \n$\n1\n \n$\n—\n \n$\n325\n \n$\n—\n \n$\n123\n \n$\n448\n \nMar. 14-17\nMidwest, Northeast, South\n4\n \n7\n \n—\n \n—\n \n11\n \n52\n \n96\n \n1\n \n2\n \n151\n \nApr. 1-7\nMidwest, South\n(2)\n(7)\n—\n \n—\n \n(9)\n17\n \n34\n \n—\n \n—\n \n51\n \nMay 15-16\nMidwest, Northeast\n7\n \n19\n \n—\n \n2\n \n28\n \n29\n \n83\n \n1\n \n2\n \n115\n \nAll other 2025 catastrophes\n28\n \n48\n \n—\n \n4\n \n80\n \n83\n \n157\n \n2\n \n8\n \n250\n \nDevelopment on 2024 and prior\n catastrophes\n(5)\n(8)\n—\n \n(3)\n(16)\n(22)\n(34)\n(1)\n(6)\n(63)\nCalendar year incurred total\n$\n32\n \n$\n60\n \n$\n—\n \n$\n3\n \n$\n95\n \n$\n159\n \n$\n661\n \n$\n3\n \n$\n129\n \n$\n952\n \n2024\n \n \n \n \n \nMar. 12-17\nMidwest, South\n$\n(4)\n$\n4 \n$\n— \n$\n— \n$\n— \n$\n30 \n$\n32 \n$\n— \n$\n— \n$\n62 \nMar. 31 - Apr. 4\nMidwest, Northeast, South\n(4)\n2 \n— \n— \n(2)\n10 \n24 \n— \n— \n34 \nMay 6-10\nMidwest, South\n— \n2 \n1 \n— \n3 \n19 \n30 \n1 \n— \n50 \nMay 25-26\nMidwest, South\n2 \n1 \n1 \n— \n4 \n38 \n29 \n2 \n— \n69 \nJul. 13 - 18\nMidwest, Northeast\n18 \n11 \n— \n— \n29 \n18 \n11 \n— \n— \n29 \nSep. 25 - 28\nMidwest, South (Helene)\n35 \n117 \n— \n26 \n178 \n35 \n117 \n— \n26 \n178 \nAll other 2024 catastrophes\n18 \n49 \n— \n27 \n94 \n101 \n153 \n3 \n30 \n287 \nDevelopment on 2023 and prior \ncatastrophes\n(5)\n(5)\n— \n(8)\n(18)\n(20)\n(32)\n— \n(19)\n(71)\nCalendar year incurred total\n$\n60 \n$\n181 \n$\n2 \n$\n45 \n$\n288 \n$\n231 \n$\n364 \n$\n6 \n$\n37 \n$\n638 \nCincinnati Financial Corporation Third-Quarter 2025 10-Q\nPage 44\nTable of Contents\nThe following table includes data for losses incurred of $2 million or more per claim, net of reinsurance.\n \nConsolidated Property Casualty Insurance Losses Incurred by Size\n(Dollars in millions, net of reinsurance)\nThree months ended September 30,\nNine months ended September 30,\n2025\n2024\n% Change\n2025\n2024\n% Change\nCurrent accident year losses greater than $5 million\n$\n48\n \n$\n18 \n167 \n$\n89\n \n$\n49 \n82 \nCurrent accident year losses $2 million - $5 million\n35\n \n51 \n(31)\n95\n \n101 \n(6)\nLarge loss prior accident year reserve development\n49\n \n19 \n158 \n132\n \n56 \n136 \nTotal large losses incurred\n132\n \n88 \n50 \n316\n \n206 \n53 \nLosses incurred but not reported\n158\n \n185 \n(15)\n650\n \n601 \n8 \nOther losses excluding catastrophe losses\n831\n \n711 \n17 \n2,260\n \n2,129 \n6 \nCatastrophe losses\n83\n \n282 \n(71)\n921\n \n621 \n48 \nTotal losses incurred\n$\n1,204\n \n$\n1,266 \n(5)\n$\n4,147\n \n$\n3,557 \n17 \nRatios as a percent of earned premiums:\n \n \nPt. Change\n \n \nPt. Change\nCurrent accident year losses greater than $5 million\n1.9\n \n%\n0.9 \n%\n1.0 \n1.3\n \n%\n0.8 \n%\n0.5 \nCurrent accident year losses $2 million - $5 million\n1.4\n \n2.3 \n(0.9)\n1.3\n \n1.6 \n(0.3)\nLarge loss prior accident year reserve development\n2.0\n \n0.8 \n1.2 \n1.8\n \n0.9 \n0.9 \nTotal large loss ratio\n5.3\n \n4.0 \n1.3 \n4.4\n \n3.3 \n1.1 \nLosses incurred but not reported\n6.4\n \n8.4 \n(2.0)\n9.1\n \n9.6 \n(0.5)\nOther losses excluding catastrophe losses\n33.4\n \n32.0 \n1.4 \n31.6\n \n33.8 \n(2.2)\nCatastrophe losses\n3.4\n \n12.7 \n(9.3)\n12.9\n \n9.9 \n3.0 \nTotal loss ratio\n48.5\n \n%\n57.1 \n%\n(8.6)\n58.0\n \n%\n56.6 \n%\n1.4 \n \nWe believe the inherent variability of aggregate loss experience for our portfolio of larger policies is greater than that of our portfolio of smaller policies, and we continue to monitor the variability in addition to general inflationary trends in loss costs. Our analysis continues to indicate no unexpected concentration of large losses and case reserve increases by risk category, geographic region, policy inception, agency or field marketing territory. The third-quarter 2025 property casualty total large losses incurred of $132 million, net of reinsurance, was higher than the $70 million quarterly average during full-year 2024 and the $88 million experienced for the third quarter of 2024. The ratio for these large losses was 1.3 percentage points higher compared with last year's third quarter. The third-quarter 2025 amount of total large losses incurred unfavorably contributed to the increase in the nine-month 2025 total large loss ratio, compared with 2024, in addition to a first-half 2025 ratio that was 1.1 points higher than the first half of 2024. We believe results for the three- and nine-month periods largely reflected normal fluctuations in loss patterns and normal variability in large case reserves for claims above $2 million. Losses by size are discussed in further detail in results of operations by property casualty insurance segment.\n \nFINANCIAL RESULTS\nConsolidated results reflect the operating results of each of our five segments along with the parent company, Cincinnati Re, Cincinnati Global and other activities reported as \"Other.\" The five segments are:\n•\nCommercial lines insurance\n•\nPersonal lines insurance\n•\nExcess and surplus lines insurance\n•\nLife insurance\n•\nInvestments\nCincinnati Financial Corporation Third-Quarter 2025 10-Q\nPage 45\nTable of Contents\nCOMMERCIAL LINES INSURANCE RESULTS\n(Dollars in millions)\nThree months ended September 30,\nNine months ended September 30,\n2025\n2024\n% Change\n2025\n2024\n% Change\nEarned premiums\n$\n1,229\n \n$\n1,137 \n8 \n$\n3,620\n \n$\n3,326 \n9 \nFee revenues\n2\n \n1 \n100 \n4\n \n3 \n33 \nTotal revenues\n1,231\n \n1,138 \n8 \n3,624\n \n3,329 \n9 \nLoss and loss expenses from:\n \n \n \n \n \n \nCurrent accident year before catastrophe losses\n728\n \n691 \n5 \n2,171\n \n2,037 \n7 \nCurrent accident year catastrophe losses\n37\n \n65 \n(43)\n181\n \n251 \n(28)\nPrior accident years before catastrophe losses\n(13)\n(45)\n71 \n(81)\n(97)\n16 \nPrior accident years catastrophe losses\n(5)\n(5)\n0 \n(22)\n(20)\n(10)\nLoss and loss expenses\n747\n \n706 \n6 \n2,249\n \n2,171 \n4 \nUnderwriting expenses\n373\n \n351 \n6 \n1,080\n \n1,028 \n5 \nUnderwriting profit\n$\n111\n \n$\n81 \n37 \n$\n295\n \n$\n130 \n127 \nRatios as a percent of earned premiums:\n \n \nPt. Change\n \n \nPt. Change\nCurrent accident year before catastrophe losses\n59.2\n \n%\n60.7 \n%\n(1.5)\n60.0\n \n%\n61.3 \n%\n(1.3)\nCurrent accident year catastrophe losses\n3.0\n \n5.8 \n(2.8)\n5.0\n \n7.5 \n(2.5)\nPrior accident years before catastrophe losses\n(1.0)\n(4.0)\n3.0 \n(2.2)\n(2.9)\n0.7 \nPrior accident years catastrophe losses\n(0.4)\n(0.4)\n0.0 \n(0.6)\n(0.6)\n0.0 \nLoss and loss expenses\n60.8\n \n62.1 \n(1.3)\n62.2\n \n65.3 \n(3.1)\nUnderwriting expenses\n30.3\n \n30.9 \n(0.6)\n29.8\n \n30.9 \n(1.1)\nCombined ratio\n91.1\n \n%\n93.0 \n%\n(1.9)\n92.0\n \n%\n96.2 \n%\n(4.2)\nCombined ratio\n91.1\n \n%\n93.0 \n%\n(1.9)\n92.0\n \n%\n96.2 \n%\n(4.2)\nContribution from catastrophe losses and prior years reserve development\n1.6\n \n1.4 \n0.2 \n2.2\n \n4.0 \n(1.8)\nCombined ratio before catastrophe losses and prior years reserve development\n89.5\n \n%\n91.6 \n%\n(2.1)\n89.8\n \n%\n92.2 \n%\n(2.4)\n \nOverview\nPerformance highlights for the commercial lines segment include:\n•\nPremiums – Earned premiums and net written premiums for the commercial lines segment grew during the third quarter and first nine months of 2025, compared with the same periods a year ago, primarily due to agency renewal written premium growth that continued to include higher average pricing. The table below analyzes the primary components of premiums. We continue to use predictive analytics tools to improve pricing precision and segmentation while leveraging our local relationships with agents through the efforts of our teams that work closely with them. We seek to maintain appropriate pricing discipline for both new and renewal business as our agents and underwriters assess account quality to make careful decisions on a policy-by-policy basis whether to write or renew a policy. \nAgency renewal written premiums increased 6% for the third quarter and 7% for the first nine months of 2025, compared with the same periods of 2024, including price increases. During the third quarter of 2025, our overall standard commercial lines policies averaged estimated renewal price increases at percentages in the mid-single-digit range. We continue to segment commercial lines policies, emphasizing identification and retention of those we believe have relatively stronger pricing. Conversely, we have been seeking stricter renewal terms and conditions on policies we believe have relatively weaker pricing, thus retaining fewer of those policies. We measure average changes in commercial lines renewal pricing as the percentage rate of change in renewal premium for the new policy period compared with the premium for the expiring policy period, assuming no change in the level of insured exposures or policy coverage between those periods for the respective policies.\nCincinnati Financial Corporation Third-Quarter 2025 10-Q\nPage 46\nTable of Contents\nOur average overall commercial lines renewal pricing change includes the impact of flat pricing for certain coverages within package policies written for a three-year term that were in force but did not expire during the period being measured. Therefore, our reported change in average commercial lines renewal pricing reflects a blend of three-year policies that did not expire and other policies that did expire during the measurement period. For commercial lines policies that did expire and were then renewed during the third quarter of 2025, we estimate that our average percentage price increases were in the mid-single-digit range for our commercial casualty, commercial property and commercial auto lines of business. The estimated average percentage price change for workers' compensation was a decrease in the mid-single-digit range.\nOur commercial lines segment's increase in agency renewal written premiums for the first nine months of 2025 also included changes in the level of insured exposures. Part of the insured exposure increase reflects our response to inflation effects that increase the cost of building materials to repair damaged commercial structures. We use building valuation software to automate much of that underwriting process and may also manually adjust premiums to reflect property costs. \nRenewal premiums for certain policies, primarily our commercial casualty and workers' compensation lines of business, include the results of policy audits that adjust initial premium amounts based on differences between estimated and actual sales or payroll related to a specific policy. Audits completed during the first nine months of 2025 contributed $70 million to net written premiums, compared with $81 million for the same period of 2024. \nNew business written premiums for commercial lines decreased $2 million for the third quarter, but increased $26 million during the first nine months of 2025, compared with the same periods of 2024, as we continued to carefully underwrite each policy in a highly competitive market. Trend analysis for year-over-year comparisons of individual quarters is more difficult to assess for commercial lines new business written premiums, due to inherent variability. That variability is often driven by larger policies with annual premiums greater than $100,000. \nOther written premiums include premiums ceded to reinsurers as part of our reinsurance ceded program. For our commercial lines insurance segment, a decrease in ceded premiums increased net written premiums by approximately $5 million and $11 million for the third quarter and first nine months of 2025, compared with the same periods of 2024.\nCommercial Lines Insurance Premiums\n(Dollars in millions)\nThree months ended September 30,\nNine months ended September 30,\n2025\n2024\n% Change\n2025\n2024\n% Change\nAgency renewal written premiums\n$\n1,043\n \n$\n987 \n6 \n$\n3,311\n \n$\n3,086 \n7 \nAgency new business written premiums\n185\n \n187 \n(1)\n588\n \n562 \n5 \nOther written premiums\n(30)\n(36)\n17 \n(86)\n(101)\n15 \nNet written premiums\n1,198\n \n1,138 \n5 \n3,813\n \n3,547 \n7 \nUnearned premium change\n31\n \n(1)\nnm\n(193)\n(221)\n13 \nEarned premiums\n$\n1,229\n \n$\n1,137 \n8 \n$\n3,620\n \n$\n3,326 \n9 \n \n•\nCombined ratio – The third-quarter 2025 commercial lines combined ratio improved by 1.9 percentage points, compared with the third quarter of 2024, including a decrease of 2.8 points in losses from catastrophes. The third-quarter combined ratio decreased by 1.5 points from current accident year loss and loss expenses before catastrophe losses, including a decrease of 0.9 points for the IBNR portion and a decrease of 0.6 points for the case incurred portion. For the first nine months of 2025, the combined ratio improved by 4.2 percentage points, compared with the same period a year ago, including a decrease of 2.5 points in losses from catastrophes. The nine-month 2025 combined ratio also included a decrease of 1.3 points from current accident year loss and loss expenses before catastrophe losses, including an increase of 1.5 points for the IBNR portion and a decrease of 2.8 points for the case incurred portion. Underwriting results also included favorable reserve development on prior accident years, as discussed below. The current accident year ratios were measured as of September 30 of the respective years and included a ratio for large losses of $2 million or more per claim, discussed below, for the first nine months of 2025 that matched the same period of 2024. \nWhen estimating the ultimate cost of total loss and loss expenses, we consider many factors, including trends for inflation, historical paid and reported losses, large loss activity and other data or information for the industry or our company. Elevated inflation in recent years has been a driver of higher losses and loss expenses as costs have increased significantly to repair damaged business properties or autos that we insure, in addition to \nCincinnati Financial Corporation Third-Quarter 2025 10-Q\nPage 47\nTable of Contents\nhigher losses for liability coverages for some of our lines of business. Due to increased uncertainty regarding ultimate losses, we intend to remain prudent in reserving for estimated ultimate losses until longer-term loss cost trends become more clear.\nCatastrophe losses and loss expenses accounted for 2.6 and 4.4 percentage points of the combined ratio for the third quarter and first nine months of 2025, compared with 5.4 and 6.9 percentage points for the same periods a year ago. Through 2024, the 10-year annual average for that catastrophe measure for the commercial lines segment was 6.0 percentage points, and the five-year annual average was 6.6 percentage points. \nThe net effect of reserve development on prior accident years during the third quarter and first nine months of 2025 was favorable for commercial lines overall by $18 million and $103 million, compared with $50 million and $117 million for the same periods in 2024. For the first nine months of 2025, our commercial property and workers' compensation lines of business were the main contributors to the commercial lines net favorable reserve development, while our commercial casualty and commercial auto lines of business included net unfavorable development. The net favorable reserve development recognized during the first nine months of 2025 for our commercial lines insurance segment was mainly for accident years 2024 and 2023 and was primarily due to lower-than-anticipated loss emergence on known claims. Our commercial casualty line of business included $21 million of unfavorable reserve development on prior accident years for the first nine months of 2025 while commercial auto included $35 million. Reserve estimates are inherently uncertain as described in our 2024 Annual Report on Form 10-K, Item 7, Critical Accounting Estimates, Property Casualty Insurance Loss and Loss Expense Reserves, Page 51.\nThe commercial lines underwriting expense ratio decreased for the third quarter and first nine months of 2025, compared with the same periods a year ago. The decreases were primarily due to premium growth outpacing growth in various expenses. The ratio for both periods also included ongoing expense management efforts.\nCommercial Lines Insurance Losses Incurred by Size\n(Dollars in millions, net of reinsurance)\nThree months ended September 30,\nNine months ended September 30,\n2025\n2024\n% Change\n2025\n2024\n% Change\nCurrent accident year losses greater than $5 million\n$\n48\n \n$\n11 \n336 \n$\n60\n \n$\n42 \n43 \nCurrent accident year losses $2 million - $5 million\n12\n \n36 \n(67)\n49\n \n58 \n(16)\nLarge loss prior accident year reserve development\n47\n \n20 \n135 \n105\n \n54 \n94 \nTotal large losses incurred\n107\n \n67 \n60 \n214\n \n154 \n39 \nLosses incurred but not reported\n67\n \n117 \n(43)\n336\n \n365 \n(8)\nOther losses excluding catastrophe losses\n405\n \n337 \n20 \n1,106\n \n1,089 \n2 \nCatastrophe losses\n29\n \n58 \n(50)\n152\n \n223 \n(32)\nTotal losses incurred\n$\n608\n \n$\n579 \n5 \n$\n1,808\n \n$\n1,831 \n(1)\nRatios as a percent of earned premiums:\n \n \nPt. Change\n \n \nPt. Change\nCurrent accident year losses greater than $5 million\n3.9\n \n%\n1.0 \n%\n2.9 \n1.7\n \n%\n1.3 \n%\n0.4 \nCurrent accident year losses $2 million - $5 million\n1.0\n \n3.2 \n(2.2)\n1.3\n \n1.7 \n(0.4)\nLarge loss prior accident year reserve development\n3.8\n \n1.7 \n2.1 \n2.9\n \n1.6 \n1.3 \nTotal large loss ratio\n8.7\n \n5.9 \n2.8 \n5.9\n \n4.6 \n1.3 \nLosses incurred but not reported\n5.4\n \n10.3 \n(4.9)\n9.3\n \n11.0 \n(1.7)\nOther losses excluding catastrophe losses\n33.0\n \n29.7 \n3.3 \n30.5\n \n32.8 \n(2.3)\nCatastrophe losses\n2.4\n \n5.1 \n(2.7)\n4.2\n \n6.7 \n(2.5)\nTotal loss ratio\n49.5\n \n%\n51.0 \n%\n(1.5)\n49.9\n \n%\n55.1 \n%\n(5.2)\nCincinnati Financial Corporation Third-Quarter 2025 10-Q\nPage 48\nTable of Contents\nWe continue to monitor new losses and case reserve increases greater than $2 million for trends in factors such as initial reserve levels, loss cost inflation and claim settlement expenses. Our analysis continues to indicate no unexpected concentration of these large losses and case reserve increases by risk category, geographic region, policy inception, agency or field marketing territory. The third-quarter 2025 commercial lines total large losses incurred of $107 million, net of reinsurance, was higher than the quarterly average of $49 million during full-year 2024 and the $67 million of total large losses incurred for the third quarter of 2024. The increase in commercial lines large losses for the first nine months of 2025 was primarily due to our commercial property line of business. The third-quarter 2025 ratio for commercial lines total large losses was 2.8 percentage points higher than last year's third-quarter ratio. The third-quarter 2025 amount of total large losses incurred unfavorably contributed to the increase in the nine-month 2025 total large loss ratio, compared with 2024, in addition to a first-half 2025 ratio that was 0.5 points higher than the first half of 2024. We believe results for the three- and nine-month periods largely reflected normal fluctuations in loss patterns and normal variability in large case reserves for claims above $2 million. \nPERSONAL LINES INSURANCE RESULTS\n(Dollars in millions)\nThree months ended September 30,\nNine months ended September 30,\n2025\n2024\n% Change\n2025\n2024\n% Change\nEarned premiums\n$\n838\n \n$\n678 \n24 \n$\n2,340\n \n$\n1,897 \n23 \nFee revenues\n1\n \n2 \n(50)\n4\n \n4 \n0 \nTotal revenues\n839\n \n680 \n23 \n2,344\n \n1,901 \n23 \nLoss and loss expenses from:\n \n \n \n \n \n \nCurrent accident year before catastrophe losses\n425\n \n367 \n16 \n1,280\n \n1,052 \n22 \nCurrent accident year catastrophe losses\n68\n \n186 \n(63)\n695\n \n396 \n76 \nPrior accident years before catastrophe losses\n22\n \n5 \n340 \n10\n \n5 \n100 \nPrior accident years catastrophe losses\n(8)\n(5)\n(60)\n(34)\n(32)\n(6)\nLoss and loss expenses\n507\n \n553 \n(8)\n1,951\n \n1,421 \n37 \nUnderwriting expenses\n233\n \n196 \n19 \n665\n \n554 \n20 \nUnderwriting profit (loss)\n$\n99\n \n$\n(69)\nnm\n$\n(272)\n$\n(74)\n(268)\nRatios as a percent of earned premiums:\n \n \nPt. Change\n \n \nPt. Change\nCurrent accident year before catastrophe losses\n50.7\n \n%\n54.0 \n%\n(3.3)\n54.7\n \n%\n55.4 \n%\n(0.7)\nCurrent accident year catastrophe losses\n8.0\n \n27.4 \n(19.4)\n29.7\n \n20.9 \n8.8 \nPrior accident years before catastrophe losses\n2.6\n \n0.9 \n1.7 \n0.4\n \n0.3 \n0.1 \nPrior accident years catastrophe losses\n(0.9)\n(0.8)\n(0.1)\n(1.4)\n(1.7)\n0.3 \nLoss and loss expenses\n60.4\n \n81.5 \n(21.1)\n83.4\n \n74.9 \n8.5 \nUnderwriting expenses\n27.8\n \n28.8 \n(1.0)\n28.4\n \n29.2 \n(0.8)\nCombined ratio\n88.2\n \n%\n110.3 \n%\n(22.1)\n111.8\n \n%\n104.1 \n%\n7.7 \nCombined ratio\n88.2\n \n%\n110.3 \n%\n(22.1)\n111.8\n \n%\n104.1 \n%\n7.7 \nContribution from catastrophe losses and prior years reserve development\n9.7\n \n27.5 \n(17.8)\n28.7\n \n19.5 \n9.2 \nCombined ratio before catastrophe losses and prior years reserve development\n78.5\n \n%\n82.8 \n%\n(4.3)\n83.1\n \n%\n84.6 \n%\n(1.5)\nOverview\nPerformance highlights for the personal lines segment include:\n•\nPremiums – Personal lines earned premiums and net written premiums continued to grow during the third quarter and first nine months of 2025, primarily due to agency renewal written premium growth that included higher average pricing. Cincinnati Private Client\nSM\n net written premiums included in the personal lines insurance segment results totaled approximately $572 million and $1.526 billion for the third quarter and first nine months of 2025, compared with $479 million and $1.281 billion for the same periods of 2024. Direct written premiums for Cincinnati Private Client policies grew 23% for the first nine months of 2025 compared with the same period \nCincinnati Financial Corporation Third-Quarter 2025 10-Q\nPage 49\nTable of Contents\nof 2024. Cincinnati Private Client net written premiums for the respective periods included excess and surplus lines homeowner policies with premiums totaling $47 million in the third quarter and $94 million in the first nine months of 2025, compared with $46 million in the third quarter and $131 million in the first nine months of 2024. The table below analyzes the primary components of premiums.\nAgency renewal written premiums increased 24% and 26% for the third quarter and first nine months of 2025, reflecting rate increases in selected states, a higher level of insured exposures and other factors such as changes in policy deductibles or mix of business. Part of the insured exposure increase reflects our response to inflation effects that increase the cost of building materials used to repair damaged homes.  \nWe estimate that premium rates for our personal auto line of business increased at average percentages in the high-single-digit range during the first nine months of 2025. For our homeowner line of business, we estimate that premium rates for the first nine months of 2025 increased at average percentages in the low-double-digit range. For both our personal auto and homeowner lines of business, some individual policies experienced lower or higher rate changes based on each risk's specific characteristics and enhanced pricing precision enabled by predictive models.\nPersonal lines new business written premiums decreased $49 million or 30% for the third quarter of 2025, compared with the same period of 2024, including approximately $28 million from Cincinnati Private Client policies and $21 million from middle-market policies. Cincinnati Private Client new business premiums from California decreased approximately $9 million for the third quarter of 2025 compared with the prior year. For the first nine months of 2025, compared with the same period of 2024, personal lines new business written premiums decreased $66 million, or 15%, including approximately $31 million from Cincinnati Private Client policies and $35 million from middle-market policies. We believe we maintained underwriting and pricing discipline across all personal lines markets as we expanded use of enhanced pricing precision tools.  \nOther written premiums include premiums ceded to reinsurers as part of our reinsurance ceded program. For our personal lines insurance segment, an increase in 2025 ceded premiums reduced net written premiums by approximately $1 million and $71 million for the third quarter and first nine months of 2025, compared with the same periods of 2024. Ceded premiums for the first nine months of 2025 included a net amount of $63 million for reinsurance reinstatement premiums related to the January 2025 wildfires in southern California. The $63 million of reinstatement premiums included $61 million for our homeowner line of business.\n \nPersonal Lines Insurance Premiums\n(Dollars in millions)\nThree months ended September 30,\nNine months ended September 30,\n2025\n2024\n% Change\n2025\n2024\n% Change\nAgency renewal written premiums\n$\n864\n \n$\n695 \n24 \n$\n2,364\n \n$\n1,870 \n26 \nAgency new business written premiums\n116\n \n165 \n(30)\n384\n \n450 \n(15)\nOther written premiums\n(29)\n(28)\n(4)\n(145)\n(74)\n(96)\nNet written premiums\n951\n \n832 \n14 \n2,603\n \n2,246 \n16 \nUnearned premium change\n(113)\n(154)\n27 \n(263)\n(349)\n25 \nEarned premiums\n$\n838\n \n$\n678 \n24 \n$\n2,340\n \n$\n1,897 \n23 \n \n•\nCombined ratio – Our personal lines combined ratio for the third quarter of 2025 improved by 22.1 percentage points, compared with third-quarter 2024, including a decrease of 19.5 points in losses from catastrophes. The third-quarter 2025 combined ratio improvement also included a decrease of 3.3 percentage points from current accident year loss and loss expenses before catastrophe losses, including a decrease of 1.0 points for the IBNR portion and a decrease of 2.3 points for the case incurred portion. For the first nine months of 2025, the combined ratio increased by 7.7 percentage points, compared with the same period a year ago, including an increase of 9.1 points in losses from catastrophes. The nine-month 2025 combined ratio also included a decrease of 0.7 points from current accident year loss and loss expenses before catastrophe losses, including an increase of 2.3 points for the IBNR portion and a decrease of 3.0 points for the case incurred portion. The nine-month 2025 current accident year ratio before catastrophe losses included an unfavorable 1.4 points for the effect of reinstatement premiums. The total current accident year ratios before catastrophe losses were measured as of September 30 of the respective years and included an increase of 0.8 percentage points for the first nine months of 2025 in the ratio for large losses of $2 million or more per claim, discussed below. \nWhen estimating the ultimate cost of total loss and loss expenses, we consider many factors, including trends for inflation, historical paid and reported losses, large loss activity and other data or information for the industry \nCincinnati Financial Corporation Third-Quarter 2025 10-Q\nPage 50\nTable of Contents\nor our company. Elevated inflation in recent years has been a driver of higher losses and loss expenses as costs have increased significantly to repair damaged autos or homes that we insure. Due to increased uncertainty regarding ultimate losses, we intend to remain prudent in reserving for estimated ultimate losses until longer-term loss cost trends become more clear.\nCatastrophe losses and loss expenses accounted for 7.1 and 28.3 percentage points of the combined ratio for the third quarter and first nine months of 2025, compared with 26.6 and 19.2 points for the same periods a year ago. The 10-year annual average catastrophe loss ratio for the personal lines segment through 2024 was 12.1 percentage points, and the five-year annual average was 13.9 percentage points.\nIn addition to the average rate increases discussed above, we continue to refine our pricing to better match premiums to the risk of loss on individual policies. Improved pricing precision and broad-based rate increases are expected to help position the combined ratio at a profitable level over the long term. In addition, greater geographic diversification is expected to reduce the volatility of homeowner loss ratios attributable to weather-related catastrophe losses over time. \nThe net effect of reserve development on prior accident years during the third quarter of 2025 was unfavorable by $14 million and favorable by $24 million for the first nine months of 2025 for personal lines overall, compared with less than $1 million unfavorable and $27 million favorable for the same periods of 2024. Our homeowner line of business was the main contributor to the personal lines net favorable reserve development for the first nine months of 2025. The net favorable reserve development was primarily due to lower-than-anticipated loss emergence on known claims. Reserve estimates are inherently uncertain as described in our 2024 Annual Report on Form 10-K, Item 7, Critical Accounting Estimates, Property Casualty Insurance Loss and Loss Expense Reserves, Page 51.\nThe personal lines underwriting expense ratio decreased for the third quarter and first nine months of 2025, compared with the same periods a year ago. The third-quarter and nine-month decreases were primarily due to growth in premiums outpacing growth in various expenses. The nine-month 2025 ratio also included an unfavorable 0.7 points for the effect of reinstatement premiums. The ratios for both periods also included ongoing expense management efforts.\n \nPersonal Lines Insurance Losses Incurred by Size\n(Dollars in millions, net of reinsurance)\nThree months ended September 30,\nNine months ended September 30,\n2025\n2024\n% Change\n2025\n2024\n% Change\nCurrent accident year losses greater than $5 million\n$\n—\n \n$\n7 \n(100)\n$\n29\n \n$\n7 \n314 \nCurrent accident year losses $2 million - $5 million\n23\n \n13 \n77 \n46\n \n39 \n18 \nLarge loss prior accident year reserve development\n2\n \n(1)\nnm\n27\n \n2 \nnm\nTotal large losses incurred\n25\n \n19 \n32 \n102\n \n48 \n113 \nLosses incurred but not reported\n32\n \n33 \n(3)\n143\n \n86 \n66 \nOther losses excluding catastrophe losses\n316\n \n256 \n23 \n827\n \n743 \n11 \nCatastrophe losses\n54\n \n178 \n(70)\n645\n \n357 \n81 \nTotal losses incurred\n$\n427\n \n$\n486 \n(12)\n$\n1,717\n \n$\n1,234 \n39 \nRatios as a percent of earned premiums:\n \n \nPt. Change\n \n \nPt. Change\nCurrent accident year losses greater than $5 million\n0.0\n \n%\n1.1 \n%\n(1.1)\n1.3\n \n%\n0.4 \n%\n0.9 \nCurrent accident year losses $2 million - $5 million\n2.9\n \n2.0 \n0.9 \n2.0\n \n2.1 \n(0.1)\nLarge loss prior accident year reserve development\n0.2\n \n(0.2)\n0.4 \n1.1\n \n0.1 \n1.0 \nTotal large loss ratio\n3.1\n \n2.9 \n0.2 \n4.4\n \n2.6 \n1.8 \nLosses incurred but not reported\n3.8\n \n5.0 \n(1.2)\n6.1\n \n4.6 \n1.5 \nOther losses excluding catastrophe losses\n37.5\n \n37.6 \n(0.1)\n35.4\n \n39.0 \n(3.6)\nCatastrophe losses\n6.5\n \n26.2 \n(19.7)\n27.5\n \n18.8 \n8.7 \nTotal loss ratio\n50.9\n \n%\n71.7 \n%\n(20.8)\n73.4\n \n%\n65.0 \n%\n8.4 \nWe continue to monitor new losses and case reserve increases greater than $2 million for trends in factors such as initial reserve levels, loss cost inflation and claim settlement expenses. Our analysis continues to indicate no unexpected concentration of these large losses and case reserve increases by risk category, geographic \nCincinnati Financial Corporation Third-Quarter 2025 10-Q\nPage 51\nTable of Contents\nregion, policy inception, agency or field marketing territory. In the third quarter of 2025, the personal lines total large loss ratio, net of reinsurance, was 0.2 percentage points higher than last year's third quarter. The increase in personal lines total large losses incurred for the first nine months of 2025 occurred primarily for our homeowner line of business and inland marine coverages in our other personal line of business. The third-quarter 2025 amount of total large losses incurred unfavorably contributed to the increase in the nine-month 2025 total large loss ratio, compared with 2024, in addition to a first-half 2025 ratio that was 2.7 points higher than the first half of 2024. We believe results for the three- and nine-month periods largely reflected normal fluctuations in loss patterns and normal variability in large case reserves for claims above $2 million.\nEXCESS AND SURPLUS LINES INSURANCE RESULTS\n(Dollars in millions)\nThree months ended September 30,\nNine months ended September 30,\n2025\n2024\n% Change\n2025\n2024\n% Change\nEarned premiums\n$\n174\n \n$\n157 \n11 \n$\n510\n \n$\n447 \n14 \nFee revenues\n1\n \n— \nnm\n3\n \n2 \n50 \nTotal revenues\n175\n \n157 \n11 \n513\n \n449 \n14 \nLoss and loss expenses from:\n \n \n \n \n \n \nCurrent accident year before catastrophe losses\n112\n \n100 \n12 \n331\n \n288 \n15 \nCurrent accident year catastrophe losses\n—\n \n2 \n(100)\n4\n \n6 \n(33)\nPrior accident years before catastrophe losses\n(4)\n5 \nnm\n(17)\n5 \nnm\nPrior accident years catastrophe losses\n—\n \n— \n0 \n(1)\n— \nnm\nLoss and loss expenses\n108\n \n107 \n1 \n317\n \n299 \n6 \nUnderwriting expenses\n48\n \n42 \n14 \n141\n \n122 \n16 \nUnderwriting profit\n$\n19\n \n$\n8 \n138 \n$\n55\n \n$\n28 \n96 \nRatios as a percent of earned premiums:\n \n \nPt. Change\n \n \nPt. Change\nCurrent accident year before catastrophe losses\n64.1\n \n%\n64.2 \n%\n(0.1)\n64.8\n \n%\n64.6 \n%\n0.2 \nCurrent accident year catastrophe losses\n0.2\n \n1.7 \n(1.5)\n0.9\n \n1.4 \n(0.5)\nPrior accident years before catastrophe losses\n(2.1)\n2.9 \n(5.0)\n(3.2)\n1.0 \n(4.2)\nPrior accident years catastrophe losses\n(0.1)\n(0.2)\n0.1 \n(0.3)\n0.0 \n(0.3)\nLoss and loss expenses\n62.1\n \n68.6 \n(6.5)\n62.2\n \n67.0 \n(4.8)\nUnderwriting expenses\n27.7\n \n26.7 \n1.0 \n27.6\n \n27.3 \n0.3 \nCombined ratio\n89.8\n \n%\n95.3 \n%\n(5.5)\n89.8\n \n%\n94.3 \n%\n(4.5)\nCombined ratio\n89.8\n \n%\n95.3 \n%\n(5.5)\n89.8\n \n%\n94.3 \n%\n(4.5)\nContribution from catastrophe losses and prior years reserve development\n(2.0)\n4.4 \n(6.4)\n(2.6)\n2.4 \n(5.0)\nCombined ratio before catastrophe losses and prior years reserve development\n91.8\n \n%\n90.9 \n%\n0.9 \n92.4\n \n%\n91.9 \n%\n0.5 \n \nOverview\nPerformance highlights for the excess and surplus lines segment include:\n•\nPremiums – Excess and surplus lines earned premiums and net written premiums continued to grow during the third quarter and first nine months of 2025, compared with the same period a year ago, including increases in both agency renewal and new business written premiums. Renewal written premiums rose 15% for the third quarter and 12% for the nine months ended September 30, 2025, compared with the same periods of 2024, largely due to higher renewal pricing. For both 2025 periods, excess and surplus lines policy renewals experienced estimated average price increases at percentages in the high-single-digit range. We measure average changes in excess and surplus lines renewal pricing as the percentage rate of change in renewal premium for the new policy period compared with the premium for the expiring policy period, assuming no change in the level of insured exposures or policy coverage between those periods for respective policies.\nCincinnati Financial Corporation Third-Quarter 2025 10-Q\nPage 52\nTable of Contents\nNew business written premiums produced by agencies increased by 2% for the third quarter and 16% for the first nine months of 2025 compared with the same periods of 2024, as we continued to carefully underwrite each policy in a highly competitive market. Some of what we report as new business came from accounts that were not new to our agents. We believe our agents' seasoned accounts tend to be priced more accurately than business that may be less familiar to them.\n \nExcess and Surplus Lines Insurance Premiums\n(Dollars in millions)\nThree months ended September 30,\nNine months ended September 30,\n2025\n2024\n% Change\n2025\n2024\n% Change\nAgency renewal written premiums\n$\n130\n \n$\n113 \n15 \n$\n409\n \n$\n365 \n12 \nAgency new business written premiums\n55\n \n54 \n2 \n171\n \n147 \n16 \nOther written premiums\n(10)\n(10)\n0 \n(35)\n(29)\n(21)\nNet written premiums\n175\n \n157 \n11 \n545\n \n483 \n13 \nUnearned premium change\n(1)\n— \nnm\n(35)\n(36)\n3 \nEarned premiums\n$\n174\n \n$\n157 \n11 \n$\n510\n \n$\n447 \n14 \n \n•\nCombined ratio – The excess and surplus lines combined ratio improved by 5.5 percentage points for the third quarter and 4.5 points for the first nine months of 2025, compared with the same periods of 2024. The improvements were primarily due to favorable reserve development on prior accident year loss and loss expenses for the three and nine months ended September 30, 2025, compared with unfavorable development for the same periods of 2024.\nThe 64.1% third-quarter 2025 ratio for current accident year loss and loss expenses before catastrophe losses was 0.1 percentage points lower, compared with the 64.2% accident year 2024 ratio measured as of September 30, 2024, including a decrease of 2.4 points for the IBNR portion and an increase of 2.3 points for the case incurred portion. The nine-month 2025 ratio for current accident year loss and loss expenses before catastrophe losses was 0.2 percentage points higher, compared with the 64.6% accident year 2024 ratio measured as of September 30, 2024, including an increase of 2.7 points for the IBNR portion and a decrease of 2.5 points for the case incurred portion.\nExcess and surplus lines net reserve development on prior accident years, as a ratio to earned premiums, was favorable by 2.2% for the third quarter and 3.5% for the first nine months of 2025, compared with unfavorable 2.7% and 1.0% for the same periods of 2024. Reserve estimates are inherently uncertain as described in our 2024 Annual Report on Form 10-K, Item 7, Critical Accounting Estimates, Property Casualty Insurance Loss and Loss Expense Reserves, Page 51. \nThe excess and surplus lines underwriting expense ratio increased for the third quarter and first nine months of 2025 compared with the same periods a year ago, largely due to an increase in commission expenses. The ratios also included ongoing expense management efforts and premium growth.\nCincinnati Financial Corporation Third-Quarter 2025 10-Q\nPage 53\nTable of Contents\nExcess and Surplus Lines Insurance Losses Incurred by Size\n \n(Dollars in millions, net of reinsurance)\nThree months ended September 30,\nNine months ended September 30,\n2025\n2024\n% Change\n2025\n2024\n% Change\nCurrent accident year losses greater than $5 million\n$\n—\n \n$\n— \nnm\n$\n—\n \n$\n— \nnm\nCurrent accident year losses $2 million - $5 million\n—\n \n2 \n(100)\n—\n \n4 \n(100)\nLarge loss prior accident year reserve development\n—\n \n— \nnm\n—\n \n— \nnm\nTotal large losses incurred\n—\n \n2 \n(100)\n—\n \n4 \n(100)\nLosses incurred but not reported\n16\n \n12 \n33 \n93\n \n59 \n58 \nOther losses excluding catastrophe losses\n59\n \n55 \n7 \n125\n \n143 \n(13)\nCatastrophe losses\n—\n \n2 \n(100)\n3\n \n6 \n(50)\nTotal losses incurred\n$\n75\n \n$\n71 \n6 \n$\n221\n \n$\n212 \n4 \nRatios as a percent of earned premiums:\n \n \nPt. Change\n \n \nPt. Change\nCurrent accident year losses greater than $5 million\n0.0\n \n%\n0.0 \n%\n0.0 \n0.0\n \n%\n0.0 \n%\n0.0 \nCurrent accident year losses $2 million - $5 million\n0.0\n \n1.3 \n(1.3)\n0.0\n \n0.9 \n(0.9)\nLarge loss prior accident year reserve development\n0.0\n \n0.0 \n0.0 \n0.0\n \n0.0 \n0.0 \nTotal large loss ratio\n0.0\n \n1.3 \n(1.3)\n0.0\n \n0.9 \n(0.9)\nLosses incurred but not reported\n9.2\n \n7.1 \n2.1 \n18.3\n \n13.2 \n5.1 \nOther losses excluding catastrophe losses\n33.6\n \n35.4 \n(1.8)\n24.4\n \n32.1 \n(7.7)\nCatastrophe losses\n0.0\n \n1.5 \n(1.5)\n0.5\n \n1.3 \n(0.8)\nTotal loss ratio\n42.8\n \n%\n45.3 \n%\n(2.5)\n43.2\n \n%\n47.5 \n%\n(4.3)\n \nWe continue to monitor new losses and case reserve increases greater than $2 million for trends in factors such as initial reserve levels, loss cost inflation and claim settlement expenses. Our analysis continues to indicate no unexpected concentration of these large losses and case reserve increases by risk category, geographic region, policy inception, agency or field marketing territory. In the third quarter of 2025, the excess and surplus lines total ratio for large losses, net of reinsurance, was 1.3 percentage points lower than last year's third quarter. The third-quarter 2025 amount of total large losses incurred contributed favorably to the decrease in the nine-month 2025 total large loss ratio, compared with 2024, in addition to a first-half 2025 ratio that was 0.7 points lower than the first half of 2024. We believe results for the three- and nine month periods largely reflected normal fluctuations in loss patterns and normal variability in large case reserves for claims above $2 million.\nCincinnati Financial Corporation Third-Quarter 2025 10-Q\nPage 54\nTable of Contents\nLIFE INSURANCE RESULTS\n(Dollars in millions)\nThree months ended September 30,\nNine months ended September 30,\n2025\n2024\n% Change\n2025\n2024\n% Change\nEarned premiums\n$\n83\n \n$\n80 \n4 \n$\n246\n \n$\n240 \n3 \nFee revenues\n1\n \n1 \n0 \n4\n \n4 \n0 \nTotal revenues\n84\n \n81 \n4 \n250\n \n244 \n2 \nContract holders' benefits incurred\n76\n \n79 \n(4)\n230\n \n226 \n2 \nInvestment interest credited to contract holders\n(32)\n(32)\n0 \n(95)\n(94)\n(1)\nUnderwriting expenses incurred\n23\n \n24 \n(4)\n70\n \n70 \n0 \nTotal benefits and expenses\n67\n \n71 \n(6)\n205\n \n202 \n1 \nLife insurance segment profit\n$\n17\n \n$\n10 \n70 \n$\n45\n \n$\n42 \n7 \n \nOverview\nPerformance highlights for the life insurance segment include:\n•\nRevenues – Revenues increased for the nine months ended September 30, 2025, compared with the same period a year ago, driven by higher earned premiums from term life insurance, our largest life insurance product line.\nNet in-force life insurance policy face amounts increased 3% to $86.438 billion at September 30, 2025, from $84.245 billion at year-end 2024.\nFixed annuity deposits received for the three and nine months ended September 30, 2025, were $8 million and $20 million, compared with $10 million and $29 million for the same periods of 2024. Fixed annuity deposits have a minimal impact on earned premiums because deposits received are initially recorded as liabilities. Profit is earned over time by way of interest rate spreads. We do not write variable or equity-indexed annuities.\n \nLife Insurance Premiums\n(Dollars in millions)\nThree months ended September 30,\nNine months ended September 30,\n2025\n2024\n% Change\n2025\n2024\n% Change\nTerm life insurance\n$\n61\n \n$\n58 \n5 \n$\n179\n \n$\n174 \n3 \nWhole life insurance\n14\n \n13 \n8 \n40\n \n39 \n3 \nUniversal life and other \n8\n \n9 \n(11)\n27\n \n27 \n0 \nNet earned premiums\n$\n83\n \n$\n80 \n4 \n$\n246\n \n$\n240 \n3 \n \n•\nProfitability – Our life insurance segment typically reports a smaller profit compared with the life insurance subsidiary because profits from investment income spreads are included in our investments segment results. We include only investment income credited to contract holders (including interest assumed in life insurance policy reserve calculations) in our life insurance segment results. A profit of $45 million for our life insurance segment in the first nine months of 2025, compared with a profit of $42 million for the same period of 2024, was primarily due to increased earned premiums.\nLife insurance segment benefits and expenses consist principally of contract holders' (policyholders') benefits incurred related to traditional life and interest-sensitive products and operating expenses incurred, net of deferred acquisition costs. Total benefits increased in the first nine months of 2025 primarily due to less favorable impacts from the unlocking of interest rate and other actuarial assumptions. \nUnderwriting expenses for the first nine months of 2025 matched the same period a year ago.\nWe recognize that assets under management, capital appreciation and investment income are integral to evaluating the success of the life insurance segment because of the long duration of life products. On a basis that includes investment income and investment gains or losses from life-insurance-related \nCincinnati Financial Corporation Third-Quarter 2025 10-Q\nPage 55\nTable of Contents\ninvested assets, the life insurance subsidiary reported net income of $28 million and $75 million for the three and nine months ended September 30, 2025, compared with $20 million and $63 million for the three and nine months ended September 30, 2024. The life insurance subsidiary portfolio had net after-tax investment losses of $1 million and $5 million for the three and nine months ended September 30, 2025, compared with less than $1 million and $7 million for the three and nine months ended September 30, 2024.\nINVESTMENTS RESULTS\n \nOverview\nThe investments segment contributes investment income and investment gains and losses to results of operations. Investments traditionally are our primary source of pretax and after-tax profits.  \n \nInvestment Income\nPretax investment income grew 14% for the third quarter and 15% for the first nine months of 2025, compared with the same periods of 2024. Interest income increased by $40 million and $122 million for the three and nine months ended September 30, 2025, as net purchases of fixed-maturity securities in recent quarters and higher bond yields are working to generally offset effects of the low interest rate environment for several years prior to 2022. Dividend income increased by $1 million for the third quarter and decreased by $3 million for the first nine months of 2025. The decrease for the first nine months of 2025 was primarily due to the unfavorable effect on dividend income from net sales of equity securities during the second half of 2024. That effect was partially offset by net purchases of equity securities during the first nine months of 2025 and dividend rates that have generally been increasing, although more slowly in recent quarters.\nInvestments Results\n(Dollars in millions)\nThree months ended September 30,\nNine months ended September 30,\n2025\n2024\n% Change\n2025\n2024\n% Change\nTotal investment income, net of expenses\n$\n295\n \n$\n258 \n14 \n$\n860\n \n$\n745 \n15 \nInvestment interest credited to contract holders\n(32)\n(32)\n0 \n(95)\n(94)\n(1)\nInvestment gains and losses, net\n853\n \n758 \n13 \n1,259\n \n1,507 \n(16)\nInvestments profit, pretax\n$\n1,116\n \n$\n984 \n13 \n$\n2,024\n \n$\n2,158 \n(6)\nWe continue to consider the low interest rate environment that prevailed for several years prior to 2022 as well as the potential for a continuation of both elevated inflation and higher bond yields as we position our portfolio. As bonds in our generally laddered portfolio mature or are called over the near term, we will reinvest with a balanced approach, keeping in mind our long-term strategy and pursuing attractive risk-adjusted after-tax yields. The table below shows the average pretax yield-to-amortized cost associated with expected principal redemptions for our fixed-maturity portfolio. The expected principal redemptions are based on par amounts and include dated maturities, calls and prefunded municipal bonds that we expect will be called during each respective time period. \n(Dollars in millions) \n% Yield\nPrincipal redemptions\nAt September 30, 2025\nFixed-maturity pretax yield profile:\nExpected to mature during the remainder of 2025\n4.85 \n%\n$\n269 \nExpected to mature during 2026\n4.82 \n997 \nExpected to mature during 2027\n5.20 \n1,027 \nAverage yield and total expected maturities from the remainder of 2025 through 2027\n5.00 \n$\n2,293 \nCincinnati Financial Corporation Third-Quarter 2025 10-Q\nPage 56\nTable of Contents\nThe table below shows the average pretax yield-to-amortized cost for fixed-maturity securities acquired during the periods indicated. The average yield for total fixed-maturity securities acquired during the first nine months of 2025 was higher than the 5.06% average yield-to-amortized cost of the fixed-maturity securities portfolio at the end of 2024. Our fixed-maturity portfolio's average yield of 4.96% for the first nine months of 2025, from the investment income table below, was lower than the 5.06% yield for the year-end 2024 fixed-maturities portfolio.\nThree months ended September 30,\nNine months ended September 30,\n2025\n2024\n2025\n2024\nAverage pretax yield-to-amortized cost on new fixed-maturities:\nAcquired taxable fixed-maturities\n5.63\n \n%\n5.63 \n%\n5.81\n \n%\n5.81 \n%\nAcquired tax-exempt fixed-maturities\n4.83\n \n4.09 \n4.75\n \n4.12 \nAverage total fixed-maturities acquired\n5.52\n \n5.53 \n5.69\n \n5.68 \nWhile our bond portfolio more than covers our insurance reserve liabilities, we believe our diversified common stock portfolio of mainly blue chip, dividend-paying companies represents one of our best investment opportunities for the long term. We discussed our portfolio strategies in our 2024 Annual Report on Form 10-K, Item 1, Investments Segment, Page 21, and Item 7, Investments Outlook, Page 89. We discuss risks related to our investment income and our fixed-maturity and equity investment portfolios in this quarterly report Item 3, Quantitative and Qualitative Disclosures About Market Risk.\nThe table below provides details about investment income. Average yields in this table are based on the average invested asset and cash amounts indicated in the table, using fixed-maturity securities valued at amortized cost and all other securities at fair value.\n(Dollars in millions)\nThree months ended September 30,\nNine months ended September 30,\n2025\n2024\n% Change\n2025\n2024\n% Change\nInvestment income:\n \n \n \n \n \n \nInterest\n$\n227\n \n$\n187 \n21 \n$\n651\n \n$\n529 \n23 \nDividends\n69\n \n68 \n1 \n206\n \n209 \n(1)\nOther\n4\n \n7 \n(43)\n16\n \n18 \n(11)\nLess investment expenses\n5\n \n4 \n25 \n13\n \n11 \n18 \nInvestment income, pretax\n295\n \n258 \n14 \n860\n \n745 \n15 \nLess income taxes\n51\n \n44 \n16 \n148\n \n125 \n18 \nTotal investment income, after-tax\n$\n244\n \n$\n214 \n14 \n$\n712\n \n$\n620 \n15 \nInvestment returns:\nAverage invested assets plus cash and cash\n  equivalents\n$\n31,899\n \n$\n29,107 \n$\n31,345\n \n$\n28,447 \nAverage yield pretax\n3.70\n \n%\n3.55 \n%\n3.66\n \n%\n3.49 \n%\nAverage yield after-tax\n3.06\n \n2.94 \n3.03\n \n2.91 \nEffective tax rate\n17.3\n \n16.9 \n17.2\n \n16.8 \nFixed-maturity returns:\nAverage amortized cost\n$\n17,816\n \n$\n15,592 \n$\n17,515\n \n$\n15,218 \nAverage yield pretax\n5.10\n \n%\n4.80 \n%\n4.96\n \n%\n4.63 \n%\nAverage yield after-tax\n4.16\n \n3.93 \n4.04\n \n3.80 \nEffective tax rate\n18.4\n \n18.1 \n18.4\n \n18.0 \n \nCincinnati Financial Corporation Third-Quarter 2025 10-Q\nPage 57\nTable of Contents\nTotal Investment Gains and Losses\nInvestment gains and losses are recognized on the sale of investments, for certain changes in fair values of securities even though we continue to hold the securities or as otherwise required by GAAP. The change in fair value for equity securities still held is included in investment gains and losses and also in net income. The change in unrealized gains or losses for fixed-maturity securities is included as a component of other comprehensive income (OCI). Accounting requirements for the allowance for credit losses for the fixed-maturity portfolio are disclosed in our 2024 Annual Report on Form 10-K, Item 8, Note 1, Summary of Significant Accounting Policies, Page 128. \n \nThe table below summarizes total investment gains and losses, before taxes.\n(Dollars in millions)\nThree months ended September 30,\nNine months ended September 30,\n2025\n2024\n2025\n2024\nInvestment gains and losses:\nEquity securities:\nInvestment gains and losses on securities sold, net\n$\n(9)\n$\n24 \n$\n(5)\n$\n146 \nUnrealized gains and losses on securities still held, net\n855\n \n817 \n1,259\n \n1,446 \nSubtotal\n846\n \n841 \n1,254\n \n1,592 \nFixed maturities:\nGross realized gains\n2\n \n1 \n3\n \n5 \nGross realized losses\n(1)\n(87)\n(1)\n(94)\nChange in allowance for credit losses, net\n—\n \n— \n(15)\n(25)\nSubtotal\n1\n \n(86)\n(13)\n(114)\nOther \n6\n \n3 \n18\n \n29 \nTotal investment gains and losses reported in net income\n853\n \n758 \n1,259\n \n1,507 \nChange in unrealized investment gains and losses:\nFixed maturities\n241\n \n497 \n336\n \n367 \nTotal\n$\n1,094\n \n$\n1,255 \n$\n1,595\n \n$\n1,874 \nOf the 5,331 fixed-maturity and short-term securities in the portfolio, 17 securities were trading below 70% of amortized cost at September 30, 2025. Our asset impairment committee regularly monitors the portfolio, including a quarterly review of the entire portfolio for potential credit losses. We believe that if liquidity in the markets were to significantly deteriorate or economic conditions were to significantly weaken, we could experience declines in portfolio values and possibly increases in the allowance for credit losses or write-downs to fair value.\nCincinnati Financial Corporation Third-Quarter 2025 10-Q\nPage 58\nTable of Contents\nOTHER\nWe report as Other the noninvestment operations of the parent company and a noninsurance subsidiary, CFC Investment Company. We also report as Other the underwriting results of Cincinnati Re and Cincinnati Global, including earned premiums, loss and loss expenses and underwriting expenses in the table below. \nTotal revenues for the first nine months of 2025 for our Other operations increased, compared with the same period of 2024, primarily due to earned premiums from Cincinnati Re and Cincinnati Global, with increases of $33 million and $28 million, respectively. Cincinnati Re had $444 million of earned premiums for the first nine months of 2025 and generated an underwriting loss of $10 million, including an unfavorable impact of $103 million of net catastrophe losses from the January 2025 wildfires in southern California. Cincinnati Global had $231 million of earned premiums for the first nine months of 2025 and generated an underwriting profit of $55 million. Total expenses for Other increased for the first nine months of 2025, primarily due to higher loss and loss expenses from Cincinnati Re and Cincinnati Global.\nOther income (loss) in the table below represents profit before income taxes. For the first nine months of 2025, total other loss resulted from an underwriting loss from Cincinnati Re and interest expense from debt of the parent company. For the first nine months of 2024, total other income was driven by underwriting profit from Cincinnati Re and Cincinnati Global.\n(Dollars in millions)\nThree months ended September 30,\nNine months ended September 30,\n2025\n2024\n% Change\n2025\n2024\n% Change\nInterest and fees on loans and leases\n$\n3\n \n$\n3 \n0 \n$\n8\n \n$\n7 \n14 \nEarned premiums\n243\n \n245 \n(1)\n675\n \n614 \n10 \nOther revenues\n3\n \n— \nnm\n7\n \n3 \n133 \nTotal revenues\n249\n \n248 \n0 \n690\n \n624 \n11 \nInterest expense\n13\n \n13 \n0 \n40\n \n40 \n0 \nLoss and loss expenses\n102\n \n133 \n(23)\n421\n \n290 \n45 \nUnderwriting expenses\n77\n \n70 \n10 \n209\n \n180 \n16 \nOperating expenses\n6\n \n6 \n0 \n27\n \n19 \n42 \nTotal expenses\n198\n \n222 \n(11)\n697\n \n529 \n32 \n Total other income (loss)\n$\n51\n \n$\n26 \n96 \n$\n(7)\n$\n95 \nnm\n \nTAXES\nWe had $291 million and $423 million of income tax expense for the three and nine months ended September 30, 2025, compared with $220 million and $492 million of income tax expense for the same periods of 2024. The effective tax rate for the three and nine months ended September 30, 2025, was 20.6% and 19.8% compared with 21.2% and 20.7% for the same periods last year. The change in our effective tax rate between periods was primarily due to large changes in our net investment gains and losses included in income for the periods and changes in underwriting income and investment income. \nHistorically, we have pursued a strategy of investing some portion of cash flow in tax-advantaged, fixed-maturity and equity securities to minimize our overall tax liability and maximize after-tax earnings. See Tax-Exempt Fixed Maturities in this quarterly report Item 3, Quantitative and Qualitative Disclosures About Market Risk for further discussion on municipal bond purchases in our fixed-maturity investment portfolio. For tax years after 2017, for our property casualty insurance subsidiaries, approximately 75% of interest from tax-advantaged, fixed-maturity investments and approximately 40% of dividends from qualified equities are exempt from federal tax after applying proration. For our noninsurance companies, the dividend received deduction exempts 50% of dividends from qualified equities. Our life insurance company does not own tax-advantaged, fixed-maturity investments or equities subject to the dividend received deduction. Details about our effective tax rate are in this quarterly report Item 1, Note 9, Income Taxes.\nCincinnati Financial Corporation Third-Quarter 2025 10-Q\nPage 59\nTable of Contents\nLIQUIDITY AND CAPITAL RESOURCES\nAt September 30, 2025, shareholders' equity was $15.406 billion, compared with $13.935 billion at December 31, 2024. Total debt was $815 million at September 30, 2025, unchanged from December 31, 2024. At September 30, 2025, cash and cash equivalents totaled $1.460 billion, compared with $983 million at December 31, 2024.\nIn addition to our historically positive operating cash flow to meet the needs of operations, we have the ability to slow investing activities or sell a portion of our high-quality, liquid investment portfolio if such need arises. We also have additional capacity to borrow on our revolving short-term line of credit, as described further below.  \nSOURCES OF LIQUIDITY\n \nSubsidiary Dividends\nOur lead insurance subsidiary declared dividends of $350 million to the parent company in the first nine months of 2025, compared with $290 million for the same period of 2024. For full-year 2024, our lead insurance subsidiary paid dividends totaling $290 million to the parent company. State of Ohio regulatory requirements restrict the dividends our insurance subsidiary can pay. For full-year 2025, total dividends that our insurance subsidiary can pay to our parent company without regulatory approval are approximately $1.245 billion.\n \nInvesting Activities\nInvestment income is a source of liquidity for both the parent company and its insurance subsidiaries. We continue to focus on portfolio strategies to balance near-term income generation and long-term book value growth.\n \nParent company obligations can be funded with income on investments held at the parent-company level or through sales of securities in that portfolio, although our investment philosophy seeks to compound cash flows over the long term. These sources of capital can help minimize subsidiary dividends to the parent company, protecting insurance subsidiary capital.\nFor a discussion of our historic investment strategy, portfolio allocation and quality, see our 2024 Annual Report on Form 10-K, Item 1, Investments Segment, Page 21.\n \nInsurance Underwriting\nOur property casualty and life insurance underwriting operations provide liquidity because we generally receive premiums before paying losses under the policies purchased with those premiums. After satisfying our cash requirements, we invest excess cash flows, increasing future investment income.\n \nHistorically, cash receipts from property casualty and life insurance premiums, along with investment income, have been more than sufficient to pay claims, operating expenses and dividends to the parent company. \n \nThe table below shows a summary of the operating cash flow for property casualty insurance (direct method):\n(Dollars in millions)\nThree months ended September 30,\nNine months ended September 30,\n2025\n2024\n% Change\n2025\n2024\n% Change\nPremiums collected\n$\n2,626\n \n$\n2,343 \n12 \n$\n7,369\n \n$\n6,593 \n12 \nLoss and loss expenses paid\n(1,217)\n(1,114)\n(9)\n(3,862)\n(3,218)\n(20)\nCommissions and other underwriting expenses paid\n(634)\n(585)\n(8)\n(2,226)\n(2,008)\n(11)\nCash flow from underwriting\n775\n \n644 \n20 \n1,281\n \n1,367 \n(6)\nInvestment income received\n217\n \n192 \n13 \n630\n \n533 \n18 \nCash flow from operations\n$\n992\n \n$\n836 \n19 \n$\n1,911\n \n$\n1,900 \n1 \n \nCollected premiums for property casualty insurance rose $776 million during the first nine months of 2025, compared with the same period in 2024. Loss and loss expenses paid for the 2025 period increased $644 million. Commissions and other underwriting expenses paid increased $218 million.\n \nCincinnati Financial Corporation Third-Quarter 2025 10-Q\nPage 60\nTable of Contents\nWe discuss our future obligations for claims payments and for underwriting expenses in our 2024 Annual Report on Form 10-K, Item 7, Obligations, Page 95.\n \nCapital Resources\nAt September 30, 2025, our debt-to-total-capital ratio was 5.0%, considerably below our 35% covenant threshold, with $790 million in long-term debt and\n $25 \nmillion in borrowing on our revolving short-term line of credit. \nAt September 30, 2025, $275 million was available for future \ncash management needs as part of the general provisions of the line of credit agreement, with another $300 million available as part of an accordion feature. Based on our capital requirements at September 30, 2025, we do not anticipate a material increase in debt levels exceeding the available line of credit amount during the year. As a result, we expect changes in our debt-to-total-capital ratio to continue to be largely a function of the contribution of unrealized investment gains or losses to shareholders' equity. During 2024, we terminated our unsecured letter of credit agreement, which provided a portion of the capital needed to support Cincinnati Global's obligations at Lloyd's. We replaced the letter of credit agreement with common equities, bringing total common equities held in Lloyd's trust accounts to $235 million.\nOn October 10, 2025, we terminated our $300 million credit agreement and simultaneously entered into a new  $400 million unsecured revolving credit agreement expiring on October 10, 2030, with two optional one-year extensions. The credit facility is fully subscribed among four lenders and includes a $400 million accordion feature, a $400 million sublimit for letters of credit, and a $75 million sublimit for swing line loans. The debt-to-total-capital ratio covenant threshold remains at 35%. Current borrowings under the credit agreement were $25 million on October 10, 2025. \nWe provide details of our three long-term notes in this quarterly report Item 1, Note 3, Fair Value Measurements. None of the notes are encumbered by rating triggers.\n \nFour independent ratings firms award insurer financial strength ratings to our property casualty insurance companies and three firms rate our life insurance company. On September 3, 2025, Fitch Ratings changed our parent company debt rating to A from A-. No additional changes to our parent company debt ratings occurred during the first nine months of 2025. Our debt ratings are discussed in our 2024 Annual Report on Form 10-K, Item 7, Liquidity and Capital Resources, Long-Term Debt, Page 94.\n \nOff-Balance Sheet Arrangements\nWe do not use any special-purpose financing vehicles or have any undisclosed off-balance sheet arrangements (as that term is defined in applicable SEC rules) that are reasonably likely to have a current or future material effect on the company's financial condition, results of operation, liquidity, capital expenditures or capital resources. Similarly, the company holds no fair-value contracts for which a lack of marketplace quotations would necessitate the use of fair-value techniques.\n \nUSES OF LIQUIDITY\nOur parent company and insurance subsidiary have contractual obligations and other commitments. In addition, one of our primary uses of cash is to enhance shareholder return.\n \nContractual Obligations\nWe estimated our future contractual obligations as of December 31, 2024, in our 2024 Annual Report on Form 10-K, Item 7, Contractual Obligations, Page 95. There have been no material changes to our estimates of future contractual obligations since our 2024 Annual Report on Form 10-K.\nOther Commitments\nIn addition to our contractual obligations, we have other property casualty operational commitments:\n•\nCommissions – Commissions paid were $1.469 billion in the first nine months of 2025. Commission payments generally track with written premiums, except for annual profit-sharing commissions typically paid during the first quarter of the year.\n•\nOther underwriting expenses – Many of our underwriting expenses are not contractual obligations, but reflect the ongoing expenses of our business. Noncommission underwriting expenses paid were $757 million in the first nine months of 2025.\nThere were no contributions to our qualified pension plan during the first nine months of 2025. \n \nCincinnati Financial Corporation Third-Quarter 2025 10-Q\nPage 61\nTable of Contents\nInvesting Activities\nAfter fulfilling operating requirements, we invest cash flows from underwriting, investment and other corporate activities in fixed-maturity and equity securities on an ongoing basis to help achieve our portfolio objectives. We discuss our investment strategy and certain portfolio attributes in this quarterly report Item 3, Quantitative and Qualitative Disclosures About Market Risk.\n \nUses of Capital\nUses of cash to enhance shareholder return include dividends to shareholders and shares acquired under our repurchase program. In January, May and August 2025, the board of directors declared regular quarterly cash dividends of 87 cents per share for an indicated annual rate of $3.48 per share. During the first nine months of 2025, we used $392 million to pay cash dividends to shareholders.\nPROPERTY CASUALTY INSURANCE LOSS AND LOSS EXPENSE RESERVES\nFor the business lines in the commercial and personal lines insurance segments, and in total for the excess and surplus lines insurance segment and other property casualty insurance operations, the following table details gross reserves among case, IBNR (incurred but not reported) and loss expense reserves, net of salvage and subrogation reserves. Reserving practices are discussed in our 2024 Annual Report on Form 10-K, Item 7, Property Casualty Loss and Loss Expense Obligations and Reserves, Page 96.\n \nTotal gross reserves at September 30, 2025, increased $1.258 billion compared with December 31, 2024. Case loss reserves increased by $237 million, IBNR loss reserves increased by $801 million and loss expense reserves increased by $220 million. The total gross increase was primarily due to our commercial casualty and homeowner lines of business, excess and surplus lines insurance segment and Cincinnati Re.\nCincinnati Financial Corporation Third-Quarter 2025 10-Q\nPage 62\nTable of Contents\nProperty Casualty Gross Reserves\n(Dollars in millions)\nLoss reserves\nLoss expense reserves\nTotal gross reserves\n \nCase reserves\nIBNR reserves\nPercent of total\nAt September 30, 2025\nCommercial lines insurance:\n \n \n \n \n \nCommercial casualty\n$\n1,206\n \n$\n1,682\n \n$\n869\n \n$\n3,757\n \n33.6\n \n%\nCommercial property\n224\n \n235\n \n104\n \n563\n \n5.0\n \nCommercial auto\n433\n \n441\n \n178\n \n1,052\n \n9.4\n \nWorkers' compensation\n378\n \n579\n \n101\n \n1,058\n \n9.5\n \nOther commercial \n168\n \n71\n \n168\n \n407\n \n3.6\n \nSubtotal\n2,409\n \n3,008\n \n1,420\n \n6,837\n \n61.1\n \nPersonal lines insurance:\n \n \n \n \n \nPersonal auto\n283\n \n154\n \n125\n \n562\n \n5.0\n \nHomeowner\n353\n \n263\n \n117\n \n733\n \n6.5\n \nOther personal\n107\n \n236\n \n10\n \n353\n \n3.2\n \nSubtotal\n743\n \n653\n \n252\n \n1,648\n \n14.7\n \nExcess and surplus lines\n401\n \n520\n \n332\n \n1,253\n \n11.2\n \nCincinnati Re\n225\n \n992\n \n8\n \n1,225\n \n10.9\n \nCincinnati Global\n113\n \n115\n \n4\n \n232\n \n2.1\n \nTotal\n$\n3,891\n \n$\n5,288\n \n$\n2,016\n \n$\n11,195\n \n100.0\n \n%\nAt December 31, 2024\n \n \n \n \n \nCommercial lines insurance:\n \n \n \n \n \nCommercial casualty\n$\n1,121 \n$\n1,498 \n$\n824 \n$\n3,443 \n34.7 \n%\nCommercial property\n251 \n199 \n90 \n540 \n5.4 \nCommercial auto\n423 \n355 \n159 \n937 \n9.4 \nWorkers' compensation\n389 \n564 \n89 \n1,042 \n10.5 \nOther commercial \n159 \n45 \n137 \n341 \n3.4 \nSubtotal\n2,343 \n2,661 \n1,299 \n6,303 \n63.4 \nPersonal lines insurance:\n \n \n \n \n \nPersonal auto\n260 \n106 \n100 \n466 \n4.7 \nHomeowner\n244 \n134 \n88 \n466 \n4.7 \nOther personal\n102 \n166 \n9 \n277 \n2.8 \nSubtotal\n606 \n406 \n197 \n1,209 \n12.2 \nExcess and surplus lines\n395 \n425 \n289 \n1,109 \n11.2 \nCincinnati Re\n191 \n880 \n8 \n1,079 \n10.8 \nCincinnati Global\n119 \n115 \n3 \n237 \n2.4 \nTotal\n$\n3,654 \n$\n4,487 \n$\n1,796 \n$\n9,937 \n100.0 \n%\n \nLIFE POLICY AND INVESTMENT CONTRACT RESERVES\nGross life policy and investment contract reserves were $3.003 billion at September 30, 2025, compared with $2.960 billion at year-end 2024. Details about these reserves are in this quarterly report Item 1, Note 5, Life Policy and Investment Contract Reserves. We discussed our life insurance reserving practices in our 2024 Annual Report on Form 10-K, Item 7, Life Insurance Policyholder Obligations and Reserves, Page 102.\nCincinnati Financial Corporation Third-Quarter 2025 10-Q\nPage 63\nTable of Contents\nOTHER MATTERS\n \nSIGNIFICANT ACCOUNTING POLICIES\nOur significant accounting policies are discussed in our 2024 Annual Report on Form 10-K, Item 8, Note 1, Summary of Significant Accounting Policies, Page 128, and updated in this quarterly report Item 1, Note 1, Accounting Policies.\n \nIn conjunction with those discussions, in the Management's Discussion and Analysis in the 2024 Annual Report on Form 10-K, management reviewed the estimates and assumptions used to develop reported amounts related to the most significant policies. Management discussed the development and selection of those accounting estimates with the audit committee of the board of directors."
}