{
  "source_file": "cl-20241231.htm",
  "form_type": "10-K",
  "item1": "ITEM 1.    BUSINESS\nGeneral Development of the Business\nColgate-Palmolive Company (together with its subsidiaries, “we,” “us,” “our,” the “Company” or “Colgate”) is a caring, innovative growth company reimagining a healthier future for all people, their pets and our planet. We seek to deliver consistent compounded earnings per share growth to help drive superior total shareholder return, as well as to provide Colgate people with an innovative and inclusive work environment. We do this by developing and selling science-led products globally that make people’s and their pets’ lives healthier and more enjoyable and by embracing our Sustainability & Social Impact Strategy across our organization. Our products are marketed in over 200 countries and territories throughout the world. Colgate was founded in 1806 and incorporated under the laws of the State of Delaware in 1923.\nFor recent business developments and other information, refer to the information set forth under the captions “Management’s Discussion and Analysis of Financial Condition and Results of Operations–Executive Overview,” “– Outlook,” “–Results of Operations” and “– Liquidity and Capital Resources” in Part II, Item 7 of this report.\nDescription of the Business\nWe operate in two product segments: Oral, Personal and Home Care; and Pet Nutrition. We are a leader in Oral Care with global leadership in the toothpaste and manual toothbrush categories according to market share data. We sell our toothpastes under brands such as Colgate, Darlie, elmex, hello, meridol, Sorriso and Tom’s of Maine, our toothbrushes under brands such as Colgate, Darlie, elmex and meridol and our mouthwashes under brands such as Colgate, elmex and meridol. Our Oral Care business also includes pharmaceutical products for dentists and other oral health professionals.\nWe are a leader in many product categories of the Personal Care market with global leadership in liquid hand soap, according to market share data, which we sell under brands such as Palmolive, Protex and Softsoap. Our Personal Care products also include Irish Spring, Palmolive and Protex bar soaps, Irish Spring, Palmolive, Sanex and Softsoap shower gels, Lady Speed Stick, Sanex, Speed Stick and Tom’s of Maine deodorants and antiperspirants, EltaMD, Filorga and PCA SKIN skin health products and Palmolive shampoos and conditioners. \nWe manufacture and market a wide array of products for the Home Care market, including Ajax, Axion and Palmolive dishwashing liquids, Ajax, Fabuloso and Murphy household cleaners and Suavitel, Soupline, Fluffy and Cuddly fabric conditioners.\nSales of Oral, Personal and Home Care products accounted for 43%, 18% and 17%, respectively, of our total worldwide Net sales in 2024. Geographically, Oral Care is a substantial part of our business in Asia Pacific.\nThrough our Hill’s Pet Nutrition segment (“Hill’s” or “Pet Nutrition”), we are a leader in specialty pet nutrition products for dogs and cats with products marketed in over 80 countries and territories worldwide. Hill’s markets pet foods primarily under two brands. Hill’s Science Diet, which is called Hill’s Science Plan in Europe, is a range of products for everyday nutritional needs. Hill’s Prescription Diet is a range of therapeutic pet foods to help nutritionally support dogs and cats in different stages of health. Sales of Pet Nutrition products accounted for 22% of our total worldwide Net sales in 2024.\nFor more information regarding our worldwide Net sales by product category, refer to Note 1, Nature of Operations and Note 13, Segment Information to the Consolidated Financial Statements. \nFor additional information regarding market share data, see \n“\nMarket Share Information\n”\n in Part II, Item 7 of this report.\n1\nDistribution; Raw Materials; Competition; Trademarks and Patents\nOur Oral, Personal and Home Care products are sold to a variety of retailers, wholesalers and distributors worldwide. Pet Nutrition products are sold by authorized pet supply retailers, veterinarians and eCommerce retailers. Certain of our products are also sold direct-to-consumer. Our sales to Walmart, Inc. and its affiliates represented approximately 11% of our Net sales in 2024. No other customer represented more than 10% of our Net sales in 2024. We support our products with advertising, promotion and other marketing (with increasing emphasis on digital) to build awareness and trial of our products. Our products are marketed by a direct sales force at individual operating subsidiaries or business units and by distributors or brokers.\nThe majority of raw and packaging materials used in our products is purchased from other companies and is available from several sources. No single raw or packaging material represents, and no single supplier provides, a significant portion of our total material requirements. We do, however, purchase certain key raw and packaging materials from single-source suppliers or a limited number of suppliers. For certain materials, new suppliers may have to be qualified under industry, governmental and/or Colgate standards (including those relating to responsible sourcing), which can require additional investment and/or take a significant period of time. Raw and packaging material commodities, such as resins, essential oils, tropical oils, pulp, tallow, corn, poultry and soybeans, are subject to market price variations. For further information regarding the impact of changes in commodity prices, see Item 1A, “Risk Factors - Volatility in material and other costs has in the past and may continue to adversely impact our profitability” and Item 7, “Management’s Discussion and Analysis of Financial Condition and Results of Operations.” \nOur products are sold in a highly competitive global marketplace which has experienced increased retail trade concentration, the substantial growth of eCommerce, the integration of traditional and digital operations at key retailers and the growing presence of large-format retailers, discounters and eCommerce retailers. Products similar to ours are available from multinational and local competitors in the U.S. and around the world. Certain of our competitors are larger and have greater resources than we do. In addition, the substantial growth in eCommerce has encouraged the entry of new competitors and business models. In certain geographies, we also face strong local competitors, who may be more agile and have better local consumer insights than we do. Private label brands sold by retailers are also a source of competition for certain of our products. \nThe retail landscape in many of our markets continues to evolve as a result of the continued growth of eCommerce, changing consumer behavior and preferences (as consumers increasingly shop online, including to compare prices and product availability) and the increased presence of alternative retail channels, such as subscription services and direct-to-consumer businesses. We face competition in several aspects of our business, including pricing, promotional activities, new products and brand introductions and expansion into new geographies and channels. \nWe consider trademarks to be material to our business. We follow a practice of seeking trademark protection in the U.S. and throughout the world where our products are sold. Principal global and regional trademarks include Colgate, Palmolive, Darlie, elmex, hello, meridol, Sorriso, Tom’s of Maine, EltaMD, Filorga, Irish Spring, Lady Speed Stick, PCA SKIN, Protex, Sanex, Softsoap, Speed Stick, Ajax, Axion, Fabuloso, Murphy, Soupline and Suavitel, as well as Hill’s Science Diet and Hill’s Prescription Diet. Our rights in these trademarks endure for as long as they are used and/or registered. Although we actively develop and maintain a portfolio of patents, no single patent is considered significant to the business as a whole.\n2\nGovernment Regulations\nAs a global company, we are subject to extensive governmental regulations, including environmental rules and regulations, in the U.S. and abroad. The most significant government regulations that impact our business are discussed below. We are also subject to laws and regulations relating to sustainability, labor and employment practices, artificial intelligence and taxation. It is our policy and practice to comply with all government regulations applicable to our business. In 2024, compliance with these regulations did not have, and we do not expect such compliance in the future to have, a material adverse effect on our capital expenditures, earnings or competitive position. For further discussion of how global legal and regulatory requirements may impact our business, see Part I, Item 1A, “Risk Factors.” \nProduct Development\n: Legal and regulatory requirements apply to most aspects of our products, including their development, ingredients, formulation, manufacture, packaging, labeling, storage, transportation, distribution, export, import, advertising, sale and environmental impact. U.S. federal authorities, including the U.S. Food and Drug Administration, the Federal Trade Commission, the Consumer Product Safety Commission, the Occupational, Safety and Health Administration and the Environmental Protection Agency, regulate different aspects of our business, along with parallel authorities at the state and local levels and comparable authorities overseas.\nAnti-Corruption, Anti-Bribery, Commercial Bribery and Competition\n: We are subject to anti-corruption laws and regulations, including the U.S. Foreign Corrupt Practices Act and other laws that generally prohibit the making or offering of improper payments to foreign government officials and political figures for the purpose of obtaining or retaining business or to gain an unfair business advantage, and laws that prohibit commercial bribery. In addition, our selling practices are regulated by competition law authorities in the U.S. and abroad.\nPrivacy and Data Protection\n: Our collection, storage, transfer and/or processing of customer, consumer, employee, vendor and other stakeholder information and personal data is subject to important data protection laws and regulations in the U.S. and abroad, including the General Data Protection Regulation.\nTrade Compliance\n: We are subject to laws and sanctions imposed by the U.S., including those imposed by the U.S. Treasury Department’s Office of Foreign Asset Control (“OFAC”) and/or by other jurisdictions that may prohibit us or certain of our affiliates from doing business in certain countries or restrict the kind of business that may be conducted. For information regarding the impact of the war in Ukraine, refer to Part II, Item 7 “Management’s Discussion and Analysis of Financial Condition and Results of Operations - Executive Overview.”\nHuman Capital Management\nHuman capital matters at Colgate are managed by our Global Human Resources function, led by our Chief Human Resources Officer, with oversight from the Personnel and Organization Committee of our Board of Directors (the “Board”). As of December 31, 2024, we had approximately 34,000 employees based in over 100 countries. Approximately two-thirds of our revenues are generated from markets outside the U.S. and over 80% of our employees are located outside the U.S. Approximately 33% of our employees are based in Asia Pacific, 30% are based in Latin America, 17% are based in North America, 15% are based in Europe and 5% are based in Africa/Eurasia. Our global workforce covers a broad range of functions, from manufacturing employees to management personnel and certain of our employees are represented by unions or works councils.\nColgate’s Culture and Core Values\nColgate’s purpose is to reimagine a healthier future for all people, their pets and our planet. We believe Colgate people are crucial to our ongoing business success and aim to recruit, develop and retain strong talent with diverse backgrounds and perspectives. As the owner of the world’s most penetrated brand, our business success relies on our ability to market our brands to consumers around the world. We believe having a workforce that can speak to our consumers in an authentic manner enables us to increase our household penetration, an important part of our business strategy. We are committed to fostering a sense of belonging that embodies our purpose and values, which are essential to how we drive innovation and growth. We celebrate differences, emphasize the importance of inclusion and belonging for everyone and value the contributions of all Colgate people. At Colgate, we are proud of our collaborative spirit - what we call The Power of WE.\n3\nColgate people, working around the world, share a commitment to our three corporate values - We are Caring, We are Inclusive and We are Courageous. By encouraging Colgate people to be more caring, inclusive and courageous every day, our goal is to create a healthier future for ourselves and others. Underlying these values and our strong culture is the commitment of all Colgate people to maintain the highest ethical standards and demonstrate ethical leadership, including compliance with Colgate policies and our Code of Conduct. \nWe are committed to getting better every day in all that we do, as individuals and as teams. We seek to foster an inclusive and supportive workplace that promotes the growth and development of all employees, supported by a robust learning culture that aligns with our business needs. We are also committed to listening to our employees and seeing how the company is evolving and growing through regular employee engagement surveys. \nAs a truly global company, with employees in over 100 countries, it is important that our employees reflect the communities in which we live and work. As of December 31, 2024, our global workforce was approximately 58% male and 42% female. Women represented approximately 46% of Colgate’s executives and 35% of senior leadership. In the U.S., approximately 33% of our employees self-identify as racial/ethnic minorities, approximately 45% of our executives self-identify as racial/ethnic minorities and approximately 39% of our senior leadership self-identify as racial/ethnic minorities. In this section, “executives” refers to those employees who are eligible to participate in Colgate’s equity incentive compensation plans and “senior leadership” refers to employees who are Senior Vice Presidents and above.\nSuccession Planning\nWe have a rigorous succession planning process, led by our Global Human Resources function. Our Board is also extensively involved in succession planning and people development, with special focus on CEO succession. As part of the succession planning process, we review and discuss potential successors to key positions and examine backgrounds, capabilities and appropriate developmental assignments. \nCompensation Philosophy\nGiven the importance of Colgate people to our business success, motivating and retaining critical talent is a key focus. We view compensation as an important tool to motivate leaders at all levels of the organization. For information regarding our compensation philosophy and executive compensation programs, please see our Proxy Statement to be filed with the United States Securities and Exchange Commission (the “SEC”) in connection with the 2025 Annual Meeting of Stockholders.\nSustainability and Social Impact\nSustainability is critically important to our overall business and growth strategy. Our 2025 Sustainability & Social Impact Strategy is focused on three key ambitions - preserving our environment by accelerating action on climate change and reducing our environmental footprint; helping millions of homes by designing more sustainable products and empowering people to develop healthier habits; and driving social impact with a commitment to helping to ensure the wellbeing of all people and their pets. These ambitions are supported by actionable targets consistent with our continued commitment to building environmental and social consciousness into our decision-making.\nIn 2024, we made progress on the targets set forth in our 2025 Sustainability & Social Impact Strategy.\nReduce Plastic Waste\n: We continue to implement our first-of-its-kind recyclable toothpaste tube across our toothpaste portfolio. We introduced this tube in 2019 and, as of December 31, 2024, we have transitioned approximately 75% of our toothpaste SKUs globally and approximately 95% of our toothpaste SKUs in North America to recyclable tubes. We continue to share the tube technology with third parties and work to encourage recyclability of all tubes in practice and at scale. We are also focused on working with recycling stakeholders and partnering with key third parties to drive tube acceptance and communicating that consumers should check with their local recycling facilities to confirm tube acceptance. We also remain committed to reducing our use of new (virgin) plastic across our portfolio and continue to make progress toward our target to reduce new (virgin) plastic by one-third versus 2019. We are working towards this target with product design changes and by increasing recycled content in our packaging.\n4\nAccelerate Action on Climate Change\n: We are taking steps to accelerate action on climate change through science-based near-term, long-term and Net Zero 2040 emissions targets across our operations and value chain, which have been approved by The Science Based Targets initiative. To support our target to become Net Zero carbon in our operations by 2040, we have built a global renewable energy master plan which includes roadmaps by division to cover our manufacturing facilities and owned warehouses, global technology centers and offices. Renewable energy agreements are a valuable part of this renewable energy master plan and are key contributors to achieving our target to have 100% renewable electricity by 2030. As part of these efforts, in 2023 and 2024, we signed long-term virtual power purchase agreements in the United States and Europe, respectively. \nLead with Zero Waste Facilities\n: Our goal is to achieve TRUE certification for zero waste at 100% of our operations, which we define as our manufacturing facilities, owned and operated warehouses, global technology centers and strategic offices, by 2025. In 2024, eight more of our sites achieved TRUE certification. That brings the total number of TRUE certified sites to 44 across six continents in 26 countries, as of December 31, 2024.\nSocial Impact\n: Colgate Bright Smiles, Bright Futures is our flagship oral health education and well-being initiative. Since the program was established in 1991, we have reached approximately 1.8 billion children and their families with oral health education. Through our Hill’s Food, Shelter & Love program, we have helped over 15 million shelter pets find forever homes since 2002.\nAdditional information about our sustainability targets and efforts, including our 2023 Sustainability & Social Impact Report and our 2024 Climate Transition & Net Zero Action Plan can be found in the Sustainability section of our website at https://www.colgatepalmolive.com/sustainability. References to these reports and our website are for informational purposes only and neither the reports nor the other information on our website is incorporated by reference into this Annual Report on Form 10-K.\n5\nInformation about our Executive Officers\nThe following is a list of our executive officers as of February 13, 2025:\nName\nAge\nDate First Elected Executive Officer\nPresent Title\nNoel Wallace\n60\n2009\nChairman of the Board, President and Chief Executive Officer\nStanley J. Sutula III\n59\n2020\nChief Financial Officer\nJennifer M. Daniels\n61\n2014\nChief Legal Officer and Secretary\nPrabha Parameswaran\n66\n2019\nGroup President, Growth and Strategy\nPanagiotis Tsourapas\n60\n2019\nGroup President, Europe and Developing Markets\nSally Massey\n51\n2020\nChief Human Resources Officer\nGregory O. Malcolm\n57\n2022\nExecutive Vice President, Controller\nEach of our executive officers listed above has served the Company or our subsidiaries in various executive capacities for the past five years with the exception of Stanley J. Sutula III, Chief Financial Officer. Prior to joining the Company, Mr. Sutula was Executive Vice President and Chief Financial Officer of Pitney Bowes Inc., which he joined in 2017. \nUnder our By-Laws, our officers hold office until their respective successors are chosen and qualified or until they have resigned, retired or been removed by the affirmative vote of a majority of our Board. There are no family relationships between any of our executive officers, and there is no arrangement or understanding between any executive officer and any other person pursuant to which the executive officer was elected.\nAvailable Information\nOur website address is www.colgatepalmolive.com. The information contained on our website is not included as a part of, or incorporated by reference into, this Annual Report on Form 10-K. We make available, free of charge, on our website our Annual Reports on Form 10-K, Quarterly Reports on Form 10-Q, interactive data files posted pursuant to Rule 405 of Regulation S-T, Current Reports on Form 8-K and amendments to such reports filed or furnished pursuant to Section 13(a) or 15(d) of the Securities Exchange Act of 1934 (the “Exchange Act”) as soon as reasonably practicable after we electronically file such material with, or furnish it to, the SEC. Also available on our website are the Company’s Code of Conduct and Board Guidelines on Significant Corporate Governance Issues, the charters of the Committees of the Board, Specialized Disclosure Reports on Form SD, reports under Section 16 of the Exchange Act of transactions in Company stock by directors and executive officers and our Proxy Statements.\n6",
  "item7": "ITEM 7.    MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nExecutive Overview\nBusiness Organization\nColgate-Palmolive Company (together with its subsidiaries, “we,” “us,” “our,” the “Company” or “Colgate”) is a caring, innovative growth company reimagining a healthier future for all people, their pets and our planet. We seek to deliver consistent compounded earnings per share growth to help drive superior total shareholder return, as well as to provide Colgate people with an innovative and inclusive work environment. We do this by developing and selling science-led products globally that make people’s and their pets’ lives healthier and more enjoyable and by embracing our Sustainability & Social Impact Strategy across our organization.\nWe are tightly focused on two product segments: Oral, Personal and Home Care; and Pet Nutrition. Within these segments, we follow a closely defined business strategy to grow our key product categories and increase our overall market share. Within the categories in which we compete, we prioritize our efforts based on their capacity to maximize the use of the organization’s core competencies and strong global equities and to deliver sustainable, profitable long-term growth.\nOperationally, we are organized along geographic lines with management teams having responsibility for the business and financial results in each region. We compete in more than 200 countries and territories worldwide with established businesses in all regions contributing to our sales and profitability. Approximately two-thirds of our Net sales are generated from markets outside the U.S., with approximately 45% of our Net sales coming from emerging markets (which consist of Latin America, Asia (excluding Japan), Africa/Eurasia and Central Europe). This geographic diversity and balance help to reduce our exposure to business and other risks in any one country or part of the world. \nThe Oral, Personal and Home Care product segment is managed geographically in five reportable operating segments: North America, Latin America, Europe, Asia Pacific and Africa/Eurasia, all of which sell primarily to a variety of retailers, wholesalers, distributors, dentists and, in some geographies, skin health professionals. Through Hill’s Pet Nutrition, we also compete on a worldwide basis in the pet nutrition market, selling products principally through authorized pet supply retailers, veterinarians and eCommerce retailers. We also sell certain of our products direct-to-consumer. We are engaged in manufacturing and sourcing of products and materials on a global scale and have major manufacturing facilities, warehousing facilities and distribution centers in every region around the world.\n In connection with management changes, we realigned the reporting structure of our skin health business effective July 1, 2024. Accordingly, commencing with the quarter ended September 30, 2024, the results of the skin health business previously reported within the Europe reportable operating segment are reported with our other skin health businesses in the North America reportable operating segment, with no impact on the Company's consolidated results of operations or financial position. The Company has recast its historical geographic segment information to conform to the new reporting structure.\nOn an ongoing basis, management focuses on a variety of key indicators to monitor business health and performance. These indicators include net sales (including volume, pricing and foreign exchange components), organic sales growth (net sales growth excluding the impact of foreign exchange, acquisitions and divestments), a non-GAAP financial measure, and gross profit margin, selling, general and administrative expenses, operating profit, net income and earnings per share, in each case, on a GAAP and a non-GAAP basis, as well as measures used to optimize the management of working capital, capital expenditures, cash flow and return on capital. In addition, we review market share, household penetration and other data to assess how our brands are performing within their categories on a global and regional basis. The monitoring of these indicators and our Code of Conduct and corporate governance practices help to maintain business health and strong internal controls. For additional information regarding non-GAAP financial measures and the Company’s use of market share data and the limitations of such data, see “Non-GAAP Financial Measures” and “Market Share Information” below.\nThe War in Ukraine\nThe war in Ukraine, and the related geopolitical tensions, have had and continue to have a significant impact on our operations in Ukraine and Russia, though it has not been material to our Consolidated Financial Statements. We have no manufacturing facilities in Russia. For the year ended December 31, 2024, our business in the Eurasia region constituted approximately 1% of our consolidated net sales and approximately 2% of our consolidated operating profit. \n26\n(Dollars in Millions Except Per Share Amounts)\nWe have experienced, and expect to continue to experience, risks related to the impact of the war in Ukraine, including increases in the costs and, in certain cases, limitations on the availability of certain raw and packaging materials and commodities (including oil and natural gas), supply chain and logistics challenges, import restrictions, foreign currency volatility and reputational concerns. We also have faced and continue to face challenges to our ability to repatriate cash from Russia and identify banking partners to support our Russian operations and we may face challenges to our ability to protect our assets in Russia. We also continue to monitor the impact of sanctions, export controls and import restrictions imposed generally and in response to the war in Ukraine. \nThe Conflict in the Middle East\nThe conflict in the Middle East has not had a material impact on our Consolidated Financial Statements. Uncertainties and risks remain as to the duration of the conflict and its impact on geopolitical relations and stability in North Africa, the wider Middle East and nearby regions. The conflict has impacted and may continue to impact, among other things, supply chain and logistics, the availability and price of raw and packaging materials and commodities such as oil, consumer sentiment and consumption and category growth rates in the region.\nFor more information about factors that could impact our business, including due to geopolitical conflicts, such as the war in Ukraine and the conflict in the Middle East, refer to Part I, Item 1A “Risk Factors” of this Annual Report on Form 10-K.\nBusiness Strategy\nTo achieve our business and financial objectives, we are focused on delivering consistent compounded earnings per share growth through driving organic sales growth, operational efficiencies and leveraging the strength of our balance sheet. We believe increased household penetration and improved brand health are the keys to consistent organic sales growth and aim to achieve these through science-led, core and premium innovation, pursuing higher-growth adjacent categories and segments and expanding in faster-growing channels and markets. We aim to deliver margin expansion and cash flow growth through operating leverage and efficiency. We continue to prioritize our investments in high growth segments within our Oral Care, Personal Care and Pet Nutrition businesses. We also seek to lead in the development of human capital and to maximize the impact of our Sustainability & Social Impact Strategy. We are building and scaling our capabilities in areas such as innovation, digital, data, analytics and artificial intelligence, enabling us to be more responsive in today’s rapidly changing world. We continue to invest behind our brands, including through advertising, and to develop initiatives to build strong relationships with consumers, retailers and dental, veterinary and skin health professionals. We continue to believe that growth opportunities are greater in those areas of the world in which economic development and rising consumer incomes expand the size and number of markets for our products.\nThe investments needed to drive growth are supported through continuous, Company-wide initiatives to lower costs and increase effective asset utilization. Through these initiatives, which are referred to as our funding-the-growth initiatives, we seek to become even more effective and efficient throughout our businesses. These initiatives are designed to reduce costs associated with direct materials, indirect expenses, distribution and logistics and advertising and promotional materials, among other things, and encompass a wide range of projects, examples of which include raw material substitution, reduction of packaging materials, consolidating suppliers to leverage volumes and increasing manufacturing efficiency through SKU reductions and formulation simplification. \nSignificant Items Impacting Comparability\nDuring the quarter ended June 30, 2023, we reassessed with our legal and tax advisers certain tax deductions taken in prior years by one of our subsidiaries and concluded that it was more likely than not that the deductions would not be sustained by the courts in that jurisdiction. The value of the tax deductions was not material to us in any year in which they were taken. The cumulative effect of the change in tax position of $148 was reflected as a discrete item in the quarter ended June 30, 2023 income tax expense, partially offset by the reversal of certain prior years’ withholding tax reserves of $22 that were no longer required (hereinafter referred to as the “foreign tax matter”). The tax liability was paid in the quarter ended September 30, 2023. See Note 10, Income Taxes, to the Consolidated Financial Statements for additional information.\nDuring the quarter ended March 31, 2023, we recorded a charge of $267 as a result of a decision of the United States Court of Appeals for the Second Circuit (the “Second Circuit”) affirming a grant of summary judgment to the plaintiffs in a \n27\n(Dollars in Millions Except Per Share Amounts)\nlawsuit under the Employee Retirement Income Security Act (“ERISA”) seeking the recalculation of benefits and other relief associated with a 2005 residual annuity amendment to the Colgate-Palmolive Company Employees’ Retirement Income Plan (the “Retirement Plan”). The decision resulted in an increase in the obligations of the Retirement Plan, which based on the current funded status of the Retirement Plan and depending on further developments in the litigation, may require a cash contribution by the Company in 2025. In June 2023, we filed a petition for certiorari to the United States Supreme Court requesting permission for an appeal to that court, which was denied in October 2023. Also, in June 2023, the plaintiffs filed a motion to enter a revised final judgment in the United States District Court for the Southern District of New York (the “District Court”) to address certain unresolved calculation issues, which we opposed. In March 2024, the District Court granted the plaintiffs’ motion and found for the plaintiffs on those calculation issues. We have appealed that decision to the Second Circuit. See Note 12, Commitments and Contingencies to the Consolidated Financial Statements for additional information.\nDuring the quarter ended March 31, 2023, we announced a voluntary recall of select Fabuloso multi-purpose cleaner products sold in the United States and Canada. The costs associated with the voluntary recall had a $25 impact on our Operating profit in the quarter ended March 31, 2023. \nOn January 27, 2022, the Board approved a targeted productivity program (the “2022 Global Productivity Initiative”). All initiatives under the program have been implemented and the program concluded on December 31, 2024. The 2022 Global Productivity Initiative resulted in the reallocation of resources towards our strategic priorities and faster growth businesses, efficiencies in our operations and the streamlining of our supply chain to reduce structural costs. Total pretax charges from the implementation of the 2022 Global Productivity Initiative were $228 ($186 aftertax). Total annualized pretax savings from the 2022 Global Productivity Initiative were approximately $125 ($100 aftertax). See “Restructuring and Related Implementation Charges” below and Note 3, Restructuring and Related Implementation Charges to the Consolidated Financial Statements for additional information.\nIn the years ended December 31, 2024 and 2023, we incurred pretax costs of $85 (aftertax costs of $73) and $32 (aftertax costs of $25), respectively, resulting from the 2022 Global Productivity Initiative.\nOutlook\nLooking forward, we expect global macroeconomic, political and market conditions to remain challenging, including as a result of inflation, high interest rates, foreign currency volatility and developments in trade relations following the imposition of new and/or additional tariffs by the United States and other countries. We have taken and are taking additional pricing to try to offset the increases in raw and packaging material costs we have seen in recent years. This has negatively impacted consumer demand for our products. Additionally, inflation has impacted the broader economy with consumers around the world facing widespread rising prices as well as high interest rates resulting from measures to address inflation. \nRecent developments in trade relations and the imposition of new and/or additional tariffs by the United States and other countries, including following the United States’ February 2025 executive orders imposing tariffs on imports from Canada, Mexico and China, may contribute to inflationary pressures and, as a result, may impact consumer demand for our products. We are following the dynamic situation closely and evaluating the impact of such tariffs and any retaliatory actions taken by other countries on our business, results of operations, cash flows and financial condition. While we have made and will make efforts to mitigate the impact of these and any additional tariffs imposed by the United States and/or other countries, they could impact the cost and/or price of our products, the cost and availability of raw and packaging materials and commodities and/or consumer demand for our products due to, among other things, the impact of such tariffs on the global economy, inflationary pressures or geopolitical relations. \nSuch inflation and developments in trade relations as well as high interest rates may negatively impact consumer consumption or discretionary spending and/or change their purchasing patterns by foregoing purchasing certain of our products or by switching to “private label” or to our lower-priced product offerings. Although we continue to devote significant resources to support our brands and market our products at multiple price points, these changes could reduce demand for and sales volumes of our products or result in a shift in our product mix from higher margin to lower margin product offerings. In light of this challenging environment, we expect continued volatility across all of our categories and it is therefore difficult to predict category growth rates in the near term.\n28\n(Dollars in Millions Except Per Share Amounts)\nGiven that approximately two-thirds of our Net sales originate in markets outside the U.S., we have experienced and will likely continue to experience volatile foreign currency fluctuations, particularly in Argentina and Türkiye, which are considered hyper-inflationary economies. Effective January 1, 2025, we designated Nigeria as a hyper-inflationary economy. Consequently, the functional currency for our Nigerian subsidiary will be the U.S. dollar and the impact of all future Nigerian currency fluctuations will be recorded in income. However, this designation is not expected to have a material impact on the Company's Consolidated Financial Statements. As discussed above, we continue to experience higher raw and packaging material costs, including the impact of transactional foreign exchange. While we have taken, and will continue to take, measures to mitigate the effect of these conditions, such as our funding-the-growth and revenue growth management initiatives, in the current environment it may become increasingly difficult to implement certain of these mitigation strategies. Should these conditions persist, they could adversely affect our future results.\nWhile the global marketplace in which we operate has always been highly competitive, we continue to experience heightened competitive activity in certain markets from strong local competitors (including private label competitors), from other large multinational companies, some of which have greater resources than we do, and from new entrants into the market in many of our categories. Such activities have included more aggressive product claims and marketing challenges, as well as increased promotional spending and geographic expansion. \nWe have been negatively affected by changes in the policies and practices of our trade customers in key markets, such as inventory destocking, fulfillment requirements, technology-aided category pricing pressures, limitations on access to shelf space, delisting of our products and sustainability, supply chain and packaging standards or initiatives. In addition, the retail landscape in many of our markets continues to evolve as a result of the continued growth of eCommerce, changing consumer preferences (as consumers increasingly shop online, including to compare prices and product availability) and the increased presence of alternative retail channels, such as subscription services and direct-to-consumer businesses. We are building and scaling our capabilities in areas such as innovation, digital, data, analytics and artificial intelligence and investing behind higher growth businesses. The substantial growth in eCommerce and the emergence of alternative retail channels have created and may continue to create pricing pressures and/or adversely affect our relationships with our key retailers.\nWe continue to closely monitor the impact of geopolitical events and tensions, such as the war in Ukraine, the conflict in the Middle East, tensions between China and Taiwan and the developments in trade relations, and the challenging market conditions discussed above, on our business and the related uncertainties and risks. While we have taken, and will continue to take, measures to mitigate the effects of these events and conditions, we cannot estimate with certainty the full extent of their impact on our business, results of operations, cash flows and/or financial condition. For more information about factors that could impact our business, see “Risk Factors” in Part I, Item 1A of this Annual Report on Form 10-K. \nWe believe that we are well prepared to meet the challenges ahead due to our strong financial condition, experience operating in challenging environments, resilient global supply chain, dedicated and diverse global team and focused business strategy. Our strategy is based on delivering consistent compounded earnings per share growth through driving organic sales growth, operational efficiencies and leveraging the strength of our balance sheet. We believe increased household penetration and improved brand health are the keys to consistent organic sales growth and aim to achieve these through science-led, core and premium innovation, pursuing higher-growth adjacent categories and segments and expanding in faster-growing channels and markets. We aim to deliver margin expansion and cash flow growth through operating leverage and efficiency. We also seek to lead in the development of human capital and to maximize our Sustainability & Social Impact Strategy. Our commitment to these priorities, the strength of our brands, the breadth of our global footprint and a commitment to profitability and driving efficiency in cash generation should position us well to manage through the challenges we face and increase shareholder value over time.\n29\n(Dollars in Millions Except Per Share Amounts)\nResults of Operations\nThis section of this Annual Report on Form 10-K generally discusses 2024 and 2023 items and year-to-year comparisons between 2024 and 2023. Discussions of 2022 items and year-to-year comparisons between 2023 and 2022 that are not included in this Annual Report on Form 10-K can be found in “Management’s Discussion and Analysis of Financial Condition and Results of Operations” in Part II, Item 7 of the Company’s Annual Report on Form 10-K for the fiscal year ended December 31, 2023.\nNet Sales\nWorldwide Net sales were $20,101 in 2024, up 3.3% from 2023, driven by volume growth of 3.1% and net selling price increases of 4.4%, partially offset by negative foreign exchange of 4.1%. Organic sales (Net sales excluding, as applicable, the impact of foreign exchange, acquisitions and divestments), a non-GAAP financial measure as discussed below, increased 7.4% in 2024.\nNet sales in the Oral, Personal and Home Care product segment were $15,618 in 2024, up 3.0% from 2023, driven by volume growth of 3.7% and net selling price increases of 4.4%, partially offset by negative foreign exchange of 5.2%. Organic sales in the Oral, Personal and Home Care product segment increased 8.1% in 2024.\nThe increase in organic sales in 2024 versus 2023 was due to increases in Oral Care, Home Care and Personal Care organic sales. The increase in Oral Care was primarily due to organic sales growth in the toothpaste and manual toothbrush categories. The increase in Home Care was primarily due to organic sales growth in the surface cleaner and fabric softener categories. The increase in Personal Care was primarily due to organic sales growth in the liquid hand soap and body wash categories, partially offset by organic sales declines in the skin health category. \nThe Company’s share of the global toothpaste market was 41.4% for full year 2024, up 0.3 share points from full year 2023, and its share of the global manual toothbrush market was 32.2% for full year 2024, up 0.7 share points versus full year 2023. Full year 2024 market shares in toothpaste were up in Latin America, Europe and Africa/Eurasia, flat in Asia Pacific and down in North America versus full year 2023. In the manual toothbrush category, full year 2024 market shares were up in North America, Latin America and Asia Pacific and flat in Europe and Africa/Eurasia versus full year 2023. For additional information regarding the Company’s use of market share data and limitations of such data, see “Market Share Information” below.\nNet sales for Hill’s Pet Nutrition were $4,483 in 2024, up 4.5% from 2023, driven by volume growth of 0.8% and net selling price increases of 4.1%, partially offset by negative foreign exchange of 0.4%. Organic sales for Hill’s Pet Nutrition increased 4.9% in 2024.\nThe increase in organic sales in 2024 versus 2023 was due to increases in organic sales in the therapeutic and wellness categories.\n30\n(Dollars in Millions Except Per Share Amounts)\nGross Profit/Margin\nWorldwide Gross profit increased 7% to $12,161 in 2024 from $11,326 in 2023. Worldwide Gross profit in both periods included charges resulting from the 2022 Global Productivity Initiative. Excluding these charges in both periods, worldwide Gross profit increased to $12,181 in 2024 compared to $11,327 in 2023, reflecting an increase of $482 resulting from higher Gross profit margin and an increase of $372 resulting from higher Net sales.\nWorldwide Gross profit margin increased to 60.5% in 2024 from 58.2% in 2023. Excluding charges resulting from the 2022 Global Productivity Initiative in 2024, Gross profit margin increased to 60.6% in 2024 from 58.2% in 2023. This increase in Gross profit margin was due to cost savings from the Company’s funding-the-growth initiatives (280 bps), higher pricing (170 bps) and favorable mix (20 bps), partially offset by higher raw and packaging material costs (230 bps), which included foreign exchange transaction costs.\n2024\n2023\nGross profit, GAAP\n$\n12,161 \n$\n11,326 \n2022 Global Productivity Initiative\n20 \n1 \nGross profit, non-GAAP\n$\n12,181 \n$\n11,327 \n2024\n2023\nBasis Point Change\nGross profit margin, GAAP\n60.5 \n%\n58.2 \n%\n230 \n2022 Global Productivity Initiative\n0.1 \n%\n— \nGross profit margin, non-GAAP\n60.6 \n%\n58.2 \n%\n240 \n31\n(Dollars in Millions Except Per Share Amounts)\nSelling, General and Administrative Expenses\nSelling, general and administrative expenses increased 8% to $7,729 in 2024 from $7,151 in 2023. Selling, general and administrative expenses in both periods included charges resulting from the 2022 Global Productivity Initiative. Excluding these charges in both periods, Selling, general and administrative expenses increased to $7,723 in 2024 from $7,149 in 2023, reflecting increased advertising investment of $349 and higher overhead expenses of $225.\nSelling, general and administrative expenses as a percentage of Net sales increased to 38.5% in 2024 from 36.8% in 2023. Excluding charges resulting from the 2022 Global Productivity Initiative in both periods, Selling, general and administrative expenses as a percentage of Net sales increased to 38.4% in 2024 from 36.7% in 2023. This increase was due to increased advertising investment (130 bps) and higher overhead expenses (40 bps), both as a percentage of Net sales. In 2024, advertising investment increased as a percentage of Net sales to 13.5% from 12.2% in 2023 and increased by 14.7% in absolute terms to $2,720 as compared with $2,371 in 2023.\n2024\n2023\nSelling, general and administrative expenses, GAAP\n$\n7,729 \n$\n7,151 \n2022 Global Productivity Initiative\n(6)\n(2)\nSelling, general and administrative expenses, non-GAAP\n$\n7,723 \n$\n7,149 \n2024\n2023\nBasis Point Change\nSelling, general and administrative expenses as a percentage of Net sales, GAAP\n38.5 \n%\n36.8 \n%\n170 \n2022 Global Productivity Initiative\n(0.1)\n%\n(0.1)\n%\nSelling, general and administrative expenses as a percentage of Net sales, non-GAAP\n38.4 \n%\n36.7 \n%\n170 \n32\n(Dollars in Millions Except Per Share Amounts)\nOther (Income) Expense, Net\nOther (income) expense, net was $164 and $191 in 2024 and 2023, respectively. Other (income) expense, net in 2024 included charges resulting from the 2022 Global Productivity Initiative. Other (income) expense, net in 2023 included product recall costs and charges resulting from the 2022 Global Productivity Initiative.\n2024\n2023\nOther (income) expense, net, GAAP\n$\n164 \n$\n191 \n2022 Global Productivity Initiative\n(59)\n(24)\nProduct recall costs\n— \n(25)\nOther (income) expense, net, non-GAAP\n$\n105 \n$\n142 \nExcluding the items described above in both periods, as applicable, Other (income) expense, net was $105 in 2024 and $142 in 2023, comprised of the following:\n2024\n2023\nAmortization of intangible assets\n$\n75 \n$\n72 \nEquity income\n(22)\n(17)\nLosses (gains) from marketable securities and other assets\n6 \n11 \nIndirect tax payments (refunds)\n27 \n18 \nOther, net\n19 \n58 \nTotal Other (income) expense, net, non-GAAP\n$\n105 \n$\n142 \n33\n(Dollars in Millions Except Per Share Amounts)\nOperating Profit\nOperating profit increased 7% to $4,268 in 2024 from $3,984 in 2023. In 2024, Operating profit included charges resulting from the 2022 Global Productivity Initiative. In 2023, Operating profit included charges resulting from the 2022 Global Productivity Initiative and product recall costs. Excluding these items in both periods, as applicable, Operating profit increased 8% to $4,353 in 2024 from $4,036 in 2023 primarily due to an increase in Gross profit, partially offset by an increase in Selling, general and administrative expenses.\n    Operating profit margin was 21.2% in 2024, an increase of 70 bps compared with 20.5% in 2023. Excluding the items described above in both periods, as applicable, Operating profit margin was 21.7% in 2024, an increase of 100 bps from 20.7% in 2023, primarily due to an increase in Gross profit (240 bps), partially offset by an increase in Selling, general and administrative expenses (170 bps), both as a percentage of Net sales.\n2024\n2023\n% Change\nOperating profit, GAAP\n$\n4,268 \n$\n3,984 \n7 \n%\n2022 Global Productivity Initiative\n85 \n27 \nProduct recall costs\n— \n25 \nOperating profit, non-GAAP\n$\n4,353 \n$\n4,036 \n8 \n%\n2024\n2023\nBasis Point Change\nOperating profit margin, GAAP\n21.2 \n%\n20.5 \n%\n70 \n2022 Global Productivity Initiative\n0.5 \n%\n0.1 \n%\nProduct recall costs\n— \n%\n0.1 \n%\nOperating profit margin, non-GAAP\n21.7 \n%\n20.7 \n%\n100 \nNon-Service Related Postretirement Costs\nNon-service related postretirement costs were $87 in 2024 compared to $360 in 2023. In 2023, Non-service related postretirement costs included charges related to the ERISA litigation matter and the 2022 Global Productivity Initiative. Excluding these charges in 2023, Non-service related postretirement costs were $87 in 2024 compared to $88 in 2023.\n2024\n2023\nNon-service related postretirement costs, GAAP\n$\n87 \n$\n360 \nERISA litigation matter\n— \n(267)\n2022 Global Productivity Initiative\n— \n(5)\nNon-service related postretirement costs, non-GAAP\n$\n87 \n$\n88 \nInterest Expense\nInterest expense was $292 in 2024 as compared to $287 in 2023. \nInterest Income\nInterest income was $67 in 2024 as compared to $55 in 2023. \n34\n(Dollars in Millions Except Per Share Amounts)\nIncome Taxes\nThe effective income tax rate was 22.9% in 2024 and 27.6% in 2023. As reflected in the table below, the non-GAAP effective income tax rate was 22.7% in 2024 and 23.6% in 2023. \n2024\nIncome Before Income Taxes\nProvision For Income Taxes\n(1)\nEffective Income Tax Rate\n(2)\nAs Reported GAAP\n$\n3,956 \n$\n907 \n22.9 \n%\n2022 Global Productivity Initiative\n85 \n12 \n(0.2)\n%\nNon-GAAP\n$\n4,041 \n$\n919 \n22.7 \n%\n2023\nIncome Before Income Taxes\nProvision For Income Taxes\n(1)\nEffective Income Tax Rate\n(2)\nAs Reported GAAP\n$\n3,392 \n$\n937 \n27.6 \n%\nERISA litigation matter\n267 \n55 \n(0.5)\n%\nForeign tax matter\n— \n(126)\n(3.4)\n%\n2022 Global Productivity Initiative\n32 \n6 \n(0.1)\n%\nProduct recall costs\n25 \n6 \n— \n%\nNon-GAAP\n$\n3,716 \n$\n878 \n23.6 \n%\n(1) \nThe income tax effect on non-GAAP items is calculated based upon the tax laws and statutory income tax rates applicable in the tax jurisdiction(s) of the underlying non-GAAP adjustment. \n(2) \nThe impact of non-GAAP items on the Company’s effective tax rate represents the difference in the effective tax rate calculated with and without the non-GAAP adjustment on Income before income taxes and Provision for income taxes.\nThe effective income tax rate in all years benefited from tax planning associated with the Company’s global business initiatives.\nIn the third quarter of 2023, the Internal Revenue Service (the “IRS”) issued a notice giving taxpayers temporary relief from the effects of certain U.S. tax regulations that were issued in December 2021, which place greater restrictions on foreign taxes that are creditable against U.S. taxes on foreign-source income. This notice allowed taxpayers to defer the application of these new regulations through the end of 2023. In December 2023, the IRS issued further guidance modifying this temporary relief period to the date that a notice or other guidance withdrawing or modifying the temporary relief is issued. The Company will recognize the impact, if any, in the period in which the temporary relief is withdrawn or modified. \nDuring the quarter ended June 30, 2023, we reassessed with our legal and tax advisers certain tax deductions taken in prior years by one of our subsidiaries and concluded that it was more likely than not that the deductions would not be sustained by the courts in that jurisdiction. The value of the tax deductions was not material to us in any year in which they were taken. The cumulative effect of the change in tax position of $148 was reflected as a discrete item in the quarter ended June 30, 2023 income tax expense, partially offset by the reversal of certain prior years’ withholding tax reserves of $22 that were no longer required. The tax liability was paid in the quarter ended September 30, 2023.\nOn August 16, 2022, the Inflation Reduction Act of 2022 (the “IRA”) was enacted, which among other things, implements a 15% minimum tax on book income of certain large corporations effective for years beginning after December 31, 2022. Based on the Company’s analysis, as well as guidance published by the IRS, the IRA, and in particular the 15% minimum tax, did not have an impact on the Company’s Consolidated Financial Statements. Subsequent to the aforementioned guidance published by the IRS, on September 12, 2024, the U.S. Treasury Department and IRS released proposed regulations relating to this 15% minimum tax. Based on the Company’s analysis, these proposed regulations, if finalized in their current form, are not expected to have an impact on the Company’s Consolidated Financial Statements. However, the Company will continue to evaluate any additional guidance and clarification that becomes available.\nAdditionally, on December 15, 2022, the 27 member states of the European Union (“EU”) reached an agreement on a minimum level of taxation for certain large corporations to pay a minimum corporate tax rate of 15% in every jurisdiction in which they operate. This agreement, which is known as the Minimum Tax Directive (part of the “Pillar II Model \n35\n(Dollars in Millions Except Per Share Amounts)\nRules”), was supposed to be transposed into the laws of all EU member states by December 31, 2023. Most member states complied, while some were granted extensions of time. In addition, many other jurisdictions outside the EU have implemented a similar minimum tax regime consistent with the policy of the Pillar II Model Rules. Detailed regulations of these minimum tax regimes are still being considered in certain countries and, in some cases, enactment and timing is still uncertain. Based on current legislation and available guidance, apart from a significant additional compliance burden, Pillar II did not have a material impact as of December 31, 2024 and the Company does not believe it will have a material impact on its Consolidated Financial Statements. However, as these rules and related regulations are revised and implemented, the Company will evaluate the impact, if any, on its Consolidated Financial Statements.\nThe Company has ongoing federal, state and international income tax audits in various jurisdictions and evaluates uncertain tax positions that may be challenged by local tax authorities and not fully sustained. All U.S. federal income tax returns through December 31, 2013 have been audited by the IRS and there are limited matters which the Company plans to appeal for years 2010 through 2013. One such matter relates to the IRS assessment of taxes on the Company by imputing income on certain activities within one of our international operations, which is also under audit for the years 2014 through 2018. There were U.S. Tax Court rulings during 2023 in favor of the IRS against unrelated third parties on similar matters. Despite the U.S. Tax Court rulings, the Company continues to believe that the tax assessment against the Company is without merit. While there can be no assurances, the Company believes this matter will ultimately be decided in favor of the Company. The amount of tax plus interest for the years 2010 through 2018 is estimated to be approximately $153, which is not included in the Company’s uncertain tax positions. In May 2024, the IRS initiated an audit for the years 2019 through 2021.\n36\n(Dollars in Millions Except Per Share Amounts)\nNet income attributable to Colgate-Palmolive Company and Earnings per share\nNet income attributable to Colgate-Palmolive Company was $2,889, or $3.51 per share on a diluted basis, in 2024, an increase from $2,300, or $2.77 per share on a diluted basis, in 2023. In 2024, Net income attributable to Colgate-Palmolive Company included charges resulting from the 2022 Global Productivity Initiative. In 2023, Net income attributable to Colgate-Palmolive Company included charges resulting from the ERISA litigation matter, the foreign tax matter and the 2022 Global Productivity Initiative and product recall costs.\nExcluding the items described above in both periods, as applicable, Net income attributable to Colgate-Palmolive Company increased 10% to $2,962 in 2024 from $2,682 in 2023, and Earnings per common share on a diluted basis increased 11% to $3.60 in 2024 from $3.23 in 2023.\n2024\nIncome Before Income Taxes\nProvision For Income Taxes\n(1)\nNet Income Including Noncontrolling Interests\nLess: Income Attributable To Noncontrolling Interests\nNet Income Attributable to Colgate-Palmolive Company\nDiluted Earnings Per Share\n(2)\nAs Reported GAAP\n$\n3,956 \n$\n907 \n$\n3,049 \n$\n160 \n$\n2,889 \n$\n3.51 \n2022 Global Productivity Initiative\n85 \n12 \n73 \n— \n73 \n0.09 \nNon-GAAP\n$\n4,041 \n$\n919 \n$\n3,122 \n$\n160 \n$\n2,962 \n$\n3.60 \n2023\nIncome Before Income Taxes\nProvision For Income Taxes\n(1)\nNet Income Including Noncontrolling Interests\nLess: Income Attributable To Noncontrolling Interests\nNet Income Attributable to Colgate-Palmolive Company\nDiluted Earnings Per Share\n(2)\nAs Reported GAAP\n$\n3,392 \n$\n937 \n$\n2,455 \n$\n155 \n$\n2,300 \n$\n2.77 \nERISA litigation matter\n267 \n55 \n212 \n— \n212 \n0.26 \nForeign tax matter\n— \n(126)\n126 \n— \n126 \n0.15 \n2022 Global Productivity Initiative\n32 \n6 \n26 \n1 \n25 \n0.03 \nProduct recall costs\n25 \n6 \n19 \n— \n19 \n0.02 \nNon-GAAP\n$\n3,716 \n$\n878 \n$\n2,838 \n$\n156 \n$\n2,682 \n$\n3.23 \n(1) \nThe income tax effect on non-GAAP items is calculated based upon the tax laws and statutory income tax rates applicable in the tax jurisdiction(s) of the underlying non-GAAP adjustment.\n(2)  \nThe impact of non-GAAP adjustments on diluted earnings per share may not necessarily equal the difference between “GAAP” and “non-GAAP” as a result of rounding.\n37\n(Dollars in Millions Except Per Share Amounts)\nSegment Results\nThe Company markets its products in over 200 countries and territories throughout the world in two product segments: Oral, Personal and Home Care; and Pet Nutrition. The Company uses Operating profit as a measure of the operating segment performance because it excludes the impact of corporate-driven decisions related to interest expense and income taxes.\nOral, Personal and Home Care\nNorth America\n \n2024\n2023\n% Change\nNet sales\n$\n4,113 \n$\n4,091 \n0.5 \n%\nOperating profit\n$\n839 \n$\n871 \n(4)\n%\n% of Net sales\n20.4 \n%\n21.3 \n%\n(90)\nbps\nNet sales in North America increased 0.5% in 2024 to $4,113, driven by volume growth of 2.6%, partially offset by net selling price decreases of 1.9% and negative foreign exchange of 0.1%. Organic sales in North America increased 0.7% in 2024. The organic sales growth was driven by the United States and Canada.\nThe increase in organic sales in North America in 2024 versus 2023 was due to increases in Home Care and Oral Care organic sales, partially offset by a decrease in Personal Care organic sales. The increase in Home Care was primarily due to organic sales growth in the surface cleaner category, partially offset by an organic sales decline in the hand dish category. The increase in Oral Care was primarily due to organic sales growth in the toothpaste and manual toothbrush categories. The decrease in Personal Care was primarily due to organic sales declines in the skin health and underarm protection categories, partially offset by organic sales growth in the liquid hand soap category.\nOperating profit in North America decreased 4% in 2024 to $839, or 90 bps to 20.4% as a percentage of Net Sales. This decrease in Operating profit as a percentage of Net sales was due to an increase in Gross profit (60 bps), more than offset by an increase in Selling, general and administrative expenses (150 bps), both as a percentage of Net sales. This increase in Gross profit was primarily due to cost savings from the Company’s funding-the-growth initiatives (210 bps), partially offset by lower pricing and higher raw and packaging material costs (50 bps). This increase in Selling, general and administrative expenses was primarily due to increased advertising investment (140 bps). \n    \n38\n(Dollars in Millions Except Per Share Amounts)\nLatin America\n \n2024\n2023\n% Change\nNet sales\n$\n4,782 \n$\n4,640 \n3.1 \n%\nOperating profit\n$\n1,526 \n$\n1,417 \n8 \n%\n% of Net sales\n31.9 \n%\n30.5 \n%\n140 \nbps\nNet sales in Latin America increased 3.1% in 2024 to $4,782, driven by volume growth of 3.9% and net selling price increases of 12.9%, partially offset by negative foreign exchange of 13.7%. Organic sales in Latin America increased 16.8% in 2024. Organic sales growth was led by Argentina, Brazil and Mexico.\nThe increase in organic sales in Latin America in 2024 versus 2023 was due to increases in Oral Care,  Home Care and Personal Care organic sales. The increase in Oral Care was primarily due to organic sales growth in the toothpaste, manual toothbrush and mouthwash categories. The increase in Home Care was primarily due to organic sales growth in the surface cleaner and hand dish categories. The increase in Personal Care was primarily due to organic sales growth in the underarm protection category. \nOperating profit in Latin America increased 8% in 2024 to $1,526, or 140 bps to 31.9% as a percentage of Net sales. This increase in Operating profit as a percentage of Net sales was primarily due to an increase in Gross profit (220 bps), partially offset by an increase in Selling, general and administrative expenses (100 bps), both as a percentage of Net sales. This increase in Gross profit was due to higher pricing and cost savings from the Company’s funding-the-growth initiatives (290 bps), partially offset by significantly higher raw and packaging material costs (540 bps), which included foreign exchange transaction costs. This increase in Selling, general and administrative expenses was due to higher overhead expenses (60 bps) and increased advertising investment (50 bps). \n39\n(Dollars in Millions Except Per Share Amounts)\nEurope\n \n2024\n2023\n% Change\nNet sales\n$\n2,770 \n$\n2,571 \n7.7 \n%\nOperating profit\n$\n658 \n$\n573 \n15 \n%\n% of Net sales\n23.7 \n%\n22.3 \n%\n140 \nbps\nNet sales in Europe increased 7.7% in 2024 to $2,770, driven by volume growth of 4.1%, net selling price increases of 2.5% and positive foreign exchange of 1.1%. Organic sales in Europe increased 6.7% in 2024. Organic sales growth was led by Germany, the United Kingdom, France and Poland. \nThe increase in organic sales in Europe in 2024 versus 2023 was primarily due to increases in Oral Care and Personal Care organic sales. The increase in Oral Care was primarily due to organic sales growth in the toothpaste category. The increase in Personal Care was primarily due to organic sales growth in the body wash category. \nOperating profit in Europe increased 15% in 2024 to $658, or 140 bps to 23.7% as a percentage of Net sales. This increase in Operating profit as a percentage of Net sales was primarily due to an increase in Gross profit (370 bps), partially offset by an increase in Selling, general and administrative expense (230 bps), both as a percentage of Net sales. This increase in Gross profit was due to cost savings from the Company’s funding-the-growth initiatives (290 bps), higher pricing and favorable mix (70 bps), partially offset by higher raw and packaging material costs (100 bps). This increase in Selling, general and administrative expenses was primarily due to increased advertising investment (220 bps).\n40\n(Dollars in Millions Except Per Share Amounts)\nAsia Pacific\n \n2024\n2023\n% Change\nNet sales\n$\n2,858 \n$\n2,782 \n2.7 \n%\nOperating profit\n$\n812 \n$\n767 \n6 \n%\n% of Net sales\n28.4 \n%\n27.6 \n%\n80 \nbps\nNet sales in Asia Pacific increased 2.7% in 2024 to $2,858, driven by volume growth of 3.1% and net selling price increases of 1.0%, partially offset by negative foreign exchange of 1.3%. Organic sales in Asia Pacific increased 4.0% in 2024. Organic sales growth was led by India, the Philippines, Australia and the Greater China region.\nThe increase in organic sales in 2024 versus 2023 was primarily due to an increase in Oral Care organic sales. The increase in Oral Care was primarily due to organic sales growth in the toothpaste category.\nOperating profit in Asia Pacific increased 6% in 2024 to $812, or 80 bps to 28.4% as a percentage of Net sales. This increase in Operating profit as a percentage of Net sales was due to an increase in Gross profit (210 bps) and a decrease in Other (income) expense, net (30 bps), partially offset by an increase in Selling, general and administrative expenses (160 bps), all as a percentage of Net sales. This increase in Gross profit was due to cost savings from the Company’s funding-the-growth initiatives (280 bps) and higher pricing, partially offset by higher raw and packaging material costs (110 bps). This increase in Selling, general and administrative expenses was due to increased advertising investment (160 bps). \n    \n41\n(Dollars in Millions Except Per Share Amounts)\nAfrica/Eurasia\n \n2024\n2023\n% Change\nNet sales\n$\n1,095 \n$\n1,083 \n1.2 \n%\nOperating profit\n$\n253 \n$\n254 \n— \n%\n% of Net sales\n23.1 \n%\n23.5 \n%\n(40)\nbps\nNet sales in Africa/Eurasia increased 1.2% in 2024 to $1,095, driven by volume growth of 7.6% and net selling price increases of 5.7%, partially offset by negative foreign exchange of 12.1%. Organic sales in Africa/Eurasia increased 13.3% in 2024. Organic sales growth was led by Türkiye, Nigeria and the North Africa/Middle East region.\nThe increase in organic sales in 2024 versus 2023 was primarily due to increases in Oral Care and Home Care organic sales. The increase in Oral Care was primarily due to organic sales growth in the toothpaste and manual toothbrush categories. The increase in Home Care was primarily due to organic sales growth in the bleach category. \nOperating profit in Africa/Eurasia was flat at $253 versus 2023, and as a percentage of Net sales decreased by 40 bps to 23.1%. This decrease in Operating profit as a percentage of Net sales was due to an increase in Gross profit (140 bps), more than offset by an increase in Selling, general, and administrative expense (120 bps) and an increase in Other (income) expense, net (60 bps), all as a percentage of Net sales. This increase in Gross profit was due to cost savings from the Company’s funding-the-growth initiatives (250 bps), higher pricing and favorable mix (30 bps), partially offset by significantly higher raw and packaging material costs (340 bps), which included foreign exchange transaction costs. This increase in Selling, general and administrative expense was due to higher overhead expense (70 bps) and increased advertising investment (50 bps).\n42\n(Dollars in Millions Except Per Share Amounts)\nHill\n’\ns Pet Nutrition\n \n2024\n2023\n% Change\nNet sales\n$\n4,483 \n$\n4,290 \n4.5 \n%\nOperating profit\n$\n965 \n$\n806 \n20 \n%\n% of Net sales\n21.5 \n%\n18.8 \n%\n270 \nbps\nNet sales for Hill’s Pet Nutrition increased 4.5% in 2024 to $4,483, driven by volume growth of 0.8% and net selling price increases of 4.1%, partially offset by negative foreign exchange of 0.4%. Organic sales in Hill’s Pet Nutrition increased 4.9% in 2024. Organic sales growth was led by the United States despite a negative impact from lower private label pet nutrition sales of 210 bps.\nThe increase in organic sales in 2024 versus 2023 was due to organic sales growth in the therapeutic and wellness categories.\nOperating profit in Hill’s Pet Nutrition increased 20% in 2024 to $965, or 270 bps to 21.5% as a percentage of Net sales. This increase in Operating profit as a percentage of Net sales was primarily due to an increase in Gross profit (410 bps), partially offset by an increase in Selling, general, and administrative expense (180 bps), both as a percentage of Net sales. This increase in Gross profit was due to cost savings from the Company’s funding-the-growth initiatives (340 bps), higher pricing and favorable mix (50 bps), partially offset by higher raw and packaging material costs (170 bps). This increase in Selling, general and administrative expense was primarily due to increased advertising investment (190 bps).\n43\n(Dollars in Millions Except Per Share Amounts)\nCorporate\n \n2024\n2023\n% Change\nOperating profit (loss)\n$\n(784)\n$\n(704)\n11 \n%\nCorporate operations include Corporate overhead costs, research and development costs, stock-based compensation expense related to stock options and restricted stock unit awards, restructuring and related implementation costs and gains and losses on sales of non-core product lines. The components of Operating profit (loss) for the Corporate segment are presented as follows:\n2024\n2023\n2022 Global Productivity Initiative\n$\n(85)\n$\n(27)\nProduct Recall Costs\n— \n(25)\nCorporate overhead costs and other, net\n(699)\n(652)\nTotal Corporate Operating profit (loss)\n$\n(784)\n$\n(704)\n44\n(Dollars in Millions Except Per Share Amounts)\nRestructuring and Related Implementation Charges \n On January 27, 2022, the Board approved the 2022 Global Productivity Initiative. All initiatives under the program have been implemented and the program concluded on December 31, 2024. The 2022 Global Productivity Initiative resulted in the reallocation of resources towards the Company’s strategic priorities and faster growth businesses, efficiencies in the Company’s operations and the streamlining of its supply chain to reduce structural costs.\nOver the course of the 2022 Global Productivity Initiative, the Company incurred total pretax charges of $228 ($186 aftertax) in connection with the implementation of various projects as follows:\nTotal Program Charges\nas of December 31, 2024\nEmployee-Related Costs\n$\n175 \nIncremental Depreciation\n13 \nAsset Impairments\n1 \nOther\n39 \nTotal\n$\n228 \nTotal pretax charges resulting from the 2022 Global Productivity Initiative were comprised of the following categories: employee-related costs, including severance, pension and other termination benefits (80%); asset-related costs, primarily accelerated depreciation and asset write-downs (5%); and other charges (15%), which include contract termination costs, consisting primarily of implementation-related charges resulting directly from exit activities and the implementation of new strategies. Over the course of the 2022 Global Productivity Initiative, approximately 80% of the charges resulted in cash expenditures. \nTotal annualized pretax savings from the 2022 Global Productivity Initiative were approximately $125 ($100 aftertax).\nFor the twelve months ended December 31, 2024 and December 31, 2023, charges resulting from the 2022 Global Productivity Initiative are reflected in the income statement as follows:\nTwelve Months Ended December 31,\n2024\n2023\nGross Profit\n$\n20 \n$\n1 \nSelling, general and administrative expenses\n6 \n2 \nOther (income) expense, net\n59 \n24 \nNon-service related postretirement costs\n— \n5 \nTotal 2022 Global Productivity Initiative charges, pretax\n$\n85 \n$\n32 \nTotal 2022 Global Productivity Initiative charges, aftertax\n$\n73 \n$\n25 \nRestructuring and related implementation charges are recorded in the Corporate segment as these initiatives are predominantly centrally directed and controlled and are not included in internal measures of segment operating performance.\n45\n(Dollars in Millions Except Per Share Amounts)\nTotal charges incurred for the 2022 Global Productivity Initiative relate to initiatives undertaken by the following reportable operating segments:\nTwelve Months Ended December 31,\nTotal Program Charges\n \n2024\n2023\nNorth America\n(1)\n3 \n%\n15 \n%\n9 \n%\nLatin America \n— \n%\n— \n%\n9 \n%\nEurope\n(1)\n89 \n%\n19 \n%\n44 \n%\nAsia Pacific\n— \n%\n20 \n%\n7 \n%\nAfrica/Eurasia\n— \n%\n5 \n%\n6 \n%\nHill's Pet Nutrition\n6 \n%\n23 \n%\n11 \n%\nCorporate\n2 \n%\n18 \n%\n14 \n%\nTotal\n100 \n%\n100 \n%\n100 \n%\n(1) \nThe Company has recast its historical geographic segment information to conform to the reporting structure effective as of July 1, 2024.\nThe following table summarizes the activity for the restructuring and related implementation charges discussed above and the related accruals:\nTwelve Months Ended December 31,\n \nEmployee-Related\nCosts \nIncremental\nDepreciation \nAsset\nImpairments\nOther\nTotal\nBalance at December 31, 2022\n$\n30 \n$\n— \n$\n1 \n$\n3 \n$\n34 \nCharges\n24 \n— \n— \n8 \n32 \nCash Payments\n(45)\n— \n— \n(10)\n(55)\nCharges against assets\n(5)\n— \n(1)\n— \n(6)\nForeign exchange\n6 \n— \n— \n— \n6 \nBalance at December 31, 2023\n$\n10 \n$\n— \n$\n— \n$\n1 \n$\n11 \nCharges \n49 \n13 \n— \n23 \n85 \nCash Payments \n(20)\n— \n— \n(14)\n(34)\nCharges against assets\n— \n(13)\n— \n— \n(13)\nForeign exchange\n(5)\n— \n— \n— \n(5)\nBalance at December 31, 2024\n$\n34 \n$\n— \n$\n— \n$\n10 \n$\n44 \nEmployee-Related Costs primarily include severance and other termination benefits and are calculated based on long-standing benefit practices, written severance policies, local statutory requirements and, in certain cases, voluntary termination arrangements. Employee-Related Costs also include pension enhancements which are reflected as Charges against assets within Employee-Related Costs in the preceding table, as the corresponding balance sheet amounts are reflected as a reduction of pension assets or an increase in pension liabilities.\nIncremental Depreciation is recorded to reflect changes in useful lives and estimated residual values for long-lived assets that will be taken out of service prior to the end of their normal service period. Asset Impairments are recorded to write down inventories and assets held for sale or disposal to their fair value based on amounts expected to be realized. Charges against assets within Asset Impairments are net of cash proceeds pertaining to the sale of certain assets, as applicable.\n46\n(Dollars in Millions Except Per Share Amounts)\nNon-GAAP Financial Measures\nThis Annual Report on Form 10-K discusses certain financial measures on both a GAAP and a non-GAAP basis. The Company uses the non-GAAP financial measures described below internally in its budgeting process, to evaluate segment and overall operating performance and as a factor in determining compensation. The Company believes that these non-GAAP financial measures are useful in evaluating the Company’s underlying business performance and trends; however, this information should be considered as supplemental in nature and is not meant to be considered in isolation or as a substitute for the related financial information prepared in accordance with GAAP. In addition, these non-GAAP financial measures may not be the same as similar measures presented by other companies. \nNet sales growth (GAAP) and organic sales growth (Net sales growth excluding the impact of foreign exchange, acquisitions and divestments) (non-GAAP) are discussed in this Annual Report on Form 10-K. Management believes the organic sales growth measure provides investors and analysts with useful supplemental information regarding the Company’s underlying sales trends by presenting sales growth excluding, the external factor of foreign exchange, as well as the impact of acquisitions and divestments, as applicable. A reconciliation of organic sales growth to Net sales growth for the years ended December 31, 2024 and 2023 is provided below.\nGross profit, Gross profit margin, Selling, general and administrative expenses, Selling, general and administrative expenses as a percentage of Net sales, Other (income) expense, net, Operating profit, Operating profit margin, Non-service related postretirement costs, Effective income tax rate, Net income attributable to Colgate-Palmolive Company and Earnings per share on a diluted basis are discussed in this Annual Report on Form 10-K both on a GAAP basis and excluding, as applicable, charges resulting from the ERISA litigation matter, the foreign tax matter and the 2022 Global Productivity Initiative and product recall costs. These non-GAAP financial measures exclude items that, either by their nature or amount, management would not expect to occur as part of the Company’s normal business on a regular basis, such as restructuring charges, charges for certain litigation and tax matters, acquisition-related costs, gains and losses from certain divestitures and certain other unusual, non-recurring items. Investors and analysts use these financial measures in assessing the Company’s business performance, and management believes that presenting these financial measures on a non-GAAP basis provides them with useful supplemental information to enhance their understanding of the Company’s underlying business performance and trends. These non-GAAP financial measures also enhance the ability to compare period-to-period financial results. A reconciliation of each of these non-GAAP financial measures to the most directly comparable GAAP financial measures for the years ended December 31, 2024 and 2023 is presented within the applicable section of Results of Operations.\n47\n(Dollars in Millions Except Per Share Amounts)\nThe following tables provide a quantitative reconciliation of Net sales growth to organic sales growth for the years ended December 31, 2024 and 2023 versus the prior year:\nYear ended December 31, 2024\nNet Sales Growth\n(GAAP)\nForeign\nExchange\nImpact\nAcquisitions and Divestments\nImpact\n \nOrganic\nSales Growth\n(Non-GAAP)\nOral, Personal and Home Care\n \n \n \n \nNorth America\n(1)\n0.5%\n(0.1)%\n—%\n0.7%\nLatin America\n3.1%\n(13.7)%\n—%\n16.8%\nEurope\n(1)\n7.7%\n1.1%\n—%\n6.7%\nAsia Pacific\n2.7%\n(1.3)%\n—%\n4.0%\nAfrica/Eurasia\n1.2%\n(12.1)%\n—%\n13.3%\nTotal Oral, Personal and Home Care\n3.0%\n(5.2)%\n—%\n8.1%\nPet Nutrition\n4.5%\n(0.4)%\n—%\n4.9%\nTotal Company\n3.3%\n(4.1)%\n—%\n7.4%\nNote: Table may not sum due to rounding.\n(1) \nThe Company has recast its historical geographic segment information to conform to the reporting structure effective as of July 1, 2024.\nYear ended December 31, 2023\nNet Sales Growth\n(GAAP)\nForeign\nExchange\nImpact\nAcquisitions and Divestments\nImpact \nOrganic\nSales Growth\n(Non-GAAP)\nOral, Personal and Home Care\n \n \n \n \nNorth America\n(1)\n2.2%\n(0.2)%\n—%\n2.4%\nLatin America\n16.5%\n1.1%\n—%\n15.4%\nEurope\n(1)\n8.9%\n2.6%\n—%\n6.3%\nAsia Pacific\n(1.6)%\n(3.8)%\n—%\n2.3%\nAfrica/Eurasia\n0.1%\n(17.2)%\n—%\n17.3%\nTotal Oral, Personal and Home Care\n6.4%\n(1.4)%\n—%\n7.8%\nPet Nutrition\n15.5%\n(0.5)%\n5.4%\n10.6%\nTotal Company\n8.3%\n(1.2)%\n1.1%\n8.4%\nNote: Table may not sum due to rounding.\n(1) \nThe Company has recast its historical geographic segment information to conform to the reporting structure effective as of July 1, 2024.\nMarket Share Information \nManagement uses market share information as a key indicator to monitor business health and performance. References to market share in this Annual Report on Form 10-K are based on a combination of consumption and market share data provided by third-party vendors, primarily Nielsen, and internal estimates. All market share references represent the percentage of the dollar value of sales of our products, relative to all product sales in the category in the countries in which the Company competes and purchases data (excluding Venezuela from all periods).\n48\n(Dollars in Millions Except Per Share Amounts)\nMarket share data is subject to limitations on the availability of up-to-date information. In particular, market share data is currently not generally available for certain retail channels, such as eCommerce or certain discounters. The Company measures year-to-date market shares from January 1 of the relevant year through the most recent period for which market share data is available, which typically reflects a lag time of one or two months. The Company believes that the third-party vendors we use to provide data are reliable, but we have not verified the accuracy or completeness of the data or any assumptions underlying the data. In addition, market share information calculated by the Company may be different from market share information calculated by other companies due to differences in category definitions, the use of data from different countries, internal estimates and other factors.\n49\n(Dollars in Millions Except Per Share Amounts)\nLiquidity and Capital Resources\nThe Company expects cash flow from operations and debt issuances will be sufficient to meet foreseeable business operating and recurring cash needs (including for debt service, dividends, capital expenditures, share repurchases and acquisitions). The Company believes its strong cash generation and financial position should continue to allow it broad access to global credit and capital markets.\nCash Flow\nNet cash provided by operations increased 10% to $4,107 in 2024 as compared to $3,745 in 2023, primarily due to higher net income, partially offset by changes in working capital. The Company’s working capital as a percentage of Net sales was (5.2)% in 2024 and (1.4)% in 2023. This change in working capital as a percentage of Net sales was primarily due to higher accounts payable and accruals. The Company defines working capital as the difference between current assets (excluding Cash and cash equivalents and marketable securities, the latter of which is reported in Other current assets) and current liabilities (excluding short-term debt). \nInvesting activities used $534 of cash in 2024 compared to $742 during 2023.\nCapital expenditures in the year ended December 31, 2024 were $561, a decrease from $705 in 2023. Capital expenditures for 2025 are expected to be approximately 3.0% of Net sales. The Company continues to focus its capital spending on projects that are expected to yield high aftertax returns.\nFinancing activities used $3,389 of cash during the year ended December 31, 2024 compared to $2,793 during 2023. The increase in cash used was primarily due to higher share repurchases, partially offset by higher proceeds from the exercise of stock options. \nLong-term debt, including the current portion, decreased to $7,941 as of December 31, 2024, as compared to $8,239 as of December 31, 2023, and total debt decreased to $7,949 as of December 31, 2024 as compared to $8,549 as of December 31, 2023. During the year ended December 31, 2024, the Company redeemed at maturity $500 of ten-year Medium-Term Notes with a fixed coupon of 3.25%. The redemption was financed with commercial paper borrowings.\nIn March 2023, the Company issued $500 of three-year Senior Notes at a fixed coupon rate of 4.800%, $500 of five-year Senior Notes at a fixed coupon rate of 4.600% and $500 of ten-year Senior Notes at a fixed coupon rate of 4.600%. The Company’s debt issuances support the Company’s capital structure objectives of funding its business and growth initiatives while minimizing its risk-adjusted cost of capital.\nAt December 31, 2024, the Company had access to unused domestic and foreign lines of credit of $3,725 (including under the facility discussed below) and could also issue long-term debt pursuant to an effective shelf registration statement. \nIn November 2022, the Company entered into an amended and restated $3,000 five-year revolving credit facility with a syndicate of banks for a five-year term expiring November 2027, which replaced, on substantially similar terms, the Company’s $3,000 revolving credit facility that was scheduled to expire in August 2026. In November 2023, the Company extended the term of the credit facility for an additional year, expiring in November 2028. In November 2024, the Company further extended the term of the credit facility for an additional year, expiring in November 2029. Commitment fees related to the credit facility were not material. \nDomestic and foreign commercial paper outstanding was $936 and $906 as of December 31, 2024 and December 31, 2023, respectively. The average daily balances outstanding of commercial paper in 2024 and 2023 were $1,710 and $1,800, respectively. The Company classifies commercial paper as long-term debt when it has the intent and ability to refinance such obligations on a long-term basis, including, if necessary, by utilizing its available lines of credit (under the facilities discussed above).\n50\n(Dollars in Millions Except Per Share Amounts)\nThe following is a summary of the Company’s commercial paper as of December 31, 2024 and 2023:\n \n2024\n2023\n \nWeighted Average Interest Rate\nMaturities\nOutstanding\nWeighted Average \nInterest Rate\nMaturities\nOutstanding\nCommercial Paper\n3.0 \n%\n2025\n$\n936 \n4.0 \n%\n2024\n$\n906 \n \nCertain of the agreements with respect to the Company’s bank borrowings contain financial and other covenants as well as cross-default provisions. Noncompliance with these requirements could ultimately result in the acceleration of amounts owed. The Company is in full compliance with all such requirements and believes the likelihood of noncompliance is remote. Refer to Note 5, Long-Term Debt and Credit Facilities to the Consolidated Financial Statements for further information about the Company’s long-term debt and credit facilities.\nDividend payments in 2024 were $1,789, an increase from $1,749 in 2023. Dividend payments increased to $1.98 per share in 2024 from $1.91 per share in 2023. In the first quarter of 2024, the Company increased the quarterly common stock dividend to $0.50 per share from $0.48 per share, effective in the second quarter of 2024. \nThe Company repurchases shares of its common stock in the open market and in private transactions to maintain its targeted capital structure and to fulfill certain requirements of its compensation and benefit plans. On March 10, 2022, the Board authorized the repurchase of shares of the Company’s common stock having an aggregate purchase price of up to $5 billion under the 2022 Program, which replaced a previously authorized share repurchase program. The Board also has authorized share repurchases on an ongoing basis to fulfill certain requirements of the Company’s compensation and benefit programs. The shares are repurchased from time to time in open market or privately negotiated transactions at the Company’s discretion, subject to market conditions, customary blackout periods and other factors.\nAggregate share repurchases in 2024 consisted of approximately 18.3 million common shares under the 2022 Program and 0.4 million common shares to fulfill the requirements of compensation and benefit plans, for a total purchase price of $1,739. Aggregate repurchases in 2023 consisted of approximately 14.7 million common shares under the 2022 Program and 0.3 million common shares to fulfill the requirements of compensation and benefit plans, for a total purchase price of $1,128. Share repurchases, net of proceeds from exercise of stock options, were $1,101 and $748 in 2024 and 2023, respectively.\nCash and cash equivalents increased $130 during 2024 to $1,096 at December 31, 2024, compared to $966 at December 31, 2023. Cash and cash equivalents held by the Company’s foreign subsidiaries was $1,059 and $922, respectively, at December 31, 2024 and 2023.\nThe following represents the scheduled maturities of the Company’s contractual obligations as of December 31, 2024:\n \nTotal\n2025\n2026\n2027\n2028\n2029\nThereafter\nLong-term debt including current portion\n(1)\n$\n7,005 \n$\n652 \n$\n1,035 \n$\n509 \n$\n612 \n$\n519 \n$\n3,678 \nNet cash interest payments on long-term debt\n(2)\n2,077 \n232 \n174 \n160 \n134 \n119 \n1,258 \nOperating Leases\n655 \n126 \n108 \n101 \n80 \n58 \n182 \nPurchase obligations\n(3)\n568 \n202 \n140 \n92 \n39 \n30 \n65 \nU.S. tax reform payments \n77 \n77 \n— \n— \n— \n— \n— \nTotal\n$\n10,382 \n$\n1,289 \n$\n1,457 \n$\n862 \n$\n865 \n$\n726 \n$\n5,183 \n(1)\nThe Company classifies commercial paper as long-term debt when it has the intent and ability to refinance such obligations on a long-term basis. The amounts in this table exclude commercial paper.\n(2)\nIncludes the net interest payments on fixed and variable rate debt. Interest payments associated with floating rate instruments are based on management’s best estimate of projected interest rates for the remaining term of variable rate debt.\n(3)\nThe Company had outstanding contractual obligations with suppliers at the end of 2024 for the purchase of raw, packaging and other materials and services in the normal course of business. These purchase obligation amounts represent only those items which are based on agreements that are legally binding and that specify all significant terms including minimum quantity, price and term and do not represent total anticipated purchases.\n51\n(Dollars in Millions Except Per Share Amounts)\nLong-term liabilities associated with the Company’s postretirement plans are excluded from the table above due to the uncertainty of the timing of these cash disbursements. The amount and timing of cash funding related to these benefit plans will generally depend on the variability of the market value of the assets, changes in the benefit obligations, local regulatory requirements, various economic assumptions (the most significant of which are detailed in “Critical Accounting Policies and Use of Estimates” below) and voluntary Company contributions. Based on current information, the Company is not required to make a mandatory contribution to its qualified U.S. pension plan in 2025. The Company does not expect to make any voluntary contributions to its U.S. postretirement plans in 2025. In addition, total benefit payments expected to be paid from the Company’s assets to participants in unfunded plans are estimated to be approximately $95 for the year ending December 31, 2025.\nAdditionally, liabilities for unrecognized income tax benefits are excluded from the table above as the Company is unable to reasonably predict the ultimate amount or timing of a settlement of such liabilities. See Note 10, Income Taxes to the Consolidated Financial Statements for more information.\nAs more fully described in Note 12, Commitments and Contingencies to the Consolidated Financial Statements, the Company has commitments and contingencies with respect to lawsuits, environmental matters, taxes and other matters arising in the ordinary course of business.\n52\n(Dollars in Millions Except Per Share Amounts)\nOff-Balance Sheet Arrangements\nThe Company does not have off-balance sheet financing or unconsolidated special purpose entities.\nManaging Foreign Currency, Interest Rate, Commodity Price and Credit Risk Exposure\nThe Company is exposed to market risk from foreign currency exchange rates, interest rates and commodity price fluctuations. Volatility relating to these exposures is managed on a global basis by utilizing a number of techniques, including working capital management, selling price increases, selective borrowings in local currencies and entering into selective derivative instrument transactions, issued with standard features, in accordance with the Company’s treasury and risk management policies. The Company’s treasury and risk management policies prohibit the use of derivatives for speculative purposes and leveraged derivatives for any purpose.\nSee Note 2, Summary of Significant Accounting Policies and Note 6, Fair Value Measurements and Financial Instruments to the Consolidated Financial Statements for further discussion of derivatives and hedging policies and fair value measurements.\nForeign Exchange Risk\nAs the Company markets its products in over 200 countries and territories, it is exposed to currency fluctuations related to manufacturing and selling its products in currencies other than the U.S. dollar. The Company manages its foreign currency exposures through a combination of cost containment measures, sourcing strategies, selling price increases and the hedging of certain costs in an effort to minimize the impact on earnings of foreign currency rate movements. See “Results of Operations” above for a discussion of the foreign exchange impact on Net sales in each operating segment.\nThe assets and liabilities of foreign subsidiaries are translated into U.S. dollars at year-end exchange rates with resulting translation gains and losses accumulated in a separate component of shareholders’ equity. Income and expense items are translated into U.S. dollars at average rates of exchange prevailing during the year.\nThe Company primarily utilizes foreign currency contracts, including forward and swap contracts, option contracts, foreign and local currency deposits and local currency borrowings to hedge portions of its exposures relating to foreign currency purchases, assets and liabilities created in the normal course of business and the net investment in certain foreign subsidiaries. The duration of foreign currency contracts generally does not exceed 12 months and the contracts are valued using observable market rates.\nInterest Rate Risk\nThe Company manages its mix of fixed and floating rate debt against its target with debt issuances and by entering into interest rate swaps in order to mitigate fluctuations in earnings and cash flows that may result from interest rate volatility. The Company utilizes forward-starting interest rate swaps to mitigate the risk of variability in interest rates for future debt issuances. The notional amount, interest payment and maturity date of the swaps generally match the principal, interest payment and maturity date of the related debt, and the swaps are valued using observable benchmark rates.\nBased on year-end 2024 variable rate debt levels, a 1% increase in interest rates would have increased Interest expense by $3 in 2024.\nCommodity Price Risk\nThe Company is exposed to price volatility related to raw materials used in production, such as resins, essential oils, tropical oils, pulp, tallow, corn, poultry and soybeans. The Company manages its raw material exposures through a combination of cost containment measures, ongoing productivity initiatives and the limited use of commodity hedging contracts. Futures contracts are used on a limited basis, primarily in the Hill\n’\ns Pet Nutrition segment, to manage volatility related to anticipated raw material inventory purchases of certain traded commodities.\n53\n(Dollars in Millions Except Per Share Amounts)\nCredit Risk\nThe Company is exposed to the risk of credit loss in the event of nonperformance by counterparties to financial instrument contracts; however, nonperformance is considered unlikely and any nonperformance is unlikely to be material as it is the Company’s policy to contract with diverse, credit-worthy counterparties based upon both strong credit ratings and other credit considerations. \nRecent Accounting Pronouncements and Disclosure Rules\nIn November 2024, the Financial Accounting Standards Board (the “FASB”) issued Accounting Standards Update (“ASU”) No. 2024-04, “Debt—Debt with Conversion and Other Options (Subtopic 470-20): Induced Conversions of Convertible Debt Instruments.” This ASU clarifies the requirements for determining whether certain settlements of convertible debt instruments should be accounted for as induced conversions. This guidance is effective for the Company for fiscal years beginning after December 15, 2025 and is not expected to have an impact on the Company’s Consolidated Financial Statements. \nIn November 2024, the FASB issued ASU No. 2024-03, “Income Statement—Reporting Comprehensive Income—Expense Disaggregation Disclosures (Subtopic 220-40): Disaggregation of Income Statement Expenses.” This ASU requires additional disclosures related to the disaggregation of income statement expense categories. This guidance is effective for the Company for fiscal years beginning after December 15, 2026, and interim periods within fiscal years beginning after December 15, 2027. Other than the new disclosure requirements, this guidance will not have an impact on the Company’s Consolidated Financial Statements.  \nIn March 2024, the SEC finalized rules intended to enhance and standardize climate-related disclosures in registrants’ registration statements and Annual Reports on Form 10-K. The new rules would require climate-related disclosures, including as they relate to governance, strategy, risk management, targets and goals and greenhouse gas emissions. In addition, the rules would require certain climate-related disclosures as it relates to severe weather events and other natural conditions and carbon offsets and renewable energy credits. In April 2024, the SEC voluntarily stayed the rules due to pending judicial review. Other than the new disclosure requirements, this guidance will not have an impact on the Company’s Consolidated Financial Statements. \nIn December 2023, the FASB issued ASU No. 2023-09, “Income Taxes (Topic 740): Improvements to Income Tax Disclosures.” This ASU improves the transparency of income tax disclosure by requiring consistent categories and greater disaggregation of information in the rate reconciliation, and income taxes paid disaggregated by jurisdiction. This guidance is effective for the Company for fiscal years beginning after December 15, 2024. Other than the new disclosure requirements, this guidance will not have an impact on the Company’s Consolidated Financial Statements. \nIn December 2023, the FASB issued ASU No. 2023-08, “Intangibles—Goodwill and Other—Crypto Assets (Subtopic 350-60): Accounting for and Disclosure of Crypto Assets.” This ASU improves the accounting for certain crypto assets by requiring companies to measure them at fair value for each reporting period with changes in fair value recognized in net income. This guidance is effective for the Company for fiscal years beginning after December 15, 2024 and is not expected to have an impact on the Company’s Consolidated Financial Statements.\nIn November 2023, the FASB issued ASU No. 2023-07, “Segment Reporting (Topic 280): Improvements to Reportable Segment Disclosures.” This ASU modified the disclosure and presentation requirements primarily through enhanced disclosures of significant segment expenses and other segment items. The Company adopted this guidance in 2024. See Note 13, Segment Information to the Consolidated Financial Statements for additional information.\nIn October 2023, the FASB issued ASU No. 2023-06, “Disclosure Improvements—Codification Amendments in Response to the SEC’s Disclosure Update and Simplification Initiative.” This ASU modified the disclosure and presentation requirements of a variety of codification topics by aligning them with the SEC’s regulations. This guidance is effective for the Company no later than June 30, 2027. Other than the new disclosure requirements, this guidance will not have an impact on the Company’s Consolidated Financial Statements.\n54\n(Dollars in Millions Except Per Share Amounts)\nIn August 2023, the FASB issued ASU No. 2023-05, “Business Combinations—Joint Venture Formations (Subtopic 805-60): Recognition and Initial Measurement.” This ASU requires a joint venture to initially measure all contributions received upon its formation at fair value. This guidance is applicable to joint ventures with a formation date on or after January 1, 2025 and is not expected to have a material impact on the Company’s Consolidated Financial Statements.\nIn March 2023, the FASB issued ASU No. 2023-01, “Leases (Topic 842): Common Control Arrangements.” This ASU clarified the accounting for leasehold improvements for leases under common control. The guidance was effective for the Company beginning on January 1, 2024 and did not have a material impact on the Company’s Consolidated Financial Statements. \nIn September 2022, the FASB issued ASU No. 2022-04, “Liabilities—Supplier Finance Programs (Subtopic 405-50): Disclosure of Supplier Finance Program Obligations.” This ASU requires a buyer that uses supplier finance programs to make annual disclosures about the programs’ key terms, the balance sheet presentation of related amounts, the confirmed amount outstanding at the end of the period and associated roll-forward information. The Company adopted the guidance beginning on January 1, 2023, and with respect to the roll-forward information disclosure, beginning on January 1, 2024. See Note 15, Supplier Finance Programs to the Consolidated Financial Statements for additional information.\nCritical Accounting Policies and Use of Estimates\nThe preparation of financial statements in accordance with accounting principles generally accepted in the United States of America requires management to use judgment and make estimates. The level of uncertainty in estimates and assumptions increases with the length of time until the underlying transactions are completed. Actual results could ultimately differ from those estimates. The accounting policies that are most critical in the preparation of the Company’s Consolidated Financial Statements are those that are both important to the presentation of the Consolidated Financial Statements and require significant or complex judgments and estimates on the part of management. The Company’s critical accounting policies are reviewed periodically with the Audit Committee of the Board.\nIn certain instances, accounting principles generally accepted in the United States of America allow for the selection of alternative accounting methods. The Company’s significant policies that involve the selection of alternative methods are accounting for inventories and shipping and handling costs.\n▪\nThe Company accounts for inventories using both the first-in, first-out (\n“\nFIFO\n”\n) method (approximately 75% of inventories) and the last-in, first-out (\n“\nLIFO\n”\n) method (approximately 25% of inventories). There would have been no material impact on reported earnings for 2024 or 2023 had all inventories been accounted for under the FIFO method.\n▪\nShipping and handling costs (also referred to as logistics costs) may be reported as either a component of Cost of sales or Selling, general and administrative expenses. The Company accounts for such costs, primarily related to warehousing and outbound freight, as fulfillment costs and reports them in the Consolidated Statements of Income as a component of Selling, general and administrative expenses. Accordingly, the Company’s Gross profit margin is not comparable with the Gross profit margin of those companies that include shipping and handling charges in Cost of sales. If such costs had been included as a component of Cost of sales, the Company’s Gross profit margin would have been lower by 880 bps in 2024, 910 bps in 2023 and 1040 bps in 2022, with no impact on reported earnings.\nThe areas of accounting that involve significant or complex judgments and estimates are pensions and other retiree benefit cost assumptions, stock-based compensation, asset impairments, uncertain tax positions, tax valuation allowances and legal and other contingency reserves.\n▪\nIn accounting for pension and other postretirement benefit costs, the most significant actuarial assumptions are the discount rate and the expected long-term rate of return on plan assets. The discount rate used to measure the benefit obligation for U.S. defined benefit plans was 5.73% and 5.40% as of December 31, 2024 and 2023, respectively. The discount rate used to measure the benefit obligation for other U.S. postretirement plans was 5.74% and 5.37% as of December 31, 2024 and 2023, respectively. Discount rates used for the U.S. and international defined benefit and other postretirement plans are based on a yield curve constructed from a portfolio \n55\n(Dollars in Millions Except Per Share Amounts)\nof high-quality bonds whose projected cash flows approximate the projected benefit payments of the plans. The assumed expected long-term rate of return on plan assets for U.S. plans was 6.50% as of December 31, 2024 and 2023. In determining the expected long-term rate of return, the Company considers the nature of the plans’ investments and the historical rate of return.\nAverage annual rates of return for the U.S. plans for the most recent 1-year, 5-year, 10-year, 15-year and 25-year periods were 5%, 2%, 4%, 6% and 5%, respectively. In addition, the current assumed rate of return for the U.S. plans is based upon the nature of the plans’ investments with a target asset allocation of approximately 60% in fixed income securities, 26% in equity securities and 14% in other investments. A 1% change in the assumed rate of return on plan assets of the U.S. pension plans would impact future Net income attributable to Colgate-Palmolive Company by approximately $11. A 1% change in the discount rate for the U.S. pension plans and the other U.S. retiree benefit plan would impact future Net income attributable to Colgate-Palmolive Company by approximately $1 and $2, respectively. A third assumption is the long-term rate of compensation increase for the pension plans, a change in which would partially offset the impact of a change in either the discount rate or the expected long-term rate of return. This rate was 3.50% as of December 31, 2024 and 2023. Refer to Note 9, Retirement Plans and Other Retiree Benefits to the Consolidated Financial Statements for further discussion of the Company’s pension and other postretirement plans.\n▪\nThe assumption requiring the most judgment in accounting for other postretirement benefits (other than the discount rate noted above) is the medical cost trend rate. The Company reviews external data and its own historical trends for health care costs to determine the medical cost trend rate. The assumed rate of increase for the U.S. postretirement benefit plans is 7.00% for 2025, declining to 5.00% by 2030 and remaining at 4.50% for the years thereafter. A 1% change in the assumed long-term medical cost trend rate would impact future Net income attributable to Colgate-Palmolive Company by $2.\n▪\nThe Company recognizes the cost of employee services received in exchange for awards of equity instruments, such as stock options and restricted stock units (both performance-based and time-vested), based on the fair value of those awards at the date of grant. The Company uses the Black-Scholes-Merton (\n“\nBlack-Scholes\n”\n) option pricing model to estimate the fair value of stock option awards. The weighted-average estimated fair value of each stock option award granted in the year ended December 31, 2024 was $22.65. The Black-Scholes model uses various assumptions to estimate the fair value of stock option awards. These assumptions include the expected term of stock option awards, expected volatility rate, risk-free interest rate and expected dividend yield. While these assumptions do not require significant judgment, as the significant inputs are determined from historical experience or independent third-party sources, changes in these inputs could result in significant changes in the fair value of stock option awards. A one-year change in expected term would result in a change in fair value of approximately 7%. A 1% change in volatility would change fair value by approximately 4%. The Company uses a Monte-Carlo simulation to determine the fair value of performance-based restricted stock units at the date of grant. The Monte-Carlo simulation model uses substantially the same inputs as the Black-Scholes model. \n▪\nGoodwill and indefinite-life intangible assets, such as the Company’s global brands, are subject to impairment tests at least annually or when events or changes in circumstances indicate an asset may be impaired. In assessing impairment, the Company performs either a quantitative or a qualitative analysis.\n56\n(Dollars in Millions Except Per Share Amounts)\nDetermining the fair value of the Company’s reporting units for goodwill and the fair value of its intangible assets requires significant estimates and judgments by management. When a quantitative analysis is performed, the Company generally uses the income approach, which requires several estimates, including future cash flows consistent with management’s strategic plans, sales growth rates and the selection of royalty rates and discount rates. Estimating sales growth rates requires significant judgment by management in areas such as future economic conditions, category growth rates, product pricing, consumer tastes and preferences and future expansion expectations. In selecting an appropriate royalty rate, the Company considers the long-term profitability of the brand and recent market transactions for similar brands and products. In determining an appropriate discount rate, the Company considers the current interest rate environment and its estimated cost of capital. Other qualitative factors the Company considers, in addition to those quantitative measures discussed above, include assessments of general macroeconomic conditions, industry-specific considerations and historical financial performance. The Company generally engages a third-party valuation firm to assist it in determining the fair value of intangible assets acquired in business combinations.\nIn determining the fair value of the Company’s reporting units, fair value is also determined using the market approach, which is generally derived from metrics of comparable publicly traded companies. As multiple valuation methodologies are used, the Company also performs a qualitative analysis comparing the fair value of a reporting unit under each method to assess its reasonableness and ensure consistency of results.\nDetermining the expected life of a brand requires management judgment and is based on an evaluation of several factors including market share, brand history, future expansion expectations, the level of in-market support anticipated by management, legal or regulatory restrictions and the economic environment in the countries in which the brand is sold. \nAs of the date of the annual goodwill impairment test, the estimated fair value of the Company’s reporting units substantially exceeds their carrying value. \nAs of the date of the annual impairment test of indefinite-lived intangible assets, the fair value of one of the Company’s indefinite-lived trademark intangible assets exceeded its carrying value by less than 20%. The carrying value of this trademark is $293 as of December 31, 2024. \nGiven the inherent uncertainties of estimating the future cash flows, the impact of interest rates and inflation on macroeconomic conditions, actual results may differ from management’s current estimates, which could potentially result in impairment charges in future periods.\n▪\nThe recognition and measurement of uncertain tax positions involves consideration of the amounts and probabilities of various outcomes that could be realized upon ultimate resolution.\n▪\nTax valuation allowances are established to reduce deferred tax assets, such as tax loss carryforwards, to net realizable value. Factors considered in estimating net realizable value include historical results by tax jurisdiction, carryforward periods, income tax strategies and forecasted taxable income.\n▪\nLegal and other contingency reserves are based on management’s assessment of the risk of potential loss, which includes consultation with outside legal counsel and other advisors. Such assessments are reviewed each period and revised based on current facts and circumstances, if necessary. While it is possible that the Company’s cash flows and results of operations in a particular quarter or year could be materially affected by the impact of such contingencies, based on current knowledge it is the opinion of management that these matters will not have a material effect on the Company’s financial position, or its ongoing results of operations or cash flows. Refer to Note 12, Commitments and Contingencies to the Consolidated Financial Statements for further discussion of the Company’s contingencies.\n57\n(Dollars in Millions Except Per Share Amounts)\nThe Company generates revenue through the sale of well-known consumer products to trade customers under established trading terms. While the recognition of revenue and receivables requires the use of estimates, there is a short time frame (typically less than 60 days) between the shipment of product and cash receipt, thereby reducing the level of uncertainty in these estimates. Refer to Note 2, Summary of Significant Accounting Policies to the Consolidated Financial Statements for further description of the Company’s significant accounting policies.\n58\n(Dollars in Millions Except Per Share Amounts)\nCautionary Statement on Forward-Looking Statements\nThis Annual Report on Form 10-K may contain forward-looking statements as that term is defined in the Private Securities Litigation Reform Act of 1995 or by the SEC in its rules, regulations and releases that set forth anticipated results based on management’s current plans and assumptions. Such statements may relate, for example, to sales or volume growth, net selling price increases, organic sales growth, profit or profit margin levels, earnings per share levels, financial goals, the impact of foreign exchange, the impact of additional tariffs, the impact of geopolitical conflicts and tensions, such as the war in Ukraine, the conflict in the Middle East and tensions between China and Taiwan, cost-reduction plans, tax rates, interest rates, new product introductions, digital capabilities, commercial investment levels, acquisitions, divestitures, share repurchases or legal or tax proceedings, among other matters. These statements are made on the basis of the Company’s views and assumptions as of this time and the Company undertakes no obligation to update these statements whether as a result of new information, future events or otherwise, except as required by law or by the rules and regulations of the SEC. Moreover, the Company does not nor does any other person assume responsibility for the accuracy and completeness of those statements. The Company cautions investors that any such forward-looking statements are not guarantees of future performance and that actual events or results may differ materially from those statements. Actual events or results may differ materially because of factors that affect international businesses and global economic conditions, as well as matters specific to the Company and the markets it serves, including the uncertain macroeconomic and political environment in different countries, including as a result of inflation and higher interest rates, and its effect on consumer confidence and spending, foreign currency rate fluctuations, exchange controls, import restrictions, tariffs, sanctions, price or profit controls, labor relations, changes in foreign or domestic laws or regulations or their interpretation, political and fiscal developments, including changes in trade, tax and immigration policies, increased competition and evolving competitive practices, the ability to operate and respond effectively during a pandemic, epidemic or widespread public health concern, the ability to manage disruptions in our global supply chain and/or key office facilities, the ability to manage the availability and cost of raw and packaging materials and logistics costs, the ability to maintain or increase selling prices as needed, changes in the policies of retail trade customers, the emergence of alternative retail channels, the growth of eCommerce and the rapidly changing retail landscape, the ability to develop innovative new products and successfully adopt new technologies (such as artificial intelligence), the ability to continue lowering costs and operate in an agile manner, the ability to maintain the security of our information and operational technology systems from a cybersecurity incident or data breach, the ability to address the effects of climate change and achieve our sustainability and social impact goals, the ability to complete acquisitions and divestitures as planned, the ability to successfully integrate acquired businesses, the ability to attract and retain key employees, the uncertainty of the outcome of legal proceedings, whether or not the Company believes they have merit, and the ability to address uncertain or unfavorable global economic conditions, including inflation, disruptions in the credit markets and tax matters. For information about these and other factors that could impact the Company’s business and cause actual results to differ materially from forward-looking statements, refer to Part I, Item 1A “Risk Factors.”",
  "item2": null
}