{
  "source_file": "clx-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nThe Clorox Company\n(Dollars in millions, except per share data)\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations (MD&A) is designed to provide a reader of The Clorox Company’s (the Company or Clorox) financial statements with a narrative from the perspective of management on the Company’s financial condition, results of operations, liquidity and certain other factors that may affect future results. The following discussion of the Company’s financial condition and results of operations should be read in conjunction with MD&A and the condensed consolidated financial statements and related notes included in the Company’s Annual Report on Form 10-K for the fiscal year ended June 30, 2025, which was filed with the SEC on August 8, 2025, and the unaudited condensed consolidated financial statements and related notes contained in this Quarterly Report on Form 10-Q (this Report). Unless otherwise noted, MD&A compares the three month period ended September 30, 2025 (the current period) to the three month period ended September 30, 2024 (the prior period), with percentage and basis point calculations based on rounded numbers, except for per share data and the effective tax rate. \nEXECUTIVE OVERVIEW\nThe Clorox Company is a leading multinational manufacturer and marketer of consumer and professional products with approximately 7,600 employees worldwide. The Company has operations in approximately 25 countries or territories and sells its products in approximately 100 markets, primarily through mass retailers; grocery outlets; warehouse clubs; dollar stores; home hardware centers; drug, pet and military stores; third-party and owned e-commerce channels; and distributors. Clorox markets some of the most trusted and recognized consumer brand names, including its namesake bleach, cleaning and disinfecting products, Pine-Sol\n®\n and Tilex\n®\n cleaners; Liquid-Plumr\n®\n clog removers; Poett\n®\n home care products; Glad\n®\n bags and wraps; Fresh Step\n®\n cat litter; Kingsford\n®\n grilling products; Hidden Valley\n®\n dressings, dips, seasonings and sauces; Brita\n®\n water-filtration products; and Burt’s Bees\n®\n natural personal care products. The Company also markets industry-leading products and technologies for professional customers, including those sold under the CloroxPro\n™\n \nand Clorox Healthcare\n® \nbrand names. \nThe Company primarily markets its leading brands in midsized categories considered to be financially attractive. Most of the Company’s products compete with other nationally advertised brands within each category and with “private label” brands. About 80% of the Company’s sales are generated from brands that hold the No. 1 or No. 2 market share position in their categories.\nThe Company operates through strategic business units (SBUs) which are organized into operating segments. Operating segments are then aggregated into four reportable segments: Health and Wellness, Household, Lifestyle and International. Operating segments not aggregated into a reportable segment are reflected in Corporate and Other. The four reportable segments consist of the following: \n•\nHealth and Wellness\n consists of cleaning, disinfecting and professional products marketed and sold in the United States. Products within this segment include home care, cleaning and disinfecting products and laundry additives, primarily under the Clorox\n®\n, Clorox2\n®\n, Pine-Sol, Scentiva\n®\n, Tilex, Liquid-Plumr, and Formula 409\n®\n brands; professional cleaning and disinfecting products under the CloroxPro and Clorox Healthcare brands; and professional food service products under the Hidden Valley brand.\n•\nHousehold\n consists of bags and wraps, cat litter and grilling products marketed and sold in the United States. Products within this segment include bags and wraps under the Glad brand; cat litter, primarily under the Fresh Step\n \nand Scoop Away\n®\n brands; and grilling products under the Kingsford brand.\n•\nLifestyle\n consists of food, water filtration and natural personal care products marketed and sold in the United States. Products within this segment include dressings, dips, seasonings and sauces, primarily under the Hidden Valley brand; water-filtration products under the Brita brand; and natural personal care products under the Burt’s Bees brand.\n•\nInternational\n consists of products sold outside the United States. Products within this segment include laundry additives and home care products, primarily marketed under the Clorox, Poett, Pine-Sol and Clorinda brands; bags and wraps under the Glad brand; cat litter, primarily marketed under the Ever Clean\n® \nand Fresh Step brands and water-filtration products marketed under the Brita brand.\n19\nRECENT EVENTS AFFECTING THE COMPANY\nFor the fiscal quarter ended September 30, 2025, the Company continues to monitor macroeconomic conditions as a result of volatility in capital markets and developments in international trade policy. These evolving challenges contributed to a highly dynamic operating environment as the Company continued its efforts to drive growth, rebuild margins and drive its transformation. \nWhile inflationary headwinds have moderated, consumers continue to feel pressure as continued macroeconomic uncertainty impacts spending and prices remain elevated. United States trade policies continue to evolve, including new or increased tariffs on product imports from certain countries. These, and any future new or additional tariffs, as well as any associated retaliatory measures taken by other countries, may impact the macroeconomic environment, consumers, suppliers and the Company’s business. Though the Company has and will continue to take action to mitigate such impacts, the Company anticipates that the operating environment will remain volatile and challenging.\nThe impact of continued volatility in macroeconomic conditions and geopolitical instability, including ongoing conflicts in the Middle East and Ukraine, the potential for escalation in hostilities between the U.S. and Iran, and rising tensions between China and Taiwan, actual and potential shifts in U.S. and foreign trade, economic and other policies, have increased global macroeconomic and political uncertainty regarding the duration and resolution of the conflicts, the potential escalation of tensions and potential economic and global trade and supply chain disruptions. These factors are difficult to predict considering the rapidly evolving landscape as the Company continues to expect a variable operating environment going forward. \nThe Company has not experienced significant disruptions in its operations during the first quarter of fiscal year 2026. However, the risks of future negative impacts due to transportation, logistical or supply constraints and higher commodity costs for certain raw materials remain present, and the Company continues to experience corresponding incremental costs and gross margin pressures. \nThe Company's transformation efforts continued into fiscal year 2026. The Company has begun transitioning core U.S. operations to the new enterprise resource planning system (ERP) as part of the continuing phased implementation of its technology transformation. As expected, the Company is in the stabilization phase and has experienced some sales timing impacts in the current and previous quarter. The Company remains on track to complete implementation this fiscal year. The total incremental transformational investment is expected to be approximately $580 million. The digital foundation provided by the Company’s new ERP supports its long-term financial goals through modernized capabilities that accelerate growth and deliver stronger efficiencies.  \nFor the remainder of fiscal year 2026, the Company anticipates that the operating environment will remain volatile and challenging as consumers may face greater pressure as continued macroeconomic uncertainty impacts spending. The Company will continue to invest in its brands, capabilities and people to deliver consistent, profitable growth over time. \nFor further discussion, refer to Item 1.A, “Risk Factors” of this report and “Risk Factors” included in the Company’s Annual Report on Form 10-K for the fiscal year ended June 30, 2025. \n20\nRESULTS OF OPERATIONS\nCONSOLIDATED RESULTS\nThree months ended\n9/30/2025\n9/30/2024\n% Change\nNet sales\n$\n1,429 \n$\n1,762 \n(19)\n%\nThree months ended September 30, 2025\nPercentage change versus the year-ago period\nReported (GAAP) Net Sales Growth / (Decrease)\nReported Volume\nAcquisitions & Divestitures \n(1)\nForeign Exchange Impact\nPrice/Mix/ Other \n(2)\nOrganic Sales Growth / (Decrease) (Non-GAAP)\n (3)\nOrganic Volume \n(4)\nHealth and Wellness\n(19)\n%\n(16)\n%\n— \n%\n— \n%\n(3)\n%\n(19)\n%\n(16)\n%\nHousehold\n(19)\n(18)\n— \n— \n(1)\n(19)\n(18)\nLifestyle\n(23)\n(22)\n— \n— \n(1)\n(23)\n(22)\nInternational \n(2)\n(2)\n— \n— \n— \n(2)\n(2)\nTotal Company \n(4)(5)\n(19)\n%\n(18)\n%\n(2)\n%\n—\n \n%\n(1)\n%\n(17)\n%\n(15)\n%\n(1)\nThe divestiture impact is calculated as net sales from the Better Health VMS business after the sale date in the three month year-ago period.\n(2)\nThis represents the net impact on net sales growth / (decrease) from pricing actions, mix, trade promotion spending, mix from acquisitions and divestitures and other factors. In the three months ended September 30, 2025, the impact from divestiture mix was 1% for Total Company. \n(3)\nOrganic sales growth / (decrease) is defined as net sales growth / (decrease) excluding the effect of any acquisitions and divestitures and foreign exchange rate changes. See “Non-GAAP Financial Measures” below for reconciliation of organic sales growth / (decrease) to net sales growth / (decrease), the most directly comparable GAAP financial measure.\n(4)\nOrganic volume represents volume excluding the effect of any acquisitions and divestitures. In the three months ended September 30, 2025, the volume impact of divestitures was (3)% for Total Company. \n(5)\nTotal Company includes Corporate and Other. Corporate and Other includes the results of the Better Health VMS business through the date of divestiture.\nNet sales \nand volume\n \nin the current period decreased by 19% and 18%, respectively, driven by lower shipments in the current period following the incremental shipments related to the ERP transition in the fourth quarter of fiscal year 2025. \nThree months ended\n9/30/2025\n9/30/2024\n% Change\nGross profit\n$\n596 \n$\n807 \n(26)\n%\nGross margin\n41.7 \n%\n45.8 \n%\nGross margin\n decreased by 410 basis points in the current period from 45.8% to 41.7%. The decrease was primarily driven by lower volume and higher manufacturing and logistics costs, partially offset by cost savings.\nExpenses\nThree months ended\n% of Net Sales\n9/30/2025\n9/30/2024\n% Change\n9/30/2025\n9/30/2024\nSelling and administrative expenses\n$\n277 \n$\n281 \n(1)\n%\n19.4 \n%\n15.9 \n%\nAdvertising costs\n166 \n201 \n(17)\n11.6 \n11.4 \nResearch and development costs\n28 \n31 \n(10)\n2.0 \n1.8 \nSelling and administrative expenses\n, as a percentage of net sales, increased by 350 basis points, while dollars were essentially flat in the current period versus the prior period. The increase in selling and administrative expenses as a percentage of net sales was primarily due to lower net sales in the current period related to the ERP transition. \n21\nRESULTS OF OPERATIONS (Continued)\nAdvertising costs\n, as a percentage of net sales, increased by 20 basis points in the current period versus the prior period, while dollars decreased. The increase in advertising costs as a percentage of net sales was primarily due to lower net sales in the current period related to the ERP transition. The Company continues to support its brands. The Company’s U.S. retail advertising investments as a percentage of net sales increased from 12% to 13% versus the prior period.\nResearch and development costs\n,\n \nas a percentage of net sales, increased by 20 basis points in the current period as compared to the prior period, while dollars were essentially flat. The increase in research and development costs as a percentage of net sales was primarily due to lower net sales in the current period related to the ERP transition. The Company continues to invest in product innovation and cost savings.\n Loss on divestiture, interest expense, other (income) expense, net and the effective tax rate on earnings \nThree months ended\n9/30/2025\n9/30/2024\nLoss on divestiture\n$\n— \n$\n118 \nInterest expense\n23 \n21 \nOther (income) expense, net\n(5)\n(22)\nEffective tax rate on earnings \n23.4 \n%\n41.8 \n%\nLoss on divestiture\n of $118 in the prior period reflected the loss on the divestiture of the Better Health VMS business. See notes to condensed consolidated financial statements for further information.\nOther (income) expense, net\n was ($5) and ($22) in the current and prior periods, respectively. The variance between the current and prior periods was primarily due to lapping the benefit of insurance recoveries mainly related to the cyberattack in fiscal year 2024. \nThe effective tax rate on earnings \nwas \n23.4% \nand 41.8% for the current and prior periods, respectively.The higher tax rate in the prior period as compared to the current period was primarily driven by the nondeductibility of the loss on the divestiture of the Better Health VMS business in the prior period.\nDiluted net earnings per share\nThree months ended\n9/30/2025\n9/30/2024\n% Change\nDiluted net earnings per share\n$\n0.65 \n$\n0.80 \n(19)\n%\nDiluted net earnings per share (EPS)\n decreased by $0.15, or 19%, in the current period, primarily due to lower net sales in the current period, partially offset by the loss relating to the divestiture of the Better Health VMS business in the prior period. \n22\nSEGMENT RESULTS \nThe following presents the results of the Company’s reportable segments and Corporate and Other. See notes to condensed consolidated financial statements for further discussion of the principal measure of segment profitability used by management, segment adjusted earnings (losses) before interest and income taxes (segment adjusted EBIT): \nNet sales\nThree months ended\n9/30/2025\n9/30/2024\nHealth and Wellness\n$\n565 \n$\n698 \nHousehold\n362 \n447 \nLifestyle\n245 \n320 \nInternational\n253 \n259 \nReportable segment total\n$\n1,425 \n$\n1,724 \nCorporate and Other\n4 \n38 \nTotal\n$\n1,429 \n$\n1,762 \nSegment adjusted EBIT \n(1)\nThree months ended\n9/30/2025\n9/30/2024\nHealth and Wellness\n$\n124 \n$\n235 \nHousehold\n27\n60\nLifestyle\n38\n66\nInternational\n19\n35\nReportable segment total\n$\n208 \n$\n396 \nCorporate and Other\n(48)\n(64)\nTotal\n$\n160 \n$\n332 \nInterest income\n2\n3\nInterest expense\n(23)\n(21)\nLoss on divestiture\n—\n(118)\nCyberattack costs, net of insurance recoveries\n—\n10\nDigital capabilities and productivity enhancements investment\n(32)\n(29)\nEarnings before income taxes\n$\n107 \n$\n177 \n(1)\nSee “Non-GAAP Financial Measures” below for reconciliation of segment adjusted EBIT to earnings before income taxes, the most directly comparable GAAP financial measure. \n23\nSEGMENT RESULTS (Continued)\nHealth and Wellness\nThree months ended\n9/30/2025\n9/30/2024\n% Change\nNet sales\n$\n565 \n$\n698 \n(19)\n%\nSegment adjusted EBIT\n124 \n235 \n(47)\nVolume, net sales and segment adjusted EBIT decreased by 16%, 19% and 47%, respectively, during the current period. The volume decrease was primarily due to lower shipments in the current period following the incremental shipments related to the ERP transition in the fourth quarter of fiscal year 2025. The variance between volume and net sales was primarily due to unfavorable price mix. The decrease in segment adjusted EBIT was primarily due to lower net sales and higher manufacturing and logistics costs. \nHousehold\nThree months ended\n9/30/2025\n9/30/2024\n% Change\nNet sales\n$\n362 \n$\n447 \n(19)\n%\nSegment adjusted EBIT\n27 \n60 \n(55)\nVolume, net sales and segment adjusted EBIT decreased by 18%, 19% and 55%, respectively, during the current period. The volume decrease was primarily due to lower shipments in the current period following the incremental shipments related to the ERP transition in the fourth quarter of fiscal year 2025. The decrease in segment adjusted EBIT was mainly due to lower net sales.\nLifestyle\nThree months ended\n9/30/2025\n9/30/2024\n% Change\nNet sales\n$\n245 \n$\n320 \n(23)\n%\nSegment adjusted EBIT\n38 \n66 \n(42)\nVolume, net sales and segment adjusted EBIT decreased by 22%, 23% and 42%, respectively, during the current period. The volume decrease was primarily due to lower shipments in the current period following the incremental shipments related to the ERP transition in the fourth quarter of fiscal year 2025. The decrease in segment adjusted EBIT was primarily due to lower net sales, partially offset by lower advertising investments as compared to the prior period. \nInternational\nThree months ended\n9/30/2025\n9/30/2024\n% Change\nNet sales\n$\n253 \n$\n259 \n(2)\n%\nSegment adjusted EBIT\n19 \n35 \n(46)\nBoth volume and net sales decreased by 2%, and segment adjusted EBIT decreased by 46% during the current period. The volume decrease was primarily due to lower shipments in the current period following the incremental shipments related to the ERP transition in the fourth quarter of fiscal year 2025. The decrease in segment adjusted EBIT was primarily due to higher manufacturing and logistics costs.   \n24\nSEGMENT RESULTS (Continued)\nCorporate and Other\nCorporate and Other includes certain non-allocated administrative and other costs, various other non-operating income and expenses, as well as the results of the Better Health VMS business, through the date of divestiture. \nThree months ended\n9/30/2025\n9/30/2024\n% Change\nNet Sales\n$\n4 \n$\n38 \n(89)\n%\nSegment adjusted EBIT\n(48)\n(64)\n25 \nNet sales decreased by 89% in the current three month period due to the divestiture of the Better Health VMS business in the first quarter of fiscal year 2025. \nSegment adjusted EBIT increased by 25% in the current three month period. The increase in segment adjusted EBIT in the current three month period was primarily due to reductions in employee related expenses primarily due to lower employee incentive compensation and lower Better Health VMS operating expenses in the current period due to the divestiture. \nIn the first quarter of fiscal year 2025, the Company completed the divestiture of its Better Health VMS business. See notes to condensed consolidated financial statements for further information.\nFINANCIAL POSITION AND LIQUIDITY\nThe Company’s financial condition and liquidity remained strong as of September 30, 2025. The following table summarizes cash activities:\nThree months ended\n9/30/2025\n9/30/2024\nNet cash provided by operations\n$\n93 \n$\n221 \nNet cash (used for) provided by investing activities\n(34)\n89 \nNet cash used for financing activities\n(59)\n(237)\nOperating Activities\nNet cash provided by operations was $93 in the current three month period, compared with $221 in the prior three month period. The decrease was primarily driven by lower cash earnings partially offset by lower working capital in the current three month period (lower Accounts receivable and higher Accounts payable and accrued liabilities partially offset by higher Inventories). The lower cash earnings, lower Accounts receivable balance and higher inventories balance were primarily due to the lower shipments in the current three month period following the incremental shipments related to the ERP transition in the fourth quarter of fiscal year 2025. The higher Accounts payable and accrued liabilities balance was due to the timing of payments.\nPayment Terms Extension and Supply Chain Financing \nThe Company has arranged for a global financial institution to offer a voluntary supply chain finance (SCF) program for the benefit of the Company’s suppliers. The Company’s current payment terms do not exceed 120 days in keeping with industry standards. The Company’s operating cash flows are directly impacted as a result of the extension of payment terms with suppliers. There would not be an expected material impact to the Company’s liquidity or capital resources if the financial institution or a supplier terminated the SCF arrangement. While the Company does not have direct access to information on, or influence over, which invoices a participating supplier elects to sell to the financial institution, the Company expects that the majority of these amounts have been sold to the financial institution. Refer to the notes to condensed consolidated financial statements for detail on the SCF program.\nInvesting Activities\nNet cash used for investing activities was $34 in the current three month period, compared with net cash proceeds of $89 in the prior three month period. The year-over-year change was mainly due to net proceeds from the sale of the Better Health VMS business in the prior three month period.\n25\nFINANCIAL POSITION AND LIQUIDITY (Continued)\nFinancing Activities\nNet cash used for financing activities was $59 in the current three month period, compared with $237 in the prior three month period. The year-over-year change was mainly due to higher cash sourced from short term borrowings in the current three month period.\nCapital Resources and Liquidity\nAs of September 30, 2025\n, current liabilities exceeded current assets by $539, primarily due to the Company's Glad venture agreement terminal obligation coming due for payment in January 2026. This balance is classified within Accounts payable and accrued l\niabilities as it is reasonably expected to be settled within one year. The venture agreement terminal obligation is expected to be repaid through the Company’s anticipated ability to generate positive cash flows from operations in the future, access to capital markets enabled by our strong short-term and long-term credit ratings and current borrowing availability.\nNotwithstanding potential unforeseen adverse market conditions and as part of the Company’s regular assessment of its cash needs, the Company believes it will have the funds necessary to support its short- and long-term liquidity and operating needs, including its digital capabilities and productivity enhancements investment and venture agreement terminal obligation based on its anticipated ability to generate positive cash flows from operations in the future, access to capital markets enabled by our strong short-term and long-term credit ratings and current borrowing availability.\nVenture Agreement\nThe Company has an agreement with The Procter & Gamble Company (P&G) for the Company’s Glad bags and wraps business. As of both September 30, 2025 and June 30, 2025, P&G had a 20% interest in the venture. \nThis agreement is now scheduled to expire in January 2026 as\n the parties jointly did not opt to further extend the term of the agreement. Upon termination of the agreement, the Company is required to purchase P&G’s 20% interest for cash at fair value as established by predetermined valuation procedures. \nThe Company performed a valuation of the Glad bags and wraps business in the third quarter of fiscal year 2025 in connection with an update of the Company’s financial projections. As of September 30, 2025 and June 30, 2025 the estimated fair value of P&G’s interest in the venture was $476, of which $488 and $501, respectively, was recognized and reflected in Accounts payable and accrued liabilities in the Company’s condensed consolidated balance sheet. Changes in the judgments, assumptions and market factors used could result in significantly different estimates of fair value. The difference between the estimated fair value and the amount recognized, and any future changes in the fair value of P&G’s interest, is charged to Cost of products sold in accordance with the effective interest method over the remaining life of the agreement. Following termination, the Glad business will retain the exclusive core intellectual property licenses contributed by P&G on a royalty-free basis for the licensed products marketed.\nSee notes to condensed consolidated financial statements for further information.\nCredit Arrangements\nAs of September 30, 2025, the Company maintained a $1,200 revolving credit agreement that matures in March 2030 (the Credit Agreement). There were no borrowings under the Credit Agreement as of both September 30, 2025 and June 30, 2025, and the Company believes that borrowings under the Credit Agreement are and will continue to be available for general corporate purposes. The Credit Agreement includes certain restrictive covenants and limitations. The primary restrictive covenant is a minimum ratio of 4.0, calculated as total earnings before interest, taxes, depreciation and amortization and other similar noncash charges and certain other items (Consolidated EBITDA) to total interest expense for the trailing four quarters (Interest Coverage ratio), as defined and described in the Credit Agreement.\nThe Company was in compliance with all restrictive covenants and limitations in the Credit Agreement as of September 30, 2025 and anticipates being in compliance with all restrictive covenants for the foreseeable future.\nAs of September 30, 2025, the Company maintained $34 of foreign and other credit lines, of which $7 was outstanding.\nStock Repurchases and Dividend Payments\nAs of September 30, 2025, the Company had two stock repurchase programs: an open-market purchase program with an authorized aggregate purchase amount of up to $2,000, which has no expiration date, and a program to offset the anticipated impact of dilution related to stock-based awards (the Evergreen Program), which has no authorization limit on the dollar amount and no expiration date. During the three months ended September 30, 2025 and 2024, the Company repurchased 1,048 and 789 thousand shares of common stock at a cost of $129 and $107, respectively.  \n26\nFINANCIAL POSITION AND LIQUIDITY (Continued)\nDividends per share declared and total dividends paid to Clorox stockholders were as follows for the periods indicated: \nThree months ended\n9/30/2025\n9/30/2024\nDividends per share declared\n$\n2.48 \n$\n2.44 \nTotal dividends paid\n151 \n151 \nCONTINGENCIES\nSee notes to condensed consolidated financial statements for information on the Company’s contingencies.\nRECENTLY ISSUED ACCOUNTING STANDARDS\nSee notes to condensed consolidated financial statements for a summary of recently issued accounting standards relevant to the Company. \nNON-GAAP FINANCIAL MEASURES\nThe non-GAAP financial measures that are included in this MD&A and the reasons management believes they are useful to investors are described below. Certain non-GAAP financial measures may be considered in determining incentive compensation. These measures should be considered supplemental in nature and are not intended to be a substitute for the related financial information prepared in accordance with U.S. GAAP. In addition, these measures may not be the same as similarly named measures presented by other companies.\nAdjusted earnings before interest and income taxes (adjusted EBIT) \nrepresents earnings (losses) before income taxes excluding interest income, interest expense and other significant items that are nonrecurring or unusual (such as the pension settlement charge, incremental costs and insurance recoveries related to the August 2023 cyberattack, asset impairments, charges related to the digital capabilities and productivity enhancements investment, significant losses/(gains) related to acquisitions / divestitures and other nonrecurring or unusual items impacting comparability). Due to the nature, scope and magnitude of these costs, the Company’s management believes presenting these costs as an adjustment in the non-GAAP results provides additional information to investors about trends in the Company’s operations. See below and notes to condensed consolidated financial statements for additional information on these costs.\nThe Company uses this measure to assess the operating results and performance of its segments, monitor actual results as compared to plan, perform analytical comparisons, identify strategies to improve performance, and allocate resources to each segment. Management believes that the presentation of adjusted EBIT is useful to investors to assess operating performance on a consistent basis by removing the impact of the items that management believes does not directly reflect the performance of each segment's underlying operations. It also allows investors to view underlying operating results in the same manner as they are viewed by Company management. \nAdjusted EBIT margin\n is the ratio of adjusted EBIT to net sales.\nReconciliation of earnings before income taxes to adjusted EBIT\nThree months ended\n9/30/2025\n9/30/2024\nEarnings before income taxes\n$\n107 \n$\n177 \nInterest income\n(2)\n(3)\nInterest expense\n23 \n21 \nLoss on divestiture \n(1)\n— \n118 \nCyberattack costs, net of insurance recoveries \n(2)\n— \n(10)\nDigital capabilities and productivity enhancements investment\n (3)\n32 \n29 \nAdjusted EBIT\n$\n160 \n$\n332 \n(1)\nRepresents the loss related to the divestiture of the Better Health VMS business.  \n(2)\nRepresents incremental costs and insurance recoveries related to the cyberattack.\n(3)\nRepresents expenses related to the Company's digital capabilities and productivity enhancements investment. \n27\nNON-GAAP FINANCIAL MEASURES (Continued)\nDue to the nature, scope and magnitude of this investment, these costs are considered by management to represent incremental transformational costs above the historical normal level of spending for information technology to support operations. Since these strategic investments, including incremental operating costs, will cease at the end of the investment period, are not expected to recur in the foreseeable future and are not considered representative of the Company's underlying operating performance, the Company's management believes presenting these costs as an adjustment in the non-GAAP results provides additional information to investors about trends in the Company's operations and is useful for period-over-period comparisons. It also allows investors to view underlying operating results in the same manner as they are viewed by Company management. \nOf the total investment, approximately 75% is expected to represent incremental operating costs primarily recorded within selling and administrative expenses to be adjusted from reported earnings before income taxes for purposes of disclosing adjusted EBIT through fiscal year 2026. About 70% of these operating costs are expected to be related to the implementation of the ERP, with the remaining costs primarily related to the implementation of complementary technologies.\nDuring the three months ended September 30, 2025 and 2024, the Company incurred approximately $32 and $29, respectively, of operating expenses related to its digital capabilities and productivity enhancements investment. The expenses relate to the following:\nThree months ended\n9/30/2025\n9/30/2024\nExternal consulting fees\n (a)\n$\n25 \n$\n20 \nIT project personnel costs \n(b)\n1 \n2 \nOther \n(c)\n6 \n7 \nTotal\n$\n32 \n$\n29 \n(a)\n    Comprised of third-party consulting fees incurred to assist in the project management and end-to-end systems integration of this transformative investment. The Company relies on consultants for certain capabilities required for these programs that the Company does not maintain internally. These costs support the implementation of these programs incremental to the Company's normal IT costs and will not be incurred following implementation.\n(b)\n    Comprised of labor costs associated with internal IT project management teams that are utilized to oversee the new system implementations. Given the magnitude and transformative nature of the implementations planned, the necessary project management costs are incremental to the historical levels of spend and will no longer be incurred subsequent to implementation. As a result of this long-term strategic investment, the Company considers these costs not reflective of the ongoing costs to operate its business.\n(c)\n     Comprised of various other expenses associated with the Company’s new system implementations, including Company personnel dedicated to the project that have been backfilled with either permanent or temporary resources in positions that are considered part of normal operating expenses.\nOrganic sales growth / (decrease)\n is defined as net sales growth / (decrease) excluding the effect of foreign exchange rate changes and any acquisitions and divestitures. Management believes that the presentation of organic sales growth / (decrease) is useful to investors because it excludes sales from any acquisitions and divestitures, which results in a comparison of sales only from the businesses that the Company was operating and expects to continue to operate throughout the relevant periods, and the Company’s estimate of the impact of foreign exchange rate changes, which are difficult to predict and out of the control of the Company and management.\nThe following table provides a reconciliation of organic sales growth / (decrease) (non-GAAP) to net sales growth / (decrease) (GAAP), the most comparable GAAP measure:\nThree months ended September 30, 2025\nPercentage change versus the year-ago period\nHealth and Wellness\nHousehold\nLifestyle\nInternational\nTotal Company \n(1)\nNet sales growth / (decrease) (GAAP)\n(19)\n%\n(19)\n%\n(23)\n%\n(2)\n%\n(19)\n%\nAdd: Foreign Exchange\n— \n— \n— \n— \n— \nAdd/(Subtract): Divestitures / Acquisitions \n(2)\n— \n— \n— \n— \n2 \nOrganic sales growth / (decrease) (non-GAAP)\n(19)\n%\n(19)\n%\n(23)\n%\n(2)\n%\n(17)\n%\n(1)\nTotal Company includes Corporate and Other. Corporate and Other includes the results of the Better Health VMS business through the date of divestiture.\n(2)\nThe divestiture impact is calculated as net sales from the Better Health VMS business after the sale date in the three month year-ago period. \n28\nCAUTIONARY STATEMENT\nThis Report, including the exhibits hereto and the information incorporated by reference herein, contains “forward-looking statements” within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended, and any such forward-looking statements involve risks, assumptions and uncertainties. Except for historical information, statements about future volumes, sales, organic sales growth, foreign currencies, costs, cost savings, margins, earnings, earnings per share, diluted earnings per share, foreign currency exchange rates, tax rates, cash flows, plans, objectives, expectations, growth or profitability are forward-looking statements based on management’s estimates, beliefs, assumptions and projections. Words such as “could,” “may,” “expects,” “anticipates,” “targets,” “goals,” “projects,” “intends,” “plans,” “believes,” “seeks,” “estimates,” “will,” “predicts,” and variations on such words, and similar expressions that reflect the Company’s current views with respect to future events and operational, economic and financial performance are intended to identify such forward-looking statements. These forward-looking statements are only predictions, subject to risks and uncertainties, and actual results could differ materially from those discussed. Important factors that could affect performance and cause results to differ materially from management’s expectations, are described in the sections entitled “Risk Factors” and “Management’s Discussion and Analysis of Financial Condition and Results of Operations” in the Company’s Annual Report on Form 10-K for the fiscal year ended June 30, 2025, and in this Report, as updated from time to time in the Company’s Securities and Exchange Commission filings. These factors include, but are not limited to:\n•\nunfavorable general economic and geopolitical conditions beyond the Company’s control, including inflation, supply chain disruptions, labor shortages, wage pressures, fuel and energy costs, interest rate fluctuations, foreign currency exchange rate fluctuations, weather events or natural disasters, disease outbreaks or pandemics, terrorism, and unstable geopolitical conditions, including ongoing conflicts and rising tensions in the Middle East and/or Ukraine and rising tensions between China and Taiwan, as well as macroeconomic and geopolitical volatility and uncertainty as a result of a number of these and other factors, including actual and potential shifts in U.S. and foreign trade policies, including as a result of escalating trade tensions between the U.S. and its trading partners, especially China, particularly as a result of the imposition of U.S. and retaliatory tariffs;\n•\nthe impact of market and category declines,  and the Company’s product and geographic mix on its ability to meet sales growth targets;\n•\nthe ability of the Company to successfully execute or realize the anticipated benefits of its strategic or transformational initiatives, including the ERP transition and the related timing and volume of shipment movement related to the ERP transition;\n•\nthe impact of the changing retail environment, including the growth of alternative retail channels and business models, and changing consumer preferences;\n•\nintense competition in the Company’s markets;\n•\nvolatility and increases in the costs of raw materials, energy, transportation, labor and other necessary supplies or services;\n•\nrisks related to supply chain issues, product shortages and disruptions to the business, as a result of increased supply chain dependencies due to an expanded supplier network and a reliance on certain single-source suppliers;\n•\nrisks related to the Company’s use of and reliance on information technology systems, including potential and actual security breaches, cyberattacks, privacy breaches or data breaches that result in the unauthorized disclosure of consumer, customer, employee or Company information, business, service or operational disruptions, or that impact the Company’s financial results or financial reporting, or any resulting unfavorable outcomes, increased costs or legal proceedings;\n•\nthe ability of the Company to innovate and to develop and introduce commercially successful products, or expand into adjacent categories and countries;\n•\nthe ability of the Company to successfully manage global political, legal, tax and regulatory risks,  including due to regulatory uncertainty and lack of regulatory convergence among different jurisdictions; \n•\nlower revenue, increased costs, other financial statement impacts or reputational harm resulting from government actions, compliance with regulations, or any material costs imposed by changes in regulation;\n•\nthe Company’s ability to maintain its business reputation and the reputation of its brands and products;\n•\ndependence on key customers and risks related to customer consolidation and ordering patterns;\n29\nCAUTIONARY STATEMENT (Continued)\n•\nthe Company’s ability to attract and retain key personnel, which may continue to be impacted by challenges in the labor market, such as increasing labor costs and sustained labor shortages;\n•\nchanges to the Company’s processes and procedures as a result of its digital capabilities and productivity enhancements that may result in changes to the Company’s internal controls over financial reporting;\n•\nrisks related to the acquisition of P&G’s interest in the Glad business;\n•\nrisks related to international operations and international trade, including changing macroeconomic conditions as a result of inflation, volatile commodity prices and increases in raw and packaging materials prices, labor, energy and logistics; global economic or political instability; foreign currency fluctuations, such as devaluations, and foreign currency exchange rate controls; changes in governmental policies, including trade policy and tariffs, travel or immigration restrictions, new or additional tariffs, and price or other controls; labor claims and civil unrest; potential operational or supply chain disruptions from wars and military conflicts, including ongoing conflicts and rising tensions in the Middle East and/or Ukraine and rising tensions between China and Taiwan; potential negative impact and liabilities from the use, storage and transportation of chlorine in certain international markets where chlorine is used in the production of bleach; widespread health emergencies; and the possibility of nationalization, expropriation of assets or other government action or inaction, including the impacts of a prolonged U.S. government shutdown;\n•\nthe impact of  climate change and other sustainability issues on sales, operating costs, reputation or stakeholder relationships;\n•\nthe impact of product liability claims, labor claims and other legal, governmental or tax proceedings, including in foreign jurisdictions and in connection with any product recalls;\n•\nrisks relating to acquisitions, new ventures and divestitures, and associated costs, including for asset impairment charges related to, among others, intangible assets, including trademarks and goodwill; and the ability to complete announced transactions and, if completed, integration costs and potential contingent liabilities related to those transactions;\n•\nthe accuracy of the Company’s estimates and assumptions on which its financial projections, including any sales or earnings guidance or outlook it may provide from time to time, are based;\n•\nrisks related to the Company's reliance on third-party service providers, including inability to meet cost savings or efficiencies, business or systems disruptions, and other liabilities, including legal or regulatory risk;\n•\nenvironmental matters, including costs associated with the remediation and monitoring of past contamination, and possible increases in costs resulting from actions by relevant regulators, and the handling and/or transportation of hazardous substances; \n•\nthe Company’s ability to effectively utilize, assert and defend its intellectual property rights, and any infringement or claimed infringement by the Company of third-party intellectual property rights;\n•\nthe effect of the Company’s indebtedness and credit rating on its business operations and financial results and the Company’s ability to access capital markets and other funding sources, as well as the cost of capital to the Company;\n•\nthe Company’s ability to pay and declare dividends or repurchase its stock in the future; and\n•\nthe impacts of potential stockholder activism.\nThe Company’s forward-looking statements in this Report are based on management’s current views, beliefs, assumptions and expectations regarding future events and speak only as of the date of this Report. The Company undertakes no obligation to publicly update or revise any forward-looking statements, whether as a result of new information, future events or otherwise, except as required by the federal securities laws. \nIn this Report, unless the context requires otherwise, the terms “the Company,” “Clorox,” “we,” “us,” and “our” refer to The Clorox Company and its subsidiaries. \n30"
}