{
  "source_file": "cme-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "ITEM 2.\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe following discussion is provided as a supplement to, and should be read in conjunction with, the accompanying unaudited consolidated financial statements and notes in this Quarterly Report on Form 10-Q and our Annual Report on Form 10-K for the year ended December 31, 2024, filed with the SEC on February 27, 2025. \nReferences in this discussion and analysis to “we” and “our” are to CME Group Inc. (CME Group) and its consolidated subsidiaries, collectively. References to “exchange” are to Chicago Mercantile Exchange Inc. (CME), the Board of Trade of the City of Chicago, Inc. (CBOT), New York Mercantile Exchange, Inc. (NYMEX), and Commodity Exchange, Inc. (COMEX), collectively, unless otherwise noted. \nRESULTS OF OPERATIONS\nFinancial Highlights\nThe following summarizes significant changes in our financial performance for the periods presented.\n \nQuarter Ended \nSeptember 30,\n \nNine Months Ended \nSeptember 30,\n \n(dollars in millions, except per share data)\n2025\n2024\nChange\n2025\n2024\nChange\nTotal revenues\n$\n1,537.6 \n$\n1,584.4 \n(3)\n%\n$\n4,871.9 \n$\n4,604.8 \n6 \n%\nTotal expenses\n565.0 \n560.2 \n1 \n1,662.0 \n1,620.4 \n3 \nOperating margin\n63.3 \n%\n64.6 \n%\n65.9 \n%\n64.8 \n%\nNon-operating income (expense)\n$\n204.4 \n$\n152.7 \n34 \n$\n542.2 \n$\n460.4 \n18 \nEffective tax rate\n22.9 \n%\n22.4 \n%\n23.0 \n%\n23.0 \n%\nNet income \n$\n908.0 \n$\n912.8 \n(1)\n$\n2,889.3 \n$\n2,651.2 \n9 \nDiluted earnings per common share\n2.49 \n2.50 \n— \n7.92 \n7.27 \n9 \nCash flows from operating activities\n3,143.2 \n2,672.6 \n18 \n Revenues\n \nQuarter Ended \nSeptember 30,\nNine Months Ended \nSeptember 30,\n \n(dollars in millions)\n2025\n2024\nChange\n2025\n2024\nChange\nClearing and transaction fees\n$\n1,227.9 \n$\n1,297.1 \n(5)\n%\n$\n3,953.2 \n$\n3,755.9 \n5 \n%\nMarket data and information services\n202.5 \n178.2 \n14 \n595.1 \n528.6 \n13 \nOther\n107.2 \n109.1 \n(2)\n323.6 \n320.3 \n1 \nTotal Revenues\n$\n1,537.6 \n$\n1,584.4 \n(3)\n$\n4,871.9 \n$\n4,604.8 \n6 \nClearing and Transaction Fees\nFutures and Options Contracts\nThe following table summarizes our total contract volume, revenue and average rate per contract for futures and options. Total contract volume includes contracts that are traded on our exchange and cleared through our clearing house and certain cleared-only contracts. Volume is measured in round turns, which is considered a completed transaction that involves a purchase and an offsetting sale of a contract. Average rate per contract is determined by dividing total clearing and transaction fees by total contract volume. Contract volume and average rate per contract disclosures exclude trading volume for the cash markets business and interest rate swaps volume.  \nQuarter Ended \nSeptember 30,\nNine Months Ended \nSeptember 30,\n \n2025\n2024\nChange\n2025\n2024\nChange\nTotal contract volume \n(in millions)\n1,620.6 \n1,810.5 \n(10)\n%\n5,309.8 \n5,052.8 \n5 \n%\nClearing and transaction fees \n(in millions)\n$\n1,137.6 \n$\n1,205.3 \n(6)\n$\n3,675.9 \n$\n3,479.3 \n6 \nAverage rate per contract\n$\n0.702 \n$\n0.666 \n5 \n$\n0.692 \n$\n0.689 \n1 \n24\nTable of Contents\n \nWe estimate the following net changes in clearing and transaction fees based on the changes in total contract volumes and the changes in average rate per contract for futures and options during the third quarter and first nine months of 2025 when compared with the same periods in 2024.\n \n(in millions)\nQuarter Ended\nNine Months Ended\nIncrease (decrease) due to changes in total contract volume\n$\n(133.4)\n$\n178.0 \nIncreases due to changes in average rate per contract\n65.7 \n18.6 \nNet increase (decrease) in clearing and transaction fees\n$\n(67.7)\n$\n196.6 \nAverage rate per contract is impacted by our rate structure, including volume-based incentives; product mix; trading venue; and the percentage of volume executed by customers who are members compared with non-member customers. Due to the relationship between average rate per contract and contract volume, the change in clearing and transaction fees attributable to changes in each is only an approximation.\nContract Volume\nThe following table summarizes average daily contract volume. Contract volume can be influenced by many factors, including political and economic conditions, the regulatory environment and market competition. \nQuarter Ended \nSeptember 30,\nNine Months Ended \nSeptember 30,\n(amounts in thousands)\n2025\n2024\nChange\n2025\n2024\nChange\nAverage Daily Volume by Product Line:\nInterest rates\n13,378\n14,881\n(10)\n%\n14,611\n13,877\n5 \n%\nEquity indexes\n6,278\n7,407\n(15)\n7,297\n7,018\n4 \nForeign exchange\n834\n1,088\n(23)\n1,024\n1,050\n(3)\nAgricultural commodities\n1,712\n1,614\n6 \n1,876\n1,696\n11 \nEnergy\n2,295\n2,571\n(11)\n2,754\n2,478\n11 \nMetals\n825\n728\n13 \n833\n758\n10 \nAggregate average daily volume\n25,322\n28,289\n(10)\n28,395\n26,877\n6 \nAverage Daily Volume by Venue:\nCME Globex\n23,418\n26,199\n(11)\n26,377\n24,792\n6 \nOpen outcry\n989\n1,096\n(10)\n955\n1,082\n(12)\nPrivately negotiated\n915\n994\n(8)\n1,063\n1,003\n6 \nAggregate average daily volume\n25,322\n28,289\n(10)\n28,395\n26,877\n6 \nElectronic Volume as a Percentage of Total Volume\n92 \n%\n93 \n%\n93 \n%\n92 \n%\nMarket uncertainty remained high through the first half of 2025. Interest rate, equity and foreign exchange markets experienced significant uncertainty surrounding the economic impacts of anticipated and implemented tariffs and the effect they may have on the United States Federal Reserve’s (Federal Reserve) interest rate policy decision. In addition, market uncertainty also remained high within the energy, metals and agricultural commodities markets in the first half of 2025, mainly as a result of new and existing geopolitical tensions, including the anticipation and implementation of tariffs, as well as uncertain weather conditions in 2025. However, in the third quarter of 2025, overall market volatility subsided relative to periods of very high volatility earlier in the year as market uncertainty tapered as a result of consistent inflation data and more clarity surrounding the Federal Reserve's interest rate policy decision. We believe these factors contributed to an increase in volume in the first nine months of 2025 when compared with the same periods in 2024 and lower volume in the third quarter of 2025.\n25\nTable of Contents\n \nInterest Rate Products\nThe following table summarizes average daily contract volume for our key interest rate products. \n \n \nQuarter Ended \nSeptember 30,\n \nNine Months Ended \nSeptember 30,\n \n(amounts in thousands)\n2025\n2024\nChange\n2025\n2024\nChange\nSOFR futures and options:\nFutures expiring within two years\n2,725 \n3,044 \n(10)\n%\n3,001 \n2,676 \n12 \n%\nOptions\n1,560 \n1,790 \n(13)\n1,456 \n1,661 \n(12)\nFutures expiring beyond two years\n962 \n1,069 \n(10)\n1,111 \n954 \n16 \nU.S. Treasury futures and options:\n10-Year\n2,817 \n3,376 \n(17)\n3,319 \n3,279 \n1 \n5-Year\n1,900 \n2,088 \n(9)\n2,124 \n2,014 \n6 \n2-Year\n1,058 \n1,142 \n(7)\n1,126 \n1,045 \n8 \nTreasury Bond\n684 \n699 \n(2)\n774 \n701 \n10 \nUltra T-Note\n662 \n668 \n(1)\n750 \n669 \n12 \nUltra T-Bond\n416 \n427 \n(3)\n438 \n421 \n4 \nFederal Funds futures and options\n555 \n529 \n5 \n468 \n414 \n13 \nIn the third quarter of 2025, interest rate contract volume was lower compared to the same period in 2024, due to lower overall market volatility. We believe the lower volatility was a result of more clarity surrounding the Federal Reserve's interest rate policy decision as well as consistent trends in inflation data.\nOverall interest rate contract volume increased in the first nine months of 2025 when compared with the same period in 2024, due to higher overall volatility in early 2025. We believe this was due to market uncertainty surrounding the Federal Reserve's interest rate policy decision as well as mixed inflation data in the first half of 2025. In addition, new and existing geopolitical tensions as well as the potential economic impacts of anticipated and implemented tariffs also led to higher overall volatility in the first half of 2025. We believe these factors contributed to higher overall interest rate volume in the first nine months of 2025 when compared with the same period in 2024. \nEquity Index and Cryptocurrency Products\nThe following table summarizes average daily contract volume for our key equity index and cryptocurrency products. \n \n \nQuarter Ended \nSeptember 30,\n \nNine Months Ended \nSeptember 30,\n \n(amounts in thousands)\n2025\n2024\nChange\n2025\n2024\nChange\nE-mini S&P 500 futures and options\n3,454 \n4,320 \n(20)\n%\n4,099 \n4,136 \n(1)\n%\nE-mini Nasdaq 100 futures and options\n1,888 \n2,277 \n(17)\n2,293 \n2,127 \n8 \nE-mini Russell 2000 futures and options\n272 \n337 \n(19)\n300 \n319 \n(6)\nE-mini Dow futures and options\n176 \n262 \n(33)\n228 \n247 \n(7)\nEther futures and options\n239 \n46 \nn.m.\n146 \n36 \nn.m.\nBitcoin futures and options\n86 \n59 \n45 \n92 \n53 \n72 \n_________\nn.m. not meaningful\nEquity index contract volume decreased in the third quarter of 2025 when compared with the same period in 2024 due to lower overall equity market volatility. We believe lower market volatility was a result of less uncertainty surrounding the Federal Reserve's interest rate policy decision as well as consistent trends in inflation data. \nOverall equity index contract volume increased in the first nine months of 2025 when compared with the same period in 2025, due to higher overall volatility in early 2025. We believe this was due to new and existing geopolitical tensions as well as the potential economic impacts of anticipated and implemented tariffs in the first half of 2025. \nIn addition, we believe volumes for our cryptocurrency products were higher as a result of the broader acceptance of cryptocurrency products. \n26\nTable of Contents\n \nForeign Exchange Products\nThe following table summarizes average daily contract volume for our key foreign exchange products.\n \nQuarter Ended \nSeptember 30,\nNine Months Ended \nSeptember 30,\n(amounts in thousands)\n2025\n2024\nChange\n2025\n2024\nChange\nEuro\n223 \n257 \n(13)\n%\n267 \n257 \n4 \n%\nJapanese Yen\n156 \n227 \n(31)\n192 \n201 \n(5)\nBritish Pound\n93 \n126 \n(26)\n110 \n123 \n(10)\nAustralian dollar\n86 \n125 \n(31)\n106 \n119 \n(11)\nCanadian dollar\n66 \n105 \n(37)\n96 \n104 \n(7)\nIn the third quarter and first nine months of 2025, overall foreign exchange volumes decreased when compared with the same periods in 2024 due to lower market volatility. We believe this was the result of less uncertainty surrounding the global central bank's interest rate policies as well as consistent trends in inflation data, which has led to overall decreases in foreign exchange contract volumes.\nAgricultural Commodity Products\nThe following table summarizes average daily contract volume for our key agricultural commodity products.\n \nQuarter Ended \nSeptember 30,\nNine Months Ended \nSeptember 30,\n(amounts in thousands)\n2025\n2024\nChange\n2025\n2024\nChange\nCorn\n493 \n481 \n2 \n%\n583 \n509 \n14 \n%\nSoybean\n347 \n329 \n6 \n373 \n352 \n6 \nWheat\n206 \n196 \n5 \n246 \n234 \n5 \nOverall commodity contract volumes increased in the third quarter and first nine months of 2025 when compared with the same periods in 2024. We believe these increases were due to higher overall market volatility as a result of uncertainty surrounding the potential economic impacts of anticipated and implemented tariffs as they relate to the commodities market. In addition, changes in market expectations regarding grain supplies as well as uncertain weather conditions in 2025 also led to increases in volumes. We believe these factors contributed to higher overall commodity volumes in the third quarter and first nine months of 2025 compared with the same periods in 2024. \nEnergy Products\nThe following table summarizes average daily contract volume for our key energy products.\n \nQuarter Ended \nSeptember 30,\nNine Months Ended \nSeptember 30,\n(amounts in thousands)\n2025\n2024\nChange\n2025\n2024\nChange\nWTI crude oil\n1,018 \n1,290 \n(21)\n%\n1,251 \n1,185 \n5 \n%\nNatural gas\n745 \n723 \n3 \n893 \n780 \n15 \nRefined products\n358 \n388 \n(8)\n406 \n383 \n6 \nEnergy contract volume decreased in the third quarter 2025 when compared with the same period in 2024, which we believe was due to lower overall market volatility. Crude oil volatility subsided as a result of easing geopolitical tensions in the Middle East as well as more clarity surrounding global trade negotiations. \nOverall energy contract volume increased in the first nine months of 2025 when compared with the same period in 2024, due to higher overall volatility. In the first half of 2025, crude oil volatility was higher as a result of geopolitical tensions across the globe, a shift in global supply levels, and the potential economic impacts of anticipated and implemented tariffs. Natural gas volatility was higher as a result of uncertain weather conditions and a shift in supplies in the United States in 2025, which impacted prices throughout the year. We believe these factors contributed to higher overall energy volume in the first nine months of 2025 compared with the same periods in 2024. \n27\nTable of Contents\n \nMetal Products\nThe following table summarizes average daily volume for our key metal products. \n \nQuarter Ended \nSeptember 30,\nNine Months Ended \nSeptember 30,\n(amounts in thousands)\n2025\n2024\nChange\n2025\n2024\nChange\nGold\n577 \n447 \n29 \n%\n571 \n436 \n31 \n%\nSilver\n116 \n119 \n(3)\n112 \n127 \n(12)\nCopper\n78 \n113 \n(31)\n96 \n145 \n(34)\nIn the third quarter and first nine months of 2025, overall metal contract volumes increased when compared with the same periods in 2024. We believe gold volumes increased as a result of increased price volatility caused by investors using gold as a safe-haven alternative investment due to uncertainty in other markets. The decreases in silver and copper volumes are due to reductions in demand for the metals due to economic instability as well as risk aversion by traders. We believe these factors contributed to higher overall metals volumes in the third quarter and first nine months of 2025 compared with the same periods in 2024. \nAverage Rate per Contract \nThe average rate per contract increased in the third quarter and first nine months of 2025 when compared with the same periods in 2024. The increases in the average rate per contract were primarily due to higher commodities, energy and metals contract volumes as a percentage of total volumes. In addition, the overall increases in average rate per contract were due to an increase in our fee structure, which went into effect on February 1, 2025.\nCash Markets Business\nTotal clearing and transaction fees revenues in the third quarter and first nine months of 2025 include $69.8 million and $215.4 million, respectively, of transaction fees attributable to the cash markets business, compared with $68.5 million and $207.9 million, respectively, in the third quarter and first nine months of \n2024. This revenue includes BrokerTec Americas LLC's fixed income volume and EBS's foreign exchange volume.\nQuarter Ended \nSeptember 30,\nNine Months Ended \nSeptember 30,\n(amounts in millions)\n2025\n2024\nChange\n2025\n2024\nChange\nBrokerTec fixed income transaction fees\n$\n39.3 \n$\n33.3 \n18 \n%\n$\n112.2 \n$\n108.9 \n3 \n%\nEBS foreign exchange transaction fees\n30.5 \n35.2 \n(13)\n103.2 \n99.0 \n4 \nThe related average daily notional value for the\n third quarter and first nine months of \n2025 and 2024 were as follows:\nQuarter Ended \nSeptember 30,\nNine Months Ended \nSeptember 30,\n(amounts in billions)\n2025\n2024\nChange\n2025\n2024\nChange\nU.S. Repo\n$\n379.4 \n$\n297.2 \n28 \n%\n358.3 \n$\n292.7 \n22 \n%\nEuropean Repo (in euros)\n292.1 \n285.9 \n2 \n309.4 \n289.5 \n7 \nU.S. Treasury\n83.8 \n109.3 \n(23)\n103.0 \n102.1 \n1 \nSpot FX\n56.6 \n67.0 \n(16)\n67.0 \n58.9 \n14 \nOverall average daily notional values for the cash markets business were higher in the third quarter and first nine months of 2025 when compared with the same periods in 2024 due to higher overall U.S. debt issuances. U.S. debt issuances were significantly higher in the third quarter and first nine months of 2025 as a result of the increase of the debt ceiling in early 2025, which resulted in an increase in U.S. Repo volumes. The increase in the third quarter of 2025 was partially offset by lower volatility within our U.S. Treasury products, as a result of more clarity surrounding the Federal Reserve's interest rate policy decision as well as consistent trends in inflation data.\n28\nTable of Contents\n \nConcentration of Revenue\nWe bill a substantial portion of our clearing and transaction fees directly to our clearing firms. The majority of clearing and transaction fees received from clearing firms represent charges for trades executed and cleared on behalf of their customers\n. One individual firm represented at least \n10% \nof o\nur clearing and transaction fees in the first nine months of 2025. Should a clearing firm withdraw, we believe that the customer portion of the firm’s trading activity would likely transfer to another clearing firm of the exchange. Therefore, we do not believe we are exposed to significant risk from the ongoing loss of revenue received from or through a particular clearing firm.\nOther Sources of Revenue\nMarket data and information services\n. During the third quarter and first nine months of 2025, overall market data and information services revenues increased when compared with the same periods in 2024, largely due to price increases for certain products as well as higher usage of certain products.\nThe two largest resellers of our market data represented approximately 31% of our market data and information services revenue in the first nine months of 2025. Despite this concentration, we consider exposure to significant risk of revenue loss to be minimal. In the event that one of these vendors no longer subscribes to our market data, we believe the majority of that vendor’s customers would likely subscribe to our market data through another reseller. Additionally, several of our largest institutional customers that utilize services from our two largest resellers report usage and remit payment of their fees directly to us.\nExpenses\n \n \nQuarter Ended \nSeptember 30,\n \nNine Months Ended \nSeptember 30,\n \n(dollars in millions)\n2025\n2024\nChange\n2025\n2024\nChange\nCompensation and benefits\n$\n237.6 \n$\n218.8 \n9 \n%\n$\n665.9 \n$\n629.5 \n6 \n%\nTechnology\n71.4 \n66.6 \n7 \n208.0 \n190.1 \n9 \nProfessional fees and outside services\n36.7 \n31.0 \n19 \n102.6 \n98.8 \n4 \nAmortization of purchased intangibles\n56.2 \n55.7 \n1 \n167.5 \n166.4 \n1 \nDepreciation and amortization\n26.4 \n28.2 \n(6)\n81.0 \n87.0 \n(7)\nLicensing and other fee agreements\n81.6 \n97.6 \n(16)\n274.4 \n271.4 \n1 \nOther\n55.1 \n62.3 \n(11)\n162.6 \n177.2 \n(8)\nTotal Expenses\n$\n565.0 \n$\n560.2 \n1 \n$\n1,662.0 \n$\n1,620.4 \n3 \nOperating expen\nses increase\nd by $4.8 million and $41.6 million, respectively, in the third quarter and first nine months of 2025 when compared with the same periods in 2024. The following table shows the estimated impacts of key factors resulting in the changes in operating expenses:\n \n \n \nQuarter Ended \nSeptember 30, 2025\nNine Months Ended \nSeptember 30,\n \n \nAmount  of\nChange\nChange as  a\nPercentage of\nTotal Expenses\nAmount  of\nChange\nChange as  a\nPercentage of\nTotal Expenses\n(dollars in millions)\nSalaries, benefits and employer taxes\n$\n6.5 \n1 \n%\n$\n27.5 \n2 \n%\nTechnology support services\n5.8 \n1 \n18.1 \n1 \nLegal fees\n10.0 \n2 \n17.3 \n1 \nGoogle Cloud professional fees\n(3.2)\n(1)\n(10.5)\n(1)\nRent expense\n(0.4)\n— \n(14.7)\n(1)\nOther expenses, net\n(13.9)\n(2)\n3.9 \n1 \nTotal increase\n$\n4.8 \n1 \n%\n$\n41.6 \n3 \n%\nIncreases in operating expenses in the third quarter and first nine months of 2025 when compared with the same periods in 2024 were as follows:\n•\nSalaries, benefits and employer taxes expenses were higher as a result of salary increases that went into effect during the first quarter of 2025 as well as an increase in headcount during 2025, which was primarily attributable to additional headcount in the company's international locations.\n29\nTable of Contents\n \n•\nThe increases in technology support services expenses were primarily driven by higher software license fees and third party services to support the ongoing Google Cloud transformation project.\n•\nLegal fees were higher primarily due to the class action lawsuit litigation in the second and third quarter of 2025.\nDecreases in operating expense in the third quarter and first nine months when compared with the same periods in 2024 were as follows:\n•\nThe decreases in professional fees related to the Google Cloud transformation project, which began in late 2021, were the result of a shift in need from an overall project consulting focus to a technology migration focus.\n•\nRent expenses decreased during the third quarter and first nine months of 2025 largely due to gains of $10.5 million recognized in the second quarter of 2025 resulting from a reduction in our leased office space.\nNon-Operating Income (Expense)\n \n \nQuarter Ended \nSeptember 30,\n \nNine Months Ended \nSeptember 30,\n \n(dollars in millions)\n2025\n2024\nChange\n2025\n2024\nChange\nInvestment income\n$\n1,548.7 \n$\n1,026.8 \n51 \n%\n$\n3,959.8 \n$\n3,142.6 \n26 \n%\nInterest and other borrowing costs\n(44.0)\n(40.2)\n9 \n(129.7)\n(120.2)\n8 \n%\nEquity in net earnings of unconsolidated subsidiaries\n96.3 \n86.1 \n12 \n283.5 \n259.7 \n9 \nOther non-operating income (expense)\n(1,396.6)\n(920.0)\n52 \n(3,571.4)\n(2,821.7)\n27 \nTotal Non-Operating\n$\n204.4 \n$\n152.7 \n34 \n$\n542.2 \n$\n460.4 \n18 \nInvestment income.\n  Earnings from cash performance bond and guaranty fund contributions that are reinvested increased in the  third quarter and first nine months of 2025 when compared with the same periods in 2024 due to higher reinvestment balances, despite decreases in the average rate of return on the reinvestment balances. In the third quarter and first nine months of 2025, earnings from cash performance bond and guaranty fund contributions were $1,514.1 million and $3,875.3 million, respectively, compared with $991.3 million and $3,035.6 million, respectively, in the third quarter and first nine months of 2024. We also recognized lower net realized and unrealized gains on investments in the third quarter and first nine months of 2025.\nEquity in net earnings (losses) of unconsolidated subsidiaries.\n Higher income generated from our S&P Dow Jones Indices LLC business venture contributed to increases in equity in net earnings (losses) of unconsolidated subsidiaries in the third quarter and first nine months of 2025 when compared with 2024.\nOther non-operating income (expense)\n.\n We recognized higher expenses related to the distribution of interest earned on performance bond collateral reinvestments to the clearing firms during the third quarter and first nine months of 2025 when compared with the same periods in 2024. In the third quarter and first nine months of 2025, expenses related to the distribution of interest earned on collateral reinvestments w\nere $1,399.2 million and $3,578.5 million, respectively, compared with $922.6 million and $2,829.4 million, respectively, in the third quarter and first nine months of 2024.\nIncome Tax Provision\nThe following table summarizes the effective tax rates for the periods presented:\n \n2025\n2024\nQuarter ended September 30\n22.9 \n%\n22.4 \n%\nNine months ended September 30\n23.0 \n23.0 \nThe overall effective tax rates remained relatively consistent in the third quarter and first nine months of 2025 when compared with the same periods in 2024. \nLiquidity and Capital Resources\nSources and Uses of Cash\n.\n Net cash provided by operating activities increased in the first nine months of 2025 when compared with the same period in 2024, which was largely due to an increase in trading volume and higher interest earned on reinvestment of collateral, net of distributions. Cash used in investing activities remained relatively consistent in the first nine months of 2025 when compared with the same period in 2024. Cash provided by financing activities was higher during the first nine months of 2025 when compared with the same period in 2024 due to an increase in cash performance bonds and guaranty fund contributions. \n30\nTable of Contents\n \nDebt Instruments\n.\n The following table summarizes our debt outstanding at September 30, 2025: \n(in millions)\nPar Value\nFixed rate notes due June 2028, stated rate of 3.75%\n$\n500.0 \nFixed rate notes due March 2030, stated rate of 4.40%\n750.0 \nFixed rate notes due March 2032, stated rate of 2.65%\n750.0 \nFixed rate notes due September 2043, stated rate of 5.30%\n (1)\n750.0 \nFixed rate notes due June 2048, stated rate of 4.15%\n700.0 \n _______________\n(1)\nWe maintained a forward-starting interest rate swap agreement that modified the interest obligation associated with these notes so that the interest payable effectively became fixed at a rate of 4.73%.\nWe maintain a $2.3 billion multi-currency revolving senior credit facility with various financial institutions, which matures in April 2030. The proceeds from this facility can be used for general corporate purposes, which includes providing liquidity for our clearing house in certain circumstances at CME Group's discretion and, if necessary, for maturities of commercial paper. As long as we are not in default under this facility, we have the option to increase it up to $3.3 billion with the consent of the agent and lenders providing the additional funds. This facility is voluntarily pre-payable from time to time without premium or penalty. Under this facility, we are required to remain in compliance with a consolidated net worth test, which is defined as our consolidated shareholders' equity at December 31, 2024, giving effect to share repurchases made and special dividends paid during the term of the agreement (and in no event greater than $2.0 billion in aggregate), multiplied by 0.65. We currently do not have any borrowings outstanding under this facility, but any commercial paper balance if or when outstanding can be backstopped against this facility.\nWe maintain a 364-day multi-currency revolving secured credit facility with a consortium of domestic and international banks to be used in certain situations by the clearing house. The facility provides for borrowings of up to $7.0 billion. We may use the proceeds to provide temporary liquidity in the unlikely event a clearing firm fails to promptly discharge an obligation to the clearing house operated by CME, in the event of a liquidity constraint or default by a depositary (custodian for our collateral), in the event of a temporary disruption with the domestic payments system that would delay payment of settlement variation between us and our clearing firms, or in other cases as provided by the CME rulebook. Clearing firm guaranty fund contributions received in the form of cash or U.S. Treasury securities as well as the performance bond assets (pursuant to the CME rulebook) \ncan be used to collateralize the facility. At September 30, 2025, guaranty fund contributions available to collateralize the facility totaled $9.5 billion. W\ne have the option to increase the line from $7.0 billion to $10.0 billion with the consent of the agent and lenders providing the additional funds. Our 364-day facility contains a requirement that CME remain in compliance with a consolidated tangible net worth test, defined as CME's consolidated shareholder's equity less intangible assets (as defined in the agreement), of not less than $800.0 million. We currently do not have any borrowings outstanding under this facility. \nThe indentures governing our fixed rate notes, our $2.3 billion multi-currency revolving senior credit facility and our 364-day multi-currency revolving secured credit facility for $7.0 billion do not contain specific covenants that restrict the ability to pay dividends. These documents, however, do contain other customary financial and operating covenants that place restrictions on the operations of the company that could indirectly affect the ability to pay dividends. \nAt September 30, 2025, we have excess borrowing capacity for general corporate purposes of approximately $2.3 billion un\nd\ner our multi-currency revolving senior credit facility. \nWe maintain committed repurchase facility agreements amounting to a total of $1.0 billion. The committed repurchase facilities provide access to cash, secured by non-cash collateral, in the event that one or more of our clearing firms fails to promptly discharge an obligation to the clearing house. The facilities are subject to annual renewal. We currently do not have any borrowings outstanding under these facilities.\nWe maintain a committed facility of up to $750.0 million for foreign currency conversions. The committed foreign currency facility allows the clearing house to convert cash to another currency within generally accepted local market timeframes in the event that one or more of our clearing firms fails to promptly discharge an obligation to the clearing house. The facility is subject to annual renewal. We currently do not have any foreign currency trades outstanding under this facility.\nAt September 30, 2025, we were in compliance with the various covenant requirements of all our debt facilities. \nCME Group, as a holding company, has no operations of its own. Instead, it relies on dividends declared and paid to it by its subsidiaries in order to provide the funds which it uses to pay dividends to its shareholders. \n31\nTable of Contents\n \nTo satisfy our performance bond obligation with Singapo\nre Exchange Limited, we may pledge irrevocable standby letters of credit. At September 30, 2025, the letters of credit totaled $400.0 million. We also\n maintain a $350.0 million line of credit to meet our obligations under this agreement.\nThe following table summarizes our credit ratings at September 30, 2025: \n \n \n  \nShort-Term\n  \nLong-Term\n  \n \nRating Agency\n  \nDebt Rating\n  \nDebt Rating\n  \nOutlook\nStandard & Poor’s Global Ratings\n  \nA1+\n  \nAA-\n  \nStable\nMoody’s Investors Service, Inc.\n  \nP1\n  \nAa3\n  \nStable\nGiven our cash flow generation, our ability to pay down debt levels and our ability to refinance existing debt facilities if necessary, we expect to maintain an investment grade rating. If our ratings are downgraded below investment grade within certain specified time periods due to a change of control, we are required to make an offer to repurchase our fixed rate notes at a price equal to 101% of the principal amount, plus accrued and unpaid interest. No report of any rating agency is incorporated by reference herein.\nLiquidity and Cash Management\n. Cash and cash equivalents totaled $2.4 billion an\nd $2.9 billion at September 30, 2025 and December 31, 2024, respectively. The balance retained in cash and cash equivalents is a function of anticipated or possible short-term cash needs, prevailing interest rates, our corporate investment policy and alternative investment choices. A majority of our cash and cash equivalents balance is invested in money market mutual funds that invest only in U.S. Treasury securities, U.S. government agency securities and U.S. Treasury security reverse repurchase agreements and short-term bank deposits. Our exposure to credit and liquidity risk is minimal given the nature of the investments. Cash that is not available for general corporate purposes because of regulatory requirements or other restrictions is classified as restricted cash and is included in cash performance bonds and guaranty fund contributions, other current assets or other assets in the consolidated balance sheets.\nOn December 5, 2024, we announced that our board of directors has approved a shar\ne repurchase program under which we are authorized to repurchase up to $3.0 billion of our outstanding Class A common stock, par value $0.01 per share (the common stock), from time to time through open market transactions, block trades, privately negotiated purchase transactions or other purchase techniques and may include purchases effected pursuant to one or more trading plans established pursuant to Rule 10b5-1 under the Exchange Act. The timing of any repurchases and the number of shares repurchased under the share repurchase program are within our discretion and may be affected by various factors, including general market and economic conditions; the market price of the common stock; CME Group’s earnings, financial condition, capital requirements and levels of indebtedness; legal requirements; and other considerations. The share repurchase program has no expiration date, does not obligate us to acquire any particular amount of common stock and may be modified, suspended or terminated at any time. As of September 30, 2025, the maximum remaining value of shares to be repurchased was $2,991.8 million. \nRegulatory Requirements\n. \nCME is regulated by the CFTC as a Derivatives Clearing Organization (DCO). DCOs are required to maintain capital, as defined by the CFTC, in an amount at least equal to one year of projected operating expenses as well as cash, liquid securities, or a line of credit at least equal to six months of projected operating expenses. CME was designated by the Financial Stability Oversight Council as a systemically important financial market utility under Title VIII of the Dodd-Frank Wall Street Reform and Consumer Protection Act. As a result, CME must comply with CFTC regulations applicable to a systemically important DCO for financial resources and liquidity resources. CME is in compliance with all DCO financial requirements.\nCME, CBOT, NYMEX and COMEX are regulated by the CFTC as Designated Contract Markets (DCM). DCMs are required to maintain capital, as defined by the CFTC, in an amount at least equal to one year of projected operating expenses as well as cash, liquid securities or a line of credit at least equal to six months of projected operating expenses. Our DCMs are in compliance with all DCM financial requirements. \nBrokerTec Americas LLC is required to maintain sufficient net capital under Securities Exchange Act of 1934, as amended (Exchange Act), Rule 15c3-1 (the Net Capital Rule). The Net Capital Rule focuses on liquidity and is designed to protect securities customers, counterparties, and creditors by requiring that broker-dealers have sufficient liquid resources on hand at all times to satisfy claims promptly. Rule 15c3-3, or the customer protection rule, which complements Rule 15c3-1, is designed to ensure that customer property (securities and funds) in the custody of broker-dealers is adequately safeguarded. By law, both of these rules apply to the activities of registered broker-dealers, but not to unregistered affiliates. The firm began operating as a (k)(2)(i) broker dealer in November 2017 following notification to the Financial Industry Regulatory Authority and the SEC. A company operating under the (k)(2)(i) exemption is not required to lock up customer funds as would otherwise be required under Exchange Act Rule 15c3-3.\n32\nTable of Contents"
}