{
  "source_file": "cmg-20241231.htm",
  "form_type": "10-K",
  "item1": "ITEM 1. BUSINESS\nGeneral\nChipotle Mexican Grill, Inc., a Delaware corporation, together with its subsidiaries (“Chipotle,” “we,” “us,” or “our”) owns and operates Chipotle Mexican Grill restaurants, which feature a relevant menu of burritos, burrito bowls (a burrito without the tortilla), quesadillas, tacos, and salads. We strive to cultivate a better world by serving responsibly sourced, classically cooked, real food with wholesome ingredients and without artificial colors, flavors or preservatives. We are passionate about providing a great guest experience and making our food more accessible to everyone while continuing to be a brand with a demonstrated purpose. Our first Chipotle restaurant opened in Denver, Colorado in 1993. Over 30 years later, our devotion to seeking out high-quality ingredients, raised with respect for animals, farmers, and the environment, remains at the core of our commitment to Food with Integrity.\nAs of December 31, 2024, we owned and operated 3,644 Chipotle restaurants throughout the United States (“U.S.”) and 82 international Chipotle restaurants. Additionally, we had three international licensed restaurants. We manage our U.S. operations based on ten regions and aggregate our operations to one reportable segment. \nOur revenue is derived from sales by our restaurants.\n3\nTable of Contents\nBusiness Strategy\nWe are a brand with a demonstrated purpose of Cultivating a Better World. Our mission is to win today while we grow our future by focusing on five key fundamental strategies:\n•\nRunning successful restaurants with a people accountable culture that provides great Food with Integrity while delivering exceptional in-restaurant and digital experiences;\n•\nAmplifying technology and innovation to drive growth and productivity at our restaurants, support centers and in our supply chain; \n•\nMaking the brand visible, relevant, and loved to acquire new guests and improve overall guest engagement;\n•\nSustaining world class people leadership by developing and retaining top talent at every level; and\n•\nExpanding access and convenience by accelerating new restaurant openings in North America and internationally. \nFood with Integrity\nServing high-quality food at reasonable prices is critical to ensuring guests enjoy wholesome food at a great value. In Chipotle-owned and operated restaurants, we strive to serve only animal products that are raised in accordance with criteria we have established in an effort to improve sustainability and promote animal welfare, and without the use of non-therapeutic antibiotics or added growth hormones. We brand our meats as “Responsibly Raised®.” We also seek to use responsibly grown produce, by which we mean produce grown by suppliers whose practices conform to our Food with Integrity standards and our priorities with respect to environmental considerations and employee welfare. For more information about our sustainability and animal welfare initiatives, see our biennial Sustainability Report and interim Update Report on our website www.chipotle.com/sustainability.\nPurchasing\nMaintaining the high levels of quality and safety we demand in our restaurants depends in part on our ability to acquire high-quality, fresh ingredients and other necessary supplies that meet our specifications from reliable suppliers. We work with 26 independently owned and operated regional distribution centers that purchase from various suppliers we carefully select based on the suppliers' understanding of and adherence to our mission and Food with Integrity standards, quality and price availability. We have also sought to increase the number of suppliers for our ingredients to help mitigate pricing volatility and reduce our reliance on one or several suppliers, which could create supply shortages. In addition, we closely monitor industry news, trade tariffs, weather, exchange rates, foreign demand, geopolitical crises and other world events that may affect our ingredient prices or available supply. Certain key ingredients are purchased from a small number of suppliers.\nQuality Assurance and Food Safety\nWe are committed to serving only safe, high-quality food. Our food safety and quality assurance teams work to ensure compliance with our food safety programs and practices, components of which include:\n•\nnaturally derived inhibitors to prevent microbial growth in ingredients;\n•\nadvanced technologies and tools that reduce or eliminate pathogens while maintaining food quality;\n•\nenhanced restaurant procedures and protocols for handling ingredients and sanitizing surfaces in our restaurants;\n•\nfood safety certifications;\n•\ninternal and third-party restaurant inspections;\n•\nsmall grower support during on-site audits;\n•\nsupplier interventions steps to mitigate food safety risks before ingredients reach Chipotle; and\n•\ningredient traceability.\n4\nTable of Contents\nThese and other food safety practices underscore our commitment to be a leader in food safety while continuing to serve high-quality food that our guests love. Our food safety and quality assurance teams establish and monitor our quality and food safety programs and work closely with suppliers to ensure our high standards are met throughout the supply chain. We maintain a limited list of approved suppliers, many of whom are among the top suppliers in the industry. In addition, we have a team approach where our training, operations, culinary, legal and restaurant food safety and quality assurance departments develop and implement operating standards for food quality, food preparation, restaurant cleanliness, employee health protocols, and safety in the restaurants. Our food safety programs are also intended to ensure we not only continue to comply with applicable food safety regulations, but also establish Chipotle as an industry leader in food safety. To help achieve this goal, we have a Food Safety Advisory Council comprised of some of the nation’s foremost food safety authorities. The Food Safety Advisory Council is charged with evaluating our programs and advising us on ways to maintain and elevate our food safety program. Our food safety and quality assurance team members hold board seats and participate in technical working groups with several associations. This gives us the opportunity to learn and share our knowledge and expertise with other food safety professionals and regulatory agencies.\nDigital Business and Innovation\nOur digital platform continues to be a strategic driver of our growth. Digital sales represent food and beverage revenue for company-owned restaurants generated through the Chipotle website, Chipotle app or third-party delivery aggregators and include revenue deferrals associated with Chipotle Rewards. Digital sales represented 35.1% of food and beverage revenue in 2024, compared to 37.4% in 2023. We have made digital ordering convenient with continued enhancements to our app and by building more Chipotlanes, which is our drive through format for guest pick-up of digital orders. We are also investing in technology and tools to modernize the back of house of our restaurants and to improve the team member experience.\nHuman Capital\nAt Chipotle, our vision is to cultivate an environment where our employees can thrive and grow into great leaders. We believe in investing and supporting our people because they are our most important asset. As of December 31, 2024, Chipotle employed 130,504 people worldwide and 1,328 contract workers. Of our employees, 127,820 worked in the United States, and 2,684 worked internationally across Canada, France, Germany, and the United Kingdom. Within the U.S., 126,233 employees worked in our restaurants, and 1,587 in our Restaurant Support Centers and Field Leadership. There were no union petitions or campaigns in 2024, and we continue to bargain in good faith with the one restaurant that voted in 2022 to form a union. We also continue to focus on building a positive people culture where employees feel supported, heard, and are able to grow with Chipotle. \nTalent Acquisition\nWe remain committed to the growth, development, and advancement of our people. In 2024, over 85% of our in-restaurant leadership roles were filled through internal promotions, which remains a critical component to our staffing strategy. To continually attract and hire external talent, we remain focused on creating a best-in-class job seeker and General Manager hiring experience that prioritizes speed, but that also aims to create a transparent process; an experience that identifies shift-specific needs and elevates our talent bar for quality-of-hire. We have seen early success with our new virtual hiring assistant \"Ava Cado\", almost doubling our application flow. With Ava Cado, approximately 90% of applications are completed, and restaurants are leveraging automated interview rescheduling, freeing up managers to run great restaurants and serve our guests. \nTo expand our recruitment marketing efforts we continue developing both new and existing partnerships, such as Transition Overwatch and Recruit Military, which assist transitioning Veterans and their spouses. We also prioritize understanding the hiring needs of our international operations in Canada, the United Kingdom, France, and Germany. \n5\nTable of Contents\nCulture and Inclusivity (\"C&I\")\nOur purpose extends beyond serving nutritious food using real ingredients. We are on a journey to create a global culture where everyone is welcome and feels a genuine sense of belonging, and we believe this is achieved through our daily interactions and commitment to model inclusive leadership.\nIn 2024, Chipotle continued to invest in employee development and training. Our learning programs include inclusive topics and skill-building to provide our leaders with the resources they need to succeed in their current roles and prepare for the future. Our training programs will continue to evolve to respond to a constantly changing world.\nDevotion to our culture of inclusivity emanates from our values and the belief that our people make us what we are. We do not see inclusion as a moment, but a movement towards a future where all people can experience success as their best authentic selves. That is why our efforts are not confined to certain roles, departments, identities, or geographies. Driven by a strategy spanning across culture, community, candidate, career, and commerce, we are making meaningful strides towards a future where diversity is understood, embraced, and is a source of our strength. \nMaintaining a work environment where all people can succeed as their full authentic self is critical to our success as a business. To deliver meaningful programs that meet the needs of our employees, it is important we understand the dynamic composition of our workforce. As of December 31, 2024, 48.9% of our workforce was male and 49.8% of our workforce was female.\n \nOur most recent Equal Employment Opportunity consolidated report is posted on the Investors page of our website at www.ir.chipotle.com under Corporate Governance – Human Capital Information and additional details about the demographics of our employee population is included in our biennial Sustainability Report and interim Update Report on our website www.chipotle.com/sustainability\n.\n6\nTable of Contents\nWe have undertaken a range of activity to promote a culture of inclusion:\n•\nWe continue to drive a consistent and structured candidate interview process with interview guides. This ensures top candidates are identified through equitable hiring practices in both internal and external candidate interviews. We also launched an internal job board across multiple communication channels to provide increased visibility and access to internal opportunities.\n•\nIn 2024, Chipotle hired a Director of C&I to create and execute a strategy for inclusion, advise across Centers of Excellence, and enhance existing programs with C&I training. This specialized role is also responsible for the continued maturation of our Employee Resource Groups through a new strategy that improves the leader and member experience. \n•\nWe have a holistic approach to pay equity to ensure consistent and equitable compensation among our employees. We retain an independent third-party compensation consultant each year to conduct a pay equity analysis of our U.S. and Canadian workforce, including factors of pay (e.g., grade level, tenure in role, most recent promotion) and external market conditions (e.g., geographic location), to ensure equitable treatment among our employees. In 2024, our review included 99% of our U.S. and Canadian employee population, excluding only approximately 50 of our most senior management employees. The analysis identified small, isolated pay gaps for certain segments of the population, and we subsequently made pay adjustments to close those gaps. Since there are not many common roles among our 50 most senior executives, we consider both internal equity by level, as well as individualized market data, to help ensure we maintain pay equity among this group.\nTalent Management\nWe are committed to cultivating a high-performing workforce through a talent development strategy that prioritizes attracting, developing, and retaining exceptional talent at every level of the organization. In 2024, we promoted over 23,000 employees. Importantly, amongst our Field Leadership roles (Field Leaders, Team Directors, Regional Directors of Operations, and Regional Vice Presidents), the internal promotion rate was above 80%.\nOur robust hiring, onboarding, and training programs ensure our newly hired and recently promoted employees are set up for success and are aligned with Chipotle's values and goals. We deployed a variety of critical programming ensuring leadership development where most needed. Some notable highlights include:\n•\nCultivate University is our leadership training program for new Field Leaders and Team Directors navigating multi-unit management for the first time. Leaders are brought together for a four-day immersive leadership experience designed to bolster leadership skills, while validating and grounding attendees in the operational skills necessary to succeed. In 2024, we had 129 leaders complete the program.\n•\nWe introduced additional required restaurant leader training at all levels in 2024, building skills around accountability, coaching, feedback, delegation, and resolving conflict. The courses are designed to align with the leadership skills necessary to excel at each level of restaurant management. \n•\nWe formalized our Field Leader in Training materials and have seen cohorts launch throughout the business, ensuring that Managers interested in promotion are getting the development they need to take on the next role. \n•\nLeadership Evolution and Development, our leadership development program, is designed to prepare a cross-functional cohort of mid-level managers for the future of work and leadership. During the 6-month program, participants focus on the capabilities of leading oneself, others, and the business with topics designed to stretch capabilities and improve decision-making skills.\nIn addition, to ensure leadership continuity, we maintain a robust succession planning process, focusing on critical roles across the company. In 2024, we identified successors for 72% of key positions and continued to develop individualized development plans tailored to prepare successors for readiness. Due to Chipotle's growth, we are excited about two newly created regions and three promotions into Regional Director of Operations and Regional Vice President roles, highlighting additional growth and development for our field teams. \n7\nTable of Contents\nTotal Rewards\nThe financial, physical, and mental well being of our employees remains our top priority. We believe we have compelling compensation packages and incentive programs, and a robust suite of benefit offerings that enable us to engage current team members and attract new team members. In 2024, we conducted an Employee Value Proposition survey which was intended to help us understand what employees appreciate in Chipotle as an employer, what needs improvement and what drives value for our employees. We have gathered valuable insights that will help us continue to improve the employee experience and attract and retain the best talent in the industry. Other areas of Total Rewards that help support our employees include: \n•\nWe have made substantial investments in our compensation packages, including competitive wages and industry leading incentive programs, such as our annual and quarterly bonus programs.\n•\nWe offer a Debt-Free Degree program that provides Chipotle employees' access to nearly 100 degrees at 10 universities, completely tuition free.\n•\nWe support Career Certificates, which further enhances our Tuition Assistance benefits by providing on-demand certificate programs to help Chipotle team members advance their careers in as little as eight weeks.\n•\nWe offer a student loan payment matching programs via our 401(k) retirement program. This, in addition to a credit optimization service, has helped to bolster our employees' financial well-being.\n•\nWe also offer personalized mental health assistance to all Chipotle employees and their family members with support available 24/7 via in-person, phone, or virtual visits with a licensed counselor.\n•\nStarting in 2025, we are expanding our mental health benefits by offering free access to a mental health app to all U.S. employees. \nEmployee Listening\nWe value feedback; both positive sentiments and constructive comments help us improve our organization and culture. Many of our best ideas come from Chipotle employees and we use various communication channels to maintain awareness and responsiveness to questions, concerns, and ideas across our workforce. This includes direct daily engagement through meetings with General Managers, lunch and learns, and other one-on-one interactions. \nEmployees are encouraged to ask questions, voice concerns directly or anonymously report potential violations of Chipotle's Code of Ethics through our Respectful Workplace hotline. Employees also can raise concerns using other mechanisms, including communication with their managers or human resources business partners. We actively encourage our employees to report any issues or concerns without fear of reprisal, intimidation, or harassment. \nWe also respond to employee issues quickly via our Employee Service Center which is available seven days a week to resolve employee questions about things like restaurant health and safety, compliance, benefits, payroll, etc. \nWe are eager to improve our employee engagement efforts and build even stronger feedback mechanisms to ensure our employees feel valued, heard and respected. \nGovernment Regulation and Environmental Matters\nWe are subject to various federal, state and local laws and regulations that govern aspects of our business operations. While costs associated with compliance with laws and regulations have increased as the number and scope of regulations have increased, the total costs incurred have not had, and are not expected to have, a material effect on our capital expenditures, results of operations or competitive position. See “Risk Factors” in Item 1A for discussion of risks relating to federal, state, local and international laws and regulations applicable to our business.\nSeasonality\nSeasonal factors influencing our business are described under the heading “Quarterly Financial Data/Seasonality” in Item 7. “Management’s Discussion and Analysis of Financial Condition and Results of Operations.”\n8\nTable of Contents\nCompetition \nThe fast-casual, quick-service, and casual dining segments of the restaurant industry are highly competitive with respect to, among other things, taste, price, food quality and presentation, service, location, convenience, brand reputation, and cleanliness and ambience of each restaurant. Our competition includes a variety of restaurants in each of these segments, including locally-owned restaurants, as well as national and regional chains. Competition from food delivery services, which offer meals from a wide variety of restaurants, also has increased in recent years and is expected to continue to increase. Many of our competitors also offer dine-in, carry-out, online, catering, and delivery services. Among our main competitors are restaurant formats that claim to serve higher quality ingredients without artificial flavors, colors and preservatives, and that serve food quickly and at a reasonable price. \nOur Intellectual Property and Trademarks \n“Chipotle,” “Chipotle Mexican Grill,” “Food with Integrity,” “Responsibly Raised,” “Chipotle Rewards,” and a number of other marks and related designs and logos are U.S. registered trademarks of Chipotle. We have filed trademark applications for a number of additional marks in the U.S. as well. In addition to our U.S. registrations, we have registered trademarks for “Chipotle” and a number of other marks in Canada, the European Union, the Middle East and various other countries, and have filed trademark applications for “Chipotle Mexican Grill,” “Chipotle” and a number of other marks in additional countries. We also believe that the design of our restaurants is our proprietary trade dress and have registered elements of our restaurant design for trade dress protection in the U.S. as well.\nFrom time to time, we have taken action against other restaurants that we believe are misappropriating our trademarks, restaurant designs or advertising. Although our policy is to protect and defend vigorously our rights to our intellectual property, we may not be able to adequately protect our intellectual property, which could harm the value of our brand and adversely affect our business. \nAvailable Information \nWe maintain a website at www.chipotle.com, including an investor relations section at ir.chipotle.com, on which we routinely post important information, such as webcasts of quarterly earnings calls and other investor events in which we participate or host, and any related materials. Our Code of Ethics and our Supplier Code of Conduct also are available in this section of our website. You may access our annual reports on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K and amendments to those reports, as well as other reports relating to us that are filed with or furnished to the SEC, free of charge in the investor relations section of our website as soon as reasonably practicable after such material is electronically filed with or furnished to the SEC. The SEC also maintains a website that contains reports, proxy and information statements and other information regarding issuers that file electronically with the SEC at www.sec.gov. \nThe contents of the websites mentioned above and elsewhere in this report are not incorporated into and should not be considered a part of this report. The references to the URLs for these websites are intended to be inactive textual references only.\n9\nTable of Contents",
  "item7": "ITEM 7. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS \nYou should read the following discussion together with our consolidated financial statements and related notes included in Item 8. “Financial Statements and Supplementary Data.” This section of the Form 10-K generally discusses 2024 items and year-to-year comparisons of 2024 to 2023. Discussions of 2022 items and year-to-year comparisons of 2023 and 2022 that are not included in this Form 10-K can be found in “Management’s Discussion and Analysis of Financial Condition and Results of Operations” in Part II, Item 7 on our Annual Report on Form 10-K for the year ended December 31, 2023. The discussion contains forward-looking statements involving risks, uncertainties and assumptions that could cause our results to differ materially from expectations. See “Cautionary Note Regarding Forward-Looking Statements.” Factors that might cause such differences include those described in Item 1A. “Risk Factors”, 7A. \"Quantitative and Qualitative Disclosure About Market Risk\", and elsewhere in this report.\nOverview\nAs of December 31, 2024, we owned 3,644 Chipotle restaurants throughout the United States, and 82 international Chipotle restaurants. Additionally, we had three international licensed restaurants. \nWe manage our U.S. operations based on \nten\n regions and aggregate our operations to \none\n reportable segment.\nThroughout “Management’s Discussion and Analysis of Financial Condition and Results of Operations” we commonly discuss the following key operating metrics which we believe will drive our financial results and long-term growth model. W\ne believe these metrics are\n useful to investors because management uses these metrics to assess the growth of our business and the effectiveness of our marketing and operational strategies:\n•\nComparable restaurant sales\n•\nFood, beverage, and packaging as a percentage of total revenue\n•\nLabor as a percentage of total revenue\n•\nOccupancy as a percentage of total revenue\n•\nOther operating costs as a percentage of total revenue\n•\nNew restaurant openings \n2024 Financial Highlights, year-over-year:\n•\nTotal revenue increased 14.6% to $11.3 billion\n•\nComparable restaurant sales increased 7.4%\n•\nDiluted earnings per share was $1.11, a 24.7% increase from $0.89\nSales Trends. \nComparable restaurant sales increased 7.4% for the year ended December 31, 2024. The increase is attributable to higher transactions of 5.3% and a 2.1% increase in average check. Comparable restaurant sales represent the change in period-over-period total revenue for restaurants in operation for at least 13 full calendar months. Digital sales represented 35.1% of total food and beverage revenue. For 2025, management is anticipating comparable restaurant sales growth in the low to mid-single digit range.\nRestaurant Development. \nDuring the year ended December 31, 2024, we opened 304 restaurants, which included 257 restaurants with a Chipotlane. We expect to open approximately 315 to 345 company-owned restaurants in 2025. We expect that at least 80% of our new company-owned restaurants will include a Chipotlane. \nLicensing\n. During the year ended December 31, 2024,  three licensed restaurants were opened in the Middle East.\nCultivate Next Fund\n. Our Cultivate Next Fund is a venture formed to make early-stage investments into strategically aligned companies that further our purpose to Cultivate a Better World. The Fund is authorized to invest up to $100.0 million, which is financed almost entirely by Chipotle. As of December 31, 2024, we have made $63.0 million in investments through this Fund. \n26\nTable of Contents\nRestaurant Activity\nThe following table details company-owned restaurant unit data for the years indicated. \n \nYear ended December 31,\n \n2024\n2023\nBeginning of period\n3,437\n3,187\nChipotle openings\n304\n270\nNon-Chipotle openings\n-\n1\nChipotle permanent closures\n(7)\n(3)\nChipotle relocations\n(8)\n(12)\nNon-Chipotle permanent closures\n-\n(6)\nTotal at end of period\n3,726\n3,437\nThe following table details licensed restaurant unit data for the years indicated.\nYear ended December 31,\n2024\n2023\nBeginning of period\n- \n- \nLicensed restaurant openings\n3 \n- \nTotal at end of period\n3 \n- \nResults of Operations\nOur results of operations as a percentage of total revenue and period-over-period change are discussed in the following section. \nRevenue\n \nYear ended December 31,\nPercentage\n \n2024\n2023\nchange\n \n(dollars in millions)\n \nFood and beverage revenue\n$\n11,247.4\n$\n9,804.1\n14.7%\nDelivery service revenue\n66.5\n67.5\n(1.6 \n%)\nTotal revenue\n$\n11,313.9\n$\n9,871.6\n14.6%\nAverage restaurant sales \n(1)\n$\n3.213\n$\n3.018\n6.5%\nComparable restaurant sales increase\n7.4%\n7.9%\nTransactions\n5.3%\n5.0%\nAverage check\n2.1%\n2.9%\nMenu price increase\n2.9%\n5.2%\nCheck mix\n(0.8 \n%)\n(2.3 \n%)\n(1)\nAverage restaurant sales refers to the average trailing 12-month food and beverage revenue for restaurants in operation for at least 12 full calendar months.\n27\nTable of Contents\nThe following is a summary of the change in restaurant sales for the period indicated:\n \nYear ended\n \n(dollars in millions)\nFor the period ended December 31, 2023\n$\n9,871.6 \nChange from:\nComparable restaurant sales\n695.4 \nRestaurants not yet in comparable base opened in 2024\n290.4 \nRestaurants not yet in comparable base opened in 2023\n453.7 \nOther\n2.8 \nFor the period ended December 31, 2024\n$\n11,313.9 \nFood, Beverage and Packaging Costs\n \nYear ended December 31,\nPercentage\n \n2024\n2023\nchange\n \n(dollars in millions)\nFood, beverage and packaging\n$\n3,374.5\n$\n2,912.6\n15.9%\nAs a percentage of total revenue\n29.8%\n29.5%\n0.3 \n%\nFood, beverage and packaging costs increased 0.3% as a percentage of total revenue for the year ended December 31, 2024 compared to the year ended December 31, 2023. The increase was due to higher usage of ingredients as we focused on ensuring consistent and generous portions, inflation across several ingredient costs, primarily avocados, and a protein mix shift from the Smoked Brisket limited time offering and a Braised Beef Barbacoa marketing initiative. This increase was partially offset by a 1.0% benefit from menu price increases.\nLabor Costs\n \nYear ended December 31,\nPercentage\n \n2024\n2023\nchange\n \n(dollars in millions)\nLabor costs\n$\n2,789.8\n$\n2,441.0\n14.3%\nAs a percentage of total revenue\n24.7%\n24.7%\n- \n%\nLabor costs remained flat as a percentage of total revenue for the year ended December 31, 2024 compared to the year ended December 31, 2023. The 1.1% benefit from sales leverage was mostly offset by 0.9% due to restaurant wage inflation, of which 0.4% was due to minimum wage increases for our restaurants in California.\nOccupancy Costs\n \n \nYear ended December 31,\nPercentage\n \n2024\n2023\nchange\n \n(dollars in millions)\nOccupancy costs\n$\n563.4\n$\n503.3\n11.9%\nAs a percentage of total revenue\n5.0%\n5.1%\n(0.1 \n%)\nOccupancy costs decreased 0.1% as a percentage of total revenue for the year ended December 31, 2024 compared to the year ended December 31, 2023, primarily due to 0.3% of sales leverage partially offset by 0.2% of increased occupancy expense, of which 0.1% was associated with existing restaurants and 0.1% was associated with new restaurants.\n28\nTable of Contents\nOther Operating Costs \n \nYear ended December 31,\nPercentage\n \n2024\n2023\nchange\n \n(dollars in millions)\nOther operating costs\n$\n1,568.5\n$\n1,428.7\n9.8%\nAs a percentage of total revenue\n13.9%\n14.5%\n(0.6 \n%)\nOther operating costs decreased 0.6% as a percentage of total revenue for the year ended December 31, 2024 compared to the year ended December 31, 2023, primarily due to 0.5% of sales leverage and 0.2% of lower delivery expenses.\nGeneral and Administrative Expenses \n \nYear ended December 31,\nPercentage\n \n2024\n2023\nchange\n \n(dollars in millions)\nGeneral and administrative expenses\n$\n697.5\n$\n633.6\n10.1%\nAs a percentage of total revenue\n6.2%\n6.4%\n(0.2 \n%)\nThe following is a summary of the change in general and administrative expenses for the period indicated:\nYear ended\n(dollars in millions)\nFor the period ended December 31, 2023\n$\n633.6 \nChange from:\nWages\n20.5 \nConferences, primarily the biennial All Managers’ Conference\n17.7 \nLegal contingencies\n16.6 \nOutside services related to corporate initiatives\n8.1 \nStock-based compensation\n5.3 \nRestructuring costs\n(6.5)\nOther\n2.2 \nFor the period ended December 31, 2024\n$\n697.5 \nImpairment, Closure Costs, and Asset Disposals\n \nYear ended December 31,\nPercentage\n \n2024\n2023\nchange\n \n(dollars in millions)\nImpairment, closure costs, and asset disposals\n$\n26.9\n$\n38.4\n(29.8%)\nAs a percentage of total revenue\n0.2%\n0.4%\n(0.2%)\nImpairment, closure costs, and asset disposals \ndecreased\n in dollar terms for the year ended \nDecember 31, 2024 compared to the year ended December 31, 2023\n, primarily due to a gain on the sale of corporate equipment and higher charges related to the replacement of certain leasehold improvements in the comparable period.\n29\nTable of Contents\nInterest and Other Income, Net\n \nYear ended December 31,\nPercentage\n \n2024\n2023\nchange\n \n(dollars in millions)\nInterest and other income, net\n$\n93.9\n$\n62.7\n49.8%\nAs a percentage of total revenue\n0.8%\n0.6%\n0.2%\nInterest and other income, net \nincreased\n in dollar terms for the year ended \nDecember 31, 2024 compared to the year ended December 31, 2023\n, primarily due to increased interest income from higher investment balances in U.S. Treasury securities, money market funds and time deposits. \nProvision for Income Taxes\n \nYear ended December 31,\nPercentage\n \n2024\n2023\nchange\n \n(dollars in millions)\nProvision for income taxes\n$\n476.1 \n$\n391.8 \n21.5%\nEffective income tax rate\n23.7%\n24.2%\n(0.5%)\nThe\n effective income tax rate decreased 0.5% for the year ended December 31, 2024 compared to the year ended December 31, 2023, primarily due to lower nondeductible expenses of 0.6% and income tax reserves of 0.4%. These decreases were partially offset by a 0.6% reduction in tax benefits related to option exercise and equity vesting. \nQuarterly Financial Data/Seasonality \nSeasonal factors cause our profitability to fluctuate from quarter to quarter. Historically, our average daily restaurant sales and net income are lower in the first and fourth quarters due, in part, to the holiday season and because fewer people eat out during periods of inclement weather (the winter months) than during periods of mild or warm weather (the spring, summer and fall months). Other factors also have a seasonal effect on our results. For example, restaurants located near colleges and universities generally do more business during the academic year. Seasonal factors, however, might be moderated or outweighed by other factors that may influence our quarterly results, such as unexpected publicity impacting our business in a positive or negative way, disease outbreak, epidemic or endemic, the impact of inflation on consumer spending, fluctuations in food or packaging costs, or the timing of menu price increases or promotional activities and other marketing initiatives. The number of trading days in a quarter can also affect our results, although, on an overall annual basis, changes in trading days do not have a significant impact. \nOur quarterly results are also affected by other factors such as the amount and timing of non-cash stock-based compensation expense and related tax rate impacts, litigation, settlement costs and related legal expenses, impairment charges and non-operating costs, timing of marketing or promotional expenses, the number and timing of new restaurants opened in a quarter, and closure of restaurants. New restaurants typically have higher operating costs following opening because of the expenses associated with their opening and operating inefficiencies in the months immediately following opening. Accordingly, results for a particular quarter are not necessarily indicative of results to be expected for any other quarter or for any year. \n30\nTable of Contents\nLiquidity and Capital Resources \nCash and Investments\nAs of December 31, 2024, we had a cash and marketable investments balance of $2.2 billion, non-marketable investments of $85.2 million, and $29.8 million of restricted cash. After funding the current operations in our restaurants and support centers, the first planned use of our cash flow from operations is to provide capital for the continued investment in new restaurant construction. In addition to continuing to invest in our restaurant expansion, we expect to utilize cash flow from operations to: repurchase additional shares of our common stock subject to market conditions; invest in, maintain, and refurbish our existing restaurants; and for general corporate purposes. As of December 31, 2024, $1.0 billion remained available for repurchases of shares of our common stock, which includes the $300.0 million additional authorization approved by our Board of Directors on December 17, 2024. Under the remaining repurchase authorizations, shares may be purchased from time to time in open market transactions, subject to market conditions. \nBorrowing Capacity\nAs of December 31, 2024, we had $500.0 million of undrawn borrowing capacity under a line of credit facility. \nUse of Cash\nWe believe that cash from operations, together with our cash and investment balances, will be sufficient to meet ongoing capital expenditures, working capital requirements and other cash needs for the foreseeable future. Assuming no significant declines in comparable restaurant sales, we expect we will generate positive cash flow for the foreseeable future.\nWe have not required significant working capital because guests generally pay using cash or credit and debit cards and because our operations do not require significant receivables, nor do they require significant inventories due, in part, to our use of various fresh ingredients. In addition, we generally have the right to pay for the purchase of food, beverages and supplies sometime after the receipt of those items, generally within ten days, thereby reducing the need for incremental working capital to support our growth.\nOur total capital expenditures for 2024 were $593.6 million. In 2024, we spent on average about $1.5 million in development and construction costs per new restaurant, or about $1.3 million net of landlord reimbursements of $0.2 million. In 2025, we expect to incur about $683.7 million in total capital expenditures. We expect approximately $502.7 million in capital expenditures related to our construction of new restaurants, before any reductions for landlord reimbursements. We expect the average investment cost for new restaurants opening in 2025 will be slightly higher than the average investment costs for those opened in 2024. We expect approximately $149.0 million in capital expenditures related to investments in existing restaurants including remodeling and similar improvements, new equipment and hardware, and technology to optimize efficiencies. Finally, we expect a portion of our incurred capital expenditures to be for additional corporate initiatives including investments in technology to boost innovation, enhance the guest experience, and improve operations.\n31\nTable of Contents\nThe following table summarizes current and long-term material cash requirements as of December 31, 2024, which we expect to fund primarily with operating cash flows:\nPayments Due by Fiscal Year\nTotal\n2025\n2026-2027\n2028-2029\nThereafter\n(dollars in millions)\nOperating leases\n(1)\n$\n7,204 \n$\n502 \n$\n1,089 \n$\n1,036 \n$\n4,577 \nPurchase obligations\n(2)\n2,289 \n1,161 \n766 \n362 \n- \nTotal\n$\n9,493 \n$\n1,663 \n$\n1,855 \n$\n1,398 \n$\n4,577 \n(1)\nSee \nNote 9. “Leases”\n of our consolidated financial statements included in Item 8. “Financial Statements and Supplementary Data.” This includes commitments related to reasonably certain renewal periods for leases that have commenced and includes legally binding lease payments for leases signed but not yet commenced. \n(2)\nPurchase obligations include agreements to purchase goods or services that are enforceable and legally binding on us and that specify all significant terms. We have excluded agreements that are cancellable without penalty. The majority of our purchase obligations relate to food, beverage and packaging, capital projects, information technology, marketing initiatives and corporate sponsorships, and other miscellaneous items. \nThe above table does not include income tax liabilities for uncertain tax positions for which we are not able to make a reasonably reliable estimate of the amount and period of related future payments. Additionally, we have excluded our estimated loss contingencies, due to uncertainty regarding the timing and amount of payment. See \nNote 11. “Commitments and Contingencies”\n of our consolidated financial statements included in Item 8. “Financial Statements and Supplementary Data.”\nCash Flows\nCash provided by operating activities was $2.1 billion for the year ended December 31, 2024, compared to $1.8 billion for the year ended December 31, 2023. The increase was primarily due to higher net earnings and, to a lesser extent, net cash changes in operating assets and liabilities.\nCash used in investing activities was $837.5 million for the year ended December 31, 2024, compared to $946.0 million for the year ended December 31, 2023. The change was primarily associated with a $121.2 million decrease in investment purchases net of investment maturities. This was partially offset by increased capital expenditures of $32.9 million primarily related to costs associated with new restaurant development.\nCash used in financing activities was $1.1 billion for the year ended December 31, 2024, compared to $660.7 million for the year ended December 31, 2023. The change was primarily due to increased repurchases of common stock of $409.2 million.\nCritical Accounting Estimates\nWe describe our significant accounting policies in \nNote 1. “Description of Business and Summary of Significant Accounting Policies”\n of our consolidated financial statements included in Item 8. “Financial Statements and Supplementary Data.” Critical accounting estimates are those that we believe are both significant and that require us to make difficult, subjective or complex judgments, often because we need to estimate the effect of inherently uncertain matters. We base our estimates and judgments on historical experiences and various other factors that we believe to be appropriate under the circumstances. Actual results may differ from these estimates, and we might obtain different estimates if we used different assumptions or factors. \nLeases\nThe majority of our operating leases consist of restaurant locations and office space. We determine if a contract contains a lease at inception. Our leases generally have remaining terms of 1-20 years and most include options to extend the leases for additional 5-year periods. Generally, the lease term is the minimum of the noncancelable period of the lease or the lease term inclusive of reasonably certain renewal periods up to a term of 20 years. If the estimate of our reasonably certain lease term was changed, our depreciation and rent expense could differ materially.\n32\nTable of Contents\nOperating lease assets and liabilities are recognized at the lease commencement date, which is the date we control the use of the property. Operating lease liabilities represent the present value of lease payments not yet paid. We made the policy election to combine lease and non-lease components. We consider fixed common area maintenance (“CAM”) part of our fixed future lease payments; therefore, fixed CAM is also included in our operating lease liability. Operating lease assets represent our right to use an underlying asset and are based upon the operating lease liabilities adjusted for prepayments, initial direct costs, lease incentives, and impairment of operating lease assets. To determine the present value of lease payments not yet paid, we estimate incremental borrowing rates corresponding to the reasonably certain lease term. As we have no outstanding debt nor committed credit facilities, secured or otherwise, we estimate this rate based on prevailing financial market conditions, comparable company and credit analysis, and management judgment. If the estimate of our incremental borrowing rate was changed, our operating lease assets and liabilities could differ materially. \nImpairment of Long-Lived Assets \nLong-lived assets are reviewed for impairment whenever events or changes in circumstances indicate that the carrying amount of an asset may not be recoverable. Long-lived assets are grouped at the lowest level for which identifiable cash flows are largely independent of the cash flows of other assets and liabilities. For restaurant assets, we test impairment at the individual restaurant asset group level, which includes leasehold improvements, property and equipment and operating lease assets.\nThe fair value measurement for asset impairment is generally based on Level 3 inputs. We first compare the carrying value of the asset (or asset group, referred interchangeably throughout as asset) to the asset’s estimated future undiscounted cash flows. If the estimated undiscounted future cash flows are less than the carrying value of the asset, we determine if we have an impairment loss by comparing the carrying value of the asset to the asset's estimated fair value. The estimated fair value of the asset is generally determined using the income approach to measure the fair value, which is based on the present value of estimated future cash flows. Key inputs to the income approach for restaurant assets include the discount rate, projected revenue and expenses, and sublease income if we are closing the restaurant. In certain cases, management uses other market information, when available, to estimate the fair value of an asset. The impairment charges represent the excess of each asset’s carrying amount over its estimated fair value and are allocated among the long-lived asset or assets of the group. \nOur estimates of future revenues and expenses are highly subjective judgments based on internal projections and knowledge of our operations, historical performance, and trends in sales and restaurant operating costs, and can be significantly impacted by changes in our business or economic conditions. The determination of asset fair value is also subject to significant judgment and utilizes valuation techniques including discounting estimated future cash flows and market-based analyses to determine fair value. If our estimates or underlying assumptions, including discount rate and sublease income change in the future, our operating results may be materially impacted.\nStock-based Compensation \nWe recognize compensation expense for equity awards over the requisite service period based on the award’s fair value. Under our stock incentive plans, we issue stock-only stock appreciation rights (\"SOSARs\"), restricted stock units (\"RSUs\"), and performance stock units (\"PSUs\"). We use the Black-Scholes valuation model to determine the fair value of our SOSARs, and we use the Monte Carlo simulation model to determine the fair value of PSUs that contain market conditions. Both of these models require assumptions to be made regarding our stock price volatility, the expected life of the award and expected dividend rates. The volatility and the expected life assumptions are based on our historical data. Similarly, the compensation expense of performance share awards is based in part on the estimated probability of achieving levels of performance associated with particular levels of payout for performance shares. We determine the probability of achievement of future levels of performance by comparing the relevant performance level with our internal estimates of future performance. Those estimates are based on a number of assumptions, including but not limited to growth in restaurant cash flow dollars, average restaurant level operating margin, and growth in new restaurant openings, and different assumptions may have resulted in different conclusions regarding the probability of achieving future levels of performance relevant to the payout levels for the awards. If we change our estimates of stock price volatility or expected lives of our SOSARs, or if we change our assumptions regarding the probability of achieving future levels of performance with respect to performance share awards, our stock-based compensation expense and results of operations may be materially impacted. \n33\nTable of Contents\nIncome Taxes\nOur provision for income taxes, deferred tax assets and liabilities and any related valuation allowance requires the use of estimates based on our management’s interpretation and application of complex tax laws and accounting guidance. The majority of our income tax liability is incurred in the U.S. We establish reserves for uncertain tax positions for material, known tax exposures relating to deductions, transactions and other matters involving some uncertainty as to the measurement and recognition of the item. We may adjust these reserves when our judgment changes as a result of the evaluation of new information not previously available and will be reflected in the period in which the new information is available, or due to the expiration of any applicable statute of limitations. While we believe that our reserves are adequate, issues raised by a tax authority may be resolved at an amount different than the related reserve and could materially increase or decrease our income tax provision in future periods.",
  "item2": null
}