{
  "source_file": "cmi-20241231.htm",
  "form_type": "10-K",
  "item1": "ITEM 1.    Business\nOVERVIEW \nWe were founded in 1919 as Cummins Engine Company, a corporation in Columbus, Indiana, and one of the first diesel engine manufacturers. In 2001, we changed our name to Cummins Inc. We are a global power solutions leader comprised of five business segments - Engine, Components, Distribution, Power Systems and Accelera - supported by our global manufacturing and extensive service and support network, skilled workforce and vast technical expertise. Our products range from advanced diesel, natural gas, electric and hybrid powertrains and powertrain-related components including aftertreatment, turbochargers, fuel systems, valvetrain technologies, controls systems, air handling systems, automated transmissions, axles, drivelines, brakes, suspension systems, electric power generation systems, electrified power systems with innovative components and subsystems, including battery, fuel cell and electric power technologies and hydrogen production technologies. We sell our products to original equipment manufacturers (OEMs), distributors, dealers and other customers worldwide. We serve our customers through a service network of approximately 650 wholly-owned, joint venture and independent distributor locations and more than 19,000 Cummins certified dealer locations in approximately 190 countries and territories.\nDivestiture of Atmus\nOn March 18, 2024, we completed the divestiture of our remaining 80.5 percent ownership of Atmus Filtration Technologies Inc. (Atmus) common stock through a tax-free split-off. The exchange resulted in a reduction of shares of our common stock outstanding by 5.6 million shares and a gain of approximately $1.3 billion. See NOTE 21, \"ATMUS INITIAL PUBLIC OFFERING (IPO) AND DIVESTITURE,\" to our \nConsolidated Financial Statements\n for additional information.\nSettlement Agreements\nIn December 2023, we announced that we reached an agreement in principle with the U.S. Environmental Protection Agency (EPA), the California Air Resources Board (CARB), the Environmental and Natural Resources Division of the U.S. Department of Justice (DOJ) and the California Attorney General’s Office to resolve certain regulatory civil claims regarding our emissions certification and compliance process for certain engines primarily used in pick-up truck applications in the U.S., which became final and effective in April 2024 (collectively, the Settlement Agreements). In the second quarter of 2024, we made $1.9 billion of payments required by the Settlement Agreements. See NOTE 14, “COMMITMENTS AND CONTINGENCIES,” to our \nConsolidated Financial Statements \nfor additional information.\nOPERATING SEGMENTS\nWe have five complementary operating segments: Engine, Components, Distribution, Power Systems and Accelera. These segments share technology, customers, strategic partners, brand recognition and our distribution network in order to compete more efficiently and effectively in their respective markets. In each of our operating segments, we compete worldwide with a number of other manufacturers and distributors that produce and sell similar products. Our products primarily compete on the basis of performance, price, total cost of ownership, fuel economy, emissions compliance, speed of delivery, quality and customer support. \nWe use segment earnings or losses before interest expense, income taxes, depreciation and amortization and noncontrolling interests (EBITDA) as the basis for the Chief Operating Decision Maker to evaluate the performance of each of our reportable operating segments. We believe EBITDA is a useful measure of our operating performance as it assists investors and debt holders in comparing our performance on a consistent basis without regard to financing methods, capital structure, income taxes or depreciation and amortization methods, which can vary significantly depending upon many factors. See NOTE 25, \"OPERATING SEGMENTS,\" to our \nConsolidated Financial Statements \nfor additional information and a reconciliation of our segment information to the corresponding amounts in our \nConsolidated Statements of Net Income\n.\n5\nTable of Contents\nEngine Segment\nEngine segment sales and EBITDA as a percentage of consolidated results were: \n \nYears ended December 31,\n \n2024\n2023\n2022\nPercent of consolidated net sales \n(1)\n28\n \n%\n28 \n%\n31 \n%\nPercent of consolidated EBITDA \n(1)\n33\n \n%\n32 \n%\n38 \n%\n(1)\n Measured before intersegment eliminations\nThe Engine segment manufactures and markets a broad range of diesel and natural gas-powered engines under the Cummins brand name, as well as certain customer brand names, for the heavy-duty truck, medium-duty truck and bus, light-duty automotive and off-highway markets. We manufacture a wide variety of engine products including:\n•\nEngines with a displacement range of 2.8 to 15 liters and horsepower ranging from 48 to 715; and\n•\nNew and remanufactured parts and engines, which are sold and serviced primarily through our extensive distribution network.\nThe Engine segment is organized by engine displacement size and serves these end-user markets:\n•\nHeavy-duty truck - \nWe manufacture diesel and natural gas engines that range from 310 to 615 horsepower serving global heavy-duty truck customers worldwide, primarily in North America, China and Australia.\n•\nMedium-duty truck and bus - \nWe manufacture diesel and natural gas engines ranging from 130 to 450 horsepower serving medium-duty truck and bus customers worldwide, with key markets including North America, Europe, Latin America, China, Australia and India. Applications include pick-up, delivery, emergency vehicles, regional haul and vocational trucks and school, transit and shuttle buses. We also provide diesel engines for Class A motor homes (RVs), primarily in North America. \n \n•\nLight-duty automotive (pick-up and light commercial vehicle (LCV)) - \nWe manufacture 105 to 430 horsepower diesel engines, including engines for the pick-up truck market for Stellantis N.V. (Stellantis) in North America and LCV markets in Latin America and China.\n•\nOff-highway (industrial engines) - \nWe manufacture diesel engines that range from 48 to 715 horsepower serving key global markets including construction, mining, marine, rail, oil and gas, defense and agriculture and also the power generation business for standby, mobile and distributed power generation solutions throughout the world.\n \nThe principal customers of our heavy-duty truck engines include truck manufacturers such as PACCAR Inc. (PACCAR), Traton Group (Traton) and Daimler Trucks AG (Daimler). The principal customers of our medium-duty truck and bus engines include truck manufacturers such as Daimler, Traton and PACCAR. The principal customers of our light-duty automotive engines are Stellantis, Anhui Jianghuai Automobile Group Co., Ltd., Volkswagen Caminhões e Ônibus and China National Heavy Duty Truck Group. We sell our industrial engines to manufacturers of construction and agricultural equipment including Hyundai Heavy Industries, Komatsu Ltd. (Komatsu), Zoomlion Heavy Industry Science & Technology Co., Ltd, Xuzhou Construction Machinery Group, Guangxi LiuGong Machinery Co., Ltd, JLG Industries, Inc. and Sany Group. \nIn the Engine segment, our competitors vary from country to country, with local manufacturers generally predominant in each geography. Other independent engine manufacturers include Weichai Power Co. Ltd. and Deutz AG. Truck OEMs may also elect to produce their own engines, and we must provide competitive products to win and keep their business. Truck OEMs that currently produce some or all of their own engines include Daimler, PACCAR, Traton, Volvo Powertrain, Ford Motor Company, China First Auto Works, Dongfeng Motor Corporation, CNH Industrial and Isuzu.\n6\nTable of Contents\nComponents Segment\nComponents segment sales and EBITDA as a percentage of consolidated results were:\n \nYears ended December 31,\n \n2024\n2023\n2022\nPercent of consolidated net sales \n(1)\n28\n \n%\n32 \n%\n28 \n%\nPercent of consolidated EBITDA \n(1)\n32\n \n%\n36 \n%\n33 \n%\n(1)\n Measured before intersegment eliminations\nThe Components segment designs, manufactures and supplies products which complement the Engine and Power Systems segments, including axles, drivelines, brakes and suspension systems for commercial diesel and natural gas applications, aftertreatment systems, turbochargers, fuel systems, valvetrain technologies, automated transmissions and electronics. We design and develop these products and systems to meet increasingly stringent emission and fuel economy standards. \nBeginning in the second quarter of 2024, we realigned certain businesses within our Components segment to be consistent with how our segment leader now monitors performance. We reorganized the businesses to combine the engine components and software and electronics businesses into the newly formed components and software business. In addition, we rebranded our axles and brakes business as drivetrain and braking systems. We began reporting results for these changes within our Components segment effective April 1, 2024, and reflected these changes in the historical periods presented. The change had no impact on our consolidated results.\nThe Components segment is organized around the following businesses:\n•\nDrivetrain and braking systems - \nWe design, manufacture and supply drivetrain systems, including axles, drivelines, brakes and suspension systems primarily for commercial vehicle and industrial applications. We also market and sell truck, trailer, on- and off-highway and other products principally for OEM dealers and other independent distributors and service garages within the aftermarket industry. We primarily serve markets in North America, Europe, South America, India, Asia Pacific and China.\n•\nEmission solutions - \nWe are a global leader in designing, manufacturing and integrating aftertreatment technology and solutions for the commercial on- and off-highway light-duty, medium-duty, heavy-duty and high-horsepower engine markets. Aftertreatment is the mechanism used to convert engine emissions of criteria pollutants, such as particulate matter, nitrogen oxides (NOx), carbon monoxide and unburned hydrocarbons into harmless emissions. Our products include custom engineering systems and integrated controls, oxidation catalysts, particulate filters, selective catalytic reduction systems and engineered components, including dosers. Our emission solutions business primarily serves markets in North America, Europe, China, India, Brazil and Asia Pacific. We serve both OEM first fit and retrofit customers.\n•\nComponents and software - \nWe design, manufacture and market turbocharger, fuel system and valvetrain technologies for light-duty, mid-range, heavy-duty and high-horsepower markets. We also design, develop and supply electronic control modules, sensors and supporting software for on-highway, off-highway and power generation applications. We primarily serve markets in North America, Europe, China and India. \n•\nAutomated transmissions - \nWe develop and supply automated transmissions for the heavy-duty commercial vehicle market. Automated transmissions include automated manual transmissions, dual-clutch transmissions and automatic transmissions for internal combustion engines. The Eaton Cummins Automated Transmission Technologies (ECJV) joint venture is a consolidated 50/50 joint venture between Cummins Inc. and Eaton Corporation Plc. and serves markets in North America and China. \n•\nAtmus - \nOn March 18, 2024, we completed the divestiture of our remaining 80.5 percent ownership of Atmus common stock through a tax-free split-off. See NOTE 21, \"ATMUS INITIAL PUBLIC OFFERING (IPO) AND DIVESTITURE,\" to our \nConsolidated Financial Statements\n for additional information.\nCustomers of the Components segment generally include the Engine, Distribution, Power Systems and Accelera segments, joint ventures including Tata Cummins Ltd., Dongfeng Cummins Engine Co., Ltd. and Beijing Foton Cummins Engine Co., Ltd., truck manufacturers and other OEMs, many of which are also customers of the Engine segment, such as PACCAR, Daimler, Volvo, Traton, Tata Motors Ltd. (Tata Motors) and other manufacturers that use our components in their product platforms.\nThe Components segment competes with other manufacturers of aftertreatment systems, turbochargers, fuel systems, drivetrain systems and transmissions. Our primary competitors in these markets include Robert Bosch GmbH, Parker-Hannifin Corporation, Garrett Motion, Inc., Borg-Warner Inc., Tenneco Inc., Eberspacher Holding GmbH & Co. KG, Denso Corporation, Allison Transmission, Aisin Corporation, Knorr-Bremse AG, ZF Friedrichshafen AG and Dana Incorporated.\n7\nTable of Contents\nDistribution Segment\nDistribution segment sales and EBITDA as a percentage of consolidated results were:\n \nYears ended December 31,\n \n2024\n2023\n2022\nPercent of consolidated net sales \n(1)\n27\n \n%\n25 \n%\n26 \n%\nPercent of consolidated EBITDA \n(1)\n27\n \n%\n24 \n%\n22 \n%\n(1)\n Measured before intersegment eliminations\nThe Distribution segment is our primary sales, service and support channel. The segment serves our customers and certified dealers through a worldwide network of wholly-owned, joint venture and independent distribution locations. Wholly-owned locations operate and serve markets in the seven geographic regions noted below. Joint venture locations serve markets in South America, Southeast Asia and India while independent distribution locations serve markets in these and other geographies.\nDistribution’s mission encompasses the sale and support of a wide range of products and services, including power generation systems, high-horsepower engines, heavy-duty and medium-duty engines designed for on- and off-highway use, application engineering services, custom-designed assemblies, retail and wholesale aftermarket parts and in-shop and field-based repair services. We also provide selected sales and aftermarket support for the Accelera business. Our familiarity with a wide range of market applications allows us to tailor sales, service and support to meet customer-specific needs. \nThe Distribution segment is organized and managed as seven geographic regions, including North America, Asia Pacific, Europe, China, India, Africa and Middle East and Latin America. Across these regions, our locations compete with distributors or dealers that offer similar products. In many cases, these competing distributors or dealers are owned by, or affiliated with the companies that are listed as competitors of the Engine, Components or Power Systems segments. These competitors vary by geographical location and application market. \nPower Systems Segment \nPower Systems segment sales and EBITDA as a percentage of consolidated results were:\n \nYears ended December 31,\n \n2024\n2023\n2022\nPercent of consolidated net sales \n(1)\n16\n \n%\n14 \n%\n14 \n%\nPercent of consolidated EBITDA \n(1)\n23\n \n%\n16 \n%\n15 \n%\n(1)\n Measured before intersegment eliminations\nThe Power Systems segment is organized around the following product lines:\n•\nPower generation - \nWe are a global OEM offering standby and prime power generators ranging from 2 kilowatts to 3.5 megawatts, as well as controls, paralleling systems and transfer switches, for customers with consumer, data center, commercial, industrial, health care, prime rental fleet and defense applications. We also provide turnkey solutions for distributed generation and energy management applications using natural gas, diesel and newer alternative sustainable fuels such as hydrotreated vegetable oil and renewable natural gas.\n•\nIndustrial -\n We design, manufacture, sell and support diesel and natural gas high-speed, high-horsepower engines up to 4,400 horsepower for a wide variety of equipment in mining, oil and gas, marine, rail and defense applications throughout the world.\n•\nGenerator technologies - \nWe design, manufacture, sell and support A/C generator/alternator products for internal consumption and for external generator set assemblers. Our products are sold under the Stamford and AVK brands and range in output from 7.5 kilovolt-amperes (kVA) to 11,200 kVA.\nOur customer base for Power Systems offerings is highly diversified, with customer groups varying based on their power needs. China, India, Europe, Asia Pacific, Latin America, the Middle East and Africa are our largest geographic markets outside of North America.\n8\nTable of Contents\nIn the markets served by the Power Systems segment, we compete with a variety of independent engine manufacturers and generator set assemblers as well as OEMs who manufacture engines for their own products around the world. Our primary competitors are Caterpillar, Inc., MTU (Rolls Royce Power Systems Group) and Kohler/SDMO (Kohler Group), but we also compete with INNIO, Generac, Mitsubishi Heavy Industries and numerous regional generator set assemblers. Our alternator business competes globally with Leroy Somer, Marathon Electric and Meccalte, among others.\nAccelera Segment \nThe Accelera segment designs, manufactures, sells and supports electrified power systems with innovative components and subsystems, including battery, fuel cell and electric powertrain technologies as well as hydrogen production technologies. The Accelera segment is currently in the early stages of commercializing these technologies with efforts primarily focused on the development of electrified power systems and related components and subsystems and our electrolyzers for hydrogen production. \nWe anticipate our customer base for Accelera offerings will be highly diversified, representing multiple end markets with a broad range of application requirements. This includes new markets, like the growing green hydrogen market, which we serve with our leading hydrogen production technologies. We will continue to pursue relationships in markets as they adopt electric and hydrogen solutions. \nIn the markets served by the Accelera segment, we compete with battery and emerging fuel cell companies, powertrain component manufacturers, vertically integrated OEMs and entities providing hydrogen production solutions. Our primary competitors include Daimler, PACCAR, Traton, BYD Company Limited, Dana Incorporated, BorgWarner Inc., Nel ASA, Siemens Energy, Thyssenkrupp and Plug Power Inc.\nJOINT VENTURES, ALLIANCES AND NON-WHOLLY-OWNED SUBSIDIARIES\nWe entered into a number of joint venture agreements and alliances with business partners around the world. Our joint ventures are either distribution or manufacturing entities. We also own controlling interests in non-wholly-owned manufacturing and distribution subsidiaries.\nIn the event of a change of control of either party to certain of these joint ventures and other strategic alliances, certain consequences may result including automatic termination and liquidation of the venture, exercise of \"put\" or \"call\" rights of ownership by the non-acquired partner, termination or transfer of technology license rights to the non-acquired partner and increases in component transfer prices to the acquired partner. We will continue to evaluate joint venture and partnership opportunities in order to penetrate new markets, develop new products and generate manufacturing and operational efficiencies.\nFinancial information about our investments in joint ventures and alliances is incorporated by reference from NOTE 3, \"INVESTMENTS IN EQUITY INVESTEES,\" to our \nConsolidated Financial Statements. \n9\nTable of Contents\nOur equity income from these investees was as follows:\nYears ended December 31,\nIn millions\n2024\n2023\n2022\nManufacturing entities\n \n \n \n \n \n \nDongfeng Cummins Engine Company, Ltd.\n$\n66\n \n22\n \n%\n$\n65 \n19 \n%\n$\n45 \n20 \n%\nChongqing Cummins Engine Company, Ltd.\n60\n \n20\n \n%\n36 \n11 \n%\n32 \n14 \n%\nBeijing Foton Cummins Engine Co., Ltd.\n42\n \n14\n \n%\n47 \n14 \n%\n37 \n17 \n%\nTata Cummins, Ltd.\n31\n \n10\n \n%\n29 \n9 \n%\n27 \n12 \n%\nAll other manufacturers\n25\n \n(1)\n9\n \n%\n91 \n27 \n%\n28 \n(2)\n12 \n%\nDistribution entities\nKomatsu Cummins Chile, Ltda.\n55\n \n19\n \n%\n55 \n16 \n%\n44 \n20 \n%\nAll other distributors\n17\n \n6\n \n%\n16 \n4 \n%\n11 \n5 \n%\nCummins share of net income \n(3)\n$\n296\n \n100\n \n%\n$\n339 \n100 \n%\n$\n224 \n100 \n%\n(1)\n Included a $17 million impairment of our joint ventures in the fourth quarter of 2024 related to our Accelera strategic reorganization actions. See NOTE 22, \"ACCELERA STRATEGIC REORGANIZATION ACTIONS,\" to our \nConsolidated Financial Statements\n for additional information.\n(2) \nIncluded a $28 million impairment of our joint venture with KAMAZ and $3 million of royalty charges as part of our costs associated with the indefinite suspension of our Russian operations. See NOTE 24, \"RUSSIAN OPERATIONS,\" to our \nConsolidated Financial Statements\n for additional information.\n(3)\n This total represents our share of net income of our equity investees and is exclusive of royalties and interest income from our equity investees. To see how this amount reconciles to equity, royalty and interest income from investees in our \nConsolidated Statements of Net Income\n, see NOTE 3, \"INVESTMENTS IN EQUITY INVESTEES,\" to our \nConsolidated Financial Statements \nfor additional information\n.\nManufacturing Entities\nOur manufacturing joint ventures were generally formed with customers and are primarily intended to allow us to increase our market penetration in geographic regions, reduce capital spending, streamline our supply chain management and develop technologies. Our largest manufacturing joint ventures are based in China and are included in the list below. Our engine manufacturing joint ventures are supplied by our Components segment in the same manner as it supplies our wholly-owned Engine segment and Power Systems segment manufacturing facilities. Our Components segment joint ventures and wholly-owned entities provide axles, drivelines, brakes and suspension systems for commercial diesel and natural gas applications, aftertreatment systems, turbochargers, fuel systems, valvetrain technologies, automated transmissions and electronics that are used with our engines as well as some competitors' products. The results and investments in our joint ventures in which we have 50 percent or less ownership interest (except for ECJV, which is consolidated due to our majority voting interest) discussed below are included in equity, royalty and interest income from investees and investments and advances related to equity method investees in our \nConsolidated Statements of Net Income\n and \nConsolidated Balance Sheets\n, respectively.\n \n•\nDongfeng Cummins Engine Company, Ltd. - \nDongfeng Cummins Engine Company, Ltd. (DCEC) is a joint venture in China with Dongfeng Automotive Co. Ltd., a subsidiary of Dongfeng Motor Corporation and one of the largest medium-duty and heavy-duty truck manufacturers in China. DCEC produces 3.9 liter to 14.5 liter diesel engines with a power range from 80 to 760 horsepower, natural gas engines and automated transmissions. On-highway engines are used in multiple applications in light-duty and medium-duty trucks, special purpose vehicles, buses and heavy-duty trucks with a main market in China. Off-highway engines are used in a variety of construction, power generation, marine and agriculture markets in China. \n•\nChongqing Cummins Engine Company, Ltd. - \nChongqing Cummins Engine Company, Ltd. is a joint venture in China with Chongqing Machinery and Electric Co. Ltd. This joint venture manufactures several models of our heavy-duty and high-horsepower diesel engines primarily serving the industrial and stationary power markets in China.\n•\nBeijing Foton Cummins Engine Co., Ltd. - \nBeijing Foton Cummins Engine Co., Ltd. is a joint venture in China with Beiqi Foton Motor Co., Ltd., a commercial vehicle manufacturer, which has two distinct lines of business - a light-duty business and a heavy-duty business. The light-duty business produces our families of ISF 2.5 liter to 4.5 liter high performance light-duty diesel engines in Beijing. These engines are used in light-duty and medium-duty commercial trucks, pick-up trucks, buses, multipurpose and sport utility vehicles with main markets in China and Brazil. Certain types of small construction equipment and industrial applications are also served by these engine families. The heavy-duty business produces 7.0 liter to 14.5 liter high performance heavy-duty diesel and natural gas engines in Beijing. Certain types of construction equipment and industrial applications are also served by these engine families.\n10\nTable of Contents\n•\nTata Cummins, Ltd. - \nTata Cummins, Ltd. is a joint venture in India with Tata Motors Ltd., the largest automotive company in India and a member of the Tata group of companies. This joint venture manufactures Cummins' 3.8 to 8.9 liter diesel and natural gas engines in India with a power range from 75 to 400 horsepower for use in trucks and buses manufactured by Tata Motors, as well as for various on-highway, industrial and power generation applications for Cummins.\nIn September 2023, our Accelera business signed an agreement to form a joint venture, Amplify Cell Technologies LLC, with Daimler Truck, PACCAR and EVE Energy to accelerate and localize battery cell production and the battery supply chain in the U.S., including building a 21-gigawatt hour battery production facility in Marshall County, Mississippi. The joint venture will manufacture battery cells for electric commercial vehicles and industrial applications. The joint venture received all government approvals and began operations in May 2024, but is not expected to begin production until 2027. The joint venture meets the definition of a variable interest entity since the equity-at-risk is not currently sufficient to support the future operations of the joint venture. Accelera, Daimler Truck and PACCAR each own 30 percent of the joint venture and have two board positions, while EVE Energy owns 10 percent and has one board position. All significant decisions require majority or super-majority approval of the board. As a result, we are not the primary beneficiary of the joint venture, and the joint venture is not consolidated. We account for the joint venture using the equity method. As of December 31, 2024, we had contributed $211 million, and our maximum remaining required contribution to the joint venture was $619 million, which could be reduced by future government incentives received by the joint venture. In addition, we are required to purchase 33 percent of the joint venture's output in the future or be subject to certain penalties. \nDistribution Entity\nKomatsu Cummins Chile, Ltda. - \nKomatsu Cummins Chile, Ltda. is a joint venture with Komatsu America Corporation. The joint venture is a distributor that offers the full range of our products and services to customers and end-users in Chile and Peru. See further discussion of our distribution network under the Distribution segment section above.\nNon-Wholly-Owned Subsidiaries\n•\nEaton Cummins Automated Transmission Technologies\n - We have a majority voting interest in ECJV by virtue of a tie-breaking vote on the joint venture’s board of directors. ECJV develops and supplies automated transmissions for the heavy-duty commercial vehicle markets in North America and China.\n•\nCummins India Ltd. \n- We have a controlling interest in Cummins India Ltd. (CIL), which is a publicly listed company on various stock exchanges in India. CIL produces medium-duty, heavy-duty and high-horsepower diesel engines and generators for the Indian and export markets and natural gas spark-ignited engines for power generation, automotive and industrial applications. CIL also has distribution and power generation operations.\nSUPPLY\nThe performance of the end-to-end supply chain, extending through to our suppliers, is foundational to our ability to meet customers' expectations and support long-term growth. We are committed to having a robust strategy for how we select and manage our suppliers to enable a market focused supply chain. This requires us to continuously evaluate and upgrade our supply base, as necessary, as we strive to ensure we are meeting the needs of our customers.\nWe use a combination of proactive and reactive methodologies to enhance our understanding of supply base risks, which guide the development of risk monitoring and sourcing strategies. We use a process that groups products or services into categories based on similar characteristics, which helps us align our purchasing goals with overall business objectives (Category Strategy Framework). Our Category Strategy Framework process supports the review of our long-term needs and guides decisions on what we make internally and what we purchase externally. For externally purchased items, the strategies also identify the suppliers we should consider for long-term supply agreements to provide the best technology, the lowest total cost and highest supply chain performance. We design and/or manufacture our strategic components used in or with our engines, power generation units, drivetrain and braking systems and Accelera products. Key suppliers are managed through long-term supply agreements that seek to secure capacity, delivery and quality\n \nand to assure cost requirements are met over an extended period. \nOther important elements of our sourcing strategy include the following:\n•\nexpanding risk management scope to include sub-tier value chain suppliers for critical components; \n•\nbroadening dual and multi-sourcing where applicable;\n•\nselecting and managing suppliers to comply with our Supplier Code of Conduct; and\n•\nassuring our suppliers comply with our prohibited and restricted materials policy.\n11\nTable of Contents\nDisruption risk in certain categories of our supply chains exist and could negatively impact our ability to meet customer demand. We continue to monitor the supply chain disruptions utilizing early detection methods complemented by structured supplier risk and resiliency assessments. We increased frequency of formal and informal supplier engagement to address potentially impactful supply base constraints and enhanced collaboration to develop specific countermeasures to mitigate risks. \nPATENTS AND TRADEMARKS\nWe own or control a significant number of patents and trademarks relating to the products we manufacture. These patents and trademarks were granted and registered over a period of years. Although these patents and trademarks are generally considered beneficial to our operations, we do not believe any patent, group of patents or trademark (other than our leading brand house trademarks) is significant to our business.\nSEASONALITY\nWhile individual product lines may experience modest seasonal variation in production, there is no material effect on the demand for the majority of our products on a quarterly basis.\nLARGEST CUSTOMERS\nWe have thousands of customers around the world and have developed long-standing business relationships with many of them. PACCAR is our largest customer, accounting for 16 percent of our consolidated net sales in 2024, 16 percent in 2023 and 16 percent in 2022. We have long-term supply agreements with PACCAR for our heavy-duty and medium-duty engines and aftertreatment systems. While a significant number of our sales to PACCAR are under long-term supply agreements, these agreements provide for particular engine requirements for specific vehicle models and not a specific volume of engines or aftertreatment systems. PACCAR is our only customer accounting for more than 10 percent of our net sales in 2024. The loss of this customer or a significant decline in the production level of PACCAR vehicles that use our engines would have an adverse effect on our results of operations and financial condition. We have supplied engines to PACCAR for 80 years. A summary of principal customers for each operating segment is included in our segment discussion.\nIn addition to our agreement with PACCAR, we have long-term heavy-duty and medium-duty engine and aftertreatment system supply agreements with Traton and Daimler. We also have an agreement with Stellantis to supply engines and aftertreatment products for its pick-up truck applications. Collectively, our net sales to these four customers, including PACCAR, were 36 percent of our consolidated net sales in 2024, 37 percent in 2023 and 36 percent in 2022. Excluding PACCAR, net sales to any single customer were less than 9 percent of our consolidated net sales in 2024, less than 9 percent in 2023 and less than 8 percent in 2022. These agreements contain standard purchase and sale agreement terms covering engine, aftertreatment and engine parts pricing, quality and delivery commitments, as well as engineering product support obligations. The basic nature of our agreements with OEM customers is that they are long-term price and operations agreements that help provide for the availability of our products to each customer through the duration of the respective agreements. Agreements with most OEMs contain bilateral termination provisions giving either party the right to terminate in the event of a material breach, change of control or insolvency or bankruptcy of the other party. \nBACKLOG\nDisruption risk in certain categories of our supply chains exist and could negatively impact our ability to meet customer demand. We have supply agreements with some truck and off-highway equipment OEMs and firm orders from data center and electrolyzer customers, however a large portion of our business is transacted through open purchase orders. Many of these open orders are historically subject to month-to-month releases and are subject to cancellation on reasonable notice without cancellation charges and therefore are not considered firm. We continue to work closely with our suppliers and customers to meet the demand.\nRESEARCH AND DEVELOPMENT\nIn 2024, we continued to invest in future critical technologies and products. We will continue to make investments to develop new products and improve our current technologies to meet future emission standards around the world, improvements in fuel economy performance of diesel and natural gas-powered engines and related components, as well as development activities around electrified power systems with innovative components and systems including battery and electric power technologies and hydrogen production technologies.\nOur research and development programs are focused on product improvements, product extensions, innovations and cost reductions for our customers. Research and development expenditures include salaries, contractor fees, building costs, utilities, testing, technical IT expenses, administrative expenses and allocation of corporate costs and are expensed, net of contract reimbursements, when incurred. From time to time, we enter into agreements with customers and government agencies to fund a portion of the research and development costs of a particular project. When not associated with a sales contract, we generally account for these reimbursements as an offset to the related research and development expenditure. Research and development expenses, net of contract reimbursements, \n12\nTable of Contents\nwere $1.4 billion in 2024, $1.4 billion in 2023 and $1.2 billion in 2022. Contract reimbursements were $72 million, $81 million and $110 million in 2024, 2023 and 2022, respectively. \nENVIRONMENTAL SUSTAINABILITY \nWe are committed to making people's lives better by powering a more prosperous world. That prosperity includes strong communities, robust business and environmental sustainability. \nOur Board of Directors (the Board) and the senior management team oversee our top risks, while the Enterprise Risk Management program gives the Board and senior management a framework to help them understand, identify, assess, manage and monitor risks so we can meet our strategic objectives. The Board is ultimately responsible for assessing and managing climate-related risks and opportunities. Managing risk effectively is on the agenda at every regular board meeting, and the Board reviews the entire Enterprise Risk Management program and the results of our latest enterprise risk assessment each year. As climate-related risks affect all aspects of the business, the enterprise risks incorporate, where relevant, climate-related aspects, with a separate stand-alone enterprise risk on climate change.\nThe Safety, Environment and Technology (SET) committee provides overall guidance and insight on major environmental sustainability initiatives such as our environmental sustainability strategy, as well as environmental management at our facilities and operations. \nIn 2019, we introduced our current environmental sustainability strategy focused on three priority areas: addressing climate change and air emissions, using natural resources in the most sustainable way and improving communities. Additional commitments followed including Cummins Water Works, our program for strengthening communities through sustainable water and addressing the global water crisis, and Destination Zero, our long-term product decarbonization strategy. \nThe environmental sustainability strategy includes nine specific goals to achieve by 2030, including science-based greenhouse gas (GHG) reduction targets for newly sold products and facilities, as well as aspirational targets for 2050. We started reporting progress on these nine goals, most of which have a baseline year of 2018, in 2022. Key actions in 2024 included completing the planned capital spending to meet the 2030 facility reduction goals for GHG emissions, water and waste; improving GHG measurement and modeling for product emissions; and identifying technology portfolio opportunities toward progress of product GHG reduction. In 2024, we also initiated a planned midpoint review of our 2030 sustainability goals. This review reflected standard governance practices to ensure our metrics, scope and strategies remain aligned with evolving conditions and our long-term objectives. Our commitment to progress remains steadfast, and we anticipate sharing any updates or adjustments to these goals in 2025.\nThe nine goals for 2030 are as follows:\n•\nReduce absolute GHG emissions from facilities and operations by 50 percent.\n•\nReduce scope three absolute lifetime GHG emissions from newly sold products by 25 percent.\n•\nPartner with customers to reduce scope three GHG emissions from products in the field by 55 million metric tons.\n•\nReduce volatile organic compounds emissions from paint and coating operations by 50 percent.\n•\nCreate a circular lifecycle plan for every part to use less, use better, use again.\n•\nGenerate 25 percent less waste in facilities and operations as percent of revenue.\n•\nReuse or responsibly recycle 100 percent of packaging plastics and eliminate single-use plastics in dining facilities, employee amenities and events.\n•\nReduce absolute water consumption in facilities and operations by 30 percent.\n•\nProduce net water benefits that exceed our annual water use in all our regions.\nOur most recent Sustainability Progress Report and previous reports are available on our website at www.cummins.com/company/esg/sustainability-progress-reports. Our annual submission to the Carbon Disclosure Project (CDP) for climate and water is also available on our website. The CDP climate submission provides information on our scenario planning for climate and other risks, as well as detailed emissions data as requested by CDP. We also published a report in accordance with the Task Force on Climate-Related Financial Disclosures framework. These reports are not incorporated into this Form 10-K by reference. \nWe continue to articulate our positions on key public policy issues and on a wide range of environmental issues. We are actively engaged around the world to promote science-based climate policies by working with regulatory, industry and other stakeholders, including joining advocacy groups and testifying before legislators and regulators. We will continue to work in partnership with others to advocate for tough, clear and enforceable regulations around the globe to address air and GHG emissions. \n13\nTable of Contents\nENVIRONMENTAL COMPLIANCE \nSettlement Agreements \nIn December 2023, we announced that we reached an agreement in principle with the EPA, CARB, DOJ and the California Attorney General’s Office to resolve certain regulatory civil claims regarding our emissions certification and compliance process for certain engines primarily used in pick-up truck applications in the U.S., which became final and effective in April 2024, (collectively, the Settlement Agreements). As part of the Settlement Agreements, among other things, we agreed to pay civil penalties, complete recall requirements, undertake mitigation projects, provide extended warranties, undertake certain testing, take certain corporate compliance measures and make other payments. Failure to comply with the terms and conditions of the Settlement Agreements subjects us to stipulated penalties. We recorded a charge of $2.0 billion in the fourth quarter of 2023 to resolve the matters addressed by the Settlement Agreements involving approximately one million of our pick-up truck applications in the U.S. This charge was in addition to the previously announced charges of $59 million for the recalls of model years 2013 through 2018 RAM 2500 and 3500 trucks and model years 2016 through 2019 Titan trucks. We made\n \n$1.9 billion of payments required by the Settlement Agreements in the second quarter of 2024. Subsequent to the second quarter of 2024, we have recorded immaterial amounts related to stipulated penalties we determined to be probable and estimable. Any further non-compliance with the Settlement Agreements will likely subject us to further stipulated penalties and other adverse consequences.\nWe have also been in communication with other non-U.S. regulators regarding matters related to the emission systems in our engines and may also become subject to additional regulatory review in connection with these matters.\nIn connection with our announcement of our entry into the agreement in principle, we became subject to shareholder, consumer and third-party litigation regarding the matters covered by the Settlement Agreements, and we may become subject to additional litigation in connection with these matters. See NOTE 14, \"COMMITMENTS AND CONTINGENCIES,\" to our \nConsolidated Financial Statements. \nProduct Certification and Compliance \nOur products are subject to extensive statutory and regulatory requirements worldwide that directly or indirectly impose standards governing emissions and noise. Over the past several years, we have increased our global environmental compliance presence and expertise to understand and meet emerging product environmental regulations around the world. Our ability to comply with these and future emission standards is an essential element in maintaining our leadership position in regulated markets. \nWe strive to be a leader in developing and implementing technologies that provide customers with the highest performing products while minimizing the impact on the environment, and we have a long history of working with governments and regulators to achieve these goals. We remain committed to ensuring our products meet all current and future emission standards and delivering value to our customers.\nAnnounced in late 2019 and launched in early 2020, the Product Compliance and Regulatory Affairs team leads both engine emissions certification and compliance and regulatory affairs initiatives and provides updates to the SET Committee of the Board at least annually. This organization is led by the Vice President - Product Compliance and Regulatory Affairs and reports directly to the Chief Administrative Officer and the Chief Executive Officer (CEO) for product emissions matters. The focus of this organization is to strengthen our ability to design great products that help our customers win while complying with increasingly challenging global emission regulations. The organization also works to enhance our collaboration with the agencies setting the direction and regulations of emissions as we strive to meet every expectation today while planning for future changes.\nOther Environmental Statutes and Regulations \nExpenditures for environmental control activities and environmental remediation projects at our facilities in the U.S. were not a substantial portion of our annual expenses and are not expected to be material in 2025. We believe we are in compliance in all material respects with laws and regulations applicable to our plants and operations.\nIn the U.S., pursuant to notices received from federal and state agencies and/or defendant parties in site environmental contribution actions, we were identified as a potentially responsible party under the Comprehensive Environmental Response, Compensation and Liability Act of 1980, as amended or similar state laws, at fewer than 20 manufacturing and waste disposal sites. \nBased upon our experiences at similar sites we believe that our aggregate future remediation costs will not be material. We have established accruals that we believe are adequate for our expected future liability with respect to these sites. In addition, we have several other sites where we are working with governmental authorities on remediation projects. The costs for these remediation projects are not expected to be material.\n14\nTable of Contents\nHUMAN CAPITAL RESOURCES \nAt December 31, 2024, we employed approximately 69,600 persons worldwide. Approximately 22,000 of our employees worldwide were represented by various unions under collective bargaining agreements that expire between 2025 and 2029.\nThroughout our more than 100-year history, we have always recognized that people drive the strength of our business and our ability to effectively serve our customers and sustain our competitive position. We are focused on harmonizing our approach to talent to provide seamless opportunities and better experiences to our employees around the world. Our workforce strategy aims to cultivate an environment where all employees, regardless of employee type and location, know what is expected of them, are rewarded for their performance based on fair and equitable reviews, and have access to differentiated experiences, tools and leadership coaching to help them develop. This strategy is anchored on developing authentic and capable leaders, building effective organizations, driving employee engagement, furthering our company values of caring, integrity, excellence, teamwork and diversity and inclusion, delivering quality experiences and providing benefits that advance the well-being of our people and their families. \nLeadership and Talent Development\nDeveloping our human capital resources is a key focus for us. The Board remains resolute in overseeing this focus and providing guidance to our leadership team, through a committed Talent Management Compensation Committee. \nWe strive to create a leadership culture that begins with self-aware and capable leaders creating an environment in which all employees can thrive and reach their full potential. We encourage leaders to connect our people and their work to our mission, vision, values, brand promise and growth strategy, thus, motivating employees and hopefully helping them feel a higher sense of purpose in their contributions.\nWe have designed leadership and talent development programs for employees ranging from the manufacturing floor and technicians through to middle management and executives. We are promoting a learning culture by providing employees and their managers with tools and resources to have meaningful development conversations, envision and plan their careers, thrive in their work and navigate in a large global organization. Through our talent strategy, our goal is to provide all employees with equitable access to the development and career opportunities that a global company, like Cummins, enables. \nCompetitive Pay and Benefits\nTo attract and retain the best employees, we focus on providing progressive, competitive pay and benefits. Our programs target the market for competitiveness and sustainability while ensuring that we honor our core values. We provide benefit programs with the goal of improving the physical, mental, emotional, social and financial wellness of our employees throughout their lifetime. Some examples include base and variable pay, healthcare programs, paid time off, flexible work, retirement saving plans and employee stock purchase plans.\nWhen designing our base pay ranges, we conduct market analyses to ensure our ranges are competitive and our employees are advancing their earning potential. We also perform annual compensation studies to assess market movement, pay equity and living wages. We review wages globally as we continuously work to ensure we are fair, equitable, competitive and can attract and retain the best talent. \nWe also provide an array of benefits as part of our total rewards program that are aligned with our values and focused on supporting employees and their families based on their unique needs, some of which include the following: healthcare plans that are tiered by salary, to ensure affordability to all of our employees; paid parental leave for primary and secondary caregivers; travel benefits and advanced medical services to support complex health care needs; global employee assistance programs; and a global mental health program, all designed to support employees on the journey to well-being.\nEmployee Safety and Wellness \nCummins is committed to being world-class in health and safety. We are committed to removing conditions that cause personal injury or occupational illness, and we make decisions and promote behaviors that protect employees from risk of injury. We publicly disclose metrics on our rate of recordable injuries, our rate of lost workdays due to injury, rate of ergonomic injuries and rate of potentially serious injuries and fatalities. \nSince 2020, we have taken many steps in the employee safety and wellness area including the following:\n•\nExecuted robust safety protocols for essential on-site personnel.\n•\nImplemented remote and hybrid work environments, where possible, to give employees flexibility to work off-site. As part of this effort, we provide remote ergonomic evaluations and support to help employees create off-site workspaces that are safe.\n15\nTable of Contents\n•\nProvided high-quality clinical services at onsite and near-site medical clinics at several locations across the globe to support employee health and well-being.\n•\nLaunched a global mental health campaign to destigmatize and normalize conversations about mental health, promote mental well-being, encourage employees and their families to seek help when needed and promote company-provided resources. This campaign has been extended to include physical, emotional, financial and social pillars of well-being. \nDiversity and Inclusion\nAt Cummins, our commitment to inclusion dates back more than a half-century and continues to be core to our fabric and continued success. We leverage the strength of our broadly diverse, global workforce to drive innovation and business results and deliver superior solutions for our customers and communities. We do this through our commitment to fostering an accountable culture that champions our vision of a workforce mirroring the communities we serve. This commitment starts at the top with our Board and permeates throughout our organization as everyone plays a role in nurturing inclusive environments where all employees can reach their full potential and thrive.\nOur strong focus on cultivating an inclusive culture underscores our belief that a diverse and inclusive workforce is a core value and competitive advantage for Cummins. This focus dates back to the early 1970s as reflected in a public statement made by our former Chairman, J. Irwin Miller:\n\"Character, ability and intelligence are not concentrated in one sex over the other, nor in persons with certain accents or in certain races or in persons holding degrees from universities over others. When we indulge ourselves in such irrational prejudices, we damage ourselves most of all and ultimately assure ourselves of failure in competition with those more open and less biased.\"\nOur long-standing commitment to diversity and inclusion is consistent with our commitment to follow the law everywhere, including, without limitation, complying with U.S. and global laws and regulations related to civil rights and anti-discrimination.  We believe that we are in compliance with such laws and regulations in all material respects.  \nFor more information on the topics above and our management of our human capital resources, please go to sustainability.cummins.com. Information from our sustainability report and sustainability webpage is not incorporated by reference into this filing.\nAVAILABLE INFORMATION\nWe file annual, quarterly and current reports, proxy statements and other information electronically with the Securities and Exchange Commission (SEC). The SEC maintains an internet site that contains annual, quarterly and current reports, proxy and information statements and other information that Cummins files electronically with the SEC. The SEC's internet site is www.sec.gov.\nOur internet site is www.cummins.com. You can access our Investors and Media webpage through our internet site, by hovering on the heading \"Company\" and selecting \"Investor Relations\" link under the \"About Us\" section. We make available, free of charge, on or through our Investors and Media webpage, our proxy statements, annual reports on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K and any amendments to those reports filed or furnished pursuant to the Securities Exchange Act of 1934 or the Securities Act of 1933, each, as amended, as soon as reasonably practicable after such material is electronically filed with, or furnished to, the SEC.\nWe also have a Corporate Governance webpage. You can access our Governance Documents webpage through our internet site, www.cummins.com, by hovering on the heading \"Company\" and selecting \"Investor Relations\" link under the \"About Us\" section. Next, click on the heading \"Board & ESG\" and select \"Governance Documents\" from the drop-down menu. Code of Conduct, Committee Charters and other governance documents are included at this site. Our Code of Conduct applies to all employees, regardless of their position or the country in which they work. It also applies to the employees of any entity owned or controlled by us. We will post any amendments to the Code of Conduct and any waivers that are required to be disclosed by the rules of either the SEC or the NYSE, on our internet site. The information on our internet site is not incorporated by reference into this report.\n16\nTable of Contents\nINFORMATION ABOUT OUR EXECUTIVE OFFICERS \nFollowing are the names and ages of our executive officers, their positions with us at January 31, 2025, and summaries of their backgrounds and business experience:\nName and Age\n \nPresent Cummins Inc. position and\nyear appointed to position\n \nPrincipal position during the past five years\nother than Cummins Inc. position currently held\nJennifer Rumsey (51)\nChair and Chief Executive Officer (2023)\nPresident and Chief Executive Officer (2022-2023)\nPresident and Chief Operating Officer (2021-2022)\nVice President and President—Components (2019-2020)\nSharon R. Barner (67)\n \nVice President—Chief Administrative Officer (2021)\nVice President—Chief Administrative Officer and Corporate Secretary (2021-2023)\nVice President—General Counsel and Corporate Secretary (2020-2021)\nVice President—General Counsel (2012-2020)\nMarvin Boakye (51)\nVice President—Chief Human Resources Officer (2022)\nChief People and Diversity Officer—Papa John's International (2019-2022)\nJenny M. Bush (50)\nVice President and President—Power Systems (2022)\nVice President—Cummins Sales & Service North America (2017-2022)\nAmy R. Davis (55)\nVice President and President—Accelera and Components (2023)\nVice President and President—Accelera (2020-2023)\nVice President—Cummins Filtration (2018-2020)\nBonnie Fetch (54)\nVice President and President—Distribution Business (2024)\nVice President—Global Supply Chain and Manufacturing (2022-2023)\nVice President—DBU Supply Chain Services (2020-2022)\nExecutive Director, Supply Chain—DBU (2018-2020)\nNicole Y. Lamb-Hale (58)\n \nVice President—Chief Legal Officer and Corporate Secretary (2023)\nVice President—Chief Legal Officer (2022-2023)\nVice President—General Counsel (2021-2022)\nManaging Director and Washington, DC City Leader—Kroll (2020-2021)\nManaging Director—Kroll (2016-2020)\nBrett Merritt (48)\nVice President and President—Engine Business (2024)\nVice President—On-Highway Engine Business and Vice President of Strategic Customer Relations (2023)\nVice President—On-Highway Engine Business (2017-2023)\nSrikanth Padmanabhan (60)\nExecutive Vice President and President—Operations (2024)\nVice President and President—Engine Business (2016-2023)\nMark A. Smith (57)\nVice President—Chief Financial Officer (2019)\nNathan R. Stoner (47)\n \nVice President—China ABO (2020)\n \nGeneral Manager—Partnerships and EBU China Joint Venture Business (2018-2020)\nJeffrey T. Wiltrout (44)\nVice President—Corporate Strategy (2022)\nExecutive Director—Corporate Development (2021-2022)\nStrategy Director—Power Systems Business Unit (2018-2021)\nJonathan Wood (54)\nVice President—Chief Technical Offer (2023)\nVice President—New Power Engineering (2021-2023)\nVice President—Components Engineering (2018-2021)\nOur Chair and CEO is elected annually by the Board and holds office until the meeting of the Board at which her election is next considered. Other officers are appointed by the Chair and CEO, are ratified by the Board and hold office for such period as the Chair and CEO or the Board may prescribe.\n17\nTable of Contents",
  "item7": "ITEM 7.    Management's Discussion and Analysis of Financial Condition and Results of Operations\nORGANIZATION OF INFORMATION\nThe following Management's Discussion and Analysis of Financial Condition and Results of Operations (MD&A) was prepared to provide the reader with a view and perspective of our business through the eyes of management and should be read in conjunction with our \nConsolidated Financial Statements\n and the accompanying notes to those financial statements. Our MD&A is presented in the following sections:\n•\nEXECUTIVE SUMMARY AND FINANCIAL HIGHLIGHTS\n•\nRESULTS OF OPERATIONS\n•\nOPERATING SEGMENT RESULTS\n•\n2025 OUTLOOK\n•\nLIQUIDITY AND CAPITAL RESOURCES\n•\nAPPLICATION OF CRITICAL ACCOUNTING ESTIMATES \n•\nRECENTLY ADOPTED AND RECENTLY ISSUED ACCOUNTING PRONOUNCEMENTS\nThe following is the discussion and analysis of changes in the financial condition and results of operations for fiscal year 2024 compared to fiscal year 2023. The discussion and analysis of fiscal year 2022 and changes in the financial condition and results of operations for fiscal year 2023 compared to fiscal year 2022, that are not included in this Form 10-K, may be found in Part II, ITEM 7 of our \nAnnual Report on Form 10-K\n for the fiscal year ended December 31, 2023, filed with the Securities and Exchange Commission (SEC) on February 12, 2024.\nEXECUTIVE SUMMARY AND FINANCIAL HIGHLIGHTS\nOverview\nWe are a global power solutions leader comprised of five business segments - Engine, Components, Distribution, Power Systems and Accelera - supported by our global manufacturing and extensive service and support network, skilled workforce and vast technical expertise. Our products range from advanced diesel, natural gas, electric and hybrid powertrains and powertrain-related components including aftertreatment, turbochargers, fuel systems, valvetrain technologies, controls systems, air handling systems, automated transmissions, axles, drivelines, brakes, suspension systems, electric power generation systems, electrified power systems with innovative components and subsystems, including battery, fuel cell and electric power technologies and hydrogen production technologies. We sell our products to original equipment manufacturers (OEMs), distributors, dealers and other customers worldwide. We have long-standing relationships with many of the leading manufacturers in the markets we serve, including PACCAR Inc, Traton Group, Daimler Trucks North America and Stellantis N.V. We serve our customers through a service network of approximately 650 wholly-owned, joint venture and independent distributor locations and more than 19,000 Cummins certified dealer locations in approximately 190 countries and territories.\nOur segment reporting structure is organized according to the products and markets each segment serves. The Engine segment produces engines (15 liters and smaller) and associated parts for sale to customers in on-highway and various off-highway markets. Our engines are used in trucks of all sizes, buses and recreational vehicles, as well as in various industrial applications, including construction, agriculture, power generation systems and other off-highway applications. The Components segment sells axles, drivelines, brakes and suspension systems for commercial diesel and natural gas applications, aftertreatment systems, turbochargers, fuel systems, valvetrain technologies, automated transmissions and electronics. The Distribution segment includes wholly-owned and partially-owned distributorships engaged in wholesaling engines, generator sets and service parts, as well as performing service and repair activities on our products, maintaining relationships with various OEMs throughout the world and providing selected sales and aftermarket support for our Accelera business. The Power Systems segment is an integrated power provider, which designs, manufactures and sells standby and prime power generators, engines (16 liters and larger) for standby and prime power generator sets and industrial applications (including mining, oil and gas, marine, rail and defense), alternators and other power components. The Accelera segment designs, manufactures, sells and supports electrified power systems with innovative components and subsystems, including battery, fuel cell and electric powertrain technologies as well as hydrogen production technologies. The Accelera segment is currently in the early stages of commercializing these technologies with efforts primarily focused on the development of electrified power systems and related components and subsystems and our electrolyzers for hydrogen production. We continue to serve all our markets as they adopt electrification and alternative power technologies, meeting the needs of our OEM partners and end customers.\n32\nTable of Contents\nOur financial performance depends, in large part, on varying conditions in the markets we serve, particularly the on-highway, off-highway, power generation and general industrial markets. Demand in these markets tends to fluctuate in response to overall economic conditions. Our sales may also be impacted by OEM inventory levels, production schedules, stoppages and supply chain challenges. Economic downturns in markets we serve generally result in reduced sales of our products and can result in price reductions in certain products and/or markets. As a worldwide business, our operations are also affected by geopolitical risks, currency fluctuations, political and economic uncertainty, public health crises (epidemics or pandemics) and regulatory matters, including adoption and enforcement of environmental and emission standards, in the countries we serve. As part of our growth strategy, we invest in businesses in certain countries that carry higher levels of these risks such as China, Brazil, India, Mexico and other countries in Europe, the Middle East and Africa. At the same time, our geographic diversity and broad product and service offerings have helped limit the impact from a drop in demand in any one industry, region, the economy of any single country or customer on our consolidated results. \nAccelera Strategic Reorganization Actions\nIn the fourth quarter of 2024, our Accelera segment underwent a strategic review to better streamline operations as well as pace and re-focus investments on the most promising paths as the adoption of certain zero emission solutions slows. This review resulted in decisions to consolidate certain manufacturing efforts, focus internal development efforts towards areas of differentiation while continuing to leverage partners and reduce our investments in certain technologies, joint ventures and markets. In addition, declining customer demand in certain key product lines caused us to re-evaluate the recoverability of certain inventory items. As a result of these actions, we recorded several charges in the fourth quarter related to inventory write-downs, intangible and fixed asset impairments and joint venture impairments. Total charges for these strategic reorganization actions were $312 million. See NOTE 22, \"ACCELERA STRATEGIC REORGANIZATION ACTIONS,\" to our \nConsolidated Financial Statements\n for additional information.\nDivestiture of Atmus\nOn March 18, 2024, we completed the divestiture of our remaining 80.5 percent ownership of Atmus Filtration Technologies Inc. (Atmus) common stock through a tax-free split-off. The exchange resulted in a reduction of shares of our common stock outstanding by 5.6 million shares and a gain of approximately $1.3 billion. See NOTE 21, \"ATMUS INITIAL PUBLIC OFFERING (IPO) AND DIVESTITURE,\" to our \nConsolidated Financial Statements\n for additional information.\nSettlement Agreements\nIn December 2023, we announced that we reached an agreement in principle with the U.S. Environmental Protection Agency (EPA), the California Air Resources Board (CARB), the Environmental and Natural Resources Division of the U.S. Department of Justice (DOJ) and the California Attorney General’s Office to resolve certain regulatory civil claims regarding our emissions certification and compliance process for certain engines primarily used in pick-up truck applications in the U.S., which became final and effective in April 2024 (collectively, the Settlement Agreements). We recorded a charge of $2.0 billion in the fourth quarter of 2023 to resolve the matters addressed by the Settlement Agreements involving approximately one million of our pick-up truck applications in the U.S. In the second quarter of 2024, we made $1.9 billion of payments required by the Settlement Agreements. See NOTE 14, \"COMMITMENTS AND CONTINGENCIES,\" to our \nConsolidated Financial Statements\n for additional information. \n2024 Results\nA summary of our results is as follows:\nYears ended December 31,\nIn millions, except per share amounts\n2024\n(1)\n2023\n(2)\n2022\nNet sales\n$\n34,102\n$\n34,065\n$\n28,074\nNet income attributable to Cummins Inc.\n3,946\n735\n2,151\nEarnings per common share attributable to Cummins Inc.\nBasic\n$\n28.55\n$\n5.19\n$\n15.20\nDiluted\n28.37\n5.15\n15.12\n(1) \nNet income and earnings per common share included the $1.3 billion non-taxable gain associated with the divestiture of Atmus for the year ended December 31, 2024. See NOTE 21, \"ATMUS INITIAL PUBLIC OFFERING (IPO) AND DIVESTITURE,\" to our \nConsolidated Financial Statements\n for additional information.\n(2)\n Net income and earnings per common share included a $2.0 billion charge related to the Settlement Agreements for the year ended December 31, 2023. See NOTE 14, \"COMMITMENTS AND CONTINGENCIES,\" to our \nConsolidated Financial Statements\n for additional information. \n33\nTable of Contents\nNet income attributable to Cummins Inc. for 2024 was $3.9 billion, or $28.37 per diluted share, on sales of $34.1 billion, compared to 2023 net income attributable to Cummins Inc. of $0.7 billion, or $5.15 per diluted share, on sales of $34.1 billion. The increases in net income attributable to Cummins Inc. and earnings per diluted share were driven by the absence of the $2.0 billion charge related to the Settlement Agreements in 2023 and the $1.3 billion gain recognized on the divestiture of Atmus in 2024. Diluted earnings per common share for 2024 benefited $0.87 per share from fewer weighted-average shares outstanding due to treasury shares reacquired in the Atmus divestiture.\nThe table below presents our consolidated net sales by geographic area based on the location of the customer: \nFavorable/(Unfavorable)\n \nYears ended December 31,\n2024 vs. 2023\n2023 vs. 2022\nIn millions\n2024\n2023\n2022\nAmount\nPercent\nAmount\nPercent\nUnited States and Canada\n$\n20,820\n \n$\n20,650 \n$\n16,869 \n$\n170 \n1 \n%\n$\n3,781 \n22 \n%\nInternational\n13,282\n \n13,415 \n11,205 \n(133)\n(1)\n%\n2,210 \n20 \n%\nTotal net sales\n$\n34,102\n \n$\n34,065 \n$\n28,074 \n$\n37 \n— \n%\n$\n5,991 \n21 \n%\nWorldwide revenues were flat in 2024 compared to 2023, as increased global power generation demand (mostly data center markets) and higher demand in North American medium-duty truck and bus markets were offset by the divestiture of Atmus, lower emission solutions demand (mainly in China), lower demand in North American heavy-duty truck and pick-up truck markets and weaker demand in global construction markets. Net sales in the U.S. and Canada improved by 1 percent primarily due to higher demand in power generation markets and medium-duty truck and bus markets, partially offset by the divestiture of Atmus and lower demand in North American pick-up truck and heavy-duty truck markets. International sales (excludes the U.S. and Canada) declined by 1 percent, primarily due to lower sales in China and Europe which were mostly offset with higher sales in Latin America and India. The decrease in international sales was primarily due to the divestiture of Atmus and lower emission solutions demand (mainly in China), largely offset by increased demand in power generation markets (mainly Europe, China, Asia Pacific and India). Unfavorable foreign currency fluctuations impacted international sales by 1 percent (mainly the Brazilian real and Chinese renminbi). \nThe following table contains sales and EBITDA (defined as earnings or losses before interest expense, income taxes, depreciation and amortization and noncontrolling interests) by operating segment for the years ended December 31, 2024 and 2023. See NOTE 25, \"OPERATING SEGMENTS,\" to our \nConsolidated Financial Statements \nfor additional information and a reconciliation of our segment information to the corresponding amounts in our \nConsolidated Statements of Net Income\n.\nOperating Segments\n \n2024\n2023\nPercent change\n \n \nPercent\nof Total\n \n \nPercent\nof Total\n \n2024 vs. 2023\nIn millions\nSales\nEBITDA\nSales\nEBITDA\nSales\nEBITDA\nEngine\n$\n11,712\n \n28\n \n%\n$\n1,653\n \n$\n11,684 \n28 \n%\n$\n1,630 \n— \n%\n1 \n%\nComponents\n11,679\n \n28\n \n%\n1,591\n \n13,409 \n32 \n%\n1,840 \n(13)\n%\n(14)\n%\nDistribution\n11,384\n \n27\n \n%\n1,378\n \n10,249 \n25 \n%\n1,209 \n11 \n%\n14 \n%\nPower Systems\n6,408\n \n16\n \n%\n1,180\n \n5,673 \n14 \n%\n836 \n13 \n%\n41 \n%\nAccelera\n414\n \n1\n \n%\n(764)\n(1)\n354 \n1 \n%\n(443)\n17 \n%\n(72)\n%\nTotal segments\n41,597\n \n100\n \n%\n5,038\n \n41,369 \n100 \n%\n5,072 \n1 \n%\n(1)\n%\nIntersegment eliminations\n(7,495)\n1,288\n \n(2)\n(7,304)\n(2,055)\n(3)\n3 \n%\nNM\nTotal\n$\n34,102\n \n$\n6,326\n \n(2)\n$\n34,065 \n$\n3,017 \n(3)\n— \n%\nNM\n\"NM\" - not meaningful information\n(1)\n Accelera EBITDA included $312 million of strategic reorganization action charges in the fourth quarter of 2024. See NOTE 22, \"ACCELERA STRATEGIC REORGANIZATION ACTIONS,\" to our \nConsolidated Financial Statements\n for additional information.\n(2)\n Intersegment eliminations and total EBITDA included a $1.3 billion gain recognized on the divestiture of Atmus, and total EBITDA included $35 million of costs associated with the divestiture of Atmus. See NOTE 21, \"ATMUS INITIAL PUBLIC OFFERING (IPO) AND DIVESTITURE,\" to our \nConsolidated Financial Statements\n for additional information.\n(3)\n Intersegment eliminations and total EBITDA included a $2.0 billion charge related to the Settlement Agreements, and total EBITDA included $100 million of costs associated with the divestiture of Atmus. See NOTE 14, \"COMMITMENTS AND CONTINGENCIES,\" to our \nConsolidated Financial Statements\n for additional information. \n34\nTable of Contents\n2024 Highlights\nWe generated $1.5 billion of operating cash flows in 2024, compared to $4.0 billion in 2023. See the section titled \"\nCash Flows\n\" in the \"LIQUIDITY AND CAPITAL RESOURCES\" section for a discussion of items impacting cash flows.\nOur debt to capital ratio (total capital defined as debt plus equity) at December 31, 2024, was 38.4 percent, compared to 40.3 percent at December 31, 2023. The decrease was primarily due to the increased equity balance from stronger earnings since December 31, 2023, partially offset by higher debt balances at December 31, 2024. At December 31, 2024, we had $2.3 billion in cash and marketable securities on hand and access to our $4.0 billion credit facilities (net of $1.3 billion commercial paper outstanding), if necessary, to meet working capital, investment, acquisition and funding needs.\nIn November 2024, we settled a portion of our interest rate swaps related to our 2025 and 2030 bonds with a combined notional amount of $135 million. In the second and third quarters of 2024, we settled the remaining $500 million of interest rate swaps associated with the term loan, due in 2025, and repaid the outstanding balance of the term loan. See NOTE 12, “DEBT,” and NOTE 20, \"DERIVATIVES,\" to our \nConsolidated Financial Statements \nfor additional information.\nIn July 2024, the Board of Directors (Board) authorized an increase to our quarterly dividend of approximately 8 percent from $1.68 per share to $1.82 per share.\nOn June 3, 2024, we entered into an amended and restated 5-year credit agreement that allows us to borrow up to $2.0 billion of unsecured funds at any time prior to June 3, 2029. The credit agreement amended and restated the prior $2.0 billion 5-year credit agreement that would have matured on August 18, 2026. We also entered into an amended and restated 364-day credit agreement that allows us to borrow up to $2.0 billion of unsecured funds at any time prior to June 2, 2025. This credit agreement amended and restated the prior $2.0 billion 364-day credit facility that matured on June 3, 2024. See NOTE 12, “DEBT,” to our \nConsolidated Financial Statements \nfor additional information.\nIn May 2024, we entered into an accounts receivable sales agreement with Wells Fargo Bank, N.A., to sell certain accounts receivable up to $500 million. See NOTE 1, \"SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES,\" to our \nConsolidated Financial Statements \nfor additional information. \nIn the second quarter of 2024, we made $1.9 billion of required payments towards the Settlement Agreements. See NOTE 14, “COMMITMENTS AND CONTINGENCIES,” to our \nConsolidated Financial Statements \nfor additional information.\nOn February 20, 2024, we issued $2.25 billion aggregate principal amount of senior unsecured notes consisting of $500 million aggregate principal amount of 4.90 percent senior unsecured notes due in 2029, $750 million aggregate principal amount of 5.15 percent senior unsecured notes due in 2034 and $1.0 billion aggregate principal amount of 5.45 percent senior unsecured notes due in 2054. We received net proceeds of $2.2 billion. See NOTE 12, \"DEBT,\" to our \nConsolidated Financial Statements\n for additional information.\nIn 2024, the investment gain on our U.S. pension trusts was 5.5 percent, while our U.K. pension trusts' loss was 9.6 percent. Our global pension plans, including our unfunded and non-qualified plans, were 115 percent funded at December 31, 2024. Our U.S. defined benefit plans (qualified and non-qualified), which represented approximately 70 percent of the worldwide pension obligation, were 117 percent funded, and our U.K. defined benefit plans were 109 percent funded at December 31, 2024. We expect to contribute approximately $52 million in cash to our global pension plans in 2025. In addition, we expect our 2025 net periodic pension cost to approximate $76 million. See \"APPLICATION OF CRITICAL ACCOUNTING ESTIMATES\" and NOTE 10, \"PENSIONS AND OTHER POSTRETIREMENT BENEFITS,\" to our \nConsolidated Financial Statements\n for additional information concerning our pension and other postretirement benefit plans.\nAs of the date of this filing, our credit ratings and outlooks from the credit rating agencies remain unchanged.\n35\nTable of Contents\nRESULTS OF OPERATIONS\n \n \n \n \nFavorable/(Unfavorable)\n \nYears ended December 31,\n2024 vs. 2023\n2023 vs. 2022\nIn millions (except per share amounts)\n2024\n2023\n2022\nAmount\nPercent\nAmount\nPercent\nNET SALES\n$\n34,102\n \n$\n34,065 \n$\n28,074 \n$\n37 \n— \n%\n$\n5,991 \n21 \n%\nCost of sales\n25,663\n \n25,816 \n21,355 \n153 \n1 \n%\n(4,461)\n(21)\n%\nGROSS MARGIN\n8,439\n \n8,249 \n6,719 \n190 \n2 \n%\n1,530 \n23 \n%\nOPERATING EXPENSES AND INCOME\n \n \n \n \n \n \nSelling, general and administrative expenses\n3,275\n \n3,333 \n2,687 \n58 \n2 \n%\n(646)\n(24)\n%\nResearch, development and engineering expenses\n1,463\n \n1,500 \n1,278 \n37 \n2 \n%\n(222)\n(17)\n%\nEquity, royalty and interest income from investees\n395\n \n483 \n349 \n(88)\n(18)\n%\n134 \n38 \n%\nOther operating expense, net\n346\n \n2,138 \n174 \n1,792 \n84 \n%\n(1,964)\nNM\nOPERATING INCOME\n3,750\n \n1,761 \n2,929 \n1,989 \nNM\n(1,168)\n(40)\n%\nInterest expense\n370\n \n375 \n199 \n5 \n1 \n%\n(176)\n(88)\n%\nOther income, net\n1,523\n \n240 \n89 \n1,283 \nNM\n151 \nNM\nINCOME BEFORE INCOME TAXES\n4,903\n \n1,626 \n2,819 \n3,277 \nNM\n(1,193)\n(42)\n%\nIncome tax expense\n835\n \n786 \n636 \n(49)\n(6)\n%\n(150)\n(24)\n%\nCONSOLIDATED NET INCOME\n4,068\n \n840 \n2,183 \n3,228 \nNM\n(1,343)\n(62)\n%\nLess: Net income attributable to noncontrolling interests\n122\n \n105 \n32 \n(17)\n(16)\n%\n(73)\nNM\nNET INCOME ATTRIBUTABLE TO CUMMINS INC\n. \n$\n3,946\n \n$\n735 \n$\n2,151 \n$\n3,211 \nNM\n$\n(1,416)\n(66)\n%\nDiluted earnings per common share attributable to Cummins Inc.\n$\n28.37\n \n$\n5.15 \n$\n15.12 \n$\n23.22 \nNM\n$\n(9.97)\n(66)\n%\n\"NM\" - not meaningful information\n \n \n \n \n \nFavorable/(Unfavorable) Percentage Points\nPercent of sales\n2024\n2023\n2022\n2024 vs. 2023\n2023 vs. 2022\nGross margin\n24.7\n \n%\n24.2 \n%\n23.9 \n%\n0.5 \n0.3 \nSelling, general and administrative expenses\n9.6\n \n%\n9.8 \n%\n9.6 \n%\n0.2 \n(0.2)\nResearch, development and engineering expenses\n4.3\n \n%\n4.4 \n%\n4.6 \n%\n0.1 \n0.2 \n2024 vs. 2023\nNet Sales\nNet sales increased $37 million, primarily driven by the following:\n•\nDistribution segment sales increased 11 percent primarily due to higher demand in power generation markets, especially in North America and Europe. \n•\nPower Systems segment sales increased 13 percent primarily due to higher demand in power generation markets, especially in North America and China.\n•\nEngine segment sales were flat as stronger demand in North American medium-duty truck markets was offset by lower demand in North American pick-up truck and heavy-duty truck markets and weaker demand in global construction markets.\nThese increases were partially offset by decreased Components segment sales of 13 percent mainly due to the divestiture of Atmus on March 18, 2024.\nSales to international markets (excluding the U.S. and Canada), based on location of customers, were 39 percent of total net sales in 2024, compared with 39 percent of total net sales in 2023. A more detailed discussion of sales by segment is presented in the \"OPERATING SEGMENT RESULTS\" section.\n36\nTable of Contents\nCost of Sales\nThe types of expenses included in cost of sales are the following: parts and material consumption, including direct and indirect materials; compensation and related expenses, including variable compensation, salaries and fringe benefits; depreciation on production equipment and facilities and amortization of technology intangibles; estimated costs of warranty programs and campaigns; production utilities; production-related purchasing; warehousing, including receiving and inspection; freight costs; engineering support costs; repairs and maintenance; production and warehousing facility property insurance and rent for production facilities and other production overhead. Cost of sales in 2024 included $112 million of inventory write-downs and severance in our Accelera segment. See NOTE 22, \"ACCELERA STRATEGIC REORGANIZATION ACTIONS,\" to our \nConsolidated Financial Statements\n for additional information.\nGross Margin\nGross margin increased $190 million and increased 0.5 points as a percentage of sales. The increases were mainly due to favorable pricing and higher volumes, partially offset by the divestiture of Atmus, higher compensation expenses and increased product coverage. The provision for base warranties issued as a percentage of sales was 1.9 percent in 2024 and 1.8 percent in 2023. \nSelling, General and Administrative Expenses\nSelling, general and administrative expenses decreased $58 million and decreased 0.2 points as a percentage of sales. The decreases were primarily due to lower compensation expenses. Compensation and related expenses include salaries, fringe benefits and variable compensation.\nResearch, Development and Engineering Expenses\nResearch, development and engineering expenses decreased $37 million and decreased 0.1 points as a percentage of sales. The decreases were mainly due to lower spending on prototypes and decreased compensation expenses. Compensation and related expenses include salaries, fringe benefits and variable compensation. \nResearch activities continue to focus on development of new products and improvements of current technologies to meet future emission standards around the world, improvements in fuel economy performance of diesel and natural gas-powered engines and related components, as well as development activities around electrified power systems with innovative components and systems including battery and electric power technologies and hydrogen production technologies.\nEquity, Royalty and Interest Income From Investees\nEquity, royalty and interest income from investees decreased $88 million, primarily due to lower royalty and interest income from investees, start-up costs at Amplify Cell Technologies LLC, the absence of earnings from joint ventures associated with the divestiture of Atmus and $17 million of write-downs related to the Accelera segment, partially offset by higher earnings at Chongqing Cummins Engine Co., Ltd. See NOTE 3, \"INVESTMENTS IN EQUITY INVESTEES,\" and NOTE 22, \"ACCELERA STRATEGIC REORGANIZATION ACTIONS,\" to our \nConsolidated Financial Statements\n for additional information.\nOther Operating Expense, Net\nOther operating expense, net was as follows:\n \nYears ended December 31,\nIn millions\n2024\n2023\nAccelera strategic reorganization actions \n(1)\n$\n(171)\n$\n— \nAmortization of intangible assets\n(129)\n(133)\nLoss on write-off of assets\n(17)\n(9)\nFlood damage expenses\n(10)\n— \nRoyalty income, net\n8\n \n29 \nSettlement Agreements \n(2)\n—\n \n(2,036)\nOther, net\n(27)\n11 \nTotal other operating expense, net\n$\n(346)\n$\n(2,138)\n(1) \nSee NOTE 22, \"ACCELERA STRATEGIC REORGANIZATION ACTIONS,\" to our \nConsolidated Financial Statements\n for additional information.\n(2) \nSee NOTE 14, \"COMMITMENTS AND CONTINGENCIES,\" to our \nConsolidated Financial Statements\n for additional information.\n37\nTable of Contents\nInterest Expense \nInterest expense decreased $5 million, primarily due to lower average debt balances. \nOther Income, Net\nOther income, net was as follows:\n \nYears ended December 31,\nIn millions\n2024\n2023\nGain related to divestiture of Atmus \n(1)\n$\n1,333\n \n$\n— \nNon-service pension and OPEB income\n112\n \n125 \nInterest income\n87\n \n95 \nGain on sale of marketable securities, net\n8\n \n15 \nGain on corporate-owned life insurance\n6\n \n26 \nForeign currency loss, net\n(41)\n(30)\nOther, net\n18\n \n9 \nTotal other income, net\n$\n1,523\n \n$\n240 \n(1)\n See NOTE 21, \"ATMUS INITIAL PUBLIC OFFERING (IPO) AND DIVESTITURE,\" to our \nConsolidated Financial Statements\n for additional information.\nIncome Tax Expense\nOur effective tax rate for 2024 was 17.0 percent compared to 48.3 percent for 2023.\nThe year ended December 31, 2024, contained net favorable discrete tax items primarily due to the $1.3 billion non-taxable gain on the Atmus split-off. Other discrete tax items were net favorable by $59 million, primarily due to $52 million of favorable return to provision adjustments, $22 million of favorable share-based compensation tax benefits, $21 million of favorable adjustments related to audit settlements and $20 million of favorable adjustments from tax return amendments, partially offset by $50 million of unfavorable adjustments related to Accelera strategic reorganization actions and a net $6 million of other unfavorable adjustments. See NOTE 21, \"ATMUS INITIAL PUBLIC OFFERING (IPO) AND DIVESTITURE,\" and NOTE 22, \"ACCELERA STRATEGIC REORGANIZATION ACTIONS\" to our \nConsolidated Financial Statements\n for additional information.\nThe year ended December 31, 2023, contained unfavorable net discrete items of $397 million, primarily due to $398 million in the fourth quarter related to the $2.0 billion charge from the Settlement Agreements, $22 million of unfavorable adjustments for uncertain tax positions and $3 million of net unfavorable other discrete tax items, partially offset by $21 million of favorable return to provision adjustments and $5 million of favorable share-based compensation tax benefits.\nThe change in the effective tax rate for the year ended December 31, 2024, versus year ended December 31, 2023, was primarily due to the absence of the Settlement Agreements charge and the non-taxable gain on the Atmus split-off. \nOur effective tax rate for 2025 is expected to approximate 24.5 percent, excluding any discrete tax items that may arise.\nNet Income Attributable to Noncontrolling Interests\nNoncontrolling interests eliminate the income or loss attributable to non-Cummins ownership interests in our consolidated entities. Noncontrolling interests in income of consolidated subsidiaries increased $17 million principally due to higher earnings at Cummins India Limited and the absence of losses at Hydrogenics Corporation resulting from the June 2023 acquisition, partially offset by lower earnings at Eaton Cummins Joint Venture and the divestiture of Atmus.\n2023 vs. 2022\nFor all prior year segment results comparisons to 2022 see the \nResults of Operations section of our 2023 Form 10-K\n.\n38\nTable of Contents\nComprehensive Income - Foreign Currency Translation Adjustment\nThe foreign currency translation adjustment was a net loss of $276 million and net gain of $92 million for the years ended December 31, 2024 and 2023, respectively. The details were as follows: \nYears ended December 31,\n2024\n2023\nIn millions\nTranslation adjustment\nPrimary currency driver vs. U.S. dollar\nTranslation adjustment\nPrimary currency driver vs. U.S. dollar\nWholly-owned subsidiaries\n$\n(245)\nBrazilian real, Chinese renminbi, Euro and Indian rupee \n$\n118 \nBritish pound and Brazilian real, partially offset by Chinese renminbi\nEquity method investments\n(15)\nChinese renminbi and Brazilian real, partially offset by Indian rupee\n(23)\nChinese renminbi, partially offset by Brazilian real\nConsolidated subsidiaries with a noncontrolling interest\n(16)\nIndian rupee\n(3)\nChinese renminbi\nTotal\n$\n(276)\n$\n92 \nFor all prior year foreign currency translation adjustment results comparisons to 2022 see the \nResults of Operations section of our 2023 Form 10-K\n.\nOPERATING SEGMENT RESULTS\nOur reportable operating segments consist of the Engine, Components, Distribution, Power Systems and Accelera segments. This reporting structure is organized according to the products and markets each segment serves. We use segment EBITDA as the basis for the Chief Operating Decision Maker to evaluate the performance of each of our reportable operating segments. We believe EBITDA is a useful measure of our operating performance as it assists investors and debt holders in comparing our performance on a consistent basis without regard to financing methods, capital structure, income taxes or depreciation and amortization methods, which can vary significantly depending upon many factors. Segment amounts exclude certain expenses not specifically identifiable to segments. See NOTE 25, \"OPERATING SEGMENTS,\" to our \nConsolidated Financial Statements \nfor additional information and a reconciliation of our segment information to the corresponding amounts in our \nConsolidated Statements of Net Income\n.\n39\nTable of Contents\nFollowing is a discussion of results for each of our operating segments. For all prior year segment results comparisons to 2022 see the \nResults of Operations section of our 2023 Form 10-K\n.\nEngine Segment Results\nFinancial data for the Engine segment was as follows:\n \n \n \n \nFavorable/(Unfavorable)\n \nYears ended December 31,\n2024 vs. 2023\n2023 vs. 2022\nIn millions\n2024\n2023\n2022\nAmount\nPercent\nAmount\nPercent\nExternal sales\n$\n8,987\n$\n8,874\n$\n8,199\n$\n113 \n1 \n%\n$\n675 \n8 \n%\nIntersegment sales\n2,725\n2,810\n2,746\n(85)\n(3)\n%\n64 \n2 \n%\nTotal sales\n11,712\n11,684\n10,945\n28 \n— \n%\n739 \n7 \n%\nResearch, development and engineering expenses\n616\n614\n506\n(2)\n— \n%\n(108)\n(21)\n%\nEquity, royalty and interest income from investees\n212\n251\n160\n(1)\n(39)\n(16)\n%\n91 \n57 \n%\nInterest income\n17\n19\n14\n(2)\n(11)\n%\n5 \n36 \n%\nRussian suspension costs \n—\n—\n33\n(2)\n— \n— \n%\n33 \n100 \n%\nSegment EBITDA\n1,653\n1,630\n1,535\n23 \n1 \n%\n95 \n6 \n%\nPercentage Points\nPercentage Points\nSegment EBITDA as a percentage of total sales\n14.1\n \n%\n14.0 \n%\n14.0 \n%\n0.1 \n— \n(1) \nIncluded a $28 million impairment of our joint venture with KAMAZ and $3 million of royalty charges as part of our costs associated with the indefinite suspension of our Russian operations. See NOTE 24, \"RUSSIAN OPERATIONS,\" to our \nConsolidated Financial Statements\n for additional information.\n(2)\n Included $31 million of Russian suspension costs reflected in the equity, royalty and interest income from investees line above.\n \nSee NOTE 24, \"RUSSIAN OPERATIONS,\" to our \nConsolidated Financial Statements\n for additional information.\nSales for our Engine segment by market were as follows:\n \n \n \n \nFavorable/(Unfavorable)\n \nYears ended December 31,\n2024 vs. 2023\n2023 vs. 2022\nIn millions\n2024\n2023\n2022\nAmount\nPercent\nAmount\nPercent\nHeavy-duty truck\n$\n4,244\n$\n4,399\n$\n3,847\n$\n(155)\n(4)\n%\n$\n552 \n14 \n%\nMedium-duty truck and bus\n4,166\n3,670\n3,460\n496 \n14 \n%\n210 \n6 \n%\nLight-duty automotive\n1,595\n1,762\n1,738\n(167)\n(9)\n%\n24 \n1 \n%\nTotal on-highway\n10,005\n9,831\n9,045\n174 \n2 \n%\n786 \n9 \n%\nOff-highway\n1,707\n1,853\n1,900\n(146)\n(8)\n%\n(47)\n(2)\n%\nTotal sales\n$\n11,712\n$\n11,684\n$\n10,945\n$\n28 \n— \n%\n$\n739 \n7 \n%\nPercentage Points\nPercentage Points\nOn-highway sales as percentage of total sales\n85\n \n%\n84 \n%\n83 \n%\n1 \n1 \nUnit shipments by engine classification (including unit shipments to Power Systems and off-highway engine units included in their respective classification) were as follows:\n \n \n \n \nFavorable/(Unfavorable)\n \nYears ended December 31,\n2024 vs. 2023\n2023 vs. 2022\n \n2024\n2023\n2022\nAmount\nPercent\nAmount\nPercent\nHeavy-duty\n132,900\n \n141,900 \n120,700 \n(9,000)\n(6)\n%\n21,200 \n18 \n%\nMedium-duty\n310,300\n \n294,100 \n283,600 \n16,200 \n6 \n%\n10,500 \n4 \n%\nLight-duty\n189,400\n \n211,500 \n227,600 \n(22,100)\n(10)\n%\n(16,100)\n(7)\n%\nTotal unit shipments\n632,600\n \n647,500 \n631,900 \n(14,900)\n(2)\n%\n15,600 \n2 \n%\n40\nTable of Contents\n2024 vs. 2023 \nSales\nEngine segment sales increased $28 million. The primary driver by market was an increase in medium-duty truck and bus sales of $496 million mainly due to higher demand, especially in North America with medium-duty truck engine shipments up 16 percent, and favorable pricing.\nThe increase was partially offset by the following: \n•\nLight-duty automotive sales decreased $167 million primarily due to lower demand in North American pick-up truck markets with shipments down 15 percent, partially offset by favorable pricing. \n•\nHeavy-duty truck sales decreased $155 million principally due to weaker demand in North America with shipments down 8 percent.\n•\nOff-highway sales decreased $146 million primarily due to lower demand in global construction markets, especially in China and Western Europe.\nSegment EBITDA\nEngine segment EBITDA increased $23 million, primarily due to favorable pricing, partially offset by lower volumes, increased product coverage, higher compensation expenses, higher supply chain related costs and lower joint venture technology fees.\nComponents Segment Results\nOn March 18, 2024, we completed the divestiture of our remaining 80.5 percent ownership of Atmus common stock through a tax-free split-off. See NOTE 21, \"ATMUS INITIAL PUBLIC OFFERING (IPO) AND DIVESTITURE,\" to our \nConsolidated Financial Statements\n for additional information.\nFinancial data for the Components segment was as follows:\n \n \n \n \nFavorable/(Unfavorable)\n \nYears ended December 31,\n2024 vs. 2023\n2023 vs. 2022\nIn millions\n2024\n2023\n2022\nAmount\nPercent\nAmount\nPercent\nExternal sales\n$\n9,894\n$\n11,531\n$\n7,847\n$\n(1,637)\n(14)\n%\n$\n3,684 \n47 \n%\nIntersegment sales\n1,785\n1,878\n1,889\n(93)\n(5)\n%\n(11)\n(1)\n%\nTotal sales\n11,679\n13,409\n9,736\n(1,730)\n(13)\n%\n3,673 \n38 \n%\nResearch, development and engineering expenses\n328\n387\n309\n59 \n15 \n%\n(78)\n(25)\n%\nEquity, royalty and interest income from investees\n64\n97\n71\n(33)\n(34)\n%\n26 \n37 \n%\nInterest income\n25\n31\n12\n(6)\n(19)\n%\n19 \nNM\nRussian suspension costs \n(1)\n—\n—\n5\n— \n— \n%\n5 \n100 \n%\nSegment EBITDA\n1,591\n(2)\n1,840\n(2)\n1,346\n(3)\n(249)\n(14)\n%\n494 \n37 \n%\nPercentage Points\nPercentage Points\nSegment EBITDA as a percentage of total sales\n13.6\n \n%\n13.7 \n%\n13.8 \n%\n \n(0.1)\n(0.1)\n\"NM\" - not meaningful information\n(1)\n See NOTE 24, \"RUSSIAN OPERATIONS,\" to our \nConsolidated Financial Statements\n for additional information.\n(2) \nIncluded $21 million and $78 million of costs associated with the divestiture of Atmus for the years ended December 31, 2024 and 2023, respectively.\n(3) \nIncluded $83 million of costs related to the acquisition and integration of Meritor and $28 million of costs associated with the divestiture of Atmus.\nBeginning in the second quarter of 2024, we realigned certain businesses within our Components segment to be consistent with how our segment leader now monitors performance. We reorganized the businesses to combine the engine components and software and electronics businesses into the newly formed components and software business. In addition, we rebranded our axles and brakes business as drivetrain and braking systems. We began reporting results for these changes within our Components segment effective April 1, 2024, and reflected these changes in the historical periods presented. The change had no impact on our consolidated results.\n41\nTable of Contents\nSales for our Components segment by business were as follows:\n \n \n \n \nFavorable/(Unfavorable)\n \nYears ended December 31,\n2024 vs. 2023\n2023 vs. 2022\nIn millions\n2024\n2023\n2022\nAmount\nPercent\nAmount\nPercent\nDrivetrain and braking systems\n$\n4,733\n \n$\n4,822 \n$\n1,879 \n$\n(89)\n(2)\n%\n$\n2,943 \nNM\nEmission solutions\n3,601\n \n3,835 \n3,494 \n(234)\n(6)\n%\n341 \n10 \n%\nComponents and software\n2,404\n \n2,409 \n2,213 \n(5)\n— \n%\n196 \n9 \n%\nAutomated transmissions\n588\n \n714 \n593 \n(126)\n(18)\n%\n121 \n20 \n%\nAtmus\n353\n \n(1)\n1,629 \n1,557 \n(1,276)\n(78)\n%\n72 \n5 \n%\nTotal sales\n$\n11,679\n \n$\n13,409 \n$\n9,736 \n$\n(1,730)\n(13)\n%\n$\n3,673 \n38 \n%\n\"NM\" - not meaningful information\n(1) \nIncluded sales through the March 18, 2024, divestiture.\n2024 vs. 2023 \nSales\nComponents segment sales decreased $1.7 billion across all businesses. The following were the primary drivers by business:\n•\nSales decreased $1.3 billion due to the Atmus divestiture on March 18, 2024.\n•\nEmission solutions sales decreased $234 million principally due to lower demand in China. \nSegment EBITDA\nComponents segment EBITDA decreased $249 million, primarily due to the divestiture of Atmus.\nDistribution Segment Results\nFinancial data for the Distribution segment was as follows:\n \n \n \n \nFavorable/(Unfavorable)\n \nYears ended December 31,\n2024 vs. 2023\n2023 vs. 2022\nIn millions\n2024\n2023\n2022\nAmount\nPercent\nAmount\nPercent\nExternal sales\n$\n11,352\n$\n10,199\n$\n8,901\n$\n1,153 \n11 \n%\n$\n1,298 \n15 \n%\nIntersegment sales\n32\n50\n28\n(18)\n(36)\n%\n22 \n79 \n%\nTotal sales\n11,384\n10,249\n8,929\n1,135 \n11 \n%\n1,320 \n15 \n%\nResearch, development and engineering expenses\n55\n57\n52\n2 \n4 \n%\n(5)\n(10)\n%\nEquity, royalty and interest income from investees\n90\n97\n77\n(7)\n(7)\n%\n20 \n26 \n%\nInterest income\n37\n34\n16\n3 \n9 \n%\n18 \nNM\nRussian suspension costs \n(1)\n—\n—\n54\n— \n— \n%\n54 \n100 \n%\nSegment EBITDA\n1,378\n1,209\n888\n169 \n14 \n%\n321 \n36 \n%\nPercentage Points\nPercentage Points\nSegment EBITDA as a percentage of total sales\n12.1\n \n%\n11.8 \n%\n9.9 \n%\n0.3 \n1.9 \n\"NM\" - not meaningful information\n(1)\n See NOTE 24, \"RUSSIAN OPERATIONS,\" to our \nConsolidated Financial Statements\n for additional information.\n42\nTable of Contents\nSales for our Distribution segment by region, were as follows: \n \n \n \n \nFavorable/(Unfavorable)\n \nYears ended December 31,\n2024 vs. 2023\n2023 vs. 2022\nIn millions\n2024\n2023\n2022\nAmount\nPercent\nAmount\nPercent\nNorth America\n$\n7,625\n \n$\n7,081 \n$\n5,948 \n$\n544 \n8 \n%\n$\n1,133 \n19 \n%\nAsia Pacific\n1,245\n \n1,096 \n1,016 \n149 \n14 \n%\n80 \n8 \n%\nEurope\n1,184\n \n853 \n929 \n331 \n39 \n%\n(76)\n(8)\n%\nChina\n478\n \n430 \n355 \n48 \n11 \n%\n75 \n21 \n%\nIndia\n317\n \n270 \n220 \n47 \n17 \n%\n50 \n23 \n%\nAfrica and Middle East\n268\n \n294 \n251 \n(26)\n(9)\n%\n43 \n17 \n%\nLatin America\n267\n \n225 \n210 \n42 \n19 \n%\n15 \n7 \n%\nTotal sales\n$\n11,384\n \n$\n10,249 \n$\n8,929 \n$\n1,135 \n11 \n%\n$\n1,320 \n15 \n%\nSales for our Distribution segment by product line were as follows:\n \n \n \n \nFavorable/(Unfavorable)\n \nYears ended December 31,\n2024 vs. 2023\n2023 vs. 2022\nIn millions\n2024\n2023\n2022\nAmount\nPercent\nAmount\nPercent\nParts\n$\n3,980\n \n$\n4,071 \n$\n3,818 \n$\n(91)\n(2)\n%\n$\n253 \n7 \n%\nPower generation\n3,972\n \n2,509 \n1,774 \n1,463 \n58 \n%\n735 \n41 \n%\nService\n1,753\n \n1,672 \n1,561 \n81 \n5 \n%\n111 \n7 \n%\nEngines\n1,679\n \n1,997 \n1,776 \n(318)\n(16)\n%\n221 \n12 \n%\nTotal sales\n$\n11,384\n \n$\n10,249 \n$\n8,929 \n$\n1,135 \n11 \n%\n$\n1,320 \n15 \n%\n \n2024 vs. 2023\nSales \nDistribution segment sales increased $1.1 billion and increased across most regions. The following were the primary drivers by regions:\n•\nNorth American sales increased $544 million principally due to higher demand in power generation markets, especially data center and commercial markets, partially offset by lower demand for engines and aftermarket products. \n•\nEuropean sales increased $331 million mainly due to favorable demand in power generation markets.\n•\nAsia Pacific sales increased $149 million primarily due to strong demand in power generation markets, especially data center markets and service volume. \nSegment EBITDA\nDistribution segment EBITDA increased $169 million, primarily due to favorable pricing, partially offset by higher compensation expenses.\n43\nTable of Contents\nPower Systems Segment Results\nFinancial data for the Power Systems segment was as follows:\n \n \n \n \nFavorable/(Unfavorable)\n \nYears ended December 31,\n2024 vs. 2023\n2023 vs. 2022\nIn millions\n2024\n2023\n2022\nAmount\nPercent\nAmount\nPercent\nExternal sales\n$\n3,500\n$\n3,125\n$\n2,951\n$\n375 \n12 \n%\n$\n174 \n6 \n%\nIntersegment sales\n2,908\n2,548\n2,082\n360 \n14 \n%\n466 \n22 \n%\nTotal sales\n6,408\n5,673\n5,033\n735 \n13 \n%\n640 \n13 \n%\nResearch, development and engineering expenses\n236\n237\n240\n1 \n— \n%\n3 \n1 \n%\nEquity, royalty and interest income from investees\n79\n53\n43\n26 \n49 \n%\n10 \n23 \n%\nInterest income\n7\n9\n7\n(2)\n(22)\n%\n2 \n29 \n%\nRussian suspension costs \n(1)\n—\n—\n19\n— \n— \n%\n19 \n100 \n%\nSegment EBITDA\n1,180\n836\n596\n344 \n41 \n%\n240 \n40 \n%\nPercentage Points\nPercentage Points\nSegment EBITDA as a percentage of total sales\n18.4\n \n%\n14.7 \n%\n11.8 \n%\n3.7 \n2.9 \n(1) \nSee NOTE 24, \"RUSSIAN OPERATIONS,\" to our \nConsolidated Financial Statements\n for additional information.\nSales for our Power Systems segment by product line were as follows:\nFavorable/(Unfavorable)\n \nYears ended December 31,\n2024 vs. 2023\n2023 vs. 2022\nIn millions\n2024\n2023\n2022\nAmount\nPercent\nAmount\nPercent\nPower generation\n$\n3,985\n \n$\n3,340 \n$\n2,790 \n$\n645 \n19 \n%\n$\n550 \n20 \n%\nIndustrial\n1,932\n \n1,854 \n1,772 \n78 \n4 \n%\n82 \n5 \n%\nGenerator technologies\n491\n \n479 \n471 \n12 \n3 \n%\n8 \n2 \n%\nTotal sales\n$\n6,408\n \n$\n5,673 \n$\n5,033 \n$\n735 \n13 \n%\n$\n640 \n13 \n%\n2024 vs. 2023\nSales\nPower Systems segment sales increased $735 million, primarily due to improved global power generation sales of $645 million, especially in data center markets. \nSegment EBITDA\nPower Systems segment EBITDA increased $344 million, primarily due to favorable pricing and higher volumes, partially offset by higher compensation expenses and increased product coverage. \n44\nTable of Contents\nAccelera Segment Results\nIn the fourth quarter of 2024, our Accelera segment underwent a strategic review to better streamline operations as well as pace and re-focus investments on the most promising paths as the adoption of certain zero emission solutions slows. Total charges for these strategic reorganization actions were $312 million. See NOTE 22, \"ACCELERA STRATEGIC REORGANIZATION ACTIONS,\" to our \nConsolidated Financial Statements\n for additional information.\nFinancial data for the Accelera segment was as follows: \n \nFavorable/(Unfavorable)\nFavorable/(Unfavorable)\n \nYears ended December 31,\n2024 vs. 2023\n2023 vs. 2022\nIn millions\n2024\n2023\n2022\nAmount\nPercent\nAmount\nPercent\nExternal sales\n$\n369\n$\n336\n$\n176\n$\n33 \n10 \n%\n$\n160 \n91 \n%\nIntersegment sales\n45\n18\n22\n27 \nNM\n(4)\n(18)\n%\nTotal sales\n414\n354\n198\n60 \n17 \n%\n156 \n79 \n%\nResearch, development and engineering expenses\n226\n(1)\n203\n171\n(23)\n(11)\n%\n(32)\n(19)\n%\nEquity, royalty and interest loss from investees\n(50)\n(1)\n(15)\n(2)\n(35)\nNM\n(13)\nNM\nInterest income\n1\n2\n—\n(1)\n(50)\n%\n2 \nNM\nSegment EBITDA\n(764)\n(1)\n(443)\n(334)\n(321)\n(72)\n%\n(109)\n(33)\n%\n\"NM\" - not meaningful information\n(1)\n Included $2 million of charges in research, development and engineering expenses, $17 million of charges in equity, royalty and interest loss from investees and $312 million of charges in EBITDA, all related to strategic reorganization actions in the fourth quarter of 2024. See NOTE 22, \"ACCELERA STRATEGIC REORGANIZATION ACTIONS,\" to our \nConsolidated Financial Statements\n for additional information.\nAccelera segment sales increased $60 million mainly due to improved sales of electrolyzers, partially offset by lower electrified powertrain sales.\n45\nTable of Contents\n2025 OUTLOOK\nOur outlook reflects the following positive trends and challenges to our business that could impact our revenue and earnings potential in 2025.\n \nPositive Trends\n•\nWe expect demand within our Power Systems business to remain strong, including the power generation and mining markets. \n•\nWe expect North American pick-up truck demand to improve.\n•\nWe believe market demand for trucks in India will continue to be strong.\n•\nWe anticipate demand in our aftermarket business will continue to be robust, driven primarily by strong demand in our Engine and Power Systems businesses.\n•\nWe expect demand for trucks in China to remain stable in 2025.\nChallenges \n•\nWe expect demand for medium-duty and heavy-duty trucks in North America to remain relatively weak in the first half of 2025.\n•\nIncreases in costs, tariffs, as well as other inflationary pressures, could negatively impact earnings.\n•\nThe potential for trade disruption, including embargoes, sanctions and export controls could negatively impact earnings.\nLIQUIDITY AND CAPITAL RESOURCES\nKey Working Capital and Balance Sheet Data\nWe fund our working capital with cash from operations and short-term borrowings, including commercial paper, when necessary. Various assets and liabilities, including short-term debt, can fluctuate significantly from month-to-month depending on short-term liquidity needs. As a result, working capital is a prime focus of management's attention. Working capital and balance sheet measures are provided in the following table: \nDollars in millions\nDecember 31,\n2024\nDecember 31,\n2023\nWorking capital \n(1)\n$\n3,518\n \n$\n2,295 \nCurrent ratio\n1.31\n \n1.18 \nAccounts and notes receivable, net\n$\n5,181\n \n$\n5,583 \nDays' sales in receivables\n58\n \n58 \nInventories\n$\n5,742\n \n$\n5,677 \nInventory turnover\n4.4\n \n4.5 \nAccounts payable (principally trade)\n$\n3,951\n \n$\n4,260 \nDays' payable outstanding\n60\n \n62 \nTotal debt\n$\n7,059\n \n$\n6,696 \nTotal debt as a percent of total capital\n38.4\n \n%\n40.3 \n%\n(1) \nWorking capital includes cash and cash equivalents.\n46\nTable of Contents\nCash Flows\nCash and cash equivalents were impacted as follows:\n \nYears ended December 31,\nChange\nIn millions\n2024\n2023\n2022\n2024 vs. 2023\n2023 vs. 2022\nNet cash provided by operating activities\n$\n1,487\n \n$\n3,966 \n$\n1,962 \n$\n(2,479)\n$\n2,004 \nNet cash used in investing activities\n(1,782)\n(1,643)\n(4,172)\n(139)\n2,529 \nNet cash (used in) provided by financing activities \n(173)\n(2,177)\n1,669 \n2,004 \n(3,846)\nEffect of exchange rate changes on cash and cash equivalents\n(40)\n(68)\n50 \n28 \n(118)\nNet (decrease) increase in cash and cash equivalents\n$\n(508)\n$\n78 \n$\n(491)\n$\n(586)\n$\n569 \n2024 vs. 2023\nNet cash provided by operating activities decreased $2.5 billion, primarily due to higher working capital requirements of $4.6 billion, partially offset by higher net income of $3.2 billion. The higher working capital requirements resulted in a cash outflow of $2.2 billion compared to a cash inflow of $2.4 billion in the comparable period in 2023, mainly due to $1.9 billion of payments required by the Settlement Agreements which were accrued in 2023. Net income included a $1.3 billion non-cash gain on the divestiture of Atmus. See NOTE 14, \"COMMITMENTS AND CONTINGENCIES,\" and NOTE 21, \"ATMUS INITIAL PUBLIC OFFERING (IPO) AND DIVESTITURE,\" to our \nConsolidated Financial Statements\n for additional information. \nNet cash used in investing activities increased $139 million, primarily due to higher investments in equity investees of $228 million and cash associated with the Atmus divestiture of $174 million, partially offset by lower acquisition activity of $234 million.\nNet cash used in financing activities decreased $2.0 billion, primarily due to higher proceeds from borrowings of $1.9 billion (principally related to our 2024 note issuance) and lower net payments of commercial paper of $542 million, partially offset by higher payments on borrowings and finance lease obligations of $432 million. \nThe effect of exchange rate changes on cash and cash equivalents increased $28 million, primarily due to favorable fluctuations in the British pound, partially offset by the Brazilian real.\n2023 vs. 2022\nFor prior year liquidity comparisons see the \nLiquidity and Capital Resources section of our 2023 Form 10-K\n.\nSources of Liquidity\nWe generate significant ongoing operating cash flow. Cash provided by operations is our principal source of liquidity with $1.5 billion provided in 2024. In February, we issued $2.25 billion in long-term debt to pay down higher cost debt, finance the Settlement Agreements payments and improve our overall liquidity. Our sources of liquidity include the following: \nDecember 31, 2024\nIn millions\nTotal\nU.S.\nInternational\nPrimary location of international balances\nCash and cash equivalents\n$\n1,671\n \n$\n604\n \n$\n1,067\n \nSingapore, Australia, Mexico, China, United Kingdom, Belgium\nMarketable securities \n(1)\n593\n \n78\n \n515\n \nIndia\nTotal\n$\n2,264\n \n$\n682\n \n$\n1,582\n \nAvailable credit capacity\nRevolving credit facilities \n(2)\n$\n2,741\n \nInternational and other uncommitted domestic credit facilities\n$\n628\n \n(1)\n The majority of marketable securities could be liquidated into cash within a few days.\n(2)\n The 5-year credit facility for $2.0 billion and the 364-day credit facility for $2.0 billion, maturing June 2029 and June 2025, respectively, are maintained primarily to provide backup liquidity for our commercial paper borrowings and general corporate purposes. At December 31, 2024, we had $1.3 billion of commercial paper outstanding, which effectively reduced our available capacity under our revolving credit facilities to $2.7 billion.\n47\nTable of Contents\nCash, Cash Equivalents and Marketable Securities \nA significant portion of our cash flows are generated outside the U.S. We manage our worldwide cash requirements considering available funds among the many subsidiaries through which we conduct our business and the cost effectiveness with which those funds can be accessed. As a result, we do not anticipate any local liquidity restrictions to preclude us from funding our operating needs with local resources.\nIf we distribute our foreign cash balances to the U.S. or to other foreign subsidiaries, we could be required to accrue and pay withholding taxes, for example, if we repatriated cash from certain foreign subsidiaries whose earnings we asserted are completely or partially permanently reinvested. Foreign earnings for which we assert permanent reinvestment outside the U.S. consist primarily of earnings of our China, India, Canada (including underlying subsidiaries) and Netherlands domiciled subsidiaries. At present, we do not foresee a need to repatriate any earnings for which we assert permanent reinvestment. However, to help fund cash needs of the U.S. or other international subsidiaries as they arise, we repatriate available cash from certain foreign subsidiaries whose earnings are not completely permanently reinvested when cost effective to do so.\nDebt Facilities and Other Sources of Liquidity \nOn June 3, 2024, we entered into an amended and restated 5-year credit agreement that allows us to borrow up to $2.0 billion of unsecured funds at any time prior to June 3, 2029. The credit agreement amended and restated the prior $2.0 billion 5-year credit agreement that would have matured on August 18, 2026.  \nOn June 3, 2024, we entered into an amended and restated 364-day credit agreement that allows us to borrow up to $2.0 billion of unsecured funds at any time prior to June 2, 2025. This credit agreement amended and restated the prior $2.0 billion 364-day credit facility that matured on June 3, 2024.\nOn February 20, 2024, we issued $2.25 billion aggregate principal amount of senior unsecured notes consisting of $500 million aggregate principal amount of 4.90 percent senior unsecured notes due in 2029, $750 million aggregate principal amount of 5.15 percent senior unsecured notes due in 2034 and $1.0 billion aggregate principal amount of 5.45 percent senior unsecured notes due in 2054. We received net proceeds of $2.2 billion. See NOTE 12, \"DEBT,\" to our \nConsolidated Financial Statements\n for additional information.\nOur committed credit facilities provide access up to $4.0 billion from our $2.0 billion 364-day credit facility that expires on June 2, 2025, and our $2.0 billion 5-year facility that expires on June 3, 2029. These revolving credit facilities are maintained primarily to provide backup liquidity for our commercial paper borrowings and general corporate purposes. We intend to maintain credit facilities at the current or higher aggregate amounts by renewing or replacing these facilities at or before expiration. The credit agreements include various financial covenants, including, among others, maintaining a net debt to capital ratio of no more than 0.65 to 1.0. At\n \nDecember 31, 2024, our net leverage ratio was 0.27 to 1.0. There were no outstanding borrowings under these facilities at December 31, 2024.\nOur committed credit facilities also provide access up to\n \n$4.0 billion of unsecured, short-term promissory notes (commercial paper) pursuant to the Board authorized commercial paper programs. These programs facilitate the private placement of unsecured short-term debt through third-party brokers. We intend to use the net proceeds from the commercial paper borrowings for general corporate purposes. The total combined borrowing capacity under the revolving credit facilities and commercial paper programs should not exceed $4.0 billion. At December 31, 2024, we had $1.3 billion of commercial paper outstanding, which effectively reduced our available capacity under our revolving credit facilities to $2.7 billion. See NOTE 12, \"DEBT,\" to our \nConsolidated Financial Statements\n for additional information\n.\nAs a well-known seasoned issuer, we filed an automatic shelf registration for an undetermined amount of debt and equity securities with the Securities and Exchange Commission (SEC) on February 8, 2022, which expired on February 9, 2025. Under this shelf registration we were able to offer debt securities, common stock, preferred and preference stock, depositary shares, warrants, stock purchase contracts and stock purchase units. We plan to file a new shelf registration statement shortly after the filing of this annual report on Form 10-K to replace the expired automatic shelf registration statement. \nSupply Chain Financing\nWe currently have supply chain financing programs with financial intermediaries, which provide certain vendors the option to be paid by financial intermediaries earlier than the due date on the applicable invoice. When a vendor utilizes the program and receives an early payment from a financial intermediary, they take a discount on the invoice. We then pay the financial intermediary the face amount of the invoice on the original due date, which generally have 60 to 90 day payment terms. The maximum amount that we could have outstanding under these programs was $551 million at December 31, 2024. We do not reimburse vendors for any costs they incur for participation in the program, their participation is completely voluntary and there are no assets pledged as security or other forms of guarantees provided for the committed payment to the finance provider or intermediary. As a result, all amounts owed \n48\nTable of Contents\nto the financial intermediaries are presented as accounts payable in our \nConsolidated Balance Sheets\n. Amounts due to the financial intermediaries reflected in accounts payable at December 31, 2024, were $142 million. See NOTE 1, \"SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES,\" to our \nConsolidated Financial Statements \nfor additional information.\nAccounts Receivable Sales Program\nIn May 2024, we entered into an accounts receivable sales agreement with Wells Fargo Bank, N.A., to sell certain accounts receivable up to the Board approved limit of $500 million. There was no activity under the program during the year ended December 31, 2024. See NOTE 1, \"SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES,\" to our \nConsolidated Financial Statements\n for additional information. \nUses of Cash\nSettlement Agreements \nIn December 2023, we announced that we reached an agreement in principle with the EPA, CARB, DOJ and the California Attorney General’s Office to resolve certain regulatory civil claims regarding our emissions certification and compliance process for certain engines primarily used in pick-up truck applications in the U.S., which became final and effective in April 2024 (collectively, the Settlement Agreements). We made $1.9 billion of payments required by the Settlement Agreements in the second quarter of 2024. See NOTE 14, \"COMMITMENTS AND CONTINGENCIES,\" to our \nConsolidated Financial Statements\n for additional information. \nDividends\nTotal dividends paid to common shareholders in 2024, 2023 and 2022 were $969 million, $921 million and $855 million, respectively. Declaration and payment of dividends in the future depends upon our income and liquidity position, among other factors, and is subject to declaration by the Board, who meets quarterly to consider our dividend payment. We expect to fund dividend payments with cash from operations.\nIn July 2024, the Board authorized an increase to our quarterly dividend of approximately 8 percent from $1.68 per share to $1.82 per share. Cash dividends per share paid to common shareholders and the Board authorized increases for the last three years were as follows:\n \nQuarterly Dividends\n \n2024\n2023\n2022\nFirst quarter\n$\n1.68\n \n$\n1.57 \n$\n1.45 \nSecond quarter\n1.68\n \n1.57 \n1.45 \nThird quarter\n1.82\n \n1.68 \n1.57 \nFourth quarter\n1.82\n \n1.68 \n1.57 \nTotal\n$\n7.00\n \n$\n6.50 \n$\n6.04 \nCapital Expenditures\nCapital expenditures were $1.2 billion, $1.2 billion and $916 million in 2024, 2023 and 2022, respectively. We continue to invest in new product lines and targeted capacity expansions. We plan to spend an estimated $1.4 billion to $1.5 billion in 2025 on capital expenditures with over 65 percent of these expenditures expected to be invested in North America. \nCurrent Maturities of Short and Long-Term Debt \nWe had $1.3 billion of commercial paper outstanding at December 31, 2024, that matures in less than one year. The maturity schedule of our existing long-term debt includes $500 million of cash outflows in 2025 when our 0.75 percent senior notes are due. Required annual long-term debt principal payments range from $66 million to $660 million over the next five years. We intend to retain our strong investment credit ratings. See NOTE 12, \"DEBT,\" to our \nConsolidated Financial Statements \nfor additional information. \nPensions\nOur global pension plans, including our unfunded and non-qualified plans, were 115 percent funded at December 31, 2024. Our U.S. defined benefit plans (qualified and non-qualified), which represented approximately 70 percent of the worldwide pension obligation, were 117 percent funded, and our U.K. defined benefit plans were 109 percent funded at December 31, 2024. The funded status of our pension plans is dependent upon a variety of variables and assumptions including return on invested assets, market interest rates and levels of voluntary contributions to the plans. In 2024, the investment gain on our U.S. pension trusts was 5.5 percent, while our U.K. pension trusts' loss was 9.6 percent. \n49\nTable of Contents\nWe sponsor funded and unfunded domestic and foreign defined benefit pension plans. Contributions to the U.S. and U.K. plans were as follows:\n \n \nYears ended December 31,\nIn millions\n2024\n2023\n2022\nDefined benefit pension contributions\n$\n71\n \n$\n115 \n$\n53 \nDefined contribution pension plans\n126\n \n130 \n110 \nThese contributions may be made from trusts or company funds either to increase pension assets or to make direct benefit payments to plan participants. We anticipate making total contributions of approximately $52 million to our global defined benefit pension plans in 2025. Expected contributions to our defined benefit pension plans in 2025 will meet or exceed the current funding requirements.\nStock Repurchases\nIn December 2021, the Board authorized the acquisition of up to $2.0 billion of additional common stock upon completion of the $2.0 billion repurchase plan authorized in 2019. For the year ended December 31, 2024, we did not make any repurchases of common stock. The dollar value remaining available for future purchases under the 2019 program at December 31, 2024, was $218 million.\nWe intend to repurchase outstanding shares from time to time to enhance shareholder value.\nAmplify Cell Technologies LLC Joint Venture \nIn September 2023, our Accelera business signed an agreement to form a joint venture, Amplify Cell Technologies LLC, with Daimler Truck, PACCAR and EVE Energy to accelerate and localize battery cell production and the battery supply chain in the U.S., including building a 21-gigawatt hour battery production facility in Marshall County, Mississippi. The joint venture will manufacture battery cells for electric commercial vehicles and industrial applications. The joint venture received all government approvals and began operations in May 2024, but is not expected to begin production until 2027. As of December 31, 2024, we had contributed $211 million and our maximum remaining required contribution to the joint venture was $619 million, which could be reduced by future government incentives received by the joint venture. The majority of the contribution is expected to be made by the end of 2028. See NOTE 3, \"INVESTMENTS IN EQUITY INVESTEES,\" to our \nConsolidated Financial Statements\n for additional information. \nFuture Uses of Cash\nA summary of our contractual obligations and other commercial commitments at December 31, 2024, are as follows: \nContractual Cash Obligations\nPayments Due by Period\nIn millions\nCurrent\nLong-Term\nLong-term debt and finance lease obligations \n(1)\n$\n887 \n$\n8,492 \nOperating leases \n(1)\n150 \n472 \nCapital expenditures\n667 \n— \nPurchase commitments for inventory\n1,107 \n— \nOther purchase commitments\n622 \n372 \nTransitional tax liability\n103 \n— \nOther postretirement benefits\n16 \n101 \nInternational and other domestic letters of credit\n67 \n40 \nPerformance and excise bonds\n74 \n167 \nGuarantees and other commitments\n13 \n28 \nTotal\n$\n3,706 \n$\n9,672 \n(1) \nIncluded principal payments and expected interest payments based on the terms of the obligations.\n \nThe contractual obligations reported above exclude our unrecognized tax benefits of $304 million as of December 31, 2024, which includes $187 million of current tax liabilities and $117 million of long-term deferred tax liabilities. We are not able to reasonably estimate the period in which cash outflows relating to uncertain tax contingencies could occur. See NOTE 4, \"INCOME TAXES,\" to our \nConsolidated Financial Statements \nfor additional information.\n50\nTable of Contents\nCredit Ratings\nOur rating and outlook from each of the credit rating agencies as of the date of filing are shown in the table below: \nLong-Term\nShort-Term\nCredit Rating Agency \n(1)\n \nSenior Debt Rating\nDebt Rating\nOutlook\nStandard & Poor’s Rating Services\n \nA\nA1\nStable\nMoody’s Investors Service, Inc.\n \nA2\nP1\nStable\n(1) \nCredit ratings are not recommendations to buy, are subject to change, and each rating should be evaluated independently of any other rating. In addition, we undertake no obligation to update disclosures concerning our credit ratings, whether as a result of new information, future events or otherwise.\nManagement's Assessment of Liquidity\nOur financial condition and liquidity remain strong. Our solid balance sheet and credit ratings enable us to have ready access to credit and the capital markets. We assess our liquidity in terms of our ability to generate adequate cash to fund our operating, investing and financing activities. We believe our access to capital markets, our existing cash and marketable securities, operating cash flow and revolving credit facilities provide us with the financial flexibility needed to fund targeted capital expenditures, dividend payments, debt service obligations, projected pension obligations, common stock repurchases, joint venture contributions and acquisitions through 2025 and beyond. We continue to generate significant cash from operations and maintain access to our revolving credit facilities and commercial paper programs as noted above.\nAPPLICATION OF CRITICAL ACCOUNTING ESTIMATES\nA summary of our significant accounting policies is included in NOTE 1, \"SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES,\" of our \nConsolidated Financial Statements\n which discusses accounting policies that we selected from acceptable alternatives.\nOur \nConsolidated Financial Statements\n are prepared in accordance with generally accepted accounting principles in the U.S. which often requires management to make judgments, estimates and assumptions regarding uncertainties that affect the reported amounts presented and disclosed in the financial statements. Management reviews these estimates and assumptions based on historical experience, changes in business conditions and other relevant factors they believe to be reasonable under the circumstances. In any given reporting period, our actual results may differ from the estimates and assumptions used in preparing our \nConsolidated Financial Statements.\nCritical accounting estimates are defined as follows: the estimate requires management to make assumptions about matters that were highly uncertain at the time the estimate was made; different estimates reasonably could have been used; or if changes in the estimate are reasonably likely to occur from period to period and the change would have a material impact on our financial condition or results of operations. Our senior management has discussed the development and selection of our accounting policies, related accounting estimates and the disclosures set forth below with the Audit Committee of the Board. We believe our critical accounting estimates include estimating liabilities for warranty programs, fair value of intangible assets, assessing goodwill impairments, accounting for income taxes and pension benefits.\nWarranty Programs\nWe estimate and record a liability for base warranty programs at the time our products are sold. Our estimates are based on historical experience and reflect management's best estimates of costs to be incurred over the warranty period. Adjustments may be required to the liability when actual or projected costs differ. Variations in component failure rates, repair costs and the point of failure within the product life cycle are key drivers that impact our periodic re-assessment of the warranty liability. Future events and circumstances related to these factors could materially change our estimates and require adjustments to our liability. New product launches require a greater use of judgment in developing estimates until historical experience becomes available. We generally estimate warranty accruals for new products using a methodology that includes the preceding product's warranty history and a multiplicative factor derived from prior product launch experience and new product assessments until sufficient new product data is available for warranty estimation. We then use a blend of actual new product experience and preceding product historical experience for several subsequent quarters and new product specific experience thereafter. Product specific experience is typically available five or six quarters after product launch, with a clear experience trend evident eight quarters after launch. As a result of the uncertainty surrounding the nature and frequency of product recall programs, the liability for such programs is recorded when management commits to a recall action or when a recall becomes probable and estimable. NOTE 13, \"PRODUCT WARRANTY LIABILITY,\" to our \nConsolidated Financial Statements\n contains a summary of the activity in our warranty liability account for 2024, 2023 and 2022 including adjustments to pre-existing warranties.\n51\nTable of Contents\nFair Value of Intangible Assets\nWe make strategic acquisitions that may have a material impact on our consolidated results of operations or financial position. We allocate the purchase price of acquired businesses to the assets acquired and liabilities assumed in the transaction at their estimated fair values. The determination of the fair value of intangible assets, which represent a significant portion of the purchase price in many of our acquisitions can be complex and requires the use of significant judgment with regard to (i) the fair value and (ii) the period and the method by which the intangible asset will be amortized. We use information available to us to make fair value determinations and engage independent valuation specialists, when necessary, to assist in the fair value determination of significant acquired intangibles. We estimate the fair value of acquisition-related intangible assets principally based on projections of cash flows that will arise from identifiable intangible assets of acquired businesses, which includes estimates of discount rates, revenue growth rates, EBITDA, royalty rates, customer attrition rates, customer renewal rates and technology obsolesce rates. The projected cash flows are discounted to determine the present value of the assets at the dates of acquisition. Although we believe the projections, assumptions and estimates made were reasonable and appropriate, these estimates require significant judgment by management, are inherently uncertain and subject to refinement. During the measurement period, which may be up to one year from the acquisition date, we may record adjustments to the assets acquired and liabilities assumed, with the corresponding offset to goodwill. Any adjustments subsequent to the measurement period are recorded to our \nConsolidated Statements of Net Income\n. \nSee NOTE 23, \"ACQUISITIONS,\" to our \nConsolidated Financial Statements\n for additional information\n about our recent business combinations.\nGoodwill Impairment \nWe are required to make certain subjective and complex judgments in assessing whether a goodwill impairment event has occurred, including assumptions and estimates used to determine the fair value of our reporting units. We test for goodwill impairment at the reporting unit level and our reporting units are the operating segments or the components of operating segments that constitute businesses for which discrete financial information is available and is regularly reviewed by management. \nWe have the option to first assess qualitative factors to determine whether it is more likely than not that the fair value of a reporting unit is less than its carrying value as a basis for determining whether it is necessary to perform an annual quantitative goodwill impairment test. We have elected this option on certain reporting units. The following events and circumstances are considered when evaluating whether it is more likely than not that the fair value of a reporting unit is less than its carrying amount:\n•\nMacroeconomic conditions, such as a deterioration in general economic conditions, fluctuations in foreign exchange rates and/or other developments in equity and credit markets;\n•\nIndustry and market considerations, such as a deterioration in the environment in which an entity operates, material loss in market share and significant declines in product pricing;\n•\nCost factors, such as an increase in raw materials, labor or other costs;\n•\nOverall financial performance, such as negative or declining cash flows or a decline in actual or forecasted revenue;\n•\nOther relevant entity-specific events, such as material changes in management or key personnel and\n•\nEvents affecting a reporting unit, such as a change in the composition or carrying amount of its net assets including acquisitions and dispositions.\nThe examples noted above are not all-inclusive, and we consider other relevant events and circumstances that affect the fair value of a reporting unit in determining whether to perform the quantitative goodwill impairment test.\nOur goodwill recoverability assessment is based on our annual strategic planning process. This process includes an extensive review of expectations for the long-term growth of our businesses and forecasted future cash flows. In order to determine the valuation of our reporting units, we use either the income approach using a discounted cash flow model or the market approach. Our income approach method uses a discounted cash flow model in which cash flows anticipated over several periods, plus a terminal value at the end of that time horizon, are discounted to their present value using an appropriate rate of return. Our estimates are based upon our historical experience, our current knowledge from our commercial relationships and available external information about future trends. \nThe discounted cash flow model requires us to make projections of revenue, gross margin, operating expenses, working capital investment and fixed asset additions for the reporting units over a multi-year period. Additionally, management must estimate a weighted-average cost of capital, which reflects a market rate, for each reporting unit for use as a discount rate. The discounted cash flows are compared to the carrying value of the reporting unit and, if less than the carrying value, the difference is recorded as a goodwill impairment loss. In addition, we also perform sensitivity analyses to determine how much our forecasts can fluctuate before the fair value of a reporting unit would be lower than its carrying amount. Future changes in the judgments, assumptions and estimates that are used in our goodwill impairment testing, including discount rates or future operating results and related cash flow projections, could result in significantly different estimates of the fair values in the future. An increase in discount rates, a reduction in projected \n52\nTable of Contents\ncash flows or a combination of the two could lead to a reduction in the estimated fair values, which may result in impairment charges that could materially affect our financial statements in any given year. \nEffective October 31, 2024, we changed our annual goodwill impairment testing date for all reporting units from the last day of our fiscal third quarter to October 31 to better align with the timing of our annual long-term planning process. Accordingly, management determined that the change in accounting principle is preferable. This change was applied prospectively from October 31, 2024. We determined that it is impracticable to objectively ascertain projected cash flows and related valuation estimates that would have been used as of each October 31 of prior reporting periods without the use of hindsight. This change was not material to our \nConsolidated Financial Statements\n as it did not delay, accelerate or avoid any potential goodwill impairment charges. To ensure that no lapse greater than twelve months occurred, we performed an impairment test, for all reporting units, as of the end of our 2024 fiscal third quarter and noted no impairment. We completed our annual impairment testing as of October 31, 2024, and noted no impairment.\nAccounting for Income Taxes\nWe determine our income tax expense using the asset and liability method. Under this method, deferred tax assets and liabilities are recognized for the future tax effects of temporary differences between the financial statement carrying amounts of existing assets and liabilities and their respective tax basis. Future tax benefits of net operating loss and credit carryforwards are also recognized as deferred tax assets. We evaluate the recoverability of our deferred tax assets each quarter by assessing the likelihood of future profitability and available tax planning strategies that could be implemented to realize our net deferred tax assets. At December 31, 2024, we recorded a net deferred tax asset of $730 million. The net deferred tax assets included $907 million for the value of net operating loss and credit carryforwards. A valuation allowance of $872 million was recorded to reduce the tax assets to the net value management believed was more likely than not to be realized. In the event our operating performance deteriorates, future assessments could conclude that a larger valuation allowance will be needed to further reduce the deferred tax assets.\nIn addition, we operate within multiple taxing jurisdictions and are subject to tax audits in these jurisdictions. These audits can involve complex issues, which may require an extended period of time to resolve. We accrue for the estimated additional tax and interest that may result from tax authorities disputing uncertain tax positions. We believe we made adequate provisions for income taxes for all years that are subject to audit based upon the latest information available. A more complete description of our income taxes and the future benefits of our net operating loss and credit carryforwards is disclosed in NOTE 4, \"INCOME TAXES,\" to our \nConsolidated Financial Statements\n.\nPension Benefits \nWe sponsor a number of pension plans globally, with the majority of assets in the U.S. and the U.K. In the U.S. and the U.K., we have major defined benefit plans that are separately funded. We account for our pension programs in accordance with employers' accounting for defined benefit pension plans, which requires that amounts recognized in financial statements be determined using an actuarial basis. As a result, our pension benefit programs are based on a number of statistical and judgmental assumptions that attempt to anticipate future events and are used in calculating the expense and liability related to our plans each year at December 31. These assumptions include discount rates used to value liabilities, assumed rates of return on plan assets, future compensation increases, inflation, employee turnover rates, actuarial assumptions relating to retirement age, mortality rates and participant withdrawals. The actuarial assumptions we use may differ significantly from actual results due to changing economic conditions, participant life span and withdrawal rates. These differences may result in a material impact to the amount of net periodic pension cost to be recorded in our \nConsolidated Financial Statements\n in the future.\nThe expected long-term return on plan assets is used in calculating the net periodic pension cost. We considered several factors in developing our expected rate of return on plan assets. The long-term rate of return considers historical returns and expected returns on current and projected asset allocations. Projected returns are based primarily on broad, publicly traded passive fixed income and equity indices and forward-looking estimates of the value added by active investment management. At December 31, 2024, based upon our target asset allocations, it is anticipated that our U.S. investment policy will generate an average annual return over the 30-year projection period equal to or in excess of 7 percent, including the additional positive returns expected from active investment management. \nThe one-year return for our U.S. plans was a 5.5 percent gain for 2024. Our U.S. plan assets averaged annualized returns of 5.74 percent over the prior ten years and resulted in approximately $473 million of actuarial losses in accumulated other comprehensive loss (AOCL) in the same period. Based on the historical returns and forward-looking return expectations for capital markets, we believe our investment return assumption of 7.00 percent in 2025 for U.S. pension assets is reasonable and attainable.\nThe methodology used to determine the rate of return on pension plan assets in the U.K. was based on establishing an equity-risk premium over current long-term bond yields adjusted based on target asset allocations. At December 31, 2024, based upon our target asset allocations, it is anticipated that our U.K. investment policy will generate an average annual return over the 20-year projection period equal to or in excess of 5 percent. The one-year return for our U.K. plans was a 9.6 percent loss for 2024. We generated average annualized losses of 1.31 percent over ten years, resulting in approximately $942 million of actuarial losses in AOCL. Our strategy \n53\nTable of Contents\nwith respect to our investments in pension plan assets is to be invested with a long-term outlook. Based on the historical returns and forward-looking return expectations, we believe that an investment return assumption of 5.00 percent in 2025 for U.K. pension assets is reasonable and attainable. \nOur target allocation for 2025 and pension plan asset allocations, at December 31, 2024 and 2023 are as follows: \n \nU.S. Plan\nU.K. Plan\n \nTarget Allocation\nPercentage of Plan Assets at December 31,\nTarget Allocation\nPercentage of Plan Assets at December 31,\nInvestment description\n2025\n2024\n2023\n2025\n2024\n2023\nLiability matching\n71.0\n \n%\n69.5\n \n%\n71.0 \n%\n80.0\n \n%\n79.4\n \n%\n80.8 \n%\nRisk seeking\n29.0\n \n%\n30.5\n \n%\n29.0 \n%\n20.0\n \n%\n20.6\n \n%\n19.2 \n%\nTotal\n100.0\n \n%\n100.0\n \n%\n100.0 \n%\n100.0\n \n%\n100.0\n \n%\n100.0 \n%\nThe differences between the actual return on plan assets and expected long-term return on plan assets are recognized in the asset value\nused to calculate net periodic cost over five years. The table below sets forth our expected rate of return for 2025 and the expected\nreturn assumptions used to develop our pension cost for the period 2022-2024.\n \nLong-term Expected Return Assumptions\n \n2025\n2024\n2023\n2022\nU.S. plans\n7.00\n \n%\n7.25\n \n%\n7.00 \n%\n6.50 \n%\nU.K. plans\n5.00\n \n%\n5.00\n \n%\n5.00 \n%\n4.01 \n%\nPension accounting offers various acceptable alternatives to account for the differences that eventually arise between the estimates used in the actuarial valuations and the actual results. It is acceptable to delay or immediately recognize these differences. Under the delayed recognition alternative, changes in pension obligations (including those resulting from plan amendments) and changes in the value of assets set aside to meet those obligations are not recognized in net periodic pension cost as they occur but are recognized initially in AOCL and subsequently amortized as components of net periodic pension cost systematically and gradually over future periods. In addition to this approach, we may also adopt immediate recognition of actuarial gains or losses. Immediate recognition introduces volatility in financial results. We have chosen to delay recognition and amortize actuarial differences over future periods. If we adopted the immediate recognition approach, we would record a loss of $1.1 billion ($0.9 billion after-tax) from cumulative actuarial net losses for our U.S. and U.K. pension plans.\nThe difference between the expected return and the actual return on plan assets is deferred from recognition in our results of operations and under certain circumstances, such as when the difference exceeds 10 percent of the greater of the market value of plan assets or the projected benefit obligation, the difference is amortized over future years of service. This is also true of changes to actuarial assumptions. Under the delayed recognition alternative, the actuarial gains and losses are recognized and recorded in AOCL. As our losses related to the U.S. and U.K. pension plans exceed 10 percent of their respective plan assets, the excess is amortized over the average remaining service lives of participating employees. Net actuarial losses decreased our shareholders' equity by $34 million\n \nafter-tax in 2024. The loss is primarily due to unfavorable asset returns, partially offset by a favorable change in discount rates.\nThe table below sets forth the net periodic pension cost for the years ended December 31 and our expected cost for 2025.\nIn millions\n2025\n2024\n2023\n2022\nNet periodic pension cost\n$\n76\n \n$\n34\n \n$\n1 \n$\n19 \nWe expect 2025 net periodic pension cost to increase compared to 2024, primarily due to unfavorable asset returns in the U.K. and a lower expected rate of return in the U.S., partially offset by higher discount rates in the U.S. and U.K. The increase in net periodic pension cost in 2024 compared to 2023 was primarily due to unfavorable asset returns in the U.K., lower discount rates in the U.S. and U.K. and increased headcount from recent acquisitions, partially offset by a higher expected rate of return on assets in the U.S. The decrease in net periodic pension cost in 2023 compared to 2022 was due primarily due to the full year benefit of the Meritor pension plans added during the acquisition and a higher estimated return on assets in the U.S. and U.K.\n54\nTable of Contents\nThe weighted-average discount rates used to develop our net periodic pension cost are set forth in the table below.\n \nDiscount Rates\n \n2025\n2024\n2023\n2022\nU.S. plans\n5.69\n \n%\n5.15\n \n%\n5.55 \n%\n3.31 \n%\nU.K. plans\n5.62\n \n%\n4.72\n \n%\n4.99 \n%\n2.26 \n%\nThe discount rate enables us to state expected future cash payments for benefits as a present value on the measurement date. The guidelines for setting this rate suggest the use of a high-quality corporate bond rate. We used bond information provided by Moody's Investor Services, Inc. and Standard & Poor's Rating Services. All bonds used to develop our hypothetical portfolio in the U.S. and U.K. were deemed high-quality, non-callable bonds (Aa or better) at December 31, 2024, by at least one of the bond rating agencies.\nOur model called for projected payments until near extinction for the U.S. and the U.K. For both countries, our model matches the present value of the plan's projected benefit payments to the market value of the theoretical settlement bond portfolio. A single equivalent discount rate is determined to align the present value of the required cash flow with the value of the bond portfolio. The resulting discount rate is reflective of both the current interest rate environment and the plan's distinct liability characteristics.\nThe table below sets forth the estimated impact on our 2025 net periodic pension cost relative to a change in the discount rate and a change in the expected rate of return on plan assets.\nIn millions\nImpact on Pension Cost Increase/(Decrease)\nDiscount rate used to value liabilities\n0.25 percent increase\n$\n(6)\n0.25 percent decrease\n6 \nExpected rate of return on assets\n1 percent increase\n(56)\n1 percent decrease\n56 \nThe above sensitivities reflect the impact of changing one assumption at a time. A higher discount rate decreases the plan obligations and decreases our net periodic pension cost. A lower discount rate increases the plan obligations and increases our net periodic pension cost. It should be noted that economic factors and conditions often affect multiple assumptions simultaneously and the effects of changes in key assumptions are not necessarily linear. NOTE 10, \"PENSIONS AND OTHER POSTRETIREMENT BENEFITS,\" to our \nConsolidated Financial Statements\n provides a summary of our pension benefit plan activity, the funded status of our plans and the amounts recognized in our \nConsolidated Financial Statements\n.\nRECENTLY ADOPTED AND RECENTLY ISSUED ACCOUNTING PRONOUNCEMENTS\nSee NOTE 1, \"SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES,\" to our \nConsolidated Financial Statements \nfor additional information.",
  "item2": null
}