{
  "source_file": "cmi-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "ITEM 2.  Management’s Discussion and Analysis of Financial Condition and Results of Operations \nCummins Inc. and its consolidated subsidiaries are hereinafter sometimes referred to as “Cummins,” “we,” “our” or “us.”\nCAUTIONARY STATEMENTS REGARDING FORWARD-LOOKING INFORMATION  \nCertain parts of this quarterly report contain forward-looking statements intended to qualify for the safe harbors from liability established by the Private Securities Litigation Reform Act of 1995. Forward-looking statements include those that are based on current expectations, estimates and projections about the industries in which we operate and management’s beliefs and assumptions. Forward-looking statements are generally accompanied by words such as \"anticipates,\" \"expects,\" \"forecasts,\" \"intends,\" \"plans,\" \"believes,\" \"seeks,\" \"estimates,\" \"could,\" \"should,\" \"may\" or words of similar meaning. These statements are not guarantees of future performance and involve certain risks, uncertainties and assumptions, which we refer to as \"future factors,\" which are difficult to predict. Therefore, actual outcomes and results may differ materially from what is expressed or forecasted in such forward-looking statements. Some future factors that could cause our results to differ materially from the results discussed in such forward-looking statements are discussed below and shareholders, potential investors and other readers are urged to consider these future factors carefully in evaluating forward-looking statements. Readers are cautioned not to place undue reliance on forward-looking statements, which speak only as of the date hereof. Future factors that could affect the outcome of forward-looking statements include the following: \nGOVERNMENT REGULATION\n•\nany adverse consequences from changes in tariffs and other trade disruptions;\n•\nany adverse consequences resulting from entering into agreements with the U.S. Environmental Protection Agency (EPA), California Air Resources Board, the Environmental and Natural Resources Division of the U.S. Department of Justice and the California Attorney General's Office to resolve certain regulatory civil claims regarding our emissions certification and compliance process for certain engines primarily used in pick-up truck applications in the U.S., which became final and effective in April 2024, (collectively, the Settlement Agreements), including required additional mitigation projects, adverse reputational impacts and potential resulting legal actions;\n•\nincreased scrutiny from regulatory agencies, as well as unpredictability in the adoption, implementation and enforcement of emission standards around the world;\n•\nevolving environmental and climate change legislation and regulatory initiatives;\n•\nchanges in international, national and regional trade laws, regulations and policies;\n•\nchanges in taxation;\n•\nglobal legal and ethical compliance costs and risks;\n•\nfuture bans or limitations on the use of diesel-powered products;\nBUSINESS CONDITIONS / DISRUPTIONS\n•\nraw material, transportation and labor price fluctuations and supply shortages; \n•\naligning our capacity and production with our demand;\n•\nthe actions of, and income from, joint ventures and other investees that we do not directly control; \n•\nlarge truck manufacturers' and original equipment manufacturers' customers discontinuing outsourcing their engine supply needs or experiencing financial distress, or change in control;\nPRODUCTS AND TECHNOLOGY\n•\nproduct recalls;\n•\nvariability in material and commodity costs;\n•\nthe development of new technologies that reduce demand for our current products and services;\n•\nlower than expected acceptance of new or existing products or services;\n•\nproduct liability claims;\n•\nour sales mix of products;\n32\nTable of Conten\nt\ns\nGENERAL \n•\nclimate change, global warming, more stringent climate change regulations, accords, mitigation efforts, greenhouse gas regulations or other legislation designed to address climate change;\n•\nour plan to reposition our portfolio of product offerings through exploration of strategic acquisitions, divestitures or exiting the production of certain product lines or product categories and related uncertainties of such decisions;\n•\nincreasing interest rates;\n•\nchallenging markets for talent and ability to attract, develop and retain key personnel;\n•\nexposure to potential security breaches or other disruptions to our information technology (IT) environment and data security;\n•\nthe use of artificial intelligence in our business and in our products and challenges with properly managing its use;\n•\npolitical, economic and other risks from operations in numerous countries including political, economic and social uncertainty and the evolving globalization of our business;\n•\ncompetitor activity;\n•\nincreasing competition, including increased global competition among our customers in emerging markets;\n•\nfailure to meet sustainability expectations or standards, or achieve our sustainability goals;\n•\nlabor relations or work stoppages;\n•\nforeign currency exchange rate changes;\n•\nthe performance of our pension plan assets and volatility of discount rates;\n•\nthe price and availability of energy;\n•\ncontinued availability of financing, financial instruments and financial resources in the amounts, at the times and on the terms required to support our future business; and\n•\nother risk factors described in Part II, Item 1A in this quarterly report and our \n2024 Form 10-K, Part I, Item 1A\n, under the caption \"Risk Factors.\" \nShareholders, potential investors and other readers are urged to consider these factors carefully in evaluating the forward-looking statements and are cautioned not to place undue reliance on such forward-looking statements. The forward-looking statements made herein are made only as of the date of this quarterly report and we undertake no obligation to publicly update any forward-looking statements, whether as a result of new information, future events or otherwise.\n33\nTable of Conten\nt\ns\nORGANIZATION OF INFORMATION\n \nThe following Management’s Discussion and Analysis of Financial Condition and Results of Operations (MD&A) was prepared to provide the reader with a view and perspective of our business through the eyes of management and should be read in conjunction with our \nManagement's Discussion and Analysis of Financial Condition and Results of Operations section of our 2024 Form 10-K\n. Our MD&A is presented in the following sections:\n•\nEXECUTIVE SUMMARY AND FINANCIAL HIGHLIGHTS\n•\nRESULTS OF OPERATIONS\n•\nREPORTABLE SEGMENT RESULTS\n•\nOUTLOOK\n•\nLIQUIDITY AND CAPITAL RESOURCES\n•\nAPPLICATION OF CRITICAL ACCOUNTING ESTIMATES\n•\nRECENTLY ISSUED ACCOUNTING PRONOUNCEMENTS\nEXECUTIVE SUMMARY AND FINANCIAL HIGHLIGHTS \nOverview \nWe are a global power leader committed to powering a more prosperous world. Since 1919, we have delivered innovative solutions that move people, goods and economies forward. Our five reportable operating segments - Engine, Components, Distribution, Power Systems and Accelera offer a broad portfolio, including advanced diesel, alternative fuel, electric and hybrid powertrains; integrated power generation systems; critical components such as aftertreatment, turbochargers, fuel systems, controls, transmissions, axles and brakes; and zero emissions technologies like battery and electric powertrain systems and electrolyzers. With a global footprint, deep technical expertise and an extensive service network, we deliver dependable, cutting-edge solutions tailored to our customers' needs, supporting them through the energy transition with our Destination Zero strategy. We sell our products to original equipment manufacturers (OEMs), distributors, dealers and other customers worldwide. We have long-standing relationships with many of the leading manufacturers in the markets we serve, including PACCAR Inc., Traton Group, Daimler Trucks AG and Stellantis N.V. We serve our customers through a service network of approximately 650 wholly-owned, joint venture and independent distributor locations and more than 19,000 Cummins certified dealer locations in approximately 190 countries and territories.\nOur segment reporting structure is organized according to the products and markets each segment serves. The Engine segment produces engines (15 liters and smaller) and associated parts for sale to customers in on-highway and various off-highway markets. Our engines are used in trucks of all sizes, buses and recreational vehicles, as well as in various industrial applications, including construction, agriculture, power generation systems and other off-highway applications. The Components segment sells axles, drivelines, brakes and suspension systems for commercial diesel and natural gas applications, aftertreatment systems, turbochargers, fuel systems, valvetrain technologies, automated transmissions and electronics. The Distribution segment includes wholly-owned and partially-owned distributorships engaged in wholesaling engines, generator sets and service parts, as well as performing service and repair activities on our products, maintaining relationships with various OEMs throughout the world and providing selected sales and aftermarket support for our Accelera business. The Power Systems segment is an integrated power provider, which designs, manufactures and sells standby and prime power generators, engines (16 liters and larger) for standby and prime power generator sets and industrial applications (including mining, oil and gas, marine, rail and defense), alternators and other power components. The Accelera segment designs, manufactures, sells and supports electrified power systems with innovative components and subsystems, including battery, fuel cell and electric powertrain technologies as well as hydrogen production technologies. The Accelera segment is currently in the early stages of commercializing these technologies with efforts primarily focused on the development of electrified power systems and related components and subsystems and our electrolyzers for hydrogen production. We continue to serve all our markets as they adopt electrification and alternative power technologies, meeting the needs of our OEM partners and end customers.\nOur financial performance depends, in large part, on varying conditions in the markets we serve, particularly the on-highway, off-highway, power generation and general industrial markets. Demand in these markets tends to fluctuate in response to overall economic conditions. Our sales may also be impacted by OEM inventory levels, production schedules, stoppages and supply chain challenges. Economic downturns in markets we serve generally result in reduced sales of our products and can result in price reductions in certain products and/or markets. As a worldwide business, our operations are also affected by geopolitical risks, currency fluctuations, political and economic uncertainty, tariffs and related trade disruptions, public health crises (epidemics or pandemics) and regulatory matters, including adoption and enforcement of environmental and emission standards. As part of our growth strategy, we invest in businesses in certain countries that carry higher levels of these risks such as China, Brazil, India, Mexico and other countries in \n34\nTable of Conten\nt\ns\nEurope, the Middle East and Africa. At the same time, our geographic diversity and broad product and service offerings have helped limit the impact from a drop in demand in any one industry, region, the economy of any single country or customer on our consolidated results.\nUncertain Global Trade Environment \nAs disclosed in \nPart I, \"Item 1A. Risk Factors\" in our Annual Report on Form 10-K for the year ended December 31, 2024\n, we operate our business on a global basis and changes in international, national and regional trade laws, regulations and policies affecting and/or restricting international trade, including higher tariffs, trade disruptions (such as embargoes, sanctions and export controls) and broader geopolitical tensions, could adversely impact the demand for our products and our competitive position. The uncertain global trade environment, marked by the U.S. imposition of tariffs on certain countries, followed by the imposition of retaliatory tariffs and other actions against U.S. goods and services by certain countries has introduced significant market volatility and raised concerns about potential economic impacts. Our primary risks include reduced global movement of goods impacting freight activity, increased costs for suppliers and end-users and uncertainty around the availability of supply, all of which could contribute to a decline in business confidence, a reduction in demand for our products and increased product costs. Our tariff-related costs increased during the third quarter. We have and continue to look for ways to mitigate these costs including discussions with our suppliers, sourcing alternatives and agreements with our customers to recover these costs. The financial impact of tariffs, net of mitigation actions, was immaterial to our profitability and operating cash flows in the third quarter of 2025. Continued and increasing tariff costs, the effectiveness of our mitigation efforts and the resulting market volatility could materially and adversely affect our results of operations, financial condition and cash flows in the future. We will continue work to minimize the related impacts to our business to the extent possible. See the \"OUTLOOK\" section for a discussion of the potential tariff impacts for the remainder of 2025.\nDivestiture of Atmus\nOn March 18, 2024, we completed the divestiture of our remaining 80.5 percent ownership of Atmus Filtration Technologies Inc. (Atmus) common stock through a tax-free split-off. The exchange resulted in a reduction of shares of our common stock outstanding by 5.6 million shares and a gain of $1.3 billion. See NOTE 15, \"ATMUS DIVESTITURE,\" to our \nCondensed Consolidated Financial Statements\n for additional information.\n2025 Third Quarter and Year-to-Date Results\nA summary of our results is as follows:\n \nThree months ended\nNine months ended\nSeptember 30,\nSeptember 30,\nIn millions, except per share amounts\n2025\n2024\n2025\n2024\n(1)\nNet sales\n$\n8,317\n \n$\n8,456 \n$\n25,134\n \n$\n25,655 \nNet income attributable to Cummins Inc.\n536\n \n809 \n2,250\n \n3,528 \nEarnings per common share attributable to Cummins Inc.\nBasic\n$\n3.88\n \n$\n5.90 \n$\n16.33\n \n$\n25.47 \nDiluted\n3.86\n \n5.86 \n16.23\n \n25.31 \n(1)  \nNet income and earnings per common share included the $1.3 billion non-taxable gain associated with the divestiture of Atmus for the nine months ended September 30, 2024. See NOTE 15, \"ATMUS DIVESTITURE,\" to our \nCondensed Consolidated Financial Statements\n for additional information.\nNet income attributable to Cummins Inc. was $536 million, or $3.86 per diluted share, on sales of $8.3 billion for the three months ended September 30, 2025, versus the comparable prior year period net income attributable to Cummins Inc. of $809 million, or $5.86 per diluted share, on sales of $8.5 billion. The decreases in net income attributable to Cummins Inc. and earnings per diluted share were driven by lower demand in on-highway commercial truck markets, the goodwill impairment charge and inventory write-down in our Accelera segment and the unfavorable tax expense for passage of the One Big Beautiful Bill Act (The Act), partially offset by strong growth in power generation markets, especially data center and commercial markets, increased demand in light-duty automotive markets and lower compensation expenses. See NOTE 5, “INCOME TAXES,” and NOTE 14, “GOODWILL IMPAIRMENT AND INVENTORY WRITE-DOWN,” to our \nCondensed Consolidated Financial Statements \nfor additional information. \n35\nTable of Conten\nt\ns\nNet income attributable to Cummins Inc. was $2.3 billion, or $16.23 per diluted share, on sales of $25.1 billion for the nine months ended September 30, 2025, versus the comparable prior year period net income attributable to Cummins Inc. of $3.5 billion, or $25.31 per diluted share, on sales of $25.7 billion. The decreases in net income attributable to Cummins Inc. and earnings per diluted share were driven by the absence of the $1.3 billion gain recognized on the divestiture of Atmus in the first quarter of 2024, lower demand in on-highway commercial truck markets and the goodwill impairment charge and inventory write-down in our Accelera segment in the third quarter of 2025, partially offset by the strong growth in power generation markets, especially data center and commercial markets, lower compensation expenses and favorable non-tariff pricing mainly related to the launch of updated engine products in light-duty automotive markets. See NOTE 5, “INCOME TAXES,” and NOTE 15, “ATMUS DIVESTITURE,” to our \nCondensed Consolidated Financial Statements\n for additional information.\nThe table below presents our consolidated net sales by geographic area based on the location of the customer: \nThree months ended\nFavorable/\nNine months ended\nFavorable/\n \nSeptember 30,\n(Unfavorable)\nSeptember 30,\n(Unfavorable)\nIn millions\n2025\n2024\nAmount\nPercent\n2025\n2024\nAmount\nPercent\nUnited States and Canada\n$\n4,972\n \n$\n5,177 \n$\n(205)\n(4)\n%\n$\n15,215\n \n$\n15,789 \n$\n(574)\n(4)\n%\nInternational\n3,345\n \n3,279 \n66 \n2 \n%\n9,919\n \n9,866 \n53 \n1 \n%\nTotal net sales\n$\n8,317\n \n$\n8,456 \n$\n(139)\n(2)\n%\n$\n25,134\n \n$\n25,655 \n$\n(521)\n(2)\n%\nWorldwide revenues decreased by 2 percent in the three months ended September 30, 2025, compared to the same period in 2024, primarily due to the weaker demand in on-highway commercial truck markets, partially offset by higher demand in power generation markets, especially data center and commercial markets, higher sales in light-duty automotive markets and customer tariff recoveries. Net sales in the U.S. and Canada declined 4 percent primarily due to the lower demand in medium-duty and heavy-duty truck markets, partially offset by higher sales in power generation markets and light-duty automotive markets. International sales (excludes the U.S. and Canada) improved 2 percent primarily due to higher sales in China and Europe, partially offset by lower sales in Latin America and Asia Pacific. The increase in international sales was primarily due to higher power generation demand, partially offset by lower demand in commercial on-highway truck markets. Favorable foreign currency fluctuations impacted international sales by 2 percent (primarily the Euro).\nWorldwide revenues decreased by 2 percent in the nine months ended September 30, 2025, compared to the same period in 2024, mainly due to weaker demand in on-highway commercial truck markets and the divestiture of Atmus in the first quarter of 2024, partially offset by higher demand in power generation markets, especially data center and commercial markets, non-tariff pricing mainly related to the launch of updated engine products in light-duty automotive markets and customer tariff recoveries. Net sales in the U.S. and Canada declined 4 percent mainly due to lower demand in heavy-duty and medium-duty truck markets and the divestiture of Atmus, partially offset by higher sales in power generation markets and non-tariff pricing mainly related to the launch of updated engine products in light-duty automotive markets. International sales (excludes the U.S. and Canada) improved 1 percent primarily due to higher sales in China and Europe, partially offset by lower sales in Latin America and Asia Pacific. The increase in international sales was primarily due to higher demand in power generation markets and increased off-highway demand (primarily construction and mining), partially offset by weaker demand in on-highway commercial truck markets and the divestiture of Atmus. See NOTE 15, \"ATMUS DIVESTITURE,\" to our \nCondensed Consolidated Financial Statements\n for additional information.\n36\nTable of Conten\nt\ns\nThe following tables contain sales and EBITDA (defined as earnings or losses before interest expense, income taxes, depreciation and amortization and noncontrolling interests) by reportable segment for the three and nine months ended September 30, 2025 and 2024. See NOTE 16, \"REPORTABLE SEGMENTS,\" to our \nCondensed Consolidated Financial Statements\n for additional information and a reconciliation of our segment information to the corresponding amounts in our \nCondensed Consolidated Statements of Net Income\n. \n \nThree months ended September 30,\nReportable Segments\n2025\n2024\nPercent change\n \nPercent\n \n \nPercent\n \n2025 vs. 2024\nIn millions\nSales\nof Total\nEBITDA\nSales\nof Total\nEBITDA\nSales\nEBITDA\nEngine\n$\n2,605\n \n25\n \n%\n$\n261\n \n$\n2,913 \n28 \n%\n$\n427 \n(11)\n%\n(39)\n%\nComponents\n2,329\n \n23\n \n%\n292\n \n2,724 \n26 \n%\n351 \n(15)\n%\n(17)\n%\nDistribution\n3,172\n \n31\n \n%\n492\n \n2,952 \n29 \n%\n370 \n7 \n%\n33 \n%\nPower Systems\n1,996\n \n20\n \n%\n457\n \n1,687 \n16 \n%\n328 \n18 \n%\n39 \n%\nAccelera\n121\n \n1\n \n%\n(336)\n(1)\n110 \n1 \n%\n(115)\n10 \n%\nNM\nTotal segments\n10,223\n \n100\n \n%\n1,166\n \n10,386 \n100 \n%\n1,361 \n(2)\n%\n(14)\n%\nIntersegment eliminations\n(1,906)\n21\n \n(1,930)\n28 \n(1)\n%\n(25)\nTotal\n$\n8,317\n \n$\n1,187\n \n$\n8,456 \n$\n1,389 \n(2)\n%\n(15)\n%\n\"NM\" - not meaningful information\n(1)  \nIncluded a $210 million goodwill impairment charge and a $30 million inventory write-down. See NOTE 14, “GOODWILL IMPAIRMENT AND INVENTORY WRITE-DOWN,”\n \nto our\n Condensed Consolidated Financial Statements\n for additional information.\n \nNine months ended September 30,\nReportable Segments\n2025\n2024\nPercent change\nPercent\nPercent\n2025 vs. 2024\nIn millions\nSales\nof Total\nEBITDA\nSales\nof Total\nEBITDA\nSales\nEBITDA\nEngine\n$\n8,275\n \n27\n \n%\n$\n1,119\n \n$\n8,992 \n29 \n%\n$\n1,286 \n(8)\n%\n(13)\n%\nComponents\n7,704\n \n25\n \n%\n1,071\n \n9,038 \n29 \n%\n1,230 \n(15)\n%\n(13)\n%\nDistribution\n9,120\n \n29\n \n%\n1,313\n \n8,316 \n26 \n%\n978 \n10 \n%\n34 \n%\nPower Systems\n5,534\n \n18\n \n%\n1,276\n \n4,665 \n15 \n%\n866 \n19 \n%\n47 \n%\nAccelera\n329\n \n1\n \n%\n(522)\n(1)\n314 \n1 \n%\n(333)\n5 \n%\n(57)\n%\nTotal segments\n30,962\n \n100\n \n%\n4,257\n \n31,325 \n100 \n%\n4,027 \n(1)\n%\n6 \n%\nIntersegment eliminations\n(5,828)\n(23)\n(5,670)\n1,279 \n(2)\n3 \n%\nNM\nTotal\n$\n25,134\n \n$\n4,234\n \n$\n25,655 \n$\n5,306 \n(2)\n(2)\n%\n(20)\n%\n\"NM\" - not meaningful information\n(1)  \nIncluded a $210 million goodwill impairment charge and a $30 million inventory write-down. See NOTE 14, “GOODWILL IMPAIRMENT AND INVENTORY WRITE-DOWN,”\n \nto our\n Condensed Consolidated Financial Statements\n for additional information.\n(2)  \nIntersegment eliminations and total EBITDA included a $1.3 billion gain related to the divestiture of Atmus and total EBITDA included $35 million of costs associated with the divestiture of Atmus for the nine months ended September 30, 2024. See NOTE 15, \"ATMUS DIVESTITURE,\" to our \nCondensed Consolidated Financial Statements\n for additional information.\n2025 Highlights\nWe generated $2.1 billion in cash from operations for the nine months ended September 30, 2025, compared to $65 million for the comparable period in 2024. The $2.0 billion increase was mainly due to $1.9 billion of payments in 2024 required by the Settlement Agreements. See the section titled \"Cash Flows\" in the \"LIQUIDITY AND CAPITAL RESOURCES\" section for a discussion of items impacting cash flows. See NOTE 11, \"COMMITMENTS AND CONTINGENCIES,\" to our \nCondensed Consolidated Financial Statements\n for additional information on the Settlement Agreements.\nOur debt to capital ratio (total capital defined as debt plus equity) at September 30, 2025, was 36.8 percent, compared to 38.4 percent at December 31, 2024. The decrease was primarily due to increased equity balances from strong earnings since December 31, 2024, partially offset by higher debt balances at September 30, 2025. At September 30, 2025, we had $3.2 billion in cash and marketable securities on hand and access to our $4.0 billion credit facilities (net of $353 million of commercial paper outstanding), if necessary, to meet working capital, investment, acquisition and funding needs. \n37\nTable of Conten\nt\ns\nIn September 2025, we recorded $240 million of non-cash charges in our electrolyzer business for our Accelera segment. See NOTE 14, “GOODWILL IMPAIRMENT AND INVENTORY WRITE-DOWN,” to our \nCondensed Consolidated Financial Statements \nfor additional information.\nIn September 2025, we repaid our $500 million 0.75 percent senior notes, due in 2025, using cash on hand. See NOTE 9, “DEBT,” to our \nCondensed Consolidated Financial Statements \nfor additional information.\nIn July 2025, the Board of Directors (Board) authorized an increase to our quarterly dividend of approximately 10 percent from $1.82 per share to $2.00 per share.\nOn July 4, 2025, the The Act was signed into law, enacting significant changes to U.S. federal income tax rules affecting corporations, such as the ability to immediately deduct domestic research and development costs, restoration of elective 100 percent bonus depreciation for qualified property and changes to the international tax provisions. See NOTE 5, \"INCOME TAXES,\" to our \nCondensed Consolidated Financial Statements \nfor additional information. \nOn June 2, 2025, we entered into an amended and restated 5-year credit agreement that allows us to borrow up to $2.0 billion of unsecured funds at any time prior to June 2, 2030. The credit agreement amended and restated the prior $2.0 billion 5-year credit agreement that would have matured on June 3, 2029.\nOn June 2, 2025, we entered into a new 3-year credit agreement that allows us to borrow up to $2.0 billion of unsecured funds at any time prior to June 2, 2028. The credit agreement replaced the prior $2.0 billion 364-day credit facility that matured on June 2, 2025.\nOn May 9, 2025, we issued $2.0 billion aggregate principal amount of senior unsecured notes consisting of $300 million aggregate principal amount of 4.25 percent senior unsecured notes due in 2028, $700 million aggregate principal amount of 4.70 percent senior unsecured notes due in 2031 and $1.0 billion aggregate principal amount of 5.30 percent senior unsecured notes due in 2035. Net of the discount and underwriter fees, we received net proceeds of $1.99 billion. See NOTE 9, \"DEBT,\" to our \nCondensed Consolidated Financial Statements \nfor additional information. \nIn the first nine months of 2025, the investment gain on our U.S. pension trusts was 7.9 percent, while our U.K. pension trusts' loss was 1.8 percent. We anticipate making additional defined benefit pension contributions during the remainder of 2025 of $10 million for our U.S. and U.K. qualified and non-qualified pension plans. We expect our 2025 annual net periodic pension cost to approximate $79 million.\nAs of the date of this filing, our credit ratings and outlooks from the credit rating agencies remain unchanged.\n38\nTable of Conten\nt\ns\nRESULTS OF OPERATIONS\n \nThree months ended\nFavorable/\nNine months ended\nFavorable/\nSeptember 30,\n(Unfavorable)\nSeptember 30,\n(Unfavorable)\nIn millions, except per share amounts\n2025\n2024\nAmount\nPercent\n2025\n2024\nAmount\nPercent\nNET SALES\n$\n8,317\n \n$\n8,456 \n$\n(139)\n(2)\n%\n$\n25,134\n \n$\n25,655 \n$\n(521)\n(2)\n%\nCost of sales\n6,188\n \n6,285 \n97 \n2 \n%\n18,569\n \n19,250 \n681 \n4 \n%\nGROSS MARGIN\n2,129\n \n2,171 \n(42)\n(2)\n%\n6,565\n \n6,405 \n160 \n2 \n%\nOPERATING EXPENSES AND INCOME\n \n \n \n \n \n \nSelling, general and administrative expenses\n789\n \n807 \n18 \n2 \n%\n2,339\n \n2,474 \n135 \n5 \n%\nResearch, development and engineering expenses\n345\n \n359 \n14 \n4 \n%\n1,046\n \n1,107 \n61 \n6 \n%\nEquity, royalty and interest income from investees\n104\n \n99 \n5 \n5 \n%\n353\n \n325 \n28 \n9 \n%\nOther operating expense, net\n247\n \n54 \n(193)\nNM\n321\n \n131 \n(190)\nNM\nOPERATING INCOME\n852\n \n1,050 \n(198)\n(19)\n%\n3,212\n \n3,018 \n194 \n6 \n%\nInterest expense\n83\n \n83 \n— \n— \n%\n247\n \n281 \n34 \n12 \n%\nOther income, net\n61\n \n76 \n(15)\n(20)\n%\n207\n \n1,504 \n(1,297)\n(86)\n%\nINCOME BEFORE INCOME TAXES \n830\n \n1,043 \n(213)\n(20)\n%\n3,172\n \n4,241 \n(1,069)\n(25)\n%\nIncome tax expense\n271\n \n200 \n(71)\n(36)\n%\n835\n \n618 \n(217)\n(35)\n%\nCONSOLIDATED NET INCOME \n559\n \n843 \n(284)\n(34)\n%\n2,337\n \n3,623 \n(1,286)\n(35)\n%\nLess: Net income attributable to noncontrolling interests\n23\n \n34 \n11 \n32 \n%\n87\n \n95 \n8 \n8 \n%\nNET INCOME ATTRIBUTABLE TO CUMMINS INC. \n$\n536\n \n$\n809 \n$\n(273)\n(34)\n%\n$\n2,250\n \n$\n3,528 \n$\n(1,278)\n(36)\n%\nDiluted Earnings Per Common Share Attributable to Cummins Inc.\n$\n3.86\n \n$\n5.86 \n$\n(2.00)\n(34)\n%\n$\n16.23\n \n$\n25.31 \n$\n(9.08)\n(36)\n%\n\"NM\" - not meaningful information\n \nThree months ended\nFavorable/\n(Unfavorable)\nNine months ended\nFavorable/\n(Unfavorable)\n \nSeptember 30,\nSeptember 30,\nPercent of sales\n2025\n2024\nPercentage Points\n2025\n2024\nPercentage Points\nGross margin\n25.6\n \n%\n25.7 \n%\n(0.1)\n26.1\n \n%\n25.0 \n%\n1.1 \nSelling, general and administrative expenses\n9.5\n \n%\n9.5 \n%\n— \n9.3\n \n%\n9.6 \n%\n0.3 \nResearch, development and engineering expenses\n4.1\n \n%\n4.2 \n%\n0.1 \n4.2\n \n%\n4.3 \n%\n0.1 \nNet Sales\nNet sales for the three months ended September 30, 2025, decreased by $139 million\n \nversus the comparable period in 2024. The primary drivers were as follows:\n•\nComponents segment sales decreased 15 percent mainly due to lower demand in North American medium-duty and heavy-duty truck markets. \n•\nEngine segment sales decreased 11 percent largely due to lower demand in North American medium-duty and heavy-duty truck markets.\nThese decreases were partially offset by the following:\n•\nPower Systems segment sales increased 18 percent primarily due to higher demand in power generation markets, especially in North America, India and China.\n•\nDistribution segment sales increased 7 percent principally due to higher demand in power generation markets, especially in North America.\nNet sales for the nine months ended September 30, 2025, decreased $521 million\n \nversus the comparable period in 2024. The primary drivers were as follows:\n•\nComponents segment sales decreased 15 percent mainly due to lower demand in North American heavy-duty and medium-duty truck markets and the divestiture of Atmus on March 18, 2024. See NOTE 15, \"ATMUS DIVESTITURE,\" to our \nCondensed Consolidated Financial Statements\n for additional information.\n39\nTable of Conten\nt\ns\n•\nEngine segment sales decreased 8 percent largely due to lower demand in North American heavy-duty and medium-duty truck markets.\nThese decreases were partially offset by the following:\n•\nPower Systems segment sales increased 19 percent primarily due to higher demand in power generation markets, especially in North America and China.\n•\nDistribution segment sales increased 10 percent principally due to higher demand in power generation markets, especially in North America.\nSales to international markets (excludes the U.S. and Canada), based on location of customers, for the three and nine months ended September 30, 2025, were 40 percent and 39 percent of total net sales compared with 39 percent and 38 percent of total net sales for the comparable periods in 2024. A more detailed discussion of sales by segment is presented in the “REPORTABLE SEGMENT RESULTS” section.\nCost of Sales\nThe types of expenses included in cost of sales are the following: parts and material consumption, including direct and indirect materials; compensation and related expenses, including variable compensation, salaries and fringe benefits; depreciation on production equipment and facilities and amortization of technology intangibles; estimated costs of warranty programs and campaigns; production utilities; production-related purchasing; warehousing, including receiving and inspection; freight costs; engineering support costs; repairs and maintenance; production and warehousing facility property insurance and rent for production facilities and other production overhead.\nGross Margin\nGross margin decreased $42 million for the three months ended September 30, 2025, and decreased 0.1 points as a percentage of net sales versus the comparable period in 2024. The decreases in gross margin and gross margin as a percentage of sales were primarily due to lower demand in on-highway commercial truck markets, partially offset by higher demand in power generation markets, especially data center and commercial markets, higher demand in light-duty automotive markets, as well as favorable non-tariff related pricing mainly due to the launch of updated engine products in light-duty automotive markets. The net impact of tariff costs and related recoveries was immaterial for the three month period ended September 30, 2025.\nGross margin increased $160 million for the nine months ended September 30, 2025, and increased 1.1 points as a percentage of sales versus the comparable period in 2024. The increases in gross margin and gross margin as a percentage of sales were primarily due to strong growth in power generation markets, especially data center and commercial markets, as well as favorable non-tariff related pricing mainly due to the launch of updated engine products in light-duty automotive markets, partially offset by lower demand in on-highway commercial truck markets and the absence of Atmus sales. The net impact of tariff costs and related recoveries was immaterial for the nine month period ended September 30, 2025. See NOTE 15, \"ATMUS DIVESTITURE,\" to our \nCondensed Consolidated Financial Statements\n for additional information.\nThe provision for base warranties issued as a percentage of sales for the three and nine months ended September 30, 2025, was 1.8 percent and 1.9 percent, respectively, compared to 1.9 percent and 1.9 percent for the comparable periods in 2024. \nSelling, General and Administrative Expenses\nSelling, general and administrative expenses decreased $18 million for the three months ended September 30, 2025, and remained flat as a percentage of net sales versus the comparable period in 2024. The decrease was mainly due to lower compensation expenses. Compensation and related expenses included salaries, fringe benefits and variable compensation.\nSelling, general and administrative expenses decreased $135 million for the nine months ended September 30, 2025, and decreased 0.3 points as a percentage of net sales versus the comparable period in 2024. The decreases were mainly due to lower compensation expenses.\nResearch, Development and Engineering Expenses\nResearch, development and engineering expenses decreased $14 million for the three months ended September 30, 2025, and decreased 0.1 points as a percentage of net sales versus the comparable period in 2024. The decreases were mainly due to lower spending on prototypes and lower compensation expenses. Compensation and related expenses included salaries, fringe benefits and variable compensation.\n40\nTable of Conten\nt\ns\nResearch, development and engineering expenses decreased $61 million for the nine months ended September 30, 2025, and decreased 0.1 points as a percentage of net sales versus the comparable period in 2024. The decreases were mainly due to lower compensation expenses.\nResearch activities continue to focus on development of new products and improvements of current technologies to meet future emission standards around the world, improvements in fuel economy performance of diesel and natural gas-powered engines and related components, as well as development activities around electrified power systems with innovative components and systems including battery and electric power technologies and hydrogen production technologies.\nEquity, Royalty and Interest Income from Investees\nEquity, royalty and interest income from investees increased $5 million for the three months ended September 30, 2025, versus the comparable period in 2024, primarily due to increased earnings at Beijing Foton Cummins Engine Co., Ltd. and Chongqing Cummins Engine Co., Ltd. and lower start-up costs from Amplify Cell Technologies LLC, partially offset by lower royalty and interest income from investees and lower earnings from Sistemas Automotrices de Mexico S.A. de C.V. \nEquity, royalty and interest income from investees increased $28 million for the nine months ended September 30, 2025, versus the comparable period in 2024, mainly due to increased earnings at Beijing Foton Cummins Engine Co., Ltd. and Chongqing Cummins Engine Co., Ltd. and the absence of a joint venture consolidated in the first quarter of 2025 with prior year losses, partially offset by lower earnings at Sistemas Automotrices de Mexico S.A. de C.V. and the absence of joint venture earnings from the divestiture of Atmus. See NOTE 4, \"EQUITY, ROYALTY AND INTEREST INCOME FROM INVESTEES,\" and NOTE 15, \"ATMUS DIVESTITURE,\" to our \nCondensed Consolidated Financial Statements\n for additional information.\nOther Operating Expense, Net \nOther operating expense, net was as follows:\nThree months ended\nNine months ended\n \nSeptember 30,\nSeptember 30,\nIn millions\n2025\n2024\n2025\n2024\nGoodwill impairment\n$\n(210)\n(1)\n$\n— \n$\n(210)\n(1)\n$\n— \nAmortization of intangible assets\n(34)\n(32)\n(99)\n(97)\nLoss on write-off of assets\n(4)\n(2)\n(15)\n(15)\nFlood damage expenses\n—\n \n(10)\n—\n \n(10)\nRoyalty income, net\n3\n \n2 \n8\n \n7 \nOther, net\n(2)\n(12)\n(5)\n(16)\nTotal other operating expense, net\n$\n(247)\n$\n(54)\n$\n(321)\n$\n(131)\n(1)\n See NOTE 14, “GOODWILL IMPAIRMENT AND INVENTORY WRITE-DOWN,” to our \nCondensed Consolidated Financial Statements \nfor additional information.\nInterest Expense\nInterest expense was $83 million and $247 million for the three and nine months ended September 30, 2025, versus $83 million and $281 million for the comparable periods in 2024. Interest expense remained flat for the three months ended September 30, 2025, primarily due to lower weighted-average interest rates, offset by higher average debt balances. Interest expense decreased $34 million for the nine months ended September 30, 2025, primarily due to lower weighted-average interest rates, partially offset by higher average debt balances. \n41\nTable of Conten\nt\ns\nOther Income, Net \nOther income, net was as follows:\nThree months ended \nNine months ended\n \nSeptember 30,\nSeptember 30,\nIn millions\n2025\n2024\n2025\n2024\nInterest income\n$\n29\n \n$\n14 \n$\n85\n \n$\n73 \nNon-service pension and OPEB income\n17\n \n30 \n51\n \n82 \nGain on corporate owned life insurance\n14\n \n29 \n35\n \n30 \nGain on sale of marketable securities, net\n7\n \n6 \n18\n \n10 \nGain related to divestiture of Atmus \n(1)\n—\n \n— \n—\n \n1,333 \nForeign currency loss, net\n(12)\n(10)\n(1)\n(33)\nOther, net\n6\n \n7 \n19\n \n9 \nTotal other income, net \n$\n61\n \n$\n76 \n$\n207\n \n$\n1,504 \n(1)  \nSee NOTE 15, \"ATMUS DIVESTITURE,\" to our \nCondensed Consolidated Financial Statements\n for additional information.\nIncome Tax Expense\nOn July 4, 2025, The Act was signed into law, enacting significant changes to U.S. federal income tax rules affecting corporations, such as the ability to immediately deduct domestic research and development costs, restoration of elective 100 percent bonus depreciation for qualified property and changes to the international tax provisions. Implementation of The Act resulted in an increase to tax expense of $36 million in the third quarter of 2025, primarily due to a reduction in the foreign income deduction and changes to the research and development tax credit. Additionally, we expect certain provisions of The Act will result in significantly lower tax-related cash payments in the current and the next several fiscal years.\nOur effective tax rate for 2025 is expected to approximate 26.5 percent, excluding any discrete items that may arise, which is a 2 percent increase over our prior estimates. This increase is attributable to the impacts of The Act and the non-deductible goodwill impairment and inventory write-down. See NOTE 14, “GOODWILL IMPAIRMENT AND INVENTORY WRITE-DOWN,” to our \nCondensed Consolidated Financial Statements \nfor additional information.\nOur effective tax rates for the three and nine months ended September 30, 2025, were 32.7 percent and 26.3 percent, respectively. Our effective tax rates for the three and nine months ended September 30, 2024, were 19.2 percent and 14.6 percent, respectively. \nThe three months ended September 30, 2025, contained net unfavorable discrete tax items of $4 million, primarily due to $32 million of unfavorable return to provision adjustments and net $1 million of other unfavorable tax items, partially offset by $25 million of favorable adjustments for uncertain tax positions and $4 million of favorable adjustments for share-based compensation. \nThe nine months ended September 30, 2025, contained net favorable discrete tax items of $6 million, primarily due to $30 million of favorable adjustments for uncertain tax positions and $12 million of favorable adjustments for share-based compensation, partially offset by $32 million of unfavorable return to provision adjustments and net $4 million of other unfavorable tax items.\nThe three months ended September 30, 2024, contained net favorable discrete tax items of $36 million, primarily due to $20 million of favorable adjustments from tax return amendments, $15 million of favorable return to provision adjustments and $2 million of favorable share-based compensation tax benefits, partially offset by $1 million of other unfavorable adjustments.\nThe nine months ended September 30, 2024, contained net favorable discrete tax items primarily due to the $1.3 billion non-taxable gain on the Atmus split-off. Other discrete tax items were net favorable by $66 million, primarily due to $21 million of favorable adjustments related to audit settlements, $20 million of favorable adjustments from tax return amendments, $18 million of favorable return to provision adjustments and $17 million of favorable share-based compensation tax benefits, partially offset by $7 million of unfavorable adjustments for uncertain tax positions and $3 million of other unfavorable adjustments.\nNoncontrolling Interests\nNoncontrolling interests eliminate the income or loss attributable to non-Cummins ownership interests in our consolidated entities. Noncontrolling interests in income of consolidated subsidiaries for the three and nine months ended September 30, 2025, decreased $11 million and $8 million versus the comparable periods in 2024. The decrease for the three months ended September 30, 2025, was primarily due to lower earnings at Eaton Cummins Joint Venture. The decrease for the nine months ended September 30, 2025, was mainly due to losses from a former joint venture consolidated in the first quarter of 2025, the divestiture of Atmus and lower earnings at our other joint ventures, partially offset by higher earnings at Cummins India limited.\n42\nTable of Conten\nt\ns\nComprehensive Income - Foreign Currency Translation Adjustment\nThe foreign currency translation adjustment was a net loss of $67 million and a net gain of $247 million, for the three and nine months ended September 30, 2025, respectively, compared to a net gain of $165 million and $22 million, for the three and nine months ended September 30, 2024, respectively, driven by the following:\nThree months ended\nSeptember 30,\n2025\n2024\nIn millions\nTranslation adjustment\nPrimary currency driver vs. U.S. dollar\nTranslation adjustment\nPrimary currency driver vs. U.S. dollar\nWholly-owned subsidiaries\n$\n(49)\nIndian rupee\n$\n134 \nChinese renminbi and Euro\nEquity method investments\n—\n \n29 \nChinese renminbi\nConsolidated subsidiaries with a noncontrolling interest\n(18)\nIndian rupee\n2 \nChinese renminbi\nTotal\n$\n(67)\n$\n165 \nNine months ended\nSeptember 30,\n2025\n2024\nIn millions\nTranslation adjustment\nPrimary currency driver vs. U.S. dollar\nTranslation adjustment\nPrimary currency driver vs. U.S. dollar\nWholly-owned subsidiaries\n$\n241\n \nEuro, Brazilian real and British pound\n$\n11 \nBritish pound and Euro, partially offset by Brazilian real\nEquity method investments\n20\n \nChinese renminbi\n14 \nIndian rupee\nConsolidated subsidiaries with a noncontrolling interest\n(14)\nIndian rupee\n(3)\nIndian rupee\nTotal\n$\n247\n \n$\n22 \n43\nTable of Conten\nt\ns\nREPORTABLE SEGMENT RESULTS \nOur reportable segments consist of the Engine, Components, Distribution, Power Systems and Accelera segments. This reporting structure is organized according to the products and markets each segment serves. We use segment EBITDA as the basis for the Chief Operating Decision Maker to evaluate the performance of each of our reportable segments. We believe EBITDA is a useful measure of our operating performance as it assists investors and debt holders in comparing our performance on a consistent basis without regard to financing methods, capital structure, income taxes or depreciation and amortization methods, which can vary significantly depending upon many factors. Segment amounts exclude certain expenses not specifically identifiable to segments. See NOTE 16, \"REPORTABLE SEGMENTS,\" to our \nCondensed Consolidated Financial Statements\n for additional information and a reconciliation of our segment information to the corresponding amounts in our \nCondensed Consolidated Statements of Net Income\n.\nTariff related costs and recoveries were evaluated independently of all other drivers included in the disclosures below and all references to \"price\" and \"material cost\" variances exclude these separately evaluated tariff costs and recoveries. The net impact of tariff costs and related recoveries were immaterial to each reportable segment's EBITDA. \nFollowing is a discussion of results for each of our reportable segments.\nEngine Segment Results\nFinancial data for the Engine segment was as follows:\n \nThree months ended\nFavorable/\nNine months ended\nFavorable/\n \nSeptember 30,\n(Unfavorable)\nSeptember 30,\n(Unfavorable)\nIn millions\n2025\n2024\nAmount\nPercent\n2025\n2024\nAmount\nPercent\nExternal sales\n$\n1,922\n$\n2,215\n$\n(293)\n(13)\n%\n$\n6,124\n$\n6,923\n$\n(799)\n(12)\n%\nIntersegment sales\n683\n698\n(15)\n(2)\n%\n2,151\n2,069\n82 \n4 \n%\nTotal sales\n2,605\n2,913\n(308)\n(11)\n%\n8,275\n8,992\n(717)\n(8)\n%\nResearch, development and engineering expenses\n159\n147\n(12)\n(8)\n%\n465\n468\n3 \n1 \n%\nEquity, royalty and interest income from investees\n54\n53\n1 \n2 \n%\n187\n158\n29 \n18 \n%\nInterest income\n11\n2\n9 \nNM\n29\n16\n13 \n81 \n%\nSegment EBITDA\n261\n427\n(166)\n(39)\n%\n1,119\n1,286\n(167)\n(13)\n%\n \n \n \nPercentage Points\n \n \nPercentage Points\nSegment EBITDA as a percentage of total sales\n10.0\n \n%\n14.7 \n%\n \n(4.7)\n13.5\n \n%\n14.3 \n%\n \n(0.8)\nSales for our Engine segment by market were as follows:\n \nThree months ended\nFavorable/\nNine months ended\nFavorable/\nSeptember 30,\n(Unfavorable)\nSeptember 30,\n(Unfavorable)\nIn millions\n2025\n2024\nAmount\nPercent\n2025\n2024\nAmount\nPercent\nHeavy-duty truck\n$\n772\n$\n1,021\n$\n(249)\n(24)\n%\n$\n2,669\n$\n3,264\n$\n(595)\n(18)\n%\nMedium-duty truck and bus\n784\n1,073\n(289)\n(27)\n%\n2,720\n3,142\n(422)\n(13)\n%\nLight-duty automotive\n583\n395\n188 \n48 \n%\n1,490\n1,294\n196 \n15 \n%\nTotal on-highway\n2,139\n2,489\n(350)\n(14)\n%\n6,879\n7,700\n(821)\n(11)\n%\nOff-highway\n466\n424\n42 \n10 \n%\n1,396\n1,292\n104 \n8 \n%\nTotal sales\n$\n2,605\n$\n2,913\n$\n(308)\n(11)\n%\n$\n8,275\n$\n8,992\n$\n(717)\n(8)\n%\n \n \nPercentage Points\n \n \nPercentage Points\nOn-highway sales as percentage of total sales\n82\n \n%\n85 \n%\n \n(3)\n83\n \n%\n86 \n%\n \n(3)\n44\nTable of Conten\nt\ns\nUnit shipments by engine classification (including unit shipments to Power Systems and off-highway engine units included in their respective classification) were as follows:\n \nThree months ended\nFavorable/\nNine months ended\nFavorable/\n \nSeptember 30,\n(Unfavorable)\nSeptember 30,\n(Unfavorable)\n \n2025\n2024\nAmount\nPercent\n2025\n2024\nAmount\nPercent\nHeavy-duty\n22,400\n \n32,400 \n(10,000)\n(31)\n%\n78,700\n \n103,500 \n(24,800)\n(24)\n%\nMedium-duty\n63,100\n \n79,200 \n(16,100)\n(20)\n%\n211,700\n \n234,600 \n(22,900)\n(10)\n%\nLight-duty\n49,600\n \n41,400 \n8,200 \n20 \n%\n132,700\n \n153,400 \n(20,700)\n(13)\n%\nTotal unit shipments \n(1)\n135,100\n \n153,000 \n(17,900)\n(12)\n%\n423,100\n \n491,500 \n(68,400)\n(14)\n%\n (1)\n \nUnit shipments exclude aftermarket parts.\n \nSales\nEngine segment sales for the three months ended September 30, 2025, decreased $308 million versus the comparable period in 2024. The following were the primary drivers by market: \n•\nMedium-duty truck and bus sales decreased $289 million primarily due to lower truck demand, especially in North America with shipments down 50 percent.\n•\nHeavy-duty truck sales decreased $249 million mainly due to weaker demand, especially in North America with shipments down 36 percent.\nThese decreases were partially offset by the following increases:\n•\nLight-duty automotive sales increased $188 million primarily due to higher pick-up demand, especially in North America, and non-tariff pricing mainly related to the launch of updated engine products, partially offset by the absence of a customer agreement recorded in the third quarter of 2024 providing for a price adjustment for certain units sold beginning January 1, 2024.\n•\nOff-highway sales increased $42 million principally due to higher international construction demand, especially in China.\nEngine segment sales for the nine months ended September 30, 2025, decreased $717 million versus the comparable period in 2024. The following were the primary drivers by market:\n•\nHeavy-duty truck sales decreased $595 million principally due to lower demand, especially in North America with shipments down 28 percent.\n•\nMedium-duty truck and bus sales decreased $422 million primarily due to lower truck demand, especially in North America with shipments down 30 percent. \nThese decreases were partially offset by the following increases:\n•\nLight-duty automotive sales increased $196 million primarily due to non-tariff pricing mainly related to the launch of updated engine products, partially offset by the absence of a customer agreement recorded in the third quarter of 2024 providing for a price adjustment for certain units sold beginning January 1, 2024.\n•\nOff-highway sales increased $104 million primarily due to higher international construction demand, especially in China.\nEngine segment EBITDA for the three and nine months ended September 30, 2025, decreased $166 million and $167 million, respectively, versus the comparable period in 2024, primarily due to lower volumes, the absence of a customer agreement recorded in the third quarter of 2024 providing for a price adjustment for certain units sold beginning January 1, 2024 and higher material costs, partially offset by favorable pricing. Unfavorable material costs and favorable pricing were primarily related to the launch of updated products in light-duty automotive markets.\n45\nTable of Conten\nt\ns\nComponents Segment Results \nFinancial data for the Components segment was as follows:\n \nThree months ended\nFavorable/\nNine months ended\nFavorable/\n \nSeptember 30,\n(Unfavorable)\nSeptember 30,\n(Unfavorable)\nIn millions\n2025\n2024\nAmount\nPercent\n2025\n2024\nAmount\nPercent\nExternal sales\n$\n1,986\n$\n2,287\n$\n(301)\n(13)\n%\n$\n6,551\n$\n7,647\n$\n(1,096)\n(14)\n%\nIntersegment sales\n343\n437\n(94)\n(22)\n%\n1,153\n1,391\n(238)\n(17)\n%\nTotal sales\n2,329\n2,724\n(395)\n(15)\n%\n7,704\n9,038\n(1,334)\n(15)\n%\nResearch, development and engineering expenses\n70\n85\n15 \n18 \n%\n222\n250\n28 \n11 \n%\nEquity, royalty and interest income from investees\n7\n12\n(5)\n(42)\n%\n24\n51\n(27)\n(53)\n%\nInterest income\n8\n4\n4 \n100 \n%\n25\n21\n4 \n19 \n%\nSegment EBITDA\n292\n351\n(59)\n(17)\n%\n1,071\n1,230\n(1)\n(159)\n(13)\n%\n \n \n \nPercentage Points\n \n \nPercentage Points\nSegment EBITDA as a percentage of total sales\n12.5\n \n%\n12.9 \n%\n \n(0.4)\n13.9\n \n%\n13.6 \n%\n \n0.3 \n(1)  \nIncluded $21 million of costs associated with the divestiture of Atmus for the nine months ended September 30, 2024. See NOTE 15, \"ATMUS DIVESTITURE,\" to our \nCondensed Consolidated Financial Statements\n for additional information.\nSales for our Components segment by business were as follows:\n \nThree months ended\nFavorable/\nNine months ended\nFavorable/\n \nSeptember 30,\n(Unfavorable)\nSeptember 30,\n(Unfavorable)\nIn millions\n2025\n2024\nAmount\nPercent\n2025\n2024\nAmount\nPercent\nDrivetrain and braking systems\n$\n917\n \n$\n1,131 \n$\n(214)\n(19)\n%\n$\n3,068\n \n$\n3,619 \n$\n(551)\n(15)\n%\nEmission solutions\n788\n \n864 \n(76)\n(9)\n%\n2,590\n \n2,776 \n(186)\n(7)\n%\nComponents and software\n537\n \n581 \n(44)\n(8)\n%\n1,719\n \n1,815 \n(96)\n(5)\n%\nAutomated transmissions\n87\n \n148 \n(61)\n(41)\n%\n327\n \n475 \n(148)\n(31)\n%\nAtmus\n—\n \n— \n— \n— \n%\n—\n \n353 \n(1)\n(353)\n(100)\n%\nTotal sales\n$\n2,329\n \n$\n2,724 \n$\n(395)\n(15)\n%\n$\n7,704\n \n$\n9,038 \n$\n(1,334)\n(15)\n%\n (1)  \nIncluded sales through the March 18, 2024, divestiture. See NOTE 15, \"ATMUS DIVESTITURE,\" to our \nCondensed Consolidated Financial Statements\n for additional information.\nSales\nComponents segment sales for the three months ended September 30, 2025, decreased $395 million versus the comparable period in 2024. The following were the primary drivers by business:\n•\nDrivetrain and braking systems sales decreased $214 million primarily due to lower demand in North America and lower sales in India due to changes in the business model.\n•\nEmission solutions sales decreased $76 million mainly due to lower demand in North America.\nComponents segment sales for the nine months ended September 30, 2025, decreased $1.3 billion versus the comparable period in 2024. The following were the primary drivers by business:\n•\nDrivetrain and braking systems sales decreased $551 million primarily due to lower demand in North America and lower sales in India due to changes in the business model.\n•\nSales decreased $353 million due to the Atmus divestiture on March 18, 2024.\n•\nEmission solutions sales decreased $186 million mainly due to lower demand in North America.\nSegment EBITDA\nComponents segment EBITDA for the three months ended September 30, 2025, decreased $59 million versus the comparable period in 2024, mainly due to lower volumes, partially offset by decreased freight costs and lower compensation expenses.\n46\nTable of Conten\nt\ns\nComponents segment EBITDA for the nine months ended September 30, 2025, decreased $159 million versus the comparable period in 2024, primarily due to lower volumes, partially offset by favorable product coverage costs, decreased compensation expenses and lower material costs.\nDistribution Segment Results\nFinancial data for the Distribution segment was as follows:\n \nThree months ended\nFavorable/\nNine months ended\nFavorable/\n \nSeptember 30,\n(Unfavorable)\nSeptember 30,\n(Unfavorable)\nIn millions\n2025\n2024\nAmount\nPercent\n2025\n2024\nAmount\nPercent\nExternal sales\n$\n3,170\n$\n2,942\n$\n228 \n8 \n%\n$\n9,106\n$\n8,292\n$\n814 \n10 \n%\nIntersegment sales\n2\n10\n(8)\n(80)\n%\n14\n24\n(10)\n(42)\n%\nTotal sales\n3,172\n2,952\n220 \n7 \n%\n9,120\n8,316\n804 \n10 \n%\nResearch, development and engineering expenses\n14\n13\n(1)\n(8)\n%\n42\n41\n(1)\n(2)\n%\nEquity, royalty and interest income from investees\n23\n25\n(2)\n(8)\n%\n77\n73\n4 \n5 \n%\nInterest income\n6\n7\n(1)\n(14)\n%\n18\n29\n(11)\n(38)\n%\nSegment EBITDA\n492\n370\n122 \n33 \n%\n1,313\n978\n335 \n34 \n%\n \n \n \nPercentage Points\n \n \nPercentage Points\nSegment EBITDA as a percentage of total sales\n15.5\n \n%\n12.5 \n%\n \n3.0 \n14.4\n \n%\n11.8 \n%\n \n2.6 \n Sales for our Distribution segment by region were as follows:\n \nThree months ended\nFavorable/\nNine months ended\nFavorable/\n \nSeptember 30,\n(Unfavorable)\nSeptember 30,\n(Unfavorable)\nIn millions\n2025\n2024\nAmount\nPercent\n2025\n2024\nAmount\nPercent\nNorth America\n$\n2,202\n \n$\n1,950 \n$\n252 \n13 \n%\n$\n6,379\n \n$\n5,574 \n$\n805 \n14 \n%\nAsia Pacific\n312\n \n343 \n(31)\n(9)\n%\n832\n \n938 \n(106)\n(11)\n%\nEurope\n273\n \n310 \n(37)\n(12)\n%\n868\n \n835 \n33 \n4 \n%\nChina\n122\n \n120 \n2 \n2 \n%\n361\n \n352 \n9 \n3 \n%\nLatin America\n96\n \n71 \n25 \n35 \n%\n229\n \n195 \n34 \n17 \n%\nIndia\n93\n \n78 \n15 \n19 \n%\n258\n \n228 \n30 \n13 \n%\nAfrica and Middle East\n74\n \n80 \n(6)\n(8)\n%\n193\n \n194 \n(1)\n(1)\n%\nTotal sales\n$\n3,172\n \n$\n2,952 \n$\n220 \n7 \n%\n$\n9,120\n \n$\n8,316 \n$\n804 \n10 \n%\nSales for our Distribution segment by product line were as follows:\n \nThree months ended\nFavorable/\nNine months ended\nFavorable/\n \nSeptember 30,\n(Unfavorable)\nSeptember 30,\n(Unfavorable)\nIn millions\n2025\n2024\nAmount\nPercent\n2025\n2024\nAmount\nPercent\nPower generation\n$\n1,247\n \n$\n1,091 \n$\n156 \n14 \n%\n$\n3,537\n \n$\n2,752 \n$\n785 \n29 \n%\nParts\n1,013\n \n1,004 \n9 \n1 \n%\n3,059\n \n2,995 \n64 \n2 \n%\nService\n495\n \n455 \n40 \n9 \n%\n1,350\n \n1,309 \n41 \n3 \n%\nEngines\n417\n \n402 \n15 \n4 \n%\n1,174\n \n1,260 \n(86)\n(7)\n%\nTotal sales\n$\n3,172\n \n$\n2,952 \n$\n220 \n7 \n%\n$\n9,120\n \n$\n8,316 \n$\n804 \n10 \n%\nSales\nDistribution segment sales for the three and nine months ended September 30, 2025, increased $220 million and $804 million, respectively, versus the comparable periods in 2024. These increases were primarily due to an increase in North American sales mainly driven by higher demand in power generation markets, especially data center and commercial markets. \n47\nTable of Conten\nt\ns\nSegment EBITDA \nDistribution segment EBITDA for the three months ended September 30, 2025, increased $122 million versus the comparable period in 2024, primarily due to improved mix, favorable pricing, decreased compensation expenses, lower material costs, favorable foreign currency fluctuations (primarily in the Canadian dollar and the Euro) and increased volumes (primarily power generation markets in North America).\nDistribution segment EBITDA for the nine months ended September 30, 2025, increased $335 million versus the comparable period in 2024, primarily due to increased power generation volumes in North America, favorable pricing, improved mix, decreased compensation expenses, lower material costs and improved operational leverage.\nPower Systems Segment Results\nFinancial data for the Power Systems segment was as follows:\n \nThree months ended\nFavorable/\nNine months ended\nFavorable/\n \nSeptember 30,\n(Unfavorable)\nSeptember 30,\n(Unfavorable)\nIn millions\n2025\n2024\nAmount\nPercent\n2025\n2024\nAmount\nPercent\nExternal sales\n$\n1,126\n$\n912\n$\n214 \n23 \n%\n$\n3,052\n$\n2,508\n$\n544 \n22 \n%\nIntersegment sales\n870\n775\n95 \n12 \n%\n2,482\n2,157\n325 \n15 \n%\nTotal sales\n1,996\n1,687\n309 \n18 \n%\n5,534\n4,665\n869 \n19 \n%\nResearch, development and engineering expenses\n62\n57\n(5)\n(9)\n%\n188\n180\n(8)\n(4)\n%\nEquity, royalty and interest income from investees\n26\n20\n6 \n30 \n%\n82\n65\n17 \n26 \n%\nInterest income\n4\n1\n3 \nNM\n12\n7\n5 \n71 \n%\nSegment EBITDA\n457\n328\n129 \n39 \n%\n1,276\n866\n410 \n47 \n%\n \n \n \nPercentage Points\n \n \nPercentage Points\nSegment EBITDA as a percentage of total sales\n22.9\n \n%\n19.4 \n%\n \n3.5 \n23.1\n \n%\n18.6 \n%\n \n4.5 \n\"NM\" - not meaningful information\nSales for our Power Systems segment by product line were as follows:\n \nThree months ended\nFavorable/\nNine months ended\nFavorable/\n \nSeptember 30,\n(Unfavorable)\nSeptember 30,\n(Unfavorable)\nIn millions\n2025\n2024\nAmount\nPercent\n2025\n2024\nAmount\nPercent\nPower generation\n$\n1,280\n \n$\n1,055 \n$\n225 \n21 \n%\n$\n3,486\n \n$\n2,895 \n$\n591 \n20 \n%\nIndustrial\n531\n \n508 \n23 \n5 \n%\n1,535\n \n1,406 \n129 \n9 \n%\nGenerator technologies\n185\n \n124 \n61 \n49 \n%\n513\n \n364 \n149 \n41 \n%\nTotal sales\n$\n1,996\n \n$\n1,687 \n$\n309 \n18 \n%\n$\n5,534\n \n$\n4,665 \n$\n869 \n19 \n%\nSales\nPower Systems segment sales for the three months ended September 30, 2025, increased $309 million versus the comparable period in 2024. The increase was primarily due to \nincreased p\nower generation sales of $225 million mainly due to higher demand in North America, India and China.\nPower Systems segment sales for the nine months ended September 30, 2025, increased $869 million versus the comparable period in 2024. The increase was primarily due to increased power generation sales of $591 million mainly due to higher demand in North America and China.\nSegment EBITDA \nPower Systems segment EBITDA for the three months ended September 30, 2025, increased $129 million versus the comparable period in 2024, mainly due to favorable pricing and higher volumes, partially offset by unfavorable mix.\nPower Systems segment EBITDA for the nine months ended September 30, 2025, increased $410 million versus the comparable period in 2024, mainly due to higher volumes and favorable pricing.\n48\nTable of Conten\nt\ns\nAccelera Segment Results\nFinancial data for the Accelera segment was as follows:\n \nThree months ended\nFavorable/\nNine months ended\nFavorable/\n \nSeptember 30,\n(Unfavorable)\nSeptember 30,\n(Unfavorable)\nIn millions\n2025\n2024\nAmount\nPercent\n2025\n2024\nAmount\nPercent\nExternal sales\n$\n113\n$\n100\n$\n13 \n13 \n%\n$\n301\n$\n285\n$\n16 \n6 \n%\nIntersegment sales\n8\n10\n(2)\n(20)\n%\n28\n29\n(1)\n(3)\n%\nTotal sales\n121\n110\n11 \n10 \n%\n329\n314\n15 \n5 \n%\nResearch, development and engineering expenses\n40\n57\n17 \n30 \n%\n129\n166\n37 \n22 \n%\nEquity, royalty and interest loss from investees\n(6)\n(11)\n5 \n45 \n%\n(17)\n(22)\n5 \n23 \n%\nInterest income\n—\n—\n— \n— \n%\n1\n—\n1 \nNM\nSegment EBITDA\n(336)\n(1)\n(115)\n(221)\nNM\n(522)\n(1)\n(333)\n(189)\n(57)\n%\n\"NM\" - not meaningful information\n(1)  \nIncluded a $210 million goodwill impairment charge and a $30 million inventory write-down. See NOTE 14, “GOODWILL IMPAIRMENT AND INVENTORY WRITE-DOWN,”\n \nto our\n Condensed Consolidated Financial Statements\n for additional information.\nAccelera segment sales for the three months ended September 30, 2025, increased $11 million versus the comparable period in 2024, mainly due to higher sales for electrified powertrains and favorable foreign currency fluctuations in the Euro, partially offset by decreased sales for electrolyzers.\nAccelera segment sales for the nine months ended September 30, 2025, increased $15 million versus the comparable period in 2024, primarily due to improved sales of electrified powertrains, partially offset by lower sales for electrolyzers. \nOUTLOOK\nThe uncertain global trade environment, characterized by tariffs, export controls and broader geopolitical tensions, has created significant market volatility while introducing uncertainty around future demand for capital goods as well as potential impacts to our supply chain and our related product costs. Given the breadth, severity and uncertain duration of these global trade measures, our outlook presented below could be negatively impacted by policy-driven volatility. We are proactively taking steps in our supply chain to mitigate impacts where possible and we are working with our customers to pass through incremental costs.\n2025 Outlook\nOur outlook reflects the following positive trends and challenges to our business that could impact our revenue and earnings potential in 2025.\n \nPositive Trends\n•\nWe expect demand within our Power Systems business to remain strong, including the power generation and industrial markets. \n•\nWe anticipate our aftermarket business will remain stable, driven primarily by demand in our Engine and Power Systems businesses.\nChallenges\n•\nWe expect demand for medium-duty and heavy-duty trucks in North America to remain weak in the fourth quarter of 2025.\n•\nIncreases in costs, tariffs, as well as other inflationary pressures, could negatively impact earnings.\n•\nThe potential for trade disruption, including embargoes, sanctions and export controls, such as China’s restriction on the export of rare earth minerals and related components, could cause production disruptions and negatively impact earnings.\nCurrent Regulatory Challenges For 2025 and Beyond\n•\nChanges in government policies (such as reduced incentives, delayed infrastructure mandates, or revised emissions standards) may impact Accelera’s ability to compete, scale, or recover investments in zero-emission technologies. The reduction of government incentives in the US to support the adoption of hydrogen fuel, along with slower than expected market development in some international markets, has contributed to lower expectations for demand for our electrolyzer products. In the third quarter, we recorded non-cash charges for goodwill impairment and inventory write-downs related to the \n49\nTable of Conten\nt\ns\nelectrolyzer business. Due to the significantly weaker prospects for demand, management is actively pursuing a strategic review of the business, which may result in additional charges in future periods.\n•\nOur engines are subject to extensive statutory and regulatory requirements governing emissions, including greenhouse gas (GHG) standards set by the EPA and fuel consumption standards set by the National Highway Traffic Safety Administration (NHTSA). To comply with these regulations, we utilize banking and trading of regulatory compliance credits. In June 2025, NHTSA published an interpretive rule questioning the current regulatory framework of allowing credits as a compliance vehicle. In July 2025, the EPA published a proposed rule that would repeal GHG emissions standards and thus remove the requirement for vehicle and engine manufacturers to measure, control and report these emissions from vehicles. If both regulatory agencies finalize their indicated proposals, we will no longer utilize emission compliance credits on future engines sales and the credits would have minimal, if any, value to us. While the rules will likely be subject to legal challenges, in the period the rule is finalized, we could be required to incur a non-cash expense up to the value of our existing credits, which was $149 million at September 30, 2025.\n•\nThe prevailing regulatory landscape has created uncertainty regarding the future of the North American emissions regulations for 2027.\nLIQUIDITY AND CAPITAL RESOURCES\nKey Working Capital and Balance Sheet Data \nWe fund our working capital with cash from operations and short-term borrowings, including commercial paper, when necessary. Various assets and liabilities, including short-term debt, can fluctuate significantly from month-to-month depending on short-term liquidity needs. As a result, working capital is a prime focus of management's attention. Working capital and balance sheet measures are provided in the following table: \nDollars in millions\nSeptember 30,\n2025\nDecember 31,\n2024\nWorking capital \n(1)\n$\n7,266\n \n$\n3,518 \nCurrent ratio\n1.77\n \n1.31 \nAccounts and notes receivable, net\n$\n5,640\n \n$\n5,181 \nDays' sales in receivables\n59\n \n58 \nInventories\n$\n6,256\n \n$\n5,742 \nInventory turnover\n4.0\n \n4.4 \nAccounts payable (principally trade)\n$\n3,819\n \n$\n3,951 \nDays' payable outstanding\n57\n \n60 \nTotal debt\n$\n7,614\n \n$\n7,059 \nTotal debt as a percent of total capital\n36.8\n \n%\n38.4 \n%\n (1)  \nWorking capital included cash and cash equivalents.\nCash Flows\nCash and cash equivalents were impacted as follows:\nNine months ended\n \nSeptember 30,\n \nIn millions\n2025\n2024\nChange\nNet cash provided by operating activities\n$\n2,087\n \n$\n65 \n$\n2,022 \nNet cash used in investing activities\n(846)\n(1,069)\n223 \nNet cash (used in) provided by financing activities \n(403)\n564 \n(967)\nEffect of exchange rate changes on cash and cash equivalents\n57\n \n(6)\n63 \nNet increase (decrease) in cash and cash equivalents\n$\n895\n \n$\n(446)\n$\n1,341 \nNet cash provided by operating activities increased $2.0 billion for the nine months ended September 30, 2025, versus the comparable period in 2024, primarily due to lower working capital requirements of $1.6 billion. The lower working capital requirements resulted in a cash outflow of $1.4 billion compared to a cash outflow of $3.0 billion in the comparable period of 2024, mainly due to $1.9 billion of payments in 2024 required by the Settlement Agreements, partially offset by unfavorable changes in accounts and notes \n50\nTable of Conten\nt\ns\nreceivable. See NOTE 11, \"COMMITMENTS AND CONTINGENCIES,\" to our \nCondensed Consolidated Financial Statements\n for additional information on the Settlement Agreements.\nNet cash used in investing activities decreased $223 million for the nine months ended September 30, 2025, versus the comparable period in 2024, primarily due to the absence of cash associated with the Atmus divestiture and lower investments in and net advances to equity investees.\nNet cash used in financing activities increased $967 million for the nine months ended September 30, 2025, versus the comparable period in 2024, primarily due to increased net payments of commercial paper of $1.0 billion and lower proceeds from borrowings of $391 million, partially offset by lower payments on borrowings and finance lease obligations of $559 million (largely related to early payments of $1.1 billion on our term loan, due 2025, during 2024, partially offset by repayment of $500 million of our senior notes in 2025).\nThe effect of exchange rate changes on cash and cash equivalents for the nine months ended September 30, 2025, versus the comparable period in 2024, improved $63 million primarily due to favorable fluctuations in the Euro, British pound and Brazilian real.\nSources of Liquidity\nWe typically generate significant ongoing cash flow and cash provided by operations is generally our principal source of liquidity. Our sources of liquidity include the following:\nSeptember 30, 2025\nIn millions\nTotal\nU.S.\nInternational\nPrimary location of international balances\nCash and cash equivalents\n$\n2,566\n \n$\n975\n \n$\n1,591\n \nSingapore, United Kingdom, China, Australia, Belgium, Mexico, India and France \nMarketable securities \n(1)\n593\n \n73\n \n520\n \nIndia\nTotal\n$\n3,159\n \n$\n1,048\n \n$\n2,111\n \nAvailable credit capacity\nRevolving credit facilities \n(2)\n$\n3,647\n \nInternational and other uncommitted domestic credit facilities\n$\n807\n \n(1)  \nThe majority of marketable securities could be liquidated into cash within a few days. \n(2)  \nThe 5-year credit facility for $2.0 billion and the 3-year credit facility for $2.0 billion, maturing June 2030 and June 2028, respectively, are maintained primarily to provide backup liquidity for our commercial paper borrowings and general corporate purposes. At September 30, 2025, we had $353 million of commercial paper outstanding, which effectively reduced our available capacity under our revolving credit facilities to $3.6 billion.\nCash, Cash Equivalents and Marketable Securities\nA significant portion of our cash flow is generated outside the U.S. We manage our worldwide cash requirements considering available funds among the many subsidiaries through which we conduct our business and the cost effectiveness with which those funds can be accessed. As a result, we do not anticipate any local liquidity restrictions to preclude us from funding our operating needs with local resources. \nIf we distribute our foreign cash balances to the U.S. or to other foreign subsidiaries, we could be required to accrue and pay withholding taxes, for example, if we repatriated cash from certain foreign subsidiaries whose earnings we asserted are completely or partially permanently reinvested. Foreign earnings for which we assert permanent reinvestment outside the U.S. consist primarily of earnings of our China, India, Canada (including underlying subsidiaries) and Netherlands domiciled subsidiaries. At present, we do not foresee a need to repatriate any earnings for which we assert permanent reinvestment. However, to help fund cash needs of the U.S. or other international subsidiaries as they arise, we repatriate available cash from certain foreign subsidiaries whose earnings are not completely permanently reinvested when cost effective to do so.\n51\nTable of Conten\nt\ns\nDebt Facilities and Other Sources of Liquidity\nOn June 2, 2025, we entered into an amended and restated 5-year credit agreement that allows us to borrow up to $2.0 billion of unsecured funds at any time prior to June 2, 2030. The credit agreement amended and restated the prior $2.0 billion 5-year credit agreement that would have matured on June 3, 2029.\nOn June 2, 2025, we entered into a new 3-year credit agreement that allows us to borrow up to $2.0 billion of unsecured funds at any time prior to June 2, 2028. The credit agreement replaced the prior $2.0 billion 364-day credit facility that matured on June 2, 2025.\nOur committed credit facilities provide access up to $4.0 billion from our $2.0 billion 3-year credit facility that expires on June 2, 2028 and our $2.0 billion 5-year facility that expires on June 2, 2030. These revolving credit facilities are maintained primarily to provide backup liquidity for our commercial paper borrowings and general corporate purposes. We intend to maintain credit facilities at the current or higher aggregate amounts by renewing or replacing these facilities at or before expiration. There were no outstanding borrowings under these facilities at September 30, 2025.\nOur committed credit facilities also provide access up to $4.0 billion of unsecured, short-term promissory notes (commercial paper) pursuant to the Board authorized commercial paper programs. These programs facilitate the private placement of unsecured short-term debt through third-party brokers. We intend to use the net proceeds from the commercial paper borrowings for general corporate purposes. The total combined borrowing capacity under the revolving credit facilities and commercial paper programs should not exceed $4.0 billion. At September 30, 2025, we had $353 million of commercial paper outstanding, which effectively reduced our available capacity under our revolving credit facilities to $3.6 billion. See NOTE 9, \"DEBT,\" to our \nCondensed Consolidated Financial Statements\n for additional information.\nAs a well-known seasoned issuer, we filed an automatic shelf registration for an undetermined amount of debt and equity securities with the Securities and Exchange Commission on February 13, 2025. Under this shelf registration we may offer, from time-to-time, debt securities, common stock, preferred and preference stock, depositary shares, warrants, stock purchase contracts and stock purchase units. \nSupply Chain Financing \nWe currently have supply chain financing programs with financial intermediaries, which provide certain vendors the option to be paid by financial intermediaries earlier than the due date on the applicable invoice. When a vendor utilizes the program and receives an early payment from a financial intermediary, they take a discount on the invoice. We then pay the financial intermediary the face amount of the invoice on the original due date, which generally have 60 to 90 day payment terms. The maximum amount that we could have outstanding under these programs was $569 million at September 30, 2025. We do not reimburse vendors for any costs they incur for participation in the program, their participation is completely voluntary and there are no assets pledged as security or other forms of guarantees provided for the committed payment to the finance provider or intermediary. As a result, all amounts owed to the financial intermediaries are presented as accounts payable in our \nCondensed Consolidated Balance Sheets\n. Amounts due to the financial intermediaries reflected in accounts payable at September 30, 2025, were $139 million.\nAccounts Receivable Sales Program \nIn May 2024, we entered into an accounts receivable sales agreement with Wells Fargo Bank, N.A., to sell certain accounts receivable up to the Board approved limit of $500 million. There was no activity under the program during the nine months ended September 30, 2025. See NOTE 1, \"NATURE OF OPERATIONS AND BASIS OF PRESENTATION,\" to our \nCondensed Consolidated Financial Statements\n for additional information.\nUses of Cash \nDividends \nWe paid dividends of $778 million during the nine months ended September 30, 2025. In July 2025, the Board authorized an increase to our quarterly dividend of approximately 10 percent from $1.82 per share to $2.00 per share.\nCapital Expenditures\nCapital expenditures for the nine months ended September 30, 2025, were $691 million versus $668 million in the comparable period in 2024. We continue to invest in new product lines and targeted capacity expansions. We plan to spend an estimated $1.2 billion to $1.3 billion in 2025 on capital expenditures with over 65 percent of these expenditures expected to be invested in North America.\nDebt Payments\nIn September 2025, we repaid our $500 million 0.75 percent senior notes, due in 2025, using cash on hand. See NOTE 9, “DEBT,” to our \nCondensed Consolidated Financial Statements \nfor additional information.\n52\nTable of Conten\nt\ns\nCurrent Maturities of Short and Long-Term Debt\nWe had $353 million of commercial paper outstanding at September 30, 2025, that matures in less than one year. Required annual long-term debt principal payments range from $71 million to $607 million over the next five years (including the remainder of 2025). We intend to retain our strong investment credit ratings. See NOTE 9, \"DEBT,\" to our \nCondensed Consolidated Financial Statements\n for additional information.\nPensions\nOur global pension plans, including our unfunded and non-qualified plans, were 115 percent funded at December 31, 2024. Our U.S. defined benefit plans (qualified and non-qualified), which represented approximately 70 percent of the worldwide pension obligation, were 117 percent funded, and our U.K. defined benefit plans were 109 percent funded at December 31, 2024. The funded status of our pension plans is dependent upon a variety of variables and assumptions including return on invested assets, market interest rates and levels of voluntary contributions to the plans. In the first nine months of 2025, the investment gain on our U.S. pension trusts was 7.9 percent, while our U.K. pension trusts' loss was 1.8 percent. We anticipate making additional defined benefit pension contributions during the remainder of 2025 of $10 million for our U.S. and U.K. qualified and non-qualified pension plans. These contributions may be made from trusts or company funds either to increase pension assets or to make direct benefit payments to plan participants. We expect our 2025 annual net periodic pension cost to approximate $79 million. \nStock Repurchases \nIn December 2021, the Board authorized the acquisition of up to $2.0 billion of additional common stock upon completion of the $2.0 billion repurchase plan authorized in 2019. We did not make any repurchases of common stock in the first nine months of 2025. The dollar value remaining available for future purchases under the 2019 program at September 30, 2025, was $218 million.\nAmplify Cell Technologies LLC Joint Venture\nAs of September 30, 2025, we contributed $255 million to our Amplify Cell Technologies LLC joint venture and our maximum remaining required contribution was $551 million, which could be reduced by future government incentives received by the joint venture. The majority of the contribution is expected to be made by the end of 2028. See NOTE 4, \"EQUITY, ROYALTY AND INTEREST INCOME FROM INVESTEES,\" to our \nCondensed Consolidated Financial Statements\n for additional information.\nCredit Ratings \nOur rating and outlook from each of the credit rating agencies as of the date of filing are shown in the table below: \nLong-Term\nShort-Term\nCredit Rating Agency \n(1)\n \nSenior Debt Rating\nDebt Rating\nOutlook\nStandard and Poor’s Rating Services\n \nA\nA1\nStable\nMoody’s Investors Service, Inc.\n \nA2\nP1\nStable\n(1) \nCredit ratings are not recommendations to buy, are subject to change, and each rating should be evaluated independently of any other rating. In addition, we undertake no obligation to update disclosures concerning our credit ratings, whether as a result of new information, future events or otherwise.\nManagement's Assessment of Liquidity\nOur financial condition and liquidity remain strong. Our solid balance sheet and credit ratings enable us to have ready access to credit and the capital markets. We assess our liquidity in terms of our ability to generate adequate cash to fund our operating, investing and financing activities in combination with access to our revolving credit facilities and commercial paper programs as noted above. We believe our access to the capital markets, our existing cash and marketable securities, operating cash flow and revolving credit facilities provide us with the financial flexibility needed to fund targeted capital expenditures, dividend payments, debt service obligations, projected pension obligations, common stock repurchases, joint venture contributions and acquisitions through 2025 and beyond. \nAPPLICATION OF CRITICAL ACCOUNTING ESTIMATES\nA summary of our significant accounting policies is included in \nNOTE 1, “SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES,” of the Notes to the Consolidated Financial Statements of our 2024 Form 10-K\n, which discusses accounting policies that we have selected from acceptable alternatives.\nOur \nCondensed Consolidated Financial Statements\n are prepared in accordance with generally accepted accounting principles that often require management to make judgments, estimates and assumptions regarding uncertainties that affect the reported amounts \n53\nTable of Conten\nt\ns\npresented and disclosed in the financial statements. Management reviews these estimates and assumptions based on historical experience, changes in business conditions and other relevant factors they believe to be reasonable under the circumstances. In any given reporting period, our actual results may differ from the estimates and assumptions used in preparing our \nCondensed Consolidated Financial Statements.\nCritical accounting estimates are defined as follows: the estimate requires management to make assumptions about matters that were highly uncertain at the time the estimate was made; different estimates reasonably could have been used; or if changes in the estimate are reasonably likely to occur from period to period and the change would have a material impact on our financial condition or results of operations. Our senior management has discussed the development and selection of our accounting policies, related accounting estimates and the disclosures set forth below with the Audit Committee of the Board. Our critical accounting estimates disclosed in the \nForm 10-K\n address estimating liabilities for warranty programs, fair value of intangible assets, assessing goodwill impairment, accounting for income taxes and pension benefits.\nA discussion of our critical accounting estimates may be found in the \n“Management’s Discussion and Analysis” section of our 2024 Form 10-K under the caption “APPLICATION OF CRITICAL ACCOUNTING ESTIMATES.\n” Within the context of these critical accounting estimates, we are not currently aware of any reasonably likely events or circumstances that would result in different policies or estimates being reported in the first nine months of 2025, other than the impairment of goodwill in our electrolyzer reporting unit in the Accelera segment. See NOTE 14, “GOODWILL IMPAIRMENT AND INVENTORY WRITE-DOWN,” to our \nCondensed Consolidated Financial Statements \nfor additional information.\nRECENTLY ISSUED ACCOUNTING PRONOUNCEMENTS\nSee NOTE 17, \"RECENTLY ISSUED ACCOUNTING PRONOUNCEMENTS,\" in the \nNotes to our Condensed Consolidated Financial Statements \nfor additional information."
}