{
  "source_file": "cms-20241231.htm",
  "form_type": "10-K",
  "item1": "Item 1.    Business\nGeneral\nCMS Energy\nCMS Energy was formed as a corporation in Michigan in 1987 and is an energy company operating primarily in Michigan. It is the parent holding company of several subsidiaries, including Consumers, an electric and gas utility, and NorthStar Clean Energy, primarily a domestic independent power producer and marketer. Consumers’ customer base consists of a mix of primarily residential, commercial, and diversified industrial customers. NorthStar Clean Energy, through its subsidiaries and equity investments, is engaged in domestic independent power production, including the development and operation of renewable generation, and the marketing of independent power production.\nCMS Energy manages its businesses by the nature of services each provides, and operates principally in three business segments: electric utility; gas utility; and NorthStar Clean Energy, its non‑utility operations and investments. Consumers’ consolidated operations account for the substantial majority of CMS Energy’s total assets, income, and operating revenue. CMS Energy’s consolidated operating revenue was $7.5 billion in 2024 and 2023, and $8.6 billion in 2022.\nFor further information about operating revenue, income, and assets and liabilities attributable to all of CMS Energy’s business segments and operations, see Item 8. Financial Statements and Supplementary Data—CMS Energy Consolidated Financial Statements and Notes to the Consolidated Financial Statements.\nConsumers\nConsumers has served Michigan customers since 1886. Consumers was incorporated in Maine in 1910 and became a Michigan corporation in 1968. Consumers owns and operates electric generation and distribution facilities and gas transmission, storage, and distribution facilities. It provides electricity and/or natural gas to 6.8 million of Michigan’s 10 million residents. Consumers’ rates and certain other aspects of its business are subject to the jurisdiction of the MPSC and FERC, as well as to NERC reliability standards, as described in CMS Energy and Consumers Regulation.\nConsumers’ consolidated operating revenue was $7.2 billion in 2024 and 2023, and $8.2 billion in 2022. For further information about operating revenue, income, and assets and liabilities attributable to Consumers’ electric and gas utility operations, see Item 8. Financial Statements and Supplementary Data—Consumers Consolidated Financial Statements and Notes to the Consolidated Financial Statements.\nConsumers owns its principal properties in fee, except that most electric lines, gas mains, and renewable generation projects are located below or adjacent to public roads or on land owned by others and are accessed by Consumers through easements, leases, and other rights. Almost all of Consumers’ properties are subject to the lien of its First Mortgage Bond Indenture. For additional information on Consumers’ properties, see Business Segments—Consumers Electric Utility—Electric Utility Properties and Consumers Gas Utility—Gas Utility Properties.\n17\nTable of Contents\nIn 2024, Consumers served 1.9 million electric customers and 1.8 million gas customers in Michigan’s Lower Peninsula. Presented in the following map are Consumers’ service territories:\nElectric service territory\nGas service territory\nCombination electric and gas service territory\nCMS Energy and Consumers—The Triple Bottom Line\nFor information regarding CMS Energy’s and Consumers’ purpose and impact on the “triple bottom line” of people, planet, and prosperity, see Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations—Executive Overview.\nBusiness Segments\nConsumers Electric Utility\nElectric Utility Operations:\n Consumers’ electric utility operations, which include the generation, purchase, distribution, and sale of electricity, generated operating revenue of $5.1 billion in 2024, $4.7 billion in 2023, and $5.4 billion in 2022. Consumers’ electric utility customer base consists of a mix of primarily residential, commercial, and diversified industrial customers in Michigan’s Lower Peninsula.\n18\nTable of Contents\nPresented in the following illustration is Consumers’ 2024 electric utility operating revenue of $5.1 billion by customer class:\nConsumers’ electric utility operations are not dependent on a single customer, or even a few customers, and the loss of any one or even a few of Consumers’ largest customers is not reasonably likely to have a material adverse effect on Consumers’ financial condition.\nIn 2024, Consumers’ electric deliveries were 37 billion kWh, which included ROA deliveries of four billion kWh, resulting in net bundled sales of 33 billion kWh. In 2023, Consumers’ electric deliveries were 36 billion kWh, which included ROA deliveries of three billion kWh, resulting in net bundled sales of 33 billion kWh.\nConsumers’ electric utility operations are seasonal. The consumption of electric energy typically increases in the summer months, due primarily to the use of air conditioners and other cooling equipment.\n19\nTable of Contents\nPresented in the following illustration are Consumers’ monthly weather-normalized electric deliveries (deliveries adjusted to reflect normal weather conditions) to its customers, including ROA deliveries, during 2024 and 2023: \nConsumers’ 2024 summer peak demand was 8,030 MW, which included ROA demand of 603 MW. For the 2023-2024 winter season, Consumers’ peak demand was 5,594 MW, which included ROA demand of 410 MW. As required by MISO reserve margin requirements, Consumers owns or controls, through long-term PPAs, short-term capacity purchases, and auction capacity purchases, all of the capacity required to supply its projected firm peak load and necessary reserve margin for summer 2025.\nElectric Utility Properties:\n Consumers owns and operates electric generation and distribution facilities. For details about Consumers’ electric generation facilities, see the Electric Utility Generation and Supply Mix section that follows this Electric Utility Properties section. Consumers’ distribution system consists of:\n•\n270 miles of high-voltage distribution overhead lines operating at 138 kV\n•\nfour miles of high-voltage distribution underground lines operating at 138 kV\n•\n4,646 miles of high-voltage distribution overhead lines operating at 46 kV and 69 kV\n•\n18 miles of high-voltage distribution underground lines operating at 46 kV\n•\n81,924 miles of electric distribution overhead lines\n•\n9,775 miles of underground distribution lines\n•\n1,098 substations with an aggregate transformer capacity of 28 million kVA\nConsumers is interconnected to the interstate high-voltage electric transmission system owned by METC and operated by MISO. Consumers is also interconnected to neighboring utilities and to other transmission systems.\nElectric Utility Generation and Supply Mix:\n Consumers’ Clean Energy Plan details its strategy to meet customers’ long-term energy needs. The Clean Energy Plan was most recently revised and approved by the MPSC in 2022. Under Michigan’s integrated resource planning process, Consumers will file updates \n20\nTable of Contents\nto its Clean Energy Plan in 2026. Together with updates to its renewable energy plan that Consumers filed in November 2024, these updated plans will serve as Consumers’ blueprint to meeting the requirements of the 2023 Energy Law that was enacted in Michigan in November 2023. \nUnder its Clean Energy Plan, Consumers will eliminate the use of coal in owned generation in 2025. Specifically, Consumers retired the D.E. Karn coal-fueled generating units in June 2023 and plans to retire the J.H. Campbell coal-fueled generating units in 2025. In order to continue providing controllable sources of electricity to customers while expanding its investment in renewable energy, Consumers purchased the Covert Generating Station, a natural gas-fueled generating facility with 1,200 MW of nameplate capacity, in May 2023. Consumers has also contracted to purchase 400 MW of capacity from battery storage facilities, which will be located in Michigan’s Lower Peninsula and are expected to be operational by 2027.\nIn November 2024, Consumers filed updates to its renewable energy plan, proposing an addition of up to 9,000 MW of both purchased and owned solar energy resources and up to 2,800 MW of new, competitively bid wind capacity. These actions will enable Consumers to achieve 60 percent renewable energy by 2035 and 100 percent clean energy by 2040. For further information on Consumers’ progress towards reducing carbon emissions and towards meeting the requirements of the 2023 Energy Law, see Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations—Executive Overview and Outlook—Consumers Electric Utility Outlook and Uncertainties.\n21\nTable of Contents\nPresented in the following table are details about Consumers’ 2024 electric generation and supply mix:\nName and Location (Michigan)\nNumber of Units and Year Entered Service\n2024\nGeneration Capacity\n(MW)\n1\n2024\nElectric Supply\n(GWh)\nCoal steam generation\nJ.H. Campbell 1 & 2 – West Olive\n2\n2 Units, 1962-1967\n540 \n2,718 \nJ.H. Campbell 3 – West Olive\n2,3\n1 Unit, 1980\n791 \n5,214 \n1,331 \n7,932 \nOil/Gas steam generation\nD.E. Karn 3 & 4 – Essexville\n2 Units, 1975-1977\n1,200 \n96 \nHydroelectric\nLudington – Ludington\n6 Units, 1973\n1,112 \n4\n(458)\n5\nConventional hydro generation\n35 Units, 1906-1949\n75 \n366 \n1,187 \n(92)\nGas combined cycle\nCovert Generating Station – Covert\n3 Units, 2004\n1,089 \n7,159 \nJackson – Jackson\n1 Unit, 2002\n534 \n2,001 \nZeeland – Zeeland\n3 Units, 2002\n520 \n3,963 \n2,143 \n13,123 \nGas combustion turbines\nZeeland (simple cycle) – Zeeland\n2 Units, 2001\n314 \n1,733 \nWind generation\nCrescent Wind Farm – Hillsdale County\n2021\n150 \n369 \nCross Winds\n®\n Energy Park – Tuscola County\n2014-2019\n232 \n721 \nGratiot Farms Wind Project – Gratiot County\n2020\n150 \n364 \nHeartland Farms Wind Project – Gratiot County\n2023\n200 \n432 \nLake Winds\n®\n Energy Park – Mason County\n2012\n101 \n262 \n833 \n2,148 \nSolar generation\nSolar Gardens – Allendale, Cadillac, and Kalamazoo\n2016-2021\n5 \n7 \nBattery storage capacity\nBatteries – Grand Rapids, Cadillac, Kalamazoo, and Standish\n4 Units, 2021-2022\n3 \n— \nTotal owned generation\n7,016 \n24,947 \nPurchased power\n6\nCoal generation – T.E.S. Filer City\n63 \n230 \nGas generation – MCV Facility\n7\n1,240 \n8,440 \nOther gas generation\n153 \n1,222 \nWind generation\n384 \n996 \nSolar generation\n803 \n1,152 \nOther renewable generation\n194 \n990 \n2,837 \n13,030 \nNet interchange power\n8\n— \n(2,715)\nTotal purchased and interchange power\n2,837 \n10,315 \nTotal supply\n9,853 \n35,262 \nLess distribution and transmission loss\n2,065 \nTotal net bundled sales\n33,197 \n1\nWith the exception of wind and solar generation, the amount represents generation capacity during the summer months (planning year 2024 capacity as reported to MISO and limited by interconnection service limits). For wind and solar generation, the amount represents installed capacity during the summer months.\n22\nTable of Contents\n2\nConsumers plans to retire these generating units in 2025. \n3\nRepresents Consumers’ share of the capacity of the J.H. Campbell 3 unit, net of the 6.69‑percent ownership interest of the Michigan Public Power Agency and Wolverine Power Supply Cooperative, Inc, each a non\n‑\naffiliated company.\n4\nRepresents Consumers’ 51‑percent share of the capacity of Ludington. DTE Electric holds the remaining 49‑percent ownership interest.\n5\nRepresents Consumers’ share of net pumped-storage generation. The pumped-storage facility consumes electricity to pump water during off-peak hours for storage in order to generate electricity later during peak‑demand hours.\n6\nRepresents purchases under long-term PPAs.\n7\nFor information about Consumers’ long-term PPA related to the MCV Facility, see Item 8. Financial Statements and Supplementary Data—Notes to the Consolidated Financial Statements—Note 3, Contingencies and Commitments—Contractual Commitments.\n8\nRepresents the net amount of generation offered to and purchased from the MISO energy market. \n23\nTable of Contents\nPresented in the following table are the sources of Consumers’ electric supply for the last three years:\nGWh\nYears Ended December 31\n2024\n2023\n2022\nOwned generation\nGas\n14,856 \n11,221 \n6,684 \nCoal\n7,932 \n6,884 \n10,217 \nRenewable energy\n2,521 \n1,993 \n2,217 \nOil\n96 \n2 \n4 \nNet pumped storage\n1\n(458)\n(349)\n(370)\nTotal owned generation\n24,947 \n19,751 \n18,752 \nPurchased power\n2\nGas generation\n9,662 \n7,244 \n7,182 \nRenewable energy generation\n3,138 \n2,585 \n2,441 \nCoal generation\n230 \n318 \n500 \nNuclear generation\n3\n— \n— \n2,692 \nNet interchange power\n4\n(2,715)\n4,532 \n3,943 \nTotal purchased and interchange power\n10,315 \n14,679 \n16,758 \nTotal supply\n35,262 \n34,430 \n35,510 \n1\nRepresents Consumers’ share of net pumped-storage generation. During 2024, the pumped-storage facility consumed 1,721 GWh of electricity to pump water during off-peak hours for storage in order to generate 1,263 GWh of electricity later during peak-demand hours.\n2\nRepresents purchases under long-term PPAs.\n3\nRepresents purchases from a nuclear generating facility that closed in May 2022.\n4\nRepresents the net amount of generation offered to and purchased from the MISO energy market. \nDuring 2024, 42 percent of the electric energy Consumers provided to customers was generated by its natural gas‑fueled generating units, which burned 107 Bcf of natural gas and produced a combined total of 14,856 GWh of electricity.\nIn order to obtain the gas it needs for electric generation fuel, Consumers’ electric utility purchases gas from the market near the time of consumption, at prices that allow it to compete in the electric wholesale market. For the Covert Generating Station and Jackson and Zeeland plants, Consumers utilizes an agent that owns firm transportation rights to each plant to purchase gas from the market and transport the gas to the facilities. For units 3 & 4 of D.E. Karn, Consumers holds gas transportation contracts to transport to the plant gas that Consumers or an agent purchase from the market.\nDuring 2024, Consumers acquired 29 percent of the electricity it provided to customers through long-term PPAs and the MISO energy market. Consumers offers its generation into the MISO energy market on a day-ahead and real-time basis and bids for power in the market to serve the demand of its customers. Consumers supplements its generation capability with purchases from the MISO energy market.\nAt December 31, 2024, Consumers had future commitments to purchase capacity and energy under long-term PPAs with various generating plants. These contracts require monthly capacity payments based on the plants’ availability or deliverability. The payments for 2025 through 2047 are estimated to total $7.0 billion and, for each of the next five years, $0.7 billion annually. These amounts may vary depending \n24\nTable of Contents\non plant availability and fuel costs. For further information about Consumers’ future capacity and energy purchase obligations, see Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations—Capital Resources and Liquidity—Other Material Cash Requirements and Item 8. Financial Statements and Supplementary Data—Notes to the Consolidated Financial Statements—Note 3, Contingencies and Commitments—Contractual Commitments.\nDuring 2024, 22 percent of the electric energy Consumers provided to customers was generated by its coal-fueled generating units, which burned four million tons of coal and produced a combined total of 7,932 GWh of electricity. In order to obtain the coal it needs, Consumers enters into physical coal supply contracts.\nAt December 31, 2024, Consumers had future commitments to purchase coal during 2025 until the retirement of its last coal generating unit; payment obligations under these contracts totaled $24 million. Most of Consumers’ rail-supplied coal contracts have fixed prices, although some contain market-based pricing. At December 31, 2024, Consumers had 100 percent of its remaining 2025 expected coal requirements under contract, as well as a 20\n‑\nday supply of coal on hand.\nIn conjunction with its coal supply contracts, Consumers leases a fleet of railcars and has transportation contracts with various companies to provide rail services for delivery of purchased coal to Consumers’ generating facilities. Consumers’ coal transportation contracts are future commitments and expire on various dates through 2025; payment obligations under these contracts totaled $65 million at December 31, 2024.\nElectric Utility Competition:\n Consumers’ electric utility business is subject to actual and potential competition from many sources, in both the wholesale and retail markets, as well as in electric generation, electric delivery, and retail services.\nMichigan law allows electric customers in Consumers’ service territory to buy electric generation service from alternative electric suppliers in an aggregate amount capped at ten percent of Consumers’ sales, with certain exceptions. At December 31, 2024, electric deliveries under the ROA program were at the ten‑percent limit. Fewer than 300 of Consumers’ electric customers purchased electric generation service under the ROA program. For additional information, see Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations—Outlook—Consumers Electric Utility Outlook and Uncertainties.\nConsumers also faces competition or potential competition associated with industrial customers relocating all or a portion of their production capacity outside of Consumers’ service territory for economic reasons; municipalities owning or operating competing electric delivery systems; and customer self-generation. Consumers addresses this competition in various ways, including:\n•\naggressively controlling operating, maintenance, power supply, and fuel costs and passing savings on to customers\n•\nproviding renewable energy options and energy waste reduction programs\n•\nproviding competitive rate-design options, particularly for large energy-intensive customers\n•\noffering tariff-based incentives that support economic development\n•\nmonitoring activity in adjacent geographical areas\n25\nTable of Contents\nConsumers Gas Utility\nGas Utility Operations:\n Consumers’ gas utility operations, which include the purchase, transmission, storage, distribution, and sale of natural gas, generated operating revenue of $2.1 billion in 2024, $2.4 billion in 2023, and $2.7 billion in 2022. Consumers’ gas utility customer base consists of a mix of primarily residential, commercial, and diversified industrial customers in Michigan’s Lower Peninsula.\nPresented in the following illustration is Consumers’ 2024 gas utility operating revenue of $2.1 billion by customer class: \nConsumers’ gas utility operations are not dependent on a single customer, or even a few customers, and the loss of any one or even a few of Consumers’ largest customers is not reasonably likely to have a material adverse effect on Consumers’ financial condition.\nIn 2024, deliveries of natural gas through Consumers’ pipeline and distribution network, including off-system transportation deliveries, totaled 362 Bcf, which included GCC deliveries of 27 Bcf. In 2023, deliveries of natural gas through Consumers’ pipeline and distribution network, including off-system transportation deliveries, totaled 375 Bcf, which included GCC deliveries of 31 Bcf. Consumers’ gas utility operations are seasonal. The consumption of natural gas increases in the winter, due primarily to colder temperatures and the resulting use of natural gas as heating fuel. Consumers injects natural gas into storage during the summer months for use during the winter months. During 2024, 47 percent of the natural gas supplied to all customers during the winter months was supplied from storage.\n26\nTable of Contents\nPresented in the following illustration are Consumers’ monthly weather-normalized natural gas deliveries (deliveries adjusted to reflect normal weather conditions) to its customers, including GCC deliveries, during 2024 and 2023:\nGas Utility Properties:\n Consumers’ gas transmission, storage, and distribution system consists of:\n•\n2,342 miles of transmission lines\n•\n15 gas storage fields with a total storage capacity of 309 Bcf and a working gas volume of 154 Bcf\n•\n28,368 miles of distribution mains\n•\neight compressor stations with a total of 153,393 installed and available horsepower\nUnder its Methane Reduction Plan, Consumers has set a goal of net-zero methane emissions from its natural gas delivery system by 2030. Consumers plans to reduce methane emissions from its system by about 80 percent, from 2012 baseline levels, by accelerating the replacement of aging pipe, rehabilitating or retiring outdated infrastructure, and adopting new technologies and practices. The remaining emissions will likely be offset by purchasing and/or producing renewable natural gas. For further information on Consumers’ progress towards its net-zero methane emissions goal, see Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations—Executive Overview.\n27\nTable of Contents\nGas Utility Supply:\n In 2024, Consumers purchased 85 percent of the gas it delivered to its full-service sales customers. The remaining 15 percent was purchased from authorized GCC suppliers and delivered by Consumers to customers in the GCC program. Presented in the following illustration are the supply arrangements for the gas Consumers delivered to GCC and GCR customers during 2024:\nFirm city-gate and firm gas transportation contracts are those that define a fixed amount, price, and delivery time frame. Consumers’ firm gas transportation contracts are with Panhandle Eastern Pipe Line Company and Trunkline Gas Company, LLC, each a non‑affiliated company. Under these contracts, Consumers purchases and transports gas to Michigan for ultimate delivery to its customers. Consumers’ firm gas transportation contracts expire on various dates through 2028 with planned contract volumes providing 36 percent of Consumers’ total forecasted gas supply requirements for 2025. Consumers purchases the balance of its required gas supply under firm city-gate contracts and through authorized suppliers under the GCC program.\nGas Utility Competition:\n Competition exists in various aspects of Consumers’ gas utility business. Competition comes from GCC and transportation programs; system bypass opportunities for new and existing customers; and from alternative fuels and energy sources, such as propane, oil, and electricity.\n28\nTable of Contents\nNorthStar Clean Energy—Non-utility Operations and Investments\nNorthStar Clean Energy, through various subsidiaries and certain equity investments, is engaged in domestic independent power production, including the development and operation of renewable generation, and the marketing of independent power production. NorthStar Clean Energy’s operating revenue was $316 million in 2024, $297 million in 2023, and $445 million in 2022.\nIndependent Power Production:\n Presented in the following table is information about the independent power plants in which CMS Energy had an ownership interest at December 31, 2024:\nLocation\nOwnership Interest\n(%)\nPrimary Fuel Type\nGross Capacity\n(MW)\n1\n2024 Net Generation\n(GWh)\nDearborn, Michigan\n100 \nNatural gas\n770 \n5,655 \nJackson County, Arkansas\n100 \nSolar\n180 \n363 \nGaylord, Michigan\n100 \nNatural gas\n134 \n20 \nPaulding County, Ohio\n2\n100 \nWind\n100 \n270 \nComstock, Michigan\n100 \nNatural gas\n76 \n245 \nDelta Township, Michigan\n2\n100 \nSolar\n24 \n40 \nPhillips, Wisconsin\n3\n100 \nSolar\n3 \n4 \nPaulding County, Ohio\n100 \nSolar and storage\n3 \n— \nCoke County, Texas\n51 \nWind\n525 \n1,786 \nFiler City, Michigan\n50 \nCoal\n73 \n230 \nNew Bern, North Carolina\n50 \nWood waste\n50 \n261 \nFlint, Michigan\n50 \nWood waste\n40 \n96 \nGrayling, Michigan\n50 \nWood waste\n38 \n164 \nTotal\n2,016 \n9,134 \n1\nRepresents the intended full-load sustained output of each plant. The amount of capacity relating to CMS Energy’s ownership interest was 1,658 MW and net generation relating to CMS Energy’s ownership interest was 7,883 GWh at December 31, 2024.\n2\nNorthStar Clean Energy has entered into an agreement to sell a noncontrolling interest in this plant in 2025.\n3\nNorthStar Clean Energy has entered into an agreement to sell this plant in 2025. \nThe operating revenue from independent power production was $69 million in 2024, $64 million in 2023, and $58 million in 2022.\nEnergy Resource Management:\n CMS ERM purchases and sells energy commodities in support of NorthStar Clean Energy’s generating facilities with a focus on optimizing the independent power production portfolio. In 2024, CMS ERM marketed one Bcf of natural gas and 7,475 GWh of electricity. Electricity marketed by CMS ERM was generated by independent power production of NorthStar Clean Energy and by unrelated third parties. CMS ERM’s operating revenue was $247 million in 2024, $233 million in 2023, and $387 million in 2022.\nNorthStar Clean Energy Competition:\n NorthStar Clean Energy competes with other energy developers, energy retailers, and independent power producers. The needs of this market are driven by current electric demand and available generation, as well as projections of future electric demand and available generation.\n29\nTable of Contents\nCMS Energy and Consumers Regulation\nCMS Energy, Consumers, and their subsidiaries are subject to regulation by various federal, state, and local governmental agencies, including those described in the following sections. If CMS Energy, Consumers, or their subsidiaries failed to comply with applicable laws and regulations, they could become subject to fines, penalties, or disallowed costs, or be required to implement additional compliance, cleanup, or remediation programs, the cost of which could be material. For more information on the potential impacts of government regulation affecting CMS Energy, Consumers, and their subsidiaries, see Item 1A. Risk Factors, Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations—Outlook, and Item 8. Financial Statements and Supplementary Data—Notes to the Consolidated Financial Statements—Note 2, Regulatory Matters.\nFERC and NERC\nCMS Energy and its affiliates and subsidiaries are subject to regulation by FERC in a number of areas. FERC regulates certain aspects of Consumers’ electric business, including, but not limited to, compliance with FERC accounting rules, wholesale electric and transmission rates, operation of licensed hydroelectric generating plants, corporate mergers and the sale and purchase of certain assets, issuance of securities, and conduct among affiliates. FERC also regulates the tariff rules and procedures administered by MISO and other independent system operators/regional transmission organizations, including rules governing wholesale electric markets and interconnection of new generating facilities to the transmission system. FERC, in connection with NERC and with regional reliability organizations, also regulates generation and transmission owners and operators, load-serving entities, and others with regard to reliability of the bulk power system.\nFERC also regulates limited aspects of Consumers’ gas business, principally compliance with FERC capacity release rules, shipping rules, the prohibition of certain buy/sell transactions, and the price-reporting rule.\nFERC also regulates holding company matters, interlocking directorates, and other issues affecting CMS Energy. In addition, similar to FERC’s regulation of Consumers’ electric and gas businesses, FERC has jurisdiction over several independent power plants, PURPA-qualifying facilities, and exempt wholesale generators in which NorthStar Clean Energy has ownership interests, as well as over NorthStar Clean Energy itself, CMS ERM, CMS Gas Transmission, and DIG.\nMPSC\nConsumers is subject to the jurisdiction of the MPSC, which regulates public utilities in Michigan with respect to retail utility rates, accounting, utility services, certain facilities, certain asset transfers, corporate mergers, and other matters.\nThe Michigan Attorney General, ABATE, the MPSC Staff, residential customer advocacy groups, environmental organizations, and certain other parties typically participate in MPSC proceedings concerning Consumers. These parties often challenge various aspects of those proceedings, including the prudence of Consumers’ policies and practices, and seek cost disallowances and other relief. The parties also have appealed significant MPSC orders.\nRate Proceedings:\n For information regarding open rate proceedings, see Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations—Outlook and Item 8. Financial Statements and Supplementary Data—Notes to the Consolidated Financial Statements—Note 2, Regulatory Matters.\n30\nTable of Contents\nOther Regulation\nThe U.S. Secretary of Energy regulates imports and exports of natural gas and has delegated various aspects of this jurisdiction to FERC and the U.S. Department of Energy’s Office of Fossil Fuels.\nThe U.S. Department of Transportation’s Office of Pipeline Safety regulates the safety and security of gas pipelines through the Natural Gas Pipeline Safety Act of 1968 and subsequent laws.\nThe Transportation Security Administration, an agency of the U.S. Department of Homeland Security, regulates certain activities related to the safety and security of natural gas pipelines.\nEnergy Legislation\nIn November 2023, Michigan enacted the 2023 Energy Law, which among other things:\n•\nraised the renewable energy standard from the present 15\n‑\npercent requirement to 50 percent by 2030 and 60 percent by 2035; renewable energy generated anywhere within MISO can be applied to meeting this standard, with certain limitations\n•\nset a clean energy standard of 80 percent by 2035 and 100 percent by 2040; low- or zero-carbon emitting resources, such as nuclear generation and natural gas generation coupled with carbon capture, are considered clean energy sources under this standard\n•\nauthorized the MPSC to grant extensions of the clean energy or renewable energy standards deadlines if compliance is not practically feasible, would be excessively costly to customers, or would cause reliability issues\n•\nincreased the energy waste reduction requirement for electric utilities to achieve annual reductions in customers’ electricity use from the present one‑percent reduction requirement to 1.5 percent beginning in 2026; beyond this requirement, the law set a goal of a two‑percent reduction and required that such goal be incorporated in an electric utility’s integrated resource plan modeling scenarios\n•\nincreased the energy waste reduction requirement for gas utilities to achieve annual reductions in customers’ gas use from the present 0.75‑percent reduction requirement to 0.875 percent beginning in 2026\n•\nenhanced existing incentives for energy efficiency programs and returns earned on new clean or renewable PPAs\n•\ncreated a new energy storage standard that requires electric utilities to file plans by 2029 to obtain new energy storage that will contribute to a Michigan target of 2,500 MW based on their pro rata share\n•\nexpanded the statutory cap on distributed generation resources to ten percent\n•\nexpanded the MPSC’s scope of considerations in integrated resource plans to include affordability, greenhouse gas emissions, environmental justice considerations, the effects on human health, and other environmental concerns\n•\nprovided the MPSC siting authority over large renewable energy projects\nConsumers filed updates to its renewable energy plan in November 2024 and plans to file updates to its Clean Energy Plan in 2026. Together, these updated plans will serve as Consumers’ blueprint to meeting the requirements of the 2023 Energy Law by focusing on increasing the generation of renewable energy, deploying energy storage, helping customers use less energy, and offering demand response programs to reduce demand during critical peak times.\n31\nTable of Contents\nCMS Energy and Consumers Environmental Strategy and Compliance\nCMS Energy and Consumers are committed to protecting the environment; this commitment extends beyond compliance with applicable laws and regulations. Consumers’ Clean Energy Plan details its long-term strategy for delivering safe, reliable, affordable, clean, and equitable energy to its customers. While Consumers’ existing Clean Energy Plan, established under Michigan’s integrated resource planning process, provides a path towards meeting the requirements of the 2023 Energy Law, Consumers will file updates to the plan in 2026 to expand and solidify that path. Additionally, Consumers filed updates to its renewable energy plan in November 2024 to propose plans to meet the increased renewable energy standard. Together, these plans will enable Consumers to achieve 60 percent renewable energy by 2035 and 100 percent clean energy by 2040 and will also contribute to Consumers’ achievement of its net-zero emissions goals.\nUnder its Methane Reduction Plan, Consumers has set a goal of net-zero methane emissions from its natural gas delivery system by 2030. Consumers plans to reduce methane emissions from its system by about 80 percent, from 2012 baseline levels, by accelerating the replacement of aging pipe, rehabilitating or retiring outdated infrastructure, and adopting new technologies and practices. The remaining emissions will likely be offset by purchasing and/or producing renewable natural gas. For additional information on Consumers’ Methane Reduction Plan, see Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations—Outlook—Consumers Gas Utility Outlook and Uncertainties—Gas Environmental Outlook.\nEncompassing both its electric and gas businesses, Consumers has set a net-zero greenhouse gas emissions target by 2050. This goal incorporates greenhouse gas emissions from Consumers’ natural gas delivery system, including suppliers and customers, and has an interim goal of reducing customer emissions by 25 percent by 2035. Consumers expects to meet this goal through carbon offset measures, renewable natural gas, energy efficiency and demand response programs, and the adoption of cost-effective emerging technologies once proven and commercially available.\nCMS Energy’s and Consumers’ commitment to protecting the environment extends to advancing the principles of environmental justice in current and future operations. These principles center on protecting communities impacted by the companies’ operations, especially those communities that are most vulnerable and may have suffered disparate impacts of environmental harm.\nAdvancing environmental justice comes in a variety of forms. For example, Consumers has conducted an environmental justice analysis to help understand the environmental impacts of its clean energy transformation. Similarly, Consumers is using an environmental justice screening tool provided by the State of Michigan in the planning of improvements to the electric and gas distribution system, including prioritizing investments in more vulnerable communities. \nA core tenet of environmental justice is inviting the input of the stakeholders in the local communities where CMS Energy and Consumers operate and invest. The companies are committed to maintaining a transparent dialogue when developing projects, whether in new or existing areas of operation.\nCMS Energy, Consumers, and their subsidiaries are subject to various federal, state, and local environmental regulations for solid waste management, air and water quality, and other matters. Consumers expects to recover costs to comply with environmental regulations in customer rates but cannot guarantee this result. For additional information concerning environmental matters, see Item 1A. Risk Factors, Item 7. Management’s Discussion and Analysis of Financial Condition and Results of \n32\nTable of Contents\nOperations—Outlook, and Item 8. Financial Statements and Supplementary Data—Notes to the Consolidated Financial Statements—Note 3, Contingencies and Commitments.\nCMS Energy has recorded a $48 million liability for its subsidiaries’ obligations associated with Bay Harbor and Consumers has recorded a $60 million liability for its obligations at a number of former MGP sites. For additional information, see Item 1A. Risk Factors and Item 8. Financial Statements and Supplementary Data—Notes to the Consolidated Financial Statements—Note 3, Contingencies and Commitments.\nCosts related to the construction, operation, corrective action, and closure of solid waste disposal facilities for coal ash are significant. Consumers’ coal ash disposal areas are regulated under Michigan’s solid waste rules and by the EPA’s rules regulating CCRs. To address some of the requirements of these rules, Consumers has converted all of its fly ash handling systems to dry systems. In addition, Consumers’ ash facilities have programs designed to protect the environment and are subject to quarterly EGLE inspections. Consumers’ estimate of capital and cost of removal expenditures to comply with regulations relating to ash disposal is $237 million from 2025 through 2029. Consumers’ future costs to comply with solid waste disposal regulations may vary depending on future legislation, litigation, executive orders, treaties, or rulemaking.\nFor further information concerning estimated capital expenditures related to environmental matters, see Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations—Outlook—Consumers Electric Utility Outlook and Uncertainties—Electric Environmental Outlook.\nInsurance\nCMS Energy and its subsidiaries, including Consumers, maintain insurance coverage generally similar to comparable companies in the same lines of business. The insurance policies are subject to terms, conditions, limitations, and exclusions that might not fully compensate CMS Energy or Consumers for all losses. A portion of each loss is generally assumed by CMS Energy or Consumers in the form of deductibles and self-insured retentions that, in some cases, are substantial. As CMS Energy or Consumers renews its policies, it is possible that some of the present insurance coverage may not be renewed or obtainable on commercially reasonable terms due to restrictive insurance markets.\nHuman Capital\nCMS Energy and Consumers employ a highly trained and skilled workforce comprised of union and non‑union employees. Presented in the following table are the number of employees of CMS Energy and Consumers:\nDecember 31\n2024\n2023\n2022\nCMS Energy, including Consumers\nFull-time and part-time employees\n8,324 \n8,356 \n9,073 \nConsumers\nFull-time and part-time employees\n8,090 \n8,144 \n8,879 \nAt December 31, 2024, unions represented 44 percent of CMS Energy’s employees and 46 percent of Consumers’ employees. The UWUA represents Consumers’ operating, maintenance, construction, and customer contact center employees. The USW represents Zeeland plant employees. The UWUA and USW agreements expire in 2025.\n33\nTable of Contents\nThe safety of co-workers, customers, and the general public is a priority of CMS Energy and Consumers. Accordingly, CMS Energy and Consumers have worked to integrate a set of safety principles into their business operations and culture. These principles include complying with applicable safety, health, and security regulations and implementing programs and processes aimed at continually improving safety and security conditions. On an annual basis, CMS Energy and Consumers set various safety goals tied to the OSHA recordable incident rate and high-risk injuries. The companies’ OSHA recordable incident rate was 1.71 in 2024 and 1.48 in 2023. The target recordable incident rate for 2025 is 1.00, which, if achieved, would place Consumers within the first quartile of its EEI peer group. High-risk injuries encompass all recordable and non-recordable incidents with the potential for serious injury or fatality. In 2024, the companies recorded 11 high-risk injuries, achieving their goal of less than 13 high-risk injuries. \nWithin the utility industry, there is strong competition for rare, high-demand talent, including those related to electric line work, renewable energy generation, technology, and data analytics. In order to address this competition and to be able to meet their human capital needs, CMS Energy and Consumers provide compensation and benefits that are competitive with industry peers. Furthermore, CMS Energy and Consumers have developed a comprehensive talent strategy, the People Strategy, to attract, develop, and retain highly skilled co-workers. The strategy focuses on three areas, which are summarized below. The first two areas listed below focus on creating an environment that attracts and retains top talent and ensuring that all co-workers can thrive and contribute to the companies’ mission and purpose.\n•\nCultivating a Purpose-driven Culture:\n This goal aims to ensure all co-workers understand how their work contributes to CMS Energy’s and Consumers’ key strategic goals. \n•\nCreating a Breakthrough Employee Experience: \nA breakthrough employee experience is one that instills pride and ownership in one’s work. To measure progress toward a breakthrough employee experience, CMS Energy and Consumers assess engagement, empowerment, and diversity, equity, and inclusion efforts using the companies’ culture index. For the year ended December 31, 2024, the companies attained scores of:\n◦\n72 percent positive sentiment for engagement, up 11 percentage points from 2023\n◦\n65 percent positive sentiment for empowerment, up 17 percentage points from 2023\n◦\n73 percent positive sentiment for diversity, equity, and inclusion, up eight percentage points from 2023\nCMS Energy and Consumers aim to continuously improve these scores every year.\n•\nBuilding Skill Sets at Scale: \nWith an overarching goal of ensuring co-workers have the right skills to succeed, CMS Energy and Consumers measure progress in this area through achievement of workforce planning and hiring milestones and through a first-time skill attainment index to evaluate the effectiveness of training. CMS Energy and Consumers develop skill sets in co\n‑\nworkers through a variety of means, including union apprenticeship programs and yearly trainings for newly required skills.\nThis talent strategy allows CMS Energy and Consumers to shape co-workers’ experience and enable leaders to coach and develop co\n‑\nworkers, source talent, and anticipate and adjust to changing skill sets in the business environment.\n34\nTable of Contents\nDiversity, Equity, and Inclusion\nAs a part of their People Strategy, CMS Energy and Consumers employ a broad and holistic diversity, equity, and inclusion strategy focused on embracing differences. The strategy is aimed at integrating principles of equity and inclusion into every process and co\n‑\nworker experience. To measure their success, CMS Energy and Consumers utilize select questions in the annual engagement survey to create a diversity, equity, and inclusion index. For the year ended December 31, 2024, the diversity, equity, and inclusion index score was 73 percent.\nCMS Energy and Consumers are committed to building an inclusive workplace that embraces the diverse makeup of the communities that they serve. The following table presents the composition of CMS Energy’s and Consumers’ workforce:\nDecember 31, 2024\nCMS Energy, including\nConsumers\nConsumers\nPercent female employees\n26 \n%\n26 \n%\nPercent racially or ethnically diverse employees\n14 \n14 \nPercent employees with disabilities\n5 \n5 \nPercent veteran employees\n10 \n10 \nCo\n‑\nworkers are also empowered to engage in business employee resource groups and events that encourage candid conversations around diversity, equity, and inclusion. These activities enhance personal growth, build stronger connections among co-workers, and contribute to a more inclusive workplace. There are seven business employee resource groups available to all co\n‑\nworkers; these groups are:\n•\nWomen in Energy, working toward an inclusive place for all women in the fields they have chosen, from front line to management\n•\nthe Minority Advisory Panel, promoting a culture of diversity and inclusion among all racial and ethnic minorities through education, leadership, development, and networking\n•\nthe Veterans Advisory Panel, supporting former and active military personnel and assisting in recruiting and retaining veterans through career development\n•\nGenergy, a multigenerational group designed to bridge the gap of learning, networking, and mentoring across the generations of the workforce\n•\nthe Pride Alliance of Consumers Energy, promoting an inclusive environment that is safe, supportive, and respectful for lesbian, gay, bi-sexual, and transgender persons and allies\n•\nCapable, aimed at removing barriers and creating pathways to meaningful work for co-workers of all abilities\n•\nInterfaith, a space for co\n‑\nworkers of all backgrounds to gather and celebrate their unique beliefs, creating an environment of understanding and respect for all faiths, religions, and spiritual beliefs, including those with no faith affiliation\n35\nTable of Contents\nInformation About CMS Energy’s and Consumers’ Executive Officers\nPresented in the following table are the company positions held during the last five years for each of CMS Energy’s and Consumers’ executive officers as of February 11, 2025:\nName, Age, Position(s)\nPeriod\nGarrick J. Rochow (age 50)\nCMS Energy\nPresident, CEO, and Director\n12/2020 – Present\nExecutive Vice President\n1/2020 – 12/2020\nConsumers\nPresident, CEO, and Director\n12/2020 – Present\nExecutive Vice President\n1/2020 – 12/2020\nNorthStar Clean Energy\nChairman of the Board, CEO, and Director\n12/2020 – Present\nRejji P. Hayes (age 50)\nCMS Energy\nExecutive Vice President and CFO\n5/2017 – Present\nConsumers\nExecutive Vice President and CFO\n5/2017 – Present\nNorthStar Clean Energy\nExecutive Vice President, CFO, and Director\n5/2017 – 6/2024\nEnerBank\nChairman of the Board and Director\n10/2018 – 10/2021\nTonya L. Berry (age 52)\nCMS Energy\nSenior Vice President\n2/2022 – Present\nConsumers\nSenior Vice President\n2/2022 – Present\nVice President\n11/2018 – 2/2022\nBrandon J. Hofmeister (age 48)\nCMS Energy\nSenior Vice President\n7/2017 – Present\nConsumers\nSenior Vice President\n7/2017 – Present\nNorthStar Clean Energy\nSenior Vice President\n9/2017 – 6/2024\n36\nTable of Contents\nName, Age, Position(s)\nPeriod\nShaun M. Johnson (age 46)\nCMS Energy\nSenior Vice President and General Counsel\n5/2019 – Present\nConsumers\nSenior Vice President and General Counsel\n5/2019 – Present\nNorthStar Clean Energy\nSenior Vice President, General Counsel, and Director\n4/2019 – 6/2024\nEnerBank\nSenior Vice President and General Counsel\n8/2018 – 6/2020\nLeeRoy Wells, Jr. (age 46)\nCMS Energy\nSenior Vice President\n12/2020 – Present\nConsumers\nSenior Vice President\n12/2020 – Present\nVice President\n8/2017 – 12/2020\nScott B. McIntosh (age 49)\nCMS Energy\nVice President, Controller, and CAO\n9/2021 – Present\nVice President and Controller\n6/2021 – 9/2021\nVice President\n9/2015 – 6/2021\nConsumers\nVice President, Controller, and CAO\n9/2021 – Present\nVice President and Controller\n6/2021 – 9/2021\nVice President\n9/2015 – 6/2021\nNorthStar Clean Energy\nVice President, CAO, and Director\n6/2024 – Present\nVice President, Controller, and CAO\n9/2021 – 6/2024\nVice President and Controller\n6/2021 – 9/2021\nVice President\n9/2015 – 6/2021\nThere are no family relationships among executive officers and directors of CMS Energy or Consumers. The list of directors and their biographies will be included in CMS Energy’s and Consumers’ definitive proxy statement for their 2025 Annual Meetings of Shareholders to be held May 2, 2025. The term of office of each of the executive officers extends to the first meeting of the Board after the next annual election of Directors of CMS Energy and Consumers (to be held on May 2, 2025).\n37\nTable of Contents\nAvailable Information\nCMS Energy’s internet address is www.cmsenergy.com. CMS Energy routinely posts important information on its website and considers the Investor Relations section, www.cmsenergy.com/investor-relations, a channel of distribution for material information. Information contained on CMS Energy’s website is not incorporated herein. CMS Energy’s and Consumers’ annual reports on Form 10‑K, quarterly reports on Form 10‑Q, current reports on Form 8\n‑\nK, and any amendments to those reports filed pursuant to Section 13(a) or 15(d) of the Exchange Act are accessible free of charge on CMS Energy’s website. These reports are available soon after they are electronically filed with the SEC. Also on CMS Energy’s website are CMS Energy’s and Consumers’:\n•\nCorporate Governance Principles\n•\nArticles of Incorporation\n•\nBylaws\n•\nCharters and Codes of Conduct (including the Charters of the Audit Committee, Compensation and Human Resources Committee, Finance Committee, and Governance, Sustainability and Public Responsibility Committee, as well as the Employee, the Board, and Third Party Codes of Conduct)\nCMS Energy will provide this information in print to any stockholder who requests it.\nThe SEC maintains an internet site that contains reports, proxy and information statements, and other information regarding issuers that file electronically with the SEC. The address is www.sec.gov.",
  "item7": "Item 7.    Management’s Discussion and Analysis of Financial Condition and Results of Operations\nThis Management’s Discussion and Analysis of Financial Condition and Results of Operations is a combined report of CMS Energy and Consumers.\nExecutive Overview\nCMS Energy is an energy company operating primarily in Michigan. It is the parent holding company of several subsidiaries, including Consumers, an electric and gas utility, and NorthStar Clean Energy, primarily a domestic independent power producer and marketer. Consumers’ electric utility operations include the generation, purchase, distribution, and sale of electricity, and Consumers’ gas utility operations include the purchase, transmission, storage, distribution, and sale of natural gas. Consumers’ customer base consists of a mix of primarily residential, commercial, and diversified industrial customers. NorthStar Clean Energy, through its subsidiaries and equity investments, is engaged in domestic independent power production, including the development and operation of renewable generation, and the marketing of independent power production.\n53\nTable of Contents\nCMS Energy and Consumers manage their businesses by the nature of services each provides. CMS Energy operates principally in three business segments: electric utility; gas utility; and NorthStar Clean Energy, its non‑utility operations and investments. Consumers operates principally in two business segments: electric utility and gas utility. CMS Energy’s and Consumers’ businesses are affected primarily by:\n•\nregulation and regulatory matters\n•\nstate and federal legislation\n•\neconomic conditions\n•\nweather\n•\nenergy commodity prices\n•\ninterest rates\n•\ntheir securities’ credit ratings\nThe Triple Bottom Line\nCMS Energy’s and Consumers’ purpose is to provide safe, reliable, affordable, clean, and equitable energy in service of their customers. In support of this purpose, CMS Energy and Consumers couple digital transformation with the “CE Way,” a lean operating model designed to improve safety, quality, cost, delivery, and employee morale.\nCMS Energy and Consumers measure their progress toward the purpose by considering their impact on the “triple bottom line” of people, planet, and prosperity; this consideration takes into account not only the economic value that CMS Energy and Consumers create for customers and investors, but also their responsibility to social and environmental goals. The triple bottom line balances the interests of employees, customers, suppliers, regulators, creditors, Michigan’s residents, the investment community, and other stakeholders, and it reflects the broader societal impacts of CMS Energy’s and Consumers’ activities.\n54\nTable of Contents\nCMS Energy’s Sustainability Report, which is available to the public, describes CMS Energy’s and Consumers’ progress toward world class performance measured in the areas of people, planet, and prosperity.\nPeople:\n The people element of the triple bottom line represents CMS Energy’s and Consumers’ commitment to their employees, their customers, the residents of local communities in which they do business, and other stakeholders.\nThe safety of co-workers, customers, and the general public is a priority of CMS Energy and Consumers. Accordingly, CMS Energy and Consumers have worked to integrate a set of safety principles into their business operations and culture. These principles include complying with applicable safety, health, and security regulations and implementing programs and processes aimed at continually improving safety and security conditions. \nCMS Energy and Consumers also place a high priority on customer value and on providing a hometown customer experience. Consumers’ customer-driven investment program is aimed at improving safety and increasing electric and gas reliability.\nIn September 2023, Consumers filed its Reliability Roadmap, an update to its previous Electric Distribution Infrastructure Investment Plan filed in 2021, with the MPSC. The Reliability Roadmap outlines a five-year strategy to improve Consumers’ electric distribution system and the reliability of the grid. The plan proposes the following spending for projects designed to reduce the number and duration of power outages to customers through investment in infrastructure upgrades, vegetation management, and grid modernization:\n•\ncapital expenditures of $7 billion through 2028; this amount is $3 billion higher than proposed in the previous plan\n•\nmaintenance and operating spending of $1.7 billion through 2028, reflecting an increase of $300 million over the previous plan\nIn the electric rate case it filed in May 2024, Consumers outlined its proposal to begin implementing the Reliability Roadmap and requested rate recovery of the investments needed to support the plan’s key objectives. \nCentral to Consumers’ commitment to its customers are the initiatives it has undertaken to keep electricity and natural gas affordable, including:\n•\nreplacement of coal-fueled generation and PPAs with a cost-efficient mix of renewable energy, less-costly dispatchable generation sources, and energy waste reduction and demand response programs\n•\ntargeted infrastructure investment to reduce maintenance costs and improve reliability and safety\n•\nsupply chain optimization\n•\neconomic development to increase sales and reduce overall rates\n•\ninformation and control system efficiencies\n•\nemployee and retiree health care cost sharing\n•\ntax planning\n•\ncost-effective financing\n•\nworkforce productivity enhancements\nWhile CMS Energy and Consumers have experienced some supply chain disruptions and inflationary pressures, they have taken steps to mitigate the impact on their ability to provide safe and reliable service to customers. \n55\nTable of Contents\nPlanet:\n The planet element of the triple bottom line represents CMS Energy’s and Consumers’ commitment to protect the environment. This commitment extends beyond compliance with various state and federal environmental, health, and safety laws and regulations. Management considers climate change and other environmental risks in strategy development, business planning, and enterprise risk management processes.\nCMS Energy and Consumers continue to focus on opportunities to protect the environment and reduce their carbon footprint from owned generation. CMS Energy, including Consumers, has decreased its combined percentage of electric supply (self-generated and purchased) from coal by 23 percentage points since 2015. Additionally, as a result of actions already taken through 2024, initial measurement data indicates Consumers has:\n•\nreduced carbon dioxide emissions from owned generation by more than 30 percent since 2005\n•\nreduced methane emissions by nearly 30 percent since 2012\n•\nreduced the volume of water used to generate electricity by more than 50 percent since 2012\n•\nreduced landfill waste disposal by more than two million tons since 1992\n•\nenhanced, restored, or protected more than 11,700 acres of land since 2017\nSince 2005, Consumers has reduced its sulfur dioxide and particulate matter emissions by nearly 95 percent and its NOx emissions by more than 86 percent. Consumers began tracking mercury emissions in 2007; since that time, it has reduced such emissions by more than 92 percent.\nPresented in the following illustration are Consumers’ reductions in these emissions:\n56\nTable of Contents\nIn November 2023, Michigan enacted the 2023 Energy Law, which among other things:\n•\nraised the renewable energy standard from the present 15\n‑\npercent requirement to 50 percent by 2030 and 60 percent by 2035; renewable energy generated anywhere within MISO can be applied to meeting this standard, with certain limitations\n•\nset a clean energy standard of 80 percent by 2035 and 100 percent by 2040; low- or zero-carbon emitting resources, such as nuclear generation and natural gas generation coupled with carbon capture, are considered clean energy sources under this standard\n•\nenhanced existing incentives for energy efficiency programs and returns earned on new clean or renewable PPAs\n•\ncreated a new energy storage standard that requires electric utilities to file plans by 2029 to obtain new energy storage that will contribute to a Michigan target of 2,500 MW based on their pro rata share\n•\nexpanded the statutory cap on distributed generation resources to ten percent\nConsumers filed updates to its renewable energy plan in November 2024 and plans to file updates to its Clean Energy Plan in 2026. Together, these updated plans will serve as Consumers’ blueprint to meeting the requirements of the 2023 Energy Law by focusing on increasing the generation of renewable energy, deploying energy storage, helping customers use less energy, and offering demand response programs to reduce demand during critical peak times.\nConsumers’ Clean Energy Plan details its strategy to meet customers’ long-term energy needs and was most recently revised and approved by the MPSC in 2022 under Michigan’s integrated resource planning process. The Clean Energy Plan outlines Consumers’ long-term strategy for delivering safe, reliable, affordable, clean, and equitable energy to its customers. This strategy includes:\n•\nending the use of coal in owned generation in 2025, 15 years sooner than initially planned\n•\npurchasing the Covert Generating Station, a natural gas-fueled generating facility with 1,200 MW of nameplate capacity, allowing Consumers to continue to provide controllable sources of electricity to customers; this purchase was completed in May 2023\n•\nsoliciting capacity from sources able to deliver to Michigan’s Lower Peninsula, including battery storage facilities\nConsumers’ proposed updates to its renewable energy plan include:\n•\nthe addition of up to 9,000 MW of both purchased and owned solar energy resources\n•\nthe addition of up to 2,800 MW of new, competitively bid wind capacity\n•\nthe co-location of battery energy storage with its renewable energy assets to optimize those assets \nCoupled with updates to the Clean Energy Plan, these actions will enable Consumers to achieve 60 percent renewable energy by 2035 and 100 percent clean energy by 2040, and will also contribute to Consumers’ achievement of the net-zero emissions goals discussed below. \nNet-zero methane emissions from natural gas delivery system by 2030:\n Under its Methane Reduction Plan, Consumers plans to reduce methane emissions from its system by about 80 percent, from 2012 baseline levels, by accelerating the replacement of aging pipe, rehabilitating or retiring outdated infrastructure, and adopting new technologies and practices. The remaining emissions will likely be offset by purchasing and/or producing renewable natural gas. To date, Consumers has reduced methane emissions by nearly 30 percent.\nNet-zero greenhouse gas emissions target for the entire business by 2050:\n This goal incorporates greenhouse gas emissions from Consumers’ natural gas delivery system, including suppliers and \n57\nTable of Contents\ncustomers, and has an interim goal of reducing customer emissions by 25 percent by 2035. Consumers expects to meet this goal through carbon offset measures, renewable natural gas, energy efficiency and demand response programs, and the adoption of cost-effective emerging technologies once proven and commercially available.\nAdditionally, to advance its environmental stewardship in Michigan and to minimize the impact of future regulations, Consumers set the following goals for the five-year period 2023 through 2027:\n•\nto enhance, restore, or protect 6,500 acres of land through 2027; Consumers has enhanced, restored, or protected more than 5,000 acres of land towards this goal\n•\nto reduce water usage by 1.7 billion gallons through 2027; Consumers has reduced water usage by more than 1.3 billion gallons towards this goal\n•\nto annually divert a minimum of 90 percent of waste from landfills (through waste reduction, recycling, and reuse); during 2024, Consumers’ rate of waste diverted from landfills was 92 percent\nCMS Energy and Consumers are monitoring numerous legislative, policy, and regulatory initiatives, including those to regulate and report greenhouse gases, and related litigation. While CMS Energy and Consumers cannot predict the outcome of these matters, which could affect them materially, they intend to continue to move forward with their clean and lean strategy.\nProsperity:\n The prosperity element of the triple bottom line represents CMS Energy’s and Consumers’ commitment to meeting their financial objectives and providing economic development opportunities and benefits in the communities in which they do business. CMS Energy’s and Consumers’ financial strength allows them to maintain solid investment-grade credit ratings and thereby reduce funding costs for the benefit of customers and investors, to attract and retain talent, and to reinvest in the communities they serve.\nIn 2024, CMS Energy’s net income available to common stockholders was $993 million, and diluted EPS were $3.33. This compares with net income available to common stockholders of $877 million and diluted EPS of $3.01 in 2023. In 2024, electric and gas rate increases were offset partially by higher interest charges and increased depreciation and property taxes, reflecting higher capital spending. A more detailed discussion of the factors affecting CMS Energy’s and Consumers’ performance can be found in the Results of Operations section that follows this Executive Overview.\nOver the next five years, Consumers expects weather-normalized electric deliveries to increase compared to 2024. This outlook reflects strong growth in electric demand, offset partially by the effects of energy waste reduction programs. Weather-normalized gas deliveries are expected to remain stable relative to 2024, reflecting modest growth in gas demand, offset by the effects of energy waste reduction programs.\n58\nTable of Contents\nPerformance: Impacting the Triple Bottom Line\nCMS Energy and Consumers remain committed to delivering safe, reliable, affordable, clean, and equitable energy in service of their customers and positively impacting the triple bottom line of people, planet, and prosperity. During 2024, CMS Energy and Consumers:\n•\ncreated a Clean Energy Workforce Development Program for people employed in the building trades to receive training and certifications in the areas of advanced energy efficiency, lead abatement, and other work\n•\nburied power lines in multiple Michigan communities under a targeted undergrounding pilot program in efforts to improve electric service for Consumers’ electric customers\n•\nbegan installation of nearly 3,000 line sensors, 100 automatic transfer reclosers, and 1,200 iron utility poles to improve electric reliability and help prevent power outages\n•\nexpanded Consumers’ MI Clean Air program to include several renewable natural gas projects being developed and constructed across Michigan, increasing options for customers to offset emissions associated with their natural gas use\n•\ncollaborated with the Muskegon County Resource Recovery Center to develop a 250-MW solar energy center, Consumers’ first large-scale, self-developed solar project, that is expected to power 40,000 homes by 2026\n•\nupdated Consumers’ Transportation Electrification Plan, aiming to power over 1,500 new fast charging locations and serve one million electric vehicles in Michigan by 2030\n•\nlaunched a new workplace electric vehicle charging program, offering rebates to businesses that install chargers, with a goal of equipping over 500 workplaces by 2030\n•\ncompleted the final phase of the Mid-Michigan Pipeline project, replacing and upgrading 55 miles of natural gas transmission pipeline in five Michigan counties, ensuring safe and reliable gas flow to homes and businesses prior to the winter season\nCMS Energy and Consumers will continue to utilize the CE Way to enable them to achieve world class performance and positively impact the triple bottom line. Consumers’ investment plan and the regulatory environment in which it operates also drive its ability to impact the triple bottom line.\nInvestment Plan: \nOver the next five years, Consumers expects to make significant expenditures on infrastructure upgrades, replacements, and clean generation. While it has a large number of potential investment opportunities that would add customer value, Consumers has prioritized its spending based on the criteria of enhancing public safety, increasing reliability, maintaining affordability for its customers, and advancing its environmental stewardship. Consumers’ investment program, which is subject to approval through general rate case and other MPSC proceedings, is expected to result in annual rate-base growth of more than eight percent. This rate-base growth, together with cost-control measures, should allow Consumers to maintain affordable customer prices.\n59\nTable of Contents\nPresented in the following illustration are Consumers’ planned capital expenditures through 2029 of $20.0 billion: \nOf this amount, Consumers plans to spend $14.8 billion over the next five years primarily to maintain and upgrade its electric distribution systems and gas infrastructure in order to enhance safety and reliability, improve customer satisfaction, reduce energy waste on those systems, and facilitate its clean energy transformation. Electric distribution and other projects comprise $8.5 billion primarily to strengthen circuits and substations, replace poles, and interconnect clean energy resources. The gas infrastructure projects comprise $6.3 billion to sustain deliverability, enhance pipeline integrity and safety, and reduce methane emissions. Consumers also expects to spend $5.2 billion on clean generation, which includes investments in wind, solar, and hydroelectric generation resources.\nRegulation:\n Regulatory matters are a key aspect of Consumers’ business, particularly rate cases and regulatory proceedings before the MPSC, which permit recovery of new investments while helping to ensure that customer rates are fair and affordable. Important regulatory events and developments not already discussed are summarized below.\n2024 Electric Rate Case: \nIn May 2024, Consumers filed an application with the MPSC seeking a rate increase of $325 million, made up of two components. First, Consumers requested a $303 million annual rate increase, based on a 10.25‑percent authorized return on equity for the projected 12\n‑\nmonth period ending February 28, 2026. The filing requested authority to recover costs related to new infrastructure investment primarily in distribution system reliability and cleaner energy resources. Second, Consumers requested approval of a $22 million surcharge for the recovery of distribution investments made in 2023 that exceeded the rates authorized in accordance with previous electric rate orders. In October 2024, Consumers revised its requested increase to $277 million, primarily to reflect the removal of projected capital investments associated with certain solar facilities that Consumers incorporated into its amended renewable energy plan. The MPSC must issue a final order in this case before or in March 2025.\n2023 Electric Rate Case\n: In March 2024, the MPSC issued an order authorizing an annual rate increase of $92 million, which is inclusive of a $9 million surcharge for the recovery of select distribution \n60\nTable of Contents\ninvestments made in 2022 that exceeded the rates authorized in accordance with the December 2021 electric rate order. The approved rate increase is based on a 9.9‑percent authorized return on equity. The new rates became effective March 15, 2024.\n2024 Gas Rate Case: \nIn December 2024, Consumers filed an application with the MPSC seeking an annual rate increase of $248 million based on a 10.25‑percent authorized return on equity for the projected 12‑month period ending October 31, 2026. The MPSC must issue a final order in this case before or in October 2025. \n2023 Gas Rate Case:\n \nIn December 2023, Consumers filed an application with the MPSC seeking an annual rate increase of $136 million based on a 10.25‑percent authorized return on equity for the projected test year comprising the 12‑month period ending September 30, 2025. In May 2024, Consumers revised its requested increase to $113 million. In July 2024, the MPSC approved a settlement agreement authorizing an annual rate increase of $35 million, based on a 9.9‑percent authorized return on equity. Additionally, the settlement approves the use of $27.5 million, or one-fourth, of the gain on the sale of Consumers’ unregulated ASP business as an offset to the revenue deficiency in lieu of additional rate relief during the test year. This results in effective rate relief of $62.5 million for the test year. The settlement agreement also provides for the remaining three-fourths of the $110 million gain on the sale of the ASP business, or $82.5 million, to be provided to customers as a bill credit over a three-year period. The new rates, including the bill credit, became effective October 1, 2024.\nLooking Forward\nCMS Energy and Consumers will continue to consider the impact on the triple bottom line of people, planet, and prosperity in their daily operations as well as in their long-term strategic decisions. Consumers will continue to seek fair and timely regulatory treatment that will support its customer-driven investment plan, while pursuing cost-control measures that will allow it to maintain sustainable customer base rates. The CE Way is an important means of realizing CMS Energy’s and Consumers’ purpose of providing safe, reliable, affordable, clean, and equitable energy in service of their customers.\n61\nTable of Contents\nResults of Operations\nCMS Energy Consolidated Results of Operations\nIn Millions, Except Per Share Amounts\nYears Ended December 31\n2024\n2023\nChange\nNet Income Available to Common Stockholders\n$\n993 \n$\n877 \n$\n116 \nBasic Earnings Per Average Common Share\n$\n3.34 \n$\n3.01 \n$\n0.33 \nDiluted Earnings Per Average Common Share\n$\n3.33 \n$\n3.01 \n$\n0.32 \nIn Millions\nYears Ended December 31\n2024\n2023\nChange\nElectric utility\n$\n681 \n$\n550 \n$\n131 \nGas utility\n328 \n315 \n13 \nNorthStar Clean Energy\n63 \n67 \n(4)\nCorporate interest and other\n(79)\n(55)\n(24)\nNet Income Available to Common Stockholders\n$\n993 \n$\n877 \n$\n116 \nFor a summary of net income available to common stockholders for 2023 versus 2022, as well as detailed changes by reportable segment, see Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations—Results of Operations, in the\n \nForm 10‑K for the fiscal year ended December 31, 2023, filed February 8, 2024\n.\n62\nTable of Contents\nAmounts in the following tables are presented pre-tax, with the exception of income tax changes. \nPresented in the following table is a summary of changes to net income available to common stockholders for 2024 versus 2023:\nIn Millions\nYear Ended December 31, 2023\n$\n877 \nReasons for the change\nConsumers electric utility and gas utility\nElectric sales\n$\n45 \nGas sales\n(35)\nElectric rate increase\n235 \nGas rate increase, including gain amortization in lieu of rate relief\n1\n84 \nAbsence of 2023 voluntary separation program expenses\n33 \nLower service restoration costs\n32 \nHigher other income, net of expenses\n4 \nHigher interest charges\n(70)\nHigher depreciation and amortization\n(55)\nHigher other maintenance and operating expenses\n(53)\nHigher income tax expense\n(36)\nHigher property taxes, reflecting higher capital spending, and other\n(33)\nLower ASP revenue net of expense due to sale\n(7)\n$\n144 \nNorthStar Clean Energy\n(4)\nCorporate interest and other\n(24)\nYear Ended December 31, 2024\n$\n993 \n1    \nSee Item 8. Financial Statements and Supplementary Data—Notes to the Consolidated Financial Statements—Note 2, Regulatory Matters.\n63\nTable of Contents\nConsumers Electric Utility Results of Operations\nPresented in the following table are the detailed changes to the electric utility’s net income available to common stockholders for 2024 versus 2023:\nIn Millions\nYear Ended December 31, 2023\n$\n550 \nReasons for the change\nElectric deliveries\n1\n and rate increases\nRate increase, including securitization surcharge and return on higher renewable capital spending\n$\n235 \nHigher revenue due primarily to favorable weather\n45 \nHigher energy waste reduction program revenues\n10 \n$\n290 \nMaintenance and other operating expenses\nLower service restoration costs\n32 \nAbsence of 2023 voluntary separation program expenses\n20 \nHigher distribution, transmission, and generation expenses\n(15)\nHigher energy waste reduction program costs\n(10)\nHigher other maintenance and operating expenses\n(18)\n9 \nDepreciation and amortization\nIncreased plant in service, reflecting higher capital spending\n(68)\nGeneral taxes\nHigher property taxes, reflecting higher capital spending\n(21)\nOther income, net of expenses\n(5)\nInterest charges\n(39)\nIncome taxes\nHigher electric utility pre-tax earnings\n(41)\nHigher renewable energy tax credits\n2\n11 \nHigher other income taxes\n(5)\n(35)\nYear Ended December 31, 2024\n$\n681 \n1\nDeliveries to end-use customers were 36.8 billion kWh in 2024 and 36.3 billion kWh in 2023.\n2\nSee Item 8. Financial Statements and Supplementary Data—Notes to the Consolidated Financial Statements—Note 12, Income Taxes.\n64\nTable of Contents\nConsumers Gas Utility Results of Operations\nPresented in the following table are the detailed changes to the gas utility’s net income available to common stockholders for 2024 versus 2023:\nIn Millions\nYear Ended December 31, 2023\n$\n315 \nReasons for the change\nGas deliveries\n1\n and rate increases\nRate increase\n$\n75 \nLower revenue due primarily to unfavorable weather\n(35)\nLower ASP business revenue\n2\n(46)\nASP gain customer bill credit\n3\n(8)\nLower energy waste reduction program revenues\n(8)\n$\n(22)\nMaintenance and other operating expenses\nLower ASP business expense\n2\n39 \nAmortization of ASP gain\n3\n17 \nAbsence of 2023 voluntary separation program expenses\n13 \nLower energy waste reduction program costs\n8 \nHigher maintenance and other operating expenses\n(20)\n57 \nDepreciation and amortization\nLower depreciation rates, offset partially by higher capital spending\n13 \nGeneral taxes\nHigher property taxes, reflecting higher capital spending and other\n(12)\nOther income, net of expenses\n9 \nInterest charges\n(31)\nIncome taxes\nHigher gas utility pre-tax earnings\n(4)\nLower other income taxes\n3 \n(1)\nYear Ended December 31, 2024\n$\n328 \n1\nDeliveries to end-use customers were 268 Bcf in 2024 and 282 Bcf in 2023.\n2\nSee Item 8. Financial Statements and Supplementary Data—Notes to the Consolidated Financial Statements—Note 19, Exit Activities and Asset Sales.\n3\nSee Item 8. Financial Statements and Supplementary Data—Notes to the Consolidated Financial Statements—Note 2, Regulatory Matters.\n65\nTable of Contents\nNorthStar Clean Energy Results of Operations\nPresented in the following table are the detailed changes to NorthStar Clean Energy’s net income available to common stockholders for 2024 versus 2023:\nIn Millions\nYear Ended December 31, 2023\n$\n67 \nReason for the change\nHigher operating earnings, primarily at DIG\n$\n22 \nHigher renewable energy tax credits\n9 \nHigher interest charges and other expenses\n(11)\nLower earnings from renewable projects\n(24)\nYear Ended December 31, 2024\n$\n63 \nCorporate Interest and Other Results of Operations\nPresented in the following table are the detailed changes to corporate interest and other results for 2024 versus 2023:\nIn Millions\nYear Ended December 31, 2023\n$\n(55)\nReasons for the change\nLower gain on extinguishment of debt\n1\n$\n(21)\nOther\n(3)\nYear Ended December 31, 2024\n$\n(79)\n1\nSee Item 8. Financial Statements and Supplementary Data—Notes to the Consolidated Financial Statements—Note 4, Financings and Capitalization.\nCash Position, Investing, and Financing\nAt December 31, 2024, CMS Energy had $178 million of consolidated cash and cash equivalents, which included $75 million of restricted cash and cash equivalents. At December 31, 2024, Consumers had $119 million of consolidated cash and cash equivalents, which included $75 million of restricted cash and cash equivalents.\nFor specific components of net cash provided by operating activities, net cash used in investing activities, and net cash provided by financing activities for 2023 versus 2022, see Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations—Cash Position, Investing, and Financing, in the \nForm 10‑K for the fiscal year ended December 31, 2023, filed February 8, 2024\n.\n66\nTable of Contents\nOperating Activities\nPresented in the following table are specific components of net cash provided by operating activities for 2024 versus 2023:\nIn Millions\nCMS Energy, including Consumers\nYear Ended December 31, 2023\n$\n2,309 \nReasons for the change\nHigher net income\n$\n139 \nNon‑cash transactions\n1\n76 \nUnfavorable impact of changes in core working capital,\n2\n due primarily to lower collections and lower prices on gas sold to customers\n(266)\nFavorable impact of changes in other assets and liabilities, due primarily to proceeds from the sale of renewable energy tax credits\n3\n112 \nYear Ended December 31, 2024\n$\n2,370 \nConsumers\nYear Ended December 31, 2023\n$\n2,430 \nReasons for the change\nHigher net income\n$\n142 \nNon‑cash transactions\n1\n(2)\nUnfavorable impact of changes in core working capital,\n2\n due primarily to lower collections and lower prices on gas sold to customers\n(248)\nFavorable impact of changes in other assets and liabilities, due primarily to proceeds from the sale of renewable energy tax credits\n3\n124 \nYear Ended December 31, 2024\n$\n2,446 \n1\nNon\n‑\ncash transactions comprise depreciation and amortization, changes in deferred income taxes and investment tax credits, bad debt expense, and other non‑cash operating activities and reconciling adjustments.\n2\nCore working capital comprises accounts receivable, accrued revenue, inventories, accounts payable, and accrued rate refunds.\n3\nSee Item 8. Financial Statements and Supplementary Data—Notes to the Consolidated Financial Statements—Note 12, Income Taxes—Renewable Energy Tax Credits.\n67\nTable of Contents\nInvesting Activities\nPresented in the following table are specific components of net cash used in investing activities for 2024 versus 2023:\nIn Millions\nCMS Energy, including Consumers\nYear Ended December 31, 2023\n$\n(3,386)\nReasons for the change\nHigher capital expenditures\n$\n(611)\nAbsence of 2023 purchase of Covert Generating Station\n812 \nProceeds from sale of ASP business\n1\n124 \nOther investing activities\n7 \nYear Ended December 31, 2024\n$\n(3,054)\nConsumers\nYear Ended December 31, 2023\n$\n(3,201)\nReasons for the change\nHigher capital expenditures\n$\n(594)\nAbsence of 2023 purchase of Covert Generating Station\n812 \nProceeds from sale of ASP business\n1\n124 \nOther investing activities\n(13)\nYear Ended December 31, 2024\n$\n(2,872)\n1\nSee Item 8. Financial Statements and Supplementary Data—Notes to the Consolidated Financial Statements—Note 19, Exit Activities and Asset Sales.\n68\nTable of Contents\nFinancing Activities\nPresented in the following table are specific components of net cash provided by financing activities for 2024 versus 2023:\nIn Millions\nCMS Energy, including Consumers\nYear Ended December 31, 2023\n$\n1,143 \nReasons for the change\nLower debt issuances\n$\n(1,589)\nLower debt retirements\n1,180 \nHigher repayments of notes payable\n(101)\nHigher issuances of common stock, primarily a higher settlement of forward sale contracts under the equity offering program\n1\n \nin 202\n4\n94 \nHigher payments of dividends on common stock\n(47)\nAbsence of 2023 proceeds from sales of membership interests in VIEs to tax equity investors\n(86)\nLower contributions from noncontrolling interest\n(1)\nOther financing activities, primarily lower debt issuance costs\n21 \nYear Ended December 31, 2024\n$\n614 \nConsumers\nYear Ended December 31, 2023\n$\n767 \nReasons for the change\nLower debt issuances\n$\n(1,369)\nLower debt retirements\n1,265 \nHigher repayments of notes payable\n(101)\nAbsence of a repayment of borrowings from CMS Energy in 2023\n75 \nHigher stockholder contribution from CMS Energy\n260 \nReturn of stockholder contribution to CMS Energy\n(320)\nHigher payments of dividends on common stock\n(100)\nOther financing activities\n12 \nYear Ended December 31, 2024\n$\n489 \n1\nSee Item 8. Financial Statements and Supplementary Data—Notes to the Consolidated Financial Statements—Note 4, Financings and Capitalization—Issuance of Common Stock.\n69\nTable of Contents\nCapital Resources and Liquidity\nCMS Energy and Consumers expect to have sufficient liquidity to fund their present and future commitments. CMS Energy uses dividends and tax-sharing payments from its subsidiaries and external financing and capital transactions to invest in its utility and non\n‑\nutility businesses, retire debt, pay dividends, and fund its other obligations. The ability of CMS Energy’s subsidiaries, including Consumers, to pay dividends to CMS Energy depends upon each subsidiary’s revenues, earnings, cash needs, and other factors. In addition, Consumers’ ability to pay dividends is restricted by certain terms included in its articles of incorporation and potentially by FERC requirements and provisions under the Federal Power Act and the Natural Gas Act. For additional details on Consumers’ dividend restrictions, see Item 8. Financial Statements and Supplementary Data—Notes to the Consolidated Financial Statements—Note 4, Financings and Capitalization—Dividend Restrictions. During the year ended December 31, 2024, Consumers paid $795 million in dividends on its common stock to CMS Energy.\nConsumers uses cash flows generated from operations, external financing transactions, and the monetization of tax credits, along with stockholder contributions from CMS Energy, to fund capital expenditures, retire debt, pay dividends, and fund its other obligations. Consumers also uses these sources of funding to contribute to its employee benefit plans.\nUnder the Inflation Reduction Act of 2022, renewable energy tax credits produced after 2022 are eligible to be transferred to third parties. For additional details, see Item 8. Financial Statements and Supplementary Data—Notes to the Consolidated Financial Statements—Note 12, Income Taxes—Renewable Energy Tax Credits.\nFinancing and Capital Resources:\n CMS Energy and Consumers rely on the capital markets to fund their robust capital plan. Barring any sustained market dislocations or disruptions, CMS Energy and Consumers expect to continue to have ready access to the financial and capital markets and will continue to explore possibilities to take advantage of market opportunities as they arise with respect to future funding needs. If access to these markets were to diminish or otherwise become restricted, CMS Energy and Consumers would implement contingency plans to address debt maturities, which could include reduced capital spending.\nIn 2023, CMS Energy entered into an equity offering program under which it may sell shares of its common stock having an aggregate sales price of up to $1 billion in privately negotiated transactions, in “at the market” offerings, or through forward sales transactions. As of December 31, 2024, these contracts had an aggregate sales price of $28 million, maturing in November 2025.\nCMS Energy, NorthStar Clean Energy, and Consumers use revolving credit facilities for general working capital purposes and to issue letters of credit. In May 2024, NorthStar Clean Energy entered into a secured revolving credit agreement which provides for up to $150 million in borrowings. At December 31, 2024, the full capacity under this secured revolving credit agreement was borrowed. At December 31, 2024, CMS Energy had $519 million of its revolving credit facility available and Consumers had $1.3 billion available under its revolving credit facilities. \nAn additional source of liquidity is Consumers’ commercial paper program, which allows Consumers to issue, in one or more placements, up to $500 million in aggregate principal amount of commercial paper notes with maturities of up to 365 days at market interest rates. These issuances are supported by Consumers’ revolving credit facilities. While the amount of outstanding commercial paper does not reduce the available capacity of the revolving credit facilities, Consumers does not intend to issue commercial paper in an amount exceeding the available capacity of the facilities. At December 31, 2024, there were $65 million of commercial paper notes outstanding under this program. \n70\nTable of Contents\nFor additional details about these programs and facilities, see Item 8. Financial Statements and Supplementary Data—Notes to the Consolidated Financial Statements—Note 4, Financings and Capitalization.\nCertain of CMS Energy’s, NorthStar Clean Energy’s, and Consumers’ credit agreements contain covenants that require each entity to maintain certain financial ratios, as defined therein. At December 31, 2024, no default had occurred with respect to any of the financial covenants contained in these credit agreements. Each of the entities was in compliance with the covenants contained in their respective credit agreements as of December 31, 2024, as presented in the following table:\nLimit \nActual \nCMS Energy, parent only\nDebt to capital\n1\n<\n 0.70 to 1.0\n0.58 to 1.0\nNorthStar Clean Energy, including subsidiaries\nDebt to capital\n2\n<\n 0.50 to 1.0\n0.15 to 1.0\nDebt service coverage\n2\n>\n 2.00 to 1.0\n5.55 to 1.0\nPledged equity interests to aggregate commitment\n2,3\n>\n 2.00 to 1.0\n2.64 to 1.0\nConsumers\nDebt to capital\n4\n<\n 0.65 to 1.0\n0.50 to 1.0\n1\nApplies to CMS Energy’s revolving credit agreement, letter of credit reimbursement agreement, and term loans.\n2\nApplies to NorthStar Clean Energy’s revolving credit agreement.\n3\nThe aggregate book value of the pledged equity interests under the revolving credit agreement was at least two-times the aggregate commitment under the revolving credit agreement at December 31, 2024.\n4\nApplies to Consumers’ revolving credit agreements.\nMaterial Cash Requirements:\n \nBased on the present investment plan, during 2025, CMS Energy, including Consumers, projects capital expenditures of $4.3 billion and Consumers projects capital expenditures of $3.7 billion. CMS Energy’s 2025 contractual commitments comprise $2.4 billion of purchase obligations and $1.9 billion of principal and interest payments on long-term debt. Consumers’ 2025 contractual commitments comprise $2.1 billion of purchase obligations and $1.0 billion of principal and interest payments on long-term debt.\nComponents of CMS Energy’s and Consumers’ cash management plan include controlling operating expenses and capital expenditures and evaluating market conditions for financing and refinancing opportunities. CMS Energy’s and Consumers’ present level of cash and expected cash flows from operating activities, together with access to sources of liquidity, are anticipated to be sufficient to fund contractual obligations and other material cash requirements for 2025 and beyond.\nCapital Expenditures:\n Over the next five years, CMS Energy and Consumers expect to make substantial capital investments. The companies may revise their forecast of capital expenditures periodically due to a number of factors, including environmental regulations, MPSC approval or disapproval, business opportunities, market volatility, economic trends, and the ability to access capital. Presented in the \n71\nTable of Contents\nfollowing table are CMS Energy’s and Consumers’ estimated capital expenditures, including lease commitments, for 2025 through 2029:\nIn Billions\n2025\n2026\n2027\n2028\n2029\nTotal\nCMS Energy, including Consumers\nConsumers\n$\n3.7 \n$\n4.1 \n$\n4.4 \n$\n3.9 \n$\n3.9 \n$\n20.0 \nNorthStar Clean Energy, including subsidiaries\n0.6 \n0.3 \n0.7 \n0.6 \n0.6 \n2.8 \nTotal CMS Energy\n$\n4.3 \n$\n4.4 \n$\n5.1 \n$\n4.5 \n$\n4.5 \n$\n22.8 \nConsumers\nElectric utility operations\n$\n2.5 \n$\n2.8 \n$\n3.1 \n$\n2.7 \n$\n2.6 \n$\n13.7 \nGas utility operations\n1.2 \n1.3 \n1.3 \n1.2 \n1.3 \n6.3 \nTotal Consumers\n$\n3.7 \n$\n4.1 \n$\n4.4 \n$\n3.9 \n$\n3.9 \n$\n20.0 \nOther Material Cash Requirements:\n Presented in the following table are CMS Energy’s and Consumers’ material cash obligations from known contractual and other legal obligations:\nIn Billions\nPayments Due\nDecember 31, 2024\nLess Than One Year\nTotal\nCMS Energy, including Consumers\nLong-term debt\n$\n1.2 \n$\n16.5 \nInterest payments on long-term debt\n0.7 \n13.2 \nPurchase obligations\n2.4 \n11.4 \nAROs\n— \n2.6 \nTotal obligations\n$\n4.3 \n$\n43.7 \nConsumers\nLong-term debt\n$\n0.5 \n$\n12.2 \nInterest payments on long-term debt\n0.5 \n8.2 \nPurchase obligations\n2.1 \n10.4 \nAROs\n— \n2.5 \nTotal obligations\n$\n3.1 \n$\n33.3 \nPurchase obligations arise from long-term contracts for the purchase of commodities and related services, and construction and service agreements. The commodities and related services include long-term PPAs, natural gas and associated transportation, and coal and associated transportation. For more information on CMS Energy’s and Consumers’ purchase obligations, see Item 8. Financial Statements and Supplementary Data—Notes to the Consolidated Financial Statements—Note 3, Contingencies and Commitments—Contractual Commitments.\nCMS Energy, Consumers, and certain of their subsidiaries enter into various arrangements in the normal course of business to facilitate commercial transactions with third parties. These arrangements include indemnities, surety bonds, letters of credit, and financial and performance guarantees. For additional details on indemnity and guarantee arrangements, see Item 8. Financial Statements and Supplementary Data—Notes to the Consolidated Financial Statements—Note 3, Contingencies and Commitments—Guarantees. For additional details on letters of credit and CMS Energy’s forward sales contracts, see \n72\nTable of Contents",
  "item2": null
}