{
  "source_file": "cnc-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2. \nManagement's Discussion and Analysis of Financial Condition and Results of Operations.\nThe following discussion of our financial condition and results of operations should be read in conjunction with our consolidated financial statements and the related notes included elsewhere in this filing. The discussion contains forward-looking statements that involve known and unknown risks and uncertainties.\nEXECUTIVE OVERVIEW\nGeneral\nWe are a leading healthcare enterprise that is committed to helping people live healthier lives. The Company takes a local approach – with local brands and local teams – to provide fully integrated, high-quality and cost-effective services to government-sponsored and commercial healthcare programs, focusing on under-insured and uninsured individuals. Centene offers affordable and high-quality products to more than 1 in 15 individuals across the nation, including Medicaid and Medicare members (including Medicare Prescription Drug Plans) as well as individuals and families served by the Health Insurance Marketplace.\nOur results of operations depend on our ability to manage expenses associated with health benefits (including estimated costs incurred) and selling, general and administrative (SG&A) costs. We measure operating performance based upon two key ratios. The health benefits ratio (HBR) represents medical costs as a percentage of premium revenues, excluding premium tax revenues that are separately billed, and reflects the direct relationship between the premiums received and the medical services provided. The SG&A expense ratio represents SG&A costs as a percentage of premium and service revenues, excluding premium taxes separately billed.\nTrends and Uncertainties\nOperating\nIn 2025, we have experienced an accelerated increase in medical cost trend. The drivers of trend include increasing medical demand, expanded access to care facilitated by program changes at the state level, and the rapid release and availability of new, high-cost pharmaceuticals. Increasingly, state healthcare policies are providing for expanded access through carve-ins for incremental coverage (for example, behavioral healthcare and home and community-based services).\nThe medical cost drivers are likely intensified by an environment where legislative changes to the United States healthcare model have been widely publicized (and with increasing intensity over the last nine months). Changes to the model include references to members in certain programs who may lose eligibility and certain provider reimbursement models that may be reduced in the future. Changes in Medicaid and Marketplace, including potential changes in the availability of enhanced Advance Premium Tax Credits (APTCs) for Marketplace products coupled with the One Big Beautiful Bill Act (OBBBA), create member uncertainty surrounding the future availability, affordability, funding, and access to health insurance. This backdrop may be prompting members to seek care at an increased rate (given potential eligibility and subsidy funding shifts) and providers may be modifying operations, all further exacerbating the medical cost trend.\nWe continue to work with our state partners to establish Medicaid premium rates that appropriately match the acuity of the population as well as reflect the most recent medical cost trend. We also provide states with data to help them analyze the implications of policy decisions as well as design effective risk adjustment programs. In Marketplace, we completed the process of refiling 2026 policy year rates during the third quarter of 2025 to reflect a higher projected baseline of Marketplace morbidity than previously expected. Barring state-specific changes, we expect to be able to take corrective pricing actions for 2026 in states representing approximately 95% of our Marketplace membership.\nAdditionally, we are committed to ensuring that the affordability of healthcare is maintained for our government partners and members and continue to address the cost trend through the implementation of new clinical initiatives and care management plans, thoughtful network design, and ongoing rigor to combat fraud, waste and abuse.\n21\nTable of Contents\nRegulatory: Medicaid \nThe COVID-19 pandemic impacted our business as it relates to Medicaid eligibility changes. From the onset of the public health emergency (PHE) through March 2023, our Medicaid membership increased by 3.6 million members (excluding new states North Carolina and Delaware and various state product expansions or managed care organization changes). Since March 31, 2023, redeterminations are the primary driver of our Medicaid membership decline. While some states may still be concluding the redetermination process for certain populations of members, we anticipate that future reductions could occur resulting from ongoing state redetermination processes. We continue to work with our state partners to match rates to acuity post-redeterminations.\nThe OBBBA, passed in July 2025, includes requirements that may reduce the number of members eligible for state Medicaid Expansion programs by requiring work or community engagement by members and for state Medicaid agencies to redetermine member eligibility at more frequent intervals, along with adding a \"Cost Sharing\" or \"Co-Pay\" for certain medical services. These changes could have the effect of increasing the overall morbidity of the Medicaid Expansion population largely beginning in 2027, subject to state implementation plans. Several other provisions of the OBBBA, such as adjustments to provider taxes and state directed payments beginning in 2028, may have the effect of reducing the amount of federal funding for Medicaid, which could result in changes in the design of Medicaid programs, including coverage of benefits, eligibility, and/or provider payment rates. The OBBBA also includes a restriction against paying certain providers designated as \"prohibited entities\" as of October 1, 2025, which has the potential to create access to care issues and network gaps. An extended government shutdown may delay regulatory guidance and implementation of these requirements and other rulemaking changes.\nRegulatory: Commercial\nThe American Rescue Plan Act (ARPA), enacted in March 2021, initially enhanced eligibility for APTCs for enrollees in the Health Insurance Marketplace. The enhanced eligibility extended by the Inflation Reduction Act (IRA), enacted in August 2022, expires at the end of 2025. \nThe Marketplace Integrity & Affordability Final Rule (Final Rule) was published in the Federal Register on June 25, 2025. The Final Rule makes changes to policies to strengthen program integrity measures in the Marketplace. For example, the Special Enrollment Period for those under 150% of the Federal Poverty Level (FPL) has been repealed beginning August 25, 2025. Several of the provisions of the Final Rule have been stayed due to ongoing litigation. These include a requirement for certain consumers who automatically re-enroll into a fully subsidized Marketplace plan will be re-enrolled into the same plan with a $5 premium until the consumer updates their exchange application to confirm APTC eligibility. Additionally, exchanges may no longer accept a consumer's self-attestation of projected annual household income when the Internal Revenue Service (IRS) cannot verify it due to lack of tax return data; rather, exchanges must verify household income using other trusted data sources.\nIn addition, the OBBBA placed additional restrictions on APTC requirements. For example, beginning January 1, 2026, should individuals mis-estimate their projected income, the OBBBA requires them to reimburse the IRS for the full amount of excess tax credit received. In addition, as of January 1, 2026, the OBBBA prohibits individuals from receiving APTCs if they enroll in health coverage through a Special Enrollment Period associated with their income. We anticipate that the combined effect of the expiration of the enhanced APTCs, the Final Rule, and the OBBBA will reduce 2026 Marketplace membership and continue to increase the overall morbidity of the Marketplace population. We completed the process of refiling 2026 policy year rates during the third quarter of 2025 to reflect a higher projected baseline of Marketplace morbidity than previously expected. Barring state-specific changes, we expect to be able to take corrective pricing actions for 2026 in states representing approximately 95% of our Marketplace membership. We continue to advocate for legislation and regulations aimed at leveraging Medicaid and the Health Insurance Marketplace to maintain health insurance coverage and affordability for consumers.\n22\nTable of Contents\nRegulatory: Medicare\nThe IRA significantly changed Medicare Part D, impacting stand-alone Medicare Prescription Drug Plans (PDPs) as well as the Part D benefit in many of our Medicare Advantage plans beginning in 2025, most notably by eliminating the coverage gap and capping members' annual out-of-pocket costs at $2,000 in order to provide more predictable and affordable prescription drug coverage for Medicare beneficiaries. The members' Part D annual out-of-pocket cap for 2026 is $2,100. The IRA changes effective for 2025 result in a meaningful shift in cost-sharing responsibilities between members, drug companies, Centers for Medicare and Medicaid Services (CMS), and PDPs and have resulted in a significant increase in our premiums in consideration for our PDPs' responsibility for a larger portion of total Part D benefit costs. To help mitigate significant premium impacts and address these changes, CMS introduced the Medicare Part D Premium Stabilization Demonstration program. This program began in calendar year 2025 and was intended by CMS to exist for three years. The parameters of the program are expected to be different each year. CMS believes the demonstration will provide plans greater flexibility to manage costs and assist in stabilizing beneficiary premiums. We continue to advocate for policies that promote cost-effective, high-quality care for our PDP enrolled members. We have receivables due to us from CMS for Part D risk-sharing programs attributable to the 2024 and 2025 plan years that we expect to be paid by CMS approximately a year after the plan year closes. If the payments from CMS are delayed, our cash flows may be materially adversely affected.\nRegulatory: Dual-Eligible\nIn addition, the CMS calendar year 2025 Medicare and Part D policy rule and finalized regulations will require beneficiaries dually enrolled in Medicare and a Medicaid Managed Care Plan to receive integrated care through the same parent company's Medicaid and Medicare Advantage Dual Eligible Special Needs Plans (D-SNPs) beginning in 2030, with newly eligible enrollees beginning in 2027. However, some states have already moved or are planning to exclusively align dual-eligible enrollment under an aligned D-SNP and Medicaid plan before this timeframe. We believe we continue to be well-positioned given our overlapping Medicaid and Medicare Advantage footprints and are committed to navigating evolving regulations.\nSummary\nWe remain focused on our promise of delivering high-quality healthcare services on behalf of states and the federal government to under-insured and uninsured families and commercial organizations. Our decades of experience and deep industry knowledge have allowed us to deliver cost-effective services to our government partners and our members. With a focus on the personalization of healthcare technology, we continue the use of data and analytics to improve the provider and member experience. We continue to believe we have both the capacity and capability to successfully navigate industry changes to the benefit of our members, customers, providers, and shareholders.\nThird Quarter 2025 Highlights\nOur financial performance for the third quarter of 2025 is summarized as follows:\n•\nManaged care membership of 28.0 million, a decrease of 672 thousand members, or (2)% year-over-year.\n•\nTotal revenues of $49.7 billion, representing 18% growth year-over-year.\n•\nPremium and service revenues of $44.9 billion, representing 22% growth year-over-year.\n•\nHBR of 92.7%, compared to 89.2% for the third quarter of 2024.\n•\nSG&A expense ratio of 7.0%, compared to 8.3% for the third quarter of 2024.\n•\nAdjusted SG&A expense ratio of 7.0%, compared to 8.3% for the third quarter of 2024.\n•\nOperating cash flows provided cash of $1.4 billion in the third quarter of 2025.\n•\nIn October 2025, we completed our quantitative goodwill impairment analysis and recorded a non-cash goodwill impairment of $6.7 billion in the third quarter of 2025.\n•\nGAAP diluted loss per share was $(13.50) for the third quarter of 2025, driven by the goodwill impairment.\n•\nAdjusted diluted earnings per share (EPS) of $0.50 for the third quarter of 2025.\n23\nTable of Contents\nA reconciliation from GAAP diluted earnings (loss) per share to adjusted diluted EPS is highlighted below, and additional detail is provided above under the heading \"\nNon-GAAP Financial Presentation\n\":\nWe reference an adjusted SG&A expense ratio, defined as adjusted SG&A expenses, which excludes acquisition and divestiture related expenses and other items, divided by premium and service revenues. A reconciliation from GAAP SG&A to adjusted SG&A and additional detail is provided above under the heading \"\nNon-GAAP Financial Presentation\n.\" We also reference effective tax rate on adjusted earnings, defined as GAAP income tax expense (benefit) excluding the income tax effects of adjustments to net earnings divided by adjusted earnings before income tax expense. \nThree Months Ended September 30,\n2025\n2024\nGAAP diluted earnings (loss) per share attributable to Centene\n$\n(13.50)\n$\n1.36 \nAmortization of acquired intangible assets\n0.35 \n0.33 \nAcquisition and divestiture related expenses\n— \n0.02 \nOther adjustments \n(1)\n13.75 \n— \nIncome tax effects of adjustments \n(2)\n(0.10)\n(0.09)\nAdjusted diluted EPS\n$\n0.50 \n$\n1.62 \n(1)\n  Other adjustments include the following pre-tax items:\n2025\n:\n(a)\n \ngoodwill impairment of $6,723 million, or $13.69 per share ($13.67 after-tax), real estate impairment of $22 million, or $0.04 per share ($0.04 after-tax), and exit costs related to the wind-down of certain contracts in the Other segment of $9 million, or $0.02 per share ($0.02 after-tax).\n(2)  \nThe income tax effects of adjustments are based on the effective income tax rates applicable to each adjustment. The three months ended September 30, 2025, include a tax benefit of $4 million, or $0.01 per share, related to tax adjustments on previously reported divestitures and impacts of the OBBBA. The three months ended September 30, 2024, include a tax benefit of $2 million, or $0.00 per share, related to tax adjustments on previously reported divestitures.\nCurrent and Future Operating Drivers\nThe following items contributed to our results of operations as compared to the previous year:\nMedicaid\n•\nIn July 2025, our subsidiary, Iowa Total Care, commenced the contract to continue providing Medicaid managed care services under the Iowa Health Link program. The contract has a four-year term, with an optional two-year extension, for a total of six possible contract years.\n•\nIn July 2025, our subsidiary, Magnolia Health Plan (Magnolia), commenced the Mississippi Division of Medicaid contract to continue serving the state's Coordinated Care Organization Program consisting of the Mississippi Coordinated Access Network and the Mississippi Children's Health Insurance Program (CHIP). The contract has a four-year term, with two optional one-year extensions, for a total of six possible contract years.\n•\nIn February 2025, our subsidiary, Sunshine Health, commenced the expanded Statewide Medicaid Managed Care (SMMC) program, including integrated Managed Medical Assistance, Long-Term Care services, Serious Mental Illness, Child Welfare and HIV specialty products. The expanded SMMC program now includes coverage for Behavior Analysis services. The contract has a six-year term. Additionally, coverage for Behavior Analysis services was also added to the existing Children's Medical Services contract beginning February 2025.\n•\nIn January 2025, our subsidiary, Sunflower Health Plan, commenced the contract to continue providing managed health care services through KanCare, the State of Kansas' Medicaid and CHIP. The contract has a three-year term, with two optional one-year extensions, for a total of five possible contract years.\n24\nTable of Contents\n•\nIn October 2024, our subsidiary, Meridian Health Plan of Michigan, commenced the contract awarded by the Michigan Department of Health and Human Services (MDHHS) to continue serving as a Medicaid health plan for the Comprehensive Health Care Program. The contract has a five-year term, with three optional one-year extensions, for a total of eight possible contract years.\n•\nIn September 2024, our subsidiary, Superior HealthPlan (Superior), commenced the contract awarded by the Texas Health and Human Services Commission to continue to provide healthcare coverage to the aged, blind or disabled (ABD) population in the state's STAR+PLUS program. The contract has a six-year term with a maximum of three additional two-year extensions.\n•\nIn September 2024, our subsidiary, NH Healthy Families, commenced the contract awarded by the New Hampshire Department of Health and Human Services to continue providing physical health, behavioral health and pharmacy services for New Hampshire's Medicaid managed care program, known as Medicaid Care Management. The contract has a five-year term.\n•\nIn July 2024, our subsidiaries, Carolina Complete Health and WellCare of North Carolina, began coordinating physical and other health services with Local Management Entities/Managed Care Organizations under the state's new Tailored Plan program. The Tailored Plans are integrated health plans designed for individuals with significant behavioral health needs or intellectual/developmental disabilities.\n•\nIn June 2024, our subsidiary, Western Sky Community Care, concluded serving members upon the expiration of its New Mexico Medicaid managed care contract.\n•\nIn April 2024, our subsidiary, Oklahoma Complete Health, commenced the statewide contracts to provide managed care for the SoonerSelect and SoonerSelect Children's Specialty Plan programs. The new contracts have a one-year term with five, one-year renewal options.\n•\nIn January 2024, our subsidiary, Nebraska Total Care, commenced the statewide Medicaid managed care contract to continue serving the state's Medicaid Managed Care Program, known as Heritage Health. The initial contract term is five years and includes the option for two subsequent, one-year renewals, for a potential total of seven years.\n•\nIn January 2024, our California health plan commenced direct Medicaid contracts in 10 counties (Los Angeles, Sacramento, Amador, Calaveras, Inyo, Mono, San Joaquin, Stanislaus, Tulare and Tuolumne). In Los Angeles, a portion of the membership is subcontracted. Prior to January 2024, our California health plan previously served the state's Medicaid Managed Care population with contracts in 13 counties, including San Diego.\nMedicare / Dual-Eligible\n•\nGiven our strong bid positioning, PDP membership increased 18% year-over-year. Additionally, the IRA changes effective for 2025 result in a meaningful shift in cost-sharing responsibilities between members, drug companies, CMS, and PDPs and have led to a significant increase in our premiums in consideration for our PDPs responsibility for a larger portion of total Part D benefit costs. These changes also result in a change to the quarterly progression of the Medicare segment HBR.\n•\nIn December 2024, we recorded a premium deficiency reserve of $92 million related to the 2025 Medicare Advantage contract year. The premium deficiency reserve was increased to $270 million in the first quarter of 2025, to $389 million in the second quarter of 2025 and decreased by $107 million to $282 million in the third quarter of 2025 based on the progression of earnings during the year (with higher earnings at the beginning of the year and lower at the end of the year, given cost sharing progression). The premium deficiency reserve related to the 2025 Medicare Advantage contract year will be released in the fourth quarter of 2025.\n•\nIn 2025, Wellcare is offering Medicare Advantage plans in 32 states, including its newest state, Iowa. Wellcare discontinued offering Medicare Advantage products in Alabama, Massachusetts, New Hampshire, New Mexico, Rhode Island and Vermont in 2025. Consistent with our strategic positioning and bid strategy, Medicare Advantage membership declined 10% year-over-year.\n25\nTable of Contents\nCommercial\n•\nIn July 2025, we announced a reduction to our expectation for the 2025 benefit year net risk adjustment revenue transfer as a result of significantly higher estimated aggregate market morbidity, with a corresponding decrease in our earnings expectations for 2025. The nine months ended September 30, 2024, benefited from outperformance in Marketplace risk adjustment for the 2023 benefit year.\n•\nIn 2025, our Health Insurance Marketplace product, Ambetter Health, expanded its geographic footprint, adding 60 new counties across 10 states, which includes expansion into Iowa. Additionally, Marketplace membership increased 29% year-over-year due to the expanded footprint, strong open enrollment results, as well as overall market growth.\nOther\n•\nIn December 2024, Health Net Federal Services concluded serving members upon the expiration of its TRICARE Managed Care Support Contract.\n•\nIn October 2024, we completed the sale of Collaborative Health Systems, a management services organization.\n•\nIn July 2024, our subsidiary, Magellan Health, commenced the Idaho Behavioral Health Plan contract.\nThe benefits of successful execution of our value creation initiatives have impacted our current results of operations and will continue to impact future results of operations, including the implementation of our new third-party pharmacy benefits management (PBM) contract, which commenced in January 2024.\nWe expect the following items to impact our future results of operations, subject to the resolution of various third-party protests within the Medicaid segment:\nMedicaid\n•\nIn April 2025, our subsidiary, SilverSummit Healthplan, Inc., was selected by the Nevada Department of Health and Human Services to continue to provide services for its Medicaid managed care program. For the first time the program will include expansion of Medicaid Managed Care into rural and frontier service areas, communities that were previously fee-for-service. The contract is expected to begin in January 2026 and has a five-year term, with the option of a two-year extension, for a total of seven possible contract years.\n•\nIn September 2024, our subsidiary, Health Net Community Solutions, was selected by the California Department of Health Care Services to provide managed dental health care services to beneficiaries of Medi-Cal, the State's Medicaid program, in Los Angeles and Sacramento counties. The new 54-month contract is expected to begin in January 2026.\n•\nIn August 2024, our subsidiary, PA Health and Wellness, was selected by the Pennsylvania Department of Human Services to continue to administer Pennsylvania's Community HealthChoices program, the Medicaid managed care program that covers adults who are dually eligible for Medicare and Medicaid or who qualify to receive Medicaid long-term services and supports due to a need for the level of care provided in a nursing facility. A bid protest continues to be litigated and, at this time, it is unclear when the contract could be implemented.\n•\nIn December 2023, our subsidiary, Arizona Complete Health, was selected by the Arizona Health Care Cost Containment System – Arizona's single state Medicaid agency – to provide managed care for the Arizona Long Term Care System (ALTCS). The program supports Arizonans who are elderly and/or have a physical disability (E/PD) with physical and behavioral healthcare, as well as provides pharmacy benefits and home and community-based services. A prolonged bid protest has led the agency to cancel the original awards and issue a rebid. The rebid is expected to be open for submissions in late summer 2026 with a new contract effective date of October 2027.\nIn addition, we are in the process of protesting the results of Medicaid procurement awards in Georgia and Texas. If these protests are not successful, our future results of operations would be impacted.\n26\nTable of Contents\nMedicare / Dual-Eligible\n•\nIn October 2025, CMS issued 2026 Medicare Advantage Star Ratings on the Medicare Plan Finder. Based on the data, we had approximately 60% of our Medicare Advantage membership enrolled in plans rated 3.5 stars or higher, including approximately 20% in 4-star rated plans. This compares to approximately 55% rated in 3.5 stars (and 1% in 4-star) in the prior year.\n•\nIn March 2025, our subsidiary, Meridian Health Plan of Illinois, Inc., was selected by the Illinois Department of Healthcare and Family Services to continue providing Medicare and Medicaid services for dually eligible Illinoisans through a Fully Integrated Dual Eligible Special Needs Plan (FIDE SNP). The contract is expected to begin in January 2026 and has a four-year term, with optional extensions of six months to five and a half years.\n•\nIn November 2024, our subsidiary, Buckeye Health Plan, was selected by the Ohio Department of Medicaid to continue providing Medicare and Medicaid services for dually eligible individuals through a FIDE SNP. The three-year contract is expected to begin in January 2026.\n•\nIn October 2024, our subsidiary, Meridian Health Plan of Michigan, Inc., was selected by the MDHHS to provide highly integrated Medicare and Medicaid services for dually eligible Michiganders through a Highly Integrated Dual Eligible Special Needs Plan (HIDE SNP). The plan is expected to begin in January 2026 and has a seven-year term, with three optional one-year extensions, for a total of 10 possible contract years.\n•\nIn October 2024, CMS issued 2025 Medicare Advantage Star Ratings on the Medicare Plan Finder. Based on the data, we had approximately 55% of our Medicare Advantage membership enrolled in plans rated 3.5 stars or higher – compared to approximately 23% in the prior year.\nCommercial\n•\nIn the third quarter of 2025, we completed the process of refiling 2026 policy year rates to reflect a higher projected baseline of Marketplace morbidity than previously expected. Barring state-specific changes, we expect to be able to take corrective pricing actions for 2026 in states representing approximately 95% of our Marketplace membership.\n27\nTable of Contents\nMEMBERSHIP\nFrom September 30, 2024 to September 30, 2025, our managed care membership decreased by 672 thousand, or 2%. The following table sets forth our membership by line of business:\n \nSeptember 30, 2025\nDecember 31, 2024\nSeptember 30, 2024\nTraditional Medicaid \n(1)\n11,115,400 \n11,408,100 \n11,478,600 \nHigh Acuity Medicaid \n(2)\n1,591,000 \n1,595,400 \n1,590,200 \nTotal Medicaid\n12,706,400 \n13,003,500 \n13,068,800 \nMarketplace\n5,828,100 \n4,382,100 \n4,501,300 \nIndividual and Commercial Group \n(3)\n447,900 \n431,400 \n426,600 \nTotal Commercial\n6,276,000 \n4,813,500 \n4,927,900 \nMedicare \n(4)\n1,013,200 \n1,110,900 \n1,129,900 \nMedicare PDP\n7,972,500 \n6,925,700 \n6,766,400 \nTotal at-risk membership\n27,968,100 \n25,853,600 \n25,893,000 \nTRICARE eligibles\n— \n2,747,000 \n2,747,000 \nTotal\n27,968,100 \n28,600,600 \n28,640,000 \n(1)\nMembership includes Temporary Assistance for Needy Families (TANF), Medicaid Expansion, Children's Health Insurance Program (CHIP), Foster Care, and Behavioral Health.\n(2)\nMembership includes Aged, Blind, or Disabled (ABD), Intellectual and Developmental Disabilities (IDD), Long-Term Services and Supports (LTSS) and Medicare-Medicaid Plans (MMP) Duals.\n(3)\nMembership includes Commercial Group, Individual Coverage Health Reimbursement Arrangement (ICHRA) and Other Off-Exchange Individual.\n(4)\nMembership includes Medicare Advantage and Medicare Supplement.\n28\nTable of Contents\nRESULTS OF OPERATIONS\nThe following discussion and analysis is based on our Consolidated Statements of Operations, which reflect our results of operations for the three and nine months ended September 30, 2025 and 2024, prepared in accordance with generally accepted accounting principles in the United States (GAAP). \nSummarized comparative financial data for the three and nine months ended September 30, 2025 and 2024 is as follows ($ in millions, except per share data in dollars):\nThree Months Ended September 30,\nNine Months Ended September 30,\n \n2025\n2024\n% Change\n2025\n2024\n% Change\nPremium\n$\n44,126 \n$\n36,115 \n22 \n%\n$\n127,578 \n$\n106,784 \n19 \n%\nService\n772 \n784 \n(2)\n%\n2,276 \n2,425 \n(6)\n%\nPremium and service revenues\n44,898 \n36,899 \n22 \n%\n129,854 \n109,209 \n19 \n%\nPremium tax\n4,792 \n5,124 \n(6)\n%\n15,198 \n13,057 \n16 \n%\nTotal revenues\n49,690 \n42,023 \n18 \n%\n145,052 \n122,266 \n19 \n%\nMedical costs\n40,902 \n32,201 \n27 \n%\n116,213 \n93,898 \n24 \n%\nCost of services\n651 \n692 \n(6)\n%\n1,990 \n2,041 \n(2)\n%\nSelling, general and administrative expenses\n3,145 \n3,057 \n3 \n%\n9,534 \n9,169 \n4 \n%\nDepreciation expense\n147 \n140 \n5 \n%\n430 \n408 \n5 \n%\nAmortization of acquired intangible assets\n170 \n173 \n(2)\n%\n516 \n519 \n(1)\n%\nPremium tax expense\n4,886 \n5,095 \n(4)\n%\n15,449 \n13,218 \n17 \n%\nImpairment\n6,743 \n— \nn.m.\n6,798 \n13 \nn.m.\nEarnings (loss) from operations\n(6,954)\n665 \nn.m.\n(5,878)\n3,000 \n(296)\n%\nInvestment and other income\n450 \n432 \n4 \n%\n1,203 \n1,440 \n(16)\n%\nInterest expense\n(170)\n(176)\n3 \n%\n(510)\n(530)\n4 \n%\nEarnings (loss) before income tax\n(6,674)\n921 \n(825)\n%\n(5,185)\n3,910 \n(233)\n%\nIncome tax (benefit) expense\n(42)\n211 \n(120)\n%\n392 \n896 \n(56)\n%\nNet earnings (loss)\n(6,632)\n710 \nn.m.\n(5,577)\n3,014 \n(285)\n%\nLoss attributable to noncontrolling interests\n1 \n3 \n(67)\n%\n4 \n8 \n(50)\n%\nNet earnings (loss) attributable to Centene Corporation\n$\n(6,631)\n$\n713 \nn.m.\n$\n(5,573)\n$\n3,022 \n(284)\n%\nDiluted earnings (loss) per common share attributable to Centene Corporation\n$\n(13.50)\n$\n1.36 \nn.m.\n$\n(11.29)\n$\n5.69 \n(298)\n%\nn.m.: not meaningful\n29\nTable of Contents\nThree Months Ended September 30, 2025 Compared to Three Months Ended September 30, 2024\nTotal Revenues\nTotal revenues increased 18% in the three months ended September 30, 2025, over the corresponding period in 2024, primarily driven by premium and membership growth in the PDP business, overall market growth in the Marketplace business, and rate increases in the Medicaid business, partially offset by lower Medicaid membership.\nOperating Expenses\nMedical Costs/HBR\nThe HBR for the three months ended September 30, 2025, was 92.7%, compared to 89.2% in the same period in 2024. The increase was primarily driven by increased Marketplace medical costs, lower Marketplace estimated risk adjustment revenue and program changes in the PDP business as a result of the IRA as compared to the third quarter of 2024. The increase was also driven by higher medical costs in Medicaid driven primarily by behavioral health and home health, partially offset by Medicaid rate and revenue increases.\nCost of Services\nCost of services decreased by $41 million in the three months ended September 30, 2025, compared to the corresponding period in 2024. The cost of service ratio for the three months ended September 30, 2025, was 84.3%, compared to 88.3% in the same period in 2024.\nSelling, General & Administrative Expenses\nThe SG&A expense ratio was 7.0% for the third quarter of 2025, compared to 8.3% in the third quarter of 2024. The adjusted SG&A expense ratio was 7.0% for the third quarter of 2025, compared to 8.3% in the third quarter of 2024. The decreases were primarily driven by continued leveraging of expenses over higher revenues and growth in the PDP business, which operates at a meaningfully lower SG&A expense ratio as compared to the overall company. The decreases were partially offset by growth in the Marketplace business, which operates at a meaningfully higher SG&A expense ratio.\nImpairment\nDuring the three months ended September 30, 2025, we recorded total impairment charges of $6.7 billion driven by $6.7 billion goodwill impairment and $20 million owned real estate impairment.\n30\nTable of Contents\nOther Income (Expense)\nThe following table summarizes the components of other income (expense) for the three months ended September 30, ($ in millions): \n \n2025\n2024\nInvestment and other income\n$\n450 \n$\n432 \nInterest expense\n(170)\n(176)\nOther income (expense), net\n$\n280 \n$\n256 \nInvestment and other income.\n Investment and other income increased by $18 million in the three months ended September 30, 2025, compared to the corresponding period in 2024.\nInterest expense. \nInterest expense decreased by $6 million in the three months ended September 30, 2025, compared to the corresponding period in 2024.\nIncome Tax Expense\nFor the three months ended September 30, 2025, we recorded an income tax benefit of $42 million on a pre-tax loss of $6.7 billion, or an effective tax rate was 0.6%. The effective tax rate for the third quarter of 2025 reflects the non-deductible nature of the goodwill impairment and the impact of estimating interim period taxes on the year-to-date tax method. For the third quarter of 2025, our effective tax rate on adjusted earnings was 2.5%, which reflects the impact of estimating interim period taxes on the year-to-date tax method.\nFor the three months ended September 30, 2024, we recorded income tax expense of $211 million on pre-tax earnings of $921 million, or an effective tax rate of 22.9%. For the third quarter of 2024, our effective tax rate on adjusted earnings was 23.3%.\n31\nTable of Contents\nSegment Results\nThe following table summarizes our consolidated operating results by segment for the three months ended September 30, ($ in millions): \n \n2025\n2024\n% Change\nTotal Revenues\n \n \n \nMedicaid\n$\n27,963 \n$\n26,440 \n6 \n%\nMedicare\n9,391 \n5,643 \n66 \n%\nCommercial\n10,992 \n8,693 \n26 \n%\nOther\n1,344 \n1,247 \n8 \n%\nConsolidated total\n$\n49,690 \n$\n42,023 \n18 \n%\nGross Margin \n(1)\n \n \nMedicaid\n$\n1,532 \n$\n1,475 \n4 \n%\nMedicare\n538 \n675 \n(20)\n%\nCommercial\n1,116 \n1,736 \n(36)\n%\nOther\n159 \n120 \n33 \n%\nConsolidated total\n$\n3,345 \n$\n4,006 \n(17)\n%\n(1)\nGross margin represents premium and service revenues less medical costs and cost of services.\nMedicaid\nTotal revenues increased 6% in the three months ended September 30, 2025, compared to the corresponding period in 2024. The increase in total revenues was primarily driven by rate increases, partially offset by lower membership, primarily due to redeterminations. Gross margin increased $57 million in the three months ended September 30, 2025, compared to the corresponding period in 2024 primarily driven by rate and revenue increases.\nMedicare\nTotal revenues increased 66% in the three months ended September 30, 2025, compared to the corresponding period in 2024 primarily driven by increased PDP premiums and membership, partially offset by lower Medicare Advantage membership. Gross margin decreased $137 million in the three months ended September 30, 2025, compared to the corresponding period in 2024 primarily driven by the PDP business, specifically changes from the IRA, partially offset by premium and membership growth.\nCommercial\nTotal revenues increased 26% in the three months ended September 30, 2025, compared to the corresponding period in 2024 primarily driven by 29% membership growth in the Marketplace business. Gross margin decreased $620 million in the three months ended September 30, 2025, compared to the corresponding period in 2024 due to increased Marketplace medical costs and lower estimated risk adjustment revenue. \nOther\nTotal revenues increased 8% in the three months ended September 30, 2025, compared to the corresponding period in 2024. Gross margin increased $39 million in the three months ended September 30, 2025, compared to the corresponding period in 2024. The increases were primarily driven by rate increases.\n32\nTable of Contents\nNine Months Ended September 30, 2025 Compared to Nine Months Ended September 30, 2024 \nTotal Revenues\nTotal revenues increased 19% in the nine months ended September 30, 2025, over the corresponding period in 2024, primarily driven by premium and membership growth in the PDP business, overall market growth in the Marketplace business, and rate increases in the Medicaid business and increased premium tax revenue, partially offset by lower Medicaid membership as a result of redeterminations and lower Marketplace estimated risk adjustment revenue. The nine months ended September 30, 2024, benefited from outperformance in Marketplace risk adjustment for the 2023 benefit year.\nOperating Expenses\nMedical Costs/HBR\nThe HBR for the nine months ended September 30, 2025, was 91.1%, compared to 87.9% in the same period in 2024. The increase was primarily driven by lower Marketplace estimated risk adjustment revenue, increased Marketplace medical costs and higher medical costs in Medicaid driven primarily by behavioral health, home health and high-cost drugs, partially offset by Medicaid rate increases.\nCost of Services\nCost of services decreased by $51 million in the nine months ended September 30, 2025, compared to the corresponding period in 2024. The cost of service ratio for the nine months ended September 30, 2025, was 87.4%, compared to 84.2% in the same period in 2024.\nSelling, General & Administrative Expenses\nThe SG&A expense ratio for the nine months ended September 30, 2025, was 7.3%, compared to 8.4% for the corresponding period in 2024. The adjusted SG&A expense ratio for the nine months ended September 30, 2025, was 7.3%, compared to 8.3% for the nine months ended September 30, 2024. The decreases were primarily driven by continued leveraging of expenses over higher revenues and growth in the PDP business, which operates at a meaningfully lower SG&A expense ratio as compared to the overall company. The decreases were partially offset by growth in the Marketplace business, which operates at a meaningfully higher SG&A expense ratio.\nImpairment\nDuring the nine months ended September 30, 2025, we recorded total impairment charges of $6.8 billion, driven by $6.7 billion goodwill impairment, $55 million intangible asset impairment related to the wind-down of certain contracts in the Other segment, and $20 million owned real estate impairment.\nDuring the nine months ended September 30, 2024, we recorded total impairment charges of $13 million, driven by Health Net Federal Services property, software and equipment related to the TRICARE Managed Care Support Contract that was no longer recoverable following the 2024 final ruling.\n33\nTable of Contents\nOther Income (Expense) \nThe following table summarizes the components of other income (expense) for the nine months ended September 30, ($ in millions): \n \n2025\n2024\nInvestment and other income\n$\n1,203 \n$\n1,440 \nInterest expense\n(510)\n(530)\nOther income (expense), net\n$\n693 \n$\n910 \nInvestment and other income. \nInvestment and other income decreased by $237 million in the nine months ended September 30, 2025, compared to the corresponding period in 2024. The decrease was driven by lower interest rates and lower average investment balances during 2025. The nine months ended September 30, 2024, also included net gains on divestitures.\nInterest expense. \nInterest expense decreased by $20 million in the nine months ended September 30, 2025, compared to the corresponding period in 2024.\nIncome Tax Expense\nFor the nine months ended September 30, 2025, we recorded income tax expense of $392 million on a pre-tax loss of $5.2 billion, or an effective tax rate of (7.6)%. The effective tax rate for the nine months ended September 30, 2025 reflects the non-deductible nature of the goodwill impairment. For the nine months ended September 30, 2025, our effective tax rate on adjusted earnings was 25.1%.\nFor the nine months ended September 30, 2024, we recorded income tax expense of $896 million on pre-tax earnings of $3.9 billion, or an effective tax rate of 22.9%. The effective tax rate for 2024 reflects the tax effects of the Circle Health Group (Circle Health) divestiture. For the nine months ended September 30, 2024, our effective tax rate on adjusted earnings was 24.2%.\n34\nTable of Contents\nSegment Results\nThe following table summarizes our consolidated operating results by segment for the nine months ended September 30, ($ in millions):\n \n2025\n2024\n% Change\nTotal Revenues\n \n \n \nMedicaid\n$\n82,391 \n$\n76,083 \n8 \n%\nMedicare\n27,600 \n17,556 \n57 \n%\nCommercial\n31,211 \n24,979 \n25 \n%\nOther\n3,850 \n3,648 \n6 \n%\nConsolidated total\n$\n145,052 \n$\n122,266 \n19 \n%\nGross Margin \n(1)\n \n \nMedicaid\n$\n4,081 \n$\n4,880 \n(16)\n%\nMedicare\n2,605 \n1,866 \n40 \n%\nCommercial\n4,604 \n6,074 \n(24)\n%\nOther\n361 \n450 \n(20)\n%\nConsolidated total\n$\n11,651 \n$\n13,270 \n(12)\n%\n(1)\nGross margin represents premium and service revenues less medical costs and cost of services.\nMedicaid\nTotal revenues increased 8% in the nine months ended September 30, 2025, compared to the corresponding period in 2024. The increase in total revenues was primarily driven by increased premium tax revenue and rate increases, partially offset by lower membership, primarily due to redeterminations. Gross margin decreased $799 million in the nine months ended September 30, 2025, compared to the corresponding period in 2024. Gross margin decreased due to higher medical costs driven primarily by behavioral health, home health and high-cost drugs, partially offset by rate and revenue increases.\nMedicare\nTotal revenues increased 57% in the nine months ended September 30, 2025, compared to the corresponding period in 2024, primarily driven by increased PDP premiums and membership, partially offset by lower Medicare Advantage membership. Gross margin increased $739 million in the nine months ended September 30, 2025, compared to the corresponding period in 2024 primarily driven by the PDP business, specifically changes from the IRA, partially offset by premium and membership growth.\nCommercial\nTotal revenues increased 25% in the nine months ended September 30, 2025, compared to the corresponding period in 2024 primarily driven by 29% membership growth in the Marketplace business, partially offset by lower estimated risk adjustment revenue. Gross margin decreased $1.5 billion in the nine months ended September 30, 2025, compared to the corresponding period in 2024 due to lower estimated risk adjustment revenue and increased Marketplace medical costs.\nOther\nTotal revenues increased 6% in the nine months ended September 30, 2025, compared to the corresponding period in 2024. Gross margin decreased $89 million in the nine months ended September 30, 2025, compared to the corresponding period in 2024 driven by the Circle Health divestiture in the first quarter of 2024 along with the expiration of the TRICARE Managed Care Support Contract in December 2024.\n35\nTable of Contents\nLIQUIDITY AND CAPITAL RESOURCES\nShown below is a condensed schedule of cash flows used in the discussion of liquidity and capital resources ($ in millions).\n \nNine Months Ended September 30,\n \n2025\n2024\nNet cash provided by operating activities\n$\n4,651 \n$\n741 \nNet cash (used in) investing activities\n(188)\n(1,154)\nNet cash (used in) financing activities\n(1,434)\n(2,393)\nEffect of exchange rate changes on cash and cash equivalents\n— \n7 \nNet increase (decrease) in cash, cash equivalents and restricted cash and cash equivalents\n$\n3,029 \n$\n(2,799)\nCash Flows Provided by Operating Activities\nNormal operations are funded primarily through operating cash flows and borrowings under our Revolving Credit Facility. Operating activities provided cash of $4.7 billion in the nine months ended September 30, 2025, compared to providing cash of $741 million in the comparable period in 2024.\nCash flows provided by operations in 2025 were primarily driven by net earnings, improved pharmacy rebate remittance timing and timing of claims and other payments. Cash flows provided by operations in 2024 were driven by net earnings, partially offset by pharmacy rebate remittance timing as we transitioned to the new third-party PBM, which commenced in January 2024, and risk adjustment payments for the Marketplace 2023 benefit year.\nCash Flows (Used in) Investing Activities\nInvesting activities used cash of $188 million in the nine months ended September 30, 2025, compared to using cash of $1.2 billion in the comparable period in 2024. Cash flows used in investing activities in the nine months ended September 30, 2025 were driven primarily by net additions to the investment portfolio of our regulated subsidiaries (including transfers from cash and cash equivalents to long-term investments) and capital expenditures. Cash flows used in investing activities in the nine months ended September 30, 2024 were primarily driven by net additions to the investment portfolio of our regulated subsidiaries (including transfers from cash and cash equivalents to long-term investments) and capital expenditures, partially offset by divestiture proceeds.\nWe spent $554 million and $490 million in the nine months ended September 30, 2025 and 2024, respectively, on capital expenditures, the majority of which was driven by system enhancements and computer hardware.\nAs of September 30, 2025, our investment portfolio consisted primarily of fixed-income securities with an average duration of 3.4 years. At September 30, 2025, we had unregulated cash and investments of $1.3 billion, including $357 million of cash and cash equivalents and $902 million of investments. Unregulated cash and investments at December 31, 2024, was $1.1 billion, including $248 million of cash and cash equivalents and $823 million of investments.\nCash Flows (Used in) Financing Activities\nFinancing activities used cash of $1.4 billion in the nine months ended September 30, 2025, compared to using cash of $2.4 billion in the comparable period in 2024. Financing activities in 2025 were driven by net decreases in debt of $971 million and stock repurchases of $473 million, which included $400 million under the stock repurchase program and $46 million of repurchases related to income tax withholding upon the vesting of previously awarded stock grants.\nFinancing activities in 2024 were driven by stock repurchases of $2.2 billion and net decreases in debt of $244 million.\nLiquidity Metrics\nWe have a stock repurchase program authorizing us to repurchase common stock from time to time on the open market or through privately negotiated transactions. In 2023, the Company's Board of Directors authorized up to a cumulative total of $10.0 billion of repurchases under the program.\n36\nTable of Contents\nDuring the third quarter of 2025, we made no repurchases under the stock repurchase program. We have $1.8 billion available under the program for repurchases as of September 30, 2025. No duration has been placed on the repurchase program. We reserve the right to discontinue the repurchase program at any time. Refer to Note 8. \nStockholders' Equity\n for further information on stock repurchases.\nAs of September 30, 2025, we had an aggregate principal amount of $15.7 billion of senior notes issued and outstanding. The indentures governing our various maturities of senior notes contain restrictive covenants. As of September 30, 2025, we were in compliance with all covenants.\nAs part of our capital allocation strategy, we may decide to repurchase debt or raise capital through the issuance of debt. In 2022, the Company's Board of Directors authorized a $1.0 billion senior note debt repurchase program. No repurchases were made during the quarter ended September 30, 2025. As of September 30, 2025, there was $700 million available under the senior note debt repurchase program.\nThe credit agreement underlying our Revolving Credit Facility, in the principal amount of $4.0 billion, and Term Loan Facility, in the principal amount of $2.0 billion, contains customary covenants as well as financial covenants including a debt-to-capital ratio. Our maximum debt-to-capital ratio under the credit agreement may not exceed 0.60 to 1.00. As of September 30, 2025, we had no borrowing outstanding under our Revolving Credit Facility, $2.0 billion of borrowings under our Term Loan Facility, and we were in compliance with all covenants. As of September 30, 2025, there were no limitations on the availability of our Revolving Credit Facility as a result of the debt-to-capital ratio.\nWe had outstanding letters of credit of $120 million as of September 30, 2025, which were not part of our Revolving Credit Facility. The letters of credit bore weighted interest of 0.8% as of September 30, 2025. In addition, we had outstanding surety bonds of $779 million as of September 30, 2025.\nAt September 30, 2025, our debt-to-capital ratio, defined as total debt divided by the sum of total debt and total equity, was 45.5%, compared to 41.2% at December 31, 2024. The debt-to-capital ratio increase was driven by the goodwill impairment recorded in the third quarter of 2025, which reduced total stockholders' equity. We utilize the debt-to-capital ratio as a measure, among others, of our leverage and financial flexibility.\nAt September 30, 2025, we had working capital, defined as current assets less current liabilities, of $3.4 billion, compared to $3.7 billion at December 31, 2024. We manage our short-term and long-term investments aiming to ensure a sufficient portion of the portfolio is highly liquid and can be sold to fund short-term requirements as needed.\nFuture Expectations\nDuring the remainder of 2025, we expect net dividends of approximately $200 million from our insurance subsidiaries and to spend approximately $200 million in additional capital expenditures.\nBased on our operating plan, we expect that our available cash, cash equivalents and investments, cash from our operations and cash available under our Revolving Credit Facility will be sufficient to finance our general operations and capital expenditures for at least 12 months from the date of this filing. While we are currently in a strong liquidity position and believe we have adequate access to capital, we may elect to increase borrowings on our Revolving Credit Facility, which matures in March 2030. Additionally, our senior notes mature between December 2027 and August 2031. From time to time, we may elect to raise additional funds for working capital and other purposes, either through issuance of debt or equity, the sale of investment securities, or otherwise, as appropriate. In addition, we may strategically pursue refinancing or redemption opportunities to extend maturities and/or improve terms of our indebtedness if we believe such opportunities are favorable to us.\n37\nTable of Contents\nREGULATORY CAPITAL AND DIVIDEND RESTRICTIONS\n \nOur operations are conducted through our subsidiaries. As managed care organizations, most of our subsidiaries are subject to state regulations and other requirements that, among other things, require the maintenance of minimum levels of statutory capital, as defined by each state, and restrict the timing, payment and amount of dividends and other distributions that may be paid to us. Generally, the amount of dividend distributions that may be paid by a regulated subsidiary without prior approval by state regulatory authorities is limited based on the entity's level of statutory net income and statutory capital and surplus.\nOur regulated subsidiaries are required to maintain minimum capital requirements prescribed by various regulatory authorities in each of the states in which we operate. During the nine months ended September 30, 2025, we received dividends of $2.0 billion from and made $1.4 billion of capital contributions to our regulated subsidiaries. For our subsidiaries that file with the National Association of Insurance Commissioners (NAIC), the aggregate risk-based capital (RBC) level as of December 31, 2024, which was the most recent date for which reporting was required, was in excess of 350% of the Authorized Control Level. We expect to continue to maintain an aggregate RBC level in excess of 350% of the Authorized Control Level during 2025.\nUnder the California Knox-Keene Health Care Service Plan Act of 1975, as amended (Knox-Keene), certain of our California subsidiaries must comply with tangible net equity (TNE) requirements. Under these Knox-Keene TNE requirements, actual net worth less certain unsecured receivables and intangible assets must be more than the greater of (i) a fixed minimum amount, (ii) a minimum amount based on premiums or (iii) a minimum amount based on healthcare expenditures, excluding capitated amounts.\nUnder the New York State Department of Health Codes, Rules and Regulations Title 10, Part 98, our New York subsidiary must comply with contingent reserve requirements. Under these requirements, net worth based upon admitted assets must equal or exceed a minimum amount based on annual net premium income.\nThe NAIC has adopted rules which set minimum RBC requirements for insurance companies, managed care organizations and other entities bearing risk for healthcare coverage. As of September 30, 2025, each of our health plans was in compliance with the RBC requirements enacted in those states.\nAs a result of the above requirements and other regulatory requirements, certain of our subsidiaries are subject to restrictions on their ability to make dividend payments, loans or other transfers of cash to their parent companies. Such restrictions, unless amended or waived or unless regulatory approval is granted, limit the use of any cash generated by these subsidiaries to pay our obligations. The maximum amount of dividends that can be paid by our insurance company subsidiaries without prior approval of the applicable state insurance departments is subject to restrictions relating to statutory surplus, statutory income and unassigned surplus.\nCRITICAL ACCOUNTING ESTIMATES\nThe passage of the One Big Beautiful Bill Act in July 2025 had various implications, including potential membership impacts to our Medicaid reporting unit as well as the non-renewal of Marketplace enhanced APTCs. As a result of these market conditions along with the decline in our stock price, we performed a quantitative impairment analysis during the third quarter to determine whether goodwill, intangibles or other assets were impaired.\nOur quantitative assessment for goodwill indicated that the fair value of certain reporting units had declined, resulting in an impairment of $6.7 billion as outlined within Note 4. \nGoodwill and Intangible Assets\n, in the Notes to the Consolidated Financial Statements, included herein. In preparing the quantitative assessment, we estimated the fair value of our reporting units using a discounted cash flow model and guideline public company market approach. This analysis involved significant judgment, including estimates of forecasted future cash flows, the discount rate applied to each reporting unit, long-term growth rates, statutory capital reinvestment requirements, capital expenditures, and other internal and external factors. When analyzing the fair value indicated under the guideline public company market approach, we also considered estimates of market-based multiples of earnings from peer public companies. While we believe the assumptions and estimates used in our valuation procedures were appropriate, other assumptions and estimates could be applied and might produce significantly different results.\nFor a more complete discussion of the accounting judgments and estimates that we have identified as critical in the preparation of our condensed consolidated financial statements, please refer to \"\nCritical Accounting Estimates in Item 7 - Management's Discussion and Analysis of Financial Condition and Results of Operations\n\" included in our 2024 Annual Report on Form 10-K.\n38\nTable of Contents"
}