{
  "source_file": "cnp-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2.\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS OF CENTERPOINT ENERGY, INC. AND SUBSIDIARIES\nThe following combined discussion and analysis should be read in combination with the Interim Condensed Financial Statements contained in this combined Form 10-Q and the Registrants’ combined 2024 Form 10-K. When discussing CenterPoint Energy’s consolidated financial information, it includes the results of Houston Electric and CERC, which, along with CenterPoint Energy, are collectively referred to as the Registrants. Unless the context indicates otherwise, specific references to Houston Electric and CERC also pertain to CenterPoint Energy. In this combined Form 10-Q, the terms “our,” “we” and “us” are used as abbreviated references to CenterPoint Energy, Inc. together with its consolidated subsidiaries, including Houston Electric and CERC, unless otherwise stated. No Registrant makes any representations as to the information related solely to CenterPoint Energy or the subsidiaries of CenterPoint Energy other than itself. \nRECENT EVENTS\nOhio Securities Purchase Agreement. \nOn October 20, 2025, CenterPoint Energy, through CERC Corp., entered into the Ohio Securities Purchase Agreement to sell all of the issued and outstanding equity interests in CEOH. The proposed transaction is expected to close in the fourth quarter of 2026. For further information, see Note 16 the Interim Condensed Financial Statements.\nCenterPoint Energy Board Leadership Structure Changes.\n On October 8, 2025, the Board unanimously appointed Jason P. Wells, Chief Executive Officer and President of CenterPoint Energy, to serve as Chair of the Board, effective immediately. Mr. Wells has served as a director on the Board since January 5, 2024. In addition, the Board approved the creation of a Lead Director of the Board position and the independent directors of the Board unanimously appointed independent director Christopher H. Franklin to serve as the Lead Director of the Board, effective immediately.\n10-Year Capital Plan. \nOn September 29, 2025, CenterPoint Energy announced a new 10-year capital plan to invest $65 billion from 2026 through 2035, inclusive of a $2 billion increase in planned capital expenditures through 2030. The new plan is expected to advance economic growth, enhance the experience of the Registrants’ customers and deliver consistent value for stakeholders across the Registrants’ jurisdictions.\nCenterPoint Energy Appointment of Chief Operating Officer.\n On July 21, 2025, CenterPoint Energy announced the appointment of Jesus Soto, Jr. to the position of Executive Vice President and Chief Operating Officer of CenterPoint Energy, effective August 11, 2025.\nOne Big Beautiful Bill Act (OBBBA) and Executive Order 14315.\n On July 4, 2025, the OBBBA was signed into law. The OBBBA includes significant provisions, such as the permanent extension of certain expiring provisions of the Tax Cuts and Jobs Act of 2017 and numerous changes to the energy tax credits initially introduced and expanded under the IRA. The legislation has multiple effective dates, with certain provisions effective in 2025 and others implemented through 2027. Additionally, on July 7, 2025, President Trump issued Executive Order 14315, which relates to the implementation of such changes to energy tax credits. The Registrants are evaluating the OBBBA for the effect on their future financial results, and the Registrants will consider the impacts of the OBBBA and Executive Order 14315, as well as related guidance, on any future generation projects, including any BTAs or PPAs, as applicable. As a result of the Registrants having limited generation activities qualifying for tax credits under the IRA, the Registrants do not expect material impacts resulting from the changes to the IRA. \nTemporary Generation. \nIn June 2025, Houston Electric entered into definitive documentation, subject to PUCT approval, with relevant parties to release the 15 large 27 MW to 32 MW TEEEF units to the San Antonio area for a period of up to two years, during which time Houston Electric will not receive revenue or profit from ERCOT and will also not charge Houston-area customers for these TEEEF units while they are in San Antonio serving ERCOT. On July 9, 2025, the PUCT referred this docket to the SOAH. Following various preliminary orders, the SOAH set the prehearing conference for November 12, 2025 and set the hearing on the merits for November 13 through November 14, 2025. For additional information, see Note 6 to the Interim Condensed Financial Statements.\nRegulatory Proceedings. \nFor further information, see Note 6 to the Interim Condensed Financial Statements. For information related to our pending and completed regulatory proceedings to date in 2025, see “Liquidity and Capital Resources —Regulatory Matters” below.\nDebt Transactions.\n In October 2025, CenterPoint Energy completed cash tender offers for up to (i) $300 million aggregate purchase price of certain of CenterPoint Energy’s outstanding senior notes, ranging from 2.65% to 3.70% due 2030 to 2049, and (ii) $200 million aggregate purchase price of certain of Houston Electric’s general mortgage bonds, ranging from 4.25% to \n51\nTable of Contents\n4.50% due 2044 to 2049. Additionally, in October 2025, CenterPoint Energy issued $700 million aggregate principal amount of 5.950% Fixed-to-Fixed Reset Rate Junior Subordinated Notes, Series D, due 2056. For information about debt transactions to date in 2025, see Note 9 and Note 16 to the Interim Condensed Financial Statements. \n52\nTable of Contents\nCENTERPOINT ENERGY CONSOLIDATED RESULTS OF OPERATIONS\nFor information regarding factors that may affect the future results of our consolidated operations, see “Risk Factors” in Part I, Item 1A of the Registrants’ combined 2024 Form 10-K.\nNet income (loss) for the three and nine months ended September 30, 2025 and 2024 was as follows:\nThree Months Ended September 30,\nNine Months Ended September 30,\n2025\n2024\nFavorable (Unfavorable)\n2025\n2024\nFavorable (Unfavorable)\n(in millions)\nElectric\n$\n293 \n$\n226 \n$\n67 \n$\n572 \n$\n562 \n$\n10 \nNatural Gas\n71 \n30 \n41 \n385 \n360 \n25 \nTotal Utility Operations\n364 \n256 \n108 \n957 \n922 \n35 \nCorporate and Other (1)\n(71)\n(63)\n(8)\n(169)\n(151)\n(18)\nTotal CenterPoint Energy\n$\n293 \n$\n193 \n$\n100 \n$\n788 \n$\n771 \n$\n17 \n(1)\nIncludes unallocated corporate costs, interest income and interest expense and intercompany eliminations.\nThree months ended\n \nSeptember 30, 2025 compared to three months ended September 30, 2024 \nNet income increased $100 million primarily due to the following items: \n•\nan increase in net income of $67 million for the Electric reportable segment, as further discussed below;\n•\nan increase in net income of $41 million for the Natural Gas reportable segment, as further discussed below; and\n•\nan increase in net loss of $8 million for Corporate and Other, primarily due to increased borrowing costs.\nNine months ended\n \nSeptember 30, 2025 compared to nine months ended September 30, 2024 \nNet income increased $17 million primarily due to the following items:\n•\nan increase in net income of $10 million for the Electric reportable segment, as further discussed below;\n•\nan increase in net income of $25 million for the Natural Gas reportable segment, as further discussed below; and\n•\nan increase in net loss of $18 million for Corporate and Other, primarily due to a $34 million after-tax expense associated with increased borrowing costs partially offset by a $21 million after-tax gain on early extinguishment of debt with proceeds from the divestiture of the Louisiana and Mississippi natural gas LDCs. The remaining variance is primarily driven by an increase in income tax expense. See Note 3 and Note 9 for additional detail.\nIncome Tax Expense. \nFor a discussion of effective tax rate per period, see Note 10 to the Interim Condensed Financial Statements.\n53\nTable of Contents\nCENTERPOINT ENERGY’S RESULTS OF OPERATIONS BY REPORTABLE SEGMENT\nCenterPoint Energy’s CODM views net income as the measure of profit or loss for the reportable segments. Segment results include inter-segment interest income and expense, which may result in inter-segment profit and loss.\nThe following discussion of CenterPoint Energy’s results of operations is separated into two reportable segments, Electric and Natural Gas.\nElectric (CenterPoint Energy)\nFor information regarding factors that may affect the future results of operations of CenterPoint Energy’s Electric reportable segment, see “Risk Factors — Risk Factors Affecting Operations — Electric Generation, Transmission and Distribution,” “— Risk Factors Affecting Regulatory, Environmental and Legal Risks,” “— Risk Factors Affecting Financial, Economic and Market Risks,” “— Risk Factors Affecting Safety and Security Risks” and “— General and Other Risks” in Part I, Item 1A of the Registrants’ combined 2024 Form 10-K.\nThe following table provides summary data of CenterPoint Energy’s Electric reportable segment:\nThree Months Ended September 30,\nNine Months Ended September 30,\n2025\n2024\nFavorable (Unfavorable)\n2025\n2024\nFavorable (Unfavorable)\n(in millions, except operating statistics)\nRevenues\n$\n1,365 \n$\n1,243 \n$\n122 \n$\n3,622 \n$\n3,499 \n$\n123 \nExpenses:\n Utility natural gas, fuel and purchased power\n72 \n58 \n(14)\n211 \n151 \n(60)\nOperation and maintenance\n520 \n560 \n40 \n1,527 \n1,532 \n5 \nDepreciation and amortization\n247 \n201 \n(46)\n687 \n664 \n(23)\nTaxes other than income taxes\n82 \n73 \n(9)\n240 \n228 \n(12)\nTotal expenses\n921 \n892 \n(29)\n2,665 \n2,575 \n(90)\nOperating Income\n444 \n351 \n93 \n957 \n924 \n33 \nOther Income (Expense):\n Interest expense and other finance charges\n(116)\n(88)\n(28)\n(323)\n(276)\n(47)\nOther income, net\n21 \n16 \n5 \n60 \n45 \n15 \nIncome Before Income Taxes\n349 \n279 \n70 \n694 \n693 \n1 \nIncome tax expense\n56 \n53 \n(3)\n122 \n131 \n9 \nNet Income \n$\n293 \n$\n226 \n$\n67 \n$\n572 \n$\n562 \n$\n10 \nThroughput (in GWh):\nResidential\n12,088\n11,807\n2 \n%\n28,318\n27,219\n4 \n%\nTotal\n35,455\n32,633\n9 \n%\n90,519\n84,730\n7 \n%\nWeather (percentage of normal weather for service area):\nCooling degree days\n103 \n%\n105 \n%\n(2)\n%\n108 \n%\n110 \n%\n(2)\n%\nHeating degree days\n29 \n%\n11 \n%\n18 \n%\n100 \n%\n82 \n%\n18 \n%\nNumber of metered customers at end of period:\nResidential\n2,673,077\n2,628,569\n2 \n%\n2,673,077\n2,628,569\n2 \n%\nTotal\n3,006,945\n2,959,281\n2 \n%\n3,006,945\n2,959,281\n2 \n%\n54\nTable of Contents\nThe following table provides variance explanations for the three months ended September 30, 2025 compared to the three months ended September 30, 2024 as well as for the nine months ended September 30, 2025 compared to the nine months ended September 30, 2024 by major income statement caption for CenterPoint Energy’s Electric reportable segment:\nFavorable (Unfavorable)\nThree Months Ended September 30, 2025 vs 2024\nNine Months Ended September 30, 2025 vs 2024\n(in millions)\nRevenues\nTransmission Revenues, including TCOS and TCRF, inclusive of costs billed by transmission providers, partially offset in operation and maintenance below\n$\n39 \n$\n50 \nCustomer rates and the impact of the change in rate design\n48 \n58 \nCustomer growth\n8 \n21 \nCost of fuel and purchased power, offset in utility natural gas, fuel and purchased power below\n2 \n46 \nEnergy efficiency, and other pass-through, offset in both operation and maintenance and utility natural gas, fuel and purchased power below as well as in customer rates above\n6 \n9 \nMiscellaneous revenues, including service connections and off-system sales\n1 \n(15)\nLost revenues as a result of outages associated with Hurricane Beryl in 2024\n10 \n10 \nEquity return, related to true-up of transition charges for Transition Bond Company IV in 2024\n— \n(18)\nWeather, efficiency improvements and other usage impacts\n7 \n37 \nBond Companies and SIGECO Securitization Subsidiary, offset in other line items below\n1 \n(75)\nTotal\n$\n122 \n$\n123 \nUtility natural gas, fuel and purchased power\nCost of purchased power, offset in revenues above\n$\n(3)\n$\n(37)\nCost of fuel, including coal, natural gas, and fuel oil, offset in revenues above\n(11)\n(23)\nTotal\n$\n(14)\n$\n(60)\nOperation and maintenance\nTransmission costs billed by transmission providers, offset in revenues above\n$\n(21)\n$\n(24)\nIncremental storm expenses, including storm hardening expenses incurred in connection with accelerated operational activities after Hurricane Beryl in 2024\n70 \n70 \nContract services\n21 \n(1)\nCorporate support services\n(7)\n(18)\nLabor and benefits\n1 \n— \nBond Companies and SIGECO Securitization Subsidiary, offset in other line items\n1 \n4 \nEnergy efficiency offset in revenues above\n(2)\n(6)\nAll other operation and maintenance expense, including materials and supplies and insurance\n(23)\n(20)\nTotal\n$\n40 \n$\n5 \nDepreciation and amortization\nOngoing additions to plant-in-service\n$\n(23)\n$\n(58)\nLease expense associated with temporary generation units no longer eligible for regulatory deferral\n(22)\n(37)\nBond Companies and SIGECO Securitization Subsidiary, offset in other line items\n(1)\n72 \nTotal\n$\n(46)\n$\n(23)\nTaxes other than income taxes\nIncremental capital projects placed in service, and the impact of updated property tax rates\n$\n(9)\n$\n(12)\nTotal\n$\n(9)\n$\n(12)\nInterest expense and other finance charges\nChanges in outstanding debt\n$\n(28)\n$\n(72)\nOther, primarily AFUDC and impacts of regulatory deferrals\n— \n23 \nBond Companies and SIGECO Securitization Subsidiary, offset in other line items above\n— \n2 \nTotal\n$\n(28)\n$\n(47)\nOther income, net\nOther income, including AFUDC - Equity\n$\n6 \n$\n18 \nBond Companies and SIGECO Securitization Subsidiary, offset in other line items above\n(1)\n(3)\nTotal\n$\n5 \n$\n15 \n55\nTable of Contents\nIncome Tax Expense. \nFor a discussion of effective tax rate per period by Registrant, see Note 10 to the Interim Condensed Financial Statements.\n56\nTable of Contents\nNatural Gas (CenterPoint Energy) \nFor information regarding factors that may affect the future results of operations of CenterPoint Energy’s Natural Gas reportable segment, see “Risk Factors — Risk Factors Affecting Operations — Natural Gas,” “— Risk Factors Affecting Regulatory, Environmental and Legal Risks,” “— Risk Factors Affecting Financial, Economic and Market Risks,” “— Risk Factors Affecting Safety and Security Risks” and “— General and Other Risks” in Part I, Item 1A of the Registrants’ combined 2024 Form 10-K.\nThe following table provides summary data of CenterPoint Energy’s Natural Gas reportable segment:\nThree Months Ended September 30,\nNine Months Ended September 30,\n2025\n2024\nFavorable (Unfavorable)\n2025\n2024\nFavorable (Unfavorable)\n(in millions, except operating statistics)\nRevenues\n$\n622 \n$\n611 \n$\n11 \n$\n3,226 \n$\n2,876 \n$\n350 \nExpenses:\nUtility natural gas and fuel\n147 \n139 \n(8)\n1,316 \n1,066 \n(250)\nNon-utility cost of revenues, including natural gas\n1 \n2 \n1 \n4 \n3 \n(1)\nOperation and maintenance\n219 \n214 \n(5)\n679 \n637 \n(42)\nDepreciation and amortization\n139 \n129 \n(10)\n423 \n403 \n(20)\nTaxes other than income taxes\n53 \n51 \n(2)\n183 \n177 \n(6)\nTotal expenses\n559 \n535 \n(24)\n2,605 \n2,286 \n(319)\nOperating Income\n63 \n76 \n(13)\n621 \n590 \n31 \nOther Income (Expense):\nLoss on sale\n— \n— \n— \n(43)\n— \n(43)\nInterest expense and other finance charges\n(52)\n(40)\n(12)\n(154)\n(152)\n(2)\nOther income, net\n6 \n3 \n3 \n23 \n10 \n13 \nIncome Before Income Taxes\n17 \n39 \n(22)\n447 \n448 \n(1)\nIncome tax expense (benefit)\n(54)\n9 \n63 \n62 \n88 \n26 \nNet Income\n$\n71 \n$\n30 \n$\n41 \n$\n385 \n$\n360 \n$\n25 \nThroughput (in Bcf):\nResidential\n14\n16\n(13)\n%\n157\n141\n11 \n%\nCommercial and Industrial\n79\n91\n(13)\n%\n313\n321\n(2)\n%\nTotal\n93\n107\n(13)\n%\n470\n462\n2 \n%\nWeather (percentage of 10-year average for service area):\nHeating degree days\n51 \n%\n23 \n%\n28 \n%\n97 \n%\n79 \n%\n18 \n%\nNumber of metered customers at end of period:\nResidential\n3,712,312\n4,031,298\n(8)\n%\n3,712,312\n4,031,298\n(8)\n%\nCommercial and Industrial\n283,943\n300,709\n(6)\n%\n283,943\n300,709\n(6)\n%\nTotal (1)\n3,996,255\n4,332,007\n(8)\n%\n3,996,255\n4,332,007\n(8)\n%\n(1)\nDecrease in number of metered customers is primarily attributable to customer accounts associated with the divestiture of the Louisiana and Mississippi natural gas LDCs. See Note 3 for additional detail.\n57\nTable of Contents\nThe following table provides variance explanations for the three months ended September 30, 2025 compared to the three months ended September 30, 2024 as well as for the nine months ended September 30, 2025 compared to the nine months ended September 30, 2024 by major income statement caption for CenterPoint Energy’s Natural Gas reportable segment:\nFavorable (Unfavorable)\nThree Months Ended September 30, 2025 vs 2024\nNine Months Ended September 30, 2025 vs 2024\n(in millions)\nRevenues\nCost of natural gas, offset in utility natural gas and fuel below\n$\n19 \n$\n280 \nEnergy efficiency and other pass-through, offset in operation and maintenance below \n2 \n19 \nGross receipts tax, offset in taxes other than income taxes below\n2 \n5 \nNon-volumetric and miscellaneous revenue\n1 \n2 \nWeather and usage\n(6)\n11 \nCustomer growth\n2 \n9 \nNon-utility revenues\n4 \n9 \nCustomer rates and impact of the change in rate design\n34 \n108 \nImpact of divestiture of Louisiana and Mississippi natural gas LDCs on March 31, 2025\n(47)\n(93)\nTotal\n$\n11 \n$\n350 \nUtility natural gas and fuel\nCost of natural gas, offset in revenues above\n$\n(19)\n$\n(280)\nImpact of divestiture of Louisiana and Mississippi natural gas LDCs on March 31, 2025\n11 \n30 \nTotal\n$\n(8)\n$\n(250)\nOperation and maintenance\nAll other operations and maintenance expense, including bad debt expense\n$\n(2)\n$\n(11)\nContract services\n(1)\n(6)\nLabor and benefits\n(7)\n(25)\nCorporate support services\n(10)\n(14)\nEnergy efficiency and other pass-through, offset in revenues above\n(2)\n(19)\nImpact of divestiture of Louisiana and Mississippi natural gas LDCs on March 31, 2025\n17 \n33 \nTotal\n$\n(5)\n$\n(42)\nDepreciation and amortization\nOngoing additions to plant-in-service\n$\n(23)\n$\n(45)\nImpact of divestiture of Louisiana and Mississippi natural gas LDCs on March 31, 2025\n13 \n25 \nTotal\n$\n(10)\n$\n(20)\nTaxes other than income taxes\nGross receipts tax, offset in revenues above\n$\n(2)\n$\n(5)\nIncremental capital projects placed in service, and the impact of updated property tax rates\n(5)\n(10)\nImpact of divestiture of Louisiana and Mississippi natural gas LDCs on March 31, 2025\n5 \n9 \nTotal\n$\n(2)\n$\n(6)\nLoss on sale\nLoss on sale of Louisiana and Mississippi natural gas LDC businesses\n$\n— \n$\n(43)\nTotal\n$\n— \n$\n(43)\nInterest expense and other finance charges\nOther, primarily AFUDC and impacts of regulatory deferrals\n$\n(13)\n$\n(6)\nChanges in outstanding debt\n(4)\n(22)\nImpact of divestiture of Louisiana and Mississippi natural gas LDCs on March 31, 2025\n5 \n26 \nTotal\n$\n(12)\n$\n(2)\nOther income, net\nOther income, including AFUDC - Equity\n$\n3 \n$\n35 \nImpact of divestiture of Louisiana and Mississippi natural gas LDCs on March 31, 2025\n— \n(22)\nTotal\n$\n3 \n$\n13 \nIncome Tax Expense. \nFor a discussion of effective tax rate per period by Registrant, see Note 10 to the Interim Condensed Financial Statements.\n58\nTable of Contents\nHOUSTON ELECTRIC CONSOLIDATED RESULTS OF OPERATIONS\nHouston Electric’s CODM views net income as the measure of profit or loss for its single reportable segment. Houston Electric’s results of operations are affected by seasonal fluctuations in the demand for electricity. Houston Electric’s results of operations are also affected by, among other things, the actions of various governmental authorities having jurisdiction over rates Houston Electric charges, debt service costs, income tax expense, Houston Electric’s ability to collect receivables from REPs and Houston Electric’s ability to recover its regulatory assets. For more information regarding factors that may affect the future results of operations of Houston Electric’s business, see “Risk Factors — Risk Factors Affecting Operations — Electric Generation, Transmission and Distribution,” “— Risk Factors Affecting Regulatory, Environmental and Legal Risks,” “— Risk Factors Affecting Financial, Economic and Market Risks,” “— Risk Factors Affecting Safety and Security Risks” and “— General and Other Risks” in Part I, Item 1A of the Registrants’ combined 2024 Form 10-K and in Part II, Item 1A of this combined Form 10-Q.\nThe following table provides summary data of Houston Electric’s single reportable segment:\nThree Months Ended September 30,\nNine Months Ended September 30,\n2025\n2024\nFavorable (Unfavorable)\n2025\n2024\nFavorable (Unfavorable)\n(in millions, except operating statistics)\nRevenues:\nTDU\n$\n1,130 \n$\n1,057 \n$\n73 \n$\n3,022 \n$\n2,926 \n$\n96 \nBond Companies\n2 \n1 \n1 \n2 \n77 \n(75)\nTotal revenues\n1,132 \n1,058 \n74 \n3,024 \n3,003 \n21 \nExpenses:\nOperation and maintenance, excluding Bond Companies\n475 \n533 \n58 \n1,405 \n1,423 \n18 \nDepreciation and amortization, excluding Bond Companies\n208 \n170 \n(38)\n583 \n506 \n(77)\nTaxes other than income taxes\n79 \n71 \n(8)\n232 \n221 \n(11)\nBond Companies\n2 \n1 \n(1)\n2 \n77 \n75 \nTotal expenses\n764 \n775 \n11 \n2,222 \n2,227 \n5 \nOperating Income\n368 \n283 \n85 \n802 \n776 \n26 \nOther Income (Expense):\nInterest expense and other finance charges\n(96)\n(74)\n(22)\n(272)\n(229)\n(43)\nInterest expense on Securitization Bonds\n(1)\n(1)\n— \n(1)\n(3)\n2 \nOther income, net\n11 \n12 \n(1)\n34 \n33 \n1 \nIncome Before Income Taxes\n282 \n220 \n62 \n563 \n577 \n(14)\nIncome tax expense\n51 \n41 \n(10)\n107 \n112 \n5 \nNet Income\n$\n231 \n$\n179 \n$\n52 \n$\n456 \n$\n465 \n$\n(9)\nThroughput (in GWh):\nResidential\n11,629\n11,364 \n2 \n%\n27,174\n26,108 \n4 \n%\nTotal\n33,995\n31,228 \n9 \n%\n86,908\n81,059 \n7 \n%\nWeather (percentage of 10-year average for service area):\nCooling degree days\n100 \n%\n104 \n%\n(4)\n%\n109 \n%\n109 \n%\n— \n%\nHeating degree days\n— \n%\n— \n%\n— \n%\n92 \n%\n92 \n%\n— \n%\nNumber of metered customers at end of period:\nResidential\n2,538,496\n2,495,669\n2 \n%\n2,538,496\n2,495,669\n2 \n%\nTotal\n2,852,691\n2,806,984\n2 \n%\n2,852,691\n2,806,984\n2 \n%\n59\nThe following table provides variance explanations for the three months ended September 30, 2025 compared to the three months ended September 30, 2024 as well as for the nine months ended September 30, 2025 compared to the nine months ended September 30, 2024 by major income statement caption for Houston Electric:\nFavorable (Unfavorable)\nThree Months Ended September 30, 2025 vs 2024\nNine Months Ended September 30, 2025 vs 2024\n(in millions)\nRevenues\nTransmission Revenues, including TCOS and TCRF, inclusive of costs billed by transmission providers, partially offset in operation and maintenance below\n$\n39 \n$\n50 \nCustomer rates and the impact of the change in rate design\n18 \n10 \nCustomer growth\n7 \n18 \nEnergy efficiency, partially offset in both operation and maintenance and utility natural gas, fuel and purchased power below\n2 \n6 \nMiscellaneous revenues\n2 \n3 \nLost revenues as a result of outages associated with Hurricane Beryl in 2024\n10 \n10 \nEquity return, related to true-up of transition charges for Transition Bond Company IV in 2024\n— \n(18)\nWeather, efficiency improvements and other usage impacts\n(5)\n17 \nBond Companies, offset in other line items below\n1 \n(75)\nTotal\n$\n74 \n$\n21 \nOperation and maintenance, excluding Bond Companies\nTransmission costs billed by transmission providers, offset in revenues above\n$\n(20)\n$\n(23)\nIncremental storm hardening expenses incurred in connection with accelerated operational activities after Hurricane Beryl\n70 \n70 \nContract services\n22 \n— \nAll other operation and maintenance expense, including materials and supplies and insurance\n(9)\n(8)\nCorporate support services\n(5)\n(16)\nEnergy efficiency, offset in revenues above\n(2)\n(6)\nLabor and benefits\n2 \n1 \nTotal\n$\n58 \n$\n18 \nDepreciation and amortization, excluding Bond Companies\nOngoing additions to plant-in-service\n$\n(16)\n$\n(40)\nLease expense associated with temporary generation units no longer eligible for regulatory deferral\n(22)\n(37)\nTotal\n$\n(38)\n$\n(77)\nTaxes other than income taxes\nIncremental capital projects placed in service, and the impact of changes to tax rates\n$\n(8)\n$\n(11)\nTotal\n$\n(8)\n$\n(11)\nBond Companies\nOperations and maintenance and depreciation expense, offset in revenues above\n$\n(1)\n$\n75 \nTotal\n$\n(1)\n$\n75 \nInterest expense and other finance charges\nChanges in outstanding debt\n$\n(23)\n$\n(62)\nOther, primarily AFUDC and impacts of regulatory deferrals\n1 \n19 \nTotal\n$\n(22)\n$\n(43)\nInterest expense on Securitization Bonds\nLower outstanding principal balance, offset in revenues above\n$\n— \n$\n2 \nTotal\n$\n— \n$\n2 \nOther income, net\nOther income, including AFUDC - Equity\n$\n(1)\n$\n3 \nBond Companies interest income, offset in other line items\n— \n(2)\nTotal\n$\n(1)\n$\n1 \nIncome Tax Expense. \nFor a discussion of effective tax rate per period, see Note 10 to the Interim Condensed Financial Statements.\n60\nTable of Contents\nCERC CONSOLIDATED RESULTS OF OPERATIONS\nCERC’s CODM views net income as the measure of profit or loss for its single reportable segment. CERC’s results of operations are affected by seasonal fluctuations in the demand for natural gas. CERC’s results of operations are also affected by, among other things, the actions of various federal, state and local governmental authorities having jurisdiction over rates CERC charges, debt service costs and income tax expense, CERC’s ability to collect receivables from customers and CERC’s ability to recover its regulatory assets. For more information regarding factors that may affect the future results of operations for CERC’s business, see “Risk Factors — Risk Factors Affecting Operations — Natural Gas,” “— Risk Factors Affecting Regulatory, Environmental and Legal Risks,” “— Risk Factors Affecting Financial, Economic and Market Risks,” “— Risk Factors Affecting Safety and Security Risks” and “— General and Other Risks” in Part I, Item 1A of the Registrants’ combined 2024 Form 10-K.\nThree Months Ended September 30,\nNine Months Ended September 30,\n \n2025\n2024\nFavorable (Unfavorable)\n2025\n2024\nFavorable (Unfavorable)\n(in millions, except operating statistics)\nRevenues\n$\n607 \n$\n600 \n$\n7 \n$\n3,126 \n$\n2,791 \n$\n335 \nExpenses:\nUtility natural gas\n146 \n140 \n(6)\n1,286 \n1,046 \n(240)\n Non-utility cost of revenues, including natural gas\n1 \n1 \n— \n4 \n2 \n(2)\nOperation and maintenance\n211 \n207 \n(4)\n654 \n614 \n(40)\nDepreciation and amortization\n133 \n124 \n(9)\n406 \n389 \n(17)\nTaxes other than income taxes\n50 \n51 \n1 \n179 \n176 \n(3)\nTotal expenses\n541 \n523 \n(18)\n2,529 \n2,227 \n(302)\nOperating Income\n66 \n77 \n(11)\n597 \n564 \n33 \nOther Income (Expense):\nGain on sale\n— \n— \n— \n52 \n— \n52 \nInterest expense and other finance charges\n(49)\n(38)\n(11)\n(144)\n(145)\n1 \nOther income, net\n6 \n4 \n2 \n20 \n10 \n10 \nIncome Before Income Taxes\n23 \n43 \n(20)\n525 \n429 \n96 \nIncome tax expense (benefit)\n(51)\n9 \n60 \n60 \n84 \n24 \nNet Income\n$\n74 \n$\n34 \n$\n40 \n$\n465 \n$\n345 \n$\n120 \nThroughput (in Bcf):\nResidential\n13\n15\n(13)\n%\n152\n137\n11 \n%\nCommercial and Industrial\n69\n81\n(15)\n%\n280\n294\n(5)\n%\nTotal\n82\n96\n(15)\n%\n432\n431\n— \n%\nWeather (percentage of 10-year average for service area):\nHeating degree days \n53 \n%\n24 \n%\n29 \n%\n97 \n%\n79 \n%\n18 \n%\nNumber of metered customers at end of period:\nResidential\n3,607,811\n3,926,819\n(8)\n%\n3,607,811\n3,926,819\n(8)\n%\nCommercial and Industrial\n273,354\n290,128\n(6)\n%\n273,354\n290,128\n(6)\n%\nTotal (1)\n3,881,165\n4,216,947\n(8)\n%\n3,881,165\n4,216,947\n(8)\n%\n(1)\nDecrease in number of metered customers is primarily attributable to customer accounts associated with the divestiture of the Louisiana and Mississippi natural gas LDCs. See Note 3 for additional detail.\n61\nTable of Contents\nThe following table provides variance explanations for the three months ended September 30, 2025 compared to the three months ended September 30, 2024 as well as for the nine months ended September 30, 2025 compared to the nine months ended September 30, 2024 by major income statement caption for CERC:\nFavorable (Unfavorable)\nThree Months Ended September 30, 2025 vs 2024\nNine Months Ended September 30, 2025 vs 2024\n(in millions)\nRevenues\nCost of natural gas, offset in utility natural gas below\n$\n17 \n$\n270 \nEnergy efficiency and other pass-through, offset in operation and maintenance below\n2 \n19 \nGross receipts tax, offset in taxes other than income taxes below\n2 \n5 \nNon-volumetric and miscellaneous revenue\n— \n2 \nWeather and usage\n(7)\n10 \nCustomer growth\n2 \n9 \nNon-utility revenues\n4 \n9 \nCustomer rates\n34 \n104 \nImpact of divestiture of Louisiana and Mississippi natural gas LDCs on March 31, 2025\n(47)\n(93)\nTotal\n$\n7 \n$\n335 \nUtility natural gas\nCost of natural gas, offset in revenues above\n$\n(17)\n$\n(270)\nImpact of divestiture of Louisiana and Mississippi natural gas LDCs on March 31, 2025\n11 \n30 \nTotal\n$\n(6)\n$\n(240)\nOperation and maintenance\nAll other operations and maintenance expense, including bad debt expense\n$\n(1)\n$\n(7)\nContract services\n(2)\n(8)\nLabor and benefits\n(6)\n(24)\nCorporate support services\n(10)\n(14)\nEnergy efficiency and other pass-through, offset in revenues above\n(2)\n(19)\nImpact of divestiture of Louisiana and Mississippi natural gas LDCs on March 31, 2025\n17 \n32 \nTotal\n$\n(4)\n$\n(40)\nDepreciation and amortization\nOngoing additions to plant-in-service\n$\n(22)\n$\n(42)\nImpact of divestiture of Louisiana and Mississippi natural gas LDCs on March 31, 2025\n13 \n25 \nTotal\n$\n(9)\n$\n(17)\nTaxes other than income taxes\nGross receipts tax, offset in revenues above\n$\n(2)\n$\n(5)\nIncremental capital projects placed in service, and the impact of updated property tax rates\n(2)\n(7)\nImpact of divestiture of Louisiana and Mississippi natural gas LDCs on March 31, 2025\n5 \n9 \nTotal\n$\n1 \n$\n(3)\nGain on sale\nGain on sale of Louisiana and Mississippi natural gas LDC businesses\n$\n— \n$\n52 \nTotal\n$\n— \n$\n52 \nInterest expense and other finance charges\nOther, primarily AFUDC and impacts of regulatory deferrals\n$\n(13)\n$\n(6)\nChanges in outstanding debt\n(3)\n(19)\nImpact of divestiture of Louisiana and Mississippi natural gas LDCs on March 31, 2025\n5 \n26 \nTotal\n$\n(11)\n$\n1 \nOther income, net\nOther income, including AFUDC - Equity\n$\n2 \n$\n33 \nImpact of divestiture of Louisiana and Mississippi natural gas LDCs on March 31, 2025\n— \n(23)\nTotal\n$\n2 \n$\n10 \nIncome Tax Expense. \nFor a discussion of effective tax rate per period, see Note 10 to the Interim Condensed Financial Statements.\n62\nTable of Contents\nCERTAIN FACTORS AFFECTING FUTURE EARNINGS\nFor information on other developments, factors and trends that may impact the Registrants’ future earnings, see “Management’s Discussion and Analysis of Financial Condition and Results of Operations — Certain Factors Affecting Future Earnings” in Item 7 of Part II and “Risk Factors” in Part I, Item 1A of the Registrants’ combined 2024 Form 10-K, and “Cautionary Statement Regarding Forward-Looking Information” in this combined Form 10-Q.\nLIQUIDITY AND CAPITAL RESOURCES\nCash Flows \nThe following table summarizes the Registrants’ cash flows by category during the nine months ended September 30, 2025 and 2024: \n \nNine Months Ended September 30,\n \n2025\n2024\nCenterPoint Energy\nHouston Electric\nCERC\nCenterPoint Energy\nHouston Electric\nCERC\n(in millions)\nCash provided by (used in):\nOperating activities\n$\n1,712 \n$\n652 \n$\n1,128 \n$\n1,250 \n$\n306 \n$\n858 \nInvesting activities\n(2,602)\n(2,038)\n36 \n(2,559)\n(1,044)\n(982)\nFinancing activities\n905 \n1,391 \n(1,166)\n1,329 \n759 \n124 \nOperating Activities. \nThe following items contributed to increased (decreased) net cash provided by operating activities for the nine months ended September 30, 2025 compared to the nine months ended September 30, 2024: \nCenterPoint Energy\nHouston\n Electric\nCERC\n(in millions)\nChanges in net income after adjusting for non-cash items\n$\n(50)\n$\n27 \n$\n(14)\nChanges in working capital\n(197)\n(141)\n(37)\nChanges in current regulatory assets and liabilities\n170 \n9 \n165 \nChanges in non-current regulatory assets and liabilities \n574 \n434 \n(13)\nChanges in non-current assets and liabilities\n88 \n16 \n170 \nHigher pension contribution\n(106)\n— \n— \nOther\n(17)\n1 \n(1)\n$\n462 \n$\n346 \n$\n270 \nInvesting Activities.\n \nThe following items contributed to (increased) decreased net cash used in investing activities for the nine months ended September 30, 2025 compared to the nine months ended September 30, 2024:\n \nCenterPoint Energy\nHouston\n Electric\nCERC\n(in millions)\nPayment for asset acquisition\n$\n(357)\n$\n— \n$\n— \nNet change in capital expenditures\n(888)\n(787)\n(59)\nNet change in notes receivable from affiliated companies\n— \n(379)\n(1)\nProceeds from divestiture\n1,219 \n— \n1,219 \nOther\n(17)\n172 \n(141)\n$\n(43)\n$\n(994)\n$\n1,018 \n63\nTable of Contents\nFinancing Activities.\n \nThe following items contributed to (increased) decreased net cash provided by (used in) financing activities for the nine months ended September 30, 2025 compared to the nine months ended September 30, 2024: \nCenterPoint Energy\nHouston\n Electric\nCERC\n(in millions)\nNet changes in commercial paper outstanding\n$\n115 \n$\n— \n$\n239 \nNet changes in proceeds from issuances of Common Stock\n(494)\n— \n— \nNet changes in long-term debt and term loans outstanding, excluding commercial paper\n(15)\n877 \n(820)\nNet changes in debt issuance costs\n8 \n(12)\n4 \nNet changes in short-term borrowings\n(1)\n— \n(1)\nIncreased payment of Common Stock dividends\n(47)\n— \n— \nNet change in notes payable from affiliated companies\n— \n(71)\n— \nChange in contribution from parent\n— \n(230)\n(290)\nChange in dividend to parent\n— \n67 \n(423)\nOther \n10 \n1 \n1 \n$\n(424)\n$\n632 \n$\n(1,290)\nFuture Sources and Uses of Cash\nThe liquidity and capital requirements of the Registrants are affected primarily by results of operations, capital expenditures, storm restoration costs, debt service requirements, tax payments, working capital needs and various regulatory actions. Future capital expenditures (other than expenditures associated with the May 2024 Storm Events) are expected to primarily relate to investment in infrastructure. These capital expenditures are anticipated to enhance reliability and safety, increase resiliency and expand our systems through value-added projects. In addition to dividend payments on CenterPoint Energy’s Common Stock and interest payments on debt, the Registrants’ principal anticipated cash requirements for the remainder of 2025 include the following:\nCenterPoint Energy\nHouston\n Electric\nCERC\n(in millions)\nEstimated capital expenditures (1) \n$\n1,539 \n$\n988 \n$\n515 \nEstimated restoration costs associated with May 2024 Storm Events (2) \n7 \n— \n— \nScheduled principal payments on Securitization Bonds\n7 \n— \n— \nScheduled principal payments on debt instruments \n1,000 \n700 \n— \nExpected contributions to pension plans and other post-retirement plans\n14 \n— \n— \n(1)\nExcludes expenditures for the restoration costs associated with the May 2024 Storm Events.\n(2)\nRepresents cash requirements associated with the estimated storm restoration costs for the remainder of 2025.\nThe Registrants expect that anticipated cash needs for the remainder of 2025 will be met with available cash flow from operations, as well as cash flows from financing (such as issuances of equity securities upon physical settlement of outstanding forward sale agreements and borrowings under credit facilities, commercial paper issuances or other sources). At this time, CenterPoint Energy does not anticipate the need for further sales of shares of Common Stock under the Equity Distribution Agreement. The issuance of securities in the capital markets and borrowings under additional credit facilities and term loans may not, however, be available on acceptable terms. The Registrants may also, from time to time, redeem, repurchase or otherwise acquire their outstanding debt securities through open market purchases, tender offers or pursuant to the terms of such securities.\nFor more information regarding the May 2024 Storm Events and Hurricane Beryl, see Note 6 and Note 9 to the Interim Condensed Financial Statements.\nOff-Balance Sheet Arrangements\nOther than Houston Electric’s general mortgage bonds issued as collateral for tax-exempt long-term debt of CenterPoint Energy as discussed in Note 9 and guarantees as discussed in Note 11(c) to the Interim Condensed Financial Statements, the Registrants have no off-balance sheet arrangements. \n64\nTable of Contents\nRegulatory Matters \nHouston Electric TEEEF\nFor information about Houston Electric’s TEEEF, see Note 6 to the Interim Condensed Financial Statements.\nHurricane Beryl\nFor additional information about Hurricane Beryl, see Note 6 to the Interim Condensed Financial Statements.\nMay 2024 Storm Events\nFor additional information about the May 2024 Storm Events, see Note 6 to the Interim Condensed Financial Statements.\nIndiana Electric CPCN (CenterPoint Energy)\n \n \nBTAs\nIndiana Electric has pursued PTCs for solar projects following the passage of the IRA. On February 7, 2023, Indiana Electric filed a CPCN with the IURC to approve an amended BTA to purchase the 191 MW Posey Solar project. Indiana Electric requested that project costs, net of PTCs, be recovered in rate base rather than a levelized rate, through base rates or the CECA mechanism, depending on which provides more timely recovery. On September 6, 2023, the IURC issued an order approving the CPCN. On March 7, 2025, SIGECO completed the acquisition of Posey Solar from Arevon for a purchase price of approximately $357 million. Subsequent to the acquisition, and pursuant to the Posey Solar Merger Agreement, Posey Solar was merged into SIGECO. The Posey Solar project was placed in service in the second quarter of 2025 and is currently being recovered through base rates. In the applicable rate case, the IURC approved Indiana Electric’s request to convey PTCs to customers through the new tax adjustment rider.\n \nFor further information, see Note 3 to the Interim Condensed Financial Statements.\nOn January 10, 2023, Indiana Electric filed a CPCN with the IURC to acquire a wind energy generating facility located in the central region of MISO through a BTA, and on June 6, 2023, the IURC issued an order approving the CPCN, thereby authorizing Indiana Electric to purchase the wind generating facility. In August 2025, due to changing project considerations and concerns about customer affordability, Indiana Electric exited negotiations relating to this wind energy generating facility.\nPPAs\nIndiana Electric sought approval in February 2021 for a 100 MW solar PPA with Clenera LLC in Warrick County, Indiana. The request accounted for increased cost of debt related to this PPA, which provides equivalent equity return to offset imputed debt during the 25-year life of the PPA. In October 2021, the IURC approved the Warrick County solar PPA but denied the request to preemptively offset imputed debt in the PPA cost. Due to rising project costs caused by inflation and supply chain issues affecting the energy industry, Clenera LLC and Indiana Electric were compelled to renegotiate terms of the agreement to increase the PPA price. On January 17, 2023, Indiana Electric filed a request with the IURC to amend the previously approved PPA with certain modifications. Revised purchase power costs are requested to be recovered through the fuel adjustment clause proceedings over the term of the amended PPA. On May 30, 2023, the IURC approved the Warrick County solar amended PPA; however, due to MISO interconnection study delays and estimated interconnection cost increases, on April 24, 2025, Indiana Electric provided notice that it was exercising its right to terminate the PPA, which terminated all further obligations of Indiana Electric with respect to the project.\nOn August 25, 2021, Indiana Electric filed with the IURC seeking approval to purchase 185 MW of solar power, under a 15-year PPA, from \nOriden\n, which is developing a solar project in Vermillion County, Indiana, and 150 MW of solar power, under a 20-year PPA, from Origis, which is developing a solar project in Knox County, Indiana. On May 4, 2022, the IURC issued an order approving Indiana Electric to enter into both PPAs. In March 2022, when the results of the MISO interconnection study were completed, Origis advised Indiana Electric that the costs to construct the solar project in Knox County, Indiana had increased. The increase was largely driven by escalating commodity and supply chain costs impacting manufacturers worldwide. In August 2022, Indiana Electric and Origis entered into an amended PPA, which reiterated the terms contained in the 2021 PPA with certain modifications. On February 22, 2023, the IURC approved the Knox County solar amended PPA; however, due to MISO interconnection delays, the project in-service date has been delayed from 2024 to 2026. On January 17, 2023, Indiana Electric filed a request with the IURC to amend the previously approved PPA with Oriden with certain modifications. Revised purchase power costs were approved to be recovered through the fuel adjustment clause \n65\nTable of Contents\nproceedings over the term of the amended PPA with Oriden. On May 30, 2023, the IURC approved the Vermillion County solar amended PPA; however, due to MISO interconnection study delays, the developer disclosed the project in-service date would be delayed to 2028. On May 9, 2025, Indiana Electric and Oriden terminated the PPA.\nOn May 1, 2024, Indiana Electric filed with the IURC seeking approval to purchase 147 MW of wind power under a 25-year PPA with an affiliate of NextEra Energy, Inc., which is developing a wind project in Knox County, Illinois. On November 6, 2024, the IURC approved the Knox County wind PPA, which provided for the recovery of the purchase power costs through the fuel adjustment clause proceedings over the term of the PPA. The facility is targeted to be in operation in late 2026.\nOn April 14, 2025, Indiana Electric filed with the IURC seeking approval to purchase 170 MW of wind power under a 25-year PPA with an affiliate of NextEra Energy, Inc., which is developing a wind project in Tama County, Iowa. On June 3, 2025, an amendment to the PPA was filed with the IURC requesting an extension of the PPA’s term from 25 to 27 years. The facility is targeted to be in operation by the fourth quarter of 2025. Indiana Electric expects a decision from the IURC in the fourth quarter of 2025. If Indiana Electric’s request is approved, the power purchase costs will be recovered through the fuel adjustment clause proceedings over the term of the PPA.\nNatural Gas Combustion Turbines\nOn June 17, 2021, Indiana Electric filed a CPCN with the IURC seeking approval to construct two natural gas combustion turbines to replace portions of its existing coal-fired generation fleet. On June 28, 2022, the IURC approved the CPCN. The estimated $334 million turbine facility is being constructed at the previous site of the A.B. Brown power plant in Posey County, Indiana and is expected to provide a combined output of 460 MW. Indiana Electric received approval for depreciation expense and post in-service carrying costs to be deferred in a regulatory asset until the date Indiana Electric’s base rates include a return on and recovery of depreciation expense on the facility. A new approximately 23.5-mile pipeline was constructed and is operated by Texas Gas Transmission, LLC to supply natural gas to the turbine facility. FERC granted a certificate to construct the pipeline on October 20, 2022. On January 7, 2025, the United States Court of Appeals for the D.C. Circuit affirmed the FERC’s order granting the certificate. Indiana Electric granted its contractor a full notice to proceed to construct the turbines on December 9, 2022. In the second quarter of 2025, 230 MW of the facility was placed in service, and, due to a transformer manufacturing issue, the remaining 230 MW of the facility was placed in service in the third quarter of 2025. On February 6, 2025, the EPC contractor for Indiana Electric’s proposed natural gas combustion turbines provided a notice to Indiana Electric that the EPC contractor was identifying the impacts of the proposed tariffs on the project and intended to seek an equitable adjustment to the contract price for the project. Indiana Electric received approval from the IURC on February 3, 2025, to recover for each combustion turbine by adjusting base rates as they are placed in service. The first turbine and second turbine are currently being recovered in base rates that were updated on June 17, 2025 and October 1, 2025, respectively.\nStewart-West Bay Transmission Project (CenterPoint Energy and Houston Electric)\nOn April 30, 2025, Houston Electric filed a CCN application with the PUCT for approval to replace a portion of a 138 kV double circuit transmission line in Galveston County, Texas that connects Houston Electric’s Stewart and West Bay substations.\n \nOn June 27, 2025, an order was issued dismissing all opposing parties from the proceeding. On August 11, 2025, a notice of approval of Houston Electric’s application was issued. The project is estimated to cost approximately $105 million, but the actual capital cost of the project will depend on construction costs and other factors.\n \nCompletion of construction and energization of the line is anticipated to occur in the third quarter of 2027.\nTexas Legislation (CenterPoint Energy, Houston Electric and CERC)\nThe Registrants are evaluating the effects of certain legislation passed in 2025 and associated PUCT rulemaking projects, including the following pieces of legislation that became law during the 89th Texas Legislature:\n•\nHouse Bill 4384, effective June 20, 2025, allows LDCs to recover post in-service carry costs (PISCC) in GRIP filings. This allows LDCs to defer for future recovery as a regulatory asset PISCC, depreciation associated with unrecovered gross plant and ad valorem taxes associated with unrecovered gross plant.\n•\nSenate Bill 231, effective June 20, 2025, revises the types of temporary generation units that may be used by a utility to have a maximum generation capacity of not more than 5 MW and be rapidly deployable.\n•\nSenate Bill 1963, effective September 1, 2025, allows ERCOT utilities to securitize system restoration costs using a third-party government agency, which may allow for the debt to be off balance sheet and an abbreviated proceeding timeline. This bill also lowered the system restoration costs threshold from $100 million to $50 million, provided the effectiveness tests are met.\n•\nSenate Bill 482, effective September 1, 2025, results in increased penalties for assaulting a utility worker to a third-degree felony, equal to assaulting a first responder, and for harassing a utility worker to a Class A misdemeanor.\n66\nTable of Contents\nSolar Panel Issues (CenterPoint Energy)\nCenterPoint Energy’s solar projects have been impacted, and any future solar projects may be impacted, by delays and/or increased costs. The potential delays and inflationary cost pressures communicated from the developers of our solar projects have been primarily due to (i) unavailability of solar panels and other uncertainties related to DOC investigation(s), (ii) the December 2021 Uyghur Forced Labor Prevention Act on solar modules and other products manufactured in China’s Xinjiang Uyghur Autonomous Region and (iii) persistent general global supply chain and labor availability issues. On April 21, 2025, the DOC announced its final affirmative determinations in the antidumping and countervailing duty investigations, determining that imports of silicon photovoltaic cells from Cambodia, Malaysia, Thailand and Vietnam are being dumped into the U.S. market and receiving countervailable subsidies. On May 20, 2025, the ITC announced its final determination that a U.S. industry is materially injured by reason of imports of silicon photovoltaic cells from Malaysia and Vietnam and a U.S. industry is threatened with material injury by reason of imports of silicon photovoltaic cells from Cambodia and Thailand. As a result of such determinations, the DOC has imposed certain duty rates on imports of silicon photovoltaic cells from Cambodia, Malaysia, Thailand and Vietnam. On July 1, 2025, the DOC initiated an investigation to determine the effects on national security of imports of polysilicon and its derivatives under Section 232 of the Trade Expansion Act of 1962. On August 7, 2025, based on a petition filed by the American Alliance for Solar Manufacturing Trade, the DOC announced the initiation of antidumping and countervailing duty investigations of silicon photovoltaic cells from India, Indonesia, and the Lao People’s Democratic Republic. On September 2, 2025, the ITC announced its preliminary determination that there is a reasonable indication that a U.S. industry is materially injured by reason of imports of silicon photovoltaic cells from India, Indonesia and the Lao People’s Democratic Republic. The DOC is expected to announce its preliminary determinations for the antidumping and countervailing duty investigations by the end of 2025. Furthermore, in 2025, the U.S. government has announced and, in certain cases, rescinded, multiple tariffs on several foreign jurisdictions and imports into the United States. These tariffs, as well as new legislation, tariffs, bans, retaliatory trade measures or related governmental action, have already, and may continue to, further negatively impact the supply of solar panels. In addition to supply reductions, these or similar duties, legislation, tariffs, bans and other measures have and may in the future also put upward pressure on prices of these solar energy products, which may reduce our ability to acquire these items in a timely and cost-efficient manner. These impacts have resulted, and may continue to result in, cost increases for certain projects, and such impacts may require that we seek additional regulatory review and approvals. Additionally, significant changes to project costs and schedules as a result of these factors could impact the viability of the projects. For more information regarding potential delays, cancellations and supply chain disruptions, see “Risk Factors” in Part I, Item 1A of the Registrants’ combined 2024 Form 10-K. \nTransmission and Distribution System Resiliency Plan (CenterPoint Energy and Houston Electric)\nFollowing feedback from customers, external experts and other stakeholders, including elected officials and local agencies, Houston Electric filed a revised SRP with the PUCT on January 31, 2025 for review and approval. The filed SRP proposed to invest approximately $5.75 billion over a three-year period from 2026 to 2028 for transmission and distribution infrastructure, information technology and cybersecurity assets and event response capability. This plan proposed 39 resiliency-enhancing measures and a microgrid pilot program to be implemented over the three-year period. The SRP as filed had an estimated capital cost of approximately $5.54 billion and an estimated operations and maintenance expense of approximately $211 million. Approximately $2.17 billion of such cost was for transmission-related investments, and approximately $3.58 billion was for distribution-related investments. Intervenor testimony was filed on April 8, 2025, and PUCT staff testimony was filed on April 15, 2025. On June 12, 2025, Houston Electric announced that it had reached a settlement agreement with parties to its SRP, which provides for approximately $3.18 billion in distribution-related investments. The proposed transmission investments were removed from the SRP and will be implemented as appropriate outside of the SRP process. The agreement also includes the deferral of more than $240 million of the approximate $3.18 billion in SRP costs until the second half of 2029, which will help reduce the bill impact for customers by spreading costs over a four-year period instead of three years. Once approved, and while some cost recovery would be deferred into 2029, it is expected that all SRP work agreed upon in the settlement agreement will be completed in the proposed 2025 to 2028 timeframe. On July 31, 2025, Houston Electric delivered a presentation on the SRP at a PUCT open meeting, and on August 8, 2025, Houston Electric responded to a PUCT memo dated July 30, 2025 that requested additional information. On August 21, 2025, the SRP was additionally discussed at a PUCT open meeting and the PUCT requested further clarification related to the vegetation management resiliency measure included in the SRP. On September 11, 2025, the PUCT granted Houston Electric a window to file supplemental evidence related to the vegetation management measure included in the SRP on or before October 13, 2025. Houston Electric filed such supplemental evidence on October 6, 2025. The PUCT staff must file a recommendation on the sufficiency of the supplemental evidence by October 27, 2025. A decision from the PUCT is anticipated in the fourth quarter of 2025.\n67\nTable of Contents\nRate Change Applications\nThe Registrants are routinely involved in rate change applications before state regulatory authorities. Those applications include general rate cases, where the entire cost of service of the utility is assessed and reset. In addition, the Registrants are periodically involved in proceedings to adjust their capital tracking mechanisms (e.g., CSIA, DCRF, DRR, GRIP, TCOS, ECA, CECA and TDSIC), their decoupling mechanisms (e.g., decoupling and SRC), and their energy efficiency cost trackers (e.g., CIP, DSMA, EECRF, EEFC and EEFR).\nMinnesota Gas Rate Case.\n On November 1, 2023, CERC filed an application with the MPUC requesting an adjustment to delivery charges in 2024 and 2025 for the natural gas business in Minnesota. The requested increase is approximately 6.5% or $85 million for 2024 and an additional approximately 3.7% or $52 million for 2025. The need for a rate change is primarily driven by continuing investment in the safety and reliability of the natural gas system, including new Intelis natural gas meters that feature an integrated safety shutoff valve, changes to depreciation rates that better reflect the actual life and salvage characteristics of assets and changes in other costs to serve customers. The request reflects a proposed 10.3% ROE on a 52.5% equity ratio. Interim rates for 2024 of $69 million, subject to refund, were implemented as of January 1, 2024. A request for interim rates of $33 million for 2025 was filed on September 30, 2024, approved at the December 3, 2024 hearing and approved by an order issued December 20, 2024. A unanimous settlement agreement was filed on November 25, 2024. The settlement provided for an increase of $60.8 million for 2024 and an additional $42.7 million for 2025. The parties agreed to an overall cost of capital of 7.07% for 2024 and 2025. The ALJ filed a report on February 13, 2025 recommending that the MPUC approve the settlement agreement. As required by the December 20, 2024 order, the difference between 2024 interim rates and the settled amount of $60.8 million was refunded to customers in March 2025. Exceptions to the ALJ report were filed on April 18, 2025. On May 29, 2025, the MPUC approved the settlement agreement. A final order approving the settlement agreement was issued by the MPUC on June 27, 2025 and final rates were implemented on September 1, 2025.\nHouston Electric Rate Case.\n On March 6, 2024, Houston Electric filed an application with the PUCT requesting authority to change rates and charges for electric transmission and distribution service. The requested increase was approximately $17 million (1%) for retail customers and $43 million (6.6%) for wholesale transmission service, excluding TCRF and rate case expenses. The need for a rate increase was primarily driven by continuing investment that has been made to support customer growth and to bolster the safety and reliability of Houston Electric’s transmission and distribution system. The request reflected a proposed 10.4% ROE and a 45% equity ratio. Errata testimony was filed to correct minor errors included in the initial filing, which reduced the requested increase to $56 million compared to then-current rates. Houston Electric reached a settlement agreement with certain parties and submitted the agreement to the PUCT on January 29, 2025. The settlement reflects a $47 million reduction in annual revenues and a 9.65% ROE and a weighted average cost of capital of 6.606% based upon an as-filed 4.29% cost of debt, an agreed ROE of 9.65% and an agreed regulatory capital structure of 56.75% long-term debt and 43.25% equity. A final order approving the settlement agreement was issued by the PUCT on March 13, 2025. Final retail delivery rates were implemented on April 28, 2025. Final wholesale transmission rates were superseded by interim TCOS rates that went into effect on the same date.\nOhio Gas Rate Case\n. CEOH filed its Application and Standard Filing Requirement in October 2024 and the related testimony in November 2024. The filing seeks a revenue requirement increase of approximately $100 million based on a requested ROE of 10.4% and an equity percentage of 54.13%. The need for a rate increase was primarily driven by continuing investment in the safety and reliability of the natural gas system. On May 16, 2025, the PUCO staff filed its staff report recommending a revenue requirement range of $340.8 million to $350.3 million and a net increase of $25.1 million to $34.6 million based on an ROE range from 9.05% to 10.07% with a capitalization ratio of 52.3% common equity and 47.7% long-term debt. The PUCO staff recommendation includes amortization over 49 years and 65 years for CEP and DRR regulatory assets, respectively, compared to CEOH’s proposal to amortize over seven years. On June 16, 2025, CEOH filed objections to the PUCO staff report and supplemental testimony. On July 11, 2025, CEOH filed a stipulation and recommendation that outlined the agreed upon terms between CEOH, the Federal Executive Agencies, Ohio Energy Group, the City of Dayton, the Retail Energy Supply Association, Interstate Gas Supply, LLC and the PUCO staff. One intervening party to the case, Spire Marketing, Inc., is a non-opposing party, while another intervening party to the case, the Office of the Ohio Consumers’ Counsel, filed its testimony in opposition to the stipulation and recommendation on July 29, 2025. The stipulation and recommendation included a revenue requirement of $371.3 million, which would result in a revenue requirement increase of $59.6 million based on a rate of return of 7.1% comprised of a ROE of 9.85% with a capitalization ratio of 52.9% common equity, 47.1% long-term debt at a cost of debt of 4.02%. The stipulation and recommendation amortization periods for CEP and DRR regulatory assets within base rates and within the rider mechanisms is 15 years. The stipulation and recommendation included an extension of the CEP rider and DRR through 2029 investment with revised residential caps for dollars per month per customer ranging from $2.75 for 2025 investment to $9.95 for 2029 investment for the CEP rider, and from $2.56 for 2025 investment to $7.69 for 2029 investment for DRR. The evidentiary hearing commenced on July 21, 2025. The stipulating parties were crossed by the Office of the Ohio Consumers’ Counsel on July 28 and August 4, 2025, and the Office of the Ohio \n68\nTable of Contents\nConsumers’ Counsel was crossed by the stipulating parties on July 29 and August 5, 2025. On July 29, 2025, a PUCO local public hearing was conducted. The parties filed initial briefs on August 26, 2025, and reply briefs on September 9, 2025. A final order is expected no sooner than the first quarter of 2026.\n The table below reflects significant applications pending or completed since the Registrants’ combined 2024 Form 10-K was filed with the SEC through the date of the filing of this combined Form 10-Q:\nMechanism\nAnnual Increase (Decrease) (1)\n(in millions)\nFiling\n Date\nEffective Date\nApproval Date\nAdditional Information\nCenterPoint Energy and Houston Electric (PUCT)\nRate Case\n$\n(47)\nMarch 2024\nApril 2025\nMarch 2025\nSee discussion above under \nHouston Electric Rate Case\n.\nTCOS\n$\n64 \nFebruary 2025\nApril 2025\nApril 2025\nBased on the net change in invested capital since its last base rate proceeding of approximately $614 million for the period January 1, 2024 through December 31, 2024.\nDCRF\n$\n123 \nFebruary 2025\nJuly 2025\nJune 2025\nBased on the net change in distribution invested capital since its last base rate proceeding of approximately $1 billion for the period January 1, 2024 through December 31, 2024, for an incremental revenue increase of $123 million adjusted for load growth.\nTEEEF\n$\n(24)\nApril 2025\nTBD\nTBD\nSeeks approval of: (1) a proposal to release Houston Electric’s 15 large 32 MW TEEEF units to ERCOT and CPS Energy beginning on or around May 1, 2025 to address a potential shortfall and Load Shed risk; (2) a corresponding reduction to the capacity of the Houston Electric TEEEF fleet; and (3) a reduction and update to Houston Electric’s rider TEEEF rate to reflect the removal of the 15 large 32 MW TEEEF units from Houston Electric’s TEEEF fleet. Houston Electric will make no revenue or profit from ERCOT for the time period when the 15 large 32 MW TEEEF units are in the San Antonio area being dispatched by ERCOT.\nTEEEF\nN/A\nMay 2025\nTBD\nTBD\nSeeks authorization to lease additional small, 200 kW to 1,250 kW TEEEF units in accordance with the TEEEF Rule. Among other things, the TEEEF Rule requires that a utility obtain preapproval prior to entering into any lease renewal or new leases for TEEEF units. Approval of Houston Electric’s request in this filing will have no cost impact on customers at this time, as cost determination will occur in a future proceeding. On October 17, 2025, Houston Electric filed a letter indicating that the parties continue to engage in productive settlement negotiations and plan to file settlement documents or another status update by October 31, 2025.\nEECRF\n$\n40 \nMay 2025\nMarch 2026\nTBD\nRequests $96 million, which is comprised primarily of the following: 2026 program costs of $50 million; $5 million related to the under-recovery of 2024 program costs; the 2024 earned bonus of $40 million; and 2026 projected evaluation, measurement and verification costs of $0.6 million. On September 8, 2025, the Sierra Club filed direct testimony. On September 19, 2025, the PUCT staff filed its recommendation requesting that SOAH approve the application as filed. On October 3, 2024, the PUCT staff petitioned (Docket No. 57172) to establish a secondary cap on utilities’ 2024 Program Year (PY) earned performance bonuses equal to 25% of utilities’ total expenditures for PY 2024, and on August 13, 2025, the PUCT issued a final order denying the PUCT staff’s petition. On October 7, 2025, Houston Electric filed an unanimous stipulation and settlement agreement for the full amount requested.  On October 10, 2025, SOAH remanded this proceeding to the PUCT. \nTCOS\n$\n15 \nAugust 2025\nOctober 2025\nOctober 2025\nBased on the net change in invested capital since its last TCOS proceeding of approximately $112 million for the period January 1, 2025 through June 30, 2025.\nDCRF\n$\n55 \nAugust 2025\nTBD\nTBD\nBased on the net change in distribution invested capital since its last base rate proceeding of approximately $1.4 billion for the period January 1, 2024 through June 30, 2025 for an incremental revenue increase of $55 million adjusted for load growth.\nCenterPoint Energy and CERC - Beaumont/East Texas, South Texas, Houston and Texas Coast (Railroad Commission)\nTax Act Rider\n$\n15 \nAugust 2024\nJune 2025\nMay 2025\nResulting from the Texas Gas Rate Case, the first Tax Act Rider Calculation was filed on August 1, 2024 pursuant to Docket No. OS-23-00015513 to recover the effects of the IRA and certain other tax-related costs for rates that became effective January 1, 2025. These effects include the return on the CAMT deferred tax asset (“DTA”) resulting from the IRA, income tax credits resulting from the IRA and the return on the increment or decrement in the net operating loss DTA included in the rate base and in the standard service base revenue requirement approved in the Texas Gas Rate Case. CERC believes its filing is consistent with the Tax Act Rider tariff approved in Docket No. OS-23-00015513. On October 1, 2024, certain parties filed comments disputing the application. Briefings were filed with an ALJ in November 2024. A hearing on the merits was held on February 21, 2025 and continued on March 21, 2025.  On March 21, 2025, a unanimous settlement agreement was filed. On April 11, 2025, a PFD was issued.  On May 13, 2025, the Railroad Commission considered the PFD at an open meeting and issued a Final Order approving the settlement agreement.\n69\nTable of Contents\nMechanism\nAnnual Increase (Decrease) (1)\n(in millions)\nFiling\n Date\nEffective Date\nApproval Date\nAdditional Information\nTax Act Rider\n$\n22 \nAugust 2025\nJanuary 2026\nOctober 2025\nThe second Tax Act Rider was initially filed on August 1, 2025, and a revised filing was made on September 24, 2025, to recover the effects of the IRA and certain other tax-related costs for rates that would be effective for bills calculated on or after January 1, 2026. These effects include the return on the CAMT DTA resulting from the IRA, income tax credits resulting from the IRA and the return on the increment or decrement in the net operating loss DTA included in the rate base and in the standard service base revenue requirement approved in the Texas Gas Rate Case Docket No. OS-23-00015513. No comments from the parties were filed prior to the October 1, 2025 deadline for comments. The Railroad Commission accepted the Tax Act Rider filing on October 16, 2025.\nGRIP\n$\n70 \nFebruary 2025\nJune 2025\nMay 2025\nBased on net change in invested capital of $445 million.\nCenterPoint Energy and CERC - Minnesota (MPUC)\nRate Case\n$\n104 \nNovember 2023\nSeptember 2025\nJuly 2025\nSee discussion above under \nMinnesota Gas Rate Case.\nCIP Financial Incentive\n$\n8 \nMay 2025\nTBD\nTBD\nCIP Financial Incentive based on 2024 CIP program activity.\nCenterPoint Energy - Indiana South - Gas (IURC)\nCSIA\n$\n2 \nApril 2025\nAugust 2025\nJuly 2025\nRequested an increase of $11.6 million to rate base, which reflects an approximately $1.5 million annual increase in current revenues, of which 80% is included in the mechanism and 20% is deferred until the next rate case. The mechanism also includes a change in (over)/under recovery variance of $1.9 million. The OUCC filed testimony on June 3, 2025, recommending minor changes. Indiana South filed a rebuttal on June 17, 2025, adopting the changes. The evidentiary hearing was held on June 30, 2025. A final order was issued on July 30, 2025, with rates effective August 1, 2025.\nCSIA\n$\n1 \nOctober 2025\nTBD\nTBD\nRequested an increase of $13.0 million to rate base, which reflects an approximately $1.2 million annual increase in current revenues, of which 80% is included in the mechanism and 20% is deferred until the next rate case. The mechanism also includes a change in (over)/under recovery variance of $(2.1) million. The OUCC is expected to file testimony on December 2, 2025, and Indiana South’s rebuttal is due on December 16, 2025. An evidentiary hearing is scheduled for January 6, 2026. \nCenterPoint Energy and CERC - Indiana North - Gas (IURC)\nCSIA\n$\n9 \nApril 2025\nAugust 2025\nJuly 2025\nRequested an increase of $94.9 million to rate base, which reflects an approximately $8.6 million annual increase in current revenues, of which 80% is included in the mechanism and 20% is deferred until the next rate case. The mechanism also includes a change in (over)/under recovery variance of $5 million. The OUCC filed testimony on June 3, 2025.  Indiana North filed rebuttal testimony on June 17, 2025. The evidentiary hearing was held on June 30, 2025. A final order was issued on July 30, 2025, with rates effective August 1, 2025.\nCSIA\n$\n8 \nOctober 2025\nTBD\nTBD\nRequested an increase of $90.8 million to rate base, which reflects an approximately $7.6 million annual increase in current revenues, of which 80% is included in the mechanism and 20% is deferred until the next rate case. The mechanism also includes a change in (over)/under recovery variance of $(6.8) million. The OUCC is expected to file testimony on December 2, 2025, and Indiana North’s rebuttal is due on December 16, 2025. An evidentiary hearing is scheduled for January 6, 2026. \nCenterPoint Energy and CERC - Ohio - Gas (PUCO)\nDRR\n$\n6 \nMay \n2025\nSeptember 2025\nAugust 2025\nRequested an increase of $54 million to rate base for investments made in 2024, which reflects a $6 million annual increase in current revenues. A change in (over)/under-recovery variance of ($0.03) million annually is also included in rates. PUCO staff and intervenor (Ohio Consumers’ Counsel) filed comments June 27, 2025. PUCO staff recommended approval. Ohio Consumers’ Counsel commented on affordability and provided potential solutions including stretching out the replacement program over a longer period of time, phasing in the annual increase, shifting from fixed charges to volumetric charges, and increasing funding for its bill assistance programs. A statement informing the PUCO of whether the issues raised in comments have been resolved was filed on July 11, 2025. Supplemental Testimony from CEOH and the Ohio Consumers’ Counsel was filed on July 22, 2025. A hearing was scheduled for July 29, 2025, with all parties waiving motions to strike, objections, and cross examination. A final PUCO opinion and order was issued on August 20, 2025, finding that the updated DRR rates are just and reasonable and stating that the correct forum for the Ohio Consumers’ Counsel’s arguments was the 2018 Rate Case, the 2022 Extension, or the 2024 Rate Case. Revised rates became effective on September 1, 2025.\nRate Case\n$\n100 \nOctober 2024\nTBD\nTBD\nSee discussion above under \nOhio Gas Rate Case.\n(1)\nRepresents proposed increases (decreases) when effective date and/or approval date is not yet determined. Approved rates could differ materially from proposed rates.\n70\nTable of Contents\nTariffs\nIn 2025, the U.S. government has announced and, in certain cases, rescinded, multiple tariffs on several foreign jurisdictions and imports into the United States. For example, in March 2025, the U.S. government imposed a 25% tariff on steel imports (increased an additional 25% in June 2025), and in April 2025, the U.S. government announced a baseline tariff of 10% on products imported from most countries and an additional individualized reciprocal tariff on the countries with which the United States has the largest trade deficits, including China. In August 2025, the U.S. government imposed a 25% tariff on India in response to its continued importation of Russian oil, which is in addition to the pre-existing 25% individualized reciprocal tariff on India. Increased tariffs by the United States have led, and may continue to lead, to the imposition of retaliatory tariffs or other measures taken by foreign jurisdictions, which may in turn lead to additional tariffs imposed or measures taken by the United States. In August 2025, however, the U.S. Court of Appeals for the Federal Circuit ruled that many of the tariffs imposed under the Trump Administration exceed presidential authority and therefore are invalid, though the decision has been stayed pending U.S. Supreme Court review. This ruling introduces additional uncertainty as to the scope and durability of existing and future tariff measures. While the U.S. government has announced various trade deals, many such agreements are preliminary and may be subject to change. Further, any future disagreement between the U.S. government and other countries over the implementation of trade deals or any failure to obtain required governmental approvals or otherwise reach a final agreement could result in prolonged uncertainty regarding the scope and duration of such trade actions by the U.S. government and other countries. Such announcements, rescissions of tariffs on foreign jurisdictions and other trade actions have increased uncertainty regarding the ultimate effects of the tariffs on economic conditions. Current uncertainties about tariffs and their effects on trading relationships may affect the Registrants’ ability to access the capital markets, contribute to inflation in the markets in which the Registrants operate, increase commodity cost volatility, impact availability of goods and materials or otherwise negatively impact the global supply chain. The Registrants are continuing to monitor the economic effects of such announcements and developments, as well as the Registrants’ ability to mitigate their related impacts, but costs and other effects associated with the tariffs remain uncertain.\nGreenhouse Gas and Climate-Related Regulation and Compliance (CenterPoint Energy)\nThere has been increasing attention at the local, state and international levels to the issue of climate risk. There has been a recent shift, however, in climate policy at the federal level in the United States. On June 11, 2025, the EPA proposed to repeal all GHG emissions standards for the power sector under Section 111 of the Clean Air Act. As an alternative, the EPA proposed to repeal a narrower set of requirements, including the emission guidelines for existing fossil fuel-fired steam electric generating units and the carbon capture and sequestration/storage-based standards for new base load stationary combustion turbines. On July 29, 2025, the EPA issued an interim final rule extending several compliance deadlines associated with the 2024 New Source Performance Standards (“NSPS OOOOb”) and Emissions Guidelines (“EG OOOOc”) for the oil and gas industry. NSPS OOOOb and EG OOOOc were published in March 2024 and took effect in May 2024. The EPA announced its intention to reconsider NSPS OOOOb and EG OOOOc in March 2025. On July 29, 2025, the EPA released a pre-publication proposed rule which would rescind EPA’s 2009 final rule under the Clean Air Act finding that GHGs endanger the public health and welfare of current and future generations (“Endangerment Finding”) and that emissions of GHGs from new motor vehicles contribute to GHG pollution that threatens the public health and welfare. On September 16, 2025, the EPA announced a proposal to end the Greenhouse Gas Reporting Program (“GHGRP”) for all sectors except petroleum and natural gas systems (excluding reporting for natural gas distribution, which would also be eliminated under the proposal). Reporting for petroleum and natural gas systems under the GHGRP would be deferred until 2034 under the proposal. The Registrants will monitor the proposed rules and evaluate the impacts of any final rules.\nOn March 6, 2024, the SEC adopted final rules that require the Registrants to disclose certain climate-related information in registration statements and annual reports. Litigation challenging the rules was filed by multiple parties in multiple jurisdictions, which was consolidated and assigned to the U.S. Court of Appeals for the Eighth Circuit. On April 4, 2024, the SEC announced it was voluntarily delaying the implementation of the climate disclosure rules while the U.S. Court of Appeals considered the litigation, and on March 27, 2025, the SEC voted to end the defense of the rules in the litigation. On September 12, 2025, the U.S. Court of Appeals issued an order to hold the petitions challenging the climate disclosure rules in abeyance pending further action by the SEC. \n71\nTable of Contents\nClimate Risk Trends and Uncertainties\nChanges in the U.S. presidential administration and significant expected increases in electric demand, as announced by organizations such as ERCOT and MISO, have shifted the energy landscape in the United States. Since taking office, President Trump has issued a series of executive orders and presidential memoranda that seek to increase investment in fossil fuel infrastructure, including by directing all heads of federal agencies to identify and begin the processes to suspend, revise or rescind all agency actions that are determined to be unduly burdensome on the identification, development or use of domestic energy resources, with particular attention to oil, natural gas, hydropower, biofuels, critical mineral and nuclear energy resources. Additionally, on July 4, 2025, the OBBBA was signed into law, which includes numerous changes to the energy tax credits initially introduced and expanded under the IRA, including accelerated phase outs for certain credits. Further, on July 7, 2025, President Trump issued Executive Order 14315, which relates to the implementation of such changes to energy tax credits. This shift in federal domestic energy policy has resulted in uncertainty with respect to the scope and speed of future renewable generation infrastructure development and the role that existing renewable generation will play in support of the U.S. energy grid. The long-term impacts of this domestic energy policy shift are uncertain, including with respect to impacts on the development of, and consequently the availability of, alternative energy sources (such as solar energy, including private solar, wind energy, microturbines, fuel cells, energy-efficient buildings and energy storage devices). Additionally, it is unclear whether, and if so how, the new domestic energy policy, including the potential suspension, revision or rescission of regulations restricting emissions (including methane emissions), will affect consumers’ and companies’ energy use, adoption of alternative energy sources or decisions to expand their facilities, including natural gas facilities. \n \nOther Matters\nCredit Facilities\nThe Registrants may draw on their respective revolving credit facilities from time to time to provide funds used for general corporate and limited liability company purposes, including to backstop CenterPoint Energy’s and CERC’s commercial paper programs. The facilities may also be utilized to obtain letters of credit. For further details related to the Registrants’ revolving credit facilities, see Note 9 to the Interim Condensed Financial Statements.\nBased on the consolidated debt to capitalization covenant in the Registrants’ revolving credit facilities, the Registrants would have been permitted to utilize the full capacity of such revolving credit facilities, which aggregated approximately $4.0 billion as of September 30, 2025. As of October 20, 2025, the Registrants had the following revolving credit facilities and utilization of such facilities:\nAmount Utilized as of October 20, 2025\nRegistrant\nSize of Facility\nLoans\nLetters of Credit\nCommercial Paper\nWeighted Average Interest Rate\nTermination Date\n(in millions)\nCenterPoint Energy \n$\n2,400 \n$\n— \n$\n— \n$\n50 \n4.19%\nDecember 6, 2028\nCenterPoint Energy (1)\n250 \n— \n— \n— \n—%\nDecember 6, 2028\nHouston Electric\n300 \n— \n— \n— \n—%\nDecember 6, 2028\nCERC\n1,050 \n— \n— \n310 \n4.19%\nDecember 6, 2028\nTotal \n$\n4,000 \n$\n— \n$\n— \n$\n360 \n(1)\nThis credit facility was issued by SIGECO.\nThe Registrants and SIGECO are currently in compliance with the various business and financial covenants in the four revolving credit facilities.\nDebt Transactions\nFor detailed information about the Registrants’ debt transactions to date in 2025, see Note 9 to the Interim Condensed Financial Statements.\nSecurities Registered with the SEC\nOn May 17, 2023, the Registrants filed a joint shelf registration statement with the SEC registering indeterminate principal amounts of Houston Electric’s general mortgage bonds, CERC Corp.’s senior debt securities and CenterPoint Energy’s senior debt securities and junior subordinated debt securities and an indeterminate number of shares of Common Stock, shares of \n72\nTable of Contents\npreferred stock, depositary shares, as well as stock purchase contracts and equity units. The joint shelf registration statement will expire on May 17, 2026. For information related to the Registrants’ debt issuances in 2025, see Note 9 to the Interim Condensed Financial Statements.\nAdditionally, for information related to shares of Common Stock sold pursuant to the forward sale agreements and the Equity Distribution Agreement in 2025, see Note 15 to the Interim Condensed Financial Statements.\nMoney Pool\nThe Registrants participate in a money pool through which they and certain of their subsidiaries can borrow or invest on a short-term basis. Funding needs are aggregated and external borrowing or investing is based on the net cash position. The net funding requirements of the CenterPoint Energy money pool are expected to be met with borrowings under CenterPoint Energy’s revolving credit facility or the sale of CenterPoint Energy’s commercial paper. \nThe table below summarizes CenterPoint Energy money pool activity by Registrant as of October 20, 2025:\nWeighted Average Interest Rate\nHouston Electric\nCERC\n \n(in millions)\nMoney pool investments (borrowings)\n4.25%\n$\n453 \n$\n(200)\nImpact on Liquidity of a Downgrade in Credit Ratings\nThe interest rate on borrowings under the credit facilities is based on each respective borrower’s credit ratings. As of October 20, 2025, Moody’s, S&P and Fitch had assigned the following credit ratings to the borrowers:\n \nMoody’s\nS&P\nFitch\nRegistrant\nBorrower/Instrument\nRating\nOutlook (1)\nRating\nOutlook (2)\nRating\nOutlook (3)\nCenterPoint Energy\nCenterPoint Energy Senior Unsecured Debt\nBaa2\nNegative\nBBB\nNegative\nBBB\nStable\nCenterPoint Energy\nVectren Corp. Issuer Rating\nn/a\nn/a\nBBB+\nNegative\nn/a\nn/a\nCenterPoint Energy\nSIGECO Senior Secured Debt\nA1 \nStable\nA\nNegative\nn/a\nn/a\nHouston Electric\nHouston Electric Senior Secured Debt\nA2\nNegative\nA\nNegative\nA\nNegative\nCERC\nCERC Corp. Senior Unsecured Debt \nA3\nStable\nBBB+\nNegative\nA-\nStable\nCERC\nIndiana Gas Senior Unsecured Debt\nn/a\nn/a\nBBB+\nNegative\nn/a\nn/a\n(1)\nA Moody’s rating outlook is an opinion regarding the likely direction of an issuer’s rating over the medium term.\n(2)\nAn S&P outlook assesses the potential direction of a long-term credit rating over the intermediate to longer term.\n(3)\nA Fitch rating outlook indicates the direction a rating is likely to move over a one- to two-year period.\nThe Registrants cannot assure that the ratings set forth above will remain in effect for any given period of time or that one or more of these ratings will not be lowered or withdrawn entirely by a rating agency. The Registrants note that these credit ratings are included for informational purposes and are not recommendations to buy, sell or hold the Registrants’ securities and may be revised or withdrawn at any time by the rating agency. Each rating should be evaluated independently of any other rating. Any future reduction or withdrawal of one or more of the Registrants’ credit ratings could have a material adverse impact on the Registrants’ ability to obtain short- and long-term financing, the cost of such financings and the execution of the Registrants’ commercial strategies.\nA decline in credit ratings could increase borrowing costs under the Registrants’ revolving credit facilities. If the Registrants’ credit ratings had been downgraded one notch by S&P and Moody’s from the ratings that existed as of September 30, 2025, the impact on the borrowing costs under the four revolving credit facilities would have been insignificant. A decline in credit ratings would also increase the interest rate on long-term debt to be issued in the capital markets and could negatively impact the Registrants’ ability to complete capital market transactions and to access the commercial paper market. Additionally, a decline in credit ratings could increase cash collateral requirements and reduce earnings of CenterPoint Energy’s and CERC’s Natural Gas reportable segments.\nPipeline tariffs and contracts typically provide that if the credit ratings of a shipper or the shipper’s guarantor drop below a threshold level, which is generally investment grade ratings from both Moody’s and S&P, cash or other collateral may be demanded from the shipper in an amount equal to the sum of three months’ charges for pipeline services plus the unrecouped \n73\nTable of Contents\ncost of any lateral built for such shipper. If the credit ratings of CERC Corp. decline below the applicable threshold levels, CERC might need to provide cash or other collateral of up to $293 million as of September 30, 2025. The amount of collateral will depend on seasonal variations in transportation levels.\nZENS and Securities Related to ZENS (CenterPoint Energy)\nIf CenterPoint Energy’s creditworthiness were to drop such that ZENS holders thought CenterPoint Energy’s liquidity was adversely affected or the market for the ZENS were to become illiquid, some ZENS holders might decide to exchange their ZENS for cash. Funds for the payment of cash upon exchange could be obtained from the sale of the shares of ZENS-Related Securities that CenterPoint Energy owns or from other sources. CenterPoint Energy owns shares of ZENS-Related Securities equal to approximately 100% of the reference shares used to calculate its obligation to the holders of the ZENS. ZENS exchanges result in a cash outflow because tax deferrals related to the ZENS and shares of ZENS-Related Securities would typically cease when ZENS are exchanged or otherwise retired and shares of ZENS-Related Securities are sold. The ultimate tax liability related to the ZENS and ZENS-Related Securities continues to increase by the amount of the tax benefit realized each year, and there could be a significant cash outflow when the taxes are paid as a result of the retirement or exchange of the ZENS. If all ZENS had been exchanged for cash on September 30, 2025, deferred taxes of approximately $861 million would have been payable in 2025. If all the ZENS-Related Securities had been sold on September 30, 2025, capital gains taxes of approximately $87 million would have been payable in 2025 based on 2025 tax rates in effect. As of September 30, 2025, CenterPoint Energy had both net operating loss and CAMT carryforwards available from its filed 2024 federal income tax return that can be applied to largely offset the cash outflow that would result from a retirement or exchange of the ZENS. For additional information about ZENS, see Note 8 to the Interim Condensed Financial Statements.\nCross Defaults\nUnder the Registrants’ respective revolving credit facilities, a payment default on, or a non-payment default, event or condition that permits acceleration of, any indebtedness for borrowed money and certain other specified types of obligations (including guarantees) exceeding $125 million by the borrower or any of their respective significant subsidiaries will cause a default under such borrower’s respective credit facility or term loan agreement. Under SIGECO’s revolving credit facility, a payment default on, or a non-payment default, event or condition that permits acceleration of, any indebtedness for borrowed money and certain other specific types of obligations (including guarantees) exceeding $75 million by SIGECO or any of its significant subsidiaries will cause a default under SIGECO’s credit facility. A default by CenterPoint Energy would not trigger a default under its subsidiaries’ debt instruments or revolving credit facilities.\nPossible Acquisitions, Divestitures and Joint Ventures\nFrom time to time, the Registrants consider the acquisition or the disposition of assets or businesses or possible joint ventures, strategic initiatives or other joint ownership arrangements with respect to assets or businesses. Any determination to take action in this regard will be based on market conditions and opportunities existing at the time, and accordingly, the timing, size or success of any efforts and the associated potential capital commitments are unpredictable. The Registrants may seek to fund all or part of any such efforts with proceeds from debt and/or equity issuances. Debt or equity financing may not, however, be available to the Registrants at that time due to a variety of events, including, among others, maintenance of our credit ratings, industry conditions, general economic conditions, market conditions and market perceptions. CenterPoint Energy has increased its planned capital expenditures in its Electric and Natural Gas businesses multiple times over the recent years to support rate base growth and may continue to do so in the future. The Registrants may continue to explore asset sales as a means to efficiently finance a portion of its increased capital expenditures in the future, subject to the considerations listed above. For further information, see Note 3 to the Interim Condensed Financial Statements.\nOn February 19, 2024, CenterPoint Energy, through its subsidiary CERC Corp., entered into the LAMS Asset Purchase Agreement to sell its Louisiana and Mississippi natural gas LDC businesses for approximately $1.2 billion, subject to adjustment as set forth in the LAMS Asset Purchase Agreement, including adjustments based on net working capital, regulatory assets and liabilities and capital expenditures at closing. The transaction closed on March 31, 2025. On March 7, 2025, SIGECO acquired 100% of the equity interests in Posey Solar, which was constructing a 191 MW solar array in Posey County, Indiana, for approximately $357 million. For further information, see Note 3 to the Interim Condensed Financial Statements. In May 2025, CenterPoint Energy announced that it is planning to sell its Ohio natural gas LDC business to support the efficient recycling of capital and portfolio optimization.\nOn October 20, 2025, CenterPoint Energy, through CERC Corp., entered into the Ohio Securities Purchase Agreement to sell all of the issued and outstanding equity interests in CEOH. The proposed transaction is expected to close in the fourth quarter of 2026. For further information, see Note 16 to the Interim Condensed Financial Statements.\n74\nTable of Contents\nCollection of Receivables from REPs (CenterPoint Energy and Houston Electric)\nHouston Electric’s receivables from the distribution of electricity are collected from REPs that supply the electricity Houston Electric distributes to their customers. Before conducting business, a REP must register with the PUCT and must meet certain financial qualifications. Nevertheless, adverse economic conditions, weather events such as the February 2021 Winter Storm Event, structural problems in the market served by ERCOT or financial difficulties of one or more REPs could impair the ability of these REPs to pay for Houston Electric’s services or could cause them to delay such payments. Houston Electric depends on these REPs to remit payments on a timely basis, and any delay or default in payment by REPs could adversely affect Houston Electric’s cash flows. In the event of a REP default, Houston Electric’s tariff provides a number of remedies, including the option for Houston Electric to request that the PUCT suspend or revoke the certification of the REP. Applicable regulatory provisions require that customers be shifted to another REP or a provider of last resort if a REP cannot make timely payments. However, Houston Electric remains at risk for payments related to services provided prior to the shift to the replacement REP or the provider of last resort. If a REP were unable to meet its obligations, it could consider, among various options, restructuring under the bankruptcy laws, in which event such REP might seek to avoid honoring its obligations and claims might be made against Houston Electric involving payments it had received from such REP. If a REP were to file for bankruptcy, Houston Electric may not be successful in recovering accrued receivables owed by such REP that are unpaid as of the date the REP filed for bankruptcy. However, PUCT regulations authorize utilities, such as Houston Electric, to defer bad debts resulting from defaults by REPs for recovery in future rate cases, subject to a review of reasonableness and necessity. \nOther Factors that Could Affect Cash Requirements\nIn addition to the above factors, the Registrants’ liquidity and capital resources could also be negatively affected by:\n \n•\ncash collateral requirements that could exist in connection with certain contracts, including weather hedging arrangements, and natural gas purchases, natural gas price and natural gas storage activities of CenterPoint Energy’s and CERC’s Natural Gas reportable segment;\n•\nacceleration of payment dates on certain gas supply contracts, under certain circumstances, as a result of increased natural gas prices, and concentration of natural gas suppliers (CenterPoint Energy and CERC);\n•\nincreased costs related to the acquisition of natural gas (CenterPoint Energy and CERC);\n•\nincreased costs of certain goods, materials or services due to tariffs or trade restrictions imposed by the U.S. government, the imposition of retaliatory tariffs or other measures, and any effect on trading relationships between the United States and other countries;\n•\nincreases in interest expense in connection with debt refinancings and borrowings under credit facilities or term loans or the use of alternative sources of financings, including financings due to the May 2024 Storm Events and Hurricane Beryl;\n•\nvarious legislative, executive or regulatory actions at the federal, state and local levels, including actions in response to Hurricane Beryl and actions pertaining to trade (including tariffs, bans, retaliatory trade measures taken against the United States or related governmental action);\n•\nincremental collateral, if any, that may be required due to regulation of derivatives (CenterPoint Energy);\n•\nthe ability of REPs, including REP affiliates of NRG and Vistra Energy Corp., to satisfy their obligations to CenterPoint Energy and Houston Electric;\n•\nslower customer payments and increased write-offs of receivables due to higher natural gas prices, changing economic conditions, public health threats or severe weather events, such as the May 2024 Storm Events and Hurricane Beryl (CenterPoint Energy and CERC);\n•\nthe satisfaction of any obligations pursuant to guarantees;\n•\nthe outcome of litigation, including litigation related to the February 2021 Winter Storm Event and Hurricane Beryl;\n•\ncontributions to pension and postretirement benefit plans; \n•\nrecovery of any losses under applicable insurance policies;\n•\nrestoration costs and revenue losses resulting from future natural disasters such as hurricanes or other severe weather events and the timing of and amounts sought for recovery of such restoration costs; and\n•\nvarious other risks identified in “Risk Factors” in \nPart I, Item 1A of the Registrants’ combined 2024 Form 10-K\n, which are incorporated herein by reference, in Part II, Item 1A of this combined Form 10-Q, and in other reports that the Registrants file from time to time with the SEC.\n75\nTable of Contents\nCertain Contractual Limits on Our Ability to Issue Securities and Borrow Money\n Certain provisions in certain note purchase agreements relating to debt issued by CERC have the effect of restricting the amount of secured debt issued by CERC and debt issued by subsidiaries of CERC Corp. Additionally, Houston Electric and SIGECO are limited in the amount of mortgage bonds they can issue by the General Mortgage and SIGECO’s mortgage indenture, respectively. For information about the total debt to capitalization financial covenants in the Registrants’ and SIGECO’s revolving credit facilities, see Note 9 to the Interim Condensed Financial Statements.\nCRITICAL ACCOUNTING POLICIES\nA critical accounting policy is one that is both important to the presentation of the Registrants’ financial condition and results of operations and requires management to make difficult, subjective or complex accounting estimates. An accounting estimate is an approximation made by management of a financial statement element, item or account in the financial statements. Accounting estimates in the Registrants’ historical consolidated financial statements measure the effects of past business transactions or events, or the present status of an asset or liability. Additionally, different estimates that the Registrants could have used or changes in an accounting estimate that are reasonably likely to occur could have a material impact on the presentation of their financial condition, results of operations or cash flows. The circumstances that make these judgments difficult, subjective and/or complex have to do with the need to make estimates about the effect of matters that are inherently uncertain. Estimates and assumptions about future events and their effects cannot be predicted with certainty. The Registrants base their estimates on historical experience and on various other assumptions that they believe to be reasonable under the circumstances, the results of which form the basis for making judgments. These estimates may change as new events occur, as more experience is acquired, as additional information is obtained and as the Registrants’ operating environment changes. Our critical accounting policies that we deemed the most material in nature were reported in our combined 2024 Form 10-K. There has been no material changes with regard to these critical accounting policies."
}