{
  "source_file": "cof-20241231.htm",
  "form_type": "10-K",
  "item1": "Item 1. Business \nOVERVIEW\nGeneral\nCapital One Financial Corporation, a Delaware corporation established in 1994 and headquartered in McLean, Virginia, is a diversified financial services holding company with banking and non-banking subsidiaries. Capital One Financial Corporation and its subsidiaries (the “Company” or “Capital One”) offer a broad array of financial products and services to consumers, small businesses and commercial clients through digital channels, branch locations, cafés and other distribution channels. \nAs of December 31, 2024, Capital One Financial Corporation’s principal operating subsidiary was Capital One, National Association (“CONA”). The Company is hereafter collectively referred to as “we,” “us” or “our.”  CONA is referred to as the “Bank.”\nReferences to “this Report” or our “2024 Form 10-K” or “2024 Annual Report” are to our Annual Report on Form 10-K for the fiscal year ended December 31, 2024. All references to 2024, 2023 and 2022, refer to our fiscal years ended, or the dates, as the context requires, December 31, 2024, December 31, 2023 and December 31, 2022, respectively. Certain business terms used in this document are defined in “Part II—Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations (“MD&A”)—Glossary and Acronyms” and should be read in conjunction with the Consolidated Financial Statements included in this Report.\nWe were the third largest issuer of Visa\n®\n (“Visa”) and MasterCard\n®\n (“MasterCard”) credit cards in the U.S. based on the outstanding balance of credit card loans as of December 31, 2024. In addition to credit cards, we also offer debit cards, bank lending, treasury management and depository services, auto loans and other consumer lending products in markets across the U.S. As one of the nation’s largest banks based on deposits as of December 31, 2024, we service banking customer accounts through digital channels and our network of branch locations, cafés, call centers and automated teller machines (“ATMs”). \nWe also offer products and services outside of the U.S. principally through Capital One (Europe) plc (“COEP”), an indirect subsidiary of CONA organized and located in the United Kingdom (“U.K.”), and through a branch of CONA in Canada. Both COEP and our Canadian branch of CONA have the authority to provide credit card loans.\nAgreement to Acquire Discover \nOn February 19, 2024, the Company entered into an agreement and plan of merger (the “Merger Agreement”), by and among Capital One, Discover Financial Services, a Delaware corporation (“Discover”) and Vega Merger Sub, Inc., a Delaware corporation and a direct, wholly owned subsidiary of the Company (“Merger Sub”), pursuant to which (a) Merger Sub will merge with and into Discover, with Discover as the surviving entity in the merger (the “Merger”); (b) immediately following the Merger, Discover, as the surviving entity, will merge with and into Capital One, with Capital One as the surviving entity in the second-step merger (the “Second Step Merger”); and (c) immediately following the Second Step Merger, Discover Bank, a Delaware-chartered and wholly owned subsidiary of Discover, will merge with and into CONA, with CONA as the surviving entity in the merger (the “CONA Bank Merger,” and collectively with the Merger and the Second Step Merger, the “Transaction”). The Merger Agreement was unanimously approved by the Boards of Directors of each of Capital One and Discover.\nAt the effective time of the Merger, each share of common stock of Discover outstanding immediately prior to the effective time of the Merger, other than certain shares held by Discover or Capital One, will be converted into the right to receive 1.0192 shares of common stock of Capital One. Holders of Discover common stock will receive cash in lieu of fractional shares. At the effective time of the Second Step Merger, each share of Fixed-to-Floating Rate Non-Cumulative Perpetual Preferred Stock, Series C, of Discover, and each share of 6.125% Fixed-Rate Reset Non-Cumulative Perpetual Preferred Stock, Series D, of Discover, in each case outstanding immediately prior to the effective time of the Second Step Merger, will be converted into the right to receive a share of newly created series of preferred stock of Capital One having terms that are not materially less favorable than the applicable series of Discover preferred stock.\nOn February 18, 2025, Capital One and Discover each held a special meeting of their respective stockholders. During the respective meetings, Capital One stockholders approved by the requisite vote the issuance of Capital One common stock as \n4\nCapital One Financial Corporation (COF)\nTable of Contents\nmerger consideration to the holders of Discover common stock, and Discover stockholders adopted by the requisite vote the Merger Agreement. The closing of the Transaction remains subject to the satisfaction of other customary closing conditions, including the receipt of required regulatory approvals.\n \nWalmart Program Agreement Termination\nOn May 21, 2024, our credit card program agreement with Walmart terminated (“Walmart Program Termination”). Pursuant to terms of the termination, Capital One retained ownership and servicing of the existing credit card portfolio and is nearing completion of converting eligible customers into Capital One branded card products.\nOther Business Developments\nWe regularly explore and evaluate opportunities to acquire financial products and services as well as financial assets, including credit card and other loan portfolios, and enter into strategic partnerships as part of our growth strategy. We also explore opportunities to acquire technology companies and related assets to improve our information technology infrastructure and to deliver on our digital strategy. We may issue equity or debt to fund our acquisitions. In addition, we regularly consider the potential disposition of certain of our assets, branches, partnership agreements or lines of business. \nAdditional Information\nOur common stock trades on the New York Stock Exchange (“NYSE”) under the symbol “COF” and is included in the Standard & Poor’s (“S&P”) 100 Index. We maintain a website at www.capitalone.com. Documents available under  “Governance & Leadership” in the Investor Relations section of our website include:\n•\nour Certificate of Incorporation, Bylaws, Corporate Governance Guidelines, and Code of Conduct; and\n•\ncharters for the Audit, Compensation, Governance and Nominating, and Risk Committees of the Board of Directors.\nThese documents also are available in print to any stockholder who requests a copy. We intend to disclose any future amendments to, or waivers from, our Code of Conduct on the website following the date of any such amendment or waiver. \nIn addition, we make available free of charge through our website all of our U.S. Securities and Exchange Commission (“SEC”) filings, including our Annual Reports on Form 10-K, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K and amendments to those reports filed or furnished pursuant to Section 13(a) or 15(d) of the Exchange Act, as soon as reasonably practicable after electronically filing or furnishing such material to the SEC at www.sec.gov. We also routinely post financial and other information, which could be deemed to be material to investors, on our investor relations website. Information regarding our corporate social responsibility and environmental sustainability initiatives is also available on our website. The content of any of our websites referred to in this Report is not incorporated by reference into this Report or any other filings with the SEC.\n5\nCapital One Financial Corporation (COF)\nTable of Contents\nOPERATIONS AND BUSINESS SEGMENTS\nOur consolidated total net revenues are derived primarily from lending to consumer and commercial customers net of funding costs associated with our deposits, long-term debt and other borrowings. We also earn non-interest income which primarily consists of interchange income, net of reward expenses, and service charges and other customer-related fees. Our expenses primarily consist of the provision for credit losses, operating expenses, marketing expenses and income taxes.\nOur principal operations are organized for management reporting purposes into three major business segments, which are defined primarily based on the products and services provided or the types of customers served: Credit Card, Consumer Banking and Commercial Banking. The operations of acquired businesses have been integrated into or managed as a part of our existing business segments. Certain activities that are not part of a business segment are included in the Other category, such as the management of our corporate investment portfolio and asset/liability positions performed by our centralized Corporate Treasury group and any residual tax expense or benefit beyond what is assessed to our business segments in order to arrive at the consolidated effective tax rate. The Other category also includes unallocated corporate expenses that do not directly support the operations of the business segments or for which the business segments are not considered financially accountable in evaluating their performance, such as certain restructuring charges and integration expenses related to the Transaction. \n•\nCredit Card:\n Consists of our domestic consumer and small business card lending, and international card businesses in  the U.K. and Canada. \n•\nConsumer Banking:\n Consists of our deposit gathering and lending activities for consumers and small businesses, and national auto lending. \n•\nCommercial Banking:\n Consists of our lending, deposit gathering, capital markets and treasury management services to commercial real estate and commercial and industrial customers. Our customers typically include companies with annual revenues between $20 million and $2 billion.\nCustomer usage and payment patterns, estimates of future expected credit losses, levels of marketing expense and operating efficiency all affect our profitability. In our Credit Card business, we generally experience fluctuations in purchase volume and the level of outstanding loan receivables from seasonal variances in consumer spending and payment patterns which, for example, have historically been the highest around the winter holiday season. Net charge-off rates for our credit card loan portfolio have historically exhibited seasonal patterns as well and generally tend to be the highest in the first quarter of the year. \nFor additional information on our business segments, including the financial performance of each business, see “Part II—Item 7. MD&A—Executive Summary,” “Part II—Item 7. MD&A—Business Segment Financial Performance” and “Part II—Item 8. Financial Statements and Supplementary Data—Note 18—Business Segments and Revenue from Contracts with Customers” of this Report.\n6\nCapital One Financial Corporation (COF)\nTable of Contents\nCOMPETITION\nEach of our business segments operates in a highly competitive environment, and we face competition in all aspects of our business from numerous bank and non-bank providers of financial services.\nOur Credit Card business competes with international, national, regional and local issuers of Visa and MasterCard credit cards, as well as with American Express\n®\n, Discover Card\n®\n, private-label card brands, and, to a certain extent, issuers of debit cards. In general, customers are attracted to credit card issuers largely on the basis of price, credit limit, reward programs, customer experience and other product features.\nOur Consumer Banking and Commercial Banking businesses compete with national, state and direct banks as well as with savings and loan associations and credit unions for loans and deposits. Our competitors also include automotive finance companies, commercial banking companies and other financial services providers that provide loans, deposits, and other similar services and products. In addition, we compete against non-bank institutions that are able to offer these products and services. \nWe also consider new and emerging companies in digital and mobile payments and other financial technology providers among our competitors. We compete with many forms of payment mechanisms, systems and products, offered by both bank and non-bank providers.\nOur businesses generally compete on the basis of the quality and range of their products and services, transaction execution, innovation and price. Competition varies based on the types of clients, customers, industries and geographies served. Our ability to compete depends, in part, on our ability to attract and retain our associates and on our reputation as well as our ability to keep pace with innovation, in particular in the development of new technology platforms. There can be no assurance, however, that our ability to market products and services successfully or to obtain adequate returns on our products and services will not be impacted by the nature of the competition that now exists or may later develop, or by the broader economic environment. For a discussion of the risks related to our competitive environment, see “Item 1A. Risk Factors.”\nSUPERVISION AND REGULATION\nGeneral\nThe regulatory framework applicable to banking organizations is intended primarily for the protection of depositors and the stability of the U.S. financial system, rather than for the protection of stockholders and creditors.\nAs a banking organization, we are subject to extensive regulation and supervision. In addition to banking laws and regulations, we are subject to various other laws and regulations, all of which directly or indirectly affect our operations, management and ability to make distributions to stockholders. We and our subsidiaries are also subject to supervision and examination by multiple regulators. In addition to laws and regulations, state and federal bank regulatory agencies may issue policy statements, interpretive letters and similar written guidance applicable to us and our subsidiaries. Any change in the statutes, regulations or regulatory policies applicable to us, including changes in their interpretation or implementation, could have a material effect on our business or organization.\nBoth the scope of the laws and regulations and the intensity of the supervision to which we are subject have increased, initially in response to the 2007-2008 financial crisis, and more recently in light of other factors such as technological, political and market changes, as well as the 2023 regional bank failures. Regulatory enforcement and fines have also increased across the banking and financial services sector.\nThe descriptions below summarize certain significant federal and state laws, as well as international laws, to which we are subject. The descriptions are qualified in their entirety by reference to the particular statutory or regulatory provisions summarized. They do not summarize all possible or proposed changes in current laws or regulations and are not intended to be a substitute for the related statutes or regulatory provisions.\nPrudential Regulation of Banking \nCapital One Financial Corporation is a bank holding company (“BHC”) and a financial holding company (“FHC”) under the Bank Holding Company Act of 1956, as amended (“BHC Act”), and is subject to the requirements of the BHC Act, including approval requirements for investments in or acquisitions of banking organizations, capital adequacy standards and limitations \n7\nCapital One Financial Corporation (COF)\nTable of Contents\non non-banking activities. As a BHC and FHC, we are subject to supervision, examination and regulation by the Board of Governors of the Federal Reserve System (“Federal Reserve”). Permissible activities for a BHC include those activities that are so closely related to banking as to be a proper incident thereto. In addition, an FHC is permitted to engage in activities considered to be financial in nature (including, for example, securities underwriting and dealing and merchant banking activities), incidental to financial activities or, if the Federal Reserve determines that they pose no risk to the safety or soundness of depository institutions or the financial system in general, activities complementary to financial activities.\nTo become and remain eligible for FHC status, a BHC and its subsidiary depository institutions must meet certain criteria, including capital, management and Community Reinvestment Act (“CRA”) requirements. Failure to meet such criteria could result, depending on which requirements were not met, in restrictions on new financial activities or acquisitions or being required to discontinue existing activities that are not generally permissible for BHCs.\nThe Bank is a national association chartered under the National Bank Act, the deposits of which are insured by the Federal Deposit Insurance Corporation (“FDIC”) up to applicable limits. The Bank is subject to comprehensive regulation and periodic examination by the Office of the Comptroller of the Currency (“OCC”), the FDIC and the Consumer Financial Protection Bureau (“CFPB”).\nWe also are registered as a financial institution holding company under the laws of the Commonwealth of Virginia and, as such, we are subject to periodic examination by the Virginia Bureau of Financial Institutions. We also face regulation in the international jurisdictions in which we conduct business. See “Regulation by Authorities Outside the United States” below for additional details.\nCapital and Stress Testing Regulation\nThe Company and the Bank are subject to capital adequacy guidelines adopted by the Federal Reserve and OCC, respectively. For a further discussion of the capital adequacy guidelines, see “Part II—Item 7. MD&A—Capital Management” and “Part II—Item 8. Financial Statements and Supplementary Data—Note 12—Regulatory and Capital Adequacy.”\nBasel III and U.S. Capital Rules\nThe Company and the Bank are subject to the regulatory capital requirements established by the Federal Reserve and the OCC, respectively (“Basel III Capital Rules”). The Basel III Capital Rules implement certain capital requirements published by the Basel Committee on Banking Supervision (“Basel Committee”), along with certain provisions of the Dodd-Frank Wall Street Reform and Consumer Protection Act of 2010 (“Dodd-Frank Act”) and other capital provisions.\nAs a BHC with total consolidated assets of at least $250 billion but less than $700 billion and not exceeding any of the applicable risk-based thresholds, the Company is a Category III institution under the Basel III Capital Rules.\nThe Bank, as a subsidiary of a Category III institution, is a Category III bank. Moreover, the Bank, as an insured depository institution, is subject to prompt corrective action (“PCA”) capital regulations, as described below.\nUnder the Basel III Capital Rules, we must maintain a minimum common equity Tier 1 (“CET1”) capital ratio of 4.5%, a Tier 1 capital ratio of 6.0% and a total capital ratio of 8.0%, in each case in relation to risk-weighted assets. In addition, we must maintain a minimum leverage ratio of 4.0% and a minimum supplementary leverage ratio of 3.0%. We are also subject to the capital conservation buffer requirement and countercyclical capital buffer requirement, each as described below. Our capital and leverage ratios are calculated based on the Basel III standardized approach framework.\nWe have elected to exclude certain elements of accumulated other comprehensive income (“AOCI”) from our regulatory capital as permitted for a Category III institution. See “Basel III Finalization Proposal” below for information on the recognition of AOCI in regulatory capital under the proposed changes to the Basel III Capital Rules.\nGlobal systemically important banks (“G-SIBs”) that are based in the U.S. are subject to an additional CET1 capital requirement known as the “G-SIB Surcharge.” We are not a G-SIB based on the most recent available data and thus we are not subject to a G-SIB Surcharge.\n8\nCapital One Financial Corporation (COF)\nTable of Contents\nStress Capital Buffer Rule\nThe Basel III Capital Rules require banking institutions to maintain a capital conservation buffer, composed of CET1 capital, above the regulatory minimum ratios. Under the Federal Reserve’s final rule to implement the stress capital buffer requirement (“Stress Capital Buffer Rule”), the Company’s “standardized approach capital conservation buffer” includes its stress capital buffer requirement (as described below), any G-SIB Surcharge (which is not applicable to us) and the countercyclical capital buffer requirement (which is currently set at 0%). Any determination to increase the countercyclical capital buffer generally would be effective twelve months after the announcement of such an increase, unless the Federal Reserve, OCC and the FDIC (collectively, “Federal Banking Agencies”) set an earlier effective date.\nThe Company’s stress capital buffer requirement is recalibrated every year based on the Company’s supervisory stress test results, as discussed below. In particular, the Company’s stress capital buffer requirement equals, subject to a floor of 2.5%, the sum of (i) the difference between the Company’s starting CET1 capital ratio and its lowest projected CET1 capital ratio under the severely adverse scenario of the Federal Reserve’s supervisory stress test plus (ii) the ratio of the Company’s projected four quarters of common stock dividends (for the fourth to seventh quarters of the planning horizon) to the projected risk-weighted assets for the quarter in which the Company’s projected CET1 capital ratio reaches its minimum under the supervisory stress test.\nBased on the Company’s 2024 supervisory stress test results, the Company’s stress capital buffer requirement for the period beginning on October 1, 2024 through September 30, 2025 is 5.5%. Therefore, the Company’s minimum capital requirements plus the standardized approach capital conservation buffer for CET1 capital, Tier 1 capital and total capital ratios under the stress capital buffer framework are 10.0%, 11.5% and 13.5%, respectively, for the period from October 1, 2024 through September 30, 2025.\nThe Stress Capital Buffer Rule does not apply to the Bank. Pursuant to the OCC’s capital regulations, which are only applicable to the Bank,  the capital conservation buffer for the Bank continues to be fixed at 2.5%. Therefore, the Bank’s minimum capital requirements plus its capital conservation buffer for CET1 capital, Tier 1 capital and total capital ratios are 7.0%, 8.5% and 10.5%, respectively. See “Part II—Item 7. MD&A—Capital Management” and “Part II—Item 8. Financial Statements and Supplementary Data—Note 12—Regulatory and Capital Adequacy” for additional information. \nIf the Company or the Bank fails to maintain its capital ratios above the minimum capital requirements plus the applicable capital conservation buffers, it will face increasingly strict automatic limitations on capital distributions and discretionary bonus payments to certain executive officers.\nSee also “Capital Planning and Stress Testing” below for more information about the stress capital buffer determination process.\nCECL Transition Rule\nThe Federal Banking Agencies adopted a final rule (“CECL Transition Rule”) that provides banking institutions an optional five-year transition period to phase in the impact of the current expected credit losses (“CECL”) standard on their regulatory capital (“CECL Transition Election”). We adopted the CECL standard (for accounting purposes) as of January 1, 2020, and made the CECL Transition Election (for regulatory capital purposes) in the first quarter of 2020. \nPursuant to the CECL Transition Rule, a banking institution could elect to delay the estimated impact of adopting CECL on its regulatory capital through December 31, 2021 and then phase in the estimated cumulative impact from January 1, 2022 through December 31, 2024. For the “day 2” ongoing impact of CECL during the initial two years, the Federal Banking Agencies used a uniform “scaling factor” of 25% as an approximation of the increase in the allowance under the CECL standard compared to the prior incurred loss methodology. Accordingly, from January 1, 2020 through December 31, 2021, electing banking institutions were permitted to add back to their regulatory capital an amount equal to the sum of the after-tax “day 1” CECL adoption impact and 25% of the increase in the allowance since the adoption of the CECL standard. From January 1, 2022 through December 31, 2024, the after-tax “day 1” CECL adoption impact and the cumulative “day 2” ongoing impact were being phased in to regulatory capital at 25% per year. The following table summarizes the capital impact delay and phase in period on our regulatory capital from years 2020 to 2025.\n9\nCapital One Financial Corporation (COF)\nTable of Contents\nCapital Impact Delayed\nPhase In Period\n2020\n2021\n2022\n2023\n2024\n2025\n“Day 1” CECL adoption impact\nCapital impact delayed to 2022\n25% Phased In\n50% Phased In\n75% Phased In\nFully Phased In\nCumulative “day 2” ongoing impact\n 25% scaling factor as an approximation of the increase in allowance under CECL\nMarket Risk Rule\nThe “Market Risk Rule” supplements the Basel III Capital Rules by requiring institutions subject to the rule to adjust their risk-based capital ratios to reflect the market risk in their trading book. The Market Risk Rule generally applies to institutions with aggregate trading assets and liabilities equal to 10% or more of total assets or $1 billion or more. As of December 31, 2024, the Company and the Bank are subject to the Market Risk Rule. See “Part II一Item 7. MD&A一Market Risk Profile” for additional information.\nBasel III Finalization Proposal \nIn July 2023, the Federal Banking Agencies  released a notice of proposed rulemaking (“Basel III Finalization Proposal”) to revise the Basel III Capital Rules applicable to banking organizations with total assets of $100 billion or more and their subsidiary depository institutions, including the Company and the Bank.\nThe Basel III Finalization Proposal would introduce a new framework for calculating risk-weighted assets (“Expanded Risk-Based Approach”). An institution subject to the proposal would be required to calculate its risk-weighted assets under both the Expanded Risk-Based Approach and the existing Basel III standardized approach and, for each risk-based capital ratio, would be bound by the calculation that produces the lower ratio. All capital buffer requirements, including the stress capital buffer requirement, would apply regardless of whether the Expanded Risk-Based Approach or the existing Basel III standardized approach produces the lower ratio. The proposal would also replace the existing approach for calculating market risk with a new approach based on both internal models and standardized methodologies.\nThe Basel III Finalization Proposal would also make certain changes to the calculation of regulatory capital for Category III and IV institutions. Under the proposal, these institutions would be required to begin recognizing certain elements of AOCI in CET1 capital, including unrealized gains and losses on available for sale securities. The proposal would also generally reduce the threshold above which these institutions must deduct certain assets from their CET1 capital, including certain deferred tax assets, mortgage servicing assets and investments in unconsolidated financial institutions.\nThe Basel III Finalization Proposal includes a proposed effective date of July 1, 2025, subject to a three-year transition period ending July 1, 2028, over which risk-weighted assets calculated under the Expanded Risk-Based Approach and the recognition of AOCI in CET1 capital would be phased in. It is uncertain when or if a final rule will be adopted, and if so, whether and to what extent it will differ from the Basel III Finalization Proposal. As a result, the timing and content of any final rule, and the potential effects of any final rule on the Company and the Bank, remain uncertain.\nFDICIA and Prompt Corrective Action\nThe Federal Deposit Insurance Corporation Improvement Act of 1991 (“FDICIA”) requires the Federal Banking Agencies to take PCA for banks that do not meet minimum capital requirements. FDICIA establishes five capital ratio levels: well capitalized; adequately capitalized; undercapitalized; significantly undercapitalized; and critically undercapitalized. The three undercapitalized categories are based upon the amount by which a bank falls below the ratios applicable to an adequately capitalized institution. The capital categories relate to FDICIA’s PCA provisions and such capital categories may not constitute an accurate representation of the Bank’s overall financial condition or prospects.\nFor an insured depository institution to be well capitalized, it must maintain a total risk-based capital ratio of 10% or more; a Tier 1 capital ratio of 8% or more; a CET1 capital ratio of 6.5% or more; and a leverage ratio of 5% or more. An adequately capitalized depository institution must maintain a total risk-based capital ratio of 8% or more; a Tier 1 capital ratio of 6% or more; a CET1 capital ratio of 4.5% or more; a leverage ratio of 4% or more; and, for Category III and certain other institutions, a supplementary leverage ratio of 3% or more. The PCA provisions also authorize the Federal Banking Agencies to reclassify a \n10\nCapital One Financial Corporation (COF)\nTable of Contents\nbank’s capital category or take other action against banks that are determined to be in an unsafe or unsound condition or to have engaged in unsafe or unsound banking practices.\nCapital Planning and Stress Testing\nUnder the Federal Reserve’s capital plan rule, a covered company, such as the Company, must submit a capital plan to the Federal Reserve on an annual basis that contains a description of all planned capital actions, including dividends or stock repurchases, over a nine-quarter planning horizon beginning with the first quarter of the calendar year the capital plan is submitted. \nPursuant to the capital plan rule, the Company must file its capital plan with the Federal Reserve by April 5 of each year (unless the Federal Reserve designates a later date), using data as of the end of the prior calendar year. The Federal Reserve will release the results of the supervisory stress test and notify the Company of its preliminary stress capital buffer requirement by June 30 of that year, and final stress capital buffer requirement by August 31 of that year. The Company’s final stress capital buffer requirement will be effective from October 1 of the year in which the capital plan is submitted through September 30 of the following year.  As a general matter, the Company may make capital distributions in excess of those included in its capital plan without the prior approval of the Federal Reserve so long as the Company is otherwise in compliance with the capital rule’s automatic limitations on capital distributions. However, as described below, in the event a capital plan resubmission is required, all capital distributions would be subject to the prior approval of the Federal Reserve. \nThe Federal Reserve’s capital plan rule further provides that if a covered company determines there has been or will be a material change in its risk profile, financial condition, or corporate structure since it last submitted its capital plan, it must update and resubmit its capital plan within 30 calendar days, subject to a potential 60-day extension. We determined that our proposed acquisition of Discover constitutes a material change and submitted an updated capital plan as required by the capital plan rule. In addition, the capital plan rule provides that upon the occurrence of an event requiring resubmission, a covered company may not make any capital distribution unless it has received approval of the Federal Reserve. Accordingly, all our capital distributions are now subject to the prior approval of the Federal Reserve pending the Federal Reserve’s consideration of our resubmitted capital plan. We have received prior approval of the Federal Reserve to make certain capital distributions.\nWe are also subject to supervisory and company-run stress testing requirements (also known as the Dodd-Frank Act stress tests (“DFAST”). DFAST is a forward-looking exercise conducted by the Federal Reserve and each covered company to help assess whether a company has sufficient capital to absorb losses and continue operations during adverse economic conditions. In particular, the Federal Reserve is required to conduct annual stress tests on certain covered companies, such as the Company, to ensure that the covered companies have sufficient capital to absorb losses and continue operations during adverse economic conditions, as well as to determine the Company’s stress capital buffer requirement as described above. As a Category III institution, we are also required to conduct company-run stress tests and publish the results of such tests on our website or other public forum on a biennial basis. Under the OCC’s stress test rule, a bank with at least $250 billion in assets, including the Bank, must conduct its own company-run stress tests. The Bank must also disclose the results of its stress test on a biennial basis.\nFunding and Dividends from Subsidiaries\nDividends from the Company’s direct and indirect subsidiaries represent a major source of the funds we use to pay dividends on our capital stock, make payments on our corporate debt securities and meet our other obligations. There are various federal law limitations on the extent to which the Bank can finance or otherwise supply funds to the Company through dividends and loans. These limitations include minimum regulatory capital and capital buffer requirements, federal banking law requirements concerning the payment of dividends out of net profits or surplus, provisions of Sections 23A and 23B of the Federal Reserve Act and Regulation W governing transactions between an insured depository institution and its affiliates, as well as general federal regulatory oversight to prevent unsafe or unsound practices. In general, federal and applicable state banking laws prohibit insured depository institutions, such as the Bank, from making dividend distributions without first obtaining regulatory approval if such distributions are not paid out of available earnings or would cause the institution to fail to meet applicable capital adequacy standards.\nLiquidity Regulation\n11\nCapital One Financial Corporation (COF)\nTable of Contents\nThe Company and the Bank are subject to minimum liquidity standards as adopted by the Federal Reserve and OCC, respectively. For a further discussion of the minimum liquidity standards, see “Part II一Item 7. MD&A一Liquidity Risk Profile.”\nThe Basel Committee has published a liquidity framework that includes two standards for liquidity risk supervision. One standard, the liquidity coverage ratio (“LCR”), seeks to promote short-term resilience by requiring organizations to hold sufficient high-quality liquid assets (“HQLAs”) to survive a stress scenario lasting for 30 days. The other standard, the net stable funding ratio (“NSFR”), seeks to promote longer-term resilience by requiring sufficient stable funding over a one-year period based on the liquidity characteristics of the organization’s assets and activities.\nThe Company and the Bank are subject to the LCR standard as implemented by the Federal Reserve and OCC, respectively (“LCR Rule”). The LCR Rule requires each of the Company and the Bank to hold an amount of eligible HQLA that equals or exceeds 100% of its respective projected adjusted net cash outflows over a 30-day period, each as calculated in accordance with the LCR Rule. The LCR Rule requires each of the Company and the Bank to calculate its respective LCR daily. In addition, the Company is required to make quarterly public disclosures of its LCR and certain related quantitative liquidity metrics, along with a qualitative discussion of its LCR.\nAs a Category III institution with less than $75 billion in weighted average short-term wholesale funding, the Company’s and the Bank’s total net cash outflows are multiplied by an outflow adjustment percentage of 85%. Although the Bank may hold more HQLA than it needs to meet its LCR requirements, the LCR Rule restricts the amount of such excess HQLA held at the Bank (referred to as “Trapped Liquidity”) that can be included in the Company’s HQLA amount. Because we typically manage the Bank’s LCR to levels well above 100%, the result is additional Trapped Liquidity as the Bank’s net cash outflows are reduced by the outflow adjustment percentage of 85%.\nThe Company and the Bank are subject to the NSFR standard as implemented by the Federal Reserve and OCC, respectively (“NSFR Rule”). The NSFR Rule requires each of the Company and the Bank to maintain an amount of available stable funding, which is a weighted measure of a company’s funding sources over a one-year time horizon, calculated by applying standardized weightings to equity and liabilities based on their expected stability, that is no less than a specified percentage of its required stable funding, which is calculated by applying standardized weightings to assets, derivatives exposures and certain other items based on their liquidity characteristics. As a Category III institution, the Company and the Bank are each required to maintain available stable funding in an amount at least equal to 85% of its required stable funding. The Company is required to make public disclosures of its NSFR every second and fourth quarter, including certain quantitative metrics and a qualitative discussion of its NSFR drivers and results.\nIn addition to the LCR and NSFR requirements discussed above, the Company is required to meet liquidity risk management standards, conduct internal liquidity stress tests and maintain a 30-day buffer of highly liquid assets, in each case, consistent with Federal Reserve regulations.\nDeposit Funding and Brokered Deposits\n \nUnder FDICIA, only well capitalized and adequately capitalized institutions may accept “brokered deposits,” as defined by FDIC regulations. Adequately capitalized institutions, however, must obtain a waiver from the FDIC before accepting brokered deposits, and such institutions may not pay rates that significantly exceed the rates paid on deposits of similar maturity obtained from the institution’s normal market area or, for deposits obtained from outside the institution’s normal market area, the national rate on deposits of comparable maturity. See “Part II一Item 7. MD&A一Liquidity Risk Profile” for additional information.\nThe FDIC is authorized to terminate a bank’s deposit insurance upon a finding by the FDIC that the bank’s financial condition is unsafe or unsound or that the institution has engaged in unsafe or unsound practices or has violated any applicable rule, regulation, order or condition enacted or imposed by the bank’s regulatory agency.\nResolution and Recovery Planning Requirements and Related Authorities\nResolution and Recovery Planning\nThe Company is required by Section 165(d) of the Dodd-Frank Act to submit to the Federal Reserve and FDIC every three years a resolution plan for orderly resolution in the event it faces material financial distress or failure, with submissions alternating between a full resolution plan and a targeted resolution plan. Following review of a plan, the Federal Reserve and \n12\nCapital One Financial Corporation (COF)\nTable of Contents\nFDIC may jointly determine that a resolution plan is not credible or would not facilitate an orderly resolution under the U.S. Bankruptcy Code. If the Company were to fail to adequately address deficiencies jointly identified by the Federal Reserve and FDIC in a timely manner, it may be subject to more stringent capital, leverage, or liquidity requirements, or restrictions on growth, activities, or operations. In July 2024, the Federal Reserve and FDIC extended the deadline for the next full resolution submission from March 31, 2025 to October 1, 2025. \nThe Bank, as an insured depository institution, is required by FDIC regulation to submit its own resolution plan to the FDIC. In June 2024, the FDIC issued a final rule amending the resolution plan submission requirements applicable to insured depository institutions with $50 billion or more in total assets, including the Bank. Under the final rule, the Bank is required to submit to the FDIC full resolution plans every three years and interim targeted information between full resolution plan submissions. In addition, under the final rule, the Bank’s resolution plan submissions are subject to more detailed content requirements and a new credibility standard for the FDIC’s evaluation of resolution plans, which is enforceable against the Bank. \nIn addition, the OCC has issued enforceable guidelines requiring banks with assets of $100 billion or more, including the Bank, to develop recovery plans detailing the actions they would take to remain a going concern when they experience considerable financial or non-financial risks but have not deteriorated to the point that resolution is imminent.\nLong-Term Debt and Clean Holding Company Proposal\n \nIn September 2023, the Federal Banking Agencies  proposed a rule that would require banking organizations with $100 billion or more in total assets, including the Company, to comply with certain long-term debt requirements and so called “clean holding company” requirements that are designed to improve the resolvability of covered organizations (“LTD Proposal”). If adopted as proposed, the LTD Proposal would require the Company and the Bank to each maintain a minimum outstanding eligible long-term debt amount of no less than the greatest of (i) 6% of total risk-weighted assets, (ii) 2.5% of total leverage exposure and (iii) 3.5% of average total consolidated assets. To qualify as eligible long-term debt, a debt instrument would be required to meet the requirements currently applicable under the rules that apply to U.S. G-SIBs, as well as certain additional requirements. Additionally, the clean holding company requirements included in the LTD Proposal would limit or prohibit the Company from entering into certain transactions that could impede its orderly resolution.  It is uncertain when or if a final rule will be adopted, and if so, whether and to what extent it will differ from the LTD Proposal. As a result, the timing and content of any final rule, and the potential effects of any final rule on the Company and the Bank, remain uncertain.\nSource of Strength\nThe Federal Reserve’s Regulation Y requires a BHC to serve as a source of financial and managerial strength to its subsidiary banks (this is known as the “source of strength doctrine”). In addition, the Dodd-Frank Act requires a BHC to serve as a source of financial strength to its subsidiary banks and further requires the Federal Banking Agencies to jointly adopt rules implementing this requirement. The Federal Banking Agencies have yet to propose rules as required by the Dodd-Frank Act, but they may do so in the future.\nFDIC Orderly Liquidation Authority\nThe Dodd-Frank Act provides the FDIC with liquidation authority that may be used to liquidate non-bank financial companies and BHCs if the Treasury Secretary, in consultation with the President of the United States and based on the recommendation of the Federal Reserve and other appropriate Federal Banking Agencies, determines that doing so is necessary, among other criteria, to mitigate serious adverse effects on U.S. financial stability. Upon such a determination, the FDIC would be appointed receiver and must liquidate a company in a way that mitigates significant risks to financial stability and minimizes moral hazard. The costs of a liquidation of a company would be borne by shareholders and unsecured creditors and then, if necessary, by risk-based assessments on large financial companies. The FDIC has issued rules implementing certain provisions of its liquidation authority.\nFDIC Deposit Insurance Assessments\nThe Bank, as an insured depository institution, is a member of the Deposit Insurance Fund (“DIF”) maintained by the FDIC. Through the DIF, the FDIC insures the deposits of insured depository institutions up to prescribed limits for each depositor. The FDIC sets a Designated Reserve Ratio (“DRR”) for the DIF. To maintain the DIF, member institutions may be assessed an insurance premium, and the FDIC may take action to increase insurance premiums if the DRR falls below its required level.\n13\nCapital One Financial Corporation (COF)\nTable of Contents\nThe FDIC, as required under the Federal Deposit Insurance Act, established a plan in September 2020, to restore the DIF reserve ratio to meet or exceed 1.35 percent within eight years. On October 18, 2022, the FDIC finalized a rule that increases the initial base deposit insurance assessment rate schedules by 2 basis points (“bps”) for all insured depository institutions to improve the likelihood that the DIF reserve ratio reaches 1.35 percent by the statutory deadline of September 30, 2028. The rule took effect in January 2023 and this increase was reflected in the Bank’s first quarterly assessment in 2023.\nIn November 2023, the FDIC finalized a rule to implement a special assessment to recover the loss to the DIF arising from the protection of uninsured depositors in connection with the systemic risk determination announced in March 2023, following the closures of Silicon Valley Bank and Signature Bank. In December 2023, the FDIC provided notification that it would be collecting the special assessment at an annual rate of approximately 13.4 bps over eight quarterly collection periods, beginning with the first quarter of 2024 with the first payment due on June 28, 2024. In June 2024, the FDIC provided notification that the collection period will be extended an additional two quarters beyond the initial eight quarterly collection periods, at a lower annual rate. The special assessment base is equal to an insured depository institution’s estimated uninsured deposits reported on its Consolidated Reports of Condition and Income as of December 31, 2022 (“2022 Call Report”), adjusted to exclude the first $5 billion of uninsured deposits. For additional information, see “Part II—Item 8.\n \nFinancial Statements and Supplementary Data—Note 19—Commitments, Contingencies, Guarantees and Others.”\nInvestment in the Company and the Bank\nCertain acquisitions of our capital stock may be subject to regulatory approval or notice under federal or state law. Investors are responsible for ensuring that they do not, directly or indirectly, acquire shares of our capital stock in excess of the amount that can be acquired without regulatory approval, including under the BHC Act and the Change in Bank Control Act (“CIBC Act”).\nFederal law and regulations prohibit any person or company from acquiring control of the Company or the Bank without, in most cases, prior written approval of the Federal Reserve or the OCC, as applicable. Control under the BHC Act exists if, among other things, a person or company acquires more than 25% of any class of our voting stock or otherwise has a controlling influence over us. A rebuttable presumption of control arises under the CIBC Act for a publicly traded BHC such as ourselves if a person or company acquires more than 10% of any class of our voting stock.\nAdditionally, the Bank is a “bank” within the meaning of Chapter 7 of Title 6.2 of the Code of Virginia governing the acquisition of interests in Virginia financial institutions (“Virginia Financial Institution Holding Company Act”). The Virginia Financial Institution Holding Company Act prohibits any person or entity from acquiring, or making any public offer to acquire, control of a Virginia financial institution or its holding company without making application to, and receiving prior approval from, the Virginia Bureau of Financial Institutions.\nTransactions with Affiliates\nThere are various legal restrictions on the extent to which we and our non-bank subsidiaries may borrow or otherwise engage in certain types of transactions with the Bank. Under the Federal Reserve Act and Federal Reserve regulations, the Bank and its subsidiaries are subject to quantitative and qualitative limits on extensions of credit, purchases of assets and certain other transactions involving non-bank affiliates. In addition, transactions between the Bank and its non-bank affiliates are required to be on arm’s length terms and must be consistent with standards of safety and soundness.\nVolcker Rule\nWe and each of our subsidiaries, including the Bank, are subject to the “Volcker Rule,” a provision of the Dodd-Frank Act that contains prohibitions on proprietary trading and certain investments in, and relationships with, covered funds (hedge funds, private equity funds and similar funds), subject to certain exemptions, in each case as the applicable terms are defined in the Volcker Rule and the implementing regulations.\nRegulation of Business Activities\nThe business activities of the Company and the Bank, as well as certain of the Company’s non-bank subsidiaries, are subject to regulation and supervision under various other laws and regulations.\n14\nCapital One Financial Corporation (COF)\nTable of Contents\nRegulation of Consumer Lending Activities\nThe activities of the Bank as a consumer lender are subject to regulation under various federal laws, including, for example, the Truth in Lending Act (“TILA”), the Equal Credit Opportunity Act, the Fair Credit Reporting Act (“FCRA”), the CRA, the Servicemembers Civil Relief Act and the Military Lending Act, as well as under various state laws. TILA, as amended, and together with its implementing rule, Regulation Z, imposes a number of restrictions on credit card practices impacting rates and fees, requires that a consumer’s ability to pay be taken into account before issuing credit or increasing credit limits, and imposes revised disclosures required for open-end credit.\nIn March 2024, the CFPB issued a final rule amending Regulation Z that, if it goes into effect as currently issued, would significantly lower the safe harbor amount for past due fees that large credit card issuers, including the Bank, can charge on consumer credit card accounts. The final rule is currently stayed as a result of ongoing litigation. Moreover, in October 2024, the CFPB issued a final rule that will require certain financial institutions, including the Company, to, among other things, share certain data on certain consumer financial products and services upon request of the consumer. For more information on risks related to these rules, see the risk factors set forth under “Item 1A. Risk Factors.” \nDepending on the underlying issue and applicable law, regulators may be authorized to impose penalties for violations of these statutes and, in certain cases, to order banks to compensate customers. Borrowers may also have a private right of action for certain violations. Federal bankruptcy and state debtor relief and collection laws may also affect the ability of a bank, including the Bank, to collect outstanding balances owed by borrowers.\nDebit Card Interchange Fees and Transaction Processing\nAs an issuer of credit and debit cards, the Bank earns interchange fees, which are paid by merchants, when customers use its cards. The Bank is subject to the Federal Reserve’s Regulation II, which limits the amount of interchange fees that can be charged per debit card transaction for debit card issuers with over $10 billion in assets and places certain prohibitions on payment routing restrictions and network exclusivity. The Federal Reserve has proposed, but not yet finalized, amendments to Regulation II that would lower the cap on debit interchange fees and institute a process for automatically recalculating the debit interchange fee cap every two years based upon a biennial survey of large debit card issuers.\nPrivacy, Data Protection and Data Security\nWe are, or may become, subject to a variety of continuously evolving and developing laws and regulations in the United States at the federal, state and local level regarding privacy, data protection and data security, including those related to the collection, storage, handling, use, disclosure, transfer, security and other processing of personal information. For example, at the federal level, we are currently subject to the Gramm-Leach-Bliley Act (“GLBA”) and the FCRA, among other laws and regulations, and may become subject to additional privacy, data protection and data security requirements as a result of future laws, rules or regulations. This includes, for instance, the Cyber Incident Reporting for Critical Infrastructure Act (“CIRCIA”), which, once rulemaking is complete, will require, among other things, certain companies to report significant cyber incidents to the Department of Homeland Security’s Cybersecurity and Infrastructure Security Agency (“CISA”) within 72 hours from the time the company reasonably believes the incident occurred (and within 24 hours of making a ransom payment as a result of a ransomware attack). Moreover, legislative updates have been proposed in the U.S. Congress for more comprehensive privacy, data protection and data security legislation, to which we may be subject if passed. At the state level, California has enacted the California Consumer Privacy Act (as amended by the  California Privacy Rights Act, collectively, the “CCPA”) and continues to issue regulations thereunder, and various other states also have enacted or are in the process of enacting state-level privacy, data protection and/or data security laws and regulations, with which we may be required to comply. Additionally, the Federal Banking Agencies, as well as related self‐regulatory organizations, have issued guidance regarding cybersecurity that is intended to enhance cyber risk management among financial institutions.\nFor more information on privacy, data protection and data security laws and regulations at the international level, please see “Regulation by Authorities Outside the United States.”\nFor further discussion of privacy, data protection and data security, and related risks for our business, see “Item 1A. Risk Factors” under the headings “\nWe face risks related to our operational, technological and organizational infrastructure\n,” “\nA cyber-attack or other security incident on us or third parties (including their supply chains) with which we conduct business, including an incident that results in the theft, loss, manipulation or misuse of information (including personal information), or the disabling of systems and access to information critical to business operations, may result in increased costs, reductions in \n15\nCapital One Financial Corporation (COF)\nTable of Contents\nrevenue, reputational damage, legal exposure and business disruptions,\n” and “\nOur required compliance with applicable laws and regulations related to privacy, data protection and data security, in addition to compliance with our own privacy policies and contractual obligations to third parties, may increase our costs, reduce our revenue, increase our legal exposure and limit our ability to pursue business opportunities.\n”\nFor further discussion of our cybersecurity risk management, see “Item 1C. Cybersecurity.”\nAnti-Money Laundering, Combating the Financing of Terrorism and Economic Sanctions\nThe Bank Secrecy Act (“BSA”), as amended by the USA PATRIOT Act of 2001 (“Patriot Act”), and its implementing regulations require financial institutions to, among other things, implement a risk-based compliance program reasonably designed to prevent money laundering and to combat the financing of terrorism, including through suspicious activity and currency transaction reporting, the implementation of policies, procedures, and internal controls, record-keeping and customer due diligence.\nThe Patriot Act provides enhanced information collection tools and enforcement mechanisms to the U.S. government and expanded certain requirements for financial institutions, including due diligence and record-keeping requirements for private banking and correspondent accounts; standards for verifying customer identification at account opening; rules to produce certain records upon request of a regulator or law enforcement agency; and rules to promote cooperation among financial institutions, regulators and law enforcement agencies in identifying parties that may be involved in terrorism, money laundering and other crimes.\nThe Anti-Money Laundering Act of 2020 (“AML Act”), enacted as part of the National Defense Authorization Act, requires the U.S. Treasury Department’s Financial Crimes Enforcement Network (“FinCEN”) to issue a number of rules that will update and expand the BSA’s regulatory requirements. For example, the AML Act requires FinCEN to issue National Anti-Money Laundering and Countering the Financing of Terrorism Priorities (the “National Priorities”), which the agency did in June 2021, and to conduct studies and issue regulations that may alter some of the due diligence, record-keeping and reporting requirements that the BSA and Patriot Act impose on banks. FinCEN has yet to issue a final rule that establishes the compliance obligations of financial institutions with respect to the National Priorities, and several other mandatory rule makings under the AML Act remain outstanding. The AML Act also promotes increased information-sharing and use of technology and increases penalties for violations of the BSA and includes whistleblower incentives, both of which could increase the prospect of regulatory enforcement.\nWe are also required to comply with sanctions laws and regulations administered and imposed by the United States government, including the U.S. Treasury Department's Office of Foreign Assets Control (“OFAC”) and the Department of State, as well as comparable sanctions programs imposed by foreign governments and multilateral bodies. Sanctions can be either comprehensive or selective and use the blocking of assets and trade restrictions to accomplish foreign policy and national security goals.\nDerivatives Activities\nTitle VII of the Dodd-Frank Act establishes a regulatory framework for the governance of the over-the-counter (“OTC”) derivatives market, including swaps and security-based swaps and requires the registration of certain market participants as swap dealers or security-based swap dealers. The Bank is registered with the Commodity Futures Trading Commission (“CFTC”) as a swap dealer. Registration as a swap dealer subjects the Bank to additional regulatory requirements with respect to its swaps and other derivatives activities. As a result of the Bank’s swap dealer registration, it is subject to the rules of the OCC concerning capital and margin requirements for swap dealers, including the mandatory exchange of variation margin and initial margin with certain counterparties. Additionally, as a registered swap dealer, the Bank is subject to requirements under the CFTC’s regulatory regime, including rules regarding business conduct standards, recordkeeping obligations, regulatory reporting and procedures relating to swaps trading. The Bank’s swaps and other derivatives activities do not require it to register with the SEC as a security-based swap dealer.\nBroker-Dealer Activities\nCertain of our non-bank subsidiaries are subject to regulation and supervision by various federal and state authorities. Capital One Securities, Inc., KippsDeSanto & Company and TripleTree, LLC are registered broker-dealers regulated by the SEC and the Financial Industry Regulatory Authority (“FINRA”). These broker-dealer subsidiaries are subject to, among other things, net capital rules designed to measure the general financial condition and liquidity of a broker-dealer. Under these rules, broker-\n16\nCapital One Financial Corporation (COF)\nTable of Contents\ndealers are required to maintain the minimum net capital deemed necessary to meet their continuing commitments to customers and others, and to keep a substantial portion of their assets in relatively liquid form. These rules also limit the ability of a broker-dealer to transfer capital to its parent companies and other affiliates. Broker-dealers are also subject to regulations covering their business operations, including sales and trading practices, public and private offerings, publication of research reports, use and safekeeping of client funds and securities, capital structure, record-keeping and the conduct of directors, officers and employees.\nClimate-related Developments\nClimate change and the risks it may pose to financial institutions is an area of increased focus by the federal and state legislative bodies and regulators, including the Federal Banking Agencies. In the future, new regulations or guidance may be issued, or other regulatory or supervisory actions may be taken, in this area by the Federal Banking Agencies or other regulatory agencies, or new statutory requirements may be adopted. For example, the Federal Banking Agencies have issued principles for climate-related financial risk management, which are designed to support the identification and management of climate-related financial risks at regulated institutions with more than $100 billion in total consolidated assets. For more information, please see “Item 1A. Risk Factors” under the heading “\nClimate change manifesting as physical or transition risks could adversely affect our businesses, operations and customers and result in increased costs.\n”\nRegulation by Authorities Outside the United States\nThe Bank is subject to laws and regulations in foreign jurisdictions where it operates, primarily in the U.K. and Canada. In the U.K., the Bank operates through COEP, an authorized payment institution regulated by the Financial Conduct Authority (“FCA”). COEP’s parent, Capital One Global Corporation, is wholly owned by the Bank and is subject to regulation by the Federal Reserve as an “agreement corporation” under the Federal Reserve’s Regulation K. COEP does not take deposits. In Canada, the Bank operates as an authorized foreign bank and is permitted to conduct its credit card business in Canada through its Canadian branch, Capital One Bank (Canada Branch) (“Capital One Canada”). Capital One Canada does not take deposits. The primary regulators of Capital One Canada are the Office of the Superintendent of Financial Institutions (“OSFI”) and the Financial Consumer Agency of Canada (“FCAC”).\nThe foreign legal and regulatory requirements to which the Company’s non-U.S. operation are subject include, among others, those related to consumer protection, business practices and limits on interchange fees. For more information on foreign regulatory activity concerning interchange fees, please see “Item 1A. Risk Factors” under the heading “\nOur business, financial condition and results of operations may be adversely affected by legislation, regulation and merchants’ efforts to reduce the interchange fees charged by credit and debit card networks to facilitate card transactions.\n”\nWe also are, or may become, subject to continuously evolving and developing laws and regulations in other jurisdictions regarding privacy, data protection and data security. For example, in Canada we are subject to the Personal Information Protection and Electronic Documents Act (“PIPEDA”) as well as the provincial privacy laws, and may become subject to additional privacy, data protection and data security laws and regulations in Canada, including those which may differ from PIPEDA and the provincial privacy laws, if passed. We also are subject to the U.K. General Data Protection Regulation (“U.K. GDPR”). In addition, subject to limited exceptions, the European Union (“EU”) General Data Protection Regulation (“EU GDPR”) applies EU data protection laws to certain companies processing personal data of individuals in the European Economic Area, regardless of the company’s location. These laws and regulations, and similar laws and regulations in other jurisdictions, impose strict requirements regarding the collection, storage, handling, use, disclosure, transfer, security and other processing of personal information, which may have adverse consequences, including significant compliance costs and severe monetary penalties for non-compliance. Significant uncertainty exists as privacy, data protection, and data security laws and regulations may be interpreted and applied differently from country to country and may create inconsistent or conflicting requirements. For more information on privacy, data protection and data security requirements, please see “Privacy, Data Protection and Data Security.”\n \n17\nCapital One Financial Corporation (COF)\nTable of Contents\nHUMAN CAPITAL RESOURCES\nOur human capital practices are designed to develop a collaborative work environment while rewarding employees based on the merit of their work. We prioritize employee recruitment, development, recognition and retention. As of December 31, 2024, Capital One had approximately 52,600 employees worldwide, whom we refer to as “associates.” The following disclosures provide information on our human capital resources, including certain human capital objectives and measures that we focus on in managing our business.\nGovernance of Human Capital \nOur Board of Directors oversees our human capital management, including strategies, policies and practices, and diversity, inclusion and belonging (“DIB”), and is assisted by our Board’s Compensation Committee and Governance and Nominating Committee. Our Executive Committee, a committee of senior management which includes our Chief Human Resources Officer, advises, assists and makes recommendations to our Chief Executive Officer and Board of Directors on human capital matters such as human resource practices and programs, including general employee benefits and compensation programs.\nHiring, Developing, and Retaining\nWe employ a comprehensive people strategy that includes significant investments in recruiting and associate development in order to attract and retain top talent from all backgrounds. We recruit through a variety of channels, including professional partnerships, job fairs, online platforms, on-campus recruiting and diversity-related recruiting events and initiatives, among others. Investment in associate training and professional development is important to maintaining our talent competitiveness. Our internal enterprise learning and development team blends multiple approaches to learning to support associate development across lines of business, levels, and roles, including online and live classroom training. In addition to formal programming provided by learning professionals, including regulatory compliance, role-specific topics and others, our peer-to-peer learning strategy allows associates to be both learners and teachers, further enhancing a culture of learning. We also focus on cultivating talent with leadership development courses, cohort-based programs, network building and coaching.\nOn a quarterly basis, we review our ability to attract and retain talent. Each line of business and staff group reviews hiring, tenure and attrition metrics as part of this assessment, and they implement mitigation plans when needed.\nAt Capital One, we also value the diversity of our talent, and our employee programs are intended to support a culture of belonging. Our DIB strategy is developed and executed in close collaboration with leaders and teams across the organization. These efforts are overseen by the Chief Diversity & Inclusion Officer, and members of the Executive Committee sponsor Capital One’s Business Resource Groups, associate-led organizations that are open to everyone and enrich our culture of belonging and deepen our understanding of diversity across our associates.\nOur corporate website contains additional information regarding employee programs and workforce composition, such as that reported to the U.S. Equal Employment Opportunity Commission on the mandatory EEO-1 report.\nCompensation and Wellness\nWe appreciate the importance of a competitive total compensation package to attract and retain great talent. Our benefits, including competitive parental leave, on-site health centers, company contributions to associates’ 401(k) plans, educational assistance and other health, wellness, and financial benefits are designed to support our associates’ wellbeing inside and outside of the workplace. Furthermore, pay equity is an important element of our pay philosophy. We evaluate base pay and incentive pay for all of our associates globally, at least annually. We review groups of associates in similar roles, adjusting for factors that appropriately explain differences in pay such as job location and experience.\nCommunication and Connection\nWe communicate with our associates regularly to better understand their perspectives. To assess and improve associate retention and engagement, the Company surveys associates on a periodic basis with the assistance of third-party consultants and takes actions to address various areas of associate concern. We encourage full participation and use the results to effect change and promote transparency.\nTECHNOLOGY AND INTELLECTUAL PROPERTY\n18\nCapital One Financial Corporation (COF)\nTable of Contents\nTechnology/Systems\nWe leverage information and technology to achieve our business objectives and to develop and deliver products and services that satisfy our customers’ needs. A key part of our strategic focus is the development and use of efficient, flexible computer and operational systems, such as cloud technology, to support complex marketing and account management strategies, the servicing of our customers, and the development of new and diversified products. We believe that the continued development and integration of these systems is an important part of our efforts to reduce costs, improve quality and security and provide faster, more flexible technology services. Consequently, we frequently consider our capabilities and develop or acquire systems, processes and competencies to meet our unique business requirements.\nAs part of our frequent consideration of our technologies, we may either develop such capabilities internally or rely on third-party service providers who have the ability to deliver technology that is of higher quality, lower cost, or both. We continue to rely on third-party service providers to help us deliver systems and operational infrastructure. These relationships include, but are not limited to: Amazon Web Services, Inc. (“AWS”) for our cloud infrastructure, Total System Services LLC (“TSYS”) for consumer and commercial credit card processing services for our North American and U.K. portfolios and Fidelity Information Services (“FIS”) for certain of our banking systems.\nWe are committed to implementing safeguards designed to protect our customers’ information, as well as our own information and technology. For additional information on our risks associated with cybersecurity and our use of technology systems and our management of these risks, please see “Item 1A. Risk Factors” under the headings “\nA cyber-attack or other security incident on us or third parties (including their supply chains) with which we conduct business, including an incident that results in the theft, loss, manipulation or misuse of information (including personal information), or the disabling of systems and access to information critical to business operations, may result in increased costs, reductions in revenue, reputational damage, legal exposure and business disruptions” \nand\n \n“\nWe face risks related to our operational, technological and organizational infrastructure” \nand “Item 1C. Cybersecurity.”\nIntellectual Property and Other Proprietary Information\nAs part of our overall and ongoing strategy to protect and enhance our intellectual property rights, we rely on a variety of protections, including copyrights, trademarks, trade secrets, patents and certain restrictions on disclosure, solicitation and competition. We also undertake other measures to control access to, or distribution of, our other proprietary and confidential information. Any patents we may obtain may increase our competitive advantage, protect our investments in commercializing our technology, preserve our freedom to operate, and allow us to enter into licensing (e.g., cross-licenses) or other arrangements with third parties. For a discussion of risks associated with intellectual property, see “Item 1A. Risk Factors” under the heading “\nIf we are not able to protect our intellectual property rights, or we violate third-party intellectual property rights, our revenue and profitability could be negatively affected.”\n19\nCapital One Financial Corporation (COF)\nTable of Contents\nFORWARD-LOOKING STATEMENTS\nFrom time to time, we have made and will make forward-looking statements, including those that discuss, among other things: strategies, goals, outlook or other non-historical matters; projections, revenues, income, returns, expenses, assets, liabilities, capital and liquidity measures, capital allocation plans, accruals for claims in litigation and for other claims against us; earnings per share, efficiency ratio, operating efficiency ratio or other financial measures for us; future financial and operating results; our plans, objectives, expectations and intentions; and the assumptions that underlie these matters.\nTo the extent that any such information is forward-looking, it is intended to fit within the safe harbor for forward-looking information provided by the Private Securities Litigation Reform Act of 1995.\nForward-looking statements often use words such as “will,” “anticipate,” “target,” “expect,” “think,” “estimate,” “intend,” “plan,” “goal,” “believe,” “forecast,” “outlook” or other words of similar meaning. Any forward-looking statements made by us or on our behalf speak only as of the date they are made or as of the date indicated, and we do not undertake any obligation to update forward-looking statements as a result of new information, future events or otherwise. For additional information on factors that could materially influence forward-looking statements included in this Report, see the risk factors set forth under “Item 1A. Risk Factors.” You should carefully consider the factors discussed below, and in our Risk Factors or other disclosures, in evaluating these forward-looking statements.\nNumerous factors could cause our actual results to differ materially from those described in such forward-looking statements, including, among other things:\n•\nrisks relating to the pending Transaction, including the risk that the cost savings and any revenue synergies and other anticipated benefits from the Transaction may not be fully realized or may take longer than anticipated to be realized; disruption to our business and to Discover’s business as a result of the announcement and pendency of the Transaction; the risk that the integration of Discover’s business and operations into ours, including into our compliance management program, will be materially delayed or will be more costly or difficult than expected, or that we are otherwise unable to successfully integrate Discover’s business into ours, including as a result of unexpected factors or events; the possibility that the requisite regulatory approvals are not received or other conditions to the closing are not satisfied on a timely basis or at all, or are obtained subject to conditions that are not anticipated (and the risk that requisite regulatory approvals may result in the imposition of conditions that could adversely affect us or the expected benefits of the Transaction following the closing of the Transaction); reputational risk and the reaction of customers, suppliers, employees or other business partners of ours or of Discover to the Transaction; the failure of the closing conditions in the Merger Agreement to be satisfied, or any unexpected delay in completing the Transaction or the occurrence of any event, change or other circumstances that could give rise to the termination of the Merger Agreement; the dilution caused by our issuance of additional shares of our common stock in connection with the Transaction; the possibility that the Transaction may be more expensive to complete than anticipated, including as a result of unexpected factors or events; risks related to management and oversight of our expanded business and operations following the Transaction due to the increased size and complexity of our business; the possibility of increased scrutiny by, and/or additional regulatory requirements of, governmental authorities as a result of the Transaction or the size, scope and complexity of our business operations following the Transaction; the outcome of any legal or regulatory proceedings that may be currently pending or later instituted against us (before or after the Transaction) or against Discover; the risk that expectations regarding the timing, completion and accounting and tax treatments of the Transaction are not met; the risk that any announcements relating to the Transaction could have adverse effects on the market price of our common stock; certain restrictions during the pendency of the Transaction; the diversion of management’s attention from ongoing business operations and opportunities; the risk that revenues following the Transaction may be lower than expected and/or the risk that certain expenses, such as the provision for credit losses, of Discover or the surviving entity may be greater than expected; our and Discover’s success in executing their respective business plans and strategies and managing the risks involved in the foregoing; effects of the announcement, pendency or completion of the Transaction on our or Discover’s ability to retain customers and retain and hire key personnel and maintain relationships with our and Discover’s suppliers and other business partners, and on our and Discover’s operating results and businesses generally; and other factors that may affect our future results or the future results of Discover;\n20\nCapital One Financial Corporation (COF)\nTable of Contents\n•\nchanges and instability in the macroeconomic environment, resulting from factors that include, but are not limited to monetary and fiscal policy actions, geopolitical conflicts or instability, such as the war between Ukraine and Russia and the conflict in the Middle East, labor shortages, government shutdowns, inflation and deflation, potential recessions, technology-driven disruption of certain industries, lower demand for credit, changes in deposit practices and payment patterns;\n•\nincreases  in credit losses and delinquencies and the impact of incorrectly estimated expected losses, which could result in inadequate reserves;\n•\ncompliance with new and existing domestic and foreign laws, regulations and regulatory expectations, which may change over time including as a result of the political and policy goals of elected officials;\n•\nlimitations on our ability to receive dividends from our subsidiaries;\n•\nour ability to maintain adequate capital or liquidity levels or to comply with revised capital or liquidity requirements, which could have a negative impact on our financial results and our ability to return capital to our stockholders;\n•\nthe use, reliability, and accuracy of the models, artificial intelligence, and data on which we rely;\n•\nour ability to manage fraudulent activity risks;\n•\nincreased costs, reductions in revenue, reputational damage, legal exposure and business disruptions that can result from a cyber-attack or other security incident on us or third parties (including their supply chains) with which we conduct business, including an incident that results in the theft, loss, manipulation or misuse of information, or the disabling of systems and access to information critical to business operations;\n•\ndevelopments, changes or actions relating to any litigation, governmental investigation or regulatory enforcement action or matter involving us;\n•\nthe amount and rate of deposit growth and changes in deposit costs;\n•\nour ability to execute on our strategic initiatives and operational plans;\n•\nour response to competitive pressures;\n•\nlegislation, regulation and merchants’ efforts to reduce the interchange fees charged by credit and debit card networks to facilitate card transactions, and by legislation and regulation impacting such fees;\n•\nour success in integrating acquired businesses and loan portfolios, and our ability to realize anticipated benefits from announced transactions and strategic partnerships;\n•\nour ability to develop, operate, and adapt our operational, technology and organizational infrastructure suitable for the nature of our business;\n•\nthe success of our marketing efforts in attracting and retaining customers;\n•\nour risk management strategies;\n•\nchanges in the reputation of, or expectations regarding, us or the financial services industry with respect to practices, products, services or financial condition;\n•\nfluctuations in interest rates;\n•\nour ability to maintain adequate sources of funding and liquidity to operate our business; \n•\nour ability to attract, develop, retain and motivate key senior leaders and skilled employees;\n•\nclimate change manifesting as physical or transition risks;\n•\nour assumptions or estimates in our financial statements;\n21\nCapital One Financial Corporation (COF)\nTable of Contents\n•\nthe soundness of other financial institutions and other third parties, actual or perceived; \n•\nour ability to invest successfully in and introduce digital and other technological developments across all our businesses; \n•\na downgrade in our credit ratings;\n•\nour ability to manage risks from catastrophic events;\n•\ncompliance with applicable laws and regulations related to privacy, data protection and data security, in addition to compliance with our own privacy policies and contractual obligations to third parties;\n•\nour ability to protect our intellectual property rights; and \n•\nother risk factors identified from time to time in our public disclosures, including in the reports that we file with the SEC.",
  "item7": "Item 7.\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations (“MD&A”)\n52\nSelected Financial Data\n53\nExecutive Summary\n \n56\nConsolidated Results of Operations\n57\nConsolidated Balance Sheets Analysis\n63\nOff-Balance Sheet Arrangements\n67\nBusiness Segment Financial Performance\n68\nCritical Accounting Policies and Estimates\n78\nAccounting Changes and Developments\n82\nCapital Management\n83\nRisk Management\n88\nCredit Risk Profile\n94\nLiquidity Risk Profile\n108\nMarket Risk Profile\n113\nSupplemental Table\ns\n117\nGlossary and Acronyms\n \n119",
  "item2": null
}