{
  "source_file": "coin-20241231.htm",
  "form_type": "10-K",
  "item1": "ITEM 1.\n \nBUSINESS \nCoinbase Overview\nOur mission is to increase ec\nonomic freedom in the world.\nWe are working to update the century-old financial system by providing a trusted platform that makes it easy for our customers to engage with crypto assets. We also provide critical infrastructure for the onchain economy and support builders who share our vision of bringing the world onchain. Onchain activities are interactions with the blockchain that take place in a broad category of blockchain-powered technologies, including self-custody wallets, decentralized apps and services, and open community engagement platforms. Together with the crypto community, we advocate for responsible rules to make the benefits of crypto available around the world.\nWe differentiate ourselves from our competition with:\n•\nTrust\n:\n \nWe are deeply invested in building the most secure and compliant platform. We hold customer assets one-to-one at all times. We do not act on customer assets, including staking, lending, rehypothecating, or engaging in fractional reserve banking, without customer consent. \n•\nEase of use\n:\n We strive to build products that are easy to use and that our customers love. We obsess over quality and craft in our products. We strive to make buying, storing, and using crypto easy.\nOur Business\nWe offer products and services to three customer groups:\n•\nConsumers\n:\n Retail customers seeking to invest in or trade crypto assets and engage onchain. \n•\nInstitutions\n:\n Businesses that include market makers, asset managers, hedge funds, banks, wealth platforms, registered investment advisors, payment platforms, and public and private corporations. \n•\nDevelopers\n:\n Entrepreneurs, creators, merchants, crypto asset issuers, organizations and financial institutions, and other groups building decentralized protocols, applications, products, or other services onchain. \nOur platform serves as a trusted and compliant on-ramp to the onchain economy and enables our users to engage in a wide variety of activities with their crypto assets in both our own proprietary and third-party product experiences enabled by access to decentralized applications. Our business consists of \n7\nTable of Contents\nproducts that we monetize through transaction fees, such as our consumer trading product suite, as well as subscription products and services, such as our stablecoin products. We describe these products below. Throughout this Annual Report on Form 10-K, we will refer to our full suite of products and offerings as our platform or platforms.\nTransaction products\nConsumer trading\nOur platform is designed to serve a wide variety of consumers, whether they are buying their first crypto asset or are advanced traders. We offer two trading experiences: \n•\nSimple trade\n: Our simple trading experience offers customers the ability to buy, sell, and convert crypto assets using the basic interface of our platform, and includes value-added services such as fixed price quotes and recurring trades. Simple trading focuses on consumers of all experience levels who are prioritizing  ease of use.\n•\nAdvanced trade\n: Our advanced trading experience offers traders access to spot and derivatives order books, real-time market information through interactive charts, a live trade history on the advanced trade view, and other trading tools. Advanced trading focuses on sophisticated traders who are prioritizing a robust set of features to meet their more complex needs and higher volume.\nWe generate fees from consumers trading on our platform, including through volume-based transaction fees and a spread depending on the type of trade. Simple trading and advanced trading fees differ due to both the typical nature of the transactions and unique benefits of each offering. Generally, simple trading fees are higher than those on advanced trading because advanced traders typically trade at higher volumes than simple traders. \nPrime Trading\nCoinbase Prime is our full-service prime brokerage platform, where our institutional customers can access deep pools of liquidity across a network of trading venues. We offer volume-based pricing and charge a transaction fee for executed trades. \nMarkets\nWe provide market infrastructure in the form of trading venues for customers to trade spot and derivatives. We currently provide access to three trading venues: the Coinbase Exchange, the Coinbase International Exchange, and the Coinbase Derivatives Exchange. These markets generate revenue by charging a transaction fee for executed trades. \nBase Protocol\nBase is an L2 Ethereum blockchain offering fast, cheap, global onchain transactions. In 2024, Base reduced median transaction fees by more than 90% to enable sub-one cent median transactions. Base’s goal is to bring one million developers and one billion users onchain to build a global economy. Base aspires to be the best place to build applications, create content, and earn money onchain. Coinbase generates revenue from sequencer fees paid each time a transaction is processed on the Base blockchain.\nCoinbase Wallet \nCoinbase Wallet is a self-custodial wallet software product, which we offer globally. Coinbase Wallet enables users to engage and transact with the full universe of Dapps and actively engage in the onchain economy without the need for a centralized intermediary. Customers can also link their Coinbase account to their Coinbase Wallet to more easily transfer assets between the two. In 2024, Coinbase launched “smart wallet,” which is an improved self-custody technology that enables instant onboarding with no separate app or extension, and no need to memorize a seed phrase. Coinbase Wallet now includes smart \n8\nTable of Contents\nwallet compatibility. A benefit of Coinbase Wallet is that consumers have sole control over their private keys and/or seed phrase, which are stored directly on their mobile devices or personal storage accounts and not with a centralized entity. Because the private key is unilaterally controlled by the user, Coinbase is unable to assist in recovery in the event a user loses their key or seed phrase. \nSubscription products and other services\nStablecoins\nStablecoins play a key role in updating the financial system and advancing economic freedom by combining the benefits of crypto rails, which are global, cheap, and fast, with an asset that is stable relative to fiat currencies. We offer a variety of stablecoins denominated in multiple fiat currencies on our platform, and we continue to explore partnerships with a number of stablecoin issuers to expand our offerings. \nIn 2018, we partnered with Circle Internet Financial, LLC (“Circle”) to launch USDC, with the goal of driving global, mainstream adoption of stablecoins. Circle and its affiliate, Circle Internet Financial Europe SAS, are the issuers of USDC, a stablecoin redeemable on a one-to-one basis for U.S. dollars, and Circle Internet Financial Europe SAS is the issuer of EURC, a stablecoin redeemable on a one-to-one basis for Euros. In August 2023, we entered into an updated arrangement with Circle to (i) support USDC; (ii) help drive long-term success of the stablecoin ecosystem; and (iii) share in the economics of the reserves backing stablecoins in circulation both on and off our platform (the “Circle Agreement”). Pursuant to the Circle Agreement, Circle pays us for our role in the growth of USDC: the greater the proportion of USDC in circulation generally and on our platform, the greater our revenue generated under the Circle Agreement. The Circle Agreement has an initial three-year term. Upon completion of the initial term, we and Circle will discuss in good faith whether any modifications to the Circle Agreement are warranted. If such modifications are not agreed upon, the Circle Agreement will automatically renew for additional three-year terms unless we or Circle fail to meet ongoing obligations under the Circle Agreement. \nWe and Circle may, from time to time, enter into arrangements with third parties approved by both us and Circle (such third parties, “approved participants”) that provide for fees to be paid to such approved participants to increase the circulation of stablecoins subject to the Circle Agreement. In anticipation of such arrangements, in November 2024, we and Circle entered into a supplement to the Circle Agreement, pursuant to which we and Circle will agree upon the fees that such third parties are eligible to receive and the undertakings to be required of them upon becoming an approved participant. We have filed a copy of the Circle Agreement and its 2024 supplement as exhibits to this Annual Report on Form 10-K in order to provide investors with additional information about this partnership.\nHistorically, we have observed that customers holding USDC on our platform are more likely to use other products such as trading. Therefore, where permitted, we pay rewards to both consumer and institutional customers who hold USDC to incentivize on-platform balances and deeper engagement with our product suite. In 2024, we began paying rewards onchain to customers holding USDC balances in Coinbase Wallet. \nStaking   \nStaking is one of our most popular services. Certain blockchain protocols, such as Ethereum and Solana, rely on staking to validate blockchain transactions, an essential operation to these protocols’ operations and an alternative consensus mechanism to mining. Network participants can designate a certain amount of their crypto assets on the network to validate transactions and earn rewards. Today, many users choose to outsource the technical processes involved in staking by staking through a service provider. \nWe provide an onchain staking service, which allows our customers to stake their assets with a few clicks. Our customers maintain full ownership of their crypto assets while earning staking rewards. Customers who stake their assets receive compensation, paid out by applicable blockchain protocols, in \n9\nTable of Contents\nthe form of the network’s crypto asset. The rewards rates, expressed as an annual percentage yield, vary by asset. In return for the services we provide, we earn a fixed percentage commission on all staking rewards received. \nBecause staking rewards depend on the relevant protocol and network conditions, the estimated rewards rate for each asset made available for staking is displayed on our website and through our platform, and is calculated by periodically consulting onchain data to determine the total amount. We only facilitate staking of a consumer’s crypto assets in response to a direct instruction from that consumer, and the staked crypto assets remain the property of the consumer and in our custody while staked. According to certain protocol rules, staked crypto assets cannot be sold or transferred while they remain staked, and we do not use or allocate consumers’ staked crypto assets for any other purpose.\nSubject to jurisdiction, we support eight staking assets through our platform for consumers as of December 31, 2024: Cardano (ADA), Avalanche (AVAX), Cosmos (ATOM), Polkadot (DOT), Ethereum (ETH), MATIC (POL), Solana (SOL), and Tezos (XTZ). As of December 31, 2024, approximately $15.2 billion worth of these assets were held on behalf of individual consumers staked through our platform, as adjusted to USD.  \nFor our institutional customers, our staking process varies by customer. In addition to operating our own validator nodes to provide staking services, we utilize third-party service providers to operate validator nodes on our customers’ behalf. Institutional customers receive rewards directly from the protocol as we do not stake on behalf of these customers. The fees we charge to institutional customers depend on the customer agreement and the selected service. As of December 31, 2024, over $8.1 billion worth of assets were staked by institutional customers through Coinbase Prime, as adjusted to USD.  \nWe also operate a cbETH token wrapping service. cbETH is an Ethereum-based “wrapped staking token” that represents ownership of ETH staked through our platform. Eligible customers can obtain cbETH tokens by wrapping their staked ETH or by purchasing cbETH tokens on our exchange or on third-party exchanges. A cbETH holder can sell or transfer their cbETH within the Coinbase app or send cbETH to a self-custody wallet or to other addresses on the Ethereum blockchain. Selling or otherwise transferring cbETH automatically transfers ownership of the underlying staked ETH, along with any rewards earned.\nThere are risks associated with our staking services, which are described in the risk factor in the section titled “Risk Factors” in Part I, Item 1A of this Annual Report on Form 10-K: “\nWe may suffer losses due to staking, delegating, and other related services provided to our customers.\n”\nCustody\nWe offer an institutional-grade custody platform with a highly secure cold storage solution both within the United States and globally. We charge institutions a separate fee based on the total assets stored in custody on our platform. For example, we serve as a custodian for several Bitcoin and Ethereum ETF issuers. In 2024, the Securities and Exchange Commission (the “SEC”) approved 11 spot Bitcoin ETF applications, nine of which partner with Coinbase, and nine Ethereum ETF applications, eight of which partner with Coinbase. We do not charge our consumers a separate fee to safely store their crypto assets on our platform. We discuss our custodial practices for both institutions and consumers in further detail below. \nCoinbase One\nCoinbase One is a consumer subscription product for which consumers pay a monthly or annual fee to unlock a variety of benefits, including limited reduced transaction fee trading, higher staking and USDC rewards than non-Coinbase One subscribers, priority customer service support, and offers from third-party partners. In 2024, we launched an additional subscription tier, Coinbase One Premium, offering consumers enhanced benefits, including unlimited zero trading fees on simple trading and concierge support for a higher subscription fee.\n10\nTable of Contents\nInstitutional financing\nFinancing is an increasingly important offering to our institutional customers. We offer integrated financing products and services to institutional customers that meet our credit criteria to access liquidity for their hedging, trading, and working capital needs. \nOur lending product set includes tools to allow clients to trade in real time, products that enable leverage and short access across our Prime and Markets offerings, and structured loans supporting client working capital and other needs.\nIn addition to lending, we borrow fiat and crypto assets, including USDC, from third parties, including eligible institutional customers, to facilitate our financing products. We also offer a managed lending product for eligible institutional customers under our Agency Lending offering.\nThe terms of our lending and borrowing arrangements may vary modestly from customer to customer. For additional information, see \nNote 4. Collateralized Arrangements and Financing\n, of the Notes to our Consolidated Financial Statements included in Part II, Item 8 of this Annual Report on Form 10-K and \nRisk Factors—We provide secured loans to our customers, which exposes us to credit risks and may cause us to incur financial or reputational harm\n included in Part I, Item 1A of this Annual Report on Form 10-K.\nCoinbase developer platform\nOur developer platform combines a suite of developer tools to enable crypto developers to build in the onchain ecosystem. We offer APIs to simplify a variety of key activities, including crypto payments and trading, data access, staking, and more. Coinbase Developer Platform enables developers to build crypto into their products faster and to simplify how they interact with blockchains. \nTrusted crypto platform \nCoinbase is the most trusted crypto platform. \nWe place great importance on securely storing crypto assets, and we have policies and procedures to help ensure the proper storing of the crypto assets we hold on behalf of our customers and for our own investment and operating purposes. When customers use our platform, their assets remain their assets. We store crypto assets using proprietary technology and operational processes. Crypto assets are not insured or guaranteed by any government or government agency; however, we have worked hard to securely store our customers’ crypto assets and our own crypto assets for investment and operational purposes with legal and operational protections. \nFurther, we appropriately ledger, properly segregate, and maintain separate accounts for our corporate crypto assets and customers’ crypto assets. Additionally, with respect to Coinbase entities that provide cold storage custody services, such as Coinbase Custody Trust Company, LLC (“CCTC”) and Coinbase Custody International Limited, crypto assets are held separately in dedicated addresses and ledgered using a proprietary combination of hardware security modules. For Coinbase entities that provide crypto trading services, such as Coinbase, Inc., crypto assets are held in an omnibus manner on the blockchain and separately recorded using a ledger system. Additionally, as a U.S. public company, we are required to undergo annual audits and quarterly reviews, which, among other things, require that our independent registered public accounting firm reviews and audits our internal controls and reconciliation processes. Moreover, our various user, custody, and client agreements outline the applicability of Uniform Commercial Code (“UCC”) Article 8 to custodied crypto assets. UCC Article 8 provides that financial assets held by Coinbase for its customers are not property of Coinbase and not subject to claims of our general creditors.\nNew customers must meet some minimum criteria to engage on our platforms. When signing up for an account on our platform, among other requirements, consumer, and institutional customers must \n11\nTable of Contents\ncertify that they are at least eighteen (18) years of age (if a natural person), agree to a user agreement and privacy policy, and satisfy the requirements of our robust know-your-customer (“KYC”) program.\nOur products, services and educational offerings incorporate a holistic, customer-centric set of digital engagement practices, including educational content and notifications, which are designed, in part, to promote financial literacy and awareness and to provide customers with guidance and information to help them make better informed decisions about their crypto activity. Examples of these offerings include, among others: (i) educational materials, including but not limited to an online collection of how-to guides and tutorials, a crypto developments newsletter, Coinbase Bytes, and our learning rewards program, a video content-driven educational platform available on our Coinbase app and our website, through which customers can earn small rewards, paid out in cryptocurrency, upon successful completion of a video and a short quiz on a range of topics related to the cryptoeconomy, (ii) in-app engagement, including features designed to enable consumers to start small and build crypto asset holdings with confidence over time, including through rewards to customers in connection with the completion of certain milestones, (iii) sweepstakes, and (iv) differentiated marketing, including paid digital and social media marketing campaigns, as well as email campaigns, search engage optimization, in-app banners, push and pop-up notifications, paid search marketing, and affiliate marketing.\nFor additional information, see \nRisk Factors—Laws and regulations regarding conflicts of interest associated with the use of predictive data analytics, digital engagement practices, and similar technologies, if adopted and found to be applicable to our business, may require us to modify, limit, or discontinue our use of certain technologies and features contained within our products and services and may impact the way that we interact with existing and prospective customers, which could adversely affect our business, operating results, and financial condition \nincluded in Part I, Item 1A of this Annual Report on Form 10-K.\nCustodial practices\nWe utilize both hot wallets and cold wallets in our custodial solutions. We actively manage wallet balances and generally seek to hold no more than 2% of custodied assets in hot wallets at any given time. Cold wallet private key materials are stored and secured at facilities within the United States and internationally. We store the substantial majority of our own crypto asset holdings utilizing the same storage solutions that we provide to our customers. In limited cases, we use storage solutions not offered to our customers to store immaterial amounts of crypto held for corporate purposes outside of our core custodial product offerings. Additionally, our Coinbase Asset Management offering utilizes both Coinbase and third parties as custodians. \nAs part of our risk mitigation efforts, wallet private keys are not stored in plaintext format in any location and the cryptographic consensus of multiple human operators is required to decrypt a private key for both hot and cold wallets. No single individual has control of Coinbase’s wallet private keys. To the extent a customer withdrawal requires movement of assets from a cold wallet, authority to release proceeds from such wallet resides with a geographically distributed team of professionals, all of whom are subject to background checks as part of the onboarding process. \nWe perform internal audits of the private key management process and reconciliations between Coinbase wallets and third-party blockchain data. Coinbase, Inc. and CCTC, the two subsidiaries that custody the majority of crypto assets on platform, are also periodically examined by a variety of regulators, including the New York State Department of Financial Services (“NYDFS”) and various states in which such entities hold money transmission licenses. In the event of an insurable loss of assets for which we file a claim, we may be expected to allow our insurance providers to inspect custodied assets in the course of their investigation of such claim. \nWe do not use third-party sub-custodians, where one custodian holds assets on behalf of another custodian, in connection with the storage of digital assets. In accordance with applicable state money transmitter laws, we hold U.S. customers’ cash at FDIC-insured depository institutions, NCUSIF-insured credit unions, and in money market funds in accounts explicitly named to further demonstrate that we are \n12\nTable of Contents\nholding the funds as custodian. We believe the terms of the relevant account agreements to be comparable to those offered to similar companies.\nOther policies and procedures\nWe also have policies in place to help us govern accounting controls, including customer account initiations and reconciliations, and to help prevent improper self-dealing and other conflicts of interest between us and our customers on our platform. When we make investments in crypto assets, we execute investment trades away from our platform to avoid any conflict of interest with our customers. Additionally, Coinbase is committed to providing a fair, transparent, and equitable experience across our suite of trading products. Crypto assets and use cases are rapidly expanding and Coinbase seeks to offer our customers access to all assets and use cases where it is safe and legal to do so. For example, we take a number of steps to mitigate conflicts in our digital asset listing process. We have a digital asset support group that is composed of senior leaders from our product, legal, compliance, and finance departments. The digital asset support group reviews the relevant aspects of any asset escalated to it in connection with a listing on our platform in accordance with our digital asset support policies and procedures that are designed to mitigate conflicts. Only the digital asset support group decides which of these escalated assets we can and cannot list on our platform, and it does not coordinate such decisions with anyone outside of the committee. We also have policies and procedures that require committee members to recuse themselves from asset listing decisions where a committee member may have a conflict of interest. We have seen an increase in the rate of assets created and increased demand for listings, and we continue to evaluate our processes to meet this increased demand. \nFurther, we carefully handle and keep customer data confidential through security and encryption as well as policies, training, and monitoring. Moreover, we invest heavily in compliance tools. For example, in addition to robust KYC and anti-money laundering programs, we employ an industry leading third-party trade surveillance software platform that helps us monitor and detect problematic trading activities on our platform, as further discussed below. We have also invested in a range of technologies that are designed to help identify and prevent harmful activity on our platform, including fraud or account takeovers.\nAs we maintain, grow, and expand our product and services offerings we also must scale and strengthen our internal controls and processes, and monitor our third-party partners’ and vendors’ ability to similarly scale and strengthen in order for us to remain an industry leader and a trusted platform. Additionally, we have procedures to process redemptions and withdrawals expeditiously, subject to the terms of applicable user agreements. For additional information, see \nRisk Factors—Our failure to securely store and manage our and our customers’ fiat currencies and crypto assets could adversely impact our business, operating results, and financial condition\n and \nRisk Factors—Depositing and withdrawing crypto assets into and from our platforms involve risks, which could result in loss of customer assets, customer disputes and other liabilities, which could adversely impact our business, operating results, and financial condition\n included in Part I, Item 1A of this Annual Report on Form 10-K.\nCompetition\nThe crypto industry is highly innovative, rapidly evolving, and characterized by healthy competition, experimentation, changing customer needs, frequent introductions of new products and services, and is subject to uncertain and evolving industry and regulatory requirements. We face significant competition from a variety of companies around the world – ranging from crypto-native companies, including decentralized exchanges, to large traditional financial services incumbents and financial technology providers. \nOur main competition falls into the following categories:\n•\ntraditional financial technology and brokerage firms that have entered the crypto asset market in recent years and offer overlapping features targeted at our customers;\n13\nTable of Contents\n•\ncompanies focused on the crypto asset market, some of whom adhere to local regulations and directly compete with our platform, and others who choose to operate outside of local rules and regulations or in jurisdictions with less stringent local rules and regulations and are potentially able to more quickly adapt to trends, support a greater number of crypto assets, and develop new crypto-based products and services due to a different standard of regulatory scrutiny;\n•\ncrypto-focused companies and traditional financial incumbents that offer point or siloed solutions specifically targeted at institutional customers; \n•\ndecentralized and non-custodial platforms; and\n•\nstablecoins, other than USDC, and fiat currencies globally.\nThe competitive landscape varies significantly by geography, and many offerings are global in nature. The traditional financial services and financial technology companies we compete against are largely U.S. and European based and operate under the same evolving regulatory landscape that we do. However, we also face competition from companies, in particular those located outside the United States, who are subject to significantly less stringent regulatory and compliance requirements in their local jurisdictions. Their business models rely on being unregulated or only regulated in a small number of lower compliance jurisdictions, while also offering their products in highly regulated jurisdictions, including the United States, without necessarily complying with the relevant regulatory requirements in such jurisdictions. As regulations and compliance requirements in the United States become clearer, we may face increased competition from U.S.-based companies. \nOur ability to quickly and continuously innovate to support additional blockchains, provide products and services to our customers that are native to the cryptoeconomy, such as staking and governance, and launch additional products and services further separates us from our competition. See the section titled “\nRisk Factors\n” in Part I, Item 1A of this Annual Report on Form 10-K for a more comprehensive description of risks related to competition.\nHuman Capital\nPowering the cryptoeconomy is no small task, and requires hiring, developing, and retaining the most talented individuals who are deeply passionate about our mission to increase economic freedom and who are excited to build new products and services.\nWe work incredibly hard in pursuit of ambitious goals. We signal who will thrive at Coinbase by being transparent about our culture on our website. Our culture has and will continue to evolve but, at our core, we prioritize the following tenets:\n•\nClear communication\n•\nEfficient execution\n•\nAct like an owner\n•\nTop talent\n•\nChampionship team\n•\nContinuous learning\n•\nCustomer focus\n•\nRepeatable innovation\n•\nPositive energy\n•\nMission first\n14\nTable of Contents\nWe are a remote-first company. We believe that allowing our employees to work in the location that best suits them provides us access to a large talent pool and a sustained advantage in hiring and retaining employees in the United States and worldwide.\nWe offer competitive, transparent compensation and unique learning. We conduct an annual market review to ensure our compensation continues to be consistent with our competitive compensation philosophy. We have single, transparent pay targets for the vast majority of our roles – eliminating most compensation negotiations – and provide one-year equity grants for the vast majority of employees. We have also made meaningful investments in learning and development, including offering an annual learning stipend and in-house crypto learning curriculum.\nWe continuously improve our people programs and practices. We regularly monitor engagement through semi-annual pulse surveys to continuously optimize our culture, employee engagement, risk management, and productivity. We invest in these surveys and associated action planning at the executive level, as we believe our people and culture are key drivers of business success.\nAs of December 31, 2024, we had 3,772 employees.\nGovernment Regulation\nWe operate globally in a complex and rapidly evolving regulatory environment and are subject to a wide range of laws and regulations enacted by U.S. federal, state, and local and foreign governments and regulatory authorities. The breadth of laws, rules, and regulations we are subject to include financial services and banking, consumer protection, money transmission, stored value and prepaid access, electronic payments, payment services, securities, commodities, derivatives, and unclaimed property, as well as bespoke digital asset and cryptocurrency laws that have been promulgated in some jurisdictions. These laws, rules, and regulations evolve frequently and may be modified, interpreted, and applied in an inconsistent manner from one jurisdiction to another, and may conflict with one another. Moreover, the complexity and evolving nature of our business and the significant uncertainty surrounding the regulation of the cryptoeconomy, require us to exercise our judgment as to whether certain laws, rules, and regulations apply to us, and it is possible that regulators may disagree with our conclusions. We are not supervised by any federal banking agency, such as the Office of the Comptroller of the Currency, the Federal Deposit Insurance Corporation, or the Federal Reserve Board. In addition, our trading platform is not an SEC-regulated national securities exchange or alternative trading system.\nGlobally, we are subject to strict legal and regulatory requirements relating to the detection and prevention of terrorist financing, money laundering, fraud, tax evasion, and other illicit activity, the regulation of competition, economic, and trade sanctions, privacy, cybersecurity, information security, and data protection. These descriptions are not exhaustive, and these laws, regulations, and rules (and the interpretations thereof) frequently change and are increasing in number.\nThe laws and regulations to which we are subject, including those pertaining to digital assets and crypto assets, are rapidly evolving and increasing in scope. Therefore, we monitor these areas closely and invest significant resources in our legal, compliance, product, and engineering teams to ensure our business practices evolve to help us comply with the current laws, regulations, and legal standards to which we are subject, as well as to plan and prepare for changes in interpretations thereof, as well as additional laws, regulations, and legal standards that are introduced in the future.\nAnti-money laundering and counter-terrorist financing\nWe are subject to various anti-money laundering and counter-terrorist financing laws, including the Bank Secrecy Act (the “BSA”) in the United States, and similar laws and regulations abroad. In the United States, as a money services business registered with the Financial Crimes Enforcement Network (“FinCEN”), we are required under the BSA to among other things, develop, implement, and maintain a risk-based anti-money laundering program, provide an anti-money laundering-related training program, report suspicious activities and transactions to FinCEN, comply with certain reporting and recordkeeping \n15\nTable of Contents\nrequirements, and collect and maintain information about our customers. In addition, the BSA requires us to comply with certain customer due diligence requirements as part of our anti-money laundering obligations, including developing risk-based policies, procedures, and internal controls reasonably designed to verify a customer’s identity. Many states and other countries impose similar and, in some cases, more stringent requirements related to anti-money laundering and counter-terrorist financing. Our compliance program is designed to prevent and detect instances of money laundering, terrorist financing, and other illicit activity on our platform. It is also designed to prohibit the use of Coinbase in sanctioned jurisdictions, or by sanctioned persons or entities, as determined by the Office of Foreign Assets Control (“OFAC”), and equivalent foreign authorities. It includes policies, procedures, reporting protocols, and internal controls, and is designed to address legal and regulatory requirements as well as to assist us in managing risks associated with money laundering and terrorist financing. As part of our compliance program, we limit the use of our products and services to jurisdictions where we are legally able to offer our products and services, and customers can only use our products and services in the specific jurisdictions we have approved. We enforce such geographic restrictions though various onboarding and login controls to limit a customer from accessing products or services outside of their jurisdiction-based permissions. Additionally, we have a robust KYC program, which is a central part of our anti-money laundering program. Our KYC program is governed by our Global KYC Policy that covers customer onboarding, and includes customer due diligence; calculation and assessment of customer risk rating; application of enhanced due diligence on high risk customers; and screening customers against global sanctions lists. Following the customer onboarding process, we perform ongoing monitoring of customers and transaction activity to ensure that potentially suspicious activity is appropriately detected, and when appropriate, reported. Anti-money laundering regulations are constantly evolving and vary from jurisdiction-to-jurisdiction. We continuously monitor our compliance with anti-money laundering and counter-terrorist financing regulations and industry standards and implement policies, procedures, and controls in light of the most current legal requirements.\nFor a description of the risks we may face from (i) unauthorized or impermissible customer access to our products and services outside of jurisdictions where we have determined to make such products and services available or (ii) an assertion of jurisdiction over our operations or the crypto assets we offer by U.S. and foreign regulators and other government entities, see the following risk factors in the section titled “Risk Factors” in Part I, Item 1A of this Annual Report on Form 10-K: (i) “\nWe are subject to an extensive, highly-evolving and uncertain regulatory landscape and any adverse changes to, or our failure to comply with, any laws and regulations could adversely affect our brand, reputation, business, operating results, and financial condition\n”; (ii) “\nAs we continue to expand and localize our international activities, our obligations to comply with the laws, rules, regulations, and policies of a variety of jurisdictions will increase and we may be subject to inquiries, investigations, and enforcement actions by U.S. and non-U.S. regulators and governmental authorities, including those related to sanctions, export control, and anti-money laundering\n”; and (iii) “\nA particular crypto asset, product or service’s status as a “security” in any relevant jurisdiction is subject to a high degree of uncertainty and if we are unable to properly characterize a crypto asset or product offering, we may be subject to regulatory scrutiny, inquiries, investigations, fines, and other penalties, which may adversely affect our business, operating results, and financial condition\n.”\nMoney transmission, stored value, and virtual currency business activity\nIn the United States, we have obtained licenses to operate as a money transmitter or the equivalent in the states where such licenses or equivalent are required to conduct our business, as well as in the District of Columbia and Puerto Rico. In addition, we have obtained a BitLicense from NYDFS and a Virtual Currency Business License from Louisiana. As a licensed money transmitter and an entity subject to the BitLicense regulatory regime, we are subject to, among other things, the BSA, restrictions, and requirements with respect to the investment of customer funds and use and safeguarding of customer funds and crypto assets, and bonding, minimum capital and net worth requirements, prudential compliance obligations associated with customer notice and disclosure, reporting and recordkeeping requirements applicable to the company, as well as requirements relating to the screening of control \n16\nTable of Contents\npersons and inspection and examination by state regulatory agencies. These state licensing laws also cover matters such as regulatory approval of controlling stockholders, directors, and senior management of the licensed entity.\nOutside the United States, we have obtained licenses to provide crypto-asset custody and trading from the German Federal Financial Supervisory Authority (BaFin). In Singapore, we hold a major payment institution license issued by the Monetary Authority of Singapore. In Australia, we are registered as a digital currency exchange provider with the Australian Transaction Reports and Analysis Centre. We are also registered as a Money Services Business with the Financial Transactions and Reports Analysis Centre of Canada, and we have registered as a Restricted Dealer by the Canadian Securities Administrators, with the Ontario Securities Commission as its Principal Regulator. In Bermuda, we have obtained a ‘Class ‘F’ (Full) Digital Asset Business License from the BMA enabling us to service consumer trading in numerous approved jurisdictions. In addition, we have obtained Virtual Asset Service Provider registrations in Argentina, Ireland, Spain, France, Italy, the Netherlands, and the United Kingdom through which we offer crypto custody and trading services in these countries. Under these licenses and registrations, we are subject to a broad range of rules and regulations including in respect of anti-money laundering, safeguarding of customer assets and funds, regulatory capital requirements, fit and proper management, operational controls, corporate governance, customer disclosures, reporting, and record keeping.\nElectronic money and payment institution\nWe serve our customers through Electronic Money Institutions authorized by the U.K. Financial Conduct Authority and the Central Bank of Ireland. We comply with rules and regulations applicable to the European e-money industry, including those related to funds safeguarding, corporate governance, anti-money laundering, disclosure, reporting, and inspection. We are, or may be, subject to banking-related regulations in other countries now or in the future related to our role in the financial industry.\nNew York State trust company\nOur subsidiary, CCTC, operates as a New York State-chartered limited purpose trust company, which is subject to regulation, examination, and supervision by the NYDFS. NYDFS regulations impose various compliance requirements including, without limitation, operational limitations related to the nature of crypto assets we can hold under custody, capital requirements, BSA and anti-money laundering program requirements, affiliate transaction limitations, and notice and reporting requirements.\nEconomic and trade sanctions\nWe are required to comply with economic and trade sanctions administered by the United States, the European Union (“E.U.”), relevant E.U. member states, and other jurisdictions in which we operate. Economic and trade sanctions programs administered by OFAC and by certain foreign jurisdictions prohibit or restrict transactions to or from (or dealings with or involving) certain countries, regions, governments, and in certain circumstances, specified individuals and entities such as narcotics traffickers, terrorists, and terrorist organizations, as well as certain digital currency addresses.\nSecurities\nIn recent years, the SEC and U.S. state securities regulators have stated that certain digital assets or digital asset products may be classified as securities under U.S. federal and state securities laws, and in the case of the SEC, has made public statements on this topic – however, these statements are not binding or definitive guidance. A number of enforcement actions and regulatory proceedings have since been initiated against digital assets and digital asset products, as well as against trading platforms that support digital assets. The SEC has characterized a number of crypto assets, products, and services as securities in these regulatory proceedings and enforcement actions, including an enforcement action brought against us. The SEC has stated more recently that a crypto asset itself is not a security, but there is uncertainty and inconsistency in the courts that have grappled with the issue of whether or how certain \n17\nTable of Contents\ncrypto asset transactions could be deemed securities. Several foreign governments have also issued similar warnings cautioning that digital assets may be deemed to be securities or other similarly regulated financial instruments under the laws of their jurisdictions.\nWe have established policies and practices to evaluate each crypto asset we consider for listing, delisting, or for custody. We also evaluate all other products and services prior to launch under U.S. federal and applicable international securities laws.\nCommodities and derivatives\nThe Commodity Futures Trading Commission (“CFTC”) has stated, and CFTC enforcement actions have confirmed, that at least some crypto assets, including Bitcoin and Ethereum, fall within the definition of a “commodity” under the U.S. Commodities Exchange Act of 1936 (the “CEA”). Under the CEA, the CFTC has broad enforcement authority to police market manipulation and fraud in spot commodity markets, including the spot crypto markets. We are subject to such authority with respect to improper trading on our platform. In addition, CFTC regulations and CFTC oversight and enforcement authority apply with respect to futures, swaps, other derivative products, and certain retail leveraged commodity transactions involving crypto assets, including the markets on which these products trade. Separately, security-based swaps are subject to SEC regulation and oversight. In general, we seek to ensure that crypto asset transactions on our crypto asset trading platform do not constitute futures, swaps, security-based swaps, other derivative products, or retail leveraged commodity transactions. In August 2023, our subsidiary, Coinbase Financial Markets, Inc. secured regulatory approval from the National Futures Association to operate as a futures commission merchant (“FCM”), in September 2023, Coinbase International Exchange secured regulatory approval from the BMA to enable perpetual futures for eligible non-U.S. customers, and in February 2022, we acquired LMX Labs, LLC, a designated contract market (“DCM”) regulated by the CFTC which now operates as the Coinbase Derivatives Exchange, in connection with our acquisition of FairXchange, Inc. FCMs and DCMs are subject to the rules of the National Futures Association as well as numerous regulatory requirements, including strict capital requirements.\nProhibitions on bribery and anti-corruption\nWe are subject to regulations imposed by the FCPA in the United States and similar laws in other countries, such as the Bribery Act 2010 in the United Kingdom (the “Bribery Act”), which generally prohibit companies and those acting on their behalf from making improper payments to foreign government officials for the purpose of obtaining or retaining business. Some of these laws, such as the Bribery Act, also prohibit improper payments between private entities and persons.\nPrivacy and protection of user data\nWe are subject to a number of laws, rules, directives, and regulations relating to the collection, use, retention, security, processing, and transfer of personally identifiable information about our customers and employees in the countries where we operate. Our business relies on the processing of personal data in many jurisdictions and the movement of data across national borders. As a result, much of the personal data that we process, which may include certain financial information associated with individuals, is regulated by multiple privacy and data protection laws and, in some cases, the privacy and data protection laws of multiple jurisdictions. In many cases, these laws apply not only to third-party transactions, but also to transfers of information between or among us, our subsidiaries, and other parties with which we have commercial relationships.\nConsumer protection\nThe Federal Trade Commission (“FTC”), the Consumer Financial Protection Bureau (“CFPB”), and other U.S. federal, state, and local and foreign regulatory agencies regulate financial products, including money transfer services related to remittance or peer-to-peer transfers. These agencies, as well as certain other governmental bodies, including state attorneys general, have broad consumer protection \n18\nTable of Contents\nmandates and discretion in enforcing consumer protection laws, including matters related to unfair or deceptive, and, in the case of the CFPB, abusive acts or practices (“UDAAPs”), and they promulgate, interpret, and enforce rules and regulations that affect our business. The CFPB has enforcement authority to prevent an entity that offers or provides consumer financial services or products in the United States from committing or engaging in UDAAPs or violating other federal consumer financial laws, including the ability to engage in joint investigations with other agencies, issue subpoenas and civil investigative demands, conduct hearings and adjudication proceedings, commence a civil action, grant relief (e.g., limit activities or functions; rescission of contracts), and refer matters for criminal proceedings. Market disruptions have led to certain attempts by consumer protection focused agencies, including the CFPB, to directly regulate the crypto industry. New laws or regulations, or changes in enforcement of existing laws or regulations could require us to change certain business practices related to consumer disclosures, marketing and operational features related to payments and remittance regulations and other laws that may impact our business.\nEscheatment and unclaimed property regulations\nWe are subject to unclaimed property laws in the United States and in certain other jurisdictions where we operate. These laws may require us to turn over to certain government authorities the property of others held by us that has been unclaimed for a specified period of time, including airdropped tokens and forked crypto assets. These laws may also require us to liquidate that property prior to turning it over. We hold property subject to unclaimed property laws; however, there is significant regulatory uncertainty with how certain states and foreign jurisdictions treat crypto assets under unclaimed property rules.\nLending law\nWe originate secured commercial loans in certain states in the United States. As a result, our lending activities are subject to various state lending laws and licensure requirements with respect to lending activities within such state. These state lending laws may be enforced by state attorneys general, state financial regulators, and private litigants, among others. Given our novel business model and uncertainty regarding application of some of these laws and regulations, we may become subject to regulatory scrutiny or legal challenge with respect to our compliance with these requirements.\nInterchange fees\nInterchange fees associated with four-party payments systems are being reviewed or challenged in various jurisdictions. For example, in the E.U., the Multilateral Interchange Fee Regulation caps interchange fees for credit and debit card payments and provides for business rules to be complied with by any company dealing with card transactions, including us. As a result, the fees that we collect in certain jurisdictions may become the subject of regulatory challenge.\nLegal requirements for prepaid cards\nPrepaid card programs are subject to various federal and state laws and regulations, including consumer financial protection regulations such as the CFPB's Regulation E, which imposes requirements on issuers of prepaid cards. The laws and regulations impose compliance obligations and costs on our business, and failure to comply could result in litigation, enforcement actions, and penalties.\nCard association and payment network rules\nIn addition to the federal and state laws and regulations governing prepaid cards, we, as well as the bank that issues our Coinbase Card, are subject to and required to comply with card association and payment network rules and guidelines which apply to prepaid cards. The card association and payment network rules govern a variety of areas, including how consumers and merchants may use their cards and data security, and may be changed periodically. Noncompliance with these rules could result in fines or penalties levied by the card association or payment network for certain acts or omissions, or the termination of our ability to offer prepaid cards.\n19\nTable of Contents\nAssociation and network rules\nThe bylaws and agreements between clearing house participants and bankcard companies impose specific responsibilities and liabilities for issuers of debit cards. We, as well as the bank that issues our Coinbase Card, are required to comply with the appropriate National Automated Clearing House Association (“NACHA”), bylaws, operating rules, and agreements, as well as card network rules and guidelines. Additional new products and services that we offer may also impose additional obligations on us to comply with NACHA and card network obligations related to preventing fraud, money laundering, and IT security breaches.\nIntellectual Property\nThe protection of our technology and intellectual property is an important aspect of our business. We rely upon a variety of protections, including a combination of patents, trademarks, trade secrets, copyrights, confidentiality procedures, and contractual commitments. We co-founded the Crypto Open Patent Alliance, and pledged to only use our crypto technology patents defensively. We may also in the future agree to license our patents to third parties as part of various patent pools and open patent projects.\nCorporate Information\nWe were initially incorporated in May 2012 as Coinbase, Inc., a Delaware corporation. In January 2014, Coinbase Global, Inc. was incorporated as a Delaware corporation to act as the holding company of Coinbase, Inc. and our other subsidiaries. In April 2014, we completed a corporate reorganization whereby Coinbase, Inc. became a wholly-owned subsidiary of Coinbase Global, Inc. Coinbase Global, Inc.’s principal assets are its interests in the equity of Coinbase, Inc. In addition to Coinbase, Inc., Coinbase Global, Inc. is the parent company of a number of other operating subsidiaries. We are a remote-first company, meaning the majority of our employees work remotely. Due to this, we do not maintain a headquarters.\nCoinbase, the Coinbase logo, and other registered or common law trade names, trademarks, or service marks of Coinbase included in this Annual Report on Form 10-K are the property of Coinbase. Other trademarks, service marks, or trade names included in this Annual Report on Form 10-K are the property of their respective owners.\nAvailable Information\nWe file our annual, periodic and current reports, and other required information, electronically with the SEC and this information is available at www.sec.gov. We also make available on our website at www.coinbase.com, free of charge, copies of these reports and other information as soon as reasonably practicable after we electronically file such material with, or furnish it to, the SEC.\nWe use our Investor Relations website (investor.coinbase.com), our blog (blog.coinbase.com), press releases, public conference calls and webcasts, our X feed (@coinbase), Brian Armstrong’s X feed (@brian_armstrong), our LinkedIn page, and our YouTube channel as means of disclosing material non-public information and for complying with our disclosure obligations under Regulation FD. The information disclosed by the foregoing channels could be deemed to be material information. As such, we encourage investors, the media, and others to follow the channels listed above and to review the information disclosed through such channels. The contents of the websites referred to above are not intended to be incorporated by reference into this Annual Report on Form 10-K or in any other report or document we file with the SEC, and any references to websites are intended to be inactive textual references only.",
  "item7": "ITEM 7. MANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe following discussion and analysis of our financial condition and results of operations should be read in conjunction with our Consolidated Financial Statements and the accompanying notes thereto included elsewhere\n in this Annual Report on Form 10-K. Th\ne following discussion and analysis contains forward-looking statements that involve risks and uncertainties, as well as assumptions that, if they never materialize or prove incorrect, could cause our results to differ materially from those expressed or implied by such forward-looking statements. Factors that could cause or contribute to these differences include, \nbut are not limited to, those identified below and those discussed in the section titled Risk Factors in Part I, Item 1A of this Annual Report on Form 10-K\n. Unless otherwise expressly stated or the context otherwise requires, references to “we,” “our,” “us,” “the Company,” and “Coinbase” refer to Coinbase Global, Inc. and its c\nonsolidated\n subsidiaries. \nFor all narrative provided in this Item 7, two numbers presented consecutively represent figures for the year ended December 31, 2024 as compared to the year ended December 31, 2023, respectively, unless otherwise noted. Management’s Discussion and Analysis of Financial Condition and Results of Operations for the year ended December 31, 2023 as compared to the year ended December 31, 2022 can be found in Item 7 of our Annual Report on Form 10-K for the year ended December 31, 2023, as filed with the Securities and Exchange Commission on February 15, 2024, which is incorporated by reference herein. \n89\nTable \nof\n Contents\nExecutive Overview\nThis executive overview of Management’s Discussion and Analysis of Financial Condition and Results of Operations highlights selected information and does not contain all of the information that is important to readers of this Annual Report on Form 10-K. \nDuring 2024, we made progress against our goals of driving revenue growth, crypto utility, and regulatory clarity. We advanced the crypto economy by deepening institutional adoption, scaling international growth, and expanding real-world utility. Our investments in core products like derivatives and Coinbase One, as well as our focus on global expansion drove revenue growth, while innovations such as USDC rewards showcased the power of onchain finance.\nFor the year ended December 31, 2024, our net revenue was $6.3 billion, including $4.0 billion in transaction revenue and $2.3 billion in subscription and services revenue. For the year ended December 31, 2023, our net revenue was $2.9 billion, including $1.5 billion in transaction revenue and $1.4 billion in subscription and services revenue.\nFor the year ended December 31, 2024, our net income was $2.6 billion and Adjusted EBITDA was $3.3 billion. For the year ended December 31, 2023, our net income was $0.1 billion and Adjusted EBITDA was $1.0 billion.\nFor 2025, we believe that we are well-positioned to drive revenue growth across all macroeconomic environments, and we remain committed to advancing regulatory clarity. Despite multiple Federal Funds Rate decreases in late 2024, future interest rate decreases are not certain. If they continue, they may materially impact our subscription and services and other revenue. We plan to dynamically adjust our expense base in order to be responsive to market conditions and revenue opportunities, increasing or decreasing it as needed, especially with respect to certain variable expenses. In the first quarter of 2025, we expect technology and development and general and administrative expenses to grow modestly as compared to the fourth quarter of 2024, primarily due to headcount growth and variable infrastructure and customer support expenses. Additionally, we expect sales and marketing expenses to grow, as compared to the fourth quarter of 2024, primarily due to expected higher USDC rewards expense and variable non-brand marketing spend.\nKey Business Metrics\nIn addition to the measures presented in our Consolidated Financial Statements, we use the key business metrics listed below to evaluate our business, measure our performance, identify trends affecting our business, and make strategic decisions:\nYear Ended December 31,\n2024\n2023\n%\nMTUs\n(1)\n \n(in millions)\n8.4 \n7.4 \n14 \nAssets on Platform\n(2)\n \n(in billions)\n$\n404 \n$\n191 \n112 \nTrading Volume \n(in billions)\n$\n1,162 \n$\n468 \n148 \nNet income \n(in millions)\n$\n2,579 \n$\n95 \nnm\nAdjusted EBITDA\n(3) \n(in millions)\n$\n3,348 \n$\n978 \n242 \n_____________\nnm - not meaningful\n(1)\nRepresents the annual average MTUs, calculated as the average of quarterly MTUs, which are derived from the average of each month’s MTUs in each respective quarter. Quarterly MTUs for the fourth quarter of 2024 and 2023, were 9.7 million and 7.0 million, respectively. \n(2)\nRepresents Assets on Platform at December 31.\n(3)\nIn the first quarter of 2024, we revised our definition of Adjusted EBITDA and recast\n the prior period for comparability\n. S\nee the section titled “\nNon-GAAP Financial Measure\n” below for a reconciliation of net income to Adjusted EBITDA and an explanation for why we consider Adjusted EBITDA to be a helpful metric for investors.\n90\nTable \nof\n Contents\nMonthly Transacting Users\nWe define a Monthly Transacting User (“MTU”) as a consumer who actively or passively transacts in one or more products on our platform at least once during the rolling 28-day period ending on the date of measurement. MTUs engage in transactions that generate both transaction revenue and subscription and services revenue. Revenue-generating transactions include active transactions, such as buying or selling crypto assets or passive transactions such as earning staking rewards and USDC rewards. MTUs also engage in transactions that are non-revenue generating, such as consumers sending and receiving crypto assets between wallets and off-platform accounts on a non-expedited basis. MTUs may overstate the number of unique consumers due to differences in product architecture or user behavior. \nMTUs increased for the year ended December 31, 2024 as compared to 2023, primarily due to a 1.3 million increase in trading users, influenced by overall crypto market sentiment and activity and higher average crypto asset prices. Additionally, we saw growth in users participating in our USDC rewards programs, offset in part by a decrease in staking only users as a result of updates we made to our staking service.\nAssets on Platform\nAs a result of our decision to adopt SAB 122 as of December 31, 2024 on a retrospective basis, we will include an Assets on Platform (“AOP”) key business metric going forward to expand upon the details of the assets we are obligated to securely store. \nWe define AOP as the total United States (“U.S.”) dollar equivalent value of USDC and crypto assets held or managed on behalf of customers in digital wallets on our platform, including our custody services but excluding assets for which the customer holds full or partial keys, calculated based on the market price on the date of measurement. Prior to SAB 122 adoption, SAB 121 safeguarding amounts included assets for which customers held full or partial keys. As customers are in control of those assets, we exclude them from our definition of AOP. AOP demonstrates the scale of balances held across our suite of products and services, the trust customers place in us to securely store their assets, and the underlying growth of the cryptoeconomy. AOP also represents our monetization opportunity for subscription products and services, including from the adoption and use of USDC, staking, custody, Prime Financing, and Coinbase One. AOP generate fees that are recorded as subscription and services revenue when customers engage with these products and services.\nFor additional information on the adoption of SAB 122, see \nNote 2. Summary of Significant Accounting Policies—Change in accounting principle\n, of the Notes to our Consolidated Financial Statements included in Part II, Item 8 of this Annual Report on Form 10-K.\nThe following table sets forth the value of AOP by asset (in thousands, except percentages): \nDecember 31,\nChange\n2024\n2023\n%\nBitcoin\n$\n235,377,653 \n$\n89,864,637 \n162 \n%\nEthereum\n54,209,118 \n39,762,180 \n36 \n%\nSolana\n21,297,761 \n12,906,278 \n65 \n%\nOther crypto assets\n(1)\n87,058,643 \n46,303,676 \n88 \n%\nUSDC\n6,091,015 \n2,367,276 \n157 \n%\nTotal\n$\n404,034,190 \n$\n191,204,047 \n111 \n%\n__________________\n(1)\nIncludes various other crypto asset balances, none of which individually represented more than 5% of total AOP.\n91\nTable \nof\n Contents\nAOP at December 31, 2024 increased as compared to December 31, 2023, primarily due to an increase in crypto asset prices, driven by broader crypto market sentiment and activity. Additionally, the growth in USDC balances is primarily attributable to the USDC rewards program, combined with deeper integration of USDC across our products.\nTrading Volume\nWe define Trading Volume as the total U.S. dollar equivalent value of spot matched trades transacted between a buyer and seller through our platform during the period of measurement. Trading Volume does not include derivatives volume on our platform or trades executed on third-party venues. Trading Volume represents the product of the quantity of assets transacted and the trade price at the time the transaction was executed. As trading activity directly impacts transaction revenue, we believe this measure is a reflection of liquidity on our order books, trading health, and the underlying growth of the cryptoeconomy. Institutional customers incur lower fees per transaction than consumer customers and, as a result, the impact of changes in consumer Trading Volume on transaction revenue is more pronounced than the impact of changes in institutional Trading Volume. \nGenerally, Trading Volume on our platform is primarily influenced by overall market dynamics, namely the price of crypto assets, crypto asset volatility, and macroeconomic conditions, and by our share of total crypto market spot trading volume. In periods of high crypto asset prices and crypto asset volatility, we have experienced correspondingly high levels of Trading Volume on our platform.\nYear Ended December 31,\nChange\n2024\n2023\n%\nTrading Volume (in billions)\nConsumer\n$\n221\n$\n75\n195 \nInstitutional\n941\n393\n139 \nTotal Trading Volume\n$\n1,162\n$\n468\n148 \nTrading Volume by crypto asset\nBitcoin\n32 \n%\n34 \n%\n(6)\nEthereum\n12 \n20 \n(40)\nUSDT\n(1)\n13 \n11 \n18 \nOther crypto assets\n(2)\n43 \n35 \n23 \nTotal\n100%\n100%\n____________________________________\n(1)\nUSDT is a stablecoin issued by Tether Operations Limited. \n(2)\nNo crypto assets other than those shown in this table individually represented more than 10% of our Trading Volume. \nFor the year ended December 31, 2024 as compared to 2023, Trading Volume increased reflecting \nan increase\n in both the total market and our market share in the U.S., where our business is concentrated:\n•\nTotal market\n — Crypto Asset Volatility\n1\n increased 37% and average total crypto market capitalization increased 103%. These two macro inputs have historically been highly correlated with Trading Volume and are typically influenced by overall crypto market sentiment, activity in the crypto market, and changes in average crypto asset prices; and\n•\nMarket share\n — Trading Volume growth outpaced the 105% growth in overall U.S. spot market trading volume, as we were able to capture a larger portion of the trading activity due to our competitive position and product strategy.\n1\n \nCrypto Asset Volatility represents our internal measure of crypto asset volatility in the market relative to prior periods. The volatility is based on intraday returns of a volume-weighted basket of all assets listed on our trading platform. These returns are used to compute the basket’s intraday volatility which is then scaled to a daily window. These daily volatility values are then averaged over the applicable time period as needed.\n92\nTable \nof\n Contents\nResults of Operations\nThe following table presents the Consolidated Statements of Operations (in thousands), as well as each component as a percentage of total revenue: \nYear Ended December 31,\n2024\n2023\n$\n%\n(1)\n$\n%\n(1)\nRevenue:\nNet revenue\n$\n6,293,246 \n96 \n$\n2,926,540 \n94 \nOther revenue\n270,782 \n4 \n181,843 \n6 \nTotal revenue\n6,564,028 \n100 \n3,108,383 \n100 \nOperating expenses:\nTransaction expense\n897,707 \n14 \n420,705 \n14 \nTechnology and development\n1,468,252 \n22 \n1,324,541 \n43 \nSales and marketing\n654,444 \n10 \n332,312 \n11 \nGeneral and administrative\n1,300,257 \n20 \n1,074,308 \n35 \nGains on crypto assets held for operations, net\n(71,725)\n(1)\n— \n— \nCrypto asset impairment, net\n— \n— \n(34,675)\n(1)\nRestructuring\n— \n— \n142,594 \n5 \nOther operating expense, net\n7,933 \n— \n10,260 \n— \nTotal operating expenses\n4,256,868 \n65 \n3,270,045 \n105 \nOperating income (loss)\n2,307,160 \n35 \n(161,662)\n(5)\nInterest expense\n80,645 \n1 \n82,766 \n3 \nGains on crypto assets held for investment, net\n(687,055)\n(10)\n— \n— \nOther income, net\n(29,074)\n— \n(167,583)\n(5)\nIncome (loss) before income taxes\n2,942,644 \n45 \n(76,845)\n(2)\nProvision for (benefit from) income taxes\n363,578 \n6 \n(171,716)\n(6)\nNet income\n$\n2,579,066 \n39 \n$\n94,871 \n3 \n__________________\n(1)\nFigures presented above may not sum precisely due to rounding.\n    For information on what is included in each of the line items in our Consolidated Statements of Operations, including the associated business drivers and accounting, please see Part I, Item 1. \nBusiness\n and \nNote 2. Summary of Significant Accounting Policies\n of the Notes to our Consolidated Financial Statements in Part II, Item 8. of this Annual Report on Form 10-K, and management’s discussion of the results of operations below. \n \nComparison of the years ended\n \nDecember 31, 2024 and 2023\nRevenue \nFor the years ended December 31, 2024 and 2023 we generated 83% and 88%, respectively, of total revenue in the U.S. No other country accounted for more than 10% of total revenue during the years presented. International revenue comprised mainly transaction revenue in both years presented.\n93\nTable \nof\n Contents\nTransaction revenue \nYear Ended December 31,\nChange\n(in thousands, except %)\n2024\n2023\n$\n%\nConsumer, net\n(1)\n$\n3,430,322 \n$\n1,334,018 \n$\n2,096,304 \n157 \nInstitutional, net\n345,598 \n90,164 \n255,434 \n283 \nOther transaction revenue, net\n(1)\n210,193 \n95,472 \n114,721 \n120 \nTotal transaction revenue\n$\n3,986,113 \n$\n1,519,654 \n$\n2,466,459 \n162 \n__________________\n(1)\nPrior period amounts were reclassified to conform to current period presentation. See\n Note 3. Revenue\n of the Notes to our Consolidated Financial Statements included in Part II, Item 8 of this Annual Report on Form 10-K for additional details.\nTransaction revenue increased for the year ended December 31, 2024 as compared to 2023, due to:\n•\nan increase in consumer transaction revenue of $2.6 billion due to a 195% increase in consumer Trading Volume. This increase was offset in part by a decrease of $482.5 million attributed to a lower average blended fee rate, primarily due to changes in the mix of Trading Volume from Simple to Advanced trading;\n•\nan increase in institutional transaction revenue of $139.1 million primarily due to a 139% increase in institutional Trading Volume, as well as growth in revenue from derivatives trading on our international exchange, which was launched in the second quarter of 2023; and\n•\nan increase in other transaction revenue of $77.8 million from transactions on Base, which was launched in the third quarter of 2023, as well as higher revenue from instant transfer withdrawals. \nThe percentage of transaction revenue from trading on our platform broken down by crypto asset was as follows:\nYear Ended December 31,\nChange\n2024\n2023\n%\nBitcoin\n30 \n%\n35 \n%\n(14)\nEthereum\n13 \n17 \n(24)\nOther crypto assets\n(1)\n57 \n48 \n19 \nTotal\n100 \n%\n100 \n%\n____________________________________\n(1)\nNo other crypto asset individually represented more than 10% of the total. \nSubscription and services revenue \nYear Ended December 31,\nChange\n(in thousands, except %)\n2024\n2023\n$\n%\nStablecoin revenue\n$\n910,464 \n$\n694,247 \n$\n216,217 \n31 \nBlockchain rewards\n705,757 \n330,885 \n374,872 \n113 \nInterest and finance fee income\n(1)\n265,799 \n186,685 \n79,114 \n42 \nCustodial fee revenue\n141,706 \n69,501 \n72,205 \n104 \nOther subscription and services revenue\n(1)\n283,407 \n125,568 \n157,839 \n126 \nTotal subscription and services revenue\n$\n2,307,133 \n$\n1,406,886 \n$\n900,247 \n64 \n__________________\n(1)\nPrior period amounts were reclassified to conform to current period presentation. See\n Note 3. Revenue\n of the Notes to our Consolidated Financial Statements included in Part II, Item 8 of this Annual Report on Form 10-K for additional details.\n94\nTable \nof\n Contents\nSubscription and services revenue increased for the year ended December 31, 2024 as compared to 2023, due to:\n•\nan increase in stablecoin revenue of $138.3 million primarily due to higher average customer USDC assets on platform and corporate balances, and $104.7 million attributable to an increase in overall USDC market capitalization, partially offset by increased expenses that are deducted prior to allocation of income from the arrangement with Circle;\n•\nan increase of $350.5 million in blockchain rewards primarily due to higher average prices for Solana and Ethereum, as well as higher native units staked driving growth in both U.S. and international revenue, partially offset by a $62.3 million decrease attributable to changes in reward rates, primarily for Ethereum and Solana;\n•\nan increase in interest and finance fee income primarily reflecting growth of $43.8 million in finance fees driven by higher average volumes of Prime Financing loan receivables, and growth of $25.0 million in interest income attributable to higher average customer custodial cash and cash equivalents balances;\n•\nan increase in custodial fee revenue reflecting growth in average crypto assets and USDC under custody of $81.5 billion primarily driven by higher crypto asset prices, mainly Bitcoin, Solana, and Ethereum; and\n•\nan increase in other subscription and services revenue primarily due to growth of $87.9 million in Coinbase One revenue, as the number of paid subscribers grew driven by positive market conditions and improvements to our product offerings, and an increase in revenue from expanding supported assets on our developer products. \nOther revenue\nYear Ended December 31,\nChange\n(in thousands, except %)\n2024\n2023\n$\n%\nCorporate interest and other income\n$\n270,782 \n$\n181,843 \n$\n88,939 \n49 \nTotal other revenue\n$\n270,782 \n$\n181,843 \n$\n88,939 \n49 \nOther revenue increased for the year ended December 31, 2024 as compared to 2023, primarily due to higher average cash and cash equivalents balances. \nOperating expenses \nCertain prior period amounts have been reclassified to conform to current period presentation.\nTransaction expense\nYear Ended December 31,\nChange\n(in thousands, except %)\n2024\n2023\n$\n%\nBlockchain rewards fees\n$\n455,946 \n$\n229,851 \n$\n226,095 \n98 \nPayment processing and account verification\n150,897 \n76,795 \n74,102 \n96 \nTransaction rebates and commissions\n122,372 \n6,876 \n115,496 \nnm\nTransaction reversal losses\n79,639 \n51,501 \n28,138 \n55 \nBlockchain transaction fees\n80,926 \n55,467 \n25,459 \n46 \nOther\n7,927 \n215 \n7,712 \nnm\nTotal transaction expense\n$\n897,707 \n$\n420,705 \n$\n477,002 \n113 \n__________________\nnm - not meaningful\n95\nTable \nof\n Contents\nTransaction expense increased for the year ended December 31, 2024 as compared to 2023, due to:\n•\nhigher blockchain rewards fees, which rose generally in line with blockchain rewards revenue;\n•\nan increase in payment processing fees of $56.4 million, reflecting Trading Volume growth of 148%, offset in part by savings from reduced fees at higher volumes; and\n•\nhigher transaction rebates and commissions, driven primarily by rebates earned by institutional customers providing liquidity on our international exchange, driven by growth in volume. \nThere were no material changes to note within transaction reversal losses, blockchain transaction fees, or other. \nTransaction expense as a percentage of total revenue will vary depending on the composition of the Company’s total revenue, as certain revenue streams incur little or no transaction costs while others have associated expenses. For example, if interest income and stablecoin revenue increase as a percentage of total revenue, transaction expenses as a percentage of total revenue will decrease as there are no transaction expenses directly attributed to these revenues. Conversely, if blockchain rewards increase as a percentage of total revenue, transaction expenses as a percentage of total revenue will increase since the majority of blockchain rewards revenue is distributed to the customer. There was no change in overall transaction expense as a percentage of total revenue when comparing the periods presented.\nTechnology and development\nYear Ended December 31,\nChange\n(in thousands, except %)\n2024\n2023\n$\n%\nPersonnel-related\n$\n1,038,154 \n$\n936,881 \n$\n101,273 \n11 \nWebsite hosting and infrastructure\n228,392 \n192,009 \n36,383 \n19 \nAmortization, depreciation, and impairment\n122,595 \n131,611 \n(9,016)\n(7)\nOther\n79,111 \n64,040 \n15,071 \n24 \nTotal technology and development\n$\n1,468,252 \n$\n1,324,541 \n$\n143,711 \n11 \nTechnology and development expenses increased for the year ended December 31, 2024 as compared to 2023, due to:\n•\nan increase in personnel-related expenses primarily reflecting higher stock-based compensation expense of $104.1 million as a result of the 2023 annual employee equity awards being granted at a lower stock price as compared to the 2024 annual employee equity awards, offset in part by the roll-off of non-recurring multi-year stock-based compensation awards. Further, personnel-related expenses increased $42.6 million due to higher average headcount; and\n•\nhigher website hosting and infrastructure expenses driven by increased activity on our platform.\nThere were no material changes to note within amortization, depreciation, and impairment or other. \nSales and marketing\nYear Ended December 31,\nChange\n(in thousands, except %)\n2024\n2023\n$\n%\nMarketing programs\n$\n247,087 \n$\n134,018 \n$\n113,069 \n84 \nUSDC rewards\n224,255 \n34,944 \n189,311 \n542 \nPersonnel-related\n151,054 \n143,762 \n7,292 \n5 \nOther\n32,048 \n19,588 \n12,460 \n64 \nTotal sales and marketing\n$\n654,444 \n$\n332,312 \n$\n322,132 \n97 \n96\nTable \nof\n Contents\nSales and marketing expenses increased for the year ended December 31, 2024 as compared to 2023, due to:\n•\nan increase in marketing programs expenses primarily due to $75.4 million higher digital advertising spend, and an increase in customer referral and other promotional initiatives; and\n•\nan increase in USDC rewards payouts of $112.4 million due to higher reward rates offered to customers in an effort to enhance customer acquisition, retention, and platform engagement, with the remainder primarily due to growth in average customer USDC assets on platform.\nThere were no material changes to note within personnel-related or other.\nGeneral and administrative\nYear Ended December 31,\nChange\n(in thousands, except %)\n2024\n2023\n$\n%\nPersonnel-related\n$\n608,786 \n$\n571,083 \n$\n37,703 \n7 \nProfessional services\n202,956 \n182,908 \n20,048 \n11 \nCustomer support \n(1)\n124,940 \n48,804 \n76,136 \n156 \nOther\n363,575 \n271,513 \n92,062 \n34 \nTotal general and administrative\n$\n1,300,257 \n$\n1,074,308 \n$\n225,949 \n21 \n__________________\n(1)\nExcludes personnel-related and professional services expenses.\nGeneral and administrative expenses increased for the year ended December 31, 2024 as compared to 2023, due to: \n•\nan increase in personnel-related expenses largely driven by increased stock-based compensation expense as a result of the 2023 annual employee equity awards being granted at a lower stock price as compared to the 2024 annual employee equity rewards;\n•\nhigher professional services expenses driven by an increase of $30.0 million in legal advisory services, offset in part by lower business consulting expenses; \n•\nan increase in customer support costs as a result of increased capacity needs. Our capacity needs typically increase in periods following higher Trading Volumes; and\n•\nan increase in other, largely reflecting:\n▪\nan additional $33.3 million in policy spend as we increased our crypto advocacy efforts; \n▪\nan increase of $31.0 million in taxes, licenses, and fees primarily due to higher indirect taxes directly associated with the growth in revenue and the application of certain indirect tax rules; \n▪\nan increase in legal costs of $23.4 million due to higher spend; offset in part by\n▪\nlower lease costs, as we recognized a one-time lease termination fee of $25.0 million during the year ended December 31, 2023 related to the closure of our San Francisco office space.\n▪\nThe remaining variance in other was due to increases across various expenses, with no material changes to note.\n97\nTable \nof\n Contents\nGains on crypto assets held for operations, net \nYear Ended December 31,\nChange\n(in thousands, except %)\n2024\n2023\n$\n%\nGains on crypto assets held for operations, net\n$\n(71,725)\n$\n— \n$\n(71,725)\nnm\n_____________\nnm - not meaningful\nGains on crypto assets held for operations, net during the year ended December 31, 2024 resulted primarily from flows of crypto assets held for operations during a period of rising crypto asset prices. Though gross inflows and outflows of these assets were each $1.5 billion in 2024, gains on changes in the fair value of the assets were limited as these assets are converted to cash or used for expenses nearly immediately after receipt. \nCrypto asset impairment, net \nDuring the year ended December 31, 2023, crypto asset impairment, net reflected a $34.7 million expense, driven by gross crypto asset impairments resulting from challenging crypto market conditions, followed by expense recoveries as we sold previously impaired assets at recovered prices. Beginning January 2024, we adopted ASU 2023-08, and as a result no longer record crypto asset impairments. \nRestructuring\nRestructuring expense was $142.6 million for the year ended December 31, 2023, comprising separation pay, stock-based compensation expense, and other personnel costs related to the workforce reduction in January 2023. There were no restructuring expenses for the year ended December 31, 2024.\nOther operating expense, net\nYear Ended December 31,\nChange\n(in thousands, except %)\n2024\n2023\n$\n%\nPlatform-related incidents \n$\n28,070 \n$\n15,717 \n$\n12,353 \n79 \nOther \n(20,137)\n(5,457)\n(14,680)\n269 \n Total other operating expense, net\n$\n7,933 \n$\n10,260 \n$\n(2,327)\n(23)\nThere were no material changes to note within Other operating expense, net.\nInterest expense\n \nYear Ended December 31,\nChange\n(in thousands, except %)\n2024\n2023\n$\n%\nInterest expense\n$\n80,645 \n$\n82,766 \n$\n(2,121)\n(3)\nThere were no material changes to note within Interest expense. \nGains on crypto assets held for investment, net \nYear Ended December 31,\nChange\n(in thousands, except %)\n2024\n2023\n$\n%\nGains on crypto assets held for investment, net\n$\n(687,055)\n$\n— \n$\n(687,055)\nnm\n__________________\nnm - not meaningful\nGains on crypto assets held for investment, net during the year ended December 31, 2024 were primarily due to remeasurement of the fair value of crypto assets held, mainly reflecting increases in the prices of Bitcoin and Ethereum.\n98\nTable \nof\n Contents\nOther income, net \nYear Ended December 31,\nChange\n(in thousands, except %)\n2024\n2023\n$\n%\nLosses (gains) on strategic investments, net\n$\n11,553 \n$\n(24,368)\n$\n35,921 \n(147)\nGain on extinguishment of long-term debt, net\n— \n(117,383)\n117,383 \nnm\nOther\n(40,627)\n(25,832)\n(14,795)\n57 \nTotal other income, net\n$\n(29,074)\n$\n(167,583)\n$\n138,509 \n(83)\n__________________\nnm - not meaningful\n \n \nOther income, net changed for the year ended December 31, 2024 as compared to 2023, due to:\n•\na decrease in gains on strategic investments, net driven by a gain of $49.9 million resulting from an equity investment transaction with Circle US Holding, Inc. during the third quarter of 2023; and\n•\na net gain on the repurchase of certain of our 2026 Convertible Notes and certain of our Senior Notes during 2023.\nThere were no material changes to note within other.\nProvision for (benefit from) income taxes \nYear Ended December 31,\nChange\n(in thousands, except %)\n2024\n2023\n$\n%\nProvision for (benefit from) income taxes\n$\n363,578 \n$\n(171,716)\n$\n535,294 \n(312)\nFor the year ended December 31, 2024 as compared to 2023, the increase in provision for income taxes was primarily due to higher pretax income, partially offset by tax benefits from stock-based compensation. Additionally, the 2023 income tax provision reflected a benefit from the reduction of a valuation allowance recorded on impairment charges and strategic investments.\nIn December 2021, the Organization for Economic Cooperation and Development introduced Pillar Two model rules imposing a 15% global minimum tax on companies such as ours. We operate in several jurisdictions that have introduced Pillar Two legislation with effect from January 1, 2024. Pillar Two did not have a material impact on our tax provision for 2024. However, we may be impacted in future years as this framework is modified and adjusted in the jurisdictions where we operate.\nNon-GAAP Financial Measure\nIn addition to our results determined in accordance with GAAP, we believe Adjusted EBITDA, a non-GAAP financial performance measure, is useful information to help investors evaluate our operating performance because it: enables investors to compare this measure and component adjustments to similar information provided by peer companies and our past financial performance; provides additional company-specific adjustments for certain items that may be included in income from operations but that we do not consider to be normal, recurring, operating expenses (or income) necessary to operate our business given our operations, revenue generating activities, business strategy, industry, and regulatory environment; and provides investors with visibility to a measure management uses to evaluate our ongoing operations and for internal planning and forecasting purposes. For example:\n•\nWe believe it is useful to exclude certain non-cash expenses, such as depreciation and amortization and stock-based compensation, from Adjusted EBITDA because the amounts of such expenses can vary significantly from period to period and may not directly correlate to the underlying performance of our business operations.\n99\nTable \nof\n Contents\n•\nWe believe it is useful to exclude certain items that we do not consider to be normal, recurring, cash operating expenses and therefore, not reflective of our ongoing business operations. For example, we exclude: (i) other (income) expense, net, as the income and expenses recognized in this line item are not part of our core operating activities and are considered non-operating activities under GAAP, (ii) gains and losses on crypto assets held for investment (post-adoption of ASU 2023-08) because such investments are considered primarily long-term holdings, we do not plan on engaging in regular trading of crypto assets, and, as an operating company, our investing activities in crypto are not part of our revenue generating activities, which are based on transactions on our platform and the sales of subscriptions and services, and (iii) the impact of our restructuring in 2023, which was not related to our normal business operations.\n•\nWe believe Adjusted EBITDA is useful to measure a company’s operating performance without regard to items such as stock-based compensation expense, depreciation and amortization expense, interest expense, other (income) expense, net, restructurings, and benefit from or provision for income taxes that can vary substantially from company to company depending upon their financing, capital structures, and the method by which assets were acquired.\nLimitations of Adjusted EBITDA\nWe believe that Adjusted EBITDA may be helpful to investors for the reasons noted above. However, Adjusted EBITDA is presented for supplemental informational purposes only, has limitations as an analytical tool, and should not be considered in isolation or as a substitute for financial information presented in accordance with GAAP. There are a number of limitations related to Adjusted EBITDA rather than net income (loss), which is the nearest GAAP equivalent of Adjusted EBITDA. Some of these limitations are that Adjusted EBITDA excludes: \n•\nprovision for (benefit from) income taxes; \n•\ninterest expense, or the cash requirements necessary to service interest or principal payments on our debt, which reduces cash available to us;\n•\ndepreciation and amortization expense and, although these are non-cash expenses, the assets being depreciated and amortized may have to be replaced in the future;\n•\nstock-based compensation expense, which has been, and will continue to be for the foreseeable future, a significant recurring expense for our business and an important part of our compensation strategy;\n•\nnet gains or losses on our crypto assets held for investment, net, after the adoption of ASU 2023-08;\n•\nother (income) expense, net, which represents foreign exchange gains or losses, gains or losses on strategic investments, net, gains on the repurchase of certain of our long-term debt, and other non-operating income and expense activity;\n•\nnon-recurring lease charges, which represent a non-recurring fee and write-off related to an early lease termination; \n•\nnon-recurring accrued legal contingencies, settlements, and related costs, which reduces cash available to us;\n•\nimpairment on crypto assets still held, net, which represents impairment on crypto assets still held and is a non-cash expense, prior to the adoption of ASU 2023-08; and\n•\nthe impact of restructuring, which is not related to normal operations but impacted our results in 2023. \n100\nTable \nof\n Contents\nIn addition, other companies, including companies in our industry, may calculate Adjusted EBITDA differently or may use other measures to evaluate their performance, all of which could reduce the usefulness of our disclosure of Adjusted EBITDA as a tool for comparison. A reconciliation is provided below for Adjusted EBITDA to Net income (loss), the most directly comparable financial measure stated in accordance with GAAP. Investors are encouraged to review the related GAAP financial measure and the reconciliation of Adjusted EBITDA to Net income (loss), and not to rely on any single financial measure to evaluate our business.\nRevised definition of Adjusted EBITDA\nDuring the first quarter of 2024, we revised our definition of Adjusted EBITDA as follows and recast the prior period for comparability:\n•\nto adjust for other (income) expense, net in total, as the entire line item represents non-operating activity, and as a majority of the activity recorded in other (income) expense, net had been included in the calculation of Adjusted EBITDA previously in separate rows while this combined presentation is more streamlined and easily reconciled to our Consolidated Statements of Operations; \n•\nto revise our definition of Adjusted EBITDA to remove the adjustment for crypto asset borrowing costs on Prime Financing, as even though these costs are akin to interest expense on debt, we believe they represent normal, recurring, operating expenses necessary to expand and grow Prime Financing; and\n•\nto revise our definition of Adjusted EBITDA to change what is adjusted with respect to gains and losses on crypto assets in connection with the adoption of ASU 2023-08, adjusting post-adoption only for gains and losses on crypto assets held for investment, as they do not represent normal, recurring, operating expenses (or income) necessary to operate our business.\n101\nTable \nof\n Contents\nThe following table provides a reconciliation of Net income (loss) to Adjusted EBITDA. The prior period comparative reconciliation has been updated to conform to the current period presentation (in thousands):\nYear Ended December 31,\n2024\n2023\nNet income\n$\n2,579,066 \n$\n94,871 \nAdjusted to exclude the following:\nProvision for (benefit from) income taxes\n363,578 \n(171,716)\nInterest expense\n80,645 \n82,766 \nDepreciation and amortization\n127,518 \n139,642 \nStock-based compensation expense\n(1)\n912,838 \n780,668 \nGains on crypto assets held for investment, net (post-adoption of ASU 2023-08)\n(687,055)\n— \nOther income, net\n(2)\n(29,074)\n(167,583)\nNon-recurring lease charges\n— \n31,955 \nNon-recurring accrued legal contingencies, settlements, and related costs\n— \n15,000 \nImpairment on crypto assets still held, net (pre-adoption of ASU 2023-08)\n— \n29,481 \nRestructuring\n— \n142,594 \nAdjusted EBITDA\n$\n3,347,516 \n$\n977,678 \nRevised definition no longer adjusts for:\nCrypto asset borrowing costs\n$\n4,807 \nOther impairment expense\n18,793 \nRevised definition newly adjusts for:\nAdditional other income, net\n(3)\n(37,624)\nAdjusted EBITDA, previous definition\n$\n963,654 \n__________________\n(1)\nAmount in 2023 excludes stock-based compensation expense recognized in relation to restructuring, which is included below in the restructuring line in this table. See \nNote 20. Restructuring\n, of the Notes to our Consolidated Financial Statements included in Part II, Item 8 of this Annual Report on Form 10-K for additional details.\n(2)\nSee \nNote\n \n16. Other (Income) Expense, Net\n, of the Notes to our Consolidated Financial Statements included in Part II, Item 8 of this Annual Report on Form 10-K for additional details.\n(3)\nRepresents the portion of Other (income) expense, net that was not previously included as an adjustment to arrive at Adjusted EBITDA. \nLiquidity and Capital Resources\nWe continue to believe our existing cash and cash equivalents and USDC will be sufficient in both the short and long term to meet our requirements and plans for cash, including meeting our working capital and capital expenditure requirements. Our ability to meet our requirements and plans for cash, including meeting our working capital and capital expenditure requirements, will depend on many factors, including market acceptance \nof crypto assets and blockchain technology, our growth, our ability to attract and retain customers on our platform, the continuing market acceptance of our products and services, the introduction of new subscription products and services on our platform, expansion of sales and marketing activities, and overall economic conditions. We anticipate satisfying our short-term cash requirements with our existing cash and cash equivalents \nand \nUSDC\n and \nwith future cash flows from operations and may satisfy our long-term cash requirements additionally with proceeds from a future equity or debt financing. \nThe sale of additional equity would result in additional dilution to our stockholders. The incurrence of additional debt financing would result in debt service obligations, and the instruments governing such debt could provide for operating and financing covenants that would restrict our operation\ns. \n102\nTable \nof\n Contents\nPrimary resources and commitments\nCash and cash equivalents and USDC\nOur cash and cash equivalents and USDC balances consisted of the following (in thousands):\nDecember 31,\n2024\n2023\nCash and cash equivalents\nCash equivalents\n(1)\n$\n6,607,023 \n$\n3,682,917 \nCash held at banks\n1,848,700 \n1,367,643 \nCash held at venues\n88,180 \n88,791 \nTotal cash and cash equivalents\n$\n8,543,903 \n$\n5,139,351 \nUSDC\n(2)\nUSDC loaned\n(3)\n$\n168,795 \n$\n205,645 \nUSDC pledged as collateral\n(3)\n329,832 \n29,577 \nUSDC not loaned or pledged as collateral\n743,181 \n340,806 \nTotal USDC\n$\n1,241,808 \n$\n576,028 \n__________________\n(1)\nCash equivalents consists of money market funds.\n(2)\nUSDC is a stablecoin redeemable on a one-to-one basis for U.S. dollars. While not accounted for as cash or cash equivalents, we treat our USDC holdings as a liquidity resource.\n(3)\nUSDC loaned represents loaned assets that do not meet the criteria for derecognition in our Consolidated Balance Sheets. USDC pledged as collateral represents assets pledged as collateral that do not meet derecognition criteria against our crypto asset borrowings in our Consolidated Balance Sheets. See \nNote 2. Summary of Significant Accounting Policies—Collateralized arrangements and financing \nof the Notes to our Consolidated Financial Statements included in Part II, Item 8 of this Annual Report on Form 10-K for additional details.\nLong-term debt\nOn March 18, 2024, we issued \n$1.3 billion\n in aggregate principal amount of convertible senior notes that mature on April 1, 2030, unless converted, redeemed or repurchased on an earlier date. As of December 31, 2024, we held $4.3 billion in aggregate principal amount of long-term debt. \nAs market conditions warrant, we may, from time to time, repurchase our outstanding long-term debt securities in the open market, in privately negotiated transactions, by exchange transaction, or otherwise. Such repurchases, if any, will depend on prevailing market conditions, our liquidity, and other factors, and may be commenced or suspended at any time. The amounts involved and total consideration paid may be material. In 2023, we repurchased \n$427.0 million\n in aggregate principal amount of our outstanding long-term debt securities for cash payments aggregating \n$303.5 million\n.\nSee \nNote\n \n10. Long-Term Debt \nof the Notes to our Consolidated Financial Statements included in Part II, Item 8 of this Annual Report on Form 10-K for additional details on our long-term debt, including maturities and repurchases.\nAs of \nDecember 31, 2024\n and \n2023\n, our ratings with S&P Global Ratings were \nBB-\n for both issuer credit and senior unsecured debt. As of \nDecember 31, 2024\n and \n2023,\n our ratings with Moody’s Ratings were \nB2\n for corporate family and \nB1\n for guaranteed senior unsecured notes.\n \nOther resources and commitments\nCrypto assets\nThe Company holds crypto assets for investment and operating purposes, as well as borrowed crypto assets and crypto assets held as collateral. Effective January 1, 2024, we adopted ASU 2023-08 using a modified retrospective approach and recognized an associated fair value adjustment of\n $739.5 million\n on \n103\nTable \nof\n Contents\nthe crypto assets we held at that time. This adjustment caused the carrying values of the crypto assets we already held at the time to reflect their fair values and, as such, this adjustment does not represent additional capital resources generated during 2024.\nCrypto assets held for operations\nWe primarily receive crypto assets held for operations as payments for transaction revenue, blockchain rewards, custodial fee revenue, and other subscriptions and services revenue. Our intent is to convert crypto assets received as a form of payment to cash or to use them to fulfill expenses, primarily blockchain rewards, nearly immediately. During times of instability in the crypto assets market, we may not be able to sell our crypto assets at reasonable prices or at all. As a result, our crypto assets held for operations are considered less liquid than our cash and cash equivalents and may not be able to serve as a source of liquidity for us to the same extent as cash and cash equivalents. See \nNote 5. Crypto Assets Held for Operations\n of the Notes to our Consolidated Financial Statements included in Part II, Item 8 of this Annual Report on Form 10-K, for additional details.\nCrypto assets held as collateral\nCrypto assets held as collateral represent institutional customers’ crypto assets pledged as collateral on certain Prime Financing loans. See \nNote 4. Collateralized Arrangements and Financing\n of the Notes to our Consolidated Financial Statements included in Part II, Item 8 of this Annual Report on Form 10-K, for additional details related to collateral held and our obligation to return collateral. As Prime Financing grows, we will continue to evaluate how to best utilize these resources to help fund the growth of this business.\nCrypto assets borrowed and borrowings\nWe borrow crypto assets from eligible institutional customers. These borrowings generally have open-ended terms or have a term of less than one year. \nWe are required to maintain a collateral to loan ratio per our borrowing agreements. Any significant change in crypto asset prices could impact the value of the crypto assets borrowed or the value of crypto assets pledged as collateral\n. \nIf crypto asset prices rise, we will post additional collateral to maintain required collateral loan ratio\ns. We were in compliance with all collateral requirements as of December 31, 2024. See \nNote 4. Collateralized Arrangements and Financing\n of the Notes to our Consolidated Financial Statements included in Part II, Item 8 of this Annual Report on Form 10-K, for additional details relating to crypto assets borrowed and borrowings.\nCrypto assets held for investment\nWe view our crypto asset investments as primarily long-term holdings and we do not and do not plan to engage in regular trading of these crypto assets. In case of a liquidity stress event, or for other episodic purposes, which may necessitate the use of these assets, we may change our policy and sell crypto assets held for investment to generate liquidity. See \nNote 7. Crypto Assets Held for Investment\n of the Notes to our Consolidated Financial Statements included in Part II, Item 8 of this Annual Report on Form 10-K, for additional details.\nCustomer assets and liabilities\nRecognized c\nustomer assets and liabilities comprise customer custodial funds and corresponding customer custodial liabilities that represent our obligation to return these assets to the customers. We also hold additional customer Assets on Platform that we do not recognize in our Consolidated Balance Sheets. See \nKey Business Metrics\n—\nAssets on Platform\n above, and \nNote\n \n2. Summary of Significant Accounting Policies\n—\nCustomer custodial funds and Customer custodial fund liabilities \nof the Notes to our Consolidated Financial Statements included in Part II, Item 8 of this Annual Report on Form 10-K, for additional details. We do not use customer crypto assets as collateral for any loan, margin, rehypothecation, or other similar activities to which we or our affiliates are a party, without the customer’s consent. \n104\nTable \nof\n Contents\n Our business model does not expose us to liquidity risk if we have excessive redemptions or withdrawals from customers. \nAs of December 31, 2024, we have not experienced excessive redemptions or withdrawals, or prolonged suspended redemptions or withdrawals, of crypto assets to date. \nSee \nRisk Factors—Depositing and withdrawing crypto assets into and from our platform involves risks, which could result in loss of customer assets, customer disputes and other liabilities, which could adversely affect our business, operating results, and financial condition \nincluded in Part I, Item 1A of this \nAnnual Report on Form 10-K\n for further information.\nCapital requirements and contractual obligations\nCertain jurisdictions where we operate require us to hold eligible liquid assets, as defined by applicable regulatory requirements and commercial law in these jurisdictions, equal to at least 100% of the aggregate amount of all customer custodial fund liabilities. Depending on the jurisdiction, eligible liquid assets can include cash and cash equivalents, customer custodial funds, and in-transit customer receivables. As of December 31, 2024 and 2023, our eligible liquid assets were greater than the aggregate amount of customer custodial fund liabilities. We are also required to hold corporate liquid assets at our subsidiaries to meet capital requirements established by our regulators based on the value of crypto assets held in custody. As of December 31, 2024, we were in compliance with these capital requirements.\nAs of \nDecember 31, 2024\n, our material cash requirements and contractual obligations arising in the normal course of business due within the next 12 months and in total consisted of the following (in thousands):\nAmounts Due\nNext 12 Months\nTotal\nOperating leases\n(1)\n$\n9,885 \n$\n132,327 \nNon-cancelable purchase obligations\n(2)\n119,874 \n198,486 \nLong-term debt\n(3)\nInterest\n70,010 \n349,089 \nPrincipal\n— \n4,275,470 \nTotal\n$\n199,769 \n$\n4,955,372 \n_______________\n(1)    Primarily relating to lease payments due for corporate offices. See \nNote 12. Other Consolidated Balance Sheets Details\n of the Notes to our Consolidated Financial Statements included in Part II, Item 8 of this Annual Report on Form 10-K, for additional details.\n(2)    Committed spend for non-cancellable purchase obligations greater than $2.0 million per obligation, primarily relating to technology and marketing.\n(3)    Assumes that our long-term debt is not repurchased, redeemed, or converted prior to maturity. See \nNote 10. Long-Term Debt\n of the Notes to our Consolidated Financial Statements included in Part II, Item 8 of this Annual Report on Form 10-K, for additional details.\nSee \nNotes 12. Other Consolidated Balance Sheets Details, 17. Income Taxes, \nand \n21. Commitments and Contingencies\n of the Notes to our Consolidated Financial Statements included in Part II, Item 8 of this Annual Report on Form 10-K, for additional details relating to our short- and long-term material cash requirements and contractual obligations as of December 31, 2024.\nIn October 2024, our board of directors authorized a share repurchase program of up to $1.0 billion of our Class A common stock without expiration (the “Share Repurchase Program”). Repurchases may be made at management’s discretion from time to time on the open market (including through trading plans intended to qualify under Rule 10b5-1 under the Exchange Act), through privately negotiated transactions, or by other methods in accordance with applicable securities laws and other restrictions. The timing and amount of any repurchases will depend on market conditions and other considerations. The Share Repurchase Program does not obligate us to repurchase any dollar amount or number of shares of our Class A common stock, and the program may be modified, suspended, or discontinued at any time. We anticipate that repurchases under the Share Repurchase Program will be funded using our existing cash \n105\nTable \nof\n Contents\nand cash equivalents and USDC and with future cash flows from operations. As of December 31, 2024, no shares have been repurchased under the Share Repurchase Program.\nCash flows \nThe following table summarizes our Consolidated Statements of Cash Flows (in thousands):\nYear Ended December 31,\n2024\n2023\nNet cash provided by operating activities\n$\n2,556,844 \n$\n922,951 \nNet cash (used in) provided by investing activities\n(282,385)\n5,392 \nNet cash provided by (used in) financing activities\n2,828,921 \n(811,332)\nNet increase in cash, cash equivalents, and restricted cash and cash equivalents\n$\n5,103,380 \n$\n117,011 \nChange in customer custodial cash and cash equivalents\n$\n1,634,934 \n$\n(585,666)\n \nOperating activities\nOur largest source of cash provided by operations are revenues generated from transaction fees. Our primary uses of cash from operating activities include payments to employees for compensation, website hosting and infrastructure services, and professional services.\nNet cash provided by operating activities increased by $1.6 billion for the year ended December 31, 2024 as compared to 2023 primarily due to:\n•\nan increase in cash as a result of the $3.5 billion increase in total revenue; offset in part by\n•\na $801.7 million increase in cash used to purchase USDC in order to facilitate growth in Prime Financing as well as to provide liquidity for normal business operations;\n•\na $115.2 million increase in cash used for annual employee performance compensation given our strong financial performance during the prior year;\n•\na $106.1 million increase in cash used to pay income taxes; and\n•\nan overall increase in other cash expenses as we continue to grow our business.\nInvesting activities\nNet cash used in investing activities increased by $287.8 million for the year ended December 31, 2024 as compared to 2023 due to:\n•\nan increase of $138.6 million in cash used for the origination of fiat loans, net of repayments, reflecting growth in Prime Financing and lower net cash inflows in 2024 related to the discontinuation of a retail lending program; and\n•\n$41.6 million in cash provided by net sales of crypto assets held for investment for the year ended December 31, 2024, as compared to $184.0 million in cash provided by net sales of crypto assets held prior to the adoption of ASU 2023-08 for the year ended December 31, 2023. \nFinancing activities\nNet cash provided by financing activities increased by $3.6 billion for the year ended December 31, 2024 as compared to 2023 primarily due to:\n•\na $1.9 billion increase in customer custodial cash attributable to increased Trading Volume; \n106\nTable \nof\n Contents\n•\na $1.1 billion net increase in cash due to proceeds from the issuance of our 2030 Convertible Notes less cash paid for associated capped calls; \n•\na $303.5 million decrease in cash outflows in 2024 related to long-term debt repurchases in 2023; and\n•\na $22.5 million net increase in recognized fiat collateral pledged by institutional customers related to Prime Financing loans. \nCritical Accounting Estimates\n \nOur Consolidated Financial Statements and the related notes included elsewhere in this Annual Report on Form 10-K are prepared in accordance with GAAP. The preparation of our Consolidated Financial Statements also requires us to make estimates and assumptions that affect the reported amounts of assets, liabilities, revenue, costs, and expenses and related disclosures. We base our estimates on historical experience and on various other assumptions that we believe to be reasonable under the circumstances. Actual results could differ significantly from our estimates. To the extent that there are differences between our estimates and actual results, our future financial statement presentation, financial condition, operating results, and cash flows will be affected.\nSee \nNote 2. Summary of Significant Accounting Policies\n of the Notes to our Consolidated Financial Statements included in Part II, Item 8 of this Annual Report on Form 10-K for a summary of significant accounting policies and significant estimates and assumptions and their effects on our financial statements. Below are the significant estimates and assumptions that we consider critical because they involve a significant amount of estimation uncertainty and have had or are reasonably likely to have a material impact on our financial condition or results of operations.\nBusiness combinations, goodwill, and intangible assets\nWe determined that business combinations, goodwill, and intangible assets represent critical accounting estimates, as they involve significant judgment, estimates, and assumptions and to the extent that our estimates and assumptions materially change or if actual circumstances differ from those in the assumptions, our financial statements could be materially impacted. \nWe account for our business combinations using the acquisition method of accounting, which requires, among other things, allocation of the fair value of purchase consideration to the tangible and intangible assets acquired and liabilities assumed at their estimated fair values on the acquisition date. When determining the fair value of assets acquired and liabilities assumed, we make significant estimates and assumptions, especially with respect to non-crypto intangible assets. These intangible assets do not have observable prices and have primarily consisted of customer relationships, developed technology, licenses, trademarks and trade names, and non-compete agreements, which are subsequently measured at acquisition date fair value, less accumulated amortization. These estimates and assumptions can include, but are not limited to, the cash flows that an asset is expected to generate in the future, the appropriate weighted-average cost of capital, the number of working hours required to recreate the intangible asset (if following the cost approach), and the estimated useful lives. Changes in these assumptions could affect the carrying value of these assets. Our estimates of fair value are based upon assumptions believed to be reasonable, but which are inherently uncertain and, as a result, actual results may differ from estimates.\nGoodwill\nWe perform an impairment test annually in the fourth quarter or whenever events or changes in circumstances indicate that the carrying value of goodwill might not be fully recoverable. In accordance with applicable accounting guidance, a company can assess qualitative factors to determine whether it is necessary to perform a goodwill impairment test. Alternatively, a company may elect to proceed directly to a quantitative goodwill impairment test. We do the former and assess qualitative factors to determine whether it is necessary to perform a goodwill impairment test. We review factors including changes in our \n107\nTable \nof\n Contents\nstock price, macroeconomic conditions, industry and market conditions, cost factors, overall financial performance, changes in any key personnel, and any changes in the composition of the carrying amount of our assets. There were no changes to the qualitative factors considered indicating an impairment of goodwill for the reporting periods presented. In the future, if there are material changes in the underlying estimates and assumptions pertaining to the impairment assessment, our financial statements could be materially impacted. For the reporting periods presented, we determined that it was more likely than not that the fair value of our reporting unit was more than the respective related carrying amounts, including goodwill, and therefore we did not record any goodwill impairment.\nIntangible assets\nIntangible assets are initially valued at fair value using generally accepted valuation methods appropriate for the type of intangible asset. Intangible assets with definite lives are amortized over their estimated useful lives and are reviewed for impairment if indicators of impairment arise. Intangible assets assessed as having indefinite lives are not amortized, but are assessed for indicators that the useful life is no longer indefinite or for indicators of impairment each period. Indicators we review, as applicable, include whether there has been a significant adverse change in the extent or manner in which our assets are being used, a significant adverse change in legal factors affecting our assets, customer attrition, and/or a cash flow loss. Due to the dynamic nature of our business and the regulatory environment in which we operate, it is not practicable to model sensitivity of the valuation of these assets to these factors. Each reporting period, we evaluate the estimated remaining useful life of our intangible assets and whether events or changes in circumstances warrant a revision to the remaining period of amortization. We did not identify indicators of impairment of our intangible assets during the reporting periods presented. In the future, if there are material changes in the underlying estimates and assumptions pertaining to the impairment assessment, our financial statements could be materially impacted.\nStrategic investments\nWe hold strategic investments in privately held companies in the form of equity securities without readily determinable fair values in which we do not have a controlling interest or significant influence. The vast majority of these investments are accounted for under the measurement alternative method (“the measurement alternative”) and are measured at cost, less impairment, subject to upward and downward adjustments resulting from observable price changes for identical or similar investments of the same issuer (“pricing adjustments”). We determined that valuation of privately-held strategic investments represents a critical accounting estimate because impairment evaluations involve significant judgment, estimates, and assumptions, and to the extent that these estimates and assumptions change materially or if actual circumstances differ from those in the assumptions, our financial statements could be materially impacted.  \nPricing adjustments\nPricing adjustments require quantitative assessments of the fair value of our strategic investments, which may require the use of unobservable inputs. Pricing adjustments are determined by using various valuation methodologies and involve the use of estimates using the best information available, which may include cash flow projections or other available market data.\n \nImpairment\nPrivately-held strategic investments are evaluated quarterly for impairment. Our qualitative analysis includes a review of indicators such as: operating results when available, business prospects of the investees, changes in the regulatory and macroeconomic environment, observable price changes in similar transactions, and general market conditions of the geographical area or industry in which our investees operate. If indicators of impairment exist, we prepare quantitative measurements of the fair value of our equity investments using an Option-Pricing Model that uses publicly available market data of comparable companies and other unobservable inputs including expected volatility, expected time to \n108\nTable \nof\n Contents\nliquidity, adjustments for other company-specific developments, and the rights and obligations of the securities we hold. When the quantitative remeasurements of fair value indicate an impairment exists, we write down the investment to its current fair value. \nWe anticipate volatility to our net income (loss) in future periods due to changes in the fair values associated with these investments and changes in observable prices and similar transactions that could impact our fair value assessments. Based on future market conditions, these changes could be material to our financial statements. For more information regarding these market conditions and related sensitivity, see the section titled “",
  "item2": null
}