{
  "source_file": "coin-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "ITEM 2. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe following discussion and analysis of our financial condition and results of operations should be read in conjunction with our Condensed Consolidated Financial Statements and the accompanying notes thereto included elsewhere\n in this Quarterly Report on Form 10-Q \nand our Annual Report on Form 10-K for the year ended \nDecember 31, 2024 (the “Annual Report”)\n.\n Th\ne following discussion and analysis contains forward-looking statements that involve risks and uncertainties, as well as assumptions that, if they never materialize or prove incorrect, could cause our results to differ materially from those expressed or implied by such forward-looking statements. Factors that could cause or contribute to these differences include, \nbut are not limited to, those identified below and those discussed in the section titled Risk Factors in Part II, Item 1A of this Quarterly Report on Form 10-Q\n. Unless otherwise expressly stated or the context otherwise requires, references to “we,” “ou\nr,” “us,” “the Company,” and “Coinbase” refer to Coinbase Global, Inc. and its consolidated subsidiaries. For all narrative provided in this Item 2, two numbers presented consecutively represent figures for the three and nine months ended September 30, 2025 as compared to the corresponding periods in 2024, respectively, unless otherwise noted. \nExecutive Overview\nThis executive overview of Management’s Discussion and Analysis of Financial Condition and Results of Operations highlights selected information and does not contain all of the information that is important to readers of this Quarterly Report on Form 10-Q. \nDuring the third quarter of 2025, we continued to make progress towards our mission by expanding access to trading through innovative derivative products, listing more spot assets, and expanding our offerings in markets globally. We completed the acquisition of Deribit in August, which we believe will play \n32\nTable of \nContents\na key role in our goal to be the premier global platform for crypto derivatives, and we launched U.S. perpetual futures. We continue to scale payments with USDC, which reached an all-time high in market capitalization, new partnerships, and crypto rewards for purchases through the Coinbase One Card.\nFor the three and nine months ended September 30, 2025, our net revenue was $1.8 billion and $5.2 billion, respectively, including $1.0 billion and $3.1 billion in transaction revenue and $746.7 million and $2.1 billion in subscription and services revenue. For the same periods in 2024, our net revenue was $1.1 billion and $4.1 billion, respectively, including $572.5 million and $2.4 billion in transaction revenue and $556.1 million and $1.7 billion in subscription and services revenue. \nFor the three and nine months ended September 30, 2025, our net income was $432.6 million and $1.9 billion, and Adjusted EBITDA was $800.7 million and $2.2 billion. For the same periods in 2024, our net income was $75.5 million and $1.3 billion, and Adjusted EBITDA was $448.6 million and $2.1 billion. \nDespite multiple Federal Funds Rate decreases in late 2024 and 2025, future interest rate decreases are not certain. If interest rates continue to decline, they may materially impact our subscription and services and other revenue. We plan to dynamically adjust our expense base in order to be responsive to market conditions and revenue opportunities, increasing or decreasing it as needed, especially with respect to certain variable expenses. In the fourth quarter of 2025, we expect technology and development and general and administrative expenses to increase as compared to the third quarter of 2025, primarily driven by a full fourth quarter of Echo and Deribit expenses and headcount growth. Additionally, we expect sales and marketing expenses to generally be in line with the third quarter of 2025, reflecting inclusion of a full fourth quarter of Deribit expenses, and dependent on USDC balances in Coinbase products and performance marketing opportunities throughout the quarter.\nKey Business Metrics\nIn addition to the measures presented in our Condensed Consolidated Financial Statements, we use the key business metrics listed below to evaluate our business, measure our performance, identify trends affecting our business, and make strategic decisions:\nThree Months Ended September 30,\nChange\nNine Months Ended September 30,\nChange\n2025\n2024\n%\n2025\n2024\n%\nMTUs\n(1)\n \n(in millions)\n9.3 \n7.8 \n19 \n9.2 \n8.0 \n15 \nAssets on Platform\n(2)\n \n(in billions)\n$\n516 \n$\n264 \n95 \n$\n516 \n$\n264 \n95 \nTrading Volume \n(in billions)\n$\n295 \n$\n185 \n59 \n$\n925 \n$\n723 \n28 \nNet income \n(in millions)\n$\n433 \n$\n75 \n477 \n$\n1,927 \n$\n1,288 \n50 \nAdjusted EBITDA\n(3) \n(in millions)\n$\n801 \n$\n449 \n78 \n$\n2,243 \n$\n2,058 \n9 \n_____________\n(1)\nMTUs for the three month period r\nepresent quarterly MTUs, which are calculated as the average of each month’s MTUs in each respective quarter. MTUs fo\nr the nine month period are calculated as the average of the quarterly MTUs within the period. \n(2)\nRepresents Assets on Platform as of September 30, 2025 and 2024. \n(3)\nS\nee the section titled “\nNon-GAAP Financial Measure\n” below for a reconciliation of net income to Adjusted EBITDA and an explanation for why we consider Adjusted EBITDA to be a helpful metric for investors.\nMonthly Transacting Users\nWe define a Monthly Transacting User (“MTU”) as a consumer who actively or passively transacts in one or more products on our platform at least once during the rolling 28-day period ending on the date of measurement. MTUs engage in transactions that generate both transaction revenue and subscription and services revenue. Revenue-generating transactions include active transactions, such as buying or selling crypto assets or passive transactions such as earning staking rewards and USDC rewards. MTUs also engage in transactions that are non-revenue generating, such as consumers sending and receiving crypto assets between wallets and off-platform accounts on a non-expedited basis. MTUs may overstate the number of unique consumers due to differences in product architecture or user behavior.  \n33\nTable of \nContents\nMTUs\n \nincreased\n \nfor the three and nine months ended September 30, 2025 as compared to 2024, primarily due to an increase in trading users, influenced by overall crypto market sentiment and activity, including higher average prices for certain crypto assets.\nAssets on Platform\nWe define Assets on Platform (“AOP”) as the total United States (“U.S.”) dollar equivalent value of USDC and crypto assets held or managed on behalf of customers in digital wallets on our platform, including our custody services but excluding assets for which the customer holds full or partial keys, calculated based on the market price on the date of measurement. AOP demonstrates the scale of balances held across our suite of products and services, the trust customers place in us to securely store their assets, and the underlying growth of the cryptoeconomy. AOP also represents a monetization opportunity through our products and services, including from trading and the adoption and use of USDC, staking, custody, and institutional financing, when customers use these assets to engage with these products and services. \nThe following table sets forth the value of AOP by asset (in thousands, except percentages): \nSeptember 30, 2025\nSeptember 30, 2024\nChange %\nBitcoin\n$\n331,888,856 \n$\n143,175,731 \n132 \nEthereum\n77,429,660 \n41,869,410 \n85 \nXRP\n25,833,007 \n3,836,125 \n573 \nSolana\n22,757,398 \n17,865,901 \n27 \nUSDC\n9,012,935 \n4,738,829 \n90 \nOther crypto assets\n(1)\n49,020,050 \n52,598,759 \n(7)\nTotal\n$\n515,941,906 \n$\n264,084,755 \n95 \n__________________\n(1)\nIncludes various other crypto asset balances, none of which individually represented more than 5% of total AOP. \nAOP at September 30, 2025 increased as compared to September 30, 2024, primarily reflecting higher Bitcoin AOP, including $114.8 billion of growth attributable to price and $73.9 billion of growth attributable to units. Separately, we attribute the growth in USDC AOP primarily to our USDC rewards program, combined with deeper integration of USDC across our products.\nTrading Volume\nWe define Trading Volume as the total U.S. dollar equivalent value of spot matched trades transacted between a buyer and seller through our platform during the period of measurement. Trading Volume does not include derivatives volume on our platform or trades executed on third-party venues. Trading Volume represents the product of the quantity of assets transacted and the trade price at the time the transaction was executed. As trading activity directly impacts transaction revenue, we believe this measure is a reflection of liquidity on our order books, trading health, and the underlying growth of the cryptoeconomy. Institutions incur lower fees per transaction than consumers and, as a result, the impact of changes in consumer Trading Volume on transaction revenue is more pronounced than the impact of changes in institutional Trading Volume. \nGenerally, Trading Volume on our platform is primarily influenced by overall market dynamics, namely the price of crypto assets, crypto asset volatility, and macroeconomic conditions, and by our share of total crypto market spot trading volume. In periods of high crypto asset prices and crypto asset volatility, we have generally experienced correspondingly high levels of Trading Volume. In recent quarters, we have also seen market events, product announcements, and competition as influential factors. \n34\nTable of \nContents\nThree Months Ended \nSeptember 30,\nChange\nNine Months Ended \nSeptember 30,\nChange\n2025\n2024\n%\n2025\n2024\n%\nTrading Volume (in billions)\nConsumer\n$\n59\n$\n34\n74 \n$\n180\n$\n127\n42 \nInstitutional\n236\n151\n56 \n745\n596\n25 \nTotal Trading Volume\n$\n295\n$\n185\n59 \n$\n925\n$\n723\n28 \nTrading Volume by crypto asset\nBitcoin\n24\n%\n37\n%\n(35)\n27\n%\n35\n%\n(23)\nEthereum\n22 \n15 \n47 \n15 \n14 \n7 \nXRP\n9\n2 \n350 \n10 \n2 \n400 \nUSDT\n3\n15 \n(80)\n8 \n11 \n(27)\nOther crypto assets\n(1)\n42 \n31 \n35 \n40 \n38 \n5 \nTotal\n100%\n100%\n100%\n100%\n____________________________________\n(1)\nIncludes various other crypto assets, none of which \nindividually represented more than 10% of our total Trading Volume. \nFor the three and nine months ended September 30, 2025 as compared to 2024, Trading Volume increased primarily reflecting an increase of 66% and 27% in global crypto market spot trading volume (the USD equivalent value of all matched trades transacted between buyers and sellers across all exchanges), as well as due to increases in our share of this market volume for the crypto assets that comprise the majority of our Trading Volume. These increases were offset in part by a decrease of $39.7 billion and $34.9 billion attributed to a decline in our share of stablecoin pair market volume driven by an intentional pricing change made in March of 2025 as we evolved our stablecoin strategy. \nResults of Operations\n \nComparison of the three and nine months ended\n \nSeptember 30, 2025 and 2024\nRevenue\nFor the three and nine months ended September 30, 2025, we generated 81% and 84% of total revenue in the U.S. For the three and nine months ended September 30, 2024, we generated 86% and 84% of total revenue in the U.S. No other country accounted for more than 10% of total revenue during the periods presented. International revenue comprised mainly transaction revenue in all periods presented.\nTransaction revenue\nThree Months Ended \nSeptember 30,\nChange\nNine Months Ended \nSeptember 30,\nChange\n(in thousands, except %)\n2025\n2024\n$\n%\n2025\n2024\n$\n%\nConsumer, net\n$\n843,544 \n$\n483,261 \n$\n360,283 \n75 \n$\n2,588,958 \n$\n2,083,245 \n$\n505,713\n24 \nInstitutional, net\n135,009 \n55,293 \n79,716 \n144 \n294,716 \n204,309 \n90,407 \n44 \nOther transaction revenue, net\n67,707 \n33,950 \n33,757 \n99 \n189,064 \n142,593 \n46,471 \n33 \nTotal transaction revenue\n$\n1,046,260 \n$\n572,504 \n$\n473,756 \n83 \n$\n3,072,738 \n$\n2,430,147 \n$\n642,591\n26 \n% of net revenue\n58 \n51 \n59 \n59 \nTransaction revenue increased for the three and nine months ended September 30, 2025 as compared to 2024, due primarily to:\n•\nan increase in consumer transaction revenue driven by:\n◦\nan increase of $373.7 million and $839.0 million attributed to a 74% and 42% increase in consumer Trading Volume; which for the nine month comparative period, was offset in part by \n35\nTable of \nContents\n◦\na decrease of $333.3 million attributed to a lower average blended fee rate, primarily due to changes in the mix of Trading Volume from Simple to Advanced trading, as well as growth in Trading Volume from Coinbase One users; and\n•\nan increase in institutional transaction revenue driven primarily by: \n◦\nan increase of $55.1 million and $69.1 million attributed to derivatives trading, due mainly to the acquisition of Deribit; and\n◦\nan increase of $26.3 million and $45.5 million attributed to 56% and 25% growth in institutional Trading Volume.\nThere were no material changes to note within other transaction revenue.\nThe percentage of transaction revenue from trading on our platform by crypto asset was as follows:\nThree Months Ended \nSeptember 30,\nChange\nNine Months Ended \nSeptember 30,\nChange\n2025\n2024\n%\n2025\n2024\n%\nBitcoin\n24%\n35%\n(31)\n26%\n32%\n(19)\nXRP\n14\n6\n133 \n15\n3\n400 \nEthereum\n17\n16\n6 \n12\n15\n(20)\nSolana\n7\n11\n(36)\n8\n6\n33 \nOther crypto assets\n(1)\n38\n32\n19 \n39\n44\n(11)\nTotal\n100%\n100%\n100%\n100%\n____________________________________\n(1)\nIncludes various other crypto assets, none of which individually represented more than 10% of our total transaction revenue.\nSubscription and services revenue\nThree Months Ended \nSeptember 30,\nChange\nNine Months Ended \nSeptember 30,\nChange\n(in thousands, except %)\n2025\n2024\n$\n%\n2025\n2024\n$\n%\nStablecoin revenue\n$\n354,661 \n$\n246,856 \n$\n107,805 \n44 \n$\n984,693 \n$\n684,609 \n$\n300,084 \n44 \nBlockchain rewards\n184,647 \n154,815 \n29,832 \n19 \n525,774 \n490,883 \n34,891 \n7 \nInterest and finance fee income\n64,758 \n63,987 \n771 \n1 \n187,160 \n200,050 \n(12,890)\n(6)\nOther subscription and services revenue\n142,658 \n90,435 \n52,223 \n58 \n403,034 \n290,527 \n112,507 \n39 \nTotal subscription and services revenue\n$\n746,724 \n$\n556,093 \n$\n190,631 \n34 \n$\n2,100,661 \n$\n1,666,069 \n$\n434,592 \n26 \n% of net revenue\n42 \n49 \n41 \n41 \nSubscription and services revenue increased for the three and nine months ended September 30, 2025 as compared to 2024, reflecting:\n•\nincreases in stablecoin revenue of:\n◦\n$107.1 million and $310.4 million due to higher average USDC balances held in Coinbase products\n1\n, on which we earn the vast majority of the interest on the associated reserves; and\n◦\n$79.6 million and $218.9 million due to higher average USDC off-platform balances, on which we earn varying percentages depending on where the USDC is held; offset in part by\n1\n \nIncludes corporate USDC balances and USDC held on behalf of customers in eligible Coinbase products.\n36\nTable of \nContents\n◦\na decrease of $79.8 million and $225.6 million due to lower average interest rates, which declined 93 and 95 basis points;\n•\nincreases in blockchain rewards for the three months ended comparative period, driven by higher average crypto asset prices, primarily for Ethereum and Solana; and\n•\nan increase in other subscription and services revenue, primarily due to growth of Coinbase One, reflecting a higher number of paid subscribers.\nThere were no material changes to note within interest and finance fee income.\nOther revenue\nThree Months Ended \nSeptember 30,\nChange\nNine Months Ended \nSeptember 30,\nChange\n(in thousands, except %)\n2025\n2024\n$\n%\n2025\n2024\n$\n%\nCorporate interest and other income\n$\n75,709 \n$\n76,596 \n$\n(887)\n(1)\n$\n226,797 \n$\n196,175 \n$\n30,622 \n16 \nTotal other revenue\n$\n75,709 \n$\n76,596 \n$\n(887)\n(1)\n$\n226,797 \n$\n196,175 \n$\n30,622 \n16 \nOther revenue changed for the three and nine months ended September 30, 2025 as compared to 2024, largely reflecting an increase of $22.7 million and $73.7 million due to higher average cash and cash equivalents balances, offset by lower average interest rates earned on these balances, which declined 114 and 98 basis points. \nOperating expenses\nCertain prior period amounts have been reclassified to conform to the current period presentation. \nTransaction expense\nThree Months Ended \nSeptember 30,\nChange\nNine Months Ended \nSeptember 30,\nChange\n(in thousands, except %)\n2025\n2024\n$\n%\n2025\n2024\n$\n%\nBlockchain rewards fees\n$\n119,043 \n$\n107,576 \n$\n11,467 \n11 \n$\n328,221 \n$\n327,430 \n$\n791 \n— \nTransaction rebates and commissions\n42,193 \n17,679 \n24,514 \n139 \n188,640 \n48,460 \n140,180 \n289 \nPayment processing and account verification\n53,487 \n30,501 \n22,986 \n75 \n159,464 \n100,630 \n58,834 \n58 \nTransaction reversal losses\n28,983 \n11,388 \n17,595 \n155 \n96,682 \n35,790 \n60,892 \n170 \nOther\n9,612 \n4,637 \n4,975 \n107 \n28,598 \n68,355 \n(39,757)\n(58)\nTotal transaction expense\n$\n253,318 \n$\n171,781 \n$\n81,537 \n47 \n$\n801,605 \n$\n580,665 \n$\n220,940 \n38 \n% of net revenue\n14 \n15 \n15 \n14 \nTransaction expense increased for the three and nine months ended September 30, 2025 as compared to 2024, reflecting: \n•\nhigher transaction rebates and commissions, primarily those earned by institutional customers providing liquidity on our international exchange, driven by growth in volume; \n•\nan increase in payment processing fees, due primarily to increased volumes of payments processed; and\n•\nan increase in transaction reversal losses primarily driven by higher transaction volume; which for the nine month comparative period, was offset in part by\n•\na decrease in blockchain transaction fees within other, primarily due to lower average Ethereum gas fees. \n37\nTable of \nContents\nThere were no material changes to note within blockchain rewards fees.\nTechnology and development\nThree Months Ended \nSeptember 30,\nChange\nNine Months Ended \nSeptember 30,\nChange\n(in thousands, except %)\n2025\n2024\n$\n%\n2025\n2024\n$\n%\nEmployee-related\n$\n271,440 \n$\n271,272 \n$\n168 \n— \n$\n749,843 \n$\n790,475 \n$\n(40,632)\n(5)\nWebsite hosting and infrastructure\n84,885 \n60,600 \n24,285 \n40 \n228,468 \n167,097 \n61,371 \n37 \nAmortization, depreciation, and impairment\n37,138 \n27,489 \n9,649 \n35 \n103,735 \n89,798 \n13,937 \n16 \nOther\n37,122 \n18,079 \n19,043 \n105 \n91,229 \n52,191 \n39,038 \n75 \nTotal technology and development\n$\n430,585 \n$\n377,440 \n$\n53,145 \n14 \n$\n1,173,275 \n$\n1,099,561 \n$\n73,714 \n7 \n% of net revenue\n24 \n33 \n23 \n27 \nTechnology and development expenses increased for the three and nine months ended September 30, 2025 as compared to 2024, reflecting:\n•\nchanges in employee-related expenses driven by lower stock-based compensation expense (see \nNote 14. Stock-Based Compensation \nof the Notes to our Condensed Consolidated Financial Statements included in Part I, Item 1 of this Quarterly Report on Form 10-Q for additional details) primarily associated with non-recurring awards, offset in part by an increase due to higher average headcount supporting international expansion and new product initiatives; and\n•\nan increase in website hosting and infrastructure expenses driven by increased capacity to support activity on our platform. \nThere were no material changes to note within amortization, depreciation, and impairment, or other. \nSales and marketing\nThree Months Ended \nSeptember 30,\nChange\nNine Months Ended \nSeptember 30,\nChange\n(in thousands, except %)\n2025\n2024\n$\n%\n2025\n2024\n$\n%\nMarketing programs\n$\n88,148 \n$\n55,068 \n$\n33,080 \n60 \n$\n283,140 \n$\n148,405 \n$\n134,735 \n91 \nUSDC rewards\n111,570 \n61,614 \n49,956 \n81 \n314,125 \n144,739 \n169,386 \n117 \nEmployee-related\n37,309 \n39,805 \n(2,496)\n(6)\n103,084 \n113,655 \n(10,571)\n(9)\nOther\n23,245 \n8,283 \n14,962 \n181 \n43,451 \n21,818 \n21,633 \n99 \nTotal sales and marketing\n$\n260,272 \n$\n164,770 \n$\n95,502 \n58 \n$\n743,800 \n$\n428,617 \n$\n315,183 \n74 \n% of net revenue\n15 \n15 \n14 \n10 \nSales and marketing expenses increased for the three and nine months ended September 30, 2025 as compared to 2024, primarily due to:\n•\nan increase in marketing program expenses largely due to higher digital advertising and brand spend, including corporate sponsorships and go-to-market efforts; and\n•\nan increase in USDC rewards primarily reflecting growth in average customer USDC balances held in Coinbase products\n2\n as we continue to integrate USDC across our products.\nThere were no material changes to note within employee-related or other. \n2\n \nComprises USDC held on behalf of customers in eligible Coinbase products.\n38\nTable of \nContents\nGeneral and administrative\nThree Months Ended \nSeptember 30,\nChange\nNine Months Ended \nSeptember 30,\nChange\n(in thousands, except %)\n2025\n2024\n$\n%\n2025\n2024\n$\n%\nEmployee-related\n$\n183,869 \n$\n154,519 \n$\n29,350 \n19 \n$\n498,667 \n$\n460,420 \n$\n38,247 \n8 \nProfessional services\n76,690 \n48,444 \n28,246 \n58 \n205,876 \n138,374 \n67,502 \n49 \nCustomer support\n(1)\n44,953 \n31,263 \n13,690 \n44 \n169,998 \n79,432 \n90,566 \n114 \nOther\n112,934 \n96,161 \n16,773 \n17 \n291,958 \n259,512 \n32,446 \n13 \nTotal general and administrative\n$\n418,446 \n$\n330,387 \n$\n88,059 \n27 \n$\n1,166,499 \n$\n937,738 \n$\n228,761 \n24 \n% of net revenue\n23 \n29 \n23 \n23 \n____________________________________\n(1)\nExcludes employee-related and professional services expenses.\nGeneral and administrative expenses increased for the three and nine months ended September 30, 2025 as compared to 2024, primarily due to: \n•\nan increase in employee-related expenses primarily due to higher average headcount; \n•\nan increase in professional services due to increased use of legal advisory services, including those relating to business combinations and strategic investments; and\n•\nan increase in customer support costs as a result of increased capacity needs and enhancement of our customer service function. \nThere were no material changes to note within other.\nGains on crypto assets held for operations, net\n \nThree Months Ended \nSeptember 30,\nChange\nNine Months Ended \nSeptember 30,\nChange\n(in thousands, except %)\n2025\n2024\n$\n%\n2025\n2024\n$\n%\nGains on crypto assets held for operations, net\n$\n(35,740)\n$\n(142)\n$\n(35,598)\nnm\n$\n(10,077)\n$\n(55,484)\n$\n45,407 \n(82)\n_________________\nnm - not meaningful\nChanges in gains on crypto assets held for operations, net resulted primarily from holding these assets during periods of increasing crypto asset prices. Though both gross inflows and outflows of these assets were $0.3 billion and $1.1 billion during the three and nine months ended September 30, 2025, and \n$0.2 billion\n and \n$1.3 billion during\n the same periods in 2024, gains and losses on changes in the fair value of the assets were limited as these assets are converted to cash or used for expenses nearly immediately after receipt.\nOther operating expense (income), net\n \nThree Months Ended \nSeptember 30,\nChange\nNine Months Ended \nSeptember 30,\nChange\n(in thousands, except %)\n2025\n2024\n$\n%\n2025\n2024\n$\n%\nPlatform-related incidents \n$\n47,976 \n$\n— \n$\n47,976 \nnm\n$\n355,350 \n$\n32,598 \n$\n322,752 \n990 \nOther \n13,304 \n(8,556)\n21,860 \n(255)\n8,056 \n(4,395)\n12,451 \n(283)\nTotal other operating expense (income), net\n$\n61,280 \n$\n(8,556)\n$\n69,836 \n(816)\n$\n363,406 \n$\n28,203 \n$\n335,203 \nnm\n__________________\nnm - not meaningful\n39\nTable of \nContents\nOther operating expense (income), net increased for the three and nine months ended September 30, 2025 as compared to 2024, primarily due to losses directly associated with the incident announced on the Current Report on Form 8-K we filed with the SEC on May 15, 2025 (the “Data Theft Incident”), comprising voluntary customer reimbursements and direct legal costs. There were no other material changes to note within other operating expense (income), net. \nInterest expense\nThree Months Ended \nSeptember 30,\nChange\nNine Months Ended \nSeptember 30,\nChange\n(in thousands, except %)\n2025\n2024\n$\n%\n2025\n2024\n$\n%\nInterest expense\n$\n21,774 \n$\n20,530 \n$\n1,244 \n6 \n$\n62,820 \n$\n60,108 \n$\n2,712 \n5 \nThere were no material changes to note within interest expense. \n(Gains) losses on crypto assets held for investment, net \nThree Months Ended \nSeptember 30,\nChange\nNine Months Ended \nSeptember 30,\nChange\n(in thousands, except %)\n2025\n2024\n$\n%\n2025\n2024\n$\n%\n(Gains) losses on crypto assets held for investment, net\n$\n(423,903)\n$\n120,507 \n$\n(544,410)\n(452)\n$\n(189,305)\n$\n(210,902)\n$\n21,597 \n(10)\nChanges in (gains) losses on crypto assets held for investment, net during all periods presented resulted primarily from fair value remeasurement of these assets, mainly Bitcoin and Ethereum. The impact of these changes in fair value expanded beginning late in the first quarter of 2025 as we have actively increased our investment in Bitcoin since then.\nOther expense (income), net \nThree Months Ended \nSeptember 30,\nChange\nNine Months Ended \nSeptember 30,\nChange\n(in thousands, except %)\n2025\n2024\n$\n%\n2025\n2024\n$\n%\nLosses (gains) on investments, net\n$\n400,250 \n$\n478 \n$\n399,772 \nnm\n$\n(1,075,198)\n$\n15,141 \n$\n(1,090,339)\nnm\nOther\n(19,732)\n(40,583)\n20,851 \n(51)\n(45,001)\n(37,024)\n(7,977)\n22 \nTotal other expense (income), net\n$\n380,518 \n$\n(40,105)\n$\n420,623 \nnm\n$\n(1,120,199)\n$\n(21,883)\n$\n(1,098,316)\nnm\n__________________\nnm - not meaningful\n \n \nOther expense (income), net changed for the three and nine months ended September 30, 2025 as compared to 2024, due primarily to the fair value remeasurement of our investment in Circle Internet Group, Inc. following its initial public offering in June 2025. There were no material changes to note within other. \nProvision for (benefit from) income taxes \nThree Months Ended \nSeptember 30,\nChange\nNine Months Ended \nSeptember 30,\nChange\n(in thousands, except %)\n2025\n2024\n$\n%\n2025\n2024\n$\n%\nProvision for (benefit from) income taxes\n$\n69,591 \n$\n(6,914)\n$\n76,505 \nnm\n$\n481,312 \n$\n157,878 \n$\n323,434 \n205 \n_________________\nnm - not meaningful\n40\nTable of \nContents\n \nFor the three months ended September 30, 2025 as compared to 2024, the increase in provision for (benefit from) income taxes was \nprimarily\n due to higher pretax income, partially offset by higher tax benefits from stock-based compensation. For the nine months ended September 30, 2025 as compared to 2024, the increase in provision for (benefit from) income taxes was \nprimarily\n due to higher pretax income and lower tax benefits from stock-based compensation. \nOn July 4, 2025, One Big Beautiful Bill Act (\n“\nOBBB\n”\n) was signed into law in the United States. OBBB includes significant changes to U.S. federal tax law, such as an elective deduction for domestic research and experimental expenditures, and changes to the tax rate on income from non-U.S. sources and subsidiaries. We do not expect OBBB to have a material impact on our effective tax rate and net deferred tax asset balance in 2025.\nNon-GAAP Financial Measure\nIn addition to our results determined in accordance with GAAP, we believe Adjusted EBITDA, a non-GAAP financial performance measure, is useful information to help investors evaluate our operating performance because it: enables investors to compare this measure and component adjustments to similar information provided by peer companies and our past financial performance; provides additional company-specific adjustments for certain items that may be included in income from operations but that we do not consider to be normal, recurring, operating expenses (or income) necessary to operate our business given our operations, revenue generating activities, business strategy, industry, and regulatory environment; and provides investors with visibility to a measure management uses to evaluate our ongoing operations and for internal planning and forecasting purposes. For example:\n•\nWe believe it is useful to exclude certain non-cash expenses, such as depreciation and amortization and stock-based compensation, from Adjusted EBITDA because the amounts of such expenses can vary significantly from period to period and may not directly correlate to the underlying performance of our business operations.\n•\nWe believe it is useful to exclude certain items that we do not consider to be normal, recurring, cash operating expenses and therefore, not reflective of our ongoing business operations. For example, we exclude: (i) other expense (income), net, as the income and expenses recognized in this line item are not part of our core operating activities and are considered non-operating activities under GAAP, (ii) gains and losses on crypto assets held for investment because such investments are considered primarily long-term holdings, and (iii) losses directly related to the Data Theft Incident, including voluntary customer reimbursements, direct legal costs, and reward payments, if any, in connection with the threat actor’s arrest and conviction. We do not plan on engaging in regular trading of crypto assets, and, as an operating company, our investing activities in crypto are not part of our revenue generating activities, which are based on transactions on our platform and the sales of subscriptions and services. \n•\nWe believe Adjusted EBITDA is useful to measure a company’s operating performance without regard to items such as stock-based compensation expense, depreciation and amortization expense, interest expense, other expense (income), net, and provision for (benefit from) income taxes that can vary substantially from company to company depending upon their financing, capital structures, and the method by which assets were acquired.\nLimitations of Adjusted EBITDA\nWe believe that Adjusted EBITDA may be helpful to investors for the reasons noted above. However, Adjusted EBITDA is presented for supplemental informational purposes only, has limitations as an analytical tool, and should not be considered in isolation or as a substitute for financial information presented in accordance with GAAP. There are a number of limitations related to Adjusted EBITDA rather \n41\nTable of \nContents\nthan net income (loss), which is the nearest GAAP equivalent of Adjusted EBITDA. Some of these limitations are that Adjusted EBITDA excludes: \n•\nprovision for (benefit from) income taxes; \n•\ninterest expense, or the cash requirements necessary to service interest or principal payments on our debt, which reduces cash available to us;\n•\ndepreciation and amortization expense and, although these are non-cash expenses, the assets being depreciated and amortized may have to be replaced in the future;\n•\nstock-based compensation expense, which has been, and will continue to be for the foreseeable future, a significant recurring expense for our business and an important part of our compensation strategy;\n•\nlosses directly related to the Data Theft Incident;\n•\nnet gains or losses on our crypto assets held for investment; and\n•\nother expense (income), net, which represents net gains or losses on investments and other financial instruments, and other non-operating income and expense activity.\nIn addition, other companies, including companies in our industry, may calculate Adjusted EBITDA differently or may use other measures to evaluate their performance, all of which could reduce the usefulness of our disclosure of Adjusted EBITDA as a tool for comparison. A reconciliation is provided below for Adjusted EBITDA to net income, the most directly comparable financial measure stated in accordance with GAAP. Investors are encouraged to review the related GAAP financial measure and the reconciliation of Adjusted EBITDA to net income, and not to rely on any single financial measure to evaluate our business.\nThe following table provides a reconciliation of net income to Adjusted EBITDA (in thousands): \nThree Months Ended \nSeptember 30,\nNine Months Ended \nSeptember 30,\n2025\n2024\n2025\n2024\nNet income\n$\n432,552 \n$\n75,495 \n$\n1,927,060 \n$\n1,287,890 \nAdjusted to exclude the following:\nProvision for (benefit from) income taxes\n69,591 \n(6,914)\n481,312 \n157,878 \nInterest expense\n21,774 \n20,530 \n62,820 \n60,108 \nDepreciation and amortization\n50,078 \n30,695 \n117,312 \n94,523 \nStock-based compensation expense\n222,069 \n248,416 \n608,958 \n690,854 \nData Theft Incident losses\n47,976 \n— \n354,630 \n— \n(Gains) losses on crypto assets held for investment, net\n(423,903)\n120,507 \n(189,305)\n(210,902)\nOther expense (income), net\n(1)\n380,518 \n(40,105)\n(1,120,199)\n(21,883)\nAdjusted EBITDA\n$\n800,655 \n$\n448,624 \n$\n2,242,588 \n$\n2,058,468 \n__________________\n(1)\nSee \nNote 15. Other Expense (Income), Net \nof the Notes to our Condensed Consolidated Financial Statements included in Part I, Item 1 of this Quarterly Report on Form 10-Q for additional details.\nLiquidity and Capital Resources \nThere have been no material changes to our liquidity and capital resources from those presented in the Annual Report, other than those described below.\nWe continue to believe our existing cash and cash equivalents and USDC will be sufficient in both the short and long term to meet our requirements and plans for cash, including meeting our working capital and capital expenditure requirements. Our ability to meet our requirements and plans for cash, including \n42\nTable of \nContents\nmeeting our working capital and capital expenditure requirements, will depend on many factors, including market acceptance \nof crypto assets and blockchain technology, our growth, our ability to attract and retain customers on our platform, the continuing market acceptance of our products and services, the introduction of new subscription products and services on our platform, expansion of sales and marketing activities, and overall economic conditions. We anticipate satisfying both our short-term and long-term cash requirements with our existing cash and cash equivalents \nand \nUSDC\n and \nwith future cash flows from operations, and potential future equity or debt financing. \nThe sale of additional equity would result in additional dilution to our stockholders. The incurrence of additional debt financing would result in debt service obligations, and the instruments governing such debt could provide for operating and financing covenants that would restrict our operation\ns.\nCash and cash equivalents and USDC\nOur cash and cash equivalents and USDC balances consisted of the following (in thousands):\nSeptember 30,\nDecember 31,\n2025\n2024\nCash and cash equivalents\nCash equivalents\n(1)\n$\n7,041,586 \n$\n6,607,023 \nCash held at financial institutions\n1,523,895 \n1,848,700 \nCash held at venues\n110,794 \n88,180 \nTotal cash and cash equivalents\n$\n8,676,275 \n$\n8,543,903 \nUSDC\n(2)\nUSDC not loaned or pledged as collateral\n$\n3,216,243 \n$\n743,181 \nUSDC pledged as collateral\n(3)\n423,036 \n329,832 \nUSDC loaned\n(3)\n57,162 \n168,795 \nTotal USDC\n$\n3,696,441 \n$\n1,241,808 \n__________________\n(1)\nCash equivalents consists of money market funds.\n(2)\nUSDC is a stablecoin redeemable on a one-to-one basis for U.S. dollars. While not accounted for as cash or cash equivalents, we treat our USDC holdings as a liquidity resource.\n(3)\nUSDC pledged as collateral represents assets pledged as collateral against our crypto asset borrowings, which do not meet the criteria for derecognition from our Condensed Consolidated Balance Sheets. USDC loaned represents loaned assets that do not meet the criteria for derecognition from our Condensed Consolidated Balance Sheets. See \nNote 5. Collateralized Arrangements and Financing \nof the Notes to our Condensed Consolidated Financial Statements included in Part I, Item 1 of this Quarterly Report on Form 10-Q for additional details.\nLong-term debt and other contractual obligations\n \nDuring the quarter ended June 30, 2025, we reclassified our 2026 Convertible Notes due on June 1, 2026 from non-current liability to current liability.\nIn August 2025, we issued an aggregate principal amount of $1.5 billion\n \nconvertible senior notes that mature on October 1, 2032, unless converted, repurchased, or redeemed on an earlier date, and an aggregate principal amount of $1.5 billion convertible senior notes that mature on October 1, 2029, unless converted or repurchased on an earlier date. See \nNote\n \n10. Long-Term Debt\n of the Notes to our Condensed Consolidated Financial Statements included in Part I, Item 1 of this Quarterly Report on Form 10-Q for additional details. In August 2025, Moody’s Ratings announced an upgrade of our ratings from B2 to B1 for corporate family and from B1 to Ba2 for guaranteed senior unsecured notes. As of September 30, 2025, our primary contractual obligation remained long-term debt, of which we held $7.3 billion in aggregate principal amount, including $1.3 billion that is due within the next 12 months and classified as a current liability.\nOur other contractual obligations increased materially over those as of December 31, 2024, primarily due to entry into office leases and renewal of a multi-year technology services agreement. These \n43\nTable of \nContents\nobligations arise in the normal course of business and represent material cash requirements. See \nNote 12. Other Condensed Consolidated Balance Sheets Details\n,\n \nfor additional details on leases, and \nNote 18. Commitments and Contingencies\n, for additional details on non-cancelable purchase obligations, of the Notes to our Condensed Consolidated Financial Statements included in Part I, Item 1 of this Quarterly Report on Form 10-Q.\nCrypto assets\nWe hold and use crypto assets for various purposes. Crypto assets held for operations are received in the ordinary course of business and are converted to cash or used to fulfill expenses, primarily blockchain rewards, nearly immediately. In order to facilitate institutional financing, we hold crypto assets we borrow, as well as crypto assets customers pledge as collateral against certain of our loans to them. We do not use these assets as a source of liquidity otherwise. Crypto assets held for investment are primarily long-term holdings and in certain cases fulfill capital requirements set by regulators (see also \nCapital requirements\n below). We do not plan to engage in regular trading of these crypto assets but may purchase additional crypto assets for investment as a buy and hold strategy. In case of a liquidity stress event, or for other episodic purposes, which may necessitate the use of these assets, we may change our policy and sell crypto assets held for investment to generate liquidity. During times of instability in the crypto assets market, we may not be able to sell our crypto assets at reasonable prices or at all. Our crypto assets held are considered less liquid than our cash and cash equivalents and may not be able to serve as a source of liquidity for us to the same extent as cash and cash equivalents. As of September 30, 2025, we held the following crypto assets: $161.1 million held for operations, $1.0 billion held as collateral, $346.0 million that were borrowed, and $2.6 billion held for investment. \nCustomer assets and liabilities\nRecognized customer assets and liabilities comprise customer custodial funds and corresponding customer custodial liabilities that represent our obligation to return these assets to the customers. We also securely store additional customer AOP that we do not recognize in our Condensed Consolidated Balance Sheets. We do not use customer crypto assets as collateral for any loan, margin, rehypothecation, or other similar activities to which we or our affiliates are a party, without the customer’s consent.\nOur business model does not expose us to liquidity risk if we have excessive redemptions or withdrawals from customers. As of September 30, 2025, we have not experienced excessive redemptions or withdrawals, or prolonged suspended redemptions or withdrawals, of crypto assets to date. \nCapital requirements\nAlthough currently we are not supervised by any federal banking agency, and our trading platform is not an SEC-regulated national securities exchange or alternative trading system, we operate globally in a complex and rapidly evolving regulatory environment and are subject to a wide range of laws and regulations enacted by U.S. federal, state, and local and foreign governments and regulatory authorities. These rules and regulations govern how we manage our liquidity, operations, and capital structure. Additionally, we and our subsidiaries hold licenses to operate as trust companies, money transmitters, and derivatives exchanges, or equivalents, requiring compliance with strict safeguards for customer funds and crypto assets, as well as capital and net worth requirements. For more information, see Part I, Item 1. “Business–Government Regulations” in the Annual Report as well as Part II, Item 1A. Risk Factors of this Quarterly Report on Form 10-Q.\nIn certain jurisdictions, we are required to hold eligible liquid assets, as defined by applicable regulatory requirements and commercial law, at a level equal to at least 100% of the aggregate amount of all customer custodial fund liabilities. Eligible liquid assets can include cash, cash equivalents, customer custodial funds, and in-transit customer receivables. As of September 30, 2025, our eligible liquid assets were greater than the aggregate amount of customer custodial fund liabilities.\n44\nTable of \nContents\nAdditionally, certain of our subsidiaries are subject to regulatory capital requirements that involve quantitative measures of USDC and crypto asset transactions, as well as USDC and crypto assets under custody. As of September 30, 2025, in aggregate, these subsidiaries were compliant with associated capital requirements of approximately $1.9 billion, which were met by a combination of corporate cash and cash equivalents and certain crypto assets held. \nCash flows \nThe following table summarizes our Condensed Consolidated Statements of Cash Flows (in thousands):\nNine Months Ended September 30,\n2025\n2024\nNet cash (used in) provided by operating activities\n$\n(638,768)\n$\n1,592,226 \nNet cash used in investing activities\n(1,652,383)\n(232,969)\nNet cash provided by financing activities\n1,896,096 \n682,663 \nNet (decrease) increase in cash, cash equivalents, and restricted cash and cash equivalents\n$\n(395,055)\n$\n2,041,920 \nChange in customer custodial cash and cash equivalents\n$\n(477,907)\n$\n(531,760)\n \nOperating activities \nOur largest source of cash provided by operating activities are revenues generated from transaction fees. Our primary uses of cash in operating activities include payments to employees for compensation, marketing programs, website hosting and infrastructure services, and professional services.\nNet cash (used in) provided by operating activities decreased by $2.2 billion for the nine months ended September 30, 2025 as compared to 2024 primarily due to:\n•\na $2.1 billion increase in cash used to purchase USDC, reflecting higher customer demand and to provide liquidity for future customer demand;\n•\n$253.4 million in cash used in 2025 related to the Data Theft Incident, for which impacted customers were voluntarily reimbursed; and\n•\nan overall increase in other cash expenses as we continue to grow our business; offset in part by\n•\ncash provided as a result of the $1.1 billion increase in total revenue.\nInvesting activities\nNet cash used in investing activities increased by $1.4 billion for the nine months ended September 30, 2025 as compared to 2024 as we invested more of our available cash, including:\n•\n$687.6 million in net cash used for business combinations in 2025, primarily due to the completion of the Deribit acquisition in August;\n•\na $487.7 million increase in cash used for net purchases of crypto assets held for investment; and\n•\na $231.8 million increase in cash used for the origination of fiat loans, net of repayments, reflecting higher demand for institutional financing products.\nFinancing activities\nNet cash provided by financing activities increased by $1.2 billion for the nine months ended September 30, 2025 as compared to 2024 primarily due to:\n•\na $1.6 billion net increase in proceeds from long-term debt, driven by the August 2025 issuance of our 2029 Convertible Notes and 2032 Convertible Notes, offset in part by prior year proceeds \n45\nTable of \nContents\nfrom the issuance of our 2030 Convertible Notes, less cash paid for associated capped calls; offset in part by\n•\na $191.6 million increase in cash used to pay taxes related to net share settlement of equity awards.\nCritical Accounting Estimates\nOur Condensed Consolidated Financial Statements and the related notes included elsewhere in this Quarterly Report on Form 10-Q are prepared in accordance with GAAP. The preparation of our Condensed Consolidated Financial Statements also requires us to make estimates and assumptions that affect the reported amounts of assets, liabilities, revenue, costs, and expenses and related disclosures. We base our estimates on historical experience and on various other assumptions that we believe to be reasonable under the circumstances. Actual results could differ significantly from our estimates. To the extent that there are differences between our estimates and actual results, our future financial statement presentation, financial condition, operating results, and cash flows will be affected. \nThere have been no material changes to our critical accounting estimates as compared to the critical accounting estimates disclosed in the Annual Report.\nRecent accounting pronouncements\nSee \nNote 2. Summary of Significant Accounting Policies\n of the Notes to our Condensed Consolidated Financial Statements included in Part I, Item 1 of this Quarterly Report on Form 10-Q for a discussion about new accounting pronouncements adopted and not yet adopted as of the date of this report."
}