{
  "source_file": "coo-20250731.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2. Management’s Discussion and Analysis of Financial Condition\nand Results of Operations\nNote numbers refer to “Notes to Consolidated Condensed Financial Statements” in Item 1. Unaudited Financial Statements.\nForward-Looking Statements\nThis Quarterly Report on Form 10-Q contains “forward-looking statements” within the meaning of Section 27A of the Securities Act of 1933, Section 21E of the Securities Exchange Act of 1934 and the Private Securities Litigation Reform Act of 1995. These include statements relating to plans, prospects, goals, strategies, future actions, events or performance and other statements which are other than statements of historical fact, including: statements regarding the expected impact of global macroeconomic conditions, and statements regarding acquisitions (including the acquired companies' financial position, market position, product development and business strategy, expected cost synergies, expected timing and benefits of the transaction, difficulties in integrating entities or operations, as well as estimates of our and the acquired entities' future expenses, sales and earnings per share) that are forward-looking. In addition, all statements regarding anticipated growth in our net sales, anticipated effects of any product recalls, anticipated market conditions, planned product launches, restructuring or business transition expectations, regulatory plans, and expected results of operations and integration of any acquisition are forward-looking. To identify these statements, look for words like “believes,” “outlook,” “probable,” “expects,” “may,” “will,” “should,” “could,” “seeks,” “intends,” “plans,” “estimates” or “anticipates” and similar words or phrases. Forward-looking statements necessarily depend on assumptions, data or methods that may be incorrect or imprecise and are subject to risks and uncertainties. Among the factors that could cause our actual results and future actions to differ materially from those described in forward-looking statements are:\n•\nAdverse changes in the global or regional general business, political and economic conditions, including the impact of continuing uncertainty and instability of certain countries, man-made or natural disasters and pandemic conditions, that could adversely affect our global markets, and the potential adverse economic impact and related uncertainty caused by these items.\n•\nThe impact of international conflicts and the global response to international conflicts on the global and local economy, financial markets, energy markets, currency rates and our ability to supply product to, or through, affected countries.\n•\nOur substantial and expanding international operations and the challenges of managing an organization spread throughout multiple countries and complying with a variety of legal, compliance and regulatory requirements.\n•\nThe actual imposition or threats of tariffs, customs duties and fees by the U.S. government and other nations in response and other retaliatory actions, such as trade protection measures, import or export licensing requirements, new or different customs duties, trade embargoes and sanctions and other trade barriers, as well as the impact of the Company’s efforts to mitigate the effects of such tariffs or similar measures.\n•\nForeign currency exchange rate and interest rate fluctuations including the risk of fluctuations in the value of foreign currencies or interest rates that would decrease our net sales and earnings.\n•\nOur existing and future variable rate indebtedness and associated interest expense is impacted by rate increases, which could adversely affect our financial health or limit our ability to borrow additional funds.\n•\nChanges in tax laws, examinations by tax authorities, and changes in our geographic composition of income. \n•\nAcquisition-related adverse effects including the failure to successfully achieve the anticipated net sales, margins and earnings benefits of acquisitions, integration delays or costs and the requirement to record significant adjustments to the preliminary fair value of assets acquired and liabilities assumed within the measurement period, required regulatory approvals for an acquisition not being obtained or being delayed or subject to conditions that are not anticipated, adverse impacts of changes to accounting controls and reporting procedures, contingent liabilities or indemnification obligations, increased leverage and lack of access to available financing (including financing for the acquisition or refinancing of debt owed by us on a timely basis and on reasonable terms).\n•\nCompliance costs and potential liability in connection with U.S. and foreign laws and health care regulations pertaining to privacy and security of personal information, such as the Health Insurance Portability and Accountability Act of 1996 (HIPAA) and the California Consumer Privacy Act (CCPA) in the U.S. and the General Data Protection Regulation (GDPR) requirements in Europe, including but not limited to those resulting from data security breaches.\n•\nA major disruption in the operations of our manufacturing, accounting and financial reporting, research and development, distribution facilities or raw material supply chain due to challenges associated with integration of acquisitions, man-made or natural disasters, pandemic conditions, cybersecurity incidents or other causes.\n•\nA major disruption in the operations of our manufacturing, accounting and financial reporting, research and development or distribution facilities due to the failure to perform by third-party vendors, including cloud computing providers or other technological problems, including any related to our information systems maintenance, enhancements or new system deployments, integrations or upgrades.\n•\nA successful cybersecurity attack which could interrupt or disrupt our information technology systems, or those of our third-party service providers, or cause the loss of confidential or protected data.\n16\nTHE COOPER COMPANIES, INC. AND SUBSIDIARIES\nItem 2. Management’s Discussion and Analysis of Financial Condition\nand Results of Operations\n•\nMarket consolidation of large customers globally through mergers or acquisitions resulting in a larger proportion or concentration of our business being derived from fewer customers.\n•\nDisruptions in supplies of raw materials, particularly components used to manufacture our silicone hydrogel lenses.\n•\nNew U.S. and foreign government laws and regulations, and changes in existing laws, regulations and enforcement guidance, which affect areas of our operations including, but not limited to, those affecting the health care industry, including the contact lens industry specifically and the medical device or pharmaceutical industries generally, including but not limited to the EU Medical Devices Regulation (MDR) and the EU In Vitro Diagnostic Medical Devices Regulation (IVDR).\n•\nLegal costs, insurance expenses, settlement costs and the risk of an adverse decision, prohibitive injunction or settlement related to product liability, patent infringement, contractual disputes, or other litigation.\n•\nLimitations on sales following product introductions due to poor market acceptance.\n•\nNew competitors, product innovations or technologies, including but not limited to, technological advances by competitors, new products and patents attained by competitors, and competitors' expansion through acquisitions.\n•\nReduced sales, loss of customers, reputational harm and costs and expenses, including from claims and litigation related to product recalls and warning letters.\n•\nFailure to receive, or delays in receiving, regulatory approvals or certifications for products.\n•\nFailure of our customers and end users to obtain adequate coverage and reimbursement from third-party payers for our products and services.\n•\nThe requirement to provide for a significant liability or to write off, or accelerate depreciation on, a significant asset, including goodwill, other intangible assets and idle manufacturing facilities and equipment.\n•\nThe success of our research and development activities and other start-up projects.\n•\nDilution to earnings per share from acquisitions or issuing stock.\n•\nImpact and costs incurred from changes in accounting standards and policies.\n•\nRisks related to environmental laws and requirements applicable to our facilities, products or manufacturing processes, including evolving regulations regarding the use of hazardous substances or chemicals in our products. \n•\nRisks related to environmental, social and corporate governance (ESG) issues, including those related to regulatory and disclosure requirements, climate change and sustainability.\n•\nOther events described in our Securities and Exchange Commission filings, including the “Business” and “Risk Factors” sections in our Annual Report on Form 10-K for the fiscal year ended October 31, 2024, as such Risk Factors may be updated in quarterly filings including updates made in this filing.\nWe caution investors that forward-looking statements reflect our analysis only on their stated date. We disclaim any intent to update them except as required by law.\n17\nTHE COOPER COMPANIES, INC. AND SUBSIDIARIES\nItem 2. Management’s Discussion and Analysis of Financial Condition\nand Results of Operations\nResults of Operations\nIn this section, we discuss the results of our operations for the third quarter of fiscal 2025 ended July 31, 2025, compared with the same period of fiscal 2024. We discuss our cash flows and current financial condition under “Capital Resources and Liquidity.” Within the tables presented, percentages are calculated based on the underlying whole-dollar amounts and, therefore, may not recalculate exactly from the rounded numbers used for disclosure purposes.    \nOutlook\nWe are optimistic about the long-term prospects for the worldwide contact lens and general health care markets, and the resilience of and growth prospects for our businesses and products. However, we face significant risks and uncertainties in our global operating environment as further described in the Part II, Item 1A \"Risk Factors\" herein. These risks include uncertain global and regional business, political and economic conditions, including but not limited to those associated with man-made or natural disasters, pandemic conditions, inflation, foreign exchange rate fluctuations, regulatory developments, supply chain disruptions, and escalating global trade barriers and disruptions, such as the impact of tariffs. These risks and uncertainties have adversely affected our sales, cash flow and performance in the past and could further adversely affect our future sales, cash flow and performance.\nCooperVision\n - We compete in the worldwide contact lens market with our spherical, toric, multifocal, and toric multifocal contact lenses offered in materials like silicone hydrogel Aquaform technology. We believe that there will be lower contact lens wearer dropout rates as technology improves and enhances the wearing experience through a combination of improved designs and materials and the growth of preferred modalities such as single-use and monthly wearing options. CooperVision also competes in the myopia management and specialty eye care contact lens markets with myopia management contact lenses using its ActivControl technology and with products such as orthokeratology (ortho-k) and scleral lenses. CooperVision has U.S. Food and Drug Administration (FDA) approval for its MiSight 1 day lens, which is the first and only FDA-approved product indicated to slow the progression of myopia in children with treatment initiated between the ages of 8-12. Further, CooperVision has Chinese National Medical Products Administration (NMPA) approval for its MiSight 1 day lens for use in China. CooperVision is focused on greater worldwide market penetration using recently introduced products, and we continue to expand our presence in existing and emerging markets, including through acquisitions. \nOur ability to compete successfully with a full range of silicone hydrogel products is an important factor to achieving our desired future levels of sales growth and profitability. CooperVision manufactures and markets a wide variety of silicone hydrogel contact lenses. Our single-use silicone hydrogel product franchises, clariti, MyDay\n \nand MyDay Energys, remain a focus as we expect increasing demand for these products, as well as future single-use products, as the global contact lens market continues to shift to this modality. Outside of single-use, the Biofinity and Avaira Vitality product families comprise our focus in the FRP, or frequent replacement product, market which encompasses the monthly and two-week modalities. Included in this segment are unique products such as Biofinity Energys, which helps individuals with digital eye fatigue.\nCooperSurgical -\n Our CooperSurgical business competes in the fertility and women's health care market through its diversified portfolio of products and services, including fertility products and services, medical devices, cryostorage (such as cord blood and cord tissue storage) and contraception. CooperSurgical has established its market presence and distribution system by developing products and acquiring companies, products and services that complement its business model. \nCompetitive factors in the segments in which CooperSurgical competes include technological and scientific advances, product quality and availability, price and customer service (including response time and effective communication of product information to physicians, consumers, fertility clinics and hospitals). \nWe protect our products through patents and trademark registrations, both in the United States and in international markets. We monitor competitive products trademark use worldwide and, when determined appropriate, we have enforced and plan to continue to enforce and defend our patent and trademark rights. We also rely upon trade secrets, licenses, technical know-how and continuing technological innovation to develop and maintain our competitive position. \nCooperVision, CooperSurgical, and other trade names, trademarks or service marks of the Company and its subsidiaries appearing in this report are the property of the Company and its subsidiaries. Trade names, trademarks and service marks of the other companies appearing in this report are the property of their respective holders.\n18\nTHE COOPER COMPANIES, INC. AND SUBSIDIARIES\nItem 2. Management’s Discussion and Analysis of Financial Condition\nand Results of Operations\nNet Sales\nThe contact lens market has two major product categories:\n•\nToric and multifocal lenses including lenses that, in addition to correcting near- and farsightedness, address more complex visual defects such as astigmatism and presbyopia by adding optical properties of cylinder and axis, which correct for irregularities in the shape of the cornea; and\n•\nSpherical lenses, including lenses that correct near- and farsightedness uncomplicated by more complex visual defects, myopia management lenses, which slow the progression of and correct myopia in age-appropriate children, and other specialty lenses.\nCooperVision Net Sales by Category\nThree Months Ended July 31,\n2025 vs 2024\n% Change\n($ in millions)\n2025\n2024\nToric and multifocal\n$\n358.8 \n$\n326.4 \n10 \n%\nSphere, other\n359.6 \n349.2 \n3 \n%\n$\n718.4 \n$\n675.6 \n6 \n%\n19\nTHE COOPER COMPANIES, INC. AND SUBSIDIARIES\nItem 2. Management’s Discussion and Analysis of Financial Condition\nand Results of Operations\nNine Months Ended July 31,\n2025 vs 2024\n% Change\n($ in millions)\n2025\n2024\nToric and multifocal\n$\n1,006.6 \n$\n934.0 \n8 \n%\nSphere, other\n1,027.5 \n999.0 \n3 \n%\n$\n2,034.1 \n$\n1,933.0 \n5 \n%\nIn the three and nine months ended July 31, 2025, the growth experienced across all categories was positively impacted by favorable foreign exchange rate fluctuations of approximately $26.8 million and $4.4 million, respectively. \n•\nToric and multifocal grew primarily through the success of Biofinity and MyDay.\n•\nSphere, other grew primarily through MyDay and MiSight.\n•\n\"Other\" products represented less than 1% of net sales in the three and nine months ended July 31, 2025 and 2024, respectively. \nCooperVision Net Sales by Geography\nCooperVision competes in the worldwide soft contact lens market and services in three primary regions: the Americas, EMEA (Europe, Middle East and Africa) and Asia Pacific.\nPeriods Ended July 31,\nThree Months\nNine Months\n($ in millions)\n2025\n2024\n2025 vs 2024\n% Change\n2025\n2024\n2025 vs 2024\n% Change\nAmericas\n$\n286.0 \n$\n279.8 \n2 \n%\n$\n839.3 \n$\n796.8 \n5 \n%\nEMEA\n292.1 \n256.5 \n14 \n%\n787.2 \n731.7 \n8 \n%\nAsia Pacific\n140.3 \n139.3 \n1 \n%\n407.6 \n404.5 \n1 \n%\n$\n718.4 \n$\n675.6 \n6 \n%\n$\n2,034.1 \n$\n1,933.0 \n5 \n%\nCooperVision's growth in net sales in the Americas and EMEA was primarily attributable to market gains of silicone hydrogel contact lenses. The growth in EMEA was positively impacted by favorable foreign exchange rate fluctuations. Refer to CooperVision Net Sales by Category above for further discussion.\nCooperSurgical Net Sales \nCooperSurgical supplies the fertility and women's heal\nth care market with a diversified portfolio of products and services in two categories:\n20\nTHE COOPER COMPANIES, INC. AND SUBSIDIARIES\nItem 2. Management’s Discussion and Analysis of Financial Condition\nand Results of Operations\n•\nOffice and surgical offerings include products that facilitate surgical and non-surgical procedures that are commonly performed primarily by obstetricians and gynecologists in hospitals, surgical centers, and medical offices. This includes medical devices, cryostorage (such as cord blood and cord tissue storage), and contraception.\n•\nFertility offerings include highly specialized products and services that target the in vitro fertilization process, including diagnostics testing with a goal to make fertility treatment safer, more efficient and convenient. This includes fertility consumables and equipment, donor gamete services, and genomic services (including genetic testing).\nCooperSurgical Net Sales by Category\nThree Months Ended July 31,\n2025 vs 2024\n% Change\n($ in millions)\n2025\n2024\nOffice and surgical\n$\n204.8 \n$\n197.9 \n3 \n%\nFertility\n137.1 \n129.3 \n6 \n%\n$\n341.9 \n$\n327.2 \n4 \n%\n21\nTHE COOPER COMPANIES, INC. AND SUBSIDIARIES\nItem 2. Management’s Discussion and Analysis of Financial Condition\nand Results of Operations\nNine Months Ended July 31,\n2025 vs 2024\n% Change\n($ in millions)\n2025\n2024\nOffice and surgical\n$\n609.5 \n$\n571.9 \n7 \n%\nFertility\n383.7 \n372.1 \n3 \n%\n$\n993.2 \n$\n944.0 \n5 \n%\nIn the three months ended July 31, 2025, office and surgical net sales increased primarily due to the acquisition of obp Surgical on August 1, 2024. Fertility net sales increased primarily due to an increase in revenue from consumable products.\nIn the nine months ended July 31, 2025, office and surgical net sales increased primarily due to increased sales of Paragard contraceptive intrauterine devices and the acquisition of obp Surgical on August 1, 2024. Fertility net sales increased primarily due to an increase in revenue from gamete services and consumable products.\nThe above growth experienced across all categories was positively impacted by favorable foreign exchange rate fluctuations of approximately $3.1 million for the three months ended July 31, 2025, while partially offset by unfavorable foreign exchange rate fluctuations of $2.5 million for the nine months ended July 31, 2025. \nGross Margin\nConsolidated gross margin decreased in the three months ended July 31, 2025 to 65% compared to 66% in the three months ended July 31, 2024, primarily driven by inventory write-offs related to a product line exit. Consolidated gross margin remained flat at 67% in the nine months ended July 31, 2025 as compared to the nine months ended July 31, 2024.\n22\nTHE COOPER COMPANIES, INC. AND SUBSIDIARIES\nItem 2. Management’s Discussion and Analysis of Financial Condition\nand Results of Operations\nSelling, General and Administrative (SGA) Expenses \nThree Months Ended July 31,\n2025 vs 2024\n% Change\n($ in millions)\n2025\n% Net Sales\n2024\n% Net Sales\nCooperVision\n$\n248.2 \n35 \n%\n$\n232.5 \n34 \n%\n7 \n%\nCooperSurgical\n150.9 \n44 \n%\n127.1 \n39 \n%\n19 \n%\nCorporate\n22.6 \n— \n21.5 \n— \n5 \n%\n$\n421.7 \n40 \n%\n$\n381.1 \n38 \n%\n11 \n%\nNine Months Ended July 31,\n2025 vs 2024\n% Change\n($ in millions)\n2025\n% Net Sales\n2024\n% Net Sales\nCooperVision\n$\n715.0 \n35 \n%\n$\n679.9 \n35 \n%\n5 \n%\nCooperSurgical\n423.6 \n43 \n%\n395.1 \n42 \n%\n7 \n%\nCorporate\n70.0 \n— \n67.3 \n— \n4 \n%\n$\n1,208.6 \n40 \n%\n$\n1,142.3 \n40 \n%\n6 \n%\nCooperVision's SGA expenses increased in the three and nine months ended July 31, 2025, compared to the three and nine months ended July 31, 2024, primarily due to increased selling activities. \nCooperSurgical's SGA expenses increased in the three and nine months ended July 31, 2025, compared to the three and nine months ended July 31, 2024, primarily due to long-lived asset write-offs related to a product line exit and increased selling activities. \nCorporate SGA expenses increased in the three months ended July 31, 2025, compared to the three months ended July 31, 2024, primarily due to an increase in salaries and benefits, partially offset by a decrease in professional fees.\nCorporate SGA expenses increased in the nine months ended July 31, 2025, compared to the nine months ended July 31, 2024, primarily due to an increase in salaries and benefits.\nResearch and Development (R&D) Expenses \nThree Months Ended July 31,\n2025 vs 2024\n% Change\n($ in millions)\n2025\n% Net Sales\n2024\n% Net Sales\nCooperVision\n$\n24.3 \n3 \n%\n$\n21.6 \n3 \n%\n13 \n%\nCooperSurgical\n20.3 \n6 \n%\n17.4 \n5 \n%\n17 \n%\n$\n44.6 \n4 \n%\n$\n39.0 \n4 \n%\n14 \n%\nNine Months Ended July 31,\n2025 vs 2024\n% Change\n($ in millions)\n2025\n% Net Sales\n2024\n% Net Sales\nCooperVision\n$\n72.4 \n4 \n%\n$\n63.2 \n3 \n%\n15 \n%\nCooperSurgical\n58.4 \n6 \n%\n54.2 \n6 \n%\n8 \n%\n$\n130.8 \n4 \n%\n$\n117.4 \n4 \n%\n11 \n%\nCooperVision's R&D expenses increased in the three and nine months ended July 31, 2025, compared to the three and nine months ended July 31, 2024, primarily due to an increase in R&D projects spend. CooperVision's R&D activities are primarily focused on the development of contact lenses, manufacturing technology and process enhancements.\nCooperSurgical's R&D expenses increased in the three and nine months ended July 31, 2025, compared to the three and nine months ended July 31, 2024, primarily due to an increase in R&D project spend, partially offset by a decrease in MDR costs. CooperSurgical's R&D activities are primarily focused on the development of surgical devices and fertility solutions, manufacturing technology and process enhancements.\n23\nTHE COOPER COMPANIES, INC. AND SUBSIDIARIES\nItem 2. Management’s Discussion and Analysis of Financial Condition\nand Results of Operations\nAmortization Expense\nThree Months Ended July 31,\n2025 vs 2024\n% Change\n($ in millions)\n2025\n% Net Sales\n2024\n% Net Sales\nCooperVision\n$\n5.1 \n1 \n%\n$\n7.9 \n1 \n%\n(35)\n%\nCooperSurgical\n44.9 \n13 \n%\n42.5 \n13 \n%\n6 \n%\n$\n50.0 \n5 \n%\n$\n50.4 \n5 \n%\n(1)\n%\nNine Months Ended July 31,\n2025 vs 2024\n% Change\n($ in millions)\n2025\n% Net Sales\n2024\n% Net Sales\nCooperVision\n$\n15.0 \n1 \n%\n$\n23.3 \n1 \n%\n(36)\n%\nCooperSurgical\n134.4 \n14 \n%\n127.7 \n14 \n%\n5 \n%\n$\n149.4 \n5 \n%\n$\n151.0 \n5 \n%\n(1)\n%\nCooperVision's amortization expense decreased in the three and nine months ended July 31, 2025, compared to the three and nine months ended July 31, 2024, primarily due to certain intangible assets being fully amortized. \nCooperSurgical's amortization expense increased in the three and nine months ended July 31, 2025, compared to the three and nine months ended July 31, 2024, primarily due to the amortization of intangible assets acquired through acquisitions in the second half of fiscal 2024.\nOperating Income \nThree Months Ended July 31,\n2025 vs 2024\n% Change\n($ in millions)\n2025\n% Net Sales\n2024\n% Net Sales\nCooperVision\n$\n202.6 \n28 \n%\n$\n172.7 \n26 \n%\n17 \n%\nCooperSurgical\n(4.2)\n(1)\n%\n41.3 \n13 \n%\n(110)\n%\nCorporate\n(22.7)\n— \n(21.5)\n— \n6 \n%\n$\n175.7 \n17 \n%\n$\n192.5 \n19 \n%\n(9)\n%\nNine Months Ended July 31,\n2025 vs 2024\n% Change\n($ in millions)\n2025\n% Net Sales\n2024\n% Net Sales\nCooperVision\n$\n572.9 \n28 \n%\n$\n487.7 \n25 \n%\n17 \n%\nCooperSurgical\n39.7 \n4 \n%\n86.9 \n9 \n%\n(54)\n%\nCorporate\n(70.1)\n— \n(67.3)\n— \n4 \n%\n$\n542.5 \n18 \n%\n$\n507.3 \n18 \n%\n7 \n%\nCooperVision's operating income increased in the three and nine months ended July 31, 2025, compared to the three and nine months ended July 31, 2024, primarily due to the increase in net sales outpacing the increase in operating expenses.\nCooperSurgical's operating income decreased in the three months ended July 31, 2025, compared to the three months ended July 31, 2024, primarily due to inventory and long-lived asset write-offs related to a product line exit. CooperSurgical's operating income decreased in the nine months ended July 31, 2025, compared to the nine months ended July 31, 2024, primarily due to inventory and long-lived asset write-offs related to a product line exit and an increase in amortization expense.\nCorporate operating loss increased in the three months ended July 31, 2025, compared to the three months ended July 31, 2024, primarily due to higher salaries and benefits expenses, partially offset by a decrease in professional fees.\nCorporate operating loss increased in the nine months ended July 31, 2025, compared to the nine months ended July 31, 2024, primarily due to higher salaries and benefits expenses.\n24\nTHE COOPER COMPANIES, INC. AND SUBSIDIARIES\nItem 2. Management’s Discussion and Analysis of Financial Condition\nand Results of Operations\nInterest Expense\nThree Months Ended July 31,\n2025 vs 2024\n% Change\n($ in millions)\n2025\n% Net Sales\n2024\n% Net Sales\nInterest expense\n$\n25.4 \n2 \n%\n$\n28.5 \n3 \n%\n(11)\n%\nNine Months Ended July 31,\n2025 vs 2024\n% Change\n($ in millions)\n2025\n% Net Sales\n2024\n% Net Sales\nInterest expense\n$\n75.6 \n2 \n%\n$\n87.3 \n3 \n%\n(13)\n%\nInterest expense decreased during the three and nine months ended July 31, 2025, compared to the three and nine months ended July 31, 2024, primarily due to lower interest rates and lower average debt balances.\nOther Expense, Net\nPeriods Ended July 31,\nThree Months\nNine Months\n($ in millions)\n2025\n2024\n2025\n2024\nForeign exchange loss (gain)\n$\n1.5 \n$\n(0.5)\n$\n5.7 \n$\n3.2 \nOther (income) expense, net\n(3.1)\n0.8 \n11.5 \n3.1 \n$\n(1.6)\n$\n0.3 \n$\n17.2 \n$\n6.3 \nForeign exchange loss during the three and nine months ended July 31, 2025 was primarily due to movements of U.S. dollar against various foreign currencies and the effect on intercompany receivables and payables. Foreign exchange loss (gain) during three and nine months ended July 31, 2024 was primarily associated with the weakening of the U.S. dollar against foreign currencies and the effect on intercompany receivables.\nOther (income) expense, net decreased in the three months ended July 31, 2025 compared to the three months ended July 31, 2024, primarily due to a gain in minority interest investments. Other expense, net increased in the nine months ended July 31, 2025 compared to the nine months ended July 31, 2024, primarily due to a $15.7 million loss on the disposal of a minority interest investment. \nProvision for Income Taxes\nThe effective tax rates for the three months ended July 31, 2025, and July 31, 2024, were 35.3% and 36.1%, respectively. The decrease was primarily due to adjustments related to filing the prior year US tax return partially offset by changes in the geographical composition of pre-tax earnings. The effective tax rates for the nine months ended July 31, 2025, and July 31, 2024, were 35.4% and 33.6%, respectively. The increase was primarily due to changes in valuation allowance and a decrease in excess tax benefits from share-based compensation, partially offset by changes in unrecognized tax benefits and changes in the geographic composition of pre-tax earnings.\nThe One Big Beautiful Bill Act was enacted in the United States during the third quarter of fiscal 2025. It is not expected to have a material impact on the tax provision. \n25\nTHE COOPER COMPANIES, INC. AND SUBSIDIARIES\nItem 2. Management’s Discussion and Analysis of Financial Condition\nand Results of Operations\nCapital Resources and Liquidity\nWorking capital as of July 31, 2025 and October 31, 2024 was $1,127.7 million and $928.7 million, respectively. The increase in working capital was primarily due to increases in inventories and accounts receivable, partially offset by an increase in short-term debt.\nCash Flow\nNine Months Ended July 31,\n($ in millions)\n2025\n2024\nOperating activities\n$\n548.2 \n$\n441.2 \nInvesting activities\n(274.1)\n(523.0)\nFinancing activities\n(261.5)\n67.6 \nEffect of exchange rate changes on cash, cash equivalents, restricted cash\n4.6 \n3.1 \nNet increase (decrease) in cash, cash equivalents, and restricted cash\n$\n17.2 \n$\n(11.1)\nOperating Cash Flow\nCash provided by operating activities in the first nine months of fiscal 2025 increased compared to the first nine months of fiscal 2024, primarily due to increases in net income and net changes in deferred income taxes and operating capital. The net changes in operating capital included an increase in cash collection and a decrease in prepaid and other assets, partially offset by an increase in inventories.\nInvesting Cash Flow\nCash used in investing activities in the first nine months of fiscal 2025 decreased compared to the first nine months of fiscal 2024, primarily attributable to $200 million cash paid for the Cook Medical acquisition in the first nine months of fiscal 2024.\nFinancing Cash Flow\nCash used in financing activities in the first nine months of fiscal 2025 was primarily attributable to net repayments on the revolving credit, the repurchase of common stock and the first installment payment related to the Cook Medical acquisition.\nCash provided by financing activities in the first nine months of fiscal 2024 was primarily attributable to funds received from the 2024 Revolving Credit Facility, partially offset by repayments to fully repay all borrowings outstanding under the 2020 Term Loan Facility and the 2020 Revolving Credit Facility.\nThe following is a summary of the maximum commitments and the net amounts available to us under different credit facilities as of July 31, 2025:\n(In millions)\nFacility Limit\nOutstanding Borrowings\nOutstanding Letters of Credit\nTotal Amount Available\nMaturity Date\nRevolving Credit:\n2024 Revolving Credit\n$\n2,300.0 \n$\n930.2 \n$\n— \n$\n1,369.8 \nMay 1, 2029\nTerm loan:\n2021 Term Loan\n1,500.0 \n1,500.0 \nn/a\n— \nDecember 17, 2026\nTotal\n$\n3,800.0 \n$\n2,430.2 \n$\n— \n$\n1,369.8 \nAs of July 31, 2025, the Company was in compliance with all debt covenants. On May 1, 2024, the Company entered into a Revolving Credit Agreement (the 2024 Credit Agreement). The Company drew on the 2024 Credit Agreement to fully repay borrowings outstanding under the 2020 Term Loan and 2020 Revolving Credit Facility and terminated the 2020 Credit Agreement. See Note 5. Financing Arrangements of the Consolidated Condensed Financial Statements for further information.\nWe have re-evaluated our operating cash flows and cash requirements and continue to believe that current cash, cash equivalents, future cash flow from operating activities and cash available under our 2024 Credit Agreement will be sufficient to meet our anticipated cash needs, including working capital needs, capital expenditures and contractual obligations for at least 12 months from the issuance date of the Consolidated Condensed Financial Statements included in this quarterly report. To the extent additional funds are necessary to meet our liquidity needs such as for acquisitions, share repurchases or other activities as we \n26\nTHE COOPER COMPANIES, INC. AND SUBSIDIARIES\nItem 2. Management’s Discussion and Analysis of Financial Condition\nand Results of Operations\nexecute our business strategy, we anticipate that additional funds could be obtained through the incurrence of additional indebtedness, additional equity financings or a combination of these potential sources of funds; however, such financing may not be available on favorable terms, or at all.\nShare Repurchase\nIn March 2017, the authorization under the 2012 Share Repurchase Program was increased to $1.0 billion by the Company's Board of Directors. As of July 31, 2025, $163.6 million remains authorized for repurchase.\nDuring the three and nine months ended July 31, 2025, the Company repurchased 0.7 million and 1.2 million shares of its common stock for $52.2 million and $92.8 million, at a weighted average price of $71.97 and $73.51 per share, respectively. There were no share repurchases the three and nine months ended July 31, 2024.\nEstimates and Critical Accounting Policies\nInformation regarding estimates and critical accounting policies is included in Management's Discussion and Analysis in our Form 10-K for the fiscal year ended October 31, 2024. There have been no material changes in our policies from those previously discussed in our Form 10-K for the fiscal year ended October 31, 2024.\nAccounting Pronouncements \nInformation regarding new accounting pronouncements is included in Note 1. General of the Consolidated Condensed Financial Statements of this Quarterly Report on Form 10-Q.\n27\nTHE COOPER COMPANIES, INC. AND SUBSIDIARIES"
}