{
  "source_file": "cop-20241231.htm",
  "form_type": "10-K",
  "item1": null,
  "item7": "Item 7.    Management’s Discussion and Analysis of Financial Condition and\n              Results of Operations\nManagement’s Discussion and Analysis is the company’s analysis of its financial performance and of significant trends and uncertainties that may affect future performance. It should be read in conjunction with the financial statements and notes, and supplemental oil and gas disclosures included elsewhere in this report. It contains forward-looking statements including, without limitation, statements relating to the company’s plans, strategies, objectives, expectations and intentions that are made pursuant to the “safe harbor” provisions of the Private Securities Litigation Reform Act of 1995. The words “ambition,” “anticipate,” “believe,” “budget,” “continue,” “could,” “effort,” “estimate,” “expect,” “forecast,” “goal,” “guidance,” “intend,” “may,” “objective,” “outlook,” “plan,” “potential,” “predict,” “projection,” “seek,” “should,” “target,” “will,” “would” and similar expressions identify forward-looking statements. The company does not undertake to update, revise or correct any of the forward-looking information unless required to do so under the federal securities laws. Readers are cautioned that such forward-looking statements should be read in conjunction with the company’s disclosures under the heading: “CAUTIONARY STATEMENT FOR THE PURPOSES OF THE ‘SAFE HARBOR’ PROVISIONS OF THE PRIVATE SECURITIES LITIGATION REFORM ACT OF 1995,” beginning on page \n65\n.\nThe terms “earnings” and “loss” as used in Management’s Discussion and Analysis refer to net income (loss).\nBusiness Environment and Executive Overview\nConocoPhillips is one of the world’s leading E&P companies based on both production and reserves with operations and activities in 14 countries. Our diverse, low cost of supply portfolio includes resource-rich unconventional plays in North America; conventional assets in North America, Europe, Africa and Asia; global LNG developments; oil sands in Canada; and an inventory of global exploration prospects. Headquartered in Houston, Texas, at December 31, 2024, we employed approximately 11,800 people worldwide and had total assets of $123 billion.\nCompleted Acquisition of Marathon Oil Corporation\nOn November 22, 2024, we completed our acquisition of Marathon Oil, an independent oil and gas exploration and production company. The acquisition adds high-quality, low cost of supply, development opportunities to our existing Lower 48 portfolio and additional LNG capacity to our global LNG portfolio through Equatorial Guinea. \nAt closing, the acquisition was valued at approximately $16.5 billion, in which 0.255 shares of ConocoPhillips common stock was exchanged for each outstanding share of Marathon Oil common stock, resulting in the issuance of approximately 143 million shares of ConocoPhillips common stock. We also assumed $4.6 billion in aggregate principal amount of outstanding debt for Marathon Oil, which was recorded at fair value of $4.7 billion as of the closing date. We expect to capture approximately $1 billion in synergies on a run rate basis within the first full year following the close of the transaction.\n \nSee Note \n3 and \nNote \n8.\nOverview \nAt ConocoPhillips, we anticipate that commodity prices will continue to be cyclical and volatile, and our view is that a successful business strategy in the E&P industry must be resilient in lower price environments while also retaining upside during periods of higher prices. As such, we are unhedged, remain committed to our disciplined investment framework and continually monitor market fundamentals, including the impacts associated with geopolitical tensions and conflicts, global demand for our products, oil and gas inventory levels, governmental policies, inflation and supply chain disruptions.\nThe macro-environment of the global energy industry continues to evolve. We believe ConocoPhillips plays an essential role in responsibly meeting the global demand for energy, while continuing to deliver competitive returns on and of capital and working to meet our previously established emissions-reduction targets. We call this our Triple Mandate, and it represents our commitment to create long-term value for stockholders. Our value proposition to deliver competitive returns to stockholders through price cycles is guided by our foundational principles which consist of maintaining balance sheet strength, providing peer-leading distributions, making disciplined investments, and demonstrating responsible and reliable ESG performance.\nConocoPhillips   2024 10-K\n34\nManagement’s Discussion and Analysis\nTable of Contents\nTotal company production in 2024 was 1,987 MBOED, yielding cash provided by operating activities of $20.1 billion. We invested $12.1 billion into the business in the form of capital expenditures and investments, inclusive of $0.4 billion of spend related to fourth-quarter acquisitions, and provided returns of capital to shareholders of $9.1 billion through our ordinary dividend, VROC and share repurchases. In 2024, we returned $3.6 billion through the ordinary dividend and VROC, including in December when we increased our ordinary dividend by 34 percent to 78 cents per share, effectively incorporating the amount of the prior quarter VROC into the ordinary dividend. In addition, we returned $5.5 billion to shareholders through share repurchases. As of December 31, 2024, we have repurchased $34.3 billion of our authorized share repurchase program since 2016. In February 2025, we announced our 2025 planned return of capital to shareholders of $10 billion, at current commodity prices, through our return of capital framework. We also declared a first-quarter ordinary dividend of 78 cents per share. \nIn 2024, we continued to optimize our portfolio geared towards our return focused value proposition. In the third quarter, we added to our global LNG portfolio through agreements that provide additional access to European and Asian natural gas markets by entering into an 18-year agreement securing regasification capacity at Zeebrugge LNG terminal in Belgium which includes regasification services for approximately 0.75 MTPA of LNG beginning in 2027. Additionally, in the third quarter, we entered into a long-term LNG sales agreement for approximately 0.5 MTPA into Asia starting in 2027. \nAfter exercising our preferential rights, we completed our acquisition of additional working interest in the Kuparuk River Unit and Prudhoe Bay Unit in our Alaska segment in the fourth quarter of 2024. In conjunction with the announcement of our acquisition of Marathon Oil, we communicated a disposition target of approximately $2 billion of assets across the portfolio. We recently entered into agreements to sell noncore assets within our Lower 48 segments that are expected to close in the first half of 2025 for approximately $600 million, subject to customary closing adjustments. \nSee Note \n3\n.\nIn the fourth quarter of 2024, we completed strategic debt transactions, which simplified our capital structure, extended the debt portfolio's weighted average maturity, lowered its weighted average coupon and reduced near-term maturities. \nSee Note \n3 and\n Note \n8\n.\nOperationally, we remain focused on safely executing the business. Production for 2024 was 1,987 MBOED, representing an increase of 161 MBOED or nine percent compared to 2023. After adjusting for closed acquisitions and dispositions, production increased by 69 MBOED or three percent. Our Lower 48 segment achieved record production of 1,152 MBOED in 2024. Our international projects reached several key operational milestones; including first production ahead of schedule at Eldfisk North in Norway, Nuna in Alaska and Bohai Bay in China; and we celebrated the one thousandth cargo lift at both APLNG and Bohai Bay in China.\nBusiness Environment\nThe energy industry has historically been subject to volatility in commodity prices, which fluctuate with the global economy's supply and demand for energy. Our profitability, reserves base, reinvestment of cash flows and distributions to shareholders are influenced by these fluctuations. Our foundational principles guide our differential value proposition to deliver competitive returns on and of capital to stockholders through price cycles. Our foundational principles consist of maintaining balance sheet strength, providing peer-leading distributions, making disciplined investments and demonstrating responsible and reliable ESG performance, all of which support strong financial returns and mitigate uncertainty associated with volatile commodity prices.\nBalance sheet strength. \nA strong balance sheet is a strategic asset that provides flexibility through price cycles. We strive to maintain our ‘A’-rating, as we did throughout 2024. In 2024, we initiated and completed strategic debt transactions to extend the weighted average maturity of our portfolio and reduce near-term debt maturities. We ended the year with cash and cash equivalents and restricted cash of $5.9 billion, short-term investments of $0.5 billion and long-term investments in debt securities of $1.1 billion, maintaining balance sheet strength.\nPeer leading distributions. \nWe believe in delivering value to our shareholders via our return of capital framework, which consists of a growing, sustainable ordinary dividend, share repurchases and the discretion to utilize VROC in an elevated price environment. This framework is how we plan to return greater than 30 percent of our net cash provided by operating activities to shareholders. In 2024, we returned $3.6 billion to shareholders through our ordinary dividend and VROC and $5.5 billion through share repurchases. Our combined dividends and share repurchases of $9.1 billion represented 45 percent of our net cash provided by operating activities. In February 2025, we announced our 2025 planned return of capital to shareholders of $10 billion, at current commodity prices, through our return of capital framework.\n35\nConocoPhillips   2024 10-K\nManagement’s Discussion and Analysis\nTable of Contents\nDisciplined investments. \nOur goal is to optimize free cash flow by exercising capital discipline, controlling our costs, and safely and reliably delivering production. We expect to make capital investments sufficient to at least sustain production throughout the price cycles. Free cash flow is defined as cash from operations net of capital expenditures and investments and provides funds that are available to return to shareholders, strengthen the balance sheet or reinvest back into the business for future cash flow expansion.\n•\nExercise capital discipline. \nOur global portfolio is deep, diverse and durable. As we consider our capital investment opportunities, we apply a rigorous framework that we believe allows for competitive free cash flow to be available to return to shareholders. By allocating to our low cost of supply resource base, we are allocating to high return assets and driving resiliency to low prices. We also balance our investments between short and longer cycle projects. For example, in 2024, we invested in short-cycle projects in the Lower 48 segment, as well as longer-cycle projects such as Willow in Alaska and LNG projects in Qatar and Port Arthur. This capital allocation framework seeks to maximize free cash flow through price cycles. Cost of supply is the WTI equivalent price that generates a 10 percent after-tax return on a point-forward and fully burdened basis. Fully burdened basis includes capital infrastructure, foreign currency exchange rates, cost of carbon, price-related inflation and G&A. \n•\nControl our costs. \nControlling our costs, without compromising safety or environmental stewardship, is a high priority. Using various methodologies, we monitor costs monthly, on an absolute-dollar basis and a per-unit basis and report to management. Managing costs is critical to maintaining a competitive position in our cyclical industry and positively impacts our ability to deliver strong cash from operations. \n•\nOptimize our portfolio. \nWe continue to evaluate our assets to determine whether they compete for capital within our portfolio and optimize as necessary, directing capital towards the most competitive investments and disposing of assets that do not compete. \nIn 2024, we completed our acquisition of Marathon Oil and additional working interest in Alaska, as well as signed additional LNG regasification and sales agreements. In 2024, we also signed an agreement to divest certain noncore assets in our Lower 48 segment. \nSee Note \n3\n.\n•\nAdd to our proved reserve base. \nWe primarily add to our proved reserve base in three ways:\n•\nAcquire interests in existing or new fields.\n•\nApply new technologies and processes to improve recovery from existing fields.\n•\nSuccessfully explore, develop and exploit new and existing fields.\nReserve replacement represents the net change in proved reserves, net of production, divided by our current year production. Our reserve replacement was 244 percent in 2024, reflecting a net increase from development drilling activity; extensions and discoveries; and purchases, including our acquisition of Marathon Oil; partially offset by lower prices. Our organic reserve replacement, which excludes a net increase of 886 MMBOE from sales and purchases, was 123 percent in 2024. \nIn the three years ended December 31, 2024, our reserve replacement was 183 percent. Our organic         reserve replacement during the three years ended December 31, 2024, which excludes a net increase of 1,064 MMBOE related to sales and purchases, was 131 percent. \nSee \n\"Supplementary Data - Oil and Gas Operations\"\n for more information.\nEnvironmental, Social and Governance performance. \nWe are committed to the efficient and effective exploration and production of oil and natural gas. We seek to deliver energy to the world through an integrated management system that assesses sustainability-related business risks and opportunities as part of our decision-making process and remain committed to our targets. Recognizing the importance of ESG performance to our stakeholders and company success, we have a governance structure that extends from the board of directors to executive leadership and business unit managers.\nFor more information on our commitment to responsible and reliable ESG performance, \nsee \"Contingencies—Company Response to Climate-Related Risks\"\n section of Management's Discussion and Analysis of Financial Condition and Results of Operation.\nConocoPhillips   2024 10-K\n36\nManagement’s Discussion and Analysis\nTable of Contents\nCommodity Prices\nOur earnings and operating cash flows generally correlate with crude oil and natural gas commodity prices. Commodity price levels are subject to factors external to the company and over which we have no control, including but not limited to global economic health, supply or demand disruptions or fears thereof caused by civil unrest, global pandemics, military conflicts, actions taken by OPEC Plus and other major oil producing countries, environmental laws, tax regulations, governmental policies and weather-related disruptions. The following graph depicts the average benchmark prices for WTI crude oil, Brent crude oil and U.S. Henry Hub natural gas since 2022:\nBrent crude oil prices decreased two percent from $82.62 per barrel in 2023 to $80.76 per barrel in 2024. Similarly, average WTI crude oil prices decreased two percent from $77.62 per barrel in 2023 to $75.72 per barrel in 2024. Prices were lower through 2024 due to slower global demand growth in 2024 relative to 2023 and higher supplies from non-OPEC Plus counties.\nU.S. Henry Hub natural gas prices decreased 17 percent from an average of $2.74 per MMBTU in 2023 to $2.27 per MMBTU in 2024. Natural gas prices decreased due to excess North American natural gas storage levels following a mild 2023-2024 winter. Lower 48 segment realized gas prices decreased to $0.18 in the third quarter of 2024 driven by lower regional prices related to pipeline capacity constraints. In the fourth quarter of 2024 prices increased as constraints were relieved and realizations ended the year at an average of $0.87.\nOur realized bitumen price increased 14 percent from an average of $42.15 per barrel in 2023 to $47.92 per barrel in 2024. The increase was driven by narrowing WCS differentials due to Trans Mountain Expansion project egress, tightening Russian sanctions impacting global heavy oil supply and improving heavy oil demand in Asia. We continue to optimize bitumen price realizations through optimizing diluent recovery unit operation, blending and transportation strategies. \nOur worldwide annual average realized price decreased six percent from $58.39 per BOE in 2023 to $54.83 per BOE in 2024 primarily due to lower crude and natural gas prices. \n37\nConocoPhillips   2024 10-K\nManagement’s Discussion and Analysis\nTable of Contents\nKey Operating and Financial Summary\nSignificant items during 2024 and recent announcements included the following:\n•\nCompleted the acquisition of Marathon Oil, adding high-quality, low cost of supply inventory adjacent to the company's leading U.S. unconventional position;\n•\nReported fourth-quarter 2024 earnings per share of $1.90;\n•\nDelivered 2024 reserve replacement ratio of 244 percent and organic reserve replacement ratio of 123 percent;\n•\nAnnounced planned 2025 return of capital target of $10 billion at current commodity prices and declared first-quarter 2025 ordinary dividend of $0.78 per share;\n•\nProvided 2025 guidance including full-year capital of approximately $12.9 billion;\n•\nGenerated cash provided by operating activities of $20.1 billion;\n•\nDistributed $9.1 billion to shareholders, including $5.5 billion through share repurchases and $3.6 billion through the ordinary dividend and VROC;\n•\nEnded the year with cash, cash equivalents and restricted cash of $5.9 billion, short-term investments of $0.5 billion and long-term investments in debt securities of $1.1 billion;\n•\nAdvanced previously announced $2 billion disposition target by signing agreements to divest noncore Lower 48 assets of $0.6 billion, subject to customary closing adjustments and expected to close in the first half of 2025;\n•\nDelivered full-year total company and Lower 48 production of 1,987 MBOED and 1,152 MBOED, respectively. Excluding one month of Marathon Oil production, the company and Lower 48 produced 1,955 MBOED and 1,124 MBOED, respectively;\n•\nReached first production at Nuna in Alaska and Bohai Phase 5 in China in the fourth quarter and at Eldfisk North in Norway in the second quarter;\n•\nProgressed global LNG strategy with a long-term regasification agreement at Zeebrugge LNG terminal in Belgium and a long-term sales agreement in Asia;\n•\nExercised preferential rights and acquired additional working interests in Alaska's Kuparuk River and Prudhoe Bay Units in the fourth quarter;\n•\nCompleted debt transactions to simplify the company's capital structure post the acquisition of Marathon Oil, extending the weighted average maturity and improving the weighted average coupon of the portfolio; and\n•\nAchieved the Oil and Gas Methane Partnership 2.0 Gold Standard designation in 2024.\nOutlook\nProduction, DD&A and Capital\n2025 production guidance is 2.34 to 2.38 MMBOED which includes 20 MBOED from planned turnarounds. First-quarter 2025 production is expected to be 2.34 to 2.38 MMBOED, which includes impacts of 20 MBOED from January weather and 5 MBOED from turnarounds.\nGuidance for 2025 includes DD&A of $11.3 to $11.5 billion and capital expenditures of approximately $12.9 billion. \nOperating Segments\nWe manage our operations through six operating segments, which are primarily defined by geographic region: Alaska; Lower 48; Canada; Europe, Middle East and North Africa; Asia Pacific; and Other International.\nCorporate and Other represents income and costs not directly associated with an operating segment, such as most interest income and expense; impacts from certain debt transactions; corporate overhead and certain technology activities, including licensing revenues; and unrealized holding gains or losses on equity securities. All cash and cash equivalents and short-term investments are included in Corporate and Other. \nOur key performance indicators, shown in the statistical tables provided at the beginning of the operating segment sections that follow, reflect results from our operations, including commodity prices and production.\nConocoPhillips   2024 10-K\n38\nResults of Operations \nTable of Contents\nResults of Operations\nThis section of the Form 10-K discusses year-to-year comparisons between 2024 and 2023. For discussion of year-to-year comparisons between 2023 and 2022, see \"Management's Discussion and Analysis of Financial Condition and Results of Operations\" in Part II, Item 7 of our 2023 10-K.\nConsolidated Results\nSummary Operating Statistics\n2024\n2023\n2022\nAverage Net Production\nCrude oil (MBD)\nConsolidated Operations\n969\n \n923 \n885 \nEquity affiliates\n13\n \n13 \n13 \nTotal crude oil\n982\n \n936 \n898 \nNatural gas liquids (MBD)\nConsolidated Operations\n304\n \n279 \n244 \nEquity affiliates\n8\n \n8 \n8 \nTotal natural gas liquids\n312\n \n287 \n252 \nBitumen (MBD)\n122\n \n81 \n66 \nNatural gas (MMCFD)\nConsolidated Operations\n2,200\n \n1,916 \n1,939 \nEquity affiliates\n1,233\n \n1,219 \n1,191 \nTotal natural gas\n3,433\n \n3,135 \n3,130 \nTotal Production \n(MBOED)\n1,987\n \n1,826 \n1,738 \nTotal Production \n(MMBOE)\n727\n \n666 \n634 \nDollars Per Unit\nAverage Sales Prices\nCrude oil (per bbl)\nConsolidated Operations\n$\n76.74\n \n78.97 \n97.23 \nEquity affiliates\n76.76\n \n78.45 \n97.31 \nTotal crude oil\n76.74\n \n78.96 \n97.23 \nNatural gas liquids (per bbl)\nConsolidated Operations\n22.43\n \n22.12 \n35.67 \nEquity affiliates\n51.53\n \n47.09 \n61.22 \nTotal natural gas liquids\n23.19\n \n22.82 \n36.50 \nBitumen (per bbl)\n47.92\n \n42.15 \n55.56 \nNatural gas (per mcf)\nConsolidated Operations\n2.61\n \n3.89 \n10.56 \nEquity affiliates\n8.22\n \n8.46 \n10.67 \nTotal natural gas\n4.69\n \n5.69 \n10.60 \n39\nConocoPhillips   2024 10-K\nResults of Operations \nTable of Contents\nMillions of Dollars\nWorldwide Exploration Expenses\nGeneral and administrative; geological and geophysical, lease rental, and other\n$\n309\n \n236 \n224 \nLeasehold impairment\n6\n \n53 \n89 \nDry holes\n40\n \n109 \n251 \nTotal Exploration Expenses\n$\n355\n \n398 \n564 \nTotal Company Production\nWe explore for, produce, transport and market crude oil, bitumen, natural gas, NGLs and LNG on a worldwide basis. At December 31, 2024, our operations were producing in the U.S., Norway, Canada, Australia, China, Malaysia, Qatar, Libya and Equatorial Guinea.\nTotal production of 1,987 MBOED increased 161 MBOED or nine percent in 2024 compared with 2023. Production increases include: \n•\nNew wells online in the Lower 48, Alaska, Australia, Canada, China, Libya and Norway.\n•\nOur acquisition of the remaining working interest in Surmont in the fourth quarter of 2023.\n•\nOur acquisition of Marathon Oil in the fourth quarter of 2024.\nThe increase in production during 2024 was partly offset by normal field decline.\nAfter adjusting for closed acquisitions and dispositions, production increased by 69 MBOED or three percent.\nConocoPhillips   2024 10-K\n40\nResults of Operations \nTable of Contents\nIncome Statement Analysis\nUnless otherwise indicated, all results in Income Statement Analysis are before-tax.\nBelow is select financial data provided on a consolidated basis. The full Income Statement can be found in",
  "item2": null
}