{
  "source_file": "cor-20250930.htm",
  "form_type": "10-K",
  "item1": "ITEM 1.    \nBUSINESS\nAs used herein, the terms “Company,” “Cencora,” “we,” “us,” or “our” refer to Cencora, Inc., a Delaware corporation.\nCencora is one of the largest global pharmaceutical sourcing and distribution services companies, helping both healthcare providers and pharmaceutical and biotech manufacturers improve patient access to products and enhance patient care. We deliver innovative programs and services designed to increase the effectiveness and efficiency of the pharmaceutical supply chain in both human and animal health. More specifically, we distribute a comprehensive offering of brand-name, specialty brand-name, and generic pharmaceuticals, over-the-counter healthcare products, home healthcare supplies and equipment, and related services to a wide variety of healthcare providers located in the United States and select global markets, including acute care hospitals and health systems, independent and chain retail pharmacies, mail order pharmacies, medical clinics, long-term care and alternate site pharmacies, physician practices, medical and dialysis clinics, veterinarians, and other customers. Additionally, we furnish healthcare providers and pharmaceutical manufacturers with an assortment of related services, including data analytics, outcomes research, reimbursement and pharmaceutical consulting services (including regulatory affairs, development consulting and scientific affairs, pharmacovigilance, and quality management and compliance) niche premium logistics services, inventory management, pharmacy automation, pharmacy management, and packaging solutions. \nReferences to “fiscal 2025,” “fiscal 2024,” and “fiscal 2023” refer to the fiscal years ended September 30, 2025, 2024, and 2023, respectively.\nIndustry Overview\nPharmaceutical sales in the United States, as recently estimated by IQVIA, an independent third-party provider of information to the pharmaceutical and healthcare industry, are expected to grow at a compound annual growth rate of approximat\ne\nly 8.4% f\nrom 2024 through 2029, an\nd the growth rate is dependent, in part, on pharmaceutical manufacturer price increases. In addition to general economic conditions, factors that impact the growth of the pharmaceutical industry in the U.S. and other industry trends include:\nAging Population.\n The number of individuals aged 65 and over in the U.S. is expected to be approximately 71 million by 2029 and is the most rapidly growing segment of the population. This age group suffers from more chronic \nillne\nsses and disabilities than the rest of the population and accounts for a substantial portion of total healthcare expenditures in the U.S.\nIntroduction of New Pharmaceuticals.\n Traditional research and development, as well as the advent of new research, production, and delivery methods, such as biotechnology and gene therapy, continue to generate new pharmaceuticals and delivery methods that are more effective in treating diseases. We believe ongoing research and development expenditures by the leading pharmaceutical manufacturers will contribute to continued growth of the industry. In particular, we believe ongoing research and development of biotechnology and other specialty pharmaceutical drugs will provide opportunities for the continued growth of our specialty pharmaceuticals business.\nUse of Generic and Biosimilar Pharmaceuticals.\n A number of patents for widely used brand-name pharmaceutical products will continue to expire during the next several years. In addition, increased emphasis by managed care and other third-party payors on utilization of generics and biosimilars has accelerated their growth. We consider the increase in generic and biosimilar usage a favorable trend because generic and biosimilar pharmaceuticals have historically provided us with a greater gross profit margin opportunity than brand-name products, although their lower prices reduce revenue growth. Generic pharmaceuticals currently account for approximately 90% of the prescription volume in the U.S.\nUse of Drug Therapies.\n In response to rising healthcare costs, governmental and private payors have adopted cost containment measures that encourage the use of efficient drug therapies to prevent or treat diseases. While national attention h\nas been focused on the overall increase in aggregate healthcare costs, we believe drug therapy has had a beneficial impact on healthcare costs by reducing expensive surgeries and prolonged hospital stays. According to the Centers for Medicare & Medicaid Services (“CMS”), pharmaceuticals currently account for approximately 9% of overall healthcare costs. Pharmaceutical manufacturers’ continued emphasis on research and development is expected to result in the continuing introduction of cost-effective drug therapies and new uses for existing drug therapies.\nOther economic conditions and certain risk factors could adversely affect our business and prospects (see Item 1A. Risk Factors).\n1\nTable of Contents \nThe Company\nWe serve our customers (healthcare providers and pharmaceutical and biotech manufacturers) through a geographically diverse network of distribution service centers and other operations in the United States and select global markets. In our pharmaceutical distribution businesses, we are typically the primary supplier of pharmaceutical and related products to our healthcare provider customers. We offer a broad range of services to our customers designed to enhance the efficiency and effectiveness of their operations, which allow them to improve the delivery of healthcare to patients and to lower overall costs in the pharmaceutical supply chain.\nStrategy\nOur business strategy is focused on the global pharmaceutical supply chain where we provide distribution and value-added services to healthcare providers (primarily pharmacies, health systems, medical and dialysis clinics, physicians, and veterinarians) and pharmaceutical manufacturers to improve channel efficiencies and support positive patient outcomes. Our strategy is one of driving executional excellence in our core distribution solutions business in the U.S. and internationally, while also investing in higher-margin, high-growth adjacencies where we provide solutions to pharmaceutical manufacturers to support the clinical development and commercialization of their therapies and support providers in driving efficiency and effectiveness of their operations. Implementing this disciplined and focused strategy in a seamless and unified way has allowed us to significantly expand our business. We are well positioned to grow revenue and increase operating income through the execution of the following key elements of our business strategy:\n•\nOptimize and Grow U.S. Healthcare Solutions Businesses. \nWe are well positioned in size and market breadth to continue to grow our U.S. Healthcare Solutions businesses as we make investments to improve our operating and capital efficiencies. Our U.S. human health distribution businesses, including specialty pharmaceuticals, anchor our growth and position in the pharmaceutical supply chain as we provide distribution services and deliver value-added solutions that improve the efficiency and competitiveness of both healthcare providers and pharmaceutical manufacturers, ultimately driving better healthcare for patients. \nWe are a leader in distribution and services to health systems, community oncologists, and retina specialists and have leading positions in other physician-administered products. We distribute plasma and other blood products, injectable pharmaceuticals, vaccines, and other specialty products. We are well positioned to service and support biotechnology therapies and advanced technologies such as cell and gene therapies. \nWe have introduced strategies to enhance our position in the generic marketplace, including our generic product private label program based in Ireland. We source generics globally, offer a value-added generic formulary program to our healthcare provider customers, and monitor our customers’ compliance with our generics program. We also provide data and other valuable services to our manufacturer customers.\nWe offer value-added services and solutions to assist healthcare providers and pharmaceutical manufacturers to improve their efficiency and their patient outcomes. Services for manufacturers include assistance with new product launches, product data reporting, and logistical support.\nOur provider solutions include: our Good Neighbor Pharmacy® program, which enables independent community pharmacies to compete more effectively through pharmaceutical benefit and merchandising programs; Elevate Provider Network®, our managed care network, which connects our retail pharmacy customers to payor plans throughout the country and is one of the largest in the United States; generic product purchasing and private label services; hospital pharmacy consulting designed to improve operational efficiencies; and packaging solutions for institutional and retail healthcare providers. We also offer services that optimize patient access and provide purchasing power to providers.\nWe believe we have one of the lowest operating cost structures among pharmaceutical distributors. Our robust distribution facility network includes a national distribution center in Columbus, Ohio, which offers pharmaceutical manufacturers a single shipping destination. We continue to seek opportunities to achieve increased productivity and drive operating income gains as we invest in and continue to implement warehouse automation technology, adopt “best practices” in warehousing activities, and increase operating leverage by increasing volume per full-service distribution facility. We continue to seek opportunities to expand our offerings in our human health distribution businesses. \nOur animal health business sells pharmaceuticals, vaccines, parasiticides, diagnostics, micro feed ingredients, and various other products to customers in both the companion animal and production animal markets. It also offers its customers a variety of value-added services, including its e-commerce platform, technology management systems, pharmacy fulfillment, inventory management system, equipment procurement consultation, special order fulfillment, \n2\nTable of Contents \nand educational seminars, which we believe closely integrate the animal health business with its customers’ day-to-day operations and provide them with meaningful incentives to remain customers.\nOur consulting service businesses provide reimbursement services that assist pharmaceutical companies in supporting access to branded drugs, contract field staffing, patient assistance and copay assistance programs, adherence programs, and other market access programs to pharmaceutical companies.\n•\nOptimize and Grow Our International Healthcare Solutions Businesses. \nWe are well positioned in size and market breadth to continue to grow our International Healthcare Solutions businesses as we invest to improve our operating and capital efficiencies. The International Healthcare Solutions reportable segment consists of businesses that focus on international pharmaceutical wholesale and related service operations and global commercialization services. The International Healthcare Solutions reportable segment distributes pharmaceuticals and other healthcare products and provides related services to healthcare providers, including pharmacies, doctors, health centers and hospitals primarily in Europe. It is a leading global specialty transportation and logistics provider for the biopharmaceutical industry. It also is a provider of specialized services, including regulatory affairs, market access, pharmacovigilance, development consulting and scientific affairs, and quality management and compliance, for the life sciences industry. The Canada business drives innovative partnerships with manufacturers, providers, and pharmacies to improve product access and efficiency throughout the healthcare supply chain.\n•\nAcquisitions and Investments. \nIn order to grow our core strategic offerings and to enter related markets, we have acquired and invested in businesses and will continue to consider additional acquisitions and investments. \nOn January 2, 2025, we acquired an 85% interest in Retina Consultants of America (“RCA”) for $4,042.0 million in cash, $694.4 million of contingent consideration related to equity units for certain RCA physicians and members of management that retained the remaining 15% interest in RCA, $545.7 million for the settlement of a net receivable resulting from a pre-existing commercial relationship between us and RCA, and $393.1 million for contingent consideration payable to the sellers associated with RCA’s achievement of certain predetermined business objectives in fiscal 2027 and fiscal 2028. We funded the cash purchase price through a combination of cash on hand and new debt financing. We believe the acquisition of RCA allows us to broaden our relationships with community providers and to build on our leadership in specialty pharmaceuticals within our U.S. Healthcare Solutions reportable segment.\n•\nDivestitures.\n In order to ensure alignment with our growth priorities, we have divested certain non-core businesses and may, from time to time, consider additional divestitures.\n•\nNew Reporting Structure.\n Recently, we undertook a strategic review of our business to ensure alignment with our growth priorities and strategic drivers. As a result of this review, we have reorganized certain business components within our reporting structure. Beginning in the first quarter of fiscal 2026, our reporting structure will be comprised of U.S. Healthcare Solutions, International Healthcare Solutions, and Other. The U.S. Healthcare Solutions reportable segment will consist of U.S. Human Health (excluding legacy U.S. Consulting Services). The International Healthcare Solutions reportable segment will consist of Alliance Healthcare, Innomar, World Courier, and strategic components of PharmaLex. Other, which is not considered a reportable segment, will consist of businesses for which we have begun to explore strategic alternatives and includes MWI Animal Health, Profarma, U.S. Consulting Services and the other components of PharmaLex. \nOperations\nOperating Structure\n \nWe are organized geographically based upon the products and services we provide to our customers. Our operations are comprised of two reportable segments: U.S. Healthcare Solutions and International Healthcare Solutions. \nU.S. Healthcare Solutions Segment\nThe U.S. Healthcare Solutions reportable segment distributes a comprehensive offering of brand-name, specialty brand-name and generic pharmaceuticals, over-the-counter healthcare products, home healthcare supplies and equipment, and related services to a wide variety of healthcare providers, including acute care hospitals and health systems, independent and chain retail pharmacies, mail order pharmacies, medical clinics, long-term care and alternate site pharmacies, and other customers. The U.S. Healthcare Solutions reportable segment also provides pharmaceutical distribution (including plasma and other blood products, injectable pharmaceuticals, vaccines, and other specialty pharmaceutical products) and additional services to physicians who specialize in a variety of disease states, especially oncology and retina, and to other healthcare providers, including hospitals, retinal practices, and dialysis clinics. The U.S. Healthcare Solutions reportable segment also provides pharmacy management, staffing and additional consulting services, and supply management software to a variety of retail and \n3\nTable of Contents \ninstitutional healthcare providers. Additionally, it delivers packaging solutions to institutional and retail healthcare providers. Through its animal health business, the U.S. Healthcare Solutions reportable segment sells pharmaceuticals, vaccines, parasiticides, diagnostics, micro feed ingredients, and various other products to customers in both the companion animal and production animal markets. It also offers demand-creating sales force services to manufacturers. \nInternational Healthcare Solutions Segment\nThe International Healthcare Solutions reportable segment consists of businesses that focus on international pharmaceutical wholesale and related service operations and global commercialization services. The International Healthcare Solutions reportable segment distributes pharmaceuticals, other healthcare products, and related services to healthcare providers, including pharmacies, doctors, health centers and hospitals primarily in Europe. It is a leading global specialty transportation and logistics provider for the biopharmaceutical industry. It also is a provider of specialized services, including regulatory affairs, market access, pharmacovigilance, development consulting and scientific affairs, and quality management and compliance, for the life sciences industry. In Canada, the business drives innovative partnerships with manufacturers, providers, and pharmacies to improve product access and efficiency throughout the healthcare supply chain.\nSales and Marketing\n \nThe majority of U.S. Healthcare Solutions’ sales force is led nationally, with geographic focus and specialized by either healthcare provider type or size. Customer service representatives are centralized to respond to customer needs in a timely and effective manner. U.S. Healthcare Solutions also has support professionals focused on its various technologies and service offerings. U.S. Healthcare Solutions’ sales teams also serve national account customers through close coordination with local distribution centers and ensure that our customers are receiving service offerings that meet their needs. Our International Healthcare Solutions’ businesses each have independent sales forces that specialize in their respective product and service offerings. In addition, we have an enterprise-wide marketing team that coordinates branding and all other marketing activities across the Company.\nCustomers\nWe have a diverse customer base that includes institutional and retail healthcare providers as well as pharmaceutical manufacturers. Institutional healthcare providers include acute care hospitals, health systems, mail order pharmacies, long-term care and other alternate care pharmacies, providers of pharmacy services to such facilities, physicians, and physician group practices. Retail healthcare providers include national and regional retail drugstore chains, independent community pharmacies, pharmacy departments of supermarkets and mass merchandisers, and veterinarians. We are typically the primary source of supply for our healthcare provider customers. Our manufacturer customers include branded, generic, and biotechnology manufacturers of prescription pharmaceuticals, as well as over-the-counter product and health and beauty aid manufacturers. In addition, we offer a broad range of value-added solutions designed to enhance the operating efficiencies and competitive positions of our customers, thereby allowing them to improve the delivery of healthcare to patients and consumers.\nWe continually seek to strengthen our existing customer relationships and seek new customers to enhance our revenues, results of operations, financial position, and cash flows. Our top 10 customers, including governmental agencies and group purchasing organizations (“GPO”), represented approximately 66% of revenue in fiscal 2025. In fiscal 2025, Walgreens and Boots together accounted for approximately 25% of revenue and Evernorth Health Services accounted for approximately 13% of revenue. The loss of any key customer or GPO relationship could adversely affect future revenue and results of operations. Additionally, from time to time, key contracts may be terminated in accordance with their terms or extended, renewed, or replaced prior to their expiration dates. If those contracts are not renewed, or are extended, renewed, or replaced at less favorable terms, they may negatively impact our revenue, results of operations, financial position, and cash flows.\nSuppliers\nWe obtain pharmaceutical and other products from manufacturers, none of which accounted for 10% or more of our purchases in fiscal 2025. The loss of a supplier could adversely affect our business if alternate sources of supply are unavailable since we are committed to be the primary source of pharmaceutical products for a majority of our customers. We believe that our relationships with our suppliers are generally good. The 10 largest suppliers in fiscal 2025 accounted for approximately 57% of our purchases.\nInformation Systems\nThe U.S. Healthcare Solutions operating segment’s distribution facilities in the U.S. primarily operate under a single enterprise resource planning (“ERP”) system. U.S. Healthcare Solutions’ ERP system provides for, among other things, electronic order entry by customers, invoice preparation and purchasing, and inventory tracking. Our International Healthcare Solutions operating segment operates under various operating systems. We continue to make investments to enhance and \n4\nTable of Contents \nupgrade the operating systems utilized by our International Healthcare Solutions operating segments, including, but not limited to, Alliance Healthcare. We also continue to invest in cybersecurity capabilities as a key priority to improve and enhance our cyber resiliency. \nAdditionally, we continue to improve our entity-wide infrastructure environment to drive efficiency, capabilities, and speed to market, and we are seeking to use AI to improve our business operations, financial position, and results of operations.\nTo comply with pedigree and other supply chain custody requirements, we have made significant investments in our secure supply chain information systems (see Item 1A. Risk Factors - \nIncreasing governmental efforts to regulate the pharmaceutical supply chain may increase our costs and reduce our profitability)\n. We will continue to invest in advanced information systems and automated warehouse technology. \nU.S. Healthcare Solutions has made significant investments in its electronic ordering systems. U.S. Healthcare Solutions’ systems are intended to strengthen customer relationships by helping customers to reduce operating costs, and by providing them a platform for various basic and value-added services, including product demand data, inventory replenishment, single-source billing, third-party claims processing, real-time price and incentive updates, and price labels.\nU.S. Healthcare Solutions processes a substantial portion of its purchase orders, invoices, and payments electronically, and it continues to make substantial investments to expand its electronic interface with its suppliers. U.S. Healthcare Solutions has warehouse operating systems, which are used to manage the majority of its transactional volume. The warehouse operating systems have improved U.S. Healthcare Solutions’ productivity and operating leverage. \nCompetition\nWe operate in a highly competitive global environment in the distribution of pharmaceuticals and related healthcare services. Our largest competitors are McKesson Corporation (“McKesson”), Cardinal Health, Inc. (“Cardinal”), and UPS Logistics, among others. Our U.S. human health distribution businesses compete with both McKesson and Cardinal, as well as national generic distributors and regional distributors within pharmaceutical distribution. In addition, we compete with manufacturers who sell directly to customers, chain drugstores who manage their own warehousing, specialty distributors, and packaging and healthcare technology companies. Alliance Healthcare, MWI Animal Health, World Courier, and our consulting businesses also face competition from a variety of entities. In all areas, competitive factors include price, product offerings, value-added service programs, service and delivery, credit terms, and customer support.\nIntellectual Property\nWe use a number of trademarks and service marks. All of the principal trademarks and service marks used in the course of our business have been registered in the U.S. and, in some cases, in foreign jurisdictions, or are the subject of pending applications for registration.\nWe have developed or acquired various proprietary products, processes, software, and other intellectual property that are used either to facilitate the conduct of our business or that are made available as products or services to customers. We generally seek to protect such intellectual property through a combination of trade secret, patent and copyright laws, and through confidentiality and other contractually imposed protections.\nWe hold patents and have patent applications pending that relate to certain of our products, particularly our automated pharmacy dispensing equipment, our medication and supply dispensing equipment, certain warehousing equipment, and some of our proprietary packaging solutions. We seek patent protection for our proprietary intellectual property from time to time as appropriate.\nAlthough we believe that our patents or other proprietary products and processes do not infringe upon the intellectual property rights of any third parties, third parties may assert infringement claims against us from time to time.\nHuman Capital Resources\nWe believe our success in the global marketplace depends on our ability to attract and retain a talented and skilled workforce. We aspire to accelerate business results by fostering a dynamic workplace, with the aim of supporting employees to perform at their full potential, contribute to our success, and pursue opportunities for professional development and career advancement.\nWorkforce\nAs of September 30, 2025, we had more than 51,000 employees globally, of which approximately 47,000 were full-time employees and approximately 41% were U.S.-based employees.\n5\nTable of Contents \nAs of September 30, 2025, approximately 24% of our global employees were covered by collective bargaining agreements, nearly all of whom were employees located outside of the U.S.\nInvestment in Team Members and Culture\nWe consider talent attraction, retention, and development opportunities to be key drivers in pursuit of our strategic priorities. We support employee growth and advancement by offering a variety of benefits to eligible employees including:\n•\nLeadership and professional development programs and resources;\n•\nLeadership and executive coaching; \n•\nTuition reimbursement;\n•\nOpportunities to volunteer and participate in mentorship and support programs, such as our employee resource groups, which celebrate the shared backgrounds and experiences of our team members and aim to strengthen our intersecting communities inside and outside of Cencora; \n•\nRecognition opportunities for excellence, such as our True Blue team member recognition program; and \n•\nPersonalized learning and skill-building programs offered through our global learning experience platform.\nOur goal is to provide our team members with pathways for career development, access to programs and benefits that are designed to promote fuller, healthier lives and opportunities to meaningfully participate in their respective communities. Our talent development programs are designed to help provide a supportive and engaging work environment where team members can excel. Additionally, the Cencora Team Assistance Fund exists to help employees who are experiencing extreme financial hardship due to a catastrophic event outside of their control.\nWe are focused on helping our team members create healthier futures for themselves and their families, including by offering competitive and comprehensive compensation and benefits packages tailored to the specific needs of our employee populations in the various countries where we have operations.\nRecognizing the importance of investing in the health and wellness of our team members, our comprehensive benefits packages attempt to address the physical, emotional, financial, and social dimensions of wellness. Our offerings, which vary in the different geographic locations of our workforce, include (i) health and insurance benefits; (ii) paid time off; (iii) flexible work arrangements based on role; (iv) retirement and employee stock purchase plans; (v) paid parental and caregiver leave programs; and (vi) back-up child and elder care. We believe that these programs are important in supporting our team members’ overall well-being and professional growth.\nImportantly, we continue to make meaningful investments in supporting and building our talent and enhancing our culture. We conduct annual, Company-wide surveys to gauge employee satisfaction and identify areas in which we can enhance and improve employee experience. Employee surveys allow employee voices to be heard and are valuable in shaping our Company’s culture.\nTeam Member Safety\nWe strive to make our workplaces safe for all team members. In addition to utilizing a peer-to-peer safety program, we regularly convene Company leaders to review and evaluate safety data and issue operational excellence scorecards. Distribution center team members receive training on proper safety procedures and incentive opportunities, with safety performance tracked and shared across the organization. \nGovernment Regulation\nWe are subject to, and affected by, a variety of laws, regulations, and policies from many countries, including extensive oversight by U.S., United Kingdom (“U.K.”) and European Union (“EU”) governmental entities.\nThe U.S. Drug Enforcement Administration (“DEA”), the U.S. Food and Drug Administration (“FDA”), the U.S. Department of Justice, and various other federal and state authorities regulate the purchase, storage, and/or distribution of pharmaceutical products, including controlled substances. Wholesale distributors of controlled substances must hold valid DEA licenses, meet various security and operating standards, and comply with regulations governing the sale, marketing, packaging, holding, and distribution of controlled substances. \nWe and our customers are subject to fraud and abuse laws, including the federal anti-kickback statute and the False Claims Act. The anti-kickback statute prohibits persons from soliciting, offering, receiving, or paying any remuneration in order \n6\nTable of Contents \nto induce the purchasing, leasing, or ordering, or arrange for or recommend purchasing, leasing, or ordering items or services that are in any way paid for by Medicare, Medicaid, or other federal healthcare programs. The False Claims Act prohibits knowingly submitting, or causing the submission, of false or fraudulent claims for payment to the government and authorizes treble damages and substantial civil penalties in the case of violations. The fraud and abuse laws and regulations are broad in scope and are subject to frequent and varied interpretation.\nIn recent years, some states have passed or proposed laws and regulations that are intended to protect the safety of the pharmaceutical supply chain. These laws and regulations are designed to prevent the introduction of counterfeit, diverted, adulterated, or mislabeled pharmaceuticals into the distribution system. At the federal level, the supply chain security legislation known as the Drug Quality and Security Act (“DQSA”) became law in 2013. Title II of the DQSA, known as the Drug Supply Chain Security Act (“DSCSA”), establishes federal traceability standards requiring drugs to be labeled and tracked at the lot level, preempts state drug pedigree requirements, and requires all supply-chain stakeholders to participate in an electronic, interoperable prescription drug traceability system. The DSCSA also establishes requirements for drug wholesale distributors and third-party logistics providers, including licensing requirements applicable in states that had not previously licensed third-party logistics providers. The FDA issued a proposed rule on February 4, 2022, which, when finalized, will establish national standards for the licensure of wholesale drug distributors and third-party logistics providers. The standards, terms, and conditions established for licensure under this regulation would be applicable to both federal and state licenses. There can be no assurance that we are fully compliant with DQSA and DSCSA requirements, or with additional related state regulatory and licensing requirements, and any failure to comply may result in suspension or delay of certain operations and additional costs to bring our operations into compliance. These and other requirements will continue to increase the cost of our operations.\nThe regulation of public and private health insurance and benefit programs can also affect our business, and scrutiny of the healthcare delivery and reimbursement systems in the U.S., including those related to the importation and reimportation of certain drugs from foreign markets, can be expected to continue at both the state and federal levels. This process may result in additional legislation and/or regulation governing the production, delivery, or pricing of pharmaceutical products and other healthcare services. In addition, changes in the interpretations of existing regulations may result in significant additional compliance costs or the discontinuation of our ability to continue to operate certain of our distribution centers, which may have a material adverse effect on our financial condition and results of operations.\nAny future reductions in Medicare or Medicaid reimbursement rates could negatively impact our customers’ businesses and their ability to continue to purchase drugs from us. We cannot predict what additional initiatives, if any, will be adopted, when they may be adopted, or what impact they may have on us.\nWe are subject to various federal, state, and local environmental laws, including with respect to the sale, transportation, storage, handling, and disposal of hazardous or potentially hazardous substances, as well as laws relating to safe working conditions and laboratory practices.\nThe costs, burdens, and/or impacts of complying with federal and state regulations could be significant and the failure to comply with any such legal requirements could have a significant impact on our financial position, results of operations, and cash flows.\nSee “Risk Factors” for a discussion of additional legal and regulatory developments, as well as potential enforcement actions or other litigation that could arise out of our failure to adequately comply with applicable laws and regulations that may negatively affect our financial position, results of operations, and cash flows.\nData Privacy and Security Regulation\nOur businesses, depending upon their operations and locations, may be subject to foreign, federal, and local privacy and security laws, regulations, and directives concerning the collection, use, analysis, retention, storage, protection, transfer, disclosure, and/or disposal of personal data including, without limitation, the Health Insurance Portability and Accountability Act of 1996, as amended by the final regulations promulgated pursuant to the Health Information Technology for Economic and Clinical Health Act (“HITECH Act”) found in the American Recovery and Reinvestment Act of 2009 (collectively, “HIPAA”), the EU General Data Protection Regulation (“GDPR”), the U.K. GDPR, the Personal Information Protection and Electronic Documents Act of 2000 (“PIPEDA”), U.S. state, U.S. city, and Canadian provincial privacy, consumer protection, cybersecurity, AI, and breach notification laws, regulations, and directives, and equivalent foreign laws. These laws, regulations and directives impose complex, inconsistent, stringent, and evolving privacy and security standards and potentially significant liability, including criminal and civil penalties for noncompliance. We have a global privacy compliance program to facilitate our ongoing efforts to comply with these laws, regulations, and directives. There is also an emerging trend of governmental entities proposing and providing regulatory guidance related to AI, including generative AI. If we or our third-party providers are restricted from using AI as a result of any regulatory views, laws or other measures, it could impact our operations, increase our compliance expense and burden, and cause us to incur costs to replace or modify our use of AI.\n7\nTable of Contents \nAvailable Information\nThe Company’s Annual Reports on Form 10-K, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K, and any amendments to such reports filed pursuant to Sections 13(a) and 15(d) of the Exchange Act, are filed with the SEC. Such reports and other information filed or furnished by the Company with the SEC are available free of charge through our website at \ninvestor.cencora.com\n after we electronically file with or furnish them to the SEC and may also be viewed using the SEC’s website at \nwww.sec.gov\n.\nThe Company periodically provides certain information for investors on its corporate website, \nwww.cencora.com\n, and its investor relations website, \ninvestor.cencora.com\n. This includes press releases and other information about financial performance, information on corporate responsibility matters, and details related to the Company’s annual meeting of stockholders. The information contained on the websites referenced in this Annual Report on Form 10-K is not incorporated by reference into this filing. Further, the Company’s references to website URLs are intended to be inactive textual references only.\n8\nTable of Contents",
  "item7": "ITEM 7.  \nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nOur Management’s Discussion and Analysis of Financial Condition and Results of Operations (“MD&A”) includes the following: an overview that provides a summary of our segments and highlights from fiscal 2025; a more detailed analysis of our results of operations; our capital resources and liquidity, which discusses key aspects of our statements of cash flows, changes in our balance sheets and our financial commitments; and a summary of our critical accounting estimates that involve a significant level of estimation uncertainty. Our MD&A should be read in conjunction with the Consolidated Financial Statements and notes thereto contained herein.\nOur MD&A focuses on discussion of year-over-year comparisons between fiscal 2025 and fiscal 2024. Discussion of fiscal 2023 results and year-over-year comparisons between fiscal 2024 and fiscal 2023 that are not included in this Annual Report on Form 10-K can be found in “Management’s Discussion and Analysis of Financial Condition and Results of Operations” in Part II, Item 7 of our Annual Report on Form 10-K for fiscal 2024.\nThe following discussion contains forward-looking statements that are subject to risks and uncertainties. Actual results may differ from those referred to herein due to a number of factors, including but not limited to risks described in Item 1A, Risk Factors, in this Annual Report on Form 10-K.\nOverview\nWe are one of the largest global pharmaceutical sourcing and distribution services companies, helping both healthcare providers and pharmaceutical and biotech manufacturers improve patient access to products and enhance patient care. We deliver innovative programs and services designed to increase the effectiveness and efficiency of the pharmaceutical supply chain in both human and animal health.\nWe are organized geographically based upon the products and services we provide to our customers, and we report our results under two reportable segments: U.S. Healthcare Solutions and International Healthcare Solutions. \nU.S. Healthcare Solutions Segment\nThe U.S. Healthcare Solutions reportable segment distributes a comprehensive offering of brand-name, specialty brand-name and generic pharmaceuticals, over-the-counter healthcare products, home healthcare supplies and equipment, and related services to a wide variety of healthcare providers, including acute care hospitals and health systems, independent and chain retail pharmacies, mail order pharmacies, medical clinics, long-term care and alternate site pharmacies, and other customers. The U.S. Healthcare Solutions reportable segment also provides pharmaceutical distribution (including plasma and other blood products, injectable pharmaceuticals, vaccines, and other specialty pharmaceutical products) and additional services to physicians who specialize in a variety of disease states, especially oncology and retina, and to other healthcare providers, including hospitals, specialty retinal practices, and dialysis clinics. The U.S. Healthcare Solutions reportable segment also provides pharmacy management, staffing and additional patient access and adherence support services, and supply management software to a variety of retail and institutional healthcare providers. Additionally, it delivers packaging solutions to institutional and retail healthcare providers. Through its animal health business, the U.S. Healthcare Solutions reportable segment sells pharmaceuticals, vaccines, parasiticides, diagnostics, micro feed ingredients, and various other products to customers in both the companion animal and production animal markets. It also offers demand-creating sales force services to manufacturers.\nInternational Healthcare Solutions Segment\nThe International Healthcare Solutions reportable segment consists of businesses that focus on international pharmaceutical wholesale and related service operations and global commercialization services. The International Healthcare Solutions reportable segment distributes pharmaceuticals and other healthcare products and provides related services to healthcare providers, including pharmacies, doctors, health centers and hospitals primarily in Europe. It is a leading global specialty transportation and logistics provider for the biopharmaceutical industry. It is also a provider of specialized services, including regulatory affairs, market access, pharmacovigilance, development consulting and scientific affairs, and quality management and compliance, for the life sciences industry. In Canada, the business drives innovative partnerships with manufacturers, providers, and pharmacies to improve product access and efficiency throughout the healthcare supply chain.\n30\nTable of Contents \nRecent Development\nRecently, we undertook a strategic review of our business to ensure alignment with our growth priorities and strategic drivers. As a result of this review, we have reorganized certain business components within our reporting structure. Beginning in the first quarter of fiscal 2026, our reporting structure will be comprised of U.S. Healthcare Solutions, International Healthcare Solutions, and Other. The U.S. Healthcare Solutions reportable segment will consist of U.S. Human Health (excluding legacy U.S. Consulting Services). The International Healthcare Solutions reportable segment will consist of Alliance Healthcare, Innomar, World Courier, and strategic components of PharmaLex. Other, which is not considered a reportable segment, will consist of businesses for which we have begun to explore strategic alternatives and includes MWI Animal Health, Profarma, U.S. Consulting Services and the other components of PharmaLex.\nExecutive Summary\nThis executive summary provides highlights from the results of operations that follow: \n•\nRevenue increased by $27.4 billion, or 9.3%, from the prior fiscal year due to growth in both reportable segments. The U.S. Healthcare Solutions segment grew its revenue by $25.6 billion, or 9.7%, from the prior fiscal year due to overall market growth largely driven by unit volume growth, including increased sales of specialty products to health systems and physician practices and increased sales of products labeled for diabetes and/or weight loss in the GLP-1 class of $7.7 billion, or 26.9%. International Healthcare Solutions’ revenue increased by $1.7 billion, or 6.1%, from the prior fiscal year.\n•\nGross profit increased by $1,568.5 million, or 15.8%, from the prior fiscal year primarily due to the increase in gross profit in the U.S. Healthcare Solutions reportable segment and larger gains from antitrust litigation settlements. U.S. Healthcare Solutions’ gross profit increased by $1,482.3 million, or 23.1%, from the prior fiscal year primarily due to increased sales and the January 2025 acquisition of RCA. Gross profit in International Healthcare Solutions decreased $5.6 million, or 0.2%, from the prior fiscal year.\n•\nTotal operating expenses increased by $1,115.2 million, or 14.4%, from the prior fiscal year primarily due to the January 2025 acquisition of RCA, a larger goodwill impairment in fiscal 2025, and an increase in acquisition-related deal and integration expenses, offset in part by a decrease in litigation and opioid-related expenses in the current fiscal year. \n•\nTotal segment operating income increased by $574.7 million, or 15.8%, from the prior fiscal year. U.S. Healthcare Solutions’ operating income increased by $639.8 million, or 21.8%, from prior fiscal year in part due to the January 2025 acquisition of RCA. International Healthcare Solutions’ operating income decreased by $65.1 million, or 9.1%, from the prior fiscal year.\n•\nOur effective tax rates were 30.6% and 24.2% in fiscal 2025 and 2024, respectively. Our effective tax rate in fiscal 2025 was higher than the U.S. statutory rate primarily due to the impairments of PharmaLex goodwill and an equity investment, which are largely not deductible for income tax purposes, U.S. state income taxes, and an increase in the amount of unrecognized tax benefits, offset in part by the benefit of income taxed at rates lower than the U.S. statutory rate.\n31\nTable of Contents \nResults of Operations\nFiscal 2025 compared to Fiscal 2024 \nRevenue\n \nFiscal Year Ended\nSeptember 30,\n(dollars in thousands)\n2025\n2024\nChange\nU.S. Healthcare Solutions\nHuman Health\n$\n285,287,506 \n$\n259,973,909 \n9.7%\nAnimal Health\n5,694,517 \n5,365,518 \n6.1%\nTotal U.S. Healthcare Solutions\n290,982,023 \n265,339,427 \n9.7%\nInternational Healthcare Solutions\nAlliance Healthcare\n24,394,833 \n23,061,721 \n5.8%\nOther Healthcare Solutions\n5,971,490 \n5,565,821 \n7.3%\nTotal International Solutions\n30,366,323 \n28,627,542 \n6.1%\nIntersegment eliminations\n(15,527)\n(8,370)\nRevenue\n$\n321,332,819 \n$\n293,958,599 \n9.3%\nOur future revenue growth will continue to be affected by various factors, such as industry growth trends, including drug utilization (e.g., products labeled for diabetes and/or weight loss in the GLP-1 class), the introduction of new, innovative brand therapies and vaccines, the likely increase in the number of generic drugs and biosimilars that will be available over the next few years as a result of the expiration of certain drug patents held by brand-name pharmaceutical manufacturers and the rate of conversion from brand products to those generic drugs and biosimilars, price inflation and price deflation, general economic conditions in the United States and Europe, currency exchange rates, competition within the industry, customer consolidation, changes in pharmaceutical manufacturer pricing and distribution policies and practices, increased downward pressure on government and other third-party reimbursement rates to our customers, and changes in government rules and regulations.\nRevenue increased by $27.4 billion, or 9.3%, from the prior fiscal year due to growth in both reportable segments.\nThe U.S. Healthcare Solutions segment grew its revenue by $25.6 billion, or 9.7%, from the prior fiscal year primarily due to overall market growth largely driven by unit volume growth, including increased sales of specialty products to health systems and physician practices and increased sales of products labeled for diabetes and/or weight loss in the GLP-1 class of $7.7 billion, or 26.9%. Sales, including GLP-1 products, to our two largest customers increased by $6.2 billion from the prior fiscal year.\nInternational Healthcare Solutions’ revenue increased by $1.7 billion, or 6.1%, from the prior fiscal year primarily due to increased sales at our European distribution business of $1.3 billion.\nA number of our contracts with customers, including group purchasing organizations, are typically subject to expiration each year. We may lose a key customer if an existing contract with such customer expires without being extended, renewed, or replaced. As previously disclosed, we received notice of non-renewal from an oncology customer, and in June 2025, our sales contract with that customer was terminated. Over the next twelve months, there are no key contracts scheduled to expire. Additionally, from time to time, key contracts may be terminated in accordance with their terms or extended, renewed, or replaced prior to their expiration dates. If those contracts are extended, renewed, or replaced at less favorable terms, they may also negatively impact our revenue, results of operations, and cash flows. \n32\nTable of Contents \nGross Profit\n \nFiscal Year Ended\nSeptember 30,\n(dollars in thousands)\n2025\n2024\nChange\nU.S. Healthcare Solutions\n$\n7,905,426 \n$\n6,423,114 \n23.1%\nInternational Healthcare Solutions\n3,315,341 \n3,320,978 \n(0.2)%\nIntersegment eliminations\n(5,905)\n(3,048)\nGains from antitrust litigation settlements\n236,372 \n170,904 \n \nLIFO credit\n76,876 \n52,168 \n \nTurkey highly inflationary impact\n(49,571)\n(54,087)\nGross profit\n$\n11,478,539 \n$\n9,910,029 \n15.8%\nGross profit increased by $1,568.5 million, or 15.8%, from the prior fiscal year primarily due to the increase in gross profit in the U.S. Healthcare Solutions reportable segment and larger gains from antitrust litigation settlements.\nU.S. Healthcare Solutions’ gross profit increased by $1,482.3 million, or 23.1%, from the prior fiscal year primarily due to increased sales and the January 2025 acquisition of RCA. As a percentage of revenue, U.S. Healthcare Solutions’ gross profit margin of 2.72% in the current fiscal year increased 30 basis points compared to the prior fiscal year primarily due to the January 2025 acquisition of RCA, offset in part by higher sales of GLP-1 products, which have lower gross profit margins, and lower sales of COVID vaccines, which have higher gross profit margins.\nGross profit in International Healthcare Solutions decreased $5.6 million, or 0.2%, from the prior fiscal year as the decline in gross profit at our global specialty logistics business and our specialized consulting services business was largely offset in part by an increase in gross profit at our European distribution business and our less-than-wholly-owned Brazil full-line distribution business.\nWe recognized gains from antitrust litigation settlements with pharmaceutical manufacturers of $236.4 million and $170.9 million in fiscal 2025 and 2024, respectively. The gains were recorded as reductions to Cost of Goods Sold (see Note 13 of the Notes to Consolidated Financial Statements).\nOur cost of goods sold includes a last-in, first-out (“LIFO”) provision that is affected by manufacturer pricing practices, which may be impacted by market and other external influences, changes in inventory quantities, and product mix, many of which are difficult to predict. Changes to any of the above factors may have a material impact on our annual LIFO provision. The LIFO credit in fiscal 2025 was higher than the LIFO credit in fiscal 2024 primarily due to higher generic pharmaceutical deflation, offset in part by slightly higher brand pharmaceutical inflation.\nWe recognized expenses in Cost of Goods Sold of $49.6 million and $54.1 million in fiscal 2025 and 2024, respectively, related to the impact of Turkey highly inflationary accounting driven by the continued weakening of the Turkish Lira.\nOperating Expenses\n \nFiscal Year Ended\nSeptember 30,\n(dollars in thousands)\n2025\n2024\nChange\nDistribution, selling, and administrative\n$\n6,493,842 \n$\n5,661,106 \n14.7%\nDepreciation and amortization\n1,051,075 \n1,091,974 \n(3.7)%\nLitigation and opioid-related expenses, net\n60,671 \n227,070 \n \nAcquisition-related deal and integration expenses\n291,044 \n103,001 \nRestructuring and other expenses\n229,422 \n233,629 \nGoodwill impairment\n723,884 \n418,000 \nTotal operating expenses\n$\n8,849,938 \n$\n7,734,780 \n14.4%\nDistribution, selling, and administrative expenses increased by $832.7 million, or 14.7%, from the prior fiscal year primarily due to the January 2025 acquisition of RCA and to support our revenue growth. As a percentage of revenue, distribution, selling, and administrative expenses were 2.02% in the current fiscal year and represent an increase of 9 basis points compared to the prior fiscal year primarily due to the January 2025 acquisition of RCA, offset in part by our improved operating leverage from our 9.3% revenue growth from the prior fiscal year. \n33\nTable of Contents \nDepreciation expense increased by 15.3% from the prior fiscal year. Amortization expense decreased by 16.1% from the prior fiscal year due to certain tradenames becoming fully amortized in connection with our company name change to Cencora and the gradual transition away from other tradenames used, which were acquired through prior acquisitions.\nLitigation and opioid-related expenses, net in fiscal 2025 included legal fees in connection with opioid lawsuits and investigations.\nLitigation and opioid-related expenses, net in fiscal 2024 included a $214.0 million litigation expense accrual for litigation related to the distribution of prescription opioid medications, a $49.1 million litigation expense accrual related to our animal health business (see Note 12 of the Notes to Consolidated Financial Statements) and $56.1 million of legal fees in connection with opioid lawsuits and investigations, offset in part by a net $92.2 million opioid litigation settlement accrual reduction primarily as a result of our prepayment of the net present value of a future obligation as permitted under our opioid settlement agreements. \nAcquisition-related deal and integration expenses in fiscal 2025 primarily included costs related to the acquisition of RCA, including expenses related to equity units retained by RCA physicians and members of management of $121.7 million and $19.6 million related to the remeasurement of the fair value of contingent consideration associated with the RCA acquisition (see Note 2 of the Notes to Consolidated Financial Statements), and the continued integration of PharmaLex. Acquisition-related deal and integration expenses in fiscal 2024 primarily related to the integration of Alliance Healthcare and PharmaLex. \nRestructuring and other expenses are comprised of the following:\nFiscal Year Ended\nSeptember 30,\n(in thousands)\n2025\n2024\nRestructuring and employee severance costs\n$\n101,562 \n$\n69,968 \nBusiness transformation efforts\n122,286 \n130,069 \nOther, net\n5,574 \n33,592 \n    Total restructuring and other expenses\n$\n229,422 \n$\n233,629 \nRestructuring and employee severance costs in fiscal 2025 primarily included expenses incurred related to workforce reductions in both of our reportable segments. Restructuring and employee severance costs in fiscal 2024 primarily included expenses incurred related to facility closures in connection with our office optimization plan and workforce reductions in both of our reportable segments. \nBusiness transformation efforts in fiscal 2025 and 2024 included rebranding costs associated with our name change to Cencora and non-recurring expenses related to significant strategic initiatives to improve operational efficiency, including certain technology initiatives. The majority of these costs related to services provided by third-party consultants.\nIn fiscal 2024, we experienced a cybersecurity event where data from our information systems was exfiltrated. In connection with this event, we incurred costs that were recorded in Other, net in the above table. The majority of the costs included in Other, net in fiscal 2024 related to this cybersecurity event.\nWe recorded goodwill impairments of $723.9 million and $418.0 million related to PharmaLex in fiscal 2025 and 2024, respectively (see Note 5 of the Notes to Consolidated Financial Statements). \n34\nTable of Contents \nOperating Income \n \nFiscal Year Ended\nSeptember 30,\n(dollars in thousands)\n2025\n2024\nChange\nU.S. Healthcare Solutions\n$\n3,574,699 \n$\n2,934,877 \n21.8%\nInternational Healthcare Solutions\n648,274 \n713,379 \n(9.1)%\nTotal segment operating income\n4,222,973 \n3,648,256 \n15.8%\nGains from antitrust litigation settlements\n236,372 \n170,904 \n \nLIFO credit\n76,876 \n52,168 \n \nTurkey highly inflationary impact\n(49,571)\n(54,087)\nAcquisition-related intangibles amortization\n(553,028)\n(660,292)\nLitigation and opioid-related credit\n(60,671)\n(227,070)\nAcquisition-related deal and integration expenses\n(291,044)\n(103,001)\nRestructuring and other expenses\n(229,422)\n(233,629)\nGoodwill impairment\n(723,884)\n(418,000)\nOperating income\n$\n2,628,601 \n$\n2,175,249 \n20.8%\nU.S. Healthcare Solutions’ operating income increased $639.8 million, or 21.8%, from the prior fiscal year primarily due to the increase in gross profit, as noted above, and was offset in part by the increase in operating expenses. As a percentage of revenue, U.S. Healthcare Solutions operating income margin was 1.23% and represents a 12-basis point increase from the prior fiscal year due to the increase in gross profit margin, as described above in the Gross Profit section, offset in part by the increase in the operating expense margin.\nInternational Healthcare Solutions’ operating income decreased by $65.1 million, or 9.1%, from the prior fiscal year. The decrease was primarily due to lower operating income at our global specialty logistics business and our specialized consulting services business. \nOther Loss (Income), Net\nOther loss (income), net includes a $113.5 million impairment of an equity investment that was made in fiscal 2021 and a $35.5 million loss on the divestiture of non-core businesses, offset in part by our portion of an equity method investment’s gain on the sale of a business of $39.7 million and a $14.1 million gain on the remeasurement of an equity investment in fiscal 2025.\nInterest Expense, Net\nInterest expense, net and the respective weighted average interest rates are as follows:\nFiscal Year Ended September 30,\n \n2025\n2024\n(dollars in thousands)\nAmount\nWeighted Average\nInterest Rate\nAmount\nWeighted Average\nInterest Rate\nInterest expense\n$\n419,753 \n4.30%\n$\n248,682 \n3.91%\nInterest income\n(128,205)\n5.26%\n(91,691)\n5.41%\nInterest expense, net\n$\n291,548 \n \n$\n156,991 \n \nInterest expense, net increased $134.6 million, or 85.7%, from the prior fiscal year due to the increase in interest expense, offset in part by an increase in interest income. The increase in interest expense was primarily due to the issuance of our $1.8 billion of senior notes in December 2024 and the $1.5 billion variable-rate term loan, which we borrowed in January 2025 to finance a portion of the RCA acquisition, increased revolving credit facility borrowings to cover short-term working capital needs, and the May 2025 issuance of our €1.0 billion of senior notes, offset in part by the repayment of our $500 million of senior notes that matured in March 2025. The increase in interest income was driven by higher average investment cash balances in fiscal 2025 in comparison to fiscal 2024.  \n35\nTable of Contents \nIncome Tax Expense\n    Our effective tax rates were 30.6% and 24.2% in fiscal 2025 and 2024, respectively. Our effective tax rate in fiscal 2025 was higher than the U.S. statutory rate primarily due to the impairments of PharmaLex goodwill and an equity investment, which are largely not deductible for income tax purposes, U.S. state income taxes, and an increase in the amount of unrecognized tax benefits, offset in part by the benefit of income taxed at rates lower than the U.S. statutory rate. Our effective tax rate in fiscal 2024 was higher than the U.S. statutory rate primarily due to the PharmaLex goodwill impairment, which was largely not deductible for income tax purposes, and U.S. state income taxes, offset in part by the discrete tax benefits associated with foreign valuation allowance adjustments and the benefit of non-U.S. income taxed at rates lower than the U.S. statutory rate. \nCritical Accounting Policies and Estimates\nCritical accounting policies are those policies that involve accounting estimates and assumptions that can have a material impact on our financial position and results of operations and require the use of complex and subjective estimates based upon past experience and management’s judgment. Actual results may differ from these estimates due to uncertainties inherent in such estimates. Below are those policies applied in preparing our financial statements that management believes are the most dependent upon the application of estimates and assumptions. For a complete list of significant accounting policies, see Note 1 of the Notes to Consolidated Financial Statements.\nAllowances for Returns and Credit Losses\nTrade receivables are primarily comprised of amounts owed to us for our pharmaceutical distribution and services activities and are presented net of an allowance for customer sales returns and an allowance for credit losses. Our customer sales return policy generally allows customers to return products only if the products can be resold at full value or returned to suppliers for full credit. We record an accrual for estimated customer sales returns at the time of sale to the customer based upon historical customer return trends. The allowance for returns as of September 30, 2025 and 2024 was $1,625.8 million and $1,175.9 million, respectively.\nWe evaluate our receivables for risk of loss by grouping our receivables with similar risk characteristics. Expected losses are determined based on a combination of historical loss trends, current economic conditions, and forward-looking risk factors. Changes in these factors, among others, may lead to adjustments in our allowance for credit losses. The calculation of the required allowance requires judgment by management as to the impact of those and other factors on the ultimate realization of our trade receivables. We perform ongoing credit evaluations of our customers’ financial condition and maintain reserves for expected credit losses and specific credit problems when they arise. We write off balances against the reserves when collectibility is deemed remote. We perform formal, documented reviews of the allowance at least quarterly and perform monthly credit loss reviews in connection with our largest businesses and our higher risk customer accounts. There were no significant changes to this process during fiscal 2025, 2024, and 2023, and bad debt expense was computed in a consistent manner during these periods. The bad debt expense for any period presented is equal to the changes in the period end allowance for credit losses, net of write-offs, recoveries, and other adjustments. \nBad debt expense for fiscal 2025, 2024, and 2023 was $63.3 million, $40.8 million, and $54.4 million respectively. An increase or decrease of 0.1% in the 2025 allowance as a percentage of trade receivables would result in an increase or decrease in the provision on accounts receivable of approximately $25.4 million. The allowance for credit losses was $170.4 million and $132.1 million as of September 30, 2025 and 2024, respectively. \nSchedule II of this Form 10-K sets forth a rollforward of allowances for returns and credit losses.\nBusiness Combinations\nThe assets acquired and liabilities assumed upon the acquisition or consolidation of a business are recorded at estimated fair value, with the residual of the purchase price allocated to goodwill. We engage third-party appraisal firms to assist management in determining the fair values of certain assets acquired and liabilities assumed. Such valuations require management to make significant judgments, estimates, and assumptions, especially with respect to intangible assets. Management makes estimates of fair value based upon assumptions it believes to be reasonable. These estimates are based upon historical experience and information obtained from the management of the acquired companies and are inherently uncertain. Critical estimates in valuing certain of the intangible assets include but are not limited to (i) discount rates and expected future cash flows from and economic lives of customer relationships, (ii) trade names, (iii) existing technology, and (iv) other intangible assets. Unanticipated events and circumstances may occur, which may affect the accuracy or validity of such assumptions or estimates.\n36\nTable of Contents \nGoodwill and Other Intangible Assets\nGoodwill arises from acquisitions or consolidations of specific operating companies and is assigned to the reporting unit in which a particular operating company resides. We identify our reporting units based upon our management reporting structure, beginning with our operating segments. We evaluate whether the components within our operating segments have similar economic characteristics, which include the similarity of long-term gross margins, the nature of the components’ products, services, and production processes, the types of customers and the methods by which products or services are delivered to customers, and the components’ regulatory environment and aggregate two or more components within an operating segment that have similar economic characteristics. As of September 30, 2025, our reporting units included U.S. Pharmaceutical Distribution Services, U.S. Consulting Services, MWI Animal Health, Alliance Healthcare, Innomar, World Courier, PharmaLex, and Profarma. \nGoodwill and other intangible assets with indefinite lives, such as certain trademarks and trade names, are not amortized; rather, they are tested for impairment at least annually. For the purpose of these impairment tests, we can elect to perform a qualitative assessment to determine if it is more likely than not that the fair values of our reporting units and indefinite-lived intangible assets are less than the respective carrying values of those reporting units and indefinite-lived intangible assets, respectively. Such qualitative factors can include, among others, industry and market conditions, overall financial performance, and relevant entity-specific events. If we conclude based on our qualitative assessment that it is more likely than not that the fair value of a reporting unit is less than its carrying value, we perform a quantitative analysis. We elected to perform quantitative impairment assessments of goodwill for all our reporting units in fiscal 2025, 2024, and 2023 with the exception of our PharmaLex reporting unit in fiscal 2023 since it was acquired in fiscal 2023. We elected to perform qualitative impairment assessments of indefinite-lived intangible assets in fiscal 2025, 2024, and 2023. \nThe quantitative goodwill impairment test requires us to compare the carrying value of the reporting unit’s net assets to the fair value of the reporting unit. If the fair value exceeds the carrying value, no further evaluation is required, and no impairment loss is recognized. If the carrying amount exceeds the fair value, the difference between the carrying value and the fair value is recorded as an impairment loss, the amount of which may not exceed the total amount of goodwill allocated to the reporting unit.\nWhen performing a quantitative impairment assessment, we utilize an income approach or a weighted average of an income and market approach to value our reporting units. The income approach relies on a discounted cash flow analysis, which considers forecasted cash flows discounted at an appropriate discount rate, to determine the fair value of each reporting unit. We generally believe that market participants would use a discounted cash flow analysis to determine the fair value of our reporting units in a sale transaction. The annual goodwill impairment test requires us to make a number of assumptions and estimates concerning future levels of revenue growth, earnings before interest, taxes, depreciation and amortization (“EBITDA”), EBITDA margins, capital expenditures, and working capital requirements, which are based upon our long-range plan. The discount rate is an estimate of the overall after-tax rate of return required by a market participant whose weighted average cost of capital includes both debt and equity, including a risk premium. While we use the best available information to prepare our forecasted cash flows and discount rate assumptions, actual future cash flows and/or market conditions could differ significantly resulting in future impairment charges related to recorded goodwill balances. While there are always changes in assumptions to reflect changing business and market conditions, our overall methodology and the population of assumptions used have remained unchanged.\nWe completed our required annual impairment assessments relating to goodwill and indefinite-lived intangible assets in fiscal 2025, 2024, and 2023 and, as a result, recorded goodwill impairments (see Note 5 of the Notes to Consolidated Financial Statements\n) \nof $723.9 million and $418.0 million in our PharmaLex reporting unit in fiscal 2025 and 2024, respectively. No goodwill impairments were recorded in fiscal 2023 and no indefinite-lived intangible asset impairments were recorded in fiscal 2025, 2024, or 2023.\nFinite-lived intangible assets are amortized using the straight-line method over the estimated useful lives of the assets. We perform a recoverability assessment of our long-lived assets when impairment indicators are present. We performed a recoverability assessment of PharmaLex’s long-lived asset group as of July 1, 2025, and it was determined to be recoverable. \nIncome Taxes\nOur income tax expense, deferred tax assets and liabilities, and uncertain tax positions reflect management’s assessment of estimated future taxes to be paid on items in the financial statements. Deferred income taxes arise from temporary differences between financial reporting and tax reporting bases of assets and liabilities, as well as net operating loss and tax credit carryforwards for tax purposes.\nWe have established a valuation allowance against certain deferred tax assets for which the ultimate realization of future benefits is uncertain. Expiring carryforwards and the required valuation allowances are adjusted annually. After \n37\nTable of Contents \napplication of the valuation allowances described above, we anticipate that no limitations will apply with respect to utilization of any of the other deferred income tax assets described above.\nWe prepare and file tax returns based upon our interpretation of tax laws and regulations and record estimates based upon these judgments and interpretations. In the normal course of business, our tax returns are subject to examination by various taxing authorities. Such examinations may result in future tax and interest assessments by these taxing authorities. Inherent uncertainties exist in estimates of tax contingencies due to changes in tax law resulting from legislation, regulation, and/or as concluded through the various jurisdictions’ tax court systems. Significant judgment is exercised in applying complex tax laws and regulations across multiple global jurisdictions where we conduct our operations. We recognize the tax benefit from an uncertain tax position only if it is more likely than not that the tax position will be sustained upon examination by the taxing authorities, including resolutions of any related appeals or litigation processes, based upon the technical merits of the position.\nWe believe that our estimates for the valuation allowances against deferred tax assets and the amount of benefits recognized in our financial statements for uncertain tax positions are appropriate based upon current facts and circumstances. However, others applying reasonable judgment to the same facts and circumstances could develop a different estimate and the amount ultimately paid upon resolution of issues raised may differ from the amounts accrued.\nThe significant assumptions and estimates described in the preceding paragraphs are important contributors to the ultimate effective tax rate in each year. If any of our assumptions or estimates were to change, an increase or decrease in our effective tax rate by 1% on income before income taxes would have caused income tax expense to change by $22.6 million in fiscal 2025.\nInventories\nInventories are stated at the lower of cost or market. Cost for approximately 63% and 65% of our inventories as of September 30, 2025 and 2024, respectively, has been determined using the LIFO method. If we had used the first-in, first-out method of inventory valuation, which approximates current replacement cost, inventories would have been approximately $1,458.9 million and $1,535.8 million higher than the amounts reported as of September 30, 2025 and 2024, respectively. We recorded LIFO credits of $76.9 million and $52.2 million in fiscal 2025 and 2024, respectively, and LIFO expense of $204.6 million in fiscal 2023. The annual LIFO provision is affected by manufacturer pricing practices, which may be impacted by market and other external influences, changes in inventory quantities, and product mix, many of which are difficult to predict. Changes to any of the above factors can have a material impact on our annual LIFO provision. Cost for our inventory that is not determined using the LIFO method is stated at the lower of cost or market using the first-in, first-out method or moving average price method.\nLoss Contingencies\nIn the ordinary course of business, we become involved in lawsuits, administrative proceedings, government subpoenas, government investigations, stockholder demands, and other disputes, including antitrust, commercial, data privacy and security, product liability, intellectual property, regulatory, employment discrimination, and other matters. Significant damages or penalties may be sought in some matters, and some matters may require years to resolve. We record a reserve for these matters when it is both probable that a loss has been incurred and the amount can be reasonably estimated. We also perform an assessment of the materiality of loss contingencies where a loss is either not probable or it is reasonably possible that a loss could be incurred in excess of amounts accrued. If a loss or an additional loss has at least a reasonable possibility of occurring and the impact on the financial statements would be material, we provide disclosure of the loss contingency and whether a reasonable estimate of the loss or the range of the loss can made in the notes to our financial statements. We review all contingencies at least quarterly to determine whether the likelihood of loss has changed and to assess whether a reasonable estimate of the loss or the range of the loss can be made. Among the loss contingencies we considered in accordance with the foregoing in connection with the preparation of the accompanying financial statements were the opioid matters described in \nNote 12\n of the Notes to Consolidated Financial Statements.\n38\nTable of Contents \nLiquidity and Capital Resources\nOur operating results have generated cash flows, which, together with availability under our debt agreements and credit terms from suppliers, have provided sufficient capital resources to finance working capital and cash operating requirements, and to fund capital expenditures, acquisitions, repayment of debt, the payment of interest on outstanding debt, dividends, and purchases of shares of our common stock.\nOur primary ongoing cash requirements will be to finance working capital, fund the repayment of debt, fund the payment of interest on debt, fund the payment of dividends, fund purchases of our common stock, finance acquisitions, and fund capital expenditures and routine growth and expansion through new business opportunities. Future cash flows from operations and borrowings are expected to be sufficient to fund our ongoing cash requirements, including the opioid litigation payments that will be made over the next 13 years (see below).\nAs of September 30, 2025 and 2024, our cash and cash equivalents held by foreign subsidiaries were $957.7 million and $851.3 million, respectively. We have the ability to repatriate the majority of our cash and cash equivalents held by our foreign subsidiaries without incurring significant additional taxes upon repatriation.\nOur cash balances in fiscal 2025 and 2024 were supplemented by intra-period credit facility borrowings to cover short-term working capital needs. The largest amount of intra-period borrowings under our revolving and securitization credit facilities that was outstanding at any one time during fiscal 2025 and 2024 was $5.1 billion and $3.2 billion, respectively. We had $132.2 billion, $69.7 billion, and $77.9 billion of cumulative intra-period borrowings that were repaid under our credit facilities during fiscal 2025, 2024, and 2023, respectively. \nCash Flows\nOur net cash provided by operating activities increased by $390.4 million in fiscal 2025 compared to fiscal 2024 largely due to our growth, which resulted from an increase in net income, plus non-cash items of $653.7 million, offset in part by a decrease in cash generated from our working capital accounts due to the timing of cash receipts and disbursements. More specifically, in fiscal 2025, the increase of our accounts receivable, inventories, and accounts payable balances provided $500.5 million of cash from operations compared to $704.2 million in fiscal 2024.\nDuring fiscal 2025, our operating activities provided cash of $3.9 billion and was principally the result of the following:\n•\nAn increase in accounts payable of $3.7 billion primarily due to the increase in our inventory balances and the timing of scheduled payments to our suppliers;  \n•\nPositive non-cash items of $2.3 billion, which was primarily comprised of asset impairments of $837.4 million, amortization expense of $567.1 million, and depreciation expense of $501.3 million; and\n•\nNet income of $1.6 billion.\nThe cash provided by the above items was offset in part by the following:\n•\nAn increase in accounts receivable of $1.9 billion primarily due to an increase in sales and the timing of scheduled payments from our customers;\n•\nAn increase in inventories of $1.3 billion to support the increase in business volume; and\n•\nA decrease in long-term accrued litigation liability of $404.1 million due to opioid litigation settlement payments.\nDuring fiscal 2024, our operating activities provided cash of $3.5 billion and was principally the result of the following:\n•\nAn increase in accounts payable of $5.0 billion primarily due to the increase in our inventory balances and the timing of scheduled payments to our suppliers; \n•\nPositive non-cash items of $1.7 billion, which was primarily comprised of amortization expense of $670.6 million, depreciation expense of $448.2 million, and a $418.0 million goodwill impairment; and \n•\nNet income of $1.5 billion.\nThe cash provided by the above items was offset in part by the following:\n•\nAn increase in accounts receivable of $2.8 billion primarily due to an increase in sales and the timing of scheduled payments from our customers;\n•\nAn increase in inventories of $1.5 billion to support the increase in business volume; and\n•\nA decrease in long-term accrued litigation liability of $506.2 million due to opioid litigation settlement payments.\n39\nTable of Contents \nWe use days sales outstanding, days inventory on hand, and days payable outstanding to evaluate our working capital performance. The below financial metrics are calculated based upon a quarterly average and can be impacted by the timing of cash receipts and disbursements, which can vary significantly depending upon the day of the week on which the period ends. \n \nFiscal Year Ended September 30,\n \n2025\n2024\n2023\nDays sales outstanding\n27.9\n28.7\n27.7\nDays inventory on hand\n27.0\n26.4\n27.7\nDays payable outstanding\n59.6\n60.3\n60.0\nOur cash flows from operating activities can vary significantly from period to period based upon fluctuations in our period-end working capital account balances. Any changes to payment terms with a key customer or manufacturer supplier could have a material impact on our cash flows from operations. The addition of any new key customer or the loss of any existing key customer could have a material impact on our cash flows from operations.\nOperating cash flows during fiscal 2025 included $356.5 million of interest payments and $571.2 million of income tax payments, net of refunds. Operating cash flows during fiscal 2024 included $250.1 million of interest payments and $603.9 million of income tax payments, net of refunds. Operating cash flows during fiscal 2023 included $271.3 million of interest payments and $463.1 million of income tax payments, net of refunds.\nCapital expenditures in fiscal 2025, 2024, and 2023 were $668.0 million, $487.2 million, and $458.4 million, respectively. Significant capital expenditures in fiscal 2025 included investments relating to the expansion and enhancement of our distribution network and various technology initiatives. Significant capital expenditures in fiscal 2024 and 2023 included investments in various technology initiatives, including technology initiatives at Alliance Healthcare.\nWe expect to spend approximately $900 million on capital expenditures during fiscal 2026. Larger fiscal 2026 capital expenditures will include investments relating to the continued expansion and enhancement of our distribution network and various technology initiatives.\nIn addition to capital expenditures, net cash used in investing activities in fiscal 2025 included $3.9 billion for the acquisition of RCA and $196.2 million for equity investments.\nIn addition to capital expenditures, net cash used in investing activities in fiscal 2023 included $1.4 billion for the acquisition of PharmaLex and $718.4 million for our investment in OneOncology.\nNet cash provided by financing activities in fiscal 2025 principally resulted from the $1.8 billion issuance of senior notes and $1.5 billion of term loan borrowings to finance a portion of the acquisition of RCA, as well as the issuance of €1.0 billion of senior notes that were used for general corporate purposes. All of the above were offset in part by $700 million of term loan repayments, the repayment of our $500 million of 3.250% senior notes that matured in March 2025, $437.1 million in cash dividends paid on our common stock, and $435.5 million in purchases of our common stock.\nNet cash used in financing activities in fiscal 2024 included $1.5 billion in purchases of our common stock, the repayment of our $500 million of 3.400% senior notes that matured in May 2024, $416.2 million in cash dividends paid on our common stock, and a $350.0 million repayment on our Receivables Securitization Facility (as defined below), offset in part by the issuance of our $500 million of 5.125% senior notes in February 2024.\nNet cash used in financing activities in fiscal 2023 included $1.2 billion in purchases of our common stock, a $675 million repayment of our 0.737% senior notes that matured in March 2023, and $398.8 million in cash dividends paid on our common stock. \n40\nTable of Contents \nDebt and Credit Facility Availability\nThe following illustrates our debt structure as of September 30, 2025, including availability under the multi-currency revolving credit facility, the receivables securitization facility, the money market facility, the working capital credit facility, and the Alliance Healthcare debt:\n(in thousands)\nOutstanding\nBalance\nAdditional\nAvailability\nFixed-Rate Debt:\n \n \n$750,000, 3.450% senior notes due 2027\n$\n748,150 \n$\n— \n$500,000, 4.625% senior notes due 2027\n497,309 \n— \n€500,000, 2.875% senior notes due 2028\n583,903 \n— \n$600,000, 4.850% senior notes due 2029\n596,603 \n— \n$500,000, 2.800% senior notes due 2030\n497,174 \n— \n$1,000,000, 2.700% senior notes due 2031\n993,838 \n— \n€500,000, 3.625% senior notes due 2032\n581,685 \n— \n$500,000, 5.125% senior notes due 2034\n495,104 \n— \n$700,000, 5.150% senior notes due 2035\n694,909 \n— \n$500,000, 4.250% senior notes due 2045\n495,792 \n— \n$500,000, 4.300% senior notes due 2047\n494,088 \n— \nNonrecourse debt\n92,672 \n— \nTotal fixed-rate debt\n6,771,227 \n— \nVariable-Rate Debt:\n \n \nMulti-currency revolving credit facility due 2030\n— \n4,500,000 \nReceivables securitization facility due in 2028\n— \n1,500,000 \nTerm loan due in 2027\n799,043 \n— \nMoney market facility due in 2027\n— \n500,000 \nWorking capital credit facility due in 2026\n— \n500,000 \nAlliance Healthcare debt\n1,424 \n465,632 \nNonrecourse debt\n89,079 \n— \nTotal variable-rate debt\n889,546 \n7,465,632 \nTotal debt\n$\n7,660,773 \n$\n7,465,632 \nWe had a $2.4 billion multi-currency senior unsecured revolving credit facility (“Multi-Currency Revolving Credit Facility”) with a syndicate of lenders, which was scheduled to expire in October 2029. In June 2025, we amended and restated the Multi-Currency Revolving Credit Facility to extend the expiration to June 2030 and increase the aggregate amount of the commitments under this facility to $4.5 billion. Interest on borrowings under the Multi-Currency Revolving Credit Facility accrues at specified rates based upon our debt rating. We pay facility fees to maintain the availability under the Multi-Currency Revolving Credit Facility at specified rates based on our debt rating. We may choose to repay or reduce our commitments under the Multi-Currency Revolving Credit Facility at any time. The Multi-Currency Revolving Credit Facility contains covenants, including compliance with a financial leverage ratio test, as well as others that impose limitations on, among other things, indebtedness of subsidiaries and asset sales, with which we were compliant as of September 30, 2025. There were no borrowings outstanding under the Multi-Currency Revolving Credit Facility as of September 30, 2025 and 2024.\nWe had a $3.4 billion commercial paper program. In September 2025, we increased the commercial paper program to $4.5 billion. The commercial paper program does not increase our borrowing capacity and it is fully backed by our Multi-Currency Revolving Credit Facility. We may, from time to time, issue short-term promissory notes in an aggregate amount of up to $4.5 billion at any one time. Amounts available under the program may be borrowed, repaid, and re-borrowed from time to time. The maturities on the notes will vary but may not exceed 365 days from the date of issuance. The notes will bear interest, if interest bearing, or will be sold at a discount from their face amounts. There were no borrowings outstanding under the commercial paper program as of September 30, 2025 and 2024.\nIn November 2024, we entered into an agreement pursuant to which we obtained a $1.0 billion senior unsecured revolving credit facility (the “364-Day Revolving Credit Facility”) with a syndicate of lenders, which was scheduled to expire \n41\nTable of Contents \n364 days after the January 2, 2025 closing of the RCA acquisition, the date on which borrowings under this facility became available to us. In June 2025, in conjunction with the amendment to the Multi-Currency Revolving Credit Facility, we terminated the 364-Day Revolving Credit Facility.\nWe had a $1.45 billion receivables securitization facility (“Receivables Securitization Facility”), which was scheduled to expire in October 2027. In June 2025, we amended the Receivables Securitization Facility to extend the expiration to June 2028, increase the size of the facility to $1.5 billion, and increase its accordion feature to $500 million from $250 million. This accordion feature allows us to increase the commitment on the Receivables Securitization Facility up to $500 million, subject to lender approval. Interest rates are based on prevailing market rates for short-term commercial paper or 30-day Term SOFR, plus a program fee. We pay a customary unused fee at prevailing market rates, monthly, to maintain the availability under the Receivables Securitization Facility. The Receivables Securitization Facility contains similar covenants to the Multi-Currency Revolving Credit Facility, with which we were compliant as of September 30, 2025. There were no borrowings outstanding under the Receivables Securitization Facility as of September 30, 2025 and 2024.\nIn connection with the Receivables Securitization Facility, AmerisourceBergen Drug Corporation and a specialty distribution subsidiary sell on a revolving basis certain accounts receivable to Amerisource Receivables Financial Corporation, a wholly-owned special purpose entity, which in turn sells a percentage ownership interest in the receivables to financial institutions and commercial paper conduits sponsored by financial institutions. AmerisourceBergen Drug Corporation is the servicer of the accounts receivable under the Receivables Securitization Facility. As sold receivables are collected, additional receivables may be sold up to the maximum amount available under the facility. We use the facility as a financing vehicle because it generally offers an attractive interest rate relative to other financing sources. We securitize our trade accounts, which are generally non-interest bearing, in transactions that are accounted for as borrowings. \nWe have an uncommitted, unsecured line of credit available to us pursuant to a money market credit agreement (“Money Market Facility”). In September 2025, we entered into an amendment to the Money Market Facility pursuant to which we may request short-term unsecured revolving credit loans in a principal amount not to exceed $500 million on or after April 1 and before December 1 of any year and increases to $750 million on or after December 1 and before March 31 of any year. The Money Market Facility may be decreased or terminated by the bank or us at any time without prior notice. There were no borrowings outstanding under the Money Market Facility as September 30, 2025 and 2024.\nIn July 2025, we entered into an uncommitted, unsecured line of credit to support our working capital needs (“Working Capital Credit Facility”). The Working Capital Credit Facility provides us with the ability to request short-term, unsecured revolving credit loans from time to time in a principal amount not to exceed $500 million. The Working Capital Credit Facility expires in July 2026 and may be decreased or terminated by the bank or us at any time without prior notice. There were no borrowings outstanding under the Working Capital Credit Facility as of September 30, 2025.\nIn January 2025, we borrowed $1.5 billion on a variable-rate term loan (“Term Loan”) that was scheduled to mature in December 2027. In September 2025, we amended the Term Loan to shorten the maturity to October 2027. The Term Loan was used to finance a portion of the acquisition of RCA (see Note 2 of the Notes to Consolidated Financial Statements). The Term Loan bears interest at a rate equal to either an adjusted SOFR plus an applicable margin or an alternate base rate plus an applicable margin. The margins are based on our public debt ratings. The Term Loan contains similar covenants to the Multi-Currency Revolving Credit Facility. We have the right to prepay the borrowings under the Term Loan at any time, in whole or in part and without premium or penalty. Through September 30, 2025, we elected to make early principal payments of $700 million on the Term Loan.\nIn December 2024, we issued $500 million of 4.625% senior notes due in December 2027 (the “2027 Notes”), $600 million of 4.850% senior notes due in December 2029 (the “2029 Notes”), and $700 million of 5.150% senior notes due in February 2035 (the “2035 Notes”). The 2027 Notes were sold at 99.815% of the principal amount with an effective yield of 4.634%. The 2029 Notes were sold at 99.968% of the principal amount with an effective yield of 4.852%. The 2035 Notes were sold at 99.945% of the principal amount with an effective yield of 5.153%. Interest on the 2027 Notes and the 2029 Notes is payable semi-annually in arrears on June 15 and December 15, which began on June 15, 2025. Interest on the 2035 Notes is payable semi-annually in arrears on February 15 and August 15, which began on February 15, 2025. We used the proceeds from the 2027 Notes, the 2029 Notes, and the 2035 Notes to finance a portion of the acquisition of RCA.\nIn May 2025, we issued €500 million of 2.875% senior notes due in May 2028 (the “2028 Notes”) and €500 million of 3.625% senior notes due in May 2032 (the “2032 Notes”). The 2028 Notes were sold at 99.960% of the principal amount with an effective yield of 2.876%. The 2032 Notes were sold at 99.757% of the principal amount with an effective yield of 3.634%. Interest on the 2028 Notes and the 2032 Notes is payable annually in arrears beginning on May 22, 2026. We used the proceeds from the 2028 Notes and the 2032 Notes for general corporate purposes. \nIn March 2025, our $500 million of 3.250% senior notes matured and was repaid.\n42\nTable of Contents \nAlliance Healthcare debt is comprised of uncommitted revolving credit facilities in various currencies with various rates. These facilities are used to fund its working capital needs.\nNonrecourse debt is comprised of short-term and long-term debt belonging to the Brazil subsidiaries and is repaid solely from the Brazil subsidiaries’ cash flows and such debt agreements provide that the repayment of the loans (and interest thereon) is secured solely by the capital stock, physical assets, contracts, and cash flows of the Brazil subsidiaries.\nShare Purchase Programs and Dividends\nIn May 2022, our Board of Directors authorized a share repurchase program allowing us to purchase up to $1.0 billion of our outstanding shares of common stock, subject to market conditions. During fiscal 2023, we purchased $961.3 million of our common stock to complete our authorization under this program. \nIn March 2023, our Board of Directors authorized a share repurchase program allowing us to purchase up to $1.0 billion of our outstanding shares of common stock, subject to market conditions. During fiscal 2023, we purchased $191.0 million of our common stock under this program. During fiscal 2024, we purchased $809.0 million of our common stock to complete our authorization under this program.\nIn March 2024, our Board of Directors authorized a share repurchase program allowing us to purchase up to $2.0 billion of our outstanding common stock, subject to market conditions. During fiscal 2024, we purchased $682.3 million of our common stock under this program. During fiscal 2025, we purchased $435.4 million of our common stock under this program. As of September 30, 2025, we had $882.2 million availability under this program.  \nOur Board of Directors approved the following quarterly dividend increases:\nDividend Increases\n \nPer Share\n \nDate\nNew Rate\nOld Rate\n% Increase\nNovember 2022\n$0.485\n$0.460\n5%\nNovember 2023\n$0.510\n$0.485\n5%\nNovember 2024\n$0.550\n$0.510\n8%\nNovember 2025\n$0.600\n$0.550\n9%\nWe anticipate that we will continue to pay quarterly cash dividends in the future. However, the payment and amount of future dividends remain within the discretion of our Board of Directors and will depend upon our future earnings, financial condition, capital requirements, and other factors.\nCommitments and Obligations\nAs discussed and defined in Note 12 of the Notes to Consolidated Financial Statements, on July 21, 2021, it was announced that we and the two other national pharmaceutical distributors had negotiated a Distributor Settlement Agreement. The Distributor Settlement Agreement became effective on April 2, 2022, and as of September 30, 2025, it included 48 of 49 eligible states (the “Settling States”) as well as 99% by population of the eligible political subdivisions in the Settling States. Our accrued litigation liability related to the Distributor Settlement Agreement and an estimate for non-participating government subsidiaries (with whom we have not reached a settlement agreement), as well as other opioid-related litigation for which we have reached settlement agreements on our Consolidated Balance Sheet as of September 30, 2025 is $4.3 billion and is expected to be paid over the next 13 years. We currently estimate that $416.0 million will be paid prior to September 30, 2026. The payment of the aforementioned litigation liability has not and is not expected to have an impact on our ability to pay dividends.\n43\nTable of Contents \nThe following is a summary of our contractual obligations for future principal and interest payments on our debt, minimum rental payments on our noncancellable operating leases, and minimum payments on our other commitments as of September 30, 2025:\nPayments Due by Period (in thousands)\nDebt, Including Interest Payments\nOperating \nLeases\nOther Commitments\nTotal\nWithin 1 year\n$\n437,394 \n$\n319,915 \n$\n152,351 \n$\n909,660 \n1-3 years\n3,230,584 \n564,752 \n125,097 \n3,920,433 \n4-5 years\n1,489,639 \n428,522 \n12,119 \n1,930,280 \nAfter 5 years\n4,792,775 \n668,804 \n857 \n5,462,436 \nTotal\n$\n9,950,392 \n$\n1,981,993 \n$\n290,424 \n$\n12,222,809 \nThe 2017 Tax Act requires a one-time transition tax to be recognized on historical foreign earnings and profits. As of September 30, 2025, we expect to pay the remaining $57.9 million related to the transition tax in January 2026. The transition tax commitment is included in “Other Commitments” in the above table.\nOur liability for uncertain tax positions was $640.5 million (including interest and penalties) as of September 30, 2025. This liability represents an estimate of tax positions that we have taken in our tax returns that may ultimately not be sustained upon examination by taxing authorities. Since the amount and timing of any future cash settlements cannot be predicted with reasonable certainty, the estimated liability has been excluded from the above contractual obligations table. Our liability for uncertain tax positions as of September 30, 2025 primarily includes an uncertain tax benefit related to the legal accrual for litigation related to the distribution of prescription opioid pain medications, as disclosed in Note 12 of the Notes to Consolidated Financial Statements.\nMarket Risk\nWe have exposure to foreign currency and exchange rate risk from our non-U.S. operations. Our largest exposure to foreign exchange rates exists primarily with the U.K. Pound Sterling, the Euro, the Turkish Lira, the Brazilian Real, and the Canadian Dollar. We use forward contracts to hedge against the foreign currency exchange rate impact on certain intercompany receivable and payable balances. We use foreign currency denominated debt held at the parent level to offset a portion of our foreign currency exchange rate exposure on our net investments in Euro-denominated subsidiaries (see Note 1 of the Notes to Consolidated Financial Statements). We may use derivative instruments to hedge our foreign currency exposure but not for speculative or trading purposes. Revenue from our foreign operations during fiscal 2025 was approximately 9% of our consolidated revenue.\nWe have market risk exposure to interest rate fluctuations relating to our debt. We manage interest rate risk by using a combination of fixed-rate and variable-rate debt. The amount of variable-rate debt fluctuates during the year based on our working capital requirements. We had $889.5 million of variable-rate debt outstanding as of September 30, 2025. We periodically evaluate financial instruments to manage our exposure to fixed and variable interest rates. However, there are no assurances that such instruments will be available in the combinations we want and/or on terms acceptable to us. There were no such financial instruments in effect as of September 30, 2025.\nWe also have market risk exposure to interest rate fluctuations relating to our cash and cash equivalents. We had $4.4 billion in cash and cash equivalents as of September 30, 2025. The unfavorable impact of a hypothetical decrease in interest rates on cash and cash equivalents would be partially offset by the favorable impact of such a decrease on variable-rate debt. For every $100 million of cash invested that is in excess of variable-rate debt, a 10-basis point decrease in interest rates would increase our annual net interest expense by $0.1 million. \nDeterioration of general economic conditions, among other factors, could adversely affect the number of prescriptions that are filled and the number of pharmaceutical products purchased by consumers and, therefore, could reduce purchases by our customers. In addition, volatility in financial markets and higher borrowing costs may also negatively impact our customers’ ability to obtain credit to finance their businesses on acceptable terms. Reduced purchases by our customers or changes in the ability of our customers to remit payments to us could adversely affect our revenue growth, our profitability, and our cash flows from operations.\nRecent elevated levels of inflation in the global and U.S. economies have impacted certain operating expenses. If elevated levels of inflation persist or increase, our operations and financial results could be adversely affected, particularly in certain global markets.\n44\nTable of Contents \nWe have risks from other geopolitical trends and events, such as rising nationalism, the conflict in Ukraine, and evolving conditions in the Middle East. Although the long-term implications of these conflicts are difficult to predict at this time, the financial impact of these conflicts has not been material to our financial results.",
  "item2": null
}