{
  "source_file": "cor-20250630.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "ITEM 2.   Management’s Discussion and Analysis of Financial Condition and Results of Operations\nIn reviewing this Management’s Discussion and Analysis of Financial Condition and Results of Operations, please note that we face many uncertainties and risks related to various economic, political and regulatory environments in which we operate, both within the U.S. and internationally. Refer to the headings “Item 1A. Risk Factors” in Part I of our Annual Report on Form 10-K for the year ended September 30, 2024, as well as the heading “Cautionary Note Regarding Forward-Looking Statements” above for additional information related to our present business environment.\nExecutive Summary\n    This executive summary provides highlights from the results of operations that follow: \n•\nRevenue increased by $6.4 billion, or 8.7%, and $22.7 billion, or 10.6%, from the prior year quarter and nine-month period, respectively, due to growth in both reportable segments. The U.S. Healthcare Solutions segment grew its revenue by $5.7 billion, or 8.5%, and $21.5 billion, or 11.1%, from the prior year quarter and nine-month period, respectively, primarily due to overall market growth largely driven by unit volume growth, including increased sales of products labeled for diabetes and/or weight loss in the GLP-1 class of $1.4 billion, or 18.6%, and $6.8 billion, or 34.4%, from the prior year quarter and nine-month period, respectively, and increased sales of specialty products to physician practices and health systems. International Healthcare Solutions' revenue increased by $0.7 billion, or 10.5%, and $1.2 billion, or 5.5%, from the prior year quarter and nine-month period, respectively.\n•\nGross profit increased by $496.3 million, or 20.6%, and $1,107.4 million, or 14.9%, from the prior year quarter and nine-month period, respectively.  The increase in gross profit from the prior year quarter is primarily due to the increase in gross profit in both reportable segments and a last-in, first-out (\"LIFO\") credit in the current year quarter in comparison to LIFO expense in the prior year quarter, offset in part by lower gains from antitrust litigation settlements. The increase in gross profit from the prior year nine-month period is primarily due to the increase in gross profit in the U.S. Healthcare Solutions reportable segment and larger gains from antitrust litigation settlements, offset in part by a lower LIFO credit in the current year period and a decrease in gross profit in the International Healthcare Solutions reportable segment. U.S. Healthcare Solutions' gross profit increased by $483.9 million, or 31.3%, and $1,039.4 million, or 21.7%, from the prior year quarter and nine-month period, respectively, driven by increased sales and the January 2025 acquisition of RCA. International Healthcare Solutions' gross profit increased by $6.6 million, or 0.8%, from the prior year quarter and decreased $15.5 million, or 0.6%, from the prior year nine-month period. \n•\nTotal operating expenses increased by $301.2 million, or 17.3%, and $545.9 million, or 10.2%, from the prior year quarter and nine-month period, respectively, primarily due to the January 2025 acquisition of RCA and the increase in acquisition-related deal and integration expenses, offset in part by a large decrease in litigation and opioid-related expenses in the current year nine-month period. \n•\nTotal segment operating income increased by $180.6 million, or 20.6%, and $402.7 million, or 14.4%, from the prior year quarter and nine-month period, respectively. U.S. Healthcare Solutions' operating income increased by $203.5 million, or 29.1%, and $464.8 million, or 20.8%, from the prior year quarter and nine-month period, respectively, in part due to the January 2025 acquisition of RCA. International Healthcare Solutions' operating income decreased by $23.2 million, or 12.9%, and  $62.1 million, or 11.1%, from the prior year quarter and nine-month period, respectively.\n•\nOur effective tax rates were 23.0% and 22.3% for the three and nine months ended June 30, 2025 respectively. Our effective tax rates were 22.4% and 19.5% for the three and nine months ended June 30, 2024, respectively. The effective tax rate for the nine months ended June 30, 2024 benefited from discrete tax benefits associated with foreign valuation allowance adjustments.\n25\nTable of Contents\nResults of Operations\nRevenue\nThree months ended\nJune 30,\nNine months ended\nJune 30,\n(dollars in thousands)\n2025\n2024\nChange\n2025\n2024\nChange\nU.S. Healthcare Solutions:\nHuman Health\n$\n71,404,871 \n$\n65,821,863 \n8.5%\n$\n210,978,813 \n$\n189,704,387 \n11.2%\nAnimal Health\n1,471,692 \n1,369,735 \n7.4%\n4,214,709 \n3,963,910 \n6.3%\nTotal U.S. Healthcare Solutions\n72,876,563 \n67,191,598 \n8.5%\n215,193,522 \n193,668,297 \n11.1%\nInternational Healthcare Solutions:\nAlliance Healthcare\n6,229,964 \n5,641,912 \n10.4%\n18,001,154 \n17,122,456 \n5.1%\nOther Healthcare Solutions\n1,560,474 \n1,409,964 \n10.7%\n4,420,181 \n4,123,032 \n7.2%\nTotal International Healthcare Solutions\n7,790,438 \n7,051,876 \n10.5%\n22,421,335 \n21,245,488 \n5.5%\nIntersegment eliminations\n(3,469)\n(2,121)\n(10,592)\n(5,292)\nRevenue\n$\n80,663,532 \n$\n74,241,353 \n8.7%\n$\n237,604,265 \n$\n214,908,493 \n10.6%\nOur future revenue growth will continue to be affected by various factors, such as industry growth trends, including drug utilization (e.g., products labeled for diabetes and/or weight loss in the GLP-1 class), the introduction of new, innovative brand therapies and vaccines, the likely increase in the number of generic drugs and biosimilars that will be available over the next few years as a result of the expiration of certain drug patents held by brand-name pharmaceutical manufacturers and the rate of conversion from brand products to those generic drugs and biosimilars, price inflation and price deflation, general economic conditions in the United States and Europe, currency exchange rates, competition within the industry, customer consolidation, changes in pharmaceutical manufacturer pricing and distribution policies and practices, increased downward pressure on government and other third-party reimbursement rates to our customers, and changes in government rules and regulations.\nRevenue increased by $6.4 billion\n, \nor\n \n8.7%\n, \nand $22.7 billion, or 10.6%, from the prior year quarter and nine-month period, respectively, due to growth in both reportable segments.\nThe U.S. Healthcare Solutions segment grew its revenue by $5.7 billion, or 8.5%, and $21.5 billion, or 11.1%, from the prior year quarter and nine-month period, respectively, primarily due to overall market growth largely driven by unit volume growth, including increased sales of products labeled for diabetes and/or weight loss in the GLP-1 class of $1.4 billion, or 18.6%, and $6.8 billion, or 34.4%, from the prior year quarter and nine-month period, respectively, and increased sales of specialty products to physician practices and health systems. Sales, including GLP-1 products, to our two largest customers increased by $1.4 billion and $5.6 billion from the prior year quarter and nine-month period, respectively. \nInternational Healthcare Solutions' revenue increased by $0.7 billion, or 10.5%, and $1.2 billion, or 5.5%, from the prior year quarter and nine-month period, respectively, primarily due to increased sales at our European distribution business of $0.6 billion and $0.9 billion from the prior year quarter and nine-month period, respectively.\nA number of our contracts with customers, including group purchasing organizations, are typically subject to expiration each year. We may lose a key customer if an existing contract with such customer expires without being extended, renewed, or replaced. As previously disclosed, we received a notice of non-renewal from an oncology customer, and in June 2025, our sales contract with that customer was terminated. Over the next twelve months, there are no key contracts scheduled to expire. Additionally, from time to time, key contracts may be terminated in accordance with their terms or extended, renewed, or replaced prior to their expiration dates. If those contracts are extended, renewed, or replaced at less favorable terms, they may also negatively impact our revenue, results of operations, and cash flows. \n26\nTable of Contents\nGross Profit\nThree months ended\nJune 30,\nNine months ended\nJune 30,\n(dollars in thousands)\n2025\n2024\nChange\n2025\n2024\nChange\nU.S. Healthcare Solutions\n$\n2,030,950 \n$\n1,547,022 \n31.3%\n$\n5,837,203 \n$\n4,797,786 \n21.7%\nInternational Healthcare Solutions\n830,420 \n823,796 \n0.8%\n2,476,950 \n2,492,450 \n(0.6)%\nIntersegment eliminations\n(1,032)\n(1,171)\n(3,705)\n(1,717)\nGains from antitrust litigation settlements\n9,495 \n51,605 \n231,011 \n108,567 \nLIFO credit (expense) \n52,058 \n(6,839)\n19,913 \n64,441 \nTurkey highly inflationary impact\n(14,776)\n(3,636)\n(36,410)\n(43,915)\nGross profit\n$\n2,907,115 \n$\n2,410,777 \n20.6%\n$\n8,524,962 \n$\n7,417,612 \n14.9%\n    Gross profit increased by $496.3 million, or 20.6%, and $1,107.4 million, or 14.9%, from the prior year quarter and nine-month period, respectively. The increase in gross profit from the prior year quarter is primarily due to the increase in gross profit in both reportable segments and a LIFO credit in the current year quarter in comparison to LIFO expense in the prior year quarter, offset in part by lower gains from antitrust litigation settlements. The increase in gross profit from the prior year nine-month period is primarily due to the increase in gross profit in the U.S. Healthcare Solutions reportable segment and larger gains from antitrust litigation settlements, offset in part by a lower LIFO credit and a decrease in gross profit in the International Healthcare Solutions reportable segment.\nU.S. Healthcare Solutions' gross profit increased by $483.9 million, or 31.3%, and $1,039.4 million, or 21.7%, from the prior year quarter and nine-month period, respectively, primarily due to increased sales and the January 2025 acquisition of RCA. As a percentage of revenue, U.S. Healthcare Solutions' gross profit margins were 2.79% and 2.71% in the current year quarter and nine-month period, respectively, and represent increases of 49 basis points and 23 basis points from the prior year quarter and nine-month period, respectively. The current year quarter increase of 49 basis points was primarily due to the January 2025 acquisition of RCA. The current year nine-month period increase of 23 basis points was primarily due to the January 2025 acquisition of RCA, offset in part by higher sales of GLP-1 products, which have lower gross profit margins, and lower sales of COVID vaccines, which have higher gross profit margins.\nInternational Healthcare Solutions' gross profit increased by $6.6 million, or 0.8%, from the prior year quarter and decreased $15.5 million, or 0.6%, from the prior year nine-month period. The increase in the current year quarter is primarily due to the increase in gross profit at our European distribution business, offset in part by a decrease in gross profit at our global specialty logistics business. The decrease in the current year nine-month period is primarily due to a decline in gross profit at our global specialty logistics business, offset in part by an increase in gross profit at our European distribution business.\nWe recognized gains from antitrust litigation settlements with pharmaceutical manufacturers of $9.5 million and $51.6 million in the three months ended June 30, 2025 and 2024, respectively, and $231.0 million and $108.6 million in the nine months ended June 30, 2025 and 2024, respectively. The gains were recorded as reductions to Cost of Goods Sold (see Note 10 of the Notes to Consolidated Financial Statements).\nOur cost of goods sold for interim periods includes a LIFO provision that is recorded ratably on a quarterly basis and is based on our estimated annual LIFO provision. The annual LIFO provision, which we estimate on a quarterly basis, is affected by manufacturer pricing practices, which may be impacted by market and other external influences, expected changes in inventory quantities, and product mix, many of which are difficult to predict. Changes to any of the above factors may have a material impact on our annual LIFO provision. Based on estimates in our current fiscal year LIFO provision, the LIFO credit in the current year nine-month period is lower than the LIFO credit in the prior year nine-month period primarily due to slightly higher brand pharmaceutical inflation, offset in part by higher generic pharmaceutical deflation.\nWe recognized expense in Cost of Goods Sold of $14.8 million and $3.6 million in the three months ended June 30, 2025 and 2024, respectively, and $36.4 million and $43.9 million in the nine months ended June 30, 2025 and 2024, respectively, related to the impact of Turkey highly inflationary accounting driven by the continued weakening of the Turkish Lira.\n27\nTable of Contents\nOperating Expenses\nThree months ended\nJune 30,\nNine months ended\nJune 30,\n(dollars in thousands)\n2025\n2024\nChange\n2025\n2024\nChange\nDistribution, selling, and administrative\n$\n1,672,881 \n$\n1,383,206 \n20.9%\n$\n4,744,976 \n$\n4,170,763 \n13.8%\nDepreciation and amortization\n253,995 \n272,595 \n(6.8)%\n792,305 \n814,930 \n(2.8)%\nLitigation and opioid-related expenses, net\n17,974 \n14,485 \n46,263 \n161,553 \nAcquisition-related deal and integration expenses\n52,838 \n25,758 \n190,930 \n69,431 \nRestructuring and other expenses\n41,773 \n42,257 \n140,390 \n152,325 \nTotal operating expenses\n$\n2,039,461 \n$\n1,738,301 \n17.3%\n$\n5,914,864 \n$\n5,369,002 \n10.2%\nDistribution, selling, and administrative expenses increased by $289.7 million, or 20.9%, and $574.2 million, or 13.8%, compared to the prior year quarter and nine-month period, respectively, primarily due to the January 2025 acquisition of RCA and to support our revenue growth. As a percentage of revenue, distribution, selling, and administrative expenses were 2.07% and 2.00% in the current year quarter and nine-month period, respectively, and represent increases of 21 basis points and 6 basis points compared to the prior year quarter and nine-month period, respectively, primarily due to the January 2025 acquisition of RCA, offset in part by our improved operating leverage from our 8.7% and 10.6% revenue growth from the prior year quarter and nine-month period, respectively. \nDepreciation expense increased 18.7% and 13.9% from the prior year quarter and nine-month period, respectively, and amortization expense decreased 23.6% and 13.5% from the prior year quarter and nine-month period, respectively. The decline in amortization expense is due to certain tradenames becoming fully amortized in connection with our company name change to Cencora and the gradual transition away from other tradenames used, which were acquired through prior acquisitions.\nLitigation and opioid-related expenses, net in the three months ended June 30, 2025 and 2024 and in the nine months ended June 30, 2025 included legal fees in connection with opioid lawsuits and investigations. Litigation and opioid-related expenses, net in the nine months ended June 30, 2024 included a $214.0 million litigation accrual for ongoing litigation related to the distribution of prescription opioid medications and $39.7 million of legal fees in connection with opioid lawsuits and investigations, offset in part by a net $92.2 million opioid litigation settlement accrual reduction primarily as a result of our prepayment of the net present value of a future obligation as permitted under our opioid settlement agreements. \nAcquisition-related deal and integration expenses in the three and nine months ended June 30, 2025 primarily included costs related to the acquisition of RCA, including expenses related to equity units retained by RCA physicians and members of management of $37.5 million and $74.9 million in the three and nine months ended June 30, 2025, respectively (see Note 2 of the Notes to Consolidated Financial Statements), and the continued integration of PharmaLex. Acquisition-related deal and integration expenses in the three and nine months ended June 30, 2024 primarily related to the integration of Alliance Healthcare and PharmaLex. \nRestructuring and other expenses are comprised of the following:\nThree months ended\nJune 30,\nNine months ended\nJune 30,\n(in thousands)\n2025\n2024\n2025\n2024\nRestructuring and employee severance costs\n$\n10,408 \n$\n18,840 \n$\n55,066 \n$\n41,865 \nBusiness transformation efforts\n30,205 \n20,646 \n81,325 \n79,096 \nOther, net\n1,160 \n2,771 \n3,999 \n31,364 \n    Total restructuring and other expenses\n$\n41,773 \n$\n42,257 \n$\n140,390 \n$\n152,325 \nRestructuring and employee severance costs in the three and nine months ended June 30, 2025 primarily included workforce reductions in both of our reportable segments. Restructuring and employee severance costs in the three and nine months ended June 30, 2024 primarily included expenses incurred related to facility closures in connection with our office optimization plan and workforce reductions in both of our reportable segments.\nBusiness transformation efforts in the three and nine months ended June 30, 2025 and 2024 included rebranding costs associated with our name change to Cencora and non-recurring expenses related to significant strategic initiatives to improve \n28\nTable of Contents\noperational efficiency, including certain technology initiatives. The majority of these costs are related to services provided by third-party consultants.\nIn February 2024, we experienced a cybersecurity event where data from our information systems was exfiltrated. In connection with this event, we incurred costs that were recorded in Other, net in the above table. The majority of the costs included in Other, net in the nine months ended June 30, 2024 related to this cybersecurity event.\nOperating Income\nThree months ended\nJune 30,\nNine months ended\nJune 30,\n(dollars in thousands)\n2025\n2024\nChange\n2025\n2024\nChange\nU.S. Healthcare Solutions\n$\n901,793 \n$\n698,305 \n29.1%\n$\n2,702,287 \n$\n2,237,493 \n20.8%\nInternational Healthcare Solutions\n156,222 \n179,391 \n(12.9)%\n497,616 \n559,706 \n(11.1)%\nIntersegment eliminations\n316 \n— \n— \n— \nTotal segment operating income\n1,058,331 \n877,696 \n20.6%\n3,199,903 \n2,797,199 \n14.4%\nGains from antitrust litigation settlements\n9,495 \n51,605 \n231,011 \n108,567 \n \nLIFO credit (expense) \n52,058 \n(6,839)\n19,913 \n64,441 \n \nTurkey highly inflationary impact\n(14,776)\n(3,636)\n(36,410)\n(43,915)\nAcquisition-related intangibles amortization\n(124,869)\n(163,850)\n(426,736)\n(494,373)\n \nLitigation and opioid-related expenses, net\n(17,974)\n(14,485)\n(46,263)\n(161,553)\nAcquisition-related deal and integration expenses\n(52,838)\n(25,758)\n(190,930)\n(69,431)\n \nRestructuring and other expenses\n(41,773)\n(42,257)\n(140,390)\n(152,325)\nOperating income\n$\n867,654 \n$\n672,476 \n29.0%\n$\n2,610,098 \n$\n2,048,610 \n27.4%\nU.S. Healthcare Solutions' operating income increased by $203.5 million, or 29.1%, and $464.8 million, or 20.8%, from the prior year quarter and nine month-period, respectively, primarily due to the increases in gross profit, as noted above, and were offset in part by the increases in operating expenses. As a percentage of revenue, U.S. Healthcare Solutions' operating income margins were 1.24% and 1.26% in the current year quarter and nine-month period, respectively, and represent increases  of 20 basis points and 10 basis points from the prior year quarter and nine-month period, respectively, due to the increases gross profit margin, as described above in the Gross Profit section, offset in part by increases in the operating expense margin.\nInternational Healthcare Solutions' operating income decreased by $23.2 million, or 12.9%, and $62.1 million, or 11.1%, from the prior year quarter and nine-month period, respectively. These decreases were primarily due to lower operating income at our global specialty logistics business and our specialized consulting services business. \nOther (Income) Loss, Net\nOther (income) loss, net in the three months ended June 30, 2025 includes $39.7 million for our portion of an equity method investment’s gain on the sale of a business, a $27.3 million gain on the remeasurement of an equity investment, and a $26.0 million currency remeasurement gain on the deferred tax assets relating to 2020 Swiss tax reform.  Other (income) loss, net in the three months ended June 30, 2024 includes a $13.3 million loss on the remeasurement of an equity investment.\nOther (income) loss, net in the nine months ended June 30, 2025 includes $39.7 million for our portion of an equity method investment’s gain on the sale of a business, a $30.6 million gain on the remeasurement of an equity investment, a $15.7 million currency remeasurement gain on the deferred tax assets relating to 2020 Swiss tax reform, and a $35.5 million loss on the divestiture of non-core businesses. Other (income) loss, net in the nine months ended June 30, 2024 includes a $24.8 million loss on the remeasurement of an equity investment.\n29\nTable of Contents\nInterest Expense, Net\nInterest expense, net and the respective weighted average interest rates for the three months ended June 30, 2025 and 2024 are as follows:\n \n2025\n2024\n(dollars in thousands)\nAmount\nWeighted Average\nInterest Rate\nAmount\nWeighted Average\nInterest Rate\nInterest expense\n$\n116,896 \n4.35%\n$\n58,936 \n3.82%\nInterest income\n(35,102)\n5.31%\n(27,608)\n5.30%\nInterest expense, net\n$\n81,794 \n \n$\n31,328 \n \nInterest expense, net increased by $50.5 million, or 161.1%, from the prior year quarter due to the increase in interest expense, offset in part by an increase in interest income. The increase in interest expense was primarily due to the issuance of our $1.8 billion of senior notes in December 2024 and the $1.5 billion variable-rate term loan, which we borrowed in January 2025 to finance a portion of the RCA acquisition, and increased revolving credit facility borrowings to cover short-term working capital needs. The increase in interest income was driven by higher average investment cash balances in the current year quarter in comparison to the prior year quarter.  \nInterest expense, net and the respective weighted average interest rates for the nine months ended June 30, 2025 and 2024 are as follows:\n \n2025\n2024\n(dollars in thousands)\nAmount\nWeighted Average\nInterest Rate\nAmount\nWeighted Average\nInterest Rate\nInterest expense\n$\n310,395 \n4.31%\n$\n194,362 \n3.93%\nInterest income\n(96,680)\n5.24%\n(58,340)\n5.11%\nInterest expense, net\n$\n213,715 \n \n$\n136,022 \n Interest expense, net increased by $77.7 million, or 57.1%, from the prior year nine-month period due to the increase in interest expense, offset in part by an increase in interest income. The increase in interest expense was primarily due to the issuance of our $1.8 billion of senior notes in December 2024 and the $1.5 billion variable-rate term loan, which we borrowed in January 2025 to finance a portion of the RCA acquisition, and increased revolving credit facility borrowings to cover short-term working capital needs. The increase in interest income was driven by higher average investment cash balances and higher investment interest rates outside the United States in the current year nine-month period in comparison to the prior year period.  \nIncome Tax Expense \nOur effective tax rates were 23.0% and 22.3% for the three and nine months ended June 30, 2025, respectively. Our effective tax rates were 22.4% and 19.5% for the three and nine months ended June 30, 2024, respectively. The effective tax rates for the three and nine months ended June 30, 2025 were higher than the U.S. statutory rate primarily due to U.S. state income taxes, offset in part by the benefit of income taxed at rates lower than the U.S. statutory rate and benefits associated with equity compensation. The effective tax rate for the three months ended June 30, 2024 was higher than the U.S. statutory rate primarily due to U.S. state income taxes, offset in part by the benefit of income taxed at rates lower than the U.S. statutory rate. The effective tax rate for the nine months ended June 30, 2024 was lower than the U.S. statutory rate primarily due to discrete tax benefits associated with foreign valuation allowance adjustments, the benefits of income taxed at rates lower than the U.S. statutory rate, and tax benefits associated with equity compensation, offset in part by U.S. state income taxes.\nLiquidity and Capital Resources\n     Our operating results have generated cash flows, which, together with availability under our debt agreements and credit terms from suppliers, have provided sufficient capital resources to finance working capital and cash operating requirements, and to fund capital expenditures, acquisitions, repayment of debt, the payment of interest on outstanding debt, dividends, and purchases of shares of our common stock.\nOur primary ongoing cash requirements will be to finance working capital, fund the repayment of debt, fund the payment of interest on debt, fund the payment of dividends, fund purchases of our common stock, finance acquisitions, and fund capital expenditures and routine growth and expansion through new business opportunities. Future cash flows from operations and borrowings are expected to be sufficient to fund our ongoing cash requirements, including the opioid litigation payments that will be made over the next 14 years (see below).\n30\nTable of Contents\nAs of June 30, 2025 and September 30, 2024, our cash and cash equivalents held by foreign subsidiaries were $1.0 billion and $851.3 million, respectively. We have the ability to repatriate the majority of our cash and cash equivalents held by our foreign subsidiaries without incurring significant additional taxes upon repatriation.\nOur cash balances in the nine months ended June 30, 2025 and 2024 were supplemented by intra-period credit facility borrowings to cover short-term working capital needs. The largest amount of intra-period borrowings under our revolving and securitization credit facilities that was outstanding at any one time during the nine months ended June 30, 2025 and 2024 was $5.1 billion and $3.2 billion, respectively. We had $86.1 billion and $56.7 billion of cumulative intra-period borrowings that were repaid under our credit facilities during the nine months ended June 30, 2025 and 2024, respectively. \nCash Flows\nWe generated $741.7 million of cash from operations during the nine months ended June 30, 2025 compared to $2.5 billion of cash from operations during the nine months ended June 30, 2024, a decrease of $1.7 billion. The decrease in the current year nine-month period was primarily driven by changes in our working capital accounts. The timing of cash receipts and disbursements can significantly impact our working capital. The change in working capital accounts, primarily accounts receivable and accounts payable, resulted in a year-over-year use of cash of $2.2 billion primarily due to the timing of cash receipts from customers and the timing of disbursements to suppliers, offset in part by our growth, which resulted in an increase in net income, plus non-cash items of $528.2 million.\nDuring the nine months ended June 30, 2025, our operating activities provided cash of $741.7 million and was principally the result of the following:\n•\nNet income of $1.9 billion; and\n•\nPositive non-cash items of $1.0 billion, which is primarily comprised of amortization expense of $436.8 million and depreciation expense of $367.6 million.\nThe cash provided by the above items was offset in part by the following:\n•\nAn increase in accounts receivable of $977.6 million primarily due to an increase in sales and the timing of scheduled payments from our customers; \n•\nAn increase in inventories of $949.9 million to support the increase in business volume; and\n•\nA decrease in accrued expenses of $316.7 million primarily due to the payment of accrual liabilities that were on our Consolidated Balance Sheet as of September 30, 2024, including $226.0 million of opioid litigation settlement payments.\nDuring the nine months ended June 30, 2024, our operating activities provided cash of $2.5 billion and was principally the result of the following:\n•\nAn increase in accounts payable of $4.1 billion primarily due to the increase in our inventory balances and the timing of scheduled payments to our suppliers;\n•\nNet income of $1.5 billion; and\n•\nPositive non-cash items of $897.3 million, which is primarily comprised of amortization expense of $502.1 million and depreciation expense of $337.0 million.\nThe cash provided by the above items was offset in part by the following:\n•\nAn increase in accounts receivable of $3.1 billion primarily due to an increase in sales and the timing of scheduled payments from our customers; and\n•\nAn increase in inventories of $835.6 million to support the increase in business volume.\nWe use days sales outstanding, days inventory on hand, and days payable outstanding to evaluate our working capital performance. The below financial metrics are calculated based upon a quarterly average and can be impacted by the timing of cash receipts and disbursements, which can vary significantly depending upon the day of the week on which the period ends.\n \nThree months ended\nJune 30,\nNine months ended\nJune 30,\n \n2025\n2024\n2025\n2024\nDays sales outstanding\n27.9\n29.0\n27.9\n28.9\nDays inventory on hand\n26.8\n25.8\n27.1\n26.8\nDays payable outstanding\n59.0\n60.1\n59.6\n60.7\n31\nTable of Contents\nOur cash flows from operating activities can vary significantly from period to period based upon fluctuations in our period-end working capital account balances. Any changes to payment terms with a key customer or manufacturer supplier could have a material impact to our cash flows from operations. The addition of any new customer or the loss of an existing customer could have a material impact on our cash flows from operations. \nOperating cash flows during the nine months ended June 30, 2025 included $263.1 million of interest payments and $421.4 million of income tax payments, net of refunds. Operating cash flows during the nine months ended June 30, 2024 included $197.7 million of interest payments and $408.9 million of income tax payments, net of refunds.\nCapital expenditures in the nine months ended June 30, 2025 and 2024 were $418.2 million and $304.8 million, respectively. Significant capital expenditures in the nine months ended June 30, 2025 included investments relating to the expansion and enhancement of our distribution network and various technology initiatives. Significant capital expenditures in the nine months ended June 30, 2024 included investments in various technology initiatives, including technology investments at Alliance Healthcare.\nWe currently expect to invest approximately $600 million in capital expenditures during fiscal 2025. Larger 2025 capital expenditures will include investments relating to the expansion and enhancement of our distribution network and various technology initiatives.\nIn addition to capital expenditures, net cash used in investing activities in the nine months ended June 30, 2025 included $3.9 billion for the acquisition of RCA and $193.8 million for equity investments.\nNet cash provided by financing activities in the nine months ended June 30, 2025 principally resulted from the $1.8 billion issuance of senior notes and $1.5 billion of term loan borrowings to finance a portion of the acquisition of RCA, as well as the issuance of €1.0 billion of senior notes that were used for general corporate purposes. All of the above were offset in part by the repayment of our $500 million of 3.250% senior notes that matured in March 2025, $435.5 million in purchases of our common stock, $329.6 million in cash dividends paid on our common stock, and $200 million of term loan repayments.\nNet cash used in financing activities in the nine months ended June 30, 2024 principally resulted from $986.4 million purchases of our common stock, the repayment of our $500 million of 3.400% senior notes that matured in May 2024, and $315.2 million in cash dividends paid on our common stock, offset in part by the issuance of our $500 million of senior notes in February 2024. \n32\nTable of Contents\nDebt and Credit Facility Availability\nThe following table illustrates our debt structure as of June 30, 2025, including availability under the multi-currency revolving credit facility; the receivables securitization facility; the money market facility; and the Alliance Healthcare debt:\n(in thousands)\nOutstanding\nBalance\nAdditional\nAvailability\nFixed-Rate Debt:\n \n \n$750,000, 3.450% senior notes due 2027\n$\n747,940 \n$\n— \n$500,000, 4.625% senior notes due 2027\n497,003 \n— \n€500,000, 2.875% senior notes due 2028\n582,556 \n— \n$600,000, 4.850% senior notes due 2029\n596,401 \n— \n$500,000, 2.800% senior notes due 2030\n497,022 \n— \n$1,000,000, 2.700% senior notes due 2031\n993,558 \n— \n€500,000, 3.625% senior notes due 2032\n580,439 \n— \n$500,000, 5.125% senior notes due 2034\n494,957 \n— \n$700,000, 5.150% senior notes due 2035\n694,771 \n$500,000, 4.250% senior notes due 2045\n495,737 \n— \n$500,000, 4.300% senior notes due 2047\n494,021 \n— \nNonrecourse debt\n108,232 \n— \nTotal fixed-rate debt\n6,782,637 \n— \nVariable-Rate Debt:\n \n \nMulti-currency revolving credit facility due in 2030\n— \n4,500,000 \nReceivables securitization facility due in 2028\n— \n1,500,000 \nTerm loan due in 2027\n1,298,996 \n— \nMoney market facility due in 2027\n— \n100,000 \nAlliance Healthcare debt\n66,677 \n383,328 \nNonrecourse debt\n92,176 \n— \nTotal variable-rate debt\n1,457,849 \n6,483,328 \nTotal debt\n$\n8,240,486 \n$\n6,483,328 \nWe had a $2.4 billion multi-currency senior unsecured revolving credit facility (\"Multi-Currency Revolving Credit Facility\") with a syndicate of lenders, which was scheduled to expire in October 2029. In June 2025, we amended and restated the Multi-Currency Revolving Credit Facility to extend the expiration to June 2030 and increase the aggregate amount of the commitments thereunder to $4.5 billion. Interest on borrowings under the Multi-Currency Revolving Credit Facility accrues at specified rates based upon our debt ratings. We pay facility fees to maintain the availability under the Multi-Currency Revolving Credit Facility at specified rates based on our debt rating. We may choose to repay or reduce our commitments under the Multi-Currency Revolving Credit Facility at any time. The Multi-Currency Revolving Credit Facility contains covenants, including compliance with a financial leverage ratio test, as well as others that impose limitations on, among other things, indebtedness of subsidiaries and asset sales, with which we were compliant as of June 30, 2025. There were no borrowings outstanding under the Multi-Currency Revolving Credit Facility as of June 30, 2025 and September 30, 2024.\n    We have a commercial paper program, which does not increase our borrowing capacity, that is fully backed by our Multi-Currency Revolving Credit Facility. We may, from time to time, issue short-term promissory notes in an aggregate amount of up to $3.4 billion at any one time. Amounts available under the program may be borrowed, repaid, and re-borrowed from time to time. The maturities on the notes will vary but may not exceed 365 days from the date of issuance. The notes will bear interest, if interest bearing, or will be sold at a discount from their face amounts. There were no borrowings outstanding under the commercial paper program as of June 30, 2025 and  September 30, 2024.\nIn November 2024, we entered into an agreement pursuant to which we obtained a $1.0 billion senior unsecured revolving credit facility (the \"364-Day Revolving Credit Facility\") with a syndicate of lenders, which was scheduled to expire 364 days after the January 2, 2025 closing of the RCA acquisition, the date on which borrowings under this facility became available to us. In June 2025, in conjunction with the amendment to the Multi-Currency Revolving Credit Facility, we terminated the 364-Day Revolving Credit Facility.\n33\nTable of Contents\nWe had a $1.45 billion receivables securitization facility (\"Receivables Securitization Facility\"), which was scheduled to expire in October 2027. In June 2025, we amended the Receivables Securitization Facility to extend the expiration to June 2028, increase the size of the facility to $1.5 billion, and increase its accordion feature to $500 million from $250 million. The accordion feature allows us to increase the commitment on the Receivables Securitization Facility up to $500 million, subject to lender approval. Interest rates are based on prevailing market rates for short-term commercial paper or 30-day Term SOFR, plus a program fee. We pay a customary unused fee at prevailing market rates, monthly, to maintain the availability under the Receivables Securitization Facility. The Receivables Securitization Facility contains similar covenants to the Multi-Currency Revolving Credit Facility, with which we were compliant as of June 30, 2025. There were no borrowings outstanding under the Receivables Securitization Facility as of June 30, 2025 and September 30, 2024.\nWe have an uncommitted, unsecured line of credit available to us pursuant to a money market credit agreement (the \"Money Market Facility\"). The Money Market Facility provides us with the ability to request short-term, unsecured revolving credit loans from time to time in a principal amount not to exceed $100 million. The Money Market Facility may be decreased or terminated by the bank or us at any time without prior notice. There were no borrowings outstanding under the Money Market Facility as of June 30, 2025 and September 30, 2024.\nIn July 2025, we entered into an uncommitted, unsecured line of credit to support our working capital needs (\"Working Capital Credit Facility\"). The Working Capital Credit Facility provides us with the ability to request short-term, unsecured revolving credit loans from time to time in a principal amount not to exceed $500 million. The Working Capital Credit Facility expires in July 2026 and may be decreased or terminated by the bank or us at any time without prior notice.\nIn January 2025, we borrowed $1.5 billion on a variable-rate term loan (\"Term Loan\") that matures in December 2027. The Term Loan was used to finance a portion of the acquisition of RCA. The Term Loan bears interest at a rate equal to either an adjusted SOFR plus an applicable margin or an alternate base rate plus an applicable margin. The margins are based on our public debt ratings. The Term Loan contains similar covenants to the Multi-Currency Revolving Credit Facility. We have the right to prepay the borrowings under the Term Loan at any time, in whole or in part and without premium or penalty. Through June 30, 2025, we elected to make early principal payments of $200 million on the Term Loan.\nIn December 2024, we issued $500 million of 4.625% senior notes due in December 2027 (the \"2027 Notes\"), $600 million of 4.850% senior notes due in December 2029 (the \"2029 Notes\"), and $700 million of 5.150% senior notes due in February 2035 (the \"2035 Notes\"). The 2027 Notes were sold at 99.815% of the principal amount with an effective yield of 4.634%. The 2029 Notes were sold at 99.968% of the principal amount with an effective yield of 4.852%. The 2035 Notes were sold at 99.945% of the principal amount with an effective yield of 5.153%. Interest on the 2027 Notes and the 2029 Notes is payable semi-annually in arrears on June 15 and December 15, which began on June 15, 2025. Interest on the 2035 Notes is payable semi-annually in arrears on February 15 and August 15, which began on February 15, 2025. We used the proceeds from the 2027 Notes, the 2029 Notes, and the 2035 Notes to finance a portion of the acquisition of RCA.\nIn May 2025, we issued €500 million of 2.875% senior notes due in May 2028 (the \"2028 Notes\") and €500 million of 3.625% senior notes due in May 2032 (the \"2032 Notes\"). The 2028 Notes were sold at 99.960% of the principal amount with an effective yield of 2.876%. The 2032 Notes were sold at 99.757% of the principal amount with an effective yield of 3.634%. Interest on the 2028 Notes and the 2032 Notes is payable annually in arrears beginning on May 22, 2026. We used the proceeds from the 2028 Notes and the 2032 Notes for general corporate purposes.  \nIn March 2025, our $500 million of 3.250% senior notes matured and was repaid.\nAlliance Healthcare debt is comprised of uncommitted revolving credit facilities in various currencies with various rates. These facilities are used to fund its working capital needs.\nNonrecourse debt is comprised of short-term and long-term debt belonging to the Brazil subsidiaries and is repaid solely from the Brazil subsidiaries' cash flows and such debt agreements provide that the repayment of the loans (and interest thereon) is secured solely by the capital stock, physical assets, contracts, and cash flows of the Brazil subsidiaries.\nShare Purchase Programs and Dividends\nIn March 2024, our Board of Directors authorized a share repurchase program allowing us to purchase up to $2.0 billion of our outstanding shares of common stock, subject to market conditions. In the nine months ended June 30, 2025, we purchased $435.4 million of our common stock. As of June 30, 2025, we had $882.2 million of availability under this program.\nIn November 2024, our Board of Directors increased the quarterly dividend paid on common stock by 8% from $0.51 per share to $0.55 per share. We anticipate that we will continue to pay quarterly cash dividends in the future. However, the payment and amount of future dividends remains within the discretion of our Board of Directors and will depend upon future earnings, financial condition, capital requirements, and other factors.\n34\nTable of Contents\nCommitments and Obligations\nAs discussed and defined in Note 9 of the Notes to Consolidated Financial Statements, on July 21, 2021, it was announced that we and the two other national pharmaceutical distributors had negotiated a Distributor Settlement Agreement. The Distributor Settlement Agreement became effective on April 2, 2022, and as of June 30, 2025, it included 48 of 49 eligible states (the \"Settling States\") as well as 99% by population of the eligible political subdivisions in the Settling States. Our accrued litigation liability related to the Distributor Settlement Agreement and an estimate for non-participating government subsidiaries (with whom we have not reached a settlement agreement), as well as other opioid-related litigation for which we have reached settlement agreements on our Consolidated Balance Sheet as of June 30, 2025 is $4.7 billion and is expected to be paid over the next 14 years. We currently estimate that $416.8 million will be paid prior to June 30, 2026. The payment of the aforementioned litigation liability has not and is not expected to have an impact on our ability to pay dividends.\nThe following is a summary of our contractual obligations for future principal and interest payments on our debt, minimum rental payments on our noncancellable operating leases, and minimum payments on our other commitments as of June 30, 2025:\nPayments Due by Period (in thousands)\nDebt, Including Interest Payments\nOperating \nLeases\nOther Commitments\nTotal\nWithin 1 year\n$\n546,873 \n$\n312,545 \n$\n146,209 \n$\n1,005,627 \n1-3 years\n3,801,016 \n540,374 \n118,789 \n4,460,179 \n4-5 years\n1,491,964 \n401,837 \n29,603 \n1,923,404 \nAfter 5 years\n4,846,975 \n652,034 \n389 \n5,499,398 \nTotal\n$\n10,686,828 \n$\n1,906,790 \n$\n294,990 \n$\n12,888,608 \nThe 2017 Tax Act requires a one-time transition tax to be recognized on historical foreign earnings and profits. As of June 30, 2025, we expect to pay the remaining $57.9 million related to the transition tax in January 2026. The transition tax commitment is included in \"Other Commitments\" in the above table.\nOur liability for uncertain tax positions was $602.3 million (including interest and penalties) as of June 30, 2025. This liability represents an estimate of tax positions that we have taken in our tax returns which may ultimately not be sustained upon examination by taxing authorities. Since the amount and timing of any future cash settlements cannot be predicted with reasonable certainty, the estimated liability has been excluded from the above contractual obligations table. Our liability for uncertain tax positions as of June 30, 2025 primarily includes an uncertain tax benefit related to the legal accrual for litigation related to the distribution of prescription opioid pain medications, as disclosed in Note 9 of the Notes to Consolidated Financial Statements.\nMarket and Risks\nWe have exposure to foreign currency and exchange rate risk from our non-U.S. operations. Our largest exposure to foreign exchange rates exists primarily with the U.K. Pound Sterling, the Euro, the Turkish Lira, the Brazilian Real, and the Canadian Dollar. We use forward contracts to hedge against the foreign currency exchange rate impact on certain intercompany receivable and payable balances. We use foreign currency denominated debt held at the parent level to offset a portion of our foreign currency exchange rate exposure on our net investments in Euro-denominated subsidiaries (see Note 6 of the Notes to Consolidated Financial Statements). We may use derivative instruments to hedge our foreign currency exposure, but not for speculative or trading purposes. Revenue from our foreign operations during the nine months ended June 30, 2025 was approximately 9% of our consolidated revenue.\nWe have market risk exposure to interest rate fluctuations relating to our debt. We manage interest rate risk by using a combination of fixed-rate and variable-rate debt. The amount of variable-rate debt fluctuates during the year based on our working capital requirements. We had $1.5 billion of variable-rate debt outstanding as of June 30, 2025. We periodically evaluate financial instruments to manage our exposure to fixed and variable interest rates. However, there are no assurances that such instruments will be available in the combinations we want and/or on terms acceptable to us. There were no such financial instruments in effect as of June 30, 2025.\nWe also have market risk exposure to interest rate fluctuations relating to our cash and cash equivalents. We had $2.2 billion in cash and cash equivalents as of June 30, 2025. The unfavorable impact of a hypothetical decrease in interest rates on cash and cash equivalents would be partially offset by the favorable impact of such a decrease on variable-rate debt. For every $100 million of cash invested that is in excess of variable-rate debt, a 10-basis point decrease in interest rates would increase our annual net interest expense by $0.1 million.\nDeterioration of general economic conditions, among other factors, could adversely affect the number of prescriptions that are filled and the amount of pharmaceutical products purchased by consumers and, therefore, could reduce purchases by \n35\nTable of Contents\nour customers. In addition, volatility in financial markets and higher borrowing costs may also negatively impact our customers' ability to obtain credit to finance their businesses on acceptable terms. Reduced purchases by our customers or changes in the ability of our customers to remit payments to us could adversely affect our revenue growth, our profitability, and our cash flow from operations.\nRecent elevated levels of inflation in the global and U.S. economies have impacted certain operating expenses. If elevated levels of inflation persist or increase, our operations and financial results could be adversely affected, particularly in certain global markets. \nWe have risks from other geopolitical trends and events, such as the ongoing conflicts in Ukraine and between Israel and Hamas. Although the long-term implications of these conflicts are difficult to predict at this time, the impact of these conflicts has not been material to our financial results.\n36\nTable of Contents"
}