{
  "source_file": "cost-20250511.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2—Management’s Discussion and Analysis of Financial Condition and Results of Operations\n(amounts in millions, except per share, share, percentages and warehouse count data)\nFORWARD-LOOKING STATEMENTS\nCertain statements contained in this document constitute forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. For these purposes, forward-looking statements are statements that address activities, events, conditions or developments that the Company expects or anticipates may occur in the future and may relate to such matters as net sales growth, changes in comparable sales, cannibalization of existing locations by new openings, price or fee changes, earnings performance, earnings per share, stock-based compensation expense, warehouse openings and closures, capital spending, the effect of adopting certain accounting standards, future financial reporting, financing, margins, return on invested capital, investments in technology, strategic direction, expense controls, membership renewal rates, shopping frequency, litigation, attainment of sustainability goals, and the demand for our products and services. In some cases, forward-looking statements can be identified because they contain words such as “anticipate,” “believe,” “continue,” “could,” “estimate,” “expect,” “intend,” “likely,” “may,” “might,” “plan,” “potential,” “predict,” “project,” “seek,” “should,” “target,” “will,” “would,” or similar expressions and the negatives of those terms. Such forward-looking statements involve risks and uncertainties that may cause actual events, results or performance to differ materially from those indicated by such statements. These risks and uncertainties include, but are not limited to, domestic and international economic conditions, including exchange rates, inflation or deflation, the effects of competition and regulation, uncertainties in the financial markets, consumer and small business spending patterns and debt levels, breaches of security or privacy of member or business information, conditions affecting the acquisition, development, ownership or use of real estate, capital spending, actions of vendors, rising costs associated with employees (generally including health-care costs and wages), workforce interruptions, energy and certain commodities, geopolitical conditions (including tariffs), the ability to maintain effective internal control over financial reporting, regulatory and other impacts related to environmental and social matters, public-health related factors, and other risks identified from time to time in the Company's public statements and reports filed with the Securities and Exchange Commission. Forward-looking statements speak only as of the date they are made, and the Company does not undertake to update these statements, except as required by law.\nOVERVIEW\nManagement's Discussion and Analysis of Financial Condition and Results of Operations (MD&A) is intended to promote understanding of the results of operations and financial condition. MD&A is provided as a supplement to, and should be read in conjunction with, our condensed consolidated financial statements and the accompanying Notes to Financial Statements (Part I, Item 1 of this Form 10-Q), as well as our consolidated financial statements, the accompanying Notes to Financial Statements, and the related MD&A in our fiscal year 2024 Form 10-K, filed with the Securities and Exchange Commission on October 9, 2024.\nWe operate membership warehouses and e-commerce sites based on the concept that offering our members low prices on a limited selection of nationally-branded and private-label products in a wide range of categories will produce high sales volumes and rapid inventory turnover. When combined with the operating efficiencies achieved by volume purchasing, efficient distribution and reduced handling of merchandise in no-frills, self-service warehouse facilities, these volumes and turnover enable us to operate profitably at significantly lower gross margins (net sales less merchandise costs) than most other retailers. We often sell inventory before we are required to pay for it, even while taking advantage of early payment discounts.\nWe believe that the most important driver of our profitability is increasing net sales, particularly comparable sales. Net sales includes our core merchandise categories (foods and sundries, non-foods, and fresh foods), warehouse ancillary (gasoline, pharmacy, optical, food court, hearing aids, and tire installation) and other businesses (e-commerce, business centers, travel, and other). E-commerce and business center sales are allocated to the appropriate merchandise categories in the Net Sales \n17\nTable of Contents\ndiscussion. The 2% reward associated with Executive membership is allocated to the category in which the reward is generated (core merchandise categories, warehouse ancillary, and other businesses). Comparable sales is defined as net sales from warehouses open for more than one year, including remodels, relocations and expansions, and sales related to e-commerce sites operating for more than one year. The measure is intended as supplemental information and is not a substitute for net sales presented in accordance with U.S. GAAP and should be reviewed in conjunction with results reported in accordance with U.S. GAAP. Comparable sales growth is achieved through increasing shopping frequency from new and existing members and the amount they spend on each visit (average ticket). Sales comparisons can also be particularly influenced by certain factors that are beyond our control: fluctuations in currency exchange rates (with respect to our international operations) and inflation or deflation in the cost of gasoline and associated competitive conditions. The higher our comparable sales exclusive of these items, the more we can leverage our selling, general and administrative (SG&A) expenses, reducing them as a percentage of sales and enhancing profitability. Generating comparable sales growth is foremost a question of making available the right merchandise at the right prices, a skill that we believe we have repeatedly demonstrated over the long-term. Another substantial factor in net sales growth is the health of the economies in which we do business, including the effects of inflation or deflation, especially the United States. Net sales growth and gross margins are also impacted by our competition, which is vigorous and widespread, across a wide range of global, national and regional wholesalers and retailers, including those with e-commerce operations. While we cannot control or reliably predict general economic health or changes in competition, we believe that we have been successful historically in adapting our business to these changes, such as through adjustments to our pricing and merchandise mix, including increasing the penetration of our private-label items, and through online offerings.\nOur philosophy is to provide our members with quality goods and services at competitive prices. We do not focus in the short-term on maximizing prices charged, but instead seek to maintain what we believe is a perception among our members of our “pricing authority” – consistently providing the most competitive values. Our net sales and gross margin are influenced in part by our merchandising and pricing strategies in response to cost increases. Those strategies can include, but are not limited to, working with our suppliers to share in absorbing cost increases, earlier-than-usual purchasing and in greater volumes, sourcing in the countries and regions where items are sold, as well as passing cost increases on to our members. Our investments in merchandise pricing may include reducing prices on merchandise to drive sales or meet competition and holding prices steady despite cost increases instead of passing the increases on to our members, negatively impacting gross margin and gross margin as a percentage of net sales (gross margin percentage) in the near term. Our e-commerce business, domestically and internationally, has a lower gross-margin percentage than our warehouse operations.\nGovernment actions in various countries relating to tariffs affect the costs of some of our merchandise. The degree of our exposure is dependent on (among other things) the type of goods, rates imposed, and timing of the tariffs. Higher tariffs are more likely to adversely impact rather than improve our results.\nWe believe our gasoline business enhances traffic in our warehouses; it generally has a lower gross margin percentage and lower SG&A expense relative to our non-gasoline businesses. A higher penetration of gasoline sales will generally lower our gross margin percentage. Generally, rising gasoline prices benefit net sales growth which, given the higher sales base, negatively impacts our gross margin percentage but decreases our SG&A expenses as a percentage of net sales. A decline in gasoline prices has the inverse effect.\nWe also achieve net sales growth by opening new warehouses. As our warehouse base grows, available and desirable sites become more difficult to secure, and square footage growth becomes a comparatively less substantial component of growth. Negative aspects of such growth include lower initial operating profitability relative to existing warehouses and cannibalization of sales at existing warehouses when openings occur in existing markets. Our rate of square footage growth is generally higher in many of our foreign markets, due to the smaller base in those markets, and we expect that to continue.\n18\nTable of Contents\nThe membership format is an integral part of our business and profitability. This format is designed to reinforce member loyalty and provide continuing fee revenue. The extent to which we achieve growth in our membership base, increase the penetration of Executive memberships, and sustain high renewal rates materially influences our profitability. Our paid-membership growth rate may be adversely impacted when warehouse openings occur in existing markets as compared to new markets. Our worldwide renewal rate may be adversely impacted by memberships in newer international markets and a higher penetration of memberships sold online, including digital promotions, which typically renew at a lower rate.\nOur financial performance depends heavily on controlling costs. While we believe that we have achieved successes in this area, some significant costs are partially outside our control, particularly health care and utility expenses. With respect to the compensation of our employees, our philosophy is not to seek to minimize their wages and benefits. Rather, we believe that achieving our longer-term objectives of reducing employee turnover, increasing productivity and enhancing employee satisfaction requires maintaining compensation levels that are better than the industry average for much of our workforce. This may cause us, for example, to absorb costs that other employers might seek to pass through to their workforces. Because our business operates on very low margins, modest changes in various items in the consolidated statements of income, particularly merchandise costs and SG&A expenses, can have substantial impacts on net income.\nOur operating model is generally the same across our U.S., Canadian, and Other International operating segments (see \nNote 9\n to the consolidated financial statements included in Part I, Item 1, of this Report). Certain operations in the Other International segment have relatively higher rates of square footage growth, lower wage and benefit costs as a percentage of sales, less or no direct membership warehouse competition, or lack e-commerce or business delivery.\nIn discussions of our consolidated operating results, we refer to the impact of changes in foreign currencies relative to the U.S. dollar, which are differences between the foreign-exchange rates we use to convert the financial results of our international operations from local currencies into U.S. dollars. This impact is calculated based on the difference between the current and prior period's exchange rates. The impact of changes in gasoline prices on net sales is calculated based on the difference between the current and prior period's average price per gallon. Results expressed excluding the impacts of foreign-exchange and gasoline prices are intended as supplemental information and are not a substitute for net sales presented in accordance with U.S. GAAP and should be reviewed in conjunction with results reported in accordance with U.S. GAAP.\nOur fiscal year ends on the Sunday closest to August 31. References to the third quarter of 2025 and 2024 relate to the 12-week fiscal quarters ended May 11, 2025, and May 12, 2024. References to the first thirty-six weeks of 2025 and 2024 relate to the 36 weeks ended May 11, 2025, and May 12, 2024. Certain percentages presented are calculated using actual results prior to rounding.\nHighlights for the third quarter of 2025 versus 2024 include:\n•\nNet sales increased 8% to $61,965, driven by an increase in comparable sales and sales at 29 net new warehouses opened since the end of the third quarter of 2024;\n•\nMembership fee revenue increased 10% to $1,240, primarily driven by new member sign-ups and membership fee increases;\n•\nGross margin percentage increased 41 basis points; 29 basis points excluding the impact of gasoline price deflation on net sales;\n•\nSG&A expenses as a percentage of net sales increased 20 basis points; 11 basis points excluding the impact of gasoline price deflation;\n•\nNet income increased to $1,903, $4.28 per diluted share, compared to $1,681, $3.78 per diluted share in 2024. Foreign-exchange rates had a negative impact on net income of $35, $0.08 per diluted share; and\n•\nA quarterly cash dividend of $1.30 per share, a 12% increase, was declared on April 16, 2025, and paid on May 16, 2025.\n19\nTable of Contents\nRESULTS OF OPERATIONS\nNet Sales\n12 Weeks Ended\n36 Weeks Ended\nMay 11,\n2025\nMay 12,\n2024\nMay 11,\n2025\nMay 12,\n2024\nNet Sales\n$\n61,965 \n$\n57,392 \n$\n185,480 \n$\n171,440 \nIncreases in net sales:\nU.S.\n9 \n%\n9 \n%\n9 \n%\n6 \n%\nCanada\n4 \n%\n10 \n%\n5 \n%\n9 \n%\nOther International \n6 \n%\n10 \n%\n6 \n%\n12 \n%\nTotal Company\n8 \n%\n9 \n%\n8 \n%\n7 \n%\nIncreases in comparable sales\n(1)\n:\nU.S.\n7 \n%\n6 \n%\n7 \n%\n4 \n%\nCanada\n3 \n%\n8 \n%\n4 \n%\n8 \n%\nOther International\n3 \n%\n8 \n%\n3 \n%\n9 \n%\nTotal Company\n6 \n%\n7 \n%\n6 \n%\n5 \n%\nE-commerce\n15 \n%\n21 \n%\n16 \n%\n15 \n%\nIncreases in comparable sales excluding the impact of changes in foreign-currency and gasoline prices\n(1)\n:\nU.S.\n8 \n%\n6 \n%\n8 \n%\n4 \n%\nCanada\n8 \n%\n7 \n%\n8 \n%\n8 \n%\nOther International\n9 \n%\n8 \n%\n9 \n%\n8 \n%\nTotal Company\n8 \n%\n7 \n%\n8 \n%\n5 \n%\nE-commerce\n16 \n%\n21 \n%\n17 \n%\n15 \n%\n_______________\n(1) Comparable sales for the third quarter and first thirty-six weeks of 2024 were calculated using comparable retail weeks.\nNet Sales\nNet sales increased $4,573 or 8%, and $14,040 or 8% during the third quarter and first thirty-six weeks of 2025. The improvement was primarily attributable to an increase in comparable sales of $3,266 or 6% and $10,309 or 6% during the third quarter and first thirty-six weeks of 2025. The remaining increase was driven by sales at the 29 net new warehouses opened since the end of the third quarter of 2024. Sales increased $4,543 or 10% and $13,662 or 10% in core merchandise categories during the third quarter and first thirty-six weeks of 2025, increasing in all categories. Sales in warehouse ancillary and other businesses were up slightly during the third quarter of 2025, and increased $378 or 1% during the first thirty-six weeks of 2025.\nLower gasoline prices negatively impacted net sales by $642, or 112 basis points, and $1,606, or 94 basis points, during the third quarter and first thirty-six weeks of 2025. The average price per gallon decreased 9% and 8% during the third quarter and first thirty-six weeks of 2025. The volume of gasoline sold increased approximately 1%, positively impacting net sales by $59, or ten basis points and $191, or 11 basis points during the third quarter and first thirty-six weeks of 2025.\nChanges in foreign currencies relative to the U.S. dollar attributable to our Other International and Canadian operations negatively impacted net sales by approximately $699, or 122 basis points, and approximately $2,107, or 123 basis points, during the third quarter and first thirty-six weeks of 2025.\n20\nTable of Contents\nComparable Sales\nComparable sales increased 6% in the third quarter and first thirty-six weeks of 2025 and were positively impacted by increased shopping frequency of 5% and an average ticket increase of less than 1%.\nMembership Fees\n12 Weeks Ended\n36 Weeks Ended\nMay 11,\n2025\nMay 12,\n2024\nMay 11,\n2025\nMay 12,\n2024\nMembership fees\n$\n1,240 \n$\n1,123 \n$\n3,599 \n$\n3,316 \nMembership fees increase\n10 \n%\n8 \n%\n9 \n%\n8 \n%\nTotal paid members (000s)\n79,600 \n74,500 \n— \n— \nTotal cardholders (000s)\n142,800 \n133,900 \n— \n— \nMembership fee revenue increased 10% and 9% in the third quarter and first thirty-six weeks of 2025, primarily driven by new member sign-ups and membership fee increases. At the end of the third quarter of 2025, our renewal rates were 92.7% in the U.S. and Canada and 90.2% worldwide. Our renewal rates were negatively impacted by sign-ups from a digital promotion in the fall of 2023 entering the renewal calculation this quarter and higher penetration of online sign-ups in recent years. Our renewal rate, which excludes affiliates of Business members, is a trailing calculation that captures renewals during the period seven to eighteen months prior to the reporting date.\nAs previously reported, we increased our annual membership fees in the U.S. and Canada, effective September 1, 2024. We account for membership fee revenue on a deferred basis, recognized ratably over the one-year membership period. The fee increase contributed approximately 4% of membership fee revenue during the third quarter of 2025.\nGross Margin\n12 Weeks Ended\n36 Weeks Ended\nMay 11,\n2025\nMay 12,\n2024\nMay 11,\n2025\nMay 12,\n2024\nNet sales\n$\n61,965 \n$\n57,392 \n$\n185,480\n$\n171,440\nLess merchandise costs\n54,996 \n51,173 \n164,849\n152,770\nGross margin\n$\n6,969 \n$\n6,219 \n$\n20,631\n$\n18,670\nGross margin percentage\n11.25 \n%\n10.84 \n%\n11.12 \n%\n10.89 \n%\nQuarterly Results\nGross margin percentage increased 41 basis points. Excluding the impact of gasoline price deflation on net sales, gross margin percentage increased to 11.13%, 29 basis points. This increase was positively impacted by 27 basis points in our core merchandise categories, primarily in fresh foods and foods and sundries and 27 basis points in warehouse ancillary and other businesses, primarily gasoline and e-commerce. \nGross margin was negatively impacted by 23 basis points due to a LIFO charge for higher merchandise costs and two basis points for a one-time expense for increased employee vacation\n. Changes in foreign currencies relative to the U.S. dollar negatively impacted gross margin by approximately $80, compared to the third quarter of 2024, attributable to our Other International and Canadian operations.\nThe gross margin in core merchandise categories, when expressed as a percentage of core merchandise sales (rather than total net sales), increased 36 basis points. The increase was across all categories, most significantly fresh foods which benefited from sales leverage, higher productivity, and lower prices for certain commodities. This measure eliminates the impact of changes in sales penetration and gross margin from our warehouse ancillary and other businesses.\n21\nTable of Contents\nGross margin percentage on a segment basis, when expressed as a percentage of the segment's own sales and excluding the impact of changes in gasoline prices on net sales (segment gross margin percentage), increased in our U.S. segment, which performed similarly to the consolidated results above. Our Canadian segment gross margin percentage increased, primarily due to increases in core merchandise categories and warehouse ancillary and other businesses. Gross margin increased in our Other International segment, primarily due to increases in warehouse ancillary and other businesses.\nYear-to-date Results\nGross margin percentage increased 23 basis points. Excluding the impact of gasoline price deflation on net sales, gross margin percentage increased to 11.03%, 14 basis points. This increase was positively impacted by 18 basis points in our core merchandise categories, primarily due to increases in our co-branded credit card program and fresh foods, and four basis points in warehouse ancillary and other businesses, primarily e-commerce, partially offset by gasoline. Gross margin percentage was negatively impacted by eight basis points due to a LIFO charge. Changes in foreign currencies relative to the U.S. dollar negatively impacted gross margin by approximately $238, compared to the first thirty-six weeks of 2024, attributable to our Other International and Canadian operations.\nThe gross margin in core merchandise categories, when expressed as a percentage of core merchandise sales (rather than total net sales), increased ten basis points. The increase was primarily due to fresh foods and foods and sundries, partially offset by non-foods.\nSegment gross margin percentage increased in all segments. Our U.S. segment performed similarly to the consolidated results above. Our Canadian and Other International segments gross margin increased, primarily due to increases in core merchandise categories.\nSelling, General and Administrative Expenses\n12 Weeks Ended\n36 Weeks Ended\nMay 11,\n2025\nMay 12,\n2024\nMay 11,\n2025\nMay 12,\n2024\nSG&A expenses\n$\n5,679 \n$\n5,145 \n$\n17,188 \n$\n15,743 \nSG&A expenses as a percentage of net sales\n9.16 \n%\n8.96 \n%\n9.27 \n%\n9.18 \n%\nQuarterly Results\nSG&A expenses as a percentage of net sales increased 20 basis points. SG&A expenses as a percentage of net sales excluding the impact of gasoline price deflation was 9.07%, an increase of 11 basis points. The comparison to last year was negatively impacted by five basis points due to warehouse operations and other businesses, which included our investment in employee wages. \nA one-time expense for increased employee vacation\n negatively impacted SG&A by five basis points. Preopening and central operating costs were both higher by one basis point. Stock compensation decreased by one basis point.\nYear-to-date Results\nSG&A expenses as a percentage of net sales increased nine basis points. SG&A expenses as a percentage of net sales excluding the impact of gasoline price deflation was 9.19%, an increase of one basis point. Changes in foreign currencies relative to the U.S. dollar decreased SG&A expenses by approximately $142 compared to the first thirty-six weeks of 2024, attributable to our Other International and Canadian operations.\n22\nTable of Contents\nInterest Expense\n12 Weeks Ended\n36 Weeks Ended\nMay 11,\n2025\nMay 12,\n2024\nMay 11,\n2025\nMay 12,\n2024\nInterest expense\n$\n35 \n$\n41 \n$\n108 \n$\n120 \nInterest expense is primarily related to Senior Notes and financing leases. The decrease in interest expense for the third quarter and first thirty-six weeks of 2025 was primarily due to repayment of the 2.750% Senior Notes in May 2024.\nInterest Income and Other, Net\n12 Weeks Ended\n36 Weeks Ended\nMay 11,\n2025\nMay 12,\n2024\nMay 11,\n2025\nMay 12,\n2024\nInterest income\n$\n95 \n$\n94 \n$\n300 \n$\n395 \nForeign-currency transaction gains (losses), net\n(17)\n20 \n49 \n54 \nOther, net\n7 \n14 \n25 \n55 \nInterest income and other, net\n$\n85 \n$\n128 \n$\n374 \n$\n504 \nThe decrease in interest income in the first thirty-six weeks of 2025 was due to lower interest rates, partially offset by higher cash balances. Foreign-currency transaction gains (losses), net, include mark-to-market adjustments for forward foreign-exchange contracts and revaluation or settlement of monetary assets and liabilities by our Canadian and Other International operations. See Derivatives and Foreign Currency sections in Item 8, Note 1 of our Annual Report on Form 10-K, for the fiscal year ended September 1, 2024.\nProvision for Income Taxes\n \n12 Weeks Ended\n36 Weeks Ended\n \nMay 11,\n2025\nMay 12,\n2024\nMay 11,\n2025\nMay 12,\n2024\nProvision for income taxes\n$\n677 \n$\n603 \n$\n1,819 \n$\n1,614 \nEffective tax rate\n26.2 \n%\n26.4 \n%\n24.9 \n%\n24.4 \n%\nThe effective tax rate for the first thirty-six weeks of 2025\n \nwas favorably impacted by discrete tax benefits of $100 related to stock compensation.\nThe effective tax rate for the first thirty-six weeks of 2024 was favorably impacted by discrete tax benefits of $94 related to the portion of the special cash dividend payable through our 401(k) plan and $44 related to stock compensation.\nLIQUIDITY AND CAPITAL RESOURCES\nThe following table summarizes our significant sources and uses of cash and cash equivalents:\n36 Weeks Ended\nMay 11,\n2025\nMay 12,\n2024\nNet cash provided by operating activities\n$\n9,468 \n$\n8,381 \nNet cash used in investing activities\n(3,343)\n(2,706)\nNet cash used in financing activities\n(2,182)\n(8,948)\nOur primary sources of liquidity are cash flows from operations, cash and cash equivalents, and short-term investments. Cash and cash equivalents and short-term investments were $14,850 and $11,144 at \n23\nTable of Contents\nMay 11, 2025, and September 1, 2024. Of these balances, unsettled credit and debit card receivables represented approximately $2,587 and $2,519 at May 11, 2025, and September 1, 2024. These receivables generally settle within four days.\nMaterial contractual obligations arising in the normal course of business primarily consist of purchase obligations, long-term debt and related interest payments, leases, and construction and land purchase obligations. Purchase obligations consist of contracts primarily related to merchandise, equipment, and third-party services, the majority of which are due in the next 12 months. Construction and land-purchase obligations consist of contracts primarily related to the development and opening of new and relocated warehouses, the majority of which (other than leases) are due in the next 12 months.\nWe believe that our cash and investment position and operating cash flow, with capacity under existing and available credit agreements, will be sufficient to meet our liquidity and capital requirements for the foreseeable future and that our U.S. current and projected asset position is sufficient to meet our U.S. liquidity requirements.\nCash Flows from Operating Activities\nNet cash provided by operating activities totaled $9,468 in the first thirty-six weeks of 2025, compared to $8,381 in the first thirty-six weeks of 2024. Our cash flow provided by operations is primarily fr\nom net sales and membership fees. Cash flow used in operations generally consists of payments to mercha\nndise suppliers, warehouse operating costs, including wages and employee benefits, utilities, credit and debit card processing fees, and operating leases. Cash used in operations also includes payments for income taxes. Changes in our net investment in merchandise inventories (the difference between merchandise inventories and accounts payable) is impacted by several factors, including inventory levels and turnover, payment terms with suppliers, and early payments to obtain discounts.\nCash Flows from Investing Activities\nNet cash used in investing activities totaled $3,343 in the first thirty-six weeks of 2025, compared to $2,706 in the first thirty-six weeks of 2024, and is primarily related\n to capital expenditures. \nNet cash from investing activities also includes purchases and maturities of short-term investments.\nCapital Expenditure Plans\nOur primary requirements for capital are acquiring land, buildings, and equipment for new and remodeled warehouses, information systems and manufacturing and distribution facilities. In the first thirty-six weeks of 2025, we spent $3,532 on capital expenditures, and it is our current intention to spend slightly over $5,000 during fiscal 2025. These expenditures are expected to be financed with cash from operations, cash and cash equivalents, and short-term investments. We opened\n 17 \nnew warehouses, includ\ning two relocations, in\n the first thirty-six weeks of 2025 and plan to open ten additional new warehouses, including one relocation, \nin\n the remainder of fiscal 2025. There can be no assurance that current expectations will be realized, and plans are subject to change upon further review of our capital expenditure needs and the economic environment.\nCash Flows from Financing Activities\nNet cash used in financing activities totaled $2,182 in the first thirty-six weeks of 2025, compared to $8,948 in the first thirty-six weeks of 2024. Cash flow used in financing activities during the first thirty-six weeks of 2025 was primarily related to the\n payment of dividends, repayments of short-term borrowings, repurchases of common stock, and withholding taxes on stock-based awards. Cash flow provided by financing activities included proceeds from short-term borrowings\n. In the first thirty-six weeks of 2024, cash flow used in financing was primarily due to the payment of a special dividend.\nDividends\nA quarterly cash dividend of $1.30 per share was declared on April 16, 2025, and paid on May 16, 2025.\n24\nTable of Contents\nShare Repurchase Program\nOn January 19, 2023, the Board of Directors authorized a share repurchase program in the amount of $4,000, which expires in January 2027. During the first thirty-six weeks of 2025 and 2024, we repurchased 658,000 and 749,000 shares of common stock, at an average price per share of $946.64 and $646.07, totaling approximately $623 and $484. These amounts may differ from the accompanying condensed consolidated statements of cash flows due to changes in unsettled repurchases at the end of a quarter. Purchases are made from time to time, as conditions warrant, in the open market or in block purchases, pursuant to plans under SEC Rule 10b5-1. Repurchased shares are retired, in accordance with the Washington Business Corporation Act. The remaining amount available to be purchased under our approved plan was $2,242 at the end of the third quarter.\nBank Credit Facilities and Commercial Paper Programs\nWe maintain bank credit facilities for working capital and general corporate purposes. At May 11, 2025, we had borrowing capacity under these facilities of $1,176. Our international operations maintain $681 of this capacity under bank credit facilities, of which $164 is guaranteed by the Company. Short-term borrowings outstanding under the bank credit facilities, which are included in other current liabilities on the consolidated balance sheets, were immaterial at the end of the third quarter of 2025 and at the end of 2024.\nWe have letter of credit facilities, for commercial and standby letters of credit, totaling $228. The outstanding commitments under these facilities at the end of the third quarter of 2025 totaled $205, most of which were standby letters of credit that do not expire or have expiration dates within one year. The bank credit facilities have various expiration dates, most within one year, and we generally intend to renew these facilities. The amount of borrowings available at any time under our bank credit facilities is reduced by the amount of standby and commercial letters of credit outstanding.\nCritical Accounting Estimates\nThe preparation of our consolidated financial statements in accordance with U.S. GAAP requires that we make estimates and judgments. We base these on historical experience and on assumptions that we believe to be reasonable. Our critical accounting policies are discussed in Part II, Item 7, “Management’s Discussion and Analysis of Financial Condition and Results of Operations” section of our Annual Report on Form 10-K, for the fiscal year ended September 1, 2024. There have been no material changes to the critical accounting estimates previously disclosed in that Report.\nRecent Accounting Pronouncements\nSee discussion of Recent Accounting Pronouncements in \nNote 1\n to the condensed consolidated financial statements included in Part I, Item 1 of this Report."
}