{
  "source_file": "cost-20250831.htm",
  "form_type": "10-K",
  "item1": "Item 1—Business\nCostco Wholesale Corporation and its subsidiaries (Costco or the Company) began operations in 1983, in Seattle, Washington. We are principally engaged in the operation of membership warehouses in the United States (U.S.) and Puerto Rico, Canada, Mexico, Japan, the United Kingdom (U.K.), Korea, Australia, Taiwan, China, Spain, France, Sweden, Iceland, and New Zealand. Costco operated 914, 890, and 861 warehouses worldwide at August 31, 2025, September 1, 2024, and September 3, 2023. The Company operates e-commerce sites in the U.S., Canada, Mexico, the U.K., Korea, Taiwan, Japan, and Australia. Our common stock trades on the NASDAQ Global Select Market, under the symbol “COST.”\nWe report on a 52/53-week fiscal year, consisting of thirteen four-week periods and ending on the Sunday nearest the end of August. The first three quarters consist of three periods each, and the fourth quarter consists of four periods (five weeks in the thirteenth period in a 53-week year). The material seasonal impact in our operations is increased net sales and earnings during the winter holiday season. References to 2025 and 2024 relate to the 52-week fiscal years ended August 31, 2025, and September 1, 2024. References to 2023 relate to the 53-week fiscal year ended September 3, 2023. \nGeneral\nWe operate membership warehouses and e-commerce sites based on the concept that offering low prices on a limited selection of nationally-branded and private-label products in a wide range of categories will produce high sales volumes and rapid inventory turnover. When combined with the operating efficiencies achieved by volume purchasing, efficient distribution and reduced handling of merchandise in no-frills, self-service warehouse facilities, these volumes and turnover enable us to operate profitably at significantly lower gross margins (net sales less merchandise costs) than most other retailers. We often sell inventory before we are required to pay for it, even while taking advantage of early payment discounts.\nWe buy most of our merchandise directly from suppliers and route it to cross-docking consolidation points (depots) or directly to our warehouses. Our depots receive large shipments from suppliers and quickly ship these goods to warehouses. This process creates freight volume and handling efficiencies, lowering \n3\nTable of Contents\ncosts associated with traditional multiple-step distribution channels. Our e-commerce operations ship merchandise through our depots and logistics operations, as well as through drop-ship and other delivery arrangements with our suppliers.\nOur average warehouse space is approximately 147,000 square feet, with newer units being slightly larger. Floor plans are designed for efficiency in the use of selling space, the handling of merchandise, and the control of inventory. Because shoppers are attracted principally by the quality of merchandise and low prices, our warehouses are not elaborate. By strictly controlling the entrances and exits and using a membership format, we believe our inventory losses (shrinkage) are well below those of typical retail operations.\nOur operating hours are shorter than many other retailers, and due to other efficiencies inherent in a warehouse club operation, we believe labor costs are lower relative to the volume of sales. In the U.S., we recently added exclusive shopping hours for our Executive members and our gasoline operations generally have extended hours. Merchandise is generally stored on racks above the sales floor and displayed on pallets containing large quantities, reducing labor required. In general, with variations by country, our warehouses accept certain credit cards, including Costco co-branded cards, debit cards, cash and checks, Executive member 2% reward certificates, co-brand cardholder rebates, and our proprietary stored-value card (shop card).\nOur strategy is to provide our members with a broad range of high-quality merchandise at prices we believe are consistently lower than elsewhere. We seek to limit most items to fast-selling models, sizes, and colors. We carry less than 4,000 active stock keeping units (SKUs) per warehouse in our core warehouse business, significantly less than other broadline retailers. We average from 9,000 to 10,000 SKUs online, some of which are available in our warehouses. Many consumable products are offered for sale in case, carton, or multiple-pack quantities only.\nTo promote member satisfaction, we generally accept returns of merchandise. On certain electronic items, we have a 90-day return policy and provide, free of charge, technical support services, as well as an extended warranty. Additional third-party warranty coverage is sold on certain electronic items and major appliances.\nWe offer merchandise and services in the following categories:\n■\nCore Merchandise Categories:\n•\nFoods and Sundries\n (including sundries, dry grocery, candy, cooler, freezer, liquor, and tobacco)\n•\nNon-Foods\n (including major appliances, small electronics, health and beauty aids, hardware, lawn and garden, sporting goods, tires, toys and seasonal, automotive, stamps, tickets, apparel, furniture, domestics, housewares, special order kiosk, and jewelry)\n•\nFresh Foods\n (including meat, produce, deli, and bakery)\n■\nWarehouse Ancillary\n (includes gasoline, pharmacy, optical, food court, hearing aids, and tire installation)\n■\nOther Businesses\n (includes e-commerce, business centers, travel, and other)\nWarehouse ancillary operate primarily within, next to or near our warehouses, encouraging more frequent shopping. The number of warehouses with gas stations varies significantly by country. We operated 747 gas stations at the end of 2025. Our gasoline business represented approximately 10% of total net sales in 2025.\nOur other businesses sell products and services that largely complement our warehouse operations. Our e-commerce operations give members convenience and a broader selection of goods and services. Net sales for e-commerce represented approximately 7% of total net sales in 2025. Digitally-enabled sales, \n4\nTable of Contents\nwhich represents sales delivered to members that are initiated through a digital device, whether fulfilled through a warehouse or distribution center, as well as Costco Travel, represented approximately 10% of total net sales in 2025. Our business centers carry items tailored for food services, convenience stores and offices and offer walk-in shopping and deliveries. Business centers are included in our total warehouse count. Costco Travel offers vacation packages, car rentals, cruises and other travel products exclusively for Costco members (offered to varying degrees in the U.S., Canada, Australia, and the U.K.).\nWe have direct relationships with many producers of brand-name merchandise. We do not obtain a significant portion of merchandise from any one supplier. When sources of supply become unavailable, we seek alternative sources or items. For future product supply need, we pursue diversification in our supply-chain and seek to expand in-country production. We also purchase and manufacture private-label merchandise, as long as quality and member demand are high and the value to our members is significant. \nCertain financial information for our segments and geographic areas is included in \nNote 11\n to the consolidated financial statements included in Item 8 of this Report.\nMembership\nOur members may utilize their memberships at all of our warehouses and e-commerce sites. Gold Star memberships are available to individuals; Business memberships are limited to businesses, including individuals with a business license or comparable document. Business members may add additional cardholders (affiliates), to which the same annual fee applies. Affiliates are not available for Gold Star members. Our annual fee for these memberships is $65 in the U.S. and varies in other countries. All paid memberships include a free household card. \nPaid members (except affiliates) are eligible to upgrade to an Executive membership in the U.S., for an additional annual fee of $65. Executive memberships are also available in Canada, Mexico, the U.K., Japan, Korea, Taiwan, and Australia, for which the additional fee varies. Executive members earn a 2% reward on qualified purchases (generally up to a maximum reward of $1,250 per year), redeemable at Costco warehouses. The sales penetration of Executive members represented approximately 73.6% of worldwide net sales in 2025.\nMembership at the end of 2025, 2024, and 2023 was made up of the following (in thousands):\n2025\n2024\n2023\nGold Star\n68,300 \n63,700 \n58,800 \nBusiness, including affiliates\n12,700 \n12,500 \n12,200 \nTotal paid members\n1\n81,000 \n76,200 \n71,000 \nHousehold cards\n64,200 \n60,600 \n56,900 \nTotal cardholders\n145,200 \n136,800 \n127,900 \n_______________\n(1)\nExecutive members represented 38,700, 35,400, and 32,300 of total paid members in 2025, 2024, and 2023.\nThese membership counts include active memberships as well as memberships that have expired and not renewed within the 12 months prior to the reporting date. These expired memberships make up a small percentage of these membership counts, and many of them are subsequently renewed.\nOur member renewal rate was 92.3% in the U.S. and Canada and 89.8% worldwide at the end of 2025. That rate, which excludes affiliates of Business members, is a trailing calculation that captures renewals during the period seven to eighteen months prior to the reporting date. Memberships that have an expiration date in the six months prior to the end of our reporting period are excluded from this calculation, regardless of whether or not they have been renewed. Although most members renew prior to expiration, the vast majority of those who renew late do so within six months of expiration. The timing of \n5\nTable of Contents\nrenewal after expiration is impacted by a variety of factors, such as warehouse openings and promotional activity.\nHuman Capital\n“Take Care of Our Employees,” is a key component of our code of ethics and is fundamental to our commitment to “Take Care of Our Members.” Compensation and benefits for employees is our largest expense after the cost of merchandise and is carefully monitored.\nEmployee Base\nAt the end of 2025, we employed 341,000 employees worldwide. Approximately 95% are employed in our membership warehouses and distribution channels. Around 5% are represented by unions. We also utilize seasonal employees.\nThe total number of employees by segment was:\n2025\n2024\n2023\nUnited States\n223,000 \n219,000 \n208,000 \nCanada\n55,000 \n53,000 \n51,000 \nOther International\n63,000 \n61,000 \n57,000 \nTotal employees\n341,000 \n333,000 \n316,000 \nGrowth and Engagement\nWe believe that our warehouses are among the most productive in the retail industry, owing largely to the commitment and efficiency of our employees. We seek to provide them not merely with employment but careers. Many attributes of our business contribute to the objective. The more significant include: competitive compensation and benefits; a commitment to employee development and promoting from within; and a target ratio of at least 50% of our base being full-time employees. These attributes contribute to what we consider, especially for the industry, a high retention rate. In 2025, in the U.S. and Canada that rate was approximately 94% for employees who have been with us for at least one year.\nInclusion\nThe commitment to “Take Care of Our Employees” includes promoting an inclusive and respectful workplace. We strive for an environment where all employees feel that they belong, are accepted, included, respected and supported. We demonstrate leadership commitment to inclusion through consistent communication, employee development and education, support of diversity and inclusion initiatives within the organization, community involvement, and supplier inclusion. Listening to our employees is one of the ways Costco takes care of its workforce. In 2025, we hosted the Costco Connects meetings, its second annual Costco Connects campaign. These open listening sessions are an invitation for employees to talk about what is on their minds and what is impacting them both personally and professionally. This allows Costco leaders to engage with their employees on a deeper level and for employees to build connections with each other. This year we had approximately 200,000 employees participate globally. Costco continues its efforts to develop future leaders, including through our supervisor in training (SIT) programs in the U.S. and Canada. In 2025, approximately 7,500 hourly employees completed the 6-week course.\nWell Being\nWe strive to provide our employees with competitive wages and excellent benefits. In March 2025, we increased the starting wage by $0.50 an hour to at least $20.00 for all entry-level positions in the U.S. and Canada. We also increased the top of wage scales by $1.00 per hour, bringing our average hourly rate at the end of 2025 for hourly employees in the U.S. to approximately $32.00 per hour. We continue to offer \n6\nTable of Contents\nexpansive benefits in the U.S. that provide physical, emotional, mental, and financial well-being support for employees and their dependents at low cost to our employees.\nFor more detailed information regarding our programs and initiatives, see “Employees” within our Sustainability Commitment (located on our website). The Sustainability Commitment and other information on our website are not incorporated by reference into and do not form any part of this Annual Report.\nCompetition\nOur industry is highly competitive, based on factors such as price, merchandise quality and selection, location, convenience, distribution strategy, and customer service. We compete on a worldwide basis with global, national, and regional wholesalers and retailers, including supermarkets, supercenters, online retailers, gasoline stations, hard discounters, department and specialty stores, and operators selling a single category or narrow range of merchandise. Walmart, Target, Kroger, and Amazon are among our significant general merchandise retail competitors in the U.S. We also compete with other warehouse clubs, including Walmart’s Sam’s Club and BJ’s Wholesale Club in the U.S. Many of the metropolitan areas in the U.S. and certain of our Other International locations have multiple competing clubs.\nIntellectual Property\nWe believe that, to varying degrees, our trademarks, trade names, copyrights, proprietary processes, trade secrets, trade dress, domain names and similar intellectual property add significant value to our business and are important to our success. We have invested significantly in the development and protection of our well-recognized brands, including the Costco Wholesale trademarks and our private-label brand, Kirkland Signature. We believe that Kirkland Signature products are high quality, offered at prices that are generally lower than national brands, and help lower costs, differentiate our merchandise offerings, and generally earn higher margins. We expect to continue to increase the sales penetration of our private-label items.\nWe rely on trademark and copyright laws, trade-secret protection, and confidentiality, license and other agreements with our suppliers, employees and others to protect our intellectual property. The availability and duration of trademark registrations vary by country; however, trademarks are generally valid and may be renewed indefinitely as long as they are in use and registrations are maintained.\nAvailable Information\nOur U.S. website is www.costco.com. We make available through the Investor Relations section of that site, free of charge, our Annual Reports on Form 10-K, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K, Proxy Statements and Forms 3, 4 and 5, and any amendments to those reports, as soon as reasonably practicable after filing such materials with or furnishing such documents to the Securities and Exchange Commission (SEC). The information found on our website is not part of this or any other report filed with or furnished to the SEC. The SEC maintains a site that contains reports, proxy and information statements, and other information regarding issuers, such as the Company, that file electronically with the SEC at www.sec.gov.\nWe have a code of ethics for senior financial officers, pursuant to Section 406 of the Sarbanes-Oxley Act. Copies of the code are available free of charge by writing to Secretary, Costco Wholesale Corporation, 999 Lake Drive, Issaquah, WA 98027. If the Company makes any amendments to this code (other than technical, administrative, or non-substantive amendments) or grants any waivers, including implicit waivers, to the Chief Executive Officer, Chief Financial Officer or principal accounting officer and controller, we will disclose (on our website or in a Form 8-K report filed with the SEC) the nature of the amendment or waiver, its effective date, and to whom it applies.\n7\nTable of Contents\nInformation about our Executive Officers\nThe executive officers of Costco, their position, and ages are listed below. Most officers have over 25 years of service with the Company.\nName\nPosition\nExecutive\nOfficer\nSince\nAge\nRon M. Vachris\nPresident and Chief Executive Officer. Mr. Vachris has been a director since February 2022. Mr. Vachris was previously President and Chief Operating Officer from February 2022 to December 2023. He was Executive Vice President of Merchandising from June 2016 to January 2022, Senior Vice President, Real Estate Development, from August 2015 to June 2016, and Senior Vice President, General Manager, Northwest Region, from 2010 to July 2015.\n2016\n60\nGary Millerchip\nExecutive Vice President and Chief Financial Officer. Mr. Millerchip previously served as Senior Vice President and Chief Financial Officer of The Kroger Co. from April 2019 to February 2024 and, prior to that, as Chief Executive Officer of Kroger Personal Finance since July 2010.\n2024\n54\nRuss Miller\nSenior Executive Vice President, U.S. Operations. Mr. Miller was Executive Vice President, Chief Operating Officer, Southwest Division and Mexico, from January 2018 to May 2022. Mr. Miller was Senior Vice President, Western Canada Region, from 2001 to January 2018. Mr. Miller will be retiring from the Company effective February 2026.\n2018\n68\nClaudine Adamo\nExecutive Vice President, Merchandising. Ms. Adamo was Senior Vice President, Non-Foods, from 2018 to February 2022, and Vice President, Non-Foods, from 2013 to 2018.\n2022\n55\nPatrick Callans\nExecutive Vice President, Administration. Mr. Callans was Senior Vice President, Human Resources and Risk Management, from 2013 to December 2018.\n2019\n63\nCaton Frates\nExecutive Vice President, Chief Operating Officer, Southwest Division. Mr. Frates was Senior Vice President, Los Angeles Region, from 2015 to May 2022. Mr. Frates will be appointed Senior Executive Vice President, Warehouse Operations - U.S. and Mexico, effective February 2026.\n2022\n57\nTeresa Jones\nExecutive Vice President, Global Depots and Traffic. Ms. Jones was Senior Vice President, Depot Operations from August 2022 to July 2024, and Vice President, Depot Operations, from 2018 to 2022.\n2024\n56\nJim C. Klauer\nExecutive Vice President, Chief Operating Officer, Northern Division. Mr. Klauer was Senior Vice President, Non-Foods and E-commerce Merchandise, from 2013 to January 2018.\n2018\n63\nJavier Polit\nExecutive Vice President, Chief Information and Digital Officer. Mr. Polit previously served as Chief Information Officer for Mondelez International (formerly Kraft Foods) from 2022 to 2024. From 2017 to 2022, he was Chief Information Officer for The Procter & Gamble Company. Prior to that role, he served as Group Chief Information Officer for The Coca-Cola Company from 2007 to 2017.\n2023\n61\nPierre Riel\nExecutive Vice President, Chief Operating Officer, International Division. Mr. Riel was Senior Vice President, Country Manager, Canada, from 2019 to March 2022, and Senior Vice President, Eastern Canada Region, from 2001 to 2019.\n2022\n62\nYoram Rubanenko\nExecutive Vice President, Chief Operating Officer, Eastern Division. Mr. Rubanenko was Senior Vice President and General Manager, Southeast Region, from 2013 to September 2021, and Vice President, Regional Operations Manager for the Northeast Region, from 1998 to 2013.\n2021\n61\nJohn Sullivan\nExecutive Vice President, General Counsel & Corporate Secretary. Mr. Sullivan has been General Counsel since 2016 and Corporate Secretary since 2010.\n2021\n65\nW. Richard Wilcox\nExecutive Vice President, Chief Operating Officer, Southwest Division. Mr. Wilcox was Senior Vice President, General Manager - San Diego Region from 2016 to October 2025.\n2025\n59\n8\nTable of Contents",
  "item7": "Item 7—Management's Discussion and Analysis of Financial Condition and Results of Operations \n(amounts in millions, except per share, share, percentages and warehouse count data)\nOverview\nManagement's Discussion and Analysis of Financial Condition and Results of Operations (MD&A) is intended to promote understanding of the results of operations and financial condition. MD&A is provided as a supplement to, and should be read in conjunction with, our consolidated financial statements and the accompanying Notes to Financial Statements (Part II, Item 8 of this Form 10-K). This section generally discusses the results of operations for 2025 compared to 2024. For discussion related to the results of operations and changes in financial condition for 2024 compared to 2023 refer to Part II, Item 7, Management's Discussion and Analysis of Financial Condition and Results of Operations in our fiscal year 2024 Form 10-K, which was filed with the Securities and Exchange Commission (SEC) on October 9, 2024.\nWe believe that the most important driver of our profitability is increasing net sales, particularly comparable sales. Net sales includes our core merchandise categories (foods and sundries, non-foods, and fresh foods), warehouse ancillary (gasoline, pharmacy, optical, food court, hearing aids, and tire installation) and other businesses (e-commerce, business centers, travel, and other). E-commerce and business center sales are allocated to the appropriate merchandise categories in the Net Sales discussion. The 2% reward associated with Executive membership reduces net sales and is allocated to the category in which the reward is generated (core merchandise categories, warehouse ancillary, and other businesses). Comparable sales is defined as net sales from warehouses open for more than one year, including remodels, relocations and expansions, and sales related to e-commerce sites operating for more than one year. The measure is intended as supplemental information and is not a substitute for net sales presented in accordance with U.S. generally accepted accounting principles (U.S. GAAP) and should be reviewed in conjunction with results reported in accordance with U.S. GAAP. Comparable sales growth is achieved through increasing shopping frequency from new and existing members and the amount they spend on each visit (average ticket). Sales comparisons can also be particularly influenced by certain factors that are beyond our control: fluctuations in currency exchange rates (with respect to our international operations) and inflation or deflation in the cost of gasoline and associated competitive conditions. The higher our comparable sales exclusive of these items, the more we can leverage our selling, general and administrative (SG&A) expenses, reducing them as a percentage of sales and enhancing profitability. Generating comparable sales growth is foremost a question of making available the right merchandise at the right prices, a skill that we believe we have repeatedly demonstrated over the long-term. Another substantial factor in net sales growth is the health of the economies in which we do business, including the effects of inflation or deflation, especially the United States. Net sales growth and gross margins are also impacted by competition, which is vigorous and widespread, across a wide range of global, national and regional wholesalers and retailers, including those with e-commerce operations. While we cannot control or reliably predict general economic health or changes in competition, we believe that we have been successful historically in adapting our business to these changes, such as through adjustments to our pricing and merchandise mix, including increasing the penetration of our private-label items, and through online offerings.\nOur philosophy is to provide our members with quality goods and services at competitive prices. We do not focus in the short-term on maximizing prices charged, but instead seek to maintain what we believe is a perception among our members of our “pricing authority” – consistently providing the most competitive values. Our net sales and gross margin are influenced in part by our merchandising and pricing strategies in response to cost increases. Those strategies can include, but are not limited to, working with our suppliers to share in absorbing cost increases, earlier-than-usual purchasing and in greater volumes, sourcing in the countries and regions where items are sold, as well as passing cost increases on to our members. Our investments in merchandise pricing may include reducing prices on merchandise to drive sales or meet competition and holding prices steady despite cost increases instead of passing the increases on to our members, negatively impacting gross margin and gross margin as a percentage of \n23\nTable of Contents\nnet sales (gross margin percentage) in the near term. Our e-commerce business, domestically and internationally, has a lower gross-margin percentage than our warehouse operations.\nGovernment actions in various countries relating to tariffs affect the costs of some of our merchandise. The degree of our exposure is dependent on (among other things) the type of goods, rates imposed, and timing of the tariffs. Higher tariffs are more likely to adversely impact rather than improve our results.\nWe believe our gasoline business enhances traffic in our warehouses; it generally has a lower gross margin percentage and lower SG&A expense relative to our non-gasoline businesses. A higher penetration of gasoline sales will generally lower our gross margin percentage. Generally, rising gasoline prices benefit net sales growth which, given the higher sales base, negatively impacts our gross margin percentage but decreases our SG&A expenses as a percentage of net sales. A decline in gasoline prices has the inverse effect.\nWe also achieve net sales growth by opening new warehouses. As our warehouse base grows and available and desirable sites become more difficult to secure, square footage growth becomes a comparatively less substantial component of growth. Negative aspects of such growth include lower initial operating profitability relative to existing warehouses and cannibalization of sales at existing warehouses when openings occur in existing markets. Our rate of square footage growth is generally higher in many of our foreign markets, due to the smaller base in those markets, and we expect that to continue.\nThe membership format is integral to our business and profitability. This format is designed to reinforce member loyalty and provide continuing fee revenue. The extent to which we achieve growth in our membership base, increase the penetration of Executive memberships, and sustain high renewal rates materially influences our profitability. Our renewal rate, which excludes affiliates of Business members, is a trailing calculation that captures renewals during the period seven to eighteen months prior to the reporting date. Our paid-membership growth rate may be adversely impacted when warehouse openings occur in existing markets as compared to new markets. Our worldwide renewal rate is adversely impacted by membership growth in newer international markets and a higher penetration of memberships sold online, including through digital membership promotions, which renew at a slightly lower rate on average.\nOur financial performance depends heavily on controlling costs. While we believe that we have achieved successes in this area, some significant costs are partially outside our control, particularly health care and utility expenses. With respect to the compensation of our employees, our philosophy is not to seek to minimize their wages and benefits. Rather, we believe that achieving our longer-term objectives of reducing employee turnover, increasing productivity and enhancing employee satisfaction requires maintaining compensation levels that are better than the industry average for much of our workforce. This may cause us, for example, to absorb costs that other employers might seek to pass through to their workforces. Because our business operates on very low margins, modest changes in various items in the consolidated statements of income, particularly merchandise costs and SG&A expenses, can have substantial impacts on net income.\nOur operating models are generally the same across our U.S., Canadian, and Other International operating segments (see \nNote 11\n to the consolidated financial statements included in Item 8 of this Report). Certain operations in the Other International segment have relatively higher rates of square footage growth, lower wage and benefit costs as a percentage of sales, less or no direct membership warehouse competition, or lack e-commerce or business delivery.\nIn discussions of our consolidated operating results, we refer to the impact of changes in foreign currencies relative to the U.S. dollar, which are differences between the foreign-exchange rates we use to convert the financial results of our international operations from local currencies into U.S. dollars. This impact is calculated based on the difference between the current and prior period's exchange rates. The impact of changes in gasoline prices on net sales is calculated based on the difference between the current and prior period's average price per gallon. Results expressed excluding the impacts of foreign-exchange and gasoline prices are intended as supplemental information and are not a substitute for net \n24\nTable of Contents\nsales presented in accordance with U.S. GAAP and should be reviewed in conjunction with results reported in accordance with U.S. GAAP.\nOur fiscal year ends on the Sunday closest to August 31. References to 2025 and 2024 relate to the 52-week fiscal years ended August 31, 2025, and September 1, 2024. References to 2023 relate to the 53-week fiscal year ended September 3, 2023. Certain percentages presented are calculated using actual results prior to rounding.\nHighlights for 2025 include:\n•\nWe opened 27 new warehouses, including three relocations, for a total of 24 net new warehouses: 15 in the U.S., two in our Canadian segment, and seven in our Other International segment, compared to 30 new warehouses, including one relocation, in 2024;\n•\nNet sales increased 8% to $269,912, driven by an increase in comparable sales and sales at new warehouses;\n•\nMembership fee revenue increased 10% to $5,323, driven by new member sign-ups and membership fee increases;\n•\nGross margin percentage increased 20 basis points; 11 basis points excluding the impact of gasoline price deflation on net sales;\n•\nSG&A expenses as a percentage of net sales increased 11 basis points; three basis points excluding the impact of gasoline price deflation;\n•\nThe effective tax rate in 2025 was 25.1%, compared to 24.4% in 2024;\n•\nNet income increased 10% to $8,099, or $18.21 per diluted share compared to $7,367, or $16.56 per diluted share in 2024. Foreign-exchange rates had a negative impact on net income of $97, $0.22 per diluted share; and\n•\nIn April, the Board of Directors approved a 12% increase in the quarterly cash dividend.\n25\nTable of Contents\nRESULTS OF OPERATIONS\nNet Sales\n2025\n2024\n2023\nNet Sales\n$\n269,912\n$\n249,625\n$\n237,710\nChanges in net sales:\nU.S.\n9 \n%\n4 \n%\n7 \n%\nCanada\n6 \n%\n6 \n%\n4 \n%\nOther International\n8 \n%\n9 \n%\n9 \n%\nTotal Company\n8 \n%\n5 \n%\n7 \n%\nChanges in comparable sales\n(1)\n:\nU.S.\n6 \n%\n4 \n%\n3 \n%\nCanada\n5 \n%\n7 \n%\n2 \n%\nOther International\n5 \n%\n8 \n%\n3 \n%\nTotal Company\n6 \n%\n5 \n%\n3 \n%\nE-commerce\n16 \n%\n16 \n%\n(6)\n%\nChanges in comparable sales excluding the impact of changes in foreign-currency and gasoline prices\n(1)\n:\nU.S.\n7 \n%\n5 \n%\n4 \n%\nCanada\n8 \n%\n8 \n%\n8 \n%\nOther International\n8 \n%\n8 \n%\n8 \n%\nTotal Company\n8 \n%\n6 \n%\n5 \n%\nE-commerce\n16 \n%\n16 \n%\n(5)\n%\n_______________\n(1)\nComparable sales for 2024 were calculated using comparable retail weeks.\nNet sales increased $20,287 or 8% during 2025. The improvement was primarily attributable to an increase in comparable sales of $14,788 or 6%. Comparable sales were positively impacted by increases of 5% in shopping frequency and approximately 1% in average ticket. The remaining increase in net sales was driven by sales at the 24 net new warehouses opened since the end of 2024.\nSales increased $19,086 or 10% in core merchandise categories, increasing in all categories. Sales in warehouse ancillary and other businesses increased $1,201, or 2%.\nLower gasoline prices negatively impacted net sales by $2,329, or 93 basis points, with an 8% decrease in the average price per gallon. The volume of gasoline sold increased approximately 2%, positively impacting net sales by $440, or 18 basis points.\nChanges in foreign currencies relative to the U.S. dollar negatively impacted net sales by approximately $1,943, or 78 basis points, attributable to our Other International and Canadian operations.\nMembership Fees\n2025\n2024\n2023\nMembership fees\n$\n5,323\n$\n4,828\n$\n4,580\nMembership fee revenue increased 10% in 2025, driven by new member sign-ups and membership fee increases. At the end of 2025, our member renewal rates were 92.3% in the U.S. and Canada and 89.8% worldwide. Renewal rates were negatively impacted by a higher number of memberships sold online, \n26\nTable of Contents\nincluding through digital promotions, entering the renewal rate calculation. These members renew at a slightly lower rate on average.\nAs previously reported, we increased our annual membership fees in the U.S. and Canada, effective September 1, 2024. We account for membership fee revenue on a deferred basis, recognized ratably over the one-year membership period. The fee income increase accounted for approximately 40% of membership income growth during 2025.\nGross Margin\n2025\n2024\n2023\nNet sales\n$\n269,912\n$\n249,625\n$\n237,710\nLess merchandise costs\n239,886\n222,358\n212,586\nGross margin\n$\n30,026\n$\n27,267\n$\n25,124\nGross margin percentage\n11.12 \n%\n10.92 \n%\n10.57 \n%\nGross margin percentage increased 20 basis points. Excluding the impact of gasoline price deflation on net sales, gross margin percentage was 11.03%, an increase of 11 basis points. This increase was positively impacted by 19 basis points in our core merchandise categories, primarily due to fresh foods and our co-branded credit card program. Gross margin percentage was negatively impacted by seven basis points due to a LIFO charge in 2025 for higher merchandise costs and one basis point in warehouse ancillary and other businesses. Changes in foreign currencies relative to the U.S. dollar negatively impacted gross margin by approximately $224, attributable to our Other International and Canadian operations.\nThe gross margin in core merchandise categories, when expressed as a percentage of core merchandise sales (rather than total net sales), increased 16 basis points. The increase was primarily due to fresh foods and foods and sundries, partially offset by non-foods. This measure eliminates the impact of changes in sales penetration and gross margin from our warehouse ancillary and other businesses.\nGross margin on a segment basis, when expressed as a percentage of the segment's own sales and excluding the impact of changes in gasoline prices on net sales (segment gross margin percentage), \nincreased in our U.S. segment, which performed similarly to the consolidated results above. Our Canadian and Other International segments gross margin increased, primarily due to increases in core merchandise categories and warehouse ancillary and other businesses.\nSelling, General and Administrative Expenses\n2025\n2024\n2023\nSG&A expenses\n$\n24,966\n$\n22,810\n$\n21,590\nSG&A expenses as a percentage of net sales\n9.25 \n%\n9.14 \n%\n9.08 \n%\nSG&A expenses as a percentage of net sales increased 11 basis points. SG&A expenses as a percentage of net sales excluding the impact of gasoline price deflation was 9.17%, an increase of three basis points. The comparison to last year was negatively impacted by three basis points due to warehouse operations and other businesses. Changes in foreign currencies relative to the U.S. dollar decreased SG&A expenses by approximately $127, attributable to our Canadian and Other International operations.\nInterest Expense\n2025\n2024\n2023\nInterest expense\n$\n154 \n$\n169 \n$\n160 \n27\nTable of Contents\nInterest expense is primarily related to Senior Notes and financing leases. The decrease was primarily due to repayment of the 2.750% Senior Notes in May 2024. For more information on our debt arrangements, refer to the consolidated financial statements included in Item 8 of this Report.\nInterest Income and Other, Net\n2025\n2024\n2023\nInterest income\n$\n469 \n$\n533 \n$\n470 \nForeign-currency transaction gains, net\n84 \n26 \n29 \nOther, net\n36 \n65 \n34 \nInterest income and other, net\n$\n589 \n$\n624 \n$\n533 \nThe decrease in interest income in 2025 was due to lower interest rates, partially offset by higher cash balances. Foreign-currency transaction gains, net, include revaluation or settlement of monetary assets and liabilities, and mark-to-market adjustments for forward foreign-exchange contracts. See Derivatives and Foreign-Currency sections in \nNote 1\n to the consolidated financial statements included in Item 8 of this Report.\nProvision for Income Taxes\n2025\n2024\n2023\nProvision for income taxes\n$\n2,719 \n$\n2,373 \n$\n2,195 \nEffective tax rate\n25.1 \n%\n24.4 \n%\n25.9 \n%\nThe effective tax rate for 2025 was favorably impacted by discrete tax benefits of $100 related to stock compensation.\nThe effective tax rate for 2024 was favorably impacted by discrete tax benefits of $94 related to the portion of the special cash dividend payable through our 401(k) plan, a net non-recurring tax benefit of $63 related to a transfer pricing settlement and certain true-ups of tax reserves, and $45 related to stock compensation.\nThe Organization of Economic Cooperation and Development (OECD) introduced a framework to implement a global minimum corporate tax of 15% (referred to as Pillar 2) which was effective for fiscal 2025. The impacts of Pillar 2 did not have a material impact on our consolidated financial statements.\nLIQUIDITY AND CAPITAL RESOURCES\nThe following table summarizes our significant sources and uses of cash and cash equivalents:\n2025\n2024\n2023\nNet cash provided by operating activities\n$\n13,335 \n$\n11,339 \n$\n11,068 \nNet cash used in investing activities\n(5,311)\n(4,409)\n(4,972)\nNet cash used in financing activities\n(3,775)\n(10,764)\n(2,614)\nOur primary sources of liquidity are cash flows from operations, cash and cash equivalents, and short-term investments. Cash and cash equivalents and short-term investments were $15,284 and $11,144 at August 31, 2025, and September 1, 2024. Of these balances, unsettled credit and debit card receivables represented approximately $2,670 and $2,519. These receivables generally settle within four days.\nMaterial contractual obligations arising in the normal course of business primarily consist of purchase obligations, long-term debt and related interest payments, leases, and construction and land purchase obligations. See \nNotes 4\n and \n5\n to the consolidated financial statements included in Item 8 of this Report for amounts outstanding on August 31, 2025, related to debt and leases.\n28\nTable of Contents\nPurchase obligations consist of contracts primarily related to merchandise, equipment, and third-party services, the majority of which are due in the next 12 months. Construction and land-purchase obligations consist of contracts primarily related to the development and opening of new and relocated warehouses, the majority of which (other than leases) are due in the next 12 months.\nWe believe that our cash and investment positions and operating cash flow, with capacity under existing and available credit agreements, will be sufficient to meet our liquidity and capital requirements for the foreseeable future and that our U.S. current and projected asset position is sufficient to meet our U.S. liquidity requirements.\nCash Flows from Operating Activities\nNet cash provided by operating activities totaled $13,335 in 2025, compared to $11,339 in 2024. Our cash flow provided by operations is primarily from net sales and membership fees. Cash flow used in operations generally consists of payments to merchandise suppliers, warehouse operating costs, including wages and employee benefits, utilities, credit and debit card processing fees, and operating leases. Cash used in operations also includes payments for income taxes. Changes in our net investment in merchandise inventories (the difference between merchandise inventories and accounts payable) is impacted by several factors, including inventory levels and turnover, payment terms with suppliers, and early payments to obtain discounts.\nCash Flows from Investing Activities\nNet cash used in investing activities totaled $5,311 in 2025, compared to $4,409 in 2024, and is primarily related to capital expenditures. \nNet cash from investing activities also includes purchases and maturities of short-term investments.\nCapital Expenditure Plans\nOur primary requirements for capital are acquiring land, buildings, and equipment for new and remodeled warehouses, information systems, and manufacturing and distribution facilities. \nIn 2025, we spent $5,498 on capital expenditures, and it is\n our current intention to spend $6,000 to $6,500 du\nring fiscal \n2026\n. \nThese expenditures are expected to be financed with cash from operations, cash and cash equivalents, and short-term investments.\n \nWe \nopened \n27\n new warehous\nes, including three relocations, in 2025, and plan to open up to 35 new warehouses, including five relocations, in 2026. There can be no assurance that current expectations will be realized, and plans are subject to change upon further review of our capital expenditure needs and the economic environment.\nCash Flows from Financing Activities\nNet cash used in financing activities totaled $3,775 in 2025, compared to $10,764 in 2024. Cash flow used in financing activities primarily related to the payment of dividends, repayments of long-term debt and short-term borrowings, repurchases of common stock, and withholding taxes on stock-based awards. Cash flow provided by financing activities included proceeds from short-term borrowings and issuance of long-term debt.\nLong-term Debt\nRepayments of long-term debt in 2025 totaled $103, as compared to $1,077 in 2024. Repayments in 2024 included the $1,000 outstanding principal balance on our 2.750% Senior Notes. There were no proceeds from long-term debt in 2025, as compared to $498 in 2024. Proceeds in 2024 included four Guaranteed Senior Notes issued by our Japan subsidiary.\nDividends\nCash dividends declared in 2025 totaled $2,183 or $4.92 per share, as compared to $8,589 or $19.36 per share in 2024. Dividends in 2024 included a special dividend of $15 per share, resulting in a payment of \n29\nTable of Contents\napproximately $6,655. In April 2025, the Board of Directors increased our quarterly cash dividend from $1.16 to $1.30 per share.\nShare Repurchase Program\nOn January 19, 2023, the Board of Directors authorized a share repurchase program in the amount of $4,000, which expires in January 2027. During 2025 and 2024, we repurchased 943,000 and 1,004,000 shares of common stock, at an average price per share of $957.66 and $695.29, totaling approximately $903 and $698. These amounts may differ from the accompanying consolidated statements of cash flows due to changes in unsettled repurchases at the end of each fiscal year. Purchases are made from time to time, as conditions warrant, in the open market or in block purchases, pursuant to plans under SEC Rule 10b5-1. Repurchased shares are retired, in accordance with the Washington Business Corporation Act. The remaining amount available to be purchased under our approved plan was $1,962 at the end of 2025.\nBank Credit Facilities and Commercial Paper Programs\nWe maintain bank credit facilities for working capital and general corporate purposes. At August 31, 2025, we had borrowing capacity under these facilities of $1,220. Our international operations maintain $721 of this capacity under bank credit facilities, of which $199 is guaranteed by the Company. Short-term borrowings outstanding under the bank credit facilities, which are included in other current liabilities on the consolidated balance sheets, were immaterial at the end of 2025 and 2024.\nWe have letter of credit facilities, for commercial and standby letters of credit, totaling $224. The outstanding commitments under these facilities at the end of 2025 totaled $200, most of which were standby letters of credit that do not expire or have expiration dates within one year. The bank credit facilities have various expiration dates, most within one year, and we generally intend to renew these facilities. The amount of borrowings available at any time under our bank credit facilities is reduced by the amount of standby and commercial letters of credit outstanding.\nOff-Balance Sheet Arrangements\nIn the opinion of management, we have no off-balance sheet arrangements that have had or are reasonably likely to have a material current or future effect on our financial condition or financial statements.\nCritical Accounting Estimates\nThe preparation of our consolidated financial statements in accordance with U.S. GAAP requires that we make estimates and assumptions that affect the reported amounts of assets and liabilities and the disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the reporting period. We base our estimates on historical experience and on assumptions that we believe to be reasonable, and we continue to review and evaluate these estimates. For further information on significant accounting policies, see discussion in \nNote 1\n to the consolidated financial statements included in Item 8 of this Report.\nInsurance/Self-insurance Liabilities\nClaims for employee health-care benefits, workers’ compensation, general liability, property damage, directors’ and officers’ liability, vehicle liability, inventory loss, and other exposures are funded predominantly through self-insurance. Insurance coverage is maintained for certain risks to limit exposures to very large losses. We use various risk management mechanisms, including a wholly-owned captive insurance subsidiary, and participate in a reinsurance program. Liabilities associated with the risks that we retain are not discounted and are estimated using historical claims experience, demographic factors, severity factors, and other actuarial assumptions. The costs of claims are highly unpredictable and can fluctuate as a result of inflation rates, regulatory or legal changes, and unforeseen developments \n30\nTable of Contents\nin claim frequency and amounts. While we believe our estimates are reasonable, actual claims and costs could differ significantly from recorded liabilities. Historically, adjustments to our estimates have been immaterial.\nRecent Accounting Pronouncements\nSee discussion of Recent Accounting Pronouncements in \nNote 1\n to the consolidated financial statements included in Item 8 of this Report.",
  "item2": null
}