{
  "source_file": "cpay-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2.\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\nThe following discussion and analysis of our financial condition and results of operations should be read in conjunction with the unaudited consolidated financial statements and related notes appearing elsewhere in this report. In addition to historical information, this discussion contains forward-looking statements that involve risks, uncertainties and assumptions that could cause actual results to differ materially from management’s expectations. Factors that could cause such differences include, but are not limited to, those identified below and those described in Item 1A \"Risk Factors\" appearing in our Annual Report on Form 10-K for the year ended December 31, 2024. All foreign currency amounts that have been converted into U.S. dollars in this discussion are based on the exchange rate as reported by Oanda for the applicable periods. \nThe following discussion and analysis of our financial condition and results of operations generally discusses the three and nine months ended September 30, 2025 and 2024, with period-over-period comparisons between these periods. A detailed discussion of 2024 items and period-over-period comparisons between the three and nine months ended September 30, 2024 and 2023 that are not included in this Quarterly Report on Form 10-Q can be found in \"Management's Discussion and Analysis of Financial Condition and Results of Operations\" in Part I, Item 2 of our Quarterly Report on Form 10-Q for the quarter ended September 30, 2024. \nExecutive Overview\nCorpay is a global corporate payments company that helps businesses and consumers better manage and pay their expenses. Corpay's suite of modern payment solutions help customers better manage vehicle-related expenses (e.g., fueling, tolls, car registration and parking), lodging expenses (e.g., hotel and extended stay bookings) and corporate payments (e.g., domestic and international accounts payable and point of sale purchases). This results in our customers saving time and ultimately spending less. \nBusinesses spend an estimated $145 trillion each year in transactions with other businesses. In many instances, businesses lack the proper tools to monitor what is being purchased and employ manual, paper-based, disparate processes and methods to both approve and make payments for their B2B purchases. This often results in wasted time and money due to unnecessary or unauthorized spending, fraud, receipt collection, data input and consolidation, report generation, reimbursement processing, account reconciliations, employee disciplinary actions and more. \nCorpay’s vision is that every payment is digital, every purchase is controlled and every related decision is informed. Digital payments are faster and more secure than paper-based methods such as checks and provide timely and detailed data that can be utilized to effectively reduce unauthorized purchases and fraud, automate data entry and reporting and eliminate reimbursement processes. Combining this payment data with analytical tools delivers insights, which managers can use to better run their businesses. Our wide range of modern, digitized solutions generally provides control, reporting and automation benefits superior to many of the payment methods businesses often use such as cash, paper checks, general purpose credit cards, as well as employee pay and reclaim processes. \nImpact of Economic Environment on Our Business\nSome of the countries where we operate, and other countries where we will seek to operate, have undergone significant political, economic and social change and events in recent periods. Adverse global macroeconomic conditions, including but not limited to recessions or economic downturns, inflation, changing interest rates, currency fluctuations, economic sanctions (including tariffs), regional or domestic hostilities and the prospect or occurrence of more widespread conflicts, a slowdown of global trade, or reduced consumer spending, could have a material adverse impact on our business, results of operations and financial condition. \nWe are actively monitoring the changes and events and assessing the impact on our business. The extent, severity, duration and outcome of market disruptions could be significant and could potentially have substantial impact on the global economy and our business for an unknown period of time. Measures such as sanctions and tariffs may adversely affect the global economy and financial markets and could adversely affect our business, financial condition and results of operations. We cannot predict the scope of macroeconomic factors because these measures are complex and evolving. Any such disruptions may also magnify the impact of other risks described in our Annual Report on Form 10-K.\n27\nResults\nRevenues, net, Net Income Attributable to Corpay and Net Income Per Diluted Share Attributable to Corpay.\n Set forth below are revenues, net, net income attributable to Corpay and net income per diluted share attributable to Corpay for the three and nine months ended September 30, 2025 and 2024, (in millions, except per share amounts).\n \nThree Months Ended September 30,\nNine Months Ended September 30,\n(Unaudited)\n2025\n2024\n2025\n2024\nRevenues, net\n$\n1,172.5 \n$\n1,029.2 \n$\n3,280.2 \n$\n2,940.2 \nNet income attributable to Corpay\n$\n277.9 \n$\n276.4 \n$\n805.3 \n$\n757.8 \nNet income per diluted share attributable to Corpay\n$\n3.91 \n$\n3.90 \n$\n11.28 \n$\n10.53 \nAdjusted Net Income Attributable to Corpay, Adjusted Net Income Per Diluted Share Attributable to Corpay, EBITDA, Adjusted EBITDA and Adjusted EBITDA margin.\n Set forth below are adjusted net income, adjusted net income per diluted share, EBITDA, adjusted EBITDA, and adjusted EBITDA margin for the three and nine months ended September 30, 2025 and 2024 (in millions, except per share amounts and percentages).\nThree Months Ended September 30,\nNine Months Ended September 30,\n(Unaudited)\n2025\n2024\n2025\n2024\nAdjusted net income attributable to Corpay\n$\n405.2 \n$\n354.5 \n$\n1,094.6 \n$\n980.9 \nAdjusted net income per diluted share attributable to Corpay\n$\n5.70 \n$\n5.00 \n$\n15.34 \n$\n13.63 \nEBITDA\n$\n627.5 \n$\n557.7 \n$\n1,717.5 \n$\n1,557.8 \nAdjusted EBITDA\n$\n676.7 \n$\n594.7 \n$\n1,852.7 \n$\n1,665.6 \nAdjusted EBITDA margin\n57.7 \n%\n57.8 \n%\n56.5 \n%\n56.6 \n%\nAdjusted net income attributable to Corpay, adjusted net income per diluted share attributable to Corpay, EBITDA, adjusted EBITDA and adjusted EBITDA margin are supplemental non-GAAP financial measures of operating performance. See the heading entitled \"Management’s Use of Non-GAAP Financial Measures\" for more information and a reconciliation of the non-GAAP financial measure to the most directly comparable financial measure calculated in accordance with U.S. generally accepted accounting principles, or GAAP. We use adjusted net income attributable to Corpay, adjusted net income per diluted share attributable to Corpay, EBITDA, adjusted EBITDA and adjusted EBITDA margin to eliminate the effect of items that we do not consider indicative of our core operating performance on a consistent basis. These non-GAAP measures are presented solely to permit investors to more fully understand how our management assesses underlying performance and are not, and should not be viewed as, a substitute for GAAP measures, and should be viewed in conjunction with our GAAP financial measures.\n28\nTable of Contents\nSources of Revenue\nCorpay offers a variety of payment solutions that simplify, automate, secure, digitize and effectively control the way businesses and consumers manage and pay their expenses. We provide our payment solutions to our business, merchant, consumer and payment network customers in more than 200 countries around the world today, although we operate primarily in three geograph\nies, with \n79%\n of our reven\nues generated in the U.S., Brazil and the U.K. Our customers may include commercial businesses (obtained through direct and indirect channels) and partners for whom we manage payment programs, as well as consumers.\nWe manage and report our operating results through three reportable segments: Vehicle Payments, Corporate Payments and Lodging Payments. The remaining results are included within Other, which includes our Gift and Payroll Card businesses. These segments align with how the Chief Operating Decision Maker allocates resources, assesses performance and reviews financial information. \nOur revenue is generally reported net of the cost for underlying products and services purchased.  In this report, we refer to this net revenue as “revenue\" or \"revenues, net.\" See “Results of Operations” for additional segment information.\nRevenues, net, by Segment. \n For the three and nine months ended September 30, 2025 and 2024, our segments generated the following revenues, net (in millions, except percentages).   \n \nThree Months Ended September 30,\nNine Months Ended September 30,\n(Unaudited)\n2025\n2024\n2025\n2024\nRevenues by Segment*\nRevenues, net\n% of Total\nRevenues, net\nRevenues, net\n% of Total\nRevenues, net\nRevenues, net\n% of Total\nRevenues, net\nRevenues, net\n% of Total\nRevenues, net\nVehicle Payments\n$\n553.2 \n47 \n%\n$\n506.8 \n49 \n%\n$\n1,565.8 \n48 \n%\n$\n1,511.1 \n51 \n%\nCorporate Payments\n409.7 \n35 \n%\n321.9 \n31 \n%\n1,154.3 \n35 \n%\n875.7 \n30 \n%\nLodging Payments\n127.0 \n11 \n%\n134.0 \n13 \n%\n357.0 \n11 \n%\n367.7 \n13 \n%\nOther\n82.6 \n7 \n%\n66.5 \n6 \n%\n203.1 \n6 \n%\n185.6 \n6 \n%\nConsolidated revenues, net\n$\n1,172.5 \n100 \n%\n$\n1,029.2 \n100 \n%\n$\n3,280.2 \n100 \n%\n$\n2,940.2 \n100 \n%\n*Columns may not calculate due to rounding. Other includes our Gift and Payroll Card businesses. \nWe generate revenue in our Vehicle Payments segment through a variety of program fees, including transaction fees, card fees, network fees and charges, as well as from interchange. These fees may be charged as fixed amounts, costs plus a mark-up, based on a percentage of the transaction purchase amounts, or a combination thereof. Our programs also include other fees and charges associated with late payments and based on customer credit risk. We also generate float revenue earned on invested customer funds in jurisdictions where permitted.\nIn our Corporate Payments segment, our payables business primarily earns revenue from the difference between the amount charged to the customer and the amount paid to the third party for a given transaction, as interchange or spread revenue. Our programs may also charge fixed fees for access to the network and ancillary services provided. Revenues from risk management products and foreign exchange payment services are primarily comprised of the difference between the exchange rate we set for the customer and the rate available in the wholesale foreign exchange market. In our cross-border business, our revenue is from exchanges of currency at spot rates, which enables customers to make cross-currency payments. Our cross-border business also derives revenue from our risk management business, which aggregates foreign currency exposures arising from customer contracts and economically hedges the resulting net currency risks by entering into offsetting contracts with established financial institution counterparties. Our performance obligation in our foreign exchange payment services is providing a foreign currency payment to a customer's designated recipient and therefore, we recognize revenue when the underlying payment is made. We also generate float revenue earned on invested customer funds in jurisdictions where permitted.\nIn our Lodging Payments segment, we primarily earn revenue from the difference between the amount charged to the customer and the amount paid to the hotel for a given transaction or based on commissions paid by hotels. We may also charge fees for access to the network and ancillary services provided.\nThe remaining revenues represent other solutions in our Gift and Payroll card businesses, referred to as Other. In these businesses, we primarily earn revenue from the processing of transactions. We may also charge fees for ancillary services provided.\n29\nRevenues, net, by Geography\n. \nRevenues, net by geography for the three and nine months ended September 30, 2025 and 2024, were as follows (in millions, except percentages):\n \nThree Months Ended September 30,\nNine Months Ended September 30,\n(Unaudited)\n2025\n2024\n2025\n2024\nRevenues by Geography*\nRevenues, net\n% of Total\nRevenues, net\nRevenues, net\n% of Total\nRevenues, net\nRevenues, net\n% of Total\nRevenues, net\nRevenues, net\n% of Total\nRevenues, net\nUnited States\n$\n575 \n49 \n%\n$\n542 \n53 \n%\n$\n1,624 \n50 \n%\n$\n1,531 \n52 \n%\nBrazil\n183 \n16 \n%\n145 \n14 \n%\n515 \n16 \n%\n444 \n15 \n%\nUnited Kingdom\n159 \n14 \n%\n142 \n14 \n%\n453 \n14 \n%\n405 \n14 \n%\nOther\n256 \n22 \n%\n199 \n19 \n%\n688 \n21 \n%\n561 \n19 \n%\nConsolidated revenues, net\n$\n1,172 \n100 \n%\n$\n1,029 \n100 \n%\n$\n3,280 \n100 \n%\n$\n2,940 \n100 \n%\n*Columns may not calculate due to rounding. Disclosure has been conformed in all periods to align with current presentation, which is based on the geographic location of the legal entity. \nRevenues, net by Key Performance Metric and Organic Growth\n. \nRevenues, net by key performance metric and organic growth by segment for the three months ended September 30, 2025 and 2024, were as follows (in millions, except revenues, net per key performance indicator, and percentages)*:\nAs Reported\nPro Forma and Macro Adjusted\n1\nThree Months Ended September 30,\nThree Months Ended September 30,\n(Unaudited)\n2025\n2024\nChange\n% Change\n2025\n2024\nChange\n% Change\nVEHICLE PAYMENTS\n'\n- Revenues, net\n$553.2\n$506.8\n$46.4\n9%\n$553.7\n$504.0\n$49.7\n10%\n'\n- Transactions\n223.5\n206.7\n16.8\n8%\n223.5\n207.2\n16.2\n8%\n'\n- Revenues, net per transaction\n$2.48\n$2.45\n$0.02\n1%\n$2.48\n$2.43\n$0.05\n2%\n'\n- Tag transactions\n2\n22.9\n21.6\n1.2\n6%\n22.9\n21.6\n1.2\n6%\n'\n- Parking transactions\n65.3\n61.7\n3.6\n6%\n65.3\n61.7\n3.6\n6%\n'\n- Fleet transactions\n120.5\n113.3\n7.2\n6%\n120.5\n113.9\n6.7\n6%\n'\n- Other transactions\n14.8\n10.0\n4.8\n48%\n14.8\n10.0\n4.8\n48%\nCORPORATE PAYMENTS\n3\n'\n- Revenues, net\n$409.7\n$321.9\n$87.9\n27%\n$407.3\n$349.6\n$57.7\n17%\n'\n- Spend volume\n$68,225\n$43,562\n$24,663\n57%\n$68,225\n$49,281\n$18,944\n38%\n'\n- Revenue, net per spend $\n0.60%\n0.74%\n(0.14)%\n(19)%\n0.60%\n0.71%\n(0.11)%\n(16)%\nLODGING PAYMENTS\n'\n- Revenues, net\n$127.0\n$134.0\n$(7.0)\n(5)%\n$126.7\n$134.0\n$(7.4)\n(5)%\n'\n- Room nights\n8.9\n10.1\n(1.2)\n(12)%\n8.9\n10.1\n(1.2)\n(12)%\n'\n- Revenues, net per room night\n$14.20\n$13.26\n$0.94\n7%\n$14.16\n$13.26\n$0.90\n7%\nOTHER\n4\n'\n- Revenues, net\n$82.6\n$66.5\n$16.0\n24%\n$82.0\n$66.5\n$15.5\n23%\n'\n- Transactions\n375.7\n353.3\n22.4\n6%\n375.7\n353.3\n22.4\n6%\n'\n- Revenues, net per transaction\n$0.22\n$0.19\n$0.03\n17%\n$0.22\n$0.19\n$0.03\n16%\nCORPAY CONSOLIDATED REVENUES, NET\n'\n- Revenues, net\n$1,172.5\n$1,029.2\n$143.3\n14%\n$1,169.7\n$1,054.2\n$115.5\n11%\n1\n See heading entitled \"Management's Use of Non-GAAP Financial Measures\" for a reconciliation of pro forma and macro adjusted revenue by product and metric non-GAAP measures to the comparable financial measure calculated in accordance with GAAP. The calculated change represents organic growth rate.\n2\n Represents total tag subscription transactions in the period. Average monthly tag subscriptions for 2025 is 7.6 million.\n3\n Corporate payments revenue per spend dollar decreased over the prior year due to new payables and cross-border enterprise clients.\n4\n Other includes Gift and Payroll Card operating segments. \n* Columns may not calculate due to rounding. \n30\nTable of Contents\nRevenue per relevant key performance indicator (KPI), which may include transactions, spend volume, room nights, or other metrics, is derived from the various revenue types as discussed above and can vary based on geography, the relevant merchant relationship, the payment product utilized and the types of products or services purchased, the mix of which would be influenced by our acquisitions, organic growth in our business and the overall macroeconomic environment, including fluctuations in foreign currency exchange rates, fuel prices and fuel price spreads. Relevant KPI is derived by broad product type and may differ from how we describe the business. Revenue per KPI per customer may change as the level of services we provide to a customer increases or decreases, as mix of customer size shifts, as macroeconomic factors change and as adjustments are made to merchant and customer rates. See “Results of Operations” for further discussion of transaction volumes and revenue per transaction.\nOrganic revenue growth is a supplemental non-GAAP financial measure of operating performance. Organic revenue growth is calculated as revenue growth in the current period adjusted for the impact of changes in the macroeconomic environment (to include fuel price, fuel price spreads and changes in foreign exchange rates) over revenue in the comparable prior period adjusted to include or remove the impact of acquisitions and/or divestitures and non-recurring items that have occurred subsequent to that period. See the heading entitled \"Management’s Use of Non-GAAP Financial Measures\" for more information and a reconciliation of the non-GAAP financial measure to the most directly comparable financial measure calculated in accordance with GAAP. We believe that organic revenue growth on a macro-neutral and consistent acquisition/divestiture/non-recurring item basis is useful to investors for understanding the performance of Corpay. \nSources of Expenses\nWe routinely incur expenses in the following categories:\n \n•\nProcessing\n—Our processing expense consists of expenses related to processing transactions, servicing our customers and merchants, credit losses and cost of goods sold related to our hardware and card sales in certain businesses.\n•\nSelling\n—Our selling expenses consist primarily of wages, benefits, sales commissions (other than merchant commissions) and related expenses for our sales, marketing and account management personnel and activities.\n•\nGeneral and administrative\n—Our general and administrative expenses include compensation and related expenses (including stock-based compensation and bonuses) for our employees, finance and accounting, information technology, human resources, legal and other administrative personnel. Also included are facilities expenses, third-party professional services fees, travel and entertainment expenses and other corporate-level expenses.\n•\nDepreciation and amortization\n—Our depreciation expenses include depreciation of property and equipment, consisting of computer hardware and software (including proprietary software development amortization expense), card-reading equipment, furniture, fixtures, vehicles and buildings and leasehold improvements related to office space. Our amortization expenses include amortization of intangible assets related to customer and vendor relationships, trade names and trademarks, software and non-compete agreements. We are amortizing intangible assets related to business acquisitions and certain private label contracts associated with the purchase of accounts receivable.\n•\nOther operating, net\n—Our other operating, net includes other operating expenses and income items that do not relate to our core operations or that occur infrequently. \n•\nOther (income) expense, net\n—Our other (income) expense, net includes gains or losses from the following: sales of assets or businesses, foreign currency transactions, extinguishment of debt and investments. This category also includes other miscellaneous non-operating costs and revenue. Certain of these items may be presented separately on the Consolidated Statements of Income. \n•\nInterest expense, net\n—Our interest expense, net includes interest expense on our outstanding debt, interest income on cash balances and interest on our interest rate and cross-currency swaps.\n•\nProvision for income taxes\n—Our provision for income taxes consists of corporate income taxes related primarily to profits resulting from the sale of our products and services on a global basis.\nFactors and Trends Impacting our Business\nWe believe that the following factors and trends are important in understanding our financial performance:\n \n•\nGlobal economic conditions\n—Our results of operations are materially affected by conditions in the economy generally, in North America, Brazil, the U.K. and in other locations internationally. Factors affected by the economy include our transaction volumes, the credit risk of our customers and changes in tax laws across the globe. These factors affected our businesses in each of our segments.\n•\nForeign currency changes\n—Our results of operations are significantly impacted by changes in foreign currency exchange rates; namely, by movements of the Australian dollar, Brazilian real, Brit\nish pound, Canadian dollar, Czech koruna, euro, Mexican peso, and New Zealand dollar, relative to the U.S. dollar. Approximately 50% and 52% of o\nur \n31\nrevenue in the nine months ended September 30, 2025 and 2024, respectively, was derived in U.S. dollars and was not affected by foreign currency exchange rates. See \"Results of Operations\" for information related to foreign currency impact on our total revenue, net. \nOur cross-border foreign risk management business aggregates foreign currency exposures arising from customer contracts and economically hedges the resulting net currency risks by entering into offsetting contracts with established financial institution counterparties. These contracts are subject to counterparty credit risk and liquidity risk from collateral calls.\nWe further manage the impact of economic changes in the value of certain foreign-denominated net assets by utilizing cross currency interest rate swaps. See \"Liquidity and capital resources\" below for information regarding our cross currency interest rate swaps. \n•\nFuel price volatility\n—Our Vehicle Payments customers use our products and services primarily in connection with the purchase of fuel. Accordingly, our revenue is affected by fuel prices, which are subject to significant volatility. A change in retail fuel prices could cause a decrease or increase in our revenue from several sources, including fees paid to us based on a percentage of each customer’s total purchase. Changes in the absolute price of fuel may also impact unpaid account balances and the late fees and charges based on these amounts. We estimate approximately 8% of revenues, net were directly impacted by ch\nanges in fuel price in both the nine months ended September 30, 2025 and 2024. See \"Results of Operations\" for information related to the fuel price impact on our total revenues, net.\n•\nFuel-price spread volatility\n—A\n p\nortion of our revenue involves transactions where we derive revenue from fuel price spreads, which is the difference between the price charged to a fleet customer for a transaction and the price paid to the merchant for the same transaction. In these transactions, the price paid to the merchant is based on the wholesale cost of fuel. The merchant’s wholesale cost of fuel is dependent on several factors including, among others, the factors described above affecting fuel prices. The fuel price that we charge to our customer is dependent on several factors including, among others, the fuel price paid to the merchant, posted retail fuel prices and competitive fuel prices. We experience fuel price spread contraction when the merchant’s wholesale cost of fuel increases at a faster rate than the fuel price we charge to our customers, or the fuel price we charge to our customers decreases at a faster rate than the merchant’s wholesale cost of fuel. The inverse of these situations produces fuel price spread expansion. We estimate approximately 4% an\nd 5% of revenues, net were directly impacted by fuel price spreads in the nine months ended September 30, 2025 and 2024, respectively. Se\ne \"R\nesults of Operations\" for information related to the fuel price spread impact on our total revenues, net.\n•\nAcquisitions\n—Since 2002, we have completed over 100 acquisitions of companies and commercial account portfolios. Acquisitions have been an important part of our growth strategy, and it is our intention to continue to seek opportunities to increase our customer base and diversify our service offering through further strategic acquisitions. The impact of acquisitions has, and may continue to have, a significant impact on our results of operations and may make it difficult to compare our results between periods.\n•\nInterest rates\n—From January 1, 2022 to July 27, 2023, the U.S. Federal Open Market Committee (\"FOMC\") increased the target federal funds rate eleven times for a total rate increase of 5.25%. Since this time, the FOMC has subsequently lowered the target federal funds rate by 1.50% through October 29, 2025. Additional rate changes are possible in future periods. We are exposed to market risk changes in interest rates on our debt, particularly in rising interest rate environments, which is partially offset by incremental interest income earned on cash and restricted cash. As of September 30, 2025, we have a number of receive-variable SOFR, pay-fixed interest rate swap derivative contracts with a cumulative notional U.S. dollar value of $4.5 billion. The objective of these contracts is to reduce the variability of cash flows in the previously unhedged interest payments associated with variable rate debt, the sole source of which is due to changes in SOFR benchmark interest rate.\nSee \"Liquidity and capital resources\" section below for additional information regarding our derivatives.\n•\nExpenses\n—Over the long term, we expect that our expenses will decrease as a percentage of revenues as our revenues increase, except for expenses related to transaction volume processed. To support our expected revenue growth, we plan to continue to incur additional sales and marketing expense by investing in our direct marketing, third-party agents, internet marketing, telemarketing and field sales force.\n•\nTaxes\n—We pay taxes in various taxing jurisdictions, including the U.S., most U.S. states and many non-U.S. jurisdictions. The tax rates in non-U.S. taxing jurisdictions are different than the U.S. tax rate. Consequently, as our earnings fluctuate between taxing jurisdictions, our effective tax rate fluctuates. Our effective tax rate is also subject to fluctuations driven by the impact of discrete tax items. \nThe Organization for Economic Co-operation and Development (“OECD”), continues to put forth various initiatives, including Pillar Two rules which introduce a global minimum tax at a rate of 15%. European Union member states agreed to implement the OECD’s Pillar Two rules with effective dates of January 1, 2024 and January 1, 2025, for different aspects of the directive and most have already enacted legislation. A number of other countries are also \n32\nTable of Contents\nimplementing similar legislation.  As countries continue to enact and refine the Pillar 2 rules, we will evaluate the impact on our financial position. \nOn July 4, 2025, the \"One Big Beautiful Bill Act\" (the \"Act\") was enacted in the U.S. The Act makes certain tax provisions from the 2017 Tax Cuts and Jobs Act permanent, introduces new tax provisions with varying effective dates, and rolls back certain incentives from the 2022 Inflation Reduction Act, among other provisions. We are in the process of evaluating the impact the Act could have on our financial position, results of operations and cash flows. All impacts from the Act will be reflected in future reporting periods. \nAcquisitions, Investments and Dispositions\n2025\n•\nIn February 2025, we acquired 100% of Gringo, a leading Brazil-based vehicle registration and compliance payment company, for approximately $153.7 million, net of cash of approximately $10.2 million. Immediately prior to the acquisition, the Company infused capital equal to the purchase price into Zapay, one of the Company's less than wholly owned subsidiaries, in order for Zapay to complete the acquisition of Gringo. As a result of the capital infusion by the Company, the Company's controlling interest in Zapay increased to approximately 86%. This transaction, which was accounted for separately from the business acquisition, was recorded as an equity transaction. Gringo's digital app and national network help drivers in Brazil pay vehicle taxes, registration and fines. Results from Gringo are reported in our Vehicle Payments segment.\n•\nIn April 2025, we expanded our long-standing strategic partnership agreement with Mastercard to deliver an enhanced suite of corporate cross-border payment solutions. The transaction also includes an investment in our cross-border business with Mastercard acquiring a 2.8% interest in the cross-border business for $300 million. For six months starting on July 1, 2027 (subject to extension if investment closing is delayed), Mastercard will have the right to sell its interest back to us. If Mastercard does not exercise that right, for four months starting on April 1, 2028 (subject to extension if investment closing is delayed), we will have a reciprocal repurchase right. In each case, the purchase price is the amount of invested capital plus 8% per annum, compounded annually. The investment into our cross-border business is expected to close during the second half of 2025. \n•\nIn May 2025, we along with TPG formed a limited partnership that, through its wholly owned subsidiaries, entered into a definitive agreement to acquire AvidXchange Holdings, Inc (NASDAQ: AVDX) (“AvidXchange”). AvidXchange is a provider of accounts payable (AP) automation solutions to lower middle market companies with a focus on several verticals including real estate, homeowners associations, financial institutions and media. The transaction was completed in October 2025.\nIn October 2025, we invested approximately $578 million for approximately 35% of the equity in the limited partnership, for an approximately $1.9 billion enterprise valuation. The partnership utilized approximately $450 million of debt financing to consummate the transaction. TPG holds approximately 56% of the equity, and the management team of AvidXchange holds the remainder. In addition to other terms, the limited partnership agreement provides that, 33 months after closing of the AvidXchange acquisition, we will have the right to acquire all of the remaining outstanding equity in the limited partnership for approximately 2.5 times invested capital. If, in fact, we achieve our business plan, then this could represent an attractive valuation. If we do not exercise such right to acquire all of the remaining outstanding equity and TPG decides to sell the limited partnership to a third party within a period of 15 months thereafter, we are required to guarantee a return to our partners, subject to certain limitations, of approximately 1.6 times invested capital. If the partnership sells AvidXchange in 2029 for approximately a similar valuation as today’s acquisition price, there will be no requirement to pay any minimum return.\n•\nIn July 2025, we announced, pursuant to Rule 2.7 of the United Kingdom City Code on Takeovers and Mergers, a firm intention to make a cash offer to acquire 100% of Alpha Group International plc (LSE: ALPHA) (\"Alpha\"). The acquisition is to be effected by means of a court-sanctioned scheme (the \"Scheme\") of arrangement under Part 26 of the UK Companies Act 2006. Alpha is a leading provider of B2B cross-border foreign exchange solutions to corporations and investment funds in the United Kingdom and Europe. Alpha pioneered alternative bank accounts as a simpler, faster way for investment managers to fund their investments and pay expenses anywhere in Europe. The \n33\ntransaction closed on October 31, 2025, and the results of Alpha will be reflected in our Corporate Payments segment beginning in the fourth quarter of 2025.\n•\nIn July 2025, we announced the divestiture of one of our legacy lower growth private label fuel card portfolios for approximately $60 million. Revenues generated from the portfolio are included in our Vehicle Payments segment. The transaction closed in October 2025. \n2024\n•\nIn March 2024, we acquired 70% of Zapay, a Brazil-based digital mobility solution for paying vehicle-related taxes and compliance fees, for approximately $59.5 million, net of cash. As part of the agreement, we have the right to acquire the remainder of Zapay in four years. The majority investment in Zapay further scales our Vehicle Payments business in Brazil. \n•\nIn July 2024, we acquired 100% of Paymerang, a U.S. based leader in accounts payables automation solutions, for approximately $179.2 million, net of cash and cash equivalents and restricted cash acquired of $309 million. The acquisition expands our presence in several market verticals, including education, healthcare, hospitality and manufacturing. Results from Paymerang are reported in our Corporate Payments segment.\n•\nIn December 2024, the Company acquired 100% of GPS Capital Markets, LLC (\"GPS\") for approximately $577.1 million, net of cash and cash equivalents acquired of $190.7 million. GPS provides business-to-business cross-border and treasury management solutions to upper middle market companies, primarily in the U.S. Results from GPS are reported in our Corporate Payments segment.\n•\nIn December 2024, we disposed of our merchant solutions business for $185.5 million, net of cash disposed. Results from our merchant services solution business were previously included in our Vehicle Payments segment. \n•\nDuring the year ended December 31, 2024, the Company also completed asset acquisitions for approximately $\n6.7 million\n. \n34\nTable of Contents\nResults of Operations\nThree months ended September 30, 2025 compared to the three months ended September 30, 2024 \nThe following table sets forth selected unaudited consolidated statements of income for the three months ended September 30, 2025 and 2024 (in millions, except percentages)*.\n(Unaudited)\nThree Months Ended September 30, 2025\n% of Total\nRevenues, net\nThree Months Ended September 30, 2024\n% of Total\nRevenues, net\nIncrease\n(decrease)\n% Change\nRevenues, net:\nVehicle Payments\n$\n553.2 \n47.2 \n%\n$\n506.8 \n49.0 \n%\n$\n46.4 \n9.2 \n%\nCorporate Payments\n409.7 \n34.9 \n%\n321.9 \n31.0 \n%\n87.9 \n27.3 \n%\nLodging Payments\n127.0 \n10.8 \n%\n134.0 \n13.0 \n%\n(7.0)\n(5.2)\n%\nOther\n82.6 \n7.0 \n%\n66.5 \n6.0 \n%\n16.0 \n24.1 \n%\nTotal revenues, net\n1,172.5 \n100.0 \n%\n1,029.2 \n99.0 \n%\n143.3 \n13.9 \n%\nConsolidated operating expenses:\nProcessing\n248.8 \n21.2 \n%\n223.7 \n21.7 \n%\n25.1 \n11.2 \n%\nSelling\n117.6 \n10.0 \n%\n94.2 \n9.1 \n%\n23.5 \n24.9 \n%\nGeneral and administrative\n178.6 \n15.2 \n%\n153.7 \n14.9 \n%\n25.0 \n16.2 \n%\nDepreciation and amortization\n93.2 \n7.9 \n%\n89.5 \n8.7 \n%\n3.6 \n4.0 \n%\nOther operating, net\n11.2 \n— \n%\n— \n— \n%\n11.2 \n— \n%\nOperating income\n523.1 \n44.6 \n%\n468.1 \n45.5 \n%\n55.0 \n11.7 \n%\nOther expense, net\n1.4 \n0.1 \n%\n0.4 \n— \n%\n1.0 \nNM\nInterest expense, net\n100.0 \n8.5 \n%\n104.4 \n10.1 \n%\n(4.4)\n(4.2)\n%\nLoss on extinguishment of debt\n— \n— \n%\n5.0 \n0.5 \n%\n(5.0)\nNM\nProvision for income taxes\n143.3 \n12.2 \n%\n82.0 \n8.0 \n%\n61.3 \n74.7 \n%\nNet income\n278.4 \n23.7 \n%\n276.3 \n26.8 \n%\n2.1 \n0.8 \n%\nLess: Net income (loss) attributable to noncontrolling interest\n0.4 \n— \n%\n(0.1)\n— \n%\n0.6 \nNM\nNet income attributable to Corpay\n$\n277.9 \n23.7 \n%\n$\n276.4 \n26.9 \n%\n$\n1.5 \n0.6 \n%\nOperating income by segment:\nVehicle Payments\n$\n265.7 \n$\n244.3 \n$\n21.4 \n8.8 \n%\nCorporate Payments\n177.5 \n136.9 \n40.6 \n29.7 \n%\nLodging Payments\n57.1 \n65.5 \n(8.4)\n(12.8)\n%\nOther\n22.8 \n21.4 \n1.4 \n6.5 \n%\nTotal operating income\n$\n523.1 \n$\n468.1 \n$\n55.0 \n11.7 \n%\nNM = Not Meaningful\n*The sum of the columns and rows may not calculate due to rounding. \nConsolidated Results\nConsolidated revenues, net\nConsolidated revenues were $1,172.5 million in the three months ended September 30, 2025, an increase of 13.9% compared to the prior period. The increase in consolidated revenues was due primarily to organic growth of 11%, driven by increases in spend and transaction volumes, implementation and ramping of new sales and business initiatives. Consolidated revenues also grew 3% from acquisitions completed in 2024 and 2025. This growth was partially offset by approximately $9 million from the disposition of our merchant solutions business in December 2024. \nAlthough we cannot precisely measure the impact of the \nmacroeconomic environment, in total we believe it had a positive impact of approximately $3 million on our consolidated revenues for the three months ended September 30, 2025 over the comparable period in 2024. This positive impact was driven primarily by favorable foreign exchange rates of approximately \n35\n$13 million, driven by our Brazil, UK and Euro-denominated businesses, partially offset by the unfavorable impact of fuel price spreads of approximately $7 million and unfavorable fuel prices of approximately $3 million.   \nConsolidated operating expenses\nProcessing.\n Processing expenses were $248.8 million in the three months ended September 30, 2025, an increase of 11.2% compared to the prior period. Increases in processing expenses were primarily due to approximately $9 million of expenses related to acquisitions completed in 2024 and 2025, higher variable expenses driven by\n increased transaction volumes and investments to drive future growth and the negative impact of foreign exchange rates of approximately $3 million. T\nhe increases were partially offset by the impact of the disposition of our merchant solutions business of approximately $4 million a\nnd lower bad debt expense of approximately $1 million \nSelling.\n Selling expenses were $117.6 million in the three months ended September 30, 2025, an increase of 24.9% from the prior period. Increases in selling expenses were primarily due to marketing investments to drive future growth, increased commissions from higher sales volume, approximately $6 million of expenses related to acquisitions completed in 2024 and 2025 and the impact of foreign exchange rates of approximately $1 million.\nGeneral and administrative.\n General and administrative expenses were $178.6 million in the three months ended September 30, 2025, an increase o\nf 16.2% from the prior period. The increase in general and administrative expenses was primarily due to acquisition-related deal fees, information technology investments, a\npproximately $4 million of expenses related to acquisitions completed in 2024 and 2025 and the impact of foreign exchange rates of approximately $2 million. \nDepreciation and amortization.\n Depreciation and amortization expenses were $93.2 million in the three months ended September 30, 2025, an increase of 4.0%\n from the prior period. Depreciation and amortization expenses increased due to incremental investments in capital expenditures, \n$4 million of expenses related to acquisitions completed in \n2024\n and \n2025 and the impact of foreign exchange rates of approximately $1 million. \nOther operating, net\n. Other operating, net was \n$11.2 million in the three months ended September 30, 2025 and primarily relates to a loss recognized during the third quarter of 2025, as a result of a working capital adjustment for the December 2024 disposal of our merchant solutions business. \nConsolidated operating income\nConsolidated operating income was $523.1 million\n in the three months ended September 30, 2025, an increase of 11.7% compared to the prior period due to the reasons discussed above. \nOther expense, net. \nOther expense, net was $1.4 million in the three months ended \nSeptember 30, 2025, which primarily represents the impact of fluctuations in foreign exchange rates on non-functional currency balances.\nInterest expense, net.\n Interest expense, net was $100.0 million in the three months ended September 30, 2025, a decrease of $4.4 million from the prior period. The decrease in net interest expense was primarily due to lower interest rates and higher interest income from higher cash balances. The following table sets forth the average interest rates paid on borrowings under our Credit Facility, excluding the related unused facility fees and swaps.\n \nThree Months Ended September 30,\n(Unaudited)\n2025\n2024\nTerm Loan A\n5.81 \n%\n6.78 \n%\nTerm Loan B\n6.08 \n%\n7.13 \n%\nRevolving line of credit A & B (USD)\n5.77 \n%\n6.77 \n%\nRevolving line of credit B (GBP)\n5.57 \n%\n6.61 \n%\nWe have a portfolio of interest rate swaps, which are designated as cash flow hedges and cross-currency interest rate swaps, which are designated as net investment hedges. Du\nring the three months ended September 30, 2025, as a result of these swap contracts and net investment hedges, we recorded a benefit to interest expense of $10.6 million.\nProvision for income taxes.\n The provision for income taxes and effective tax rate were $143.3 million and 34.0%, respectively, for the three months ended September 30, 2025, compared to $82.0 million and 22.9%, respectively, for the prior period. Income tax expense is based on an estimated annual effective rate, which requires us to make our best estimate of annual pretax accounting income or loss before consideration of tax or benefit discretely recognized in the period in which such occur. Our effective income tax rate for the three months ended September 30, 2025 differs from the U.S. federal statutory rate due primarily to the unfavorable impact of state taxes net of federal benefits, additional taxes on undistributed foreign-sourced income and foreign withholding taxes on interest income from intercompany notes. \nThe increase in the provision for income taxes and effective tax rate for the three months ended September 30, 2025 was driven primarily by (i) discrete taxes resulting from legal entity and tax restructuring actions taken by the Company to facilitate cross-border transactions, (ii) a decrease in excess tax benefits on stock option exercises, (iii) the adoption of Pillar Two legislation, \n36\nTable of Contents\nwhich resulted in a global minimum tax at a rate of 15% that impacted two jurisdictions in which we operate and (iv) the geographic mix of earnings. \nNet income attributable to Corpay.\n \nFor the reasons discussed above, our net income attributable to Corpay increased to $277.9 million during the three months ended September 30, 2025.\nSegment Results\nVehicle Payments \nVehicle Payments revenues were $553.2 million in the three months ended September 30, 2025, an increase of 9.2% from the prior period. Vehicle Payments revenues increased primarily due to organic revenue growth of 10%, new sales growth in our international markets, the favorable changes in foreign exchange rates on revenue of $9 million and the impact of acquisitions, which contributed approximately $6 million. These increases were partially offset by the disposition of our merchant solutions business in December 2024, which lowered revenue by approximately $9 million, the unfavorable impact of fuel price spreads of approximately $7 million and unfavorable fuel prices of approximately $3 million. \nVehicle Payments operating income was $265.7 million, an increase of 8.8% from the prior period. Vehicle Payments operating income increased in the three months ended September 30, 2025 primarily due to revenue growth discussed above, partially offset by the overall net unfavorable impact of the macroeconomic environment and the impact of the disposition of our merchant solutions business, which resulted in lower operating income of approximately $5 million. Vehicle Payments operating income and margin was also negatively impacted by \nan $11 million working capital adjustment for the December 2024 disposal of our merchant solutions business.\nCorporate Payments \nCorporate Payments revenues were $409.7 million in the three months ended September 30, 2025, an increase of 27.3% from the prior period. Corporate Payments revenues increased primarily due to organic revenue growth of 17%, driven by 38% growth in spend volume, strong new sales in our payables and cross-border solutions, the impact of our acquisitions, which contributed approximately $28 million in revenues and the impact of favorable changes in foreign exchange rates. Corporate payments revenue per spend dollar decreased over the prior year due to the impact of new payables and cross-border enterprise clients.\nCorporate Payments operating income was $177.5 million in the three months ended September 30, 2025, an increase of 29.7% from the prior period. Corporate Payments operating income increased primarily due to organic revenue growth, integration synergies and the impact of our acquisitions, partially offset by sales investments to grow the business and one-time integration expenses.\nLodging Payments\nLodging Payments revenues were $127.0 million in the three months ended September 30, 2025, a decrease of 5.2% from the prior period. The decrease in Lodging Payments revenues was primarily due to lower emergency-related activity and room night volume decreases in the workforce solution. \nLodging Payments operating income was $57.1 million in the three months ended September 30, 2025, a decrease of 12.8% from the prior period. Lodging Payments operating income and margin declined due to the reasons discussed above.\nOther\nOther revenues were $82.6 million in the three months ended September 30, 2025, an increase of 24.1% from the prior period, driven by the timing of gift card sales and increases in gift card transaction volume in our Gift business.\nOther operating income was $22.8 million in the three months ended September 30, 2025, an increase of 6.5% from the prior period, primarily due to the reasons discussed above. \n37\nNine months ended September 30, 2025 compared to the nine months ended September 30, 2024 \nThe following table sets forth selected unaudited consolidated statements of income for the nine months ended September 30, 2025 and 2024 (in millions, except percentages)*.\n(Unaudited)\nNine months ended September 30, 2025\n% of Total\nRevenues, net\nNine months ended September 30, 2024\n% of Total\nRevenues, net\nIncrease\n(decrease)\n% Change\nRevenues, net:\nVehicle Payments\n$\n1,565.8 \n47.7 \n%\n$\n1,511.1 \n51.0 \n%\n$\n54.7 \n3.6 \n%\nCorporate Payments\n1,154.3 \n35.2 \n%\n875.7 \n30.0 \n%\n278.6 \n31.8 \n%\nLodging Payments\n357.0 \n10.9 \n%\n367.7 \n13.0 \n%\n(10.7)\n(2.9)\n%\nOther\n203.1 \n6.2 \n%\n185.6 \n6.0 \n%\n17.5 \n9.4 \n%\nTotal revenues, net\n3,280.2 \n100.0 \n%\n2,940.2 \n100.0 \n%\n340.1 \n11.6 \n%\nConsolidated operating expenses:\nProcessing\n709.1 \n21.6 \n%\n640.3 \n21.8 \n%\n68.8 \n10.7 \n%\nSelling\n341.0 \n10.4 \n%\n283.4 \n9.6 \n%\n57.6 \n20.3 \n%\nGeneral and administrative\n512.6 \n15.6 \n%\n458.7 \n15.6 \n%\n53.9 \n11.7 \n%\nDepreciation and amortization\n276.7 \n8.4 \n%\n258.6 \n8.8 \n%\n18.1 \n7.0 \n%\nOther operating, net\n11.2 \n0.3 \n%\n0.3 \n— \n%\n10.9 \nNM\nOperating income\n1,429.6 \n43.6 \n%\n1,298.8 \n44.2 \n%\n130.8 \n10.1 \n%\nOther (income) expense, net\n(5.1)\n(0.2)\n%\n7.8 \n0.3 \n%\n(12.9)\nNM\nInterest expense, net\n290.8 \n8.9 \n%\n288.2 \n9.8 \n%\n2.6 \n0.9 \n%\nLoss on extinguishment of debt\n1.6 \n— \n%\n5.0 \n0.2 \n%\n(3.4)\nNM\nProvision for income taxes\n336.0 \n10.2 \n%\n240.0 \n8.2 \n%\n95.9 \n40.0 \n%\nNet income\n806.3 \n24.6 \n%\n757.7 \n25.8 \n%\n48.6 \n6.4 \n%\nLess: Net income attributable to noncontrolling interest\n1.0 \nNM\n(0.1)\n— \n%\n1.1 \nNM\nNet income attributable to Corpay\n$\n805.3 \n24.6 \n%\n$\n757.8 \n25.8 \n%\n$\n47.6 \n6.3 \n%\nOperating income by segment:\nVehicle Payments\n$\n746.1 \n$\n712.0 \n$\n34.1 \n4.8 \n%\nCorporate Payments\n474.6 \n362.1 \n112.4 \n31.0 \n%\nLodging Payments\n150.0 \n169.2 \n(19.2)\n(11.4)\n%\nOther\n59.0 \n55.5 \n3.5 \n6.4 \n%\nTotal operating income\n$\n1,429.6 \n$\n1,298.8 \n$\n130.8 \n10.1 \n%\nNM = Not Meaningful\n*The sum of the columns and rows may not calculate due to rounding. \nConsolidated Results\nConsolidated revenues, net\nConsolidated revenues were $3,280.2 million\n in the nine months ended September 30, 2025, an increase of 11.6% compared to the prior period. \nThe increase in consolidated revenues was due primarily to organic growth of \n10%\n, driven by increases in spend and transaction volumes, implementation and ramping of new sales and business initiatives. Consolidated revenues also grew \n4% fr\nom acquisitions completed in \n2024\n and \n2025.\n This growth was partially offset by the negative impact of the macroeconomic environment and approximately $28 million from the disposition of our merchant solutions business in December 2024.  \nAlthough we cannot precisely measure the\n impact of the macroeconomic environment, in total we believe it had a negative i\nmpact \nof a\npproximately $68 million on our consolidated revenues for the nine months ended September 30, 2025 over the comparable period in 2024, driven primarily by unfavorable foreign exchange rates of approximately $36 million, mostly in our Brazil business, the unfavorable impact of fuel price spreads of approximately $20 million and the unfavorable impact of fuel prices of approximately $11 million.\n38\nTable of Contents\nConsolidated operating expenses\nProcessing.\n Processing expenses were $709.1 million in the nine months ended September 30, 2025, an increase of 10.7% compared to the prior period. Increases\n in processing expenses were primarily due to approximately $39 million of expenses related to acquisitions completed in 2024 and 2025, higher variable expenses driven by increased transaction volumes and investments to drive future growth and higher bad debt of $9 million due to increased transaction volumes. T\nhe increases were partially offse\nt by the impact of foreign exchange rates of approximately $10 million and\n the impact of the disposition of our merchant solutions business of approximately \n$14 million\n.\nSelling.\n Selling expenses were $341.0 million in the nine months ended September 30, 2025, an increase of 20.3% from the prior \nperiod. Increases in selling expenses were primarily due to sales and marketing investments to drive future growth, increased commissions from higher sales volume and approximately $23 million of expenses related to acquisitions completed in 2024 and 2025. The increases were partially offset by the impact of foreign exchange rates of approximately $3 million.\nGeneral and administrative.\n General and administrative expenses were $512.6 million in the nine months ended September 30, 2025, an increase of 11.7% from the prior period. The increase in general and administrative expenses was primarily due to acquisition-related deal fees, information technology investments and approximately\n \n$18 million of expenses related to acquisitions completed in 2024 and 2025. The increases were partially offset by lower stock-based compensation expense and the impact of foreign exchange rates of approximately $2 million. \nDepreciation and amortization.\n Depreciation and amortization expenses were $276.7 million in the nine months ended September 30, 2025, an increase of 7.0% from the prior period.\n Depreciation and amortization expenses increased due to incremental investments in capital expenditures and approximately $20 million of expenses related to acquisitions completed in 2024 and 2025. These increases were offset by the impact of foreign exchange rates of approximately $2 million.\nOther operating, net\n. Other operating, net was \n$11.2 million in the nine months ended September 30, 2025 and primarily  relates to a loss recognized during the third quarter of 2025, as a result of a working capital adjustment for the December 2024 disposal of our merchant solutions business. \nConsolidated operating income\n \nOperating income was $1,429.6 million in the nine months ended September 30, 2025, an increase of 10.1% compared to the prior period. The increase in operating income was primarily due to the reasons discussed above. \nOther (income) expense, net. \nOther income, net was $5.1 million in the nine months ended September 30, 2025 primarily due \nto a gain upon the disposition of a cost method investment in the second quarter of 2025, partially offset by the impact of fluctuations in foreign exchange rates on non-functional currency balances.\nInterest expense, net.\n Interest expense, net was $290.8 million in the nine months ended September 30, 2025, an increase of $2.6 million from the prior period. The increase in interest expense was primarily due to increased borrowings used for acquisitions, partially offset by lower interest rates and higher interest income due to higher cash balances. The following table sets forth the average interest rates paid on borrowings under our Credit Facility, excluding the related unused facility fees and swaps.\n \nNine Months Ended September 30,\n(Unaudited)\n2025\n2024\nTerm Loan A\n5.80 \n%\n6.80 \n%\nTerm Loan B\n6.08 \n%\n7.16 \n%\nRevolving line of credit A & B (USD)\n5.80 \n%\n6.78 \n%\nRevolving line of credit B (GBP)\n5.57 \n%\n6.60 \n%\nWe have a portfolio of interest rate swaps, which are designated as cash flow hedges and cross-currency interest rate swaps, which are designated as net investment hedges. During the \nnine\n months ended September 30, 2025, as a result of these swap contracts and net investment hedges, we recorded a benefit to interest expense, net of $30.3 million.\nProvision for income taxes.\n The provision for income taxes and effective tax rate were $336.0 million and 29.4% for \nthe nine months ended September 30, 2025, compared to $240.0 million and 24.1% for the prior period. Income tax expense is based on an estimated annual effective rate, which requires us to make our best estimate of annual pretax accounting income or loss before consideration of tax or benefit discretely recognized in the period in which such occur. \nThe increase in the provision for income taxes and effective tax rate for the nine months ending September 30, 2025 over the comparable period in 2024 was primarily driven by (i) discrete taxes resulting from legal entity and tax restructuring actions taken by the Company to facilitate cross-border transactions, (ii) decreases in state taxes realized in the comparable period in 2024 due to adjustments of state tax apportionment percentages, (iii) new state apportionment rules in 2025 resulting in the revaluation of deferreds at a higher tax rate, (iv) the adoption of Pillar Two legislation in 2025, which resulted in a global minimum tax at a rate of 15% that impacted two jurisdictions in which we operate and (v) the geographic mix of earnings. \n39\nNet income attributable to Corpay.\n For the\n reasons discussed above, our net income attributable to Corpay increased to $805.3 million in the nine months e\nnded \nSeptember 30, 2025\n, \nan increase of\n \n6.3%\n from the prior period.\nSegment Results\nVehicle Payments\nVehicle Payments reven\nues were \n$1,565.8 million in the \nnine\n months ended \nSeptember 30, 2025, an increase of 3.6%, from the prior period.\n Vehicle Payments revenues increased primarily due to organic revenue growth \nof 9% driven by 7% growth in transaction volumes, new sales growth and the impact of acquisitions, which contributed approximately $19 million in revenue. These increases were partially offset by unfavorable exchange rates on revenue of $37 million, the disposition of our merchant solutions business in December 2024, which lowered revenue by approximately $28 million, the unfavorable impact of fuel price spreads of approximately $20 million and unfavorable fuel prices of approximately $11 million. \nVehicle Payments operating income was $746.1 million in the nine months ended September 30, 2025, an increase of 4.8% from the prior period primarily due to organic revenue growth and the impact of our acquisitions discussed above, partially offset by the unfavorable macroeconomic environment and the impact of the disposition of our merchant solutions business, which resulted in lower operating income of approximately $16 million. \nCorporate Payments \nCorporate Payments revenues were $1,154.3 million in the nine months ended September 30, 2025, an increase of 31.8%, from the prior period. Corporate Payments revenues increased primarily due to organic revenue growth of 18%, driven by a 26% growth in spend volume, strong new sales in our payables and cross-border solutions and the impact of our acquisitions, which contributed approximately $106 million in revenue. Corporate payments revenue per spend dollar decreased over the prior year due to the impact of new payables and cross-border enterprise clients.\nCorporate Payments operating income was $474.6 million in the nine months ended September 30, 2025, an increase of 31.0% from the prior period. Corporate Payments operating income increased primarily due to reasons discussed above and integration synergies, partially offset by sales investments to grow the business and one-time integration expenses.\nLodging Payments\nLodging Payments revenues were $357.0 million in the nine months ended September 30, 2025, a decrease of 2.9% from the prior period. The decrease in Lodging Payments revenues was primarily due to a decline in revenue per room night in our airlines business from prior year, partially offset by room night volume increases in the workforce solution. \nLodging Payments operating income was $150.0 million in the nine months ended September 30, 2025, a decrease of 11.4% from the prior period. Lodging Payments operating income and margin declined from the prior period due to the reasons discussed above.\nOther  \nOther revenues were $203.1 million in the nine months ended September 30, 2025, an increase of 9.4% from the prior period, driven by the timing of gift card sales and increases in gift card transaction volume, partially offset by declines in our payroll card business.\nOther operating income was $59.0 million in the nine months ended September 30, 2025, an increase of 6.4% from the prior period due to the reasons discussed above. \nLiquidity and capital resources\nOur principal liquidity requirements are to service and repay our indebtedness, make acquisitions of businesses and commercial account portfolios, repurchase shares of our common stock and meet working capital, tax and capital expenditure needs.\nSources of liquidity. \nWe believe that our current level of cash and borrowing capacity under our Credit Facility, Securitization Facility (as defined below) and other facilities (each discussed below), together with expected future cash flows from operations, will be sufficient to meet the needs of our existing operations and planned requirements for at least the next 12 months and into the foreseeable future, based on our current assumptions. \nAt September 30, 2025, we had approximately $3.4 billion in total liquidity, consisting of approximately $1.4 billion available under our Credit Facility and unrestricted cash of $2.0 billion, a portion of which includes customer deposits or is required for working capital and regulatory purposes. Restricted cash primarily \nrepresents customer deposits repayable on demand held in certain geographies with legal restrictions, customer funds held for the benefit of others, collateral received from customers for cross-currency transactions in our cross-border business, which is restricted from use other than to repay customer deposits and to secure and settle cross-currency transactions, and collateral posted with banks for hedging positions in our cross-border business. \nWe also utilize the Securitization Facility to finance a portion of our domestic receivables, to lower our cost of borrowing and more efficiently use capital. Accounts receivable collateralized within our Securitization Facility relate to trade receivables \n40\nTable of Contents\nresulting primarily from charge card activity in Vehicle Payments and Corporate Payments and receivables related to our Lodging Payments business in the U.S. and the U.K. We also consider the available and undrawn amounts under our Securitization Facility and Credit Facility as funds available for working capital purposes and acquisitions. At September 30, 2025, we had no additional liquidity under our Securitization Facility. \nWe have determined that outside basis differences associated with our investments in foreign subsidiaries would not result in a material deferred tax liability, and, consistent with our assertion that these amounts continue to be indefinitely invested, have not recorded incremental income taxes for the additional outside basis differences.\nCash flows\nThe following table summarizes our cash flows for the nine month periods ended September 30, 2025 and 2024 (in millions).\n \nNine Months Ended September 30,\n(Unaudited)\n2025\n2024\nNet cash provided by operating activities\n$\n687.2 \n$\n1,291.9 \nNet cash used in investing activities\n$\n(282.9)\n$\n(378.2)\nNet cash (used in) provided by financing activities\n$\n(102.3)\n$\n176.2 \nOperating activities.\n Net cash provided by operating activities was $687.2 million in the nine months ended September 30, 2025, compared to $1,291.9 million in the comparable prior period. This decrease in operating cash flows was primarily driven by changes in working capital. \nInvesting activities.\n Net cash used in investing activities was $282.9 million in the nine months ended September 30, 2025 compared to $378.2 million in the comparable prior perio\nd. The decrease in cash used for investing activities was primarily due to less spending on acquisitions completed in 2025 over the comparable period in 2024 and proceeds from the sale of a cost method investment during the second quarter of 2025. This decrease was partially offset by an increase in capital expenditures of $17.2 million due to the impact of acquisitions and continued investments in technology. \nFinancing activities.\n Net cash used in fina\nncing activities was $102.3 million in the nine months ended September 30, 2025 compared to net cash provided by financing activities of $176.2 million in the comparable prior period. This change in financing cash flows was primarily due to a decrease in net borrowings on our Credit Facility and Securitization Facility of $893.8 million partially offset by fewer repurchases of common stock in 2025 of $756.7 million over the comparable period in 2024.\nCredit Facility\nCorpay Technologies Operating Company, LLC, and certain of our domestic and foreign owned subsidiaries, as designated co-borrowers (the \"Borrowers\"), are parties to a $8.25 billion Credit Agreement (the \"Credit Agreement\"), with Bank of America, N.A., as administrative agent, swing line lender and letter of credit issuer and a syndicate of financial institutions (the \"Lenders\"), which has been amended multiple times. The Credit Agreement provides for senior secured credit facilities (collectively, the \"Credit Facility\") consisting of a revolving credit facility in the amount of $1.8 billion, a Term Loan A facility in the amount of $3.3 billion and a Term Loan B facility in the amount of $3.2 billion. The revolving credit facility consists of (a) a revolving A credit facility in the amount of $1.3 billion, with sublimits for letters of credit and swing line loans and (b) a revolving B facility in the amount of $500 million with borrowings in U.S. dollars, euros, British pounds, Japanese yen or other currency as agreed in advance and sublimits for swing line loans. Proceeds from the credit facilities may be used for working capital purposes, acquisitions and other general corporate purposes. The maturity date for the Term Loan A and revolving credit facilities A and B is June 24, 2027. The Term Loan B has a maturity date of April 30, 2028. \nOn February 20, 2025, we entered into the sixteenth amendment to the Credit Agreement. The amendment increased the Term Loan B commitments by $750 million. We primarily used the Term Loan B proceeds to pay down existing borrowings under the revolving credit facility. The maturity dates and the interest rates for the revolving credit facility, Term Loan A and Term Loan B commitments were unchanged by this amendment. \nAt September 30, 2025, the interest rate on the Ter\nm Loan A was 5.64%, the interest rate on the Term Loan B was 5.91%, and the interest rate on the Revolving A and B facilities (USD borrowings) was 5.64%. The unused credit facility fee was 0.25% at September 30, 2025.\nAt September 30, 2025, we\n had $3.0 billion in borrowings outstanding on the Term Loan A, net of discounts and debt issuance costs, $3.1 billion in borrowings outstanding on the Term Loan B, net of discounts and debt issuance costs and $0.4 billion outstanding on the revolving credit facilities. We have unamortized debt issuance costs of $2.7 million related to the revolving credit facilities as of September 30, 2025 recorded within other assets in the Unaudited Consolidated Balance Sheets. We have unamortized debt discounts and debt issuance costs of $19.7 million related to our Term Loans at September 30, 2025 recorded in notes payable and other obligations, net of current portion within the Unaudited Consolidated Balance Sheets. \n41\nDuring the nine months ended September 30, 2025, we \nmade borrowings of $750.0 million on the Term Loans, principal payments of $147.9 million on the Term Loans and net payments of $905.3 million on the revolving credit facilities.\nAs of September 30, 2025, we were in compliance with each of the financial and non-financial covenants under the Credit Agreement.\nOn November 5, 2025, we entered into the seventeenth amendment to the Credit Agreement. The amendment, among other things, (i) increases the aggregate commitments under the revolving credit facility by $1 billion to new total Revolver B commitments of $1.5 billion, and (ii) adds a new seven-year Term Loan B of $900 million. We used the Term Loan B and revolving credit facility proceeds to fund the Alpha acquisition. \nThe new Term Loan B has a maturity date of November 5, 2032. Interest on amounts outstanding under the new Term Loan B accrues based on the Secured Overnight Financing Rate plus a margin of 1.75%. The maturity dates and the interest rates for our revolving credit facility, Term Loan A commitments and existing Term Loan B commitments were unchanged by this amendment. \nSecuritization Facility\nWe are party to a $1.8 billion receivables purchase agreement among Fleetor Funding, LLC, as seller, PNC Bank, National Association as administrator, and various purchaser agents, conduit purchasers and related committed purchasers parties thereto. The Securitization Facility matures on the earlier of January 24, 2028 or the first maturity date of any loan under the Credit Agreement, which is June 24, 2027. At September 30, 2025, the interest rate on the Securitization Facility was 5.11%.\nOn November 3, 2025, we entered into the Sixth Amended and Restated Receivables Purchase Agreement to our Securitization Facility. The amendment, among other things, (i) increased the Securitization Facility commitment from $1.8 billion to $2.3 billion, (ii) extended the maturity of the Securitization Facility to November 3, 2028, (iii) added three UK-based originators and (iv) lowered the program pricing by 9 basis points. \nThe Securitization Facility provides for certain termination events, which includes nonpayment, upon the occurrence of which the administrator may declare the facility termination date to have occurred, may exercise certain enforcement rights with respect to the receivables and may appoint a successor servicer, among other things.\nWe were in compliance with all financial and non-financial covenant requirements related to our Securitization Facility as of September 30, 2025.\nOther Facilities\nWe carefully monitor and manage initial and variation margin requirements for our cross-border solutions, which can result in transitory periods of elevated liquidity needs in cases where the currency market experiences disruption. In order to help mitigate that liquidity risk, we have entered into facilities intended to provide additional means to manage working capital needs for our cross-border solutions. \nWe have four uncommitted overdraft facilities with a combined capacity of \n$205.0 million\n, which may be accessible via written request and corresponding authorization from the applicable lenders. There is no guarantee the uncommitted capacity will be available to us on a future date. Interest on drawn balances accrues under the agreements at either (a) at a fixed rate equal to the lender's reference rate or the Federal Funds Effective Rate (as defined in the respective agreements) plus either 1% or 1.25% or (b) SOFR plus 1.25%. As of September 30, 2025, we had no borrowings outstanding under the uncommitted credit facilities. \nWe also have a 364-day committed revolving credit facility with a total commitment of \n$70.0 million\n and maturity date of February 20, 2026. Borrowings under this facility will bear interest at the borrower’s option at a rate equal to (a) Term SOFR (as defined in the agreement) plus 1.25% or (b) the Base Rate (determined by reference to the greatest of (i) the Federal Funds Effective Rate, at that time, plus 0.50%, (ii) the Prime Rate, at that time, and (iii) Term SOFR (as defined in the agreement) at such time plus 1.00%). As of September 30, 2025, we had no borrowings outstanding under the committed credit facility. \n42\nTable of Contents\nCash Flow Hedges\nAs of September 30, 2025, we had the following outstanding interest rate swap derivatives that qualify as hedging instruments within designated cash flow hedges of variable interest rate risk (in millions):\nNotional Amount \nWeighted Average Fixed Rate\nMaturity Date\n$500\n3.80%\n1/31/2026\n$1,500\n4.15%\n7/31/2026\n$750\n4.14%\n1/31/2027\n$500\n4.19%\n7/31/2027\n$250\n4.00%\n1/31/2028\n$500\n3.19%\n7/31/2028\n$250\n3.47%\n1/31/2029\n$250\n3.47%\n7/31/2029\nThe purpose of these contracts is to reduce the variability of cash flows in interest payments associated with $4.5 billion of unspecified variable rate debt, the sole source of which is due to changes in the SOFR benchmark interest rate. For each of these swap contracts, we pay a fixed monthly rate and receive one month SOFR.\nOur cash flow hedges resulted in a $12.2 million reduction in interest expense, net during the nine months ended September 30, 2025.\nNet Investment Hedges\nWe enter into cross-currency interest rate swaps that are designated as net investment hedges of our investments in foreign-denominated operations. Such contracts effectively convert the U.S. dollar equivalent notional amounts to obligations denominated in the respective foreign currency and partially offset the impact of changes in currency rates on such foreign-denominated net investments. These contracts also create a positive interest differential on the U.S. dollar-denominated portion of the swaps, resulting in interest rate savings on the USD notional. Upon maturity of a net investment hedge, if not rolled over or restructured, the final exchange may require a cash settlement based on the differential in prevailing exchange rates versus the initial rate in the hedge. This could result in a significant cash payment depending on market conditions at the time of settlement.\nAt September 30, 2025, we had the following cross-currency interest rate swaps designated as net investment hedges of our investments in foreign-denominated operations:\nU.S. dollar equivalent notional (in millions)\nFixed Rates\nMaturity Date\nEuro (EUR)\n$500\n2.150%\n5/26/2026\nCanadian Dollar (CAD)\n$800\n1.350%\n1/24/2028\nBritish Pound (GBP)\n$750\n0.317%\n5/8/2028\nHedge effectiveness is tested based on changes in the fair value of the cross-currency swaps due to changes in the USD/foreign currency spot rates. We anticipate perfect effectiveness of the designated hedging relationships and records changes in the fair value of the cross-currency interest rate swaps associated with changes in the spot rate through accumulated other comprehensive loss. Excluded components associated with the forward differential are recognized directly in earnings as interest expense, net. We recognized a benefit of $18.0 million in interest expense, net for the nine months ended September 30, 2025 related to these excluded components. \nStock Repurchase Program \nOn February 4, 2016, we announced that our Board approved a stock repurchase program (as updated from time to time, the \"Program\") authorizing us to repurchase up to $9.1 billion of our common stock from time to time until February 4, 2026\n.\n Since the beginning of the Program through September 30, 2025, 33,951,728 shares have been repurchased for an aggregate purchase \n43\nprice of $8.1 billion, leaving us up to $1.0 billion of remaining authorization available under the Program for future repurchases of shares of our common stock. \nUnder the Program, any stock repurchases may be made at times and in such amounts as deemed appropriate by management. The timing and amount of stock repurchases, if any, will depend on a variety of factors including the stock price, market conditions, corporate and regulatory requirements and any additional constraints related to material inside information we may possess. Any repurchases have been and are expected to be funded by a combination of available cash flow from the business, working capital and debt. \nAcquisition\nIn July 2025, we announced, pursuant to Rule 2.7 of the United Kingdom City Code on Takeovers and Mergers, a firm intention to make a cash offer to acquire 100% of Alpha Group International plc (LSE: ALPHA) (\"Alpha\"). The acquisition is to be effected by means of a court-sanctioned scheme of arrangement under Part 26 of the UK Companies Act 2006. Alpha is a leading provider of B2B cross-border foreign exchange solutions to corporations and investment funds in the United Kingdom and Europe. Alpha pioneered alternative bank accounts as a simpler, faster way for investment managers to fund their investments and pay expenses anywhere in Europe. \nOn July 23, 2025, we entered into a bridge term loan credit agreement with BOFA Securities, Inc., Barclays Bank PLC and JPMorgan Chase Bank, N.A., along with other syndicates, pursuant to which, among other things, those lenders have committed to provide debt financing, consisting of a £1.875 billion bridge facility (the “Bridge Facility”), to fund the cash consideration payable pursuant to the acquisition and to fund costs and expenses in connection with the acquisition should we decide to utilize the bridge term loan for such purposes. \nOn October 31, 2025, we completed the acquisition of all of the ordinary shares of Alpha for £42.50 in cash for each Alpha share upon the terms as described in the Rule 2.7 Announcement, resulting in an aggregate purchase price of approximately £1.8 billion in cash. The aggregate cash consideration paid in the transaction was funded with borrowings under our Credit Facility, as described further above. We did not utilize the bridge term loan for the financing of the acquisition. The bridge term loan facility expired on November 7, 2025. \nThe results of Alpha will be reflected in our Corporate Payments segment and financial statements during the fourth quarter of 2025. \nAsset Divestiture\nIn July 2025, we announced the divestiture of one of our legacy lower growth private label fuel card portfolios for approximately $60 million. Revenues generated from the portfolio are included in our Vehicle Payments segment. The transaction closed during October 2025.\nStrategic Partnership\nIn April 2025, we expanded our long-standing strategic partnership agreement with Mastercard to deliver an enhanced suite of corporate cross-border payment solutions. The transaction also includes an investment in our cross-border business with Mastercard acquiring a 2.8% interest in the cross-border business for $300 million. For six months starting on July 1, 2027 (subject to extension if investment closing is delayed), Mastercard will have the right to sell its interest back to us. If Mastercard does not exercise that right, for four months starting on April 1, 2028 (subject to extension if investment closing is delayed), we will have a reciprocal repurchase right. In each case, the purchase price is the amount of invested capital plus 8% per annum, compounded annually. The investment into our cross-border business is expected to close during the fourth quarter of 2025. \n44\nTable of Contents\nMinority Investment\nIn May 2025, we along with TPG formed a limited partnership that, through its wholly owned subsidiaries, entered into a definitive agreement to acquire AvidXchange Holdings, Inc (NASDAQ: AVDX) (“AvidXchange”). AvidXchange is a provider of accounts payable (AP) automation solutions to lower middle market companies with a focus on several verticals including real estate, homeowners associations, financial institutions and media. The take-private transaction was completed in October 2025.\nIn conjunction with the closing of the AvidXchange transaction in October 2025, we invested approximately $578 million for approximately 35% of the equity in the limited partnership for an approximately $1.9 billion enterprise valuation. The partnership utilized approximately $450 million of debt financing to consummate the transaction. TPG holds approximately 56% of the equity, and the management team of AvidXchange holds the remainder. In addition to other terms, the limited partnership agreement provides that, 33 months after closing of the AvidXchange acquisition, we will have the right to acquire all of the remaining outstanding equity in the limited partnership for approximately 2.5 times invested capital. If, in fact, we achieve our business plan, then this could represent an attractive valuation. If we do not exercise such right to acquire all of the remaining outstanding equity and TPG decides to sell the limited partnership to a third party within a period of 15 months thereafter, we are required to guarantee a return to our partners, subject to certain limitations, of approximately 1.6 times invested capital. If the partnership sells AvidXchange in 2029 for approximately similar valuation as today’s acquisition price, there will be no requirement to pay any minimum return. \nCritical accounting estimates\nIn applying the accounting policies that we use to prepare our consolidated financial statements, we necessarily make accounting estimates that affect our reported amounts of assets, liabilities, revenues and expenses. Some of these estimates require us to make assumptions about matters that are highly uncertain at the time we make the accounting estimates. We base these assumptions and the resulting estimates on historical information and other factors that we believe to be reasonable under the circumstances, and we evaluate these assumptions and estimates on an ongoing basis. In many instances, however, we reasonably could have used different accounting estimates and, in other instances, changes in our accounting estimates could occur from period to period, with the result in each case being a material change in the financial statement presentation of our financial condition or results of operations. We refer to estimates of this type as critical accounting estimates. \nAccounting estimates necessarily require subjective determinations about future events and conditions. During the three months ended September 30, 2025, we have not adopted any new critical accounting policies that had a significant impact upon our consolidated financial statements, have not changed any critical accounting policies and have not changed the application of any critical accounting policies from the -year ended December 31, 2024. For critical accounting policies, refer to the Critical Accounting Estimates in Item 7 – Management’s Discussion and Analysis of Financial Condition and Results of Operations included in our Annual Report on Form 10-K for the year ended December 31, 2024 and our summary of significant accounting policies in Note 1 of our Notes to the Unaudited Consolidated Financial Statements in this Quarterly Report on Form 10-Q.\nManagement’s Use of Non-GAAP Financial Measures\nWe have included in the discussion above certain financial measures that were not prepared in accordance with GAAP. Any analysis of non-GAAP financial measures should be used only in conjunction with results presented in accordance with GAAP. Below, we define the non-GAAP financial measures, provide a reconciliation of each non-GAAP financial measure to the most directly comparable financial measure calculated in accordance with GAAP and discuss the reasons that we believe this information is useful to management and may be useful to investors. Because our non-GAAP financial measures are not standardized measures, they may not be directly comparable with the non-GAAP financial measures of other companies using the same or similar non-GAAP financial measures. Although management uses these non-GAAP measures to set goals and measure performance, they have no standardized meaning prescribed by GAAP. These non-GAAP measures are presented solely to permit investors to more fully understand how our management assesses underlying performance. These non-GAAP measures are not, and should not be viewed as, a substitute for GAAP measures and should be viewed in conjunction with our GAAP financial statements and financial measures. As a result, such non-GAAP measures have limits in their usefulness to investors.\nOrganic Revenues, net by KPI. \nOrganic revenue growth is calculated as revenue in the current period adjusted for the impact of changes in the macroeconomic environment (to include fuel price, fuel price spreads and changes in foreign exchange rates) over revenue in the comparable prior period adjusted to include or remove the impact of acquisitions and/or divestitures and non-recurring items that have occurred subsequent to that period.\n \nWe define the pro forma and macro adjusted revenue as revenue, net as reflected in our statement of income, adjusted to eliminate the impact of the macroeconomic environment and the impact of acquisitions and dispositions. The macroeconomic environment impact includes the impact that market fuel price spreads, fuel prices and foreign exchange rates have on our business. We use pro forma and macro adjusted revenue and transactions to evaluate the organic growth in our revenue and the associated transactions. We believe that organic revenue growth is useful to investors for understanding the performance of Corpay.\n45\nSet forth below is a reconciliation of pro forma and macro adjusted revenue and key performance metric by segment, used to calculate organic revenue growth, to the most directly comparable GAAP measure, revenue, net and key performance metric (in millions):*\n \nRevenues, net\nKey Performance Metric\nThree Months Ended September 30, 2025\nThree Months Ended September 30, 2025\n(Unaudited)\n2025\n2024\n2025\n2024\nVEHICLE PAYMENTS - TRANSACTIONS\nPro forma and macro adjusted\n$\n553.7 \n$\n504.0 \n223.5 \n207.2 \nImpact of acquisitions/dispositions\n— \n2.8 \n— \n(0.6)\nImpact of fuel prices/spread\n(9.9)\n— \n— \n— \nImpact of foreign exchange rates\n9.4 \n— \n— \n— \nAs reported\n$\n553.2 \n$\n506.8 \n223.5 \n206.7 \nCORPORATE PAYMENTS - SPEND\nPro forma and macro adjusted\n$\n407.3 \n$\n349.6 \n$\n68,225 \n$\n49,281 \nImpact of acquisitions/dispositions\n— \n(27.8)\n— \n(5,719)\nImpact of fuel prices/spread\n— \n— \n— \n— \nImpact of foreign exchange rates\n2.4 \n— \n— \n— \nAs reported\n$\n409.7 \n$\n321.9 \n$\n68,225 \n$\n43,562 \nLODGING PAYMENTS - ROOM NIGHTS\nPro forma and macro adjusted\n$\n126.7 \n$\n134.0 \n8.9 \n10.1 \nImpact of acquisitions/dispositions\n— \n— \n— \n— \nImpact of fuel prices/spread\n— \n— \n— \n— \nImpact of foreign exchange rates\n0.3 \n— \n— \n— \nAs reported\n$\n127.0 \n$\n134.0 \n8.9 \n10.1 \nOTHER\n1\n- TRANSACTIONS\nPro forma and macro adjusted\n$\n82.0 \n$\n66.5 \n375.7 \n353.3 \nImpact of acquisitions/dispositions\n— \n— \n— \n— \nImpact of fuel prices/spread\n— \n— \n— \n— \nImpact of foreign exchange rates\n0.6 \n— \n— \n— \nAs reported\n$\n82.6 \n$\n66.5 \n375.7 \n353.3 \nCORPAY CONSOLIDATED REVENUES, NET\nPro forma and macro adjusted\n$\n1,169.7 \n$\n1,054.2 \nIntentionally Left Blank\nImpact of acquisitions/dispositions\n— \n(25.0)\nImpact of fuel prices/spread\n2\n(9.9)\n— \nImpact of foreign exchange rates\n2\n12.7 \n— \nAs reported\n$\n1,172.5 \n$\n1,029.2 \n* Columns may not calculate due to rounding.\n1 \nOther includes Gift and Payroll Card operating segments. \n2\n \nRevenues reflect the positive impact of movements in foreign exchange rates of approximately $13 million, partially offset by the negative impact of fuel price spreads of approximately $7 million and approximately $3 million negative impact from fuel prices.\nAdjusted net income attributable to Corpay and adjusted net income per diluted share attributable to Corpay. \nWe have defined the non-GAAP measure adjusted net income attributable to Corpay as net income attributable to Corpay as reflected in our statement of income, adjusted to eliminate (a) non-cash stock-based compensation expense related to stock-based compensation awards, (b) amortization of deferred financing costs, discounts, intangible assets, amortization of the premium recognized on the purchase of receivables and amortization attributable to Corpay's noncontrolling interest, (c) integration and deal related costs, and (d) other non-recurring items, including unusual credit losses, certain discrete tax items, the impact of business dispositions, impairment losses, asset write-offs, restructuring costs, loss on extinguishment of debt, taxes associated with stock-based compensation programs, losses and gains on foreign currency transactions and legal settlements and related legal fees. We adjust net income for the tax effect of adjustments using our effective income tax rate, exclusive of certain discrete tax items. We calculate adjusted net income attributable to Corpay and adjusted net income per diluted share attributable to Corpay to eliminate the effect of items that we do not consider indicative of our core operating performance. We have defined the non-GAAP measure adjusted net income per diluted share attributable to Corpay as the calculation previously noted divided by the weighted average diluted shares outstanding as reflected in our statement of income. \nAdjusted net income attributable to Corpay and adjusted net income per diluted share attributable to Corpay are supplemental measures of operating performance that do not represent and should not be considered as an alternative to net income, net \n46\nTable of Contents\nincome per diluted share or cash flow from operations, as determined by GAAP. We believe it is useful to exclude non-cash stock-based compensation expense from adjusted net income because non-cash equity grants made at a certain price and point in time do not necessarily reflect how our business is performing at any particular time and stock-based compensation expense is not a key measure of our core operating performance. We also believe that amortization expense can vary substantially from company to company and from period to period depending upon their financing and accounting methods, the fair value and average expected life of their acquired intangible assets, their capital structures and the method by which their assets were acquired; therefore, we have excluded amortization expense from our adjusted net income. Integration and deal related costs represent business acquisition transaction costs, professional services fees, short-term retention bonuses and system migration costs, etc., that are not indicative of the performance of the underlying business. We also believe that certain expenses, certain discrete tax items, gains on business disposition, recoveries (e.g. legal settlements, write-off of customer receivable, etc.), gains and losses on investments, taxes related to stock-based compensation programs and impairment losses do not necessarily reflect how our investments and business are performing. We adjust net income for the tax effect of each of these adjustments using the effective tax rate during the period, exclusive of certain discrete tax items.   \nManagement uses adjusted net income attributable to Corpay, adjusted net income per diluted share attributable to Corpay, organic revenue growth, EBITDA and adjusted EBITDA: \n•\nas measurements of operating performance because they assist us in comparing our operating performance on a consistent basis; \n•\nfor planning purposes, including the preparation of our internal annual operating budget; \n•\nto allocate resources to enhance the financial performance of our business; and \n•\nto evaluate the performance and effectiveness of our operational strategies. \nSet forth below is a reconciliation of adjusted net income attributable to Corpay and adjusted net income per diluted share attributable to Corpay to the most directly comparable GAAP measure, net income attributable to Corpay and net income per diluted share attributable to Corpay (in thousands, except shares and per share amounts)*:\n \nThree Months Ended September 30,\nNine Months Ended September 30,\n(Unaudited)\n2025\n2024\n2025\n2024\nNet income attributable to Corpay\n$\n277,941 \n$\n276,397 \n$\n805,342 \n$\n757,791 \nNet income per diluted share attributable to Corpay\n$\n3.91 \n$\n3.90 \n$\n11.28 \n$\n10.53 \nStock-based compensation\n27,592 \n28,506 \n74,826 \n80,593 \nAmortization\n1\n70,759 \n60,883 \n200,962 \n175,622 \nLoss on extinguishment of debt\n— \n5,040 \n1,596 \n5,040 \nIntegration and deal related costs\n15,699 \n5,071 \n41,540 \n16,434 \nRestructuring and related costs\n2\n3,427 \n2,190 \n9,557 \n8,444 \nLoss on disposition of business\n11,171 \n— \n11,171 \n— \nOther\n2\n2,171 \n(399)\n2,638 \n7,646 \nTotal pre-tax adjustments\n130,819 \n101,291 \n342,290 \n293,779 \nIncome taxes\n3\n(34,739)\n(23,179)\n(90,195)\n(70,682)\nDiscrete tax items\n4\n31,201 \n— \n37,132 \n— \nAdjusted net income attributable to Corpay\n$\n405,222 \n$\n354,509 \n$\n1,094,569 \n$\n980,888 \nAdjusted net income per diluted share attributable to Corpay\n$\n5.70 \n$\n5.00 \n$\n15.34 \n$\n13.63 \nDiluted shares\n71,131 \n70,901 \n71,373 \n71,976 \n1 \nIncludes amortization related to intangible assets, premium on receivables, deferred financing costs and debt discounts. \n2 \nIncludes losses and gains on foreign currency transactions, certain legal expenses, amortization expense attributable to the Company's noncontrolling interest, taxes associated with stock-based compensation programs and a loss on an economic hedge of a foreign-denominated purchase price of an acquisition and a gain on sale of a cost method investment.\n3 \nRepresents provision for income taxes of pre-tax adjustments.\n4\n Represents discrete tax provision recognized in the third quarter of 2025 as a result of legal entity and tax restructuring actions taken by the Company to facilitate cross-border transactions and discrete non-cash tax provision recognized in the second quarter of 2025 related to the remeasurement of deferred tax assets and liabilities as a result of a tax law change in California. \n*Columns may not calculate due to rounding.\n47\nEBITDA, Adjusted EBITDA and Adjusted EBITDA margin. \nEBITDA is defined as earnings before interest, income taxes, interest expense, net, other (income) expense, net, depreciation and amortization, loss on extinguishment of debt, goodwill impairment, investment loss/gain and other operating, net. Adjusted EBITDA is defined as EBITDA further adjusted for stock-based compensation expense and other one-time items including certain legal expenses, restructuring costs and integration and deal related costs. Adjusted EBITDA margin is defined as adjusted EBITDA as a percentage of revenue.\nThe following table reconciles EBITDA, adjusted EBITDA and adjusted EBITDA margin to net income (in millions)*:\nThree Months Ended September 30,\nNine Months Ended September 30,\n(Unaudited)\n2025\n2024\n2025\n2024\nNet income from operations\n$\n278.4 \n$\n276.3 \n$\n806.3 \n$\n757.7 \nProvision for income taxes\n143.3 \n82.0 \n336.0 \n240.0 \nInterest expense, net\n100.0 \n104.4 \n290.8 \n288.2 \nOther expense (income), net\n1.4 \n0.4 \n(5.1)\n7.8 \nDepreciation and amortization\n93.2 \n89.5 \n276.7 \n258.6 \nLoss on extinguishment of debt\n— \n5.0 \n1.6 \n5.0 \nOther operating, net\n11.2 \n— \n11.2 \n0.3 \nEBITDA\n$\n627.5 \n$\n557.7 \n$\n1,717.5 \n$\n1,557.8 \nStock-based compensation\n$\n27.6 \n$\n28.5 \n$\n74.8 \n$80.6\nOther addbacks\n1\n21.6 \n8.5 \n60.4 \n27.2\nAdjusted EBITDA\n$\n676.7 \n$\n594.7 \n$\n1,852.7 \n$\n1,665.6 \nRevenues, net\n$\n1,172.5 \n$\n1,029.2 \n$\n3,280.2 \n$\n2,940.2 \nAdjusted EBITDA margin\n57.7 \n%\n57.8 \n%\n56.5 \n%\n56.6 \n%\n1\n Includes certain legal expenses, restructuring costs and integration and deal related costs\n* Columns may not calculate due to rounding.\n48\nTable of Contents\nSpecial Cautionary Notice Regarding Forward-Looking Statements\nThis Quarterly Report on Form 10-Q contains forward-looking statements within the meaning of the federal securities laws. Statements that are not historical facts, including statements about Corpay’s beliefs, expectations and future performance, are forward-looking statements. Forward-looking statements can be identified by the use of words such as \"anticipate,\" \"intend,\" \"believe,\" \"estimate,\" \"plan,\" \"seek,\" \"project\" or \"expect,\" \"may,\" \"will,\" \"would,\" \"could\" or \"should,\" the negative of these terms or other comparable terminology.\nThese forward-looking statements are not a guarantee of performance, and you should not place undue reliance on such statements. We have based these forward-looking statements largely on our current expectations and projections about future events. Forward-looking statements are subject to many uncertainties and other variable circumstances, including those discussed in \"Risk Factors\" in our Annual Report on Form 10-K for the year ended December 31, 2024 filed with the Securities and Exchange Commission on February 27, 2025, many of which are outside of our control, that could cause our actual results and experience to differ materially from any forward-looking statement.\nForward-looking statements may not be realized due to a variety of factors, including, without limitation:\n•\nrisks related to our ability to successfully execute our strategic plan, manage our growth and achieve our performance targets;\n•\nthe impact of macroeconomic conditions, including any recession or economic downturn that has occurred or may occur in the future, and whether expected trends, including retail fuel prices, fuel price spreads, fuel transaction patterns, electric vehicles, retail lodging prices, foreign exchange rates and interest rates develop as anticipated and our ability to develop successful strategies in light of these trends; \n•\nour ability to attract new and retain existing partners, fuel merchants, and lodging providers, their promotion and support of our products, and their financial performance; \n•\nour ability to successfully manage the derivative financial instruments that we use in our cross-border solution to reduce our exposure to various market risks, including changes in foreign exchange rates;\n•\nthe failure of management assumptions and estimates, as well as differences in, and changes to, economic, market, interest rate, interchange fees, foreign exchange rates, and credit conditions, including changes in borrowers’ credit risks and payment behaviors;\n•\nthe risk of higher borrowing costs and adverse financial market conditions impacting our funding and liquidity, and any reduction in our credit ratings; \n•\nour ability to successfully manage our credit risks and the sufficiency of our allowance for expected credit losses;\n•\nour ability to securitize our trade receivables;\n•\nthe occurrence of fraudulent activity, data breaches or failures of our information security controls or cybersecurity-related incidents that may compromise our systems or customers’ information; \n•\nany disruptions in the operations of our computer systems and data centers; \n•\nthe international operational and political risks and compliance and regulatory risks and costs associated with international operations;\n•\nthe impact of international conflicts, including between Russia and Ukraine, as well as within the Middle East, on the global economy or our business and operations;\n•\nthe impact of changes in global tariff and trade policies and potential retaliatory actions by affected countries;\n•\nour ability to develop and implement new technology, products, and services;\n•\nany alleged infringement of intellectual property rights of others and our ability to protect our intellectual property; \n•\nthe regulation, supervision, and examination of our business by foreign and domestic governmental authorities, as well as litigation and regulatory actions, including the lawsuit filed by the Federal Trade Commission (FTC);\n•\nthe impact of regulations and related requirements relating to privacy, information security and data protection; derivative  and hedging activities; use of third-party vendors and ongoing third-party business relationships; and failure to comply with anti-money laundering (AML) and anti-terrorism financing laws;\n•\nchanges in our senior management team and our ability to attract, motivate and retain qualified personnel consistent with our strategic plan;\n•\ntax legislation initiatives or challenges to our tax positions and/or interpretations, and state sales tax rules and regulations; \n49\n•\nthe risks of mergers, acquisitions and divestitures, such as our recent acquisition of a partnership interest in AvidXchange and our acquisition of Alpha, including, without limitation, the related time and costs of implementing such transactions, integrating operations as part of these transactions and possible failures to achieve expected gains, revenue growth and/or expense savings from such transactions; \n•\nour ability to remediate material weaknesses and the ongoing effectiveness of internal control over financial reporting; and\n•\nthe other factors and information in our Annual Report on Form 10-K and other filings that we make with the Securities and Exchange Commission (SEC) under the Exchange Act and Securities Act. See \"Risk Factors\" in our Annual Report on Form 10-K for the year ended December 31, 2024 filed with the Securities and Exchange Commission on February 27, 2025.\nGiven these risks and uncertainties, you are cautioned not to place undue reliance on these forward-looking statements. The forward-looking statements included in this report are made only as of the date hereof. We do not undertake, and specifically disclaim, any obligation to update any such statements or to publicly announce the results of any revisions to any of such statements to reflect future events or developments.\nYou may get Corpay’s SEC filings for free by visiting the SEC web site at www.sec.gov. \nThis report includes non-GAAP financial measures, which are used by Corpay and investors as supplemental measures to evaluate the overall operating performance of companies in our industry. By providing these non-GAAP financial measures, together with reconciliations, we believe we are enhancing investors' understanding of our business and our results of operations, as well as assisting investors in evaluating how well we are executing strategic initiatives. See \"Management’s Use of Non-GAAP Financial Measures\" elsewhere in this Quarterly Report on Form 10-Q for additional information regarding these GAAP financial measures and a reconciliation to the nearest corresponding GAAP measure."
}