{
  "item1": "actively market sell solutions current prospective customers using multi-channel approach. go-to- market strategy includes comprehensive digital channels, direct sales forces strategic partner relationships. continue expand online, end-to-end capability where customers can buy, onboard manage accounts own. addition, leverage omni-channel approach enables sales people more efficient improving prospecting efforts through digitally sourced leads.",
  "item7": "due impact acquisitions continued investments technology. Financing activities. Net cash provided financing activities compared net cash used financing activities . Net cash provided financing activities 2024 primarily due (i) net borrowings Credit Facility Securitization Facility compared net repayments (ii) increase proceeds common stock resulting stock option exercises, partially offset increased outflows repurchases common stock Corpay Technologies Operating Company, LLC, certain domestic foreign owned subsidiaries, designated co- borrowers (the “Borrowers”), parties Credit Agreement (the “Credit Agreement”), Bank America, N.A., administrative agent, swing line lender letter credit issuer syndicate financial institutions (the “Lenders”), which been amended multiple times.",
  "item2": "Three Months Ended September 30, Nine Months Ended September 30, Net income attributable Corpay Net income per diluted share attributable Corpay Stock-based compensation Loss extinguishment debt Integration deal related costs Restructuring related costs Loss disposition business Total pre-tax adjustments Adjusted net income attributable Corpay Adjusted net income per diluted share attributable Corpay Includes amortization related intangible assets, premium receivables, deferred financing costs debt discounts. Includes losses gains foreign currency transactions, certain legal expenses, amortization expense attributable Company's noncontrolling interest, taxes associated stock-based compensation programs loss economic hedge foreign-denominated purchase price acquisition gain sale cost method investment. Represents provision income taxes pre-tax adjustments. Represents discrete tax provision recognized third quarter 2025 result legal entity tax restructuring actions taken Company facilitate cross-border transactions discrete non-cash tax provision recognized second quarter 2025 related remeasurement deferred tax assets liabilities result tax law change California."
}