{
  "source_file": "cpb-20250803.htm",
  "form_type": "10-K",
  "item1": "Item 1. \nBusiness\nThe Company\nUnless otherwise stated, the terms \"we,\" \"us,\" \"our\" and the \"company\" refer to The Campbell's Company and its consolidated subsidiaries.\nWe are a manufacturer and marketer of high-quality, branded food and beverage products. We organized as a business corporation under the laws of New Jersey on November 23, 1922; however, through predecessor organizations, we trace our heritage in the food business back to 1869. Our principal executive offices are in Camden, New Jersey 08103-1799.\nOn March 12, 2024, we completed the acquisition of Sovos Brands, Inc. (Sovos Brands) for total purchase consideration of $2.899 billion. For additional information on this acquisition, see Note 3 to the Consolidated Financial Statements.\nOn May 30, 2023, we completed the sale of our Emerald nuts business. On August 26, 2024, we completed the sale of our Pop Secret popcorn business. On February 24, 2025, we completed the sale of our noosa yoghurt business. For additional information on the divestitures, see Note 4 to the Consolidated Financial Statements.\nOur operations, including reportable segments, are described below. Our locations, including manufacturing facilities, within each reporting segment are described in Item 2. Properties. \nReportable Segments\n Our reportable segments are:\n•\nMeals & Beverages, which consists of soup, simple meals and beverages products in retail and foodservice in the U.S. and Canada. The segment includes the following products: \nCampbell’s \ncondensed and ready-to-serve soups; \nSwanson\n broth and stocks; \nPacific\n \nFoods\n broth, soups and non-dairy beverages; \nPrego\n pasta sauces; \nPace\n Mexican sauces; \nSpaghettiOs\n pasta; \nCampbell’s\n gravies, beans and dinner sauces; \nSwanson\n canned poultry; \nV8\n juices and beverages; \nCampbell's \ntomato juice; and as of March 12, 2024, \nRao's\n pasta sauces, dry pasta, frozen entrées, frozen pizza and soups; \nMichael Angelo’s\n frozen entrées and pasta sauces; and \nnoosa\n yogurts. The noosa yoghurt business was sold on February 24, 2025. The segment also includes snacking products in foodservice and Canada; and \n•\nSnacks, which consists of Pepperidge Farm cookies, crackers, fresh bakery and frozen products, including \nGoldfish\n crackers, \nSnyder’s of Hanover\n pretzels, \nLance\n sandwich crackers, \nCape Cod\n potato chips, \nKettle Brand\n potato chips, \nLate July\n snacks, \nSnack Factory\n pretzel crisps, and other snacking products in retail in the U.S. The segment also includes the snacking and meals and beverages retail business in Latin America. The segment also included the results of our Pop Secret popcorn business, which was sold on August 26, 2024 and our Emerald nuts business, which was sold on May 30, 2023.\n Beginning in 2026, the snacking and meals and beverages retail business in Latin America is managed under our Meals & Beverages segment.\nWe refer to the following products as our \"leadership brands\": \nCampbell's\n condensed and ready-to-serve soups; \nChunky\n soups; \nSwanson\n broth, stocks and canned poultry; \nPacific Foods\n broth, soups and non-dairy beverages; \nPrego\n pasta sauces; \nPace\n Mexican sauces; \nV8\n juices and beverages; \nRao's\n pasta sauces, dry pasta, frozen entrées, frozen pizza and soups; Pepperidge Farm cookies, crackers and fresh bakery; \nGoldfish\n crackers; \nSnyder's of Hanover\n pretzels; \nLance\n sandwich crackers; \nCape Cod\n potato chips; \nKettle Brand\n potato chips; \nLate July\n snacks; and \nSnack Factory\n pretzel crisps.\nSee Note 7 to the Consolidated Financial Statements and \"Management's Discussion and Analysis of Financial Condition and Results of Operations\" for additional information regarding our reportable segments.\n3 \nIngredients, Packaging and Finished Products\nThe ingredients and packaging materials required for the manufacture of our food and beverage products are purchased from various suppliers, substantially all of which are located in North America. We also purchase finished products from domestic and international suppliers. Many of these items are subject to price fluctuations from a number of factors, including but not limited to geopolitical conflicts, shifting global trade policies (including tariffs and retaliatory measures), import and export requirements, product scarcity, demand for raw materials, commodity market speculation, energy costs, currency fluctuations, supplier capacities, government-sponsored agricultural programs and other government policy, climate change, changes in crop size, cattle cycles, herd and flock disease, crop disease, crop pests, drought and excessive rain, temperature extremes and other adverse weather events, water scarcity, scarcity of suitable agricultural land, scarcity of organic ingredients, pandemics or other local or global health issues, environmental and other sustainability regulations and other factors that may be beyond our control. To help reduce some of this price volatility, we use a combination of purchase orders, short- and long-term contracts, inventory management practices, alternative sourcing opportunities, supplier collaboration, various commodity risk management tools for most of our ingredients and packaging and other cost mitigation efforts, as applicable. Ingredient inventories are generally at a peak during the late fall and decline during the winter and spring. Since many ingredients of suitable quality are available in sufficient quantities only during certain seasons, we make commitments for the purchase of such ingredients in their respective seasons.\nDuring 2025, we experienced some volatility in commodity and supply chain costs, including the costs of labor, raw materials, energy, fuel, packaging materials and finished products, with a moderate impact from tariffs in the fourth quarter. We are unable to predict the extent to which tariffs may impact our ability to source ingredients, packaging materials and finished products in the future, and certain supply pressures may continue throughout 2026. In 2026, we expect more significant cost pressures primarily driven by tariff impacts. We plan to reduce some of these costs and impacts over time through cost savings initiatives, inventory management practices, supplier collaboration, alternative sourcing opportunities, continued supply chain productivity initiatives, surgical pricing actions where necessary and other mitigation efforts.\nCustomers\nIn most of our markets, sales and merchandising activities are conducted through our own sales force and/or third-party brokers and distribution partners. Our products are generally resold to consumers through retail food chains, mass discounters, mass merchandisers, club stores, convenience stores, dollar stores, e-commerce and other retail, commercial and non-commercial establishments. Our Snacks segment has a direct-store-delivery distribution model that uses independent contractor distributors. \nOur five largest customers accounted for approximately \n47\n% of our consolidated net sales in 2025, 2024, and 2023. Our largest customer, Wal-Mart Stores, Inc. and its affiliates, accounted for approximately \n21\n% of our consolidated net sales in 2025 and \n22\n% in 2024 and 2023. Both of our reportable segments sold products to Wal-Mart Stores, Inc. or its affiliates. No other customer accounted for 10% or more of our consolidated net sales.\nTrademarks and Technology\nAs of September 10, 2025, we owned over 3,000 trademark registrations and applications in over 150 countries. We believe our trademarks are of material importance to our business. Although the laws vary by jurisdiction, trademarks generally remain valid and can be renewed indefinitely as long as they are in use and/or their registrations are properly maintained, and they have not become generic. We believe that our principal brands, including \nCampbell's\n,\n Cape Cod\n, \nChunky\n, \nGoldfish\n,\n Kettle Brand\n, \nLance\n, \nLate July\n, \nMilano\n, \nPace\n,\n Pacific Foods\n, \nPepperidge Farm\n, \nPrego\n,\n Rao's, \nSnack Factory\n,\n \nSnyder's of Hanover\n, \nSpaghettiOs\n, \nSwanson\n,\n \nand\n V8\n,\n \nare protected by trademark law in the major markets where they are used.\nAlthough we own a number of valuable patents, we do not regard any segment of our business as being dependent upon any single patent or group of related patents. In addition, we own copyrights, both registered and unregistered, proprietary trade secrets, technology, know-how, processes and other intellectual property rights that are not registered.\nCompetition\nWe operate in a highly competitive industry and experience competition in all of our categories. This competition arises from numerous competitors of varying sizes across multiple food and beverage categories, and includes producers of private label products, as well as other branded food and beverage manufacturers. Private label products are generally sold at lower prices than branded products. Competitors market and sell their products through traditional retailers and e-commerce. All of these competitors vie for trade merchandising support and consumer dollars. The number of competitors cannot be reliably estimated. Our principal areas of competition are brand recognition, taste, nutritional value, price, promotion, innovation, shelf space and customer service.\n4 \nCapital Expenditures\nDuring 2025, our aggregate capital expenditures were $426 million. We expect to spend approximately $420 million for capital projects in 2026. Major capital projects based on planned spend in 2026 include network optimization for both our Meals & Beverages and Snacks businesses, information technology projects and wastewater initiatives. We estimate that approximately $35 million of the capital expenditures anticipated during 2026 will be for upgrades to our Napoleon, Ohio wastewater treatment facility, with another approximately $20 million for other network wastewater initiatives.\nGovernment Regulation\nThe manufacture and sale of consumer food products is highly regulated. In the U.S., our activities are subject to regulation by various federal government agencies, including the Food and Drug Administration (FDA), the Department of Agriculture, the Federal Trade Commission, the Department of Labor, the Department of Commerce, the Occupational Safety and Health Administration and the Environmental Protection Agency, as well as various state and local agencies. Our business is also regulated by similar agencies outside of the U.S. Additionally, we are subject to food ingredients regulations (including but not limited to Food, Drug, and Cosmetic Act (FD&C) colors), labeling and packaging regulations (including but not limited to extended producer responsibility (EPR) regulations), data privacy and security regulations, tax and securities regulations, import regulations, accounting and reporting standards, and other financial laws and regulations. We believe that we are in compliance with current laws and regulations in all material respects and do not expect that continued compliance with such laws and regulations will have a material effect on capital expenditures, earnings or our competitive position.\nEnvironmental Matters\nOf our $426 million in capital expenditures made during 2025, approximately $26 million were for compliance with environmental laws and regulations in the U.S. We further estimate that approximately $35 million of the capital expenditures anticipated during 2026 will be for upgrades to our Napoleon, Ohio wastewater treatment facility, with another approximately $20 million for other network wastewater initiatives. Additionally, we anticipate spending approximately $6 million for compliance with U.S. environmental laws and regulations during 2026. We believe that the continued compliance with existing environmental laws and regulations (both within the U.S. and elsewhere) will not have a material effect on capital expenditures, earnings or our competitive position. In addition, we continue to monitor existing and pending environmental laws and regulations within the U.S. and elsewhere relating to climate change, greenhouse gas emissions, energy and sustainability, including EPR laws and regulations. While the impact of these laws and regulations cannot be predicted with certainty, we do not believe that compliance with these laws and regulations will have a material effect on capital expenditures, earnings or our competitive position. See Note 18 to the Consolidated Financial Statements for additional information regarding certain environmental matters.\nSeasonality\nDemand for soup products is seasonal, with the fall and winter months usually accounting for the highest sales volume.\n \nDemand for our other products is generally evenly distributed throughout the year.\nHuman Capital Management\nOne of the four pillars of our strategic framework is to build a Top Team. To do this, we are committed to building a company where everyone is valued and supported to do their best work. We believe that our employees are the driving force behind our success. Prioritizing attracting, developing and retaining world-class talent and cultivating a culture of belonging embodies our purpose, \nConnecting people through food they love.\n This approach also aligns with our Employee Value Proposition, \nMake history with Campbell’s\n, to enhance our focus on building a winning team and culture. In accordance with our purpose and Employee Value Proposition, we have brought together all of our corporate team members from our Snacks offices in Charlotte, North Carolina and Norwalk, Connecticut to our headquarters in Camden, New Jersey. This move has helped to foster closer collaboration and enhance decision-making, thereby enabling us to execute our business strategy. We have also invested in other work experiences and wellness areas in our field locations. On August 3, 2025, we had approximately 13,700 full-time and part-time employees.\nTraining, Development and Engagement\nWe invest in our employees through training and development programs to support our culture of continuous learning. Our developmental programs allow employees to focus on timely and topical development areas including leadership excellence, change management and functional capabilities. We communicate frequently and transparently with our employees through regular company-wide and business unit check-ins, and we conduct employee engagement surveys that provide our employees with an opportunity to share anonymous feedback with management in a variety of areas including confidence in leadership, growth and career opportunities, alignment of work and overall engagement.\n5 \nTotal Rewards\nWe provide market-based competitive compensation through our salary, annual incentive and long-term incentive programs, and a robust benefits package that promotes the overall well-being of our employees. We provide a variety of resources and services to help our employees plan for retirement and provide a 401(k) plan with immediate vesting. We benchmark and establish compensation structures based on competitive market data. Individual pay is based on various factors such as an employee's role, experience, job location and contributions. Performance discussions for salaried employees are conducted throughout the year to assess contributions and inform individual development plans. \nWellness and Safety\nOur employees' health, safety and well-being are our top priorities. We promote a strong culture of safety and prioritize keeping all our employees, contractors and visitors safe. To accomplish this, we employ comprehensive health, safety and environment management policies and standards throughout the organization. In addition, we strive to continuously improve our work processes, tools and metrics to reduce workplace injuries and enhance safety. \nWe provide a workplace that develops, supports and motivates our people. Our Ways to Well-being Strategy provides information, education tools and resources to drive engagement and to help support our employees' physical, financial, professional, social and emotional well-being. As part of this focus on well-being, we emphasize the need for our employees to embrace healthy lifestyles and we offer a variety of wellness education opportunities for our employees. We continue to modernize our workspaces and have a hybrid work policy to allow office-based employees to work remotely several days per week. \nWebsites\nOur primary corporate website can be found at \nwww.thecampbellscompany.com\n. We make available free of charge at the Investors portion of this website (under the \"Financials—SEC Filings\" caption) all of our reports (including amendments) filed or furnished pursuant to Section 13(a) or 15(d) of the Securities Exchange Act of 1934, as amended, including our annual reports on Form 10-K, our quarterly reports on Form 10-Q and our current reports on Form 8-K. These reports are made available on the website as soon as reasonably practicable after their filing with, or furnishing to, the Securities and Exchange Commission (SEC).\nAll websites appearing in this Annual Report on Form 10-K are inactive textual references only, and the information in, or accessible through, such websites is not incorporated into this Annual Report on Form 10-K, or into any of our other filings with the SEC.",
  "item7": "Item 7. \nManagement's Discussion and Analysis of Financial Condition and Results of Operations\nOVERVIEW \nThis Management’s Discussion and Analysis of Financial Condition and Results of Operations is provided as a supplement to, and should be read in conjunction with, our consolidated financial statements and the accompanying notes to the consolidated financial statements presented in \"Financial Statements and Supplementary Data,\" as well as the information contained in \"Risk Factors.\"\nUnless otherwise stated, the terms \"we,\" \"us,\" \"our\" and the \"company\" refer to The Campbell's Company and its consolidated subsidiaries.\nExecutive Summary\nWe are a manufacturer and marketer of high-quality, branded food and beverage products. We operate in a highly competitive industry and experience competition in all of our categories.\nIn 2025, we continued to advance our key strategic initiatives in a dynamic operating environment marked by shifting global trade policies, increased regulatory activity, consumer behavior shifts, commodity cost fluctuations and other global macroeconomic challenges. During 2025, we experienced elevated cost inflation and other supply chain costs, which were mostly offset by improvements in our supply chain productivity and benefits from our cost savings initiatives. In 2026, we expect more significant cost pressures primarily driven by tariff impacts. We plan to reduce some of these costs and impacts over time through cost savings initiatives, inventory management practices, supplier collaboration, alternative sourcing opportunities, continued supply chain productivity initiatives, surgical pricing actions where necessary and other mitigation efforts. We will continue to evaluate the dynamic macroeconomic environment to take action to mitigate the impact on our business, financial condition and results of operations.\nStrategy\nOur strategy is built around four pillars that position us to achieve Top-Tier Performance for our shareholders, as further discussed below.\n•\nTop Team\n: We plan to deliver for our people by continuing to cultivate a highly engaged culture to attract, grow and retain top talent. This includes investing in leadership and development programs and elevating commercial capabilities that will help us grow. We are driving organizational engagement, belonging and effectiveness through our \n19 \nEmployee Value Proposition, \nMake history with Campbell’s\n, and modernizing our facilities. We have completed the consolidation of our Snacks offices into Camden, New Jersey. Our single headquarters has helped to foster closer collaboration and enhance decision-making, thereby improving our ability to execute on our business strategy. \n•\nBest Portfolio\n: We believe in delivering for our consumers through consumer-focused marketing efforts and increased leadership brand support. We have created a Growth Office to support our two divisions and to expand our consumer-led innovations. We believe that we are well-positioned as a transformative category leader with an advantaged portfolio of brands across our Meals & Beverages and Snacks segments. We will support our Best Portfolio priority and accelerate our profitable growth model by growing market share and driving integrated business planning programming throughout the company. \n•\nWinning Execution\n: We will focus on delivering for our customers by advancing strategic retailer relationships and continuing to optimize our manufacturing and distribution network, with a focus on digitization, logistics and distribution expertise. In September 2024, we announced plans to implement new cost savings initiatives with targeted annual savings of approximately $250 million by the end of 2028. On September 3, 2025, we increased the estimate of annual ongoing savings, once all phases are implemented, to approximately $375 million by the end of 2028. See \"Restructuring Charges, Cost Savings Initiatives and Other Optimization Initiatives\" for additional information on these initiatives.\n•\nLasting Impact\n: Finally, we plan to continue to deliver for our communities with continued progress on our sustainability and community goals and strengthening our connection to the communities in which we operate.\nBusiness Trends\nOur industry continues to navigate a dynamic operating and regulatory environment driven by commodity cost volatility, supply chain pressures, tariffs and shifting global trade policies and other economic uncertainties, as well as evolving consumer purchasing and spending patterns.\nOur strategy is designed, in part, to capture growing consumer preferences for value and convenience. We expect consumers to continue to seek at-home cooking solutions and stretchable meals. We also believe that consumers are making more intentional decisions in snacking, in terms of health and wellness and seeking indulgences.\nRetailers continue to use their buying power and negotiating strength to seek increased promotional programs funded by their suppliers and more favorable terms, including supplier-funded customized products. Any consolidations among retailers would continue to create large and sophisticated customers that may further this trend. Retailers also continue to grow and promote private label brands that compete with branded products, especially on price.\nTariffs on certain ingredients, inputs and imports from many countries, including Canada, Mexico, members of the European Union and the United Kingdom have resulted in increased costs, including on ingredients, packaging, such as tinplate steel used to make cans and other materials used to produce and distribute our products and on finished products that we import. We are continuing to monitor the rapidly evolving tariff and global trade policies and are working with our suppliers to mitigate potential impacts on our business. The extent and duration of the tariffs and the resulting impact on general economic conditions and on our business are uncertain and depend on various factors, such as recent legal challenges to the U.S.'s imposition of tariffs, negotiations between the U.S. and affected countries, the responses of other countries or regions, relief that may be granted, availability and cost of alternative sources of supply and demand for our products in affected markets.\nIn addition, in light of recent actions by the United States Department of Health and Human Services, Food and Drug Administration (FDA) and states, we anticipate continued legislative and regulatory developments with respect to food ingredients, labeling and packaging at the state and federal levels, along with related changes in consumer expectations and behavior. In April 2025, the FDA called on industry to phase out all “petroleum-based synthetic dyes” from the nation’s food supply, and in May 2025, the MAHA Commission published an assessment report discussing factors contributing to chronic childhood disease including diet, environmental exposure, lack of physical activity and healthcare. The MAHA Commission transmitted its strategy report, setting forth certain recommendations for addressing chronic childhood disease, to the President in August 2025 and publicly released it in September 2025. While the effects of all of these proposals remain uncertain at this time, we are continuing to monitor changes to laws and regulations that affect the food industry and evaluate their impact on our business, financial condition and results of operations.\nIn 2026, we expect significant cost pressures primarily driven by tariff impacts that could negatively impact our business, financial condition and results of operations. We will continue to evaluate the dynamic macroeconomic environment to take action to mitigate such impacts.\n20 \nBusiness Acquisition & Divestitures\nOn March 12, 2024, we completed the acquisition of Sovos Brands, Inc. (Sovos Brands) for total purchase consideration of $2.899 billion. For additional information on the Sovos Brands acquisition, see Note 3 to the Consolidated Financial Statements. All references to the acquisition below refer to the Sovos Brands acquisition.\nOn May 30, 2023, we completed the sale of our Emerald nuts business. On August 26, 2024, we completed the sale of our Pop Secret popcorn business. On February 24, 2025, we completed the sale of our noosa yoghurt business. For additional information on the divestitures, see Note 4 to the Consolidated Financial Statements.\nSummary of Results \nThis Summary of Results provides significant highlights from the discussion and analysis that follows. \nThere were 53 weeks in 2025 and 52 weeks in 2024 and 2023.\n•\nNet sales increased 6% in 2025 to $10.253 billion primarily due to an 8-point benefit from the acquisition of Sovos Brands and a 2-point benefit from the 53\nrd\n week, partially offset by the impact of divestitures, unfavorable volume/mix and lower net price realization.\n•\nGross profit, as a percent of sales, decreased to 30.4% in 2025 from 30.8% a year ago. The decrease was primarily due to higher cost inflation and other supply chain costs and unfavorable net price realization, partially offset by the benefits from supply chain productivity improvements.\n•\nEarnings per share were $2.01 in 2025, compared to $1.89 a year ago. The current year included expenses of $.97 per share and the prior year included expenses of $1.19 per share from items impacting comparability as discussed below. \nNet Earnings attributable to The Campbell's Company - 2025 Compared with 2024\nThe following items impacted the comparability of net earnings and net earnings per share:\n•\nWe implemented several cost savings initiatives in recent years. In 2025, we recorded Restructuring charges of $24 million and implementation costs and other related costs of $41 million in Administrative expenses, $32 million in Cost of products sold, $4 million in Marketing and selling expenses and $3 million in Research and development expenses related to these initiatives. In 2024, we recorded Restructuring charges of $17 million and implementation costs and other related costs of $54 million in Administrative expenses, $26 million in Cost of products sold, $4 million in Marketing and selling expenses and $3 million in Research and development expenses related to these initiatives. \nIn the second quarter of 2024, we began implementation of an optimization initiative to improve the effectiveness of our Snacks direct-store-delivery route-to-market network. In 2025, we recognized $20 million in Marketing and selling expenses and $1 million in Administrative expenses related to this initiative. In 2024, we recognized $5 million in Marketing and selling expenses related to this initiative.\nIn 2025, the total aggregate impact related to the cost savings and optimization initiatives was $125 million ($96 million after tax, or $.32 per share). In 2024, the total aggregate impact related to the cost savings and optimization initiatives was $109 million ($83 million after tax, or $.28 per share). See Note 8 to the Consolidated Financial Statements and \"Restructuring Charges, Cost Savings Initiatives and Other Optimization Initiatives\" for additional information;\n•\nIn 2025, we recognized actuarial losses on our pension and postretirement plans in Other expenses / (income) of $24 million ($18 million after tax, or $.06 per share). In 2024, we recognized actuarial losses in Other expenses / (income) of $33 million ($25 million after tax, or $.08 per share);\n•\nIn 2025, we recognized gains in Cost of products sold of $11 million ($8 million after tax, or $.03 per share) associated with unrealized mark-to-market adjustments on outstanding undesignated commodity hedges. In 2024, we recognized losses in Cost of products sold of $22 million ($16 million after tax, or $.05 per share) associated with unrealized mark-to-market adjustments on outstanding undesignated commodity hedges;\n•\nIn 2025, we recorded accelerated amortization expense in Other expenses / (income) of $20 million ($15 million after tax, or $.05 per share) related to customer relationship intangible assets due to the loss of certain contract manufacturing customers, which began in the fourth quarter of 2023. In 2024, we recorded accelerated amortization expense in Other expenses / (income) of $27 million ($20 million after tax, or $.07 per share); \n•\nIn the third quarter of 2025, we performed an interim impairment assessment on the \nSnyder's of Hanover\n trademark within the Snacks segment and recognized an impairment charge of $150 million ($112 million after tax, or $.37 per share) on the trademark. \n21 \nIn the second quarter of 2025, we performed an interim impairment assessment on certain salty snacks and cookie trademarks within our Snacks segment, including \nTom's\n,\n Jays\n,\n Kruncher's\n,\n O-Ke-Doke\n,\n Stella D'oro\n and \nArchway\n, collectively referred to as our \"Allied brands,\" and recognized an impairment charge of $15 million on the trademarks. \nIn the second quarter of 2025, we performed an interim impairment assessment on the \nLate July\n trademark within our Snacks segment and recognized an impairment charge of $11 million on the trademark.\nIn 2025, the total aggregate impact of the impairment charges was $176 million ($131 million after tax, or $.44 per share).\nIn the fourth quarter of 2024, we recognized an impairment charge of $53 million on our Allied brands trademarks. \nIn the fourth quarter of 2024, we performed an impairment assessment on the assets in our Pop Secret popcorn business within our Snacks segment as sales and operating performance were below expectations due in part to competitive pressure and reduced margins, and as we pursued divesting the business. As a result of these factors, in the fourth quarter of 2024, we lowered our long-term outlook for the business and recognized an impairment charge of $76 million on the trademark. The sale of the business was completed on August 26, 2024.\nIn 2024, the total aggregate impact of the impairment charges was $129 million ($98 million after tax, or $.33 per share). \nThe charges were included in Other expenses / (income). See \"Critical Accounting Estimates\" for additional information;\n•\nIn 2025 and 2024, we recorded litigation expenses in Administrative expenses of $5 million ($5 million after tax, or $.02 per share) related to the Plum baby food and snacks business (Plum), which was divested on May 3, 2021, and certain other litigation matters;\n•\nIn 2025, we recorded insurance recoveries in Administrative expenses of $1 million ($1 million after tax) related to a cybersecurity incident that was identified in the fourth quarter of 2023. In 2024, we recorded costs of $2 million in Cost of products sold and $1 million in Administrative expenses (aggregate impact of $2 million after tax, or $.01 per share) related to the cybersecurity incident; \n•\nIn the third quarter of 2025, we completed the sale of our noosa yoghurt business. In the second quarter of 2025, we recorded $15 million ($.05 per share) of tax expense related to the sale. In 2025, we recorded an after-tax loss of $15 million ($.05 per share) on the sale of the business. In the first quarter of 2025, we recorded a loss in Other expenses / (income) of $25 million ($19 million after tax, or $.06 per share) on the sale of our Pop Secret popcorn business. In 2025, the total aggregate impact of charges associated with divestitures was $25 million ($34 million after tax, or $.11 per share); and\n•\nIn the first quarter of 2024, we announced our intent to acquire Sovos Brands and on March 12, 2024 the acquisition closed. In 2024, we incurred $126 million of costs associated with the acquisition, of which $21 million was recorded in Restructuring charges, $47 million in Administrative expenses, $35 million in Other expenses / (income), $3 million in Marketing and selling expenses, $2 million in Research and development expenses and $18 million in Cost of products sold, of which $17 million was associated with the acquisition date fair value adjustment for inventory. We also recorded costs of $2 million in Interest expense related to costs associated with the Delayed Draw Term Loan Credit Agreement (the 2024 DDTL Credit Agreement) used to fund the acquisition. The aggregate impact was $128 million, $109 million after tax, or $.36 per share.\n22 \nThe items impacting comparability are summarized below:\n2025\n2024\n(Millions, except per share amounts)\nEarnings\nImpact\nEPS\nImpact\nEarnings\nImpact\nEPS\nImpact\nNet earnings attributable to The Campbell's Company\n$\n602\n \n$\n2.01\n \n$\n567 \n$\n1.89 \nCosts associated with cost savings and optimization initiatives\n$\n(96)\n$\n(.32)\n$\n(83)\n$\n(.28)\nPension and postretirement actuarial losses\n(18)\n(.06)\n(25)\n(.08)\nCommodity mark-to-market gains (losses)\n8\n \n.03\n \n(16)\n(.05)\nAccelerated amortization\n(15)\n(.05)\n(20)\n(.07)\nImpairment charges\n(131)\n(.44)\n(98)\n(.33)\nCertain litigation expenses\n(5)\n(.02)\n(5)\n(.02)\nCybersecurity incident recoveries (costs)\n1\n \n—\n \n(2)\n(.01)\nCharges associated with divestitures\n(34)\n(.11)\n— \n— \nCosts associated with acquisition\n—\n \n—\n \n(109)\n(.36)\nImpact of items on Net earnings\n(1)\n$\n(290)\n$\n(.97)\n$\n(358)\n$\n(1.19)\n__________________________________________\n(1)\nSum of the individual amounts may not add due to rounding.\nNet earnings attributable to The Campbell's Company were $602 million ($2.01 per share) in 2025, compared to $567 million ($1.89 per share) in 2024. After adjusting for items impacting comparability, earnings decreased primarily due to higher interest expense and higher marketing and selling expenses, partially offset by an increase in gross profit and a lower effective tax rate. The additional week contributed approximately $.06 per share to earnings in 2025. The estimated impact of tariffs was approximately $.02 per share in 2025.\nNet Earnings attributable to The Campbell's Company - 2024 Compared with 2023 \nIn addition to the 2024 items that impacted comparability of Net earnings discussed above, the following items impacted the comparability of net earnings and net earnings per share:\n•\nIn 2023, we recorded Restructuring charges of $16 million and implementation costs and other related costs of $24 million in Administrative expenses, $18 million in Cost of products sold, $5 million in Marketing and selling expenses and $3 million in Research and development expenses (aggregate impact of $50 million after tax, or $.17 per share) related to the cost savings initiatives discussed above. See Note 8 to the Consolidated Financial Statements and \"Restructuring Charges, Cost Savings Initiatives and Other Optimization Initiatives\" for additional information;\n•\nIn 2023, we recognized actuarial gains on our pension and postretirement plans in Other expenses / (income) of $15 million ($11 million after tax, or $.04 per share); \n•\nIn 2023, we recognized gains in Cost of products sold of $21 million ($16 million after tax, or $.05 per share) associated with unrealized mark-to-market adjustments on outstanding undesignated commodity hedges; \n•\nIn 2023, we incurred costs associated with the acquisition of Sovos Brands in Other expenses / (income) of $5 million ($4 million after tax, or $.01 per share); \n•\nIn 2023, we recorded accelerated amortization expense in Other expenses / (income) of $7 million ($5 million after tax, or $.02 per share) related to customer relationship intangible assets due to the loss of certain contracting manufacturing customers, which began in the fourth quarter of 2023; and\n•\nIn 2023, we recorded a loss in Other expenses / (income) of $13 million ($13 million after tax, or $.04 per share) on the sale of our Emerald nuts business, which was sold on May 30, 2023. \n23 \nThe items impacting comparability are summarized below:\n2024\n2023\n(Millions, except per share amounts)\nEarnings\nImpact\nEPS\nImpact\nEarnings\nImpact\nEPS\nImpact\nNet earnings attributable to The Campbell's Company\n$\n567 \n$\n1.89 \n$\n858 \n$\n2.85 \nCosts associated with cost savings and optimization initiatives\n$\n(83)\n$\n(.28)\n$\n(50)\n$\n(.17)\nPension and postretirement actuarial gains (losses)\n(25)\n(.08)\n11 \n.04 \nCommodity mark-to-market gains (losses)\n(16)\n(.05)\n16 \n.05 \nCosts associated with acquisition\n(109)\n(.36)\n(4)\n(.01)\nAccelerated amortization\n(20)\n(.07)\n(5)\n(.02)\nImpairment charges\n(98)\n(.33)\n— \n— \nCertain litigation expenses\n(5)\n(.02)\n— \n— \nCybersecurity incident costs\n(2)\n(.01)\n— \n— \nCharges associated with divestiture\n— \n— \n(13)\n(.04)\nImpact of items on Net earnings\n(1)\n$\n(358)\n$\n(1.19)\n$\n(45)\n$\n(.15)\n__________________________________________\n(1)\nSum of the individual amounts may not add due to rounding.\nNet earnings attributable to The Campbell's Company were $567 million ($1.89 per share) in 2024, compared to $858 million ($2.85 per share) in 2023. After adjusting for items impacting comparability, earnings increased reflecting improved gross profit, partially offset by higher interest expense, higher marketing and selling expenses, higher other expenses and higher research and development expenses. Earnings per share benefited from a reduction in the weighted average diluted shares outstanding. \nDISCUSSION AND ANALYSIS\nSales\nAn analysis of net sales by reportable segment follows:\n% Change\n(Millions)\n2025\n2024\n2023\n2025/2024\n2024/2023\nMeals & Beverages\n$\n6,050\n \n$\n5,258 \n$\n4,907 \n15\n7\nSnacks\n4,203\n \n4,378 \n4,450 \n(4)\n(2)\n$\n10,253\n \n$\n9,636 \n$\n9,357 \n6\n3\nAn analysis of percent change of net sales by reportable segment follows:\n2025 versus 2024\nMeals & Beverages\n(2)\nSnacks\nTotal\nVolume/mix\n1%\n(3)%\n(1)%\nNet price realization\n(1)\n(1)\n—\n(1)\nAcquisition\n15\n—\n8\nDivestitures\n(1)\n(3)\n(2)\nEstimated impact of 53\nrd\n week\n2\n2\n2\n15%\n(4)%\n6%\n2024 versus 2023\nMeals & Beverages\nSnacks\nTotal\nVolume/mix\n(2)%\n(2)%\n(2)%\nNet price realization\n(1)\n—\n1\n1\nAcquisition\n9\n—\n5\nDivestiture\n—\n(1)\n(1)\n7%\n(2)%\n3%\n24 \n__________________________________________\n(1)\nIncludes revenue reductions from trade promotion and consumer coupon redemption programs.\n(2)\nSum of the individual amounts does not add due to rounding.\nIn 2025, Meals & Beverages sales increased 15% primarily due to a 15-point benefit from the acquisition of Sovos Brands. Excluding the benefit from the Sovos Brands acquisition, the benefit of the additional week and the impact from the divestiture of the noosa yoghurt business, sales were comparable primarily due to gains in foodservice, Canada and \nRao's\n pasta sauces, partially offset by declines in U.S. soup and \nSpaghettiOs\n. Favorable volume/mix was offset by unfavorable net price realization. Including a 1-point benefit from the additional week, sales of U.S. soup were comparable with prior year as increases in broth and condensed soups were offset by decreases in ready-to-serve soups. \nIn 2024, Meals & Beverages sales increased 7% reflecting a 9-point benefit from the acquisition of Sovos Brands. Sales were impacted by unfavorable volume/mix with neutral net price realization. Excluding the benefit from the acquisition, sales decreased primarily due to declines in U.S. retail products, including beverages and U.S. soup, partially offset by gains in foodservice and Canada. Sales of U.S. soup decreased 2% primarily due to decreases in ready-to-serve soups and condensed soups, partially offset by an increase in broth. \nIn 2025, Snacks sales decreased 4%. Excluding the impact from the divestiture of the Pop Secret popcorn business and the benefit of the additional week, sales decreased due to declines in third-party partner brands and contract manufacturing, \nGoldfish\n crackers, \nSnyder's of Hanover\n pretzels, \nLance\n sandwich crackers, fresh bakery and Pepperidge Farm cookies. Sales were impacted by volume/mix declines with neutral net price realization.\nIn 2024, Snacks sales decreased 2%. Excluding the impact from the divestiture of the Emerald nuts business, sales decreased as declines in third-party partner brands and contract manufacturing, fresh bakery and \nPop Secret\n popcorn were partially offset by increases in \nGoldfish\n crackers, \nLance\n sandwich crackers and \nCape Cod\n potato chips. Volume/mix declines were partially offset by favorable net price realization. \nGross Profit\nGross profit, defined as Net sales less Cost of products sold, increased by $148 million in 2025 from 2024 and increased by $54 million in 2024 from 2023. As a percent of sales, gross profit was 30.4% in 2025, 30.8% in 2024 and 31.2% in 2023. \nThe 40 basis-point decreases in gross profit margin in 2025 and 2024, were due to the following factors:\nMargin Impact\n \n2025\n2024\nCost inflation, supply chain costs and other factors\n(1)\n(150)\n(310)\nNet price realization\n(40)\n60\nVolume/mix\n(2)\n(10)\n20\nProductivity improvements\n150\n240\nImpact of acquisition\n(3)\n10\n(40)\nHigher costs associated with cost savings initiatives\n—\n(10)\n(40)\n(40)\n__________________________________________\n(1)\n2025 includes an estimated positive margin impact of 50 basis points from the benefit of cost savings initiatives and a 30 basis-point positive impact from the change in unrealized mark-to-market adjustments on outstanding undesignated commodity hedges, which were more than offset by cost inflation and other factors. 2024 includes an estimated positive margin impact of 20 basis points from the benefit of cost savings initiatives, which was more than offset by cost inflation and other factors, including a 40 basis-point negative impact from the change in unrealized mark-to-market adjustments on outstanding undesignated commodity hedges and a 10 basis-point negative impact from a cybersecurity incident. \n(2)\nIncludes the impact of operating leverage. \n(3)\n2025 includes a positive margin impact of 20 basis points from lapping the 20 basis-point negative margin impact in 2024 from a Sovos Brands acquisition date fair value adjustment for inventory. \nMarketing and Selling Expenses\nMarketing and selling expenses as a percent of sales were 9.0% in 2025, 8.6% in 2024 and 8.7% in 2023. Marketing and selling expenses increased 11% in 2025 from 2024. The increase was primarily due to the impact of the acquisition (approximately 7 points); higher advertising and consumer promotion expense (approximately 2 points) and higher costs related to cost savings and optimization initiatives (approximately 2 points). The increase in advertising and consumer promotion expense was driven by Meals & Beverages and Snacks.\n25 \nMarketing and selling expenses increased 3% in 2024 from 2023. The increase was primarily due to the impact of the acquisition (approximately 4 points); higher selling expenses (approximately 1 point) and higher other marketing expenses (approximately 1 point), partially offset by lower advertising and consumer promotion expense (approximately 3 points), primarily in Meals & Beverages. \nAdministrative Expenses\nAdministrative expenses as a percent of sales were 6.6% in 2025, 7.6% in 2024 and 7.0% in 2023. Administrative expenses decreased 9% in 2025 from 2024. The decrease was primarily due to increased benefits from cost savings initiatives (approximately 8 points); costs associated with the acquisition in the prior year (approximately 6 points); lower incentive compensation (approximately 2 points); lower costs related to cost savings initiatives (approximately 2 points); and lower benefit-related costs (approximately 1 point), partially offset by higher general administrative costs and inflation (approximately 7 points) and the impact of the acquisition (approximately 3 points).\nAdministrative expenses increased 13% in 2024 from 2023. The increase was primarily due to costs associated with the acquisition (approximately 7 points); higher costs related to cost savings initiatives (approximately 5 points); higher general administrative costs and inflation (approximately 3 points); the impact of the acquisition (approximately 2 points) and higher benefit-related costs (approximately 2 points), partially offset by increased benefits from cost savings initiatives (approximately 5 points) and lower incentive compensation (approximately 2 points).\nOther Expenses / (Income)\nOther expenses in 2025 included the following: \n•\n$176 million of impairment charges related to the \nSnyder's of Hanover\n, Allied brands and\n Late July\n trademarks;\n•\n$68 million of amortization of intangible assets, including accelerated amortization of $20 million; \n•\n$25 million loss on the sale of the Pop Secret popcorn business; and\n•\n$11 million of net periodic benefit expense, including net pension and postretirement actuarial losses of $24 million.\nOther expenses in 2024 included the following:\n•\n$129 million of impairment charges related to the \nPop Secret\n and Allied brands trademarks;\n•\n$73 million of amortization of intangible assets, including accelerated amortization of $27 million; \n•\n$35 million of costs associated with the acquisition of Sovos Brands; and\n•\n$26 million of net periodic benefit expense, including pension and postretirement actuarial losses of $33 million.\nOther expenses in 2023 included the following: \n•\n$48 million of amortization of intangible assets, including accelerated amortization of $7 million;\n•\n$13 million loss on the sale of the Emerald nuts business;\n•\n$5 million of costs associated with the acquisition of Sovos Brands; and\n•\n$35 million of net periodic benefit income, including pension and postretirement actuarial gains of $15 million.\nOperating Earnings\nSegment operating earnings increased 1% in 2025 from 2024 and increased 6% in 2024 from 2023. \nAn analysis of operating earnings by segment follows:\n% Change\n(Millions)\n2025\n2024\n2023\n2025/2024\n2024/2023\nMeals & Beverages\n$\n1,076\n \n$\n974 \n$\n894 \n10\n9\nSnacks\n560\n \n648 \n640 \n(14)\n1\n1,636\n \n1,622 \n1,534 \n1\n6\nCorporate income (expense)\n(488)\n(584)\n(206)\nRestructuring charges\n(1)\n(24)\n(38)\n(16)\nEarnings before interest and taxes\n$\n1,124\n \n$\n1,000 \n$\n1,312 \n__________________________________________\n(1)\nSee Note 8 to the Consolidated Financial Statements for additional information on restructuring charges.\n26 \nOperating earnings from Meals & Beverages increased 10% in 2025 versus 2024. The increase was primarily due to the benefit of the acquisition of Sovos Brands and the benefit of the additional week, partially offset by lower gross profit. Gross profit margin decreased due to higher cost inflation and other supply chain costs, unfavorable net price realization and the dilutive impact of the acquisition, partially offset by supply chain productivity improvements, benefits from cost savings initiatives and favorable volume/mix.\nOperating earnings from Meals & Beverages increased 9% in 2024 versus 2023. The increase was primarily due to the benefit of the acquisition of Sovos Brands and lower marketing and selling expenses, partially offset by lower gross profit. Gross profit margin decreased due to higher cost inflation and other supply chain costs and the dilutive impact of the acquisition, partially offset by supply chain productivity improvements, favorable net price realization and favorable volume/mix.\nOperating earnings from Snacks decreased 14% in 2025 versus 2024. The decrease was primarily due to lower gross profit and higher marketing and selling expenses, partially offset by lower administrative expenses. Gross profit decreased primarily due to the impact of cost inflation and other supply chain costs and unfavorable volume/mix, partially offset by supply chain productivity improvements, the benefit of the additional week and benefits from cost savings initiatives.\nOperating earnings from Snacks increased 1% in 2024 versus 2023. The increase was primarily due to higher gross profit, partially offset by higher marketing and selling expenses. Gross profit margin increased due to supply chain productivity improvements, \nfavorable\n net price realization and benefits from cost savings initiatives more than offsetting higher cost inflation and other supply chain costs. \nCorporate expense in 2025 included the following:\n•\n$176 million of impairment charges related to the \nSnyder's of Hanover\n, Allied brands and \nLate July\n trademarks;\n•\ncosts of $101 million related to cost savings and optimization initiatives;\n•\n$25 million loss on the sale of the Pop Secret popcorn business;\n•\n$24 million of net pension and postretirement actuarial losses;\n•\n$20 million of accelerated amortization expense; \n•\n$5 million of certain litigation expenses, including expenses related to Plum; \n•\n$11 million of unrealized mark-to-market gains on outstanding undesignated commodity hedges; and\n•\n$1 million of insurance recoveries related to a cybersecurity incident.\nCorporate expense in 2024 included the following:\n•\n$129 million of impairment charges related to the \nPop Secret\n and Allied brands trademarks;\n•\n$105 million of costs associated with the acquisition of Sovos Brands; \n•\ncosts of $92 million related to cost savings and optimization initiatives;\n•\n$33 million of pension and postretirement actuarial losses;\n•\n$27 million of accelerated amortization expense; \n•\n$22 million of unrealized mark-to-market losses on outstanding undesignated commodity hedges;\n•\n$5 million of certain litigation expenses, including expenses related to Plum; and\n•\n$3 million of costs associated with a cybersecurity incident.\nCorporate expense in 2023 included the following:\n•\ncosts of $50 million related to the cost savings initiatives; \n•\n$13 million loss from the sale of the Emerald nuts business; \n•\n$7 million of accelerated amortization expense;\n•\n$5 million of costs associated with the acquisition of Sovos Brands; \n•\n$21 million of unrealized mark-to-market gains on outstanding undesignated commodity hedges; and\n•\n$15 million of pension and postretirement actuarial gains.\n27 \nInterest Expense\nInterest expense was $345 million in 2025, $249 million in 2024 and $188 million in 2023. The increases in 2025 and 2024 were primarily due to higher levels of debt to fund the acquisition in 2024 and higher average interest rates on the debt portfolio each year.\nTaxes on Earnings\nThe effective tax rate was 24.4% in 2025, 25.1% in 2024 and 23.9% in 2023.\nThe decrease in the effective tax rate in 2025 from 2024 was primarily due to \nnondeductible costs associated with the acquisition of Sovos Brands in the prior year, excess tax benefits associated with the vesting of stock-based compensation awards in the current year and state tax law changes, partially offset by $15 million of tax expense related to the sale of the noosa yoghurt business.\nThe increase in the effective rate in 2024 from 2023 was primarily due to \nnondeductible costs associated with the acquisition.\nRestructuring Charges, Cost Savings Initiatives and Other Optimization Initiatives\nMulti-year Cost Savings Initiatives and Snyder's-Lance, Inc. (Snyder's-Lance) Cost Transformation Program and Integration\nContinuing Operations\nBeginning in 2015, we implemented initiatives to reduce costs and to streamline our organizational structure. \nOver the years, we expanded these initiatives by continuing to optimize our supply chain and manufacturing networks, as well as our information technology infrastructure.\nOn March 26, 2018, we completed the acquisition of Snyder's-Lance. Prior to the acquisition, Snyder's-Lance launched a cost transformation program following a comprehensive review of its operations with the goal of significantly improving its financial performance. We continued to implement this program and identified opportunities for additional cost synergies as we integrated Snyder's-Lance.\nIn 2022, we expanded these initiatives as we continued to pursue cost savings by further optimizing our supply chain and manufacturing network and through effective cost management. In the second quarter of 2023, we announced plans to consolidate our Snacks offices in Charlotte, North Carolina, and Norwalk, Connecticut, into our headquarters in Camden, New Jersey.\nA summary of charges recorded in the Consolidated Statements of Earnings related to these initiatives is as follows:\n(Millions, except per share amounts)\n2024\n2023\nTotal Program\nRestructuring charges\n$\n17\n \n$\n16\n \n$\n297\n \nAdministrative expenses\n54\n \n24\n \n437\n \nCost of products sold\n26\n \n18\n \n128\n \nMarketing and selling expenses\n4\n \n5\n \n23\n \nResearch and development expenses\n3\n \n3\n \n10\n \nTotal pre-tax charges\n$\n104 \n$\n66 \n$\n895 \nAggregate after-tax impact\n$\n79 \n$\n50 \nPer share impact\n$\n.26 \n$\n.17 \nA summary of the pre-tax costs associated with these initiatives is as follows:\n(Millions)\nTotal Program\nSeverance pay and benefits\n$\n253\n \nAsset impairment/accelerated depreciation\n134\n \nImplementation costs and other related costs\n508\n \nTotal\n$\n895 \n28 \nOf the aggregate $\n895\n million pre-tax costs incurred, approximately $\n720\n million were cash expenditures.\nSegment operating results do not include restructuring charges, implementation costs and other related costs because we evaluate segment performance excluding such charges. A summary of the pre-tax costs associated with segments is as follows:\n(Millions)\nTotal Program\nMeals & Beverages\n$\n288\n \nSnacks\n383\n \nCorporate\n224\n \nTotal\n$\n895 \nAs of July 28, 2024, we substantially completed the multi-year cost savings initiatives and Snyder's-Lance cost transformation program and integration, and we generated total pre-tax savings of approximately $950 million. Certain phases that had not been fully implemented were incorporated into the 2025 cost savings initiatives described below. \nSovos Brands Integration Initiatives\nOn March 12, 2024, we completed the acquisition of Sovos Brands. See Note 3 to the Consolidated Financial Statements for additional information. We identified opportunities for cost synergies as we integrate Sovos Brands.\nIn 2024, we recorded Restructuring charges of $21 million for severance pay and benefits related to initiatives to achieve the synergies and generated pre-tax savings of $10 million. The charges incurred in 2024 were associated with the Meals & Beverages segment. \nIn 2025, the initiatives to achieve synergies were incorporated into the cost savings initiatives described below.\n2025 Cost Savings Initiatives\nOn September 10, 2024, we announced plans to implement cost savings initiatives beginning in 2025, including initiatives to further optimize our supply chain and manufacturing network, optimization of our information technology infrastructure and targeted cost management. We also identified additional opportunities for cost synergies as we integrate Sovos Brands. As mentioned above, we substantially completed our previous multi-year cost savings initiatives and Snyder's-Lance cost transformation program and integration. Certain initiatives from that program have been incorporated into our 2025 cost savings initiatives. Cost estimates for the 2025 initiatives, as well as timing for certain activities, are continuing to be developed.\nA summary of charges recorded in the Consolidated Statement of Earnings related to these initiatives is as follows:\n(Millions, except per share amounts)\n2025\nRestructuring charges\n$\n24\n \nAdministrative expenses\n41\n \nCost of products sold\n32\n \nMarketing and selling expenses\n4\n \nResearch and development expenses\n3\n \nTotal pre-tax charges\n$\n104 \nAggregate after-tax impact\n$\n79 \nPer share impact\n$\n.26 \nA summary of the pre-tax costs associated with the initiatives is as follows:\n(Millions)\nRecognized as of August 3, 2025\nSeverance pay and benefits\n$\n24\n \nAsset impairment/accelerated depreciation\n31\n \nImplementation costs and other related costs\n49\n \nTotal\n$\n104 \n29 \nThe total estimated pre-tax costs for actions that have been identified to date are approximately $\n215\n million, and we expect to incur substantially all of the costs through 2028. These estimates will be updated as the detailed plans are developed.\nWe expect the costs for the actions that have been identified to date to consist of the following: approximately $\n30\n million in severance pay and benefits; approximately $\n55\n million in asset impairment and accelerated depreciation; and approximately $\n130\n million in implementation costs and other related costs. We expect these pre-tax costs to be associated with our segments as follows: Meals & Beverages - approximately \n71\n%; Snacks - approximately \n11\n% and Corporate - approximately \n18\n%.\nOf the aggregate $\n215\n million of pre-tax costs identified to date, we expect approximately $\n155\n million will be cash expenditures. In addition, we expect to invest approximately $\n205\n million in capital expenditures, of which we invested $\n147\n million as of August 3, 2025. The capital expenditures primarily relate to optimization of production within our manufacturing network, optimization of information technology infrastructure and applications and implementation of our existing SAP enterprise-resource planning system for Sovos Brands.\nOn September 10, 2024 we announced that we expect these initiatives, once all phases are implemented, to generate annual ongoing savings of approximately $250 million by the end of 2028. On September 3, 2025, we increased the estimate of annual ongoing savings, once all phases are implemented, to approximately $375 million by the end of 2028. As of August 3, 2025, we have generated total program-to-date pre-tax savings of $145 million. \nSegment operating results do not include restructuring charges, implementation costs and other related costs because we evaluate segment performance excluding such charges. A summary of the pre-tax costs associated with segments is as follows: \n(Millions)\n2025\nMeals & Beverages\n$\n74\n \nSnacks\n14\n \nCorporate\n16\n \nTotal\n$\n104 \nOther Optimization Initiatives\nIn the second quarter of 2024, we began implementation of an initiative to improve the effectiveness of our Snacks direct-store-delivery route-to-market network. Pursuant to this initiative we will purchase certain Pepperidge Farm and Snyder's-Lance routes where there are opportunities to unlock greater scale in select markets, combine them and sell the combined routes to independent contractor distributors. We expect to execute this program in a staggered rollout and to incur expenses of up to approximately $\n115\n million through 2029. In 2025, we incurred $\n20\n million in Marketing and selling expenses and $\n1\n million in Administrative expenses related to this initiative. In 2024, we incurred $\n5\n million in Marketing and selling expenses related to this initiative. As of August 3, 2025, we have incurred $\n25\n million in Marketing and selling expenses and $\n1\n million in Administrative expenses related to this initiative.\nLIQUIDITY AND CAPITAL RESOURCES\nWe expect foreseeable liquidity and capital resource requirements to be met through anticipated cash flows from operations; long-term borrowings; short-term borrowings, which may include commercial paper; credit facilities; and cash and cash equivalents. We believe that our sources of financing will be adequate to meet our future requirements.\nOperating Activities\nWe generated cash flows from operations of $1.131 billion in 2025, compared to $1.185 billion in 2024. The decline in 2025 was primarily due to changes in working capital.\nWe generated cash flows from operations of $1.185 billion in 2024, compared to $1.143 billion in 2023. The increase in 2024 was primarily due to changes in working capital. \nWe had negative working capital of $674 million as of August 3, 2025, and $1.386 billion as of July 28, 2024. Current assets were less than current liabilities, which included debt maturing in one year, due to a focus on lowering core working capital requirements. Total debt maturing within one year was $762 million as of August 3, 2025, and $1.423 billion as of July 28, 2024. We have $400 million aggregate principal amount of senior notes maturing in March 2026 that we expect to repay and/or refinance using available resources, which may include cash on hand, accessing the capital markets, commercial paper and/or revolving credit facility.\nAs part of our focus to lower core working capital requirements, we have worked with our suppliers to optimize our terms and conditions, including the extension of payment terms. Our current payment terms with our suppliers, which we deem to be commercially reasonable, generally range from 0 to 120 days. We also maintain agreements with third-party administrators that allow participating suppliers to track payment obligations from us, and, at the sole discretion of the supplier, sell those payment obligations to participating financial institutions. Our obligations to our suppliers, including amounts due and scheduled \n30 \npayment terms, are not impacted. Supplier participation in these agreements is voluntary. We have no economic interest in a supplier’s decision to enter into these agreements and no direct financial relationship with the financial institutions. We have not pledged assets as security or provided any guarantees in connection with these arrangements. The payment of these obligations is included in cash provided by operating activities in the Consolidated Statements of Cash Flows. Amounts outstanding under these programs, which are included in Accounts payable on the Consolidated Balance Sheets, were $240 million at August 3, 2025, and $243 million at July 28, 2024.\nInvesting Activities\nCapital expenditures were $426 million in 2025, $517 million in 2024 and $370 million in 2023. Capital expenditures are expected to total approximately $420 million in 2026. Capital expenditures in 2025 included network optimization for our Meals & Beverages business, chip and cracker capacity expansion for our Snacks business and enhancements to our headquarters in Camden, New Jersey. Capital expenditures in 2024 included chip and cracker capacity expansion for our Snacks business, upgrades of assets across both segments of the business, enhancements to our headquarters in Camden, New Jersey and network optimization for our Meals & Beverages business. Capital expenditures in 2023 included chip and cracker capacity expansion for our Snacks business and a new manufacturing line for our Meals & Beverages business.\nIn Snacks, we have a direct-store-delivery distribution model that uses independent contractor distributors. From time to time, we purchase and sell routes, including certain routes under our optimization initiatives. The purchase and sale proceeds of the routes are reflected in investing activities. \nOn March 12, 2024, we completed the acquisition of Sovos Brands. Cash consideration was $2.857 billion. The acquisition was funded through the 2024 DDTL Credit Agreement of $2 billion and cash on hand.\nOn February 24, 2025, we sold the noosa yoghurt business for $188 million, subject to certain customary purchase price adjustments. On August 26, 2024, we sold our Pop Secret popcorn business for $70 million. On May 30, 2023, we completed the sale of our Emerald nuts business for $41 million.\nFinancing Activities\nDividend payments were $459 million in 2025, $445 million in 2024 and $447 million in 2023. Annual dividends declared were $1.54 per share in 2025, and $1.48 per share in 2024 and 2023. The 2025 fourth quarter dividend was $.39 per share. The declaration of dividends is subject to the discretion of our Board and depends on various factors, including our net earnings, financial condition, cash requirements, future prospects and other factors that our Board deems relevant to its analysis and decision making.\nIn September 2021, the Board approved a strategic share repurchase program of up to $500 million (September 2021 program). The September 2021 program has no expiration date, but it may be suspended or discontinued at any time. Repurchases under the September 2021 program may be made in open-market or privately negotiated transactions. In September 2024, the Board authorized a new anti-dilutive share repurchase program of up to $250 million (September 2024 program) to offset the impact of dilution from shares issued under our stock compensation programs. The September 2024 program has no expiration date, but it may be discontinued at any time. Repurchases under the September 2024 program may be made in open-market or privately negotiated transactions. The September 2024 program replaced an anti-dilutive share repurchase program of up to $250 million that was approved by the Board in June 2021 and has been terminated. In 2025, we repurchased 1.303 million shares at a cost of $62 million pursuant to our anti-dilutive share repurchase program. In 2024 and 2023, we repurchased 1.56 million shares at a cost of $67 million and 2.698 million shares at a cost of $142 million, respectively. As of August 3, 2025, approximately $198 million remained available under the September 2024 program and approximately $301 million remained under the September 2021 program. See Note 16 to the Consolidated Financial Statements and \"Market for Registrant's Capital Stock, Related Shareholder Matters and Issuer Purchases of Equity Securities\" for additional information.\nOn November 15, 2022, we entered into a delayed draw term loan credit agreement (the 2022 DDTL Credit Agreement) totaling up to $500 million scheduled to mature on November 15, 2025. Loans under the 2022 DDTL Credit Agreement bear interest at the rates specified in the 2022 DDTL Credit Agreement, which vary based on the type of loan and certain other conditions. The 2022 DDTL Credit Agreement contains customary representations and warranties, affirmative and negative covenants, including a financial covenant with respect to a minimum consolidated interest coverage ratio of consolidated adjusted EBITDA to consolidated interest expense (as each is defined in the 2022 DDTL Credit Agreement) of not less than 3.25:1.00, and events of default for credit facilities of this type. We borrowed $500 million under the 2022 DDTL Credit Agreement on March 13, 2023, and used the proceeds and cash on hand to repay the 3.65% $566 million Notes that matured on March 15, 2023. On April 5, 2024, we repaid $100 million of the $500 million outstanding under the 2022 DDTL Credit Agreement. The remaining $400 million was repaid in October 2024 and November 2024 as described below.\n31 \nOn October 10, 2023, we entered into the 2024 DDTL Credit Agreement totaling up to $2 billion scheduled to mature on October 8, 2024. Loans under the 2024 DDTL Credit Agreement bear interest at the rates specified in the 2024 DDTL Credit Agreement, which vary based on the type of loan and certain other conditions. The 2024 DDTL Credit Agreement contains customary representations and warranties, affirmative and negative covenants, including a financial covenant with respect to a minimum consolidated interest coverage ratio of consolidated adjusted EBITDA to consolidated interest expense (as each is defined in the 2024 DDTL Credit Agreement) of not less than 3.25:1.00, and events of default for credit facilities of this type. The proceeds of the loans under the 2024 DDTL Credit Agreement could only be used in connection with the acquisition of Sovos Brands and the payment of fees and expenses incurred in connection therewith. On March 12, 2024, we borrowed $2 billion under the 2024 DDTL Credit Agreement and used the proceeds in order to fund the acquisition of Sovos Brands, along with the fees and expenses incurred in connection therewith.\nIn August 2023, we filed a registration statement with the SEC that registered an indeterminate amount of debt securities. Under the registration statement we may issue debt securities from time to time, depending on market conditions.\nOn March 19, 2024, pursuant to the registration statement, we issued senior unsecured notes of $2.5 billion, consisting of:\n•\n$400 million aggregate principal amount of notes bearing interest at a fixed rate of 5.30% per annum, due March 20, 2026, with interest payable semi-annually on each of March 20 and September 20 commencing September 20, 2024;\n•\n$500 million aggregate principal amount of notes bearing interest at a fixed rate of 5.20% per annum, due March 19, 2027, with interest payable semi-annually on each of March 19 and September 19 commencing September 19, 2024;\n•\n$600 million aggregate principal amount of notes bearing interest at a fixed rate of 5.20% per annum, due March 21, 2029, with interest payable semi-annually on each of March 21 and September 21 commencing September 21, 2024; and \n•\n$1 billion aggregate principal amount of notes bearing interest at a fixed rate of 5.40% per annum, due March 21, 2034, with interest payable semi-annually on each of March 21 and September 21 commencing September 21, 2024.\nThe notes contain customary covenants and events of default. If a change of control triggering event occurs, we will be required to offer to purchase the notes at a purchase price equal to 101% of the principal amount plus accrued and unpaid interest, if any, to the purchase date. \nWe used the net proceeds from the sale of the notes to repay the \n$2 billion of outstanding\n borrowings under the 2024 DDTL Credit Agreement used to fund the Sovos Brands acquisition, including fees and expenses in connection therewith, and the remainder of the net proceeds to repay commercial paper.\nOn October 2, 2024, pursuant to the registration statement, we completed the issuance of senior unsecured notes of $1.15 billion, consisting of:\n•    $800 million aggregate principal amount of notes bearing interest at a fixed rate of 4.75% per annum, due March 23, 2035, with interest payable semi-annually on each of March 23 and September 23 commencing March 23, 2025; and\n•    $350 million aggregate principal amount of notes bearing interest at a fixed rate of 5.25% per annum, due October 13, 2054, with interest payable semi-annually on each of April 13 and October 13 commencing April 13, 2025.\nThe notes contain customary covenants and events of default. If a change of control triggering event occurs, we will be required to offer to purchase the notes at a purchase price equal to 101% of the principal amount plus accrued and unpaid interest, if any, to the purchase date. In October 2024, we used a portion of the net proceeds from the issuance of the notes to repay $200 million of the $400 million outstanding under the 2022 DDTL Credit Agreement due November 15, 2025 and a portion of our outstanding commercial paper. In November 2024, we repaid the remaining $200 million outstanding under the 2022 DDTL Credit Agreement. In March 2025, we used a portion of the net proceeds from the issuance of the notes along with cash on hand and the issuance of commercial paper to repay a $1.15 billion aggregate principal amount of senior notes that matured in March 2025.\nOn April 16, 2024, we terminated our existing revolving credit facility dated September 27, 2021 (as amended on April 4, 2023). On April 16, 2024, we entered into a Five-Year Credit Agreement for an unsecured, senior revolving credit facility (the 2024 Revolving Credit Facility Agreement) in an aggregate principal amount equal to $1.85 billion with a maturity date of April 16, 2029, or such later date as extended pursuant to the terms set forth in the 2024 Revolving Credit Facility Agreement. On August 5, 2025, we entered into an Extension Agreement to extend the maturity date of the 2024 Revolving Credit Facility Agreement by one year from April 16, 2029 to April 16, 2030. The 2024 Revolving Credit Facility Agreement remained unused at August 3, 2025, except for $1 million of standby letters of credit that we issued under it. We may increase the 2024 Revolving Credit Facility Agreement commitments up to an additional $500 million, subject to the satisfaction of certain conditions. Loans under the 2024 Revolving Credit Facility Agreement will bear interest at the rates specified in the 2024 Revolving Credit Facility Agreement, which vary based on the type of loan and certain other conditions. The 2024 \n32 \nRevolving Credit Facility Agreement facility contains customary covenants, including a financial covenant with respect to a minimum consolidated interest coverage ratio of consolidated adjusted EBITDA to consolidated interest expense of not less than 3.25:1.00 and customary events of default for credit facilities of this type. The facility supports our commercial paper program and other general corporate purposes. We expect to continue to access the commercial paper markets, bank credit lines and utilize cash flows from operations to support our short-term liquidity requirements.\nAs of August 3, 2025, we had $762 million of short-term borrowings due within one year, of which $332 million was comprised of commercial paper borrowings. As of August 3, 2025, we issued $27 million of standby letters of credit.\nWe are in compliance with the covenants contained in our credit facilities and debt securities.\nCONTRACTUAL OBLIGATIONS AND OTHER COMMITMENTS\nContractual Obligations\nWe have short- and long-term material cash requirements related to our contractual obligations that arise in the normal course of business. In addition to principal and interest payments on our outstanding debt obligations, our contractual obligations primarily consist of purchase commitments, lease payments and pension and postretirement benefits.\nSee Note 13 to the Consolidated Financial Statements for a summary of our principal payments for short-term borrowings and long-term debt obligations as of August 3, 2025. Interest payments primarily for short-term borrowings and long-term debt as of August 3, 2025 are approximately as follows: $304 million in 2026; $529 million in 2027 through 2028; $388 million in 2029 through 2030; and $1.846 billion from 2031 through maturity. Interest payments are based on principal amounts and coupons or contractual rates at fiscal year end.\nPurchase commitments represent purchase orders and long-term purchase arrangements related to the procurement of ingredients, supplies, machinery, equipment, contract manufacturing and services. As of August 3, 2025, purchase commitments totaled approximately $1.966 billion. Approximately $1.403 billion of these purchase commitments will be settled in the ordinary course of business in the next 12 months and the balance of $563 million from 2027 through 2031.\nSee Note 11 to the Consolidated Financial Statements for a summary of our lease obligations as of August 3, 2025.\nAs of August 3, 2025, we have a pension liability of $98 million and a postretirement benefit obligation of $127 million. As of August 3, 2025, we also have a pension asset of $\n128\n million based on the funded status of certain plans. See Note 10 to the Consolidated Financial Statements and \"Critical Accounting Estimates\"\n \nfor further discussion of our pension and postretirement benefit obligations.\nOff-Balance Sheet Arrangements and Other Commitments\nWe guarantee approximately \n4,500\n bank loans made to independent contractor distributors by third-party financial institutions for the purchase of distribution routes. The maximum potential amount of the future payments under existing guarantees we could be required to make is $\n570\n million as of August 3, 2025. Our guarantees are indirectly secured by the distribution routes. We do not expect that we will be required to make material guarantee payments as a result of defaults on the bank loans guaranteed.\nThese obligations and commitments impact our liquidity and capital resource needs. We expect foreseeable liquidity and capital resource requirements to be met through anticipated cash flows from operations; long-term borrowings; short-term borrowings, which may include commercial paper; credit facilities; and cash and cash equivalents. We believe that our sources of financing will be adequate to meet our future requirements.\nMARKET RISK SENSITIVITY\nThe principal market risks to which we are exposed are changes in foreign currency exchange rates, interest rates and commodity prices. In addition, we are exposed to price changes related to certain deferred compensation obligations. We manage our foreign currency exposures by utilizing foreign exchange forward and option contracts. We enter into foreign exchange forward and option contracts for periods consistent with related underlying exposures, and the contracts do not constitute positions independent of those exposures. We manage our exposure to changes in interest rates by optimizing the use of variable-rate and fixed-rate debt and we may utilize interest rate swaps in order to maintain our variable-to-total debt ratio within targeted guidelines. We principally use a combination of purchase orders and various short- and long-term supply arrangements in connection with the purchase of raw materials, including certain commodities and agricultural products. We also enter into commodity futures, options and swap contracts to reduce the volatility of price fluctuations of wheat, diesel fuel, natural gas, soybean oil, cocoa, aluminum, soybean meal and corn. We do not enter into derivative contracts for speculative purposes and do not use leveraged instruments. \nThe information below summarizes our market risks associated with significant financial instruments as of August 3, 2025. Fair values included herein have been determined based on quoted market prices or pricing models using current market rates. \n33 \nThe information presented below should be read in conjunction with Notes 13, 14 and 15 to the Consolidated Financial Statements. \nWe are exposed to foreign currency exchange risk, primarily the Canadian dollar and Euro, related to intercompany transactions and third-party transactions. We utilize foreign exchange forward and option contracts to hedge these exposures. The notional amounts of the contracts as of August 3, 2025, and July 28, 2024, were $596 million and $297 million, respectively. The aggregate fair value of all contracts was a loss of $1 million as of August 3, 2025, and a gain of $2 million as of July 28, 2024. A hypothetical 10% fluctuation in exchange rates would impact the fair value of our outstanding foreign exchange contracts by approximately $32 million as of August 3, 2025, and $16 million as of July 28, 2024, which would generally be offset by inverse changes on the underlying hedged items.\nAs of August 3, 2025, we had outstanding variable-rate debt of $332 million with an average interest rate of 4.69%. As of July 28, 2024, we had outstanding variable-rate debt of $650 million with an average interest rate of 6.20%. A hypothetical 100-basis-point increase in average interest rates applied to our variable-rate debt balances throughout 2025 and 2024 would have increased annual interest expense in those years by approximately $3 million and $7 million, respectively.\nAs of August 3, 2025, we had outstanding fixed-rate debt of $6.583 billion with a weighted average interest rate of 4.57%. As of July 28, 2024, we had outstanding fixed-rate debt of $6.584 billion with a weighted average interest rate of 4.38%. The fair value of fixed-rate debt was $6.213 billion as of August 3, 2025 and $6.216 billion as of July 28, 2024. As of August 3, 2025, and July 28, 2024, a hypothetical 100-basis-point increase in interest rates would decrease the fair value of our fixed-rate debt by approximately $367 million and $312 million, respectively, while a hypothetical 100-basis-point decrease in interest rates would increase the fair value of our fixed-rate debt by approximately $417 million and $348 million, respectively. The impact of market interest rate fluctuations on our long-term debt does not affect our results of operations or financial position.\nWe manage our exposure to changes in interest rates by \noptimizin\ng the use of variable-rate and fixed-rate debt. From time to time, we may use interest rate swaps in order to maintain our variable-to-total debt ratio within targeted guidelines. We manage our exposure to interest volatility on future debt issuances by entering into forward starting interest rate swaps or treasury lock contracts to hedge the rate on the interest payments related to the anticipated debt issuance. There were \nno\n forward starting interest rate swaps or treasury lock contracts outstanding as of August 3, 2025 and July 28, 2024. In conjunction with the issuance of senior unsecured notes on October 2, 2024, due on March 23, 2035, we settled forward starting interest rate swaps with a notional value of $700 million at a gain of less than $1 million. We settled forward starting interest rate swaps with a notional value of $1.1 billion in March 2024 at a loss of $11 million. The gains and losses on these instruments were recorded in other comprehensive income (loss) and will be recognized in Interest expense over the respective lives of the debt.\nWe enter into commodity futures, options and swap contracts, and a supply contract under which prices for certain raw materials are established based on anticipated volume requirements to reduce the volatility of price fluctuations for commodities. As of August 3, 2025, the total notional amount of the contracts was $233 million, and the aggregate fair value of the contracts was a gain of $1 million. As of July 28, 2024, the total notional amount of the contracts was $248 million, and the aggregate fair value of the contracts was a loss of $10 million. A hypothetical 10% fluctuation in commodity prices would impact the fair value of our outstanding commodity contracts by approximately $23 million as of August 3, 2025, and $24 million as of July 28, 2024, which would generally be offset by inverse changes on the underlying hedged items.\nWe enter into swap contracts which hedge a portion of exposures relating to the total return of certain deferred compensation obligations. The notional amount of the contracts was $\n76\n million as of August 3, 2025, and $\n71\n million as of July 28, 2024. The fair value of the contracts was a gain of $1 million as of August 3, 2025, and a gain of $3 million as of July 28, 2024. A hypothetical 10% fluctuation in equity price changes would impact the fair value of our outstanding swap contracts by $8 million as of August 3, 2025, and $7 million as of July 28, 2024, which would generally be offset by inverse changes on the underlying hedged items.\nCRITICAL ACCOUNTING ESTIMATES\nWe prepare our consolidated financial statements in conformity with accounting principles generally accepted in the United States. The preparation of these financial statements requires the use of estimates, judgments and assumptions that affect the reported amounts of assets and liabilities at the date of the financial statements and reported amounts of revenues and expenses during the periods presented. Actual results could differ from those estimates and assumptions. See Note 1 to the Consolidated Financial Statements for a discussion of significant accounting policies. The following areas all require the use of subjective or complex judgments, estimates and assumptions: \nTrade and consumer promotion programs — \nWe offer various sales incentive programs to customers and consumers, such as feature price discounts, in-store display incentives, cooperative advertising programs, new product introduction fees and coupons. The mix between these forms of variable consideration, which are classified as reductions in revenue and recognized upon sale, and advertising or other marketing activities, which are classified as marketing and selling expenses, fluctuates between periods based on our overall marketing plans. The measurement and recognition of the costs for trade and consumer \n34 \npromotion programs involves the use of judgment related to performance and redemption estimates. Estimates are made based on historical experience and other factors, including expected volume. Typically, programs that are offered have a very short duration. Historically, the difference between actual experience compared to estimated redemptions and performance has not been significant to the quarterly or annual financial statements. Differences between estimates and actual costs are recognized as a change in estimate in a subsequent period. However, actual expenses may differ if the level of redemption rates and performance were to vary from estimates. Accrued trade and consumer promotion liabilities as of August 3, 2025 and July 28, 2024 were $159 million and $186 million, respectively.\nValuation of long-lived assets — \nFixed assets and amortizable intangible assets are reviewed for impairment as events or changes in circumstances occur indicating that the carrying value of the asset may not be recoverable. Undiscounted cash flow analyses are used to determine if the carrying amount of the asset is recoverable. If impairment is determined to exist, the charge is calculated based on estimated fair value.\nGoodwill and intangible assets deemed to have indefinite lives are not amortized but rather are tested at least annually in the fourth quarter for impairment, or more often if events or changes in circumstances indicate that the carrying amount of the asset may be impaired.\nGoodwill is tested for impairment at the reporting unit level. A reporting unit represents an operating segment or a component of an operating segment. Goodwill is tested for impairment by either performing a qualitative evaluation or a quantitative test. The qualitative evaluation is an assessment of factors to determine whether it is more likely than not that the fair value of a reporting unit is less than its carrying amount, including goodwill. We may elect not to perform the qualitative assessment for some or all reporting units and perform a quantitative impairment test. Fair value is determined based on discounted cash flow analyses. The discounted estimates of future cash flows include significant management assumptions such as revenue growth rates, operating margins, weighted average costs of capital and future economic and market conditions. If the carrying value of the reporting unit exceeds fair value, goodwill is considered impaired. An impairment charge is recognized for the amount by which the carrying value of the reporting unit exceeds fair value, limited to the amount of goodwill in the reporting unit.\nIndefinite-lived intangible assets are tested for impairment by comparing the fair value of the asset to the carrying value. Fair value is determined using a relief from royalty valuation method based on discounted cash flow analyses that include significant management assumptions such as revenue growth rates, weighted average costs of capital and assumed royalty rates. If the carrying value exceeds fair value, an impairment charge will be recorded to reduce the asset to fair value.\n2024 Assessments\nIn the fourth quarter of 2024, we recognized an impairment charge of $\n53\n million\n on certain salty snacks and cookie trademarks within our Snacks segment, including \nTom’s\n,\n Jays, Kruncher’s\n,\n O-Ke-Doke\n,\n Stella D’oro \nand\n Archway\n,\n \ncollectively referred to as our \"Allied brands.\" In 2024, sales and operating performance were below expectations due in part to competitive pressure and reduced margins. In the fourth quarter of 2024, based on recent performance and the reevaluation of the position of the Allied brands within our portfolio, we lowered our near-term and long-term outlook for future sales and operating performance, reducing the carrying value of the trademarks to $\n43\n million.\nIn the fourth quarter of 2024, we performed an impairment assessment on the assets in our Pop Secret popcorn business within our Snacks segment as sales and operating performance were below expectations due in part to competitive pressure and reduced margins, and as we pursued divesting the business. As a result of these factors, in the fourth quarter of 2024, we lowered our long-term outlook for the business and recognized an impairment charge of $\n76\n million\n on the trademark, reducing the carrying value of the trademark to $\n28\n million. The sale of the business was completed on August 26, 2024.\n2025 Assessments\nAs of August 3, 2025, the carrying value of goodwill was $4.991 billion. Based on our assessments, all of our reporting units had fair values that significantly exceeded carrying values.\nDuring the second quarter of 2025, we performed an interim impairment assessment on our Allied brands trademarks as our sales performance was below expectations. In the second quarter of 2025, based on recent performance, we lowered our long-term outlook and recognized an impairment charge of $\n15\n million\n on the trademarks, reducing the carrying value to $\n28\n million.\nDuring the second quarter of 2025, we performed an interim impairment assessment on the \nLate July \ntrademark within our Snacks segment as our sales performance was below expectations. In the second quarter of 2025, based on recent performance, we lowered our long-term outlook and recognized an impairment charge of $\n11\n million\n on the trademark, reducing the carrying value to $\n47\n million.\nDuring the third quarter of 2025, we performed an interim impairment assessment on the \nSnyder's of Hanover\n trademark within our Snacks segment as our sales and operating performance were below expectations. In the third quarter of 2025, based on recent performance, we lowered our long-term outlook and recognized an impairment charge of $\n150\n million\n on the \n35 \ntrademark, reducing the carrying value to $\n470\n million.\nAs of August 3, 2025, the carrying value of indefinite-lived trademarks was $3.678 billion as detailed below:\n(Millions)\nRao's\n$\n1,470\n \nSnyder's of Hanover\n470\n \nLance\n350\n \nKettle Brand\n318\n \nPace\n292\n \nPacific Foods\n280\n \nCape Cod\n187\n \nVarious other Snacks\n(1)\n311\n \nTotal\n$\n3,678 \n_____________________________________\n(1)\nIncludes the \nLate July \nand Allied brands trademarks.\nAs of the 2025 annual impairment testing, indefinite-lived trademarks with approximately 10% or less of excess coverage of fair value over carrying value had an aggregate carrying value of $\n2.587\n billion and included\n \nthe \nRao's\n, \nSnyder's of Hanover\n,\n Pace\n,\n Pacific Foods\n,\n Late July \nand Allied brands trademarks. Although assumptions are generally interdependent and do not change in isolation, sensitivities to changes are provided below. Holding all other assumptions in our 2025 impairment testing constant, changes in the assumptions below would reduce fair value of trademarks and result in impairment charges of approximately:\n(Millions)\nRao's\nSnyder's of Hanover\nPace\nPacific Foods\nLate July\nAllied brands\n1% increase in the weighted-average cost of capital\n$\n95 \n$\n65 \n$\n20 \n$\n25 \n$\n5 \n$\n5 \n1% reduction in revenue growth\n$\n— \n$\n25 \n$\n5 \n$\n— \n$\n5 \n$\n5 \n1% decrease in royalty rate\n$\n15 \n$\n45 \n$\n10 \n$\n30 \n$\n25 \n$\n10 \nWhile the 1% changes in assumptions would not result in impairment charges on our other trademarks, some changes would result in a fair value exceeding carrying value by less than 15% for the \nLance\n,\n Kettle Brand \nand\n Cape Cod \ntrademarks.\nThe estimates of future cash flows used in impairment testing involve significant management judgment, and are based upon assumptions about expected future operating performance, assumed royalty rates, economic conditions, market conditions and cost of capital. Inherent in estimating the future cash flows are uncertainties beyond our control, such as changes in capital markets. The actual cash flows could differ materially from management’s estimates due to changes in business conditions, operating performance and economic conditions, including the potential impact of tariffs. If our assumptions change or market conditions decline, potential impairment charges could result. \nSee also Note 6 to the Consolidated Financial Statements for additional information on goodwill and intangible assets.\nPension and postretirement benefits — \nWe provide certain pension and postretirement benefits to employees and retirees. Determining the cost associated with such benefits is dependent on various actuarial assumptions, including discount rates, expected return on plan assets, compensation increases, turnover rates and health care trend rates. Independent actuaries, in accordance with accounting principles generally accepted in the United States, perform the required calculations to determine expense. Actuarial gains and losses are recognized immediately in Other expenses / (income) in the Consolidated Statements of Earnings as of the measurement date, which is our fiscal year end, or more frequently if an interim remeasurement is required. We use the fair value of plan assets to calculate the expected return on plan assets.\nIn establishing the discount rate, we review published market indices of high-quality debt securities, adjusted as appropriate for duration. In addition, independent actuaries apply high-quality bond yield curves to the expected benefit payments of the plans. We use a full yield curve approach to estimate service cost and interest cost by applying the specific spot rates along the yield curve used to determine the benefit obligation of the relevant projected cash flows.\nThe expected return on plan assets is a long-term assumption based upon historical experience and expected future performance, considering our current and projected investment mix. This estimate is based on an estimate of future inflation, long-term projected real returns for each asset class and a premium for active management. Within any given fiscal period, significant differences may arise between the actual return and the expected return on plan assets. Gains and losses resulting from differences between actual experience and the assumptions are determined at each measurement date. \n36 \nAs of August 3, 2025, we have a pension liability of $98 million and a postretirement benefit obligation of $127 million. As of August 3, 2025, we also have a pension asset of $\n128\n million based on the funded status of certain plans.\nNet periodic pension and postretirement benefit expense (income) and actuarial losses (gains) included within net periodic pension and benefit expense (income) were as follows:\n(Millions)\n2025\n2024\n2023\nTotal net periodic pension and postretirement benefit expense (income)\n$\n24\n \n$\n39 \n$\n(22)\nActuarial losses (gains)\n$\n24\n \n$\n33 \n$\n(15)\nThe actuarial losses recognized in 2025 were primarily due to gains on plan assets that were less than the expected return, partially offset by increases in the discount rates used to determine the benefit obligation and plan experience. The actuarial losses recognized in 2024 were primarily due to decreases in discount rates used to determine the benefit obligation and plan experience, partially offset by gains on plan assets. The actuarial gains recognized in 2023 were primarily due to increases in discount rates used to determine the benefit obligation, partially offset by losses on plan assets and plan experience.\nSignificant weighted-average assumptions as of the end of the year were as follows:\n2025\n2024\n2023\nPension\nDiscount rate for benefit obligations\n5.41\n%\n5.28\n%\n5.46%\nExpected return on plan assets\n6.63%\n6.40%\n6.38%\nPostretirement\nDiscount rate for obligations\n5.26\n%\n5.23\n%\n5.47%\nBased on benefit obligations and plan assets as of August 3, 2025, estimated sensitivities to 2026 annual net periodic pension and postretirement cost are as follows: \n•\na 50-basis-point increase in the discount rate would result in expense of approximately $4 million and would result in an immediate actuarial gain recognition of approximately $39 million; \n•\na 50-basis-point decline in the discount rate would result in income of approximately $5 million and would result in an immediate actuarial loss recognition of approximately $43 million; and \n•\na 50-basis-point reduction in the estimated return on assets assumption would result in expense of approximately $6 million.\nContributions to pension plans were not material in 2025, 2024 and 2023 and are not expected to be material in 2026.\nSee also Note 10 to the Consolidated Financial Statements for additional information on pension and postretirement benefits.\nIncome taxes — \nThe effective tax rate reflects statutory tax rates, tax planning opportunities available in the various jurisdictions in which we operate and management’s estimate of the ultimate outcome of various tax audits and issues. Significant judgment is required in determining the effective tax rate and in evaluating tax positions. Income taxes are recorded based on amounts refundable or payable in the current year and include the effect of deferred taxes. Deferred tax assets and liabilities are recognized for the future impact of differences between the financial statement carrying amounts of assets and liabilities and their respective tax bases, as well as for operating loss and tax credit carryforwards. Deferred tax assets and liabilities are measured using enacted tax rates expected to apply to taxable income in the years in which those differences are expected to be recovered or settled. Valuation allowances are established for deferred tax assets when it is more likely than not that a tax benefit will not be realized.\nSee also Notes 1 and 12 to the Consolidated Financial Statements for further discussion on income taxes. \nRECENT ACCOUNTING PRONOUNCEMENTS\nSee Note 2 to the Consolidated Financial Statements for information on recent accounting pronouncements.\n37 \nCAUTIONARY FACTORS THAT MAY AFFECT FUTURE RESULTS\nThis Report contains \"forward-looking\" statements within the meaning of the Private Securities Litigation Reform Act of 1995. These forward-looking statements reflect our current expectations regarding our future results of operations, economic performance, financial condition and achievements. These forward-looking statements can be identified by words such as \"anticipate,\" \"believe,\" \"estimate,\" \"expect,\" \"intend,\" \"plan,\" \"pursue,\" \"strategy,\" \"target,\" \"will\" and similar expressions. One can also identify forward-looking statements by the fact that they do not relate strictly to historical or current facts, and may reflect anticipated cost savings or implementation of our strategic plan. These statements reflect our current plans and expectations and are based on information currently available to us. They rely on several assumptions regarding future events and estimates which could be inaccurate and which are inherently subject to risks and uncertainties.\nWe wish to caution the reader that the following important factors and those important factors described in Part 1, Item 1A and elsewhere in this Report, or in our other SEC filings, could affect our actual results and could cause such results to vary materially from those expressed in any forward-looking statements made by, or on behalf of, us:\n•\ndeclines or volatility in financial markets, deteriorating economic conditions and other external factors, including the impact and application of new or changes to existing governmental laws, regulations, and policies;\n•\nthe risks associated with imposed and threatened tariffs by the U.S. and reciprocal tariffs by its trading partners;\n•\nthe risks related to the availability of, and cost inflation in, supply chain inputs, including labor, raw materials, commodities, packaging and transportation, including those related to tariffs;\n•\ndisruptions in or inefficiencies to our supply chain and/or operations, including reliance on key contract manufacturer and supplier relationships;\n•\nour ability to execute on and realize the expected benefits from our strategy, including sales growth in and/or maintenance of our market share position in snacks, soups, sauces and beverages;\n•\nthe impact of strong competitive responses to our efforts to leverage brand power with product innovation, promotional programs and new advertising;\n•\nthe risks associated with trade and consumer acceptance of product improvements, shelving initiatives, new products and pricing and promotional strategies;\n•\nchanges in consumer demand for our products and favorable perception of our brands;\n•\nthe risk that the cost savings and any other synergies from the Sovos Brands transaction may not be fully realized or may take longer or cost more to be realized than expected, including that the Sovos Brands transaction may not be accretive to the extent anticipated;\n•\nour ability to realize projected cost savings and benefits from cost savings initiatives and the integration of recent acquisitions;\n•\nrisks related to the effectiveness of our hedging activities and our ability to respond to volatility in commodity prices;\n•\nour ability to manage changes to our organizational structure and/or business processes, including selling, distribution, manufacturing and information management systems or processes;\n•\nchanging inventory management practices by certain of our key customers;\n•\na changing customer landscape, with value and e-commerce retailers expanding their market presence, while certain of our key customers maintain significance to our business;\n•\nproduct quality and safety issues, including recalls and product liabilities;\n•\nthe possible disruption to the independent contractor distribution models used by certain of our businesses, including as a result of litigation or regulatory actions affecting their independent contractor classification;\n•\nthe uncertainties of litigation and regulatory actions against us;\n•\na disruption, failure or security breach of our or our vendors' information technology systems, including ransomware attacks;\n•\nimpairment to goodwill or other intangible assets;\n•\nour ability to protect our intellectual property rights;\n•\nincreased liabilities and costs related to our defined benefit pension plans;\n•\nour ability to attract and retain key talent;\n•\ngoals and initiatives related to, and the impacts of, climate change, including from weather-related events;\n38 \n•\nthe costs, disruption and diversion of management's attention associated with activist investors;\n•\nour indebtedness and ability to pay such indebtedness;\n \nand\n•\nunforeseen business disruptions or other impacts due to political instability, civil disobedience, terrorism, geopolitical conflicts, extreme weather conditions, natural disasters, pandemics or other outbreaks of disease or other calamities.\nThis discussion of uncertainties is by no means exhaustive but is designed to highlight important factors that may impact our outlook. We disclaim any obligation or intent to update forward-looking statements made by us in order to reflect new information, events or circumstances after the date they are made.",
  "item2": null
}