{
  "source_file": "crm-20250731.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "ITEM 2. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThis Quarterly Report on Form 10-Q contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. All statements other than statements of historical fact, which may consist of, among other things, trend analyses and statements regarding future events, future financial performance, anticipated growth, and industry prospects, are forward-looking. Words such as “aims,” “anticipates,” “assumes,” “believes,” “commitments,” “could,” “estimates,” “expects,” “forecasts,” “foresees,” “goals,” “intends,” “may,” “plans,” “predicts,” “projects,” “seeks,” “should,” “targets” and “would,”  and variations of such words and similar expressions are intended to identify such forward-looking statements. These forward-looking statements are inherently uncertain and based on management’s current expectations and assumptions, which are subject to risks and uncertainties that are difficult to predict, including those related to the Company’s pending acquisition of Informatica Inc. and those described in Part I, Item 2, “Management’s Discussion and Analysis of Financial Condition and Results of Operations,” Part I, Item 3, “Quantitative and Qualitative Disclosures About Market Risk,” Part II, Item 1A, “Risk Factors,” and elsewhere in this Quarterly Report on Form 10-Q. Moreover, we operate in a very competitive and rapidly changing environment and new risks emerge from time to time. It is not possible for our management to predict all risks, nor can we assess the impact of all factors on our business or the extent to which any factor, or combination of factors, may cause actual results or outcomes to differ materially from those contained in any forward-looking statements. \nIn light of these and other risks and uncertainties, the future events and trends discussed in this Quarterly Report on Form 10-Q may not occur as we expect or at all, and our actual results or outcomes may differ materially and adversely from those expressed or implied in our forward-looking statements. Readers are cautioned not to place undue reliance on such forward-looking statements. Except as required by law, we undertake no obligation to revise or update publicly any forward-looking statements for any reason.\nOverview\nSalesforce is a global leader in customer relationship management (“CRM”) technology, enabling companies of every size and industry to connect with their customers through the power of data, artificial intelligence (“AI”), CRM and trust. Founded in 1999, we bring humans together with AI agents to drive customer success on one deeply unified platform.\nOur platform unites sales, service, marketing, commerce and IT teams by connecting customer data across systems, apps and devices to create a complete view of customers. With this single source of customer truth and integrated AI, teams can be more responsive, productive and efficient, deliver intelligent, personalized experiences across every channel and increase productivity. During the third quarter of fiscal 2025, we introduced Agentforce, a new layer of our trusted platform that enables companies to build and deploy AI agents that can respond to inputs, make decisions and take action autonomously across business functions. Agentforce includes a suite of customizable agents for use across sales, service, marketing and commerce. We continue to invest for growth, including investing in generative and agentic AI across all products, which we believe will change how our customers help their customers, and continuously look to expand our leadership role in the cloud computing industry.\nWe continue to focus on several key growth levers, including driving multiple service offering adoption, increasing our penetration with enterprise and international customers and expanding our industry-specific reach with more vertical software solutions. These growth levers often require a more sophisticated go-to-market approach and, as a result, we may incur additional costs upfront to obtain new customers and expand our relationships with existing customers, including additional sales and marketing expenses specific to subscription and support revenue. As a result, we have seen that customers with many of these characteristics drive higher annual revenues and have lower attrition rates than our company average. In addition to these growth levers, our mergers and acquisitions framework has included several acquisitions that accelerate our agentic roadmap, including our recently announced acquisition of Regrello Corp. (“Regrello”). These acquisitions, along with our pending acquisition of Informatica Inc. (“Informatica”), are bringing in key talent and technology to accelerate innovation.\nWe are also focused on reducing our operating expenses to improve our operating margin. We have undertaken various restructuring initiatives to improve operating margins and continue advancing our ongoing commitment to profitable growth which included a reduction of our workforce and office space reductions within certain markets. We continue to evaluate and operationalize future programs to drive further operational efficiencies, optimize our management structure and increase cost optimization efforts to realize long-term sustainable growth. We expect to continue to experience improvements in our operating expenses as a percentage of revenue, which could include various restructuring initiatives or measured hiring initiatives to drive operational efficiencies. \nHighlights from First Six Months of Fiscal 2026\n•\nRevenue: \nFor the six months ended July 31, 2025, revenue was \n$20.1 billion\n, an increase of \nnine percent \nyear-over-year. \n•\nIncome from Operations:\n For the six months ended July 31, 2025, income from operations was \n$4.3 billion\n as compared to \n$3.5 billion\n from a year ago. Operating margin, which represents income from operations as a percentage \n29\nTable of Contents\nof total revenue, increased to approximately \n22 percent\n for the six months ended July 31, 2025 compared to approximately\n 19 percent\n in the prior year period.\n•\nNet Income per Share:\n For \nthe six months ended July 31, 2025\n, diluted net income per share was \n$3.55\n as compared to diluted net income per share of $3.03 from a year ago. \n•\nCash: \nCash provided by operations for the six months ended July 31, 2025 was $7.2 billion\n, an increase of one percent year-over-year. Total cash, cash equivalents and marketable securities as of July 31, 2025 was \n$15.4 billion.\n \n•\nRemaining Performance Obligation:\n Total remaining performance obligation, which represents all future revenue under contract yet to be recognized, as of July 31, 2025 was approximately \n$59.9 billion, an increase of 12 percent year-over-year\n. Current remaining performance obligation as of July 31, 2025 was approximately \n$29.4 billion\n, an increase of \n11 percent\n year-over-year. \n•\nShare Repurchase Program: \nDuring the six months ended July 31, 2025, we repurchased approximately 18 million shares of our common stock for approximately $4.9 billion.\n•\nDividend Program\n: During the six months ended July 31, 2025, we paid approximately $801 million in dividends and dividend equivalents. \n•\nPending Informatica Acquisition:\n During the six months ended July 31, 2025, we announced our pending acquisition of Informatica, an AI-powered enterprise cloud data management platform, which is expected to close in the fourth quarter of fiscal 2026 or early fiscal 2027, subject to the satisfaction of customary closing conditions, including regulatory approvals, for an estimated $8.0 billion, net of the Company’s current investment in Informatica.\nOver the first half of fiscal 2026, we continued to see strong momentum in Data Cloud, Agentforce and our broader AI service offerings. As we have a diversified portfolio of products and a customer base across various geographies, segments and industries, demand for our offerings has remained relatively resilient in a changing economic environment.\nIn addition, the expanding global scope of our business and the heightened volatility of global markets expose us to the risk of fluctuations in foreign currency markets. Total revenues in the six months ended July 31, 2025 were minimally impacted by foreign currency fluctuations compared to the six months ended July 31, 2024. Our current remaining performance obligation growth as of July 31, 2025 compared to July 31, 2024 was positively impacted by one percent compared to what would have been reported using constant currency rates. The impact of foreign currency fluctuations could impact our near-term results and ability to accurately predict our future results and earnings. The impact of these fluctuations can also be compounded by the seasonality of our business in which our fourth quarter has historically been our strongest quarter for new business and renewals.\nFiscal Year\nOur fiscal year ends on January 31. References to fiscal 2026, for example, refer to the fiscal year ending January 31, 2026.\nOperating Segments\nWe operate as one segment. See Note 1 “Summary of Business and Significant Accounting Policies” to the condensed consolidated financial statements for further discussion. \nSources of Revenues\nWe derive our revenues from two sources: (1) subscription and support revenues and (2) professional services and other revenues. Subscription and support revenues accounted for approximately \n95 percent\n of our total revenues for the six months ended July 31, 2025. \nSubscription and support revenues primarily include subscription fees from customers accessing our enterprise cloud computing services (collectively, “Cloud Services”), software license revenues from the sales of term software licenses, and support revenues from the sale of support and updates beyond the basic subscription fees or related to the sales of software licenses. Our Cloud Services allow customers to use our multi-tenant software without taking possession of the software. Revenue is generally recognized ratably over the contract term. Subscription and support revenues also include revenues associated with term software licenses that provide the customer with a right to use the software as it exists when made available. Revenues from term software licenses are generally recognized at the point in time when the software is made available to the customer. Revenue from support and updates is recognized as such support and updates are provided, which is generally ratably over the contract term. Changes in contract duration for multi-year term software licenses can impact the amount of revenues recognized upfront. Revenues from term software licenses represent less than\n ten percent\n of total subscription and support revenue for the three and six months ended July 31, 2025.\nThe revenue growth rates of each of our service offerings, as described below in “Results of Operations,” fluctuate from quarter to quarter and over time. Additionally, we manage the total balanced product portfolio to deliver solutions to our \n30\nTable of Contents\ncustomers and, as a result, the revenue result for each offering is not necessarily indicative of the results to be expected for any subsequent quarter. In addition, some of our Cloud Service offerings have similar features and functions. For example, customers may use our Sales, Service or Platform service offerings to record account and contact information, which are similar features across these service offerings. Depending on a customer’s actual and projected business requirements, more than one service offering may satisfy the customer’s current and future needs. We record revenue based on the individual products ordered by a customer, not according to the customer’s business requirements and usage.\nOur growth in revenues is also impacted by attrition. Attrition represents the reduction or loss of the annualized value of our contracts with customers. We calculate our attrition rate at a point in time on a trailing twelve-month basis as of the end of each month. In general, we exclude service offerings from acquisitions from our attrition calculation until they are fully integrated into our customer success organization. As of July 31, 2025, our attrition rate, excluding Slack self-service, was approximately eight percent.\nWe continue to maintain a variety of customer programs and initiatives, which, along with increasing enterprise adoption, have helped keep our attrition rate consistent as compared to the prior year. Consistent attrition rates play a role in our ability to maintain growth in our subscription and support revenues. \nSeasonal Nature of Unearned Revenue, Accounts Receivable and Operating Cash Flow\nUnearned revenue primarily consists of billings to customers for our subscription service. Over 90 percent of the value of our billings to customers is for our subscription and support service. We generally invoice our customers in advance, in annual installments, and typical payment terms provide that our customers pay us within 30 days of invoice. Amounts that have been invoiced are recorded in accounts receivable and in unearned revenue or in revenue depending on whether transfer of control to customers has occurred. In general, we collect our billings in advance of the subscription service period. We typically issue renewal invoices in advance of the renewal service period, and depending on timing, the initial invoice for the subscription and services contract and the subsequent renewal invoice may occur in different quarters. There is a disproportionate weighting toward annual billings in the fourth quarter, primarily as a result of large enterprise account buying patterns. Our fourth quarter has historically been our strongest quarter for new business and renewals. The year-on-year compounding effect of this seasonality in both billing patterns and overall new and renewal business causes the value of invoices that we generate in the fourth quarter for both new business and renewals to increase as a proportion of our total annual billings. Accordingly, because of this billing activity, our first quarter is typically our largest collections and operating cash flow quarter. Generally, our second or third quarter has historically been our smallest operating cash flow quarter\n. \nUnearned revenues, accounts receivable and operating cash flow may also be impacted by acquisitions. For example, operating cash flows may be adversely impacted by acquisitions due to transaction costs, financing costs such as interest expense and lower operating cash flows from the acquired entity. \nRemaining Performance Obligation \nOur remaining performance obligation represents all future revenue under contract that has not yet been recognized as revenue and includes unearned revenue and unbilled amounts. Our current remaining performance obligation represents future revenue under contract that is expected to be recognized as revenue in the next 12 months.\n Remaining performance obligation is not necessarily indicative of future revenue growth and is influenced by several factors, including seasonality, the timing of renewals, average contract terms, foreign currency exchange rates and fluctuations in new business growth. Remaining performance obligation is also impacted by acquisitions. Unbilled portions of the remaining performance obligation denominated in foreign currencies are revalued each period based on the period end exchange rates. For multi-year subscription agreements billed annually, the associated unbilled balance and corresponding remaining performance obligation are typically high at the beginning of the contract period, zero just prior to renewal, and increase if the agreement is renewed. Low remaining performance obligation attributable to a particular subscription agreement is often associated with an impending renewal but may not be an indicator of the likelihood of renewal or future revenue from such customer. Changes in contract duration or the timing of delivery of professional services can impact remaining performance obligation as well as the allocation between current and non-current remaining performance obligation.\nCost of Revenues and Operating Expenses\nCost of Revenues\nCost of subscription and support revenues primarily consists of expenses related to our employee-related costs, which includes salaries, benefits and stock-based compensation expense, delivering our service and providing support, including the costs of data center capacity, certain fees paid to various third parties for the use of their technology, services and data, and allocated overhead. Our cost of subscription and support revenues also includes amortization of certain acquisition-related intangible assets, such as the amortization of the cost associated with an acquired company’s research and development efforts. \n31\nTable of Contents\nAlso included in the cost of subscription and support revenues are expenses incurred supporting the free user base of Slack, including third-party hosting costs and employee-related costs specific to customer experience and technical operations.\nCost of professional services and other revenues consists primarily of employee-related costs associated with these services, the cost of subcontractors, certain third-party fees and allocated overhead. We believe that our professional services organization facilitates the adoption of our service offerings, helps us to secure larger subscription revenue contracts and supports our customers’ success. The cost of professional services may exceed revenues from professional services in future fiscal periods.\nResearch and Development\nResearch and development expenses consist primarily of employee-related costs for our engineering staff associated with product development, as well as allocated overhead. \nSales and Marketing\n \nSales and marketing expenses make up the majority of our operating expenses and consist primarily of employee-related costs and commissions for our sales and marketing staff, as well as payments to partners, marketing programs and allocated overhead. Marketing programs consist of advertising, events, corporate communications, brand building and product marketing activities. We capitalize certain costs to obtain customer contracts, such as commissions, and amortize these costs on a straight-line basis. As such, the timing of expense recognition for these commissions is not consistent with the timing of the associated cash payment. \nOur sales and marketing expenses include amortization of certain acquisition-related intangible assets, such as the amortization of the cost associated with an acquired company’s trade names, customer lists and customer relationships. \nGeneral and Administrative\n \nGeneral and administrative expenses consist primarily of employee-related costs for finance and accounting, legal, internal audit, human resources and management information systems personnel, as well as professional services fees and allocated overhead. \nWe allocate overhead such as information technology infrastructure, rent, occupancy charges and certain employee benefits based on headcount. As such, these types of expenses are reflected in each cost of revenue and operating expense category.\nRestructuring\nRestructuring consists of charges related to employee transition, severance payments, employee benefits and stock-based compensation as well as impairment charges associated with long-lived assets. Restructuring excludes allocated overhead.\nCritical Accounting Policies and Estimates\nOur condensed consolidated financial statements are prepared in accordance with accounting principles generally accepted in the United States. The preparation of these condensed consolidated financial statements requires us to make estimates and assumptions that affect the reported amounts of assets, liabilities, revenues, costs and expenses, and related disclosures. On an ongoing basis, we evaluate our estimates and assumptions. Our actual results may differ from these estimates under different assumptions or conditions.\nWe believe that of our significant accounting policies, which are described in Note 1 “Summary of Business and Significant Accounting Policies” to our condensed consolidated financial statements, the following accounting policies and specific estimates involve a greater degree of judgment and complexity. Accordingly, these are the policies and estimates we believe are the most critical to aid in fully understanding and evaluating our consolidated financial condition and results of operations:\n•\nthe standalone selling price (“SSP”) of performance obligations for revenue contracts with multiple performance obligations;\n•\nthe valuation of privately held strategic investments; \n•\nthe fair value of assets acquired and liabilities assumed for business combinations;\n•\nthe recognition, measurement and valuation of current and deferred income taxes and uncertain tax positions;\n•\nthe useful lives of intangible assets; and\n•\nthe fair value of certain stock awards issued.\nThese estimates may change, as new events occur and additional information is obtained, and such changes will be recognized in the condensed consolidated financial statements as soon as they become known. Actual results could differ from these estimates and any such differences may be material to our financial statements.\n32\nTable of Contents\nAdditionally, refer to the “Management’s Discussion and Analysis of Financial Condition and Results of Operations” in Part II, Item 7 of our Annual Report on Form 10-K for the fiscal year ended January 31, 2025 for further discussion with respect to these policies and estimates. \nRecent Accounting Pronouncements\nSee Note 1 “Summary of Business and Significant Accounting Policies” to the condensed consolidated financial statements for our discussion about new accounting pronouncements. \nResults of Operations\nThe following tables set forth selected data for each of the periods indicated (in millions):\n2\nThree Months Ended July 31,\nSix Months Ended July 31,\n \n2025\n% of Total Revenues\n2024\n% of Total Revenues\n2025\n% of Total Revenues\n2024\n% of Total Revenues\nRevenues:\nSubscription and support\n$\n9,690 \n95 \n%\n$\n8,764 \n94 \n%\n$\n18,987 \n95 \n%\n$\n17,349 \n94 \n%\nProfessional services and other\n546 \n5 \n561 \n6 \n1,078 \n5 \n1,109 \n6 \nTotal revenues\n10,236 \n100 \n9,325 \n100 \n20,065 \n100 \n18,458 \n100 \nCost of revenues (1)(2):\nSubscription and support \n1,645 \n16 \n1,556 \n17 \n3,256 \n16 \n3,116 \n17 \nProfessional services and other \n597 \n6 \n603 \n6 \n1,251 \n6 \n1,205 \n6 \nTotal cost of revenues\n2,242 \n22 \n2,159 \n23 \n4,507 \n22 \n4,321 \n23 \nGross profit\n7,994 \n78 \n7,166 \n77 \n15,558 \n78 \n14,137 \n77 \nOperating expenses (1)(2):\nResearch and development\n1,481 \n14 \n1,349 \n14 \n2,941 \n15 \n2,717 \n15 \nSales and marketing\n3,443 \n34 \n3,224 \n35 \n6,872 \n34 \n6,463 \n35 \nGeneral and administrative\n734 \n7 \n711 \n8 \n1,431 \n7 \n1,358 \n7 \nRestructuring \n4 \n0 \n99 \n1 \n40 \n0 \n107 \n1 \nTotal operating expenses\n5,662 \n55 \n5,383 \n58 \n11,284 \n56 \n10,645 \n58 \nIncome from operations\n2,332 \n23 \n1,783 \n19 \n4,274 \n22 \n3,492 \n19 \nGains (losses) on strategic investments, net \n6 \n0 \n(37)\n0 \n(57)\n(1)\n0 \n0 \nOther income\n68 \n1 \n91 \n1 \n163 \n1 \n212 \n1 \nIncome before provision for income taxes\n2,406 \n24 \n1,837 \n20 \n4,380 \n22 \n3,704 \n20 \nProvision for income taxes\n(519)\n(6)\n(408)\n(5)\n(952)\n(5)\n(742)\n(4)\nNet income\n$\n1,887 \n18 \n%\n$\n1,429 \n15 \n%\n$\n3,428 \n17 \n%\n$\n2,962 \n16 \n%\n(1) Amounts related to amortization of intangible assets acquired through business combinations, as follows (in millions):\n \nThree Months Ended July 31,\nSix Months Ended July 31,\n \n2025\n% of Total Revenues\n2024\n% of Total Revenues\n2025\n% of Total Revenues\n2024\n% of Total Revenues\nCost of revenues\n$\n150 \n2 \n%\n$\n231 \n3 \n%\n$\n312 \n2 \n%\n$\n469 \n3 \n%\nSales and marketing\n230 \n2 \n223 \n2 \n463 \n2 \n446 \n2 \n33\nTable of Contents\n(2) Amounts related to stock-based compensation expense, as follows (in millions):\n \nThree Months Ended July 31,\nSix Months Ended July 31,\n \n2025\n% of Total Revenues\n2024\n% of Total Revenues\n2025\n% of Total Revenues\n2024\n% of Total Revenues\nCost of revenues\n$\n126 \n1 \n%\n$\n132 \n2 \n%\n$\n277 \n1 \n%\n$\n251 \n1 \n%\nResearch and development\n280 \n3 \n276 \n3 \n555 \n3 \n536 \n3 \nSales and marketing\n293 \n3 \n309 \n3 \n578 \n3 \n599 \n3 \nGeneral and administrative\n94 \n1 \n91 \n1 \n182 \n1 \n172 \n1 \nRestructuring \n0 \n0 \n2 \n0 \n15 \n0 \n2 \n0 \nThe following table sets forth selected balance sheet data and other metrics for each of the periods indicated (in millions, except remaining performance obligation, which is presented in billions):\nAs of \nJuly 31, 2025\nJanuary 31, 2025\nCash, cash equivalents and marketable securities\n$\n15,372 \n$\n14,032 \nUnearned revenue\n16,555 \n20,743 \nRemaining performance obligation\n59.9 \n63.4 \nPrincipal due on our outstanding debt obligations (1)\n8,500 \n8,500 \n(1) Amounts do not include operating or financing lease obligations.\nRemaining performance obligation represents contracted revenue that has not yet been recognized, which includes unearned revenue and unbilled amounts that will be recognized as revenue in future periods. \nRevenues\n \nThree Months Ended July 31,\nVariance\n(in millions)\n2025\n2024\nDollars\nPercent\nSubscription and support\n$\n9,690 \n$\n8,764 \n$\n926 \n11 \n%\nProfessional services and other\n546 \n561 \n(15)\n(3)\nTotal revenues\n$\n10,236 \n$\n9,325 \n$\n911 \n10 \n%\n \nSix Months Ended July 31,\nVariance\n(in millions)\n2025\n2024\nDollars\nPercent\nSubscription and support\n$\n18,987 \n$\n17,349 \n$\n1,638 \n9 \n%\nProfessional services and other\n1,078 \n1,109 \n(31)\n(3)\nTotal revenues\n$\n20,065 \n$\n18,458 \n$\n1,607 \n9 \n%\nThe \nincrease in s\nubscription and support revenues for the three and six months ended July 31, 2025 was primarily caused by volume-driven increases from new business, which includes new customers, upgrades, and additional subscriptions from existing customers. Pricing was not a significant driver of the increase in revenues for either period. Revenues from term software licenses, which are recognized at a point in time, represented approximately six percent of total subscription and support revenues for the three and six months ended July 31, 2025, and five percent of total subscription and support revenues for the three and six months ended July 31, 2024. Subscription and support revenues accounted for approximately \n95 \npercent of our total revenues for the three and six months ended July 31, 2025 and 94 percent for the three and six months ended July 31, 2024.\nThe decrease in professional services and other revenues for the three and six months ended July 31, 2025 was primarily due to less demand for larger, multi-year transformation engagements, which may continue in the near term. \n34\nTable of Contents\nSubscription and Support Revenues by Service Offering\nSubscription and support revenues consisted of the following (in millions): \nThree Months Ended July 31,\n2025\nAs a % of Total Subscription and Support Revenues\n2024\nAs a % of Total Subscription and Support Revenues\nGrowth Rate\nSales\n$\n2,267 \n23 \n%\n$\n2,071 \n24 \n%\n9 \n%\nService\n2,458 \n25 \n2,257 \n26 \n9 \nPlatform and Other\n2,084 \n22 \n1,786 \n20 \n17 \nMarketing and Commerce\n1,365 \n14 \n1,308 \n15 \n4 \nIntegration and Analytics  \n1,516 \n16 \n1,342 \n15 \n13 \nTotal\n$\n9,690 \n100 \n%\n$\n8,764 \n100 \n%\n11 \n%\n \nSix Months Ended July 31,\n \n2025\nAs a % of Total Subscription and Support Revenues\n2024\nAs a % of Total Subscription and Support Revenues\nGrowth Rate\nSales \n$\n4,398 \n23 \n%\n$\n4,069 \n23 \n%\n8 \n%\nService\n4,792 \n25 \n4,439 \n26 \n8 \nPlatform and Other\n4,047 \n22 \n3,504 \n20 \n15 \nMarketing and Commerce \n2,690 \n14 \n2,590 \n15 \n4 \nIntegration and Analytics\n3,060 \n16 \n2,747 \n16 \n11 \nTotal\n$\n18,987 \n100 \n%\n$\n17,349 \n100 \n%\n9 \n%\nOur industry vertical service offerings revenue is included in one of the above service offerings depending on the primary service purchased.\nIntegration and Analytics subscription and support revenues include revenues from term software licenses, which are recognized at the point in time when the software is made available to the customer. Therefore, we expect Integration and Analytics to experience greater volatility in revenues period to period compared to our other service offerings and recent revenue trends may not be indicative of future performance. Additionally, as we transition customers within the Integration and Analytics offering from term software licenses to subscription based services, revenue associated with such customers will generally be recognized ratably over the contract term, which we expect may potentially result in less revenue in the period the customer transitions but incremental revenues over the remaining term.\nRevenues\n \nby Geography\n \nThree Months Ended July 31,\n(in millions)\n2025\nAs a % of Total Revenues\n2024\nAs a % of Total Revenues\nGrowth Rate\nAmericas\n$\n6,736 \n66 \n%\n$\n6,201 \n67 \n%\n9 \n%\nEurope\n2,429 \n24 \n2,184 \n23 \n11 \nAsia Pacific\n1,071 \n10 \n940 \n10 \n14 \n$\n10,236 \n100 \n%\n$\n9,325 \n100 \n%\n10 \n%\n \nSix Months Ended July 31,\n(in millions)\n2025\nAs a % of Total Revenues\n2024\nAs a % of Total Revenues\nGrowth Rate\nAmericas\n$\n13,205 \n66 \n%\n$\n12,263 \n66 \n%\n8 \n%\nEurope\n4,766 \n24 \n4,329 \n24 \n10 \nAsia Pacific\n2,094 \n10 \n1,866 \n10 \n12 \n$\n20,065 \n100 \n%\n$\n18,458 \n100 \n%\n9 \n%\nRevenues by geography are determined based on the region of the Salesforce contracting entity, which may be different than the region of the customer. The increase in revenues across all regions was primarily due to the continued execution of our \n35\nTable of Contents\nbusiness and growth strategy, including increasing our geographic reach primarily through extending our go-to-market capabilities globally. Total revenues were positively impacted by approximately one percent due to fluctuations in foreign currencies during the three months ended July 31, 2025 compared to the three months ended July 31, 2024, and were minimally impacted by foreign currency fluctuations during the six months ended July 31, 2025 compared to the six months ended July 31, 2024.\nCost of Revenues\n \nThree Months Ended July 31,\nVariance\n(in millions)\n2025\nAs a % of Total Revenues\n2024\nAs a % of Total Revenues\nDollars\nSubscription and support\n$\n1,645 \n16 \n%\n$\n1,556 \n17 \n%\n$\n89 \nProfessional services and other\n597 \n6 \n603 \n6 \n(6)\nTotal cost of revenues\n$\n2,242 \n22 \n%\n$\n2,159 \n23 \n%\n$\n83 \n \nSix Months Ended July 31,\nVariance\n(in millions)\n2025\nAs a % of Total Revenues\n2024\nAs a % of Total Revenues\nDollars\nSubscription and support\n$\n3,256 \n16 \n%\n$\n3,116 \n17 \n%\n$\n140 \nProfessional services and other\n1,251 \n6 \n1,205 \n6 \n46 \nTotal cost of revenues\n$\n4,507 \n22 \n%\n$\n4,321 \n23 \n%\n$\n186 \nCost of revenue as a percentage of total revenue during the three and six months ended July 31, 2025 decreased by\n one percent fr\nom the same periods a year ago primarily as a result of a decrease in amortization of intangible assets acquired through business combinations. \nFor \nthe three and six months ended July 31, 2025\n, the increase in cost of revenues in absolute dollars was primarily due to an increase in service delivery expenses associated with our platform and an increase in employee-related costs, primarily in lower cost regions, partially offset by a decrease in amortization of intangible assets acquired through business combinations. \nWe intend to continue to invest additional resources in enterprise cloud computing services to allow us to scale with our customers and continue to evolve our security measures. The timing of these expenses, which also includes the use of AI and agents, may cause our cost of revenues as a percentage of revenues to fluctuate over time due to changes in demand for our service offerings.\nOperating Expenses\n \nThree Months Ended July 31,\nVariance\n(in millions)\n2025\nAs a % of Total Revenues\n2024\nAs a % of Total Revenues\nDollars\nResearch and development\n$\n1,481 \n14 \n%\n$\n1,349 \n14 \n%\n$\n132 \nSales and marketing\n3,443 \n34 \n3,224 \n35 \n219 \nGeneral and administrative\n734 \n7 \n711 \n8 \n23 \nRestructuring\n4 \n0 \n99 \n1 \n(95)\nTotal operating expenses\n$\n5,662 \n55 \n%\n$\n5,383 \n58 \n%\n$\n279 \n \nSix Months Ended July 31,\nVariance\n(in millions)\n2025\nAs a % of Total Revenues\n2024\nAs a % of Total Revenues\nDollars\nResearch and development\n$\n2,941 \n15 \n%\n$\n2,717 \n15 \n%\n$\n224 \nSales and marketing\n6,872 \n34 \n6,463 \n35 \n409 \nGeneral and administrative\n1,431 \n7 \n1,358 \n7 \n73 \nRestructuring\n40 \n0 \n107 \n1 \n(67)\nTotal operating expenses\n$\n11,284 \n56 \n%\n$\n10,645 \n58 \n%\n$\n639 \n Research and development expenses as a percentage of total revenues during the three and six months ended July 31, 2025 were consistent with the same periods a year ago. For the three and six months ended July 31, 2025, the increase in research and development expenses in absolute dollars was primarily due to an increase in employee-related costs, including stock-based compensation expense, primarily in lower cost regions.\n36\nTable of Contents\nWe expect that research and development expenses will likely remain consistent as a percentage of revenues over time as we continue to invest in the development of new, and improve existing, technologies, including AI, agents and our Data Cloud service offerings, and the integration of acquired technologies.\n Sales and marketing expenses as a percentage of total revenues during the three and six months ended July 31, 2025 decreased by one percent from the same periods a year ago due to a decrease in relative employee-related costs. For the three and six months ended July 31, 2025, the increase in sales and marketing expenses in absolute dollars was primarily due to an increase in employee-related costs and an increase in marketing events, which includes our Agentforce World Tours.\nWe expect that sales and marketing expenses may decrease as a percentage of revenues over time as we continue to focus on leveraging our self-serve and partner-led channels and increasing our sales productivity, which includes the use of AI and agents.\nGeneral and administrative expenses as a percentage of total revenues during the three months ended July 31, 2025 decreased by one percent from the same period a year ago due to decreased bad debt expenses and were consistent during the six months ended July 31, 2025 compared to the same period a year ago. For the three and six months ended July 31, 2025, the increase in general and administrative expenses in absolute dollars was primarily due to an increase in employee-related costs and professional services expenses, partially offset by a decrease in bad debt expenses.\nWe expect that general and administrative expens\nes may decrease as a percentage of\n revenues over time as we continue to invest in process efficiency initiatives, which includes the use of AI and agents.\nIn the three and six months ended July 31, 2025, approximately $4 million and $40 million, respectively, of costs were incurred related to our restructuring initiatives, which were primarily related to employee transitions, severance payments and employee benefits. \nOther Income and Expense\n \nThree Months Ended July 31,\nVariance\n(in millions)\n2025\n2024\nDollars\nGains (losses) on strategic investments, net\n$\n6 \n$\n(37)\n$\n43 \nOther income\n68 \n91 \n(23)\n \nSix Months Ended July 31,\nVariance\n(in millions)\n2025\n2024\nDollars\nGains (losses) on strategic investments, net\n$\n(57)\n$\n0 \n$\n(57)\nOther income\n163 \n212 \n(49)\nGains (losses) on strategic investments, net consists primarily of mark-to-market adjustments related to our publicly held equity securities, observable price adjustments related to our privately held equity securities, impairments and other adjustments. For the three months ended July 31, 2025, our strategic investment portfolio gains were primarily driven by unrealized gains on privately held equity investments of \n$53 million, \nrealized gains on sales of securities of \n$26 million\n and unrealized gains on publicly traded equity securities of \n$13 million\n, partially offset by impairments on privately held investments of \n$86 million\n. For the six months ended July 31, 2025, our strategic investment portfolio losses were primarily driven by impairments on privately held equity investments of $133 million, partially offset by unrealized gains on privately held equity securities of $60 million and realized gains on sales of securities of $19 million.\nOther income primarily consists of investment income, partially offset by interest expense on our debt and finance leases. Interest expense was $67 million and $68 million for the three months ended July 31, 2025 and 2024, respectively, and $135 million and $137 million for the six months ended July 31, 2025 and 2024, respectively. \nProvision For Income Taxes\n \nThree Months Ended July 31,\nVariance\n(in millions)\n2025\n2024\nDollars\nProvision for income taxes\n$\n(519)\n$\n(408)\n$\n(111)\nEffective tax rate\n22 \n%\n22 \n%\n \nSix Months Ended July 31,\nVariance\n(in millions)\n2025\n2024\nDollars\nProvision for income taxes\n$\n(952)\n$\n(742)\n$\n(210)\nEffective tax rate\n22 \n%\n20 \n%\n37\nTable of Contents\nWe recorded a tax provision of $519 million and $408 million for the three months ended July 31, 2025 and 2024, respectively, and a tax provision of $952 million and $742 million for the six months ended July 31, 2025 and 2024, respectively. Our year-to-date effective tax rate increased from a year ago primarily due to lower excess tax benefits from stock-based compensation. The effective tax rate may fluctuate due to changes in our domestic and foreign earnings, or material discrete tax items, or a combination of these factors resulting from transactions or events, including, for example, acquisitions, changes to our operating structure, and other macroeconomic factors. \nOn July 4, 2025, the One Big Beautiful Bill Act (“OBBBA”) was enacted into law. The OBBBA includes significant changes to US corporate tax provisions of the Tax Cuts and Jobs Act. Notably, it allows an immediate deduction for domestic research and development expenditures, reinstates 100% bonus depreciation, and modifies the international tax framework. The legislation has multiple effective dates, with certain provisions effective in fiscal 2026 and others in the subsequent years. The changes had an immaterial impact to the Company’s tax provision for the period ended July 31, 2025.\nThe Company may record additional impacts to its tax provision in the subsequent quarters as it continues to analyze the new law, other factors such as changes from its business operations, financial results and forecasts, and interrelated items including changes to our valuation allowance assessment related to Corporate Alternative Minimum Tax (“CAMT”) credits.\nLiquidity and Capital Resources\nAt July 31, 2025, our principal sources of liquidity were cash, cash equivalents and marketable securities totaling $15.4 billion and accounts receivable of $5.6 billion. Our cash equivalents and marketable securities are comprised primarily of corporate notes and obligations, U.S. treasury securities, U.S. agency obligations, asset-backed securities, foreign government obligations, mortgage-backed obligations, covered bonds, time deposits, money market mutual funds and municipal securities. Our Revolving Loan Credit Agreement (as defined below), which provides the ability to borrow up to $5.0 billion in unsecured financing (the “Credit Facility”) as of July 31, 2025, also serves as a source of liquidity.\nNet cash provided by operating activities could continue to be affected by various risks and uncertainties, including, but not limited to, the risks detailed in Part II, Item 1A, “Risk Factors.” We believe our existing cash, cash equivalents, marketable securities, cash provided by operating activities, unbilled amounts related to contracted noncancellable subscription agreements, which are not reflected on the balance sheet, and, if necessary, our borrowing capacity under our Credit Facility will be sufficient to meet our working capital, capital expenditure and debt maintenance needs over the next 12 months and thereafter. \nIn the future, we may enter into arrangements to acquire or invest in complementary businesses, services, technologies and intellectual property rights. To facilitate these acquisitions or investments, we may seek additional equity or debt financing, which may not be available on terms favorable to us or at all, impacting our ability to complete subsequent acquisitions or investments. For example, we entered into certain credit agreements in connection with our pending acquisition of Informatica. See discussion in “Debt” below.\nWe expect lower cash taxes primarily due to the immediate deduction of domestic research and development expenditures allowed by the OBBBA.\n \nCash\n \nFlows\nFor the three and six months ended July 31, 2025 and 2024, our cash flows were as follows (in millions):\n2\nThree Months Ended July 31,\nSix Months Ended July 31,\n \n2025\n2024\n2025\n2024\nNet cash provided by operating activities\n$\n740 \n$\n892 \n$\n7,216 \n$\n7,139 \nNet cash provided by (used in) investing activities\n1,165 \n2,641 \n(402)\n(10)\nNet cash used in financing activities\n(2,503)\n(5,802)\n(5,423)\n(7,910)\nOperating Activities\nThe net cash provided by operating activities during the six months ended July 31, 2025 was primarily comprised of net income of $3.4 billion, adjusted for non-cash items, including $1.7 billion of depreciation and amortization and $1.6 billion of stock-based compensation expense. Net cash provided by operating activities can be significantly impacted by factors such as growth in new business, timing of cash receipts from customers, vendor payment terms and timing of payments to vendors. Net cash provided by operating activities during the six months ended July 31, 2025 was further benefited by \nthe changes in accounts receivable, net of \n$6.3 billion, partially offset by the change in unearned revenue of $4.2 billion and the change in accounts payable and accrued expenses and other liabilities of $1.2 billion. As our business continues to grow, and assuming our expenses remain in line with or less than our revenue growth, we expect to continue to see growth in net cash provided by operating activities.\nThe net cash provided by operating activities during the six months ended July 31, 2024 was primarily comprised of net income of $3.0 billion, adjusted for non-cash items, including $1.8 billion of depreciation and amortization and $1.6 billion of \n38\nTable of Contents\nstock-based compensation expense. Cash provided by operating activities during the six months ended July 31, 2024 was further benefited by the changes in accounts receivable, net of $6.0 billion partially offset by the change in unearned revenue of $3.8 billion and the change in accounts payable and accrued expenses and other liabilities of $535 million. \nInvesting Activities\nThe net cash used in investing activities during the six months ended July 31, 2025 was primarily related to net outflows from strategic investment activity of $279 million and capital expenditures of $314 million, partially offset by net inflows from marketable securities activity of $245 million.\nThe net cash used in investing activities during the six months ended July 31, 2024 was primarily related to net outflows for the acquisition of Spiff of $338 million, net outflows from strategic investment activity of $202 million and capital expenditures of $300 million, partially offset by net inflows from marketable securities activity of $830 million.\nFinancing Activities\nThe net cash used in financing activities during the six months ended July 31, 2025 was primarily related to $4.9 billion used for repurchases of common stock and $801 million related to payments of dividends, partially offset by $526 million of proceeds from equity plans.\nNet cash used in financing activities during the six months ended July 31, 2024 consisted primarily of $6.5 billion used for repurchases of common stock, $1.0 billion related to repayments of debt and $772 million related to payments of dividends, partially offset by $735 million of proceeds from equity plans.\nDebt\nAs of July 31, 2025, we had senior unsecured debt outstanding, with maturities starting in April 2028 and extending through July 2061 with a total carrying value of $8.4 billion. We were in compliance with all debt covenants as of July 31, 2025. \nIn October 2024, we entered into a Credit Agreement with the lenders and issuing lenders party thereto, and Bank of America, N.A., as administrative agent (the “Revolving Loan Credit Agreement”). The Revolving Loan Credit Agreement replaced the Credit Agreement, dated December 23, 2020 (as amended, the “Prior Credit Agreement”), among us, the lenders and the issuing lenders party thereto, and Citibank, N.A., as administrative agent, which provided for a $3.0 billion unsecured revolving credit facility that was scheduled to mature on December 23, 2025. There were no outstanding borrowings under the Prior Credit Agreement. \nThe Revolving Loan Credit Agreement provides for a $5.0 billion Credit Facility and matures in October 2029. We may use the proceeds of future borrowings under the Credit Facility for general corporate purposes. There were no outstanding borrowings under the Credit Facility as of July 31, 2025.\nIn June 2025, we entered into a 364-Day Credit Agreement that provides us with the ability to borrow up to $4.0 billion and a three-year Credit Agreement that provides us with the ability to borrow up to $2.0 billion, both on an unsecured basis, to finance a portion of the cash consideration for the pending acquisition of Informatica, the repayment of certain debt of Informatica and the payment of fees, costs and expenses related thereto (collectively, the “Informatica Credit Agreements”). The availability and funding of each credit agreement is conditioned on the consummation of the acquisition of Informatica in accordance with the terms of the merger agreement and is subject to certain exceptions, qualifications and certain other conditions. There were no outstanding borrowings under the Informatica Credit Agreements as of July 31, 2025.\nWe do not have any special purpose entities and we do not engage in off-balance sheet financing arrangements.\nShare Repurchase Program\nOur Board of Directors (the “Board”) authorized a program to repurchase shares of the Company's common stock (the \"Share Repurchase Program\"), which commenced in August 2022 and had additional authorizations approved by the Board in February 2023 and February 2024, for an aggregate total authorization of $30.0 billion. In September 2025, the Board authorized an additional $20.0 billion in repurchases under the Share Repurchase Program, for an aggregate total authorized of $50.0 billion. The Share Repurchase Program does not have a fixed expiration date and does not obligate us to acquire any specific number of shares.\n39\nTable of Contents\nWe repurchased the following under the Share Repurchase Program (in millions, except average price per share):\n2025\n2024\nShares\nAverage price per share\nAmount\nShares\nAverage price per share\nAmount\nThree months ended April 30\n10 \n$\n273.42 \n$\n2,681 \n7 \n$\n293.00 \n$\n2,168 \nThree months ended July 31\n8 \n$\n269.96 \n$\n2,199 \n18 \n$\n246.14 \n$\n4,288 \nAll repurchases were made in open market transactions. As of July 31, 2025, we were authorized to purchase a remaining $5.7 billion of the Company’s common stock under the Share Repurchase Program. Subsequent to July 31, 2025, we have incurred approximately $0.8 billion through August 28, 2025 for additional shares under the Share Repurchase Program.\nDividends\nWe announced the following dividends:\nQuarter Ended\nRecord Date\nPayment Date\nDividend per Share\nAmount\n(in millions)\nFiscal 2026\nApril 30, 2025\nApril 10, 2025\nApril 24, 2025\n$\n0.416 \n$\n406 \nJuly 31, 2025\nJune 18, 2025\nJuly 10, 2025\n$\n0.416 \n$\n404 \nFiscal 2025\nApril 30, 2024\nMarch 14, 2024\nApril 11, 2024\n$\n0.40 \n$\n388 \nJuly 31, 2024\nJuly 9, 2024\nJuly 25, 2024\n$\n0.40 \n$\n388 \nThe declaration and payment of future cash dividends is subject to the Board continuing to determine that the declaration of dividends is in the best interests of the Company and our stockholders, after giving consideration to continued capital availability, general economic and market conditions, and applicable laws and agreements.\nContractual\n \nObligations\nAs of July 31, 2025\n, there were no significant changes to our estimates of future payments under our fixed contractual obligations and commitments as presented in “Management’s Discussion and Analysis of Financial Condition and Results of Operations” included in Item 7 of Part II of our Annual Report on Form 10-K for the fiscal year ended \nJanuary 31, 2025\n. For more information regarding our lease obligations as \nof July 31, 2025\n, see Note 5 “Leases and Other Commitments” to the condensed consolidated financial statements in Item 1 of Part I of this Quarterly Report on Form 10-Q. \nWe generally expect to satisfy these commitments with cash on our balance sheet and cash provided by operating activities. \nDuring \nthe six months ended July 31, 2025\n and in future years, we have made, and expect to continue to make, additional investments in enterprise cloud computing services to allow us to scale with our customers and continue to evolve our security measures. We plan to upgrade or replace various internal systems to scale with our overall growth. While we continue to make investments in our infrastructure and with infrastructure service providers to provide capacity for the growth of our business, our strategy may continue to change related to these investments and we may slow the pace of our investments.\nOther Future Obligations\nAs of July 31, 2025, we expect approximately $30 million to $50 million in future cash payments related to our restructuring initiatives, primarily related to workforce costs such as severance payments. We generally expect to satisfy these commitments with cash on our balance sheet and cash provided by operating activities. \nIn May 2025, we entered into a definitive agreement to acquire Informatica, an AI-powered enterprise cloud data management platform. Under the terms of the agreement, holders of Informatica’s Class A and Class B-1 common stock will receive $25 in cash per share and we will acquire all outstanding shares of common stock of Informatica that it does not already own. The transaction represents an equity value of approximately $8 billion, net of our current investment in Informatica. The agreement also provides for our assumption of unvested equity awards held by Informatica employees. We expect to fund the transaction with a combination of new debt and cash on our balance sheet.\nIn July 2025, we committed up to $750 million for a strategic investment in Genesys Cloud Services Topco LLC, which offers a cloud-based AI customer experience platform. We expect to fund this investment in fiscal 2026 with cash on our balance sheet.\n40\nTable of Contents\nOur mergers and acquisitions framework has included several acquisitions that accelerate our agentic roadmap, including our recently announced acquisition of Regrello, a developer of an AI-native business process automation solution. These acquisitions, along with our pending acquisition of Informatica, are bringing in key talent and technology to accelerate innovation. Under the terms of the agreement to acquire Regrello, which was entered into in August 2025, we will acquire the company for approximately $900 million in cash, subject to customary purchase price adjustments. The agreement also provides for our assumption of unvested outstanding equity awards held by Regrello employees. The acquisition is expected to close in the third quarter of fiscal 2026, subject to customary closing conditions.\nStakeholder Impact\nWe believe that business is the greatest platform for change. Guided by our values, we work to earn the trust of our stakeholders. Transparency is key to trust, which is why we have published an annual Stakeholder Impact Report for over ten years to keep our stakeholders informed and to hold ourselves accountable to our sustainability, impact and equality strategies. Our disclosures in these areas are also informed by topics identified through relevancy assessments and third-party ESG reporting organizations, frameworks and standards, such as the Sustainability Accounting Standards Board (“SASB”) Standards. Read more about these initiatives and view our Stakeholder Impact Report at https://salesforce.com/stakeholder-impact-report. Website references throughout this document are provided for convenience only, and the content on the referenced websites is not incorporated by reference into this report.\n41\nTable of Contents"
}