{
  "source_file": "crwd-20251031.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "ITEM 2. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe following discussion and analysis of our financial condition and results of operations should be read in conjunction with the condensed consolidated financial statements and related notes thereto included elsewhere in this Quarterly Report on Form 10-Q and our Annual Report on Form 10-K for the year ended January 31, 2025, filed with the SEC. Some of the information contained in this discussion and analysis or set forth elsewhere in this Quarterly Report on Form 10-Q, including information with respect to our plans and strategy for our business, includes forward-looking statements that involve risks and uncertainties as described under the heading Special Note Regarding Forward-Looking Statements following the Table of Contents of this Quarterly Report on Form 10-Q. You should review the disclosure under Part II, Item 1A, “Risk Factors” in this Quarterly Report on Form 10-Q for a discussion of important factors that could cause actual results to differ materially from the results described in or implied by the forward-looking statements contained in the following discussion and analysis.\nOverview\nFounded in 2011, we reinvented cybersecurity for the cloud era and transformed the way cybersecurity is delivered and experienced by customers. When we started CrowdStrike, cyberattackers had an asymmetric advantage over legacy cybersecurity products that could not keep pace with the rapid changes in adversary tactics. We took a fundamentally different approach to solve this problem with the AI-native CrowdStrike Falcon platform – the first, true cloud-native unified platform built with artificial intelligence (“AI”) at the core, capable of harnessing vast amounts of security and enterprise data to deliver highly modular solutions through a single lightweight agent.\nWe believe our approach has defined a new category called the Security Cloud, which has transformed the cybersecurity industry the same way the cloud has transformed the customer relationship management, human resources, and service management industries. Using cloud-scale AI, our Security Cloud enriches and correlates trillions of cybersecurity events per week with indicators of attack, threat intelligence, and enterprise data (including data from across endpoints, workloads, identities, DevOps, IT assets, and configurations) to create actionable data, identify shifts in adversary tactics, and automatically prevent threats in real-time across our customer base. The more data that is fed into our Falcon platform, the more intelligent our Security Cloud becomes, and the more our customers benefit, creating a powerful network effect that increases the overall value we provide.\nOur Go-To-Market Strategy\nWe sell subscriptions to our Falcon platform and cloud modules to organizations across multiple industries. We primarily sell subscriptions to our Falcon platform and cloud modules through our direct sales team that leverages our network of channel partners. Our direct sales team is comprised of field sales and inside sales professionals who are segmented by a customer’s number of endpoints.\nWe have a low friction land-and-expand sales strategy. When customers deploy our Falcon platform, they can start with any number of cloud modules and easily add additional cloud modules. Once customers experience the benefits of our Falcon platform, they often expand their adoption over time by adding more endpoints or purchasing additional modules. We also use our sales team to identify current customers who may be interested in free trials of additional cloud modules, which serves as a powerful driver of our land-and-expand model. By segmenting our sales teams, we can deploy a low-touch sales model that efficiently identifies prospective customers.\nWe began as a solution for large enterprises, but the flexibility and scalability of our Falcon platform has enabled us to seamlessly offer our solution to customers of any size. We have expanded our sales focus to include any sized organization without the need to modify our Falcon platform for small and medium sized businesses.\nA substantial majority of our customers purchase subscriptions with a term over one year. Our subscriptions are generally priced on a per-endpoint and per-module basis. We recognize revenue from our subscriptions ratably over the term of the subscription. We also generate revenue from our incident response and proactive professional services, which are generally priced on a time and materials basis. We view our professional services business primarily as an opportunity to cross-sell subscriptions to our Falcon platform and cloud modules.\n34\nTable of Contents\nCertain Factors Affecting Our Performance\nAdoption of Our Solutions. \nWe believe our future success depends in large part on the growth in the market for cloud-based SaaS-delivered endpoint security solutions. Many organizations have not yet abandoned the on-premise legacy products in which they have invested substantial personnel and financial resources to design and maintain. As a result, it is difficult to predict customer adoption rates and demand for our cloud-based solutions.\nNew Customer Acquisition. \nOur future growth depends in large part on our ability to acquire new customers. If our efforts to attract new customers are not successful, our revenue and rate of revenue growth may decline. We believe that our go-to-market strategy and the flexibility and scalability of our Falcon platform allow us to rapidly expand our customer base. Our incident response and proactive services also help drive new customer acquisitions, as many of these professional services customers subsequently purchase subscriptions to our Falcon platform. Many organizations have not yet adopted cloud-based security solutions, and since our Falcon platform has offerings for organizations of all sizes, worldwide, and across industries, we believe this presents a significant opportunity for growth.\nMaintain Customer Retention and Increase Sales. \nOur ability to increase revenue depends in large part on our ability to retain our existing customers and increase the size of their subscriptions. We focus on increasing sales to our existing customers by expanding their deployments to more endpoints and selling additional cloud modules for increased functionality. Over time we have transitioned our platform from a single offering into highly-integrated offerings of multiple cloud modules. \nInvest in Growth. \nWe believe that our market opportunity is large and requires us to continue to invest significantly in sales and marketing efforts to further grow our customer base, both domestically and internationally. Our open cloud architecture and single data model have allowed us to rapidly build and deploy new cloud modules, and we expect to continue investing in those efforts to further enhance our technology platform and product functionality. In addition to our ongoing investment in research and development, we may also pursue acquisitions of businesses, technologies, and assets that complement and expand the functionality of our Falcon platform, add to our technology or security expertise, or bolster our leadership position by gaining access to new customers or markets. Furthermore, we expect our general and administrative expenses to increase in dollar amount for the foreseeable future given the additional expenses for accounting, compliance, and investor relations as we grow.\nJuly 19 Incident\n. On July 19, 2024, we released a content configuration update for our Falcon sensor that resulted in system crashes for certain Windows systems (the “July 19 Incident”). As a result of the July 19 Incident, we are subject to lawsuits, claims and inquiries as described in Note 10, “Commitments and Contingencies,” to our condensed consolidated financial statements in Part I, Item 1 of this Quarterly Report on Form 10-Q. We have incurred, and expect to continue to incur, significant legal and professional services and other general and administrative expenses associated with the July 19 Incident in future periods. It is not reasonably possible to quantify the precise impact of the July 19 Incident, but the incident has adversely affected our results of operations, and we currently expect a number of factors relating to the incident to adversely affect our key metrics and results of operations in future periods. While we have maintained high dollar-based gross retention rates following the incident, we have experienced delays in creating sales opportunities and longer sales cycles, including delays in customer purchasing decisions. Sales cycles may be elongated in future periods. In addition, because our customers typically sign contracts with terms of twelve months or longer, customer churn and any corresponding impact to our key metrics and revenue may occur in future periods. Customer commitment packages introduced following the July 19 Incident have included discounting, additional modules, professional services, flexible payment terms or subscription period extensions. Our customer commitment packages have resulted, and are expected to continue to result, in increased contraction, due to elongated subscription terms, and decreased upsell dollar values.\n35\nTable of Contents\nKey Metrics\nWe monitor the following key metrics to help us evaluate our business, identify trends affecting our business, formulate business plans, and make strategic decisions.\nAnnual Recurring Revenue (“ARR”)\nARR is calculated as the annualized value of our customer subscription contracts as of the measurement date, assuming any contract that expires during the next 12 months is renewed on its existing terms. To the extent that we are negotiating a renewal with a customer after the expiration of the subscription, we continue to include that revenue in ARR if we are actively in discussion with such organization for a new subscription or renewal, or until such organization notifies us that it is not renewing its subscription. \nThe following table sets forth our ARR as of the dates presented (dollars in thousands):\nAs of October 31,\n2025\n2024\nAnnual recurring revenue\n$\n4,922,006 \n$\n4,017,540 \nYear-over-year growth\n23 \n%\n27 \n%\nARR grew to $4.9 billion as of October 31, 2025, of which $265.3 million and $680.2 million was net new ARR added for the three and nine months ended October 31, 2025, respectively. ARR grew to $4.0 billion as of October 31, 2024, of which $153.0 million and $582.3 million was net new ARR added for the three and nine months ended October 31, 2024, respectively. \nDollar-Based Net Retention Rate\nOur dollar-based net retention rate compares our ARR from a set of subscription customers against the same metric for those subscription customers from the prior year. Our dollar-based net retention rate reflects customer renewals, expansion, contraction, and churn, and excludes revenue from our incident response and proactive services. We calculate our dollar-based net retention rate as of period end by starting with the ARR from all subscription customers as of 12 months prior to such period end, or Prior Period ARR. We then calculate the ARR from these same subscription customers as of the current period end, or Current Period ARR. Current Period ARR includes any expansion and is net of contraction or churn over the trailing 12 months but excludes revenue from new subscription customers in the current period. We then divide the Current Period ARR by the Prior Period ARR to arrive at our dollar-based net retention rate. For the purposes of calculating our dollar-based net retention rate, we define a subscription customer as a separate legal entity that has entered into a distinct subscription agreement for access to our Falcon platform for which the term has not ended or with which we are negotiating a renewal contract. We do not consider our channel partners as customers, and we treat managed service security providers, who may purchase our products on behalf of multiple companies, as a single customer.\nOur dollar-based net retention rate increased in the quarter ended October 31, 2025 over the prior quarter. Our dollar-based net retention rate can fluctuate from period to period due to large customer contracts in a given period and incentives provided, which may reduce our dollar-based net retention rate in subsequent periods. In addition, if our customers are not able to fully utilize their product subscriptions (including in connection with our flexible subscription offering), we may experience increased contraction as such customers may elect to renew with shorter subscription periods, fewer cloud modules, fewer endpoints or smaller contract values, which may reduce our dollar-based net retention rate.\n36\nTable of Contents\nComponents of Our Results of Operations\nRevenue\nSubscription Revenue. \nSubscription revenue primarily consists of subscription fees for our Falcon platform and additional cloud modules that are supported by our cloud-based platform. Subscription revenue is driven primarily by the number of subscription customers, the number of endpoints per customer, and the number of cloud modules included in the subscription. We recognize subscription revenue ratably over the term of the agreement, which is generally one to three years. We generally invoice our subscription customers at the beginning of the subscription term, or in some instances, such as in multi-year arrangements, in installments. Consequently, a substantial portion of the revenue that we report in each period is attributable to the recognition of deferred revenue relating to subscriptions that we entered into during previous periods.\nProfessional Services Revenue. \nProfessional services revenue includes incident response and proactive services, forensic and malware analysis, attribution analysis, operationalizing the Falcon Platform, residency program, and active defense services. Professional services are generally sold separately from subscriptions to our Falcon platform, although customers frequently enter into a separate arrangement to purchase subscriptions to our Falcon platform at the conclusion of a professional services arrangement. Professional services are available through hourly rate and fixed fee contracts, one-time and ongoing engagements, and retainer-based agreements. For time and materials and retainer-based arrangements, revenue is recognized as services are performed. Fixed fee contracts account for an immaterial portion of our revenue.\nCost of Revenue\nSubscription Cost of Revenue. \nSubscription cost of revenue consists primarily of costs related to hosting our cloud-based Falcon platform in data centers, amortization of our capitalized internal-use software, employee-related costs such as salaries and bonuses, stock-based compensation expense, benefits costs associated with our operations and support personnel, software license fees, property and equipment depreciation, amortization of acquired intangibles, and an allocated portion of facilities and administrative costs.\nAs new customers subscribe to our platform and existing subscription customers increase the number of endpoints on our Falcon platform, our cost of revenue will increase due to greater cloud hosting costs related to powering new cloud modules and the incremental costs for storing additional data collected for such cloud modules and employee-related costs. We intend to continue to invest additional resources in our cloud platform and our customer support organizations as we grow our business. The level and timing of investment in these areas could affect our cost of revenue in the future.\nProfessional Services Cost of Revenue. \nProfessional services cost of revenue consists primarily of employee-related costs, such as salaries and bonuses, stock-based compensation expense, consulting expense, and an allocated portion of facilities and administrative costs.\nGross Profit and Gross Margin\nGross profit and gross margin have been and will continue to be affected by various factors, including the timing of our acquisition of new subscription customers, renewals from existing subscription customers, sales of additional modules to existing subscription customers, the data center and bandwidth costs associated with operating our cloud platform, the extent to which we expand our customer support and cloud operations organizations, and the extent to which we can increase the efficiency of our technology, infrastructure, and data centers through technological improvements. We expect our gross profit to increase in dollar amount and our gross margin to increase modestly over the long term as we grow our business, although our gross margin could fluctuate from period to period depending on the interplay of these factors. Demand for our incident response services is driven by the number of breaches experienced by non-customers. Also, we view our professional services solutions in the context of our larger business and as a significant lead generator for new subscriptions. Because of these factors, our services revenue and gross margin may fluctuate over time.\nOperating Expenses\nOur operating expenses consist of sales and marketing, research and development, and general administrative expenses. For each of these categories of expense, employee-related expenses are the most significant component, which include salaries, employee bonuses, sales commissions, and employer payroll tax. Operating expenses also include an allocated portion of overhead costs for facilities and other administrative functions.\n37\nTable of Contents\nSales and Marketing. \nSales and marketing expenses primarily consist of employee-related expenses such as salaries, commissions, and bonuses. Sales and marketing expenses also include stock-based compensation; expenses related to our marketing programs; and an allocated portion of facilities and administrative expenses. Sales and marketing expenses also include the amortization of deferred contract acquisition costs, which includes commissions and any other incremental payments made upon the initial acquisition of a subscription or upsells to existing customers, which are capitalized and amortized over the estimated customer life. We also capitalize and amortize any such expenses paid for the renewal of a subscription over the term of the renewal.\nWe expect sales and marketing expenses to increase in dollar amount as we continue to make significant investments in our sales and marketing organization to drive additional revenue, further penetrate the market, and expand our global customer base. However, we anticipate sales and marketing expenses to decrease as a percentage of our total revenue over time as we grow our business, although our sales and marketing expenses may fluctuate as a percentage of our total revenue from period to period depending on the timing of these expenses.\nResearch and Development. \nResearch and development expenses primarily consist of employee-related expenses such as salaries and bonuses; stock-based compensation; cloud hosting and related costs; and an allocated portion of facilities and administrative expenses. Our cloud platform is software-driven, and our research and development teams employ software engineers in the design, and the related development, testing, certification, and support of these solutions.\nWe expect research and development expenses to increase in dollar amount as we continue to increase investments in our technology architecture and software platform. However, we anticipate research and development expenses to decrease as a percentage of our total revenue over time as we grow our business, although our research and development expenses may fluctuate as a percentage of our total revenue from period to period depending on the timing of these expenses.\nGeneral and Administrative. \nGeneral and administrative expenses consist of employee-related expenses such as salaries and bonuses; stock-based compensation; and related expenses for our executive, finance, human resources, and legal organizations. In addition, general and administrative expenses include outside legal, accounting, and other professional fees; and an allocated portion of facilities and administrative expenses.\nWe expect general and administrative expenses to increase in dollar amount over time. We expect to incur significant legal and professional services and other expenses associated with the July 19 Incident and related matters in future periods. General and administrative expenses may fluctuate as a percentage of our total revenue from period to period depending on the timing of these expenses.\nInterest Expense.\n Interest expense consists primarily of amortization of debt issuance costs, contractual interest expense for our Senior Notes issued in January 2021, and amortization of debt issuance costs on our secured Revolving Facility.\nInterest Income. \nInterest income consists primarily of income earned on our cash and cash equivalents. \nOther Income (Expense), Net. \nOther income (expense), net consists primarily of gains and losses on strategic investments and foreign currency transaction gains and losses.\nProvision for Income Taxes. \nProvision for income taxes consists of state income taxes in the United States, foreign income taxes, and withholding taxes related to customer payments in certain foreign jurisdictions in which we conduct business. We maintain a full valuation allowance on our U.S. federal and state and certain foreign deferred tax assets, including net operating loss carryforwards and tax credits, which we have determined are not realizable on a more-likely-than-not basis. We regularly evaluate the need for a valuation allowance. \nNet Income (Loss) Attributable to Non-controlling Interest\n. Net income (loss) attributable to non-controlling interest consists of the Falcon Funds’ non-controlling interest share of gains and losses and interest income from our strategic investments.\n38\nTable of Contents\nResults of Operations\nThe following tables set forth our condensed consolidated statements of operations for each period presented (in thousands, except percentages):\nThree Months Ended October 31,\nChange\n$\nChange\n%\nNine Months Ended October 31,\nChange\n$\nChange\n%\n2025\n2024\n2025\n2024\nRevenue\nSubscription\n$\n1,168,705 \n$\n962,735 \n$\n205,970 \n21 \n%\n$\n3,322,418 \n$\n2,753,164 \n$\n569,254 \n21 \n%\nProfessional services\n65,539 \n47,443 \n18,096 \n38 \n%\n184,212 \n141,922 \n42,290 \n30 \n%\nTotal revenue\n1,234,244 \n1,010,178 \n224,066 \n22 \n%\n3,506,630 \n2,895,086 \n611,544 \n21 \n%\nCost of revenue\nSubscription\n \n257,915 \n216,301 \n41,614 \n19 \n%\n753,929 \n605,868 \n148,061 \n24 \n%\nProfessional services\n49,890 \n38,786 \n11,104 \n29 \n%\n153,302 \n111,623 \n41,679 \n37 \n%\nTotal cost of revenue\n307,805 \n255,087 \n52,718 \n21 \n%\n907,231 \n717,491 \n189,740 \n26 \n%\nGross profit\n926,439 \n755,091 \n171,348 \n23 \n%\n2,599,399 \n2,177,595 \n421,804 \n19 \n%\nOperating expenses\nSales and marketing\n481,032 \n408,267 \n72,765 \n18 \n%\n1,367,673 \n1,113,852 \n253,821 \n23 \n%\nResearch and development\n347,564 \n275,602 \n71,962 \n26 \n%\n1,028,361 \n761,759 \n266,602 \n35 \n%\nGeneral and administrative\n167,286 \n126,945 \n40,341 \n32 \n%\n510,443 \n337,113 \n173,330 \n51 \n%\nTotal operating expenses\n995,882 \n810,814 \n185,068 \n23 \n%\n2,906,477 \n2,212,724 \n693,753 \n31 \n%\nLoss from operations\n(69,443)\n(55,723)\n(13,720)\n25 \n%\n(307,078)\n(35,129)\n(271,949)\n774 \n%\nInterest expense\n(6,931)\n(6,587)\n(344)\n5 \n%\n(20,469)\n(19,647)\n(822)\n4 \n%\nInterest income\n50,883 \n52,201 \n(1,318)\n(3)\n%\n147,113 \n149,577 \n(2,464)\n(2)\n%\nOther income (expense), net\n2,223 \n(429)\n2,652 \n(618)\n%\n(4,395)\n6,196 \n(10,591)\n(171)\n%\nIncome (loss) before provision for income taxes\n(23,268)\n(10,538)\n(12,730)\n121 \n%\n(184,829)\n100,997 \n(285,826)\n(283)\n%\nProvision for income taxes\n10,720 \n6,281 \n4,439 \n71 \n%\n37,797 \n24,862 \n12,935 \n52 \n%\nNet income (loss)\n(33,988)\n(16,819)\n(17,169)\n102 \n%\n(222,626)\n76,135 \n(298,761)\n(392)\n%\nNet income (loss) attributable to non-controlling interest\n9 \n3 \n6 \n200 \n%\n(747)\n3,124 \n(3,871)\n(124)\n%\nNet income (loss) attributable to CrowdStrike\n$\n(33,997)\n$\n(16,822)\n$\n(17,175)\n102 \n%\n$\n(221,879)\n$\n73,011 \n$\n(294,890)\n(404)\n%\n39\nTable of Contents\nThe following table presents the components of our condensed consolidated statements of operations as a percentage of total revenue for the periods presented:\nThree Months Ended October 31,\nNine Months Ended October 31,\n2025\n2024\n2025\n2024\n%\n%\nRevenue\nSubscription\n95 \n%\n95 \n%\n95 \n%\n95 \n%\nProfessional services\n5 \n%\n5 \n%\n5 \n%\n5 \n%\nTotal revenue\n100 \n%\n100 \n%\n100 \n%\n100 \n%\nCost of revenue\nSubscription\n21 \n%\n21 \n%\n22 \n%\n21 \n%\nProfessional services\n4 \n%\n4 \n%\n4 \n%\n4 \n%\nTotal cost of revenue\n25 \n%\n25 \n%\n26 \n%\n25 \n%\nGross profit\n75 \n%\n75 \n%\n74 \n%\n75 \n%\nOperating expenses\nSales and marketing\n39 \n%\n40 \n%\n39 \n%\n38 \n%\nResearch and development\n28 \n%\n27 \n%\n29 \n%\n26 \n%\nGeneral and administrative\n14 \n%\n13 \n%\n15 \n%\n12 \n%\nTotal operating expenses\n81 \n%\n80 \n%\n83 \n%\n76 \n%\nLoss from operations\n(6)\n%\n(6)\n%\n(9)\n%\n(1)\n%\nInterest expense\n(1)\n%\n(1)\n%\n(1)\n%\n(1)\n%\nInterest income \n4 \n%\n5 \n%\n4 \n%\n5 \n%\nOther income (expense), net\n— \n%\n— \n%\n— \n%\n— \n%\nIncome (loss) before provision for income taxes\n(2)\n%\n(1)\n%\n(5)\n%\n3 \n%\nProvision for income taxes\n1 \n%\n1 \n%\n1 \n%\n1 \n%\nNet income (loss)\n(3)\n%\n(2)\n%\n(6)\n%\n3 \n%\nNet income (loss) attributable to non-controlling interest\n— \n%\n— \n%\n— \n%\n— \n%\nNet income (loss) attributable to CrowdStrike\n(3)\n%\n(2)\n%\n(6)\n%\n3 \n%\nComparison of the Three Months Ended October 31, 2025 and 2024\nRevenue\nThe following shows total revenue from subscriptions and professional services for the three months ended\n \nOctober 31, 2025 as compared to the three months ended October 31, 2024 (in thousands, except percentages):\nThree Months Ended October 31,\nChange\n$\nChange\n%\n2025\n2024\nSubscription\n$\n1,168,705 \n$\n962,735 \n$\n205,970 \n21 \n%\nProfessional services\n65,539 \n47,443 \n18,096 \n38 \n%\nTotal revenue\n$\n1,234,244 \n$\n1,010,178 \n$\n224,066 \n22 \n%\nTotal revenue increased by $224.1 million, or 22%, for the three months ended October 31, 2025 compared to the three months ended October 31, 2024. Subscription revenue accounted for 95% of total revenue for each of the three months ended October 31, 2025 and October 31, 2024. Professional services revenue accounted for 5% of our total revenue for each of the three months ended October 31, 2025 and October 31, 2024.\nSubscription revenue increased by $206.0 million, or 21%, for the three months ended October 31, 2025 compared to the three months ended October 31, 2024, which was primarily driven by a combination of the addition of new customers and the sale of additional sensors and modules to existing customers.\n40\nTable of Contents\nProfessional services revenue increased by $18.1 million, or 38%, for the three months ended October 31, 2025, compared to the three months ended October 31, 2024, which was primarily attributable to an increase in the number of professional service hours.\nCost of Revenue, Gross Profit, and Gross Margin\nThe following shows cost of revenue related to subscriptions and professional services for the three months ended October 31, 2025 as compared to the three months ended October 31, 2024 (in thousands, except percentages):\nThree Months Ended October 31,\nChange\n$\nChange\n%\n2025\n2024\nSubscription\n$\n257,915 \n$\n216,301 \n$\n41,614 \n19 \n%\nProfessional services\n49,890 \n38,786 \n11,104 \n29 \n%\nTotal cost of revenue\n$\n307,805 \n$\n255,087 \n$\n52,718 \n21 \n%\nTotal cost of revenue increased by $52.7 million, or 21%, for the three months ended October 31, 2025 compared to the three months ended October 31, 2024. Subscription cost of revenue increased by $41.6 million, or 19%, for the three months ended October 31, 2025, compared to the three months ended October 31, 2024. The increase in subscription cost of revenue was primarily due to an increase in cloud hosting and related services costs of $11.3 million, an increase in employee-related expenses of $8.6 million driven by a 17% increase in average headcount, an increase in depreciation of data center equipment of $8.3 million, an increase in amortization of internal-use software of $5.8 million, an increase in allocated overhead costs of $5.0 million, and an increase in stock-based compensation expense of $5.0 million.\nProfessional services cost of revenue increased by $11.1 million, or 29%, for the three months ended October 31, 2025, compared to the three months ended October 31, 2024. The increase in professional services cost of revenue was primarily due to an increase in consulting expenses of $6.1 million, an increase in employee-related expenses of $2.1 million driven by a 11% increase in average headcount, and an increase in stock-based compensation expense of $1.9 million.\nThe following shows gross profit and gross margin for subscriptions and professional services for the three months ended October 31, 2025 as compared to the three months ended October 31, 2024 (in thousands, except percentages):\nThree Months Ended October 31,\nChange\n$\nChange\n%\n2025\n2024\nSubscription gross profit\n$\n910,790 \n$\n746,434 \n$\n164,356 \n22 \n%\nProfessional services gross profit\n15,649 \n8,657 \n6,992 \n81 \n%\nTotal gross profit\n$\n926,439 \n$\n755,091 \n$\n171,348 \n23 \n%\nThree Months Ended October 31,\nChange\n%\n2025\n2024\nSubscription gross margin\n78 \n%\n78 \n%\n— \n%\nProfessional services gross margin\n24 \n%\n18 \n%\n6 \n%\nTotal gross margin\n75 \n%\n75 \n%\n— \n%\nSubscription gross margin was flat for the three months ended October 31, 2025, compared to the three months ended October 31, 2024. \nProfessional services gross margin increased by six percentage points for the three months ended October 31, 2025, compared to the three months ended October 31, 2024. The increase in professional services gross margin was primarily due to an increase in the number of professional service hours, partially offset by an increase in consulting expense during the three months ended October 31, 2025.\n41\nTable of Contents\nOperating Expenses\nSales and Marketing\nThe following shows sales and marketing expenses for the three months ended October 31, 2025 as compared to the three months ended October 31, 2024 (in thousands, except percentages):\nThree Months Ended October 31,\nChange\n$\nChange\n%\n2025\n2024\nSales and marketing expenses\n$\n481,032 \n$\n408,267 \n$\n72,765 \n18 \n%\nSales and marketing expenses increased by $72.8 million, or 18%, for the three months ended October 31, 2025 compared to the three months ended October 31, 2024. The increase in sales and marketing expenses was primarily due to an increase in employee-related expenses of $36.6 million driven by a 10% increase in average headcount, an increase in stock-based compensation expense of $17.5 million, an increase in marketing programs of $9.0 million, an increase in allocated overhead costs of $5.3 million, an increase in employee benefits of $4.5 million, an increase in cloud hosting and related services costs of $4.5 million, and an increase in travel expenses of $2.4 million, partially offset by a decrease in expenses associated with the July 19 Incident and related matters of $14.9 million.\nResearch and Development\nThe following shows research and development expenses for the three months ended October 31, 2025 as compared to the three months ended October 31, 2024 (in thousands, except percentages):\nThree Months Ended October 31,\nChange\n$\nChange\n%\n2025\n2024\nResearch and development expenses\n$\n347,564 \n$\n275,602 \n$\n71,962 \n26 \n%\nResearch and development expenses increased by $72.0 million, or 26%, for the three months ended October 31, 2025 compared to the three months ended October 31, 2024. This increase was primarily due to an increase in stock-based compensation expense of $27.2 million, an increase in employee-related expenses of $26.6 million driven by a 17% increase in average headcount, an increase in cloud hosting and related costs of $9.9 million, an increase in allocated overhead costs of $7.7 million, and an increase in employee benefits of $2.4 million, partially offset by an increase in software capitalization of $0.5 million, and a decrease in other labor expense of $2.5 million. \nGeneral and Administrative\nThe following shows general and administrative expenses for the three months ended October 31, 2025 as compared to the three months ended October 31, 2024 (in thousands, except percentages):\nThree Months Ended October 31,\nChange\n$\nChange\n%\n2025\n2024\nGeneral and administrative expenses\n$\n167,286 \n$\n126,945 \n$\n40,341 \n32 \n%\nGeneral and administrative expenses increased by $40.3 million, or 32%, for the three months ended October 31, 2025 compared to the three months ended October 31, 2024. The increase in general and administrative expenses was primarily due to an increase in stock-based compensation expense of $22.4 million, an increase in expenses associated with the July 19 Incident and related matters of $9.1 million, an increase in consulting expense of $3.2 million, an increase in employee-related expenses of $2.3 million driven by a 18% increase in average headcount, and an increase in allocated overhead costs of $1.2 million.\n42\nTable of Contents\nInterest Expense, Interest Income, and Other Income (Expense), Net\nThe following shows interest expense, interest income, and other income (expense), net for the three months ended October 31, 2025 as compared to the three months ended October 31, 2024 (in thousands, except percentages):\nThree Months Ended October 31,\nChange\n$\nChange\n%\n2025\n2024\nInterest expense\n$\n(6,931)\n$\n(6,587)\n$\n(344)\n5 \n%\nInterest income \n$\n50,883 \n$\n52,201 \n$\n(1,318)\n(3)\n%\nOther income (expense), net\n$\n2,223 \n$\n(429)\n$\n2,652 \n(618)\n%\nInterest expense consists primarily of amortization of debt issuance costs, contractual interest expense, accretion of debt discount for our Senior Notes issued in January 2021, and amortization of debt issuance costs on our Revolving Facility. \nThe decrease in interest income for the three months ended October 31, 2025 compared to the three months ended October 31, 2024 was driven by lower market rates, partially offset by higher cash balance.\nThe increase in other income (expense), net for the three months ended October 31, 2025 compared to the three months ended October 31, 2024 was primarily due to an increase in net foreign currency transaction gains of $1.6 million, and an increase in gains from deferred compensation assets of $0.5 million.\n Provision for Income Taxes\nThe following shows the provision for income taxes for the three months ended October 31, 2025 as compared to the three months ended October 31, 2024 (in thousands, except percentage):\nThree Months Ended October 31,\nChange\n$\nChange\n%\n2025\n2024\nProvision for income taxes\n$\n10,720 \n$\n6,281 \n$\n4,439 \n71 \n%\nThe increase in provision for income taxes of $4.4 million during the three months ended October 31, 2025 compared to the three months ended October 31, 2024 was primarily attributable to income taxes in foreign jurisdictions and withholding taxes related to customer payments in certain foreign jurisdictions in which the Company conducts business.\nComparison of the Nine Months Ended October 31, 2025 and 2024\nRevenue\nThe following shows total revenue from subscriptions and professional services for the nine months ended\n \nOctober 31, 2025 as compared to the nine months ended October 31, 2024 (in thousands, except percentages):\nNine Months Ended October 31,\nChange\n$\nChange\n%\n2025\n2024\nSubscription\n$\n3,322,418 \n$\n2,753,164 \n$\n569,254 \n21 \n%\nProfessional services\n184,212 \n141,922 \n42,290 \n30 \n%\nTotal revenue\n$\n3,506,630 \n$\n2,895,086 \n$\n611,544 \n21 \n%\nTotal revenue increased by $611.5 million, or 21%, for the nine months ended October 31, 2025 compared to the nine months ended October 31, 2024. Subscription revenue accounted for 95% total revenue for both the nine months ended October 31, 2025 and October 31, 2024. Professional services revenue accounted for 5% of our total revenue for both the nine months ended October 31, 2025 and October 31, 2024. \n43\nTable of Contents\nSubscription revenue increased by $569.3 million, or 21%, for the nine months ended October 31, 2025, compared to the nine months ended October 31, 2024, which was primarily driven by a combination of the addition of new customers and the sale of additional sensors and modules to existing customers.\nProfessional services revenue increased by $42.3 million, or 30%, for the nine months ended October 31, 2025, compared to the nine months ended October 31, 2024, which was primarily attributable to an increase in the number of professional service hours.\nCost of Revenue, Gross Profit, and Gross Margin\nThe following shows cost of revenue related to subscriptions and professional services for the nine months ended October 31, 2025 as compared to the nine months ended October 31, 2024 (in thousands, except percentages):\nNine Months Ended October 31,\nChange\n$\nChange\n%\n2025\n2024\nSubscription\n$\n753,929 \n$\n605,868 \n$\n148,061 \n24 \n%\nProfessional services\n153,302 \n111,623 \n41,679 \n37 \n%\nTotal cost of revenue\n$\n907,231 \n$\n717,491 \n$\n189,740 \n26 \n%\nTotal cost of revenue increased by $189.7 million, or 26%, for the nine months ended October 31, 2025 compared to the nine months ended October 31, 2024. Subscription cost of revenue increased by $148.1 million, or 24%, for the nine months ended October 31, 2025, compared to the nine months ended October 31, 2024. The increase in subscription cost of revenue was primarily due to an increase in employee-related expenses of $37.0 million driven by a 19% increase in average headcount, an increase in cloud hosting and related services costs of $34.5 million, an increase in depreciation of data center equipment of $23.7 million, an increase in stock-based compensation expense of $21.8 million, an increase in amortization of internal-use software of $16.2 million, and an increase in allocated overhead costs of $13.6 million. \nProfessional services cost of revenue increased by $41.7 million, or 37%, for the nine months ended October 31, 2025, compared to the nine months ended October 31, 2024. The increase in professional services cost of revenue was primarily due to an increase in consulting expenses of $15.1 million, an increase in employee-related expenses of $12.5 million driven by a 13% increase in average headcount, an increase in stock-based compensation expense of $7.0 million, charges related to the Plan of $3.4 million, and an increase in allocated overhead costs of $2.1 million.\nThe following shows gross profit and gross margin for subscriptions and professional services for the nine months ended October 31, 2025 as compared to the nine months ended October 31, 2024 (in thousands, except percentages):\nNine Months Ended October 31,\nChange\n$\nChange\n%\n2025\n2024\nSubscription gross profit\n$\n2,568,489 \n$\n2,147,296 \n$\n421,193 \n20 \n%\nProfessional services gross profit\n30,910 \n30,299 \n611 \n2 \n%\nTotal gross profit\n$\n2,599,399 \n$\n2,177,595 \n$\n421,804 \n19 \n%\nNine Months Ended October 31,\nChange\n%\n2025\n2024\nSubscription gross margin\n77 \n%\n78 \n%\n(1)\n%\nProfessional services gross margin\n17 \n%\n21 \n%\n(4)\n%\nTotal gross margin\n74 \n%\n75 \n%\n(1)\n%\nSubscription gross margin slightly decreased by one percentage point for the nine months ended October 31, 2025, compared to the nine months ended October 31, 2024. The decrease in subscription gross margin was primarily due to an increase in stock-based compensation expense, and an increase in depreciation of data center equipment during the nine months ended October 31, 2025.\n44\nTable of Contents\nProfessional services gross margin decreased by four percentage points for the nine months ended October 31, 2025, compared to the nine months ended October 31, 2024. The decrease in professional services gross margin was primarily due to an increase in consulting expense during the nine months ended October 31, 2025.\nOperating Expenses\nSales and Marketing\nThe following shows sales and marketing expenses for the nine months ended October 31, 2025 as compared to the nine months ended October 31, 2024 (in thousands, except percentages):\nNine Months Ended October 31,\nChange\n$\nChange\n%\n2025\n2024\nSales and marketing expenses\n$\n1,367,673 \n$\n1,113,852 \n$\n253,821 \n23 \n%\nSales and marketing expenses increased by $253.8 million, or 23%, for the nine months ended October 31, 2025 compared to the nine months ended October 31, 2024. The increase in sales and marketing expenses was primarily due to an increase in employee-related expenses of $130.8 million driven by a 12% increase in average headcount, an increase in stock-based compensation expense of $41.6 million, an increase in marketing programs of $26.5 million, an increase in allocated overhead costs of $16.7 million, an increase in employee benefits of $14.3 million, an increase in travel expenses of $10.5 million, charges related to the Plan of $9.1 million, and an increase in term-based software licenses of $2.8 million, partially offset by a decrease of $17.4 million of expenses associated with the July 19 Incident and related matters, and a decrease in company events expenses of $5.5 million.\nResearch and Development\nThe following shows research and development expenses for the nine months ended October 31, 2025 as compared to the nine months ended October 31, 2024 (in thousands, except percentages):\nNine Months Ended October 31,\nChange\n$\nChange\n%\n2025\n2024\nResearch and development expenses\n$\n1,028,361 \n$\n761,759 \n$\n266,602 \n35 \n%\nResearch and development expenses increased by $266.6 million, or 35%, for the nine months ended October 31, 2025 compared to the nine months ended October 31, 2024. This increase was primarily due to an increase in stock-based compensation expense of $98.9 million, an increase in employee-related expenses of $93.4 million driven by a 20% increase in average headcount, an increase in cloud hosting and related costs of $35.0 million, an increase in allocated overhead costs of $21.4 million, charges related to the Plan of $16.8 million, an increase in employee benefits of $11.3 million, and an increase in term-based software licenses of $2.3 million, partially offset by a decrease in other labor expenses of $11.3 million, and an increase in software capitalization of $10.2 million.\nGeneral and Administrative\nThe following shows general and administrative expenses for the nine months ended October 31, 2025 as compared to the nine months ended October 31, 2024 (in thousands, except percentages):\nNine Months Ended October 31,\nChange\n$\nChange\n%\n2025\n2024\nGeneral and administrative expenses\n$\n510,443 \n$\n337,113 \n$\n173,330 \n51 \n%\nGeneral and administrative expenses increased by $173.3 million, or 51%, for the nine months ended October 31, 2025 compared to the nine months ended October 31, 2024. The increase in general and administrative expenses was primarily due to an increase in expenses associated with the July 19 Incident and related matters of $82.0 million, an increase in stock-based compensation expense of $43.7 million, charges related to the Plan of $12.6 million, an increase in employee-related expenses of $10.5 million driven by a 19% increase in average headcount, an increase in allocated overhead costs of $3.6 million, an increase in legal expense of $3.4 million unrelated to the July 19 Incident or related matters, an increase in term-based software licenses of $2.6 million, an increase in consulting expense of $2.0 million, and an increase in travel expenses of $1.9 million.\n45\nTable of Contents\nInterest Expense, Interest Income, and Other Income (Expense), Net\nThe following shows interest expense, interest income, and other income (expense), net for the nine months ended October 31, 2025 as compared to the nine months ended October 31, 2024 (in thousands, except percentages):\nNine Months Ended October 31,\nChange\n$\nChange\n%\n2025\n2024\nInterest expense\n$\n(20,469)\n$\n(19,647)\n$\n(822)\n4 \n%\nInterest income \n$\n147,113 \n$\n149,577 \n$\n(2,464)\n(2)\n%\nOther income (expense), net\n$\n(4,395)\n$\n6,196 \n$\n(10,591)\n(171)\n%\nInterest expense consists primarily of amortization of debt issuance costs, contractual interest expense, accretion of debt discount for our Senior Notes issued in January 2021, and amortization of debt issuance costs on our Revolving Facility. \nThe decrease in interest income for the nine months ended October 31, 2025 compared to the nine months ended October 31, 2024 was driven by lower market rates, partially offset by higher cash balance.\nThe decrease in other income (expense), net for the nine months ended October 31, 2025 compared to the nine months ended October 31, 2024 was primarily due to a decrease in net realized gains on our strategic investments of $6.2 million, an increase in net foreign currency transaction losses of $3.7 million, and downward adjustments and impairment of $1.6 million of our strategic investments, partially offset by an increase in gains from deferred compensation assets of $0.7 million.\n Provision for Income Taxes\nThe following shows the provision for income taxes for the nine months ended October 31, 2025 as compared to the nine months ended October 31, 2024 (in thousands, except percentage):\nNine Months Ended October 31,\nChange\n$\nChange\n%\n2025\n2024\nProvision for income taxes\n$\n37,797 \n$\n24,862 \n$\n12,935 \n52 \n%\nThe increase in provision for income taxes of $12.9 million during the nine months ended October 31, 2025 compared to the nine months ended October 31, 2024 was primarily attributable to income taxes in foreign jurisdictions and withholding taxes related to customer payments in certain foreign jurisdictions in which the Company conducts business.\nLiquidity and Capital Resources\nOur primary sources of liquidity as of October 31, 2025, consisted of: (i) $4.8 billion in cash and cash equivalents, which mainly consists of cash on hand and highly liquid investments in money market funds, U.S. Treasury bills, and time deposits, (ii) cash we expect to generate from operations, and (iii) available capacity under our $750.0 million Revolving Facility. It is not currently possible to reasonably estimate the amount of loss or range of possible loss that might result from adverse judgments, settlements, penalties, or other resolution of proceedings resulting from the July 19 Incident or related matters. However, despite such uncertainties, we expect that the combination of our existing cash and cash equivalents, cash flows from operations, and the Revolving Facility will be sufficient to meet our anticipated cash needs for working capital and capital expenditures for at least the next 12 months. Our Revolving Facility matures on January 2, 2026.\nOur short-term and long-term liquidity requirements primarily arise from: (i) business acquisitions and investments we may make from time to time, (ii) working capital requirements, (iii) interest and principal payments related to our outstanding indebtedness, (iv) research and development and capital expenditure needs, and (v) license and service arrangements integral to our business operations. Our ability to fund these requirements will depend, in part, on our future cash flows, which are determined by our future operating performance and, therefore, subject to prevailing global macroeconomic conditions and financial, business and other factors, some of which are beyond our control. \nWe have historically generated operating losses, as reflected in our accumulated deficit of $1.3 billion as of October 31, 2025. We expect to continue to make investments, particularly in sales and marketing and research and development. As a result, we may require additional capital resources in the future to execute strategic initiatives to grow our business.\n46\nTable of Contents\nWe generally invoice our subscription customers at the beginning of the subscription term, or in some instances, such as in multi-year arrangements, in installments. Therefore, a substantial source of our cash is from such prepayments, which are included on our condensed consolidated balance sheets as deferred revenue. Deferred revenue primarily consists of billed fees for our subscriptions, prior to satisfying the criteria for revenue recognition, which are subsequently recognized as revenue in accordance with our revenue recognition policy. As of October 31, 2025, we had deferred revenue of $4.1 billion, of which $2.9 billion was recorded as a current liability and is expected to be recorded as revenue in the next 12 months, provided all other revenue recognition criteria have been met.\nWe do not have any relationships with unconsolidated entities or financial partnerships, such as entities often referred to as structured finance or special purpose entities. We do not have any outstanding derivative financial instruments, off-balance sheet guarantees, interest rate swap transactions, or foreign currency forward contracts.\nCash Flows\nThe following table summarizes our cash flows for the periods presented (in thousands):\nNine Months Ended October 31,\n2025\n2024\nNet cash provided by operating activities\n$\n1,114,480 \n$\n1,036,005 \nNet cash used in investing activities\n(641,503)\n(211,569)\nNet cash provided by financing activities\n81,094 \n60,822 \nNet change in cash, cash equivalents and restricted cash\n561,388 \n884,617 \nOperating Activities\nNet cash provided by operating activities during the nine months ended October 31, 2025 was $1.1 billion, which resulted from net loss of $222.6 million, adjusted for non-cash charges of $1.4 billion and net cash outflow of $27.4 million from changes in operating assets and liabilities. Non-cash charges primarily consisted of $822.7 million in stock-based compensation expense, $325.4 million of amortization of deferred contract acquisition costs, $180.9 million of depreciation and amortization, $23.1 million of amortization of intangibles assets, $12.6 million of non-cash operating lease costs, $3.5 million of non-cash interest expense, and $1.6 million change in fair value of strategic investments, partially offset by $5.4 million of deferred income taxes. The net cash outflow from changes in operating assets and liabilities was primarily due to an increase of $333.7 million in deferred revenue, a decrease of $116.2 million in accounts receivable, an increase of $32.6 million in accrued payroll and benefits, and an increase of $19.9 million in accrued expenses and other liabilities, partially offset by an increase of $431.7 million in deferred contract acquisition costs, an increase of $79.4 million in prepaid expenses and other assets, a decrease of $9.6 million in accounts payable, and a decrease of $9.0 million in operating lease liabilities.\nInvesting Activities\nNet cash used in investing activities of $641.5 million during the nine months ended October 31, 2025 was primarily due to business acquisitions, net of cash acquired, of $380.9 million, purchases of property and equipment of $199.6 million, capitalized internal-use software and website development costs of $51.5 million, purchases of strategic investments of $10.3 million, and purchases of deferred compensation investments of $4.3 million, partially offset by proceeds from sales of strategic investments of $4.9 million.\nFinancing Activities\nNet cash provided by financing activities of $81.1 million during the nine months ended October 31, 2025 was primarily due to proceeds from our employee stock purchase plan of $74.6 million, capital contributions from non-controlling interests of $6.0 million, and proceeds from the exercise of stock options of $2.6 million, partially offset by distributions to non-controlling interest holders of $2.2 million. \n47\nTable of Contents\nSupplemental Guarantor Financial Information\nOur Senior Notes are guaranteed on a senior, unsecured basis by CrowdStrike, Inc. and CrowdStrike Financial Services, Inc., wholly owned subsidiaries of CrowdStrike Holdings, Inc. (the “subsidiary guarantors,” and together with CrowdStrike Holdings, Inc., the “Obligor Group”). The guarantee is full and unconditional and is subject to certain conditions for release. See Note 5, “Debt,” to our condensed consolidated financial statements in Part I, Item 1 of this Quarterly Report on Form 10-Q, for a brief description of the Senior Notes.\nWe conduct our operations almost entirely through our subsidiaries. Accordingly, the Obligor Group’s cash flows and ability to service the Senior Notes will depend on the earnings of our subsidiaries and the distribution of those earnings to the Obligor Group, whether by dividends, loans or otherwise. Holders of the guaranteed registered debt securities will have a direct claim only against the Obligor Group.\nSummarized financial information is presented below for the Obligor Group on a combined basis after elimination of intercompany transactions and balances within the Obligor Group and equity in the earnings from and investments in any non-guarantor subsidiary. The revenue amounts presented in the summarized financial information include substantially all of our condensed consolidated revenue, and there is no intercompany revenue from the non-guarantor subsidiaries. This summarized financial information has been prepared and presented pursuant to Regulation S-X Rule 13-01, “Financial Disclosures about Guarantors and Issuers of Guaranteed Securities” and is not intended to present the financial position or results of operations of the Obligor Group in accordance with U.S. GAAP.\nStatement of Operations\nNine Months Ended\nOctober 31, 2025\n(in thousands)\nRevenue\n$\n3,509,373 \nCost of revenue\n965,277 \nOperating expenses\n2,928,982 \nLoss from operations\n(384,886)\nNet loss\n(332,361)\nNet loss attributable to CrowdStrike\n(332,361)\nBalance Sheet\nOctober 31, 2025\nJanuary 31, 2025\n(in thousands)\nCurrent assets (excluding current intercompany receivables from non-Guarantors)\n$\n6,325,851 \n$\n5,922,562 \nCurrent intercompany receivables from non-Guarantors\n— \n49,417 \nNoncurrent assets (excluding noncurrent intercompany receivables from non-Guarantors)\n2,619,906 \n2,316,545 \nNoncurrent intercompany receivables from non-Guarantors\n625,902 \n613,732 \nCurrent liabilities (excluding current intercompany payables to non-Guarantors)\n3,424,180 \n3,331,647 \nCurrent intercompany payables to non-Guarantors\n94,529 \n31,092 \nNoncurrent liabilities (excluding noncurrent intercompany payables to non-Guarantors)\n2,216,822 \n1,897,235 \nNoncurrent intercompany payables to non-Guarantors\n203,271 \n234,643 \n48\nTable of Contents\nStrategic Investments\nIn July 2019, we agreed to commit up to $10.0 million to a newly formed entity, CrowdStrike Falcon Fund LLC (the “Original Falcon Fund”) in exchange for 50% of the sharing percentage of any distribution by the Original Falcon Fund. In December 2021, we agreed to commit an additional $50.0 million to a newly formed entity, CrowdStrike Falcon Fund II LLC (“Falcon Fund II”) in exchange for 50% of the sharing percentage of any distribution by Falcon Fund II. Further, entities associated with Accel also agreed to commit up to $10.0 million and $50.0 million, respectively, to the Original Falcon Fund and Falcon Fund II (collectively, the “Falcon Funds”), and collectively own the remaining 50% of the sharing percentage of the Falcon Funds. Both Falcon Funds are in the business of purchasing, selling, and investing in minority equity and convertible debt securities of privately-held companies that develop applications that have potential for substantial contribution to us and our platform. We are the manager of the Falcon Funds and control their investment decisions and day-to-day operations and accordingly have consolidated each of the Falcon Funds. Each Falcon Fund has a duration of ten years and may be extended for three additional years. At dissolution, the Falcon Funds will be liquidated, and the remaining assets will be distributed to the investors based on their respective sharing percentage. \nContractual Obligations and Commitments \nDuring the nine months ended October 31, 2025, there were no significant changes to our debt obligations related to the Senior Notes, as presented in Part II, Item 7, Management’s Discussion and Analysis of Financial Condition and Results of Operations included in our Annual Report on Form 10-K for the fiscal year ended January 31, 2025. \n We have non-cancelable purchase commitments with various parties to purchase products and services entered in the normal course of business totaling $2.6 billion as of October 31, 2025, with remaining terms in excess of 12 months. We expect to fund these obligations with cash flows from operations and cash on our balance sheet.\nOur commitments also consist of obligations under non-cancelable real estate arrangements on an undiscounted basis, of which $14.7 million is due in the next 12 months and $163.6 million is due thereafter.\nAs of October 31, 2025, our unrecognized tax benefits included $62.6 million, which were classified as long-term liabilities due to the inherent uncertainty with respect to the timing of future cash outflows associated with our unrecognized tax benefits.\nAs of October 31, 2025, we had non-cancelable unfunded commitments from our financing arrangements totaling approximately $121.3 million. \nCritical Accounting Policies and Estimates\nOur condensed consolidated financial statements were prepared in accordance with U.S GAAP. The preparation of the condensed consolidated financial statements requires our management to make estimates and assumptions that affect the amounts reported in the condensed consolidated financial statements and accompanying notes. We base our estimates and judgments on our historical experience, knowledge of factors affecting our business and our belief as to what could occur in the future considering available information and assumptions that are believed to be reasonable under the circumstances.\nThe accounting estimates we use in the preparation of our condensed consolidated financial statements will change as new events occur, more experience is acquired, additional information is obtained and our operating environment changes. Changes in estimates are made when circumstances warrant. Such changes in estimates and refinements in estimation methodologies are reflected in our reported results of operations and, if material, the effects of changes in estimates are disclosed in the notes to our condensed consolidated financial statements. By their nature, these estimates and judgments are subject to an inherent degree of uncertainty and actual results could differ materially from the amounts reported based on these estimates.\nThere have been no significant changes in our critical accounting policies and estimates during the nine months ended October 31, 2025, as compared to the critical accounting policies and estimates disclosed in Management’s Discussion and Analysis of Financial Condition and Results of Operations included in our Annual Report on Form 10-K for the year ended January 31, 2025, filed with the SEC on March 10, 2025.\n49\nTable of Contents\nBacklog\nWe enter into both single and multi-year subscription contracts for our solutions. We generally invoice our subscription customers at the beginning of the subscription term, or in some instances, such as in multi-year arrangements, in installments. Until we have the contractual right to invoice, these contract amounts are classified as backlog. They are not recorded in deferred revenue or elsewhere in our condensed consolidated financial statements. As of October 31, 2025, we had backlog of approximately $3.8 billion. We expect backlog will change from period to period for several reasons, including the timing and duration of customer agreements, varying billing cycles of subscription agreements, and the timing and duration of customer renewals. Because revenue for any period is a function of revenue recognized from deferred revenue under contracts in existence at the beginning of the period, as well as contract renewals and new customer contracts during the period, backlog at the beginning of any period is not necessarily indicative of future revenue performance. We do not utilize backlog as a key management metric internally.\nSeasonality\nGiven the annual budget approval process of many of our customers, we see seasonal patterns in our business. Net new ARR generation is typically greater in the second half of the year, particularly in the fourth quarter, as compared to the first half of the year. In addition, we also experience seasonality in our operating margin, typically with a lower margin in the first half of our fiscal year due to a step up in costs for payroll taxes and annual sales and marketing events. This also impacts the timing of operating cash flow.\nEmployees\nAs of October 31, 2025, we had 10,410 full-time employees. We also engage temporary employees and consultants as needed to support our operations. None of our employees in the United States are represented by a labor union or subject to a collective bargaining agreement. In certain countries in which we operate, we are subject to local labor law requirements which may automatically make our employees subject to industry-wide collective bargaining agreements. We have not experienced any work stoppages, and we consider our relations with our employees to be good.\nCorporate Information\nOur principal executive offices are located at 206 E. 9th Street, Suite 1400, Austin, Texas 78701 and our telephone number is (888) 512-8906. We are a holding company and all of our business operations are conducted through our subsidiaries, including CrowdStrike, Inc. Our website address is www.crowdstrike.com. Information contained on, or that can be accessed through, our website does not constitute part of this Quarterly Report on Form 10-Q.\nRecently Issued Accounting Pronouncements\nSee Note 1, “Description of Business and Significant Accounting Policies,” to our condensed consolidated financial statements in Part I, Item 1 of this Quarterly Report on Form 10-Q, for more information about the impact of certain recent accounting pronouncements on our condensed consolidated financial statements."
}