{
  "source_file": "ctra-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "ITEM 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nThe following review of operations of Coterra Energy Inc. (“Coterra,” the “Company,” “our,” “we” and “us”) for the three and nine month periods ended September 30, 2025 and 2024 should be read in conjunction with our Condensed Consolidated Financial Statements and the Notes included in this Quarterly Report on Form 10-Q (this “Form 10-Q”) and with the Consolidated Financial Statements, Notes and Management’s Discussion and Analysis included in our Annual Report on Form 10-K for the year ended December 31, 2024 filed on February 25, 2025 (our “Form 10-K”). \nFor the abbreviations and definitions of certain terms commonly used in the oil and gas industry, please see the “Glossary of Certain Oil and Gas Terms” included within our Form 10-K. \nOVERVIEW\nFinancial and Operating Overview \nFinancial and operating results for the nine months ended September 30, 2025 compared to the nine months ended September 30, 2024 reflect the following: \n•\nNet income increased $525 million from $824 million, or $1.11 per share, in 2024 to $1.3 billion, or $1.77 per share, in 2025.\n•\nNet cash provided by operating activities increased $882 million, from $2.2 billion in 2024 to $3.1 billion in 2025.\n•\nEquivalent production increased 25.9 MMBoe from 184.9 MMBoe, or 674.8 MBoe per day, in 2024 to 210.8 MMBoe, or 772.0 MBoe per day, in 2025.\n◦\nOil production increased 12.8 MMBbl from 29.4 MMBbl, or 107.4 MBbl per day, in 2024 to 42.2 MMBbl, or 154.6 MBbl per day, in 2025. \n◦\nNatural gas production increased 44.0 Bcf from 769.1 Bcf, or 2,806.8 MMcf per day, in 2024 to 813.1 Bcf, or 2,978.5 MMcf per day, in 2025. \n◦\nNGL volumes increased 5.8 MMBbl from 27.3 MMBbl, or 99.6 MBbl per day, in 2024 to 33.1 MMBbl, or 121.1 MBbl per day, in 2025. \n•\nAverage realized prices (including impact of derivatives):\n◦\nOil was $65.89 per Bbl in 2025, 13 percent lower than the $76.17 per Bbl realized in 2024.\n◦\nNatural gas was $2.52 per Mcf in 2025, 53 percent higher than the $1.65 per Mcf realized in 2024.\n◦\nNGL price was $19.29 per Bbl in 2025, two percent lower than the $19.59 per Bbl realized in 2024.\n•\nTotal capital expenditures for drilling, completion and other fixed assets were $1.8 billion in 2025 compared to $1.3 billion in the corresponding period of the prior year. \nOther financial highlights for the nine months ended September 30, 2025 include the following: \n•\nClosed two acquisitions in January 2025 in the Delaware Basin in New Mexico for total consideration of $3.3 billion in cash and the issuance of 28,190,682 shares of our common stock valued at $785 million based on the closing price of our common stock on the closing date of the transactions.\n•\nIncreased our quarterly dividend from $0.21 per share to $0.22 per share in February 2025.\n•\nRepaid the full $500 million of the Tranche A Term Loan and paid down $100 million of the Tranche B Term Loan.\n•\nRepurchased\n 2 million shares of our common stock for $47 million.\nMarket Conditions and Commodity Prices\nOur financial results depend on many factors, particularly commodity prices and our ability to find and develop oil and gas reserves and market our production on economically attractive terms. Commodity prices are affected by many factors outside of our control, including changes in market supply and demand, which can be impacted by pipeline capacity constraints, inventory storage levels, basis differentials, weather conditions, and geopolitical, economic and other factors. \n22\nTable of Contents\nWhile oil prices were relatively steady throughout 2024, prices have declined in 2025, with the largest decline occurring in April 2025 in both spot and forward pricing. Throughout 2025, forward pricing for oil prices has continued to decline due to growing global inventories and increased production quotas that have been announced by OPEC+ in the second and third quarters of 2025. Global oil demand continues to be projected by some, including the International Energy Agency, to be adversely impacted by escalating trade tensions as a result of U.S. economic policy, including tariffs and retaliatory tariffs. However, these forecasts are subject to volatile market conditions, including ongoing shifts in U.S. and international trade policy, as well as geopolitical risk and uncertainty, including political and military disputes. The impacts of these changes remain to be seen.\nNatural gas prices, which rose in early 2025, have continued to trend downward through the third quarter, driven in part by lower natural gas power burns in the first and second quarter and record high domestic production. Heading into 2026, forward pricing for natural gas prices has increased, in part as a result of anticipated colder temperatures, shifting weather models, and expected growing LNG demand. However, shifting U.S. and international trade policy and related uncertainty, including potential retaliatory tariffs on U.S. exports of LNG, continue to contribute to ongoing volatility in natural gas pricing. Additionally, basis differentials have persisted in the U.S., with prices at the Waha Hub in the Permian Basin particularly depressed due to pipeline maintenance and production oversupply, reaching negative spot pricing at various times in September 2025. Despite these headwinds, we continue to expect natural gas prices overall to be stronger in 2025 and heading into 2026 compared to 2024.\nIn recent months, the potential for increasing tariffs has remained a contributing factor to increased volatility in commodity markets and uncertainty in the general economic outlook. Higher tariffs could result in increased costs of materials used in our operations, less ready access to capital markets or less favorable general economic conditions. The uncertainty surrounding tariff policies has led to fluctuations in commodity prices which could impact our ability to forecast future results. We are continuing to monitor developments related to tariff policies. \nAlthough the current outlook on oil and natural gas prices is generally favorable, and our operations have not been significantly impacted in the short-term, in the event further disruptions occur or the current market volatility and U.S. and international economic policy uncertainty continues for an extended period of time, our operations could be adversely impacted, commodity prices could decline and our costs may increase. We expect commodity price volatility to continue, including as a result of U.S. and international economic policy (such as tariffs or retaliatory tariffs), actions of OPEC+ (including the ability of OPEC+ to successfully coordinate production quotas) and potentially swift near- and medium-term fluctuations in supply and demand, such as potential changes to drilling and capital programs in the short term by U.S. producers. While we are unable to predict future commodity prices, at current oil, natural gas and NGL price levels, we do not believe that an impairment of our oil and gas properties is reasonably likely to occur in the near future. However, in the event that commodity prices significantly decline or costs significantly increase from current levels, our management would evaluate the recoverability of the carrying value of our oil and gas properties.\nIn addition, some governments, companies, communities and other stakeholders are supporting efforts to address climate change. As a result, such efforts have resulted in both existing and pending legislation and regulatory measures (including at the state, national and international level). Significant uncertainty remains as to the proposed changes in these laws or regulations, which, if adopted, may result in delays or restrictions in permitting and the development of our projects, increases to our costs, impair our ability to move forward with our construction, completions, drilling, water management, waste handling, storage, transport and remediation activities, or more competitive renewable energy alternatives that are able to more effectively compete with traditional oil and natural gas-derived products (including government subsidies and incentives for electric vehicles), any of which could have an adverse effect on our financial results. \nFor information about the impact of realized commodity prices on our revenues, refer to “Results of Operations” below. \nRecent U.S. Tax Legislation\nOn July 4, 2025, the U.S. enacted significant tax legislation under H.R. 1, the One Big Beautiful Bill Act (“OBBBA”). The effects of the provisions of the OBBBA have been reflected in our financial statements for the quarter ended September 30, 2025. While the enactment of the OBBBA did not result in a material change to our total income tax expense, it had a material impact on the allocation between current and deferred taxes. Specifically, the reinstatement of 100 percent bonus depreciation and immediate expensing of domestic research and development costs resulted in a significant reduction to current tax expense, with a corresponding increase in deferred tax expense. \nOutlook \nOur 2025 full-year capital program is expected to be approximately $2.3 billion. We expect to fund these capital expenditures with our operating cash flow. We expect to turn-in-line 194 to 198 total net wells in 2025 across our three \n23\nTable of Contents\noperating regions. We currently expect to invest approximately 67 percent of our capital expenditures in the Permian Basin, 14 percent in the Marcellus Shale, 10 percent in the Anadarko Basin and the remaining nine percent for gathering systems infrastructure, saltwater disposal and other capital expenditures.\nIn 2024, we drilled 313 gross wells (159.4 net) and turned-in-line 294 gross wells (153.0 net). For the nine months ended September 30, 2025, our capital program focused on the Permian Basin, Marcellus Shale and Anadarko Basin, where we drilled 154.6 net wells and turned in line 146.4 net wells. Our capital program for the remainder of 2025 will focus on execution of our 2025 plan presented in our annual guidance. In the normal course of our business, we will continue to assess the oil and natural gas price macro environments and may adjust our capital allocation accordingly.\nFINANCIAL CONDITION\nLiquidity and Capital Resources\nWe strive to maintain an adequate liquidity level to address commodity price volatility and risk. Our liquidity requirements consist primarily of our planned capital expenditures (including acquisitions), payment of contractual obligations (including debt maturities and interest payments), working capital requirements, dividend payments and share repurchases. Although we have no obligation to do so, we may also from time-to-time refinance or retire our outstanding debt through privately negotiated transactions, open market repurchases, redemptions, exchanges, tender offers or otherwise.\nOur primary sources of liquidity are cash on hand, net cash provided by operating activities and available borrowing capacity under our revolving credit agreement. Our liquidity requirements are generally funded with cash flows provided by operating activities, together with cash on hand. However, from time-to-time, our investments may be funded by bank borrowings (including draws on our revolving credit agreement), sales of assets, and private or public financing based on our monitoring of capital markets and our balance sheet. While there are no “rating triggers” in any of our debt agreements that would accelerate the scheduled maturities should our credit rating fall below a certain level, a change in our credit rating could adversely impact our interest rate on any borrowings under our revolving credit agreement and our ability to economically access debt markets and could trigger the requirement to post credit support under various agreements, which could reduce the borrowing capacity under our revolving credit agreement. As of the date hereof, our debt is currently rated as investment grade by the three leading ratings agencies. For more on the impact of credit ratings on our interest rates and fees for unused commitments under our revolving credit agreement, see Note 4 of the Notes to the Consolidated Financial Statements in our Form 10-K. We believe that, with operating cash flow, cash on hand and availability under our revolving credit agreement, we have the ability to finance our spending plans over the next 12 months and, based on current expectations, for the longer term.\nOur working capital is substantially influenced by the variables discussed above and fluctuates based on the timing and amount of borrowings and repayments under our revolving credit agreement, borrowings and repayments of debt, the timing of cash collections and payments on our trade accounts receivable and payable, respectively, payment of dividends, repurchases of our securities and changes in the fair value of our commodity derivative activity. From time-to-time, our working capital will reflect a deficit, while at other times it will reflect a surplus. This fluctuation is not unusual. As of September 30, 2025, our working capital surplus of $37 million was lower than prior year, primarily due to a lower cash position as a result of funding the purchase price of the Franklin Mountain Energy (“FME”) and Avant acquisitions that closed in January 2025, the full repayment of the Tranche A Term Loan of $500 million in 2025 and the partial repayment of the Tranche B Term Loan of $100 million in 2025. Additionally, we reclassified our 3.77% private placement senior notes due in September 2026 to current debt during the third quarter of 2025. As of December 31, 2024, we had a working capital surplus of $2.2 billion. We believe we have adequate liquidity and availability under our revolving credit agreement as outlined above to meet our working capital requirements and debt repayments over the next 12 months.\nAs of September 30, 2025, we had no borrowings outstanding under our revolving credit agreement, our unused commitments were $2.0 billion, and we had unrestricted cash on hand of $98 million.\nOur revolving credit agreement and term loan include a covenant potentially limiting our borrowing capacity as determined by our leverage ratio. As of September 30, 2025, we were in compliance with all financial covenants applicable to our revolving credit agreement, term loan and private placement senior notes. Refer to Note 4 of the Notes to the Condensed Consolidated Financial Statements in this report and Note 4 of the Notes to the Consolidated Financial Statements in our Form 10-K for further details.\n24\nTable of Contents\nCash Flows\nOur cash flows from operating activities, investing activities and financing activities were as follows:\nNine Months Ended \nSeptember 30,\nVariance\n(In millions)\n2025\n2024\nAmount\nPercent\nCash flows provided by operating activities \n$\n3,051 \n$\n2,169 \n$\n882 \n41 \n%\nCash flows used in investing activities \n(5,033)\n(1,327)\n(3,706)\n279 \n%\nCash flows used in financing activities \n(192)\n(959)\n767 \n80 \n%\nNet decrease in cash, cash equivalents and restricted cash\n$\n(2,174)\n$\n(117)\n$\n(2,057)\n1,758 \n%\nOperating Activities.\n Operating cash flow fluctuations are substantially driven by changes in commodity prices, production volumes and operating expenses. As discussed above, commodity prices have historically been volatile. Fluctuations in cash flow may result in an increase or decrease in our planned capital expenditures.\nNet cash provided by operating activities for the nine months ended September 30, 2025 increased by $882 million compared to the same period in 2024. This increase was primarily due to higher oil, natural gas and NGL revenues driven by significantly higher natural gas prices and higher production from our FME and Avant acquisitions that closed in January 2025 and our legacy properties in the Permian and Anadarko Basins. These increases were partially offset by an increase in operating costs largely due to our FME and Avant acquisitions and a decrease in cash received on derivative settlements during the first nine months of 2025 compared to 2024.\nRefer to “Results of Operations” below for additional information relative to commodity prices, production and operating expense fluctuations. We are unable to predict future commodity prices and, as a result, cannot provide any assurance about future levels of net cash provided by operating activities.\nInvesting Activities\n.\n Cash flows used in investing activities increased by $3.7 billion for the nine months ended September 30, 2025 compared to the nine months ended September 30, 2024. This increase was primarily due to $3.2 billion of net cash consideration paid for business combinations and $458 million higher cash paid for capital expenditures in 2025 compared to 2024.\nFinancing Activities\n.\n Cash flows used in financing activities decreased by $767 million for the nine months ended September 30, 2025 compared to the nine months ended September 30, 2024. The decrease was due to $947 million higher proceeds from issuance of debt due to the funding of our term loan in 2025 and borrowings under our revolver and $350 million lower common stock repurchases. These decreases were partially offset by the repayment of the $500 million Tranche A Term Loan in 2025, the partial repayment of $100 million of the Tranche B Term Loan in 2025 and the $446 million repayment of borrowings under our revolver during 2025, compared to the repayment of the $575 million 3.65% weighted-average senior notes at their maturity in September 2024. Further, the decrease was partially offset by $44 million of higher dividend payments and $29 million of higher tax withholding on vesting of stock awards in 2025 compared to 2024.\nCapitalization\nInformation about our capitalization is as follows:\n(Dollars in millions)\nSeptember 30,\n2025\nDecember 31,\n2024\nTotal debt \n(1)\n$\n3,922 \n$\n3,535 \nStockholders’ equity \n14,718 \n13,122 \nTotal capitalization  \n$\n18,640 \n$\n16,657 \nDebt to total capitalization \n21 \n%\n21 \n%\nCash and cash equivalents  \n$\n98 \n$\n2,038 \n________________________________________________________\n(1)\n There were no borrowings outstanding under our revolving credit agreement as of September 30, 2025 and December 31, 2024.\nShare repurchases\n. During the nine months ended September 30, 2025, we repurchased and retired 2 million shares of our common stock for $47 million. We repurchased and retired 15 million shares of our common stock for $404 million during the nine months ended September 30, 2024.\n25\nTable of Contents\nAs of September 30, 2025, we had $1.1 billion remaining under our current share repurchase program.\nDividends\n. In February 2025, our Board of Directors approved an increase in the quarterly dividend from $0.21 per share to $0.22 per share. \nThe following table summarizes our dividends on our common stock for the nine months ended September 30, 2025 and 2024:\nRate Per Share\nTotal Dividends\n(In millions) \n2025\nFirst quarter\n$\n0.22 \n$\n170 \nSecond quarter\n0.22 \n170 \nThird quarter\n0.22 \n170 \n$\n0.66 \n$\n510 \n2024\nFirst quarter\n$\n0.21 \n$\n160 \nSecond quarter\n0.21 \n158 \nThird quarter\n0.21 \n156 \n$\n0.63 \n$\n474 \nCapital and Exploration Expenditures\nOn an annual basis, we generally fund most of our capital expenditures, excluding any significant property acquisitions, with cash flow provided by operating activities, and, if required, borrowings under our revolving credit agreement. We budget these expenditures based on our projected cash flows for the year. \nThe following table presents major components of our capital and exploration expenditures:\nNine Months Ended \nSeptember 30,\n(In millions)\n2025\n2024\nAcquisitions\nProved oil and gas properties\n$\n2,473 \n$\n— \nUnproved oil and gas properties\n1,286 \n— \nGathering and pipeline systems\n333 \n— \n$\n4,092 \n$\n— \nCapital expenditures:\n \n \nDrilling and facilities\n$\n1,652 \n$\n1,261 \nPipeline and gathering\n94 \n73 \nOther\n33 \n11 \nCapital expenditures for drilling, completion and other fixed asset additions\n1,779 \n1,345 \nCapital expenditures for leasehold and property acquisitions\n86 \n6 \nExploration expenditures \n(1)\n21 \n19 \n$\n1,886 \n$\n1,370 \n________________________________________________________\n(1)\nExploration expenditures include no exploratory dry hole costs for the nine months ended September 30, 2025 and $5 million of exploratory dry hole costs for the nine months ended September 30, 2024.\nFor the nine months ended September 30, 2025, our capital program focused on the Permian Basin, Marcellus Shale and Anadarko Basin, where we drilled 154.6 net wells and turned-in-line 146.4 net wells. We expect that our full-year 2025 capital program will be approximately $2.3 billion. Refer to “Outlook” above for additional information regarding the current year drilling program. We will continue to assess the commodity price environment and may adjust our capital expenditures accordingly. \n26\nTable of Contents\nContractual Obligations\nWe have various contractual obligations in the normal course of our operations. There have been no material changes to our contractual obligations described under “Gathering, Processing and Transportation Agreements” and “Lease Commitments” as disclosed in Note 8 of the Notes to the Consolidated Financial Statements and the obligations described under “Contractual Obligations” in Item 7 “Management’s Discussion and Analysis of Financial Condition and Results of Operations” included in our Form 10-K.\nCritical Accounting Policies and Estimates\nOur discussion and analysis of our financial condition and results of operations are based on our Condensed Consolidated Financial Statements, which have been prepared in accordance with GAAP. The preparation of these financial statements requires us to make estimates and judgments that affect the reported amounts of assets, liabilities, revenues and expenses. Refer to our Form 10-K for further discussion of our critical accounting policies.\nPurchase Accounting\nFrom time-to-time, we may acquire assets and assume liabilities in transactions accounted for as business combinations, such as the FME and Avant acquisitions. In connection with the FME and Avant acquisitions, we allocated the purchase price consideration to the assets acquired and liabilities assumed based on estimated fair values as of the closing dates of the respective acquisition.\nWe made a number of assumptions in estimating the fair value of assets acquired and liabilities assumed in the FME and Avant acquisitions. The most significant assumptions related to the fair value estimates of proved and unproved oil and gas properties, which were recorded at a total fair value of $3.8 billion. Since sufficient market data was not available regarding the fair values of the acquired proved and unproved oil and gas properties, we prepared our estimates using discounted cash flows and engaged third-party valuation experts. Significant judgments and assumptions are inherent in these estimates and include, among other things, estimates of reserve quantities and production volumes, future commodity prices and price differentials, expected development costs, lease operating costs, reserve risk adjustment factors and an estimate of an applicable market participant discount rate that reflects the risk of the underlying cash flow estimates.\nEstimated fair values assigned to assets acquired can have a significant impact on future results of operations, as presented in our financial statements. Fair values are based on estimates of future commodity prices and price differentials, reserve quantities and production volumes, development costs and lease operating costs. In the event that future commodity prices or reserve quantities or production volumes are significantly lower than those used in the determination of fair value as of the closing dates of the acquisitions, the likelihood increases that certain costs may be determined to be unrecoverable.\nIn addition to the fair value of proved and unproved oil and gas properties, other significant fair value assessments for the assets acquired and liabilities assumed in the FME and Avant acquisitions relate to gathering and pipeline systems. We prepared estimates and engaged third-party valuation experts to assist in the valuation of certain other assets, which required significant judgments and assumptions inherent in the estimates and included projected cash flows and comparable companies’ cash flow multiples. \nRESULTS OF OPERATIONS \nThird Quarters of 2025 and 2024 Compared\nOperating Revenues\nThree Months Ended \nSeptember 30,\nVariance\n(In millions)\n2025\n2024\nAmount\nPercent\nOperating Revenues\nOil\n$\n984 \n$\n765 \n$\n219 \n29 \n%\nNatural gas\n519 \n320 \n199 \n62 \n%\nNGL\n213 \n186 \n27 \n15 \n%\nGain (loss) on derivative instruments, net\n62 \n64 \n(2)\n(3)\n%\nOther \n39 \n24 \n15 \n63 \n%\n \n$\n1,817 \n$\n1,359 \n$\n458 \n34 \n%\n27\nTable of Contents\nProduction Revenues\nOur production revenues are derived from sales of our oil, natural gas and NGL production. Increases or decreases in our revenues, profitability and future production growth are highly dependent on the commodity prices we receive, which, as discussed above, fluctuate due to a variety of factors, including supply and demand, the availability of transportation, seasonality and geopolitical, economic and other factors. \nProduction and Sales Price \nThe following table presents our total and average daily production volumes for oil, natural gas and NGLs, and our average oil, natural gas and NGL sales prices for the periods indicated.\n \nThree Months Ended September 30,\nVariance\n2025\n2024\nAmount\nPercent\nProduction Volumes\nOil (MMBbl)\n15.3\n10.3\n5.0 \n49 \n%\nNatural gas (Bcf)\n266.3\n246.7\n19.6 \n8 \n%\nNGL (MMBbl)\n12.5\n10.1\n2.4 \n24 \n%\nEquivalents (MMBoe)\n72.2\n61.6\n10.6 \n17 \n%\nAverage Daily Production Volumes\nOil (MBbl)\n166.8\n112.3\n54.5\n49 \n%\nNatural gas (MMcf)\n2,894.6\n2,682.0\n212.6\n8 \n%\nNGL (MBbl)\n135.8\n109.7\n26.1\n24 \n%\nEquivalents (MBoe)\n785.0\n669.1\n115.9\n17 \n%\nAverage Sales Price\nExcluding Derivative Settlements\nOil ($/Bbl)\n$\n64.10 \n$\n74.04 \n$\n(9.94)\n(13)\n%\nNatural gas ($/Mcf)\n$\n1.95 \n$\n1.30 \n$\n0.65 \n50 \n%\nNGL ($/Bbl)\n$\n17.02 \n$\n18.42 \n$\n(1.40)\n(8)\n%\nIncluding Derivative Settlements\nOil ($/Bbl)\n$\n64.79 \n$\n74.18 \n$\n(9.39)\n(13)\n%\nNatural gas ($/Mcf)\n$\n2.05 \n$\n1.41 \n$\n0.64 \n45 \n%\nNGL ($/Bbl)\n$\n17.02 \n$\n18.42 \n$\n(1.40)\n(8)\n%\nOil Revenues\n \nThree Months Ended \nSeptember 30,\nVariance\nIncrease\n(Decrease)\n(In millions)\n \n2025\n2024\nAmount\nPercent\nVolume (MMBbl)\n15.3\n10.3\n5.0 \n49 \n%\n$\n371 \nPrice ($/Bbl)\n$\n64.10 \n$\n74.04 \n$\n(9.94)\n(13)\n%\n(152)\n \n \n \n \n$\n219 \nOil revenues increased $219 million due to higher production in the Permian Basin, partially offset by lower oil prices. Production increased due to the FME and Avant acquisitions in the Permian Basin that closed in January 2025 and higher production from our legacy properties.\n28\nTable of Contents\nNatural Gas Revenues\n \nThree Months Ended \nSeptember 30,\nVariance\nIncrease\n(Decrease)\n(In millions)\n \n2025\n2024\nAmount\nPercent\nVolume (Bcf)\n266.3\n246.7\n19.6\n8 \n%\n$\n25 \nPrice ($/Mcf)\n$\n1.95 \n$\n1.30 \n$\n0.65 \n50 \n%\n174 \n \n \n \n \n$\n199 \nNatural gas revenues increased $199 million primarily due to significantly higher natural gas prices and higher production in all areas of our operations. Production increased in the Permian Basin due to the FME and Avant acquisitions that closed in January 2025 and in all areas due to higher production from our legacy properties.  \nNGL Revenues\n \nThree Months Ended \nSeptember 30,\nVariance\nIncrease\n(Decrease)\n(In millions)\n \n2025\n2024\nAmount\nPercent\nVolume (MMBbl)\n12.5\n10.1\n2.4 \n24 \n%\n$\n44 \nPrice ($/Bbl)\n$\n17.02 \n$\n18.42 \n$\n(1.40)\n(8)\n%\n(17)\n \n \n \n \n$\n27 \nNGL revenues increased $27 million primarily due to higher NGL volumes in the Permian and Anadarko Basins, partially offset by lower prices.\nGain (Loss) on Derivative Instruments, Net\nNet gains and losses on our derivative instruments are a function of fluctuations in the underlying commodity index prices as compared to the contracted prices and the monthly cash settlements (if any) of the derivative instruments. We have elected not to designate our derivatives as hedging instruments for accounting purposes and, therefore, we do not apply hedge accounting treatment to our derivative instruments. Consequently, changes in the fair value of our derivative instruments and cash settlements are included as a component of operating revenues as either a net gain or loss on derivative instruments. Cash settlements of our contracts are included in cash flows from operating activities in our statement of cash flows.\nThe following table presents the components of “Gain (loss) on derivative instruments, net” for the periods indicated:\n \nThree Months Ended \nSeptember 30,\n(In millions)\n2025\n2024\nCash received on settlement of derivative instruments\nOil contracts\n$\n10 \n$\n1 \nGas contracts\n26 \n27 \nNon-cash gain (loss) on derivative instruments\nOil contracts\n(25)\n48 \nGas contracts\n51 \n(12)\n$\n62 \n$\n64 \nOperating Costs and Expenses\nCosts associated with producing oil and natural gas are substantial. Among other factors, some of these costs vary with commodity prices, some trend with the volume and commodity mix, some are a function of the number of wells we own and operate, some depend on the prices charged by service companies, and some fluctuate based on a combination of the foregoing. Our costs for services, labor and supplies have modestly declined driven by lower industry activity levels and current oil prices. These savings are being partially offset by tariff impacts that many vendors have faced. In January 2025 with the completion of the FME and Avant acquisitions, we expanded our operations in the Permian Basin.\n29\nTable of Contents\nThe table below reflects our operating costs and expenses for the periods indicated, and a discussion of the operating costs and expenses follows.\n \nThree Months Ended\nSeptember 30,\nVariance\nPer BOE\n(In millions, except per BOE)\n2025\n2024\nAmount\nPercent\n2025\n2024\nOperating Expenses\n \n \n \n \nDirect operations\n$\n275 \n$\n165 \n$\n110 \n67 \n%\n$\n3.80 \n$\n2.69 \nGathering, processing and transportation\n270 \n245 \n25 \n10 \n%\n3.75 \n3.97 \nTaxes other than income  \n93 \n66 \n27 \n41 \n%\n1.29 \n1.08 \nExploration \n7 \n9 \n(2)\n(22)\n%\n0.09 \n0.15 \nDepreciation, depletion and amortization  \n619 \n475 \n144 \n30 \n%\n8.58 \n7.73 \nGeneral and administrative  \n83 \n75 \n8 \n11 \n%\n1.15 \n1.24 \n$\n1,347 \n$\n1,035 \n$\n312 \n30 \n%\n$\n18.66 \n$\n16.86 \nDirect Operations\nDirect operations generally consist of costs for labor, equipment, maintenance, saltwater disposal, compression, power, treating and miscellaneous other costs (collectively, “lease operating expense”). Direct operations also include well workover activity necessary to maintain production from existing wells. \nDirect operations expense consisted of lease operating expense and workover expense as follows:\nThree Months Ended \nSeptember 30,\nPer BOE\n(In millions, except per BOE)\n2025\n2024\nVariance\n2025\n2024\nDirect Operations Expense\nLease operating expense\n$\n214 \n$\n138 \n$\n76 \n$\n2.96 \n$\n2.25 \nWorkover expense\n61 \n27 \n34 \n0.84 \n0.44 \n$\n275 \n$\n165 \n$\n110 \n$\n3.80 \n$\n2.69 \nLease operating expense increased primarily due to higher production levels and higher costs in the Permian Basin driven in part by the FME and Avant acquisitions, which have higher lifting costs than our legacy wells.\nWorkover expense increased $34 million primarily due to increased expenses related to the FME and Avant acquisitions and higher workover activity in the Permian Basin.\nGathering, Processing and Transportation\nGathering, processing and transportation costs principally consist of expenditures to prepare and transport production downstream from the wellhead, including gathering, fuel, and compression, along with processing costs, which are incurred to extract NGLs from the raw natural gas stream. Gathering costs also include costs associated with operating our gas gathering infrastructure, including operating and maintenance expenses. Costs vary by operating area and will fluctuate with increases or decreases in production volumes, contractual fees, and changes in fuel and compression costs.\nGathering, processing and transportation costs increased $25 million primarily due to higher production due to the FME and Avant acquisitions in the Permian Basin that closed in January 2025 and higher production from our legacy properties in the Permian and Anadarko Basins.\n30\nTable of Contents\nTaxes Other Than Income\nTaxes other than income consist of production (or severance) taxes, drilling impact fees, ad valorem taxes and other taxes. State and local taxing authorities assess these taxes, with production taxes being based on the volume or value of production, drilling impact fees being based on drilling activities and prevailing natural gas prices and ad valorem taxes being based on the value of properties.\nThe following table presents taxes other than income for the periods indicated:\nThree Months Ended \nSeptember 30,\n(In millions)\n2025\n2024\nVariance\nTaxes Other than Income\nProduction\n$\n79\n$\n53\n$\n26 \nDrilling impact fees\n6\n4\n2 \nAd valorem\n8\n9\n(1)\n$\n93\n$\n66\n$\n27 \nProduction taxes as percentage of revenue (Permian and Anadarko Basins)\n6.1 \n%\n5.5 \n%\nTaxes other than income increased primarily due to an increase in our production taxes related to higher production as a result of the FME and Avant acquisitions in the Permian Basin that closed in January 2025 and higher production from our legacy properties in the Permian and Anadarko Basins. The production tax rate increased as a result of higher production mix from properties in areas with higher production tax rates. \nDepreciation, Depletion and Amortization (“DD&A”)\nDD&A expense consisted of the following for the periods indicated:\nThree Months Ended \nSeptember 30,\nPer BOE\n(In millions, except per BOE)\n2025\n2024\nVariance\n2025\n2024\nDD&A Expense\nDepletion\n$\n576 \n$\n443 \n$\n133 \n$\n7.98 \n$\n7.19 \nDepreciation\n22 \n18 \n4 \n0.28 \n0.32 \nAmortization of unproved properties\n17 \n12 \n5 \n0.25 \n0.19 \nAccretion of ARO\n4 \n2 \n2 \n0.07 \n0.03 \n$\n619 \n$\n475 \n$\n144 \n$\n8.58 \n$\n7.73 \nDepletion of our producing properties is computed on a field basis using the units-of-production method under the successful efforts method of accounting. The economic life of each producing property depends upon the estimated proved reserves for that property, which in turn depend upon the assumed realized sales price for future production. Therefore, fluctuations in oil and natural gas prices will impact the level of proved developed and proved reserves used in the calculation. Higher prices generally have the effect of increasing reserves, which reduces depletion expense. Conversely, lower prices generally have the effect of decreasing reserves, which increases depletion expense. The cost of replacing production also impacts our depletion expense. In addition, changes in estimates of reserve quantities, estimates of operating and future development costs, reclassifications of properties from unproved to proved and impairments of oil and gas properties will impact depletion expense. Our depletion expense increased $133 million primarily due to a higher depletion rate and an increase in production. Our depletion rate increased primarily due to the increase in value of our oil and gas properties related to assets acquired from FME and Avant, which were recorded at fair value. The depletion rate also increased due to a shift in our production mix to fields with higher depletion rates and changes in our year-end reserves estimates. \nFixed assets consist primarily of gas gathering facilities, water infrastructure, buildings, vehicles, aircraft, furniture and fixtures and computer equipment and software. These items are recorded at cost and are depreciated on the straight-line method based on expected lives of the individual assets, which range from three to 30 years. Also included in our depreciation expense is the depreciation of the right-of-use asset associated with our finance lease gathering system, which ended in the third quarter of 2025. \n31\nTable of Contents\nUnproved properties are amortized based on our drilling experience and our expectation of converting our unproved leaseholds to proved properties. The rate of amortization depends on the timing and success of our exploration and development program. If development of unproved properties is deemed unsuccessful, and the properties are abandoned or surrendered, the capitalized costs are expensed in the period the determination is made.\nGeneral and Administrative (“G&A”)\nG&A expense consists primarily of salaries and related benefits, stock-based compensation, office rent, legal and consulting fees, systems costs and other administrative costs incurred.\nThe table below reflects our G&A expense for the periods indicated:\nThree Months Ended \nSeptember 30,\n(In millions)\n2025\n2024\nVariance\nG&A Expense\nGeneral and administrative expense\n$\n70 \n$\n61 \n$\n9 \nStock-based compensation expense\n13 \n14 \n(1)\n$\n83 \n$\n75 \n$\n8 \nG&A expense, excluding stock-based compensation expense, increased $9 million primarily due to higher employee-related costs and legal and professional fees. \nStock-based compensation expense will fluctuate based on the grant date fair value of awards, the number of awards, the requisite service period of the awards, estimated employee forfeitures, and the timing of the awards. \nInterest Expense\nThe table below reflects our interest expense for the periods indicated:\nThree Months Ended \nSeptember 30,\n(In millions)\n2025\n2024\nVariance\nInterest Expense\nInterest expense\n$\n53 \n$\n27 \n$\n26 \nDebt premium and discount amortization, net\n(5)\n(5)\n— \nDebt issuance cost amortization\n3 \n1 \n2 \nOther\n(1)\n1 \n(2)\n$\n50 \n$\n24 \n$\n26 \nInterest expense increased primarily due to an increase of $26 million related to interest on debt balances. This increase was primarily due to the issuance of $750 million of 5.40% senior notes in December 2024, $750 million of 5.90% senior notes in December 2024 and $1.0 billion of term loans issued in January 2025 to partially fund the FME and Avant acquisitions. These increases were partially offset by decreases related to repayments of $575 million related to the 3.65% weighted-average private placement senior notes in September 2024 and $600 million of our term loans in 2025.\nInterest Income\nInterest income decreased $14 million due to lower cash balances during 2025 compared to 2024 and a decrease in interest earned on our higher interest rate short-term investment balances that matured in September 2024.\n32\nTable of Contents\nIncome Tax Expense\nThree Months Ended \nSeptember 30,\n(In millions)\n2025\n2024\nVariance\nIncome Tax Expense\nCurrent tax (benefit) expense\n$\n(123)\n$\n104\n$\n(227)\nDeferred tax expense (benefit)\n224 \n(37)\n261 \n$\n101 \n$\n67\n$\n34 \nCombined federal and state effective income tax rate\n24.1 \n%\n21.0 \n%\nIncome tax expense increased $34 million for the three months ended September 30, 2025 compared to the three months ended September 30, 2024 primarily due to higher pre-tax income and a higher effective tax rate. The effective tax rate increased due to differences in permanent book-to-tax adjustments and non-recurring discrete items recorded during the three months ended September 30, 2025 and 2024.\nFirst Nine Months of 2025 and 2024 Compared\nOperating Revenues\n \nNine Months Ended \nSeptember 30,\nVariance\n(In millions)\n2025\n2024\nAmount\nPercent\nOil\n$\n2,758 \n$\n2,240 \n$\n518 \n23 \n%\nNatural gas\n2,018 \n1,177 \n841 \n71 \n%\nNGL\n638 \n535 \n103 \n19 \n%\nGain (loss) on derivative instruments, net\n182 \n48 \n134 \n279 \n%\nOther \n90 \n63 \n27 \n43 \n%\n \n$\n5,686 \n$\n4,063 \n$\n1,623 \n40 \n%\n33\nTable of Contents\nProduction Revenues\nProduction and Sales Price\nThe following table presents our total and average daily production volumes for oil, natural gas and NGLs, and our average oil, natural gas and NGL sales prices for the periods indicated.\n \nNine Months Ended \nSeptember 30,\nVariance\n \n2025\n2024\nAmount\nPercent\nProduction Volumes\nOil (MMBbl)\n42.2\n29.4\n12.8 \n44 \n%\nNatural gas (Bcf)\n813.1\n769.1\n44.0 \n6 \n%\nNGL (MMBbl)\n33.1\n27.3\n5.8 \n21 \n%\nEquivalents (MMBoe)\n210.8\n184.9\n25.9 \n14 \n%\nAverage Daily Production Volumes\nOil (MBbl)\n154.6\n107.4 \n47.2 \n44 \n%\nNatural gas (MMcf)\n2,978.5 \n2,806.8 \n171.7 \n6 \n%\nNGL (MBbl)\n121.1\n99.6\n21.5 \n22 \n%\nEquivalents (MBoe)\n772.0\n674.8\n97.2 \n14 \n%\nAverage Sales Price\nExcluding Derivative Settlements\nOil ($/Bbl)\n$\n65.36 \n$\n76.16 \n$\n(10.80)\n(14)\n%\nNatural gas ($/Mcf)\n$\n2.48 \n$\n1.53 \n$\n0.95 \n62 \n%\nNGL ($/Bbl)\n$\n19.29 \n$\n19.59 \n$\n(0.30)\n(2)\n%\nIncluding Derivative Settlements\nOil ($/Bbl)\n$\n65.89 \n$\n76.17 \n$\n(10.28)\n(13)\n%\nNatural gas ($/Mcf)\n$\n2.52 \n$\n1.65 \n$\n0.87 \n53 \n%\nNGL ($/Bbl)\n$\n19.29 \n$\n19.59 \n$\n(0.30)\n(2)\n%\nOil Revenues\n \nNine Months Ended \nSeptember 30,\nVariance\nIncrease\n(Decrease)\n(In millions)\n \n2025\n2024\nAmount\nPercent\nVolume (MMBbl)\n42.2\n29.4\n12.8 \n44 \n%\n$\n973 \nPrice ($/Bbl)\n$\n65.36 \n$\n76.16 \n$\n(10.80)\n(14)\n%\n(455)\n$\n518 \nOil revenues increased $518 million primarily due to higher production in the Permian Basin, partially offset by lower oil prices. Production increased due to the FME and Avant acquisitions in the Permian Basin that closed in January 2025 and higher production from our legacy properties.\n34\nTable of Contents\nNatural Gas Revenues\n \nNine Months Ended \nSeptember 30,\nVariance\nIncrease\n(Decrease)\n(In millions)\n \n2025\n2024\nAmount\nPercent\nVolume (Bcf)\n813.1\n769.1\n44.0 \n6 \n%\n$\n67 \nPrice ($/Mcf)\n$\n2.48 \n$\n1.53 \n$\n0.95 \n62 \n%\n774 \n$\n841 \nNatural gas revenues increased $841 million primarily due to significantly higher natural gas prices and higher production in the Permian and Anadarko Basins, partially offset by slightly lower production in the Marcellus Shale. Production increased due to the FME and Avant acquisitions in the Permian Basin that closed in January 2025 and higher production from our legacy properties in the Permian and Anadarko Basins.\n \nNGL Revenues\n \nNine Months Ended \nSeptember 30,\nVariance\nIncrease\n(Decrease)\n(In millions)\n \n2025\n2024\nAmount\nPercent\nVolume (MMBbl)\n33.1\n27.3\n5.8 \n21 \n%\n$\n113 \nPrice ($/Bbl)\n$\n19.29 \n$\n19.59 \n$\n(0.30)\n(2)\n%\n(10)\n \n \n \n \n$\n103 \nNGL revenues increased $103 million primarily due to higher volumes in the Permian and Anadarko Basins and slightly lower NGL prices.\nGain (Loss) on Derivative Instruments, Net\nThe following table presents the components of “Gain (loss) on derivative instruments, net” for the periods indicated:\n \nNine Months Ended \nSeptember 30,\n(In millions)\n2025\n2024\nCash received on settlement of derivative instruments\nOil contracts\n$\n22 \n$\n— \nGas contracts\n27 \n90 \nNon-cash gain (loss) on derivative instruments\nOil contracts\n63 \n14 \nGas contracts\n70 \n(56)\n$\n182 \n$\n48 \n35\nTable of Contents\nOperating Costs and Expenses\nThe table below reflects our operating costs and expenses for the periods indicated, and a discussion of the operating costs and expenses follows:\n \nNine Months Ended \nSeptember 30,\nVariance\nPer Boe\n(In millions, except per Boe)\n2025\n2024\nAmount\nPercent\n2025\n2024\nOperating Expenses\n \n \n \n \nDirect operations\n$\n727 \n$\n481 \n$\n246 \n51 \n%\n$\n3.45 \n$\n2.60 \nGathering, processing and transportation\n823 \n737 \n86 \n12 \n%\n3.91 \n3.98 \nTaxes other than income  \n276 \n194 \n82 \n42 \n%\n1.31 \n1.05 \nExploration \n21 \n19 \n2 \n11 \n%\n0.10 \n0.10 \nDepreciation, depletion and amortization  \n1,704 \n1,354 \n350 \n26 \n%\n8.09 \n7.32 \nGeneral and administrative  \n259 \n218 \n41 \n19 \n%\n1.23 \n1.19 \n$\n3,810 \n$\n3,003 \n$\n807 \n27 \n%\n$\n18.09 \n$\n16.24 \nDirect Operations\nDirect operations expense consisted of lease operating expense and workover expense as follows:\nNine Months Ended \nSeptember 30,\nPer Boe\n(In millions, except per Boe)\n2025\n2024\nVariance\n2025\n2024\nDirect Operations\nLease operating expense\n$\n597 \n$\n402 \n$\n195 \n$\n2.83 \n$\n2.17 \nWorkover expense\n130 \n79 \n51 \n0.62 \n0.43 \n$\n727 \n$\n481 \n$\n246 \n$\n3.45 \n$\n2.60 \nLease operating expense increased primarily due to higher production levels and higher costs in the Permian Basin driven in part by the FME and Avant acquisitions, which have higher lifting costs than our legacy wells.\nWorkover expense increased by $51 million primarily due to higher expense related to the FME and Avant acquisitions and higher workover activity in the Permian Basin, partially offset by lower activity in the Marcellus Shale due to reduced activity in the basin.\nGathering, Processing and Transportation\nGathering, processing and transportation costs increased $86 million, primarily due to higher production due to the FME and Avant acquisitions in the Permian Basin that closed in January 2025 and higher production from our legacy properties in the Permian and Anadarko Basins. \nTaxes Other Than Income\nThe following table presents taxes other than income for the periods indicated:\nNine Months Ended \nSeptember 30,\n(In millions)\n2025\n2024\nVariance\nTaxes Other than Income\nProduction\n$\n226\n$\n159\n$\n67 \nDrilling impact fees\n17\n11\n6 \nAd valorem\n32\n25\n7 \nOther\n1\n(1)\n2 \n$\n276\n$\n194\n$\n82 \nProduction taxes as percentage of revenue (Permian and Anadarko Basins)\n6.0 \n%\n5.6 \n%\n36\nTable of Contents\nTaxes other than income increased $82 million primarily due to an increase in our production, drilling impact fees and ad valorem taxes. Production taxes increased primarily due to higher production due to the FME and Avant acquisitions in the Permian Basin that closed in January 2025 and higher production from our legacy properties in the Permian and Anadarko Basins. Drilling impact fees increased due to increased drilling activity in the Marcellus Shale during 2025 compared to 2024. Ad valorem taxes increased due to a reduction in 2024 ad valorem tax expense related to an adjustment for estimated tax accruals related to the full-year 2023. \nDepreciation, Depletion and Amortization (“DD&A”)\nDD&A expense consisted of the following for the periods indicated:\nNine Months Ended \nSeptember 30,\nPer BOE\n(In millions, except per BOE)\n2025\n2024\nVariance\n2025\n2024\nDD&A Expense\nDepletion\n$\n1,579 \n$\n1,256 \n$\n323 \n$\n7.49 \n$\n6.79 \nDepreciation\n69 \n54 \n15 \n0.34 \n0.30 \nAmortization of unproved properties\n45 \n36 \n9 \n0.21 \n0.19 \nAccretion of ARO\n11 \n8 \n3 \n0.05 \n0.04 \n$\n1,704 \n$\n1,354 \n$\n350 \n$\n8.09 \n$\n7.32 \n Our depletion expense increased $323 million primarily due to a higher depletion rate and an increase in production. Our depletion rate increased primarily due to the increase in value of our oil and gas properties related to assets acquired from FME and Avant, which were recorded at fair value. The depletion rate also increased due to a shift in our production mix to fields with higher depletion rates and changes in our year-end reserves estimates. \n Our depreciation expense increased primarily due to fixed assets acquired from FME and Avant. \nOur amortization of unproved properties increased primarily due to unproved properties acquired from FME and Avant.\nGeneral and Administrative (“G&A”)\nThe table below reflects our G&A expense for the periods indicated:\nNine Months Ended \nSeptember 30,\n(In millions)\n2025\n2024\nVariance\nG&A Expense\nGeneral and administrative expense\n$\n216 \n$\n175 \n$\n41 \nStock-based compensation expense\n43 \n43 \n— \n$\n259 \n$\n218 \n$\n41 \nG&A expense, excluding stock-based compensation expense, increased $41 million primarily due to acquisition and transition costs associated with the FME and Avant acquisitions completed in January 2025, increased employee-related costs and higher legal and professional fees, partially offset by the recognition of certain long-term commitments for community outreach and charitable contributions that were accrued in 2024.\nStock-based compensation expense will fluctuate based on the grant date fair value of awards, the number of awards, the requisite service period of the awards, estimated employee forfeitures, and the timing of the awards. \n37\nTable of Contents\nInterest Expense\nThe table below reflects our interest expense for the periods indicated:\nNine Months Ended \nSeptember 30,\n(In millions)\n2025\n2024\nVariance\nInterest Expense\nInterest expense\n$\n162 \n$\n76 \n$\n86 \nDebt premium and discount amortization, net\n(16)\n(16)\n— \nDebt issuance cost amortization\n6 \n3 \n3 \nOther\n4 \n14 \n(10)\n$\n156 \n$\n77 \n$\n79 \nInterest expense increased $79 million primarily due to an increase of $86 million related to interest on debt balances. This increase was primarily due to the issuance of $500 million of 5.60% senior notes in early March 2024, $750 million of 5.40% senior notes in December 2024, $750 million of 5.90% senior notes in December 2024 and $1.0 billion of term loans issued in January 2025 to fund the FME and Avant acquisitions. These increases were partially offset by repayments of $575 million related to the 3.65% weighted-average private placement senior notes in September 2024 and $600 million of term loans. Other interest expense decreased $10 million primarily due to assessments arising from the timing of certain regulatory filings in 2024.\nInterest Income\nInterest income decreased $39 million due to lower cash balances during 2025 compared to 2024 and a decrease in interest earned on short-term investment balances that matured in September 2024.\nIncome Tax Expense\nNine Months Ended \nSeptember 30,\n(In millions)\n2025\n2024\nVariance\nIncome Tax Expense\nCurrent tax expense\n$\n104\n$\n273\n$\n(169)\nDeferred tax expense (benefit)\n285\n(60)\n345 \n$\n389\n$\n213\n$\n176 \nCombined federal and state effective income tax rate\n22.4 \n%\n20.5 \n%\nIncome tax expense increased $176 million for the nine months ended September 30, 2025 compared to the nine months ended September 30, 2024 primarily due to higher pre-tax income and a higher effective tax rate. The effective tax rate increased due to differences in permanent book-to-tax adjustments and non-recurring discrete items recorded during the nine months ended September 30, 2025 and 2024.\nForward-Looking Information\nThis report includes forward-looking statements within the meaning of federal securities laws. All statements, other than statements of historical fact, included in this report are forward-looking statements. Such forward-looking statements include, but are not limited, statements regarding future financial and operating performance and results, strategic pursuits and goals, market prices, future hedging and risk management activities, the impact of tariffs, timing and amount of capital expenditures and other statements that are not historical facts contained in this report. The words “expect,” “project,” “estimate,” “believe,” “anticipate,” “intend,” “budget,” “plan,” “forecast,” “target,” “predict,” “potential,” “possible,” “may,” “should,” “could,” “would,” “will,” “strategy,” “outlook” and similar expressions are also intended to identify forward-looking statements. We can provide no assurance that the forward-looking statements contained in this report will occur as expected, and actual results may differ materially from those included in this report. Forward-looking statements are based on current expectations and assumptions that involve a number of risks and uncertainties that could cause actual results to differ materially from those included in this report. These risks and uncertainties include, without limitation, the availability of cash on hand and other sources of liquidity to fund our capital expenditures, changes in U.S. and international economic policy (including tariffs and retaliatory tariffs and the impacts thereof), actions by, or disputes among or between, members of OPEC+, market factors, \n38\nTable of Contents\nmarket prices (including geographic basis differentials) of oil and natural gas, impacts of inflation, labor shortages and economic disruption, geopolitical disruptions such as the war in Ukraine or the conflict in the Middle East or further escalation thereof, the potential effects of ongoing political and military disputes, results of future drilling and marketing activities (including seismicity and similar data), future production and costs, legislative and regulatory initiatives, electronic, cyber or physical security breaches, the impact of public health crises, including pandemics and epidemics and any related company or governmental policies or actions, and other factors detailed herein and in our other SEC filings. Refer to “Risk Factors” in Item 1A of Part I of our Form 10-K for additional information about these risks and uncertainties. Forward-looking statements are based on the estimates and opinions of management at the time the statements are made. Except to the extent required by applicable law, we undertake no obligation to update or revise any forward-looking statement, whether as a result of new information, future events or otherwise. You are cautioned not to place undue reliance on these forward-looking statements, which speak only as of the date hereof. \nInvestors should note that we announce material financial information in SEC filings, press releases and public conference calls. Based on guidance from the SEC, we may use the Investors section of our website (www.coterra.com) to communicate with investors. It is possible that the financial and other information posted there could be deemed to be material information. The information on our website is not part of, and is not incorporated into, this report."
}