{
  "source_file": "ctsh-20241231.htm",
  "form_type": "10-K",
  "item1": "Item 1. Business\nOverview\nCognizant is one of the world’s leading professional services companies, engineering modern businesses and delivering strategic outcomes for our clients. We help clients modernize technology, reimagine processes and transform experiences so they can stay ahead in today's fast-changing world, where AI is beginning to reshape organizations in every field. We provide industry expertise and close client collaboration, combining critical perspective with a flexible engagement style. We tailor our services and solutions to specific industries with an integrated global delivery model that employs client service and delivery teams based at client locations and dedicated global and regional delivery centers. Our collaborative services include digital services and solutions, consulting, application development, systems integration, quality engineering and assurance, engineering research and development, application maintenance, infrastructure and security as well as business process services and automation. Digital, AI-enhanced services continue to be an important part of our portfolio, aligning with our clients' focus on becoming data-enabled, customer-centric and differentiated businesses. \nOur purpose, vision and values are central to Cognizant's strategic approach. We have evolved our values to prioritize those that support our vision and enhance our ability to innovate and co-create with our clients.\nIn order to achieve this vision and support our clients, we are focusing on accelerating growth, becoming an employer of choice and simplifying our operations through modernization and an AI-enabled IT roadmap. In executing our strategy, we seek to drive organic growth through investments in our digital and AI capabilities across industries and geographies, including the extensive training and reskilling of our technical teams and the expansion of our local workforces in the United States and other markets around the world. Additionally, we pursue select strategic acquisitions to expand our talent, experience and capabilities in key technologies or in particular geographies or industries. In 2024, we acquired Belcan, a leading global supplier of engineering research & development services for the commercial aerospace, defense, space, marine and industrial verticals, and Thirdera, an Elite ServiceNow Partner specializing in advisory, implementation and optimization solutions related to the ServiceNow platform. See \nNote 3\n to our consolidated financial statements for additional information.\nWe are focused on expanding our partner ecosystem across a broad range of technology companies, including hyperscalers, cloud providers, enterprise software companies, best-in-class digital software enterprises and emerging start-ups. We believe this partner ecosystem will enable us to enhance our innovative, integrated offerings, by combining third-party products with our service solutions, to deliver enterprise-wide digital transformation.\nCognizant\n5\nDecember 31, 2024 Form 10-K\nTable of Contents\n                                                \nReportable Business Segments\nIn 2024, we went to market across seven industry-based operating segments, which are aggregated into four reportable business segments:  \n•\nHealth Sciences (HS)\n - This reportable business segment is comprised of a single operating segment of the same name.\n•\nFinancial Services (FS)\n◦\nBanking\n◦\nInsurance\n•\nProducts and Resources (P&R)\n◦\nRetail and Consumer Goods\n◦\nManufacturing, Logistics, Energy and Utilities\n◦\nTravel and Hospitality\n•\nCommunications, Media and Technology (CMT) \n- This reportable business segment is comprised of a single operating segment of the same name.\nBeginning in 2025, we go to market across four industry-based operating segments, which will match our four reportable business segments - (i) Health Sciences (ii) Financial Services (iii) Products and Resources and (iv) Communications, Media and Technology. These changes reflect how the operating segments will be managed and reported to the CODM but will not affect the reportable segments' financial results.\nOur clients seek to partner with service providers that have a deep understanding of their businesses, industry initiatives, customers, markets and cultures and the ability to create solutions tailored to meet their individual business needs. Across industries, our clients are confronted with the risk of being disrupted by nimble, digital-native competitors. Our clients increasingly feel the need to transform and are therefore redirecting their focus and investment to new operating models and embracing DevOps, AI and other key technologies that enable quick adjustments to shifts in their markets. We believe that our deep knowledge of our clients’ businesses and the industries we serve has been central to our growth and high client satisfaction, and we continue to develop and deploy our client-centric culture, innovating together to produce transformative outcomes.\nOur HS segment consists of healthcare providers and payers, and life sciences companies, including pharmaceutical, biotech and medical device companies. Demand in this segment is driven by emerging industry trends, including the shift towards consumerism, outcome-based care, digital health and delivering seamless, patient-centered experiences. These trends result in increased demand for services that drive operational improvements in areas such as clinical development, pharmacovigilance and manufacturing, as well as claims processing, enrollment, membership and revenue cycle management. Demand is also created by the adoption and integration of digital technologies such as AI and predictive data analytics to improve clinical trial designs, data security, patient engagement and care outcomes.\nOur FS segment includes banking, capital markets, payments and insurance companies. Demand in this segment is driven by our clients’ need to modernize legacy infrastructure and adopt digital technologies to serve their customers while complying with significant regulatory requirements and adapting to market changes. These technologies enable enhanced customer experience, through automation, analytics and AI-driven value creation in areas such as digital lending, hyper-personalized banking, fraud detection, underwriting and next-generation payments. Clients are also increasingly leveraging technology services partners as end-to-end orchestrators uniting hyperscalers, independent software vendors, fintech players, data providers, and enterprise and business process management\n \nplatforms to deliver integrated solutions at scale and speed.\nOur P&R segment includes manufacturers, automakers, retailers, consumer goods companies, and travel and hospitality companies, as well as businesses providing logistics, energy and utility services. Demand in this segment is driven by our clients’ focus on improving the efficiency and sustainability of their operations; the enablement and integration of mobile platforms to support sales and customer experience enhancement initiatives; the generational shift from mechanical to software-defined, experience-driven vehicles; grid modernization to support a consumer-driven energy landscape that enables cleaner, more efficient energy use; and their adoption and integration of digital technologies, such as intelligent systems to manage supply chains and enhance overall customer experiences, and IoT to generate data and insights for factories, fleets, products and real estate companies.\nOur CMT segment includes global communications, media and entertainment, education, information services and technology companies. Demand in this segment is driven by our clients’ need for services related to digital content, business \nCognizant\n6\nDecember 31, 2024 Form 10-K\nTable of Contents\n                                                \nprocess automation, AI adoption, operational efficiency, unified user experiences and the generation of new revenue streams. In response to this demand, our focus areas include network monetization, media supply chain transformation, product engineering, AI integration, verticalization, data modernization and customer experience design.\nFor the year ended December 31, 2024, the distribution of our revenues across our four reportable business segments was as follows:\nThe services we provide are distributed among a number of clients in each of our reportable business segments. The volume of work performed for specific clients may vary significantly from year to year. A loss of a significant client or a few significant clients in a particular segment could materially reduce revenues for that segment. The services we provide to our larger clients are often critical to their operations and termination of our services would typically require an extended transition period with gradually declining revenues. \nSee \nNote 2\n to our consolidated financial statements for additional information related to disaggregation of revenues by client location, service line and contract-type for each of our reportable business segments. \nServices and Solutions\nOur services include AI and other technology services and solutions, consulting, application development, systems integration, quality engineering and assurance, application maintenance, infrastructure and security as well as business process services and automation. Additionally, we develop, license, implement and support proprietary and third-party software products and platforms. Central to our strategy to align with our clients’ need for continuous transformation is our sustained investment in new technologies, including new forms of AI, cloud, data modernization, automation, digital engineering and IoT. These capabilities enable clients to put AI at the core of their operations, improve the experiences they offer to their customers, tap into new revenue streams, automate operations, defend against digital- and AI-native competitors and reduce costs. \nIn most cases, our clients operate in hybrid technology environments, running critical new digital initiatives alongside essential legacy systems. In the AI era, our clients have an accelerated need to modernize their businesses, which has intensified demand for next-gen capabilities in AI, automation, digital commerce and secure distributed work. We believe our deep understanding of our clients' established systems and their digital ambitions provides us with a unique advantage as we work with them to architect solutions that are both transformative and practical.\nOur services and solutions are organized into six integrated practices, which help us deliver these capabilities in ways that align with each client’s specific transformation journey. These practices are Core Technologies and Insights, Enterprise Platform Services, Industry Solutions, Intuitive Operations and Automation, Software and Platform Engineer\ning, and Cognizant Moment, our new digital experience practice. \nOur consulting professionals have deep industry-specific expertise and work closely across our practices to create intuitive operating models that leverage a wide range of technologies across our clients’ enterprises to deliver higher levels of efficiency, new value for their customers and business outcomes that align to their industries.\nCognizant\n7\nDecember 31, 2024 Form 10-K\nTable of Contents\n                                                \nCore Technologies and Insights\nOur Core Technologies and Insights practice helps clients build agile and relevant organizations that apply the power of AI, cloud, data and IoT to help them perform better and innovate faster. Our clients can harness data securely in cloud-first architectures, enabling them to become highly resilient enterprises that are capable of quickly adapting to market dynamics. Areas of focus within this practice are:\n•\nAI and analytics, which helps clients identify and adopt the best AI use cases for their enterprise and formulate actionable insights from unstructured data to drive a greater understanding of their customers and operations;\n•\nCloud, infrastructure and security, which helps simplify, modernize and safeguard IT environments, creating a solid foundation for AI innovation; and\n•\nIoT, which enables the convergence of the physical and the digital in smart products.\n \nEnterprise Platform Services\nOur Enterprise Platform Services practice helps our clients transform multiple front- and back-office business processes, implementing enterprise-wide platforms that enable customer experience, customer relationship management, human capital management, supply chain management, enterprise resource planning and financial processes. Our services decrease time to market, drive efficiencies and deliver impactful experiences. Our clients can better share information, simplify IT processes, automate workflow and improve flexibility. This practice focuses on application services, which help enterprises engage their partner ecosystems more productively, and run their operations and financial organizations more efficiently while enabling improved employee and customer experiences. We work closely with partners including Adobe, Amazon Web Services, Cisco, Google, Microsoft, Oracle, Pegasystems, Salesforce, SAP, ServiceNow, Workday and many others.\nIndustry Solutions\nOur Industry Solutions practice was established in 2023 as part of Cognizant’s strategy to build differentiation at the industry level. The practice integrates industry technologists and thought leaders specialized in vertical micro-segments. These teams work with specialized partners to develop industry-specific products and services that enable clients to improve productivity, increase operational excellence and accelerate innovation.\nIntuitive Operations and Automation\nOur Intuitive Operations and Automation practice helps clients build and run modern operations through two main vehicles: AI-led automation, which includes advisory and process and IT automation solutions designed to simplify and accelerate automation adoption, and business process outsourcing services, which help deliver business outcomes including revenue growth, increased customer and employee satisfaction and cost savings.\n \nOur automation advisory, implementation and managed services experts partner with clients to transform end-to-end processes, design and manage the next-generation human and digital workforce, enable seamless experiences and achieve multi-fold productivity increases. Our technology-driven business process outsourcing services help clients transform and run functions and industry-specific processes such as finance and accounting, omni-channel customer care, loan origination, annotation services, location-based services and medical data management. \nSoftware and Platform Engineering\nOur Software and Platform Engineering practice helps clients develop modern enterprises through digital software engineering products, services and solutions that support optimization and modernization of their IT estates and deliver new value for their customers. This practice manages delivery platforms that enable enterprise transformation at scale and accelerate the wide use of generative AI in the enterprise. Our clients can leverage data, technologies and our digital engineering, design and product development capabilities to build world-class experiences, and a responsive, agile and intuitive framework for continuous innovation. Areas of focus are:\n•\nDigital engineering, which delivers modern business software;\n•\nApplication development and management, which improves or reimagines applications; and\n•\nQuality engineering and assurance, which helps clients build and run the highest quality software.\nCognizant\n8\nDecember 31, 2024 Form 10-K\nTable of Contents\n                                                \nDigital Experience Services (Cognizant Moment)\nEstablished in 2024, Cognizant Moment is our digital experience practice, designed to help clients leverage the power of AI to reimagine customer experiences and engineer innovative strategies aimed at driving growth. Cognizant Moment delivers intelligent ecosystem orchestration, connecting experiences as well as their underlying data, technology and operations across the entire enterprise. This approach enables clients to leverage generative AI's content generation capabilities alongside human ingenuity to innovate and differentiate by informing and automating processes, and creating dynamic, hyper-personalized experiences for their customers.\nGlobal Delivery Model\nWe operate in an integrated global delivery model, with delivery centers worldwide to provide our full range of services to our clients. Our model leverages methodologies, tools, AI and other enablers to optimize delivery by enhancing people's capabilities through technology. We continue to modernize our delivery operations through lean processes, increased automation and integrated, AI-infused systems. Our employees are deployed at client sites, local or in-country delivery centers, regional delivery centers and offshore delivery centers, as required to best serve our clients. Our extensive facilities, technology and communications infrastructure are designed to enable the effective collaboration of our global workforce across locations and geographies. \nCompetition\nThe markets for our services are highly competitive, characterized by a large number of participants and subject to rapid change. Competitors may include systems integration firms, contract programming companies, application software companies, cloud computing service providers, traditional consulting firms, professional services groups of computer equipment companies, infrastructure management companies, outsourcing companies, boutique digital companies and clients' in-house technology resources, such as GCCs. Our direct competitors include, among others, Accenture, Atos, Capgemini, CGI, Deloitte Digital, DXC Technology, EPAM Systems, Genpact, HCL Technologies, IBM Consulting, Infosys Technologies, Tata Consultancy Services and Wipro. In addition, we compete with numerous smaller local companies in the various geographic markets in which we operate. For additional information, see \nPart I, Item 1A. Risk Factors\n.\nThe principal competitive factors affecting the markets for our services include the provider’s reputation and experience, strategic advisory capabilities, digital services capabilities, performance and reliability, responsiveness to customer needs, financial stability, corporate governance and competitive pricing of services. Accordingly, we rely on the following to compete effectively:\n•\ninvestments to scale our AI capabilities;\n•\nour recruiting, training and retention model;\n•\nan entrepreneurial culture and approach to our work;\n•\na broad client referral base;\n•\ninvestment in process improvement and knowledge capture;\n•\nour global delivery model;\n•\nfinancial stability and good corporate governance;\n•\ncontinued focus on responsiveness to client needs, quality of services and competitive prices; and\n•\nproject management capabilities and technical expertise.\nIntellectual Property, Certain Trademarks, Trade Names and Service Marks\nWe provide value to our clients based, in part, on our proprietary innovations, methodologies, software, reusable knowledge capital and other IP assets. We recognize the importance of IP and its ability to differentiate us from our competitors. Accordingly, we have made investments in protecting our IP, including areas directed at AI-related technologies. We seek IP protection for many of our innovations and rely on a combination of patent, copyright and trade secret laws, confidentiality procedures and contractual provisions to protect our IP. We have registered, and applied for the registration of, U.S. and international trademarks, service marks, and domain names to protect our brands, including our Cognizant brand, which is one of our most valuable assets. We own or are licensed under a number of patents, trademarks and copyrights of varying duration, relating to our products and services. We also have policies requiring our employees to respect the IP rights of others. While our proprietary IP rights are important to our success, we believe our business as a whole is not materially dependent on any particular IP right or any particular group of patents, trademarks, copyrights or licenses, other than our Cognizant brand.\nCognizant\n9\nDecember 31, 2024 Form 10-K\nTable of Contents\n                                                \nCognizant® and other trademarks appearing in this report are registered trademarks or trademarks of Cognizant and its affiliates in the United States and other countries. This Annual Report on Form 10-K also contains trademarks, trade names and service marks of other companies, which are the property of their respective owners. Solely for convenience, trademarks, trade names and service marks referred to in this Annual Report on Form 10-K may appear without the ®, ™ or SM symbols, but such references are not intended to indicate, in any way, that we will not assert, to the fullest extent under applicable law, our rights to these trademarks, trade names and service marks. We do not intend our use or display of other parties’ trademarks, trade names or service marks to imply, and such use or display should not be construed to imply a relationship with, or endorsement or sponsorship of us by, these other parties.\nOur People and Culture\nCognizant is a people-centric company, with a distinct culture that is highly collaborative, innovative and supportive. We aim to be the employer of choice in our industry and for our people to feel motivated, engaged, included and empowered to do their best work through meaningful careers. \nWe had approximately 336,800 employees at the end of 2024, with 241,500 in India, 42,800 in North America, 15,700 in Continental Europe, 8,200 in the United Kingdom and 28,600 in various other locations throughout the rest of the world. As of December 31, 2024, women represented approximately 38% of our workforce. \nWe utilize subcontractors to provide additional capacity and flexibility in meeting client demand, though the number of subcontractors has historically been immaterial relative to our employee headcount. We are not party to any significant collective bargaining agreements. Globally, we balance the portion of our employees that rely on visas with consideration of the needs of our business to fulfill client demand and the risks to our business, including the costs associated with and ability to staff employees on visas to work in-country. For additional information, see \nPart I, Item 1A. Risk Factors\n.\n•\nCulture and experience: \nOur vibrant culture is a key differentiator. We work intentionally to create a global community that is high energy, collaborative, inclusive and innovative. \n–\nOur people are guided by our core values, which we refreshed in 2024 based on input from employees and others: work as one, raise the bar, dare to innovate, do the right thing and own it.\n–\nEmployees are encouraged to embrace a spirit of innovation and entrepreneurship: our grassroots Bluebolt program enables any employee to submit ideas for implementation with clients or internally.\n–\nOur global affinity groups available to all employees, learning courses on leadership, and leader guides to create thriving teams help to ensure our people feel respected and comfortable bringing their unique talents to shape stronger outcomes for clients.\n–\nOur employees are passionate about volunteerism: in 2024, over 47,000 employees gave their time and talents to causes such as community skilling and education.\n•\nEmployee engagement and retention\n: We prioritize listening to our people and enhancing the employee experience to ensure our employees feel heard, valued and supported in their roles.  \n–\nWe conduct an annual engagement survey to collect employee feedback. After each survey, we report and act upon results, and people managers build action plans for improvement.\n–\nWe regularly assess retention. For the years ended December 31, 2024 and 2023, our Voluntary Attrition - Tech Services was 15.9% and 13.8%, respectively.\n–\nWe’re recognized as a top employer by leading organizations based on the experiences and real feedback of our people. In 2024, this included: Great Place to Work® Certification™ in 20 countries representing approximately 85% of our population, America's Greatest Workplaces from Newsweek, The American Opportunity Index 2024 Employer of Choice, Forbes World's Best Employers, Work Wellbeing 100, Time’s World's Best Companies 2024, LinkedIn Top Companies in India, among others.  \n•\nContinuous upskilling:\n Learning is at the core of our business. From pre-employment to experienced practitioners, our award-winning learning ecosystem enables all levels of our workforce to stay on the leading edge of technology and acquire new skills that power their career growth. \n–\nIn 2024, more than 277,000 employees acquired at least one skill through our learning ecosystem. \n–\nIn addition to digital skills, we prioritize generative AI skill building – more than 168,000 associates, including 1,700 leaders, have taken generative AI trainings in 2024, including through Cognizant’s Synapse program.\nCognizant\n10\nDecember 31, 2024 Form 10-K\nTable of Contents\n                                                \n–\nWe provide a learning marketplace and tailored learning journeys to employees based on market trends, current skills and employee interests.\n•\nCareer and talent development\n: We seek to enable our people to build unique and varied careers with Cognizant, and to empower them to shape their paths.\n–\nWe encourage regular role movement and career growth and progression through an internal job move program, a talent marketplace and promotions.\n–\nAs part of our talent review and performance processes, managers and employees have regular career developmental conversations.\n–\nWe build our leadership pipeline and capability at all levels through leadership development initiatives, assessments based on our leadership competencies, multi-stakeholder feedback, coaching, accelerated programs, partnerships with leading universities and more. Our training programs for leaders aim to enhance skills that support an inclusive environment.\n•\nTotal rewards:\n Cognizant’s total rewards are designed to reward employees through compensation, benefits, and recognition programs and support their physical, mental and financial wellbeing both inside and outside of work.\n–\nOur comprehensive portfolio includes compensation programs, healthcare benefits, risk protection coverage, overall wellbeing and family care, tax savings programs, income protection, retirement and financial planning resources, time off programs, recognition and more.\n–\nWe promote awareness and ensure access to mental health support through on-demand mental health training, wellbeing events, and free counseling sessions via our Employee Assistance Program, among other initiatives. Additionally, Cognizant’s mental health ally network has hundreds of trained and certified employees who provide peer-to-peer support.\n–\nCognizant’s recognition program includes an internal social platform that celebrates service milestones and enables leader-initiated and peer-to-peer awards for both non-monetary and monetary appreciation. We also support creating a culture of recognition through manager guides, engagement toolkits, funds for team celebrations and more.\nGovernmental Regulation\nAs a result of the size, breadth and geographic diversity of our business, our operations are subject to a variety of laws and regulations in the jurisdictions in which we operate, including with respect to import and export controls, temporary work authorizations or work permits and other immigration laws, content requirements, trade restrictions, tariffs, taxation, anti-corruption, the environment, government affairs, internal and disclosure control obligations, data privacy, intellectual property, employee and labor relations. For additional information, see \nPart I, Item 1A. Risk Factors\n as well as the \"Business Outlook\" section within \nPart I. Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations. Executive Summary\n.\nInformation About Our Executive Officers\nThe following table identifies our current executive officers:\nName\nAge\nCapacities in Which Served\nRavi Kumar S\n53\nChief Executive Officer\nJatin Dalal\n50\nChief Financial Officer\nBalu Ganesh Ayyar\n63\nEVP and President, Intuitive Operations and Automation and Industry Solutions\nKathryn Diaz\n55\nEVP, Chief People Officer\nSurya Gummadi\n48\nEVP and President, Americas\nJohn Kim\n57\nEVP, Chief Legal Officer, Chief Administrative Officer and Corporate Secretary\nRobert Telesmanic\n58\nSVP, Controller and Chief Accounting Officer\nRajesh Varrier\n55\nEVP, Global Head of Operations, and Chairman and Managing Director, Cognizant India\n \nCognizant\n11\nDecember 31, 2024 Form 10-K\nTable of Contents\n                                                \nRavi Kumar Singisetti (also referred to as Ravi Kumar S or Ravi Kumar) has been our Chief Executive Officer since January 2023. Prior to joining Cognizant, Mr. Kumar was the President of Infosys, an Indian multinational technology company, where he led the Infosys Global Services Organization across all global industry segments from January 2016 to October 2022. While serving as President of Infosys, he also served as Chairman of the Board of various Infosys subsidiaries. Prior to such role, Mr. Kumar served in positions of increasing authority at PricewaterhouseCoopers, Cambridge Technology Partners, Oracle Corporation, Sapient and Infosys. He is a member of the Board of Directors of Transunion, where he is a member of the Compensation Committee and the Mergers, Acquisitions and Integration Committee. He is also on the Board of Directors for the U.S. Chamber of Commerce. Mr. Kumar has a bachelor’s degree in engineering from Shivaji University and an MBA from Xavier Institute of Management, India.\n Jatin Dalal has been our Chief Financial Officer since December 2023. Prior to joining Cognizant, Mr. Dalal served as Chief Financial Officer of Wipro Limited, \na publicly traded multinational technology and services consulting company, from April 2015 to November 2023 and assumed additional responsibilities as President from December 2019 to November 2023\n. Previously, he held various leadership positions at Wipro, including CFO, IT Business from 2011 to 2015. He joined Wipro in 2002 from the General Electric Company, where he began his career in 1999. Mr. Dalal holds a bachelor’s degree in engineering from the National Institute of Technology in Surat, India. He also has a postgraduate diploma in business administration with a specialization in finance and international business from Narsee Monjee Institute of Management Studies in Mumbai, India. In addition, Mr. Dalal is a Chartered Accountant (India), a Chartered Management Accountant (UK) and a Chartered Financial Analyst (USA). Mr. Dalal has earned an Advanced Computer Security Certificate from Stanford University. Mr. Dalal is also an alumnus of the Advanced Management Program of The Wharton School of the University of Pennsylvania.\nBalu Ganesh Ayyar has been our Executive Vice President and President, Intuitive Operations and Automation since July 2022 and assumed additional responsibilities for Industry Solutions in April 2023. Previously, he was Executive Vice President and President, Digital Operations from August 2019 to June 2022. Prior to joining Cognizant, Mr. Ayyar was the CEO of Mphasis, a global IT services company listed in India, from 2009 to 2017. Prior to Mphasis, Mr. Ayyar spent nearly two decades with Hewlett-Packard, holding a variety of leadership roles across multiple geographies.\nKathryn (Kathy) Diaz has been our Executive Vice President, Chief People Officer since September 2023. She held the role on an interim basis from May 2023 to September 2023. Prior to being appointed Chief People Officer, Ms. Diaz served as SVP, Head of Global Total Rewards at Cognizant from July 2020 until September 2023. Prior to joining Cognizant in 2020, Ms. Diaz was VP, Total Rewards at Pearson, a multinational publishing and education company. She was the VP of Global Compensation, Global Mobility and HR Systems at PVH (the parent company of Calvin Klein and Tommy Hilfiger). Previously, Ms. Diaz spent over 20 years in a series of HR leadership positions at Merck & Co, Inc. She holds a bachelor’s degree in accounting from Rider University and an MBA from Lehigh University.\nSurya Gummadi has been our Executive Vice President and President, Americas since January 2023. He held the role on an interim basis from late June 2022 to January 2023. Prior to being appointed President of the Americas, Mr. Gummadi served as Senior Vice President of our Health Sciences business segment from April 2022 to January 2023, Senior Vice President and head of our Healthcare business from July 2020 to April 2022, Vice President and market leader of our Healthcare business from February 2020 to July 2020 and Vice President and market head for our Health Plans business from October 2017 to February 2020. Prior to that, he served in a variety of roles during his more than 20-year tenure with Cognizant. He holds a degree in mechanical engineering from Indian Institute of Technology, Bombay.\nJohn Kim has been our Executive Vice President, Chief Legal Officer, Chief Administrative Officer and Corporate Secretary since February 2024. Previously, he was Executive Vice President, General Counsel, Chief Corporate Affairs Officer and Secretary, holding this position from March 2021 to February 2024, Before March 2021, he served as our Senior Vice President and Deputy General Counsel, Global Commercial Contracts. Prior to joining Cognizant in 2019, Mr. Kim held a variety of senior leadership roles at Capgemini from January 2012 to November 2019, including Global Head of Big Deals. Prior to Capgemini, Mr. Kim served as U.S. Counsel for WNS Global Services from July 2009 to June 2011 and held a variety of leadership roles at Cendant Travel Distribution Services (now known as Travelport) from January 2001 to June 2006, including General Counsel and Chief Compliance Officer. He holds a bachelor’s degree in English literature from Columbia University and obtained his law degree from Cornell Law School.\nRobert Telesmanic has been our Senior Vice President, Controller and Chief Accounting Officer since January 2017, a Senior Vice President since 2010 and our Corporate Controller since 2004. Prior to that, he served as our Assistant Corporate Controller from 2003 to 2004. Prior to joining Cognizant, Mr. Telesmanic spent over 14 years with Deloitte & Touche LLP. Mr. Telesmanic has a Bachelor of Science degree from New York University and an MBA from Columbia University.\nCognizant\n12\nDecember 31, 2024 Form 10-K\nTable of Contents\n                                                \nRajesh Varrier has been our Executive Vice President, Global Head of Operations since September 2024 and assumed the role of Chairman and Managing Director, Cognizant India beginning October 2024. Prior to joining Cognizant in September 2024, Mr. Varrier held a number of positions at Infosys, an Indian multinational technology company, including serving as EVP, Global Head of Services from November 2023 to April 2024, EVP, Head of Operations Infosys Americas and Global Head of Digital Experience and Microsoft Practice from June 2023 to October 2023 and\n \nSVP, Global Head of Digital Experience and Microsoft Practice from April 2018 to June 2023. Prior to that, Mr. Varrier was CIO and Digital Officer for Aditya Birla Sun Life Insurance. Mr. Varrier is a member of the Nasscom Executive Council and a member of the Board of Directors of Cognizant Foundation India. Mr. Varrier holds a bachelor’s degree in physics, and a postgraduate degree in Computer Engineering from the University of Mumbai.\nNone of our executive officers are related to any other executive officer or to any of our Directors. Our executive officers are appointed annually by the Board of Directors and generally serve until their successors are duly appointed and qualified.\nCorporate History\nWe began our IT development and maintenance services business in early 1994 as an in-house technology development center for The Dun & Bradstreet Corporation and its operating units. In 1996, we were spun off from The Dun & Bradstreet Corporation and, in 1998, we completed an initial public offering to become a public company.\nAvailable Information\nWe make our SEC filings available free of charge through our website at \nwww.cognizant.com\n as soon as reasonably practicable after we electronically file such material with, or furnish such material to, the SEC.\nNo information on our website is incorporated by reference into this Form 10-K or any other public filing made by us with the SEC. The SEC maintains an internet site at \nhttp://www.sec.gov\n that contains reports, proxy and information statements and other information regarding issuers that file electronically with the SEC.\nCognizant\n13\nDecember 31, 2024 Form 10-K\nTable of Contents",
  "item7": "Item 7.     Management’s Discussion and Analysis of Financial Condition and Results of Operations\nExecutive Summary\nCognizant is one of the world’s leading professional services companies, engineering modern businesses and delivering strategic outcomes for our clients. We help clients modernize technology, reimagine processes and transform experiences so they can stay ahead in today's fast-changing world, where AI is beginning to reshape organizations in every field. We provide industry expertise and close client collaboration, combining critical perspective with a flexible engagement style. We tailor our services and solutions to specific industries with an integrated global delivery model that employs client service and delivery teams based at client locations and dedicated global and regional delivery centers. Our collaborative services include digital services and solutions, consulting, application development, systems integration, quality engineering and assurance, engineering research and development, application maintenance, infrastructure and security as well as business process services and automation. Digital, AI-enhanced services continue to be an important part of our portfolio, aligning with our clients' focus on becoming data-enabled, customer-centric and differentiated businesses.\nAt the end of 2024, we completed our NextGen program, which was aimed at simplifying our operating model, optimizing corporate functions and consolidating and realigning office space to reflect the post-pandemic hybrid work environment. The savings generated by the program are funding continued investments in our people, revenue growth opportunities and the modernization of our office space. In 2024, we incurred $134 million of employee separation, facility exit and other costs related to the program, bringing the total costs incurred since inception to $363 million. See \nNote 4\n to our consolidated financial statements.\n2024 Financial Results\n1\nRevenues\nIncome from Operations\nOperating Margin\nDiluted EPS\nGAAP              \nAdjusted\n1\nGAAP\nAdjusted\n1\nGAAP\nAdjusted\n1\nRevenue up $383 million or 2.0% from 2023; an increase of 1.9% in constant currency\n1\nIncome from Operations up $203 million or 7.5% from 2023\nAdjusted Income from Operations\n1\n up $108 million or 3.7% from 2023\nOperating margin up 80 basis points from 2023\nAdjusted Operating Margin\n1\n up 20 basis points from 2023\nDiluted EPS up $0.30 or 7.1% from 2023\nAdjusted Diluted EPS\n1\n up $0.20 or 4.4% from 2023\nDuring the year ended December 31, 2024, revenues increased by $383 million as compared to the year ended December 31, 2023, representing an increase of 2.0%, or 1.9% on a constant currency basis\n1\n. Our recently completed acquisitions contributed 200 basis points to revenue growth. Additionally, revenues were positively impacted by growth in our Health Sciences segment, partially offset by weakness primarily in our Products and Resources (excluding the impact of our recently completed acquisitions) and Financial Services segments. \n1\n Adjusted Income From Operations, Adjusted Operating Margin, Adjusted Diluted EPS and constant currency revenue growth are not measurements of financial performance prepared in accordance with GAAP. See “Non-GAAP Financial Measures” for more information and reconciliations to the most directly comparable GAAP financial measures.\nCognizant\n28\nDecember 31, 2024 Form 10-K\nTable of Contents\n                                                \nOur operating margin and Adjusted Operating Margin\n2\n increased to 14.7% and 15.3%, respectively, for the year ended December 31, 2024, from 13.9% and 15.1%, respectively, for the year ended December 31, 2023. Our 2024 GAAP and Adjusted Operating Margins were positively impacted by net savings generated from our NextGen program and the beneficial impact of foreign currency exchange rate movements, while being negatively impacted by increased compensation costs, primarily as a result of a merit increase cycle completed during the third quarter of 2024, and the dilutive impact of recently completed acquisitions, primarily driven by transaction and integration related expenses and amortization of acquired intangibles. In addition, our GAAP operating margins for 2024 and 2023, were negatively impacted by the NextGen charges, as discussed in \nNote 4\n to our consolidated financial statements, which were excluded from our Adjusted Operating Margin. \nAs a global professional services company, we compete on the basis of the knowledge, experience, insights, skills and talent of our employees and the value they can provide to our clients. We closely monitor attrition trends focusing on the metric that we believe is most relevant to our business. For the year ended December 31, 2024 our Voluntary Attrition - Tech Services was 15.9% as compared to 13.8% for the year ended December 31, 2023. We finished 2024 with approximately 336,800 employees as compared to 347,700 employees at the end of 2023.\nBusiness Outlook\nSee \"Overview\" within \nPart I, Item 1. Business\n for information on our strategic approach.\nWe continue to expect the focus of our clients to be on their transformation into AI-ready, technology-driven, data-enabled, customer-centric and differentiated businesses. To support this transformation and drive greater business resiliency, we expect clients will continue to \ndemand services and solutions that can enhance productivity and deliver cost savings. \nWe believe clients will continue to contend with industry-specific changes driven by evolving digital technologies, uncertainty in the regulatory environment, industry consolidation and convergence as well as international trade policie\ns and other macroeconomic and geopolitical factors, including the uncertainty related to the global economy, which has affected and may continue to affect their demand for our services. \nWe increasingly use AI-based technologies, including GenAI, in our client offerings and our own internal operations. AI technologies and services are part of a highly competitive and rapidly evolving market. We plan to make significant investments in our AI capabilities to meet the needs of our clients and harness AI's value in a flexible, secure, scalable and responsible way. As AI-based technologies or other forms of automation evolve, we expect that demand for some services that we currently perform for our clients may be reduced and our ability to obtain favorable pricing or other terms for our services may be diminished.\nPotential tax law and other regulatory changes, including possible U.S. corporate income tax reform and the Code on Social Security, 2020 in India, among other items, may impact our future results. \nWe expect that the Code on Social Security, 2020, if enacted as currently written, could result in a material one-time increase to our post-employment liability for past service and would also modestly increase our costs for employment and post-employment benefits prospectively.\n In addition, in March 2024, India and Mauritius signed a Protocol to amend the India-Mauritius Income Tax Treaty. We are currently evaluating the potential impact of the amendment, which, depending on its final terms when entered into force, could increase our effective income tax rate, as CTS India is a subsidiary of our wholly-owned Mauritius entity. For additional information, see \nPart I, Item 1A. Risk Factors.\nDuring the third quarter of 2024, we completed the acquisition of Belcan. See \nNote 3\n to our consolidated financial statements. This acquisition is expected to have a modest near-term dilutive impact to our 2025 operating margin, primarily due to integration-related expenses and amortization of acquired intangibles.\n2\n Adjusted Operating Margin is not a measurement of financial performance prepared in accordance with GAAP. See “Non-GAAP Financial Measures” for more information and reconciliations to the most directly comparable GAAP financial measures.\nCognizant\n29\nDecember 31, 2024 Form 10-K\nTable of Contents\n                                                \nResults of Operations\nFor a discussion of our results of operations for the year ended December 31, 2022, including a year-to-year comparison between 2023 and 2022, refer to Part II, Item 7, \"Management's Discussion and Analysis of Financial Condition and Results of Operations\" in our Annual Report Form 10-K for the year ended December 31, 2023.\nThe Year Ended December 31, 2024 Compared to The Year Ended December 31, 2023\n \nThe following table sets forth certain financial data for the years ended December 31:\n% of\n% of\nIncrease / Decrease\n(Dollars in millions, except per share data)\n2024\nRevenues\n2023\nRevenues\n$\n%\nRevenues\n$\n19,736 \n100.0\n$\n19,353 \n100.0\n$\n383 \n2.0 \nCost of revenues\n(a)\n12,958 \n65.7\n12,664 \n65.4\n294 \n2.3 \nSelling, general and administrative expenses\n(a)\n3,223 \n16.3\n3,252 \n16.8\n(29)\n(0.9)\nRestructuring charges\n134 \n0.7\n229 \n1.2\n(95)\n(41.5)\nDepreciation and amortization expense\n529 \n2.7\n519 \n2.7\n10 \n1.9 \nIncome from operations and operating margin\n2,892 \n14.7\n2,689 \n13.9\n203 \n7.5 \nOther income (expense), net\n46 \n98 \n(52)\n(53.1)\nIncome before provision for income taxes\n2,938 \n14.9\n2,787 \n14.4\n151 \n5.4 \nProvision for income taxes\n(713)\n(668)\n(45)\n6.7 \nIncome (loss) from equity method investments\n15 \n7 \n8 \n114.3 \nNet income\n$\n2,240 \n11.3\n$\n2,126 \n11.0\n$\n114 \n5.4 \nDiluted EPS\n$\n4.51 \n$\n4.21 \n$\n0.30 \n7.1 \nOther Financial Information\n \n3\nAdjusted Income From Operations and Adjusted Operating Margin\n$\n3,026 \n15.3\n$\n2,918 \n15.1\n$\n108 \n3.7 \nAdjusted Diluted EPS\n$\n4.75 \n$\n4.55 \n$\n0.20 \n4.4 \n(a)    Exclusive of depreciation and amortization expense\n3\n3\n Adjusted Income from Operations, Adjusted Operating Margin and Adjusted Diluted EPS are not measures of financial performance prepared in accordance with GAAP. See “Non-GAAP Financial Measures” for more information and reconciliations to the most directly comparable GAAP financial measures, as applicable.\nCognizant\n30\nDecember 31, 2024 Form 10-K\nTable of Contents\n                                                \nRevenues - Reportable Business Segments and Geographic Markets\nRevenues of $19,736 million across our business segments and geographies were as follows for the year ended December 31, 2024:\n2024 as compared to 2023\nIncrease / (Decrease)\n(Dollars in millions)\n$\n%\nCC %\n4\nHealth Sciences\n$\n258 \n4.5 \n4.5 \nFinancial Services\n(56)\n(1.0)\n(1.1)\nProducts and Resources\n154 \n3.3 \n3.2 \nCMT\n27 \n0.8 \n0.5 \nTotal revenues\n$\n383 \n2.0 \n1.9 \n2024 as compared to 2023\nIncrease / (Decrease)\n(Dollars in millions)\n$\n%\nCC %\n4\nNorth America\n$\n435 \n3.0 \n3.1 \nUnited Kingdom\n(58)\n(3.1)\n(5.1)\nContinental Europe\n23 \n1.2 \n0.9 \nEurope - Total\n(35)\n(0.9)\n(2.1)\nRest of World\n(17)\n(1.3)\n— \nTotal revenues\n$\n383 \n2.0 \n1.9 \nChange in revenues was driven by the following factors:\n•\nNorth America revenues, particularly in the Health Sciences segment, were positively impacted by the ramp up of several recently won large deals;\n•\nRecently completed acquisitions contributed 200 basis points of growth to the overall change in revenues, including approximately 600 basis points of growth to our Products and Resources segment (primarily in North America) and approximately 150 basis points of growth to our Communications, Media and Technology segment (primarily in North America);\n•\nThe resale of third-party products, primarily in North America, in connection with our integrated offerings strategy, contributed 70 basis points of growth to the overall change in revenue;\n•\nReduced demand for discretionary work negatively impacted revenues across all segments. Clients in our Financial Services, Products and Resources, and Communications, Media and Technology segments were particularly affected;\n•\nRevenue decline in our United Kingdom region was primarily driven by weakness in the Communications, Media and Technology and Financial Services segments; and\n•\nRevenue decline in our Rest of World region was primarily driven by weakness in the Products and Resources and Financial Services segments.\n4\n Constant currency revenue growth is not a measure of financial performance prepared in accordance with GAAP. See “Non-GAAP Financial Measures” for more information.\nCognizant\n31\nDecember 31, 2024 Form 10-K\nTable of Contents\n                                                \nCost of Revenues (Exclusive of Depreciation and Amortization Expense)\né\n \n$294M\né\n0.3% as a % of revenues\n¡\n \n% of Revenues\nOur cost of revenues consists primarily of salaries, incentive-based compensation, stock-based compensation expense, employee benefits, project-related immigration and travel for technical personnel, subcontracting and costs of third-party products and services relating to revenues. The increase, as a percentage of revenues, was due to higher compensation costs, primarily as a result of a merit increase cycle, and the resale of third-party products in connection with our integrated offerings strategy, partially offset by the beneficial impact of foreign currency exchange rate movements and operational efficiencies.\nSG&A Expenses (Exclusive of Depreciation and Amortization Expense)\nSG&A expenses consist primarily of salaries, incentive-based compensation, stock-based compensation expense, employee benefits, immigration, travel, marketing, communications, management, finance, administrative and occupancy costs. The decrease, as a percentage of revenues, was primarily driven by the net savings generated from our NextGen program, partially offset by the impact of recently completed acquisitions, primarily as a result of transaction and integration related expenses.\nê\n$29M\nê\n0.5% as a % of revenues\n¡\n \n% of Revenues\nRestructuring Charges\nRestructuring charges consist of costs related to the NextGen program. Restructuring charges were $134 million or 0.7%, as a percentage of revenues for the year ended December 31, 2024, as compared to $229 million or 1.2%, as a percentage of revenue, for the year ended December 31, 2023. For further detail on our restructuring charges see \nNote 4\n to our consolidated financial statements.\nDepreciation and Amortization Expense\nDepreciation and amortization expense increased by 1.9%, and was flat as a percentage of revenues, in 2024 as compared to 2023. The increase in amortization expense driven by intangible assets related to our recently completed acquisitions was partially offset by the decline of depreciation expense, which was driven by actions taken under our NextGen program.\nOperating Margin and Adjusted Operating Margin\n5\n - Overall\nThe increase in our 2024 GAAP operating margin and Adjusted Operating Margin\n5\n was primarily driven by net savings generated from our NextGen program and the beneficial impact of foreign currency exchange rate movements, partially offset by increased compensation costs, primarily as a result of a merit increase cycle, and the dilutive impact of recently completed acquisitions, primarily as a result of transaction and integration related expenses and amortization of acquired intangibles. In addition, our 2024 and 2023 GAAP operating margins were negatively impacted by the NextGen charges, as discussed in \nNote 4\n to our consolidated financial statements, which were excluded from our Adjusted Operating Margin\n5\n.\n \n5\n Adjusted Income From Operations and Adjusted Operating Margin are not measurements of financial performance prepared in accordance with GAAP. See “Non-GAAP Financial Measures” for more information and reconciliations to the most directly comparable GAAP financial measures, as applicable.\nCognizant\n32\nDecember 31, 2024 Form 10-K\nTable of Contents\n                                                \nA predominant portion of our costs in India are denominated in the Indian rupee, representing approximately 24% of our global operating costs during \nthe year ended \nDecember 31, 2024\n.\n These costs are subject to foreign currency exchange rate fluctuations, which have an impact on our results of operations. We enter into foreign exchange derivative contracts to hedge certain Indian rupee denominated payments in India. These hedges are intended to mitigate the volatility of the changes in the exchange rate between the U.S. dollar and the Indian rupee. Including the impact of the hedges, the depreciation of the Indian rupee positively impacted our operating margin for the year ended December 31, 2024 by 44 basis points as compared to the year ended December 31, 2023.\nExcluding the impact of applicable designated cash flow hedges, the depreciation of the Indian rupee against the U.S. dollar positively impacted our operating margin by approximately 25 basis points in 2024. Each additional 1.0% change in exchange rate between the Indian rupee and the U.S. dollar will have the effect of moving our operating margin by approximately 18 basis points (excluding the impact of our cash flow hedges). In 2024, the settlement of our cash flow hedges positively impacted our operating margin by approximately 6 basis points, compared to a negative impact of 13 basis points in 2023. \nSegment Operating Profit\nSegment operating profit and operating margin percentage were as follows:\nSegment operating profit\n%\nSegment operating margin\nIn 2024, segment operating margins across all our segments were negatively impacted by increased compensation costs, partially offset by savings generated from our NextGen program and the beneficial impact of foreign currency exchange rate movements. Segment operating profit in the Health Sciences and Communications, Media and Technology segments was negatively impacted by resales of third-party products in connection with our integrated offerings strategy and higher costs typical to the initial phases of several recently won large deals. Segment operating profit in the Products and Resources segment was negatively impacted by the dilutive impact of the Belcan acquisition. Segment operating profit in the Financial Services segment was positively impacted by reduced resales of third-party products in connection with our integrated offerings strategy.\nTotal segment operating profit was as follows for the year ended December 31:\n(Dollars in millions)\n2024\n% of Revenues\n2023\n% of Revenues\nIncrease / (Decrease)\nTotal segment operating profit\n$\n4,156 \n21.1 \n$\n4,117 \n21.3 \n$\n39 \nLess: unallocated costs\n1,264 \n6.4 \n1,428 \n7.4 \n(164)\nIncome from operations\n$\n2,892 \n14.7 \n$\n2,689 \n13.9 \n$\n203 \nThe decrease in unallocated costs for 2024 as compared to 2023 was primarily driven by lower corporate expenses as well as lower NextGen charges of $134 million in 2024 as compared to $229 million in 2023 (see \nNote 4\n to our consolidated financial statements).\nCognizant\n33\nDecember 31, 2024 Form 10-K\nTable of Contents\n                                                \nOther Income (Expense), Net\nTotal other income (expense), net consists primarily of foreign currency exchange gains and losses, interest income and interest expense. The following table sets forth total other income (expense), net for the years ended December 31:\n(in millions)\n2024\n2023\nIncrease / Decrease\nForeign currency exchange gains (losses) \n$\n(29)\n$\n42 \n$\n(71)\nGains (losses) on foreign exchange forward contracts not designated as hedging instruments\n10 \n(40)\n50 \nForeign currency exchange gains (losses), net\n(19)\n2 \n(21)\nInterest income\n119 \n126 \n(7)\nInterest expense\n(54)\n(41)\n(13)\nOther, net\n— \n11 \n(11)\nTotal other income (expense), net\n$\n46 \n$\n98 \n$\n(52)\nThe foreign currency exchan\nge losses were attributed to the remeasurement of net monetary assets and liabilities denominated in currencies other than the functional currencies of our subsidiaries. The gains on foreign exchange forward contracts not designated as hedging instruments related to the realized and unrealized gains and losses on cont\nracts entered into to offset our foreign currency exposures. \nAs of December 31, 2024, the notional value of our undesignated hedges was $489 million. Interest income for the year ended December 31, 2024 decreased by $7 million as compared to 2023. While our invested balances decreased during the year ended December 31, 2024, primarily due to the required payment related to the ITD dispute in January 2024 (see \nNote 11\n to our consolidated financial statements) and the Belcan acquisition in August 2024, we benefited from higher interest rates compared to the year ended December 31, 2023. Interest expense for the year ended December 31, 2024 increased by $13 million as compared to 2023 primarily due to the drawdown on our revolving credit facility in connection with the Belcan acquisition.\nProvision for Income Taxes\né\n$45M\n¡\n \nEffective Income Tax Rate\n \né\n \n0.3%\nSee \nNote 11\n to our consolidated financial statements for additional information.\nIn December 2021, the OECD adopted model rules for a global framework to impose a 15% global minimum tax referred to as Pillar Two with a targeted effective date of January 1, 2024. The OECD has continued and is continuing to issue additional guidance on the operation of the model rules. While the United States has not enacted Pillar Two, certain countries in which we operate have adopted their own version of the Pillar Two model rules. Although Management continues to monitor additional guidance from the OECD and countries’ implementation of Pillar Two, based on current guidance, our net income, cash flows, or financial condition has not and will not in the future be materially impacted by Pillar Two.\nNet Income\nThe increase in net income was driven by the increase in income from operations. \né\n$114M\né\n0.3% as a % of revenues\n¡\n \n% of Revenues\nCognizant\n34\nDecember 31, 2024 Form 10-K\nTable of Contents\n                                                \nNon-GAAP Financial Measures\n    \nPortions of our disclosure include non-GAAP financial measures. These non-GAAP financial measures are not based on any comprehensive set of accounting rules or principles and should not be considered a substitute for, or superior to, financial measures calculated in accordance with GAAP, and may be different from non-GAAP financial measures used by other companies. In addition, these non-GAAP financial measures should be read in conjunction with our financial statements prepared in accordance with GAAP. The reconciliations of non-GAAP financial measures to the corresponding GAAP measures set forth below should be carefully evaluated. \nOur non-GAAP financial measures Adjusted Operating Margin and Adjusted Income from Operations exclude unusual items, such as NextGen charges. Our non-GAAP financial measure Adjusted Diluted EPS excludes unusual items, such as NextGen charges, and net non-operating foreign currency exchange gains or losses and the tax impact of all the applicable adjustments. For further detail on the NextGen charges, see \nNote 4\n to our consolidated financial statements. The income tax impact of each item excluded from Adjusted Diluted EPS is calculated by applying the statutory rate and local tax regulations in the jurisdiction in which the item was incurred. Constant currency revenue growth is defined as revenues for a given period restated at the comparative period’s foreign currency exchange rates measured against the comparative period's reported revenues. Free cash flow is defined as cash flows from operating activities net of purchases of property and equipment.\nWe believe providing investors with an operating view consistent with how we manage the Company provides enhanced transparency into our operating results. For internal management reporting and budgeting purposes, we use various GAAP and non-GAAP financial measures for financial and operational decision-making, to evaluate period-to-period comparisons, to determine portions of the compensation for executive officers and for making comparisons of our operating results to those of our competitors. We believe that the presentation of non-GAAP financial measures, which exclude certain costs, read in conjunction with our reported GAAP results and reconciliations to the most comparable GAAP measure, as applicable, can provide useful supplemental information to our management and investors regarding financial and business trends relating to our financial condition and results of operations.\nA limitation of using non-GAAP financial measures versus financial measures calculated in accordance with GAAP is that non-GAAP financial measures may exclude costs that are recurring such as net non-operating foreign currency exchange gains or losses. In addition, other companies may calculate non-GAAP financial measures differently than us, thereby limiting the usefulness of these non-GAAP financial measures as a comparative tool. We compensate for these limitations by providing specific information regarding the GAAP amounts excluded from non-GAAP financial measures to allow investors to evaluate such non-GAAP financial measures.\nThe following table presents a reconciliation of each non-GAAP financial measure to the most comparable GAAP measure, as applicable, for the years ended December 31: \n(Dollars in millions, except per share data)\n2024\n% of\nRevenues\n2023\n% of\nRevenues\nGAAP income from operations and operating margin\n$\n2,892 \n14.7 \n%\n$\n2,689 \n13.9 \n%\nNextGen charges \n(1)\n134 \n0.6 \n229 \n1.2 \nAdjusted Income From Operations and Adjusted Operating Margin\n$\n3,026 \n15.3 \n%\n$\n2,918 \n15.1 \n%\nGAAP diluted EPS\n$\n4.51 \n$\n4.21 \nEffect of NextGen charges, pre-tax\n0.27 \n0.45 \nEffect of non-operating foreign currency exchange losses (gains), pre-tax \n(2)\n0.04 \n— \nTax effect of above adjustments \n(3)\n(0.07)\n(0.11)\nAdjusted Diluted EPS\n$\n4.75 \n$\n4.55 \nNet cash provided by operating activities\n$\n2,124 \n$\n2,330 \nPurchases of property and equipment\n(297)\n(317)\nFree cash flow\n$\n1,827 \n$\n2,013 \n(1)    Consists of employee separation, facility exit and other costs incurred in connection with the NextGen program. See \nNote 4\n to our consolidated financial statements for additional information.\nCognizant\n35\nDecember 31, 2024 Form 10-K\nTable of Contents\n                                                \n(2)    Non-operating foreign currency exchange gains and losses, inclusive of gains and losses on related foreign exchange forward contracts not designated as hedging instruments for accounting purposes, are reported in \"Foreign currency exchange gains (losses), net\" in our consolidated statements of operations.\n(3)    Presented below are the tax impacts of our non-GAAP adjustments to pre-tax income for the years ended December 31:\n(in millions)\n2024\n2023\nNon-GAAP income tax benefit (expense) related to:\nNextGen charges\n$\n34 \n$\n59 \nForeign currency exchange gains and losses\n(4)\n(6)\nThe effective tax rate related to non-operating foreign currency exchange gains and losses varies depending on the jurisdictions in which such income and expenses are generated and the statutory rates applicable in those jurisdictions. As such, the income tax effect of non-operating foreign currency exchange gains and losses shown in the above table may not appear proportionate to the net pre-tax foreign currency exchange gains and losses reported in our  consolidated statements of operations.\nLiquidity and Capital Resources\nCash generated from operations has historically been our primary source of liquidity to fund operations and investments t\no grow our business. As of December 31, 2024, we had cash, cash equivalents and short-term investments of \n$2,243\n million. Additionally, as of December 31, 2024, we had available capacity under our credit facilities of approximately \n$1.55\n billion. \nThe following table provides a summary of our cash flows for the years ended December 31:\n(in millions)\n2024\n2023\nIncrease / Decrease\nNet cash provided by (used in):\nOperating activities\n$\n2,124 \n$\n2,330 \n$\n(206)\nInvesting activities\n(1,646)\n(331)\n(1,315)\nFinancing activities\n(915)\n(1,609)\n694 \nOther Cash Flow Information\n6\nFree cash flow\n1,827 \n2,013 \n(186)\nOperating activities\n6\nThe decrease in cash provided by operating activities in 2024 compared to 2023 was primarily driven by the $360 million payment made in relation to our dispute with the ITD in January 2024 (see \nNote 11\n to our consolidated financial statements).\nWe monitor turnover, aging and the collection of accounts receivable by client. Our DSO calculation includes receivables, net of allowance for doubtful accounts, and contract assets, reduced by the uncollected portion of deferred revenue. Our DSO was 78 days as of December 31, 2024, 77 days as of December 31, 2023 and 74 days as of December 31, 2022. \nInvesting activities\nThe increase in cash used in investing activities in 2024 compared to 2023 was primarily driven by higher payments for business combinations as well as lower net maturities of investments in 2024.\nFinancing activities\nThe decrease in cash used in financing activities in 2024 compared to 2023 was primarily driven by lower repurchases of common stock and net borrowings under the revolving credit facility to finance the Belcan acquisition.\n We have a Credit Agreement providing for a $650 million Term Loan and a $1,850 million unsecured revolving credit facility, which are each due to mature in October 2027. As of December 31, 2024, we had $300 million outstanding on the revolving credit facility, consisting of a Term Benchmark loan with a maturity of October 2027 and an Interest Period (as defined in the Credit Agreement) of one month. We are required under the Credit Agreement to make scheduled quarterly \n6\n Free cash flow is not a measurement of financial performance prepared in accordance with GAAP. See “Non-GAAP Financial Measures” for more information.\nCognizant\n36\nDecember 31, 2024 Form 10-K\nTable of Contents\n                                                \nprincipal payments on the Term Loan. We believe that we currently meet all conditions set forth in the Credit Agreement to borrow thereunder, and we are not aware of any conditions that would prevent us from borrowing part or all of the remaining available capacity under the revolving credit facility as of December 31, 2024 and through the date of this filing. See \nNote 10\n to our consolidated financial statements. \nCapital Allocation Framework\n \nAcquisitions\nShare repurchases\nDividend payments\nOur capital allocation framework anticipates the deployment of approximately 50% of our free cash flow\n7\n for acquisitions and 50% for share repurchases and dividend payments. \nWe review our capital allocation on an ongoing basis, considering our financial performance and liquidity position, investments required to execute our strategic plans and initiatives, acquisition opportunities, the economic outlook, regulatory changes and other relevant factors. As these factors may change over time, the actual amounts expended on stock repurchase activity, dividends, and acquisitions, if any, during any particular period cannot be predicted and may fluctuate from time to time. \nOther Liquidity and Capital Resources Information \n We seek to ensure that our cash is available in the locations in which it is needed. As part of our ongoing liquidity assessments, we regularly monitor the mix of our domestic and international cash flows and cash balances. We evaluate on an ongoing basis what portion of the non-U.S. cash, cash equivalents and short-term investments is needed locally to execute our strategic plans and what amount is available for repatriation back to the United States\n. \nWe expect operating cash flows, cash and short-term investment balances, together with the available capacity under our revolving credit facilities, to be sufficient to meet our operating requirements, including purchase commitments, tax payments, including the Tax Reform Act transition tax payment, and \nservicing our debt for the next twelve months. \nOur remaining Tax Reform Act transition tax payment of $157 million is due in the second quarter of 2025. In 2024, our Tax Reform Act transition tax payment was $123 million. Additionally, we have purchase commitments of approximately $1.1 billion that will be paid over the next four years, of which approximately $440 million will be paid during the next twelve months. In a\nddition, see \nNote 7\n to our consolidated financial statements for a description of our operating lease obligations.\n The ability to expand and grow our business in accordance with current plans, make acquisitions, meet long-term capital requirements beyond a twelve-month period and execute our capital return plan will depend on many factors, including the rate, if any, at which cash flow increases, our ability and willingness to pay for acquisitions with capital stock and the availability of public and private debt, including the ability to extend the maturity of or refinance our existing debt, and equity financing. We cannot be certain that additional financing, if required, will be available on terms and conditions acceptable to us, if at all.\nCritical Accounting Estimates\nManagement’s discussion and analysis of our financial condition and results of operations is based on our accompanying consolidated financial statements that have been prepared in accordance with GAAP. We base our estimates on historical experience, current trends and on various other assumptions that are believed to be relevant at the time our consolidated financial statements are prepared. We evaluate our estimates on a continuous basis. However, the actual amounts may differ from the estimates used in the preparation of our consolidated financial statements. \nWe believe the following accounting estimates are the most critical to aid in fully understanding and evaluating our consolidated financial statements as they require the most difficult, subjective or complex judgments, resulting from the need to make estimates about the effect of matters that are inherently uncertain. Changes to these estimates could have a material effect on our results of operations and financial condition. Our significant accounting policies are described in \nNote 1\n to our consolidated financial statements.\nRevenue Recognition\n. Revenues related to fixed-price contracts for application development and systems integration services, consulting or other technology services are recognized as the service is performed using the cost-to-cost method, \n7\n Free cash flow is not a measurement of financial performance prepared in accordance with GAAP. See “Non-GAAP Financial Measures” for more information.\nCognizant\n37\nDecember 31, 2024 Form 10-K\nTable of Contents\n                                                \nunder which the total value of revenues is recognized on the basis of the percentage that each contract’s total labor cost to-date bears to the total expected labor costs. Revenues related to fixed-price application maintenance, quality engineering and assurance and business process services are recognized using the cost-to-cost method, if the right to invoice is not representative of the value being delivered. The cost-to-cost method requires estimation of future costs, which is updated as the project progresses to reflect the latest available information. Such estimates and changes in estimates involve the use of judgment. The cumulative impact of any change in estimates is reflected in the financial reporting period in which the change in estimate becomes known. Net changes in estimates of such future costs were immaterial to the consolidated results of operations for the periods presented.\nIncome Taxes.\n Determining the consolidated provision for income taxes, deferred income tax assets (and related valuation allowance, if any) and liabilities requires significant judgment. We are required to calculate and provide for income taxes in each of the jurisdictions where we operate. Changes in the geographic mix of income before taxes or estimated level of annual pre-tax income can affect our overall effective income tax rate. In addition, transactions between our affiliated entities are arranged in accordance with applicable transfer pricing laws, regulations and relevant guidelines. As a result, and due to the interpretive nature of certain aspects of these laws and guidelines, we have pending applications for APAs before the taxing authorities in some of our most significant jurisdictions. It could take years for the relevant taxing authorities to negotiate and conclude these applications. The consolidated provision for income taxes may change period to period based on changes in facts and circumstances, such as settlements of income tax audits, the expiration of the applicable statute of limitations or finalization of our applications for APAs.\nOur provision for income taxes also includes the impact of reserves established for uncertain income tax positions, as well as the related interest, which may require us to apply judgment to complex issues and may require an extended period of time to resolve. We apply a “more likely than not” threshold when assessing the need for a reserve for an uncertain tax position, which involves significant judgment. Although we believe we have adequately reserved for our uncertain tax positions, no assurance can be given that the final outcome of these matters will not differ from our recorded amounts. We adjust these reserves in light of changing facts and circumstances, such as the closing of a tax audit or the expiration of the applicable statute of limitations. Additionally, we have tax positions that we believe are more likely than not to be realized and for which we have therefore not established a reserve. To the extent that the final outcome of these matters differs from the amounts recorded, such differences may materially impact, positively or negatively, the provision for income taxes in the period in which such determination is made.\nBusiness Combinations, Goodwill and Intangible Assets\n. Goodwill and intangible assets, including indefinite-lived intangible assets, arise from the accounting for business combinations. We account for business combinations using the acquisition method which requires us to estimate the fair value of identifiable assets acquired, liabilities assumed, including any contingent consideration, and any noncontrolling interest in the acquiree to properly allocate purchase price to the individual assets acquired and liabilities assumed. The allocation of the purchase price utilizes estimates and assumptions\n in determining the fair values of identifiable assets acquired and liabilities assumed, especially with respect to intangible assets, including the timing and amount of forecasted revenues and cash flows, anticipated growth rates, client attrition rates and the discount rate reflecting the risk inherent in future cash flows.\nAt each acquisition date, we allocate goodwill and intangible assets to our reporting units based on how we expect each reporting unit to benefit from the respective business combination. Our seven industry-based operating segments are our reporting units. We exercise judgment to allocate goodwill to the reporting units expected to benefit from each business combination. Goodwill is tested for impairment at the reporting unit level on an annual basis and between annual tests if an event occurs or circumstances change that would more likely than not reduce the fair value of a reporting unit below its carrying value. These events or circumstances could include a significant change in the business climate, regulatory environment, established business plans, operating performance indicators or competition. Evaluation of goodwill for impairment requires judgment, including the identification of reporting units, assignment of assets, liabilities and goodwill to reporting units and determination of the fair value of each reporting unit. \nWe estimate the fair value of our reporting units using a combination of an income approach, utilizing a discounted cash flow analysis, and a market approach, using market multiples. Under the income approach, we estimate projected future cash flows, the timing of such cash flows and long-term growth rates and determine the appropriate discount rate that reflects the risk inherent in the projected future cash flows. The discount rate used is based on a market participant weighted-average cost of capital and may be adjusted for the relevant risk associated with business-specific characteristics and the uncertainty related to the reporting unit’s ability to execute on the projected future cash flows. Under the market approach, we estimate fair value based on market multiples of revenues and earnings derived from comparable publicly-traded companies with characteristics similar to the reporting unit. The estimates used to calculate the fair value of a reporting unit change from year to year based on operating results, market conditions and other factors. Changes in these estimates and assumptions could materially affect the determination of fair value for each reporting unit. \nCognizant\n38\nDecember 31, 2024 Form 10-K\nTable of Contents\n                                                \nBased on our most recent evaluation of goodwill performed during the fourth quarter of 2024, we concluded that the goodwill in each of our reporting units was not at risk of impairment. As of December 31, 2024, our goodwill balance was $6,953 million. \nWe review our finite-lived assets, including our finite-lived intangible assets, for impairment whenever events or changes in circumstances indicate that the carrying amount of an asset group may not be recoverable. The carrying amount may not be recoverable when the sum of undiscounted expected future cash flows is less than the carrying amount of such asset groups. The impairment loss is determined as the amount by which the carrying amount of the asset group exceeds its fair value. Assessing the fair value of asset groups involves significant estimates and assumptions including estimation of future cash flows, the timing of such cash flows and discount rates reflecting the risk inherent in future cash flows. \nRecently Adopted and New Accounting Pronouncements\nSee \nNote 1\n to our consolidated financial statements for additional information.",
  "item2": null
}