{
  "source_file": "ctva-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2.\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nCautionary Statements About Forward-Looking Statements\nThis report contains certain estimates and forward-looking statements within the meaning of Section 21E of the Securities Exchange Act of 1934, as amended, and Section 27A of the Securities Act of 1933, as amended, which are intended to be covered by the safe harbor provisions for forward-looking statements contained in the Private Securities Litigation Reform Act of 1995, and may be identified by their use of words like “plans,” “expects,” “will,” “anticipates,” “believes,” “intends,” “projects,” “estimates,” “outlook,” or other words of similar meaning. All statements that address expectations or projections about the future, including statements about Corteva’s financial results or outlook; strategy for growth; product development; regulatory approvals; market position; capital allocation strategy; liquidity; sustainability targets and initiatives; the anticipated benefits of acquisitions, restructuring actions, or cost savings initiatives; and the outcome of contingencies, such as litigation and environmental matters, are forward-looking statements.\nForward-looking statements and other estimates are based on certain assumptions and expectations of future events which may not be accurate or realized. Forward-looking statements and other estimates also involve risks and uncertainties, many of which are beyond the company's control. While the list of factors presented below is considered representative, no such list should be considered to be a complete statement of all potential risks and uncertainties. Unlisted factors may present significant additional obstacles to the realization of forward-looking statements. Consequences of material differences in results as compared with those anticipated in the forward-looking statements could include, among other things, business disruption, operational problems, financial loss, legal liability to third parties and similar risks, any of which could have a material adverse effect on the company's business, results of operations and financial condition. Some of the important factors that could cause the company's actual results to differ materially from those projected in any such forward-looking statements include: (i) failure to obtain or maintain the necessary regulatory approvals for some of the company's products; (ii) failure to successfully develop and commercialize the company's pipeline; (iii) effect of the degree of public understanding and acceptance or perceived public acceptance of the company's biotechnology and other agricultural products; (iv) effect of changes in agricultural and related policies of governments and international organizations; (v) costs of complying with evolving regulatory requirements and the effect of actual or alleged violations of environmental laws or permit requirements; (vi) effect of climate change and unpredictable seasonal and weather factors; (vii) failure to comply with competition and antitrust laws; (viii) effect of competition in the company's industry; (ix) competitor’s establishment of an intermediary platform for distribution of the company's products; (x) risks related to recent funding and staff reductions at U.S. government agencies; (xi) risk related to geopolitical and military conflict; (xii) effect of volatility in the company's input costs; (xiii) risks related to the company's global operations; (xiv) effect of industrial espionage and other disruptions to the company's supply chain, information technology or network systems; (xv) risks related to environmental litigation and the indemnification obligations of legacy EIDP liabilities in connection with the Corteva Separation; (xvi) impact of the company's dependence on third parties with respect to certain of its raw materials or licenses and commercialization; (xvii) failure of the company's customers to pay their debts to the company, including customer financing programs; (xviii) failure to effectively manage acquisitions, divestitures, alliances, restructurings, cost savings initiatives, and other portfolio actions; (xix) failure to raise capital through the capital markets or short-term borrowings on terms acceptable to the company; (xx) increases in pension and other post-employment benefit plan funding obligations; (xxi) risks related to pandemics or epidemics; (xxii) capital markets sentiment towards sustainability matters; (xxiii) the company's intellectual property rights or defense against intellectual property claims asserted by others; (xxiv) effect of counterfeit products; (xxv) the company's dependence on intellectual property cross-license agreements; (xxvi) risks related to Corteva's Separation from DowDuPont; and (xxvii) risks related to Corteva’s proposed separation, including, but not limited to, whether the objectives of the proposed separation will be achieved; the terms, structure, benefits and costs of any action or transaction resulting from the proposed separation; the timing of any such separation or related action and whether any such separation will be consummated at all; the risk the proposed separation could divert the attention and time of the company’s management; the risk of any unexpected costs or expenses resulting from the proposed separation process or separation itself; and the risk of any litigation as a result of, or relating to, the proposed separation.\nAdditionally, there may be other risks and uncertainties that Corteva is unable to currently identify or that Corteva does not currently expect to have a material impact on its business. Where, in any forward-looking statement or other estimate, an expectation or belief as to future results or events is expressed, such expectation or belief is based on the current plans and expectations of Corteva’s management and expressed in good faith and believed to have a reasonable basis, but there can be no assurance that the expectation or belief will result or be achieved or accomplished. Corteva disclaims and does not undertake any obligation to update or revise any forward-looking statement, except as required by applicable law. A detailed discussion of some of the significant risks and uncertainties which may cause results and events to differ materially from such forward-looking statements is included in the “Risk Factors” section of Corteva’s 2024 Annual Report, as modified by subsequent Quarterly Reports on Form 10-Q and Current Reports on Form 8-K.\n43\nTable of Contents\nRecent Developments\nOn October 1, 2025, the company announced its intent to separate its seed and crop protection businesses into two standalone, publicly traded companies, in a transaction that is intended to be a tax-free spin-off for U.S. federal income tax purposes.\nOverview\nThe following is a summary of results from continuing operations for the three months ended September 30, 2025:\n•\nThe company reported net sales of $2,618 million, up \n13 percent versus the same quarter last year, reflecting\n a \n12 percent\n increase in volume and a \n2 percent favorable impact from\n currency, partially offset by a \n1 percent\n decline in price. \n•\nCost of goods sold totaled $1,644 million in the third quarter of 2025, up from $1,565 million in the third quarter of 2024, which was \ndriven by higher volumes, with a partial offset from ongoing cost and productivity actions and lower commodity prices.\n•\nRestructuring and asset related charges - net were $30 million in the third quarter of 2025, a decrease from $32 million in the third quarter of 2024. The charges for the three months ended September 30, 2025 primarily relate to contract termination charges and decommissioning and demolition costs associated with the Crop Protection Operations Strategy Restructuring Program.\n•\nIncome (loss) from continuing operations after income taxes was $(308) million, as compared to $(519) million in the same quarter last year. \n•\nOperating EBITDA was $49 million for the three months ended September 30, 2025, up from $(100) million for the three months ended September 30, 2024, \nprimarily driven by Seed and Crop Protection volume growth, favorable Seed product mix, ongoing cost and productivity benefits and net royalty improvement, partially offset by continued investment in Seed research and development, additional Seed commissions and compensation expense, competitive Crop Protection pricing and unfavorable currency effects\n. Refer to page 52 for further discussion of the company's non-GAAP financial measures. \nThe following is a summary of results from continuing operations for the nine months ended September 30, 2025:\n•\nThe company reported net sales of \n$13,491 million\n, up \n4 percent versus the same period last year, reflecting\n a \n5 percent\n increase in volume and a\n 1 percent\n increase in price, partially offset by a \n2 percent unfavorable impact from\n currency.\n•\nCost of goods sold totaled \n$6,918 million\n for the \nnine months ended September 30, 2025\n, down from \n$7,033 million\n for the \nnine months ended September 30, 2024\n, which was \ndriven by ongoing cost and productivity actions, lower commodity prices and Crop Protection raw material deflation, with a partial offset from higher volumes.\n•\nRestructuring and asset related charges - net were $131 million for the nine months ended September 30, 2025, a decrease from $199 million for the nine months ended September 30, 2024. The charges for the nine months ended September 30, 2025 primarily relate to \nseverance and related benefit costs, asset related charges, decommissioning and demolition costs and contract termination charges associated with the Crop Protection Operations Strategy Restructuring Program.\n•\nIncome (loss) from continuing operations after income taxes was $1,741 million, as compared to $913 million in the same period last year. \n•\nOperating EBITDA was $3,402 million for the nine months ended September 30, 2025, up from $2,851 million for the nine months ended September 30, 2024, primarily driven by improvements in \nSeed pricing, market share gains and product mix, Crop Protection volume growth and raw material deflation, ongoing cost and productivity benefits and net royalty improvement, partially offset by higher compensation, continued investment in Seed research and development, competitive pricing and higher bad debt expense in Crop Protection and unfavorable currency effects\n. Refer to page 52 for further discussion of the company's non-GAAP financial measures.\nIn addition to the financial highlights above, the following events occurred during the nine months ended September 30, 2025: \n•\nThe company returned approximately $1.1 billion to shareholders during the nine months ended September 30, 2025 under its previously announced share repurchase programs and through common stock dividends.\n44\nTable of Contents\nResults of Operations\nNet Sales \nNet sales were $2,618 million and $2,326 million for the three months ended September 30, 2025 and 2024, respectively. The increase was primarily driven \nby a \n12 percent\n increase in volume and a \n2 percent favorable impact from\n currency, partially offset by a \n1 percent\n decline in price. Crop Protection volume increases were driven primarily by demand for new products, herbicides and biologicals. Seed experienced volume growth due primarily to early deliveries in Latin America in advance of the safrinha season. The pricing decline was driven by competitive Seed and Crop Protection pricing dynamics in Latin America, partially offset by Seed pricing gains in all other regions. The favorable currency impacts were led by the Brazilian Real and the Euro.\n \nThree Months Ended September 30,\n2025\n2024\nNet Sales\n($ Millions)\n%\nNet Sales\n($ Millions)\n%\nWorldwide\n$\n2,618 \n100 \n%\n$\n2,326 \n100 \n%\nNorth America\n1\n707 \n27 \n%\n610 \n26 \n%\nEMEA\n2\n462 \n18 \n%\n415 \n18 \n%\nLatin America\n1,161 \n44 \n%\n989 \n43 \n%\nAsia Pacific\n288 \n11 \n%\n312 \n13 \n%\nQ3 2025 vs. Q3 2024\nPercent Change Due To:\nNet Sales Change\nPrice &\nPortfolio /\n ($ In millions)\n$\n%\nProduct Mix\nVolume\nCurrency\nOther\nNorth America\n1\n$\n97 \n16 \n%\n6 \n%\n10 \n%\n— \n%\n— \n%\nEMEA\n2\n47 \n11 \n%\n1 \n%\n6 \n%\n4 \n%\n— \n%\nLatin America\n172 \n17 \n%\n(5)\n%\n20 \n%\n2 \n%\n— \n%\nAsia Pacific\n(24)\n(8)\n%\n1 \n%\n(6)\n%\n(2)\n%\n(1)\n%\nTotal\n$\n292 \n13 \n%\n(1)\n%\n12 \n%\n2 \n%\n— \n%\n1.\nRepresents U.S. & Canada.\n2.\nEurope, Middle East and Africa (\"EMEA\")\n.\nNet sales were $13,491 million and $12,930 million for the nine months ended September 30, 2025 and 2024, respectively. The increase was primarily driven by\n \n5 percent increase in volume and a 1 percent\n increase in price, partially offset by\n \na \n2 percent\n unfavorable currency impact. Improvements in Crop Protection volume were driven by demand for new products, herbicides, fungicides and biologicals, while Seed experienced volume growth primarily due to increased corn area in North America and early safrinha deliveries in Latin America. Pricing improvements were driven by Seed, led by North America and EMEA with continued execution on the company's price for value strategy, partially offset by a decline in Crop Protection pricing primarily due to the market dynamics in Latin America. The unfavorable currency impacts were led by the Brazilian Real and Turkish Lira.\n \nNine Months Ended September 30,\n2025\n2024\nNet Sales\n($ Millions)\n%\nNet Sales\n($ Millions)\n%\nWorldwide\n$\n13,491 \n100 \n%\n12,930 \n100 \n%\nNorth America\n1\n7,546 \n56 \n%\n7,097 \n55 \n%\nEMEA\n2\n2,686 \n20 \n%\n2,676 \n21 \n%\nLatin America\n2,275 \n17 \n%\n2,154 \n16 \n%\nAsia Pacific\n984 \n7 \n%\n1,003 \n8 \n%\n45\nTable of Contents\nNine Months 2025 vs. Nine Months 2024\nPercent Change Due To:\nNet Sales Change\nPrice &\nPortfolio /\n ($ In millions)\n$\n%\nProduct Mix\nVolume\nCurrency\nOther\nNorth America\n1\n$\n449 \n6 \n%\n2 \n%\n5 \n%\n(1)\n%\n— \n%\nEMEA\n2\n10 \n— \n%\n2 \n%\n2 \n%\n(4)\n%\n— \n%\nLatin America\n121 \n6 \n%\n(6)\n%\n16 \n%\n(4)\n%\n— \n%\nAsia Pacific\n(19)\n(2)\n%\n2 \n%\n(2)\n%\n(2)\n%\n— \n%\nTotal\n$\n561 \n4 \n%\n1 \n%\n5 \n%\n(2)\n%\n— \n%\n1.\nRepresents U.S. & Canada.\n2.\nEurope, Middle East and Africa (\"EMEA\")\n.\nCost of Goods Sold (\"COGS\")\nCOGS was $1,644 million (63 percent of net sales) and $1,565 million (67 percent of net sales) for the three months ended September 30, 2025 and 2024, respectively, driven by higher volumes, with a partial offset from ongoing cost and productivity actions and lower commodity and raw material costs.\nCOGS was $6,918 million (51 percent of net sales) and $7,033 million (54 percent of net sales) for the nine months ended September 30, 2025 and 2024, respectively. \nImprovement for the nine-month period was \ndriven by ongoing cost and productivity actions, lower commodity prices and Crop Protection raw material deflation, with a partial offset from higher volumes.\nResearch and Development Expense (\"R&D\")\nR&D expense was $351 million (13 percent of net sales) and $348 million (15 percent of net sales) for the three months ended September 30, 2025 and 2024, respectively, and $1,061 million (8 percent of net sales) and $1,037 million (8 percent of net sales) for the nine months ended September 30, 2025 and 2024, respectively. The increase in R&D expense is in support of the company’s long-term investment plans and was primarily driven by higher employee compensation costs due to merit and variable compensation increases, with a partial favorable currency offset for the nine-month period.\nSelling, General and Administrative Expenses (\"SG&A\")\nSG&A expenses were $725 million (28 percent of net sales) and $671 million (29 percent of net sales) for the three months ended September 30, 2025 and 2024, respectively. The change was primarily driven by an increase in commissions and variable compensation, partially offset by a decrease in consulting and professional fees.\nSG&A expenses were $2,632 million (20 percent of net sales) and $2,461 million (19 percent of net sales) for the nine months ended September 30, 2025 and 2024, respectively. The increase was primarily driven by an increase in commissions, variable compensation, bad debt expense and personnel and information technology costs, partially offset by favorable currency impacts and a decrease in consulting and professional fees.\nAmortization of Intangibles\nIntangible asset amortization was $162 million and $170 million for the three months ended September 30, 2025 and 2024, respectively, and $485 million and $521 million for the nine months ended September 30, 2025 and 2024, respectively. As certain Merger-related intangible assets became fully amortized subsequent to the end of the prior year period, amortization expense decreased in the current year period.\nRestructuring and Asset Related Charges - Net \nRestructuring and asset related charges - net were $30 million and $32 million for the three months ended September 30, 2025 and 2024, respectively, and $131 million and $199 million for the nine months ended September 30, 2025 and 2024, respectively. The charges in all periods primarily relates to charges associated with the Crop Protection Operations Strategy Restructuring Program. The charges in the three and nine months of 2025 primarily consisted of severance and related benefit costs, asset related charges, decommissioning and demolition costs and contract terminations under the program. The charges in the three and nine months ended September 30, 2024 primarily consisted of severance and related benefit costs and asset related charges under the program. The charges in the nine months ended September 30, 2024 also include non-cash accelerated prepaid royalty amortization expense related to Roundup Ready 2 Yield® and Roundup Ready 2 Xtend® herbicide tolerance traits.\nSee Note 4 - Restructuring and Asset Related Charges - Net, to the interim Consolidated Financial Statements, for additional information.\n46\nTable of Contents\nOther Income (Expense) - Net\nOther income (expense) - net was $(23) million and $(107) million for the three months ended September 30, 2025 and 2024, respectively. Lower other expense was driven by a more favorable net exchange loss and lower non-operating pension and OPEB costs.  \nOther income (expense) - net was $95 million and $(319) million for the nine months ended September 30, 2025 and 2024, respectively. Lower other expense was driven by the receipt of insurance proceeds related to prior significant items during the second quarter of 2025, the absence of charges related to estimated settlement reserves, a more favorable net exchange loss, a favorable tax indemnification adjustment and lower non-operating pension and OPEB costs. The favorable changes were partially offset by the one-time receipt of an indemnification payment negotiated with the former Stoller owners during the first quarter of 2024.\nSee Note 5 - Supplementary Information, to the interim Consolidated Financial Statements, for additional information.\nInterest Expense\nInterest expense was $46 million and $66 million for the three months ended September 30, 2025 and 2024, respectively, and $134 million and $173 million for the nine months ended September 30, 2025 and 2024, respectively. The change was primarily driven by lower short-term borrowings and lower interest rates.\nProvision for (Benefit from) Income Taxes on Continuing Operations\nThe company’s benefit from income taxes on continuing operations was $(62) million for the three months ended September 30, 2025 on pre-tax loss from continuing operations of $(370) million, resulting in an effective tax rate of 16.8 percent. The effective tax rate was unfavorably impacted by \ntax impacts of certain net exchange losses recognized on the re-measurement of the net monetary asset positions which were not tax-deductible in their local jurisdictions, as well as geographic mix of earnings.\nThe company's benefit from income taxes on continuing operations was $(114) million for the three months ended September 30, 2024 on pre-tax loss from continuing operations of $(633) million, resulting in an effective tax rate of 18.0 percent. The effective tax rate was unfavorably impacted by tax impacts of certain net exchange losses recognized on the re-measurement of the net monetary asset positions which were not tax-deductible in their local jurisdictions.\nThe company’s provision for income taxes on continuing operations was $477 million for the nine months ended September 30, 2025 on pre-tax income from continuing operations of $2,218 million, resulting in an effective tax rate of 21.5 percent. The effective tax rate was favorably impacted by a $55 million deferred tax benefit associated with a change in a legal entity’s U.S. tax characterization, as well as net tax benefits associated with changes in accruals for certain prior year tax positions. \nThose favorable impacts were partially offset by unfavorable geographic mix of earnings, as well as withholding taxes on repatriation of cash held outside of the U.S. primarily from current year earnings.\nThe company's provision for income taxes on continuing operations was $274 million for the nine months ended September 30, 2024 on pre-tax income from continuing operations of $1,187 million, resulting in an effective tax rate of 23.1 percent. The effective tax rate was unfavorably impacted by geographic mix of earnings, as well as withholding taxes on repatriation of cash held outside of the U.S. primarily from current year earnings. Those unfavorable impacts were partially offset by net tax benefits associated with changes in accruals for certain prior year tax positions.\nIncome (Loss) from Discontinued Operations After Tax\nIncome (loss) from discontinued operations after tax was $(10) million and $(87) million for the three and nine months ended September 30, 2025, respectively. The after-tax charge for the three months ended September 30, 2025 was driven by charges recognized relating to the MOU with Chemours and DuPont relating to PFAS environmental remediation activities primarily at Chemours' Fayetteville Works facility, along with other environmental matters. The after-tax charge for the nine months ended September 30, 2025 was driven by charges recognized relating to the MOU with Chemours and DuPont, comprised of a litigation charge associated with the NJ Statewide Settlement as well as PFAS environmental remediation activities primarily at Chemours' Fayetteville Works facility, along with other environmental matters. \nIncome (loss) from discontinued operations after tax was $(2) million and $45 million for the three and nine months ended September 30, 2024, respectively. The result for the three months ended September 30, 2024 was primarily driven by litigation-related activity. The after-tax benefit recognized during the nine months ended September 30, 2024 was driven by charges recognized relating to the MOU with Chemours and DuPont relating to PFAS environmental remediation activities primarily at Chemours' Fayetteville Works facility and litigation-related activity, more than offset by a favorable adjustment of certain prior \n47\nTable of Contents\nyear tax positions for previously divested businesses and the derecognition of an indemnification liability associated with the Water District Settlement Fund contribution.\nRefer to Note\n \n12 - Commitments and Contingent Liabilities, to the interim Consolidated Financial Statements, for additional information.\nEIDP Analysis of Operations\nAs discussed in EIDP Note 1 - Basis of Presentation, to the EIDP interim Consolidated Financial Statements, EIDP is a subsidiary of Corteva, Inc. and continues to be a reporting company, subject to the requirements of the Exchange Act. The below relates to EIDP only and is presented to provide an Analysis of Operations, only for the differences between EIDP and Corteva, Inc.\nOther Income (Expense) - Net\nEIDP's other income (expense) - net was $(23) million and $95 million for the three and nine months ended September 30, 2025, respectively, and $(89) million and $(281) million for the three and nine months ended September 30, 2024, respectively. The change was primarily driven by \nthe items noted above, under the header \"Other Income (Expense) - Net,\" as well as interest income earned by EIDP on Corteva, Inc.'s borrowings under the related party Master In-House Banking Agreement prior to Corteva's intention to no longer repay borrowings from EIDP during the fourth quarter of 2024.\nSee EIDP Note 2 - Related Party Transactions, to the EIDP interim Consolidated Financial Statements, for further information. \nProvision for (Benefit from) Income Taxes on Continuing Operations\nEIDP’s benefit from income taxes on continuing operations was $(62) million for the three months ended September 30, 2025 on pre-tax loss from continuing operations of $(370) million, resulting in an effective tax rate of 16.8 percent. EIDP’s benefit from income taxes on continuing operations was $(110) million for the three months ended September 30, 2024 on pre-tax loss from continuing operations of $(615) million, resulting in an effective tax rate of 17.9 percent.\nEIDP’s provision for income taxes on continuing operations was $477 million for the nine months ended September 30, 2025 on pre-tax income from continuing operations of $2,218 million, resulting in an effective tax rate of 21.5 percent. EIDP’s provision for income taxes on continuing operations was $283 million for the nine months ended September 30, 2024 on pre-tax income from continuing operations of $1,225 million, resulting in an effective tax rate of 23.1 percent.\nEIDP’s effective tax rates for the three and nine months ended September 30, 2025 and 2024 were driven by the items noted above, under the header “Provision for (Benefit from) Income Taxes on Continuing Operations.”\nSee EIDP Note 3 - Income Taxes, to the EIDP interim Consolidated Financial Statements, for further information.\n48\nTable of Contents\nRecent Accounting Pronouncements\nSee Note 2 - Recent Accounting Guidance, to the interim Consolidated Financial Statements, for a description of recent accounting pronouncements. \nSegment Reviews\n \nThe company operates in two reportable segments: Seed and Crop Protection. \nSeed\nThe company’s Seed segment is a global leader in developing and supplying commercial seed combining advanced germplasm and traits that produce optimum yield for farms around the world. The segment is a leader in many key seed markets, including North America corn and soybeans, Europe corn and sunflower, as well as Brazil, India, South Africa and Argentina corn. The segment offers trait technologies that improve resistance to weather, disease, insects, herbicides used to control weeds and enhance food and nutritional characteristics, and digital solutions that assist farmer decision-making to help maximize yield and profitability. \nCrop Protection\nThe Crop Protection segment serves the global agricultural input industry with products that protect against weeds, insects and other pests, and disease, and that support overall crop health both above and below ground via nitrogen management and seed-applied technologies. The segment offers crop protection solutions and digital solutions that provide farmers tools to improve productivity and profitability, and help keep fields free of weeds, insects and diseases. The segment is a leader in global herbicides, insecticides, nitrogen stabilizers, pasture and range management herbicides and biologicals.\nSummarized below are comments on individual segment net sales and segment operating EBITDA for the three and nine months ended September 30, 2025, compared with the same period in 2024. The company defines segment operating EBITDA as earnings (loss) (i.e., income (loss) from continuing operations before income taxes) before interest, depreciation, amortization, corporate expenses, non-operating benefits (costs), foreign exchange gains (losses), and net unrealized gain or loss from mark-to-market activity for certain foreign currency derivative instruments that do not qualify for hedge accounting, excluding the impact of significant items and separation costs. Non-operating benefits (costs) consists of non-operating pension and OPEB credits (costs), tax indemnification adjustments and environmental remediation and legal costs associated with legacy businesses and sites. Tax indemnification adjustments relate to changes in indemnification balances, as a result of the application of the terms of the Tax Matters Agreement, between Corteva and Dow and/or DuPont that are recorded by the company as pre-tax income or expense. See Note 17 - Segment Information, to the interim Consolidated Financial Statements, for details related to significant pre-tax benefits (charges) excluded from segment operating EBITDA. All references to prices are based on local price unless otherwise specified.\nA reconciliation of segment operating EBITDA to income (loss) from continuing operations after income taxes for the three and nine months ended September 30, 2025 and 2024 is included in Note 17 - Segment Information, to the interim Consolidated Financial Statements.\nSeed\nThree Months Ended September 30,\nNine Months Ended September 30,\n($ In millions)\n2025\n2024\n2025\n2024\nNet sales\n$\n917 \n$\n691 \n$\n8,161 \n$\n7,773 \nSegment operating EBITDA\n \n$\n(193)\n$\n(320)\n$\n2,512 \n$\n2,126 \nSeed\nQ3 2025 vs. Q3 2024\nPercent Change Due To:\nNet Sales Change \nPrice &\nPortfolio /\n($ In millions)\n$\n%\nProduct Mix\nVolume\nCurrency\nOther\nNorth America\n$\n5 \n3 \n%\n12 \n%\n(8)\n%\n(1)\n%\n— \n%\nEMEA\n66 \n34 \n%\n5 \n%\n26 \n%\n3 \n%\n— \n%\nLatin America\n173 \n79 \n%\n(2)\n%\n78 \n%\n3 \n%\n— \n%\nAsia Pacific\n(18)\n(17)\n%\n4 \n%\n(20)\n%\n(1)\n%\n— \n%\nTotal\n$\n226 \n33 \n%\n4 \n%\n27 \n%\n2 \n%\n— \n%\n49\nTable of Contents\nSeed\nQ3 2025 vs. Q3 2024\nPercent Change Due To:\nNet Sales Change \nPrice &\nPortfolio /\n($ In millions)\n$\n%\nProduct Mix\nVolume\nCurrency\nOther\nCorn\n$\n271 \n86 \n%\n7 \n%\n76 \n%\n3 \n%\n— \n%\nSoybeans\n(12)\n(7)\n%\n4 \n%\n(13)\n%\n2 \n%\n— \n%\nOther oilseeds\n6 \n4 \n%\n3 \n%\n1 \n%\n— \n%\n— \n%\nOther\n(39)\n(51)\n%\n(1)\n%\n(48)\n%\n(2)\n%\n— \n%\nTotal \n$\n226 \n33 \n%\n4 \n%\n27 \n%\n2 \n%\n— \n%\nSeed\nNine Months 2025 vs. Nine Months 2024\nPercent Change Due To:\nNet Sales Change \nPrice &\nPortfolio /\n($ In millions)\n$\n%\nProduct Mix\nVolume\nCurrency\nOther\nNorth America\n$\n332 \n6 \n%\n3 \n%\n3 \n%\n— \n%\n— \n%\nEMEA\n5 \n— \n%\n5 \n%\n2 \n%\n(7)\n%\n— \n%\nLatin America\n34 \n5 \n%\n(3)\n%\n14 \n%\n(6)\n%\n— \n%\nAsia Pacific\n17 \n5 \n%\n7 \n%\n— \n%\n(2)\n%\n— \n%\nTotal\n$\n388 \n5 \n%\n3 \n%\n4 \n%\n(2)\n%\n— \n%\nSeed\nNine Months 2025 vs. Nine Months 2024\nPercent Change Due To:\nNet Sales Change \nPrice &\nPortfolio /\n($ In millions)\n$\n%\nProduct Mix\nVolume\nCurrency\nOther\nCorn\n$\n531 \n10 \n%\n4 \n%\n9 \n%\n(3)\n%\n— \n%\nSoybeans\n(59)\n(3)\n%\n1 \n%\n(4)\n%\n— \n%\n— \n%\nOther oilseeds\n(16)\n(3)\n%\n3 \n%\n(2)\n%\n(4)\n%\n— \n%\nOther\n(68)\n(19)\n%\n4 \n%\n(21)\n%\n(2)\n%\n— \n%\nTotal \n$\n388 \n5 \n%\n3 \n%\n4 \n%\n(2)\n%\n— \n%\nSeed \nSeed net sales were $917 million in the third quarter of 2025, up 33 percent from $691 million in the third quarter of 2024. The sales increase over the prior period was driven by a 27 percent increase in volume, a 4 percent increase in price, and a 2 percent favorable impact from currency. \nVolume growth was driven by early safrinha deliveries in Brazil, recovery of corn acres in Argentina and increased corn area in EMEA, partially offset by lower oilseed area in Asia Pacific. Seed pricing increases were primarily due to higher out-licensing income and continued demand for top technology. The favorable currency impacts were led by the Brazilian Real.\nSegment operating EBITDA was $(193) million in the third quarter of 2025, up 40 percent from $(320) million in the third quarter of 2024. Increased corn volumes, royalty income and cost benefits from productivity and lower commodity prices drove the improvement versus prior year, partially offset by higher compensation expense, commissions and research and development activities.\nSeed net sales were $8,161 million in the first nine months of 2025, up 5 percent from $7,773 million in the first nine months 2024. The sales increase over the prior period was driven by a 3 percent increase in price and a 4 percent increase in volume, partially offset by a 2 percent unfavorable impact from currency. \nPricing gains in most regions, led by North America, demonstrate demand for top technology and the strength of the portfolio, coupled with increased out-licensing income. Volume growth was driven primarily by increased corn area and share gains in North America, an early start to safrinha deliveries in Brazil and recovery of corn acres in Argentina. These increases were partially offset by lower soybean area in North America. The unfavorable currency impacts were led by the Brazilian Real and Canadian Dollar.\nSegment operating EBITDA was $2,512 million in the first \nnine months\n 2025, up 18 percent from $2,126 million in the first \nnine months\n 2024.  Price execution and market share gains in North America, product mix, net royalty improvement and \n50\nTable of Contents\nongoing cost and productivity actions more than offset increased compensation, commission and research and development activities and the unfavorable impact of currency. Segment operating EBITDA margin improved by approximately 340 basis points versus the prior-year period.\nCrop Protection\nThree Months Ended September 30,\nNine Months Ended September 30,\n($ In millions)\n2025\n2024\n2025\n2024\nNet sales\n$\n1,701 \n$\n1,635 \n$\n5,330 \n$\n5,157 \nSegment Operating EBITDA\n \n$\n279 \n$\n246 \n$\n990 \n$\n811 \nCrop Protection\nQ3 2025 vs. Q3 2024\nPercent Change Due To:\nNet Sales Change \nPrice &\nPortfolio /\n($ In millions)\n$\n%\nProduct Mix\nVolume\nCurrency\nOther\nNorth America\n$\n92 \n21 \n%\n3 \n%\n18 \n%\n— \n%\n— \n%\nEMEA\n(19)\n(9)\n%\n(4)\n%\n(11)\n%\n6 \n%\n— \n%\nLatin America\n(1)\n— \n%\n(6)\n%\n4 \n%\n2 \n%\n— \n%\nAsia Pacific\n(6)\n(3)\n%\n(2)\n%\n2 \n%\n(2)\n%\n(1)\n%\nTotal\n$\n66 \n4 \n%\n(2)\n%\n5 \n%\n1 \n%\n— \n%\nCrop Protection\nQ3 2025 vs. Q3 2024\nPercent Change Due To:\nNet Sales Change\nPrice &\nPortfolio /\n($ In millions)\n$\n%\nProduct Mix\nVolume\nCurrency\nOther\nHerbicides\n$\n77 \n10 \n%\n(1)\n%\n10 \n%\n1 \n%\n— \n%\nInsecticides\n(28)\n(6)\n%\n(5)\n%\n(2)\n%\n1 \n%\n— \n%\nFungicides\n6 \n3 \n%\n— \n%\n2 \n%\n2 \n%\n(1)\n%\nBiologicals\n12 \n9 \n%\n(4)\n%\n12 \n%\n1 \n%\n— \n%\nOther\n(1)\n(1)\n%\n(7)\n%\n5 \n%\n1 \n%\n— \n%\nTotal\n$\n66 \n4 \n%\n(2)\n%\n5 \n%\n1 \n%\n— \n%\nCrop Protection\nNine Months 2025 vs. Nine Months 2024\nPercent Change Due To:\nNet Sales Change \nPrice &\nPortfolio /\n($ In millions)\n$\n%\nProduct Mix\nVolume\nCurrency\nOther\nNorth America\n$\n117 \n7 \n%\n— \n%\n8 \n%\n(1)\n%\n— \n%\nEMEA\n5 \n— \n%\n(1)\n%\n2 \n%\n(1)\n%\n— \n%\nLatin America\n87 \n6 \n%\n(7)\n%\n17 \n%\n(4)\n%\n— \n%\nAsia Pacific\n(36)\n(5)\n%\n— \n%\n(3)\n%\n(1)\n%\n(1)\n%\nTotal\n$\n173 \n3 \n%\n(2)\n%\n7 \n%\n(2)\n%\n— \n%\nCrop Protection\nNine Months 2025 vs. Nine Months 2024\nPercent Change Due To:\nNet Sales Change\nPrice &\nPortfolio /\n($ In millions)\n$\n%\nProduct Mix\nVolume\nCurrency\nOther\nHerbicides\n$\n100 \n4 \n%\n(2)\n%\n7 \n%\n(1)\n%\n— \n%\nInsecticides\n(44)\n(4)\n%\n(3)\n%\n1 \n%\n(2)\n%\n— \n%\nFungicides\n107 \n14 \n%\n(1)\n%\n18 \n%\n(3)\n%\n— \n%\nBiologicals\n21 \n7 \n%\n(5)\n%\n15 \n%\n(3)\n%\n— \n%\nOther\n(11)\n(4)\n%\n(3)\n%\n(1)\n%\n— \n%\n— \n%\nTotal\n$\n173 \n3 \n%\n(2)\n%\n7 \n%\n(2)\n%\n— \n%\n51\nTable of Contents\nCrop Protection \nCrop Protection net sales were $1,701 million in the third quarter of 2025, up 4 percent from $1,635 million in the third quarter of 2024. The sales increase over the prior period was driven by a 5 percent increase in volume and a 1 percent favorable impact from currency, partially offset by a 2 percent decline in price. \nVolume growth was primarily driven by demand for new products, herbicides and biologicals. The price decline was primarily due to the competitive pricing environment in Latin America, partially offset by North America pricing gains. The favorable currency impacts were led by the Brazilian Real.\nSegment operating EBITDA was $279 million in the third quarter of 2025, up 13 percent from $246 million in the third quarter of 2024. Raw material deflation, productivity savings and volume growth more than offset the unfavorable impact from currency and price pressure. Segment operating EBITDA margin improved by approximately 135 basis points versus the prior-year period.\nCrop Protection net sales were $5,330 million in the first nine months of 2025, up 3 percent from $5,157 million in the first nine months of 2024. The sales increase over the prior period was driven by a 7 percent increase in volume, partially offset by a 2 percent unfavorable impact from currency and a 2 percent decline in price. \nVolume growth was driven by demand for new products, herbicides, fungicides and biologicals, while price declined primarily due to market dynamics in Latin America. The unfavorable currency impacts were led by the Brazilian Real and Turkish Lira.\nSegment operating EBITDA was $990 million in the first nine months of 2025, up 22 percent from $811 million in the first nine months of 2024. Raw material deflation, p\nroductivity savings and volume growth more than offset the unfavorable impact from currency, price pressure and higher compensation and bad debt expense. Segment operating EBITDA margin improved by approximately 285 basis points versus the prior-year period.\nNon-GAAP Financial Measures\nThe company presents certain financial measures that do not conform to U.S. GAAP and are considered non-GAAP measures. These measures include Operating EBITDA and operating earnings (loss) per share. Management uses these measures internally for planning and forecasting, including allocating resources and evaluating incentive compensation. Management believes that these non-GAAP measures best reflect the ongoing performance of the company during the periods presented and provide more relevant and meaningful information to investors as they provide insight with respect to ongoing operating results of the company and a more useful comparison of year over year results. These non-GAAP measures supplement the company's U.S. GAAP disclosures and should not be viewed as an alternative to U.S. GAAP measures of performance. Furthermore, such non-GAAP measures may not be consistent with similar measures provided or used by other companies. Reconciliations for these non-GAAP measures to U.S. GAAP are provided below. \nOperating EBITDA is defined as earnings (loss) (i.e., income (loss) from continuing operations before income taxes) before interest, depreciation, amortization, non-operating benefits (costs), foreign exchange gains (losses), and net unrealized gain or loss from mark-to-market activity for certain foreign currency derivative instruments that do not qualify for hedge accounting, excluding the impact of significant items and separation costs. Non-operating benefits (costs) consists of non-operating pension and OPEB credits (costs), tax indemnification adjustments and environmental remediation and legal costs associated with legacy businesses and sites. Tax indemnification adjustments relate to changes in indemnification balances, as a result of the application of the terms of the Tax Matters Agreement, between Corteva and Dow and/or DuPont that are recorded by the company as pre-tax income or expense. Operating earnings (loss) per share is defined as \"earnings (loss) per common share from continuing operations - diluted\" excluding the after-tax impact of significant items, the after-tax impact of separation costs, the after-tax impact of non-operating benefits (costs), the after-tax impact of amortization expense associated with intangible assets existing as of the Corteva Separation from DowDuPont, and the after-tax impact of net unrealized gain or loss from mark-to-market activity for certain foreign currency derivative instruments that do not qualify for hedge accounting. Although amortization of the company's intangible assets is excluded from these non-GAAP measures, management believes it is important for investors to understand that such intangible assets contribute to revenue generation. Amortization of intangible assets that relate to past acquisitions will recur in future periods until such intangible assets have been fully amortized. Any future acquisitions may result in amortization of additional intangible assets. Net unrealized gain or loss from mark-to-market activity for certain foreign currency derivative instruments that do not qualify for hedge accounting represents the non-cash net gain (loss) from changes in fair value of certain undesignated foreign currency derivative contracts. Upon settlement, which is within the same calendar year of execution of the contract, the realized gain (loss) from the changes in fair value of the non-qualified foreign currency derivative contracts will be reported in the relevant non-GAAP financial measures, allowing \n52\nTable of Contents\nquarterly results to reflect the economic effects of the foreign currency derivative contracts without the resulting unrealized mark to fair value volatility.\nThe company also uses Free Cash Flow as a non-GAAP measure to evaluate and discuss its liquidity position and ability to generate cash. Free Cash Flow is defined as cash provided by (used for) operating activities – continuing operations, less capital expenditures. Management believes that Free Cash Flow provides investors with meaningful information regarding the company’s ongoing ability to generate cash through core operations, and the company’s ability to service its indebtedness, pay dividends (when declared), make share repurchases, and meet its ongoing cash needs for its operations. \nReconciliation of Income (Loss) from Continuing Operations after Income Taxes to Operating EBITDA\nThree Months Ended September 30,\nNine Months Ended September 30,\n(In millions)\n2025\n2024\n2025\n2024\nIncome (loss) from continuing operations after income taxes \n(GAAP)\n$\n(308)\n$\n(519)\n$\n1,741 \n$\n913 \nProvision for (benefit from) income taxes on continuing operations\n(62)\n(114)\n477 \n274 \nIncome (loss) from continuing operations before income taxes (GAAP)\n$\n(370)\n$\n(633)\n$\n2,218 \n$\n1,187 \nDepreciation and amortization\n300 \n306 \n897 \n925 \nInterest income\n(29)\n(33)\n(92)\n(93)\nInterest expense\n46 \n66 \n134 \n173 \nExchange (gains) losses - net\n45 \n97 \n97 \n234 \nNon-operating (benefits) costs - net\n14 \n50 \n27 \n132 \nMark-to-market (gains) losses on certain foreign currency contracts not designated as hedges\n6 \n14 \n58 \n(4)\nSignificant items (benefit) charge\n30 \n33 \n56 \n297 \nSeparation costs\n7 \n— \n7 \n— \nOperating EBITDA (Non-GAAP)\n$\n49 \n$\n(100)\n$\n3,402 \n$\n2,851 \nSignificant Items \nThree Months Ended September 30,\nNine Months Ended September 30,\n(In millions)\n2025\n2024\n2025\n2024\nRestructuring and asset related charges - net\n$\n(30)\n$\n(32)\n$\n(131)\n$\n(199)\nEstimated settlement expense\n1\n— \n— \n— \n(101)\nInventory write-offs\n2\n— \n— \n— \n2 \nGain (loss) on sale of assets\n2\n— \n— \n14 \n7 \nAcquisition-related costs\n3\n— \n(1)\n— \n(6)\nAltEn facility remediation charges\n4\n— \n— \n(37)\n— \nInsurance proceeds\n5\n— \n— \n98 \n— \nTotal pre-tax significant items benefit (charge)\n$\n(30)\n$\n(33)\n$\n(56)\n$\n(297)\nTotal tax (provision) benefit impact of significant items\n6\n7 \n8 \n15 \n74 \nTax only significant item benefit (charge)\n7\n— \n4 \n55 \n4 \nTotal significant items benefit (charge), after tax\n$\n(23)\n$\n(21)\n$\n14 \n$\n(219)\n1.\nConsists of estimated Lorsban® related charges.\n2.\nIncremental gains (losses) associated with activities related to the 2022 Restructuring Actions. The nine months ended September 30, 2024 includes a $2 million benefit associated with sales of inventory previously reserved for in association with the 2022 Restructuring Actions. For additional information, refer to Note 6 - Restructuring and Asset Related Charges - Net, to the Consolidated Financial Statements, in the company's 2024 Annual Report.\n3.\nRelates to acquisition-related costs relating to third-party integration costs associated with the completed acquisitions of Stoller and Symborg. \n4.\nRelates to a charge to increase the remediation accrual at the AltEn facility relating to Corteva's estimated voluntary contribution to the solid waste and wastewater remedial action plans. See Note 12\n \n- Commitments and Contingent Liabilities, to the interim Consolidated Financial Statements, for additional information. \n5.\nIncludes proceeds received related to prior significant items.\n6.\nUnless specifically addressed above, the income tax effect on significant items was calculated based upon the enacted tax laws and statutory income tax rates applicable in the tax jurisdiction(s) of the underlying non-GAAP adjustment.\n7.\nThe tax only significant item benefit for the nine months ended September 30, 2025 reflects a deferred tax benefit associated with a change in a legal entity's U.S. tax characterization.\n53\nTable of Contents\nReconciliation of Income (Loss) from Continuing Operations Attributable to Corteva and Earnings (Loss) Per Share of Common Stock from Continuing Operations - Diluted to Operating Earnings (Loss) and Operating Earnings (Loss) Per Share\nThree Months Ended September 30,\nNine Months Ended September 30,\n(In millions)\n2025\n2024\n2025\n2024\nIncome (loss) from continuing operations attributable to Corteva common stockholders \n(GAAP)\n$\n(310)\n$\n(522)\n$\n1,733 \n$\n903 \nLess: Non-operating benefits (costs), after tax\n(12)\n(37)\n(28)\n(98)\nLess: Amortization of intangibles (existing as of Corteva Separation), after tax\n(108)\n(115)\n(327)\n(350)\nLess: Mark-to-market gains (losses) on certain foreign currency contracts not designated as hedges, after tax\n(4)\n(11)\n(44)\n3 \nLess: Significant items benefit (charge), after tax\n(23)\n(21)\n14 \n(219)\nLess: Separation costs, after tax\n(7)\n— \n(7)\n— \nOperating Earnings (Loss) (Non-GAAP)\n$\n(156)\n$\n(338)\n$\n2,125 \n$\n1,567 \nThree Months Ended September 30,\nNine Months Ended September 30,\n2025\n2024\n2025\n2024\nEarnings (loss) per share of common stock from continuing operations attributable to Corteva common stockholders - diluted \n(GAAP)\n$\n(0.46)\n$\n(0.76)\n$\n2.54 \n$\n1.29 \nLess: Non-operating benefits (costs), after tax\n(0.02)\n(0.05)\n(0.04)\n(0.14)\nLess: Amortization of intangibles (existing as of Corteva Separation), after tax\n(0.16)\n(0.17)\n(0.48)\n(0.50)\nLess: Mark-to-market gains (losses) on certain foreign currency contracts not designated as hedges, after tax\n(0.01)\n(0.02)\n(0.06)\n— \nLess: Significant items benefit (charge), after tax\n(0.03)\n(0.03)\n0.02 \n(0.31)\nLess: Separation costs, after tax\n(0.01)\n— \n(0.01)\n— \nOperating Earnings (Loss) Per Share (Non-GAAP)\n$\n(0.23)\n$\n(0.49)\n$\n3.11 \n$\n2.24 \nDiluted Shares Outstanding\n \n(In millions)\n678.7 \n691.1 \n683.1 \n698.3 \nLiquidity and Capital Resources \nInformation related to the company's liquidity and capital resources can be found in the company’s 2024 Annual Report, Part II, Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations, Liquidity & Capital Resources. The discussion below provides the updates to this information for the nine months ended September 30, 2025.\n(In millions)\nSeptember 30, 2025\nDecember 31, 2024\nSeptember 30, 2024\nCash, cash equivalents and marketable securities\n$\n2,586 \n$\n3,169 \n$\n2,493 \nTotal debt\n$\n4,373 \n$\n2,703 \n$\n5,716 \nThe increase in debt balances from December 31, 2024 was primarily due to the May 2025 Senior Notes issuance and higher short-term debt, which was used to fund the company's working capital needs, capital spending, dividend payments and share repurchases. See further information in Note 11 - Short-Term Borrowings, Long-Term Debt and Available Credit Facilities, to the interim Consolidated Financial Statements.\nThe company believes its ability to generate cash from operations and access to capital markets and commercial paper markets will be adequate to meet anticipated cash requirements to fund its operations, including seasonal working capital, capital spending, dividend payments, share repurchases, pension obligations and litigation costs, net of recoveries. Corteva's strong financial position, liquidity and credit ratings will provide access as needed to capital markets and commercial paper markets to fund seasonal working capital needs. The company's liquidity needs can be met through a variety of sources, including cash provided by operating activities, commercial paper, syndicated credit lines, bilateral credit lines, long-term debt markets, bank financing and committed receivable repurchase facilities. Corteva considers the borrowing costs and lending terms when selecting the source to fund its operations and working capital needs.\n54\nTable of Contents\nThe company had access to approximately $6.3 billion, $6.3 billion and $6.2 billion at September 30, 2025, December 31, 2024 and September 30, 2024, in committed and uncommitted unused credit lines, which includes the uncommitted revolving credit lines relating to the foreign currency loans. These facilities provide support to meet the company’s short-term liquidity needs and for general corporate purposes, which may include funding of discretionary and non-discretionary contributions to certain benefit plans, severance payments, repayment and refinancing of debt, working capital, capital expenditures, repurchases and redemptions of securities, acquisitions and Corteva's costs and expenses, including the settlement of litigation and environmental remediation. These facilities are provided to the company by highly rated and well capitalized global financial institutions.\nIn June 2024, the Revolving Credit Facilities were refinanced for purposes of extending the maturity dates for the five-year and three-year revolving credit facilities to June 2029 and June 2027, respectively, and lowering the facility amount of the five-year revolving credit facility to $2.85 billion and the three-year revolving credit facility to $1.90 billion. Borrowings under the Revolving Credit Facilities will have an interest rate equal to Adjusted Term SOFR, which is Term SOFR plus 0.10 percent, plus the applicable margin. The Revolving Credit Facilities may serve as a substitute to the company's commercial paper program, and can be used, from time to time, for general corporate purposes including, but not limited to, the funding of seasonal working capital needs. The Revolving Credit Facilities contain customary representations and warranties, affirmative and negative covenants and events of default that are typical for companies with similar credit ratings. Additionally, the Revolving Credit Facilities contain a financial covenant requiring that the ratio of total indebtedness to total capitalization for Corteva and its consolidated subsidiaries not exceed 0.60. At September 30, 2025, the company was in compliance with these covenants.\nIn February 2025, the company amended and restated its January 2023 (as amended in July 2023, January 2024 and February 2024) 364-day revolving credit agreement (the “364-Day Revolving Credit Facility”) decreasing the facility amount from $1 billion to $750 million and extending the expiration date to February 2026. \nIn May 2025, the company issued $500 million of 5.125 percent Senior Notes due in May 2032 (the “May 2025 Debt Offering”). The proceeds were used to repay the $500 million senior notes that matured in July 2025.\nThe company's indenture covenants include customary limitations on liens, sale and leaseback transactions, and mergers and consolidations affecting manufacturing plants, mineral producing properties or research facilities located in the U.S. and the consolidated subsidiaries owning such plants, properties and facilities subject to certain limitations. The outstanding long-term debt also contains customary default provisions.\nThe company has meaningful seasonal working capital needs based in part on providing financing to its customers. Working capital is funded through multiple methods including cash, commercial paper, the Revolving Credit Facilities, the 364-Day Revolving Credit Facility, and factoring.\nThe company has factoring agreements with third-party financial institutions to sell its trade receivables under both recourse and non-recourse agreements in exchange for cash proceeds in an effort to reduce its receivables risk. For arrangements that include an element of recourse, the company provides a guarantee of the trade receivables in the event of customer default. Refer to Note 8 - Accounts and Notes Receivable - Net, to the interim Consolidated Financial Statements, for more information.\nThe company also organizes agreements with third-party financial institutions who directly provide financing for select customers of the company's Seed and Crop Protection products in each region. Terms of the third-party loans are less than a year and programs are renewed on an annual basis. In some cases, the company guarantees a portion of the extension of such credit to such customers. Refer to Note 12 - Commitments and Contingent Liabilities, to the interim Consolidated Financial Statements, for more information on the company’s guarantees.\nThe company's cash, cash equivalents and marketable securities at September 30, 2025, December 31, 2024 and September 30, 2024 are $2.6 billion, $3.2 billion and $2.5 billion, respectively, of which $2.3 billion, $1.7 billion and $2.1 billion at September 30, 2025, December 31, 2024 and September 30, 2024, respectively, was held by subsidiaries in foreign countries, including United States territories. Cash, cash equivalents and marketable securities are concentrated subject to local restrictions with highly rated and well capitalized global financial institutions. The underlying credit worthiness and exposures to these counterparties are monitored on a regular basis in line with the company’s overall risk management procedures. Upon actual repatriation, such earnings could be subject to withholding taxes, foreign and/or U.S. state income taxes, and taxes resulting from the impact of foreign currency movements. The cash held by foreign subsidiaries is generally used to finance the subsidiaries' operational activities and future foreign investments. At September 30, 2025, management believed that sufficient \n55\nTable of Contents\nliquidity is available in the U.S. with global operating cash flows, borrowing capacity from existing committed credit facilities, and access to capital markets and commercial paper markets. \nSummary of Cash Flows \nCash provided by (used for) operating activities - continuing operations was $(941) million for the nine months ended September 30, 2025 compared to $(1,871) million for the nine months ended September 30, 2024. The change was driven by higher net income, favorable changes in customer prepayments and favorable changes in accounts payable due to lower payments to third-party growers resulting from lower commodity costs and planted area, partially offset by an unfavorable change in inventories due to a lower comparable decline in volumes and the sale of lower-cost inventory in the current year.\nCash provided by (used for) operating activities - discontinued operations was $(28) million for the nine months ended September 30, 2025 compared to $(157) million for the nine months ended September 30, 2024. The cash outflows were primarily related to PFAS activities that are subject to the MOU with Chemours and DuPont associated with environmental remediation activities primarily at Chemours' Fayetteville Works facility. In addition, the disbursement of cash held in the Water District Settlement Fund is reflected in the nine months ended September 30, 2024.\nCash provided by (used for) investing activities was $(355) million for the nine months ended September 30, 2025 compared to $(466) million for the nine months ended September 30, 2024. The change was primarily driven by a reduction in capital expenditures and lower purchases of investments, partially offset by higher payments to settle net investment hedges.\nCash provided by (used for) financing activities was $554 million for the nine months ended September 30, 2025 compared to $2,137 million for the nine months ended September 30, 2024. The change was primarily due to higher borrowings in 2024 to fund working capital needs, capital spending, dividend payments and share repurchases.\nIn January 2025, the company's Board of Directors authorized a common stock dividend of $0.17 per share, payable on March 17, 2025, to the shareholders of record on March 3, 2025. In April 2025, the company's Board of Directors authorized a common stock dividend of $0.17 per share, payable on June 16, 2025, to the shareholders of record on June 2, 2025. In July 2025, the company's Board of Directors authorized a common stock dividend of $0.18 per share, which reflects an approved increase of 5.9 percent, payable on September 15, 2025, to the shareholders of record on September 2, 2025. In October 2025, the company's Board of Directors authorized a common stock dividend of $0.18 per share, payable on December 15, 2025, to the shareholders of record on December 1, 2025.\nOn November 19, 2024, Corteva, Inc. announced that its Board of Directors authorized a $3 billion share repurchase program to purchase Corteva, Inc.'s common stock, par value $0.01 per share, without an expiration date (\"2024 Share Buyback Plan\"). The timing, price and volume of purchases will be based on market conditions, relevant securities laws and other factors. In connection with the 2024 Share Buyback Plan, the company repurchased and retired 3,401,000 and 3,681,000 shares in the open market for a total cost (excluding excise taxes) of $250 million and $270 million during the three and nine months ended September 30, 2025, respectively. \nOn September 13, 2022, Corteva, Inc. announced that its Board of Directors authorized a $2 billion share repurchase program to purchase Corteva, Inc.'s common stock, par value $0.01 per share, without an expiration date (\"2022 Share Buyback Plan\"). The timing, price and volume of purchases in connection with the 2022 Share Buyback Plan were based on market conditions, relevant securities laws and other factors. The company completed the 2022 Share Buyback Plan during the second quarter of 2025 and repurchased and retired 7,815,000 shares in the open market for a total cost (excluding excise taxes) of $500 million for the nine months ended September 30, 2025, respectively, and 4,722,000 and 13,838,000 shares in the open market for a total cost (excluding excise taxes) of $250 million and $750 million for the three and nine months ended September 30, 2024, respectively. \nFor the full year 2025, the company expects repurchases of approximately $1 billion under the 2024 Share Buyback Plan and the 2022 Share Buyback Plan discussed above. The total amount, timing, manner, price and volume of purchases will be based on market conditions, relevant securities laws and other market and company specific factors.\nSee Note 13 - Stockholders' Equity, to the interim Consolidated Financial Statements, for additional information related to the share buyback plans.\nEIDP Liquidity Discussion\nAs discussed in EIDP Note 1 - Basis of Presentation, to the EIDP interim Consolidated Financial Statements, EIDP is a subsidiary of Corteva, Inc. and continues to be a reporting company, subject to the requirements of the Exchange Act. The discussion below relates to EIDP only and is presented to provide a Liquidity discussion for the differences between EIDP and \n56\nTable of Contents\nCorteva, Inc. See EIDP Note 2 - Related Party Transactions, to the EIDP interim Consolidated Financial Statements, for further information on related party loans between EIDP and Corteva, Inc.\nBeginning in the third quarter of 2025, the Board of Directors of EIDP authorizes and declares a quarterly dividend to Corteva, Inc., from which the proceeds are intended to be used to fund Corteva, Inc. share repurchases and common stock dividends during the subsequent quarter.\nCash provided by (used for) operating activities - continuing operations\nEIDP’s cash provided by (used for) operating activities - continuing operations was $(941) million and an as-restated $(1,886) million for the nine months ended September 30, 2025 and 2024, respectively. The change was primarily driven by the items noted on page 56, under the header \"Summary of Cash Flows.\" \nCash provided by (used for) operating activities - discontinued operations\nEIDP’s cash provided by (used for) operating activities - discontinued operations was $(28) million and $(157) million for the nine months ended September 30, 2025 and 2024, respectively. The change was primarily driven by the items noted on page 56, under the header \"Summary of Cash Flows.\" \nCash provided by (used for) investing activities\nEIDP’s cash provided by (used for) investing activities was $(355) million and an as-restated $(1,557) million for the nine months ended September 30, 2025 and 2024. The change was primarily driven by the items noted above, under the header \"Summary of Cash Flows,\" in addition to funding provided to Corteva, Inc. during 2024 on the related party Master In-House Banking Agreement prior to Corteva's intention to no longer repay borrowings from EIDP during the fourth quarter of 2024.\nCash provided by (used for) financing activities\nEIDP’s cash provided by (used for) financing activities was $554 million and $3,243 million for the nine months ended September 30, 2025 and 2024. The change was primarily driven by the items noted above, under the header \"Summary of Cash Flows,\" as well as the issuance of cash dividends by EIDP to Corteva, Inc. during the first, second and third quarters of 2025.\nGuarantees and Off-Balance Sheet Arrangements\nFor detailed information related to Guarantees, Indemnifications, and Obligations for Equity Affiliates and Others, see the company’s 2024 Annual Report, Part II, Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations, Off-Balance Sheet Arrangements and Note 12 - Commitments and Contingent Liabilities, to the interim Consolidated Financial Statements.\nContractual Obligations \nInformation related to the company's contractual obligations at December 31, 2024 can be found on page 56 of the company's 2024 Annual Report. There have been no material changes to the company’s contractual obligations outside the ordinary course of business from those reported in the company’s 2024 Annual Report."
}