{
  "item1": "connection validation breeding plans large-scale product development timelines focused rapidly ramping up differentiated technology solutions, 2019 company began accelerating ramp up Enlist E3 TM trait platform company’s soybean portfolio mix across all brands, including Pioneer brands. Due five-year ramp-up Enlist E3 TM , company significantly reduced volume products Roundup Ready 2 Yield Roundup Ready 2 Xtend herbicide tolerance traits beginning 2021, expected minimal use Roundup Ready 2 Yield Roundup Ready 2 Xtend traits thereafter remaining term non-exclusive license Monsanto Company. Refer Prepaid Royalties within Critical Accounting Estimates section page 55 additional information. Seed segment diverse worldwide network which markets distributes company’s brands customers, primarily through company’s multi-channel, multi-brand strategy, which includes four differentiated channels: Pioneer agency model, regional brands, retail brands, well third parties through licensing distribution channels.",
  "item7": "Year Ended December 31, Restructuring asset related charges - net Restructuring asset related charges - net $288 million year ended December 31, 2024, which primarily comprised $232 million charge associated Crop Protection Operations Strategy Restructuring Program $55 million net charge non-cash accelerated prepaid royalty amortization expense related Roundup Ready 2 Yield® Roundup Ready 2 Xtend® herbicide tolerance traits. $232 million charge associated Crop Protection Operations Strategy Restructuring Program primarily comprised $91 million severance related benefit costs, $101 million asset related charges, $10 million decommissioning demolition costs $30 million contract termination charges. Restructuring asset related charges - net $336 million year ended December 31, 2023, which primarily comprised $217 million charge related Crop Protection Operations Strategy Restructuring Program, $72 million net charge related non-cash accelerated prepaid royalty amortization expense related Roundup Ready 2 Yield® Roundup Ready 2 Xtend® herbicide tolerance traits $42 million related severance related benefit costs, asset related charges contract termination charges (including early lease terminations) associated 2022 Restructuring Actions. $217 million net charge associated Crop Protection Operations Strategy Restructuring Program primarily comprised $214 million asset related charges, which includes non-cash impairment charges $152 million consisting $92 million $60 million related operating lease assets property, plant equipment, respectively, associated exit company’s production activities its site Pittsburg, California.",
  "item2": "MANAGEMENT’S DISCUSSION ANALYSIS FINANCIAL CONDITION RESULTS OPERATIONS Cautionary Statements About Forward-Looking Statements report contains certain estimates forward-looking statements within meaning Section 21E Securities Exchange Act 1934, amended, Section 27A Securities Act 1933, amended, which intended covered safe harbor provisions forward-looking statements contained Private Securities Litigation Reform Act 1995, may identified use words like “plans,” “expects,” “will,” “anticipates,” “believes,” “intends,” “projects,” “estimates,” “outlook,” other words similar meaning. All statements address expectations projections about future, including statements about Corteva’s financial results outlook; strategy growth; product development; regulatory approvals; market position; capital allocation strategy; liquidity; sustainability targets initiatives; anticipated benefits acquisitions, restructuring actions, cost savings initiatives; outcome contingencies, such litigation environmental matters, forward-looking statements. Forward-looking statements other estimates based certain assumptions expectations future events which may not accurate realized. Forward-looking statements other estimates also involve risks uncertainties, many which beyond company's control."
}