{
  "item1": "CVS Health Corporation, together its subsidiaries (collectively, “CVS Health,” “Company,” “we,” “our” “us”), leading health solutions company building world health around every consumer serves connecting care so works people wherever they are. December 31, 2024, more than 9,000 retail locations, more than 1,000 walk-in primary care medical clinics, leading pharmacy benefits manager approximately 90 million plan members expanding specialty pharmacy solutions, dedicated senior pharmacy care business serving more than 800,000 patients per year. serve estimated more than 36 million people through traditional, voluntary consumer-directed health insurance products related services, including expanding Medicare Advantage offerings leading standalone Medicare Part D prescription drug plan (“PDP”). creating new sources value through integrated model allowing us expand into personalized, technology driven care delivery health services, increasing access quality care, delivering better health outcomes lowering overall health care costs.",
  "item7": "Item 7. Management’s Discussion Analysis Financial Condition Results Operations. (“MD&A”) Overview Business CVS Health Corporation, together its subsidiaries (collectively, “CVS Health,” “Company,” “we,” “our” “us”), leading health solutions company building world health around every consumer serves connecting care so works people wherever they are. December 31, 2024, Company more than 9,000 retail locations, more than 1,000 walk-in primary care medical clinics, leading pharmacy benefits manager approximately 90 million plan members expanding specialty pharmacy solutions, dedicated senior pharmacy care business serving more than 800,000 patients per year.",
  "item2": "Item 2. Management’s Discussion Analysis Financial Condition Results Operations (“MD&A”) Overview Business CVS Health Corporation, together its subsidiaries (collectively, “CVS Health,” “Company,” “we,” “our” “us”), leading health solutions company building world health around every consumer serves connecting care so works people wherever they are. September 30, 2025, Company approximately 9,000 retail locations, more than 1,000 walk-in primary care medical clinics leading pharmacy benefits manager approximately 87 million plan members expanding specialty pharmacy solutions. Company also serves estimated more than 37 million people through traditional, voluntary consumer-directed health insurance products related services, including expanding Medicare Advantage offerings leading standalone Medicare Part D prescription drug plan (“PDP”)."
}