{
  "source_file": "cvs-20241231.htm",
  "form_type": "10-K",
  "item1": "Item 1.  Business.\nOverview\nCVS Health Corporation, together with its subsidiaries (collectively, “CVS Health,” the “Company,” “we,” “our” or “us”), is a leading health solutions company building a world of health around every consumer it serves and connecting care so that it works for people wherever they are. As of December 31, 2024, we had more than 9,000 retail locations, more than 1,000 walk-in and primary care medical clinics, a leading pharmacy benefits manager with approximately 90 million plan members and expanding specialty pharmacy solutions, and a dedicated senior pharmacy care business serving more than 800,000 patients per year. We serve an estimated more than 36 million people through traditional, voluntary and consumer-directed health insurance products and related services, including expanding Medicare Advantage offerings and a leading standalone Medicare Part D prescription drug plan (“PDP”). We are creating new sources of value through our integrated model allowing us to expand into personalized, technology driven care delivery and health services, increasing access to quality care, delivering better health outcomes and lowering overall health care costs.\nThe Company has four reportable segments: Health Care Benefits, Health Services, Pharmacy & Consumer Wellness and Corporate/Other.\nBusiness Strategy\nWe are building a world of health around every consumer we serve, seeking to make it easier and more affordable to live a healthier life. This means delivering solutions that are more personalized, simpler to use and increasingly digital so consumers can receive care when, where and how they desire. We address holistic health – physical, emotional, social and economic – and we are creating new sources of value through our integrated care model which allows us to expand into personalized, technology driven care delivery and health services, increasing access to quality care, delivering better health outcomes and lowering overall health care costs. We believe our consumer-centric strategy will drive sustainable long-term growth and deliver value for all stakeholders.\nHealth Care Benefits Segment\nThe Health Care Benefits segment operates as one of the nation’s leading diversified health care benefits providers, serving an estimated more than 36 million people as of December 31, 2024. The Health Care Benefits segment has the information and resources to help members, in consultation with their health care professionals, make more informed decisions about their health care. The Health Care Benefits segment offers a broad range of traditional, voluntary and consumer-directed health insurance products and related services, including medical, pharmacy, dental and behavioral health plans, medical management capabilities, Medicare Advantage and Medicare Supplement plans, PDPs and Medicaid health care management services. The Health Care Benefits segment’s primary customers, its members, primarily access the segment’s products and services through employer groups, government-sponsored plans or individually. The Health Care Benefits segment also serves customers who purchase products and services that are ancillary to its health insurance products.\nHealth Care Benefits Products and Services \nThe Company refers to insurance products (where it assumes all or a majority of the risk for medical and dental care costs) as “Insured” and administrative services contract products (where the plan sponsor assumes all or a majority of the risk of medical and dental care costs) as “ASC.” Health Care Benefits segment products and services consist of the following:\n•\nCommercial Medical\n: The Health Care Benefits segment offers point-of-service (“POS”), preferred provider organization (“PPO”), health maintenance organization (“HMO”) and indemnity benefit (“Indemnity”) plans. Commercial medical products also include health savings accounts (“HSAs”) and consumer-directed health plans that combine traditional POS or PPO and/or dental coverage, subject to a deductible, with an accumulating benefit account (which may be funded by the plan sponsor and/or the member in the case of HSAs). Principal products and services are targeted specifically to large multi-site national, mid-sized and small employers, individual insureds and expatriates. The Company offers medical stop loss insurance coverage for certain employers who elect to self-insure their health benefits. Under medical stop loss insurance products, the Company assumes risk for costs associated with large individual claims and/or aggregate loss experience within an employer’s plan above a pre-set annual threshold. The segment also has a portfolio of additional health products and services that complement its medical products such as dental plans, behavioral health and employee \n2\nassistance products, provider network access and vision products. The Company sold Insured plans directly to individual consumers through the individual public health insurance exchanges (“Public Exchanges”) in 17 states as of December 31, 2024.\n•\nGovernment Medical\n: In select geographies, the Health Care Benefits segment offers Medicare Advantage plans, Medicare Supplement plans and prescription drug coverage for Medicare beneficiaries; participates in Medicaid and subsidized Children’s Health Insurance Programs (“CHIP”); and participates in demonstration projects for members who are eligible for both Medicare and Medicaid (“Duals”). These Government Medical products are further described below:\n•\nMedicare Advantage: \nThrough annual contracts with the U.S. Centers for Medicare & Medicaid Services (“CMS”), the Company offers HMO and PPO products for eligible individuals in certain geographic areas through the Medicare Advantage program. Members typically receive enhanced benefits over traditional fee-for-service Medicare coverage (“Original Medicare”), including reduced cost-sharing for preventive care, vision and other services. The Company offered network-based HMO and/or PPO plans in 46 states and Washington, D.C. in 2024. For certain qualifying employer groups, the Company offers Medicare PPO products nationally. When combined with the Company’s PDP product, these national PPO plans form an integrated national Insured Medicare product for employers that provides medical and pharmacy benefits.\n•\nMedicare PDP: \nThe Company is a national provider of drug benefits under the Medicare Part D prescription drug program. All Medicare eligible individuals are eligible to participate in this voluntary prescription drug plan. Members typically receive coverage for certain prescription drugs, usually subject to a deductible, co-insurance and/or co-payment. The Company offered PDP plans in all 50 states and Washington, D.C. in 2024.\n•\nMedicare Supplement: \nFor certain Medicare eligible members, the Company offers supplemental coverage for certain health care costs not covered by Original Medicare. The products included in the Medicare Supplement portfolio help to cover some of the gaps in Original Medicare, and include coverage for Medicare deductibles and coinsurance amounts. The Company offered a wide selection of Medicare Supplement products in 49 states and Washington, D.C. in 2024.\n•\nMedicaid and CHIP:\n The Company offers health care management services to individuals eligible for Medicaid and CHIP under multi-year contracts with government agencies in various states that are subject to annual appropriations. CHIP are state-subsidized insurance programs that provide benefits for families with uninsured children. The Company offered these services on an Insured or ASC basis in 16 states in 2024.\n•\nDuals: \nThe Company provides health coverage to beneficiaries who are dually eligible for both Medicare and Medicaid coverage. These members must meet certain income and resource requirements in order to qualify for this coverage. The Company coordinates 100% of the care for these members and may provide them with additional services in order to manage their health care costs. \nThe Company also has a portfolio of transformative products and services aimed at creating a holistic and integrated approach to individual health and wellness. These products and services complement the Commercial Medical and Government Medical products and aim to provide innovative solutions, create integrated experience offerings and enable enhanced care delivery to customers. \nHealth Care Benefits Provider Networks \nThe Company contracts with physicians, hospitals and other providers for services they provide to the Company’s members. The Company uses a variety of techniques designed to help encourage appropriate utilization of medical services (“utilization”) and maintain affordability of quality coverage. In addition to contracts with providers for negotiated rates of reimbursement, these techniques include creating risk sharing arrangements that align economic incentives with providers, the development and implementation of guidelines for the appropriate utilization and the provision of data to providers to enable them to improve health care quality. At December 31, 2024, the Company’s underlying nationwide provider network had approximately 1.9 million participating providers. Other providers in the Company’s provider networks also include laboratory, imaging, urgent care and other freestanding health facilities.\nHealth Care Benefits Quality Assessment\nCMS uses a 5-star rating system to monitor Medicare health care and drug plans and ensure that they meet CMS’s quality standards. CMS uses this rating system to provide Medicare beneficiaries with a tool that they can use to compare the overall quality of care and level of customer service of companies that provide Medicare health care and drug plans. The rating system considers a variety of measures adopted by CMS, including quality of preventative services, chronic illness management and overall customer satisfaction. See “Health Care Benefits Pricing” below in this Item 1 for further discussion of star ratings. The \n3\nCompany seeks Health Plan accreditation for Aetna Inc. (“Aetna”) HMO plans from the National Committee for Quality Assurance (“NCQA”), a private, not-for-profit organization that evaluates, accredits and certifies a wide range of health care organizations. Health care plans seeking accreditation must pass a rigorous, comprehensive review and must annually report on their performance.\nAetna Life Insurance Company (“ALIC”), a wholly-owned subsidiary of the Company, has received nationwide NCQA PPO Health Plan accreditation. As of December 31, 2024, all of the Company’s Commercial HMO and all of ALIC’s PPO members who were eligible participated in HMOs or PPOs that are accredited by the NCQA.\nThe Company’s provider selection and credentialing/re-credentialing policies and procedures are consistent with NCQA and URAC, a health care accrediting organization that establishes quality standards for the health care industry, as well as state and federal, requirements. In addition, the Company is certified under the NCQA Credentials Verification Organization (“CVO”) certification program for all certification options and has URAC CVO accreditation.\nQuality assessment programs for contracted providers who participate in the Company’s networks begin with the initial review of health care practitioners. Practitioners’ licenses and education are verified, and their work history is collected by the Company or in some cases by the practitioner’s affiliated group or organization. The Company generally requires participating hospitals to be certified by CMS or accredited by The Joint Commission, the American Osteopathic Association, or Det Norske Veritas Healthcare.\nThe Company also offers quality and outcome measurement programs, quality improvement programs and health care data analysis systems to providers and purchasers of health care services.\nHealth Care Benefits Information Systems\nThe Health Care Benefits segment currently operates and supports an end-to-end suite of information technology platforms to support member engagement, enrollment, health benefit administration, care management, service operations, financial reporting and analytics. Platforms are supported by an integration layer to facilitate the transfer of real-time data. There is continued focus and investment in enterprise data platforms, cloud capabilities, digital products to offer innovative solutions and a seamless experience to the Company’s members through mobile and web channels. The Company is making concerted investments in emerging technology capabilities such as artificial intelligence (“AI”) to further automate, augment and improve its operational capabilities, and to improve the experience for providers, patients, and consumers. The Health Care Benefits segment is utilizing the full breadth of the Company’s assets to build enterprise technology that will help guide our members through their health care journey, provide them a high level of service, enable healthier outcomes and encourage them to take next best actions to lead healthier lives.\nHealth Care Benefits Customers\nMedical membership is dispersed throughout the U.S., and the Company also serves medical members in certain countries outside the U.S. The Company offers a broad range of traditional, voluntary and consumer-directed health insurance products and related services, many of which are available nationwide. The Company markets its products and services to employer groups, individuals, college students, part-time and hourly workers, health plans, providers, governmental units, government-sponsored plans, labor groups and expatriates. For additional information on medical membership, see “Health Care Benefits Segment” in the Management’s Discussion and Analysis of Financial Condition and Results of Operations (the “MD&A”) included in Item 7 of this 10-K. \nThe Company markets both Commercial Insured and ASC products and services primarily to employers that sponsor the Company’s products for the benefit of their employees and their employees’ dependents. Frequently, larger employers offer employees a choice among coverage options from which the employee makes his or her selection during a designated annual open enrollment period. Typically, employers pay all of the monthly premiums to the Company and, through payroll deductions, obtain reimbursement from employees for a percentage of the premiums that is determined by each employer. Some Health Care Benefits products are sold directly to employees of employer groups on a fully employee-funded basis. In some cases, the Company bills the covered individual directly. The Company also sells Insured plans directly to individual consumers in certain geographies through the Public Exchanges.\nThe Company offers Insured Medicare coverage on an individual basis as well as through employer groups to their retirees. Medicaid and CHIP members are enrolled on an individual basis. The Company also offers Insured health care coverage to members who are dually-eligible for both Medicare and Medicaid. \n4\nHealth Care Benefits products are sold through: the Company’s sales personnel; independent brokers, agents and consultants who assist in the production and servicing of business; as well as private health insurance exchanges (“Private Exchanges”) and Public Exchanges (together with Private Exchanges, “Insurance Exchanges”). For large employers or other entities that sponsor the Company’s products (“plan sponsors”), independent consultants and brokers are frequently involved in employer health plan selection decisions and sales. In some instances, the Company may pay commissions, fees and other amounts to brokers, agents, consultants and sales representatives who place business with the Company. In certain cases, the customer pays the broker for services rendered, and the Company may facilitate that arrangement by collecting the funds from the customer and transmitting them to the broker. The Company supports marketing and sales efforts with an advertising program that may include television, radio, billboards, print media and social media, supplemented by market research and direct marketing efforts.\nThe U.S. federal government is a significant customer of the Health Care Benefits segment through contracts with CMS for coverage of Medicare-eligible individuals and federal employee-related benefit programs. Other than the contracts with CMS, the Health Care Benefits segment is not dependent upon a single customer or a few customers the loss of which would have a significant effect on the earnings of the segment. The loss of business from any one or a few independent brokers or agents would not have a material adverse effect on the earnings of the Health Care Benefits segment. Health Care Benefits segment revenues from the federal government accounted for 18% of the Company’s consolidated total revenues in 2024, 2023 and 2022. Contracts with CMS for coverage of Medicare-eligible individuals in the Health Care Benefits segment accounted for approximately 74%, 73% and 74%, respectively, of the Company’s consolidated revenues from the federal government in 2024, 2023 and 2022.\nHealth Care Benefits Pricing\nFor Commercial Insured plans, contracts containing the pricing and other terms of the relationship are generally established in advance of the policy period and typically have a duration of one year. Fees under ASC plans are generally fixed for a period of one year.\nGenerally, a fixed premium rate is determined at the beginning of the policy period for Commercial Insured plans. The Company typically cannot recover unanticipated increases in health care and other benefit costs in the current policy period; however, it may consider prior experience for a product in the aggregate or for a specific customer, among other factors, in determining premium rates for future policy periods. Where required by state laws, premium rates are filed and approved by state regulators prior to contract inception. Future operating results could be adversely affected if the premium rates requested are not approved or are adjusted downward or their approval is delayed by state or federal regulators. \nThe Company has Medicare Advantage and PDP contracts with CMS to provide HMO, PPO and prescription drug coverage to Medicare beneficiaries in certain geographic areas. Under these annual contracts, CMS pays the Company a fixed per member (or “capitation”) payment and/or a portion of the premium, both of which are based on membership and adjusted for demographic and health risk factors. CMS also considers inflation, changes in utilization patterns and average per capita fee-for-service Medicare costs in the calculation of the fixed capitation payment or premium. PDP contracts also provide a risk-sharing arrangement with CMS to limit the Company’s exposure to unfavorable expenses or benefit from favorable expenses. Amounts payable to the Company under the Medicare arrangements are subject to annual revision by CMS, and the Company elects to participate in each Medicare service area or region on an annual basis. Premiums paid to the Company for Medicare products are subject to federal government reviews and audits, which can result, and have resulted, in retroactive and prospective premium adjustments and refunds to the government and/or members. In addition to payments received from CMS, some Medicare Advantage products and all PDP products require a supplemental premium to be paid by the member or sponsoring employer. In some cases, these supplemental premiums are adjusted based on the member’s income and asset levels. Compared to Commercial Medical products, Medicare contracts generate higher per member per month revenues and higher health care and other benefit costs. \nThe Patient Protection and Affordable Care Act and the Health Care and Education Reconciliation Act of 2010 (collectively, the “ACA”) ties a portion of each Medicare Advantage plan’s reimbursement to the plan’s “star ratings.” Plans must have a star rating of 4 or higher (out of 5) to qualify for bonus payments. CMS released the Company’s 2025 star ratings in October 2024. The Company’s 2025 star ratings will be used to determine which of the Company’s Medicare Advantage plans have ratings of four stars or higher and qualify for bonus payments in 2026. Based on the Company’s membership at December 31, 2024, 88% of the Company’s Medicare Advantage members were in plans with 2025 star ratings of at least 4.0 stars, compared to 91% of the Company’s Medicare Advantage members being in plans with 2024 star ratings of at least 4.0 stars based on the Company’s membership at December 31, 2023. \n5\nRates for Medicare Supplement products are regulated at the state level and vary by state and plan.\nUnder Insured Medicaid contracts, state government agencies pay the Company fixed monthly rates per member that vary by state, line of business and demographics; and the Company arranges, pays for and manages the health care services provided to Medicaid beneficiaries. These rates are subject to change by each state, and, in some instances, provide for adjustment for health risk factors. CMS requires these rates to be actuarially sound. The Company also receives fees from customers where it provides services under ASC Medicaid contracts. ASC Medicaid contracts generally are for periods of more than one year, and certain of them contain performance incentives and limited financial risk sharing with respect to certain medical, financial and operational metrics. Under these arrangements, performance is evaluated annually, with associated financial incentive opportunities, and financial risk share obligations are typically limited to a percentage of the fees otherwise payable to the Company. Payments to the Company under Medicaid contracts are subject to the annual appropriation process in the applicable state.\nUnder Duals contracts, the rate setting process is generally established by CMS in partnership with the state government agency participating in the demonstration project. Both CMS and the state government agency may seek premium and other refunds under certain circumstances, including if the Company fails to comply with CMS regulations or other contractual requirements.\nThe Company offers HMO and consumer-directed medical and dental plans to federal employees under the Federal Employees Health Benefits (“FEHB”) Program and the Federal Employees Dental and Vision Insurance Program. Premium rates and fees for those plans are subject to federal government review and audit, which can result, and have resulted, in retroactive and prospective premium and fee adjustments and refunds to the government and/or members.\nHealth Care Benefits Seasonality\nThe Health Care Benefits segment’s quarterly operating income progression is impacted by (i) the seasonality of benefit costs which generally increase during the year as Insured members progress through their annual deductibles and out-of-pocket expense limits, (ii) continued changes in product mix between Commercial and Government medical membership and (iii) the seasonality of operating expenses, which are generally the highest during the fourth quarter due primarily to spending to support readiness for the start of the upcoming plan year and marketing associated with Medicare annual enrollment. The Health Care Benefit segment’s quarterly operating income progression may be impacted by exogenous factors, which include regulatory or legal changes, as well as shifting care patterns. \nHealth Care Benefits Competition\nThe health care benefits industry is highly competitive, primarily due to a large number of for-profit and not-for-profit competitors, competitors’ marketing and pricing and a proliferation of competing products, including new products that are continually being introduced into the marketplace. New entrants into the marketplace, as well as consolidation within the industry, have contributed to and are expected to intensify the competitive environment. In addition, the rapid pace of change as the industry evolves towards a consumer-focused retail marketplace, including Insurance Exchanges, and the increased use of technology to interact with members, providers and customers, increase the risks the Company faces from new entrants and disruptive actions by existing competitors compared to prior periods.\nThe Company believes that the significant factors that distinguish competing health plans include the perceived overall quality (including accreditation status), quality of service, comprehensiveness of coverage, cost (including premium rates, provider discounts and member out-of-pocket costs), product design, financial stability and ratings, breadth and quality of provider networks, ability to offer different provider network options, providers available in such networks, and quality of member support and care management programs. The Company believes that it is competitive on each of these factors. The Company’s ability to increase the number of persons covered by its health plans or to increase Health Care Benefits segment revenues is affected by its ability to differentiate itself from its competitors on these factors. Competition may also affect the availability of services from providers, including primary care physicians, specialists and hospitals.\nInsured products compete with local and regional health care benefits plans, health care benefits and other plans sponsored by other large commercial health care benefit insurance companies, health system owned health plans, new entrants into the marketplace and numerous for-profit and not-for-profit organizations operating under licenses from the Blue Cross and Blue Shield Association. The largest competitor in Medicare products is Original Medicare. Additional Health Care Benefits segment competitors include other types of medical and dental provider organizations, various specialty service providers \n6\n(including PBM services providers), health care consultants, financial services companies, integrated health care delivery organizations (networks of providers who also coordinate administrative services for and assume insurance risk of their members), third party administrators (“TPAs”) and, for certain plans, programs sponsored by the federal or state governments. Emerging competitors include start up health care benefits plans, provider-owned health plans, new joint ventures (including not-for-profit joint ventures among firms from multiple industries), financial services firms that are distributing competing products on their proprietary Private Exchanges, and consulting firms that are distributing competing products on their proprietary Private Exchanges, as well as non-traditional distributors such as retail companies. The Company’s ability to increase the number of persons enrolled in Insured Commercial Medical products also is affected by the desire and ability of employers to self-fund their health coverage.\nThe Health Care Benefits segment’s ASC plans compete primarily with other large commercial health care benefit insurance companies, numerous for-profit and not-for-profit organizations operating under licenses from the Blue Cross and Blue Shield Association and TPAs.\nIn addition to competitive pressures affecting the Company’s ability to obtain new customers or retain existing customers, the Health Care Benefits segment’s medical membership has been and may continue to be adversely affected by adverse and/or uncertain economic conditions and reductions in workforce by existing customers due to adverse and/or uncertain general economic conditions, especially in the U.S. and industries where such membership is concentrated.\nHealth Care Benefits Reinsurance\nThe Company\n \ncurrently has\n \nseveral reinsurance agreements with non-affiliated insurers that relate to Health Care Benefits insurance policies. The Company entered into these contracts to reduce the risk of catastrophic losses which in turn reduces capital and surplus requirements. The Company frequently evaluates reinsurance opportunities and refines its reinsurance and risk management strategies on a regular basis.\nHealth Services Segment\nThe Health Services segment provides a full range of PBM solutions, delivers health care services in its medical clinics, virtually, and in the home, and offers provider enablement solutions. PBM solutions include plan design offerings and administration, formulary management, retail pharmacy network management services, and specialty and mail order pharmacy services. In addition, the Company provides clinical services, disease management services, medical spend management and pharmacy and/or other administrative services for providers and federal 340B drug pricing program covered entities (“Covered Entities”). The Company operates a group purchasing organization that negotiates pricing for the purchase of pharmaceuticals and rebates with pharmaceutical manufacturers on behalf of its participants and provides various administrative, management and reporting services to pharmaceutical manufacturers. During 2023, the Company completed the acquisition of two key health care delivery assets – Signify Health, Inc. (“Signify Health”) a leader in health risk assessments, value-based care and provider enablement services, and Oak Street Health, Inc. (“Oak Street Health”) a leading multi-payor operator of value-based primary care centers serving Medicare eligible patients. The Company also launched Cordavis\nTM\n, a wholly owned subsidiary that works directly with pharmaceutical manufacturers to commercialize and/or co-produce high quality biosimilar products. The Health Services segment’s clients and customers are primarily employers, insurance companies, unions, government employee groups, health plans, PDPs, Medicaid managed care (“Managed Medicaid”) plans, CMS, plans offered on Insurance Exchanges and other sponsors of health benefit plans throughout the U.S., patients who receive care in the Health Services segment’s medical clinics, virtually or in the home, as well as Covered Entities. During the year ended December 31, 2024, the Company’s PBM filled or managed 1.9 billion prescriptions on a 30-day equivalent basis.\nHealth Services\n \nProducts and Services\nPBM Solutions\nThe Health Services segment manages prescription drug distribution directly through the Company’s specialty and mail order pharmacies and through pharmacies in its retail network. All prescriptions processed by the Company are analyzed, processed and documented by the Company’s proprietary prescription management systems. These systems provide essential features and functionality to allow plan members to utilize their prescription drug benefits. These systems also streamline the process by which prescriptions are processed by staff and network pharmacists by enhancing review of various items through automation, including plan eligibility, early refills, duplicate dispensing, appropriateness of dosage, drug interactions or allergies, over-utilization and potential fraud.\nPlan Design Offerings and Administration\n7\nThe Company assists its PBM clients in designing pharmacy benefit plans that help improve health outcomes while minimizing the costs to the client. The Company also assists PBM clients in monitoring the effectiveness of their plans through frequent, informal communications, the use of proprietary software, as well as through formal annual, quarterly and sometimes monthly performance reviews. The Company administers pharmacy benefit plans for clients who contract with it to facilitate prescription drug coverage and claims processing for their eligible plan members. The Company also provides administrative services for Covered Entities.\nThe Company makes recommendations to help PBM clients design benefit plans that promote the use of lower cost, clinically appropriate drugs and helps its PBM clients control costs by recommending plan designs that encourage the use of generic equivalents of brand name drugs when such equivalents are available. Clients also have the option, through plan design, to further lower their pharmacy benefit plan costs by setting different member payment levels for different products on their drug lists or “formularies,” which helps guide members to choose lower cost alternatives through appropriate financial incentives.\nFormulary Management\nThe Company utilizes an independent panel of doctors, pharmacists and other medical experts, referred to as the CVS Caremark National Pharmacy and Therapeutics Committee, to review and approve the selection of drugs that meet the Company’s standards of safety and efficacy for inclusion on one of the Company’s template formularies. The Company’s formularies provide recommended products in numerous drug classes to help ensure member access to clinically appropriate drugs with alternatives within a class under the client’s pharmacy benefit plan, while helping to drive the lowest net cost for clients that select one of the Company’s formularies. To help improve clinical outcomes for members and clients, the Company conducts ongoing, independent reviews of all drugs, including those appearing on the formularies and generic equivalent products. Many of the Company’s clients choose to adopt a template formulary offering as part of their plan design. PBM clients are given capabilities to offer real time benefits information for a member’s specific plan design, provided electronically in the Electronic Health Record at the point of prescribing, at the CVS pharmacy and directly to members.\nRetail Pharmacy Network\n \nManagement Services\nThe Company maintains a national network of approximately 65,000 retail pharmacies, consisting of approximately 37,000 chain pharmacies (which include CVS pharmacy locations) and approximately 28,000 independent pharmacies, in the U.S., including Puerto Rico, the District of Columbia, Guam and the U.S. Virgin Islands. When a customer fills a prescription in a retail pharmacy, the pharmacy sends prescription data electronically to the Company from the point-of-sale. This data interfaces with the Company’s proprietary prescription management systems, which verify relevant plan member data and eligibility, while also performing a drug utilization review to help evaluate clinical appropriateness and safety and confirming that the pharmacy will receive payment for the prescription. \nSpecialty and Mail Order Pharmacy Services\nThe Company operates mail order pharmacies, specialty mail order pharmacies and retail specialty pharmacy stores in the U.S. The mail order pharmacies are used primarily for maintenance medications, while the specialty mail order pharmacies and retail specialty pharmacy stores are used for the delivery of advanced medications to individuals with chronic or genetic diseases and disorders. The Health Services segment’s plan members or their prescribers submit prescriptions or refill requests to these pharmacies, and staff pharmacists review these prescriptions and refill requests with the assistance of the Company’s prescription management systems. This review may involve communications with the prescriber and, with the prescriber’s approval when required, can result in interventions designed to help reduce cost and/or improve quality of treatment. The Health Services segment pays an administrative service fee to the Pharmacy & Consumer Wellness segment, in exchange for which the Pharmacy & Consumer Wellness segment provides pharmacy fulfillment and patient management services to support the Health Services segment’s specialty and mail order pharmacy offerings.\nThe Company’s mail order pharmacies and specialty mail order pharmacies have been awarded Mail Service Pharmacy and Specialty Pharmacy accreditation, respectively, from URAC. Substantially all of the Company’s specialty mail order pharmacies also have been accredited by The Joint Commission and the Accreditation Commission for Health Care (“ACHC”), which are independent, not-for-profit organizations that accredit and certify health care programs and organizations in the U.S. The ACHC accreditation includes an additional accreditation by the Pharmacy Compounding Accreditation Board, which certifies compliance with the highest level of pharmacy compounding standards, and a distinction in Rare Diseases and Orphan Drugs. \nClinical Services\nThe Company offers multiple clinical programs and services to help clients manage overall pharmacy and health care costs in a clinically appropriate manner. These programs are primarily designed to promote better health outcomes and to help target inappropriate medication utilization and non-adherence to medication, each of which may result in adverse medical events that \n8\nnegatively affect member health and client pharmacy and medical spend. These programs include utilization management (“UM”), medication management, quality assurance, adherence and counseling programs to complement the client’s plan design and clinical strategies. The Company offers an integrated strategy that aims to help decrease the potential for inappropriate opioid use while preserving access for those with genuine chronic pain needs through concurrent and retrospective claims’ review.  In addition, this strategy aims to address potential fraud, waste, and abuse across multiple drug classes through surveillance and communications to prescribers and pharmacies. Core medication support products such as Pharmacy Advisor and Drug Savings Review optimize utilization through digital, phone, in-person, and provider-facing outreach to help participating plan members with certain chronic diseases to identify gaps in care, adhere to their prescribed medications, ensure efficient use of those medications, and manage their overall health conditions. The CVS Weight Management program optimizes utilization of GLP-1 medication and provides the label-recommended lifestyle support and coaching to maximize and maintain weight loss on these therapies, while addressing new indications (e.g., cardiovascular disease). The Company also has digital connectivity that helps to lower drug costs for patients by providing expanded visibility to lower cost alternatives through enhanced analytics and data sharing. \nDisease Management Programs\nThe Company’s clinical programs and services utilize advanced protocols and offer clients convenience in working with providers and other third parties. The Company’s care management program covers diseases such as rheumatoid arthritis, Parkinson’s disease, epilepsy and multiple sclerosis and is accredited by the NCQA. The Company’s UM program covers similar diseases and is accredited by the NCQA and URAC.\nMedical Benefit Management\n \nThe Company’s NovoLogix\n® \nonline preauthorization tool helps identify and capture cost savings opportunities for specialty drugs billed under the medical benefit by identifying outliers to appropriate dosages and costs, and helps to ensure clinically appropriate use of specialty drugs.\nGroup Purchasing Organization Services\nThe Company operates a group purchasing organization that negotiates pricing for the purchase of pharmaceuticals and rebates with pharmaceutical manufacturers on behalf of its participants. The Company also provides various administrative, management and reporting services to pharmaceutical manufacturers.\nValue-Based Care\nIn response to rising healthcare spending in the U.S., commercial, government and other payors are shifting away from fee-for-service payment models towards value-based models, including risk-based payment models that tie financial incentives to quality, efficiency and coordination of care. Value-based care (“VBC”) refers to the goal of incentivizing healthcare providers to simultaneously increase quality while lowering the cost of care for patients. More specifically, providers in a VBC model are incentivized to focus on more preventative care, higher quality of care and better coordination of care to create better health outcomes and avoid potentially expensive complications from illnesses that could be managed more conveniently and cost effectively.\nThe Company is committed to expanding value-based care in the U.S. and delivering higher quality care to patients at a lower overall cost to the industry.  The Company operates in value-based care through two primary means: providing comprehensive primary care through its Oak Street Health primary care centers and enabling independent health systems transition to value-based care through contracting and care management services. The Company’s value-based care assets typically contract with payors, primarily Medicare Advantage plans, and/or CMS. \nThe Company’s Oak Street Health business operates retail-like, community-based centers that provide medical primary care services and support Medicare eligible patients in the management of chronic illnesses and the prevention of unnecessary acute events. The Company integrates population health analytics, social support services and primary care into the care model to drive improved patient outcomes. The Company contracts with health plans and CMS to generate medical costs savings, assume full financial risk of its patients and realize a return on its investment in primary care. \nThe Company’s clinics implement a branded and consumer-focused design to create a welcoming environment that engages patients in highly accessible, convenient locations close to where patients live, work and shop. As of December 31, 2024, the Company operated 239 centers across 27 states. During the year ended December 31, 2024, the Company’s centers provided care for approximately 500,000 patients.\nIn addition to its primary care centers, the Company provides enablement services to independent health systems, assisting these groups with their transition to value-based care. The Company’s customers practice value-based care primarily through \n9\ntwo programs administered by CMS, the Accountable Care Organization (“ACO”) Realizing Equity, Access, and Community Health (“REACH”) Model (collectively, “ACO REACH”) and the Medicare Shared Savings Program (“MSSP”), under which the Company served a total of more than 1 million covered lives as of December 31, 2024.\nACOs are networks of healthcare providers and suppliers that work together to invest in infrastructure and redesign delivery processes to attempt to achieve high quality and efficient delivery of services. ACOs that achieve performance standards established by the U.S. Department of Health and Human Services (“HHS”) are eligible to share in a portion of the amounts saved by the Medicare program.\nIn-Home Health Evaluations\nAs a complement to its value-based care delivery, the Company operates a large mobile network of credentialed providers in the U.S. through its Signify Health business. These credentialed providers are deployed into the home primarily to conduct in-home health evaluations (“IHEs”) and perform select diagnostic services.  IHEs may also be performed virtually or at a healthcare provider facility. During the year ended December 31, 2024, the Company performed more than 3 million IHEs. While in the home, providers perform IHEs with the assistance of the Company’s longitudinal patient records and proprietary clinical workflow software with its integrated device hub. The Company’s software guides clinical workflows as well as in-home diagnostic screenings, yielding a rich patient report of hundreds of data points. The Company also offers diagnostic and preventive services and provides comprehensive medication review services while in the home. Through its IHEs, the Company creates a comprehensive, documented record of the clinical, social and behavioral needs of its health plan customers’ medically complex populations and seek to further engage them with the healthcare system. \nThe evaluation results of IHEs are provided to individuals’ primary care physicians. The Company believes sharing these results helps to fill gaps in care, while encouraging individuals who have not regularly visited their PCP to schedule a visit. The IHEs also provide health plans with insights into member health without taking members out of the home and contribute to health plans’ ability to effectively participate in value-based and risk-adjusted government programs such as Medicare Advantage. The data gathered during an IHE is also a resource that can be used by health plans to improve their Healthcare Effectiveness Data and Information Set (“HEDIS”) scores and Medicare Advantage star ratings. \nMinuteClinic\nAs of December 31, 2024, the Company operated more than 900 MinuteClinic locations in the U.S. The clinics are staffed by nurse practitioners and physician assistants who utilize nationally established guidelines to deliver a variety of health care services. Payors value these clinics because they provide convenient, high-quality, cost-effective care, in many cases offering an attractive alternative to more expensive sites of care. MinuteClinic also offers virtual care services to connect customers with licensed providers to provide access to health services remotely. MinuteClinic is collaborating with the Company’s medical and pharmacy members to help meet the needs of the Company’s health plan and client plan members by offering programs that can improve member health and lower costs. MinuteClinic also maintains relationships with leading hospitals, clinics and physicians in the communities we serve to support and enhance quality, access and continuity of care.\nCordavis\nThe Company launched Cordavis, a wholly owned subsidiary that works directly with pharmaceutical manufacturers to commercialize and/or co-produce high quality biosimilar products. Through Cordavis, the Company intends to develop a portfolio of products that will provide broader access to biosimilars in the U.S.  As access to biosimilars increases, it is expected to generate more competition in the market which should lead to lower costs and result in higher savings for our clients.\nHealth Services Information Systems\nThe Health Services segment’s claim adjudication platform incorporates architecture that centralizes the data generated from adjudicating retail pharmacy, specialty and mail order claims and delivering other solutions to PBM clients. The Health Engagement Engine\n®\n technology and proprietary clinical algorithms help connect various parts of the enterprise and serve an essential role in cost management and health improvement, leveraging cloud-native technologies and practices. This capability transforms pharmacy data into actionable interventions at key points of care, including in retail, mail and specialty pharmacies as well as in customer care call center operations, leveraging our enterprise data platform to improve the quality of care. The technology leverages assisted artificial intelligence to deliver insights to the business and bring automation to otherwise manual tasks. Specialty services also connects with our claim adjudication platform and various health plan adjudication platforms with a centralized architecture servicing many clients and members. Operating services, such as Specialty Expedite\n®\n, provide an interconnected onboarding solution for specialty medications and branding solutions ranging from fulfillment to total patient management. These services are managed through our new innovative specialty workflow and web platform.\n10\nThe Health Services segment’s custom-built proprietary Canopy technology is a key driver of the success of its value-based care model and foundation for patients receiving a consistent, high-quality level of care. Canopy underlies every aspect of the Company’s day-to-day clinical and operational workflows, allowing care teams to tailor care plans to the needs of both the patient and the business. Canopy integrates an immense amount of data about patients from a broad set of sources, including payor claims data, pharmacy data and medical records from hospitals and specialists and provides actionable insights and workflows to accelerate effective clinical management and oversight. Canopy leverages artificial intelligence and machine learning capabilities to create and refine a clinical rules engine (predictive models and prescriptive algorithms) that informs care delivery and addresses hospital admissions and readmissions, medical costs and patient retention.\nThrough the collaboration of its digital and technical teams, the Company has established critical tools which enable patients to schedule appointments through MinuteClinic.com. Key elements of the offerings include landing pages which highlight services and answer common questions, screening capabilities to determine patient eligibility, service location locator and appointment selection tools to efficiently identify the requested service on a specified date, time, and location and registration pages to collect required patient information, accelerating check-in once at the MinuteClinic. Once scheduled, the tools provide the user with instructions and notifications including SMS text message and email reminders, and also provide digital results and records, enabling patients to view and save their medical records for convenient access at a later point.  \nHealth Services Clients & Customers\nThe Company’s Health Services clients and customers are primarily employers, insurance companies, unions, government employee groups, health plans, PDPs, Managed Medicaid plans, CMS, plans offered on Insurance Exchanges, other sponsors of health benefit plans throughout the U.S., patients who receive care in the Health Services segment’s medical clinics, virtually or in the home, as well as Covered Entities. The Health Services segment’s revenues are primarily generated from the sale and managing of prescription drugs to eligible members in benefit plans maintained by clients. Pharmaceuticals are provided to eligible members in benefit plans maintained by clients and utilize the Company’s information systems, among other things, to help perform safety checks, drug interaction screening and identify opportunities for generic substitution.\nThe Company’s primary care operations rely on its value-based capitated partnerships with payors and CMS which manage and market Medicare Advantage plans across the U.S. The Company had strategic value-based relationships with over 25 different payors as of December 31, 2024, including each of the top 5 national payors by number of Medicare Advantage patients. These existing contracts and relationships and their understanding of the value of the Company’s model reduces the risk of entering into new markets as the Company typically has payor contracts before entering a new market. Maintaining, supporting and growing these relationships, particularly as the Company enters new geographies, is critical to its long-term success.\nThe Company’s value-based care arrangements are primarily directed at independent health systems, including community hospitals, physician practices and clinics, participating in, or seeking to participate in, ACOs or contract with Medicare Advantage plans.\nThe Company’s IHE operations customers are primarily Medicare Advantage health plans, making up approximately 86% of its total IHE volume. In 2024, the Company had IHE contracts with 51 health plans in the U.S., including 22 of the 50 largest Medicare Advantage plans.  \nHealth Services Seasonality\nThe majority of the Health Services segment revenues, including revenues generated from its PBM services, are not seasonal in nature.\nThe Company’s primary care operations experience some variability depending upon the time of year in which they are measured. Typically, a significant portion of the Company’s at-risk patient growth is experienced during the first quarter, after plan enrollment selections made during the fourth quarter of the prior annual enrollment period take effect. Finally, medical costs will vary seasonally depending on a number of factors including the weather, which can be a driver of certain illnesses such as the influenza virus.\nRevenues generated from the Company’s IHEs and related services are generally lowest in the fourth quarter of each calendar year. Annually, IHE customers provide a member list, which may be supplemented or amended during the year. Customers generally limit the number of times the Company may attempt to contact their members. Throughout the year, as IHEs are completed and the Company attempts to contact members, the number of members who have not received an IHE and whom \n11\nthe Company is still able to contact declines, typically resulting in fewer IHEs scheduled during the fourth quarter of each calendar year.\nHealth Services Competition\nThe Company believes the primary competitive factors in the health services industry include: (i) the ability to negotiate favorable discounts from drug manufacturers as well as to negotiate favorable discounts from, and access to, retail pharmacy networks; (ii) the ability to identify and apply effective cost management programs utilizing clinical strategies, including the development and utilization of preferred formularies; (iii) the ability to market PBM and other health products and services; (iv) the commitment to provide flexible, clinically-oriented services to clients and be responsive to clients’ needs; (v) the ability to attract and retain physicians, nurse practitioners, physician assistants and other medical personnel; (vi) the quality, scope and costs of products and services offered to clients and their members, as well as the care delivered to customers; and (vii) operational excellence in delivering services. \nThe Health Services segment has a significant number of competitors offering PBM services, including large, national PBM companies (e.g., Prime Therapeutics and MedImpact), PBMs owned by large national health plans (e.g., the Express Scripts business of Cigna Corporation and the Optum Rx business of UnitedHealth Group) and smaller standalone PBMs. The Health Services segment’s MinuteClinic offerings compete with retail health clinics, urgent care and primary care offices. The Company competes for provider solutions and health information technology (“HIT”) business with other large health plans and commercial health care benefit insurance companies as well as information technology companies and companies that specialize in provider solutions and HIT.  \nThe Company’s primary care operations compete with large and medium-sized local and national providers of primary care services and health system affiliated practices, for, among other things, contracts with payors, recruitment of physicians and other medical and non-medical personnel and individual patients. Principal primary care competitors for patients and payor contracts vary considerably in type and identity by market. Because of the low barriers of entry into the primary care business and the ability of physicians to own primary care centers and/or also be medical directors for their own centers, competition for growth in existing and expanding markets is not limited to large competitors with substantial financial resources.\nThe Company’s ACO operations compete with healthcare risk management providers. Key competitors are companies that work directly with providers to enable them to successfully take risk in value-based care arrangements. Some of these competitors focus on a specific function – like analytics – while others offer more comprehensive services. Some key competitors operate nationally, while other competitors are more geographically focused.\nThe Company’s IHE and related services operations compete with a wide variety of local and national providers of in-home, virtual and in-person diagnostic and evaluative services. Competitors include pure-play companies whose principal business is providing health risk assessments and similar services, as well as large payors, which may use a variety of different providers to perform health risk assessments across care settings or may perform some or all of their health risk assessments utilizing their own in-house capabilities.\nPharmacy & Consumer Wellness Segment\nThe Pharmacy & Consumer Wellness segment dispenses prescriptions in its retail pharmacies and through its infusion operations, provides ancillary pharmacy services including pharmacy patient care programs, diagnostic testing and vaccination administration, and sells a wide assortment of health and wellness products and general merchandise. The segment also conducts long-term care pharmacy (“LTC”) operations, which distribute prescription drugs and provide related pharmacy consulting and ancillary services to long-term care facilities and other care settings, and provides pharmacy fulfillment services to support the Health Services segment’s specialty and mail order pharmacy offerings. As of December 31, 2024, the Pharmacy & Consumer Wellness segment operated more than 9,000 retail locations, as well as online retail pharmacy websites, LTC pharmacies and on-site pharmacies, retail specialty pharmacy stores, compounding pharmacies and branches for infusion and enteral nutrition services. During the year ended December 31, 2024, the Pharmacy & Consumer Wellness segment filled 1.7 billion prescriptions on a 30-day equivalent basis and dispensed approximately 27.2% of total retail pharmacy prescriptions in the U.S.\nPharmacy & Consumer Wellness Products and Services\nA typical retail store sells prescription drugs and a wide assortment of high-quality, nationally advertised brand name and proprietary brand merchandise. Pharmacy locations may also contract with Covered Entities under the federal 340B drug \n12\npricing program. Front store categories include over-the-counter drugs, consumer health products, beauty products, personal care products and other general merchandise products. The Company purchases merchandise from numerous manufacturers and distributors. The Company believes that competitive sources are readily available for substantially all of the products carried in its retail stores and the loss of any one supplier would not likely have a material effect on the Pharmacy & Consumer Wellness segment. LTC operations include distribution of prescription drugs and related consulting and ancillary services.\nPharmacy & Consumer Wellness revenues by major product group are as follows:\nPercentage of Revenues\n2024\n2023\n2022\nPharmacy \n(1)\n80.9 \n%\n78.9 \n%\n76.9 \n%\nFront store and other \n(2)\n19.1 \n%\n21.1 \n%\n23.1 \n%\n100.0 \n%\n100.0 \n%\n100.0 \n%\n_____________________________________________\n(1)\nPharmacy includes LTC sales and sales in pharmacies within Target Corporation (“Target”) and other retail stores.\n(2)\n“Other” represents less than 11% of the “Front store and other” revenue category in all periods presented.\nPharmacy\n \nPharmacy revenues represented over three-fourths of Pharmacy & Consumer Wellness segment revenues in each of 2024, 2023 and 2022. The Company believes that retail pharmacy operations will continue to represent a critical part of the Company’s business due to industry demographics, e.g., an aging American population consuming a greater number of prescription drugs, prescription drugs being used more often as the first line of defense for managing illness, the introduction of new pharmaceutical products, the need for vaccinations and Medicare Part D growth. The Company believes the retail pharmacy business benefits from investment in both people and technology, as well as innovative collaborations with health plans, PBMs and providers. Given the nature of prescriptions, consumers want their prescriptions filled accurately by professional pharmacists using the latest tools and technology, and ready when promised. Consumers also need medication management programs and better information to help them get the most out of their health care dollars. To assist consumers with these needs, the Company has introduced integrated pharmacy health care services that provide an earlier, easier and more effective approach to engaging consumers in behaviors that can help lower costs, improve health and save lives. \nFront Store\nFront store revenues reflect the Company’s strategy of innovating with new and unique products and services, using innovative personalized marketing and adjusting the mix of merchandise to match customers’ needs and preferences. A key component of the front store strategy is the ExtraCare\n®\n card program, which is one of the largest and most successful retail loyalty programs in the U.S. The ExtraCare program allows the Company to balance marketing efforts so it can reward its best customers by providing them with automatic sale prices, customized coupons, ExtraBucks\n®\n rewards and other benefits. The Company also offers a subscription-based membership program, ExtraCare Plus\nTM\n, under which members are entitled to a suite of benefits delivered over the course of the subscription period, as well as a promotional reward that can be redeemed for future goods and services. The Company continues to launch and enhance new and exclusive brands to create unmatched offerings and deliver other unique product offerings, including a full range of high-quality proprietary brand products that are only available through CVS stores. The Company currently carries approximately 4,500 proprietary brand products, which accounted for approximately 21% of front store revenues during 2024. \nOn-site Pharmacies\nThe Company also operates a limited number of pharmacies located at client sites, which provide certain health plan members and customers with a convenient alternative for filling their prescriptions and receiving vaccinations.\nSpecialty and Mail Order Pharmacy Fulfillment Services\nThe Pharmacy & Consumer Wellness segment provides pharmacy fulfillment services to support the Health Services segment’s specialty and mail order pharmacy offerings, in exchange for which the Health Services segment pays an administrative service fee to the Pharmacy & Consumer Wellness segment.\nLong-term Care Pharmacy Operations\nThe Pharmacy & Consumer Wellness segment provides LTC pharmacy services through the Omnicare\n®\n business. Omnicare’s customers consist of skilled nursing facilities, assisted living facilities, independent living communities, hospitals, correctional facilities, and other health care service providers. The Company provides pharmacy consulting, including monthly patient drug therapy evaluations, to assist in compliance with state and federal regulations and provide proprietary clinical and health \n13\nmanagement programs. It also provides pharmaceutical case management services for retirees, employees and dependents who have drug benefits under corporate-sponsored health care programs.\nCommunity Location Development\nCVS Health’s community health destinations are an integral part of its ability to meet the needs of consumers and maintain its leadership position in the changing health care landscape. When paired with its rapidly expanding digital presence, the Company’s physical presence in thousands of communities across the country represents a competitive advantage by allowing it to develop deep and trusted relationships through everyday engagement in consumer health. The Company’s community health destinations have played, and will continue to play, a key role in the Company’s continued growth and success. During 2024, the Company opened 39 new locations, relocated 3 locations and closed 299 locations. \nThe Company’s continuous assessment of its national footprint is an essential component of competing effectively in the current health care environment. On an ongoing basis, the Company evaluates changes in population, consumer buying patterns and future health needs to assess the ability of its existing stores and locations to meet the needs of its consumers and the business. During the fourth quarter of 2021, the Company completed a strategic review of its retail business and announced its plans to reduce store density in certain locations through the closure of approximately 900 retail stores between 2022 and 2024. As of December 31, 2024, the Company had closed approximately 900 retail stores in connection with these actions.\nDuring the third quarter of 2024, in connection with an enterprise-wide restructuring plan, the Company completed a strategic review of its retail business and determined that it plans to close an additional 271 retail stores in 2025.  \nPharmacy & Consumer Wellness Information Systems\nThe Company has continued to invest in information systems to enable it to deliver exceptional customer service, enhance safety and quality, and expand patient care services while lowering operating costs. The proprietary WeCARE Workflow tool supports pharmacy teams by prioritizing work to meet customer expectations, facilitating prescriber outreach, and seamlessly integrating clinical programs. This solution delivers improved efficiency and enhances customer experience, as well as provides a framework to accommodate the evolution of pharmacy practice and the expansion of clinical programs. The Company’s Health Engagement Engine technology and data science clinical algorithms enable the Company to help identify opportunities for pharmacists to deliver face-to-face counseling regarding patient health and safety matters, including medication adherence issues, gaps in care and management of certain chronic health conditions. The Company’s digital strategy is to empower the consumer to navigate their pharmacy experience and manage their condition through integrated online and mobile solutions that offer utility and convenience. The Company has also established tools which enable customers to schedule diagnostic testing and vaccination appointments through CVS.com, provide instructions and notifications to the customer regarding the services, and, following administration, allow customers to access digital results for tests and records for vaccinations.\nPharmacy & Consumer Wellness Customers\n \nThe success of the Pharmacy & Consumer Wellness segment’s businesses is dependent upon the Company’s ability to establish and maintain contractual relationships with pharmacy benefit managers and other payors on acceptable terms. Substantially all of the Pharmacy & Consumer Wellness segment’s pharmacy revenues are derived from pharmacy benefit managers, managed care organizations (“MCOs”), government funded health care programs, commercial employers and other third-party payors. No single Pharmacy & Consumer Wellness payor accounted for 10% or more of the Company’s consolidated total revenues in 2024, 2023 or 2022.\nPharmacy & Consumer Wellness Seasonality\nThe majority of Pharmacy & Consumer Wellness segment revenues, particularly pharmacy revenues, generally are not seasonal in nature. However, front store revenues tend to be higher during the December holiday season. In addition, both pharmacy and front store revenues are affected by the timing and severity of the cough, cold and flu season, most notably during first and fourth quarters, resulting in higher administration of vaccines during those periods. Uncharacteristic or extreme weather conditions also can adversely affect consumer shopping patterns and Pharmacy & Consumer Wellness revenues, expenses and operating results.\nPharmacy & Consumer Wellness Competition\n14\nThe retail pharmacy business is highly competitive. The Company believes that it competes principally on the basis of: (i) store location and convenience, (ii) customer service and satisfaction, (iii) product selection and variety, and (iv) price. In the areas it serves, the Company competes with other drugstore chains (e.g., Walgreens and Rite Aid), supermarkets, discount retailers (e.g., Walmart), independent pharmacies, restrictive pharmacy networks, online retailers (e.g., Amazon), membership clubs, infusion pharmacies, as well as mail order dispensing pharmacies. \nLTC pharmacy services are highly regional or local in nature, and within a given geographic area of operation, highly competitive. The Company’s largest LTC pharmacy competitor nationally is PharMerica. The Company also competes with numerous local and regional institutional pharmacies, pharmacies owned by long-term care facilities and local retail pharmacies. Some states have enacted “freedom of choice” or “any willing provider” requirements as part of their state Medicaid programs or in separate legislation, which may increase the competition that the Company faces in providing services to long-term care facility residents in these states.\nCorporate/Other Segment\nThe Company presents the remainder of its financial results in the Corporate/Other segment, which primarily consists of:\n•\nManagement and administrative expenses to support the Company’s overall operations, which include certain aspects of executive management and the corporate relations, legal, compliance, human resources and finance departments, information technology, digital, data and analytics, as well as acquisition-related transaction and integration costs; and\n•\nProducts for which the Company no longer solicits or accepts new customers such as its large case pensions and long-term care insurance products.\nGeneric Sourcing Venture\nThe Company and Cardinal Health, Inc. (“Cardinal”) each have a 50% ownership in Red Oak Sourcing, LLC (“Red Oak”), a generic pharmaceutical sourcing entity. Under this arrangement, the Company and Cardinal contributed their sourcing and supply chain expertise to Red Oak and agreed to source and negotiate generic pharmaceutical supply contracts for both companies through Red Oak. Red Oak does not own or hold inventory on behalf of either company.\nWorking Capital Practices\nThe Company funds the growth of its businesses through a combination of cash flow from operations, commercial paper and other short-term borrowings, as well as long-term borrowings. For additional information on the Company’s working capital practices, see “Liquidity and Capital Resources” in the MD&A included in Item 7 of this 10-K. Employer groups, individuals, college students, part-time and hourly workers, health plans, providers, governmental units, government-sponsored plans (with the exception of Medicare Part D services, which are described below), labor groups and expatriates, which represent the vast majority of Health Care Benefits segment revenues, typically settle in less than 30 days. As a provider of Medicare Part D services, the Company contracts annually with CMS. Utilization of services each plan year results in the accumulation of either a receivable from or a payable to CMS. The timing of settlement of the receivable or payable with CMS takes several quarters, which impacts working capital from year to year. The majority of the Pharmacy & Consumer Wellness segment non-pharmacy revenues are paid in cash, or with debit or credit cards. Managed care organizations, pharmacy benefit managers, government funded health care programs, commercial employers and other third-party insurance programs, which represent the vast majority of the Company’s consolidated pharmacy revenues, typically settle in less than 30 days. The remainder of the Company’s consolidated pharmacy revenues are paid in cash, or with debit or credit cards. \nHuman Capital\nOverview\nAt CVS Health, we share a single, clear purpose: building a world of health around every consumer. We devote significant time and attention to attract, develop and retain talent who deliver high levels of service to our customers. Our commitment includes a competitive rewards package and programs that support our diverse range of colleagues in rewarding and fulfilling careers. As of December 31, 2024, we employed over 300,000 colleagues primarily in the U.S. including in all 50 states, the District of Columbia and Puerto Rico, approximately 73% of whom were full-time. \nWe believe engaged colleagues produce stronger business results and are more likely to build a career with the Company. Each year we conduct engagement surveys that provide colleagues the opportunity to share opinions and experiences with respect to \n15\ntheir role, their team, and the enterprise to help CVS Health Corporation’s Board of Directors (the “Board”) and our management identify where we can improve colleague experience. These surveys cover a broad range of topics including development and opportunities, recognition, performance, belonging, well-being, compliance, and continuous improvement. In 2024, we conducted engagement surveys in both April and September. More than 150,000 colleagues participated in each survey and overall engagement stayed consistent across surveys.\nThe Board, our Chief Executive Officer (“CEO”) and our Chief People Officer provide oversight of our human capital strategy, which consists of the following categories: workforce strategy; total rewards; and health, safety and environment.\nWorkforce Strategy\nAt CVS Health, our goal is to attract the most talented and qualified workforce in health care and to develop and retain a work force to support and advance our strategic priorities. We believe that our workforce strategy should be responsive to and reflect the broad and diverse communities whose health care needs we serve.\nWe are committed to developing a pipeline of critical skills to power CVS Health for the future. We partner with colleges and universities across many professional fields. For example, the CVS Health PharmD tuition assistance program is available to all eligible CVS Pharmacy interns. In addition, CVS Health is creating transformational solutions to workforce development through dynamic community Workforce Innovation and Talent Centers (WITCs), tailored to the specific needs of each community, incorporating education and skill development, as we help advance future leaders.\nTraining and development provide colleagues the support they need to perform well in their current roles while planning and preparing for future roles and career growth. Our broad training practices include updated, tech-enabled tools and keep our colleagues informed of new developments in our industry that are relevant to their roles. During the year ended December 31, 2024, our colleagues invested approximately 16 million hours in learning and development courses. \nRespect is a cornerstone of our culture, and a centerpiece of our workplace strategy. To do our best when people need us the most means we strive every day to achieve the highest level of trust and respect from our colleagues, our customers, and our communities. Our Heart At Work behaviors are guiding principles for how we lead. We emphasize trust, collaboration, and innovation. Those aspects of our culture show up in our Respect Works Here campaign. \nOur comprehensive and well-executed workforce practices have allowed us to be recognized as a VETSIndexes 3-Star Employer and to earn a 100 percent score on the Disability Equality Index, meaning the Company is recognized as a “Best Place to Work for Disability Inclusion”.\nWe disclose more information on our workforce strategy in our annual Impact Report.\nTotal Rewards\nWe strive to offer a comprehensive and competitive mix of pay and benefits to meet the varying needs of our colleagues and their families. In addition to competitive wages, the comprehensive list of programs and benefits we offer include annual bonuses, stock awards, 401(k) plans including matching company contributions, no cost comprehensive wellness screenings, tobacco cessation and weight management programs, no cost confidential counseling and no cost financial navigation support, an employee stock purchase plan, health care and insurance benefits, paid time off, flexible work schedules, family leave, dependent care resources, colleague assistance programs and tuition assistance, retiree medical access, and discount programs, among many others, depending on eligibility. \nHealth, Safety and Environment\nWe have a strong commitment to providing a safe working environment. We have implemented an environmental health and safety management system to support adherence and monitoring of programs designed to make our various business operations compliant with applicable occupational safety and health regulations and requirements. Our Health, Safety, and Environment Department oversees the implementation and adherence to programs like powered industrial truck training, materials handling and storage, selection of personal protective equipment and fall protection systems. \nWe utilize a Management Information System to track compliance, analyze data and concentrate on key areas of risk to reduce the chance of workplace incidents. We focus on identifying causes and improving performance when workplace incidents occur. We capture colleague observations and feedback through programs like our Behavior Based Safety and our Safety \n16\nHazard and Awareness Reporting Program. We also engage leaders in promoting a culture of safety and measure performance through a comprehensive safety index that leverages both leading and lagging indicators. With safety task forces in place at each distribution center, we empower leaders and safety business partners to identify policies, procedures and processes that could improve their own operations.\nImpact Strategy\nOverview\nOur \nHealthy 2030\n impact strategy outlines how we are creating a more equitable health care system and sustainable future. It reinforces our company’s strategy and is embedded in our purpose-driven culture. \nHealthy 2030\n is constructed through our four-pillar framework – Healthy People, Healthy Business, Healthy Community and Healthy Planet. We are focused on making a meaningful, measurable impact within each of the pillars outlined below. We believe this strategy is achievable without materially adversely affecting our operating results and/or cash flows.\nHealthy People\nWe are building a world of health around every individual. We connect people to the care they need, put medicine and wellness within reach and drive greater affordability, simplicity, and convenience in everything we do. Whether we are increasing access to health care and services or making investments to support our communities to improve health outcomes, we are utilizing our expertise and resources to improve people’s health.\nHealthy Business\nWe are purpose-driven – all of us. We have an opportunity to harness the power of our greatest strength - our talented and diverse workforce of more than 300,000 colleagues - to reimagine health care in America and make health care more affordable, accessible, and simpler. Together, we set high standards and hold ourselves to them. We work daily to create value for everyone who trusts and relies on us and ensure every action we take is done ethically and transparently. We support our colleagues’ education and growth with scholarships, promote and develop leadership skills through training and development courses and continue strengthening our pipeline to our workforce through job training and skill building programs in our communities. We integrate governance and partnership across our business units. \nHealthy Community\nWe are strengthening our communities by addressing the unique barriers to improving health outcomes locally. We support organizations centering their work on heart health, mental health, women’s health, healthy aging and climate-related health impacts. We also invest in the resources needed for communities to take proactive steps toward a healthier future. This includes addressing food insecurity, improving access to workforce training and educational opportunities nationwide. When a natural disaster or other incident affects the communities where we live and work, we swiftly take action to ensure our response addresses our colleagues' and customers' evolving needs. Our colleagues are also making a difference by donating their time and talents with organizations that are meaningful to them. Together, we make a lasting impact by driving a holistic approach and collaboration across these community programs, investments, and organizations. \nHealthy Planet\nWe continue to invest in initiatives and programs that focus on improving the health of our planet by advancing our sustainability commitments and addressing the environmental factors that contribute to poor health and exacerbation of chronic illnesses. We were one of the first companies in the world to have our net-zero targets validated by the Science-Based Targets Initiative’s (SBTi) net-zero methodology. We continue to reduce greenhouse gas emissions and source renewable energy on the path to achieving net-zero emissions across our value chain by 2050. We also drive packaging innovation and efforts to reduce unnecessary plastics and waste across the enterprise.\nIntellectual Property\nThe Company has registered and/or applied to register a variety of trademarks and service marks used throughout its businesses, as well as domain names, and relies on a combination of copyright, patent, trademark and trade secret laws, in addition to contractual restrictions, to establish and protect the Company’s proprietary rights. The Company regards its intellectual property as having significant value in the Health Care Benefits, Health Services and Pharmacy & Consumer \n17\nWellness segments. The Company is not aware of any facts that could materially impact the continuing use of any of its intellectual property.\nGovernment Regulation\nOverview\nThe Company’s operations are subject to comprehensive federal, state and local laws and regulations and comparable multiple levels of international regulation in the jurisdictions in which it does business. There also continues to be a heightened level of review and/or audit by federal, state and international regulators of the health and related benefits industry’s business and reporting practices. In addition, many of the Company’s PBM clients and the Company’s payors in the Pharmacy & Consumer Wellness segment, including insurers, Medicare plans, Managed Medicaid plans and MCOs, are themselves subject to extensive regulations that affect the design and implementation of prescription drug benefit plans that they sponsor. Similarly, the Company’s LTC clients, such as skilled nursing facilities, are subject to government regulations, including many of the same government regulations to which the Company is subject. \nThe federal, state and local laws, regulations and rules and the international laws and regulations governing the Company’s businesses, the contracts they enter into, and interpretations of those laws, regulations and rules continue to change and expand, grow more complex and become more restrictive each year. The application of these complex legal and regulatory requirements to the detailed operation of the Company’s businesses creates areas of uncertainty. Further, there are numerous proposed health care, financial services and other laws and regulations at the federal, state and international levels, some of which could adversely affect the Company’s businesses if they are enacted. The Company cannot predict whether pending or future federal, state or international legislation or court proceedings will change aspects of how it operates in the specific markets in which it competes or the health care industry generally, but if changes occur, the impact of any such changes could have a material adverse impact on the Company’s businesses, operating results, cash flows and/or stock price. Possible regulatory or legislative changes include the federal or one or more state governments fundamentally restructuring the Commercial, Medicare or Medicaid marketplace; reducing payments to the Company in connection with Medicare, Medicaid, dual eligible or special needs programs; increasing its involvement in drug reimbursement, pricing, purchasing, and/or importation; or changing the laws governing PBMs.\nThe Company has internal control policies and procedures and conducts training and compliance programs for its employees to help prevent, detect and correct prohibited practices. However, if the Company’s employees or agents fail to comply with applicable laws governing its operations, it may face investigations, prosecutions and other legal proceedings and actions that could result in civil penalties, administrative remedies and criminal sanctions, and any such action could result in reputational harm. Any failure or alleged failure to comply with applicable laws and regulations summarized below, or any adverse applications or interpretations of, or changes in, the laws and regulations affecting the Company and/or its businesses, could have a material adverse effect on the Company’s operating results, financial condition, cash flows and/or stock price. See Item 1A of this 10-K, “Risk Factors—Risks from Changes in Public Policy and Other Legal and Regulatory Risks,” and Item 3 of this 10-K, “Legal Proceedings,” for further information.\nThe Company can give no assurance that its businesses, financial condition, operating results and/or cash flows will not be materially adversely affected, or that the Company will not be required to materially change its business,  practices or strategy, based on: (i) future enactment of new health care or other laws or regulations; (ii) the interpretation or application of existing laws or regulations, including the laws and regulations described in this Government Regulation section, as they may relate to one or more of the Company’s businesses, one or more of the industries in which the Company competes and/or the health care industry generally; (iii) pending or future federal or state governmental investigations of one or more of the Company’s businesses, one or more of the industries in which the Company competes and/or the health care industry generally; (iv) pending or future government audits, investigations or enforcement actions against the Company; or (v) adverse developments in pending or future legal proceedings against or affecting the Company, including \nqui tam\n lawsuits, or affecting one or more of the industries in which the Company competes and/or the health care industry generally.\nLaws and Regulations Related to Multiple Segments of the Company’s Business\nLaws Related to Reimbursement by Government Programs\n - The Company is subject to various federal and state laws concerning its submission of claims and other information to Medicare, Medicaid and other federal and state government-sponsored health care programs. Potential sanctions for violating these laws include recoupment or reduction of government reimbursement amounts, civil penalties, treble damages, and exclusion from participation in government health care programs. Such laws include the federal False Claims Act (the “False Claims Act”), the federal anti-kickback statute (the “AKS”), state \n18\nfalse claims acts and anti-kickback statutes in most states, the federal “Stark Law” and related state laws. In particular, the False Claims Act prohibits intentionally submitting, conspiring to submit, or causing to be submitted, false claims, records, or statements to the federal government, or intentionally failing to return overpayments, in connection with reimbursement by federal government programs. In addition, any claim for government reimbursement also violates the False Claims Act where it results from a violation of the AKS.\nThe AKS prohibits, among other things, knowingly and willfully offering, paying, soliciting or receiving remuneration, directly or indirectly, in cash or kind, to induce or reward either the referral of an individual for, or the purchase, order or recommendation of, any good or service, for which payment may be made in whole or in part under federal health care programs, such as Medicare and Medicaid. Some court decisions have held that the statute may be violated even if only one purpose of remuneration is to induce referrals. Certain of the Company’s programs involve arrangements with payments intended to influence behavior relative to Medicare and other federal health care program beneficiaries, including risk sharing and “gainsharing” arrangements. While there is no fixed definition of a gainsharing arrangement, the term typically refers to an arrangement in which a share of cost savings for patient care attributable in part to a physician’s efforts are shared with the physician. The Office of the Inspector General of HHS (the “OIG”) has recognized that there are legitimate interests in enlisting physicians in effort to reduce unnecessary costs from the health care system and, if appropriately structured, such gainsharing arrangements should not violate the AKS. Effective in early 2021, CMS and the OIG established new safe harbors that protect certain value-based arrangements, and the Company has integrated its understanding of these safe harbors into its new and existing programs. \nThe Stark Law prohibits a physician who has a financial relationship, or who has an immediate family member who has a financial relationship, with entities providing “designated health services” (“DHS”) from referring Medicare patients to such entities for the furnishing of DHS, unless an exception applies. The Stark Law prohibits any entity providing DHS that has received a prohibited referral from presenting, or causing to be presented, a claim or billing for the services arising out of the prohibited referral. Similarly, the Stark Law prohibits an entity from “furnishing” DHS to another entity with which it has a financial relationship when that entity bills for the service. The prohibition applies regardless of the reasons for the financial relationship and the referral. Unlike the AKS, the Stark Law is a strict liability statute where unlawful intent need not be demonstrated. Although uncertainty exists, some federal agencies and some courts have taken the position that the Stark Law also applies to Medicaid. With respect to certain CMS innovation models in which we may participate, the OIG and CMS jointly issued waivers of the Stark Law. In early 2021, CMS established new exceptions to the Stark Law that protect certain value-based arrangements, and the Company has integrated exceptions into its processes and procedures. Various states have enacted similar laws.\nBoth federal and state false claims laws permit private individuals to file \nqui tam\n or “whistleblower” lawsuits on behalf of the federal or state government. Participants in the health and related benefits industry, including the Company, frequently are subject to actions under the False Claims Act or similar state laws and the Stark Law or similar state laws.\nThe ACA\n - The ACA significantly increased federal and state oversight of health plans. Among other requirements, it specifies minimum medical loss ratios (“MLRs”) for Commercial and Medicare Insured products, specifies features required to be included in commercial benefit designs, limits commercial individual and small group rating and pricing practices, encourages additional competition (including potential incentives for new participants to enter the marketplace), and includes regulations and processes that could delay or limit the Company’s ability to appropriately increase its health plan premium rates. This in turn could adversely affect the Company’s ability to continue to participate in certain product lines and/or geographies that it serves today.\nAlthough the U.S. Supreme Court dismissed a challenge to the constitutionality of the ACA and issued an opinion preserving the ACA and its consumer protections, there may be continued efforts to invalidate, modify, repeal or replace portions of it. In addition to litigation, parts of the ACA continue to evolve through the promulgation of executive orders, legislation, regulations and guidance at the federal or state level. The Company expects the ACA, including potential changes thereto, to continue to significantly impact its business operations and operating results, including pricing, medical benefit ratios (“MBRs”) and the geographies in which the Company’s products are available.\nMedicare Regulation - \nThe Company’s Medicare Advantage, PDP and other Medicare products are highly regulated by CMS. The regulations and contractual requirements applicable to the Company and other private participants in Medicare programs are complex, expensive to comply with and subject to change. Medicare regulations also have the potential to impact products and services used by Medicare beneficiaries, including services provided by Oak Street Health and Signify Health.\n19\nThe provisions of the ACA significantly increased the Company’s exposure to funding and regulation of, and changes in government policy with respect to and/or funding or regulation of, the various Medicare programs in which the Company participates, including changes in the amounts payable to us under those programs and/or new reforms or surcharges on existing programs. For example, the ACA requires minimum MLRs for Medicare Advantage and Medicare Part D plans of 85%. If a Medicare Advantage or Medicare Part D contract pays minimum MLR rebates for three consecutive years, it will become ineligible to enroll new members. If a Medicare Advantage or Medicare Part D contract pays such rebates for five consecutive years, it will be terminated by CMS. It is possible that certain Medicare Advantage contracts may not meet the 85% MLR for consecutive years.\nPayments the Company receives from CMS for its Medicare Advantage and Part D businesses also are subject to risk adjustment based on the health status of the individuals enrolled. Elements of that risk adjustment mechanism continue to be challenged by the U.S. Department of Justice (the “DOJ”), the OIG and CMS itself. For example, CMS made significant changes to the structure of the hierarchical condition category model in version 28, which may impact risk adjustment factor (“RAF”) scores for a larger percentage of Medicare Advantage beneficiaries and could result in changes to beneficiary RAF scores with or without a change in the patient’s health status. CMS continuously evaluates how and where risk adjustment is captured, which from time-to-time has included the capture of diagnosis codes in home visits. A legislative or regulatory change to the ability of Medicare Advantage plans to use home visits as a means to evaluate and diagnosis their members’ health conditions, or substantial changes in the risk adjustment mechanism, including changes that result from enforcement or audit actions, could: materially affect the amount of the Company’s Medicare reimbursement; require the Company to raise prices or reduce the benefits offered to Medicare beneficiaries; impact the services provided by, or the financial performance of, Oak Street Health and Signify Health; and potentially limit the Company’s (and the industry’s) participation in the Medicare program.\nThe Company will continue to offer a wide range of Medicare products across the country to meet the diverse health care needs of its customers, including Individual Medicare Advantage, Group Medicare, Special Needs Plans, Medicare Supplement plans and Prescription Drug Plans.\nAdditionally, there is growing interest among policymakers in re-evaluating how benchmarks are constructed in Medicare Advantage compared to Medicare Fee-For-Service programs, such as MSSP and ACO REACH. Policymakers could pursue various strategies including, among other things, re-evaluating benchmark construction, risk adjustment methodology and alignment in quality measures.\n \nIn addition, the CMS Innovation Center could offer new models or suspend present models that could have a material impact on the success of the Company’s ACO and Oak Street Health businesses. For example, the CMS Innovation Center could mandate or offer participation in certain models that require providers and/or risk-bearing entities to take risk for a geographic population of patients, or it could look to methodologies that infer risk, survey data and non-diagnosis-based data with potential impacts to the Company’s businesses. Uncertainties about  how policymakers and CMS may re-evaluate how benchmarks are constructed in Medicare Advantage, including the future of VBC and mandatory participation, could create new considerations for the Company.\nThe Company has invested significant resources to comply with Medicare standards, and its Medicare compliance efforts will continue to require significant resources. CMS may seek premium and other refunds, prohibit the Company from continuing to market and/or enroll members in or refuse to passively enroll members in one or more of the Company’s Medicare or dual eligible plans, exclude us from participating in one or more Medicare, dual eligible or dual eligible special needs plan programs and/or institute other sanctions and/or civil monetary penalties against the Company if it fails to comply with CMS regulations or its Medicare contractual requirements. The Company’s Medicare Supplement products are regulated at the state level and are subject to similar significant compliance requirements and risks.\nGoing forward, the Company expects CMS, the OIG, the DOJ, other federal agencies and the U.S. Congress to continue to scrutinize closely each component of the Medicare program (including Medicare Advantage, PDPs, dual eligible plans, broker compensation and marketing, prior authorization, and provider network access and adequacy), modify the terms and requirements of the program and possibly seek to recast or limit private insurers’ roles. Any of the federal agencies noted above or U.S. Congress may also recommend changes or take additional action with respect to the way in which brokers and agents are compensated for selling our Medicare Advantage and Part D plans. For example, CMS finalized new requirements imposing limitations on the amounts and types of payments that brokers and agents can earn for marketing and enrollment services with respect to Medicare Advantage and Part D plans. The effectiveness of these requirements is currently subject to an injunction. If the injunction is lifted or CMS attempts to impose restrictions on broker and agent compensation in the future, the Company will be required to comply with the new restrictions.\n20\nIn addition, the Inflation Reduction Act, enacted in August 2022 (the “IRA”) contains changes to the Part D program that took effect in 2023 and will continue to 2032 that has and will shift more of the claim liability to plans and away from the government, including a complete redesign of the Part D standard benefit effective in 2025, which may reduce the Company’s flexibility to design competitive offerings. Given the significant changes, CMS is conducting a voluntary demonstration to test whether additional premium stabilization and revised risk corridors for stand-alone PDPs increase the efficiency and economy of services for Medicare Part D members. The Company has opted to participate in the demonstration, which may be in effect for up to three years.\nIt is also possible that Congress may consider changes to Medicare Advantage payment policies due to recent recommendations by the Medicare Payment Advisory Commission and to reduce the potential added cost burden of costly new benefits, or policies that impact drug pricing such as price controls and inflationary rebates applied to pharmaceutical manufacturers. In addition, states are increasingly requiring companies to offer Medicaid within a state and conducting competitive bid processes to qualify to offer dual eligible products. \nIt is not possible to predict the outcome of such regulatory or Congressional activity, any of which could materially and adversely affect the Company.\nMedicaid Regulation - \nThe Company is seeking to grow its Medicaid, dual eligible and dual eligible special needs plan businesses over the next several years. As a result, the Company is increasing its exposure to changes in government policy with respect to and/or regulation of the various Medicaid, dual eligible and dual eligible special needs plan programs in which the Company participates, including changes in the amounts payable to the Company under those programs.\nIn addition to a quality rating system that applies to Medicaid and Managed Medicaid plans, federal regulations give states the option to choose to establish a minimum MLR of at least 85% for their Managed Medicaid plans, including those offered by the Company. Regardless of whether a state establishes a minimum MLR, it must use plan-reported MLR data to set future payment rates for managed care, so that its plans will “reasonably achieve” an MLR of at least 85%. For Managed Medicaid products, states may use more stringent definitions of “medical loss ratio” or impose other requirements related to minimum MLR. Minimum MLR requirements and similar actions further limit the level of margin the Company can earn in its Insured Medicaid products while leaving the Company exposed to medical costs that are higher than those reflected in its pricing. The Company also may be subject to significant fines, penalties, premium refunds and litigation if it fails to comply with minimum MLR laws and regulations.\nStates may also establish their own standards and use discretion in choosing what determines compliance within Medicaid contracts, including, among other provisions, standards for determining provider network adequacy, staffing, service operations, utilization management, beneficiary care management, provider support, data maintenance and reporting and claims payment. States have flexibility related to rate setting and provider network adequacy that could adversely or positively impact the Company’s Medicaid plans.\nStates continue to consider Medicaid expansion; however, ten states have not yet expanded and may not do so. States may opt out of the elements of the ACA requiring expansion of Medicaid coverage without losing their current federal Medicaid funding. In addition, the election of new Governors and/or state legislatures may impact states’ previous decisions regarding Medicaid expansion. Although Congress enacted incentives for states that had not yet done so to expand Medicaid, this incentive alone has not persuaded holdout states to expand.\nThe economic aspects of the Medicaid, dual eligible and dual eligible special needs plan business vary from state to state and are subject to frequent change. Medicaid premiums are paid by each state and differ from state to state. The federal government and certain states also are considering proposals and legislation for Medicaid and dual eligible program reforms or redesigns, including restrictions on the collection of manufacturer’s rebates on pharmaceuticals by Medicaid MCOs and their contracted PBMs, further program, population and/or geographic expansions of risk-based managed care, increasing beneficiary cost-sharing or payment levels, and changes to benefits, reimbursement, eligibility criteria (and redeterminations of eligibility), provider network adequacy requirements (including requiring the inclusion of specified high cost providers in the Company’s networks) and program structure. In some states, current Medicaid and dual eligible funding and premium revenue may not be adequate for the Company to continue program participation. The Company’s Medicaid and dual eligible contracts with states (or sponsors of Medicaid managed care plans) are subject to cancellation by the state (or the sponsors of the managed care plans) after a short notice period without cause (e.g., when a state discontinues a managed care program) or in the event of insufficient state funding.\n21\nThe Company’s Medicaid, dual eligible and dual eligible special needs plan products also are heavily regulated by CMS and state Medicaid agencies, which have the right to audit the Company’s performance to determine compliance with CMS contracts and regulations. The Company’s Medicaid products, dual eligible products and CHIP contracts also are subject to complex federal and state regulations and oversight by state Medicaid agencies regarding the services provided to Medicaid enrollees, payment for those services, network requirements (including mandatory inclusion of specified high-cost providers), and other aspects of these programs, and by external review organizations which audit Medicaid plans on behalf of state Medicaid agencies. The laws, regulations and contractual requirements applicable to the Company and other participants in Medicaid and dual eligible programs, including requirements that the Company submit encounter data to the applicable state agency, are extensive, complex and subject to change. For example, in April 2024, CMS finalized the Managed Care Rule, which addresses five primary areas: (1) access in managed care, including network adequacy; (2) state directed payments; (3) medical loss ratio standards; (4) in lieu of services and settings and (5) quality and performance assessment. The Company has invested significant resources to comply with these standards, and its Medicaid and dual eligible program compliance efforts will continue to require significant resources. CMS and/or state Medicaid agencies may fine the Company, withhold payments to the Company, seek premium and other refunds, terminate the Company’s existing contracts, elect not to award the Company new contracts or not to renew the Company’s existing contracts, prohibit the Company from continuing to market and/or enroll members in or refuse to automatically assign members to one or more of the Company’s Medicaid or dual eligible products, exclude the Company from participating in one or more Medicaid or dual eligible programs and/or institute other sanctions and/or civil monetary penalties against the Company if it fails to comply with CMS or state regulations or contractual requirements. CMS has proposed requiring that health plans offering certain dual eligible programs must also offer Medicaid programs, which has resulted in the Company refraining from bidding in certain jurisdictions and could impact the Company’s ability to obtain or retain membership in its dual eligible programs.\nThe Company cannot predict whether pending or future federal or state legislation or court proceedings will change various aspects of the Medicaid program, nor can it predict the impact those changes will have on its business operations or operating results, but the effects could be materially adverse.\nMedicare and Medicaid Audits \n- CMS regularly audits the Company’s performance to determine its compliance with CMS’ regulations and its contracts with CMS and to assess the quality of services it provides to Medicare Advantage and PDP beneficiaries. For example, CMS conducts risk adjustment data validation (“RADV”) audits of a subset of Medicare Advantage contracts for each contract year. Since 2011, CMS has selected certain of the Company’s Medicare Advantage contracts for various years for RADV audit, and the number of RADV audits continues to increase. The OIG also is auditing the Company’s risk adjustment data and that of other companies, and the Company expects CMS and the OIG to continue auditing risk adjustment data. The Company also has received Civil Investigative Demands (“CIDs”) from, and provided documents and information to, the Civil Division of the DOJ in connection with investigations of the Company’s identification and/or submission of diagnosis codes related to risk adjustment payments, including patient chart review processes, under Parts C and D of the Medicare program.  \nOn January 30, 2023, CMS released the final rule concerning Part C contract-level Risk Adjustment Data Validation Audits (the “RADV Audit Rule”). The RADV Audit Rule eliminated the application of a fee-for-service adjuster (“FFS Adjuster”) in contract-level RADV audits but continued the use of extrapolation in such audits of Medicare Advantage organizations. The FFS Adjuster that was announced in 2012 was to be used by CMS to determine a permissible level of payment error. By applying the FFS Adjuster, Medicare Advantage organizations would have been liable for repayments only to the extent that their extrapolated payment errors exceeded the error rate in Original Medicare, which could have impacted the extrapolated repayments to which Medicare Advantage organizations are subject. CMS is conducting RADV audits of Medicare Advantage organizations, including the Company’s Medicare Advantage plans, for payment year 2018 and subsequent payment years and may use extrapolation without the application of a FFS Adjuster. The RADV Audit Rule may have potential adverse effects, which could be material, on the Company’s operating results, financial condition, and cash flows. CMS also has announced that it will not conduct RADV audits on all contracts; instead, it will only audit contracts it believes are at the highest risk for overpayments based on its statistical modeling. The RADV Audit Rule is subject to ongoing litigation and the outcome and future impacts are uncertain.\nIn addition, state Medicaid agencies regularly audit, and state Attorneys General regularly investigate, the Company’s performance across all areas of its contractual obligations to the state to determine compliance and quality of services. The Company may be subject to, among other penalties, significant fines, sanctions, corrective actions, and enrollment freezes depending on the findings of these audits and reviews. The Company’s ongoing performance and compliance with program requirements can impact our ability to expand and retain Medicaid business. State Medicaid agencies are also increasingly using the audit process to challenge the legality of PBM practices, such as guaranteed effective rate reconciliations with retail pharmacies and transmission fees.\n22\nMedicare Star Ratings\n - A portion of each Medicare Advantage plan’s reimbursement is tied to the plan’s “star ratings.” The star rating system considers a variety of measures adopted by CMS, including quality of preventative services, chronic illness management, compliance and overall customer satisfaction. Only Medicare Advantage plans with an overall star rating of 4 or more stars (out of 5 stars) are eligible for a quality bonus in their basic premium rates. The Company’s 2024 star ratings were used to determine which of its Medicare Advantage plans have ratings of 4 stars or higher and qualify for bonus payments in 2025. Based on the 2024 ratings, 88% of the Company’s Medicare Advantage members are in 2025 Medicare Advantage plans that are rated 4 stars or higher. Additionally, more than two out of three of the Company’s Medicare Advantage members are in a 4.5-star plan for 2025. CMS also gives PDPs star ratings that affect each PDP’s enrollment. The Company’s PDP plans were rated 3.5 stars for 2025. Medicare Advantage and PDP plans that are rated less than 3 stars for three consecutive years are subject to contract termination by CMS. CMS continues to revise its star ratings system to make it harder to achieve 4 or more stars. There can be no assurances that the Company will be successful in maintaining or improving its star ratings in future years. Accordingly, the Company’s Medicare Advantage plans may not continue to be or become eligible for full level quality bonuses, which could adversely affect the benefits such plans can offer, reduce membership and/or reduce profit margins.\nMedicare Payment Rates\n - In April 2024, CMS issued its final notice detailing final 2025 Medicare Advantage payment rates. Based on CMS’ notice, Medicare Advantage rates resulted in an expected average increase in revenue for the Medicare Advantage industry of 3.70%, which includes a risk score trend increase of 3.86%. Risk scores vary among Medicare Advantage plans depending on the specific population served, so this increase does not represent an actual guaranteed payment increase. Without including the risk score trend increase, the 2025 rates result in an expected average decrease in revenue for the Medicare Advantage industry of 0.16%, though the rates may vary widely depending on the provider group and patient demographics. On January 10, 2025, CMS issued an advance notice detailing proposed 2026 Medicare Advantage payment rates. The 2026 Medicare Advantage rates, if finalized as proposed, will result in an expected average increase in revenue for the Medicare Advantage industry of 4.33%, which includes a risk score trend increase of 2.10%. Without including the risk score trend increase, the advance 2026 rates will result in an expected average increase in revenue for the Medicare Advantage industry of 2.23%, though the rates may vary widely depending on the provider group and patient demographics. CMS intends to publish the final 2026 rate announcement no later than April 7, 2025. \nThe Company faces a challenge from the impact of the increasing cost of medical care (including prescription medications), changes to methodologies for determining payments and CMS local and national coverage decisions that require the Company to pay for services and supplies that are not factored into the Company’s bids.  The federal government may seek to impose restrictions on the configuration of pharmacy or other provider networks for Medicare Advantage and/or PDP plans, or otherwise restrict the ability of these plans to alter benefits, negotiate prices or establish other terms to improve affordability or maintain viability of products. The Company currently believes that the payments it has received and will receive in the near term are adequate to justify the Company’s continued participation in the Medicare Advantage and PDP programs, although there are economic and political pressures to continue to reduce spending on the program, and this outlook could change.\n340B Drug Pricing Program\n – The 340B Drug Pricing Program, which is overseen by the HHS and the Health Resources and Services Administration (“HRSA”), allows eligible Covered Entities to purchase prescription drugs from manufacturers at a steep discount. In 2020, a number of pharmaceutical manufacturers began programs that limited Covered Entities’ participation in the program through contract pharmacies arrangements. In May 2021, HRSA sent enforcement letters to multiple manufacturers to curb these practices. In September 2021, HRSA forwarded the enforcement actions to the OIG for potential imposition of civil monetary penalties. Those enforcement actions are currently subject to ongoing litigation. In addition, several states continue to debate how pharmaceutical manufacturers must distribute and pay rebates to 340B covered entities which is currently subject to ongoing litigation.\nIn November 2022, HRSA issued proposed rules that would overhaul the 340B Drug Pricing Programs administrative dispute resolution process. The revisions are designed to make the process more accessible by making it more expeditious and less formal, as well as more equitable by requiring fewer resources to participate. A reduction in Covered Entities’ participation in contract pharmacy arrangements, as a result of the pending enforcement actions or otherwise, a reduction in the use of the Company’s administrative services by Covered Entities, or a reduction in drug manufacturers’ participation in the program could materially and adversely affect the Company.\nAnti-Remuneration Laws\n - Federal law prohibits, among other things, an entity from knowingly and willfully offering, paying, soliciting or receiving, subject to certain exceptions and “safe harbors,” any remuneration to induce the referral of individuals or the purchase, lease or order of items or services for which payment may be made under Medicare, Medicaid or certain other federal and state health care programs. A number of states have similar laws, some of which are not limited to services paid for with government funds. Sanctions for violating these federal and state anti-remuneration laws may include \n23\nimprisonment, criminal and civil fines, and exclusion from participation in Medicare, Medicaid and other federal and state government-sponsored health care programs. Companies involved in public health care programs such as Medicare and/or Medicaid are required to maintain compliance programs to detect and deter fraud, waste and abuse, and are often the subject of fraud, waste and abuse investigations and audits. The Company has invested significant resources to comply with Medicare and Medicaid program standards. Ongoing vigorous law enforcement and the highly technical regulatory scheme mean that the Company’s compliance efforts in this area will continue to require significant resources.\nAntitrust and Unfair Competition \n- The U.S. Federal Trade Commission (“FTC”) investigates and prosecutes practices that are “unfair trade practices” or “unfair methods of competition.” Numerous lawsuits have been filed throughout the U.S against pharmaceutical manufacturers, retail pharmacies and/or PBMs under various federal and state antitrust and unfair competition laws challenging, among other things: (i) brand name drug pricing and rebate practices of pharmaceutical manufacturers, (ii) the maintenance of retail or specialty pharmacy networks by PBMs, and (iii) various other business practices of PBMs and retail pharmacies. In July 2021, the FTC approved several resolutions that direct agency staff to use compulsory process, such as subpoenas, to investigate seven specific enforcement priorities. Priority targets include, among other businesses, health care businesses, such as pharmaceutical companies, pharmacy benefits managers and hospitals. To the extent that the Company appears to have actual or potential market power in a relevant market or CVS pharmacy, CVS specialty or MinuteClinic plays a unique or expanded role in a Health Care Benefits or Health Services segment product offering, the Company’s business arrangements and uses of confidential information may be subject to heightened scrutiny from an anti-competitive perspective and possible challenge by state and/or federal regulators and/or private parties.\nPrivacy and Confidentiality Requirements\n - Many of the Company’s activities involve the receipt, use and disclosure by the Company of personally identifiable information (“PII”) as permitted in accordance with applicable federal and state privacy and data security laws, which require organizations to provide appropriate privacy and security safeguards for such information. In addition to PII, the Company uses and discloses de-identified data for analytical and other purposes when permitted. Additionally, there are industry standards for handling credit card data known as the Payment Card Industry Data Security Standard, which are a set of requirements designed to help ensure that entities that process, store or transmit credit card information maintain a secure environment. Certain states have incorporated these requirements into state laws or enacted other requirements relating to the use and/or disclosure of PII.\nThe federal Health Insurance Portability and Accountability Act of 1996, as it has been amended from time to time, and the regulations issued thereunder (collectively, “HIPAA”), impose extensive requirements on the way in which health plans, providers, health care clearinghouses (known as “covered entities”) and their business associates use, disclose and safeguard protected health information (“PHI”). Criminal penalties and civil sanctions may be imposed for failing to comply with HIPAA’s privacy and security standards. In 2024, HIPAA was further amended to add additional rules requiring the safeguarding of reproductive health records. The Company is taking appropriate measures to ensure it is in compliance with the obligations created by this new rule. \nIn addition to HIPAA, state laws apply to the extent they are more protective of individual privacy than is HIPAA, including laws that place stricter controls on the release of information relating to specific diseases or conditions, reproductive health records and requirements to notify members of unauthorized release or use of or access to PHI. States also have adopted regulations to implement provisions of the Financial Modernization Act of 1999 (also known as the Gramm-Leach-Bliley Act (“GLBA”)) which generally require insurers, including health insurers, to provide customers with notice regarding how their non-public personal health and financial information is used and the opportunity to “opt out” of certain disclosures before the insurer shares such information with a non-affiliated third party. Like HIPAA, GLBA sets a “floor” standard, allowing states to adopt more stringent requirements governing privacy protection. Complying with additional state requirements requires us to make additional investments beyond those the Company has made to comply with HIPAA and GLBA.\nThere is also a continuing trend of states enacting more comprehensive privacy laws and regulations addressing consumer rights to data access, deletion, protection or transparency, such as the California Consumer Privacy Act (“CCPA”). States also are starting to issue regulations and proposed regulations specifically related to cybersecurity, such as the regulations issued by the New York Department of Financial Services, as well as regulating use of artificial intelligence technologies. Complying with conflicting cybersecurity regulations, which may differ from state to state, requires significant resources. In addition, differing approaches to state privacy, cybersecurity and/or artificial intelligence regulation and varying enforcement philosophies may significantly restrict the Company’s ability to standardize its products and services across state lines. Widely-reported large scale cyberattacks in the U.S. and abroad increase the likelihood that additional data security legislation will be considered by additional states or by the federal government. These legislative and regulatory developments will impact the design and operation of the Company’s businesses, its privacy and security strategy and its web-based and mobile assets.\n24\nFinally, each Public Exchange is required to adhere to privacy and security standards with respect to PII, and to impose privacy and security standards that are at least as protective of PII as those the Public Exchange has implemented for itself or non-Public Exchange entities, which include insurers offering plans through the Public Exchange and their designated downstream entities, including PBMs and other business associates. These standards may differ from, and be more stringent than, HIPAA.\nSee Item 1C of this 10-K, “Cybersecurity,” for more information on the Company’s cybersecurity risk management and governance.\nConsumer Protection Laws\n - The federal government has many consumer protection laws, such as the Federal Trade Commission Act, the Federal Postal Service Act and the Consumer Product Safety Act. Most states also have similar consumer protection laws and a growing number of states regulate subscription programs. In addition, the federal government and most states have adopted laws and/or regulations requiring places of public accommodation, health care services and other goods and services to be accessible to people with disabilities. These consumer protection and accessibility laws and regulations have been the basis for investigations, lawsuits and multistate settlements relating to, among other matters, the marketing of loyalty programs, and health care products and services, pricing accuracy, expired front store products, financial incentives provided by drug manufacturers to pharmacies in connection with therapeutic interchange programs, disclosures related to how personal data is used and protected and the accessibility of goods and services to people with disabilities. As a result of the Company’s direct-to-consumer activities, including mobile and web-based solutions offered to members and to other consumers, the Company also is subject to federal and state regulations applicable to electronic communications and to other general consumer protection laws and regulations. For example, the CCPA became effective in 2020, and additional federal and state regulation of consumer privacy protection may be proposed or enacted in the future. The Company expects these new laws and regulations to impact the design of its products and services and the management and operation of its businesses and to increase its compliance costs.\nTransparency in Coverage Rule\n - In October 2020, the HHS, the U.S. Department of Labor (“DOL”) and the U.S. Internal Revenue Service (“IRS,” and together with the HHS and DOL, the “Tri-Departments”) released a final rule, referred to as the Transparency in Coverage Rule, requiring health insurers to disclose negotiated prices of drugs, medical services, supplies and other covered items. The rule requires group health plans and health insurance issuers in the individual and group markets to disclose cost-sharing information upon request, to a participant, beneficiary, or enrollee and require plans and issuers to publicly disclose in-network provider rates, historical out-of-network allowed amounts and the associated billed charges, and negotiated rates and historical net prices for prescription drugs. Insurers are required to implement a consumer tool and disclose data in a machine readable file. The Transparency in Coverage Rule’s requirements related to prescription drug prices have yet to be implemented, but once implemented, the public disclosure of insurer- or PBM-negotiated price concessions may result in drug manufacturers lowering discounts or rebates, resulting in higher drug costs for patients and impacting the ability of the Company to negotiate drug prices and provide competitive products and services to consumers. In addition, most group health plans and issuers of group or individual health insurance coverage are required to offer an online price comparison tool allowing for personalized pricing information to their participants, beneficiaries, and enrollees, including access by phone, or in paper form, upon request. Cost estimates must be provided in real-time based on cost-sharing information that is accurate at the time of the request.\nThe Consolidated Appropriations Act of 2021 was signed into law in December 2020 and contains further transparency provisions requiring group health plans and health insurance issuers to report, on an annual basis, certain prescription drug costs, overall spending on health services and prescription drugs, and information about premiums and the impact of rebates and other remuneration on premiums and out-of-pocket costs to the Tri-Departments.\nTelemarketing and Other Outbound Contacts\n - Certain federal and state laws, such as the Telephone Consumer Protection Act and the Telemarketing Sales Rule, give the FTC, the Federal Communications Commission and state Attorneys General the ability to regulate, and bring enforcement actions relating to, telemarketing practices and certain automated outbound contacts such as phone calls, texts or emails. Under certain circumstances, these laws provide consumers with a private right of action. Violations of these laws could result in substantial statutory penalties and other sanctions.\nPharmacy and Professional Licensure and Regulation\n - The Company is subject to a variety of intersecting federal and state statutes and regulations that govern the wholesale distribution of drugs; operation of retail, specialty, infusion, LTC and mail order pharmacies; licensure of facilities and professionals, including pharmacists, technicians, nurses and other health care professionals; registration of facilities with the U.S. Drug Enforcement Administration (the “DEA”) and analogous state agencies that regulate controlled substances; packaging, storing, shipping and tracking of pharmaceuticals; repackaging of drug products; labeling, medication guides and other consumer disclosures; interactions with prescribers and health care professionals; compounding of prescription medications; dispensing of controlled and non-controlled substances; counseling of \n25\npatients; transfers of prescriptions; advertisement of prescription products and pharmacy services; security; inventory control; recordkeeping; reporting to Boards of Pharmacy, the U.S. Food and Drug Administration (the “FDA”), the U.S. Consumer Product Safety Commission, the DEA and related state agencies; and other elements of pharmacy practice. Pharmacies are highly regulated and have contact with a wide variety of federal, state and local agencies with various powers to investigate, inspect, audit or solicit information, including Boards of Pharmacy and Nursing, the DEA, the FDA, the DOJ, HHS and others. Many of these agencies have broad enforcement powers, conduct audits on a regular basis, can impose substantial fines and penalties, and may revoke the license, registration or program enrollment of a facility or professional. \nTelehealth Laws - \nStates generally require providers providing professional health care services, whether in person or via telehealth, to a patient residing within the state to be licensed in that state. States have established a variety of licensing and other regulatory requirements around the provision of telehealth services. These requirements vary from state to state. Many states require notification of certain material events be provided to the applicable licensing agency. In addition, there are federal telehealth requirements applicable to Medicare and state program specific requirements applicable to Medicaid. The Company has established systems for ensuring that its providers are appropriately licensed under applicable state law and that their provision of telehealth service to patients with whom we interact occurs in compliance with applicable laws and regulations. Failure to comply with these laws and regulations could result in licensure actions against the providers as well as civil, criminal or administrative penalties against the providers and/or entities engaging the services of the providers.\nState Insurance, HMO and Insurance Holding Company Regulation - \nA number of states regulate affiliated groups of insurers and HMOs such as the Company under holding company statutes. These laws may, among other things, require prior regulatory approval of dividends and material intercompany transfers of assets and transactions between the regulated companies and their affiliates, including their parent holding companies. The Company expects the states in which its insurance and HMO subsidiaries are licensed to continue to expand their regulation of the corporate governance and internal control activities of its insurance companies and HMOs. Changes to state insurance, HMO and/or insurance holding company laws or regulations or changes to the interpretation of those laws or regulations, including due to regulators’ increasing concerns regarding insurance company and/or HMO solvency due, among other things, to past and expected payor insolvencies, could negatively affect the Company’s businesses in various ways, including through increases in solvency fund assessments, requirements that the Company hold greater levels of capital and/or delays in approving dividends from regulated subsidiaries.\nPBM offerings of prescription drug coverage under certain risk arrangements may be subject to laws and regulations in various states. Such laws may require that the party at risk become licensed as an insurer, establish reserves or otherwise demonstrate financial viability. Laws that may apply in such cases include insurance laws and laws governing MCOs and limited prepaid health service plans. In addition, most states require that PBMs become directly registered or licensed with the department of insurance or similar government oversight agency regardless of any arrangements they have with clients. PBM licensure laws may include oversight of certain PBM activities and operations and may include auditing of those activities. \nThe states of domicile of the Company’s regulated subsidiaries have statutory risk-based capital (“RBC”) requirements for health and other insurance companies and HMOs based on the National Association of Insurance Commissioners’ (the “NAIC”) Risk-Based Capital for Insurers Model Act (the “RBC Model Act”). These RBC requirements are intended to assess the capital adequacy of life and health insurers and HMOs, taking into account the risk characteristics of a company’s investments and products. The RBC Model Act sets forth the formula for calculating RBC requirements, which are designed to take into account asset risks, insurance risks, interest rate risks and other relevant risks with respect to an individual company’s business. In general, under these laws, an insurance company or HMO must submit a report of its RBC level to the insurance department or insurance commissioner of its state of domicile for each calendar year. At December 31, 2024, all of the Company’s insurance and HMO subsidiaries were above the RBC level that would require regulatory action.\nFor information regarding restrictions on certain payments of dividends or other distributions by the Company’s HMO and insurance company subsidiaries, see Note 14 ‘‘Shareholders’ Equity’’ included in Item 8 of this 10-K.\nThe holding company laws for the states of domicile of certain of the Company’s subsidiaries also restrict the ability of any person to obtain control of an insurance company or HMO without prior regulatory approval. Under those statutes, without such approval (or an exemption), no person may acquire any voting security of an insurance holding company (such as the Company’s ultimate parent company, CVS Health Corporation) that controls an insurance company or HMO, or merge with such a holding company, if as a result of such transaction such person would control the insurance holding company. Control is generally defined as the direct or indirect power to direct or cause the direction of the management and policies of a person and is presumed to exist if a person directly or indirectly owns or controls 10% or more of the voting securities of another person.\n26\nCertain states have laws that prohibit submitting a false claim or making a false record or statement in order to secure reimbursement from an insurance company. These state laws vary, and violation of them may lead to the imposition of civil or criminal penalties.\nGovernment Agreements and Mandates\n - From time to time, the Company and/or its various affiliates are subject to certain consent decrees, settlement and other agreements, corrective action plans and corporate integrity agreements with various federal, state and local authorities relating to such matters as privacy practices, controlled substances, PDPs, expired products, environmental and safety matters, marketing and advertising practices, PBM, LTC and other pharmacy operations and various other business practices. Certain of these agreements contain ongoing reporting, monitoring and/or other compliance requirements for the Company. Failure to meet the Company’s obligations under these agreements could result in civil or criminal remedies, financial penalties, administrative remedies, and/or exclusion from participation in federal health care programs.\nEnvironmental and Safety Regulation\n - The Company’s businesses are subject to various federal, state and local laws, regulations and other requirements pertaining to protection of the environment, public health and employee safety, including, for example, regulations governing the management of hazardous substances, the cleaning up of contaminated sites, and the maintenance of safe working conditions in the Company’s retail locations, distribution centers and other facilities. Governmental agencies at the federal, state and local levels continue to focus on the retail and health care sectors’ compliance with such laws and regulations, and have at times pursued enforcement activities. Any failure to comply with these regulations could result in fines or other sanctions by government authorities.\nERISA Regulation \n- The Employee Retirement Income Security Act of 1974 (“ERISA”), provides for comprehensive federal regulation of certain employee pension and benefit plans, including private employer and union sponsored health plans and certain other plans that contract with us to provide PBM services. In general, the Company assists plan sponsors in the administration of their health benefit plans, including the prescription drug benefit portion of those plans, in accordance with the plan designs adopted by the plan sponsors. In addition, the Company may have fiduciary duties where it has specifically contracted with a plan sponsor to accept limited fiduciary responsibility, such as for the adjudication of initial prescription drug benefit claims and/or the appeals of denied claims under a plan. In addition to its fiduciary provisions, ERISA imposes civil and criminal liability on service providers to health plans and certain other persons if certain forms of illegal remuneration are made or received. These provisions of ERISA are broadly written and their application to specific business practices is often uncertain.\nSome of the Company’s health and related benefits and large case pensions products and services and related fees also are subject to potential issues raised by judicial interpretations relating to ERISA. Under those interpretations, together with DOL regulations, the Company may have ERISA fiduciary duties with respect to medical members, PBM members and/or certain general account assets held under contracts that are not guaranteed benefit policies. As a result, certain transactions related to those general account assets are subject to conflict of interest and other restrictions, and the Company must provide certain disclosures to policyholders annually. The Company must comply with these restrictions or face substantial penalties. \nPreemption\n - ERISA generally preempts most state and local laws that relate to employee benefit plans, but the extent of the preemption continues to be reviewed by courts, including the U.S. Supreme Court. For example, in December 2020, the U.S. Supreme Court upheld an Arkansas law that, among other things, mandates a particular pricing methodology, establishes an appeals process for a pharmacy when the reimbursement is below the pharmacy’s acquisition cost, permits a pharmacy to reverse and rebill if they cannot procure the drug from its wholesaler at a price equal to or less than the reimbursement rate, prohibits a PBM from reimbursing a pharmacy less than the amount it reimburses an affiliate on a per unit basis, and permits a pharmacy to decline to dispense if the reimbursement is lower than the pharmacy’s acquisition cost. Subsequently, in November 2021, the U.S. Court of Appeals for the Eighth Circuit upheld a North Dakota law that regulates employer-sponsored ERISA health plans and certain PBM practices within Medicare. The U.S. Court of Appeals for the Tenth Circuit overturned a lower district court in Oklahoma and affirmed that the Oklahoma Insurance Department could not enforce a state law against PBMs that contained provisions that alter and limit some of the options that an ERISA plan can use and decided that the Oklahoma law was preempted by ERISA and, in part, by Medicare Part D. The Oklahoma Attorney General has filed a writ of certiorari with the U.S. Supreme Court to have the case heard during the next term.\nOther Legislative Initiatives and Regulatory Initiatives \n- The U.S. federal and state governments, as well as governments in other countries where the Company does business, continue to enact and seriously consider many broad-based legislative and regulatory proposals that have had a material impact on or could materially impact various aspects of the health care and related benefits system and the Company’s businesses, operating results and/or cash flows. For example:\n27\n•\nUnder the Budget Control Act of 2011 and the American Taxpayer Relief Act of 2012 significant, automatic across-the-board budget cuts (known as sequestration) began in March 2013, including Medicare spending cuts of not more than 2% of total program costs per year through 2024. Since then, Congress has extended and modified the Medicare sequester a number of times. The CARES Act temporarily suspended the Medicare sequester and extended mandatory sequestration to 2030. In July 2022, the 2% Medicare sequester resumed. Significant uncertainty remains as to whether and how the U.S. Congress will proceed with actions that create additional federal revenue and/or with entitlement reform. The Company cannot predict future federal Medicare or federal or state Medicaid funding levels or the impact that future federal or state budget actions or entitlement program reform, if it occurs, will have on the Company’s businesses, operations or operating results, but the effects could be materially adverse, particularly on the Company’s Medicare and/or Medicaid revenues, MBRs and operating results.\n•\nThe European Union’s (“EU’s”) General Data Protection Regulation (“GDPR”) began to apply across the EU during 2018.\n•\nOther significant legislative and/or regulatory measures which are or recently have been under consideration include the following:\n•\nIncreasing the corporate tax rate.\n•\nEliminating payment of manufacturer’s rebates on prescription drugs to PBMs, PDPs and Managed Medicaid organizations in connection with federally funded health care programs. \n•\nImposing requirements and restrictions on the design and/or administration of pharmacy benefit plans offered by the Company’s and its clients’ health plans and/or its PBM clients and/or the services the Company provides to those clients, including prohibiting “differential” or “spread” pricing in PBM contracts; restricting or eliminating the use of formularies for prescription drugs; restricting the Company’s ability to require members to obtain drugs through a home delivery or specialty pharmacy; restricting the Company’s ability to place certain specialty or other drugs in the higher cost tiers of its pharmacy formularies; restricting the Company’s ability to make changes to drug formularies and/or clinical programs; limiting or eliminating rebates on pharmaceuticals; requiring the use of up front purchase price discounts on pharmaceuticals in lieu of rebates; restricting the Company’s ability to configure and reimburse its health plan and retail pharmacy provider networks, including use of CVS pharmacy locations; and mandating client use of PBM compensation structures based on flat, fee-for-service or \"bona fide service fee\" arrangements instead of value-based designs or eliminating the use of certain drug pricing methodologies.\n•\nBroader application of state insurance- and PBM-related laws to national and multi-state plans that cover residents of that state.\n•\nIncreasing federal or state government regulation of, or involvement in, the pricing and/or purchasing of drugs, including Glucagon-like peptide 1 (“GLP-1”) drugs.\n•\nRestricting the Company’s ability to limit providers’ participation in its networks and/or remove providers from its networks by imposing network adequacy requirements or otherwise (including in its Medicare and Commercial Health Care Benefits products).\n•\nImposing assessments on (or to be collected by) health plans or health carriers that may or may not be passed through to their customers. These assessments may include assessments for insolvency, the uninsured, uncompensated care, Medicaid funding or defraying health care provider medical malpractice insurance costs.\n•\nMandating coverage by the Company’s and its clients’ health plans for additional conditions and/or specified procedures, drugs or devices (e.g., high cost pharmaceuticals, experimental pharmaceuticals and oral chemotherapy regimens).\n•\nRegulating electronic connectivity.\n•\nMandating or regulating the disclosure of provider fee schedules, manufacturer’s rebates and other data about the Company’s payments to providers and/or payments the Company receives from pharmaceutical manufacturers.\n•\nMandating or regulating disclosure of provider outcome and/or efficiency information.\n•\nPrescribing or limiting members’ financial responsibility for health care or other covered services they utilize, including restricting “surprise” bills by providers and by specifying procedures for resolving “surprise” bills.\n•\nPrescribing payment levels for health care and other covered services rendered to the Company’s members by providers who do not have contracts with the Company.\n•\nAssessing the medical device status of home infusion therapy products and/or solutions, mobile consumer wellness tools and clinical decision support tools, which may require compliance with FDA requirements in relation to some of these products, solutions and/or tools.\n•\nRestricting the ability of employers and/or health plans to establish or impose member financial responsibility.\n•\nProposals to expand benefits under Original Medicare.\n28\n•\nAmending or supplementing ERISA to impose greater requirements on PBMs or the administration of employer-funded benefit plans or limit the scope of current ERISA pre-emption, which would among other things expose the Company and other health plans to expanded liability for punitive and other extra-contractual damages and additional state regulation.\n•\nAmending the Mental Health Parity and Addiction Equity Act to add additional provisions that could significantly increase compliance requirements.\n•\nEliminating enhanced premium tax credits, which could impact consumers ability to choose individual coverage on the Exchange\n.\nIt is uncertain whether the Company can counter the potential adverse effects of such potential legislation or regulation on its operating results or cash flows, including whether it can recoup, through higher premium rates, expanded membership or other measures, the increased costs of mandated coverage or benefits, assessments, fees, taxes or other increased costs, including the cost of modifying its systems to implement any enacted legislation or regulations.\nThe Company’s businesses also may be affected by other legislation and regulations. The Dodd-Frank Wall Street Reform and Consumer Protection Act creates incentives for whistleblowers to speak directly to the government rather than utilizing internal compliance programs and reduces the burden of proof under the Foreign Corrupt Practices Act of 1977 (the “FCPA”). There also are laws and regulations that set standards for the escheatment of funds to states.\nHealth savings accounts, health reimbursement arrangements and flexible spending accounts and certain of the tax, fee and subsidy provisions of the ACA also are regulated by the U.S. Department of the Treasury and the IRS.\nThe Company also may be adversely affected by court and regulatory decisions that expand or revise the interpretations of existing statutes and regulations or impose medical malpractice or bad faith liability. Federal and state courts, including the U.S. Supreme Court, continue to consider cases, and federal and state regulators continue to issue regulations and interpretations, addressing bad faith liability for denial of medical claims, the scope of ERISA’s fiduciary duty requirements, the scope of the False Claims Act and the pre-emptive effect of ERISA and Medicare Part D on state laws.\nContract Audits \n- The Company is subject to audits of many of its contracts, including its PBM client contracts, its PBM rebate contracts, its PBM network contracts, its contracts relating to Medicare Advantage and/or Medicare Part D, the agreements the Company’s pharmacies enter into with other payors, its Medicaid contracts and its customer contracts. Because some of the Company’s contracts are with state or federal governments or with entities contracted with state or federal agencies, audits of these contracts are often regulated by the federal or state agencies responsible for administering federal or state benefits programs, including those which operate Medicaid fee for service plans, Managed Medicaid plans, Medicare Part D plans or Medicare Advantage organizations.\nFederal Employee Health Benefits Program \n- The Company’s subsidiaries contract with the Office of Personnel Management (the “OPM”) to provide managed health care services under the FEHB program in their service areas. These contracts with the OPM and applicable government regulations establish premium rating arrangements for this program. In addition to other requirements, such as the Transparency in Coverage Rule note above, OPM regulations require that community-rated FEHB plans meet a FEHB program-specific minimum MLR by plan code and market. Managing to these rules is complicated by the simultaneous application of the minimum MLR standards and associated premium rebate requirements of the ACA. The Company also has a contractual arrangement with carriers for the FEHB program, such as the BlueCross BlueShield Association, to provide pharmacy services to federal employees, postal workers, annuitants, and their dependents under the Government-wide Service Benefit Plan, as authorized by the FEHB Act and as part of the FEHB program. Additionally, the Company manages certain FEHB plans on a “cost-plus” basis. These arrangements subject the Company to certain aspects of the FEHB Act, and other federal regulations, such as the FEHB Acquisition Regulation, that otherwise would not be applicable to the Company. The OPM also is auditing the Company and its other contractors to, among other things, verify that plans meet their applicable FEHB program-specific MLR and the premiums established under the OPM’s Insured contracts and costs allocated pursuant to the OPM’s cost-based contracts are in compliance with the requirements of the applicable FEHB program. The OPM may seek premium refunds or institute other sanctions against the Company if it fails to comply with the FEHB program requirements.\nClinical Services Regulation \n- The Company provides clinical services to health plans, PBMs and providers for a variety of complex and common medical conditions, including arranging for certain members to participate in disease management programs. State laws regulate the practice of medicine, the practice of pharmacy, the practice of nursing and certain other \n29\nclinical activities. Clinicians engaged in a professional practice in connection with the provision of clinical services must satisfy applicable state licensing requirements and must act within their scope of practice.\nThird Party Administration and Other State Licensure Laws \n- Many states have licensure or registration laws governing certain types of administrative organizations, such as PPOs, TPAs and companies that provide utilization review services. Several states also have licensure or registration laws governing the organizations that provide or administer consumer card programs (also known as cash card or discount card programs).\nInternational Regulation - \nThe Company previously held insurance licenses in several foreign jurisdictions (the United Kingdom, Ireland, Singapore and Hong Kong) but these have been cancelled following the transfer of its insurance business in those jurisdictions to a third party. The Company is also in the process of closing down its remaining insurance operations outside of the Americas.  \nThe Company’s international operations, including its remaining international insurance operations until they are closed down, are subject to different, and sometimes more stringent, legal and regulatory requirements, which vary widely by jurisdiction, including anti-corruption laws; economic sanctions laws; various privacy, insurance, tax, tariff and trade laws and regulations; corporate governance, privacy, data protection (including the EU’s General Data Protection Regulation which began to apply across the EU during 2018), data mining, data transfer, labor and employment, intellectual property, consumer protection and investment laws and regulations; discriminatory licensing procedures; compulsory cessions of reinsurance; required localization of records and funds; higher premium and income taxes; limitations on dividends and repatriation of capital; and requirements for local participation in an insurer’s ownership. In addition, the presence of operations in foreign countries potentially increases the Company’s exposure to the anti-bribery, anti-corruption and anti-money laundering provisions of U.S. law, including the FCPA, and corresponding foreign laws, including the U.K. Bribery Act 2010 (the “UK Bribery Act”). \nAnti-Corruption Laws\n - The FCPA prohibits offering, promising or authorizing others to give anything of value to a foreign government official to obtain or retain business or otherwise secure a business advantage. The Company also is subject to applicable anti-corruption laws of the jurisdictions in which it operates. In many countries outside the U.S., health care professionals are employed by the government. Therefore, the Company’s dealings with them are subject to regulation under the FCPA. Violations of the FCPA and other anti-corruption laws may result in severe criminal and civil sanctions as well as other penalties, and there continues to be a heightened level of FCPA enforcement activity by the SEC and the DOJ. The UK Bribery Act is an anti-corruption law that is broader in scope than the FCPA and applies to all companies with a nexus to the United Kingdom. Disclosures of FCPA violations may be shared with the UK authorities, thus potentially exposing companies to liability and potential penalties in multiple jurisdictions. \nAnti-Money Laundering Regulations\n - Certain lines of the Company’s businesses are subject to Treasury anti-money laundering regulations. Those lines of business have implemented anti-money laundering policies designed to ensure their compliance with the regulations. The Company also is subject to anti-money laundering laws in non-U.S. jurisdictions where it operates. \nOffice of Foreign Assets Control\n - The Company also is subject to regulation by the Office of Foreign Assets Control of the U.S. Department of Treasury (“OFAC”). OFAC administers and enforces economic and trade sanctions based on U.S. foreign policy and national security goals against targeted foreign countries and regimes, terrorists, international narcotics traffickers, those engaged in activities related to the proliferation of weapons of mass destruction, and other threats to the national security, foreign policy or economy of the U.S. In addition, the Company is subject to similar regulations in the non-U.S. jurisdictions in which it operates.\nFDA Regulation - \nThe FDA regulates the Company’s compounding pharmacy and clinical research operations. The FDA also generally has authority to, among other things, regulate the manufacture, distribution, sale and labeling of medical devices (including hemodialysis devices such as the device the Company is developing and mobile medical devices) and many products sold through retail pharmacies, including prescription drugs, over-the-counter medications, cosmetics, dietary supplements and certain food items. In addition, the FDA regulates the Company’s activities as a distributor of store brand products.\n30\nLaws and Regulations Related to the Health Care Benefits Segment\nIn addition to the laws and regulations discussed above that may affect multiple segments of the Company’s business, the Company is subject to federal, state, local and international statutes and regulations, as well as government program contracts, governing its Health Care Benefits segment specifically. \nOverview\n - Differing approaches to state insurance regulation and varying enforcement philosophies may materially and adversely affect the Company’s ability to standardize its Health Care Benefits products and services across state lines. These laws and regulations, including the ACA, restrict how the Company conducts its business and result in additional burdens and costs to the Company. Significant areas of governmental regulation include premium rates and rating methodologies, underwriting rules and procedures, required benefits, sales and marketing activities, provider rates of payment, restrictions on health plans’ ability to limit providers’ participation in their networks and/or remove providers from their networks and financial condition (including reserves and minimum capital or risk based capital requirements). These laws and regulations are different in each jurisdiction and vary from product to product.\nEach health insurer and HMO must file periodic financial and operating reports with the states in which it does business. In addition, health insurers and HMOs are subject to state examination and periodic license renewal. Applicable laws also restrict the ability of the Company’s regulated subsidiaries to pay dividends, and certain dividends require prior regulatory approval. In addition, some of the Company’s businesses and related activities may be subject to PPO, MCO, utilization review or TPA-related licensure requirements and regulations. These licensure requirements and regulations differ from state to state, but may contain provider network, contracting, product and rate, financial and reporting requirements. There also are laws and regulations that set specific standards for the Company’s delivery of services, payment of claims, fraud prevention, protection of consumer health information, and payment for covered benefits and services.\nRequired Regulatory Approvals\n - The Company must obtain and maintain regulatory approvals to price, market and administer many of its Health Care Benefits products. Supervisory agencies, including CMS, the Center for Consumer Information and Insurance Oversight and the DOL, as well as state health, insurance, managed care and Medicaid agencies, have broad authority to take one or more of the following actions:\n•\nGrant, suspend and revoke the Company’s licenses to transact business;\n•\nSuspend or exclude the Company from participation in government programs;\n•\nSuspend or limit the Company’s authority to market products;\n•\nRegulate many aspects of the products and services the Company offers, including the pricing and underwriting of many of its products and services;\n•\nAssess damages, fines and/or penalties;\n•\nTerminate the Company’s contract with the government agency and/or withhold payments from the government agency to the Company;\n•\nImpose retroactive adjustments to premiums and require the Company to pay refunds to the government, customers and/or members;\n•\nRestrict the Company’s ability to conduct acquisitions or dispositions;\n•\nRequire the Company to maintain minimum capital levels in its subsidiaries and monitor its solvency and reserve adequacy;\n•\nRegulate the Company’s investment activities on the basis of quality, diversification and other quantitative criteria; and/or\n•\nExclude the Company’s plans from participating in Public Exchanges if they are deemed to have a history of “unreasonable” premium rate increases or fail to meet other criteria set by HHS or the applicable state.\nThe Company’s operations, current and past business practices, current and past contracts, and accounts and other books and records are subject to routine, regular and special investigations, audits, examinations and reviews by, and from time to time the Company receives subpoenas and other requests for information from, federal, state and international supervisory and enforcement agencies, Attorneys General and other state, federal and international governmental authorities and legislators. \nCommercial Product Pricing and Underwriting Restrictions\n - Pricing and underwriting regulation by states limits the Company’s underwriting and rating practices and those of other health insurers, particularly for small employer groups, and varies by state. In general, these limitations apply to certain customer segments and limit the Company’s ability to set prices for new or renewing groups, or both, based on specific characteristics of the group or the group’s prior claim experience. In some \n31\nstates, these laws and regulations restrict the Company’s ability to price for the risk it assumes and/or reflect reasonable costs in the Company’s pricing.\nThe ACA expanded the premium rate review process by, among other things, requiring the Company’s Commercial Insured rates to be reviewed for “reasonableness” at either the state or the federal level. HHS established a federal premium rate review process that generally applies to proposed premium rate increases equal to or exceeding a federally (or lower state) specified threshold. HHS’s rate review process imposes additional public disclosure requirements as well as additional review on filings requesting premium rate increases equal to or exceeding this “reasonableness” threshold. These combined state and federal review requirements may prevent, further delay or otherwise affect the Company’s ability to price for the risk it assumes, which could adversely affect its MBRs and operating results, particularly during periods of increased utilization of medical services and/or medical cost trend or when such utilization and/or trend exceeds the Company’s projections.\nThe ACA also specifies minimum MLRs of 85% for large group Commercial products and 80% for individual and small group Commercial products. Because the ACA minimum MLRs are structured as “floors” for many of their requirements, states have the latitude to enact more stringent rules governing these restrictions. For Commercial products, states have and may adopt higher minimum MLR requirements, use more stringent definitions of “medical loss ratio,” incorporate minimum MLR requirements into prospective premium rate filings, require prior approval of premium rates or impose other requirements related to minimum MLR. Minimum MLR requirements and similar actions further limit the level of margin the Company can earn in its Insured Commercial products while leaving the Company exposed to medical costs that are higher than those reflected in its pricing. The Company also may be subject to significant fines, penalties, premium refunds and litigation if it fails to comply with minimum MLR laws and regulations. \nIn addition, the Company requested increases in its premium rates in its Commercial Health Care Benefits business for 2025 and expects to request future increases in those rates in order to adequately price for projected medical cost trends, required expansions of coverage and rating limits, and significant assessments, fees and taxes imposed by the federal and state governments, including as a result of the ACA. The Company’s rates also must be adequate to reflect adverse selection in its products, particularly in small group Commercial products. These rate increases may be significant and thus heighten the risks of adverse publicity, adverse regulatory action and adverse selection and the likelihood that the Company’s requested premium rate increases will be denied, reduced or delayed, which could lead to operating margin compression.\nMany of the laws and regulations governing the Company’s pricing and underwriting practices also limit the differentials in premium rates insurers and other carriers may charge between new and renewal business, and/or between groups based on differing characteristics. They may also require that carriers disclose to customers the basis on which the carrier establishes new business and renewal premium rates and limit the ability of a carrier to terminate customers’ coverage. \nFederal and State Reporting \n- The Company is subject to extensive financial and business reporting requirements, including penalties for inaccuracies and/or omissions, at both the federal and state level. The Company’s ability to comply with certain of these requirements depends on receipt of information from third parties that may not be readily available or reliably provided in all instances. The Company is and will continue to be required to modify its information systems, dedicate significant resources and incur significant expenses to comply with these requirements. However, the Company cannot eliminate the risks of unavailability of or errors in its reports.\nProduct Design and Administration and Sales Practices\n - State and/or federal regulatory scrutiny of health care benefit product design and administration and marketing and advertising practices, including the filing of insurance policy forms, the adequacy of provider networks, the accuracy of provider directories, and the adequacy of disclosure regarding products and their administration, is increasing as are the penalties being imposed for inappropriate practices. Medicare, Medicaid and dual eligible products and products offering more limited benefits in particular continue to attract increased regulatory scrutiny.\nGuaranty Fund Assessments/Solvency Protection\n - Under guaranty fund laws existing in all states, insurers doing business in those states can be assessed (in most states up to prescribed limits) for certain obligations of insolvent insurance companies to policyholders and claimants. The life and health insurance guaranty associations in which the Company participates that operate under these laws respond to insolvencies of long-term care insurers as well as health insurers. The Company’s assessments generally are based on a formula relating to the Company’s health care premiums in the state compared to the premiums of other insurers. Certain states allow assessments to be recovered over time as offsets to premium taxes. Some states have similar laws relating to HMOs and/or other payors such as not-for-profit consumer governed health plans established under the ACA. While historically the Company has ultimately recovered more than half of guaranty fund assessments through statutorily permitted premium tax offsets, significant increases in assessments could lead to legislative and/or regulatory actions that limit future offsets.\n32\nLaws and Regulations Related to the Health Services Segment\nIn addition to the laws and regulations discussed above that may affect multiple segments of the Company’s business, the Company is subject to federal, state and local statutes and regulations governing the operation of its Health Services segment specifically. Among these are the following:\nPBM Laws and Regulation \n- Legislation and/or regulations seeking to regulate PBM activities in a comprehensive manner have been proposed or enacted in a majority of states. This legislation could adversely affect the Company’s ability to conduct business on commercially reasonable terms in states where the legislation is in effect and the Company’s ability to standardize its PBM products and services across state lines. In addition, certain quasi-regulatory organizations, including the National Association of Boards of Pharmacy, the NAIC and the National Council of Insurance Legislators, have issued model regulations or may propose future regulations concerning PBMs and/or PBM activities. Similarly, credentialing organizations such as URAC have established voluntary standards regarding PBM, mail order pharmacy and/or specialty pharmacy activities. While the actions of these quasi-regulatory or standard-setting organizations do not have the force of law, they may influence states to adopt their requirements or recommendations and influence client requirements for PBM, mail order pharmacy and/or specialty pharmacy services. Moreover, any standards established by these organizations could also impact the Company’s health plan clients and/or the services provided to those clients and/or the Company’s health plans.\nThe Company’s PBM activities also are regulated directly and indirectly at the federal and state levels, including being subject to the False Claims Act and state false claims acts and the AKS and state anti-kickback laws. These laws and regulations govern, and proposed legislation and regulations may govern and/or further restrict, critical PBM practices, including disclosure, receipt and retention of rebates and other payments received from pharmaceutical manufacturers; use of, administration of and/or changes to drug formularies, maximum allowable cost (“MAC”) list pricing, average wholesale prices (“AWP”) and/or clinical programs; the offering to plan sponsors of pricing that includes retail network “differential” or “spread” (i.e., a difference between the drug price charged to the plan sponsor by a PBM and the price paid by the PBM to the dispensing provider); reconciliation to pricing guarantees; disclosure of data to third parties; drug UM practices; the level of duty a PBM owes its customers; configuration of pharmacy networks; the operations of the Company’s pharmacies (including audits of its pharmacies); disclosure of negotiated provider reimbursement rates; disclosure of fees associated with administrative service agreements and patient care programs that are attributable to members’ drug utilization; and registration or licensing of PBMs. Failure by the Company or one of its PBM services suppliers to comply with these laws or regulations could result in material fines and/or sanctions and could have a material adverse effect on the Company’s operating results and/or cash flows.\nThe Company’s PBM service contracts, including those in which the Company assumes certain risks under performance guarantees or similar arrangements, are generally not subject to insurance regulation by the states. However, state departments of insurance are increasing their oversight of PBM activities due to legislation passing in nearly all states requiring PBMs to register or obtain a license with the department, authorizing agencies to conduct market conduct examinations and other audits of our licensed entities. In addition, rulemaking in a number of states expands the underlying statutory law particularly with respect to the scope of application to pharmacy appeals and reimbursement, transparency reporting, PBM compensation, network design, member cost sharing and pharmacy audits.\nPharmacy Network Access Legislation \n- Medicare Part D and a majority of states now have some form of legislation affecting the Company’s (and its health plans’ and its health plan clients’) ability to limit access to a pharmacy provider network or remove pharmacy network providers. For example, certain “any willing provider” legislation may require the Company or its clients to admit a nonparticipating pharmacy if such pharmacy is willing and able to meet the plan’s price and other applicable terms and conditions for network participation. These laws could negatively affect the services and economic benefits achievable through a limited pharmacy provider network. Several states apply these laws to the administration of plans that are not typically subject to such laws, \ne.g.\n national and multi-state ERISA self-funded plans. Also, a majority of states have some form of legislation affecting the Company’s ability (and the Company’s and its client health plans’ ability) to conduct audits of network pharmacies regarding claims submitted to the Company for payment. These laws could negatively affect the Company’s ability to recover overpayments of claims submitted by network pharmacies that the Company identifies through pharmacy audits. Finally, several states have passed legislation that limits the ability of PBMs and health insurers to provide special benefit structures for use with affiliated pharmacies, which could result in reduced savings to clients and consumers.  \nPharmacy Pricing Legislation\n - Multiple states have passed legislation regulating the Company’s ability to manage pricing practices, including mandated pharmacy reimbursement rates and the collection of transmission fees. A number of states have also established MACs for generic prescription drugs. MAC methodology is a common cost management practice used by \n33\nprivate and public payors (including CMS) to pay pharmacies for dispensing generic prescription drugs. MAC prices specify the allowable reimbursement by a PBM for a particular strength and dosage of a generic drug that is available from multiple manufacturers but sold at different prices. State legislation can regulate the disclosure of MAC prices and MAC price methodologies, the kinds of drugs that a PBM can pay for at a MAC price, and the rights of pharmacies to appeal a MAC price established by a PBM. Some states now require the PBM to reimburse a pharmacy’s actual acquisition cost. These laws could negatively affect the Company’s ability to establish MAC prices for generic drugs. Additionally, some states have passed legislation that would restrict certain types of retroactive reconciliation or recoupment from pharmacies in the network or create a reimbursement benchmark mandate, such as the national average drug acquisition cost and/or the wholesale acquisition cost (“WAC”), plus a set dispensing fee, for pharmacies in the network. \nFormulary and Plan Design Regulation \n- A number of government entities regulate the administration of prescription drug benefits. HHS regulates how Medicare Part D formularies are developed and administered, including requiring the inclusion of all drugs in certain classes and categories, subject to limited exceptions. Under the ACA, CMS imposes drug coverage requirements for health plans required to cover essential health benefits, including plans offered through federal or state Public Exchanges. Additionally, the NAIC and health care accreditation agencies like NCQA and URAC have developed model acts and standards for formulary development that are often incorporated into government requirements. Many states regulate the scope of prescription drug coverage, as well as the delivery channels to receive prescriptions, for insurers, MCOs and Medicaid managed care plans. The increasing government regulation of formularies could significantly affect the Company’s ability to develop and administer formularies, pharmacy networks and other plan design features. Similarly, some states prohibit health plan sponsors from implementing certain restrictive pharmacy benefit plan design features. This regulation could limit or preclude (i) limited networks, (ii) a requirement to use particular providers, (iii) copayment differentials among providers and (iv) formulary tiering practices. \nAccountable Care Organization Regulation\n - An ACO is a network of health care providers and suppliers that work together to invest in infrastructure and redesign delivery processes to attempt to achieve high quality and efficient delivery of services. Promoting accountability and coordination of care, ACOs are an alternative payment model intended to produce savings as a result of improved quality and operational efficiency. The goals of an ACO are assessed using a set of quality measures and spending benchmarks. Medicare-approved ACOs that achieve performance standards established by HHS are eligible to share in a portion of the amounts saved by the Medicare program. There are several types of ACO programs, including the MSSP and ACO REACH models. The CMS Innovation Center can add models at their discretion that have overlap implications for MSSP and ACO REACH. Overlap policies may impact risks and opportunities within the MSSP and ACO REACH models, including but not limited to attribution methodologies, inclusion and exclusion, provider overlap permissions, and model attrition. Models may be updated at any time in ways that make the model less favorable to participants, and HHS has significant discretion to determine key elements of ACO programs. Certain waivers and exceptions are available from fraud and abuse laws for ACOs. Currently, ACO REACH is set to expire at the end of 2026. \nCorporate Practice of Medicine - \nThe Company is subject to various state laws, regulations and legal and administrative decisions that restrict the corporate practice of medicine and fee splitting. The corporate practice of medicine doctrine generally prohibits corporate entities from practicing medicine or employing physicians (and, in some cases, other providers) to provide professional medical services. The doctrine reflects a variety of historical public policy concerns, including concerns that (a) allowing corporations to practice medicine or employ physicians will result in the commercialization of the practice of medicine, (b) a corporation’s obligation to its shareholders may not align with a physician’s obligation to his/her patients and (c) employment of a physician by a corporation may interfere with the physician’s independent medical judgment. While many states have some form of the corporate practice of medicine doctrine, the scope and enforcement varies widely. In those states where the doctrine exists, it typically arises from the state’s medical practice act, but has been shaped over the years by state statutes, regulations, court decisions, attorney general opinions and actions by state medical licensing boards. In addition, some states may have corporate practice restrictions that apply to other providers, such as nurse practitioners and physician assistants.\nHistorically, the medical profession has recognized an ethical prohibition against physicians (and often other providers) paying professional peers and others for referrals and fee splitting. Fee splitting generally occurs when a physician splits part of the professional fee earned from treating a referred patient with the source of the referral. Among the public policy harms that have been cited in support of fee splitting prohibitions are (a) unnecessary medical services, and (b) incompetent specialists. In response to these legitimate concerns, many states have adopted prohibitions against fee splitting. States have taken a variety of legislative approaches to fee splitting, from near complete bans, to bans with various exceptions, to no prohibition at all. Some of the prohibitions, have a broad reach and also prohibit otherwise legitimate business relationships with entities that are not health care providers, such as billing agencies or management companies.\n34\nTable of Contents\nLegal structures have been developed to comply with various state corporate practice of medicine and fee splitting laws. The “captive” or “friendly” professional corporation model allows a legal entity (typically a professional corporation or professional limited liability company) whose shareholders are all physicians to employ the physicians (and other providers). The physician entity then contracts with a corporate entity referred to as a management services organization (“MSO”) to provide various management services. The physician entity is kept “friendly” through a stock transfer restriction agreement and/or other relationship between the MSO and the physician owners of the professional corporation. The fees under the management services arrangement must be carefully structured to comply with state fee splitting laws, which in some states may prohibit percentage-based fees.\nRetail Medical Clinics \n- States regulate retail medical clinics operated by nurse practitioners or physician assistants through physician oversight, clinic and lab licensure requirements and the prohibition of the corporate practice of medicine. A number of states have implemented or proposed laws or regulations that impact certain components of retail medical clinic operations such as physician oversight, signage, third party contracting requirements, bathroom facilities, and scope of services. These laws and regulations may affect the operation and expansion of the Company’s owned and managed retail medical clinics.\nLaws and Regulations Related to the Pharmacy & Consumer Wellness Segment\nIn addition to the laws and regulations discussed above that may affect multiple segments of the Company’s business, the Company is subject to federal, state and local statutes and regulations governing the operation of its Pharmacy & Consumer Wellness segment specifically, including laws and regulations that limit the sale of alcohol, mandate a minimum wage, govern the practices of optometry or audiology, or impact the provision of dietician services and the sale of durable medical equipment, contact lenses, eyeglasses and hearing aids.\nAvailable Information\nCVS Health Corporation was incorporated in Delaware in 1996. The corporate office is located at One CVS Drive, Woonsocket, Rhode Island 02895, telephone (401) 765-1500. CVS Health Corporation’s common stock is listed on the New York Stock Exchange under the trading symbol “CVS.” General information about the Company is available through the Company’s website at \nhttp://www.cvshealth.com\n. The Company’s financial press releases and filings with the SEC are available free of charge within the Investors section of the Company’s website at \nhttp://investors.cvshealth.com\n. In addition, the SEC maintains an internet site that contains reports, proxy and information statements and other information regarding issuers, such as the Company, that file electronically with the SEC. The address of that website is \nhttp://www.sec.gov. \nThe information on or linked to the Company’s website is neither a part of nor incorporated by reference in this 10-K or any of the Company’s other SEC filings. \nIn accordance with guidance provided by the SEC regarding use by a company of its websites and social media channels as a means to disclose material information to investors and to comply with its disclosure obligations under SEC Regulation FD, CVS Health Corporation (the “Registrant”) hereby notifies investors, the media and other interested parties that it intends to continue to use its media and investor relations website (\nhttp://investors.cvshealth.com/\n) to publish important information about the Registrant, including information that may be deemed material to investors. The list of social media channels that the Registrant uses may be updated on its media and investor relations website from time to time. The Registrant encourages investors, the media, and other interested parties to review the information the Registrant posts on its website and social media channels as described above, in addition to information announced by the Registrant through its SEC filings, press releases and public conference calls and webcasts.",
  "item7": "Item 7.  Management’s Discussion and Analysis of Financial Condition and Results of Operations. (“MD&A”)\nThe following discussion and analysis should be read in conjunction with the audited consolidated financial statements and related notes included in Item 8 of this Annual Report on Form 10-K (this “10-K”), “Risk Factors” included in Item 1A of this 10-K and the “Cautionary Statement Concerning Forward-Looking Statements” in this 10-K.\nOverview of Business\nCVS Health Corporation, together with its subsidiaries (collectively, “CVS Health,” the “Company,” “we,” “our” or “us”), is a leading health solutions company building a world of health around every consumer it serves and connecting care so that it works for people wherever they are. As of December 31, 2024, the Company had more than 9,000 retail locations, more than 1,000 walk-in and primary care medical clinics, a leading pharmacy benefits manager with approximately 90 million plan members and expanding specialty pharmacy solutions, and a dedicated senior pharmacy care business serving more than 800,000 patients per year. The Company also serves an estimated more than 36 million people through traditional, voluntary and consumer-directed health insurance products and related services, including expanding Medicare Advantage offerings and a leading standalone Medicare Part D prescription drug plan (“PDP”). The Company is creating new sources of value through its integrated model allowing it to expand into personalized, technology driven care delivery and health services, increasing access to quality care, delivering better health outcomes and lowering overall health care costs.\nThe Company has four reportable segments: Health Care Benefits, Health Services, Pharmacy & Consumer Wellness and Corporate/Other, which are described below.\nOverview of the Health Care Benefits Segment\nThe Health Care Benefits segment operates as one of the nation’s leading diversified health care benefits providers. The Health Care Benefits segment has the information and resources to help members, in consultation with their health care professionals, make more informed decisions about their health care. The Health Care Benefits segment offers a broad range of traditional, voluntary and consumer-directed health insurance products and related services, including medical, pharmacy, dental and behavioral health plans, medical management capabilities, Medicare Advantage and Medicare Supplement plans, PDPs and Medicaid health care management services. The Health Care Benefits segment’s primary customers, its members, primarily access the segment’s products and services through employer groups, government-sponsored plans or individually. The Health Care Benefits segment also serves customers who purchase products and services that are ancillary to its health insurance products. The Company refers to insurance products (where it assumes all or a majority of the risk for medical and dental care costs) as “Insured” and administrative services contract products (where the plan sponsor assumes all or a majority of the risk for medical and dental care costs) as “ASC.” The Company sold Insured plans directly to individual consumers through the individual public health insurance exchanges (“Public Exchanges”) in 17 states as of December 31, 2024. \nOverview of the Health Services Segment\nThe Health Services segment provides a full range of PBM solutions, delivers health care services in its medical clinics, virtually, and in the home, and offers provider enablement solutions. PBM solutions include plan design offerings and administration, formulary management, retail pharmacy network management services, and specialty and mail order pharmacy services. In addition, the Company provides clinical services, disease management services, medical spend management and pharmacy and/or other administrative services for providers and federal 340B drug pricing program covered entities (“Covered Entities”). The Company operates a group purchasing organization that negotiates pricing for the purchase of pharmaceuticals and rebates with pharmaceutical manufacturers on behalf of its participants and provides various administrative, management and reporting services to pharmaceutical manufacturers. During 2023, the Company completed the acquisition of two key health care delivery assets – Signify Health, Inc. (“Signify Health”), a leader in health risk assessments, value-based care and provider enablement services, and Oak Street Health, Inc. (“Oak Street Health”), a leading multi-payor operator of value-based primary care centers serving Medicare eligible patients. The Company also launched Cordavis\nTM\n, a wholly owned subsidiary that works directly with pharmaceutical manufacturers to commercialize and/or co-produce high quality biosimilar products. The Health Services segment’s clients and customers are primarily employers, insurance companies, unions, government employee groups, health plans, PDPs, Medicaid managed care plans, CMS, plans offered on public and private health insurance exchanges and other sponsors of health benefit plans throughout the U.S., patients who receive care in the Health Services segment’s medical clinics, virtually or in the home, as well as Covered Entities.\n70\nOverview of the Pharmacy & Consumer Wellness Segment\nThe Pharmacy & Consumer Wellness segment dispenses prescriptions in its retail pharmacies and through its infusion operations, provides ancillary pharmacy services including pharmacy patient care programs, diagnostic testing and vaccination administration, and sells a wide assortment of health and wellness products and general merchandise. The segment also conducts long-term care pharmacy (“LTC”) operations, which distribute prescription drugs and provide related pharmacy consulting and ancillary services to long-term care facilities and other care settings, and provides pharmacy fulfillment services to support the Health Services segment’s specialty and mail order pharmacy offerings. As of December 31, 2024, the Pharmacy & Consumer Wellness segment operated more than 9,000 retail locations, as well as online retail pharmacy websites, LTC pharmacies and on-site pharmacies, retail specialty pharmacy stores, compounding pharmacies and branches for infusion and enteral nutrition services. \nOverview of the Corporate/Other Segment\nThe Company presents the remainder of its financial results in the Corporate/Other segment, which primarily consists of:\n•\nManagement and administrative expenses to support the Company’s overall operations, which include certain aspects of executive management and the corporate relations, legal, compliance, human resources and finance departments, information technology, digital, data and analytics, as well as acquisition-related transaction and integration costs; and\n•\nProducts for which the Company no longer solicits or accepts new customers such as its large case pensions and long-term care insurance products.\n71\nResults of Operations\nThe following information summarizes the Company’s results of operations for 2024 compared to 2023. \nFor discussion of the Company’s results of operations for 2023 compared to 2022, see “Management’s Discussion and Analysis of Financial Condition and Results of Operations” included in the Company’s Annual Report on Form 10-K for the fiscal year ended December 31, 2023 filed with the U.S. Securities and Exchange Commission (the “SEC”) on February 7, 2024.\nSummary of Consolidated Financial Results\nChange\nYear Ended December 31, \n2024 vs. 2023\n2023 vs. 2022\nIn millions\n2024\n2023\n2022\n$\n%\n$\n%\nRevenues:\nProducts\n$\n231,521 \n$\n245,138 \n$\n226,616 \n$\n(13,617)\n(5.6)\n%\n$\n18,522 \n8.2 \n%\nPremiums\n122,896 \n99,192 \n85,330 \n23,704 \n23.9 \n%\n13,862 \n16.2 \n%\nServices\n16,239 \n12,293 \n9,683 \n3,946 \n32.1 \n%\n2,610 \n27.0 \n%\nNet investment income\n2,153 \n1,153 \n838 \n1,000 \n86.7 \n%\n315 \n37.6 \n%\nTotal revenues\n372,809 \n357,776 \n322,467 \n15,033 \n4.2 \n%\n35,309 \n10.9 \n%\nOperating costs:\nCost of products sold\n206,287 \n217,098 \n196,892 \n(10,811)\n(5.0)\n%\n20,206 \n10.3 \n%\nHealth care costs\n115,121 \n86,247 \n71,073 \n28,874 \n33.5 \n%\n15,174 \n21.3 \n%\nOperating expenses\n41,606 \n39,832 \n38,212 \n1,774 \n4.5 \n%\n1,620 \n4.2 \n%\nRestructuring charges\n1,179 \n507 \n— \n672 \n132.5 \n%\n507 \n100.0 \n%\nOpioid litigation charges\n100 \n— \n5,803 \n100 \n100.0 \n%\n(5,803)\n(100.0)\n%\nLoss on assets held for sale\n— \n349 \n2,533 \n(349)\n(100.0)\n%\n(2,184)\n(86.2)\n%\nTotal operating costs\n364,293 \n344,033 \n314,513 \n20,260 \n5.9 \n%\n29,520 \n9.4 \n%\nOperating income\n8,516 \n13,743 \n7,954 \n(5,227)\n(38.0)\n%\n5,789 \n72.8 \n%\nInterest expense\n2,958 \n2,658 \n2,287 \n300 \n11.3 \n%\n371 \n16.2 \n%\nGain on early extinguishment of debt\n(491)\n— \n— \n(491)\n(100.0)\n%\n— \n— \n%\nOther income\n(99)\n(88)\n(169)\n(11)\n(12.5)\n%\n81 \n47.9 \n%\nIncome before income tax provision\n6,148 \n11,173 \n5,836 \n(5,025)\n(45.0)\n%\n5,337 \n91.4 \n%\nIncome tax provision\n1,562 \n2,805 \n1,509 \n(1,243)\n(44.3)\n%\n1,296 \n85.9 \n%\nNet income\n4,586 \n8,368 \n4,327 \n(3,782)\n(45.2)\n%\n4,041 \n93.4 \n%\nNet (income) loss attributable to noncontrolling interests\n28 \n(24)\n(16)\n52 \n216.7 \n%\n(8)\n(50.0)\n%\nNet income attributable to CVS Health\n$\n4,614 \n$\n8,344 \n$\n4,311 \n$\n(3,730)\n(44.7)\n%\n$\n4,033 \n93.6 \n%\nCommentary - 2024 compared to 2023\nRevenues\n•\nTotal revenues increased $15.0 billion, or 4.2%, in 2024 compared to 2023. The increase in total revenues was driven by growth in the Health Care Benefits and Pharmacy & Consumer Wellness segments, partially offset by a decline in the Health Services segment.\n•\nPlease see “Segment Analysis” later in this MD&A for additional information about the revenues of the Company’s segments.\nOperating expenses\n•\nOperating expenses increased $1.8 billion, or 4.5%, in 2024 compared to 2023. The increase in operating expenses was primarily due to increased operating expenses to support growth in the business.\n•\nPlease see “Segment Analysis” later in this MD&A for additional information about the operating expenses of the Company’s segments.\n72\nOperating income \n•\nOperating income decreased $5.2 billion, or 38.0%, in 2024 compared to 2023. The decrease in operating income was primarily driven by a decrease in adjusted operating income, which is primarily the result of elevated Medicare utilization in the Health Care Benefits segment, and an increase in restructuring charges compared to 2023. These decreases in operating income were partially offset by an increase in net realized capital gains, the absence of a $349 million loss on assets held for sale related to the write-down of the Company’s Omnicare\n®\n long-term care business recorded in the prior year, as well as lower acquisition-related transaction and integration costs. \n•\nPlease see “Segment Analysis” later in this MD&A for additional information about the operating results of the Company’s segments.\nInterest expense\n•\nInterest expense increased $300 million, or 11.3%, in 2024 compared to 2023, due to higher debt in the year ended December 31, 2024 primarily as a result of long-term debt issuances in 2024. See “Liquidity and Capital Resources” later in this report for additional information.\nGain on early extinguishment of debt\n•\nDuring 2024, the gain on early extinguishment of debt relates to the Company’s repayment of $2.6 billion of its outstanding senior notes pursuant to its tender offers for such senior notes in December 2024, which resulted in a gain on early extinguishment of debt of $491 million. See Note 10 ‘‘Borrowings and Credit Agreements’’ included in Item 8 of this 10-K for additional information.\nIncome tax provision\n•\nThe Company’s effective income tax rate increased to 25.4% in 2024 compared to 25.1% in the prior year. The increase was primarily due to the mix of pre-tax income and certain non-deductible expenses, partially offset by basis differences on the disposition of certain investments and utilization of tax credits in the year ended December 31, 2024 compared to the prior year.\n73\n2025 Outlook\nThe Company believes you should consider the following key business and regulatory trends and uncertainties:\nKey Business Trends and Uncertainties\n•\nThe Company expects medical membership declines in its Medicare and individual exchange products. Medical membership disruptions may result in volatility in the Company’s financial results. \n•\nUtilization persisted at elevated levels through the fourth quarter of 2024. Although the level of utilization is difficult to accurately predict, at this time, the Company expects that continued elevated utilization will pressure its Health Care Benefits segment and its health care delivery assets in its Health Services segment into 2025. \n•\nIncreases in utilization beyond the Company’s projections may also result in the Company having to record premium deficiency reserves within in the Health Care Benefits segment during 2025.\n•\nThe Company’s Medicaid business is experiencing medical cost pressures, largely driven by higher than expected acuity following the resumption of member redeterminations. While the Company continues to work closely with its state partners to ensure the underlying trends are reflected in its premium rates going forward, it is uncertain when these pressures will be fully offset by state rate updates.\n•\nThe Company’s individual exchange business is subject to a risk adjustment program whereby the Company estimates its ultimate risk adjustment receivable or payable based on the risk of its qualified plan members relative to the average risk of members of other qualified plans in comparable markets. Changes in the Company’s risk relative to the markets’ risk, including changes resulting from volatility in membership, could adversely impact the Company’s estimate of its risk adjustment receivable or payable.\n•\nThe Company continues to share with clients a larger portion of rebates, fees and/or discounts received from pharmaceutical manufacturers. In addition, marketplace dynamics and regulatory changes have limited the Company’s ability to offer plan sponsors pricing that includes retail network “differential” or “spread.” The Company expects these trends to continue.\n•\nGlucagon-like peptide 1 (“GLP-1”) supply disruptions, and the associated impact on product mix, could pressure the Company’s ability to deliver savings to clients and could impact the Company’s results.\n•\nRegulatory changes or consumer sentiment shift for immunizations may negatively impact national demand impacting financial results.\n•\nImplementation of new tariffs create exposure for increased costs and supply chain disruptions that can adversely impact consumer demand or financial results.\n•\nConsumer spend management and a decline in consumer discretionary spending, as well as a shift to value, grocery and digital retailers, could drive lower front store sales.\n•\nFuture financial performance will be influenced by a number of factors including competitive demand for products and services, legislative and regulatory considerations, and labor and other market dynamics, including inflation. The Company evaluates and adjusts its approach in each of the markets it serves, considering all relevant factors.\n•\nThe Company expects benefits from ongoing enterprise-wide cost savings initiatives and investments in efficiencies, which aim to reduce the Company’s operating cost structure in a way that improves the consumer experience and is sustainable. During the third quarter of 2024, the Company finalized an enterprise-wide restructuring plan intended to streamline and simplify the organization, improve efficiency and generate expected cost savings of over $500 million in 2025. Refer to Note 3 ‘‘Restructuring’’ for actions implemented under the plan.\n•\nChanges in conditions in the U.S. and global capital markets can significantly and adversely affect interest rates and capital market conditions which could result in increased financing costs.\n•\nActions taken by ratings agencies, including changes in the Company’s debt ratings, could impact the Company’s future borrowing costs, access to capital markets and new store operating lease costs.\nKey Regulatory Trends and Uncertainties\n•\nThe Company is exposed to funding and regulation of, and changes in government policy with respect to and/or funding or regulation of, the various Medicare programs in which the Company participates, including changes in the amounts payable to us under those programs and/or new reforms or surcharges on existing programs, including changes to applicable risk adjustment mechanisms.\n•\nLegislation and/or regulations seeking to regulate PBM activities in a comprehensive manner have been proposed or enacted in a majority of states and on the federal level. This legislative and regulatory activity could adversely affect \n74\nthe Company’s ability to conduct business on commercially reasonable terms and the Company’s ability to standardize its PBM products and services across state lines.\nFor additional information regarding these and other trends and uncertainties, see Item 1A, “Risk Factors” and Part I, Item 1 “Business - Government Regulation.”\n75\nSegment Analysis\nThe following discussion of segment operating results is presented based on the Company’s reportable segments in accordance with the accounting guidance for segment reporting and is consistent with the segment disclosure in Note 19 ‘‘Segment Reporting’’ included in Item 8 of this 10-K.\nThe Company has four reportable segments: Health Care Benefits, Health Services, Pharmacy & Consumer Wellness and Corporate/Other. The Company’s segments maintain separate financial information, and the Chief Operating Decision Maker (“the CODM”) evaluates the segments’ operating results on a regular basis in deciding how to allocate resources among the segments and in assessing segment performance. The Company’s CODM is the Chief Executive Officer. The CODM evaluates the performance of the Company’s segments based on adjusted operating income (loss). Adjusted operating income is defined as operating income as measured by accounting principles generally accepted in the United States of America (“GAAP”) excluding the impact of amortization of intangible assets, net realized capital gains or losses and other items, if any, that neither relate to the ordinary course of the Company’s business nor reflect the Company’s underlying business performance. See the reconciliations of operating income (loss) (GAAP measure) to adjusted operating income (loss) below for further context regarding the items excluded from operating income in determining adjusted operating income. The CODM uses adjusted operating income as its principal measure of segment performance as it enhances the CODM’s ability to compare past financial performance with current performance and analyze underlying business performance and trends. Non-GAAP financial measures the Company discloses, such as consolidated adjusted operating income, should not be considered a substitute for, or superior to, financial measures determined or calculated in accordance with GAAP.\nThe following is a reconciliation of financial measures of the Company’s segments to the consolidated totals:\nIn millions\nHealth Care\nBenefits\nHealth\nServices \n(1)\nPharmacy &\n Consumer\n Wellness\nCorporate/\nOther\nIntersegment\nEliminations \n(2)\nConsolidated\nTotals\n2024\nTotal revenues\n$\n130,665 \n$\n173,605 \n$\n124,500 \n$\n451 \n$\n(56,412)\n$\n372,809 \nAdjusted operating income (loss)\n307 \n7,243 \n5,774 \n(1,348)\n— \n11,976 \n2023\nTotal revenues\n$\n105,646 \n$\n186,843 \n$\n116,763 \n$\n451 \n$\n(51,927)\n$\n357,776 \nAdjusted operating income (loss)\n5,577 \n7,312 \n5,963 \n(1,318)\n— \n17,534 \n2022\nTotal revenues\n$\n91,350 \n$\n169,576 \n$\n108,596 \n$\n530 \n$\n(47,585)\n$\n322,467 \nAdjusted operating income (loss)\n6,338 \n6,781 \n6,531 \n(1,613)\n— \n18,037 \n_____________________________________________\n(1)\nTotal revenues of the Health Services segment include approximately $11.4 billion, $13.7 billion and $12.6 billion of retail co-payments for 2024, 2023 and 2022, respectively. See Note 1 ‘‘Significant Accounting Policies’’ included in Item 8 of this 10-K for additional information about retail co-payments.\n(2)\nIntersegment revenue eliminations relate to intersegment revenue generating activities that occur between the Health Care Benefits segment, the Health Services segment, and/or the Pharmacy & Consumer Wellness segment.\n76\nThe following are reconciliations of consolidated operating income (loss) (GAAP measure) to consolidated adjusted operating income (loss), as well as reconciliations of segment GAAP operating income (loss) to segment adjusted operating income (loss):\nYear Ended December 31, 2024\nIn millions\nHealth Care\nBenefits\nHealth\nServices\nPharmacy &\nConsumer\nWellness\nCorporate/\nOther\nConsolidated\nTotals\nOperating income (loss) (GAAP measure)\n$\n(984)\n$\n6,937 \n$\n4,770 \n$\n(2,207)\n$\n8,516 \nAmortization of intangible assets \n(1)\n1,175 \n595 \n253 \n2 \n2,025 \nNet realized capital (gains) losses \n(2)\n97 \n(289)\n— \n75 \n(117)\nAcquisition-related integration costs \n(3)\n— \n— \n— \n243 \n243 \nRestructuring charges \n(4)\n— \n— \n747 \n432 \n1,179 \nOffice real estate optimization charges \n(5)\n19 \n— \n4 \n7 \n30 \nOpioid litigation charges \n(6)\n— \n— \n— \n100 \n100 \nAdjusted operating income (loss)\n$\n307 \n$\n7,243 \n$\n5,774 \n$\n(1,348)\n$\n11,976 \nYear Ended December 31, 2023\nIn millions\nHealth Care\nBenefits\nHealth\nServices\nPharmacy &\nConsumer\nWellness\nCorporate/\nOther\nConsolidated\nTotals\nOperating income (loss) (GAAP measure)\n$\n3,949 \n$\n6,842 \n$\n5,349 \n$\n(2,397)\n$\n13,743 \nAmortization of intangible assets \n(1)\n1,177 \n465 \n260 \n3 \n1,905 \nNet realized capital losses \n(2)\n402 \n— \n5 \n90 \n497 \nAcquisition-related transaction and integration costs \n(3)\n— \n— \n— \n487 \n487 \nRestructuring charges \n(4)\n— \n— \n— \n507 \n507 \nOffice real estate optimization charges \n(5)\n49 \n5 \n— \n(8)\n46 \nLoss on assets held for sale \n(7)\n— \n— \n349 \n— \n349 \nAdjusted operating income (loss)\n$\n5,577 \n$\n7,312 \n$\n5,963 \n$\n(1,318)\n$\n17,534 \nYear Ended December 31, 2022\nIn millions\nHealth Care\nBenefits\nHealth\nServices\nPharmacy &\nConsumer\nWellness\nCorporate/\nOther\nConsolidated\nTotals\nOperating income (loss) (GAAP measure)\n$\n5,270 \n$\n6,612 \n$\n3,560 \n$\n(7,488)\n$\n7,954 \nAmortization of intangible assets \n(1)\n1,180 \n167 \n435 \n3 \n1,785 \nNet realized capital losses \n(2)\n225 \n— \n44 \n51 \n320 \nOffice real estate optimization charges \n(5)\n97 \n2 \n— \n18 \n117 \nOpioid litigation charges \n(6)\n— \n— \n— \n5,803 \n5,803 \nLoss on assets held for sale \n(7)\n41 \n— \n2,492 \n— \n2,533 \nGain on divestiture of subsidiaries \n(8)\n(475)\n— \n— \n— \n(475)\nAdjusted operating income (loss)\n$\n6,338 \n$\n6,781 \n$\n6,531 \n$\n(1,613)\n$\n18,037 \n_____________________________________________\n(1)\nThe Company’s acquisition activities have resulted in the recognition of intangible assets as required under the acquisition method of accounting which consist primarily of trademarks, customer contracts/relationships, covenants not to compete, technology, provider networks and value of business acquired. Definite-lived intangible assets are amortized over their estimated useful lives and are tested for impairment when events indicate that the carrying value may not be recoverable. The amortization of intangible assets is reflected in operating expenses within each segment. Although intangible assets contribute to the Company’s revenue generation, the amortization of intangible assets does not directly relate to the underwriting of the Company’s insurance products, the services performed for the Company’s customers or the sale of the Company’s products or services. Additionally, intangible asset amortization expense typically fluctuates based on the size and timing of the Company’s acquisition activity. Accordingly, the Company believes excluding the amortization of intangible assets enhances the Company’s and investors’ ability to compare the Company’s past financial performance with its current performance and to analyze underlying business performance and trends. Intangible asset amortization excluded from the related non-GAAP financial measure represents the entire amount recorded within the Company’s GAAP financial statements, and the revenue generated by the associated intangible assets has not been excluded from the related non-GAAP financial measure. Intangible asset amortization is excluded from the related non-\n77\nGAAP financial measure because the amortization, unlike the related revenue, is not affected by operations of any particular period unless an intangible asset becomes impaired or the estimated useful life of an intangible asset is revised. \n(2)\nThe Company’s net realized capital gains and losses arise from various types of transactions, primarily in the course of managing a portfolio of assets that support the payment of insurance liabilities. Net realized capital gains and losses are reflected in net investment income (loss) within each segment. These capital gains and losses are the result of investment decisions, market conditions and other economic developments that are unrelated to the performance of the Company’s business, and the amount and timing of these capital gains and losses do not directly relate to the underwriting of the Company’s insurance products, the services performed for the Company’s customers or the sale of the Company’s products or services. Accordingly, the Company believes excluding net realized capital gains and losses enhances the Company’s and investors’ ability to compare the Company’s past financial performance with its current performance and to analyze underlying business performance and trends.\n(3)\nIn 2024, the acquisition-related integration costs relate to the acquisitions of Signify Health and Oak Street Health. In 2023, the acquisition-related transaction and integration costs relate to the acquisitions of Signify Health and Oak Street Health. The acquisition-related transaction and integration costs are reflected in operating expenses within the Corporate/Other segment.\n(4)\nIn 2024, the restructuring charges are primarily comprised of a store impairment charge, corporate workforce optimization costs, including severance and employee-related costs, other asset impairment and related charges associated with the discontinuation of certain non-core assets, and a stock-based compensation charge. During the third quarter of 2024, the Company finalized an enterprise-wide restructuring plan intended to streamline and simplify the organization, improve efficiency and reduce costs. In connection with this restructuring plan, the Company completed a strategic review of its retail business and determined that it plans to close 271 retail stores in 2025, and, accordingly, it recorded a store impairment charge to write down the associated operating or financing lease right-of-use assets and property and equipment. In addition, during the third quarter of 2024, the Company also conducted a review of its various strategic assets and determined that it would discontinue the use of certain non-core assets, at which time impairment losses were recorded to write down the carrying value of these assets to the Company’s best estimate of their fair value. In 2023, the restructuring charges are primarily comprised of severance and employee-related costs, asset impairment charges and a stock-based compensation charge. The restructuring charges associated with the store impairments are reflected within the Pharmacy & Consumer Wellness segment, other asset impairments and related charges are reflected within the Corporate/Other and Pharmacy & Consumer Wellness segments and corporate workforce optimization costs, including severance and employee-related costs, as well as stock-based compensation changes, are reflected within the Corporate/Other segment.\n(5)\nIn 2024, 2023 and 2022, the office real estate optimization charges primarily relate to the abandonment of leased real estate and the related right-of-use assets and property and equipment in connection with the Company’s evaluation of corporate office real estate space in response to its ongoing flexible work arrangement. The office real estate optimization charges are reflected in operating expenses within each segment. \n(6)\nIn 2024, the opioid litigation charge relates to a change in the Company’s accrual related to ongoing opioid litigation matters. In 2022, the opioid litigation charges relate to agreements to resolve substantially all opioid claims against the Company by certain states and governmental entities. The opioid litigation charges are reflected within the Corporate/Other segment.\n(7)\nIn 2023 and 2022, the loss on assets held for sale relates to the LTC business within the Pharmacy & Consumer Wellness segment. During 2022, the Company determined that its LTC business was no longer a strategic asset and committed to a plan to sell it, at which time the LTC business met the criteria for held-for-sale accounting and its net assets were accounted for as assets held for sale. The carrying value of the LTC business was determined to be greater than its estimated fair value less costs to sell and, accordingly, the Company recorded a loss on assets held for sale during 2022. During the first quarter of 2023, a loss on assets held for sale was recorded to write down the carrying value of the LTC business to the Company’s best estimate of the ultimate selling price which reflected its estimated fair value less costs to sell. As of the third quarter of 2023, the Company determined the LTC business no longer met the criteria for held-for-sale accounting and, accordingly, the net assets associated with the LTC business were reclassified to held and used at their respective fair values. During 2022, the loss on assets held for sale also relates to the Company’s international health care business domiciled in Thailand (“Thailand business”), which was included in the Commercial Business reporting unit in the Health Care Benefits segment. The sale of the Thailand business closed in the second quarter of 2022, and the ultimate loss on the sale was not material.\n(8)\nIn 2022, the gain on divestiture of subsidiaries represents the pre-tax gain on the sale of bswift, which the Company sold in November 2022, and the pre-tax gain on the sale of PayFlex, which the Company sold in June 2022. The gains on divestitures are reflected as a reduction of operating expenses within the Health Care Benefits segment. \n78\nHealth Care Benefits Segment \nThe following table summarizes the Health Care Benefits segment’s performance for the respective periods:\nChange\nYear Ended December 31,\n2024 vs. 2023\n2023 vs. 2022\nIn millions, except percentages and basis points (“bps”)\n2024\n2023\n2022\n$\n%\n$\n%\nRevenues:\nPremiums\n$\n122,849\n$\n99,144\n$\n85,274\n$\n23,705 \n23.9 \n%\n$\n13,870 \n16.3 \n%\nServices\n6,343\n5,737\n5,600\n606 \n10.6 \n%\n137 \n2.4 \n%\nNet investment income\n1,473\n765\n476\n708 \n92.5 \n%\n289 \n60.7 \n%\nTotal revenues\n130,665\n105,646\n91,350\n25,019 \n23.7 \n%\n14,296 \n15.6 \n%\nHealth care costs\n113,659\n85,504\n71,473\n28,155 \n32.9 \n%\n14,031 \n19.6 \n%\nMBR (Health care costs as a % of premium revenues)\n \n92.5 \n%\n86.2 \n%\n83.8%\n630\nbps\n240\nbps\nOperating expenses\n$\n17,990\n$\n16,193\n$\n14,566\n$\n1,797 \n11.1 \n%\n$\n1,627 \n11.2 \n%\nOperating expenses as a % of total revenues\n13.8 \n%\n15.3 \n%\n15.9 \n%\nLoss on assets held for sale \n$\n— \n$\n— \n$\n41 \n$\n— \n— \n%\n$\n(41)\n(100.0)\n%\nOperating income (loss)\n(984)\n3,949\n5,270\n(4,933)\n(124.9)\n%\n(1,321)\n(25.1)\n%\nOperating income (loss) as a % of total revenues\n(0.8)\n%\n3.7 \n%\n5.8 \n%\nAdjusted operating income \n(1)\n$\n307\n$\n5,577\n$\n6,338\n$\n(5,270)\n(94.5)\n%\n$\n(761)\n(12.0)\n%\nAdjusted operating income as a % of total revenues\n0.2 \n%\n5.3 \n%\n6.9 \n%\nPremium revenues (by business):\nGovernment\n$\n88,433\n$\n70,094\n$\n63,141\n$\n18,339\n26.2 \n%\n$\n6,953\n11.0 \n%\nCommercial\n34,416\n29,050\n22,133\n5,366\n18.5 \n%\n6,917\n31.3 \n%\n_____________________________________________\n(1)\nSee “Segment Analysis” above in this MD&A for a reconciliation of operating income (loss) (GAAP measure) to adjusted operating income for the Health Care Benefits segment, which represents the Company’s principal measure of segment performance.\nCommentary - 2024 compared to 2023\nRevenues\n \n•\nTotal revenues increased $25.0 billion, or 23.7%, in 2024 compared to 2023, primarily driven by growth in the Medicare and individual exchange product lines.\nMedical Benefit Ratio\n•\nMedical benefit ratio is calculated as health care costs divided by premium revenues and represents the percentage of premium revenues spent on medical benefits for the Company’s Insured members. Management uses MBR to assess the underlying business performance and underwriting of its insurance products, understand variances between actual results and expected results and identify trends in period-over-period results. MBR provides management and investors with information useful in assessing the operating results of the Company’s Insured Health Care Benefits products.\n•\nThe MBR increased from 86.2% to 92.5% in 2024 compared to the prior year primarily driven by increased utilization, the unfavorable impact of the Company’s Medicare Advantage star ratings for the 2024 payment year and higher acuity in Medicaid following the resumption of redeterminations.\nOperating expenses\n•\nOperating expenses in the Health Care Benefits segment include selling, general and administrative expenses and depreciation and amortization expenses.\n•\nOperating expenses increased $1.8 billion, or 11.1%, in 2024 compared to 2023. The increase in operating expenses was primarily driven by increased operating expenses to support the growth across the business. Operating expenses as a percentage of total revenues decreased to 13.8% in the year ended December 31, 2024 compared to 15.3% in the prior year, reflecting improved fixed cost leverage across the business due to membership growth.\n79\nAdjusted operating income\n•\nAdjusted operating income decreased $5.3 billion, or 94.5%, in 2024 compared to 2023. The decrease in adjusted operating income was primarily driven by increased utilization, the unfavorable impact of the Company’s Medicare Advantage star ratings for the 2024 payment year and higher acuity in Medicaid. These decreases were partially offset by an increase in net investment income and improved fixed cost leverage across the business due to membership growth.\nThe following table summarizes the Health Care Benefits segment’s medical membership as of December 31, 2024 and 2023:\n2024\n2023\nIn thousands\nInsured\nASC\n \nTotal\nInsured\nASC\nTotal\nMedical membership:\nCommercial\n4,691 \n14,160 \n18,851 \n4,252 \n14,087 \n18,339 \nMedicare Advantage\n4,447 \n— \n4,447 \n3,460 \n— \n3,460 \nMedicare Supplement\n1,282 \n— \n1,282 \n1,343 \n— \n1,343 \nMedicaid\n2,094 \n421 \n2,515 \n2,073 \n444 \n2,517 \nTotal medical membership\n12,514 \n14,581 \n27,095 \n11,128 \n14,531 \n25,659 \nSupplemental membership information:\nMedicare Prescription Drug Plan (standalone)\n4,882 \n6,081 \nMedical Membership\n•\nMedical membership represents the number of members covered by the Company’s Insured and ASC medical products and related services at a specified point in time. Management uses this metric to understand variances between actual medical membership and expected amounts as well as trends in period-over-period results. This metric provides management and investors with information useful in understanding the impact of medical membership on segment total revenues and operating results.\n•\nMedical membership as of December 31, 2024 of 27.1 million increased 1.4 million members compared with December 31, 2023, reflecting increases in the Medicare and Commercial product lines. \nMedicare Update\nOn April 1, 2024, CMS issued its final notice detailing final 2025 Medicare Advantage payment rates. Final 2025 Medicare Advantage rates resulted in an expected average decrease in revenue for the Medicare Advantage industry of 0.16%, excluding the CMS estimate of Medicare Advantage risk score trend. On January 10, 2025, CMS issued an advance notice detailing proposed 2026 Medicare Advantage payment rates. The 2026 Medicare Advantage rates, if finalized as proposed, will result in an expected average increase in revenue for the Medicare Advantage industry of 2.23%, excluding the CMS estimate of Medicare Advantage risk score trend. CMS intends to publish the final 2026 rate announcement no later than April 7, 2025.\nThe Patient Protection and Affordable Care Act and the Health Care and Education Reconciliation Act of 2010 ties a portion of each Medicare Advantage plan’s reimbursement to the plan’s “star ratings.” Plans must have a star rating of four or higher (out of five) to qualify for bonus payments. CMS released the Company’s 2025 star ratings in October 2024. The Company’s 2025 star ratings will be used to determine which of the Company’s Medicare Advantage plans have ratings of four stars or higher and qualify for bonus payments in 2026. Based on the Company’s membership as of December 2024, 88% of the Company’s Medicare Advantage members were in plans with 2025 star ratings of at least 4.0 stars, compared to 91% of the Company’s Medicare Advantage members being in plans with 2024 star ratings of at least 4.0 stars based on the Company’s membership as of December 2023.\n80\nHealth Services Segment\nThe following table summarizes the Health Services segment’s performance for the respective periods:\nChange\nYear Ended December 31,\n2024 vs. 2023\n2023 vs. 2022\nIn millions, except percentages\n2024\n2023\n2022\n$\n%\n$\n%\nRevenues:\nProducts\n$\n162,436\n$\n180,608\n$\n167,019\n$\n(18,172)\n(10.1)\n%\n$\n13,589 \n8.1 \n%\nServices\n10,884\n6,236\n2,557\n4,648 \n74.5 \n%\n3,679\n143.9 \n%\nNet investment income (loss) \n(1)\n285\n(1)\n—\n286 \nNM\n(1)\n(100.0)\n%\nTotal revenues\n173,605\n186,843\n169,576\n(13,238)\n(7.1)\n%\n17,267 \n10.2 \n%\nCost of products sold\n160,036\n175,424\n160,738\n(15,388)\n(8.8)\n%\n14,686 \n9.1 \n%\nHealth care costs\n3,407\n1,607\n—\n1,800 \n112.0 \n%\n1,607 \n100.0 \n%\nOperating expenses\n3,225\n2,970\n2,226\n255 \n8.6 \n%\n744 \n33.4 \n%\nOperating expenses as a % of total revenues\n1.9 \n%\n1.6 \n%\n1.3 \n%\nOperating income\n$\n6,937\n$\n6,842\n$\n6,612\n$\n95 \n1.4 \n%\n$\n230 \n3.5 \n%\nOperating income as a % of total revenues\n4.0 \n%\n3.7 \n%\n3.9 \n%\nAdjusted operating income \n(2)\n$\n7,243\n$\n7,312\n$\n6,781\n$\n(69)\n(0.9)\n%\n$\n531 \n7.8 \n%\nAdjusted operating income as a % of total revenues\n4.2 \n%\n3.9 \n%\n4.0 \n%\nRevenues (by distribution channel):\n \nPharmacy network \n(3)\n$\n91,650\n$\n112,718\n$\n102,968\n$\n(21,068)\n(18.7)\n%\n$\n9,750 \n9.5 \n%\nMail & specialty \n(4)\n70,877\n67,992\n63,825\n2,885 \n4.2 \n%\n4,167 \n6.5 \n%\nOther\n10,793\n6,134\n2,783\n4,659 \n76.0 \n%\n3,351 \n120.4 \n%\nNet investment income (loss)\n (1)\n285\n(1)\n—\n286 \nNM\n(1)\n(100.0)\n%\nPharmacy claims processed\n (5)\n1,917.6\n2,344.3\n2,335.1\n(426.7)\n(18.2)\n%\n9.2 \n0.4 \n%\nGeneric dispensing rate \n(5)\n87.4 \n%\n87.6 \n%\n87.4 \n%\n_____________________________________________\n(1)\nNM represents a percent change that is not meaningful.\n(2)\nSee “Segment Analysis” above in this MD&A for a reconciliation of operating income (GAAP measure) to adjusted operating income for the Health Services segment, which represents the Company’s principal measure of segment performance.\n(3)\nPharmacy network revenues relate to claims filled at retail and specialty retail pharmacies, including the Company’s retail pharmacies and LTC pharmacies, as well as activity associated with Maintenance Choice, which permits eligible client plan members to fill their maintenance prescriptions through mail order delivery or at a CVS pharmacy retail store for the same price as mail order.\n(4)\nMail & specialty revenues relate to specialty mail claims inclusive of Specialty Connect\n®\n claims picked up at a retail pharmacy, as well as mail order and specialty claims fulfilled by the Pharmacy & Consumer Wellness segment.\n(5)\nIncludes an adjustment to convert 90-day prescriptions to the equivalent of three 30-day prescriptions. This adjustment reflects the fact that these prescriptions include approximately three times the amount of product days supplied compared to a normal prescription.\nCommentary - 2024 compared to 2023\nRevenues\n•\nTotal revenues decreased $13.2 billion, or 7.1%, in 2024 compared to 2023. The decrease was primarily driven by the previously announced loss of a large client and continued pharmacy client price improvements. These decreases were partially offset by pharmacy drug mix, increased contributions from the Company’s health care delivery assets, including the 2023 acquisitions of Oak Street Health and Signify Health, as well as growth in specialty pharmacy. \nOperating expenses\n•\nOperating expenses in the Health Services segment include selling, general and administrative expenses; and depreciation and amortization expense.\n•\nOperating expenses increased $255 million, or 8.6%, in 2024 compared to 2023. The increase was primarily driven by operating expenses associated with Oak Street Health which was acquired in May of 2023, including the amortization of acquired intangible assets. \n81\nAdjusted operating income\n•\nAdjusted operating income decreased $69 million, or 0.9%, in 2024 compared to 2023. The decrease in adjusted operating income was primarily driven by continued pharmacy client price improvements and the previously announced loss of a large client. These decreases were largely offset by improved purchasing economics.\n•\nAs you review the Health Services segment’s performance in this area, you should consider the following important information about the business:\n•\nThe Company’s efforts to (i) retain existing clients, (ii) obtain new business and (iii) maintain or improve the rebates, fees and/or discounts the Company receives from manufacturers, wholesalers and retail pharmacies continue to have an impact on adjusted operating income. In particular, competitive pressures in the PBM industry have caused the Company and other PBMs to continue to share with clients a larger portion of rebates, fees and/or discounts received from pharmaceutical manufacturers. In addition, marketplace dynamics and regulatory changes have limited the Company’s ability to offer plan sponsors pricing that includes retail network “differential” or “spread,” and the Company expects these trends to continue. The “differential” or “spread” is any difference between the drug price charged to plan sponsors, including Medicare Part D plan sponsors, by a PBM and the price paid for the drug by the PBM to the dispensing provider.\nPharmacy claims processed\n•\nPharmacy claims processed represents the number of prescription claims processed through the Company’s pharmacy benefits manager and dispensed by either its retail network pharmacies or the Company’s mail and specialty pharmacies. Management uses this metric to understand variances between actual claims processed and expected amounts as well as trends in period-over-period results. This metric provides management and investors with information useful in understanding the impact of pharmacy claim volume on segment total revenues and operating results.\n•\nThe Company’s pharmacy claims processed decreased 18.2% on a 30-day equivalent basis in 2024 compared to 2023 primarily driven by the previously announced loss of a large client. \nGeneric dispensing rate\n•\nGeneric dispensing rate is calculated by dividing the Health Services segment’s generic claims processed by its total claims processed. Management uses this metric to evaluate the effectiveness of the business at encouraging the use of generic drugs when they are available and clinically appropriate, which aids in decreasing costs for client members and retail customers. This metric provides management and investors with information useful in understanding trends in segment total revenues and operating results. \n•\nThe Health Services segment’s generic dispensing rate decreased to 87.4% in 2024 compared to 87.6% in the prior year. The decrease in the segment’s generic dispensing rate was primarily driven by an increase in brand name GLP-1 pharmacy claims in 2024 compared to 2023.\n82\nPharmacy & Consumer Wellness Segment \nThe following table summarizes the Pharmacy & Consumer Wellness segment’s performance for the respective periods:\nChange\nYear Ended December 31,\n2024 vs. 2023\n2023 vs. 2022\nIn millions, except percentages\n2024\n2023\n2022\n$\n%\n$\n%\nRevenues:\nProducts\n$\n122,028\n$\n113,976\n$\n104,878\n$\n8,052 \n7.1 \n%\n$\n9,098 \n8.7 \n%\nServices\n2,472\n2,792\n3,762\n(320)\n(11.5)\n%\n(970)\n(25.8)\n%\nNet investment income (loss)\n—\n(5)\n(44)\n5 \n100.0 \n%\n39 \n88.6 \n%\nTotal revenues\n124,500\n116,763\n108,596\n7,737 \n6.6 \n%\n8,167 \n7.5 \n%\nCost of products sold \n99,337\n91,447\n82,063\n7,890 \n8.6 \n%\n9,384 \n11.4 \n%\nOperating expenses\n19,646\n19,618\n20,481\n28 \n0.1 \n%\n(863)\n(4.2)\n%\nOperating expenses as a % of total revenues\n15.8 \n%\n16.8 \n%\n18.9 \n%\nRestructuring charges\n$\n747\n$\n—\n$\n—\n$\n747 \n100.0 \n%\n$\n— \n— \n%\nLoss on assets held for sale\n—\n349\n2,492\n(349)\n(100.0)\n%\n(2,143)\n(86.0)\n%\nOperating income\n4,770\n5,349\n3,560\n(579)\n(10.8)\n%\n1,789 \n50.3 \n%\nOperating income as a % of total revenues\n3.8 \n%\n4.6 \n%\n3.3 \n%\nAdjusted operating income \n(1)\n$\n5,774\n$\n5,963\n$\n6,531\n$\n(189)\n(3.2)\n%\n$\n(568)\n(8.7)\n%\nAdjusted operating income as a % of total revenues\n4.6 \n%\n5.1 \n%\n6.0 \n%\nRevenues (by major goods/service lines):\nPharmacy\n$\n100,687\n$\n92,111\n$\n83,480\n$\n8,576 \n9.3 \n%\n$\n8,631 \n10.3 \n%\nFront Store\n21,522\n22,458\n22,780\n(936)\n(4.2)\n%\n(322)\n(1.4)\n%\nOther\n2,291\n2,199\n2,380\n92 \n4.2 \n%\n(181)\n(7.6)\n%\nNet investment income (loss)\n—\n(5)\n(44)\n5 \n100.0 \n%\n39 \n88.6 \n%\nPrescriptions filled \n(2)\n1,715.5\n1,649.1\n1,625.4\n66.4 \n4.0 \n%\n23.7 \n1.5 \n%\nSame store sales increase (decrease): \n(3)\nTotal\n9.4 \n%\n10.7 \n%\n9.1 \n%\nPharmacy\n12.3 \n%\n13.6 \n%\n9.5 \n%\nFront Store\n(2.1)\n%\n0.3 \n%\n7.8 \n%\nPrescription volume \n(2)\n6.8 \n%\n3.9 \n%\n4.0 \n%\nGeneric dispensing rate \n(2)\n88.9 \n%\n88.4 \n%\n87.4 \n%\n_____________________________________________\n(1)\nSee “Segment Analysis” above in this MD&A for a reconciliation of operating income (GAAP measure) to adjusted operating income for the Pharmacy & Consumer Wellness segment, which represents the Company’s principal measure of segment performance.\n(2)\nIncludes an adjustment to convert 90‑day prescriptions to the equivalent of three 30‑day prescriptions. This adjustment reflects the fact that these prescriptions include approximately three times the amount of product days supplied compared to a normal prescription.\n(3)\nSame store sales and prescription volume represent the change in revenues and prescriptions filled in the Company’s retail pharmacy stores that have been operating for greater than one year and digital sales initiated online or through mobile applications and fulfilled through the Company’s distribution centers, expressed as a percentage that indicates the increase or decrease relative to the comparable prior period. Same store metrics exclude revenues and prescriptions from LTC and infusion services operations. Management uses these metrics to evaluate the performance of existing stores on a comparable basis and to inform future decisions regarding existing stores and new locations. Same-store metrics provide management and investors with information useful in understanding the portion of current revenues and prescriptions resulting from organic growth in existing locations versus the portion resulting from opening new stores.\nCommentary - 2024 compared to 2023\nRevenues\n \n•\nTotal revenues increased $7.7 billion, or 6.6%, in 2024 compared to 2023. The increase was primarily driven by pharmacy drug mix and increased prescription volume, including increased contributions from vaccinations. These increases were partially offset by continued pharmacy reimbursement pressure, the impact of recent generic introductions and decreased \n83\nfront store volume, including the impact of a decrease in store count and lower contributions from COVID-19 over-the-counter (“OTC”) test kits since the expiration of the public health emergency in May 2023.\n•\nPharmacy same store sales increased 12.3% in 2024 compared to 2023. The increase was primarily driven by the 6.8% increase in pharmacy same store prescription volume on a 30-day equivalent basis, including increased contributions from vaccinations, and pharmacy drug mix, including branded GLP-1 drugs. These increases were partially offset by continued pharmacy reimbursement pressure and the impact of recent generic introductions.\n•\nFront store same store sales decreased 2.1% in 2024 compared to 2023 primarily due to general softening of consumer demand and lower contributions from COVID-19 OTC test kits compared to the prior year.\nOperating expenses\n•\nOperating expenses in the Pharmacy & Consumer Wellness segment include payroll, employee benefits and occupancy costs associated with the segment’s stores and pharmacy fulfillment operations; selling expenses; advertising expenses; depreciation and amortization expense and certain administrative expenses.\n•\nOperating expenses remained relatively consistent in 2024 compared to the prior year at $19.6 billion, as the absence of gains from anti-trust legal settlements and increased investments in the segment’s operations and capabilities were substantially offset by the decrease in store count.\nRestructuring charges\n•\nDuring 2024, the Company recorded $747 million of restructuring charges related to the write-down of lease right-of-use assets and property and equipment in connection with the Company’s restructuring program. See Note 3 ‘‘Restructuring’’ included in Item 8 of this 10-K for additional information.\n Loss on assets held for sale\n•\nDuring 2023, the Company recorded losses on assets held for sale of $349 million related to the write-down of its LTC business. See Note 2 ‘‘Acquisitions, Divestitures and Asset Sales’’ included in Item 8 of this 10-K for additional information.\nAdjusted operating income\n•\nAdjusted operating income decreased $189 million, or 3.2%, in 2024 compared to 2023 primarily driven by continued pharmacy reimbursement pressure and decreased front store volume, including lower contributions from COVID-19 OTC test kits, largely offset by increased prescription volume, including increased contributions from vaccinations, as well as improved drug purchasing. \n•\nAs you review the Pharmacy & Consumer Wellness segment’s performance in this area, you should consider the following important information about the business:\n•\nThe segment’s adjusted operating income has been adversely affected by the efforts of managed care organizations, PBMs and governmental and other third-party payors to reduce their prescription drug costs, including the use of restrictive networks, as well as changes in the mix of business within the pharmacy portion of the Pharmacy & Consumer Wellness segment. If the pharmacy reimbursement pressure accelerates, the segment may not be able to grow revenues, and its adjusted operating income could be adversely affected.\nPrescriptions filled\n•\nPrescriptions filled represents the number of prescriptions dispensed through the Pharmacy & Consumer Wellness segment’s retail and long-term care pharmacies and infusion services operations. Management uses this metric to understand variances between actual prescriptions dispensed and expected amounts as well as trends in period-over-period results. This metric provides management and investors with information useful in understanding the impact of prescription volume on segment total revenues and operating results.\n•\nPrescriptions filled increased 4.0% on a 30-day equivalent basis in 2024 compared to 2023 primarily driven by increased utilization, partially offset by the decrease in store count. \nGeneric dispensing rate\n•\nGeneric dispensing rate is calculated by dividing the Pharmacy & Consumer Wellness segment’s generic drug prescriptions filled by its total prescriptions filled. Management uses this metric to evaluate the effectiveness of the business at encouraging the use of generic drugs when they are available and clinically appropriate, which aids in decreasing costs for client members and retail customers. This metric provides management and investors with information useful in understanding trends in segment total revenues and operating results. \n84\n•\nThe Pharmacy & Consumer Wellness segment’s generic dispensing rate increased to 88.9% in 2024 compared to 88.4% in the prior year. The increase in the segment’s generic dispensing rate was primarily driven by the impact of new generic drug introductions and the Company’s ongoing efforts to encourage plan members to use generic drugs when they are available and clinically appropriate. \n85\nCorporate/Other Segment\nThe following table summarizes the Corporate/Other segment’s performance for the respective periods:\nChange\nYear Ended December 31,\n2024 vs. 2023\n2023 vs. 2022\nIn millions, except percentages\n2024\n2023\n2022\n$\n%\n$\n%\nRevenues:\nPremiums\n$\n47 \n$\n48\n$\n56\n$\n(1)\n(2.1)\n%\n$\n(8)\n(14.3)\n%\nServices\n9 \n9\n68\n— \n— \n%\n(59)\n(86.8)\n%\nNet investment income\n395 \n394\n406\n1 \n0.3 \n%\n(12)\n(3.0)\n%\nTotal revenues\n451 \n451\n530\n— \n— \n%\n(79)\n(14.9)\n%\nCost of products sold\n— \n1\n42\n(1)\n(100.0)\n%\n(41)\n(97.6)\n%\nHealth care costs\n187 \n210\n249\n(23)\n(11.0)\n%\n(39)\n(15.7)\n%\nOperating expenses\n1,939 \n2,130\n1,924\n(191)\n(9.0)\n%\n206 \n10.7 \n%\nRestructuring charges\n432 \n507\n—\n(75)\n(14.8)\n%\n507 \n100.0 \n%\nOpioid litigation charges\n100 \n—\n5,803\n100 \n100.0 \n%\n(5,803)\n(100.0)\n%\nOperating loss\n(2,207)\n(2,397)\n(7,488)\n190 \n7.9 \n%\n5,091 \n68.0 \n%\nAdjusted operating loss\n (1)\n(1,348)\n(1,318)\n(1,613)\n(30)\n(2.3)\n%\n295 \n18.3 \n%\n_____________________________________________\n(1)\nSee “Segment Analysis” above in this MD&A for a reconciliation of Corporate/Other segment operating loss (GAAP measure) to adjusted operating loss, which represents the Company’s principal measure of segment performance.\nCommentary - 2024 compared to 2023\nRevenues\n•\nRevenues primarily relate to products for which the Company no longer solicits or accepts new customers, such as large case pensions and long-term care insurance products.\n•\nTotal revenues of $451 million in 2024 remained consistent compared to 2023. \nRestructuring charges\n•\nDuring 2024, the Company recorded $432 million of restructuring charges comprised of $129 million of asset impairment and related charges associated with the write-down of certain non-core assets, $293 million of severance and employee-related costs associated with corporate workforce optimization and a $10 million stock-based compensation charge associated with the impacted employees. During 2023, the Company recorded $507 million in pre-tax restructuring charges, comprised of $344 million of severance and employee-related costs associated with corporate workforce optimization, $152 million of asset impairment charges and an $11 million stock-based compensation charge associated with the impacted employees. See Note 3 ‘‘Restructuring’’ included in Item 8 of this 10-K for additional information.\nAdjusted operating loss\n•\nAdjusted operating loss of $1.3 billion in 2024 remained relatively consistent compared to 2023. \n86\nLiquidity and Capital Resources\nCash Flows\nThe Company maintains a level of liquidity sufficient to allow it to meet its cash needs in the short-term. Over the long term, the Company manages its cash and capital structure to maximize shareholder return, maintain its financial condition and maintain flexibility for future strategic initiatives. The Company continuously assesses its regulatory capital requirements, working capital needs, debt and leverage levels, debt maturity schedule, capital expenditure requirements, dividend payouts, potential share repurchases and future investments or acquisitions. The Company believes its operating cash flows, commercial paper program, credit facilities, as well as any potential future borrowings, will be sufficient to fund these future payments and long-term initiatives. As of December 31, 2024, the Company had approximately $8.6 billion in cash and cash equivalents, approximately $3.8 billion of which was held by the parent company or nonrestricted subsidiaries.\nThe net change in cash, cash equivalents and restricted cash for the years ended December 31, 2024, 2023 and 2022 was as follows:\nChange\nYear Ended December 31,\n2024 vs. 2023\n2023 vs. 2022\nIn millions\n2024\n2023\n2022\n$\n%\n$\n%\nNet cash provided by operating activities\n$\n9,107 \n$\n13,426 \n$\n16,177 \n$\n(4,319)\n(32.2)\n%\n$\n(2,751)\n(17.0)\n%\nNet cash used in investing activities\n(7,613)\n(20,889)\n(5,047)\n13,276 \n63.6 \n%\n(15,842)\n(313.9)\n%\nNet cash provided by (used in) financing activities\n(1,135)\n2,683 \n(10,516)\n(3,818)\n(142.3)\n%\n13,199 \n125.5 \n%\nNet increase (decrease) in cash, cash equivalents and restricted cash\n$\n359 \n$\n(4,780)\n$\n614 \n$\n5,139 \n107.5 \n%\n$\n(5,394)\n(878.5)\n%\nCommentary - 2024 compared to 2023\n•\nNet cash provided by operating activities \ndecreased by $4.3 billion in 2024 compared to 2023 primarily due to the impact of elevated Medicare utilization on earnings.\n•\nNet cash used in investing activities \ndecreased by $13.3 billion in 2024 compared to 2023 primarily due to the acquisitions of Oak Street Health in May 2023 and Signify Health in March 2023, partially offset by higher net purchases of investments. In addition, cash used in investing activities reflected the following activity:\n•\nGross capital expenditures were approximately $2.8 billion and $3.0 billion in 2024 and 2023, respectively. During 2024, approximately 76% of the Company’s total capital expenditures were for technology, digital and other strategic initiatives and 24% were for store, fulfillment and support and improvements.\n•\nNet cash used in financing activities\n was $1.1 billion in 2024 compared to net cash provided by financing activities of $2.7 billion in 2023. The change in cash provided by (used in) financing activities primarily related to lower proceeds from the issuance of long-term debt and higher repayments of long-term debt in 2024 compared to the prior year, as well as higher repurchases of common stock in 2024, partially offset by higher proceeds from commercial paper borrowings compared to the prior year.\nIncluded in net cash used in investing activities for the years ended December 31, 2024, 2023 and 2022 was the following store development activity: \n(1)\n2024\n2023\n2022\nTotal stores (beginning of year)\n9,395 \n9,674 \n9,939 \nNew and acquired stores \n(2)\n39 \n39 \n41 \nClosed stores \n(2)\n(299)\n(318)\n(306)\nTotal stores (end of year)\n9,135 \n9,395 \n9,674 \nRelocated stores \n(2)\n3 \n5 \n4 \n_____________________________________________\n(1)\nIncludes retail drugstores and pharmacies within retail chains, primarily in Target Corporation (“Target”) stores.\n(2)\nRelocated stores are not included in new and acquired stores or closed stores totals.\n87\nShort-term Borrowings\nCommercial Paper and Back-up Credit Facilities\nThe Company had $2.1 billion of commercial paper outstanding at a weighted average interest rate of 4.98% as of December 31, 2024. The Company had $200 million of commercial paper outstanding at a weighted interest rate of 4.31% as of December 31, 2023. In connection with its commercial paper program, the Company maintains a $2.5 billion, five-year unsecured back-up revolving credit facility, which expires on May 11, 2027, a $2.5 billion, five-year unsecured back-up revolving credit facility, which expires on May 16, 2028, and a $2.5 billion, five-year unsecured back-up revolving credit facility, which expires on May 16, 2029. The credit facilities allow for borrowings at various rates that are dependent, in part, on the Company’s public debt ratings and require the Company to pay a weighted average quarterly facility fee of approximately 0.03%, regardless of usage. As of December 31, 2024 and 2023, there were no borrowings outstanding under any of the Company’s back-up credit facilities.\nTerm Loan Agreement\nOn March 25, 2024, the Company entered into a 364-day $3.0 billion term loan credit agreement. The term loan credit agreement allowed for borrowings at various rates that were dependent, in part, on the Company’s public debt ratings. On May 9, 2024, following the issuance of the $5.0 billion in senior notes described under “Long-term Borrowings” below, the term loan credit agreement terminated. There were no borrowings under the term loan credit agreement through the date of termination.\nOn May 1, 2023, the Company entered into a 364-day $5.0 billion term loan agreement. The term loan agreement allowed for borrowings at various rates that were dependent, in part, on the Company’s debt ratings. On May 2, 2023, the Company borrowed $5.0 billion at an interest rate of approximately 6.2% under the term loan agreement to fund a portion of the Oak Street Health acquisition purchase price. On June 2, 2023, the Company repaid the outstanding balance under the term loan agreement.\nFederal Home Loan Bank of Boston (“FHLBB”)\nA subsidiary of the Company is a member of the FHLBB. As a member, the subsidiary has the ability to obtain cash advances, subject to certain minimum collateral requirements. The maximum borrowing capacity available from the FHLBB as of December 31, 2024 was approximately $1.2 billion. As of December 31, 2024 and 2023, there were no outstanding advances from the FHLBB.\nLong-term Borrowings\n2024 Notes\nOn December 10, 2024, the Company issued $2.25 billion aggregate principal amount of 7.0% fixed-to-fixed rate series A junior subordinated notes due March 2055 and $750 million aggregate principal amount of 6.75% fixed-to-fixed rate series B junior subordinated notes due December 2054 for total proceeds of approximately $3.0 billion, net of discounts and underwriting fees. The series A junior subordinated notes bear interest at 7.0% per year until March 10, 2030, at which time the rate will reset March 10th of every fifth year, provided that the interest rate will not reset below the initial interest rate. The series B junior subordinated notes bear interest at 6.75% per year until December 10, 2034, at which time the rate will reset December 10th of every fifth year, provided that the interest rate will not reset below the initial interest rate. The series A and series B junior subordinated notes pay interest semi-annually and may be redeemed at any time beginning 90 days prior to their respective first interest rate reset date and on any interest payment date thereafter, in whole or in part at a defined redemption price plus accrued interest. The net proceeds of these offerings were used for the early extinguishment of certain of the Company’s senior notes as described below and the remaining proceeds after the early extinguishment of debt were used for general corporate purposes.\nOn May 9, 2024, the Company issued $1.0 billion aggregate principal amount of 5.4% senior notes due June 2029, $1.0 billion aggregate principal amount of 5.55% senior notes due June 2031, $1.25 billion aggregate principal amount of 5.7% senior notes due June 2034, $750 million aggregate principal amount of 6.0% senior notes due June 2044 and $1.0 billion aggregate principal amount of 6.05% senior notes due June 2054 for total proceeds of approximately $5.0 billion, net of discounts and underwriting fees. The net proceeds of these offerings were used for general corporate purposes.\n2023 Notes\nOn June 2, 2023, the Company issued $1.0 billion aggregate principal amount of 5.0% senior notes due January 2029, $750 million aggregate principal amount of 5.25% senior notes due January 2031, $1.25 billion aggregate principal amount of 5.3% senior notes due June 2033, $1.25 billion aggregate principal amount of 5.875% senior notes due June 2053 and \n88\n$750 million aggregate principal amount of 6.0% senior notes due June 2063 for total proceeds of approximately $4.9 billion, net of discounts and underwriting fees. The net proceeds of these offerings were used, along with cash on hand, to repay the outstanding balance under the term loan agreement described above.\nOn February 21, 2023, the Company issued $1.5 billion aggregate principal amount of 5.0% senior notes due February 2026, $1.5 billion aggregate principal amount of 5.125% senior notes due February 2030, $1.75 billion aggregate principal amount of 5.25% senior notes due February 2033 and $1.25 billion aggregate principal amount of 5.625% senior notes due February 2053 for total proceeds of approximately $6.0 billion, net of discounts and underwriting fees. The net proceeds of these offerings were used to fund general corporate purposes, including a portion of the Signify Health acquisition purchase price.\nOak Street Health Convertible Notes\nPrior to the Oak Street Health acquisition, Oak Street Health held 0% convertible senior notes with an aggregate principal amount of $920 million (the “Convertible Notes”), which were assumed by the Company in connection with the Oak Street Health acquisition. The Oak Street Health acquisition constituted a fundamental change in the Convertible Notes giving the holders the right to require the Company to repurchase the Convertible Notes. The repurchase price was an amount in cash equal to 100% of the principal amount of the Convertible Notes. On May 31, 2023, the Company issued a notice of repurchase to the holders of the Convertible Notes. In connection with this notice, $917 million of the Convertible Notes were submitted for repurchase and settled on July 21, 2023. Substantially all of the remaining $3 million of the Convertible Notes were submitted for repurchase and settled on October 20, 2023. \nGain on Early Extinguishment of Debt\nIn December 2024, pursuant to a cash tender offer, the Company repaid approximately $2.6 billion of its outstanding senior notes for a cash payment of approximately $2.0 billion. The senior notes purchased include: $226 million of its 4.1% senior notes due March 2025, $398 million of its 4.125% senior notes due April 2040, $883 million of its 2.7% senior notes due August 2040, $274 million of its 4.125% senior notes due November 2042, $463 million of its 3.875% senior notes due August 2047 and $351 million of its 4.25% senior notes due April 2050. In connection with the purchase of such senior notes, the Company recognized a total gain on early extinguishment of debt of $491 million, net of unamortized deferred financing costs and incurred fees.\nSee Note 10 ‘‘Borrowings and Credit Agreements’’ included in Item 8 of this 10-K for additional information about debt issuances and debt repayments. \nDerivative Financial Instruments\nThe Company uses derivative financial instruments in order to manage interest rate and foreign exchange risk and credit exposure. The Company’s use of these derivatives is generally limited to hedging risk and has principally consisted of using interest rate swaps, treasury rate locks, forward contracts, futures contracts, warrants, put options and credit default swaps. \nDebt Covenants\nThe Company’s back-up revolving credit facilities and unsecured senior notes (see Note 10 ‘‘Borrowings and Credit Agreements’’ included in Item 8 of this 10-K) contain customary restrictive financial and operating covenants. These covenants do not include an acceleration of the Company’s debt maturities in the event of a downgrade in the Company’s credit ratings. The Company does not believe the restrictions contained in these covenants materially affect its financial or operating flexibility. As of December 31, 2024, the Company was in compliance with all of its debt covenants.\nDebt Ratings\n \nAs of December 31, 2024, the Company’s long-term debt was rated “BBB” by Fitch Ratings, Inc. (“Fitch”), “Baa3” by Moody’s Investors Service, Inc. (“Moody’s”) and “BBB” by Standard & Poor’s Financial Services LLC (“S&P”), and its commercial paper program was rated “F2” by Fitch, “P-3” by Moody’s and “A-2” by S&P. In August 2024, Moody’s and S&P changed their outlook on the Company’s long-term debt from “Stable” to “Negative.” In October 2024, Moody’s placed the Company’s long-term debt ratings and the Company’s commercial paper program on review for downgrade. Subsequently, in December 2024, Moody’s downgraded the Company’s long-term debt rating to “Baa3” and the Company’s commercial paper rating to “P3” and changed their outlook on the Company to “Stable”. In December 2024, Fitch initiated ratings coverage on the Company and assigned a first-time “BBB” rating to the Company’s long-term debt and a “F2” rating to the Company’s commercial paper program with the outlook on the Company of “Negative”. In assessing the Company’s credit strength, the Company believes that Moody’s, S&P and Fitch considered, among other things, the Company’s capital structure and financial \n89\npolicies, as well as its consolidated balance sheet, its historical acquisition activity and other financial information, including the Company’s expectations for future earnings and cash flows. Although the Company currently believes its long-term debt ratings will remain investment grade, it cannot predict the future actions of Moody’s, S&P and/or Fitch. The Company’s debt ratings have a direct impact on its future borrowing costs, access to capital markets and new store operating lease costs. \nShare Repurchase Programs\nThe following share repurchase programs have been authorized by CVS Health Corporation’s Board of Directors (the “Board”):\nThe following share repurchase programs have been authorized by the Board:\nIn billions\nAuthorization Date\nAuthorized\nRemaining as of\nDecember 31, 2024\nNovember 17, 2022 (“2022 Repurchase Program”)\n$\n10.0 \n$\n10.0 \nDecember 9, 2021 (“2021 Repurchase Program”)\n10.0 \n1.5 \nEach of the share Repurchase Programs was effective immediately and permit the Company to effect repurchases from time to time through a combination of open market repurchases, privately negotiated transactions, accelerated share repurchase (“ASR”) transactions, and/or other derivative transactions. Both the 2022 and 2021 Repurchase Programs can be modified or terminated by the Board at any time.\nDuring the years ended December 31, 2024, 2023 and 2022, the Company repurchased an aggregate of 39.7 million shares of common stock for approximately $3.0 billion, an aggregate of 22.8 million shares of common stock for approximately $2.0 billion and an aggregate of 34.1 million shares of common stock for approximately $3.5 billion, respectively, each pursuant to the 2021 Repurchase Program. This activity includes the share repurchases under the ASR transactions described below.\nPursuant to the authorization under the 2021 Repurchase Program, the Company entered into a $3.0 billion fixed dollar ASR with Morgan Stanley & Co. LLC (“Morgan Stanley”). Upon payment of the $3.0 billion purchase price on January 4, 2024, the Company received a number of shares of CVS Health Corporation’s common stock equal to 85% of the $3.0 billion notional amount of the ASR or approximately 31.4 million shares, which were placed into treasury stock in January 2024. The ASR was accounted for as an initial treasury stock transaction for $2.6 billion and a forward contract for $0.4 billion. The forward contract was classified as an equity instrument and was recorded within capital surplus. In March 2024, the Company received approximately 8.3 million shares of CVS Health Corporation’s common stock, representing the remaining 15% of the $3.0 billion notional amount of the ASR, thereby concluding the ASR. These shares were placed into treasury and the forward contract was reclassified from capital surplus to treasury stock in March 2024.\nPursuant to the authorization under the 2021 Repurchase Program, the Company entered into a $2.0 billion fixed dollar ASR with Citibank, N.A. Upon payment of the $2.0 billion purchase price on January 4, 2023, the Company received a number of shares of CVS Health Corporation’s common stock equal to 80% of the $2.0 billion notional amount of the ASR or approximately 17.4 million shares, which were placed into treasury stock in January 2023. The ASR was accounted for as an initial treasury stock transaction for $1.6 billion and a forward contract for $0.4 billion. The forward contract was classified as an equity instrument and was recorded within capital surplus. In February 2023, the Company received approximately 5.4 million shares of CVS Health Corporation’s common stock, representing the remaining 20% of the $2.0 billion notional amount of the ASR, thereby concluding the ASR. These shares were placed into treasury stock and the forward contract was reclassified from capital surplus to treasury stock in February 2023.\nPursuant to the authorization under the 2021 Repurchase Program, the Company entered into a $1.5 billion fixed dollar ASR with Barclays Bank PLC. Upon payment of the $1.5 billion purchase price on January 4, 2022, the Company received a number of shares of CVS Health Corporation’s common stock equal to 80% of the $1.5 billion notional amount of the ASR or approximately 11.6 million shares, which were placed into treasury stock in January 2022. The ASR was accounted for as an initial treasury stock transaction for $1.2 billion and a forward contract for $0.3 billion. The forward contract was classified as an equity instrument and was recorded within capital surplus. In February 2022, the Company received approximately 2.7 million shares of CVS Health Corporation’s common stock, representing the remaining 20% of the $1.5 billion notional amount of the ASR, thereby concluding the ASR. These shares were placed into treasury stock and the forward contract was reclassified from capital surplus to treasury stock in February 2022.\n90\nAt the time they were received, the initial and final receipt of shares resulted in an immediate reduction of the outstanding shares used to calculate the weighted average common shares outstanding for basic and diluted earnings per share.\nDividends\nDuring 2024, 2023 and 2022 the quarterly cash dividend was $0.665, $0.605 and $0.55 per share, respectively.  CVS Health Corporation has paid cash dividends every quarter since becoming a public company and expects to maintain its quarterly dividend of $0.665 per share throughout 2025. Future dividend payments will depend on the Company’s earnings, capital requirements, financial condition and other factors considered relevant by the Board.\n91\nFuture Cash Requirements\nThe following table summarizes certain estimated future cash requirements under the Company’s various contractual obligations at December 31, 2024, in total and disaggregated into current and long-term obligations. The table below does not include future payments of claims to health care providers or pharmacies because certain terms of these payments are not determinable at December 31, 2024 (for example, the timing and volume of future services provided under fee-for-service arrangements and future membership levels for capitated arrangements). \nIn millions\nTotal\nCurrent\nLong-Term\nOperating lease liabilities \n(1)\n$\n21,189 \n$\n2,683 \n$\n18,506 \nFinance lease liabilities \n(1)\n2,038 \n144 \n1,894 \nContractual lease obligations with Target \n(2)\n2,217 \n— \n2,217 \nCommercial paper \n(3)\n2,119 \n2,119 \n— \nLong-term debt \n(3)\n63,268 \n3,559 \n59,709 \nInterest payments on long-term debt \n(3)\n42,240 \n2,892 \n39,348 \nOpioid litigation settlement obligations \n(4)\n4,792 \n814 \n3,978 \nOther long-term liabilities on the consolidated balance sheets \n(5) \nFuture policy benefits\n (6) \n4,560 \n371 \n4,189 \nUnpaid claims\n (6) \n993 \n280 \n713 \nPolicyholders’ funds \n(6) (7)\n1,270 \n869 \n401 \nTotal\n$\n144,686 \n$\n13,731 \n$\n130,955 \n_____________________________________________\n(1)\nRefer to Note 7 ‘‘Leases’’ included in Item 8 of this 10-K for additional information regarding the maturity of lease liabilities under operating and finance leases. \n(2)\nThe Company leases pharmacy and clinic space from Target. See Note 7 ‘‘Leases’’ included in Item 8 of this 10-K for additional information regarding the lease arrangements with Target. Amounts related to such operating and finance leases are reflected within the operating lease liabilities and finance lease liabilities in the table above. Pharmacy lease amounts due in excess of the remaining estimated economic life of the buildings are reflected in the table above assuming equivalent stores continue to operate through the term of the arrangements. \n(3)\nRefer to Note 10 ‘‘Borrowings and Credit Agreements’’ included in Item 8 of this 10-K for additional information regarding the maturities of debt principal and commercial paper borrowings. Interest payments on long-term debt are calculated using outstanding balances and interest rates in effect on December 31, 2024.\n(4)\nRefer to Note 18 ‘‘Commitments and Contingencies’’ included in Item 8 of this 10-K for additional information regarding the opioid litigation settlement obligations. \n(5)\nPayments of other long-term liabilities exclude Separate Accounts liabilities of approximately $3.3 billion because these liabilities are supported by assets that are legally segregated and are not subject to claims that arise out of the Company’s business.\n(6)\nTotal payments of future policy benefits, unpaid claims and policyholders’ funds include $566 million, $911 million and $137 million, respectively, of reserves for contracts subject to reinsurance. The Company expects the assuming reinsurance carrier to fund these obligations and has reflected these amounts as reinsurance recoverable assets on the consolidated balance sheets.\n(7)\nCustomer funds associated with group life and health contracts of approximately $52 million have been excluded from the table above because such funds may be used primarily at the customer’s discretion to offset future premiums and/or for refunds, and the timing of the related cash flows cannot be determined. Additionally, net unrealized capital losses on debt securities supporting experience-rated products of $25 million, before tax, have been excluded from the table above.\nRestrictions on Certain Payments\nIn addition to general state law restrictions on payments of dividends and other distributions to stockholders applicable to all corporations, health maintenance organizations (“HMOs”) and insurance companies are subject to further regulations that, among other things, may require those companies to maintain certain levels of equity (referred to as surplus) and restrict the amount of dividends and other distributions that may be paid to their equity holders. These regulations are not directly applicable to CVS Health Corporation as a holding company since CVS Health Corporation is not an HMO or an insurance company. In addition, in connection with the Aetna Acquisition, the Company made certain undertakings that require prior regulatory approval of dividends by certain of its HMOs and insurance companies. The additional regulations and undertakings applicable to the Company’s HMO and insurance company subsidiaries are not expected to affect the Company’s ability to service the Company’s debt, meet other financing obligations or pay dividends, or the ability of any of the Company’s subsidiaries to service their debt or other financing obligations. Under applicable regulatory requirements and undertakings, at December 31, 2024, the maximum amount of dividends that may be paid by the Company’s insurance and HMO subsidiaries without prior approval by regulatory authorities was $1.6 billion in the aggregate. \nThe Company maintains capital levels in its operating subsidiaries at or above targeted and/or required capital levels and dividends amounts in excess of these levels to meet liquidity requirements, including the payment of interest on debt and \n92\nstockholder dividends. In addition, at the Company’s discretion, it uses these funds for other purposes such as funding share and debt repurchase programs, investments in new businesses and other purposes considered advisable. \nAt December 31, 2024 and 2023, the Company held investments of $269 million and $307 million, respectively, that are not accounted for as Separate Accounts assets but are legally segregated and are not subject to claims that arise out of the Company’s business. See Note 4 ‘‘Investments’’ included in Item 8 of this 10-K for additional information on investments related to the 2012 conversion of an existing group annuity contract from a participating to a non-participating contract.\nSolvency Regulation\nThe National Association of Insurance Commissioners (the “NAIC”) utilizes risk-based capital (“RBC”) standards for insurance companies that are designed to identify weakly-capitalized companies by comparing each company’s adjusted surplus to its required surplus (the “RBC Ratio”). The RBC Ratio is designed to reflect the risk profile of insurance companies. Within certain ratio ranges, regulators have increasing authority to take action as the RBC Ratio decreases. There are four levels of regulatory action, ranging from requiring an insurer to submit a comprehensive financial plan for increasing its RBC to the state insurance commissioner to requiring the state insurance commissioner to place the insurer under regulatory control. At December 31, 2024, all of the Company’s insurance and HMO subsidiaries were above the RBC level that would require regulatory action. The RBC framework described above for insurers has been extended by the NAIC to health organizations, including HMOs. Although not all states had adopted these rules at December 31, 2024, at that date each of the Company’s active HMOs had a surplus that exceeded either the applicable state net worth requirements or, where adopted, the levels that would require regulatory action under the NAIC’s RBC rules. External rating agencies use their own capital models and/or RBC standards when they determine a company’s rating.\n93\nCritical Accounting Policies\nThe Company prepares the consolidated financial statements in conformity with generally accepted accounting principles, which require management to make certain estimates and apply judgment. Estimates and judgments are based on historical experience, current trends and other factors that management believes to be important at the time the consolidated financial statements are prepared. On a regular basis, the Company reviews its accounting policies and how they are applied and disclosed in the consolidated financial statements. While the Company believes the historical experience, current trends and other factors considered by management support the preparation of the consolidated financial statements in conformity with generally accepted accounting principles, actual results could differ from estimates, and such differences could be material.\nSignificant accounting policies are discussed in Note 1 ‘‘Significant Accounting Policies’’ included in Item 8 of this 10-K. Management believes the following accounting policies include a higher degree of judgment and/or complexity and, thus, are considered to be critical accounting policies. The Company has discussed the development and selection of these critical accounting policies with the Audit Committee of the Board (the “Audit Committee”), and the Audit Committee has reviewed the disclosures relating to them.\nRevenue Recognition\nHealth Care Benefits Segment\nHealth Care Benefits revenue is principally derived from insurance premiums and fees billed to customers. Revenue related to the Company’s Government business is collected monthly from the U.S. federal government and various government agencies based on fixed payment rates and member eligibility. \nSome of the Company’s Government contracts allow for premiums to be adjusted to reflect actual experience or the relative health status of Insured members. Such adjustments are reasonably estimable at the outset of the contract, and adjustments to those estimates are made based on actual experience of the customer emerging under the contract and the terms of the underlying contract.\nHealth Services Segment\nThe Health Services segment sells prescription drugs directly through its specialty and mail order pharmacy offerings and indirectly through the Company’s retail pharmacy network. The Company’s pharmacy benefit arrangements are accounted for in a manner consistent with a master supply arrangement as there are no contractual minimum volumes and each prescription is considered a separate purchasing decision and distinct performance obligation transferred at a point in time. PBM services performed in connection with each prescription claim are considered part of a single performance obligation which culminates in the fulfillment of prescription drugs.\nThe Company recognizes revenue using the gross method at the contract price negotiated with its clients when the Company has concluded it controls the prescription drug before it is transferred to the client plan members. The Company controls prescriptions fulfilled indirectly through its retail pharmacy network because it has separate contractual arrangements with those pharmacies, has discretion in setting the price for the transaction and assumes primary responsibility for fulfilling the promise to provide prescription drugs to its client plan members while also performing the related PBM services.\nRevenues include (i) the portion of the price the client pays directly to the Company, net of any discounts earned on brand name drugs or other discounts and refunds paid back to the client, (ii) the price paid to the Company by client plan members for mail order prescriptions and the price paid to retail network pharmacies by client plan members for retail prescriptions, and (iii) claims based administrative fees for retail pharmacy network contracts. Sales taxes are not included in revenues. \nThe Company recognizes revenue when control of the prescription drugs is transferred to customers, in an amount that reflects the consideration the Company expects to be entitled to receive in exchange for those prescription drugs. The Company has established the following revenue recognition policies for the Health Services segment:\n•\nRevenues generated from prescription drugs sold by third party pharmacies in the Company’s retail pharmacy network and associated administrative fees are recognized at the Company’s point-of-sale, which is when the claim is adjudicated by the Company’s online claims processing system and the Company has transferred control of the prescription drug and completed all of its performance obligations.\n•\nRevenues generated from prescription drugs sold by specialty and mail order pharmacies are recognized when the prescription drug is delivered to the client plan member. At the time of delivery, the Company has performed substantially \n94\nall of its performance obligations under its client contracts and does not experience a significant level of returns or reshipments.\nFor contracts under which the Company acts as an agent or does not control the prescription drugs prior to transfer to the client plan member, revenue is recognized using the net method.\nDrug Discounts\nThe Company records revenue net of manufacturers’ rebates earned by its clients based on their plan members’ utilization of brand-name formulary drugs. The Company estimates these rebates at period-end based on actual and estimated claims data and its estimates of the manufacturers’ rebates earned by its clients. The estimates are based on the best available data at period-end and recent history for the various factors that can affect the amount of rebates due to the client. The Company adjusts its rebates payable to clients to the actual amounts paid when these rebates are paid or as significant events occur. Any cumulative effect of these adjustments is recorded against revenues at the time it is identified. Adjustments generally result from contract changes with clients or manufacturers that have retroactive rebate adjustments, differences between the estimated and actual product mix subject to rebates, or whether the brand name drug was included in the applicable formulary. The effect of adjustments between estimated and actual manufacturers’ rebate amounts has not been material to the Company’s operating results or financial condition.\nImpairments of Debt Securities\nThe Company regularly reviews its debt securities to determine whether a decline in fair value below the cost basis or carrying value has occurred. If a debt security is in an unrealized loss position and the Company has the intent to sell the security, or it is more likely than not that the Company will have to sell the security before recovery of its amortized cost basis, the amortized cost basis of the security is written down to its fair value and the difference is recognized in net income. If a debt security is in an unrealized loss position and the Company does not have the intent to sell and it is more likely than not that the Company will not have to sell such security before recovery of its amortized cost basis, the Company bifurcates the impairment into credit-related and non-credit related (yield-related) components. The amount of the credit-related component is recorded as an allowance for credit losses and recognized in net income, and the amount of the non-credit related component is included in other comprehensive income (loss). The Company analyzes all facts and circumstances believed to be relevant for each investment when performing this analysis, in accordance with applicable accounting guidance.\nIn evaluating whether a credit related loss exists, the Company considers a variety of factors including: the extent to which the fair value is less than the amortized cost basis; adverse conditions specifically related to the issuer of a security, an industry or geographic area; the payment structure of the security; the failure of the issuer of the security to make scheduled interest or principle payments; and any changes to the rating of the security by a rating agency. \nAmong the factors considered in evaluating whether a decline in fair value below the cost basis or carrying value has occurred are whether the decline results from a change in the quality of the debt security itself, whether the decline results from a downward movement in the market as a whole, and the prospects for realizing the carrying value of the debt security based on the investment’s current and short-term prospects for recovery. For unrealized losses determined to be the result of market conditions (for example, increasing interest rates and volatility due to conditions in the overall market) or industry-related events, the Company determines whether it intends to sell the debt security or if it is more likely than not that the Company will be required to sell the debt security prior to the anticipated recovery of the debt security’s amortized cost basis. If either case is true, the Company recognizes a non-credit related impairment, and the cost basis or carrying amount of the debt security is written down to fair value.\nDuring the years ended December 31, 2024, 2023 and 2022, the Company recorded yield-related impairment losses on debt securities of $73 million, $152 million and $143 million, respectively. During the years ended December 31, 2024, 2023 and 2022, the Company recorded credit-related losses on debt securities of $9 million, $3 million and $13 million, respectively.\nThe risks inherent in assessing the impairment of a debt security include the risk that market factors may differ from projections and the risk that facts and circumstances factored into the Company’s assessment may change with the passage of time. Unexpected changes to market factors and circumstances that were not present in past reporting periods are among the factors that may result in a current period decision to sell debt securities that were not impaired in prior reporting periods.\nInventory\nInventories are valued at the lower of cost or net realizable value using the weighted average cost method.\n95\nThe value of ending inventory is reduced for estimated inventory losses that have occurred during the interim period between physical inventory counts. Physical inventory counts are taken on a regular basis in each retail store and pharmacy, and a continuous cycle count process is the primary procedure used to validate the inventory balances on hand in each distribution center and mail facility to ensure that the amounts reflected in the consolidated financial statements are properly stated. The Company’s accounting for inventory contains uncertainty since management must use judgment to estimate the inventory losses that have occurred during the interim period between physical inventory counts. When estimating these losses, a number of factors are considered which include historical physical inventory results on a location-by-location basis and current physical inventory loss trends.\nThe total reserve for estimated inventory losses covered by this critical accounting policy was $600 million and $607 million as of December 31, 2024 and 2023, respectively. Although management believes there is sufficient current and historical information available to record reasonable estimates for estimated inventory losses, it is possible that actual results could differ. In order to help investors assess the aggregate risk, if any, associated with the inventory-related uncertainties discussed above, a ten percent (10%) pre-tax change in estimated inventory losses, which is a reasonably likely change, would increase or decrease the total reserve for estimated inventory losses by approximately $60 million as of December 31, 2024.\nAlthough management believes that the estimates discussed above are reasonable and the related calculations conform to generally accepted accounting principles, actual results could differ from such estimates, and such differences could be material.\nRecoverability of Long-Lived Assets\nRecoverability of Definite-Lived Assets\nThe Company evaluates the recoverability of long-lived assets, excluding goodwill and indefinite-lived intangible assets, which are tested for impairment using separate tests described below, whenever events or changes in circumstances indicate that the carrying value of such an asset may not be recoverable. The Company groups and evaluates these long-lived assets for impairment at the lowest level at which individual cash flows can be identified. If indicators of impairment are present, the Company first compares the carrying amount of the asset group to the estimated future cash flows associated with the asset group (undiscounted). If the estimated future cash flows used in this analysis are less than the carrying amount of the asset group, an impairment loss calculation is prepared. The impairment loss calculation compares the carrying amount of the asset group to the asset group’s estimated future cash flows (discounted). If required, an impairment loss is recorded for the portion of the asset group’s carrying value that exceeds the asset group’s estimated future cash flows (discounted).\nThe long-lived asset impairment loss calculation contains uncertainty since management must use judgment to estimate each asset group’s future sales, profitability and cash flows. When preparing these estimates, the Company considers historical results and current operating trends and consolidated sales, profitability and cash flow results and forecasts. These estimates can be affected by a number of factors including general economic and regulatory conditions, efforts of third party organizations to reduce their prescription drug costs and/or increased member co-payments, the continued efforts of competitors to gain market share and consumer spending patterns.\nDuring the third quarter of 2024, in connection with its enterprise-wide restructuring plan, the Company completed a strategic review of its retail business, which included evaluating changes in population, consumer buying patterns and future health requirements to ensure continued alignment of its retail footprint with consumer needs. In connection with this initiative, in September 2024, the Company determined it planned to close 271 retail stores in 2025. As a result, management determined that there were indicators of impairment with respect to the impacted stores’ asset groups, including the associated operating or financing lease right-of-use assets and property and equipment. A long-lived asset impairment test was performed during the third quarter of 2024, the results of which indicated that the fair value of certain retail store asset groups were lower than their respective carrying values. Accordingly, in the three months ended September 30, 2024, the Company recorded a store impairment charge of $607 million, consisting of a write down of $483 million related to operating and financing lease right-of-use assets and $124 million related to property and equipment. The charge associated with the store impairments was included in the restructuring charges within the Pharmacy & Consumer Wellness segment.\nRecoverability of Goodwill\nGoodwill represents the excess of amounts paid for acquisitions over the fair value of the net identifiable assets acquired. Goodwill is subject to annual impairment reviews, or more frequent reviews if events or circumstances indicate that the carrying value may not be recoverable. Goodwill is tested for impairment on a reporting unit basis. The impairment test is performed by comparing the reporting unit’s fair value with its net book value (or carrying amount), including goodwill. The \n96\nfair value of the reporting units is estimated using a combination of a discounted cash flow method and a market multiple method. If the net book value (carrying amount) of the reporting unit exceeds its fair value, the reporting unit’s goodwill is considered to be impaired, and an impairment is recognized in an amount equal to the excess.\nThe determination of the fair value of the reporting units requires the Company to make significant assumptions and estimates. These assumptions and estimates primarily include the selection of appropriate peer group companies; control premiums and valuation multiples appropriate for acquisitions in the industries in which the Company competes; discount rates; terminal growth rates; and forecasts of revenue, operating income, depreciation and amortization, income taxes, capital expenditures and future working capital requirements. When determining these assumptions and preparing these estimates, the Company considers each reporting unit’s historical results and current operating trends; consolidated revenues, profitability and cash flow results and forecasts; and industry trends. The Company’s estimates can be affected by a number of factors, including general economic and regulatory conditions; the risk-free interest rate environment; the Company’s market capitalization; efforts of customers and payers to reduce costs, including their prescription drug costs, and/or increase member co-payments; the continued efforts of competitors to gain market share; consumer spending patterns; and the Company’s ability to achieve its revenue growth projections and execute on its cost reduction initiatives. \n2024 Goodwill Impairment Test\nDuring the fourth quarter of 2024, the Company performed its required annual impairment test of goodwill. The results of the impairment tests indicated that there was no impairment of goodwill as of the testing date. The fair values of the reporting units with goodwill exceeded their carrying values by significant margins, with the exception of the Government reporting unit and the Health Care Delivery reporting unit which exceeded their carrying values by approximately 4% and 8%, respectively.\nDuring 2024, the Government reporting unit within the Health Care Benefits segment experienced continued elevated utilization pressure in Medicare and higher than expected acuity following the resumption of member redeterminations in Medicaid, which have resulted in higher medical benefit ratios and lower gross margins than those originally estimated when the prior year annual goodwill impairment test was performed. Upon assessment of the impact of these factors on the Company’s year-to-date 2024 results and its expectations for the full year, the Company determined there were indicators that the Government reporting unit’s goodwill may be impaired, and accordingly, performed an interim goodwill impairment test during the third quarter of 2024. The results of the interim goodwill impairment test showed that the fair value of the Government reporting unit exceeded its carrying value by approximately 10%, therefore there was no impairment of goodwill as of the interim testing date. During the fourth quarter of 2024, the Company updated its budget for 2025 and outlook for future years and performed its annual impairment test of goodwill. The results of the impairment test showed that the fair value of the Government reporting unit exceeded its carrying value by approximately 4%, therefore there was no impairment of goodwill as of the annual testing date.\nAlthough the Company believes the financial projections used to determine the fair value of the Government reporting unit were reasonable and achievable, continued utilization pressure within the Medicare product line and continued higher acuity in Medicaid may affect the Company’s ability to increase operating income in the Government reporting unit at the rate estimated when such goodwill impairment test was performed. Some of the key assumptions included in the Company’s financial projections to determine the estimated fair value of its Government reporting unit include future health care costs, changes in medical membership, revenue growth rates, operating margins and operating expense ratios. The estimated fair value of the Government reporting unit is also dependent on multiples of market participants in the health insurance industry, as well as the risk-free interest rate environment which impacts the discount rate used in the discounted cash flow method. As of December 31, 2024, the goodwill balance in the Government reporting unit was approximately $21.2 billion.\nIn 2023, the Company formed a new Health Care Delivery reporting unit within the Health Services segment. The Health Care Delivery reporting unit is primarily comprised of the Signify Health and Oak Street Health care delivery assets, which were acquired on March 29, 2023 and May 2, 2023, respectively. These transactions were accounted for using the acquisition method of accounting which requires, among other things, the assets acquired and liabilities assumed to be recognized at their fair values at the date of acquisition. Given the close proximity of the acquisition dates to the 2024 annual impairment test of goodwill, as expected, the fair value of these two businesses and, therefore, of the Health Care Delivery reporting unit, remained relatively in line with the carrying value of the reporting unit. This fair value estimate is sensitive to significant assumptions including the revenue growth rate, operating income and the discount rate. As of December 31, 2024, the goodwill balance in the Health Care Delivery reporting unit was $10.4 billion.\n2023 Goodwill Impairment Test\nDuring the fourth quarter of 2023, the Company performed its required annual impairment test of goodwill. The results of the impairment tests indicated that there was no impairment of goodwill as of the testing date. The fair values of the reporting units \n97\nwith goodwill exceeded their carrying values by significant margins, with the exception of the Health Care Delivery reporting unit, which exceeded its carrying value by approximately 9%.\n2022 Goodwill Impairment Test\nDuring the third quarter of 2022, the Company performed its required annual impairment test of goodwill. The results of the impairment tests indicated that there was no impairment of goodwill as of the testing date. The fair values of the reporting units with goodwill exceeded their carrying values by significant margins.\nRecoverability of Indefinite-Lived Intangible Assets\nIndefinite-lived intangible assets are subject to annual impairment reviews, or more frequent reviews if events or circumstances indicate that their carrying value may not be recoverable. Indefinite-lived intangible assets are tested by comparing the estimated fair value of the asset to its carrying value. If the carrying value of the asset exceeds its estimated fair value, an impairment loss is recognized, and the asset is written down to its estimated fair value.\nThe indefinite-lived intangible asset impairment loss calculation contains uncertainty since management must use judgment to estimate fair value based on the assumption that, in lieu of ownership of an intangible asset, the Company would be willing to pay a royalty in order to utilize the benefits of the asset. Fair value is estimated by discounting the hypothetical royalty payments to their present value over the estimated economic life of the asset. These estimates can be affected by a number of factors including general economic conditions, availability of market information and the profitability of the Company. There were no impairment losses recognized on indefinite-lived intangible assets in any of the years ended December 31, 2024, 2023 or 2022.\nHealth Care Benefits’ IBNR Liabilities\nThe Health Care Benefits segment’s health care costs payable include estimates of the ultimate cost of (i) services rendered to the segment’s Insured members but not yet reported to the Company and (ii) claims which have been reported to the Company but not yet paid (collectively, “IBNR”). Health care costs payable also include an estimate of the cost of services that will continue to be rendered after the financial statement date if the Company is obligated to pay for such services in accordance with contractual or regulatory requirements. IBNR estimates are developed using actuarial principles and assumptions that consider numerous factors. See Note 1 ‘‘Significant Accounting Policies’’ included in Item 8 of this 10-K for additional information on the Company’s reserving methodology.\nDuring 2024 and 2023, the segment observed an increase in completion factors relative to those assumed at the prior year end. After considering the claims paid in 2024 and 2023 with dates of service prior to the fourth quarter of the previous year, the segment observed assumed incurred claim weighted average completion factors that were 23 and 4 basis points higher, respectively, than previously estimated, resulting in a decrease of $339 million and $55 million in 2024 and 2023, respectively, in health care costs payable that related to the prior year. The segment has considered the pattern of changes in its completion factors when determining the completion factors used in its estimates of IBNR as of December 31, 2024. However, based on historical claim experience, it is reasonably possible that the estimated weighted average completion factors may vary by plus or minus 9 basis points from the assumed rates, which could impact health care costs payable by approximately plus or minus $202 million pretax.\nAlso, during 2024 and 2023, the Health Care Benefits segment observed that health care costs for claims with claim incurred dates of three months or less before the financial statement date were lower than previously estimated. Specifically, after considering the claims paid in 2024 and 2023 with claim incurred dates for the fourth quarter of the previous year, the segment observed health care costs that were 3.2% and 4.5% lower, respectively, for each fourth quarter than previously estimated, resulting in a reduction of $546 million and $620 million in 2024 and 2023, respectively, in health care costs payable that related to prior year.\nManagement considers historical health care cost trend rates together with its knowledge of recent events that may impact current trends when developing estimates of current health care cost trend rates. When establishing reserves as of December 31, 2024, the segment increased its assumed health care cost trend rates for the most recent three months by 3.4% from health care cost trend rates recently observed. Based on historical claim experience, it is reasonably possible that the segment’s estimated health care cost trend rates may vary by plus or minus 3.5% from the assumed rates, which could impact health care costs payable by plus or minus $808 million pretax.\n98\nNew Accounting Pronouncements\nSee Note 1 ‘‘Significant Accounting Policies’’ included in Item 8 of this 10-K for a description of new accounting pronouncements applicable to the Company.\n99\nTable of Contents",
  "item2": null
}